{
  "title": "Introducing PyMC Labs: Saving the World with Bayesian Modeling",
  "link": "",
  "published": "2021-02-23T10:00:00-05:00",
  "updated": "2021-02-23T10:00:00-05:00",
  "author": {
    "name": "Thomas Wiecki"
  },
  "id": "tag:twiecki.io,2021-02-23:/blog/2021/02/23/intro_pymc_labs/",
  "summary": "<p>After I left Quantopian in 2020, something interesting happened: various companies contacted me inquiring about\nconsulting to help them with their PyMC3 models.</p>\n<p>Usually, I don't hear how people are using <a href=\"https://docs.pymc.io/\">PyMC3</a> -- they mostly show up on\n<a href=\"https://github.com/pymc-devs/pymc3\">GitHub</a> or <a href=\"https://discourse.pymc.io/\">Discourse</a> when something isn't working\nright. So, hearing about all these …</p>",
  "content": "<p>After I left Quantopian in 2020, something interesting happened: various companies contacted me inquiring about\nconsulting to help them with their PyMC3 models.</p>\n<p>Usually, I don't hear how people are using <a href=\"https://docs.pymc.io/\">PyMC3</a> -- they mostly show up on\n<a href=\"https://github.com/pymc-devs/pymc3\">GitHub</a> or <a href=\"https://discourse.pymc.io/\">Discourse</a> when something isn't working\nright. So, hearing about all these really cool projects was quite exciting. However, I couldn't possibly take all of\nthese projects on by myself.</p>\n<p>Thus, it was time to assemble a team of the most badass Bayesian modelers the world had ever seen -- the Bayesian\nAvengers, if you will. Fortunately, I did not have to venture far, as PyMC3 had already attracted exactly these types\nof people.</p>\n<div class=\"text-center py-5\">\n    <iframe src=\"https://giphy.com/embed/5cZbRBLhW4tc4\" width=\"480\" height=\"257\"\n    frameBorder=\"0\" class=\"giphy-embed\" allowFullScreen></iframe>\n</div>\n\n<p>This brings me to the Big Announcement: For the last few months, we have quietly been building\n<a href=\"https://pymc-labs.io\">PyMC Labs</a>, a Bayesian modeling consultancy.\n<a href=\"https://www.pymc-labs.io/team/\">We have an amazing team</a> consisting of three neuroscience PhDs, mathematicians,\nsocial scientists, a SpaceX rocket scientist, and the host of the famous\n<a href=\"https://www.learnbayesstats.com/\">‘Learning Bayesian Statistics’ podcast</a>. All of us are united in our mission:</p>\n<blockquote class=\"blockquote text-center\">\n    <p class=\"mb-0\">Saving the world with Bayesian modeling</p>\n    <footer class=\"blockquote-footer\">Someone famous who 💙 Bayesian stats</footer>\n</blockquote>\n\n<p>Does this sound a bit grandiose? Probably. Is this true? I firmly believe it is. There are so many important problems\nthe world faces today -- from climate change to COVID19, from education to poverty -- and Bayesian modeling can play a\ncritical role in solving these problems. Let me explain why.</p>\n<h2>It is already doing it</h2>\n<p>I would not have imagined it when I started contributing to PyMC, but the science PyMC3 has directly enabled ranges\nfrom <a href=\"https://scholar.google.com/scholar?hl=en&amp;as_sdt=0%2C5&amp;q=pymc3+climate&amp;btnG=\">climate science</a> and biology to\nastronomy and zoology, and everything in between.</p>\n<p>For instance, it was used to predict the spread of COVID19 in a recent\n<a href=\"https://science.sciencemag.org/content/369/6500/eabb9789.full\">Science paper</a>,\nas well as <a href=\"https://rtlive.de/global.html\">track the reproduction factor in real-time</a>.\nIn both cases, the benefit of PyMC3 was its ease-of-use and the ability to integrate scientific domain knowledge and\nget honest uncertainty estimation in a highly volatile and uncertain situation.</p>\n<p>Now I know you’re very observant and I hear you thinking: “wait a minute, those benefits of Bayesian modeling sound\nquite general, so why would they be only valid for epidemiology?”. And indeed they aren’t! For similar benefits,\nPyMC3 is also used to <a href=\"https://github.com/exoplanet-dev/exoplanet\">find planets outside of our solar system</a>\nand <a href=\"https://github.com/hvasbath/beat\">detect earthquakes</a>. One of my coworkers here at PyMC Labs uses it for\n<a href=\"https://share.streamlit.io/alexandorra/pollsposition_website/main/gp-popularity-app.py\">electoral and political forecasting</a>,\nbecause polls are noisy, scarce and need to be completed by domain knowledge -- one of the perfect settings for\nBayesian inference!</p>\n<p>With all of this, at the time of writing, the <a href=\"https://peerj.com/articles/cs-55/\">PyMC3 paper</a> has been cited over 930\ntimes and is in the top 10 most cited articles of the entire PeerJ journal.</p>\n<h2>Solving Business Problems</h2>\n<p>Beyond scientific research, I find that PyMC3 is the perfect tool to also solve various business problems.\nAnd indeed it’s already successfully used in production at companies as big and diverse as SpaceX, Roche,\nNetflix, Deliveroo and HelloFresh.</p>\n<p>This diversity means that the <a href=\"https://www.pymc-labs.io/clients/\">PyMC Labs team intervenes</a> to, for instance,\n<a href=\"https://support.everysk.com/hc/en-us/articles/1500001040721-Private-Investments\">build complex models from the latest finance research</a>;\noptimize supply chains for food delivery; build software from top to bottom for pharmaceutical applications;\nspeed up and extend models for the farm tech industry; train and enhance any data science team’s Bayesian stats\ncapacities, etc.</p>\n<h2>Prediction vs Inference</h2>\n<p>As data science has exploded in the last decade I have always been surprised by the over-emphasis on prediction-focused\nmachine learning. For far too long, it has been hailed as the solution to most of our data science problems.</p>\n<p>I believe that the potential of this is way overblown. Not because it doesn't work -- algorithms like deep nets or\nrandom forests are extremely powerful at extracting non-linear predictive patterns from large data sets -- but rather\nbecause most data science problems are not simple <em>prediction</em> but rather <em>inference</em> problems.</p>\n<p>In addition, we often already have a lot of knowledge about our problem: knowledge of certain structure in our data\nset (like nested data, that some variables relate to some but not other parameters) and knowledge of which range of\nvalues we expect certain parameters of our model to fall into. Prediction-focused ML does not allow us to include any\nof this information, that's why it requires so much data.</p>\n<p>With Bayesian statistics, we don't have to learn everything from data as we translate this knowledge into a custom model.\nThus, rather than changing our problem to fit the solution, as is common with ML, we can tailor the solution to best\nsolve the problem at hand. I like to compare this with Playmobil vs Lego:</p>\n<p><img alt=\"\" src=\"https://www.pymc-labs.io/blog-posts/saving-the-world/playlego.jpeg\"></p>\n<p>Playmobil just gives you a single toy you can't change while Lego (i.e Bayes here) gives you building blocks to build\nthe toy you actually want. In Bayesian modeling, these building blocks are probability distributions.</p>\n<p>But how do you do this in practice? This is where PyMC3 comes in, as it allows you to specify your models as Python\ncode and automatically estimate it without requiring manual mathematical derivations. Due to recent theoretical and\ntechnological advances, this also runs quickly and scales to complex models on large(ish) data sets.</p>\n<h2>Serving our mission</h2>\n<p>So how do we best make progress on our mission?</p>\n<p>First, we will continue to make PyMC3 the best, most user-friendly and scalable Bayesian modeling package out there.\nWe are well set up to do this, having a friendly API, a huge user-base, and a large developer team of over 20 active\nmembers. With our renewed focus on\n<a href=\"https://pymc-devs.medium.com/the-future-of-pymc3-or-theano-is-dead-long-live-theano-d8005f8a0e9b\">PyMC3 on Theano with a JAX backend</a>\nall our resources will go towards this goal.</p>\n<p>Second, our new PyMC consultancy will support this endeavour. It allows us to directly help clients use these powerful,\ncustomizable methods to solve their business problems, thereby increasing adoption and recognition.\nAs a great side effect, these client projects also help us find things that need to be fixed, improved or optimized\nin PyMC3, thereby lifting all (Bayesian) boats instead of just the happy fews’.</p>\n<p>So far, this has been an incredibly rewarding and exhilarating journey. Even though it is still early, we are learning\na lot about which areas Bayesian modeling is particularly well suited for but also what would make PyMC3 even better.\nWithout spoiling a future blog post that will go into more detail about what we have learned applying these methods,\nthe best use-cases include (but aren’t limited to) <strong>incorporating domain knowledge, building bespoke models and\nquantifying uncertainty around estimates</strong>.</p>\n<p><em>Sounds familiar? If you or your company has a problem for which prediction-based ML is not a good fit, I'd love to talk\nto you at <a href=\"mailto:thomas.wiecki@pymc-labs.io\">thomas.wiecki@pymc-labs.io</a>. This is just the beginning and\nI hope you will join us on this marvelous journey.</em></p>",
  "category": ""
}