{
  "title": "Engineers Make Green Hydrogen From Air",
  "link": "https://spectrum.ieee.org/engineers-make-green-hydrogen-from-air",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/numerous-floating-pairs-of-connected-spheres.jpg?id=31658114&width=1200&height=800&coordinates=0%2C104%2C0%2C105\"/><br/><br/><p><strong>The most sustainable</strong> way to make hydrogen fuel is to split water using renewable electricity—but that requires access to freshwater. Now, researchers have reported a way to make hydrogen fuel from just humidity in the air. </p><p>Their electrolyzer extracts moisture from air and splits it via renewably powered electrolysis to create hydrogen. It is the first such electrolyzer to produce high purity (99 percent) hydrogen from air that has as little as 4 percent humidity, says <a href=\"https://twitter.com/kevinli06613844?lang=en\" target=\"_blank\">Gang Kevin Li</a>, a professor of chemical engineering at the <a href=\"https://www.unimelb.edu.au/\" target=\"_blank\">University of Melbourne</a>, in Australia. The success could open up the possibility of producing hydrogen in semi-arid regions, which also have some of the highest solar- and wind-power potential. </p><p>Tests of the prototype direct-air electrolyzer over 12 consecutive days showed that it could produce almost 750 liters of hydrogen a day on average per square meter of electrolyzer. Li and his colleagues reported the details in the journal <em><a href=\"https://www.nature.com/articles/s41467-022-32652-y\" rel=\"noopener noreferrer\" target=\"_blank\">Nature Communications</a></em>. </p><p>Hydrogen offers the prospect of clean, emission-free energy, and the hydrogen economy has gathered steam in the past few years due to <a href=\"https://spectrum.ieee.org/hydrogen-economy-inflation-reduction-act\" target=\"_blank\">increases in funding and improvements in technology</a>. But most of the hydrogen around the world today is still produced from natural gas or coal. Green hydrogen from electrolysis is still a nascent technology because of the need for electrolyzers on a large scale. </p><p>Many teams are working on alternative ways to make green hydrogen. <a href=\"https://spectrum.ieee.org/artificial-leaf-hydrogen-syngas\" target=\"_self\">Solar-powered water-splitting</a> devices, for example, use photocatalysts, which absorb sunlight to split water into hydrogen and oxygen but have a low <a href=\"https://spectrum.ieee.org/solar-hydrogen-converter-outlasts-next-best-by-14x\" target=\"_self\">solar-to-hydrogen efficiency</a> of only 1 percent. To overcome the need for freshwater, there have been attempts to produce hydrogen from saline and brackish waters, but the devices have to deal with contamination and chlorine as a by-product.</p><p>Li and his colleagues decided to use moisture in the air as the water source. Globally, there are nearly 13 trillion tonnes of water in the air at any moment, they say, and even dry environments such as the expansive <a href=\"https://en.wikipedia.org/wiki/Sahel\" target=\"_blank\">Sahel region</a> in Africa have an average relative humidity of 20 percent.</p><p>To tap into that humidity, the researchers soaked a sponge or foam with a water-absorbing electrolyte liquid, and sandwich it between two electrodes. “Water extracted by the electrolyte is spontaneously transported to the electrodes by capillary force and electrolyzed into hydrogen at the cathode and oxygen at the anode,” Li explains. “The whole process is passive, and no moving parts or mechanics are involved.”</p><p>The researchers demonstrated the use of both solar panels or a small wind turbine to power the module. They tested the prototype both indoors and outdoors in the hot, dry Melbourne summer. The solar-to-hydrogen efficiency of the device is over 15 percent, Li says.</p><p><br/></p><div class=\"rm-embed embed-media\"><script src=\"https://cdn.jwplayer.com/players/8q1bDOsY-5Zdv3OJ1.js\"></script></div><p><br/></p><p>For the outdoor tests, they connected five electrolyzers in parallel, which, powered by the sun, produced 745 L of hydrogen per square meter a day, enough to heat a home. They also let the prototype run by itself for eight months to showcase durability.</p><p>The prototype is only a few square centimeters in area right now. But over the next year, with funding from investors, the team plans to make larger electrolyzers, with electrode areas of 10 square meters, Li says. They are also improving the electrolyte recipe to further increase the energy efficiency and output, he says. </p><p>Both efficiency and output should not be affected when the device is scaled up. But the main challenge the team faces is to find the right materials for the electrolyzer, he says. “How can we make it cheaper and better?”</p><p><em>This article appears in the November 2022 print issue as “Pulling Fuel Out of Thin Air.”</em></p>",
  "pubDate": "Mon, 12 Sep 2022 17:00:00 +0000",
  "guid": "https://spectrum.ieee.org/engineers-make-green-hydrogen-from-air",
  "category": [
    "Green hydrogen",
    "Power",
    "Solar power",
    "Wind power"
  ],
  "dc:creator": "Prachi Patel",
  "media:content": ""
}