{
  "title": "Voters expect Republicans to impeach Biden – poll",
  "link": "https://www.rt.com/news/565917-poll-us-voters-expect-biden-impeachment/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565917-poll-us-voters-expect-biden-impeachment/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636408e485f5404eeb7b6277.jpg\" /> US voters expect lawmakers to impeach President Joe Biden if Republicans win back control of Congress in the midterm elections <br/><a href=\"https://www.rt.com/news/565917-poll-us-voters-expect-biden-impeachment/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>One in five Americans believe it is \"very likely\" the GOP will indict the president if it wins control of Congress</strong></p>\n            \n                        \n            <p>Most voters expect US President Joe Biden to face impeachment proceedings if the Republicans win back control of Congress in next week&rsquo;s midterm elections, a new poll has revealed.</p>\n<p>The Rasmussen Reports poll, which was released on Thursday, showed that 54% of likely voters believe a Republican-controlled House of Representatives would impeach Biden. More than one in five, or 22%, see that outcome as <em>&ldquo;very likely.&rdquo;</em> By comparison, 32% of respondents said they don&rsquo;t think impeachment is likely, including 12% who see it as <em>&ldquo;not at all likely.&rdquo;</em> About 13% of voters are unsure.</p>\n<p>The findings come less than one week before the November 8 midterms, in which Biden&rsquo;s Democratic Party is forecast to lose control of the House and possibly the Senate. Republicans are far more enthusiastic than Democrats about voting in the midterms &ndash; by a margin of 38% to 24% &ndash; and the GOP has a 51-47 lead when voters are asked which party&rsquo;s candidate they will support in their congressional district, according to a <a href=\"https://www.cnn.com/2022/11/02/politics/cnn-poll-gop-congressional-election/index.html\" target=\"_blank\" rel=\"noopener noreferrer\">CNN poll</a> released on Wednesday.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363f80f20302730c371f458.jpg\" alt=\"Joe Biden speaks ahead of the 2022 midterm elections at Union Station in Washington, DC, November 2, 2022\" />\n            <figcaption><a href=\"https://www.rt.com/news/565909-biden-election-economy-poll/\">Pre-election poll shows Democrats failing</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>While the latest Rasmussen poll showed that voters largely expect Biden to be impeached, an earlier survey by the researcher showed that most Americans also want the president to be ousted. A <a href=\"https://www.rasmussenreports.com/public_content/politics/biden_administration/impeach_biden_most_gop_independent_voters_say_yes\" target=\"_blank\" rel=\"noopener noreferrer\">Rasmussen poll</a> conducted in September found that 52% of voters believe Biden should be impeached, compared with 42% who are opposed to impeachment.</p>\n<p>Even if a Republican-controlled House voted to impeach Biden, the president wouldn&rsquo;t likely be forced from office. The Constitution requires at least a two-thirds majority of the Senate to vote in favor of conviction for a president to be removed.</p>\n<p>However, impeachment proceedings would likely undermine Biden&rsquo;s policy agenda and would give Republicans opportunities to score political points. If victorious in the midterms, the GOP also could argue that it has a mandate to pursue impeachment because, as the Rasmussen poll showed, that&rsquo;s what Americans expected to get when they voted for Republican candidates.</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/565076-politico-ukraine-aid-midterms/\">\n            <span>READ MORE: </span>US election outcome threatens Ukraine aid – Politico\n        </a>\n    </p>\n\n    \n\n<p>Then-President Donald Trump was twice impeached by the Democrat-controlled House during his term. The Senate voted 52-48 to acquit him in 2020. House prosecutors fell ten Senate votes short of the two-thirds majority needed to convict Trump in 2021.</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 18:41:22 +0000",
  "dc:creator": "RT"
}