{
  "id": "yt:video:bW9aRVXIwaY",
  "yt:videoId": "bW9aRVXIwaY",
  "yt:channelId": "UCjmJDM5pRKbUlVIzDYYWb6g",
  "title": "Don't Worry Darling | Official Trailer #2",
  "link": "",
  "author": {
    "name": "Warner Bros. Pictures",
    "uri": "https://www.youtube.com/channel/UCjmJDM5pRKbUlVIzDYYWb6g"
  },
  "published": "2022-07-21T17:00:32+00:00",
  "updated": "2022-08-19T15:46:39+00:00",
  "media:group": {
    "media:title": "Don't Worry Darling | Official Trailer #2",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Are you ready to live the life you deserve? \n#DontWorryDarling \nOnly in theaters September 23.\n\nFrom New Line Cinema comes “Don’t Worry Darling,” directed by Olivia Wilde (“Booksmart”) and starring Florence Pugh (Oscar-nominated for “Little Women”), Harry Styles (“Dunkirk”), Wilde (upcoming “Babylon”), Gemma Chan (“Crazy Rich Asians”), KiKi Layne (“The Old Guard”) and Chris Pine (“All the Old Knives”). \n\nAlice (Pugh) and Jack (Styles) are lucky to be living in the idealized community of Victory, the experimental company town housing the men who work for the top-secret Victory Project and their families. The 1950’s societal optimism espoused by their CEO, Frank (Pine)—equal parts corporate visionary and motivational life coach—anchors every aspect of daily life in the tight-knit desert utopia.\n\nWhile the husbands spend every day inside the Victory Project Headquarters, working on the “development of progressive materials,” their wives—including Frank’s elegant partner, Shelley (Chan)—get to spend their time enjoying the beauty, luxury and debauchery of their community. Life is perfect, with every resident’s needs met by the company. All they ask in return is discretion and unquestioning commitment to the Victory cause.\n\nBut when cracks in their idyllic life begin to appear, exposing flashes of something much more sinister lurking beneath the attractive façade, Alice can’t help questioning exactly what they’re doing in Victory, and why. Just how much is Alice willing to lose to expose what’s really going on in this paradise?\n\nAn audacious, twisted and visually stunning psychological thriller, “Don’t Worry Darling” is a powerhouse feature from director Olivia Wilde that boasts intoxicating performances from Florence Pugh and Harry Styles, surrounded by the impressive and pitch-perfect cast.\n\nThe film also stars Nick Kroll (“How It Ends”), Sydney Chandler (“Pistol”), Kate Berlant (“Once Upon a Time… In Hollywood”), Asif Ali (“WandaVision”), Douglas Smith (“Big Little Lies”), Timothy Simons (“Veep”) and Ari’el Stachel (upcoming “Respect the Jux”).\n\nWilde directs from a screenplay penned by her “Booksmart” writer Katie Silberman, based on a story by Carey Van Dyke & Shane Van Dyke (“Chernobyl Diaries”) and Silberman. The film is produced by Wilde, Silberman, Miri Yoon and Roy Lee, with Richard Brener, Celia Khong, Alex G. Scott, Catherine Hardwicke, Carey Van Dyke and Shane Van Dyke executive producing.\n\nWilde is joined behind the camera by two-time Oscar-nominated director of photography Matthew Libatique (“A Star Is Born,” “Black Swan”), production designer Katie Byron (“Booksmart”), editor Affonso Gonçalves (“The Lost Daughter”), Oscar-nominated composer John Powell (“Jason Bourne”), music supervisor Randall Poster (“No Time to Die”) and costume designer Arianne Phillips (“Once Upon a Time… In Hollywood”).\n\nA New Line Cinema presentation, “Don’t Worry Darling” will be distributed worldwide by Warner Bros. Pictures and is set to open in theaters in North America on September 23, 2022 and internationally beginning 21 September 2022.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}