{
  "title": "In Xinjiang, a scramble to contain COVID",
  "description": "Satellite images and leaked videos suggest officials have struggled to contain infections.",
  "link": "https://www.rfa.org/english/news/uyghur/xinjiang-covid-11042022154717.html",
  "guid": "https://www.rfa.org/english/news/uyghur/xinjiang-covid-11042022154717.html",
  "author": "By RFA Uyghur",
  "media:content": {
    "media:description": "This quarantine facility is located on the outskirts of Xinjiang’s second-largest city, Korla. Based on satellite imagery analyzed by RFA, construction began between Sept. 15 and Sept. 20, 2022.",
    "media:credit": "Credit: Screenshot from citizen journalist video"
  },
  "content:encoded": "\n        <p><span>Images taken from videos obtained by RFA Uyghur Service, show a new, prefabricated quarantine facility in Xinjiang in China’s west. <u><a href=\"https://wjw.xinjiang.gov.cn/hfpc/tzgg/202211/8a774377718a4eaa80d545bf4b5df3fc.shtml\">Official figures</a></u> released by the government indicate only a couple of dozen new, symptomatic cases each day in the region, which has a population of nearly 26 million. </span></p>\n<p><span>But the construction of the facility, along with a slew of videos from the region posted on social media, suggest a broader outbreak.</span></p>\n<p><span>In the video below, for example, an animated Ma Zhijun, the Chinese Communist Party secretary in Urumqi, Xinjiang’s capital, orders officials to send people who test positive for the virus and anyone they had contact with into quarantine.</span></p>\n<p><span>\"Tonight the venues that have water, electricity and heat are all fine,” Ma Zhijun says in the video, which was posted to Twitter and YouTube on Oct. 20. “There’s not any limitation on the conditions.”</span></p>\n<p><span>He says he was acting on behalf of Xinjiang Communist Party Secretary Ma Xingrui, who at the time was in Beijing for China’s 20<sup>th</sup> party congress, an event that was closely watched around the world. An outbreak may have embarrassed President Xi Jinping who continued to promote his zero-COVID policy as he was granted a <u><a href=\"https://www.rfa.org/english/news/china/china-congress-10232022161016.html\">precedent-breaking third term</a></u> as party leader.</span></p>\n<p><span>RFA was unable to independently verify the authenticity of the videos.  </span></p>\n<p></p><div class=\"videoWrapper\">\n<iframe itemprop=\"video\" src=\"https://cdnapisec.kaltura.com/p/1251832/sp/125183200/embedIframeJs/uiconf_id/33053471/partner_id/1251832?iframeembed=true&playerId=kaltura_player&entry_id=1_e3101fnl&flashvars[streamerType]=auto\"></iframe>\n</div>\n<p><span>Furtively shot clips have also surfaced online offering additional evidence of a rushed response to contain an outbreak.</span></p>\n<p><span>The video below shows a quick scan of a dirty floor in what a woman’s voice describes as a middle school that had been turned into a makeshift quarantine facility.</span></p>\n<p><span>“It has been three days already,” she says. “They have not given us any nuclei test. They bring food, shut the door and leave. Look at this filthy restroom.”</span></p>\n<p><span><div class=\"videoWrapper\">\n<iframe itemprop=\"video\" src=\"https://cdnapisec.kaltura.com/p/1251832/sp/125183200/embedIframeJs/uiconf_id/33053471/partner_id/1251832?iframeembed=true&playerId=kaltura_player&entry_id=1_fmfsq16x&flashvars[streamerType]=auto\"></iframe>\n</div></span></p>\n<p><span>The following 15-second clip — uploaded onto Chinese social media app Duoyin after the clip of the secretary leaked — suggests rough quarantine conditions weren’t isolated. It shows at least nine people lying on the floor of what appears to be a bathroom.</span></p>\n<p><span>The video was harvested online by <u><a href=\"https://www.rfa.org/english/news/uyghur/interview-inmate-09242019174449.html\">Zumret Dawut</a></u>, a Uyghur exile in the United States and activist who was imprisoned in a camp in Xinjiang, before it was removed from the app.</span></p>\n<p><span></span><span><div class=\"videoWrapper\">\n<iframe itemprop=\"video\" src=\"https://cdnapisec.kaltura.com/p/1251832/sp/125183200/embedIframeJs/uiconf_id/33053471/partner_id/1251832?iframeembed=true&playerId=kaltura_player&entry_id=1_w880rfr3&flashvars[streamerType]=auto\"></iframe>\n</div></span></p>\n<p><span>A fourth video obtained by RFA shows a man passing his camera over a large room in what he says is a local energy company’s building. He estimates there are as many as 1,000 people, which the clip shows are packed closely together on cots.</span></p>\n<p><span>“No medicine is given out here,” he says.</span></p>\n<p><span><div class=\"videoWrapper\">\n<iframe itemprop=\"video\" src=\"https://cdnapisec.kaltura.com/p/1251832/sp/125183200/embedIframeJs/uiconf_id/33053471/partner_id/1251832?iframeembed=true&playerId=kaltura_player&entry_id=1_i90pqyrd&flashvars[streamerType]=auto\"></iframe>\n</div></span><span></span></p>\n<p><span>China’s strategy for containing COVID has led to complaints of harsh treatment across the country, including in Shanghai, where after weeks of being confined to their homes, residents in April shouted out of their windows and <u><a href=\"https://www.bbc.com/news/av/world-asia-china-61270616\">banged pots in protest</a></u>.</span></p>\n<p><span>Last month, <u><a href=\"https://www.rfa.org/english/news/tibet/lhasa-10272022165739.html\">demonstrations in Tibet</a></u> of Han Chinese migrants and native Tibetans over a lockdown resulted in Chinese authorities allowing the migrants to return to their homes. RFA <u><a href=\"https://www.rfa.org/english/news/tibet/tibet-detentions-11032022151829.html\">reported </a></u>that Chinese authorities detained around 200 Lhasa residents in the wake of the protest in the Tibetan regional capital.</span></p>\n<p><span>In Xinjiang, Chinese officials imposed strict lockdowns in August and September. <u><a href=\"https://www.rfa.org/english/news/uyghur/hundreds-detained-09132022165944.html\">RFA reported</a></u> that 600 Uyghurs from a village in Ghulja in the northern part of Xinjiang were detained after they protested a lockdown that, according to some locals, had resulted in the deaths from starvation of as many as a dozen residents.</span></p>\n<p><span>Uyghurs and other Turkic minorities in the region have also been subjected to a years-long crackdown as part of a broad “anti-terrorism” campaign. <u><a href=\"https://www.ohchr.org/sites/default/files/documents/countries/2022-08-31/22-08-31-final-assesment.pdf\">A U.N. report </a></u>in August said China’s effort to Sinicize the region has included human rights abuses and potential crimes against humanity. China denounced the report, which it said was the result of pressure from western governments.</span></p>\n<p><span>Prior to the September protest, state-run Xinjiang TV had warned residents that they would be arrested for separatism, a charge often used to detain Uyghurs, if they “spread rumors” about a COVID outbreak in the area.</span><span></span></p>\n        ",
  "pubDate": "Fri, 04 Nov 2022 16:16:00 -0400"
}