{
  "title": "Google Translate learns 24 new languages",
  "link": "https://blog.google/products/translate/24-new-languages/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"4uazy\">For years, Google Translate has helped break down language barriers and connect communities all over the world. And we want to make this possible for even more people — especially those whose languages aren’t represented in most technology. So today we’ve added 24 languages to Translate, now supporting a total of 133 used around the globe.</p><p data-block-key=\"adr67\">Over 300 million people speak these newly added languages — like Mizo, used by around 800,000 people in the far northeast of India, and Lingala, used by over 45 million people across Central Africa. As part of this update, Indigenous languages of the Americas (Quechua, Guarani and Aymara) and an English dialect (Sierra Leonean Krio) have also been added to Translate for the first time.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image__is-caption h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt='The Google Translate bar translates the phrase \"Our mission: to enable everyone, everywhere to understand the world and express themselves across languages\" into different languages.' class=\"article-image--full\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/Translate_New-Languages.gif \" tabindex=\"0\"/></a></div><figcaption class=\"article-image__caption article-image__is-caption-image h-c-grid__col--8 h-c-grid__col--offset-2 h-c-grid__col-l--6 h-c-grid__col-l--offset-3\"><div class=\"rich-text\"><p data-block-key=\"d1el0\">Translate's mission translated into some of our newly added languages</p></div></figcaption></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"4uazy\">Here’s a complete list of the new languages now available in Google Translate:</p><ul><li data-block-key=\"f6knl\"><b>Assamese</b>, used by about 25 million people in Northeast India</li><li data-block-key=\"dau5c\"><b>Aymara</b>, used by about two million people in Bolivia, Chile and Peru</li><li data-block-key=\"64os2\"><b>Bambara</b>, used by about 14 million people in Mali</li><li data-block-key=\"c3iis\"><b>Bhojpuri</b>, used by about 50 million people in northern India, Nepal and Fiji</li><li data-block-key=\"2dfs5\"><b>Dhivehi</b>, used by about 300,000 people in the Maldives</li><li data-block-key=\"fb4fc\"><b>Dogri</b>, used by about three million people in northern India</li><li data-block-key=\"9tr4g\"><b>Ewe</b>, used by about seven million people in Ghana and Togo</li><li data-block-key=\"2pcs4\"><b>Guarani</b>, used by about seven million people in Paraguay and Bolivia, Argentina and Brazil</li><li data-block-key=\"anklc\"><b>Ilocano</b>, used by about 10 million people in northern Philippines</li><li data-block-key=\"5kv0r\"><b>Konkani</b>, used by about two million people in Central India</li><li data-block-key=\"3lquf\"><b>Krio</b>, used by about four million people in Sierra Leone</li><li data-block-key=\"b6k5n\"><b>Kurdish (Sorani)</b>, used by about 15 million people in Iraq and Iran</li><li data-block-key=\"14aq9\"><b>Lingala</b>, used by about 45 million people in the Democratic Republic of the Congo, Republic of the Congo, Central African Republic, Angola and the Republic of South Sudan</li><li data-block-key=\"83bb\"><b>Luganda</b>, used by about 20 million people in Uganda and Rwanda</li><li data-block-key=\"a831f\"><b>Maithili</b>, used by about 34 million people in northern India</li><li data-block-key=\"f1cj\"><b>Meiteilon (Manipuri)</b>, used by about two million people in Northeast India</li><li data-block-key=\"hld5\"><b>Mizo</b>, used by about 830,000 people in Northeast India</li><li data-block-key=\"g5d6\"><b>Oromo</b>, used by about 37 million people in Ethiopia and Kenya</li><li data-block-key=\"3ia76\"><b>Quechua</b>, used by about 10 million people in Peru, Bolivia, Ecuador and surrounding countries</li><li data-block-key=\"eqcsd\"><b>Sanskrit</b>, used by about 20,000 people in India</li><li data-block-key=\"5udlv\"><b>Sepedi</b>, used by about 14 million people in South Africa</li><li data-block-key=\"2clhp\"><b>Tigrinya</b>, used by about eight million people in Eritrea and Ethiopia</li><li data-block-key=\"75crg\"><b>Tsonga</b>, used by about seven million people in Eswatini, Mozambique, South Africa and Zimbabwe</li><li data-block-key=\"2nn1f\"><b>Twi</b>, used by about 11 million people in Ghana</li></ul><p data-block-key=\"ftfro\">This is also a technical milestone for Google Translate. These are the first languages we’ve added using Zero-Shot Machine Translation, where a machine learning model only sees monolingual text — meaning, it learns to translate into another language without ever seeing an example. While this technology is impressive, it isn't perfect. And we’ll keep improving these models to deliver the same experience you’re used to with a Spanish or German translation, for example. If you want to dig into the technical details, check out our <a href=\"http://ai.googleblog.com/2022/05/24-new-languages-google-translate.html\">Google AI blog post</a> and <a href=\"https://arxiv.org/pdf/2205.03983.pdf\">research paper</a>.</p><p data-block-key=\"elebt\">We’re grateful to the many native speakers, professors and linguists who worked with us on this latest update and kept us inspired with their passion and enthusiasm. If you want to help us support your language in a future update, contribute evaluations or translations through <a href=\"https://support.google.com/translate/answer/2534530?hl=en\">Translate Contribute</a>.</p></div></div></body></html>",
  "pubDate": "Wed, 11 May 2022 17:16:00 +0000",
  "guid": "https://blog.google/products/translate/24-new-languages/",
  "category": [
    "Translate",
    "Next Billion Users",
    "Diversity and Inclusion",
    "AI"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Google Translate learns 24 new languages",
    "description": "Google Translate adds 24 new languages, including Indigenous languages of the Americas and languages from around Africa and India.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/io_2022_heroes_translate-11.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://blog.google/products/translate/24-new-languages/"
  },
  "author": {
    "name": "Isaac Caswell",
    "title": "Senior Software Engineer, Google Translate",
    "department": "",
    "company": ""
  }
}