{
  "title": "The “last mile” from credentials to employment",
  "link": "https://news.mit.edu/2022/last-mile-credentials-employment-1103",
  "description": "Digital Credentials Consortium’s new report explores barriers to adoption.",
  "pubDate": "Thu, 03 Nov 2022 10:45:00 -0400",
  "guid": "https://news.mit.edu/2022/last-mile-credentials-employment-1103",
  "dc:creator": "MIT Open Learning",
  "content:encoded": "<p>Academic digital credentials — the cryptographically verifiable assertion that an individual holds a degree, certificate, or other credential — have been available for the better part of a decade. Yet despite the potential value of these data-rich, transportable credentials to graduates, employers, and academic institutions, digital credentials have by no means become the standard in presenting or verifying skills and qualifications.</p>\n\n<p>A <a href=\"https://digitalcredentials.mit.edu/docs/Credentials-to-Employment-The-Last-Mile.pdf\">new report</a> from the <a href=\"https://digitalcredentials.mit.edu/\">Digital Credentials Consortium</a> (DCC), housed at MIT Open Learning, explores this gap between the promise of digital credentials and their widespread adoption.</p>\n\n<p>Digital credentials in education include those issued by universities and professional training providers (MIT has offered <a href=\"https://registrar.mit.edu/transcripts-records/diplomas/digital-diplomas\">digital diplomas</a> since 2017, for example), and microcredentials from online course providers. The researchers note that widespread adoption of digital credentials would improve both workers’ and employers’ agility in responding to changing workforce needs. Currently, employers view digital credentials on a resume as a value-add, but there is no standardized approach to issuing, storing, verifying, or submitting them in the job application process.</p>\n\n<p>Through semi-structured interviews with leading experts and decision-makers in North America and Europe, desk research, and expert analysis, the researchers set out to map the ecosystem of stakeholders and better understand the barriers to using digital academic credentials in the “last mile” of education-to-employment pathways.</p>\n\n<p>“There’s a lot of interest in the potential of digital credentials to improve the way we design education programs, manage hiring processes, and support employees throughout their careers,” says principal investigator Philipp Schmidt, an MIT research scientist and director of the DCC. “In this report we tried to lay out a few concrete strategies to address the existing barriers that limit uptake of this technology.”</p>\n\n<p>“Digital credentials have the potential to connect skilled workers with jobs, but given their complexity, we need to determine how to bring educators, employers, and governments together to accelerate adoption,” adds Sean Murphy, a director of opportunity at Walmart, which funded the report. “The technology can create more equitable pathways for workers entering the workforce and upskilling, and the Last Mile report lays out a clear set of recommendations on how to address remaining barriers to adoption.”</p>\n\n<p><strong>Key findings: Navigating complex needs and expectations</strong></p>\n\n<p>The researchers conducted interviews with over 20 experts from universities, corporations, nonprofits, and consultancies with diverse perspectives on education and training, human resources and career development, and corporate technology and innovation. Across the board, the panelists agreed that the landscape of stakeholders is too complex to sort into simple categories. Dividing stakeholders into issuers, holders, and validators or educational institutions, learners, and employers does not adequately reflect the reality of the ecosystem. Each of these groups is highly diverse, and different sub-groups have different relationships with credentials. They often will not face the same problems or require the same solutions.</p>\n\n<p>With that in mind, the researchers worked to identify baseline sets of challenges to widespread adoption across different sectors. These include:</p>\n\n<ul>\n\t<li>Employers need evidence that the credentials can be used to identify and match skills to jobs.</li>\n\t<li>A gap in what current credentials on the market can say about their holders and the information employers are looking for to improve their hiring and career development decisions, needs to be closed.</li>\n\t<li>More detailed information, some of which institutions already track and store internally, needs to be included in credentials.</li>\n\t<li>Employers need reasonable belief that a plurality of job candidates will hold digital credentials in the near future.&nbsp;</li>\n</ul>\n\n<p>From an employer perspective, the main use case for digital credentials is matching applicants’ job skills to open positions. Employers envision analyzing applicants’ skills and widening access to talent by data-mining credential databases. However, there is very little implementation of systems that use digital credentials this way; there’s a disconnect between the value digital credentials provide today and employers’ expectations for skills-based hiring.</p>\n\n<p>Employers use different trust models when evaluating applicants, relying on proxies such as accreditation bodies, ranking lists, or social mechanisms. Resumes are still the lingua franca of most human resource processes. Shifting to digital credentials would not replace the resume, but would make the information in resumes more easily verifiable, and give applicants new ways of extending their employment profiles.</p>\n\n<p>Skill-based hiring is held back by a lack of coordination among different stakeholder groups — education, standardization, human resources, and technology startups are separate communities that only sometimes overlap. This makes it harder to take a coordinated, integrated approach toward adoption of digital credential technologies. For example, digital credentials would need to be integrated into existing human-resource management systems (HRMS). Until institutions issue these verifiable digital credentials at scale, or employers demand them from their applicants, HRMS vendors lack incentives to invest in upgrading their technology to support them.</p>\n\n<p><strong>Recommendations and next steps</strong></p>\n\n<p>So what would incentivize better coordination, improved integration, and greater adoption of digital credentials so that they could actually achieve their potential in matching skilled workers with jobs?</p>\n\n<p>The report identifies a number of strategies to accelerate the adoption of digital credentials. These include academic institutions issuing traditional credentials (diplomas, certificates, transcripts) in digital formats, and developing partnerships with employers to design new types of credentials that better represent an individual’s skills, competencies, and abilities. The researchers offer tailored recommendations for different stakeholder groups — issuers, employers, governments, and trust providers — as well as for joint action.</p>\n\n<p>Perhaps most urgent is the researchers’ call for stakeholders to collaborate on a shared vision and roadmap for an integrated skills system. Working together, they could create mechanisms to coordinate the development of the sector in an integrated way.</p>\n\n<p>The Digital Credentials Consortium continues to turn the recommendations from the report into practice. MIT and Walmart entered into a new grant agreement in October 2022, extending the analysis of the Last Mile report through the development of a roadmap aimed at addressing the barriers to widespread adoption.&nbsp;&nbsp;</p>",
  "media:content": {
    "media:description": "Employers view digital credentials on a resume as a value-add, but there is no standardized approach to issuing, storing, verifying, or submitting them in the job application process."
  },
  "category": [
    "Labor and Jobs",
    "Education, teaching, academics",
    "Learning",
    "Digital technology",
    "Cryptography",
    "Software",
    "Apps",
    "Careers",
    "Online learning",
    "Business and management",
    "Government",
    "Collaboration",
    "Infrastructure",
    "Logistics",
    "Research",
    "Technology and society",
    "Office of Open Learning"
  ]
}