{
  "title": "Ohio Lawmakers Seek Strict Rules for “Clean Energy” Lending",
  "link": "https://www.propublica.org/article/pace-loans-ohio-rules-consumer-protections",
  "pubDate": "Wed, 02 Nov 2022 05:00:00 -0400",
  "guid": "https://www.propublica.org/article/pace-loans-ohio-rules-consumer-protections",
  "description": "\n                <p class=\"byline\">\n                by <a class=\"name\" href=\"https://www.propublica.org/people/jeremy-kohler\">Jeremy Kohler</a>                </p>\n                                             \n\n                                                                    \n            \n                <p>ProPublica is a nonprofit newsroom that investigates abuses of power. <a href=\"https://www.propublica.org/newsletters/dispatches?source=54G&placement=top-note&region=local\">Sign up for Dispatches</a>, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.</p>\n\n            \n\n                \n\n      \n  \n\n\n\n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.0\">Ohio lawmakers this fall will <a href=\"https://www.ohiohouse.gov/legislation/134/hb646\">consider adding consumer protections</a> to “clean energy” lending programs, responding to concerns they can burden vulnerable homeowners.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.1\">In <a href=\"https://www.ohiohouse.gov/legislation/134/hb646/committee\">testimony</a> during state House committee <a href=\"https://ohiohouse.gov/committees/civil-justice/video/ohio-house-civil-justice-committee-5-24-2022-184265\">hearings</a> this year, some proponents of the bill pointed to <a href=\"https://www.propublica.org/article/missouri-pace-loans\">reporting by ProPublica</a> as evidence that Ohio should closely regulate the lending. That reporting showed that Property Assessed Clean Energy, or PACE, loans often left low-income borrowers in Missouri at risk of losing their homes.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.2\">Two Republican state House members from eastern Ohio are pursuing rules for PACE, though such a lending program has only been offered through a pilot program in Toledo. But lawmakers Bill Roemer, from Richfield, and Al Cutrona, from Canfield, said they want to make sure that, if companies try to bring a statewide program to Ohio, they comply with stricter rules.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.3\">PACE offers financing for energy-saving home improvements that borrowers pay back in their property taxes. Unlike with some other types of financing, defaulting on a PACE loan can result in a home being sold in a tax sale.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.4\">Missouri, California and Florida are the only states with active statewide residential PACE programs. Ohio last year came close to <a href=\"https://www.propublica.org/article/cities-in-ohio-want-to-use-the-same-clean-energy-financing-company-that-saddled-missouri-homeowners-with-debt\">becoming the fourth</a>, after California-based Ygrene Energy Fund announced it would offer loans to homeowners in partnership with the Toledo-Lucas County Port Authority.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.5\">But the program never got started. Ygrene has since suspended all lending nationwide and last week agreed to settle a <a href=\"https://www.ftc.gov/system/files/ftc_gov/pdf/Complaint%20-%20Dkt.%201%20-%2022-cv-07864.pdf\">complaint</a> by the federal government and the state of California that the company had harmed consumers through deceptive practices.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.6\">Roemer said in an interview that he co-sponsored the measure after talking to a <a href=\"https://www.ohiorealtors.org/blog/1621/residential-pace-loans-too-good-to-be-true/\">coalition</a> that included mortgage lenders, real estate agents and advocates for affordable housing and the homeless.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.7\">“You never really see all those people come together on a bill,” he said. “I did my research, and I said, ‘This is really a bad program that takes advantage of the most vulnerable people.’”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.8\">The legislative session ends on Dec. 31, leaving little time to pass the bill.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.9\">“It’s going to be a lot of work,” Roemer said, “but I think it’s very important that we do it.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.10\">Ben Holbrook, an aide to Cutrona, said that after Ygrene’s withdrawal, the bill is “less of a reactive piece of legislation and more proactive.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.11\">ProPublica found that state and local officials in Missouri exercised little oversight over the two entities that have run the clean-energy loan programs in that state. Ygrene and the Missouri Clean Energy District charged high interest rates and fees over terms as long as 20 years, collecting loan payments through tax bills and enforcing debts by placing liens on property — all of which left some borrowers vulnerable to losing their homes if they defaulted.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.12\">Reporters analyzed about 2,700 loans recorded in the five counties with Missouri’s most active PACE programs. They found that borrowers, particularly in predominantly Black neighborhoods, sometimes were paying more in interest and fees than their homes were worth.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.13\">PACE lenders said that their programs provided much-needed financing for home upgrades, particularly in predominantly Black neighborhoods where traditional lenders typically don’t do much business. They said their interest rates were lower than payday lenders and some credit cards.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.14\">Weeks after ProPublica’s investigation, the Missouri legislature passed and Gov. Mike Parson <a href=\"https://www.propublica.org/article/missouri-lawmakers-approve-reforms-to-controversial-clean-energy-loan-program\">signed a law</a> mandating more <a href=\"https://www.propublica.org/article/clean-energy-loans-trapped-black-homeowners-in-debt-the-legislature-just-started-trying-to-fix-the-problem\">consumer protections</a> and oversight of PACE. In Ohio, following our reporting, leaders in the state’s two most populous cities, Columbus and Cleveland, said they <a href=\"https://www.propublica.org/article/cities-in-ohio-want-to-use-the-same-clean-energy-financing-company-that-saddled-missouri-homeowners-with-debt\">would not participate</a> in any residential PACE plan.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.15\"><a href=\"https://www.legislature.ohio.gov/download?key=19195&format=pdf\">Ohio’s bill</a> would cap the annual interest rate on PACE loans at 8% and prohibit lenders from charging interest on fees. Lenders must verify that a borrower can repay a loan by confirming that the borrowers’ monthly debt does not exceed 43% of their monthly income and that they have sufficient income to meet basic living expenses.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.16\">The measure would also change how PACE lenders secure their loans. In states where PACE has thrived in residential markets, PACE liens are paid first if a home goes into foreclosure. And a homeowner can borrow without the consent of the bank holding the mortgage. Ohio’s bill would pay off PACE liens after the mortgage and any other liens on the property. In addition, the mortgage lender would have to agree to adding a PACE loan.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.17\">Ygrene officials did not respond to requests for comment. But a company official told the legislative committee that the bill would “unequivocally kill residential PACE.” Crystal Crawford, then a Ygrene vice president, told the committee in May that the bill was “not a consumer protection bill — it is a bank protection bill.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.18\">Ohio’s limited experience with PACE illustrated how the program, with sufficient oversight, could be a low-cost option for borrowers. The Toledo-Lucas County Port Authority operated a pilot program allowing residents to borrow money for energy-saving projects without paying high interest or fees. A local nonprofit, the Lucas County Land Bank, made sure borrowers had the means to repay the loans, matched homeowners with contractors and made sure home improvements were completed correctly before releasing the loans.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.19\">Ygrene announced in August it had <a href=\"https://www.propublica.org/article/missouri-ygrene-pace-loans-clean-energy\">suspended making residential PACE loans</a> in Missouri and California but was continuing to make residential PACE loans in Florida and commercial PACE loans in more than two dozen states. Commercial loans have not attracted as much attention from regulators because they tend to involve borrowers with more experience and access to capital who aren’t as likely as residential borrowers to default.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.20\">More recently, Ygrene’s website suggests that instead of making loans directly, Ygrene now operates as an online lending marketplace where consumers seeking personal loans for home improvements can enter personal information and receive offers from third-party lenders.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.21\">The complaint by the Federal Trade Commission and the California Department of Justice alleges the company deceived consumers about the potential financial impact of its financing and recorded liens on borrowers’ homes without their consent. To resolve the case, Ygrene agreed to provide monetary relief to some borrowers, end allegedly deceptive practices and meaningfully oversee the contractors who act as its sales force. The settlement must be approved by a judge.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.22\">Ygrene said in an email that the complaints date back to the “earliest days” of the company’s marketing of PACE loans in 2015 and that it had since taken “considerable action” to safeguard consumers.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.23\">“We deeply regret any negative consequences any customer may have experienced, as even one unhappy customer is too much,” the company said.</p>\n        \n                                   ",
  "dc:subject": "Debt",
  "dc:date": "2022-11-02T05:00:00-04:00",
  "dc:creator": "by Jeremy Kohler"
}