{
  "title": "Making our tech spill-proof, crash-proof—thank you, IT",
  "link": "https://blog.google/inside-google/life-at-google/making-our-tech-spill-proof-crash-proofthank-you-it/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>They keep our laptops humming and our work flowing, and they’re often the first people we contact when there’s a problem: I’m talking about tech support. At Google, these folks offer a range of services to help us handle damage control for issues—troubleshooting the simplest to the most complex of problems every day—just like at your jobs. When we need help, we turn to our tech support service called Techstop.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"Google Tech Stop\" class=\"article-image--large\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/IMG_20190725_161852.max-500x500.jpg\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/IMG_20190725_161852.max-1000x1000.jpg\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/IMG_20190725_161852.max-100x100.jpg \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>To commemorate SysAdmin Appreciation Day (That’s today, by the way.), we stopped by our San Francisco Techstop office to say thank you to our own tech support folks, and to ask them a few questions. Much to their surprise, they didn’t have to fix an issue for us. <br/></p><p><b>What’s one thing you wish people would do before they came to IT?</b></p><p>Emma: Basic troubleshooting, like restarting a machine. You’d be surprised how many problems are resolved with a simple reboot.</p><p>Charles: Another tip would be to clear your cache and cookies before stopping by. This can help if you force a shutdown while a program is trying to update. If the program closes before it saves whatever it was doing, it can cause issues—clearing cache can help sometimes.</p><p><b>If you could wave a wand and eliminate a recurring problem that you deal with, what would it be?</b></p><p>Emma: The blue screen of death when machines don’t run on a modern OS. It causes disruption and takes entirely too long to remediate. I wish it would just go away.</p><p>Charles: Resetting passwords or sign-in credentials, in general. I’d love it if we didn’t have to do this, but I understand that people forget. </p><p><b>What’s your favorite Google product hack or tip?</b></p><p>Emma: If you type “chrome://restart” into your Chrome browser, it’ll restart your browser and re-open tabs. I use this if my connection is slow or if my browser doesn’t load properly.  </p><p>Charles: I like to save time with <a href=\"https://support.google.com/mail/answer/6594\">Gmail shortcuts</a>. If you want to learn what shortcuts are available, click <b>Shift + ?</b> and you’ll see a list of shortcuts appear on your screen. Just make sure to enable keyboard shortcuts in your Gmail settings first! If you’re working on a Chromebook with Chrome OS, you can click <b>CTRL + ALT + ?</b> and they’ll appear.</p><p><b>What's the weirdest or funniest laptop mishap you've encountered at Google?</b></p><p>Emma: I once had someone come in with a clicking noise on their laptop. I opened the bottom case of their computer and found a piece of a plastic arm from a toy stuck within the base. The person laughed and said, “oh kids…”</p><p>Charles: Do you know those little silicon packets that come in packaging or new clothing items? We’ve had dozens of people come into Techstop because their headphone ports stop working. Apparently, these packets get left within backpacks, the beads burst and they jam headphone jacks. Look out for those pesky things.</p><p><b>If you could describe working in IT in just 3 words, what would they be? (Feel free to make them fun!)</b></p><p>Emma: Unpredictable. Exciting. Gratifying.</p><p>Charles: Fluid. Inquisical. Magical.</p><p><b>What do you think your job will look like in 5 years? </b></p><p>Emma: In five years, almost all of our IT systems will be cloud-based. Since troubleshooting systems will be a thing of the past, I think we’ll work tighter with product and data analytics teams to suggest and test new systems and environments. </p><p>Charles: We help thousands of employees fix IT issues, and we're able to do this efficiently by focusing on how to address problems that happen over and over again. We call this \"root reduction.” Root reduction helps us scale our IT services, and it also frees up our schedules so that we can focus on more strategic work. In five years, I think we’ll use the time we save through root reduction to become internal IT consultants for teams. We’ll embed with individual departments to help them solve trickier problems or workflows specific to their needs. </p><p>From resetting our passwords to debugging and fixing a system crash, we salute you “IT guy” (or gal!). Thanks for keeping us online, even when we drown our computers in coffee.</p></div></div></body></html>",
  "pubDate": "Fri, 26 Jul 2019 16:30:00 +0000",
  "guid": "https://blog.google/inside-google/life-at-google/making-our-tech-spill-proof-crash-proofthank-you-it/",
  "category": [
    "Google Workspace",
    "Life at Google",
    "Gmail"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Making our tech spill-proof, crash-proof—thank you, IT",
    "description": "",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/SysAdmin_1.max-600x600.png",
    "site_name": "Google",
    "url": "https://blog.google/inside-google/life-at-google/making-our-tech-spill-proof-crash-proofthank-you-it/"
  },
  "author": {
    "name": "Danielle Hertz",
    "title": "Editor",
    "department": "G Suite Blog",
    "company": ""
  }
}