{
  "title": "Acceptance starts from home: The role of families of LGBTI+ youth",
  "link": "https://www.newmandala.org/acceptance-starts-from-home-the-role-of-families-of-lgbti-youth/",
  "dc:creator": "Cody Freeman",
  "pubDate": "Tue, 18 Oct 2022 01:33:43 +0000",
  "category": [
    "ANU Gender Institute",
    "Asia-Pacific Affairs",
    "India",
    "Southeast Asia"
  ],
  "guid": "https://www.newmandala.org/?p=60021",
  "description": "<p>Parent-led networks have created tremendous impact for the LGBTI+ movement in Asia.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/acceptance-starts-from-home-the-role-of-families-of-lgbti-youth/\">Acceptance starts from home: The role of families of LGBTI+ youth</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n",
  "content:encoded": "<p><iframe loading=\"lazy\" title=\"New Mandala: Acceptance Starts From Home\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/F0mFJ2MB1Hw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n<p>Families have a central role in creating freedom for LGBTI+ people. This video shares about how parents and organizations support, educate, and advocate for LGBTI+ youth. We hope that centering Aruna’s story starts conversations between parents and youth and contributes to filling the gap in empowering videos about this topic in the Asia Pacific. Please share Aruna’s story with people in your network! (Transcript below.)</p>\n<h4>Links to organizations:</h4>\n<ul>\n<li class=\"x1heor9g x1qlqyl8 x1pd3egz x1a2a7pz\"><a href=\"https://www.facebook.com/SweekarTheRainbowParents/\">Sweekar &#8211; The Rainbow Parents</a>: The organisation that Aruna helped to start in India</li>\n<li><a href=\"http://theglobal-center.org/families\">The Global Center</a>: A global education NGO for LGBTI+ youth and key stakeholders that has a free resource pack for parents, caretakers, and families</li>\n<li><a href=\"https://www.ilgaasia.org/\">ILGA Asia</a>: Asian Region of the Int&#8217;l Lesbian, Gay, Bisexual, Trans and Intersex Association</li>\n<li>This video was based on <a href=\"https://static1.squarespace.com/static/5a84777f64b05fa9644483fe/t/5c98361f0d9297aa15aae4ba/1553479276588/%5BILGA+Asia+Report%5D+Discussion+Paper+on+Empowerment+and+Capacity+Development+for+Parents+of+LGBTI+Persons+in+Asia.pdf\">this discussion paper</a>. (download)</li>\n</ul>\n<h4>Video Transcript:</h4>\n<p>The rights of lesbian, gay, bisexual, transgender, and intersex people or LGBTI+ are crucial in creating a world where all people are free and equal. Parents, caretakers, and families play a key role in shaping attitudes, knowledge, and awareness throughout the society.</p>\n<p>Meet Aruna! She is one of the incredible parents supporting, educating, and advocating for her son Abhisek.</p>\n<p><em>Aruna:</em></p>\n<p>Abhishek, when he came out to me, he was only 17 years old. And they made up a story of someone, an imaginary friend. He said that his parents had thrown him out of the house because he’s gay and they’re not accepting him. So, I said like “So what if he’s gay?” so they thought okay, I am okay with this, I mean being gay is not a problem for me.</p>\n<p>So, I asked him “Hey, you know your friend is gay so are you also gay?” Just like that I asked him, are you also gay? So, he just got up and came and hugged me and asked me “Okay mama, are you ashamed of it? Do you still love me?” I said, “Is it the same thing?” He says “Yeah”. I said “Oh my god for this you took so long? You should have just told me that okay mama I am also gay.” So I told him “okay, it’s okay, come let’s go for dinner.” Then after that my journey being a parent of gay child began.</p>\n<p>Organizations that support, educate, and advocate families of LGBTI+ people have grown in over the past decade in Cambodia, China, India, Myanmar, Nepal, Pakistan, South Korea, Taiwan, and Vietnam. These organizations challenge false narratives, help parents overcome stigma, and learn to accept and embrace their child. However, this can be a tough journey for many parents.</p>\n<p>Parents have lots of questions, you know. Is it natural or unnatural, you know? Is it possible for you to change? Is it a hormonal imbalance? Is it a phase? This is a Western concept and it’s not Indian culture. Then some parents will say you know did I do something wrong? Why didn’t they tell so long if they knew they were from the community?</p>\n<p><em>Parent-led networks have created tremendous impact for the LGBTI+ movement. For example, PFLAG Vietnam has been incredibly successful in providing assistance to parents by doing outreach in various cities and provinces, with over 30 branches established since the group was founded. They use social media to disseminate correct information, invite experts to share their knowledge, and offer trainings to hundreds of parents.</em></p>\n<p><em>The parents’ group in Myanmar gives an annual “Outstanding Parent of the Year” award and the group in Cambodia uses art as an invitation to engage the public through community events.</em></p>\n<p><em>Parents emphasized that the first step to overcome stigma was education that started from the heart and then came to the mind. Through this, parents were more informed and became champions for LGBTI+ people by joining advocacy activities.</em></p>\n<p><em>Aruna:</em> Most importantly, you know, just accept your children the way they are. Express your affection when your child comes out. Advocate for your child when they are mistreated by other people, you know, and that other people can be anybody. When your child gets support from you, they will flourish, they can conquer the world. Acceptance starts from home!</p>\n<p><em>This publication was supported by an ANU Gender Institute grant which provided funds for New Mandala and <a href=\"https://connectingdesignstudio.wordpress.com/author/minimistudio/\">Connecting Design</a>s to run a series of workshops supporting early career academics investigating issues of gender and sexuality in Southeast Asia to develop their audio-visual research communication skills.</em></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/acceptance-starts-from-home-the-role-of-families-of-lgbti-youth/\">Acceptance starts from home: The role of families of LGBTI+ youth</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n"
}