{
  "title": "What V2G Tells Us About EVs and the Grid",
  "link": "https://spectrum.ieee.org/what-v2g-tells-us-about-evs-and-the-grid-2657785771",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-photo-of-a-man-standing-next-to-a-charging-station-near-an-electric-car-that-has-bidirectional-ecosystem-on-this-side.png?id=30408231&width=1245&height=700&coordinates=0%2C0%2C0%2C91\"/><br/><br/><p><strong>As the number</strong> of electric vehicles on the world’s roads explodes, electric utilities are grappling with increasing demand while simultaneously having to stabilize their grids where more intermittent renewable-energy sources like wind and solar are coming online. For utilities looking for ways to store power for later use, all those shiny new EVs might look like rolling batteries that they can not only charge but also draw power from when demand exceeds supply. That’s the promise of vehicle-to-grid (V2G) technology.</p><hr/><p>While China accounted for about half the 6.75 million EVs sold worldwide in 2021, <a href=\"https://www.ev-volumes.com/#:~:text=Global%20EV%20sales%20reached%206,4%2C2%20%25%20in%202020.\" rel=\"noopener noreferrer\" target=\"_blank\">according to Sweden-based analysts EV Volumes</a>, Europe also showed strong growth. There, sales of EVs as part of the overall automobile market rose from 10 percent in 2020 to 17 percent in 2021, with 2.3 million sold. And it is in Europe where we find one of the largest V2G deployments. Longtime <em>IEEE Spectrum</em> contributor Michael Dumiak, who is based in Germany, ventured over to Utrecht in the Netherlands to report on <a data-linked-post=\"2657545245\" href=\"https://spectrum.ieee.org/vehicle-to-grid\" target=\"_blank\">the city’s ambitious V2G project</a>.</p><p>To meet the Dutch government’s mandate for all new cars to be zero-emissions by 2030, municipalities like Utrecht as well as utilities and private-sector partners will have to work together to locate new bidirectional charging stations that won’t overload transformers. When discussing the scope of change in the proverbial pipeline, renewables <em>plus</em> EVs <em>plus</em> grids in need of upgrades to handle the millions of new EVs projected to hit Europe’s roads in the next few years, one Dutch researcher told Dumiak, “Our grid was not designed for this.”</p><p>Nor was grid-scale storage top of mind among the pioneers of V2G, at least not at the beginning. In the online-only feature story (coming soon), technology historian Matthew Eisler of the University of Strathclyde in Glasgow points out that V2G technology was originally conceived as vehicle-to-home, not vehicle-to-grid.</p><p>Eisler’s piece charts the history of V2G and tells the story of the California company AC Propulsion. He documents how engineers <a href=\"https://en.wikipedia.org/wiki/Wally_Rippel\" rel=\"noopener noreferrer\" target=\"_blank\">Wally Rippel</a>, Alan Cocconi, and Paul Carosa founded AC Propulsion in the early 1990s and produced a two-seater sports car called the Tzero, which featured bidirectional charging capability. As Eisler points out, this feature had been implemented to give drivers the ability, in an emergency, to charge another EV. Now that ability is being extended to the grid, raising a host of new questions.</p><p>“And how will batteries with chemistries designed for the EV duty cycle perform in stationary power applications? Will V2G degrade such batteries and reduce their value in transportation? Those questions are far from resolved and yet are key to the success of bidirectional vehicle power,” Eisler writes, adding that many carmakers don’t yet have sufficient incentive to equip their cars for bidirectional power. And even if the auto industry does eventually jump on the bidirectional bandwagon, Eisler says that “it is not yet clear whether batteries designed for the duty cycle of the electric vehicle will prove suitable” for grid storage.</p><p>The tensions that exist at the interface of these two massive sectors–power and transportation–threaten to hobble the EV market as <em>Spectrum</em> contributing editor and renowned risk analyst Robert N. Charette noted when I talked to him recently about a series of articles he’s working on that focuses on the risks inherent in mass vehicular electrification. </p><p>While engineers are acutely aware of the enormous impediments blocking the road to a cleaner EV future, Charette believes that politicians and government officials have become detached from the expensive realities involved in retooling the electric-power infrastructure to accommodate tens of millions of new EVs. We hope policymakers take heed of Charette’s warnings about the difficulties ahead, which will appear online starting next month. </p>",
  "pubDate": "Mon, 01 Aug 2022 18:57:18 +0000",
  "guid": "https://spectrum.ieee.org/what-v2g-tells-us-about-evs-and-the-grid-2657785771",
  "category": [
    "Evs",
    "Editor's note",
    "V2g",
    "The grid",
    "Energy storage"
  ],
  "dc:creator": "Harry Goldstein",
  "media:content": ""
}