{
  "title": "Wavemaker Impact, Bill Gates&#8217;s VC arm, Temasek launch startup to decarbonise rice cultivation in Asia",
  "link": "https://e27.co/wavemaker-impact-bill-gates-firm-temasek-set-up-agritech-firm-20221027/",
  "dc:creator": "Sainul",
  "pubDate": "Thu, 27 Oct 2022 05:07:55 +0000",
  "category": [
    "Climate Tech & Sustainability",
    "Singapore",
    "Startups",
    "Breakthrough Energy Ventures",
    "GenZero",
    "Temasek",
    "Temasek Holdings",
    "Wavemaker Impact"
  ],
  "guid": "https://e27.co/?p=475091",
  "description": "<p>Singapore-based impact VC firm Wavemaker Impact has partnered with Bill Gates&#8217;s VC arm Breakthrough Energy Ventures, Temasek Holdings and its subsidiary GenZero to set up an agritech startup. The goal is to bring together climate-tech, agri-food, and venture-building capabilities to accelerate rice decarbonisation in Southeast Asia and the rest of Asia. The agritech startup plans [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/wavemaker-impact-bill-gates-firm-temasek-set-up-agritech-firm-20221027/\">Wavemaker Impact, Bill Gates&#8217;s VC arm, Temasek launch startup to decarbonise rice cultivation in Asia</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<div id=\"attachment_475097\" style=\"width: 700px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-475097\" loading=\"lazy\" class=\"size-full wp-image-475097\" src=\"https://e27.co/wp-content/uploads/2022/10/Wavemaker_impact_agritech_news.png\" alt=\"\" width=\"690\" height=\"388\" /><p id=\"caption-attachment-475097\" class=\"wp-caption-text\">The Wavemaker founding partners</p></div>\n<p>Singapore-based impact VC firm Wavemaker Impact has partnered with Bill Gates&#8217;s VC arm <a rel=\"follow\" href=\"https://breakthroughenergy.org/\">Breakthrough Energy Ventures</a>, Temasek Holdings and its subsidiary GenZero to set up an agritech startup.</p>\n<p>The goal is to bring together climate-tech, agri-food, and venture-building capabilities to accelerate rice decarbonisation in Southeast Asia and the rest of Asia.</p>\n<p>The agritech startup plans to build a platform that will rapidly identify and implement the most effective strategies to reduce greenhouse gas emissions in rice cultivation and the right economic incentives to drive the adoption of sustainable cultivation techniques.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/the-next-generation-of-unicorns-will-be-from-greentech-wavemaker-impacts-steve-melhuish-20221011/\">‘The next generation of unicorns will be from greentech’: Wavemaker Impact’s Steve Melhuish</a></strong></p>\n<p>The four investment firms have also injected undisclosed seed funding into the startup, whose name is yet to be announced. The capital will be used for initial hiring and experimentation costs.</p>\n<p>Rice is the greatest climate and food security challenge in the region. A staple crop for more than half of the world&#8217;s population, rice will see <a rel=\"follow\" href=\"https://www.financialexpress.com/archive/global-demand-for-rice-to-increase-50-by-2050-says-zeigler/143891/\">global demand increase by 50 per cent by 2050</a>. Rice cultivation is the second-largest source of greenhouse gas emissions in agri-food due to methane-emitting bacteria generated from flooded rice paddy fields. It is responsible for up to 33 per cent of Southeast Asia&#8217;s methane emissions, with methane having over 80 times more global warming potential than carbon dioxide.</p>\n<p>&#8220;90 per cent of rice is cultivated and consumed in Asia, so this is a climate challenge that needs an Asian solution and is exactly the kind of venture we set out to build at Wavemaker Impact,&#8221; said Steve Melhuish, Founding Partner of Wavemaker Impact.</p>\n<p>While rice cultivation is a significant and growing source of emissions, it is highly fragmented. Across Asia, the livelihoods of 400 million people on 144 million smallholder farms depend on rice, with the average farm size ranging from 0.5 to 2 hectares. There are also significant yield gaps. Southeast Asia&#8217;s rice production per hectare lags behind high-producing countries by approximately 40 per cent.</p>\n<p>Solutions to reduce rice cultivation emissions and increase yield are available. However, the adoption has lagged for various reasons, such as the difficulty of changing entrenched farming practices, lack of access to high-quality inputs and incentives, and infrastructure challenges.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/steve-melhuish-interview-on-climate-tech-southeast-asia-20220310/\">&#8216;There’s a mismatch of investment and entrepreneur focus in SEA’s climate tech&#8217;</a></strong></p>\n<p>&#8220;There is an urgent need for the global community to tackle methane emissions, which are far more harmful than CO2 due to the 81-83 times higher potency of methane on a 20-year basis. Rice produces 12 per cent of global methane. On a 20-year equivalence basis, rice cultivation is a top 10 contributor to climate change, with its GHG impact greater than the global aviation industry. Despite the magnitude of this problem, it has not gotten adequate attention from the global community.&#8221;</p>\n<p>Founded by Bill Gates and backed by many of the world&#8217;s top business leaders, Breakthrough Energy Ventures is a purpose-built investment firm seeking to invest, launch and scale global companies that will eliminate GHG emissions throughout the economy as soon as possible. It has raised more than US$2 billion in committed capital to support cutting-edge companies leading the world to net-zero emissions.</p>\n<p>GenZero is an investment platform that aims to accelerate decarbonisation for future generations towards a net zero world.</p>\n<p>&#8212;</p>\n<p><a rel=\"follow\" href=\"https://e27.co/echelon/asia/\" target=\"_blank\" rel=\"follow noopener\" >Echelon 2022</a> is happening from 27-28 October at Resorts World Sentosa in Singapore!</p>\n<p>Echelon 2022 aims to provide intimate and focused discussions on key topics and business matching services to facilitate business-driven connections during the two-day event. e27 will curate and invite key stakeholders of startups, investors, corporates, and ecosystem enablers to drive towards fruitful business outcomes at Echelon.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/wavemaker-impact-bill-gates-firm-temasek-set-up-agritech-firm-20221027/\">Wavemaker Impact, Bill Gates&#8217;s VC arm, Temasek launch startup to decarbonise rice cultivation in Asia</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}