{
  "title": "PODCAST 3-05-2018: John Feffer on Donald Trump and Majoritarianism",
  "description": "Today's episode is another interview and it is again going to be available to the public. I'm grateful to have been joined by John Feffer of the Institute for Policy Studies to talk about his recent piece for <a href=\"http://fpif.org/ideology-unites-trump-authoritarians-admires/\" rel=\"nofollow noopener\" target=\"_blank\">Foreign Policy in Focus</a> on Donald Trump's majoritarian politics and the spread of majoritarianism around the world (I know I mention \"a couple of pieces\" in my intro but consider that a function of the fact that I got about five hours of sleep last night and that my plan for the interview changed as we were recording it). John walks us through the concept of majoritarianism, examines the construction of a \"majority\" in the first place, and looks at majoritarianism's causes and a hopeful counter to it. You can find more of John's work at <a href=\"http://fpif.org\" rel=\"nofollow noopener\" target=\"_blank\">Foreign Policy in Focus</a>, <a href=\"http://lobelog.com\" rel=\"nofollow noopener\" target=\"_blank\">LobeLog</a>, and <a href=\"http://www.johnfeffer.com\" rel=\"nofollow noopener\" target=\"_blank\">his own website</a>. Enjoy!<p>I close with an appeal for you to support a new resolution in the US Senate offered by Bernie Sanders, Mike Lee, and Chris Murphy that could potentially end America's role in the ongoing Yemen atrocity. <a href=\"http://winwithoutwar.org\" class=\"linkified\" target=\"_blank\">WinWithoutWar.org</a>'s petition is <a href=\"http://winwithoutwar.org/end-americas-secret-war-yemen/\" rel=\"nofollow noopener\" target=\"_blank\">here</a>. I know I usually post episodes on Tuesdays but because the petition is timely I wanted to get this episode out as soon as it was ready.</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://fx.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">fx.substack.com/subscribe</a>",
  "link": "https://fx.substack.com/p/john-feffer-on-donald-trump-and-majoritarianism-b5d",
  "guid": 17383454,
  "dc:creator": "Derek Davison",
  "pubDate": "Tue, 06 Mar 2018 00:00:59 GMT",
  "enclosure": "",
  "itunes:author": "Derek Davison",
  "itunes:explicit": "No",
  "itunes:duration": 3366,
  "itunes:image": ""
}