{
  "title": "PI is back! Switching Acquisition Functions in Bayesian Optimization. (arXiv:2211.01455v1 [cs.LG])",
  "link": "http://arxiv.org/abs/2211.01455",
  "description": "<p>Bayesian Optimization (BO) is a powerful, sample-efficient technique to\noptimize expensive-to-evaluate functions. Each of the BO components, such as\nthe surrogate model, the acquisition function (AF), or the initial design, is\nsubject to a wide range of design choices. Selecting the right components for a\ngiven optimization task is a challenging task, which can have significant\nimpact on the quality of the obtained results. In this work, we initiate the\nanalysis of which AF to favor for which optimization scenarios. To this end, we\nbenchmark SMAC3 using Expected Improvement (EI) and Probability of Improvement\n(PI) as acquisition functions on the 24 BBOB functions of the COCO environment.\nWe compare their results with those of schedules switching between AFs. One\nschedule aims to use EI's explorative behavior in the early optimization steps,\nand then switches to PI for a better exploitation in the final steps. We also\ncompare this to a random schedule and round-robin selection of EI and PI. We\nobserve that dynamic schedules oftentimes outperform any single static one. Our\nresults suggest that a schedule that allocates the first 25 % of the\noptimization budget to EI and the last 75 % to PI is a reliable default.\nHowever, we also observe considerable performance differences for the 24\nfunctions, suggesting that a per-instance allocation, possibly learned on the\nfly, could offer significant improvement over the state-of-the-art BO designs.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Benjamins_C/0/1/0/all/0/1\">Carolin Benjamins</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Raponi_E/0/1/0/all/0/1\">Elena Raponi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Jankovic_A/0/1/0/all/0/1\">Anja Jankovic</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Blom_K/0/1/0/all/0/1\">Koen van der Blom</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Santoni_M/0/1/0/all/0/1\">Maria Laura Santoni</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lindauer_M/0/1/0/all/0/1\">Marius Lindauer</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Doerr_C/0/1/0/all/0/1\">Carola Doerr</a>"
}