{
  "title": "#497: The First Movie's Best Character Introductions",
  "link": "https://audioboom.com/posts/7775272",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3746,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Welcome <a href=\"https://www.patreon.com/mugglecast\">Slug Club</a> member Pablo to the show! Spanish language speakers, check out Pablo's HP podcast <a href=\"https://podcasts.apple.com/us/podcast/cuarentena-9-3-4/id1510239480\">Cuarantena 9 3/4</a>!</li>\n<li>In a bit of sad news, Hogwarts Legacy has been given a 2022 release window, not 2021 as we had hoped.</li>\n<li>How will the hosts fill the time without the new game? By <a href=\"https://www.twitch.tv/spielermangames\">checking out other games</a> like Micah?</li>\n<li>The <em>Sorcerer's Stone</em> movie turns 20 this year! To celebrate, we'll be hosting discussions about the first film throughout the year!</li>\n<li>The hosts discuss which character was given the best introduction in the movie.</li>\n<li>The rest of today's episode is all MuggleMail! The hosts answer your e-mails and voicemails</li>\n<li>Why don't we hear more about teachers' spouses at Hogwarts?</li>\n<li>Should Samuel L. Jackson voice the Sorting Hat on a new TV series? We listen to his audition tape.</li>\n<li>Did Dumbledore fail to protect Frank and Alice Longbottom sufficiently in the wake of the death of the Potters?</li>\n<li>12-year-old listener Wyatt asks us, would throwing a Horcrux through The Veil destroy it?</li>\n<li>The hosts ruminate on whether a Chapter by Chapter reboot lays in our future.</li>\n<li>Quizzitch: Which actress reportedly turned down the role of the witch Sybil Trelawney in “Prisoner of Azkaban” because she did not believe boarding school life should be glorified?</li>\n<li>This week’s episode is sponsored by <a href=\"http://www.GetQuip.com/muggle\">Quip</a> (Get a free dispenser for their new chewing gum) and <a href=\"http://www.meundies.com/mugglecast\">MeUndies</a> (Get 15% off your first order</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like Bonus MuggleCast!</li>\n</ul>\n",
  "pubDate": "Tue, 19 Jan 2021 12:00:00 +0000",
  "guid": "tag:audioboom.com,2021-01-18:/posts/7775272",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}