{
  "title": "TU47: Attachment Insecurity and Secure Parenting with Guest Tina Payne-Bryson",
  "link": "https://therapistuncensored.com/episodes/tu47-attachment-insecurity-and-secure-parenting-with-guest-tina-payne-bryson/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu47-attachment-insecurity-and-secure-parenting-with-guest-tina-payne-bryson",
  "pubDate": "Mon, 30 Oct 2017 12:00:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=5483",
  "description": "Let’s get real about not being a perfect parent or partner so we can do both better!   Regulation before reflection!\n\nWe were so excited about our first interview with NYT best-selling author Tina Payne Bryson that for the first time we are bringing a guest back for a second interview!  Sue Marriott, co-host of Therapist Uncensored and Dr. Payne-Bryson get real about parenting when you don’t have a secure background yourself. They cover constructing a coherent narrative and why that’s not really enough, and what needs to be added to the equation. They also get into what healthy integration means and how it helps us navigate under stress and in the heat of an argument. They lay out the grief process in relation to our own parents and how that can open up possibilities of mending old ruptures and creating new growth. Finally they really get into the role of the body over the mind in creating the bottom line, a healthy regulation of self to help others.\n\nSee Tina live Nov 3-4, 2017 here in Austin! Friday night event, short lecture for the public, parents, educators and clients interested in what should have happened growing up. Saturday clinical conference.\n\nWho is Tina Payne Bryson?\n\nShe is co-author with Dr. Dan Siegel of The Whole Child Brain, The Yes Brain and No-Drama Discipline and founder of The Center for Connection in Pasadena.  Dr. Bryson keynotes conferences for parents, educators, and clinicians all over the world, and she has written for numerous publications such as the PBS series “This Emotional Life.” She makes frequent media appearances at venues like TIME, “Good Morning America,” Huffington Post, Redbook, The New York Times, and Real Simple. She is the Child Development Specialist at Saint Mark’s School in Altadena, the Director of Parenting Education at the Mindsight Institute, the Director for Child Development for Camp Chippewa in Cass Lake, Minnesota, and the Child Development Director for Lantern Camps.  \n\nListen to the first one, Episode 27 Raising Secure Children\nLike this and want to hear more?  Join our email list here, subscribe to Tunes here or sign up for the waiting list for our free online course on Modern Adult Attachment here! We may read your review on air, please rate and review us on your favorite podcast player, it helps so much!!\nFinally – this is the easiest of all – “Like” our public Facebook page here to get updated popular articles on these subjects of interest.\n0:00 – 15:00\n\nIntro\n\nTina’s current interests are essentially any and everything that comes back to regulation and thinking about it in a bottom up orientation\n\nAttachment\n\nCreating a cohesive narrative begins with stabilizing a cohesive physical state in your body. Regulation needs to occur before reflection\n\nInformation you know doesn’t necessarily have the capacity to change how you feel\n\nIntegration & Alan Schore\n\nFactual memories/details in left hemisphere, information taken from the body, procedural memory is right hemisphere. Once integrated, there’s a flow of information between them. When emotions are high, the rational thought is more difficult to access.\n\n15:00 – 30:00\n\nProblem of counter-empathy for other people’s problems when you’re in an emotional state, particularly in regards to children\n\nAttention as a vital need for a child\n\nDevelopment for children, toddlers and adolescents\n\nTina’s own personal experiences with her parents and children related to attachment and empathy\n\nVulnerability\n\nTina’s experience losing her father and reshaping her narrative about his dismissive nature through understanding attachment\n\nProblem of having extensive knowledge of neurobiological and psychological effects distancing therapists from their own personal grief\n\nTina’s experience with attachment in terms of varying messages of condolence when her father passed\n\nNurturing a healthier relationship with Tina’s father after his death – allowing for a positive mental space when envision...",
  "enclosure": "",
  "itunes:subtitle": "Let’s get real about not being a perfect parent or partner so we can do both better!   Regulation before reflection! - We were so excited about our first interview with NYT best-selling author Tina Payne Bryson that for the first time we are bringing ...",
  "itunes:summary": "Let&apos;s get real about not being a perfect parent or partner so we can do both better!   Regulation before reflection!  <br />\n<br />\nNYT best-selling author Tina Payne Bryson talks with Sue Marriott, co-host of Therapist Uncensored about being honest about parenting (& partnering) when you don&apos;t have a secure background yourself.  They cover constructing a coherent narrative and why that&apos;s not really enough, and what needs to be added to the equation.  they get into what healthy integration means and how it helps us navigate under stress and in the heat of an argument.  They also discuss the grief process in relation to our own parents and how that can open up possibilities of mending old ruptures and creating new growth. Finally they really get into the role of the body over the mind in creating the bottom line, a healthy regulation of self to help others.   <br />\n<br />\nTina Payne Bryson is co-author with Dr. Dan Siegel of The Whole Child Brain, The Yes Brain and No-Drama Discipline and founder of The Center for Connection in Pasadena.  Dr. Bryson keynotes conferences and conducts workshops for parents, educators, and clinicians all over the world, and she has written for numerous publications, for example mom.me, SkillForKids and the PBS series “This Emotional Life.”  She has also co-hosted a web-based parenting show and makes frequent media appearances at venues like TIME, “Good Morning America,” Huffington Post, Redbook, The New York Times, and Real Simple.  She is the Child Development Specialist at Saint Mark’s School in Altadena, the Director of Parenting Education at the Mindsight Institute, the Director for Child Development for Camp Chippewa in Cass Lake, Minnesota, and the Child Development Director for Lantern Camps.  Tina earned her LCSW and Ph.D. from the University of Southern California, where her research explored attachment science, childrearing theory, and the emerging field of interpersonal neurobiology. <br />\n<br />\nListen to the first one, Episode 27 Raising Secure Children here.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "45:53"
}