{
  "title": "Ashton Carter, former U.S. secretary of defense who served in leadership roles at the MIT Corporation and Lincoln Laboratory, dies at 68",
  "link": "https://news.mit.edu/2022/ashton-carter-secretary-defense-1031",
  "description": "A trained theoretical physicist, Carter devoted his wide-ranging knowledge to government service.",
  "pubDate": "Mon, 31 Oct 2022 11:00:00 -0400",
  "guid": "https://news.mit.edu/2022/ashton-carter-secretary-defense-1031",
  "dc:creator": "Michaela Jarvis | MIT News correspondent",
  "content:encoded": "<p>Ashton Carter, former U.S. Secretary of Defense and a lifelong advocate of technological innovation who applied his training as a physicist toward public policy, died of a heart attack Oct. 24 in Boston. He was 68.</p>\n\n<p></p>\n\n<p>As secretary of defense in the Obama administration, Carter was best known for opening the way for women in the military to take on combat roles and for transgender people to serve. He engaged with MIT in a variety of roles throughout his career, including as a member of the executive committee of the MIT Corporation, the Institute’s board of trustees, and as a member and chair of the advisory board of MIT Lincoln Laboratory.</p>\n\n<p></p>\n\n<p>“Above all, Ash was a&nbsp;spectacular&nbsp;leader and a&nbsp;citizen-servant,” MIT President L. Rafael Reif says. “When I first met him — years ago, on the Lincoln Lab advisory board — what stood out immediately was his intellect: Ash was brilliant, and that’s saying something at MIT. But what I quickly came to admire most about him is that, in the best MIT tradition, his brilliance was matched by his&nbsp;down-to-earth manner, humility, warmth, and generosity.”</p>\n\n<p></p>\n\n<p>After leaving Washington, Carter became the director of the Belfer Center for Science and International Affairs at the Harvard Kennedy School, a position he held at the time of his death. At MIT, in addition to his service with the MIT Corporation executive committee and Lincoln Laboratory advisory board, Carter’s involvement also included roles as a postdoc, a fellow in the Center for International Studies, and a visiting fellow with the MIT Innovation Initiative.</p>\n\n<p></p>\n\n<p>“Ash Carter made enormous contributions to our nation, our world, and to MIT. I first experienced the extraordinary reach of his mind during our discussions about the cloud and AI,” says Diane Greene, chair of the MIT Corporation. “As part of his service to the MIT Corporation, Ash joined the Executive Committee and we are so grateful for his wisdom, generosity, and his belief in the importance of MIT's research and education missions.”</p>\n\n<p></p>\n\n<p>As an MIT Innovation Fellow, Carter worked with researchers and students from the MIT School of Engineering and MIT Sloan School of Management.</p>\n\n<p></p>\n\n<p>“We were honored to have Ash serve as an innovation fellow at MIT,\" says Fiona Murray, the William Porter Professor of Entrepreneurship at the MIT Sloan School of Management and co-director of the MIT Innovation Initiative, noting that Carter demonstrated throughout his career the crucial importance of innovation in foreign policy and national security. As a visiting fellow, “Ash shared his commitment to innovating in the service of mission challenges, as well as his broad range of experience, to encourage students to think about their contributions to national and global issues. He led important conversations in small and large groups of students and faculty. His lifetime of service at the highest levels of government will remain an inspiration to us all.”</p>\n\n<p></p>\n\n<p>Carter earned a joint undergraduate degree in physics and medieval history from Yale University and a doctorate in theoretical physics at Oxford University as a Rhodes Scholar before becoming a fellow at MIT’s Center for International Studies in the 1980s. Around this time, he held a number of short-term posts, including at the Pentagon, before joining the faculty at Harvard University and then directing the Center for Science and International Affairs at Harvard’s John F. Kennedy School of Government.</p>\n\n<p></p>\n\n<p>In 1993, he began his first tour of duty at the Pentagon as assistant secretary of defense for international security policy, a position he held until 1996. From 2009 to 2011, he served as the undersecretary of defense for acquisition, technology, and logistics, and from 2011 to 2013, as the deputy secretary of defense. Carter worked directly and indirectly for 11 secretaries of defense in Democratic and Republican administrations, “leveraging his knowledge of science and technology, global strategy, and policy,” according to information from the U.S. Department of Defense.</p>\n\n<p></p>\n\n<p>In 2015, he became the 25th U.S. secretary of defense during the last two years of President Barack Obama’s administration. As defense secretary, Carter changed policies so that women in the military could enter combat and transgender people could serve. He also started DIUx, now known as the Defense Innovation Unit, to strengthen ties between the military and Silicon Valley in order to explore commercial technologies with military applications in his ongoing effort to encourage relationships between the tech world and government.</p>\n\n<p></p>\n\n<p>Obama, in a <a href=\"https://twitter.com/BarackObama/status/1584948734764253185\" target=\"_blank\">statement</a> honoring Carter on social media, called him “a leader who left America — and the world — safer through his lifetime of service.”</p>\n\n<p></p>\n\n<p>Over the course of his time at the Department of Defense, Carter worked to negotiate the withdrawal of nuclear weapons from former Soviet Republics, led U.S. policy to push Islamic State terrorists our of most of its territory in Syria and Iraq, and pushed the development of thousands of attack-resistant vehicles, which, according to the Pentagon, “saved countless service members’ lives.”</p>\n\n<p></p>\n\n<p>President Reif reflected this week on what Carter brought to MIT over the years.</p>\n\n<p></p>\n\n<p>“Ash never took a class at MIT, never served on our faculty,&nbsp;nor led one of our centers. But he was&nbsp;of&nbsp;MIT. He&nbsp;understood&nbsp;us. And&nbsp;through his service&nbsp;on advisory boards, visiting committees, and the Corporation, and as a visiting innovation fellow, he found so many ways to make us better. Our country has lost a great&nbsp;public&nbsp;servant&nbsp;and leader, and our community has lost a wonderful friend.&nbsp;We extend our deepest sympathies to his wife, Stephanie, daughter, Ava, and son, William.”</p>",
  "media:content": {
    "media:description": "Ash Carter speaking at MIT in 2016.",
    "media:credit": "Image: Bryce Vickmark"
  },
  "category": [
    "Obituaries",
    "MIT Sloan School of Management",
    "School of Engineering",
    "MIT Corporation",
    "Innovation Initiative",
    "Lincoln Laboratory"
  ]
}