{
  "title": "S1E68 - Breaking Barriers in the NBA with Rockets President of Business Operations Gretchen Sheirr",
  "guid": "https://pinecast.com/guid/9b0b5bf1-751c-4bcb-a5b1-0f3c56454f17",
  "pubDate": "Thu, 29 Sep 2022 07:30:00 -0000",
  "itunes:duration": "00:57:33",
  "description": "<p>Not many things bond you like the trauma of learning the ten-meter platform together, and that’s exactly how Laura and this week’s guest, Gretchen Sheirr, became friends. A former US national finalist in diving, Gretchen is President of Business Operations for the Houston Rockets, making her the fourth woman to lead the business operations of an NBA team. Gretchen kicks off the episode with her journey from a childhood dream of being a gymnast at LSU before losing motivation, to joining the diving team (about a week before Laura!), and finally getting to LSU on a diving scholarship. She and Laura also discuss how their friendships helped drive them to do better and the intense pressure now being put on high school athletes. And Gretchen talks about how being an athlete teaches you lessons that set you up for life, including accountability, coping with change, and how to respond to feedback constructively.</p>\n<p>Next, Gretchen discusses her decision to become a business major and how combining that with her passion for sports led her into the sports marketing industry and a job with the Rockets in the early 2000s. She talks about the changes the franchise was going through at that time and how that allowed her to make quick progress in her career while staying with the team. She also tackles what it takes to get into the sports industry and succeed, including a willingness to take risks, set goals, and make sacrifices. Laura then asks her to talk about what it feels like to be one of only a handful of women at the top of the NBA, and Gretchen admits there’s a lot of pressure but also opportunities to raise others up, such as her work with Women in Sport and Events (WISE). The discussion then pivots to how the NBA and the Rockets dealt with the impact of COVID and the loss of live events by creating the NBA Bubble, plus Gretchen shares what she and the team are doing now to bring people back in. And finally, Gretchen shares how she maintains her work/life balance by knowing her glass balls from her rubber ones and gives some advice to upcoming athletes not to worry too much about getting internships and focus on their full-time job of college and competing.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Gretchen’s journey to competitive diving</li>\n<li>What being an athlete teaches you</li>\n<li>Succeeding in the sports industry</li>\n<li>Being a woman at the top of the NBA</li>\n<li>How the Rockets coped with COVID</li>\n</ul>\n<p>Quotes:</p>\n<ul>\n<li>“Some of our friends’ kids are older, and they’re really good athletes. And they’re talking about this stuff at an age that I hadn’t even started in the sport that I went to college on a scholarship for, that I was relatively decent at, at a time where parents these days are freaking out if their kids aren’t even getting recruited.”</li>\n<li>“As an athlete, you hear that every single day, all day, every day, multiple times a day, that this wasn’t good enough, that was bad, or this was good. So you learn how to take a compliment and recognize what you’re doing well and make that even better. And you learn how to take negative feedback in a constructive way and correct yourself.”</li>\n<li>“You need to be prepared to take risks and to move if growing your career is the most important thing. Which I’m not saying that it is—everybody needs to live their own life and create their own path and not necessarily follow other people. And they’re like, but you didn’t leave. And I was like, I know, but I went into it knowing that I would likely have to at some point, it just didn’t happen.”</li>\n<li>“In order to go to the next step, you have to sort of master what you’re currently doing. And until you’ve mastered what you’re currently doing, or at least shown that you have the commitment to master what you’re currently doing, why would anyone want to talk to you about the next thing?”</li>\n<li>“Monday is high school orientation, that me, as an idiot, thought was Monday night. And today, I found out that it is not Monday night, it is at 8:30 on Monday morning. And so I had to cancel two meetings, and I had to reschedule them because I’m going to high school orientation with my kids. Like, that’s a glass ball, not dropping it.”</li>\n</ul>\n<p><a href=\"https://www.kaatsu.com/go/PURSUIT\" rel=\"nofollow\">Pursuit of Gold Podcast is brought to you by Kaatsu Global</a></p>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold</a>\n<a href=\"https://laurawilkinson.com/coaching\" rel=\"nofollow\">1-on-1 Coaching with Laura</a>\n<a href=\"https://www.laurawilkinson.com/journal\" rel=\"nofollow\">The Confidence Journal</a>\n<a href=\"https://laurawilkinson.com/book\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a></p>\n<p>Laura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura’s Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura’s Facebook</a></p>\n<p>Gretchen Sheirr:\n<a href=\"https://www.linkedin.com/in/gretchen-sheirr-7ba3586/\" rel=\"nofollow\">LinkedIn</a></p>",
  "itunes:title": "Breaking Barriers in the NBA with Rockets President of Business Operations Gretchen Sheirr",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 68
}