{
  "title": "58: Aaron Anastasi- Silencing Limitations and Finding The Voice of Your Dreams",
  "pubDate": "Wed, 05 Oct 2016 18:25:32 +0000",
  "guid": "a44fcf1b14bd9f7316f7ee6f6558b1aa",
  "link": "https://lifeonpurpose.libsyn.com/58-aaron-anastasi-silencing-limitations-and-finding-the-voice-of-your-dreams",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #58</strong>, my guest is artist, executive coach, author, actor and filmmaker <strong>Aaron Anastasi</strong>.<br /> <br /> <strong>Aaron</strong> joined me for an inspirational chat about his new book, <em>The Voice of Your Dreams</em>, a practical guide about silencing the voices of limitation that may be impeding your progress and living a life full of greater possibility.</p> <p>We also talked about his own unique life journey (surfer, singer, theological student, actor, and more!), overcoming fear, the \"Rackets\" that can limit us in life and how to shift those, \"the Work\" of Byron Katie, and MUCH more!<br /> <br /> <em>“All fear comes from contemplating the future. Action eradicates fear, as does shifting the focus from self to the end user—those being served by you.”</em><br /> <br /> About: <strong>Aaron Anastasi</strong> is a Southern California native who graduated with a master’s degree from Princeton Theological Seminary, where he studied philosophy, psychology, and theology.<br /> <br /> He’s also a serial entrepreneur with online businesses such as Superior Songwriting Method, Signing Success, and the internationally recognized, Superior Singing Method, an online singing lesson program that grosses seven-figures annually.<br /> <br /> <strong>Aaron</strong> has the #1 singing/life lesson channel on YouTube and has over 11.5 million organic views and over 130 thousand subscribers total on his three channels.<br /> <br /> Having a love for adventure, he was a pro snowboarder in Vail, Colorado, scaled Glacier Lake mountains in Bolivia, and cut pathways through the jungles of Contagem, Brazil.<br /> <br /> Along with being a Los Angeles based actor and filmmaker, <strong>Aaron</strong> is also a prominent success coach for clients in industry-leading roles, ranging from film directors to marine biologists to TEDx speakers.<br /> <br /> His new book, <em>The Voice of Your Dreams</em>, was released in April 2016, and reached Amazon's top 100 best sellers within the first week of release.<br /> <br /> To learn more about <strong>Aaron</strong> and his work, visit: <a href=\"https://thevoiceofyourdreams.com/home-a\" target= \"_blank\">https://thevoiceofyourdreams.com/home-a</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #58, my guest is artist, executive coach, author, actor and filmmaker Aaron Anastasi.  Aaron joined me for an inspirational chat about his new book, <em>The Voice of Your Dreams</em>, a practical guide about silencing the voices of limitation that may be impeding your progress and living a life full of greater possibility.</p> <p>We also talked about his own unique life journey (surfer, singer, theological student, actor, and more!), overcoming fear, the \"Rackets\" that can limit us in life and how to shift those, \"the Work\" of Byron Katie, and MUCH more!  <em>“All fear comes from contemplating the future. Action eradicates fear, as does shifting the focus from self to the end user—those being served by you.”</em>  About: Aaron Anastasi is a Southern California native who graduated with a master’s degree from Princeton Theological Seminary, where he studied philosophy, psychology, and theology.  He’s also a serial entrepreneur with online businesses such as Superior Songwriting Method, Signing Success, and the internationally recognized, Superior Singing Method, an online singing lesson program that grosses seven-figures annually.  Aaron has the #1 singing/life lesson channel on YouTube and has over 11.5 million organic views and over 130 thousand subscribers total on his three channels.  Having a love for adventure, he was a pro snowboarder in Vail, Colorado, scaled Glacier Lake mountains in Bolivia, and cut pathways through the jungles of Contagem, Brazil.  Along with being a Los Angeles based actor and filmmaker, Aaron is also a prominent success coach for clients in industry-leading roles, ranging from film directors to marine biologists to TEDx speakers.  His new book, <em>The Voice of Your Dreams</em>, was released in April 2016, and reached Amazon's top 100 best sellers within the first week of release.  To learn more about Aaron and his work, visit: <a href=\"https://thevoiceofyourdreams.com/home-a\" target= \"_blank\">https://thevoiceofyourdreams.com/home-a</a>.</p>",
  "enclosure": "",
  "itunes:duration": "58:19",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #58, my guest is artist, executive coach, author, actor and filmmaker Aaron Anastasi.  Aaron joined me for an inspirational chat about his new book, The Voice of Your Dreams, a practical guide about silencing the voices of..."
}