{
  "id": "yt:video:if8BfGpC0ho",
  "yt:videoId": "if8BfGpC0ho",
  "yt:channelId": "UC4a-Gbdw7vOaccHmFo40b9g",
  "title": "Internet Safety Course Introduction",
  "link": "",
  "author": {
    "name": "Khan Academy",
    "uri": "https://www.youtube.com/channel/UC4a-Gbdw7vOaccHmFo40b9g"
  },
  "published": "2022-10-20T18:00:24+00:00",
  "updated": "2022-10-26T12:43:22+00:00",
  "media:group": {
    "media:title": "Internet Safety Course Introduction",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The internet is a tool that we use every day - in addition to learning information, it's also how many of us shop, manage finances, and stay connected with others. But that connectivity comes with risks. In this course, Khan Academy interviewed Google’s top security experts to bring you videos packed with powerful tips to help you stay safe. There are articles and practice exercises to help you test what you’ve learned about how to keep your information and devices secure, and how to recognize and avoid common scams. You'll also have the opportunity to learn more about the technological underpinnings of internet safety.\n\nKhan Academy is a nonprofit organization with the mission of providing a free, world-class education for anyone, anywhere. We offer quizzes, questions, instructional videos, and articles on a range of academic subjects, including math, biology, chemistry, physics, history, economics, finance, grammar, preschool learning, and more. We provide teachers with tools and data so they can help their students develop the skills, habits, and mindsets for success in school and beyond. Khan Academy has been translated into dozens of languages, and 15 million people around the globe learn on Khan Academy every month. As a 501(c)(3) nonprofit organization, we would love your help! \n\nDonate or volunteer today! Donate here: https://www.khanacademy.org/donate\n\nVolunteer here: https://www.khanacademy.org/contribute",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}