{
  "guid": "urn:uuid:c92aa93e-cf5e-451a-8b75-88e0245cf949",
  "link": "https://www.who.int/news/item/10-10-2022-unique-friendship-benches-initiative-inaugurated-to-promote-mental-health--featuring-competing-fifa-world-cup-nations",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Unique Friendship Benches initiative inaugurated to promote mental health, featuring competing FIFA World Cup nations",
  "description": "<ul data-list=\"0\" data-level=\"1\"><li><em>32 benches &ndash; representing each participating FIFA World Cup nation &ndash; are being built to promote mental health. </em></li><li><em>Benches announcement coincides with today&rsquo;s World Mental Health Day and symbolic inauguration event at 974 Stadium, Doha</em></li><li><em>H.E. Sheikha Hind and Sir Mo Farah unveiled England bench during World Innovation Summit for Health</em></li></ul><p><em>&nbsp;</em></p><p>A unique project involving custom-made public benches to promote the critical importance of mental health, and the role that football and sport more broadly can play to promote mental well-being, was announced today. Thirty-two &ldquo;Friendship Benches&rdquo; &ndash; one for each nation competing in the&nbsp;FIFA World Cup Qatar 2022&trade; &ndash; are being built for installation in prominent Doha locations, including the precincts of tournament stadiums.<br /></p><p>The project is part of the <a href=\"https://www.who.int/initiatives/sports-and-health/healthy-2022-world-cup\">Sport for Health partnership</a>, led by the World Health Organization and Qatar&rsquo;s Ministry of Public Health. Its goal is to demonstrate the importance of mental health and offer advice on ways to promote mental well-being, including through the importance of physical activity and sport. The initiative is supported by FIFA, the Supreme Committee for Delivery &amp; Legacy, <a href=\"https://2022.wish.org.qa/\">WISH</a>, the <a href=\"https://www.friendshipbenchzimbabwe.org/\">Friendship Benches</a> NGO and the <a href=\"https://extranet.who.int/uhcpartnership/\">WHO Universal Health Coverage Partnership.</a> <br /></p><p>In conjunction with <a href=\"https://www.who.int/campaigns/world-mental-health-day/2022\">World Mental Health Day</a>, a selection of the first benches is being &nbsp;presented today at 974 Stadium, in Doha, one of the venues for this year&rsquo;s FIFA World Cup. The bench initiative was symbolically inaugurated with the preview of the England bench at Qatar Foundation&rsquo;s global health event, the World Innovation Summit for Health (WISH) in the lead-up a larger reveal of the benches on <a href=\"https://www.who.int/campaigns/world-mental-health-day/2022\">World Mental Health Day</a>. <br /></p><p>English athlete Sir Mo Farah, whose ten Olympic and World Championship gold medals make him the most successful male track distance runner ever, inaugurated the England bench, where he was joined by Her Excellency Sheikha Hind bint Hamad Al Thani, Vice Chairperson and CEO of Qatar Foundation, for a conversation about sport and mental health &ndash; a symbolic recognition of the initiative.<br /></p><p>&ldquo;Meeting Sir Mo and hearing the compelling story of how he left Mogadishu for London as a young boy and the mental health challenges he faced highlighted the importance of sitting down and talking about our mental health,&rdquo; H.E. Sheikha Hind said. &ldquo;I&rsquo;m proud that Qatar Foundation&rsquo;s global health initiative is among those helping shine a spotlight on mental health in such an innovative and practical way.&rdquo;<br /></p><p>The benches project aligns with common goals and campaigns of each of partner organization, including the <a href=\"https://www.fifa.com/about-fifa/medical/news/fifa-launches-reach-out-campaign-for-better-mental-health\">FIFA-WHO #REACHOUT campaign</a>, the &ldquo;<a href=\"https://sehanafsia.moph.gov.qa/English/Pages/AreYouOk.aspx\">Are You OK?&rdquo; project</a> of the Qatar&rsquo;s Ministry of Public Health, and the groundbreaking Friendship Benches project itself, originally developed in Zimbabwe and supported by WHO. The WISH event has in the past also been used as a platform to promote the Friendship Benches concept. This initiative also aims at promoting physical activity as one of the key outcomes of the Sport and Health project.&nbsp; To this end a special feature appearing on each bench are illustrations with advice describing easy and effective exercises that visitors can practice for their physical health.<br /></p><p>&ldquo;The bench is a simple yet powerful vehicle for promoting mental health, from park benches&nbsp; to football stadiums,&rdquo; said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. &ldquo;The Friendship Benches project is a reminder of how the simple act of sitting down to talk can make a huge difference to mental health.&rdquo;<br /></p><p>H.E. Dr Hanan Al Kuwari, Minister of Public Health, Qatar, said the benches project was a tangible, lasting symbol of the importance of the Sport for Health partnership and the goals it is striving to achieve for the upcoming FIFA World Cup&trade; in Qatar &ndash; the first held in the Middle East and Arab world &ndash; and the legacy WHO and the Qatar&rsquo;s Ministry of Public Health are working to leave.<br /></p><p>&ldquo;Mental health is a core component of the Sport For Health partnership and our goal is for the Friendship Benches to provide a place, during and after the FIFA World Cup, for residents and visitors to Qatar to come together and ask each other &lsquo;Are You OK?&rsquo; and use the opportunity to engage in dialogue and physical activities,&rdquo; H.E. Dr Al Kuwari said.<br /></p><p>H.E. Hassan Al Thawadi, Secretary General, SC, said: &ldquo;We are proud to support this project and further leverage our hosting of the FIFA World Cup. The benches will provide a permanent reminder of the first World Cup in the Middle East and Arab world, while promoting the importance of mental health in communities throughout the country.&rdquo;</p><p>FIFA President Gianni Infantino said: &ldquo;Through the #REACHOUT campaign, we acknowledged the importance of speaking with family and friends to foster positive mental health. The Friendship Benches project is another vehicle to raise awareness about mental health conditions and to encourage a conversation, which could save a life. FIFA is proud to partner with the World Health Organization, and Qatar&rsquo;s Ministry of Public Health to put football at the service of society, and to leave a lasting legacy in Qatar for residents and visitors.&rdquo;</p><p>Final locations of each of the 32 benches will be announced shortly. Once installed, information will be shared on how residents of Qatar and visitors will be able to visit their national benches, and others, in a show of support for mental health promotion.&nbsp; <br /></p><p><strong>---------------------------------------------------</strong></p><p><strong>Editor&rsquo;s note:</strong><br /></p><p>Video footage and photographs will be shared with media from the Friendship Benches inauguration event on 10 October.<br /></p><p>At 4pm Doha time, a live discussion hosted by WHO will be broadcast on its Facebook channel <a href=\"https://www.facebook.com/WHO\">https://www.facebook.com/WHO</a> <strong></strong><strong></strong></p><p><strong>Contacts:</strong><br /></p><p>Interviews and other information:<br /></p><ul data-list=\"0\" data-level=\"1\"><li>Supreme Committee for Delivery &nbsp;&amp; Legacy: <a href=\"mailto:media@sc.qa\">media@sc.qa</a></li></ul><p>&nbsp;</p>",
  "pubDate": "Mon, 10 Oct 2022 07:40:37 Z"
}