{
  "title": "Why Are Liberal Arts College Faculty Building Better Relationships with Their Students?",
  "link": "https://www.aei.org/politics-and-public-opinion/why-are-liberal-arts-college-faculty-building-better-relationships-with-their-students/",
  "dc:creator": "George Pierson",
  "pubDate": "Tue, 01 Nov 2022 17:56:33 +0000",
  "category": [
    "Politics and Public Opinion",
    "college",
    "college admissions",
    "Education"
  ],
  "guid": "https://www.aei.org/?p=1008664471",
  "description": "<p>Prospective students who want stronger connections with professors should look toward liberal arts colleges to gain the real value of truly knowing and working with your college professors.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/politics-and-public-opinion/why-are-liberal-arts-college-faculty-building-better-relationships-with-their-students/\">Why Are Liberal Arts College Faculty Building Better Relationships with Their Students?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<p>Over a decade ago, after finishing teaching Robert Putnam’s classic <em><a href=\"https://www.amazon.com/Bowling-Alone-Collapse-American-Community/dp/0743203046\" target=\"_blank\" rel=\"noreferrer noopener\">Bowling Alone</a> </em>at NYU, I took my students bowling to unwind one evening and this was met with surprise and shock by a handful of department faculty members. I was told that it was a mistake to have spent time with students, for such engagement with undergraduates signaled that I was not a serious scholar. I was taken aback. I enjoyed being more than a fairly removed, anonymous, twice-a-week lecturer helping guide these students along their academic and post-collegiate professional journeys. Yet, it was clear that connecting with undergraduate students was not a real priority at NYU, at least within the politics department.</p>\n\n\n\n<p>Now, I teach as a professor at Sarah Lawrence College, a small liberal arts college in New York. A significant part of the undergraduate experience at Sarah Lawrence involves close faculty work with students and helping supervise research regularly. Many liberal arts colleges promote themselves <a href=\"https://www.amherst.edu/academiclife\" target=\"_blank\" rel=\"noreferrer noopener\">as teaching-centered</a>, personal, and dynamic compared to a typical university experience that tends to focus more on faculty research than teaching. These significant institutional details have certainly been my experience over the years, and I have long wondered if this perception is generally correct.</p>\n\n\n\n<p>New data from College Pulses’ <a href=\"https://www.insidehighered.com/news/2022/05/20/survey-students-want-connections-professors-may-not-initiate-them\" target=\"_blank\" rel=\"noreferrer noopener\">Students Views on Faculty survey</a> provides some insight here as the survey captured the voices of 2000 students at 120 schools ranging from liberal arts colleges to community colleges and universities. The survey explicitly asks students how well they believe their professors and instructors build relationships with students, and the results from the data are encouraging: six in 10 (60 percent) of current students in higher education institutions think that professors are excellent or good, while just 13 percent think that faculty do a poor job interfacing with their students. Unlike many caricatures, professors are not aloof and the majority do connect with their students.</p>\n\n\n\n<p>Such positive sentiments toward faculty, however, are not uniform across higher education institutions. Liberal arts schools that, like my own, take great pride in intimate teaching do truly stand apart. Seventy-two percent of enrolled students in these small collegiate settings report that their professors are good or excellent in terms of building relationships with their students. In contrast, the figure is appreciably lower at 57 percent for universities. Sixty-four percent of students at both community colleges and at regional schools—institutions with huge enrollments that often transform the lives of their students—think that their faculty members are good or excellent at connecting with them, suggesting that big research universities leave something to be desired on the teaching front.</p>\n\n\n\n<p>Breaking this down a bit further, among the top 25 universities per <a href=\"https://www.usnews.com/best-colleges/rankings/national-universities\" target=\"_blank\" rel=\"noreferrer noopener\">the US News rankings</a>, 55 percent of their students rank their faculty as good or excellent in connecting with students. That figure climbs to 63 percent from 26 through 100 ranked universities; for schools ranked above 100, the figure is back down a bit to 55 percent, suggesting that even in schools which have lower reputational status, connecting with students is still a lower priority compared to liberal arts colleges. Turning to liberal arts schools, 68 percent of students at a top-25 school have a good or excellent connection with their professor. Liberal arts students at schools from 25 to 100 are more positive at 93 percent. While scholarship remains a priority among the liberal arts, these lower-ranked liberal arts schools focus on teaching, while research is not as much of a priority. This creates a culture of teaching and intimacy.</p>\n\n\n\n<p>It is unambiguously clear that faculty in liberal arts colleges are far more likely to be connected with their students compared to those in universities. There are <a href=\"https://www.apu.edu/articles/the-importance-of-the-professor-and-student-connection/\" target=\"_blank\" rel=\"noreferrer noopener\">so many benefits</a> that flow from these relationships, from promoting better in-class performance to faculty members serving as mentors and advocates.&nbsp;I have loved working with so many students so closely over the years; it has helped me better understand political and generational change and has provided endless insights into my own research. And now, new data backs up my own experiences. While it is true that university professors can and do form real relationships and connect with their students, connectivity at liberal arts colleges is far deeper. Thus, prospective students who <a href=\"https://www.insidehighered.com/news/2022/05/20/survey-students-want-connections-professors-may-not-initiate-them\" target=\"_blank\" rel=\"noreferrer noopener\">want stronger connections with professors</a> should look toward liberal arts colleges and accept that there are some tradeoffs because of scale and scope, but what is gained is the real value in truly knowing and working with your college professors.</p>\n\n\n\n<p><em>Samuel J. Abrams is a professor of politics at Sarah Lawrence College and a senior fellow at the American Enterprise Institute.</em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<div class=\"related-items shortcode \"><p><strong>Learn more: </strong><a href=\"https://www.aei.org/society-and-culture/the-positive-side-of-social-media/\">The Positive Side of Social Media</a> | <a href=\"https://www.aei.org/politics-and-public-opinion/finding-third-places-across-america/\">Finding Third Places Across America</a> | <a href=\"https://www.aei.org/op-eds/finding-third-places-across-america/\">Finding third places across America</a> | <a href=\"https://www.aei.org/articles/a-collegiate-reality-check%ef%bf%bc/\">A Collegiate Reality Check</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/politics-and-public-opinion/why-are-liberal-arts-college-faculty-building-better-relationships-with-their-students/\">Why Are Liberal Arts College Faculty Building Better Relationships with Their Students?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}