{
  "id": "tag:blogger.com,1999:blog-1176949257541686127.post-8888529176620158656",
  "published": "2022-10-11T13:01:00.004-04:00",
  "updated": "2022-10-11T19:22:42.718-04:00",
  "category": [
    "",
    "",
    ""
  ],
  "title": "Google Pixel 7 and Pixel 7 Pro: The next evolution in mobile security",
  "content": "<span class=\"byline-author\">Dave Kleidermacher, Jesse Seed, Brandon Barbello, Sherif Hanna, Eugene Liderman, Android, Pixel, and Silicon Security Teams</span> <p>Every day, billions of people around the world trust Google products to enrich their lives and provide helpful features –  across mobile devices, smart home devices, health and fitness devices, and more. We keep more people safe online than anyone else in the world, with products that are secure by default, private by design and that put you in control. As our advancements in knowledge and computing grow to deliver more help across contexts, locations and languages, our unwavering commitment to protecting your information remains. </p><p>That’s why Pixel phones are designed from the ground up to help protect you and your sensitive data while keeping you in control. We’re taking our industry-leading approach to security and privacy to the next level with Google Pixel 7 and Pixel 7 Pro, our most secure and private phones yet, which were recently recognized as the highest rated for security when tested among other smartphones by a third-party global research firm.<sup id=\"fnref1\"><a href=\"#fn1\" rel=\"footnote\">1</a></sup>  </p><p>Pixel phones also get better every few months with Feature Drops that provide the latest product updates, tips and tricks from Google. And Pixel 7 and Pixel 7 Pro users will receive at least five years of security updates<sup id=\"fnref2\"><a href=\"#fn2\" rel=\"footnote\">2</a></sup>, so your Pixel gets even more secure over time. </p><p><strong>Your protection, built into Pixel</strong></p><p>Your digital life and most sensitive information lives on your phone: financial information, passwords, personal data, photos – you name it. With Google Tensor G2 and our custom Titan M2 security chip, Pixel 7 and Pixel 7 Pro have multiple layers of hardware security to help keep you and your personal information safe. We take a comprehensive, end-to-end approach to security with verifiable protections at each layer - the network, application, operating system and multiple layers on the silicon itself. If you use Pixel for your business, this approach helps protect your company data, too.  </p><p><div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEggAnSsDEwcnzxZ_CBRosEw8rzu5l27OQXjqQ3yS0bQ96h0Gt-4OKxF9e81zd0NSHDoPwRxOHj3L0CFamDm_3ROfLsQQw-zvHEWfO2UyOyAWep-sQJqkVkc2ThW-gSdpn4cqbyiXWR0PciKdTL8sBFUM0jVBq-Neo9FK32TyiFfaE9MjyKjAqiNLPdcBQ/s1600/google_de22_thumbnails_tensor_light_1156x578.png\" style=\"display: block; padding: 1em 0; text-align: center; \"><img alt=\"\" border=\"0\" data-original-height=\"578\" data-original-width=\"1156\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEggAnSsDEwcnzxZ_CBRosEw8rzu5l27OQXjqQ3yS0bQ96h0Gt-4OKxF9e81zd0NSHDoPwRxOHj3L0CFamDm_3ROfLsQQw-zvHEWfO2UyOyAWep-sQJqkVkc2ThW-gSdpn4cqbyiXWR0PciKdTL8sBFUM0jVBq-Neo9FK32TyiFfaE9MjyKjAqiNLPdcBQ/s1600/google_de22_thumbnails_tensor_light_1156x578.png\"/></a></div> </p><p>Google Tensor G2 is Pixel’s newest powerful processor custom built with Google AI, and makes Pixel 7 faster, more efficient and secure<sup id=\"fnref3\"><a href=\"#fn3\" rel=\"footnote\">3</a></sup>. Every aspect of Tensor G2 was designed to improve Pixel's performance and efficiency for great battery life, amazing photos and videos.  </p><p>Tensor’s built-in security core works with our Titan M2 security chip to keep your personal information, PINs and passwords safe. Titan family chips are also used to protect Google Cloud data centers and Chromebooks, so the same hardware that protects Google servers also secures your sensitive information stored on Pixel.  </p><p>And, in a first for Google, Titan M2 hardware has now been certified under Common Criteria PP0084: the international gold standard for hardware security components also used for identity, SIM cards, and bankcard security chips.<sup id=\"fnref4\"><a href=\"#fn4\" rel=\"footnote\">4</a></sup> This means that the Titan M2 hardware meets the same rigorous protection guidelines trusted by banks, carriers, and governments.  </p><p>To achieve the certification we went through rigorous third party lab testing by SGS Brightsight, a leading international security lab, and received certification against CC PP0084 with AVA_VAN.5 for the Titan M2 hardware and cryptography library from the Netherlands scheme for Certification in the Area of IT Security (NSCIB).  Of all those numbers and acronyms the part we’re most proud of is that Titan hardware passed the highest level of vulnerability assessment (AVA_VAN.5) - the truest measure of resilience to advanced, methodical attacks. </p><p>This process took us more than three years to complete. The certification not only requires chip hardware to resist invasive penetration testing, but also mandates audits of the chip design and manufacturing process itself.  The benefit for consumers? The now certified Titan M2 chip makes your phone even more resilient to sophisticated attacks.<sup id=\"fnref5\"><a href=\"#fn5\" rel=\"footnote\">5</a></sup></p><p><strong>Private by design</strong></p><p>Evolving our security and privacy standards to our fast-paced world requires new approaches as well. Earlier this year at I/O, we <a href=\"https://blog.google/technology/safety-security/how-we-make-every-day-safer-with-google/\">introduced Protected Computing</a>, a toolkit of technologies that transforms how, when, and where personal data is processed to protect your privacy and security. Our approach focuses on: </p><ol> <li>Minimizing your data footprint, by shrinking the amount of personally identifiable data altogether  <li>De-identifying data, with a range of anonymization techniques so it’s not linked to you  <li>Restricting data access using technologies like end-to-end encryption and secure enclaves.  </li></ol><p>Many elements of Protected Computing can be found on the new Pixel 7: </p><p>On Android, Private Compute Core keeps your information and AI-driven personalizations private with on-device processing. Data from features like Now Playing, Live Caption and Smart Reply in Messages are all processed on device and are never sent to Google to maintain your privacy.  And even your device backups to the cloud are <a href=\"https://security.googleblog.com/2018/10/google-and-android-have-your-back-by.html\">end-to-end encrypted</a> using Titan in the cloud.<sup id=\"fnref6\"><a href=\"#fn6\" rel=\"footnote\">6</a></sup>   </p><p>With Google Tensor G2, Pixel’s advanced privacy protection also now covers audio data from events like cough and snore detection on Pixel 7.<sup id=\"fnref7\"><a href=\"#fn7\" rel=\"footnote\">7</a></sup> Audio data from cough and snore detection is never stored by or sent to Google to maintain your privacy.  </p><p>On Pixel 7, Tensor G2 helps safeguard your system with the <a href=\"https://source.android.com/docs/core/virtualization\">Android Virtualization Framework</a>, unlocking improved security protections like enabling system update integrity checking to occur on-the-fly, reducing boot time after an update.  </p><p><strong>Extra protection when you’re online</strong></p><p>Helping to keep you safe when you use your phone to browse the web and use apps is also critical. This is where a Virtual Private Network (VPN) comes in. A VPN helps protect your online activity from anyone who might try to access it by encrypting your network traffic to turn it into an unreadable format, and masking your original IP address. Typically, if you want a VPN on your phone, you need to get one from a third party. </p><p>To ensure more people have access to enhanced security, later this year, Pixel 7 and Pixel 7 Pro owners will be able to use VPN by Google One, at no extra cost.<sup id=\"fnref8\"><a href=\"#fn8\" rel=\"footnote\">8</a></sup> <a href=\"https://one.google.com/about/vpn/howitworks\">VPN by Google One</a> is verifiably private, and will allow you to tap into Google’s world-class security for peace of mind when you connect online. With VPN by Google One, Pixel helps protect your online activity at a network level. Think of it like an extra layer of protection for your online security.  </p><p>VPN by Google One creates a high-performance secure connection to the web so your browsing and app data is sent and received via an encrypted pathway. A few simple taps will activate the VPN to help keep your network traffic private from internet providers and hackers, giving you peace of mind when using cellular data, home Wi-Fi, and especially when connected to public networks, like a café or airport Wi-Fi. No need to worry about online intruders, hackers, or unsecure networks.  </p><p> <div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEixLYAdyddPs0T4MgNq-Zgxlat6JywluvS4ucFjzwW_Mx8L6dFJUZNxL9Bql9VUcqiVp4zKCjbvyM9ziy2haRc3dqERPlTgptnQRcjrc5mHadFXpl1EE7LmwehMFIobdGb1GTvKyCAexBZKFKUu9wQyTsL1tvieNiyJANodD7mrwqfZOD9lOSbqAf3WKA/s1600/image_P7P_VPN.jpg\" style=\"display: block; padding: 1em 0; text-align: center; \"><img alt=\"\" border=\"0\" data-original-height=\"3049\" data-original-width=\"4572\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEixLYAdyddPs0T4MgNq-Zgxlat6JywluvS4ucFjzwW_Mx8L6dFJUZNxL9Bql9VUcqiVp4zKCjbvyM9ziy2haRc3dqERPlTgptnQRcjrc5mHadFXpl1EE7LmwehMFIobdGb1GTvKyCAexBZKFKUu9wQyTsL1tvieNiyJANodD7mrwqfZOD9lOSbqAf3WKA/s1600/image_P7P_VPN.jpg\"/></a></div>      </p><p>Unlike traditional VPN services, VPN by Google One uses Protected Computing to technically make it impossible for anyone at a network level, even VPN by Google One, to link your online traffic with your account or identity. VPN by Google One will be available at no extra cost as long as your phone continues to receive security updates. <a href=\"https://support.google.com/googleone/answer/7582172?hl=en&amp;co=GENIE.Platform%3DAndroid\" target=\"_blank\">See here</a> to learn more about VPN by Google One. </p><p><strong>More protection and privacy with Android 13</strong><br></p><p>Pixel 7 and Pixel 7 Pro have built-in anti-phishing protections from Android that scan for potential threats from phone calls, text messages and emails, and more anti-phishing protections enabled out-of-the-box than smartphones from leading competitors.<sup id=\"fnref9\"><a href=\"#fn9\" rel=\"footnote\">9</a></sup> In fact, Messages alone protects consumers against <a href=\"https://security.googleblog.com/2022/05/io-2022-android-13-security-and-privacy.html\">1.5 billion spam messages per month</a>. </p><p>Android also resets permissions for apps you haven’t used for an extended time. In a typical month, Android automatically resets more than 3 billion permissions affecting more than 1 billion installed apps. Similarly, if you use clipboard on Android 13, your history is automatically deleted after a period of time. This blocks apps running in the foreground from seeing old information that you previously copied. </p><p><strong>You’re in control</strong></p><p><br>Core to your safety is knowing that you’re in control. You always have control over your settings and devices across all of our products. With Android 13, coming soon through a Feature Drop, Pixel 7 and Pixel 7 Pro will give you additional ways to stay in control of your privacy and what you share with first and third-party apps. With Quick Settings, you can act on security issues as they arise, or review which apps are running in the background and easily stop them. You’ll have a single destination for reviewing your security and privacy settings, risk levels and information, making it easier to manage your safety status.  </p><p> <div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhszhPW14qxBvA6-0E1zSIx5L8GXiJqPswYsEHbBnt0mIm8UlVC8SKjhAnPFtxTUThZ3rXF5QSi6F1adzLi5LtD2EzuyO3lkbDRdAXZ-xw4kA9ZedcHc5SJSWQGqUzA0VtUGeANLhaJrGOBw8_yBCTJg6cd6lFbfSqwdnoeopl-b_fxNEMrqPTTRiztZQ/s944/Security%20and%20privacy%20settings%20%281%29.gif\" style=\"display: block; padding: 1em 0; text-align: center; \"><img alt=\"\" border=\"0\" height=\"400\" data-original-height=\"944\" data-original-width=\"447\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhszhPW14qxBvA6-0E1zSIx5L8GXiJqPswYsEHbBnt0mIm8UlVC8SKjhAnPFtxTUThZ3rXF5QSi6F1adzLi5LtD2EzuyO3lkbDRdAXZ-xw4kA9ZedcHc5SJSWQGqUzA0VtUGeANLhaJrGOBw8_yBCTJg6cd6lFbfSqwdnoeopl-b_fxNEMrqPTTRiztZQ/s400/Security%20and%20privacy%20settings%20%281%29.gif\"/></a></div>   </p><p>With this new experience, you can review actionable steps to improve your safety status, like revoking a permission or app. This page will also have new action cards to notify you of any safety risks and provide timely recommendations on how to enhance your privacy. And with a single tap, you can grant or remove permissions to data that you don’t want to share with compatible apps. This will be coming soon first to Pixel devices later this year, and other Android phones soon after. </p><p><strong>Verifiably secure </strong></p><p>As computing extends to more devices and use cases, Google is committed to innovating in security and being transparent about the processes that we take to get there. We are leading the industry in verifiable security by not only having products that are tested against real-world threats (like advanced spam, phishing and malware attacks), but also in publishing the results of penetration tests, security audits, and industry certifications across our <a href=\"https://g.co/pixel/certifications\">Pixel</a> and <a href=\"https://support.google.com/product-documentation/answer/10231940\">Nest</a> products. </p><p>Another way to verify our security is through our Android and Google Devices Security Reward Program where we reward security researchers who find vulnerabilities across products, including Pixel, Nest and Fitbit. Last year on Android, we <a href=\"https://security.googleblog.com/2022/02/vulnerability-reward-program-2021-year.html\">awarded nearly $3 million dollars</a>, creating a valuable feedback loop between us and the security research community and, most importantly, helping us keep our users safe.           </p><p>To learn more about Pixel 7 and Pixel 7 Pro, check out the <a href=\"https://store.google.com/category/phones?hl=en-US\">Google Store</a>. </p> <!-- Footnotes themselves at the bottom. --> <h2>Notes</h2><div class=\"footnotes\"><hr><ol><li id=\"fn1\"><p>     Based on third-party global research firm. Evaluation considered features that may not be available in all countries. See <a href=\"https://omdia.tech.informa.com/commissioned-research/articles/mobile-device-security-2022-annual-buyers-scorecard-assessing-the-security-of-leading-mobile-devices\">here</a> for more information. &nbsp;<a href=\"#fnref1\" rev=\"footnote\">&#8617;</a><li id=\"fn2\"><p>     <sup> </sup>Android version updates and feature drops for at least 3 years from when the device first became available on the Google Store in the US. Android security updates for at least 5 years from when the device first became available on the Google Store in the US. See g.co/pixel/updates for details.&nbsp;<a href=\"#fnref2\" rev=\"footnote\">&#8617;</a><li id=\"fn3\"><p>     Compared to Pixel 6. Speed and efficiency claims based on internal testing on pre-production devices. &nbsp;<a href=\"#fnref3\" rev=\"footnote\">&#8617;</a><li id=\"fn4\"><p>     Common Criteria certification for hardware and cryptographic library (CC PP0084 EAL4+, AVA_VAN.5 and ALC_DVS.2). See g.co/pixel/certifications for details.&nbsp;<a href=\"#fnref4\" rev=\"footnote\">&#8617;</a><li id=\"fn5\"><p>     Compared to Pixel 5a and earlier Pixel phones. &nbsp;<a href=\"#fnref5\" rev=\"footnote\">&#8617;</a><li id=\"fn6\"><p>     Excludes MMS attachments and Google Photos.&nbsp;<a href=\"#fnref6\" rev=\"footnote\">&#8617;</a><li id=\"fn7\"><p>     <strong> </strong>Not intended to diagnose, cure, mitigate, prevent or treat any disease or condition. Consult your healthcare professional if you have questions about your health. See g.co/pixel/digitalwellbeing for more information. &nbsp;<a href=\"#fnref7\" rev=\"footnote\">&#8617;</a><li id=\"fn8\"><p>     Coming soon. Restrictions apply. Some data is not transmitted through VPN. Not available in all countries. All other Google One membership benefits sold separately. This VPN offer does not impact price or benefits of Google One  Premium plan. Use of VPN may increase data costs depending on your plan. See g.co/pixel/vpn for details.&nbsp;<a href=\"#fnref8\" rev=\"footnote\">&#8617;</a><li id=\"fn9\"><p>     Based on third-party research funded by Google LLC in June 2022. Evaluation based on no-cost smartphone features enabled by default. Some features may not be available in all countries. See <a href=\"https://www.leviathansecurity.com/media/5fajnujsa8tzkdf5sznnw0utdvqd9g-tgwn4-pp73e\">here</a> for more information.&nbsp;<a href=\"#fnref9\" rev=\"footnote\">&#8617;</a> </ol></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Edward Fernandez",
    "uri": "http://www.blogger.com/profile/03784424747198152685",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}