{
  "id": "yt:video:LJglcvTbjxs",
  "yt:videoId": "LJglcvTbjxs",
  "yt:channelId": "UCAY_M9HyJb8oMKPV1utQQyA",
  "title": "Huawei Nova 10 Pro Hands-on | The Ultimate TikTok Phone?",
  "link": "",
  "author": {
    "name": "TechRadar",
    "uri": "https://www.youtube.com/channel/UCAY_M9HyJb8oMKPV1utQQyA"
  },
  "published": "2022-09-07T12:53:10+00:00",
  "updated": "2022-09-08T15:46:26+00:00",
  "media:group": {
    "media:title": "Huawei Nova 10 Pro Hands-on | The Ultimate TikTok Phone?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "“A phone for the TikTok generation.”\nThat’s what I heard when I was at IFA last week getting some early hands-on time with the newly announced Huawei Nova 10 and 10 pro. \n\nThe Huawei Nova 10 is 6.67-inches in the hand. It has a 2652x1200 resolution display, with a dynamic 120hz refresh rate; meaning it can scale its frame rate depending on what you're doing, to save battery.\n\nThe 10 Pro has the same display specs although it’s slightly bigger at 6.78 inches. \nAll of this display tech is coupled with dual stereo speakers on both phones, making for a decent viewing and gaming experience.\n\nA mid-range Snapdragon 778G chipset powers both phones, with 8GB of RAM, and 256GB of storage in tow. \n\nThe phones have slightly different batteries, with the Nova 10 packing a 4000mAh battery and the pro boasting a 4500mAh cell.\n \nNeither phone supports wireless charging, however, the pro does support impressive 100 watt fast charging, while the normal nova 10 is limited to a still impressive 66 watt huawei fast charging. And you do get a charger in the box, so bonus points for Huawei there.\n\nBoth devices feature a 60MP Ultra-Wide Angle front facing camera, capable of 4K video capture, and the HUAWEI nova 10 Pro also features an additional 8MP portrait camera for better selfie snapping. \n\nLong gone are the days when having the biggest megapixel count on your phone meant that you had the best camera phone on the market. Software, AI and post image processing all play into the quietly of your smartphone camera from both a user experience point of view and producing a plastering image.  \n\n0:00-1:21 Huawei Nova 10 Pro Hands-on\n1:21-2:40 Specs + test experience\n2:40-4:24 Camera Test\n4:24-5:07 Connectivity + Apps\n5:07-6:02 Pricing + Release date\nFind out more at techradar.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}