{
  "title": "S1E8 - Celebrating the Olympic Games with Broadcaster Ted Robinson",
  "guid": "https://pinecast.com/guid/4f05931c-8fe9-49cf-a2b6-d2c4808545cd",
  "pubDate": "Tue, 28 Jul 2020 07:30:32 -0000",
  "itunes:duration": "01:04:34",
  "description": "<p>Given that today marks what should have been the fifth day of competition at the Tokyo Summer Olympic Games, Laura welcomes to the podcast the broadcaster who has covered a total of eleven Summer and Winter Olympics, Ted Robinson. In addition to his extensive experience with the Olympics, Ted has, among other roles, been the radio voice for the San Francisco 49ers, and covered tennis from the U.S. Open to Wimbledon for three decades. Today’s conversation is a fascinating and entertaining one which honors the Games that everyone had hoped for this summer, and now excitedly look forward to next summer.</p>\n<p>Ted shares both how he started in broadcasting and his vast experience in the field. He discusses the athlete who has had the greatest impact upon him, looks at the mindset of a defending Olympic champion, and relates some memories of his most unexpected Olympic moments. He also offers his perspective on the most common trait found in the most successful athletes, details the reasons why he continues to call sports, relates some of the crazier Olympic moments he has encountered, and explores just what makes good sports drama. You can hear the passion in his voice as he shares his remarkable experience and insight with Laura, and you will undoubtedly come away with the same high degree of respect for Ted Robinson that he and Laura so clearly have for each other.</p>\n<p>Episode Highlights:</p>\n<p>Ted’s broadcasting career and how it started\nHis experiences with being asked to call sports with which he was unfamiliar\nThe most impactful athlete for Ted\nThe significance of David Boudia’s gold medal moment\nThe mindset of a defending Olympic champion\nTed’s memories of unexpected Olympics moments\nThe profound nature of being able to compete for your own country\nTed’s perspective on the quality that is common to all of the greatest athletes\nApolo Ohno’s perfect race\nWhat keeps Ted calling sports and what he has learned over his many years of covering individual Olympic sports\nSome of Ted’s crazier Olympic memories\nHis perspective on what makes for good sports drama\nThe events Ted would like to call that he hasn’t already\nA fascinating fact about Ted</p>\n<p>Quotes:</p>\n<p>“I was completely channeled from age 17 on to do what I am still doing into my early 60’s now.”</p>\n<p>“There are Olympic sports, and there are sports in the Olympics.”</p>\n<p>“Suddenly, you understand the formula, you lose your fear…you’ll handle it…it helps your employment greatly.”</p>\n<p>“I’m going to work the Olympic games until I’m disinvited.”</p>\n<p>“In that moment you realize that all these things you have done are not just for you, it’s, like, for your country.”</p>\n<p>“The ability to be ready for the moment.”</p>\n<p>“As soon as…the competition starts, I love it, I love it, and that’s what keeps you going.”</p>\n<p>“Crazy things happen in the Olympics – good and bad.”</p>\n<p>“We were lectured very sternly by NBC going to Athens that we were really not supposed to wear things that identified us as Americans. I purchased Canadian t-shirts.”</p>\n<p>“When you understand that the lights are at their brightest and you still see an athlete perform – that’s the moment…that’s what you come back for.”</p>\n<p>Links:</p>\n<p>The Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a> </p>\n<p>Laura’s Social Media:</p>\n<p><a href=\"https://www.instagram.com/lala_the_diver/\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver/</a></p>\n<p><a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a></p>\n<p>Ted Robinson:</p>\n<p><a href=\"https://twitter.com/tedjrobinson\" rel=\"nofollow\">https://twitter.com/tedjrobinson</a></p>\n<p><a href=\"https://www.instagram.com/tedjrob49/\" rel=\"nofollow\">https://www.instagram.com/tedjrob49/</a></p>",
  "itunes:title": "Celebrating the Olympic Games with Broadcaster Ted Robinson",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 8
}