{
  "title": "TU114: Take the 30 Day Emotional Health Challenge!",
  "link": "https://therapistuncensored.com/episodes/tu114-take-the-30-day-emotional-health-challenge/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu114-take-the-30-day-emotional-health-challenge",
  "pubDate": "Tue, 04 Feb 2020 05:28:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7974",
  "description": "Sue & Ann laughing at themselves, probably at our bumbling efforts on our 30-day emotional health challenge!\nEnough theory – it’s time to choose JUST ONE emotional health goal to work on for the next 30 days. Let go of what no longer serves you. Join us for our 30-day emotional health challenge!\nIn this episode,\nDr. Ann Kelley and Sue Marriott LCSW CGP are walking the walk. They personally challenge you to pick one thing to work on for the next 30 days – something challenging but within reach.\nShow Notes - 30 day emotional health challenge\nBackstory\n\n \tIt’s February – this is not a new years resolution because they typically don’t work past about now. You hear about weight loss goals and fitness goals, but the most life-changing skills for long-term happiness and health is actually having close relationships.\n \tNo matter how secure you are, how much therapy you have had, what letters are behind your name or how old you are, there is always something we can do to improve our sense of ourself and our close relationships.\n \tYou pick! We give lots of ideas but the upshot is you know your own bad emotional habits.\n\nSelf -Inventory\n\n \tWith love and compassion first – reflect on what you know you need to work on\n \tPick something that if you could change, it would have real meaning to you\n \tPick something that is clear enough to be measurable – if others can see it that’s even better\n \tTell someone what you are doing – gain accountability\n \tWhen you fail, this is a true challenge, remember? When you fail learn a bit more about what happened, where the bad habit or self talk is coming from, what triggers the behavior and ideas for intervention\n\nEarned Security and Internal Working Maps – Reviewed\nWhat is emotional health?\nAnn & Sue’s personal challenges\n\n \tAnn shares her personal 30 day challenge goal and how it developed – implicit emotional learning\n \tSue shares her 30 day emotional challenge goal and what her implicit emotional learning she’s trying to unlearn and replace with something more adaptive for today\n \tHow to identify your old IWM (adaptations to your early environment that are usually based on things that are no longer true) and replace them with new, more accurate IWM\n \tEarning Security – a cool club to be a part of 🙂 \n\nExamples of what you might try based on where you fall on the Attachment-Regulation Spectrum\nResources for this Episode – Recommended Books\nSelf Compassion Workbook A Proven Way to Accept Yourself, Build Inner Strength and Thrive\n\nby Kristin Neff and Christopher Germer\n\nMindful Path to Self-Compassion \n\nby Christopher Germer\n\nNeuroscience of Human Relationships\n\nby Lou Cozolino\nWho doesn’t love special offers? Discounted course – It’s Not Me It’s My Amygdala! Advanced Course Connecting the Science(s) of the Mind to Interpersonal Relationships\n\nOur advanced course on attachment and relational neuroscience has been recently released and is now available (wahoo)! Since you are now deep into these shownotes, then you are one of us, use the code OURCLAN for an immediate discount for the course.\nThis course is popular with clinicians (CE’s available!), all who are interested in deepening security in yourselves and your relationships are welcome to participate. 4 hours of curated content!\nCLICK HERE FOR MORE INFORMATION\nDive in and get more involved – join us on Patreon! \nJoin our exclusive community of Therapist Uncensored Neuronerds for as little as $5 a month!\n\nIncrease your access, join a kick-ass like-minded community, get discounts on our courses and get exclusive content.\n\nHelp us create a ripple of security by supporting us in freely sharing the science of relationships around the globe!\nNEURONERDS UNITE! Click here to sign up.\nBOOK of the MONTH \nMaybe You Should Talk to Someone– A Therapist, HER Therapist and a Life Revealed, by Lori Gottlieb.\n\nIf you are looking for something to inspire you – make you laugh – tear up a bit and generally move to...",
  "enclosure": "",
  "itunes:subtitle": "Sue & Ann laughing at themselves, probably at our bumbling efforts on our 30-day emotional health challenge! Enough theory – it’s time to choose JUST ONE emotional health goal to work on for the next 30 days. Let go of what no longer serves you.",
  "itunes:summary": "Nobody is perfect.  Let us support you in doing something you KNOW you need to do but may not know how. For 30 days, choose ONE old habit you want to let go of, focus on understanding where it comes from, challenge tired old troublesome beliefs, risk learning something new and updating your old map.  Change can look like: insight, more compassion, new behavior, it can be small or large, but it&apos;s gotta change.  We discuss examples and tie this into the Modern Attachment-Regulation Spectrum and the colors you may lean toward to help you pick something.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW, CGP",
  "itunes:image": "",
  "itunes:duration": "38:44"
}