{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-7007578418434291414",
  "published": "2018-11-12T03:26:00.003-08:00",
  "updated": "2018-11-12T03:30:43.067-08:00",
  "title": "The Potential Unintended Consequences of Article 13",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><i>This op-ed originally appeared in the <a href=\"https://www.ft.com/content/266e6c2a-e42e-11e8-a8a0-99b2e340ffeb\" target=\"_blank\">Financial Times</a>.</i><br />Creativity has long been a guiding force in my life, which is why I jumped at the opportunity to be YouTube’s chief executive nearly five years ago.<br /><br /><br /><br />Creators have used YouTube to share their voices, inspire their fans, and build their livelihoods. <a href=\"https://www.youtube.com/channel/UCsXVk37bltHxD1rDPwtNM8Q\" target=\"_blank\">Kurzgesagt — In a Nutshell</a> recently became the number one channel in Germany by creating videos that help others fall in love with science. Artists like Dua Lipa and Ed Sheeran reached fans on YouTube long before they were discovered by a label. And acclaimed musicians like Elton John have used our site to breathe new life into iconic songs.  <br /><br /><br /><br />We have worked hard to ensure creators and artists are fairly compensated for their work. In the last year, YouTube paid content owners across the EU €800m. We have also paid the global music industry more than €1.5bn from advert-generated revenue alone.  <br /><br /><br /><br />However, this creator economy is under threat from a section of the EU’s efforts to revise its copyright directive, known as <a href=\"https://www.ft.com/content/0675de12-b4fe-11e8-bbc3-ccd7de085ffe\" target=\"_blank\">article 13</a>, which holds internet companies directly responsible for any copyright infringement in the content shared on their platform.  <br /><br /><br /><br />While we support the goals of article 13, the European Parliament’s current proposal will create unintended consequences that will have a profound impact on the livelihoods of hundreds of thousands of people.  <br /><br /><br /><br />The parliament’s approach is unrealistic in many cases because copyright owners often disagree over who owns what rights. If the owners cannot agree, it is impossible to expect the open platforms that host this content to make the correct rights decisions.  <br /><br /><br /><br />Take the global music hit “<a href=\"https://www.youtube.com/watch?v=kJQP7kiw5Fk\" target=\"_blank\">Despacito</a>”. This video contains multiple copyrights, ranging from sound recording to publishing rights. Although YouTube has agreements with multiple entities to license and pay for the video, some of the rights holders remain unknown. That uncertainty means we might have to block videos like this to avoid liability under article 13. Multiply that risk with the scale of YouTube, where more than 400 hours of video are uploaded every minute, and the potential liabilities could be so large that no company could take on such a financial risk.  <br /><br /><br /><br />We have already taken steps to address copyright infringement by developing technology, like our Content ID programme, to help rights holders manage their copyrights and earn money automatically. More than 98 per cent of copyright management on YouTube takes place through Content ID. To date, we have used the system to pay rights holders more than €2.5bn for third party use of their content. We believe Content ID provides the best solution for managing rights on a global scale.  <br /><br /><br /><br />The consequences of article 13 go beyond financial losses. EU residents are at risk of being cut off from videos that, in just the last month, they viewed more than 90bn times. Those videos come from around the world, including more than 35m EU channels, and they include language classes and science tutorials as well as music videos.  <br /><br /><br /><br />We welcome the chance to work with policymakers and the industry to develop a solution within article 13 that protects rights holders while also allowing the creative economy to thrive. This could include more comprehensive licensing agreements, collaboration with rights holders to identify who owns what, and smart rights management technology, similar to Content ID.  <br /><br /><br /><br />Platforms that follow these rules, and make a good effort to help rights holders identify their content, shouldn’t be held directly liable for every single piece of content that a user uploads. We ask policymakers to find a solution that protects rights holders and creators alike, and listen to the growing number of EU voices, including some member countries, who agree there’s a better way forward.<br /><br /><br /><br /><div style=\"text-align: left;\"><i>Susan Wojcicki, CEO of YouTube</i></div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 44
}