{
  "title": "Standard Chartered leads Series A round of blockchain-powered value exchange Partior",
  "link": "https://e27.co/standard-chartered-leads-series-a-round-of-partior-20221103/",
  "dc:creator": "Sainul",
  "pubDate": "Thu, 03 Nov 2022 09:17:25 +0000",
  "category": [
    "Fintech",
    "Investments",
    "Singapore",
    "DBS",
    "JP Morgan",
    "Partior",
    "Standard Chartered",
    "Temasek"
  ],
  "guid": "https://e27.co/?p=475661",
  "description": "<p>Partior, a blockchain-powered cross-border payment and value exchange, has closed its Series A financing round led by Standard Chartered. Existing shareholders DBS, JP Morgan, and Temasek have also participated. The transaction, whose details haven&#8217;t been disclosed, is subject to regulatory approvals and other customary closing conditions. The investment will help strengthen Partior&#8217;s vision and drive [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/standard-chartered-leads-series-a-round-of-partior-20221103/\">Standard Chartered leads Series A round of blockchain-powered value exchange Partior</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<div id=\"attachment_475687\" style=\"width: 700px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-475687\" loading=\"lazy\" class=\"size-full wp-image-475687\" src=\"https://e27.co/wp-content/uploads/2022/11/Partior_series_a_news.png\" alt=\"\" width=\"690\" height=\"388\" /><p id=\"caption-attachment-475687\" class=\"wp-caption-text\">Partior CEO Jason Thompson</p></div>\n<p>Partior, a blockchain-powered cross-border payment and value exchange, has closed its Series A financing round led by Standard Chartered.</p>\n<p>Existing shareholders DBS, JP Morgan, and Temasek have also participated.</p>\n<p>The transaction, whose details haven&#8217;t been disclosed, is subject to regulatory approvals and other customary closing conditions.</p>\n<p>The investment will help strengthen Partior&#8217;s vision and drive for the broad adoption of atomic settlement and clearing. The company recently announced its 2023 product expansion and launched its Hyderabad Research and Development Centre after atomising cross-border value movements last October.</p>\n<p>Partior CEO Jason Thompson said: &#8220;Our vision has always been to transform global payments and become the worldwide ledger for financial institutions&#8217; value exchange. Standard Chartered is one of the most established international banks in the industry and is a strategic partner to diversify our network and scale the delivery of our technology globally.&#8221;</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/blockchain-adoption-to-grow-in-trade-supply-chain-dltledgers-20221019/\">‘Trade & supply chain sector is set to witness unprecedented blockchain adoption’: #dltledgers</a></strong></p>\n<p>Partior was founded last year by JP Morgan, DBS and Temasek as an independent company.</p>\n<p>The Monetary Authority of Singapore-backed company aims to make digital clearing and settlement more efficient, reliable and secure for financial institutions worldwide. It harnesses the key features of blockchain and smart contracts (programmability, immutability and traceability) to address the industry&#8217;s longstanding pain points.</p>\n<p>With Standard Chartered joining the Partior network, it will serve as one of the integrated Euro settlement banks. This creates synergy and strengthens Partior&#8217;s plan to scale its offering globally. Partior is on track to deliver its currency offerings of USD, SGD, GBP, EUR, AUD, JPY, CNH and HKD.</p>\n<p>On the other hand, the investment will deepen Standard Chartered&#8217;s blockchain innovation capabilities to build a more transparent, efficient and secure infrastructure for global value movement. It will also further accelerate its deployment of blockchain technology across its global wholesale payments and settlements financial network and scale the delivery of Partior&#8217;s technology to global capital markets.</p>\n<p>&#8212;</p>\n<div class=\"post-container x-post-content\">\n<div class=\"post-container x-post-content\">\n<div class=\"post-container x-post-content\">\n<div class=\"post-container x-post-content\">\n<p>Fundraising or preparing your startup for fundraising? Build your investor network, search from 400+ SEA investors on e27, and get connected or get insights regarding fundraising. <a class=\"ProsemirrorEditor-link\" rel=\"follow\" href=\"https://e27.co/membership/?utm_source=Boilerplate&utm_medium=Articles&utm_campaign=300TRIAL&utm_id=300TRIAL\" rel=\"follow\">Try e27 Pro for free today</a>.</p>\n</div>\n</div>\n</div>\n</div>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/standard-chartered-leads-series-a-round-of-partior-20221103/\">Standard Chartered leads Series A round of blockchain-powered value exchange Partior</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}