{
  "title": "S2 Ep8: #58 - Zane's Little Sister Was Involved in the Cartel",
  "link": "https://audioboom.com/posts/7874580",
  "itunes:episode": 8,
  "itunes:title": "#58 - Zane's Little Sister Was Involved in the Cartel",
  "itunes:season": 2,
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5713,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Well this episode is about to go down in the UNFILTERED history books because, coffee beans, … … let us present the moments you have all been waiting for. That’s right, there’s more than one! First, after over a year of crafting… of honing, and perfecting… of hinting and teasing (sorry ‘bout that) we are thrilled to finally unveil: KRAMODA COFFEE! Zane + Heath are extremely grateful that so many of you have kept UNFILTERED as a part of your weekly routine, and they’ve worked tirelessly building a company whose blends are sure to fit right into your morning routines too! Oh, and since this is such a personal episode, we hope you don’t mind us inviting some family over to sip and celebrate with us. On second thought, we’re sure you won’t, because in response to countless comments, emails, and some demanding call-ins, this week’s guest is none other than Zane’s sister and a true queen: HIDAYA HIJAZI!! We hear all about Hidaya’s job serving up sweet treats for some sour customers. Then we delve deeper when we inquire about everything from our guest’s religious views and cultural upbringing to how she truly feels about her brother’s very public career path. Is the influencer life for her? What made her so wise beyond her years? …Wait, she hides WHAT under her scarf? And HOW did she ruin the car Zane surprised her with? And WHEN did she become involved with the south Floridian drug cartel!!?!?</p>\n<p><br>\n</p>\n<p>Thankfully, all of these questions and more will be answered on this week’s Zane + Heath: UNFILTERED. The only thing you’ll still have to discover for yourself is what your personal favorite Kramoda Coffee blend is!</p>\n<p><br>\n</p>\n<p>Go to <a href=\"http://liquidiv.com\">liquidiv.com</a> and use code UNFILTERED for 20% OFF your order!</p>\n<p>Get $5 OFF and ZERO delivery fees when you download to DOORDASH app and use code UNFILTERED</p>\n<p>Download HONEY to your computer and save on online shopping!</p>\n<p>Go to <a href=\"http://manscaped.com\">manscaped.com</a> and use code COFFEETALK to get 20% OFF and FREE SHIPPING</p>\n",
  "itunes:summary": "Well this episode is about to go down in the UNFILTERED history books because, coffee beans, … … let us present the moments you have all been waiting for. That’s right, there’s more than one! First, after over a year of crafting… of honing, and perfecting… of hinting and teasing (sorry ‘bout that) we are thrilled to finally unveil: KRAMODA COFFEE! Zane + Heath are extremely grateful that so many of you have kept UNFILTERED as a part of your weekly routine, and they’ve worked tirelessly building a company whose blends are sure to fit right into your morning routines too! Oh, and since this is such a personal episode, we hope you don’t mind us inviting some family over to sip and celebrate with us. On second thought, we’re sure you won’t, because in response to countless comments, emails, and some demanding call-ins, this week’s guest is none other than Zane’s sister and a true queen: HIDAYA HIJAZI!! We hear all about Hidaya’s job serving up sweet treats for some sour customers. Then ...",
  "pubDate": "Mon, 07 Dec 2020 15:51:00 +0000",
  "guid": "07438688-38a4-11eb-b789-f37308800785",
  "itunes:author": "Zane & Heath",
  "dc:creator": "Zane & Heath",
  "media:rights": ""
}