{
  "title": "Quantifying and Learning Static vs. Dynamic Information in Deep Spatiotemporal Networks. (arXiv:2211.01783v1 [cs.CV])",
  "link": "http://arxiv.org/abs/2211.01783",
  "description": "<p>There is limited understanding of the information captured by deep\nspatiotemporal models in their intermediate representations. For example, while\nevidence suggests that action recognition algorithms are heavily influenced by\nvisual appearance in single frames, no quantitative methodology exists for\nevaluating such static bias in the latent representation compared to bias\ntoward dynamics. We tackle this challenge by proposing an approach for\nquantifying the static and dynamic biases of any spatiotemporal model, and\napply our approach to three tasks, action recognition, automatic video object\nsegmentation (AVOS) and video instance segmentation (VIS). Our key findings\nare: (i) Most examined models are biased toward static information. (ii) Some\ndatasets that are assumed to be biased toward dynamics are actually biased\ntoward static information. (iii) Individual channels in an architecture can be\nbiased toward static, dynamic or a combination of the two. (iv) Most models\nconverge to their culminating biases in the first half of training. We then\nexplore how these biases affect performance on dynamically biased datasets. For\naction recognition, we propose StaticDropout, a semantically guided dropout\nthat debiases a model from static information toward dynamics. For AVOS, we\ndesign a better combination of fusion and cross connection layers compared with\nprevious architectures.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Kowal_M/0/1/0/all/0/1\">Matthew Kowal</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Siam_M/0/1/0/all/0/1\">Mennatullah Siam</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Islam_M/0/1/0/all/0/1\">Md Amirul Islam</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Bruce_N/0/1/0/all/0/1\">Neil D. B. Bruce</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wildes_R/0/1/0/all/0/1\">Richard P. Wildes</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Derpanis_K/0/1/0/all/0/1\">Konstantinos G. Derpanis</a>"
}