{
  "title": "We need to accelerate progress at the frontier of innovation",
  "link": "https://e27.co/we-need-to-accelerate-progress-at-the-frontier-of-innovation-20221103/",
  "dc:creator": "Alfie",
  "pubDate": "Thu, 03 Nov 2022 03:00:36 +0000",
  "category": [
    "Community",
    "Events",
    "Sponsored",
    "accelerator",
    "Accelerator Programme",
    "AD Stretch",
    "Avery Dennison",
    "Open Innovation Studio"
  ],
  "guid": "https://e27.co/?p=475622",
  "description": "<p>Pascale Wautelet, Avery Dennison’s VP for Global Research & Development and Sustainability, discusses the need to nurture startup companies and communities to expedite progress and see frontier innovations thrive. In 1949, the patent for the barcode was filed by Joe Woodland. It wasn’t until 1974 in Troy, Ohio, that the first item at Marsh Supermarket [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/we-need-to-accelerate-progress-at-the-frontier-of-innovation-20221103/\">We need to accelerate progress at the frontier of innovation</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<img loading=\"lazy\" class=\"size-full wp-image-475629 aligncenter\" src=\"https://e27.co/wp-content/uploads/2022/11/Avery-Dennison-3.png\" alt=\"Avery Dennison\" width=\"690\" height=\"390\" />\n<p><em>Pascale Wautelet, Avery Dennison’s VP for Global Research & Development and Sustainability, discusses the need to nurture startup companies and communities to expedite progress and see frontier innovations thrive.</em></p>\n<p>In 1949, the patent for the barcode was filed by Joe Woodland. It wasn’t until 1974 in Troy, Ohio, that the first item at Marsh Supermarket was passed through the scanner and that now-familiar beep was heard. It eventually came to pass because IBM had invested in the innovation and the prototype process. Sadly, despite working for IBM at the time, Woodland wasn’t credited with the final UPC concept.</p>\n<p>While the original intention was to speed up the checkout process in America’s grocery stores, the outcome was to revolutionise the supply chain. IBM’s support of innovation illustrates how groundbreaking ideas can languish for decades if they don’t have the necessary financial support or infrastructure required to bring innovation to life. In the case of the barcode, they also needed a succession of inventions — from infrared to improved printing practices — in order to support the outcome.</p>\n<p><b>Also read: <a rel=\"follow\" href=\"https://e27.co/gen-z-is-redefining-global-consumption-can-companies-keep-up-20221101/\">Gen Z is redefining global consumption. Can companies keep up?</a></b></p>\n<p>More recently — 30 years ago actually — we saw the advent of Bluetooth technology as a result of collaboration between Dutch engineer Jaap Haartsen and Swedish telecommunications giant Ericsson. Again, the concept of spread-spectrum radio technology had existed since the late 1930s when Austrian-born actress Hedy Lamarr found time between Hollywood movie shoots to develop the technology that would fail to evolve until a corporate enterprise saw its potential some 50 years later.<em> </em></p>\n<p>Fast-forward to present day: in such a fast-paced evolution of new technology and highly dynamic market needs, the power of collaborating with external organisations is invaluable for businesses. Open Innovation has become a necessity today, and I see many advantages to making it part of your company’s Innovation Engine.</p>\n<h1><strong>Supporting groundbreaking innovation</strong></h1>\n<img loading=\"lazy\" class=\"size-full wp-image-475630 aligncenter\" src=\"https://e27.co/wp-content/uploads/2022/11/Avery-Dennison-1.png\" alt=\"Avery Dennison\" width=\"690\" height=\"390\" />\n<p>At Avery Dennison, we have established multiple paths within our innovation framework, and our AD Stretch accelerator programme, running alongside our Open Innovation Studio, is one of those. When we think about exploring new opportunities that are further from our core, we need to accept that we cannot be the master of everything. Partnering outside your company gives you access to a much broader pool of insights, ideas, and solutions from different sources that enables you to transform your business faster as you nurture and support innovative talents and ideas.</p>\n<p><b>Also read: <a rel=\"follow\" href=\"https://e27.co/going-the-extra-mile-in-digital-innovation-for-singapores-commuter-experience-20221027/\">Going the extra mile in digital innovation for Singapore’s commuter experience</a></b></p>\n<p>Another key aspect of open innovation and external collaboration is the ability to boost employee engagement. When organisations are collectively involved in solving the most challenging problems and implementing the best ideas, it fosters strong engagement and ownership and a stake in the company&#8217;s goals. Employees feel more connected to the strategy and invested in contributing to company success. Ultimately it is a win-win.</p>\n<h2><strong>Helping innovators flourish alongside their ideas</strong></h2>\n<p>As we saw with the barcode, a larger organisation investing in innovation is nothing new — it’s how we’ve progressed through successive industrial evolutions and into the Digital Age. Whereby innovations of old progressed yet the innovators themselves were left behind, today, we want to ensure that not only do the ideas flourish, but so do the ideators.</p>\n<p><b>Also read: <a rel=\"follow\" href=\"https://e27.co/25-years-in-singapore-this-industry-veteran-discusses-innovation-20221027/\">25 years in Singapore: This industry veteran discusses innovation</a></b></p>\n<p>And now more than ever, we need to come together to solve problems collectively. As history has demonstrated, inviting talented people to the table and supporting their concepts is one of the quickest ways to delivering solutions at scale and solving some of our industry’s most urgent challenges.</p>\n<p><em>To know more about Avery Dennison’s accelerator program, visit <a rel=\"follow\" href=\"https://adstretch.com/\">ADStretch.com</a></em></p>\n<p>&#8211; &#8211;</p>\n<p>This article is produced by the <b>e27</b> team, sponsored by Avery Dennison.</p>\n<p>We can share your story at <b>e27</b>, too. Engage the Southeast Asian tech ecosystem by bringing your story to the world. Visit us at <a rel=\"follow\" href=\"https://e27.co/advertise?utm_source=e27&utm_medium=boilerplate&utm_campaign=lead_gen\">e27.co/advertise</a> to get started.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/we-need-to-accelerate-progress-at-the-frontier-of-innovation-20221103/\">We need to accelerate progress at the frontier of innovation</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}