{
  "id": "tag:blogger.com,1999:blog-37798047.post-8483431279487229778",
  "published": "2021-12-07T20:35:00.004-05:00",
  "updated": "2021-12-07T20:39:22.939-05:00",
  "title": "Journalists: stop selling NFTs that you don't understand",
  "content": "<p>The reason you don't really understand NFTs is because the journalists describing them to you don't understand them, either. We can see that when they attempt to sell an NFT as part of their stories (e.g. <a href=\"https://www.coindesk.com/markets/2021/03/12/associated-press-nft-artwork-sells-for-180k-in-ether/\">AP</a> and <a href=\"https://www.nytimes.com/2021/03/26/technology/nft-sale.html\">NYTimes</a>). They get important details wrong.</p><p>The latest is <a href=\"https://reason.com/2021/12/01/own-a-piece-of-reason-history/\">Reason.com magazine selling an NFT</a>. As libertarians, you'd think at least they'd get the technical details right. But they didn't. Instead of selling an NFT of the artwork, it's just an NFT of a URL. The URL points to OpenSea, which is known to remove artwork from its site (such as in response to DMCA takedown requests).</p><p>If you buy that Reason.com NFT, what you'll actually get is a token pointing to:</p><p><a href=\"https://api.opensea.io/api/v1/metadata/0x495f947276749Ce646f68AC8c248420045cb7b5e/0x1F907774A05F9CD08975EBF7BF56BB4FF0A4EAF0000000000000060000000001\">https://api.opensea.io/api/v1/metadata/0x495f947276749Ce646f68AC8c248420045cb7b5e/0x1F907774A05F9CD08975EBF7BF56BB4FF0A4EAF0000000000000060000000001</a></p><p>This is just the metadata, which in turn contains a link to the claimed artwork:</p><p><a href=\"https://lh3.googleusercontent.com/8Q2OGcPuODtCxbTmlf3epFGOqbfCbs4fXZ2RcIMnLpRdTaYHgqKArk7uETRdSZmpRAFsNE8KB4sFJx6czKE5cBKB1pa7ovc4wBUdqQ\">https://lh3.googleusercontent.com/8Q2OGcPuODtCxbTmlf3epFGOqbfCbs4fXZ2RcIMnLpRdTaYHgqKArk7uETRdSZmpRAFsNE8KB4sFJx6czKE5cBKB1pa7ovc4wBUdqQ</a></p><p>If either OpenSea or Google removes the linked content, then any connection between the NFT and the artwork disappears.</p><p>It doesn't have to be this way. The correct way to do NFT artwork is to point to a \"hash\" instead which uniquely identifies the work regardless of where it's located. That <a href=\"https://blog.erratasec.com/2021/03/deconstructing-that-69million-nft.html\">$69 million Beeple piece</a> was done this correct way. It's completely decentralized. If the entire Internet disappeared except for the Ethereum blockchain, that Beeple NFT would still work.</p><p>This is an analogy for the entire blockchain, cryptocurrency, and Dapp ecosystem: the hype you hear ignores technical details. They promise an entirely decentralized economy controlled by math and code, rather than any human entities. In practice, almost everything cheats, being tied to humans controlling things. In this case, the \"Reason.com NFT artwork\" is under control of OpenSea and not the \"owner\" of the token.</p><p>Journalists have a problem. NFTs selling for millions of dollars are newsworthy, and it's the journalists place to report news rather than making judgements, like whether or not it's a scam. But at the same time, journalists are trying to explain things they don't understand. Instead of standing outside the story, simply quoting sources, they insert themselves into the story, becoming advocates rather than reporters. They can no longer be trusted as an objective observers.</p><p>From a fraud perspective, it may not matter that the Reason.com NFT points to a URL instead of the promised artwork. The entire point of the blockchain is <i>caveat emptor in action</i>. Rules are supposed to be governed by code rather than companies, government, or the courts. There is no undoing of a transaction even if courts were to order it, because it's math.</p><p>But from a journalistic point of view,&nbsp; this is important. They failed at an honest description of what actually the NFT contains. They've involved themselves in the story, creating a conflict of interest. It's now hard for them to point out NFT scams when they themselves have participated in something that, from a certain point of view, could be viewed as a scam.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEisSQVAVEvUg5zjSZndwshn9yvxa23_CJq6gXtiMBy69qekJ8CA98P6x7cnuNRPxFoIu7SNMI2oA8twEHac417lvr3Act_L3Xl4B4MPcdCCDVmwYNPk60nY6xpf2ws8a1sE3ycrK04z6dz_zy2hgFeRYd3JTuEjeOBO1BAblp-xFInuAC2NbQ=s1926\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1050\" data-original-width=\"1926\" height=\"217\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEisSQVAVEvUg5zjSZndwshn9yvxa23_CJq6gXtiMBy69qekJ8CA98P6x7cnuNRPxFoIu7SNMI2oA8twEHac417lvr3Act_L3Xl4B4MPcdCCDVmwYNPk60nY6xpf2ws8a1sE3ycrK04z6dz_zy2hgFeRYd3JTuEjeOBO1BAblp-xFInuAC2NbQ=w400-h217\" width=\"400\" /></a></div><br /><p><br /></p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Robert Graham",
    "uri": "http://www.blogger.com/profile/09879238874208877740",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 1
}