{
  "title": "Big Data 2.0 Has Arrived",
  "link": "https://medium.com/adatao-narratives/big-data-2-0-has-arrived-1aedb661aa68?source=rss-b0cd2903e078------2",
  "guid": "https://medium.com/p/1aedb661aa68",
  "category": [
    "big-data",
    "adatao-funding",
    "big-compute"
  ],
  "dc:creator": "Christopher Nguyen",
  "pubDate": "Tue, 17 Feb 2015 19:36:51 GMT",
  "atom:updated": "2015-05-24T10:12:34.120Z",
  "content:encoded": "<p><em>When We Can Process Data Flexibly At-Scale, What Will We Want To Do? — </em>Provost & Fawcett</p><p><em>Aug 7, 2014 (</em><a href=\"http://adatao.com/blog/big-data-2-0-has-arrived/\"><em>Originally published at blog.adatao.com</em></a><em>)</em></p><p>Two years ago, we set out on a journey. The hype around Big Data was fast outpacing its tangible business value. Yet, we were at the threshold of a fundamental shift in our industry — just as Web 1.0 was about technologies and functionalities of the web, while Web 2.0 was about the focus on the user; we’re seeing the same fundamental shift from Big Data 1.0 to Big Data 2.0.</p><blockquote>We’re seeing a fundamental shift from Big Data 1.0 to Big Data 2.0</blockquote><p>Adatao is the missing puzzle piece that bridges the gap between Big Data 1.0 of the past 5 years, and Big Data 2.0 going forward, with the arrival of “Big Compute” capabilities. We had seen, first-hand, Big Compute in action on Wall Street in the early 2000’s, and then at places like Google in in mid 2000′s. We’d learned that fast, powerful Big Compute engines would enable businesses to use Big Data fluidly and interactively, at the speed of thought. But accessibility was limited due to cost. The Adatao founding team knew that without Big Compute, Big Data could never deliver on its hype.</p><blockquote>Without Big Compute, Big Data could never deliver on its hype</blockquote><p>Two years ago, we <a href=\"https://medium.com/adatao-narratives/why-and-how-we-bet-on-apache-spark-b6dd51151a68\">confidently bet on Apache Spark</a> because we knew where the trends were heading. We set out to build Big Data applications that assumed the mass availability of Big Compute. Today, we are delivering on the promise of Big Data 2.0 with our current products:</p><ul><li><strong>pInsights — the “beauty layer” </strong>that enables business analysts and data scientists to easily and fluidly interact with Big Data in an easy to consume, interactive format. Similar to a Facebook or Google Search engine, predictive SmartQuery was built into a Google Doc type document that allows users to instantly and collaboratively produce embedded analytics within seconds to assist with decision making.</li><li><strong>pAnalytics — the “power layer” </strong>that enables data scientists and data engineers to analyze massive amounts of data in seconds. pAnalytics sifts through the data by representing it as one large, simple table, hiding all the data complexities, enabling data scientists and engineers to work with Big Data analytics in a very simple, powerful way. Data can be pulled in from Cassandra, analyzed in Spark, and the results saved back to S3 — all using one familiar API. This allows data scientists and engineers to focus on data analysis, and multiply their productivity by 10 times.</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*TytetFQmHmkSHbn5.png\" /><figcaption>Ease-of-use + Collaboration + Predictive Capabilities = Data Intelligence</figcaption></figure><p>Since we debuted our products this past December, we’ve seen incredible demand from companies across every sector eager to finally unlock the potential of their investments in Hadoop, and reap the long promised benefits of Big Data.</p><p>As we look to build our team to scale and meet this demand, I’m excited to announce our Series A financing with our new partners at Andreessen Horowitz, who are leading the investment with participation from Lightspeed Venture Partners and Bloomberg Beta.</p><p><a href=\"http://peter.a16z.com/\">Peter Levine</a>, from Andreessen Horowitz will join our board. Peter has extensive ground-up operating leadership experience and teaches a class on building a professional enterprise sales infrastructure at Stanford GSB and MIT Sloan School. <a href=\"http://blog.pmarca.com/\">Marc Andreessen</a> will also support us as a Board Observer — his excitement about the potential of Adatao is summed up in the following:</p><blockquote>As a successful two-time company builder and former Engineering Director of Google Apps, Christopher has the technical company builder background that we love to bet on. Plus, he’s assembled a strong team of engineers and PhDs in parallel systems and machine learning that collectively have a unique and powerful vision.</blockquote><blockquote>But we were really sold when we saw what Adatao has built — we were blown away. Christopher and team see a future convergence of human and machine intelligence that we believe in, and they have the technology roadmap and engineering experience to get there.</blockquote><blockquote>We can’t wait to help as Adatao designs the future of Big Data.</blockquote><blockquote>- <em>Marc Andreessen</em></blockquote><p>We have found each firm to be a true partner who not only shares our vision, but is also incredibly supportive and committed to being there with us every step of the way on our challenging but exciting journey. From <a href=\"http://lsvp.com/team/lyon-wong/\">Lyon Wong</a> and <a href=\"http://lsvp.com/team/john-vrionis/\">John Vrionis</a> of Lightspeed, who recognized our potential in the Big Data ecosystem quite early on, to <a href=\"http://www.bloombergbeta.com/\">James Cham</a> at Bloomberg Beta who understood our value and strength as soon as he experienced the product, we are incredibly excited about what the future will bring.</p><p>In conversation after conversation with enterprises, we’re seeing that business needs are driving the convergence of business intelligence and data science/machine learning, directly on top of big data. This convergence is creating an entirely new set of business value, at a scale that has never been seen before.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*l9oS4TwWxjkd2oNb.jpg\" /><figcaption>Big Data + Big Compute = Big Data Intelligence</figcaption></figure><p>We can’t wait for the journey we’re embarking on to make Data Intelligence truly available to all.</p><p><em>Originally published at </em><a href=\"http://blog.adatao.com/big-data-2-0-has-arrived/\"><em>blog.adatao.com</em></a><em>.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=1aedb661aa68\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/adatao-narratives/big-data-2-0-has-arrived-1aedb661aa68\">Big Data 2.0 Has Arrived</a> was originally published in <a href=\"https://medium.com/adatao-narratives\">Arimo Narratives™</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}