{
  "title": "A Rewriting Logic Approach to Stochastic and Spatial Constraint System Specification and Verification. (arXiv:1909.03819v2 [cs.LO] UPDATED)",
  "link": "http://arxiv.org/abs/1909.03819",
  "description": "<p>This paper addresses the issue of specifying, simulating, and verifying\nreactive systems in rewriting logic. It presents an executable semantics for\nprobabilistic, timed, and spatial concurrent constraint programming -- here\ncalled stochastic and spatial concurrent constraint systems (SSCC) -- in the\nrewriting logic semantic framework. The approach is based on an enhanced and\ngeneralized model of concurrent constraint programming (CCP) where\ncomputational hierarchical spaces can be assigned to belong to agents. The\nexecutable semantics faithfully represents and operationally captures the\nhighly concurrent nature, uncertain behavior, and spatial and epistemic\ncharacteristics of reactive systems with flow of information. In SSCC, timing\nattributes -- represented by stochastic duration -- can be associated to\nprocesses, and exclusive and independent probabilistic choice is also\nsupported. SMT solving technology, available from the Maude system, is used to\nrealize the underlying constraint system of SSCC with quantifier-free formulas\nover integers and reals. This results in a fully executable real-time symbolic\nspecification that can be used for quantitative analysis in the form of\nstatistical model checking. The main features and capabilities of SSCC are\nillustrated with examples throughout the paper. This contribution is part of a\nlarger research effort aimed at making available formal analysis techniques and\ntools, mathematically founded on the CCP approach, to the research community.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Romero_M/0/1/0/all/0/1\">Miguel Romero</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ramirez_S/0/1/0/all/0/1\">Sergio Ram&#xed;rez</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Rocha_C/0/1/0/all/0/1\">Camilo Rocha</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Valencia_F/0/1/0/all/0/1\">Frank Valencia</a>"
}