{
  "title": "DIXIE D'AMELIO CLEARS UP NOAH BECK RUMORS — BFFs EP. 83",
  "description": "<p>We start the show off with O'Malley, Bri's sidekick, who is filling in for Bri this week while she is filming a Barstool show in the woods. We get right into the Josh and Nessa videos of them together from this weekend dancing, Mia liking the post of Josh and Nessa and what she thinks, and whether or not we have video of Josh and Nessa making out and grinding at the event. We also talk about what Mads thinks and whether she has talked to Josh since he started hanging out with Nessa again.\n\nWe then get into headlines including Kourtney Kardashian and Travis Barker's wedding with Lil Huddy in attendance, Migos having a potential split, Tom Holland's new haircut, Deuxmoi's identity being exposed, artist's rebelling against their label because of Tik Tok trends, the Johnny Depp and Amber Heard trial, Doja Cat cancelling her upcoming tour, and Dave unfollowing O'Malley almost immediately after following him. \n\nWe then have part 2 of our Dixie interview where we get into her music career, her upcoming single, her tour this summer with Big Time Rush, and where she is going with modeling. We then figure out what is really happening between her and Noah, the paparazzi's role in her life, and what is happening on season 2 of their Hulu show.\n\nWe end with a game \"In The Wild\", finding out whether Dixie could spend a week with the woods with influencers such as Addison Rae, Bryce Hall, Trisha Paytas, Nailea Devora, and get to the bottom of what really happened between Dixie and Nailea. \n\nSupport our sponsors! \n\nSpark: Download Spark today at https://barstool.link/SparkBFF</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "13337b37-066e-4dd4-91bf-d350be52a599",
  "pubDate": "Thu, 26 May 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "00:47:38",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}