{
  "published": "2022-10-30T19:11:41-04:00",
  "updated": "2022-10-30T19:11:41-04:00",
  "title": "What happens if Bolsonaro wins reelection in Brazil?",
  "content": "<figure>\n      <img alt=\"Brazilian voters wave red, green, and blue flags supporting presidential candidate Luiz Inácio Lula da Silva in an upcoming runoff election.\" src=\"https://cdn.vox-cdn.com/thumbor/GezqAjyAj2lGuqrI5RbZxoDXx58=/140x0:7479x5504/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/71558275/1244144367.0.jpg\" />\n        <figcaption>Supporters of Brazilian presidential candidate Luiz Inácio Lula da Silva wave the candidate’s flag on a street in Brasília, the Brazilian capital, on October 22. | Evaristo Sa/AFP via Getty Images</figcaption>\n    </figure>\n\n  <p>The enormous stakes of this weekend’s presidential runoff in Brazil, explained.</p> <p id=\"DaEtLA\"><strong>Editor’s note, October 30, 2022, 7:10 pm:</strong> <em>This piece was published ahead of the 2022 Brazilian election. Sunday, former President Luiz Inácio Lula da Silva was declared the winner. </em></p>\n<p id=\"UmWsce\">Brazilian voters on Sunday will decide which of two longtime political fixtures<strong> </strong>they want to return to the country’s top elected office: incumbent<strong> </strong>President Jair Bolsonaro, a far-right strongman, or former President Luiz Inácio Lula da Silva, a leftist who served for two terms from 2003 through 2010.</p>\n<p id=\"4rW9Rr\">It will be the second round of voting this month, after neither candidate cleared <a href=\"https://apnews.com/article/jair-bolsonaro-elections-caribbean-business-rio-de-janeiro-ab594d3793020ff830cd75636bc04281\">50 percent of the vote</a> in a closer-than-expected presidential contest on October 2. And it sets up a defining choice for Brazil that could have major repercussions for both the country — South America’s largest — and the world.</p>\n<p id=\"1fkrgM\">At home, the fate of Brazil’s democracy may well hinge on the outcome. Bolsonaro, who was <a href=\"https://www.vox.com/2018/10/29/18037530/jair-bolsonaro-brazil-president-elections%5C\">first elected president in 2018</a>, has been nicknamed the “Trump of the Tropics,” and has mirrored Trump’s language about election fraud in the runup to Sunday’s race. (Trump also <a href=\"https://twitter.com/ishaantharoor/status/1567877011225337857?s=20&amp;t=bR6lBl1v1D5D1TVarqeVqA\">endorsed Bolsonaro</a> for a second term last month.)</p>\n<p id=\"jBHb3a\">Leading up to the election campaign, Bolsonaro’s authoritarian tendencies — never exactly latent — have become even more pronounced: In 2021, <a href=\"https://www.reuters.com/world/americas/bolsonaro-says-he-will-be-arrested-killed-or-declared-winner-2021-08-28/\">he told evangelical leaders</a> he foresaw “three alternatives for my future: being arrested, killed or victory,” and announced he would <a href=\"https://apnews.com/article/lifestyle-donald-trump-courts-coronavirus-pandemic-brazil-e1545240e57ecb4d2257a7ba6bc689c9\">no longer acknowledge rulings</a> by one of Brazil’s Supreme Court justices.</p>\n<div id=\"2vwTn4\">\n<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">In unsurprising news, Trump endorses Bolsonaro, who many fear is priming Brazil for a full-blown constitutional crisis should he lose in upcoming elections (via <a href=\"https://twitter.com/FinchelsteinF?ref_src=twsrc%5Etfw\">@FinchelsteinF</a>) <a href=\"https://t.co/ZHgUsJnBuS\">pic.twitter.com/ZHgUsJnBuS</a></p>— Ishaan Tharoor (@ishaantharoor) <a href=\"https://twitter.com/ishaantharoor/status/1567877011225337857?ref_src=twsrc%5Etfw\">September 8, 2022</a>\n</blockquote>\n<script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n</div>\n<p id=\"oUOZpr\">Such rhetoric has raised concerns that in the event of a Bolsonaro loss — which <a href=\"https://www.reuters.com/world/americas/brazils-lula-leading-bolsonaro-by-7-points-ahead-runoff-poll-2022-10-24/\">polling</a> and the results of the first round of elections both indicate is the most likely outcome — he could make a desperate play to hold on to power, one that could lead to <a href=\"https://www.wired.com/story/brazils-far-right-plots-its-own-january-6-insurrection/\">mob violence along the lines of the January 6 riot</a> in the United States. Even more concerning, one expert I spoke to suggested that a Bolsonaro win could be the start of a <a href=\"https://www.vox.com/policy-and-politics/2018/9/13/17823488/hungary-democracy-authoritarianism-trump\">Hungary-style downward spiral</a> for Brazilian democracy writ large.</p>\n<p id=\"GS2BPK\">Globally, meanwhile, the outcome of Sunday’s elections could be a critical juncture for efforts to combat climate change. Under Bolsonaro, <a href=\"https://www.vox.com/down-to-earth/2022/9/29/23373427/amazon-rainforest-brazil-jair-bolsonaro-lula-deforestation\">deforestation of the Brazilian Amazon has accelerated</a>; a victory by da Silva, frequently referred to as “Lula,” could see that trend reversed — good news for the world’s largest rainforest and a vital carbon sink.</p>\n<p id=\"aKKhI7\">Pro-democracy forces are cautiously optimistic: Lula led Bolsonaro, 48.4 percent to 43.2 percent, in the first round of voting earlier this month, and <a href=\"https://www.reuters.com/world/americas/brazils-lula-leading-bolsonaro-by-7-points-ahead-runoff-poll-2022-10-24/\">polls</a> <a href=\"https://www.reuters.com/world/americas/brazils-lula-widen-lead-slightly-over-bolsonaro-sunday-election-poll-2022-10-24/\">suggest</a> that gap could widen with just two candidates in the race.</p>\n<p id=\"ehZ9Mo\">It’s by no means a sure thing, however; Brazil’s 2022 presidential race is probably “the closest race that we have ever seen since Brazil became a democracy back in [the] 1980s,” Guilherme Casarões, a professor of political science at Brazil’s Fundação Getulio Vargas, told me this week.</p>\n<p id=\"Ijg5hb\">A <a href=\"https://www.nytimes.com/2022/10/24/world/americas/brazil-election-polls-criminalization.html\">polling miss</a> — with Bolsonaro and his allies overperforming their projected support in the first round<strong> </strong>— also adds some uncertainty to the final days of the race, though two experts I spoke with said that a similar degree of error isn’t as likely in the runoff.</p>\n<p id=\"PGUV7B\">Casarões told me he believes Lula will ultimately win. But, he said, “we’ve had close calls before, but not like that. So whoever wins is going to win by a very thin margin of roughly 2 to 3 percent.”</p>\n<div id=\"Ox5uEE\">\n<div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Brazil’s likely next president, explained|108932\" data-volume-uuid=\"2356eb0bb\" data-volume-id=\"108932\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-393\" class=\"volume-video\"></div>\n\n</div>\n<p id=\"Vw7iRK\">A Lula victory would conclude a dramatic comeback for the former president, who was <a href=\"https://www.nytimes.com/2022/09/29/world/americas/lula-bolsonaro-brazil-election.html\">sentenced to 22 years in prison</a> on corruption charges and served more than a year and a half before his release in <a href=\"https://apnews.com/article/b34fadbec5174bd080126b49ae6983d2\">November 2019</a> on due process grounds. Now 77, Lula remains a singular figure in Brazilian politics, one whom Barack Obama <a href=\"https://www.washingtonpost.com/world/the_americas/he-was-the-most-popular-politician-on-earth-now-brazils-lula-could-go-to-jail/2016/10/21/1569f2c0-897f-11e6-8cdc-4fbb1973b506_story.html\">once described</a> as “the most popular politician on Earth.” His election would also defy a <a href=\"https://freedomhouse.org/report/freedom-world/2022/global-expansion-authoritarian-rule\">global trend</a> of democratic backsliding — and strengthen a regional one of <a href=\"https://www.nytimes.com/2022/07/31/world/americas/latin-america-leftist-leaders.html\">successful leftist candidates</a>. </p>\n<p id=\"jLwcMn\">If he’s elected to a third term, however, he’ll still have to contend with an incumbent apparently dead set on holding on to power, as well as a historically polarized country and a <a href=\"https://www.reuters.com/world/americas/right-wing-wins-brazils-congress-show-staying-power-bolsonarismo-2022-10-03/\">hostile Congress</a> with a strong pro-Bolsonaro contingent.</p>\n<h3 id=\"IZUkD2\">Bolsonaro’s threat to democracy is very real</h3>\n<p id=\"enCk3N\">Under Bolsonaro, Brazil has lurched rightward. But his reelection could push Brazil — the world’s fourth-largest democracy — in a far darker direction. A second Bolsonaro term could see Brazil sliding deeper into authoritarianism, experts say, in a way that has become all too familiar globally.</p>\n<p id=\"U7dLtl\"><a href=\"https://freedomhouse.org/report/freedom-world/2022/global-expansion-authoritarian-rule\">According to Freedom House</a>, which monitors the condition of global democracy, authoritarian regimes continue to press their advantage in places like Hungary, Russia, China, and beyond. In the same way that the US far right has taken to <a href=\"https://www.vox.com/2022/8/5/23292448/orban-cpac-dallas-2022-speech-trump\">idolizing Hungarian President Viktor Orbán</a>, Casarões said, Bolsonaro “really admires and looks up to Orbán and Putin.”</p>\n<p id=\"KCedId\">If reelected, “Bolsonaro will be able to control Congress, he will try to pack the courts, he will try to impeach some justices that have become his enemies,” Casarões told me. “The horizon really looks like Hungary.” Meanwhile, he said, “If Lula wins, this is going to energize the political system in such a way that it will probably be a little bit more resilient.”</p>\n<p id=\"dVkUCC\">But Bolsonaro isn’t poised to go quietly if he loses on Sunday. Already in the runup to the election, experts told me, political violence in Brazil has surged; according to one analysis, there have been <a href=\"https://time.com/6218560/political-violence-brazil-election/\">at least 45 politically motivated homicides</a> this year in Brazil.</p>\n<p id=\"ZBz4vb\">That violence, Colin Snider, a history professor at the University of Texas at Tyler who specializes in Brazil, told me, “has been pretty much one-sided” and driven by Bolsonaro supporters; <a href=\"https://time.com/6214070/bolsonaro-political-violence-brazil-election/\">according to Guilherme Boulos</a>, a left-wing Brazilian congressional candidate who won his election earlier this month, Bolsonaro’s “aggressive and irresponsible speeches have escalated a climate of violence and encouraged millions of supporters across Brazil to violently confront those who disagree with them.”</p>\n<p id=\"RIZq3y\">Bolsonaro has also spread <a href=\"https://www.nytimes.com/2022/09/29/world/americas/election-bolsonaro-brazil-fraud.html\">baseless and sweeping conspiracy theories</a> about potential voter fraud in the lead-up to the election, and has made frequent proclamations about his political invincibility; in a speech on Brazil’s independence day last year, <a href=\"https://www.bbc.com/news/world-latin-america-58479028\">he told supporters</a> that “only God will oust me.”</p>\n<p id=\"WIxYGO\">In doing so, according to Snider, Bolsonaro has “fanned the flames among these electorates on the possibility of any election in which he doesn’t win being an illegitimate one, which of course sounds a little familiar.”</p>\n<p id=\"4iSLBg\">It’s been enough to raise concerns in the US; last month, the US Senate <a href=\"https://www.congress.gov/bill/117th-congress/senate-resolution/753\">passed a nonbinding resolution</a> “urging the Government of Brazil to ensure that the October 2022 elections are conducted in a free, fair, credible, transparent, and peaceful manner,” and calling for a review of assistance to Brazil should a government come to power “through undemocratic means, including a military coup.”</p>\n<p id=\"Pg2Vqf\">The Pentagon has also been in touch with its Brazilian counterparts ahead of the October elections, with US Defense Secretary Lloyd Austin <a href=\"https://www.reuters.com/world/uss-austin-says-brazil-defense-minister-told-him-military-focused-transparent-2022-07-27/\">remarking in July</a> that it’s “especially vital for militaries to carry out their roles responsibly during elections.”</p>\n<p id=\"YLpj41\">Such concerns aren’t exactly unreasonable: Bolsonaro, a former army captain, has done plenty to align himself with Brazil’s military and bring members of the country’s armed forces <a href=\"https://www.reuters.com/article/us-brazil-politics/brazils-bolsonaro-militarizes-his-inner-cabinet-idUSKBN2072S5\">into government</a>, and Brazil has previously been governed by a military dictatorship, which was in power from 1964 to 1985.</p>\n<p id=\"cm8KwG\">In July last year, while announcing his reelection bid, Bolsonaro also <a href=\"https://www.reuters.com/world/americas/brazils-bolsonaro-down-polls-set-officially-launch-candidacy-2022-07-24/\">told supporters</a>, “The army is on our side. It’s an army that doesn’t accept corruption, doesn’t accept fraud. This is an army that wants transparency.” </p>\n<p id=\"6K65Aq\">Despite those concerns, however, an outright coup might not be the biggest threat; as <a href=\"https://www.vox.com/2022/10/1/23380820/brazil-election-bolsonaro-lula-results\">Vox’s Ellen Ioanes explained</a> ahead of the first round of voting earlier this month, “the conditions for a military coup just aren’t there.”</p>\n<p id=\"3TAzAl\">Snider agrees, though he stipulates that you “can’t entirely” rule out the military getting involved. Instead, he said, “I think what seems most likely to me would be Bolsonaro not acknowledging the win and his supporters taking to the streets and possibly doing something rash.”</p>\n<p id=\"k1kI6L\">If that occurs, Casarões points out, a <a href=\"https://www.npr.org/2022/08/13/1116989125/brazil-firearm-ownership-booms-gun-laws-loosen-bolsonaro\">dramatically higher rate of gun ownership</a> among Bolsonaro’s most fervent supporters could make post-election violence worse, and the interval between Sunday’s election and inauguration on January 1, 2023, will pose a particular risk. </p>\n<p id=\"9Octww\">“I want to believe that nothing more serious is going to happen,” he said, but “judging by what [Bolsonaro] has been saying and what he’s been doing, I think he’s capable of trying to push the political system to its limits.” </p>\n<h3 id=\"wmG1ly\">The climate is at stake in Sunday’s runoff election</h3>\n<p id=\"crbhr4\">For as much as Brazilian democracy is riding on Sunday’s election and its immediate aftermath, what comes after inauguration could be just as consequential: the Brazilian Amazon is effectively on the ballot. </p>\n<p id=\"Of54Bz\"><a href=\"https://www.vox.com/down-to-earth/2022/9/29/23373427/amazon-rainforest-brazil-jair-bolsonaro-lula-deforestation\">As Vox’s Benji Jones explained</a> in September, “Earth’s future depends on the Amazon,” and that future looks radically different under the respective potential stewardships of Lula and Bolsonaro.</p>\n<p id=\"zolxEY\">After nearly four years in office, Bolsonaro has already done a great deal of damage to the massive rainforest, reversing a decline in deforestation begun under Lula’s previous administration. As Jones writes, Bolsonaro as president has “<a href=\"https://www.nytimes.com/2019/07/28/world/americas/brazil-deforestation-amazon-bolsonaro.html\">stripped enforcement measures</a>, <a href=\"https://www.reuters.com/article/us-brazil-environment-ibama-exclusive/exclusive-as-fires-race-through-amazon-brazils-bolsonaro-weakens-environment-agency-idUSKCN1VI14I\">cut spending</a> for <a href=\"https://www.nature.com/articles/d41586-022-03038-3\">science</a> and <a href=\"https://www.bbc.com/news/world-latin-america-56847958\">environmental</a> agencies, <a href=\"https://news.mongabay.com/2020/05/brazil-sacks-officials-who-curbed-deforestation-on-amazon-indigenous-lands/\">fired environmental experts</a>, and pushed to weaken Indigenous land rights, among <a href=\"https://www.nature.com/articles/d41586-022-03038-3\">other activities</a> largely in support of the agribusiness industry.”</p>\n<p id=\"dqgLFn\">For all that damage, though, another four years could be worse; as the <a href=\"https://www.nature.com/articles/d41586-020-00508-4\">journal <em>Nature</em> has previously explained</a>, the rainforest ecosystem is in danger of reaching a “tipping point” where portions spiral into an arid, savannah-like environment. Four more years of Bolsonaro could be the <a href=\"https://www.theguardian.com/environment/2021/jul/14/amazon-rainforest-will-collapse-if-bolsonaro-remains-president\">final push over the brink</a>, further harming a crucial carbon sink, <a href=\"https://www.eenews.net/articles/biden-talks-emissions-with-brazils-climate-denying-president/\">accelerating climate change</a> through continued deforestation, and laying waste to a unique ecosystem.</p>\n<p id=\"Q193SY\">Lula, by comparison, has signaled that, if elected, he will move to <a href=\"https://www.reuters.com/world/americas/lula-no-need-fell-single-tree-boost-brazil-farm-output-2022-08-22/\">reverse deforestation trends</a> in the Brazilian Amazon and end illegal mining. “Brazil will look after the climate issue like never before,” he said in August. “We want to be responsible for maintaining the climate.”</p>\n<p id=\"X6odVH\">According to Snider, protecting the Amazon is one area where Lula could be particularly influential. Though <a href=\"https://www.reuters.com/world/americas/right-wing-wins-brazils-congress-show-staying-power-bolsonarismo-2022-10-03/\">Brazil’s right-wing Congress</a>, strengthened after elections earlier this month, will likely make governing a challenge for a potential Lula administration, there’s a great deal that can be done unilaterally.</p>\n<p id=\"Uz3JSz\">“The ability to roll back [deforestation] is reasonable, and this is one of the major issues at stake that’s not really voted on as much because there are instruments in place to crack down on illegal mining,” Snider said. “There are mechanisms to better monitor that, to better crack down and penalize those who do it, to those who are deforesting.” </p>\n<p id=\"BOvbQA\">Bolsonaro’s government has also <a href=\"https://www.vox.com/down-to-earth/2022/9/29/23373427/amazon-rainforest-brazil-jair-bolsonaro-lula-deforestation\">declined to spend</a> the environmental ministry’s full budget for enforcing deforestation protections in past years, another thing that could change under Lula. <a href=\"https://www.vox.com/down-to-earth/2022/9/29/23373427/amazon-rainforest-brazil-jair-bolsonaro-lula-deforestation\">According to Christian Poirier</a>, program director at the nonprofit advocacy group Amazon Watch, a Lula presidency could “undo the brutal regressions of the Bolsonaro regime.”</p>\n<p id=\"TuByfB\">First, though, Brazilian voters will go to the polls for the second time in a month, with an uncertain outcome on the other side. And whatever happens next, Snider told me, “Bolsonaro is very much a wild card.” </p>",
  "link": "",
  "id": "https://www.vox.com/2022/10/29/23421761/brazil-runoff-election-lula-bolsonaro-democracy-climate",
  "author": {
    "name": "Cameron Peters"
  }
}