{
  "title": "510: The Best (or Weirdest) of Harry Potter Fan Fiction",
  "link": "https://audioboom.com/posts/7847694",
  "itunes:episode": 510,
  "itunes:title": "The Best (or Weirdest) of Harry Potter Fan Fiction",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4390,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>News: British star of stage, film and TV Helen McCrory <a href=\"https://www.nytimes.com/2021/04/16/arts/television/helen-mccrory-dead.html\">has died</a>. We wish the best to her family and loved ones.</li>\n<li>Main Discussion: Former MuggleNet Fan Fiction moderator Laura Tee is here to discuss fanfic!</li>\n<li>Have the MuggleCast hosts read fanfic before? Why or why not? Was there a stigma attached in the early days?</li>\n<li>Laura runs through some common Harry Potter fanfic tropes including American exchange students, students getting \"HOT\" over the summer, and replacement love interests for Snape.</li>\n<li>The hosts have each read some of the most popular Potter fanfics as suggested by our listeners, and are here to dish!</li>\n<li>In \"<a href=\"https://archiveofourown.org/works/2345300/chapters/5171522\">The Very Secret Diary</a>\" by Arabella, Laura found a depth to Ginny's character that was lacking for her in the books.</li>\n<li>Eric describes the 700,000 word Hermione time-travel epic, \"<a href=\"https://archiveofourown.org/works/10672917/chapters/23626929\">The Debt of Time</a>\" by ShayaLonnie</li>\n<li>\n<em>Debt of Time</em> is so massive that it even has its own read-through podcast, <a href=\"https://www.fwhpod.com/\">Firewhisky and Honey</a>.</li>\n<li>Micah's choice for fan fiction, \"<a href=\"https://www.fanfiction.net/s/6337916/1/In-the-Light-Of-the-Stars\">In the Light of the Stars</a>\" by little0bird, features a lot of diversity as a teenaged McGonagall navigates wartime Britain.</li>\n<li>Draco and Hermione meet repeatedly for coffee in Andrew's new favorite fanfic, \"<a href=\"https://archiveofourown.org/works/23875939/chapters/57393508\">Remain Nameless</a>\" by HeyJude19.</li>\n<li>After talking about SO MUCH fan fiction, and listing off some honorable mentions, the hosts try their own hand at writing fanfiction with prompts given to them by Laura!</li>\n<li>Andrew reads his heartwarming meetcute for adult Scorpius Malfoy and Albus-Severus Potter.</li>\n<li>Micah adds a new best friend on to the journey Hagrid and Maxime take through the mountains in his fanfic.</li>\n<li>...and Eric reads his scene in which My Chemical Romance headlines the Yule Ball at Hogwarts.</li>\n<li>Quizzitch: <strong> </strong>Which member of American rock band MCR dropped out of college to join the band? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week’s episode is sponsored by BetterHelp (Get 10% off your first month at <a href=\"https://www.BetterHelp.com/mugglecast\">BetterHelp.com/mugglecast</a>) and MasterClass (Get 15% off an annual subscription at <a href=\"https://www.MasterClass.com/mugglecast\">MasterClass.com/mugglecast</a>)!</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like access to our recording studio, Bonus MuggleCast a personalized thank you video from one of the hosts and more!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 20 Apr 2021 11:00:00 +0000",
  "guid": "tag:audioboom.com,2021-04-19:/posts/7847694",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}