{
  "id": "yt:video:RyrTHlOdjDA",
  "yt:videoId": "RyrTHlOdjDA",
  "yt:channelId": "UCgRBRE1DUP2w7HTH9j_L4OQ",
  "title": "Doing Real Science (and Breakdancing) In Zero Gravity",
  "link": "",
  "author": {
    "name": "Medlife Crisis",
    "uri": "https://www.youtube.com/channel/UCgRBRE1DUP2w7HTH9j_L4OQ"
  },
  "published": "2022-02-01T14:11:56+00:00",
  "updated": "2022-02-04T16:55:46+00:00",
  "media:group": {
    "media:title": "Doing Real Science (and Breakdancing) In Zero Gravity",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Support the channel by visiting https://www.curiositystream.com/medlife and use the code 'medlife' for a year of CuriosityStream and Nebula – where you'll find 14 and a half extra minutes of footage at the end of this video!\n\nI got to do some real science in weightlessness! A total of 23 whole astro minutes in freefall. This wasn't a tourist flight but a real life science campaign with the European Space Agency and NASA. It really was a dream come true. I've wanted to do a parabolic flight ever since I watched 'The Making of Apollo 13' (the movie not the actual event) as a kid and learnt how they filmed it. I guess this will be the closest I'll get to going into space!\n\nHuge thank you to Neil Melville, &#13;Ruth McAvinia, &#13;Anne-Clotilde Duchesne, &#13;Sébastien Turay, &#13;Karina Marshall-Goebel, &#13;Rosita Suenson, Lars, and all the scientists I met and chatted to on the campaign.\n\nAs the channel scales up, I'm really trying to commit to things I've wanted to do but previously told myself I don't have time or money to address. The first on that list is subtitles, which I'm going to do my best to provide for every video if I can. Sometimes they're uploaded a bit last minute/impromptu and I'll endeavour to get them up afterwards, but I'm now working with a company to get subtitles in place before publication if possible. To everyone who uses subtitles – sorry it took so long.\n\nLink to Karina's 2019 paper about jugular flow on the International Space Station:\nhttps://jamanetwork.com/journals/jamanetworkopen/fullarticle/2755307&#13;\n\nSign up for my free newsletter: https://medlife.substack.com/\n\n-----------------\n\nMore Medlife Crisis:\n\nhttp://www.medlifecrisis.co.uk\nhttps://twitter.com/medcrisis\nhttps://www.youtube.com/channel/UCXFgI0Lgrwc_fY2ttqQ9Yhg\nhttps://watchnebula.com/medlifecrisis\nhttps://www.instagram.com/medcrisis\nhttps://www.facebook.com/Medlifecrisis",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}