{
  "title": "Micro 4D Printing Builds on Programmable Matter",
  "link": "https://spectrum.ieee.org/4d-printing-microscale",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/gif-of-flower-and-octopus-side-by-side-growing-larger.gif?id=32013280&width=1200&height=400&coordinates=0%2C127%2C0%2C127\"/><br/><br/><p>Objects that can transform themselves after they’ve been built could have a host of useful applications in everything from robotics to biomedicine. A new technique that combines <u><a href=\"https://spectrum.ieee.org/tag/3d-printing\" target=\"_self\">3D printing</a></u> and an ink with dynamic chemical bonds can create microscale structures whose size and mechanical properties can be dynamically tuned after fabrication.<br/></p><p> The idea of “<u><a href=\"https://spectrum.ieee.org/make-your-own-world-with-programmable-matter\" target=\"_self\">programmable matter</a></u>” that can adapt its physical properties in response to stimuli has been around for decades, but recent advances in additive manufacturing have brought it within reach. By 3D printing with materials that react to things like high temperatures or electric currents, researchers have been able to create objects whose form or function can morph and adapt.</p><p> The approach is known as <u><a href=\"https://spectrum.ieee.org/4d-printing-turns-carbon-fiber-wood-into-shapeshifting-programmable-materials\" target=\"_self\">4D printing</a></u>, with time being the extra dimension, and has been used to create everything from <u><a href=\"https://www.nature.com/articles/srep31110#acknowledgements\" target=\"_blank\">robotic grippers</a></u> to adaptable <u><a href=\"https://spectrum.ieee.org/4d-bioprinting-smart-constructs-for-the-heart#toggle-gdpr\" target=\"_self\">scaffolds </a>for growing biological tissue</u>. Now researchers have unveiled a new technique that makes it possible to print intricate microscale structures that can later be expanded to up to eight times their size or made harder or softer at will.</p><p class=\"pull-quote\">“This is a very fundamental thing on top of which you can build more ideas afterwards.”<br/>—Eva Blasco, University of Heidelberg</p><p> The key is a novel ink formulation that includes dynamic chemical bonds that can be opened and closed, making it possible to adjust the mechanical properties of the printed object or allow the incorporation of new material. Integrating these kinds of dynamic bonds and characteristics into 3D printed objects could allow users to carefully tweak a wide range of physical characteristics after fabrication, says <u><a href=\"https://www.cam.uni-heidelberg.de/user/details?id=196\" rel=\"noopener noreferrer\" target=\"_blank\">Eva Blasco</a></u>, a professor of polymer chemistry at the University of Heidelberg, who led the research.</p><p> “It’s the first time that we have this ‘livingness’ concept, that we have active bonds in the printed microstructure that allow us to grow further or change the mechanical properties,” she says. “This is a very fundamental thing on top of which you can build more ideas afterwards.”</p><p> To create their detailed microstructures, Blasco’s team relied on an approach known as two-photon laser printing (2PLP), which works by shining a laser beam at inks that chemically react when exposed to light. Typically this involves a reaction known as <a href=\"https://en.wikipedia.org/wiki/Polymerization\" target=\"_blank\">polymerization</a>, in which smaller molecules known as monomers react together to create long chains known as polymers.</p><p> Wherever the laser is focused it creates networks of polymers. And so by carefully scanning over the photosensitive material, it is possible to build up complex 3D objects with precise features. The approach, Blasco says, is able to operate at smaller scales than other 3D printing methods.</p><p> The researchers’ main innovation, reported in a <a href=\"https://onlinelibrary.wiley.com/doi/10.1002/adfm.202207826\" rel=\"noopener noreferrer\" target=\"_blank\"><u>paper in</u><u><em> Advanced Functional Materials</em></u></a><em>, </em>was to create a new ink formulation that results in a polymer featuring a special kind of chemical bond, known as a <a href=\"https://onlinelibrary.wiley.com/doi/abs/10.1002/anie.201813525#:~:text=Dynamic%20covalent%20bonds%20(DCBs)%20have,these%20DCBs%20in%20polymeric%20materials.\" target=\"_blank\">dynamic covalent bond</a>. When certain chemicals are introduced to the polymer, these bonds can open and close, which makes it possible to tune the microstructure of the printed object after fabrication, says Blasco.</p><p> To demonstrate the potential of their approach, her team 3D-printed microscale models of a flower, an octopus, and a gecko. These objects were just a few micrometers across, fabricated via the researchers’ specially devised ink, which creates a rubbery substance when polymerized. The newly printed objects were then immersed in a vial containing styrene—a <a href=\"https://en.wikipedia.org/wiki/Monomer\" target=\"_blank\">monomer</a> that creates a glassy polymer called polystyrene—before being heated, which caused the dynamic covalent bonds to open.</p><p> Once the bonds opened up, strands of polystyrene formed in between the two ends, causing the volume of the microscale models to grow by as much as eight times in around four hours. The addition of polystyrene also resulted in the models becoming significantly harder, but despite the expansion they retained their shape and the fine detail of their structures.</p><p> In a separate experiment, the researchers showed they could alter the mechanical properties of printed structures without changing their size by heating them in the presence of a molecule that helps open up the dynamic bonds. This made the objects softer, because opening up the bonds reduces the amount of cross-linking in the polymer networks.</p><p> Tunable materials that swell or expand have been investigated for some time, says <u><a href=\"https://www.brunel.ac.uk/people/eujin-pei\" rel=\"noopener noreferrer\" target=\"_blank\">Eujin Pei</a>,</u> a reader in additive manufacturing at Brunel University London. He says the new research is more an extension of current knowledge and capabilities in 4D printing than a significant advancement. He points out that most 4D-printing research focuses on achieving actuation, or a sequence of movements, rather than simply expanding in size.</p><p> Blasco qualifies this assessment, though, with the stipulation that her group’s approach is a proof of concept and still admittedly some distance from practical applications. Nonetheless, she says, the incorporation of dynamic covalent chemistry into 3D printing has considerable potential and will enable some unique capabilities. It could, she adds, potentially allow new monomers with novel functionality, such as elasticity or fluorescence, to be introduced after fabrication, all of which open up a range of novel possibilities.</p><p> Most 4D-printing approaches, according to Blasco, rely on materials that essentially flick between one of two states. In contrast, Blasco’s group’s method makes it possible to tune the material’s properties across a range of values. “From the application point of view, you have much more versatility to adapt the material properties by controlling the proportion of open and closed bonds,” says Blasco.</p><p> The team’s next steps will be to adapt their ink’s chemistry toward more specific applications, says Blasco, including finding ways to make it biocompatible.</p>",
  "pubDate": "Fri, 28 Oct 2022 14:57:30 +0000",
  "guid": "https://spectrum.ieee.org/4d-printing-microscale",
  "category": [
    "4d printing",
    "3d printing",
    "Programmable matter",
    "Polymers",
    "Chemistry",
    "Additive manufacturing"
  ],
  "dc:creator": "Edd Gent",
  "media:content": ""
}