{
  "title": "Egg whites could be key to removing microplastics from seawater",
  "description": "<p>Microplastics are a bane that harms wildlife, but you may be staring at the solution to this problem in your breakfast. Princeton researchers have used egg whites to <a href=\"https://engineering.princeton.edu/news/2022/11/03/researchers-cook-new-way-remove-microplastics-water\">create</a> a lightweight, porous aerogel that can remove microplastics and salt from seawater.  When you freeze-dry and superheat the whites (up to 1,652F) in an oxygen-free space, their pure protein system produces a mix of carbon fiber strands and <a href=\"https://www.engadget.com/graphene-hard-drive-university-of-cambridge-234912178.html\">graphene</a> sheets that can remove 99 percent of tiny plastics from water, and 98 percent of the salt. Even fried and whipped eggs work just as well.</p><p>As you might imagine, a readily available organic material like this has its benefits. It's cheap to make, and needs only gravity to work. It won't consume energy or excess water. Activated carbon is cheap, but it's not nearly as effective as the egg white gel. And while eggs from the grocery store prompted the breakthrough, you can use other proteins that won't cut into the population's food supply.</p><span id=\"end-legacy-contents\"></span><p>The aerogel isn't ready for widespread use just yet. Scientists need to refine the manufacturing process before mass production is possible. If that happens, though, the implications are clear. It would be comparatively easy to remove microplastics and otherwise purify water while minimizing the environmental impact. While the salt removal may create problems in oceans, it may be very helpful for desalinization in areas where fresh drinking water is difficult to find.</p><p>There are other purposes, for that matter. The gel might also be useful for energy storage and insulation, so don't be surprised if you one day find egg-like proteins in your walls.</p>",
  "link": "https://www.engadget.com/egg-whites-remove-microplastics-from-water-163248018.html?src=rss",
  "source_id": "engadget_479",
  "guid": "46513cd0-12bf-4904-8c93-b00b15891ea7",
  "dc:creator": "Jon Fingas",
  "source": "Engadget",
  "dc:publisher": "Engadget",
  "dc:rightsHolder": "Engadget",
  "pubDate": "Fri, 04 Nov 2022 16:32:48 +0000",
  "ingested": 1667588177,
  "modified": "2022-11-04T18:56:20+00:00",
  "category": [
    "Environment",
    "Nature & Environment",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Jon Fingas"
  ],
  "media:content": [
    {
      "media:keywords": "headline",
      "media:media_html": "",
      "dc:identifier": 1,
      "media:credit": "",
      "media:description": "",
      "media:title": ""
    },
    {
      "media:media_html": "",
      "dc:identifier": 2,
      "media:credit": "Shaharyar Wani",
      "media:description": "Aerogel made from egg whites removes microplastics from water",
      "media:title": "Aerogel made from egg whites removes microplastics from water"
    }
  ]
}