{
  "id": "yt:video:4es9DbDpPq0",
  "yt:videoId": "4es9DbDpPq0",
  "yt:channelId": "UCGaVdbSav8xWuFWTadK6loA",
  "title": "Most People Have Never Been 20",
  "link": "",
  "author": {
    "name": "vlogbrothers",
    "uri": "https://www.youtube.com/channel/UCGaVdbSav8xWuFWTadK6loA"
  },
  "published": "2022-10-11T15:44:41+00:00",
  "updated": "2022-10-15T05:50:25+00:00",
  "media:group": {
    "media:title": "Most People Have Never Been 20",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "In which John gets curious about when the median human being lived, and along the way learns something surprising about the human story.\nLINK/SOURCES:\nYou can make a one-time or monthly donation to support better maternal and child healthcare in Sierra Leone here: http://pih.org/hankandjohn\n\nMost of the population data in this video comes from the Population Reference Bureau, especially this excellent article: https://www.prb.org/articles/how-many-people-have-ever-lived-on-earth/ That's also where I learned that life expectancy in Iron Age France was 10-12.\n\nThe graphs and much of the information on life expectancy at various ages comes from Our World in Data, which is amazing. Here's their article on life expectancy over time and across communities: https://ourworldindata.org/life-expectancy\n\nTheir article on child survival and mortality statistics: https://ourworldindata.org/child-mortality\n\nAnd their article examining mortality in the distant past: https://ourworldindata.org/child-mortality-in-the-past\n\nI mostly relied on PRB info for global populations at various times, but this research summary from census.gov was also helpful: https://www.census.gov/data/tables/time-series/demo/international-programs/historical-est-worldpop.html\n\nHere's my math for why most people have never been 20: Of the first 100 billion people who lived, at least half (the most prominent researchers in the field consider that estimate on the low end) of people died before 15. Counting the 3% or so who died between 15 and 20, that means that probably at least 53 billion of the first 100 billion people died before the age of 20. Of the most recent 10 billion who died (most of whom were born between 1800 and 1950), over 30% died before the age of 20. That takes us to a conservative estimate of 56 billion of the 110 billion people who've died so far. (2.6 billion people are CURRENTLY under the age of 20, so even if you look at the entire population of humans, it is probable that most people have never been 20--hence the title.)\n\n\n----\nSubscribe to our newsletter! http://eepurl.com/Bgi9b\nAnd join the community at http://nerdfighteria.com  \nHelp transcribe videos - http://nerdfighteria.info\nLearn more about our project to help Partners in Health radically reduce maternal mortality in Sierra Leone: https://www.pih.org/hankandjohn\nIf you're able to donate $2,000 or more to this effort, please join our matching fund: https://pih.org/hankandjohnmatch\nJohn's twitter - http://twitter.com/johngreen\nHank's twitter - http://twitter.com/hankgreen\nHank's tumblr - http://edwardspoonhands.tumblr.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}