{
  "title": "Defending Unhoused People: SPLC fights back against discriminatory ordinances that punish individuals who do not have homes",
  "link": "https://www.splcenter.org/news/2022/11/04/defending-unhoused-people",
  "description": "<div class=\"field field-name-field-story-type field-type-list-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Features and Stories</div>\n      </div>\n</div>\n<div class=\"field field-name-field-image field-type-image field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"></div>\n      </div>\n</div>\n<div class=\"field field-name-title-field field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><h1>Defending Unhoused People: SPLC fights back against discriminatory ordinances that punish individuals who do not have homes</h1>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><p>I am a homeless lawyer.</p>\n<p>No, I have never personally experienced homelessness. But it is fitting that the first thing you know about me is that I am a lawyer who has spent nearly my entire legal career representing people who do not have a safe place to call home.</p>\n<p>It is, after all, the first thing we are told about a person – that they are homeless. Most often it is the only thing we ever know, without ever learning the person’s name. It reads like a credential, erasing any other identity such as parent, sibling, neighbor or friend. So I wear my own credential – that of a homeless lawyer – in solidarity with the people whose names I know and whose stories I carry.</p>\n<p>It is this work that brought me to the Southern Poverty Law Center in 2021, where I currently serve as the deputy legal director of the Economic Justice Project. In this role, I lead a team of lawyers and legal professionals working across the Deep South to advance the SPLC’s goal of eradicating poverty by expanding access to opportunity and eliminating racial economic inequality.</p>\n<p>In the early days of the COVID-19 pandemic in March 2020, states across the country began issuing orders for people to stay at home to prevent the spread of the novel coronavirus. The ability to stay home without severe economic consequences depended in large part on the types of jobs people held. The pandemic instantly realigned our society across a new driver of inequality: those who can choose to stay home to protect their health, and those who cannot.</p>\n<p>But for the more than 500,000 individuals experiencing homelessness in our country, how do you stay home when you do not have a place to call home?</p>\n<p>The pandemic revealed again and again the safety and stability that only housing provides, which is not available to all on equal terms. Racism in our housing and economic systems has created a homelessness crisis that <a href=\"https://endhomelessness.org/resource/racial-inequalities-homelessness-numbers/\" target=\"_blank\">disproportionately impacts Black and Brown communities</a>. African Americans make up 13% of the general population but 40% of the unhoused population.</p>\n<p>Cities across the country, and in the Deep South where we work, have responded to the visibility of people who are unhoused and unsheltered in our communities with laws restricting sleeping or camping outdoors. These laws are unconstitutional because they punish individuals for being human beings who need sleep, a life-sustaining activity that must occur at some time and some place. For most of us, that is our homes. But for too many of our unhoused friends and neighbors, these ordinances make their very existence a crime.</p>\n<h2>Racially discriminatory</h2>\n<p>In August of this year, the <a href=\"https://tbinternet.ohchr.org/Treaties/CERD/Shared%20Documents/USA/CERD_C_USA_CO_10-12_49769_E.pdf\" target=\"_blank\">U.N. Committee on the Elimination of Racial Discrimination</a> expressed its view that the criminalization of homelessness in the U.S. is racially discriminatory, noting “it remains concerned at the increasing number of state and local laws that criminalize homelessness and at the disproportionately high number of persons belonging to racial and ethnic minorities affected by homelessness.”</p>\n<p>In the past year, we worked with a coalition of partners to successfully defeat a proposed camping ordinance in <a href=\"https://www.al.com/news/2022/01/is-anti-camping-ordinance-aimed-at-mobiles-homeless-council-set-to-debate.html\" target=\"_blank\">Mobile, Alabama</a>. We opposed ordinances banning camping in <a href=\"https://www.theadvocate.com/baton_rouge/news/article_c021b430-f267-11ec-bb18-c3cecb679762.amp.html\" target=\"_blank\">Baton Rouge, Louisiana</a>, and in <a href=\"https://www.pewtrusts.org/en/research-and-analysis/blogs/stateline/2022/04/08/homeless-camping-bans-are-spreading-this-group-shaped-the-bills\" target=\"_blank\">Lula, Georgia</a>, that ultimately passed despite our warnings that these ordinances may violate the U.S. Constitution by criminalizing the status of being homeless. We also provided legal support to grassroots organizations working to delay closure of a large encampment that resulted in additional procedures to allow people time to relocate, avoiding mass arrests and property destruction in <a href=\"https://www.alreporter.com/2022/06/10/splc-huntsville-plan-to-evict-homeless-from-encampment-threatens-their-health-and-lives/?amp\" target=\"_blank\">Huntsville, Alabama</a>.</p>\n<p>However, as SPLC attorney Clara Potter told the local ABC affiliate during the closure of the Huntsville camp, “these camp closures are part of a larger problem, where there’s an emphasis on law enforcement solutions but not sufficient equal emphasis on long-term housing solutions, and only those supportive housing solutions are really going to help folks get back on their feet.”</p>\n<p>Despite clear evidence that <a href=\"https://www.usich.gov/news/collaborate-dont-criminalize-how-communities-can-effectively-and-humanely-address-homelessness\" target=\"_blank\">criminalization is not a solution to homelessness</a>, we also contended with a bill proposed during the 2022 Georgia legislative session to ban camping statewide and create incentives for local law enforcement of camping bans, effectively criminalizing homelessness in the entire state. The bill did not pass, and instead the Legislature set up a commission to study homelessness. This bill is part of a <a href=\"https://www.pewtrusts.org/en/research-and-analysis/blogs/stateline/2022/04/08/homeless-camping-bans-are-spreading-this-group-shaped-the-bills\" target=\"_blank\">growing trend of state legislatures</a> endorsing handcuffs as a solution to homelessness instead of the housing that people need.</p>\n<p>And, in response to the visibility of people holding signs in public places to communicate their need for help and other charitable assistance, state and local law enforcement agencies enforce state statutes and local ordinances criminalizing charitable solicitation in the form of bans against panhandling or begging. Such measures are clearly unconstitutional restrictions on protected speech, as evidenced by our lawsuit against the city of Montgomery, Alabama, and the sheriff of Montgomery County for enforcement of statutes that restricted asking for charity in public places throughout the state.</p>\n<p>We reached an early <a href=\"/news/2020/12/14/housing-not-handcuffs-splc-allies-end-police-harassment-people-panhandling-montgomery\">settlement agreement with the city</a> on behalf of Jonathan Singleton, Ricky Vickery, and Micki Holmes, and after a judge issued a <a href=\"/presscenter/judge-finds-laws-criminalizing-panhandling-be-unconstitutional\">preliminary injunction</a>, the sheriff recently agreed not to enforce the challenged statutes. Our litigation continues against the Alabama Law Enforcement Agency, as we work to ensure that people who need help are not silenced because they are communicating a message many people would rather not hear about hunger and homelessness in our communities.</p>\n<p>It should be a crime to allow homelessness to exist in this country, the richest country in the world. Yet we misplace the blame and instead punish unhoused people based on a misguided belief that we can end homelessness if we simply make it a crime. As though homelessness were a personal choice, instead of a predictable consequence of treating <a href=\"https://housingmatters.urban.org/articles/naming-housing-human-right-first-step-solving-housing-crisis\" target=\"_blank\">housing as a privilege instead of a human right</a>.</p>\n<p>This is simply wrong. Criminalizing homelessness does nothing to address the root causes of the housing crisis. Instead, it causes untold human suffering and makes it more difficult for people to exit homelessness. Criminalization misplaces blame for homelessness on people, instead of the unjust systems that need to be reformed so that everyone has a safe place to call home.</p>\n<p><em>Picture at top: Paul Bradbury/Getty Images</em></p>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-person field-type-entityreference field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><article id=\"node-16811\" class=\"node node-person node-teaser node-odd\">\n\n  \n  <div class=\"content\">\n    <div class=\"field field-name-field-image field-type-image field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><a href=\"/about/staff/kirsten-anderson\"><img src=\"https://www.splcenter.org/sites/default/files/styles/splc_person_circle_small/public/web_kirsten-anderson.jpg?itok=Goime5Gx\" width=\"64\" height=\"64\" alt=\"Kirsten Anderson\" title=\"Kirsten Anderson\" /></a></div>\n      </div>\n</div>\n<div class=\"group-text-field-group\"><div class=\"field field-name-title-field field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><a href=\"/about/staff/kirsten-anderson\">Kirsten Anderson</a></div>\n      </div>\n</div>\n<div class=\"field field-name-field-person-title field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Deputy Legal Director for Economic Justice </div>\n      </div>\n</div>\n</div>  </div> <!-- /content -->\n\n  \n      <div class=\"links\">\n          </div> <!-- /links -->\n  \n  </article> <!-- /article #node --></div>\n      </div>\n</div>\n<div class=\"field field-name-field-addthis field-type-addthis field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><div class=\"addthis_toolbox addthis_default_style  \" addthis:title=\"Defending Unhoused People: SPLC fights back against discriminatory ordinances that punish individuals who do not have homes - Southern Poverty Law Center\" addthis:url=\"https://www.splcenter.org/news/2022/11/04/defending-unhoused-people\"><a href=\" \" class=\"addthis_button_facebook\" aria-label=\"Facebook: Share this page\"></a>\n<a href=\" \" class=\"addthis_button_twitter\" aria-label=\"Twitter: Share this page\"></a>\n</div>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-publish-date field-type-date field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><span class=\"date-display-single\">November 04, 2022</span></div>\n      </div>\n</div>",
  "pubDate": "Fri, 04 Nov 2022 19:21:41 +0000",
  "dc:creator": "rudy.isaza_2663",
  "guid": "17216 at https://www.splcenter.org"
}