{
  "title": "S14 Ep65: Supernatural News/Parashare: Head, Shoulders, Legs & Parts Edition",
  "link": "https://audioboom.com/posts/8098565",
  "itunes:episode": 65,
  "itunes:title": "Supernatural News/Parashare: Head, Shoulders, Legs & Parts Edition",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5191,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Bizarre news on BEYOND the DARKNESS plus Supernatural News & we share YOUR Paranormal Stories.<br>\n<br>\nAmazon is reuniting Simon Pegg and Nick Frost for a Ghost Hunting Parody, Aliens may be flashing us, but not like you think, and an Arizona Body Donation Facility has a brand new use for all those bodies donated for \"science\"!<br>\n<br>\nAll that and more today on the Best in Paranormal Talk Radio.<br>\n<br>\nPLUS:  There is an all new Darkness Radio app for IOS and IPhone!  Check the app store by searching \"Darkness Radio\" and looking for the picture of \"Skully\"! Best of all, it's free! <br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.<br>\n<br>\nAway creates a range of essentials that solve real travel problems, so all you have to think about is where you’re<br>\nheaded next.  For $20 off a suitcase, visit <a href=\"http://awaytravel.com/DARKNESS\">awaytravel.com/DARKNESS</a> and use promo code DARKNESS during checkout!",
  "itunes:summary": "Bizarre news on BEYOND the DARKNESS plus Supernatural News & we share YOUR Paranormal Stories.\n\nAmazon is reuniting Simon Pegg and Nick Frost for a Ghost Hunting Parody, Aliens may be flashing us, but not like you think, and an Arizona...",
  "pubDate": "Sat, 10 Aug 2019 08:00:00 +0000",
  "guid": "c7fa0e02-d049-4bfe-b47d-de782436554a",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}