{
  "guid": "urn:uuid:c9eaafc2-c23c-4e44-b1ca-4d50d8f2705f",
  "link": "https://www.who.int/news/item/30-03-2022-egypt-and-nigeria-medicines-regulators-achieve-high-maturity-level-in-who-classification-and-who-launches-list-of-regulatory-authorities-that-meet-international-standards",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Egypt and Nigeria medicines regulators achieve high maturity level in WHO classification and WHO launches list of regulatory authorities that meet international standards",
  "description": "<p>Today, WHO announced that Egypt&rsquo;s and Nigeria&rsquo;s medical products regulatory agencies had reached maturity level 3. This means that these national bodies have been found to function well and that they could be eligible for inclusion into the transitional WHO Listed Authorities, a list that will comprise the world&rsquo;s regulators of reference &ndash; that is, regulatory authorities that should be globally recognized as meeting WHO and other international standards.</p><p>Egypt has reached maturity level 3 for vaccines regulation (locally produced and imported) and Nigeria for medicines and imported vaccines. The two countries join Ghana and Tanzania as effective regulatory systems on the African continent. Several other African regulators are currently under assessment.&nbsp; &nbsp;<strong></strong></p><p>WHO&rsquo;s assessment of regulatory authorities is based on the &lsquo; <a href=\"https://www.who.int/tools/global-benchmarking-tools\">Global Benchmarking Tool</a>&rsquo; &ndash; an evaluation tool that checks regulatory functions against a set of more than 260 indicators &ndash; covering core regulatory functions such as product authorization, testing of products, market surveillance and the ability to detect adverse events &ndash; to establish their level of maturity and functionality. Regulatory authorities that reach maturity levels 3 and 4 will be eligible for inclusion among WHO-listed authorities, after additional evaluation of their performance.</p><p>The benchmarking of Egypt and Nigeria&rsquo;s regulators was carried out by a WHO-led team of international experts. In February and March 2022, WHO conducted a formal evaluation of the authorities and found them to perform well against most of the indicators in the Global Benchmarking Tool.</p><p><strong>The importance of regulatory oversight for local manufacturing</strong></p><p>Egypt and Nigeria were also chosen in February 2022 as recipients of mRNA technology from the WHO  <a href=\"https://www.who.int/initiatives/the-mrna-vaccine-technology-transfer-hub#:~:text=The%20mRNA%20vaccine%20technology%20transfer%20hub&amp;text=Announced%20on%2021%20June%202021,the%20mRNA%20vaccine%20technology%20hub).\">mRNA Technology Transfer Hub</a>. Effective and efficient regulatory oversight is critical to efforts to boost manufacturing capacity as they ensure that medical products entering the market are safe, effective and produced according to international quality standards.</p><p>&ldquo;Egypt and Nigeria have come a long way to improve their regulatory work and performance,&rdquo; said Mariangela Simao, WHO Assistant Director General for Access to Health Products. &ldquo;Given that medical products regulatory oversight and manufacturing must work in tandem, this is very good news for access to quality health products on the African continent.&rdquo;<strong></strong></p><p>Regulation of medical products is extremely important for all health systems and for access to quality vaccines, medicines and other health products. Apart from ensuring the quality, safety and efficacy of medical products, regulatory authorities that function well also perform critical functions such as faster authorization of products and safety monitoring after authorization.</p><p>Fewer than 30% of the world&rsquo;s regulatory authorities are considered fully functioning and operational. For that reason, WHO has intensified efforts to bolster the capacity to regulate medical products in all regions.</p><p><strong>WHO listed authorities</strong></p><p>WHO today also announced a transitional WHO-Listed Authorities (WLAs) list. The introduction of a framework for designating and publicly listing a regulatory authority as a WLA aims to provide a transparent and evidence-based pathway for regulatory authorities to be globally recognized as meeting and applying WHO and other internationally recognized standards and guidelines, as well as good regulatory practices.</p><p>The designation of a regulatory authority as a WLA is intended to promote access and the supply of safe, effective and quality medical products. It also encourages the optimal use of limited resources by facilitating reliance on the work and decisions of mature and advanced agencies in the decision-making of other regulatory authorities, the WHO Prequalification Programme, and procurement bodies.</p><p>The transitional WLA combines pre-existing lists of Stringent Regulatory Authorities for medicines, highly performing regulatory authorities for vaccines, Regional Reference Authorities for medicines and vaccines in the Americas (AMRO/PAHO), national regulatory authorities operating at maturity levels 3 and 4, and vaccine producing countries with functional regulatory authorities. The WHO Listed Authorities framework will come into full effect pending successful pilots later this year.</p><p>&nbsp;</p>",
  "pubDate": "Wed, 30 Mar 2022 13:14:57 Z"
}