{
  "title": "Negative Emotions | True Ghost Stories",
  "link": "https://audioboom.com/posts/8120718",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1829,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Did the negative and depressed emotions of an individual conjure or create a dark entity?<br>\nHere is a preview of the story.<br>\n“He was in a negative place mentally and emotionally. One night he started to wake up suddenly and would see a dark figure near his bedside. Shortly after waking, the figure would disappear. This went on for weeks before he told me, but something happened, he just couldn't ignore. He woke up with scratches on his leg after seeing this figure at his bedside one night. We tried to debunk it by checking the spacing between the scratches and comparing them to the cats and dogs in the house. We couldn't recreate this; it just wasn't possible. We concluded that this wasn't a coincidence and it had to be related. That day I told him we had to visit a little shop I frequented as a kid as I knew we needed to fill his room with religious objects for protection such as a few rosaries and blessed mother statues. Ever since we bought these items, nothing has happened! We were talking to a friend of ours who happens to be newly religious, about the experience and he said something that gave me a horrible feeling. He told us that the bible details that \"the devil will come to you at your lowest point\" to try and steal your soul or something to that effect. I told him that I knew this was detailed in the bible, but I always thought it was a metaphor or something!”<br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Sat, 06 Aug 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-07-14:/posts/8120718",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}