{
  "title": "Episode 140: &#8220;Trouble Every Day&#8221; by the Mothers of Invention",
  "link": "https://500songs.com/podcast/episode-140-trouble-every-day-by-the-mothers-of-invention/",
  "pubDate": "Sat, 25 Dec 2021 02:08:13 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=992",
  "description": "Episode one hundred and forty of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Trouble Every Day\" by the Mothers of Invention, and the early career of Frank Zappa. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/60311029\">\"Christmas Time is Here Again\" by the Beatles</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nI'm away from home as I upload this and haven't been able to do a Mixcloud, but will hopefully edit a link in in a week or so if I remember.\n\nThe main biography I consulted for this was <a href=\"https://amzn.to/3JcWHR3\"><em>Electric Don Quixote</em> by Neil Slaven.</a>\n\nZappa's autobiography, <a href=\"https://amzn.to/3pqri5H\"><em>The Real Frank Zappa Book</em>,</a> is essential reading if you're a fan of his work.\n\nInformation about Jimmy Carl Black's early life came from Black's autobiography, <a href=\"https://amzn.to/3FvtUog\"><em>For Mother's Sake</em></a>.\n\nZappa's letter to Varese is from <a href=\"http://researchblog.andremount.net/?p=256\">this blog</a>, which also contains a lot of other useful information on Zappa.\n\nFor information on the Watts uprising, I recommend Johnny Otis' <em><a href=\"https://amzn.to/3EEeKfv\">Listen to the Lambs</a>.</em>\n\nAnd the original mix of <em>Freak Out</em> is currently available not on the CD issue of <em>Freak Out</em> itself, which is an eighties remix, but on <a href=\"https://amzn.to/32s8x8R\">this \"documentary\" set</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\nJust a quick note before I begin -- there are a couple of passing references in this episode to rape and child abuse. I don't believe there's anything that should upset anyone, but if you're worried, you might want to read the transcript on the podcast website before or instead of listening.\n\nBut also, this episode contains explicit, detailed, descriptions of racial violence carried out by the police against Black people, including against children. Some of it is so distressing that even reading the transcript might be a bit much for some people.\n\nSometimes, in this podcast, we have to go back to another story we've already told. In most cases, that story is recent enough that I can just say, \"remember last episode, when I said...\", but to tell the story of the Mothers of Invention, I have to start with a story that I told sixty-nine episodes ago, in episode seventy-one, which came out nearly two years ago. In that episode, on \"Willie and the Hand Jive\", I briefly told the story of Little Julian Herrera at the start. I'm going to tell a slightly longer version of the story now. Some of the information at the start of this episode will be familiar from that and other episodes, but I'm not going to expect people to remember something from that long ago, given all that's happened since.\n\nThe DJ Art Laboe is one of the few figures from the dawn of rock and roll who is still working. At ninety-six years old, he still promotes concerts, and hosts a syndicated radio show on which he plays \"Oldies but Goodies\", a phrase which could describe him as well as the music. It's a phrase he coined -- and trademarked -- back in the 1950s, when people in his audience would ask him to play records made a whole three or four years earlier, records they had listened to in their youth.\n\nLaboe pretty much single-handedly invented the rock and roll nostalgia market -- as well as being a DJ, he owned a record label, Original Sound, which put out a series of compilation albums, Oldies But Goodies, starting in 1959, which started to cement the first draft of the doo-wop canon. These were the first albums to compile together a set of older rock and roll hits and market them for nostalgia, and they were very much based on the tastes of his West Coast teenage listenership, featuring songs like \"Earth Angel\" by the Penguins:\n\n[Excerpt: The Penguins, \"Earth Angel\"]\n\nBut also records that had a more limited geographic appeal, like \"Heaven and Paradise\" by Don Julian and the Meadowlarks:\n[Excerpt: Don Julian and the Meadowlarks, \"Heaven and Paradise\"]\n\nAs well as being a DJ and record company owner, Laboe was the promoter and MC for regular teenage dances at El Monte Legion Stadium, at which Kip and the Flips, the band that featured Sandy Nelson and Bruce Johnston, would back local performers like the Penguins, Don and Dewey, or Ritchie Valens, as well as visiting headliners like Jerry Lee Lewis.\n\nEl Monte stadium was originally chosen because it was outside the LA city limits -- at the time there were anti-rock-and-roll ordinances that meant that any teenage dance had to be approved by the LA Board of Education, but those didn't apply to that stadium -- but it also led to Laboe's audience becoming more racially diverse. The stadium was in East LA, which had a large Mexican-American population, and while Laboe's listenership had initially been very white, soon there were substantial numbers of Mexican-American and Black audience members.\n\nAnd it was at one of the El Monte shows that Johnny Otis discovered the person who everyone thought was going to become the first Chicano rock star, before even Ritchie Valens, in 1957, performing as one of the filler acts on Laboe's bill. He signed Little Julian Herrera, a performer who was considered a sensation in East LA at the time, though nobody really knew where he lived, or knew much about him other than that he was handsome, Chicano, and would often have a pint of whisky in his back pocket, even though he was under the legal drinking age.\n\nOtis signed Herrera to his label, Dig Records, and produced several records for him, including the record by which he's now best remembered, \"Those Lonely Lonely Nights\":\n\n[Excerpt: Little Julian Herrera, \"Those Lonely, Lonely, Nights\"]\n\nAfter those didn't take off the way they were expected to, Herrera and his vocal group the Tigers moved to another label, one owned by Laboe, where they recorded \"I Remember Linda\":\n\n[Excerpt: Little Julian Herrera and the Tigers, \"I Remember Linda\"]\n\n And then one day Johnny Otis got a knock on his door from the police. They were looking for Ron Gregory. Otis had never heard of Ron Gregory, and told them so. The police then showed him a picture. It turned out that Julian Herrera wasn't Mexican-American, and wasn't from East LA, but was from Massachusetts. He had run away from home a few years back, hitch-hiked across the country, and been taken in by a Mexican-American family, whose name he had adopted. And now he was wanted for rape.\nHerrera went to prison, and when he got out, he tried to make a comeback, but ended up sleeping rough in the basement of the stadium where he had once been discovered.\n\nHe had to skip town because of some other legal problems, and headed to Tijuana, where he was last seen playing R&B gigs in 1963. Nobody knows what happened to him after that -- some say he was murdered, others that he's still alive, working in a petrol station under yet another name, but nobody has had a confirmed sighting of him since then.\n\nWhen he went to prison, the Tigers tried to continue for a while, but without their lead singer, they soon broke up. Ray Collins, who we heard singing the falsetto part in \"I Remember Linda\", went on to join many other doo-wop and R&B groups over the next few years, with little success.\n\nThen in summer 1963, he walked into a bar in Ponoma, and saw a bar band who were playing the old Hank Ballard and the Midnighters song \"Work With Me Annie\".\n\nAs Collins later put it, “I figured that any band that played ‘Work With Me Annie’ was all right,” and he asked if he could join them for a few songs. They agreed, and afterwards, Collins struck up a conversation with the guitarist, and told him about an idea he'd had for a song based on one of Steve Allen's catchphrases. The guitarist happened to be spending a lot of his time recording at an independent recording studio, and suggested that the two of them record the song together:\n\n[Excerpt: Baby Ray and the Ferns, \"How's Your Bird?\"]\n\nThe guitarist in question was named Frank Zappa. Zappa was originally from Maryland, but had moved to California as a child with his conservative Italian-American family when his father, a defence contractor, had got a job in Monterey. The family had moved around California with his father's work, mostly living in various small towns in the Mojave desert seventy miles or so north of Los Angeles.\n\nYoung Frank had an interest in science, especially chemistry, and especially things that exploded, but while he managed to figure out the ingredients for gunpowder, his family couldn't afford to buy him a chemistry set in his formative years -- they were so poor that his father regularly took part in medical experiments to get a bit of extra money to feed his kids -- and so the young man's interest was diverted away from science towards music.\n\nHis first musical interest, and one that would show up in his music throughout his life, was the comedy music of Spike Jones, whose band combined virtuosic instrumental performances with sound effects:\n\n[Excerpt: Spike Jones and his City Slickers, \"Cocktails for Two\"]\n\nand parodies of popular classical music\n\n[Excerpt: Spike Jones and his City Slickers, \"William Tell Overture\"]\n\nJones was a huge inspiration for almost every eccentric or bohemian of the 1940s and 50s -- Spike Milligan, for example, took the name Spike in tribute to him. And young Zappa wrote his first ever fan letter to Jones when he was five or six.\n\nAs a child Zappa was also fascinated by the visual aesthetics of music -- he liked to draw musical notes on staves and see what they looked like. But his musical interests developed in two other ways once he entered his teens. The first was fairly typical for the musicians of his generation from LA we've looked at and will continue to look at, which is that he heard \"Gee\" by the Crows on the radio:\n\n[Excerpt: The Crows, \"Gee\"]\n\nHe became an R&B obsessive at that moment, and would spend every moment he could listening to the Black radio stations, despite his parents' disapproval. He particularly enjoyed Huggy Boy's radio show broadcast from Dolphins of Hollywood, and also would religiously listen to Johnny Otis, and soon became a connoisseur of the kind of R&B and blues that Otis championed as a musician and DJ:\n\n[Excerpt: Zappa on the Late Show, “I hadn't been raised in an environment where there was a lot of music in the house. This couple that owned the chilli place, Opal and Chester, agreed to ask the man who serviced the jukebox to put in some of the song titles that I liked, because I promised that I would dutifully keep pumping quarters into this thing so that I could listen to them, and so I had the ability to eat good chilli and listen to 'Three Hours Past Midnight' by Johnny 'Guitar' Watson for most of my junior and senior year\"]\n\nJohnny “Guitar” Watson, along with Guitar Slim, would become a formative influence on Zappa's guitar playing, and his playing on \"Three Hours Past Midnight\" is so similar to Zappa's later style that you could easily believe it *was* him:\n\n[Excerpt: Johnny \"Guitar\" Watson, \"Three Hours Past Midnight\"]\n\nBut Zappa wasn't only listening to R&B. The way Zappa would always tell the story, he discovered the music that would set him apart from his contemporaries originally by reading an article in Look magazine. Now, because Zappa has obsessive fans who check every detail, people have done the research and found that there was no such article in that magazine, but he was telling the story close enough to the time period in which it happened that its broad strokes, at least, must be correct even if the details are wrong.\n\nWhat Zappa said was that the article was on Sam Goody, the record salesman, and talked about how Goody was so good at his job that he had even been able to sell a record of Ionisation by Edgard Varese, which just consisted of the worst and most horrible noises anyone had ever heard, just loud drumming noises and screeching sounds.\n\nHe determined then that he needed to hear that album, but he had no idea how he would get hold of a copy. I'll now read an excerpt from Zappa's autobiography, because Zappa's phrasing makes the story much better:\n\n\"Some time later, I was staying overnight with Dave Franken, a friend who lived in La Mesa, and we wound up going to the hi-fi place -- they were having a sale on R&B singles.\n\nAfter shuffling through the rack and finding a couple of Joe Huston records, I made my way toward the cash register and happened to glance at the LP bin. I noticed a strange-looking black-and-white album cover with a guy on it who had frizzy gray hair and looked like a mad scientist. I thought it was great that a mad scientist had finally made a record, so I picked it up -- and there it was, the record with \"Ionisation\" on it.\n\nThe author of the Look article had gotten it slightly wrong -- the correct title was The Complete Works of Edgard Varèse, Volume I, including \"Ionisation,\" among other pieces, on an obscure label called EMS (Elaine Music Store). The record number was 401.I returned the Joe Huston records and checked my pockets to see how much money I had -- I think it came to about $3.75. I'd never bought an album before, but I knew they must be expensive because mostly old people bought them. I asked the man at the cash register how much EMS 401 cost.\n\n\"That gray one in the box?\" he said. \"$5.95.\"\n\nI'd been searching for that record for over a year and I wasn't about to give up. I told him I had $3.75. He thought about it for a minute, and said, \"We've been using that record to demonstrate hi-fi's with -- but nobody ever buys one when we use it. I guess if you want it that bad you can have it for $3.75.\"\"\n\nZappa took the record home, and put it on on his mother's record player in the living room, the only one that could play LPs:\n\n[Excerpt: Edgard Varese, \"Ionisation\"]\n\nHis mother told him he could never play that record in the living room again, so he took the record player into his bedroom, and it became his record player from that point on.\n\nVarese was a French composer who had, in his early career, been very influenced by Debussy. Debussy is now, of course, part of the classical canon, but in the early twentieth century he was regarded as radical, almost revolutionary, for his complete rewriting of the rules of conventional classical music tonality into a new conception based on chordal melodies, pedal points, and use of non-diatonic scales.\n\nAlmost all of Varese's early work was destroyed in a fire, so we don't have evidence of the transition from Debussy's romantic-influenced impressionism to Varese's later style, but after he had moved to the US in 1915 he had become wildly more experimental. \"Ionisation\" is often claimed to be the first piece of Western classical music written only for percussion instruments.\n\nVarese was part of a wider movement of modernist composers -- for example he was the best man at Nicolas Slonimsky's wedding -- and had also set up the International Composers' Guild, whose manifesto influenced Zappa, though his libertarian politics led him to adapt it to a more individualistic rather than collective framing. The original manifesto read in part \"Dying is the privilege of the weary. The present day composers refuse to die. They have realized the necessity of banding together and fighting for the right of each individual to secure a fair and free presentation of his work\"\n\nIn the twenties and thirties, Varese had written a large number of highly experimental pieces, including Ecuatorial, which was written for bass vocal, percussion, woodwind, and two Theremin cellos. These are not the same as the more familiar Theremin, created by the same inventor, and were, as their name suggests, Theremins that were played like a cello, with a fingerboard and bow. Only ten of these were ever made, specifically for performances of Varese's work, and he later rewrote the work to use ondes martenot instead of Theremin cellos, which is how the work is normally heard now:\n\n[Excerpt: Edgard Varese, \"Ecuatorial\"]\n\nBut Varese had spent much of the thirties, forties, and early fifties working on two pieces that were never finished, based on science fiction ideas -- L'Astronome, which was meant to be about communication with people from the star Sirius, and Espace, which was originally intended to be performed simultaneously by choirs in Beijing, Moscow, Paris, and New York.\n\nNeither of these ideas came to fruition, and so Varese had not released any new work, other than one small piece, Étude pour espace, an excerpt from the  larger work, in Zappa's lifetime.\n\nZappa followed up his interest in Varese's music with his music teacher, one of the few people in the young man's life who encouraged him in his unusual interests. That teacher, Mr Kavelman, introduced Zappa to the work of other composers, like Webern, but would also let him know why he liked particular R&B records. For example, Zappa played Mr. Kavelman \"Angel in My Life\" by the Jewels, and asked what it was that made him particularly like it:\n\n[Excerpt: The Jewels, \"Angel in My Life\"]\n\nThe teacher's answer was that it was the parallel fourths that made the record particularly appealing.\nYoung Frank was such a big fan of Varese that for his fifteenth birthday, he actually asked if he could make a long-distance phone call to speak to Varese. He didn't know where Varese lived, but figured that it must be in Greenwich Village because that was where composers lived, and he turned out to be right. He didn't get through on his birthday -- he got Varese's wife, who told him the composer was in Europe -- but he did eventually get to speak to him, and was incredibly excited when Varese told him that not only had he just written a new piece for the first time in years, but that it was called Deserts, and was about deserts -- just like the Mojave Desert where Zappa lived:\n\n[Excerpt: Edgard Varese, \"Deserts\"]\n\nAs he later wrote, “When you’re 15 and living in the Mojave Desert, and you find out that the World’s Greatest Composer (who also looks like a mad scientist) is working in a secret Greenwich Village laboratory on a song about your hometown (so to speak), you can get pretty excited.”\n\nA year later, Zappa actually wrote to Varese, a long letter which included him telling the story about how he'd found his work in the first place, hoping to meet up with him when Zappa travelled to the East Coast to see family. I'll read out a few extracts, but the whole thing is fascinating for what it says about Zappa the precocious adolescent, and I'll link to a blog post with it in the show notes.\n\n\"Dear Sir:\nPerhaps you might remember me from my stupid phone call last January, if not, my name again is Frank Zappa Jr. I am 16 years old… that might explain partly my disturbing you last winter.\n\nAfter I had struggled through Mr. Finklestein’s notes on the back cover (I really did struggle too, for at the time I had had no training in music other than practice at drum rudiments) I became more and more interested in you and your music. I began to go to the library and take out books on modern composers and modern music, to learn all I could about Edgard Varese. It got to be my best subject (your life) and I began writing my reports and term papers on you at school. At one time when my history teacher asked us to write on an American that has really done something for the U.S.A. I wrote on you and the Pan American Composers League and the New Symphony. I failed. The teacher had never heard of you and said I made the whole thing up. Silly but true. That was my Sophomore year in high school.\nThroughout my life all the talents and abilities that God has left me with have been self developed, and when the time came for Frank to learn how to read and write music, Frank taught himself that too. I picked it all up from the library.\n\nI have been composing for two years now, utilizing a strict twelve-tone technique, producing effects that are reminiscent of Anton Webern.\n\nDuring those two years I have written two short woodwind quartets and a short symphony for winds, brass and percussion.\n\nI plan to go on and be a composer after college and I could really use the counsel of a veteran such as you. If you would allow me to visit with you for even a few hours it would be greatly appreciated.\nIt may sound strange but I think I have something to offer you in the way of new ideas. One is an elaboration on the principle of Ruth Seeger’s contrapuntal dynamics and the other is an extension of the twelve-tone technique which I call the inversion square. It enables one to compose harmonically constructed pantonal music in logical patterns and progressions while still abandoning tonality.\n\nVarese sent a brief reply, saying that he was going to be away for a few months, but would like to meet Zappa on his return. The two never met, but Zappa kept the letter from Varese framed on his wall for the rest of his life.\n\nZappa soon bought a couple more albums, a version of \"The Rite of Spring\" by Stravinsky:\n\n[Excerpt: Igor Stravinsky, \"The Rite of Spring\"]\n\nAnd a record of pieces by Webern, including his Symphony opus 21:\n\n[Excerpt: Anton Webern, \"Symphony op. 21\"]\n\n(Incidentally, with the classical music here, I'm not seeking out the precise performances Zappa was listening to, just using whichever recordings I happen to have copies of).\n\nZappa was also reading Slonimsky's works of musicology, like the Thesaurus of Scales and Melodic Patterns.\n\nAs well as this \"serious music\" though, Zappa was also developing as an R&B musician.  He later said of the Webern album, \"I loved that record, but it was about as different from Stravinsky and Varèse as you could get. I didn't know anything about twelve-tone music then, but I liked the way it sounded. Since I didn't have any kind of formal training, it didn't make any difference to me if I was listening to Lightnin' Slim, or a vocal group called the Jewels (who had a song out then called \"Angel in My Life\"), or Webern, or Varèse, or Stravinsky. To me it was all good music.\"\n\nHe had started as a drummer with a group called the Blackouts, an integrated group with white, Latino, and Black members, who played R&B tracks like \"Directly From My Heart to You\", the song Johnny Otis had produced for Little Richard:\n\n[Excerpt: Little Richard, \"Directly From My Heart to You\"]\n\nBut after eighteen months or so, he quit the group and stopped playing drums. Instead, he switched to guitar, with a style influenced by Johnny \"Guitar\" Watson and Guitar Slim. His first guitar had action so bad that he didn't learn to play chords, and moved straight on to playing lead lines with his younger brother Bobby playing rhythm. He also started hanging around with two other teenage bohemians -- Euclid Sherwood, who was nicknamed Motorhead, and Don Vliet, who called himself Don Van Vliet.\n\nVliet was a truly strange character, even more so than Zappa, but they shared a love for the blues, and Vliet was becoming a fairly good blues singer, though he hadn't yet perfected the Howlin' Wolf imitation that would become his stock-in-trade in later years. But the surviving recording of Vliet singing with the Zappa brothers on guitar, singing a silly parody blues about being flushed down the toilet of the kind that many teenage boys would write, shows the promise that the two men had:\n\n[Excerpt: Frank Zappa and Captain Beefheart, \"Lost in a Whirlpool\"]\n\nZappa was also getting the chance to hear his more serious music performed. He'd had the high school band play a couple of his pieces, but he also got the chance to write film music -- his English teacher, Don Cerveris, had decided to go off and seek his fortune as a film scriptwriter, and got Zappa hired to write the music for a cheap Western he'd written, Run Home Slow. The film was beset with problems -- it started filming in 1959 but didn't get finished and released until 1965 -- but the music Zappa wrote for it did eventually get recorded and used on the soundtrack:\n\n[Excerpt: Frank Zappa, \"Run Home Slow Theme\"]\n\nIn 1962, he got to write the music for another film, The World's Greatest Sinner, and he also wrote a theme song for that, which got released as the B-side of \"How's Your Bird?\", the record he made with Ray Collins:\n\n[Excerpt: Baby Ray and the Ferns, \"The World's Greatest Sinner\"]\n\nZappa was able to make these records because by the early sixties, as well as playing guitar in bar bands, he was working as an assistant for a man named Paul Buff. Paul Buff had worked as an engineer for a guided missile manufacturer, but had decided that he didn't want to do that any more, and instead had opened up the first independent multi-track recording studio on the West Coast, PAL Studios, using equipment he'd designed and built himself, including a five-track tape recorder. Buff engineered a huge number of surf instrumentals there, including \"Wipe Out\" by the Surfaris:\n\n[Excerpt: The Surfaris, \"Wipe Out\"]\n\nZappa had first got to know Buff when he had come to Buff's studio with some session musicians in 1961, to record some jazz pieces he'd written, including this piece which at the time was in the style of Dave Brubeck but would later become a staple of Zappa's repertoire reorchestrated in a  rock style.\n\n[Excerpt: The PAL Studio Band, \"Never on Sunday\"]\n\nBuff really just wanted to make records entirely by himself, so he'd taught himself to play the rudiments of guitar, bass, drums, piano, and alto saxophone, so he could create records alone. He would listen to every big hit record, figure out what the hooks were on the record, and write his own knock-off of those. An example is \"Tijuana Surf\" by the Hollywood Persuaders, which is actually Buff on all instruments, and which according to Zappa went to number one in Mexico (though I've not found an independent source to confirm that chart placing, so perhaps take it with a pinch of salt):\n\n[Excerpt: The Hollywood Persuaders, \"Tijuana Surf\"]\n\nThe B-side to that, \"Grunion Run\", was written by Zappa, who also plays guitar on that side:\n\n[Excerpt: The Hollywood Persuaders, \"Grunion Run\"]\n\nZappa, Buff, Ray Collins, and a couple of associates would record all sorts of material at PAL -- comedy material like \"Hey Nelda\", under the name \"Ned and Nelda\" -- a parody of \"Hey Paula\" by Paul and Paula:\n\n[Excerpt: Ned and Nelda, \"Hey Nelda\"]\n\nDoo-wop parodies like \"Masked Grandma\":\n\n[Excerpt: The PAL Studio Band, \"Masked Grandma\"]\n\nR&B:\n\n[Excerpt: The PAL Studio Band, \"Why Don't You Do Me Right?\"]\n\nand more. Then Buff or Zappa would visit one of the local independent label owners and try to sell them the master -- Art Laboe at Original Sound released several of the singles, as did Bob Keane at Donna Records and Del-Fi.\n\nThe \"How's Your Bird\" single also got Zappa his first national media exposure, as he went on the Steve Allen show, where he demonstrated to Allen how to make music using a bicycle and a prerecorded electronic tape, in an appearance that Zappa would parody five years later on the Monkees' TV show:\n\n[Excerpt: Steve Allen and Frank Zappa, \"Cyclophony\"]\n\nBut possibly the record that made the most impact at the time was \"Memories of El Monte\", a song that Zappa and Collins wrote together about Art Laboe's dances at El Monte Stadium, incorporating excerpts of several of the songs that would be played there, and named after a compilation Laboe had put out, which had included “I Remember Linda” by Little Julian and the Tigers. They got Cleve Duncan of the Penguins to sing lead, and the record came out as by the Penguins, on Original Sound:\n\n[Excerpt: The Penguins, \"Memories of El Monte\"]\n\nBy this point, though, Pal studios was losing money, and Buff took up the offer of a job working for Laboe full time, as an engineer at Original Sound. He would later become best known for inventing the kepex, an early noise gate which engineer Alan Parsons used on a bass drum to create the \"heartbeat\" that opens Pink Floyd's Dark Side of the Moon:\n\n[Excerpt: Pink Floyd, \"Speak to Me\"]\n\nThat invention would possibly be Buff's most lasting contribution to music, as by the early eighties, the drum sound on every single pop record was recorded using a noise gate.\n\nBuff sold the studio to Zappa, who renamed it Studio Z and moved in -- he was going through a divorce and had nowhere else to live. The studio had no shower, and Zappa had to just use a sink to wash, and he was surviving mostly off food scrounged by his resourceful friend Motorhead Sherwood.\n\nBy this point, Zappa had also joined a band called the Soots, consisting of Don Van Vliet, Alex St. Clair and Vic Mortenson, and they recorded several tracks at Studio Z, which they tried to get released on Dot Records, including a cover version of Little Richard's “Slippin' and Slidin'”, and a song called “Tiger Roach” whose lyrics were mostly random phrases culled from a Green Lantern comic:\n\n[Excerpt: The Soots, \"Tiger Roach\"]\n\nZappa also started writing what was intended as the first ever rock opera, \"I Was a Teenage Maltshop\", and attempts were made to record parts of it with Vliet, Mortenson, and Motorhead Sherwood:\n\n[Excerpt: Frank Zappa, \"I Was a Teenage Maltshop\"]\n\nZappa was also planning to turn Studio Z into a film studio. He obtained some used film equipment, and started planning a science fiction film to feature Vliet, titled \"Captain Beefheart Meets the Grunt People\". The title was inspired by an uncle of Vliet's, who lived with Vliet and his girlfriend, and used to urinate with the door open so he could expose himself to Vliet's girlfriend, saying as he did so \"Look at that! Looks just like a big beef heart!\"\n\nUnfortunately, the film would not get very far. Zappa was approached by a used-car salesman who said that he and his friends were having a stag party. As Zappa owned a film studio, could he make them a pornographic film to show at the party? Zappa told him that a film wouldn't be possible, but as he needed the money, would an audio tape be acceptable? The used-car salesman said that it would, and gave him a list of sex acts he and his friends would like to hear. Zappa and a friend, Lorraine Belcher, went into the studio and made a few grunting noises and sound effects.\n\nThe used-car salesman turned out actually to be an undercover policeman, who was better known in the area for his entrapment of gay men, but had decided to branch out. Zappa and Belcher were arrested -- Zappa's father bailed him out, and Zappa got an advance from Art Laboe to pay Belcher's bail. Luckily \"Grunion Run\" and \"Memories of El Monte\" were doing well enough that Laboe could give Zappa a $1500 advance.\n\nWhen the case finally came to trial, the judge laughed at the tape and wanted to throw the whole case out, but the prosecutor insisted on fighting, and Zappa got ten days in prison, and most of his tapes were impounded, never to be returned. He fell behind with his rent, and Studio Z was demolished.\n\nAnd then Ray Collins called him, asking if he wanted to join a bar band:\n\n[Excerpt: The Mothers, \"Hitch-Hike\"]\n\nThe Soul Giants were formed by a bass player named Roy Estrada. Now, Estrada is unfortunately someone who will come up in the story a fair bit over the next year or so, as he played on several of the most important records to come out of LA in the sixties and early seventies. He is also someone about whom there's fairly little biographical information -- he's not been interviewed much, compared to pretty much everyone else, and it's easy to understand why when you realise that he's currently half-way through a twenty-five year sentence for child molestation -- his third such conviction. He won't get out of prison until he's ninety-three. He's one of the most despicable people who will turn up in this podcast, and frankly I'm quite glad I don't know more about him as a person.\n\nHe was, though, a good bass player and falsetto singer, and he had released a single on King Records, an instrumental titled \"Jungle Dreams\":\n\n[Excerpt, Roy Estrada and the Rocketeers, \"Jungle Dreams\"]\n\nThe other member of the rhythm section, Jimmy Carl Black, was an American Indian (that's the term he always used about himself until his death, and so that's the term I'll use about him too) from Texas. Black had grown up in El Paso as a fan of Western Swing music, especially Bob Wills, but had become an R&B fan after discovering Wolfman Jack's radio show and hearing the music of Howlin' Wolf and Sonny Boy Williamson.\n\nLike every young man from El Paso, he would travel to Juarez as a teenager to get drunk, see sex shows, and raise hell. It was also there that he saw his first live blues music, watching Long John Hunter, the same man who inspired the Bobby Fuller Four, and he would always claim Hunter as the man whose shows taught him how to play the blues.\n\nBlack had decided he wanted to become a musician when he'd seen Elvis perform live. In Black's memory, this was a gig where Elvis was an unknown support act for Faron Young and Wanda Jackson, but he was almost certainly slightly misremembering -- it's most likely that what he saw was Elvis' show in El Paso on the eleventh of April 1956, where Young and Jackson were also on the bill, but supporting Elvis who was headlining.\n\nEither way, Black had decided that he wanted to make girls react to him the same way they reacted to Elvis, and he started playing in various country and R&B bands. His first record was with a group called the Keys, and unfortunately I haven't been able to track down a copy (it was reissued on a CD in the nineties, but the CD itself is now out of print and sells for sixty pounds) but he did rerecord the song with a later group he led, the Mannish Boys:\n\n[Excerpt: Jimmy Carl Black and the Mannish Boys, \"Stretch Pants\"]\n\nHe spent a couple of years in the Air Force, but continued playing music during that time, including in a band called The Exceptions which featured Peter Cetera later of the band Chicago, on bass. After a brief time working as lineman in Wichita, he moved his family to California, where he got a job teaching drums at a music shop in Anaheim, where the bass teacher was Jim Fielder, who would later play bass in Blood, Sweat, and Tears. One of Fielder's friends, Tim Buckley, used to hang around in the shop as well, and Black was at first irritated by him coming in and playing the guitars and not buying anything, but eventually became impressed by his music. Black would later introduce Buckley to Herb Cohen, who would become Buckley's manager, starting his professional career.\n\nWhen Roy Estrada came into the shop, he and Black struck up a friendship, and Estrada asked Black to join his band The Soul Giants, whose lineup became Estrada, Black, a sax player named Davey Coronado, a guitarist called Larry and a singer called Dave. The group got a residency at the Broadside club in Ponoma, playing \"Woolly Bully\" and \"Louie Louie\" and other garage-band staples.\n\nBut then Larry and Dave got drafted, and the group got in two men called Ray -- Ray Collins on vocals, and Ray Hunt on guitar. This worked for a little while, but Ray Hunt was, by all accounts, not a great guitar player -- he would play wrong chords, and also he was fundamentally a surf player while the Soul Giants were an R&B group. Eventually, Collins and Hunt got into a fistfight, and Collins suggested that they get in his friend Frank instead.\n\nFor a while, the Soul Giants continued playing \"Midnight Hour\" and \"Louie Louie\", but then Zappa suggested that they start playing some of his original material as well. Davy Coronado refused to play original material, because he thought, correctly, that it would lose the band gigs, but the rest of the band sided with the man who had quickly become their new leader. Coronado moved back to Texas, and on Mother's Day 1965 the Soul Giants changed their name to the Mothers. They got in Henry Vestine on second guitar, and started playing Zappa's originals, as well as changing the lyrics to some of the hits they were playing:\n\n[Excerpt: The Mothers, \"Plastic People\"]\n\nZappa had started associating with the freak crowd in Hollywood centred around Vito and Franzoni, after being introduced by Don Cerveris, his old teacher turned screenwriter, to an artist called Mark Cheka, who Zappa invited to manage the group. Cheka in turn brought in his friend Herb Cohen, who managed several folk acts including the Modern Folk Quartet and Judy Henske, and who like Zappa had once been arrested on obscenity charges, in Cohen's case for promoting gigs by the comedian Lenny Bruce.\n\nCohen first saw the Mothers when they were recording their appearance in an exploitation film called Mondo Hollywood. They were playing in a party scene, using equipment borrowed from Jim Guercio, a session musician who would briefly join the Mothers, but who is now best known for having been Chicago's manager and producing hit records for them and Blood, Sweat, and Tears. In the crowd were Vito and Franzoni, Bryan Maclean, Ram Dass, the Harvard psychologist who had collaborated with Timothy Leary in controversial LSD experiments that had led to both losing their jobs, and other stalwarts of the Sunset Strip scene.\n\nCohen got the group bookings at the Whisky A-Go-Go and The Trip, two of the premier LA nightclubs, and Zappa would also sit in with other bands playing at those venues, like the Grass Roots, a band featuring\n\nBryan Maclean and Arthur Lee which would soon change its name to Love.\n\nAt this time Zappa and Henry Vestine lived together, next door to a singer named Victoria Winston, who at the time was in a duo called Summer's Children with Curt Boettcher:\n\n[Excerpt: Summer's Children, \"Milk and Honey\"]\n\nWinston, like Zappa, was a fan of Edgard Varese, and actually asked Zappa to write songs for Summer's Children, but one of the partners involved in their production company disliked Zappa's material and the collaboration went no further.\n\nZappa at this point was trying to incorporate more ideas from modal jazz into his music. He was particularly impressed by Eric Dolphy's 1964 album \"Out to Lunch\":\n\n[Excerpt: Eric Dolphy, \"Hat and Beard\"]\n\nBut he was also writing more about social issues, and in particular he had written a song called \"The Watts Riots Song\", which would later be renamed \"Trouble Every Day\":\n\n[Excerpt: The Mothers of Invention, \"Trouble Every Day\"]\n\nNow, the Watts Uprising was one of the most important events in Black American history, and it feels quite wrong that I'm covering it in an episode about a band made up of white, Latino, and American Indian people rather than a record made by Black people, but I couldn't find any way to fit it in anywhere else.\n\nAs you will remember me saying in the episode on \"I Fought the Law\", the LA police under Chief William Parker were essentially a criminal gang by any other name -- they were incompetent, violent, and institutionally racist, and terrorised Black people. The Black people of LA were also feeling particularly aggrieved in the summer of 1965, as a law banning segregation in housing had been overturned by a ballot proposition in November 1964, sponsored by the real estate industry and passed by an overwhelming majority of white voters in what Martin Luther King called \"one of the most shameful developments in our nation’s history\", and which Edmund Brown, the Democratic governor said was like \"another hate binge which began more than 30 years ago in a Munich beer hall\".\n\nThen on Wednesday, August 11, 1965, the police pulled over a Black man, Marquette Frye, for drunk driving. He had been driving his mother's car, and she lived nearby, and she came out to shout at him about drinking and driving. The mother, Rena Price, was hit by one of the policemen; Frye then physically attacked one of the police for hitting his mother, one of the police pulled out a gun, a crowd gathered, the police became violent against the crowd, a rumour spread that they had kicked a pregnant woman, and the resulting protests were exacerbated by the police carrying out what Chief Parker described as a \"paramiltary\" response. The National Guard were called in, huge swathes of south central LA were cordoned off by the police with signs saying things like \"turn left or get shot\".\n\nBlack residents started setting fire to and looting local white-owned businesses that had been exploiting Black workers and customers, though this looting was very much confined to individuals who were known to have made the situation worse. Eventually it took six days for the uprising to be put down, at a cost of thirty-four deaths, 1032 injuries, and 3438 arrests. Of the deaths, twenty-three were Black civilians murdered by the police, and zero were police murdered by Black civilians (two police were killed by other police, in accidental shootings).\n\nThe civil rights activist Bayard Rustin said of the uprising, \"The whole point of the outbreak in Watts was that it marked the first major rebellion of Negroes against their own masochism and was carried on with the express purpose of asserting that they would no longer quietly submit to the deprivation of slum life.\"\n\nFrank Zappa's musical hero Johnny Otis would later publish the book Listen to the Lambs about the Watts rebellion, and in it he devotes more than thirty pages to eyewitness accounts from Black people. It's an absolutely invaluable resource.\n\nOne of the people Otis interviews is Lily Ford, who is described by my copy of the book as being the \"lead singer of the famous Roulettes\". This is presumably an error made by the publishers, rather than Otis, because Ford was actually a singer with the Raelettes, as in Ray Charles' vocal group. She also recorded with Otis under the name \"Lily of the Valley\":\n\n[Excerpt: Lily of the Valley, \"I Had a Sweet Dream\"]\n\nNow, Ford's account deserves a large excerpt, but be warned, this is very, very difficult to hear. I gave a content warning at the beginning, but I'm going to give another one here.\n\n\"A lot of our people were in the street, seeing if they could get free food and clothes and furniture, and some of them taking liquor too. But the white man was out for blood.\n\nThen three boys came down the street, laughing and talking. They were teenagers, about fifteen or sixteen years old. As they got right at the store they seemed to debate whether they would go inside. One boy started a couple of times to go. Finally he did. Now a cop car finally stops to investigate. Police got out of the car. Meanwhile, the other two boys had seen them coming and they ran. My brother-in-law and I were screaming and yelling for the boy to get out.\n\nHe didn't hear us, or was too scared to move. He never had a chance. This young cop walked up to the broken window and looked in as the other one went round the back and fired some shots and I just knew he'd killed the other two boys, but I guess he missed. He came around front again. By now other police cars had come.\n\nThe cop at the window aimed his gun. He stopped and looked back at a policeman sitting in a car. He aimed again. No shot. I tried to scream, but I was so horrified that nothing would come out of my throat. The third time he aimed he yelled, \"Halt\", and fired before the word was out of his mouth. Then he turned around and made a bull's-eye sign with his fingers to his partner. Just as though he had shot a tin can off a fence, not a human being.\n\nThe cops stood around for ten or fifteen minutes without going inside to see if the kid was alive or dead. When the ambulance came, then they went in. They dragged him out like he was a sack of potatoes. Cops were everywhere now.\n\nSo many cops for just one murder.\"\n\n[Excerpt: The Mothers of Invention, \"Trouble Every Day\"]\n\nThere's a lot more of this sort of account in Otis' book, and it's all worth reading -- indeed, I would argue that it is *necessary* reading. And Otis keeps making a point which I quoted back in the episode on \"Willie and the Hand Jive\" but which I will quote again here -- “A newborn Negro baby has less chance of survival than a white. A Negro baby will have its life ended seven years sooner. This is not some biological phenomenon linked to skin colour, like sickle-cell anaemia; this is a national crime, linked to a white-supremacist way of life and compounded by indifference”.\n\n(Just a reminder, the word “Negro” which Otis uses there was, in the mid-sixties, the term of choice used by Black people.)\n\nAnd it's this which inspired \"The Watts Riot Song\", which the Mothers were playing when Tom Wilson was brought into The Trip by Herb Cohen:\n\n[Excerpt: The Mothers of Invention, \"Trouble Every Day\"]\n\nWilson had just moved from Columbia, where he'd been producing Dylan and Simon and Garfunkel, to Verve, a subsidiary of MGM which was known for jazz records but was moving into rock and roll. Wilson was looking for a white blues band, and thought he'd found one. He signed the group without hearing any other songs.\n\nHenry Vestine quit the group between the signing and the first recording, to go and join an *actual* white blues band, Canned Heat, and over the next year the group's lineup would fluctuate quite a bit around the core of Zappa, Collins, Estrada, and Black, with members like Steve Mann, Jim Guercio, Jim Fielder, and Van Dyke Parks coming and going, often without any recordings being made of their performances. The lineup on what became the group's first album, Freak Out! was Zappa, Collins, Estrada, Black, and Elliot Ingber, the former guitarist with the Gamblers, who had joined the group shortly before the session and would leave within a few months.\n\nThe first track the group recorded, \"Any Way the Wind Blows\", was straightforward enough:\n\n[Excerpt: The Mothers of Invention, \"Any Way the Wind Blows\"]\n\nThe second song, a \"Satisfaction\" knock-off called \"Hungry Freaks Daddy\", was also fine. But it was when the group performed their third song of the session, \"Who Are The Brain Police?\", that Tom Wilson realised that he didn't have a standard band on his hands:\n\n[Excerpt: The Mothers of Invention, \"Who Are the Brain Police?\"]\n\nLuckily for everyone concerned, Tom Wilson was probably the single best producer in America to have discovered the Mothers. While he was at the time primarily known for his folk-rock productions, he had built his early career on Cecil Taylor and Sun Ra records, some of the freakiest jazz of the fifties and early sixties. He knew what needed to be done -- he needed a bigger budget.\n\nFar from being annoyed that he didn't have the white blues band he wanted, Wilson actively encouraged the group to go much, much further. He brought in Wrecking Crew members to augment the band (though one of them. Mac Rebennack, found the music so irritating he pretended he needed to go to the toilet, walked out, and never came back). He got orchestral musicians to play Zappa's scores, and allowed the group to rent hundreds of dollars of percussion instruments for the side-long track \"Return of the Son of Monster Magnet\", which features many Hollywood scenesters of the time, including Van Dyke Parks, Kim Fowley, future Manson family member Bobby Beausoleil, record executive David Anderle, songwriter P.F. Sloan, and cartoonist Terry Gilliam, all recording percussion parts and vocal noises:\n\n[Excerpt: The Mothers of Invention, \"Return of the Son of Monster Magnet\"]\n\nSuch was Wilson's belief in the group that Freak Out! became only the second rock double album ever released -- exactly a week after the first, Blonde on Blonde, by Wilson's former associate Bob Dylan.\n\nThe inner sleeve included a huge list of people who had influenced the record in one way or another, including people Zappa knew like Don Cerveris, Don Vliet, Paul Buff, Bob Keane, Nik Venet, and Art Laboe,  musicians who had influenced the group like Don & Dewey, Johnny Otis, Otis' sax players Preston Love and Big Jay McNeely, Eric Dolphy, Edgard Varese, Richard Berry, Johnny Guitar Watson, and Ravi Shankar, eccentric performers like Tiny Tim, DJs like Hunter Hancock and Huggy Boy, science fiction writers like Cordwainer Smith and Robert Sheckley, and scenesters like David Crosby, Vito, and Franzoni. The list of 179 people would provide a sort of guide for many listeners, who would seek out those names and find their ways into the realms of non-mainstream music, writing, and art over the next few decades.\n\nZappa would always remain grateful to Wilson for taking his side in the record's production, saying \"Wilson was sticking his neck out. He laid his job on the line by producing the album. MGM felt that they had spent too much money on the album\".\n\nThe one thing Wilson couldn't do, though, was persuade the label that the group's name could stay as it was. \"The Mothers\" was a euphemism, for a word I can't say if I want this podcast to keep its clean rating, a word that is often replaced in TV clean edits of films with \"melon farmers\", and MGM were convinced that the radio would never play any music by a band with that name -- not realising that that wouldn't be the reason this music wouldn't get played on the radio.\n\nThe group needed to change their name.\n\nAnd so, out of necessity, they became the Mothers of Invention.",
  "itunes:subtitle": "Episode one hundred and forty of A History of Rock Music in Five Hundred Songs looks at “Trouble Every Day by the Mothers of Invention, and the early career of Frank Zappa. Click the full post to read liner notes, links to more information, and a transcr",
  "itunes:keywords": "Art Laboe,Arthur Lee,Bryan Maclean,Canned Heat,Captain Beefheart,Carl Franzoni,Curt Boettcher,Edgard Varese,Elliot Ingber,Frank Zappa,Henry Vestine,James Guercio,Jim Fielder,Johnny Guitar Watson,Johnny Otis,Mothers of Invention,Paul Buff,Peter Cetera,Ram Dass,Roy Estrada,Steve Allen,The Penguins,Tim Buckley,Tom Wilson,Van Dyke Parks,Vito",
  "itunes:episodeType": "full",
  "itunes:episode": 140,
  "content:encoded": "Episode one hundred and forty of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Trouble Every Day\" by the Mothers of Invention, and the early career of Frank Zappa. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/60311029\">\"Christmas Time is Here Again\" by the Beatles</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nI'm away from home as I upload this and haven't been able to do a Mixcloud, but will hopefully edit a link in in a week or so if I remember.\n\nThe main biography I consulted for this was <a href=\"https://amzn.to/3JcWHR3\"><em>Electric Don Quixote</em> by Neil Slaven.</a>\n\nZappa's autobiography, <a href=\"https://amzn.to/3pqri5H\"><em>The Real Frank Zappa Book</em>,</a> is essential reading if you're a fan of his work.\n\nInformation about Jimmy Carl Black's early life came from Black's autobiography, <a href=\"https://amzn.to/3FvtUog\"><em>For Mother's Sake</em></a>.\n\nZappa's letter to Varese is from <a href=\"http://researchblog.andremount.net/?p=256\">this blog</a>, which also contains a lot of other useful information on Zappa.\n\nFor information on the Watts uprising, I recommend Johnny Otis' <em><a href=\"https://amzn.to/3EEeKfv\">Listen to the Lambs</a>.</em>\n\nAnd the original mix of <em>Freak Out</em> is currently available not on the CD issue of <em>Freak Out</em> itself, which is an eighties remix, but on <a href=\"https://amzn.to/32s8x8R\">this \"documentary\" set</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\nJust a quick note before I begin -- there are a couple of passing references in this episode to rape and child abuse. I don't believe there's anything that should upset anyone, but if you're worried, you might want to read the transcript on the podcast website before or instead of listening.\n\nBut also, this episode contains explicit, detailed, descriptions of racial violence carried out by the police against Black people, including against children. Some of it is so distressing that even reading the transcript might be a bit much for some people.\n\nSometimes, in this podcast, we have to go back to another story we've already told. In most cases, that story is recent enough that I can just say, \"remember last episode, when I said...\", but to tell the story of the Mothers of Invention, I have to start with a story that I told sixty-nine episodes ago, in episode seventy-one, which came out nearly two years ago. In that episode, on \"Willie and the Hand Jive\", I briefly told the story of Little Julian Herrera at the start. I'm going to tell a slightly longer version of the story now. Some of the information at the start of this episode will be familiar from that and other episodes, but I'm not going to expect people to remember something from that long ago, given all that's happened since.\n\nThe DJ Art Laboe is one of the few figures from the dawn of rock and roll who is still working. At ninety-six years old, he still promotes concerts, and hosts a syndicated radio show on which he plays \"Oldies but Goodies\", a phrase which could describe him as well as the music. It's a phrase he coined -- and trademarked -- back in the 1950s, when people in his audience would ask him to play records made a whole three or four years earlier, records they had listened to in their youth.\n\nLaboe pretty much single-handedly invented the rock and roll nostalgia market -- as well as being a DJ, he owned a record label, Original Sound, which put out a series of compilation albums, Oldies But Goodies, starting in 1959, which started to cement the first draft of the doo-wop canon. These were the first albums to compile together a set of older rock and roll hits and market them for nostalgia, and they were very much based on the tastes of his West Coast teenage listenership, featuring songs like \"Earth Angel\" by the Penguins:\n\n[Excerpt: The Penguins, \"Earth Angel\"]\n\nBut also records that had a more limited geographic appeal, like \"Heaven and Paradise\" by Don Julian and the Meadowlarks:\n[Excerpt: Don Julian and the Meadowlarks, \"Heaven and Paradise\"]\n\nAs well as being a DJ and record company owner, Laboe was the promoter and MC for regular teenage dances at El Monte Legion Stadium, at which Kip and the Flips, the band that featured Sandy Nelson and Bruce Johnston, would back local performers like the Penguins, Don and Dewey, or Ritchie Valens, as well as visiting headliners like Jerry Lee Lewis.\n\nEl Monte stadium was originally chosen because it was outside the LA city limits -- at the time there were anti-rock-and-roll ordinances that meant that any teenage dance had to be approved by the LA Board of Education, but those didn't apply to that stadium -- but it also led to Laboe's audience becoming more racially diverse. The stadium was in East LA, which had a large Mexican-American population, and while Laboe's listenership had initially been very white, soon there were substantial numbers of Mexican-American and Black audience members.\n\nAnd it was at one of the El Monte shows that Johnny Otis discovered the person who everyone thought was going to become the first Chicano rock star, before even Ritchie Valens, in 1957, performing as one of the filler acts on Laboe's bill. He signed Little Julian Herrera, a performer who was considered a sensation in East LA at the time, though nobody really knew where he lived, or knew much about him other than that he was handsome, Chicano, and would often have a pint of whisky in his back pocket, even though he was under the legal drinking age.\n\nOtis signed Herrera to his label, Dig Records, and produced several records for him, including the record by which he's now best remembered, \"Those Lonely Lonely Nights\":\n\n[Excerpt: Little Julian Herrera, \"Those Lonely, Lonely, Nights\"]\n\nAfter those didn't take off the way they were expected to, Herrera and his vocal group the Tigers moved to another label, one owned by Laboe, where they recorded \"I Remember Linda\":\n\n[Excerpt: Little Julian Herrera and the Tigers, \"I Remember Linda\"]\n\n And then one day Johnny Otis got a knock on his door from the police. They were looking for Ron Gregory. Otis had never heard of Ron Gregory, and told them so. The police then showed him a picture. It turned out that Julian Herrera wasn't Mexican-American, and wasn't from East LA, but was from Massachusetts. He had run away from home a few years back, hitch-hiked across the country, and been taken in by a Mexican-American family, whose name he had adopted. And now he was wanted for rape.\nHerrera went to prison, and when he got out, he tried to make a comeback, but ended up sleeping rough in the basement of the stadium where he had once been discovered.\n\nHe had to skip town because of some other legal problems, and headed to Tijuana, where he was last seen playing R&B gigs in 1963. Nobody knows what happened to him after that -- some say he was murdered, others that he's still alive, working in a petrol station under yet another name, but nobody has had a confirmed sighting of him since then.\n\nWhen he went to prison, the Tigers tried to continue for a while, but without their lead singer, they soon broke up. Ray Collins, who we heard singing the falsetto part in \"I Remember Linda\", went on to join many other doo-wop and R&B groups over the next few years, with little success.\n\nThen in summer 1963, he walked into a bar in Ponoma, and saw a bar band who were playing the old Hank Ballard and the Midnighters song \"Work With Me Annie\".\n\nAs Collins later put it, “I figured that any band that played ‘Work With Me Annie’ was all right,” and he asked if he could join them for a few songs. They agreed, and afterwards, Collins struck up a conversation with the guitarist, and told him about an idea he'd had for a song based on one of Steve Allen's catchphrases. The guitarist happened to be spending a lot of his time recording at an independent recording studio, and suggested that the two of them record the song together:\n\n[Excerpt: Baby Ray and the Ferns, \"How's Your Bird?\"]\n\nThe guitarist in question was named Frank Zappa. Zappa was originally from Maryland, but had moved to California as a child with his conservative Italian-American family when his father, a defence contractor, had got a job in Monterey. The family had moved around California with his father's work, mostly living in various small towns in the Mojave desert seventy miles or so north of Los Angeles.\n\nYoung Frank had an interest in science, especially chemistry, and especially things that exploded, but while he managed to figure out the ingredients for gunpowder, his family couldn't afford to buy him a chemistry set in his formative years -- they were so poor that his father regularly took part in medical experiments to get a bit of extra money to feed his kids -- and so the young man's interest was diverted away from science towards music.\n\nHis first musical interest, and one that would show up in his music throughout his life, was the comedy music of Spike Jones, whose band combined virtuosic instrumental performances with sound effects:\n\n[Excerpt: Spike Jones and his City Slickers, \"Cocktails for Two\"]\n\nand parodies of popular classical music\n\n[Excerpt: Spike Jones and his City Slickers, \"William Tell Overture\"]\n\nJones was a huge inspiration for almost every eccentric or bohemian of the 1940s and 50s -- Spike Milligan, for example, took the name Spike in tribute to him. And young Zappa wrote his first ever fan letter to Jones when he was five or six.\n\nAs a child Zappa was also fascinated by the visual aesthetics of music -- he liked to draw musical notes on staves and see what they looked like. But his musical interests developed in two other ways once he entered his teens. The first was fairly typical for the musicians of his generation from LA we've looked at and will continue to look at, which is that he heard \"Gee\" by the Crows on the radio:\n\n[Excerpt: The Crows, \"Gee\"]\n\nHe became an R&B obsessive at that moment, and would spend every moment he could listening to the Black radio stations, despite his parents' disapproval. He particularly enjoyed Huggy Boy's radio show broadcast from Dolphins of Hollywood, and also would religiously listen to Johnny Otis, and soon became a connoisseur of the kind of R&B and blues that Otis championed as a musician and DJ:\n\n[Excerpt: Zappa on the Late Show, “I hadn't been raised in an environment where there was a lot of music in the house. This couple that owned the chilli place, Opal and Chester, agreed to ask the man who serviced the jukebox to put in some of the song titles that I liked, because I promised that I would dutifully keep pumping quarters into this thing so that I could listen to them, and so I had the ability to eat good chilli and listen to 'Three Hours Past Midnight' by Johnny 'Guitar' Watson for most of my junior and senior year\"]\n\nJohnny “Guitar” Watson, along with Guitar Slim, would become a formative influence on Zappa's guitar playing, and his playing on \"Three Hours Past Midnight\" is so similar to Zappa's later style that you could easily believe it *was* him:\n\n[Excerpt: Johnny \"Guitar\" Watson, \"Three Hours Past Midnight\"]\n\nBut Zappa wasn't only listening to R&B. The way Zappa would always tell the story, he discovered the music that would set him apart from his contemporaries originally by reading an article in Look magazine. Now, because Zappa has obsessive fans who check every detail, people have done the research and found that there was no such article in that magazine, but he was telling the story close enough to the time period in which it happened that its broad strokes, at least, must be correct even if the details are wrong.\n\nWhat Zappa said was that the article was on Sam Goody, the record salesman, and talked about how Goody was so good at his job that he had even been able to sell a record of Ionisation by Edgard Varese, which just consisted of the worst and most horrible noises anyone had ever heard, just loud drumming noises and screeching sounds.\n\nHe determined then that he needed to hear that album, but he had no idea how he would get hold of a copy. I'll now read an excerpt from Zappa's autobiography, because Zappa's phrasing makes the story much better:\n\n\"Some time later, I was staying overnight with Dave Franken, a friend who lived in La Mesa, and we wound up going to the hi-fi place -- they were having a sale on R&B singles.\n\nAfter shuffling through the rack and finding a couple of Joe Huston records, I made my way toward the cash register and happened to glance at the LP bin. I noticed a strange-looking black-and-white album cover with a guy on it who had frizzy gray hair and looked like a mad scientist. I thought it was great that a mad scientist had finally made a record, so I picked it up -- and there it was, the record with \"Ionisation\" on it.\n\nThe author of the Look article had gotten it slightly wrong -- the correct title was The Complete Works of Edgard Varèse, Volume I, including \"Ionisation,\" among other pieces, on an obscure label called EMS (Elaine Music Store). The record number was 401.I returned the Joe Huston records and checked my pockets to see how much money I had -- I think it came to about $3.75. I'd never bought an album before, but I knew they must be expensive because mostly old people bought them. I asked the man at the cash register how much EMS 401 cost.\n\n\"That gray one in the box?\" he said. \"$5.95.\"\n\nI'd been searching for that record for over a year and I wasn't about to give up. I told him I had $3.75. He thought about it for a minute, and said, \"We've been using that record to demonstrate hi-fi's with -- but nobody ever buys one when we use it. I guess if you want it that bad you can have it for $3.75.\"\"\n\nZappa took the record home, and put it on on his mother's record player in the living room, the only one that could play LPs:\n\n[Excerpt: Edgard Varese, \"Ionisation\"]\n\nHis mother told him he could never play that record in the living room again, so he took the record player into his bedroom, and it became his record player from that point on.\n\nVarese was a French composer who had, in his early career, been very influenced by Debussy. Debussy is now, of course, part of the classical canon, but in the early twentieth century he was regarded as radical, almost revolutionary, for his complete rewriting of the rules of conventional classical music tonality into a new conception based on chordal melodies, pedal points, and use of non-diatonic scales.\n\nAlmost all of Varese's early work was destroyed in a fire, so we don't have evidence of the transition from Debussy's romantic-influenced impressionism to Varese's later style, but after he had moved to the US in 1915 he had become wildly more experimental. \"Ionisation\" is often claimed to be the first piece of Western classical music written only for percussion instruments.\n\nVarese was part of a wider movement of modernist composers -- for example he was the best man at Nicolas Slonimsky's wedding -- and had also set up the International Composers' Guild, whose manifesto influenced Zappa, though his libertarian politics led him to adapt it to a more individualistic rather than collective framing. The original manifesto read in part \"Dying is the privilege of the weary. The present day composers refuse to die. They have realized the necessity of banding together and fighting for the right of each individual to secure a fair and free presentation of his work\"\n\nIn the twenties and thirties, Varese had written a large number of highly experimental pieces, including Ecuatorial, which was written for bass vocal, percussion, woodwind, and two Theremin cellos. These are not the same as the more familiar Theremin, created by the same inventor, and were, as their name suggests, Theremins that were played like a cello, with a fingerboard and bow. Only ten of these were ever made, specifically for performances of Varese's work, and he later rewrote the work to use ondes martenot instead of Theremin cellos, which is how the work is normally heard now:\n\n[Excerpt: Edgard Varese, \"Ecuatorial\"]\n\nBut Varese had spent much of the thirties, forties, and early fifties working on two pieces that were never finished, based on science fiction ideas -- L'Astronome, which was meant to be about communication with people from the star Sirius, and Espace, which was originally intended to be performed simultaneously by choirs in Beijing, Moscow, Paris, and New York.\n\nNeither of these ideas came to fruition, and so Varese had not released any new work, other than one small piece, Étude pour espace, an excerpt from the  larger work, in Zappa's lifetime.\n\nZappa followed up his interest in Varese's music with his music teacher, one of the few people in the young man's life who encouraged him in his unusual interests. That teacher, Mr Kavelman, introduced Zappa to the work of other composers, like Webern, but would also let him know why he liked particular R&B records. For example, Zappa played Mr. Kavelman \"Angel in My Life\" by the Jewels, and asked what it was that made him particularly like it:\n\n[Excerpt: The Jewels, \"Angel in My Life\"]\n\nThe teacher's answer was that it was the parallel fourths that made the record particularly appealing.\nYoung Frank was such a big fan of Varese that for his fifteenth birthday, he actually asked if he could make a long-distance phone call to speak to Varese. He didn't know where Varese lived, but figured that it must be in Greenwich Village because that was where composers lived, and he turned out to be right. He didn't get through on his birthday -- he got Varese's wife, who told him the composer was in Europe -- but he did eventually get to speak to him, and was incredibly excited when Varese told him that not only had he just written a new piece for the first time in years, but that it was called Deserts, and was about deserts -- just like the Mojave Desert where Zappa lived:\n\n[Excerpt: Edgard Varese, \"Deserts\"]\n\nAs he later wrote, “When you’re 15 and living in the Mojave Desert, and you find out that the World’s Greatest Composer (who also looks like a mad scientist) is working in a secret Greenwich Village laboratory on a song about your hometown (so to speak), you can get pretty excited.”\n\nA year later, Zappa actually wrote to Varese, a long letter which included him telling the story about how he'd found his work in the first place, hoping to meet up with him when Zappa travelled to the East Coast to see family. I'll read out a few extracts, but the whole thing is fascinating for what it says about Zappa the precocious adolescent, and I'll link to a blog post with it in the show notes.\n\n\"Dear Sir:\nPerhaps you might remember me from my stupid phone call last January, if not, my name again is Frank Zappa Jr. I am 16 years old… that might explain partly my disturbing you last winter.\n\nAfter I had struggled through Mr. Finklestein’s notes on the back cover (I really did struggle too, for at the time I had had no training in music other than practice at drum rudiments) I became more and more interested in you and your music. I began to go to the library and take out books on modern composers and modern music, to learn all I could about Edgard Varese. It got to be my best subject (your life) and I began writing my reports and term papers on you at school. At one time when my history teacher asked us to write on an American that has really done something for the U.S.A. I wrote on you and the Pan American Composers League and the New Symphony. I failed. The teacher had never heard of you and said I made the whole thing up. Silly but true. That was my Sophomore year in high school.\nThroughout my life all the talents and abilities that God has left me with have been self developed, and when the time came for Frank to learn how to read and write music, Frank taught himself that too. I picked it all up from the library.\n\nI have been composing for two years now, utilizing a strict twelve-tone technique, producing effects that are reminiscent of Anton Webern.\n\nDuring those two years I have written two short woodwind quartets and a short symphony for winds, brass and percussion.\n\nI plan to go on and be a composer after college and I could really use the counsel of a veteran such as you. If you would allow me to visit with you for even a few hours it would be greatly appreciated.\nIt may sound strange but I think I have something to offer you in the way of new ideas. One is an elaboration on the principle of Ruth Seeger’s contrapuntal dynamics and the other is an extension of the twelve-tone technique which I call the inversion square. It enables one to compose harmonically constructed pantonal music in logical patterns and progressions while still abandoning tonality.\n\nVarese sent a brief reply, saying that he was going to be away for a few months, but would like to meet Zappa on his return. The two never met, but Zappa kept the letter from Varese framed on his wall for the rest of his life.\n\nZappa soon bought a couple more albums, a version of \"The Rite of Spring\" by Stravinsky:\n\n[Excerpt: Igor Stravinsky, \"The Rite of Spring\"]\n\nAnd a record of pieces by Webern, including his Symphony opus 21:\n\n[Excerpt: Anton Webern, \"Symphony op. 21\"]\n\n(Incidentally, with the classical music here, I'm not seeking out the precise performances Zappa was listening to, just using whichever recordings I happen to have copies of).\n\nZappa was also reading Slonimsky's works of musicology, like the Thesaurus of Scales and Melodic Patterns.\n\nAs well as this \"serious music\" though, Zappa was also developing as an R&B musician.  He later said of the Webern album, \"I loved that record, but it was about as different from Stravinsky and Varèse as you could get. I didn't know anything about twelve-tone music then, but I liked the way it sounded. Since I didn't have any kind of formal training, it didn't make any difference to me if I was listening to Lightnin' Slim, or a vocal group called the Jewels (who had a song out then called \"Angel in My Life\"), or Webern, or Varèse, or Stravinsky. To me it was all good music.\"\n\nHe had started as a drummer with a group called the Blackouts, an integrated group with white, Latino, and Black members, who played R&B tracks like \"Directly From My Heart to You\", the song Johnny Otis had produced for Little Richard:\n\n[Excerpt: Little Richard, \"Directly From My Heart to You\"]\n\nBut after eighteen months or so, he quit the group and stopped playing drums. Instead, he switched to guitar, with a style influenced by Johnny \"Guitar\" Watson and Guitar Slim. His first guitar had action so bad that he didn't learn to play chords, and moved straight on to playing lead lines with his younger brother Bobby playing rhythm. He also started hanging around with two other teenage bohemians -- Euclid Sherwood, who was nicknamed Motorhead, and Don Vliet, who called himself Don Van Vliet.\n\nVliet was a truly strange character, even more so than Zappa, but they shared a love for the blues, and Vliet was becoming a fairly good blues singer, though he hadn't yet perfected the Howlin' Wolf imitation that would become his stock-in-trade in later years. But the surviving recording of Vliet singing with the Zappa brothers on guitar, singing a silly parody blues about being flushed down the toilet of the kind that many teenage boys would write, shows the promise that the two men had:\n\n[Excerpt: Frank Zappa and Captain Beefheart, \"Lost in a Whirlpool\"]\n\nZappa was also getting the chance to hear his more serious music performed. He'd had the high school band play a couple of his pieces, but he also got the chance to write film music -- his English teacher, Don Cerveris, had decided to go off and seek his fortune as a film scriptwriter, and got Zappa hired to write the music for a cheap Western he'd written, Run Home Slow. The film was beset with problems -- it started filming in 1959 but didn't get finished and released until 1965 -- but the music Zappa wrote for it did eventually get recorded and used on the soundtrack:\n\n[Excerpt: Frank Zappa, \"Run Home Slow Theme\"]\n\nIn 1962, he got to write the music for another film, The World's Greatest Sinner, and he also wrote a theme song for that, which got released as the B-side of \"How's Your Bird?\", the record he made with Ray Collins:\n\n[Excerpt: Baby Ray and the Ferns, \"The World's Greatest Sinner\"]\n\nZappa was able to make these records because by the early sixties, as well as playing guitar in bar bands, he was working as an assistant for a man named Paul Buff. Paul Buff had worked as an engineer for a guided missile manufacturer, but had decided that he didn't want to do that any more, and instead had opened up the first independent multi-track recording studio on the West Coast, PAL Studios, using equipment he'd designed and built himself, including a five-track tape recorder. Buff engineered a huge number of surf instrumentals there, including \"Wipe Out\" by the Surfaris:\n\n[Excerpt: The Surfaris, \"Wipe Out\"]\n\nZappa had first got to know Buff when he had come to Buff's studio with some session musicians in 1961, to record some jazz pieces he'd written, including this piece which at the time was in the style of Dave Brubeck but would later become a staple of Zappa's repertoire reorchestrated in a  rock style.\n\n[Excerpt: The PAL Studio Band, \"Never on Sunday\"]\n\nBuff really just wanted to make records entirely by himself, so he'd taught himself to play the rudiments of guitar, bass, drums, piano, and alto saxophone, so he could create records alone. He would listen to every big hit record, figure out what the hooks were on the record, and write his own knock-off of those. An example is \"Tijuana Surf\" by the Hollywood Persuaders, which is actually Buff on all instruments, and which according to Zappa went to number one in Mexico (though I've not found an independent source to confirm that chart placing, so perhaps take it with a pinch of salt):\n\n[Excerpt: The Hollywood Persuaders, \"Tijuana Surf\"]\n\nThe B-side to that, \"Grunion Run\", was written by Zappa, who also plays guitar on that side:\n\n[Excerpt: The Hollywood Persuaders, \"Grunion Run\"]\n\nZappa, Buff, Ray Collins, and a couple of associates would record all sorts of material at PAL -- comedy material like \"Hey Nelda\", under the name \"Ned and Nelda\" -- a parody of \"Hey Paula\" by Paul and Paula:\n\n[Excerpt: Ned and Nelda, \"Hey Nelda\"]\n\nDoo-wop parodies like \"Masked Grandma\":\n\n[Excerpt: The PAL Studio Band, \"Masked Grandma\"]\n\nR&B:\n\n[Excerpt: The PAL Studio Band, \"Why Don't You Do Me Right?\"]\n\nand more. Then Buff or Zappa would visit one of the local independent label owners and try to sell them the master -- Art Laboe at Original Sound released several of the singles, as did Bob Keane at Donna Records and Del-Fi.\n\nThe \"How's Your Bird\" single also got Zappa his first national media exposure, as he went on the Steve Allen show, where he demonstrated to Allen how to make music using a bicycle and a prerecorded electronic tape, in an appearance that Zappa would parody five years later on the Monkees' TV show:\n\n[Excerpt: Steve Allen and Frank Zappa, \"Cyclophony\"]\n\nBut possibly the record that made the most impact at the time was \"Memories of El Monte\", a song that Zappa and Collins wrote together about Art Laboe's dances at El Monte Stadium, incorporating excerpts of several of the songs that would be played there, and named after a compilation Laboe had put out, which had included “I Remember Linda” by Little Julian and the Tigers. They got Cleve Duncan of the Penguins to sing lead, and the record came out as by the Penguins, on Original Sound:\n\n[Excerpt: The Penguins, \"Memories of El Monte\"]\n\nBy this point, though, Pal studios was losing money, and Buff took up the offer of a job working for Laboe full time, as an engineer at Original Sound. He would later become best known for inventing the kepex, an early noise gate which engineer Alan Parsons used on a bass drum to create the \"heartbeat\" that opens Pink Floyd's Dark Side of the Moon:\n\n[Excerpt: Pink Floyd, \"Speak to Me\"]\n\nThat invention would possibly be Buff's most lasting contribution to music, as by the early eighties, the drum sound on every single pop record was recorded using a noise gate.\n\nBuff sold the studio to Zappa, who renamed it Studio Z and moved in -- he was going through a divorce and had nowhere else to live. The studio had no shower, and Zappa had to just use a sink to wash, and he was surviving mostly off food scrounged by his resourceful friend Motorhead Sherwood.\n\nBy this point, Zappa had also joined a band called the Soots, consisting of Don Van Vliet, Alex St. Clair and Vic Mortenson, and they recorded several tracks at Studio Z, which they tried to get released on Dot Records, including a cover version of Little Richard's “Slippin' and Slidin'”, and a song called “Tiger Roach” whose lyrics were mostly random phrases culled from a Green Lantern comic:\n\n[Excerpt: The Soots, \"Tiger Roach\"]\n\nZappa also started writing what was intended as the first ever rock opera, \"I Was a Teenage Maltshop\", and attempts were made to record parts of it with Vliet, Mortenson, and Motorhead Sherwood:\n\n[Excerpt: Frank Zappa, \"I Was a Teenage Maltshop\"]\n\nZappa was also planning to turn Studio Z into a film studio. He obtained some used film equipment, and started planning a science fiction film to feature Vliet, titled \"Captain Beefheart Meets the Grunt People\". The title was inspired by an uncle of Vliet's, who lived with Vliet and his girlfriend, and used to urinate with the door open so he could expose himself to Vliet's girlfriend, saying as he did so \"Look at that! Looks just like a big beef heart!\"\n\nUnfortunately, the film would not get very far. Zappa was approached by a used-car salesman who said that he and his friends were having a stag party. As Zappa owned a film studio, could he make them a pornographic film to show at the party? Zappa told him that a film wouldn't be possible, but as he needed the money, would an audio tape be acceptable? The used-car salesman said that it would, and gave him a list of sex acts he and his friends would like to hear. Zappa and a friend, Lorraine Belcher, went into the studio and made a few grunting noises and sound effects.\n\nThe used-car salesman turned out actually to be an undercover policeman, who was better known in the area for his entrapment of gay men, but had decided to branch out. Zappa and Belcher were arrested -- Zappa's father bailed him out, and Zappa got an advance from Art Laboe to pay Belcher's bail. Luckily \"Grunion Run\" and \"Memories of El Monte\" were doing well enough that Laboe could give Zappa a $1500 advance.\n\nWhen the case finally came to trial, the judge laughed at the tape and wanted to throw the whole case out, but the prosecutor insisted on fighting, and Zappa got ten days in prison, and most of his tapes were impounded, never to be returned. He fell behind with his rent, and Studio Z was demolished.\n\nAnd then Ray Collins called him, asking if he wanted to join a bar band:\n\n[Excerpt: The Mothers, \"Hitch-Hike\"]\n\nThe Soul Giants were formed by a bass player named Roy Estrada. Now, Estrada is unfortunately someone who will come up in the story a fair bit over the next year or so, as he played on several of the most important records to come out of LA in the sixties and early seventies. He is also someone about whom there's fairly little biographical information -- he's not been interviewed much, compared to pretty much everyone else, and it's easy to understand why when you realise that he's currently half-way through a twenty-five year sentence for child molestation -- his third such conviction. He won't get out of prison until he's ninety-three. He's one of the most despicable people who will turn up in this podcast, and frankly I'm quite glad I don't know more about him as a person.\n\nHe was, though, a good bass player and falsetto singer, and he had released a single on King Records, an instrumental titled \"Jungle Dreams\":\n\n[Excerpt, Roy Estrada and the Rocketeers, \"Jungle Dreams\"]\n\nThe other member of the rhythm section, Jimmy Carl Black, was an American Indian (that's the term he always used about himself until his death, and so that's the term I'll use about him too) from Texas. Black had grown up in El Paso as a fan of Western Swing music, especially Bob Wills, but had become an R&B fan after discovering Wolfman Jack's radio show and hearing the music of Howlin' Wolf and Sonny Boy Williamson.\n\nLike every young man from El Paso, he would travel to Juarez as a teenager to get drunk, see sex shows, and raise hell. It was also there that he saw his first live blues music, watching Long John Hunter, the same man who inspired the Bobby Fuller Four, and he would always claim Hunter as the man whose shows taught him how to play the blues.\n\nBlack had decided he wanted to become a musician when he'd seen Elvis perform live. In Black's memory, this was a gig where Elvis was an unknown support act for Faron Young and Wanda Jackson, but he was almost certainly slightly misremembering -- it's most likely that what he saw was Elvis' show in El Paso on the eleventh of April 1956, where Young and Jackson were also on the bill, but supporting Elvis who was headlining.\n\nEither way, Black had decided that he wanted to make girls react to him the same way they reacted to Elvis, and he started playing in various country and R&B bands. His first record was with a group called the Keys, and unfortunately I haven't been able to track down a copy (it was reissued on a CD in the nineties, but the CD itself is now out of print and sells for sixty pounds) but he did rerecord the song with a later group he led, the Mannish Boys:\n\n[Excerpt: Jimmy Carl Black and the Mannish Boys, \"Stretch Pants\"]\n\nHe spent a couple of years in the Air Force, but continued playing music during that time, including in a band called The Exceptions which featured Peter Cetera later of the band Chicago, on bass. After a brief time working as lineman in Wichita, he moved his family to California, where he got a job teaching drums at a music shop in Anaheim, where the bass teacher was Jim Fielder, who would later play bass in Blood, Sweat, and Tears. One of Fielder's friends, Tim Buckley, used to hang around in the shop as well, and Black was at first irritated by him coming in and playing the guitars and not buying anything, but eventually became impressed by his music. Black would later introduce Buckley to Herb Cohen, who would become Buckley's manager, starting his professional career.\n\nWhen Roy Estrada came into the shop, he and Black struck up a friendship, and Estrada asked Black to join his band The Soul Giants, whose lineup became Estrada, Black, a sax player named Davey Coronado, a guitarist called Larry and a singer called Dave. The group got a residency at the Broadside club in Ponoma, playing \"Woolly Bully\" and \"Louie Louie\" and other garage-band staples.\n\nBut then Larry and Dave got drafted, and the group got in two men called Ray -- Ray Collins on vocals, and Ray Hunt on guitar. This worked for a little while, but Ray Hunt was, by all accounts, not a great guitar player -- he would play wrong chords, and also he was fundamentally a surf player while the Soul Giants were an R&B group. Eventually, Collins and Hunt got into a fistfight, and Collins suggested that they get in his friend Frank instead.\n\nFor a while, the Soul Giants continued playing \"Midnight Hour\" and \"Louie Louie\", but then Zappa suggested that they start playing some of his original material as well. Davy Coronado refused to play original material, because he thought, correctly, that it would lose the band gigs, but the rest of the band sided with the man who had quickly become their new leader. Coronado moved back to Texas, and on Mother's Day 1965 the Soul Giants changed their name to the Mothers. They got in Henry Vestine on second guitar, and started playing Zappa's originals, as well as changing the lyrics to some of the hits they were playing:\n\n[Excerpt: The Mothers, \"Plastic People\"]\n\nZappa had started associating with the freak crowd in Hollywood centred around Vito and Franzoni, after being introduced by Don Cerveris, his old teacher turned screenwriter, to an artist called Mark Cheka, who Zappa invited to manage the group. Cheka in turn brought in his friend Herb Cohen, who managed several folk acts including the Modern Folk Quartet and Judy Henske, and who like Zappa had once been arrested on obscenity charges, in Cohen's case for promoting gigs by the comedian Lenny Bruce.\n\nCohen first saw the Mothers when they were recording their appearance in an exploitation film called Mondo Hollywood. They were playing in a party scene, using equipment borrowed from Jim Guercio, a session musician who would briefly join the Mothers, but who is now best known for having been Chicago's manager and producing hit records for them and Blood, Sweat, and Tears. In the crowd were Vito and Franzoni, Bryan Maclean, Ram Dass, the Harvard psychologist who had collaborated with Timothy Leary in controversial LSD experiments that had led to both losing their jobs, and other stalwarts of the Sunset Strip scene.\n\nCohen got the group bookings at the Whisky A-Go-Go and The Trip, two of the premier LA nightclubs, and Zappa would also sit in with other bands playing at those venues, like the Grass Roots, a band featuring\n\nBryan Maclean and Arthur Lee which would soon change its name to Love.\n\nAt this time Zappa and Henry Vestine lived together, next door to a singer named Victoria Winston, who at the time was in a duo called Summer's Children with Curt Boettcher:\n\n[Excerpt: Summer's Children, \"Milk and Honey\"]\n\nWinston, like Zappa, was a fan of Edgard Varese, and actually asked Zappa to write songs for Summer's Children, but one of the partners involved in their production company disliked Zappa's material and the collaboration went no further.\n\nZappa at this point was trying to incorporate more ideas from modal jazz into his music. He was particularly impressed by Eric Dolphy's 1964 album \"Out to Lunch\":\n\n[Excerpt: Eric Dolphy, \"Hat and Beard\"]\n\nBut he was also writing more about social issues, and in particular he had written a song called \"The Watts Riots Song\", which would later be renamed \"Trouble Every Day\":\n\n[Excerpt: The Mothers of Invention, \"Trouble Every Day\"]\n\nNow, the Watts Uprising was one of the most important events in Black American history, and it feels quite wrong that I'm covering it in an episode about a band made up of white, Latino, and American Indian people rather than a record made by Black people, but I couldn't find any way to fit it in anywhere else.\n\nAs you will remember me saying in the episode on \"I Fought the Law\", the LA police under Chief William Parker were essentially a criminal gang by any other name -- they were incompetent, violent, and institutionally racist, and terrorised Black people. The Black people of LA were also feeling particularly aggrieved in the summer of 1965, as a law banning segregation in housing had been overturned by a ballot proposition in November 1964, sponsored by the real estate industry and passed by an overwhelming majority of white voters in what Martin Luther King called \"one of the most shameful developments in our nation’s history\", and which Edmund Brown, the Democratic governor said was like \"another hate binge which began more than 30 years ago in a Munich beer hall\".\n\nThen on Wednesday, August 11, 1965, the police pulled over a Black man, Marquette Frye, for drunk driving. He had been driving his mother's car, and she lived nearby, and she came out to shout at him about drinking and driving. The mother, Rena Price, was hit by one of the policemen; Frye then physically attacked one of the police for hitting his mother, one of the police pulled out a gun, a crowd gathered, the police became violent against the crowd, a rumour spread that they had kicked a pregnant woman, and the resulting protests were exacerbated by the police carrying out what Chief Parker described as a \"paramiltary\" response. The National Guard were called in, huge swathes of south central LA were cordoned off by the police with signs saying things like \"turn left or get shot\".\n\nBlack residents started setting fire to and looting local white-owned businesses that had been exploiting Black workers and customers, though this looting was very much confined to individuals who were known to have made the situation worse. Eventually it took six days for the uprising to be put down, at a cost of thirty-four deaths, 1032 injuries, and 3438 arrests. Of the deaths, twenty-three were Black civilians murdered by the police, and zero were police murdered by Black civilians (two police were killed by other police, in accidental shootings).\n\nThe civil rights activist Bayard Rustin said of the uprising, \"The whole point of the outbreak in Watts was that it marked the first major rebellion of Negroes against their own masochism and was carried on with the express purpose of asserting that they would no longer quietly submit to the deprivation of slum life.\"\n\nFrank Zappa's musical hero Johnny Otis would later publish the book Listen to the Lambs about the Watts rebellion, and in it he devotes more than thirty pages to eyewitness accounts from Black people. It's an absolutely invaluable resource.\n\nOne of the people Otis interviews is Lily Ford, who is described by my copy of the book as being the \"lead singer of the famous Roulettes\". This is presumably an error made by the publishers, rather than Otis, because Ford was actually a singer with the Raelettes, as in Ray Charles' vocal group. She also recorded with Otis under the name \"Lily of the Valley\":\n\n[Excerpt: Lily of the Valley, \"I Had a Sweet Dream\"]\n\nNow, Ford's account deserves a large excerpt, but be warned, this is very, very difficult to hear. I gave a content warning at the beginning, but I'm going to give another one here.\n\n\"A lot of our people were in the street, seeing if they could get free food and clothes and furniture, and some of them taking liquor too. But the white man was out for blood.\n\nThen three boys came down the street, laughing and talking. They were teenagers, about fifteen or sixteen years old. As they got right at the store they seemed to debate whether they would go inside. One boy started a couple of times to go. Finally he did. Now a cop car finally stops to investigate. Police got out of the car. Meanwhile, the other two boys had seen them coming and they ran. My brother-in-law and I were screaming and yelling for the boy to get out.\n\nHe didn't hear us, or was too scared to move. He never had a chance. This young cop walked up to the broken window and looked in as the other one went round the back and fired some shots and I just knew he'd killed the other two boys, but I guess he missed. He came around front again. By now other police cars had come.\n\nThe cop at the window aimed his gun. He stopped and looked back at a policeman sitting in a car. He aimed again. No shot. I tried to scream, but I was so horrified that nothing would come out of my throat. The third time he aimed he yelled, \"Halt\", and fired before the word was out of his mouth. Then he turned around and made a bull's-eye sign with his fingers to his partner. Just as though he had shot a tin can off a fence, not a human being.\n\nThe cops stood around for ten or fifteen minutes without going inside to see if the kid was alive or dead. When the ambulance came, then they went in. They dragged him out like he was a sack of potatoes. Cops were everywhere now.\n\nSo many cops for just one murder.\"\n\n[Excerpt: The Mothers of Invention, \"Trouble Every Day\"]\n\nThere's a lot more of this sort of account in Otis' book, and it's all worth reading -- indeed, I would argue that it is *necessary* reading. And Otis keeps making a point which I quoted back in the episode on \"Willie and the Hand Jive\" but which I will quote again here -- “A newborn Negro baby has less chance of survival than a white. A Negro baby will have its life ended seven years sooner. This is not some biological phenomenon linked to skin colour, like sickle-cell anaemia; this is a national crime, linked to a white-supremacist way of life and compounded by indifference”.\n\n(Just a reminder, the word “Negro” which Otis uses there was, in the mid-sixties, the term of choice used by Black people.)\n\nAnd it's this which inspired \"The Watts Riot Song\", which the Mothers were playing when Tom Wilson was brought into The Trip by Herb Cohen:\n\n[Excerpt: The Mothers of Invention, \"Trouble Every Day\"]\n\nWilson had just moved from Columbia, where he'd been producing Dylan and Simon and Garfunkel, to Verve, a subsidiary of MGM which was known for jazz records but was moving into rock and roll. Wilson was looking for a white blues band, and thought he'd found one. He signed the group without hearing any other songs.\n\nHenry Vestine quit the group between the signing and the first recording, to go and join an *actual* white blues band, Canned Heat, and over the next year the group's lineup would fluctuate quite a bit around the core of Zappa, Collins, Estrada, and Black, with members like Steve Mann, Jim Guercio, Jim Fielder, and Van Dyke Parks coming and going, often without any recordings being made of their performances. The lineup on what became the group's first album, Freak Out! was Zappa, Collins, Estrada, Black, and Elliot Ingber, the former guitarist with the Gamblers, who had joined the group shortly before the session and would leave within a few months.\n\nThe first track the group recorded, \"Any Way the Wind Blows\", was straightforward enough:\n\n[Excerpt: The Mothers of Invention, \"Any Way the Wind Blows\"]\n\nThe second song, a \"Satisfaction\" knock-off called \"Hungry Freaks Daddy\", was also fine. But it was when the group performed their third song of the session, \"Who Are The Brain Police?\", that Tom Wilson realised that he didn't have a standard band on his hands:\n\n[Excerpt: The Mothers of Invention, \"Who Are the Brain Police?\"]\n\nLuckily for everyone concerned, Tom Wilson was probably the single best producer in America to have discovered the Mothers. While he was at the time primarily known for his folk-rock productions, he had built his early career on Cecil Taylor and Sun Ra records, some of the freakiest jazz of the fifties and early sixties. He knew what needed to be done -- he needed a bigger budget.\n\nFar from being annoyed that he didn't have the white blues band he wanted, Wilson actively encouraged the group to go much, much further. He brought in Wrecking Crew members to augment the band (though one of them. Mac Rebennack, found the music so irritating he pretended he needed to go to the toilet, walked out, and never came back). He got orchestral musicians to play Zappa's scores, and allowed the group to rent hundreds of dollars of percussion instruments for the side-long track \"Return of the Son of Monster Magnet\", which features many Hollywood scenesters of the time, including Van Dyke Parks, Kim Fowley, future Manson family member Bobby Beausoleil, record executive David Anderle, songwriter P.F. Sloan, and cartoonist Terry Gilliam, all recording percussion parts and vocal noises:\n\n[Excerpt: The Mothers of Invention, \"Return of the Son of Monster Magnet\"]\n\nSuch was Wilson's belief in the group that Freak Out! became only the second rock double album ever released -- exactly a week after the first, Blonde on Blonde, by Wilson's former associate Bob Dylan.\n\nThe inner sleeve included a huge list of people who had influenced the record in one way or another, including people Zappa knew like Don Cerveris, Don Vliet, Paul Buff, Bob Keane, Nik Venet, and Art Laboe,  musicians who had influenced the group like Don & Dewey, Johnny Otis, Otis' sax players Preston Love and Big Jay McNeely, Eric Dolphy, Edgard Varese, Richard Berry, Johnny Guitar Watson, and Ravi Shankar, eccentric performers like Tiny Tim, DJs like Hunter Hancock and Huggy Boy, science fiction writers like Cordwainer Smith and Robert Sheckley, and scenesters like David Crosby, Vito, and Franzoni. The list of 179 people would provide a sort of guide for many listeners, who would seek out those names and find their ways into the realms of non-mainstream music, writing, and art over the next few decades.\n\nZappa would always remain grateful to Wilson for taking his side in the record's production, saying \"Wilson was sticking his neck out. He laid his job on the line by producing the album. MGM felt that they had spent too much money on the album\".\n\nThe one thing Wilson couldn't do, though, was persuade the label that the group's name could stay as it was. \"The Mothers\" was a euphemism, for a word I can't say if I want this podcast to keep its clean rating, a word that is often replaced in TV clean edits of films with \"melon farmers\", and MGM were convinced that the radio would never play any music by a band with that name -- not realising that that wouldn't be the reason this music wouldn't get played on the radio.\n\nThe group needed to change their name.\n\nAnd so, out of necessity, they became the Mothers of Invention.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and forty of A History of Rock Music in Five Hundred Songs looks at “Trouble Every Day\" by the Mothers of Invention, and the early career of Frank Zappa. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Christmas Time is Here Again\" by the Beatles.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nI'm away from home as I upload this and haven't been able to do a Mixcloud, but will hopefully edit a link in in a week or so if I remember.\n\nThe main biography I consulted for this was Electric Don Quixote by Neil Slaven.\n\nZappa's autobiography, The Real Frank Zappa Book, is essential reading if you're a fan of his work.\n\nInformation about Jimmy Carl Black's early life came from Black's autobiography, For Mother's Sake.\n\nZappa's letter to Varese is from this blog, which also contains a lot of other useful information on Zappa.\n\nFor information on the Watts uprising, I recommend Johnny Otis' Listen to the Lambs.\n\nAnd the original mix of Freak Out is currently available not on the CD issue of Freak Out itself, which is an eighties remix, but on this \"documentary\" set.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\nJust a quick note before I begin -- there are a couple of passing references in this episode to rape and child abuse. I don't believe there's anything that should upset anyone, but if you're worried, you might want to read the transcript on the podcast website before or instead of listening.\n\nBut also, this episode contains explicit, detailed, descriptions of racial violence carried out by the police against Black people, including against children. Some of it is so distressing that even reading the transcript might be a bit much for some people.\n\nSometimes, in this podcast, we have to go back to another story we've already told. In most cases, that story is recent enough that I can just say, \"remember last episode, when I said...\", but to tell the story of the Mothers of Invention, I have to start with a story that I told sixty-nine episodes ago, in episode seventy-one, which came out nearly two years ago. In that episode, on \"Willie and the Hand Jive\", I briefly told the story of Little Julian Herrera at the start. I'm going to tell a slightly longer version of the story now. Some of the information at the start of this episode will be familiar from that and other episodes, but I'm not going to expect people to remember something from that long ago, given all that's happened since.\n\nThe DJ Art Laboe is one of the few figures from the dawn of rock and roll who is still working. At ninety-six years old, he still promotes concerts, and hosts a syndicated radio show on which he plays \"Oldies but Goodies\", a phrase which could describe him as well as the music. It's a phrase he coined -- and trademarked -- back in the 1950s, when people in his audience would ask him to play records made a whole three or four years earlier, records they had listened to in their youth.\n\nLaboe pretty much single-handedly invented the rock and roll nostalgia market -- as well as being a DJ, he owned a record label, Original Sound, which put out a series of compilation albums, Oldies But Goodies, starting in 1959, which started to cement the first draft of the doo-wop canon. These were the first albums to compile together a set of older rock and roll hits and market them for nostalgia, and they were very much based on the tastes of his West Coast teenage listenership, featuring songs like \"Earth Angel\" by the Penguins:\n\n[Excerpt: The Penguins, \"Earth Angel\"]\n\nBut also records that had a more limited geographic appeal, like \"Heaven and Paradise\" by Don Julian an",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and forty of A History of Rock Music in Five Hundred Songs looks at “Trouble Every Day\" by the Mothers of Invention, and the early career of Frank Zappa. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Christmas Time is Here Again\" by the Beatles.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nI'm away from home as I upload this and haven't been able to do a Mixcloud, but will hopefully edit a link in in a week or so if I remember.\n\nThe main biography I consulted for this was Electric Don Quixote by Neil Slaven.\n\nZappa's autobiography, The Real Frank Zappa Book, is essential reading if you're a fan of his work.\n\nInformation about Jimmy Carl Black's early life c",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}