{
  "title": "#465: How I Met Your Mother (OOTP 28, Snape's Worst Memory)",
  "link": "https://audioboom.com/posts/7579350",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5863,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>\n<a href=\"http://WizardingWorld.com\">WizardingWorld.com</a> is hosting a video reread of Sorcerer's Stone and <a href=\"https://www.wizardingworld.com/chapters/reading-the-boy-who-lived\">Daniel Radcliffe kicks things off</a>!</li>\n<li>Don't miss Quizzitch Live: The Goblet of Popcorn next Sunday, May 17 (11 am ET)!</li>\n<li>The MuggleCast 15th Anniversary T-Shirt is here! <a href=\"http://www.patreon.com/mugglecast\">Become a Patron</a> by June 30 at the Dumbledore's Army level or higher to get yours! </li>\n<li>Muggle Mail covers Ministry toilet access, Hermione's advice to Harry and memory perspective!</li>\n<li>\n<a href=\"http://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a> continues with Order of the Phoenix – Chapter 28: Snape's Worst Memory</li>\n<li>7-Word Summary: Discoveries are difficult to watch in Pensieve </li>\n<li>Why didn't Professor McGonagall take over as Headmistress?</li>\n<li>We reveal something in Hogwarts that ISN'T a security nightmare!</li>\n<li>The Inquisitorial Squad</li>\n<li>The Weasley Twins, their loyalty to Dumbledore and their ability to perform exceptional magic</li>\n<li>Connecting The Threads between Montague and the Vanishing Cabinet</li>\n<li>Is it fair that Filch is Caretaker of Hogwarts when he can't perform magic?</li>\n<li>Drink up! Could Umbridge's attempts be any more obvious?</li>\n<li>As far as apologies go, where does Cho's rank?</li>\n<li>Inside Snape’s Worst Memory: should Harry have taken this magical leap?</li>\n<li>How does time work inside people's memories?</li>\n<li>Why doesn't Harry recognize his mother's initials?</li>\n<li>Why does Harry see this memory from the third person? Why does he have such freedom of movement?</li>\n<li>We analyze the younger versions of James, Sirius, Lupin, Peter, Lily and Snape</li>\n<li>How are the Marauders any different than Malfoy, Crabbe and Goyle?</li>\n<li>Is it Snape's Worst Memory because he calls Lily a mudblood?</li>\n<li>We discuss the future implications this scene has for both James and Harry</li>\n<li>The Umbridge Suck Count climbs to 80!</li>\n<li>The hosts give their MVP of the Week and Rename The Chapter!</li>\n<li>Quizzitch: What punishment does Umbridge instruct Filch to apply to the Weasley Twins for their Swamp?</li>\n<li>Workout at home and see great results with BeachBody On Demand! Text 'mugglecast' to 30-30-30 to receive a free trial!</li>\n<li>Join our community at <a href=\"http://www.patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 12 May 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-05-11:/posts/7579350",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}