{
  "title": "Micron Announces 20-Year Plan To Build $100 Billion U.S. Fab Complex",
  "dc:creator": "Anton Shilov",
  "description": " <p align=\"center\"><a href=\"https://www.anandtech.com/show/17606/micron-announces-100-billion-us-fab-complex-a-20year-plan\"><img src=\"https://images.anandtech.com/doci/17606/intel_micron_flash_semiconductor_im_flash_manufacturing_678_575px.jpg\" alt=\"\" /></a></p><p><p>Now that the U.S. government has finally settled the matter of whether it would be providing subsidies to entice chip fabs to setup shop within the U.S., those fabs and chip makers are starting to hammer out their domestic investment plans. Of all of the proposals revealed so far, Micron's new proposal stands to be the most ambitious. Last week the company&nbsp;<a href=\"https://investors.micron.com/news-releases/news-release-details/micron-announces-historic-investment-100-billion-build-megafab\">announced</a>&nbsp;plans to build the largest chip production complex in the history of the U.S. in central New York state. The plan will span 20 years of construction and upgrades, with a total price tag expected to hit around $100 billion by the time Micron is finished in the 2040s.&nbsp;</p>\n\n<p>Micron's new site near Clay, New York, will not only be the company's largest campus ever built, but will also be the largest chip fab in the USA. The new Micron campus will produce DRAM using leading-edge process technologies and is expected to eventually include four&nbsp;600,000 feet<sup>2</sup>&nbsp;(55,700 meters<sup>2</sup>)&nbsp;clean rooms. Which, to provide some context, is roughly eight-times the clean room space of GlobalFoundries' Fab 8. The new fab complex will complement Micron's already announced&nbsp;<a href=\"https://www.anandtech.com/show/17573/micron-breaks-ground-on-its-15-billion-euv-dram-fab-in-the-us\">campus near Boise, Idaho</a>, that is expected to start coming online starting in 2025. Both sites will be instrumental to meet Micron's goal to produce 40% of its DRAM in the U.S. over the next decade.</p>\n\n<p>According to Micron, the company's investments in its New York production facility will total $100 billion when fully built, and it will create some 9,000 Micron jobs along with some 41,000 indirect jobs. The first phase of the Clay, New York, project is expected to cost Micron around $20 billion in total over the rest of this decade. The DRAM maker expects to get $5.5 billion in incentives from the state of New York over the life of the project, as well as federal grants and tax credits from the CHIPS and Science Act. In addition, Micron and the state of New York will also invest $500 million over the next 20+ years in community and workforce development.</p>\n\n<p>Micron plans to start site preparation work in 2023&nbsp;and start construction in 2024. The facility ramp up is set to begin in the second half of the decade based on industry demand for DRAM devices.</p>\n\n<p>Broadly speaking, fab complexes with eye-popping price tags are quickly becoming the norm in the fab industry as the cost of building and equipping successive generations of fabs continues to balloon. And while Micron is not the first company to plan for a twelve digit price tag for a new fab complex (Intel's new fab complex in Ohio is officially expected to cost around $100 billion when completed), Micron's announcement is notable in that unlike Intel and TSMC, Micron isn't a logic producer. So the company's $100 billion plans are entirely for memory, a relatively bold commitment for a conservative company that's competing in the tech industry's classic commodity market.</p>\n\n<p>Bearing in mind that the new fab in in Onondaga County, New York, is not set to come online until the later half of the decade, it is too early for Micro to reveal which process technologies and types of products it will produce. The only thing that the company says is that this will be a leading-edge facility that will produce advanced DRAM products (think 64Gb DDR5 chips, DDR6 DRAMs, next-generation HBM, etc.) using EUV-enabled production nodes.</p>\n\n<p>\"Micron will leverage the diverse, highly educated and skilled talent in New York as we look to build our workforce in the Empire State,\"&nbsp;said Sanjay Mehrotra, chief executive of Micron. \"This historic leading-edge memory megafab in Central New York will deliver benefits beyond the semiconductor industry by strengthening U.S. technology leadership as well as economic and national security, driving American innovation and competitiveness for decades to come.\"</p>\n\n<p>Source:&nbsp;<a href=\"https://investors.micron.com/news-releases/news-release-details/micron-announces-historic-investment-100-billion-build-megafab\">Micron</a></p>\n</p>",
  "link": "https://www.anandtech.com/show/17606/micron-announces-100-billion-us-fab-complex-a-20year-plan",
  "pubDate": "Mon, 10 Oct 2022 13:00:00 EDT",
  "guid": "tag:www.anandtech.com,17606:news",
  "category": " Semiconductors"
}