{
  "title": "S1E49 - Bouncing Forward with Paralympic Snowboarder Amy Purdy",
  "guid": "https://pinecast.com/guid/14dd26a8-55cc-4567-a383-5d825205e2e8",
  "pubDate": "Tue, 29 Jun 2021 06:30:00 -0000",
  "itunes:duration": "01:10:31",
  "description": "<p>Joining Laura on the podcast this week is the top-ranked female adaptive snowboarder in the U.S., Amy Purdy. Diagnosed with meningococcal meningitis at the age of 19, Amy has gone on to become a three-time World Cup para-snowboard gold medalist, the 2014 Paralympic bronze medalist, and the founder of Adaptive Action Sports, a nonprofit organization that helps youth, young adults, and wounded veterans with physical disabilities get involved with action sports. She is a professional motivational speaker who has been featured at both TEDx and Pop Tech, and is also an actress, model, dancer, clothing designer, and an experienced product spokesperson. In addition to all this, Amy was also the breakout star and a finalist on season 18 of 'Dancing with the Stars'. A true inspiration to us all, Amy shares her incredible story with Laura and her listeners here today.</p>\n<p>Amy starts by discussing her love for snowboarding during her teenage years. She then discusses her struggle with her medical condition and how she rose above her hardships through her self-belief. As you listen, you’ll learn of Amy’s many accomplishments, such as securing brand deals and winning a bronze medal. Along the way, you’ll understand Amy’s positive contributions to athletes with disabilities/special needs, and the lessons you learn from this podcast will definitely inspire you to look at difficulties in a whole new way.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Amy’s early days when she snowboarded with her friends</li>\n<li>How meningococcal meningitis impacted Amy</li>\n<li>Amy’s struggle with self-doubt</li>\n<li>How Amy discovered a creative solution to help her snowboard</li>\n<li>How Amy co-founded Adaptive Action Sports</li>\n<li>Amy’s successes with snowboarding</li>\n<li>How Amy’s injury complications changed her life</li>\n<li>Amy’s experiences and how she connects with her audience</li>\n</ul>\n<p>Quotes</p>\n<ul>\n<li>“So yeah, so snowboarding really was my passion. That’s what pulled me through my darkest days. And then you know, who would have thought that it would become almost my purpose, right?”</li>\n<li>“And when I woke up from this coma, a few days later, I still have this respirator down my throat. And so, I couldn’t talk. But I wrote out on a piece of paper that I was given a choice and I chose to stay.’’</li>\n<li>“I was just hanging on, and also incredibly grateful, like to have the opportunity to hang on and fight. And so, gratitude became a big part of not just a practice, but to be honest, like a very natural organic thing for me, because every day I woke up and I was alive, I was grateful whether I’d lost my legs or not.’’</li>\n<li>“And I remember at one point saying, ‘I don’t know if I can do this, but if anybody can, it’s going to be me.’ ‘’</li>\n<li>“I needed a community of people who are like me, and it didn’t really exist and needed something to pull it together.’’</li>\n<li>“It’s like going through the valleys of despair and like finding your way out and having these real realizations of what’s really important in life, and how do we get through challenges. And I’ve decided to share the journey along the way.’’</li>\n</ul>\n<p>Show Links</p>\n<p><a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold Homepage</a>\n<a href=\"https://www.amazon.com/Life-10-Meters-Lessons-Champion/dp/B096CQW2L7/ref=sr_1_3?crid=2AXVGI3HL987J&dchild=1&keywords=laura+wilkinson+life+at+10+meters&qid=1624113646&sprefix=Laura+Wilkinson%2Caps%2C227&sr=8-3\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a></p>\n<p>Laura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura's Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura's Facebook page</a></p>\n<p>Connect With Amy:\n<a href=\"https://open.spotify.com/show/10UETjJft9sVlwNx6ShxlO\" rel=\"nofollow\">Bouncing Forward with Amy Purdy (Spotify)</a>\n<a href=\"http://adacs.org/history\" rel=\"nofollow\">Adaptive Action Sports Homepage</a>\n<a href=\"https://www.instagram.com/amypurdygurl/?hl=en\" rel=\"nofollow\">Amy Purdy on Instagram</a></p>\n<p>Resources:\n<a href=\"https://www.amazon.com/My-Own-Two-Feet-Learning/dp/0062379100\" rel=\"nofollow\">On My Own Feet: The Journey from Losing My Legs to Learning the Dance of Life (2014)</a></p>",
  "itunes:title": "Bouncing Forward with Paralympic Snowboarder Amy Purdy",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 49
}