{
  "title": "Why Businesses Need to Embrace the Bioeconomy",
  "link": "https://sloanreview.mit.edu/article/why-businesses-need-to-embrace-the-bioeconomy/",
  "comments": "https://sloanreview.mit.edu/article/why-businesses-need-to-embrace-the-bioeconomy/#respond",
  "pubDate": "Wed, 02 Nov 2022 11:00:50 +0000",
  "dc:creator": "Donna Marshall, Aideen O’Dochartaigh, Andrea Prothero, Orlagh Reynolds, and Enrico Secchi. <p>Donna Marshall is professor of supply chain management at University College Dublin (UCD). Aideen O’Dochartaigh is assistant professor of accounting at Dublin City University (DCU). Andrea Prothero is professor of business and society at UCD. Orlagh Reynolds is assistant professor in entrepreneurship at DCU. Enrico Secchi is assistant professor of supply chain management at UCD.  </p>\n",
  "category": [
    "Environmental Sustainability",
    "Green Business",
    "Innovation",
    "Supply Chain",
    "New Product Development",
    "Social Responsibility",
    "Sustainability",
    "Frontiers"
  ],
  "description": "Daniel Hertzberg/theispot.com Driven by customers, activist investors, governments, and their own values, companies are increasingly looking to make a more positive impact on the environment by adopting a sustainability focus. An important arena for those activities is the emerging bioeconomy, which focuses on using biological (nonfossil) resources, waste streams, and manufacturing byproducts, often combined with [&#8230;]",
  "content:encoded": "<p></p>\n<figure class=\"article-inline\">\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/11/2022_1102_Marshall_MAG_1290x860.gif\" alt=\"\" /><figcaption>\n<p class=\"attribution\">Daniel Hertzberg/theispot.com</p>\n</figcaption></figure>\n<p>Driven by customers, activist investors, governments, and their own values, companies are increasingly looking to make a more positive impact on the environment by adopting a sustainability focus. An important arena for those activities is the emerging bioeconomy, which focuses on using biological (nonfossil) resources, waste streams, and manufacturing byproducts, often combined with a circular, whole-life-cycle product perspective.</p>\n<p>This movement is enabled by new materials technologies and processes that replace fossil-based ingredients with bio-based alternatives from the agriculture, forestry, and marine industries. Circularity comes in with strategies aimed at extending the useful life of products for as long as possible and then reusing their materials and components in some way.</p>\n<p></p>\n<p>Multiple materials and technologies can replace fossil-based ingredients and components, such as packaging made from bamboo and mushrooms, cosmetics and pharmaceuticals made from seaweed and algae, and plastics made from microbes and dandelions. The global demand for plastic alone is 300 million tons per year, a figure projected to quadruple by 2050. Bioplastics made from plant-based feedstocks are a way to make a dent in the fossil-based standards.</p>\n<h3>A Decade-Plus of Experimentation</h3>\n<p>Products and processes in the bioeconomy cover wide ground. Think using bacteria to extend the shelf life of dairy products, consuming gut-health foods that reduce our reliance on antibiotics for animals and humans, and generating energy from sewage sludge — and then using the waste from <em>that</em> process to make agricultural fertilizer.</p>\n<p></p>\n<p>We are more than a decade into experimentation. Coca-Cola, for instance, introduced the first iteration of its PlantBottle in 2009, positioning the 30% bio-based plastic as a more sustainable alternative to traditional plastic. These bottles were not compostable, though, and accusations of “biowashing” followed. In response, the company has stepped up its research into 100% bio-based plastic, sourced from sugarcane and the residues of sugarcane processing, with prototypes introduced in October 2021. Coca-Cola shared its technology, first with noncompetitive brands such as Heinz ketchup and Ford Fusion hybrid cars (for the fabric interior), and then, in 2018, with competitors, to <a href=\"https://www.coca-colacompany.com/faqs/what-is-plantbottle-packaging\">scale up demand and drive down pricing</a>.</p>\n<p>Other projects are yielding a variety of market-ready products, with varying degrees of market adoption. One of the biggest circular bioeconomy success stories comes from Sardinia, Italy, where biotechnology company Novamont and chemical company Eni have transformed a former petrochemical plant into a large-scale high-tech biorefinery. The joint venture, called Matrica, processes locally grown <a href=\"https://www.bbi.europa.eu/bbi-ju-first2run-project-bioeconomies-aim-become-beating-heart-local-communities-both-rural-and\">thistle weeds into vegetable oils and then bioplastics</a> and biocide preservatives, which can be used in laundry dishwashing products. Thousands of locals who lost jobs when the petrochemical plant closed now work in the biorefinery. The thistles can be grown on poor-quality land nearby, where wheat is no longer profitable for local farmers.</p>\n<p>Many of these projects extend across borders. Swiss chemical company Clariant, a fossil-based business, began pivoting in 2009 to bio-based products generated from waste. The company developed a process it calls “sunliquid” <a href=\"https://www.clariant.com/en/Corporate/Blog/2018-Blog-Posts/03/Fueling-our-cars-with-straw\">to convert waste straw</a> from cereal production into biofuels. Clariant upskilled its workforce to make this change and completed the construction of its first commercial sunliquid cellulosic ethanol plant in October 2021, in Podari, Romania. It has licensed the technology to two projects in China as well as projects in Slovakia, Poland, and Bulgaria.</p>\n<p>Other projects are localized to take advantage of region-specific wastes and resources. In Lake Victoria, Kenya, Alisam Products uses up to 70% of the waste generated from local fish processing to make leather from fish skin and shoelaces from fish intestines, and exports its products globally. The company helps solve the problem of how to handle some of the <a href=\"https://allafrica.com/stories/202110060071.html\">150,000 metric tons of fish waste</a> generated annually in the city of Kisumu — waste that was polluting the area and causing the growth of lake weeds, which in turn were affecting water transportation and fishing.</p>\n<p>Similarly, in Ireland, Biorefinery Glas converts freshly harvested grass into feed supplements and fertilizers. Historically, grass has been the main feedstock for animal agriculture in Ireland, relying on expensive grassland management and driving down farm revenues. Using biotechnology innovations, the supplements provide higher nutritional value and increase grass’s economic value. Biorefinery Glas is a cross-sector project involving agricultural cooperatives, farmers, and research institutions.</p>\n<p></p>\n<h3>Fueling the Bioeconomy: Ways to Move Forward</h3>\n<p>Companies have an opportunity today to become providers or consumers of bio-derived products, while other stakeholders, including governments and nongovernmental organizations (NGOs), can provide the economic incentives and structural frameworks that will allow the bioeconomy to further flourish. Process regeneration technologies can have high conversion costs. Thus, financial support, particularly from governments, is imperative.</p>\n<p>Over 60 countries have begun developing coordinated bioeconomy strategies, including China, Canada, and South Africa.<a id=\"reflink1\" class=\"reflink\" href=\"#ref1\">1</a> That includes providing financing: In the European Union, for example, the public-private partnership Bio-Based Industries Joint Undertaking has invested over 3.7 billion euros ($3.7 billion) in bio-based projects.<a id=\"reflink2\" class=\"reflink\" href=\"#ref2\">2</a> South Africa’s OneBio fund, a public-private partnership, will provide 83.5 million rands ($4.8 million) to biotech startups.</p>\n<p>Manufacturing-led partnerships also need to be further nurtured. Clothing manufacturer and retailer Patagonia is known for its innovative approach to sustainability, and it’s no surprise that it has embraced the sustainable bio-circular economy, with a focus not just on sourcing but on final end state. Through its Worn Wear program, customers can get Patagonia items repaired (or learn how to repair them themselves) or receive store credit for trading in used Patagonia products that are cleaned and then resold. Patagonia was central in the establishment of the <a href=\"https://www.businessinsider.com/walmart-patagonia-sustainable-apparel-coalition-higg-index-2019-4\">Sustainable Apparel Coalition (SAC)</a> following an unexpected collaboration with Walmart in 2009. The SAC has since brought together over 250 diverse stakeholders, including brands, retailers, manufacturers, NGOs, and governments, to work to transform the apparel, footwear, and textile industries.</p>\n<p>Businesses can also take advantage of current public-private partnership opportunities, even when regulations fall behind innovation. For example, aquaculture waste — fish sludge — can be used to make a valuable bio-based fertilizer, but it currently cannot be used in the EU due to safety and hygiene restrictions. In Spain, the BETA Technology Center is working with the EU to address this gap; BETA has <a href=\"https://www.uvic.cat/en/news/the-eus-fishing-industry-produces-25-million-tonnes-of-waste-per-year-that-could-be-converted\">obtained funding</a> from the European Commission to develop a system to obtain fertilizers from fish sludge that is both safe and technically feasible.</p>\n<h3>Develop a Business Strategy for the Bioeconomy</h3>\n<p>Managers looking for business opportunities in the bioeconomy will need to monitor new materials and bio-based products coming to market, consider new sources of supply, and seek — or create — new markets for new materials or more sustainable products. They also will be required to add capabilities in terms of both skills and technologies. For most businesses, this is an evolutionary process consisting of the following four stages:</p>\n<p><strong>1. Materials innovation.</strong> A logical starting point is to explore the potential for substituting nonrenewable materials with biological analogs. Companies that see potential for themselves as producers of new bio-based materials will need employees with skills in biotechnology and chemical engineering.</p>\n<p><strong>2. Process rethinking.</strong> In this second stage, organizations consider production processes that maximize the use of raw and residual materials. An example is introducing enzymes that strengthen fibers into textile production so that fabrics last longer while also reducing the need for water and energy in the production process.</p>\n<p><strong>3. Product reinvention.</strong> Here, organizations consider production outputs that can be used for new purposes. For example, whey from cheese production has been a significant environmental pollutant when disposed of as wastewater but could instead be used to create bioplastics.</p>\n<p><strong>4. Business redesign.</strong> A fully circular, bio-based business model requires rethinking the structure and operations of the organization and its entire value chain. This involves developing relationships and building networks with new partners in other industries.</p>\n<p></p>\n<h3>Recognize Potential for Unintended Consequences</h3>\n<p>There are fundamental risks to focusing on new uses for natural products, and they need to be approached with clear eyes. Early bio-based innovations, such as using biomass for energy and fuel, led to large-scale sustainability problems, including land degradation and biodiversity loss. For example, using food staples like maize and sugarcane as feedstock for biofuel and biomass led to the ongoing “food for fuel” debate. </p>\n<p>In the United States, the shift to maize for biofuel was said to have increased its price by 70% in the 2000s.<a id=\"reflink3\" class=\"reflink\" href=\"#ref3\">3</a> It also caused problems for Indigenous populations who lost land rights, and it led to terrible working conditions for those in the biofuel industry.<a id=\"reflink4\" class=\"reflink\" href=\"#ref4\">4</a></p>\n<p>Biomass companies face criticism from NGOs such as Biofuelwatch for using first-generation wood from hardwood forests. In response, U.S. company Enviva has developed the Track & Trace Wood Supply Map, which allows the public to identify each forest used by Enviva, along with a host of other details. While Enviva still sources a significant percentage of hardwood forest, the map enables NGOs and communities to hold the company to account for its sourcing practices.</p>\n<p>Products that start with good intentions can have tricky outcomes down the line. Some bioplastics, such as compostable straws, have been criticized for being difficult to compost, contributing to the plastic waste problem and encouraging single usage by consumers. These challenges have the potential, though, to lead to next-generation improvements. Huazhong University of Science and Technology in China, for instance, has developed a bio-based straw that decomposes completely in a week when exposed to sunlight and oxygen.</p>\n<p>Another risk of entering the bioeconomy market is that assumptions underlying a business model can change. Amyris, a North American synthetic biology company, is an example of how this can play out: The company invested heavily in biofuels in the early 2000s to take advantage of rising oil prices. However, as oil prices dropped and biofuels became less competitive, the company was forced to rapidly update its business model. Amyris acted quickly, leveraging its technological knowledge to begin manufacturing bio-based chemical alternatives, and now has pivoted to personal care, with multiple bio-based skin care, makeup, and hair care brands.</p>\n<p></p>\n<p></p>\n<p>Our hope is that as organizations and, indeed, the entire bio-circular economy evolves, we will see entire industries rethink their inputs, processes, and outputs within the wider context of social and ecological sustainability. Here, we are hopeful and excited to see the emergence of new and redefined industries and, in some cases, different industry sectors coming together for the first time.</p>\n<p>A truly sustainable bio-circular economy will significantly alter company decision-making, production, consumption, and how we evaluate success. Sustainable bio-circular thinking can guide us to design products and packaging made from waste, seaweed, or plants that degrade in weeks or months rather than thousands of years. And, crucially, sustainable bio-circular thinking will lead to decision-making that considers material, product, and process innovations holistically to ensure that their net impacts are positive for business, society, and the environment. </p>\n<p></p>\n",
  "wfw:commentRss": "https://sloanreview.mit.edu/article/why-businesses-need-to-embrace-the-bioeconomy/feed/",
  "slash:comments": 0
}