{
  "title": "Space 5G Is On the Launchpad",
  "link": "https://spectrum.ieee.org/5g-satellite",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-chamber-with-a-gold-apparatus-with-many-structures-coming-off-it.jpg?id=30991831&width=2000&height=1500&coordinates=0%2C0%2C1%2C0\"/><br/><br/><p>The next generation of cellphone networks won’t just be 5G or 6G—they will be zero <em>g</em>. In April, <a href=\"https://lynk.world/lynk-announces-successful-deployment-of-worlds-first-commercial-ready-cell-tower-in-space\" rel=\"noopener noreferrer\" target=\"_blank\">Lynk Global launched the first direct-to-mobile commercial satellite</a>, and on 15 August a competitor, AST SpaceMobile, <a href=\"https://ast-science.com/2022/08/03/ast-spacemobile-to-provide-quarterly-business-update/\" rel=\"noopener noreferrer\" target=\"_blank\">confirmed plans to launch</a> an experimental direct-to-mobile satellite of its own in mid-September. Inmarsat and <a href=\"https://www.qualcomm.com/news/releases/2022/07/ericsson--qualcomm-and-thales-to-take-5g-into-space?mkt_tok=Mzg1LVRXUy04MDMAAAGFixVm3yjIiJQD4N11E1p1c7Znm0qMzA2ISDZYLC7tBdq9LFmz_vMMNDO2RNpu-tnbiIat6mzlM0wMmdFA-duWoOvoMqYswlpvlYgLo5xC6nwxug\" rel=\"noopener noreferrer\" target=\"_blank\">other companies</a> are <a href=\"https://www.fiercewireless.com/5g/inmarsat-combines-satellite-and-5g-for-new-type-network\" rel=\"noopener noreferrer\" target=\"_blank\">working on their own low Earth orbit (LEO) cellular solutions</a> as launch prices drop, satellite fabrication methods improve, and telecoms engineers push new network capabilities.</p><p>LEO satellite systems such as SpaceX’s <a href=\"https://spectrum.ieee.org/spacex-starlink-dish-network\" target=\"_self\">Starlink</a> and Amazon’s <a href=\"https://spectrum.ieee.org/amazons-project-kuiper-is-more-than-the-companys-response-to-spacex\" target=\"_self\">Kuiper</a> envision huge constellations of satellites. However, the U.S. Federal Communications Commission just rejected SpaceX’s application for some of the US $9 billion federal rural broadband fund—in part because the Starlink system requires a $600 ground station. Space-based cell service would not require special equipment, making it <a href=\"https://www.fiercewireless.com/tech/industry-voices-rysavy-solving-wireless-riddle-for-rural-broadband\" rel=\"noopener noreferrer\" target=\"_blank\">a potential candidate for rural broadband funds</a> if companies can develop solutions to the many challenges that face satellite-based smartphone service.</p><p>“The main challenge is the link budget,” says electrical engineer <a href=\"https://sites.google.com/view/symeonchatzinotas\" rel=\"noopener noreferrer\" target=\"_blank\">Symeon Chatzinotas</a> of the University of Luxembourg, referring to the amount of power required to transmit and receive data between satellites and connected devices. “Sending signals to smartphones outdoors could be feasible by using low Earth orbit satellites with sizable antennas in the sky. However, receiving info would be even more challenging since the smartphone antennas usually disperse their energy in all directions.” </p><p class=\"pull-quote\">“Network architectures are diverging. On the one hand, small cells are replacing Wi-Fi. On the other hand [telecom operators] are going to satellite-based systems with very wide coverage.”<br/>—Derek Long, Cambridge Consultants</p><p>The typical distance from a phone to an LEO satellite might be 500 kilometers, at least two orders of magnitude more than typical signal-transmission distances in urban settings, so the dispersion of the phone’s power would be at least eight times greater, and would be further complicated by the phone’s orientation. It is unlikely that a satellite-smartphone connection would work well when the handset is inside a building, for example.</p><p>Lynk Global’s initial offering, which it predicts will be available in late 2022, is narrowband—meaning limited voice calls, texting, and Internet of Things (IoT) traffic. That might not allow plutocrats to make 4K video calls from their ocean-faring yachts, but it would be enough for ship insurance companies or rescue services to remain in contact with vessels in places where they couldn’t be reached before, using off-the-shelf cellular devices. AST SpaceMobile’s is aiming for 4G and 5G broadband service for mobiles.</p><p>AST satellites will use a phased-array antenna, which consists of many antennas fanned out around the satellite. Each portion of the antenna will transmit within a well-defined cone terminating at the Earth’s surface; that will be the space-to-Earth equivalent of a cell originating from a single ground base station. The company plans for an initial fleet of 20 satellites to cover the equator and help fund the launch of subsequent satellites providing more global coverage.</p><p>The size of the coverage zone on the ground should exceed the limited size of those created by <a href=\"https://spectrum.ieee.org/why-did-alphabets-loon-fail-to-bring-internet-to-the-world\" target=\"_self\">Alphabet’s failed balloon-based Project Loon</a>. Broader coverage areas should allow AST to serve more potential customers with the same number of antennas. The low Earth orbit AST is experimenting with yields round-trip signal travel times of around 25 milliseconds or less, an order of magnitude faster than is the case for higher-orbit geostationary satellites that have provided satellite telephony until now.</p><p>Plenty of behind-the-scenes technical work remains. The relatively high speed of LEO satellites will also <a href=\"https://ieeexplore.ieee.org/document/9658559\" rel=\"noopener noreferrer\" target=\"_blank\">cause a Doppler shift in the signals for which the network will have to compensate</a>, according to a recent review in <em>IEEE Access</em>. New protocols for handoffs between satellites and terrestrial towers will also have to be created so that an active call can be carried from one cell to the next.</p><p>The international telecoms standards group <a href=\"https://www.ericsson.com/en/reports-and-papers/ericsson-technology-review/articles/5g-evolution-toward-5g-advanced\" rel=\"noopener noreferrer\" target=\"_blank\">3GPP began providing guidelines for so-called nonterrestrial networks</a> in March in the 17th iteration of its cellular standards. “Nonterrestrial networks” refers not just to LEO satellites but also high-altitude platforms such as drones or balloons. Nonterrestrial networks will need further updates to 3GPP’s standards to accommodate their new network architecture, such as the longer distances between cell base stations and devices. </p><p>For example, <a href=\"https://www.stratosphericplatforms.com/news/world-first-5g-transmission/\" rel=\"noopener noreferrer\" target=\"_blank\">Stratospheric Platforms</a> earlier this year tested a drone-based network prototype that would fly at altitudes greater than 18,000 meters. Its behavior as part of a 5G network will differ from that of a Lynk Global or AST satellite.</p><p>“Network architectures are diverging. On the one hand, small cells are replacing Wi-Fi. On the other hand [telecom operators] are going to satellite-based systems with very wide coverage. In the middle, traditional macrocells, which are kind of difficult economically, are being squeezed,” says <a href=\"https://uk.linkedin.com/in/derek-long-65a2b4\" rel=\"noopener noreferrer\" target=\"_blank\">Derek Long, head of telecommunications at Cambridge Consultants</a>. The company has advised Stratospheric Platforms and other companies working on nonterrestrial networks.</p><p>If telecom operators succeed, users won’t even notice their space-age smartphone networks. </p><p>“When you buy a phone, you expect it to work. Not just where someone says it will work, but everywhere. This is a step toward making that a possibility,” Long says. </p>",
  "pubDate": "Thu, 18 Aug 2022 17:53:00 +0000",
  "guid": "https://spectrum.ieee.org/5g-satellite",
  "category": [
    "Satellites",
    "Spacex",
    "Kuiper",
    "Telecommunications",
    "Cellphones"
  ],
  "dc:creator": "Lucas Laursen",
  "media:content": ""
}