{
  "id": "yt:video:SH9r94NkZpE",
  "yt:videoId": "SH9r94NkZpE",
  "yt:channelId": "UCMOqf8ab-42UUQIdVoKwjlQ",
  "title": "What Really Happened During the Yellowstone Park Flood?",
  "link": "",
  "author": {
    "name": "Practical Engineering",
    "uri": "https://www.youtube.com/channel/UCMOqf8ab-42UUQIdVoKwjlQ"
  },
  "published": "2022-08-16T12:30:14+00:00",
  "updated": "2022-09-09T23:21:32+00:00",
  "media:group": {
    "media:title": "What Really Happened During the Yellowstone Park Flood?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "An overview of the 2022 Montana flooding and what's next for Yellowstone National Park.\n📅 Sign up for 80,000 Hours for help finding an impactful and rewarding career today: https://www.80000hours.org/practicalengineering\n\nErrata: At 8:53, the bridge shown in the photo is the Gardner River Bridge, not the Yellowstone River Bridge slated for replacement.\n\nIn June of 2022, many tourists and residents of the Yellowstone National Park area found themselves at ground zero of a natural disaster. Torrential rainfall in Wyoming and Montana brought widespread flooding to the streams and rivers that flow through this treasured landscape and beyond. How will the National Park Service Rebuild? Hasty engineering of large infrastructure can be extremely damaging to natural systems like those in Yellowstone, and you don’t want to invest millions of dollars into repairs that might be subject to similar flooding in the future. After all, we build parks (and roads to parks) to get closer to the natural environment and all its wildness, and there’s almost nothing more natural or wild than a flood.\n\nPractical Engineering is a YouTube channel about infrastructure and the human-made world around us. It is hosted, written, and produced by Grady Hillhouse. We have new videos posted regularly, so please subscribe for updates. If you enjoyed the video, hit that ‘like’ button, give us a comment, or watch another of our videos!\n\nCONNECT WITH ME\n____________________________________\nWebsite:         http://practical.engineering\nTwitter:           https://twitter.com/HillhouseGrady\nInstagram:     https://www.instagram.com/practicalengineering\nReddit:            https://www.reddit.com/r/PracticalEngineering\nFacebook:      https://www.facebook.com/PracticalEngineerGrady​\nPatreon:         http://patreon.com/PracticalEngineering\n\nSPONSORSHIP INQUIRIES\n____________________________________\nPlease email my agent at practicalengineering@standard.tv\n\nDISCLAIMER\n____________________________________\nThis is not engineering advice. Everything here is for informational and entertainment purposes only. Contact an engineer licensed to practice in your area if you need professional advice or services. All non-licensed clips used for fair use commentary, criticism, and educational purposes.\n\nSPECIAL THANKS\n____________________________________\nThis video is sponsored by 80000 Hours.\nStock video and imagery provided by Getty Images.\nMusic by Epidemic Sound: http://epidemicsound.com/creator\nTonic and Energy by Elexive is licensed under a Creative Commons Attribution License\nSource: https://www.youtube.com/watch?v=U6fBPdu8w9U\nProducer/Writer/Host: Grady Hillhouse\nEditor/Production Assistant: Wesley Crump\nScript Editor: Ralph Crewe\nIntern: Myles Jonas ¯\\_(ツ)_/¯\nBackground Painting: Josh Welker",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}