{
  "title": "Episode 65: &#8220;Maybe&#8221; by the Chantels",
  "link": "https://500songs.com/podcast/episode-65-maybe-by-the-chantels/",
  "pubDate": "Mon, 13 Jan 2020 18:09:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=536",
  "description": "Episode sixty-five of A History of Rock Music in Five Hundred Songs looks at \"Maybe\" by the Chantels, and covers child stardom, hymns in Latin, and how to get discovered twice in one day. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/33115061\"> on \"Don't You Just Know It\" by Huey \"Piano\" Smith and the Clowns</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-65-maybe/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThe only book actually about the Chantels is barely a book -- <a href=\"https://amzn.to/2R8P2ZE\"><em>Maybe</em>, Renee Minus White's self-published memoir</a>, is more of a pamphlet, and it only manages even to get to that length with a ton of padding -- things like her fruit cake recipe. Don't expect much insight from this one.\n\nA big chunk of the outline of the story comes from<a href=\"https://amzn.to/386bucz\"> <em>Girl Groups; Fabulous Females Who Rocked the World</em> by John Clemente</a>, which has  a chapter on the Chantels.\n\n<a href=\"http://classicurbanharmony.net/wp-content/uploads/2016/02/Richard-Barretts-Musical-Legacy-Part-3-The-Chantels-Clickettes-Fashions-Veneers.pdf\">This article on Richie Barrett's career</a> filled in much of the detail.\n\nMy opinions of George Goldner come mostly from reading two books -- <a href=\"https://amzn.to/2SY9jkw\"><em>Hound Dog: The Leiber and Stoller Autobiography</em> by Jerry Leiber, Mike Stoller, and David Ritz</a>, which talks about Leiber and Stoller's attempts to go into business with Goldner, and <a href=\"https://amzn.to/2tTljfq\"><em>Godfather of the Music Business: Morris Levy</em> by Richard Carlin</a>.\n\nThere are innumerable collections of the small number of recordings the Chantels released -- <a href=\"https://amzn.to/2Tf69vA\">this one</a> is as good as any.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?\n\n<strong>ERRATUM:</strong> I refer to “Summer Love” rather than “Summer's Love”\n\n<strong>Transcript</strong>\n\nWe've already seen one girl group, when we looked at “Mr Lee” by the Bobbettes, but already within a few months of the Bobbettes' breakout hit, other groups were making waves with the public.\n\nThe Chantels were one such group, and one of the best. They were pretty much exact contemporaries of the Bobbettes – so much so that when the Bobbettes were forming, they decided against calling themselves the Chanels, because it would be too similar. The Chantels, too, changed their name early on. They were formed by a group of girls at a Catholic school – St Anthony of Padua school in the Bronx – and were originally named “the Crystals”, but they found that another group in the area had already named themselves that, and so they changed it. (This other group was not the same one as the famous Crystals, who didn't form until 1961). They decided to name themselves after St Francis de Chantal after their school won a basketball game against St. Francis de Chantal school – when they discovered that the Chantal in the saint's name was from the same root as the French word for singing, it seemed to be too perfect for them.\n\nOriginally there were around a dozen members of the group, but they slowly whittled themselves down to five girls, between the ages of fourteen and seventeen – Arlene Smith, Lois Harris, Sonia Goring, Jackie Landry, and Renee Minus. According to Renee (who now goes by her married name Renee Minus White) the group's name came from a brainstorming session between her, Lois, Jackie, and Sonia, with Arlene agreeing to it later – this may, though, have more to do with ongoing disputes between Arlene and the other group members than with what actually happened.\n\nThey were drawn together by their mutual love of R&B vocal groups – a particular favourite record of theirs was “In Paradise” by the Cookies, a New York-based girl group who had started recording a few years earlier, and whose records were produced by Jesse Stone, but who wouldn't have any major chart successes for several years yet:\n\n[Excerpt: The Cookies, \"In Paradise\"]\n\nSo they were R&B singers, but the fact that these were Catholic schoolgirls, specifically, points to something about the way their music developed, and about early rock and roll more generally.\n\nWe've talked about the influence of religious music on rock and roll before, but the type of religious music that had influenced it up until this point had generally come from two sources – either the black gospel music that was created by and for worshippers in African-American Pentecostal denominations, or the euphemistically-named “Southern Gospel” that is usually made by white Pentecostals, and by Southern Baptists.\n\nThese denominations, in 2020, have a certain amount of institutional power – especially the Southern Baptists, who are now one of the most important power blocs within the Republican Party. But in the 1950s, those were the churches of the poorest, most despised, people. By geography, class, and race, the people who attended those churches were overwhelmingly those who would be looked down on by the people who had actual power in the USA. The churches that people with power overwhelmingly went to at the time were those which had been established in Western Europe – the so-called mainline Protestant churches – and, to a lesser extent, the Catholic Church. The music of those churches had very little influence on rock and roll.\n\nIt makes sense that this would be the case – obviously underprivileged people's music would be influenced by the churches that underprivileged people went to, rather than the ones that privileged people attended, and rock and roll was, at this point, still a music made almost solely by people who were underprivileged on one or more axis – but it's still worth pointing out, because for the first time we're going to look at a group who – while they were also underprivileged, being black – were influenced by Catholic liturgical music, rather than gospel or spiritual music.\n\nBecause there's always been a geographical variation, as well as one based on class and race, in what religions dominate in the US. While evangelical churches predominate in the southern states, in the North-East there were, especially at the time we're talking about, far more mainline Protestants, Catholics, and Jewish people.\n\nThe Chantels were a New York group, and it's notable that New York groups were far more likely to have been influenced by Catholic or Episcopalian liturgical music, and choral music in general, than vocal groups from other areas. This may go some way towards explaining Johnny Otis' observation that all the LA vocal groups he knew had pitching problems, while the New York groups could sing in tune – choir practice may have made the New York groups more technically adept (though to my own ears, the New York groups tend to make much less interesting music than the LA groups).\n\nCertainly when it comes to the Chantels, the girls had all sung in the choir, and had been taught to read music and play the piano, although a couple of them had eventually been kicked out of the choir for singing “that skip and jump music”, as the nuns referred to rock and roll.\n\nIndeed, at their very first appearance at the Apollo, after getting a record contract, one of the two songs they performed was a Catholic hymn, in Latin - “Terra Tremuit”. That piece remains in the group's repertoire to this day, and while they've never formally recorded it, there are videos on YouTube of them performing it:\n\n[Excerpt: The Chantels, \"Terra Tremuit\", soundcheck recording]\n\nThe story of how the Chantels were discovered, as it's usually told, is one that leaves one asking more questions than it answers. The group were walking down the street, when they passed a rehearsal room. A young man spotted them on the street and asked them if they were singers, since they were dressed identically. When they said “yes”, he took them up to a rehearsal studio to hear them.\n\nThe rehearsal studio happened to be in the Brill Building. We've not mentioned the Brill Building so far, because we're only just getting to the point where it started to have an impact on rock and roll music, but it was a building on Broadway – 1619 Broadway to be exact – which was the home of dozens, even hundreds at times, of music publishers, record labels, and talent agencies. There were a few other nearby buildings, most notably 1650 Broadway, which became the home of Aldon Music, which often get lumped in with the Brill Building when most people talk about it, and when I refer to the Brill Building in future episodes I'll be referring to the whole ecosystem of music industries that sprang up on Broadway in the fifties and early sixties.\n\nBut in this case, they were invited into the main Brill Building itself. They weren't just being invited into some random room, but into the heart of the music industry on the East Coast of America. This was the kind of thing that normally only happens in films – and relatively unrealistic films at that.\n\nSo far, so cliched, though it's hard to believe that that kind of thing ever really happened. But then something happened that isn't in any of the cliches – the girls noticed, through the window, that three members of the Valentines, one of their favourite groups, were walking past.\n\nWe've mentioned the Valentines a few months ago, when talking about Frankie Lymon and the Teenagers, and we talked about how Richie Barrett, as well as being a singer and songwriter in the group, was also a talent scout for George Goldner's record labels.\n\nThe Valentines had released several records, but none of them had had anything but local success, though records like “The Woo Woo Train” have since become cult favourites among lovers of 1950s vocal group music:\n\n[Excerpt: The Valentines, \"The Woo Woo Train\"]\n\nThe girls loved the Valentines, and they also knew that Barrett was important in the industry. They decided to run out of the rehearsal room and accost the group members. They told Richie Barrett that they were a singing group, and when he didn't believe them, they burst into song, singing what would later become the B-side of their first record, “The Plea”:\n\n[Excerpt: The Chantels, \"The Plea\"]\n\nThat song was one they'd written themselves, sort of. It was actually based on a song that a group of boys they knew, who sang in a street-corner group, had made up. That song had been called “Baby”, but the Chantels had taken it and reworked it into their own song. The version that they finally recorded, which we just heard, was further revamped by Barrett.\n\nBarrett was impressed, and said he'd be in touch. But then he never bothered to get in contact with them again, until Jackie Landry managed to obtain his home address and get in touch with him. She got the address through a friend of hers, a member of the Teenchords, a vocal group fronted by Frankie Lymon's brother Lewis, who recorded for one of George Goldner's labels, releasing tracks like “Your Last Chance”:\n\n[Excerpt: Lewis Lymon and the Teenchords, \"Your Last Chance\"]\n\nThey tracked down Barrett, and he agreed to try to get them signed to a record deal.\n\nThat story has many, many, problems, and frankly doesn't make any kind of sense, but it's the accepted history you'll find in books that deal with the group. According to Renee Minus White's autobiography, though, each of the girls has a different recollection of how they first met Barrett – in her version, they simply waited at the stage door to get autographs, and told him they were a singing group. My guess is that the accepted story is an attempt to reconcile a bunch of irreconcilable versions of the story.\n\nWhatever the true facts as to how they started to work with Richie Barrett, the important thing is that they did end up working with him. Barrett was impressed by their ability not just to sing the “oohs” and “aahs”, but the complex polyphonic parts that they sang in choir.\n\nFor the most part, doo-wop groups either sang simple block chords behind a lead singer, or they all sang their own moving parts that worked more or less in isolation – the bass singer would sing his part, the falsetto singer his, and so on. I say “his” because pretty much all doo-wop groups at this point were male. They were all singing the same song, but doing their own thing.\n\nThe Chantels were different – they were singing block harmonies, but they weren't singing simple chords, but interlocking moving lines. What they were doing ended up being closer to the so-called \"modern harmony\" of jazz vocal groups like the Four Freshmen:\n\n[Excerpt: The Four Freshmen, \"It's a Blue World\"]\n\nBut where other groups singing in that style had no R&B background, the Chantels were able to sing a rhythm and blues song with the best of them.\n\nBarrett signed the group to End Records, one of George Goldner's stable of record labels. But before recording them, he spent weeks rehearsing them, and teaching them how to perform on stage.\n\nThe first record they made, when they finally went into the studio, was a song primarily written by Arlene Smith, who also sang lead, though the composition is credited to the girls as a group. And listening to it, you have in this record for the first time the crystallisation of the girl-group sound, the sound that would later become a hallmark of people like Phil Spector.\n\n[Excerpt: The Chantels, \"He's Gone\"]\n\nIt's a song about adolescent anguish, written by and for adolescents, and it has a drama and angst to it that none of the other records by girl groups had had before – it's obviously inspired by groups like the Penguins and the Platters, but there's a near-hysteria to the performance that hadn't really been heard before. That strained longing is something that would appear in almost every girl-group record of the early sixties, and you can hear very clear echoes of the Chantels in records by people like the Ronettes, the Crystals, and the Shangri-Las. It's a far cry from “Mr. Lee”.\n\nMost of the time, when people talk about the Chantels' vocals, they – rightly – draw attention to Arlene Smith's leads, which are astonishing. But listen to the a capella intro, which is repeated as the outro, and you can hear those choir-trained voices – this was a vocal group, not just a singer and some cooing background vocalists:\n\n[Excerpt: the Chantels, \"He's Gone\"]\n\nAs well as being pioneers in the girl-group sound, the Chantels were also one of the first self-contained vocal groups to play their own instruments on stage. This was not something that they did at first, but something that Barrett encouraged them to do. Some of them had instrumental training already, and those who didn't were taught how to play by Barrett. Sonia and Jackie played guitar, Arlene bass, Lois piano, and Renee the drums. They even, according to Renee's autobiography, recorded an instrumental by themselves, called “The Chantels' Rock”.\n\nAlmost immediately, the girls were pulled out of Catholic school and instead sent to Quintano’s School for Young Professionals, the same school that the Teenagers went to, which was set up to accommodate children who had to go on tour. But there was one exception. Lois' mother would not let her transfer schools, or go on tour with the group. She could sing with them in the studio, and when they were performing in New York, but until she graduated high school that was all.\n\nIn many ways her mother was right to be worried, or at least Richie Barrett believed she had good reason to be. They started touring as soon as “He's Gone” came out, but the girls, at the time, resented Barrett, who came along on tour with them, because he would lock them in the dressing rooms and only let them out for the show itself, not allowing them to socialise with the other acts.\n\nIn retrospect, given that they were girls in their teens, and they were touring with large numbers of male musicians, many of them with reputations as sexual predators, Barrett's protectiveness (and his apparent threats to several of these men) was probably justified.\n\nFor example, in early 1958, the girls were sent out on a tour that became legendary – and given its lineup it's easy to see why. As well as the Chantels, the tour had Frankie Lymon, Danny & the Juniors, the Diamonds, Screamin' Jay Hawkins, Larry Williams, Buddy Holly, and as alternating headliners Jerry Lee Lewis and Chuck Berry. We'll talk more about that tour in the next couple of episodes, but aside from the undoubted musical quality of the performers, that was simply not a group of people who young women were going to be safe around (though several of the individuals there were harmless enough). One could, of course, argue that young girls shouldn't be put in that situation at all, but that never seems to have occurred to anyone involved.\n\nBy the time of that tour, they'd recorded what would become by far their biggest hit, their second single, “Maybe”:\n\n[Excerpt: The Chantels, \"Maybe\"]\n\n“Maybe” was a song that was originally co-credited to George Goldner and an unknown “Casey”, but for which Richie Barrett later sued and won co-writing credit. Barrett was presumably the sole writer, though some have claimed that Arlene Smith was an uncredited co-writer – something the other Chantels deny.\n\nIt was very much in the mould of “He's Gone”, and concentrated even more on Smith's lead vocal, and that lead vocal took an immense amount of work to obtain. In total they recorded fifty-two takes of the song before they got one that sounded right, and Smith was crying in frustration when she recorded the last take.\n\n“Maybe” reached number fifteen on the pop charts, and number two on the R&B charts, and it became a classic that has been covered by everyone from Janis Joplin to the Three Degrees.\n\nThe group's next two records, “Every Night (I Pray)” and “I Love You So”, both charted as well, though neither of them was a massive hit in the way that “Maybe” was. But after this point, the hits dried up – something that wasn't helped by the fact that George Goldner went through a phase of having his artists perform old standards, which didn't really suit the Chantels' voices.\n\nBut they'd had four hit records in a row, which was enough for them to get an album released. The album, which just featured the A- and B-sides of their first six singles, was originally released with a photo of the group on the front. That version was quickly withdrawn and replaced with a stock image of two white teenagers at a jukebox, just in case you've forgotten how appallingly racist the music industry was at this point.\n\nThey continued releasing singles, but they were also increasingly being used as backing vocalists for other artists produced by Barrett. He had them backing Jimmy Pemberton on “Rags to Riches”:\n\n[Excerpt: Jimmy Pemberton, “Rags to Riches”]\n\nAnd they also backed Barrett himself on \"Summer Love\", which got to the lower reaches of the top one hundred in pop, and made the top thirty in the R&B charts:\n\n[Excerpt: Richie Barrett and the Chantels, “Summer Love”]\n\nThere had also been some attempts to give Arlene a separate career outside the Chantels, as she duetted with Willie Wilson on “I've Lied”:\n\n[Excerpt: Willie Wilson and the Tunemasters, \"I've Lied\"]\n\nUnfortunately, after a year of success followed by another year of comparative failure, the group discovered that their career was at an end, thanks to George Goldner.\n\nWe've talked about Goldner before, most significantly in the episode on “Why Do Fools Fall in Love?”, but he had an almost unique combination of strong points and flaws as a record executive.\n\nHis strongest point was his musical taste. Nobody who knew him respected his taste, but everyone respected his ability to pick a hit, and both of these things sprang from the same basic reason – he had exactly the same musical tastes as a typical teenage girl from the period.\n\nNow, it's an unfortunate fact that the tastes of teenage girls are looked down upon by almost anyone with any power in the music industry, because of the almost universal misogyny in the industry, but the fact remains that teenage girls were becoming a powerful demographic as customers, and anyone who could accurately predict the music that they were going to buy would have a tremendous advantage when it came to making money in the music industry.\n\nAnd Goldner definitely made himself enough money over the years, because he engaged in all the usual practices of ripping off his artists – who were, very often, teenagers themselves. He would credit himself as the writer of their songs, he would engage in shady accounting practices, and all the rest.\n\nBut Goldner's real problem was his gambling addiction, and so there's a pattern that happens over and again throughout the fifties and sixties. Goldner starts up a new record label, discovers some teenage and/or black act, and makes them into overnight stars. Goldner then starts getting vast amounts of money, because he's ripping off his new discoveries. Goldner starts gambling with that money, loses badly, gets into debt with the mob, and goes to Morris Levy for a loan in order to keep his business going. Levy and his Mafia friends end up taking over the whole company, in exchange for writing off the debts. Levy replaces Goldner's writing credits on the hits with his own name, stops paying the artists anything at all, and collects all the money from the hits for the rest of his life, while Goldner is left with nothing and goes off to find another bunch of teenagers.\n\nAnd so End Records met the same fate as all of Goldner's other labels. It went bankrupt, and closed down, owing the Chantels a great deal of money.\n\nAfter End records closed, the Chantels wanted to carry on – but Arlene Smith decided she wanted to go solo instead. She recorded a couple of singles with a new producer, Phil Spector:\n\n[Excerpt: Arlene Smith, \"Love, Love, Love\"]\n\nAnd she also recorded another single with Richie Barrett as producer:\n\n[Excerpt: Arlene Smith, \"Everything\"]\n\nAt first, that looked like it would be the end of the Chantels, but then a year or so later Richie Barrett got back in touch with the girls. He had some ideas for records that would use the Chantels sound. By this point, Lois had decided that she was going to retire from the music business, but Jackie, Renee, and Sonia agreed to restart their career. There was a problem, though – they weren't sure what to do without their lead singer. Barrett told them he would sort it out for them.\n\nBarrett had been working with another girl group, the Veneers, for a couple of years. They'd released a few singles on Goldner-owned labels, like “Believe Me (My Angel)”:\n\n[Excerpt: The Veneers, \"Believe Me (My Angel)\"]\n\nAnd they'd also been the regular backing group Barrett used for sessions for male vocalists like Titus Turner:\n\n[Excerpt: Titus Turner, \"The Return of Stagolee\"]\n\nBut they'd never had a huge amount of success. So Barrett got their lead singer, Annette Swinson, to replace Arlene. To make it up to the Veneers, he got the rest of them a job as Jackie Wilson's backing vocalists.\n\nHe changed Annette's name to Annette Smith, and the new lineup of the group had a few more hits, with “Look in My Eyes”, which went to number six on the R&B charts and number fourteen on the pop charts:\n\n[Excerpt: The Chantels, \"Look in My Eyes\"]\n\nThey also backed Richie Barrett on an answer record to Ray Charles' “Hit the Road Jack”, titled “Well I Told You”, which made the top thirty on the pop charts:\n\n[Excerpt: Richie Barrett and the Chantels, \"Well I Told You\"]\n\nThis second phase of the Chantels' career was successful enough that Goldner, who no longer had the girls under contract, got one of his record labels to put out a new Chantels album, featuring a few tracks he owned by them that hadn't been on their first album. To fill out the album, and make it sound more like the current group, he also took a few of the Veneers' singles and stuck them on it under the Chantels' name.\n\nAnnette would stay with the group for a while, but the sixties saw several lineup changes, as the group stopped having chart successes, and members temporarily dropped out to have children or pursue careers. However, Sonia and Renee remained in place throughout, as the two constant members of the group (though Sonia also moonlit for a while in the sixties with another group Richie Barrett was looking after at the time, the Three Degrees).\n\nBy the mid-nineties, they had reformed with all of the original members except Arlene, who was replaced by Ami Ortiz, who can do a very creditable imitation of Arlene's lead vocals. Sadly Jackie Landry died in 1997, but the other four continued to tour, though only intermittently in between holding down day jobs.\n\nAlmost uniquely, the Chantels are still touring with the majority of their original members. Sonia Goring Wilson, Renee Minus White, and Lois Harris Powell still tour with the group, and they have several tour dates booked in for 2020, mostly on the east coast of the US. Arlene Smith spent many years touring solo and performing with her own rival “Chantels” group. She has very occasionally reunited with the rest of the Chantels for one-off performances, but there appears to be bad blood between them. She kept performing into the middle of the last decade, and as of 2018, her Facebook page said she was planning a comeback, but no further details have emerged.\n\nThe Chantels never received either the money or the acclaim that they deserved, given their run of chart successes and the way that they pioneered the girl group sound. But more than sixty years on from their biggest hits, four of the five of them are still alive, and apparently healthy, happy, and performing when the opportunity arises, and three of them are still good friends. Given the careers of most other stars of the era, especially the other child stars, that's as close to a happy ending as a group gets.",
  "itunes:subtitle": "Episode sixty-five of A History of Rock Music in Five Hundred Songs looks at Maybe by the Chantels, and covers child stardom, hymns in Latin, and how to get discovered twice in one day. Click the full post to read liner notes, links to more information, ",
  "itunes:keywords": "Alan Freed,Brill Building,doo wop,End Records,George Goldner,girl groups,lawsuits,Morris Levy,Richie Barrett,The Chantels,the Valentines,vocal groups",
  "itunes:episodeType": "full",
  "itunes:episode": 65,
  "content:encoded": "Episode sixty-five of A History of Rock Music in Five Hundred Songs looks at \"Maybe\" by the Chantels, and covers child stardom, hymns in Latin, and how to get discovered twice in one day. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/33115061\"> on \"Don't You Just Know It\" by Huey \"Piano\" Smith and the Clowns</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-65-maybe/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThe only book actually about the Chantels is barely a book -- <a href=\"https://amzn.to/2R8P2ZE\"><em>Maybe</em>, Renee Minus White's self-published memoir</a>, is more of a pamphlet, and it only manages even to get to that length with a ton of padding -- things like her fruit cake recipe. Don't expect much insight from this one.\n\nA big chunk of the outline of the story comes from<a href=\"https://amzn.to/386bucz\"> <em>Girl Groups; Fabulous Females Who Rocked the World</em> by John Clemente</a>, which has  a chapter on the Chantels.\n\n<a href=\"http://classicurbanharmony.net/wp-content/uploads/2016/02/Richard-Barretts-Musical-Legacy-Part-3-The-Chantels-Clickettes-Fashions-Veneers.pdf\">This article on Richie Barrett's career</a> filled in much of the detail.\n\nMy opinions of George Goldner come mostly from reading two books -- <a href=\"https://amzn.to/2SY9jkw\"><em>Hound Dog: The Leiber and Stoller Autobiography</em> by Jerry Leiber, Mike Stoller, and David Ritz</a>, which talks about Leiber and Stoller's attempts to go into business with Goldner, and <a href=\"https://amzn.to/2tTljfq\"><em>Godfather of the Music Business: Morris Levy</em> by Richard Carlin</a>.\n\nThere are innumerable collections of the small number of recordings the Chantels released -- <a href=\"https://amzn.to/2Tf69vA\">this one</a> is as good as any.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?\n\n<strong>ERRATUM:</strong> I refer to “Summer Love” rather than “Summer's Love”\n\n<strong>Transcript</strong>\n\nWe've already seen one girl group, when we looked at “Mr Lee” by the Bobbettes, but already within a few months of the Bobbettes' breakout hit, other groups were making waves with the public.\n\nThe Chantels were one such group, and one of the best. They were pretty much exact contemporaries of the Bobbettes – so much so that when the Bobbettes were forming, they decided against calling themselves the Chanels, because it would be too similar. The Chantels, too, changed their name early on. They were formed by a group of girls at a Catholic school – St Anthony of Padua school in the Bronx – and were originally named “the Crystals”, but they found that another group in the area had already named themselves that, and so they changed it. (This other group was not the same one as the famous Crystals, who didn't form until 1961). They decided to name themselves after St Francis de Chantal after their school won a basketball game against St. Francis de Chantal school – when they discovered that the Chantal in the saint's name was from the same root as the French word for singing, it seemed to be too perfect for them.\n\nOriginally there were around a dozen members of the group, but they slowly whittled themselves down to five girls, between the ages of fourteen and seventeen – Arlene Smith, Lois Harris, Sonia Goring, Jackie Landry, and Renee Minus. According to Renee (who now goes by her married name Renee Minus White) the group's name came from a brainstorming session between her, Lois, Jackie, and Sonia, with Arlene agreeing to it later – this may, though, have more to do with ongoing disputes between Arlene and the other group members than with what actually happened.\n\nThey were drawn together by their mutual love of R&B vocal groups – a particular favourite record of theirs was “In Paradise” by the Cookies, a New York-based girl group who had started recording a few years earlier, and whose records were produced by Jesse Stone, but who wouldn't have any major chart successes for several years yet:\n\n[Excerpt: The Cookies, \"In Paradise\"]\n\nSo they were R&B singers, but the fact that these were Catholic schoolgirls, specifically, points to something about the way their music developed, and about early rock and roll more generally.\n\nWe've talked about the influence of religious music on rock and roll before, but the type of religious music that had influenced it up until this point had generally come from two sources – either the black gospel music that was created by and for worshippers in African-American Pentecostal denominations, or the euphemistically-named “Southern Gospel” that is usually made by white Pentecostals, and by Southern Baptists.\n\nThese denominations, in 2020, have a certain amount of institutional power – especially the Southern Baptists, who are now one of the most important power blocs within the Republican Party. But in the 1950s, those were the churches of the poorest, most despised, people. By geography, class, and race, the people who attended those churches were overwhelmingly those who would be looked down on by the people who had actual power in the USA. The churches that people with power overwhelmingly went to at the time were those which had been established in Western Europe – the so-called mainline Protestant churches – and, to a lesser extent, the Catholic Church. The music of those churches had very little influence on rock and roll.\n\nIt makes sense that this would be the case – obviously underprivileged people's music would be influenced by the churches that underprivileged people went to, rather than the ones that privileged people attended, and rock and roll was, at this point, still a music made almost solely by people who were underprivileged on one or more axis – but it's still worth pointing out, because for the first time we're going to look at a group who – while they were also underprivileged, being black – were influenced by Catholic liturgical music, rather than gospel or spiritual music.\n\nBecause there's always been a geographical variation, as well as one based on class and race, in what religions dominate in the US. While evangelical churches predominate in the southern states, in the North-East there were, especially at the time we're talking about, far more mainline Protestants, Catholics, and Jewish people.\n\nThe Chantels were a New York group, and it's notable that New York groups were far more likely to have been influenced by Catholic or Episcopalian liturgical music, and choral music in general, than vocal groups from other areas. This may go some way towards explaining Johnny Otis' observation that all the LA vocal groups he knew had pitching problems, while the New York groups could sing in tune – choir practice may have made the New York groups more technically adept (though to my own ears, the New York groups tend to make much less interesting music than the LA groups).\n\nCertainly when it comes to the Chantels, the girls had all sung in the choir, and had been taught to read music and play the piano, although a couple of them had eventually been kicked out of the choir for singing “that skip and jump music”, as the nuns referred to rock and roll.\n\nIndeed, at their very first appearance at the Apollo, after getting a record contract, one of the two songs they performed was a Catholic hymn, in Latin - “Terra Tremuit”. That piece remains in the group's repertoire to this day, and while they've never formally recorded it, there are videos on YouTube of them performing it:\n\n[Excerpt: The Chantels, \"Terra Tremuit\", soundcheck recording]\n\nThe story of how the Chantels were discovered, as it's usually told, is one that leaves one asking more questions than it answers. The group were walking down the street, when they passed a rehearsal room. A young man spotted them on the street and asked them if they were singers, since they were dressed identically. When they said “yes”, he took them up to a rehearsal studio to hear them.\n\nThe rehearsal studio happened to be in the Brill Building. We've not mentioned the Brill Building so far, because we're only just getting to the point where it started to have an impact on rock and roll music, but it was a building on Broadway – 1619 Broadway to be exact – which was the home of dozens, even hundreds at times, of music publishers, record labels, and talent agencies. There were a few other nearby buildings, most notably 1650 Broadway, which became the home of Aldon Music, which often get lumped in with the Brill Building when most people talk about it, and when I refer to the Brill Building in future episodes I'll be referring to the whole ecosystem of music industries that sprang up on Broadway in the fifties and early sixties.\n\nBut in this case, they were invited into the main Brill Building itself. They weren't just being invited into some random room, but into the heart of the music industry on the East Coast of America. This was the kind of thing that normally only happens in films – and relatively unrealistic films at that.\n\nSo far, so cliched, though it's hard to believe that that kind of thing ever really happened. But then something happened that isn't in any of the cliches – the girls noticed, through the window, that three members of the Valentines, one of their favourite groups, were walking past.\n\nWe've mentioned the Valentines a few months ago, when talking about Frankie Lymon and the Teenagers, and we talked about how Richie Barrett, as well as being a singer and songwriter in the group, was also a talent scout for George Goldner's record labels.\n\nThe Valentines had released several records, but none of them had had anything but local success, though records like “The Woo Woo Train” have since become cult favourites among lovers of 1950s vocal group music:\n\n[Excerpt: The Valentines, \"The Woo Woo Train\"]\n\nThe girls loved the Valentines, and they also knew that Barrett was important in the industry. They decided to run out of the rehearsal room and accost the group members. They told Richie Barrett that they were a singing group, and when he didn't believe them, they burst into song, singing what would later become the B-side of their first record, “The Plea”:\n\n[Excerpt: The Chantels, \"The Plea\"]\n\nThat song was one they'd written themselves, sort of. It was actually based on a song that a group of boys they knew, who sang in a street-corner group, had made up. That song had been called “Baby”, but the Chantels had taken it and reworked it into their own song. The version that they finally recorded, which we just heard, was further revamped by Barrett.\n\nBarrett was impressed, and said he'd be in touch. But then he never bothered to get in contact with them again, until Jackie Landry managed to obtain his home address and get in touch with him. She got the address through a friend of hers, a member of the Teenchords, a vocal group fronted by Frankie Lymon's brother Lewis, who recorded for one of George Goldner's labels, releasing tracks like “Your Last Chance”:\n\n[Excerpt: Lewis Lymon and the Teenchords, \"Your Last Chance\"]\n\nThey tracked down Barrett, and he agreed to try to get them signed to a record deal.\n\nThat story has many, many, problems, and frankly doesn't make any kind of sense, but it's the accepted history you'll find in books that deal with the group. According to Renee Minus White's autobiography, though, each of the girls has a different recollection of how they first met Barrett – in her version, they simply waited at the stage door to get autographs, and told him they were a singing group. My guess is that the accepted story is an attempt to reconcile a bunch of irreconcilable versions of the story.\n\nWhatever the true facts as to how they started to work with Richie Barrett, the important thing is that they did end up working with him. Barrett was impressed by their ability not just to sing the “oohs” and “aahs”, but the complex polyphonic parts that they sang in choir.\n\nFor the most part, doo-wop groups either sang simple block chords behind a lead singer, or they all sang their own moving parts that worked more or less in isolation – the bass singer would sing his part, the falsetto singer his, and so on. I say “his” because pretty much all doo-wop groups at this point were male. They were all singing the same song, but doing their own thing.\n\nThe Chantels were different – they were singing block harmonies, but they weren't singing simple chords, but interlocking moving lines. What they were doing ended up being closer to the so-called \"modern harmony\" of jazz vocal groups like the Four Freshmen:\n\n[Excerpt: The Four Freshmen, \"It's a Blue World\"]\n\nBut where other groups singing in that style had no R&B background, the Chantels were able to sing a rhythm and blues song with the best of them.\n\nBarrett signed the group to End Records, one of George Goldner's stable of record labels. But before recording them, he spent weeks rehearsing them, and teaching them how to perform on stage.\n\nThe first record they made, when they finally went into the studio, was a song primarily written by Arlene Smith, who also sang lead, though the composition is credited to the girls as a group. And listening to it, you have in this record for the first time the crystallisation of the girl-group sound, the sound that would later become a hallmark of people like Phil Spector.\n\n[Excerpt: The Chantels, \"He's Gone\"]\n\nIt's a song about adolescent anguish, written by and for adolescents, and it has a drama and angst to it that none of the other records by girl groups had had before – it's obviously inspired by groups like the Penguins and the Platters, but there's a near-hysteria to the performance that hadn't really been heard before. That strained longing is something that would appear in almost every girl-group record of the early sixties, and you can hear very clear echoes of the Chantels in records by people like the Ronettes, the Crystals, and the Shangri-Las. It's a far cry from “Mr. Lee”.\n\nMost of the time, when people talk about the Chantels' vocals, they – rightly – draw attention to Arlene Smith's leads, which are astonishing. But listen to the a capella intro, which is repeated as the outro, and you can hear those choir-trained voices – this was a vocal group, not just a singer and some cooing background vocalists:\n\n[Excerpt: the Chantels, \"He's Gone\"]\n\nAs well as being pioneers in the girl-group sound, the Chantels were also one of the first self-contained vocal groups to play their own instruments on stage. This was not something that they did at first, but something that Barrett encouraged them to do. Some of them had instrumental training already, and those who didn't were taught how to play by Barrett. Sonia and Jackie played guitar, Arlene bass, Lois piano, and Renee the drums. They even, according to Renee's autobiography, recorded an instrumental by themselves, called “The Chantels' Rock”.\n\nAlmost immediately, the girls were pulled out of Catholic school and instead sent to Quintano’s School for Young Professionals, the same school that the Teenagers went to, which was set up to accommodate children who had to go on tour. But there was one exception. Lois' mother would not let her transfer schools, or go on tour with the group. She could sing with them in the studio, and when they were performing in New York, but until she graduated high school that was all.\n\nIn many ways her mother was right to be worried, or at least Richie Barrett believed she had good reason to be. They started touring as soon as “He's Gone” came out, but the girls, at the time, resented Barrett, who came along on tour with them, because he would lock them in the dressing rooms and only let them out for the show itself, not allowing them to socialise with the other acts.\n\nIn retrospect, given that they were girls in their teens, and they were touring with large numbers of male musicians, many of them with reputations as sexual predators, Barrett's protectiveness (and his apparent threats to several of these men) was probably justified.\n\nFor example, in early 1958, the girls were sent out on a tour that became legendary – and given its lineup it's easy to see why. As well as the Chantels, the tour had Frankie Lymon, Danny & the Juniors, the Diamonds, Screamin' Jay Hawkins, Larry Williams, Buddy Holly, and as alternating headliners Jerry Lee Lewis and Chuck Berry. We'll talk more about that tour in the next couple of episodes, but aside from the undoubted musical quality of the performers, that was simply not a group of people who young women were going to be safe around (though several of the individuals there were harmless enough). One could, of course, argue that young girls shouldn't be put in that situation at all, but that never seems to have occurred to anyone involved.\n\nBy the time of that tour, they'd recorded what would become by far their biggest hit, their second single, “Maybe”:\n\n[Excerpt: The Chantels, \"Maybe\"]\n\n“Maybe” was a song that was originally co-credited to George Goldner and an unknown “Casey”, but for which Richie Barrett later sued and won co-writing credit. Barrett was presumably the sole writer, though some have claimed that Arlene Smith was an uncredited co-writer – something the other Chantels deny.\n\nIt was very much in the mould of “He's Gone”, and concentrated even more on Smith's lead vocal, and that lead vocal took an immense amount of work to obtain. In total they recorded fifty-two takes of the song before they got one that sounded right, and Smith was crying in frustration when she recorded the last take.\n\n“Maybe” reached number fifteen on the pop charts, and number two on the R&B charts, and it became a classic that has been covered by everyone from Janis Joplin to the Three Degrees.\n\nThe group's next two records, “Every Night (I Pray)” and “I Love You So”, both charted as well, though neither of them was a massive hit in the way that “Maybe” was. But after this point, the hits dried up – something that wasn't helped by the fact that George Goldner went through a phase of having his artists perform old standards, which didn't really suit the Chantels' voices.\n\nBut they'd had four hit records in a row, which was enough for them to get an album released. The album, which just featured the A- and B-sides of their first six singles, was originally released with a photo of the group on the front. That version was quickly withdrawn and replaced with a stock image of two white teenagers at a jukebox, just in case you've forgotten how appallingly racist the music industry was at this point.\n\nThey continued releasing singles, but they were also increasingly being used as backing vocalists for other artists produced by Barrett. He had them backing Jimmy Pemberton on “Rags to Riches”:\n\n[Excerpt: Jimmy Pemberton, “Rags to Riches”]\n\nAnd they also backed Barrett himself on \"Summer Love\", which got to the lower reaches of the top one hundred in pop, and made the top thirty in the R&B charts:\n\n[Excerpt: Richie Barrett and the Chantels, “Summer Love”]\n\nThere had also been some attempts to give Arlene a separate career outside the Chantels, as she duetted with Willie Wilson on “I've Lied”:\n\n[Excerpt: Willie Wilson and the Tunemasters, \"I've Lied\"]\n\nUnfortunately, after a year of success followed by another year of comparative failure, the group discovered that their career was at an end, thanks to George Goldner.\n\nWe've talked about Goldner before, most significantly in the episode on “Why Do Fools Fall in Love?”, but he had an almost unique combination of strong points and flaws as a record executive.\n\nHis strongest point was his musical taste. Nobody who knew him respected his taste, but everyone respected his ability to pick a hit, and both of these things sprang from the same basic reason – he had exactly the same musical tastes as a typical teenage girl from the period.\n\nNow, it's an unfortunate fact that the tastes of teenage girls are looked down upon by almost anyone with any power in the music industry, because of the almost universal misogyny in the industry, but the fact remains that teenage girls were becoming a powerful demographic as customers, and anyone who could accurately predict the music that they were going to buy would have a tremendous advantage when it came to making money in the music industry.\n\nAnd Goldner definitely made himself enough money over the years, because he engaged in all the usual practices of ripping off his artists – who were, very often, teenagers themselves. He would credit himself as the writer of their songs, he would engage in shady accounting practices, and all the rest.\n\nBut Goldner's real problem was his gambling addiction, and so there's a pattern that happens over and again throughout the fifties and sixties. Goldner starts up a new record label, discovers some teenage and/or black act, and makes them into overnight stars. Goldner then starts getting vast amounts of money, because he's ripping off his new discoveries. Goldner starts gambling with that money, loses badly, gets into debt with the mob, and goes to Morris Levy for a loan in order to keep his business going. Levy and his Mafia friends end up taking over the whole company, in exchange for writing off the debts. Levy replaces Goldner's writing credits on the hits with his own name, stops paying the artists anything at all, and collects all the money from the hits for the rest of his life, while Goldner is left with nothing and goes off to find another bunch of teenagers.\n\nAnd so End Records met the same fate as all of Goldner's other labels. It went bankrupt, and closed down, owing the Chantels a great deal of money.\n\nAfter End records closed, the Chantels wanted to carry on – but Arlene Smith decided she wanted to go solo instead. She recorded a couple of singles with a new producer, Phil Spector:\n\n[Excerpt: Arlene Smith, \"Love, Love, Love\"]\n\nAnd she also recorded another single with Richie Barrett as producer:\n\n[Excerpt: Arlene Smith, \"Everything\"]\n\nAt first, that looked like it would be the end of the Chantels, but then a year or so later Richie Barrett got back in touch with the girls. He had some ideas for records that would use the Chantels sound. By this point, Lois had decided that she was going to retire from the music business, but Jackie, Renee, and Sonia agreed to restart their career. There was a problem, though – they weren't sure what to do without their lead singer. Barrett told them he would sort it out for them.\n\nBarrett had been working with another girl group, the Veneers, for a couple of years. They'd released a few singles on Goldner-owned labels, like “Believe Me (My Angel)”:\n\n[Excerpt: The Veneers, \"Believe Me (My Angel)\"]\n\nAnd they'd also been the regular backing group Barrett used for sessions for male vocalists like Titus Turner:\n\n[Excerpt: Titus Turner, \"The Return of Stagolee\"]\n\nBut they'd never had a huge amount of success. So Barrett got their lead singer, Annette Swinson, to replace Arlene. To make it up to the Veneers, he got the rest of them a job as Jackie Wilson's backing vocalists.\n\nHe changed Annette's name to Annette Smith, and the new lineup of the group had a few more hits, with “Look in My Eyes”, which went to number six on the R&B charts and number fourteen on the pop charts:\n\n[Excerpt: The Chantels, \"Look in My Eyes\"]\n\nThey also backed Richie Barrett on an answer record to Ray Charles' “Hit the Road Jack”, titled “Well I Told You”, which made the top thirty on the pop charts:\n\n[Excerpt: Richie Barrett and the Chantels, \"Well I Told You\"]\n\nThis second phase of the Chantels' career was successful enough that Goldner, who no longer had the girls under contract, got one of his record labels to put out a new Chantels album, featuring a few tracks he owned by them that hadn't been on their first album. To fill out the album, and make it sound more like the current group, he also took a few of the Veneers' singles and stuck them on it under the Chantels' name.\n\nAnnette would stay with the group for a while, but the sixties saw several lineup changes, as the group stopped having chart successes, and members temporarily dropped out to have children or pursue careers. However, Sonia and Renee remained in place throughout, as the two constant members of the group (though Sonia also moonlit for a while in the sixties with another group Richie Barrett was looking after at the time, the Three Degrees).\n\nBy the mid-nineties, they had reformed with all of the original members except Arlene, who was replaced by Ami Ortiz, who can do a very creditable imitation of Arlene's lead vocals. Sadly Jackie Landry died in 1997, but the other four continued to tour, though only intermittently in between holding down day jobs.\n\nAlmost uniquely, the Chantels are still touring with the majority of their original members. Sonia Goring Wilson, Renee Minus White, and Lois Harris Powell still tour with the group, and they have several tour dates booked in for 2020, mostly on the east coast of the US. Arlene Smith spent many years touring solo and performing with her own rival “Chantels” group. She has very occasionally reunited with the rest of the Chantels for one-off performances, but there appears to be bad blood between them. She kept performing into the middle of the last decade, and as of 2018, her Facebook page said she was planning a comeback, but no further details have emerged.\n\nThe Chantels never received either the money or the acclaim that they deserved, given their run of chart successes and the way that they pioneered the girl group sound. But more than sixty years on from their biggest hits, four of the five of them are still alive, and apparently healthy, happy, and performing when the opportunity arises, and three of them are still good friends. Given the careers of most other stars of the era, especially the other child stars, that's as close to a happy ending as a group gets.",
  "enclosure": "",
  "itunes:summary": "Episode sixty-five of A History of Rock Music in Five Hundred Songs looks at \"Maybe\" by the Chantels, and covers child stardom, hymns in Latin, and how to get discovered twice in one day. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Don't You Just Know It\" by Huey \"Piano\" Smith and the Clowns.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThe only book actually about the Chantels is barely a book -- Maybe, Renee Minus White's self-published memoir, is more of a pamphlet, and it only manages even to get to that length with a ton of padding -- things like her fruit cake recipe. Don't expect much insight from this one.\n\nA big chunk of the outline of the story comes from Girl Groups; Fabulous Females Who Rocked the World by John Clemente, which has  a chapter on the Chantels.\n\nThis article on Richie Barrett's career filled in much of the detail.\n\nMy opinions of George Goldner come mostly from reading two books -- Hound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz, which talks about Leiber and Stoller's attempts to go into business with Goldner, and Godfather of the Music Business: Morris Levy by Richard Carlin.\n\nThere are innumerable collections of the small number of recordings the Chantels released -- this one is as good as any.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nERRATUM: I refer to “Summer Love” rather than “Summer's Love”\n\nTranscript\n\nWe've already seen one girl group, when we looked at “Mr Lee” by the Bobbettes, but already within a few months of the Bobbettes' breakout hit, other groups were making waves with the public.\n\nThe Chantels were one such group, and one of the best. They were pretty much exact contemporaries of the Bobbettes – so much so that when the Bobbettes were forming, they decided against calling themselves the Chanels, because it would be too similar. The Chantels, too, changed their name early on. They were formed by a group of girls at a Catholic school – St Anthony of Padua school in the Bronx – and were originally named “the Crystals”, but they found that another group in the area had already named themselves that, and so they changed it. (This other group was not the same one as the famous Crystals, who didn't form until 1961). They decided to name themselves after St Francis de Chantal after their school won a basketball game against St. Francis de Chantal school – when they discovered that the Chantal in the saint's name was from the same root as the French word for singing, it seemed to be too perfect for them.\n\nOriginally there were around a dozen members of the group, but they slowly whittled themselves down to five girls, between the ages of fourteen and seventeen – Arlene Smith, Lois Harris, Sonia Goring, Jackie Landry, and Renee Minus. According to Renee (who now goes by her married name Renee Minus White) the group's name came from a brainstorming session between her, Lois, Jackie, and Sonia, with Arlene agreeing to it later – this may, though, have more to do with ongoing disputes between Arlene and the other group members than with what actually happened.\n\nThey were drawn together by their mutual love of R&B vocal groups – a particular favourite record of theirs was “In Paradise” by the Cookies, a New York-based girl group who had started recording a few years earlier, and whose records were produced by Jesse Stone, but who wouldn't have any major chart successes for several years yet:\n\n[Excerpt: The Cookies, \"In Paradise\"]\n\nSo they were R&B singers, but the fact that these were Catholic schoolgirls, specifically, points to something about the way their music developed, and about early rock and roll more generally.\n\nWe've talked about the influence of religious music on rock ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode sixty-five of A History of Rock Music in Five Hundred Songs looks at \"Maybe\" by the Chantels, and covers child stardom, hymns in Latin, and how to get discovered twice in one day. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Don't You Just Know It\" by Huey \"Piano\" Smith and the Clowns.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThe only book actually about the Chantels is barely a book -- Maybe, Renee Minus White's self-published memoir, is more of a pamphlet, and it only manages even to get to that length with a ton of padding -- things like her fruit cake recipe. Don't expect much insight from this one.\n\nA big chunk of the outline of the story comes from Girl Groups; Fabulous Females Who Rocked the World by John Clemente, which has  a chapter on the Chantels.\n\nThis article on",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}