{
  "title": "Episode 14: You Can't Trust Employment Statistics",
  "itunes:title": "Episode 14: You Can't Trust Employment Statistics",
  "pubDate": "Wed, 17 May 2017 16:00:00 +0000",
  "guid": "76e2505585ee94871037405f234c01db",
  "link": "https://wordsandnumbers.libsyn.com/you-cant-trust-employment-statistics",
  "itunes:image": "",
  "description": "<p>There is no truly good way to measure unemployment, which makes it pretty easy for successive administrations to claim that unemployment is consistently improving. But when we do our level best to include all of the unemployed in the numbers, what we learn is that unemployment levels now are higher than they were at the beginning of the Great Recession. That’s the bad news. The good news is that things actually have been getting better over time. In this week’s episode, James and Antony take a look at the actual unemployment numbers to get to the bottom of what they really mean.<br /> <br /> Get the facts here:<br /> <a href= \"https://fee.org/articles/you-cant-trust-unemployment-statistics/\">https://fee.org/articles/you-cant-trust-unemployment-statistics/</a></p> <p> </p>",
  "content:encoded": "<p>There is no truly good way to measure unemployment, which makes it pretty easy for successive administrations to claim that unemployment is consistently improving. But when we do our level best to include all of the unemployed in the numbers, what we learn is that unemployment levels now are higher than they were at the beginning of the Great Recession. That’s the bad news. The good news is that things actually have been getting better over time. In this week’s episode, James and Antony take a look at the actual unemployment numbers to get to the bottom of what they really mean.  Get the facts here: <a href= \"https://fee.org/articles/you-cant-trust-unemployment-statistics/\">https://fee.org/articles/you-cant-trust-unemployment-statistics/</a></p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "13:00",
  "itunes:explicit": false,
  "itunes:keywords": "education,politics,government,Employment,economics,Opinion",
  "itunes:subtitle": "There is no truly good way to measure unemployment, which makes it pretty easy for successive administrations to claim that unemployment is consistently improving. But when we do our level best to include all of the unemployed in the numbers, what we...",
  "itunes:season": 1,
  "itunes:episode": 14,
  "itunes:episodeType": "full",
  "itunes:author": "Foundation for Economic Education"
}