{
  "title": "Episode 132: &#8220;I Can&#8217;t Help Myself&#8221; by the Four Tops",
  "link": "https://500songs.com/podcast/episode-132-i-cant-help-myself-by-the-four-tops/",
  "pubDate": "Wed, 08 Sep 2021 19:15:40 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=878",
  "description": "Episode one hundred and thirty-two of <em>A History of Rock Music in Five Hundred Songs</em> looks at “I Can't Help Myself” by the Four Tops, and is part two of a three-episode look at Motown in 1965. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/55926643\">on \"Colours\" by Donovan.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nNo Mixcloud this week, as too many of the songs were by the Four Tops.\n\nAmazingly, there are no books on the Four Tops, so I've had to rely on the information in the general Motown sources I use, plus the liner notes for the <a href=\"https://amzn.to/3yUvagK\">Four Tops 50th Anniversary singles collection</a>, a collection of the A and B sides of all their Motown singles. That collection is the best collection of the Four Tops' work available, but is pricey -- for a cheaper option <a href=\"https://amzn.to/3nb15Y5\">this single-disc set</a> is much better value.\n\nFor Motown-related information in this and other Motown episodes, I’ve used the following resources:\n\n<a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em> by Nelson George</a> is an excellent popular history of the various companies that became Motown.\n\n<a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em> by Berry Gordy</a> is Gordy’s own, understandably one-sided, but relatively well-written, autobiography.\n\n<a href=\"https://amzn.to/2VIpXII\"><em>Women of Motown: An Oral History</em> by Susan Whitall</a> is a collection of interviews with women involved in Motown.\n\n<a href=\"https://amzn.to/2xVdvfD\"><em>I Hear a Symphony: Motown and Crossover R&B </em>by J. Andrew Flory</a> is an academic look at Motown.\n\n<a href=\"https://amzn.to/2VLquJX\"><em>The Motown Encyclopaedia</em> by Graham Betts</a> is an exhaustive look at the people and records involved in Motown’s thirty-year history.\n\n<a href=\"https://amzn.to/3bZd5q6\"><em>How Sweet It Is</em> by Lamont Dozier and Scott B. Bomar </a>is Dozier’s autobiography, while <a href=\"https://amzn.to/3903ey8\"><em>Come and Get These Memories </em>by Brian and Eddie Holland and Dave Thompson</a> is the Holland brothers’.\n\nAnd <a href=\"https://motownjunkies.co.uk/\">Motown Junkies</a> is an infrequently-updated blog looking at (so far) the first 694 tracks released on Motown singles.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nThis is the second part of a two-part look at the work of Holland, Dozier, and Holland, and part of a three-part look at Motown Records in the mid-sixties. If you've not listened to the last episode, on the Supremes, you might want to listen to that one before this.\n\nThere's a clip of an old radio comedy show that always makes me irrationally irritated when I hear it, even though I like the programme it's from:\n\n[Excerpt of The Mark Steel Lectures, “Aristotle” episode. Transcript: \"Which led him back to the problem, what is it that makes something what it is? Is an apple still an apple when it's decomposing? I went to see the Four Tops once and none of the original members were in the band, they were just session musicians. So have i seen the Four Tops or not? I don't know\" ]\n\nThat's the kind of joke that would work with many vocal groups -- you could make the joke about the Drifters or the Ink Spots, of course, and it would even work for, for example, the Temptations, though they do have one original member still touring with them. Everyone knows that that kind of group has a constantly rotating membership, and that people come and go from groups like that all the time.\n\nExcept that that wasn't true for the Four Tops at the time Mark Steel made that joke, in the late 1990s. The current version of the Four Tops does only have one original member -- but that's because the other three all died. At the time Steel made the joke, his only opportunity to see the Four Tops would have been seeing all four original members -- the same four people who had been performing under that name since the 1950s.\n\nOther groups have had longer careers than that without changing members -- mostly duos, like Simon & Garfunkel or the Everly Brothers -- but I can't think of another one that lasted as long while performing together continuously, without taking a break at any point.\n\nSo today, we're going to look at the career of a group who performed together for forty-four years without a lineup change, a group who were recording together before Motown even started, but who became indelibly associated with Motown and with Holland-Dozier-Holland. We're going to look at the Four Tops, and at \"I Can't Help Myself\":\n\n[Excerpt: The Four Tops, \"I Can't Help Myself\"]\n\nThe Four Tops have turned up in the background in several episodes already, even though we're only now getting to their big hits. By the time they became huge, they had already been performing together for more than a decade, and had had a big influence on the burgeoning Detroit music scene even before Berry Gordy had got involved with the scene.\n\nThe group had started out after Abdul \"Duke\" Fakir, a teenager in Detroit, had gone to see Lucky Millinder and his band perform, and had been surprised to see his friend Levi Stubbs turn up, get on stage, and start singing with the band in a guest spot. Fakir had never realised before that his friend sang at all, let alone that he had an astonishing baritone voice.\n\nStubbs was, in fact, a regular on the Detroit amateur singing circuit, and had connections with several other performers on that circuit -- most notably his cousin Jackie Wilson, but also Hank Ballard and Little Willie John. Those few singers would make deals with each other about who would get to win at a particular show, and carved things up between them.\n\nStubbs and Fakir quickly started singing together, and by 1953 they had teamed up with two other kids, Obie Benson and Lawrence Payton. The four of them sang together at a party, and decided that they sounded good enough together that they should become a group. They named themselves the Four Aims, and started playing local shows.\n\nThey got a one-off record deal with a small label called Grady Records, and released their only single under the name \"The Four Aims\" in 1956:\n\n[Excerpt: The Four Aims, \"She Gave Me Love\"]\n\nAfter that single, they tried teaming up with Jackie Wilson, who had just quit Billy Ward and the Dominoes, but they found that Wilson and Stubbs' voices clashed -- Wilson's then-wife said their voices were too similar, though they sound very different to me.\n\nWilson would, of course, go on to his own massive success, and that success would be in part thanks to Roquel Davis, who was Lawrence Payton's cousin. As we saw in the episode on \"Reet Petite\", Davis would co-write most of Wilson's hits with Berry Gordy, and he was also writing songs for the Four Aims -- who he renamed the Four Tops, because he thought the Four Aims sounded too much like the Ames Brothers, a white vocal quartet who were popular at the time.  They explained to Davis that they were called the Four Aims because they were *aiming* for the top, and Davis said that in that case they should be the Four Tops, and that was the name under which they would perform for the rest of their career.\n\nIn the early fifties, before Wilson's success, Davis was the person in the group's circle with the most music industry connections, and he got them a deal with Chess Records. I already talked about this back in the episode on Jackie Wilson, but the group's first record on Chess, with Davis as the credited songwriter:\n\n[Excerpt: The Four Tops, \"Kiss Me Baby\"]\n\nSounds more than a little like a Ray Charles record from a couple of years earlier, which Davis definitely didn't write:\n\n[Excerpt: Ray Charles, \"Kissa Me Baby\"]\n\nBut that wasn't a success, and it would be another four years before they released their next single -- a one-off single on Columbia Records. It turned out that Chess had mostly signed the Four Tops not for the group, but to get Davis as a songwriter, and songs he'd originally written for the Tops ended up being recorded by other acts on Chess, like the Moonglows and the Flamingoes.\n\nThe group's single on Columbia would also be a flop, they'd wait another two years before another one-off single on Riverside, and then yet another two years before they were signed by Motown.\n\nTheir signing to Motown was largely the work of Mickey Stevenson, Motown's head of A&R. Of course, Stevenson was responsible, directly or otherwise, for every signing to the label at this point in time, but he had a special interest in the Four Tops. Stevenson had been in the Air Force in the 1950s, when he'd wandered into one of the Detroit amateur shows at which the Four Aims had been performing. He'd been so impressed with them that he immediately decided to quit the air force and go into music himself.\n\nHe'd joined the Hamptones, the vocal group who toured with Lionel Hampton's band, and he'd also become a member of a doo-wop group called The Classics, who'd had a minor hit with \"If Only the Sky Was a Mirror\":\n\n[Excerpt: The Classics, \"If Only the Sky Was a Mirror\"]\n\nStevenson had moved into a backroom position with Motown, but it was arguably the most important position in the company other than Gordy's. He was responsible for putting together the Funk Brothers, for signing many of the label's biggest acts, and for co-writing a number of the label's biggest hits, including \"Stubborn Kind of Fellow\" and \"Dancing in the Street\".\n\nStevenson had wanted to sign the group from the start -- given that they were the group who were directly responsible for everything that had happened in his career, they were important to him. And Berry Gordy was also a fan of the group, and had known them since his time working with Jackie Wilson, but it had taken several years for everything to fall into place so that the group were able to sign to Motown. When they did, they naturally became a priority.\n\nWhen they were signed to the label, it was initially with the intention of recording them as a jazz group rather than doing the soul pop that Motown was best known for. Their first recordings for Motown were for their subsidiary Workshop Jazz. They recorded an entire album of old standards for the label, titled \"Breaking Through\":\n\n[Excerpt: The Four Tops, \"This Can't be Love\"]\n\nUnfortunately for the group, that album wouldn't be released for thirty-five years -- Workshop Jazz had been founded because Berry Gordy was still a jazz fanatic, but none of the records on it had been very successful (or, frankly, very good -- the Four Tops album was pretty good, but most of the music put out on the label was third rate at best), and so the label closed down before they released the Four Tops album.\n\nSo the group were at a loose end, and for a while they were put to work as session vocalists on other people's records, adding backing to records by the Supremes:\n\n[Excerpt: The Supremes, \"Run Run Run\"]\n\nAnd even after they started having hits of their own they would appear on records by other people, like \"My Baby Loves Me\" by Martha and the Vandellas:\n\n[Excerpt: Martha and the Vandellas, \"My Baby Loves Me\"]\n\nYou'll notice that both of these records were ones where the Four Tops were added to a female group -- and that would also be the case on their own records, once Holland, Dozier, and Holland took over producing them.\n\nThe sound on the Four Tops' records is a distinctive one, and is actually made up of seven voices. Levi Stubbs, of course, took the lead on the singles, but the combination of backing vocalists was as important as the lead. Unlike several other vocal groups, the Four Tops were never replaced on their records -- Stubbs was always resistant to the idea that he was more important than the rest of his group. Instead, they were augmented -- Motown's normal session singers, the Andantes, joining in with Fakir, Payton, and Benson. The idea was to give the group a distinctive sound, and in particular to set them apart from the Temptations, whose recordings all featured only male vocals.\n\nThe group's first hit single, \"Baby I Need Your Loving\", was a song that Holland, Dozier, and Holland had written but weren't too impressed with. Indeed, they'd cut the backing track two years earlier, but been too uninspired by it to do anything with the completed track.\n\nBut then, two years after cutting the backing, Dozier was hit with inspiration -- the lines \"Baby, I need your loving/Got to have all your loving\" fit the backing track perfectly.\n\nEddie Holland was particularly excited to work with the Four Tops. Even though he'd somehow managed never to hear the group, despite both moving in the same musical circles in the same town for several years, he'd been hearing for all that time that Levi Stubbs was as good as his rivals Little Willie John and Jackie Wilson -- and anyone that good must be worth working with.\n\nWhen they took the song into the studio, though, Levi Stubbs didn't want to sing it, insisting that the key was wrong for his voice, and that it should be Payton who sang the song. The producers, though, insisted that Stubbs had the perfect voice for the song, and that they wanted the strained tone that came from Stubbs' baritone going into a higher register than he was comfortable with.\n\nEddie Holland, who always coached the lead vocalists while his brother and Lamont Dozier worked with the musicians, would later say that the problem was that Stubbs was unprepared and embarrassed -- they eventually persuaded Stubbs to take the song home and rehearse it over the weekend, and to come in to have a second go at the track the next Monday.\n\nOn the Monday, Stubbs came in and sang the song perfectly, and Stubbs' baritone leads became the most distinctive sound to come out of Motown in this period:\n\n[Excerpt: The Four Tops, \"Baby I Need Your Loving\"]\n\nAccording to at least one source, Stubbs was still unhappy with his vocal, and wanted to come in again the next day and record it again. Holland, Dozier, and Holland humoured him, but that wasn't going to happen.\n\n\"Baby I Need Your Loving\" became a hit, making number eleven, and so of course the next record was a soundalike. \"Without the One You Love (Life's Not Worthwhile)\" even started with the line \"Baby, I need your good loving\". Unfortunately, this time Holland, Dozier, and Holland copied their previous hit a little *too* closely, and people weren't interested. Dozier has later said that they were simply so busy with the Supremes at the time that they didn't give the single the attention it deserved, and thought that cranking out a soundalike would be good enough.\n\nBecause of this, they weren't given the group's next single -- the way Motown worked at the time, if you came up with a hit for an act, you automatically got the chance to do the follow-up, but if you didn't have a hit, someone else got a chance. Instead, Mickey Stevenson and Ivy Joe Hunter came up with a ballad called \"Ask the Lonely\", which became a minor hit -- not as big as \"Baby I Need Your Loving\", but enough that the group could continue to have a career.\n\nIt would be the next single that would make the Four Tops into the other great Holland-Dozier-Holland act, the one on which their reputation rests as much as it does on the Supremes:\n\n[Excerpt: The Four Tops, \"I Can't Help Myself\"]\n\n\"I Can't Help Myself\" was inspired by Dozier's grandfather, who would catcall women as they passed him on the street -- \"Hey, sugar pie! Hi there honey bunch!\"\n\nDozier married those words to a chord progression that's almost identical to the one from \"Where Did Our Love Go?\".  Both songs go C-G-Dm-F-G, with the same number of beats between changes:\n\n[demonstrates]\n\nThere's only one tiny change in the progression -- in the last beat of the last bar, there's a passing chord in \"I Can't Help Myself\", a move to A minor, that isn't there in \"Where Did Our Love Go?\"\n\nEven the melody lines, the syllabics of the words, and their general meanings are very similar. \"Where Did Our Love Go?\" starts with \"Baby baby\", \"I Can't Help Myself\" starts with \"Sugar pie, honey bunch\". \"Baby don't leave me\" is syllabically similar to \"You know that I love you\". The two songs diverge lyrically and melodically after that, but what's astonishing is how a different vocalist and arrangement can utterly transform two such similar basic songs. Compare the opening of \"Where Did Our Love Go?\":\n\n[Excerpt: The Supremes, \"Where Did Our Love Go?\"]\n\nWith the opening of \"I Can't Help Myself\":\n\n[Excerpt: The Four Tops, \"I Can't Help Myself\"]\n\nIt's a perfect example of how Holland, Dozier, and Holland would reuse musical ideas, but would put a different spin on them and make the records sound very different.\n\nOf course, some of the credit for this should go to the Funk Brothers, the session musicians who played on every Motown hit in this period, but there's some question as to exactly how much credit they deserved. Depending on who you believe, either the musicians all came up with their own instrumental lines, and the arrangement was a group effort by the session musicians with minimal interference from the nominal producers, or it was all written by Brian Holland and Lamont Dozier, and the musicians just did what they were told with no creative input at all.\n\nThe arguments about who did what tend to get quite vicious, with each side pointing out, accurately, that the other needed them. It's true that Holland, Dozier, and Holland didn't do anything like as well as writers and producers after they left Motown. It's also true that the Funk Brothers didn't write or produce any hits themselves, but were reliant on the Motown staff writers and producers for material.\n\nI suspect, and it is only a suspicion, that the truth lies between the two, and that it was a collaborative process where Holland and Dozier would go into the studio with a good idea of what they wanted, but that there was scope for interpretation and the musicians were able to make suggestions, which the producers might take up if they were good ones.\n\nIf Brian Holland sketched out or hummed a rough bassline to James Jamerson, saying something like \"play bum-bum-bum-bum\", and then Jamerson embellished and improvised around that rough bassline, it would be easy to see how both men could come out of the session thinking they had written the bassline, and having good reason to think so.\n\nIt's also easy to see how the balance could differ in different sessions -- how sometimes Holland or Dozier could come in with a fully worked out part, and other times they might come in saying \"you know the kind of thing I want\",  and how that could easily become remembered as \"I came up with all the parts and the musicians did nothing\" or \"Us musicians came up with all the parts and the producers just trusted us\".\n\nLuckily, there's more than enough credit to go around, and we can say that the Four Tops, Holland, Dozier, and Holland, the Funk Brothers, and the Andantes all played an important part in making these classic singles:\n\n[Excerpt: The Four Tops, \"I Can't Help Myself\"]\n\n\"I Can't Help Myself\" knocked the Supremes' \"Back in My Arms Again\" off the number one spot, but was itself knocked off the top by \"Mr. Tambourine Man\" -- but then a week later, \"I Can't Help Myself\" was at number one again, before being knocked off again by \"(I Can't Get No) Satisfaction\".\n\nThe success of \"I Can't Help Myself\" meant that the group's singles on their old labels suddenly had some value. Columbia Records reissued \"Ain't That Love\", a single the group had originally released four years earlier, in the hope of having some success because of the group's new-found fame.\n\nAs we saw last time when the Supremes rushed out \"Come See About Me\" to prevent someone else having the hit with it, there was nothing that Berry Gordy hated more than the idea that someone else could have a hit based on the success of a Motown act. The Four Tops needed a new single *now* to kill the record on Columbia, and it didn't matter that there were no recordings or even songs available to put out.\n\nHolland, Dozier, and Holland went into the studio to record a new backing track with the Funk Brothers, essentially just a remake of the backing from \"I Can't Help Myself\", only very slightly changed. By three o'clock in the afternoon on the day they found out that the Columbia record was being released, they were in the studio, Dozier fine-tuning the melody while Brian Holland rehearsed the musicians and Eddie Holland scribbled lyrics in another corner. By five PM the track had been recorded and mixed. By six PM the master stamper was being driven the ninety miles to the pressing plant so they could start pressing up copies. The next day, DJs started getting copies of the record, and it was in the shops a couple of days later.\n\nOf course, the record being made in such a rush meant that it was essentially a remake of their previous hit -- something that was acknowledged in the tongue-in-cheek title:\n\n[Excerpt: The Four Tops, \"It's the Same Old Song\"]\n\n\"It's the Same Old Song\" wasn't as big a hit as \"I Can't Help Myself\", but it made number five on the charts, a more than respectable follow-up, and quite astonishing given the pressure under which the record was made.\n\nThe next few singles that Holland, Dozier, and Holland wrote for the group weren't quite as successful -- this was early 1966, and Holland, Dozier, and Holland were in a mini slump -- they'd had a number one with \"I Hear a Symphony\", as we heard in the last episode, but then they produced two singles for the Supremes that made the top ten, but not number one -- \"My World is Empty Without You\" and \"Love is Like an Itching in My Heart\".  And as the Four Tops weren't quite as big as the Supremes, so their next two singles, \"Something About You\" and \"Shake Me, Wake Me (When It's Over)\", only just scraped into the bottom of the top twenty. Still hits, but not up to Holland, Dozier, and Holland's 1965 standards.\n\nAnd so as was the common practice at Motown, someone else was given a chance to come up with a song for the group. \"Loving You is Sweeter Than Ever\" was written by Ivy Jo Hunter, a songwriter and producer whose biggest contribution to this point had been co-writing \"Dancing in the Street\", and Stevie Wonder, a child star who'd had a hit a couple of years earlier but never really followed up on it, and who also played drums on the track:\n\n[Excerpt: The Four Tops, \"Loving You is Sweeter Than Ever\"]\n\nWithin a few months, Wonder would begin a run of hit singles that would continue for more than a decade, and would become arguably the most important artist on Motown. But that golden period hadn't quite started yet, and \"Loving You is Sweeter Than Ever\" didn't make the top forty.\n\nAt this point, it would have been easy for the Four Tops to have been relegated to the same pile as artists like the Contours -- people who'd had a couple of hits on Motown, but had then failed to follow up with a decent career. Motown was becoming ever more willing to drop artists as dead weight, as Gordy was increasingly concentrating on a few huge stars -- Marvin Gaye, Smokey Robinson and especially the Supremes – to the exclusion of everyone else.\n\nBut then Holland, Dozier, and Holland got back up on top. They came up with two more number ones for the Supremes in quick succession. \"You Can't Hurry Love\" was recorded around the same time that \"Loving You is Sweeter Than Ever\" was failing to chart, and quickly became one of the Supremes' biggest ever hits. They followed that with a song inspired by the sound of the breaking news alert on the radio, replicating that sound with the staccato guitars on what was their most inventive production to date:\n\n[Excerpt: The Supremes, \"You Keep Me Hanging On\"]\n\nNot only was that a number one record, it was soon followed by a top ten cover version by the heavy rock band Vanilla Fudge:\n\n[Excerpt: Vanilla Fudge, \"You Keep Me Hanging On\"]\n\nHolland, Dozier, and Holland were back on top, and they brought the Four Tops back to the top with them. The next single they recorded with the group, \"Reach Out, I'll Be There\", started with an instrumental introduction that Brian Holland was noodling with on the piano:\n\n[Excerpt: The Four Tops, \"Reach Out I'll Be There\"]\n\nHolland was playing that part, over and over, and then suddenly Lamont Dozier was hit with inspiration -- so much so that he literally pushed Holland to one side without saying anything and started playing what would become the verse:\n\n[Excerpt: The Four Tops, \"Reach Out I'll Be There\"]\n\nThe interesting thing about that track is that it shows how the different genres that were charting at the time would have more influence on each other than it might appear from this distance, where we put them all into neat little boxes named \"folk-rock\" or \"Motown\". Because Lamont Dozier was very specifically being influenced by Bob Dylan and \"Like a Rolling Stone\", when it came to how the song was phrased. Now, this is not something that I would ever in a million years have thought of, but once you know it, the influence is absolutely plain -- the way the melody stresses and elongates the last syllable of each line is pure Dylan.\n\nTo show this, I am afraid I'm going to have to do something that I hoped I'd never, ever, have to do, which is do a bad Bob Dylan impression. Everyone thinks they can impersonate Dylan, everyone's imitations of Dylan are cringeworthy, and mine is worse than most. This will sound awful, but it *will* show you how Dozier was thinking when he came up with that bit of melody:\n\n[demonstrates]\n\nLet us never speak of that again.\n\nI think we'd better hear how Levi Stubbs sang it again, hadn't we, to take that unpleasant sound away:\n\n[Excerpt: The Four Tops, \"Reach Out I'll Be There\"]\n\nThat became the group's second and last number one single, and also their only UK number one.\n\nUnfortunately, Holland, Dozier, and Holland were so hot at this point that they ended up competing with themselves. Norman Whitfield, one of the other Motown songwriter-producers, had wanted for a while to produce the Temptations, whose records were at this point mostly written and produced by Smokey Robinson. He called on Eddie Holland to help him write the hit that let him take over from Robinson as the Temptations' producer, \"Ain't Too Proud to Beg\":\n\n[Excerpt: The Temptations, \"Ain't Too Proud to Beg\"]\n\nDozier and Brian Holland were fine with Eddie working with another writer -- they all did that kind of thing on occasion -- until the date of the BMI Awards. The previous two years, the trio had been jointly given BMI's award for most successful songwriter of the year. But that year, Eddie Holland got the award on his own, for having written more hits than anyone else (he'd written eight, Dozier and Brian Holland had written six. According to a contemporary issue of Billboard, John Sebastian was next with five, then Lennon/McCartney and Jagger/Richards with four each.)\n\nHolland felt bad that he'd inadvertently prevented his collaborators from winning the award for a third year in a row, and from this point on he'd be much more careful about outside collaborations.\n\nHolland, Dozier, and Holland wrote two more classic singles for the Four Tops, \"Standing in the Shadows of Love\", and \"Bernadette\". That latter had been inspired by a coincidence that all three of Holland, Dozier, and Holland had at one time or another dated or felt unrequited love for different girls called Bernadette, but it proved extremely difficult to record.\n\nWhen the trio wrote together, Eddie Holland would always sing the songs, and the melodies were constructed around his tenor vocal range. Stubbs was a baritone, and sometimes couldn't hit some of the higher notes in the melodies, and he was having that problem with \"Bernadette\". Eddie Holland eventually solved the problem by inviting in a few fans who had been hanging around outside hoping for autographs. Stubbs being a performer wasn't going to make himself look bad in front of an audience, and sang it perfectly:\n\n[Excerpt: The Four Tops, \"Bernadette\"]\n\n\"Bernadette\" made the top five, and it was followed by a couple more top twenty hits with lesser Holland/Dozier/Holland songs, but then the writer-producers quit Motown, for reasons we'll look at in a few months when we take our last look at the Supremes. This left the Four Tops stranded -- they were so associated with their producers that nobody else could get hits with them.\n\nFor a while, Motown turned to an interesting strategy with them. It had been normal Motown practice to fill albums up with cover versions of hits of the day, and so the label put out some of this album filler as singles, and surprisingly had some chart success with cover versions of the Left Banke's baroque pop hit \"Walk Away Renee\":\n\n[Excerpt: The Four Tops, \"Walk Away Renee\"]\n\nand of Tim Hardin's folk ballad \"If I Were a Carpenter\":\n\n[Excerpt: The Four Tops, \"If I Were a Carpenter\"]\n\nAnd so for a while many of the singles the group released, both in the US and elsewhere, were covers of songs that were very far from the normal Motown style -- the Jimmy Webb ballad \"Do What You Gotta Do\" made the UK top twenty, their cover of another Jimmy Webb song, \"MacArthur Park\", made the lower reaches of the US top forty, their version of the old standard \"It's All in the Game\" made number twenty-four, and they released a version of \"River Deep, Mountain High\", teaming up with the Supremes, that became more successful in the US than the original, though still only just made the top forty.\n\nBut they were flailing. Motown had no idea what to do with them other than release cover versions, and any time any of Motown's writing and production teams tried to come up with something new for the group it failed catastrophically.\n\nIn 1972 they signed to ABC/Dunhill, and there they had a few hits, including a couple that made the top ten, but soon the same pattern emerged -- no-one could reliably get hits with the group, and they spent much of the seventies chasing trends and failing to catch them.\n\nThey had one more big US hit in 1981, with \"When She Was My Girl\", which made number eleven, and which went to number one on the R&B charts:\n\n[Excerpt: The Four Tops, \"When She Was My Girl\"]\n\nBut from that point on they were essentially a nostalgia act, though they carried on releasing records through the eighties.\n\nThe group's career nearly came to a premature end in 1988. They were in the UK to promote their single \"Loco in Acapulco\", co-written by Lamont Dozier and Phil Collins, from the soundtrack of Collins' film Buster:\n\n[Excerpt: The Four Tops, \"Loco in Acapulco\"]\n\nThat was a UK top ten hit, but it nearly led to the group's death -- they were scheduled to fly out of the UK on Pan Am flight 103 to Detroit on the twenty-first of December 1988. But the group were tired after recording an appearance on Top of the Pops the night before, slept in, and missed the flight. The flight fell victim to a terrorist bombing -- the Lockerbie bombing -- and everyone on it died.\n\nThe group carried on performing together after that, but their last new single was released in 1989, and they only recorded one more album, a Christmas album in 1995. They performed together, still in their original lineup, until 1997 when Lawrence Payton died from cancer. At first the group continued as a trio, retiring the Four Tops name and just performing as The Tops, but eventually they got in a replacement. By the turn of the century, Levi Stubbs had become too ill to perform as well -- he retired in 2000, though he came back for a one-off performance for the group's fiftieth anniversary in 2004, and he died in 2008. Obie Benson continued performing with the group until three months before his death in 2005.\n\nA version of the Four Tops continues to perform, led by Abdul Fakir, and also featuring Lawrence Payton's son Roquel, named after Roquel Davis, who performs under the name Lawrence Payton Jr.\n\nThe Four Tops were one of those groups that never quite lived up to their commercial potential, thanks in large part to Holland, Dozier, and Holland leaving Motown at precisely the wrong moment, and one has to wonder how many more hits they could have had under other circumstances. But the hits they did have included some of the greatest records of the sixties, and they managed to continue working together, without any public animosity, until their deaths. Given the way the careers of more successful groups have tended to end, perhaps it's better this way.",
  "itunes:subtitle": "Episode one hundred and thirty-two of A History of Rock Music in Five Hundred Songs looks at “I Cant Help Myself” by the Four Tops, and is part two of a three-episode look at Motown in 1965. Click the full post to read liner notes, links to more informat",
  "itunes:keywords": "Berry Gordy,Holland-Dozier-Holland,Jackie Wilson,Mickey Stevenson,Motown,Norman Whitfield,Roquel Davis,Stevie Wonder,The Four Tops,The Funk Brothers,The Supremes,The Temptations",
  "itunes:episodeType": "full",
  "itunes:episode": 132,
  "content:encoded": "Episode one hundred and thirty-two of <em>A History of Rock Music in Five Hundred Songs</em> looks at “I Can't Help Myself” by the Four Tops, and is part two of a three-episode look at Motown in 1965. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/55926643\">on \"Colours\" by Donovan.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nNo Mixcloud this week, as too many of the songs were by the Four Tops.\n\nAmazingly, there are no books on the Four Tops, so I've had to rely on the information in the general Motown sources I use, plus the liner notes for the <a href=\"https://amzn.to/3yUvagK\">Four Tops 50th Anniversary singles collection</a>, a collection of the A and B sides of all their Motown singles. That collection is the best collection of the Four Tops' work available, but is pricey -- for a cheaper option <a href=\"https://amzn.to/3nb15Y5\">this single-disc set</a> is much better value.\n\nFor Motown-related information in this and other Motown episodes, I’ve used the following resources:\n\n<a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em> by Nelson George</a> is an excellent popular history of the various companies that became Motown.\n\n<a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em> by Berry Gordy</a> is Gordy’s own, understandably one-sided, but relatively well-written, autobiography.\n\n<a href=\"https://amzn.to/2VIpXII\"><em>Women of Motown: An Oral History</em> by Susan Whitall</a> is a collection of interviews with women involved in Motown.\n\n<a href=\"https://amzn.to/2xVdvfD\"><em>I Hear a Symphony: Motown and Crossover R&B </em>by J. Andrew Flory</a> is an academic look at Motown.\n\n<a href=\"https://amzn.to/2VLquJX\"><em>The Motown Encyclopaedia</em> by Graham Betts</a> is an exhaustive look at the people and records involved in Motown’s thirty-year history.\n\n<a href=\"https://amzn.to/3bZd5q6\"><em>How Sweet It Is</em> by Lamont Dozier and Scott B. Bomar </a>is Dozier’s autobiography, while <a href=\"https://amzn.to/3903ey8\"><em>Come and Get These Memories </em>by Brian and Eddie Holland and Dave Thompson</a> is the Holland brothers’.\n\nAnd <a href=\"https://motownjunkies.co.uk/\">Motown Junkies</a> is an infrequently-updated blog looking at (so far) the first 694 tracks released on Motown singles.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nThis is the second part of a two-part look at the work of Holland, Dozier, and Holland, and part of a three-part look at Motown Records in the mid-sixties. If you've not listened to the last episode, on the Supremes, you might want to listen to that one before this.\n\nThere's a clip of an old radio comedy show that always makes me irrationally irritated when I hear it, even though I like the programme it's from:\n\n[Excerpt of The Mark Steel Lectures, “Aristotle” episode. Transcript: \"Which led him back to the problem, what is it that makes something what it is? Is an apple still an apple when it's decomposing? I went to see the Four Tops once and none of the original members were in the band, they were just session musicians. So have i seen the Four Tops or not? I don't know\" ]\n\nThat's the kind of joke that would work with many vocal groups -- you could make the joke about the Drifters or the Ink Spots, of course, and it would even work for, for example, the Temptations, though they do have one original member still touring with them. Everyone knows that that kind of group has a constantly rotating membership, and that people come and go from groups like that all the time.\n\nExcept that that wasn't true for the Four Tops at the time Mark Steel made that joke, in the late 1990s. The current version of the Four Tops does only have one original member -- but that's because the other three all died. At the time Steel made the joke, his only opportunity to see the Four Tops would have been seeing all four original members -- the same four people who had been performing under that name since the 1950s.\n\nOther groups have had longer careers than that without changing members -- mostly duos, like Simon & Garfunkel or the Everly Brothers -- but I can't think of another one that lasted as long while performing together continuously, without taking a break at any point.\n\nSo today, we're going to look at the career of a group who performed together for forty-four years without a lineup change, a group who were recording together before Motown even started, but who became indelibly associated with Motown and with Holland-Dozier-Holland. We're going to look at the Four Tops, and at \"I Can't Help Myself\":\n\n[Excerpt: The Four Tops, \"I Can't Help Myself\"]\n\nThe Four Tops have turned up in the background in several episodes already, even though we're only now getting to their big hits. By the time they became huge, they had already been performing together for more than a decade, and had had a big influence on the burgeoning Detroit music scene even before Berry Gordy had got involved with the scene.\n\nThe group had started out after Abdul \"Duke\" Fakir, a teenager in Detroit, had gone to see Lucky Millinder and his band perform, and had been surprised to see his friend Levi Stubbs turn up, get on stage, and start singing with the band in a guest spot. Fakir had never realised before that his friend sang at all, let alone that he had an astonishing baritone voice.\n\nStubbs was, in fact, a regular on the Detroit amateur singing circuit, and had connections with several other performers on that circuit -- most notably his cousin Jackie Wilson, but also Hank Ballard and Little Willie John. Those few singers would make deals with each other about who would get to win at a particular show, and carved things up between them.\n\nStubbs and Fakir quickly started singing together, and by 1953 they had teamed up with two other kids, Obie Benson and Lawrence Payton. The four of them sang together at a party, and decided that they sounded good enough together that they should become a group. They named themselves the Four Aims, and started playing local shows.\n\nThey got a one-off record deal with a small label called Grady Records, and released their only single under the name \"The Four Aims\" in 1956:\n\n[Excerpt: The Four Aims, \"She Gave Me Love\"]\n\nAfter that single, they tried teaming up with Jackie Wilson, who had just quit Billy Ward and the Dominoes, but they found that Wilson and Stubbs' voices clashed -- Wilson's then-wife said their voices were too similar, though they sound very different to me.\n\nWilson would, of course, go on to his own massive success, and that success would be in part thanks to Roquel Davis, who was Lawrence Payton's cousin. As we saw in the episode on \"Reet Petite\", Davis would co-write most of Wilson's hits with Berry Gordy, and he was also writing songs for the Four Aims -- who he renamed the Four Tops, because he thought the Four Aims sounded too much like the Ames Brothers, a white vocal quartet who were popular at the time.  They explained to Davis that they were called the Four Aims because they were *aiming* for the top, and Davis said that in that case they should be the Four Tops, and that was the name under which they would perform for the rest of their career.\n\nIn the early fifties, before Wilson's success, Davis was the person in the group's circle with the most music industry connections, and he got them a deal with Chess Records. I already talked about this back in the episode on Jackie Wilson, but the group's first record on Chess, with Davis as the credited songwriter:\n\n[Excerpt: The Four Tops, \"Kiss Me Baby\"]\n\nSounds more than a little like a Ray Charles record from a couple of years earlier, which Davis definitely didn't write:\n\n[Excerpt: Ray Charles, \"Kissa Me Baby\"]\n\nBut that wasn't a success, and it would be another four years before they released their next single -- a one-off single on Columbia Records. It turned out that Chess had mostly signed the Four Tops not for the group, but to get Davis as a songwriter, and songs he'd originally written for the Tops ended up being recorded by other acts on Chess, like the Moonglows and the Flamingoes.\n\nThe group's single on Columbia would also be a flop, they'd wait another two years before another one-off single on Riverside, and then yet another two years before they were signed by Motown.\n\nTheir signing to Motown was largely the work of Mickey Stevenson, Motown's head of A&R. Of course, Stevenson was responsible, directly or otherwise, for every signing to the label at this point in time, but he had a special interest in the Four Tops. Stevenson had been in the Air Force in the 1950s, when he'd wandered into one of the Detroit amateur shows at which the Four Aims had been performing. He'd been so impressed with them that he immediately decided to quit the air force and go into music himself.\n\nHe'd joined the Hamptones, the vocal group who toured with Lionel Hampton's band, and he'd also become a member of a doo-wop group called The Classics, who'd had a minor hit with \"If Only the Sky Was a Mirror\":\n\n[Excerpt: The Classics, \"If Only the Sky Was a Mirror\"]\n\nStevenson had moved into a backroom position with Motown, but it was arguably the most important position in the company other than Gordy's. He was responsible for putting together the Funk Brothers, for signing many of the label's biggest acts, and for co-writing a number of the label's biggest hits, including \"Stubborn Kind of Fellow\" and \"Dancing in the Street\".\n\nStevenson had wanted to sign the group from the start -- given that they were the group who were directly responsible for everything that had happened in his career, they were important to him. And Berry Gordy was also a fan of the group, and had known them since his time working with Jackie Wilson, but it had taken several years for everything to fall into place so that the group were able to sign to Motown. When they did, they naturally became a priority.\n\nWhen they were signed to the label, it was initially with the intention of recording them as a jazz group rather than doing the soul pop that Motown was best known for. Their first recordings for Motown were for their subsidiary Workshop Jazz. They recorded an entire album of old standards for the label, titled \"Breaking Through\":\n\n[Excerpt: The Four Tops, \"This Can't be Love\"]\n\nUnfortunately for the group, that album wouldn't be released for thirty-five years -- Workshop Jazz had been founded because Berry Gordy was still a jazz fanatic, but none of the records on it had been very successful (or, frankly, very good -- the Four Tops album was pretty good, but most of the music put out on the label was third rate at best), and so the label closed down before they released the Four Tops album.\n\nSo the group were at a loose end, and for a while they were put to work as session vocalists on other people's records, adding backing to records by the Supremes:\n\n[Excerpt: The Supremes, \"Run Run Run\"]\n\nAnd even after they started having hits of their own they would appear on records by other people, like \"My Baby Loves Me\" by Martha and the Vandellas:\n\n[Excerpt: Martha and the Vandellas, \"My Baby Loves Me\"]\n\nYou'll notice that both of these records were ones where the Four Tops were added to a female group -- and that would also be the case on their own records, once Holland, Dozier, and Holland took over producing them.\n\nThe sound on the Four Tops' records is a distinctive one, and is actually made up of seven voices. Levi Stubbs, of course, took the lead on the singles, but the combination of backing vocalists was as important as the lead. Unlike several other vocal groups, the Four Tops were never replaced on their records -- Stubbs was always resistant to the idea that he was more important than the rest of his group. Instead, they were augmented -- Motown's normal session singers, the Andantes, joining in with Fakir, Payton, and Benson. The idea was to give the group a distinctive sound, and in particular to set them apart from the Temptations, whose recordings all featured only male vocals.\n\nThe group's first hit single, \"Baby I Need Your Loving\", was a song that Holland, Dozier, and Holland had written but weren't too impressed with. Indeed, they'd cut the backing track two years earlier, but been too uninspired by it to do anything with the completed track.\n\nBut then, two years after cutting the backing, Dozier was hit with inspiration -- the lines \"Baby, I need your loving/Got to have all your loving\" fit the backing track perfectly.\n\nEddie Holland was particularly excited to work with the Four Tops. Even though he'd somehow managed never to hear the group, despite both moving in the same musical circles in the same town for several years, he'd been hearing for all that time that Levi Stubbs was as good as his rivals Little Willie John and Jackie Wilson -- and anyone that good must be worth working with.\n\nWhen they took the song into the studio, though, Levi Stubbs didn't want to sing it, insisting that the key was wrong for his voice, and that it should be Payton who sang the song. The producers, though, insisted that Stubbs had the perfect voice for the song, and that they wanted the strained tone that came from Stubbs' baritone going into a higher register than he was comfortable with.\n\nEddie Holland, who always coached the lead vocalists while his brother and Lamont Dozier worked with the musicians, would later say that the problem was that Stubbs was unprepared and embarrassed -- they eventually persuaded Stubbs to take the song home and rehearse it over the weekend, and to come in to have a second go at the track the next Monday.\n\nOn the Monday, Stubbs came in and sang the song perfectly, and Stubbs' baritone leads became the most distinctive sound to come out of Motown in this period:\n\n[Excerpt: The Four Tops, \"Baby I Need Your Loving\"]\n\nAccording to at least one source, Stubbs was still unhappy with his vocal, and wanted to come in again the next day and record it again. Holland, Dozier, and Holland humoured him, but that wasn't going to happen.\n\n\"Baby I Need Your Loving\" became a hit, making number eleven, and so of course the next record was a soundalike. \"Without the One You Love (Life's Not Worthwhile)\" even started with the line \"Baby, I need your good loving\". Unfortunately, this time Holland, Dozier, and Holland copied their previous hit a little *too* closely, and people weren't interested. Dozier has later said that they were simply so busy with the Supremes at the time that they didn't give the single the attention it deserved, and thought that cranking out a soundalike would be good enough.\n\nBecause of this, they weren't given the group's next single -- the way Motown worked at the time, if you came up with a hit for an act, you automatically got the chance to do the follow-up, but if you didn't have a hit, someone else got a chance. Instead, Mickey Stevenson and Ivy Joe Hunter came up with a ballad called \"Ask the Lonely\", which became a minor hit -- not as big as \"Baby I Need Your Loving\", but enough that the group could continue to have a career.\n\nIt would be the next single that would make the Four Tops into the other great Holland-Dozier-Holland act, the one on which their reputation rests as much as it does on the Supremes:\n\n[Excerpt: The Four Tops, \"I Can't Help Myself\"]\n\n\"I Can't Help Myself\" was inspired by Dozier's grandfather, who would catcall women as they passed him on the street -- \"Hey, sugar pie! Hi there honey bunch!\"\n\nDozier married those words to a chord progression that's almost identical to the one from \"Where Did Our Love Go?\".  Both songs go C-G-Dm-F-G, with the same number of beats between changes:\n\n[demonstrates]\n\nThere's only one tiny change in the progression -- in the last beat of the last bar, there's a passing chord in \"I Can't Help Myself\", a move to A minor, that isn't there in \"Where Did Our Love Go?\"\n\nEven the melody lines, the syllabics of the words, and their general meanings are very similar. \"Where Did Our Love Go?\" starts with \"Baby baby\", \"I Can't Help Myself\" starts with \"Sugar pie, honey bunch\". \"Baby don't leave me\" is syllabically similar to \"You know that I love you\". The two songs diverge lyrically and melodically after that, but what's astonishing is how a different vocalist and arrangement can utterly transform two such similar basic songs. Compare the opening of \"Where Did Our Love Go?\":\n\n[Excerpt: The Supremes, \"Where Did Our Love Go?\"]\n\nWith the opening of \"I Can't Help Myself\":\n\n[Excerpt: The Four Tops, \"I Can't Help Myself\"]\n\nIt's a perfect example of how Holland, Dozier, and Holland would reuse musical ideas, but would put a different spin on them and make the records sound very different.\n\nOf course, some of the credit for this should go to the Funk Brothers, the session musicians who played on every Motown hit in this period, but there's some question as to exactly how much credit they deserved. Depending on who you believe, either the musicians all came up with their own instrumental lines, and the arrangement was a group effort by the session musicians with minimal interference from the nominal producers, or it was all written by Brian Holland and Lamont Dozier, and the musicians just did what they were told with no creative input at all.\n\nThe arguments about who did what tend to get quite vicious, with each side pointing out, accurately, that the other needed them. It's true that Holland, Dozier, and Holland didn't do anything like as well as writers and producers after they left Motown. It's also true that the Funk Brothers didn't write or produce any hits themselves, but were reliant on the Motown staff writers and producers for material.\n\nI suspect, and it is only a suspicion, that the truth lies between the two, and that it was a collaborative process where Holland and Dozier would go into the studio with a good idea of what they wanted, but that there was scope for interpretation and the musicians were able to make suggestions, which the producers might take up if they were good ones.\n\nIf Brian Holland sketched out or hummed a rough bassline to James Jamerson, saying something like \"play bum-bum-bum-bum\", and then Jamerson embellished and improvised around that rough bassline, it would be easy to see how both men could come out of the session thinking they had written the bassline, and having good reason to think so.\n\nIt's also easy to see how the balance could differ in different sessions -- how sometimes Holland or Dozier could come in with a fully worked out part, and other times they might come in saying \"you know the kind of thing I want\",  and how that could easily become remembered as \"I came up with all the parts and the musicians did nothing\" or \"Us musicians came up with all the parts and the producers just trusted us\".\n\nLuckily, there's more than enough credit to go around, and we can say that the Four Tops, Holland, Dozier, and Holland, the Funk Brothers, and the Andantes all played an important part in making these classic singles:\n\n[Excerpt: The Four Tops, \"I Can't Help Myself\"]\n\n\"I Can't Help Myself\" knocked the Supremes' \"Back in My Arms Again\" off the number one spot, but was itself knocked off the top by \"Mr. Tambourine Man\" -- but then a week later, \"I Can't Help Myself\" was at number one again, before being knocked off again by \"(I Can't Get No) Satisfaction\".\n\nThe success of \"I Can't Help Myself\" meant that the group's singles on their old labels suddenly had some value. Columbia Records reissued \"Ain't That Love\", a single the group had originally released four years earlier, in the hope of having some success because of the group's new-found fame.\n\nAs we saw last time when the Supremes rushed out \"Come See About Me\" to prevent someone else having the hit with it, there was nothing that Berry Gordy hated more than the idea that someone else could have a hit based on the success of a Motown act. The Four Tops needed a new single *now* to kill the record on Columbia, and it didn't matter that there were no recordings or even songs available to put out.\n\nHolland, Dozier, and Holland went into the studio to record a new backing track with the Funk Brothers, essentially just a remake of the backing from \"I Can't Help Myself\", only very slightly changed. By three o'clock in the afternoon on the day they found out that the Columbia record was being released, they were in the studio, Dozier fine-tuning the melody while Brian Holland rehearsed the musicians and Eddie Holland scribbled lyrics in another corner. By five PM the track had been recorded and mixed. By six PM the master stamper was being driven the ninety miles to the pressing plant so they could start pressing up copies. The next day, DJs started getting copies of the record, and it was in the shops a couple of days later.\n\nOf course, the record being made in such a rush meant that it was essentially a remake of their previous hit -- something that was acknowledged in the tongue-in-cheek title:\n\n[Excerpt: The Four Tops, \"It's the Same Old Song\"]\n\n\"It's the Same Old Song\" wasn't as big a hit as \"I Can't Help Myself\", but it made number five on the charts, a more than respectable follow-up, and quite astonishing given the pressure under which the record was made.\n\nThe next few singles that Holland, Dozier, and Holland wrote for the group weren't quite as successful -- this was early 1966, and Holland, Dozier, and Holland were in a mini slump -- they'd had a number one with \"I Hear a Symphony\", as we heard in the last episode, but then they produced two singles for the Supremes that made the top ten, but not number one -- \"My World is Empty Without You\" and \"Love is Like an Itching in My Heart\".  And as the Four Tops weren't quite as big as the Supremes, so their next two singles, \"Something About You\" and \"Shake Me, Wake Me (When It's Over)\", only just scraped into the bottom of the top twenty. Still hits, but not up to Holland, Dozier, and Holland's 1965 standards.\n\nAnd so as was the common practice at Motown, someone else was given a chance to come up with a song for the group. \"Loving You is Sweeter Than Ever\" was written by Ivy Jo Hunter, a songwriter and producer whose biggest contribution to this point had been co-writing \"Dancing in the Street\", and Stevie Wonder, a child star who'd had a hit a couple of years earlier but never really followed up on it, and who also played drums on the track:\n\n[Excerpt: The Four Tops, \"Loving You is Sweeter Than Ever\"]\n\nWithin a few months, Wonder would begin a run of hit singles that would continue for more than a decade, and would become arguably the most important artist on Motown. But that golden period hadn't quite started yet, and \"Loving You is Sweeter Than Ever\" didn't make the top forty.\n\nAt this point, it would have been easy for the Four Tops to have been relegated to the same pile as artists like the Contours -- people who'd had a couple of hits on Motown, but had then failed to follow up with a decent career. Motown was becoming ever more willing to drop artists as dead weight, as Gordy was increasingly concentrating on a few huge stars -- Marvin Gaye, Smokey Robinson and especially the Supremes – to the exclusion of everyone else.\n\nBut then Holland, Dozier, and Holland got back up on top. They came up with two more number ones for the Supremes in quick succession. \"You Can't Hurry Love\" was recorded around the same time that \"Loving You is Sweeter Than Ever\" was failing to chart, and quickly became one of the Supremes' biggest ever hits. They followed that with a song inspired by the sound of the breaking news alert on the radio, replicating that sound with the staccato guitars on what was their most inventive production to date:\n\n[Excerpt: The Supremes, \"You Keep Me Hanging On\"]\n\nNot only was that a number one record, it was soon followed by a top ten cover version by the heavy rock band Vanilla Fudge:\n\n[Excerpt: Vanilla Fudge, \"You Keep Me Hanging On\"]\n\nHolland, Dozier, and Holland were back on top, and they brought the Four Tops back to the top with them. The next single they recorded with the group, \"Reach Out, I'll Be There\", started with an instrumental introduction that Brian Holland was noodling with on the piano:\n\n[Excerpt: The Four Tops, \"Reach Out I'll Be There\"]\n\nHolland was playing that part, over and over, and then suddenly Lamont Dozier was hit with inspiration -- so much so that he literally pushed Holland to one side without saying anything and started playing what would become the verse:\n\n[Excerpt: The Four Tops, \"Reach Out I'll Be There\"]\n\nThe interesting thing about that track is that it shows how the different genres that were charting at the time would have more influence on each other than it might appear from this distance, where we put them all into neat little boxes named \"folk-rock\" or \"Motown\". Because Lamont Dozier was very specifically being influenced by Bob Dylan and \"Like a Rolling Stone\", when it came to how the song was phrased. Now, this is not something that I would ever in a million years have thought of, but once you know it, the influence is absolutely plain -- the way the melody stresses and elongates the last syllable of each line is pure Dylan.\n\nTo show this, I am afraid I'm going to have to do something that I hoped I'd never, ever, have to do, which is do a bad Bob Dylan impression. Everyone thinks they can impersonate Dylan, everyone's imitations of Dylan are cringeworthy, and mine is worse than most. This will sound awful, but it *will* show you how Dozier was thinking when he came up with that bit of melody:\n\n[demonstrates]\n\nLet us never speak of that again.\n\nI think we'd better hear how Levi Stubbs sang it again, hadn't we, to take that unpleasant sound away:\n\n[Excerpt: The Four Tops, \"Reach Out I'll Be There\"]\n\nThat became the group's second and last number one single, and also their only UK number one.\n\nUnfortunately, Holland, Dozier, and Holland were so hot at this point that they ended up competing with themselves. Norman Whitfield, one of the other Motown songwriter-producers, had wanted for a while to produce the Temptations, whose records were at this point mostly written and produced by Smokey Robinson. He called on Eddie Holland to help him write the hit that let him take over from Robinson as the Temptations' producer, \"Ain't Too Proud to Beg\":\n\n[Excerpt: The Temptations, \"Ain't Too Proud to Beg\"]\n\nDozier and Brian Holland were fine with Eddie working with another writer -- they all did that kind of thing on occasion -- until the date of the BMI Awards. The previous two years, the trio had been jointly given BMI's award for most successful songwriter of the year. But that year, Eddie Holland got the award on his own, for having written more hits than anyone else (he'd written eight, Dozier and Brian Holland had written six. According to a contemporary issue of Billboard, John Sebastian was next with five, then Lennon/McCartney and Jagger/Richards with four each.)\n\nHolland felt bad that he'd inadvertently prevented his collaborators from winning the award for a third year in a row, and from this point on he'd be much more careful about outside collaborations.\n\nHolland, Dozier, and Holland wrote two more classic singles for the Four Tops, \"Standing in the Shadows of Love\", and \"Bernadette\". That latter had been inspired by a coincidence that all three of Holland, Dozier, and Holland had at one time or another dated or felt unrequited love for different girls called Bernadette, but it proved extremely difficult to record.\n\nWhen the trio wrote together, Eddie Holland would always sing the songs, and the melodies were constructed around his tenor vocal range. Stubbs was a baritone, and sometimes couldn't hit some of the higher notes in the melodies, and he was having that problem with \"Bernadette\". Eddie Holland eventually solved the problem by inviting in a few fans who had been hanging around outside hoping for autographs. Stubbs being a performer wasn't going to make himself look bad in front of an audience, and sang it perfectly:\n\n[Excerpt: The Four Tops, \"Bernadette\"]\n\n\"Bernadette\" made the top five, and it was followed by a couple more top twenty hits with lesser Holland/Dozier/Holland songs, but then the writer-producers quit Motown, for reasons we'll look at in a few months when we take our last look at the Supremes. This left the Four Tops stranded -- they were so associated with their producers that nobody else could get hits with them.\n\nFor a while, Motown turned to an interesting strategy with them. It had been normal Motown practice to fill albums up with cover versions of hits of the day, and so the label put out some of this album filler as singles, and surprisingly had some chart success with cover versions of the Left Banke's baroque pop hit \"Walk Away Renee\":\n\n[Excerpt: The Four Tops, \"Walk Away Renee\"]\n\nand of Tim Hardin's folk ballad \"If I Were a Carpenter\":\n\n[Excerpt: The Four Tops, \"If I Were a Carpenter\"]\n\nAnd so for a while many of the singles the group released, both in the US and elsewhere, were covers of songs that were very far from the normal Motown style -- the Jimmy Webb ballad \"Do What You Gotta Do\" made the UK top twenty, their cover of another Jimmy Webb song, \"MacArthur Park\", made the lower reaches of the US top forty, their version of the old standard \"It's All in the Game\" made number twenty-four, and they released a version of \"River Deep, Mountain High\", teaming up with the Supremes, that became more successful in the US than the original, though still only just made the top forty.\n\nBut they were flailing. Motown had no idea what to do with them other than release cover versions, and any time any of Motown's writing and production teams tried to come up with something new for the group it failed catastrophically.\n\nIn 1972 they signed to ABC/Dunhill, and there they had a few hits, including a couple that made the top ten, but soon the same pattern emerged -- no-one could reliably get hits with the group, and they spent much of the seventies chasing trends and failing to catch them.\n\nThey had one more big US hit in 1981, with \"When She Was My Girl\", which made number eleven, and which went to number one on the R&B charts:\n\n[Excerpt: The Four Tops, \"When She Was My Girl\"]\n\nBut from that point on they were essentially a nostalgia act, though they carried on releasing records through the eighties.\n\nThe group's career nearly came to a premature end in 1988. They were in the UK to promote their single \"Loco in Acapulco\", co-written by Lamont Dozier and Phil Collins, from the soundtrack of Collins' film Buster:\n\n[Excerpt: The Four Tops, \"Loco in Acapulco\"]\n\nThat was a UK top ten hit, but it nearly led to the group's death -- they were scheduled to fly out of the UK on Pan Am flight 103 to Detroit on the twenty-first of December 1988. But the group were tired after recording an appearance on Top of the Pops the night before, slept in, and missed the flight. The flight fell victim to a terrorist bombing -- the Lockerbie bombing -- and everyone on it died.\n\nThe group carried on performing together after that, but their last new single was released in 1989, and they only recorded one more album, a Christmas album in 1995. They performed together, still in their original lineup, until 1997 when Lawrence Payton died from cancer. At first the group continued as a trio, retiring the Four Tops name and just performing as The Tops, but eventually they got in a replacement. By the turn of the century, Levi Stubbs had become too ill to perform as well -- he retired in 2000, though he came back for a one-off performance for the group's fiftieth anniversary in 2004, and he died in 2008. Obie Benson continued performing with the group until three months before his death in 2005.\n\nA version of the Four Tops continues to perform, led by Abdul Fakir, and also featuring Lawrence Payton's son Roquel, named after Roquel Davis, who performs under the name Lawrence Payton Jr.\n\nThe Four Tops were one of those groups that never quite lived up to their commercial potential, thanks in large part to Holland, Dozier, and Holland leaving Motown at precisely the wrong moment, and one has to wonder how many more hits they could have had under other circumstances. But the hits they did have included some of the greatest records of the sixties, and they managed to continue working together, without any public animosity, until their deaths. Given the way the careers of more successful groups have tended to end, perhaps it's better this way.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and thirty-two of A History of Rock Music in Five Hundred Songs looks at “I Can't Help Myself” by the Four Tops, and is part two of a three-episode look at Motown in 1965. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Colours\" by Donovan.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nNo Mixcloud this week, as too many of the songs were by the Four Tops.\n\nAmazingly, there are no books on the Four Tops, so I've had to rely on the information in the general Motown sources I use, plus the liner notes for the Four Tops 50th Anniversary singles collection, a collection of the A and B sides of all their Motown singles. That collection is the best collection of the Four Tops' work available, but is pricey -- for a cheaper option this single-disc set is much better value.\n\nFor Motown-related information in this and other Motown episodes, I’ve used the following resources:\n\nWhere Did Our Love Go? The Rise and Fall of the Motown Sound by Nelson George is an excellent popular history of the various companies that became Motown.\n\nTo Be Loved by Berry Gordy is Gordy’s own, understandably one-sided, but relatively well-written, autobiography.\n\nWomen of Motown: An Oral History by Susan Whitall is a collection of interviews with women involved in Motown.\n\nI Hear a Symphony: Motown and Crossover R&B by J. Andrew Flory is an academic look at Motown.\n\nThe Motown Encyclopaedia by Graham Betts is an exhaustive look at the people and records involved in Motown’s thirty-year history.\n\nHow Sweet It Is by Lamont Dozier and Scott B. Bomar is Dozier’s autobiography, while Come and Get These Memories by Brian and Eddie Holland and Dave Thompson is the Holland brothers’.\n\nAnd Motown Junkies is an infrequently-updated blog looking at (so far) the first 694 tracks released on Motown singles.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nThis is the second part of a two-part look at the work of Holland, Dozier, and Holland, and part of a three-part look at Motown Records in the mid-sixties. If you've not listened to the last episode, on the Supremes, you might want to listen to that one before this.\n\nThere's a clip of an old radio comedy show that always makes me irrationally irritated when I hear it, even though I like the programme it's from:\n\n[Excerpt of The Mark Steel Lectures, “Aristotle” episode. Transcript: \"Which led him back to the problem, what is it that makes something what it is? Is an apple still an apple when it's decomposing? I went to see the Four Tops once and none of the original members were in the band, they were just session musicians. So have i seen the Four Tops or not? I don't know\" ]\n\nThat's the kind of joke that would work with many vocal groups -- you could make the joke about the Drifters or the Ink Spots, of course, and it would even work for, for example, the Temptations, though they do have one original member still touring with them. Everyone knows that that kind of group has a constantly rotating membership, and that people come and go from groups like that all the time.\n\nExcept that that wasn't true for the Four Tops at the time Mark Steel made that joke, in the late 1990s. The current version of the Four Tops does only have one original member -- but that's because the other three all died. At the time Steel made the joke, his only opportunity to see the Four Tops would have been seeing all four original members -- the same four people who had been performing under that name since the 1950s.\n\nOther groups have had longer careers than that without changing members -- mostly duos, like Simon & Garfunkel or the Everly Bro",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and thirty-two of A History of Rock Music in Five Hundred Songs looks at “I Can't Help Myself” by the Four Tops, and is part two of a three-episode look at Motown in 1965. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Colours\" by Donovan.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nNo Mixcloud this week, as too many of the songs were by the Four Tops.\n\nAmazingly, there are no books on the Four Tops, so I've had to rely on the information in the general Motown sources I use, plus the liner notes for the Four Tops 50th Anniversary singles collection, a collection of the A and B sides of all their Motown singles. That collection is the best collection of the ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}