{
  "title": "How to Build Better Tableau Projects (The Ultimate Guide)",
  "link": "https://www.dataquest.io/blog/tableau-projects/",
  "comments": "https://www.dataquest.io/blog/tableau-projects/#respond",
  "dc:creator": "Ray Harris",
  "pubDate": "Wed, 12 Oct 2022 11:00:00 +0000",
  "category": "Building a Data Science Portfolio",
  "guid": "https://www.dataquest.io/?p=41075",
  "description": "Do you want to learn Tableau? Then practice, practice, practice! Here are six resources that will build your Tableau skills — and your portfolio! Tableau is an incredibly powerful, all-encompassing data visualization tool. It can create beautiful, crisp data visualizations using a variety of chart types. It also has a number of powerful, built-in calculations. [&#8230;]",
  "content:encoded": "<h3>Do you want to learn Tableau? Then practice, practice, practice! Here are six resources that will build your Tableau skills — and your portfolio!</h3>\n<p>Tableau is an incredibly powerful, all-encompassing data visualization tool. It can create beautiful, crisp data visualizations using a variety of chart types. It also has a number of powerful, built-in calculations. This creates endless possibilities for Tableau Projects, either self-guided or as part of a wider community, that you can complete to go from a beginner Tableau developer to intermediate — or from intermediate to professional. </p>\n<p>What follows is a list of resources that can guide you through tableau project ideas to help you build your skills!&nbsp;</p>\n<h2>Start Building&nbsp;</h2>\n<p>Staring at a blank canvas is simultaneously freeing and challenging! We can feel overwhelmed by all the possibilities. However, if we have an interesting data source or an analysis, then there’s no better way to learn than by simply jumping into a challenge! </p>\n<p>You can run the full scope of a data visualization project from data discovery to dashboard design and implementation. When you&#8217;re done, share it on <a href=\"https://public.tableau.com/app/discover\" target=\"_blank\" rel=\"noreferrer noopener\">Tableau Public</a> profile, and invite friends and coworkers to comment on your project. </p>\n<p>If the prospect of a blank canvas excites you but you’re unsure where to find data, check out this resource on <a href=\"https://www.dataquest.io/blog/free-datasets-for-projects/\" target=\"_blank\" rel=\"noreferrer noopener\">24 free datasets for building a data portfolio</a>. You can find additional datasets using <a href=\"https://datasetsearch.research.google.com/\">Google&#8217;s dataset search</a>, at <a href=\"https://www.kaggle.com/datasets\">Kaggle.com</a>, or at <a href=\"https://data.world/search?type=resources\">data.world</a>.  </p>\n<h2>Makeover Monday</h2>\n<p>If you&#8217;re struggling to find inspiration for your own Tableau project idea, the Tableau Community has you covered. </p>\n<p><a href=\"https://www.makeovermonday.co.uk/data/\" target=\"_blank\" rel=\"noreferrer noopener\">Makeover Monday</a> is an eight-year tradition. Since 2016 (with a brief hiatus in 2022), they&#8217;ve posted a chart and an accompanying dataset on their website. Tableau users can then take the dataset to make a better version of the original visualization. The projects shared in this group don&#8217;t take much of your time, and doing one a week is certainly feasible. The data is curated and, typically, clean so you can focus on visualization. </p>\n<p>If you’re on Twitter or LinkedIn, you can also share your results with like-minded data professionals using the hashtag <a href=\"https://twitter.com/search?q=makeovermonday&src=typed_query\" target=\"_blank\" rel=\"noreferrer noopener\">#MakeoverMonday</a>.</p>\n<h2>Workout Wednesday&nbsp;</h2>\n<p><a href=\"https://twitter.com/search?q=makeovermonday&src=typed_query\" target=\"_blank\" rel=\"noreferrer noopener\">Workout Wednesday</a> challenges us to explore niche Tableau features, usually in the calculation or design layers. These are good Tableau projects for practicing more advanced calculations or chart types that we may not use every day. It’s a great tool for pushing our Tableau boundaries and discovering useful functionalities that we may not discover otherwise. </p>\n<p>Results appear online with an accompanying blog post or how-to video. We can then take the techniques we’ve learned and apply them to another Tableau project idea.&nbsp;</p>\n<h2>Real-World Fake Date (RWFD)</h2>\n<p>Another Tableau project example created by the vibrant Tableau community is called <a href=\"https://sonsofhierarchies.com/real-world-fake-data/\" target=\"_blank\" rel=\"noreferrer noopener\">Real World Fake Data (RWFD)</a>. A major issue I’ve seen in delivering Tableau training is the datasets can often be non-conceptual. Sure, we can visualize the IMDB rating of every season of <em>Seinfeld</em>, but how does that help grow a business? RWFD tries to correct this by providing data that reflects a real-world business environment. The analysis more closely resembles the type of work that would be asked of a data professional in a job-like situation. </p>\n<p>Similar to Makeover Monday and Workout Wednesday, RWFD has a dedicated user group that shares, comments on, and encourages each other’s data visualization efforts.&nbsp;</p>\n<h2 id=\"h-tableau-viz-of-the-day\">Tableau Viz of the Day</h2>\n<p>Tableau Public has a phenomenal feature called <a href=\"https://public.tableau.com/app/discover/viz-of-the-day\" target=\"_blank\" rel=\"noreferrer noopener\">Viz of the Day</a>. Every week, Tableau features Tableau project examples created by other authors in the Viz of the Day feature of Tableau Public. These are typically elaborate and professional data visualizations that push the limits of what&#8217;s possible with Tableau functionality. While the majority of the Viz of the Days may not be relevant to you, they can still be a wonderful source of inspiration. </p>\n<p>Most of the time, you can download the Viz of the Day workbook. If there’s a specific design element or calculation that we&#8217;re curious about, we can download the Tableau file and try to reverse-engineer it. We can then, if we want, try to apply the same methodology and functionality to a project or data source we are already working on.&nbsp;</p>\n<h2>Building a Tableau Portfolio</h2>\n<p>A Tableau portfolio, typically on Tableau Public, is one of our most valuable tools for networking and growing as Tableau professionals. Filling out a Tableau public portfolio can be daunting. But hopefully this article has given you some ways to get started. </p>\n<p>No matter how you build out your Tableau Projects, keep in mind the value of the Tableau community. Participating and sharing your Tableau projects will lead to engagement and mentorship — both will help grow your skill sets and career.</p>\n",
  "wfw:commentRss": "https://www.dataquest.io/blog/tableau-projects/feed/",
  "slash:comments": 0
}