{
  "title": "Machine learning applied to showers in the OPERA",
  "description": "<p>\n\t<i>\n\tAbstract: in this post I explain how Machine Learning tools can be applied to particle physics. \n\tI'll discuss what is a particle shower, and when it appears in the OPERA and how clustering and classification \n\ttechniques can help fundamental research.\n\t</i>\n</p>\n<img src='/images/opera/post/opera-step1.png' style='margin: 20px 0px;'/>\n<p>\n\tThis post is based on the research I've done for the OPERA experiment.\n</p>\n<h2>\n\tWhat are particle showers?\n</h2>\n<p>\n\t\t<img src=\"/images/opera/post/cosmic-rays.jpg\" alt=\"\"><br />\n\t\t<small>\n\t\t\t\tIllustration from <a href=\"http://www.ep.ph.bham.ac.uk/DiscoveringParticles/detection/cosmic-rays/\">University of Birmingham</a>\n\t\t\t</small>\n</p>\n<p>\n\tWhen a charged particle (I'll consider an electron as an example) with extremely high energy passes through an atmosphere\n\tor material, it collides with atoms and produces new particles (converting its energy into mass of new particles). These\n\tnewly-born particles also have high energy and also produce new particles when colliding with atoms, recursively forming\n\ta cascade of particles. Energy of an electron is enough for producing only finite number of new particles, thus this process\n\tstops and produced particles are stopped in the matter and absorbed.\n</p>\n<p>\n\tThere are <a href=\"https://en.wikipedia.org/wiki/Air_shower_(physics)\">atmospheric particle showers</a> produced by high\n\tenergy cosmic rays. But showers also can be observed in particle detectors, i.e. at the Large Hadron Collider, when a high-energy\n\tparticle penetrates the detector.\n</p>\n<h2>\n\tWhat is OPERA?\n</h2>\n<p>\n\t<img src=\"/images/opera/post/opera-large.jpg\" width='100%' alt=\"\">\n\t<br />\n\t<small>\n\t\t\tInside OPERA, \n\t\t\timage from <a href=\"http://www.symmetrymagazine.org/article/february-2010/gran-sasso-a-tale-of-physics-in-the-mountains\">symmetrymagazine</a>.\n\t\t</small>\n</p>\n<p>\n\tThe <a href='http://operaweb.lngs.infn.it'>OPERA</a> (Oscillation Project with Emulsion-tRacking Apparatus) is an international experiment\n\tin particle physics placed in Italy. Its main goal was to study the neutrino transitions (these studies performed by different\n\texperiments resulted in confirmation of neutrino oscillations and\n\t<a href='https://www.nobelprize.org/nobel_prizes/physics/laureates/2015/'>Nobel Prize 2015</a>).\n</p>\n<p>\n\tNeutrino can easily travel long distances through any matter (other known particles can't), so neutrino beam <a href='https://en.wikipedia.org/wiki/CERN_Neutrinos_to_Gran_Sasso'>was sent through mountains</a>\tfrom CERN (Geneva, Switzerland) to Gran Sasso (Italy).\n</p>\n<p>\n\tOPERA has a huge detector, which contains around 150'000 bricks 8.5 kg each. Each brick contains interleaving layers of lead and\n\tnuclear emulsion. Nuclear emulsion (somehow resembles emulsion in old film photo cameras) keeps the tracks of particles\n\tfor a long time (up to years), thus after scanning of emulsion we get a picture of the physics processes, whereas lead layers\n\tare needed to increase fraction of interacting neutrinos.\n</p>\n<p>\n\t<center>\n\t\t<img src=\"/images/opera/post/opera-brick-visible.png\" alt=\"\" style=\"height: 300px; width: 350px;\"><br />\n\t\t<small>\n\t\t\tOpera brick, one of sides was removed to show layers of emulsion and lead, \n\t\t<a href='https://www-opera.desy.de/publications/Doktorarbeit-Jan-Lenkeit.pdf'>image source</a>\n\t</small>\n\t</center>\n</p>\n<!--Возможно: почему именно так устроен детектор?-->\n<p>\n\tWhen emulsion is scanned, parts of the tracks are reconstructed (called <strong>basetracks</strong>), but the scanning is very precise \n\t(position resolution is few micrometers) and thus takes much time (complete scanning of a single brick takes days). \n\tThe result of scanning is huge amount of basetracks (around $10^9$\n\tbasetracks in complete brick, or even more), however very few of these basetracks do correspond to some real particle track &mdash; most\n\tof the basetracks are noise, or instumental background as physicists say\n\t(bricks are collecting information for years before being extracted, developed and scanned, \n\temulsion properties may become much worse, and during development fog grains appear, \n\ttheir random alignment is erroneusly recognized as a basetrack).\n</p>\n<p>\n\n</p>\n<h2>\n\tCleaning the data with machine learning\n</h2>\n<div>\n\t<img src='/images/opera/post/opera-1-brick-part.png' />\n\t<small> </small>\n</div>\n\n<p>\n\tNoise is absolutely dominating in the data (noise to signal ratio is around $10^4 - 10^6$), and to get something useful from\n\tthis mess, serious cleaning of data is required. \n\tOn the picture above you see visualization of scanning results, \n\thardly any details are visible, but in fact this picture has only 1% of real amount of reconstructed tracks. \n\tAnd this is not the whole brick, but less than 1% of its complete volume. \n\tAt such scales any analysis can be done only with programs.\n</p>\n<p>\n\tThere is not so much information that scanning provides: position of basetrack, it's direction and quality (typically in\n\tparticle physics this information is provided with $\\chi^2$ &mdash; quality of fit). The last one can reduce amount of background\n\tby several times, but we need something much more powerful.\n</p>\n<p>\n\tThe most important knowledge we have is that <i>background doesn't have any geometrical structure</i>, while signal basetracks are\n\tforming tracks or showers. Tracks are straight lines and have very simple geometrical pattern, but showers are more complicated.\n</p>\n<p>\n\tConstructing good geometry-based features that grasp this difference is crucial. Good feature engineering coupled with appropriate\n\tmachine learning algorithm gives very nice results as we will see.\n</p>\n<h2>\n\tFinding appropriate \"neighboring\" basetracks\n</h2>\n<p>\n\tTo understand if this particular basetrack is a noise or corresponds to some real particle, we can look around and try to\n\tfind appropriate \"neighbours\": if it is a track, then there should be basetracks left by the same particle on other layers,\n\ttogether they should form a straight line. If the basetrack is part of a shower, there should be basetracks left by a parent particle\n\tof by children particles (produced by current track).\n</p>\n<p>\n\tNaive approach was to take position of the basetrack under consideration and to find closest basetracks in neighboring layers, \n\tbut as shown on the scheme, this rarely selects appropriate basetrack. \n\tOur goal is to introduce such distance measure between basetracks, which takes into account:\n\t<ul>\n\t\t<li>how close second basetrack to the direction line of the first one</li>\n\t\t<li>how close are directions of the basetracks</li>\n\t</ul>\n</p>\n<div style=\"margin-bottom: 10px;\">\n\t<img src=\"/images/opera/post/opera_neighbors_captions.png\">\n\t<div>\n\t\t<small>\n\t\tExample of searching for an good neighbour for a basetrack from left layer. \n\t\tBasetracks are green and their direction lines are blue, \n\t\tgood neighbour should be close to the direction line. \n\n\t\tYou can see introduced planes (shown with dashes) and intersection points (red and blue).\n\t\tFor an optimal track both distances are small, thus the final distance between tracks is small as well.\n\t\t</small>\n\t</div>\n</div>\n<p>\n\tSimple and elegant solution is to introduce two planes and consider the intersection of planes and basetracks' direction\n\tlines. Basetracks lie on the same line if (and only if) intersection points coincide. And we can use sum of distances between\n\tprojections as a distance between basetracks.\n</p>\n<p>\n\tSidenote: neighbours search is exetremely heavy if not optimized, for instance, computing distances between all pairs of\n\tbasetracks takes $ O ( N^2_\\text{basetracks} ) $, so some hacks are required to make it feasible.\n</p>\n<h2>\n\tEngineering geometrical features\n</h2>\n<p>\n\tAfter neighboring candidate basetracks are found, we need to estimate how likely selected basetracks are indeed part of some\n\tsignal pattern (a track or a shower). \n\tThe problem at hand is a binary classification problem (signal or noise), \n\tand can be approached with machine learning classification techniques. \n\tI used <a href=\"/2016/06/24/gradient_boosting_explained.html\">gradient boosting</a> here and it provides \n\tvery informative result, though insufficient to get the clear picture.\n</p>\n<p>\n\t<img src=\"/images/opera/post/features_new.png\" />\n\t\n</p>\n<p>\n\tFeatures that help to disciminate signal and background are computed: angle between directions, impact parameters, \n\tmixed product of two directions and a vector connecting positions of basetracks, some projections, etc. \n\tBasetracks' $\\chi^2$ qualities are also used. \n\tAll of these features are combined into a single prediction by gradient boosting.\t\n</p>\n<h2>\n\tLooking further\n</h2>\n<p>\n\tTo make the classification even stronger, we can collect more information about the neighbourhood. In particular, we can look\n\tat further layers (not only next or previous). Also we can make use of the information computed by gradient boosting at\n\tthe previous step by providing it as a feature for new machine learning model (this trick is called stacking).\n</p>\n<p>\n\t<img src='/images/opera/post/features_more_layers.png' /><br />\n\t<small>\t\n\t\tTo understand whether some basetrack (red in this scheme) is part of the pattern or not, \n\t\twe are analyzing basetracks (violet in this scheme) from different layers (preferring the tracks which have close direction and position). \n\t\tFor each of those tracks a set of features is computed, \n\t\tand output of previous model for the nearest tracks from closest layers.\n\t</small>\n</p>\n<p>\n\tAnalysis of the neighbourhood now has two stages and incorporates much more information about basetracks nearby. \n\tIt is capable of reducing almost all the background at the price of losing around 50% of signal basetracks. \n\tThat's how it looks like:\n</p>\n<img src='/images/opera/opera_global_filtering_movie.gif' />\n<small>\t\n\tLooking at single particle shower when increasing classification threshold. Green tracks are part of a shower, background tracks (noise) are red.\n\tThresholding to keep around 50% signal tracks is enough to detect the presence of a shower quite easily.\n\tThere is also some minor background around the shower that's quite hard to get rid of, \n\tbut it doesn't cause any problems for shower detection.\n</small>\n<h2>\n\tResult so far\n</h2>\n<div>\n\t<img src='/images/opera/post/opera-step2.png' style=\"margin-bottom: 20px;\"/>\n</div>\n<p>\n\tWe reduced amount of tracks to analyze to some sensible amount, which is already great. \n\tMany patterns are already visible to a naked eye in 3d visualization (in particular, showers can be seen quite easily), \n\tbut it would be much nicer if we could group basetracks into individual patterns.\n</p>\n<h2>\n\tNext time:\n</h2>\n<p>\n\tIn the next post I discuss the clustering being applied to this problem.\n</p>\n<img src='/images/opera/post/opera-step3.png' style=\"margin-bottom: 20px;\"/>\n\n<h2>\n\tReferences\n</h2>\n<ul>\n\t<li><a href=\"http://operaweb.lngs.infn.it\">Official website of the OPERA experiment</a> </li>\n\t<li><a href=\"https://www.slideshare.net/AdamSzewciw/photographic-emulsion\">Presentation about nuclear photo emulsion </a> </li>\n\t<li><a href=\"http://qfthep.sinp.msu.ru/talks2013/Qfthep_Cagin_Kam__scioglu_final1.pdf\">A presentation about structure and scanning process in the OPERA</a>\t\t</li>\n\t<li><a href=\"https://www-opera.desy.de/publications/Doktorarbeit-Jan-Lenkeit.pdf\">Thesis with more details about OPERA </a> </li>\n</ul>",
  "pubDate": "Sat, 24 Jun 2017 00:00:00 +0000",
  "link": "https://arogozhnikov.github.io/2017/06/24/opera.html",
  "guid": "https://arogozhnikov.github.io/2017/06/24/opera.html",
  "category": [
    "machine learning",
    "OPERA",
    "particle physics"
  ]
}