{
  "title": "Most College Students Do See a Value in Voting",
  "link": "https://www.aei.org/politics-and-public-opinion/most-college-students-do-see-a-value-in-voting/",
  "dc:creator": "George Pierson",
  "pubDate": "Fri, 04 Nov 2022 14:23:55 +0000",
  "category": [
    "Elections",
    "Politics and Public Opinion",
    "Polls",
    "college",
    "Generation Z",
    "Midterm elections",
    "voting",
    "Young voters"
  ],
  "guid": "https://www.aei.org/?p=1008664774",
  "description": "<p>Gen Z Americans believe voting can make a difference, but a strong turnout is not assured. Nor should a strong showing by Gen Z students be assumed to be a win for the Democrats.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/politics-and-public-opinion/most-college-students-do-see-a-value-in-voting/\">Most College Students Do See a Value in Voting</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<p>Despite widespread politicization of life on collegiate campuses today, along with <a href=\"https://www.acenet.edu/News-Room/Pages/2022-Political-Campaigns-Issue-Brief.aspx\" target=\"_blank\" rel=\"noreferrer noopener\">increased voter turnout</a> and <a href=\"https://www.newsweek.com/women-college-are-moving-left-men-are-migrating-right-opinion-1742192\" target=\"_blank\" rel=\"noreferrer noopener\">political activity</a> among college students in recent years, questions about their turnout next week remain. New survey data reveal that for all the difficulties faced by students to vote, from registering away from home to traveling to the polls on Election Day, the majority of college and university students do see the value of voting today even though <a href=\"https://www.nytimes.com/2020/10/08/upshot/youth-voting-2020-election.html\" target=\"_blank\" rel=\"noreferrer noopener\">most young people in the United States do not vote</a>. So, what might this mean for the upcoming elections?</p>\n\n\n\n<p><a href=\"https://www.nytimes.com/2022/10/31/us/politics/democrats-republicans-senate-election-polls.html\" target=\"_blank\" rel=\"noreferrer noopener\">Recent polling shows</a> that there is a strong possibility of a national rejection of the Democratic Party. But will Gen Z be part of the narrative, finally be regarded as a real electoral cohort, and play a pivotal role in a host of tight races that will shape the direction of Congress?</p>\n\n\n\n<p>We will only know the answers on Election Day itself. However, we do have strong indicators that Gen Z college and university students have not become apathetic or turned off from politics. College Pulse&#8217;s Future of Politics survey held interviews with over 1,500 undergraduate students at 91 different colleges and universities at the end of summer break. <a href=\"https://www.usnews.com/news/elections/articles/2022-10-27/motivated-youth-in-play-at-the-polls\" target=\"_blank\" rel=\"noreferrer noopener\">Vote intention questions</a> are very dubious and unreliable, but the survey does shed some light on the question of turnout. The survey asks if respondents “think that voting lets people like you make a difference in how government works, or do you think that voting doesn&#8217;t really make a difference?” The data leans to the positive side: Almost six in 10 (59 percent) college and university students today do believe that voting does indeed make a difference, while just over a quarter (29 percent) feel that voting has no real impact.</p>\n\n\n\n<p>In addition, partisan students are more likely to think that voting matters compared to Independents. Almost three-quarters of Democratic students (73 percent) and two-thirds of Republican students (67 percent) currently believe that voting can have an impact. Eight in 10 strong Democrats currently think that voting matters, and this is only 8 points higher than their strong Republican counterparts.</p>\n\n\n\n<p>There is no elite effect here either. While elite colleges and universities tend to fare worse on issues like viewpoint diversity and free speech, the data show that students at higher-ranked schools do not have higher levels of electoral efficacy compared to lower-ranked schools. Sixty-two percent of students in the top 25 colleges and universities, and 61 percent of students in schools ranked over 101, believe that voting makes a difference in shaping policy. Sixty-four percent of students in regional schools feel the same way. This suggests that those who engage in higher education recognize the power and value of casting a ballot.</p>\n\n\n\n<p>There are some demographic cleavages worth noting. Students of working-class backgrounds have lower efficacy rates, with 55 percent of students here believing that their vote has power compared to 63 percent of those from upper-middle-class backgrounds. Although not a huge difference, clearly historical legacy issues persist with respect to ideas about the power of voting and whose voice matters; higher education may help correct these misconceptions.</p>\n\n\n\n<p>As for race and gender, there have long been questions about the value of voting among minority communities, and differences in terms of gender are practically non-existent as we head into next week. Fifty-nine percent of both men and women believe that voting does make a difference. With respect to race, 61 percent of White students, 62 percent of Hispanic, and 60 percent of Asian students all state that voting makes a difference. Yet, just 49 percent of Black students in our nation’s colleges and universities believe that this is true, and this could be partly a result of historical cases of voter intimidation and suppression and lack of trust and skepticism in the government.</p>\n\n\n\n<p>In short, there is strong support for the value of voting in 2022, but a strong turnout is not assured. Nor should a strong showing by Gen Z students be assumed to be a win for the Democrats. <a href=\"https://5666503.fs1.hubspotusercontent-na1.net/hubfs/5666503/CFSR_2022_Report.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">FIRE’s 2022 survey</a> of almost 45,000 currently enrolled students at over 200 schools reveals students are not monolithically Democratic whatsoever. About a third of students (34 percent) are Democrats and 12 percent are Republicans. Most students happen to be Independents or leaners (54 percent). This large middle is unanchored, leaning to the right for many candidates and races. College students could make a difference and we know they are not turned off. Keep an eye on this group next week.</p>\n\n\n\n<p><em>Samuel J. Abrams is a professor of politics at Sarah Lawrence College and a senior fellow at the American Enterprise Institute.</em></p>\n\n\n\n<div class=\"related-items shortcode \"><p><strong>Learn more: </strong><a href=\"https://www.aei.org/politics-and-public-opinion/why-are-liberal-arts-college-faculty-building-better-relationships-with-their-students/\">Why Are Liberal Arts College Faculty Building Better Relationships with Their Students?</a> | <a href=\"https://www.aei.org/society-and-culture/the-positive-side-of-social-media/\">The Positive Side of Social Media</a> | <a href=\"https://www.aei.org/op-eds/finding-third-places-across-america/\">Finding third places across America</a> | <a href=\"https://www.aei.org/articles/cancel-culture-is-not-just-in-colleges-and-universities/\">Cancel Culture Is Not Just in Colleges and Universities</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/politics-and-public-opinion/most-college-students-do-see-a-value-in-voting/\">Most College Students Do See a Value in Voting</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}