{
  "id": "https://bibleinoneyear.org/en/youth/298",
  "title": "Day 298: Your Most Valuable Possession",
  "description": "Psalm 119:97-104, Jeremiah 51:15-46, 2 Timothy 4:1-22.  His whole life has been about telling others the good news of Jesus  His last words urge Timothy to do the same",
  "pubDate": "Mon, 25 Oct 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/298/?ignore",
  "itunes:duration": "14:21",
  "guid": "enyouth25102021-298",
  "length": 861.96,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 298: Your Most Valuable Possession",
  "itunes:subtitle": "Psalm 119:97-104, Jeremiah 51:15-46, 2 Timothy 4:1-22.  His whole life has been about telling others the good news of Jesus  His last words urge Timothy to do the same",
  "itunes:summary": "As the novelist, historian and poet, Sir Walter Scott (1771–1832), lay dying, he turned to his great friend and son-in-law, J.G. Lockhart – the man who was later to write his life story – and said, ‘Will you read to me from the Book?’ Lockhart wondered which of his many books he meant – for he knew he was a great writer. So he asked, ‘Which book?’\n‘Which book?’ replied Scott, ‘There is but one book; bring the Bible.’ In his last moments on earth, he was comforted and encouraged by what God had to say to him. His last words were about his most valuable possession.\nIn the case of the apostle Paul, we don’t exactly know what his last words were. However, we do have his last recorded words; they are in our passage for today. As he comes to the end of this letter he writes, ‘The time has come for my departure. I have fought the good fight, I have finished the race, I have kept the faith’ (2 Timothy 4:7). We see his passion for Jesus Christ and his word. His whole life has been about telling others the good news of Jesus. His last words urge Timothy to do the same.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 298
}