{
  "title": "Phonon downconversion to suppress correlated errors in superconducting qubits. (arXiv:2203.06586v2 [quant-ph] UPDATED)",
  "link": "http://arxiv.org/abs/2203.06586",
  "description": "<p>Quantum error correction can preserve quantum information in the presence of\nlocal errors, but correlated errors are fatal. For superconducting qubits,\nhigh-energy particle impacts from background radioactivity produce energetic\nphonons that travel throughout the substrate and create excitations above the\nsuperconducting ground state, known as quasiparticles, which can poison all\nqubits on the chip. We use normal metal reservoirs on the chip back side to\ndownconvert phonons to low energies where they can no longer poison qubits. We\nintroduce a pump-probe scheme involving controlled injection of pair-breaking\nphonons into the qubit chips. We examine quasiparticle poisoning on chips with\nand without back-side metallization and demonstrate a reduction in the flux of\npair-breaking phonons by over a factor of 20. We use a Ramsey interferometer\nscheme to simultaneously monitor quasiparticle parity on three qubits for each\nchip and observe a two-order of magnitude reduction in correlated poisoning due\nto background radiation.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/quant-ph/1/au:+Iaia_V/0/1/0/all/0/1\">V. Iaia</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Ku_J/0/1/0/all/0/1\">J. Ku</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Ballard_A/0/1/0/all/0/1\">A. Ballard</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Larson_C/0/1/0/all/0/1\">C. P. Larson</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Yelton_E/0/1/0/all/0/1\">E. Yelton</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Liu_C/0/1/0/all/0/1\">C. H. Liu</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Patel_S/0/1/0/all/0/1\">S. Patel</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+McDermott_R/0/1/0/all/0/1\">R. McDermott</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Plourde_B/0/1/0/all/0/1\">B. L. T. Plourde</a>"
}