{
  "title": "KubeCon, Kindness, and Legos with Michael Chenetz",
  "itunes:season": 3,
  "itunes:episode": 11,
  "itunes:title": "KubeCon, Kindness, and Legos with Michael Chenetz",
  "itunes:episodeType": "full",
  "guid": "ada535ce-1736-40b9-bd2b-a6b2d0eb8910",
  "link": "https://share.transistor.fm/s/13c98600",
  "description": "<p>Today we chat with Cisco’s head of developer content, community, and events, Michael Chenetz. We discuss everything from KubeCon to kindness and Legos! Michael delves into some of the main themes he heard from creators at KubeCon, and we discuss methods for increasing adoption of new concepts in your organization. We have a conversation about attending live conferences, COVID protocol, and COVID shaming, and then we talk about how Legos can be used in talks to demonstrate concepts. We end the conversation with a discussion about combining passions to practice creativity.</p><p><br></p><ul>\n<li>We discuss our time at KubeCon in Spain (5:51)</li>\n<li>Themes Michael heard at KubeCon talking with creators (7:46)</li>\n<li>Increasing adoption of new concepts (9:27)</li>\n<li>We talk conferences, COVID shaming, and blamelessness (12:21)</li>\n<li>Legos and reliability  (18:04)</li>\n<li>Michael talks about ways to exercise creativity (23:20)</li>\n</ul><p><br></p><p><strong>Links:</strong></p><ul>\n<li>KubeCon October 2022: <a href=\"https://events.linuxfoundation.org/kubecon-cloudnativecon-north-america/\">https://events.linuxfoundation.org/kubecon-cloudnativecon-north-america/</a>\n</li>\n<li>Nintendo Lego Set: <a href=\"https://www.amazon.com/dp/B08HVXMQ87?ref_=cm_sw_r_cp_ud_dp_ED7NVBWPR8ANGT8WNGS5\">https://www.amazon.com/dp/B08HVXMQ87?ref_=cm_sw_r_cp_ud_dp_ED7NVBWPR8ANGT8WNGS5</a>\n</li>\n<li>Cloud Unfiltered podcast episode featuring Julie and Jason:<a href=\"https://podcasts.apple.com/us/podcast/ep125-chaos-engineering-with-julie-gunderson-and-jason/id1215105578?i=1000562393884\">https://podcasts.apple.com/us/podcast/ep125-chaos-engineering-with-julie-gunderson-and-jason/id1215105578?i=1000562393884</a>\n</li>\n</ul><p><br></p><p><strong>Links Referenced:</strong></p><ul>\n<li>Cisco: <a href=\"https://www.cisco.com/\">https://www.cisco.com/</a>\n</li>\n<li>\n<em>Cloud Unfiltered</em> Podcast with Julie and Jason: <a href=\"https://podcasts.apple.com/us/podcast/ep125-chaos-engineering-with-julie-gunderson-and-jason/id1215105578?i=1000562393884\">https://podcasts.apple.com/us/podcast/ep125-chaos-engineering-with-julie-gunderson-and-jason/id1215105578?i=1000562393884</a>\n</li>\n<li>\n<em>Cloud Unfiltered</em> Podcast: <a href=\"https://www.cisco.com/c/en/us/solutions/cloud/podcasts.html\">https://www.cisco.com/c/en/us/solutions/cloud/podcasts.html</a>\n</li>\n<li>Nintendo Lego: <a href=\"https://www.amazon.com/dp/B08HVXMQ87\">https://www.amazon.com/dp/B08HVXMQ87</a>\n</li>\n</ul><p><br></p><p><strong>Transcript</strong></p><p>Julie: And for folks that are interested in, too, what day it is—because I think we’re all still a little bit confused—it is Monday, May 24th that we are recording this episode.</p><p><br></p><p>Jason: Uh, Julie’s definitely confused on what day it is because it’s actually Tuesday, [laugh] May 24th.</p><p><br></p><p>Michael: Oh, my God. [laugh]. That’s great. I love it.</p><p><br></p><p>Julie: Welcome to <em>Break Things on Purpose</em>, a podcast about reliability, learning from each other, and blamelessness. In this episode, we talk to Michael Chenetz, head of developer content, community, and events at <a href=\"https://www.cisco.com/\">Cisco</a>, about all of the learnings from KubeCon, the importance of being kind to each other, and of course, how Lego translates into technology.</p><p><br></p><p>Julie: Today, we are joined by Michael Chenetz. Michael, do you want to tell us a little bit about yourself?</p><p><br></p><p>Michael: Yeah. [laugh]. Well, first of all, thank you for having me on the show. And I’m really good at breaking things, so I guess that’s why I’m asked to be here is because I’m superb at it. What I’m not so good at is, like, putting things back together.</p><p><br></p><p>Like when I was a kid, I remember taking my dad’s stereo apart; wasn’t too happy about that. Wasn’t very good at putting it back together. But you know, so that’s just going back a little ways there. But yeah, so I work for the DevRel at Cisco and my whole responsibility is, you know, to get people to know that know a little bit about us in terms of, you know, all the developer-related topics.</p><p><br></p><p>Julie: Well, and Jason and I had the awesome opportunity to hang out with you at KubeCon, where we got to join your <a href=\"https://www.cisco.com/c/en/us/solutions/cloud/podcasts.html\">Cloud Unfiltered</a> podcast. So folks, definitely go check out <a href=\"https://podcasts.apple.com/us/podcast/ep125-chaos-engineering-with-julie-gunderson-and-jason/id1215105578?i=1000562393884\">that episode</a>. We have a lot of fun. We’ll put a link in the [show notes 00:02:03]. But yeah, let’s talk a little bit about KubeCon. So, as of recording this episode, we all just recently traveled back from Spain, for KubeCon EU, which was… amazing. I really enjoyed being there. My first time in Spain. I got back, I can tell you, less than 24 hours ago. Michael, I think—when did you get back?</p><p><br></p><p>Michael: So, I got back Saturday night, but my bags have not arrived yet. So, they’re still traveling and they’re enjoying Europe. And they should be back soon, I guess when they’re when they feel like they’re—you know, they should be back from vacation.</p><p><br></p><p>Julie: [laugh].</p><p><br></p><p>Michael: So. [laugh].</p><p><br></p><p>Julie: Jason, how about you? When did you get home?</p><p><br></p><p>Jason: I got home on Sunday night. So, I took the train from Valencia to Barcelona on Saturday evening, and then an early morning flight on Sunday and got home late Sunday night.</p><p><br></p><p>Julie: And for folks that are interested in, too, what day it is—because I think we’re all still a little bit confused—it is Monday, May 24th that we are recording this episode.</p><p><br></p><p>Jason: Uh, Julie’s definitely confused on what day it is because it’s actually Tuesday, [laugh] May 24th.</p><p><br></p><p>Michael: Oh, my God. [laugh]. That’s great. I love it. By the way, yesterday was my birthday so I’m going to say—</p><p><br></p><p>Julie: Happy birthday.</p><p><br></p><p>Michael: —happy birthday to myself.</p><p><br></p><p>Julie: Oh, my gosh, happy birthday. [laugh].</p><p><br></p><p>Michael: Thank you [laugh].</p><p><br></p><p>Julie: So… what is time anyway?</p><p><br></p><p>Jason: Yeah.</p><p><br></p><p>Michael: It’s all good. It’s all relative. Time is relative.</p><p><br></p><p>Julie: Time is relative. And so, you know, tell us a little bit about—I’d love to know a little bit about why you want folks to know about, like, what is the message you try to get across?</p><p><br></p><p>Jason: Oh, that’s not the question I thought you were going to ask. I thought you were going to ask, “What’s on your Amazon wishlist so people can send you birthday presents?”</p><p><br></p><p>Julie: Yeah, let’s back up. Let’s do that. So, let’s start with your Amazon wishlist. We know that there might be some Legos involved.</p><p><br></p><p>Michael: Oh, my God, yeah. I mean, you just told me about a cool one, which was Optimus Prime and I just—I’m already on the website, my credit card is out and I’m ready to buy. So, you know, this is the problem with talking to you guys. [laugh]. It’s definitely—you know, that’s definitely on my list. So, anything that, anything music-related because obviously behind me is a lot of music equipment—I love music stuff—and anything tech. The combination of tech and music, and if you can combine Legos and that, too, man that would just match all the boxes. [laugh].</p><p><br></p><p>Julie: Just to let you know, there’s a Lego Con. Like, I did not know this until last night, actually. But it is a virtual conference.</p><p><br></p><p>Michael: Really.</p><p><br></p><p>Julie: Yeah. But one of the things I was looking at actually on Lego, when you look at their website, like, to request one of their speakers, to request one of their engineers as a speaker, they actually don’t do that because they get so many requests for their folks to speak at conferences, they actually have a dedicated part of their website that talks about this. So, I thought that was interesting.</p><p><br></p><p>Michael: Well listen, just because of that, if they want somebody that’s in, you know, cloud computing, I’m not going to go talk for Lego. And I know they really want somebody from cloud computing talking to Lego, so, you know… it’s, you know, quid pro quo there, so that’s just the way it’s going to work. [laugh].</p><p><br></p><p>Julie: I want to be best friends with Lego people.</p><p><br></p><p>Michael: [laugh]. I know, me too.</p><p><br></p><p>Julie: I’m just going to make it a goal in life now to have one of their engineers speak at DevOpsDays Boise. It’s like a challenge.</p><p><br></p><p>Michael: It is. I accept it.</p><p><br></p><p>Julie: [laugh]. With that, though, just on other Lego news, before we start talking about all the other things that folks may also want to hear about, there is another new Lego, which is the Van Gogh <em>Starry Night</em> that has been newly released by the time this episode comes out.</p><p><br></p><p>Michael: With a free ear, right?</p><p><br></p><p>Julie: I mean—[laugh].</p><p><br></p><p>Michael: Is that what happens?</p><p><br></p><p>Julie: —well played. Well, played. [laugh]. So, now you really got to spend a lot of time at KubeCon, you were just really recording podcast after podcast.</p><p><br></p><p>Michael: Oh, my God. Yeah. So, I mean, it was great. I love—because I’m a techie, so I love tech and I love to find out origin stories of stuff. So, I love to, like, talk to these people and like, “Why did that come about? How did—” you know, “What happened in your life that made you want to do this? Who hurt you?” [laugh].</p><p><br></p><p>And so, that’s what I constantly try and figure out is, like, [laugh], “What is that?” So, it was really cool because I had, like, Jimmy Zelinskie who came from CoreOS, and he came from—you know, they create, you know, Quay and some of this other kinds of stuff. And you know, just to talk about, like, some of the operators and how they came about, and like… those were the original operators, so that was pretty cool. Varun from Tetrate was supposed to come on, and he created Istio, you know? So, there were so many of these things that I just geek out knowing about, you know?</p><p><br></p><p>And then the other thing that was really high on our list, and it’s really high from where I am, is API quality, API testing, API—so really, that’s why I got in touch with you guys because I was like, “Wow, that fits in really good, you know? You guys are doing stuff that’s around chaos, and you know, I think that’s amazing.” So, all of this stuff is just so interesting to me. But man, it was just a whirlwind of every day just recording, and by the end that was just like, you know, “I’m so sorry, but I just, I can’t talk anymore.” You know, and that was it. [laugh].</p><p><br></p><p>Jason: I love that chatting with the creators. We had Zack Butcher on who is also from Tetrate and one of the early Istio—</p><p><br></p><p>Michael: Yeah, yeah.</p><p><br></p><p>Jason: Contributors. And I find it fascinating because I feel like when you chat with these folks, you start to understand the context of why things were built. And it—</p><p><br></p><p>Michael: Yes.</p><p><br></p><p>Jason: —it opens your brain up to, like, cool, there’s a software—oh, now I know exactly why it’s doing things that way, right? Like, it’s just so, so eye-opening. I love it.</p><p><br></p><p>Julie: With that, though, like, did you see any trends or any themes as you were talking to all these folks?</p><p><br></p><p>Michael: Yeah, so a few real big trends. One is everybody wants to know about eBPF. That was the biggest thing at KubeCon, by far, was that, “We want to learn how to do this low-level kernel stuff that’s really fast, that can give us all the information we need, and we don’t have to use sidecars and things like that.” I mean it was—you know, that was the most excitement that I saw. OTel was another one for OpenTelemetry, which was a big one.</p><p><br></p><p>The other thing was simplification. You know, a lot of people were looking to simplify the Kubernetes ecosystem because there’s so much out there, and there’s so many things that you have to learn about that it was super hard, you know, for somebody to come into it to say, “Where do I even start?” You know? So, that was a big theme was simplification.</p><p><br></p><p>I’m trying to think. I think another one is APIs, for sure. You know, because there’s this whole thing about API sprawl. And people don’t know what their APIs are, people just, like—you know, I always say people can see—like, developers are lazy in a good way, and I consider myself one of them. So, what that means is that when we want to develop something, what we’re going to do is we’re just going to pull down the nearest API that does what we need, that has the best documentation, that has the best blog, that has the best everything.</p><p><br></p><p>We don’t know what their testing strategy is; we don’t know what their security strategy is; we don’t know if they use other libraries. And you have to figure that stuff out. And that’s the thing that—you know, so everything around APIs is super important. And you really have to test that stuff out. Yes, people, you have to test it [laugh] and know more about it. So, those are those were the big themes, I think. [laugh].</p><p><br></p><p>Julie: You know, I know that Kerim and I gave a talk on observability where we kind of talked more high-level about some of the overarching concepts, but folks were really excited about that. I think is was because we briefly touched on OpenTelemetry, which we should have gone into a little bit more depth, but there’s only so much you can fit into a 30-minute talk, so hopefully we’ll be able to talk about that more at a KubeCon in the future, we [crosstalk 00:09:54] to the selection committee.</p><p><br></p><p>Michael: Hashtag topics?</p><p><br></p><p>Julie: Uh-huh. [laugh]. You know, that said, though, it really did seem like a huge topic that people just wanted to learn more about. I know, too, at the Gremlin booth, a lot of folks were also interested in talking about, like, how do we just get our organization to adopt some of these concepts that we’re hearing about here? And I think that was the thing that surprised me the most is I expected people to be coming up to the booth and deep-diving into very, very deep, technical-level questions, and really, a lot of it was how do we get our organization to do this? How can we increase adoption? So, that was a surprise for me.</p><p><br></p><p>Michael: Yeah, you know what, and I would say two things to that. One is, when you talk about Chaos Engineering, I think people think it’s like rocket science and people are really scared and they don’t want to claim to be experts in it, so they’re like, “Wow, this is, like, next-level stuff, and you know, we’re really scared. You guys are the experts. I don’t want to even attempt this.” And the other thing is that organizations are scared because they think that it’s going to, like, create mass hysteria throughout their organization.</p><p><br></p><p>And really, none of this is true in either way. In reality, it’s a very, very scripted, very exacting stuff that you’re testing, and you throw stuff out there and see what kind of response you get. So, you know, it’s not this, like, you know—I think people just have—there needs to be more education around a lot of areas in cloud-native. But you know, that’s one of the areas. So, I think it’s really interesting there.</p><p><br></p><p>Julie: I think so too. How about for you, Jason? Like, what was your surprise from the conference or something that maybe—</p><p><br></p><p>Jason: Yeah, I mean, I think my surprise was mostly around just seeing people coming back, right? Because we’re now I would say, six months into conferences being back as a thing, right? Like, we had re:Invent last year in Vegas; we had KubeCon last year in LA, and so, like, those are okay events. They weren’t, like, back to normal. And this was, I feel like, one of the first conferences, that it really started to feel back to normal.</p><p><br></p><p>Like, there was much better attendance, there was much more just buzz and hallway tracking and everything else that we’re used to. Like, the whole reason that we go to conferences is getting together with people and hanging out and stuff, and this one has so far felt the most back-to-normal out of any event that I’ve been to over the past six months.</p><p><br></p><p>Michael: Can I just talk about one thing that I think, you know, people have to get over is, you know, I see a lot online, I think it was—I forget who it was that was talking about it. But this whole idea of Covid shaming. I mean, we’re going to this event, and it’s like, yeah, everybody wants to get out, everybody wants to learn things, but don’t shame people just because they got Covid, everybody’s getting Covid, okay? That’s just the point of life at this point. So, let’s just, you know, let’s just be nice to each other, be friendly to each other, you know? I just have to say that because I think it’s a shame that people are getting shamed, you know, just for going to an event. [laugh].</p><p><br></p><p>Julie: See, and I think that—that’s an interesting—there’s been a lot of conversation around this. And I don’t think anybody should be Covid-shamed. Look, I think that we all took a calculated risk in coming—</p><p><br></p><p>Michael: Absolutely.</p><p><br></p><p>Julie: To this event. I personally gave out a lot of hugs. I hugged some of the folks that have mentioned that they have come up positive from Covid, so there’s a calculated risk in going. I think there has been a little bit of pushback on maybe how some of the communication has come out around it. That said, as an organizer of a small conference with, like, 400 people, I think that these are very complicated matters. And what I really think is important is to listen to feedback from attendees and to take that.</p><p><br></p><p>And then we’re always looking to improve, right?</p><p><br></p><p>Michael: Absolutely.</p><p><br></p><p>Julie: If everything that we did was perfect right out of the gate, then we wouldn’t have Chaos Engineering because there’d be nothing [crosstalk 00:13:45] be just perfectly reliable. And so, if we take away anything, let’s take away—just like what you said, first of all, Covid, you should never shame somebody for having Covid. Like, that’s not cool. It’s not somebody’s fault that they caught an illness.</p><p><br></p><p>Michael: Yes.</p><p><br></p><p>Julie: I mean unless they were licking doorknobs. And that’s a whole different—</p><p><br></p><p>Michael: Yes. [laugh]. That’s a whole different thing, right there.</p><p><br></p><p>Julie: Conversation. But when we talk about just like these questions around cultural adoption, we talk about blamelessness; we talk about learning from failure; we talked about finding ways to improve, and I think all of that can come into play. So, it’ll be interesting to see how we learn and grow as we move forward. And like, thank you to re:Invent, thank you to KubeCon, thank you to DevOpsDays Boise. But these conferences that have started going back in-person, at great risk to organizers and the committee because people are going to be mad, one way or the other.</p><p><br></p><p>Michael: Yeah. And you can see that people want to be back because it was huge, you know?</p><p><br></p><p>Julie: Yeah.</p><p><br></p><p>Michael: Maybe you guys, I’m going to put in a feature request for Gremlin to chaos engineer crowds. Can we do that so we can figure out, like, what’s going to happen when we have these big events? Can we do that?</p><p><br></p><p>Julie: I mean, that sounds fun. I think what’s going to happen is there’s going to be hugs, there’s going to be people getting sick, but there’s going to be people learning and growing.</p><p><br></p><p>Michael: Yes.</p><p><br></p><p>Julie: And ultimately, I just think that we have to remember that just, like, our systems aren’t perfect, and neither are people. Like, the fact that we expect people to be perfect, and maybe we should just keep some mask mandates for a little bit longer when we’re at conferences with 8000 people.</p><p><br></p><p>Michael: Sure.</p><p><br></p><p>Julie: I mean, that’s—</p><p><br></p><p>Michael: That makes sense.</p><p><br></p><p>Jason: Yeah. I mean, it’s all about risk management, right? This is, essentially what we do in SRE is there’s always a risk of a massive outage, and so it’s that balance of, right, do what you can, but ultimately, that’s why we have SLOs and things is, you can never be a hundred percent, so like, where do we draw the line of here are the things that we’re going to do to help manage this risk, but you can never shoot for a perfectly, entirely safe space, right? Because then we’d all be having conferences in padded rooms, and not touching each other, and things like that. There’s a balance there.</p><p><br></p><p>And I think we’re all just trying to find that, so yeah, as you mentioned, that whole, like, DevOps blamelessness thing, you know, treat each other with the notion that we’re all trying to get through this together and do what we think is best. Nobody’s just like John Allspaw said, you know, “Nobody goes to work thinking that, like, their intent is to crash everything and destroy the company.” No one’s going to KubeCon or any of these conferences thinking, “Yeah, I’m going to be a super-spreader.”</p><p><br></p><p>Julie: [laugh].</p><p><br></p><p>Michael: Yeah, that would be [crosstalk 00:16:22].</p><p><br></p><p>Jason: Like, everyone’s trying not to do it. They’re doing their best. They’re not actively, like, aggressively trying to get you sick or intentionally about it. But you know—so just be kind to one another.</p><p><br></p><p>Michael: Yeah. And that’s the key.</p><p><br></p><p>Julie: It is.</p><p><br></p><p>Michael: The key. Be kind to one another, you know? I mean, it’s a great community. People are really nice, so, you know, let’s keep that up. I think that’s something special about the, you know, the community around KubeCon, specifically.</p><p><br></p><p>Julie: As we can refine this and find ways, I would take all of the hugs over virtual conferences—</p><p><br></p><p>Michael: Yes.</p><p><br></p><p>Julie: Any day now. Because, as Jason mentioned, is even just with you, Michael, the time we got to spend with you, or the time I kept going up to Jfrog’s booth and Baruch and I would have conversations as he made me a delicious coffee, these hallway tracks, these conversations, that’s what no one figured out how to recreate during the virtual events—</p><p><br></p><p>Michael: Absolutely.</p><p><br></p><p>Julie: —and it’s just not possible, right?</p><p><br></p><p>Michael: Yeah. I mean, I think it would take a little bit of VR and then maybe some, like, suit that you wear in order to feel the hug. And, you know, so it would take a lot more in order to do that. I mean, I guess it’s technologically possible. I don’t know if the graphics are there yet, so it might be like a pixelated version, like, you know, like, NES-style, or something like that. But it could look pretty cool. [laugh]. So, we’ll have to see, you know?</p><p><br></p><p>Julie: Everybody listening to this episode, I hope you’re getting as much of a kick out of it as we are recording it because I mean, there are so many different topics here. One of the things that Michael and I bonded about years ago, for our listeners that are—not years ago; months ago. Again, what is time?</p><p><br></p><p>Michael: Yeah. What is time? It’s all relative.</p><p><br></p><p>Julie: It is. It was Lego, though, and so we’ve been talking about that. But Michael, you asked a great question when we were recording with you, which is, like—</p><p><br></p><p>Michael: Wow.</p><p><br></p><p>Julie: Can—just one. Only one great question.</p><p><br></p><p>Michael: [laugh].</p><p><br></p><p>Julie: [laugh]. Which was, how would you incorporate Lego into a talk? And, like, when we look at our systems breaking and all of that, I’ve really been thinking about that and how to make our systems more reliable. And here’s one of the things I really wanted to clarify that answer. I kind of went… I went talking about my Lego that I build, like, my Optim—not my Optimus Primes, I don’t have it, but my Voltron or my <a href=\"https://www.amazon.com/dp/B08HVXMQ87\">Nintendo Lego</a>. And those are all box sets.</p><p><br></p><p>Michael: Yep.</p><p><br></p><p>Julie: But one of the things if you’re not playing with a box set with instruction, if you’re just playing with just the—or excuse me, architecting with just the Lego blocks because it’s not playing because we’re adults now, I think.</p><p><br></p><p>Michael: Yes, now it’s architecting. Yes.</p><p><br></p><p>Julie: Yes, now that we’re architecting, like, that’s one of the things that I was really thinking about this, and I think that it would make something really fun to talk about is how you’re building upon each layer and you’re testing out these new connection pieces. And then that really goes into, like, when we get into Technics, into dependencies because if you forget that one little one-inch plastic piece that goes from the one to the other, then your whole Lego can fall apart. So anyway, I just thought that was really interesting, and I’d wondered if you or Jason even gave that any more thought, or if it was just fleeting for you.</p><p><br></p><p>Michael: It was definitely fleeting for me, but I will give it some more thought, you know? But you know, when—as you’re saying that though, I’m thinking these Lego pieces really need names because you’re like that little two-inch Lego piece that kind of connects this and this, like, we got to give these all names so that people can know, that’s x-54 that’s—that you’re putting between x-53 and x-52. I don’t know but you need some kind of name for these parts now.</p><p><br></p><p>Julie: There are Lego names. You just Google it. There are actual names for all of the parts but—</p><p><br></p><p>Michael: Wow. [laugh].</p><p><br></p><p>Julie: Like, Jason, what do you think? I know you’ve got [unintelligible 00:19:59].</p><p><br></p><p>Jason: Yeah, I mean, I think it’s interesting because I am one of those, like, freeform folks, right? You know, my standard practice when I was growing up with Legos was you build the thing that you bought once and then you immediately, like, tear it apart, and you build whatever the hell you want.</p><p><br></p><p>Michael: Absolutely.</p><p><br></p><p>Jason: So, I think that that’s kind of an interesting thing as we think about our systems and stuff, right? Like, part of it is, like, yeah, there’s best practices and various companies will publish, like, you know, “Here’s how to architect such-and-such system.” And it’s interesting because that’s just not reality, right? You’re not going to go and take, like, the Amazon CloudFormation thing, and like, congrats, you’re done. You know, you just implement that and your job’s done; you just kick back for the rest of the week.</p><p><br></p><p>It never works that way, right? You’re taking these little bits of, like, cool, I might have, like, set that up once just to see what’s happening but then you immediately, like, deconstruct it, and you take the knowledge of what you learned in those building blocks, and you, like, go and remix it to build the thing that you actually need to build.</p><p><br></p><p>Michael: But yeah, I mean, that’s exactly—so you know, Legos is what got me interested in that as a kid, but when you look at, you know, cloud services and things like that, there’s so many different ways to combine things and so many different ways to, like—you know, you could use Terraform, you could use Crossplane, you could use, you know, any of the services in the cloud, you could use FaaS, you could use serverless, you could use, you know, all these different kinds of solutions and tie them together. So, there’s so much choice, and what Lego teaches you is that, embrace the choice. Figure out and embrace the different pieces, embrace all the different things that you have and what the art of possibility is, and then start to build on that. So, I think it’s a really good thing. And that’s why there’s so much correlation between, like, kind of, art and tech and things like that because that’s the kind of mentality that you need in order to be really successful in tech.</p><p><br></p><p>Jason: And I think the other thing that works really well with what you said is, as you’re playing with Legos, you start to learn these hacks, right? Like, I don’t have, like, a four-by-one brick, but I know that if I have three four-by-one flats, I can stack those three and it’s the same height as a brick, right?</p><p><br></p><p>Michael: Yep.</p><p><br></p><p>Jason: And you can start combining things. And I love that engineering mentality of, like, I have this problem that I need to solve, I have a limited toolbox for whatever constraints, right, and understanding those constraints, and then cool, how can I remix what I’ve got in my toolbox to get this thing done?</p><p><br></p><p>Michael: And that’s a thing that I’m always doing. Like, when I used to do a lot of development, you know, it was always like, what is the right code? Or what is the library that’s going to solve my problem? Or what is the API that’s going to solve my problem, you know?</p><p><br></p><p>And there’s so many different ways to do it. I mean, so many people are afraid of, like, making the wrong choice, when really in programming, there is no wrong choice. It’s all about how you want to do it and what makes sense to you, you know? There might be better options in formatting and in the way that you kind of, you know, format that code together and put them in different libraries and things like that, but making choices on, like, APIs and things like that, that’s all up to the artist. I would say that’s an artist. [laugh]. So, you know, I think it all stems though, when you go back from, you know, just being creative with things… so creativity is king.</p><p><br></p><p>Jason: So Michael, how do you exercise your creativity, then? How do you keep up that creativity?</p><p><br></p><p>Michael: Yeah, so there’s multiple ways. And that’s a great segment because one of the things that I really enjoy—so you know, I like development, but I’m also a people person. And I like product management, but I also like dealing with people. So really, to me, it’s about how do I relate products, how do I relate solutions, how do I talk to people about solutions that people can understand? And that’s a creative process.</p><p><br></p><p>Like, what is the right media? What is the right demos? What is the right—you know, what do people need? And what do people need to, kind of, embrace things? And to me, that’s a really creative medium to me, and I love it.</p><p><br></p><p>So, I love that I can use my technical, I love that I can use my artistic, I love that I can use, you know, all these pieces all at once. And sometimes maybe I’ll play guitar and just put it in the intro or something, I don’t know. So, that kind of combines that together, too. So, we’ll figure that piece out later. Maybe nobody wants to hear me play guitar, that’s fine, too. [laugh].</p><p><br></p><p>But I love to be able to use, you know, both sides of my brain to do these creative aspects. So, that’s really what does it. And then sometimes I’ll program again and I’ll find the need, and I’ll say, “Hey, look, you know, I realized there’s a need for this,” just like a lot of those creators are. But I haven’t created anything cool, but you know, maybe someday I will. I feel like it’s just been in between all those different intersections that’s really cool.</p><p><br></p><p>Jason: I love the electric guitar stuff that you mentioned. So, for folks who are listening to this show, during our recording of the <em>Cloud Unfiltered</em> you were talking about bringing that art and technical together with electric guitars, and you’ve been building electric guitar pickups.</p><p><br></p><p>Michael: Yes. Yeah. So, I mean, I love anything that can combine my music passion with tech, so I have a CNC machine back here that winds pickups and it does it automatically. So, I can say, “Hey, I need a 57 pickup, you know, whatever it is,” and it’ll wind it to that exact spec.</p><p><br></p><p>But that’s not the only thing I do. I mean, I used to design control surfaces for artists that were a big band, and I really can’t—a lot of them I can’t mention because we’re under NDA. But I designed a lot of these big, you know, control surfaces for a lot of the big electronic and rock bands that are out there. I taught people how to use Max for Live, which is an artist’s, kind of, programming language that’s graphical, so [NMax 00:25:33] and MSP and all that kind of stuff. So, I really, really like to combine that.</p><p><br></p><p>Nowadays, you know, I’m talking about doing some kind of events that may be combined tech, with art. So, maybe doing things like Algorave, and you know, things that are live-coding music and an art. So, being able to combine all these things together, I love that. That’s my ultimate passion.</p><p><br></p><p>Jason: That is super cool.</p><p><br></p><p>Julie: I think we have learned quite a bit on this episode of <em>Break Things on Purpose</em>, first of all, from the guy who said he hasn’t created much—because you did say that, which I’m going to call you out on that because you just gave a long list of things that you created. And I think we need to remember that we’re all creators in our own way, so it’s very important to remember that. But I think that right now we’ve created a couple of options for talks in the future, whether or not it’s with Lego, or guitar pickups.</p><p><br></p><p>Michael: Yeah.</p><p><br></p><p>Julie: Is that—</p><p><br></p><p>Michael: Hey—</p><p><br></p><p>Julie: Because I—</p><p><br></p><p>Michael: Yeah, why not?</p><p><br></p><p>Julie: —know you do kind of explain that a little bit to me as well when I was there. So, Michael, this has just been amazing having you. We’re going to put a lot of links in the notes for everybody today. So, to Michael’s podcast, to some Lego, and to anything else Michael wants to share with us as well. Oh, real quick, is there anything you want to leave our listeners with other than that? You know, are you looking to hire Cisco? Is there anything you wanted to share with us?</p><p><br></p><p>Michael: Yeah, I mean, we’re always looking for great people at Cisco, but the biggest thing I’d say is, just realize that we are doing stuff around cloud-native, we’re not just network. And I think that’s something to note there. But you know, I just love being on the show with you guys. I love doing anything with you guys. You guys are awesome, you know. So.</p><p><br></p><p>Julie: You’re great too, and I think we’ll probably do more stuff, all of us together, in the future. And with that, I just want to thank everybody for joining us today.</p><p><br></p><p>Michael: Thank you. Thanks so much. Thanks for having me.</p><p><br></p><p>Jason: For links to all the information mentioned, visit our website at <a href=\"https://gremlin.com/podcast\">gremlin.com/podcast</a>. If you liked this episode, subscribe to the <em>Break Things on Purpose</em> podcast on Spotify, Apple Podcasts, or your favorite podcast platform. Our theme song is called, “Battle of Pogs” by Komiku, and it’s available on <a href=\"https://loyaltyfreakmusic.com/\">loyaltyfreakmusic.com</a>.</p>",
  "content:encoded": "<p>Today we chat with Cisco’s head of developer content, community, and events, Michael Chenetz. We discuss everything from KubeCon to kindness and Legos! Michael delves into some of the main themes he heard from creators at KubeCon, and we discuss methods for increasing adoption of new concepts in your organization. We have a conversation about attending live conferences, COVID protocol, and COVID shaming, and then we talk about how Legos can be used in talks to demonstrate concepts. We end the conversation with a discussion about combining passions to practice creativity.</p><p><br></p><ul>\n<li>We discuss our time at KubeCon in Spain (5:51)</li>\n<li>Themes Michael heard at KubeCon talking with creators (7:46)</li>\n<li>Increasing adoption of new concepts (9:27)</li>\n<li>We talk conferences, COVID shaming, and blamelessness (12:21)</li>\n<li>Legos and reliability  (18:04)</li>\n<li>Michael talks about ways to exercise creativity (23:20)</li>\n</ul><p><br></p><p><strong>Links:</strong></p><ul>\n<li>KubeCon October 2022: <a href=\"https://events.linuxfoundation.org/kubecon-cloudnativecon-north-america/\">https://events.linuxfoundation.org/kubecon-cloudnativecon-north-america/</a>\n</li>\n<li>Nintendo Lego Set: <a href=\"https://www.amazon.com/dp/B08HVXMQ87?ref_=cm_sw_r_cp_ud_dp_ED7NVBWPR8ANGT8WNGS5\">https://www.amazon.com/dp/B08HVXMQ87?ref_=cm_sw_r_cp_ud_dp_ED7NVBWPR8ANGT8WNGS5</a>\n</li>\n<li>Cloud Unfiltered podcast episode featuring Julie and Jason:<a href=\"https://podcasts.apple.com/us/podcast/ep125-chaos-engineering-with-julie-gunderson-and-jason/id1215105578?i=1000562393884\">https://podcasts.apple.com/us/podcast/ep125-chaos-engineering-with-julie-gunderson-and-jason/id1215105578?i=1000562393884</a>\n</li>\n</ul><p><br></p><p><strong>Links Referenced:</strong></p><ul>\n<li>Cisco: <a href=\"https://www.cisco.com/\">https://www.cisco.com/</a>\n</li>\n<li>\n<em>Cloud Unfiltered</em> Podcast with Julie and Jason: <a href=\"https://podcasts.apple.com/us/podcast/ep125-chaos-engineering-with-julie-gunderson-and-jason/id1215105578?i=1000562393884\">https://podcasts.apple.com/us/podcast/ep125-chaos-engineering-with-julie-gunderson-and-jason/id1215105578?i=1000562393884</a>\n</li>\n<li>\n<em>Cloud Unfiltered</em> Podcast: <a href=\"https://www.cisco.com/c/en/us/solutions/cloud/podcasts.html\">https://www.cisco.com/c/en/us/solutions/cloud/podcasts.html</a>\n</li>\n<li>Nintendo Lego: <a href=\"https://www.amazon.com/dp/B08HVXMQ87\">https://www.amazon.com/dp/B08HVXMQ87</a>\n</li>\n</ul><p><br></p><p><strong>Transcript</strong></p><p>Julie: And for folks that are interested in, too, what day it is—because I think we’re all still a little bit confused—it is Monday, May 24th that we are recording this episode.</p><p><br></p><p>Jason: Uh, Julie’s definitely confused on what day it is because it’s actually Tuesday, [laugh] May 24th.</p><p><br></p><p>Michael: Oh, my God. [laugh]. That’s great. I love it.</p><p><br></p><p>Julie: Welcome to <em>Break Things on Purpose</em>, a podcast about reliability, learning from each other, and blamelessness. In this episode, we talk to Michael Chenetz, head of developer content, community, and events at <a href=\"https://www.cisco.com/\">Cisco</a>, about all of the learnings from KubeCon, the importance of being kind to each other, and of course, how Lego translates into technology.</p><p><br></p><p>Julie: Today, we are joined by Michael Chenetz. Michael, do you want to tell us a little bit about yourself?</p><p><br></p><p>Michael: Yeah. [laugh]. Well, first of all, thank you for having me on the show. And I’m really good at breaking things, so I guess that’s why I’m asked to be here is because I’m superb at it. What I’m not so good at is, like, putting things back together.</p><p><br></p><p>Like when I was a kid, I remember taking my dad’s stereo apart; wasn’t too happy about that. Wasn’t very good at putting it back together. But you know, so that’s just going back a little ways there. But yeah, so I work for the DevRel at Cisco and my whole responsibility is, you know, to get people to know that know a little bit about us in terms of, you know, all the developer-related topics.</p><p><br></p><p>Julie: Well, and Jason and I had the awesome opportunity to hang out with you at KubeCon, where we got to join your <a href=\"https://www.cisco.com/c/en/us/solutions/cloud/podcasts.html\">Cloud Unfiltered</a> podcast. So folks, definitely go check out <a href=\"https://podcasts.apple.com/us/podcast/ep125-chaos-engineering-with-julie-gunderson-and-jason/id1215105578?i=1000562393884\">that episode</a>. We have a lot of fun. We’ll put a link in the [show notes 00:02:03]. But yeah, let’s talk a little bit about KubeCon. So, as of recording this episode, we all just recently traveled back from Spain, for KubeCon EU, which was… amazing. I really enjoyed being there. My first time in Spain. I got back, I can tell you, less than 24 hours ago. Michael, I think—when did you get back?</p><p><br></p><p>Michael: So, I got back Saturday night, but my bags have not arrived yet. So, they’re still traveling and they’re enjoying Europe. And they should be back soon, I guess when they’re when they feel like they’re—you know, they should be back from vacation.</p><p><br></p><p>Julie: [laugh].</p><p><br></p><p>Michael: So. [laugh].</p><p><br></p><p>Julie: Jason, how about you? When did you get home?</p><p><br></p><p>Jason: I got home on Sunday night. So, I took the train from Valencia to Barcelona on Saturday evening, and then an early morning flight on Sunday and got home late Sunday night.</p><p><br></p><p>Julie: And for folks that are interested in, too, what day it is—because I think we’re all still a little bit confused—it is Monday, May 24th that we are recording this episode.</p><p><br></p><p>Jason: Uh, Julie’s definitely confused on what day it is because it’s actually Tuesday, [laugh] May 24th.</p><p><br></p><p>Michael: Oh, my God. [laugh]. That’s great. I love it. By the way, yesterday was my birthday so I’m going to say—</p><p><br></p><p>Julie: Happy birthday.</p><p><br></p><p>Michael: —happy birthday to myself.</p><p><br></p><p>Julie: Oh, my gosh, happy birthday. [laugh].</p><p><br></p><p>Michael: Thank you [laugh].</p><p><br></p><p>Julie: So… what is time anyway?</p><p><br></p><p>Jason: Yeah.</p><p><br></p><p>Michael: It’s all good. It’s all relative. Time is relative.</p><p><br></p><p>Julie: Time is relative. And so, you know, tell us a little bit about—I’d love to know a little bit about why you want folks to know about, like, what is the message you try to get across?</p><p><br></p><p>Jason: Oh, that’s not the question I thought you were going to ask. I thought you were going to ask, “What’s on your Amazon wishlist so people can send you birthday presents?”</p><p><br></p><p>Julie: Yeah, let’s back up. Let’s do that. So, let’s start with your Amazon wishlist. We know that there might be some Legos involved.</p><p><br></p><p>Michael: Oh, my God, yeah. I mean, you just told me about a cool one, which was Optimus Prime and I just—I’m already on the website, my credit card is out and I’m ready to buy. So, you know, this is the problem with talking to you guys. [laugh]. It’s definitely—you know, that’s definitely on my list. So, anything that, anything music-related because obviously behind me is a lot of music equipment—I love music stuff—and anything tech. The combination of tech and music, and if you can combine Legos and that, too, man that would just match all the boxes. [laugh].</p><p><br></p><p>Julie: Just to let you know, there’s a Lego Con. Like, I did not know this until last night, actually. But it is a virtual conference.</p><p><br></p><p>Michael: Really.</p><p><br></p><p>Julie: Yeah. But one of the things I was looking at actually on Lego, when you look at their website, like, to request one of their speakers, to request one of their engineers as a speaker, they actually don’t do that because they get so many requests for their folks to speak at conferences, they actually have a dedicated part of their website that talks about this. So, I thought that was interesting.</p><p><br></p><p>Michael: Well listen, just because of that, if they want somebody that’s in, you know, cloud computing, I’m not going to go talk for Lego. And I know they really want somebody from cloud computing talking to Lego, so, you know… it’s, you know, quid pro quo there, so that’s just the way it’s going to work. [laugh].</p><p><br></p><p>Julie: I want to be best friends with Lego people.</p><p><br></p><p>Michael: [laugh]. I know, me too.</p><p><br></p><p>Julie: I’m just going to make it a goal in life now to have one of their engineers speak at DevOpsDays Boise. It’s like a challenge.</p><p><br></p><p>Michael: It is. I accept it.</p><p><br></p><p>Julie: [laugh]. With that, though, just on other Lego news, before we start talking about all the other things that folks may also want to hear about, there is another new Lego, which is the Van Gogh <em>Starry Night</em> that has been newly released by the time this episode comes out.</p><p><br></p><p>Michael: With a free ear, right?</p><p><br></p><p>Julie: I mean—[laugh].</p><p><br></p><p>Michael: Is that what happens?</p><p><br></p><p>Julie: —well played. Well, played. [laugh]. So, now you really got to spend a lot of time at KubeCon, you were just really recording podcast after podcast.</p><p><br></p><p>Michael: Oh, my God. Yeah. So, I mean, it was great. I love—because I’m a techie, so I love tech and I love to find out origin stories of stuff. So, I love to, like, talk to these people and like, “Why did that come about? How did—” you know, “What happened in your life that made you want to do this? Who hurt you?” [laugh].</p><p><br></p><p>And so, that’s what I constantly try and figure out is, like, [laugh], “What is that?” So, it was really cool because I had, like, Jimmy Zelinskie who came from CoreOS, and he came from—you know, they create, you know, Quay and some of this other kinds of stuff. And you know, just to talk about, like, some of the operators and how they came about, and like… those were the original operators, so that was pretty cool. Varun from Tetrate was supposed to come on, and he created Istio, you know? So, there were so many of these things that I just geek out knowing about, you know?</p><p><br></p><p>And then the other thing that was really high on our list, and it’s really high from where I am, is API quality, API testing, API—so really, that’s why I got in touch with you guys because I was like, “Wow, that fits in really good, you know? You guys are doing stuff that’s around chaos, and you know, I think that’s amazing.” So, all of this stuff is just so interesting to me. But man, it was just a whirlwind of every day just recording, and by the end that was just like, you know, “I’m so sorry, but I just, I can’t talk anymore.” You know, and that was it. [laugh].</p><p><br></p><p>Jason: I love that chatting with the creators. We had Zack Butcher on who is also from Tetrate and one of the early Istio—</p><p><br></p><p>Michael: Yeah, yeah.</p><p><br></p><p>Jason: Contributors. And I find it fascinating because I feel like when you chat with these folks, you start to understand the context of why things were built. And it—</p><p><br></p><p>Michael: Yes.</p><p><br></p><p>Jason: —it opens your brain up to, like, cool, there’s a software—oh, now I know exactly why it’s doing things that way, right? Like, it’s just so, so eye-opening. I love it.</p><p><br></p><p>Julie: With that, though, like, did you see any trends or any themes as you were talking to all these folks?</p><p><br></p><p>Michael: Yeah, so a few real big trends. One is everybody wants to know about eBPF. That was the biggest thing at KubeCon, by far, was that, “We want to learn how to do this low-level kernel stuff that’s really fast, that can give us all the information we need, and we don’t have to use sidecars and things like that.” I mean it was—you know, that was the most excitement that I saw. OTel was another one for OpenTelemetry, which was a big one.</p><p><br></p><p>The other thing was simplification. You know, a lot of people were looking to simplify the Kubernetes ecosystem because there’s so much out there, and there’s so many things that you have to learn about that it was super hard, you know, for somebody to come into it to say, “Where do I even start?” You know? So, that was a big theme was simplification.</p><p><br></p><p>I’m trying to think. I think another one is APIs, for sure. You know, because there’s this whole thing about API sprawl. And people don’t know what their APIs are, people just, like—you know, I always say people can see—like, developers are lazy in a good way, and I consider myself one of them. So, what that means is that when we want to develop something, what we’re going to do is we’re just going to pull down the nearest API that does what we need, that has the best documentation, that has the best blog, that has the best everything.</p><p><br></p><p>We don’t know what their testing strategy is; we don’t know what their security strategy is; we don’t know if they use other libraries. And you have to figure that stuff out. And that’s the thing that—you know, so everything around APIs is super important. And you really have to test that stuff out. Yes, people, you have to test it [laugh] and know more about it. So, those are those were the big themes, I think. [laugh].</p><p><br></p><p>Julie: You know, I know that Kerim and I gave a talk on observability where we kind of talked more high-level about some of the overarching concepts, but folks were really excited about that. I think is was because we briefly touched on OpenTelemetry, which we should have gone into a little bit more depth, but there’s only so much you can fit into a 30-minute talk, so hopefully we’ll be able to talk about that more at a KubeCon in the future, we [crosstalk 00:09:54] to the selection committee.</p><p><br></p><p>Michael: Hashtag topics?</p><p><br></p><p>Julie: Uh-huh. [laugh]. You know, that said, though, it really did seem like a huge topic that people just wanted to learn more about. I know, too, at the Gremlin booth, a lot of folks were also interested in talking about, like, how do we just get our organization to adopt some of these concepts that we’re hearing about here? And I think that was the thing that surprised me the most is I expected people to be coming up to the booth and deep-diving into very, very deep, technical-level questions, and really, a lot of it was how do we get our organization to do this? How can we increase adoption? So, that was a surprise for me.</p><p><br></p><p>Michael: Yeah, you know what, and I would say two things to that. One is, when you talk about Chaos Engineering, I think people think it’s like rocket science and people are really scared and they don’t want to claim to be experts in it, so they’re like, “Wow, this is, like, next-level stuff, and you know, we’re really scared. You guys are the experts. I don’t want to even attempt this.” And the other thing is that organizations are scared because they think that it’s going to, like, create mass hysteria throughout their organization.</p><p><br></p><p>And really, none of this is true in either way. In reality, it’s a very, very scripted, very exacting stuff that you’re testing, and you throw stuff out there and see what kind of response you get. So, you know, it’s not this, like, you know—I think people just have—there needs to be more education around a lot of areas in cloud-native. But you know, that’s one of the areas. So, I think it’s really interesting there.</p><p><br></p><p>Julie: I think so too. How about for you, Jason? Like, what was your surprise from the conference or something that maybe—</p><p><br></p><p>Jason: Yeah, I mean, I think my surprise was mostly around just seeing people coming back, right? Because we’re now I would say, six months into conferences being back as a thing, right? Like, we had re:Invent last year in Vegas; we had KubeCon last year in LA, and so, like, those are okay events. They weren’t, like, back to normal. And this was, I feel like, one of the first conferences, that it really started to feel back to normal.</p><p><br></p><p>Like, there was much better attendance, there was much more just buzz and hallway tracking and everything else that we’re used to. Like, the whole reason that we go to conferences is getting together with people and hanging out and stuff, and this one has so far felt the most back-to-normal out of any event that I’ve been to over the past six months.</p><p><br></p><p>Michael: Can I just talk about one thing that I think, you know, people have to get over is, you know, I see a lot online, I think it was—I forget who it was that was talking about it. But this whole idea of Covid shaming. I mean, we’re going to this event, and it’s like, yeah, everybody wants to get out, everybody wants to learn things, but don’t shame people just because they got Covid, everybody’s getting Covid, okay? That’s just the point of life at this point. So, let’s just, you know, let’s just be nice to each other, be friendly to each other, you know? I just have to say that because I think it’s a shame that people are getting shamed, you know, just for going to an event. [laugh].</p><p><br></p><p>Julie: See, and I think that—that’s an interesting—there’s been a lot of conversation around this. And I don’t think anybody should be Covid-shamed. Look, I think that we all took a calculated risk in coming—</p><p><br></p><p>Michael: Absolutely.</p><p><br></p><p>Julie: To this event. I personally gave out a lot of hugs. I hugged some of the folks that have mentioned that they have come up positive from Covid, so there’s a calculated risk in going. I think there has been a little bit of pushback on maybe how some of the communication has come out around it. That said, as an organizer of a small conference with, like, 400 people, I think that these are very complicated matters. And what I really think is important is to listen to feedback from attendees and to take that.</p><p><br></p><p>And then we’re always looking to improve, right?</p><p><br></p><p>Michael: Absolutely.</p><p><br></p><p>Julie: If everything that we did was perfect right out of the gate, then we wouldn’t have Chaos Engineering because there’d be nothing [crosstalk 00:13:45] be just perfectly reliable. And so, if we take away anything, let’s take away—just like what you said, first of all, Covid, you should never shame somebody for having Covid. Like, that’s not cool. It’s not somebody’s fault that they caught an illness.</p><p><br></p><p>Michael: Yes.</p><p><br></p><p>Julie: I mean unless they were licking doorknobs. And that’s a whole different—</p><p><br></p><p>Michael: Yes. [laugh]. That’s a whole different thing, right there.</p><p><br></p><p>Julie: Conversation. But when we talk about just like these questions around cultural adoption, we talk about blamelessness; we talk about learning from failure; we talked about finding ways to improve, and I think all of that can come into play. So, it’ll be interesting to see how we learn and grow as we move forward. And like, thank you to re:Invent, thank you to KubeCon, thank you to DevOpsDays Boise. But these conferences that have started going back in-person, at great risk to organizers and the committee because people are going to be mad, one way or the other.</p><p><br></p><p>Michael: Yeah. And you can see that people want to be back because it was huge, you know?</p><p><br></p><p>Julie: Yeah.</p><p><br></p><p>Michael: Maybe you guys, I’m going to put in a feature request for Gremlin to chaos engineer crowds. Can we do that so we can figure out, like, what’s going to happen when we have these big events? Can we do that?</p><p><br></p><p>Julie: I mean, that sounds fun. I think what’s going to happen is there’s going to be hugs, there’s going to be people getting sick, but there’s going to be people learning and growing.</p><p><br></p><p>Michael: Yes.</p><p><br></p><p>Julie: And ultimately, I just think that we have to remember that just, like, our systems aren’t perfect, and neither are people. Like, the fact that we expect people to be perfect, and maybe we should just keep some mask mandates for a little bit longer when we’re at conferences with 8000 people.</p><p><br></p><p>Michael: Sure.</p><p><br></p><p>Julie: I mean, that’s—</p><p><br></p><p>Michael: That makes sense.</p><p><br></p><p>Jason: Yeah. I mean, it’s all about risk management, right? This is, essentially what we do in SRE is there’s always a risk of a massive outage, and so it’s that balance of, right, do what you can, but ultimately, that’s why we have SLOs and things is, you can never be a hundred percent, so like, where do we draw the line of here are the things that we’re going to do to help manage this risk, but you can never shoot for a perfectly, entirely safe space, right? Because then we’d all be having conferences in padded rooms, and not touching each other, and things like that. There’s a balance there.</p><p><br></p><p>And I think we’re all just trying to find that, so yeah, as you mentioned, that whole, like, DevOps blamelessness thing, you know, treat each other with the notion that we’re all trying to get through this together and do what we think is best. Nobody’s just like John Allspaw said, you know, “Nobody goes to work thinking that, like, their intent is to crash everything and destroy the company.” No one’s going to KubeCon or any of these conferences thinking, “Yeah, I’m going to be a super-spreader.”</p><p><br></p><p>Julie: [laugh].</p><p><br></p><p>Michael: Yeah, that would be [crosstalk 00:16:22].</p><p><br></p><p>Jason: Like, everyone’s trying not to do it. They’re doing their best. They’re not actively, like, aggressively trying to get you sick or intentionally about it. But you know—so just be kind to one another.</p><p><br></p><p>Michael: Yeah. And that’s the key.</p><p><br></p><p>Julie: It is.</p><p><br></p><p>Michael: The key. Be kind to one another, you know? I mean, it’s a great community. People are really nice, so, you know, let’s keep that up. I think that’s something special about the, you know, the community around KubeCon, specifically.</p><p><br></p><p>Julie: As we can refine this and find ways, I would take all of the hugs over virtual conferences—</p><p><br></p><p>Michael: Yes.</p><p><br></p><p>Julie: Any day now. Because, as Jason mentioned, is even just with you, Michael, the time we got to spend with you, or the time I kept going up to Jfrog’s booth and Baruch and I would have conversations as he made me a delicious coffee, these hallway tracks, these conversations, that’s what no one figured out how to recreate during the virtual events—</p><p><br></p><p>Michael: Absolutely.</p><p><br></p><p>Julie: —and it’s just not possible, right?</p><p><br></p><p>Michael: Yeah. I mean, I think it would take a little bit of VR and then maybe some, like, suit that you wear in order to feel the hug. And, you know, so it would take a lot more in order to do that. I mean, I guess it’s technologically possible. I don’t know if the graphics are there yet, so it might be like a pixelated version, like, you know, like, NES-style, or something like that. But it could look pretty cool. [laugh]. So, we’ll have to see, you know?</p><p><br></p><p>Julie: Everybody listening to this episode, I hope you’re getting as much of a kick out of it as we are recording it because I mean, there are so many different topics here. One of the things that Michael and I bonded about years ago, for our listeners that are—not years ago; months ago. Again, what is time?</p><p><br></p><p>Michael: Yeah. What is time? It’s all relative.</p><p><br></p><p>Julie: It is. It was Lego, though, and so we’ve been talking about that. But Michael, you asked a great question when we were recording with you, which is, like—</p><p><br></p><p>Michael: Wow.</p><p><br></p><p>Julie: Can—just one. Only one great question.</p><p><br></p><p>Michael: [laugh].</p><p><br></p><p>Julie: [laugh]. Which was, how would you incorporate Lego into a talk? And, like, when we look at our systems breaking and all of that, I’ve really been thinking about that and how to make our systems more reliable. And here’s one of the things I really wanted to clarify that answer. I kind of went… I went talking about my Lego that I build, like, my Optim—not my Optimus Primes, I don’t have it, but my Voltron or my <a href=\"https://www.amazon.com/dp/B08HVXMQ87\">Nintendo Lego</a>. And those are all box sets.</p><p><br></p><p>Michael: Yep.</p><p><br></p><p>Julie: But one of the things if you’re not playing with a box set with instruction, if you’re just playing with just the—or excuse me, architecting with just the Lego blocks because it’s not playing because we’re adults now, I think.</p><p><br></p><p>Michael: Yes, now it’s architecting. Yes.</p><p><br></p><p>Julie: Yes, now that we’re architecting, like, that’s one of the things that I was really thinking about this, and I think that it would make something really fun to talk about is how you’re building upon each layer and you’re testing out these new connection pieces. And then that really goes into, like, when we get into Technics, into dependencies because if you forget that one little one-inch plastic piece that goes from the one to the other, then your whole Lego can fall apart. So anyway, I just thought that was really interesting, and I’d wondered if you or Jason even gave that any more thought, or if it was just fleeting for you.</p><p><br></p><p>Michael: It was definitely fleeting for me, but I will give it some more thought, you know? But you know, when—as you’re saying that though, I’m thinking these Lego pieces really need names because you’re like that little two-inch Lego piece that kind of connects this and this, like, we got to give these all names so that people can know, that’s x-54 that’s—that you’re putting between x-53 and x-52. I don’t know but you need some kind of name for these parts now.</p><p><br></p><p>Julie: There are Lego names. You just Google it. There are actual names for all of the parts but—</p><p><br></p><p>Michael: Wow. [laugh].</p><p><br></p><p>Julie: Like, Jason, what do you think? I know you’ve got [unintelligible 00:19:59].</p><p><br></p><p>Jason: Yeah, I mean, I think it’s interesting because I am one of those, like, freeform folks, right? You know, my standard practice when I was growing up with Legos was you build the thing that you bought once and then you immediately, like, tear it apart, and you build whatever the hell you want.</p><p><br></p><p>Michael: Absolutely.</p><p><br></p><p>Jason: So, I think that that’s kind of an interesting thing as we think about our systems and stuff, right? Like, part of it is, like, yeah, there’s best practices and various companies will publish, like, you know, “Here’s how to architect such-and-such system.” And it’s interesting because that’s just not reality, right? You’re not going to go and take, like, the Amazon CloudFormation thing, and like, congrats, you’re done. You know, you just implement that and your job’s done; you just kick back for the rest of the week.</p><p><br></p><p>It never works that way, right? You’re taking these little bits of, like, cool, I might have, like, set that up once just to see what’s happening but then you immediately, like, deconstruct it, and you take the knowledge of what you learned in those building blocks, and you, like, go and remix it to build the thing that you actually need to build.</p><p><br></p><p>Michael: But yeah, I mean, that’s exactly—so you know, Legos is what got me interested in that as a kid, but when you look at, you know, cloud services and things like that, there’s so many different ways to combine things and so many different ways to, like—you know, you could use Terraform, you could use Crossplane, you could use, you know, any of the services in the cloud, you could use FaaS, you could use serverless, you could use, you know, all these different kinds of solutions and tie them together. So, there’s so much choice, and what Lego teaches you is that, embrace the choice. Figure out and embrace the different pieces, embrace all the different things that you have and what the art of possibility is, and then start to build on that. So, I think it’s a really good thing. And that’s why there’s so much correlation between, like, kind of, art and tech and things like that because that’s the kind of mentality that you need in order to be really successful in tech.</p><p><br></p><p>Jason: And I think the other thing that works really well with what you said is, as you’re playing with Legos, you start to learn these hacks, right? Like, I don’t have, like, a four-by-one brick, but I know that if I have three four-by-one flats, I can stack those three and it’s the same height as a brick, right?</p><p><br></p><p>Michael: Yep.</p><p><br></p><p>Jason: And you can start combining things. And I love that engineering mentality of, like, I have this problem that I need to solve, I have a limited toolbox for whatever constraints, right, and understanding those constraints, and then cool, how can I remix what I’ve got in my toolbox to get this thing done?</p><p><br></p><p>Michael: And that’s a thing that I’m always doing. Like, when I used to do a lot of development, you know, it was always like, what is the right code? Or what is the library that’s going to solve my problem? Or what is the API that’s going to solve my problem, you know?</p><p><br></p><p>And there’s so many different ways to do it. I mean, so many people are afraid of, like, making the wrong choice, when really in programming, there is no wrong choice. It’s all about how you want to do it and what makes sense to you, you know? There might be better options in formatting and in the way that you kind of, you know, format that code together and put them in different libraries and things like that, but making choices on, like, APIs and things like that, that’s all up to the artist. I would say that’s an artist. [laugh]. So, you know, I think it all stems though, when you go back from, you know, just being creative with things… so creativity is king.</p><p><br></p><p>Jason: So Michael, how do you exercise your creativity, then? How do you keep up that creativity?</p><p><br></p><p>Michael: Yeah, so there’s multiple ways. And that’s a great segment because one of the things that I really enjoy—so you know, I like development, but I’m also a people person. And I like product management, but I also like dealing with people. So really, to me, it’s about how do I relate products, how do I relate solutions, how do I talk to people about solutions that people can understand? And that’s a creative process.</p><p><br></p><p>Like, what is the right media? What is the right demos? What is the right—you know, what do people need? And what do people need to, kind of, embrace things? And to me, that’s a really creative medium to me, and I love it.</p><p><br></p><p>So, I love that I can use my technical, I love that I can use my artistic, I love that I can use, you know, all these pieces all at once. And sometimes maybe I’ll play guitar and just put it in the intro or something, I don’t know. So, that kind of combines that together, too. So, we’ll figure that piece out later. Maybe nobody wants to hear me play guitar, that’s fine, too. [laugh].</p><p><br></p><p>But I love to be able to use, you know, both sides of my brain to do these creative aspects. So, that’s really what does it. And then sometimes I’ll program again and I’ll find the need, and I’ll say, “Hey, look, you know, I realized there’s a need for this,” just like a lot of those creators are. But I haven’t created anything cool, but you know, maybe someday I will. I feel like it’s just been in between all those different intersections that’s really cool.</p><p><br></p><p>Jason: I love the electric guitar stuff that you mentioned. So, for folks who are listening to this show, during our recording of the <em>Cloud Unfiltered</em> you were talking about bringing that art and technical together with electric guitars, and you’ve been building electric guitar pickups.</p><p><br></p><p>Michael: Yes. Yeah. So, I mean, I love anything that can combine my music passion with tech, so I have a CNC machine back here that winds pickups and it does it automatically. So, I can say, “Hey, I need a 57 pickup, you know, whatever it is,” and it’ll wind it to that exact spec.</p><p><br></p><p>But that’s not the only thing I do. I mean, I used to design control surfaces for artists that were a big band, and I really can’t—a lot of them I can’t mention because we’re under NDA. But I designed a lot of these big, you know, control surfaces for a lot of the big electronic and rock bands that are out there. I taught people how to use Max for Live, which is an artist’s, kind of, programming language that’s graphical, so [NMax 00:25:33] and MSP and all that kind of stuff. So, I really, really like to combine that.</p><p><br></p><p>Nowadays, you know, I’m talking about doing some kind of events that may be combined tech, with art. So, maybe doing things like Algorave, and you know, things that are live-coding music and an art. So, being able to combine all these things together, I love that. That’s my ultimate passion.</p><p><br></p><p>Jason: That is super cool.</p><p><br></p><p>Julie: I think we have learned quite a bit on this episode of <em>Break Things on Purpose</em>, first of all, from the guy who said he hasn’t created much—because you did say that, which I’m going to call you out on that because you just gave a long list of things that you created. And I think we need to remember that we’re all creators in our own way, so it’s very important to remember that. But I think that right now we’ve created a couple of options for talks in the future, whether or not it’s with Lego, or guitar pickups.</p><p><br></p><p>Michael: Yeah.</p><p><br></p><p>Julie: Is that—</p><p><br></p><p>Michael: Hey—</p><p><br></p><p>Julie: Because I—</p><p><br></p><p>Michael: Yeah, why not?</p><p><br></p><p>Julie: —know you do kind of explain that a little bit to me as well when I was there. So, Michael, this has just been amazing having you. We’re going to put a lot of links in the notes for everybody today. So, to Michael’s podcast, to some Lego, and to anything else Michael wants to share with us as well. Oh, real quick, is there anything you want to leave our listeners with other than that? You know, are you looking to hire Cisco? Is there anything you wanted to share with us?</p><p><br></p><p>Michael: Yeah, I mean, we’re always looking for great people at Cisco, but the biggest thing I’d say is, just realize that we are doing stuff around cloud-native, we’re not just network. And I think that’s something to note there. But you know, I just love being on the show with you guys. I love doing anything with you guys. You guys are awesome, you know. So.</p><p><br></p><p>Julie: You’re great too, and I think we’ll probably do more stuff, all of us together, in the future. And with that, I just want to thank everybody for joining us today.</p><p><br></p><p>Michael: Thank you. Thanks so much. Thanks for having me.</p><p><br></p><p>Jason: For links to all the information mentioned, visit our website at <a href=\"https://gremlin.com/podcast\">gremlin.com/podcast</a>. If you liked this episode, subscribe to the <em>Break Things on Purpose</em> podcast on Spotify, Apple Podcasts, or your favorite podcast platform. Our theme song is called, “Battle of Pogs” by Komiku, and it’s available on <a href=\"https://loyaltyfreakmusic.com/\">loyaltyfreakmusic.com</a>.</p>",
  "pubDate": "Tue, 31 May 2022 00:30:00 -0700",
  "author": "Gremlin",
  "enclosure": "",
  "itunes:author": "Gremlin",
  "itunes:image": "",
  "itunes:duration": 1677,
  "itunes:summary": "Today we chat with Cisco’s head of developer content, community, and events, Michael Chenetz. We discuss everything from KubeCon to kindness and Legos!",
  "itunes:subtitle": "Today we chat with Cisco’s head of developer content, community, and events, Michael Chenetz. We discuss everything from KubeCon to kindness and Legos!",
  "itunes:keywords": "reliability, resilience, chaos, engineering, SRE, technology, programming, infrastructure",
  "itunes:explicit": "No",
  "podcast:transcript": ""
}