{
  "id": "yt:video:7Cto2yr5NQY",
  "yt:videoId": "7Cto2yr5NQY",
  "yt:channelId": "UCccafaIN6dwBwyl1cwNH90w",
  "title": "fMRI Brain Networks in 10 Minutes | Default-Mode Network and Others Explained",
  "link": "",
  "author": {
    "name": "The Psychedelic Scientist",
    "uri": "https://www.youtube.com/channel/UCccafaIN6dwBwyl1cwNH90w"
  },
  "published": "2020-09-02T19:25:12+00:00",
  "updated": "2022-01-13T21:37:39+00:00",
  "media:group": {
    "media:title": "fMRI Brain Networks in 10 Minutes | Default-Mode Network and Others Explained",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Brain networks such as the default-mode network are mentioned more and more and the media these days - but what exactly are these brain networks?\n\nIn this video, I start with the very basics of how functional brain imaging works and dive into the seven main brain networks that neuroscientists typically refer to. No neuroscience background needed!\n\nWhat I describe in here is important foundational stuff for understanding the latest developments in psychedelic neuroscience, and for an understanding of brain function in general. This video is the first in my series on psychedelic neuroscience - much more to come!\n\n--\n\nHit that subscribe button and join me for a journey deep into the psychedelic renaissance!! \n\nDon't forget to follow me on social media for all the latest updates: \n\nInstagram\nhttps://www.instagram.com/thepsychedelicscientist \n\nTwitter\nhttps://twitter.com/ThePsychedSci\n\nFacebook\nhttps://www.facebook.com/The-Psychedelic-Scientist-113887593677455 \n\nMore info about the host:\n\nManesh Girn is a Neuroscience PhD student at McGill University and has been lead or co-author on over a dozen scientific publications and book chapters on topics including psychedelics, meditation, daydreaming, and brain networks. \n\nManesh currently has ongoing collaborations with Robin Carhart-Harris and others at the Imperial College Center for Psychedelic Research and is investigating the brain changes underlying psilocybin, LSD, and DMT.\n\nhttps://twitter.com/MGirnNeuro\nhttps://www.researchgate.net/profile/Manesh_Girn",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}