{
  "title": "Why voice AI matters and what’s ahead for Assistant",
  "link": "https://blog.google/products/assistant/why-voice-ai-matters-and-whats-ahead-for-assistant/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"b885k\">I’ve been leading the Google Assistant team for over a year now, and I’m inspired every day by the meaningful questions it raises — like how voice can support underserved populations, teach kids new things or help people with <a href=\"https://blog.google/outreach-initiatives/accessibility/project-relate/\">impaired speech</a> communicate more easily. This week, as part of VentureBeat’s annual <a href=\"https://transform.venturebeat.com/\">Transform</a> technology conference, I sat down for a virtual fireside chat with Jana Eggers, CEO of Nara Logics, to tackle some of these questions and talk about what’s ahead for Assistant.</p><p data-block-key=\"9ainc\">As a computer scientist at heart, I had a lot of fun digging into topics like the machine learning (ML) renaissance, the future of conversational artificial intelligence (AI) and the incredible power of voice to transform people’s lives. You can watch the whole <a href=\"https://vimeo.com/726152744\">fireside chat</a> or check out a few takeaways from our conversation below.</p><h3 data-block-key=\"a3r6j\">A challenger mindset can push the limits of what’s possible.</h3><p data-block-key=\"2a5ai\">Many folks who’ve worked with me know that I like to challenge assumptions. When it comes to building products at Google, that means using technology in new, sometimes uncharted ways to try and solve real-world problems. When I worked on the Google Ads team, for example, I helped create the first ML-driven ads product by challenging existing assumptions about what ML could do. And I’m super excited to use that same challenger spirit to build a world-class, conversational assistant that truly understands you and helps you get things done. I firmly believe we can continue to change people’s lives if we harness new technologies and challenge the boundaries of what’s possible.</p><h3 data-block-key=\"d2n7a\">Voice is a great democratizer.</h3><p data-block-key=\"65rl7\">There are so many people who are underserved with their information and access needs. We talk about new internet users, or people who can’t read but want to access the world’s information. We now see hundreds of millions of voice queries every day, and that’s continuing to grow among new internet users. In India, for example, nearly 30% of Hindi search queries are spoken. That insight tells us a lot. If you think about reaching these people and making voice a democratizer for access, it’s a compelling area to continue to invest in.</p><h3 data-block-key=\"1oait\">We’re working to create magical conversational experiences for everyone.</h3><p data-block-key=\"99n57\">The holy grail with Google Assistant is to figure out how a computer can understand humans the way humans understand each other. That’s an audacious, ambitious goal. Human language is ambiguous; we rely on many different cues when we speak to each other that are inherent to us as human beings. So we need to teach computers how humans express themselves and to ask: What are they trying to say? That’s what this product strives to be — a natural and conversational assistant. Every day we ask ourselves: How do we create a magical conversational experience, where the computer truly understands what you’re trying to say and adapts to you?</p><h3 data-block-key=\"dvklk\">Pragmatic dreamers can change the world.</h3><p data-block-key=\"6kgbq\">This work can’t be done without the right team. Building the best team of people possible is my number one piece of advice. This is hard stuff; it requires a type of individual I call a “pragmatic dreamer.” You want people who can dream big, but you also need people in the trenches figuring out the real, pragmatic engineering challenges standing in the way. I think it’s really important to create space for a team to ideate and explore the boundaries of what’s possible with technology.</p><h3 data-block-key=\"8csbi\">Put people first and the rest will follow.</h3><p data-block-key=\"3645t\">Sometimes we get so enamored by technology that we forget what it's for. I always ask myself: “What are we trying to do for human beings; what are we trying to make better for them?” Sometimes voice can be considered a technology in search of a problem, but I think of it differently. There are real problems people have that this technology can solve. It’s the constant marriage of user problems and what technology can do to solve them. If you keep people as your north star, you can’t go wrong.</p></div></div></body></html>",
  "pubDate": "Thu, 28 Jul 2022 16:00:00 +0000",
  "guid": "https://blog.google/products/assistant/why-voice-ai-matters-and-whats-ahead-for-assistant/",
  "category": "Google Assistant",
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Why voice AI matters and what’s ahead for Assistant",
    "description": "A few takeaways from my fireside chat at VentureBeat’s Transform technology conference.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Screen_Shot_2022-07-26_at_5.04.06_PM_Ghn7TEB.max-600x600.png",
    "site_name": "Google",
    "url": "https://blog.google/products/assistant/why-voice-ai-matters-and-whats-ahead-for-assistant/"
  },
  "author": {
    "name": "Sissie Hsiao",
    "title": "Vice President",
    "department": "Google Assistant",
    "company": ""
  }
}