{
  "title": "EPISODE 61: Raiders in the Night",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Fri, 17 Apr 2020 22:27:55 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2020/4/18/episode-61-raiders-in-the-night",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5e9a2be58660e44c27f51649",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1587162414483-UIMUCPD4CS5R27UZ2Y8A/HOF-61-RaidersInTheNight.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"HOF-61-RaidersInTheNight.jpg\" data-load=\"false\" data-image-id=\"5e9a2d2939a29d137ea217b9\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1587162414483-UIMUCPD4CS5R27UZ2Y8A/HOF-61-RaidersInTheNight.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“We are all ghosts now. But once we were men.”</em> — Anonymous POW from Cabanatuan camp</p><p class=\"\"><em>“Never in history had the United States Army been called on to rescue such a large number of POWs from so deep in enemy territory.”</em> — William Breuer</p><p class=\"\"><em>“We were in the best shape of our lives, and with this mission we understood why he had driven us so hard.”</em> — Alvie Robbins speaking about Henry Mucci’s physical training&nbsp;</p><p class=\"\"><em>“As far as we were concerned, they were gods.”</em> — Bob Body about the Rangers who rescued him and his fellow POWs.&nbsp;</p><p class=\"\"><em>“Nothing in this entire campaign has given me so much personal satisfaction.” —</em> General MacArthur</p><p class=\"\"><em>“I’ll be grateful for the rest of my life that I had a chance to do something in this war that was not destructive. Nothing for me can ever compare with the satisfaction I got from helping to free our prisoners.”</em> — Robert Prince</p><p class=\"\">This is the tale of one of the most daring missions in the history of WWII. After being defeated by the Japanese in 1942, by 1945 American forces were back in the Philippines ready to retake the islands. But their very success may have spelled doom for some survivors of the Bataan Death March, who had spent nearly three years as prisoners of the Japanese. Plenty of evidence, in fact, suggested that Japanese guards were ready to kill them all rather than letting them be freed. The only way to stop this imminent massacre was for a newly formed unit of Rangers, along with Filipino guerrilla fighters, to travel 30 miles behind enemy lines, face off with numerically superior forces, and rescue the POWs. By every logical metric, this had suicide mission written all over it. And ye, the Rangers and guerrilla, all volunteered. Rarely are war stories feel-good stories. But this may be the exception to the rule.&nbsp; &nbsp;</p><p class=\"\">If you'd like to keep following my work on Luminary, please follow my personal link to their platform to sign up. Thank you for understanding that this move is necessary to keep History on Fire viable. <a href=\"https://luminarypodcasts.com/signup?_branch_match_id=486767570160189673\">luminary.link/history</a>&nbsp;</p><p class=\"\">Onnit has shown me love from day 1. So, please check out their supplements, special foods, clothing, and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>.&nbsp;</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "media:content": {
    "media:title": "EPISODE 61: Raiders in the Night"
  }
}