{
  "title": "EPISODE 56 Sitting Bull: Compulsory Civilization with a Side of Murder (Part 3)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Wed, 18 Dec 2019 07:43:41 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2019/12/18/episode-56-sitting-bull-compulsory-civilization-with-a-side-of-murder-part-3",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5df9d6f644ef5328d806eb05",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1576654670579-W3FWBFMB815WS00CEYHW/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5df9d74944ef5328d806f07f\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1576654670579-W3FWBFMB815WS00CEYHW/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“Kill the Indian and save the man.” —</em> Richard Pratt&nbsp;</p><p class=\"\"> <em>“The life my people want is a life of freedom. I have seen nothing that a white man has, houses or railways or clothing or food, that is good as the right to move in the open country, and live in our own fashion.” —</em> Sitting Bull&nbsp;</p><p class=\"\"><em>“The white man knows how to make everything, but he does not know how to distribute it.”</em>  — Sitting Bull&nbsp;</p><p class=\"\"><em>“Possession—a war that doesn’t end.”</em>  — John Trudell&nbsp;</p><p class=\"\"> <em>“We were faint with hunger and maddened by despair. We held our dying children and felt their little bodies tremble as their souls went out and left only a dead weight in our hands. They were not very heavy, but we ourselves were very faint, and the dead weighed us down. There was no hope on earth, and God seemed to have forgotten us.”</em> — Red Cloud</p><p class=\"\"> <em>“Don’t talk to me about Indians; there are no Indians left except those in my band.” —</em> Sitting Bull&nbsp;</p><p class=\"\"> “<em>We shall live again.”</em> — Comanche Ghost Dance song</p><p class=\"\">In historical terms, it was just a blink of an eye ago. In the mid-1800s, the Great Plains in the United States were still firmly in the hands of nomadic, buffalo hunting tribes. The looming threat of American expansion was still barely noticeable. But things changed quickly, and soon the tribes were locked in an existential struggle with the U.S. for control of the heartland of North America. One man rose among these tribes to lead his people to resisting the inevitable for over two decades. By the time he was 10 years old, the boy who would become the Lakota leader Sitting Bull, had killed his first bison by running him down and putting an arrow through its heart. In the opinion of his fellow tribesmen, his ability as a hunter and as a warrior was only second to his generosity in taking care of widows and orphans.&nbsp;</p><p class=\"\"> In this third episode of this series, we’ll see how the U.S. government forcibly tried to change Lakota culture by outlawing their religion, removing kids from parents, and taking their land through laws such as the Dawes Ac. We’ll also discuss the corruption of the agents in charge of reservations, Sitting Bull joining the Wild West Show, adopting Annie Oakley, befriending William Cody, giving away all he earned, Senator Henry Dawes wanting to ‘teach Indians to be selfish’, President’s Harrison terrible policies, the birth of the Ghost Dance movement, and much, much more.&nbsp;</p><p class=\"\">If you'd like to keep following my work on Luminary, please follow my personal link to their platform to sign up. Thank you for understanding that this move is necessary to keep History on Fire viable. <a href=\"https://luminarypodcasts.com/signup?_branch_match_id=486767570160189673\">luminary.link/history</a>&nbsp;</p><p class=\"\">Onnit has shown me love from day 1. So, please check out their supplements, special foods, clothing, and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>.&nbsp;</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p><p class=\"\">   </p>",
  "media:content": {
    "media:title": "EPISODE 56 Sitting Bull: Compulsory Civilization with a Side of Murder (Part 3)"
  }
}