{
  "title": "Strength through continuity in the Japan–Africa partnership",
  "link": "https://www.eastasiaforum.org/2022/11/02/strength-through-continuity-in-the-japan-africa-partnership/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=strength-through-continuity-in-the-japan-africa-partnership",
  "comments": "https://www.eastasiaforum.org/2022/11/02/strength-through-continuity-in-the-japan-africa-partnership/#respond",
  "dc:creator": "Brittany Morreale",
  "pubDate": "Wed, 02 Nov 2022 11:00:30 +0000",
  "category": [
    "Africa",
    "Development",
    "diplomacy",
    "Institutions",
    "Japan",
    "Africa geostrategy",
    "Africa–Asia Growth Corridor",
    "China Africa",
    "China africa investment",
    "Forum on China-Africa Cooperation",
    "Japan africa",
    "Japan Africa aid",
    "Japan Africa cooperation",
    "Japan Africa health",
    "Japan Africa public–private investment",
    "Japan Africa sustainable growth",
    "Japan development",
    "Japan development foreign policy",
    "Japan development philosophy",
    "Japan development principles",
    "Japan foreign policy",
    "Japan human security",
    "Japan–Africa partnership",
    "Japan–India partnership",
    "TICAD",
    "Tokyo International Conference on African Development"
  ],
  "guid": "https://www.eastasiaforum.org/?p=1315467",
  "description": "<p>Authors: Brittany Morreale, USAF and Purnendra Jain, NUS The African continent has emerged as a new geostrategic playground for Asian aid donors. The Forum on China–Africa Cooperation in November 2021 and the Tokyo International Conference on African Development (TICAD) in August 2022 marked the eighth occurrence of China and Japan’s respective high-level African conferences. At [&#8230;]</p>\nThe post <a href=\"https://www.eastasiaforum.org/2022/11/02/strength-through-continuity-in-the-japan-africa-partnership/\">Strength through continuity in the Japan–Africa partnership</a> first appeared on <a href=\"https://www.eastasiaforum.org\">East Asia Forum</a>.",
  "content:encoded": "<p>Authors: Brittany Morreale, USAF and Purnendra Jain, NUS</p>\n<p>The African continent has emerged as a new geostrategic playground for Asian aid donors. The Forum on China–Africa Cooperation in November 2021 and the Tokyo International Conference on African Development (TICAD) in August 2022 marked the eighth occurrence of China and Japan’s respective high-level African conferences.</p>\n<p><span id=\"more-1315467\"></span></p>\n<p><img class=\"aligncenter wp-image-1315473 size-medium\" title=\"Japanese Prime Minister Fumio Kishida speaks virtually at the opening ceremony of the two-day Tokyo International Conference on African Development, Tunis, Tunisia, 27 August 2022 (Photo: Reuters/Kyodo).\" src=\"https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-08-28T000000Z_674242005_MT1KYODO000E0SNY2_RTRMADP_3_JAPAN-PM-KISHIDA-ADDRESSES-TICAD-OPENING-CEREMONY-IN-TUNIS-400x283.jpg\" alt=\"Japanese Prime Minister Fumio Kishida speaks virtually at the opening ceremony of the two-day Tokyo International Conference on African Development, Tunis, Tunisia, 27 August 2022 (Photo: Reuters/Kyodo).\" width=\"400\" height=\"283\" srcset=\"https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-08-28T000000Z_674242005_MT1KYODO000E0SNY2_RTRMADP_3_JAPAN-PM-KISHIDA-ADDRESSES-TICAD-OPENING-CEREMONY-IN-TUNIS-400x283.jpg 400w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-08-28T000000Z_674242005_MT1KYODO000E0SNY2_RTRMADP_3_JAPAN-PM-KISHIDA-ADDRESSES-TICAD-OPENING-CEREMONY-IN-TUNIS-600x425.jpg 600w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-08-28T000000Z_674242005_MT1KYODO000E0SNY2_RTRMADP_3_JAPAN-PM-KISHIDA-ADDRESSES-TICAD-OPENING-CEREMONY-IN-TUNIS-150x106.jpg 150w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-08-28T000000Z_674242005_MT1KYODO000E0SNY2_RTRMADP_3_JAPAN-PM-KISHIDA-ADDRESSES-TICAD-OPENING-CEREMONY-IN-TUNIS-768x544.jpg 768w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-08-28T000000Z_674242005_MT1KYODO000E0SNY2_RTRMADP_3_JAPAN-PM-KISHIDA-ADDRESSES-TICAD-OPENING-CEREMONY-IN-TUNIS-1536x1088.jpg 1536w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-08-28T000000Z_674242005_MT1KYODO000E0SNY2_RTRMADP_3_JAPAN-PM-KISHIDA-ADDRESSES-TICAD-OPENING-CEREMONY-IN-TUNIS-scaled.jpg 2048w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-08-28T000000Z_674242005_MT1KYODO000E0SNY2_RTRMADP_3_JAPAN-PM-KISHIDA-ADDRESSES-TICAD-OPENING-CEREMONY-IN-TUNIS-296x210.jpg 296w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-08-28T000000Z_674242005_MT1KYODO000E0SNY2_RTRMADP_3_JAPAN-PM-KISHIDA-ADDRESSES-TICAD-OPENING-CEREMONY-IN-TUNIS-100x71.jpg 100w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-08-28T000000Z_674242005_MT1KYODO000E0SNY2_RTRMADP_3_JAPAN-PM-KISHIDA-ADDRESSES-TICAD-OPENING-CEREMONY-IN-TUNIS-500x354.jpg 500w\" sizes=\"(max-width: 400px) 100vw, 400px\" /></p>\n<p>At the geostrategic level, Japan and China’s investments in Africa offer insight into the shifting balance of power toward Asia in the 21st century. But a deeper analysis reveals the uniqueness of the TICAD process and Japan’s partnerships with African states. Japan’s core development principles of ownership, partnership and human security set its African development partnerships apart.</p>\n<p>As the curtain fell on TICAD 8, held in Tunisia in August 2022, <a href=\"https://thediplomat.com/2022/08/ticad-2022-japans-deepening-partnerships-in-africa/\" target=\"_blank\" rel=\"noopener noreferrer\">Japan’s deepening commitment</a> to African states stood out against a backdrop of international and domestic turmoil. Japanese Prime Minister Fumio Kishida’s <a href=\"https://japan.kantei.go.jp/101_kishida/statement/202208/_00017.html\" target=\"_blank\" rel=\"noopener noreferrer\">US$30 billion commitment</a> to public–private investment signalled continuity in Japan’s 30-year partnership even as developing nations continue to toil with the most acute socioeconomic impacts of the COVID-19 pandemic and the war in Ukraine.</p>\n<p>While the challenges of 2022 take a new form, the <a href=\"https://www.eastasiaforum.org/2022/05/18/japan-steps-up-its-africa-engagement/\" target=\"_blank\" rel=\"noopener noreferrer\">Japan–Africa partnership</a> has stood the test of time.</p>\n<p>Japan <a href=\"https://www.mofa.go.jp/region/africa/ticad/ticad1.html\" target=\"_blank\" rel=\"noopener noreferrer\">launched the TICAD conference</a> in 1993, marking the first Asia–Africa forum of its kind. Achieving the esteemed status of top global aid donor from 1989 to 2000, Tokyo showcased a new brand of international leadership built around the TICAD model. TICAD elevated Japan’s unique development philosophy and served as a paradigm for emerging Asian powers — most notably China, India and South Korea — to engage with African states.</p>\n<p>In 2022, the Japan–Africa partnership exists within an increasingly crowded and contested ecosystem of development agendas. Alongside China’s Belt and Road Initiative, India’s emergence as a regional power and within the context of intensifying great power competition, Japan’s long-standing development partnerships remain Tokyo’s most important foreign policy tool.</p>\n<p>From its origin, TICAD showcased Japan’s self-help philosophy by centring on African ownership. Tokyo’s focus on economic cooperation marked a significant departure from Western concepts of charitable aid and vertical donor–recipient relationships. Through TICAD, Japan played a pivotal role in elevating African agendas at global institutions such as the United Nations and in shaping aid policy and development goals. TICAD 8 reaffirmed African ownership through the alignment of Japan’s public and private investments with the African Union’s 2063 development agenda.</p>\n<p>TICAD’s health and environmental initiatives have also set the Japan–Africa partnership apart since the introduction of ‘human security’ to Japan’s development principles in 2003. As the flag bearer for human security, Japan defined a human-centred development approach that contrasted sharply with China’s government-focussed infrastructure investments.</p>\n<p>Building on Japan’s initiatives to combat HIV/AIDS, malaria and the Ebola outbreak, the 2016 TICAD 6 Conference in Nairobi introduced an ambitious program to fight and prevent health crises and infectious disease outbreaks across the African continent. Through TICAD, Japan has initiated healthcare system reform and developed a framework to mobilise international organisations and partner nations which has proved foundational to the pandemic response.</p>\n<p>Japan’s global leadership on climate change has similarly been reflected in TICAD’s green development initiatives. Japan&#8217;s <a href=\"https://www.mofa.go.jp/files/100386138.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">US$4 billion investment</a> in green initiatives focusses on sustainable economic growth and the integration of African economies into the global economy. Japan has consistently endeavoured to link African markets with the dynamism of Asia, building on former Japanese prime minister Shinzo Abe’s announcement of the <a href=\"https://www.mofa.go.jp/files/000407643.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">Free and Open Indo-Pacific</a> vision at TICAD 6.</p>\n<p>TICAD 8 reinforced Japan’s role as a quality partner. The debt and lack of transparency that come with Chinese loans have become a liability for African nations and are a threat to Chinese President Xi Jinping’s <a href=\"https://www.eastasiaforum.org/2022/05/24/making-the-belt-and-road-initiative-small-and-beautiful/\" target=\"_blank\" rel=\"noopener noreferrer\">Belt and Road Initiative</a>. Beijing has been forced to adopt new initiatives focussed on health, quality infrastructure, green development and political cooperation in Africa.</p>\n<p>As China’s Forum on China–Africa Cooperation <a href=\"https://www.fmprc.gov.cn/mfa_eng/wjdt_665385/2649_665393/202112/t20211202_10461183.html\" target=\"_blank\" rel=\"noopener noreferrer\">evolves</a> to satisfy the rising expectations and demands of developing nations, Japan exemplifies a quality partnership based on adherence to international law and global development standards.</p>\n<p>As the world looks forward to TICAD 9 in 2025, it is valuable to consider the future direction of Japan’s African partnership in an increasingly contested international order. Tokyo’s development agenda remains more subdued than high-profile <a href=\"https://www.eastasiaforum.org/2022/05/03/unravelling-the-controversies-of-chinese-foreign-aid/\" target=\"_blank\" rel=\"noopener noreferrer\">Chinese investments</a> and the participation of African governments has lagged after reaching an all-time high under former prime minister Shinzo Abe at TICAD 6 and 7.</p>\n<p>Even so, Japan has an opportunity to lead in a time of crisis. With the announcement of the Japan–India <a href=\"https://www.mofa.go.jp/s_sa/sw/in/page3e_000432.html\" target=\"_blank\" rel=\"noopener noreferrer\">Special Strategic and Global Partnership</a> in 2015 and the <a href=\"https://www.eria.org/Asia-Africa-Growth-Corridor-Document.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">Asia–Africa Growth Corridor</a> in 2016, Japan’s efforts to build multilateral partnerships with India may offer a viable alternative for nations weary of the Belt and Road Initiative.</p>\n<p>Japan’s ability to find areas of cooperation with Beijing in Africa, especially on health and sustainability agendas, further benefits African nations. Kishida’s demonstration of his government’s commitment to Africa over the next three years is a bellwether for Japan’s trajectory in the greater Indo-Pacific, as tensions rise and China’s relationships falter.</p>\n<p>Japan’s resilient leadership, depth of development experience and multilateral approach to African partnership provide it with strength through continuity as an aid partner.</p>\n<p><em>Brittany Morreale is a Foreign Area Officer in the US Air Force (USAF), currently serving at NATO SHAPE. She holds a PhD in Asian Studies from the University of Adelaide.</em></p>\n<p><em>Purnendra Jain is currently Visiting Senior Research Fellow at the Institute of South Asian Studies, National University of Singapore (NUS), and Emeritus Professor in the Department of Asian Studies at the University of Adelaide.</em></p>The post <a href=\"https://www.eastasiaforum.org/2022/11/02/strength-through-continuity-in-the-japan-africa-partnership/\">Strength through continuity in the Japan–Africa partnership</a> first appeared on <a href=\"https://www.eastasiaforum.org\">East Asia Forum</a>.",
  "wfw:commentRss": "https://www.eastasiaforum.org/2022/11/02/strength-through-continuity-in-the-japan-africa-partnership/feed/",
  "slash:comments": 0,
  "post-id": 1315467
}