{
  "title": "25: Emilie Wapnick - Why Some of Us Don’t Have ONE True Calling and Multipotentiality",
  "pubDate": "Thu, 18 Jun 2015 20:34:44 +0000",
  "guid": "dc3ae2dcd26f5cc88be54d236957a901",
  "link": "https://traffic.libsyn.com/secure/lifeonpurpose/LifeOnPurposeEmilie.mp3",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #25</strong>, my guest is artist, entrepreneur, writer, speaker, and coach <strong>Emilie Wapnick. Emilie </strong>joins me to discuss what those she calls multipotentialites, people who have many different interests and creative pursuits in life. We also discuss her recent TEDxBend talk entitled<strong> <em>Why Some of Us Don’t Have ONE True Calling</em></strong>, overcoming fear and confidence challenges, and how she lives a life on purpose.</p>\n<p>About: <strong>Emilie Wapnick</strong> is an artist, entrepreneur, writer, speaker, and coach. She says she was blessed with so many interests that she was unable to pick just one. She studied music, visual arts, film production and law, and graduated from the Law Faculty at McGill University. After years of feeling anxious about her zigzagging career path and hyphenated credentials, she finally decided to embrace her plural nature and start a movement for others who lean toward being what she calls “multipotentialites.”</p>\n<p>Since launching her website, Puttylike, in 2010, <strong>Emilie</strong> has inspired thousands of multipotentialites to stop trying to fit themselves into boxes, and embrace their plurality. She has been featured in Lifehacker, The Financial Times, and The Huffington Post. Currently, she is working on her forthcoming book, <em>“Multipotentialite.”</em></p>\n<p>This past April, <strong>Emilie</strong> stood in front of 1,400 people at TEDxBend and gave a talk entitled <em><strong>Why Some of Us Don’t Have ONE True Calling</strong></em>, which encapsulates her findings on multipotentiality in 12 minutes! </p>\n<p>To learn more about <strong>Emilie</strong> and her work, visit: <a href=\"http://puttylike.com\" target=\"_blank\">http://puttylike.com</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #25, my guest is artist, entrepreneur, writer, speaker, and coach Emilie Wapnick. Emilie joins me to discuss what those she calls multipotentialites, people who have many different interests and creative pursuits in life. We also discuss her recent TEDxBend talk entitled <em>Why Some of Us Don’t Have ONE True Calling</em>, overcoming fear and confidence challenges, and how she lives a life on purpose.</p>\n<p>About: Emilie Wapnick is an artist, entrepreneur, writer, speaker, and coach. She says she was blessed with so many interests that she was unable to pick just one. She studied music, visual arts, film production and law, and graduated from the Law Faculty at McGill University. After years of feeling anxious about her zigzagging career path and hyphenated credentials, she finally decided to embrace her plural nature and start a movement for others who lean toward being what she calls “multipotentialites.”</p>\n<p>Since launching her website, Puttylike, in 2010, Emilie has inspired thousands of multipotentialites to stop trying to fit themselves into boxes, and embrace their plurality. She has been featured in Lifehacker, The Financial Times, and The Huffington Post. Currently, she is working on her forthcoming book, <em>“Multipotentialite.”</em></p>\n<p>This past April, Emilie stood in front of 1,400 people at TEDxBend and gave a talk entitled <em>Why Some of Us Don’t Have ONE True Calling</em>, which encapsulates her findings on multipotentiality in 12 minutes! </p>\n<p>To learn more about Emilie and her work, visit: <a href=\"http://puttylike.com\" target=\"_blank\">http://puttylike.com</a>.</p>",
  "enclosure": "",
  "itunes:duration": "01:02:36",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #25, my guest is artist, entrepreneur, writer, speaker, and coach Emilie Wapnick. Emilie joins me to discuss what those she calls multipotentialites, people who have many different interests and creative pursuits in life...."
}