{
  "title": "Ukraine Wins Back Territory From Russia!",
  "itunes:title": "Ukraine Wins Back Territory From Russia!",
  "pubDate": "Fri, 16 Sep 2022 05:00:09 +0000",
  "guid": "8765dc1c-7892-434b-bafb-b887106eb934",
  "link": "https://thejimmydoreshow.libsyn.com/ukraine-wins-back-territory-from-russia",
  "itunes:image": "",
  "description": "<p>The news networks have brimmed with stories lately of the stunning Kharkiv counter-offensive that has seen Ukraine recapture vast swathes of territory from the invading Russians. Have we reached a turning point in the war? Is the handwriting on the wall for Putin and his marauding Russian hordes? Or is this a mere blip, a short-term stumble for the Russian Bear before he continues his inexorable march across all of the Donbass, and possibly all of Ukraine?<br /> <br /> Jimmy and his panel of America’s comedian Kurt Metzger and The Dive’s Jackson Hinkle discuss this surprising turn of events in the Ukraine War and their larger significance.<br /> <br /> Plus segments on the latest round of booster misinformation from America's top health officials and the DNC's epic snub of progressives over dark money.<br /> <br /> Also featuring Stef Zamorano and Mike MacRae! And phone calls from King Charles III and Joe Biden!</p>",
  "content:encoded": "<p>The news networks have brimmed with stories lately of the stunning Kharkiv counter-offensive that has seen Ukraine recapture vast swathes of territory from the invading Russians. Have we reached a turning point in the war? Is the handwriting on the wall for Putin and his marauding Russian hordes? Or is this a mere blip, a short-term stumble for the Russian Bear before he continues his inexorable march across all of the Donbass, and possibly all of Ukraine?  Jimmy and his panel of America’s comedian Kurt Metzger and The Dive’s Jackson Hinkle discuss this surprising turn of events in the Ukraine War and their larger significance.  Plus segments on the latest round of booster misinformation from America's top health officials and the DNC's epic snub of progressives over dark money.  Also featuring Stef Zamorano and Mike MacRae! And phone calls from King Charles III and Joe Biden!</p>",
  "enclosure": "",
  "itunes:duration": "01:04:42",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "The news networks have brimmed with stories lately of the stunning Kharkiv counter-offensive that has seen Ukraine recapture vast swathes of territory from the invading Russians. Have we reached a turning point in the war? Is the handwriting on the...",
  "itunes:episodeType": "full",
  "itunes:summary": "The news networks have brimmed with stories lately of the stunning Kharkiv counter-offensive that has seen Ukraine recapture vast swathes of territory from the invading Russians. Have we reached a turning point in the war? Is the handwriting on the wall for Putin and his marauding Russian hordes? Or is this a mere blip, a short-term stumble for the Russian Bear before he continues his inexorable march across all of the Donbass, and possibly all of Ukraine? Jimmy and his panel of America’s comedian Kurt Metzger and The Dive’s Jackson Hinkle discuss this surprising turn of events in the Ukraine War and their larger significance. Plus segments on the latest round of booster misinformation from America's top health officials and the DNC's epic snub of progressives over dark money. Also featuring Stef Zamorano and Mike MacRae! And phone calls from King Charles III and Joe Biden!"
}