{
  "title": "Ten Ways Your Data Project is Going to Fail",
  "description": "<!--kg-card-begin: markdown--><p><strong>Introduction</strong></p>\n<p>Data science continues to generate excitement and yet real-world results can often disappoint business stakeholders. How can we mitigate risk and ensure results match expectations? Working as a technical data scientist at the interface between R&D and commercial operations has given me an insight into the traps</p>",
  "link": "https://www.martingoodson.com/ten-ways-your-data-project-is-going-to-fail/",
  "guid": "5e15f163bda2f50017c807c9",
  "dc:creator": "Martin Goodson",
  "pubDate": "Tue, 01 Nov 2016 13:38:48 GMT",
  "content:encoded": "<!--kg-card-begin: markdown--><p><strong>Introduction</strong></p>\n<p>Data science continues to generate excitement and yet real-world results can often disappoint business stakeholders. How can we mitigate risk and ensure results match expectations? Working as a technical data scientist at the interface between R&D and commercial operations has given me an insight into the traps that lie in our path. I present a personal view on the most common failure modes of data science projects.</p>\n<p>The long version with slides and explanatory text below. Slides in one pdf <a href=\"https://drive.google.com/file/d/0B4xuGj_-3XLreGFrc2hjc2FhYkE/view\">here</a>.</p>\n<h2 id=\"thereissomediscussionathackernews\">There is some discussion at <a href=\"https://news.ycombinator.com/item?id=12858480\">Hacker News</a></h2>\n<p>First, about me:<br>\n<img src=\"https://www.martingoodson.com/content/images/2016/11/Slide02.jpg\" alt loading=\"lazy\"></p>\n<p>This talk is based on conversations I've had with many senior data scientists over the last few years. Many companies seems to go through a pattern of hiring a data science team only for the entire team to quit or be fired around 12 months later. Why is the failure rate so high?</p>\n<p>Let's begin:<br>\n<img src=\"https://www.martingoodson.com/content/images/2016/11/Slide05-1.jpg\" alt loading=\"lazy\"><br>\nA very wise data science consultant told me he always asks if the data has been used before in a project. If not, he adds 6-12 months onto the schedule for data cleansing.</p>\n<p>Do a data audit before you begin. Check for missing data, or dirty data. For example, you might find that a database has different transactions stored in dollar and yen amounts, without indicating which was which. This actually happened.</p>\n<p><img src=\"https://www.martingoodson.com/content/images/2016/11/Slide06.jpg\" alt loading=\"lazy\"><br>\nNo it isn't. Data is not a commodity, it needs to be transformed into a product before it's valuable. Many respondents told me of projects which started without any idea of who their customer is or how they are going to use this \"valuable data\". The answer came too late: \"nobody\" and \"they aren't\"</p>\n<p><img src=\"https://www.martingoodson.com/content/images/2016/11/Slide07.jpg\" alt loading=\"lazy\"></p>\n<p>Don't torture your data scientists by witholding access to the data and tools they need to do their job. This senior data scientist took six weeks to get permission to install python and R. She was so happy!</p>\n<p>Well, she was until she sent me this shortly afterwards:</p>\n<p><img src=\"https://www.martingoodson.com/content/images/2016/11/Slide07-1.jpg\" alt loading=\"lazy\"></p>\n<p>Now, allow me to introduce this guy:<br>\n<img src=\"https://www.martingoodson.com/content/images/2016/11/Slide09.jpg\" alt loading=\"lazy\"></p>\n<p>He was a product manager at an online auction site that you may have heard of. His story was about an A/B test of a new prototype algorithm for the main product search engine. The test was successful and the new algorithm was moved to production.</p>\n<p>Unfortunately, after much time and expense, it was realised that there was a bug in the A/B test code: the prototype had not been used. They had accidentally tested the old algorithm against <em>itself</em>. The results were nonsense.</p>\n<p>This was the problem:<br>\n<img src=\"https://www.martingoodson.com/content/images/2016/11/Slide12.jpg\" alt loading=\"lazy\"><br>\nYou need people who live and breathe selection bias, measurement bias, etc. or you'll never know the results are meaningless. These people are called scientists.</p>\n<p>Oh, by the way:<br>\n<img src=\"https://www.martingoodson.com/content/images/2016/11/Slide13.jpg\" alt loading=\"lazy\"></p>\n<p><img src=\"https://www.martingoodson.com/content/images/2016/11/Slide14.jpg\" alt loading=\"lazy\"></p>\n<p>Likewise - the opposite is very often true:<br>\n<img src=\"https://www.martingoodson.com/content/images/2016/11/Slide15.jpg\" alt loading=\"lazy\"></p>\n<p><img src=\"https://www.martingoodson.com/content/images/2016/11/Slide16.jpg\" alt loading=\"lazy\"><br>\nThe hype around machine learning means there is a lot of readily available content out there. This can lead to the 'instant expert' phenomenon: now everyone has a great machine learning idea. Symptoms are your boss using words like 'regularize' and 'ensemble method' in the wrong context. Trust me, this will not end well.</p>\n<p><img src=\"https://www.martingoodson.com/content/images/2016/11/Slide17.jpg\" alt loading=\"lazy\"><br>\nThe Cost-Effective HealthCare project used data from hospitals to process Emergency Room patients who had symptoms of pneumonia. They aimed to build a system that could predict people who had a low probability of death, so they could be simply sent home with antibiotics. This would allow care to be focused on the most serious cases, who were likely to suffer complicatations.</p>\n<p>The neural network they developed had a very high accuracy but, strangely, it always decided to send asthma sufferers  home. Weird, since asthmatics are actually at <em>high</em> risk of complications from pneumonia.</p>\n<p>It turned out that asthmatics who present with pneumonia are always admitted to Intensive Care. Because of this, there were no cases of any asthmatics dying in the training data. The model concluded that asthmatics were low risk, when the opposite was actually true. The model had great accuracy but if deployed in production it would certainly have killed people.</p>\n<p><img src=\"https://www.martingoodson.com/content/images/2016/11/Slide18.jpg\" alt loading=\"lazy\"><br>\nMoral of the story: use a simple model you can understand [1]. Only then move onto something more complex, and only if you <em>need</em> to.</p>\n<p><img src=\"https://www.martingoodson.com/content/images/2016/11/Slide19.jpg\" alt loading=\"lazy\"><br>\nThe core of science is reproducibility. Please do all of these things. Don't say I didn't warn you.</p>\n<p><img src=\"https://www.martingoodson.com/content/images/2016/11/Slide20.jpg\" alt loading=\"lazy\"><br>\nAn applied science lab is a big commitment. Data can often be quite threatening to people who prefer to trust their instincts. R&D has a high risk of failure and unusually high levels of perseverance are table stakes. Do some soul searching - will your company really accept this culture?</p>\n<p><img src=\"https://www.martingoodson.com/content/images/2016/11/Slide21.jpg\" alt loading=\"lazy\"><br>\nNever let UX designers and product managers design a data product (even wireframes) using fake data. As soon as you apply real data it will be apparent that the wireframe is complete fantasy.</p>\n<p>The real data will have weird outliers, or be boring. It will be too dynamic. It will be either too predictable or not predictable enough. Use live data from the beginning or your project will end in misery and self-hatred. Just like this poor leopard, weasel thing.</p>\n<p>[1] See <a href=\"http://www.cs.cornell.edu/people/clarkson/trustweb/cs578.lect.safety.pdf\">here</a> for more.</p>\n<hr>\n<p>Please get in touch with your own data disaster. Let's get some data behind this and move Data Science forwards. All results will be fully anonymised. Use the form below or contact me via:</p>\n<p>twitter: <a href=\"http://twitter.com/martingoodson\">@martingoodson</a><br>\nemail: <a href=\"mailto:martingoodson@gmail.com\">martingoodson@gmail.com</a></p>\n<hr>\n<!-- Begin MailChimp Signup Form -->\n<link href=\"//cdn-images.mailchimp.com/embedcode/classic-10_7.css\" rel=\"stylesheet\" type=\"text/css\">\n<style type=\"text/css\">\n\t#mc_embed_signup{background:#fff; clear:left; font:14px Helvetica,Arial,sans-serif; }\n\t/* Add your own MailChimp form style overrides in your site stylesheet or in this style block.\n\t   We recommend moving this block and the preceding CSS link to the HEAD of your HTML file. */\n</style>\n<div id=\"mc_embed_signup\">\n<form action=\"//taxfriend.us6.list-manage.com/subscribe/post?u=30f72758c30f83c814d71b8f2&id=87758a9210\" method=\"post\" id=\"mc-embedded-subscribe-form\" name=\"mc-embedded-subscribe-form\" class=\"validate\" target=\"_blank\" novalidate>\n    <div id=\"mc_embed_signup_scroll\">\n\t<h4>Add Your Data to the Survey</h4>\n<p>I'll email you with the results of the survey when it's completed. </p>\n<div class=\"mc-field-group\">\n\t<label for=\"mce-EMAIL\">Email Address  <span class=\"asterisk\">*</span>\n</label>\n\t<input type=\"email\" value name=\"EMAIL\" class=\"required email\" id=\"mce-EMAIL\">\n</div>\n<div class=\"mc-field-group\">\n\t<label for=\"mce-MMERGE3\">Brief Description of the Data Disaster  <span class=\"asterisk\">*</span>\n        </label>\n        \t<textarea value name=\"MMERGE3\" class=\"required\" id=\"mce-MMERGE3\"></textarea>\n</div><div id=\"mce-responses\" class=\"clear\">\n\t\t<div class=\"response\" id=\"mce-error-response\" style=\"display:none\"></div>\n\t\t<div class=\"response\" id=\"mce-success-response\" style=\"display:none\"></div>\n\t</div>    <!-- real people should not fill this in and expect good things - do not remove this or risk form bot signups-->\n    <div style=\"position: absolute; left: -5000px;\" aria-hidden=\"true\"><input type=\"text\" name=\"b_30f72758c30f83c814d71b8f2_87758a9210\" tabindex=\"-1\" value></div>\n    <div class=\"clear\"><input type=\"submit\" value=\"Subscribe\" name=\"subscribe\" id=\"mc-embedded-subscribe\" class=\"button\"></div>\n    </div>\n</form>\n</div>\n<!--End mc_embed_signup-->\n<!--kg-card-end: markdown-->"
}