{
  "title": "Leaked Emails Prove U.K. Gov’t Ordered Censoring Of YouTube Videos",
  "itunes:title": "Leaked Emails Prove U.K. Gov’t Ordered Censoring Of YouTube Videos",
  "pubDate": "Fri, 17 Jun 2022 05:36:09 +0000",
  "guid": "920f3552-7ee5-493a-a3f0-567fdf8638e1",
  "link": "https://thejimmydoreshow.libsyn.com/leaked-emails-prove-uk-govt-ordered-censoring-of-youtube-videos",
  "itunes:image": "",
  "description": "<p>Leaked emails have revealed the extent to which celebrity British journalist Paul Mason has been colluding with members of U.K. intelligence to smear, deplatform and bankrupt left-wing and anti-war journalistic outlets like The Grayzone. Mason has even generated a bizarre “mindmap” connecting Russian psyops to Jeremy Corbyn, the Muslim community, trade unions and black people. Jimmy discusses the bombshell report with The Grayzone's Max Blumenthal and American comedian Kurt Metzger.<br /> <br /> Plus a segment on a Ukraine boxer who celebrated her silver medal by unfolding a neo-Nazi Azov Battalion flag on the medal stand.<br /> <br /> Also featuring Stef Zamorano and Mike MacRae! And phone calls from Alec Baldwin, Kevin Spacey and Joe Biden!</p>",
  "content:encoded": "<p>Leaked emails have revealed the extent to which celebrity British journalist Paul Mason has been colluding with members of U.K. intelligence to smear, deplatform and bankrupt left-wing and anti-war journalistic outlets like The Grayzone. Mason has even generated a bizarre “mindmap” connecting Russian psyops to Jeremy Corbyn, the Muslim community, trade unions and black people. Jimmy discusses the bombshell report with The Grayzone's Max Blumenthal and American comedian Kurt Metzger.  Plus a segment on a Ukraine boxer who celebrated her silver medal by unfolding a neo-Nazi Azov Battalion flag on the medal stand.  Also featuring Stef Zamorano and Mike MacRae! And phone calls from Alec Baldwin, Kevin Spacey and Joe Biden!</p>",
  "enclosure": "",
  "itunes:duration": "01:06:05",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Leaked emails have revealed the extent to which celebrity British journalist Paul Mason has been colluding with members of U.K. intelligence to smear, deplatform and bankrupt left-wing and anti-war journalistic outlets like The Grayzone. Mason has...",
  "itunes:episodeType": "full",
  "itunes:summary": "Leaked emails have revealed the extent to which celebrity British journalist Paul Mason has been colluding with members of U.K. intelligence to smear, deplatform and bankrupt left-wing and anti-war journalistic outlets like The Grayzone. Mason has even generated a bizarre “mindmap” connecting Russian psyops to Jeremy Corbyn, the Muslim community, trade unions and black people. Jimmy discusses the bombshell report with The Grayzone's Max Blumenthal and American comedian Kurt Metzger. Plus a segment on a Ukraine boxer who celebrated her silver medal by unfolding a neo-Nazi Azov Battalion flag on the medal stand. Also featuring Stef Zamorano and Mike MacRae! And phone calls from Alec Baldwin, Kevin Spacey and Joe Biden!"
}