{
  "title": "Why Cybersecurity Is Key to IoT Sensors",
  "link": "https://spectrum.ieee.org/sensor-cybersecurity-standards",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/overhead-view-of-vehicle-traffic-on-highway-with-widgets-in-foreground-info-for-editor-if-needed.jpg?id=31963264&width=2000&height=1500&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>Sensors enabled by the Internet of Things are network-connected smart devices that collect and transmit real-time data about their environment. The data they provide lets people make better-informed decisions.</p><p>The use of IoT sensors has grown explosively in recent years because their increasing functionality, small size, and low power consumption allow designers to deploy them in new applications to increase productivity and lower costs. The sensors are being used in new ways to maximize the capabilities of network-connected systems and infrastructure.</p><hr/><p>The sensors are poised for mass-scale adoption in fields including automotive, health care, industrial automation, energy, and smart cities. But the lack of standardization in IoT sensors, coupled with interoperability challenges, has made them vulnerable to cyberattacks—which creates barriers for their ubiquitous use. Hackers are targeting IoT sensors in greater numbers, in more industries, and with increased sophistication.</p>\n<h2>Consequences of poor cybersecurity</h2><p>A cyberattack can lead to financial penalties and legal issues if it renders a business or organization unable to fulfill its contractual obligations. An attack could harm the corporate brand and generate user mistrust of affected systems. It is costly and time-consuming to repair damage caused by an attack.</p><p>More concerning is the inability to collect and transmit uncorrupted data in real time from critical applications such as with network-connected medical devices. The growing use of such medical devices to monitor and treat diabetes and other conditions depends on sensor cybersecurity.</p><p class=\"pull-quote\">Cyberattackers are targeting IoT sensors in greater numbers, in more industries, and with increased sophistication. Interoperability challenges reduce the ability to access the sensors and the data they publish.</p><p>Another area where sensor cybersecurity is essential is smart cities, a recently growing market. Smart cities use networks that rely on systems of IoT-enabled sensors to gather data to improve local services, allocate resources more effectively, and manage traffic signals and other infrastructure. If compromised sensors fail to send timely, accurate information, then safety issues might arise. People and property could be in danger if warnings about fires, chemical spills, or other emergency situations fail to reach public safety officials in time.</p>\n<h2>Sensors can improve operational efficiency</h2><p>The power and energy sector could significantly benefit from sensor cybersecurity and interoperability to help determine when and where to efficiently distribute power.</p><p>Consider the U.S. grid, which comprises about 7,300 power plants; 160,000 miles of high-voltage power lines; and millions of miles of low-voltage power lines and distribution transformers, according to the U.S. <a href=\"https://www.eia.gov/todayinenergy/detail.php?id=27152\" rel=\"noopener noreferrer\" target=\"_blank\">Energy Information Administration</a>. The grid consists of equipment of varying vintages and different technologies, is operated by many companies, and is serviced by vendors with differing cybersecurity practices. Achieving adequate cybersecurity in such a large, disjointed system is a monumental challenge, but it could have a great impact on autonomous control of power systems.</p><p>In industry, automated systems are critical to improving operational efficiency and precision manufacturing, helping to make up for worker shortages. But when the IoT sensors in automated or semiautomated systems fail to operate, workers could be injured or exposed to toxic substances, and operations could be disrupted.</p>\n<h2>IEEE standards on sensors </h2><p>The <a href=\"https://standards.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Standards Association</a> has a growing portfolio of standards and projects that address different aspects of IoT sensors. Here are a few of them:</p><p><a href=\"https://standards.ieee.org/search/?q=1451&type=%7CProject%7CStandard\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE 1451</a> is a series of standards and projects that describe a set of open, common, network-independent communication interfaces for connecting sensors or actuators to microprocessors, instrumentation systems, and control/field networks. The goal of the series is to allow access of sensor/actuator data through a common set of interfaces, whether they are connected to systems or networks by wired or wireless means.</p><p>The <a href=\"https://standards.ieee.org/ieee/2700/6770/?utm_source=ieeeorg&utm_medium=the-institute&utm_campaign=cybersecurity-2022\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE 2700 Standard for Sensor Performance Parameter Definitions</a> provides a common framework for performance specification terminology, units, conditions, and limits. The standard addresses accelerometers, magnetometers, gyrometers/gyroscopes, accelerometer/magnetometer/gyroscope combination sensors, barometer/pressure sensors, hygrometer/humidity sensors, temperature sensors, light sensors, and proximity sensors.</p><p><a href=\"https://standards.ieee.org/search/?q=p2888&type=%7CProject\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE P2888</a> is a series of standards projects that address a multitude of areas for virtual reality and augmented reality, including sensor interfaces.</p><p>The <a href=\"https://beyondstandards.ieee.org/addressing-the-need-for-protecting-cybersecurity-in-connected-diabetes-devices/?utm_source=ieeeorg&utm_medium=the-institute&utm_campaign=cybersecurity-2022\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE 2621</a> series of standards defines the concept of cybersecurity assurance for wireless diabetes devices, and it specifies security requirements. It also provides instructions on how to achieve assurance.</p>",
  "pubDate": "Fri, 21 Oct 2022 18:00:00 +0000",
  "guid": "https://spectrum.ieee.org/sensor-cybersecurity-standards",
  "category": [
    "Ieee products services",
    "Standards",
    "Sensors",
    "Iot",
    "Cybersecurity",
    "Ieee standards association",
    "Type:ti"
  ],
  "dc:creator": "The IEEE Standards Association",
  "media:content": ""
}