{
  "title": "Algo Hour - Bridging a Mental Health Crisis with Multi Armed Bandits | Ratish Dalvi & Margaret Smiley, Quartet Health",
  "description": "<h3 id=\"title\">Title:</h3>\n\n<p>Bridging a Mental Health Crisis with Multi Armed Bandits</p>\n\n<h3 id=\"talk-abstract\">Talk Abstract:</h3>\n\n<p>The pandemic we are facing has brought with it another health care crisis: access to mental health care. Quartet Health is bridging the crisis using AI to personalize the patient journey across the United States.</p>\n\n<p>At each step of the patient journey, machine learning is leveraged to identify a patient’s needs, and get them into adequate mental health care. Using data on healthcare provider history and patient preferences, we productionized models to deliver personalized health care to patients, while optimizing our overall mental health care network.</p>\n\n<p>In this presentation, we will walk through the complexity of using health care data and present an algorithm that matches patients to mental health providers. We will begin by formulating this matching algorithm as a non-stationary, contextual multi armed bandit problem, and then follow its evolution into a linear programming solution. The talk will include background on MAB problems, theoretical bounds, empirical analysis and implementation details.</p>\n\n<h3 id=\"date-and-time\">Date and Time:</h3>\n\n<p>The talk will be held on Tuesday, April 5th at 1:00PM PDT.</p>\n\n<h3 id=\"recording-info\">Recording Info:</h3>\n<p>This talk will be recorded live and this post will be updated with the recording information. \nIf you would like to participate in the talk live, reach out to algo-hour@stitchfix.com for meeting information.</p>\n\n<!-- :\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/cAlJYxFYA04\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n -->\n<h3 id=\"speaker-info\">Speaker Info:</h3>\n\n<p>Margaret Smiley is the Director of Data Operations at <a href=\"https://www.quartethealth.com/\">Quartet Health</a>, leading the company’s Analytics, Data Integration, Analytics Engineering, and Data Engineering functions. Prior to Quartet, Margaret was the Director of Data at Wellthie Inc., where she was responsible for product analytics and data management. Margaret graduated from NYU and completed her MPA in Health Policy and Management at NYU’s Robert F. Wagner School of Public Service.</p>\n\n<p>Ratish Dalvi is the head of Data Science at Quartet Health, where he focuses on driving revenue and reducing costs through machine learning and causal inference. In his 10+ years of experience focused on NLP, computer vision and reinforcement learning, Ratish has built various AI systems across healthcare, CRM, oil &amp; gas pipelines, power plants and intelligent vehicles. Ratish holds degrees from Indiana university and Pune university.</p>\n\n<h3 id=\"venue-info\">Venue Info:</h3>\n<p>Algo Hour is a weekly series of informal talks on theory and application of algorithms relevant to Stitch Fix. The talk series features both internal Stitch Fix speakers and external speakers joining us from the wider Data Science community. Some of these external talks are shared publicly on \n<a href=\"https://www.youtube.com/channel/UC2ZuO5Vbb8aux8QA-BVfXDQ\">our YouTube channel</a>.</p>\n\n<!-- ### Tweet message\nCheck out the public Algo Hour we held on Tuesday 3/15 with Margaret Smiley and Ratish Dalvi of Quartet Health!\nIn this talk, Margaret, Director of Data Operations, and Ratish, Director of DS, presented about bridging a mental health crisis with multi-armed bandits.\nhttps://multithreaded.stitchfix.com/blog/2022/03/31/quartet-algo-hour-announcement.md\n-->",
  "pubDate": "Thu, 31 Mar 2022 01:00:00 +0000",
  "link": "https://multithreaded.stitchfix.com/blog/2022/03/31/quartet-algo-hour-announcement/",
  "guid": "https://multithreaded.stitchfix.com/blog/2022/03/31/quartet-algo-hour-announcement/"
}