{
  "id": "https://bibleinoneyear.org/en/youth/206",
  "title": "Day 206: What About Those Who Do Not Believe?",
  "description": "Psalm 89:9,11–12a,13, Hosea 12:6, 13:5–6, 14:2,4, Romans 9:2–8,10–16.  God is sovereign  He rules and reigns in his universe",
  "pubDate": "Mon, 25 Jul 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/206/",
  "itunes:duration": "14:39",
  "guid": "enyouth25072022-206",
  "length": 879.33,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 206: What About Those Who Do Not Believe?",
  "itunes:subtitle": "Psalm 89:9,11–12a,13, Hosea 12:6, 13:5–6, 14:2,4, Romans 9:2–8,10–16.  God is sovereign  He rules and reigns in his universe",
  "itunes:summary": "In February 1974, I had an encounter with Jesus Christ that totally changed my life. I understood he had died for me. I experienced his love. I knew God was real. I knew the extraordinary blessings of a relationship with Jesus. But almost immediately afterwards I experienced what Paul speaks about in this passage: ‘A huge sorrow... an enormous pain deep within me’ (Romans 9:2, MSG).\nI longed for everyone to experience and know what I had only so recently experienced. I longed for my family and friends who were not yet Christians to know Christ.\nThe apostle Paul cared so passionately about his own people that he was willing to be cut off from God and the people whom he loved, if they would be saved. He writes, ‘I could wish that I myself were cursed and cut off from Christ [a definition of hell] for the sake of my people, those of my own race, the people of Israel’ (vv.3–4a).\nYet at the same time Paul trusted that God had the whole situation under control. God is sovereign. He rules and reigns in his universe.\nHow do we balance this anguish and passion for those we love, with a trust in God’s ultimate sovereignty?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 571
}