{
  "title": "Human Biophysics as Network Weights: Conditional Generative Models for Ultra-fast Simulation. (arXiv:2211.01856v1 [cs.LG])",
  "link": "http://arxiv.org/abs/2211.01856",
  "description": "<p>Simulations of biophysical systems have provided a huge contribution to our\nfundamental understanding of human physiology and remain a central pillar for\ndevelopments in medical devices and human machine interfaces. However, despite\ntheir successes, such simulations usually rely on highly computationally\nexpensive numerical modelling, which is often inefficient to adapt to new\nsimulation parameters. This limits their use in dynamic models of human\nbehavior, for example in modelling the electric fields generated by muscles in\na moving arm. We propose the alternative approach to use conditional generative\nmodels, which can learn complex relationships between the underlying generative\nconditions whilst remaining inexpensive to sample from. As a demonstration of\nthis concept, we present BioMime, a hybrid architecture that combines elements\nof deep latent variable models and conditional adversarial training to\nconstruct a generative model that can both transform existing data samples to\nreflect new modelling assumptions and sample new data from a conditioned\ndistribution. We demonstrate that BioMime can learn to accurately mimic a\ncomplex numerical model of human muscle biophysics and then use this knowledge\nto continuously sample from a dynamically changing system in real-time. We\nargue that transfer learning approaches with conditional generative models are\na viable solution for dynamic simulation with any numerical model.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Ma_S/0/1/0/all/0/1\">Shihan Ma</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Clarke_A/0/1/0/all/0/1\">Alexander Kenneth Clarke</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Maksymenko_K/0/1/0/all/0/1\">Kostiantyn Maksymenko</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Deslauriers_Gauthier_S/0/1/0/all/0/1\">Samuel Deslauriers-Gauthier</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sheng_X/0/1/0/all/0/1\">Xinjun Sheng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhu_X/0/1/0/all/0/1\">Xiangyang Zhu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Farina_D/0/1/0/all/0/1\">Dario Farina</a>"
}