{
  "title": "Episode 116: Social Loafing - Don't Be a Sucker or a Free Loader!",
  "pubDate": "Fri, 12 Feb 2010 13:08:16 +0000",
  "guid": "episode-116-social-loafing-dont-be-a-sucker-or",
  "link": "http://www.thepsychfiles.com/2010/02/episode-116-social-loafing-dont-be-a-sucker-or-a-free-loader/",
  "itunes:image": "",
  "description": "Do you like working in a group?  Most people don't because they're afraid that they'll have to do most of the work (wind up being a sucker) and that other group members won't do their share of the work (free loaders).  Want to find out how to avoid this and make your group work productive?  Learn how the Agile software development technique can be adapted to your help your next group project be a success.",
  "content:encoded": "Do you like working in a group?  Most people don't because they're afraid that they'll have to do most of the work (wind up being a sucker) and that other group members won't do their share of the work (free loaders).  Want to find out how to avoid this and make your group work productive?  Learn how the Agile software development technique can be adapted to your help your next group project be a success.",
  "enclosure": "",
  "itunes:duration": "26:35",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,social,software,psychology,lecture,working,agile,team,loafing",
  "itunes:subtitle": "Do you like working in a group?  Most people are afraid they'll have to do most of the work (wind up being a sucker) and that other group members won't do their share of the work (free loaders).  Find out how to make your group work productive.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Do you like working in a group? Most people don't because they're afraid that they'll have to do most of the work (wind up being a sucker) and that other group members won't do their share of the work (free loaders). Want to find out how to avoid this and make your group work productive? Learn how the Agile software development technique can be adapted to your help your next group project be a success."
}