{
  "title": "Exclusive Course Opportunity",
  "description": "5 Spots Left",
  "link": "https://datascienceleadership.substack.com/p/exclusive-course-opportunity",
  "guid": "https://datascienceleadership.substack.com/p/exclusive-course-opportunity",
  "dc:creator": "Tyler Folkman",
  "pubDate": "Mon, 15 Jun 2020 06:37:22 GMT",
  "enclosure": "",
  "content:encoded": "<p>Hey there,</p><p>Sorry that things have been silent from me for a while! But, don&#8217;t worry, I&#8217;ve been thinking a lot about how I can help you become a better data scientist.</p><p>As many of you know, I recently sent out a survey to better understand what people would love to learn. The top 3 results by far were:</p><ol><li><p>Deployment of machine learning models</p></li><li><p>Getting a data science job or promotion</p></li><li><p>Translating a business problem to a data science problem</p></li></ol><p>So - I decided to create a course that addresses all three!</p><p>The course is called <strong>Delivering Real Business Value with Machine Learning</strong> and teaches you how to:</p><ul><li><p>Move beyond machine learning hype to actual value creation</p></li><li><p>Learn how to deploy your own models without having to rely on an engineer</p></li><li><p>Gain skills that will truly stand out when looking for your next job or promotion</p></li><li><p>Improve your ability to communicate with leaders at your company</p></li></ul><p>I've seen an insane increase in data science value once data scientists learn these skills because they can own the process end-to-end and iterate rapidly.  </p><p>I am looking for a small group of people to be part of a limited beta group as I build the course and wanted to give you an opportunity to join! Currently, I only have <strong>5 spots remaining</strong> in the beta.</p><p>Those in the beta will get access to the course content as I create it and will have an opportunity to provide me feedback as we go so I can tailor it to be as useful as possible to you. I'm committed to taking whatever time necessary to help ensure people in the beta get an amazing return. </p><p>Also, as part of the beta, you will be receiving <strong>$500 off</strong>.  </p><p>If you want to grab one of the last spots, go purchase the beta course here:</p><p class=\"button-wrapper\" data-attrs=\"{\"url\":\"https://learn.learningwithdata.com/deliver-value-with-machine-learning?coupon=SUBSCRIBER\",\"text\":\"Purchase Beta Course\",\"action\":null,\"class\":null}\"><a class=\"button primary\" href=\"https://learn.learningwithdata.com/deliver-value-with-machine-learning?coupon=SUBSCRIBER\"><span>Purchase Beta Course</span></a></p><p>This page also has some more information for you regarding the course, including a detailed <a href=\"https://docs.google.com/document/d/1amP5ODoINTPshYkwGFNjkiegrgJRaDE-3EvdbIoI1iM/edit\">syllabus</a>.</p><p>If I can answer any other questions for you, please reach out at tyler@learningwithdata.com.</p><p>I&#8217;m incredibly excited to start creating this course and helping data scientists create real value.</p><p>Keep learning,</p><p>Tyler</p>"
}