{
  "title": "The Soldiers of North Korea",
  "link": "https://malicious.life/episode-12/",
  "pubDate": "Wed, 15 Nov 2017 05:01:25 +0000",
  "guid": "https://malicious.life/?p=243",
  "comments": "https://malicious.life/episode-12/#respond",
  "wfw:commentRss": "https://malicious.life/episode-12/feed/",
  "slash:comments": 0,
  "category": "Uncategorized",
  "description": "Guerrilla warfare has been around for as long as conventional warfare has. The idea that a small force, through cunning and brazen action, could overtake a larger force is an old one. From pirates who would take merchant ships by surprise, to lengthy military campaigns against an enemy that is hiding in plain sight. The […]",
  "content:encoded": "<p>Guerrilla warfare has been around for as long as conventional warfare has. The idea that a small force, through cunning and brazen action, could overtake a larger force is an old one. From pirates who would take merchant ships by surprise, to lengthy military campaigns against an enemy that is hiding in plain sight. The cyber-army of North Korea is a guerilla force- it steals, cripples, and destroys the assets of powerful nations and remains in the shadows throughout.</p>\n<p>With special guests- Graham Cluley, Ido Naor, and Sam Curry.</p>\n",
  "enclosure": "",
  "itunes:subtitle": "Guerrilla warfare has been around for as long as conventional warfare has. The idea that a small force, through cunning and brazen action, could overtake a larger force is an old one. From pirates who would take merchant ships by surprise,",
  "itunes:summary": "Guerrilla warfare has been around for as long as conventional warfare has. The idea that a small force, through cunning and brazen action, could overtake a larger force is an old one. From pirates who would take merchant ships by surprise, to lengthy military campaigns against an enemy that is hiding in plain sight. The […]",
  "itunes:author": "Cybereason",
  "itunes:image": "",
  "itunes:explicit": "clean",
  "itunes:duration": "33:34"
}