{
  "title": "562: Answering Burning 'Secrets of Dumbledore' Questions With New Canon",
  "link": "https://audioboom.com/posts/8080546",
  "itunes:episode": 562,
  "itunes:title": "Answering Burning 'Secrets of Dumbledore' Questions With New Canon",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4765,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode, the fearless MuggleCasters take it upon themselves to answer <em>Secrets of Dumbledore's</em> biggest unanswered questions, using their extensive knowledge of the Wizarding World to provide plausible answers and put to bed the movie's most dangling plot threads. Join Andrew, Eric, Laura and Micah on this fun journey through the plot points and listen as they finally discuss whether their own prophecy about the movie came true!<br>\n<br>\n\n</div>\n<ul>\n<li>Main Discussion: Can our knowledge of book canon help us explain the events of <em>Fantastic Beasts 3</em>?</li>\n<li>In what YEAR is the third movie set? Some title cards would have been helpful! Are there clues in the props?</li>\n<li>What became of Nagini? Andrew, Laura and Micah provide a tragic outcome while Eric imagines a spa day.</li>\n<li>Where is Tina Goldstein, really? The \"she's busy\" explanation does not hold any giggle water for us!</li>\n<li>Was Newt ever allowed back to Hogwarts after his expulsion, and did he complete his schooling there?</li>\n<li>What makes Dumbledore \"more than a teacher\" to Newt, in his own words?</li>\n<li>How and under what circumstances did Dumbledore and Eulalie Hicks first meet?</li>\n<li>What is the little drop of \"water\" that Albus blew onto Credence? And is it connected with the Deluminator or an alternate dimension?</li>\n<li>The Predictions of Tycho Dodonus... did they come true, and might they still? How about our predictions of Nostradamus?</li>\n<li>Exactly when did Aberforth find out about Credence and when did they establish their mirror chats?</li>\n<li>Regarding romances, where do Jacob and Queenie honeymoon, and is anything happening with Lally and Theseus?</li>\n<li>The hosts wrap up discussing the most pressing questions that the next movie MUST answer.</li>\n<li>Who Got it Right?! Laura and Micah sweep The Bunties (tm) with Price is Right rules applying, on our various FB3 guesses.</li>\n<li>Next week, a character discussion on Eulalie Hicks! <a href=\"https://mugglecast.com/contact/\">Submit your questions and thoughts</a> on the character!</li>\n<li>Quizzitch: Who was the headmaster of Hogwarts school immediately before Dumbledore?</li>\n<li>This week's episode is brought to you by NordVPN (Go to <a href=\"https://www.NordVPN.com/muggle\">NordVPN.com/muggle</a> and receive a huge discount) and BetterHelp (Get 10% off your first month at <a href=\"https://www.BetterHelp.com/mugglecast\">BetterHelp.com/mugglecast</a>)</li>\n</ul>\n",
  "pubDate": "Tue, 10 May 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-05-09:/posts/8080546",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}