{
  "id": "https://bibleinoneyear.org/en/youth/74",
  "title": "Day 74: You Have the Favour of God",
  "description": "Psalm 34:3–5,8,10, Numbers 3:1,5–7,9–10, Luke 1:41–49.  It means to be the privileged recipient of *God’s favour*, and to be fortunate and happy because of it  The Amplified Bible describes it as being ‘happy, to be envied, and spiritually prosperous – with life-joy and satisfaction in *God’s favour* and salvation, regardless of their outward conditions’ (Matthew 5:3, AMP)",
  "pubDate": "Tue, 15 Mar 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/74/",
  "itunes:duration": "12:47",
  "guid": "enyouth15032022-74",
  "length": 767.76,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 74: You Have the Favour of God",
  "itunes:subtitle": "Psalm 34:3–5,8,10, Numbers 3:1,5–7,9–10, Luke 1:41–49.  It means to be the privileged recipient of *God’s favour*, and to be fortunate and happy because of it  The Amplified Bible describes it as being ‘happy, to be envied, and spiritually prosperous – with life-joy and satisfaction in *God’s favour* and salvation, regardless of their outward conditions’ (Matthew 5:3, AMP)",
  "itunes:summary": "In my first year at university, aged eighteen, I read the entire New Testament in a week – from Matthew to Revelation – and became convinced, ‘it is true’. But I was reluctant to follow Jesus, as I thought my life would be very dull and that I would have to give up all enjoyment. In fact, it was the exact opposite. I found something even better than happiness.\nWe all want to live happy lives. ‘Happiness,’ wrote Aristotle, ‘is the meaning and purpose of life, the whole aim and end of human existence.’ But there is something even better, greater and deeper than happiness. Happiness is dependent on what happens – our circumstances. Joy is far deeper and is not so dependent on our outward circumstances. It is a blessing from God. Joy is the characteristic of an encounter with Jesus even in his mother’s womb (Luke 1:44).\nToday’s New Testament passage uses a Greek word that we translate ‘blessed’. It means to be the privileged recipient of God’s favour, and to be fortunate and happy because of it. The Amplified Bible describes it as being ‘happy, to be envied, and spiritually prosperous – with life-joy and satisfaction in God’s favour and salvation, regardless of their outward conditions’ (Matthew 5:3, AMP).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 439
}