{
  "title": "Episode 269 - Ranking The Olympic Logos",
  "itunes:episode": 269,
  "itunes:title": "Episode 269 - Ranking The Olympic Logos",
  "itunes:episodeType": "full",
  "guid": "1fd614cf-f30d-4855-86f7-3514f35cab07",
  "link": "https://share.transistor.fm/s/5edae3cc",
  "description": "<p>You loved our rankings episode on the Olympic medals so we're back to bring you another great rankings episode as this time we go over the Olympic logos that you have come to enjoy over the years and give our unique perspective on them by putting them in an order we deem fitting of each of them! What will come out on top? What will sink to the bottom? How will your favourite logo fair? And what controversial decisions will be made?  You can find out all of this and more in one fun and epic episode!</p>",
  "content:encoded": "<p>You loved our rankings episode on the Olympic medals so we're back to bring you another great rankings episode as this time we go over the Olympic logos that you have come to enjoy over the years and give our unique perspective on them by putting them in an order we deem fitting of each of them! What will come out on top? What will sink to the bottom? How will your favourite logo fair? And what controversial decisions will be made?  You can find out all of this and more in one fun and epic episode!</p>",
  "pubDate": "Fri, 07 Oct 2022 09:00:00 +1100",
  "author": "Ben Waterworth, Colin Hilding & Jarrod Loobeek",
  "enclosure": "",
  "itunes:author": "Ben Waterworth, Colin Hilding & Jarrod Loobeek",
  "itunes:image": "",
  "itunes:duration": 6392,
  "itunes:summary": "You loved our rankings episode on the Olympic medals so we're back to bring you another great rankings episode as this time we go over the Olympic logos that you have come to enjoy over the years and give our unique perspective on them by putting them in an order we deem fitting of each of them! What will come out on top? What will sink to the bottom? How will your favourite logo fair? And what controversial decisions will be made?  You can find out all of this and more in one fun and epic episode!",
  "itunes:subtitle": "You loved our rankings episode on the Olympic medals so we're back to bring you another great rankings episode as this time we go over the Olympic logos that you have come to enjoy over the years and give our unique perspective on them by putting them in",
  "itunes:keywords": "olympics, off the podium, comedy, funny, interview, colin hilding, jarrod loobeek, ben waterworth, olympic games, sport, australia, canada",
  "itunes:explicit": "No"
}