{
  "guid": "a00018a1-ab7b-448f-aa98-4dd3d43bc184",
  "title": "Blair Enns - Pricing Creativity",
  "description": "<p>Guest Blair Enns gives us a look behind the scenes of creating his new book Pricing Creativity.</p>\n<h2>Blair's Bio</h2>\n<p>Blair Enns is a 25-year veteran of the business side of the creative professions. In 2002, he launched Win Without Pitching, which has worked with thousands of creative professionals in numerous countries through direct engagements, seminars, workshops & webcasts. Blair is the author of \"The Win Without Pitching Manifesto\" and the forthcoming \"Pricing Creativity: A Guide to Profit Beyond the Billable Hour\"</p>\n<h2>Links</h2>\n<ul>\n<li><a href=\"http://pricingcreativity.com\">Pricing Creativity</a></li>\n<li><a href=\"https://www.winwithoutpitching.com/\">Win Without Pitching</a></li>\n<li><a href=\"https://2bobs.com/\">2Bobs Podcast</a></li>\n<li><a href=\"https://twitter.com/blairenns\">Blair on Twitter</a></li>\n<li><a href=\"https://www.linkedin.com/in/blairenns/\">Blair on LinkedIn</a></li>\n<li><a href=\"https://www.amazon.com/Implementing-Value-Pricing-Business-Professional/dp/0470584610\">Implementing Value Pricing: A Radical Business Model for Professional Firms</a></li>\n<li><a href=\"https://www.amazon.com/Curtis-Creek-Manifesto-Illustrated-Paraphernalia/dp/0936608064\">The Curtis Creek Manifesto</a></li>\n</ul>\n<h2>Transcript</h2>\n<h3>Jonathan:</h3>\n<p>Hello and welcome to The Business of Authority. I'm Jonathan Stark.</p>\n<h3>Rochelle:</h3>\n<p>And I'm Rochelle Moulton.</p>\n<h3>Jonathan:</h3>\n<p>And today, we're very excited to be joined by guest Blair Enns. Blair is the founder and CEO of Win Without Pitching and the author of the Win Without Pitching Manifesto, and the forthcoming Pricing Creativity: Guide To Profit Beyond the Billable Hour. Did I get that right Blair?</p>\n<h3>Blair:</h3>\n<p>You got it right Jonathan thank you.</p>\n<h3>Jonathan:</h3>\n<p>Stressful :-) I am very excited and I [00:00:30] know Rochelle's very excited to have you on the show. We have just a lot in common, I've been following your work for years, we've read a lot of the same authors and we're super excited to talk about how you've taken this big idea, which to me started with the Manifesto, perhaps it had its roots before that, and turned it into a consulting business and then later a training business, and now hopefully, fingers crossed, a bestselling author.</p>\n<p>So, could we start off by just [00:01:00] giving folks a little bit of background about who you are and what you do now and then we can sort of delve into the history?</p>\n<h3>Blair:</h3>\n<p>Yeah, sure. And thank you to both of you for having me on the podcast. I'm really looking forward to this and happy to be here. My name is Blair Ends, the company is Win Without Pitching and I founded it back in 2002, early 2002. At the time, it was a consulting practice, a new business development, sales or new business development consulting to creative [00:01:30] firms, typically independent creative firms, and I had come out of about a dozen years of working in advertising agencies and design firms and thought I'd launch this consulting practice.</p>\n<p>So that was the first iteration of Win Without Pitching. And then over the years, beginning in late 2012, and I'm sure we'll get into this, I decided to shift the structure of the company from a solo consulting practice to a training company. So that's where we are now in late 2017, [00:02:00] early 2018. Win Without Pitching is about five years into its current incarnation as a training company. And for a few years; 2013, 14, it was both as I kind of played with training and had to make a decision about going one way or the other.</p>\n<p>So we've been a pure training company for about three years. It really feels like this business is about three years old, but really it's more like 16.</p>\n<h3>Jonathan:</h3>\n<p>Wow. And [00:02:30] before that, you were from the agency world, you were inside the agency world, yes?</p>\n<h3>Blair:</h3>\n<p>Yeah, I worked for some of the world's largest advertising agencies and some of its smallest design firms. I was a suit, I don't own a suit anymore. Although my latest social media profile pic has me in a suit. I had a borrow a tie from my 18 year old son for that photo and I own one jacket. But I was a suit for many years and then I moved to this little mountain [00:03:00] village in the middle of nowhere where we live now when I started the consulting practice. So there's this kind of shift in the personal life that was the impetus for the business change.</p>\n<p>And I had a Hugo Boss bonfire when I moved out here, got rid of all the suits. But I was a suit doing account services and new business at a very young age in the first ad agency I ever worked. When at I was 22, I was handed responsibility for new business. I wasn't great at it but I did have some natural skills at [00:03:30] it. So yeah, I came out of the account management and new business side of both advertising and design.</p>\n<h3>Jonathan:</h3>\n<p>Okay. So, how do you go from there to writing the Manifesto?</p>\n<h3>Blair:</h3>\n<p>Well, the Manifesto I wrote I think in late 2005, early 2006 so I had been running the consulting business for three or four years at that time. And the name, I think the of the business is kind of a fluke and I've been [00:04:00] told by some of my closest professional friends that, \"Yeah, Win Without Pitching is a stupid name, you need to change the name.\" On some level, I think it is maybe not an appropriate, maybe not the appropriate ... There's something about the name that can sound a little bit schlocky maybe, like some sort of false promise, but on the other hand, that name has driven me to ...</p>\n<p>It's really a great label for how I've always thought about new business, [00:04:30] and it's forced me to come at the subject matter from that perspective that is really true to me. And I think that's really been the difference, whether it's been a consulting practice or a training company or a book that I've written, i's always coming from that win without pitching perspective. So the name came first, the business came first.</p>\n<p>And then in, I think it was, yeah, it was late 2005, I think early 2006, where I [00:05:00] was writing a piece. I've published an article, a blog post for years, for 16 years, either somewhere between weekly and monthly. And at the time, I think I was publishing closer to monthly. And I wanted something for the end of the year. So I tried on, I had this idea of like just wrapping up all of my philosophy into a few short pithy statements. And I was also trying on tone of voice. I'm a huge fan of Manifestos, [00:05:30] and I kind of collect them and I've read most of the big ones. I think the biggest, most important book ever written and religious people will be horrified at this, I think the most important book ever written might be the Curtis Creek Manifesto.</p>\n<p>And I won't say anything more about that, people can go look at it and think, \"Huh? What are you talking abut?\" Order it, give it to every 12 year old you know and you'll change the world. I was writing a blog post and it was trying on [00:06:00] a new voice, I was trying on a Manifesto voice. And at the time, and even for a few years after, it was the riskiest thing I'd ever written, just because the tone was so different. And I thought it was going to be taken as too over the top. Like it's almost the biblical [inaudible 00:06:14] We shall, etc.</p>\n<p>It's 12 proclamations, it's not chapters I imagine Martin Luther nailing something like this to the church door. So I was quite nervous when I hit publish. And then the response was really gratifying and inspiring, [00:06:30] because people were telling me that they had ... some designers that actually typeset it and put it on a poster and actually put it on their wall. And I kept getting feedback like that for a long time. So when it came time to write a book, and if you want to be seen as the expert in your space, then you probably should write a book. And I was feeling the pressure to write a book.</p>\n<p>But it didn't have a format, it didn't have kind of a narrative structure or I didn't [00:07:00] know ... Otherwise, it would just been a book of lists. And then I thought based on the success of that post, maybe I'm going to frame a book based on this. And I'm so glad I did. I'm really happy with this book, seven and a half years later. I'm surprised to say that I'm still really happy with this book.</p>\n<h3>Jonathan:</h3>\n<p>That's great. To have a shelf life it's that long, there's no reason it couldn't continue to grow. Nothing in it is really dated, it's completely ...</p>\n<h3>Rochelle:</h3>\n<p>[00:07:30] It's evergreen.</p>\n<h3>Blair:</h3>\n<p>Yeah. I set out to write a timeless book. And my intention for the book was I would create something that would outlive me. And so, there is nothing in it, as both of you point out, it's kind of evergreen content, there's nothing in there that will be dated. There's nothing about the design, the design looks like it was like dug up from a lock box and it could be from any time. In fact, one of the first things I did with this book, once I decided on the fact that it would be a Manifesto, is I [00:08:00] had to decide what size would it be. So I took a bunch of different books that I owned and ... I just had a sense of how the size of the book, so I took something that was the right thickness, but it was too large a format, and I cut it down. And I said, \"I want the book to be this size.\" And this isn't the way books ...</p>\n<p>So I wrote to the size because I wanted a designer, somebody who maybe doesn't do a lot of in-depth reading, I wanted them to be able to read it on a typical plane ride; like on a two hour plane ride. I wanted [00:08:30] it to fit into a purse, into a laptop bag, on a toilet tank. And then so once I got the physical, I had the structure, this 12 proclamations Manifesto structure. And then I had the size, and then I hired a designer who when he's not doing his day job, he designs typefaces for Bibles.</p>\n<h3>Jonathan:</h3>\n<p>Nice.</p>\n<h3>Blair:</h3>\n<p>Yeah. I thought, \"Well, for a creative audience, it either has to be really well designed or it has [00:09:00] to just be all about the words,\" and I wanted it to be all about the words. And I wanted it to be somebody who is fanatic fanatical about type. So I hired Brian Soy. His firm is called Aspire and it's not book design isn't their day job, but they do. In fact, they're just finishing up my next book, Pricing Creativity. But he's a nut about type. And I remember he came to a seminar I did in Miami Beach years ago, I remember walking down the main drag, is Ocean Drive, I forget, in Miami [00:09:30] Beach.</p>\n<p>And him just like pointing out all the art deco fonts and thinking ... in all of the hotels and buildings that we were going past. So the rest of us are in this conversation about something else and he's just going crazy over typefaces.</p>\n<h3>Jonathan:</h3>\n<p>Yeah. It's awesome down there for that. And it was a big success. It's how I heard about you. In fact, I know who told me about you, no, I take it back. So this is weird and this is, I think, perhaps [00:10:00] a source of some like infusion earlier, which is that I came across this as a blog post first. A friend of mine was, \"Blair Enns, Blair Enns, Blair Enns.\" And he sent me a link to one of the, I don't remember which one it was, but it was one of the proclamations. And I was like, \"Yes, yes, this is good. This guy knows what he's talking about.\"</p>\n<p>I didn't even realize for a long time that it was bound in any form. I was like, \"Oh, this is just this free online thing,\" which I believe is still true. I believe people can still read [00:10:30] it online.</p>\n<h3>Blair:</h3>\n<p>You can read the entire book for free at WinWithoutPitching.com.</p>\n<h3>Jonathan:</h3>\n<p>Well, now I want the physical one. I want to feel it, put it on my toilet tank.</p>\n<h3>Blair:</h3>\n<p>Where it Belongs. Yes.</p>\n<h3>Jonathan:</h3>\n<p>So, you launched the book, and people are printing it out on their walls, I would count that as a big success. And I've seen a number of videos of you sort of giving [00:11:00] presentations, which I know came after that time because you reference the Manifesto in the talks. What was that, period? Do you do that anymore? Sounds like you're in a remote area now, so you probably don't.</p>\n<h3>Blair:</h3>\n<p>Yeah. No I do a lot of speaking. In fact, when my next book comes out on January 10th, I've set aside all of 2018 to just travel the world and speak in support of that book. And I didn't have, now that I'm the CEO of a training company and I don't coach or train in our program [00:11:30] anymore. I create curriculum, I work with my team, I take us into the future, I'm in charge of future value creation. I speak and I write. When I was a consultant, I wrote the book and it got me lots of invitations to speak already did pretty good on the speaking front. But it got me a lot of invitations to speak so I did a lot of lectures on the Manifesto around the world.</p>\n<p>But I was still running a consulting business. And if I'm not consulting then I'm not [00:12:00] sending invoices, and I'm not earning money. I've been fortunate in that I've always been paid well to speak. And what I get paid has increased over the years. I could probably earn a decent living just speaking if I wanted to. But the real money was in consulting. Now we're a training company and I'm not encumbered with that day to day training or operations of the business, I'm free to basically just go and speak, so that's that's a big part of it. And anybody who writes a book, what follows behind [00:12:30] that are a lot of speeches and nowadays a lot of podcasts interviews like this.</p>\n<h3>Jonathan:</h3>\n<p>I imagine it was tough. Well, was it a tough decision to switch from consulting to training or was it, you said you had sort of a shift in where you were living and the bonfire and whatnot. Were you excited to do that or was it scary, was it obvious?</p>\n<h3>Blair:</h3>\n<p>That was the scariest. I look the scariest things that you ever do, at some point soon after you look back on them and think, \"Well, that was ... Why was [00:13:00] I so afraid by that?\" But picking up our young family and moving to this little village in the middle of nowhere not, not really knowing how we were going to earn a living, that's how Win Without Pitching came to be, it was a necessity. I knew I wanted to kind of get out of the rat race of the city and the advertising profession at the time.</p>\n<p>Before I left, I was in a horrible job with a difficult boss, I'll say it politely, [00:13:30] and I was ruined for the advertising profession. And then, I was fired from that job, like I engineered my own dismissal, and that's another long story. I thought I would ... And I saw it all building towards a lawsuit. But as I was being relieved of my duties and handed my severance check, I thought, \"I'm not going to sue you. I'm never going to see you again.\" After that I went to work for a really great boss and I was asked to build a satellite office. It had existed [00:14:00] but all the clients had left, to build the satellite office for another creative firm.</p>\n<p>And that was a great experience that that allowed me to fall in love with the profession again. But I had already decided we were moving to this village in the middle of nowhere, so I told the guy I was working for that I would do it for a year, a year turned into 20 months then I said I had to go. So we moved to this little village in the middle of nowhere and we had a bunch of little kids, we have four children. We had three at the time and the youngest was 6 months old. We had a fourth [00:14:30] a couple of years after moving here.</p>\n<p>So we were raising a young family and in the early days, Win Without Pitching, it was a lifestyle business. In the summers, it's a beautiful little village we live in on the shore of a 92 mile long lake, home to the largest strain of rainbow trout in the world. It's idyllic, it's as you imagine it. For years, I shared an office with a grizzly bear biologist and a bat biologist. So we really are in this beautiful little mountain village in the mile [00:15:00] of nowhere and it really was a lifestyle business in the early days. And then around 2012, my kids were at a certain age, they no longer really needed dad to be around a lot more and I was working more and more as a consultant.</p>\n<p>And in November of 2012, I found myself flat on my back with pneumonia in bed for two weeks and it was the fourth time that year that I had gotten some sort of sickness, just run down somewhere. And on three continents. So four times on three continents in one year, I just kind of run myself down as [00:15:30] I was trying to maximize this consulting model. And I had an epiphany while I was kind of recovering, I realized that my business model was trying to kill me, so I'd better kill it first. And that's what I decided to make the shift to. I decided to launch a training program.</p>\n<p>I recovered and I put together a 13 week training program, sent it out to my market, immediately sold it out. Then did another one, sold that out, did another one sold [00:16:00] that out. So that took me through to 2013. And then for 2014, I strung three programs together into an annual commitment, sold that out. And then I think by 2015 I decided that I couldn't do both. Now, I didn't come to the conclusion that a training business is better than a consulting business. Part of my journey was, I discovered value-based pricing and I realized that the way I was pricing my consulting engagements [00:16:30] and running my consulting engagements was contributing to kind of the stress on my health.</p>\n<p>I had productized my consulting services. You could do a two day session with me, which would cost X or could be like one day plus a bunch of remote consulting work. I'd package created three or four different packages and I'd put these prices on those packages. And everything I just described violates some of like my new rules of pricing. And I realized as I learned more [00:17:00] about value based pricing, I thought, \"Okay. I either need to become a properly value based pricing consultant.\" By that I mean, I would look at every consulting engagement as a completely blank slate and dive deep into what it is that the client really wanted and how much value I could create, and then craft a really unique engagement that was specific to the client and the value in their situation and the value they were trying to create.</p>\n<p>So that every engagement would truly [00:17:30] be different and would be priced differently. If I wanted to earn the most money from those engagements, I felt like I needed to be able to say to my clients, \"You know what, I'll get on a plane and I'll see the day after tomorrow.\" Because of where I live, it takes me a day to get anywhere. It sometimes takes me a day to get to an airport. I just couldn't do that. So I felt like if I couldn't properly value price my consulting engagements, then I really needed to go the other way and fully productize [00:18:00] my business. So that's the decision I made.</p>\n<p>I made the decision to go to a more scalable, productized service business and productized consulting business is a training company. So that's where we are today and it was really driven by the fact that I had kind of maxed out the consulting model the way I was doing it and I was a little bit limited by where I lived. And I felt strongly that I needed to go one way or the other and the easiest way for me to go [00:18:30] would be to go to scale up training company. I was talking to somebody in Austin, Texas about this the other day, somebody who is a consultant, and he was kind of trying on the idea that, well, maybe the evolution of all consulting practices is training companies.</p>\n<p>And I said, \"Man, if I lived in Austin, Texas, I would be a consultant. I would not own a training company. If I had ready access to lots of different creative firms, where I could go in deep and help them more, I'm pretty sure in the short term, in the first five to six years for sure, [00:19:00] I would make way more money and have a bigger impact on a smaller number of clients.\" But I don't live in Austin, Texas. I live in Kaslo, British Columbia and it makes sense to build a training company.</p>\n<h3>Jonathan:</h3>\n<p>It sounds like, I don't know if this is just because of the compression of time, that we're compressing the timeline, but it sounds like there was a fairly high degree of certainty there based on a series of decisions that you made, particularly about moving, but it seemed like you were pretty clear on what to do, even though there was some fear.</p>\n<h3>Blair:</h3>\n<p>[00:19:30] Yeah I think so. I was doing a live podcast with my podcast cohost. I do a podcast called 2 Bobs. The number 2 Bobs with my friend and colleague David C. Baker, and we doing it live in London two weeks ago and in the Q&A afterwards, we were talking about how different we are from each other. He's very scientific in his approach and he said to me, he said, \"You're not afraid of anything.\" And I thought, \"Well, that's not true.\" But I get these ideas and I just will not be stopped.</p>\n<p>And I [00:20:00] think I've learned to lean into the fear. And if you know anything as you do about my selling approach, if there's anything uncomfortable in the sale, we teach well, lean into it, go into the dark places, embrace the awkward silence, say the things that the client won't say, the things that most people in that situation would not bring up. It's your job to bring it up. So I think I've learned that when you get these crazy ideas, lean [00:20:30] into them. As an example, I was a couple of years into both offering a training program and I was still consulting. And I was on a plane I was flying to Dallas and I, for whatever reason I decided, \"This is my last. I need to pick one one or the other.\"</p>\n<p>I knew it was going to be training and I knew at some point it had to no longer consult. So I decided on the plane, \"This is my last client.\" I walked into my client's office the next morning and one of the first things I said is, \"I want [00:21:00] you to know this is my last client.\" And then I went on the plane on the way home I wrote a lengthy blog post called, I think it's called I'm Out. And I said to the world and nobody reads my blog because they want to know what I'm up to, they read it for the guidance. But every once in a while ...</p>\n<p>So I just published it for me. I wanted to make a proclamation to the world that that's it, I'm out of the consulting business. I'm not doing this anymore. Because I knew if I didn't say [00:21:30] it publicly, then I would probably start doing consulting again. So that's kind of the way I tend to operate, I come up with this idea and then I make this public declaration about what I'm going to do and then I think, \"Oh crap, well, I guess I have to do it.\"</p>\n<h3>Jonathan:</h3>\n<p>Absolutely. You mentioned a couple of times Pricing Creativity, the new book. I have that thing highlighted to death. And I'm very much looking forward to talking to you about the pricing [00:22:00] details or the tools and the techniques that you talked about in there on my pricing podcast; Ditching Hourly. What appears about, in this context is what was your whole thought process about why to do this book, what your plans are for it, is this for you a 150, 200 page business card or is this something you actually want to see on bestseller lists as like an income stream. What are you thinking about there?</p>\n<h3>Blair:</h3>\n<p>Yeah. That's [00:22:30] a great question and I've found myself into some really great conversations about this. The Manifesto is the oversized business card. I refer to it as the Yes You Can book. I want people to read it, put it down. And as an early reader said in a review or somewhere online, he said, \"I finished that book and it just makes me want to go wrestle a bear.\" So I use that line a lot. I want you to go feel like you can go wrestle a bear after that book. There's not a lot of how to end it. It meets a Manifesto, it's not meant to be a how to.</p>\n<p>[00:23:00] And the pricing book is a 50 ... so the Manifesto is just under 24,000 words, the pricing book is a 57,000 word manual. I wrote it as a manual, it's published as a three ring binder. There are different formats, you can get the ebook, you can get the ebook in the binder, you can get the ebook binder and four hours of video support. But I really wrote it to be like a desk reference, where you would read it once through, I hope it's enjoyable enough, that you can read [00:23:30] most of it through. And then, after that, when it comes time to put together your next proposal, price out your next proposal.</p>\n<p>I want people to reach out onto the shelf, pull it out, remind themselves of some of the rules and some of the tips, and then flip to the tool section at the back, and use those tools to actually craft their proposal. My vision is, this book will be on the desk or shelf of every creative professional in the world, who is charged with setting or negotiating [00:24:00] price. That is my vision. And I could have published it through a few different mainstream publishers. The Manifesto has generated a lot of interest for me from mainstream publishers, I could have published it that way. But it occurred to me, I'm looking at a bookshelf filled with about 25 books on pricing, and then probably another 25 on economics, most of them behavioral economics.</p>\n<p>I own all the books on pricing, and some of them have been so [00:24:30] transformative. Ron Baker has been such an positive influence on me on pricing. And the impact he's had on the professional world through his two books on pricing has been phenomenal. But I look at Ron's books and I think, \"He should have made millions of dollars with these books.\" I know he's built a really lucrative career as a speaker, and I don't know if he does consulting or not, but as an author and a speaker, he has built a really good career. So it's not like he's not well rewarded, but I kind of value [00:25:00] conversation with the Global Creative Community without them knowing it, about the impact and value of this book.</p>\n<p>And I did some quick math and I thought, \"I think I can sell between six and 10,000 copies of this book, which is a really big number given the audience and given what I'm charging for it. But I think over seven or eight years I kind of see ... Because I think it'll be bought in bulk and multiple copies from larger firms. I can see it [00:25:30] affecting the bottom line of 2,000 firms, I did the math. Okay, 2,000 firms, let's say, an average size of a million dollars, that's two billion dollars in revenue. I think and I know from anecdotal experience, that this is conservative.</p>\n<p>I think that the average firm that reads and implements this, can add at least 5% to their bottom line. If you're a million dollar firm, I fully expect that there's no reason why you can't add an extra $50,000 [00:26:00] in profit. And I've talked to Creative Principles to whom I have given pricing advice through our program, and where we just touch on it tangentially in our training program. The profit increase stories just from some of these pricing principles, are just, tenfold increase in profit, I've heard that a lot, doubled profit, tripled profit. I think adding a 5% increase that essentially represents [00:26:30] a 50% increase in most firms. Anyway, that adds up to like 100 million dollars per year, in additional profit for 2,000 smallish creative firms.</p>\n<p>If I were working as a consultant and these 2,000 firms were just one business, and I said to that business owner, \"Listen, I'm pretty confident that I can add $100 million a year to your bottom line.\" What do you think fair compensation for me as a consultant [00:27:00] would be? The answer would be in the millions of dollars, right?</p>\n<h3>Jonathan:</h3>\n<p>Absolutely.</p>\n<h3>Blair:</h3>\n<p>But there's something about the package that is a book that says, \"Well, it doesn't matter if you add hundreds of millions of dollars to the bottom line, if you sell it the traditional way, books should cost between 20 and $40, then you're only going to make so much money.\" Well, that's ridiculous. So, this book is not sold, it's not available on Amazon, it's only available on our website, Winwithoutpitching.com, go to Pricingcreativity.com, and you'll be redirected. [00:27:30] And it's the first pricing book in the world that is priced based on the principles in the book.</p>\n<p>When there are three different options, I'm not going to give away too much here, but it starts at $320 a copy. And then there's a $199 version. There's a $100 version. Each of those is fully guaranteed, if you buy at any level. And if it doesn't work for you for whatever reason, sent it back to us, we'll send your money back, no questions asked. So, it's fully guaranteed. [00:28:00] And I want people after they buy the book, I want them to go back to the pricing page on our website. And I want them to see after they read the book. I want them to see, how many of the pricing principles in the book that I've talked about that we actually used in the pricing of this book.</p>\n<p>I expect, based on the math that I laid out to you, I expect to earn a million dollars in this book. And I think that's fair for me as an author. If I were a consultant, I would view it as an [00:28:30] unfair price.</p>\n<h3>Jonathan:</h3>\n<p>Too low.</p>\n<h3>Rochelle:</h3>\n<p>So the million dollars, you see that coming directly from the book not from doing speeches around the book, not from doing training around the book, totally from the book?</p>\n<h3>Blair:</h3>\n<p>Yeah.</p>\n<h3>Rochelle:</h3>\n<p>That's incredible.</p>\n<h3>Blair:</h3>\n<p>And I had an author say to me when I was in London, he said, \"You know, you don't write a book for the money.\" Well, sometimes you do.</p>\n<h3>Jonathan:</h3>\n<p>I think sometimes you do, I agree. I've written five or six books now depending on how you count it. And I've done through traditional publishers and [00:29:00] self published. And it's different. I think it's important to decide which way you're going to go before you write it. \"What's this book for? Is this a business card? Am I staking out a claim to a particular aspect of authority in the world? Or is this a revenue move?\" And I think there can be some overlap. There's certainly overlap in the results, but I think knowing which one you're shooting for before you start the project is pretty important.</p>\n<h3>Blair:</h3>\n<p>I [00:29:30] agree and I think probably too many business authors don't actually spend enough time thinking about what the goal of the book is, and therefore what the right way to publish it is or to market it. Like the purpose of this book is value creation, to create value for others, that's the purpose of it. I'm very happy with The Win Without Pitching manifest. I'm happy with the impact it has had on the global creative profession. And I can extrapolate into the future and imagine the impact that it will have with [00:30:00] the long term, and I'm very proud of that. And I have the same expectations, but in different avenue, same expectations for Pricing Creativity book. I really expect this to be the standard in the global creative firm community for many years.</p>\n<p>I don't think it's going to be timeless, as timeless as the Manifesto, but I expect it to be the standard, to be on people's shelves, and more than the Manifesto, which gets people inspired and gets them believing that there [00:30:30] is another way. This is really the here's how to take those principles and the Manifesto and turn them into real income, real profit for you and your firm. So, yeah, the oversized business card is out there, this is the thing meant to follow up on that, to drive more value creation and obviously, create value for me the author.</p>\n<h3>Jonathan:</h3>\n<p>I totally agree with that. I think the Manifesto was a rallying cry and Pricing Creativity is more of a [00:31:00] playbook, or it's funny that you chose the physical format that you did, because it does remind me of old time software manuals or cookbooks, or it earn and I think it also breaks the way you pointed out earlier as a sort of preconceived notion of how much a book costs. And it's like \"Well, this one's a little different.\" You don't even have to believe the value proposition of the book necessarily, you just look at it and you're like, \"Okay, this is different. This is not your regular business book.\"</p>\n<h3>Blair:</h3>\n<p>If you think of [00:31:30] the training that we sell, so we sell a term of training for anywhere between 2,000 and $15,000, depending on how it's delivered, but the content is essentially the same. And when I started writing this book, for the longest time I thought there was going to be a training program version of it. If you buy the ebook, the manual, which has the added tool section in it, and an advance review copy that you've read Jonathan, doesn't have that tool section in it, but the manual [00:32:00] has it. And then four hours of supporting video around it, you're essentially buying training, so it looks like an expensive book, but it's actually cheap training.</p>\n<p>And so, we've decided we're not at least for the next year or so, we're not building training around them, around pricing. Our training continues to be around selling, selling The Win Without Pitching Way. We also have some stuff on positioning and regeneration, but we're really a sales training organization. So, this is really deeply discounted training on pricing. [00:32:30] If you look at it that way, it's cheap. If you look at it as a book, and some people will look at it as a book and be outraged at the price, it's expensive.</p>\n<h3>Rochelle:</h3>\n<p>But it's this wonderful integration of the idea of a book in an online course. A lot of people are complaining about online courses now, because you're not getting enough deep content. And I like how you put both of them together here.</p>\n<h3>Blair:</h3>\n<p>Thank you. Even our training program we go out of the way to say it's not an online course. This is [00:33:00] coach led training in classrooms, our coaches have more than 10 years of experience of selling The Win Without Pitching Way, because they were clients of mine more than 10 years ago and have 10 years ... So, and I have nothing against online courses, they are just a lot of them out there, and if you put something into the package of an online course, the price drops. It's like an online courses now, it's now encumbered by the same kind of the limitations of the package as a book is, if you buy [00:33:30] a book on Amazon. So, we're trying to break that paradigm too.</p>\n<h3>Jonathan:</h3>\n<p>It's fascinating, I could talk about pricing all day of course. I think you mentioned the 25 pricing books on your bookshelf, I think I have the same because ... In Pricing Creativity, the first section, I'm not sure, I think you had a different name for it, but the first sort of region of the book is, for people who are maybe considering buying it, it is like a crash course [00:34:00] in the best books on pricing that are out there. And you sort of skim across the service and pull up things that are important to this specific kind of reader, which I think is critical because I can't think of any of the pricing books, even implementing value pricing.</p>\n<p>None of them really speak down to a tactical level to a particular kind of profession. I find when teaching people some of these, let's be honest, these are pretty abstract concepts, [00:34:30] very, very intangible and tough to believe. There are like an optical illusions almost. And when people are new to these ideas, they need someone, the first couple of times at least, they need someone to be like, \"No, no, go like this.\" And that, go like this, whatever it is, is different from vertical to vertical or it can be. This is why, I think for the right kind of reader, someone running an ad agency for example, or creative or design [00:35:00] agency, it's very, very actionable, which I think is going to earn a place on the desk of ... Like you said, I wouldn't be surprised if this was on the desk of every creative owner across the world.</p>\n<h3>Blair:</h3>\n<p>Certainly, we're not going to hit everyone, but that is my intent. And again, I'm traveling in support of that and I appreciate your point of view on the book, because you've identified what I've really tried to do in that first section, which [00:35:30] is called Principles. I really I'm trying to bubble up like the best of pricing theory from most of the books. And a lot of the best pricing books are heavy in theory and a little bit difficult on the application.</p>\n<p>Ron Baker's Implementing Value Pricing, I'm much a fan of his. Not only the knowledge, I've never met Ron, but we've corresponded. He just absorbs, his capacity to absorb and synthesize information is awesome, [00:36:00] and he's also an excellent writer. I would read anything that he's written, but when I read Implementing Value Pricing, which is his second book after Pricing On Purpose or Pricing and Purpose is the theory, Implementing Value Pricing basically builds on that. You can just read his second book and skip the first one, because he does kind of a recap of all the principles. And he gets into some great stuff, even some level of detail on implementation that I don't.</p>\n<p>But it is as I read those, a friend of mine said and I talk about this in the book, he [00:36:30] said, \"You should write a book on pricing.\" and I said, \"Oh man, there are some great books on pricing, the world doesn't need another one.\" He said, \"Well, your clients aren't going to read those books.\" He's right. The owners of the typical creative firms, especially people who see themselves as creative first, and kind of price or sales people, business people second, they're not going to read those books. I needed to deliver the principles in a very interesting way, not go too deep into it, and then get right to [00:37:00] do this.</p>\n<p>So, the next section is, rules, six different rules, six things you always do when you're pricing. And then the section after that is the lengthier section, it's the tips and that's meant to be specific situation, specific guidance for a specific situation. Crafting your high priced options, crafting your low price options, making the margin in the middle. Dealing with retainers, final negotiations with procurement etc, etc. I imagine people read the first two sections and then when it comes time to craft their proposal, they'll go to the back, [00:37:30] the tools section has a quick review of the rules, and then they'll flip to the section in the tools, to get the specific nugget for the thing that they're building for that one client.</p>\n<p>So, yeah, that's how I've tried to write the book, and also I come from the world of sales. The reason, I talk about this in the book, the reason value based pricing fails in most creative firms, in fact most professional firms, it breaks down at the value conversation. And that's where the theory [00:38:00] of pricing meets the actual reality of selling. I know from my own experience, you cannot become an effective pricer, if you do not at the same time work on your skills as a salesperson. The third one would be negotiating, so selling, pricing and negotiating, it's really hard to be good at pricing if you do not also tackle selling and negotiating. And that's one of the perspectives [00:38:30] that I tried to bring to the book.</p>\n<h3>Jonathan:</h3>\n<p>Definitely, definitely it comes through. So, we're going to hug it out here. I think it's a great book, I think people who are in this space, it's going to be worth every penny. We're running a little long on time, so what I'd like to do is, ask you what might be kind of a hard question, I know this is really big on your radar right now, but I'm wondering, what do you see beyond this? And the reason I ask is [00:39:00] because you have an amazing post, I think it's called No Exit or No Exit is in the title about, never retiring. And how that changes your focus about the business and all of that. So, I'm wondering have you had that sort of head space to even think beyond this at all, Does this still fit into that public declaration?</p>\n<h3>Blair:</h3>\n<p>Yeah. So the post is called A Mission With No Exit, and that's when I realized from a couple of different sources that, and just seeing in my own clients [00:39:30] what the pattern that I saw is, when you get to a certain age like 55-ish, in some principles, maybe a little earlier, maybe a little bit later, but certainly, by the time somebody is nearing 60, they quit making brave decisions in their business. And it's because they have one eye on the exit, and I realized there are few things that damage a business more than the principle of starting to kind of slowly extricate herself from the business. And I just saw this pattern over and over again, and then this is an [00:40:00] idea I first heard from Dan Sullivan, the founder of Strategic Coach, a coaching organization. I have been in for my own professional development and will be in again, I'm not currently in it right now.</p>\n<p>But early on in their program, they just disabuse you of this idea, that you're ever going to retire, and the rallying cry is effectively die with your boots on. So, I bought into that early on, and also the idea that you'd never sell. Like you come from the software space, and where in the design world, the design world [00:40:30] is changing so fast these days, because the worlds of design, business consulting and software engineering are all coming together. And look, we don't even have agreed on what the names for this is right, now but it's a really exciting time. But one of the things that's going on, is the design is taking a lot of its cues from tech these days, and in Silicon Valley and the tech world, you see a lot of like spinning up and exiting businesses. I'</p>\n<p>not going to try to make a moral judgment on that other than to say, [00:41:00] that does not appeal to me. But I think that I see some owners of design businesses think that the proper thing to do is like, build this business, spin it up and exit it. And a lot of sales people like to open a sales conversation with the principle of the business that they're trying to sell to, with the question, what's your exit. I think it's such an insulting question, the implication that you should have an exit. Because I think if I could take away from our listeners, those who own businesses. [00:41:30] If I could take away from you, your right to retire and your right to sell your business, I guarantee you the implications are, that you would start doing today all of the things that you've been putting off. Including things in your personal life, you would arrive at a work life balance now.</p>\n<p>You would start taking vacations now, you would make the difficult decisions around positioning your firm, about the clients that you work with, about the people that you work with, about having a strong number two in place so that you can free yourself up to do [00:42:00] the more meaningful things, both in the business and in the life. You would structure your day to day so that you're doing things that you love and you're energized by, rather than kind of wading through these undesirable things, with this crazy idea that there's some sort of payoff for all your sacrifice, that all your sacrifice now will lead to a payoff in the future.</p>\n<p>That's a dangerous idea, and I would just love to disabuse everybody of that notion. So, I talk about that in the post A Mission With No Exit. I do this talk around it's called the [00:42:30] Five Constraints. That's the first constraint, I'd say, if I could impose this on you I would. So in terms of my business, I've got visibility into years of my business, and my plan is, I have no plans to retire, I have no plans to sell, I plan to die with my boots on. I do recognize I'm 51, I do recognize that once you're 70, I don't know where the age is, where the line is, but at some point, people, the way, the advice that they're likely to [00:43:00] take from you is different.</p>\n<p>Your role needs to change as you age, I know that. But I have lots after this, so much is after this. I'm so excited about what's after launching and pushing Pricing Creativity out into the world. I could live three lives and I would never be finished with the things that I want to do in this business.</p>\n<h3>Rochelle:</h3>\n<p>Hear, hear.</p>\n<h3>Jonathan:</h3>\n<p>Amen. Well, that's a fabulous place to wrap up, I think. Where can people, where's [00:43:30] the best place for people to find out more about you online, Blair?</p>\n<h3>Blair:</h3>\n<p>I'm at Winwithoutpitching.com, if you go to Priceandcreativity.com, that will take you to a page on the Win Without Pitching website. I'm Blair Enns on Twitter and also LinkedIn. I don't use other social media. For years I've been saying, I'm not convinced I'm going to stay on twitter much longer. But I am on Twitter now and I'm on LinkedIn now. And you can find me at Winwithoutpitching.com, where you can learn more [00:44:00] about the books and the training program. And if you want to reach out, you can do that through the website.</p>\n<h3>Rochelle:</h3>\n<p>Awesome.</p>\n<h3>Jonathan:</h3>\n<p>Very good. Well, dear listener, that is our show for this week. We hope you join us again next week for the Business of Authority. Bye.</p>\n<h3>Rochelle:</h3>\n<p>Bye. Bye.</p>\n",
  "pubDate": "Mon, 8 Jan 2018 11:08:00 +0000",
  "author": "jstark@jonathanstark.com (Jonathan Stark and Rochelle Moulton)",
  "link": "https://thebusinessofauthority.com/episodes/17bcd329-8d3f35d4",
  "content:encoded": "<p>Guest Blair Enns gives us a look behind the scenes of creating his new book Pricing Creativity.</p>\n<h2>Blair's Bio</h2>\n<p>Blair Enns is a 25-year veteran of the business side of the creative professions. In 2002, he launched Win Without Pitching, which has worked with thousands of creative professionals in numerous countries through direct engagements, seminars, workshops & webcasts. Blair is the author of \"The Win Without Pitching Manifesto\" and the forthcoming \"Pricing Creativity: A Guide to Profit Beyond the Billable Hour\"</p>\n<h2>Links</h2>\n<ul>\n<li><a href=\"http://pricingcreativity.com\">Pricing Creativity</a></li>\n<li><a href=\"https://www.winwithoutpitching.com/\">Win Without Pitching</a></li>\n<li><a href=\"https://2bobs.com/\">2Bobs Podcast</a></li>\n<li><a href=\"https://twitter.com/blairenns\">Blair on Twitter</a></li>\n<li><a href=\"https://www.linkedin.com/in/blairenns/\">Blair on LinkedIn</a></li>\n<li><a href=\"https://www.amazon.com/Implementing-Value-Pricing-Business-Professional/dp/0470584610\">Implementing Value Pricing: A Radical Business Model for Professional Firms</a></li>\n<li><a href=\"https://www.amazon.com/Curtis-Creek-Manifesto-Illustrated-Paraphernalia/dp/0936608064\">The Curtis Creek Manifesto</a></li>\n</ul>\n<h2>Transcript</h2>\n<h3>Jonathan:</h3>\n<p>Hello and welcome to The Business of Authority. I'm Jonathan Stark.</p>\n<h3>Rochelle:</h3>\n<p>And I'm Rochelle Moulton.</p>\n<h3>Jonathan:</h3>\n<p>And today, we're very excited to be joined by guest Blair Enns. Blair is the founder and CEO of Win Without Pitching and the author of the Win Without Pitching Manifesto, and the forthcoming Pricing Creativity: Guide To Profit Beyond the Billable Hour. Did I get that right Blair?</p>\n<h3>Blair:</h3>\n<p>You got it right Jonathan thank you.</p>\n<h3>Jonathan:</h3>\n<p>Stressful :-) I am very excited and I [00:00:30] know Rochelle's very excited to have you on the show. We have just a lot in common, I've been following your work for years, we've read a lot of the same authors and we're super excited to talk about how you've taken this big idea, which to me started with the Manifesto, perhaps it had its roots before that, and turned it into a consulting business and then later a training business, and now hopefully, fingers crossed, a bestselling author.</p>\n<p>So, could we start off by just [00:01:00] giving folks a little bit of background about who you are and what you do now and then we can sort of delve into the history?</p>\n<h3>Blair:</h3>\n<p>Yeah, sure. And thank you to both of you for having me on the podcast. I'm really looking forward to this and happy to be here. My name is Blair Ends, the company is Win Without Pitching and I founded it back in 2002, early 2002. At the time, it was a consulting practice, a new business development, sales or new business development consulting to creative [00:01:30] firms, typically independent creative firms, and I had come out of about a dozen years of working in advertising agencies and design firms and thought I'd launch this consulting practice.</p>\n<p>So that was the first iteration of Win Without Pitching. And then over the years, beginning in late 2012, and I'm sure we'll get into this, I decided to shift the structure of the company from a solo consulting practice to a training company. So that's where we are now in late 2017, [00:02:00] early 2018. Win Without Pitching is about five years into its current incarnation as a training company. And for a few years; 2013, 14, it was both as I kind of played with training and had to make a decision about going one way or the other.</p>\n<p>So we've been a pure training company for about three years. It really feels like this business is about three years old, but really it's more like 16.</p>\n<h3>Jonathan:</h3>\n<p>Wow. And [00:02:30] before that, you were from the agency world, you were inside the agency world, yes?</p>\n<h3>Blair:</h3>\n<p>Yeah, I worked for some of the world's largest advertising agencies and some of its smallest design firms. I was a suit, I don't own a suit anymore. Although my latest social media profile pic has me in a suit. I had a borrow a tie from my 18 year old son for that photo and I own one jacket. But I was a suit for many years and then I moved to this little mountain [00:03:00] village in the middle of nowhere where we live now when I started the consulting practice. So there's this kind of shift in the personal life that was the impetus for the business change.</p>\n<p>And I had a Hugo Boss bonfire when I moved out here, got rid of all the suits. But I was a suit doing account services and new business at a very young age in the first ad agency I ever worked. When at I was 22, I was handed responsibility for new business. I wasn't great at it but I did have some natural skills at [00:03:30] it. So yeah, I came out of the account management and new business side of both advertising and design.</p>\n<h3>Jonathan:</h3>\n<p>Okay. So, how do you go from there to writing the Manifesto?</p>\n<h3>Blair:</h3>\n<p>Well, the Manifesto I wrote I think in late 2005, early 2006 so I had been running the consulting business for three or four years at that time. And the name, I think the of the business is kind of a fluke and I've been [00:04:00] told by some of my closest professional friends that, \"Yeah, Win Without Pitching is a stupid name, you need to change the name.\" On some level, I think it is maybe not an appropriate, maybe not the appropriate ... There's something about the name that can sound a little bit schlocky maybe, like some sort of false promise, but on the other hand, that name has driven me to ...</p>\n<p>It's really a great label for how I've always thought about new business, [00:04:30] and it's forced me to come at the subject matter from that perspective that is really true to me. And I think that's really been the difference, whether it's been a consulting practice or a training company or a book that I've written, i's always coming from that win without pitching perspective. So the name came first, the business came first.</p>\n<p>And then in, I think it was, yeah, it was late 2005, I think early 2006, where I [00:05:00] was writing a piece. I've published an article, a blog post for years, for 16 years, either somewhere between weekly and monthly. And at the time, I think I was publishing closer to monthly. And I wanted something for the end of the year. So I tried on, I had this idea of like just wrapping up all of my philosophy into a few short pithy statements. And I was also trying on tone of voice. I'm a huge fan of Manifestos, [00:05:30] and I kind of collect them and I've read most of the big ones. I think the biggest, most important book ever written and religious people will be horrified at this, I think the most important book ever written might be the Curtis Creek Manifesto.</p>\n<p>And I won't say anything more about that, people can go look at it and think, \"Huh? What are you talking abut?\" Order it, give it to every 12 year old you know and you'll change the world. I was writing a blog post and it was trying on [00:06:00] a new voice, I was trying on a Manifesto voice. And at the time, and even for a few years after, it was the riskiest thing I'd ever written, just because the tone was so different. And I thought it was going to be taken as too over the top. Like it's almost the biblical [inaudible 00:06:14] We shall, etc.</p>\n<p>It's 12 proclamations, it's not chapters I imagine Martin Luther nailing something like this to the church door. So I was quite nervous when I hit publish. And then the response was really gratifying and inspiring, [00:06:30] because people were telling me that they had ... some designers that actually typeset it and put it on a poster and actually put it on their wall. And I kept getting feedback like that for a long time. So when it came time to write a book, and if you want to be seen as the expert in your space, then you probably should write a book. And I was feeling the pressure to write a book.</p>\n<p>But it didn't have a format, it didn't have kind of a narrative structure or I didn't [00:07:00] know ... Otherwise, it would just been a book of lists. And then I thought based on the success of that post, maybe I'm going to frame a book based on this. And I'm so glad I did. I'm really happy with this book, seven and a half years later. I'm surprised to say that I'm still really happy with this book.</p>\n<h3>Jonathan:</h3>\n<p>That's great. To have a shelf life it's that long, there's no reason it couldn't continue to grow. Nothing in it is really dated, it's completely ...</p>\n<h3>Rochelle:</h3>\n<p>[00:07:30] It's evergreen.</p>\n<h3>Blair:</h3>\n<p>Yeah. I set out to write a timeless book. And my intention for the book was I would create something that would outlive me. And so, there is nothing in it, as both of you point out, it's kind of evergreen content, there's nothing in there that will be dated. There's nothing about the design, the design looks like it was like dug up from a lock box and it could be from any time. In fact, one of the first things I did with this book, once I decided on the fact that it would be a Manifesto, is I [00:08:00] had to decide what size would it be. So I took a bunch of different books that I owned and ... I just had a sense of how the size of the book, so I took something that was the right thickness, but it was too large a format, and I cut it down. And I said, \"I want the book to be this size.\" And this isn't the way books ...</p>\n<p>So I wrote to the size because I wanted a designer, somebody who maybe doesn't do a lot of in-depth reading, I wanted them to be able to read it on a typical plane ride; like on a two hour plane ride. I wanted [00:08:30] it to fit into a purse, into a laptop bag, on a toilet tank. And then so once I got the physical, I had the structure, this 12 proclamations Manifesto structure. And then I had the size, and then I hired a designer who when he's not doing his day job, he designs typefaces for Bibles.</p>\n<h3>Jonathan:</h3>\n<p>Nice.</p>\n<h3>Blair:</h3>\n<p>Yeah. I thought, \"Well, for a creative audience, it either has to be really well designed or it has [00:09:00] to just be all about the words,\" and I wanted it to be all about the words. And I wanted it to be somebody who is fanatic fanatical about type. So I hired Brian Soy. His firm is called Aspire and it's not book design isn't their day job, but they do. In fact, they're just finishing up my next book, Pricing Creativity. But he's a nut about type. And I remember he came to a seminar I did in Miami Beach years ago, I remember walking down the main drag, is Ocean Drive, I forget, in Miami [00:09:30] Beach.</p>\n<p>And him just like pointing out all the art deco fonts and thinking ... in all of the hotels and buildings that we were going past. So the rest of us are in this conversation about something else and he's just going crazy over typefaces.</p>\n<h3>Jonathan:</h3>\n<p>Yeah. It's awesome down there for that. And it was a big success. It's how I heard about you. In fact, I know who told me about you, no, I take it back. So this is weird and this is, I think, perhaps [00:10:00] a source of some like infusion earlier, which is that I came across this as a blog post first. A friend of mine was, \"Blair Enns, Blair Enns, Blair Enns.\" And he sent me a link to one of the, I don't remember which one it was, but it was one of the proclamations. And I was like, \"Yes, yes, this is good. This guy knows what he's talking about.\"</p>\n<p>I didn't even realize for a long time that it was bound in any form. I was like, \"Oh, this is just this free online thing,\" which I believe is still true. I believe people can still read [00:10:30] it online.</p>\n<h3>Blair:</h3>\n<p>You can read the entire book for free at WinWithoutPitching.com.</p>\n<h3>Jonathan:</h3>\n<p>Well, now I want the physical one. I want to feel it, put it on my toilet tank.</p>\n<h3>Blair:</h3>\n<p>Where it Belongs. Yes.</p>\n<h3>Jonathan:</h3>\n<p>So, you launched the book, and people are printing it out on their walls, I would count that as a big success. And I've seen a number of videos of you sort of giving [00:11:00] presentations, which I know came after that time because you reference the Manifesto in the talks. What was that, period? Do you do that anymore? Sounds like you're in a remote area now, so you probably don't.</p>\n<h3>Blair:</h3>\n<p>Yeah. No I do a lot of speaking. In fact, when my next book comes out on January 10th, I've set aside all of 2018 to just travel the world and speak in support of that book. And I didn't have, now that I'm the CEO of a training company and I don't coach or train in our program [00:11:30] anymore. I create curriculum, I work with my team, I take us into the future, I'm in charge of future value creation. I speak and I write. When I was a consultant, I wrote the book and it got me lots of invitations to speak already did pretty good on the speaking front. But it got me a lot of invitations to speak so I did a lot of lectures on the Manifesto around the world.</p>\n<p>But I was still running a consulting business. And if I'm not consulting then I'm not [00:12:00] sending invoices, and I'm not earning money. I've been fortunate in that I've always been paid well to speak. And what I get paid has increased over the years. I could probably earn a decent living just speaking if I wanted to. But the real money was in consulting. Now we're a training company and I'm not encumbered with that day to day training or operations of the business, I'm free to basically just go and speak, so that's that's a big part of it. And anybody who writes a book, what follows behind [00:12:30] that are a lot of speeches and nowadays a lot of podcasts interviews like this.</p>\n<h3>Jonathan:</h3>\n<p>I imagine it was tough. Well, was it a tough decision to switch from consulting to training or was it, you said you had sort of a shift in where you were living and the bonfire and whatnot. Were you excited to do that or was it scary, was it obvious?</p>\n<h3>Blair:</h3>\n<p>That was the scariest. I look the scariest things that you ever do, at some point soon after you look back on them and think, \"Well, that was ... Why was [00:13:00] I so afraid by that?\" But picking up our young family and moving to this little village in the middle of nowhere not, not really knowing how we were going to earn a living, that's how Win Without Pitching came to be, it was a necessity. I knew I wanted to kind of get out of the rat race of the city and the advertising profession at the time.</p>\n<p>Before I left, I was in a horrible job with a difficult boss, I'll say it politely, [00:13:30] and I was ruined for the advertising profession. And then, I was fired from that job, like I engineered my own dismissal, and that's another long story. I thought I would ... And I saw it all building towards a lawsuit. But as I was being relieved of my duties and handed my severance check, I thought, \"I'm not going to sue you. I'm never going to see you again.\" After that I went to work for a really great boss and I was asked to build a satellite office. It had existed [00:14:00] but all the clients had left, to build the satellite office for another creative firm.</p>\n<p>And that was a great experience that that allowed me to fall in love with the profession again. But I had already decided we were moving to this village in the middle of nowhere, so I told the guy I was working for that I would do it for a year, a year turned into 20 months then I said I had to go. So we moved to this little village in the middle of nowhere and we had a bunch of little kids, we have four children. We had three at the time and the youngest was 6 months old. We had a fourth [00:14:30] a couple of years after moving here.</p>\n<p>So we were raising a young family and in the early days, Win Without Pitching, it was a lifestyle business. In the summers, it's a beautiful little village we live in on the shore of a 92 mile long lake, home to the largest strain of rainbow trout in the world. It's idyllic, it's as you imagine it. For years, I shared an office with a grizzly bear biologist and a bat biologist. So we really are in this beautiful little mountain village in the mile [00:15:00] of nowhere and it really was a lifestyle business in the early days. And then around 2012, my kids were at a certain age, they no longer really needed dad to be around a lot more and I was working more and more as a consultant.</p>\n<p>And in November of 2012, I found myself flat on my back with pneumonia in bed for two weeks and it was the fourth time that year that I had gotten some sort of sickness, just run down somewhere. And on three continents. So four times on three continents in one year, I just kind of run myself down as [00:15:30] I was trying to maximize this consulting model. And I had an epiphany while I was kind of recovering, I realized that my business model was trying to kill me, so I'd better kill it first. And that's what I decided to make the shift to. I decided to launch a training program.</p>\n<p>I recovered and I put together a 13 week training program, sent it out to my market, immediately sold it out. Then did another one, sold that out, did another one sold [00:16:00] that out. So that took me through to 2013. And then for 2014, I strung three programs together into an annual commitment, sold that out. And then I think by 2015 I decided that I couldn't do both. Now, I didn't come to the conclusion that a training business is better than a consulting business. Part of my journey was, I discovered value-based pricing and I realized that the way I was pricing my consulting engagements [00:16:30] and running my consulting engagements was contributing to kind of the stress on my health.</p>\n<p>I had productized my consulting services. You could do a two day session with me, which would cost X or could be like one day plus a bunch of remote consulting work. I'd package created three or four different packages and I'd put these prices on those packages. And everything I just described violates some of like my new rules of pricing. And I realized as I learned more [00:17:00] about value based pricing, I thought, \"Okay. I either need to become a properly value based pricing consultant.\" By that I mean, I would look at every consulting engagement as a completely blank slate and dive deep into what it is that the client really wanted and how much value I could create, and then craft a really unique engagement that was specific to the client and the value in their situation and the value they were trying to create.</p>\n<p>So that every engagement would truly [00:17:30] be different and would be priced differently. If I wanted to earn the most money from those engagements, I felt like I needed to be able to say to my clients, \"You know what, I'll get on a plane and I'll see the day after tomorrow.\" Because of where I live, it takes me a day to get anywhere. It sometimes takes me a day to get to an airport. I just couldn't do that. So I felt like if I couldn't properly value price my consulting engagements, then I really needed to go the other way and fully productize [00:18:00] my business. So that's the decision I made.</p>\n<p>I made the decision to go to a more scalable, productized service business and productized consulting business is a training company. So that's where we are today and it was really driven by the fact that I had kind of maxed out the consulting model the way I was doing it and I was a little bit limited by where I lived. And I felt strongly that I needed to go one way or the other and the easiest way for me to go [00:18:30] would be to go to scale up training company. I was talking to somebody in Austin, Texas about this the other day, somebody who is a consultant, and he was kind of trying on the idea that, well, maybe the evolution of all consulting practices is training companies.</p>\n<p>And I said, \"Man, if I lived in Austin, Texas, I would be a consultant. I would not own a training company. If I had ready access to lots of different creative firms, where I could go in deep and help them more, I'm pretty sure in the short term, in the first five to six years for sure, [00:19:00] I would make way more money and have a bigger impact on a smaller number of clients.\" But I don't live in Austin, Texas. I live in Kaslo, British Columbia and it makes sense to build a training company.</p>\n<h3>Jonathan:</h3>\n<p>It sounds like, I don't know if this is just because of the compression of time, that we're compressing the timeline, but it sounds like there was a fairly high degree of certainty there based on a series of decisions that you made, particularly about moving, but it seemed like you were pretty clear on what to do, even though there was some fear.</p>\n<h3>Blair:</h3>\n<p>[00:19:30] Yeah I think so. I was doing a live podcast with my podcast cohost. I do a podcast called 2 Bobs. The number 2 Bobs with my friend and colleague David C. Baker, and we doing it live in London two weeks ago and in the Q&A afterwards, we were talking about how different we are from each other. He's very scientific in his approach and he said to me, he said, \"You're not afraid of anything.\" And I thought, \"Well, that's not true.\" But I get these ideas and I just will not be stopped.</p>\n<p>And I [00:20:00] think I've learned to lean into the fear. And if you know anything as you do about my selling approach, if there's anything uncomfortable in the sale, we teach well, lean into it, go into the dark places, embrace the awkward silence, say the things that the client won't say, the things that most people in that situation would not bring up. It's your job to bring it up. So I think I've learned that when you get these crazy ideas, lean [00:20:30] into them. As an example, I was a couple of years into both offering a training program and I was still consulting. And I was on a plane I was flying to Dallas and I, for whatever reason I decided, \"This is my last. I need to pick one one or the other.\"</p>\n<p>I knew it was going to be training and I knew at some point it had to no longer consult. So I decided on the plane, \"This is my last client.\" I walked into my client's office the next morning and one of the first things I said is, \"I want [00:21:00] you to know this is my last client.\" And then I went on the plane on the way home I wrote a lengthy blog post called, I think it's called I'm Out. And I said to the world and nobody reads my blog because they want to know what I'm up to, they read it for the guidance. But every once in a while ...</p>\n<p>So I just published it for me. I wanted to make a proclamation to the world that that's it, I'm out of the consulting business. I'm not doing this anymore. Because I knew if I didn't say [00:21:30] it publicly, then I would probably start doing consulting again. So that's kind of the way I tend to operate, I come up with this idea and then I make this public declaration about what I'm going to do and then I think, \"Oh crap, well, I guess I have to do it.\"</p>\n<h3>Jonathan:</h3>\n<p>Absolutely. You mentioned a couple of times Pricing Creativity, the new book. I have that thing highlighted to death. And I'm very much looking forward to talking to you about the pricing [00:22:00] details or the tools and the techniques that you talked about in there on my pricing podcast; Ditching Hourly. What appears about, in this context is what was your whole thought process about why to do this book, what your plans are for it, is this for you a 150, 200 page business card or is this something you actually want to see on bestseller lists as like an income stream. What are you thinking about there?</p>\n<h3>Blair:</h3>\n<p>Yeah. That's [00:22:30] a great question and I've found myself into some really great conversations about this. The Manifesto is the oversized business card. I refer to it as the Yes You Can book. I want people to read it, put it down. And as an early reader said in a review or somewhere online, he said, \"I finished that book and it just makes me want to go wrestle a bear.\" So I use that line a lot. I want you to go feel like you can go wrestle a bear after that book. There's not a lot of how to end it. It meets a Manifesto, it's not meant to be a how to.</p>\n<p>[00:23:00] And the pricing book is a 50 ... so the Manifesto is just under 24,000 words, the pricing book is a 57,000 word manual. I wrote it as a manual, it's published as a three ring binder. There are different formats, you can get the ebook, you can get the ebook in the binder, you can get the ebook binder and four hours of video support. But I really wrote it to be like a desk reference, where you would read it once through, I hope it's enjoyable enough, that you can read [00:23:30] most of it through. And then, after that, when it comes time to put together your next proposal, price out your next proposal.</p>\n<p>I want people to reach out onto the shelf, pull it out, remind themselves of some of the rules and some of the tips, and then flip to the tool section at the back, and use those tools to actually craft their proposal. My vision is, this book will be on the desk or shelf of every creative professional in the world, who is charged with setting or negotiating [00:24:00] price. That is my vision. And I could have published it through a few different mainstream publishers. The Manifesto has generated a lot of interest for me from mainstream publishers, I could have published it that way. But it occurred to me, I'm looking at a bookshelf filled with about 25 books on pricing, and then probably another 25 on economics, most of them behavioral economics.</p>\n<p>I own all the books on pricing, and some of them have been so [00:24:30] transformative. Ron Baker has been such an positive influence on me on pricing. And the impact he's had on the professional world through his two books on pricing has been phenomenal. But I look at Ron's books and I think, \"He should have made millions of dollars with these books.\" I know he's built a really lucrative career as a speaker, and I don't know if he does consulting or not, but as an author and a speaker, he has built a really good career. So it's not like he's not well rewarded, but I kind of value [00:25:00] conversation with the Global Creative Community without them knowing it, about the impact and value of this book.</p>\n<p>And I did some quick math and I thought, \"I think I can sell between six and 10,000 copies of this book, which is a really big number given the audience and given what I'm charging for it. But I think over seven or eight years I kind of see ... Because I think it'll be bought in bulk and multiple copies from larger firms. I can see it [00:25:30] affecting the bottom line of 2,000 firms, I did the math. Okay, 2,000 firms, let's say, an average size of a million dollars, that's two billion dollars in revenue. I think and I know from anecdotal experience, that this is conservative.</p>\n<p>I think that the average firm that reads and implements this, can add at least 5% to their bottom line. If you're a million dollar firm, I fully expect that there's no reason why you can't add an extra $50,000 [00:26:00] in profit. And I've talked to Creative Principles to whom I have given pricing advice through our program, and where we just touch on it tangentially in our training program. The profit increase stories just from some of these pricing principles, are just, tenfold increase in profit, I've heard that a lot, doubled profit, tripled profit. I think adding a 5% increase that essentially represents [00:26:30] a 50% increase in most firms. Anyway, that adds up to like 100 million dollars per year, in additional profit for 2,000 smallish creative firms.</p>\n<p>If I were working as a consultant and these 2,000 firms were just one business, and I said to that business owner, \"Listen, I'm pretty confident that I can add $100 million a year to your bottom line.\" What do you think fair compensation for me as a consultant [00:27:00] would be? The answer would be in the millions of dollars, right?</p>\n<h3>Jonathan:</h3>\n<p>Absolutely.</p>\n<h3>Blair:</h3>\n<p>But there's something about the package that is a book that says, \"Well, it doesn't matter if you add hundreds of millions of dollars to the bottom line, if you sell it the traditional way, books should cost between 20 and $40, then you're only going to make so much money.\" Well, that's ridiculous. So, this book is not sold, it's not available on Amazon, it's only available on our website, Winwithoutpitching.com, go to Pricingcreativity.com, and you'll be redirected. [00:27:30] And it's the first pricing book in the world that is priced based on the principles in the book.</p>\n<p>When there are three different options, I'm not going to give away too much here, but it starts at $320 a copy. And then there's a $199 version. There's a $100 version. Each of those is fully guaranteed, if you buy at any level. And if it doesn't work for you for whatever reason, sent it back to us, we'll send your money back, no questions asked. So, it's fully guaranteed. [00:28:00] And I want people after they buy the book, I want them to go back to the pricing page on our website. And I want them to see after they read the book. I want them to see, how many of the pricing principles in the book that I've talked about that we actually used in the pricing of this book.</p>\n<p>I expect, based on the math that I laid out to you, I expect to earn a million dollars in this book. And I think that's fair for me as an author. If I were a consultant, I would view it as an [00:28:30] unfair price.</p>\n<h3>Jonathan:</h3>\n<p>Too low.</p>\n<h3>Rochelle:</h3>\n<p>So the million dollars, you see that coming directly from the book not from doing speeches around the book, not from doing training around the book, totally from the book?</p>\n<h3>Blair:</h3>\n<p>Yeah.</p>\n<h3>Rochelle:</h3>\n<p>That's incredible.</p>\n<h3>Blair:</h3>\n<p>And I had an author say to me when I was in London, he said, \"You know, you don't write a book for the money.\" Well, sometimes you do.</p>\n<h3>Jonathan:</h3>\n<p>I think sometimes you do, I agree. I've written five or six books now depending on how you count it. And I've done through traditional publishers and [00:29:00] self published. And it's different. I think it's important to decide which way you're going to go before you write it. \"What's this book for? Is this a business card? Am I staking out a claim to a particular aspect of authority in the world? Or is this a revenue move?\" And I think there can be some overlap. There's certainly overlap in the results, but I think knowing which one you're shooting for before you start the project is pretty important.</p>\n<h3>Blair:</h3>\n<p>I [00:29:30] agree and I think probably too many business authors don't actually spend enough time thinking about what the goal of the book is, and therefore what the right way to publish it is or to market it. Like the purpose of this book is value creation, to create value for others, that's the purpose of it. I'm very happy with The Win Without Pitching manifest. I'm happy with the impact it has had on the global creative profession. And I can extrapolate into the future and imagine the impact that it will have with [00:30:00] the long term, and I'm very proud of that. And I have the same expectations, but in different avenue, same expectations for Pricing Creativity book. I really expect this to be the standard in the global creative firm community for many years.</p>\n<p>I don't think it's going to be timeless, as timeless as the Manifesto, but I expect it to be the standard, to be on people's shelves, and more than the Manifesto, which gets people inspired and gets them believing that there [00:30:30] is another way. This is really the here's how to take those principles and the Manifesto and turn them into real income, real profit for you and your firm. So, yeah, the oversized business card is out there, this is the thing meant to follow up on that, to drive more value creation and obviously, create value for me the author.</p>\n<h3>Jonathan:</h3>\n<p>I totally agree with that. I think the Manifesto was a rallying cry and Pricing Creativity is more of a [00:31:00] playbook, or it's funny that you chose the physical format that you did, because it does remind me of old time software manuals or cookbooks, or it earn and I think it also breaks the way you pointed out earlier as a sort of preconceived notion of how much a book costs. And it's like \"Well, this one's a little different.\" You don't even have to believe the value proposition of the book necessarily, you just look at it and you're like, \"Okay, this is different. This is not your regular business book.\"</p>\n<h3>Blair:</h3>\n<p>If you think of [00:31:30] the training that we sell, so we sell a term of training for anywhere between 2,000 and $15,000, depending on how it's delivered, but the content is essentially the same. And when I started writing this book, for the longest time I thought there was going to be a training program version of it. If you buy the ebook, the manual, which has the added tool section in it, and an advance review copy that you've read Jonathan, doesn't have that tool section in it, but the manual [00:32:00] has it. And then four hours of supporting video around it, you're essentially buying training, so it looks like an expensive book, but it's actually cheap training.</p>\n<p>And so, we've decided we're not at least for the next year or so, we're not building training around them, around pricing. Our training continues to be around selling, selling The Win Without Pitching Way. We also have some stuff on positioning and regeneration, but we're really a sales training organization. So, this is really deeply discounted training on pricing. [00:32:30] If you look at it that way, it's cheap. If you look at it as a book, and some people will look at it as a book and be outraged at the price, it's expensive.</p>\n<h3>Rochelle:</h3>\n<p>But it's this wonderful integration of the idea of a book in an online course. A lot of people are complaining about online courses now, because you're not getting enough deep content. And I like how you put both of them together here.</p>\n<h3>Blair:</h3>\n<p>Thank you. Even our training program we go out of the way to say it's not an online course. This is [00:33:00] coach led training in classrooms, our coaches have more than 10 years of experience of selling The Win Without Pitching Way, because they were clients of mine more than 10 years ago and have 10 years ... So, and I have nothing against online courses, they are just a lot of them out there, and if you put something into the package of an online course, the price drops. It's like an online courses now, it's now encumbered by the same kind of the limitations of the package as a book is, if you buy [00:33:30] a book on Amazon. So, we're trying to break that paradigm too.</p>\n<h3>Jonathan:</h3>\n<p>It's fascinating, I could talk about pricing all day of course. I think you mentioned the 25 pricing books on your bookshelf, I think I have the same because ... In Pricing Creativity, the first section, I'm not sure, I think you had a different name for it, but the first sort of region of the book is, for people who are maybe considering buying it, it is like a crash course [00:34:00] in the best books on pricing that are out there. And you sort of skim across the service and pull up things that are important to this specific kind of reader, which I think is critical because I can't think of any of the pricing books, even implementing value pricing.</p>\n<p>None of them really speak down to a tactical level to a particular kind of profession. I find when teaching people some of these, let's be honest, these are pretty abstract concepts, [00:34:30] very, very intangible and tough to believe. There are like an optical illusions almost. And when people are new to these ideas, they need someone, the first couple of times at least, they need someone to be like, \"No, no, go like this.\" And that, go like this, whatever it is, is different from vertical to vertical or it can be. This is why, I think for the right kind of reader, someone running an ad agency for example, or creative or design [00:35:00] agency, it's very, very actionable, which I think is going to earn a place on the desk of ... Like you said, I wouldn't be surprised if this was on the desk of every creative owner across the world.</p>\n<h3>Blair:</h3>\n<p>Certainly, we're not going to hit everyone, but that is my intent. And again, I'm traveling in support of that and I appreciate your point of view on the book, because you've identified what I've really tried to do in that first section, which [00:35:30] is called Principles. I really I'm trying to bubble up like the best of pricing theory from most of the books. And a lot of the best pricing books are heavy in theory and a little bit difficult on the application.</p>\n<p>Ron Baker's Implementing Value Pricing, I'm much a fan of his. Not only the knowledge, I've never met Ron, but we've corresponded. He just absorbs, his capacity to absorb and synthesize information is awesome, [00:36:00] and he's also an excellent writer. I would read anything that he's written, but when I read Implementing Value Pricing, which is his second book after Pricing On Purpose or Pricing and Purpose is the theory, Implementing Value Pricing basically builds on that. You can just read his second book and skip the first one, because he does kind of a recap of all the principles. And he gets into some great stuff, even some level of detail on implementation that I don't.</p>\n<p>But it is as I read those, a friend of mine said and I talk about this in the book, he [00:36:30] said, \"You should write a book on pricing.\" and I said, \"Oh man, there are some great books on pricing, the world doesn't need another one.\" He said, \"Well, your clients aren't going to read those books.\" He's right. The owners of the typical creative firms, especially people who see themselves as creative first, and kind of price or sales people, business people second, they're not going to read those books. I needed to deliver the principles in a very interesting way, not go too deep into it, and then get right to [00:37:00] do this.</p>\n<p>So, the next section is, rules, six different rules, six things you always do when you're pricing. And then the section after that is the lengthier section, it's the tips and that's meant to be specific situation, specific guidance for a specific situation. Crafting your high priced options, crafting your low price options, making the margin in the middle. Dealing with retainers, final negotiations with procurement etc, etc. I imagine people read the first two sections and then when it comes time to craft their proposal, they'll go to the back, [00:37:30] the tools section has a quick review of the rules, and then they'll flip to the section in the tools, to get the specific nugget for the thing that they're building for that one client.</p>\n<p>So, yeah, that's how I've tried to write the book, and also I come from the world of sales. The reason, I talk about this in the book, the reason value based pricing fails in most creative firms, in fact most professional firms, it breaks down at the value conversation. And that's where the theory [00:38:00] of pricing meets the actual reality of selling. I know from my own experience, you cannot become an effective pricer, if you do not at the same time work on your skills as a salesperson. The third one would be negotiating, so selling, pricing and negotiating, it's really hard to be good at pricing if you do not also tackle selling and negotiating. And that's one of the perspectives [00:38:30] that I tried to bring to the book.</p>\n<h3>Jonathan:</h3>\n<p>Definitely, definitely it comes through. So, we're going to hug it out here. I think it's a great book, I think people who are in this space, it's going to be worth every penny. We're running a little long on time, so what I'd like to do is, ask you what might be kind of a hard question, I know this is really big on your radar right now, but I'm wondering, what do you see beyond this? And the reason I ask is [00:39:00] because you have an amazing post, I think it's called No Exit or No Exit is in the title about, never retiring. And how that changes your focus about the business and all of that. So, I'm wondering have you had that sort of head space to even think beyond this at all, Does this still fit into that public declaration?</p>\n<h3>Blair:</h3>\n<p>Yeah. So the post is called A Mission With No Exit, and that's when I realized from a couple of different sources that, and just seeing in my own clients [00:39:30] what the pattern that I saw is, when you get to a certain age like 55-ish, in some principles, maybe a little earlier, maybe a little bit later, but certainly, by the time somebody is nearing 60, they quit making brave decisions in their business. And it's because they have one eye on the exit, and I realized there are few things that damage a business more than the principle of starting to kind of slowly extricate herself from the business. And I just saw this pattern over and over again, and then this is an [00:40:00] idea I first heard from Dan Sullivan, the founder of Strategic Coach, a coaching organization. I have been in for my own professional development and will be in again, I'm not currently in it right now.</p>\n<p>But early on in their program, they just disabuse you of this idea, that you're ever going to retire, and the rallying cry is effectively die with your boots on. So, I bought into that early on, and also the idea that you'd never sell. Like you come from the software space, and where in the design world, the design world [00:40:30] is changing so fast these days, because the worlds of design, business consulting and software engineering are all coming together. And look, we don't even have agreed on what the names for this is right, now but it's a really exciting time. But one of the things that's going on, is the design is taking a lot of its cues from tech these days, and in Silicon Valley and the tech world, you see a lot of like spinning up and exiting businesses. I'</p>\n<p>not going to try to make a moral judgment on that other than to say, [00:41:00] that does not appeal to me. But I think that I see some owners of design businesses think that the proper thing to do is like, build this business, spin it up and exit it. And a lot of sales people like to open a sales conversation with the principle of the business that they're trying to sell to, with the question, what's your exit. I think it's such an insulting question, the implication that you should have an exit. Because I think if I could take away from our listeners, those who own businesses. [00:41:30] If I could take away from you, your right to retire and your right to sell your business, I guarantee you the implications are, that you would start doing today all of the things that you've been putting off. Including things in your personal life, you would arrive at a work life balance now.</p>\n<p>You would start taking vacations now, you would make the difficult decisions around positioning your firm, about the clients that you work with, about the people that you work with, about having a strong number two in place so that you can free yourself up to do [00:42:00] the more meaningful things, both in the business and in the life. You would structure your day to day so that you're doing things that you love and you're energized by, rather than kind of wading through these undesirable things, with this crazy idea that there's some sort of payoff for all your sacrifice, that all your sacrifice now will lead to a payoff in the future.</p>\n<p>That's a dangerous idea, and I would just love to disabuse everybody of that notion. So, I talk about that in the post A Mission With No Exit. I do this talk around it's called the [00:42:30] Five Constraints. That's the first constraint, I'd say, if I could impose this on you I would. So in terms of my business, I've got visibility into years of my business, and my plan is, I have no plans to retire, I have no plans to sell, I plan to die with my boots on. I do recognize I'm 51, I do recognize that once you're 70, I don't know where the age is, where the line is, but at some point, people, the way, the advice that they're likely to [00:43:00] take from you is different.</p>\n<p>Your role needs to change as you age, I know that. But I have lots after this, so much is after this. I'm so excited about what's after launching and pushing Pricing Creativity out into the world. I could live three lives and I would never be finished with the things that I want to do in this business.</p>\n<h3>Rochelle:</h3>\n<p>Hear, hear.</p>\n<h3>Jonathan:</h3>\n<p>Amen. Well, that's a fabulous place to wrap up, I think. Where can people, where's [00:43:30] the best place for people to find out more about you online, Blair?</p>\n<h3>Blair:</h3>\n<p>I'm at Winwithoutpitching.com, if you go to Priceandcreativity.com, that will take you to a page on the Win Without Pitching website. I'm Blair Enns on Twitter and also LinkedIn. I don't use other social media. For years I've been saying, I'm not convinced I'm going to stay on twitter much longer. But I am on Twitter now and I'm on LinkedIn now. And you can find me at Winwithoutpitching.com, where you can learn more [00:44:00] about the books and the training program. And if you want to reach out, you can do that through the website.</p>\n<h3>Rochelle:</h3>\n<p>Awesome.</p>\n<h3>Jonathan:</h3>\n<p>Very good. Well, dear listener, that is our show for this week. We hope you join us again next week for the Business of Authority. Bye.</p>\n<h3>Rochelle:</h3>\n<p>Bye. Bye.</p>\n",
  "enclosure": "",
  "itunes:title": "Blair Enns - Pricing Creativity",
  "itunes:author": "Jonathan Stark and Rochelle Moulton",
  "itunes:image": "",
  "itunes:duration": "00:44:15",
  "itunes:summary": "Guest Blair Enns gives us a look behind the scenes of creating his new book Pricing Creativity.",
  "itunes:subtitle": "Guest Blair Enns gives us a look behind the scenes of creating his new book Pricing Creativity.",
  "itunes:keywords": "branding, consulting, business, marketing, authority",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 8
}