{
  "id": "yt:video:yFkxepBQKR0",
  "yt:videoId": "yFkxepBQKR0",
  "yt:channelId": "UC_zEzzq54Rm0iy7lmmZbCIg",
  "title": "An Attempt Was FAILED 🤣 | Funniest Fails of the Week | AFV 2022",
  "link": "",
  "author": {
    "name": "America's Funniest Home Videos",
    "uri": "https://www.youtube.com/channel/UC_zEzzq54Rm0iy7lmmZbCIg"
  },
  "published": "2022-10-19T13:00:43+00:00",
  "updated": "2022-10-20T16:34:22+00:00",
  "media:group": {
    "media:title": "An Attempt Was FAILED 🤣 | Funniest Fails of the Week | AFV 2022",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Subscribe to join the #AFVFAM http://bit.ly/afvyoutube | 🔔 Make sure to enable ALL push notifications! 🔔 Check out our MERCH store: https://bit.ly/2UJJULn \n\nGet your daily dose of #FAILS right here! America's Funniest Videos has the BEST collection of #EPICFAILS and we've put together some of our favorites to get you through your week with a laugh! 😆 Which clip made you #LOL the loudest?! \n\nWatch the NEWEST videos: http://bit.ly/2MKctsW\n\nSubmit YOUR Video to AFV:\nhttps://bit.ly/SendAVidToAFV\n\nConnect with AFV Online:\nWebsite: http://afv.com/ \nFacebook: http://bit.ly/afvFacebook \nTwitter: http://bit.ly/afvTwitter \nInstagram: http://bit.ly/afvInstagram \n\nAbout AFV:\nAmerica’s Funniest Home Videos is America's longest running funny video television program. We've been collecting funny viral videos since 1989. Here you’ll find funny AFV 2022, AFV comp, AFV shorts, funniest shorts, viral shorts, fails of the month, fail of the month, best fails of the year, best fails of the month, funniest fail ever, funniest fail, funny fail, best fails ever, best fails, best fail,best fails ever, fails of the week, try not to laugh, try not to laugh challenge, Funny fail compilation 2022, failgag, people dying inside, funny fails video, karma, unexpected memes, when you’re stupid, regretly, instant karma fails, fail time, failtime, girl fail, girls fails, girl fails, fail army, videos, viral videos, prank videos, funny animal videos, funny baby videos, classic videos, and the best compilations and music montages of some of the funniest videos you've ever seen. Check out our different sections to find some of the best viral, funny, videos around. Comment, share, and subscribe to stay in touch to see funny videos you just can't find anywhere else!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}