{
  "itunes:episode": 34,
  "title": "Do Toy with My Affections with Erika Moen",
  "pubDate": "Wed, 31 Jul 2013 18:19:52 +0000",
  "link": "http://newdisrupt.org/blog/2013/7/31/episode-34-do-toy-with-my-affections-with-erika-moen",
  "description": "<p>Erika Moen has been drawing comics since she was a teenager, and found online success with <em><a href=\"http://www.darcomic.com/\">DAR: A Super Girly Top Secret Comic Diary</a></em> while working full-time jobs. Fortunately, she was laid off, and moved into new chapters of her life, which included an appearance on the Web reality show <em><a href=\"http://www.penny-arcade.com/strip-search\">Strip Search</a></em> (from Penny Arcade) and the launch this year of <em><a href=\"http://www.ohjoysextoy.com/\">Oh Joy Sex Toy</a></em>, a regularly appearing comic that reviews and recommends adult paraphernalia. We talk about her career and how the <em>Oh Joy</em> project has consumed all of her time and some of her husband's. (This episode contains frank discussions of sex toys and sexuality, a few obscenities, and is marked explicit on iTunes.)</p>\n\n<p>On Twitter, find Erika at <a href=\"https://twitter.com/ErikaMoen\">@ErikaMoen</a> and her comic at <a href=\"https://twitter.com/OhJoySexToy\">@OhJoySexToy</a>.</p>\n\n",
  "guid": "tag:soundcloud,2010:tracks/103439145",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:11:46",
  "itunes:subtitle": "Erika Moen has been drawing comics since she was a teenager",
  "itunes:summary": "Erika Moen has been drawing comics since she was a teenager, and found online success with DAR: A Super Girly Top Secret Comic Diary while working full-time jobs. Fortunately, she was laid off, and moved into new chapters of her life, which included an appearance on the Web reality show Strip Search (from Penny Arcade) and the launch this year of Oh Joy Sex Toy, a regularly appearing comic that reviews and recommends adult paraphernalia. We talk about her career and how the Oh Joy project has consumed all of her time and some of her husband's. (This episode contains frank discussions of sex toys and sexuality, a few obscenities, and is marked explicit on iTunes.)"
}