{
  "title": "#457: The Grim Granger (OOTP 21, The Eye of the Snake)",
  "link": "https://audioboom.com/posts/7532298",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4102,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Welcome Slug Club member Abbey, who has her own podcast for Grey's Anatomy fans: <a href=\"https://www.theoncallroompod.com/\">The On Call Room</a>!</li>\n<li>Coronavirus shuts down Cursed Child and the Wizarding World theme parks</li>\n<li>The leaked Harry Potter RPG will finally be announced this year!</li>\n<li>Fantastic Beasts 3 filming is now underway! Or at least, that <em>was</em> the plan. Since recording this episode, we've now learned that the movie has <a href=\"https://www.hypable.com/fantastic-beasts-3-release-date/\">halted production</a>.</li>\n<li>We get a sneak peek at the <a href=\"https://www.hypable.com/quidditch-through-the-ages-illustrated-edition-release-date/\">Quidditch Through the Ages Illustrated Edition</a>! What's with the U.S. cover being so boring?</li>\n<li>\n<a href=\"http://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a> continues with Order of the Phoenix – Chapter 21: The Eye of the Snake</li>\n<li>7-Word Summary: Harry heads towards Arthur in peril snakily </li>\n<li>The first part of the chapter takes us back to our Prisoner of Azkaban days</li>\n<li>Thestrals: was it wise for Hagrid to put students who have seen death in this situation?</li>\n<li>Dumbledore rides thestrals?!? What?!?</li>\n<li>Did no professor prepare Hagrid for what to expect from Umbridge's evaluation?</li>\n<li>Umbridge treats Hagrid like he is mentally challenged and manipulates student reactions and sentiments!</li>\n<li>Should Harry, Ron and Hermione have gone to McGonagall about Hagrid's treatment?</li>\n<li>Hermione wishes she could see thestrals! What?!? Andrew then proceeds to turn her into a serial killer!</li>\n<li>Harry feels resentment towards Hogwarts for the first time ever as the holidays approach</li>\n<li>Dumbledore's Army: Decorator Dobby, Ginny The Seeker and Mistletoe Magic</li>\n<li>We discuss Ron and Hermione's opposite reactions to Harry's first kiss</li>\n<li>Inside Nagini: Do we think any of the snake’s initial hesitation in attacking Arthur Weasley had to do with her humanity?</li>\n<li>Do we think Harry could have controlled the outcome if he wanted to? Or is it just like watching TV? Looking through the eyes of another Horcrux?</li>\n<li>The Umbridge Suck Count climbs to 47!</li>\n<li>Connecting The Threads, MVP of the Week and Rename The Chapter!</li>\n<li>Quizzitch: What is the name on the department store front which hides Saint Mungos to the Muggles?</li>\n<li>This week's episode of MuggleCast is sponsored by Quip (Get your first toothbrush refill free at <a href=\"http://GetQuip.com/Muggle\">GetQuip.com/Muggle</a> and OpenFit (get a free extended 14-day trial by texting 'mugglecast' to 50-50-50)</li>\n<li>Join our community at <a href=\"http://www.patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast! This week, we discuss J.K. Rowling's decision to give Arthur Weasley a reprieve in Order of the Phoenix!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 17 Mar 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-03-16:/posts/7532298",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}