{
  "title": "Episode 69: &#8220;Fujiyama Mama&#8221; by Wanda Jackson",
  "link": "https://500songs.com/podcast/episode-69-fujiyama-mama-by-wanda-jackson/",
  "pubDate": "Mon, 10 Feb 2020 08:03:48 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-69-fujiyama-mama-by-wanda-jackson/",
  "description": "Episode sixty-nine of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Fujiyama Mama\" by Wanda Jackson, and the first rock and roller to become \"big in Japan\" Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/33900516\"> on \"Purple People Eater\"</a> by Sheb Wooley.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-69-fujiyama-mama/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI have two main sources for this episode. One is <a href=\"https://amzn.to/2Ml6ppi\">Wanda Jackson's autobiography, <em>Every Night is Saturday Night</em></a>. The other is <a href=\"http://articles.womeninrockproject.org/fujiyama-mama/\">this article on \"Fujiyama Mama\"</a>, which I urge everyone to read, as it goes into far more detail about the reasons why the song had the reception it did in Japan.\n\nAnd <a href=\"https://amzn.to/2Y9Gng3\">this compilation</a> collects most of Jackson's important early work.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nBefore we begin this episode, a minor content note. I am going to be looking at a song that is, unfortunately, unthinkingly offensive towards Japanese people and culture. If that – or flippant lyrics about the bombings of Hiroshima or Nagasaki – are likely to upset you, be warned.\n\nWhen we left Wanda Jackson six months ago, it looked very much like she might end up being a one-hit wonder. \"I Gotta Know\" had been a hit, but there hadn't been a successful follow-up. In part this was because she was straddling two different genres -- she was trying to find a way to be successful in both the rock and roll and country markets, and neither was taking to her especially well.\n\nIn later years, it would be recognised that the music she was making combined some of the best of both worlds -- she was working with a lot of the musicians on the West Coast who would later go on to become famous for creating the Bakersfield Sound, and changing the whole face of country music, and her records have a lot of that sound about them. And at the same time she was also making some extremely hot rockabilly music, but she was just a little bit too country for the rock market, and a little bit too rock for the country market.\n\nPossibly the place where she fit in best was among the Sun records acts, and so it's not surprising that she ended up towards the bottom of the bill on the long tour that Jerry Lee Lewis, Carl Perkins and Johnny Cash did over much of North America in early 1957 -- the tour on which Jerry Lee Lewis moved from third billed to top of the bill by sheer force of personality. But it says quite a bit about Jackson that while everyone else talking about that tour discusses the way that some of the men did things like throwing cherry bombs at each other's cars, and living off nothing but whisky, Wanda's principal recollection of the tour in her autobiography is of going to church and inviting all the men along, but Jerry Lee being the only one who would come with her.\n\nTo a great extent she was shielded from the worst aspects of the men's behaviour by her father, who was still looking after her on the road, and acted as a buffer between her and the worst excesses of her tourmates, but she seems to have been happy with that situation -- she didn't seem to have much desire to become one of the boys, the way many other female rock and roll stars have. She enjoyed making wild-sounding music, but she saw that mostly as a kind of acting -- she didn't think that her onstage persona had to match her offstage behaviour at all.\n\nAnd one of the wildest records she made was \"Fujiyama Mama\":\n\n[Excerpt: Wanda Jackson, \"Fujiyama Mama\"]\n\n\"Fujiyama Mama\" was written by the rockabilly and R&B songwriter Jack Hammer (whose birth name was the more prosaic Earl Burroughs), who is best known as having been the credited co-writer of \"Great Balls of Fire\". We didn't talk about him in the episode on that song, because apparently Hammer's only contribution to the song was the title -- he wrote a totally different song with the same title, which Paul Case, who was the music consultant on the film \"Jamboree\", liked enough to commission Otis Blackwell to write another song of the same name, giving Hammer half the credit.\n\nBut Hammer did write some songs on his own that became at least moderate successes. For example, he wrote \"Rock and Roll Call\", which was recorded by Louis Jordan:\n\n[Excerpt: Louis Jordan, \"Rock and Roll Call\"]\n\nAnd \"Milkshake Mademoiselle\" for Jerry Lee Lewis:\n\n[Excerpt, Jerry Lee Lewis, \"Milkshake Mademoiselle\"]\n\nAnd in 1954, when Hammer was only fourteen, he wrote \"Fujiyama Mama\", which was originally recorded by Annisteen Allen:\n\n[Excerpt: Annisteen Allen, \"Fujiyama Mama\"]\n\nThis was a song in a long line of songs about black women's sexuality which lie at the base of rock and roll, though of course, as with several of those songs, it's written by a man, and it's mostly the woman boasting about how much pleasure she's going to give the man -- while it's a sexually aggressive record, this is very much a male fantasy as performed by a woman.\n\nAllen was yet another singer in the early days of R&B and rock and roll to have come out of Lucky Millinder's orchestra -- she had been his female singer in the late forties, just after Rosetta Tharpe had left the group, and while Wynonie Harris was their male singer. She'd sung lead on what turned out to be Millinder's last big hit, \"I'm Waiting Just For You\":\n\n[Excerpt: Lucky Millinder and his orchestra, \"I'm Waiting Just For You\"]\n\nAfter she left Millinder's band, Allen recorded for a variety of labels, with little success, and when she recorded \"Fujiyama Mama\" in 1954 she was on Capitol -- this was almost unique at the time, as her kind of R&B would normally have come out on King or Apollo or Savoy or a similar small label.\n\nIn its original version, \"Fujiyama Mama\" wasn't a particularly successful record, but Wanda Jackson heard it on a jukebox and fell in love with the record. She quickly learned the song and added it to her own act.\n\nIn 1957, Jackson was in the studio recording a country song called \"No Wedding Bells for Joe\", written by a friend of hers called Marijohn Wilkin, who would later go on to write country classics like \"Long Black Veil\":\n\n[Excerpt: Wanda Jackson, \"No Wedding Bells For Joe\"]\n\nFor the B-side, Jackson wanted to record \"Fujiyama Mama\", but Ken Nelson was very concerned -- the lyrics about drinking, smoking, and shooting were bad enough for a girl who was not yet quite twenty, the blatant female sexuality was not something that would go down well at all in the country market, and lyrics like \"I've been to Nagasaki, Hiroshima too/The things I did to them I can do to you\" were horribly tasteless -- and remember, this was little more than a decade after the bombs were dropped on those cities.\n\nNelson really, really, disliked the song, and didn't want Jackson to record it, and while I've been critical of Nelson for making poor repertoire choices for his artists -- Nelson was someone with a great instinct for performers, but a terrible instinct for material -- I can't say I entirely blame him in this instance.\n\nBut Wanda overruled him -- and then, when he tried to tone down her performance in the studio, she rebelled against that, with the encouragement of her father, who told her \"You're the one who wanted to do it, so you need to do it your way\".\n\nIn the last episode about Jackson, we talked about how she'd tried to do her normal growling roar on \"Hot Dog! That Made Him Mad!\" but was let down by having drunk milk before recording the song. This time, she had no problem, and for the first time in the studio she sang in the voice that she used for her rock and roll songs on stage:\n\n[Excerpt: Wanda Jackson, \"Fujiyama Mama\"]\n\nTo my ears, Jackson's version of the song is still notably inferior to Allen's version, but it's important to note that this isn't a Georgia Gibbs style white person covering a black artist for commercial success at the instigation of her producer, and copying the arrangement precisely, this is a young woman covering a record she loved, and doing it as a B-side. There's still the racial dynamic at play there, but this is closer to Elvis doing \"That's All Right\" than to Georgia Gibbs ripping off LaVern Baker or Etta James.\n\nIt's also closer to Elvis than it is to Eileen Barton, who was the second person to have recorded the song. Barton was a novelty singer, whose biggest hit was \"If I Knew You Were Coming I'd Have Baked a Cake\" from 1950:\n\n[Excerpt: Eileen Barton, \"If I Knew You Were Coming I'd Have Baked a Cake\"]\n\nBarton's version of \"Fujiyama Mama\" was the B-side to a 1955 remake of \"If I Knew You Were Coming I'd Have Baked a Cake\", redone as a blues. I've not actually been able to track down a copy of that remake, so I can't play an excerpt -- I'm sure you're all devastated by that.\n\nBarton's version, far more than Jackson's, was a straight copy of the original, though the arranger on her version gets rid of most of the Orientalisms in Allen's original recording:\n\n[Excerpt: Eileen Barton, \"Fujiyama Mama\"]\n\nI think the difference between Barton's and Jackson's versions simply comes down to their sincerity. Barton hated the song, and thought of it as a terrible novelty tune she was being forced to sing. She did a competent professional job, because she was a professional vocalist, but she would talk later in interviews about how much she disliked the record. Jackson, on the other hand, pushed to do the song because she loved it so much, and she performed the song as she wanted it to be done, and against the wishes of her producer.\n\nFor all the many, many problematic aspects of the song, which I won't defend at all, that passion does show through in Jackson's performance of it.\n\nJackson's single was released, and did absolutely nothing sales-wise, as was normal for her records at this point. Around this time, she also cut her first album, and included on it a cover version of a song Elvis had recently recorded, \"Party\", which in her version was retitled \"Let's Have a Party\":\n\n[Excerpt: Wanda Jackson, \"Let's Have a Party\"]\n\nThat album also did essentially nothing, and while Jackson continued releasing singles throughout 1958, none of them charted. Ken Nelson didn't even book her in for a single recording session in 1959 -- by that point they'd got enough stuff already recorded that they could keep releasing records by her until her contract ran out, and they didn't need to throw good money after bad by paying for more studio sessions to make records that nobody was going to buy.\n\nAnd then something really strange happened. \"Fujiyama Mama\" became hugely successful in Japan.\n\nNow, nobody seems to have adequately explained quite how this happened. After all, this record was... not exactly flattering about Japanese people, and its first couple of lines seem to celebrate the bombings of Hiroshima and Nagasaki. And it's not as if they didn't know what was being sung. While obviously Jackson was singing in English and most listeners in Japan couldn't speak English, there was a Japanese translation of the lyrics printed on the back sleeve of the single, so most people would at least have had some idea what she was singing about. Yet somehow, the record made number one in Japan.\n\nIn part, this may just have been simply because any recognition of Japanese culture from an American artist at all might have been seen as a novelty. But also, while in the USA pretty much all the rock and roll hits were sung by men, Japan was developing its own rock and roll culture, and in Japan, most of the big rock and roll stars were teenage girls, of around the same age as Wanda Jackson.\n\nNow, I am very far from being an expert on post-war Japanese culture, so please don't take anything I say on the subject as being any kind of definitive statement, but from the stuff I've read (and in particular from a very good, long, article on this particular song that I'm going to link in the liner notes and which I urge you all to read, which goes into the cultural background a lot more than I can here) it seems as if these girls were, for the most part, groomed as manufactured pop stars, and that many of them were recording cover versions of songs in English, which they learned phonetically from the American recordings. For example, here's Izumi Yukimura's version of \"Ko Ko Mo\":\n\n[Excerpt: Izumi Yukimura, \"Ko Ko Mo\"]\n\nIn many of these versions, they would sing a verse in the original English, and then a verse in Japanese translation, as you can again hear in that recording:\n\n[Excerpt: Izumi Yukimura, \"Ko Ko Mo\"]\n\nIzumi Yuklmura also recorded a version of \"Fujiyama Mama\", patterned after Jackson's:\n\n[Excerpt: Izumi Yukimura, \"Fujiyama Mama\"]\n\nThere are many, many things that can be said about these recordings, but the thing that strikes me about them, just as a music listener, and separate from everything else, is how comparatively convincing a rock and roll recording that version of \"Fujiyama Mama\" actually is. When you compare it to the music that was coming out of places like the UK or Australia or France, it's far more energetic, and shows a far better understanding of the idiom.\n\nIt's important to note though that part of the reason for this is the peculiar circumstances in Japan at the time. Much of the Japanese entertainment industry in the late forties and fifties had grown up around the US occupying troops who were stationed there after the end of World War II, and those servicemen were more interested in seeing pretty young girls than in seeing male performers.\n\nBut this meant two things -- it firstly meant that young women were far more likely to be musical performers in Japan than in the US, and it also meant that the Japanese music industry was geared to performers who were performing in American styles -- and so Japanese listeners were accustomed to hearing things like this:\n\n[Excerpt: Chiemi Eri, \"Rock Around the Clock\"]\n\nSo when a recording by a young woman singing about Japan, however offensively, in a rock and roll style, was released in Japan, the market was ready for it. While in America rock and roll was largely viewed as a male music, in Japan, they were ready for Wanda Jackson.\n\nAnd Jackson, in turn, was ready for Japan. In her autobiography she makes clear that she was the kind of person who would nowadays be called a weeb -- having a fascination with Japanese culture, albeit the stereotyped version she had learned from pop culture. She had always wanted to visit Japan growing up, and when she got there she was amazed to find that they were organising a press conference for her, and that wherever she went there were fans wanting her autograph. Jackson, of course, had no idea about the complex relationship that Japan was having at the time with American culture -- though in her autobiography she talks about visiting a bar over there where Japanese singers were performing country songs -- she just knew that they had latched on, for whatever reason, to an obscure B-side and given her a second chance at success.\n\nWhen Jackson got back from Japan, she put together her own band for the first time -- and unusually for country music at the time, it was an integrated band, with a black pianist. She had to deal with some resistance from her mother, who was an older Southern white woman, but eventually managed to win her round.\n\nThat pianist, Big Al Downing, later went on to have his own successful career, including a hit single duetting with Esther Phillips:\n\n[Excerpt Big Al Downing and Little Esther Phillips, \"You'll Never Miss Your Water Until The Well Runs Dry\"]\n\nDowning also had disco hits in the early seventies, and later had a run of hits on the country charts.\n\nJackson also took on a young guitarist named Roy Clark, who would go on to have a great deal of success himself, as one of the most important instrumentalists in country music, and Clark would later co-star in the hit TV show Hee-Haw, with Buck Owens (who had played on many of Jackson's earlier records).\n\nIn 1960, Jackson returned to the studio. While she'd not had much commercial success in the US yet, her records were now selling well enough to justify recording more songs with her. But Ken Nelson had a specific condition for any future recordings -- he pointed out that while she'd been recording both rock and roll and country music in her previous sessions, she had only ever charted in the US as a country artist, and she'd been signed as a country artist to Capitol. All her future sessions were going to be purely country, to avoid diluting her brand.\n\nJackson agreed, and so she went into the studio and recorded a country shuffle, \"Please Call Today\":\n\n[Excerpt: Wanda Jackson, \"Please Call Today\"]\n\nBut a few weeks later she got a call from Ken Nelson, telling her that she was in the charts -- not with \"Please Call Today\", but with \"Party\", the album track she'd recorded three years earlier.\n\nShe was obviously confused by this, but Nelson explained that a DJ in Iowa had taken up the song and used it as the theme song for his radio show. So many people had called the DJ asking about it that he in turn had called Ken Nelson at Capitol and convinced him to put the track out as a single, and it had made the pop top forty.\n\nAs a result, Capitol rushed out an album of her previous rockabilly singles, and then got her back into the studio, with her touring band, to record her first proper rock and roll album -- as opposed to her first album, which was a mixture of country and rock, and her second, which was a compilation of previously-released singles. This album was full of cover versions of rock and roll hits from the previous few years, like Elvis' \"Hard-Headed Woman\", LaVern Baker's \"Tweedle Dee\", and Buddy Holly's \"It Doesn't Matter Any More\". And she also recorded a few rock and roll singles, like a cover version of the Robins' \"Riot in Cell Block #9\".\n\nThose sessions also produced what became Jackson's biggest hit single to that point. At the time, Brenda Lee was a big star, and a friend of Jackson. The two had had parallel careers, and Lee was someone else who straddled the boundaries between rockabilly and country, but at the time she had just had a big hit with \"I'm Sorry\":\n\n[Excerpt: Brenda Lee, \"I'm Sorry\"]\n\nThat was one of the first recordings in what would become known as \"the Nashville Sound\", a style of music that was somewhere between country music and middle-of-the-road pop. Wanda had written a song in that style, and since she was now once again being pushed in a rock and roll direction, she thought she would give it to Lee to record. However, she mentioned the song to Ken Nelson when she was in the studio, and he insisted that she let him hear it -- and once he heard it, he insisted on recording it with her, saying that Brenda Lee had enough hits of her own, and she didn't need Wanda Jackson giving her hers.\n\nThe result was \"Right or Wrong\", which became her first solo country top ten hit, and all of a sudden she had once again switched styles -- she was now no longer Wanda Jackson the rock and roller, but she was Wanda Jackson the Nashville Sound pop-country singer:\n\n[Excerpt: Wanda Jackson, \"Right or Wrong\"]\n\nUnfortunately, Jackson ended up having to give up the songwriting royalties on that record, as she was sued by the company that owned \"Wake the Town and Tell the People\", which had been a hit in 1955 and had an undeniably similar melody:\n\n[Excerpt: Mindy Carson, \"Wake the Town and Tell the People\"]\n\nEven so, her switch to pure country music ended up being good for Jackson. While she would have peaks and troughs in her career, she managed to score another fifteen country top forty hits over the next decade -- although her biggest hit was as a writer rather than a performer, when she wrote \"Kickin' Our Hearts Around\" for Buck Owens, who had played on many of her sessions early in his career before he went on to become the biggest star in country music:\n\n[Excerpt: Buck Owens, \"Kickin' Our Hearts Around\"]\n\nLike almost everything Owens released in the sixties, that went top ten on the country charts.\n\nJackson was a fairly major star in the country field through the sixties, even having her own TV show, but she was becoming increasingly unhappy, and suffering from alcoholism. In the early seventies she and her husband had a religious awakening, and became born-again Christians, and she once again switched her musical style, this time from country music to gospel -- though she would still sing her old secular hits along with the gospel songs on stage.\n\nUnfortunately, Capitol weren't interested in putting out gospel material by her, and she ended up moving to smaller and smaller labels, and by the end of the seventies she was reduced to rerecording her old hits for mail-order compilations put out by K-Tel records.\n\nBut then her career got a second wind. In Europe in the early 1980s there was something of a rockabilly revival, and a Swedish label, Tab Records, got in touch with Jackson and asked her to record a new album of rockabilly music, which led to her touring all over Europe playing to crowds of rockabilly fans.\n\nBy the nineties, American rockabilly revivalists were taking notice of her as well, and Rosie Flores, a rockabilly artist who would later produce Janis Martin's last sessions, invited Jackson to duet with her on a few songs and tour North America with her:\n\n[Excerpt: Wanda Jackson and Rosie Flores, \"His Rockin' Little Angel\"]\n\nIn 2003, she recorded her first new album of secular music for the American market for several decades, featuring several of her younger admirers, like the Cramps and Lee Rocker of the Stray Cats. But the most prominent guest star was Elvis Costello, who duetted with her on a song by her old friend Buck Owens:\n\n[Excerpt: Elvis Costello and Wanda Jackson, \"Crying Time\"]\n\nAfter duetting with her, Costello discovered that she wasn't yet in the rock and roll hall of fame, and started lobbying for her inclusion, writing an open letter that says in part: \"For heaven's sake, the whole thing risks ridicule and having the appearance of being a little boy's club unless it acknowledges the contribution of one of the first women of rock and roll.\n\n“It might be hard to admit, but the musical influence of several male pioneers is somewhat obscure today. Even though their records will always be thrilling, their sound is not really heard in echo. Look around today and you can hear lots of rocking girl singers who owe an unconscious debt to the mere idea of a girl like Wanda. She was standing up on stage with a guitar in her hands and making a sound that was as wild as any rocker, man or woman, while other gals were still asking 'How much is that doggy in the window'\"\n\nThanks in large part to Costello's advocacy, Jackson finally made it into the hall of fame in 2009, and that seems to have spurred another minor boost to her career, as she released two albums in the early part of last decade, produced by young admirers -- one produced by Justin Townes Earle, and the other by Jack White.\n\nJackson has been having some health problems recently, and her husband and manager of fifty-six years died in 2017, so she finally retired from live performance in March last year, but she's apparently still working on a new album, produced by Joan Jett, which should be out soon. With luck, she will have a long and happy retirement.",
  "itunes:subtitle": "Episode sixty-nine of A History of Rock Music in Five Hundred Songs looks at Fujiyama Mama by Wanda Jackson, and the first rock and roller to become big in Japan Click the full post to read liner notes, links to more information, and a transcript of the ",
  "itunes:keywords": "Bakersfield Sound,Buck Owens,country and western,Elvis Costello,Japan,Jerry Lee Lewis,Ken Nelson,lawsuits,Lucky Millinder,Marijohn Wilkin,Nashville,nuclear war,racism,rockabilly,Wanda Jackson,white cover versions",
  "itunes:episodeType": "full",
  "itunes:episode": 69,
  "content:encoded": "Episode sixty-nine of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Fujiyama Mama\" by Wanda Jackson, and the first rock and roller to become \"big in Japan\" Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/33900516\"> on \"Purple People Eater\"</a> by Sheb Wooley.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-69-fujiyama-mama/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI have two main sources for this episode. One is <a href=\"https://amzn.to/2Ml6ppi\">Wanda Jackson's autobiography, <em>Every Night is Saturday Night</em></a>. The other is <a href=\"http://articles.womeninrockproject.org/fujiyama-mama/\">this article on \"Fujiyama Mama\"</a>, which I urge everyone to read, as it goes into far more detail about the reasons why the song had the reception it did in Japan.\n\nAnd <a href=\"https://amzn.to/2Y9Gng3\">this compilation</a> collects most of Jackson's important early work.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nBefore we begin this episode, a minor content note. I am going to be looking at a song that is, unfortunately, unthinkingly offensive towards Japanese people and culture. If that – or flippant lyrics about the bombings of Hiroshima or Nagasaki – are likely to upset you, be warned.\n\nWhen we left Wanda Jackson six months ago, it looked very much like she might end up being a one-hit wonder. \"I Gotta Know\" had been a hit, but there hadn't been a successful follow-up. In part this was because she was straddling two different genres -- she was trying to find a way to be successful in both the rock and roll and country markets, and neither was taking to her especially well.\n\nIn later years, it would be recognised that the music she was making combined some of the best of both worlds -- she was working with a lot of the musicians on the West Coast who would later go on to become famous for creating the Bakersfield Sound, and changing the whole face of country music, and her records have a lot of that sound about them. And at the same time she was also making some extremely hot rockabilly music, but she was just a little bit too country for the rock market, and a little bit too rock for the country market.\n\nPossibly the place where she fit in best was among the Sun records acts, and so it's not surprising that she ended up towards the bottom of the bill on the long tour that Jerry Lee Lewis, Carl Perkins and Johnny Cash did over much of North America in early 1957 -- the tour on which Jerry Lee Lewis moved from third billed to top of the bill by sheer force of personality. But it says quite a bit about Jackson that while everyone else talking about that tour discusses the way that some of the men did things like throwing cherry bombs at each other's cars, and living off nothing but whisky, Wanda's principal recollection of the tour in her autobiography is of going to church and inviting all the men along, but Jerry Lee being the only one who would come with her.\n\nTo a great extent she was shielded from the worst aspects of the men's behaviour by her father, who was still looking after her on the road, and acted as a buffer between her and the worst excesses of her tourmates, but she seems to have been happy with that situation -- she didn't seem to have much desire to become one of the boys, the way many other female rock and roll stars have. She enjoyed making wild-sounding music, but she saw that mostly as a kind of acting -- she didn't think that her onstage persona had to match her offstage behaviour at all.\n\nAnd one of the wildest records she made was \"Fujiyama Mama\":\n\n[Excerpt: Wanda Jackson, \"Fujiyama Mama\"]\n\n\"Fujiyama Mama\" was written by the rockabilly and R&B songwriter Jack Hammer (whose birth name was the more prosaic Earl Burroughs), who is best known as having been the credited co-writer of \"Great Balls of Fire\". We didn't talk about him in the episode on that song, because apparently Hammer's only contribution to the song was the title -- he wrote a totally different song with the same title, which Paul Case, who was the music consultant on the film \"Jamboree\", liked enough to commission Otis Blackwell to write another song of the same name, giving Hammer half the credit.\n\nBut Hammer did write some songs on his own that became at least moderate successes. For example, he wrote \"Rock and Roll Call\", which was recorded by Louis Jordan:\n\n[Excerpt: Louis Jordan, \"Rock and Roll Call\"]\n\nAnd \"Milkshake Mademoiselle\" for Jerry Lee Lewis:\n\n[Excerpt, Jerry Lee Lewis, \"Milkshake Mademoiselle\"]\n\nAnd in 1954, when Hammer was only fourteen, he wrote \"Fujiyama Mama\", which was originally recorded by Annisteen Allen:\n\n[Excerpt: Annisteen Allen, \"Fujiyama Mama\"]\n\nThis was a song in a long line of songs about black women's sexuality which lie at the base of rock and roll, though of course, as with several of those songs, it's written by a man, and it's mostly the woman boasting about how much pleasure she's going to give the man -- while it's a sexually aggressive record, this is very much a male fantasy as performed by a woman.\n\nAllen was yet another singer in the early days of R&B and rock and roll to have come out of Lucky Millinder's orchestra -- she had been his female singer in the late forties, just after Rosetta Tharpe had left the group, and while Wynonie Harris was their male singer. She'd sung lead on what turned out to be Millinder's last big hit, \"I'm Waiting Just For You\":\n\n[Excerpt: Lucky Millinder and his orchestra, \"I'm Waiting Just For You\"]\n\nAfter she left Millinder's band, Allen recorded for a variety of labels, with little success, and when she recorded \"Fujiyama Mama\" in 1954 she was on Capitol -- this was almost unique at the time, as her kind of R&B would normally have come out on King or Apollo or Savoy or a similar small label.\n\nIn its original version, \"Fujiyama Mama\" wasn't a particularly successful record, but Wanda Jackson heard it on a jukebox and fell in love with the record. She quickly learned the song and added it to her own act.\n\nIn 1957, Jackson was in the studio recording a country song called \"No Wedding Bells for Joe\", written by a friend of hers called Marijohn Wilkin, who would later go on to write country classics like \"Long Black Veil\":\n\n[Excerpt: Wanda Jackson, \"No Wedding Bells For Joe\"]\n\nFor the B-side, Jackson wanted to record \"Fujiyama Mama\", but Ken Nelson was very concerned -- the lyrics about drinking, smoking, and shooting were bad enough for a girl who was not yet quite twenty, the blatant female sexuality was not something that would go down well at all in the country market, and lyrics like \"I've been to Nagasaki, Hiroshima too/The things I did to them I can do to you\" were horribly tasteless -- and remember, this was little more than a decade after the bombs were dropped on those cities.\n\nNelson really, really, disliked the song, and didn't want Jackson to record it, and while I've been critical of Nelson for making poor repertoire choices for his artists -- Nelson was someone with a great instinct for performers, but a terrible instinct for material -- I can't say I entirely blame him in this instance.\n\nBut Wanda overruled him -- and then, when he tried to tone down her performance in the studio, she rebelled against that, with the encouragement of her father, who told her \"You're the one who wanted to do it, so you need to do it your way\".\n\nIn the last episode about Jackson, we talked about how she'd tried to do her normal growling roar on \"Hot Dog! That Made Him Mad!\" but was let down by having drunk milk before recording the song. This time, she had no problem, and for the first time in the studio she sang in the voice that she used for her rock and roll songs on stage:\n\n[Excerpt: Wanda Jackson, \"Fujiyama Mama\"]\n\nTo my ears, Jackson's version of the song is still notably inferior to Allen's version, but it's important to note that this isn't a Georgia Gibbs style white person covering a black artist for commercial success at the instigation of her producer, and copying the arrangement precisely, this is a young woman covering a record she loved, and doing it as a B-side. There's still the racial dynamic at play there, but this is closer to Elvis doing \"That's All Right\" than to Georgia Gibbs ripping off LaVern Baker or Etta James.\n\nIt's also closer to Elvis than it is to Eileen Barton, who was the second person to have recorded the song. Barton was a novelty singer, whose biggest hit was \"If I Knew You Were Coming I'd Have Baked a Cake\" from 1950:\n\n[Excerpt: Eileen Barton, \"If I Knew You Were Coming I'd Have Baked a Cake\"]\n\nBarton's version of \"Fujiyama Mama\" was the B-side to a 1955 remake of \"If I Knew You Were Coming I'd Have Baked a Cake\", redone as a blues. I've not actually been able to track down a copy of that remake, so I can't play an excerpt -- I'm sure you're all devastated by that.\n\nBarton's version, far more than Jackson's, was a straight copy of the original, though the arranger on her version gets rid of most of the Orientalisms in Allen's original recording:\n\n[Excerpt: Eileen Barton, \"Fujiyama Mama\"]\n\nI think the difference between Barton's and Jackson's versions simply comes down to their sincerity. Barton hated the song, and thought of it as a terrible novelty tune she was being forced to sing. She did a competent professional job, because she was a professional vocalist, but she would talk later in interviews about how much she disliked the record. Jackson, on the other hand, pushed to do the song because she loved it so much, and she performed the song as she wanted it to be done, and against the wishes of her producer.\n\nFor all the many, many problematic aspects of the song, which I won't defend at all, that passion does show through in Jackson's performance of it.\n\nJackson's single was released, and did absolutely nothing sales-wise, as was normal for her records at this point. Around this time, she also cut her first album, and included on it a cover version of a song Elvis had recently recorded, \"Party\", which in her version was retitled \"Let's Have a Party\":\n\n[Excerpt: Wanda Jackson, \"Let's Have a Party\"]\n\nThat album also did essentially nothing, and while Jackson continued releasing singles throughout 1958, none of them charted. Ken Nelson didn't even book her in for a single recording session in 1959 -- by that point they'd got enough stuff already recorded that they could keep releasing records by her until her contract ran out, and they didn't need to throw good money after bad by paying for more studio sessions to make records that nobody was going to buy.\n\nAnd then something really strange happened. \"Fujiyama Mama\" became hugely successful in Japan.\n\nNow, nobody seems to have adequately explained quite how this happened. After all, this record was... not exactly flattering about Japanese people, and its first couple of lines seem to celebrate the bombings of Hiroshima and Nagasaki. And it's not as if they didn't know what was being sung. While obviously Jackson was singing in English and most listeners in Japan couldn't speak English, there was a Japanese translation of the lyrics printed on the back sleeve of the single, so most people would at least have had some idea what she was singing about. Yet somehow, the record made number one in Japan.\n\nIn part, this may just have been simply because any recognition of Japanese culture from an American artist at all might have been seen as a novelty. But also, while in the USA pretty much all the rock and roll hits were sung by men, Japan was developing its own rock and roll culture, and in Japan, most of the big rock and roll stars were teenage girls, of around the same age as Wanda Jackson.\n\nNow, I am very far from being an expert on post-war Japanese culture, so please don't take anything I say on the subject as being any kind of definitive statement, but from the stuff I've read (and in particular from a very good, long, article on this particular song that I'm going to link in the liner notes and which I urge you all to read, which goes into the cultural background a lot more than I can here) it seems as if these girls were, for the most part, groomed as manufactured pop stars, and that many of them were recording cover versions of songs in English, which they learned phonetically from the American recordings. For example, here's Izumi Yukimura's version of \"Ko Ko Mo\":\n\n[Excerpt: Izumi Yukimura, \"Ko Ko Mo\"]\n\nIn many of these versions, they would sing a verse in the original English, and then a verse in Japanese translation, as you can again hear in that recording:\n\n[Excerpt: Izumi Yukimura, \"Ko Ko Mo\"]\n\nIzumi Yuklmura also recorded a version of \"Fujiyama Mama\", patterned after Jackson's:\n\n[Excerpt: Izumi Yukimura, \"Fujiyama Mama\"]\n\nThere are many, many things that can be said about these recordings, but the thing that strikes me about them, just as a music listener, and separate from everything else, is how comparatively convincing a rock and roll recording that version of \"Fujiyama Mama\" actually is. When you compare it to the music that was coming out of places like the UK or Australia or France, it's far more energetic, and shows a far better understanding of the idiom.\n\nIt's important to note though that part of the reason for this is the peculiar circumstances in Japan at the time. Much of the Japanese entertainment industry in the late forties and fifties had grown up around the US occupying troops who were stationed there after the end of World War II, and those servicemen were more interested in seeing pretty young girls than in seeing male performers.\n\nBut this meant two things -- it firstly meant that young women were far more likely to be musical performers in Japan than in the US, and it also meant that the Japanese music industry was geared to performers who were performing in American styles -- and so Japanese listeners were accustomed to hearing things like this:\n\n[Excerpt: Chiemi Eri, \"Rock Around the Clock\"]\n\nSo when a recording by a young woman singing about Japan, however offensively, in a rock and roll style, was released in Japan, the market was ready for it. While in America rock and roll was largely viewed as a male music, in Japan, they were ready for Wanda Jackson.\n\nAnd Jackson, in turn, was ready for Japan. In her autobiography she makes clear that she was the kind of person who would nowadays be called a weeb -- having a fascination with Japanese culture, albeit the stereotyped version she had learned from pop culture. She had always wanted to visit Japan growing up, and when she got there she was amazed to find that they were organising a press conference for her, and that wherever she went there were fans wanting her autograph. Jackson, of course, had no idea about the complex relationship that Japan was having at the time with American culture -- though in her autobiography she talks about visiting a bar over there where Japanese singers were performing country songs -- she just knew that they had latched on, for whatever reason, to an obscure B-side and given her a second chance at success.\n\nWhen Jackson got back from Japan, she put together her own band for the first time -- and unusually for country music at the time, it was an integrated band, with a black pianist. She had to deal with some resistance from her mother, who was an older Southern white woman, but eventually managed to win her round.\n\nThat pianist, Big Al Downing, later went on to have his own successful career, including a hit single duetting with Esther Phillips:\n\n[Excerpt Big Al Downing and Little Esther Phillips, \"You'll Never Miss Your Water Until The Well Runs Dry\"]\n\nDowning also had disco hits in the early seventies, and later had a run of hits on the country charts.\n\nJackson also took on a young guitarist named Roy Clark, who would go on to have a great deal of success himself, as one of the most important instrumentalists in country music, and Clark would later co-star in the hit TV show Hee-Haw, with Buck Owens (who had played on many of Jackson's earlier records).\n\nIn 1960, Jackson returned to the studio. While she'd not had much commercial success in the US yet, her records were now selling well enough to justify recording more songs with her. But Ken Nelson had a specific condition for any future recordings -- he pointed out that while she'd been recording both rock and roll and country music in her previous sessions, she had only ever charted in the US as a country artist, and she'd been signed as a country artist to Capitol. All her future sessions were going to be purely country, to avoid diluting her brand.\n\nJackson agreed, and so she went into the studio and recorded a country shuffle, \"Please Call Today\":\n\n[Excerpt: Wanda Jackson, \"Please Call Today\"]\n\nBut a few weeks later she got a call from Ken Nelson, telling her that she was in the charts -- not with \"Please Call Today\", but with \"Party\", the album track she'd recorded three years earlier.\n\nShe was obviously confused by this, but Nelson explained that a DJ in Iowa had taken up the song and used it as the theme song for his radio show. So many people had called the DJ asking about it that he in turn had called Ken Nelson at Capitol and convinced him to put the track out as a single, and it had made the pop top forty.\n\nAs a result, Capitol rushed out an album of her previous rockabilly singles, and then got her back into the studio, with her touring band, to record her first proper rock and roll album -- as opposed to her first album, which was a mixture of country and rock, and her second, which was a compilation of previously-released singles. This album was full of cover versions of rock and roll hits from the previous few years, like Elvis' \"Hard-Headed Woman\", LaVern Baker's \"Tweedle Dee\", and Buddy Holly's \"It Doesn't Matter Any More\". And she also recorded a few rock and roll singles, like a cover version of the Robins' \"Riot in Cell Block #9\".\n\nThose sessions also produced what became Jackson's biggest hit single to that point. At the time, Brenda Lee was a big star, and a friend of Jackson. The two had had parallel careers, and Lee was someone else who straddled the boundaries between rockabilly and country, but at the time she had just had a big hit with \"I'm Sorry\":\n\n[Excerpt: Brenda Lee, \"I'm Sorry\"]\n\nThat was one of the first recordings in what would become known as \"the Nashville Sound\", a style of music that was somewhere between country music and middle-of-the-road pop. Wanda had written a song in that style, and since she was now once again being pushed in a rock and roll direction, she thought she would give it to Lee to record. However, she mentioned the song to Ken Nelson when she was in the studio, and he insisted that she let him hear it -- and once he heard it, he insisted on recording it with her, saying that Brenda Lee had enough hits of her own, and she didn't need Wanda Jackson giving her hers.\n\nThe result was \"Right or Wrong\", which became her first solo country top ten hit, and all of a sudden she had once again switched styles -- she was now no longer Wanda Jackson the rock and roller, but she was Wanda Jackson the Nashville Sound pop-country singer:\n\n[Excerpt: Wanda Jackson, \"Right or Wrong\"]\n\nUnfortunately, Jackson ended up having to give up the songwriting royalties on that record, as she was sued by the company that owned \"Wake the Town and Tell the People\", which had been a hit in 1955 and had an undeniably similar melody:\n\n[Excerpt: Mindy Carson, \"Wake the Town and Tell the People\"]\n\nEven so, her switch to pure country music ended up being good for Jackson. While she would have peaks and troughs in her career, she managed to score another fifteen country top forty hits over the next decade -- although her biggest hit was as a writer rather than a performer, when she wrote \"Kickin' Our Hearts Around\" for Buck Owens, who had played on many of her sessions early in his career before he went on to become the biggest star in country music:\n\n[Excerpt: Buck Owens, \"Kickin' Our Hearts Around\"]\n\nLike almost everything Owens released in the sixties, that went top ten on the country charts.\n\nJackson was a fairly major star in the country field through the sixties, even having her own TV show, but she was becoming increasingly unhappy, and suffering from alcoholism. In the early seventies she and her husband had a religious awakening, and became born-again Christians, and she once again switched her musical style, this time from country music to gospel -- though she would still sing her old secular hits along with the gospel songs on stage.\n\nUnfortunately, Capitol weren't interested in putting out gospel material by her, and she ended up moving to smaller and smaller labels, and by the end of the seventies she was reduced to rerecording her old hits for mail-order compilations put out by K-Tel records.\n\nBut then her career got a second wind. In Europe in the early 1980s there was something of a rockabilly revival, and a Swedish label, Tab Records, got in touch with Jackson and asked her to record a new album of rockabilly music, which led to her touring all over Europe playing to crowds of rockabilly fans.\n\nBy the nineties, American rockabilly revivalists were taking notice of her as well, and Rosie Flores, a rockabilly artist who would later produce Janis Martin's last sessions, invited Jackson to duet with her on a few songs and tour North America with her:\n\n[Excerpt: Wanda Jackson and Rosie Flores, \"His Rockin' Little Angel\"]\n\nIn 2003, she recorded her first new album of secular music for the American market for several decades, featuring several of her younger admirers, like the Cramps and Lee Rocker of the Stray Cats. But the most prominent guest star was Elvis Costello, who duetted with her on a song by her old friend Buck Owens:\n\n[Excerpt: Elvis Costello and Wanda Jackson, \"Crying Time\"]\n\nAfter duetting with her, Costello discovered that she wasn't yet in the rock and roll hall of fame, and started lobbying for her inclusion, writing an open letter that says in part: \"For heaven's sake, the whole thing risks ridicule and having the appearance of being a little boy's club unless it acknowledges the contribution of one of the first women of rock and roll.\n\n“It might be hard to admit, but the musical influence of several male pioneers is somewhat obscure today. Even though their records will always be thrilling, their sound is not really heard in echo. Look around today and you can hear lots of rocking girl singers who owe an unconscious debt to the mere idea of a girl like Wanda. She was standing up on stage with a guitar in her hands and making a sound that was as wild as any rocker, man or woman, while other gals were still asking 'How much is that doggy in the window'\"\n\nThanks in large part to Costello's advocacy, Jackson finally made it into the hall of fame in 2009, and that seems to have spurred another minor boost to her career, as she released two albums in the early part of last decade, produced by young admirers -- one produced by Justin Townes Earle, and the other by Jack White.\n\nJackson has been having some health problems recently, and her husband and manager of fifty-six years died in 2017, so she finally retired from live performance in March last year, but she's apparently still working on a new album, produced by Joan Jett, which should be out soon. With luck, she will have a long and happy retirement.",
  "enclosure": "",
  "itunes:summary": "Episode sixty-nine of A History of Rock Music in Five Hundred Songs looks at \"Fujiyama Mama\" by Wanda Jackson, and the first rock and roller to become \"big in Japan\" Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Purple People Eater\" by Sheb Wooley.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI have two main sources for this episode. One is Wanda Jackson's autobiography, Every Night is Saturday Night. The other is this article on \"Fujiyama Mama\", which I urge everyone to read, as it goes into far more detail about the reasons why the song had the reception it did in Japan.\n\nAnd this compilation collects most of Jackson's important early work.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nBefore we begin this episode, a minor content note. I am going to be looking at a song that is, unfortunately, unthinkingly offensive towards Japanese people and culture. If that – or flippant lyrics about the bombings of Hiroshima or Nagasaki – are likely to upset you, be warned.\n\nWhen we left Wanda Jackson six months ago, it looked very much like she might end up being a one-hit wonder. \"I Gotta Know\" had been a hit, but there hadn't been a successful follow-up. In part this was because she was straddling two different genres -- she was trying to find a way to be successful in both the rock and roll and country markets, and neither was taking to her especially well.\n\nIn later years, it would be recognised that the music she was making combined some of the best of both worlds -- she was working with a lot of the musicians on the West Coast who would later go on to become famous for creating the Bakersfield Sound, and changing the whole face of country music, and her records have a lot of that sound about them. And at the same time she was also making some extremely hot rockabilly music, but she was just a little bit too country for the rock market, and a little bit too rock for the country market.\n\nPossibly the place where she fit in best was among the Sun records acts, and so it's not surprising that she ended up towards the bottom of the bill on the long tour that Jerry Lee Lewis, Carl Perkins and Johnny Cash did over much of North America in early 1957 -- the tour on which Jerry Lee Lewis moved from third billed to top of the bill by sheer force of personality. But it says quite a bit about Jackson that while everyone else talking about that tour discusses the way that some of the men did things like throwing cherry bombs at each other's cars, and living off nothing but whisky, Wanda's principal recollection of the tour in her autobiography is of going to church and inviting all the men along, but Jerry Lee being the only one who would come with her.\n\nTo a great extent she was shielded from the worst aspects of the men's behaviour by her father, who was still looking after her on the road, and acted as a buffer between her and the worst excesses of her tourmates, but she seems to have been happy with that situation -- she didn't seem to have much desire to become one of the boys, the way many other female rock and roll stars have. She enjoyed making wild-sounding music, but she saw that mostly as a kind of acting -- she didn't think that her onstage persona had to match her offstage behaviour at all.\n\nAnd one of the wildest records she made was \"Fujiyama Mama\":\n\n[Excerpt: Wanda Jackson, \"Fujiyama Mama\"]\n\n\"Fujiyama Mama\" was written by the rockabilly and R&B songwriter Jack Hammer (whose birth name was the more prosaic Earl Burroughs), who is best known as having been the credited co-writer of \"Great Balls of Fire\". We didn't talk about him in the episode on that song, because apparently Hammer's only contribution to the song was the title -- he wrote a totally differen",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode sixty-nine of A History of Rock Music in Five Hundred Songs looks at \"Fujiyama Mama\" by Wanda Jackson, and the first rock and roller to become \"big in Japan\" Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Purple People Eater\" by Sheb Wooley.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI have two main sources for this episode. One is Wanda Jackson's autobiography, Every Night is Saturday Night. The other is this article on \"Fujiyama Mama\", which I urge everyone to read, as it goes into far more detail about the reasons why the song had the reception it did in Japan.\n\nAnd this compilation collects most of Jackson's important early work.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nBefore we begin this episode, a",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}