{
  "id": "https://bibleinoneyear.org/en/youth/172",
  "title": "Day 172: It’s the Heart that Matters",
  "description": "Proverbs 15:11,13, 1 Kings 8:23,39,54–55,58,61, Acts 14:8–11,14–22,26–27.  Your heart lies ‘open before the Lord’ (Proverbs 15:11)  Only God sees and knows the heart of every human being (1 Kings 8:39)",
  "pubDate": "Tue, 21 Jun 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/172/",
  "itunes:duration": "15:15",
  "guid": "enyouth21062022-172",
  "length": 915.2,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 172: It’s the Heart that Matters",
  "itunes:subtitle": "Proverbs 15:11,13, 1 Kings 8:23,39,54–55,58,61, Acts 14:8–11,14–22,26–27.  Your heart lies ‘open before the Lord’ (Proverbs 15:11)  Only God sees and knows the heart of every human being (1 Kings 8:39)",
  "itunes:summary": "Paul Swala was in prison in Zambia. He was charged with treason. He was accused of being involved in a coup to overthrow the government. While in prison, he did Alpha. He encountered Jesus and cried out for God to save him. He said, ‘The smile came on my face and my heart was filled with peace.’\nExtraordinarily, he was the only one of the group of sixty-nine accused who was acquitted. He told his story, at our Leadership Conference at the Royal Albert Hall. His face radiated the joy of the Lord. He has now been into every prison in Zambia sharing the good news about Jesus Christ and how, even in the direst of situations, Jesus can bring hope and change hearts. He said, ‘I’ve never seen a friend like Jesus.’ God really has filled his heart with joy.\nThe word ‘heart’ appears at least seventeen times in the passages for today. The Hebrew understanding of ‘the heart’ included the emotions, but it also involved the mind, the conscience and the will. It means everything that is going on inside of you.\nAll the men and women whom God chose to use greatly had weaknesses and made mistakes. But God saw that their hearts were turned towards him. It is your heart that matters. Your heart lies ‘open before the Lord’ (Proverbs 15:11). Only God sees and knows the heart of every human being (1 Kings 8:39).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 537
}