{
  "id": "https://bibleinoneyear.org/en/youth/188",
  "title": "Day 188: The Dangers of Pride",
  "description": "Proverbs 16:18–24, 2 Kings 15:1,3–4, Acts 25:23, 26:1–23.  It is the independent spirit that says, ‘I have no need of God ’ Arguably, therefore, it is at the root of all sin",
  "pubDate": "Thu, 07 Jul 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/188/",
  "itunes:duration": "15:24",
  "guid": "enyouth07072022-188",
  "length": 924.21,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 188: The Dangers of Pride",
  "itunes:subtitle": "Proverbs 16:18–24, 2 Kings 15:1,3–4, Acts 25:23, 26:1–23.  It is the independent spirit that says, ‘I have no need of God ’ Arguably, therefore, it is at the root of all sin",
  "itunes:summary": "Back when I was working as a lawyer, I remember a very straightforward case that I thought I was bound to win. I was so confident I decided that it was not worth even bothering to pray about it or commit it to the Lord.\nWhen I stood up to speak, the judge asked me whether I was aware of a case that had changed the law in the last few days. I was not. The result was a very humiliating defeat. As the passage in Proverbs today warns (Proverbs 16:18), pride had come before a fall.\nIn my humiliation, I cried out to God for help. I read the recent case. Then, I wrote an opinion saying I thought the decision was wrong and would be reversed on appeal. Thankfully, it was.\nWe were able to go back to court and win the case. The solicitor, rather than judging me for my mistake, was kind enough to be impressed by the opinion I had written and sent me many more cases. So it became a double lesson; not just about the dangers of pride but also about the extraordinary grace of God and how ‘things work out when you trust in God’ (Proverbs 16:20, MSG).\nI try not to forget the lesson I learnt about the dangers of pride and self-reliance whenever I stand up to speak. I would like to say that I have never made the same mistake again but it is a lesson that I have had to re-learn several times.\nIn English, the word ‘pride’ can have a good sense. For example, we would not say it is wrong for a person to be proud of their children, or to take pride in their work. However, when the Bible talks about pride it means something different from this and has very negative connotations.\nIt means to have an excessively high opinion of one’s own worth or importance; it suggests arrogant or overbearing conduct. It is the independent spirit that says, ‘I have no need of God.’ Arguably, therefore, it is at the root of all sin. How should we respond to the temptation and dangers of pride?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 553
}