{
  "title": "Chopper Rocket Chasers Played “Catch Me if You Can”",
  "link": "https://spectrum.ieee.org/reusable-rockets",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-shot-from-overhead-of-a-helicopter-with-its-rotors-spinning-a-large-cylindrical-object-hangs-from-it-on-a-cable.jpg?id=32041805&width=1245&height=700&coordinates=0%2C179%2C0%2C179\"/><br/><br/><p><strong><em>Update 4 Nov. 2:45 p.m. EDT:</em> </strong><em>Rocket Lab says its launch was successful, but booster recovery was not. It says it lost telemetry signals from the descending first stage during reentry. <br/></em></p><p><em>“As standard procedure, we pull the helicopter from the recovery zone if this happens,” a company spokesperson said.</em></p><p><span></span>“If at first you don’t succeed….” <a href=\"https://spectrum.ieee.org/rocket-booster-rocket-lab\" target=\"_self\">Rocket Lab</a>, the <a href=\"https://www.rocketlabusa.com/\" target=\"_blank\">space launch company</a> with two launchpads on the New Zealand coast, almost did succeed in May at something very difficult: To make its Electron booster reusable (and therefore far less expensive to fly), it tried catching the used first stage—in midair—with a helicopter as it descended by parachute toward the Pacific Ocean.</p><p>It came oh-so-close. On its first try, Rocket Lab’s helicopter successfully snagged the parachute with a hook at the end of a long cable—a remarkable piece of planning and flying. But the pilot, in the company’s <a href=\"https://www.rocketlabusa.com/updates/new-blog-post-8/\" target=\"_blank\">words</a>, “detected different load characteristics than previously experienced in testing,” and let the rocket fall in the water for a ship to recover it. </p><p>So try, try again. Rocket Lab is now making a new recovery attempt, this time with a rocket carrying an atmospheric-research satellite for the <a href=\"https://www.rymdstyrelsen.se/en/swedish-space-industry/swedish-satellites/mats/\" target=\"_blank\">Swedish National Space Agency</a>. If the helicopter can catch and hold onto the booster, it will fly it back to Rocket Lab’s production complex near Auckland for possible reuse. </p><p>“We’re eager to get the helicopter back out there,” said <a href=\"https://www.rocketlabusa.com/about/team/\" target=\"_blank\">Peter Beck</a>, Rocket Lab’s CEO and founder. </p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\" View looking down from a helicopter as it approached Electron rocket booster, descending by parachute. A yellow cable at left has a large hook at the end.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"bd50e731d7c11896cf3f44ff9b7d3171\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"fba11\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/view-looking-down-from-a-helicopter-as-it-approached-electron-rocket-booster-descending-by-parachute-a-yellow-cable-at-left-h.jpg?id=32041829&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">During Rocket Lab’s launch on 2 May 2022, the helicopter was able to catch the Electron rocket booster, but load issues forced the pilot to let the rocket fall to the water.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Rocket Lab</small></p><p>“No changes since the May recovery,” said <a href=\"https://www.rocketlabusa.com/about/team/\" rel=\"noopener noreferrer\" target=\"_blank\">Morgan Bailey</a> of Rocket Lab in an email to <em>IEEE Spectrum</em>, “but our team has carried out a number of capture rehearsals with test stages in preparation for this launch.”</p><p>Satellite operators are watching closely because, after Elon Musk’s <a href=\"https://spectrum.ieee.org/tag/spacex\" target=\"_blank\">SpaceX</a>, Rocket Lab has established itself as a contender in space launches, especially for companies and government agencies with smaller payloads. This is its 32nd Electron launch since 2017. “They’ve become a major player,” said <a href=\"https://www.spacecapital.com/team\" target=\"_blank\">Chad Anderson</a> of Space Capital, a venture capital firm.</p><p>Many of the world’s launch bases have historically been near the ocean for good reason: If rockets failed, open water is a relatively safe place for debris to fall. That’s why the United States uses coastal Florida and California, and the European Space Agency uses Kourou, French Guiana, on the northern coast of South America. Rocket Lab started in New Zealand and is expanding to the Virginia coast. </p><p>The downside is that saltwater and rocket hardware don’t mix very well; the water is corrosive, and cleanup is expensive. SpaceX goes to great lengths to land its boosters on barges or back at Cape Canaveral; Rocket Lab, whose boosters are smaller, can change its commercial space business dramatically if helicopter recoveries become routine. </p><p>The name of the mission for its <a href=\"https://spectrum.ieee.org/rocket-booster-rocket-lab\" target=\"_blank\">first booster-recovery attempt</a> was a playful “There and Back Again”; the second, suggested by an American space enthusiast, is “Catch Me if You Can.”</p><p>Here’s the plan: The Electron rocket, 18 meters tall, lifts off over the southern Pacific, aiming to place the satellite in a sun-synchronous orbit 585 kilometers high. The first stage, which made up 80 percent of the vehicle’s mass at launch, burns out after the first 70 km. Two minutes and 32 seconds into the flight, it drops off, following a long arc that, on past flights, would have sent it crashing into the ocean, about 280 km downrange. </p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Photo-illustration of a helicopter, a booster attached to a parachute and a ship in the distance.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"6e9d1b29a9c81d8d4764839068465c55\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"5072f\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/photo-illustration-of-a-helicopter-a-booster-attached-to-a-parachute-and-a-ship-in-the-distance.jpg?id=32041811&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">This artist's conception envisions the helicopter, having successfully snagged the booster's parachute, carrying it back to dry land. A recovery ship is on standby. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Rocket Lab</small></p><p>But Rocket Lab has equipped it with heat shielding, a guidance computer and control thrusters, protecting and steering it as it falls tailfirst at up to 8,300 kilometers per hour. Temperatures reach 2,400 °C as it’s slowed by the thickening air around it. </p><p>At an altitude of 13 km a small <a href=\"https://en.wikipedia.org/wiki/Drogue_parachute\" target=\"_blank\">drogue parachute</a> is deployed, followed by a main chute less than a minute later. They slow the booster’s descent to about 36 km/h. </p><p>The helicopter, a Sikorsky S-92, is waiting in the landing zone, trailing a grappling hook on a long cable. If all goes well, the helicopter flies over the descending rocket and snags the parachute cables about 2,000 meters above the ocean’s surface. Then it flies back to land with the rocket hanging underneath.</p><p>“The main advantage of air capture is that we’re not cleaning salt water out of it,” said Rocket Lab’s Bailey in an earlier interview. “We’re still in the test phase part of the program, and in terms of time and cost savings, that’ll be determined.” </p><p>But engines recovered from the ocean after previous launches have been refurbished and test-fired successfully, says Rocket Lab. Like many engineering efforts, it’s a step at a time.</p><p>“Being able to refly Electron without too much rework is the aim of the game,” says the company. “If we can achieve high level performance with engine parts recovered from the ocean, imagine what we can do with returned dry engines.”</p>",
  "pubDate": "Fri, 04 Nov 2022 14:08:46 +0000",
  "guid": "https://spectrum.ieee.org/reusable-rockets",
  "category": [
    "Space flight",
    "Rockets",
    "Aerospace",
    "Satellites",
    "Business",
    "Rocket launch"
  ],
  "dc:creator": "Ned Potter",
  "media:content": ""
}