{
  "itunes:episode": 75,
  "title": "Live in Portland: Book Reading and The Doubleclicks",
  "pubDate": "Thu, 15 May 2014 15:04:24 +0000",
  "link": "http://newdisrupt.org/blog/2014/5/15/live-in-portland-book-with-the-doubleclicks-episode-75",
  "description": "<p>Listen in as <a href=\"http://www.thedoubleclicks.com/\">The Doubleclicks</a>, a geeky two-sister band, perform four songs, and four authors read parts of their reported features from <em><a href=\"http://the-magazine.com/book\">The Magazine: The Book</a></em> at our last live book event in Portland, Oregon. The event was held at Reading Frenzy, and features <a href=\"http://www.jppullen.com/\">John Patrick Pullen</a>, <a href=\"http://alisonhallett.com/\">Alison Hallett</a>, <a href=\"http://chrishiggins.com/\">Chris Higgins</a>, and <a href=\"http://takingthelane.com/\">Elly Blue</a>.</p>\n\n<b>Sponsors & patrons</b>\n\n<p>We're sponsored this week by <a href=\"http://cardsagainsthumanity.com/\">Cards Against Humanity</a>, which just launched a site where you can buy directly from them, including their Bigger Blacker Box and their 2012 and 2013 holiday packs, the profits from which are donated to charity.</p>\n\n<b>Show notes</b>\n\n<p>Chloe Eudaly owns the bookstore <em><a href=\"http://www.readingfrenzy.com/\">Reading Frenzy</a></em>. It <a href=\"https://www.kickstarter.com/projects/947849256/reading-frenzy-relaunch\">raised over $50,000 via Kickstarter</a> to move its store after losing its downtown lease and then having a space fall though. If you visit Portland, you have to stop by.</p>\n\n<p><a href=\"http://waxy.org/\">Andy Baio</a> is one of the fellows behind the <a href=\"http://2014.xoxofest.com/\">XOXO festival</a>, and is in the middle of <a href=\"https://www.kickstarter.com/projects/waxpancake/the-return-of-upcomingorg\">fundraising</a> the return of <a href=\"http://upcoming.org/\">Upcoming</a>, a site he co-developed, sold to Yahoo, and recently bought back.</p>\n\n<p>John Patrick Pullen read from \"<a href=\"http://the-magazine.com/21/a-beacon-of-hope\">Beacon of Hope</a>.\" Alison Hallett read from \"<a href=\"http://the-magazine.com/23/what-lies-beneath\">What Lies Beneath</a>.\" Elly Blue read from \"<a href=\"http://the-magazine.com/19/hub-and-spoke\">Hub and Spoke</a>.\" And Chris Higgins read (the footnotes) from \"<a href=\"http://the-magazine.com/7/playing-to-lose\">Playing to Lose</a>.\"</p>\n\n<p>The Doubleclicks performed four songs for us: \"Worst Superpower Ever,\" \"Oh, Mr. Darcy,\" \"Impostor,\" and \"Velociraptor.\" They were <a href=\"http://newdisrupt.org/blog/2014/2/27/64-sisters-are-doin-it-for-themselves-the-doubleclicks\">guests on this podcast</a> in February 2014.</p>\n",
  "guid": "tag:soundcloud,2010:tracks/149616374",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:02:09",
  "itunes:subtitle": "Listen in as The Doubleclicks, a geeky two-sister band, perform four songs, and four authors read parts of their reported features from The Magazine: The Book at our last live book event in Portland, Oregon.",
  "itunes:summary": "Listen in as The Doubleclicks, a geeky two-sister band, perform four songs, and four authors read parts of their reported features from The Magazine: The Book at our last live book event in Portland, Oregon. The event was held at Reading Frenzy, and features John Patrick Pullen, Alison Hallett, Chris Higgins, and Elly Blue."
}