{
  "title": "Intel to Drop Celeron and Pentium Branding From Laptop Parts In 2023",
  "dc:creator": "Ryan Smith",
  "description": " <p align=\"center\"><a href=\"https://www.anandtech.com/show/17579/intel-to-drop-celeron-and-pentium-branding-from-laptop-parts-in-2023\"><img src=\"https://images.anandtech.com/doci/17579/Intel_Inside_575px.jpg\" alt=\"\" /></a></p><p><p>While we&rsquo;re still over a quarter out from the end of 2022, Intel already has its eyes aimed at 2023 and its eventual refresh of its mobile processors. To that end, today the company has announced that they are making some branding changes for the low-end.</p>\n\n<p>Starting in 2023, Intel will be retiring the Pentium and Celeron brands for laptop processors. In its place, Intel will have a singular &ldquo;Intel Processor&rdquo; brand for the low end of the market, while the Core branding (with its multiple tiers) will remain in place for the rest of Intel&rsquo;s mobile product stack.</p>\n\n<div style=\"background:#eee;border:1px solid #ccc;padding:5px 10px;\">\n<p><em>&ldquo;Whether for work or play, the importance of the PC has only become more apparent as the torrid pace of technological development continues to shape the world. Intel is committed to driving innovation to benefit users, and our entry-level processor families have been crucial for raising the PC standard across all price points. The new Intel Processor branding will simplify our offerings so users can focus on choosing the right processor for their needs.&rdquo;</em></p>\n\n<p>-Josh Newman, Intel vice president and interim general manager of Mobile Client Platforms</p>\n</div>\n\n<p>Notably, this change only applies to future laptop parts. At this point Intel is not announcing a change for desktop parts or embedded parts. But with that said, I would not be the least bit surprised if these change ultimately came to desktops as well, as mobile is effectively Intel&rsquo;s leading consumer market segment these days. So technology and names tend to percolate up to the desktop segment, keeping the two in sync.</p>\n\n<p>Intel&rsquo;s current generation Pentium and Celeron offerings are both based on Alder Lake-U processors with a single performance core and four (one block of) efficiency cores. The only differences between these SKUs, besides price, is clockspeeds &ndash; specifically, that the Celeron parts lack turbo. So if Intel is going to pursue a similar strategy in future generations, then it&rsquo;s not outlandish to fold two similar products under a single brand. Though the decision to forgo any kind of specific branding is an unusual one for Intel.</p>\n\n<p>With that said, there&rsquo;s also been a notable absence of &ldquo;pure&rdquo; Atom parts in this segment in this generation. Intel has yet to produce a true entry-level part using its Gracemont Atom cores; so everything below the Alder Lake Pentiums/Celerons has been the last-generation Tremont Atoms. So larger changes may be afoot for Intel&rsquo;s cheapest laptop product segment.</p>\n</p>",
  "link": "https://www.anandtech.com/show/17579/intel-to-drop-celeron-and-pentium-branding-from-laptop-parts-in-2023",
  "pubDate": "Fri, 16 Sep 2022 21:15:00 EDT",
  "guid": "tag:www.anandtech.com,17579:news",
  "category": " CPUs"
}