{
  "title": "#92/Modernism Week 2019: Remembering Craig Ellwood with Erin Ellwood, Jim Tyler, Barton Jahncke, Maria Demopoulos",
  "pubDate": "Mon, 01 Apr 2019 07:00:00 +0000",
  "guid": "ebf2f75d9b6346288818410899e6340b",
  "link": "https://traffic.libsyn.com/secure/usmodernist/USM_92_-_PS_-_Ellwood.mp3",
  "itunes:image": "",
  "description": "<p><span class=\"auto-style8\">Palm Springs has a huge architecture event called Modernism Week every February.  It’s a fascinating array of architecture, lectures, parties, tours, exhibits, and the occasional plastic surgery gone awry.  Host <strong>George Smart</strong> was there earlier this year talking with nearly all the speakers, authors, and special guests who make the week (actually 11 days) a blast!</span></p> <p><span class=\"auto-style8\"><strong>Craig Ellwood</strong> <span class=\"auto-style18\">was one of the most exciting people in American architecture. He took Los Angeles by storm and no one since has fully captured his personal style or his incredible story - but that's on the way.</span></span> <span class= \"auto-style8\">Although he took structural engineering courses at UCLA, Ellwood was not a licensed architect, but that did not matter to him or to his clients. Ellwood was a true design genius. Ellwood could sell, too.  He had a red Ferrari (among other great cars) and was a perfect fit with the celebrity culture of Los Angeles. He was a master of promotion. Derided by the architecture profession of which he was formally not a part, he rose to public fame when three of his houses were included in the iconic Case Study House series of Arts and Architecture Magazine. His houses are still incredibly prized today. </span></p> <p><span class=\"auto-style8\">From poolside at the swanky Hotel Skylark, Host <strong>George Smart</strong> interviews</span> <span class=\"auto-style8\">Ellwood’s daughter, <strong>Erin Ellwood</strong>; his partner, architect <strong>Jim Tyler</strong>; producer <strong>Maria Demopoulos</strong> who’s working on a new feature film about Ellwood, and expert Ellwood restorer <strong>Barton Jahncke,</strong> who has brought more than one ailing house gloriously back to life.</span></p>",
  "content:encoded": "<p>Palm Springs has a huge architecture event called Modernism Week every February.  It’s a fascinating array of architecture, lectures, parties, tours, exhibits, and the occasional plastic surgery gone awry.  Host George Smart was there earlier this year talking with nearly all the speakers, authors, and special guests who make the week (actually 11 days) a blast!</p> <p>Craig Ellwood was one of the most exciting people in American architecture. He took Los Angeles by storm and no one since has fully captured his personal style or his incredible story - but that's on the way. Although he took structural engineering courses at UCLA, Ellwood was not a licensed architect, but that did not matter to him or to his clients. Ellwood was a true design genius. Ellwood could sell, too.  He had a red Ferrari (among other great cars) and was a perfect fit with the celebrity culture of Los Angeles. He was a master of promotion. Derided by the architecture profession of which he was formally not a part, he rose to public fame when three of his houses were included in the iconic Case Study House series of Arts and Architecture Magazine. His houses are still incredibly prized today. </p> <p>From poolside at the swanky Hotel Skylark, Host George Smart interviews Ellwood’s daughter, Erin Ellwood; his partner, architect Jim Tyler; producer Maria Demopoulos who’s working on a new feature film about Ellwood, and expert Ellwood restorer Barton Jahncke, who has brought more than one ailing house gloriously back to life.</p>",
  "enclosure": "",
  "itunes:duration": "32:01",
  "itunes:explicit": false,
  "itunes:keywords": "Art,Jim,Craig,Tyler,la,Los,angeles,architecture,Erin,maria,barton,modernism,ellwood,demopoulos",
  "itunes:subtitle": "Palm Springs has a huge architecture event called Modernism Week every February.  It’s a fascinating array of architecture, lectures, parties, tours, exhibits, and the occasional plastic surgery gone awry.  Host George Smart was there...",
  "itunes:episodeType": "full",
  "itunes:author": "george smart"
}