{
  "id": "https://bibleinoneyear.org/en/youth/253",
  "title": "Day 253: Peace in the Dark Places",
  "description": "Psalm 106:32–33a,35–36, Isaiah 25:6,8, 26:3–4, 2 Corinthians 11:17–18,21–23,27,30.  Yet as we read the Bible, it is clear that this promise of ‘perfect peace’ is not dependent on circumstances  God’s peace comes to you even in the dark places – in the midst of your most difficult struggles and challenges",
  "pubDate": "Sat, 10 Sep 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/253/",
  "itunes:duration": "14:37",
  "guid": "enyouth10092022-253",
  "length": 877.98,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 253: Peace in the Dark Places",
  "itunes:subtitle": "Psalm 106:32–33a,35–36, Isaiah 25:6,8, 26:3–4, 2 Corinthians 11:17–18,21–23,27,30.  Yet as we read the Bible, it is clear that this promise of ‘perfect peace’ is not dependent on circumstances  God’s peace comes to you even in the dark places – in the midst of your most difficult struggles and challenges",
  "itunes:summary": "‘Men don’t come much tougher than daredevil climber and adventurer, Bear Grylls,’ writes the Sun newspaper. A former member of the UK Special Forces, his TV adventure series Man vs. Wild has reached an estimated 1.2 billion viewers in over 180 countries.\nNot being remotely adventurous or daring myself, as I read his autobiography, Mud, Sweat and Tears, I was spellbound, gripped and horrified by his sheer physical and mental endurance. He has survived the SAS, a broken back from a parachute jump, climbing Mount Everest, the French Foreign Legion and a variety of other extraordinary challenges.\nOne of the things I appreciated about reading Bear’s autobiography was his refreshing openness about his struggles, both inward and outward. With admirable vulnerability, he reveals his anxieties, fear of heights and sense of weakness. Through it all his strong Christian faith shines through. He writes, ‘Faith in Christ has been the great empowering presence in my life, helping me walk strong when so often I feel so weak.’\nIn the midst of life’s difficulties and extraordinary challenges, Christ is the empowering presence who brings us peace.\n‘Perfect peace’ (Isaiah 26:3) makes me think of a beautiful, calm summer’s day, sitting by a deserted lake with not a care in the world and no temptations, no problems and no difficulties to cope with. ‘Perfect peace’ in such circumstances would not be at all surprising or extraordinary. Yet as we read the Bible, it is clear that this promise of ‘perfect peace’ is not dependent on circumstances. God’s peace comes to you even in the dark places – in the midst of your most difficult struggles and challenges.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 618
}