{
  "title": "To infinity and beyond: the European space sector and industrial policy",
  "link": "https://audioboom.com/posts/7834555",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2040,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>This is a very special moment for space exploration. The beginning of April will see the maiden flight of the first helicopter to another planet. The Artemis accords will mean that man will be back on the moon before long. The European Space Agency is building Daedalus, the first robot that will crawl inside lunar caves. The United Arab Emirates and India have successfully entered Mars’ orbit on their first try. Elon Musk has just stated that he will land his starship there before 2030.<br>\n<br>\n\n</div>\n<div>We are in the midst of a new space race, this time not as a proxy of the Cold War of the 60s, but as a multiplication of the actors, both private as well as state actors across the globe enter the realm of space.<br>\n<br>\n\n</div>\n<div>This week, <a href=\"https://www.bruegel.org/author/giuseppe-porcaro/\">Giuseppe Porcaro</a> host of The Sound of Economics (and self acclaimed 'space geek') and <a href=\"https://www.bruegel.org/author/reinhilde-veugelers/\">Reinhilde Veugelers</a>, senior fellow at Bruegel, have the pleasure of hosting <a href=\"https://www.bruegel.org/author/michel-praet/\">Michel Praet</a>, Head of the European Space Agency (ESA)’s Brussels Office, <a href=\"https://www.bruegel.org/author/jerome-bequignon/\">Jérôme Béquignon</a> and<a href=\"https://www.bruegel.org/author/eleni-paliouras/\"> Eleni Paliouras</a>, also from ESA’s EU Relations Office for this episode. They discuss the position of the European Space sector in this brave new world, what the consequences are for industrial and innovation policy, and also take a closer look at the institutional set up which should foster this innovation.<br>\n<br>\n\n</div>\n<div>A <a href=\"https://www.bruegel.org/wp-content/uploads/2021/03/The-Sound-of-Economics-transcript-Space.pdf\">transcription</a> is available for this episode.<br>\n<br>\n\n</div>\n<div>\n<strong>Disclaimer:<br>\n</strong><br>\n\n</div>\n<div>Due to the COVID-19 pandemic, all our podcasts are recorded remotely. We apologise in advance for the sound quality and thank you for your understanding.<br>\n<br>\n\n</div>\n",
  "itunes:summary": "Where does Europe stand in the global race for space?",
  "pubDate": "Wed, 31 Mar 2021 13:23:21 +0000",
  "guid": "tag:audioboom.com,2021-03-31:/posts/7834555",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}