{
  "title": "Episode 141: &#8220;River Deep, Mountain High&#8221; by Ike and Tina Turner",
  "link": "https://500songs.com/podcast/episode-141-river-deep-mountain-high-by-ike-and-tina-turner/",
  "pubDate": "Sun, 16 Jan 2022 23:58:22 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1007",
  "description": "Episode 141 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “River Deep Mountain High'”, and at the career of Ike and Tina Turner.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nAlso, this episode was recorded before the sad death of the great Ronnie Spector, whose records are featured a couple of times in this episode, which is partly about her abusive ex-husband. Her life paralleled Tina Turner's quite closely, and if you haven't heard the episode I did about her last year, you can find it at <a href=\"https://500songs.com/podcast/episode-110-be-my-baby-by-the-ronettes/\">https://500songs.com/podcast/episode-110-be-my-baby-by-the-ronettes/</a>. I wish I'd had the opportunity to fit a tribute into this episode too.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/61251049\">on \"Wild Thing\" by the Troggs</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, all the songs excerpted in the podcast can be heard in full at <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-141-river-deep-mountain-high/\">Mixcloud</a>.\n\n<a href=\"https://amzn.to/325o24w\">Always Magic in the Air: The Bomp and Brilliance of the Brill Building Era</a> by Ken Emerson is a good overview of the Brill Building scene, and I referred to it for the material about Jeff Barry and Ellie Greenwich.\n\nI’ve referred to two biographies of Phil Spector in this episode, <a style=\"font-size: revert;\" href=\"https://amzn.to/35C05CU\"><em>Phil Spector: Out of His Head</em> by Richard Williams</a> and <a style=\"font-size: revert;\" href=\"https://amzn.to/32OKWMK\"><em>He’s a Rebel</em> by Mark Ribkowsky</a>.\n\nTina Turner has written two autobiographies. <a href=\"https://amzn.to/3Khvv40\"><em>I Tina</em></a> is now out of print but is slightly more interesting, as it contains interview material with other people in her life. <a href=\"https://amzn.to/3GAaPC5\"><em>My Love Story</em></a> is the more recent one and covers her whole life up to 2019.\n\nIke Turner's autobiography <a href=\"https://amzn.to/3FBj2EJ\"><em>Takin' Back My Name</em></a> is a despicable, self-serving, work of self-justification, and I do not recommend anyone buy or read it. But I did use it for quotes in the episode so it goes on the list.\n\n<a href=\"https://amzn.to/3FBj2EJ\"><em>Ike Turner: King of Rhythm</em></a> by John Collis is more even-handed, and contains a useful discography.\n\n<em><a href=\"https://amzn.to/3fwzGuE\">That Kat Sure Could Play!</a> </em>is a four-CD compilation of Ike Turner's work up to 1957.\n\nThe TAMI and Big TNT shows are available on a <a href=\"https://amzn.to/33J0Vze\">Blu-Ray</a> containing both performances.\n\nThere are many compilations available with some of the hits Spector produced, but I recommend getting<a href=\"https://amzn.to/3lOXT0V\"> <em>Back to Mono</em></a>, a four-CD overview of his career containing all the major singles put out by Philles.\n\nThere are sadly no good compilations of Ike and Tina Turner's career, as they recorded for multiple labels, and would regularly rerecord the hits in new versions for each new label, so any compilation you find will have the actual hit version of one or two tracks, plus a bunch of shoddy remakes. However, the hit version of \"River Deep, Mountain High\" is on <a href=\"https://amzn.to/33G1AS4\">the album of the same name</a>, which is a worthwhile album to get,.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday's episode is unfortunately another one of those which will require a content warning, because we're going to be talking about Ike and Tina Turner. For those of you who don't know, Ike Turner was possibly the most famously abusive spouse in the whole history of music, and it is literally impossible to talk about the duo's career without talking about that abuse. I am going to try not to go into too many of the details -- if nothing else, the details are very readily available for those who want to seek them out, not least in Tina's two autobiographies, so there's no sense in retraumatising people who've experienced domestic abuse by going over them needlessly -- but it would be dishonest to try to tell the story without talking about it at all.\n\nThis is not going to be an episode *about* Ike Turner's brutal treatment of Tina Turner -- it's an episode about the record, and about music, and about their musical career -- but the environment in which \"River Deep, Mountain High\" was created was so full of toxic, abusive, destructive men that Ike Turner may only be the third-worst person credited on the record, and so that abuse will come up. If discussion of domestic abuse, gun violence, cocaine addiction, and suicide attempts are likely to cause you problems, you might want to read the transcript rather than listen to the podcast.\n\nThat said, let's get on with the story.\n\nOne of the problems I'm hitting at this point of the narrative is that starting with \"I Fought the Law\" we've hit a run of incredibly intertangled stories  The three most recent episodes, this one, and nine of the next twelve, all really make up one big narrative about what happened when folk-rock and psychedelia hit the Hollywood scene and the Sunset Strip nightclubs started providing the raw material for the entertainment industry to turn into pop culture. We're going to be focusing on a small number of individuals, and that causes problems when trying to tell a linear narrative, because people don't live their lives sequentially -- it's not the case that everything happened to Phil Spector, and *then* everything happened to Cass Elliot, and *then* everything happened to Brian Wilson. All these people were living their lives and interacting and influencing each other, and so sometimes we'll have to mention something that will be dealt with in a future episode.\n\nSo I'll say here and now that we *will* be doing an episode on the Lovin' Spoonful in two weeks. So when I say now that in late 1965 the Lovin' Spoonful were one of the biggest bands around, and possibly the hottest band in the country, you'll have to take that on trust.\n\nBut they were, and in late 1965 their hit \"Do You Believe in Magic?\" had made the top ten:\n\n[Excerpt: The Lovin' Spoonful, \"Do You Believe in Magic?\"]\n\nPhil Spector, as always, was trying to stay aware of the latest trends in music, and he was floundering somewhat. Since the Beatles had hit America in 1964, the hits had dried up -- he'd produced a few minor hit records in 1964, but the only hits he'd made in 1965 had been with the Righteous Brothers -- none of his other acts were charting. And then the Righteous Brothers left him, after only a year. In late 1965, he had no hit acts and no prospect of having any.\n\nThere was only one thing to do -- he needed to start making his own folk-rock records. And the Lovin' Spoonful gave him an idea how to do that. Their records were identifiably coming from the same kind of place as people like the Byrds or the Mamas and the Papas, but they were pop songs, not protest songs -- the Lovin' Spoonful weren't doing Dylan covers or anything intellectual, but joyous pop confections of a kind that anyone could relate to. Spector knew how to make pop records like that.\n\nBut to do that, he needed a band. Even though he had been annoyed at the way that people had paid more attention to the Righteous Brothers, as white men, than they had to the other vocalists he'd made hit records with (who, as Black women, had been regarded by a sexist and racist public as interchangeable puppets being controlled by a Svengali rather than as artists in their own right), he knew he was going to have to work with a group of white male vocalist-instrumentalists if he wanted to have his own Lovin' Spoonful. And the group he chose was a group from Greenwich Village called MFQ.\n\nMFQ had originally named themselves the Modern Folk Quartet, as a parallel to the much better-known Modern Jazz Quartet, and consisted of Cyrus Faryar, Henry Diltz, Jerry Yester, and Chip Douglas, all of whom were multi-instrumentalists who would switch between guitar, banjo, mandolin, and bass depending on the song. They had combined Kingston Trio style clean-cut folk with Four Freshmen style modern harmonies -- Yester, who was a veteran of the New Christy Minstrels, said of the group's vocals that \"the only vocals that competed with us back then was Curt Boettcher's group\", and  they had been taken under the wing of manager Herb Cohen, who had got them a record deal with Warner Brothers.\n\nThey recorded two albums of folk songs, the first of which was produced by Jim Dickson, the Byrds' co-manager:\n\n[Excerpt: The Modern Folk Quartet, \"Sassafras\"]\n\nBut after their second album, they had decided to go along with the trends and switch to folk-rock. They'd started playing with electric instruments, and after a few shows where John Sebastian, the lead singer of the Lovin' Spoonful, had sat in with them on drums, they'd got themselves a full-time drummer, \"Fast\" Eddie Hoh, and renamed themselves the Modern Folk Quintet, but they always shortened that to just MFQ.\n\nSpector was convinced that this group could be another Lovin' Spoonful if they had the right song, and MFQ in turn were eager to become something more than an unsuccessful folk group. Spector had the group rehearsing in his house for weeks at a stretch before taking them into the studio.\n\nThe song that Spector chose to have the group record was written by a young songwriter he was working with named Harry Nilsson. Nilsson was as yet a complete unknown, who had not written a hit and was still working a day job, but he had a talent for melody, and he also had a unique songwriting sensibility combining humour and heartbreak. For example, he'd written a song that Spector had recorded with the Ronettes, \"Here I Sit\", which had been inspired by the famous graffito from public toilet walls -- \"Here I sit, broken-hearted/Paid a dime and only farted\":\n\n[Excerpt: The Ronettes, \"Here I Sit\"]\n\nThat ability to take taboo bodily functions and turn them into innocent-sounding love lyrics is also at play in the song that Spector chose to have the MFQ record. \"This Could be the Night\" was written by Nilsson from the perspective of someone who is hoping to lose his virginity -- he feels like he's sitting on dynamite, and he's going to \"give her some\", but it still sounds innocent enough to get past the radio censors of the mid-sixties:\n\n[Excerpt: Harry Nilsson, \"This Could Be the Night (demo)\"]\n\nSpector took that song, and recorded a version of it which found the perfect balance between Spector's own wall of sound and the Lovin' Spoonful's \"Good Time Music\" sound:\n\n[Excerpt: MFQ, \"This Could be the Night\"]\n\nBrian Wilson was, according to many people, in the studio while that was being recorded, and for decades it would remain a favourite song of Wilson's -- he recorded a solo version of it in the 1990s, and when he started touring solo for the first time in 1998 he included the song in his earliest live performances. He also tried to record it with his wife's group, American Spring, in the early 1970s, but was unable to, because while he could remember almost all of the song, he couldn't get hold of the lyrics.\n\nAnd the reason he couldn't get hold of the lyrics is that the record itself went unreleased, because Phil Spector had found a new performer he was focusing on instead.\n\nIt happened during the filming of the Big TNT Show, a sequel to the TAMI Show, released by American International Pictures, for which \"This Could Be the Night\" was eventually used as a theme song. The MFQ were actually performers at the Big TNT Show, which Spector was musical director and associate producer of, but their performances were cut out of the finished film, leaving just their record being played over the credits.\n\nThe Big TNT Show generally gets less respect than the TAMI Show, but it's a rather remarkable document of the American music scene at the very end of 1965, and it's far more diverse than the TAMI show. It opens with, of all people, David McCallum -- the actor who played Ilya Kuryakin on The Man From UNCLE -- conducting a band of session musicians playing an instrumental version of \"Satisfaction\":\n\n[Excerpt: David McCallum, \"Satisfaction\"]\n\nAnd then, in front of an audience which included Ron and Russel Mael, later of Sparks, and Frank Zappa, who is very clearly visible in audience shots, came performances of every then-current form of popular music. Ray Charles, Petula Clark, Bo Diddley, the Byrds, the Lovin' Spoonful, Roger Miller, the Ronettes, and Donovan all did multiple songs, though the oddest contribution was from Joan Baez, who as well as doing some of her normal folk repertoire also performed \"You've Lost That Lovin' Feelin'\" with Spector on piano:\n\n[Excerpt: Joan Baez and Phil Spector, \"You've Lost That Lovin' Feelin'\"]\n\nBut the headline act on the eventual finished film was the least-known act on the bill, a duo who had not had a top forty hit for four years at this point, and who were only on the bill as a last-minute fill-in for an act who dropped out, but who were a sensational live act. So sensational that when Phil Spector saw them, he knew he needed to sign them -- or at least he needed to sign one of them:\n\n[Excerpt: Ike and Tina Turner with the Ikettes, \"Please, Please, Please\"]\n\nBecause Ike and Tina Turner's performance at the Big TNT Show was, if anything, even more impressive than James Brown's performance on the TAMI Show the previous year.\n\nThe last we saw of Ike Turner was way back in episode eleven. If you don't remember that, from more than three years ago, at the time Turner was the leader of a small band called the Kings of Rhythm. They'd been told by their friend B.B. King that if you wanted to make a record, the person you go to was Sam Phillips at Memphis Recording Services, and they'd recorded \"Rocket '88\", often cited as the first ever rock and roll record, under the name of their sax player and vocalist Jackie Brenston:\n\n[Excerpt: Jackie Brenston and the Delta Cats, \"Rocket '88\"]\n\nWe looked at some of the repercussions from that recording throughout the first year and a half or so of the podcast, but we didn't look any more at the career of Ike Turner himself. While \"Rocket '88\" was a minor hit, the group hadn't followed it up, and Brenston had left to go solo. For a while Ike wasn't really very successful at all -- though he was still performing around Memphis, and a young man named Elvis Presley was taking notes at some of the shows.\n\nBut things started to change for Ike when he once again turned up at Sam Phillips' studio -- this time because B.B. King was recording there. At the time, Sun Records had still not started as its own label, and Phillips' studio was being used for records made by all sorts of independent blues labels, including Modern Records, and Joe Bihari was producing a session for B.B. King, who had signed to Modern.\n\nThe piano player on the session also had a connection to \"Rocket '88\" -- when Jackie Brenston had quit Ike's band to go solo, he'd put together a new band to tour as the Delta Cats, and Phineas Newborn Jr had ended up playing Turner's piano part on stage, before Brenston's career collapsed and Newborn became King's pianist.\n\nBut Phineas Newborn was a very technical, dry, jazz pianist -- a wonderful player, but someone who was best suited to playing more cerebral material, as his own recordings as a bandleader from a few years later show:\n\n[Excerpt: Phineas Newborn Jr, \"Barbados\"]\n\nBihari wasn't happy with what Newborn was playing, and the group took a break from recording to get something to eat and try to figure out the problem. While they were busy, Turner went over to the piano and started playing. Bihari said that that was exactly what they wanted, and Turner took over playing the part.\n\nIn his autobiography, Turner variously remembers the song King was recording there as \"You Know I Love You\" and \"Three O'Clock Blues\", neither of which, as far as I can tell, were actually recorded at Phillips' studio, and both of which seem to have been recorded later -- it's difficult to say for sure because there were very few decent records kept of these things at the time. But we do know that Turner played on a lot of King's records in the early fifties, including on \"Three O'Clock Blues\", King's first big hit:\n\n[Excerpt: B.B. King, \"Three O'Clock Blues\"]\n\nFor the next while, Turner was on salary at Modern Records, playing piano on sessions, acting as a talent scout, and also apparently writing many of the songs that Modern's artists would record, though those songs were all copyrighted under the name \"Taub\", a pseudonym for the Bihari brothers, as well as being a de facto arranger and producer for the company. He worked on many records made in and around Memphis, both for Modern Records and for other labels who drew from the same pool of artists and musicians. Records he played on and produced or arranged include several of Bobby \"Blue\" Bland's early records -- though Turner's claim in his autobiography that he played on Bland's version of \"Stormy Monday\" appears to be incorrect, as that wasn't recorded until a decade later.\n\nHe did, though, play on Bland's “Drifting from Town to Town”, a rewrite of Charles Brown's “Driftin' Blues”, on which, as on many sessions run by Turner, the guitarist was Matt “Guitar” Murphy, who later found fame with the Blues Brothers:\n\n[Excerpt: Bobby \"Blue\" Bland with Ike Turner and his Orchestra, \"Driftin' Blues\"]\n\nThough I've also seen the piano part on that credited as being by Johnny Ace – there's often some confusion as to whether Turner or Ace played on a session, as they played with many of the same artists, but that one was later rereleased as by Bobby “Blue” Bland with Ike Turner and his Orchestra, so it's safe to say that Ike's on that one.\n\nHe also played on several records by Howlin' Wolf, including \"How Many More Years\", recorded at Sam Phillips' studio:\n\n[Excerpt: Howlin' Wolf, \"How Many More Years?\"]\n\nOver the next few years he played with many artists we've covered already in the podcast, like Richard Berry and the Flairs, on whose recordings he played guitar rather than piano:\n\n[Excerpt: The Flairs, \"Baby Wants\"]\n\nHe also played guitar on records by Elmore James:\n\n[Excerpt: Elmore James, \"Please Find My Baby\"]\n\nand played with Little Junior Parker, Little Milton, Johnny Ace, Roscoe Gordon, and many, many more. As well as making blues records, he also made R&B records in the style of Gene and Eunice with his then-wife Bonnie:\n\n[Excerpt: Bonnie and Ike Turner, \"My Heart Belongs to You\"]\n\nBonnie was his fourth wife, all of them bigamous -- or at least, I *think* she was his fourth. I have seen two different lists Turner gave of his wives, both of them made up of entirely different people, though it doesn't help that many of them also went by nicknames. But Turner started getting married when he was fourteen, and as he would often put it \"you gave a preacher two dollars, the papers cost three dollars, that was it. In those days Blacks didn't bother with divorces.\"\n\n(One thing you will see a lot with Turner, unfortunately, is his habit of taking his own personal misbehaviours and claiming they were either universal, or at least that they were universal among Black people, or among men. It's certainly true that some people in the Southeastern US had a more lackadaisical attitude towards remarrying without divorce at the time than we might expect, but it was in no way a Black thing specifically -- it was a people-like-Ike-Turner thing -- see for example the very similar behaviour of Jerry Lee Lewis. I'm trying, when I quote him, not to include too many of these generalisations, but I thought it important to include that one early on to show the kind of self-justification to which he was prone throughout his entire life.)\n\nIt's largely because Bonnie played piano and was singing with his band that Turner switched to playing guitar, but there was another reason – while he disliked the attention he got on stage, he also didn't want a repeat of what had happened with Jackie Brenston, where Brenston as lead vocalist and frontman had claimed credit for what Ike thought of as his own record. Anyone who saw Ike Turner and his Kings of Rhythm was going to know that Ike Turner was the man who was making it all happen, and so he was going to play guitar up front rather than be on the piano in the background.\n\nSo Turner took guitar lessons from Earl Hooker, one of the great blues guitarists of the period, who had played with Turner's piano inspiration Pinetop Perkins before recording solo tracks like \"Sweet Angel\":\n\n[Excerpt: Earl Hooker, \"Sweet Angel\"]\n\nTurner was always happier in the studio than performing live -- despite his astonishing ego, he was also a rather shy person who didn't like attention -- and he'd been happy working on salary for Modern and freelancing on occasion for other labels like Chess and Duke. But then the Biharis had brought him out to LA, where Modern Records was based, and as Joel Bihari put it \"Ike did a great job for us, but he was a country boy. We brought him to L.A., and he just couldn't take city life. He only stayed a month, then left for East St. Louis to form his own band. He told me he was going back there to become a star.\"\n\nFor once, Turner's memory of events lined up with what other people said about him. In his autobiography, he described what happened -- \"Down in Mississippi, life is slow. Tomorrow, you are going to plough this field. The next day, you going to cut down these trees. You stop and you go on about your business. Next day, you start back on sawing trees or whatever you doing. Here I am in California, and this chick, this receptionist, is saying \"Hold on, Mr Bihari, line 2... hold line 3... Hey Joe, Mr Something or other on the phone for you.\" I thought \"What goddamn time does this stop?\"\"\n\nSo Turner did head to East St. Louis -- which is a suburb of St. Louis proper, across the Mississippi river from it, and in Illinois rather than Missouri, and at the time a thriving industrial town in its own right, with over eighty thousand people living there. Hardly the laid-back country atmosphere that Turner was talking about, but still also far from LA both geographically and culturally.\n\nHe put together a new lineup of the Kings of Rhythm, with a returning Jackie Brenston, who were soon recording for pretty much every label that was putting out blues and R&B tracks at that point, releasing records on RPM, Sue, Flair, Federal, and Modern as well as several smaller labels. usually with either Brenston or the group's drummer Billy Gayles singing lead:\n\n[Excerpt: Billy Gayles with Ike Turner's Kings of Rhythm, \"Just One More Time\"]\n\nNone of these records was a success, but the Kings of Rhythm were becoming the most successful band in East St. Louis. In the mid-fifties the only group that was as popular in the greater St. Louis metro area was the Johnny Johnson trio -- which soon became the Chuck Berry trio, and went on to greater things, while the Kings of Rhythm remained on the club circuit.\n\nBut Turner was also becoming notorious for his temper -- he got the nickname \"Pistol-Whippin' Ike Turner\" for the way he would attack people with his gun, He also though was successful enough that he built his own home studio, and that was where he recorded \"Boxtop\". a calypso song whose middle eight seems to have been nicked from \"Why Do Fools Fall In Love?\" and whose general feel owes more than a little to \"Love is Strange\":\n\n[Excerpt: Ike Turner, Carlson Oliver, and Little Ann, \"Boxtop\"]\n\nThe female vocals on that track were by Turner's new backing vocalist, who at the time went by the stage name \"Little Ann\".\n\nAnna Mae Bullock had started going to see the Kings of Rhythm regularly when she was seventeen, because her sister was dating one of the members of the band, and she had become a fan almost immediately. She later described her first experience seeing the group:\n\n\"The first time I saw Ike on stage he was at his very best, sharply dressed in a dark suit and tie. Ike wasn’t conventionally handsome – actually, he wasn’t handsome at all – and he certainly wasn’t my type. Remember, I was a schoolgirl, all of seventeen, looking at a man. I was used to high school boys who were clean-cut, athletic, and dressed in denim, so Ike’s processed hair, diamond ring, and skinny body – he was all edges and sharp cheekbones – looked old to me, even though he was only twenty-five. I’d never seen anyone that thin! I couldn’t help thinking, God, he’s ugly.\"\n\nTurner didn't find Bullock attractive either -- one of the few things both have always agreed on in all their public statements about their later relationship was that neither was ever particularly attracted to the other sexually -- and at first this had caused problems for Anna Mae. There was a spot in the show where Turner would invite a girl from the audience up on stage to sing, a different one every night, usually someone he'd decided he wanted to sleep with. Anna Mae desperately wanted to be one of the girls that would get up on stage, but Turner never picked her.\n\nBut then one day she got her chance. Her sister's boyfriend was teasing her sister, trying to get her to sing in this spot, and passed her the microphone. Her sister didn't want to sing, so Anna Mae grabbed the mic instead, and started singing -- the song she sang was B.B. King's \"You Know I Love You\", the same song that Turner always remembered as being recorded at Sun studios, and on which Turner had played piano:\n\n[Excerpt: B.B. King, \"You Know I Love You\"]\n\nTurner suddenly took notice of Anna Mae. As he would later say, everyone *says* they can sing, but it turned out that Anna Mae could. He took her on as an occasional backing singer, not at first as a full member of the band, but as a sort of apprentice, who he would teach how to use her talents more commercially.\n\nTurner always said that during this period, he would get Little Richard to help teach Anna Mae how to sing in a more uncontrolled, exuberant, style like he did, and Richard has backed this up, though Anna Mae never said anything about this. We do know though that Richard was a huge fan of Turner's -- the intro to \"Good Golly Miss Molly\":\n\n[Excerpt: Little Richard, \"Good Golly Miss Molly\"]\n\nwas taken almost exactly from the intro to \"Rocket '88\":\n\n[Excerpt: Jackie Brenston and the Delta Cats, \"Rocket '88\"]\n\nand Richard later wrote the introduction to Turner's autobiography. So it's possible -- but both men were inveterate exaggerators, and Anna Mae only joined Ike's band a few months before Richard's conversion and retirement from music, and during a point when he was a massive star, so it seems unlikely.\n\nAnna Mae started dating Raymond Hill, a saxophone player in the group, and became pregnant by him -- but then Hill broke his ankle, and used that as an excuse to move back to Clarksdale, Mississippi, to be with his family, abandoning his pregnant teenage girlfriend, and it seems to be around this point that Turner and Anna Mae became romantically and sexually involved. Certainly, one of Ike's girlfriends, Lorraine Taylor, seems to have believed they were involved while Anna Mae was pregnant, and indeed that Turner, rather than Hill, was the father. Taylor threatened Bullock with Turner's gun, before turning it on herself and attempting suicide, though luckily she survived. She gave birth to Turner's son, Ike Junior, a couple of months after Bullock gave birth to her own son, Craig.\n\nBut even after they got involved, Anna Mae was still mostly just doing odd bits of backing vocals, like on \"Boxtop\", recorded in 1958, or on 1959's \"That's All I Need\", released on Sue Records:\n\n[Excerpt: Ike Turner's Kings of Rhythm, \"That's All I Need\"]\n\nAnd it seemed that would be all that Anna Mae Bullock would do, until Ike Turner lent Art Lassiter eighty dollars he didn't want to pay back.\n\nLassiter was a singer who was often backed by his own vocal trio, the Artettes, patterned after Ray Charles' Raelettes. He had performed with Turner's band on a semi-regular basis, since 1955 when he had recorded \"As Long as I Have You\" with his vocal group the Trojans, backed by \"Ike Turner and his Orchestra\":\n\n[Excerpt: The Trojans, Ike Turner and His Orchestra, \"As Long as I Have You\"]\n\nHe'd recorded a few more tracks with Turner since then, both solo and under group names like The Rockers:\n\n[Excerpt: The Rockers, \"Why Don't You Believe?\"]\n\nIn 1960, Lassiter needed new tyres for his car, and borrowed eighty dollars from Turner in order to get them -- a relatively substantial amount of money for a working musician back then. He told Turner that he would pay him back at a recording session they had booked, where Lassiter was going to record a song Turner had written, \"A Fool in Love\", with Turner's band and the Artettes.\n\nBut Lassiter never showed up -- he didn't have the eighty dollars, and Turner found himself sat in a recording studio with a bunch of musicians he was paying for, paying twenty-five dollars an hour for the studio time, and with no singer there to record.\n\nAt the time, he was still under the impression that Lassiter might eventually show up, if not at that session, then at least at a future one, but until he did, there was nothing he could do and he was getting angry.\n\nBullock suggested that they cut the track without Lassiter. They were using a studio with a multi-track machine -- only two tracks, but that would be enough. They could cut the backing track on one track, and she could record a guide vocal on the other track, since she'd been around when Turner was teaching Lassiter the song. At least that way they wouldn't have wasted all the money.\n\nTurner saw the wisdom of the idea -- he said in his autobiography \"This was the first time I got hip to two-track stereo\" -- and after consulting with the engineer on the session, he decided to go ahead with Bullock's plan. The plan still caused problems, because they were recording the song in a key written for a man, so Bullock had to yell more than sing, causing problems for the engineer, who according to Turner kept saying things like \"Goddammit, don't holler in my microphone\".\n\nBut it was only a demo vocal, after all, and they got it cut -- and as Lassiter didn't show up, Turner took Lassiter's backing vocal group as his own new group, renaming the Artettes to the Ikettes, and they became the first of a whole series of lineups of Ikettes who would record with Turner for the rest of his life.\n\nThe intention was still to get Lassiter to sing lead on the record, but then Turner played an acetate of it at a club night where he was DJing as well as performing, and the kids apparently went wild:\n\n[Excerpt: Ike and Tina Turner, \"A Fool in Love\"]\n\nTurner took the demo to Juggy Murray at Sue Records, still with the intention of replacing Anna Mae's vocal with Lassiter's, but Murray insisted that that was the best thing about the record, and that it should be released exactly as it was, that it was a guaranteed hit.\n\nAlthough -- while that's the story that's told all the time about that record by everyone involved in the recording and release, and seems uncontested, there does seem to be one minor problem with the story, which is that the Ikettes sing \"you know you love him, you can't understand/Why he treats you like he do when he's such a good man\". I'm willing to be proved wrong, of course, but my suspicion is that Ike Turner wasn't such a progressive thinker that he was writing songs about male-male relationships in 1960. It's possible that the Ikettes were recorded on the same track as Tina's guide vocals, but if the intention was to overdub a new lead from Lassiter on an otherwise finished track, it would have made more sense for them to sing their finished backing vocal part. It seems more likely to me that they decided in the studio that the record was going to go out with Anna Mae singing lead, and the idea of Murray insisting is a later exaggeration.\n\nOne thing that doesn't seem to be an exaggeration, though, is that initially Murray wanted the record to go out as by Ike Turner's Kings of Rhythm featuring Little Ann, but Turner had other ideas. While Murray insisted \"the girl is the star\", Turner knew what happened when other people were the credited stars on his records. He didn't want another Jackie Brenston, having a hit and immediately leaving Turner right back where he started. If Little Ann was the credited singer, Little Ann would become a star and Ike Turner would have to find a new singer.\n\nSo he came up with a pseudonym. Turner was a fan of jungle women in film serials and TV, and he thought a wild-woman persona would suit Anna Mae's yelled vocal, and so he named his new star after Sheena, Queen of the Jungle, a female Tarzan knock-off comic character created by Will Eisner and Jerry Iger in the thirties, but who Turner probably knew from a TV series that had been on in 1955 and 56. He gave her his surname, changed \"Sheena\" slightly to make the new name alliterative and always at least claimed to have registered a trademark on the name he came up with, so if Anna Mae ever left the band he could just get a new singer to use the name.\n\nAnna Mae Bullock was now Tina Turner, and the record went out as by \"Ike and Tina Turner\":\n\n[Excerpt: Ike and Tina Turner, \"A Fool in Love\"]\n\nThat went to number two on the R&B charts, and hit the top thirty on the pop charts, too. But there were already problems. After Ike had had a second son with Lorraine, he then got Tina pregnant with another of his children, still seeing both women. He had already started behaving abusively towards Tina, and as well as being pregnant, she was suffering from jaundice -- she says in the first of her two autobiographies that she distinctly remembered lying in her hospital bed, hearing \"A Fool in Love\" on the radio, and thinking \"What's love got to do with it?\", though as with all such self-mythologising we should take this with a pinch of salt.\n\nTurner was in need of money to pay for lawyers -- he had been arrested for financial crimes involving forged cheques -- and Juggy Murray wouldn't give him an advance until he delivered a follow-up to \"A Fool in Love\", so he insisted that Tina sneak herself out of the hospital and go into the studio, jaundiced and pregnant, to record the follow-up. Then, as soon as the jaundice had cleared up, they went on a four-month tour, with Tina heavily pregnant, to make enough money to pay Ike's legal bills.\n\nTurner worked his band relentlessly -- he would accept literally any gig, even tiny clubs with only a hundred people in the audience, reasoning that it was better for the band's image to play  small venues that had to turn people away because they were packed to capacity, than to play large venues that were only half full. While \"A Fool in Love\" had a substantial white audience, the Ike and Tina Turner Revue was almost the epitome of the chitlin' circuit act, playing exciting, funky, tightly-choreographed shows for almost entirely Black audiences in much the same way as James Brown, and Ike Turner was in control of every aspect of the show.\n\nWhen Tina had to go into hospital to give birth, rather than give up the money from gigging, Ike hired a sex worker who bore a slight resemblance to Tina to be the new onstage \"Tina Turner\" until the real one was able to perform again. One of the Ikettes told the real Tina, who discharged herself from hospital, travelled to the venue, beat up the fake Tina, and took her place on stage two days after giving birth.\n\nThe Ike and Tina Turner Revue, with the Kings of Rhythm backing Tina, the Ikettes, and male singer Jimmy Thomas, all of whom had solo spots, were an astonishing live act, but they were only intermittently successful on record. None of the three follow-ups to \"A Fool in Love\" did better than number eighty-two on the charts, and two of them didn't even make the R&B charts, though \"I Idolize You\" did make the R&B top five. Their next big hit came courtesy of Mickey and Sylvia.\n\nYou may remember us talking about Mickey and Sylvia way back in episode forty-nine, from back in 2019, but if you don't, they were one of a series of R&B duet acts, like Gene and Eunice, who came up after the success of Shirley and Lee, and their big hit was \"Love is Strange\":\n\n[Excerpt: Mickey and Sylvia, \"Love is Strange\"]\n\nBy 1961, their career had more or less ended, but they'd recorded a song co-written by the great R&B songwriter Rose Marie McCoy, which had gone unreleased:\n\n[Excerpt: Mickey and Sylvia, \"It's Gonna Work Out Fine\"]\n\nWhen that was shelved they remade it as an Ike and Tina Turner record, with Mickey and Sylvia being Ike -- Sylvia took on all the roles that Ike would normally do in the studio, arranging the track and playing lead guitar, as well as joining the Ikettes on backing vocals, while Mickey did the spoken answering vocals that most listeners assumed were Ike, and which Ike would replicate on stage. The result, unsurprisingly, sounded more like a Mickey and Sylvia record than anything Ike and Tina had ever released before, though it's very obviously Tina on lead vocals:\n\n[Excerpt: Ike and Tina Turner, \"It's Gonna Work Out Fine\"]\n\nThat made the top twenty on the pop charts -- though it would be their last top forty hit for nearly a decade as Ike and Tina Turner. They did though have a couple of other hits as the Ikettes, with Ike Turner putting the girl group's name on the label so he could record for multiple labels. The first of these, \"I'm Blue (The Gong Gong Song)\" was a song Ike had written which would later go on to become something of an R&B standard. It featured Dolores Johnson on lead vocals, but Tina sang backing vocals and got a rare co-production credit:\n\n[Excerpt: The Ikettes, \"I'm Blue (The Gong Gong Song)\"]\n\nThe other Ikettes top forty hit was in 1965, with a song written by Steve Venet and Tommy Boyce -- a songwriter we will be hearing more about in three weeks -- and produced by Venet:\n\n[Excerpt: The Ikettes, \"Peaches 'n' Cream\"]\n\nIke wasn't keen on that record at first, but soon came round to it when it hit the charts.\n\nThe success of that record caused that lineup of Ikettes to split from Ike and Tina -- the Ikettes had become a successful act in their own right, and Dick Clark's Caravan of Stars wanted to book them, but that would have meant they wouldn't be available for Ike and Tina shows. So Ike sent a different group of three girls out on the road with Clark's tour, keeping the original Ikettes back to record and tour with him, and didn't pay them any royalties on their records. They resented being unable to capitalise on their big hit, so they quit. At first they tried to keep the Ikettes name for themselves, and got Tina Turner's sister Alline to manage them, but eventually they changed their name to the Mirettes, and released a few semi-successful records.\n\nIke got another trio of Ikettes to replace them, and carried on with Pat Arnold, Gloria Scott, and Maxine Smith as the new Ikettes,.\n\nOne Ikette did remain pretty much throughout -- a woman called Ann Thomas, who Ike Turner was sleeping with, and who he would much later marry, but who he always claimed was never allowed to sing with the others, but was just there for her looks.\n\nBy this point Ike and Tina had married, though Ike had not divorced any of his previous wives (though he paid some of them off when Ike and Tina became big). Ike and Tina's marriage in Tijuana was not remembered by either of them as a particularly happy experience -- Ike would always later insist that it wasn't a legal marriage at all, and in fact that it was the only one of his many, many, marriages that hadn't been, and was just a joke. He was regularly abusing her in the most horrific ways, but at this point the duo still seemed to the public to be perfectly matched.\n\nThey actually only ended up on the Big TNT Show as a last-minute thing -- another act was sick, though none of my references mention who it was who got sick, just that someone was needed to fill in for them, and as Ike and Tina were now based in LA -- the country boy Ike had finally become a city boy after all -- and would take any job on no notice, they got the gig.\n\nPhil Spector was impressed, and he decided that he could revitalise his career by producing a hit for Tina Turner. There was only one thing wrong -- Tina Turner wasn't an act. *Ike* and Tina Turner was an act. And Ike Turner was a control freak, just like Spector was -- the two men had essentially the same personality, and Spector didn't want to work with someone else who would want to be in charge.\n\nAfter some negotiation, they came to an agreement -- Spector could produce a Tina Turner record, but it would be released as an Ike and Tina Turner record. Ike would be paid twenty thousand dollars for his services, and those services would consist of staying well away from the studio and not interfering.\n\nSpector was going to go back to the old formulas that had worked for him, and work with the people who had contributed to his past successes, rather than leaving anything to chance. Jack Nitzsche had had a bit of a falling out with him and not worked on some of the singles he'd produced recently, but he was back. And Spector was going to work with Jeff Barry and Ellie Greenwich again.\n\nHe'd fallen out with Barry and Greenwich when \"Chapel of Love\" had been a hit for the Dixie Cups rather than for one of Spector's own artists, and he'd been working with Mann and Weill and Goffin and King instead. But he knew that it was Barry and Greenwich who were the ones who had worked best with him, and who understood his musical needs best, so he actually travelled to see them in New York instead of getting them to come to him in LA, as a peace offering and a sign of how much he valued their input.\n\nThe only problem was that Spector hadn't realised that Barry and Greenwich had actually split up.  They were still working together in the studio, and indeed had just produced a minor hit single for a new act on Bert Berns' label BANG, for which Greenwich had written the horn arrangement:\n\n[Excerpt: Neil Diamond, \"Solitary Man\"]\n\nWe'll hear more about Neil Diamond, and about Jeff Barry's work with him, in three weeks.\n\nBut Barry and Greenwich were going through a divorce and weren't writing together any more, and came back together for one last writing session with Spector, at which, apparently, Ellie Greenwich would cry every time they wrote a line about love. The session produced four songs, of which two became singles. Barry produced a version of \"I Can Hear Music\", written at these sessions, for the Ronettes, who Spector was no longer interested in producing himself:\n\n[Excerpt: The Ronettes, \"I Can Hear Music\"]\n\nThat only made number ninety-nine on the charts, but the song was later a hit for the Beach Boys and has become recognised as a classic. The other song they wrote in those sessions, though, was the one that Spector wanted to give to Tina Turner. \"River Deep, Mountain High\" was a true three-way collaboration -- Greenwich came up with the music for the verses, Spector for the choruses, and Barry wrote the lyrics and tweaked the melody slightly.\n\nSpector, Barry, and Greenwich spent two weeks in their writing session, mostly spent on \"River Deep, Mountain High\". Spector later said of the writing \"Every time we’d write a love line, Ellie would start to cry. I couldn’t figure out what was happening, and then I realised… it was a very uncomfortable situation. We wrote that, and we wrote ‘I Can Hear Music’…. We wrote three or four hit songs on that one writing session.\n\n“The whole thing about ‘River Deep’ was the way I could feel that strong bass line. That’s how it started. And then Jeff came up with the opening line. I wanted a tender song about a chick who loved somebody very much, but a different way of expressing it. So we came up with the rag doll and ‘I’m going to cuddle you like a little puppy’. And the idea was really built for Tina, just like ‘Lovin’ Feelin” was built for the Righteous Brothers.”\n\nSpector spent weeks recording, remixing, rerecording, and reremixing the backing track, arranged by Nitzsche, creating the most thunderous, overblown, example of the Wall of Sound he had ever created, before getting Tina into the studio. He also spent weeks rehearsing Tina on the song, and according to her most of what he did was \"carefully stripping away all traces of Ike from my performance\" -- she was belting the song and adding embellishments, the way Ike Turner had always taught her to, and Spector kept insisting that she just sing the melody -- something that she had never had the opportunity to do before, and which she thought was wonderful.\n\nIt was so different from anything else that she'd recorded that after each session, when Ike would ask her about the song, she would go completely blank -- she couldn't hold this pop song in her head except when she was running through it with Spector. Eventually she did remember it, and when she did Ike was not impressed, though the record became one of the definitive pop records of all time:\n\n[Excerpt: Ike and Tina Turner, \"River Deep, Mountain High\"]\n\nSpector was putting everything on the line for this record, which was intended to be his great comeback and masterpiece. That one track cost more than twenty thousand dollars to record -- an absolute fortune at a time when a single would normally be recorded in one or two sessions at most.\n\nIt also required a lot of work on Tina's part. She later estimated that she had sung the opening line of the song a thousand times before Spector allowed her to move on to the second line, and talked about how she got so hot and sweaty singing the song over and over that she had to take her blouse off in the studio and sing the song in her bra. She later said \"I still don’t know what he wanted. I still don’t know if I pleased him. But I never stopped trying.\"\n\nSpector produced a total of six tracks with Tina, including the other two songs written at those Barry and Greenwich sessions, \"I'll Never Need More Than This\", which became the second single released off the \"River Deep, Mountain High\" album, and \"Hold On Baby\", plus cover versions of Arthur Alexander's \"Every Day I Have to Cry Some\", Pomus and Shuman's \"Save the Last Dance\", and \"A Love Like Yours (Don't Come Knocking Everyday)\" a Holland-Dozier-Holland song which had originally been released as a Martha and the Vandellas B-side. The planned album was to be padded out with six tracks produced by Ike Turner, mostly remakes of the duo's earlier hits, and was planned for release after the single became the hit everyone knew it would. The single hit the Hot One Hundred soon after it was released:\n\n[Excerpt: Ike and Tina Turner, \"River Deep, Mountain High\"]\n\n...and got no higher up the charts than number eighty-eight. The failure of the record basically destroyed Spector, and while he had been an abusive husband before this, now he became much worse, as he essentially retired from music for four years, and became increasingly paranoid and aggressive towards the industry that he thought was not respectful enough of his genius.\n\nThere have been several different hypotheses as to why \"River Deep Mountain High\" was not a success. Some have said that it was simply because DJs were fed up of Spector refusing to pay payola, and had been looking for a reason to take him down a peg.\n\nIke Turner thought it was due to racism, saying later “See, what’s wrong with America, I think, is that rather than accept something for its value… what it’s doing, America mixes race in it. You can’t call that record R&B. But because it’s Tina… if you had not put Tina’s name on there and put ‘Joe Blow’, then the Top 40 stations would have accepted it for being a pop record. But Tina Turner… they want to brand her as being an R&B artist. I think the main reason that ‘River Deep’ didn’t make it here in America was that the R&B stations wouldn’t play it because they thought it was pop, and the pop stations wouldn’t play it because they thought it was R&B. And it didn’t get played at all. The only record I’ve heard that could come close to that record is a record by the Beach Boys called ‘Good Vibrations’. I think these are the two records that I’ve heard in my life that I really like, you know?”\n\nMeanwhile, Jeff Barry thought it was partly the DJs but also faults in the record caused by Phil Spector's egomania, saying \"he has a self-destructive thing going for him, which is part of the reason that the mix on ‘River Deep’ is terrible, he buried the lead and he knows he buried the lead and he cannot stop himself from doing that… if you listen to his records in sequence, the lead goes further and further in and to me what he is saying is, ‘It is not the song I wrote with Jeff and Ellie, it is not the song – just listen to those strings. I want more musicians, it’s me, listen to that bass sound. …’ That, to me, is what hurts in the long run... Also, I do think that the song is not as clear on the record as it should be, mix-wise. I don’t want to use the word overproduced, because it isn’t, it’s just undermixed.\"\n\nThere's possibly an element of all three of these factors in play. As we've discussed, 1965 seems to have been the year that the resegregation of American radio began, and the start of the long slow process of redefining genres so that rock and roll, still considered a predominantly Black music at the beginning of the sixties, was by the end of the decade considered an almost entirely white music. And it's also the case that \"River Deep, Mountain High\" was the most extreme production Spector ever committed to vinyl, and that Spector had made a lot of enemies in the music business.\n\nIt's also, though, the case  that it was a genuinely great record:\n\n[Excerpt: Ike and Tina Turner, \"River Deep, Mountain High\"]\n\nHowever, in the UK, it was promoted by Decca executive Tony Hall, who was a figure who straddled both sides of the entertainment world -- as part of his work as a music publicist he had been a presenter on Oh Boy!, written a column in Record Mirror, and presented a Radio Luxembourg show. Hall put his not-inconsiderable weight behind promoting the record, and it ended up reaching number two in the UK -- being successful enough that the album was also released over here, though it wouldn't come out in the US for several years.\n\nThe record also attracted the attention of the Rolling Stones, who invited Ike and Tina to be their support act on a UK tour, which also featured the Yardbirds, and this would be a major change for the duo in all sorts of ways. Firstly, it got them properly in contact with British musicians -- and the Stones would get Ike and Tina as support artists several times over the next few years -- and also made the UK and Europe part of their regular tour itinerary. It also gave the duo their first big white rock audience, and over the next several years they would pivot more and more to performing music aimed at that audience, rather than the chitlin' circuit they'd been playing for previously. Ike was very conscious of wanting to move away from the blues and R&B -- while that was where he'd made his living as a musician, it wasn't music he actually liked, and he would often talk later about how much he respected Keith Richards and Eric Clapton, and how his favourite music was country music. Tina had also never been a fan of blues or R&B, and wanted to perform songs by the white British performers they were meeting.\n\nThe tour also, though, gave Tina her first real thoughts of escape. She loved the UK and Europe, and started thinking about what life could be like for her not just being Ike Turner's wife and working fifty-one weeks a year at whatever gigs came along.\n\nBut it also made that escape a little more difficult, because on the tour Tina lost one of her few confidantes in the organisation. Tina had helped Pat Arnold get away from her own abusive partner, and the two had become very close, but Arnold was increasingly uncomfortable being around Ike's abuse of Tina, and couldn't help her friend the way she'd been helped. She decided she needed to get out of a toxic situation, and decided to stay in England, where she'd struck up an affair with Mick Jagger, and where she found that there were many opportunities for her as a Black woman that simply hadn't been there in the US.\n\n(This is not to say that Britain doesn't have problems with racism -- it very much does, but those problems are *different* problems than the ones that the US had at that point, and Arnold found Britain's attitude more congenial to her personally).\n\nThere was also another aspect, which a lot of Black female singers of her generation have mentioned and which probably applies here. Many Black women have said that they were astonished on visiting Britain to be hailed as great singers, when they thought of themselves as merely average. Britain does not have the kind of Black churches which had taught generations of Black American women to sing gospel, and so singers who in the US thought of themselves as merely OK would be far, far, better than any singers in the UK -- the technical standards were just so much lower here.\n\n(This is something that was still true at least as late as the mid-eighties. Bob Geldof talks in his autobiography about attending the recording session for \"We Are the World\" after having previously recorded \"Do They Know It's Christmas?\" and being astonished at how much more technically skilled the American stars were and how much more seriously they took their craft.)\n\nAnd Arnold wasn't just an adequate singer -- she was and is a genuinely great talent -- and so she quickly found herself in demand in the UK. Jagger got her signed to Immediate Records, a new label that had been started up by the Stones manager Andrew Oldham, and where Jimmy Page was the staff producer. She was given a new name, P.P. Arnold, which was meant to remind people of another American import, P.J. Proby, but which she disliked because the initials spelled \"peepee\".\n\nHer first single on the label, produced by Jagger, did nothing, but her second single, written by a then-unknown songwriter named Cat Stevens, became a big hit:\n\n[Excerpt: P.P. Arnold, \"The First Cut is the Deepest\"]\n\nShe toured with a backing band, The Nice, and made records as a backing singer with artists like the Small Faces. She also recorded a duet with the unknown singer Rod Stewart, though that wasn't a success:\n\n[Excerpt: Rod Stewart and P.P. Arnold, \"Come Home Baby\"]\n\nWe'll be hearing more about P.P. Arnold in future episodes, but the upshot of her success was that Tina had even fewer people to support her. The next few years were increasingly difficult for Tina, as Ike turned to cocaine use in a big way, became increasingly violent, and his abuse of her became much more violent. The descriptions of his behaviour in Tina's two volumes of autobiography are utterly harrowing, and I won't go into them in detail, except to say that nobody should have to suffer what she did.\n\nIke's autobiography, on the other hand, has him attempting to defend himself, even while admitting to several of the most heinous allegations, by saying he didn't beat his wife any more than most men did. Now the sad thing is that this may well be true, at least among his peer group. Turner's behaviour was no worse than behaviour from, say, James Brown or Brian Jones or Phil Spector or Jerry Lee Lewis, and it may well be that behaviour like this was common enough among people he knew that Turner's behaviour didn't stand out at all. His abuse has become much better-known, because the person he was attacking happened to become one of the biggest stars in the world, while the women they attacked didn't. But that of course doesn't make what Ike did to Tina any better -- it just makes it infinitely sadder that so many more people suffered that way.\n\nIn 1968, Tina actually tried to take her own life -- and she was so fearful of Ike that when she overdosed, she timed it so that she thought she would be able to at least get on stage and start the first song before collapsing, knowing that their contract required her to do that for Ike to get paid. As it was, one of the Ikettes noticed the tablets she had taken had made her so out of it she'd drawn a line across her face with her eyebrow pencil. She was hospitalised, and according to both Ike and Tina's reports, she was comatose and her heart actually stopped beating, but then Ike started yelling at her, saying if she wanted to die why didn't she do it by jumping in front of a truck, rather than leaving him with hospital bills, and telling her to go ahead and die if this was how she was going to treat him -- and she was so scared of Ike her heart started up again.\n\n(This does not seem medically likely to me, but I wasn't there, and they both were).\n\nOf course, Ike frames this as compassion and tough love. I would have different words for it myself.\n\nTina would make several more suicide attempts over the years, but even as Tina's life was falling apart, the duo's professional career was on the up. They started playing more shows in the UK, and they toured the US as support for the Rolling Stones. They also started having hits again, after switching to performing funked-up cover versions of contemporary hits. They had a minor hit with a double-sided single of the Beatles' \"Come Together\" and the Stones' \"Honky-Tonk Women\", then a bigger one with a version of Sly and the Family Stone's \"I Want to Take You Higher\", then had their biggest hit ever with \"Proud Mary\".\n\nIt's likely we'll be looking at Creedence Clearwater Revival's original version of that song at some point, but while Ike Turner disliked the original, Tina liked it, and Ike also became convinced of the song's merits by hearing a version by The Checkmates Ltd:\n\n[Excerpt: The Checkmates Ltd, \"Proud Mary\"]\n\nThat was produced by Phil Spector, who came briefly out of his self-imposed exile from the music business in 1969 to produce a couple of singles for the Checkmates and Ronnie Spector.\n\nThat version inspired Ike and Tina's recording of the song, which went to number four on the charts and won them a Grammy award in 1971:\n\n[Excerpt: Ike and Tina Turner, \"Proud Mary\"]\n\nIke was also investing the money they were making into their music. He built his own state-of-the-art studio, Bolic Sound, which Tina always claimed was a nod to her maiden name, Bullock, but which he later always said was a coincidence. Several other acts hired the studio, especially people in Frank Zappa's orbit -- Flo and Eddie recorded their first album as a duo there, and Zappa recorded big chunks of Over-Nite Sensation and Apostrophe('), two of his most successful albums, at the studio.\n\nActs hiring Bolic Sound also got Tina and the Ikettes on backing vocals if they wanted them, and so for example Tina is one of the backing vocalists on Zappa's \"Cosmik Debris\":\n\n[Excerpt: Frank Zappa, \"Cosmik Debris\"]\n\nOne of the most difficult things she ever had to sing in her life was this passage in Zappa's song \"Montana\", which took the Ikettes several days' rehearsal to get right.\n\n[Excerpt: Frank Zappa and the Mothers of Invention, \"Montana\"]\n\nShe was apparently so excited at having got that passage right that she called Ike out of his own session to come in and listen, but Ike was very much unimpressed, and insisted that Tina and the Ikettes not get credit on the records they made with Zappa. Zappa later said “I don’t know how she managed to stick with that guy for so long. He treated her terribly and she’s a really nice lady. We were recording down there on a Sunday. She wasn’t involved with the session, but she came in on Sunday with a whole pot of stew that she brought for everyone working in the studio. Like out of nowhere, here’s Tina Turner coming in with a rag on her head bringing a pot of stew. It was really nice.”\n\nBy this point, Ike was unimpressed by anything other than cocaine and women, who he mostly got to sleep with him by having truly gargantuan amounts of cocaine around. As Ike was descending further into paranoia and abuse, though, Tina was coming into her own. She wrote \"Nutbush City Limits\" about the town where she grew up, and it reached number 22 on the charts -- higher than any song Ike ever wrote:\n\n[Excerpt: Ike and Tina Turner, \"Nutbush City Limits\"]\n\nOf course, Ike would later claim that he wrote the music and let Tina keep all the credit.\n\nTina was also asked by the Who to appear in the film version of their rock opera Tommy, where her performance of \"Acid Queen\" was one of the highlights:\n\n[Excerpt: Tina Turner, \"Acid Queen\"]\n\nAnd while she was filming that in London, she was invited to guest on a TV show with Ann-Margret, who was a huge fan of Ike and Tina, and duetted with Tina -- but not Ike -- on a medley of her hits:\n\n[Excerpt: Tina Turner and Ann-Margret, \"Nutbush City Limits/Honky Tonk Woman\"]\n\nJust as with \"River Deep, Mountain High\", Tina was wanted for her own talents, independent of Ike. She was starting to see that as well as being an abusive husband, he was also not necessary for her to have a career. She was also starting to find parts of her life that she could have for herself, independent of her husband. She'd been introduced to Buddhist meditation by a friend, and took it up in a big way, much to Ike's disapproval.\n\nThings finally came to a head in July 1976, in Dallas, when Ike started beating her up and for the first time she fought back. She pretended to reconcile with him, waited for him to fall asleep, and ran across a busy interstate, almost getting hit by a ten-wheel truck, to get to another hotel she could see in the distance. Luckily, even though she had no money, and she was a Black woman in Dallas, not a city known for its enlightened attitudes in the 1970s, the manager of the Ramada Inn took pity on her and let her stay there for a while until she could get in touch with Buddhist friends.\n\nShe spent the next few months living off the kindness of strangers, before making arrangements with Rhonda Graam, who had started working for Ike and Tina in 1964 as a fan, but had soon become indispensable to the organisation. Graam sided with Tina, and while still supposedly working for Ike she started putting together appearances for Tina on TV shows like Cher's. Cher was a fan of Tina's work, and was another woman trying to build a career after leaving an abusive husband who had been her musical partner:\n\n[Excerpt: Cher and Tina Turner, \"Makin' Music is My Business\"]\n\nGraam became Tina's full-time assistant, as well as her best friend, and remained part of her life until Graam's death a year ago.\n\nShe also got Tina booked in to club gigs, but for a long time they found it hard to get bookings -- promoters would say she was \"only half the act\". Ike still wanted the duo to work together professionally, if not be a couple, but Tina absolutely refused, and Ike had gangster friends of his shoot up Graam's car, and Tina heard rumours that he was planning to hire a hit man to come after her.\n\nTina filed for divorce, and gave Ike everything -- all the money the couple had earned together in sixteen years of work, all the property, all the intellectual property -- except for two cars, one of which Ike had given her and one which Sammy Davis Jr. had given her, and the one truly important thing -- the right to use the name \"Tina Turner\", which Ike had the trademark on. Ike had apparently been planning to hire someone else to perform as \"Tina Turner\" and carry on as if nothing had changed.\n\nSlowly, Tina built her career back up, though it was not without its missteps. She got a new manager, who also managed Olivia Newton-John, and the manager brought in a song he thought was perfect for Tina. She turned it down, and Newton-John recorded it instead:\n\n[Excerpt: Olivia Newton-John, \"Physical\"]\n\nBut even while she was still playing small clubs, her old fans from the British rock scene were boosting her career. In 1981, after Rod Stewart saw her playing a club gig and singing his song \"Hot Legs\", he invited her to guest with him and perform the song on Saturday Night Live:\n\n[Excerpt: Rod Stewart and Tina Turner, \"Hot Legs\"]\n\nThe Rolling Stones invited Tina to be their support act on a US tour, and to sing \"Honky Tonk Women\" on stage with them, and eventually when David Bowie, who was at the height of his fame at that point, told his record label he was going to see her on a night that EMI wanted to do an event for him, half the record industry showed up to the gig.\n\nShe had already recorded a remake of the Temptations' \"Ball of Confusion\" with the British Electric Foundation -- a side project for two of the members of Heaven 17 -- in 1982, for one of their albums:\n\n[Excerpt: British Electric Foundation, \"Ball of Confusion\"]\n\nNow they were brought in to produce a new single for her, a remake of Al Green's \"Let's Stay Together\":\n\n[Excerpt: Tina Turner, \"Let's Stay Together\"]\n\nThat made the top thirty in the US, and was a moderate hit in many places, making the top ten in the UK. She followed it up with another BEF production, a remake of \"Help!\" by the Beatles, which appears only to have been released in mainland Europe. But then came the big hit:\n\n[Excerpt: Tina Turner, \"What's Love Got to Do With It?\"]\n\nwenty-six years after she started performing with Ike, Tina Turner was suddenly a major star.\n\nShe had a string of successes throughout the eighties and nineties, with more hit records, film appearances, a successful autobiography, a film based on the autobiography, and record-setting concert appearances including one which broke the record for the largest audience ever for a solo performer. She retired in 2009, apart from making appearances to promote her second autobiography and the successful stage musical based on her life. She is currently happily married to a partner she's been with for thirty-five years, and though she's had further problems in her life, including a number of health issues and the death of her oldest son, she seems fundamentally content with the latter half of her life, and fulfilled creatively, emotionally, and financially.\n\nIke Turner, on the other hand, spent the thirty-one years after Tina left him lost in cocaine addiction and resentment. Occasionally he would come up with schemes to try to get her back working with him -- at one stage during her comeback he suggested a stage show in which Ike and Tina would appear with Sonny and Cher, to be called \"The Broken Pieces Put Back Together With Crazy Glue\", which he would of course write. Understandably, neither Tina nor Cher were interested in doing a stage show with their abusive exes. He continued making music, but with little success, though in the last decade of his life he did make a couple of moderately successful blues records, and even won a Best Traditional Blues Album Grammy for his last album. He would complain bitterly every chance he got about how hard-done-by he felt about Tina leaving him, including in his autobiography, Takin' Back My Name. He married three more times after Tina, and his final wife, who he divorced after two months, later wrote an autobiography, Love Has Everything to Do With It, detailing their relationship.\n\nHe died in 2007, of a cocaine overdose, and Phil Spector, the man who had paid Ike to stay away from the studio because he was only interested in Tina, spoke bitterly at his funeral about how in his view Ike had been the real talent and Tina should have been grateful to him, and how much he had learned from Ike. Spector clearly by now saw Ike as a kindred spirit, and realised how alike they were.\n\nAt the time he spoke at the funeral, Phil Spector was on bail awaiting trial for the murder of Lana Clarkson. He was later convicted, and died in prison in January 2021.",
  "itunes:subtitle": "Episode 141 of A History of Rock Music in Five Hundred Songs looks at “River Deep Mountain High”, and at the career of Ike and Tina Turner.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nAlso, this ",
  "itunes:keywords": "\"Fast\" Eddie Hoh,B.B. King,Bobby Blue Bland,Brian Wilson,Cher,Chip Douglas,Cyrus Faryar,Ellie Greenwich,Frank Zappa,Harry Nilsson,Henry Diltz,Ike Turner,Immediate Records,Jackie Brenston,Jeff Barry,Jerry Yester,Joan Baez,John Sebastian,Little Richard,Mickey and Sylvia,Mickey Baker,Modern Folk Quartet,Neil Diamond,P.P. Arnold,Phil Spector,Rod Stewart,Sam Phillips,Sylvia Vanterpool,The Lovin&#039; Spoonful,The Rolling Stones,The Ronettes,Tina Turner,Tommy Boyce",
  "content:encoded": "Episode 141 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “River Deep Mountain High'”, and at the career of Ike and Tina Turner.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nAlso, this episode was recorded before the sad death of the great Ronnie Spector, whose records are featured a couple of times in this episode, which is partly about her abusive ex-husband. Her life paralleled Tina Turner's quite closely, and if you haven't heard the episode I did about her last year, you can find it at <a href=\"https://500songs.com/podcast/episode-110-be-my-baby-by-the-ronettes/\">https://500songs.com/podcast/episode-110-be-my-baby-by-the-ronettes/</a>. I wish I'd had the opportunity to fit a tribute into this episode too.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/61251049\">on \"Wild Thing\" by the Troggs</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, all the songs excerpted in the podcast can be heard in full at <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-141-river-deep-mountain-high/\">Mixcloud</a>.\n\n<a href=\"https://amzn.to/325o24w\">Always Magic in the Air: The Bomp and Brilliance of the Brill Building Era</a> by Ken Emerson is a good overview of the Brill Building scene, and I referred to it for the material about Jeff Barry and Ellie Greenwich.\n\nI’ve referred to two biographies of Phil Spector in this episode, <a style=\"font-size: revert;\" href=\"https://amzn.to/35C05CU\"><em>Phil Spector: Out of His Head</em> by Richard Williams</a> and <a style=\"font-size: revert;\" href=\"https://amzn.to/32OKWMK\"><em>He’s a Rebel</em> by Mark Ribkowsky</a>.\n\nTina Turner has written two autobiographies. <a href=\"https://amzn.to/3Khvv40\"><em>I Tina</em></a> is now out of print but is slightly more interesting, as it contains interview material with other people in her life. <a href=\"https://amzn.to/3GAaPC5\"><em>My Love Story</em></a> is the more recent one and covers her whole life up to 2019.\n\nIke Turner's autobiography <a href=\"https://amzn.to/3FBj2EJ\"><em>Takin' Back My Name</em></a> is a despicable, self-serving, work of self-justification, and I do not recommend anyone buy or read it. But I did use it for quotes in the episode so it goes on the list.\n\n<a href=\"https://amzn.to/3FBj2EJ\"><em>Ike Turner: King of Rhythm</em></a> by John Collis is more even-handed, and contains a useful discography.\n\n<em><a href=\"https://amzn.to/3fwzGuE\">That Kat Sure Could Play!</a> </em>is a four-CD compilation of Ike Turner's work up to 1957.\n\nThe TAMI and Big TNT shows are available on a <a href=\"https://amzn.to/33J0Vze\">Blu-Ray</a> containing both performances.\n\nThere are many compilations available with some of the hits Spector produced, but I recommend getting<a href=\"https://amzn.to/3lOXT0V\"> <em>Back to Mono</em></a>, a four-CD overview of his career containing all the major singles put out by Philles.\n\nThere are sadly no good compilations of Ike and Tina Turner's career, as they recorded for multiple labels, and would regularly rerecord the hits in new versions for each new label, so any compilation you find will have the actual hit version of one or two tracks, plus a bunch of shoddy remakes. However, the hit version of \"River Deep, Mountain High\" is on <a href=\"https://amzn.to/33G1AS4\">the album of the same name</a>, which is a worthwhile album to get,.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday's episode is unfortunately another one of those which will require a content warning, because we're going to be talking about Ike and Tina Turner. For those of you who don't know, Ike Turner was possibly the most famously abusive spouse in the whole history of music, and it is literally impossible to talk about the duo's career without talking about that abuse. I am going to try not to go into too many of the details -- if nothing else, the details are very readily available for those who want to seek them out, not least in Tina's two autobiographies, so there's no sense in retraumatising people who've experienced domestic abuse by going over them needlessly -- but it would be dishonest to try to tell the story without talking about it at all.\n\nThis is not going to be an episode *about* Ike Turner's brutal treatment of Tina Turner -- it's an episode about the record, and about music, and about their musical career -- but the environment in which \"River Deep, Mountain High\" was created was so full of toxic, abusive, destructive men that Ike Turner may only be the third-worst person credited on the record, and so that abuse will come up. If discussion of domestic abuse, gun violence, cocaine addiction, and suicide attempts are likely to cause you problems, you might want to read the transcript rather than listen to the podcast.\n\nThat said, let's get on with the story.\n\nOne of the problems I'm hitting at this point of the narrative is that starting with \"I Fought the Law\" we've hit a run of incredibly intertangled stories  The three most recent episodes, this one, and nine of the next twelve, all really make up one big narrative about what happened when folk-rock and psychedelia hit the Hollywood scene and the Sunset Strip nightclubs started providing the raw material for the entertainment industry to turn into pop culture. We're going to be focusing on a small number of individuals, and that causes problems when trying to tell a linear narrative, because people don't live their lives sequentially -- it's not the case that everything happened to Phil Spector, and *then* everything happened to Cass Elliot, and *then* everything happened to Brian Wilson. All these people were living their lives and interacting and influencing each other, and so sometimes we'll have to mention something that will be dealt with in a future episode.\n\nSo I'll say here and now that we *will* be doing an episode on the Lovin' Spoonful in two weeks. So when I say now that in late 1965 the Lovin' Spoonful were one of the biggest bands around, and possibly the hottest band in the country, you'll have to take that on trust.\n\nBut they were, and in late 1965 their hit \"Do You Believe in Magic?\" had made the top ten:\n\n[Excerpt: The Lovin' Spoonful, \"Do You Believe in Magic?\"]\n\nPhil Spector, as always, was trying to stay aware of the latest trends in music, and he was floundering somewhat. Since the Beatles had hit America in 1964, the hits had dried up -- he'd produced a few minor hit records in 1964, but the only hits he'd made in 1965 had been with the Righteous Brothers -- none of his other acts were charting. And then the Righteous Brothers left him, after only a year. In late 1965, he had no hit acts and no prospect of having any.\n\nThere was only one thing to do -- he needed to start making his own folk-rock records. And the Lovin' Spoonful gave him an idea how to do that. Their records were identifiably coming from the same kind of place as people like the Byrds or the Mamas and the Papas, but they were pop songs, not protest songs -- the Lovin' Spoonful weren't doing Dylan covers or anything intellectual, but joyous pop confections of a kind that anyone could relate to. Spector knew how to make pop records like that.\n\nBut to do that, he needed a band. Even though he had been annoyed at the way that people had paid more attention to the Righteous Brothers, as white men, than they had to the other vocalists he'd made hit records with (who, as Black women, had been regarded by a sexist and racist public as interchangeable puppets being controlled by a Svengali rather than as artists in their own right), he knew he was going to have to work with a group of white male vocalist-instrumentalists if he wanted to have his own Lovin' Spoonful. And the group he chose was a group from Greenwich Village called MFQ.\n\nMFQ had originally named themselves the Modern Folk Quartet, as a parallel to the much better-known Modern Jazz Quartet, and consisted of Cyrus Faryar, Henry Diltz, Jerry Yester, and Chip Douglas, all of whom were multi-instrumentalists who would switch between guitar, banjo, mandolin, and bass depending on the song. They had combined Kingston Trio style clean-cut folk with Four Freshmen style modern harmonies -- Yester, who was a veteran of the New Christy Minstrels, said of the group's vocals that \"the only vocals that competed with us back then was Curt Boettcher's group\", and  they had been taken under the wing of manager Herb Cohen, who had got them a record deal with Warner Brothers.\n\nThey recorded two albums of folk songs, the first of which was produced by Jim Dickson, the Byrds' co-manager:\n\n[Excerpt: The Modern Folk Quartet, \"Sassafras\"]\n\nBut after their second album, they had decided to go along with the trends and switch to folk-rock. They'd started playing with electric instruments, and after a few shows where John Sebastian, the lead singer of the Lovin' Spoonful, had sat in with them on drums, they'd got themselves a full-time drummer, \"Fast\" Eddie Hoh, and renamed themselves the Modern Folk Quintet, but they always shortened that to just MFQ.\n\nSpector was convinced that this group could be another Lovin' Spoonful if they had the right song, and MFQ in turn were eager to become something more than an unsuccessful folk group. Spector had the group rehearsing in his house for weeks at a stretch before taking them into the studio.\n\nThe song that Spector chose to have the group record was written by a young songwriter he was working with named Harry Nilsson. Nilsson was as yet a complete unknown, who had not written a hit and was still working a day job, but he had a talent for melody, and he also had a unique songwriting sensibility combining humour and heartbreak. For example, he'd written a song that Spector had recorded with the Ronettes, \"Here I Sit\", which had been inspired by the famous graffito from public toilet walls -- \"Here I sit, broken-hearted/Paid a dime and only farted\":\n\n[Excerpt: The Ronettes, \"Here I Sit\"]\n\nThat ability to take taboo bodily functions and turn them into innocent-sounding love lyrics is also at play in the song that Spector chose to have the MFQ record. \"This Could be the Night\" was written by Nilsson from the perspective of someone who is hoping to lose his virginity -- he feels like he's sitting on dynamite, and he's going to \"give her some\", but it still sounds innocent enough to get past the radio censors of the mid-sixties:\n\n[Excerpt: Harry Nilsson, \"This Could Be the Night (demo)\"]\n\nSpector took that song, and recorded a version of it which found the perfect balance between Spector's own wall of sound and the Lovin' Spoonful's \"Good Time Music\" sound:\n\n[Excerpt: MFQ, \"This Could be the Night\"]\n\nBrian Wilson was, according to many people, in the studio while that was being recorded, and for decades it would remain a favourite song of Wilson's -- he recorded a solo version of it in the 1990s, and when he started touring solo for the first time in 1998 he included the song in his earliest live performances. He also tried to record it with his wife's group, American Spring, in the early 1970s, but was unable to, because while he could remember almost all of the song, he couldn't get hold of the lyrics.\n\nAnd the reason he couldn't get hold of the lyrics is that the record itself went unreleased, because Phil Spector had found a new performer he was focusing on instead.\n\nIt happened during the filming of the Big TNT Show, a sequel to the TAMI Show, released by American International Pictures, for which \"This Could Be the Night\" was eventually used as a theme song. The MFQ were actually performers at the Big TNT Show, which Spector was musical director and associate producer of, but their performances were cut out of the finished film, leaving just their record being played over the credits.\n\nThe Big TNT Show generally gets less respect than the TAMI Show, but it's a rather remarkable document of the American music scene at the very end of 1965, and it's far more diverse than the TAMI show. It opens with, of all people, David McCallum -- the actor who played Ilya Kuryakin on The Man From UNCLE -- conducting a band of session musicians playing an instrumental version of \"Satisfaction\":\n\n[Excerpt: David McCallum, \"Satisfaction\"]\n\nAnd then, in front of an audience which included Ron and Russel Mael, later of Sparks, and Frank Zappa, who is very clearly visible in audience shots, came performances of every then-current form of popular music. Ray Charles, Petula Clark, Bo Diddley, the Byrds, the Lovin' Spoonful, Roger Miller, the Ronettes, and Donovan all did multiple songs, though the oddest contribution was from Joan Baez, who as well as doing some of her normal folk repertoire also performed \"You've Lost That Lovin' Feelin'\" with Spector on piano:\n\n[Excerpt: Joan Baez and Phil Spector, \"You've Lost That Lovin' Feelin'\"]\n\nBut the headline act on the eventual finished film was the least-known act on the bill, a duo who had not had a top forty hit for four years at this point, and who were only on the bill as a last-minute fill-in for an act who dropped out, but who were a sensational live act. So sensational that when Phil Spector saw them, he knew he needed to sign them -- or at least he needed to sign one of them:\n\n[Excerpt: Ike and Tina Turner with the Ikettes, \"Please, Please, Please\"]\n\nBecause Ike and Tina Turner's performance at the Big TNT Show was, if anything, even more impressive than James Brown's performance on the TAMI Show the previous year.\n\nThe last we saw of Ike Turner was way back in episode eleven. If you don't remember that, from more than three years ago, at the time Turner was the leader of a small band called the Kings of Rhythm. They'd been told by their friend B.B. King that if you wanted to make a record, the person you go to was Sam Phillips at Memphis Recording Services, and they'd recorded \"Rocket '88\", often cited as the first ever rock and roll record, under the name of their sax player and vocalist Jackie Brenston:\n\n[Excerpt: Jackie Brenston and the Delta Cats, \"Rocket '88\"]\n\nWe looked at some of the repercussions from that recording throughout the first year and a half or so of the podcast, but we didn't look any more at the career of Ike Turner himself. While \"Rocket '88\" was a minor hit, the group hadn't followed it up, and Brenston had left to go solo. For a while Ike wasn't really very successful at all -- though he was still performing around Memphis, and a young man named Elvis Presley was taking notes at some of the shows.\n\nBut things started to change for Ike when he once again turned up at Sam Phillips' studio -- this time because B.B. King was recording there. At the time, Sun Records had still not started as its own label, and Phillips' studio was being used for records made by all sorts of independent blues labels, including Modern Records, and Joe Bihari was producing a session for B.B. King, who had signed to Modern.\n\nThe piano player on the session also had a connection to \"Rocket '88\" -- when Jackie Brenston had quit Ike's band to go solo, he'd put together a new band to tour as the Delta Cats, and Phineas Newborn Jr had ended up playing Turner's piano part on stage, before Brenston's career collapsed and Newborn became King's pianist.\n\nBut Phineas Newborn was a very technical, dry, jazz pianist -- a wonderful player, but someone who was best suited to playing more cerebral material, as his own recordings as a bandleader from a few years later show:\n\n[Excerpt: Phineas Newborn Jr, \"Barbados\"]\n\nBihari wasn't happy with what Newborn was playing, and the group took a break from recording to get something to eat and try to figure out the problem. While they were busy, Turner went over to the piano and started playing. Bihari said that that was exactly what they wanted, and Turner took over playing the part.\n\nIn his autobiography, Turner variously remembers the song King was recording there as \"You Know I Love You\" and \"Three O'Clock Blues\", neither of which, as far as I can tell, were actually recorded at Phillips' studio, and both of which seem to have been recorded later -- it's difficult to say for sure because there were very few decent records kept of these things at the time. But we do know that Turner played on a lot of King's records in the early fifties, including on \"Three O'Clock Blues\", King's first big hit:\n\n[Excerpt: B.B. King, \"Three O'Clock Blues\"]\n\nFor the next while, Turner was on salary at Modern Records, playing piano on sessions, acting as a talent scout, and also apparently writing many of the songs that Modern's artists would record, though those songs were all copyrighted under the name \"Taub\", a pseudonym for the Bihari brothers, as well as being a de facto arranger and producer for the company. He worked on many records made in and around Memphis, both for Modern Records and for other labels who drew from the same pool of artists and musicians. Records he played on and produced or arranged include several of Bobby \"Blue\" Bland's early records -- though Turner's claim in his autobiography that he played on Bland's version of \"Stormy Monday\" appears to be incorrect, as that wasn't recorded until a decade later.\n\nHe did, though, play on Bland's “Drifting from Town to Town”, a rewrite of Charles Brown's “Driftin' Blues”, on which, as on many sessions run by Turner, the guitarist was Matt “Guitar” Murphy, who later found fame with the Blues Brothers:\n\n[Excerpt: Bobby \"Blue\" Bland with Ike Turner and his Orchestra, \"Driftin' Blues\"]\n\nThough I've also seen the piano part on that credited as being by Johnny Ace – there's often some confusion as to whether Turner or Ace played on a session, as they played with many of the same artists, but that one was later rereleased as by Bobby “Blue” Bland with Ike Turner and his Orchestra, so it's safe to say that Ike's on that one.\n\nHe also played on several records by Howlin' Wolf, including \"How Many More Years\", recorded at Sam Phillips' studio:\n\n[Excerpt: Howlin' Wolf, \"How Many More Years?\"]\n\nOver the next few years he played with many artists we've covered already in the podcast, like Richard Berry and the Flairs, on whose recordings he played guitar rather than piano:\n\n[Excerpt: The Flairs, \"Baby Wants\"]\n\nHe also played guitar on records by Elmore James:\n\n[Excerpt: Elmore James, \"Please Find My Baby\"]\n\nand played with Little Junior Parker, Little Milton, Johnny Ace, Roscoe Gordon, and many, many more. As well as making blues records, he also made R&B records in the style of Gene and Eunice with his then-wife Bonnie:\n\n[Excerpt: Bonnie and Ike Turner, \"My Heart Belongs to You\"]\n\nBonnie was his fourth wife, all of them bigamous -- or at least, I *think* she was his fourth. I have seen two different lists Turner gave of his wives, both of them made up of entirely different people, though it doesn't help that many of them also went by nicknames. But Turner started getting married when he was fourteen, and as he would often put it \"you gave a preacher two dollars, the papers cost three dollars, that was it. In those days Blacks didn't bother with divorces.\"\n\n(One thing you will see a lot with Turner, unfortunately, is his habit of taking his own personal misbehaviours and claiming they were either universal, or at least that they were universal among Black people, or among men. It's certainly true that some people in the Southeastern US had a more lackadaisical attitude towards remarrying without divorce at the time than we might expect, but it was in no way a Black thing specifically -- it was a people-like-Ike-Turner thing -- see for example the very similar behaviour of Jerry Lee Lewis. I'm trying, when I quote him, not to include too many of these generalisations, but I thought it important to include that one early on to show the kind of self-justification to which he was prone throughout his entire life.)\n\nIt's largely because Bonnie played piano and was singing with his band that Turner switched to playing guitar, but there was another reason – while he disliked the attention he got on stage, he also didn't want a repeat of what had happened with Jackie Brenston, where Brenston as lead vocalist and frontman had claimed credit for what Ike thought of as his own record. Anyone who saw Ike Turner and his Kings of Rhythm was going to know that Ike Turner was the man who was making it all happen, and so he was going to play guitar up front rather than be on the piano in the background.\n\nSo Turner took guitar lessons from Earl Hooker, one of the great blues guitarists of the period, who had played with Turner's piano inspiration Pinetop Perkins before recording solo tracks like \"Sweet Angel\":\n\n[Excerpt: Earl Hooker, \"Sweet Angel\"]\n\nTurner was always happier in the studio than performing live -- despite his astonishing ego, he was also a rather shy person who didn't like attention -- and he'd been happy working on salary for Modern and freelancing on occasion for other labels like Chess and Duke. But then the Biharis had brought him out to LA, where Modern Records was based, and as Joel Bihari put it \"Ike did a great job for us, but he was a country boy. We brought him to L.A., and he just couldn't take city life. He only stayed a month, then left for East St. Louis to form his own band. He told me he was going back there to become a star.\"\n\nFor once, Turner's memory of events lined up with what other people said about him. In his autobiography, he described what happened -- \"Down in Mississippi, life is slow. Tomorrow, you are going to plough this field. The next day, you going to cut down these trees. You stop and you go on about your business. Next day, you start back on sawing trees or whatever you doing. Here I am in California, and this chick, this receptionist, is saying \"Hold on, Mr Bihari, line 2... hold line 3... Hey Joe, Mr Something or other on the phone for you.\" I thought \"What goddamn time does this stop?\"\"\n\nSo Turner did head to East St. Louis -- which is a suburb of St. Louis proper, across the Mississippi river from it, and in Illinois rather than Missouri, and at the time a thriving industrial town in its own right, with over eighty thousand people living there. Hardly the laid-back country atmosphere that Turner was talking about, but still also far from LA both geographically and culturally.\n\nHe put together a new lineup of the Kings of Rhythm, with a returning Jackie Brenston, who were soon recording for pretty much every label that was putting out blues and R&B tracks at that point, releasing records on RPM, Sue, Flair, Federal, and Modern as well as several smaller labels. usually with either Brenston or the group's drummer Billy Gayles singing lead:\n\n[Excerpt: Billy Gayles with Ike Turner's Kings of Rhythm, \"Just One More Time\"]\n\nNone of these records was a success, but the Kings of Rhythm were becoming the most successful band in East St. Louis. In the mid-fifties the only group that was as popular in the greater St. Louis metro area was the Johnny Johnson trio -- which soon became the Chuck Berry trio, and went on to greater things, while the Kings of Rhythm remained on the club circuit.\n\nBut Turner was also becoming notorious for his temper -- he got the nickname \"Pistol-Whippin' Ike Turner\" for the way he would attack people with his gun, He also though was successful enough that he built his own home studio, and that was where he recorded \"Boxtop\". a calypso song whose middle eight seems to have been nicked from \"Why Do Fools Fall In Love?\" and whose general feel owes more than a little to \"Love is Strange\":\n\n[Excerpt: Ike Turner, Carlson Oliver, and Little Ann, \"Boxtop\"]\n\nThe female vocals on that track were by Turner's new backing vocalist, who at the time went by the stage name \"Little Ann\".\n\nAnna Mae Bullock had started going to see the Kings of Rhythm regularly when she was seventeen, because her sister was dating one of the members of the band, and she had become a fan almost immediately. She later described her first experience seeing the group:\n\n\"The first time I saw Ike on stage he was at his very best, sharply dressed in a dark suit and tie. Ike wasn’t conventionally handsome – actually, he wasn’t handsome at all – and he certainly wasn’t my type. Remember, I was a schoolgirl, all of seventeen, looking at a man. I was used to high school boys who were clean-cut, athletic, and dressed in denim, so Ike’s processed hair, diamond ring, and skinny body – he was all edges and sharp cheekbones – looked old to me, even though he was only twenty-five. I’d never seen anyone that thin! I couldn’t help thinking, God, he’s ugly.\"\n\nTurner didn't find Bullock attractive either -- one of the few things both have always agreed on in all their public statements about their later relationship was that neither was ever particularly attracted to the other sexually -- and at first this had caused problems for Anna Mae. There was a spot in the show where Turner would invite a girl from the audience up on stage to sing, a different one every night, usually someone he'd decided he wanted to sleep with. Anna Mae desperately wanted to be one of the girls that would get up on stage, but Turner never picked her.\n\nBut then one day she got her chance. Her sister's boyfriend was teasing her sister, trying to get her to sing in this spot, and passed her the microphone. Her sister didn't want to sing, so Anna Mae grabbed the mic instead, and started singing -- the song she sang was B.B. King's \"You Know I Love You\", the same song that Turner always remembered as being recorded at Sun studios, and on which Turner had played piano:\n\n[Excerpt: B.B. King, \"You Know I Love You\"]\n\nTurner suddenly took notice of Anna Mae. As he would later say, everyone *says* they can sing, but it turned out that Anna Mae could. He took her on as an occasional backing singer, not at first as a full member of the band, but as a sort of apprentice, who he would teach how to use her talents more commercially.\n\nTurner always said that during this period, he would get Little Richard to help teach Anna Mae how to sing in a more uncontrolled, exuberant, style like he did, and Richard has backed this up, though Anna Mae never said anything about this. We do know though that Richard was a huge fan of Turner's -- the intro to \"Good Golly Miss Molly\":\n\n[Excerpt: Little Richard, \"Good Golly Miss Molly\"]\n\nwas taken almost exactly from the intro to \"Rocket '88\":\n\n[Excerpt: Jackie Brenston and the Delta Cats, \"Rocket '88\"]\n\nand Richard later wrote the introduction to Turner's autobiography. So it's possible -- but both men were inveterate exaggerators, and Anna Mae only joined Ike's band a few months before Richard's conversion and retirement from music, and during a point when he was a massive star, so it seems unlikely.\n\nAnna Mae started dating Raymond Hill, a saxophone player in the group, and became pregnant by him -- but then Hill broke his ankle, and used that as an excuse to move back to Clarksdale, Mississippi, to be with his family, abandoning his pregnant teenage girlfriend, and it seems to be around this point that Turner and Anna Mae became romantically and sexually involved. Certainly, one of Ike's girlfriends, Lorraine Taylor, seems to have believed they were involved while Anna Mae was pregnant, and indeed that Turner, rather than Hill, was the father. Taylor threatened Bullock with Turner's gun, before turning it on herself and attempting suicide, though luckily she survived. She gave birth to Turner's son, Ike Junior, a couple of months after Bullock gave birth to her own son, Craig.\n\nBut even after they got involved, Anna Mae was still mostly just doing odd bits of backing vocals, like on \"Boxtop\", recorded in 1958, or on 1959's \"That's All I Need\", released on Sue Records:\n\n[Excerpt: Ike Turner's Kings of Rhythm, \"That's All I Need\"]\n\nAnd it seemed that would be all that Anna Mae Bullock would do, until Ike Turner lent Art Lassiter eighty dollars he didn't want to pay back.\n\nLassiter was a singer who was often backed by his own vocal trio, the Artettes, patterned after Ray Charles' Raelettes. He had performed with Turner's band on a semi-regular basis, since 1955 when he had recorded \"As Long as I Have You\" with his vocal group the Trojans, backed by \"Ike Turner and his Orchestra\":\n\n[Excerpt: The Trojans, Ike Turner and His Orchestra, \"As Long as I Have You\"]\n\nHe'd recorded a few more tracks with Turner since then, both solo and under group names like The Rockers:\n\n[Excerpt: The Rockers, \"Why Don't You Believe?\"]\n\nIn 1960, Lassiter needed new tyres for his car, and borrowed eighty dollars from Turner in order to get them -- a relatively substantial amount of money for a working musician back then. He told Turner that he would pay him back at a recording session they had booked, where Lassiter was going to record a song Turner had written, \"A Fool in Love\", with Turner's band and the Artettes.\n\nBut Lassiter never showed up -- he didn't have the eighty dollars, and Turner found himself sat in a recording studio with a bunch of musicians he was paying for, paying twenty-five dollars an hour for the studio time, and with no singer there to record.\n\nAt the time, he was still under the impression that Lassiter might eventually show up, if not at that session, then at least at a future one, but until he did, there was nothing he could do and he was getting angry.\n\nBullock suggested that they cut the track without Lassiter. They were using a studio with a multi-track machine -- only two tracks, but that would be enough. They could cut the backing track on one track, and she could record a guide vocal on the other track, since she'd been around when Turner was teaching Lassiter the song. At least that way they wouldn't have wasted all the money.\n\nTurner saw the wisdom of the idea -- he said in his autobiography \"This was the first time I got hip to two-track stereo\" -- and after consulting with the engineer on the session, he decided to go ahead with Bullock's plan. The plan still caused problems, because they were recording the song in a key written for a man, so Bullock had to yell more than sing, causing problems for the engineer, who according to Turner kept saying things like \"Goddammit, don't holler in my microphone\".\n\nBut it was only a demo vocal, after all, and they got it cut -- and as Lassiter didn't show up, Turner took Lassiter's backing vocal group as his own new group, renaming the Artettes to the Ikettes, and they became the first of a whole series of lineups of Ikettes who would record with Turner for the rest of his life.\n\nThe intention was still to get Lassiter to sing lead on the record, but then Turner played an acetate of it at a club night where he was DJing as well as performing, and the kids apparently went wild:\n\n[Excerpt: Ike and Tina Turner, \"A Fool in Love\"]\n\nTurner took the demo to Juggy Murray at Sue Records, still with the intention of replacing Anna Mae's vocal with Lassiter's, but Murray insisted that that was the best thing about the record, and that it should be released exactly as it was, that it was a guaranteed hit.\n\nAlthough -- while that's the story that's told all the time about that record by everyone involved in the recording and release, and seems uncontested, there does seem to be one minor problem with the story, which is that the Ikettes sing \"you know you love him, you can't understand/Why he treats you like he do when he's such a good man\". I'm willing to be proved wrong, of course, but my suspicion is that Ike Turner wasn't such a progressive thinker that he was writing songs about male-male relationships in 1960. It's possible that the Ikettes were recorded on the same track as Tina's guide vocals, but if the intention was to overdub a new lead from Lassiter on an otherwise finished track, it would have made more sense for them to sing their finished backing vocal part. It seems more likely to me that they decided in the studio that the record was going to go out with Anna Mae singing lead, and the idea of Murray insisting is a later exaggeration.\n\nOne thing that doesn't seem to be an exaggeration, though, is that initially Murray wanted the record to go out as by Ike Turner's Kings of Rhythm featuring Little Ann, but Turner had other ideas. While Murray insisted \"the girl is the star\", Turner knew what happened when other people were the credited stars on his records. He didn't want another Jackie Brenston, having a hit and immediately leaving Turner right back where he started. If Little Ann was the credited singer, Little Ann would become a star and Ike Turner would have to find a new singer.\n\nSo he came up with a pseudonym. Turner was a fan of jungle women in film serials and TV, and he thought a wild-woman persona would suit Anna Mae's yelled vocal, and so he named his new star after Sheena, Queen of the Jungle, a female Tarzan knock-off comic character created by Will Eisner and Jerry Iger in the thirties, but who Turner probably knew from a TV series that had been on in 1955 and 56. He gave her his surname, changed \"Sheena\" slightly to make the new name alliterative and always at least claimed to have registered a trademark on the name he came up with, so if Anna Mae ever left the band he could just get a new singer to use the name.\n\nAnna Mae Bullock was now Tina Turner, and the record went out as by \"Ike and Tina Turner\":\n\n[Excerpt: Ike and Tina Turner, \"A Fool in Love\"]\n\nThat went to number two on the R&B charts, and hit the top thirty on the pop charts, too. But there were already problems. After Ike had had a second son with Lorraine, he then got Tina pregnant with another of his children, still seeing both women. He had already started behaving abusively towards Tina, and as well as being pregnant, she was suffering from jaundice -- she says in the first of her two autobiographies that she distinctly remembered lying in her hospital bed, hearing \"A Fool in Love\" on the radio, and thinking \"What's love got to do with it?\", though as with all such self-mythologising we should take this with a pinch of salt.\n\nTurner was in need of money to pay for lawyers -- he had been arrested for financial crimes involving forged cheques -- and Juggy Murray wouldn't give him an advance until he delivered a follow-up to \"A Fool in Love\", so he insisted that Tina sneak herself out of the hospital and go into the studio, jaundiced and pregnant, to record the follow-up. Then, as soon as the jaundice had cleared up, they went on a four-month tour, with Tina heavily pregnant, to make enough money to pay Ike's legal bills.\n\nTurner worked his band relentlessly -- he would accept literally any gig, even tiny clubs with only a hundred people in the audience, reasoning that it was better for the band's image to play  small venues that had to turn people away because they were packed to capacity, than to play large venues that were only half full. While \"A Fool in Love\" had a substantial white audience, the Ike and Tina Turner Revue was almost the epitome of the chitlin' circuit act, playing exciting, funky, tightly-choreographed shows for almost entirely Black audiences in much the same way as James Brown, and Ike Turner was in control of every aspect of the show.\n\nWhen Tina had to go into hospital to give birth, rather than give up the money from gigging, Ike hired a sex worker who bore a slight resemblance to Tina to be the new onstage \"Tina Turner\" until the real one was able to perform again. One of the Ikettes told the real Tina, who discharged herself from hospital, travelled to the venue, beat up the fake Tina, and took her place on stage two days after giving birth.\n\nThe Ike and Tina Turner Revue, with the Kings of Rhythm backing Tina, the Ikettes, and male singer Jimmy Thomas, all of whom had solo spots, were an astonishing live act, but they were only intermittently successful on record. None of the three follow-ups to \"A Fool in Love\" did better than number eighty-two on the charts, and two of them didn't even make the R&B charts, though \"I Idolize You\" did make the R&B top five. Their next big hit came courtesy of Mickey and Sylvia.\n\nYou may remember us talking about Mickey and Sylvia way back in episode forty-nine, from back in 2019, but if you don't, they were one of a series of R&B duet acts, like Gene and Eunice, who came up after the success of Shirley and Lee, and their big hit was \"Love is Strange\":\n\n[Excerpt: Mickey and Sylvia, \"Love is Strange\"]\n\nBy 1961, their career had more or less ended, but they'd recorded a song co-written by the great R&B songwriter Rose Marie McCoy, which had gone unreleased:\n\n[Excerpt: Mickey and Sylvia, \"It's Gonna Work Out Fine\"]\n\nWhen that was shelved they remade it as an Ike and Tina Turner record, with Mickey and Sylvia being Ike -- Sylvia took on all the roles that Ike would normally do in the studio, arranging the track and playing lead guitar, as well as joining the Ikettes on backing vocals, while Mickey did the spoken answering vocals that most listeners assumed were Ike, and which Ike would replicate on stage. The result, unsurprisingly, sounded more like a Mickey and Sylvia record than anything Ike and Tina had ever released before, though it's very obviously Tina on lead vocals:\n\n[Excerpt: Ike and Tina Turner, \"It's Gonna Work Out Fine\"]\n\nThat made the top twenty on the pop charts -- though it would be their last top forty hit for nearly a decade as Ike and Tina Turner. They did though have a couple of other hits as the Ikettes, with Ike Turner putting the girl group's name on the label so he could record for multiple labels. The first of these, \"I'm Blue (The Gong Gong Song)\" was a song Ike had written which would later go on to become something of an R&B standard. It featured Dolores Johnson on lead vocals, but Tina sang backing vocals and got a rare co-production credit:\n\n[Excerpt: The Ikettes, \"I'm Blue (The Gong Gong Song)\"]\n\nThe other Ikettes top forty hit was in 1965, with a song written by Steve Venet and Tommy Boyce -- a songwriter we will be hearing more about in three weeks -- and produced by Venet:\n\n[Excerpt: The Ikettes, \"Peaches 'n' Cream\"]\n\nIke wasn't keen on that record at first, but soon came round to it when it hit the charts.\n\nThe success of that record caused that lineup of Ikettes to split from Ike and Tina -- the Ikettes had become a successful act in their own right, and Dick Clark's Caravan of Stars wanted to book them, but that would have meant they wouldn't be available for Ike and Tina shows. So Ike sent a different group of three girls out on the road with Clark's tour, keeping the original Ikettes back to record and tour with him, and didn't pay them any royalties on their records. They resented being unable to capitalise on their big hit, so they quit. At first they tried to keep the Ikettes name for themselves, and got Tina Turner's sister Alline to manage them, but eventually they changed their name to the Mirettes, and released a few semi-successful records.\n\nIke got another trio of Ikettes to replace them, and carried on with Pat Arnold, Gloria Scott, and Maxine Smith as the new Ikettes,.\n\nOne Ikette did remain pretty much throughout -- a woman called Ann Thomas, who Ike Turner was sleeping with, and who he would much later marry, but who he always claimed was never allowed to sing with the others, but was just there for her looks.\n\nBy this point Ike and Tina had married, though Ike had not divorced any of his previous wives (though he paid some of them off when Ike and Tina became big). Ike and Tina's marriage in Tijuana was not remembered by either of them as a particularly happy experience -- Ike would always later insist that it wasn't a legal marriage at all, and in fact that it was the only one of his many, many, marriages that hadn't been, and was just a joke. He was regularly abusing her in the most horrific ways, but at this point the duo still seemed to the public to be perfectly matched.\n\nThey actually only ended up on the Big TNT Show as a last-minute thing -- another act was sick, though none of my references mention who it was who got sick, just that someone was needed to fill in for them, and as Ike and Tina were now based in LA -- the country boy Ike had finally become a city boy after all -- and would take any job on no notice, they got the gig.\n\nPhil Spector was impressed, and he decided that he could revitalise his career by producing a hit for Tina Turner. There was only one thing wrong -- Tina Turner wasn't an act. *Ike* and Tina Turner was an act. And Ike Turner was a control freak, just like Spector was -- the two men had essentially the same personality, and Spector didn't want to work with someone else who would want to be in charge.\n\nAfter some negotiation, they came to an agreement -- Spector could produce a Tina Turner record, but it would be released as an Ike and Tina Turner record. Ike would be paid twenty thousand dollars for his services, and those services would consist of staying well away from the studio and not interfering.\n\nSpector was going to go back to the old formulas that had worked for him, and work with the people who had contributed to his past successes, rather than leaving anything to chance. Jack Nitzsche had had a bit of a falling out with him and not worked on some of the singles he'd produced recently, but he was back. And Spector was going to work with Jeff Barry and Ellie Greenwich again.\n\nHe'd fallen out with Barry and Greenwich when \"Chapel of Love\" had been a hit for the Dixie Cups rather than for one of Spector's own artists, and he'd been working with Mann and Weill and Goffin and King instead. But he knew that it was Barry and Greenwich who were the ones who had worked best with him, and who understood his musical needs best, so he actually travelled to see them in New York instead of getting them to come to him in LA, as a peace offering and a sign of how much he valued their input.\n\nThe only problem was that Spector hadn't realised that Barry and Greenwich had actually split up.  They were still working together in the studio, and indeed had just produced a minor hit single for a new act on Bert Berns' label BANG, for which Greenwich had written the horn arrangement:\n\n[Excerpt: Neil Diamond, \"Solitary Man\"]\n\nWe'll hear more about Neil Diamond, and about Jeff Barry's work with him, in three weeks.\n\nBut Barry and Greenwich were going through a divorce and weren't writing together any more, and came back together for one last writing session with Spector, at which, apparently, Ellie Greenwich would cry every time they wrote a line about love. The session produced four songs, of which two became singles. Barry produced a version of \"I Can Hear Music\", written at these sessions, for the Ronettes, who Spector was no longer interested in producing himself:\n\n[Excerpt: The Ronettes, \"I Can Hear Music\"]\n\nThat only made number ninety-nine on the charts, but the song was later a hit for the Beach Boys and has become recognised as a classic. The other song they wrote in those sessions, though, was the one that Spector wanted to give to Tina Turner. \"River Deep, Mountain High\" was a true three-way collaboration -- Greenwich came up with the music for the verses, Spector for the choruses, and Barry wrote the lyrics and tweaked the melody slightly.\n\nSpector, Barry, and Greenwich spent two weeks in their writing session, mostly spent on \"River Deep, Mountain High\". Spector later said of the writing \"Every time we’d write a love line, Ellie would start to cry. I couldn’t figure out what was happening, and then I realised… it was a very uncomfortable situation. We wrote that, and we wrote ‘I Can Hear Music’…. We wrote three or four hit songs on that one writing session.\n\n“The whole thing about ‘River Deep’ was the way I could feel that strong bass line. That’s how it started. And then Jeff came up with the opening line. I wanted a tender song about a chick who loved somebody very much, but a different way of expressing it. So we came up with the rag doll and ‘I’m going to cuddle you like a little puppy’. And the idea was really built for Tina, just like ‘Lovin’ Feelin” was built for the Righteous Brothers.”\n\nSpector spent weeks recording, remixing, rerecording, and reremixing the backing track, arranged by Nitzsche, creating the most thunderous, overblown, example of the Wall of Sound he had ever created, before getting Tina into the studio. He also spent weeks rehearsing Tina on the song, and according to her most of what he did was \"carefully stripping away all traces of Ike from my performance\" -- she was belting the song and adding embellishments, the way Ike Turner had always taught her to, and Spector kept insisting that she just sing the melody -- something that she had never had the opportunity to do before, and which she thought was wonderful.\n\nIt was so different from anything else that she'd recorded that after each session, when Ike would ask her about the song, she would go completely blank -- she couldn't hold this pop song in her head except when she was running through it with Spector. Eventually she did remember it, and when she did Ike was not impressed, though the record became one of the definitive pop records of all time:\n\n[Excerpt: Ike and Tina Turner, \"River Deep, Mountain High\"]\n\nSpector was putting everything on the line for this record, which was intended to be his great comeback and masterpiece. That one track cost more than twenty thousand dollars to record -- an absolute fortune at a time when a single would normally be recorded in one or two sessions at most.\n\nIt also required a lot of work on Tina's part. She later estimated that she had sung the opening line of the song a thousand times before Spector allowed her to move on to the second line, and talked about how she got so hot and sweaty singing the song over and over that she had to take her blouse off in the studio and sing the song in her bra. She later said \"I still don’t know what he wanted. I still don’t know if I pleased him. But I never stopped trying.\"\n\nSpector produced a total of six tracks with Tina, including the other two songs written at those Barry and Greenwich sessions, \"I'll Never Need More Than This\", which became the second single released off the \"River Deep, Mountain High\" album, and \"Hold On Baby\", plus cover versions of Arthur Alexander's \"Every Day I Have to Cry Some\", Pomus and Shuman's \"Save the Last Dance\", and \"A Love Like Yours (Don't Come Knocking Everyday)\" a Holland-Dozier-Holland song which had originally been released as a Martha and the Vandellas B-side. The planned album was to be padded out with six tracks produced by Ike Turner, mostly remakes of the duo's earlier hits, and was planned for release after the single became the hit everyone knew it would. The single hit the Hot One Hundred soon after it was released:\n\n[Excerpt: Ike and Tina Turner, \"River Deep, Mountain High\"]\n\n...and got no higher up the charts than number eighty-eight. The failure of the record basically destroyed Spector, and while he had been an abusive husband before this, now he became much worse, as he essentially retired from music for four years, and became increasingly paranoid and aggressive towards the industry that he thought was not respectful enough of his genius.\n\nThere have been several different hypotheses as to why \"River Deep Mountain High\" was not a success. Some have said that it was simply because DJs were fed up of Spector refusing to pay payola, and had been looking for a reason to take him down a peg.\n\nIke Turner thought it was due to racism, saying later “See, what’s wrong with America, I think, is that rather than accept something for its value… what it’s doing, America mixes race in it. You can’t call that record R&B. But because it’s Tina… if you had not put Tina’s name on there and put ‘Joe Blow’, then the Top 40 stations would have accepted it for being a pop record. But Tina Turner… they want to brand her as being an R&B artist. I think the main reason that ‘River Deep’ didn’t make it here in America was that the R&B stations wouldn’t play it because they thought it was pop, and the pop stations wouldn’t play it because they thought it was R&B. And it didn’t get played at all. The only record I’ve heard that could come close to that record is a record by the Beach Boys called ‘Good Vibrations’. I think these are the two records that I’ve heard in my life that I really like, you know?”\n\nMeanwhile, Jeff Barry thought it was partly the DJs but also faults in the record caused by Phil Spector's egomania, saying \"he has a self-destructive thing going for him, which is part of the reason that the mix on ‘River Deep’ is terrible, he buried the lead and he knows he buried the lead and he cannot stop himself from doing that… if you listen to his records in sequence, the lead goes further and further in and to me what he is saying is, ‘It is not the song I wrote with Jeff and Ellie, it is not the song – just listen to those strings. I want more musicians, it’s me, listen to that bass sound. …’ That, to me, is what hurts in the long run... Also, I do think that the song is not as clear on the record as it should be, mix-wise. I don’t want to use the word overproduced, because it isn’t, it’s just undermixed.\"\n\nThere's possibly an element of all three of these factors in play. As we've discussed, 1965 seems to have been the year that the resegregation of American radio began, and the start of the long slow process of redefining genres so that rock and roll, still considered a predominantly Black music at the beginning of the sixties, was by the end of the decade considered an almost entirely white music. And it's also the case that \"River Deep, Mountain High\" was the most extreme production Spector ever committed to vinyl, and that Spector had made a lot of enemies in the music business.\n\nIt's also, though, the case  that it was a genuinely great record:\n\n[Excerpt: Ike and Tina Turner, \"River Deep, Mountain High\"]\n\nHowever, in the UK, it was promoted by Decca executive Tony Hall, who was a figure who straddled both sides of the entertainment world -- as part of his work as a music publicist he had been a presenter on Oh Boy!, written a column in Record Mirror, and presented a Radio Luxembourg show. Hall put his not-inconsiderable weight behind promoting the record, and it ended up reaching number two in the UK -- being successful enough that the album was also released over here, though it wouldn't come out in the US for several years.\n\nThe record also attracted the attention of the Rolling Stones, who invited Ike and Tina to be their support act on a UK tour, which also featured the Yardbirds, and this would be a major change for the duo in all sorts of ways. Firstly, it got them properly in contact with British musicians -- and the Stones would get Ike and Tina as support artists several times over the next few years -- and also made the UK and Europe part of their regular tour itinerary. It also gave the duo their first big white rock audience, and over the next several years they would pivot more and more to performing music aimed at that audience, rather than the chitlin' circuit they'd been playing for previously. Ike was very conscious of wanting to move away from the blues and R&B -- while that was where he'd made his living as a musician, it wasn't music he actually liked, and he would often talk later about how much he respected Keith Richards and Eric Clapton, and how his favourite music was country music. Tina had also never been a fan of blues or R&B, and wanted to perform songs by the white British performers they were meeting.\n\nThe tour also, though, gave Tina her first real thoughts of escape. She loved the UK and Europe, and started thinking about what life could be like for her not just being Ike Turner's wife and working fifty-one weeks a year at whatever gigs came along.\n\nBut it also made that escape a little more difficult, because on the tour Tina lost one of her few confidantes in the organisation. Tina had helped Pat Arnold get away from her own abusive partner, and the two had become very close, but Arnold was increasingly uncomfortable being around Ike's abuse of Tina, and couldn't help her friend the way she'd been helped. She decided she needed to get out of a toxic situation, and decided to stay in England, where she'd struck up an affair with Mick Jagger, and where she found that there were many opportunities for her as a Black woman that simply hadn't been there in the US.\n\n(This is not to say that Britain doesn't have problems with racism -- it very much does, but those problems are *different* problems than the ones that the US had at that point, and Arnold found Britain's attitude more congenial to her personally).\n\nThere was also another aspect, which a lot of Black female singers of her generation have mentioned and which probably applies here. Many Black women have said that they were astonished on visiting Britain to be hailed as great singers, when they thought of themselves as merely average. Britain does not have the kind of Black churches which had taught generations of Black American women to sing gospel, and so singers who in the US thought of themselves as merely OK would be far, far, better than any singers in the UK -- the technical standards were just so much lower here.\n\n(This is something that was still true at least as late as the mid-eighties. Bob Geldof talks in his autobiography about attending the recording session for \"We Are the World\" after having previously recorded \"Do They Know It's Christmas?\" and being astonished at how much more technically skilled the American stars were and how much more seriously they took their craft.)\n\nAnd Arnold wasn't just an adequate singer -- she was and is a genuinely great talent -- and so she quickly found herself in demand in the UK. Jagger got her signed to Immediate Records, a new label that had been started up by the Stones manager Andrew Oldham, and where Jimmy Page was the staff producer. She was given a new name, P.P. Arnold, which was meant to remind people of another American import, P.J. Proby, but which she disliked because the initials spelled \"peepee\".\n\nHer first single on the label, produced by Jagger, did nothing, but her second single, written by a then-unknown songwriter named Cat Stevens, became a big hit:\n\n[Excerpt: P.P. Arnold, \"The First Cut is the Deepest\"]\n\nShe toured with a backing band, The Nice, and made records as a backing singer with artists like the Small Faces. She also recorded a duet with the unknown singer Rod Stewart, though that wasn't a success:\n\n[Excerpt: Rod Stewart and P.P. Arnold, \"Come Home Baby\"]\n\nWe'll be hearing more about P.P. Arnold in future episodes, but the upshot of her success was that Tina had even fewer people to support her. The next few years were increasingly difficult for Tina, as Ike turned to cocaine use in a big way, became increasingly violent, and his abuse of her became much more violent. The descriptions of his behaviour in Tina's two volumes of autobiography are utterly harrowing, and I won't go into them in detail, except to say that nobody should have to suffer what she did.\n\nIke's autobiography, on the other hand, has him attempting to defend himself, even while admitting to several of the most heinous allegations, by saying he didn't beat his wife any more than most men did. Now the sad thing is that this may well be true, at least among his peer group. Turner's behaviour was no worse than behaviour from, say, James Brown or Brian Jones or Phil Spector or Jerry Lee Lewis, and it may well be that behaviour like this was common enough among people he knew that Turner's behaviour didn't stand out at all. His abuse has become much better-known, because the person he was attacking happened to become one of the biggest stars in the world, while the women they attacked didn't. But that of course doesn't make what Ike did to Tina any better -- it just makes it infinitely sadder that so many more people suffered that way.\n\nIn 1968, Tina actually tried to take her own life -- and she was so fearful of Ike that when she overdosed, she timed it so that she thought she would be able to at least get on stage and start the first song before collapsing, knowing that their contract required her to do that for Ike to get paid. As it was, one of the Ikettes noticed the tablets she had taken had made her so out of it she'd drawn a line across her face with her eyebrow pencil. She was hospitalised, and according to both Ike and Tina's reports, she was comatose and her heart actually stopped beating, but then Ike started yelling at her, saying if she wanted to die why didn't she do it by jumping in front of a truck, rather than leaving him with hospital bills, and telling her to go ahead and die if this was how she was going to treat him -- and she was so scared of Ike her heart started up again.\n\n(This does not seem medically likely to me, but I wasn't there, and they both were).\n\nOf course, Ike frames this as compassion and tough love. I would have different words for it myself.\n\nTina would make several more suicide attempts over the years, but even as Tina's life was falling apart, the duo's professional career was on the up. They started playing more shows in the UK, and they toured the US as support for the Rolling Stones. They also started having hits again, after switching to performing funked-up cover versions of contemporary hits. They had a minor hit with a double-sided single of the Beatles' \"Come Together\" and the Stones' \"Honky-Tonk Women\", then a bigger one with a version of Sly and the Family Stone's \"I Want to Take You Higher\", then had their biggest hit ever with \"Proud Mary\".\n\nIt's likely we'll be looking at Creedence Clearwater Revival's original version of that song at some point, but while Ike Turner disliked the original, Tina liked it, and Ike also became convinced of the song's merits by hearing a version by The Checkmates Ltd:\n\n[Excerpt: The Checkmates Ltd, \"Proud Mary\"]\n\nThat was produced by Phil Spector, who came briefly out of his self-imposed exile from the music business in 1969 to produce a couple of singles for the Checkmates and Ronnie Spector.\n\nThat version inspired Ike and Tina's recording of the song, which went to number four on the charts and won them a Grammy award in 1971:\n\n[Excerpt: Ike and Tina Turner, \"Proud Mary\"]\n\nIke was also investing the money they were making into their music. He built his own state-of-the-art studio, Bolic Sound, which Tina always claimed was a nod to her maiden name, Bullock, but which he later always said was a coincidence. Several other acts hired the studio, especially people in Frank Zappa's orbit -- Flo and Eddie recorded their first album as a duo there, and Zappa recorded big chunks of Over-Nite Sensation and Apostrophe('), two of his most successful albums, at the studio.\n\nActs hiring Bolic Sound also got Tina and the Ikettes on backing vocals if they wanted them, and so for example Tina is one of the backing vocalists on Zappa's \"Cosmik Debris\":\n\n[Excerpt: Frank Zappa, \"Cosmik Debris\"]\n\nOne of the most difficult things she ever had to sing in her life was this passage in Zappa's song \"Montana\", which took the Ikettes several days' rehearsal to get right.\n\n[Excerpt: Frank Zappa and the Mothers of Invention, \"Montana\"]\n\nShe was apparently so excited at having got that passage right that she called Ike out of his own session to come in and listen, but Ike was very much unimpressed, and insisted that Tina and the Ikettes not get credit on the records they made with Zappa. Zappa later said “I don’t know how she managed to stick with that guy for so long. He treated her terribly and she’s a really nice lady. We were recording down there on a Sunday. She wasn’t involved with the session, but she came in on Sunday with a whole pot of stew that she brought for everyone working in the studio. Like out of nowhere, here’s Tina Turner coming in with a rag on her head bringing a pot of stew. It was really nice.”\n\nBy this point, Ike was unimpressed by anything other than cocaine and women, who he mostly got to sleep with him by having truly gargantuan amounts of cocaine around. As Ike was descending further into paranoia and abuse, though, Tina was coming into her own. She wrote \"Nutbush City Limits\" about the town where she grew up, and it reached number 22 on the charts -- higher than any song Ike ever wrote:\n\n[Excerpt: Ike and Tina Turner, \"Nutbush City Limits\"]\n\nOf course, Ike would later claim that he wrote the music and let Tina keep all the credit.\n\nTina was also asked by the Who to appear in the film version of their rock opera Tommy, where her performance of \"Acid Queen\" was one of the highlights:\n\n[Excerpt: Tina Turner, \"Acid Queen\"]\n\nAnd while she was filming that in London, she was invited to guest on a TV show with Ann-Margret, who was a huge fan of Ike and Tina, and duetted with Tina -- but not Ike -- on a medley of her hits:\n\n[Excerpt: Tina Turner and Ann-Margret, \"Nutbush City Limits/Honky Tonk Woman\"]\n\nJust as with \"River Deep, Mountain High\", Tina was wanted for her own talents, independent of Ike. She was starting to see that as well as being an abusive husband, he was also not necessary for her to have a career. She was also starting to find parts of her life that she could have for herself, independent of her husband. She'd been introduced to Buddhist meditation by a friend, and took it up in a big way, much to Ike's disapproval.\n\nThings finally came to a head in July 1976, in Dallas, when Ike started beating her up and for the first time she fought back. She pretended to reconcile with him, waited for him to fall asleep, and ran across a busy interstate, almost getting hit by a ten-wheel truck, to get to another hotel she could see in the distance. Luckily, even though she had no money, and she was a Black woman in Dallas, not a city known for its enlightened attitudes in the 1970s, the manager of the Ramada Inn took pity on her and let her stay there for a while until she could get in touch with Buddhist friends.\n\nShe spent the next few months living off the kindness of strangers, before making arrangements with Rhonda Graam, who had started working for Ike and Tina in 1964 as a fan, but had soon become indispensable to the organisation. Graam sided with Tina, and while still supposedly working for Ike she started putting together appearances for Tina on TV shows like Cher's. Cher was a fan of Tina's work, and was another woman trying to build a career after leaving an abusive husband who had been her musical partner:\n\n[Excerpt: Cher and Tina Turner, \"Makin' Music is My Business\"]\n\nGraam became Tina's full-time assistant, as well as her best friend, and remained part of her life until Graam's death a year ago.\n\nShe also got Tina booked in to club gigs, but for a long time they found it hard to get bookings -- promoters would say she was \"only half the act\". Ike still wanted the duo to work together professionally, if not be a couple, but Tina absolutely refused, and Ike had gangster friends of his shoot up Graam's car, and Tina heard rumours that he was planning to hire a hit man to come after her.\n\nTina filed for divorce, and gave Ike everything -- all the money the couple had earned together in sixteen years of work, all the property, all the intellectual property -- except for two cars, one of which Ike had given her and one which Sammy Davis Jr. had given her, and the one truly important thing -- the right to use the name \"Tina Turner\", which Ike had the trademark on. Ike had apparently been planning to hire someone else to perform as \"Tina Turner\" and carry on as if nothing had changed.\n\nSlowly, Tina built her career back up, though it was not without its missteps. She got a new manager, who also managed Olivia Newton-John, and the manager brought in a song he thought was perfect for Tina. She turned it down, and Newton-John recorded it instead:\n\n[Excerpt: Olivia Newton-John, \"Physical\"]\n\nBut even while she was still playing small clubs, her old fans from the British rock scene were boosting her career. In 1981, after Rod Stewart saw her playing a club gig and singing his song \"Hot Legs\", he invited her to guest with him and perform the song on Saturday Night Live:\n\n[Excerpt: Rod Stewart and Tina Turner, \"Hot Legs\"]\n\nThe Rolling Stones invited Tina to be their support act on a US tour, and to sing \"Honky Tonk Women\" on stage with them, and eventually when David Bowie, who was at the height of his fame at that point, told his record label he was going to see her on a night that EMI wanted to do an event for him, half the record industry showed up to the gig.\n\nShe had already recorded a remake of the Temptations' \"Ball of Confusion\" with the British Electric Foundation -- a side project for two of the members of Heaven 17 -- in 1982, for one of their albums:\n\n[Excerpt: British Electric Foundation, \"Ball of Confusion\"]\n\nNow they were brought in to produce a new single for her, a remake of Al Green's \"Let's Stay Together\":\n\n[Excerpt: Tina Turner, \"Let's Stay Together\"]\n\nThat made the top thirty in the US, and was a moderate hit in many places, making the top ten in the UK. She followed it up with another BEF production, a remake of \"Help!\" by the Beatles, which appears only to have been released in mainland Europe. But then came the big hit:\n\n[Excerpt: Tina Turner, \"What's Love Got to Do With It?\"]\n\nwenty-six years after she started performing with Ike, Tina Turner was suddenly a major star.\n\nShe had a string of successes throughout the eighties and nineties, with more hit records, film appearances, a successful autobiography, a film based on the autobiography, and record-setting concert appearances including one which broke the record for the largest audience ever for a solo performer. She retired in 2009, apart from making appearances to promote her second autobiography and the successful stage musical based on her life. She is currently happily married to a partner she's been with for thirty-five years, and though she's had further problems in her life, including a number of health issues and the death of her oldest son, she seems fundamentally content with the latter half of her life, and fulfilled creatively, emotionally, and financially.\n\nIke Turner, on the other hand, spent the thirty-one years after Tina left him lost in cocaine addiction and resentment. Occasionally he would come up with schemes to try to get her back working with him -- at one stage during her comeback he suggested a stage show in which Ike and Tina would appear with Sonny and Cher, to be called \"The Broken Pieces Put Back Together With Crazy Glue\", which he would of course write. Understandably, neither Tina nor Cher were interested in doing a stage show with their abusive exes. He continued making music, but with little success, though in the last decade of his life he did make a couple of moderately successful blues records, and even won a Best Traditional Blues Album Grammy for his last album. He would complain bitterly every chance he got about how hard-done-by he felt about Tina leaving him, including in his autobiography, Takin' Back My Name. He married three more times after Tina, and his final wife, who he divorced after two months, later wrote an autobiography, Love Has Everything to Do With It, detailing their relationship.\n\nHe died in 2007, of a cocaine overdose, and Phil Spector, the man who had paid Ike to stay away from the studio because he was only interested in Tina, spoke bitterly at his funeral about how in his view Ike had been the real talent and Tina should have been grateful to him, and how much he had learned from Ike. Spector clearly by now saw Ike as a kindred spirit, and realised how alike they were.\n\nAt the time he spoke at the funeral, Phil Spector was on bail awaiting trial for the murder of Lana Clarkson. He was later convicted, and died in prison in January 2021.",
  "enclosure": "",
  "itunes:summary": "Episode 141 of A History of Rock Music in Five Hundred Songs looks at “River Deep Mountain High'”, and at the career of Ike and Tina Turner.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nAlso, this episode was recorded before the sad death of the great Ronnie Spector, whose records are featured a couple of times in this episode, which is partly about her abusive ex-husband. Her life paralleled Tina Turner's quite closely, and if you haven't heard the episode I did about her last year, you can find it at https://500songs.com/podcast/episode-110-be-my-baby-by-the-ronettes/. I wish I'd had the opportunity to fit a tribute into this episode too.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Wild Thing\" by the Troggs.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, all the songs excerpted in the podcast can be heard in full at Mixcloud.\n\nAlways Magic in the Air: The Bomp and Brilliance of the Brill Building Era by Ken Emerson is a good overview of the Brill Building scene, and I referred to it for the material about Jeff Barry and Ellie Greenwich.\n\nI’ve referred to two biographies of Phil Spector in this episode, Phil Spector: Out of His Head by Richard Williams and He’s a Rebel by Mark Ribkowsky.\n\nTina Turner has written two autobiographies. I Tina is now out of print but is slightly more interesting, as it contains interview material with other people in her life. My Love Story is the more recent one and covers her whole life up to 2019.\n\nIke Turner's autobiography Takin' Back My Name is a despicable, self-serving, work of self-justification, and I do not recommend anyone buy or read it. But I did use it for quotes in the episode so it goes on the list.\n\nIke Turner: King of Rhythm by John Collis is more even-handed, and contains a useful discography.\n\nThat Kat Sure Could Play! is a four-CD compilation of Ike Turner's work up to 1957.\n\nThe TAMI and Big TNT shows are available on a Blu-Ray containing both performances.\n\nThere are many compilations available with some of the hits Spector produced, but I recommend getting Back to Mono, a four-CD overview of his career containing all the major singles put out by Philles.\n\nThere are sadly no good compilations of Ike and Tina Turner's career, as they recorded for multiple labels, and would regularly rerecord the hits in new versions for each new label, so any compilation you find will have the actual hit version of one or two tracks, plus a bunch of shoddy remakes. However, the hit version of \"River Deep, Mountain High\" is on the album of the same name, which is a worthwhile album to get,.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nToday's episode is unfortunately another one of those which will require a content warning, because we're going to be talking about Ike and Tina Turner. For those of you who don't know, Ike Turner was possibly the most famously abusive spouse in the whole history of music, and it is literally impossible to talk about the duo's career without talking about that abuse. I am going to try not to go into too many of the details -- if nothing else, the details are very readily available for those who want to seek them out, not least in Tina's two autobiographies, so there's no sense in retraumatising people who've experienced domestic abuse by going over them needlessly -- but it would be dishonest to try to tell the story without talking about it at all.\n\nThis is not going to be an episode *about* Ike Turner's brutal treatment of Tina Turner -- it's an episode about the record, and about music, and about their musical career -- but the environment in which \"River Deep, Mountain High\" was created was so full of toxic, a",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 141 of A History of Rock Music in Five Hundred Songs looks at “River Deep Mountain High'”, and at the career of Ike and Tina Turner.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nAlso, this episode was recorded before the sad death of the great Ronnie Spector, whose records are featured a couple of times in this episode, which is partly about her abusive ex-husband. Her life paralleled Tina Turner's quite closely, and if you haven't heard the episode I did about her last year, you can find it at https://500songs.com/podcast/episode-110-be-my-baby-by-the-ronettes/. I wish I'd had the opportunity to fit a tribute into this episode too.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Wild Thing\" by the Troggs.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust an",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}