{
  "title": "CNN Denies We’re In A Recession To Boost Biden",
  "itunes:title": "CNN Denies We’re In A Recession To Boost Biden",
  "pubDate": "Fri, 05 Aug 2022 05:00:20 +0000",
  "guid": "d68626a1-ed33-44e7-aa92-f59291423b31",
  "link": "https://thejimmydoreshow.libsyn.com/cnn-denies-were-in-a-recession-to-boost-biden",
  "itunes:image": "",
  "description": "<p>New York Times opinion writer Paul Krugman won a Nobel Prize for Economics, but lately it seems like he’s gunning for a new prize – that of Biggest Apologist for the Biden administration. And in that role most recently Krugman has been downplaying the prospect that the United States economy is in recession, even though by all traditional definitions of the term we most certainly are. CNN’s Brian Stelter helps further the cause by giggling along as Krugman twists the language and the truth to suit the needs of his masters in the Democratic Party.<br /> <br /> Jimmy and his panel of The Dive’s Jackson Hinkle and America’s comedian Kurt Metzger discuss the contortions Krugman engages in to try to persuade us that the economy is doing super duper.<br /> <br /> Plus segments on Nancy Pelosi's word salad speech in Taiwan, the collapse of CNN's ratings and profits, and Colorado Senator Michael Bennet's \"oops\" moment revealing he may engage in insider trading.</p> <p>Also featuring Stef Zamorano and Black Agenda Report's Danny Haiphong!</p>",
  "content:encoded": "<p>New York Times opinion writer Paul Krugman won a Nobel Prize for Economics, but lately it seems like he’s gunning for a new prize – that of Biggest Apologist for the Biden administration. And in that role most recently Krugman has been downplaying the prospect that the United States economy is in recession, even though by all traditional definitions of the term we most certainly are. CNN’s Brian Stelter helps further the cause by giggling along as Krugman twists the language and the truth to suit the needs of his masters in the Democratic Party.  Jimmy and his panel of The Dive’s Jackson Hinkle and America’s comedian Kurt Metzger discuss the contortions Krugman engages in to try to persuade us that the economy is doing super duper.  Plus segments on Nancy Pelosi's word salad speech in Taiwan, the collapse of CNN's ratings and profits, and Colorado Senator Michael Bennet's \"oops\" moment revealing he may engage in insider trading.</p> <p>Also featuring Stef Zamorano and Black Agenda Report's Danny Haiphong!</p>",
  "enclosure": "",
  "itunes:duration": "57:25",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "New York Times opinion writer Paul Krugman won a Nobel Prize for Economics, but lately it seems like he’s gunning for a new prize – that of Biggest Apologist for the Biden administration. And in that role most recently Krugman has been downplaying...",
  "itunes:episodeType": "full",
  "itunes:summary": "New York Times opinion writer Paul Krugman won a Nobel Prize for Economics, but lately it seems like he’s gunning for a new prize – that of Biggest Apologist for the Biden administration. And in that role most recently Krugman has been downplaying the prospect that the United States economy is in recession, even though by all traditional definitions of the term we most certainly are. CNN’s Brian Stelter helps further the cause by giggling along as Krugman twists the language and the truth to suit the needs of his masters in the Democratic Party. Jimmy and his panel of The Dive’s Jackson Hinkle and America’s comedian Kurt Metzger discuss the contortions Krugman engages in to try to persuade us that the economy is doing super duper. Plus segments on Nancy Pelosi's word salad speech in Taiwan, the collapse of CNN's ratings and profits, and Colorado Senator Michael Bennet's \"oops\" moment revealing he may engage in insider trading. Also featuring Stef Zamorano and Black Agenda Report's Danny Haiphong!"
}