{
  "title": "Elections and Demography: Undecideds Break for Republicans",
  "link": "https://www.aei.org/politics-and-public-opinion/elections-and-demography-undecideds-break-for-republicans/",
  "dc:creator": "George Pierson",
  "pubDate": "Thu, 27 Oct 2022 18:53:21 +0000",
  "category": [
    "Politics and Public Opinion",
    "Polls",
    "Elections",
    "Midterm elections"
  ],
  "guid": "https://www.aei.org/?p=1008663822",
  "description": "<p>With Republicans taking the lead in the generic ballot for the first time in months, Democrats fear greater-than-expected losses with undecideds continuing to break for Republicans in the latest polling.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/politics-and-public-opinion/elections-and-demography-undecideds-break-for-republicans/\">Elections and Demography: Undecideds Break for Republicans</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" width=\"2554\" height=\"546\" src=\"https://www.aei.org/wp-content/uploads/2022/10/AEI-Elections-Demography-banner.jpg?x91208\" alt=\"\" class=\"wp-image-1008662428\"/></figure>\n\n\n\n<p>This is the penultimate issue of an AEIdeas series that focuses on the 2022 elections and demographic voting patterns. During the 2022 campaign, we have looked weekly at demographic subgroup averages from a month of polls.</p>\n\n\n\n<p>With less than two weeks to go until Election Day, Republicans continue to gain in the polls. For the first time since this series began, Republicans lead on the generic ballot, picking up almost a full point since our last snapshot. A fundamental midterm trend is taking hold: undecided voters breaking against the party in power. The recent swing has almost entirely consisted of a rise in Republican vote share, rather than a dip in Democratic vote share. Since August, Democrats have remained stuck around 45 percent, while in recent weeks the Republican share has shot up from 43 percent to 46 percent. As the momentum has swung towards the GOP, the number of undecideds has dropped considerably. If the remaining undecided voters continue to break hard to the right, Democrats may encounter worse losses than anticipated. The Democratic vote share in generic ballot averages will be a prime indicator in the home stretch.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><img loading=\"lazy\" width=\"677\" height=\"755\" src=\"https://www.aei.org/wp-content/uploads/2022/10/image-3.png?x91208\" alt=\"\" class=\"wp-image-1008663836\"/></figure></div>\n\n\n<p><strong>Key Findings</strong></p>\n\n\n\n<ul><li>Though up slightly from last week, Democrats still hold just a 17.5-point advantage with Hispanic voters. Since the beginning of October—just as Republicans began moving up in the polls—the Democratic advantage among Hispanics has been stuck below 20 points. If the final margin is reflective of our averages, it would represent yet another sizeable drop in Hispanic Democratic support.</li><li>Democratic hopes of a surge in support among women appear to have fallen flat. The recent <a href=\"https://www.monmouth.edu/polling-institute/reports/monmouthpoll_us_102022/\" target=\"_blank\" rel=\"noreferrer noopener\">Monmouth poll</a> has Republicans ahead by a point among women. A new <a href=\"https://emersoncollegepolling.com/national-poll-biden-approval-drops-as-republicans-congressional-control-chances-improve/\" target=\"_blank\" rel=\"noreferrer noopener\">Emerson poll</a> finds Democrats up just three points with women.</li><li>Abortion continues to recede as one of the most important issues in the midterms. Monmouth finds abortion is “extremely important” to 30 percent of voters—actually a slight decline from their September poll. Inflation, voting, crime, immigration, and jobs all ranked as more important to the American electorate. In blue states, many of which have enacted abortion protections, reproductive rights may prove far less salient issue than Democrats hope.</li><li>The latest <a href=\"https://www.nbcnews.com/meet-the-press/first-read/anger-minds-nbc-news-poll-finds-sky-high-interest-polarization-ahead-m-rcna53512\" target=\"_blank\" rel=\"noreferrer noopener\">NBC News poll</a> has more bad news for Democrats. The issue preferences of persuadable and undecided voters closely align with Republican voters. For example, 43 percent of Democrats list “threats to democracy” as a top-two issue, but only 17 percent of undecided voters do the same.</li><li>Bill McInturff of Public Opinion Strategies provides historical analysis of the “Direction of Country” and “Direction of Economy” polling questions, placing the 2022 midterm fundamentals in line with the wave years of 1994, 2006, 2010, and 2018, particularly when combined with President Joe Biden’s underwater approval rating. While wrong track almost always wins a majority, the right track/wrong track difference is the largest since NBC began asking the question.</li><li>If our averages are filtered to include only live-caller polls—generally considered the gold standard of polling—the Republican lead jumps up another point. A similar increase occurs when only likely voter polls are included. Both are indications that our cumulative average may be slightly understating the Republican generic ballot lead.</li></ul>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><img loading=\"lazy\" width=\"813\" height=\"834\" src=\"https://www.aei.org/wp-content/uploads/2022/10/image-4.png?x91208\" alt=\"\" class=\"wp-image-1008663839\"/></figure></div>\n\n\n<p><em>Previous election data is drawn from </em><a href=\"https://catalist.us/wh-national/\" target=\"_blank\" rel=\"noreferrer noopener\"><em>Catalist crosstab estimates</em></a><em>. Catalist is a Democratic data analytics organization.</em></p>\n\n\n\n<p>*<em>How we did this: This month-long average is a compilation of online and live-caller polls that release crosstabs. Internal and explicitly partisan polls are excluded. This edition averages polls from Monmouth University, Grinnell College/Selzer & Company, Washington Post/ABC News, Economist/YouGov, Morning Consult/Politico, Harvard/Harris, CBS News, Emerson, Yahoo News, Rasmussen, Echelon Insights, Marist College/NPR/PBS NewsHour, New York Times/Siena College, and Fox News.</em></p>\n\n\n\n<div class=\"related-items shortcode \"><p><strong>Learn more: </strong><a href=\"https://www.aei.org/politics-and-public-opinion/elections-and-demography-democrats-lose-ground-need-strong-turnout/\">Elections and Demography: Democrats Lose Ground, Need Strong Turnout</a> | <a href=\"https://www.aei.org/politics-and-public-opinion/elections/elections-and-demography-one-month-to-go/\">Elections and Demography: One Month to Go</a> | <a href=\"https://www.aei.org/politics-and-public-opinion/elections-and-demography-signs-of-a-tightening-race/\">Elections and Demography: Signs of a Tightening Race</a> | <a href=\"https://www.aei.org/politics-and-public-opinion/elections-and-demography-who-are-the-likely-voters/\">Elections and Demography: Who Are the Likely Voters?</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/politics-and-public-opinion/elections-and-demography-undecideds-break-for-republicans/\">Elections and Demography: Undecideds Break for Republicans</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}