{
  "id": "https://bibleinoneyear.org/en/youth/194",
  "title": "Day 194: How to Worship God",
  "description": "Psalm 84:8–12, 2 Kings 25:27–30, Romans 1:20–32.  The painting only came alive to those on their knees in prayer  The right perspective is the position of worship",
  "pubDate": "Tue, 13 Jul 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/194/?ignore",
  "itunes:duration": "14:10",
  "guid": "enyouth13072021-194",
  "length": 850.31,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 194: How to Worship God",
  "itunes:subtitle": "Psalm 84:8–12, 2 Kings 25:27–30, Romans 1:20–32.  The painting only came alive to those on their knees in prayer  The right perspective is the position of worship",
  "itunes:summary": "In his book, The Vision and The Vow, Pete Greig tells of how a distinguished art critic was studying an exquisite painting by the Italian Renaissance master Filippino Lippi. He stood in London’s National Gallery gazing at the fifteenth-century depiction of Mary holding the infant Jesus on her lap, with saints Dominic and Jerome kneeling nearby. But the painting troubled him. There could be no doubting Lippi’s skill, his use of colour or composition. But the proportions of the picture seemed slightly wrong. The hills in the background seemed exaggerated, as if they might topple out of the frame at any minute onto the gallery’s polished floor. The two kneeling saints looked awkward and uncomfortable.\nArt critic Robert Cumming was not the first to criticise Lippi’s work for its poor perspective, but he may well be the last to do so, because at that moment he had a revelation. It suddenly occurred to him that the problem might be his. The painting had never been intended to come anywhere near a gallery. Lippi’s painting had been commissioned to hang in a place of prayer.\nThe dignified critic dropped to his knees in the public gallery before the painting. He suddenly saw what generations of art critics had missed. From his new vantage point, Robert Cumming found himself gazing up at a perfectly proportioned piece. The foreground had moved naturally to the background, while the saints seemed settled – their awkwardness, like the painting itself, having turned to grace. Mary now looked intently and kindly directly at him as he knelt at her feet between saints Dominic and Jerome.\nIt was not the perspective of the painting that had been wrong all these years, it was the perspective of the people looking at it. Robert Cumming, on bended knee, found a beauty that Robert Cumming the proud art critic could not. The painting only came alive to those on their knees in prayer. The right perspective is the position of worship.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 194
}