{
  "title": "57: A Murder in the Park",
  "link": "https://audioboom.com/posts/7002511",
  "itunes:episode": 57,
  "itunes:title": "A Murder in the Park",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3603,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Look, the specifics of this story are confusing AF. BUT at the heart of it, we’re dealing with a murder, a wrongful conviction, a false confession and A. WOMAN. NAMED. SHAWN. (She’s garbage, but we’re obsessed with the gender swapping name situation.).</p>\n\n\n<p>With his execution just 48 hours away, Anthony Porter's life was saved by a Northwestern University journalism class. Their re-investigation of the crime for which he was convicted-a double homicide in a Chicago park-led to the discovery of the real killer, Alstory Simon, whose confession exonerated Porter. If it all sounds too good to be true, it's because, as compellingly argued here, Porter actually is guilty, Simon is an innocent man and both are just pawns in a much larger plan.</p>\n\n\n<p><strong>LOOKING FOR MORE TCO?</strong> <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Check out our bonus episodes on Patreon</a>! We covered <strong>\"Serial\"</strong> episode-by-episode and capped the series off with an interview with <strong>Rabia Chaudry</strong>--Adnan's friend who brought his story to <strong>Sarah Koenig</strong> AND with <strong>Asia Mcclain</strong>--Adnan's alibi witness! Now we're covering <strong>\"The Staircase\"</strong> episode-by-episode. Episodes 1 - 7 are live now! We also have extended outtakes for our episodes and two other full bonus episodes--<strong>ALL COMMERCIAL FREE! </strong><a href=\"https://www.patreon.com/TrueCrimeObsessed\">Join here!</a></p>\n\n\n<p><strong>Looking for our Advertisers / Promo Codes?</strong> <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">Go Here!</a> We now have a whole page of our site for you to check out and <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">GET. THOSE. DISCOUNTS!</a></p>\n",
  "pubDate": "Tue, 11 Sep 2018 04:01:00 +0000",
  "guid": "tag:audioboom.com,2018-09-11:/posts/7002511",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}