{
  "title": "3 Painful Mistakes Leaders Can Avoid When Buying AI Solutions",
  "link": "https://kavita-ganesan.com/buying-ai-solutions/",
  "comments": "https://kavita-ganesan.com/buying-ai-solutions/#respond",
  "dc:creator": "Kavita Ganesan",
  "pubDate": "Fri, 04 Jun 2021 18:53:21 +0000",
  "category": [
    "AI Strategy",
    "Business AI",
    "undefined"
  ],
  "guid": "https://kavita-ganesan.com/?p=5925",
  "description": "Buying AI solutions requires the right strategy. In this article, we explore 3 mistakes to avoid when buying AI. ",
  "content:encoded": "<p><a href=\"https://sloanreview.mit.edu/projects/reshaping-business-with-artificial-intelligence/#:~:text=Almost%2085%25%20believe%20AI%20will,or%20sustain%20a%20competitive%20advantage.&text=Our%20research%20reveals%20large%20gaps,is%20their%20approach%20to%20data.\">85% of global executives believe that AI can become their competitive advantage</a>. So, the rush to AI adoption is understandable. Unfortunately, implementing AI from scratch takes time, and success comes with <em>experience </em>in building and deploying solutions.</p>\n<p>To speed things up, “buying” instead of building from scratch seems like a sensible way to get started; You don’t have to hire a team of data scientists, spend on additional infrastructure, or have support staff on call to troubleshoot model problems. Plus, off-the-shelf solutions are often rigorously tested.</p>\n<p>But buying AI solutions is tricky. If you don’t pursue it strategically, you could be buying your way into trouble. Here are three mistakes I see companies make (which you should avoid) when considering third-party AI solutions.</p>\n<div class=\"wp-block-spacer\" style=\"height: 38px;\" aria-hidden=\"true\"></div>\n<h2>1: Not testing vendor performance</h2>\n<p>Performance, what performance, you may be thinking? This is the accuracy or error rate that vendors publish to sell their AI solutions. For example, a vendor may claim a 3%<em> word error rate</em> in automatic speech recognition. Often, you’ll find that vendors tout shiny performance numbers. By itself, this is not a problem, it gives you an idea of how <em>usable</em> the solution is. The problem really starts when you take these numbers at face value.</p>\n<p>The data that vendors use to test their solution, can look very different from your company data. Let’s take a sentiment classifier (sentiment classifiers predict sentiment polarity such as positive/negative on some given text). Say a third-party API boasts 98% accuracy on a user reviews dataset, but your plan is not to use it on user reviews. You want to use it for forum comments. Do you think that the 98% accuracy will still hold? It’s unlikely.</p>\n<p class=\"has-background\" style=\"background-color: #eeeeee;\"><strong>Action Tip: </strong>To avoid buying into a solution that works on paper, but not on your data, test, test, test—on your own data before making a purchase decision. Use additional metrics that make sense for the problem, and do a side-by-side performance comparison of different vendor solutions on YOUR data.</p>\n<div class=\"wp-block-spacer\" style=\"height: 38px;\" aria-hidden=\"true\"></div>\n<h2>2: Not thinking about long-term costs and risks</h2>\n<p>One significant advantage of buying a solution vs. custom development is cost. It’s often cheaper to buy an off-the-shelf solution than to custom build, especially in-house. It’s also more convenient as you don’t have to put together a team for development. But is this truly more cost-effective?</p>\n<p>If you skipped the testing step above, your AI solution could be error-prone even without you knowing it. And with that comes the risks. Are you losing customers because of bad predictions? Are customers constantly complaining due to problems introduced by your AI solution? This not only costs customers, but also your reputation.</p>\n<p>Also, the pricing of third-party solutions can change with time, and some solutions need specialized infrastructure, which can be hard to maintain. Navigating through such issues would require additional investments. While you thought you got a good deal, costs may be quietly adding up.</p>\n<p class=\"has-background\" style=\"background-color: #eeeeee;\"><strong>Action Tip:</strong> Think through the potential risks of the third-party AI solution in consideration and have a fallback plan. The costs and performance of the AI solution may be justified today. But long-term costs due to lower than desired accuracy, additional infrastructure requirements, and pricing changes may require that you switch paths. Having a plan B can help you act swiftly.</p>\n<div class=\"wp-block-spacer\" style=\"height: 38px;\" aria-hidden=\"true\"></div>\n<h2>3: Not considering business systems compatibility</h2>\n<p>When evaluating third-party AI solutions, many companies go with solutions that use the latest techniques or with the highest published accuracy. But this may not always be the right move for your organization. Third-party AI solutions come in all shapes and forms. Some are available as a cloud service. Some require code integration with your existing software systems.</p>\n<div class=\"wp-block-image is-style-default\">\n<figure class=\"aligncenter size-large\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-13265\" src=\"https://i1.wp.com/www.opinosis-analytics.com/wp-content/uploads/2021/06/buying-ai_incompatible-systems.jpeg?resize=600%2C263&ssl=1\" alt=\"buying ai_incompatible systems\" width=\"600\" height=\"263\" data-recalc-dims=\"1\"><figcaption>Incompatible software systems can create a mess</figcaption></figure>\n</div>\n<p>Without compatibility between the consumer application and the AI solution, you’d have to jump through many hoops to get the consumer application and the AI solution talking. If you find that integration is impossible or just too expensive <em>after </em>you’ve purchased the solution, it’s too late. You risk wasting the subscription or license altogether.</p>\n<p class=\"has-background\" style=\"background-color: #eeeeee;\"><strong>Action Tip: </strong>When testing different vendor solutions, try to attempt light integration with a handful of shortlisted solutions. This will help guide your purchase decision to solutions that not just perform well but are also easy to integrate.</p>\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-13252\" src=\"https://i0.wp.com/www.opinosis-analytics.com/wp-content/uploads/2021/06/buying-ai-solutions-3-mistakes-companies-should-avoid-1.png?w=1000&ssl=1\" alt=\"buying ai solutions --3 mistakes companies should avoid\" width=\"-42\" height=\"-32\" data-recalc-dims=\"1\"><figcaption>The Best Third-Party AI Solutions Have 3 Core Properties</figcaption></figure>\n</div>\n<div class=\"wp-block-spacer\" style=\"height: 38px;\" aria-hidden=\"true\"></div>\n<h2>Final Word About Buying AI Solutions</h2>\n<p>Buying off-the-shelf AI solutions can be a convenient option to hit the ground running with AI. But doing it strategically is essential. High vendor published accuracy doesn’t automatically mean high accuracy on your company data. Or a cheap off-the-shelf AI solution does not mean it’s truly more cost-effective. This is why it’s best to dig deeper as you’re shortlisting solutions.</p>\n<p>Use the action tips from above as a starting point to guide your purchase decisions. Establishing performance benchmarks, investigating integration compatibility, and analyzing costs and risks are all within your control. Plus, the groundwork that you lay today, will serve you in the long term, such as when you’re looking to revert to an in-house solution or want to consider other third-party options.</p>\n<p>The post <a href=\"https://www.opinosis-analytics.com/blog/buying-ai-solutions/#.YLp2UqhKhPY\" rel=\"nofollow\">3 Painful Mistakes Leaders Can Avoid When Buying AI Solutions</a> appeared first on <a href=\"https://www.opinosis-analytics.com\" rel=\"nofollow\">Opinosis Analytics</a>.</p>\n",
  "wfw:commentRss": "https://kavita-ganesan.com/buying-ai-solutions/feed/",
  "slash:comments": 0,
  "post-id": 5925
}