{
  "title": "EPISODE 68: My Grandma and Her Bombs: A Story of WWII",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Sun, 04 Oct 2020 21:39:31 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2020/10/4/episode-68-my-grandma-and-her-bombs-a-story-of-wwii",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5f7a3f6924f75f5a9dbaaaf6",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1601847431658-YMUP76CUBGE44802W0XV/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5f7a4086bb9a9f741d6e8567\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1601847431658-YMUP76CUBGE44802W0XV/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“Women must obey… My opinion of women’s role within the state is against any kind of feminism. In our state, women must not count.” —</em> Benito Mussolini&nbsp;</p><p class=\"\"><em>“Yes, I participated in the actions. I usually had the task of carrying the weapons and would hand them to our shooters. As soon as they had used them, I’d get them back from them—still hot.” —</em> Liana Germani&nbsp;</p><p class=\"\"><em>“I was mostly afraid of torture had they captured me, of the terrible suffering on the way to the concentration camps. Death seemed simple, something quick, liberating. Fear was a constant element of our daily lives.” —</em> Liana Germani &nbsp;</p><p class=\"\">This is a tale of Italian Resistance during WW II. Unlike nearly all History on Fire episodes, this is not a story I researched in books. It’s a much more personal one—these are my grandparents’ experiences. The starring role goes to my grandmother, Liana Germani, who as a teenager was a combat partisan active against the Fascist regime and the Nazi occupation. What I remember of her... there was a constant hint of sadness and pessimism hanging around her. It may have to do with the fact that during WW II, she found her boyfriend murdered--cut into pieces by fascists. She spent the rest of her teenage years smuggling guns & bombs, and doing what she could to kill them all.&nbsp;</p><p class=\"\">Honorable mention also to my paternal grandparents—in particular my grandfather Stelio Bolelli, who found his way into fighting alongside Allied troops all the way through the Gothic Line.&nbsp;</p><p class=\"\">In the course of this episode we’ll talk about a brief history of Fascism, DMX & the Matteotti murder, the collusion between fascist leaders and Sinclair Oil, the Badoglio government, the Nazi occupation, the massacre of St. Anna di Stazzema, guerrilla in the streets of Milan, gender roles in fascist Italy, my grandma’s friends being executed, PTSD, carrying bombs & smuggling weapons, my grandfather avoiding execution, the Gorla massacre, and much, much more.&nbsp;</p>",
  "media:content": {
    "media:title": "EPISODE 68: My Grandma and Her Bombs: A Story of WWII"
  }
}