{
  "title": "Study sounds alarm over ‘forever chemicals’ in pet food",
  "link": "https://www.rt.com/news/565905-pet-food-pfas-chemicals-packaging/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565905-pet-food-pfas-chemicals-packaging/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6364091785f5402e4d280a72.jpg\" /> The Environmental Working Group found toxic ‘forever chemicals’ in every bag of pet food it tested in the US <br/><a href=\"https://www.rt.com/news/565905-pet-food-pfas-chemicals-packaging/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>US researchers with the Environmental Working Group believe the toxins leach from packaging into the contents</strong></p>\n            \n                        \n            <p>Many of the leading cat and dog food products sold in the US are contaminated with toxic chemicals called per- and polyfluoroalkyl substances (PFAS). The toxins are especially deadly for pets, the Environmental Working Group (EWG) revealed in a report published on Thursday. &nbsp;</p>\n<p>PFAS are used to make products resistant to water and heat. These substances are also known as &lsquo;forever chemicals,&rsquo; as they don&rsquo;t break down naturally.&nbsp;&nbsp;</p>\n<p>EWG found seven individual PFAS in the packaging of seven pet food brands it tested, with Purina Cat Chow Complete Chicken Flavor topping the list with the highest contamination levels of 244.7 parts per billion (ppb). Kibbles &rsquo;n Bits Bacon and Steak flavor contained 14.3 ppb total PFAS, while other brands&rsquo; bags came in under 15 ppb each.&nbsp;</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2021.11/thumbnail/6182f3dc85f54078b03b1dd4.JPG\" alt=\"© Reuters / Regis Duvignau\" />\n            <figcaption><a href=\"https://www.rt.com/usa/539303-tap-water-pollution-radioactive/\">Damning analysis discovers US tap water is a ‘cocktail of chemicals’</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Traces of the &lsquo;forever chemicals&rsquo; were further discovered in the packaging of all 11 pet food varieties EWG submitted to an independent lab.</p>\n<p>While no legal framework exists to limit PFAS in food, it&rsquo;s questionable whether any level of the substances can really be said to be &lsquo;safe,&rsquo; given that they are linked to cancer, kidney and liver disease, immune problems, birth defects, and other health issues.&nbsp;</p>\n<p>EWG science analyst Sydney Evans hypothesized that the chemicals were used in manufacturing the bags to make them grease-repellant and that they could be expected to leach into the kibble inside, which was not tested for the study. A similar phenomenon has been observed with fast-food wrappers leaching PFAS into the human food contained therein. However, the Food and Drug Administration has declined to ban the substances&rsquo; use in food packaging.&nbsp;&nbsp;</p>\n<p>&ldquo;<em>We need strong new state and federal actions to eliminate sources of PFAS pollution&hellip;and end unnecessary uses of PFAS in pet food packaging and in products found in and around the home</em>,&rdquo; Evans told The Guardian. The chemicals&rsquo; ubiquity in consumer products has led to some 97% of Americans having detectable levels of PFAS in their blood, though the EWG believes banning the chemicals might someday lower that number.</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 16:31:51 +0000",
  "dc:creator": "RT"
}