{
  "id": "https://bibleinoneyear.org/en/youth/85",
  "title": "Day 85: The Fullness of the Blessing",
  "description": "Psalm 37:21–26, Numbers 21:4–9,16, Luke 6:12–36.  Each of the passages today is about blessings and curses  The key to the fullness of the blessing is generosity – ‘the righteous give generously’ (Psalm 37:21)",
  "pubDate": "Fri, 26 Mar 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/85/?ignore",
  "itunes:duration": "14:01",
  "guid": "enyouth26032021-85",
  "length": 841.77,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 85: The Fullness of the Blessing",
  "itunes:subtitle": "Psalm 37:21–26, Numbers 21:4–9,16, Luke 6:12–36.  Each of the passages today is about blessings and curses  The key to the fullness of the blessing is generosity – ‘the righteous give generously’ (Psalm 37:21)",
  "itunes:summary": "Mother Teresa once gave an interview to Hello! magazine. She was asked the question, ‘Is it only the affluent who give?’\nShe replied, ‘No, even the poorest of the poor give. The other day a very poor beggar came up to me and said, “Everyone gives to you and I also want to give you twenty paisa” – which is about two pence. I thought to myself, what do I do? If I take it he won’t have anything to eat, but if I don’t take it I would hurt him so much. So I took, and he was so happy because he had given to Mother Teresa of Calcutta to help the poor. Giving cleans the heart and helps you get closer to God. You get so much back in return.’\nGenerosity is not just a nice character trait that people have. It is right at the heart of what our faith is all about. C.S. Lewis defined Christianity as ‘a kind of giving’. God has poured out his generosity to you in Jesus (John 3:16), and you are called to respond in faith and generosity to others. Each of the passages today is about blessings and curses. The key to the fullness of the blessing is generosity – ‘the righteous give generously’ (Psalm 37:21).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 85
}