{
  "id": "yt:video:EgDpc2Oh4LE",
  "yt:videoId": "EgDpc2Oh4LE",
  "yt:channelId": "UC0uTPqBCFIpZxlz_Lv1tk_g",
  "title": "Philosophy: forgiveness and hubris",
  "link": "",
  "author": {
    "name": "Protesilaos Stavrou",
    "uri": "https://www.youtube.com/channel/UC0uTPqBCFIpZxlz_Lv1tk_g"
  },
  "published": "2022-10-25T15:15:15+00:00",
  "updated": "2022-10-29T06:45:26+00:00",
  "media:group": {
    "media:title": "Philosophy: forgiveness and hubris",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Find all my publications on my website: https://protesilaos.com\n\n* * *\n\nI walked and talked philosophy for an hour.  In this presentation, I talked about the substance of values, with forgiveness as a case in point.  To make the topic more relatable, I described what \"hubris\" is and offered some concrete examples.\n\nThe contents in brief:\n\n* Real story of a person that would not let go of something trivial that happened more than 30 years ago.\n* Link it to the mistake of appreciating forgiveness or anything pertaining to self-improvement only with regard to its ultimate rewards.  This also relates to the previous entry [on self-improvement](https://protesilaos.com/books/2022-10-21-self-improvement/).\n* The practical aspect of forgiveness in the here-and-now is that we keep ourselves free from useless burdens, else garbage.  We can then focus our limited resources on something more useful.\n* Talk about the myth of Sisyphus and how it essentially describes the struggles of the person who does not let go.\n* Comment on the theme of non-ownership, though it is not the focus here.  I talked more about this in [loss, entitlement, and presence](https://protesilaos.com/books/2022-10-17-loss-entitlement-presence/).\n* Explain another story of me not becoming a priest and how it relates to this case.\n* Talk about the misplaced ritualistic view we have of certain precepts.  Basically, we miss the point as we cater to the appearances while disregarding the essential teachings.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}