{
  "title": "let us now praise data engineers",
  "link": "https://medriscoll.com/2013/05/06/let-us-now-praise-data-engineers/",
  "comments": "https://medriscoll.com/2013/05/06/let-us-now-praise-data-engineers/#respond",
  "dc:creator": "Michael Driscoll",
  "pubDate": "Mon, 06 May 2013 17:08:00 +0000",
  "category": "Uncategorized",
  "guid": "https://medriscoll.com/2013/05/06/let-us-now-praise-data-engineers/",
  "description": "<p>In the last year, the data scientist has been called&#160;“the sexiest job of the 21st century.” &#160;But if data is the new oil, and data scientists are its petrochemical high priests, who are the oil riggers? &#160;Who are the roughnecks doing the dirty work to get data pipelines flowing, unpacking bytes, transforming formats, loading databases?<a class=\"more-link\" href=\"https://medriscoll.com/2013/05/06/let-us-now-praise-data-engineers/\">Continue reading <span class=\"screen-reader-text\">\"let us now praise data engineers\"</span></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://medriscoll.com/2013/05/06/let-us-now-praise-data-engineers/\">let us now praise data engineers</a> appeared first on <a rel=\"nofollow\" href=\"https://medriscoll.com\">m. e. driscoll</a>.</p>\n",
  "content:encoded": "\n<figure class=\"wp-block-image tmblr-full\"><img decoding=\"async\" src=\"https://i0.wp.com/64.media.tumblr.com/2024d7db4af8f4ee6ed57b7eae18cba1/9b41f64f0fdae76b-c8/s540x810/f18b6c212d0f8145d1efe81f716ecec5c01ba0da.png?w=750&#038;ssl=1\" alt=\"image\" data-recalc-dims=\"1\" /></figure>\n\n\n\n<p>In the last year, the data scientist has been called&nbsp;<a href=\"http://hbr.org/2012/10/data-scientist-the-sexiest-job-of-the-21st-century/\" target=\"_blank\" rel=\"noopener\">“the sexiest job of the 21st century</a>.” &nbsp;But if data is the new oil, and data scientists are its petrochemical high priests, who are the oil riggers? &nbsp;Who are the roughnecks doing the dirty work to get data pipelines flowing, unpacking bytes, transforming formats, loading databases?</p>\n\n\n\n<p>They are the data engineers, and their brawny skills are more critical than ever. &nbsp;As the era of Big Data pivots from research to development, from theoretical blueprints to concrete infrastructure, the notional demand for data science is being dwarfed by the true need for data engineering.</p>\n\n\n\n<p><!-- more -->A stark but recurring reality in the business world is this: when it comes to working with data, statistics and mathematics are rarely the rate-limiting elements in moving the needle of value. &nbsp;Most firms’ unwashed masses of data sit far lower on Maslow’s hierarchy&nbsp;at the level of basic nurture and shelter. &nbsp;What is needed for this data isn’t philosophy, religion, or science – what’s needed is basic, scalable infrastructure.</p>\n\n\n\n<p>It’s the data engineers who can build this infrastructure, and they represent the true talent shortage of Silicon Valley and beyond. &nbsp;Their unsexy but critical&nbsp;skills include crafting Hadoop pipelines,&nbsp;programming of&nbsp;job schedulers, and parsing&nbsp;broad classes of data – timestamps, currencies, lat & long coordinates – which are the screws, bolts, and ball bearings in the&nbsp;<a href=\"http://strata.oreilly.com/2008/11/the-commoditization-of-massive.html\" target=\"_blank\" rel=\"noopener\">industrial age of data</a>.</p>\n\n\n\n<p>Let us now praise these unsung heroes, the data engineers, who are building the invisible but essential digital underground.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://medriscoll.com/2013/05/06/let-us-now-praise-data-engineers/\">let us now praise data engineers</a> appeared first on <a rel=\"nofollow\" href=\"https://medriscoll.com\">m. e. driscoll</a>.</p>\n",
  "wfw:commentRss": "https://medriscoll.com/2013/05/06/let-us-now-praise-data-engineers/feed/",
  "slash:comments": 0,
  "post-id": 70
}