{
  "title": "Which is Safer: Rental Houses or Stock Investments? (a Case Study)",
  "link": "https://www.mrmoneymustache.com/2022/06/21/rental-houses-vs-stocks/",
  "comments": "https://www.mrmoneymustache.com/2022/06/21/rental-houses-vs-stocks/#comments",
  "dc:creator": "Mr. Money Mustache",
  "pubDate": "Tue, 21 Jun 2022 17:22:31 +0000",
  "category": [
    "The MMM Blog",
    "investing",
    "Real Estate",
    "Retirement"
  ],
  "guid": "https://www.mrmoneymustache.com/?p=18195",
  "description": "During our recent discussion on Inflation, a Badass reader stopped by and caught my attention by dropping the following block of wisdom into the comments section:&#160; “A final note if you are worried about inflation: sledgehammer the TV and go for a walk in the woods. Trees get bigger every year unless you cut them [&#8230;]",
  "content:encoded": "<a class=\"featured_image_link\" href=\"https://www.mrmoneymustache.com/2022/06/21/rental-houses-vs-stocks/\"><img style=\"max-width:100%;height:auto\" width=\"469\" height=\"461\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/06/mmm-construction-mini.jpg\" class=\"attachment-full size-full wp-post-image\" alt=\"\" loading=\"lazy\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/06/mmm-construction-mini.jpg 469w, https://www.mrmoneymustache.com/wp-content/uploads/2022/06/mmm-construction-mini-300x295.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/06/mmm-construction-mini-183x180.jpg 183w, https://www.mrmoneymustache.com/wp-content/uploads/2022/06/mmm-construction-mini-150x147.jpg 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/06/mmm-construction-mini-65x65.jpg 65w\" sizes=\"(max-width: 469px) 100vw, 469px\" /></a>\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-full is-resized\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/06/mmm-construction-1.jpg\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/06/mmm-construction-1.jpg\" alt=\"\" class=\"wp-image-18199\" width=\"460\" height=\"452\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/06/mmm-construction-1.jpg 969w, https://www.mrmoneymustache.com/wp-content/uploads/2022/06/mmm-construction-1-300x295.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/06/mmm-construction-1-183x180.jpg 183w, https://www.mrmoneymustache.com/wp-content/uploads/2022/06/mmm-construction-1-768x755.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/06/mmm-construction-1-150x147.jpg 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/06/mmm-construction-1-900x884.jpg 900w, https://www.mrmoneymustache.com/wp-content/uploads/2022/06/mmm-construction-1-65x65.jpg 65w\" sizes=\"(max-width: 460px) 100vw, 460px\" /></a><figcaption>Another fine day in Retirement</figcaption></figure></div>\n\n\n\n<p>During our recent discussion on <a href=\"https://www.mrmoneymustache.com/2022/01/11/inflation-should-we-be-worried/\" target=\"_blank\" rel=\"noreferrer noopener\">Inflation</a>, a Badass reader stopped by and caught my attention by dropping the following block of wisdom into the comments section:&nbsp;</p>\n\n\n\n<p class=\"has-text-align-center\">“<em>A final note if you are worried about inflation: sledgehammer the TV and go for a walk in the woods. Trees get bigger every year unless you cut them down.”</em></p>\n\n\n\n<p>That sentence was just one piece of a <a rel=\"noreferrer noopener\" href=\"https://www.mrmoneymustache.com/2022/01/11/inflation-should-we-be-worried/#comment-2978162\" target=\"_blank\">sizable rant</a> that this gentleman named Aaron contributed at the time, and I applauded him for sharing it. Little did I know he was about to hit me with a case study request that struck home in so many ways that I knew we had to cover it right away.&nbsp;</p>\n\n\n\n<p>At the root of his question is the core of what it means to “Retire”. </p>\n\n\n\n<p>According to my own definition, you don’t have to stop working. But you <em>do </em>have to build up a level of freedom and wealth such that the work you do is <em>entirely by choice, </em>rather than something you grit your teeth and crank through just because you need or want the money.</p>\n\n\n\n<p> After all, the real purpose of work is to <strong>create something that is meaningful to you</strong>. Why would you ever want to quit that?</p>\n\n\n\n<p><strong><em>Aaron Writes</em></strong></p>\n\n\n\n<p><em>Dear MMM,</em></p>\n\n\n\n<p><em>I’m a 47 year old contractor with a small remodeling business with five employees. My four kids are now grown. We live below our means in a nice house I built 16 years ago on 25 acres we will never leave…we love it.</em></p>\n\n\n\n<p><em>In addition, we own a beautiful 1860s log cabin/ timber frame home we spent three years and tons of money rescuing/renovating and now rent out on Airbnb</em>.</p>\n\n\n\n<p><em>We are in the process of selling two other houses: one former home that our youngest daughter will be purchasing, and a second one that&nbsp; my crew and I are almost done fixing up</em>.</p>\n\n\n\n<p><em>Knowing myself, I will likely buy another fixer with the money, or some more land…when the price and condition is correct… but I have also always been fascinated by the stock market</em>.</p>\n\n\n\n<p><em>We do not currently own stocks or index funds, and we have no debt. I recently cut my workdays down to four a week, and am pretty happy with that for now.</em></p>\n\n\n\n<p><em>But, I did some math and if we sold the Airbnb with the other two houses, we’d have a chunk of cash big enough for me to mostly retire &#8211; working only if I really felt like it</em>.</p>\n\n\n\n<p><em>So the stock market is down and it’s time to sell the real estate and throw that into VTI, right?</em></p>\n\n\n\n<p><em>I’m a hands-on guy so it seems strange to turn three houses I can see, touch and feel into some numbers on a computer screen in the form of VTI. Not sure if I want to do that, even if it makes sense to my math brain.</em></p>\n\n\n\n<p><em>What else besides stocks or rental real estate could I do with the money to secure a 4% withdrawal rate in retirement?</em></p>\n\n\n\n<p>&#8212;-</p>\n\n\n\n<p>So you can probably see why I can relate to Aaron’s question. As another 47-year-old carpenter who also values manual labor, peaceful forests and throwing out salty comments in response to the whiny laments of the financial media, I can see exactly where he’s coming from.</p>\n\n\n\n<p>On the other hand, I am <em>also </em>very comfortable with stock market investments as a source of long-term wealth and security, and I have more than three quarters of my life savings invested in index funds (the remainder just being my house and other local real estate and very small business ventures with friends).</p>\n\n\n\n<p>&nbsp;So perhaps the main difference between Aaron and myself is that I think of <strong>houses and stocks as being two versions of the same thing</strong>. They are both real, concrete, productive assets rather than gambling instruments or numbers on a computer screen. If you understand this connection, you will become a better lifetime investor. Meanwhile, people who understand only one side or the other may become blind to what investing really means.</p>\n\n\n\n<p><strong>The Real Estate faithful</strong> will often talk about the concrete nature of their investments. Their houses and apartments really exist, and they provide the service of <em>housing </em>to their tenants which is an essential human need. In exchange for meeting this need, the investor collects rent which is a genuine and sustainable source of income. </p>\n\n\n\n<p>And your ownership of the houses and apartments is guaranteed and protected by our legal system and financial institutions, something which allows trust. And <span style=\"text-decoration: underline;\"><a href=\"https://www.mrmoneymustache.com/2012/06/11/get-rich-with-trust/\" target=\"_blank\" rel=\"noreferrer noopener\">trust</a></span> is the foundation of a society’s wealth.</p>\n\n\n\n<p>But sometimes these people will go too far and insist that real estate is the only true investment &#8211; becoming blind to the value of investing in other businesses via stock ownership. This blindness can lead to “crusty multimillionaire landlord syndrome” &#8211; the guy who owns 400 rental units and is always looking for the next deal, yet can never truly sit back and feel <em>retired, </em>no matter how big the empire grows. Because for most people, real estate ownership is an <em>active business </em>rather than a truly passive investment. </p>\n\n\n\n<p><strong>The Stock Market Faithful</strong> may develop a different problem: a focus on stock prices rather than business ownership. When you hear people talk about the “200 day moving average” or “support level” or “death cross pattern”, you can safely assume they suffer from this condition.</p>\n\n\n\n<p>And it’s the same thing that powers price speculation on things like cryptocoins, meme stocks and other volatile fads: they are hoping for an <em>outcome</em> (rising asset prices) without considering the thing that actually creates the underlying <em>value </em>(earnings).&nbsp;</p>\n\n\n\n<div class=\"wp-block-image is-style-rounded\"><figure class=\"alignleft is-resized\"><img loading=\"lazy\" src=\"https://images.halloweencostumes.com/products/14066/1-1/mens-deluxe-muscle-chest-batman-costume.jpg\" alt=\"Deluxe Muscle Chest Batman Costume for Men\" width=\"137\" height=\"196\"/><figcaption>Meme Stock / Crypto Trader</figcaption></figure></div>\n\n\n\n<p>If there are no earnings, there is no value. Betting otherwise is like trying to get in shape by strapping on a fake Batman-style padded muscle costume instead of doing the actual barbell exercises.&nbsp;</p>\n\n\n\n<p>But equally important, a stock is also a guaranteed slice of ownership of a real business, protected by our legal system and financial institutions just like the deed to your house. Although you can easily buy and sell stocks with a single tap on your phone, the actual meaning of stock ownership is complex and old-fashioned and regulated and that’s a good thing. You are a <em>shareholder, </em>entitled to receive company financial statements, attend shareholder meetings, vote on company initiatives, and even hire and fire board members (or become one yourself) using your voting rights.</p>\n\n\n\n<p>With no trust in these institutions, including the democratic election system that allows us to keep everything going, there is no value to the idea of owning <em>anything</em>, and a wealthy society cannot develop. Recording the ownership data onto blockchain won’t make any difference, because accurate recording is not the core issue. </p>\n\n\n\n<p>What matters is that <em>humans need to trust each other, and behave in a trustworthy way</em> in order to keep all this prosperity going. If you give up on trust and <span style=\"text-decoration: underline;\"><a href=\"https://youtu.be/UiL2inz487U?t=6860\" target=\"_blank\" rel=\"noreferrer noopener\">fuck with democracy</a></span> and start spreading mental viruses to encourage others to bicker and mistrust each other, all forms of wealth start to crumble.</p>\n\n\n\n<p>However, as democracy-loving, enthusiastically-voting-in-every-election-even-the-midterms members of a rich society, you and I Iean firmly towards the side of trust and cooperation, which is why our lives are looking so prosperous these days.</p>\n\n\n\n<p>To bring these two philosophies together, I encourage people to <strong>think of every investment as just a different type of rental house. </strong>What value does the house (or company) deliver to society, and what are its earnings relative to the price you are paying?&nbsp;</p>\n\n\n\n<p>For example, earlier this year some friends and I were discussing Rivian, the hot new electric truck startup as it was about to go public.&nbsp;</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><img loading=\"lazy\" src=\"https://www.cnet.com/a/img/resize/ec8dfa9f924012e7ef84b45bc85cf86d98a0ba92/2019/05/17/c6f4b77a-6197-4e13-9e6c-0ee2a6717118/2019-05-rivian-campkitchen-006.jpg?auto=webp&fit=crop&height=675&width=1200\" alt=\"2019-05-rivian-campkitchen-006\" width=\"459\" height=\"258\"/><figcaption>(Fancy electric truck with slide-out camp kitchen. Image credit Rivian)</figcaption></figure></div>\n\n\n\n<p><em>“Wow, that R1T is an amazing vehicle &#8211; every wealthy outdoorsy person wants one and all the reviews are glowing. So the IPO is probably a good investment at $75 per share, right?”</em>, said my friend.</p>\n\n\n\n<p><em><strong>“I</strong> agree absolutely”, </em>I replied, <em>“it’s a cool truck and heck if they sell it in the actually-useful format of a VAN someday, I’d even buy one myself!”</em></p>\n\n\n\n<p><em>But the real question is how much of the company are you getting for that $75, and when will the company have enough profits to justify the price?”</em></p>\n\n\n\n<p>At this point we could have tried to dive deeper into the details: Rivian was issuing about one billion shares, meaning you’re valuing the company at $75 billion. So you could try to take a guess at how long until the company produces enough <em>profit </em>to justify this company value.&nbsp; Which in turn depends on their gross margins, which depend on quickly and efficiently they can scale up multiple factories and secure a stream of several thousand custom components and batteries…</p>\n\n\n\n<p>But, not being blessed with the power of infinite knowledge of Rivian or a psychic ability to foresee the future of the automotive industry. I’m not qualified to speculate on the value of these shares. So instead I just buy the whole index and get the great performance of a wide blend of companies, without suffering the unique risks of concentrating in one individual stock.&nbsp;</p>\n\n\n\n<p>And as it turned out, that was a good philosophy if you look at Rivian’s stock price since that fateful IPO:</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-full is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/06/image.png\" alt=\"\" class=\"wp-image-18196\" width=\"479\" height=\"328\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/06/image.png 669w, https://www.mrmoneymustache.com/wp-content/uploads/2022/06/image-300x206.png 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/06/image-200x137.png 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/06/image-150x103.png 150w\" sizes=\"(max-width: 479px) 100vw, 479px\" /><figcaption>Buying a hot stock at IPO can make you look like a genius or a fool &#8211; but it&#8217;s mostly luck either way.</figcaption></figure></div>\n\n\n\n<p>So what does this have to do with Aaron’s question?</p>\n\n\n\n<p>Aaron knows how to spot a good deal on a house (which is like buying shares in a productive company), and he has the incredibly valuable skill of being able to renovate them to create new value (which is like helping his new “company” upgrade its factory to deliver even better earnings.)</p>\n\n\n\n<p>But he should also be open to investing in other companies (through stock index funds) because they are just doing the same thing in different ways. They’ll deliver a solid and consistent return over the coming decades. While a well-managed rental house can sometimes deliver higher returns than the stock market, a stock never calls you on a Sunday night to say the water heater is leaking or warn you that they need to break their lease early because they got a new job in another state.</p>\n\n\n\n<p> And Aaron is taking it a few staircases further still &#8211; actively building new stuff and managing five employees &#8211; a meaningful pastime to be sure, but definitely not in line with my own idea of retirement.</p>\n\n\n\n<p>As he and I have both learned at this age, construction is fun but it also places a massive strain on the body. Rental houses are fun, but shit can get old eventually and sometimes you just want to sit back on a Sunday afternoon rather than fielding calls from your tenant or your property manager.&nbsp;</p>\n\n\n\n<p>In contrast, stock investment is a truly passive way to set yourself up for the best kind of retirement: one where you do the work you love, but you really don’t need the money.</p>\n\n\n\n<p>So what would I do in Aaron&#8217;s shoes? </p>\n\n\n\n<p>I’d keep the houses that I love to live in, and sell the rest if I’m only managing them for the money. I would dump a huge chunk of surplus cash into the sensible index funds through the <span style=\"text-decoration: underline;\"><a href=\"https://www.mrmoneymustache.com/mmm-recommends/\" target=\"_blank\" rel=\"noreferrer noopener\">financial firm of my choice</a></span>, feeling extra good about the fact that stocks are currently on sale.&nbsp;</p>\n\n\n\n<p>And then I’d keep doing construction projects alongside great friends just as I do now, only when it suits me. When evaluating a new project, instead of asking myself about the potential profit, I would ask, “Is this project so worthwhile that I would do it for <em>free?”</em></p>\n\n\n\n<p>If the answer is yes, go ahead and do it and celebrate the profits and use them to facilitate even more generosity.&nbsp;</p>\n\n\n\n<p>If the answer is no, the project is a no &#8211; you’d be taking it on just to make money, which is something you no longer need, because you have already arrived at financial independence. Leave the money in index funds and keep searching for work that you really care about.&nbsp;</p>\n\n\n\n<p>From what I’ve seen, valuable, fun, worthwhile work is an infinitely renewable resource and we both have <em>at least </em>another 47 years of it ahead of us.</p>\n\n\n\n<p>Good luck Aaron!</p>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<p><em><strong>In the Comments:</strong> Are you a Stock Market or Real Estate Faithful, or Undecided and still figuring it out?</em></p>\n",
  "wfw:commentRss": "https://www.mrmoneymustache.com/2022/06/21/rental-houses-vs-stocks/feed/",
  "slash:comments": 98,
  "post-id": 18195
}