{
  "title": "Inventor of AT&T’s Datakit, the First Virtual Connection Switch, Dies at 85",
  "link": "https://spectrum.ieee.org/in-memoriam-august-2022",
  "description": "\n<p><a href=\"https://www.cst.cam.ac.uk/news/death-computer-science-pioneer-sandy-fraser\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Alexander “Sandy” Fraser</strong></a></p><p>Developer of the first virtual circuit network switch</p><p>Fellow, 85; died 13 June</p><p>Fraser developed the <a href=\"https://dl.acm.org/doi/pdf/10.1145/1013879.802670\" rel=\"noopener noreferrer\" target=\"_blank\">Datakit</a>, the first virtual circuit network switch, while working at<a href=\"https://en.wikipedia.org/wiki/AT%26T_Labs\" rel=\"noopener noreferrer\" target=\"_blank\"> AT&T Labs</a> in Florham Park, N.J. The telecommunications technology is used by all major U.S. telephone companies.</p><p>He invented other pioneering technologies as well, including the file system for the <a href=\"https://en.wikipedia.org/wiki/Titan_(supercomputer)\" rel=\"noopener noreferrer\" target=\"_blank\">Titan supercomputer</a> (prototype of Atlas 2), cell-based networks (precursor to asynchronous transfer mode), and the <a href=\"https://ieeexplore.ieee.org/document/601705/\" rel=\"noopener noreferrer\" target=\"_blank\">Euphony processor</a>, which was one of the first system-on-a-chip microprocessors.</p><p>He began his career at <a href=\"https://en.wikipedia.org/wiki/Ferranti\" rel=\"noopener noreferrer\" target=\"_blank\">Ferranti</a>, an electrical engineering and equipment company in Manchester, England. He left there in 1966 to join the <a href=\"https://www.cam.ac.uk/\" rel=\"noopener noreferrer\" target=\"_blank\">University of Cambridge</a> as an assistant director of research. After three years, he moved to the United States to work for AT&T Bell Labs in Holmdel, N.J. While there, he helped develop the Moving Picture Experts Group Advanced Audio Coder, which compresses music signals. First used in <a href=\"https://www.apple.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Apple</a>’s<a href=\"https://www.apple.com/itunes/\" rel=\"noopener noreferrer\" target=\"_blank\"> iTunes</a> program, it now can be found in all smartphones.</p><p>Fraser held several leadership positions at the company during his 30 years there. He became director of the Computing Science Research Center in 1982 and five years later was promoted to executive director. In 1994 he became associate vice president for the company’s information science research department. In 1996 he helped establish AT&T Labs in Florham Park. It is the company’s research and development division, of which he was vice president for two years.</p><p>He decided to focus more on research and left his position as vice president. AT&T named him chief scientist, and in that position he worked on developing architecture and protocols for a large-scale Internet so that customers could connect to it from their homes.</p><p>In 2002 Fraser retired and founded<a href=\"http://www.fraserresearch.org/\" rel=\"noopener noreferrer\" target=\"_blank\"> Fraser Research</a>, in Princeton, N.J., where he continued his networking work.</p><p>He earned his bachelor’s degree in aeronautical engineering in 1958 from the<a href=\"https://www.bristol.ac.uk/\" rel=\"noopener noreferrer\" target=\"_blank\"> University of Bristol</a>, in England. He went on to receive a Ph.D. in computing science in 1969 from Cambridge.</p><p><a href=\"https://www.cmu.edu/nanotechnology-forum/Forum_14/Korean_BioAbstract/6_A%20Park%20Bio.pdf\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Byung-Gook Park</strong></a></p><p>Vice chair of IEEE Region 10</p><p>Fellow, 62; died 20 May</p><p>Park was an active IEEE volunteer and was serving as the 2021–2022 vice chair of IEEE Region 10 at the time of his death. He was the 2014–2015 chair of the<a href=\"https://site.ieee.org/seoul/about-ieee/ieee-seoul-section/\" rel=\"noopener noreferrer\" target=\"_blank\"> IEEE Seoul Section</a>. </p><p>He was a member of several committees at conferences including the<a href=\"https://www.ieee-iedm.org/\" rel=\"noopener noreferrer\" target=\"_blank\"> IEEE International Electron Devices Meeting</a>, the<a href=\"https://www.ssdm.jp/\" rel=\"noopener noreferrer\" target=\"_blank\"> International Conference on Solid State Devices and Materials</a>, and the<a href=\"https://www.itc-cscc2021.org/\" rel=\"noopener noreferrer\" target=\"_blank\"> International Technical Conference on Circuits/ Systems, Computers, and Communications</a>.</p><p>He served as editor of<a href=\"https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=55\" rel=\"noopener noreferrer\" target=\"_blank\"> <em>IEEE Electron Device Letters</em></a> and editor in chief of the<a href=\"http://jsts.org/\" rel=\"noopener noreferrer\" target=\"_blank\"> <em>Journal of Semiconductor Technology and Science</em></a>.</p><p>From 1990 to 1993, he worked at <a href=\"https://en.wikipedia.org/wiki/Bell_Labs\" rel=\"noopener noreferrer\" target=\"_blank\">AT&T Bell Labs</a> in Murray Hill, N.J., before joining <a href=\"https://www.ti.com/about-ti/company/overview.html\" rel=\"noopener noreferrer\" target=\"_blank\">Texas Instruments</a> in Dallas. After one year, he left the company and joined<a href=\"https://en.snu.ac.kr/\" rel=\"noopener noreferrer\" target=\"_blank\"> Seoul National University</a> as an assistant professor of electrical and computer engineering. He worked at the university at the time of his death.</p><p>His research interests included the design and fabrication of neuromorphic devices and circuits, flash memories, and silicon quantum devices.</p><p>Park authored or coauthored more than 1,200 research papers. He was granted 107 patents in Korea and 46 U.S. patents.</p><p>He received bachelor’s and master’s degrees in electronics engineering from Seoul National University in 1982 and 1984, respectively, and a Ph.D. in EE in 1990 from<a href=\"https://www.stanford.edu/\" rel=\"noopener noreferrer\" target=\"_blank\"> Stanford</a>.</p><p><a href=\"https://www.tributearchive.com/obituaries/24412928/david-ellis-hepburn\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>David Ellis Hepburn</strong></a></p><p>Past vice chair of IEEE Canada’s Teacher-in-Service Program</p><p>Life senior member, 91; died 25 March</p><p>Hepburn was a strong proponent of preuniversity education and enjoyed helping shape the next generation of engineers. He was involved with <a href=\"https://www.ieee.ca/en/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Canada</a>’s<a href=\"https://r1.ieee.org/r1_event/ieee-teacher-in-service-program-workshop/\" rel=\"noopener noreferrer\" target=\"_blank\"> Teacher-in-Service Program</a>, an initiative that aims to improve elementary and secondary school technical education by offering teachers lesson plans and training workshops. He served as vice chair of the program’s committee. He was honored for his contributions with the 2017 IEEE Canada<a href=\"https://www.ieee.ca/en/awards/presidents-award/#:~:text=Established%20in%202017%2C%20this%20distinct,profession%20and%20to%20the%20public.\" rel=\"noopener noreferrer\" target=\"_blank\"> Presidents’ Make-a-Difference Award</a>.</p><p>He was an active volunteer for<a href=\"https://tryengineering.org/\" rel=\"noopener noreferrer\" target=\"_blank\"> TryEngineering</a>, a website that provides teachers, parents, and students with engineering resources. These include hands-on classroom activities, lesson plans, and information about engineering careers and university programs. He wrote six lessons, which cover transformers, AC and DC motors, magnetism, binary basics, and solar power.</p><p>While a student at <a href=\"https://www.staffs.ac.uk/\" rel=\"noopener noreferrer\" target=\"_blank\">Staffordshire University</a>, in England, he was an intern at electrical equipment manufacturer<a href=\"https://www.baesystems.com/en/heritage/english-electric\" rel=\"noopener noreferrer\" target=\"_blank\"> English Electric</a> in Stafford. Five years after graduating in 1952, he joined utility company<a href=\"https://www.hydroquebec.com/residential/\" rel=\"noopener noreferrer\" target=\"_blank\"> Hydro-Québec</a> in Montreal as a systems design engineer. In 1965 he went to work for consulting firm <a href=\"https://www.canadianconsultingengineer.com/features/acres-portrait-of-a-firm/\" rel=\"noopener noreferrer\" target=\"_blank\">Acres International</a> in Montreal. His first assignment there was with the design and construction team for the Churchill Falls underground hydroelectric power station, in Labrador, Nfld.</p><p>In 1969 he was tasked with helping to build transmission lines in Bangladesh that connected the country’s eastern and western electrical grids. He and his family lived there for two years.</p><p>After that, Hepburn continued to work on international projects in countries including Indonesia, Nepal, and Pakistan.</p><p>Following his retirement in 1994, he worked as a consultant for organizations including the<a href=\"https://www.worldbank.org/en/home\" rel=\"noopener noreferrer\" target=\"_blank\"> World Bank</a> and the<a href=\"https://en.wikipedia.org/wiki/Canadian_International_Development_Agency\" rel=\"noopener noreferrer\" target=\"_blank\"> Canadian International Development Agency</a>. He also volunteered for the<a href=\"https://www.ceso-saco.com/\" rel=\"noopener noreferrer\" target=\"_blank\"> Canadian Executive Service Organization</a>, a nonprofit that provides underserved communities worldwide with mentorship, coaching, and training in sectors such as alternative energy, forestry, and manufacturing. He volunteered on projects in Guatemala and Honduras.</p><p><a href=\"https://news.mit.edu/2022/professor-emeritus-markus-zahn-dies-0419\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Markus Zahn</strong></a></p><p>Professor emeritus at MIT</p><p>Life Fellow, 75; died 13 March</p><p>Zahn was a professor of electrical engineering for 50 years. He taught at the<a href=\"https://www.ufl.edu/\" rel=\"noopener noreferrer\" target=\"_blank\"> University of Florida</a> in Gainesville in 1970 and worked there for 10 years before joining<a href=\"https://www.mit.edu/\" rel=\"noopener noreferrer\" target=\"_blank\"> MIT</a>, where he spent the remainder of his career.</p><p>He researched how electromagnetic fields interact with materials, and he developed a method for magnetically separating oil and water, as well as a system that detects buried dielectric, magnetic, and conducting devices such as land mines.</p><p>He was director of MIT’s<a href=\"https://capd.mit.edu/organizations/6-a-program/\" rel=\"noopener noreferrer\" target=\"_blank\"> 6-A program</a>, which provides undergraduate students with mentoring and internship opportunities.</p><p>Zahn, who was granted more than 20 U.S. patents, worked as a consultant for <a href=\"https://corporate.dow.com/en-us/about.html\" rel=\"noopener noreferrer\" target=\"_blank\">Dow</a>,<a href=\"https://corporate.ford.com/\" rel=\"noopener noreferrer\" target=\"_blank\"> Ford</a>,<a href=\"https://www.ti.com/about-ti/company/overview.html\" rel=\"noopener noreferrer\" target=\"_blank\"> Texas Instruments</a>, and other companies</p><p>He received bachelor’s, master’s, and doctoral degrees in engineering from MIT.</p>",
  "pubDate": "Thu, 04 Aug 2022 18:00:00 +0000",
  "guid": "https://spectrum.ieee.org/in-memoriam-august-2022",
  "category": [
    "Ieee member news",
    "In memoriam",
    "Obituary",
    "Type:ti"
  ],
  "dc:creator": "Joanna Goodrich"
}