{
  "title": "Magnetic sensors track muscle length",
  "link": "https://news.mit.edu/2022/magnetic-sensors-muscle-prosthetics-1025",
  "description": "Using a new technology, researchers hope to create better control systems for prosthetic limbs.",
  "pubDate": "Tue, 25 Oct 2022 09:00:00 -0400",
  "guid": "https://news.mit.edu/2022/magnetic-sensors-muscle-prosthetics-1025",
  "dc:creator": "Anne Trafton | MIT News Office",
  "content:encoded": "<p>Using a simple set of magnets, MIT researchers have come up with a sophisticated way to monitor muscle movements, which they hope will make it easier for people with amputations to control their prosthetic limbs.</p>\n\n<p></p>\n\n<p>In a new pair of papers, the researchers demonstrated the accuracy and safety of their magnet-based system, which can track the length of muscles during movement. The studies, performed in animals, offer hope that this strategy could be used to help people with prosthetic devices control them in a way that more closely mimics natural limb movement.</p>\n\n<p></p>\n\n<p>“These recent results demonstrate that this tool can be used outside the lab to track muscle movement during natural activity, and they also suggest that the magnetic implants are stable and biocompatible and that they don’t cause discomfort,” says Cameron Taylor, an MIT research scientist and co-lead author of both papers.</p>\n\n<p></p>\n\n<p>In one of the studies, the researchers showed that they could accurately measure the lengths of turkeys’ calf muscles as the birds ran, jumped, and performed other natural movements. In the other study, they showed that the small magnetic beads used for the measurements do not cause inflammation or other adverse effects when implanted in muscle.</p>\n\n<p></p>\n\n<p>“I am very excited for the clinical potential of this new technology to improve the control and efficacy of bionic limbs for persons with limb-loss,” says Hugh Herr, a professor of media arts and sciences, co-director of the K. Lisa Yang Center for Bionics at MIT, and an associate member of MIT’s McGovern Institute for Brain Research.</p>\n\n<p></p>\n\n<p>Herr is a senior author of both papers, which appear today in the journal <em>Frontiers in Bioengineering and Biotechnology</em>. Thomas Roberts, a professor of ecology, evolution, and organismal biology at Brown University, is a senior author of the measurement study.</p>\n\n<p></p>\n\n<p></p>\n\n<p><strong>Tracking movement</strong></p>\n\n<p></p>\n\n<p>Currently, powered prosthetic limbs are usually controlled using an approach known as surface electromyography (EMG). Electrodes attached to the surface of the skin or surgically implanted in the residual muscle of the amputated limb measure electrical signals from a person’s muscles, which are fed into the prosthesis to help it move the way the person wearing the limb intends.</p>\n\n<p></p>\n\n<p>However, that approach does not take into account any information about the muscle length or velocity, which could help to make the prosthetic movements more accurate.</p>\n\n<p></p>\n\n<p>Several years ago, the MIT team began working on a novel way to perform those kinds of muscle measurements, using an approach that they call magnetomicrometry. This strategy takes advantage of the permanent magnetic fields surrounding small beads implanted in a muscle. Using a credit-card-sized, compass-like sensor attached to the outside of the body, their system can track the distances between the two magnets. When a muscle contracts, the magnets move closer together, and when it flexes, they move further apart.</p>\n\n<p></p>\n\n<p>In a <a href=\"https://news.mit.edu/2021/magnet-prosthetic-limb-control-0818\">study</a> published last year, the researchers showed that this system could be used to accurately measure small ankle movements when the beads were implanted in the calf muscles of turkeys. In one of the new studies, the researchers set out to see if the system could make accurate measurements during more natural movements in a nonlaboratory setting.</p>\n\n<p></p>\n\n<p>To do that, they created an obstacle course of ramps for the turkeys to climb and boxes for them to jump on and off of. The researchers used their magnetic sensor to track muscle movements during these activities, and found that the system could calculate muscle lengths in less than a millisecond.</p>\n\n<p></p>\n\n<p>They also compared their data to measurements taken using a more traditional approach known as fluoromicrometry, a type of X-ray technology that requires much larger equipment than magnetomicrometry. The magnetomicrometry measurements varied from those generated by fluoromicrometry by less than a millimeter, on average.</p>\n\n<p></p>\n\n<p>“We’re able to provide the muscle-length tracking functionality of the room-sized X-ray equipment using a much smaller, portable package, and we’re able to collect the data continuously instead of being limited to the 10-second bursts that fluoromicrometry is limited to,” Taylor says.</p>\n\n<p></p>\n\n<p>Seong Ho Yeon, an MIT graduate student, is also a co-lead author of the measurement study. Other authors include MIT Research Support Associate Ellen Clarrissimeaux and former Brown University postdoc Mary Kate O’Donnell.</p>\n\n<p></p>\n\n<p><strong>Biocompatibility</strong></p>\n\n<p></p>\n\n<p>In the second paper, the researchers focused on the biocompatibility of the implants. They found that the magnets did not generate tissue scarring, inflammation, or other harmful effects. They also showed that the implanted magnets did not alter the turkeys’ gaits, suggesting they did not produce discomfort. William Clark, a postdoc at Brown, is the co-lead author of the biocompatibility study.</p>\n\n<p></p>\n\n<p>The researchers also showed that the implants remained stable for eight months, the length of the study, and did not migrate toward each other, as long as they were implanted at least 3 centimeters apart. The researchers envision that the beads, which consist of a magnetic core coated with gold and a polymer called Parylene, could remain in tissue indefinitely once implanted.</p>\n\n<p></p>\n\n<p>“Magnets don’t require an external power source, and after implanting them into the muscle, they can maintain the full strength of their magnetic field throughout the lifetime of the patient,” Taylor says.</p>\n\n<p></p>\n\n<p>The researchers are now planning to seek FDA approval to test the system in people with prosthetic limbs. They hope to use the sensor to control prostheses similar to the way surface EMG is used now: Measurements regarding the length of muscles will be fed into the control system of a prosthesis to help guide it to the position that the wearer intends.</p>\n\n<p>“The place where this technology fills a need is in communicating those muscle lengths and velocities to a wearable robot, so that the robot can perform in a way that works in tandem with the human,” Taylor says. “We hope that magnetomicrometry will enable a person to control a wearable robot with the same comfort level and the same ease as someone would control their own limb.”</p>\n\n<p>In addition to prosthetic limbs, those wearable robots could include robotic exoskeletons, which are worn outside the body to help people move their legs or arms more easily.</p>\n\n<p>The research was funded by the Salah Foundation, the K. Lisa Yang Center for Bionics at MIT, the MIT Media Lab Consortia, the National Institutes of Health, and the National Science Foundation.</p>",
  "media:content": {
    "media:description": "A small, bead-like magnet used in a new approach to measuring muscle position.",
    "media:credit": "Image: Courtesy of the researchers"
  },
  "category": [
    "Assistive technology",
    "Disabilities",
    "Prosthetics",
    "Neuroscience",
    "Research",
    "Robotics",
    "Media Lab",
    "Banking",
    "McGovern Institute",
    "School of Architecture and Planning"
  ]
}