{
  "id": "yt:video:Ht-NfaUYoRM",
  "yt:videoId": "Ht-NfaUYoRM",
  "yt:channelId": "UCXDc-ckqru8BgppXbCt0APw",
  "title": "Maxim Salnikov - Native Web Apps: Are We There Yet?",
  "link": "",
  "author": {
    "name": "Google Developer Groups",
    "uri": "https://www.youtube.com/channel/UCXDc-ckqru8BgppXbCt0APw"
  },
  "published": "2021-12-09T17:31:04+00:00",
  "updated": "2022-01-13T02:15:52+00:00",
  "media:group": {
    "media:title": "Maxim Salnikov - Native Web Apps: Are We There Yet?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "There are so many discussions about web VS native apps. Will we get to the point where the Web becomes truly Native for the majority of the platforms? Progressive Web Apps, Project Fugu, WebAssembly & other technologies actively contribute to moving in this direction. In this session, we go through a list of details that make the integration of an application & operating system seamless, and map it to the APIs available for the web platform. With the knowledge of what's available today and what's coming soon, you are empowered to build truly Native Web Apps to deliver the best user experience!\n\nBio\nMaxim Salnikov is an Oslo-based cloud and tech community geek. He is a webdev maestro who builds apps since the end of the last century and shares his extensive web platform experience by speaking & training at developer events around the world. Daytime, Maxim is boosting cloud skills at the country scale by leading developer engagement in Microsoft Norway. In the evenings, you'll find him organizing the country's main web & mobile meetups, and two full-scale tech conferences.\n\nhttps://twitter.com/webmaxru/\n\nThis talk is part of our DevFest Inspire event! #DevFestInspire\n\nDevFest Inspire is a virtual event celebrating the end of the DevFest 2021 season where we’ll recognize content created by the community, as well as Googlers from Europe and Africa. \n\nYou can also network and connect with other developers during the event! \n→ Learn more and sign up at https://goo.gle/devfest-inspire !\n→ Check more events and content:  https://gdg.community.dev/events/#/list",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}