{
  "title": "Chinese Whispers: the Taiwanese view on Ukraine",
  "link": "https://audioboom.com/posts/8051790",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2122,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Taiwan is not Ukraine. But despite the very important differences in their situations, the Russian invasion can still shed much light on Taiwan's future. Even many Taiwanese think so – and have followed the developments closely, with solidarity marches held for Ukraine, protests at the Russian embassy and the Ukrainian flag lighting up Taiwanese buildings.<br>\n<br>\nOn this episode of Chinese Whispers, my guests and I discuss the mainstream take on Ukraine (and also the not so mainstream – such as the view that America can't be relied upon, given it hasn't despatched troops to Ukraine). I'm joined by Brian Hioe, editor of <em>New Bloom</em>, an online magazine covering youth culture and politics in Taiwan, and Professor Kerry Brown from Kings College London, author of <em>The Trouble with Taiwan.</em><br>\n<br>\nWe give a primer on Taiwanese politics – what does the thriving democracy look like? How are elections held, and what are the major political parties? We discuss how China – instead of particular social or economic issues – is the main political topic dividing the left and the right (the 'Greens' and the 'Blues'), and whether, with mainstream Taiwanese opinion becoming ever hawkish on China in the aftermath of the Hong Kong National Security Law, the more pro-China forces in Taiwanese politics, such as the Kuomintang, really have a future in the country (Kerry says: ‘I don’t think the KMT can be written off.')<br>\n<br>\nIn a crowded continent, there are also other power-brokers. We talk about the influence of America, and where Japan – Taiwan's erstwhile coloniser – fits in with all this. There have been calls for Japan to be more heavily armed in order to deter a Chinese invasion. How would the Taiwanese feel about that? Brian tells me:<br>\n<br>\n\n</div>\n<blockquote>‘Views of Japan differ sharply between the pan-green and the pan-blue camp. For the KMT, they remember a lot of the Sino-Japanese war and the crimes committed by the Japanese from that period. But for the pan-greens, who are sometimes descended from those that were in Taiwan for the Japanese colonial period, [remember] the period as a time of higher living standards and improved education, and in which Taiwan is being brought up as a colony rather than these political killings and mass violence, etc. They have a much more romanticised views of a Japanese colonial period.’</blockquote><div>In the end, economics may supersede politics. If President Tsai Ing-wen can't deliver on the economy given her tough stance on China (which is still Taiwan's biggest trading partner), then domestic politics may be in for another shakeup. As Kerry says: ‘It’s the issue that we all wrestle with. Their biggest economic partner is also their biggest security threat’.<br>\n<br>\nAdditional listening: do tune in to a <a href=\"https://www.spectator.co.uk/podcast/why-does-china-care-about-taiwan-\">previous episode</a> with Professor Rana Mitter, if you need a primer on why exactly Taiwan's history means that it is in this position and how the shared language and culture with the People's Republic of China came about<br>\n<a href=\"https://www.spectator.co.uk/podcast/why-does-china-care-about-taiwan-\">https://www.spectator.co.uk/podcast/why-does-china-care-about-taiwan-</a>.</div>\n",
  "pubDate": "Tue, 22 Mar 2022 12:00:00 +0000",
  "guid": "tag:audioboom.com,2022-03-21:/posts/8051790",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}