{
  "title": "Recover your true self | Tony, Russell Brand and Mary B on freeing yourself from the addictions and attachments that control your life",
  "pubDate": "Thu, 06 Dec 2018 20:26:26 +0000",
  "guid": "73b27f92e51f40e3a35d9794bd044c02",
  "link": "https://tonyrobbins.libsyn.com/recover-your-true-self-tony-russell-brand-and-mary-b-on-freeing-yourself-from-the-addictions-and-attachments-that-control-your-life",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">We all have some sort of addiction in our lives. Perhaps an addiction to a substance. Maybe it’s an addiction to food or a bad relationship. It could be an addiction to your cell phone. Or maybe it’s even an addiction to problems, or suffering. What unhealthy habits and attachments can you recognize in your own life?<br /></span><br /> <span style=\"font-weight: 400;\">In this very special episode of the Tony Robbins Podcast, Tony and his partner in crime, Mary Buckheit, sit down with actor, comedian, radio host, author and activist - Russell Brand. We all know Russell as the gregarious, charming personality starring in such hits as</span> <em><span style= \"font-weight: 400;\">Forgetting Sarah Marshall</span></em> <span style=\"font-weight: 400;\">and</span> <em><span style= \"font-weight: 400;\">Get Him to the Greek</span></em><span style= \"font-weight: 400;\">. But what we didn’t know was that for decades, Russell struggled with loneliness, shame and self-worth, and was in the throes of a battle with substance addiction. In this conversation, Russell discusses the profound lessons in his book</span> <a href= \"https://www.russellbrand.com/recovery/\"><em><span style= \"font-weight: 400;\">Recovery: Freedom From Our Addictions</span></em></a><span style=\"font-weight: 400;\">, and he shares just how he brought consciousness to his actions and behaviors, how he cultivated discipline in his life, and how he awoke to find truth in his life. He also reveals the tools and techniques to recognize negative patterns in your life, so that anyone can break free of the addictive habits and attachments that control our lives and start on the journey to recovering who you were truly meant to be.</span></p>",
  "content:encoded": "<p>We all have some sort of addiction in our lives. Perhaps an addiction to a substance. Maybe it’s an addiction to food or a bad relationship. It could be an addiction to your cell phone. Or maybe it’s even an addiction to problems, or suffering. What unhealthy habits and attachments can you recognize in your own life? In this very special episode of the Tony Robbins Podcast, Tony and his partner in crime, Mary Buckheit, sit down with actor, comedian, radio host, author and activist - Russell Brand. We all know Russell as the gregarious, charming personality starring in such hits as <em>Forgetting Sarah Marshall</em> and <em>Get Him to the Greek</em>. But what we didn’t know was that for decades, Russell struggled with loneliness, shame and self-worth, and was in the throes of a battle with substance addiction. In this conversation, Russell discusses the profound lessons in his book <a href= \"https://www.russellbrand.com/recovery/\"><em>Recovery: Freedom From Our Addictions</em></a>, and he shares just how he brought consciousness to his actions and behaviors, how he cultivated discipline in his life, and how he awoke to find truth in his life. He also reveals the tools and techniques to recognize negative patterns in your life, so that anyone can break free of the addictive habits and attachments that control our lives and start on the journey to recovering who you were truly meant to be.</p>",
  "enclosure": "",
  "itunes:duration": "01:35:34",
  "itunes:explicit": false,
  "itunes:keywords": "recovery,russell,brand,tony,addiction,robbins",
  "itunes:subtitle": "We all have some sort of addiction in our lives. Perhaps an addiction to a substance. Maybe it’s an addiction to food or a bad relationship. It could be an addiction to your cell phone. Or maybe it’s even an addiction to problems, or suffering....",
  "itunes:episodeType": "full"
}