{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-136233829392970567",
  "published": "2020-01-06T09:30:00.000-08:00",
  "updated": "2020-01-06T09:59:47.969-08:00",
  "title": "Better protecting kids’ privacy on YouTube",
  "content": "Last September, we <a href=\"https://youtube.googleblog.com/2019/09/an-update-on-kids.html\" target=\"_blank\">announced</a> a series of changes to better protect kids and their privacy on YouTube and to address concerns raised by the U.S. Federal Trade Commission (FTC). Specifically, that all creators will be required to designate their content as made for kids or not made for kids in <a href=\"https://studio.youtube.com/\">YouTube Studio</a>, and data from anyone watching a video designated as made for kids will be treated as coming from a child, regardless of the age of the user. <br /><br />In November, we released a setting in Studio to make it easier for creators to designate their content. And today, we will begin to roll out these changes globally. We wanted to outline what you will start to see in the coming days. <br /><br /><h3>What is made for kids content? </h3><br />According to the FTC, a video is made for kids if it is intended for kids, taking into consideration a variety of factors. These factors include the subject matter of the video, whether the video has an emphasis on kids characters, themes, toys or games, <a href=\"https://www.ftc.gov/news-events/blogs/business-blog/2019/11/youtube-channel-owners-your-content-directed-children\" target=\"_blank\">and more</a>. <br /><br />To help us identify made for kids content, in November we <a href=\"https://support.google.com/youtube/answer/9528076\" target=\"_blank\">introduced a new audience setting</a> in YouTube Studio to help creators indicate whether or not their content is made for kids. Creators know their content best, and should set the designation themselves. We also use machine learning to help us identify this content, and creators can update a designation made by our systems if they believe it is incorrect. We will only override a creator designation if abuse or error is detected. <br /><br /><h3>An updated experience for made for kids content </h3><br />YouTube now treats personal information from anyone watching children’s content on the platform as coming from a child, regardless of the age of the user. This means that on videos made for kids, we limit data collection and use, and as a result, we need to<a href=\"https://www.youtube.com/watch?v=0CzTAeLNRbg\" target=\"_blank\"> restrict or disable</a> some product features. For example, we no longer serve personalized ads on this content or support features such as comments, live chat, notification bell, stories, save to playlist, and <a href=\"https://support.google.com/youtube/answer/9632097\" target=\"_blank\">others</a>. <br /><br />Many creators around the world have created quality kids content for their audiences, and these changes will have significant impact. We’re committed to helping creators navigate this new landscape and to supporting our ecosystem of family content. We’ll share more in the coming months. In the meantime, we continue to engage on this issue. For example, we participated in the FTC’s <a href=\"https://www.ftc.gov/news-events/audio-video/video/future-coppa-rule-ftc-workshop-session-2\" target=\"_blank\">public workshop</a> and submitted our <a href=\"https://youtube-creators.googleblog.com/2019/12/our-comment-on-coppa.html\" target=\"_blank\">comment on COPPA</a>, where we discussed the importance of clear guidelines that help creators live up to their legal obligations and support access to quality kids content. <br /><br /><h3>Continued investment in YouTube Kids </h3><br />We still recommend parents use <a href=\"https://www.youtube.com/kids/\" target=\"_blank\">YouTube Kids</a> if they plan to allow kids under 13 to watch independently. In fact, tens of millions of people use YouTube Kids every week, and recently we saw an all-time high of weekly viewers since the app’s launch. Starting today, you will see a YouTube Kids promotion across all made for kids content. We also continue to improve the product. For example, we recently launched signed-in support for YouTube Kids <a href=\"https://www.youtubekids.com/\" target=\"_blank\">on the web</a> and connected devices&nbsp;<span style=\"background-color: white; color: #545454; font-family: &quot;roboto&quot; , &quot;arial&quot; , sans-serif; font-size: 14px;\">—</span>&nbsp;such as smart TVs&nbsp;<span style=\"background-color: white; color: #545454; font-family: &quot;roboto&quot; , &quot;arial&quot; , sans-serif; font-size: 14px;\">—</span>&nbsp;so parents can now access and control their child’s YouTube Kids experience across even more surfaces.<br /><br />Responsibility is our number one priority at YouTube, and this includes protecting kids and their privacy. We’ve been significantly investing in the <a href=\"https://youtube.googleblog.com/2019/06/an-update-on-our-efforts-to-protect.html\" target=\"_blank\">policies</a>, <a href=\"https://youtube.googleblog.com/2018/04/introducing-new-choices-for-parents-to.html\" target=\"_blank\">products</a> and <a href=\"https://youtube.googleblog.com/2017/11/5-ways-were-toughening-our-approach-to.html\" target=\"_blank\">practices</a> to help us do this. Today’s changes allow us to do this even better and we’ll continue working to provide children, families and family creators the best experience possible on YouTube. <br /><br /><i>— The YouTube Team </i>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}