{
  "title": "The next CEO of Stack Overflow",
  "link": "https://www.joelonsoftware.com/2019/03/28/the-next-ceo-of-stack-overflow/",
  "dc:creator": "Joel Spolsky",
  "pubDate": "Thu, 28 Mar 2019 14:00:53 +0000",
  "category": [
    "Stack Overflow",
    "News"
  ],
  "guid": "https://www.joelonsoftware.com/?p=3535",
  "description": "We’re looking for a new CEO for Stack Overflow. I’m stepping out of the day-to-day and up to the role of Chairman of the Board. <span class=\"read-more\"><a class=\"more-link\" href=\"https://www.joelonsoftware.com/2019/03/28/the-next-ceo-of-stack-overflow/\" rel=\"bookmark\">Read more <span class=\"screen-reader-text\">\"The next CEO of Stack Overflow\"</span></a></span>",
  "content:encoded": "\n<p>Big news! We’re looking for a new CEO for Stack Overflow. I’m stepping out of the day-to-day and up to the role of Chairman of the Board.</p>\n\n\n\n<p>Stack Overflow has been around for more than a decade. As I look back, it’s really amazing how far it has come. &nbsp;</p>\n\n\n\n<p>Only six months after we had launched Stack Overflow, my co-founder Jeff Atwood and I were invited to speak at a Microsoft conference for developers in Las Vegas. We were there, I think, to demonstrate that you could use their latest ASP.NET MVC technology on a real website without too much of a disaster. (In fact .NET has been a huge, unmitigated success for us, but you kids go ahead and have fun with whatever platform you want mkay? They’re all great, or, at least, above-average).</p>\n\n\n\n<p>It was a giant conference, held at the Venetian Hotel. This hotel was so big that other <em>hotels</em> stay there when they go on vacation. The main ballroom was the size of, approximately, Ireland. I later learned there were 5,000 developers in that room.</p>\n\n\n\n<p>I thought it would be a fun thing to ask the developers in the room how many of them had visited Stack Overflow. As I remember, Jeff was very much against this idea. “Joel,” he said, “That is going to be embarrassing and humiliating. Nobody is going to raise their hand.”</p>\n\n\n\n<p>Well, I asked it anyway. And we were both surprised to see about one-third of the hands go up. We were really making an impact! That felt really good.</p>\n\n\n\n<p>Anyway, I tried that trick again whenever I spoke to a large audience. It doesn’t work anymore. Today, audiences just laugh. It’s like asking, “Does anyone use gravity? Raise your hand if you use gravity.”</p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" loading=\"lazy\" width=\"4032\" height=\"3024\" src=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2019/03/IMG_9111.jpg?fit=730%2C548&ssl=1\" alt=\"\" class=\"wp-image-3538\" srcset=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2019/03/IMG_9111.jpg?w=4032&ssl=1 4032w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2019/03/IMG_9111.jpg?resize=300%2C225&ssl=1 300w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2019/03/IMG_9111.jpg?resize=768%2C576&ssl=1 768w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2019/03/IMG_9111.jpg?resize=1024%2C768&ssl=1 1024w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2019/03/IMG_9111.jpg?resize=1200%2C900&ssl=1 1200w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2019/03/IMG_9111.jpg?w=1460&ssl=1 1460w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2019/03/IMG_9111.jpg?w=2190&ssl=1 2190w\" sizes=\"(max-width: 730px) 100vw, 730px\" /></figure>\n\n\n\n<p>Where are we at after 11 years? Practically every developer in the world uses Stack Overflow. Including the Stack Exchange network of 174 sites, we have over 100 million monthly visitors. Every month, over 125,000 wonderful people write answers. According to Alexa, <a href=\"https://www.alexa.com/siteinfo/stackoverflow.com\">stackoverflow.com is one of the top 50 websites in the world</a>. (That’s without even counting the Stack Exchange network, which is almost as big.) And every time I see a developer write code, they’ve got Stack Overflow open in one of their browser windows. Oh and—hey!—we do not make you sign up or pay to see the answers.</p>\n\n\n\n<p>The company has been growing, too. Today we are profitable. We have almost 300 amazing employees worldwide and booked $70m in revenue last year. We have talent, advertising, and software products. The SaaS products (Stack Overflow for <a href=\"https://stackoverflow.com/teams\">Teams</a> and <a href=\"https://stackoverflow.com/enterprise\">Enterprise</a>) are growing at <em>200% a year</em>. That speaks to the fact that we’ve recruited an incredibly talented team that has produced such fantastic results. </p>\n\n\n\n<p>But, we have a lot of work ahead of us, and it’s going to take a different type of leader to get us through that work. </p>\n\n\n\n<p>The type of people Stack Overflow serves has changed, and now, as a part of the developer ecosystem, we have a responsibility to create an online community that is far more diverse, inclusive, and welcoming of newcomers.</p>\n\n\n\n<p>In the decade or so since Stack Overflow started, the number of people employed as software developers <a href=\"https://www.bls.gov/careeroutlook/2019/data-on-display/projections-evaluation.htm?view_full\">grew by 64%</a> in the US alone. The field is going to keep growing everywhere in the world, and the demand for great software developers far outstrips supply. So a big challenge for Stack Overflow is welcoming those new developers into the fold. As I’ve <a href=\"https://www.joelonsoftware.com/2018/04/23/strange-and-maddening-rules/\">written</a>:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>One thing I’m very concerned about, as we try to educate the next generation of developers, and, importantly, get more diversity and inclusiveness in that new generation, is what obstacles we’re putting up for people as they try to learn programming. In many ways Stack Overflow’s specific rules for what is permitted and what is not are obstacles, but an even bigger problem is rudeness, snark, or condescension that newcomers often see.</p><p>I care a lot about this. Being a developer gives you an unparalleled opportunity to <a href=\"https://www.joelonsoftware.com/2016/12/09/developers-are-writing-the-script-for-the-future/\">write the script for the future</a>. All the flak that Stack Overflow throws in the face of newbies trying to become developers is actively harmful to people, to society, and to Stack Overflow itself, by driving away potential future contributors. And programming is hard enough; we should see our mission as making it easier.</p></blockquote>\n\n\n\n<p>The world has started taking a closer look at tech, and understanding that software and the internet are not just tools; they are shaping the future of society. Big tech companies are struggling with their place in the world. Stack Overflow is situated at the right place to be influential in how that future develops, and that is going to take a new type of leader.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignright is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2019/03/IMG_5949.jpg?fit=730%2C973&ssl=1\" alt=\"\" class=\"wp-image-3539\" width=\"182\" height=\"243\" srcset=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2019/03/IMG_5949.jpg?w=3024&ssl=1 3024w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2019/03/IMG_5949.jpg?resize=225%2C300&ssl=1 225w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2019/03/IMG_5949.jpg?resize=768%2C1024&ssl=1 768w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2019/03/IMG_5949.jpg?resize=1200%2C1600&ssl=1 1200w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2019/03/IMG_5949.jpg?w=1460&ssl=1 1460w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2019/03/IMG_5949.jpg?w=2190&ssl=1 2190w\" sizes=\"(max-width: 182px) 100vw, 182px\" /><figcaption>new dog, too</figcaption></figure></div>\n\n\n\n<p>It will not be easy to find a CEO who is the right person to lead that mission. We will, no doubt, hire one of those fancy executive headhunters to help us in the search. But, hey, this is Stack Overflow. If there’s one thing I have learned by now, it’s that there’s always someone in the community who can answer the questions I can’t. </p>\n\n\n\n<p>So we decided to put this announcement out there in hopes of finding great candidates that might have been under the radar. We’re especially focused on identifying candidates from under-represented groups, and making sure that every candidate we consider is deeply committed to making our company and community more welcoming, diverse, and inclusive.</p>\n\n\n\n<p>Over the years, Fog Creek Software created several incredible hits and many wonderful memories along the way. It is great to watch Trello (under Michael Pryor) and Glitch (under Anil Dash) growing into enormously valuable, successful, and influential products with dedicated leaders who took these products much further than I ever could have, and personally I’m excited to see where Stack Overflow can go and turn my attention to the next thing.<br></p>\n",
  "post-id": 3535
}