{
  "id": "https://bibleinoneyear.org/en/youth/245",
  "title": "Day 245: Recognise Who You Are",
  "description": "Psalm 105:1–5, Isaiah 1:2,16–18,26, 2:2, 2 Corinthians 5:11,14–15,17–21.  Appeal to them to become friends of God and ambassadors themselves  As royal ambassadors, act with diplomacy and skill because you are representing Christ on earth",
  "pubDate": "Fri, 02 Sep 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/245/",
  "itunes:duration": "14:54",
  "guid": "enyouth02092022-245",
  "length": 894.59,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 245: Recognise Who You Are",
  "itunes:subtitle": "Psalm 105:1–5, Isaiah 1:2,16–18,26, 2:2, 2 Corinthians 5:11,14–15,17–21.  Appeal to them to become friends of God and ambassadors themselves  As royal ambassadors, act with diplomacy and skill because you are representing Christ on earth",
  "itunes:summary": "The ambassadors I have met have always impressed me enormously. They have clearly been chosen very carefully. They have all been trained in the art of diplomacy. They are skilled at representing their country by both how they act and what they say.\nTo be an ambassador is an immense privilege. An ambassador is ‘a minister of the highest rank sent to a foreign court to represent the… sovereign or country’. A British Ambassador is a minister who represents Queen and country wherever they are sent.\nPaul writes that we are ‘Christ’s ambassadors’ (2 Corinthians 5:20). The Greek word translated as ‘ambassador’ shares the same root as ‘presbyter’, which is one of the words used to describe church leaders. Whether you are in a recognised leadership role in the church or not, you are an ambassador of Christ, with the extraordinary privilege and responsibility of representing Jesus in this world. You are God’s representative on earth.\nThrough you, God makes his appeal for others to be reconciled to God; to receive his forgiveness, love and grace. Appeal to them to become friends of God and ambassadors themselves. As royal ambassadors, act with diplomacy and skill because you are representing Christ on earth.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 610
}