{
  "title": "Moscow responds to neighbor’s ‘unprecedented’ move",
  "link": "https://www.rt.com/news/565817-russia-norway-military-alert/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565817-russia-norway-military-alert/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63627df92030270efc71be6e.jpg\" /> Norway’s “unprecedented” decision to put its military on heightened alert only stokes regional tensions, Moscow has said <br/><a href=\"https://www.rt.com/news/565817-russia-norway-military-alert/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Oslo is deliberately stoking tensions by raising its military alert level, the Russian Foreign Ministry has said</strong></p>\n            \n                        \n            <p>Norway&rsquo;s decision to put its armed forces on heightened alert amid the Ukraine conflict and Moscow&rsquo;s stand-off with the West is <em>&ldquo;unprecedented,&rdquo;</em> Russian Foreign Ministry spokeswoman Maria Zakharova said on Tuesday, adding that any unfriendly actions by Oslo will not go unanswered.</p>\n<p>Speaking at a regular press briefing, Zakharova noted that the move wouldn&rsquo;t have been of any concern to Moscow except for one <em>&ldquo;important detail.&rdquo;&nbsp;</em></p>\n<p><em>&ldquo;Basically, such an unprecedented step is justified &ndash; as you can easily guess &ndash; by the actions of Russia, which &lsquo;brought about the most serious security policy situation in Europe&rsquo;,&rdquo;</em> she said.</p>\n<p>Denying this allegation, Zakharova insisted that it was the West that was to blame for tensions with Moscow.<em> &ldquo;This was brought upon by your actions, not ours &hellip; You are the ones who have destabilized the situation on the European continent.&rdquo;</em></p>\n<p>The spokeswoman went on to warn that while Moscow was open to having a conversation based on mutual respect, it would also respond to any <em>&ldquo;unfriendly&rdquo;</em> steps by Oslo.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362765a2030270d9d310aa0.jpg\" alt=\"FILE PHOTO: Russian border guards inspect the electric alarm system and trace control stripe a few hundred meters from the Russian-Polish border.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565811-poland-russia-kaliningrad-border/\">Poland building fence along border with Russia</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>She also denounced what she called attempts to <em>&ldquo;ramp up the threat from the East, smear our country and attribute to it things it is not doing&rdquo;</em> by Norway. By doing so, the spokeswoman argued, Oslo was trying <em>&ldquo;to disguise its own aspirations in terms of military preparations.&rdquo;</em></p>\n<p>Zakharova added that Russia regards such actions close to its borders as Norway&rsquo;s bid to <em>&ldquo;deliberately follow destructive policies&rdquo;</em> meant <em>&ldquo;to stir up regional tensions.&rdquo;</em></p>\n<p>Zakharova&rsquo;s comments came after Norwegian Prime Minister Jonas Gahr Store announced that Oslo had raised the readiness level of its armed forces from phase 0 &ndash; a normal situation &ndash; to phase 1 on Monday. Explaining the move, the prime minister claimed Norway had found itself <em>&ldquo;in the most serious security policy situation in the past several decades,&rdquo;</em> while warning that since Russia is now <em>&ldquo;experiencing great resistance&rdquo;</em> on the ground in Ukraine, Moscow could be <em>&ldquo;resorting to other means&rdquo;</em> in its military campaign.</p>\n<p></p>",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 16:39:52 +0000",
  "dc:creator": "RT"
}