{
  "id": "yt:video:Z7rN9RJNjhw",
  "yt:videoId": "Z7rN9RJNjhw",
  "yt:channelId": "UCPD_bxCRGpmmeQcbe2kpPaA",
  "title": "Can Pro Chefs Make Frozen Pizza Gourmet? | Pizza Wars",
  "link": "",
  "author": {
    "name": "First We Feast",
    "uri": "https://www.youtube.com/channel/UCPD_bxCRGpmmeQcbe2kpPaA"
  },
  "published": "2022-10-26T17:00:17+00:00",
  "updated": "2022-10-29T01:16:50+00:00",
  "media:group": {
    "media:title": "Can Pro Chefs Make Frozen Pizza Gourmet? | Pizza Wars",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "We all have a special place in our hearts for frozen pizza. On this episode of Pizza Wars, host Nicole Russell faces off against James Beard Award-winning chef JJ Johnson to see who can take their favorite frozen pie to new heights by using better ingredients. Will late-night host Amber Ruffin and pizza expert Scott Wiener appreciate Nicole's guanciale-packed breakfast pizza, or will the judges fall in love with JJ's lobster-and-crab-covered seafood slices? Watch an all-new episode of Pizza Wars and find out! \n\nPresented by Ooni Pizza Ovens: https://ooni.com/pizza-wars\n\nBUY HOT ONES BONELESS CHICKEN BITES NOW: https://hotoneschallenge.com/\n\nMAKE A DIFFERENCE BY DONATING TO COMMON THREADS, THE BRAND-NEW CHARITY PARTNER OF HOT ONES: https://www.commonthreads.org/firstwefeast/\n\nBUY HOT ONES TRUTH OR DAB THE GAME NOW: http://truthordabgame.com\n\nBUY HOT ONES HOT SAUCE NOW: https://fwfea.st/hotsauces\n\nHOT ONES MERCH AVAILABLE NOW: https://bit.ly/2AIS271\n\nSIGN UP FOR THE HOT ONES MONTHLY HOT SAUCE SUB BOX: https://bit.ly/2veY50P\n\nSIGN UP FOR THE FIRST WE FEAST NEWSLETTER: http://firstwefeast.com/signup\n\nSubscribe to First We Feast on YouTube: http://goo.gl/UxFzhK\n\nCheck out more of First We Feast here:\n\nhttp://firstwefeast.com/\n\nhttps://twitter.com/firstwefeast\n\nhttps://www.facebook.com/FirstWeFeast\n\nhttp://instagram.com/firstwefeast\n\nFirst We Feast videos offer an iconoclastic view into the culinary world, taking you behind-the-scenes with some of the country’s best chefs and finding the unexpected places where food and pop culture intersect. #pizzawars #pizza",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}