{
  "title": "3 stages of marketing for your startup that can drive effective results",
  "link": "https://e27.co/3-stages-of-marketing-for-your-startup-that-can-drive-effective-results-20220419/",
  "dc:creator": "Vasanth Seshadri",
  "pubDate": "Tue, 01 Nov 2022 04:00:03 +0000",
  "category": [
    "Advertising",
    "Agency & Consulting",
    "Community"
  ],
  "guid": "https://e27.co/?p=457935",
  "description": "<p>“I don’t have time for marketing” and “I’m doing enough marketing for my current needs” are two of the most common refrains heard from startup founders. It’s easy to fall into these comfort zones when you need to manage everything else (product management, tech, operations, HR, finance) day-to-day and put out the frequent fires in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/3-stages-of-marketing-for-your-startup-that-can-drive-effective-results-20220419/\">3 stages of marketing for your startup that can drive effective results</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<img loading=\"lazy\" class=\"aligncenter wp-image-457997 size-full\" src=\"https://e27.co/wp-content/uploads/2022/04/e27-29.png\" alt=\"\" width=\"690\" height=\"390\" />\n<p>“I don’t have time for marketing” and “I’m doing enough marketing for my current needs” are two of the most common refrains heard from startup founders. It’s easy to fall into these comfort zones when you need to manage everything else (product management, tech, operations, HR, finance) day-to-day and put out the frequent fires in all of these above functions.</p>\n<p>But amidst the maelstrom, it makes sense to set aside some time to figure out your marketing.</p>\n<p>That’s because <a rel=\"follow\" href=\"https://e27.co/the-key-digital-marketing-tips-to-help-small-businesses-thrive-20210714/\">marketing isn’t just a function</a>. It helps you refine your startup’s concept, its raison d’etre, its ikigai. In some cases, it doesn’t just refine it. It defines it.</p>\n<p>I once worked with a startup that <em>wanted </em>a website. But what they <em>needed</em> was a brand narrative that defines and guides everything they do across mediums. A manifesto of what they are and are not, and the four pillars of their purpose, all articulated by an external agency (us) with a fresh pair of eyes. Once we gave them that, they took it way beyond the website task and embedded it into everything they did.</p>\n<p>Having worked with startups and scale-ups in health tech, fintech and food tech, I’ve identified three stages in any startup&#8217;s marketing. Depending on the startup, its age, its funding, and the vision of its founders, different startups need to work in various stages of their marketing.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/founders-marketing-build-in-public-20220224/\">How to use Twitter to market your product as a founder</a></strong></p>\n<p>Here’s my attempt to simplify and articulate these three stages. As we discuss this spectrum, feel free to ascertain where your startup is currently situated on it.</p>\n<h1>Brand fundamentals</h1>\n<p>The first stage is what I call brand fundamentals. This requires ascertaining the very essence of your brand and distilling it into a form that governs every communication ever done by your brand. Yes, your startup is a brand, however large or small.</p>\n<p>This sometimes looks like a brand pyramid or brand house. There are many different variants of this, but they all have certain foundational concepts at the base, such as product attributes, functional benefits and emotional benefits.</p>\n<p>As you move up the pyramid, the concepts take a loftier form, such as product personality and product positioning. At the very top would be the loftiest essence of a brand. This could be “real beauty and self-esteem” (if you’re a skincare brand) or “health and hygiene” (if you’re a hand sanitizer brand), or “helping people make connections over coffee” (if you’re a café or coffee brand)</p>\n<p>It would be best if you weren’t plucking these from thin air to fill up an artefact such as a pyramid or a house. It would be best if you had strategists who spend a lot of time researching your company, its current users, prospective users, their pain points, competitors, and so on before sieving out your unique essence and encapsulating it succinct yet informative way.</p>\n<h2>Foundational creative outputs</h2>\n<p>The second stage is what I call foundational creative outputs. This is how your startup looks to the world.</p>\n<p>A website that’s not just aesthetically pleasing but also high on its SEO creds. A delightful presence on the social media of your choice. Out-of-home ads or print materials if you deem fit. Or, in the light of our increasingly digital world, you might be better off investing in a podcast or an event platform.</p>\n<p>Meanwhile, don’t neglect the bare necessities like your everyday business collaterals and how your office looks. All these things need to draw directly from the fundamentals you’ve formulated in the first stage. Your brand essence cannot just remain in your internal docs and decks.</p>\n<p>The foundational creative outputs are how it sees the light of day and becomes visible to the wider world beyond those who work with you.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/diversity-and-inclusion-marketing-campaigns-everyone-everyday-forever-20220312/\">Diversity and inclusion marketing campaigns: Everyone, everyday, forever</a></strong></p>\n<h2>Advanced creative outputs</h2>\n<p>The third stage is what I call advanced creative outputs. You might want to announce your brand in a big way through a stunning video. You might attempt time-bound or market-specific social media campaigns. You might need an in-store presence, in which case your shopper marketing needs to be well thought out. You might even decide to go apeshit with an experiential AR/VR activation in a public place. This is arguably the most fun part of marketing.</p>\n<p>Ideally, stage one (brand fundamentals) should be done once, and it should be solidly in place. Occasionally you might want to rethink it, for example, if you’re entering a new market. But if you find yourself revisiting your brand fundamentals repeatedly, chances are you’ve yet to crack it.</p>\n<p>Stage two (foundational creative outputs) may need a regular rethink, given ever-evolving website design trends. But even that should ideally not change a whole lot. Think of your favourite brands, and chances are, they don’t drastically alter their social media voice or the aesthetics of their event pages on a whim.</p>\n<p>Stage three (advanced creative outputs) can be in flux. In fact, to keep things fresh and exciting, I recommend that they should be in a state of flux. Have fun with unexpected and creative ways to bring your brand to life while consciously filtering against what your brand is and isn’t.</p>\n<p>Some brands have the right to do humour. Some don’t. Some brands can talk with the authority of knowledge. Others with the familiarity of a friend. Ensure that every creative output stays true to who your brand is. Note that I said <em>who</em> your brand is, not <em>what</em> your brand is.</p>\n<p>No startup wants to remain a startup forever. But that risk is there if you get caught up in the whirlwind of the here and now and fail to strengthen the fundamentals that’ll take you where you want to be.</p>\n<p>The three-stage process I’ve outlined is meant to be a simple guide that can give you that bit of extra clarity you seek. I hope it helps!</p>\n<p>&#8211;</p>\n<p>Editor’s note: <b >e27</b> aims to foster thought leadership by publishing views from the community. Share your opinion by <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://e27.co/contributor\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://e27.co/contributor\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">submitting</a> an article, video, podcast, or infographic.</p>\n<p>Join our <b >e27</b> <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://t.me/joinchat/HmTbfBcGCZeykhM8NOlQ-g\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://t.me/joinchat/HmTbfBcGCZeykhM8NOlQ-g\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">Telegram group</a>, <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://www.facebook.com/groups/e27co/permalink/886904662065955/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.facebook.com/groups/e27co/permalink/886904662065955/\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">FB community</a>, or like the <b >e27</b> <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://www.facebook.com/e27/?ref=your_pages\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.facebook.com/e27/?ref=your_pages\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">Facebook page</a></p>\n<p>Image Credit: g-stockstudio via Canva Pro</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/3-stages-of-marketing-for-your-startup-that-can-drive-effective-results-20220419/\">3 stages of marketing for your startup that can drive effective results</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}