{
  "title": "236: Four Pillars of Stress Management with Dr. David Rabin",
  "pubDate": "Mon, 21 Jun 2021 18:51:03 +0000",
  "guid": "6aa481ee-3a7f-475a-ae2a-21d3b13f8a05",
  "link": "https://sites.libsyn.com/94610/236-four-pillars-of-stress-management-with-dr-david-rabin",
  "itunes:image": "",
  "description": "<p>Four Pillars of Stress Management with Dr. David Rabin</p> <p>Can technology help you reduce stress and anxiety in your life?<br /> <br /> This is a question that comes a lot in the Kwik Brain Universe. So if you’ve ever wanted to know how to mitigate and reduce stress by finding ways to face challenging and turbulent times, this episode is for you.</p> <p>Our special guest today is Dr. David Rabin. He’s an MD, Ph.D., neuroscientist, and board-certified psychiatrist who has studied the impact of chronic stress in humans for over a decade.</p> <p>In addition, he’s the Chief Innovation Officer at Apollo Neuroscience, which has developed a scientifically validated wearable technology that actively improves energy, focus, and relaxation through a touch therapy that signals safety to the brain.</p> <p>Listen in as Dr. Rabin goes over the four pillars of stress management and provides actionable steps for you to build a foundation of trust in yourself.</p> <p class=\"p1\">*** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. ***</p>",
  "content:encoded": "<p>Four Pillars of Stress Management with Dr. David Rabin</p> <p>Can technology help you reduce stress and anxiety in your life?  This is a question that comes a lot in the Kwik Brain Universe. So if you’ve ever wanted to know how to mitigate and reduce stress by finding ways to face challenging and turbulent times, this episode is for you.</p> <p>Our special guest today is Dr. David Rabin. He’s an MD, Ph.D., neuroscientist, and board-certified psychiatrist who has studied the impact of chronic stress in humans for over a decade.</p> <p>In addition, he’s the Chief Innovation Officer at Apollo Neuroscience, which has developed a scientifically validated wearable technology that actively improves energy, focus, and relaxation through a touch therapy that signals safety to the brain.</p> <p>Listen in as Dr. Rabin goes over the four pillars of stress management and provides actionable steps for you to build a foundation of trust in yourself.</p> <p class=\"p1\">*** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. ***</p>",
  "enclosure": "",
  "itunes:duration": "22:00",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Four Pillars of Stress Management with Dr. David Rabin Can technology help you reduce stress and anxiety in your life?  This is a question that comes a lot in the Kwik Brain Universe. So if you’ve ever wanted to know how to mitigate and reduce...",
  "itunes:episodeType": "full"
}