{
  "title": "Overcome Imposter Syndrome | Lisa Orbé-Austin, PhD",
  "pubDate": "Mon, 10 Jan 2022 09:00:00 +0000",
  "guid": "aa053d3b-49a3-48fe-aa61-13aa1119521d",
  "link": "https://beautyuncovered.libsyn.com/overcome-imposter-syndrome-lisa-orb-austin-phd",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Have you ever been in a situation where you felt as though you were completely unequipped for what was ahead? The question is: is it self-doubt or imposter syndrome? Today, we have one of our most highly anticipated subjects. Lisa Orbé-Austin is a Licensed Psychologist and Executives Coach with a focus on career advancement, leadership, development, and job transitions. She is the Co-founder and Partner of Dynamic Transitions Psychological Counseling. She has a book out called</span> <em><span style=\"font-weight: 400;\">Own Your Greatness: Overcome Impostor Syndrome, Beat Self-Doubt, and Succeed in Life</span></em><span style=\"font-weight: 400;\">, and also recently gave a TEDx Talk titled</span> <em><span style= \"font-weight: 400;\">Imposter Syndrome Paradox</span></em><span style=\"font-weight: 400;\">.</span></p>",
  "content:encoded": "<p>Have you ever been in a situation where you felt as though you were completely unequipped for what was ahead? The question is: is it self-doubt or imposter syndrome? Today, we have one of our most highly anticipated subjects. Lisa Orbé-Austin is a Licensed Psychologist and Executives Coach with a focus on career advancement, leadership, development, and job transitions. She is the Co-founder and Partner of Dynamic Transitions Psychological Counseling. She has a book out called <em>Own Your Greatness: Overcome Impostor Syndrome, Beat Self-Doubt, and Succeed in Life</em>, and also recently gave a TEDx Talk titled <em>Imposter Syndrome Paradox</em>.</p>",
  "enclosure": "",
  "itunes:duration": "33:35",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Have you ever been in a situation where you felt as though you were completely unequipped for what was ahead? The question is: is it self-doubt or imposter syndrome? Today, we have one of our most highly anticipated subjects. Lisa Orbé-Austin is a...",
  "itunes:episodeType": "full"
}