{
  "guid": "urn:uuid:7fa28933-a876-40d4-9012-084ee9a0910f",
  "link": "https://www.who.int/news/item/19-10-2022-who-highlights-high-cost-of-physical-inactivity-in-first-ever-global-report",
  "a10:author": {
    "a10:name": ""
  },
  "title": "WHO highlights high cost of physical inactivity in first-ever global report",
  "description": "The Global status report on physical activity 2022, published today by the World Health Organization, measures the extent to which governments are implementing recommendations to increase physical activity across all ages and abilities.",
  "pubDate": "Tue, 18 Oct 2022 18:32:46 Z",
  "a10:content": "<p><em>Almost 500 million people will develop heart disease, obesity, diabetes or other noncommunicable diseases (NCDs) attributable to physical inactivity, between 2020 and 2030, costing </em>US$ 27 billion annually,<em> if governments don&rsquo;t take urgent action to encourage more physical activity among their populations.</em></p><p>The <a href=\"https://www.who.int/publications-detail-redirect/9789240059153\">Global status report on physical activity 2022</a>, published today by the World Health Organization, measures the extent to which governments are implementing recommendations to increase\n    physical activity across all ages and abilities.</p><p>Data from 194 countries show that overall, progress is slow and that countries need to accelerate the development and implementation of policies to increase levels of physical activity and thereby prevent disease and reduce burden on already overwhelmed\n    health care systems.</p><ul><li>Less than 50% of countries have a national physical activity policy, of which less than 40% are operational</li><li>Only 30% of countries have national physical activity guidelines for all age groups</li><li>While nearly all countries report a system for monitoring physical activity in adults, 75% of countries monitor physical activity among adolescents, and less than 30% monitor physical activity in children under 5 years</li><li>In policy areas that could encourage active and sustainable transport, only just over 40% of countries have road design standards that make walking and cycling safer. &nbsp;</li></ul><p>\"We need more countries to scale up implementation of policies to support people to be more active through walking, cycling, sport, and other physical activity.&nbsp;The benefits are huge, not only for the physical and mental health of individuals, but\n    also for societies, environments, and economies...&rdquo; said Dr Tedros Adhanom Ghebreyesus, WHO Director-General, &ldquo;We hope countries and partners will use this report to build more active, healthier, and fairer societies for all.&rdquo; &nbsp;<s></s></p><p>The economic burden of physical inactivity is significant and the cost of treating new cases of preventable non-communicable diseases (NCDs) will reach nearly US$ 300 billion by 2030, around US$ 27 billion annually.</p><p>Whilst national policies to tackle NCDs and physical inactivity have increased in recent years, currently 28% of policies are reported to be not funded or implemented. Considered a &ldquo;best buy&rdquo; for motivating populations to combat NCDs, the\n    report showed that only just over 50% of countries ran a national communications campaign, or organised mass participation physical activity events in the last two years. The COVID-19 pandemic has not only stalled these initiatives, but it also affected\n    other policy implementation which has widened inequities in access to and, opportunities for, engaging in physical activity for many communities.</p><p>To help countries increase physical activity, WHO&rsquo;s Global action plan on physical activity 2018-2030 (GAPPA) sets out 20 policy recommendations &ndash; including policies to create safer roads to encourage more active transport, provide more programmes\n    and opportunities for physical activity in key settings, such as childcare, schools, primary health care and the workplace. Today&rsquo;s Global Status report assesses country progress against those recommendations, and shows that much more needs\n    to be done. &nbsp;One critical finding in the Global status report on physical activity is the existence of significant gaps in global data to track progress on important policy actions &ndash; such as provision of public open space, provision of\n    walking and cycling infrastructure, provision of sport and physical education in schools. The report also calls for weaknesses in some existing data to also be addressed. &nbsp;&nbsp;</p><p>&ldquo;We are missing globally approved indicators to measure access to parks, cycle lanes, foot paths &ndash; even though we know that data do exist in some countries. Consequently, we cannot report or track the global provision of infrastructure that\n    will facilitate increases in physical activity, &ldquo;said Fiona Bull, Head of WHO Physical Activity Unit. &nbsp;&ldquo;It can be a vicious circle, no indicator and no data leads to no tracking and no accountability, and then too often, to no policy\n    and no investment. What gets measured gets done, and we have some way to go to comprehensively and robustly track national actions on physical activity.&rdquo;</p><p>The report calls for countries to prioritize physical activity as key to improving health and tackling NCDs, integrate physical activity into all relevant policies, and develop tools, guidance and training to improve implementation.</p><p>&ldquo;It is good for public health and makes economic sense to promote more physical activity for everyone,&rdquo; said Dr Ruediger Krech, Director Department of Health Promotion, WHO. &ldquo;We need to facilitate inclusive programmes for physical activity\n    for all and ensure people have easier access to them. &nbsp;This report issues a clear call to all countries for stronger and accelerated action by all relevant stakeholders working better together to achieve the global target of a 15% reduction in\n    the prevalence of physical inactivity by 2030.&rdquo;</p><p><em>Data for the report are drawn from the <a href=\"https://apps.who.int/iris/handle/10665/331452\">WHO Noncommunicable Disease Country Capacity Survey (2019 and 2022)</a> and the <a href=\"https://apps.who.int/iris/handle/10665/276462\">WHO Global status report on road safety (2018).</a></em></p><p><em>The cost of inaction on physical inactivity to healthcare systems manuscript at <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4248284\">Preprints with The Lancet</a> (peer-reviewed version forthcoming in The Lancet Global Health)</em></p><p>&nbsp;</p>"
}