{
  "title": "How To Install Castaway Kodi Add-on",
  "link": "https://www.prooffreader.com/how-to-install-castaway-kodi-add-on/",
  "dc:creator": "James Austin",
  "pubDate": "Thu, 30 Sep 2021 18:51:11 +0000",
  "category": [
    "Kodi",
    "Uncategorized"
  ],
  "guid": "http://www.prooffreader.com/?p=1223",
  "description": "<p>The Castaway Kodi addon is popular for streaming live sporting events, such as the English Premier League and college football. ... </p>\n<p class=\"read-more-container\"><a title=\"How To Install Castaway Kodi Add-on\" class=\"read-more button\" href=\"https://www.prooffreader.com/how-to-install-castaway-kodi-add-on/#more-1223\" aria-label=\"More on How To Install Castaway Kodi Add-on\">Read more</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.prooffreader.com/how-to-install-castaway-kodi-add-on/\">How To Install Castaway Kodi Add-on</a> appeared first on <a rel=\"nofollow\" href=\"https://www.prooffreader.com\">ProoFFreader</a>.</p>\n",
  "content:encoded": "\n<p>The Castaway Kodi addon is popular for streaming live sporting events, such as the English Premier League and college football. This addon comes with different categories, airing Tennis, Basketball, Baseball, Hockey, and many more.</p>\n\n\n\n<h2>General Features and Functionality</h2>\n\n\n\n<p>One of the most outstanding qualities of the Castaway addon is that it uses peer-to-peer (P2P) technology, or what is currently referred to as torrenting. Unlike other conventional Kodi addons that use link scrappers, the Castaway P2P technique enables users to upload, download or stream content from an online host.&nbsp;</p>\n\n\n\n<p>Uploading the content means that content will remain in circulation even if the hosting server is down or offline.</p>\n\n\n\n<p>With traditional link scrapping Kodi addons, there are times when online hosts shut down due to high traffic. When servers are down, much of the content they host is unavailable to users. But this doesn&#8217;t usually happen with P2P Kodi addons like Castaway because of the content uploading and sharing factor.</p>\n\n\n\n<p>Another advantage of Castaway compared to other link-scrapping Kodi addons is that when streaming using this addon, the content is partially downloaded to minimize video lagging and buffering for a better streaming experience. Castaway also allows you to download content from multiple sources for offline viewing.</p>\n\n\n\n<p>Castaway Kodi addon menu options include:</p>\n\n\n\n<p><strong>Live Sports </strong>features several streaming options covering soccer, NFL, basketball, baseball, and more.</p>\n\n\n\n<p><strong>Live TV </strong>has a vast selection of broadcast TV channel sources. It is also divided into multiple sub-categories for easier browsing and channel selection.</p>\n\n\n\n<p><strong>P2P Corne</strong> streams live sports from the source or downloads it directly to your Kodi device.</p>\n\n\n\n<p><strong>Sports on Demand </strong>is a dedicated section for sports archives. It includes sports such as American football, hockey, basketball, soccer, and more.</p>\n\n\n\n<p><strong>Subreddits</strong> are forums following a specific topic on the popular social media platform Reddit. For example, you can add an American football subreddit that shares game highlights, high scores, and live games.</p>\n\n\n\n<h2>Compatibility</h2>\n\n\n\n<p>The Castaway addon works well with all major platforms. They include:&nbsp;</p>\n\n\n\n<ul><li>Android</li><li>Windows</li><li>Linux</li><li>Mac OS</li><li>iOS</li></ul>\n\n\n\n<p>Unfortunately, the Castaway addon is currently incompatible with Kodi 19 Matrix but works well with Kodi 18 Leia and Kodi 17.</p>\n\n\n\n<h2>Installation Prerequisites</h2>\n\n\n\n<p>You need to allow installation from unknown sources from Kodi settings. This step is necessary because Castaway is not available in the official Kodi repository, given that it is a third-party addon.&nbsp;</p>\n\n\n\n<p>Next, ensure you have the URL to the official Castaway addon repository, Super Repo.&nbsp;</p>\n\n\n\n<p>Remember, it&#8217;s best to use the repository with the addon&#8217;s latest version when installing Castaway. This makes the installation process easier and gives you access to the newest features.&nbsp;</p>\n\n\n\n<p>Finally, integrate your addon with a premium account like Real-Debrid or Premiumize to upgrade your link sources.</p>\n\n\n\n<p>In summary, follow the steps below to install the Castaway addon:</p>\n\n\n\n<ul><li>Enable unknown sources.</li><li>Add a media source.</li><li>Install Castaway addon from the repository.</li></ul>\n\n\n\n<p>Here&#8217;s the repository information you need for proper installation:</p>\n\n\n\n<ol><li>Name of the Add-on: Castaway addon</li><li>Repository name: Super Repo</li><li>Category: Video sources</li><li>Media source naming: Castaway</li><li>The latest working source URL:  <a href=\"http://srp.nu/\">http://srp.nu/</a></li></ol>\n\n\n\n<pre class=\"wp-block-preformatted has-pale-ocean-gradient-background has-background\" style=\"font-size:18px\"><strong>How Not To F*ck Up Your Kodi Experience:</strong> Streaming movies and TV shows on any of the 3rd party Kodi-addons may be illegal in your country due to copyright issues. \n\nConsider using a VPN if you truly care about protecting your online privacy.\n\n<strong>Here are the key benefits of hiding your IP (using VPN):</strong>\n\n1) Encrypts your internet traffic.\n2) You can access Geo-restricted content.\n3) You can avoid ISP throttling.\n4) You can avoid unwanted surveillance by government agencies and ISPs.\n5) You can protect yourself from hackers.\n\nConnect VPN on all of your streaming devices (iOS, Windows, Android, Amazon Fire TV, etc.) and enjoy worry-free & high-speed movie experience 24/7.\n\n<strong>The Most Popular VPN Providers Among Kodi Users Are:</strong>\n\n1) <a rel=\"noreferrer noopener\" href=\"http://www.prooffreader.com/recommends/cyberghostvpn/\" target=\"_blank\"><strong>Get CyberGhost</strong></a> - 45-Day Money-Back Guarantee\n2) <a rel=\"noreferrer noopener\" href=\"http://www.prooffreader.com/recommends/expressvpn/\" target=\"_blank\"><strong>Get ExpressVPN</strong></a> - 30-Day Money-Back Guarantee\n3) <a rel=\"noreferrer noopener\" href=\"http://www.prooffreader.com/recommends/privatevpn/\" target=\"_blank\"><strong>Get</strong> <strong>PrivateVPN</strong></a> - 30-Day Money-Back Guarantee</pre>\n\n\n\n<h2>Installation Guide</h2>\n\n\n\n<h3><strong>First Things First – Enable Installation From Unknown Sources</strong></h3>\n\n\n\n<p>Go to Home Screen, click on the gear icon, click on system, select “add-ons” on the left side menu, allow installation from “Unknown Sources”, click “yes” when the warning popup appears.&nbsp;</p>\n\n\n\n<h3><strong>Installing Super Repository</strong></h3>\n\n\n\n<ol><li>Go to Home Screen, click on Gear Icon, click on File Manager;</li><li>Click Add Source, Click None, Type in the URL <strong>&#8220;<strong>http://srp.nu/</strong>”</strong> and click Done;</li><li>Pick a name for the repository (i.e. Super) and enter it in the bottom box and click OK;</li><li>Click back until you are in the Main Menu, select Addons on the left side; </li><li>Click on the Box Symbol (top left corner), Choose Install From ZIP file, click Yes when a warning appears;</li><li>Open “Alfa” Source and choose this file: <strong>“<strong>superrepo.kodi.krypton.all-0.7.04.zip</strong>”</strong></li><li>A notification saying “Installed Successfully” will appear.</li></ol>\n\n\n\n<h3><strong>Installing Castaway Kodi Addon</strong></h3>\n\n\n\n<ol><li>Go to Home Screen, find Add-ons on the left side, select the box symbol (top left corner) to get to the Addon Browser;</li><li>Click on Install From Repository, choose Super Addon Repo, click on Video Addons in the category section;</li><li>Click on Castaway and hit install, select OK to confirm the installation of dependencies (don’t appear in Kodi 19 Matrix);</li><li>A notification saying “Installed Successfully” will appear;</li><li>You have now downloaded Castaway to Kodi. You can now access the addon from the main menu. </li></ol>\n\n\n\n<h2>Alternative Addons</h2>\n\n\n\n<p>As earlier mentioned, Castaway is not compatible with the latest Kodi version, Kodi 19 Matrix. Fortunately, several alternative addons work great on Kodi 19.&nbsp;</p>\n\n\n\n<ul><li><strong>SportsDevil </strong>is one of the best Kodi sports addons. It comes with great features and a high-quality live sports stream. Besides, the SportsDevil addon offers a well-categorized menu that is easy to navigate and a vast library of sports content worldwide.<br></li><li><strong>Apex Sports</strong> is a new Kodi addon from the Arctic-ape repository. This addon comes with a wide selection of sports replays, live sports events, and highlights from more than a dozen popular sports websites. Apex Sports works well with Kodi 19 Matrix and Kodi 18 Leia.<br></li><li><strong>Q Sports</strong> features a massive library of sports content with Live Sports, Soccer Streams, Sports Bay, Roja Direct, US TV Go, and many more.</li></ul>\n\n\n\n<h2>Common Issues With Castaway Addon</h2>\n\n\n\n<p>Here are some of the most common issues you may encounter with the Castaway addon and how to solve them:</p>\n\n\n\n<h3>Castaway Installation Failure</h3>\n\n\n\n<p>This error occurs when you attempt to install the addon from unofficial repositories, or your internet connection is unstable. Luckily, the problem of installation failure is easy to diagnose and solve, as explained below.</p>\n\n\n\n<h3>Use the Official Repository</h3>\n\n\n\n<p>The Castaway addon is available on various repositories, which makes it easy to access and install. Unfortunately, using most of these repositories to install this addon will likely lead to installation failure because unofficial repositories do not contain the latest working version of the Castaway addon.</p>\n\n\n\n<p>In this case, the best solution is to install Castaway from Super Repo.</p>\n\n\n\n<h3>Check Your Internet Connection</h3>\n\n\n\n<p>Fast and stable internet is a necessity when installing any addon like Castaway with an online host. If you are encountering addon installation failure, check to see if your internet connection is stable.</p>\n\n\n\n<p>If you establish that the installation failure is due to a slow connection, unplug your router, then wait for a few minutes before plugging it in. Then, you can proceed with the Castaway addon installation when the connection is stable.</p>\n\n\n\n<h3>Castaway Error Check Log</h3>\n\n\n\n<p>The &#8216;Error Check Log&#8217; occurs due to using a repository that has missing files or when you have a filled-up cache. In that case, here&#8217;s what to do:&nbsp;</p>\n\n\n\n<h3>Clear Cache</h3>\n\n\n\n<p>Cache is the temporary storage that saves online data you frequently use for easy access in the future. When you have more accumulated data within your addon than is necessary, your videos will take too long to load or fail play at all, causing the &#8216;Error Check Log.&#8217;</p>\n\n\n\n<p>To clear cache, click on the addon&#8217;s Settings under the tools section, select Clear Cache, or use a maintenance tool like OpenWizard.&nbsp;</p>\n\n\n\n<p>Clearing cache is also an excellent solution to any video buffering and lagging issues you may be experiencing with Castaway.</p>\n\n\n\n<h3>Use a VPN</h3>\n\n\n\n<p>It is also common to encounter the &#8216;Error Check Log&#8217; when streaming geo-restricted content or when your Internet Service Provider blocks a source. Connecting to a VPN is one of the best ways to circumvent geo-restrictions and ISP blocks.</p>\n\n\n\n<p>A VPN is also a great way to browse anonymously while keeping your internet data secure.</p>\n\n\n\n<h3>Update the URLResolver</h3>\n\n\n\n<p>A URLResolver works in the background of an addon to decode any files requested by the addon into a format you can understand.</p>\n\n\n\n<p>In most cases, you automatically receive the latest version of the URLResolver when installing the Castaway addon. But if you still notice an &#8216;Error Check Log&#8217; after clearing cache and using a VPN, you may need to update your URLResolver.</p>\n\n\n\n<p>To download the latest URLResolver, go to <a href=\"https://github.com/\">Github</a> and search for your addon&#8217;s URL resolver. After downloading and installing the URLResolver, relaunch the Castaway addon.&nbsp;</p>\n\n\n\n<h3>Castaway &#8216;No Stream Available&#8217; Error</h3>\n\n\n\n<p>The &#8216;No Stream Available&#8217; error occurs when the link to the content you are looking for is too old to grab or too recent, meaning it&#8217;s not yet available on the main online hosts. This error can also occur when you have a poor internet connection.</p>\n\n\n\n<p>Here&#8217;s to solve the &#8216;No Stream Available&#8217; error on Castaway.&nbsp;</p>\n\n\n\n<h4>Clear Cache</h4>\n\n\n\n<p>In most cases, data accumulation on your addon leaves little room for video playback. When there is insufficient space for playback, videos take too long to load, resulting in the &#8216;No Stream Available&#8217; error.&nbsp;</p>\n\n\n\n<p>Luckily, you only need to click on the Clear Cache option under your addon&#8217;s settings to fix this issue.</p>\n\n\n\n<h4>Fix Any Network Problems</h4>\n\n\n\n<p>Network interference can sometimes cause a &#8216;No Streams Available&#8217; error. To fix this problem, unplug your router from its power source, and wait for a few minutes to plug it back in.</p>\n\n\n\n<h4>Adjust Your Timeout Settings</h4>\n\n\n\n<p>Sometimes trying to stream large, high-quality video files can lead to the &#8216;No Stream Available&#8217; error. The best solution to this problem is to adjust the providers&#8217; timeout settings to at least 60 seconds, giving the addon enough time to load the content before being timed out.&nbsp;</p>\n\n\n\n<h3>Castaway Cannot Connect to the Server</h3>\n\n\n\n<p>This issue usually occurs due to a poor internet connection or the repository source moving to a new URL. To fix it, check if the repository URL is still online and works.&nbsp;</p>\n\n\n\n<p>If the repository URL no longer works, use a different one to install the Castaway addon. After installing, relaunch the addon.</p>\n\n\n\n<p>If the issue persists, check if your internet connection is stable enough. If unstable, unplug the router from the power outlet and then wait a few minutes before plugging it in.&nbsp;</p>\n\n\n\n<h2>&nbsp;</h2>\n\n\n\n<h2>Frequently Asked Questions About Castaway Kodi Addon&nbsp;</h2>\n\n\n\n<h3>Do I Need a VPN To Use the Castaway Addon?</h3>\n\n\n\n<p>It is advisable to use a VPN with third-party Kodi addons like Castaway. A VPN not only protects your privacy only, but also reduces bandwidth by 50%.&nbsp;</p>\n\n\n\n<h3>Is the Castaway Kodi Addon Free?&nbsp;</h3>\n\n\n\n<p>Yes, downloading and installing this addon is free.</p>\n\n\n\n<h3>Is the Castaway Addon Legal?</h3>\n\n\n\n<p>Yes, using the Castaway addon itself is safe and legal. But using Castaway to stream copyrighted content is illegal.&nbsp;</p>\n\n\n\n<h3>Why Is Castaway Not Working?</h3>\n\n\n\n<p>The problem of Castaway not working usually derives from different scenarios, as explained earlier in this article. Follow our troubleshooting tips to find the best solution to the specific problem.&nbsp;&nbsp;</p>\n\n\n\n<h2>Conclusion</h2>\n\n\n\n<p>With Castaway&#8217;s great selection of sports channels and live sports options, it&#8217;s no surprise that this addon has been popular among sports fans for years. The addon&#8217;s P2P file-sharing technique is a game-changer. It provides the ultimate sports streaming experience, placing this addon ahead of many Kodi sports addons available in the market.&nbsp;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.prooffreader.com/how-to-install-castaway-kodi-add-on/\">How To Install Castaway Kodi Add-on</a> appeared first on <a rel=\"nofollow\" href=\"https://www.prooffreader.com\">ProoFFreader</a>.</p>\n"
}