{
  "title": "TU92: Understanding Addiction and Attachment-Informed Treatment With Guests Brad Kennedy &#038; Vanessa Kennedy",
  "link": "https://therapistuncensored.com/episodes/tu92-understanding-addiction-and-attachment-informed-treatment-with-guests-brad-kennedy-vanessa-kennedy/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu92-understanding-addiction-and-attachment-informed-treatment-with-guests-brad-kennedy-vanessa-kennedy",
  "pubDate": "Fri, 15 Mar 2019 00:37:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=6913",
  "description": "Learn 3 distinct features that make one vulnerable to addiction and understand the varied dynamics through the lens of attachment and emotional regulation.\n\nIn today’s episode, Dr. Ann Kelley interviews two experts in the field of substance abuse treatment, Brad Kennedy and Dr. Vanessa Kennedy from Driftwood Recovery Center. They discuss their attachment-based perspective on what addiction is, how it develops, how understanding our attachment styles critically impacts the treatment and recovery process.  Learn what they have to say about stigma, shame, self-destruction, and check out the incredible resources included in today’s topic.\n\nAddiction affects almost every one of us. There are many opinions and controversies in the field of what causes it, what helps and how to address it.\n\nWhen viewed through the lens of attachment, we are able to understand why we have developed unhealthy coping mechanisms and how they no longer serve us. This understanding is essential to treat the issues underlying our destructive behaviors as well as how we connect with others.\n\nBy getting curious about our behaviors and understanding why we do what we do, we can begin shifting our narrative from one of shame to one of compassion. This compassionate narrative combined with an attachment-based, integrative treatment approach, and most importantly, connection with others, are essential to co-creating a path to recovery and ultimately, the version of ourselves we wish to become.\nBrad Kennedy, MRC, CRC\nVice President, Executive Director of Driftwood Recovery Center \nBrad has been a national leader in developing innovative programs to help individuals recover from addiction and mental health issues for the past twenty years. He comes to us from the Menninger Clinic and is the Founding Board Member of the Association for Community Integration Programs (A4CIP). The A4CIP is an organization that assembles experts to share perspectives on how to help individuals with mental illness and addiction live healthy lives and integrate back into society.\n\nBrad’s is now the Executive Director at the Driftwood Recovery Center, where he and the team focus on evidence-based techniques and integrative treatment. He has a special passion for community integration and aiding individuals in identifying their values and leading a meaningful life after treatment and through their recovery.\nVanessa S. Kennedy, PhD\nDirector of Psychology at Driftwood Recovery Center\nDr. Vanessa Kennedy has over a decade of experience working with the Menninger Clinic, one of the nation’s top psychiatric hospitals. As a Program Manager and Senior Psychologist, she treats people suffering from addiction and a variety of serious mental health issues.\n\nDr. Kennedy specializes in psychological testing and diagnostic formulations. She has a passion for helping individuals and their families make sense of the psychological underpinnings of addiction and other behaviors. As the Driftwood Director of Psychology, she provides psychological assessments to clarify diagnosis, screen for cognitive issues, and provide a clearer road map for treatment that substances and medications may have obscured.\nIn this episode of Therapist Uncensored,\nWhat is the definition of addiction? \n\n \tThe “real world” definition of addiction is various behaviors that interfere in your life that might keep you from really living your values.\n\nAddiction is relevant to everyone. \n\n \tWhat addiction includes\n \tPlus, what behaviors do you regularly and habitually engage in (coffee drinking, checking your phone, etc.)? Are they disrupting your life?\n\nHow do you know when a habit has become a problem, and what do you do about it? \n\n \tIt starts with awareness of our habits and their impact. Am I using it to manipulate my mood? Take a curious, non-judgmental stance and continue to ask ourselves why we like and do the things we do.\n\nBeing curious isn’t as easy as it sounds.",
  "enclosure": "",
  "itunes:subtitle": "Learn 3 distinct features that make one vulnerable to addiction and understand the varied dynamics through the lens of attachment and emotional regulation. - In today’s episode, Dr. Ann Kelley interviews two experts in the field of substance abuse tre...",
  "itunes:summary": "Learn 3 distinct features that make one vulnerable to addiction and understand the varied dynamics through the lens of attachment with guests Brad Kennedy and Dr. Vanessa Kennedy. By getting curious about our behaviors and understanding why we do what we do, we can begin shifting our narrative from one of shame to one of compassion.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "1:14:47"
}