{
  "title": "The Federal Government Can Do More to Fight Credential Inflation",
  "link": "https://www.aei.org/education/the-federal-government-can-do-more-to-fight-credential-inflation/",
  "dc:creator": "George Pierson",
  "pubDate": "Thu, 03 Nov 2022 17:49:50 +0000",
  "category": [
    "Education",
    "Higher Education",
    "Biden administration",
    "Higher education",
    "Student loans"
  ],
  "guid": "https://www.aei.org/?p=1008664691",
  "description": "<p>Removing some degree requirements, in the long run, may do more to promote opportunity and limit student debt than any debt forgiveness program ever could.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/education/the-federal-government-can-do-more-to-fight-credential-inflation/\">The Federal Government Can Do More to Fight Credential Inflation</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<p>In a recent piece, Rick Hess <a href=\"https://www.aei.org/op-eds/student-borrowing-is-the-symptom-legally-suspect-degree-requirements-are-the-problem/?mkt_tok=NDc1LVBCUS05NzEAAAGH0bJKagorDJIE7YzpYRJ7mXnmGOdd4fy8ZsPhiaYUq8E-5sNAN5O_JlY4bsVBp5HYdvL_Gd1-FQm8dOl63w_4VfDJXkN05NwxcFT3CE-jrxdJGV8\" target=\"_blank\" rel=\"noreferrer noopener\">argues</a> that there is a strong link between the growing student debt burden (which has led to President Joe Biden’s recent loan forgiveness) and “credential inflation,” whereby employers require higher levels of education for jobs that have not changed much over the years in terms of responsibilities or compensation. He’s exactly right. </p>\n\n\n\n<p>Research has <a href=\"https://www.hbs.edu/managing-the-future-of-work/Documents/dismissed-by-degrees.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">shown</a> massive increases in the proportion of job postings that require a degree for positions such as office administrators and supervisory roles in retail, sales, and the trades. Once these were viable rungs on the ladder to the middle class for those without college degrees, but today that is less frequently the case.</p>\n\n\n\n<p>Drivers of these inflated requirements include employer hiring practices, actions by state licensing bodies, and even college accreditors. Motivations for filtering out anyone lacking a college degree vary too. It may simply be easier to sort through fewer applications and degree requirements. It also may be one of the few easy and (for now) legally permissible filters employers can use. Or it may have to do with elitism or protectionism: the desire to build walls to keep those with less prestigious credentials, or simply more competition, out of a given profession.</p>\n\n\n\n<p>Regardless of the cause, however, the result is the same: It costs more to get the credentials necessary to do the same job at the same pay than in the past. The connection between these requirements and the necessary cost (both to students and taxpayers) to obtain the required credentials should be obvious but is too-seldom discussed. As Rick points out:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Washington has distorted the labor market by encouraging employers to turn college degrees into an all-purpose proxy for employability. This has fueled degree inflation, exaggerated the importance of a college degree, and inflated costs.</p></blockquote>\n\n\n\n<p>Rick also rightly notes that the federal government could do more to “ensure that legally suspect degree requirements are subjected to the same scrutiny as any other potentially suspect hiring test.”</p>\n\n\n\n<p>But the federal government also has a role to play as an employer; in fact, it is the nation’s largest.  During the previous administration, <a href=\"https://www.federalregister.gov/documents/2020/07/01/2020-14337/modernizing-and-reforming-the-assessment-and-hiring-of-federal-job-candidates\" target=\"_blank\" rel=\"noreferrer noopener\">Executive Order 13932</a> removed degree requirements and preferences for federal civilian jobs and created broad space for what federal jobs could require instead.</p>\n\n\n\n<p>Fortunately, this might be the only executive order from his predecessor dealing with the civil service that President Biden left in place. His Office of Personnel Management has its work cut out for it to ensure that, not only will federal agencies implement the order with fidelity, but also that they have the tools necessary to cast a wider net and find talent in better ways.</p>\n\n\n\n<p>As is the case in the private sector—where some major companies have also pledged to do away with degree requirements—implementation is what will matter most. Hiring based on what people know and can do, rather than simply how many years they spent in school, is a smarter strategy that can help companies limit turnover, improve diversity, and reduce time-to-hire.&nbsp;</p>\n\n\n\n<p>The federal government could help both itself and the private sector by aggressively implementing this order and developing concrete strategies the private sector might then feel comfortable enough to adopt. In the long run, this may do more to promote opportunity and limit student debt than any debt forgiveness program ever could.</p>\n\n\n\n<div class=\"related-items shortcode \"><p><strong>Learn more: </strong><a href=\"https://www.aei.org/education/are-congressional-staff-now-the-biggest-student-loan-forgiveness-winners/\">Are Congressional Staff Now the Biggest Student Loan Forgiveness Winners?</a> | <a href=\"https://www.aei.org/op-eds/bidens-future-plans-for-higher-education-will-be-even-more-radical/\">Biden’s Future Plans for Higher Education Will Be Even More Radical</a> | <a href=\"https://www.aei.org/op-eds/school-choice-must-not-be-absorbed-by-the-blob/\">School Choice Must Not Be Absorbed by the Blob</a> | <a href=\"https://www.aei.org/education/in-higher-education-focus-on-the-program-not-just-the-college/\">In Higher Education, Focus on the Program—Not Just the College</a></p></div>\n\n\n\n<p></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/education/the-federal-government-can-do-more-to-fight-credential-inflation/\">The Federal Government Can Do More to Fight Credential Inflation</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}