{
  "title": "Episode 1: &#8220;Flying Home&#8221; by the Benny Goodman Sextet",
  "link": "https://500songs.com/podcast/flying-home-by-the-benny-goodman-sextet/",
  "pubDate": "Sun, 07 Oct 2018 23:00:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/flying-home-by-the-benny-goodman-sextet/",
  "description": "Welcome to the first episode proper of&nbsp;<em>A History of Rock Music in 500 Songs</em>! As this is the first real episode, you may notice a couple of flaws in the production -- those will hopefully get ironed out in the coming weeks. In the meantime, sit back and listen to the story of \"Flying Home\" by the Benny Goodman Sextet!\n\n\n\n<strong>Resources</strong>\n\nAs always, I've put together a Mixcloud mix of all the songs talked about in this episode, which you can stream <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-podcast-supplemental-1-flying-home/\">here.&nbsp;</a>That mix has \"Rhapsody in Blue\" by the Paul Whiteman Orchestra, \"Memories of You\" by Louis Armstrong, \"Sing Sing Sing\" by Benny Goodman, \"Flying Home\" by Benny Goodman, and \"Flying Home\" by Lionel Hampton.\n\nFor all the episodes on pre-1954 music, one invaluable source is the book <a href=\"https://amzn.to/2OS4iaN\">\"Before Elvis\" by Larry Birnbaum</a>, which goes into these subjects in far more detail than I can.\n\n<a href=\"https://amzn.to/2DFs8p9\">Lionel Hampton's autobiography</a> is out of print, but you can find second hand copies very cheap.\n\n<a href=\"https://amzn.to/2xNFlqA\">This</a> is the MP3 compilation I mention of many different versions of \"Flying Home\", and it has the Benny Goodman Sextet version on it as you'd hope. However, it doesn't have the classic Lionel Hampton version -- you can find that on <a href=\"https://amzn.to/2DMX2fE\">the four-CD box set The Lionel Hampton Story</a>, which is definitely worth getting.\n\nThere are various issues of the Benny Goodman Carnegie Hall show -- <a href=\"https://amzn.to/2xKZRbv\">here's</a> a decent one.\n\n<strong>Transcript</strong>\n\nWe have to start somewhere, of course, and there's no demarcation line for what is and isn't rock and roll, so we're starting well before rock and roll itself, in 1939.\n\nWe're starting, in fact, with swing.\n\nSwing was a form of music that had its roots in 1920s jazz. It's hard to remember now, but when Dixieland jazz was first popularised, in the early 1920s, the reaction to it from \"polite society\" was essentially the same as to every other black musical form -- it was going to be the end of the world, it was evil \"jungle music\", it was causing our children to engage in acts of lewdness and intoxication, it was inciting violence... it was, in short, everything that was later said about rock and roll, about hip-hop, and... you get the idea. This might sound ridiculous to modern ears, as we don't normally think of the cornet, the trombone, and the banjo as the most lascivious of instruments, but back in the 1920s this kind of music was considered seriously arousing.\n\nAnd so, as with all of the moral panics around black music, some white people made the music more appetising for other white people, by taking the rough edges off, cleaning it up, and putting it into a suit. In this case, this was done by the aptly-named Paul Whiteman.\n\nWhiteman was a violin player and conductor, and he became known as \"the king of jazz\" for being the bandleader of an all-white band of musicians. Where most jazz bands consisted of eight to ten musicians, all improvising based on head arrangements and interacting with each other, Whiteman's band was thirty-five musicians, playing from pre-written charts. It was polite, clean, and massively popular.\n\nWhiteman's band wasn't bad, by any means -- at various times he had musicians like Bix Beiderbecke and Joe Venuti playing for him -- and as you can hear in this performance of \"Rhapsody in Blue\" they could play some quite exciting jazz. But they were playing something fundamentally different -- something tamer, more arranged, and with the individual players subsumed into the unit.\n\nWhiteman still called the music he made jazz, but when other people started playing with similarly big bands, the music became known as \"swing\". And so from Whiteman, we move to Goodman.\n\nBenny Goodman, the \"King of Swing\", was the leader of the most popular of the pre-war swing bands, as well as being an excellent clarinet player. His band hired arranger Fletcher Henderson (a black musician who led his own excellent band, and who had provided arrangements for Whiteman) to provide their arrangements, and managed to create music that had a lot of the excitement of less-formalised jazz. It was still highly arranged, but it allowed for soloists to show off slightly more than many of the other bands of the time.\n\nThis is partly because Goodman himself was a soloist. While Whiteman was a bandleader first and foremost -- someone whose talent was in organising a group of other people, a manager rather than a musician (though he was a perfectly serviceable player) -- Goodman was a serious player, someone who would later premiere pieces by Bartók; Poulenc, Aaron Copland and others, and who had, before becoming a band leader, been one of the most in-demand players on small group jazz sessions. Goodman's band was still a big band, but it allowed the soloists far more freedom than many of his competitors did -- and many of Goodman's band members became well known enough individually to go off and form their own big bands.\n\nAnd because Goodman's band had a lot of great soloists in, as well as the thirty-plus-person big band he ran, he also had a number of smaller groups which were made up of musicians from the big band. These would play sets during the same shows as the big band, allowing the best soloists to show off while also giving most of the band a rest. Their performances would be proper jazz, rather than swing -- they would be three, or four, or six musicians, improvising together the way the old Dixieland players had.\n\nAnd importantly, Goodman was one of the first band leaders to lead an integrated band during the segregation era. His small groups started with a trio of Goodman himself (white and Jewish) on clarinet, white drummer Gene Krupa, and black pianist Teddy Wilson.\n\nThis integration, like the recruitment of Fletcher Henderson for the arrangements, was the idea of John Hammond, Goodman's brother-in-law. Hammond was an immensely privileged and wealthy man -- his mother was a Vanderbilt, and his uncle on his father's side was the US Ambassador to Spain -- who had decided to use his immense wealth in the service of two goals. The first of those was racial integration, and the second of them was to promote what would now be called \"roots\" or Americana music -- pre-bop jazz, folk, blues, and gospel. Hammond is someone we'll be hearing a lot more of as this story continues, but at this point he was a DJ, music journalist, and record producer, who used his wealth to get records made and aired that otherwise wouldn't have been made.\n\nGoodman certainly believed in racial equality, by all accounts, but it was Hammond who introduced him to Fletcher Henderson, and Hammond who persuaded him to include black musicians in his band.\n\nGoodman wasn't the first white bandleader in America to hire black musicians -- there had been three in the 1920s -- but when he hired Teddy Wilson, no-one had led an integrated group for seven years, and Goodman was hiring him at a time when Goodman was arguably the most popular musician in the USA.\n\nAnd this was a far more radical thing than it seems in retrospect, because Goodman was pushing in two radically different directions -- on the one hand, he was one of the first people to push for mainstream acceptance of jazz music in the classical music world, which would suggest trying to be as conservative as possible, but on the other he was pushing for integration of musicians. Lionel Hampton later quoted him as saying \"we need both the black keys and the white keys to play music\", which is the sort of facile comparison well-meaning white liberals make now, in 2018, so Goodman saying it eighty years ago is a genuinely progressive statement for the times.\n\nLionel Hampton was another black musician, who joined the trio and turned it into a quartet, He was a virtuoso vibraphonist who more or less defined how that instrument was incorporated into jazz. He appears to have been the first person to use the vibraphone on a jazz record, on a recording by Louis Armstrong of the song \"Memories of You\" from 1930. Before that, the vibraphone had only ever been used as a novelty instrument -- it was mostly used for radio intermission signals, playing a couple of chimes.\n\nIn fact, the vibraphone was so new as an instrument that its name had never been settled -- \"vibraphone\" was just one of a number of trademarks used by different companies making the instrument. The instrument Hampton played was put out under another brand name -- Vibraharp -- and that was what he called it for the rest of his life.\n\nHampton had trained as a drummer before becoming a vibraphone player, and was often billed as \"the fastest drummer in the world\", but he had a unique melodic sensibility which allowed him to become the premiere soloist on this new instrument. Indeed, to this day Hampton is probably the most respected musician ever to play the vibes.\n\nBy 1938 Goodman actually reached the point where he was able to bring an integrated band, featuring Count Basie, Lester Young, Teddy Wilson, and Lionel Hampton, plus other black musicians along with white musicians such as Goodman and Krupa, on to the stage of Carnegie Hall, at the time the US' most prestigious music venue. Like many of Goodman's biggest moments, this was the work of Hammond, who after the success of Goodman's show put together a series of other concerts at Carnegie, the \"Spirituals to Swing\" concerts, which are some of the most important concerts ever in bringing black American music to a white audience. We'll almost certainly talk about those in the future.\n\nBut getting back to the Goodman show, that Carnegie Hall concert is still one of the greatest live jazz albums ever recorded, and shows that it was entirely possible to create truly exciting music using the swing band template. One particularly impressive performance was the twelve-minute long version of \"Sing Sing Sing\". Obviously we won't hear that in full here, but here's a brief excerpt of that staggering performance.\n\nYou can hear the full performance, along with all the other songs excerpted in this podcast, at the Mixcloud page linked in the blog post associated with this podcast).\n\nFor US cultural context, it would be another nine years before Jackie Robinson was able to break the colour bar in baseball, to give some idea of how extraordinary this actually was. In fact Lionel Hampton would often later claim that it was Goodman hiring him and Wilson (and, later, other black musicians) that paved the way for Robinson's more well-known achievement.\n\nThe original Benny Goodman Quartet were an extraordinary set of musicians, but by 1939 both Wilson and Krupa had departed for other bands. There would be reunions over the years, but the classic lineup of the quartet had stopped performing together.&nbsp; Various other pianists (notably Count Basie and Fletcher Henderson) sat in with the Goodman small groups, but he also realised the need to make up for the loss of two such exceptional musicians by incorporating more, and so the Benny Goodman Sextets were formed.\n\nThose sextets featured a rotating lineup of musicians, sometimes including the great jazz trumpeter Cootie Williams, but revolved around three soloists -- Goodman himself on clarinet, Hampton on vibraphone, and a new musician, the guitarist Charlie Christian -- a musician who would only have a very short career, but who would come to be better known than any of them.\n\nChristian is sometimes erroneously called the first electric guitarist, or the first person to play electric guitar on record, or even the inventor of the electric guitar. He was none of those things, but he was a pioneer in the instrument, and the first person to really bring it to prominence as a solo instrument. The electric guitar allowed a fundamentally different style of guitar playing -- before, the guitar had only really worked either as a solo instrument, as accompaniment for a single vocalist, or at best as a barely-audible rhythm instrument drowned out by the louder pianos and horns of jazz bands. Now the guitar could play single melody lines as loudly as any trumpet or saxophone, and could be used as a solo instrument in an ensemble in the same way as those instruments. This changed the whole approach to the guitar in popular music.\n\nWhile Goodman claimed responsibility for the head arrangements the small groups used, a lot of people think that Christian was responsible for these, too, and certainly the sextet's music has a much more exhilirating feel than the early quartet or trio work.\n\nThe first song the new Goodman Quintet recorded, on October 2 1939 -- exactly seventy-nine years ago on the date this podcast comes out, if its release goes to plan -- was a pieve called \"Flying Home\".\n\n\"Flying Home\" is a great example of the early work of the sextet, and quickly became in many ways their signature song. The story of its writing is that the band were on a plane from LA to Atlantic City -- the first time many of the band members had flown at all -- and Hampton started humming the riff to himself. Goodman asked \"what's that you're singing\", and Hampton said \"I don't know, we can call it 'Flying Home' I guess\".\n\nGoodman and Hampton were credited as the writers, although John Hammond later claimed that he'd heard Christian improvising the riff before it was picked up by the other two men.\n\nBefore we start looking at the record, I want to address one problem you find with out-of-copyright jazz recordings, and that's that if you're trying to get hold of, or talk about, the right version of a track. Many of the musicians involved recorded multiple versions of songs, those tracks get released on multiple compilations, and tracks get released under different names. For example I have one compilation album -- one which says it's just sixteen different versions of \"Flying Home\" -- which has the Benny Goodman Sextet recording of the track *and* a \"Charlie Christian\" recording. Except, of course, the Charlie Christian recording is exactly the same one as the Benny Goodman one, although on that compilation it's taken from a different source as there are different amounts of tape hiss...\n\nSo it may be that at some point here I identify a recording wrongly -- particularly one of the many, many, Lionel Hampton recordings of the song. I am not pretending to be authoritative here, and I may get things wrong, though I'm trying as best I can to get them right.\n\nBut what I do know is what the Benny Goodman Sextet version of this song sounded like, and we can hear that now.\n\nIt's hard to emphasise just how strange this record must have sounded then, nearly eighty years ago, when you consider that electronic amplification was a new thing, that only one electric guitar had ever been recorded before the Sextet sessions, and that the record contained two separate electronically amplified instruments -- Christian's guitar and Hampton's vibraphone.\n\nOther than the vibraphone and clarinet, though, this small group was almost the prototypical rock band -- piano, electric guitar, double bass and drums would be the hallmark instruments of the genre a full twenty years after this record -- and the record seems to anticipate many aspects of the rock genre in many details, especially when Charlie Christian starts his soloing -- his playing now sounds fairly tame, but at the time it was astonishingly advanced both in technique (he was a huge influence on bop, which wouldn't come along for many more years) and in just the sound of it -- no-one else was making music that was amplified in that way, with that timbre.\n\nThe song, in this version, starts with a simple stride piano intro played by Fletcher Henderson, with Artie Bernstein on the bass and Nick Fatool on the drums. This intro is basically just setting out the harmonic structure, of the verses before the introduction of the main riff. It does a common thing where you have the chords at the top end stay as close to being the same as they can while you have a descending bass -- and the bass includes a few notes that aren't in the same key that the melody is in when it comes in, setting up a little bit of harmonic tension.\n\nOnce it does come in, the riff sounds *really odd*. This is a vibraphone, a clarinet, and an electric guitar, all playing the same riff in unison. That's a sound that had never been recorded before\n\nWe then have a very straightforward swing-style clarinet solo by Goodman. I like Goodman's clarinet style a great deal -- he is, in fact, one of the musicians who shaped my sense of melodic structure -- but there's nothing particularly notable about this solo, which could be on any record from about 1925 through about 1945. After another run through of the riff, we get Charlie Christian's solo, which is where things get interesting.\n\nPunctuated by bursts from the clarinet and vibraphone, this longer solo (which includes a whole section that effectively acts as a middle eight for the song) is unlike pretty much anything ever played on guitar in the studio before. Christian's short bursts of single-note guitar line are, to all intents and purposes, rockabilly -- it's the same kind of guitar playing we'll hear from Scotty Moore sixteen years later. It doesn't sound like anything revolutionary now, but remember, up to this point the guitar had essentially only been a rhythm instrument in jazz, with a very small handful of exceptions like Django Reinhardt. You simply couldn't play single-note lead lines on the guitar and have it heard over saxes or trumpets until the advent of electification.\n\nAfter Christian's solo, we have one from Lionel Hampton. This solo is just a typical example of Hampton's playing -- he was a stunning jazz vibraphone player, and at the time was on top of his game -- but it's not as astonishing as the one from Christian.\n\nAnd then at the end, we get a whole new riff coming in. This kind of riff had been common in Goodman's work before -- you can hear something similar in his hit version of \"King Porter Stomp\", for example -- but it would become the hallmark of the jump band style a few years later. This call and response, repetitive riffing, would be the sound that would dominate dance music in the next decades.\n\nThe song would go on to have a long life after this recording. A couple of years later, Lionel Hampton left Goodman's band to form his own big band, and \"Flyin' Home\" became their signature song. That band would be one of the first bands to perform a new type of music -- \"jump band\" music -- which was rooted in swing but had more emphasis on riffs and amplified instruments. That jump band music is the same music that later became known as rhythm and blues, and musicians such as Louis Jordan were clearly inspired by Hampton's band. We'll be looking in future episodes of this podcast at the way in which jump bands became one of the biggest influences on rock and roll.\n\nHampton recorded the song multiple times, starting in 1940, but the most famous example is the version he recorded in 1942 for Decca (with \"instrumental foxtrot\" on the label. That version features Ilinois Jacquet on saxophone, and like the Benny Goodman version, it would introduce a whole new sound to people.\n\nThis time, it's Jacquet's tenor sax playing, which has a honk and skronk to it that was unlike anything people had heard before. There are predecessors to it of course -- as I said earlier, there's no \"earliest example\" of anything in music -- but this saxophone solo became the one that defined a whole new genre, a genre called rhythm and blues. Jacquet's solo was so exceptional that when he left the band, every tenor sax player who replaced him would copy his solo note-for-note rather than improvising their own versions as would usually be the case.\n\nThere's another person involved in that recording of \"Flying Home\" who probably needs mentioning here -- Milt Gabler, the producer. Like John Hammond, he's someone we'll be hearing a lot more about in future episodes.\n\nHampton himself remained a respected and popular musician for many more decades. In the late 1940s and early 1950s, the big bands lost a lot of their popularity, and Hampton started playing yet another style of music -- he became one of the greats of bebop music, and played in small groups much like the Goodman ones, just playing more harmonically and melodically complex variations of what he had played earlier. But he was also recognised by the rock musicians as a pioneer -- you can see him in the 1957 Alan Freed film \"Mr. Rock and Roll\", playing his vibraphone as the only jazz musician in a film which otherwise features Little Richard, Clyde McPhatter, and other rock and R&B stars of the time.\n\nCharlie Christian, on the other hand, never even lived to see the influence he had. Even though he was one of the most influential musicians on both jazz and rock music -- Chuck Berry later said that Christian was one of the biggest influences on his guitar playing (though he wrongly said that Christian played with Tommy Dorsey's band, a rival to Goodman's) while Christian was responsible for the name \"bebop\" being given to the form of music he helped create in jam sessions after his regular work -- he was already suffering from tuberculosis in 1939, when \"Flying Home\" was recorded. And on March the second, 1941, aged only twenty-five, Charlie Christian died. He was buried in an unmarked grave, which was later concreted over. A memorial was placed for him fifty-three years later, but it was later discovered to be in the wrong place.\n\n<strong>Patreon</strong>\nAs always, this podcast only exists because of the donations of my backers on Patreon. If you enjoy it, <a href=\"http://patreon.com/andrewhickey\">why not join them?</a>",
  "itunes:subtitle": "Welcome to the first episode proper of&nbsp;A History of Rock Music in 500 Songs! As this is the first real episode, you may notice a couple of flaws in the production -- those will hopefully get ironed out in the coming weeks. In the meantime, sit back ",
  "itunes:keywords": "Benny Goodman,Carnegie Hall,Charlie Christian,Illinois Jacquet,John Hammond,Lionel Hampton,Paul Whiteman",
  "itunes:episodeType": "full",
  "itunes:episode": 1,
  "content:encoded": "Welcome to the first episode proper of&nbsp;<em>A History of Rock Music in 500 Songs</em>! As this is the first real episode, you may notice a couple of flaws in the production -- those will hopefully get ironed out in the coming weeks. In the meantime, sit back and listen to the story of \"Flying Home\" by the Benny Goodman Sextet!\n\n\n\n<strong>Resources</strong>\n\nAs always, I've put together a Mixcloud mix of all the songs talked about in this episode, which you can stream <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-podcast-supplemental-1-flying-home/\">here.&nbsp;</a>That mix has \"Rhapsody in Blue\" by the Paul Whiteman Orchestra, \"Memories of You\" by Louis Armstrong, \"Sing Sing Sing\" by Benny Goodman, \"Flying Home\" by Benny Goodman, and \"Flying Home\" by Lionel Hampton.\n\nFor all the episodes on pre-1954 music, one invaluable source is the book <a href=\"https://amzn.to/2OS4iaN\">\"Before Elvis\" by Larry Birnbaum</a>, which goes into these subjects in far more detail than I can.\n\n<a href=\"https://amzn.to/2DFs8p9\">Lionel Hampton's autobiography</a> is out of print, but you can find second hand copies very cheap.\n\n<a href=\"https://amzn.to/2xNFlqA\">This</a> is the MP3 compilation I mention of many different versions of \"Flying Home\", and it has the Benny Goodman Sextet version on it as you'd hope. However, it doesn't have the classic Lionel Hampton version -- you can find that on <a href=\"https://amzn.to/2DMX2fE\">the four-CD box set The Lionel Hampton Story</a>, which is definitely worth getting.\n\nThere are various issues of the Benny Goodman Carnegie Hall show -- <a href=\"https://amzn.to/2xKZRbv\">here's</a> a decent one.\n\n<strong>Transcript</strong>\n\nWe have to start somewhere, of course, and there's no demarcation line for what is and isn't rock and roll, so we're starting well before rock and roll itself, in 1939.\n\nWe're starting, in fact, with swing.\n\nSwing was a form of music that had its roots in 1920s jazz. It's hard to remember now, but when Dixieland jazz was first popularised, in the early 1920s, the reaction to it from \"polite society\" was essentially the same as to every other black musical form -- it was going to be the end of the world, it was evil \"jungle music\", it was causing our children to engage in acts of lewdness and intoxication, it was inciting violence... it was, in short, everything that was later said about rock and roll, about hip-hop, and... you get the idea. This might sound ridiculous to modern ears, as we don't normally think of the cornet, the trombone, and the banjo as the most lascivious of instruments, but back in the 1920s this kind of music was considered seriously arousing.\n\nAnd so, as with all of the moral panics around black music, some white people made the music more appetising for other white people, by taking the rough edges off, cleaning it up, and putting it into a suit. In this case, this was done by the aptly-named Paul Whiteman.\n\nWhiteman was a violin player and conductor, and he became known as \"the king of jazz\" for being the bandleader of an all-white band of musicians. Where most jazz bands consisted of eight to ten musicians, all improvising based on head arrangements and interacting with each other, Whiteman's band was thirty-five musicians, playing from pre-written charts. It was polite, clean, and massively popular.\n\nWhiteman's band wasn't bad, by any means -- at various times he had musicians like Bix Beiderbecke and Joe Venuti playing for him -- and as you can hear in this performance of \"Rhapsody in Blue\" they could play some quite exciting jazz. But they were playing something fundamentally different -- something tamer, more arranged, and with the individual players subsumed into the unit.\n\nWhiteman still called the music he made jazz, but when other people started playing with similarly big bands, the music became known as \"swing\". And so from Whiteman, we move to Goodman.\n\nBenny Goodman, the \"King of Swing\", was the leader of the most popular of the pre-war swing bands, as well as being an excellent clarinet player. His band hired arranger Fletcher Henderson (a black musician who led his own excellent band, and who had provided arrangements for Whiteman) to provide their arrangements, and managed to create music that had a lot of the excitement of less-formalised jazz. It was still highly arranged, but it allowed for soloists to show off slightly more than many of the other bands of the time.\n\nThis is partly because Goodman himself was a soloist. While Whiteman was a bandleader first and foremost -- someone whose talent was in organising a group of other people, a manager rather than a musician (though he was a perfectly serviceable player) -- Goodman was a serious player, someone who would later premiere pieces by Bartók; Poulenc, Aaron Copland and others, and who had, before becoming a band leader, been one of the most in-demand players on small group jazz sessions. Goodman's band was still a big band, but it allowed the soloists far more freedom than many of his competitors did -- and many of Goodman's band members became well known enough individually to go off and form their own big bands.\n\nAnd because Goodman's band had a lot of great soloists in, as well as the thirty-plus-person big band he ran, he also had a number of smaller groups which were made up of musicians from the big band. These would play sets during the same shows as the big band, allowing the best soloists to show off while also giving most of the band a rest. Their performances would be proper jazz, rather than swing -- they would be three, or four, or six musicians, improvising together the way the old Dixieland players had.\n\nAnd importantly, Goodman was one of the first band leaders to lead an integrated band during the segregation era. His small groups started with a trio of Goodman himself (white and Jewish) on clarinet, white drummer Gene Krupa, and black pianist Teddy Wilson.\n\nThis integration, like the recruitment of Fletcher Henderson for the arrangements, was the idea of John Hammond, Goodman's brother-in-law. Hammond was an immensely privileged and wealthy man -- his mother was a Vanderbilt, and his uncle on his father's side was the US Ambassador to Spain -- who had decided to use his immense wealth in the service of two goals. The first of those was racial integration, and the second of them was to promote what would now be called \"roots\" or Americana music -- pre-bop jazz, folk, blues, and gospel. Hammond is someone we'll be hearing a lot more of as this story continues, but at this point he was a DJ, music journalist, and record producer, who used his wealth to get records made and aired that otherwise wouldn't have been made.\n\nGoodman certainly believed in racial equality, by all accounts, but it was Hammond who introduced him to Fletcher Henderson, and Hammond who persuaded him to include black musicians in his band.\n\nGoodman wasn't the first white bandleader in America to hire black musicians -- there had been three in the 1920s -- but when he hired Teddy Wilson, no-one had led an integrated group for seven years, and Goodman was hiring him at a time when Goodman was arguably the most popular musician in the USA.\n\nAnd this was a far more radical thing than it seems in retrospect, because Goodman was pushing in two radically different directions -- on the one hand, he was one of the first people to push for mainstream acceptance of jazz music in the classical music world, which would suggest trying to be as conservative as possible, but on the other he was pushing for integration of musicians. Lionel Hampton later quoted him as saying \"we need both the black keys and the white keys to play music\", which is the sort of facile comparison well-meaning white liberals make now, in 2018, so Goodman saying it eighty years ago is a genuinely progressive statement for the times.\n\nLionel Hampton was another black musician, who joined the trio and turned it into a quartet, He was a virtuoso vibraphonist who more or less defined how that instrument was incorporated into jazz. He appears to have been the first person to use the vibraphone on a jazz record, on a recording by Louis Armstrong of the song \"Memories of You\" from 1930. Before that, the vibraphone had only ever been used as a novelty instrument -- it was mostly used for radio intermission signals, playing a couple of chimes.\n\nIn fact, the vibraphone was so new as an instrument that its name had never been settled -- \"vibraphone\" was just one of a number of trademarks used by different companies making the instrument. The instrument Hampton played was put out under another brand name -- Vibraharp -- and that was what he called it for the rest of his life.\n\nHampton had trained as a drummer before becoming a vibraphone player, and was often billed as \"the fastest drummer in the world\", but he had a unique melodic sensibility which allowed him to become the premiere soloist on this new instrument. Indeed, to this day Hampton is probably the most respected musician ever to play the vibes.\n\nBy 1938 Goodman actually reached the point where he was able to bring an integrated band, featuring Count Basie, Lester Young, Teddy Wilson, and Lionel Hampton, plus other black musicians along with white musicians such as Goodman and Krupa, on to the stage of Carnegie Hall, at the time the US' most prestigious music venue. Like many of Goodman's biggest moments, this was the work of Hammond, who after the success of Goodman's show put together a series of other concerts at Carnegie, the \"Spirituals to Swing\" concerts, which are some of the most important concerts ever in bringing black American music to a white audience. We'll almost certainly talk about those in the future.\n\nBut getting back to the Goodman show, that Carnegie Hall concert is still one of the greatest live jazz albums ever recorded, and shows that it was entirely possible to create truly exciting music using the swing band template. One particularly impressive performance was the twelve-minute long version of \"Sing Sing Sing\". Obviously we won't hear that in full here, but here's a brief excerpt of that staggering performance.\n\nYou can hear the full performance, along with all the other songs excerpted in this podcast, at the Mixcloud page linked in the blog post associated with this podcast).\n\nFor US cultural context, it would be another nine years before Jackie Robinson was able to break the colour bar in baseball, to give some idea of how extraordinary this actually was. In fact Lionel Hampton would often later claim that it was Goodman hiring him and Wilson (and, later, other black musicians) that paved the way for Robinson's more well-known achievement.\n\nThe original Benny Goodman Quartet were an extraordinary set of musicians, but by 1939 both Wilson and Krupa had departed for other bands. There would be reunions over the years, but the classic lineup of the quartet had stopped performing together.&nbsp; Various other pianists (notably Count Basie and Fletcher Henderson) sat in with the Goodman small groups, but he also realised the need to make up for the loss of two such exceptional musicians by incorporating more, and so the Benny Goodman Sextets were formed.\n\nThose sextets featured a rotating lineup of musicians, sometimes including the great jazz trumpeter Cootie Williams, but revolved around three soloists -- Goodman himself on clarinet, Hampton on vibraphone, and a new musician, the guitarist Charlie Christian -- a musician who would only have a very short career, but who would come to be better known than any of them.\n\nChristian is sometimes erroneously called the first electric guitarist, or the first person to play electric guitar on record, or even the inventor of the electric guitar. He was none of those things, but he was a pioneer in the instrument, and the first person to really bring it to prominence as a solo instrument. The electric guitar allowed a fundamentally different style of guitar playing -- before, the guitar had only really worked either as a solo instrument, as accompaniment for a single vocalist, or at best as a barely-audible rhythm instrument drowned out by the louder pianos and horns of jazz bands. Now the guitar could play single melody lines as loudly as any trumpet or saxophone, and could be used as a solo instrument in an ensemble in the same way as those instruments. This changed the whole approach to the guitar in popular music.\n\nWhile Goodman claimed responsibility for the head arrangements the small groups used, a lot of people think that Christian was responsible for these, too, and certainly the sextet's music has a much more exhilirating feel than the early quartet or trio work.\n\nThe first song the new Goodman Quintet recorded, on October 2 1939 -- exactly seventy-nine years ago on the date this podcast comes out, if its release goes to plan -- was a pieve called \"Flying Home\".\n\n\"Flying Home\" is a great example of the early work of the sextet, and quickly became in many ways their signature song. The story of its writing is that the band were on a plane from LA to Atlantic City -- the first time many of the band members had flown at all -- and Hampton started humming the riff to himself. Goodman asked \"what's that you're singing\", and Hampton said \"I don't know, we can call it 'Flying Home' I guess\".\n\nGoodman and Hampton were credited as the writers, although John Hammond later claimed that he'd heard Christian improvising the riff before it was picked up by the other two men.\n\nBefore we start looking at the record, I want to address one problem you find with out-of-copyright jazz recordings, and that's that if you're trying to get hold of, or talk about, the right version of a track. Many of the musicians involved recorded multiple versions of songs, those tracks get released on multiple compilations, and tracks get released under different names. For example I have one compilation album -- one which says it's just sixteen different versions of \"Flying Home\" -- which has the Benny Goodman Sextet recording of the track *and* a \"Charlie Christian\" recording. Except, of course, the Charlie Christian recording is exactly the same one as the Benny Goodman one, although on that compilation it's taken from a different source as there are different amounts of tape hiss...\n\nSo it may be that at some point here I identify a recording wrongly -- particularly one of the many, many, Lionel Hampton recordings of the song. I am not pretending to be authoritative here, and I may get things wrong, though I'm trying as best I can to get them right.\n\nBut what I do know is what the Benny Goodman Sextet version of this song sounded like, and we can hear that now.\n\nIt's hard to emphasise just how strange this record must have sounded then, nearly eighty years ago, when you consider that electronic amplification was a new thing, that only one electric guitar had ever been recorded before the Sextet sessions, and that the record contained two separate electronically amplified instruments -- Christian's guitar and Hampton's vibraphone.\n\nOther than the vibraphone and clarinet, though, this small group was almost the prototypical rock band -- piano, electric guitar, double bass and drums would be the hallmark instruments of the genre a full twenty years after this record -- and the record seems to anticipate many aspects of the rock genre in many details, especially when Charlie Christian starts his soloing -- his playing now sounds fairly tame, but at the time it was astonishingly advanced both in technique (he was a huge influence on bop, which wouldn't come along for many more years) and in just the sound of it -- no-one else was making music that was amplified in that way, with that timbre.\n\nThe song, in this version, starts with a simple stride piano intro played by Fletcher Henderson, with Artie Bernstein on the bass and Nick Fatool on the drums. This intro is basically just setting out the harmonic structure, of the verses before the introduction of the main riff. It does a common thing where you have the chords at the top end stay as close to being the same as they can while you have a descending bass -- and the bass includes a few notes that aren't in the same key that the melody is in when it comes in, setting up a little bit of harmonic tension.\n\nOnce it does come in, the riff sounds *really odd*. This is a vibraphone, a clarinet, and an electric guitar, all playing the same riff in unison. That's a sound that had never been recorded before\n\nWe then have a very straightforward swing-style clarinet solo by Goodman. I like Goodman's clarinet style a great deal -- he is, in fact, one of the musicians who shaped my sense of melodic structure -- but there's nothing particularly notable about this solo, which could be on any record from about 1925 through about 1945. After another run through of the riff, we get Charlie Christian's solo, which is where things get interesting.\n\nPunctuated by bursts from the clarinet and vibraphone, this longer solo (which includes a whole section that effectively acts as a middle eight for the song) is unlike pretty much anything ever played on guitar in the studio before. Christian's short bursts of single-note guitar line are, to all intents and purposes, rockabilly -- it's the same kind of guitar playing we'll hear from Scotty Moore sixteen years later. It doesn't sound like anything revolutionary now, but remember, up to this point the guitar had essentially only been a rhythm instrument in jazz, with a very small handful of exceptions like Django Reinhardt. You simply couldn't play single-note lead lines on the guitar and have it heard over saxes or trumpets until the advent of electification.\n\nAfter Christian's solo, we have one from Lionel Hampton. This solo is just a typical example of Hampton's playing -- he was a stunning jazz vibraphone player, and at the time was on top of his game -- but it's not as astonishing as the one from Christian.\n\nAnd then at the end, we get a whole new riff coming in. This kind of riff had been common in Goodman's work before -- you can hear something similar in his hit version of \"King Porter Stomp\", for example -- but it would become the hallmark of the jump band style a few years later. This call and response, repetitive riffing, would be the sound that would dominate dance music in the next decades.\n\nThe song would go on to have a long life after this recording. A couple of years later, Lionel Hampton left Goodman's band to form his own big band, and \"Flyin' Home\" became their signature song. That band would be one of the first bands to perform a new type of music -- \"jump band\" music -- which was rooted in swing but had more emphasis on riffs and amplified instruments. That jump band music is the same music that later became known as rhythm and blues, and musicians such as Louis Jordan were clearly inspired by Hampton's band. We'll be looking in future episodes of this podcast at the way in which jump bands became one of the biggest influences on rock and roll.\n\nHampton recorded the song multiple times, starting in 1940, but the most famous example is the version he recorded in 1942 for Decca (with \"instrumental foxtrot\" on the label. That version features Ilinois Jacquet on saxophone, and like the Benny Goodman version, it would introduce a whole new sound to people.\n\nThis time, it's Jacquet's tenor sax playing, which has a honk and skronk to it that was unlike anything people had heard before. There are predecessors to it of course -- as I said earlier, there's no \"earliest example\" of anything in music -- but this saxophone solo became the one that defined a whole new genre, a genre called rhythm and blues. Jacquet's solo was so exceptional that when he left the band, every tenor sax player who replaced him would copy his solo note-for-note rather than improvising their own versions as would usually be the case.\n\nThere's another person involved in that recording of \"Flying Home\" who probably needs mentioning here -- Milt Gabler, the producer. Like John Hammond, he's someone we'll be hearing a lot more about in future episodes.\n\nHampton himself remained a respected and popular musician for many more decades. In the late 1940s and early 1950s, the big bands lost a lot of their popularity, and Hampton started playing yet another style of music -- he became one of the greats of bebop music, and played in small groups much like the Goodman ones, just playing more harmonically and melodically complex variations of what he had played earlier. But he was also recognised by the rock musicians as a pioneer -- you can see him in the 1957 Alan Freed film \"Mr. Rock and Roll\", playing his vibraphone as the only jazz musician in a film which otherwise features Little Richard, Clyde McPhatter, and other rock and R&B stars of the time.\n\nCharlie Christian, on the other hand, never even lived to see the influence he had. Even though he was one of the most influential musicians on both jazz and rock music -- Chuck Berry later said that Christian was one of the biggest influences on his guitar playing (though he wrongly said that Christian played with Tommy Dorsey's band, a rival to Goodman's) while Christian was responsible for the name \"bebop\" being given to the form of music he helped create in jam sessions after his regular work -- he was already suffering from tuberculosis in 1939, when \"Flying Home\" was recorded. And on March the second, 1941, aged only twenty-five, Charlie Christian died. He was buried in an unmarked grave, which was later concreted over. A memorial was placed for him fifty-three years later, but it was later discovered to be in the wrong place.\n\n<strong>Patreon</strong>\nAs always, this podcast only exists because of the donations of my backers on Patreon. If you enjoy it, <a href=\"http://patreon.com/andrewhickey\">why not join them?</a>",
  "enclosure": "",
  "itunes:summary": "Welcome to the first episode proper of&nbsp;A History of Rock Music in 500 Songs! As this is the first real episode, you may notice a couple of flaws in the production -- those will hopefully get ironed out in the coming weeks. In the meantime, sit back and listen to the story of \"Flying Home\" by the Benny Goodman Sextet!\n\n\n\nResources\n\nAs always, I've put together a Mixcloud mix of all the songs talked about in this episode, which you can stream here.&nbsp;That mix has \"Rhapsody in Blue\" by the Paul Whiteman Orchestra, \"Memories of You\" by Louis Armstrong, \"Sing Sing Sing\" by Benny Goodman, \"Flying Home\" by Benny Goodman, and \"Flying Home\" by Lionel Hampton.\n\nFor all the episodes on pre-1954 music, one invaluable source is the book \"Before Elvis\" by Larry Birnbaum, which goes into these subjects in far more detail than I can.\n\nLionel Hampton's autobiography is out of print, but you can find second hand copies very cheap.\n\nThis is the MP3 compilation I mention of many different versions of \"Flying Home\", and it has the Benny Goodman Sextet version on it as you'd hope. However, it doesn't have the classic Lionel Hampton version -- you can find that on the four-CD box set The Lionel Hampton Story, which is definitely worth getting.\n\nThere are various issues of the Benny Goodman Carnegie Hall show -- here's a decent one.\n\nTranscript\n\nWe have to start somewhere, of course, and there's no demarcation line for what is and isn't rock and roll, so we're starting well before rock and roll itself, in 1939.\n\nWe're starting, in fact, with swing.\n\nSwing was a form of music that had its roots in 1920s jazz. It's hard to remember now, but when Dixieland jazz was first popularised, in the early 1920s, the reaction to it from \"polite society\" was essentially the same as to every other black musical form -- it was going to be the end of the world, it was evil \"jungle music\", it was causing our children to engage in acts of lewdness and intoxication, it was inciting violence... it was, in short, everything that was later said about rock and roll, about hip-hop, and... you get the idea. This might sound ridiculous to modern ears, as we don't normally think of the cornet, the trombone, and the banjo as the most lascivious of instruments, but back in the 1920s this kind of music was considered seriously arousing.\n\nAnd so, as with all of the moral panics around black music, some white people made the music more appetising for other white people, by taking the rough edges off, cleaning it up, and putting it into a suit. In this case, this was done by the aptly-named Paul Whiteman.\n\nWhiteman was a violin player and conductor, and he became known as \"the king of jazz\" for being the bandleader of an all-white band of musicians. Where most jazz bands consisted of eight to ten musicians, all improvising based on head arrangements and interacting with each other, Whiteman's band was thirty-five musicians, playing from pre-written charts. It was polite, clean, and massively popular.\n\nWhiteman's band wasn't bad, by any means -- at various times he had musicians like Bix Beiderbecke and Joe Venuti playing for him -- and as you can hear in this performance of \"Rhapsody in Blue\" they could play some quite exciting jazz. But they were playing something fundamentally different -- something tamer, more arranged, and with the individual players subsumed into the unit.\n\nWhiteman still called the music he made jazz, but when other people started playing with similarly big bands, the music became known as \"swing\". And so from Whiteman, we move to Goodman.\n\nBenny Goodman, the \"King of Swing\", was the leader of the most popular of the pre-war swing bands, as well as being an excellent clarinet player. His band hired arranger Fletcher Henderson (a black musician who led his own excellent band, and who had provided arrangements for Whiteman) to provide their arrangements, and managed to create music that had a lot of the excitement of less-formalised jazz. It was still hi",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to the first episode proper of&nbsp;A History of Rock Music in 500 Songs! As this is the first real episode, you may notice a couple of flaws in the production -- those will hopefully get ironed out in the coming weeks. In the meantime, sit back and listen to the story of \"Flying Home\" by the Benny Goodman Sextet!\n\n\n\nResources\n\nAs always, I've put together a Mixcloud mix of all the songs talked about in this episode, which you can stream here.&nbsp;That mix has \"Rhapsody in Blue\" by the Paul Whiteman Orchestra, \"Memories of You\" by Louis Armstrong, \"Sing Sing Sing\" by Benny Goodman, \"Flying Home\" by Benny Goodman, and \"Flying Home\" by Lionel Hampton.\n\nFor all the episodes on pre-1954 music, one invaluable source is the book \"Before Elvis\" by Larry Birnbaum, which goes into these subjects in far more detail than I can.\n\nLionel Hampton's autobiography is out of print, but you can find second hand copies very cheap.\n\nThis is the MP3 compilation I mention of many different version",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}