{
  "id": "https://bibleinoneyear.org/en/youth/58",
  "title": "Day 58: Six Characteristics of a Holy Life",
  "description": "Psalm 27:1,4,5, Leviticus 1:1-4, Mark 9:35–50, 10:2,5–9.  You are holy to the extent that your life is devoted to him and your actions reflect his character  Holiness and *wholeness* are closely related, and God wants the *whole* of your life",
  "pubDate": "Sun, 27 Feb 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/58/",
  "itunes:duration": "12:51",
  "guid": "enyouth27022022-58",
  "length": 771.37,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 58: Six Characteristics of a Holy Life",
  "itunes:subtitle": "Psalm 27:1,4,5, Leviticus 1:1-4, Mark 9:35–50, 10:2,5–9.  You are holy to the extent that your life is devoted to him and your actions reflect his character  Holiness and *wholeness* are closely related, and God wants the *whole* of your life",
  "itunes:summary": "Do you try to fit Jesus into your schedule? Or do you work your schedule around Jesus?\n‘God cannot fit into our plans, we must fit into his,’ writes Eugene Peterson. ‘We can’t use God – God is not a tool or appliance or credit card. Holy is the word that sets God apart and above our attempts to enlist him in our wish-fulfilment fantasies or our utopian schemes for making our mark in the world. Holy means that God is alive on God’s terms, alive in a way that exceeds our experience and imagination. Holy refers to life burning with an intense purity that transforms everything it touches into itself.’\nThe Hebrew word ‘holy’ (qadosh) probably originally meant ‘separate’ or ‘set apart’. It came to be used to describe the ‘otherness’ of God, and how his character and nature are so much greater and more wonderful than any other person or thing. For something else to be ‘holy’ simply means for it to be dedicated to God. You are holy to the extent that your life is devoted to him and your actions reflect his character. Holiness and wholeness are closely related, and God wants the whole of your life.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 423
}