{
  "id": "yt:video:sjmqTHo0kTw",
  "yt:videoId": "sjmqTHo0kTw",
  "yt:channelId": "UC3WoPalcYf7d_x4DC2BXAfw",
  "title": "Scorn is the most disgusting game I've ever played",
  "link": "",
  "author": {
    "name": "jayvee",
    "uri": "https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw"
  },
  "published": "2022-10-15T17:10:31+00:00",
  "updated": "2022-10-17T19:11:33+00:00",
  "media:group": {
    "media:title": "Scorn is the most disgusting game I've ever played",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "if games smelled this game definitely smells bad\n\nSubscribe to jayveeonYT for more videos!\n► ​https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw?sub_confirmation=1\n\nWatch more videos on jayveeonYT! \n► https://youtube.com/playlist?list=PLGdQpBjWmxqVuXKKNVcccm81dpDwsJPvH\n\n- - - - - - - - - - - - - - - -\n\nFollow jayveeonYT!\n► Twitter: https://twitter.com/jayveeonYT​\n► Discord: https://discord.gg/jayveeonyt\n► Instagram: https://www.instagram.com/jayvee.yt/​\n\nWatch More jayveeonYT!\nLatest Uploads:  \n\nSo I ranked ALL the AC games...\n► https://youtu.be/Z9_Tb_TcPYI\n\nSo I played AC Rogue in 2021...\n► https://youtu.be/LUmOm2whuvY\n\nSo I played AC Syndicate in 2021...\n► https://youtu.be/swJN5NO2gJ8\n\nSo I played AC Unity in 2021...\n► https://youtu.be/UjTt4KtAZO8\n\nSo I played AC Odyssey in 2021…\n► https://youtu.be/guMObmtv54s\n\n- - - - - - - - - - - - - - - -\n\nAbout jayveeonYT:\nNews, reactions, and gameplay of all the biggest RPGs, open world, and action-adventure video games! Jayvee covers Assassin's Creed, Cyberpunk, Fallout, and more!\n\n- - - - - - - - - - - - - - - -\n\nScorn is an upcoming first-person biopunk survival horror adventure video game developed by Serbian developer Ebb Software for Microsoft Windows and Xbox Series X/S. The game is inspired by the works of visual artists H. R. Giger and Zdzisław Beksiński.\n\nThe player controls a humanoid lost on a nightmarish alien planet filled with odd creatures and living techno-organic structures composed of machines, flesh, and bone. The player will explore different interconnected regions in a non-linear fashion, searching for answers that will explain more about the game's world.\n\nThe game presents various biomechanical weapons that all attach to a modular base implanted on the character's body. To utilize a specific weapon, the player must remove the current weapon from the base and replace it with another. Two primary weapons have been showcased: a pistol and a three-barrel shotgun that fires organic spikes. The player starts with the pistol: a 6-shot weapon dealing mild damage to the in-game enemies. It appears to be completely organic, beginning with the mouth-like base for the weapon, which can be opened to let the pistol itself be removed and exchanged for the shotgun. The shotgun is a 3-shot weapon that deals considerable damage to enemies close-up, but the damage drops at long distances. The shotgun is composed of the same organic materials as the pistol. Later trailers have revealed other weapons such as a close-range pistol that also activates gates and an imploding grenade launcher.\n\n#gaming #jayvee #scorn",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}