{
  "title": "Inside the Universe Machine: The Webb Space Telescope’s Chilly Sun Shield",
  "link": "https://spectrum.ieee.org/james-webb-telescope-sunshield",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/rendering-of-james-webb-space-telescope-including-its-18-segmented-primary-mirrors-and-its-five-layered-sun-shade.png?id=30064121&width=1500&height=2000&coordinates=1209%2C0%2C1209%2C0\"/><br/><br/><p class=\"ieee-editors-note\">\n<em>For a deep dive into the engineering behind the James Webb Space Telescope, <a href=\"https://spectrum.ieee.org/collections/james-webb-telescope/\" rel=\"noopener noreferrer\" target=\"_blank\">see our collection of posts here</a>.</em>\n</p><p>\n<strong>When Apollo astronauts</strong> sent back the <a href=\"https://en.wikipedia.org/wiki/Timeline_of_first_images_of_Earth_from_space\" target=\"_blank\">first pictures of Earth as a disk in space</a>, the poet <a href=\"https://archive.nytimes.com/www.nytimes.com/library/national/science/nasa/122568sci-nasa-macleish.html\" rel=\"noopener noreferrer\" target=\"_blank\">Archibald MacLeish</a> wrote of it as “that bright loveliness in the eternal cold.” He was not far off. Deep space has a <a href=\"https://lambda.gsfc.nasa.gov/product/cobe/\" rel=\"noopener noreferrer\" target=\"_blank\">temperature</a> of 2.7 <a rel=\"noopener noreferrer\" target=\"_blank\">kelvins</a>—just 2.7 degrees above absolute zero.\n</p><p>\n\tIf the <a href=\"https://spectrum.ieee.org/at-last-first-light-for-the-james-webb-space-telescope\" target=\"_self\">James Webb Space Telescope</a> is to work—looking so far out and therefore so far back in time that it can see the first galaxies forming after the big bang—it will have to image objects so faint that they barely stand out from the cold around them. The world will begin finding out how well the observatory works <a href=\"https://www.nasa.gov/feature/goddard/2022/first-images-from-nasa-s-webb-space-telescope-coming-soon\" target=\"_blank\">as soon as next week</a>, when JWST is expected to release its first trove of scientific images and spectroscopic data.\n</p><p>\n\tSo, for argument’s sake, let’s assume <a href=\"https://www.nasa.gov/feature/join-the-virtual-global-social-for-the-reveal-of-the-james-webb-space-telescopes-first\" target=\"_blank\">all indications so far</a> do in fact point to a successful kickoff of the (hopefully long and storied) scientific data-gathering phase of Webb’s mission. How then did the engineers and designers of this massive telescope ever make it possible to cool the telescope down enough—all at a remove of nearly four times the distance from Earth to the moon—to possibly do its job?\n</p><p>\n\tAfter more than 25 years’ work and technological hurdles beyond counting, the Webb team has launched and stationed its mammoth observatory in solar orbit—and brought its instruments below 40 kelvins (-233 °C), cold enough to see the early universe more than 13.5 billion years ago. Remarkably, most of the cooling has been done passively, by shielding the telescope from the sun and letting physics take care of the rest.\n</p><p>\n\t“Webb is not just the product of a group of people. It’s not the product of some smart astronomers—Webb is truly the product of our entire world’s capability,” says <a href=\"https://jwst.nasa.gov/content/meetTheTeam/people/parrish.html\" rel=\"noopener noreferrer\" target=\"_blank\">Keith Parrish</a>, a leader on the Webb team at NASA’s <a href=\"https://www.nasa.gov/mission_pages/webb/main/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">Goddard Space Flight Center</a> in Maryland. “Taken as a whole, Webb is truly the result of our entire know-how of how to build complex machines.”\n</p><p>\n\tParrish joined the project in 1997, ultimately becoming its commissioning manager through the years of design, assembly, testing, delay and, finally, launch on 25 December 2021. He says almost everything about it—its shape and location, the materials from which it’s made—was dictated by the need to have an observatory that would survive for years at supercold temperatures.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Photo of clean room with five giant foil-like sheets stacked atop one another, with three scientists in the distance, inspecting the sunshield\" class=\"rm-shortcode\" data-rm-shortcode-id=\"d704905c49210fdedaaff684f8117968\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"1816e\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/photo-of-clean-room-with-five-giant-foil-like-sheets-stacked-atop-one-another-with-three-scientists-in-the-distance-inspecting.jpg?id=30064158&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">In this photo, the five-layered JWST sunshield is being unfurled and inspected in a clean room. The layers of coated Kapton E never touch, minimizing the transmission of heat from one layer to the next. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Alex Evers/Northrop Grumman</small>\n</p><p>\n\tThe Webb is an infrared observatory for many reasons, not the least of which is that as the universe expands, the wavelength of light from distant objects is lengthened, causing dramatic redshift. Infrared is also good for seeing through cosmic dust and gas, and for imaging cold things such as comets, Kuiper Belt objects, and perhaps planets orbiting other stars.\n</p><p>\n\tBut infrared radiation is often best measured as heat, which is why it’s important for the Webb to be so cold. If, like the <a href=\"https://spectrum.ieee.org/the-hubble-telescope-25-years\" target=\"_self\">Hubble Telescope</a>, it were in low Earth orbit, and it had no shielding from the sun, most of its targets would be drowned out by the sun and ground, and by heat in the telescope itself.\n</p><p>\n\t“If my signal is heat—and infrared is heat—then what I can’t have is other heat sources that are noise in the system,” says <a href=\"https://www.eurekalert.org/news-releases/939245\" rel=\"noopener noreferrer\" target=\"_blank\">Jim Flynn</a>, the sunshield manager at <a href=\"https://www.northropgrumman.com/space/james-webb-space-telescope/\" rel=\"noopener noreferrer\" target=\"_blank\">Northrop Grumman</a>, the prime contractor for the Webb.\n</p><p>\n\tSo the Webb has been sent to circle a spot in space called <a href=\"https://webb.nasa.gov/content/about/orbit.html\" target=\"_blank\">L2</a>, 1.5 million kilometers away, opposite the sun, one of the locations known as Lagrange points. These \"L\" points are where the gravity of Earth and the sun exactly conspire to keep it in a stable and relatively \"fixed\" orbit with respect to the Earth as it makes its way around its 365.256-day course circling the sun. It’s a good compromise: Earth is distant enough that it doesn’t interfere with observations, but close enough that communication with the spacecraft can be relatively fast. And since the ship isn’t flying from day to night and back on every orbit, its temperature is relatively stable. All it needs is a really, really good sunshade.\n</p><p class=\"pull-quote\">\n\t“Four [layers of sunshield] would have probably done the job. Five gave us a little bit of an insurance policy. I’d like to say it was way more sophisticated than that, but that’s really not what it was at all.”<br/>\n\t—Keith Parrish, NASA Goddard Space Flight Center\n</p><p>\n\t“The engineering was pushed above and beyond to meet the scientific goals,” says <a href=\"https://www.stsci.edu/stsci-research/research-directory/alex-lockwood\" rel=\"noopener noreferrer\" target=\"_blank\">Alexandra Lockwood</a>, a project scientist at the <a href=\"https://www.stsci.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Space Telescope Science Institute</a>, which operates the Webb. “It is specifically designed the way that it is because they wanted to do intensive infrared science.”\n</p><p>\n\tIt makes for an ungainly-looking ship in many renderings, with the telescope assembly, intentionally open to space to prevent heat buildup, attached to its silvery sunshield, about 14 meters wide and 21 meters long, with five layers of insulating film to keep the telescope in almost total darkness.\n</p><p>\n\tFrom its sunlit side the sunshield roughly resembles a kite. The elongated shape, engineers found, would be the most efficient way to keep the Webb’s optics out of the sun. They considered a square or octagon, but the final version covers more area without much more mass.\n</p><p>\n\t“It’s no larger than it needs to be to meet the science field-of-view requirements, and that unique kite shape is the result,” says Parrish. “Any larger than it is now, it just makes everything more complex.”\n</p><p>\n\tThe shield’s five layers are made of <a href=\"https://www.dupont.com/electronic-materials/kapton-polyimide-film.html\" rel=\"noopener noreferrer\" target=\"_blank\">Kapton E</a>, a plastic film first developed by DuPont in the 1960s and used for spacecraft insulation and printed circuits. The layers are coated in aluminum and silicon. Each is thinner than a human hair. But engineers say they are, together, very effective in blocking the sun’s heat. The first layer reduces its strength by about an order of magnitude (or 90 percent), the second layer removes another order of magnitude, and so on. The layers never touch, and they’re slightly flared as one gets away from the center of the shield, so that heat will escape out the sides.\n</p><p>\n\tThe result: Temperatures on the sunny side of the shield approach 360 K (87 °C), but on the dark side they’re below that all-important 40 K (-233 °C). <a rel=\"noopener noreferrer\" target=\"_blank\">Or, put another way: More than 200 kilowatts of </a><a href=\"https://directory.eoportal.org/web/eoportal/satellite-missions/j/jwst\" rel=\"noopener noreferrer\" target=\"_blank\">solar energy</a> fall on the first layer, but only 23 milliwatts make it all the way through the fifth.\n</p><h3>The Two Sides of the Webb Telescope</h3><br/><img alt=\"illustration depicting features of JWST's sunshield\" class=\"rm-shortcode\" data-rm-shortcode-id=\"01bd2a751ae5cc318d7e8b3a43e4b820\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"cc1c7\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/illustration-depicting-features-of-jwst-s-sunshield.png?id=30818967&width=980\"/><p>\n\tWhy five layers? There was a lot of computer modeling, but it was hard to simulate the shield’s thermal behavior before flight. “Four would have probably done the job. Five gave us a little bit of an insurance policy,” says Parrish. “I’d like to say it was way more sophisticated than that, but that’s really not what it was at all.”\n</p><p>\n\tThe ability to <a href=\"https://www.researchgate.net/publication/234251660_Radiatively-cooled_telescopes_for_infrared_space_astronomy\" rel=\"noopener noreferrer\" target=\"_blank\">cool the telescope naturally</a>, first calculated in the 1980s to be possible, was a major advance. It meant the Webb would not have to rely on a heavy, complex cryogenic apparatus, with refrigerants that could leak and shorten the mission. Of its four main scientific instruments, only one, a midinfrared detector called MIRI, needs to be cooled to 6.7 K. It’s chilled by a multistage cryocooler, which pumps cold helium gas through pulse tubes to draw heat away from the instrument’s sensor. It uses the <a href=\"https://www.comsol.com/multiphysics/joule-thomson-effect\" rel=\"noopener noreferrer\" target=\"_blank\">Joule-Thomson effect</a>, reducing the temperature of the helium by making it expand after it’s forced through a 1-millimeter valve. Pressure comes from two pistons—the cryocooler system’s only moving parts—facing opposite directions so their movements will cancel each other out and not disturb observations.\n</p><p>\n\tBuilding the telescope proved immensely complicated; it fell years behind while its budget ballooned toward US $10 billion. The sunshield needed lengthy redesign after testing, when Kapton tore and fasteners came loose.\n</p><p>\n\t“We just bit off way more than we could chew,” Parrish says now. “That’s exactly what NASA should be doing. It should be pushing the envelope. The problem is that eventually Webb got too big to fail.”\n</p><p>\n\tBut it’s finally deployed, sending data, and surprising engineers who expected at least some failures as it began to operate. Keith Parrish, his work done, is moving on to other projects at Goddard.\n</p><p>\n\t“I think Webb,” he says, “is just a great product of what it means to be an advanced civilization.”\n</p><p><br/></p><p><strong><em>Update: 26 July 2022: </em></strong><em>The story was updated to clarify that the gravity at Lagrange point L2 does not \"cancel\" (as the story had previously stated) but in fact adds to keep an object at L2 orbiting at the precise same orbital period as, in this case, the Earth—i.e. at 365.256 days.</em><br/></p>",
  "pubDate": "Thu, 07 Jul 2022 13:48:57 +0000",
  "guid": "https://spectrum.ieee.org/james-webb-telescope-sunshield",
  "category": [
    "Space telescopes",
    "Cryogenics",
    "Cooling",
    "Nasa",
    "James webb space telescope"
  ],
  "dc:creator": "Ned Potter",
  "media:content": ""
}