{
  "id": "yt:video:FJvnn0qRWb4",
  "yt:videoId": "FJvnn0qRWb4",
  "yt:channelId": "UCqnbDFdCpuN8CMEg0VuEBqA",
  "title": "Watch Warriors in Training in ‘The Woman King’ | Anatomy of a Scene",
  "link": "",
  "author": {
    "name": "The New York Times",
    "uri": "https://www.youtube.com/channel/UCqnbDFdCpuN8CMEg0VuEBqA"
  },
  "published": "2022-09-16T17:00:07+00:00",
  "updated": "2022-09-23T10:37:18+00:00",
  "media:group": {
    "media:title": "Watch Warriors in Training in ‘The Woman King’ | Anatomy of a Scene",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The intensity of the action epic “The Woman King,” starring Viola Davis and now in theaters, is balanced out with moments of levity, particularly in this training montage that sets up two key characters.\n\nNawi (Thuso Mbedu) has been dumped by her father at the palace in the Kingdom of Dahomey in 19th-century Africa. She is taken in and trained to become a part of a group of female soldiers. The woman leading the drills is Izogie (Lashana Lynch), whom Nawi ultimately tries to emulate.\n\n“We’ve seen training montages before and they’re always fun and exciting,” the director Gina Prince-Bythewood said, narrating the scene. “What is going to make this one different?” She said putting the focus on the story of female warriors was “the element we haven’t seen.”\n\nPrince-Bythewood’s approach, one she employed in her previous action film, “The Old Guard,” was to have actors perform their own stunts. In this sequence, that means performers have to pull off a flip in a couple of wrestling scenes. First, it’s Lynch flipping Mbedu, which Prince-Bythewood said came with a caveat: Mbedu would only agree to being flipped six times. But apparently the sixth time was the charm.\n\n“You see it, she gets trucked,” Prince-Bythewood said.\nThe segment where Nawi gets to pull the same maneuver on Ode (Adrienne Warren), a fellow trainee, came with a surprise.\n\n“The beauty of that moment, is at the end of the wrestling, Ode shoves Nawi,” Prince-Bythewood said. “That was not scripted. That was two actors so in the moment.”\n\nRead the New York Times review: https://nyti.ms/3dm6Dwu\nSubscribe: http://bit.ly/U8Ys7n&#13;\nMore from The New York Times Video:  http://nytimes.com/video&#13;\n----------&#13;\nWhether it's reporting on conflicts abroad and political divisions at home, or covering the latest style trends and scientific developments, New York Times video journalists provide a revealing and unforgettable view of the world. It's all the news that's fit to watch.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}