{
  "id": "tag:blogger.com,1999:blog-4371296950668142214.post-1624880781571211829",
  "published": "2020-12-11T09:18:00.002+11:00",
  "updated": "2020-12-11T09:18:46.198+11:00",
  "title": "Supporting quality reporting and information on vaccines",
  "content": "<span style=\"font-size: x-small;\"><br /><br />This is a guest blog post from Dr Susannah Eliott, CEO of the Australian Science Media Centre (AusSMC), which works to enhance the media's coverage of science, for the benefit of the public</span>. <br /><br /><br />The enormous impact of this pandemic has meant that scientists and pharmaceutical companies have had to go into overdrive to produce vaccines in record time. And with so many vaccines in various stages of development, it’s not surprising when journalists and the public find it difficult to get answers to critical questions. <br /><br /><br />Questions like what is herd immunity and how long will it take to achieve? Will the vaccines prevent infection as well as disease? And what is an mRNA vaccine and how is it different to traditional types of vaccines?<br /><br /><br />Answers to these questions, and access to clear and reliable information, has never been more important. And today we’re excited to announce a new initiative that aims to address this issue and equip journalists with solid information about COVID-19 vaccines as they are being developed and rolled out.<br /><br /><br />Journalists and fact checkers across the world will soon have access to our new <a href=\"https://health-desk.org/vaccines/\">COVID-19 Vaccine Media Hub</a>, a dedicated support service, to help them report on COVID-19 vaccines thanks to a global alliance of Science Media Centres (SMCs) and public health experts supported by a $1 million investment from the <a href=\"https://newsinitiative.withgoogle.com/intl/en_gb/\">Google News Initiative</a>.<br /><br /><br />This new media hub will bring together expert commentary, explainers and multiple sources of information from evidence-based sources on vaccines. And it will make information available in at least seven different languages to help journalists across the world to report on COVID-19 vaccines - and the science behind them. <br /><br /><br />As Alexios Mantzarlis, News and Information Credibility Lead at Google News Lab puts it: “Fighting misinformation about this topic will require both targeting harmful hoaxes directly and supporting the crucial work of science beat reporters and fact-checkers informing the public. It is with this in mind that we are thrilled to support the creation of a COVID-19 vaccine media hub to help journalists access expertise rapidly and reliably.”<br /><br /><br />The <a href=\"https://www.smc.org.au/\">Australian Science Media Centre</a> (AusSMC) will lead the initiative together with <a href=\"https://meedan.com/\">Meedan</a>, a technology not-for-profit, and in collaboration with SMCs and other organisations across Asia Pacific, Europe, Africa, and North America. <br /><br /><br />Science Media Centres are independent not-for-profit organisations that exist to help journalists report on the science behind daily news, whether that’s a pandemic, a natural disaster or a new scientific discovery. Although SMCs are independent of each other and work with journalists on local issues, they also collaborate on global topics and are aligned through a <a href=\"https://www.sciencemediacentre.org/wp-content/uploads/2012/07/SMC-Charter-003.pdf\">Charter of Independence</a>.<br /><br /><br />This initiative represents the first time that the SMC network has been supported to work proactively on a specific globally important topic together with organisations like Meedan. We hope that this alliance will grow and continue to provide evidence-based information on a whole range of topics into the future. <br /><br /><br />Nat Gyenes, Director of Meedan’s Digital Health Lab has the last word – “recognising the threat of misinformation has become an additional vector for the spread of infectious diseases [and] we see a networked approach to addressing information equity challenges as a critical public health need… We are honored to work with the Science Media Centre of Australia and their partner Science Media Centres on this critical initiative.”<br /><br /><br />We look forward to the impact this important resource will have for journalists, providing around-the-clock access to scientific expertise and research updates. <br /><br /><br />For more information, please visit the <a href=\"https://www.smc.org.au/news/covid-19-vaccine-media-hub\">Australian Science Media Centre</a> and you can read more about the Google News Initiative’s work <a href=\"https://blog.google/technology/health/accurate-timely-information-covid-19-vaccines/\">here</a>.<span data-about-syndication=\"\" style=\"display: none; font-size: 0px; line-height: 0; max-height: 0px; overflow: hidden;\"> <!--INSTRUCTIONS   In order to support google.com/about site blog syndication, fill in the info below (after the example). Leave elements empty if there is no valid data.    Example:   <span class=\"post-image\">http://1.bp.blogspot.com/-mX0dxJxp8dg/Vo8MSdxypWI/AAAAAAAARsI/EjaFhvgAEgc/s1600/Beutler_Google_Giftwrap_-v2TW.png</span>  <span class=\"post-author-name\">Abbi Tatton</span>  <span class=\"post-author-title\">Editorial Elf</span>  <span class=\"post-author-team\">Google</span>--> <span class=\"post-image\"></span><span class=\"post-author-name\"></span><span class=\"post-author-title\"></span><span class=\"post-author-team\"></span></span>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "anzprteam",
    "uri": "http://www.blogger.com/profile/06099752084931732403",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}