{
  "title": "Method for decoding asteroid interiors could help aim asteroid-deflecting missions",
  "link": "https://news.mit.edu/2022/asteroid-interiors-spin-deflecting-1019",
  "description": "Astronomers have found a way to determine an asteroid’s interior structure based on how its spin changes during a close encounter with Earth.",
  "pubDate": "Wed, 19 Oct 2022 00:00:00 -0400",
  "guid": "https://news.mit.edu/2022/asteroid-interiors-spin-deflecting-1019",
  "dc:creator": "Jennifer Chu | MIT News Office",
  "content:encoded": "<p>NASA hit a bullseye in late September with DART, the Double Asteroid Redirection Test, which flew a spacecraft straight at the heart of a nearby asteroid. The one-way kamikaze mission smashed into the stadium-sized space rock and successfully reset the asteroid’s orbit. DART was the first test of a planetary defense strategy, demonstrating that scientists could potentially deflect an asteroid headed for Earth.</p>\n\n<p>Now MIT researchers have a tool that may improve the aim of future asteroid-targeting missions. The team has developed a method to map an asteroid’s interior structure, or density distribution, based on how the asteroid’s spin changes as it makes a close encounter with more massive objects like the Earth.</p>\n\n<p>Knowing how the density is distributed inside an asteroid could help scientists plan the most effective defense. For instance, if an asteroid were made of relatively light and uniform matter, a DART-like spacecraft could be aimed differently than if it were deflecting an asteroid with a denser, less balanced interior.</p>\n\n<p>“If you know the density distribution of the asteroid, you could hit it at just the right spot so it actually moves away,” says Jack Dinsmore ’22, who developed the new asteroid-mapping technique as an MIT undergraduate majoring in physics. &nbsp;</p>\n\n<p>The team is eager to apply the method to Apophis, a near-Earth asteroid that is estimated to pose a significant hazard if it were to make impact. Scientists have ruled out the likelihood of a collision during Apophis’ next flybys for at least a century. Beyond that, their forecasts grow fuzzy.&nbsp; &nbsp;</p>\n\n<p>“Apophis will miss Earth in 2029, and scientists have cleared it for its next few encounters, but we can’t clear it forever,” says Dinsmore, who is now a graduate student at Stanford University. “So, it’s good to understand the nature of this particular asteroid, because if we ever need to redirect it, it’s important to understand what it’s made of.”</p>\n\n<p>Dinsmore and Julien de Wit, assistant professor in MIT’s Department of Earth, Atmospheric and Planetary Sciences (EAPS), detail their new method in a study appearing today in the <em>Monthly Notices of the Royal Astronomical Society. </em>The unedited version is also <a href=\"https://arxiv.org/abs/2210.10754\">available</a> on arXiv.org.</p>\n\n<p><strong>Spinning boiled versus raw</strong></p>\n\n<p>The seeds of the team’s asteroid-mapping method grew out of an MIT class Dinsmore took last year, taught by de Wit. The class, 12.401 (Essentials of Planetary Sciences), introduces the basic principles and formation mechanisms of planets, asteroids, and other objects in the solar system. As a final project, Dinsmore explored how an asteroid behaves during a close encounter.</p>\n\n<p>In class, he wrote a code to simulate various shapes and sizes of asteroids as well as how their orbital and spin dynamics change when influenced by the gravitational pull of a more massive object like the Earth.</p>\n\n<p>“I initially just tried to ask, what happens when an asteroid passes by Earth? Does it respond at all? Because I wasn’t sure,” Dinsmore recalls. “And the answer is, it does, in a way that depends very strongly on the shape and physical properties of the asteroid.”</p>\n\n<p>That initial realization prompted another question: Could the dynamics of an asteroid’s close encounter be used to predict not just its shape and size, but also its internal makeup? To get at an answer, Dinsmore continued the project with de Wit, through the MIT Undergraduate Research Opportunities Program (UROP), which enables students to perform original research with a faculty member.</p>\n\n<p>He and de Wit took a deeper dive into the dynamics of a close encounter, writing out a more complex code, which they used to simulate a zoo of different asteroids, each with a different size, shape, and internal composition, or distribution of density. They then ran the simulation forward to see how each asteroid’s spin should wobble or shift as it passes close to an object of a certain mass and gravitational pull. &nbsp;</p>\n\n<p class=\"MsoCommentText\">“It’s similar to how you can tell the difference between a raw and boiled egg,” de Wit offers. “If you spin the egg, the egg responds and spins differently depending on its interior properties. The same goes for an asteroid during a close encounter: You can get a grasp of what’s happening on the inside just by looking on how it responds to the strong gravitational forces it experiences during a flyby.”</p>\n\n<p><strong>A close match</strong></p>\n\n<p>The team is presenting their results in a new software “toolkit,” which they name AIME, for Asteroid Interior Mapping from Encounters (the acronym also translates as “love” in French). The software can be used to reconstruct the internal density distribution of an asteroid, from observations of its spin change during a close encounter.</p>\n\n<p>The researchers say that, if scientists can take more detailed measurements of asteroids and their spin dynamics during close encounters, these measurements could be used to improve AIME’s reconstructions of asteroid interiors.</p>\n\n<p>Their best chance, they say, may come with Apophis. During its forthcoming close encounters, de Wit and Dinsmore hope astronomers will point their telescopes at the space rock to measure its size, shape, and spin evolution as it streaks past. They could then feed these measurements into AIME to find a match — a simulated asteroid with the same size, shape, and spin dynamics as Apophis, that also relates to a particular interior density distribution.</p>\n\n<p>“Then, with AIME, you could publish a density map that most likely represents Apophis’ interior,” Dinsmore says.</p>\n\n<p>“Understanding the interior properties of asteroids helps us understand the extent to which close encounters could be of concern, and how to deal with them, as well as where they formed and how they got here,” de Wit adds. “Now with this framework, there’s a new way of getting a look inside an asteroid.”</p>\n\n<p>This research was supported, in part, by the MIT UROP office.</p>",
  "media:content": {
    "media:description": "MIT astronomers have found a way to determine an asteroid’s interior structure based on how its spin changes during a close encounter with Earth. The tool may improve the aim of future asteroid-targeting missions like the recent DART mission.",
    "media:credit": "Credit: NASA/Johns Hopkins APL"
  },
  "category": [
    "Astronomy",
    "EAPS",
    "Physics",
    "Planetary science",
    "Research",
    "School of Science",
    "Space, astronomy and planetary science",
    "Space exploration"
  ]
}