{
  "id": "yt:video:4JZFVzeAkmQ",
  "yt:videoId": "4JZFVzeAkmQ",
  "yt:channelId": "UCRRr_xrOm66qaigIbwFLvbQ",
  "title": "Thank you for buying us a house!",
  "link": "",
  "author": {
    "name": "Simon Clark",
    "uri": "https://www.youtube.com/channel/UCRRr_xrOm66qaigIbwFLvbQ"
  },
  "published": "2022-06-18T10:03:37+00:00",
  "updated": "2022-08-19T15:36:24+00:00",
  "media:group": {
    "media:title": "Thank you for buying us a house!",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Teach yourself subjects in STEM with Brilliant, the natural partner to this channel! https://www.brilliant.org/simonclark\n\nWe're going to buy a house, and we're going to make the subscribers pay for it! With the support of my viewers over the past ten years, pixel girl and I have finally been able to buy a house. I wanted to make this house move in vlog to say thank you, both for enabling this particular life milestone, but also for sticking with me and for making the comments and discord and my social media replies such a wonderful community. I am so, so lucky to do this job, and to have a kind, generous, thoughtful group of people who enjoy the stuff I do. So thank you, so, so much.\n\nMy second channel: https://www.youtube.com/c/SimonClarkErrata\n\nYou can support the channel by becoming a patron at http://www.patreon.com/simonoxfphys\n\nCheck out my website! https://www.simonoxfphys.com/\n\n---------- II ----------\n\nMy twitter - http://www.twitter.com/simonoxfphys\nMy facebook - http://www.facebook.com/youtubesimon\nMy insta - http://www.instagram.com/simonoxfphys\nMy goodreads - http://www.goodreads.com/simonoxfphys\n\n---------- II ----------\n\nMusic by Epidemic Sound: http://epidemicsound.com\nBeautifully edited by Luke Negus.\n\nHouse move in day vlog, getting the keys to our first house, first time buyers, we bought our first house! In this move in vlog I say thank you for the support my YouTube subscribers have given to me and allowed me and my fiancee pixel girl to buy our first home together\n\nHuge thanks to my supporters on Patreon: Conor Safbom, William Pettersson, Paul H and Linda L, InDefenseOfToucans, Savannah, Jimmy Lee, Simon Stelling, Gabriele Siino, Bjorn Bakker, Ieuan Williams, Candace H, Tom Malcolm, Marcus Bosshard, Shab Kumar, Brady Johnston, Liat Khitman, Jesper Norsted, Kent & Krista Halloran, Rapssack, Kevin O'Connor, Timo Kerremans, Thines Ganeshamoorthy, Ashley Wilkins, Michael Parmenter, Samuel Baumgartner, Dan Sherman, ST0RMW1NG 1, Adrian Sand, Morten Engsvang, Farsight101, K.L, poundedjam, fourthdwarf, Daan Sneep, Felix Freiberger, Chris Field, Robert Connell, ChemMentat, Kolbrandr, , Sebastain Graf, Dan Nelson, Shane O'Brien, Alex, Fujia Li, Will Tolley, Cody VanZandt, Jesper Koed, Jonathan Craske, Albrecht Striffler, Igor Francetic, Jack Troup, SexyCaveman , Sean Richards, Kedar , Omar Miranda, Alastair Fortune, bitreign33 , Mat Allen, Anne Smith, Rafaela Corrêa Pereira, Colin J. Brown, Princess Andromeda, Mach_D, Thusto , Andy Hartley, Lachlan Woods, Dan Hanvey, Simon Donkers, Kodzo , James Bridges, Liam , Andrea De Mezzo, Wendover Productions, Kendra Johnson.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}