{
  "title": "Episode 61: &#8220;That&#8217;ll Be the Day&#8221; by The Crickets",
  "link": "https://500songs.com/podcast/episode-61-thatll-be-the-day-by-the-crickets/",
  "pubDate": "Mon, 16 Dec 2019 16:19:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=550",
  "description": "<p>Episode sixty-one of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"That'll Be the Day\" by The Crickets. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/500-songs-bonus-32403820\">\"Rudolph the Red-Nosed Reindeer\"</a> by Gene Autry</p>\n\n<p><strong>Errata</strong></p>\n<p>I say in here that Larry Welborn lent Holly a thousand dollars. That money was actually lent Holly by his brother, also called Larry.</p>\n<p>I also at one point say \"That'll Be the Day\" was co-written by Joe Allison. I meant Jerry Allison, of course -- Joe Allison was also a Texan songwriter, but had no involvement in that song.</p>\n<p><strong>Resources</strong></p>\n<p>As usual, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-61-thatll-be-the-day/\">Mixcloud mix</a> with all the recordings excerpted here.</p>\n<p>I've used two biographies for the bulk of the information here -- <a href=\"https://amzn.to/2PrUozx\">Buddy Holly: Learning the Game</a>, by Spencer Leigh, and <a href=\"https://amzn.to/2LXTlVS\">Rave On: The Biography of Buddy Holly</a> by Philip Norman. </p>\n<p>There are many collections of Buddy Holly's work available, but many of them are very shoddy, with instrumental overdubs recorded over demos after his death. The best compilation I am aware of is <a href=\"https://amzn.to/2RZ1A7O\">The Memorial Collection</a>, which contains almost everything he issued in his life, as he issued it (for some reason two cover versions are missing) along with the undubbed acoustic recordings that were messed with and released after his death.</p>\n<p>A lot of the early recordings with Bob, Larry, and/or Sonny that I reference in this episode are included in <a href=\"https://amzn.to/2M0FqOU\">Down The Line: Rarities</a>, a companion set to the Memorial Collection.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?</p>\n<p><strong>Transcript</strong></p>\n<p>And so, far later in the story than many people might have been expecting, we finally come to Buddy Holly, the last of the great fifties rockers to appear in our story. Nowadays, Holly gets counted as a pioneer of rock and roll, but in fact he didn't turn up until the genre had become fairly well established in the charts.</p>\n<p>Which is not to say that he wasn't important or innovative, just that he was one of the greats of the second wave -- from a twenty-first-century perspective, Buddy Holly looks like one of the people who were there when rock and roll was invented, but by the time he had his first hit, Bill Haley, Carl Perkins, and Gene Vincent had all had all their major chart hits, and were on their way down and out. Little Richard was still touring, but he'd already recorded his last rock and roll record of the fifties, and while Fats Domino was still making hit records, most of the ones he's remembered by, the ones that changed music, had already been released.</p>\n<p>But Holly was arguably the most important figure of this second wave, someone who, more than any other figure of the mid-fifties, seems at least in retrospect to point the way forward to what rock music would become in the decade after.</p>\n<p>So today we're going to look at the story of how the first really successful rock group started. Because while these days, \"That'll Be The Day\" is generally just credited to \"Buddy Holly\", at the time the record came out, it didn't have any artist name on it other than that of the band that made it, The Crickets:</p>\n<p>[Excerpt: The Crickets, \"That'll Be the Day\"]</p>\n<p>Charles Hardin Holley grew up in Lubbock, Texas, a town in the middle of nowhere that has produced more than its fair share of famous musicians. Other than Buddy Holly, the two most famous people from Lubbock are probably Waylon Jennings, who briefly played in Holly's band in 1959 before going on to his own major successes, and Mac Davis, who wrote several hits for Elvis before going on to become a country singer of some note himself.</p>\n<p>Holly grew up with music. His elder brothers performed as a country duo in much the same style as the Louvin Brothers, and there's a recording of Holly singing the old country song, \"Two Timin' Woman\", in 1949, when he was twelve, before his voice had even broken:</p>\n<p>[Excerpt: Charles Holley, \"Two Timin' Woman\"]</p>\n<p>By his mid-teens, he was performing as \"Buddy and Bob\" with a friend, Bob Montgomery, playing pure country and western music, with Buddy on the mandolin while Bob played guitar:</p>\n<p>[Excerpt: Buddy and Bob, \"Footprints in the Snow\"]</p>\n<p>He would also appear on the radio with another friend, Jack Neal, as \"Buddy and Jack\". Some early recordings of that duo survive as well, with Jack singing while Buddy played guitar:</p>\n<p>[Excerpt: Buddy and Jack, \"I Saw the Moon Crying Last Night\"]</p>\n<p>When Jack Neal, who was a few years older than Buddy, got married and decided he didn't have time for the radio any more, the Buddy and Jack Show became the Buddy and Bob Show.</p>\n<p>Around this time, Buddy met another person who would become important both to him and the Crickets, Sonny Curtis. Curtis was only a teenager, like him, but he had already made an impression in the music world. When he was only sixteen, he had written a song, \"Someday\", that was recorded by the country star Webb Pierce:</p>\n<p>[Excerpt: Webb Pierce, \"Someday\"]</p>\n<p>Buddy, too, was an aspiring songwriter. A typical early example of his songwriting was one he wrote in collaboration with his friend Scotty Turner, \"My Baby's Coming Home\". The song wasn't recorded at the time, but a few years later a demo version of it was cut by a young singer called Harry Nilsson:</p>\n<p>[Excerpt: Harry Nilsson, \"My Baby's Coming Home\"]</p>\n<p>But it wasn't until he saw Elvis live in 1955 that Buddy Holly knew he didn't want to do anything other than become a rock and roll star. When Elvis came to town, the promoter of Elvis' show was a friend of Buddy and Bob, and so he added them to the bill. They became friendly enough that every time Elvis passed through town -- which he did often in those early years of his career -- they would all hang out together. Bob Montgomery used to reminisce about going to the cinema with Elvis to watch Gentlemen Prefer Blondes, and Elvis getting bored with the film half an hour in, and leaving with the rest of the group.</p>\n<p>After seeing Elvis, Buddy almost immediately stepped up his musical plans. He had already been recording demos with Bob and Sonny Curtis, usually with Bob on vocals:</p>\n<p>[Excerpt: Buddy and Bob, \"I Gambled My Heart\"]</p>\n<p>The bass player on that song, Larry Welborn, believed in Buddy's talents, and lent him a thousand dollars -- a *massive* amount of money in 1955 -- so he could buy himself a Fender Stratocaster, an amp, and a stage suit. Holly's friend Joe B. Mauldin said of the Strat that it was the first instrument he'd ever seen with a gear shift. He was referring there to the tremelo arm on the guitar -- a recent innovation that had only been brought in that year.</p>\n<p>Buddy kept playing guitar with various combinations of his friends. For example Sonny Curtis cut six songs in 1955, backed by Buddy on guitar, Larry Wellborn on bass, and Jerry Allison on drums:</p>\n<p>[Excerpt: Sonny Curtis, \"Because You Love Me\"]</p>\n<p>Curtis would later talk about how as soon as Elvis came along, he and Buddy immediately switched their musical style. While it was Buddy who owned the electric guitar, he would borrow Curtis' Martin acoustic and try to play and sing like Elvis, while Curtis in turn would borrow Buddy's Strat and play Scotty Moore's guitar licks.</p>\n<p>Buddy was slowly becoming the most popular rock and roll singer in that part of Texas -- though he had an ongoing rivalry with Roy Orbison, who was from a hundred miles away in Wink but was the only serious competition around for the best local rock and roller. </p>\n<p>But while Buddy was slowly building up a reputation in the local area, he couldn't yet find a way to break out and have success on a wider stage. Elvis had told him that the Louisiana Hayride would definitely have him on at Elvis' recommendation, but when he and Sonny Curtis drove to Shreveport, the radio station told them that it wasn't up to Elvis who got on their show and who didn't, and they had to drive back to Texas from Louisiana without getting on the radio.</p>\n<p>This kind of thing just kept happening. Buddy and Bob and Sonny and Larry and Jerry were recording constantly, in various combinations, and were making more friends in the local music community, like Waylon Jennings, but nothing was happening with the recordings.</p>\n<p>You can hear on some of them, though, exactly what Sonny Curtis meant when he said that they were trying to sound like Elvis and Scotty Moore:</p>\n<p>[Excerpt: Buddy Holly, \"Don't Come Back Knockin'\"]</p>\n<p>These songs were  the recordings that got Buddy a contract with Decca Records in Nashville, which was, at the time, one of the biggest record labels in the country. And not only did he get signed to Decca, but Buddy also got a songwriting contract with Cedarwood Music, the publishing company that was jointly owned by Jim Denny, the man in charge of the bookings for the Grand Ole Opry, and Webb Pierce, one of the biggest country music stars of the period.</p>\n<p>So it must have seemed in January 1956 as if Buddy Holly was about to become a massive rock and roll star.</p>\n<p>That first Decca recording session took place in Owen Bradley's studio, and featured Sonny Curtis on guitar, and a friend called Don Guess on bass. The session was rounded out by two of the regular musicians that Bradley used on his sessions -- Grady Martin on rhythm guitar, so Buddy didn't have to sing and play at the same time, and Doug Kirkham on drums.</p>\n<p>The songs they cut at that initial session consisted of two of the songs they'd already demoed, \"Don't Come Back Knockin'\" and \"Love Me\", plus \"Blue Days, Black Nights\", a song written by Ben Hall, a friend of Buddy's from Lubbock. But it was the fourth song that was clearly intended to be the hit.</p>\n<p>We've talked before about the Annie songs, but that was back in March, so I'll give you a brief refresher here, and if you want more detail, go and listen to episode twenty-two, on \"The Wallflower\", which I'll link in the show notes.</p>\n<p>Back in 1954, Hank Ballard and the Midnighters had recorded a song called \"Work With Me Annie\", a song which had been, for the time, relatively sexually explicit, though it sounds like nothing now:</p>\n<p>[Excerpt: Hank Ballard and the Midnighters, \"Work With Me Annie\"]</p>\n<p>That song had started up a whole series of answer records. The Midnighters recorded a couple themselves, like \"Annie Had a Baby\":</p>\n<p>[Excerpt: Hank Ballard and the Midnighters, \"Annie Had a Baby\"]</p>\n<p>Most famously there was Etta James' \"The Wallflower\":</p>\n<p>[Excerpt: Etta James, \"The Wallflower\"]</p>\n<p>But there were dozens more songs about Annie -- there was \"Annie Met Henry\", \"Annie Pulled a Hum-Bug\", even \"Annie Kicked the Bucket\":</p>\n<p>[excerpt: the Nu Tones, \"Annie Kicked the Bucket\"]</p>\n<p>And the fourth song that Buddy recorded at this first Decca session, \"Midnight Shift\", was intended to be another in the Annie series. It was written by Luke McDaniel, a country singer who had gone rockabilly, and who recorded some unissued sides for Sun, like \"My Baby Don't Rock\":</p>\n<p>[Excerpt: Luke McDaniel, \"My Baby Don't Rock\"]</p>\n<p>Jim Denny had suggested \"Midnight Shift\" for Buddy -- though it seems a strange choice for commercial success, as it's rather obviously about a sex worker:</p>\n<p>[Excerpt: Buddy Holly, \"Midnight Shift\"]</p>\n<p>Perhaps the label had second thoughts, as \"Blue Days, Black Nights\" was eventually chosen as the single, rather than \"Midnight Shift\". When the paperwork for it came through for Buddy to sign, he discovered that they'd misspelled his name. He was born Charles Holley -- h-o-l-l-e-y -- but the paperwork spelled it h-o-l-l-y. As he was told they needed it back in a hurry, he signed it, and from then on he was Buddy Holly without the e.</p>\n<p>For the rest of 1956 Buddy continued recording with Owen Bradley for Decca, and kept having little success. Bradley became ever more disillusioned with Holly, while Paul Cohen, the executive at Decca who had signed Holly, at one point was telling his friends \"Buddy Holly is the biggest no talent I have ever worked with.\"</p>\n<p>One of the songs that he recorded during that time, but which wasn't released, was one that Owen Bradley described as \"the worst song I've ever heard\". It had been written by Holly and Joe Allison after they'd been to see the John Wayne film The Searchers -- a film which later gave the name to a band from Liverpool who would become hugely influential. Holly and Allison had seen the film several times, and they kept finding themselves making fun of the way that Wayne said one particular line:</p>\n<p>[Excerpt: The Searchers, John Wayne saying \"That'll Be The Day\"]</p>\n<p>They took that phrase and turned it into the title of a song. Unfortunately, the first recording of it wasn't all that great -- Buddy had been told by Webb Pierce that the way to have a hit single was to sing in a high voice, and so he sang the song far out of his normal range:</p>\n<p>[Excerpt: Buddy Holly, \"That'll Be The Day\"]</p>\n<p>Around this time, Sonny Curtis stopped working with Holly. Owen Bradley didn't like his guitar playing and wanted Holly to record with the session musicians he used with everyone else, while Curtis got an offer to play guitar for Slim Whitman, who at the time was about the biggest star in country music. So as 1956 drew to a close, Buddy Holly was without his longtime guitarist, signed to a record company that didn't know what to do with him, and failing to realise his musical ambitions.</p>\n<p>This is when Norman Petty entered the story.</p>\n<p>Petty was a former musician, who had performed crude experiments in overdubbing in the late forties, copying Les Paul and Mary Ford, though in a much less sophisticated manner. One of his singles, a version of Duke Ellington's \"Mood Indigo\", had actually been a minor hit:</p>\n<p>[Excerpt: The Norman Petty Trio, \"Mood Indigo\"]</p>\n<p>He'd gone into the recording studio business, and charged bands sixty dollars to record two songs in his studio -- or, if he thought the songs had commercial potential, he'd waive the charge if they gave him the publishing and a co-writing credit.</p>\n<p>Petty had become interested in rockabilly after having recorded Roy Orbison and the Teen Kings' first single -- the version of \"Ooby Dooby\" that was quickly deleted:</p>\n<p>[Excerpt: Roy Orbison and the Teen Kings, \"Ooby Dooby\", Je_Wel Records version]</p>\n<p>When he heard Sam Phillips' remake of the song, he became intrigued by the possibilities that echo offered, and started to build his own echo chamber -- something that would eventually be completed with the help of Buddy Holly and Buddy's father and brother. Petty recorded another rockabilly group, Buddy Knox and the Rhythm Orchids, on a song, \"Party Doll\", that went to number one:</p>\n<p>[Excerpt: Buddy Knox and the Rhythm Orchids, \"Party Doll\"]</p>\n<p>When the Rhythm Orchids passed through Lubbock, they told Buddy about Norman Petty's studio, and Buddy went there to cut some demos. Petty was impressed by Holly -- though he was more impressed by Sonny Curtis, who was still with Buddy for those demo sessions -- and when his contract with Decca expired, Petty and Holly agreed to work together.</p>\n<p>But they had a problem. Buddy's contract with Decca said that even though they'd only released two singles by him, and hadn't bothered to release any of the other songs he'd recorded during the year he was signed to them, he couldn't rerecord anything he'd recorded for them for another five years. Buddy tried to get Paul Cohen to waive that clause in the contract, and Cohen said no. Holly asked if he could speak to Milt Gabler instead -- he was sure that Gabler would agree. But Cohen explained to him that Gabler was only a vice president, and that he worked for Cohen. There was no way that Buddy Holly could put out a record of any of the songs he had recorded in 1956.</p>\n<p>So Norman Petty, who had been secretly recording the conversation, suggested a way round the problem. They could take those songs, and still have Holly sing them, but put them out as by a group, rather than a solo singer. It wouldn't be Buddy Holly releasing the records, it would be the group.</p>\n<p>But what should they call the group? Buddy and Jerry Allison both really liked New Orleans R&B -- they loved Fats Domino, and the other people that Dave Bartholomew worked with -- and they particularly liked a song that Bartholomew had co-written for a group called the Spiders:</p>\n<p>[Excerpt: The Spiders, \"Witchcraft\"]</p>\n<p>So they decided that they wanted a name that was something like the Spiders. At first they considered \"the Beetles\", but decided that that was too creepy -- people would want to squish them. So they settled on The Crickets. And so the version of \"That'll Be The Day\" that Buddy, Larry, Jerry, and Niki Sullivan had recorded with Norman Petty producing was going to be released as by the Crickets, and Buddy Holly's name was going to be left off anything that the heads at Decca might see.</p>\n<p>Amusingly, the record ended up released by Decca anyway -- or at least by a subsidiary of Decca.</p>\n<p>Norman Petty shopped the demos they'd made around different labels, and eventually he took them to Bob Thiele. Thiele had had a similar career to Milt Gabler -- he'd started out as a musician, then he'd formed his own speciality jazz label, Signature, and had produced records like Coleman Hawkins' \"The Man I Love\":</p>\n<p>[Excerpt: Coleman Hawkins, \"The Man I Love\"]</p>\n<p>Like Gabler, he had been taken on by Decca, which of all the major labels was the only one that really understood the way that the music business was changing. He'd been put in charge of two labels owned by Decca -- Coral, which was being used mostly for insipid white cover versions of black acts, and Brunswick, which was where he released rockabilly tracks by Johnny Burnette and the Rock and Roll Trio.</p>\n<p>The Crickets were clearly a Brunswick group, and so \"That'll Be the Day\" was going to be released on Brunswick -- and the contract was sent to Jerry Allison, not Buddy Holly. Holly's name wasn't mentioned at first, in case Thiele decided to mention it to his bosses and the whole thing was blown.</p>\n<p>Norman Petty had assumed that what they'd recorded so far was just going to be a demo, but Thiele said that no, he thought what they had was fine as it was, and put this out:</p>\n<p>[Excerpt: The Crickets, \"That'll Be The Day\"]</p>\n<p>But the Crickets had still not properly finalised their lineup. The core of Holly and Allison was there -- the two of them had been playing together for years -- and Niki Sullivan would be OK on rhythm guitar, but they needed a permanent bass player. They eventually settled on Joe B. Mauldin, who had played with a group called The Four Teens that had also featured Larry Welborn. Joe B. had sat in on a gig with the other three, and they'd been impressed with his bass playing. </p>\n<p>Before \"That'll Be the Day\" was released, they were already in the studio cutting more songs. One was a song that had originally been written by Holly's mother, though she refused to take credit for it -- she was a fundamentalist Southern Baptist, and rock and roll was the Devil's music. She was just about okay with her son playing it, but she wasn't going to get herself involved in that. So Buddy took his mother's song and turned it into this:</p>\n<p>[Excerpt: The Crickets, \"Maybe Baby\"]</p>\n<p>And at the same time, they also made an agreement that Holly could record solo material for Coral. That would actually be recorded by the same people who were making the Crickets' records, but since he was coming up with so many new songs, they might as well use them to get twice as much material out -- there was no prohibition, after all, on him recording new songs under his own name, just the ones he'd recorded in 1956.</p>\n<p>And they were recording a ludicrous amount of material. \"That'll Be The Day\" still hadn't been released, and they already had their next single in the bag, and were recording Buddy's first solo single. That song was based on \"Love is Strange\" by Mickey and Sylvia, a favourite of Holly's:</p>\n<p>[Excerpt: Mickey and Sylvia, \"Love is Strange\"]</p>\n<p>Holly took that basic musical concept and turned it into \"Words of Love\":</p>\n<p>[Excerpt: Buddy Holly, \"Words of Love\"]</p>\n<p>That wasn't a hit for Holly, but even before his version was released, the Diamonds, who usually made a habit of recording tracks originally recorded by black artists, released a cover version, which went to number thirteen:</p>\n<p>[Excerpt: The Diamonds, \"Words of Love\"]</p>\n<p>The Crickets were essentially spending every second they could in Petty's studio. They were also doing session work, playing on records by Jim Robinson, Jack Huddle, Hal Goodson, Fred Crawford, and more. In the early months of 1957, they recorded dozens upon dozens of songs, which would continue being released for years afterwards. For example, just two days after \"That'll Be the Day\" was finally released, at the end of May, they went into the studio and cut another song they had patterned after Bo Diddley, who had co-written \"Love is Strange\",  as a Crickets side:</p>\n<p>[Excerpt: The Crickets, \"Not Fade Away\"]</p>\n<p>and, on the same day, a Holly solo side:</p>\n<p>[Excerpt: Buddy Holly, \"Every Day\"]</p>\n<p>All these songs were written by Holly and Allison, sometimes with Mauldin helping, but the songwriting credits didn't really match that. Sometimes one or other name would get missed off the credits, sometimes Holly would be credited by his middle name, Hardin, instead of his surname, and almost always Norman Petty would end up with his name on the songwriting credits.</p>\n<p>They weren't that bothered about credit, for the moment -- there was always another song where the last one came from, and they were piling up songs far faster than they could release them.</p>\n<p>Indeed, only a month after the \"Not Fade Away\" and \"Every Day\" session, they were back in the studio yet again, recording another song, which Buddy had originally intended to name after his niece, Cindy Lou. Jerry, on the other hand, thought the song would be better if it was about his girlfriend.</p>\n<p>And you'll be able to find out what happened after they decided between Cindy Lou and Peggy Sue in a few weeks' time...</p>",
  "itunes:subtitle": "Episode sixty-one of A History of Rock Music in Five Hundred Songs looks at Thatll Be the Day by The Crickets. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bon",
  "itunes:keywords": "Bob Thiele,Brunswick Records,Buddy Holly,Coral Records,country and western,Decca Records,Elvis Presley,Grady Martin,Hank Ballard,Harry Nilsson,Jerry Allison,Joe Mauldin,Milt Gabler,Norman Petty,Owen Bradley,rockabilly,Roy Orbison,Sonny Curtis,the Crickets",
  "itunes:episodeType": "full",
  "itunes:episode": 61,
  "content:encoded": "<p>Episode sixty-one of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"That'll Be the Day\" by The Crickets. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/500-songs-bonus-32403820\">\"Rudolph the Red-Nosed Reindeer\"</a> by Gene Autry</p>\n\n<p><strong>Errata</strong></p>\n<p>I say in here that Larry Welborn lent Holly a thousand dollars. That money was actually lent Holly by his brother, also called Larry.</p>\n<p>I also at one point say \"That'll Be the Day\" was co-written by Joe Allison. I meant Jerry Allison, of course -- Joe Allison was also a Texan songwriter, but had no involvement in that song.</p>\n<p><strong>Resources</strong></p>\n<p>As usual, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-61-thatll-be-the-day/\">Mixcloud mix</a> with all the recordings excerpted here.</p>\n<p>I've used two biographies for the bulk of the information here -- <a href=\"https://amzn.to/2PrUozx\">Buddy Holly: Learning the Game</a>, by Spencer Leigh, and <a href=\"https://amzn.to/2LXTlVS\">Rave On: The Biography of Buddy Holly</a> by Philip Norman. </p>\n<p>There are many collections of Buddy Holly's work available, but many of them are very shoddy, with instrumental overdubs recorded over demos after his death. The best compilation I am aware of is <a href=\"https://amzn.to/2RZ1A7O\">The Memorial Collection</a>, which contains almost everything he issued in his life, as he issued it (for some reason two cover versions are missing) along with the undubbed acoustic recordings that were messed with and released after his death.</p>\n<p>A lot of the early recordings with Bob, Larry, and/or Sonny that I reference in this episode are included in <a href=\"https://amzn.to/2M0FqOU\">Down The Line: Rarities</a>, a companion set to the Memorial Collection.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?</p>\n<p><strong>Transcript</strong></p>\n<p>And so, far later in the story than many people might have been expecting, we finally come to Buddy Holly, the last of the great fifties rockers to appear in our story. Nowadays, Holly gets counted as a pioneer of rock and roll, but in fact he didn't turn up until the genre had become fairly well established in the charts.</p>\n<p>Which is not to say that he wasn't important or innovative, just that he was one of the greats of the second wave -- from a twenty-first-century perspective, Buddy Holly looks like one of the people who were there when rock and roll was invented, but by the time he had his first hit, Bill Haley, Carl Perkins, and Gene Vincent had all had all their major chart hits, and were on their way down and out. Little Richard was still touring, but he'd already recorded his last rock and roll record of the fifties, and while Fats Domino was still making hit records, most of the ones he's remembered by, the ones that changed music, had already been released.</p>\n<p>But Holly was arguably the most important figure of this second wave, someone who, more than any other figure of the mid-fifties, seems at least in retrospect to point the way forward to what rock music would become in the decade after.</p>\n<p>So today we're going to look at the story of how the first really successful rock group started. Because while these days, \"That'll Be The Day\" is generally just credited to \"Buddy Holly\", at the time the record came out, it didn't have any artist name on it other than that of the band that made it, The Crickets:</p>\n<p>[Excerpt: The Crickets, \"That'll Be the Day\"]</p>\n<p>Charles Hardin Holley grew up in Lubbock, Texas, a town in the middle of nowhere that has produced more than its fair share of famous musicians. Other than Buddy Holly, the two most famous people from Lubbock are probably Waylon Jennings, who briefly played in Holly's band in 1959 before going on to his own major successes, and Mac Davis, who wrote several hits for Elvis before going on to become a country singer of some note himself.</p>\n<p>Holly grew up with music. His elder brothers performed as a country duo in much the same style as the Louvin Brothers, and there's a recording of Holly singing the old country song, \"Two Timin' Woman\", in 1949, when he was twelve, before his voice had even broken:</p>\n<p>[Excerpt: Charles Holley, \"Two Timin' Woman\"]</p>\n<p>By his mid-teens, he was performing as \"Buddy and Bob\" with a friend, Bob Montgomery, playing pure country and western music, with Buddy on the mandolin while Bob played guitar:</p>\n<p>[Excerpt: Buddy and Bob, \"Footprints in the Snow\"]</p>\n<p>He would also appear on the radio with another friend, Jack Neal, as \"Buddy and Jack\". Some early recordings of that duo survive as well, with Jack singing while Buddy played guitar:</p>\n<p>[Excerpt: Buddy and Jack, \"I Saw the Moon Crying Last Night\"]</p>\n<p>When Jack Neal, who was a few years older than Buddy, got married and decided he didn't have time for the radio any more, the Buddy and Jack Show became the Buddy and Bob Show.</p>\n<p>Around this time, Buddy met another person who would become important both to him and the Crickets, Sonny Curtis. Curtis was only a teenager, like him, but he had already made an impression in the music world. When he was only sixteen, he had written a song, \"Someday\", that was recorded by the country star Webb Pierce:</p>\n<p>[Excerpt: Webb Pierce, \"Someday\"]</p>\n<p>Buddy, too, was an aspiring songwriter. A typical early example of his songwriting was one he wrote in collaboration with his friend Scotty Turner, \"My Baby's Coming Home\". The song wasn't recorded at the time, but a few years later a demo version of it was cut by a young singer called Harry Nilsson:</p>\n<p>[Excerpt: Harry Nilsson, \"My Baby's Coming Home\"]</p>\n<p>But it wasn't until he saw Elvis live in 1955 that Buddy Holly knew he didn't want to do anything other than become a rock and roll star. When Elvis came to town, the promoter of Elvis' show was a friend of Buddy and Bob, and so he added them to the bill. They became friendly enough that every time Elvis passed through town -- which he did often in those early years of his career -- they would all hang out together. Bob Montgomery used to reminisce about going to the cinema with Elvis to watch Gentlemen Prefer Blondes, and Elvis getting bored with the film half an hour in, and leaving with the rest of the group.</p>\n<p>After seeing Elvis, Buddy almost immediately stepped up his musical plans. He had already been recording demos with Bob and Sonny Curtis, usually with Bob on vocals:</p>\n<p>[Excerpt: Buddy and Bob, \"I Gambled My Heart\"]</p>\n<p>The bass player on that song, Larry Welborn, believed in Buddy's talents, and lent him a thousand dollars -- a *massive* amount of money in 1955 -- so he could buy himself a Fender Stratocaster, an amp, and a stage suit. Holly's friend Joe B. Mauldin said of the Strat that it was the first instrument he'd ever seen with a gear shift. He was referring there to the tremelo arm on the guitar -- a recent innovation that had only been brought in that year.</p>\n<p>Buddy kept playing guitar with various combinations of his friends. For example Sonny Curtis cut six songs in 1955, backed by Buddy on guitar, Larry Wellborn on bass, and Jerry Allison on drums:</p>\n<p>[Excerpt: Sonny Curtis, \"Because You Love Me\"]</p>\n<p>Curtis would later talk about how as soon as Elvis came along, he and Buddy immediately switched their musical style. While it was Buddy who owned the electric guitar, he would borrow Curtis' Martin acoustic and try to play and sing like Elvis, while Curtis in turn would borrow Buddy's Strat and play Scotty Moore's guitar licks.</p>\n<p>Buddy was slowly becoming the most popular rock and roll singer in that part of Texas -- though he had an ongoing rivalry with Roy Orbison, who was from a hundred miles away in Wink but was the only serious competition around for the best local rock and roller. </p>\n<p>But while Buddy was slowly building up a reputation in the local area, he couldn't yet find a way to break out and have success on a wider stage. Elvis had told him that the Louisiana Hayride would definitely have him on at Elvis' recommendation, but when he and Sonny Curtis drove to Shreveport, the radio station told them that it wasn't up to Elvis who got on their show and who didn't, and they had to drive back to Texas from Louisiana without getting on the radio.</p>\n<p>This kind of thing just kept happening. Buddy and Bob and Sonny and Larry and Jerry were recording constantly, in various combinations, and were making more friends in the local music community, like Waylon Jennings, but nothing was happening with the recordings.</p>\n<p>You can hear on some of them, though, exactly what Sonny Curtis meant when he said that they were trying to sound like Elvis and Scotty Moore:</p>\n<p>[Excerpt: Buddy Holly, \"Don't Come Back Knockin'\"]</p>\n<p>These songs were  the recordings that got Buddy a contract with Decca Records in Nashville, which was, at the time, one of the biggest record labels in the country. And not only did he get signed to Decca, but Buddy also got a songwriting contract with Cedarwood Music, the publishing company that was jointly owned by Jim Denny, the man in charge of the bookings for the Grand Ole Opry, and Webb Pierce, one of the biggest country music stars of the period.</p>\n<p>So it must have seemed in January 1956 as if Buddy Holly was about to become a massive rock and roll star.</p>\n<p>That first Decca recording session took place in Owen Bradley's studio, and featured Sonny Curtis on guitar, and a friend called Don Guess on bass. The session was rounded out by two of the regular musicians that Bradley used on his sessions -- Grady Martin on rhythm guitar, so Buddy didn't have to sing and play at the same time, and Doug Kirkham on drums.</p>\n<p>The songs they cut at that initial session consisted of two of the songs they'd already demoed, \"Don't Come Back Knockin'\" and \"Love Me\", plus \"Blue Days, Black Nights\", a song written by Ben Hall, a friend of Buddy's from Lubbock. But it was the fourth song that was clearly intended to be the hit.</p>\n<p>We've talked before about the Annie songs, but that was back in March, so I'll give you a brief refresher here, and if you want more detail, go and listen to episode twenty-two, on \"The Wallflower\", which I'll link in the show notes.</p>\n<p>Back in 1954, Hank Ballard and the Midnighters had recorded a song called \"Work With Me Annie\", a song which had been, for the time, relatively sexually explicit, though it sounds like nothing now:</p>\n<p>[Excerpt: Hank Ballard and the Midnighters, \"Work With Me Annie\"]</p>\n<p>That song had started up a whole series of answer records. The Midnighters recorded a couple themselves, like \"Annie Had a Baby\":</p>\n<p>[Excerpt: Hank Ballard and the Midnighters, \"Annie Had a Baby\"]</p>\n<p>Most famously there was Etta James' \"The Wallflower\":</p>\n<p>[Excerpt: Etta James, \"The Wallflower\"]</p>\n<p>But there were dozens more songs about Annie -- there was \"Annie Met Henry\", \"Annie Pulled a Hum-Bug\", even \"Annie Kicked the Bucket\":</p>\n<p>[excerpt: the Nu Tones, \"Annie Kicked the Bucket\"]</p>\n<p>And the fourth song that Buddy recorded at this first Decca session, \"Midnight Shift\", was intended to be another in the Annie series. It was written by Luke McDaniel, a country singer who had gone rockabilly, and who recorded some unissued sides for Sun, like \"My Baby Don't Rock\":</p>\n<p>[Excerpt: Luke McDaniel, \"My Baby Don't Rock\"]</p>\n<p>Jim Denny had suggested \"Midnight Shift\" for Buddy -- though it seems a strange choice for commercial success, as it's rather obviously about a sex worker:</p>\n<p>[Excerpt: Buddy Holly, \"Midnight Shift\"]</p>\n<p>Perhaps the label had second thoughts, as \"Blue Days, Black Nights\" was eventually chosen as the single, rather than \"Midnight Shift\". When the paperwork for it came through for Buddy to sign, he discovered that they'd misspelled his name. He was born Charles Holley -- h-o-l-l-e-y -- but the paperwork spelled it h-o-l-l-y. As he was told they needed it back in a hurry, he signed it, and from then on he was Buddy Holly without the e.</p>\n<p>For the rest of 1956 Buddy continued recording with Owen Bradley for Decca, and kept having little success. Bradley became ever more disillusioned with Holly, while Paul Cohen, the executive at Decca who had signed Holly, at one point was telling his friends \"Buddy Holly is the biggest no talent I have ever worked with.\"</p>\n<p>One of the songs that he recorded during that time, but which wasn't released, was one that Owen Bradley described as \"the worst song I've ever heard\". It had been written by Holly and Joe Allison after they'd been to see the John Wayne film The Searchers -- a film which later gave the name to a band from Liverpool who would become hugely influential. Holly and Allison had seen the film several times, and they kept finding themselves making fun of the way that Wayne said one particular line:</p>\n<p>[Excerpt: The Searchers, John Wayne saying \"That'll Be The Day\"]</p>\n<p>They took that phrase and turned it into the title of a song. Unfortunately, the first recording of it wasn't all that great -- Buddy had been told by Webb Pierce that the way to have a hit single was to sing in a high voice, and so he sang the song far out of his normal range:</p>\n<p>[Excerpt: Buddy Holly, \"That'll Be The Day\"]</p>\n<p>Around this time, Sonny Curtis stopped working with Holly. Owen Bradley didn't like his guitar playing and wanted Holly to record with the session musicians he used with everyone else, while Curtis got an offer to play guitar for Slim Whitman, who at the time was about the biggest star in country music. So as 1956 drew to a close, Buddy Holly was without his longtime guitarist, signed to a record company that didn't know what to do with him, and failing to realise his musical ambitions.</p>\n<p>This is when Norman Petty entered the story.</p>\n<p>Petty was a former musician, who had performed crude experiments in overdubbing in the late forties, copying Les Paul and Mary Ford, though in a much less sophisticated manner. One of his singles, a version of Duke Ellington's \"Mood Indigo\", had actually been a minor hit:</p>\n<p>[Excerpt: The Norman Petty Trio, \"Mood Indigo\"]</p>\n<p>He'd gone into the recording studio business, and charged bands sixty dollars to record two songs in his studio -- or, if he thought the songs had commercial potential, he'd waive the charge if they gave him the publishing and a co-writing credit.</p>\n<p>Petty had become interested in rockabilly after having recorded Roy Orbison and the Teen Kings' first single -- the version of \"Ooby Dooby\" that was quickly deleted:</p>\n<p>[Excerpt: Roy Orbison and the Teen Kings, \"Ooby Dooby\", Je_Wel Records version]</p>\n<p>When he heard Sam Phillips' remake of the song, he became intrigued by the possibilities that echo offered, and started to build his own echo chamber -- something that would eventually be completed with the help of Buddy Holly and Buddy's father and brother. Petty recorded another rockabilly group, Buddy Knox and the Rhythm Orchids, on a song, \"Party Doll\", that went to number one:</p>\n<p>[Excerpt: Buddy Knox and the Rhythm Orchids, \"Party Doll\"]</p>\n<p>When the Rhythm Orchids passed through Lubbock, they told Buddy about Norman Petty's studio, and Buddy went there to cut some demos. Petty was impressed by Holly -- though he was more impressed by Sonny Curtis, who was still with Buddy for those demo sessions -- and when his contract with Decca expired, Petty and Holly agreed to work together.</p>\n<p>But they had a problem. Buddy's contract with Decca said that even though they'd only released two singles by him, and hadn't bothered to release any of the other songs he'd recorded during the year he was signed to them, he couldn't rerecord anything he'd recorded for them for another five years. Buddy tried to get Paul Cohen to waive that clause in the contract, and Cohen said no. Holly asked if he could speak to Milt Gabler instead -- he was sure that Gabler would agree. But Cohen explained to him that Gabler was only a vice president, and that he worked for Cohen. There was no way that Buddy Holly could put out a record of any of the songs he had recorded in 1956.</p>\n<p>So Norman Petty, who had been secretly recording the conversation, suggested a way round the problem. They could take those songs, and still have Holly sing them, but put them out as by a group, rather than a solo singer. It wouldn't be Buddy Holly releasing the records, it would be the group.</p>\n<p>But what should they call the group? Buddy and Jerry Allison both really liked New Orleans R&B -- they loved Fats Domino, and the other people that Dave Bartholomew worked with -- and they particularly liked a song that Bartholomew had co-written for a group called the Spiders:</p>\n<p>[Excerpt: The Spiders, \"Witchcraft\"]</p>\n<p>So they decided that they wanted a name that was something like the Spiders. At first they considered \"the Beetles\", but decided that that was too creepy -- people would want to squish them. So they settled on The Crickets. And so the version of \"That'll Be The Day\" that Buddy, Larry, Jerry, and Niki Sullivan had recorded with Norman Petty producing was going to be released as by the Crickets, and Buddy Holly's name was going to be left off anything that the heads at Decca might see.</p>\n<p>Amusingly, the record ended up released by Decca anyway -- or at least by a subsidiary of Decca.</p>\n<p>Norman Petty shopped the demos they'd made around different labels, and eventually he took them to Bob Thiele. Thiele had had a similar career to Milt Gabler -- he'd started out as a musician, then he'd formed his own speciality jazz label, Signature, and had produced records like Coleman Hawkins' \"The Man I Love\":</p>\n<p>[Excerpt: Coleman Hawkins, \"The Man I Love\"]</p>\n<p>Like Gabler, he had been taken on by Decca, which of all the major labels was the only one that really understood the way that the music business was changing. He'd been put in charge of two labels owned by Decca -- Coral, which was being used mostly for insipid white cover versions of black acts, and Brunswick, which was where he released rockabilly tracks by Johnny Burnette and the Rock and Roll Trio.</p>\n<p>The Crickets were clearly a Brunswick group, and so \"That'll Be the Day\" was going to be released on Brunswick -- and the contract was sent to Jerry Allison, not Buddy Holly. Holly's name wasn't mentioned at first, in case Thiele decided to mention it to his bosses and the whole thing was blown.</p>\n<p>Norman Petty had assumed that what they'd recorded so far was just going to be a demo, but Thiele said that no, he thought what they had was fine as it was, and put this out:</p>\n<p>[Excerpt: The Crickets, \"That'll Be The Day\"]</p>\n<p>But the Crickets had still not properly finalised their lineup. The core of Holly and Allison was there -- the two of them had been playing together for years -- and Niki Sullivan would be OK on rhythm guitar, but they needed a permanent bass player. They eventually settled on Joe B. Mauldin, who had played with a group called The Four Teens that had also featured Larry Welborn. Joe B. had sat in on a gig with the other three, and they'd been impressed with his bass playing. </p>\n<p>Before \"That'll Be the Day\" was released, they were already in the studio cutting more songs. One was a song that had originally been written by Holly's mother, though she refused to take credit for it -- she was a fundamentalist Southern Baptist, and rock and roll was the Devil's music. She was just about okay with her son playing it, but she wasn't going to get herself involved in that. So Buddy took his mother's song and turned it into this:</p>\n<p>[Excerpt: The Crickets, \"Maybe Baby\"]</p>\n<p>And at the same time, they also made an agreement that Holly could record solo material for Coral. That would actually be recorded by the same people who were making the Crickets' records, but since he was coming up with so many new songs, they might as well use them to get twice as much material out -- there was no prohibition, after all, on him recording new songs under his own name, just the ones he'd recorded in 1956.</p>\n<p>And they were recording a ludicrous amount of material. \"That'll Be The Day\" still hadn't been released, and they already had their next single in the bag, and were recording Buddy's first solo single. That song was based on \"Love is Strange\" by Mickey and Sylvia, a favourite of Holly's:</p>\n<p>[Excerpt: Mickey and Sylvia, \"Love is Strange\"]</p>\n<p>Holly took that basic musical concept and turned it into \"Words of Love\":</p>\n<p>[Excerpt: Buddy Holly, \"Words of Love\"]</p>\n<p>That wasn't a hit for Holly, but even before his version was released, the Diamonds, who usually made a habit of recording tracks originally recorded by black artists, released a cover version, which went to number thirteen:</p>\n<p>[Excerpt: The Diamonds, \"Words of Love\"]</p>\n<p>The Crickets were essentially spending every second they could in Petty's studio. They were also doing session work, playing on records by Jim Robinson, Jack Huddle, Hal Goodson, Fred Crawford, and more. In the early months of 1957, they recorded dozens upon dozens of songs, which would continue being released for years afterwards. For example, just two days after \"That'll Be the Day\" was finally released, at the end of May, they went into the studio and cut another song they had patterned after Bo Diddley, who had co-written \"Love is Strange\",  as a Crickets side:</p>\n<p>[Excerpt: The Crickets, \"Not Fade Away\"]</p>\n<p>and, on the same day, a Holly solo side:</p>\n<p>[Excerpt: Buddy Holly, \"Every Day\"]</p>\n<p>All these songs were written by Holly and Allison, sometimes with Mauldin helping, but the songwriting credits didn't really match that. Sometimes one or other name would get missed off the credits, sometimes Holly would be credited by his middle name, Hardin, instead of his surname, and almost always Norman Petty would end up with his name on the songwriting credits.</p>\n<p>They weren't that bothered about credit, for the moment -- there was always another song where the last one came from, and they were piling up songs far faster than they could release them.</p>\n<p>Indeed, only a month after the \"Not Fade Away\" and \"Every Day\" session, they were back in the studio yet again, recording another song, which Buddy had originally intended to name after his niece, Cindy Lou. Jerry, on the other hand, thought the song would be better if it was about his girlfriend.</p>\n<p>And you'll be able to find out what happened after they decided between Cindy Lou and Peggy Sue in a few weeks' time...</p>",
  "enclosure": "",
  "itunes:summary": "Episode sixty-one of A History of Rock Music in Five Hundred Songs looks at \"That'll Be the Day\" by The Crickets. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bonus episode available, on \"Rudolph the Red-Nosed Reindeer\" by Gene Autry\n\nErrata\nI say in here that Larry Welborn lent Holly a thousand dollars. That money was actually lent Holly by his brother, also called Larry.\nI also at one point say \"That'll Be the Day\" was co-written by Joe Allison. I meant Jerry Allison, of course -- Joe Allison was also a Texan songwriter, but had no involvement in that song.\nResources\nAs usual, I've created a Mixcloud mix with all the recordings excerpted here.\nI've used two biographies for the bulk of the information here -- Buddy Holly: Learning the Game, by Spencer Leigh, and Rave On: The Biography of Buddy Holly by Philip Norman. \nThere are many collections of Buddy Holly's work available, but many of them are very shoddy, with instrumental overdubs recorded over demos after his death. The best compilation I am aware of is The Memorial Collection, which contains almost everything he issued in his life, as he issued it (for some reason two cover versions are missing) along with the undubbed acoustic recordings that were messed with and released after his death.\nA lot of the early recordings with Bob, Larry, and/or Sonny that I reference in this episode are included in Down The Line: Rarities, a companion set to the Memorial Collection.\nPatreon\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\nTranscript\nAnd so, far later in the story than many people might have been expecting, we finally come to Buddy Holly, the last of the great fifties rockers to appear in our story. Nowadays, Holly gets counted as a pioneer of rock and roll, but in fact he didn't turn up until the genre had become fairly well established in the charts.\nWhich is not to say that he wasn't important or innovative, just that he was one of the greats of the second wave -- from a twenty-first-century perspective, Buddy Holly looks like one of the people who were there when rock and roll was invented, but by the time he had his first hit, Bill Haley, Carl Perkins, and Gene Vincent had all had all their major chart hits, and were on their way down and out. Little Richard was still touring, but he'd already recorded his last rock and roll record of the fifties, and while Fats Domino was still making hit records, most of the ones he's remembered by, the ones that changed music, had already been released.\nBut Holly was arguably the most important figure of this second wave, someone who, more than any other figure of the mid-fifties, seems at least in retrospect to point the way forward to what rock music would become in the decade after.\nSo today we're going to look at the story of how the first really successful rock group started. Because while these days, \"That'll Be The Day\" is generally just credited to \"Buddy Holly\", at the time the record came out, it didn't have any artist name on it other than that of the band that made it, The Crickets:\n[Excerpt: The Crickets, \"That'll Be the Day\"]\nCharles Hardin Holley grew up in Lubbock, Texas, a town in the middle of nowhere that has produced more than its fair share of famous musicians. Other than Buddy Holly, the two most famous people from Lubbock are probably Waylon Jennings, who briefly played in Holly's band in 1959 before going on to his own major successes, and Mac Davis, who wrote several hits for Elvis before going on to become a country singer of some note himself.\nHolly grew up with music. His elder brothers performed as a country duo in much the same style as the Louvin Brothers, and there's a recording of Holly singing the old country song, \"Two Timin' Woman\", in 1949, when he was twelve, before his voice had even broken:\n[Excerpt: Charles Holley, \"Two Timin' Woman\"]\nBy his mid-teens",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode sixty-one of A History of Rock Music in Five Hundred Songs looks at \"That'll Be the Day\" by The Crickets. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bonus episode available, on \"Rudolph the Red-Nosed Reindeer\" by Gene Autry\n\nErrata\nI say in here that Larry Welborn lent Holly a thousand dollars. That money was actually lent Holly by his brother, also called Larry.\nI also at one point say \"That'll Be the Day\" was co-written by Joe Allison. I meant Jerry Allison, of course -- Joe Allison was also a Texan songwriter, but had no involvement in that song.\nResources\nAs usual, I've created a Mixcloud mix with all the recordings excerpted here.\nI've used two biographies for the bulk of the information here -- Buddy Holly: Learning the Game, by Spencer Leigh, and Rave On: The Biography of Buddy Holly by Philip Norman. \nThere are many collections of Buddy Holly's work available, but many of t",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}