{
  "title": "Show what you know with the new ChromeOS administrator certification",
  "link": "https://blog.google/outreach-initiatives/education/chromeos-admin-certification/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"hqabw\">Around the world, ChromeOS admins are hard at work, collectively managing 50 million students and educators using Chromebooks and other ChromeOS devices. Some of them are looking after huge fleets across entire school districts, and others are just starting out.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"hqabw\">Whatever size or type of organization they support as ChromeOS admins, we’re here to make life a little easier for them with a range of new policies and updates. We’re also announcing a new Professional ChromeOS Administrator certification, to recognize and reward their ChromeOS expertise.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3 data-block-key=\"hqabw\">Configure policies using Google Groups</h3><p data-block-key=\"crfbk\">We’re always adding new policies in Google Admin Console, and now have more than 600 to help customize and curate environments for different schools’ and organizations’ unique needs.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"hqabw\">To make it easier to configure apps and extension permissions, we’ve introduced <a href=\"https://support.google.com/chrome/a/answer/6177447\">group-based policies</a> for new and existing Google groups. Now if an admin needs to install an app for a specific set of users — who may or may not belong to different organizational units — they can simply add them to a group instead of moving them into a new organizational unit.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"hqabw\">Here’s how it could play out in a school. Imagine a small group of students needs access to an app for Science Club. These students are from different grades, so they belong to different organizational units — let’s call them Third Grade, Fourth Grade and Fifth Grade. Instead of setting the app policy as “Allow Install” for all kids in those grades (and then hoping the right kids will install the app themselves), you can create a group-based policy that sets the science app to “Force Install” onto the devices of students in Science Club.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"hqabw\">On the flip side, if a group of students were getting distracted by an app or abusing it, you could create a custom group to block their access — without having to disable it for all students.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"hqabw\">Group-based policies not only reduce the time and effort involved in configuring apps and extensions, but also help avoid the forced install of apps to entire organizational units, saving valuable disk space and network bandwidth.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"Gif showing the benefits of group based policy in Google Admin Console\" class=\"article-image--large\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/Save_the_clicks.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3 data-block-key=\"hqabw\">Become a certified ChromeOS administrator</h3><p data-block-key=\"4k219\">We’ve long been asked about creating a certification for proficiency in administering for ChromeOS, much like our <a href=\"https://cloud.google.com/certification/google-workspace-administrator\">certification</a> for Google Workspace admins. Certifications not only are great for training, but also help with career development and progression and help establish professional credibility. According to the <a href=\"https://images.globalknowledge.com/wwwimages/web/salary-report/current/it-skills-salary-report-2021-skillsoft-global-knowledge-en-ww.pdf\">Global Knowledge IT Skills and Salary Report</a>, certified IT professionals earn more than non-certified peers, and the more certifications, the higher the salary. Today, we’re introducing a new <a href=\"http://chromeoscertification.com/chromeos-administrator\">Professional ChromeOS Administrator certification</a>. It’s a great opportunity for people to demonstrate their skills as a ChromeOS IT admin, and earn a badge that proves proficiency to peers and prospective employers.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"hqabw\">Designed for enterprise and education systems administrators, and junior engineers with at least one year of holistic IT infrastructure experience, the three-hour exam has 50 multiple choice questions and 30 hands-on lab questions. Test-takers have 90 minutes to complete each section. The exam assesses the ability to perform actions from Google Admin Console, including configuring ChromeOS policies and understanding the tenets of ChromeOS.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"hqabw\">For the next 12 months, to help organizations build highly skilled and effective teams, Google is waiving the $125 fee and offering the Professional ChromeOS Administrators exam for free to all enterprise and education IT admins. The exam is English only to start, and will be offered in Japanese in early 2023.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"hqabw\"><b>Find more information about repairing devices</b></p><p data-block-key=\"bm2gj\">With 40 million students and educators using Chromebooks, it can be challenging for school IT administrators to find information about which devices they can repair. As part of the Chromebook repair program, we’re partnering with companies like Acer and Lenovo, and now CTL, to spotlight more Chromebooks that are repairable. On <a href=\"https://edu.google.com/chromebooks/chromebook-repairability/?utm_source=google&amp;utm_medium=website&amp;utm_campaign=crp&amp;topic=acer\">our site</a>, schools can easily identify which Chromebooks have commonly repaired components, and find information on how to get them repaired. We’ll continue to expand the program globally soon.</p></div></div></body></html>",
  "pubDate": "Mon, 17 Oct 2022 16:00:00 +0000",
  "guid": "https://blog.google/outreach-initiatives/education/chromeos-admin-certification/",
  "category": [
    "Education",
    "Chromebooks"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Show what you know with the new ChromeOS administrator certification",
    "description": "",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/EDU___ChromeOS_Admin_Certification_-_Blog_he.max-600x600.png",
    "site_name": "Google",
    "url": "https://blog.google/outreach-initiatives/education/chromeos-admin-certification/"
  },
  "author": {
    "name": "Leah Coleman",
    "title": "Global Head of Partner Training & Enablement, ChromeOS",
    "department": "",
    "company": ""
  }
}