{
  "title": "Beyond Instance Discrimination: Relation-aware Contrastive Self-supervised Learning. (arXiv:2211.01796v1 [cs.CV])",
  "link": "http://arxiv.org/abs/2211.01796",
  "description": "<p>Contrastive self-supervised learning (CSL) based on instance discrimination\ntypically attracts positive samples while repelling negatives to learn\nrepresentations with pre-defined binary self-supervision. However, vanilla CSL\nis inadequate in modeling sophisticated instance relations, limiting the\nlearned model to retain fine semantic structure. On the one hand, samples with\nthe same semantic category are inevitably pushed away as negatives. On the\nother hand, differences among samples cannot be captured. In this paper, we\npresent relation-aware contrastive self-supervised learning (ReCo) to integrate\ninstance relations, i.e., global distribution relation and local interpolation\nrelation, into the CSL framework in a plug-and-play fashion. Specifically, we\nalign similarity distributions calculated between the positive anchor views and\nthe negatives at the global level to exploit diverse similarity relations among\ninstances. Local-level interpolation consistency between the pixel space and\nthe feature space is applied to quantitatively model the feature differences of\nsamples with distinct apparent similarities. Through explicitly instance\nrelation modeling, our ReCo avoids irrationally pushing away semantically\nidentical samples and carves a well-structured feature space. Extensive\nexperiments conducted on commonly used benchmarks justify that our ReCo\nconsistently gains remarkable performance improvements.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Zhang_Y/0/1/0/all/0/1\">Yifei Zhang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_C/0/1/0/all/0/1\">Chang Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhou_Y/0/1/0/all/0/1\">Yu Zhou</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_W/0/1/0/all/0/1\">Weiping Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ye_Q/0/1/0/all/0/1\">Qixiang Ye</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ji_X/0/1/0/all/0/1\">Xiangyang Ji</a>"
}