{
  "title": "#487: The Scariest Moments in Harry Potter",
  "link": "https://audioboom.com/posts/7709107",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4672,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>It's our annual Halloween episode and we discuss the scariest moments in the Harry Potter series!</li>\n<li>Some our favorite past Halloween episodes have included Episode 61: <a href=\"https://www.mugglecast.com/episode-61/\">Ghosts</a> in Harry Potter and Episode 343: <a href=\"https://www.mugglecast.com/episode-343-fantastic-beasts-not-2/\">Halloween Happening</a>!</li>\n<li>In Sorcerer's Stone: Fluffy and Professor Quirrell's death are just two of the most terrifying moments for 11-year-old Harry.</li>\n<li>Aragog, the Baslisk, Tom Riddle's possession of Ginny and Gilderoy Lockhart - could Chamber of Secrets be the scariest book in the series?</li>\n<li>With werewolves, mass murderers, death omens and dementors, Prisoner of Azkaban certainly holds its own!</li>\n<li>Goblet of Fire gave us Death Eaters at the Quidditch World Cup, the madness of Mr. Crouch, an impostor professor and the return of Voldemort!</li>\n<li>Terrifying gets taken to new level with Dolores Umbridge in Order of the Phoenix!</li>\n<li>Did Inferi, Horcruxes, Dumbledore reliving his worst memory or Katie Bell's attack give us the biggest scare in Half-Blood Prince?</li>\n<li>We can't conclude the discussion without mentioning Bathilda \"Nagini\" Bagshot and Bellatrix's torture of Hermione in Deathly Hallows!</li>\n<li>Acromantulas, Lethifolds, Kelpies and more! The hosts muster up their best Halloween voices to describe some of the creepiest beasts in the Harry Potter series!</li>\n<li>Quizzitch: How many Muggles did the Opal Necklace reportedly kill?</li>\n<li>PSA for the USA: Many voter registration deadlines are approaching in the United States. Please make sure you are registered to vote in your state right now by visiting <a href=\"http://www.iwillvote.com\">IWillVote.com</a>. You can also find out great ballot information at <a href=\"http://www.ballotready.org\">BallotReady.org</a> and sign up to be a poll worker at <a href=\"http://www.powerthepolls.org\">PowerThePolls.org</a>.</li>\n<li>This week's episode is sponsored by Peacock TV (watch the Harry Potter movies for free, all October long!) and Quip  (Visit <a href=\"http://getquip.com/Muggle\">GetQuip.com/Muggle</a> and get your first refill free)!</li>\n<li>Support us on Patreon and receive magical benefits, like Bonus MuggleCast, where this week, in celebration of Halloween, the hosts share their Boggarts!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 20 Oct 2020 11:00:00 +0000",
  "guid": "tag:audioboom.com,2020-10-19:/posts/7709107",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}