{
  "id": "yt:video:cFGholZu7Sc",
  "yt:videoId": "cFGholZu7Sc",
  "yt:channelId": "UCF12zIL-CqStBeQtB6MTr8A",
  "title": "Digital game-based learning for second language acquisition: Walkthrough of Battlefield 2142",
  "link": "",
  "author": {
    "name": "The German Professor",
    "uri": "https://www.youtube.com/channel/UCF12zIL-CqStBeQtB6MTr8A"
  },
  "published": "2016-10-14T16:38:05+00:00",
  "updated": "2022-07-24T10:04:27+00:00",
  "media:group": {
    "media:title": "Digital game-based learning for second language acquisition: Walkthrough of Battlefield 2142",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Download the game here: http://bit.ly/2eoY8RJ\nRead research on the game here: http://bit.ly/2ee8W0q\nAbout the series producer: https://doktorfrag.wordpress.com\n\nRe-rendered high definition video with closed captioning explains how I came upon the idea of using digital game-based learning approaches for second language acquisition. Original screen recording was made on 28 April 2010. In the video I mention that I intend to make a game for teaching German language and culture; links to the game and a research article on the game are listed above. The article reports on a mixed-methods study evaluating the use of a three-dimensional digital game-based language learning (3D-DGBLL) environment to teach German two-way prepositions and specialized vocabulary within a simulated real-world context of German recycling and waste management systems. The study assumed that goal-directed player activity in this environment would configure digital narratives, which in turn would help study participants in the experimental group to co-configure story maps for ordering and making sense of the problem spaces encountered in the environment. The study further assumed that these participants would subsequently rely on the story maps to help them structure written L2 narratives describing an imagined personal experience closely resembling the gameplay of the 3D-DGBLL environment. The study found that immersion in the 3D-DGBLL environment influenced the manner in which the second language was invoked in these written narratives: Participants in the experimental group produced narratives containing more textual indicators describing the activity associated with the recycling and waste management systems and the spaces in which these systems are located. Increased usage of these indicators suggest that participants in the experimental group did indeed rely on story maps generated during 3D gameplay to structure their narratives, although stylistic and grammatical features of the narratives suggest, however, that changes could be made to the curricular implementation of the 3D-DGBLL environment. The study also puts forward ideas for instructional best practices based on research findings and suggests future areas of development and investigation.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}