{
  "title": "Racial Wealth Disparities: Reconsidering the Roles of  Human Capital and Inheritance",
  "link": "https://fedinprint.org/item/fedbwp/93709/original",
  "description": "In this paper, we present updated measures of racial disparities in wealth using the most recent data from the Survey of Consumer Finances (SCF), augmented by household-level estimates of defined benefit (DB) pension wealth developed by Sabelhaus and Volz (2020). Including this important asset, we find that racial wealth disparities are smaller than the numbers typically discussed in other research or in the media, but the disparities remain substantial. The paper proceeds by exploring two specific factors that have long been identified as playing potentially important roles in generating disparities in wealth by race, namely differences in earnings (education/human capital) and intergenerational transfers in the form of inheritances and inter vivos gifts. We contribute to the existing literature by introducing several data innovations in the exploration of these factors using the SCF. We augment the SCF data with individual-level lifetime earnings histories (developed by Jacobs et al. 2020, 2021) and enhanced measures of intergenerational transfers (developed by Feiveson and Sabelhaus 2018, 2019). We also create an expanded set of variables that reflect the range of pension coverage and generosity across workers. With all three of these new data components, we use non-parametric decomposition techniques to estimate their contributions to racial wealth gaps between white and non-white families. Differences in lifetime earnings, pension generosity, and a handful of other human capital and work-related variables explain three-quarters of the white/Black wealth gap and 80 to 90 percent of the white/Hispanic gap. Reweighting white family wealth to match the distribution of human capital traits of families of “other” races (including Asian, Native American and other groups) raises counterfactual white wealth to the level of “other” family wealth, nearly closing the white/“other” gap. Differences in intergenerational transfers are found to account for 13 to 16 percent of white/non-white private wealth gaps, although much of the influence of these transfers likely works through the human capital channel. Policies that successfully increase skills, employment, earnings, and pension coverage among low-wealth Black and Hispanic families will make important contributions to closing wealth gaps.",
  "guid": "https://fedinprint.org/item/fedbwp/93709/original",
  "dc:creator": "Sabelhaus, John Edward; Thompson, Jeffrey P.",
  "dc:date": "2021-09-01",
  "rdau:hasExtent": 104,
  "dc:subject": "racial wealth gap; inequality; human capital; lifetime earnings; retirement plans; pensions; inheritance",
  "swpo:hasNumber": "22-3",
  "identifiers:doi": "10.29412/res.wp.2022.03",
  "bibo:series": "Working Papers"
}