{
  "title": "Episode 29: &#8220;Maybellene&#8221; by Chuck Berry",
  "link": "https://500songs.com/podcast/episode-29-maybellene-by-chuck-berry/",
  "pubDate": "Mon, 22 Apr 2019 22:29:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=667",
  "description": "Welcome to episode twenty-nine of <em>A History of Rock Music in Five Hundred Songs</em>. This is the second of our three-part look at Chess Records, and focuses on \"Maybellene\" by Chuck Berry. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-29-maybellene/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI reference three previous episodes here --<a href=\"https://www.500songs.com/e/episode-28-sincerely-by-the-moonglows/#more-11403812\"> last week's</a>, the <a href=\"https://www.500songs.com/e/episode-2a-a-disclaimer/\">disclaimer episode,</a> and the episode on<a href=\"https://www.500songs.com/e/episode-3-ida-red/\"> Ida Red</a>.\n\nI used three main books as reference here:\n\n<a href=\"https://amzn.to/2KW58Gj\"><em>Brown Eyed Handsome Man: The Life and Hard Times of Chuck Berry</em> by Bruce Pegg</a> is a good narrative biography of Berry, which doesn't shy away from the less salubrious aspects of his personality, but is clearly written by an admirer.\n\n<a href=\"https://amzn.to/2vgii6n\"><em>Long Distance Information: Chuck Berry's Recorded Legacy </em>by Fred Rothwell</a> is an extraordinarily researched look at every single recording session of Berry's career up to 2001.\n\nAnd for information on Chess, I used <a href=\"https://amzn.to/2VlkE2c\"><em>The Record Men: Chess Records and the Birth of Rock and Roll</em> by Richard Cohen.</a> I wouldn't recommend that book, however -- while it has some useful interview material and anecdotes from those involved, Cohen gets some basic matters of fact laughably wrong, and generally seems to be more interested in showing off his prose style than fact-checking.\n\nThere are a myriad Chuck Berry compilations available. The one I'd recommend if you don't have a spare couple of hundred quid for the complete works box set is <a href=\"https://amzn.to/2ZpsF5A\">the double-CD <em>Gold</em></a>, which has every major track without any of the filler.\n\nAnd if you want to check out more of Willie Dixon's material, <a href=\"https://amzn.to/2vi7Qel\">this four-CD set</a> contains a hundred records he either performed on as an artist, played on as a session player, wrote, or produced. It's the finest body of work in post-war blues.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\n[Intro: Alan Freed introducing Chuck Berry and Maybellene]\n\nWelcome to the second part of our trilogy on Chess Records. This week, we're going to talk about the most important single record Chess ever put out, and arguably the most important artist in the whole history of rock music.\n\nBut first, we're going to talk about something a lot more recent. We're going to talk about \"Old Town Road,\" by Lil Nas X. For those of you who don't follow the charts and the music news in general, \"Old Town Road\" is a song put out late last year by a rapper, but it reached number nineteen in the country charts. Because it's a country song:\n\n[Excerpt: \"Old Town Road\" by Lil Nas X]\n\nThat's a song with banjo and mandolin, with someone singing in a low Johnny Cash style voice about riding a horse while wearing a cowboy hat. It's clearly country music if anything at all is country music. But it was taken off the country music charts the week it would otherwise have made number one, in a decision that Billboard was at pains to say was nothing at all to do with his race.\n\nA hint -- if you have to go to great lengths to say that the thing you're doing isn't racist, it's probably racist.\n\nBecause genre labels have always been about race, and about policing racial boundaries in the US, since the very beginning. Remember that when Billboard started the R&B charts they were called the \"race music\" charts. You had the race music charts for black people, the country charts for lower-class whites, and the pop charts for the respectable white people. That was the demarcation, and that still is the demarcation.\n\nBut people will always want to push against those constraints. And in the 1950s, just like today, there were black people who wanted to make country music. But in the 1950s, unlike today, there was a term for the music those people were making. It was called rock and roll. For about a decade, from roughly 1955 through 1965, \"rock and roll\" became a term for the music which disregarded those racial boundaries. And since then there has been a slow but sure historical revisionism. The lines of rock and roll expand to let in any white man, but they constrict to push out the women and black men who were already there. But there's one they haven't yet been able to push out, because this particular black man playing country music was more or less the embodiment of rock and roll.\n\nChuck Berry was, in many ways, not at all an admirable man. He was one of all too many rock and roll pioneers to be a sex offender (and again, please see the disclaimer episode I did close to the start of this series, for my thoughts about that -- nothing I say about his work should be taken to imply that I think that work mitigates some of the awful things he did) and he was also by all accounts an unpleasant person in a myriad other ways. As I talked about in the disclaimer episode, we will be dealing with many awful people in this series, because that's the nature of the history of rock and roll, but Chuck Berry was one of the most fundamentally unpleasant, unlikeable, people we'll be looking at. Nobody has a good word to say about him as a human being, and he hurt a lot of people over his long life. When I talk about his work, or the real injustices that were also done to him, I don't want to forget that.\n\nBut when it comes to rock and roll, Chuck Berry may be the single most important figure who ever lived, and a model for everyone who followed.\n\n[Excerpt: “Maybellene”, just the intro]\n\nTo talk about Chuck Berry, we first of all have to talk about Johnnie Johnson. Johnnie Johnson was a blues piano player, who had got a taste of life as a professional musician in the Marines, where he'd played in a military band led by Bobby Troup, the writer of \"Route 66\" among many other songs. After leaving the Marines, he'd moved around the Midwest, playing blues in various bands, before forming his own trio, the Johnnie Johnson Trio, in St Louis.\n\nThat trio consisted of piano, saxophone, and drums -- until New Year's Eve 1952, when the saxophone player had a stroke and couldn't play. Johnson needed another musician to play with the trio, and needed someone quick, but it was New Year's Eve -- every musician he could think of would be booked up. Except for Chuck Berry. Berry was a guitarist he vaguely knew, and was different in every way from Johnson. Where Johnson was an easy-going, fat, jovial, man, who had no ambitions other than to make a living playing boogie-woogie piano, Chuck Berry had already served a term in prison for armed robbery, was massively ambitious, and was skinny as a rake. But he could play the guitar and sing well enough, and the customers had hired a trio, not a duo, and so Chuck Berry joined the Johnnie Johnson Trio.\n\nBerry soon took over the band, as Johnson, a relatively easy-going person, saw that Berry was so ambitious that he would be able to bring the band greater success than they would otherwise have had. And also, Berry owned a car, which was useful for transporting the band to gigs. And so the Johnnie Johnson trio became the Chuck Berry Trio.\n\nBerry would also play gigs on the side with other musicians, and in 1954 he played guitar on a session for a calypso record on a local independent label:\n\n[Excerpt: \"Oh Maria\", Joe Alexander and the Cubans]\n\nHowever, when Berry tried to get that label to record the Chuck Berry Trio, they weren't interested. But then Berry drove to Chicago to see one of his musical heroes, Muddy Waters. We've talked about Waters before, but only in passing -- but Waters was, by far, the biggest star in the Chicago electric blues style, whose driving, propulsive, records were more accessible than Howlin' Wolf but still had some of the Delta grit that was missing from the cleaner sounds of people like T-Bone Walker. Berry stayed after the show to talk to his idol, and asked him how he could make records like Waters did. Waters told him to go and see Leonard Chess at Chess Records. Berry went to see Chess, who asked if Berry had a demo tape. He didn't, but he went back to St Louis and came back the next week with a wire recording of four newly-recorded songs. The first thing he played was a blues song he'd written called \"The Wee Wee Hours\":\n\n[excerpt: Chuck Berry, \"The Wee Wee Hours\"]\n\nThat was too generic for Chess -- and the blues they put out tended to be more electric Chicago blues, rather than the Nat Cole or Charles Brown style Berry was going for there. But the next song he played had them interested.\n\nBerry had always been interested in playing as many different styles of music as he could -- he was someone who was trying to incorporate the sounds of Louis Jordan, Muddy Waters, Charlie Christian, and Nat \"King\" Cole, among others. And so as well as performing blues, jazz, and rhythm and blues music, he'd also incorporated a fair amount of country and western music in his shows. And in particular, he was an admirer of Bob Wills and his Texas Playboys, and he would perform their song \"Ida Red\" in shows, where it always went down well.\n\nWe already had an entire episode of the podcast on \"Ida Red\", which I'll link in the liner notes to this, but as a quick reminder, it's an old folk song, or collection of folk songs, that had become a big hit for Bob Wills, the Western Swing fiddle player:\n\n[Excerpt: \"Ida Red\", Bob Wills and his Texas Playboys]\n\nBerry would perform that song live, but messed around and changed the lyrics a lot -- he eventually changed the title to \"Ida May\", for a start -- and when he performed the song for Leonard Chess, Chess thought it sounded great. There was only one problem -- he thought the name made it too obvious where Berry had got the idea, and he wanted it to sound more original. They tried several names and eventually hit on \"Maybellene\", after the popular cosmetics brand, though they changed the spelling.\n\n\"Ida Red\" wasn't the only influence on \"Maybellene\" though, there was another song called \"Oh Red\", a hokum song by the Harlem Hamfats:\n\n[Excerpt: \"Oh Red\", the Harlem Hamfats]\n\nLarry Birnbaum, in \"Before Elvis\", suggests that this was the *only* influence on \"Maybellene\", and that Berry was misremembering the song, as both songs have \"Red\" in the titles. I disagree -- I think it's fairly clear that \"Maybellene\" is inspired both by \"Ida Red\"s structure and patter-lyric verse and by \"Oh Red\"s chorus melody. And it wasn't just Bob Wills' version of “Ida Red” that inspired Berry. There's a blues version, by Bumble Bee Slim, which has a guitar break that isn't a million miles away from what Berry was doing:\n\n[Excerpt: \"Ida Red\", Bumble Bee Slim]\n\nAnd there's another influence as well. Berry's lyrics were about a car chase -- to try to catch up with a cheating girlfriend -- and are the thing that makes the song so unique. They -- and the car-horn sound of the guitar -- seem to have been inspired by a hillbilly boogie song called \"Hot Rod Racer\" by Arkie Shibley and his Mountain Dew Boys:\n\n[Excerpt: \"Hot Rod Racer\", Arkie Shibley and his Mountain Dew Boys]\n\nThat had been a successful enough country song that it spawned at least three hit cover versions, including one by Red Foley.\n\nBerry took all these Western Swing, blues, and hillbilly boogie influences and turned them into something new:\n\n[Excerpt: Chuck Berry, \"Maybellene\"]\n\nEven this early, you can already see the Chuck Berry style fully formed. Clean blues guitar, as clean as someone like T-Bone Walker, but playing almost rockabilly phrases -- this is closer to the style of Elvis' Sun records than it is to anything else that Chess were putting out -- and punning, verbose, witty lyrics talking about something that would have a clear appeal to people half his age. All of future rock is right there.\n\nThe lineup on the record was the Chuck Berry trio -- Berry on guitar, Johnson on piano, and Ebby Hardy on drums -- augmented by two other musicians. Jerome Green, the maraca player, is someone we'll be talking about next week, but we should here talk a bit about Willie Dixon, the bass player, because he is probably the single most important figure in the whole Chess Records story.\n\nDixon had started out as a boxer -- he'd been Joe Louis' sparring partner -- before starting to play a bass made out of a tin can and a single string for him by the blues pianist Leonard Caston. Dixon and Caston formed an Ink Spots-style group, \"The Five Breezes\":\n\n[Excerpt: \"Sweet Louise\", the Five Breezes]\n\nBut when America joined in World War II, Dixon's music career went on hold, as he was a conscientious objector, unwilling to fight in defence of a racist state, and so he spent ten months in prison. He joined Chess in 1951 shortly after Leonard Chess took over full control of the company by buying out its original owner -- right after the club Chess had been running had mysteriously burned down, on a day it was closed, giving him enough insurance money to buy the whole record company.\n\nAnd Dixon was necessary because among Leonard Chess' flaws was one fatal one -- he had no idea what real musical talent was or how to find it. But he *did* have the second-order ability to find people who could recognise real musical talent when they heard it, and the willingness to trust those people's judgement. And Dixon was not only a real talent himself, but he could bring out the best in others, too.\n\nDixon was, effectively, the auteur behind almost everything that Chess Records put out. As well as a session bass player who played on almost every Chess release that wasn't licensed from someone else, he was also their staff producer, talent scout, and staff songwriter, as well as a solo artist under his own name. He wrote and played on hits for Muddy Waters, Howlin' Wolf, Sonny Boy Williamson II, Little Walter, Koko Taylor, Bo Diddley, Elmore James... to all intents and purposes, Willie Dixon *was* the Chicago blues, and when the second generation of rock and rollers started up in the 1960s -- white boys with guitars from England -- it was Willie Dixon's songs that formed the backbone of their repertoire.\n\nJust a few of the songs he wrote that became classics include \"Little Red Rooster\" for Howlin' Wolf:\n\n[Excerpt: Howlin' Wolf, \"Little Red Rooster\"]\n\n\"Bring it on Home\" for Sonny Boy Williamson II\n\n[Excerpt: Sonny Boy Williamson II, \"Bring it on Home\"]\n\n\"You Need Love\" for Muddy Waters\n\n[Excerpt: Muddy Waters, \"You Need Love\"]\n\nYou get the idea. In any other session he played on -- in any other room he ever entered -- Dixon would be the most important songwriter in the room. But as it turned out, on this occasion, he was only the second-most important and influential songwriter there, as \"Maybellene\" would be the start of a run of singles that is unparalleled for its influence on rock and roll music. It was the debut of the single most important songwriter in rock and roll history.\n\nOf course, Chuck Berry isn't the only credited songwriter -- and, separately, he may not have been the song's only writer. But these two things aren't linked.\n\nLeonard Chess was someone who had a reputation for not being particularly fair with his artists when it came to contracts. A favourite technique for him was to call an artist and tell him that he had some new papers to sign. He would then leave a bottle of whisky in the office, and not be in when the musician turned up. His secretary would say \"Mr. Chess has been delayed. Help yourself to a drink while you wait in the office\". Chess would only return when the musician was totally drunk, and then get him to sign the contract. That wouldn't work on Berry, who didn't drink, but Chess did manage to get Berry to sign two thirds of the rights to \"Maybellene\" over to people who had nothing to do with writing it -- Russ Fratto and Alan Freed.\n\nFreed had already taken the songwriting credit for several songs by bands that he managed, none of which he wrote, but now he was going to take the credit for a song by someone he had never met -- Chess added his name to the credits as a bribe, in order to persuade him to play the song on his radio show. Russ Fratto, meanwhile, was the landlord of Chess Records' offices and owned the stationery company that printed the labels Chess used on their records. It's been said in a few places that Fratto was given the credit because the Chess brothers owed him money, so they gave him a cut of Berry's royalties to pay off their own debt.\n\nBut while Freed and Fratto took unearned credit for the song, it's at least arguable that so did Chuck Berry.\n\nWe'll be looking at several Chuck Berry songs over the course of this podcast, and the question of authorship comes up for all of them. After they stopped working together, Johnnie Johnson started to claim that he deserved co-writing credit for everything that was credited to Berry on his own. Johnson claimed that while Berry wrote the lyrics by himself, the band as a whole worked out the music, and that Berry's melody lines would be based on Johnson's piano parts.\n\nTo get an idea of what Johnson brought to the mix, here's a performance from Johnson, without Berry, many years later:\n\n[Excerpt: Johnnie Johnson, “Johnny's Boogie”]\n\nIt's impossible to say with certainty who did what -- Johnson sued Berry in 2000, but the case was dismissed because of the length of time between the songs being written and the case being brought. And Johnson worked with Berry on almost all his albums before that so we don't have any clear guides as to what Berry's music sounded like without Johnson.\n\nGiven Berry's money-grubbing, grasping, nature, and his willingness to see every single interaction as about how many dollars and cents were in it for Chuck Berry, I have no trouble believing that Berry would take the credit for other people's work and not think twice about it, so I can fully believe that Johnson worked with him on the music for the songs. On the other hand, most of the songs in question were based around very basic blues chord changes, and the musical interest in them comes almost solely from Berry's guitar licks -- Johnnie Johnson was a very good blues piano player just like a thousand other very good blues piano players, but Chuck Berry's guitar style is absolutely distinctive, and unlike anything ever recorded before.\n\nBut the crucial evidence as to how much input or lack of it Johnson had on the writing process comes with the keys Berry chose. Maybellene is in B-flat. A lot of his other songs are in E-flat. These are *not* keys that any guitarist would normally choose to write in. If you're a guitarist, writing for the guitar, you'd probably choose to write in E or A if you're playing the blues, D if you're doing folkier stuff, maybe G or C if you're doing something poppier and more melodic. These are easy keys for the guitar, the keys that every guitarist's fingers will automatically fall into unless they have a good reason not to.\n\nE-flat and B-flat, though, are fairly straightforward keys on the piano if you're playing the blues. And they're keys that are *absolutely* standard for a saxophone player -- alto saxes are tuned to an E-flat, tenor saxes to B-flat, so if you're a band where the sax player is the most important instrumentalist, those are the keys you're most likely to choose, all else being equal.\n\nNow, remember that Chuck Berry replaced the saxophone player in Johnnie Johnson's band. Once you know that it seems obvious what's happened -- Berry has fit himself in around arrangements and repertoire that Johnson had originally worked up with a sax player, playing in the keys that Johnson was already used to. When they worked out the music for Berry's songs, that was the pattern they fell into.\n\nSo, I tend to believe Johnson that the backings were worked out between them after Berry wrote the lyrics. Johnson's contribution seems to have come somewhere between that of an arranger and of a songwriter, and he deserves some credit at least morally, if not under the ridiculous legal situation that made arrangements uncopyrightable.\n\n[Excerpt: “Maybellene” guitar solo showing interplay of Berry and Johnson]\n\n“Maybellene”'s success was in part because of a very deliberate decision Berry had made years earlier, having noted the success of white performers singing black musicians' material, and deciding that he was going to try to get the white people to buy his recordings rather than the cover versions, by singing in a voice that was closer to white singers than the typical blues vocalist. While it caused him problems in early days, notably with him turning up to gigs only to be told, often with accompanying racial slurs, that they'd expected the performer of \"Maybellene\" to be a white man and he wasn't allowed to play, his playing-down of his own blackness also caused a major benefit -- he became one of the only black musicians to chart higher than the white cover version.\n\nIt would normally be expected that \"Maybellene\" would be overshadowed on the charts by Marty Robbins' version, especially since Marty Robbins was a hugely popular star, and Berry was an unknown on a small blues label:\n\n[excerpt: Marty Robbins, \"Maybellene\"]\n\nInstead, as well as going to number one on the R&B charts, Berry's recording went to number five on the pop charts. And other recordings by him would follow over the next few years. He was never a consistent chart success -- in fact he did significantly less well than his reputation in rock and roll history would suggest -- but he notched several top ten hits on the pop charts.\n\n\"Maybellene\" did so well that even \"Wee Wee Hours\", released as the B-side, went to number ten on the R&B charts. And Berry's next single was a \"Maybellene\" soundalike -- \"Thirty Days\"\n\n[Excerpt: \"Thirty Days\", Chuck Berry]\n\nIt's a great track, but it didn't do quite so well on the charts -- it went to number two on the R&B charts, and didn't hit the pop charts at all. The single after that, \"No Money Down\", did less well again. But Berry was about to turn things around again with his next single:\n\n[excerpt: *just the guitar intro* of \"Roll Over Beethoven\" by Chuck Berry]\n\nYou don't need anything more, do you? That's the Chuck Berry formula, right there. You don't even need to hear the vocals to know exactly what the record is.\n\nThat record is, of course, \"Roll Over Beethoven\". It's worth listening to the lyrics again just to see what Berry is doing here.\n\n[Excerpt: \"Roll Over Beethoven\", Chuck Berry]\n\nWhat we have here is, as far as I can tell, the first time that rock and roll started the pattern of self-mythologising that would continue throughout the genre's history. Of course, there had been plenty of records before this that had talked about the power of music or how much the singer wanted to make you dance, or whatever, but this one is different in a couple of ways. Firstly, it's talking about *recorded* music specifically -- Berry isn't wanting to go out and listen to a band play live, but he wants to listen to the DJ play his favourite record instead. And secondly, he's explicitly making a link between his music -- \"these rhythm and blues\" -- and the music of the rockabilly artists from Memphis -- \"don't step on my blue suede shoes\".\n\nAnd Berry's music did resemble the Memphis rockabilly more than it resembled anything else. Both had electric lead guitars, double bass, drums, and reverb, and no saxophone and little piano. Both sang sped-up hillbilly boogies with a hard backbeat. Rock and roll was, as we have seen, a disparate genre at first, and people would continue to pull from a whole variety of different sources. But working independently and with no knowledge of each other, a white country hick from Tennessee and a sophisticated black urbanite from the Midwest had hit upon almost exactly the same formula, and Berry was going to make sure that he made the connection as clear as possible.\n\nIf there's a moment that rock and roll culture coalesced into a single thing, it was with \"Roll Over Beethoven\". And Berry now had his formula worked out. The next thing to do was to get rid of the band. \"Roll Over Beethoven\" was the penultimate single credited to Chuck Berry & His Combo, rather than to just Chuck Berry. We'll look at the last one, recorded at the same session, in a few weeks' time.",
  "itunes:subtitle": "Welcome to episode twenty-nine of A History of Rock Music in Five Hundred Songs. This is the second of our three-part look at Chess Records, and focuses on Maybellene by Chuck Berry. Click the full post to read liner notes, links to more information, and",
  "itunes:keywords": "Alan Freed,Bob Wills,Chess Records,Chuck Berry,country and western,Jerome Green,Johnnie Johnson,Leonard Chess,Muddy Waters,plagiarism,racism,white cover versions,Willie Dixon",
  "itunes:episodeType": "full",
  "itunes:episode": 29,
  "content:encoded": "Welcome to episode twenty-nine of <em>A History of Rock Music in Five Hundred Songs</em>. This is the second of our three-part look at Chess Records, and focuses on \"Maybellene\" by Chuck Berry. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-29-maybellene/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI reference three previous episodes here --<a href=\"https://www.500songs.com/e/episode-28-sincerely-by-the-moonglows/#more-11403812\"> last week's</a>, the <a href=\"https://www.500songs.com/e/episode-2a-a-disclaimer/\">disclaimer episode,</a> and the episode on<a href=\"https://www.500songs.com/e/episode-3-ida-red/\"> Ida Red</a>.\n\nI used three main books as reference here:\n\n<a href=\"https://amzn.to/2KW58Gj\"><em>Brown Eyed Handsome Man: The Life and Hard Times of Chuck Berry</em> by Bruce Pegg</a> is a good narrative biography of Berry, which doesn't shy away from the less salubrious aspects of his personality, but is clearly written by an admirer.\n\n<a href=\"https://amzn.to/2vgii6n\"><em>Long Distance Information: Chuck Berry's Recorded Legacy </em>by Fred Rothwell</a> is an extraordinarily researched look at every single recording session of Berry's career up to 2001.\n\nAnd for information on Chess, I used <a href=\"https://amzn.to/2VlkE2c\"><em>The Record Men: Chess Records and the Birth of Rock and Roll</em> by Richard Cohen.</a> I wouldn't recommend that book, however -- while it has some useful interview material and anecdotes from those involved, Cohen gets some basic matters of fact laughably wrong, and generally seems to be more interested in showing off his prose style than fact-checking.\n\nThere are a myriad Chuck Berry compilations available. The one I'd recommend if you don't have a spare couple of hundred quid for the complete works box set is <a href=\"https://amzn.to/2ZpsF5A\">the double-CD <em>Gold</em></a>, which has every major track without any of the filler.\n\nAnd if you want to check out more of Willie Dixon's material, <a href=\"https://amzn.to/2vi7Qel\">this four-CD set</a> contains a hundred records he either performed on as an artist, played on as a session player, wrote, or produced. It's the finest body of work in post-war blues.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\n[Intro: Alan Freed introducing Chuck Berry and Maybellene]\n\nWelcome to the second part of our trilogy on Chess Records. This week, we're going to talk about the most important single record Chess ever put out, and arguably the most important artist in the whole history of rock music.\n\nBut first, we're going to talk about something a lot more recent. We're going to talk about \"Old Town Road,\" by Lil Nas X. For those of you who don't follow the charts and the music news in general, \"Old Town Road\" is a song put out late last year by a rapper, but it reached number nineteen in the country charts. Because it's a country song:\n\n[Excerpt: \"Old Town Road\" by Lil Nas X]\n\nThat's a song with banjo and mandolin, with someone singing in a low Johnny Cash style voice about riding a horse while wearing a cowboy hat. It's clearly country music if anything at all is country music. But it was taken off the country music charts the week it would otherwise have made number one, in a decision that Billboard was at pains to say was nothing at all to do with his race.\n\nA hint -- if you have to go to great lengths to say that the thing you're doing isn't racist, it's probably racist.\n\nBecause genre labels have always been about race, and about policing racial boundaries in the US, since the very beginning. Remember that when Billboard started the R&B charts they were called the \"race music\" charts. You had the race music charts for black people, the country charts for lower-class whites, and the pop charts for the respectable white people. That was the demarcation, and that still is the demarcation.\n\nBut people will always want to push against those constraints. And in the 1950s, just like today, there were black people who wanted to make country music. But in the 1950s, unlike today, there was a term for the music those people were making. It was called rock and roll. For about a decade, from roughly 1955 through 1965, \"rock and roll\" became a term for the music which disregarded those racial boundaries. And since then there has been a slow but sure historical revisionism. The lines of rock and roll expand to let in any white man, but they constrict to push out the women and black men who were already there. But there's one they haven't yet been able to push out, because this particular black man playing country music was more or less the embodiment of rock and roll.\n\nChuck Berry was, in many ways, not at all an admirable man. He was one of all too many rock and roll pioneers to be a sex offender (and again, please see the disclaimer episode I did close to the start of this series, for my thoughts about that -- nothing I say about his work should be taken to imply that I think that work mitigates some of the awful things he did) and he was also by all accounts an unpleasant person in a myriad other ways. As I talked about in the disclaimer episode, we will be dealing with many awful people in this series, because that's the nature of the history of rock and roll, but Chuck Berry was one of the most fundamentally unpleasant, unlikeable, people we'll be looking at. Nobody has a good word to say about him as a human being, and he hurt a lot of people over his long life. When I talk about his work, or the real injustices that were also done to him, I don't want to forget that.\n\nBut when it comes to rock and roll, Chuck Berry may be the single most important figure who ever lived, and a model for everyone who followed.\n\n[Excerpt: “Maybellene”, just the intro]\n\nTo talk about Chuck Berry, we first of all have to talk about Johnnie Johnson. Johnnie Johnson was a blues piano player, who had got a taste of life as a professional musician in the Marines, where he'd played in a military band led by Bobby Troup, the writer of \"Route 66\" among many other songs. After leaving the Marines, he'd moved around the Midwest, playing blues in various bands, before forming his own trio, the Johnnie Johnson Trio, in St Louis.\n\nThat trio consisted of piano, saxophone, and drums -- until New Year's Eve 1952, when the saxophone player had a stroke and couldn't play. Johnson needed another musician to play with the trio, and needed someone quick, but it was New Year's Eve -- every musician he could think of would be booked up. Except for Chuck Berry. Berry was a guitarist he vaguely knew, and was different in every way from Johnson. Where Johnson was an easy-going, fat, jovial, man, who had no ambitions other than to make a living playing boogie-woogie piano, Chuck Berry had already served a term in prison for armed robbery, was massively ambitious, and was skinny as a rake. But he could play the guitar and sing well enough, and the customers had hired a trio, not a duo, and so Chuck Berry joined the Johnnie Johnson Trio.\n\nBerry soon took over the band, as Johnson, a relatively easy-going person, saw that Berry was so ambitious that he would be able to bring the band greater success than they would otherwise have had. And also, Berry owned a car, which was useful for transporting the band to gigs. And so the Johnnie Johnson trio became the Chuck Berry Trio.\n\nBerry would also play gigs on the side with other musicians, and in 1954 he played guitar on a session for a calypso record on a local independent label:\n\n[Excerpt: \"Oh Maria\", Joe Alexander and the Cubans]\n\nHowever, when Berry tried to get that label to record the Chuck Berry Trio, they weren't interested. But then Berry drove to Chicago to see one of his musical heroes, Muddy Waters. We've talked about Waters before, but only in passing -- but Waters was, by far, the biggest star in the Chicago electric blues style, whose driving, propulsive, records were more accessible than Howlin' Wolf but still had some of the Delta grit that was missing from the cleaner sounds of people like T-Bone Walker. Berry stayed after the show to talk to his idol, and asked him how he could make records like Waters did. Waters told him to go and see Leonard Chess at Chess Records. Berry went to see Chess, who asked if Berry had a demo tape. He didn't, but he went back to St Louis and came back the next week with a wire recording of four newly-recorded songs. The first thing he played was a blues song he'd written called \"The Wee Wee Hours\":\n\n[excerpt: Chuck Berry, \"The Wee Wee Hours\"]\n\nThat was too generic for Chess -- and the blues they put out tended to be more electric Chicago blues, rather than the Nat Cole or Charles Brown style Berry was going for there. But the next song he played had them interested.\n\nBerry had always been interested in playing as many different styles of music as he could -- he was someone who was trying to incorporate the sounds of Louis Jordan, Muddy Waters, Charlie Christian, and Nat \"King\" Cole, among others. And so as well as performing blues, jazz, and rhythm and blues music, he'd also incorporated a fair amount of country and western music in his shows. And in particular, he was an admirer of Bob Wills and his Texas Playboys, and he would perform their song \"Ida Red\" in shows, where it always went down well.\n\nWe already had an entire episode of the podcast on \"Ida Red\", which I'll link in the liner notes to this, but as a quick reminder, it's an old folk song, or collection of folk songs, that had become a big hit for Bob Wills, the Western Swing fiddle player:\n\n[Excerpt: \"Ida Red\", Bob Wills and his Texas Playboys]\n\nBerry would perform that song live, but messed around and changed the lyrics a lot -- he eventually changed the title to \"Ida May\", for a start -- and when he performed the song for Leonard Chess, Chess thought it sounded great. There was only one problem -- he thought the name made it too obvious where Berry had got the idea, and he wanted it to sound more original. They tried several names and eventually hit on \"Maybellene\", after the popular cosmetics brand, though they changed the spelling.\n\n\"Ida Red\" wasn't the only influence on \"Maybellene\" though, there was another song called \"Oh Red\", a hokum song by the Harlem Hamfats:\n\n[Excerpt: \"Oh Red\", the Harlem Hamfats]\n\nLarry Birnbaum, in \"Before Elvis\", suggests that this was the *only* influence on \"Maybellene\", and that Berry was misremembering the song, as both songs have \"Red\" in the titles. I disagree -- I think it's fairly clear that \"Maybellene\" is inspired both by \"Ida Red\"s structure and patter-lyric verse and by \"Oh Red\"s chorus melody. And it wasn't just Bob Wills' version of “Ida Red” that inspired Berry. There's a blues version, by Bumble Bee Slim, which has a guitar break that isn't a million miles away from what Berry was doing:\n\n[Excerpt: \"Ida Red\", Bumble Bee Slim]\n\nAnd there's another influence as well. Berry's lyrics were about a car chase -- to try to catch up with a cheating girlfriend -- and are the thing that makes the song so unique. They -- and the car-horn sound of the guitar -- seem to have been inspired by a hillbilly boogie song called \"Hot Rod Racer\" by Arkie Shibley and his Mountain Dew Boys:\n\n[Excerpt: \"Hot Rod Racer\", Arkie Shibley and his Mountain Dew Boys]\n\nThat had been a successful enough country song that it spawned at least three hit cover versions, including one by Red Foley.\n\nBerry took all these Western Swing, blues, and hillbilly boogie influences and turned them into something new:\n\n[Excerpt: Chuck Berry, \"Maybellene\"]\n\nEven this early, you can already see the Chuck Berry style fully formed. Clean blues guitar, as clean as someone like T-Bone Walker, but playing almost rockabilly phrases -- this is closer to the style of Elvis' Sun records than it is to anything else that Chess were putting out -- and punning, verbose, witty lyrics talking about something that would have a clear appeal to people half his age. All of future rock is right there.\n\nThe lineup on the record was the Chuck Berry trio -- Berry on guitar, Johnson on piano, and Ebby Hardy on drums -- augmented by two other musicians. Jerome Green, the maraca player, is someone we'll be talking about next week, but we should here talk a bit about Willie Dixon, the bass player, because he is probably the single most important figure in the whole Chess Records story.\n\nDixon had started out as a boxer -- he'd been Joe Louis' sparring partner -- before starting to play a bass made out of a tin can and a single string for him by the blues pianist Leonard Caston. Dixon and Caston formed an Ink Spots-style group, \"The Five Breezes\":\n\n[Excerpt: \"Sweet Louise\", the Five Breezes]\n\nBut when America joined in World War II, Dixon's music career went on hold, as he was a conscientious objector, unwilling to fight in defence of a racist state, and so he spent ten months in prison. He joined Chess in 1951 shortly after Leonard Chess took over full control of the company by buying out its original owner -- right after the club Chess had been running had mysteriously burned down, on a day it was closed, giving him enough insurance money to buy the whole record company.\n\nAnd Dixon was necessary because among Leonard Chess' flaws was one fatal one -- he had no idea what real musical talent was or how to find it. But he *did* have the second-order ability to find people who could recognise real musical talent when they heard it, and the willingness to trust those people's judgement. And Dixon was not only a real talent himself, but he could bring out the best in others, too.\n\nDixon was, effectively, the auteur behind almost everything that Chess Records put out. As well as a session bass player who played on almost every Chess release that wasn't licensed from someone else, he was also their staff producer, talent scout, and staff songwriter, as well as a solo artist under his own name. He wrote and played on hits for Muddy Waters, Howlin' Wolf, Sonny Boy Williamson II, Little Walter, Koko Taylor, Bo Diddley, Elmore James... to all intents and purposes, Willie Dixon *was* the Chicago blues, and when the second generation of rock and rollers started up in the 1960s -- white boys with guitars from England -- it was Willie Dixon's songs that formed the backbone of their repertoire.\n\nJust a few of the songs he wrote that became classics include \"Little Red Rooster\" for Howlin' Wolf:\n\n[Excerpt: Howlin' Wolf, \"Little Red Rooster\"]\n\n\"Bring it on Home\" for Sonny Boy Williamson II\n\n[Excerpt: Sonny Boy Williamson II, \"Bring it on Home\"]\n\n\"You Need Love\" for Muddy Waters\n\n[Excerpt: Muddy Waters, \"You Need Love\"]\n\nYou get the idea. In any other session he played on -- in any other room he ever entered -- Dixon would be the most important songwriter in the room. But as it turned out, on this occasion, he was only the second-most important and influential songwriter there, as \"Maybellene\" would be the start of a run of singles that is unparalleled for its influence on rock and roll music. It was the debut of the single most important songwriter in rock and roll history.\n\nOf course, Chuck Berry isn't the only credited songwriter -- and, separately, he may not have been the song's only writer. But these two things aren't linked.\n\nLeonard Chess was someone who had a reputation for not being particularly fair with his artists when it came to contracts. A favourite technique for him was to call an artist and tell him that he had some new papers to sign. He would then leave a bottle of whisky in the office, and not be in when the musician turned up. His secretary would say \"Mr. Chess has been delayed. Help yourself to a drink while you wait in the office\". Chess would only return when the musician was totally drunk, and then get him to sign the contract. That wouldn't work on Berry, who didn't drink, but Chess did manage to get Berry to sign two thirds of the rights to \"Maybellene\" over to people who had nothing to do with writing it -- Russ Fratto and Alan Freed.\n\nFreed had already taken the songwriting credit for several songs by bands that he managed, none of which he wrote, but now he was going to take the credit for a song by someone he had never met -- Chess added his name to the credits as a bribe, in order to persuade him to play the song on his radio show. Russ Fratto, meanwhile, was the landlord of Chess Records' offices and owned the stationery company that printed the labels Chess used on their records. It's been said in a few places that Fratto was given the credit because the Chess brothers owed him money, so they gave him a cut of Berry's royalties to pay off their own debt.\n\nBut while Freed and Fratto took unearned credit for the song, it's at least arguable that so did Chuck Berry.\n\nWe'll be looking at several Chuck Berry songs over the course of this podcast, and the question of authorship comes up for all of them. After they stopped working together, Johnnie Johnson started to claim that he deserved co-writing credit for everything that was credited to Berry on his own. Johnson claimed that while Berry wrote the lyrics by himself, the band as a whole worked out the music, and that Berry's melody lines would be based on Johnson's piano parts.\n\nTo get an idea of what Johnson brought to the mix, here's a performance from Johnson, without Berry, many years later:\n\n[Excerpt: Johnnie Johnson, “Johnny's Boogie”]\n\nIt's impossible to say with certainty who did what -- Johnson sued Berry in 2000, but the case was dismissed because of the length of time between the songs being written and the case being brought. And Johnson worked with Berry on almost all his albums before that so we don't have any clear guides as to what Berry's music sounded like without Johnson.\n\nGiven Berry's money-grubbing, grasping, nature, and his willingness to see every single interaction as about how many dollars and cents were in it for Chuck Berry, I have no trouble believing that Berry would take the credit for other people's work and not think twice about it, so I can fully believe that Johnson worked with him on the music for the songs. On the other hand, most of the songs in question were based around very basic blues chord changes, and the musical interest in them comes almost solely from Berry's guitar licks -- Johnnie Johnson was a very good blues piano player just like a thousand other very good blues piano players, but Chuck Berry's guitar style is absolutely distinctive, and unlike anything ever recorded before.\n\nBut the crucial evidence as to how much input or lack of it Johnson had on the writing process comes with the keys Berry chose. Maybellene is in B-flat. A lot of his other songs are in E-flat. These are *not* keys that any guitarist would normally choose to write in. If you're a guitarist, writing for the guitar, you'd probably choose to write in E or A if you're playing the blues, D if you're doing folkier stuff, maybe G or C if you're doing something poppier and more melodic. These are easy keys for the guitar, the keys that every guitarist's fingers will automatically fall into unless they have a good reason not to.\n\nE-flat and B-flat, though, are fairly straightforward keys on the piano if you're playing the blues. And they're keys that are *absolutely* standard for a saxophone player -- alto saxes are tuned to an E-flat, tenor saxes to B-flat, so if you're a band where the sax player is the most important instrumentalist, those are the keys you're most likely to choose, all else being equal.\n\nNow, remember that Chuck Berry replaced the saxophone player in Johnnie Johnson's band. Once you know that it seems obvious what's happened -- Berry has fit himself in around arrangements and repertoire that Johnson had originally worked up with a sax player, playing in the keys that Johnson was already used to. When they worked out the music for Berry's songs, that was the pattern they fell into.\n\nSo, I tend to believe Johnson that the backings were worked out between them after Berry wrote the lyrics. Johnson's contribution seems to have come somewhere between that of an arranger and of a songwriter, and he deserves some credit at least morally, if not under the ridiculous legal situation that made arrangements uncopyrightable.\n\n[Excerpt: “Maybellene” guitar solo showing interplay of Berry and Johnson]\n\n“Maybellene”'s success was in part because of a very deliberate decision Berry had made years earlier, having noted the success of white performers singing black musicians' material, and deciding that he was going to try to get the white people to buy his recordings rather than the cover versions, by singing in a voice that was closer to white singers than the typical blues vocalist. While it caused him problems in early days, notably with him turning up to gigs only to be told, often with accompanying racial slurs, that they'd expected the performer of \"Maybellene\" to be a white man and he wasn't allowed to play, his playing-down of his own blackness also caused a major benefit -- he became one of the only black musicians to chart higher than the white cover version.\n\nIt would normally be expected that \"Maybellene\" would be overshadowed on the charts by Marty Robbins' version, especially since Marty Robbins was a hugely popular star, and Berry was an unknown on a small blues label:\n\n[excerpt: Marty Robbins, \"Maybellene\"]\n\nInstead, as well as going to number one on the R&B charts, Berry's recording went to number five on the pop charts. And other recordings by him would follow over the next few years. He was never a consistent chart success -- in fact he did significantly less well than his reputation in rock and roll history would suggest -- but he notched several top ten hits on the pop charts.\n\n\"Maybellene\" did so well that even \"Wee Wee Hours\", released as the B-side, went to number ten on the R&B charts. And Berry's next single was a \"Maybellene\" soundalike -- \"Thirty Days\"\n\n[Excerpt: \"Thirty Days\", Chuck Berry]\n\nIt's a great track, but it didn't do quite so well on the charts -- it went to number two on the R&B charts, and didn't hit the pop charts at all. The single after that, \"No Money Down\", did less well again. But Berry was about to turn things around again with his next single:\n\n[excerpt: *just the guitar intro* of \"Roll Over Beethoven\" by Chuck Berry]\n\nYou don't need anything more, do you? That's the Chuck Berry formula, right there. You don't even need to hear the vocals to know exactly what the record is.\n\nThat record is, of course, \"Roll Over Beethoven\". It's worth listening to the lyrics again just to see what Berry is doing here.\n\n[Excerpt: \"Roll Over Beethoven\", Chuck Berry]\n\nWhat we have here is, as far as I can tell, the first time that rock and roll started the pattern of self-mythologising that would continue throughout the genre's history. Of course, there had been plenty of records before this that had talked about the power of music or how much the singer wanted to make you dance, or whatever, but this one is different in a couple of ways. Firstly, it's talking about *recorded* music specifically -- Berry isn't wanting to go out and listen to a band play live, but he wants to listen to the DJ play his favourite record instead. And secondly, he's explicitly making a link between his music -- \"these rhythm and blues\" -- and the music of the rockabilly artists from Memphis -- \"don't step on my blue suede shoes\".\n\nAnd Berry's music did resemble the Memphis rockabilly more than it resembled anything else. Both had electric lead guitars, double bass, drums, and reverb, and no saxophone and little piano. Both sang sped-up hillbilly boogies with a hard backbeat. Rock and roll was, as we have seen, a disparate genre at first, and people would continue to pull from a whole variety of different sources. But working independently and with no knowledge of each other, a white country hick from Tennessee and a sophisticated black urbanite from the Midwest had hit upon almost exactly the same formula, and Berry was going to make sure that he made the connection as clear as possible.\n\nIf there's a moment that rock and roll culture coalesced into a single thing, it was with \"Roll Over Beethoven\". And Berry now had his formula worked out. The next thing to do was to get rid of the band. \"Roll Over Beethoven\" was the penultimate single credited to Chuck Berry & His Combo, rather than to just Chuck Berry. We'll look at the last one, recorded at the same session, in a few weeks' time.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode twenty-nine of A History of Rock Music in Five Hundred Songs. This is the second of our three-part look at Chess Records, and focuses on \"Maybellene\" by Chuck Berry. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI reference three previous episodes here -- last week's, the disclaimer episode, and the episode on Ida Red.\n\nI used three main books as reference here:\n\nBrown Eyed Handsome Man: The Life and Hard Times of Chuck Berry by Bruce Pegg is a good narrative biography of Berry, which doesn't shy away from the less salubrious aspects of his personality, but is clearly written by an admirer.\n\nLong Distance Information: Chuck Berry's Recorded Legacy by Fred Rothwell is an extraordinarily researched look at every single recording session of Berry's career up to 2001.\n\nAnd for information on Chess, I used The Record Men: Chess Records and the Birth of Rock and Roll by Richard Cohen. I wouldn't recommend that book, however -- while it has some useful interview material and anecdotes from those involved, Cohen gets some basic matters of fact laughably wrong, and generally seems to be more interested in showing off his prose style than fact-checking.\n\nThere are a myriad Chuck Berry compilations available. The one I'd recommend if you don't have a spare couple of hundred quid for the complete works box set is the double-CD Gold, which has every major track without any of the filler.\n\nAnd if you want to check out more of Willie Dixon's material, this four-CD set contains a hundred records he either performed on as an artist, played on as a session player, wrote, or produced. It's the finest body of work in post-war blues.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\n[Intro: Alan Freed introducing Chuck Berry and Maybellene]\n\nWelcome to the second part of our trilogy on Chess Records. This week, we're going to talk about the most important single record Chess ever put out, and arguably the most important artist in the whole history of rock music.\n\nBut first, we're going to talk about something a lot more recent. We're going to talk about \"Old Town Road,\" by Lil Nas X. For those of you who don't follow the charts and the music news in general, \"Old Town Road\" is a song put out late last year by a rapper, but it reached number nineteen in the country charts. Because it's a country song:\n\n[Excerpt: \"Old Town Road\" by Lil Nas X]\n\nThat's a song with banjo and mandolin, with someone singing in a low Johnny Cash style voice about riding a horse while wearing a cowboy hat. It's clearly country music if anything at all is country music. But it was taken off the country music charts the week it would otherwise have made number one, in a decision that Billboard was at pains to say was nothing at all to do with his race.\n\nA hint -- if you have to go to great lengths to say that the thing you're doing isn't racist, it's probably racist.\n\nBecause genre labels have always been about race, and about policing racial boundaries in the US, since the very beginning. Remember that when Billboard started the R&B charts they were called the \"race music\" charts. You had the race music charts for black people, the country charts for lower-class whites, and the pop charts for the respectable white people. That was the demarcation, and that still is the demarcation.\n\nBut people will always want to push against those constraints. And in the 1950s, just like today, there were black people who wanted to make country music. But in the 1950s, unlike today, there was a term for the music those people were making. It was called rock and roll. For about a decade, from roughly 1955 through 1965, \"rock and roll\" became a term for the music which disregarded those racial boundaries. And since then there has",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode twenty-nine of A History of Rock Music in Five Hundred Songs. This is the second of our three-part look at Chess Records, and focuses on \"Maybellene\" by Chuck Berry. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI reference three previous episodes here -- last week's, the disclaimer episode, and the episode on Ida Red.\n\nI used three main books as reference here:\n\nBrown Eyed Handsome Man: The Life and Hard Times of Chuck Berry by Bruce Pegg is a good narrative biography of Berry, which doesn't shy away from the less salubrious aspects of his personality, but is clearly written by an admirer.\n\nLong Distance Information: Chuck Berry's Recorded Legacy by Fred Rothwell is an extraordinarily researched look at every single recording session of Berry's career up to 2001.\n\nAnd for information on Chess",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}