{
  "title": "Distrust in science",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/30/distrust-in-science/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/30/distrust-in-science/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Sun, 30 Oct 2022 13:14:29 +0000",
  "category": [
    "Miscellaneous Science",
    "Political Science",
    "Sociology"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=47840",
  "description": "Gary Smith is coming out with a new book, &#8220;Distrust: Big Data, Data Torturing, and the Assault on Science.&#8221; He has a lot of examples of overblown claims in science&#8212;some of these have appeared on this blog, and Smith takes &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/30/distrust-in-science/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>Gary Smith is coming out with a new book, &#8220;Distrust:  Big Data, Data Torturing, and the Assault on Science.&#8221;  He has a lot of examples of overblown claims in science&#8212;some of these have appeared on this blog, and Smith takes pretty much the same position that I take on these things, so I won&#8217;t talk about that part further.</p>\n<p>Rather, I want to talk about the big picture that Smith paints, which is the idea that science is very important to our lives, and bad science degrades that trust. Ironically, I think this sort of attitude is also behind some of the anti-reform movement by leading academics:  they think science is just wonderful and they&#8217;d prefer if people just kept quiet about scientific errors or chalked things up to &#8220;the self-correcting nature of science.&#8221;  Smith and I are more in the clear-the-rotten-apples-out-of-the-barrel camp.</p>\n<p>Smith has a broader perspective than just talking about junk science.  He also talks about misplaced technology enthusiasm, from bitcoin-as-savior to chatbots-as-AI.  One thing he doesn&#8217;t really get into is the political angle, the idea that bad actors are sowing distrust as a tactic to reduce respect for serious science.  Familiar examples are industry-funded junk science on cigarettes and climate change, which then gets picked up by ideologues.  And then there are the HIV/AIDS denialists, which seems more like contrarianism, and the covid denialists, which has a political angle.  I&#8217;m not saying that Smith should&#8217;ve discussed all that&#8212;there&#8217;s a limit to how much can fit in one book&#8212;; I&#8217;m just bringing it up to emphasize that distrust in science is not just an unfortunate byproduct of frauds like the disgraced primatologist and confused people like the ESP guy, it&#8217;s also something that a lot of people are fostering on purpose. </p>\n<p>When we write about himmicanes and forking paths and multilevel modeling and all the rest, that&#8217;s just a small part of the story.  And one of the challenges is that we can&#8217;t simply root for &#8220;science&#8221; as an institution.  We root for the good stuff but not the bad stuff.</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/30/distrust-in-science/feed/",
  "slash:comments": 17
}