{
  "guid": "164d27e9-2584-4ee8-8a5a-b3652a65fa68",
  "title": "Jill Konrath - Getting Paid To Give (Almost) Everything Away",
  "description": "<p>How to give away expertise for free and make good money doing it</p>\n<h2>Talking Points</h2>\n<ul>\n<li>Selling more in less time without pushing</li>\n<li>How having a mission can help you strategically</li>\n<li>The roles that writing a book can play in a business</li>\n<li>How to give away expertise for free and make good money</li>\n<li>The importance of a good mailing list</li>\n<li>One way to constantly be in creation mode</li>\n</ul>\n<h2>Quotable Quotes</h2>\n<ul>\n<li>\"I didn't sit down one day and decide I wanted to be well-known.\"—JK</li>\n<li>\"How can I help these people and not go broke?\"—JK</li>\n<li>\"People in the consulting business fundamentally think about sales in the wrong way.\"—JK</li>\n<li>\"Sales is a skill. If you don't learn it, you can't create a sustainable career.\"—JK</li>\n<li>\"Sales is not pushy. It's consultative.\"—JK</li>\n<li>\"Your clients don't want what you have to offer. They want outcomes.\"—JK</li>\n<li>\"I'm well aware that my books are the lifeblood of my business, but that's not why I write them.\"—JK</li>\n<li>\"About 15 years ago, I asked myself 'How can I give my expertise away for free and make good money doing it?'\"—JK</li>\n<li>\"I have passed up a significant number of revenue generating opportunities.\"—JK</li>\n<li>\"It's all about creating a conversation with someone you want to reach.\"—JK</li>\n</ul>\n<h2>Guest Bio</h2>\n<p>After an award-winning sales career in the technology and services sector, Jill is now an internationally recognized speaker and sales strategist. She’s a bestselling author of four books—Selling to Big Companies, SNAP Selling, Agile Selling, and More Sales Less Time.</p>\n<p>Recently, LinkedIn named Jill as their #1 Business-to-Business Sales Expert citing her 1/3 million followers. Salesforce selected her as one of Top 7 Sales Influencers of the 21st century. Plus, she’s featured in the just-released “Story of Sales” documentary.</p>\n<p>As a consultant, Jill has worked with companies like IBM, GE, and Staples as well as many mid-market firms. Her expertise has appeared in Forbes, Fortune, New York Times, Wall Street Journal, Inc, Entrepreneur, Bloomberg, ABC and Fox News.</p>\n<p>To sum up her career, Jill is constantly searching for fresh strategies to enable sales success n an ever-changing business environment.</p>\n<h2>Related Links</h2>\n<ul>\n<li><a href=\"http://www.jillkonrath.com\">Jill's Website</a></li>\n<li><a href=\"http://www.linkedin.com/in/jillkonrath\">Jill's LinkedIn</a></li>\n<li><a href=\"https://www.amazon.com/Selling-Big-Companies-Jill-Konrath-ebook/dp/B008BMNJEI\">Selling to Big Companies</a></li>\n</ul>\n<h2>Transcript</h2>\n<h3>Jonathan S:</h3>\n<p>00:00 Hello, and welcome to the Business of Authority. I'm Jonathan Stark.</p>\n<h3>Rochelle M:</h3>\n<p>00:04 And I'm Rochelle Moulton.</p>\n<h3>Jonathan S:</h3>\n<p>00:05 Today, we're joined by Jill Konrath. After an award-winning sales career in the technology and services sector, Jill is now an internationally-recognized speaker and sales strategist. She's the best-selling author of four business books, most recently More Sales, Less Time. LinkedIn has named her their number one B2B expert, and Salesforce selected her as one of the top seven sales influencers of the 21st century. As a consultant, Jill's worked with companies like IBM, GE, and Staples, as well as many mid-market firms. Her expertise has appeared in Forbes, Fortune, New York Times, Wall Street Journal, Inc, Entrepreneur. The list goes on. We're super happy to have Jill with us today. Jill, welcome to the show.</p>\n<h3>Jill K:</h3>\n<p>00:46 Hey, thanks for having me. I'm glad to be here.</p>\n<h3>Rochelle M:</h3>\n<p>00:49 Jill, I just have to comment on your big idea on your website, which kind of sums up everything Jonathan just said about you. Sales Accelerated. Yeah! Love it!</p>\n<h3>Jill K:</h3>\n<p>01:00 I do, too. In the niche that I'm in, it's about how do we make more sales and do it in less time. How can we make it faster? To me, it's not just faster, it's really about how do we have a better conversation that's more focused on the customer. That's what makes it faster, not just push.</p>\n<h3>Rochelle M:</h3>\n<p>01:21 Love it! Before we get into all this, maybe for some of the members of our audience who might be experiencing you for the first time, will you tell us a little bit more about who you are, how you work, what you do?</p>\n<h3>Jill K:</h3>\n<p>01:35 Who I am. I am a sales consultant. I have been in the sales field pretty much my entire career. I never wanted to be in sales. I wanted to be an entrepreneur, but they told me when I brought my business plan into SCORE, Service Corps of Retired Executives, that it was a really good idea, and then they said, \"How are you going to sell this?\" I looked at them. I thought, \"I thought you said it was a good idea.\" They said, \"It is, Jill, but somebody has to sell it,\" so I said, \"All right. I'll go into sales for one year. I'll learn everything there is to know and then I will get out of it.\" Anyway, I never left.</p>\n<h3>Jill K:</h3>\n<p>02:14 I found it to be fascinating and totally different than I thought it was. I assumed most salespeople were slimy, manipulative con artists like you see on TV or the movies. I found out that, in the business-to-business field, salespeople are intelligent, creative, concerned about their customers, focused on their customers, trying to help them make good business decisions that enhance the quality of their work, and it was fun. I sold directly for a few years, like eight years, and then I actually started my own company, working as a consultant and did that for a long time, specializing in a very specific area of new products.</p>\n<h3>Jill K:</h3>\n<p>03:01 Then, my business crashed. I got totally wiped out because my two biggest clients came under pressure from Wall Street at the same time, and it took me a few years to get going again. I had to reinvent myself, and in the new iteration, I became me that people see on my website, which is not what I was doing before.</p>\n<h3>Rochelle M:</h3>\n<p>03:20 One of the things that's so fascinating to me, Jill, is that it feels like from the outside looking in that you've made some interesting pivots in your career. What made you start your own business? Leaving Xerox had to be a big deal.</p>\n<h3>Jill K:</h3>\n<p>03:36 I actually went into technology sales after Xerox. What caused me to start my own business was really, I have an extraordinarily low boredom threshold, and I'm a really rapid learner. I would throw myself into every new sales position, quickly learn it and, as soon as I learned it, I was no longer interested in it, which is not a good career choice then if you're constantly leaving as soon as you get good at something.</p>\n<h3>Jill K:</h3>\n<p>04:08 What I discovered was that I had the ability from a consulting perspective to go into massively complex situations, challenging business environments, and assimilate a whole lot of information about the buyer, the product, the sales process, the marketplace. I was so good at rapid learning, I could assimilate that all quickly and put it into a structure that would help my clients be more effective faster. I became a consultant, really to satisfy my need for continual interesting and challenging projects to work on.</p>\n<h3>Rochelle M:</h3>\n<p>04:48 I get you. I was thinking as you started to say that, \"Well, gee! That's the definition of consultant.\" We keep creating our new assignments.</p>\n<h3>Jill K:</h3>\n<p>04:58 Yes, it's all about creating your new assignment. To me, to find a niche and to go off to the niche and to build it out and to get good at it and then to continually have new projects feeding me all the time, it was like, oh, I was in heaven as a consultant!</p>\n<h3>Rochelle M:</h3>\n<p>05:14 That sounds familiar. There's a description you have on your website, and I'm not sure why I hadn't seen it before, where you describe yourself as going from a quiet, unknown consultant, which I think some of our listeners might relate to, to this recognized international authority.</p>\n<h3>Jill K:</h3>\n<p>05:36 Yeah, I know.</p>\n<h3>Rochelle M:</h3>\n<p>05:38 I'd love to hear more about how you did that.</p>\n<h3>Jill K:</h3>\n<p>05:43 Let me just say, it was step by step and it wasn't part of the game plan. It was never my intention to be where I'm at today. I didn't sit down one day and say, \"I want to be well known, and I want to have four best-selling books.\" I thought I wanted to write a book, and all I had to say in the whole wide world could be encapsulated in 60,000 words. Then, I wouldn't have another thing to say in my whole life. What happened to me is, I sort of got caught in a couple mission type of things in my mind that I was on a mission to do things.</p>\n<h3>Jill K:</h3>\n<p>06:18 There was, at one point when I very vividly remember one year where all these conferences had all these bald white guys speaking. It was like all these male sales reps that are older and bald. I was like, \"Where are the women? Where are the women? There's 20-30% of the sales force is women. They need women sales models.\" This is my, my quiet person out in White Bear Lake was doing good work. I said, \"Ann wrote a book. Why doesn't she become more visible. Susan wrote a book. Why isn't she more visible.\" They didn't want to be more visible. They just wanted to write a book and disappear and do their work again.</p>\n<h3>Jill K:</h3>\n<p>06:57 I finally went, \"Oh, crap! It looks like if the women need a visible person to look up to, that it's going to have to be me because it seems to be that I'm the only one on this bandwagon. It's like, where are the women? Where are the women?\" That became a responsibility of mine. I actually felt a very strong responsibility to be a role model for other women in sales because I had so desperately wanted to see women when I was growing up in my career, so that was one thing that happened.</p>\n<h3>Jill K:</h3>\n<p>07:31 I sort of got hooked into another idea, too. I did a pro bono project. It was to help a magazine that served the small and medium business community, and I discovered through that what was happening with entrepreneurs and other consultants and people in small businesses and how they were trying to grow. It seemed like there was always a bottleneck that they were running into that they didn't know how to sell. I mean, they reach a point where their business can only grow so far, and they're just working so darn hard for the amount of money that they're getting that they go back to the corporate environment.</p>\n<h3>Jill K:</h3>\n<p>08:06 I just thought, \"That's terrible! This is a sales issue. How can I solve this? These people don't have a pot to pee in. They can't afford me. I'm used to the corporate rates, and they can't afford me, so what can I do to serve these people and not go bankrupt,\" which was a driving force of mine. This was back 10, 15 years ago. For months, I spent 80 hours researching things, and I couldn't find an answer. I kept saying, \"How can I? How can I? How can I help these people and not go broke? How can I help these people and make some money.\"</p>\n<h3>Jill K:</h3>\n<p>08:41 One morning, I literally woke up at 4 o'clock in the morning, and a voice in my head spoke to me and said, \"Thou shalt create a website called Selling to Big Companies, and your tagline will be Helping Small Companies Win Big Contracts.\" I saw the whole thing. It was just like it came to me in just a bundle. I created just in time content for people, and I just created this really nice website, put the website up and I'm so excited about it! I put the website up, and it's got this great content for consultants and people like me who I know how to help. The day the website went up, I went, \"Oh, my God! I have just created a wonderful website and not a person in the whole world knows it exists except me.\"</p>\n<h3>Jill K:</h3>\n<p>09:28 I devoted six months entirely to creating the website and writing content and putting stuff up. I mean, literally shut down my business to do the website. At that point, I went, \"Well, I better figure out how to become known because this is a website to help these people and they don't know, so I have to become more visible.\" That was the other impetus to become visible out there in the world. One thing led to another and, I guess, once I dumped everything out of my brain in my first book, a few later, new ideas started creeping in.</p>\n<h3>Jill K:</h3>\n<p>09:59 Because I saw another problem that wasn't being solved out there, I had to tackle that problem because it was challenging to me, and I like messes. It's messy, so I had to tackle that problem. Once I figured out what would work, then I thought, \"Well, I have to write a second book,\" so I wrote SNAP Selling, which is all about how do you sell to busy buyers who are too busy to talk to you on the phone or talk to you about going ahead with the project, and then they never get back to you because everything else is going on in their company. Then, I thought I'd said everything I needed to say.</p>\n<h3>Jill K:</h3>\n<p>10:35 After I wrote SNAP Selling, that book, people said to me, \"Jill, this is really good. It's really helping me get in to see these people. It's helping me keeping the conversation going, and now we're closing deals, more projects.\" Then, they'd go, \"But,\" and it was like this 'but' was a huge 'but'. It was, \"But, I'm crazy busy, too. What do you have for me?\" I looked at them in horror, and I'd say, \" Oh, I haven't a clue! I'm going nuts just like you are!\"</p>\n<h3>Jill K:</h3>\n<p>11:05 You know, you keep hearing that long enough, and then that might create a brain starts working in the background, so I think, \"I know one thing that can help with this. I know one thing. I know how to do rapid learning. I know how to get into a sales job and get up to speed fast because that was what I did with all my consulting work, quick emersion, pick out the salient points, and how to align them so you can figure out what to do,\" so I wrote a book on that called Agile Selling, which is how to get up to speed fast in a new sales position. I thought I was done, that I'd said everything I needed to say. Then, I was still crazy busy myself and miserable.</p>\n<h3>Jill K:</h3>\n<p>11:44 Finally, one day I woke up and said, \"Well, this is no way to live.\" Maybe I should study that and how I can change my life so I'm not going nuts all the time. I studied that and, of course, every time I figured something out, I'd feel this compelling need to share it with the world, so that's what I did.</p>\n<h3>Rochelle M:</h3>\n<p>12:05 Are you working on number five?</p>\n<h3>Jill K:</h3>\n<p>12:07 I am not right now, no.</p>\n<h3>Rochelle M:</h3>\n<p>12:10 I can't wait to hear what it's going to wind up being.</p>\n<h3>Jill K:</h3>\n<p>12:13 I have no idea. I have to wait for the problem to emerge. I don't have a problem screaming at me right now. The biggest problem and challenge I have right now is I'm selling my house and downsizing, and I have three weeks to get out.</p>\n<h3>Rochelle M:</h3>\n<p>12:28 Cool.</p>\n<h3>Jill K:</h3>\n<p>12:33 That's all I'm thinking about right now.</p>\n<h3>Rochelle M:</h3>\n<p>12:34 That's huge. Thank you for making the time to talk to us in between.</p>\n<h3>Jonathan S:</h3>\n<p>12:39 Your story, sort of the way you punctuated there at the end with you're waiting for the problem to reveal itself, that really speaks to sort of dogfooding your own material. I'm a huge fan of the Selling to Big Companies book. I recommend it to students all the time, and it's all about that. It's starting with what's the benefit, what's the value proposition, what is the ... Don't talk about your competitors and how you're different from your competitors. Talk about the status quo and how you're different from that. Give it to them in tangible terms that define business outcomes if you're selling to businesses.</p>\n<h3>Jonathan S:</h3>\n<p>13:21 It's one of those sort of slap yourself in the forehead types of things when you read it. It's like, \"Well, obviously!\" I believe that it stems from that, like what's the problem? Hopefully, it's an expensive problem. People have this big expensive problem, the kind of thing they're losing sleep over, and then when you stumble ... Obviously, your radar is finely attuned looking for that kind of thing, so I think a lot of people just sort of zoom right by them and don't pick up the signal.</p>\n<h3>Rochelle M:</h3>\n<p>13:57 I'm not sure. Yes, my radar's really tuned because I've been in the sales field a long time but, what I think is really going on for a lot of people who are in the consulting business is they think about sales the wrong way. I mean, they fundamentally think about sales the wrong way, which is the used car. I got to talk about myself and tell them about how unique I am and my wonderful services, and then they feel like frauds because they don't feel unique, and they don't think that their services are really all that different, and they hate blathering on and on about how wonderful they are, so they don't feel good about that. Then, they don't want to sell. They'd just as soon just keep doing projects, but the reality of it is, if you don't learn, and sales is a skill, if you don't learn and tackle it as a skill, you cannot create a sustainable career. You have to look at it directly and say, \"It's a skill. I can learn it. Other idiots are learning it, too, and they're no better than me. They just figured out how to get work and, if I can focus on that, I'll do fine.\"</p>\n<h3>Rochelle M:</h3>\n<p>14:58 You have to realize that it's not pushy. The best salespeople are consultants. I mean, they're consultative in their nature, and they've learned how to take a consultative process that they use with their clients and move it into a sales methodology about understanding the business issue. Anybody's who's doing consulting is working on an issue. That's why they're there, so the challenge is to stop talking about, \"Oh, we have this really unique methodology that we just love\" or, \"We're so creative.\"</p>\n<h3>Rochelle M:</h3>\n<p>15:28 It's really talking about the issue and what they can't do, what they want to do, and what they're going to have trouble doing because of how they're currently set up as an organization, the methodologies that they use, everything that you could look at that could be a problem. If somebody would realize that selling is really consulting and get off that, \"I hate selling! I hate selling\" bandwagon and just say, \"Look, I am really good at this, and I want to be able to do this with my life. I want to have a sustainable income. I need to learn the skill, and I need to approach it as a disciplina- ...\"</p>\n<h3>Jill K:</h3>\n<p>16:00 I need to learn the skill and I need to approach it as a discipline that just is part of running a business.</p>\n<h3>Rochelle M:</h3>\n<p>16:06 Yeah, I think a lot of consultants get kinda tossed around with this idea of their process, because as a soloist you typically have to have some expertise and you have to have a process on some level that you follow, and so the typical consultant things, \"Well, I've gotta tell the client about my process and there's 17 steps and it looks like this.\"</p>\n<h3>Jill K:</h3>\n<p>16:24 Oh God, let's complicate things, 17 steps and a busy buyer will go, \"OH my God, 17 steps.\" You know, and then they'll be intimidated and bored.</p>\n<h3>Rochelle M:</h3>\n<p>16:36 Exactly. It's focusing on outcomes and Jonathan and I both, you know we preach that to the heavens. It really is as simple as that, when you think every consultant and I grew up in a big consulting firm, so I learned the selling piece, consultative selling in relationships early, and once it becomes a natural part of who you are, you can't turn it off.</p>\n<h3>Jill K:</h3>\n<p>17:03 You can't, right.</p>\n<h3>Rochelle M:</h3>\n<p>17:04 And that's a good thing.</p>\n<h3>Jill K:</h3>\n<p>17:05 Yes, it is a good thing, because being consultative it's a wonderful skill to be able to ask questions and figure out where the issues are and then to be able to step back and think, \"How can I help it?\" You know, that's what sales is too, and if you can take and just reapply those same skills that you have that make you a good consultant, you can get business, but you gotta get over yourself, you know and that you hate it.</p>\n<h3>Rochelle M:</h3>\n<p>17:30 Yes, and the 17 step process.</p>\n<h3>Jill K:</h3>\n<p>17:33 Oh, God no, nobody wants your 17 steps. All you need to talk about is how do you get started. Let me suggest this as the starting point, you know, we have other things we can go on, but here's basic starting point what we have to do to get going on this project.</p>\n<h3>Rochelle M:</h3>\n<p>17:46 I hear you. So what I'm wondering is, could we talk about your business model for a minute, Jill?</p>\n<h3>Jill K:</h3>\n<p>17:52 Yes, we could. I mean I have an evolving business model, cause my business has changed dramatically over the years.</p>\n<h3>Rochelle M:</h3>\n<p>18:00 Oh, I'd be amazed if it hadn't. I mean, one of the things we talk a lot about on this show is different, creating digital products and books and obviously books are a key part of your business strategy, I mean you've got four best selling books in 12 years, so we all know that's a huge investment in time. I'm wondering if you can walk us through the role that books play in your business model. So just as an example, some people think of books as really a standalone revenue stream and they look at books as, you know I need to make money from this book and this is my plan and it's a revenue stream, and others say, \"Listen, the book is really more about feeding my speaking business or my consulting business, it's a calling card. And I don't worry so much about the revenue from the books, what I look at is how it supports the other things that I do.\"</p>\n<h3>Jill K:</h3>\n<p>18:56 Yes, so that's what you wanna know about my books, how I look at my books mostly?</p>\n<h3>Rochelle M:</h3>\n<p>19:00 How do you think about them, I'm curious?</p>\n<h3>Jill K:</h3>\n<p>19:04 Okay, how I think about it is different from both ways that you described it.</p>\n<h3>Rochelle M:</h3>\n<p>19:08 Good.</p>\n<h3>Jonathan S:</h3>\n<p>19:08 Perfect.</p>\n<h3>Jill K:</h3>\n<p>19:09 So we have plan C over here and plan C is, I like puzzles and problems, and I like to figure them out. And every time I figure them out I have a compulsive need to share the answers with people, so I write books. Because what good does it do if I know the answers and have ideas that can make a difference to a whole lot of people, so to me it's a mission driven thing to write the books, I'm compelled to write the books. However, let me say the big however. However, I am very well aware that they are the lifeblood of my business. But I don't write them for the money and I don't write them exactly for getting the business, I write them because they need to be written.</p>\n<h3>Jill K:</h3>\n<p>19:55 Because I have tackled an issue that people are facing and that I know that they're facing and that they can help people. So that's why I write them, but because I'm a salesperson at heart, you know, I truly do understand that there will be great payback, but it's not my driving force. I mean, I've written some books that ... I mean I actually wrote a book in 2008 for people on how to use selling skills to get jobs when the stock market crashed, or not stock market, but the whole economy crashed, I put a book out there for free. Why? Because people needed to know that you couldn't just go onto Monster.com, you know and put your resume out. They needed to know that they could target companies they wanted to work for and go after them and create job opportunities on their own.</p>\n<h3>Jill K:</h3>\n<p>20:40 So I wrote a book and just gave it away.</p>\n<h3>Jonathan S:</h3>\n<p>20:43 Yeah and that's sort of a good segue into the absolute wealth of information and variety of formats that you have organized on your website. I mean it's almost overwhelming, you have it organized very nicely so it's not overwhelming but it's just a massive amount of information.</p>\n<h3>Jill K:</h3>\n<p>21:02 Yes, okay so here's some of the things that you need to know. I have said before that I'm on a mission type thing, and I feel compelled to do this, you know write the selling to big companies book, put stuff out there. 10 years ago, 15 years ago, I can't remember exactly in the time frame, I said to myself, \"How can I give my expertise away for free and make good money doing it?\" Which is an interesting question to pose. Cause it's doesn't sound like there's an answer. How can I give stuff away for free and make good money doing that?</p>\n<h3>Jill K:</h3>\n<p>21:40 And at that point I didn't know the answer, but one of the things I've always done is I've posed the question to myself, you know, like I said, how can I help these small businesses who don't know how to sell and don't have any money, how can I serve them? And you know, my brain works on it for three to four months and suddenly one day the answer miraculously appears. So anyway, I did I posed the question, How can I give away my expertise for free and make good money doing it? And a few months later a company contacted me about writing an e-book and they said, \"We will market it to the VP of sales.\" Which is my target demographic and I knew that their technology, you know, it was good for them to bless my work and for me to create an e-book for them.</p>\n<h3>Jill K:</h3>\n<p>22:29 SO I wrote an e-book for them, put it out there and three months later D and B called, Dun and Bradstreet called and said, \"We saw this book that you wrote for this company and we would really like you to write an e-book for us and we'll share it with our readers.\" And you know, for Dun and Bradstreet to say that it was pretty cool, right? I mean, again, they had a division that was going after VP's of sales, my target readers. And so we talked and kinda focused on what the e-book would be like and I'm talking an e-book probably of two to three thousand words, just for context for people. And they would do the design of the e-book and I would simply do the words.</p>\n<h3>Jill K:</h3>\n<p>23:05 So we got done talking, had honed in on the topic and then the lady from D and B said to me, \"How much do you charge for this?\" And now I thought I was doing an e-book from a pure marketing perspective and when she said that I stopped and I said to myself, \"Oh my God, people pay for this kinda stuff.\" And so I said, \"3,000 dollars.\" And she said, \"Oh, we can afford that.\" Okay, that's interesting.</p>\n<h3>Jill K:</h3>\n<p>23:41 So I wrote a nice e-book sharing my expertise, Dun and Bradstreet gave it away for free and I made 3,000 dollars. And it was a one week project, not bad. Cause that's also becoming a marketing piece for me out there, do you know what I'm saying?</p>\n<h3>Jonathan S:</h3>\n<p>23:57 Sure.</p>\n<h3>Jill K:</h3>\n<p>23:58 Now I'm giving away my expertise for free to people who need it and I'm getting paid for it. So then the first company that asked me to write the e-book called back said, \"That e-book was the best thing we've ever had, we've had more downloads from a lead generation standpoint, it has been tremendous, we would like you to write another one.\" And I said, \"I would love to do that, but you know I'm really busy right now, and I'm gonna have to charge you to do it, cause it would take away from my work time.\" And they said, \"Oh, how much?\" And I said, \"4,000 dollars.\" And they said, \"Yeah, we can afford that.\"</p>\n<h3>Jill K:</h3>\n<p>24:36 So I took another week and wrote another e-book, you know didn't write the whole time but just kinda thought about it, gave it some structure and then filled in the meat. Again, two to three thousand words, and then I realized that my expertise was a revenue source, and it didn't hit me til that point. So what most consultants don't understand is that there are companies, first of all they serve a certain demographic, like I serve and am an expert for sales people and somebody else might be an expert in pricing, somebody else might be an HR consultant on laws of some sort. There are people out there who sell things to the people we're trying to do work with, you know, like there's a whole bunch of technology people that sell things to my clients, you know, the kinda people I work with, the kinda people I write for.</p>\n<h3>Jill K:</h3>\n<p>25:27 And so I literally created a business model where I did a couple things, number one I created content and I still do, I create content for companies who are trying to reach salespeople, and I get paid really good money to create e-books. My daughter when she was out of college, in her 20's went to work for a company that was an agency and she actually wrote articles and blog posts for Linkedin and e-books for Linkedin and her agency was paid 20,000 dollars to write an e-book, so now I raised my fee.</p>\n<h3>Rochelle M:</h3>\n<p>26:02 Yeah.</p>\n<h3>Jill K:</h3>\n<p>26:04 And get paid 20,000 dollars to write an e-book. Because kids that were right out of college were writing these e-books from agencies and they were getting expert opinions and putting it together where I who am the expert can sit down, you know and write e-books and then they have the authority of my expertise as opposed to just Linkedin e-books. So they can market it better. So lead generation is crucial for a lot of companies today, they're desperately searching for content, content can be delivered in multiple formats, I have written e-books, now I'm doing interviews with people as part of my content, I've done video segments from a content perspective. I've done podcasts, you know, I do webinars, I get paid to do webinars, which they use, \"Oh we're having a webinar with Jill Konrath and you know sign up, it's free.\"</p>\n<h3>Jill K:</h3>\n<p>26:53 But it's free for the people who sign up, but it's not free, I'm not giving away my time, I'm being paid to do it cause I'm an expert in this field. And so I have an entire business model that is set on giving away stuff for free and making good money doing it.</p>\n<h3>Rochelle M:</h3>\n<p>27:08 Wow. I love that explanation, Jonathan I'm picturing our listeners going, \"really? I can do that?\"</p>\n<h3>Jill K:</h3>\n<p>27:16 Oh my God, you guys there's so much money in lead generation, people are paying 10 or 20 thousand dollars to have an e-book and you don't even have to be an expert, you know like a well known expert, you could easily charge like I said, I started at 4,000 dollars to have an e-book that was marketed to my target market. So other companies are blessing me by saying, \"here's an expert\" they're putting me in front of my targeted client who's getting free advice and I'm making good money. And word comes from that, that's what you've gotta realize, it does come back to me in a different way.</p>\n<h3>Jill K:</h3>\n<p>27:52 The other thing I've found and a lot of people don't realize this too is the importance of having a good database as a consultant, a database, a newsletter list. Because and here's what I can tell you I discovered, again I reach a certain demographic and a few years back after I asked that question, \"How can I give away my expertise for free and make good money doing that?\" You know, I write this newsletter and somebody approached me and said we have a client who would like to know if you would write about this e-book in your newsletter, or if you'd promote this e-book in your newsletter. And I said, \"I don't promote other people's stuff in my newsletter, you know, I just write my stuff.\"</p>\n<h3>Jill K:</h3>\n<p>28:35 And they said, \"Could we pay you to do that?\" And I said, \"Why don't you send me the e-book and I'll take a look at it?\" And they sent me this e-book that was written and it was perfect for my audience, I mean they would love it, it was well written, it wasn't promotional at all, it was really excellent content and they paid me 4,000 dollars to do that, you know it's like, oh my God, all I had to do was send a newsletter to my database, all I had to do, \"Here's a really good e-book on this. When you read it you'll discover ...\" And I had three bullet points and then at the bottom I'd write complements of my vendor, and I'd have a link, you know.</p>\n<h3>Jill K:</h3>\n<p>29:15 And I'd be paid to do that. So once I discovered that my database was an asset, I started building my database so I could charge more. I know, but it allows me to give away good stuff for free and to get paid doing it, which allows me to stop and create more new content. It's the creation stuff that's fun for me, so how can I constantly be in a creation mode and give my stuff away for free so I can create new stuff.</p>\n<h3>Rochelle M:</h3>\n<p>29:43 Well and this sense of mission that you have just kind of bleeds into everything which I love, I feel like that's your fuel.</p>\n<h3>Jill K:</h3>\n<p>29:51 Yeah, it is my fuel, I mean you know money used to be my fuel and since I discovered, I mean when I got hooked on helping small businesses, which ultimately I did this selling to big companies stuff, suddenly everything changed and my business kind of exploded on me when I was really trying to be more generous with the world, does that make sense? And so something and it really did explode on me and everything changed and I became the internationally recognized person, but that was never ever my goal. But I became that.</p>\n<h3>Rochelle M:</h3>\n<p>30:27 Wow.</p>\n<h3>Jonathan S:</h3>\n<p>30:29 How do speaking engagements figure into the mix?</p>\n<h3>Jill K:</h3>\n<p>30:32 Well I don't do consulting anymore, okay, I literally had to make a choice a few years ago, probably seven years ago now. Much as I love doing consulting work, what I discovered was that doing consulting work was ... my whole brain got wrapped up in my client, you know what I mean? You get so immersed in the work and every creative thought I had was, \"Oh God how am I gonna solve that? Or what am I gonna do? How do I fix that?\" And it took up all my creative energy and I had made a decision then that I could either serve one client really well or I could serve a variety of people out there. And so I made a choice to serve a variety of people and to serve the world as opposed to my one client, which meant I had to walk away from consulting entirely and move into speaking, which is not something I'd done too much of, you know.</p>\n<h3>Jill K:</h3>\n<p>31:27 So then I had to become a speaker, which is something I never wanted to do, but I became one because I wanted to share what I learned. I feel like I'm a real oddball here talking, but it's like if you're sort of on this mission and you've learned this stuff about you know how to sell to these companies, or how to be more successful or how to, you know how to get your life back in order, those are important things. I want people to know then so they don't have to go through the same learning curve that I had to go through.</p>\n<h3>Jill K:</h3>\n<p>32:01 So how does speaking fit in? Speaking fits</p>\n<h3>Jill K:</h3>\n<p>32:00 ... curve that I had to go through. How does speaking feed in? Speaking feeds in because I get paid well to do it and it gives me a chance to be in front of more people, and to have a broader impact. But it pays really, really well.</p>\n<h3>Rochelle M:</h3>\n<p>32:16 You've got an international footprint, yes?</p>\n<h3>Jill K:</h3>\n<p>32:18 Yes. Last month I was in Milan, Italy. Wrapped a nice vacation around it so it was a lot of fun.</p>\n<h3>Jonathan S:</h3>\n<p>32:27 Nice.</p>\n<h3>Rochelle M:</h3>\n<p>32:28 That sounds perfect.</p>\n<h3>Jill K:</h3>\n<p>32:29 It was perfect.</p>\n<h3>Jonathan S:</h3>\n<p>32:36 It feels like each of these different sorts of packaging of your expertise, each of these different offerings if you will even if they're free, blogposts and e-books and worksheets and videos and speeches and books. They all ... sort of like what people refer to as a flywheel effect where you've got this very, very clear focus at the hub, in the center. And everything just revolves around it. It's adding a little bit. And once it's going, adding more energy to that motion just keeps it in motion, keeps it accelerating.</p>\n<h3>Jill K:</h3>\n<p>33:15 Yeah. It does.</p>\n<h3>Jonathan S:</h3>\n<p>33:16 I'm curious if there were any spikes or anything in particular that you noticed really noticed upped the ante for you? Was very successful for you and got you to a new level? I don't know, one of the books perhaps being super successful. Or was it ... Was there anything in particular that you could share with the listeners that you look back and say, \"That ...\" Maybe you didn't know it at the time but, \"Man. That was smart. That really worked out for me.\"</p>\n<h3>Jill K:</h3>\n<p>33:45 Oh man. A lot of things have worked out for me.</p>\n<h3>Jonathan S:</h3>\n<p>33:53 It seems that way. And that was a perfectly good answer. I'm kind of hoping you say, \"No,\" because-</p>\n<h3>Jill K:</h3>\n<p>33:58 There's no magic here.</p>\n<h3>Jonathan S:</h3>\n<p>33:59 Right.</p>\n<h3>Jill K:</h3>\n<p>33:59 I mean like I said, this wasn't my goal. My goal was to do the work and to get paid a living wage. Have a good enough income that I felt decent about the work that I was doing.</p>\n<h3>Jill K:</h3>\n<p>34:09 I have passed up a significant number of revenue opportunities that have come my way. And I have chosen not to do certain things because of lifestyle choices. You know, I do speak but man, I'm not promoting myself as somebody who's on the road 250 days a year. That's like crazy for me. I don't want to do that. Speaking 20 times a year is sufficient. You can tell I'm not totally driven by money but I'm making really good money, you know? I have been approached numerous times to do online training courses and I have not done them. I've not done them.</p>\n<h3>Jonathan S:</h3>\n<p>34:46 What's the thinking there?</p>\n<h3>Jill K:</h3>\n<p>34:48 Well because I have seen a lot of people do them and I am very aware that it's not about the training program. A lot of people have created really good training programs. They've invested a ton of money in these things. And then in order to be profitable, they have to go into marketing mode and they have to have a large enough footprint out there from a database perspective or they have to be constantly marketing. And I don't want to do that. I want to give away my stuff for free and make good money doing it.</p>\n<h3>Jill K:</h3>\n<p>35:21 It's more fun for me to give it away. So I found another way so I don't have to keep selling programs. I just keep giving away stuff. And I go to companies and say, \"I have an idea for something on how I can help you,\" and I pitch my ideas to companies about how I can create content. How I can create content that they can leverage. And what people don't realize is the lead generation machines of companies are desperate for content. If you have a niche and an expertise in a certain area, there are somebody who's trying to reach the person that you work with. I don't care if it's auditors or warehouse foremen. Somebody's trying to reach them.</p>\n<h3>Jill K:</h3>\n<p>36:08 And who are these companies who are selling to these people and how can you create some good content that they can give away for free to attract these people into their database because they need to talk to them. They want something that is good. We're experts and we don't value our content. But they're paying kids out of college big bucks to write articles or to write e-books or to do things that we, who are experts, could do and do it so much better than.</p>\n<h3>Jill K:</h3>\n<p>36:39 I mean to me that's an opportunity that virtually every consultant is totally blind to. I went to speak at National Speakers Association at one of their events a few years back. And I was explaining this to people. And again, most people look at me like, \"I couldn't do that. That's really weird.\" But one guy came up to me afterwards. He said, \"I am an expert in aging population and how to take care of aging parents.\" That's his expertise. And he said, \"I have a 30000 word document right now that I was thinking of putting out as a book.\" He said, \"What you've done is you've given me an idea.\" And he went to New York Life Insurance company with his idea because they had a product on elderly care product. And he sold them, his first time out contacting New York Life, going after the lead generation or demand generation department in their marketing arena and talk with them about creating an e-book on how to take care of your elderly parents or how do you decide on which senior place is the best for your elderly parents. And $30000 you know? On his first time out. And he already had the content.</p>\n<h3>Rochelle M:</h3>\n<p>37:51 Not bad.</p>\n<h3>Jill K:</h3>\n<p>37:52 You don't make that much from writing a book usually, you know what I mean?</p>\n<h3>Jonathan S:</h3>\n<p>37:56 Not your first one.</p>\n<h3>Jill K:</h3>\n<p>37:56 Not your first one. No.</p>\n<h3>Rochelle M:</h3>\n<p>37:56 Exactly.</p>\n<h3>Jonathan S:</h3>\n<p>37:59 I'm having my own light bulb moment here because I've actually been hired to do things like you're describing. And it never occurred to me that they were anything other than random one off edge cases where I've written a bunch of books. The target market is always software developers, specifically web developers, and have been hired by big companies to essentially do exactly to the letter what you're describing here.</p>\n<h3>Jill K:</h3>\n<p>37:59 And?</p>\n<h3>Jonathan S:</h3>\n<p>38:26 And it was great. It's great money. It's exactly what you're saying. It's great money. It's great exposure. You get to share ideas for free. You get the third party endorsement of whoever, Nokia or Cisco or whoever else, Intel.</p>\n<h3>Jill K:</h3>\n<p>38:44 Yeah. Right.</p>\n<h3>Jonathan S:</h3>\n<p>38:46 But the shoe that never dropped for me, was that you could actually go after that kind of work specifically. It just seemed to me so random and so ... I mean now that you're saying it, it's obvious that it's not. But it never even occurred to me to think like, \"Oh. That could be my whole business.\" It surely could have.</p>\n<h3>Jill K:</h3>\n<p>39:08 I mean the two things about leveraging my database and sharing information about good webinars that are coming up or good e-books that other companies have written and the combination of doing my own content creation for companies was 50% of my revenue last year. And it was fun work.</p>\n<h3>Jonathan S:</h3>\n<p>39:25 Right. It is fun.</p>\n<h3>Jill K:</h3>\n<p>39:26 And you know some of the projects, some of the e-books that I wrote in the last couple years and talking with people, I interview some of their best clients. And I write up like ... One e-book I did was for a company called Velocify that does software for inside sales, inside sales people that call on the phone. And they had me interview five VPs of Sales that are running high performance teams, sales teams.</p>\n<h3>Jill K:</h3>\n<p>39:55 And I wrote an e-book. It was fast, it was fun to do because I got to talk to all these five people and get inside their brain. And these are, again, people like my customers, you know. I got to interview them and then I got to write up seven things I learned from them in an e-book. The 7 Characteristics of Top Performing Sales Leaders. You know it was like, \"Oh that was fun. It gave me more recent connectivity with my base. I got to ask insightful questions. They were delighted to be included in the project. It's like, \"Man. This is cool work.\"</p>\n<h3>Rochelle M:</h3>\n<p>40:30 Win, win, win.</p>\n<h3>Jill K:</h3>\n<p>40:31 Win, win, win. Win, win, win. Yeah.</p>\n<h3>Jonathan S:</h3>\n<p>40:33 So if someone was going to ... I know specific individuals who are more ... I think they would refer to themselves as copywriters or data analysts and they don't see themselves as maybe as big of an expert at their area of expertise than I would consider them to be. Who I imagine will listen to this and not perhaps be skeptical or clueless about what next steps to take if maybe they are interested in experimenting with these ideas. As a sales expert, what would somebody in a situation like that do as a first step?</p>\n<h3>Jill K:</h3>\n<p>41:12 First. So if you wanted to do this to make money doing? Like what I was just describing?</p>\n<h3>Jonathan S:</h3>\n<p>41:19 Right. You know you said that companies are desperate for lead generation.</p>\n<h3>Jill K:</h3>\n<p>41:23 They really are.</p>\n<h3>Jonathan S:</h3>\n<p>41:23 College kids to do it. I know for sure that there are tons of listeners of this show and also another show that I do that are just ... They say all the time, \"People don't value what I do. What I do is a commodity.\" They're trying to sell themselves by the hour on Upwork. They're competing with people in the Philippines who are charging $3 an hour. They feel like giving up frankly. And this is a very, very interesting approach that has never occurred to me consciously before but I wouldn't know where to recommend that they start.</p>\n<h3>Jill K:</h3>\n<p>42:01 Right. Most people don't because they don't understand sales. They don't understand lead generation either. They just don't think that people are doing that. But if they understood, first of all, that companies are desperately trying to get people in to their database so that they can initiate conversations with them about potentially buying a product or service.</p>\n<h3>Jill K:</h3>\n<p>42:25 The first place you have to start is saying, \"Well who are the people that I'm continually working with? Is it Purchasing? Is it Marketing? CMOs? Where am I working?\" And you have to say then, \"Who is trying to sell these people things?\" And honestly, if you're working in Marketing and selling with CMOs, you could talk to the CMO and say, \"You know, what kind of things do you make decisions about?\" And they might say, \"Well, we make decisions about technology. There's a lot of marketing technology right now. Or we make decisions about this or that.\"</p>\n<h3>Jill K:</h3>\n<p>43:01 Whatever they tell you, then you have to find out what companies are in that business. But if you're selling to the CMO, which technologies are trying to reach the CMO? Or if you're selling to an attorney or law firm, which companies are trying to reach law firms to sell them what? What products and services? And you have to just start thinking about it and start researching the companies. And there's no shortcut to do that.</p>\n<h3>Jill K:</h3>\n<p>43:26 But once you start researching the companies and you say, \"Oh this company sounds like ... It's kind of aligned with what I do. And we're kind of talking the same thing. I'm just helping on the edges of it.\" Then you have to look and you have to go to LinkedIn and you have to look and google things like demand generation or lead generation and find out who's in their Marketing department. And take a look if they have any -- I go to their website and I'd take a look -- are they offering any e-books? Do they have webinars? Do they have infographics. I've been paid a lot of money for one page cheat sheets too. Little one page cheat sheets. Blah, blah, blah. I can't talk. A little one page cheat sheet that I've written. I got $3000 for writing something that I already knew and that didn't take very long.</p>\n<h3>Jill K:</h3>\n<p>44:21 But just going to the website and seeing are they doing lead generation on their website. And you can tell they're doing it if you have to fill out your name for something and give them an email address. Then you know they're doing lead generation, right?</p>\n<h3>Jonathan S:</h3>\n<p>44:35 Sure. It's obvious.</p>\n<h3>Jill K:</h3>\n<p>44:36 It's obvious. So once you know, yes they are leveraging lead generation and you don't want to talk somebody into it because they don't get it. You want to always work somebody who gets it. And see what they have. And see if you can think of an idea to add something else.</p>\n<h3>Jill K:</h3>\n<p>44:55 Like the one I was talking about before with Velocify. I went to them with an idea because I checked out their website and they didn't have anything on onboarding sales people. Nothing. Nothing. And so I suggested that they might want to consider that and let's talk. You can send out an email to the head of lead gen.  By the way not just one because if you look at any of my books, you'll find out it takes eight to ten touches, contacts in order for this person to get back to you. But you initiate contact and you suggest an idea, then you state that you've been on their website, it looks like their doing lead generation. You have some ideas on how to create an e-book or do a webinar, whatever it is that you want to create yourself. And just suggest that you set up a time to talk. It's not pitching them on your writing skills. It's suggesting that you have an idea that might help them generate more leads.</p>\n<h3>Jonathan S:</h3>\n<p>45:54 And generating more leads, as we all know, is a very desirable business outcome for certain people.</p>\n<h3>Jill K:</h3>\n<p>45:59 Oh my God. Yes. It's what they want. And if it's in your area of expertise, you know this stuff and you can write an e-book and being paid $10000 or whatever to sit down and write an e-book in one week, that's 2000 to 3000 words.</p>\n<h3>Jonathan S:</h3>\n<p>46:14 Mm-hmm (affirmative). Right.</p>\n<h3>Jill K:</h3>\n<p>46:15 That's not a lot of writing. My first two books are 60000 words and my second two are about 40000 to 45000, so.</p>\n<h3>Jonathan S:</h3>\n<p>46:26 Yeah it's super doable. It's just great. This is great.</p>\n<h3>Rochelle M:</h3>\n<p>46:29 I just want to point out to our audience that the key is knowing who you're serving. Knowing who your sweet spot is. Being crystal clear is going to help you. You can't start this without knowing that.</p>\n<h3>Jill K:</h3>\n<p>46:42 You can't.</p>\n<h3>Jonathan S:</h3>\n<p>46:48 Yeah, it's critical. The whole idea falls apart if you don't have that.</p>\n<h3>Jill K:</h3>\n<p>46:48 It sort of goes back to ... You talked about selling to big companies at the onset. I mean selling to big companies is about really knowing who your target market is. Who am I going after? Who is this company? Who is the specific buyer? What value do I bring? It's about focusing and creating a conversation with somebody you want to reach. It all goes full circle.</p>\n<h3>Jonathan S:</h3>\n<p>47:12 Well that's a perfect segue into a wrap-up.</p>\n<h3>Rochelle M:</h3>\n<p>47:16 That's where I was going. [inaudible 00:47:18] better myself. Perfect.</p>\n<h3>Jonathan S:</h3>\n<p>47:20 Well thanks so much for joining us Jill. This has been solid gold, just really, really great. Where should people go to find out more about you and your books and all the other wonderful things that you have available?</p>\n<h3>Jill K:</h3>\n<p>47:31 JillKonrath.com. That's it. JillKonrath.com.</p>\n<h3>Jonathan S:</h3>\n<p>47:35 Perfect.</p>\n<h3>Jill K:</h3>\n<p>47:35 Konrath with a K.</p>\n<h3>Jonathan S:</h3>\n<p>47:37 Yes. We will absolutely link all of this up in the show notes. Jill with a J. Konrath with a K.</p>\n<h3>Jill K:</h3>\n<p>47:44 Yeah.</p>\n<h3>Jonathan S:</h3>\n<p>47:47 Alright great. Well thanks again for joining us.</p>\n<h3>Rochelle M:</h3>\n<p>47:49 Thank you so much.</p>\n<h3>Jonathan S:</h3>\n<p>47:51 That'll do it for the Business of Authority. Thank you so much for joining us and we'll talk to you again next week. Bye.</p>\n<h3>Rochelle M:</h3>\n<p>47:57 Bye bye.</p>\n",
  "pubDate": "Mon, 9 Jul 2018 10:00:00 +0000",
  "author": "jstark@jonathanstark.com (Jonathan Stark and Rochelle Moulton)",
  "link": "https://thebusinessofauthority.com/episodes/9f375fd5-2ac0e21e",
  "content:encoded": "<p>How to give away expertise for free and make good money doing it</p>\n<h2>Talking Points</h2>\n<ul>\n<li>Selling more in less time without pushing</li>\n<li>How having a mission can help you strategically</li>\n<li>The roles that writing a book can play in a business</li>\n<li>How to give away expertise for free and make good money</li>\n<li>The importance of a good mailing list</li>\n<li>One way to constantly be in creation mode</li>\n</ul>\n<h2>Quotable Quotes</h2>\n<ul>\n<li>\"I didn't sit down one day and decide I wanted to be well-known.\"—JK</li>\n<li>\"How can I help these people and not go broke?\"—JK</li>\n<li>\"People in the consulting business fundamentally think about sales in the wrong way.\"—JK</li>\n<li>\"Sales is a skill. If you don't learn it, you can't create a sustainable career.\"—JK</li>\n<li>\"Sales is not pushy. It's consultative.\"—JK</li>\n<li>\"Your clients don't want what you have to offer. They want outcomes.\"—JK</li>\n<li>\"I'm well aware that my books are the lifeblood of my business, but that's not why I write them.\"—JK</li>\n<li>\"About 15 years ago, I asked myself 'How can I give my expertise away for free and make good money doing it?'\"—JK</li>\n<li>\"I have passed up a significant number of revenue generating opportunities.\"—JK</li>\n<li>\"It's all about creating a conversation with someone you want to reach.\"—JK</li>\n</ul>\n<h2>Guest Bio</h2>\n<p>After an award-winning sales career in the technology and services sector, Jill is now an internationally recognized speaker and sales strategist. She’s a bestselling author of four books—Selling to Big Companies, SNAP Selling, Agile Selling, and More Sales Less Time.</p>\n<p>Recently, LinkedIn named Jill as their #1 Business-to-Business Sales Expert citing her 1/3 million followers. Salesforce selected her as one of Top 7 Sales Influencers of the 21st century. Plus, she’s featured in the just-released “Story of Sales” documentary.</p>\n<p>As a consultant, Jill has worked with companies like IBM, GE, and Staples as well as many mid-market firms. Her expertise has appeared in Forbes, Fortune, New York Times, Wall Street Journal, Inc, Entrepreneur, Bloomberg, ABC and Fox News.</p>\n<p>To sum up her career, Jill is constantly searching for fresh strategies to enable sales success n an ever-changing business environment.</p>\n<h2>Related Links</h2>\n<ul>\n<li><a href=\"http://www.jillkonrath.com\">Jill's Website</a></li>\n<li><a href=\"http://www.linkedin.com/in/jillkonrath\">Jill's LinkedIn</a></li>\n<li><a href=\"https://www.amazon.com/Selling-Big-Companies-Jill-Konrath-ebook/dp/B008BMNJEI\">Selling to Big Companies</a></li>\n</ul>\n<h2>Transcript</h2>\n<h3>Jonathan S:</h3>\n<p>00:00 Hello, and welcome to the Business of Authority. I'm Jonathan Stark.</p>\n<h3>Rochelle M:</h3>\n<p>00:04 And I'm Rochelle Moulton.</p>\n<h3>Jonathan S:</h3>\n<p>00:05 Today, we're joined by Jill Konrath. After an award-winning sales career in the technology and services sector, Jill is now an internationally-recognized speaker and sales strategist. She's the best-selling author of four business books, most recently More Sales, Less Time. LinkedIn has named her their number one B2B expert, and Salesforce selected her as one of the top seven sales influencers of the 21st century. As a consultant, Jill's worked with companies like IBM, GE, and Staples, as well as many mid-market firms. Her expertise has appeared in Forbes, Fortune, New York Times, Wall Street Journal, Inc, Entrepreneur. The list goes on. We're super happy to have Jill with us today. Jill, welcome to the show.</p>\n<h3>Jill K:</h3>\n<p>00:46 Hey, thanks for having me. I'm glad to be here.</p>\n<h3>Rochelle M:</h3>\n<p>00:49 Jill, I just have to comment on your big idea on your website, which kind of sums up everything Jonathan just said about you. Sales Accelerated. Yeah! Love it!</p>\n<h3>Jill K:</h3>\n<p>01:00 I do, too. In the niche that I'm in, it's about how do we make more sales and do it in less time. How can we make it faster? To me, it's not just faster, it's really about how do we have a better conversation that's more focused on the customer. That's what makes it faster, not just push.</p>\n<h3>Rochelle M:</h3>\n<p>01:21 Love it! Before we get into all this, maybe for some of the members of our audience who might be experiencing you for the first time, will you tell us a little bit more about who you are, how you work, what you do?</p>\n<h3>Jill K:</h3>\n<p>01:35 Who I am. I am a sales consultant. I have been in the sales field pretty much my entire career. I never wanted to be in sales. I wanted to be an entrepreneur, but they told me when I brought my business plan into SCORE, Service Corps of Retired Executives, that it was a really good idea, and then they said, \"How are you going to sell this?\" I looked at them. I thought, \"I thought you said it was a good idea.\" They said, \"It is, Jill, but somebody has to sell it,\" so I said, \"All right. I'll go into sales for one year. I'll learn everything there is to know and then I will get out of it.\" Anyway, I never left.</p>\n<h3>Jill K:</h3>\n<p>02:14 I found it to be fascinating and totally different than I thought it was. I assumed most salespeople were slimy, manipulative con artists like you see on TV or the movies. I found out that, in the business-to-business field, salespeople are intelligent, creative, concerned about their customers, focused on their customers, trying to help them make good business decisions that enhance the quality of their work, and it was fun. I sold directly for a few years, like eight years, and then I actually started my own company, working as a consultant and did that for a long time, specializing in a very specific area of new products.</p>\n<h3>Jill K:</h3>\n<p>03:01 Then, my business crashed. I got totally wiped out because my two biggest clients came under pressure from Wall Street at the same time, and it took me a few years to get going again. I had to reinvent myself, and in the new iteration, I became me that people see on my website, which is not what I was doing before.</p>\n<h3>Rochelle M:</h3>\n<p>03:20 One of the things that's so fascinating to me, Jill, is that it feels like from the outside looking in that you've made some interesting pivots in your career. What made you start your own business? Leaving Xerox had to be a big deal.</p>\n<h3>Jill K:</h3>\n<p>03:36 I actually went into technology sales after Xerox. What caused me to start my own business was really, I have an extraordinarily low boredom threshold, and I'm a really rapid learner. I would throw myself into every new sales position, quickly learn it and, as soon as I learned it, I was no longer interested in it, which is not a good career choice then if you're constantly leaving as soon as you get good at something.</p>\n<h3>Jill K:</h3>\n<p>04:08 What I discovered was that I had the ability from a consulting perspective to go into massively complex situations, challenging business environments, and assimilate a whole lot of information about the buyer, the product, the sales process, the marketplace. I was so good at rapid learning, I could assimilate that all quickly and put it into a structure that would help my clients be more effective faster. I became a consultant, really to satisfy my need for continual interesting and challenging projects to work on.</p>\n<h3>Rochelle M:</h3>\n<p>04:48 I get you. I was thinking as you started to say that, \"Well, gee! That's the definition of consultant.\" We keep creating our new assignments.</p>\n<h3>Jill K:</h3>\n<p>04:58 Yes, it's all about creating your new assignment. To me, to find a niche and to go off to the niche and to build it out and to get good at it and then to continually have new projects feeding me all the time, it was like, oh, I was in heaven as a consultant!</p>\n<h3>Rochelle M:</h3>\n<p>05:14 That sounds familiar. There's a description you have on your website, and I'm not sure why I hadn't seen it before, where you describe yourself as going from a quiet, unknown consultant, which I think some of our listeners might relate to, to this recognized international authority.</p>\n<h3>Jill K:</h3>\n<p>05:36 Yeah, I know.</p>\n<h3>Rochelle M:</h3>\n<p>05:38 I'd love to hear more about how you did that.</p>\n<h3>Jill K:</h3>\n<p>05:43 Let me just say, it was step by step and it wasn't part of the game plan. It was never my intention to be where I'm at today. I didn't sit down one day and say, \"I want to be well known, and I want to have four best-selling books.\" I thought I wanted to write a book, and all I had to say in the whole wide world could be encapsulated in 60,000 words. Then, I wouldn't have another thing to say in my whole life. What happened to me is, I sort of got caught in a couple mission type of things in my mind that I was on a mission to do things.</p>\n<h3>Jill K:</h3>\n<p>06:18 There was, at one point when I very vividly remember one year where all these conferences had all these bald white guys speaking. It was like all these male sales reps that are older and bald. I was like, \"Where are the women? Where are the women? There's 20-30% of the sales force is women. They need women sales models.\" This is my, my quiet person out in White Bear Lake was doing good work. I said, \"Ann wrote a book. Why doesn't she become more visible. Susan wrote a book. Why isn't she more visible.\" They didn't want to be more visible. They just wanted to write a book and disappear and do their work again.</p>\n<h3>Jill K:</h3>\n<p>06:57 I finally went, \"Oh, crap! It looks like if the women need a visible person to look up to, that it's going to have to be me because it seems to be that I'm the only one on this bandwagon. It's like, where are the women? Where are the women?\" That became a responsibility of mine. I actually felt a very strong responsibility to be a role model for other women in sales because I had so desperately wanted to see women when I was growing up in my career, so that was one thing that happened.</p>\n<h3>Jill K:</h3>\n<p>07:31 I sort of got hooked into another idea, too. I did a pro bono project. It was to help a magazine that served the small and medium business community, and I discovered through that what was happening with entrepreneurs and other consultants and people in small businesses and how they were trying to grow. It seemed like there was always a bottleneck that they were running into that they didn't know how to sell. I mean, they reach a point where their business can only grow so far, and they're just working so darn hard for the amount of money that they're getting that they go back to the corporate environment.</p>\n<h3>Jill K:</h3>\n<p>08:06 I just thought, \"That's terrible! This is a sales issue. How can I solve this? These people don't have a pot to pee in. They can't afford me. I'm used to the corporate rates, and they can't afford me, so what can I do to serve these people and not go bankrupt,\" which was a driving force of mine. This was back 10, 15 years ago. For months, I spent 80 hours researching things, and I couldn't find an answer. I kept saying, \"How can I? How can I? How can I help these people and not go broke? How can I help these people and make some money.\"</p>\n<h3>Jill K:</h3>\n<p>08:41 One morning, I literally woke up at 4 o'clock in the morning, and a voice in my head spoke to me and said, \"Thou shalt create a website called Selling to Big Companies, and your tagline will be Helping Small Companies Win Big Contracts.\" I saw the whole thing. It was just like it came to me in just a bundle. I created just in time content for people, and I just created this really nice website, put the website up and I'm so excited about it! I put the website up, and it's got this great content for consultants and people like me who I know how to help. The day the website went up, I went, \"Oh, my God! I have just created a wonderful website and not a person in the whole world knows it exists except me.\"</p>\n<h3>Jill K:</h3>\n<p>09:28 I devoted six months entirely to creating the website and writing content and putting stuff up. I mean, literally shut down my business to do the website. At that point, I went, \"Well, I better figure out how to become known because this is a website to help these people and they don't know, so I have to become more visible.\" That was the other impetus to become visible out there in the world. One thing led to another and, I guess, once I dumped everything out of my brain in my first book, a few later, new ideas started creeping in.</p>\n<h3>Jill K:</h3>\n<p>09:59 Because I saw another problem that wasn't being solved out there, I had to tackle that problem because it was challenging to me, and I like messes. It's messy, so I had to tackle that problem. Once I figured out what would work, then I thought, \"Well, I have to write a second book,\" so I wrote SNAP Selling, which is all about how do you sell to busy buyers who are too busy to talk to you on the phone or talk to you about going ahead with the project, and then they never get back to you because everything else is going on in their company. Then, I thought I'd said everything I needed to say.</p>\n<h3>Jill K:</h3>\n<p>10:35 After I wrote SNAP Selling, that book, people said to me, \"Jill, this is really good. It's really helping me get in to see these people. It's helping me keeping the conversation going, and now we're closing deals, more projects.\" Then, they'd go, \"But,\" and it was like this 'but' was a huge 'but'. It was, \"But, I'm crazy busy, too. What do you have for me?\" I looked at them in horror, and I'd say, \" Oh, I haven't a clue! I'm going nuts just like you are!\"</p>\n<h3>Jill K:</h3>\n<p>11:05 You know, you keep hearing that long enough, and then that might create a brain starts working in the background, so I think, \"I know one thing that can help with this. I know one thing. I know how to do rapid learning. I know how to get into a sales job and get up to speed fast because that was what I did with all my consulting work, quick emersion, pick out the salient points, and how to align them so you can figure out what to do,\" so I wrote a book on that called Agile Selling, which is how to get up to speed fast in a new sales position. I thought I was done, that I'd said everything I needed to say. Then, I was still crazy busy myself and miserable.</p>\n<h3>Jill K:</h3>\n<p>11:44 Finally, one day I woke up and said, \"Well, this is no way to live.\" Maybe I should study that and how I can change my life so I'm not going nuts all the time. I studied that and, of course, every time I figured something out, I'd feel this compelling need to share it with the world, so that's what I did.</p>\n<h3>Rochelle M:</h3>\n<p>12:05 Are you working on number five?</p>\n<h3>Jill K:</h3>\n<p>12:07 I am not right now, no.</p>\n<h3>Rochelle M:</h3>\n<p>12:10 I can't wait to hear what it's going to wind up being.</p>\n<h3>Jill K:</h3>\n<p>12:13 I have no idea. I have to wait for the problem to emerge. I don't have a problem screaming at me right now. The biggest problem and challenge I have right now is I'm selling my house and downsizing, and I have three weeks to get out.</p>\n<h3>Rochelle M:</h3>\n<p>12:28 Cool.</p>\n<h3>Jill K:</h3>\n<p>12:33 That's all I'm thinking about right now.</p>\n<h3>Rochelle M:</h3>\n<p>12:34 That's huge. Thank you for making the time to talk to us in between.</p>\n<h3>Jonathan S:</h3>\n<p>12:39 Your story, sort of the way you punctuated there at the end with you're waiting for the problem to reveal itself, that really speaks to sort of dogfooding your own material. I'm a huge fan of the Selling to Big Companies book. I recommend it to students all the time, and it's all about that. It's starting with what's the benefit, what's the value proposition, what is the ... Don't talk about your competitors and how you're different from your competitors. Talk about the status quo and how you're different from that. Give it to them in tangible terms that define business outcomes if you're selling to businesses.</p>\n<h3>Jonathan S:</h3>\n<p>13:21 It's one of those sort of slap yourself in the forehead types of things when you read it. It's like, \"Well, obviously!\" I believe that it stems from that, like what's the problem? Hopefully, it's an expensive problem. People have this big expensive problem, the kind of thing they're losing sleep over, and then when you stumble ... Obviously, your radar is finely attuned looking for that kind of thing, so I think a lot of people just sort of zoom right by them and don't pick up the signal.</p>\n<h3>Rochelle M:</h3>\n<p>13:57 I'm not sure. Yes, my radar's really tuned because I've been in the sales field a long time but, what I think is really going on for a lot of people who are in the consulting business is they think about sales the wrong way. I mean, they fundamentally think about sales the wrong way, which is the used car. I got to talk about myself and tell them about how unique I am and my wonderful services, and then they feel like frauds because they don't feel unique, and they don't think that their services are really all that different, and they hate blathering on and on about how wonderful they are, so they don't feel good about that. Then, they don't want to sell. They'd just as soon just keep doing projects, but the reality of it is, if you don't learn, and sales is a skill, if you don't learn and tackle it as a skill, you cannot create a sustainable career. You have to look at it directly and say, \"It's a skill. I can learn it. Other idiots are learning it, too, and they're no better than me. They just figured out how to get work and, if I can focus on that, I'll do fine.\"</p>\n<h3>Rochelle M:</h3>\n<p>14:58 You have to realize that it's not pushy. The best salespeople are consultants. I mean, they're consultative in their nature, and they've learned how to take a consultative process that they use with their clients and move it into a sales methodology about understanding the business issue. Anybody's who's doing consulting is working on an issue. That's why they're there, so the challenge is to stop talking about, \"Oh, we have this really unique methodology that we just love\" or, \"We're so creative.\"</p>\n<h3>Rochelle M:</h3>\n<p>15:28 It's really talking about the issue and what they can't do, what they want to do, and what they're going to have trouble doing because of how they're currently set up as an organization, the methodologies that they use, everything that you could look at that could be a problem. If somebody would realize that selling is really consulting and get off that, \"I hate selling! I hate selling\" bandwagon and just say, \"Look, I am really good at this, and I want to be able to do this with my life. I want to have a sustainable income. I need to learn the skill, and I need to approach it as a disciplina- ...\"</p>\n<h3>Jill K:</h3>\n<p>16:00 I need to learn the skill and I need to approach it as a discipline that just is part of running a business.</p>\n<h3>Rochelle M:</h3>\n<p>16:06 Yeah, I think a lot of consultants get kinda tossed around with this idea of their process, because as a soloist you typically have to have some expertise and you have to have a process on some level that you follow, and so the typical consultant things, \"Well, I've gotta tell the client about my process and there's 17 steps and it looks like this.\"</p>\n<h3>Jill K:</h3>\n<p>16:24 Oh God, let's complicate things, 17 steps and a busy buyer will go, \"OH my God, 17 steps.\" You know, and then they'll be intimidated and bored.</p>\n<h3>Rochelle M:</h3>\n<p>16:36 Exactly. It's focusing on outcomes and Jonathan and I both, you know we preach that to the heavens. It really is as simple as that, when you think every consultant and I grew up in a big consulting firm, so I learned the selling piece, consultative selling in relationships early, and once it becomes a natural part of who you are, you can't turn it off.</p>\n<h3>Jill K:</h3>\n<p>17:03 You can't, right.</p>\n<h3>Rochelle M:</h3>\n<p>17:04 And that's a good thing.</p>\n<h3>Jill K:</h3>\n<p>17:05 Yes, it is a good thing, because being consultative it's a wonderful skill to be able to ask questions and figure out where the issues are and then to be able to step back and think, \"How can I help it?\" You know, that's what sales is too, and if you can take and just reapply those same skills that you have that make you a good consultant, you can get business, but you gotta get over yourself, you know and that you hate it.</p>\n<h3>Rochelle M:</h3>\n<p>17:30 Yes, and the 17 step process.</p>\n<h3>Jill K:</h3>\n<p>17:33 Oh, God no, nobody wants your 17 steps. All you need to talk about is how do you get started. Let me suggest this as the starting point, you know, we have other things we can go on, but here's basic starting point what we have to do to get going on this project.</p>\n<h3>Rochelle M:</h3>\n<p>17:46 I hear you. So what I'm wondering is, could we talk about your business model for a minute, Jill?</p>\n<h3>Jill K:</h3>\n<p>17:52 Yes, we could. I mean I have an evolving business model, cause my business has changed dramatically over the years.</p>\n<h3>Rochelle M:</h3>\n<p>18:00 Oh, I'd be amazed if it hadn't. I mean, one of the things we talk a lot about on this show is different, creating digital products and books and obviously books are a key part of your business strategy, I mean you've got four best selling books in 12 years, so we all know that's a huge investment in time. I'm wondering if you can walk us through the role that books play in your business model. So just as an example, some people think of books as really a standalone revenue stream and they look at books as, you know I need to make money from this book and this is my plan and it's a revenue stream, and others say, \"Listen, the book is really more about feeding my speaking business or my consulting business, it's a calling card. And I don't worry so much about the revenue from the books, what I look at is how it supports the other things that I do.\"</p>\n<h3>Jill K:</h3>\n<p>18:56 Yes, so that's what you wanna know about my books, how I look at my books mostly?</p>\n<h3>Rochelle M:</h3>\n<p>19:00 How do you think about them, I'm curious?</p>\n<h3>Jill K:</h3>\n<p>19:04 Okay, how I think about it is different from both ways that you described it.</p>\n<h3>Rochelle M:</h3>\n<p>19:08 Good.</p>\n<h3>Jonathan S:</h3>\n<p>19:08 Perfect.</p>\n<h3>Jill K:</h3>\n<p>19:09 So we have plan C over here and plan C is, I like puzzles and problems, and I like to figure them out. And every time I figure them out I have a compulsive need to share the answers with people, so I write books. Because what good does it do if I know the answers and have ideas that can make a difference to a whole lot of people, so to me it's a mission driven thing to write the books, I'm compelled to write the books. However, let me say the big however. However, I am very well aware that they are the lifeblood of my business. But I don't write them for the money and I don't write them exactly for getting the business, I write them because they need to be written.</p>\n<h3>Jill K:</h3>\n<p>19:55 Because I have tackled an issue that people are facing and that I know that they're facing and that they can help people. So that's why I write them, but because I'm a salesperson at heart, you know, I truly do understand that there will be great payback, but it's not my driving force. I mean, I've written some books that ... I mean I actually wrote a book in 2008 for people on how to use selling skills to get jobs when the stock market crashed, or not stock market, but the whole economy crashed, I put a book out there for free. Why? Because people needed to know that you couldn't just go onto Monster.com, you know and put your resume out. They needed to know that they could target companies they wanted to work for and go after them and create job opportunities on their own.</p>\n<h3>Jill K:</h3>\n<p>20:40 So I wrote a book and just gave it away.</p>\n<h3>Jonathan S:</h3>\n<p>20:43 Yeah and that's sort of a good segue into the absolute wealth of information and variety of formats that you have organized on your website. I mean it's almost overwhelming, you have it organized very nicely so it's not overwhelming but it's just a massive amount of information.</p>\n<h3>Jill K:</h3>\n<p>21:02 Yes, okay so here's some of the things that you need to know. I have said before that I'm on a mission type thing, and I feel compelled to do this, you know write the selling to big companies book, put stuff out there. 10 years ago, 15 years ago, I can't remember exactly in the time frame, I said to myself, \"How can I give my expertise away for free and make good money doing it?\" Which is an interesting question to pose. Cause it's doesn't sound like there's an answer. How can I give stuff away for free and make good money doing that?</p>\n<h3>Jill K:</h3>\n<p>21:40 And at that point I didn't know the answer, but one of the things I've always done is I've posed the question to myself, you know, like I said, how can I help these small businesses who don't know how to sell and don't have any money, how can I serve them? And you know, my brain works on it for three to four months and suddenly one day the answer miraculously appears. So anyway, I did I posed the question, How can I give away my expertise for free and make good money doing it? And a few months later a company contacted me about writing an e-book and they said, \"We will market it to the VP of sales.\" Which is my target demographic and I knew that their technology, you know, it was good for them to bless my work and for me to create an e-book for them.</p>\n<h3>Jill K:</h3>\n<p>22:29 SO I wrote an e-book for them, put it out there and three months later D and B called, Dun and Bradstreet called and said, \"We saw this book that you wrote for this company and we would really like you to write an e-book for us and we'll share it with our readers.\" And you know, for Dun and Bradstreet to say that it was pretty cool, right? I mean, again, they had a division that was going after VP's of sales, my target readers. And so we talked and kinda focused on what the e-book would be like and I'm talking an e-book probably of two to three thousand words, just for context for people. And they would do the design of the e-book and I would simply do the words.</p>\n<h3>Jill K:</h3>\n<p>23:05 So we got done talking, had honed in on the topic and then the lady from D and B said to me, \"How much do you charge for this?\" And now I thought I was doing an e-book from a pure marketing perspective and when she said that I stopped and I said to myself, \"Oh my God, people pay for this kinda stuff.\" And so I said, \"3,000 dollars.\" And she said, \"Oh, we can afford that.\" Okay, that's interesting.</p>\n<h3>Jill K:</h3>\n<p>23:41 So I wrote a nice e-book sharing my expertise, Dun and Bradstreet gave it away for free and I made 3,000 dollars. And it was a one week project, not bad. Cause that's also becoming a marketing piece for me out there, do you know what I'm saying?</p>\n<h3>Jonathan S:</h3>\n<p>23:57 Sure.</p>\n<h3>Jill K:</h3>\n<p>23:58 Now I'm giving away my expertise for free to people who need it and I'm getting paid for it. So then the first company that asked me to write the e-book called back said, \"That e-book was the best thing we've ever had, we've had more downloads from a lead generation standpoint, it has been tremendous, we would like you to write another one.\" And I said, \"I would love to do that, but you know I'm really busy right now, and I'm gonna have to charge you to do it, cause it would take away from my work time.\" And they said, \"Oh, how much?\" And I said, \"4,000 dollars.\" And they said, \"Yeah, we can afford that.\"</p>\n<h3>Jill K:</h3>\n<p>24:36 So I took another week and wrote another e-book, you know didn't write the whole time but just kinda thought about it, gave it some structure and then filled in the meat. Again, two to three thousand words, and then I realized that my expertise was a revenue source, and it didn't hit me til that point. So what most consultants don't understand is that there are companies, first of all they serve a certain demographic, like I serve and am an expert for sales people and somebody else might be an expert in pricing, somebody else might be an HR consultant on laws of some sort. There are people out there who sell things to the people we're trying to do work with, you know, like there's a whole bunch of technology people that sell things to my clients, you know, the kinda people I work with, the kinda people I write for.</p>\n<h3>Jill K:</h3>\n<p>25:27 And so I literally created a business model where I did a couple things, number one I created content and I still do, I create content for companies who are trying to reach salespeople, and I get paid really good money to create e-books. My daughter when she was out of college, in her 20's went to work for a company that was an agency and she actually wrote articles and blog posts for Linkedin and e-books for Linkedin and her agency was paid 20,000 dollars to write an e-book, so now I raised my fee.</p>\n<h3>Rochelle M:</h3>\n<p>26:02 Yeah.</p>\n<h3>Jill K:</h3>\n<p>26:04 And get paid 20,000 dollars to write an e-book. Because kids that were right out of college were writing these e-books from agencies and they were getting expert opinions and putting it together where I who am the expert can sit down, you know and write e-books and then they have the authority of my expertise as opposed to just Linkedin e-books. So they can market it better. So lead generation is crucial for a lot of companies today, they're desperately searching for content, content can be delivered in multiple formats, I have written e-books, now I'm doing interviews with people as part of my content, I've done video segments from a content perspective. I've done podcasts, you know, I do webinars, I get paid to do webinars, which they use, \"Oh we're having a webinar with Jill Konrath and you know sign up, it's free.\"</p>\n<h3>Jill K:</h3>\n<p>26:53 But it's free for the people who sign up, but it's not free, I'm not giving away my time, I'm being paid to do it cause I'm an expert in this field. And so I have an entire business model that is set on giving away stuff for free and making good money doing it.</p>\n<h3>Rochelle M:</h3>\n<p>27:08 Wow. I love that explanation, Jonathan I'm picturing our listeners going, \"really? I can do that?\"</p>\n<h3>Jill K:</h3>\n<p>27:16 Oh my God, you guys there's so much money in lead generation, people are paying 10 or 20 thousand dollars to have an e-book and you don't even have to be an expert, you know like a well known expert, you could easily charge like I said, I started at 4,000 dollars to have an e-book that was marketed to my target market. So other companies are blessing me by saying, \"here's an expert\" they're putting me in front of my targeted client who's getting free advice and I'm making good money. And word comes from that, that's what you've gotta realize, it does come back to me in a different way.</p>\n<h3>Jill K:</h3>\n<p>27:52 The other thing I've found and a lot of people don't realize this too is the importance of having a good database as a consultant, a database, a newsletter list. Because and here's what I can tell you I discovered, again I reach a certain demographic and a few years back after I asked that question, \"How can I give away my expertise for free and make good money doing that?\" You know, I write this newsletter and somebody approached me and said we have a client who would like to know if you would write about this e-book in your newsletter, or if you'd promote this e-book in your newsletter. And I said, \"I don't promote other people's stuff in my newsletter, you know, I just write my stuff.\"</p>\n<h3>Jill K:</h3>\n<p>28:35 And they said, \"Could we pay you to do that?\" And I said, \"Why don't you send me the e-book and I'll take a look at it?\" And they sent me this e-book that was written and it was perfect for my audience, I mean they would love it, it was well written, it wasn't promotional at all, it was really excellent content and they paid me 4,000 dollars to do that, you know it's like, oh my God, all I had to do was send a newsletter to my database, all I had to do, \"Here's a really good e-book on this. When you read it you'll discover ...\" And I had three bullet points and then at the bottom I'd write complements of my vendor, and I'd have a link, you know.</p>\n<h3>Jill K:</h3>\n<p>29:15 And I'd be paid to do that. So once I discovered that my database was an asset, I started building my database so I could charge more. I know, but it allows me to give away good stuff for free and to get paid doing it, which allows me to stop and create more new content. It's the creation stuff that's fun for me, so how can I constantly be in a creation mode and give my stuff away for free so I can create new stuff.</p>\n<h3>Rochelle M:</h3>\n<p>29:43 Well and this sense of mission that you have just kind of bleeds into everything which I love, I feel like that's your fuel.</p>\n<h3>Jill K:</h3>\n<p>29:51 Yeah, it is my fuel, I mean you know money used to be my fuel and since I discovered, I mean when I got hooked on helping small businesses, which ultimately I did this selling to big companies stuff, suddenly everything changed and my business kind of exploded on me when I was really trying to be more generous with the world, does that make sense? And so something and it really did explode on me and everything changed and I became the internationally recognized person, but that was never ever my goal. But I became that.</p>\n<h3>Rochelle M:</h3>\n<p>30:27 Wow.</p>\n<h3>Jonathan S:</h3>\n<p>30:29 How do speaking engagements figure into the mix?</p>\n<h3>Jill K:</h3>\n<p>30:32 Well I don't do consulting anymore, okay, I literally had to make a choice a few years ago, probably seven years ago now. Much as I love doing consulting work, what I discovered was that doing consulting work was ... my whole brain got wrapped up in my client, you know what I mean? You get so immersed in the work and every creative thought I had was, \"Oh God how am I gonna solve that? Or what am I gonna do? How do I fix that?\" And it took up all my creative energy and I had made a decision then that I could either serve one client really well or I could serve a variety of people out there. And so I made a choice to serve a variety of people and to serve the world as opposed to my one client, which meant I had to walk away from consulting entirely and move into speaking, which is not something I'd done too much of, you know.</p>\n<h3>Jill K:</h3>\n<p>31:27 So then I had to become a speaker, which is something I never wanted to do, but I became one because I wanted to share what I learned. I feel like I'm a real oddball here talking, but it's like if you're sort of on this mission and you've learned this stuff about you know how to sell to these companies, or how to be more successful or how to, you know how to get your life back in order, those are important things. I want people to know then so they don't have to go through the same learning curve that I had to go through.</p>\n<h3>Jill K:</h3>\n<p>32:01 So how does speaking fit in? Speaking fits</p>\n<h3>Jill K:</h3>\n<p>32:00 ... curve that I had to go through. How does speaking feed in? Speaking feeds in because I get paid well to do it and it gives me a chance to be in front of more people, and to have a broader impact. But it pays really, really well.</p>\n<h3>Rochelle M:</h3>\n<p>32:16 You've got an international footprint, yes?</p>\n<h3>Jill K:</h3>\n<p>32:18 Yes. Last month I was in Milan, Italy. Wrapped a nice vacation around it so it was a lot of fun.</p>\n<h3>Jonathan S:</h3>\n<p>32:27 Nice.</p>\n<h3>Rochelle M:</h3>\n<p>32:28 That sounds perfect.</p>\n<h3>Jill K:</h3>\n<p>32:29 It was perfect.</p>\n<h3>Jonathan S:</h3>\n<p>32:36 It feels like each of these different sorts of packaging of your expertise, each of these different offerings if you will even if they're free, blogposts and e-books and worksheets and videos and speeches and books. They all ... sort of like what people refer to as a flywheel effect where you've got this very, very clear focus at the hub, in the center. And everything just revolves around it. It's adding a little bit. And once it's going, adding more energy to that motion just keeps it in motion, keeps it accelerating.</p>\n<h3>Jill K:</h3>\n<p>33:15 Yeah. It does.</p>\n<h3>Jonathan S:</h3>\n<p>33:16 I'm curious if there were any spikes or anything in particular that you noticed really noticed upped the ante for you? Was very successful for you and got you to a new level? I don't know, one of the books perhaps being super successful. Or was it ... Was there anything in particular that you could share with the listeners that you look back and say, \"That ...\" Maybe you didn't know it at the time but, \"Man. That was smart. That really worked out for me.\"</p>\n<h3>Jill K:</h3>\n<p>33:45 Oh man. A lot of things have worked out for me.</p>\n<h3>Jonathan S:</h3>\n<p>33:53 It seems that way. And that was a perfectly good answer. I'm kind of hoping you say, \"No,\" because-</p>\n<h3>Jill K:</h3>\n<p>33:58 There's no magic here.</p>\n<h3>Jonathan S:</h3>\n<p>33:59 Right.</p>\n<h3>Jill K:</h3>\n<p>33:59 I mean like I said, this wasn't my goal. My goal was to do the work and to get paid a living wage. Have a good enough income that I felt decent about the work that I was doing.</p>\n<h3>Jill K:</h3>\n<p>34:09 I have passed up a significant number of revenue opportunities that have come my way. And I have chosen not to do certain things because of lifestyle choices. You know, I do speak but man, I'm not promoting myself as somebody who's on the road 250 days a year. That's like crazy for me. I don't want to do that. Speaking 20 times a year is sufficient. You can tell I'm not totally driven by money but I'm making really good money, you know? I have been approached numerous times to do online training courses and I have not done them. I've not done them.</p>\n<h3>Jonathan S:</h3>\n<p>34:46 What's the thinking there?</p>\n<h3>Jill K:</h3>\n<p>34:48 Well because I have seen a lot of people do them and I am very aware that it's not about the training program. A lot of people have created really good training programs. They've invested a ton of money in these things. And then in order to be profitable, they have to go into marketing mode and they have to have a large enough footprint out there from a database perspective or they have to be constantly marketing. And I don't want to do that. I want to give away my stuff for free and make good money doing it.</p>\n<h3>Jill K:</h3>\n<p>35:21 It's more fun for me to give it away. So I found another way so I don't have to keep selling programs. I just keep giving away stuff. And I go to companies and say, \"I have an idea for something on how I can help you,\" and I pitch my ideas to companies about how I can create content. How I can create content that they can leverage. And what people don't realize is the lead generation machines of companies are desperate for content. If you have a niche and an expertise in a certain area, there are somebody who's trying to reach the person that you work with. I don't care if it's auditors or warehouse foremen. Somebody's trying to reach them.</p>\n<h3>Jill K:</h3>\n<p>36:08 And who are these companies who are selling to these people and how can you create some good content that they can give away for free to attract these people into their database because they need to talk to them. They want something that is good. We're experts and we don't value our content. But they're paying kids out of college big bucks to write articles or to write e-books or to do things that we, who are experts, could do and do it so much better than.</p>\n<h3>Jill K:</h3>\n<p>36:39 I mean to me that's an opportunity that virtually every consultant is totally blind to. I went to speak at National Speakers Association at one of their events a few years back. And I was explaining this to people. And again, most people look at me like, \"I couldn't do that. That's really weird.\" But one guy came up to me afterwards. He said, \"I am an expert in aging population and how to take care of aging parents.\" That's his expertise. And he said, \"I have a 30000 word document right now that I was thinking of putting out as a book.\" He said, \"What you've done is you've given me an idea.\" And he went to New York Life Insurance company with his idea because they had a product on elderly care product. And he sold them, his first time out contacting New York Life, going after the lead generation or demand generation department in their marketing arena and talk with them about creating an e-book on how to take care of your elderly parents or how do you decide on which senior place is the best for your elderly parents. And $30000 you know? On his first time out. And he already had the content.</p>\n<h3>Rochelle M:</h3>\n<p>37:51 Not bad.</p>\n<h3>Jill K:</h3>\n<p>37:52 You don't make that much from writing a book usually, you know what I mean?</p>\n<h3>Jonathan S:</h3>\n<p>37:56 Not your first one.</p>\n<h3>Jill K:</h3>\n<p>37:56 Not your first one. No.</p>\n<h3>Rochelle M:</h3>\n<p>37:56 Exactly.</p>\n<h3>Jonathan S:</h3>\n<p>37:59 I'm having my own light bulb moment here because I've actually been hired to do things like you're describing. And it never occurred to me that they were anything other than random one off edge cases where I've written a bunch of books. The target market is always software developers, specifically web developers, and have been hired by big companies to essentially do exactly to the letter what you're describing here.</p>\n<h3>Jill K:</h3>\n<p>37:59 And?</p>\n<h3>Jonathan S:</h3>\n<p>38:26 And it was great. It's great money. It's exactly what you're saying. It's great money. It's great exposure. You get to share ideas for free. You get the third party endorsement of whoever, Nokia or Cisco or whoever else, Intel.</p>\n<h3>Jill K:</h3>\n<p>38:44 Yeah. Right.</p>\n<h3>Jonathan S:</h3>\n<p>38:46 But the shoe that never dropped for me, was that you could actually go after that kind of work specifically. It just seemed to me so random and so ... I mean now that you're saying it, it's obvious that it's not. But it never even occurred to me to think like, \"Oh. That could be my whole business.\" It surely could have.</p>\n<h3>Jill K:</h3>\n<p>39:08 I mean the two things about leveraging my database and sharing information about good webinars that are coming up or good e-books that other companies have written and the combination of doing my own content creation for companies was 50% of my revenue last year. And it was fun work.</p>\n<h3>Jonathan S:</h3>\n<p>39:25 Right. It is fun.</p>\n<h3>Jill K:</h3>\n<p>39:26 And you know some of the projects, some of the e-books that I wrote in the last couple years and talking with people, I interview some of their best clients. And I write up like ... One e-book I did was for a company called Velocify that does software for inside sales, inside sales people that call on the phone. And they had me interview five VPs of Sales that are running high performance teams, sales teams.</p>\n<h3>Jill K:</h3>\n<p>39:55 And I wrote an e-book. It was fast, it was fun to do because I got to talk to all these five people and get inside their brain. And these are, again, people like my customers, you know. I got to interview them and then I got to write up seven things I learned from them in an e-book. The 7 Characteristics of Top Performing Sales Leaders. You know it was like, \"Oh that was fun. It gave me more recent connectivity with my base. I got to ask insightful questions. They were delighted to be included in the project. It's like, \"Man. This is cool work.\"</p>\n<h3>Rochelle M:</h3>\n<p>40:30 Win, win, win.</p>\n<h3>Jill K:</h3>\n<p>40:31 Win, win, win. Win, win, win. Yeah.</p>\n<h3>Jonathan S:</h3>\n<p>40:33 So if someone was going to ... I know specific individuals who are more ... I think they would refer to themselves as copywriters or data analysts and they don't see themselves as maybe as big of an expert at their area of expertise than I would consider them to be. Who I imagine will listen to this and not perhaps be skeptical or clueless about what next steps to take if maybe they are interested in experimenting with these ideas. As a sales expert, what would somebody in a situation like that do as a first step?</p>\n<h3>Jill K:</h3>\n<p>41:12 First. So if you wanted to do this to make money doing? Like what I was just describing?</p>\n<h3>Jonathan S:</h3>\n<p>41:19 Right. You know you said that companies are desperate for lead generation.</p>\n<h3>Jill K:</h3>\n<p>41:23 They really are.</p>\n<h3>Jonathan S:</h3>\n<p>41:23 College kids to do it. I know for sure that there are tons of listeners of this show and also another show that I do that are just ... They say all the time, \"People don't value what I do. What I do is a commodity.\" They're trying to sell themselves by the hour on Upwork. They're competing with people in the Philippines who are charging $3 an hour. They feel like giving up frankly. And this is a very, very interesting approach that has never occurred to me consciously before but I wouldn't know where to recommend that they start.</p>\n<h3>Jill K:</h3>\n<p>42:01 Right. Most people don't because they don't understand sales. They don't understand lead generation either. They just don't think that people are doing that. But if they understood, first of all, that companies are desperately trying to get people in to their database so that they can initiate conversations with them about potentially buying a product or service.</p>\n<h3>Jill K:</h3>\n<p>42:25 The first place you have to start is saying, \"Well who are the people that I'm continually working with? Is it Purchasing? Is it Marketing? CMOs? Where am I working?\" And you have to say then, \"Who is trying to sell these people things?\" And honestly, if you're working in Marketing and selling with CMOs, you could talk to the CMO and say, \"You know, what kind of things do you make decisions about?\" And they might say, \"Well, we make decisions about technology. There's a lot of marketing technology right now. Or we make decisions about this or that.\"</p>\n<h3>Jill K:</h3>\n<p>43:01 Whatever they tell you, then you have to find out what companies are in that business. But if you're selling to the CMO, which technologies are trying to reach the CMO? Or if you're selling to an attorney or law firm, which companies are trying to reach law firms to sell them what? What products and services? And you have to just start thinking about it and start researching the companies. And there's no shortcut to do that.</p>\n<h3>Jill K:</h3>\n<p>43:26 But once you start researching the companies and you say, \"Oh this company sounds like ... It's kind of aligned with what I do. And we're kind of talking the same thing. I'm just helping on the edges of it.\" Then you have to look and you have to go to LinkedIn and you have to look and google things like demand generation or lead generation and find out who's in their Marketing department. And take a look if they have any -- I go to their website and I'd take a look -- are they offering any e-books? Do they have webinars? Do they have infographics. I've been paid a lot of money for one page cheat sheets too. Little one page cheat sheets. Blah, blah, blah. I can't talk. A little one page cheat sheet that I've written. I got $3000 for writing something that I already knew and that didn't take very long.</p>\n<h3>Jill K:</h3>\n<p>44:21 But just going to the website and seeing are they doing lead generation on their website. And you can tell they're doing it if you have to fill out your name for something and give them an email address. Then you know they're doing lead generation, right?</p>\n<h3>Jonathan S:</h3>\n<p>44:35 Sure. It's obvious.</p>\n<h3>Jill K:</h3>\n<p>44:36 It's obvious. So once you know, yes they are leveraging lead generation and you don't want to talk somebody into it because they don't get it. You want to always work somebody who gets it. And see what they have. And see if you can think of an idea to add something else.</p>\n<h3>Jill K:</h3>\n<p>44:55 Like the one I was talking about before with Velocify. I went to them with an idea because I checked out their website and they didn't have anything on onboarding sales people. Nothing. Nothing. And so I suggested that they might want to consider that and let's talk. You can send out an email to the head of lead gen.  By the way not just one because if you look at any of my books, you'll find out it takes eight to ten touches, contacts in order for this person to get back to you. But you initiate contact and you suggest an idea, then you state that you've been on their website, it looks like their doing lead generation. You have some ideas on how to create an e-book or do a webinar, whatever it is that you want to create yourself. And just suggest that you set up a time to talk. It's not pitching them on your writing skills. It's suggesting that you have an idea that might help them generate more leads.</p>\n<h3>Jonathan S:</h3>\n<p>45:54 And generating more leads, as we all know, is a very desirable business outcome for certain people.</p>\n<h3>Jill K:</h3>\n<p>45:59 Oh my God. Yes. It's what they want. And if it's in your area of expertise, you know this stuff and you can write an e-book and being paid $10000 or whatever to sit down and write an e-book in one week, that's 2000 to 3000 words.</p>\n<h3>Jonathan S:</h3>\n<p>46:14 Mm-hmm (affirmative). Right.</p>\n<h3>Jill K:</h3>\n<p>46:15 That's not a lot of writing. My first two books are 60000 words and my second two are about 40000 to 45000, so.</p>\n<h3>Jonathan S:</h3>\n<p>46:26 Yeah it's super doable. It's just great. This is great.</p>\n<h3>Rochelle M:</h3>\n<p>46:29 I just want to point out to our audience that the key is knowing who you're serving. Knowing who your sweet spot is. Being crystal clear is going to help you. You can't start this without knowing that.</p>\n<h3>Jill K:</h3>\n<p>46:42 You can't.</p>\n<h3>Jonathan S:</h3>\n<p>46:48 Yeah, it's critical. The whole idea falls apart if you don't have that.</p>\n<h3>Jill K:</h3>\n<p>46:48 It sort of goes back to ... You talked about selling to big companies at the onset. I mean selling to big companies is about really knowing who your target market is. Who am I going after? Who is this company? Who is the specific buyer? What value do I bring? It's about focusing and creating a conversation with somebody you want to reach. It all goes full circle.</p>\n<h3>Jonathan S:</h3>\n<p>47:12 Well that's a perfect segue into a wrap-up.</p>\n<h3>Rochelle M:</h3>\n<p>47:16 That's where I was going. [inaudible 00:47:18] better myself. Perfect.</p>\n<h3>Jonathan S:</h3>\n<p>47:20 Well thanks so much for joining us Jill. This has been solid gold, just really, really great. Where should people go to find out more about you and your books and all the other wonderful things that you have available?</p>\n<h3>Jill K:</h3>\n<p>47:31 JillKonrath.com. That's it. JillKonrath.com.</p>\n<h3>Jonathan S:</h3>\n<p>47:35 Perfect.</p>\n<h3>Jill K:</h3>\n<p>47:35 Konrath with a K.</p>\n<h3>Jonathan S:</h3>\n<p>47:37 Yes. We will absolutely link all of this up in the show notes. Jill with a J. Konrath with a K.</p>\n<h3>Jill K:</h3>\n<p>47:44 Yeah.</p>\n<h3>Jonathan S:</h3>\n<p>47:47 Alright great. Well thanks again for joining us.</p>\n<h3>Rochelle M:</h3>\n<p>47:49 Thank you so much.</p>\n<h3>Jonathan S:</h3>\n<p>47:51 That'll do it for the Business of Authority. Thank you so much for joining us and we'll talk to you again next week. Bye.</p>\n<h3>Rochelle M:</h3>\n<p>47:57 Bye bye.</p>\n",
  "enclosure": "",
  "itunes:title": "Jill Konrath - Getting Paid To Give (Almost) Everything Away",
  "itunes:author": "Jonathan Stark and Rochelle Moulton",
  "itunes:image": "",
  "itunes:duration": "00:47:59",
  "itunes:summary": "How to give away expertise for free and make good money doing it",
  "itunes:subtitle": "How to give away expertise for free and make good money doing it",
  "itunes:keywords": "authority, consulting, business, marketing, branding",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 36
}