{
  "title": "Episode 79: &#8220;Sweet Nothin&#8217;s&#8221; by Brenda Lee",
  "link": "https://500songs.com/podcast/episode-79-sweet-nothins-by-brenda-lee/",
  "pubDate": "Wed, 22 Apr 2020 03:09:44 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-79-sweet-nothins-by-brenda-lee/",
  "description": "Episode seventy-nine of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Sweet Nothin's\" by Brenda Lee, and at the career of a performer who started in the 1940s and who was most recently in the top ten only four months ago. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/36264530\"> on \"16 Candles\" by the Crests.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\nErrata: I say that the A-Team played on “every” rock and roll or country record out of Nashville. This is obviously an exaggeration. It was just an awful lot of the most successful ones.\n\nIt has also been pointed out to me that the version of \"Dynamite\" I use in the podcast is actually a later remake by Lee. This is one of the perennial problems with material from this period -- artists would often remake their hits, sticking as closely as possible to the original, and these remakes often get mislabelled on compilation CDs. My apologies.\n\n<strong>Resources</strong>\n\nAs always, I've put together <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-79-sweet-nothins/\">a Mixcloud playlist</a> of all the songs excerpted in the episode.\n\nMost of the information in here comes from Brenda Lee's autobiography, <em><a href=\"https://amzn.to/2VSbwQS\">Little Miss Dynamite</a>, </em>though as with every time I rely on an autobiography I've had to check the facts in dozens of other places.\n\nAnd there are many decent, cheap, compilations of Lee's music. <a href=\"https://amzn.to/3cDAjio\">This one</a> is as good as any.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nA couple of months ago, we looked in some detail at the career of Wanda Jackson, and in the second of those episodes we talked about how her career paralleled that of Brenda Lee, but didn't go into much detail about why Lee was important.\n\nBut Brenda Lee was the biggest solo female star of the sixties, even though her music has largely been ignored by later generations. According to Joel Whitburn, she was the fourth most successful artist in terms of the American singles charts in that whole decade -- just behind the Beatles, Elvis Presley, and Ray Charles, and just ahead of the Supremes and the Beach Boys, in that order.\n\nDespite the fact that she's almost completely overlooked now, she was a massively important performer -- while membership of the \"hall of fame\" doesn't mean much in itself, it does say something that so far she is the *only* solo female performer to make both the rock and roll and country music halls of fame. And she's the only performer we've dealt with so far to have a US top ten hit in the last year. So today we're going to have a look at the career of the girl who was known as \"Little Miss Dynamite\":\n\n[Excerpt: Brenda Lee, \"Sweet Nothin's\"]\n\nLee's music career started before she was even in school. She started performing when she was five, and by the time she was six she was a professional performer. So by the time she first came to a wider audience, aged ten, she was already a seasoned professional. Her father died when she was very young, and she very quickly became the sole breadwinner of the household. She changed her name from Brenda Tarpley to the catchier Brenda Lee, she started performing on the Peach Blossom Special, a local sub-Opry country radio show, and she got her own radio show. Not only that, her stepfather opened the Brenda Lee Record Shop, where she would broadcast her show every Saturday -- a lot of DJs and musicians performed their shows in record shop windows at that time, as a way of drawing crowds into the shops. All of this was before she turned eleven.\n\nOne small piece of that radio show still exists on tape -- some interaction between her and her co-host Peanut Faircloth, who was the MC and guitar player for the show -- and who fit well with Brenda, as he was four foot eight, and Brenda never grew any taller than four foot nine.\n\nYou can hear that when she was talking with Faircloth, she was as incoherent as any child would be:\n\n[Excerpt: Brenda Lee and Peanut Faircloth dialogue]\n\nBut when she sang on the show, she sounded a lot more professional than almost any child vocalist you'll ever hear:\n\n[Excerpt: Brenda Lee and Peanut Faircloth, \"Jambalaya\"]\n\nHer big break actually came from *not* doing a show. She was meant to be playing the Peach Blossom Special one night, but she decided that rather than make the thirty dollars she would make from that show, she would go along to see Red Foley perform.\n\nFoley was one of the many country music stars who I came very close to including in the first year of this podcast. He was one of the principal architects of the hillbilly boogie style that led to the development of rockabilly, and he was a particular favourite of both Elvis Presley and Jerry Lee Lewis -- Elvis' first ever public performance was him singing one of Foley's songs, the ballad \"Old Shep\". But more typical of Foley's style was his big hit \"Sugarfoot Rag\":\n\n[Excerpt: Red Foley, \"Sugarfoot Rag\"]\n\nFoley had spent a few years in semi-retirement -- his wife had died by suicide a few years earlier, and he had reassessed his priorities a little as a result. But he had recently been tempted back out onto the road as a result of his being offered a chance to host his own TV show, the Ozark Jubilee, which was one of the very first country music shows on television. And the Ozark Jubilee put on tours, and one was coming to Georgia.\n\nPeanut Faircloth, who worked with Brenda on her radio show, was the MC for that Ozark Jubilee show, and Brenda's parents persuaded Faircloth to let Brenda meet Foley, in the hopes that meeting him would give Brenda's career a boost. She not only got to meet Foley, but Faircloth managed to get her a spot on the show, singing \"Jambalaya\".\n\nRed Foley said of that performance many years later:\n\n\"I still get cold chills thinking about the first time I heard that voice. One foot started patting rhythm as though she was stomping out a prairie fire but not another muscle in that little body even as much as twitched. And when she did that trick of breaking her voice, it jarred me out of my trance enough to realize I'd forgotten to get off the stage. There I stood, after 26 years of supposedly learning how to conduct myself in front of an audience, with my mouth open two miles wide and a glassy stare in my eyes.\"\n\nFoley got Brenda to send a demo tape to the producers of the Ozark Jubilee -- that's the tape we heard earlier, of her radio show, which was saved in the Ozark Jubilee's archives, and Brenda immediately became a regular on the show. Foley also got her signed to Decca, the same label he was on, and she went into the studio in Nashville with Owen Bradley, who we've seen before producing Buddy Holly, Gene Vincent, Johnny Burnette, and Wanda Jackson, though at this point Bradley was only the engineer and pianist on her sessions -- Paul Cohen was the producer.\n\nHer first single was released in September 1956, under the name \"Little Brenda Lee (9 Years Old)\", though in fact she was almost twelve when it came out. It was a version of \"Jambalaya\", which was always her big showstopper on stage:\n\n[Excerpt: Little Brenda Lee (9 Years Old), \"Jambalaya\"]\n\nNeither that nor her follow-up, a novelty Christmas record, were particularly successful, but they were promoted well enough to get her further national TV exposure. It also got her a new manager, though in a way she'd never hoped for or wanted.\n\nHer then manager, Lou Black, got her a spot performing at the national country DJs convention in Nashville, where she sang \"Jambalaya\" backed by Bob Wills and the Texas Playboys. She went down a storm, but the next night Black died suddenly, of a heart attack. Dub Albritten, Red Foley's manager, was at the convention, and took the opportunity to sign Brenda up immediately.\n\nAlbritten got her a lot of prestigious bookings -- for example, she became the youngest person ever to headline in Las Vegas, on a bill that also included a version of the Ink Spots -- and she spent the next couple of years touring and making TV appearances. As well as her regular performances on the Ozark Jubilee she was also a frequent guest on the Steve Allen show and an occasional one on Perry Como's.\n\nShe was put on country package tours with George Jones and Patsy Cline, and on rock and roll tours with Danny & the Juniors, the Chantels, and Mickey & Sylvia. This was the start of a split in the way she was promoted that would last for many more years.\n\nAlbritten was friends with Colonel Tom Parker, and had a similar carny background -- right down to having, like Parker, run a scam where he put a live bird on a hot plate to make it look like it was dancing, though in his case he'd done it with a duck rather than a chicken. Albritten had managed all sorts of acts -- his first attempt at breaking the music business was when in 1937 he'd helped promote Jesse Owens during Owens' brief attempt to become a jazz vocalist, but he'd later worked with Hank Williams, Hank Snow, and Ernest Tubb before managing Foley.\n\nBrenda rapidly became a big star, but one thing she couldn't do was get a hit record. The song \"Dynamite\" gave her the nickname she'd be known by for the rest of her life, \"Little Miss Dynamite\", but it wasn't a hit:\n\n[Excerpt: Little Brenda Lee, \"Dynamite\"]\n\nAnd while her second attempt at a Christmas single, \"Rockin' Around the Christmas Tree\", didn't chart at all at the time, it's been a perennial hit over the decades since -- in fact its highest position on the charts came in December 2019, sixty-one years after it was released, when it finally reached number two on the charts:\n\n[Excerpt: Little Brenda Lee, \"Rockin' Around the Christmas Tree\"]\n\nPart of the problem at the beginning had been that she had clashed with Paul Cohen -- they often disagreed about what songs she should perform. But Cohen eventually left her in the charge of Owen Bradley, who would give her advice about material, but let her choose it herself.\n\nWhile her records weren't having much success in the US, it was a different story in other countries. Albritten tried -- and largely succeeded -- to make her a breakout star in countries other than the US, where there was less competition. She headlined the Paris Olympia, appeared on Oh Boy! in the UK, and inspired the kind of riots in Brazil that normally didn't start to hit until Beatlemania some years later -- and to this day she still has a very substantial Latin American fanbase as a result of Albritten's efforts.\n\nBut in the US, her rockabilly records were unsuccessful, even as she was a massively popular performer live and on TV. So Bradley decided to take a different tack. While she would continue making rock and roll singles, she was going to do an album of old standards from the 1920s, to be titled \"Grandma, What Great Songs You Sang!\"\n\nBut that was no more successful, and it would be from the rockabilly world that Brenda's first big hit would come.\n\nBrenda Lee and Red Foley weren't the only acts that Dub Albritten managed. In particular, he managed a rockabilly act named Ronnie Self. Self recorded several rockabilly classics, like \"Ain't I'm A Dog\":\n\n[Excerpt: Ronnie Self, \"Ain't I'm A Dog\"]\n\nSelf's biggest success as a performer came with \"Bop-A-Lena\", a song clearly intended to cash in on \"Be-Bop-A-Lula\", but ending up sounding more like Don and Dewey -- astonishingly, this record, which some have called \"the first punk record\" was written by Webb Pierce and Mel Tillis, two of the most establishment country artists around:\n\n[Excerpt: Ronnie Self, \"Bop-A-Lena\"]\n\nThat made the lower reaches of the Hot One Hundred, but was Self's only hit as a performer. While Self was talented, he was also unstable -- as a child he had once cut down a tree to block the road so the school bus couldn't get to his house, and on another occasion he had attacked one of his teachers with a baseball bat. And that was before he started the boozing and the amphetamines. In later years he did things like blast away an entire shelf of his demos with a shotgun, get into his car and chase people, trying to knock them down, and set fire to all his gold records outside his publisher's office after he tried to play one of them on his record player and discovered it wouldn't play. Nobody was very surprised when he died in 1981, aged only forty-three.\n\nBut while Self was unsuccessful and unstable, Albritten saw something in him, and kept trying to find ways to build his career up, and after Self's performing career seemed to go absolutely nowhere, he started pushing Self as a songwriter, and Self came up with the song that would change Brenda Lee's career - \"Sweet Nothin's\":\n\n[Excerpt: Brenda Lee, \"Sweet Nothin's\"]\n\n\"Sweet Nothin's\" became a massive hit, reaching number four on the charts both in the UK and the US in early 1960. After a decade of paying her dues, Brenda Lee was a massive rock and roll star at the ripe old age of fifteen.\n\nBut she was still living in a trailer park. Because she was a minor, her money was held in trust to stop her being exploited -- but rather too much was being kept back. The court had only allowed her to receive seventy-five dollars a week, which she was supporting her whole family on. That was actually almost dead on the average wage for the time, but it was low enough that apparently there was a period of several weeks where her family were only eating potatoes. Eventually they petitioned the court to allow some of the money to be released -- enough for her to buy a house for her family.\n\nMeanwhile, as she was now a hitmaker, she was starting to headline her own tours -- \"all-star revues\". But there were fewer stars on them than the audience thought. The Hollywood Argyles and Johnny Preston were both genuine stars, but some of the other acts were slightly more dubious.\n\nShe'd recently got her own backing band, the Casuals, who have often been called Nashville's first rock and roll band. They'd had a few minor local hits that hadn't had much national success, like \"My Love Song For You\":\n\n[Excerpt: The Casuals, \"My Love Song For You\"]\n\nThey were led by Buzz Cason, who would go on to a very long career in the music business, doing everything from singing on some Alvin and the Chipmunks records to being a member of Ronnie and the Daytonas to writing the massive hit \"Everlasting Love\".\n\nThe British singer Garry Mills had released a song called \"Look For A Star\" that was starting to get some US airplay:\n\n[Excerpt: Garry Mills, \"Look For A Star\"]\n\nCason had gone into the studio and recorded a soundalike version, under the name Garry Miles, chosen to be as similar to the original as possible. His version made the top twenty and charted higher than the original:\n\n[Excerpt: Garry Miles, \"Look For A Star\"]\n\nSo on the tours, Garry Miles was a featured act too. Cason would come out in a gold lame jacket with his hair slicked back, and perform as Garry Miles. Then he'd go offstage, brush his hair forward, take off the jacket, put on his glasses, and be one of the Casuals. And then the Casuals would back Brenda Lee after their own set. As far as anyone knew, nobody in the audience seemed to realise that Garry Miles and Buzz Cason were the same person.\n\nAnd at one point, two of the Casuals -- Cason and Richard Williams -- had a minor hit with Hugh Jarrett of the Jordanaires as The Statues, with their version of \"Blue Velvet\":\n\n[Excerpt: The Statues, \"Blue Velvet\"]\n\nAnd so sometimes The Statues would be on the bill too...\n\nBut it wasn't the Casuals who Brenda was using in the studio. Instead it was the group of musicians who became known as the core of the Nashville A-Team -- Bob Moore, Buddy Harmon, Ray Edenton, Hank Garland, Grady Martin, Floyd Cramer, and Boots Randolph. Those session players played on every rock and roll or country record to come out of Nashville in the late fifties and early sixties, including most of Elvis' early sixties records, and country hits by Patsy Cline, Jim Reeves, George Jones and others.\n\nAnd so it was unsurprising that Brenda's biggest success came, not with rock and roll music, but with the style of country known as the Nashville Sound.\n\nThe Nashville Sound is a particular style of country music that was popular in the late fifties and early sixties, and Owen Bradley was one of the two producers who created it (Chet Atkins was the other one), and almost all of the records with that sound were played on by the A-Team. It was one of the many attempts over the years to merge country music with current pop music to try to make it more successful. In this case, they got rid of the steel guitars, fiddles, and honky-tonk piano, and added in orchestral strings and vocal choruses. The result was massively popular -- Chet Atkins was once asked what the Nashville Sound was, and he put his hand in his pocket and jingled his change -- but not generally loved by country music purists.\n\nBrenda Lee's first number one hit was a classic example of the Nashville Sound -- though it wasn't originally intended that that would be the hit.\n\nTo follow up \"Sweet Nothin's\", they released another uptempo song, this time written by Jerry Reed, who would go on to write \"Guitar Man\" for Elvis, among others:\n\n[Excerpt: Brenda Lee, \"That's All You Gotta Do\"]\n\nThat went to number six in the charts -- a perfectly successful follow-up to a number four hit record. But as it turned out, the B-side did even better.\n\nThe B-side was another song written by Ronnie Self -- a short song called \"I'm Sorry\", which Owen Bradley thought little of. He later said \"I thought it kind of monotonous. It was just 'I'm sorry, I'm sorry, I'm sorry' over and over\". But Brenda liked it, and it was only going to be a B-side. The song was far too short, so in the studio they decided to have her recite the lyrics in the middle of the song, the way the Ink Spots did:\n\n[Excerpt: Brenda Lee, \"I'm Sorry\"]\n\nEveryone concerned was astonished when that record overtook its A-side on the charts, and went all the way to number one, even while \"That's All You Gotta Do\" was also in the top ten.\n\nThis established a formula for her records for the next few years -- one side would be a rock and roll song, while the other would be a ballad. Both sides would chart -- and in the US, usually the ballads would chart higher, while in other countries, it would tend to be the more uptempo recordings that did better, which led to her getting a very different image in the US, where she quickly became primarily known as an easy listening pop singer and had a Vegas show choreographed and directed by Judy Garland's choreographer, and in Europe, where for example she toured in 1962 on the same bill as Gene Vincent, billed as \"the King and Queen of Rock and Roll\", performing largely rockabilly music.\n\nThose European tours also led to the story which gets repeated most about Brenda Lee, and which she repeats herself at every opportunity, but which seems as far as I can tell to be completely untrue.\n\nShe regularly claims that after her UK tour with Vincent in 1962, they both went over to tour military bases in Germany, where they met up with Little Richard, and the three of them all went off to play the Star Club in Hamburg together, where the support act was a young band called the Beatles, still with their drummer Pete Best. She says she tried to get her record label interested in them, but they wouldn't listen, and they regretted it a couple of years later.\n\nNow, Brenda Lee *did* play the Star Club at some point in 1962, and I haven't been able to find the dates she played it. But the story as she tells it is full of holes. The tour she did with Gene Vincent ended in mid-April, around the same time that the Beatles started playing the Star Club. So far so good. But then Vincent did another UK tour, and didn't head to Germany until the end of May -- he performed on the same bill as the Beatles on their last three nights there. By that time, Lee was back in the USA -- she recorded her hit \"It Started All Over Again\" in Nashville on May the 18th:\n\n[Excerpt: Brenda Lee, \"It Started All Over Again\"]\n\nLittle Richard, meanwhile, did play the Star Club with the Beatles, but not until November, and he didn't even start performing rock and roll again until October. Brenda Lee is not mentioned in Mark Lewisohn's utterly exhaustive books on the Beatles except in passing -- Paul McCartney would sometimes sing her hit \"Fool #1\" on stage with the Beatles, and he went to see her on the Gene Vincent show when they played Birkenhead, because he was a fan of hers -- and if Lewisohn doesn't mention something in his books, it didn't happen.\n\n(I've tweeted at Lewisohn to see if he can confirm that she definitely didn't play on the same bill as them, but not had a response before recording this).\n\nSo Brenda Lee's most often-told story, sadly, seems to be false. The Beatles don't seem to have supported her at the Star Club.\n\nOver the next few years, she continued to rack up hits both at home and abroad, but in the latter half of the sixties the hits started to dry up -- her last top twenty pop hit in the US, other than seasonal reissues of \"Rockin' Around the Christmas Tree\", was in 1966. But in the seventies, she reinvented herself, without changing her style much, by marketing to the country market, and between 1973 and 1980 she had nine country top ten hits, plus many more in the country top forty. She was helped in this when her old schoolfriend Rita Coolidge married Kris Kristofferson, who wrote her a comeback hit, “Nobody Wins”:\n\n[Excerpt: Brenda Lee, “Nobody Wins”]\n\nHer career went through another downturn in the eighties as fashions changed in country music like they had in pop and rock, but she reinvented herself again, as a country elder stateswoman, guesting with her old friends Kitty Wells and Loretta Lynn on the closing track on k.d. lang's first solo album Shadowland:\n\n[Excerpt: k.d. lang, Kitty Wells, Loretta Lynn, and Brenda Lee, \"Honky Tonk Angels Medley\"]\n\nWhile Lee has had the financial and personal ups and downs of everyone in the music business, she seems to be one of the few child stars who came through the experience happily. She married the first person she ever dated, shortly after her eighteenth birthday, and they remain together to this day -- they celebrate their fifty-seventh anniversary this week. She continues to perform occasionally, though not as often as she used to, and she's not gone through any of the dramas with drink and drugs that killed so many of her contemporaries. She seems, from what I can tell, to be genuinely content. Her music continues to turn up in all sorts of odd ways -- Kanye West sampled \"Sweet Nothin's\" in 2013, on his hit single “Bound 2” – which I'm afraid I can't excerpt here, as the lyrics would jeopardise my iTunes clean rating. And as I mentioned at the start, she had \"Rockin' Around the Christmas Tree\" go to number two on the US charts just last December. And at seventy-five years old, there's a good chance she has many more active years left in her.\n\nI wish I could end all my episodes anything like as happily.",
  "itunes:subtitle": "Episode seventy-nine of A History of Rock Music in Five Hundred Songs looks at Sweet Nothins by Brenda Lee, and at the career of a performer who started in the 1940s and who was most recently in the top ten only four months ago. Click the full post to re",
  "itunes:keywords": "Bob Moore,Bob Wills,Boots Randolph,Brenda Lee,Buzz Cason,Chet Atkins,country and western,Decca Records,Floyd Cramer,Gene Vincent,Grady Martin,Hamburg,Hank Garland,k.d. lang,Kanye West,Little Richard,Nashville,Nashville A Team,Owen Bradley,Red Foley,rockabilly,Ronnie Self,The Beatles,The Casuals,The Jordanaires",
  "itunes:episodeType": "full",
  "itunes:episode": 79,
  "content:encoded": "Episode seventy-nine of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Sweet Nothin's\" by Brenda Lee, and at the career of a performer who started in the 1940s and who was most recently in the top ten only four months ago. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/36264530\"> on \"16 Candles\" by the Crests.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\nErrata: I say that the A-Team played on “every” rock and roll or country record out of Nashville. This is obviously an exaggeration. It was just an awful lot of the most successful ones.\n\nIt has also been pointed out to me that the version of \"Dynamite\" I use in the podcast is actually a later remake by Lee. This is one of the perennial problems with material from this period -- artists would often remake their hits, sticking as closely as possible to the original, and these remakes often get mislabelled on compilation CDs. My apologies.\n\n<strong>Resources</strong>\n\nAs always, I've put together <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-79-sweet-nothins/\">a Mixcloud playlist</a> of all the songs excerpted in the episode.\n\nMost of the information in here comes from Brenda Lee's autobiography, <em><a href=\"https://amzn.to/2VSbwQS\">Little Miss Dynamite</a>, </em>though as with every time I rely on an autobiography I've had to check the facts in dozens of other places.\n\nAnd there are many decent, cheap, compilations of Lee's music. <a href=\"https://amzn.to/3cDAjio\">This one</a> is as good as any.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nA couple of months ago, we looked in some detail at the career of Wanda Jackson, and in the second of those episodes we talked about how her career paralleled that of Brenda Lee, but didn't go into much detail about why Lee was important.\n\nBut Brenda Lee was the biggest solo female star of the sixties, even though her music has largely been ignored by later generations. According to Joel Whitburn, she was the fourth most successful artist in terms of the American singles charts in that whole decade -- just behind the Beatles, Elvis Presley, and Ray Charles, and just ahead of the Supremes and the Beach Boys, in that order.\n\nDespite the fact that she's almost completely overlooked now, she was a massively important performer -- while membership of the \"hall of fame\" doesn't mean much in itself, it does say something that so far she is the *only* solo female performer to make both the rock and roll and country music halls of fame. And she's the only performer we've dealt with so far to have a US top ten hit in the last year. So today we're going to have a look at the career of the girl who was known as \"Little Miss Dynamite\":\n\n[Excerpt: Brenda Lee, \"Sweet Nothin's\"]\n\nLee's music career started before she was even in school. She started performing when she was five, and by the time she was six she was a professional performer. So by the time she first came to a wider audience, aged ten, she was already a seasoned professional. Her father died when she was very young, and she very quickly became the sole breadwinner of the household. She changed her name from Brenda Tarpley to the catchier Brenda Lee, she started performing on the Peach Blossom Special, a local sub-Opry country radio show, and she got her own radio show. Not only that, her stepfather opened the Brenda Lee Record Shop, where she would broadcast her show every Saturday -- a lot of DJs and musicians performed their shows in record shop windows at that time, as a way of drawing crowds into the shops. All of this was before she turned eleven.\n\nOne small piece of that radio show still exists on tape -- some interaction between her and her co-host Peanut Faircloth, who was the MC and guitar player for the show -- and who fit well with Brenda, as he was four foot eight, and Brenda never grew any taller than four foot nine.\n\nYou can hear that when she was talking with Faircloth, she was as incoherent as any child would be:\n\n[Excerpt: Brenda Lee and Peanut Faircloth dialogue]\n\nBut when she sang on the show, she sounded a lot more professional than almost any child vocalist you'll ever hear:\n\n[Excerpt: Brenda Lee and Peanut Faircloth, \"Jambalaya\"]\n\nHer big break actually came from *not* doing a show. She was meant to be playing the Peach Blossom Special one night, but she decided that rather than make the thirty dollars she would make from that show, she would go along to see Red Foley perform.\n\nFoley was one of the many country music stars who I came very close to including in the first year of this podcast. He was one of the principal architects of the hillbilly boogie style that led to the development of rockabilly, and he was a particular favourite of both Elvis Presley and Jerry Lee Lewis -- Elvis' first ever public performance was him singing one of Foley's songs, the ballad \"Old Shep\". But more typical of Foley's style was his big hit \"Sugarfoot Rag\":\n\n[Excerpt: Red Foley, \"Sugarfoot Rag\"]\n\nFoley had spent a few years in semi-retirement -- his wife had died by suicide a few years earlier, and he had reassessed his priorities a little as a result. But he had recently been tempted back out onto the road as a result of his being offered a chance to host his own TV show, the Ozark Jubilee, which was one of the very first country music shows on television. And the Ozark Jubilee put on tours, and one was coming to Georgia.\n\nPeanut Faircloth, who worked with Brenda on her radio show, was the MC for that Ozark Jubilee show, and Brenda's parents persuaded Faircloth to let Brenda meet Foley, in the hopes that meeting him would give Brenda's career a boost. She not only got to meet Foley, but Faircloth managed to get her a spot on the show, singing \"Jambalaya\".\n\nRed Foley said of that performance many years later:\n\n\"I still get cold chills thinking about the first time I heard that voice. One foot started patting rhythm as though she was stomping out a prairie fire but not another muscle in that little body even as much as twitched. And when she did that trick of breaking her voice, it jarred me out of my trance enough to realize I'd forgotten to get off the stage. There I stood, after 26 years of supposedly learning how to conduct myself in front of an audience, with my mouth open two miles wide and a glassy stare in my eyes.\"\n\nFoley got Brenda to send a demo tape to the producers of the Ozark Jubilee -- that's the tape we heard earlier, of her radio show, which was saved in the Ozark Jubilee's archives, and Brenda immediately became a regular on the show. Foley also got her signed to Decca, the same label he was on, and she went into the studio in Nashville with Owen Bradley, who we've seen before producing Buddy Holly, Gene Vincent, Johnny Burnette, and Wanda Jackson, though at this point Bradley was only the engineer and pianist on her sessions -- Paul Cohen was the producer.\n\nHer first single was released in September 1956, under the name \"Little Brenda Lee (9 Years Old)\", though in fact she was almost twelve when it came out. It was a version of \"Jambalaya\", which was always her big showstopper on stage:\n\n[Excerpt: Little Brenda Lee (9 Years Old), \"Jambalaya\"]\n\nNeither that nor her follow-up, a novelty Christmas record, were particularly successful, but they were promoted well enough to get her further national TV exposure. It also got her a new manager, though in a way she'd never hoped for or wanted.\n\nHer then manager, Lou Black, got her a spot performing at the national country DJs convention in Nashville, where she sang \"Jambalaya\" backed by Bob Wills and the Texas Playboys. She went down a storm, but the next night Black died suddenly, of a heart attack. Dub Albritten, Red Foley's manager, was at the convention, and took the opportunity to sign Brenda up immediately.\n\nAlbritten got her a lot of prestigious bookings -- for example, she became the youngest person ever to headline in Las Vegas, on a bill that also included a version of the Ink Spots -- and she spent the next couple of years touring and making TV appearances. As well as her regular performances on the Ozark Jubilee she was also a frequent guest on the Steve Allen show and an occasional one on Perry Como's.\n\nShe was put on country package tours with George Jones and Patsy Cline, and on rock and roll tours with Danny & the Juniors, the Chantels, and Mickey & Sylvia. This was the start of a split in the way she was promoted that would last for many more years.\n\nAlbritten was friends with Colonel Tom Parker, and had a similar carny background -- right down to having, like Parker, run a scam where he put a live bird on a hot plate to make it look like it was dancing, though in his case he'd done it with a duck rather than a chicken. Albritten had managed all sorts of acts -- his first attempt at breaking the music business was when in 1937 he'd helped promote Jesse Owens during Owens' brief attempt to become a jazz vocalist, but he'd later worked with Hank Williams, Hank Snow, and Ernest Tubb before managing Foley.\n\nBrenda rapidly became a big star, but one thing she couldn't do was get a hit record. The song \"Dynamite\" gave her the nickname she'd be known by for the rest of her life, \"Little Miss Dynamite\", but it wasn't a hit:\n\n[Excerpt: Little Brenda Lee, \"Dynamite\"]\n\nAnd while her second attempt at a Christmas single, \"Rockin' Around the Christmas Tree\", didn't chart at all at the time, it's been a perennial hit over the decades since -- in fact its highest position on the charts came in December 2019, sixty-one years after it was released, when it finally reached number two on the charts:\n\n[Excerpt: Little Brenda Lee, \"Rockin' Around the Christmas Tree\"]\n\nPart of the problem at the beginning had been that she had clashed with Paul Cohen -- they often disagreed about what songs she should perform. But Cohen eventually left her in the charge of Owen Bradley, who would give her advice about material, but let her choose it herself.\n\nWhile her records weren't having much success in the US, it was a different story in other countries. Albritten tried -- and largely succeeded -- to make her a breakout star in countries other than the US, where there was less competition. She headlined the Paris Olympia, appeared on Oh Boy! in the UK, and inspired the kind of riots in Brazil that normally didn't start to hit until Beatlemania some years later -- and to this day she still has a very substantial Latin American fanbase as a result of Albritten's efforts.\n\nBut in the US, her rockabilly records were unsuccessful, even as she was a massively popular performer live and on TV. So Bradley decided to take a different tack. While she would continue making rock and roll singles, she was going to do an album of old standards from the 1920s, to be titled \"Grandma, What Great Songs You Sang!\"\n\nBut that was no more successful, and it would be from the rockabilly world that Brenda's first big hit would come.\n\nBrenda Lee and Red Foley weren't the only acts that Dub Albritten managed. In particular, he managed a rockabilly act named Ronnie Self. Self recorded several rockabilly classics, like \"Ain't I'm A Dog\":\n\n[Excerpt: Ronnie Self, \"Ain't I'm A Dog\"]\n\nSelf's biggest success as a performer came with \"Bop-A-Lena\", a song clearly intended to cash in on \"Be-Bop-A-Lula\", but ending up sounding more like Don and Dewey -- astonishingly, this record, which some have called \"the first punk record\" was written by Webb Pierce and Mel Tillis, two of the most establishment country artists around:\n\n[Excerpt: Ronnie Self, \"Bop-A-Lena\"]\n\nThat made the lower reaches of the Hot One Hundred, but was Self's only hit as a performer. While Self was talented, he was also unstable -- as a child he had once cut down a tree to block the road so the school bus couldn't get to his house, and on another occasion he had attacked one of his teachers with a baseball bat. And that was before he started the boozing and the amphetamines. In later years he did things like blast away an entire shelf of his demos with a shotgun, get into his car and chase people, trying to knock them down, and set fire to all his gold records outside his publisher's office after he tried to play one of them on his record player and discovered it wouldn't play. Nobody was very surprised when he died in 1981, aged only forty-three.\n\nBut while Self was unsuccessful and unstable, Albritten saw something in him, and kept trying to find ways to build his career up, and after Self's performing career seemed to go absolutely nowhere, he started pushing Self as a songwriter, and Self came up with the song that would change Brenda Lee's career - \"Sweet Nothin's\":\n\n[Excerpt: Brenda Lee, \"Sweet Nothin's\"]\n\n\"Sweet Nothin's\" became a massive hit, reaching number four on the charts both in the UK and the US in early 1960. After a decade of paying her dues, Brenda Lee was a massive rock and roll star at the ripe old age of fifteen.\n\nBut she was still living in a trailer park. Because she was a minor, her money was held in trust to stop her being exploited -- but rather too much was being kept back. The court had only allowed her to receive seventy-five dollars a week, which she was supporting her whole family on. That was actually almost dead on the average wage for the time, but it was low enough that apparently there was a period of several weeks where her family were only eating potatoes. Eventually they petitioned the court to allow some of the money to be released -- enough for her to buy a house for her family.\n\nMeanwhile, as she was now a hitmaker, she was starting to headline her own tours -- \"all-star revues\". But there were fewer stars on them than the audience thought. The Hollywood Argyles and Johnny Preston were both genuine stars, but some of the other acts were slightly more dubious.\n\nShe'd recently got her own backing band, the Casuals, who have often been called Nashville's first rock and roll band. They'd had a few minor local hits that hadn't had much national success, like \"My Love Song For You\":\n\n[Excerpt: The Casuals, \"My Love Song For You\"]\n\nThey were led by Buzz Cason, who would go on to a very long career in the music business, doing everything from singing on some Alvin and the Chipmunks records to being a member of Ronnie and the Daytonas to writing the massive hit \"Everlasting Love\".\n\nThe British singer Garry Mills had released a song called \"Look For A Star\" that was starting to get some US airplay:\n\n[Excerpt: Garry Mills, \"Look For A Star\"]\n\nCason had gone into the studio and recorded a soundalike version, under the name Garry Miles, chosen to be as similar to the original as possible. His version made the top twenty and charted higher than the original:\n\n[Excerpt: Garry Miles, \"Look For A Star\"]\n\nSo on the tours, Garry Miles was a featured act too. Cason would come out in a gold lame jacket with his hair slicked back, and perform as Garry Miles. Then he'd go offstage, brush his hair forward, take off the jacket, put on his glasses, and be one of the Casuals. And then the Casuals would back Brenda Lee after their own set. As far as anyone knew, nobody in the audience seemed to realise that Garry Miles and Buzz Cason were the same person.\n\nAnd at one point, two of the Casuals -- Cason and Richard Williams -- had a minor hit with Hugh Jarrett of the Jordanaires as The Statues, with their version of \"Blue Velvet\":\n\n[Excerpt: The Statues, \"Blue Velvet\"]\n\nAnd so sometimes The Statues would be on the bill too...\n\nBut it wasn't the Casuals who Brenda was using in the studio. Instead it was the group of musicians who became known as the core of the Nashville A-Team -- Bob Moore, Buddy Harmon, Ray Edenton, Hank Garland, Grady Martin, Floyd Cramer, and Boots Randolph. Those session players played on every rock and roll or country record to come out of Nashville in the late fifties and early sixties, including most of Elvis' early sixties records, and country hits by Patsy Cline, Jim Reeves, George Jones and others.\n\nAnd so it was unsurprising that Brenda's biggest success came, not with rock and roll music, but with the style of country known as the Nashville Sound.\n\nThe Nashville Sound is a particular style of country music that was popular in the late fifties and early sixties, and Owen Bradley was one of the two producers who created it (Chet Atkins was the other one), and almost all of the records with that sound were played on by the A-Team. It was one of the many attempts over the years to merge country music with current pop music to try to make it more successful. In this case, they got rid of the steel guitars, fiddles, and honky-tonk piano, and added in orchestral strings and vocal choruses. The result was massively popular -- Chet Atkins was once asked what the Nashville Sound was, and he put his hand in his pocket and jingled his change -- but not generally loved by country music purists.\n\nBrenda Lee's first number one hit was a classic example of the Nashville Sound -- though it wasn't originally intended that that would be the hit.\n\nTo follow up \"Sweet Nothin's\", they released another uptempo song, this time written by Jerry Reed, who would go on to write \"Guitar Man\" for Elvis, among others:\n\n[Excerpt: Brenda Lee, \"That's All You Gotta Do\"]\n\nThat went to number six in the charts -- a perfectly successful follow-up to a number four hit record. But as it turned out, the B-side did even better.\n\nThe B-side was another song written by Ronnie Self -- a short song called \"I'm Sorry\", which Owen Bradley thought little of. He later said \"I thought it kind of monotonous. It was just 'I'm sorry, I'm sorry, I'm sorry' over and over\". But Brenda liked it, and it was only going to be a B-side. The song was far too short, so in the studio they decided to have her recite the lyrics in the middle of the song, the way the Ink Spots did:\n\n[Excerpt: Brenda Lee, \"I'm Sorry\"]\n\nEveryone concerned was astonished when that record overtook its A-side on the charts, and went all the way to number one, even while \"That's All You Gotta Do\" was also in the top ten.\n\nThis established a formula for her records for the next few years -- one side would be a rock and roll song, while the other would be a ballad. Both sides would chart -- and in the US, usually the ballads would chart higher, while in other countries, it would tend to be the more uptempo recordings that did better, which led to her getting a very different image in the US, where she quickly became primarily known as an easy listening pop singer and had a Vegas show choreographed and directed by Judy Garland's choreographer, and in Europe, where for example she toured in 1962 on the same bill as Gene Vincent, billed as \"the King and Queen of Rock and Roll\", performing largely rockabilly music.\n\nThose European tours also led to the story which gets repeated most about Brenda Lee, and which she repeats herself at every opportunity, but which seems as far as I can tell to be completely untrue.\n\nShe regularly claims that after her UK tour with Vincent in 1962, they both went over to tour military bases in Germany, where they met up with Little Richard, and the three of them all went off to play the Star Club in Hamburg together, where the support act was a young band called the Beatles, still with their drummer Pete Best. She says she tried to get her record label interested in them, but they wouldn't listen, and they regretted it a couple of years later.\n\nNow, Brenda Lee *did* play the Star Club at some point in 1962, and I haven't been able to find the dates she played it. But the story as she tells it is full of holes. The tour she did with Gene Vincent ended in mid-April, around the same time that the Beatles started playing the Star Club. So far so good. But then Vincent did another UK tour, and didn't head to Germany until the end of May -- he performed on the same bill as the Beatles on their last three nights there. By that time, Lee was back in the USA -- she recorded her hit \"It Started All Over Again\" in Nashville on May the 18th:\n\n[Excerpt: Brenda Lee, \"It Started All Over Again\"]\n\nLittle Richard, meanwhile, did play the Star Club with the Beatles, but not until November, and he didn't even start performing rock and roll again until October. Brenda Lee is not mentioned in Mark Lewisohn's utterly exhaustive books on the Beatles except in passing -- Paul McCartney would sometimes sing her hit \"Fool #1\" on stage with the Beatles, and he went to see her on the Gene Vincent show when they played Birkenhead, because he was a fan of hers -- and if Lewisohn doesn't mention something in his books, it didn't happen.\n\n(I've tweeted at Lewisohn to see if he can confirm that she definitely didn't play on the same bill as them, but not had a response before recording this).\n\nSo Brenda Lee's most often-told story, sadly, seems to be false. The Beatles don't seem to have supported her at the Star Club.\n\nOver the next few years, she continued to rack up hits both at home and abroad, but in the latter half of the sixties the hits started to dry up -- her last top twenty pop hit in the US, other than seasonal reissues of \"Rockin' Around the Christmas Tree\", was in 1966. But in the seventies, she reinvented herself, without changing her style much, by marketing to the country market, and between 1973 and 1980 she had nine country top ten hits, plus many more in the country top forty. She was helped in this when her old schoolfriend Rita Coolidge married Kris Kristofferson, who wrote her a comeback hit, “Nobody Wins”:\n\n[Excerpt: Brenda Lee, “Nobody Wins”]\n\nHer career went through another downturn in the eighties as fashions changed in country music like they had in pop and rock, but she reinvented herself again, as a country elder stateswoman, guesting with her old friends Kitty Wells and Loretta Lynn on the closing track on k.d. lang's first solo album Shadowland:\n\n[Excerpt: k.d. lang, Kitty Wells, Loretta Lynn, and Brenda Lee, \"Honky Tonk Angels Medley\"]\n\nWhile Lee has had the financial and personal ups and downs of everyone in the music business, she seems to be one of the few child stars who came through the experience happily. She married the first person she ever dated, shortly after her eighteenth birthday, and they remain together to this day -- they celebrate their fifty-seventh anniversary this week. She continues to perform occasionally, though not as often as she used to, and she's not gone through any of the dramas with drink and drugs that killed so many of her contemporaries. She seems, from what I can tell, to be genuinely content. Her music continues to turn up in all sorts of odd ways -- Kanye West sampled \"Sweet Nothin's\" in 2013, on his hit single “Bound 2” – which I'm afraid I can't excerpt here, as the lyrics would jeopardise my iTunes clean rating. And as I mentioned at the start, she had \"Rockin' Around the Christmas Tree\" go to number two on the US charts just last December. And at seventy-five years old, there's a good chance she has many more active years left in her.\n\nI wish I could end all my episodes anything like as happily.",
  "enclosure": "",
  "itunes:summary": "Episode seventy-nine of A History of Rock Music in Five Hundred Songs looks at \"Sweet Nothin's\" by Brenda Lee, and at the career of a performer who started in the 1940s and who was most recently in the top ten only four months ago. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"16 Candles\" by the Crests.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nErrata: I say that the A-Team played on “every” rock and roll or country record out of Nashville. This is obviously an exaggeration. It was just an awful lot of the most successful ones.\n\nIt has also been pointed out to me that the version of \"Dynamite\" I use in the podcast is actually a later remake by Lee. This is one of the perennial problems with material from this period -- artists would often remake their hits, sticking as closely as possible to the original, and these remakes often get mislabelled on compilation CDs. My apologies.\n\nResources\n\nAs always, I've put together a Mixcloud playlist of all the songs excerpted in the episode.\n\nMost of the information in here comes from Brenda Lee's autobiography, Little Miss Dynamite, though as with every time I rely on an autobiography I've had to check the facts in dozens of other places.\n\nAnd there are many decent, cheap, compilations of Lee's music. This one is as good as any.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nA couple of months ago, we looked in some detail at the career of Wanda Jackson, and in the second of those episodes we talked about how her career paralleled that of Brenda Lee, but didn't go into much detail about why Lee was important.\n\nBut Brenda Lee was the biggest solo female star of the sixties, even though her music has largely been ignored by later generations. According to Joel Whitburn, she was the fourth most successful artist in terms of the American singles charts in that whole decade -- just behind the Beatles, Elvis Presley, and Ray Charles, and just ahead of the Supremes and the Beach Boys, in that order.\n\nDespite the fact that she's almost completely overlooked now, she was a massively important performer -- while membership of the \"hall of fame\" doesn't mean much in itself, it does say something that so far she is the *only* solo female performer to make both the rock and roll and country music halls of fame. And she's the only performer we've dealt with so far to have a US top ten hit in the last year. So today we're going to have a look at the career of the girl who was known as \"Little Miss Dynamite\":\n\n[Excerpt: Brenda Lee, \"Sweet Nothin's\"]\n\nLee's music career started before she was even in school. She started performing when she was five, and by the time she was six she was a professional performer. So by the time she first came to a wider audience, aged ten, she was already a seasoned professional. Her father died when she was very young, and she very quickly became the sole breadwinner of the household. She changed her name from Brenda Tarpley to the catchier Brenda Lee, she started performing on the Peach Blossom Special, a local sub-Opry country radio show, and she got her own radio show. Not only that, her stepfather opened the Brenda Lee Record Shop, where she would broadcast her show every Saturday -- a lot of DJs and musicians performed their shows in record shop windows at that time, as a way of drawing crowds into the shops. All of this was before she turned eleven.\n\nOne small piece of that radio show still exists on tape -- some interaction between her and her co-host Peanut Faircloth, who was the MC and guitar player for the show -- and who fit well with Brenda, as he was four foot eight, and Brenda never grew a",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode seventy-nine of A History of Rock Music in Five Hundred Songs looks at \"Sweet Nothin's\" by Brenda Lee, and at the career of a performer who started in the 1940s and who was most recently in the top ten only four months ago. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"16 Candles\" by the Crests.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nErrata: I say that the A-Team played on “every” rock and roll or country record out of Nashville. This is obviously an exaggeration. It was just an awful lot of the most successful ones.\n\nIt has also been pointed out to me that the version of \"Dynamite\" I use in the podcast is actually a later remake by Lee. This is one of the perennial problem",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}