{
  "id": "yt:video:MXs_vkc8hpY",
  "yt:videoId": "MXs_vkc8hpY",
  "yt:channelId": "UCV4Rx1m-9HmtqHET7GjnVOA",
  "title": "Quantum mechanics to fluid simulation - the story of everything",
  "link": "",
  "author": {
    "name": "braintruffle",
    "uri": "https://www.youtube.com/channel/UCV4Rx1m-9HmtqHET7GjnVOA"
  },
  "published": "2021-05-02T08:41:52+00:00",
  "updated": "2022-06-25T21:04:12+00:00",
  "media:group": {
    "media:title": "Quantum mechanics to fluid simulation - the story of everything",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This is the first part in a series about Computational Fluid Dynamics where we build a Fluid Simulator from scratch.\n\nWe highlight the Microscopic Perspective on Quantum Mechanics, Molecular Dynamics, and the Kinetic Theory of Gases that underlies and justifies Fluid Simulation Formulations in the first place.\n\nThe Microscopic Perspective provides the ground for the next part where we focus on the Macroscopic Perspective with concepts such as Pressure, Viscosity, Temperature, and Flow Velocity as well as its evolution with time.\n\n\nTimetable:\n-----------------\n00:00 - What We Build\n02:06 - Guiding Principle - Information Reduction\n04:03 - Measurement of Small Things\n07:09 - Quantum Mechanics and Wave Functions\n13:45 - Model Order Reduction\n16:48 - Molecular Dynamics and Classical Mechanics\n26:50 - Kinetic Theory of Gases\n30:23 - Recap\n\n\nSelected Papers and Learning Resources:\n-------------------------------------------------------------------\n05:03 Experiment:\nPaper: \"Stodolna, Aneta S., et al. Hydrogen atoms under magnification: direct observation of the nodal structure of stark states. Physical review letters 110.21 (2013): 213001.\"\n\n06:49 Atomic- and Molecular Orbitals Tomography:\nPaper: \"Vozzi, Caterina, et al. Generalized molecular orbital tomography. Nature Physics 7.10 (2011): 822-826.\"\nPaper: \"Itatani, Jiro, et al. Tomographic imaging of molecular orbitals. Nature 432.7019 (2004): 867-871.\"\n\n07:24 Matter Waves, Double Slit Experiment:\nPaper: \"Jönsson, Claus. Elektroneninterferenzen an mehreren künstlich hergestellten Feinspalten. Zeitschrift für Physik 161.4 (1961): 454-474.\"\nPaper: \"Jönsson, Claus. Electron diffraction at multiple slits. American Journal of Physics 42.1 (1974): 4-11.\"\n\n07:57 Quantum Mechanics Overview, Wave packets, Standing Waves, Eigenstates:\nE-Book: \"Mathur, Samir D. https://www.asc.ohio-state.edu/mathur.16/quantummechanics27-11-17/navigation.html\"\nE-Book: \"van Dommelen, Leon. Quantum mechanics for engineers. https://web1.eng.famu.fsu.edu/~dommelen/quantum/style_a/index.html (2004)\"\n\n16:01 Model Order Reduction, Modes:\nLecture Notes: from \"Farhat, Charbel. Model Reduction. https://web.stanford.edu/group/frg/course_work/CME345/CA-CME345-Ch1.pdf\" to \"CA-CME345-Ch9\"\n\n17:17 Classical Mechanics, Phase Space:\nLecture Notes: \"Cerfon, Antoine. Mechanics (Classical and Quantum). https://www.math.nyu.edu/~cerfon/mechanics.html\"\n\n18:15 Molecular Dynamics, Born-Oppenheimer Approximation, Potential Energy Surface, and Non-Quantized Approximation of Energy Levels:\nLecture Notes: \"Allen, Michael P. Introduction to molecular dynamics simulation. Computational soft matter: from synthetic polymers to proteins 23.1 (2004): 1-28.\"\nPaper: \"Parker, J. G. Rotational and vibrational relaxation in diatomic gases. The Physics of Fluids 2.4 (1959): 449-462.\"\nPaper: \"Valentini, Paolo, et al. Direct molecular simulation of nitrogen dissociation based on an ab initio potential energy surface. Physics of Fluids 27.8 (2015): 086102.\"\nE-Book Chapter: \"van Dommelen, Leon. Quantum mechanics for engineers. 9.2 The Born-Oppenheimer Approximation. https://web1.eng.famu.fsu.edu/~dommelen/quantum/style_a/bo.html (2004)\"\n\n20:11 One-Dimensional Hydrogen Atom Approximation for the Coulomb Potential as opposed to the \"true\" One-Dimensional Coulomb Potential:\n\"Loudon, Rodney. One-dimensional hydrogen atom. American journal of physics 27.9 (1959): 649-655.\"\n\"Loudon, Rodney. One-dimensional hydrogen atom. Proceedings of the Royal Society A: Mathematical, Physical and Engineering Sciences 472.2185 (2016): 20150534.\"\n\n27:06 Kinetic Theory of Gases, (Variable) Hard Sphere Approximation of Molecules:\nLecture Notes: from \"http://volkov.eng.ua.edu/ME591_491_NEGD/2017-Spring-NEGD-01-ElemKineticTheory.pdf\" to \"NEGD-06\"\n\n\nDisclaimer:\n------------------\nThis series focuses specifically on the aspect of information reduction in dynamical systems. For the sake of clarity, I had to omit many interesting aspects of the topics addressed in the video. So, the video itself is a reduction. :-)\n\n\nI hope you enjoyed this little braintruffle! \n\nIf you like this series, let the YouTube algorithm know by subscribing to the channel and ringing the bell icon.\n\nThank you for watching and see you next time!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}