{
  "title": "Abolish Marriage (with Jessica Stites)",
  "itunes:title": "Abolish Marriage (with Jessica Stites)",
  "pubDate": "Wed, 25 Sep 2019 23:10:22 +0000",
  "guid": "d8a375b45cf242458a70a991edfc0cf8",
  "link": "https://jessacrispin.libsyn.com/abolish-marriage-with-jessica-stites",
  "itunes:image": "",
  "description": "<div><!--block-->Jessa invites Jessica Stites, executive editor of In These Times, onto the show for a conversation about the institution of marriage and why it should be abolished. Together, they talk about marriage as an alienating force against stigmatized groups, its modern association with love & romance, the legal constraints placed on individuals and partners seeking an alternative to marriage, and ways to challenge marriage's social and legal framework. Jessica Stites is executive editor of In These Times magazine. Prior to that, she worked at Ms. magazine and George Lakoff's Rockridge Institute.<br /> <br /></div> <div><!--block--></div> <div><!--block-->SUBSCRIBE to the #PublicIntellectual #Patreon page to access bonus content, merch, and more:<br /> <br /></div> <div><!--block--><a href= \"https://www.patreon.com/publicintellectual\">https://www.patreon.com/publicintellectual</a></div>",
  "content:encoded": "Jessa invites Jessica Stites, executive editor of In These Times, onto the show for a conversation about the institution of marriage and why it should be abolished. Together, they talk about marriage as an alienating force against stigmatized groups, its modern association with love & romance, the legal constraints placed on individuals and partners seeking an alternative to marriage, and ways to challenge marriage's social and legal framework. Jessica Stites is executive editor of In These Times magazine. Prior to that, she worked at Ms. magazine and George Lakoff's Rockridge Institute.   SUBSCRIBE to the #PublicIntellectual #Patreon page to access bonus content, merch, and more:  <a href= \"https://www.patreon.com/publicintellectual\">https://www.patreon.com/publicintellectual</a>",
  "enclosure": "",
  "itunes:duration": "52:31",
  "itunes:explicit": false,
  "itunes:keywords": "marriage,childcare,housing",
  "itunes:subtitle": "Jessa invites Jessica Stites, executive editor of In These Times, onto the show for a conversation about the institution of marriage and why it should be abolished. Together, they talk about marriage as an alienating force against stigmatized groups,...",
  "itunes:season": 1,
  "itunes:episode": 18,
  "itunes:episodeType": "full",
  "itunes:author": "Jessa Crispin"
}