{
  "title": "What went wrong with Tay, the Twitter bot that turned racist?",
  "link": "https://kavita-ganesan.com/tay-twitter-bot/",
  "comments": "https://kavita-ganesan.com/tay-twitter-bot/#respond",
  "dc:creator": "Kavita Ganesan",
  "pubDate": "Fri, 21 Oct 2022 16:09:00 +0000",
  "category": [
    "AI Fails",
    "Business AI"
  ],
  "guid": "https://kavita-ganesan.com/?p=8285",
  "description": "Why Tay the Twitter bot from 2016 failed and what we can learn from it. How can we generalize this to ML development best practices?",
  "content:encoded": "\n<p>Of late, we’ve been hearing about <strong>Twitter bots</strong> in the news due to the whole saga of <a href=\"https://techcrunch.com/2022/10/04/elon-intends-buy-twitter/\">Elon Musk buying Twitter</a>. One of the reasons the deal took so long to pan out was Musk’s concerns about the number of <strong><em>spam</em></strong> bots running rampant on the platform. While Musk <a href=\"https://www.wsj.com/podcasts/the-journal/elon-musk-doesnt-want-to-buy-twitter-anymore/72ac2322-bb3e-4d41-8237-16e8e115d3d5\">believes that bots make up more than 20%</a> of accounts on Twitter, Twitter states that the number of bots on its platform is marginal.</p>\n\n\n\n<p>So, what’s this <em>Twitter bot </em>thing?</p>\n\n\n\n<p>A Twitter bot is essentially a Twitter account controlled by software automation rather than an actual human. It is programmed to behave like regular Twitter accounts, liking Tweets, retweeting, and engaging with other accounts.&nbsp;</p>\n\n\n\n<p>Twitter bots can be helpful for specific use cases, such as sending out critical alerts and announcements. On the flip side, they can also be used for nefarious purposes, such as starting a disinformation campaign. These bots can also turn nefarious when “programmed” incorrectly.&nbsp;&nbsp;</p>\n\n\n\n<p>This is what happened with Tay, an AI Twitter bot from 2016.&nbsp;&nbsp;&nbsp;</p>\n\n\n\n<p>Tay was an experiment at the intersection of ML, NLP, and social networks. She had the capacity to Tweet her “thoughts” and engage with her growing number of followers. While other chatbots in the past, such as <a href=\"https://web.njit.edu/~ronkowit/eliza.html\">Eliza</a>, conducted conversations using narrow scripts, Tay was designed to learn more about language over time from its environment, allowing her to have conversations about any topic.&nbsp;</p>\n\n\n\n<p>In the beginning, Tay engaged harmlessly with her followers with benign Tweets. However, after a few hours, Tay started tweeting highly <em>offensive</em> things, and as a result, she was shut down just sixteen hours after her launch.</p>\n\n\n\n<p>You may wonder how can such an “error” happen so publicly. Wasn’t this bot tested? Weren’t the researchers aware that this bot was an evil, racist bot before releasing it?&nbsp;</p>\n\n\n\n<p>These are valid questions. To get into the crux of what went wrong, let’s study some of the problems in detail and try to learn from them. This will help us all see how to handle similar challenges when deploying AI in our organizations.&nbsp;</p>\n\n\n\n<h2>Data</h2>\n\n\n\n<p>Data is often a big reason why AI models fail. In the case of Tay, shortly after her release,&nbsp; Twitter trolls started engaging the bot with racist, misogynistic, and anti-Semitic language. And because Tay had the capacity to learn as she went, it meant that she internalized some of the language taught by the trolls. Tay just repeated some of this language. Tay uttered bad language because she was fed bad data.</p>\n\n\n\n<p><strong>Take note: </strong>Poor-quality, prejudiced, or downright bad training data can significantly impact how machine learning models behave. You train ML models with nonrepresentative data, and they will churn out biased predictions. If you starve models of data or feed models incomplete data, they will make random predictions instead of meaningful ones. Questionable learning/training data = questionable output.&nbsp;</p>\n\n\n\n<blockquote class=\"wp-block-quote has-text-align-left is-style-plain\" style=\"font-style:normal;font-weight:500\"><p></p><p>Questionable training data = questionable ML model output&nbsp;</p><p></p></blockquote>\n\n\n\n<figure class=\"wp-block-image aligncenter size-full\"><a href=\"https://arstechnica.com/\"><img decoding=\"async\" loading=\"lazy\" width=\"628\" height=\"308\" src=\"https://kavita-ganesan.com/wp-content/uploads/image-13.png\" alt=\"\" class=\"wp-image-8304\" srcset=\"https://kavita-ganesan.com/wp-content/uploads/image-13.png 628w, https://kavita-ganesan.com/wp-content/uploads/image-13-300x147.png 300w, https://kavita-ganesan.com/wp-content/uploads/image-13-150x74.png 150w\" sizes=\"(max-width: 628px) 100vw, 628px\" /></a><figcaption>Example of Tay&#8217;s Tweet (source: <a href=\"https://arstechnica.com/\">https://arstechnica.com/</a>)</figcaption></figure>\n\n\n\n<p></p>\n\n\n\n<figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"https://kavita-ganesan.com/wp-content/uploads/image-14.png\" alt=\"Tay twitter bot\" class=\"wp-image-8306\" width=\"576\" height=\"271\" srcset=\"https://kavita-ganesan.com/wp-content/uploads/image-14.png 748w, https://kavita-ganesan.com/wp-content/uploads/image-14-300x141.png 300w, https://kavita-ganesan.com/wp-content/uploads/image-14-150x71.png 150w\" sizes=\"(max-width: 576px) 100vw, 576px\" /><figcaption>Example of Tay&#8217;s Tweet (source: <a href=\"https://twitter.com/geraldmellor/status/712880710328139776?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E712880710328139776%7Ctwgr%5E19f193e907faca963bca95676c139db39fd3cce6%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Farstechnica.com%2Finformation-technology%2F2016%2F03%2Fmicrosoft-terminates-its-tay-ai-chatbot-after-she-turns-into-a-nazi%2F\">Twitter.com</a>)</figcaption></figure>\n\n\n\n<h2>Design&nbsp;</h2>\n\n\n\n<p>While we don’t often relate model or solution design to erratic model behaviors, it’s often more common than you think. By design, Tay continuously learned from external input (i.e., the environment). Among all the benign Tweets that Tay consumed from her environment were also <em>abrasive</em> Tweets. The more abrasive Tweets Tay saw, the more she learned that those were typical types of responses to Tweet.&nbsp;</p>\n\n\n\n<p>This is true of any ML model. The dominant patterns influence the predictions of the ML models. Fortunately,&nbsp; it’s not necessary for ML models to learn continuously from their environment. ML models can learn from controlled data. So, Tay’s design itself was risky.&nbsp;</p>\n\n\n\n<p><strong>Take note:</strong> The design of your ML models impacts how it behaves in reality. So, when designing ML systems, developers and business stakeholders should consider the different ways in which the system can fail, operate suboptimally, be breached, and adjust the design accordingly. In the end, you need a fail-safe plan.&nbsp;</p>\n\n\n\n<p>In the case of Tay,&nbsp; such thinking early on would’ve made clear that not all Tweet engagements would be benign. There could be bad actors tweeting and engaging in a highly offensive manner, not far-fetched at all from reality. The realization that the bot could be consuming bad data may have stopped the team from using data from other Twitter accounts. They may also have considered consuming data from approved Twitter accounts.&nbsp;</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>The design of your ML models impacts how it behaves in reality. </p></blockquote>\n\n\n\n<h2>Testing</h2>\n\n\n\n<p>One of the key steps in the machine learning development lifecycle is <em>testing</em>—not just during development, but testing right before full deployment. I call this <em>post-development testing</em> (PDT).&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"606\" src=\"https://kavita-ganesan.com/wp-content/uploads/post-development-testing-1024x606.png\" alt=\"post-development-testing\" class=\"wp-image-5831\" srcset=\"https://kavita-ganesan.com/wp-content/uploads/post-development-testing-1024x606.png 1024w, https://kavita-ganesan.com/wp-content/uploads/post-development-testing-300x178.png 300w, https://kavita-ganesan.com/wp-content/uploads/post-development-testing-150x89.png 150w, https://kavita-ganesan.com/wp-content/uploads/post-development-testing-768x455.png 768w, https://kavita-ganesan.com/wp-content/uploads/post-development-testing-1536x910.png 1536w, https://kavita-ganesan.com/wp-content/uploads/post-development-testing.png 1756w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /></figure>\n\n\n\n<p class=\"has-text-align-center\"><strong>The ML Development Life Cycle</strong></p>\n\n\n\n<p></p>\n\n\n\n<p>In the case of Tay, It’s unclear how much PDT went on before releasing the bot, but obviously, it wasn’t enough! Had Tay been subjected to different types of tweet engagements during PDT, the dangers of releasing Tay would’ve become obvious.</p>\n\n\n\n<p><strong>Take note: </strong>In practice, PDT is often overlooked due to a rush to release a new feature or product. It’s often assumed that if a model works well during development, it will naturally perform well in practice. Sadly, that’s not always the case.&nbsp;So, take note that PDT is critical when it comes to AI deployment.</p>\n\n\n\n<p></p>\n\n\n\n<p>During PDT, you can stress test your AI solution to find points of failure. In the case of Tay, subjecting it to different types of Twitter users (e.g., trolls, benign users, and passive aggressives) could’ve surfaced risky behaviors of the bot.&nbsp; PDT can also help evaluate your solution’s impact on relevant business metrics. For example, suppose your business metric measures speed improvement in completing a particular task. PDT can give you early insights into such metrics.&nbsp;</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>During PDT, you can stress test your AI solution to find points of failure. PDT can also help evaluate your solution’s impact on relevant business metrics. </p></blockquote>\n\n\n\n<h2>Monitoring</h2>\n\n\n\n<p>Another critical component in the ML development lifecycle is monitoring after deployment. With Tay, monitoring the bot&#8217;s behavior eventually led to it being shut down within 24 hours of its release (side note: negative press also had a hand in it). If the bot hadn’t been monitored long after its release, this could’ve led to a whole lot more negative press and many more groups being offended.&nbsp;</p>\n\n\n\n<p><strong>Take note: </strong>While model monitoring is often done as an afterthought, it should be prioritized before its release to end users. The initial weeks after a model’s release is the most crucial, as unpredictable behaviors not seen during testing could emerge.&nbsp;</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>The initial weeks after a model’s release is the most crucial, as unpredictable behaviors not seen during testing could emerge.&nbsp;</p></blockquote>\n\n\n\n<p></p>\n\n\n\n<h2>Summary</h2>\n\n\n\n<p>While what went wrong with Tay may be surprising and intriguing to many, from a machine learning best practices perspective, Tay’s behavior could’ve been predicted. Tay’s environment wasn’t always positive, and she was designed to learn from that environment which led to a perfect recipe for a dangerous experiment.&nbsp;</p>\n\n\n\n<p>So decisions around data, model design, testing, and monitoring are critical to every AI initiative. And this is not just the responsibility of the developers but also the business stakeholders. The more thought we put into each element, the fewer the surprises and the higher the chances of a successful initiative.&nbsp;</p>\n\n\n\n<p></p>\n\n\n\n<p>That’s all for now!</p>\n\n\n\n<p></p>\n\n\n\n<div class=\"inherit-container-width is-layout-constrained wp-block-group has-ast-global-color-4-background-color has-background\" style=\"border-style:dotted;border-width:1px;padding-top:10px;padding-right:10px;padding-bottom:10px;padding-left:10px\"><div class=\"wp-block-group__inner-container\">\n<h2>Keep Learning From Me:</h2>\n\n\n\n<ul><li><strong>Join my&nbsp;<a href=\"https://kavita-ganesan.com/blog\">AI Integrated newsletter</a>,&nbsp;</strong>which clears the AI confusion and teaches you how to successfully integrate AI to achieve profitability and growth in your business.</li><li><strong>Read&nbsp;&nbsp;<a href=\"http://amazon.aibusinesscasebook.com/?utm_source=newsletter&utm_medium=email&utm_campaign=why_starting_without_ai_improves_outcomes_even_if_ai_is_your_goal&utm_term=2022-08-19\" target=\"_blank\" rel=\"noreferrer noopener\">The Business Case for AI</a></strong>&nbsp;to learn applications, strategies, and best practices to be successful with AI (select companies using the book: government agencies, automakers like Mercedes Benz, beverage makers, and e-commerce companies such as Flipkart).</li></ul>\n</div></div>\n\n\n\n<p></p>\n",
  "wfw:commentRss": "https://kavita-ganesan.com/tay-twitter-bot/feed/",
  "slash:comments": 0,
  "post-id": 8285
}