{
  "title": "S16 Ep35: Darkness Radio presents Holzer's Ghosts - Devil in the Rock: The Haunting of Cohasset, MA",
  "link": "https://audioboom.com/posts/8098376",
  "itunes:episode": 35,
  "itunes:title": "Darkness Radio presents Holzer's Ghosts - Devil in the Rock: The Haunting of Cohasset, MA",
  "itunes:season": 16,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6136,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Darkness Radio presents Holzer's Ghosts - Devil in the Rock: The Haunting of Cohasset, MA</p>\n\n<p>Tonight, Dave & Tim revisit the Season 2 Finale of The #HolzerFiles with on screen stars, Alexandra Holzer & Shane Pittman and behind the scenes stars, director of photography/cinematographer Rob Toth and Supervising producer Brian Peterson.</p>\n\n<p>Season 2 of the #HolzerFiles comes to an end with a bang! In 1964, legendary ghost hunter Hans Holzer ventured to the Bates Ship Chandlery in Cohasset, Massachusetts, for a preliminary investigation with witnesses of undeniable paranormal activity. Dozens of people heard phantom footsteps walking the upstairs of the old ship store, and the curator, Bob Fraser, had a chilling encounter with a full-body apparition at the top of the stairs.</p>\n\n<p>After interviewing the witnesses, who all believed they were dealing with the ghost of past owner, John Bates, Holzer implored the spirit to move on and felt a follow-up with a psychic wasn't needed. However, the haunting didn't stop. It grew in intensity until the curator was driven out of town in 1982 and has since refused to return.</p>\n\n<p>Now, more than half a century after Hans Holzer's cursory investigation of the Bates Ship Chandlery, the team returns to Massachusetts's rocky coast, where the paranormal activity has escalated in recent years. However, as the team delves into the chandlery's history and uncovers chilling layers of the haunting, they soon find that there's an undercurrent of darkness in the home, and it may run deeper than expected.</p>\n",
  "pubDate": "Fri, 26 Mar 2021 08:00:00 +0000",
  "guid": "35071f4a-1292-405d-b157-acf70049b0b7",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}