{
  "title": "Mojo Vision Puts Its AR Contact Lens Into Its CEO’s Eyes (Literally)",
  "link": "https://spectrum.ieee.org/looking-through-mojo-visions-newest-ar-contact-lens",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/closeup-of-eye-with-contact-lens-containing-electronic-components.jpg?id=30041337&width=4032&height=2504&coordinates=0%2C0%2C0%2C184\"/><br/><br/><p class=\"ieee-editors-note\">\n<em><strong>Update 3 November 2022: </strong>Today, Mojo Vision announced the first major third-party consumer application to be tested on the prototype of its AR contact lens: the Alexa Shopping List. Developed with support from Amazon, the app allows users to ask Alexa, by talking, to add items to a shopping list that they can then view as a scrollable list through the lens while walking through the grocery store. Users can check off items by holding their gaze for a moment. The list updates in real time if another household member adds items to the shopping list.</em>\n</p><p>\n<em>Is this <em>the</em> killer app for this augmented reality device? No. But the development does show that major companies are taking Mojo Vision’s smart contact lens seriously.</em>\n</p><p>\n<em>In March, I looked through Mojo Vision’s AR contact lens—but I didn<em>’t</em> put it in my eye. At that point, while nonworking prototypes had been tested for wearability, nobody had worn the fully functional, battery-powered, wirelessly communicating, device. Earlier this year, Mojo announced that its augmented reality lens had gone on-eye—specifically, on the eye of the Mojo Vision CEO, Drew Perkins, on 23 June.</em>\n</p><p>\n<em>“I’ve worn it. It works...and it was the first ever on-eye demonstration of a feature-complete augmented reality smart contact lens,” reported Perkins in <a href=\"https://www.mojo.vision/news/today-i-wore-mojo-lens\" rel=\"noopener noreferrer\" target=\"_blank\">a blog post</a>. “The final technical hurdle to wearing the lens was ensuring that the power and radio communications systems worked without wires. Cutting the cord [proved] that the lens and all major components are fully functional and reduce many of the technical challenges in building a smart contact lens.”</em>\n</p><p>\n<em>It’s an exciting milestone for Perkins and the Mojo Vision team, and we’ll continue monitoring their progress.</em>\n</p><div class=\"horizontal-rule\">\n</div><p class=\"ieee-editors-note\">\n<em>Story from 30 March 2022 follows:</em>\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Two fingers hold a contact lens with a ring of circuitry on its outer edge\" class=\"rm-shortcode\" data-rm-shortcode-id=\"760452af61c0ec1e627fa49b94d27492\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"13d7e\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/two-fingers-hold-a-contact-lens-with-a-ring-of-circuitry-on-its-outer-edge.jpg?id=29611175&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Early this year, IEEE Spectrum editor Tekla Perry tested Mojo Vision's AR contact lens by holding it very close to one eye and peeking through.</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Mojo Vision</small>\n</p><h3></h3><br/><p><strong>In March,</strong> <a href=\"https://www.mojo.vision/\" target=\"_blank\">Mojo Vision</a> unveiled its latest AR contact lens. Still a prototype, the device has clinical testing and further development ahead before it can apply for the <a href=\"https://www.fda.gov/\" target=\"_blank\">U.S. Food and Drug Administration </a>(FDA) approval needed to sell to consumers. But Mojo’s engineers are steadily ticking off engineering milestones.</p><p>Last week I got to literally peek through Mojo’s newest lens. Here’s what I saw, and what <a href=\"https://www.linkedin.com/in/slsinclair\" target=\"_blank\">Steve Sinclair</a>, Mojo senior vice president of product and marketing, had to say about the company’s progress so far and the challenges that remain.</p><p>First, the demo. I did not put the lens in my eye—this prototype is still in safety testing, and fitting a contact lens requires an eye exam. Instead, I held a lens very close to one eye and peeked through. I was able to move around freely, but because holding instead of wearing the device means that it cannot track eye movements, Mojo has temporarily incorporated a tiny crosshair into the user interface to help with alignment. The nature of the demo also meant that images I saw were flat; with a lens in both eyes, the images will appear in 3D.</p><h3>What’s New in the Mojo Lens</h3><br/><p>• Medical-grade microbatteries on board along with a custom power management IC</p><p><span></span>• High-res 14,000 pixels per inch monochrome microLED display (up from about 8,000 pixels per inch)</p><p><span></span>• Custom 5-gigahertz radio using a proprietary low-latency communications protocol</p><p><span></span>• Eye tracking using accelerometer, gyroscope, and magnetometer</p><p><span></span>• Coming soon: Custom image sensors</p><h3></h3><br/><p>I tried out several applications. To select them, I looked around the periphery of the real-world view in front of me, which caused icons to appear. By focusing on one (in this case, aligning the crosshairs), I selected it. The app I found to be the most fun to use wasn’t the most complex, but it did show off the sensors on board by tagging compass headings as I turned to face different directions. I also played with a travel tools app that included a high-resolution monochrome image of an incoming Uber driver, a biking app that called up heart rate and other information useful on a training ride, a teleprompter app that naturally scrolled up and down to move through the text, and a monochrome video stream. All these demos took place in the prototype lens, with me fully in control of them. Mojo’s team then moved to a VR simulation to demonstrate eye tracking features that won’t work unless the lens is sitting in your eye.</p><p>This isn’t <a href=\"https://spectrum.ieee.org/ar-in-a-contact-lens-its-the-real-deal\" target=\"_self\">the first time</a> I’ve seen the Mojo lens in person. But since that last demo in 2020, the engineering team has moved from wireless power to batteries on board, increased the resolution of the display from 8,000 pixels per inch to 14,000, thinned commercial motion sensors and developed its own radio and power management, and created several apps. Image sensors—a feature of earlier demos that showed off edge detection in low light and other <a href=\"https://spectrum.ieee.org/startup-mojo-vision-has-the-earliest-adopters-of-augmented-reality-contact-lenses-in-its-sights\" target=\"_self\">vision enhancements</a>—have yet to be built into the current prototype, though Sinclair says that they are in the works, and that the company is continuing to test apps for people with low vision and still expects them to be among the earliest customers for the device.</p><p>Here’s what else Sinclair had to say about the technology as developed so far and the path ahead.</p><p><strong>Let’s talk about the batteries.</strong></p><h3></h3><br/><img alt=\"Man from shoulders up smiling, wearing glasses and blue collared shirt\" class=\"rm-shortcode\" data-rm-shortcode-id=\"6d8975cac9d43ed4ae5fedc725e79487\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"bb4ba\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/man-from-shoulders-up-smiling-wearing-glasses-and-blue-collared-shirt.jpg?id=29610462&width=980\"/><h3></h3><br/><p><strong>Steve Sinclair:</strong> The battery is in the outer ring, embedded in the lens. We are partnering with a medical-grade battery company that makes implantable microbatteries for things like pacemakers, to design something safe to wear. Previously, we were using magnetic inductive coupling, and that seemed fine when you were holding it up to your eye. But the moment you put it on your eye and started moving your head and darting your eye and looking around, we were losing that connection to the wireless field. It wasn’t as reliable as we needed it to be. And so we made a decision about a year and a half ago to switch over to battery power.</p><p><strong>I recall you always wanted to get batteries on board?</strong></p><p><strong>Sinclair: </strong>We thought so. But we sped that path up, because we came to the conclusion that the other path was just not a good way to go.</p><p><strong>Why doesn’t this version have the image sensor?</strong></p><p><strong>Sinclair: </strong>We’ve decided to leave out the imager, the camera, for right now; it’s not critical to the use cases that we’re looking at first.</p><p><strong>But you had been working to develop applications for people with low vision. What happened to that?</strong></p><p><strong>Sinclair: </strong>We’ve been using mainly low-vision capabilities built into smartphones right now to take pictures of things and bring them up to your eye for zooming in and out; we’ll add in the imager and test those capabilities out next. It’s just about there, but it wasn’t necessary to get to this milestone, so we decided to simplify things a little bit.</p><p><strong>Given the amount of lens real estate being taken up by batteries and chips, was oxygenation an issue?</strong></p><p><strong>Sinclair: </strong>Absolutely. That was a core engineering point that needed to be solved before we could get to this lens. So this lens has channels built into it and a special design that allows air to get in and get through. The oxygen diffuses out over the surface of the cornea and the sclera.</p><h3></h3><br/><img alt=\"A transparent contact lens showing computer chips and circuitry within its periphery\" class=\"rm-shortcode\" data-rm-shortcode-id=\"2310cdfe38972875470b1151decffa04\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"76b59\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-transparent-contact-lens-showing-computer-chips-and-circuitry-within-its-periphery.jpg?id=29613762&width=980\"/><h3></h3><br/><p><strong>Does the circuitry block vision at all?</strong></p><p><strong>Sinclair: </strong>See the cutout on the side? Imagine I’m wearing it. It’s going to be oriented like this [the cutout away from the nose] because I need the peripheral vision on the outside, not towards the nasal side. Ultimately, there’s even more we can do to push components further toward the edges of the lens to maximize light entering the pupil.</p><p><strong>Now that you explain the arrangement of circuitry to protect peripheral vision, it seems obvious, but some of the most obvious things take figuring out.</strong></p><p><strong>Sinclair: </strong>It wasn’t immediately obvious; our original design had [the electronics] all the way around.</p><p><strong>What happens next?</strong></p><p><strong>Sinclair: </strong>We’re already wearing lenses that don’t have any electronics in them, but they’re shaped the same way, so that we can test for comfort and for how long can we wear them and have the oxygenation still working to our satisfaction.</p><p>Next we start testing [the complete prototype] on-eye, and see just how well it works in different situations. We can’t say exactly when that happens. We hope it’s soon, but we’ve got to make sure it’s safe and everything’s working the way we expect it to work. That testing will start with <a href=\"https://www.linkedin.com/in/drewdperkins\" target=\"_blank\">Drew Perkins</a> wearing it, our CEO, then probably <a href=\"https://www.linkedin.com/in/mwiemer\" target=\"_blank\">Mike Wiemer</a>, our CTO. And then it goes to folks like myself and others on the executive team, along with some of the key engineers that need to start evaluating things quickly.</p><p>We’ll be testing the software, the battery life, and the wireless connectivity and [its] speeds. There’s likely to be a spin of one, two, or three of the chips built into the lens as we discover things that don’t work right or could be optimized to work better together as a system.</p><p><strong>What’s the timeline for commercialization?</strong></p><p><strong>Sinclair: </strong>Everything is predicated on eventually getting FDA certification. We don’t like to presume how long that’s going to take.</p><p><strong>You’re going for the consumer market. Today, it seems, most AR glasses manufacturers have decided to focus on the enterprise market initially. Why the different path?</strong></p><p><strong>Sinclair: </strong>With AR glasses, there are definitely some awesome enterprise use cases. But these are not great for contact lenses. Say you’re an IT manager, and you’ve come up with an awesome contact lens application. Can you tell your workers to wear a contact lens? Not usually. But consumers can make that decision. The reason people wear contact lenses is very consumery: I want to look like myself. I want to use it when I’m working out or doing sports. I don’t like things on my face. I don’t like the fashion sense of glasses; it’s not me. We decided to lean into those reasons that people pick contact lenses.</p><p><strong>Can you talk about pricing?</strong></p><p><strong>Sinclair: </strong>Like anything else, when we first bring it out, it’ll be a little expensive. Our goal when we’re running at volume is that it should come out somewhere close to a high-end smartphone. But factor in the fact that people are already spending US $500, $600, or $700 for eyewear today, subtract that out of the total price, and the adder on top of that is not huge.</p><p>\n<em>This article appears in the June 2022 print issue as “My Peek Through Mojo Vision’s AR Contacts.”</em>\n</p>",
  "pubDate": "Tue, 28 Jun 2022 21:00:00 +0000",
  "guid": "https://spectrum.ieee.org/looking-through-mojo-visions-newest-ar-contact-lens",
  "category": [
    "Consumer electronics",
    "Wearables",
    "Mojo vision",
    "Displays",
    "Augmented reality"
  ],
  "dc:creator": "Tekla S. Perry",
  "media:content": ""
}