{
  "title": "520: The Most Shocking Moments in Fandom History, Part 2: Encyclopedia Flip Flop, More Wizarding Schools, Fantastic Beasts",
  "link": "https://audioboom.com/posts/7898977",
  "itunes:episode": 520,
  "itunes:title": "The Most Shocking Moments in Fandom History, Part 2: Encyclopedia Flip Flop, More Wizarding Schools, Fantastic Beasts",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4162,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>We continue our discussion on the most shocking moments in Harry Potter fandom history, with some stories you'll remember -- and others you probably forgot!</li>\n<li>In 2012, Micah discovered that JKR had announced she was actively working on a Harry Potter Encyclopedia, but it was <a href=\"https://www.mugglenet.com/2012/05/rowling-has-no-firm-plans-to-publish-potter-encyclopedia/\">quickly retracted</a> once the story got out.</li>\n<li>In 2013, Rowling was outed as male author Robert Galbraith by a lawyer's... wife's... friend... and a British newspaper.</li>\n<li>Later that same year, only a week after MuggleCast \"ended,\" the <em>Fantastic Beasts</em> film series was announced!</li>\n<li>Years later, can we all agree <em>Fantastic Beasts</em> IS a prequel?</li>\n<li>Dumbledore's appearance in <em>Crimes of Grindelwald</em> and the casting of Jude Law was a delightful surprise.</li>\n<li>In 2016, more Wizarding World schools were announced, and controversy may have prevented us from getting more that were promised.</li>\n<li>The same year, the stage show Cursed Child is announced, and debuts in 2 parts! We revisit the original description of the show, which is very different than the final product.</li>\n<li>Honorable mentions submitted by our listeners include Ron/Hermione regrets, Rowling on Twitter, and the Wizards Unite game.</li>\n<li>We also reflect on the actors we've lost over the years.</li>\n<li>To wrap up our discussion, each of the hosts speculates on which crazy \"impossible\" idea will be the next shocking news story in fandom.</li>\n<li>Quizzitch: Who portrayed the character of Barry Fairbrother on the BBC series adaptation of the Casual Vacancy? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week’s episode is sponsored by</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like access to our recording studio, Bonus MuggleCast, a personalized thank you video from one of the hosts and more! On this month's Bonus MuggleCast, we share our thoughts on a Harry Potter cast reunion!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 06 Jul 2021 09:00:00 +0000",
  "guid": "tag:audioboom.com,2021-07-05:/posts/7898977",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}