{
  "id": "yt:video:M5-PjgkmeDQ",
  "yt:videoId": "M5-PjgkmeDQ",
  "yt:channelId": "UCccafaIN6dwBwyl1cwNH90w",
  "title": "Is psychedelic microdosing real or just placebo? | Latest scientific findings | Psychedelic science",
  "link": "",
  "author": {
    "name": "The Psychedelic Scientist",
    "uri": "https://www.youtube.com/channel/UCccafaIN6dwBwyl1cwNH90w"
  },
  "published": "2021-11-06T18:47:46+00:00",
  "updated": "2022-01-22T18:29:22+00:00",
  "media:group": {
    "media:title": "Is psychedelic microdosing real or just placebo? | Latest scientific findings | Psychedelic science",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The concept of psychedelic microdosing has exploded in recent years - in the media and culture. in the surging psychedelic business industry, and in scientific research labs at a variety of institutions.\n\nPeople claim that microdosing can improve things such as mood, well-being, attention, problem solving, and creativity, as well as reduce depression and anxiety symptoms.\n\nBut does the scientific research support the claims that are so commonly made? \n\nHow much of the effects can be attributed to positive expectations and the placebo response that these create?\n\nHere I dive deep into the research to date exploring these questions.\n\nTimestamps:\n0:00 - Introduction and sponsor shout-out\n0:30 - What is psychedelic microdosing?\n2:18 - What exactly is the placebo effect? \n2:52 - Why are the effects of microdosing likely to be a result of the placebo effect?\n3:52 - The two types of microdosing studies: observational studies versus double-blind, randomized placebo-controlled trials\n4:42 - Observational studies on microdosing\n7:20 - Double-blind, randomized placebo-controlled trials of microdosing\n8:42 - The recent citizen science study on psychedelic microdosing: a placebo controlled observational study\n11:46 - Conclusion\n\n---\n\nThe editing for this video was sponsored by EntheoTech Bioscience, a psychedelic bioscience company for which I am Chief Research Officer. Go check them out! https:// www.entheotech.ca\n\nDon't forget to follow me on social media for all the latest updates. Especially Instagram where I post the most!\n\nInstagram\nhttps://www.instagram.com/thepsychedelicscientist/\n\nTwitter\nhttps://twitter.com/ThePsychedSci\n\nFacebook\nhttps://www.facebook.com/PsychedelicScientist\n\nMore info about me:\n\nManesh Girn is a Neuroscience PhD student at McGill University and has been lead or co-author on over a dozen scientific publications and book chapters on topics including psychedelics, meditation, daydreaming, and brain networks. \n\nManesh currently has ongoing collaborations with Robin Carhart-Harris and others at the Imperial College Center for Psychedelic Research and is investigating the brain changes underlying psilocybin, LSD, and DMT.\n\nhttps://twitter.com/MGirnNeuro\nhttps://www.researchgate.net/profile/Manesh_Girn\nhttps://scholar.google.com/citations?user=ubfgBP4AAAAJ&hl=en&oi=ao",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}