{
  "title": "#431: The Questions Fans Had After 'Goblet of Fire'",
  "link": "https://audioboom.com/posts/7351786",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4530,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Welcome Slug Club member Stephanie! She recently became a mother, so we challenge her to sort little Eleanor into a Hogwarts House.</li>\n<li>Don't forget we'll be in Indy this weekend for Wizards Unite and at LeakyCon Boston this October! Use code MUGGLE when registering for $10 off!</li>\n<li>If you've waited in line at Universal Orlando for Hagrid's and missed the pre-show video, <a href=\"https://youtu.be/HBYDfCsXC2E\">watch it here</a>!</li>\n<li>In anticipation of our Order of the Phoenix chapter-by-chapter analysis we take a time turner back to the early 2000s to discuss the years before the fifth Harry Potter book.</li>\n<li>The wait between Goblet of Fire and Order of the Phoenix was three years (the longest gap!), and it was a critical period for the fandom.</li>\n<li>How did the Harry Potter fan community soar during this time?</li>\n<li>When did we all start discovering Harry Potter fansites?</li>\n<li>What were the biggest questions heading into Order of the Phoenix?</li>\n<li>Who was <a href=\"http://www.cosforums.com/cosarchive/archive/index.php/t-20-p-5.html\">going to die</a> in the fifth book? What did Priori Incantatem truly mean? What was next for Harry, Ron and Hermione?</li>\n<li>To help us out a bit, we revisited MuggleNet's <a href=\"https://web.archive.org/web/20021007085736/http://www.mugglenet.com/facts.shtml\">Facts About Book Five</a>!</li>\n<li>What were the hosts initial thoughts of the Order of the Phoenix cover art?</li>\n<li>Release party reminiscing: where were we all for the release of the fifth book?</li>\n<li>Quizzitch: where did Harry get the name Hedwig?</li>\n<li>In addition to Facebook, Twitter and Instagram... We're now on <a href=\"http://www.linkedin.com/company/mugglecastpodcast\">LinkedIn</a>!</li>\n<li>\n<a href=\"https://www.patreon.com/mugglecast\">Become a member of our community today</a> on Patreon and receive awesome, magical benefits!</li>\n</ul>\n",
  "pubDate": "Mon, 26 Aug 2019 15:44:45 +0000",
  "guid": "tag:audioboom.com,2019-08-26:/posts/7351786",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}