{
  "title": "Episode 111 - Tokyo 2020 Day 3 Review",
  "itunes:episode": 111,
  "itunes:title": "Episode 111 - Tokyo 2020 Day 3 Review",
  "itunes:episodeType": "full",
  "guid": "1ec11524-d20a-40b1-a418-f34c5e0eae31",
  "link": "https://share.transistor.fm/s/bf11208b",
  "description": "<p>Another day of Tokyo is behind us and it's been a golden day for both Australia & Canada...but more importantly TASMANIA! Yes that's right, Tasmania is finally on the board after an epic day that we will celebrate! We go over all the medal wins and talk up why Tasmania clearly is the star of the day.  We also find out why watching the triathlon was a bit more revealing than we were expected, as well as find out why the Off The Podium curse hasn't been put in the purse just yet. We also bring you some more exciting commentary, this time from the great sport of fencing, and also find out why Canadian judo athletes are sad and why Australian softball players are even sadder. It's another massive day of action you won't want to miss!</p>",
  "content:encoded": "<p>Another day of Tokyo is behind us and it's been a golden day for both Australia & Canada...but more importantly TASMANIA! Yes that's right, Tasmania is finally on the board after an epic day that we will celebrate! We go over all the medal wins and talk up why Tasmania clearly is the star of the day.  We also find out why watching the triathlon was a bit more revealing than we were expected, as well as find out why the Off The Podium curse hasn't been put in the purse just yet. We also bring you some more exciting commentary, this time from the great sport of fencing, and also find out why Canadian judo athletes are sad and why Australian softball players are even sadder. It's another massive day of action you won't want to miss!</p>",
  "pubDate": "Tue, 27 Jul 2021 01:39:30 +1000",
  "author": "Ben Waterworth, Colin Hilding & Jarrod Loobeek",
  "enclosure": "",
  "itunes:author": "Ben Waterworth, Colin Hilding & Jarrod Loobeek",
  "itunes:image": "",
  "itunes:duration": 7304,
  "itunes:summary": "Another day of Tokyo is behind us and it's been a golden day for both Australia & Canada...but more importantly TASMANIA! Yes that's right, Tasmania is finally on the board after an epic day that we will celebrate! We go over all the medal wins and talk up why Tasmania clearly is the star of the day.  We also find out why watching the triathlon was a bit more revealing than we were expected, as well as find out why the Off The Podium curse hasn't been put in the purse just yet. We also bring you some more exciting commentary, this time from the great sport of fencing, and also find out why Canadian judo athletes are sad and why Australian softball players are even sadder. It's another massive day of action you won't want to miss!",
  "itunes:subtitle": "Another day of Tokyo is behind us and it's been a golden day for both Australia & Canada...but more importantly TASMANIA! Yes that's right, Tasmania is finally on the board after an epic day that we will celebrate! We go over all the medal wins and talk u",
  "itunes:keywords": "olympics, off the podium, comedy, funny, interview, colin hilding, jarrod loobeek, ben waterworth, olympic games, sport, australia, canada",
  "itunes:explicit": "No"
}