{
  "title": "S1 E3: Giving Meaning to the Time Between Your Birth and Death",
  "link": "https://live-sounds-true-podcast.pantheonsite.io/podcast/episode-3-giving-meaning-to-the-time-between-your-birth-and-death/",
  "pubDate": "Wed, 14 Jul 2021 15:00:46 +0000",
  "guid": "https://resources.soundstrue.com/?post_type=podcast&#038;p=9226",
  "description": "The time that we have between our births and our deaths is a great gift. What we do with this time and how we give our lives meaning is the subject of this podcast with Michael Singer. Here, Singer discusses hard yet empowering truths about the fleeting nature of our lives, the inherent flaw in our most common strategies for feeling \"okay inside,\" why spirituality is never about getting what you want or avoiding what you don&#039;t want, and much more.",
  "content:encoded": "<p><span style=\"font-weight: 400;\">The time that we have between our births and our deaths is a great gift. What we do with this time and how we give our lives meaning is the subject of this podcast with Michael Singer. Here, Singer discusses hard yet empowering truths about the fleeting nature of our lives, the inherent flaw in our most common strategies for feeling &#8220;okay inside,&#8221; why spirituality is never about getting what you want or avoiding what you don&#8217;t want, and much more.</span></p>\n",
  "enclosure": "",
  "itunes:subtitle": "The time that we have between our births and our deaths is a great gift. What we do with this time and how we give our lives meaning is the subject of this podcast with Michael Singer. Here, Singer discusses hard yet empowering truths about the fleetin...",
  "itunes:summary": "The time that we have between our births and our deaths is a great gift. What we do with this time and how we give our lives meaning is the subject of this podcast with Michael Singer. Here, Singer discusses hard yet empowering truths about the fleeting nature of our lives, the inherent flaw in our most common strategies for feeling \"okay inside,\" why spirituality is never about getting what you want or avoiding what you don&#039;t want, and much more.",
  "itunes:author": "Michael Singer",
  "itunes:image": "",
  "itunes:duration": "59:45"
}