{
  "title": "Rocket Report: SLS boosters may expire in December; Blue Origin delivers the BE-4s",
  "link": "https://arstechnica.com/?p=1894795",
  "dc:creator": "Eric Berger",
  "pubDate": "Fri, 04 Nov 2022 11:00:31 +0000",
  "category": [
    "Science",
    "rocket report",
    "space"
  ],
  "guid": "https://arstechnica.com/?p=1894795",
  "description": "\"We’re eager to get the helicopter back out there and advance our rocket reusability.\"",
  "content:encoded": "<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\">\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/11/Falcon-Heavy-USSF44-Nov-1-2022-3106-800x534.jpg\" alt=\"Image of Falcon 9 rockets landing at Cape Canaveral.\">\n      <p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/11/Falcon-Heavy-USSF44-Nov-1-2022-3106.jpg\" class=\"enlarge-link\" data-height=\"1067\" data-width=\"1600\">Enlarge</a> <span class=\"sep\">/</span> This photo shows the two side-mounted boosters of this week's Falcon Heavy launch landing in Florida. (credit: Trevor Mahlmann)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 5.16 of the Rocket Report! If you're counting, there are now fewer than 60 days until the end of 2022. How many more US rockets will make their debut before the end of the year? SLS? Terran 1? Super Heavy? RS1? None of the above? You didn't ask, but my over/under would be 1.5 of the above, and that may be a tad optimistic.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets, as well as a quick look ahead at the next three launches on the calendar.</p>\n<div class=\"image shortcode-img center full\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\"></div>\n<p><strong>Rocket Lab to attempt booster recovery again</strong>. The US-based rocket company says it will make a second mid-air recovery attempt of an Electron booster during the Friday launch of a Swedish scientific satellite, <a href=\"https://spacenews.com/rocket-lab-to-attempt-booster-recovery-on-upcoming-electron-launch/\">Space News reports</a>. This \"Catch Me If You Can\" mission is scheduled to launch November 4 at 1:15 pm ET (17:15 UTC) from the company’s Launch Complex 1 in New Zealand. The launch will be Rocket Lab's second attempt to recover the Electron’s first stage, descending under a parachute, using a helicopter.</p></div><p><a href=\"https://arstechnica.com/?p=1894795#p3\">Read 26 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1894795&comments=1\">Comments</a></p>"
}