{
  "title": "“MIT Built a Theranos for Plants” update",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/16/mit-built-a-theranos-for-plants-update/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/16/mit-built-a-theranos-for-plants-update/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Sun, 16 Oct 2022 13:31:46 +0000",
  "category": "Zombies",
  "guid": "https://statmodeling.stat.columbia.edu/?p=47933",
  "description": "Remember this from a couple years ago? This news article by Tom McKay is hilarious: The prestigious multidisciplinary MIT Media Lab built a “personal food computer” that worked so poorly that demos had to be faked Theranos-style . . . &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/16/mit-built-a-theranos-for-plants-update/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p><a href=\"https://statmodeling.stat.columbia.edu/2020/08/21/mit-built-a-theranos-for-plants/\">Remember this</a> from a couple years ago?</p>\n<blockquote><p><a href=\"https://gizmodo.com/mit-built-a-theranos-for-plants-1837968240\">This news article</a> by Tom McKay is hilarious:</p>\n<blockquote><p>The prestigious multidisciplinary MIT Media Lab built a “personal food computer” that worked so poorly that demos had to be faked Theranos-style . . . According to Business Insider, the project—a plastic hydroponic grow box filled with “advanced sensors and LED lights” that would supposedly make it possible to replicate crop conditions from any part of the global—was a sham, with MIT’s Open Agriculture Initiative director Caleb Harper resorting to faking demos . . . According to Business Insider, Harper directed an email requesting comment to an MIT spokesperson, who “didn’t provide a comment.”</p></blockquote>\n<p>No comment, huh?  The &#8220;Media Lab&#8221; should be able to do better than that, no?  If that&#8217;s all they can do, they could just as well hire <a href=\"https://statmodeling.stat.columbia.edu/2017/04/12/pizzagate-update-response-cornell-university-media-relations-office/\">the media team from Cornell</a>.  You&#8217;re the goddam media lab, dudes:  you should be able to work with the media, no?</p>\n<p>Ahhh, MIT . . . <a href=\"https://statmodeling.stat.columbia.edu/2014/04/04/going-criticize-blog-im-just-tired-things-like-whats-really-horrible-news-article-takes-seriously-problem/\">what&#8217;s happened</a> to you?  Lots has changed since 1986, I guess.</p></blockquote>\n<p>Palko shares <a href=\"https://twitter.com/SeiffertDon/status/1557755379756449796\">this update</a> from journalist Don Seiffert, who writes:</p>\n<blockquote><p>More than two years ago, MIT quietly shut down one of its most high-profile research projects after allegations that the science being touted didn&#8217;t work. The school still hasn&#8217;t addressed the allegations, nor its oversight of the project, and now a new lawsuit alleges that school administrators were told of the problems more than a year before media reports on the Open Agriculture Initiative came to light. The lawsuit alleges that MIT used the project to burnish its reputation as one of the world&#8217;s top research organizations and to raise money. While the allegations of misrepresentation of research at OpenAg are not new, the episode was largely overshadowed by the Jeffrey Epstein scandal which occurred at the same time. . . .</p></blockquote>\n<p>Full story from Seiffert <a href=\"https://archive.ph/Ji6pJ\">here</a>, including these juicy bits:</p>\n<blockquote><p>The lawsuit alleges that MIT ended [a former researcher&#8217;s] appointment at MIT “for complaining about and reporting research fraud and fraudulent fundraising activities,” and further claims that the university “knew at all times” that the central innovation of that research, called the food computer, “simply did not operate as it claimed.” . . .</p>\n<p>In a press release on April 3, 2019, the school listed OpenAg research funders, including Target Corp., Lee Kum Kee Health Products Group, Welspun, Sentient Technologies, and Cognizant Technology Solutions. . . . The director of the program, Caleb Harper, was invited by MIT President Rafael Reif in May 2016 “to participate in his Campaign for a Better World in New York and London, which sought billions of dollars of unrestricted funds for MIT,” according to the lawsuit . . . MIT has never publicly addressed the allegations of problems with its own internal controls or its oversight of the research, nor whether it has taken steps to ensure similar alleged exaggerations of research aren’t repeated in future projects. . . . </p></blockquote>\n<p>Hey!  Are they using <a href=\"https://statmodeling.stat.columbia.edu/2022/06/23/a-garland-of-retractions-for-the-ohio-state-department-of-chutzpah-cancer-biology-and-genetics/\">Ohio State</a> as a model??  On the plus side, their <a href=\"https://statmodeling.stat.columbia.edu/2022/07/09/columbia-loses-its-no-2-spot-in-the-u-s-news-rankings/\">U.S. News ranking data</a> probably aren&#8217;t being fudged, right?</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/16/mit-built-a-theranos-for-plants-update/feed/",
  "slash:comments": 17
}