{
  "published": "2022-10-31T15:23:46-04:00",
  "updated": "2022-10-31T15:23:46-04:00",
  "title": "The Pelosi attack is the culmination of longtime GOP hate-mongering",
  "content": "<figure>\n      <img alt=\"Pelosi, in a pale blue suit, is seen in profile against a dark background, speaking into a microphone.\" src=\"https://cdn.vox-cdn.com/thumbor/vmMblYVu4pmcCJKLN_-TDQUEQD8=/0x0:5333x4000/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/71559937/1239752783.0.jpg\" />\n        <figcaption>House Speaker Nancy Pelosi (D-CA) speaks at a vigil at the Martin Luther King Jr. Memorial on April 4, 2022, in Washington, DC.&nbsp; | Sarah Silbiger/Getty Images</figcaption>\n    </figure>\n\n  <p>For years, Republicans made Nancy Pelosi out to be a public enemy. The attack on her home is the result.</p> <p id=\"Ji46fn\">Friday’s <a href=\"https://www.vox.com/policy-and-politics/2022/10/28/23428394/pelosi-attack-husband-paul-nancy\">brutal attack on House Speaker Nancy Pelosi’s husband</a>, Paul Pelosi, at their San Francisco home was overtly political — and a logical endpoint to the decades of deeply personal villainization Speaker Pelosi has weathered from her political opponents.</p>\n<p id=\"fCbKS9\">It’s now clear the speaker was the target of Friday’s attack. The assailant broke into the home <a href=\"https://www.cnn.com/politics/live-news/nancy-pelosi-husband-paul-attack\">looking for her</a>, reportedly shouting, “Where is Nancy?” — echoing what insurrectionists called out when they <a href=\"https://www.vox.com/2022/10/14/23404556/january-6-hearings\">breached the US Capitol on January 6</a>, 2021 — and saying that he would wait “until Nancy got home” as he confronted Paul Pelosi. The speaker’s husband suffered a skull fracture and serious injuries to his right arm and hands that required surgery after the assailant bludgeoned him with a hammer. The attacker faces <a href=\"https://www.justice.gov/opa/pr/man-charged-assault-and-attempted-kidnapping-following-breaking-and-entering-pelosi-residence\">federal assault and attempted kidnapping</a> charges. (A spokesperson for the speaker said in a <a href=\"https://www.speaker.gov/newsroom/102822-1\">statement</a> that Paul Pelosi is expected to make a full recovery.) </p>\n<p id=\"PAoiEM\">Republicans have dismissed any connection between their rhetoric and the attack. Instead, they’ve blamed Democratic policies on crime and suggested that growing political violence may be the result of general anxiety around election legitimacy. Elon Musk, the billionaire Tesla CEO who was <a href=\"https://thehill.com/policy/3709197-republicans-cheer-musks-twitter-takeover/\">cheered by Republicans</a> when he <a href=\"https://www.vox.com/recode/2022/10/27/23424938/elon-musk-own-twitter-deal-closes-what-will-change-superapp-layoffs-free-speech-parag-agrawal\">bought Twitter</a> last week, has <a href=\"https://www.washingtonpost.com/technology/2022/10/30/musk-deleted-tweet-pelosi/\">advanced a right-wing anti-LGBTQ conspiracy theory</a> around the circumstances of the attack. Though he deleted his post, it remained on Twitter long enough to be amplified and repeated by many on the right.</p>\n<p id=\"bHvsjv\">Even before Pelosi became speaker, Republicans in the party and those adjacent to it have demonized her regularly, featuring her in attack ads and lambasting her on Fox News. At least one of her colleagues in the House, Rep. Marjorie Taylor Greene (R-GA), has directly indicated support for violence against her. And members of right-wing militia groups such as the Oath Keepers and the Three Percenters have <a href=\"https://www.newsweek.com/oath-keeper-who-allegedly-looked-pelosi-during-capitol-riot-sues-house-speaker-1665340\">sought her assassination</a>. </p>\n<p id=\"WqnyjO\">Police haven’t gone into further detail about the attacker’s motivations, but his <a href=\"https://www.cnn.com/politics/live-news/nancy-pelosi-husband-paul-attack#h_e00f25aa829a9c2c4d9fdead2cfd2eb8\">Facebook posts</a> on conspiracy theories around Covid-19 vaccines, the 2020 election, and the January 6 attack provide a window into his radicalization. <a href=\"https://www.vice.com/en/article/m7gkey/david-depape-paul-pelosi-attack\">Other blog posts under his name</a> contained screeds against minorities, politicians, women, and global elites, and content related to <a href=\"https://apnews.com/article/california-donald-trump-san-francisco-47c103cfe696df9faf0e57e1c7dd4f10\">QAnon</a> — the false pro-Trump conspiracy theory that a cabal of Satan-worshipping pedophiles, including prominent Democrats like Pelosi, are running the world. </p>\n<p id=\"wnUSLI\">None of those posts reference Pelosi specifically, but all of them intersect with the ways she has been a familiar target of the right — and not just on the political fringes. </p>\n<h3 id=\"BSkKjK\">The long history of Republicans demonizing Nancy Pelosi</h3>\n<p id=\"Iksuqp\">Pelosi has been villainized by Republicans since she first ascended to Democratic leadership.</p>\n<p id=\"wIeGHG\">In 2003, within days of her election as House minority leader, she quickly faced gendered attacks from Republicans who were, as Mark Z. Barabak wrote for the <a href=\"https://www.latimes.com/world/la-me-pelosi012603-story.html\">Los Angeles Times</a> at the time, “eager to attack Pelosi as a loopy San Francisco liberal and exploit her city’s reputation as the odd-sock drawer of America. Within days, her face — garish and twisted — showed up in an attack ad slamming the Democrat in a Louisiana House race. (He won anyway.) She surfaced as Miss America, complete with tiara, in a spoof on Rush Limbaugh’s Web site.”</p>\n<p id=\"WAaLMb\">Such attacks continued throughout her tenure as minority leader, including during the 2006 election when Republicans <a href=\"https://www.nytimes.com/2006/11/02/us/politics/02nancyads.html\">ran a swath of attack ads</a> featuring unflattering photos of Pelosi often looking angry, bug-eyed, or startled. And they increased in 2010, after she had become speaker. Republicans made her the face of their attacks on Democrats’ Affordable Care Act and launched a “Fire Pelosi” campaign, which involved a bus tour and images of Pelosi engulfed in flames. </p>\n<p id=\"rlXQs1\">Under the Trump era and in the years since, the attacks have only escalated in tenor. Former President Donald Trump, who has <a href=\"https://thehill.com/blogs/blog-briefing-room/3710580-trump-silent-on-paul-pelosi-attack/\">remained silent</a> about the attack on Paul Pelosi, <a href=\"https://www.theatlantic.com/politics/archive/2019/05/trump-pelosi-video/590233/\">shared doctored videos of the speaker</a> designed to call into question her mental fitness, retweeted accusations that she was “<a href=\"https://www.haaretz.com/world-news/2020-05-25/ty-article/trump-retweets-series-of-sexist-and-personal-attacks-against-top-female-democrats/0000017f-f45f-d487-abff-f7ff73320000\">drinking booze on the job,</a>” and had a litany of derogatory nicknames for her, among them “<a href=\"https://www.apnews.com/ce08485cee37470db8983b8bd06c40a0\">Crazy Nancy</a>,” “<a href=\"https://www.mediaite.com/tv/trump-gives-new-nickname-to-nancy-pelosi-ahead-of-d-day-ceremony-shes-a-disaster/\">Nervous Nancy</a>,” and “<a href=\"https://www.youtube.com/watch?v=s7DKYML2MRs\">Nancy Antoinette</a>.”</p>\n<p id=\"Kk7rHA\">Many of Trump’s followers echoed his rhetoric, online and in conservative media such as Fox News. In 2021, Fox News host Mark Levin <a href=\"https://www.mediamatters.org/mark-levin/fox-news-host-mark-levin-launches-vulgar-sexist-attack-speaker-nancy-pelosi\">called her</a> “a nasty old bag — that’s what she is, a nasty, vicious, unhinged fool” who “has the hots for Trump” and “can’t get Trump out of her head.”</p>\n<p id=\"W89HgK\">Rhetoric involving Pelosi has often taken violent turns as well. In 2018 and 2019, Taylor Greene repeatedly <a href=\"https://www.cnn.com/2021/01/26/politics/marjorie-taylor-greene-democrats-violence/index.html\">seemed to suggest support </a>for Pelosi’s execution, among that of other prominent Democrats, liking a Facebook post that said “a bullet to the head” would be the most expedient way to end Pelosi’s speakership. Taylor Greene also claimed in a Facebook video that Pelosi was guilty of treason, noting “a crime punishable by death is what treason is.” </p>\n<p id=\"h4ynpO\">One candidate in the GOP primary for Senate in Arizona this year aired a <a href=\"https://twitter.com/jim_lamon/status/1491836062934704141?s=20&amp;t=l6reae7YVDdyja7WyCH35w\">Super Bowl ad</a> that featured him dressed as sheriff shooting down an actor playing Pelosi, identified as “Crazy Face Pelosi,” after he says, “The good people of Arizona have had enough of you.” In the period since Labor Day, Republicans have reportedly since spent nearly <a href=\"https://www.washingtonpost.com/politics/2022/10/29/paul-pelosi-attack-republicans-target/\">$40 million</a> on ads that mention Pelosi.</p>\n<p id=\"ObBTKi\">Last week, National Republican Congressional Committee chair Tom Emmer (R-MN) <a href=\"https://twitter.com/tomemmer/status/1585300985999949824?s=20&amp;t=OI7D_zMSciVoV87wGhAZqg\">posted a video</a> of himself firing a gun with the hashtag #FirePelosi. And even on Friday, just hours after the attack, Virginia’s Republican Gov. Glenn Youngkin linked the attack on Pelosi’s husband to the November elections, drawing condemnation from Democrats who <a href=\"https://www.washingtonpost.com/dc-md-va/2022/10/28/youngkin-pelosi-attack-comment-outrage/\">called the comments insensitive</a>. </p>\n<p id=\"VJVQZZ\">“There’s no room for violence anywhere, but we’re going to send [Pelosi] back to be with him in California,” Youngkin said at a campaign rally in Stafford for GOP congressional candidate Yesli Vega.</p>\n<p id=\"91I1ZS\">Fox News anchors have also tried to tie the attack to Republicans’ message on crime in the midterms. “This can happen anywhere. Crime is random and that’s why it’s such a significant part of this election story,” Fox anchor Bill Hemmer <a href=\"https://twitter.com/MattGertz/status/1585981763137904640?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1585981763137904640%7Ctwgr%5E9a91ed128b9d4ca70a5a6a46b72479a7d53b69a6%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.vox.com%2Fpolicy-and-politics%2F2022%2F10%2F28%2F23428394%2Fpelosi-attack-husband-paul-nancy\">said on air Friday</a>.<strong> </strong>Republican National Committee chair Ronna McDaniel <a href=\"https://www.politico.com/news/2022/10/30/rnc-chair-gop-rhetoric-pelosi-assault-00064129\">echoed that talking point</a> on Fox News Sunday, saying, “If this weren’t Paul Pelosi, this criminal would probably be out on the street tomorrow ... This is what Democrat policies are bringing.”</p>\n<p id=\"HwQZZW\">Other Republicans — including Florida Sen. Rick Scott, chair of the GOP’s Senate campaign arm — denounced the attack but argued against Republicans having a key role in fomenting the conspiracy theories of the attacker. Scott seemed to suggest the attack was rooted in a general lack of public confidence in elections.</p>\n<p id=\"zUZrVO\">“I think what we have to do is, one, we have to condemn the violence, and then we have to do everything we can to get people — make sure people feel comfortable about these elections,” he said Sunday on <a href=\"https://www.cnn.com/2022/10/30/politics/rick-scott-pelosi-election-conspiracies-cnntv\">CNN</a>. </p>\n<p id=\"dB3nTp\">The vilification of Pelosi has taken an even uglier form in ultra-right-wing circles online. Conspiracy theories like the one shared by Musk abound, and even <a href=\"https://www.politico.com/news/2022/10/31/conservatives-disinformation-paul-pelosi-assault-00064208\">Republican members of Congress</a> are spreading misinformation:</p>\n<div id=\"Xk3Y2W\">\n<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"en\" dir=\"ltr\">Here is the deleted tweet from <a href=\"https://twitter.com/CaptClayHiggins?ref_src=twsrc%5Etfw\">@CaptClayHiggins</a>, a member of <a href=\"https://twitter.com/HomelandGOP?ref_src=twsrc%5Etfw\">@HomelandGOP</a>. <a href=\"https://t.co/2GRdhwiOvz\">pic.twitter.com/2GRdhwiOvz</a></p>— Steve Herman (@W7VOA) <a href=\"https://twitter.com/W7VOA/status/1586839478446047232?ref_src=twsrc%5Etfw\">October 30, 2022</a>\n</blockquote>\n<script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n</div>\n<p id=\"imNbpx\">Some on Trump’s social media platform Truth Social have also been openly celebrating the attack, with the hashtag #PelosiCrimeFamily trending over the weekend. </p>\n<p id=\"bqLYkP\">Arguably, the current venom aimed at Pelosi wouldn’t exist without the decades of Republican vitriol against her. President Joe Biden made that connection explicit at a fundraising dinner Friday in Philadelphia, saying that political violence is the natural outcome of the kind of rhetoric that Republicans have enabled. “What makes us think that it’s not going to corrode the political climate?” he asked.</p>\n<h3 id=\"vovv93\">Misogyny, anti-elitism, and anti-democratic ideas feature heavily in attacks on Pelosi</h3>\n<p id=\"0XdLwa\">As the first female speaker of the House, and one serving at a time of increasing <a href=\"https://www.vox.com/policy-and-politics/22814025/democracy-trump-january-6-capitol-riot-election-violence\">political polarization</a> and <a href=\"https://www.vox.com/22229753/violence-biden-inauguration-trump-right-wing-militia\">anti-democratic violence</a>, Pelosi has faced uniquely intense attacks that have channeled right-wing anger about her gender, wealth, and pro-democratic rhetoric. </p>\n<p id=\"fG3Mil\">Even when she first ran for Congress, Republicans sought to portray her as unserious, a <a href=\"https://opencommons.uconn.edu/cgi/viewcontent.cgi?article=1006&amp;context=srhonors_theses\">“liberal dilettante” and “airhead”</a> — insults that ring of sexism. </p>\n<p id=\"vDXG9q\">In 2007, conservative talk radio host Rush Limbaugh <a href=\"https://www.politico.com/story/2009/03/gop-finds-pelosi-an-elusive-target-019630\">mocked her election</a> to the speakership: “This is a triumph of feminism and estrogen. ... And ladies, the long 200-year national nightmare without a woman at the top is now over.” In 2009, Democrats accused Republicans of advancing antiquated attitudes toward women when they ran an ad suggesting that Pelosi should be put “<a href=\"https://www.wsj.com/articles/BL-WB-13758\">in her place</a>” on the issue of Afghanistan. And in 2014, a Republican member suggested that she “might want to try” doing her research on the border, comments that her Democratic colleagues took to be <a href=\"https://thehill.com/blogs/blog-briefing-room/news/214303-democratic-lawmaker-attack-on-pelosi-sexist/\">patronizing and sexist</a>. </p>\n<p id=\"f6VmxL\">Pelosi doesn’t talk about her gender much, but on occasion she has pointed out the disparate treatment and unique attacks she’s faced as a woman in congressional leadership. For instance, amid questions in 2014 about her age and whether she should hand the mantle to a successor, she <a href=\"https://www.washingtonpost.com/news/the-fix/wp/2014/11/13/nancy-pelosi-just-lectured-us-about-sexism-and-politics/\">retorted</a> that then-Senate Minority Leader Mitch McConnell, who is just two years younger than her, should be fielding similar questions. And in 2018, after being demonized by Trump and the GOP and still winning the speakership, she <a href=\"https://www.cnbc.com/2018/11/07/republicans-declared-war-on-nancy-pelosi-and-she-won.html\">told CNBC</a>, “I don’t want women to think if you get attacked, you run away.”</p>\n<p id=\"GW0Ywp\">The attacks against Pelosi over the years have also focused on her wealth. On the right, there have long been harsh critiques of “elites,” often <a href=\"https://www.vox.com/videos/2019/4/3/18294392/tucker-carlson-pretends-hate-elites-populism-false-consciousness\">stoked by Fox News</a>; increasingly, as my <a href=\"https://www.vox.com/policy-and-politics/23373795/curtis-yarvin-neoreaction-redpill-moldbug\">colleague Andrew Prokop recently explained</a>, influential members of the right argue an “elite left ‘ruling class’ has captured and is ruining America, and that drastic measures are necessary to fight back against them.”   </p>\n<p id=\"WPgp3U\">For many — including one January 6 rioter and recruiter for <a href=\"https://www.splcenter.org/fighting-hate/extremist-files/group/three-percenters\">the Three Percenters</a>, an anti-government movement — Pelosi is the face of that “<a href=\"https://news.bloomberglaw.com/white-collar-and-criminal-law/jan-6-rioter-saw-pelosi-as-evil-incarnate-friend-tells-jury\">evil</a>” ruling class. And she’s often been attacked as one of that class’s most hypocritical members. She’s <a href=\"https://www.businessinsider.com/nancy-pelosi-stock-trades-congress-investments-2022-7\">faced criticism</a> for initially dismissing the idea that members of Congress and their family members shouldn’t be allowed to trade stocks, despite the fact that they have access to confidential intelligence. </p>\n<p id=\"D4Gd6A\">It’s a critique that was particularly intense given she is one of the richest members of Congress, with an estimated net worth of <a href=\"https://www.businessinsider.com/nancy-pelosi-stock-trades-congress-investments-2022-7\">at least $46 million</a>, and that fortune has grown in part thanks to lucrative trades by Paul Pelosi, a venture capitalist. She later endorsed <a href=\"https://www.vox.com/policy-and-politics/2022/9/28/23377587/house-democrats-stock-trading-bill-blind-trust\">legislation</a> that would make it harder for members of Congress to use information they receive on the job for their own financial gain, but it currently seems unlikely to pass. </p>\n<p id=\"bb4gFb\">Ironically, Trump attacked Pelosi for her wealth and elite status a number of times; perhaps most notably, he sought to use her wealth to portray her as out of touch in a <a href=\"https://twitter.com/parscale/status/1252369647338319878?s=20&amp;t=eO8qnFEC9l0dlfQkgjPe-w\">2020 campaign ad</a> ridiculing her expensive fridge filled with ice cream while Americans were going hungry during the Covid-related economic downturn. </p>\n<p id=\"0ycKFk\">Both the sexist and anti-elite lines of attack have directly fed into the anti-democratic attacks that have recently overshadowed the rest. She was a top target during the January 6 insurrection, when the mob tore apart her office, calling out her name and searching for her. Rioters, emboldened by Trump’s lie that the 2020 election was stolen from him, left no doubt as to what they would have done to her: “We did our part. We were looking for Nancy to shoot her in the frickin’ brain. But we didn’t find her,” <a href=\"https://www.nbcnews.com/news/us-news/jan-6-rioter-talked-shooting-nancy-pelosi-was-sentenced-60-days-rcna39484\">one woman said in a selfie video</a>.</p>\n<p id=\"rVJ3tN\">After the insurrection was put down, Pelosi declared that “<a href=\"https://www.speaker.gov/newsroom/1522-0\">democracy won</a>.” But it’s clear that pro-Trump extremists like the man who broke into her house Friday aren’t willing to give up the fight. </p>\n<p id=\"S4UI4E\"><em><strong>Update, October 31, 3:20 pm ET: </strong></em><em>This story, originally published on October 29, has been updated to reflect Republicans’ latest responses to the attack, the spread of conspiracy theories related to the incident, and the new charges the attacker faces. </em></p>",
  "link": "",
  "id": "https://www.vox.com/policy-and-politics/2022/10/29/23430340/nancy-pelosi-paul-pelosi-political-violence-republican-attacks",
  "author": {
    "name": "Nicole Narea"
  }
}