{
  "title": "OkCupid’s Dating Data Center",
  "link": "https://theblog.okcupid.com/okcupids-dating-data-center-f91e2e362315?source=rss----2cd59e7d4ed1--data",
  "guid": "https://medium.com/p/f91e2e362315",
  "category": [
    "data",
    "love",
    "dating",
    "dating-data-center",
    "relationships"
  ],
  "dc:creator": "OkCupid",
  "pubDate": "Tue, 01 Jun 2021 11:03:18 GMT",
  "atom:updated": "2021-08-09T20:23:53.928Z",
  "content:encoded": "<h4>What singles are matching on in June 2021</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*1p6l_UgVOqjpZ-dW6tx1wQ.gif\" /></figure><p>Every month we will be sharing the latest OkCupid matching questions and responses, showing what’s top of mind for our millions and millions of daters around the world. Our newest questions cover everything from dating during the pandemic to what you would do in a zombie apocalypse. And in 2021, our in-app matching questions have already been answered over 260 million times — 14% more than during the same timeframe last year.</p><p>As more and more daters get their coronavirus vaccines, singles are proudly sharing their status. The phrase “I’m vaccinated” on OkCupid profiles increased over 1,400% in May compared to January. And OkCupid made it even easier for daters by launching the <a href=\"https://theblog.okcupid.com/vaccinated-is-the-new-tall-dark-and-handsome-921494016895\">“I’m Vaccinated” profile badge & stack</a> last month to signal to other daters they’ve had at least one dose of the vaccine.</p><h4><strong>What we’re asking</strong>:</h4><ul><li>Will you get the COVID-19 vaccine?</li><li>Would you cancel a date with someone who didn’t want to take the COVID-19 vaccine?</li><li>Will you wear a mask after the pandemic?</li><li>Do you support marriage equality?</li><li>Is it important to you that your match cares about the LGBTQ+ community?</li><li>How long do you generally wait before asking a new match out on a date?</li><li>What would you do in a zombie apocalypse?</li></ul><h4><strong>What you’re saying</strong>:</h4><ul><li>Over 7 in 10 daters said they will get the COVID-19 vaccine (over 1 million respondents), and those who are planning to get it are getting 15% more Likes and 14% more Matches, and are having 4.5% more conversations,</li><li>Millennials and Gen Z are more likely than Gen X to cancel a date with someone who didn’t want to get the COVID-19 vaccine</li><li>Over 7 in 10 daters said they will wear a mask after the pandemic when they are on public transportation and in crowded places (38%), when they are sick (22%), or all the time (11%)</li><li>97% of people on OkCupid support marriage equality, and those who do are having 15% more conversations and getting almost 30% more Likes</li><li>7 in 10 Gen Z and Millennial OkCupid users said it’s important to them that their match cares about the LGBTQ+ community, and those that do get 22.5% more Matches and almost 80% more Likes</li><li>Nearly a third of daters (27%) wait a week or more to ask a new match out on a date while 25% wait 1–2 days, 25% wait 3–4 days, and 22% wait to be asked out</li><li>Millennials are almost 20% more likely than Gen Z to ask a new match out on a date within 1–2 days</li><li>Gen Z are over 18% more likely than Millennials to wait for a match to ask them out on a date</li><li>If they were caught in a zombie apocalypse, 6 in 10 people on OkCupid would fight back (match accordingly!)</li></ul><h4><strong>People who are vaccinated on OkCupid are more likely to</strong>:</h4><ul><li>Be concerned about climate change</li><li>Be more into love over sex right now</li><li>Be open to trying new things in bed</li><li>Be totally anti-war</li><li>Believe in fate</li><li>Believe they are smarter than most people</li><li>Consider themselves a feminist</li><li>Enjoy discussing politics</li><li>Say their sexual interests have become kinkier as they’ve grown older</li><li>Prefer their partner be an active reader</li><li>Support marriage equality</li></ul><p><em>Ready to date again? </em><a href=\"https://okcupid.onelink.me/godV/44c7b6b0\"><em>Download OkCupid</em></a><em> to find someone now.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=f91e2e362315\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://theblog.okcupid.com/okcupids-dating-data-center-f91e2e362315\">OkCupid’s Dating Data Center</a> was originally published in <a href=\"https://theblog.okcupid.com\">OkCupid Dating Blog</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}