{
  "id": "https://bibleinoneyear.org/en/youth/222",
  "title": "Day 222: Good Judgment",
  "description": "Psalm 94:1–2a, 2 Chronicles 1:7–12, 1 Corinthians 6:1–2a,3,5–9,11.  The result is terrible injustice  The poor, in particular, tend to be the victims",
  "pubDate": "Tue, 10 Aug 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/222/?ignore",
  "itunes:duration": "12:53",
  "guid": "enyouth10082021-222",
  "length": 773.2,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 222: Good Judgment",
  "itunes:subtitle": "Psalm 94:1–2a, 2 Chronicles 1:7–12, 1 Corinthians 6:1–2a,3,5–9,11.  The result is terrible injustice  The poor, in particular, tend to be the victims",
  "itunes:summary": "When I practised as a barrister most of the judges I appeared before were extremely good. However, I remember one occasion when I appeared before a judge who was not good. It was a terrible experience.\nI was representing the defendant in a criminal case. It was only the second case I had ever done in front of a jury. I was young and inexperienced. Nevertheless, it seemed to me that there was something very wrong with the way in which the judge was conducting the case. She kept interrupting me whenever I was speaking. She intervened over and over again with her own questions. I ended up having what the court usher described as a ‘stand up row with the judge’.\nThe judge’s summing up was more like a second prosecution speech; my client was duly convicted and sent to prison. We appealed, on the basis that the defendant was entitled to a fair trial and he had not been given one.\nWhen I appeared before three very senior judges in the Court of Appeal, I was extremely nervous that they might not approve of my part in the ‘stand up row with the judge’! To my relief they were as appalled as I had been by her conduct of the trial. They overturned the original decision and my confidence in the British legal system was restored.\nGood judges are scarce. In many parts of the world, judges are subject to bribery and corruption. There is no rule of law. The result is terrible injustice. The poor, in particular, tend to be the victims.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 222
}