{
  "title": "Bring Physics-Based AI Into Your Research With NVIDIA Modulus",
  "link": "https://info.nvidia.com/developer-physics-informed-machine-learning-with-modulus-webinar.html?&ncid=pa-srch-othe-987968-vt16#cid=ix01_pa-srch-othe_en-us",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/image.png?id=31869919&width=980\"/><br/><br/><p>High-fidelity simulations in science and engineering are widely used in industrial, seismic, weather/climate, and life sciences applications. However, traditional simulations remain computationally expensive and impractical for real time applications. They are discretization dependent, meaning they do not easily assimilate either measured or synthetic data from various sources. Due to rapid developments in AI for science and engineering problems, machine learning has assumed an important complementary role in addressing the critical gaps in the traditional methods.</p><p>NVIDIA Modulus is a physics-based machine learning platform that has several state-of-the-art network architectures and data, as well as PDE driven AI techniques to solve real world science and engineering problems. Various performance features for both single and multi-GPU/node systems, plus connectivity with several NVIDIA toolkits and technologies are available in Modulus. Examples and documentation are provided to ensure seamless learning for students while the researchers can customize the framework through various APIs.</p><h2>Introduction to NVIDIA Modulus: A Physics-ML Framework for Research</h2><p>This webinar will introduce you to applications of machine learning, various domains of science and engineering, as well as a deep dive into the code implementation, training, solution, and visualization aspects of physics-ML workflow.</p><p><a href=\"https://info.nvidia.com/developer-physics-informed-machine-learning-with-modulus-webinar.html?&ncid=pa-srch-othe-987968-vt16#cid=ix01_pa-srch-othe_en-us\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Register now for this free webinar!</a></p><hr/><p><strong>By attending this webinar, you will learn about:</strong></p><ul><li>The machine learning applications in science & engineering with physics-ML framework, NVIDIA Modulus.</li></ul><ul><li>How you can extend/modify Modulus to implement your own work.</li></ul><ul><li>The architecture and functionality of Modulus, and performance enhancements for data & physics driven systems.</li></ul><ul><li>How the Modulus framework integrates with other Nvidia toolkits and technologies: PySDF (for geometry), DALI™ (for data loading), Triton™ (for inference), Omniverse™ platform (for visualization).</li></ul>Join us after the presentation for a live Q&A session with Jianjun Xu, Ph.D., Sr. Solutions Architect, Amazon Web Services.",
  "pubDate": "Wed, 05 Oct 2022 18:45:41 +0000",
  "guid": "https://info.nvidia.com/developer-physics-informed-machine-learning-with-modulus-webinar.html?&ncid=pa-srch-othe-987968-vt16#cid=ix01_pa-srch-othe_en-us",
  "category": [
    "Nvidia",
    "Ai",
    "Artificial intelligence",
    "Machine learning",
    "Research",
    "Simulations",
    "Type:webinar"
  ],
  "dc:creator": "NVIDIA",
  "media:content": ""
}