{
  "title": "TU112: The Life-Changing Science of Memory Reconsolidation with Guests Bruce Ecker &#038; Tori Olds",
  "link": "https://therapistuncensored.com/episodes/tu112-the-life-changing-science-of-memory-reconsolidation-with-guests-bruce-ecker-tori-olds/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu112-the-life-changing-science-of-memory-reconsolidation-with-guests-bruce-ecker-tori-olds",
  "pubDate": "Tue, 07 Jan 2020 10:42:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7864",
  "description": "Tori Olds with Deep Eddy Psychotherapy\nLearn to apply the advances in neuroscience to our lives in a real way – we all want to be able to do that, right? This episode delivers on that for sure – memory reconsolidation is changing how therapists practice and explains why those lightbulb moments can actually transform us if done correctly. 🙂\nIn this episode,\nPowerhouse clinicians Tori Olds and Bruce Ecker join co-host Sue Marriott in a discussion on how memory reconsolidation brings awareness to old maps and traumatic emotional learning and gives us a clean slate on which to build new learning pathways.\nSaturday February 15, 2020: Introduction to Coherence Therapy, Austin, TX\nWho is Bruce Ecker?\nBruce Ecker, MA, LMFT is co-originator of Coherence Therapy and coauthor\nof Unlocking the Emotional Brain: Eliminating Symptoms at Their Roots Using Memory Reconsolidation; the Coherence Therapy Practice Manual & Training Guide; and Depth Oriented Brief Therapy: How To Be Brief When You Were Trained To Be Deep and Vice Versa. Clarifying how transformational change takes place is the central theme of Bruce Ecker’s clinical career, and he has contributed many innovations in concepts and methods of experiential psychotherapy. Since 2006 he has driven the clinical field’s recognition of memory reconsolidation as the core process of transformational change and has developed the application of this brain research breakthrough to advancements in therapeutic effectiveness and psychotherapy integration. Bruce is a frequent presenter at conferences and workshops internationally, has taught extensively in clinical graduate programs, and is in private practice in New York City\nWho is Dr Tori Olds?\nTori Olds, PhD is a psychologist in private practice in Austin, Texas. She is a co-owner of Deep Eddy Psychotherapy, a counseling center housing seventeen clinicians. She specializes in working with trauma, particularly attachment trauma, and utilizing mindfulness and self-compassion as a resource for personal growth. Alongside her clinical work, she has a passion for training therapists in experiential ways of working. She leads a number of study groups and is developing 10 online courses focused on helping clinicians develop experiential skills, as well as understand human development from an evolutionary, neurobiological, and attachment lens.\nShow Notes \nMeeting Tori Olds and Bruce Ecker\n\n \tTori Olds: Clinician and leader of a training group on how to integrate experiential psychotherapies (AEDP, PACT, Somatic Experiencing)\n \tBruce Ecker: Clinician and author of “Unlocking the Emotional Brain”\n\nEmotional Learning\n\n \tEmotional learning happens much as a Pavlovian response\n \tWe often learn without awareness and become prisoners of emotional learning\n \tEmotional truths are a powerful mental model how of how the world works that we don’t often realize are there\n \tLow self-esteem works as a protective, adaptive tactic\n \tBy bringing awareness to these learnings, we can de-pathologize them (therapists can help facilitate this) and begin the disconfirmation process\n\nMemory reconsolidation\n\n \tMemory reconsolidation: the brain’s built-in, natural way of using new learning to directly update and re-encode existing old learning\n \tThis process targets emotional learning\n \tMemory reconsolidation can serve as a “unifying framework for the psychotherapy field, which has been so fragmented”\n\nTherapeutic Contexts of Memory Reconsolidation\n\n \tCoherence therapy, as well as many other different therapeutic models, can produce transformational change through memory reconsolidation\n \tThree stages: 1) Discovery 2) Integration 3) Juxtaposition\n\nResources\nPrimer on Memory Reconsolidation – PDF – READ THIS if you want more!\n\nUnlocking the Emotional Brain –– Bruce Ecker\n\nCoherence Therapy Practice Manual – Bruce Ecker\n\nDepth Oriented Brief Therapy – Bruce Ecker\n\nMemory Reconsolidation in Psychotherapy: The Neuropsychotherapist Special...",
  "enclosure": "",
  "itunes:subtitle": "Tori Olds with Deep Eddy Psychotherapy Learn to apply the advances in neuroscience to our lives in a real way – we all want to be able to do that, right? This episode delivers on that for sure – memory reconsolidation is changing how therapists practi...",
  "itunes:summary": "Memory reconsolidation brings awareness to old maps and traumatic emotional learning and gives us a clean slate to build new learning pathways.  Powerhouse clinicians Bruce Ecker & Tori Olds join co-host Sue Marriott in a discussion on the science behind this process and Coherence Theory, which brings these ideas to life.  Be sure to see the shownotes for great articles and an excellent PDF brief on the subject.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "1:00:48"
}