{
  "title": "What’s new with Google Cloud",
  "link": "https://cloud.google.com/blog/topics/inside-google-cloud/whats-new-google-cloud/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Want to know the latest from Google Cloud? Find it here in one handy location. Check back regularly for our newest updates, announcements, resources, events, learning opportunities, and more. <br/></p><hr/><p><b>Tip</b>: Not sure where to find what you’re looking for on the Google Cloud blog? Start here: <a href=\"https://cloud.google.com/blog/topics/inside-google-cloud/complete-list-google-cloud-blog-links-2021\">Google Cloud blog 101: Full list of topics, links, and resources</a>.</p><hr/></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Oct 31 - Nov 4, 2022</h3><p></p><ul><li><a href=\"https://cloud.google.com/iam/docs/deny-overview\">IAM Deny</a>, a security guardrail to help Google Cloud customers harden their security posture at scale, is now Generally Available (GA). IAM Deny policies manage access to Google Cloud resources based on principal, resource type, and permissions they're trying to use. It enables administrators to harden their cloud security posture easily and at scale.<br/></li><li>True Fit, a data-driven personalization platform built on Google Data Cloud describe their data journey to unlock Partner growth. True Fit publishes a number of BigQuery dataset for its Retail partners using Analytics Hub. Data sharing using Google Cloud has elevated True Fit’s business using real-world data in real-time. They achieved this in conjunction with the <a href=\"https://cloud.google.com/solutions/data-cloud-isvs\">Built with BigQuery</a> program from Cloud Partner Engineering. <a href=\"https://cloud.google.com/blog/products/data-analytics/how-google-cloud-bigquery-helps-true-fit-unlock-partner-growth\">Read more</a>.<br/></li><li><a href=\"https://cloud.google.com/blog/products/application-development/introducing-cloud-workstations\">Google Cloud Workstations</a> is now in public preview.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Oct 24 - Oct 28, 2022</h3><p></p><ul><li><b>Google Cloud</b> and <b>Sibros Technology</b> with their award winning Deep Connected Platform is enabling vehicle manufacturers and suppliers to reach the next level in their use of data  to gain valuable insights that should mitigate risks, reduce costs, add innovative products, drive sustainability and introduce value-added use cases services in the automotive industry. <a href=\"https://cloud.google.com/blog/products/data-analytics/powering-connected-vehicles-on-google-cloud-with-sibros-ota-platform\">Read more</a><b>.</b><br/></li><li><b>Data Exploration Workbench in Dataplex is now Generally Available</b> - it offers a Spark-powered serverless data exploration experience with one-click access to Spark SQL scripts and Jupyter notebooks. With the workbench, Data Consumers can spend more time generating insights rather than integrating different tools and platforms.<a href=\"https://cloud.google.com/blog/products/data-analytics/dataplex-provides-spark-powered-data-exploration-experience\">Learn more</a></li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Oct 17 - Oct 21, 2022</h3><p></p><ul><li><b>Google Cloud Spanner launches Lock insights and transaction insights</b> - easily troubleshoot lock contentions using pre-built dashboards. This is the 2nd milestone launch for Spanner insights. <a href=\"https://cloud.google.com/blog/products/databases/introducing-lock-insights-and-transaction-insights-for-spanner\">Learn more</a>.<br/></li><li><b>Google Cloud Migration Center is now in public preview</b>. Check out our <a href=\"https://cloud.google.com/blog/products/compute/streamline-migration-and-modernization-to-google-cloud-with-migration-center\">blog</a> for more information. <br/></li><li><b>Using Envoy to create cross-region replicas for Cloud Memorystore</b>: Learn how you can create multi-regional deployments with Cloud Memorystore by using the Envoy proxy. This <a href=\"https://cloud.google.com/blog/products/databases/creating-regional-replicas-for-cloud-memorystore-for-redis\">blog</a> provides a step by step walkthrough which demonstrates how you can adapt your existing application to serve multiple regions or failover to a secondary region in case of a regional outage. <br/></li><li>Google Cloud Logging’s Log Analytics team is hosting an external webinar to talk about Log Analytics powered by BigQuery and how our top customers have adopted them to save time and cost. Register <a href=\"https://cloudonair.withgoogle.com/events/innovators-log-analytics-and-bq\" target=\"_blank\">here</a>.<br/></li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Oct 3 - Oct 7, 2022</h3><ul><li><a href=\"https://cloud.google.com/security-command-center/docs/concepts-rapid-vulnerability-detection-overview\">Rapid Vulnerability Detection,</a> a zero configuration service in Security Command Center Premium that detects vulnerabilities like exposed admin interfaces, weak credentials, and incomplete software installations, is now available in Public Preview.</li><li>When it comes to advanced log analysis using BigQuery, Log Analytics offers a <b>simple</b>, <b>cost-effective</b> and <b>easy-to-operate</b> alternative to managing your own log export to BigQuery. Use this <a href=\"https://cloud.google.com/blog/products/data-analytics/moving-to-log-analytics-for-bigquery-export-users\">migration guide</a> to help you write or convert your SQL queries and make switching to Log Analytics easy.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Sept 26 - Sept 30, 2022</h3><ul><li><b>Google Cloud Logging launches Log Analytics powered by Big Query</b>. The feature allows Log users to use the power of BQ within Cloud Logging to perform Analytics on Logs. You can update your existing Log Buckets to start using Log Analytics. It does not require complex data pipeline configurations to ingest data. <a href=\"https://cloud.google.com/blog/products/devops-sre/introducing-cloud-loggings-log-analytics-powered-by-big-query\">Learn more</a>.<br/></li><li><a href=\"https://cloud.google.com/blog/products/data-analytics/faraday-uses-bqml-to-make-predictions-for-any-consumer-brands\">BigQuery ML enables Faraday to make predictions for any US consumer brand</a> . Faraday.ai is a Partner of Google Cloud enabling companies to unlock the patterns hidden in their data using BigQuery ML, such as increasing conversion of leads to subscribe customers via personalization, allowing scoring of leads, spend forecasting and Lon-to-value ratio identification for customers. They achieved this in conjunction with the Built with BigQuery program from Cloud Partner Engineering.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Sept 19 - Sept 23, 2022</h3><ul><li><b>Cloud Dataflow</b> - PerfKit Benchmarker (PKB) has expanded support for <b>benchmarking your own Dataflow pipelines</b>. You can now more easily test your Dataflow pipelines for performance optimization, capacity planning, regression testing and TCO estimation. Watch the <a href=\"https://2022.beamsummit.org/sessions/benchmark-pipelines/\" target=\"_blank\">Beam Summit talk and demo</a>, or <a href=\"https://cloud.google.com/blog/products/data-analytics/benchmarking-dataflow-jobs\">read the detailed walkthrough</a>.</li><li><b>Cloud Deploy</b> now supports the ability to verify your deployment. <a href=\"https://cloud.google.com/deploy/docs/release-notes#September_22_2022\">Learn More</a>.</li><li>Google Cloud Learning launches a new dedicated cloud training program to support 10,000 Ukrainian businesses and IT professionals, starting October 4, 2022. <a href=\"https://cloud.google.com/blog/topics/training-certifications/new-google-cloud-training-program-for-ukrainians\">Learn more.</a></li><li><p><a href=\"https://cloud.google.com/load-balancing\"><b>Cloud Load Balancing</b></a> <b>now supports Cross-Project Service Referencing with</b> <a href=\"https://cloud.google.com/load-balancing/docs/l7-internal#cross-project\"><b>Internal HTTP(S) Load Balancing</b></a> <b>and</b> <a href=\"https://cloud.google.com/load-balancing/docs/https#load-balancer-mode\"><b>Regional External HTTP(S) Load Balancing</b></a>. This new capability allows organizations to configure one central load balancer and route traffic to hundreds of services distributed across multiple different projects. Organizations can thus optimize the number of load balancers needed to deploy your application, and lower manageability, operational costs, and quota requirements. <a href=\"https://cloud.google.com/blog/products/networking/cloud-load-balancing-gets-cross-project-service-referencing\">Learn more</a><br/></p></li><li><p><a href=\"http://cloud.google.com/datastream-for-bigquery\"><b>Datastream</b></a> now supports direct <b>replication into BigQuery</b> in public preview. Datastream for BigQuery , leverages the new BigQuery CDC (UPSERT) Write API, making replication from operational database sources such as AlloyDB, PostgreSQL, MySQL, and Oracle, directly into BigQuery seamless. <a href=\"https://cloud.google.com/blog/products/data-analytics/introducing-seamless-database-replication-to-bigquery\">Learn more</a>.</p></li><li><p><b>Datastream</b> now supports <a href=\"https://cloud.google.com/datastream/docs/sources-postgresql\"><b>PostgreSQL as a source</b></a> in public preview.</p></li><li><b>Datastream</b> introduces <b>volume-based tiered pricing</b> that makes it more affordable for customers moving larger volumes of data. Volume-based tiered pricing will be applied automatically based on actual usage. And for the next 6 months customers will also receive 1TB/month free backfill. <a href=\"https://cloud.google.com/datastream/pricing\">Learn more</a>.</li><li><b>Google Cloud launches</b><b>the Fly Cup Challenge</b>, created in partnership with The Drone Racing League (DRL) and taking place at Next ‘22 to usher in the new era of tech-driven sports. <a href=\"https://cloud.google.com/blog/topics/training-certifications/sign-up-for-the-google-cloud-fly-cup-challenge\">Learn more.</a> <br/></li><li>Accelerate migration from self-managed object storage to Google Cloud Storage by using Storage Transfer Service. It’s designed to move 100s of TB data and offers security, simplicity, and scale-out performance out of the box. <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/accelerate-migration-self-managed-object-storage-cloud-storage\">Read the full blog</a>.</li><li>In addition to sync files from Git repositories, <b>Config Sync just brought GitOps to a next level</b> with the support of two new formats: OCI artifacts and Helm charts. <a href=\"https://cloud.google.com/blog/products/containers-kubernetes/gitops-with-oci-artifacts-and-config-sync\">Learn more</a>.</li><li><b>Cloud CDN</b> now supports <a href=\"https://cloud.google.com/cdn/docs/dynamic-compression\">dynamic compression</a> using Brotli and gzip algorithms, which can reduce data sent over the network by 60-80% for compressible content. Enabling dynamic compression can help you achieve faster page load times, speed up playback speed for video content, and optimize egress costs.<br/></li><li><b>Cloud Dataflow</b> - PerfKit Benchmarker (PKB) has expanded support for <b>benchmarking your own Dataflow pipelines</b>. You can now more easily test your Dataflow pipelines for performance optimization, capacity planning, regression testing and TCO estimation. Watch the <a href=\"https://2022.beamsummit.org/sessions/benchmark-pipelines/\" target=\"_blank\">Beam Summit talk and demo</a>, or read the detailed walkthrough here.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Sept 12 - Sept 18, 2022</h3><p></p><ul><li><p><b>Pub/Sub monitoring dashboards</b> are now part of the Pub/Sub UI in Google Cloud Console. Pub/Sub users can easily monitor the health of their real-time streaming applications by reading charts of insightful metrics. Customization on these provided charts and dashboard is also supported. <a href=\"https://cloud.google.com/blog/products/management-tools/pubsub-metrics-dashboards-offer--improved-observability\">Learn more</a>.<br/></p></li><li><p><b>Google Cloud Deploy</b> now supports application delivery to Cloud Run. <a href=\"https://cloud.google.com/deploy/docs/run-targets\">Learn More</a> </p></li><li><p><b>Artifact Registry</b> now supports store Kubeflow pipeline templates in a Kubeflow Pipelines repository. <a href=\"https://cloud.google.com/artifact-registry/docs/kfp\">Learn more</a></p></li><li><p><b>Google Cloud Deploy</b> has enabled +14 additional regions, bringing Cloud Deploy to regional support parity with Cloud Build. <a href=\"https://cloud.google.com/deploy/docs/release-notes#September_15_2022\">Learn More</a><br/></p></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Sept 5 - Sept 9, 2022</h3><p></p><ul><li>We held our biggest storage event of the year on Sept 8 where we announced a number of new product innovations including: enhanced optimization and intelligence for Cloud Storage, new Filestore capabilities, the next generation of Persistent Disk called Hyperdisk, and the unveiling of our new Google Cloud Backup and DR service. <a href=\"https://cloudonair.withgoogle.com/events/storage-spotlight\" target=\"_blank\">Watch all the sessions on demand</a> or <a href=\"https://cloud.google.com/blog/products/storage-data-transfer/learn-about-google-clouds-latest-storage-product-innovations\">read the full recap</a>.</li><li><a href=\"https://cloud.google.com/storage-transfer-service\"><b>Storage Transfer Service</b></a> now offers Preview support for moving data from <a href=\"https://cloud.google.com/storage-transfer/docs/s3-compatible\">S3-compatible storage to Cloud Storage</a>. This feature builds on recent Cloud Storage launches, namely support for <a href=\"https://cloud.google.com/storage/docs/multipart-uploads\">Multipart upload</a> and <a href=\"https://cloud.google.com/storage/docs/xml-api/get-bucket-list\">List Object V2</a>, which makes Cloud Storage suitable for running applications written for the S3 API. With this new feature, customers can seamlessly copy data from self-managed object storage to Google Cloud Storage. For customers moving data from AWS S3 to Cloud Storage, this feature provides an option to control network routes to Google Cloud, resulting in considerably lower egress charges. See <a href=\"https://cloud.google.com/storage-transfer/docs/s3-compatible\">Transfer from S3-compatible sources</a> for details.</li><li><a href=\"https://cloud.google.com/stackdriver/docs/solutions/gke/managing-metrics#control-plane-metrics\">Kubernetes control plane metrics</a> are now Generally Available for <a href=\"https://cloud.google.com/kubernetes-engine\">Google Kubernetes Engine</a>. You can now configure GKE clusters with control plane version 1.23.6-gke.1500 or later to export to <a href=\"https://cloud.google.com/monitoring\">Cloud Monitoring</a> certain metrics emitted by the Kubernetes API server, scheduler, and controller manager. These metrics are stored in Cloud Monitoring in a Prometheus-compatible format. They can be queried by sending either a PromQL or MQL query to the Cloud Monitoring API. They can also be used anywhere within Cloud Monitoring, including in custom dashboards or alerting rules.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Aug 29 - Sept 2, 2022</h3><p></p><ul><li><b>Apigee is introducing</b><b>a new</b> <a href=\"https://cloud.google.com/apigee/pricing\"><b>Pay-as-you-go</b></a> pricing model to enable customers to unlock Apigee’s API management capabilities with no upfront commitment, control their own costs and pay only for what they are use. This new pricing model is offered as a complement to the existing <a href=\"https://cloud.google.com/apigee/pricing\">Subscription</a> plans (or) the ability to evaluate it for free. <a href=\"https://cloud.google.com/blog/products/api-management/introducing-pay-as-you-go-pricing-for-apigee-api-management\">Learn more </a> <br/></li><li>The network that powers Google Cloud grows with our customers, and we are committed to providing them with the resilience and performance they need and expect. Google is investing alongside regional partners in two additional submarine cables — <a href=\"https://www.submarinenetworks.com/en/systems/intra-asia/iax/jio-moves-forward-with-iax-and-iex-projects\" target=\"_blank\">IAX</a> and<a href=\"https://services.global.ntt/en-us/newsroom/ntt-ltd-to-commence-construction-of-the-optical-submarine-cable-mist\" target=\"_blank\">MIST</a> — which will support growing demand in the APAC region. We expect these two cables to be ready for service by the end of 2023.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Aug 22 - Aug 26, 2022</h3><p></p><ul><li>Join us August 30th for the “<a href=\"https://cloudonair.withgoogle.com/events/building-cloud-app-excellence?utm_source=facebook&amp;utm_medium=social_inmail&amp;utm_campaign=FY22-Q3-global-ENTD218-onlineevent-er-b&amp;i-cloud-native-app-dev-event=&amp;utm_content=register_noram&amp;utm_term=-\" target=\"_blank\">Power your business with modern cloud apps</a>” webinar to learn strategies to leverage scalable cloud apps on Google Cloud using products like Google Kubernetes Engine, Cloud Run, Apigee, and Anthos. Don’t miss this opportunity to discover best practices for:<br/></li><ul><ul><li><p>Accelerating developer productivity</p></li><li><p>Improving business innovation</p></li><li><p>Boosting resource efficiency while ensuring security and regulatory compliance</p></li></ul></ul><li><b>Why all retailers should consider leveraging Google Cloud Retail Search</b> - Cloud Retail Search, part of <a href=\"https://cloud.google.com/solutions/retail-product-discovery\">Discovery Solutions For Retail</a> portfolio, helps retailers significantly improve the shopping experience on their digital platform with ‘Google-quality’ search. Users now expect the same robust and intuitive search features as are offered by Google.com and other popular web platforms, who seem to have the uncanny ability to intelligently interpret and yield relevant results to complex search queries. Cloud Retail Search offers advanced search capabilities such as better understanding user intent and self-learning ranking models that help retailers unlock the full potential of their online experience. <a href=\"https://cloud.google.com/blog/topics/retail/coud-retail-search-benefits\">Learn more</a>.</li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Aug 15 - Aug 19, 2022</h3><ul><li><b>Cloud SQL</b> now supports <b><i>deletion protection</i></b> for MySQL, Postgres and SQL Server instances. With the deletion protection flag, you can now protect your instance from unintended deletions. The flag is enabled by default in the Cloud Console and when enabled, delete is blocked and the flag has to be disabled before an instance can be deleted. To disable the deletion protection flag, the user must have at least Cloud SQL Editor role.With the deletion protection flag, you now have added protection that will prevent accidental or malicious deletion of databases that can create expensive outages for applications. To learn more about deletion protection refer to <a href=\"https://cloud.google.com/sql/docs/mysql/deletion-protection\">Cloud SQL documentation</a><br/></li><li><p><b>Google Cloud Deploy</b> the default Skaffold LTS version has been upgraded to 1.39.1 <a href=\"https://github.com/GoogleContainerTools/skaffold/blob/main/CHANGELOG.md#v1391-release---06282022\" target=\"_blank\">Skaffold Release notes</a>  <a href=\"https://cloud.google.com/deploy/docs/using-skaffold/select-skaffold#supported_versions\">Google Cloud Deploy Skaffold Docs</a></p></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Aug 8 - Aug 12, 2022</h3><ul><li><b>Artifact Registry</b> now supports use of organization policies that can require Customer Managed Encryption Keys (CMEK) protection and can limit which Cloud Key Management System CryptoKeys can be used for CMEK protection. <a href=\"https://cloud.google.com/artifact-registry/docs/cmek#org-policy\">Learn More</a><br/></li><li><b>Google Cloud Deploy</b> documentation has been re-formatted to make it easier to find information being sought.<a href=\"https://cloud.google.com/deploy/docs/overview\">Docs</a><br/></li><li><b>Google Cloud Deploy</b> new blog post describing many new features and benefits added over the first half of the year. <a href=\"https://cloud.google.com/blog/products/devops-sre/google-cloud-deploy-gets-continuous-delivery-productivity-enhancements\">Blog</a><br/></li><li><b>Google Cloud Deploy</b> new GUI update that surfaces information related to a target’s execution environment.  Developers can now easily find and confirm where Google Cloud Deploy render and deploy operations take place in addition to worker pool type, execution environment, service account, and artifact storage location. <a href=\"https://cloud.google.com/deploy/docs/execution-environment?_ga=2.118435465.-102204094.1660228087\">Learn More</a>  <br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Aug 1 - Aug 5, 2022</h3><ul><li><b>Bigtable-BigQuery federation is now Generally Available</b>. Query Bigtable directly from BigQuery and combine with other data sources for real-time analytical insights. No ETL required.  <a href=\"https://cloud.google.com/blog/products/data-analytics/bigtable-bigquery-federation-brings-hot--cold-data-closer\">Learn more</a><br/></li><li>Join us August 30th for the “<a href=\"https://cloudonair.withgoogle.com/events/building-cloud-app-excellence?utm_source=facebook&amp;utm_medium=social_inmail&amp;utm_campaign=FY22-Q3-global-ENTD218-onlineevent-er-b&amp;i-cloud-native-app-dev-event=&amp;utm_content=register_noram&amp;utm_term=-\" target=\"_blank\">Power your business with modern cloud apps</a>” webinar. We will be sharing best practices and strategies for how to simplify, streamline, and secure your application development using Google Cloud services like GKE, Apigee API, Anthos, and Cloud Run. <a href=\"https://cloudonair.withgoogle.com/events/building-cloud-app-excellence?utm_source=facebook&amp;utm_medium=social_inmail&amp;utm_campaign=FY22-Q3-global-ENTD218-onlineevent-er-b&amp;i-cloud-native-app-dev-event=&amp;utm_content=register_noram&amp;utm_term=-\" target=\"_blank\">Register today</a>.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of July 25 - July 29, 2022</h3><ul><li><b>Cloud Pub/Sub</b> is introducing a new type of subscription called a “<a href=\"https://cloud.google.com/pubsub/docs/bigquery\">BigQuery subscription</a>” that writes directly from Cloud Pub/Sub to BigQuery. You no longer have to write or run your own pipelines for data ingestion from Pub/Sub into BigQuery. This new extract, load, and transform (ELT) path will be able to simplify your event-driven architecture. <a href=\"https://cloud.google.com/blog/products/data-analytics/pub-sub-launches-direct-path-to-bigquery-for-streaming-analytics\">Learn more</a>.<br/></li><li>BigLake enables you to maximize the true potential of your data spread across clouds, storage formats, data lakes, and warehouses. It is now Generally available, and you can use it to build multi-cloud data lakes that work across GCP and OSS query engines, in a secure and governed manner. <a href=\"https://cloud.google.com/blog/products/data-analytics/unify-data-lakes-and-warehouses-with-biglake-now-generally-available\">Learn more</a>.<br/></li><li>Cloud Healthcare API is now available in 4 additional regions allowing customers to serve their own users faster, more reliably, and securely. The <a href=\"https://cloud.google.com/healthcare-api/docs\">Cloud Healthcare API</a> provides a managed solution for storing and accessing healthcare data in Google Cloud, providing a critical bridge between existing care systems and applications hosted on Google Cloud. <a href=\"https://cloud.google.com/healthcare-api/docs/concepts/regions\">Learn More.</a><br/></li><ul><ul><li><p>asia-southeast2 (Jakarta)</p></li><li><p>us-east1 (South Carolina) </p></li><li><p>us-west1 (Oregon)</p></li><li><p>us-west3 (Salt Lake City)</p></li></ul></ul><li><b>Cloud Deploy</b> - You can now view and compare Kubernetes and Skaffold configuration files for releases, using Google Cloud Console. <a href=\"https://cloud.google.com/deploy/docs/view-release\">Learn More</a>.</li><li><b>Cloud Deploy</b> now offers an <a href=\"https://cloud.google.com/sdk/gcloud/reference/deploy/releases/create#--from-k8s-manifest\">Easy Mode</a> option that creates a skaffold.yalm file automatically from a Kubernetes manifest.  The feature is accessed from the command line by adding <i>--from-k8s-manifest=FROM_K8S_MANIFEST</i> to the <i>gcloud deploy</i> <i>releases create</i> command. The generated skaffold.yaml is suitable for onboarding, learning, and demonstrating Google Cloud Deploy.  <a href=\"https://cloud.google.com/deploy/docs/using-skaffold/getting-started-skaffold#have_generate_your_skaffoldyaml\">Learn More</a> <br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of July 18 - July 22, 2022</h3><ul><li>Launched three major new Dataflow features to General Availability: <a href=\"https://cloud.google.com/dataflow/docs/quickstarts/create-pipeline-go\">Dataflow Go GA</a>, <a href=\"https://cloud.google.com/dataflow/docs/guides/enable-dataflow-prime\">Dataflow Prime GA, and Dataflow ML GA.</a> <br/></li><li><a href=\"https://cloudonair.withgoogle.com/events/data-engineer-spotlight?utm_source=cloud_sfdc&amp;utm_medium=email&amp;utm_campaign=FY22-Q3-global-EXPMKT30-onlineevent-er-spotlight-data-engineer-main&amp;utm_content=data-engineer-spotlight-learn-to-earn&amp;utm_term=-&amp;utm_source=cloud_sfdc&amp;utm_medium=email&amp;utm_campaign=FY22-Q3-global-EXPMKT30-onlineevent-er-spotlight-data-engineer-main&amp;utm_content=data-engineer-spotlight-newsletter&amp;utm_term=-\" target=\"_blank\">The Data Engineer Spotlight</a> is THIS WEEK! Register today to experience four technical sessions, expert speakers, a q&amp;a session, and tons of on demand content. <br/></li><li>Speed up your workflow executions by running steps concurrently! Workflows now supports parallel steps, which can reduce the overall execution time for workflows that include long-running operations like HTTP requests and callbacks. Our latest codelab shows you how to more quickly process a dataset by parallelizing multiple BigQuery jobs within a workflow. <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/introducing-parallel-steps-workflows-speed-up-workflow-executions-by-running-steps-concurrently\">Read more in our blog post.</a><br/></li><li>Google Cloud introduces <a href=\"http://cloud.google.com/batch\">Batch</a>. Batch is a fully-managed service which helps you run batch jobs easily, reliably, and at scale. Without additional software, Batch dynamically and efficiently manages resource provisioning, scheduling, queuing, and execution, freeing up time for you to focus on analyzing results. It is free, and you only pay for the resources used, but you can further reduce cost with Spot VMs and Custom Machine Types. <a href=\"https://cloud.google.com/blog/products/compute/new-batch-service-processes-batch-jobs-on-google-cloud\">Read more in the launch blog.</a> </li><li><a href=\"https://cloud.google.com/blog/products/containers-kubernetes/gke-supports-new-arm-based-tau-t2a-vms\">Run your Arm workloads on Google Kubernetes Engine (GKE) with Tau T2A VMs</a> in preview. Arm nodes come packed with key GKE features, including the ability to run using GKE Autopilot. We’ve also updated many popular Google Cloud developer tools and partnered with leading CI/CD, observability, and security ISVs to simplify running Arm workloads on GKE.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of July 11 - July 15, 2022</h3><ul><li><a href=\"https://cloud.google.com/deploy/docs/managing-delivery-pipeline#suspending_a_delivery_pipeline\"><b>Cloud Deploy</b> users can now suspend a delivery pipeline</a>. Suspending a pipeline is useful  for situations when there’s a problem with a release and you want to make sure no further actions occur. Suspended pipelines also allow teams to pause releases for a defined time period like holidays, busy seasons, etc.<br/></li><li><a href=\"https://cloud.google.com/deploy/docs/deploying-application#permanently_abandoning_a_release\"><b>Cloud Deploy</b> users can now permanently abandon a release</a>. An abandoned release has the following restrictions - it cannot be promoted, it cannot be rolled back, and it cannot be unabandoned. Some reasons to abandon a release include a serious bug or bugs in the release, a major security issue in the release, or the release includes a deprecated feature.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of July 4 - July 8, 2022</h3><ul><li><a href=\"https://cloud.google.com/kubernetes-engine/docs/concepts/node-pool-upgrade-strategies#blue-green-upgrade-strategy\"><b>Blue-green upgrade mechanism</b></a> for upgrading GKE node pools is now generally available. With blue-green upgrades, you now have more control over the upgrade process for highly available production workloads. GKE creates a new set of nodes, moves your workloads and gives you “soak” time before committing the upgrade. You can also quickly rollback in the event your workloads cannot tolerate the upgrade.<br/></li><li><a href=\"https://cloud.google.com/blog/products/databases/rewe-uses-cloud-spanner-to-optimize-for-speed-and-performance\"><b>Get a deep dive into managing traffic fluctuations with Google Cloud</b></a>. European travel group REWE explores the value of Cloud Spanner In mitigating and supporting traffic surges and optimizing the consumer experience during peak travel seasons. </li><li><a href=\"https://cloud.google.com/blog/topics/partners/differentiation-brings-great-customer-experiences\"><b>Differentiation brings great customer experiences</b></a>. Differentiation achievements help customers select a partner with confidence, knowing that Google Cloud has verified their skills and customer success across our products, horizontal solutions and key industries.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of June 27 - July 1, 2022</h3><ul><li><a href=\"https://cloud.google.com/kubernetes-engine/docs/concepts/timesharing-gpus\"><b>Time-sharing GPUs on GKE</b></a> <b>are generally available</b>. Time-sharing allows multiple containers to share a single physical GPU attached to a node. This helps achieve greater cost effectiveness by improving GPU Utilization and workload throughput.<br/></li><li>Dual-stack networking is now available (preview) for <a href=\"https://cloud.google.com/kubernetes-engine/\"><b>GKE</b></a>.  With this feature, you can now allocate dual-stack IPv4 and IPv6 addresses for Pods and nodes.  For Services, you can allocate single-stack (IPv4 only or IPv6 only) or dual-stack addresses.</li><li>View your <b>GKE</b> costs directly in <b>Cloud Billing</b>. Now in preview, you can <a href=\"https://cloud.google.com/kubernetes-engine/docs/how-to/cost-allocations\">view a detailed breakdown of cluster costs</a> directly in the Google Cloud console or the Cloud Billing export to BigQuery.  With this detailed information, you can more easily allocate the costs of your GKE clusters and workloads across different teams.</li><li><b>Cloud Deploy</b> is now available in 5 additional regions improving performance and flexibility. <a href=\"https://cloud.google.com/deploy/docs/release-notes\">Learn More</a>.<br/></li><ul><ul><li><p>asia-east2 (Hong Kong)</p></li><li><p>europe-west2 (London)</p></li><li><p>europe-west3 (Frankfurt)</p></li><li><p>us-east4 (N. Virginia)</p></li><li><p>us-west2 (Los Angeles)</p></li></ul></ul><li><b>Cloud Deploy</b> deployment of containers to Anthos user clusters using Connect gateway is now generally available. <a href=\"https://cloud.google.com/deploy/docs/anthos-targets\">Learn more</a>.</li><li><a href=\"https://cloud.google.com/blog/products/databases/diagnose-query-performance-issues-with-cloud-spanner-query-insights\">Launched Query Insights for Cloud Spanner</a> - a new visualization tool for visualizing Query performance metrics and debugging Query Performance issues  in the Cloud console! <br/></li><li>Now in preview, BigQuery BI Engine <a href=\"https://cloud.google.com/bigquery/docs/bi-engine-preferred-tables\">Preferred Tables</a>. Preferred tables enable BigQuery customers to prioritize specific tables for acceleration by BI Engine to ensure predictable performance and optimized use of resources. Read our <a href=\"https://cloud.google.com/blog/products/data-analytics/now-in-preview-bigquery-bi-engine-preferred-tables\">blog</a> to learn more.<br/></li><li>MITRE ATT&amp;CK® mappings for Google Cloud security capabilities through our research partnership with the MITRE Engenuity Center for Threat-Informed Defense. <a href=\"https://cloud.google.com/blog/products/identity-security/announcing-mitre-attck-mappings-released-for-google-cloud-security-capabilities\">Learn more</a>.<br/></li><li>Launched a new way of accessing billing information — from the <a href=\"https://cloud.google.com/console-app\">Cloud Console mobile app</a>. Now, with your <a href=\"https://play.google.com/store/apps/details?id=com.google.android.apps.cloudconsole\" target=\"_blank\">Android</a> or <a href=\"https://itunes.apple.com/us/app/google-cloud-console/id1005120814?mt=8#iTunes\" target=\"_blank\">iOS</a> mobile device, you can access not only your resources (App Engine, Compute, Databases, Storage or IAM), logs, incidents, errors, but also your billing information. With these enhanced billing features, we are making it easier for you to understand your cloud spend. <br/></li><li><a href=\"https://cloud.google.com/eventarc/docs\">Eventarc</a> adds support for Firebase Realtime Database. Now you can create Eventarc triggers to send <a href=\"https://cloud.google.com/eventarc/docs/reference/supported-events#directly-from-a-google-cloud-source\">Firebase Realtime Database events</a> to your favorite <a href=\"https://cloud.google.com/eventarc/docs/overview#targets\">destinations</a> that Eventarc supports. </li><li>PostgreSQL interface for Cloud Spanner is generally available. The PostgreSQL interface for Spanner combines the scalability and reliability of Spanner that enterprises trust with the familiarity and portability of PostgreSQL that development teams love. Devops teams that have scaled their databases with brittle sharding or complex replication can now simplify their architecture with Spanner, using the tools and skills they already have. Get started today, for as low as $65 USD/month. <a href=\"https://cloud.google.com/blog/products/databases/postgresql-interface-for-spanner-now-ga\">Learn more</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of June 20 - June 24, 2022</h3><ul><li><p>Read the latest <a href=\"https://cloud.google.com/blog/products/data-analytics/google-cloud-data-hero-series-meet-francisco\">Cloud Data Hero Story</a>. This edition focuses on Francisco, the founder of Direcly, a Google Cloud partner. Francisco immigrated from Quito, Ecuador and founded his company from the ground up, without any external funding. Now, he’s finding innovative ways to leverage Google Cloud’s products for companies like Royal Caribbean International.<br/></p></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of June 13 - June 17, 2022</h3><ul><li><p>Launched higher reservation limits for <a href=\"https://cloud.google.com/bigquery/docs/bi-engine-intro\">BigQuery BI Engine</a>. BigQuery BI Engine now supports a default maximum reservation of 250GB per project for all customers. Previously this was at 100GB. You can still request additional BI Engine reservations for your projects <a href=\"https://docs.google.com/forms/d/1KX2E2ggOy1eUNB0Hjf9l9l0Sm0TbmPuS0XvyZtdnRes/viewform?edit_requested=true&amp;resourcekey=0-0kdy5aXFdgZqOJbjewQrNQ\" target=\"_blank\">here</a>. This is being rolled out in the Google Cloud Console over the next few days to all customers. Alternatively, all customers can already use DDL statement as follows </p></li><ul><li><p><code>ALTER BI_CAPACITY `&lt;PROJECT_ID&gt;.region-&lt;REGION&gt;.default` SET OPTIONS(size_gb = 250);</code></p></li></ul><li>Don’t miss our first ever <b>Google Cloud Sustainability Summit</b> on June 28, 2022. Learn how business and technology leaders are building for the future, and get insights to help you enact sustainable change within your organization. At this digital event, you’ll have a chance to explore the latest tools and best practices that can help you solve your most complex challenges. And you’ll be among the first to find out about product updates across Google Cloud, Earth Engine, and Google Workspace. <a href=\"https://cloudonair.withgoogle.com/events/summit-sustainability-2022?utm_source=cgc-blog&amp;utm_medium=blog&amp;utm_campaign=FY22-Q2-global-EXPMKT13-onlineevent-er-sustainability-summit-2022-main&amp;utm_content=whats_new_blog&amp;utm_term=-\" target=\"_blank\">Register today for this no-cost, solution-packed event</a>.</li><li>On <b>June 14, 2022</b>, we are unveiling the winners of this year’s <a href=\"https://cloud.google.com/awards\">Google Cloud Customer Awards.</a>We received an unprecedented number of entries and every participant can be proud of what their organization is achieving in the cloud today. The second annual Google Cloud Customer Awards celebrates organizations around the world who have continued to flex and adapt to new demands, while turning new ideas into interesting realities. <a href=\"https://cloud.google.com/blog/products/gcp/celebrating-the-winners-of-google-cloud-customer-awards\">Read our blog</a> to check out the results.</li><li>The <a href=\"https://cloud.google.com/blog/topics/training-certifications/cloud-digital-leader-curriculum-is-now-available-for-faculty\">Cloud Digital Leader track</a> is now part of the Google Cloud career readiness program, available for eligible faculty preparing their students for a cloud-first workforce. Students will build cloud literacy and learn the value of Google Cloud in driving digital transformation while also preparing for the Cloud Digital Leader certification exam. <a href=\"https://cloud.google.com/edu/career-readiness\">Learn more.</a></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of June 6 - June 10, 2022</h3><ul><li>Artifact Registry - <a href=\"https://cloud.google.com/artifact-registry/docs/audit-logging\">Audit logs</a> for Maven, npm, and Python repositories are now available in Cloud Logging. <a href=\"https://cloud.google.com/artifact-registry/docs/audit-logging\">Documentation</a><br/></li><li><b>Cloud Deploy New Region</b> - Cloud Deploy is now available in the australia-southeast1 (Syndey) region. <a href=\"https://cloud.google.com/deploy/docs/release-notes\">Release Notes</a></li><li><b>Cloud Deploy Terraform provider support</b>. Cloud Deploy declarative resources, Delivery Pipeline and Target, are now available via the Google Cloud Deploy Terraform Provider. <a href=\"https://registry.terraform.io/providers/hashicorp/google/latest/docs/resources/clouddeploy_delivery_pipeline\" target=\"_blank\">Documentation</a></li><li><b>Anthos on VMware user cluster lifecycle from the Google Cloud Console is</b><b>in GA now.</b> You will now be able to create, delete, update, and see Anthos on VMware user clusters from the Google Cloud Console. To learn more about the feature, check out  the Anthos<a href=\"https://cloud.google.com/anthos/clusters/docs/on-prem/latest/how-to/create-user-cluster-api\">documentation</a>.</li><li><b>Granular instance sizing for Cloud Spanner is now generally available</b>. Get started for as low as $40 per month and take advantage of 99.999% availability and scale as needed without downtime. With granular instance sizing, at a much lower cost you can still get all of the Spanner benefits like transparent replication across zones and regions, high-availability, resilience to different types of failures, and the ability to scale up and down as needed without any downtime.  <a href=\"https://cloud.google.com/blog/products/databases/use-spanner-at-low-cost-with-granular-instance-sizing\">Learn more</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of May 30 - June 3, 2022</h3><ul><li>Google Cloud Deploy support for Skaffold version 1.37.1 has been updated to version 1.37.2, which is now the default Skaffold version. (<a href=\"https://github.com/GoogleContainerTools/skaffold/blob/main/CHANGELOG.md\" target=\"_blank\">Skaffold Docs</a>)<br/></li><li>Google Cloud just made it easier to compare the cost of modernization options. Want to look at Lift &amp; Shift vs. Containerization options? The latest version of our fit assessment now includes cost guidance. See the <a href=\"https://cloud.google.com/migrate/containers/docs/fit-assessment#updates_for_version_1113\">release notes</a> for more details.<br/></li><li>Did you notice the new “Protect” tab in Google Kubernetes Engine? Protect for GKE automatically scans, identifies and suggests fixes for workload configuration risks by comparing your running workload config against industry best practices like the Kubernetes Pod Security Standards. Check out the <a href=\"https://cloud.google.com/kubernetes-engine/docs/how-to/protect-workload-configuration\">documentation</a> to learn more.<br/></li><li>Google Cloud makes data warehouse migrations even easier with automated SQL translation as part of the BigQuery Migration Service. <a href=\"https://cloud.google.com/blog/products/databases/cloud-sql-alerting\">Learn more.</a></li><li>Google Cloud simplifies customer verification and benefits processing with <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/google-cloud-extends-document-ai-with-new-parsers-for-identity\">Document AI for Identity cards now generally available</a>. Automate identity verification and fraud detection workflows by extracting information from identity cards with a high degree of accuracy. <a href=\"https://cloud.google.com/solutions/identity-doc-ai\">Learn more.</a></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of May 23 - May 27, 2022</h3><ul><li>Artifact Registry now is available in more regions. Artifact Registry is now available in the following regions - europe-west9 (Paris, France), europe-southwest1 (Madrid, Spain), and us-east5 Columbus, United States). <a href=\"https://cloud.google.com/artifact-registry/docs/release-notes\">Release Notes</a> </li><li><b>Change streams for Cloud Spanner</b> is now generally available.With change streams, Spanner users are now able to track and stream out changes (inserts, updates, and deletes) from their Cloud Spanner database in near real-time. <a href=\"https://cloud.google.com/blog/products/spanner/change-streams-for-cloud-spanner-now-generally-available\">Learn more.</a></li><li>Artifact Registry now supports new repository types. <a href=\"https://cloud.google.com/artifact-registry/docs/os-packages/debian\">Apt</a> and <a href=\"https://cloud.google.com/artifact-registry/docs/os-packages/rpm\">Yum</a> repositories are now generally available. <a href=\"https://cloud.google.com/artifact-registry/docs/release-notes\">Release Notes</a><br/></li><li>Business Messages announces expansion of its partner ecosystem to include<a href=\"https://www.twilio.com/go/google-business-messaging-request-access-1\" target=\"_blank\"><b>Twilio</b></a>, <a href=\"https://www.genesys.com/genesys-cloud\" target=\"_blank\"><b>Genesys</b></a>, and <a href=\"https://www.avaya.com/en/products/ccaas/\" target=\"_blank\"><b>Avaya</b></a> - each widely recognized global platforms for customer care and communications. <a href=\"https://cloud.google.com/blog/topics/retail/business-messages-find-a-messaging-partner-and-get-started-today\">Read</a> how they help businesses implement both AI Bot and Live Agent chat solutions to stay open for conversations and advance customers through the purchase funnel. And be sure to check out the new <a href=\"https://businessmessages.google/partners\" target=\"_blank\">Business Messages partner directory</a>!<br/></li><li>Learn how to set up metrics and alerts to monitor errors in Cloud SQL for SQL Server error log using Google Cloud’s Operation Suite with this <a href=\"https://cloud.google.com/blog/products/databases/cloud-sql-alerting\">blog post</a>. <br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of May 16 - May 20, 2022</h3><ul><li>Machine learning is among the most exciting, fastest-moving technology disciplines. Join us June 9th for <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/google-cloud-applied-ml-summit-2022\">Google Cloud Applied ML Summit</a>, a digital event that brings together some of the world’s leading ML and data science professionals to explore the latest cutting-edge AI tools for developing, deploying, and managing ML models at scale. <br/></li><li><b><b>Join us virtually on June 2nd</b> </b>at the <a href=\"https://cloudonair.withgoogle.com/events/summit-startup-2022?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY22-Q2-global-EXPMKT9-onlineevent-er-startup-summit-2022-main&amp;utm_content=blog&amp;utm_term=-\" target=\"_blank\">Google Cloud Startup Summit</a> where you’ll hear the latest announcements about how we’re investing in and supporting the startup ecosystem. You'll also learn from technology experts about streamlining your app development and creating better user experiences, and get insights from innovative venture capitalists and founders to help your startup grow. This event is headlined by our keynote with Google Cloud CEO <a href=\"https://www.linkedin.com/in/thomas-kurian-469b6219/\" target=\"_blank\">Thomas Kurian</a> and Dapper Labs Co-Founder and CEO <a href=\"https://www.linkedin.com/in/roham/\" target=\"_blank\">Roham Gharegozlou</a> as they discuss the paradigm changes being brought by web3 and how startups can prepare for this shift.<br/></li><li><b>Google Cloud Managed Service for Prometheus</b> introduced a new <a href=\"https://cloud.google.com/blog/products/devops-sre/managed-service-for-prometheus-offers-new-pricing-tier\">high-usage pricing tier</a>to bring more value for Kubernetes users who want to move all of their metrics operations to the service, and dropped the pricing for existing tiers by 25 percent.</li><li><a href=\"https://cloud.google.com/blog/products/devops-sre/maisons-du-monde-improved-their-kubernetes-observability\"><b>Hear from the SRE team</b></a><b>at Maisons du Monde</b> detail their journey from building open source Prometheus to deciding that Managed Service for Prometheus was the best fit for their organization.</li><li><b>Google Cloud has launched Autonomic Security Operations (ASO)</b> for the U.S. public sector, a solution to modernize threat management, in line with the objectives of the White House Executive Order 14028 and Office of Management and Budget M-21-31. ASO is a transformational approach to security operations, powered by our Chronicle and Siemplify, to comprehensively detect and respond to cyber telemetry across an agency while meeting the Event Logging Tier requirements of the EO.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of May 9 - May 13, 2022</h3><ul><li>We just published a <a href=\"https://cloud.google.com/blog/topics/financial-services/optimizing-google-cloud-for-high-speed-market-tick-history-analysis\">blog post</a> announcing the latest Google Cloud’s STAC-M3™ benchmark results. Following up on our <a href=\"https://cloud.google.com/blog/products/compute/can-cloud-instances-perform-better-than-bare-metal-latest-stac-m3-benchmarks-say-yes\">2018 STAC-M3 benchmark audit</a>, a redesigned Google Cloud architecture achieved significant improvements: Up to 18x faster, Up to 9x higher throughput, and <b>new record</b> in STAC-M3.ß1.1T.YRHIBID-2.TIME. We also published a <a href=\"https://services.google.com/fh/files/misc/optimizing_google_cloud_for_high_speed_market_tick_history_analysis.pdf\" target=\"_blank\">whitepaper</a> on how we designed and optimized the cluster for API-driven cloud resources.<br/></li><li><a href=\"https://cloud.google.com/security-command-center\">Security Command Center (SCC)</a> released new finding types that alert customers when SCC is either misconfigured or configured in a way that prevents it from operating as expected. These findings provide remediation steps to return SCC to an operational state. <a href=\"https://cloud.google.com/security-command-center/docs/how-to-remediate-scc-errors\">Learn more and see examples</a>.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of May 2 - May 6, 2022</h3><ul><li>As part of Anthos release 1.11, Anthos Clusters on Azure and Anthos Clusters on AWS now support Kubernetes versions 1.22.8-gke.200 and 1.21.11-gke.100. As a preview feature, you can now choose Windows as your node pool image type when you create node pools with Kubernetes version 1.22.8. For more information, check out the <a href=\"https://cloud.google.com/anthos/clusters/docs/multi-cloud\">Anthos multi cloud website</a>.</li><li>The <a href=\"https://cloud.google.com/blog/topics/startups/google-cloud-future-of-data-whitepaper\">Google Cloud Future of Data whitepaper</a> explores why the future of data will involve three key themes: unified, flexible, and accessible.<br/></li><li><a href=\"https://cloud.google.com/blog/products/data-analytics/bigquery-bi-engine-generally-available\">Learn about BigQuery BI Engine</a> and how to analyze large and complex datasets interactively with sub-second query response time and high concurrency. Now generally available.<br/></li><li>Announcing the launch of the second series of the <a href=\"https://cloud.google.com/blog/topics/startups/introducing-the-build-series\">Google Cloud Technical Guides for Startups</a>, a video series for technical enablement aimed at helping startups to start, build and grow their businesses.<br/></li><li><a href=\"https://cloud.google.com/blog/products/data-analytics/solving-for-food-waste-with-data-analytics-in-google-cloud\">Solving for food waste with data analytics in Google Cloud</a>. Explore why it is so necessary as a retailer to bring your data to the cloud to apply analytics to minimize food waste.<br/></li><li>Mosquitoes get the swat with new Mosquito Forecast built by OFF! Insect Repellents and Google Cloud. <a href=\"https://cloud.google.com/blog/products/data-analytics/sc-johnson-forecasts-mosquitoes-with-google-earth-engine\">Read how SC Johnson built an app</a> that predicts mosquito outbreaks in your area.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of April 25 - April 29, 2022</h3><ul><li><p>We're excited to announce the <a href=\"https://cloud.google.com/blog/products/networking/introducing-media-cdn\">general availability of Media CDN</a> — a content and media distribution platform with unparalleled scale.</p></li><li><p><a href=\"https://cloud.google.com/blog/topics/consumer-packaged-goods/data-shows-shoppers-prioritizing-sustainability-and-values\">New Google Cloud research</a> shows shoppers are paying closer attention to the values of consumer goods brands and care more about eco-friendly products.</p></li><li><p><a href=\"https://cloud.google.com/blog/transform/cloud-breathes-new-life-into-electronic-health-records\">Meditech’s cloud EHR</a> gives clinicians time back with patients helping them make better decisions and diagnoses.</p></li><li><p>Cloud is supercharging 5G development, transforming every industry along the way. <a href=\"https://cloud.google.com/blog/transform/5g-and-cloud-technology-for-cios\">How 5G and Cloud will change every industry</a>, including yours.</p></li><li><p><a href=\"https://cloud.google.com/blog/transform/googles-area-120-incubator-shares-5-lessons-on-innovation-at-scale\">Google’s Area 120 incubator shares 5 lessons</a> on sustaining innovation at scale.</p></li><li><p><a href=\"https://cloud.google.com/blog/topics/financial-services/introducing-swift-on-google-cloud\">Introducing SWIFT on Google Cloud</a> - modernize your payments by bringing it to the cloud.</p></li><li><p>Advance your technical skills and boost your career by getting hands-on practice with <a href=\"https://cloud.google.com/blog/topics/training-certifications/how-to-build-job-ready-cloud-skills\">Google Cloud projects</a>.</p></li><li><p>Discover how the <a href=\"https://cloud.google.com/blog/products/workspace/benefits-of-google-workspace-administrator-certification\">Google Workspace Administrator role</a> has evolved and why certification training is vital for this in-demand position.</p></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of April 18 - April 22, 2022 </h3><ul><li><b><a href=\"https://cloud.google.com/blog/topics/inside-google-cloud/meet-the-people-of-google-cloud-jim-hogan\">Meet the people of Google Cloud</a></b>: Jim Hogan, an autistic Googler talks advocacy and inclusion and how it relates to his job as an innovation strategist.<br/></li><li><b>Announcing the Climate Innovation Challenge</b>—grants to provide scientists with Google Cloud research credits, so they can better address our urgent climate challenge. <a href=\"https://cloud.google.com/blog/topics/sustainability/climate-innovation-challenge-provides-google-cloud-credits\">Read more</a>.<br/></li><li><b>Our first-ever Google Workspace Summit</b>: Get the latest on the keynote, breakout sessions, and product innovations for our first-ever Google Workspace Summit on May 4, 2022. <a href=\"https://cloud.google.com/blog/products/workspace/discover-new-ways-of-working-at-the-google-workspace-summit\">Here are 9 sessions you don't want to miss</a>.<br/></li><li>Climate scientists rely on cloud-based tools like Google Earth Engine to detect changes, map trends, and quantify differences on the Earth's surface. <a href=\"https://cloud.google.com/blog/topics/sustainability/how-natural-resources-canada-uses-google-earth-engine\">Read how Natural Resources Canada uses Google Earth Engine</a>.<br/></li><li>Urban Outfitter’s rental business, Nuuly, shows how being cloud-first also means being sustainability-first, with the agility and insights going green requires. <a href=\"https://cloud.google.com/blog/topics/transformation/cloud-native-sustainability-native-green-retail-rentals-nuuly-urban-outfitters\">Read how technology is weaving sustainability into the future of retail at Nuuly</a>.<br/></li><li><b>Clean energy projects begin to power Google data centers</b>. <a href=\"https://cloud.google.com/blog/topics/sustainability/clean-energy-projects-begin-to-power-google-data-centers\">Read about investments Google has made</a> toward clean energy projects to power and protect our global data centers are coming online around the world.<br/></li><li><b>The Cloud Engineer Learning Path</b> is an effective way to prepare for the Associate Cloud Engineer certification and launch your new cloud career. <a href=\"https://cloud.google.com/blog/topics/training-certifications/preparing-for-the-associate-cloud-engineer-certification\">Here's how to prepare for Google’s Associate Cloud Engineer exam</a>.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of April 11 - April 15, 2022 </h3><ul><li><b>Machine learning company Moloco uses Cloud Bigtable to process 5+ million ad bid requests per second</b>. <a href=\"https://cloud.google.com/blog/products/databases/moloco-uses-cloud-bigtable-to-build-their-ad-tech-platform\">Learn how</a> Moloco uses Bigtable to keep up in a speedy market and process ad requests at unmatched speed and scale.<br/></li><li><b>The Broad Institute of MIT and Harvard speeds scientific research with Cloud SQL</b>. One of our customers, the Broad Institute, shares how they used Cloud SQL to accelerate scientific research. In this customer story, you will <a href=\"https://cloud.google.com/blog/products/databases/broad-institute-speeds-scientific-research-with-cloud-sql\">learn how</a> the Broad Institute was able to get Google’s database services up and running quickly and lower their operational burden by using Cloud SQL. <br/></li><li><b>Data Cloud Summit ‘22 recap blog on April 12</b>: Didn’t get a chance to watch the Google Data Cloud Summit this year? <a href=\"https://cloud.google.com/blog/products/data-analytics/top-5-things-to-catch-up-on-from-data-cloud-summit-2022\">Check out our recap to learn the top five takeaways</a> - learn more about product announcements, customer speakers, partners, product demos and check out more resources on your favorite topics. <br/></li><li><b>The new Professional Cloud Database Engineer certification in beta is here</b>. By participating in this beta, you will directly influence and enhance the learning and career path for Cloud Database Engineers globally. <a href=\"https://cloud.google.com/blog/products/databases/google-cloud-announces-a-new-certification-for-database-engineers\">Learn more and sign up today</a>. <br/></li><li><a href=\"https://cloud.google.com/kubernetes-engine/docs/tutorials/batch-ml-workload\">Learn how</a> to use Kubernetes Jobs and cost-optimized Spot VMs to run and manage fault-tolerant AI/ML batch workloads on Google Kubernetes Engine.</li><li><b>Expanding Eventarc presence to 4 new regions</b>—asia-south2, australia-southeast2, northamerica-northeast2, southamerica-west1. You can now create Eventarc resources in <a href=\"https://cloud.google.com/eventarc/docs/locations\">30 regions</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of April 4 - April 8, 2022 </h3><ul><li>Join us at the <b>Google Data Cloud Summit</b> on Wednesday, April 6, at 9 AM PDT.  Learn how Google Cloud technologies across AI, machine learning, analytics, and databases have helped organizations such as <b>Exabeam</b>, <b>Deutsche Bank</b>, and <b>PayPal</b> to break down silos, increase agility, derive more value from data, and innovate faster. <a href=\"https://cloudonair.withgoogle.com/events/summit-data-cloud-2022?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY22-Q2-global-EXPMKT10-onlineevent-er-data-cloud-2022-main&amp;utm_content=data_cloud_summit_blog_promo&amp;utm_term=-\" target=\"_blank\"><b>Register today</b> for this no cost digital event.</a></li><li><b>Announcing the first Data Partner Spotlight, on May 11th </b><br/>We saved you a seat at the table to learn about the Data Cloud Partners in the Google Cloud ecosystem. We will spotlight technology partners, and deep dive into their solutions, so business leaders can make smarter decisions, and solve complex data challenges with Google Cloud. <a href=\"https://cloudonair.withgoogle.com/events/data-partner-spotlight?utm_source=cloud_sfdc&amp;utm_medium=email&amp;utm_campaign=FY22-Q2-northam-NTHM58-onlineevent-er-data-partner-spotlight&amp;utm_content=datasummit&amp;utm_term=-\" target=\"_blank\">Register today</a> for this digital event<br/></li><li><b>Introducing</b> <a href=\"https://cloud.google.com/vertex-ai/docs/model-registry\"><b>Vertex AI Model Registry</b></a>, a central repository to manage and govern the lifecycle of your ML models. Designed to work with any type of model and deployment target, including BigQuery ML, Vertex AI Model Registry makes it easy to manage and deploy models. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/new-features-for-google-clouds-unified-data-and-ai-platform\">Learn more</a> about Google’s unified data and AI offering.</li><li><a href=\"https://cloud.google.com/vertex-ai-workbench\"><b>Vertex AI Workbench</b></a><b>is now GA</b>, bringing together Google Cloud’s data and ML systems into a single interface so that teams have a common toolset across data analytics, data science, and machine learning. With native integrations across BigQuery, Spark, Dataproc, and Dataplex data scientists can build, train and deploy ML models 5X faster than traditional notebooks. Don’t miss this <a href=\"https://cloudonair.withgoogle.com/events/summit-data-cloud-2022?talk=t2_s6_aiml_notebooks\" target=\"_blank\">‘How to’ session</a> from the Data Cloud Summit.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Mar 28 - April 1, 2022</h3><p></p><ul><li><a href=\"https://cloud.google.com/blog/products/networking/modernizing-private-wires-for-voice-trading-with-the-cloud\">Learn how</a> Google Cloud’s network and Network Connectivity Center can transform the private wires used for voice trading.<br/></li><li><a href=\"https://cloud.google.com/anthos/clusters/docs/bare-metal/latest/concepts/about-bare-metal#toc-update\"><b>Anthos bare metal 1.11</b></a> <b>minor release is available now</b>. Containerd is the default runtime in Anthos clusters on bare metal in this release.  Examples of the feature enhancements are as below:<br/></li><ul><ul><li><p>Upgraded Anthos clusters on bare metal to use Kubernetes version 1.22;</p></li><li><p>Added<a href=\"https://cloud.google.com/anthos/clusters/docs/bare-metal/1.8/how-to/egress-nat\">Egress Network Address Translation</a> (NAT) gateway capability to provide persistent, deterministic routing for egress traffic from clusters</p></li><li><p>Enabled IPv4/IPv6 dual-stack support</p></li><li><p>Additional enhancements in the release can be found in the the release note  <a href=\"https://cloud.google.com/anthos/clusters/docs/bare-metal/latest/release-notes-1.11\">here</a></p></li></ul></ul></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Mar 21 - Mar 25, 2022</h3><p></p><ul><li>Google Cloud’s Behnaz Kibria reflects on a recent fireside chat that she moderated with Google Cloud’s Phil Moyer and former SEC Commissioner, Troy Paredes at FIA Boca. The discussion focused on the future of markets and policy, the new technologies that are already paving the way for greater speed and transparency, and what it will take to ensure greater resiliency, performance and security over the longer term. <a href=\"https://cloud.google.com/blog/topics/financial-services/building-the-financial-markets-foundation-for-the-future\">Read the blog.</a><br/></li><li><a href=\"https://cloud.google.com/eventarc/docs\"><b>Eventarc</b></a> <b>adds support for Firebase Alerts</b>. Now you can create <a href=\"https://cloud.google.com/eventarc/docs/targets\">Eventarc triggers</a> to send Firebase Alerts events to your favorite <a href=\"https://cloud.google.com/eventarc/docs/overview#targets\">destinations</a> that Eventarc supports. <br/></li><li><p>Now you can control how your alerts handle missing data from telemetry data streams using Alert Policies in the <a href=\"https://cloud.google.com/monitoring/alerts/concepts-indepth#partial-metric-data\">Cloud Console</a> or via <a href=\"https://cloud.google.com/monitoring/api/ref_v3/rest/v3/projects.alertPolicies#metricthreshold\">API</a>. In cloud ecosystems there are millions of data sources, and often, there are pauses or breaks in their telemetry data streams. Configure how this missing data influences your open incidents:</p></li><ul><li><p>Option 1: Missing data is treated as “above the threshold”- and your incidents will stay open.</p></li><li><p>Option 2: missing data is evaluated as “below the threshold” and the incident will close after your retest window period.</p></li></ul></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Mar 14 - Mar 18, 2022</h3><p></p><ul><li><b>Natural language processing is a critical AI tool</b> for understanding unstructured, often technical healthcare information, like clinical notes and lab reports. <a href=\"https://cloud.google.com/blog/topics/healthcare-life-sciences/natural-language-processing-nlp-healthcare-insights-clinical-research-data-cloud\">See how</a> leading healthcare organizations are exploring NLP to unlock hidden value in their data.<br/></li><li><b>A handheld lab</b>: <a href=\"https://cloud.google.com/blog/topics/healthcare-life-sciences/cue-health-covid-tests-revolutionizing-healthcare-diagnostics\">Read how</a> Cue Health is revolutionizing healthcare diagnostics for COVID-19 and beyond—all from the comfort of home.<br/></li><li>Providing reliable technical support for an increasingly distributed, hybrid workforce is becoming all the more crucial, and challenging. <a href=\"https://cloud.google.com/blog/products/gcp/customer-care-portfolio-flexible-scalable-robust-support\" target=\"_blank\">Cloud Customer Care has added a range of new offerings and features</a> for businesses of all sizes to help you find the Google Cloud technical support services that are best for your needs and budget.</li><li><b>#GoogleforGames Dev Summit is NOW LIVE</b>. Watch the keynote followed by over 20 product sessions on-demand to help you build high quality games and reach audiences around the world. Watch → <a href=\"http://g.co/gamedevsummit\" target=\"_blank\">g.co/gamedevsummit</a></li><li>Meeting (and ideally, exceeding) consumer expectations today is often a heavy lift for many companies—especially those running modern apps on legacy, on-premises databases. Read how Google Cloud database services provide you the best options for industry-leading reliability, global scale &amp; open standards, enabling you to make your next big idea a reality. <a href=\"https://cloud.google.com/blog/products/databases/industry-leading-reliability-global-scale-open-standards-google-cloud-databases\">Read this blog</a>.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Mar 07 - Mar 11, 2022</h3><p></p><ul><li><a href=\"https://cloud.google.com/blog/topics/partners/google-cloud-partner-advantage-for-retail-and-ecommerce\">Learn how</a> Google Cloud Partner Advantage partners help customers solve real-world business challenges in retail and ecommerce through data insights.<br/></li><li>Introducing <a href=\"https://github.com/GoogleCloudPlatform/security-analytics\" target=\"_blank\"><b>Community Security Analytics</b></a>, an open-source repository of queries for self-service security analytics. Get started analyzing your own Google Cloud logs with BigQuery or Chronicle to <b>detect</b> potential threats to your workloads, and to <b>audit</b> usage of your data. <a href=\"https://cloud.google.com/blog/products/identity-security/introducing-community-security-analytics\">Learn more</a>.</li><li>On a mission to accelerate the world's adoption of a modern approach to threat management through <b>Autonomic Security Operations</b>, our latest update expands our ASO technology stack with Siemplify, offers a solution to the latest <b>White House Executive Order 14028</b>, introduces a community-based security analytics repository, and announces key R&amp;D initiatives that we’re investing in to bolster threat-informed defenses worldwide. Read more <a href=\"https://cloud.google.com/blog/products/identity-security/new-resources-to-advance-your-autonomic-security-operations-modernization-journey\">here</a>! </li><li><b>Account defender, available today in public preview</b>, is a feature in reCAPTCHA Enterprise that takes behavioral detection a step further. It analyzes the patterns of behavior for an individual account, in addition to the patterns of behavior of all user accounts associated with your website. <a href=\"https://cloud.google.com/blog/products/identity-security/use-account-defender-in-recaptcha-enterprise-to-protect-accounts\">Read more here</a>.</li><li><b>Maximize your Cloud Spanner savings</b> with new <a href=\"https://cloud.google.com/blog/products/databases/spanner-committed-use-discounts-help-reduce-costs\"><b>committed use discounts</b>.</a> Get up to 40% discount on Spanner compute capacity by purchasing committed use discounts. Once you make a commitment to spend a certain amount on an hourly basis on Spanner from a billing account, you can get discounts on instances in different instance configurations, regions, and projects associated with that billing account. This flexibility helps you achieve a high utilization rate of your commitment across regions and projects without manual intervention, saving you time and money. <a href=\"https://cloud.google.com/blog/products/databases/spanner-committed-use-discounts-help-reduce-costs\">Learn more.</a> </li><li>In many places across the globe, March is celebrated as Women’s History Month, and March 8th, specifically, marks the day known around the world as International Women’s Day. <b>Google Cloud, in partnership with Women Techmakers</b>, has created an opportunity to bridge the gaps in the credentialing space by offering a certification journey for Ambassadors of the Women Techmakers community. <a href=\"https://cloud.google.com/blog/topics/training-certifications/google-cloud-and-women-techmakers-exclusive\">Learn more</a>.<br/></li><li><a href=\"https://cloud.google.com/blog/products/compliance/trpm-providers-speed-vendor-due-diligence-for-google-cloud\">Learn how</a> to <b>accelerate vendor due diligence on Google Cloud</b> by leveraging third party risk management providers.<br/></li><li>Hybrid work should not derail DEI efforts. If you’re moving to a hybrid work model, <a href=\"https://cloud.google.com/blog/topics/transformation/hybrid-work-should-not-derail-dei-efforts\">here’s how</a> to make diversity, equity and inclusion central to it.<br/></li><li><a href=\"https://cloud.google.com/blog/products/data-analytics/cloud-data-fusion-helps-consolidate-sap-and-non-sap-datasets\">Learn how</a> <b>Cloud Data Fusion provides scalable data integration pipelines</b> to help consolidate a customer’s SAP and non-SAP datasets within BigQuery.<br/></li>Hong Kong–based startup <b>TecPal builds and manages smart hardware and software for household appliances</b> all over the world using Google Cloud. <a href=\"https://cloud.google.com/blog/topics/startups/tecpal-builds-and-manages-smart-appliances-with-google-cloud\">Find out how</a>.<li><a href=\"https://cloud.google.com/eventarc/docs\"><b>Eventarc</b></a> <b>adds support for Firebase Remote Config and Test Lab in preview</b>. Now you can create <a href=\"https://cloud.google.com/eventarc/docs/targets\">Eventarc triggers</a> to send Firebase Remote Config or Firebase Test Lab events to your favorite <a href=\"https://cloud.google.com/eventarc/docs/overview#targets\">destinations</a> that Eventarc supports. </li><li><a href=\"https://cloud.google.com/service-mesh/docs/observability/explore-dashboard\"><b>Anthos Service Mesh Dashboard</b></a> <b>is now available (public preview)</b> on the <a href=\"https://cloud.google.com/anthos/clusters/docs/bare-metal/latest\">Anthos clusters on Bare Metal</a>and <a href=\"https://cloud.google.com/anthos/clusters/docs/on-prem/1.10\">Anthos clusters on VMware</a> . Customers can now get out-of-the-box telemetry dashboards to see a services-first view of their application on the Cloud Console.</li><li>Micro Focus Enterprise Server Google Cloud blueprint performs an automated deployment of Enterprise Server inside a new VPC or existing VPC. <a href=\"https://cloud.google.com/blog/topics/partners/micro-focus-enterprise-server-google-cloud-blueprint\">Learn more.</a><br/></li><li><a href=\"https://cloud.google.com/blog/products/devops-sre/google-cloud-logging-java-client-library-new-features\">Learn how</a> to wire your application logs with more information without adding a single line of code and get more insights with the new version of the Java library.<br/></li><li><a href=\"https://cloud.google.com/blog/products/sap-google-cloud/pacemaker-alerts-in-google-cloud\">Pacemaker Alerts in Google Cloud</a>cluster alerting enables the system administrator to be notified about critical events of the enterprise workloads in GCP like the SAP solutions.<br/></li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Feb 28 - Mar 04, 2022</h3><p></p><ul><li><b>Announcing the Data Cloud Summit, April 6th!</b>—Ready to dive deep into data? Join us at the <b>Google Data Cloud Summit</b> on Wednesday, April 6, at 9 AM PDT. This three-hour digital event is packed with content and experiences designed to help you unlock innovation in your organization. Learn how Google Cloud technologies across AI, machine learning, analytics, and databases have helped organizations such as <b>Exabeam</b>, <b>Deutsche Bank</b>, and <b>PayPal</b> to break down silos, increase agility, derive more value from data, and innovate faster. <a href=\"https://cloudonair.withgoogle.com/events/summit-data-cloud-2022?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY22-Q2-global-EXPMKT10-onlineevent-er-data-cloud-2022-main&amp;utm_content=data_cloud_summit_blog_promo&amp;utm_term=-\" target=\"_blank\"><b>Register today</b> for this no cost digital event.</a><br/></li><li>Google Cloud addresses concerns about how its customers might be impacted by the invasion of Ukraine. <a href=\"https://cloud.google.com/blog/products/identity-security/how-google-cloud-is-helping-those-affected-by-war-in-ukraine\">Read more</a>.<br/></li><li><a href=\"https://cloud.google.com/eventarc/docs\"><b>Eventarc</b></a> <b>is now HIPAA compliant</b>— Eventarc is covered under the Google Cloud Business Associate Agreement (BAA), meaning it has achieved HIPAA compliance. Healthcare and life sciences organizations can now use Eventarc to send events that require HIPAA compliance.<br/></li><li><a href=\"https://cloud.google.com/eventarc/docs/workflows/create-triggers\">Eventarc trigger for Workflows</a> is now available in <a href=\"https://cloud.google.com/products#product-launch-stages\">Preview</a>. You can now select Workflows as a destination to events originating from <a href=\"https://cloud.google.com/eventarc/docs/reference/supported-events\" target=\"_blank\">any supported event provider</a><br/></li><li><a href=\"https://cloud.google.com/blog/products/devops-sre/application-exceptions-surfaced-automatically\"><b>Error Reporting</b></a> automatically captures exceptions found in logs ingested by Cloud Logging from the following languages: Go, Java, Node.js, PHP, Python, Ruby, and .NET, aggregates them, and then notifies you of their existence.</li><li><a href=\"https://cloud.google.com/blog/products/ai-machine-learning/usaa-and-google-cloud-transform-insurance-operations\">Learn more</a>about how <b>USAA partnered with Google Cloud</b> to transform their operations by leveraging AI to drive efficiency in vehicle insurance claims estimation.<br/></li><li><a href=\"https://cloud.google.com/blog/topics/hpc/accelerate-cloud-eda-workflows-with-netapp-and-google-cloud\"><b>Learn how</b></a> <b>Google Cloud and NetApp’s ability to “burst to cloud”</b>, seamlessly spinning up compute and storage on demand accelerates EDA design testing.<br/></li><li>Google Cloud CISO Phil Venables <a href=\"https://cloud.google.com/blog/products/identity-security/cloud-ciso-perspectives-february-2022\">shares his thoughts</a> on the latest security updates from the Google Cybersecurity Action Team. <br/></li><li>Google Cloud Easy as Pie Hackathon, the <a href=\"https://cloud.google.com/blog/products/serverless/serverless-hackathon-winners-announced\">results are in</a>.<br/></li><li><a href=\"https://cloud.google.com/vpc/docs/org-policy-flow-logs\">VPC Flow Logs Org Policy Constraints</a> allow users to enforce VPC Flow Logs enablement across their organization, and impose minimum and maximum sampling rates. VPC Flow Logs are used to understand network traffic for troubleshooting, optimization and compliance purposes. <br/></li><li><a href=\"https://cloud.google.com/blog/products/devops-sre/easy-managed-prometheus-metrics-service-for-kubernetes\"><b>Google Cloud Managed Service for Prometheus</b></a> is now <b>generally available</b>. Get all of the benefits of open source-compatible monitoring with the ease of use of Google-scale managed services. <br/></li><li><a href=\"https://cloud.google.com/deploy/docs/anthos-targets\">Google Cloud Deploy now supports Anthos clusters</a> bringing opinionated, fully managed continuous delivery for hybrid and multicloud workloads. Cloud Deploy provides integrated best practices, security, and metrics from a centralized control plane.</li><li><a href=\"https://cloud.google.com/blog/products/workspace/enabling-frontline-workers-in-asia-pacific\">Learn Google Workspace’s vision for frontline workers</a> and how our Frontline solution innovations can bridge collaboration and productivity across workforce in-office and remote.<br/></li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Feb 21 - Feb 25, 2022</h3><p></p><ul><li><a href=\"https://cloud.google.com/blog/topics/startups/improving-payment-experiences-for-restaurants-and-guests\">Read how</a> Paerpay promotes bigger tabs and faster, more pleasant transactions with Google Cloud  and the Google for Startups Cloud Program.<br/></li><li><a href=\"https://cloud.google.com/blog/products/gcp/four-ways-google-cloud-marketplace-simplifies-buying-cloud-software\">Learn about</a> the advancements we’ve released for our Google Cloud Marketplace customers and partners in the last few months.</li><li>BBVA collaborated with Google Cloud to create one of the most successful Google Cloud training programs for employees to date. <a href=\"https://cloud.google.com/blog/topics/financial-services/the-story-behind-bbvas-successful-google-cloud-training-program\">Read how they did it</a>. </li><li><b>Google for Games Developer Summit returns March 15 at 9AM PT!</b> Learn about our latest games solutions and product innovations. It’s online and open to all. Check out the full agenda <a href=\"http://g.co/gamedevsummit\" target=\"_blank\">g.co/gamedevsummit</a> <br/></li><li><b>Build a data mesh on Google Cloud with Dataplex</b> (now GA 🎉). <a href=\"https://cloud.google.com/blog/products/data-analytics/build-a-data-mesh-on-google-cloud-with-dataplex-now-generally-available\">Read how</a> Dataplex enables customers to centrally manage, monitor, and govern distributed data, and makes it securely accessible to a variety of analytics and data science tools.</li><li>While understanding what is happening now has great business value, forward-thinking companies like Tyson Foods are taking things a step further, using real-time analytics integrated with artificial intelligence (AI) and business intelligence (BI) to answer the question, “<a href=\"https://cloud.google.com/blog/topics/consumer-packaged-goods/tyson-foods-embraces-aibi-analytics-to-enable-predictive-insights\"><b>what might happen in the future?</b></a>”<br/></li><li><a href=\"https://cloudonair.withgoogle.com/events/security-talks-march-2022?utm_source=cgc-blog&amp;utm_medium=blog&amp;utm_campaign=FY22-Q1-northam-NTHM32-onlineevent-er-nfpm_security_talks_march_22_registration&amp;utm_content=blog&amp;utm_term=-\" target=\"_blank\">Join us</a> for the first <b>Google Cloud Security Talks of 2022</b>, happening <b>on March 9th</b>. Modernizing SecOps is a top priority for so many organizations. Register to attend and learn how you can enhance your approach to threat detection, investigation and response!<br/></li><li><a href=\"https://cloud.google.com/blog/products/data-analytics/google-cloud-data-hero-series-meet-lynn\"><b>Google Cloud introduces their Data Hero series</b></a> with a profile on Lynn Langit, a data cloud architect, educator, and developer on GCP.<br/></li><li>Building ML solutions? <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/guidelines-for-developing-quality-ml-solutions\"><b>Check out these guidelines</b></a> for ensuring quality in each process of the MLOps lifecycle.<br/></li><li><a href=\"https://cloud.google.com/eventarc/docs\">Eventarc</a> is now <a href=\"https://cloud.google.com/security/compliance/pci-dss\">Payment Card Industry Data Security Standard (PCI DSS)-compliant</a>.<br/></li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Feb 14 - Feb 18, 2022</h3><p></p><ul><li>The Google Cloud <b><a href=\"https://inthecloud.withgoogle.com/retail-digital-pulse-apac-22/dl-cd.html\" target=\"_blank\">Retail Digital Pulse-Asia Pacific</a></b>is an ongoing annual assessment carried out in partnership with IDC Retail Insights to understand the maturity of retail digital transformation in the Asia Pacific Region. The study covers 1304 retailers across eight markets &amp; sub-segments to investigate their digital maturity across five dimensions - strategy, people, data , technology and process to arrive at a 4-stage Digital Pulse Index, with 4 being the most mature. It provides great insights in various stages of digital maturity of asian retailers, their drivers for digitisation, challenges, innovation hotspots and the focus areas with respect to use cases and technologies.<br/></li><li><b>Deploying Cloud Memorystore for Redis for any scale</b>: Learn how you can scale Cloud Memorystore for high volume use cases by leveraging client-side sharding. This blog provides a step by step walkthrough which demonstrates how you can adapt your existing application to scale to the highest levels with the help of the Envoy Proxy. <a href=\"https://cloud.google.com/blog/products/databases/scaling-google-cloud-memorystore-for-high-performance\">Read our blog to learn more.</a><br/></li><li><a href=\"https://cloud.google.com/blog/products/data-analytics/transformative-data-insights-for-sap-customers-with-bigquery\">Check out</a> how six SAP customers are driving value with BigQuery.<br/></li><li>This Black History Month, we're highlighting Black-led startups using Google Cloud to grow their businesses. <a href=\"https://cloud.google.com/blog/topics/startups/doss-makes-home-buying-and-selling-smarter-with-digital-real-estate-marketplace\">Check out</a> how DOSS and its co-founder, Bobby Bryant, disrupts the real estate industry with voice search tech and analytics on Google Cloud.<br/></li><li>Vimeo leverages managed database services from Google Cloud to serve up billions of views around the world each day. <a href=\"https://cloud.google.com/blog/products/databases/vimeo-powers-video-platform-with-google-cloud-databases\">Read how</a> it uses Cloud Spanner to deliver a consistent and reliable experience to its users no matter where they are.<br/></li><li>How can serverless best be leveraged? Can cloud credits be maximized? Are all managed services equal? <a href=\"https://cloud.google.com/blog/topics/startups/think-serverless-tips-for-early-stage-startups\">We dive into top questions for startups</a>. <br/></li><li><b><a href=\"https://cloud.google.com/blog/topics/sustainability/reduce-your-cloud-carbon-footprint-with-active-assist\">Google introduces Sustainability value pillar in GCP Active Assist solution</a></b>to accelerate our industry leadership in Co2 reduction and environmental protection efforts. Intelligent carbon footprint reduction tool is launched in preview. <br/></li><li><b>Central States health insurance CIO Pat Moroney</b> shares highs and lows from his career transforming IT. <a href=\"https://cloud.google.com/blog/topics/transformation/central-states-cio-pat-moroney-joins-great-resignation\">Read more</a><br/></li><li><b>Traffic Director client authorization for proxyless gRPC services</b> is now generally available. Combine with managed mTLS credentials in GKE to centrally manage access between workloads using Traffic Director. <a href=\"https://cloud.google.com/blog/products/networking/client-authorization-with-grpc-and-traffic-director\">Read more</a>.<br/></li><li><b>Cloud Functions (2nd gen) is now in public preview</b>. The next generation of our Cloud Functions Functions-as-a-Service platform gives you more features, control, performance, scalability and events sources. <a href=\"https://cloud.google.com/blog/products/serverless/introducing-the-next-generation-of-cloud-functions\">Learn more</a>.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Feb 7 - Feb 11, 2022</h3><p></p><ul><li>Now announcing the <b>general availability</b> of the newest instance series in our Compute Optimized family, <b>C2D—powered by 3rd Gen AMD EPYC processors</b>. <a href=\"https://cloud.google.com/blog/products/compute/introducing-compute-optimized-vms-on-amd-epyc-milan\">Read how</a> C2D provides larger instance types, and memory per core configurations ideal for customers with performance-intensive workloads.</li><li>Digital health startup expands its impact on healthcare equity and diversity with Google Cloud Platform and the Google for <b>Startups Accelerator for Black Founders</b>. <a href=\"https://cloud.google.com/blog/topics/startups/acclinate-advances-equity-and-diversity-in-clinical-trials\">Rear more</a>.<br/></li><li><b>Storage Transfer Service</b> support for <a href=\"https://cloud.google.com/storage-transfer/docs/on-prem-agent-pools\">agent pools</a> is now generally available (<a href=\"https://cloud.google.com/products/#product-launch-stages\">GA</a>) . You can use agent pools to create isolated groups of agents as a source or sink entity in a transfer job. This enables you to transfer data from multiple data centers and filesystems concurrently, without creating multiple projects for a large transfer spanning multiple filesystems and data centers. This option is available via <a href=\"https://cloud.google.com/storage-transfer/docs/on-prem-agent-pools#create-pool\">API</a>, <a href=\"https://cloud.google.com/storage-transfer/docs/on-prem-agent-pools#create-pool\">Console</a>, and <a href=\"https://cloud.google.com/storage-transfer/docs/on-prem-agent-pools#create-pool\">gcloud transfer CLI</a>.</li><li>The <a href=\"https://cloud.google.com/blog/topics/healthcare-life-sciences/healthcare-industry-trends-2022-life-sciences-technology-predictions-data-ai-interoperability\"><b>five trends driving healthcare and life sciences in 2022</b></a> will be powered by accessible data, AI, and partnerships.<br/></li><li><a href=\"https://cloud.google.com/blog/products/databases/minna-bank-colopl-and-7-eleven-japan-build-apps-on-spanner\">Learn how</a> <b>COLOPL, Minna Bank and 7-Eleven Japan</b> use Cloud Spanner to solve their scalability, performance and digital transformation challenges.<br/></li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Jan 31 - Feb 4, 2022</h3><p></p><ul><li><p><b>Pub/Sub Lite goes regional</b>. Pub/Sub Lite is a high-volume messaging service with ultra-low cost that now offers regional Lite topics, in addition to existing zonal Lite topics. Unlike zonal topics which are located in a single zone, regional topics are asynchronously replicated across two zones. Multi-zone replication protects from zonal failures in the service. Read about it <a href=\"https://cloud.google.com/blog/products/data-analytics/pub-sub-lite-offers-higher-availability-with-regional-topics\">here</a>.<br/></p></li><li><p>Google Workspace is making it easy for employees to bring modern collaboration to work, even if their organizations are still using legacy tools. <b>Essentials Starter</b> is a no-cost offer designed to help people bring the apps they know and love to use in their personal lives to their work life. <a href=\"https://cloud.google.com/blog/products/workspace/unlock-collaboration-with-google-workspace-essentials\">Learn more</a>.<br/></p></li><li><p><b>We’re now offering 30 days free access to role-based Google Cloud training</b> with interactive labs and opportunities to earn skill badges to demonstrate your cloud knowledge. <a href=\"https://cloud.google.com/blog/topics/training-certifications/access-role-based-google-cloud-training-free-of-charge\">Learn more</a>. <br/></p></li><li><p><b>Security Command Center</b> (SCC) Premium adds support for additional compliance benchmarks, including <a href=\"https://cloud.google.com/security-command-center/docs/release-notes#January_26_2022\">CIS Google Cloud Computing Foundations 1.2</a> and <a href=\"https://cloud.google.com/security-command-center/docs/concepts-web-security-scanner-overview#detectors_and_compliance\">OWASP Top 10 2017 &amp; 2021</a>. <a href=\"https://cloud.google.com/security-command-center/docs/concepts-vulnerabilities-findings#cis-benchmarks\">Learn more</a> about how SCC helps manage and improve your cloud security posture.</p></li><li><b>Storage Transfer Service</b> now offers Preview support transfers from self-managed object storage systems via user-managed agents. With this new feature, customers can seamlessly copy PBs of data from cloud or on-premise object storage to Google Cloud Storage. Object Storage sources must be compatible with Amazon S3 APIs. For customers migrating from AWS S3 to GCS, this feature gives an option to control network routes to Google Cloud. Fill this <a href=\"https://forms.gle/2w82pCnX24KkBNA96\" target=\"_blank\">signup form</a> to access this STS feature.</li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Jan 24-Jan 28, 2022</h3><ul><a href=\"https://cloud.google.com/blog/products/databases/sabre-powers-the-travel-industry-with-google-cloud\"></a><a href=\"https://cloud.google.com/blog/products/databases/sabre-powers-the-travel-industry-with-google-cloud\"></a><a href=\"https://cloud.google.com/blog/products/databases/sabre-powers-the-travel-industry-with-google-cloud\"></a><li><a href=\"https://cloud.google.com/blog/products/databases/sabre-powers-the-travel-industry-with-google-cloud\"></a><a href=\"https://cloud.google.com/blog/products/databases/sabre-powers-the-travel-industry-with-google-cloud\"></a><a href=\"https://cloud.google.com/blog/products/databases/sabre-powers-the-travel-industry-with-google-cloud\"></a><a href=\"https://cloud.google.com/blog/products/databases/sabre-powers-the-travel-industry-with-google-cloud\"></a><a href=\"https://cloud.google.com/blog/products/databases/sabre-powers-the-travel-industry-with-google-cloud\">Learn how</a> <b>Sabre leveraged a 10-year partnership with Google Cloud</b> to power the travel industry with innovative technology. As Sabre embarked on a cloud transformation, it sought managed database services from Google Cloud that enabled low latency and improved consistency. Sabre discovered how the strengths of both Cloud Spanner and Bigtable supported unique use cases and led to high performance solutions.</li></ul><p></p><ul><li><b>Storage Transfer Service now offers Preview</b> support for moving data between two filesystems and keeping them in sync on a periodic schedule. This launch offers a managed way to migrate from a self-managed filesystem to <a href=\"https://cloud.google.com/filestore\">Filestore</a>. If you have on-premises systems generating massive amounts of data that needs to be processed in Google Cloud, you can now use Storage Transfer Service to accelerate data transfer from an on-prem filesystem to a cloud filesystem. See <a href=\"https://cloud.google.com/storage-transfer/docs/file-to-file\">Transfer data between POSIX file systems</a> for details.</li><li><b>Storage Transfer Service</b> now offers Preview support for preserving POSIX attributes and symlinks when transferring to, from, and between POSIX filesystems. Attributes include the user ID of the owner, the group ID of the owning group, the mode or permissions, the modification time, and the size of the file. See <a href=\"https://cloud.google.com/storage-transfer/docs/metadata-preservation#posix\">Metadata preservation</a> for details.<br/></li><li><b>Bigtable Autoscaling is Generally Available</b> (GA): Bigtable Autoscaling automatically adds or removes capacity in response to the changing demand for your applications. With autoscaling, you only pay for what you need and you can spend more time on your business instead of managing infrastructure.  <a href=\"https://cloud.google.com/blog/products/databases/cloud-bigtable-now-even-easier-to-manage-with-autoscaling\">Learn more</a>.<br/></li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Jan 17-Jan 21, 2022</h3><ul><li><b>Sprinklr and Google Cloud join forces</b> to help enterprises reimagine their customer experience management strategies. <a href=\"https://cloud.google.com/blog/topics/partners/sprinklr-and-google-cloud-join-forces\">Hear more</a> from Nirav Sheth, Nirav Sheth, Director of ISV/Marketplace &amp; Partner Sales.<br/></li><li><b>Firestore Key Visualizer is Generally Available (GA)</b>: Firestore Key Visualizer is an interactive, performance monitoring tool that helps customers observe and maximize Firestore’s  performance. <a href=\"https://cloud.google.com/firestore/docs/key-visualizer\">Learn more</a>.<br/></li><li>Like many organizations, Wayfair faced the challenge of deciding which cloud databases they should migrate to in order to modernize their business and operations. Ultimately, they chose Cloud SQL and Cloud Spanner because of the databases’ clear path for shifting workloads as well as the flexibility they both provide. <a href=\"https://cloud.google.com/blog/products/databases/wayfair-migrates-to-cloud-sql-and-cloud-spanner\">Learn how</a> Wayfair was able to migrate quickly while still being able to serve production traffic at scale.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Jan 10-Jan 14, 2022</h3><ul><li><b>Start your 2022 New Year’s resolutions by learning at no cost how to use Google Cloud</b>. <a href=\"https://cloud.google.com/blog/topics/training-certifications/start-2022-with-free-training-on-how-to-use-google-cloud\" target=\"_blank\">Read more</a> to find how to take advantage of these training opportunities. <br/></li><li><b>8 megatrends drive cloud adoption—and improve security for all</b>. Google Cloud CISO Phil Venables explains the eight major megatrends powering cloud adoption, and why they’ll continue to make the cloud more secure than on-prem for the foreseeable future. <a href=\"https://cloud.google.com/blog/products/identity-security/8-megatrends-drive-cloud-adoption-and-improve-security-for-all\">Read more</a>.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Jan 3-Jan 7, 2022</h3><ul><li><b>Google Transfer Appliance announces General Availability of online mode</b>. Customers collecting data at edge locations (e.g. cameras, cars, sensors) can offload to Transfer Appliance and stream that data to a Cloud Storage bucket. <a href=\"https://cloud.google.com/transfer-appliance/docs/4.0/online-transfer\">Online mode can be toggled</a> to send the data to Cloud Storage over the network, or offline by shipping the appliance. Customers can monitor their online transfers for appliances from <a href=\"http://console.cloud.google.com/transfer/hta/jobs\">Cloud Console</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Dec 27-Dec 31, 2021</h3><ul><li><p>The most-read blogs about <b>Google Cloud compute, networking, storage and physical infrastructure in 2021</b>. <a href=\"https://cloud.google.com/blog/products/infrastructure/top-google-cloud-infrastructure-blogs-of-2021\">Read more</a>.</p></li><li><p><a href=\"https://cloud.google.com/blog/products/containers-kubernetes/top-google-cloud-managed-container-blogs-of-2021\">Top Google Cloud managed container blogs of 2021</a>.</p></li><li><p><b>Four cloud security trends</b> that organizations and practitioners should be planning for in 2022—and what they should do about them. <a href=\"https://cloud.google.com/blog/products/identity-security/four-security-trends-for-2022-and-what-to-do-about-them\">Read more</a>.</p></li><li><p>Google Cloud announces the <b>top data analytics stories from 2021</b> including the top three trends and lessons they learned from customers this year. <a href=\"https://cloud.google.com/blog/products/data-analytics/top-trends-in-data-analytics-from-customer-stories\">Read more</a>.</p></li><li><p>Explore <b>Google Cloud’s Contact Center AI (CCAI)</b> and its <b>momentum in 2021</b>. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/google-cloud-contact-center-ai-2021-highlights\">Read more</a>.</p></li><li><p>An overview of the <b>innovations that Google Workspace delivered in 2021 for Google Meet</b>. <a href=\"https://cloud.google.com/blog/products/workspace/year-of-accelerated-innovation-for-google-meet-in-2021\">Read more</a>.</p></li><li><p>Google Cloud’s <b>top artificial intelligence and machine learning posts from 2021</b>. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/google-cloud-ai-2021-highlights\">Read more</a>.</p></li><li><p>How we’ve helped <b>break down silos, unearth the value of data, and apply that data</b> to solve big problems. <a href=\"https://cloud.google.com/blog/products/data-analytics/biggest-moments-for-google-clouds-unified-data-cloud-2021\">Read more</a>.</p></li><li><p>A recap of the <b>year’s infrastructure progress</b>, from impressive Tau VMs, to industry-leading storage capabilities, to major networking leaps. <a href=\"https://cloud.google.com/blog/products/compute/improvements-to-google-cloud-infrastructure-in-2021\">Read more</a>.</p></li><li><p>Google Cloud CISO <b>Phil Venables</b> shares his thoughts on the latest security updates from the Google Cybersecurity Action Team. <a href=\"https://cloud.google.com/blog/products/identity-security/cloud-ciso-perspectives-december-2021\">Read more</a>.</p></li><li><p>Google Cloud - <b>A cloud built for developers</b> — 2021 year in review. <a href=\"https://cloud.google.com/blog/products/application-development/a-cloud-built-for-developers-2021-year-in-review\">Read more</a>.</p></li><li><p><b>API management continued to grow</b> in importance in 2021, and Apigee continued to innovate capabilities for customers, new solutions, and partnerships. <a href=\"https://cloud.google.com/blog/products/api-management/apigee-2021-a-year-of-innovations\">Read more</a>.</p></li><li>Recapping Google’s progress in 2021 toward running on <b>24/7 carbon-free energy by 2030</b> — and decarbonizing the electricity system as a whole. <a href=\"https://cloud.google.com/blog/topics/sustainability/the-year-in-carbon-free-energy-at-google\">Read more</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Dec 20-Dec 24, 2021</h3><p></p><ul><li>And that’s a wrap! After engaging in countless <a href=\"https://bit.ly/3s4ynZo\" target=\"_blank\">customer interviews</a>, we’re sharing our top 3 lessons learned from our data customers in 2021. Learn what customer data journeys inspired our top picks and what made the cut <a href=\"https://cloud.google.com/blog/products/data-analytics/top-trends-in-data-analytics-from-customer-stories\">here.</a></li><li><b>Cloud SQL now shows you minor version information</b>. For more information, see our <a href=\"https://cloud.google.com/sql/docs/db-versions\">documentation</a>.<br/></li><li><b>Cloud SQL for MySQL now allows you to select your MySQL 8.0 minor version when creating an instance and upgrade MySQL 8.0 minor version</b>. For more information, see our <a href=\"https://cloud.google.com/sql/docs/mysql/upgrade-minor-db-version\">documentation</a>.<br/></li><li><b>Cloud SQL for MySQL now supports database auditing</b>. Database auditing lets you track specific user actions in the database, such as table updates, read queries, user privilege grants, and others. To learn more, see <a href=\"https://cloud.google.com/sql/docs/mysql/db-audit\">MySQL database auditing</a>.</li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Dec 12-Dec 17, 2021</h3><p></p><ul><li><b>A CRITICAL VULNERABILITY</b> in a widely used logging library, Apache’s Log4j, has become a global security incident. Security researchers around the globe warn that this could have serious repercussions. Two Google Cloud Blog posts describe how <a href=\"https://cloud.google.com/blog/products/identity-security/cloud-armor-waf-rule-to-help-address-apache-log4j-vulnerability\">Cloud Armor</a>and <a href=\"https://cloud.google.com/blog/products/identity-security/cloud-ids-to-help-detect-cve-2021-44228-apache-log4j-vulnerability\">Cloud IDS</a> both help mitigate the threat.<br/></li><li><b>Take advantage of these ten no-cost trainings before 2022</b>. Check them out <a href=\"https://gweb-cloudblog-publish.appspot.com/topics/training-certifications/free-google-cloud-training-to-take-before-2022/\">here</a>.</li><li><b>Deploy Task Queues alongside your Cloud Application</b>: Cloud Tasks is now available in 23 GCP Regions worldwide. <a href=\"https://cloud.google.com/blog/products/serverless/deploy-cloud-tasks-queues-in-multiple-gcp-regions\">Read more</a>.</li><li><b>Managed Anthos Service Mesh support for GKE Autopilot (Preview)</b>: <a href=\"https://cloud.google.com/kubernetes-engine/docs/concepts/autopilot-overview\">GKE Autopilot</a> with Managed ASM provides ease of use and simplified administration capabilities, allowing customers to focus on their application, not the infrastructure. Customers can now let Google handle the upgrade and lifecycle tasks for both the cluster and the service mesh. <a href=\"https://cloud.google.com/service-mesh/docs/managed/asmcli-experimental\">Configure Managed ASM with asmcli experiment in GKE Autopilot cluster</a>. <br/></li><li><a href=\"https://cloud.google.com/blog/products/identity-security/unblock-bce-users-for-easy-zero-trust-access\"><b>Policy Troubleshooter for BeyondCorp Enterprise</b></a> <b>is now generally available!</b> Using this feature, admins can triage access failure events and perform the necessary actions to unblock users quickly. Learn more by <a href=\"https://cloudonair.withgoogle.com/events/security-talks-december-2021?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=fy21-q4-noram-smb950-onlineevent-er-securitytalks_dec&amp;utm_content=blog\" target=\"_blank\">registering</a> for <a href=\"https://cloud.google.com/blog/products/identity-security/google-cloud-security-talks-event-focused-on-zero-trust-and-beyondcorp\">Google Cloud Security Talks on December 15 and attending the BeyondCorp Enterprise session.</a> The event is free to attend and sessions will be available on-demand.<br/></li><li><b>Google Cloud Security Talks, Zero Trust Edition</b>: This week, we hosted our final <a href=\"https://cloud.google.com/blog/products/identity-security/google-cloud-zero-trust-security-talks-available-on-demand\">Google Cloud Security Talks event of the year,</a> focused on all things zero trust. Google pioneered the implementation of zero trust in the enterprise over a decade ago with our BeyondCorp effort, and we continue to lead the way, applying this approach to most aspects of our operations. Check out our digital sessions <a href=\"https://cloudonair.withgoogle.com/events/security-talks-december-2021\" target=\"_blank\">on-demand</a> to hear the latest updates on Google’s vision for a zero trust future and how you can leverage our capabilities to protect your organization in today’s challenging threat environment.<br/></li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Dec 6-Dec 10, 2021</h3><ul><li><b>5 key metrics to measure cloud FinOps impact in 2022 and beyond</b> - Learn about the 5 key metrics to effectively measure the impact of Cloud FinOps across your organization and leverage the metrics to gain insights, prioritize on strategic goals, and drive enterprise-wide adoption. <a href=\"https://cloud.google.com/blog/topics/cloud-first/key-metrics-to-measure-impact-of-cloud-finops\">Learn more</a></li><li>We announced <b>Cloud IDS, our new network security offering, is now generally available</b>. Cloud IDS, built with Palo Alto Networks’ technologies, delivers easy-to-use, cloud-native, managed, network-based threat detection with  industry-leading breadth and security efficacy. To learn more, and request a 30 day trial credit, see the <a href=\"http://cloud.google.com/ids\">Cloud IDS webpage</a>.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Nov 29-Dec 3, 2021</h3><ul><li><p><b>Join Cloud Learn, happening from Dec. 8-9</b>: This interactive learning event will have live technical demos, Q&amp;As, career development workshops, and more covering everything from Google Cloud fundamentals to certification prep. <a href=\"https://cloud.google.com/blog/topics/training-certifications/cloud-learn-provides-no-cost-training-for-developers-and-more\">Learn more</a>.<br/></p></li><li><p><b>Get a deep dive into BigQuery Administrator Hub</b>– With BigQuery Administrator Hub you can better manage BigQuery at scale with Resource Charts and Slot Estimator Administrators. Learn more about these tools and just how easy they are to use<a href=\"https://cloud.google.com/blog/products/data-analytics/bigquery-administrator-hub-helps-manage-bigquery-at-scale\">here.</a><br/></p></li><li><p><b>New data and AI in Media blog</b> - How data and AI can help media companies better personalize; and what to watch out for. We interviewed Googlers, Gloria Lee, Executive Account Director of Media &amp; Entertainment, and John Abel, Technical Director for the Office of the CTO, to share exclusive insights on how media organizations should think about and ways to make the most out of their data in the new era of direct-to-consumer. Watch our <a href=\"https://youtu.be/J-rAA3EKazI\" target=\"_blank\">video interview</a> with Gloria and John and <a href=\"https://cloud.google.com/blog/products/media-entertainment/how-data-and-ai-can-help-media-companies-better-personalize\">read more</a>.</p></li><li><p><b>Datastream is now generally available (GA)</b>: <a href=\"http://cloud.google.com/datastream\">Datastream</a>, a serverless change data capture (CDC) and replication service, allows you to synchronize data across heterogeneous databases, storage systems, and applications reliably and with minimal latency to support real-time analytics, database replication, and event-driven architectures. Datastream currently supports CDC ingestion from Oracle and MySQL to Cloud Storage, with additional sources and destinations coming in the future. Datastream integrates with Dataflow and Cloud Data Fusion to deliver real time replication to a wide range of destinations, including BigQuery, Cloud Spanner and Cloud SQL. <a href=\"https://cloud.google.com/blog/products/data-analytics/serverless-change-data-capture-and-replication\">Learn more</a>.</p></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Nov 22 - Nov 26, 2021</h3><p></p><ul><li><b>Security Command Center (SCC) launches new mute findings capability</b>: We’re excited to announce a new “Mute Findings” capability in SCC that helps you gain operational efficiencies by effectively managing the findings volume based on your organization’s policies and requirements. SCC presents potential security risks in your cloud environment as ‘findings’ across misconfigurations, vulnerabilities, and threats. With the launch of ‘mute findings’ capability, you gain a way to reduce findings volume and focus on the security issues that are highly relevant to you and your organization. To learn more, read this <a href=\"https://cloud.google.com/blog/products/identity-security/announcing-mute-findings-capability-security-command-center\">blog post</a> and watch this<a href=\"https://www.youtube.com/watch?v=LASZxcNl5x4\" target=\"_blank\">short demo video</a>.</li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Nov 15 - Nov 19, 2021</h3><ul><li><p><a href=\"https://cloud.google.com/spanner\">Cloud Spanner</a> is our distributed, globally scalable SQL database service that decouples compute from storage, which makes it possible to scale processing resources separately from storage. This means that horizontal upscaling is possible with no downtime for achieving higher performance on dimensions such as operations per second for both reads and writes. The distributed scaling nature of Spanner’s architecture makes it an ideal solution for unpredictable workloads such as online games. <a href=\"https://cloud.google.com/blog/products/databases/how-spanner-makes-multiplayer-game-development-easier\">Learn how</a> you can get started developing global multiplayer games using Spanner.<br/></p></li><li><p><b>New Dataflow templates for Elasticsearch released</b>to help customers process and export Google Cloud data into their Elastic Cloud. You can now push data from Pub/Sub, Cloud Storage or BigQuery into your Elasticsearch deployments in a cloud-native fashion. <a href=\"https://cloud.google.com/blog/products/data-analytics/export-google-cloud-data-into-elasticsearch-with-dataflow-templates\">Read more</a> for a deep dive on how to set up a Dataflow streaming pipeline to collect and export your Cloud Audit logs into Elasticsearch, and analyze them in Kibana UI.</p></li><li><p>We’re excited to announce the public preview of <a href=\"http://cloud.google.com/managed-prometheus\">Google Cloud Managed Service for Prometheus</a>, a new monitoring offering designed for scale and ease of use that maintains compatibility with the open-source Prometheus ecosystem. While <a href=\"http://prometheus.io\" target=\"_blank\">Prometheus</a> works well for many basic deployments, managing Prometheus can become challenging at enterprise scale. Learn more about the service in <a href=\"https://cloud.google.com/blog/products/operations/introducing-google-cloud-managed-service-for-prometheus\">our blog</a> and on <a href=\"http://cloud.google.com/managed-prometheus\">the website</a>.</p></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Nov 8 - Nov 12, 2021</h3><ul><li><p><b>New study on the economics of cloud migration</b> - <a href=\"https://cloud.google.com/resources/forrester-cost-savings-of-migrating-os-to-cloud-tei-study\">The Total Economic Impact™ Of Migrating Expensive Operating Systems and Traditional Software to Google Cloud</a>. We worked with Forrester on this study which details the cost savings and benefits you can achieve from migrating and modernizing with Google Cloud, especially with respect to expensive operating systems and traditional software. <a href=\"https://cloud.google.com/resources/forrester-cost-savings-of-migrating-os-to-cloud-tei-study\">Download now!</a></p></li><li><p><b>New whitepaper on building a successful cloud migration strategy</b> - The priority to move into the cloud and achieve a zero data center footprint is becoming top of mind for many CIOs. One of the most fundamental changes required to accelerate a move to the cloud is the adoption of a product mindset—the shift from an emphasis on project to product. <a href=\"https://cloud.google.com/resources/accelerating-journey-to-cloud-with-product-mindset-whitepaper\">Download “Accelerating the journey to the cloud with a product mindset” now.</a></p></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Nov 1 - Nov 5, 2021</h3><p></p><ul><li><a href=\"https://cloud.google.com/spanner/docs/ttl\">Time to live (TTL)</a> reduces storage costs, improves query performance, and simplifies data retention in Cloud Spanner by automatically removing unneeded data based on user-defined policies. Unlike custom scripts or application code, TTL is fully managed and designed for minimal impact on other workloads. TTL is generally available today in Spanner at no additional cost. <a href=\"https://cloud.google.com/blog/products/spanner/reduce-costs-and-simplify-compliance-with-managed-ttl-in-spanner\">Read more</a>.<br/></li><li><b>New whitepaper available: Migrating to .NET Core/5+ on Google Cloud</b> - This free whitepaper, written for .NET developers and software architects who want to modernize their .NET Framework applications, outlines the benefits and things to consider when migrating .NET Framework apps to .NET Core/5+ running on Google Cloud. It also offers a framework with suggestions to help you build a strategy for migrating to a fully managed Kubernetes offering or to Google serverless. <a href=\"https://cloud.google.com/architecture/migrating-to-net-core-five-plus-google-cloud\">Download the free whitepaper</a>. <br/></li><li><b>Export from Google Cloud Storage</b>: Storage Transfer Service now offers <a href=\"https://cloud.google.com/products/#product-launch-stages\">Preview</a> support for exporting data from Cloud Storage to any POSIX file system. You can use this bidirectional data movement capability to move data in and out of Cloud Storage, on-premises clusters, and edge locations including Google Distributed Cloud. The service provides built-in capabilities such as scheduling, bandwidth management, retries, and data integrity checks that simplifies the data transfer workflow. For more information, see <a href=\"https://cloud.google.com/storage-transfer/docs/download-from-cloud-storage\">Download data from Cloud Storage</a>.<br/></li><li><b>Document Translation is now GA</b>! Translate documents in real-time in 100+ languages, and retain document formatting. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/translation-tools-that-meet-business-needs\">Learn more</a> about new features and see a demo on how Eli Lilly translates content globally.</li><li><b>Announcing the general availability of Cloud Asset Inventory console</b> - We’re excited to <a href=\"https://cloud.google.com/asset-inventory/docs/release-notes\">announce the general availability</a> of the new Cloud Asset Inventory user interface. In addition <a href=\"https://cloud.google.com/blog/products/identity-security/improve-visibility-with-four-cloud-asset-inventory-features\">to all the capabilities announced earlier in Public Preview</a>, the general availability release provides powerful search and easy filtering capabilities. These capabilities enable you to view details of resources and IAM policies, machine type and policy statistics, and insights into your overall cloud footprint. Learn more about these new capabilities by using the <a href=\"https://cloud.google.com/asset-inventory/docs/searching-resources\">searching resources</a> and <a href=\"https://cloud.google.com/asset-inventory/docs/searching-iam-policies\">searching IAM policies</a> guides. You can get more information about Cloud Asset Inventory using <a href=\"https://cloud.google.com/asset-inventory/docs\">our product documentation.</a><br/></li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Oct 25 - Oct 29, 2021</h3><ul><li><b>BigQuery table snapshots are now generally available</b>. A <a href=\"https://cloud.google.com/bigquery/docs/table-snapshots-intro\">table snapshot</a> is a low-cost, read-only copy of a table's data as it was at a particular time. <br/></li><li>By establishing a robust value measurement approach to track and monitor the business value metrics toward business goals, we are bringing technology, finance, and business leaders together through the discipline of Cloud FinOps to show how digital transformation is enabling the organization to create new innovative capabilities and generate top-line revenue. <a href=\"https://cloud.google.com/blog/topics/cloud-first/decoding-cloud-finops\">Learn more</a>.<br/></li><li><b>We’ve announced BigQuery Omni</b>, a new multicloud analytics service that allows data teams to perform cross-cloud analytics - across AWS, Azure, and Google Cloud - all from one viewpoint. Learn how BigQuery Omni works and what data and business challenges it solves <a href=\"https://cloud.google.com/blog/products/data-analytics/analyze-data-across-clouds-with-bigquery-omni\">here</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Oct 18 - Oct 22, 2021</h3><p></p><ul><li><b>Available now</b> are our newest T2D VMs family based on 3rd Generation AMD EPYC processors. <a href=\"https://cloud.google.com/blog/products/compute/compute-engine-tau-t2d-vms-now-available-for-scale-out-workloads\">Learn more</a>.<br/></li><li>In case you missed it — <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/ai-announcements-from-google-cloud-next-21\">top AI announcements</a> from Google Cloud Next. Catch up on what’s new, see demos, and hear from our customers about how Google Cloud is making AI more accessible, more focused on business outcomes, and fast-tracking the time-to-value. <br/></li><li>Too much to take in at Google Cloud Next 2021? No worries - here’s a <a href=\"https://cloud.google.com/blog/topics/google-cloud-next/what-you-missed-at-google-cloud-next-2021\">breakdown of the biggest announcements</a> at the 3-day event.</li><li><a href=\"https://cloud.google.com/blog/topics/solutions-how-tos/best-practices-for-architecting-google-cloud-workloads\">Check out</a> the second revision of <a href=\"https://cloud.google.com/architecture/framework\">Architecture Framework,</a> Google Cloud’s collection of canonical best practices.<br/></li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Oct 4 - Oct 8, 2021</h3><p></p><ul><li>We’re excited to announce <b>Google Cloud’s new goal of equipping more than 40 million people with Google Cloud skills</b>. To help achieve this goal, we’re offering no-cost access to all our training content this month. Find out more <a href=\"https://cloud.google.com/blog/topics/training-certifications/google-cloud-to-train-more-than-40-million-with-cloud-skills\">here</a>. </li><li><b>Support for language repositories in Artifact Registry is now generally available</b>. Artifact Registry allows you to store all your language-specific artifacts in one place. Supported package types include Java, Node and Python. Additionally, support for Linux packages is in public preview. <a href=\"https://cloud.google.com/blog/products/application-development/node-python-and-javarepos-are-generally-available\">Learn more</a>.</li><li>Want to know <b>what’s the latest with Google ML-Powered intelligence service</b> <a href=\"https://cloud.google.com/solutions/active-assist\"><b>Active Assist</b></a> and how to learn more about it at Next’21? <a href=\"https://cloud.google.com/blog/products/management-tools/what-to-expect-from-active-assist-at-google-cloud-next21\">Check out this blog</a>.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Sept 27 - Oct 1, 2021</h3><p></p><ul><li><b>Announcing the launch of Speaker ID</b>. In 2020, customer preference for voice calls increased by 10 percentage points (to 43%) and was by far the most preferred service channel. But most callers still need to pass through archaic authentication processes which slows down the time to resolution and burns through valuable agent time. Speaker ID, from Google Cloud, brings ML-based speaker identification directly to customers and contact center partners, allowing callers to authenticate over the phone, using their own voice. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/google-cloud-announces-speaker-id\">Learn more</a>.</li><li><b>Your guide to all things AI &amp; ML at Google Cloud Next</b>. Google Cloud Next is coming October 12–14 and if you’re interested in AI &amp; ML, we’ve got you covered. Tune in to hear about real use cases from companies like Twitter, Eli Lilly, Wayfair, and more. We’re also excited to share exciting product news and hands on AI learning opportunities. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/developers-guide-to-ai-at-next-2021\">Learn more about AI at Next</a> and <a href=\"https://cloud.withgoogle.com/next?_ga=2.153493822.-760617547.1631226649\" target=\"_blank\">register</a> for free today!</li><li>It is now simple to use Terraform to configure Anthos features on your GKE clusters. Check out part two of this series which explores adding Policy Controller audits to our Config Sync managed cluster. <a href=\"https://cloud.google.com/blog/topics/anthos/using-terraform-to-enable-policy-controller-on-a-gke-cluster\">Learn more.</a></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Sept 20 - Sept 24, 2021</h3><p></p><ul><li><b>Announcing the webinar, Powering market data through cloud and AI/ML</b>. We’re sponsoring a Coalition Greenwich webinar on September 23rd where we’ll discuss the findings of our upcoming study on how market data delivery and consumption is being transformed by cloud and AI. Moderated by Coalition Greenwich, the panel will feature Trey Berre from CME Group, Brad Levy from Symphony, and Ulku Rowe representing Google Cloud. <a href=\"https://www.greenwich.com/event/powering-market-data-through-cloud-and-aiml\" target=\"_blank\">Register here.</a></li><li><b>New research from Google Cloud reveals five innovation trends for market data</b>. Together with Coalition Greenwich we surveyed exchanges, trading systems, data aggregators, data producers, asset managers, hedge funds, and investment banks to examine both the distribution and consumption of market data and trading infrastructure in the cloud. Learn more about our findings <a href=\"https://cloud.google.com/blog/topics/financial-services/market-data-distribution--consumption-through-cloud--ai\">here</a>.<br/></li><li>If you are looking for a more automated way to manage quotas over a high number of projects, we are excited to <a href=\"https://cloud.google.com/blog/products/gcp/google-cloud-introduces-quota-monitoring-solution\">introduce a Quota Monitoring Solution</a> from Google Cloud Professional Services. This solution benefits customers who have many projects or organizations and are looking for an easy way to monitor the quota usage in a single dashboard and use default alerting capabilities across all quotas.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3><ul></ul></h3><h3>Week of Sept 13 - Sept 17, 2021</h3><ul><li><b>New storage features help ensure data is never lost. </b>We are announcing extensions to our popular Cloud Storage offering, and introducing two new services, Filestore Enterprise, and Backup for Google Kubernetes Engine (GKE). Together, these new capabilities will make it easier for you to protect your data out-of-the box, across a wide variety of applications and use cases: <a href=\"https://cloud.google.com/blog/products/storage-data-transfer/google-cloud-expands-storage-portfolio-with-latest-launches\">Read the full article</a>.<br/></li><li><b>API management powers sustainable resource management</b>. Water, waste, and energy solutions company, Veolia, uses APIs and API Management platform Apigee to build apps and help their customers build their own apps, too. <a href=\"https://cloud.google.com/blog/products/api-management/how-veolia-is-using-api-management-to-power-sustainable-resource-management\">Learn from their digital and API-first approach here.</a><br/></li><li>To support our expanding customer base in Canada, we’re excited to announce that the new <a href=\"https://cloud.google.com/blog/products/infrastructure/google-cloud-toronto-region-now-open\"><b>Google Cloud Platform region in Toronto is now open</b></a>. Toronto is the 28th Google Cloud region connected via our high-performance network, helping customers better serve their users and customers throughout the globe. In combination with Montreal, customers now benefit from improved business continuity planning with distributed, secure infrastructure needed to meet IT and business requirements for disaster recovery, while maintaining data sovereignty.</li><li><b>Cloud SQL now supports custom formatting controls for CSVs</b><b>.</b>When performing admin exports and imports, users can now select custom characters for field delimiters, quotes, escapes, and other characters. For more information, see our <a href=\"https://cloud.google.com/sql/docs/mysql/import-export/import-export-csv\">documentation</a>.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Sept 6 -Sept 10, 2021<br/></h3><ul><li><a href=\"https://cloud.google.com/blog/products/devops-sre/how-lowes-improved-incident-response-processes-with-sre\">Hear how</a> Lowe’s SRE was able to reduce their Mean Time to Recovery (MTTR) by over 80% after adopting Google’s Site Reliability Engineering practices and Google Cloud’s operations suite.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of  Aug 30 -Sept 3, 2021</h3><ul><li>A what’s new blog in the what’s new blog? Yes, you read that correctly. Google Cloud data engineers are always hard at work maintaining the hundreds of dataset pipelines that feed into our public <a href=\"http://cloud.google.com/solutions/datasets\">datasets</a> repository, but they’re also regularly bringing new ones into the mix. Check out our newest featured datasets and catch a few best practices in our living blog: <a href=\"https://cloud.google.com/blog/products/data-analytics/get-the-latest-news-and-best-practices-for-google-cloud-datasets\">What are the newest datasets in Google Cloud</a>? <br/></li><li>Migration success with Operational Health Reviews from Google Cloud’s Professional Service Organization - <a href=\"https://cloud.google.com/blog/products/cloud-migration/how-pso-helps-you-maximize-google-cloud-migrations\">Learn how</a> Google Cloud’s Professional Services Org is proactively and strategically guiding customers to operate effectively and efficiently in the Cloud, both during and after their migration process.<br/></li><li>Learn how we simplified monitoring for Google Cloud VMware Engine and Google Cloud operations suite. <a href=\"https://cloud.google.com/blog/products/vmware-engine/monitor-your-vmware-instances-in-google-cloud\">Read more</a>.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Aug 23 -Aug 27, 2021</h3><ul><li><b>Google Transfer Appliance announces preview of online mode</b>. Customers are increasingly collecting data that needs to quickly be transferred to the cloud. Transfer Appliances are being used to quickly offload data from sources (e.g. cameras, cars, sensors) and can now stream that data to a Cloud Storage bucket. Online mode can be toggled as data is copied into the appliance and either send the data offline by shipping the appliance to Google or copy data to Cloud Storage over the network. <a href=\"https://cloud.google.com/transfer-appliance/docs/hybrid-appliance/procedure-guide\">Read more</a>.<br/></li><li><b>Topic retention for Cloud Pub/Sub is now Generally Available</b>. Topic retention is the most comprehensive and flexible way available to retain Pub/Sub messages for message replay. In addition to backing up all subscriptions connected to the topic, new subscriptions can now be initialized from a timestamp in the past. Learn more about the feature <a href=\"https://cloud.google.com/blog/products/data-analytics/pubsub-gains-topic-retention-feature\">here</a>.<br/></li><li><b>Vertex Predictions now supports private endpoints for online prediction</b>. Through VPC Peering, Private Endpoints provide increased security and lower latency when serving ML models. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/creating-a-private-endpoint-on-vertex-ai\">Read more.</a><br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Aug 16 -Aug 20, 2021</h3><ul><li>Look for us to take security one step further by adding authorization features for service-to-service communications for gRPC proxyless services, as well as to support other deployment models, where proxyless gRPC services are running somewhere other than GKE, for example Compute Engine. We hope you'll join us and check out the <a href=\"https://cloud.google.com/traffic-director/docs/security-proxyless-setup\">setup guide</a> and give us feedback.<br/></li><li><b>Cloud Run now supports VPC Service Controls</b>. You can now protect your Cloud Run services against data exfiltration by using VPC Service Controls in conjunction with Cloud Run’s ingress and egress settings. <a href=\"https://cloud.google.com/blog/products/serverless/cloud-run-gets-enterprise-grade-network-security-with-vpc-sc\">Read more</a>.<br/></li><li>Read how retailers are leveraging Google Cloud VMware Engine to move their on-premises applications to the cloud, where they can achieve the scale, intelligence, and speed required to stay relevant and competitive. <a href=\"https://cloud.google.com/blog/products/infrastructure/retailers-use-vmware-as-a-service-increase-agility\">Read more</a>.<br/></li><li><b>A series of new features for</b> <a href=\"http://g.co/cloud/bce\" target=\"_blank\"><b>BeyondCorp Enterprise</b></a>, <b>our zero trust offering</b>. We now offer native support for client certificates for eight types of VPC-SC resources. We are also announcing general availability of the on-prem connector, which allows users to secure HTTP or HTTPS based on-premises applications outside of Google Cloud. Additionally, three new BeyondCorp attributes are available in Access Context Manager as part of a public preview. Customers can configure custom access policies based on time and date, credential strength, and/or Chrome browser attributes. Read more about these announcements <a href=\"https://cloud.google.com/blog/products/identity-security/new-beyondcorp-enterprise-zero-trust-capabilities\">here</a>.</li><li>We are excited to announce that Google Cloud, working with its partners <a href=\"https://www.nag.com/\" target=\"_blank\">NAG</a> and <a href=\"https://www.ddn.com/\" target=\"_blank\">DDN</a>, demonstrated the highest performing Lustre file system on the <a href=\"https://io500.org/\" target=\"_blank\">IO500 ranking of the fastest HPC storage systems</a> — quite a feat considering Lustre is one of the most widely deployed HPC file systems in the world.  <a href=\"https://cloud.google.com/blog/topics/hpc/google-cloud-ranks-on-io500-benchmark-with-lustre\">Read the full article.</a></li><li>The <a href=\"https://cloud.google.com/storage-transfer/docs/managing-on-prem-jobs#rest-api_1\"><b>Storage Transfer Service for on-premises data API</b></a> is <b>now available in Preview</b>. Now you can use RESTful APIs to automate your on-prem-to-cloud transfer workflows.  Storage Transfer Service is a software service to transfer data over a network. The service provides built-in capabilities such as scheduling, bandwidth management, retries, and data integrity checks that simplifies the data transfer workflow.<br/></li><li><b>It is now simple to use Terraform to configure Anthos features on your GKE clusters</b>. This is the first part of the 3 part series that describes using Terraform to enable Config Sync.  For platform administrators,  this natural, IaC approach improves auditability and transparency and reduces risk of misconfigurations or security gaps. <a href=\"https://cloud.google.com/blog/topics/anthos/using-terraform-to-enable-config-sync-on-a-gke-cluster\">Read more</a>.<br/></li><li>In this commissioned study, “<a href=\"https://cloud.google.com/resources/forrester-modernize-with-aiops-maximize-impact-study\"><b>Modernize With AIOps To Maximize Your Impact</b></a>”, Forrester Consulting surveyed organizations worldwide to better understand how they’re approaching <a href=\"https://cloud.google.com/solutions/active-assist\">artificial intelligence for IT operations (AIOps) in their cloud environments</a>, and what kind of benefits they’re seeing. <a href=\"https://cloud.google.com/blog/products/cloud-migration/modernize-with-aiops-to-maximize-your-impact\">Read more</a>.<br/></li><li>If your organization or development environment has strict security policies which don’t allow for external IPs, it can be difficult to set up a connection between a Private Cloud SQL instance and a Private IP VM. This <a href=\"https://cloud.google.com/blog/products/databases/connect-a-private-cloud-sql-instance-to-private-ip-vm\">article</a> contains <b>clear instructions on how to set up a connection from a private Compute Engine VM to a private Cloud SQL instance</b> using a private service connection and the mysqlsh command line tool.<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Aug 9 -Aug 13, 2021</h3><ul><li><b>Compute Engine users have a new, updated set of VM-level “in-context” metrics, charts, and logs</b> to correlate signals for common troubleshooting scenarios across CPU, Disk, Memory, Networking, and live Processes.  This brings the best of Google Cloud’s operations suite directly to the Compute Engine UI. <a href=\"https://cloud.google.com/blog/products/operations/better-access-to-observability-data-for-virtual-machines\">Learn more</a>.<br/></li><li><b>​​Pub/Sub to Splunk Dataflow template has been updated</b>to address multiple enterprise customer asks, from improved compatibility with Splunk Add-on for Google Cloud Platform, to more extensibility with user-defined functions (UDFs), and general pipeline reliability enhancements to tolerate failures like transient network issues when delivering data to Splunk. Read more to learn about how to take advantage of these latest features. <a href=\"https://cloud.google.com/blog/products/data-analytics/whats-new-splunk-dataflow-template\">Read more</a>.<br/></li><li><b>Google Cloud and NVIDIA</b> have teamed up to make VR/AR workloads easier, faster to create and tetherless! <a href=\"https://cloud.google.com/blog/products/gaming/streaming-vr-and-ar-content-google-cloud-nvidia-cloudxr\">Read more</a>.<br/></li><li><b>Register for the Google Cloud Startup Summit, September 9, 2021</b> at <a href=\"http://goo.gle/StartupSummit\" target=\"_blank\">goo.gle/StartupSummit</a> for a digital event filled with inspiration, learning, and discussion. This event will bring together our startup and VC community to discuss the latest trends and insights, headlined by a keynote by Astro Teller, Captain of Moonshots at X the moonshot factory. Additionally, learn from a variety of technical and business sessions to help take your startup to the next level.<br/></li><li><b>Google Cloud and Harris Poll healthcare research reveals COVID-19 impacts on healthcare technology</b>. <a href=\"https://cloud.google.com/blog/topics/healthcare-life-sciences/google-cloud-covid-19-research\">Learn more</a>.</li><li><b><a href=\"https://support.google.com/a/answer/6341409\" target=\"_blank\">Partial</a> <a href=\"https://support.google.com/a/answer/6341409\" target=\"_blank\">SSO</a></b> is now available for public preview. If you use a 3rd party identity provider to single sign on into Google services, Partial SSO allows you to identify a subset of your users to use Google / Cloud Identity as your SAML SSO identity provider (<a href=\"https://www.youtube.com/watch?v=HvjFjYtscIc\" target=\"_blank\">short video and demo</a>).<br/></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Aug 2-Aug 6, 2021</h3><ul><li><b>Gartner named Google Cloud a Leader in the 2021 Magic Quadrant for Cloud Infrastructure and Platform Services, formerly Infrastructure as a Service. <a href=\"https://cloud.google.com/blog/products/gcp/google-cloud-a-leader-in-2021-gartner-iaas-mq\">Learn more</a>.<br/></b></li><li><b>Private Service Connect is now generally available</b>. Private Service Connect lets you create private and secure connections to Google Cloud and third-party services with service endpoints in your VPCs. <a href=\"https://cloud.google.com/blog/products/networking/private-service-connect-is-now-generally-available\">Read more</a>.</li><li><b>30 migration guides</b> designed to help you identify the best ways to migrate, which include meeting common organizational goals like minimizing time and risk during your migration, identifying the most enterprise-grade infrastructure for your workloads, picking a cloud that aligns with your organization’s sustainability goals, and more. <a href=\"https://cloud.google.com/blog/products/cloud-migration/30-guides-to-kickstart-your-migration-to-google-cloud\">Read more</a>.</li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Jul 26-Jul 30, 2021</h3><p></p><ul><li><p>This week we hosting our <a href=\"https://cloudonair.withgoogle.com/events/summit-retail\" target=\"_blank\"><b>Retail &amp; Consumer Goods Summit</b></a>, a digital event dedicated to helping leading retailers and brands digitally transform their business. <a href=\"https://cloud.google.com/blog/topics/consumer-packaged-goods/retail-cpg-summit-2021-a-new-era-for-consumer-brands\">Read more</a> about our consumer packaged goods strategy and a guide to key summit content for brands in this blog from Giusy Buonfantino, Google Cloud’s Vice President of CPG.<br/></p></li><li><p>We’re hosting our <a href=\"https://cloudonair.withgoogle.com/events/summit-retail\" target=\"_blank\"><b>Retail &amp; Consumer Goods Summit</b></a>, a digital event dedicated to helping leading retailers and brands digitally transform their business. <a href=\"https://cloud.google.com/blog/topics/retail/the-three-pillars-of-the-future-of-retail\">Read more</a>.<br/></p></li><li><p>See how <b>IKEA uses Recommendations AI</b> to provide customers with more relevant product information. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/ikea-uses-google-cloud-recommendations-ai\">Read more</a>.</p></li><li><p>​​Google Cloud launches a <b>career program for people with autism</b> designed to hire and support more talented people with autism in the rapidly growing cloud industry. <a href=\"https://cloud.google.com/blog/topics/inside-google-cloud/google-cloud-launches-a-career-program-for-people-with-autism\">Learn more</a></p></li><li><p>Google Cloud follows <b>new API stability tenets</b> that work to minimize unexpected deprecations to our Enterprise APIs. <a href=\"https://cloud.google.com/blog/topics/inside-google-cloud/new-api-stability-tenets-govern-google-enterprise-apis\">Read more</a>.</p></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Jul 19-Jul 23, 2021<br/></h3><p></p><ul><li>Register and join us for <b>Google Cloud Next, October 12-14, 2021</b> at <a href=\"http://g.co/CloudNext\" target=\"_blank\">g.co/CloudNext</a> for a fresh approach to digital transformation, as well as a few surprises. <b>Next ‘21</b> will be a fully customizable digital adventure for a more personalized learning journey. Find the tools and training you need to succeed. From live, interactive Q&amp;As and informative breakout sessions to educational demos and real-life applications of the latest tech from Google Cloud. Get ready to plug into your cloud community, get informed, and be inspired. Together we can tackle today’s greatest business challenges, and start solving for what’s next.<br/></li><li><b>\"Application Innovation\" takes a front row seat this year</b>– To stay ahead of rising customer expectations and the digital and in-person hybrid landscape, enterprises must know what application innovation means and how to deliver this type of innovation with a small piece of technology that might surprise you. <a href=\"https://cloud.google.com/blog/products/api-management/accelerating-app-innovation-with-api-management\">Learn more about the three pillars of app innovation here.</a><br/></li><li>We <a href=\"https://cloud.google.com/blog/products/identity-security/detect-complex-network-threats-with-cloud-ids\"><b>announced</b></a> Cloud IDS, our new network security offering, which is now available in preview. Cloud IDS delivers easy-to-use, cloud-native, managed, <b>network-based threat detection</b>. With Cloud IDS, customers can enjoy a Google Cloud-integrated experience, built with Palo Alto Networks’ industry-leading threat detection technologies to provide high levels of security efficacy. <a href=\"https://cloud.google.com/ids/\">Learn more</a>. <br/></li><li><b>Key Visualizer for Cloud Spanner is now generally available</b>. Key Visualizer is a new interactive monitoring tool that lets developers and administrators analyze usage patterns in Spanner. It reveals trends and outliers in key performance and resource metrics for databases of any size, helping to optimize queries and reduce infrastructure costs. <a href=\"https://youtu.be/P3hiF3iNQew\" target=\"_blank\">See it in action</a>.<br/></li><li>The market for <b>healthcare cloud is projected to grow 43%</b>. This means a need for better tech infrastructure, digital transformation &amp; Cloud tools. <a href=\"https://cloud.google.com/blog/topics/healthcare-life-sciences/google-cloud-partner-advantage-for-healthcare\">Learn how</a> Google Cloud Partner Advantage partners help customers solve business challenges in healthcare.</li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Jul 12-Jul 16, 2021</h3><ul><li><b>Simplify VM migrations with Migrate for Compute Engine as a Service</b>: delivers a Google-managed cloud service that enables simple, frictionless, and large-scale enterprise migrations of virtual machines to Google Compute Engine with minimal downtime and risk. API-driven and integrated into your Google Cloud console for ease of use, this service uses agent-less replication to copy data without manual intervention and without VPN requirements. It also enables you to launch non-disruptive validations of your VMs prior to cutover.  Rapidly migrate a single application or execute a sprint with hundred systems using migration groups with confidence. Read more <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/migrate-for-compute-engine-as-a-service\">here</a>.<br/></li><li>The <b>Google Cloud region in Delhi NCR is now open</b> for business, ready to host your workloads. <a href=\"https://cloud.google.com/blog/products/infrastructure/google-cloud-region-in-delhi-ncr-is-now-open\">Learn more</a> and watch the region launch event <a href=\"https://cloudonair.withgoogle.com/events/india-region-launch\" target=\"_blank\">here</a>.<br/></li><li><b>Introducing Quilkin: the open-source game server proxy</b>. Developed in collaboration with Embark Studios, Quilkin is an open source UDP proxy, tailor-made for high performance real-time multiplayer games. <a href=\"https://cloud.google.com/blog/products/gaming/introducing-quilkin\">Read more</a>.<br/></li><li>We’re making <b>Google Glass on Meet available to a wider network</b> of global customers. <a href=\"https://cloud.google.com/blog/products/workspace/open-beta-now-available-to-all-workspace-customers\">Learn more</a>.</li><li><p><b>Transfer Appliance supports Google Managed Encryption Keys</b> — We’re announcing the support for Google Managed Encryption Keys with Transfer Appliance, this is in addition to the currently available Customer Managed Encryption Keys feature. Customers have asked for the Transfer Appliance service to create and manage encryption keys for transfer sessions to improve usability and maintain security. The Transfer Appliance Service can now manage the encryption keys for the customers who do not wish to handle a key themselves. Learn more about <a href=\"https://cloud.google.com/transfer-appliance/docs/4.0/permissions-step-by-step#prepare-keys\">Using Google Managed Encryption Keys</a>. <br/></p></li><li><p><b>UCLA builds a campus-wide API program</b>– With Google Cloud's API management platform, Apigee, UCLA created a unified and strong API foundation that removes data friction that students, faculty, and administrators alike face. This foundation not only simplifies how various personas connect to data, but also encourages more innovations in the future. <a href=\"https://cloud.google.com/blog/products/api-management/ucla-accelerates-innovation-with-google-cloud\">Learn their story.</a><br/></p></li><li>An enhanced region picker makes it easy to <b>choose a Google Cloud region with the </b><b>lowest CO2 </b><b>output</b>. <a href=\"https://cloud.google.com/blog/topics/sustainability/pick-the-google-cloud-region-with-the-lowest-co2\">Learn more</a>.<br/></li><li>Amwell and Google Cloud explore <b>five ways telehealth can help democratize access to healthcare</b>. <a href=\"https://cloud.google.com/blog/topics/healthcare-life-sciences/how-telehealth-improves-access-to-healthcare\">Read more</a>.<br/></li><li>Major League Baseball and Kaggle <b>launch ML competition</b> to learn about fan engagement. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/using-machine-learning-to-deconstruct-baseball-fandom\">Batter up!</a><br/></li><li><p>We’re rolling out <b>general support</b> of <b>Brand Indicators for Message Identification (BIMI)</b> in Gmail within Google Workspace. <a href=\"https://cloud.google.com/blog/products/identity-security/bringing-bimi-to-gmail-in-google-workspace\">Learn more</a>.</p></li><li><p><a href=\"https://cloud.google.com/blog/products/data-analytics/dena-sports-business-helps-fight-covid-19-with-device-data-app\">Learn how</a> DeNA Sports Business created an operational status visualization system that helps determine whether live event attendees have correctly installed Japan’s coronavirus contact tracing app COCOA.</p></li><li><p><b>Google Cloud CAS</b> provides a highly scalable and available private CA to address the unprecedented growth in certificates in the digital world. <a href=\"https://cloud.google.com/blog/products/identity-security/google-cloud-certificate-authority-service-is-now-ga\">Read more</a> about CAS.</p></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Jul 5-Jul 9, 2021</h3><p></p><ul><li><b>Google Cloud and Call of Duty League launch ActivStat</b> to bring fans, players, and commentators the power of competitive statistics in real-time. <a href=\"https://cloud.google.com/blog/products/gaming/google-cloud-and-call-of-duty-league-power-competitive-statistics\">Read more.</a></li><li><b>Building applications is a heavy lift</b> due to the technical complexity, which includes the complexity of backend services that are used to manage and store data. Firestore alters this by having Google Cloud manage your backend complexity through a complete backend-as-a-service! <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/all-you-need-know-about-firestore-cheatsheet\">Learn more.</a><br/></li><li><b>Google Cloud’s new Native App Development</b> skills challenge lets you earn badges that demonstrate your ability to create cloud-native apps. <a href=\"https://cloud.google.com/blog/topics/training-certifications/introducing-new-native-app-development-skills-challenge\">Read more</a> and <a href=\"https://inthecloud.withgoogle.com/google-cloud-skills/register.html?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY21-Q1-global-trainingandenablement-website-other-skills_challenge&amp;utm_content=nativeappdev\" target=\"_blank\">sign up</a>.<br/></li></ul><p></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Jun 28-Jul 2, 2021</h3><ul><li><b>Storage Transfer Service</b> now offers preview support for Integration with AWS Security Token Service. Security conscious customers can now use Storage Transfer Service to perform transfers from AWS S3 without passing any security credentials. This release will alleviate the security burden associated with passing long-term AWS S3 credentials, which have to be rotated or explicitly revoked when they are no longer needed. <a href=\"https://cloud.google.com/storage-transfer/docs/configure-access#federated-identity\">Read more</a>.<br/></li><li>The most popular and surging <b>Google Search terms are now available in BigQuery</b> as a public dataset. View the Top 25 and Top 25 rising queries from Google Trends from the past 30-days, including 5 years of historical data across the 210 Designated Market Areas (DMAs) in the US. <a href=\"https://cloud.google.com/blog/products/data-analytics/top-25-google-search-terms-now-in-bigquery\">Learn more</a>.<br/></li><li>A <b>new predictive autoscaling capability lets you add additional Compute Engine VMs in anticipation of forecasted demand</b>. Predictive autoscaling is generally available across all Google Cloud regions. <a href=\"https://cloud.google.com/blog/products/compute/introducing-compute-engine-predictive-autoscaling\">Read more</a> or consult the <a href=\"https://cloud.google.com/compute/docs/autoscaler/predictive-autoscaling\">documentation</a> for more information on how to configure, simulate and monitor predictive autoscaling.<br/></li><li><b>Messages by Google</b> is now the default messaging app for all AT&amp;T customers using Android phones in the United States. <a href=\"https://cloud.google.com/blog/products/workspace/att-android-customers-to-have-messages-app-by-default\">Read more</a>.</li><li><b>TPU v4 Pods will soon be available on Google Cloud</b>, providing the most powerful publicly available computing platform for machine learning training. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/google-wins-mlperf-benchmarks-with-tpu-v4\">Learn more</a>.</li><li>Cloud SQL for SQL Server has addressed multiple enterprise customer asks with the <b>GA releases of both SQL Server 2019 and Active Directory integration</b>, as well as the Preview release of Cross Region Replicas.  This set of releases work in concert to allow customers to set up a more scalable and secure managed SQL Server environment to address their workloads’ needs. <a href=\"https://cloud.google.com/blog/products/databases/improving-cloud-sql-for-sql-server-security-and-scalability\">Read more</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Jun 21-Jun 25, 2021</h3><ul><li><b>Simplified return-to-office with no-code technology</b>–<b></b>We've just released a solution to your most common return-to-office headaches: make a no-code app customized to solve your business-specific challenges. Learn how to create an automated app where employees can see office room occupancy, check what desks are reserved or open, review disinfection schedules, and more in this <a href=\"https://cloud.google.com/blog/products/no-code-development/build-no-code-apps-with-appsheet-for-hybrid-work-and-more\">blog tutorial.</a><br/></li><li><b>New technical validation whitepaper for running ecommerce applications</b>—Enterprise Strategy Group's analyst outlines the challenges of organizations running ecommerce applications and how Google Cloud helps to mitigate those challenges and handle changing demands with global infrastructure solutions. <a href=\"https://cloud.google.com/resources/esg-technical-ecommerce-whitepaper\">Download the whitepaper.</a><br/></li><li><b>The full</b><a href=\"https://developersonair.withgoogle.com/events/game-dev-summit-2021\" target=\"_blank\"><b>agenda</b></a><b>for Google for Games Developer Summit on July 12th-13th, 2021 is now available</b>. A free digital event with announcements from teams including Stadia, Google Ads, AdMob, Android, Google Play, Firebase, Chrome, YouTube, and Google Cloud. Hear more about how Google Cloud technology creates opportunities for gaming companies to make lasting enhancements for players and creatives. Register at <a href=\"https://developersonair.withgoogle.com/events/game-dev-summit-2021\" target=\"_blank\">g.co/gamedevsummit</a></li><li><a href=\"https://cloud.google.com/blog/products/data-analytics/bigquery-provides-tighter-controls-over-data-access\"><b>BigQuery row-level security</b></a> is now generally available, giving customers a way to control access to subsets of data in the same table for different groups of users. Row-level security (RLS) extends the <a href=\"https://en.wikipedia.org/wiki/Principle_of_least_privilege\" target=\"_blank\">principle of least privilege</a> access and enables fine-grained access control policies in BigQuery tables. BigQuery currently supports access controls at the <a href=\"https://cloud.google.com/bigquery/docs/access-control\">project-</a>, <a href=\"https://cloud.google.com/bigquery/docs/dataset-access-controls\">dataset-</a>, <a href=\"https://cloud.google.com/bigquery/docs/table-access-controls-intro\">table-</a> and <a href=\"https://cloud.google.com/bigquery/docs/column-level-security\">column-level</a>. Adding RLS to the portfolio of access controls now enables customers to filter and define access to specific rows in a table based on qualifying user conditions—providing much needed peace of mind for data professionals.<br/></li><li><b>Transfer from Azure ADLS Gen 2</b>: <a href=\"https://cloud.google.com/storage-transfer-service\">Storage Transfer Service</a> offers Preview support for transferring data from Azure ADLS Gen 2 to Google Cloud Storage. Take advantage of a scalable, serverless service to handle data transfer. <a href=\"https://cloud.google.com/storage-transfer/docs/release-notes#June_18_2021\">Read more</a>.<br/></li><li><b>reCAPTCHA V2 and V3 customers can now migrate site keys to reCAPTCHA Enterprise</b> in under 10 minutes and without making any code changes. Watch our <a href=\"https://www.brighttalk.com/webcast/18282/490567?utm_source=GoogleCloudSecurity&amp;utm_medium=brighttalk&amp;utm_campaign=490567\" target=\"_blank\">Webinar to learn more. </a><br/></li><li>Bot attacks are the biggest threat to your business that you probably haven’t addressed yet. <b>Check out our</b> <a href=\"https://www.forbes.com/sites/googlecloud/2021/04/01/bot-attacks-are-the-biggest-online-risk-you-havent-addressed/?sh=4cec49d46dda\" target=\"_blank\"><b>Forbes article</b></a> to see what you can do about it.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Jun 14-Jun 18, 2021</h3><ul><li><b>A new VM family for scale-out workloads</b>—New AMD-based Tau VMs offer 56% higher absolute performance and 42% higher price-performance compared to general-purpose VMs from any of the leading public cloud vendors. <a href=\"https://cloud.google.com/blog/products/compute/google-cloud-introduces-tau-vms\">Learn more</a>. <br/></li><li><b>New whitepaper helps customers plot their cloud migrations</b>—Our new whitepaper distills the conversations we’ve had with CIOs, CTOs, and their technical staff into several frameworks that can help cut through the hype and the technical complexity to help devise the strategy that empowers both the business and IT. <a href=\"https://cloud.google.com/blog/products/cloud-migration/new-cloud-migration-whitepaper-asks-up-or-out\">Read more</a> or <a href=\"https://cloud.google.com/resources/understanding-cloud-migration-frameworks-whitepaper\">download the whitepaper</a>.<br/></li><li><b>Ubuntu Pro lands on Google Cloud</b>—The general availability of Ubuntu Pro images on Google Cloud gives customers an improved Ubuntu experience, expanded security coverage, and integration with critical Google Cloud features. <a href=\"https://cloud.google.com/blog/products/compute/ubuntu-pro-available-on-google-cloud\">Read more</a>.<br/></li><li><b>Navigating hybrid work with a single, connected experience in Google Workspace</b>—New additions to Google Workspace help businesses navigate the challenges of hybrid work, such as Companion Mode for Google Meet calls. <a href=\"https://cloud.google.com/blog/products/workspace/helping-business-with-new-additions-to-google-workspace\">Read more</a>.<br/></li><li><b>Arab Bank embraces Google Cloud technology</b>—This Middle Eastern bank now offers innovative apps and services to their customers and employees with Apigee and Anthos. In fact, Arab Bank reports over 90% of their new-to-bank customers are using their mobile apps. <a href=\"https://cloud.google.com/blog/products/apigee/arab-bank-accelerates-app-innovation-with-google-cloud\">Learn more</a>.<br/></li><li><b>Google Workspace for the Public Sector Sector events</b>—This June, learn about Google Workspace tips and tricks to help you get things done. Join us for one or more of our learning events tailored for government and higher education users. <a href=\"https://cloud.google.com/blog/topics/public-sector/join-us-google-workspace-public-sector-sector-events\">Learn more</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Jun 7-Jun 11, 2021</h3><ul><li><b>The top cloud capabilities industry leaders want for sustained innovation</b>—Multicloud and hybrid cloud approaches, coupled with open-source technology adoption, enable IT teams to take full advantage of the best cloud has to offer. Our recent study with IDG shows just how much of a priority this has become for business leaders. <a href=\"https://cloud.google.com/blog/topics/hybrid-cloud/multicloud-and-hybrid-cloud-are-must-haves-from-cloud-providers\">Read more</a> or <a href=\"https://cloud.google.com/resources/5-ways-google-hybrid-multicloud-success-whitepaper?skip_cache=true&amp;hl=en\">download the report</a>.<br/></li><li><b>Announcing the Firmina subsea cable</b>—Planned to run from the East Coast of the United States to Las Toninas, Argentina, with additional landings in Praia Grande, Brazil, and Punta del Este, Uruguay, Firmina will be the longest open subsea cable in the world capable of running entirely from a single power source at one end of the cable if its other power source(s) become temporarily unavailable—a resilience boost at a time when reliable connectivity is more important than ever. <a href=\"https://cloud.google.com/blog/products/infrastructure/announcing-the-firmina-subsea-cable\">Read more</a>.</li><li><b>New research reveals what’s needed for AI acceleration in manufacturing</b>—According to our data, which polled more than 1,000 senior manufacturing executives across seven countries, 76% have turned to digital enablers and disruptive technologies due to the pandemic such as data and analytics, cloud, and artificial intelligence (AI). And 66% of manufacturers who use AI in their day-to-day operations report that their reliance on AI is increasing. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/research-on-ai-trends-in-manufacturing\">Read more</a> or <a href=\"https://services.google.com/fh/files/blogs/google_cloud_manufacturing_report_2021.pdf\" target=\"_blank\">download the report</a>.</li><li><b>Cloud SQL offers even faster maintenance</b>—Cloud SQL maintenance is zippier than ever. MySQL and PostgreSQL planned maintenance typically lasts less than 60 seconds and SQL Server maintenance typically lasts less than 120 seconds. You can learn more about maintenance <a href=\"https://cloud.google.com/sql/docs/mysql/maintenance\">here</a>.<br/></li><li><b>Simplifying Transfer Appliance configuration with Cloud Setup Application</b>—We’re announcing the availability of the <a href=\"https://cloud.google.com/transfer-appliance/docs/4.0/permissions-application\">Transfer Appliance Cloud Setup Application</a>. This will use the information you provide through simple prompts and configure your Google Cloud permissions, preferred Cloud Storage bucket, and Cloud KMS key for your transfer. Several cloud console based manual steps are now simplified with a command line experience. <a href=\"https://cloud.google.com/transfer-appliance/docs/4.0/permissions-application\">Read more</a>. <br/></li><li><b>Google Cloud VMware Engine is now HIPAA compliant</b>—As of April 1, 2021, Google Cloud VMware Engine is covered under the Google Cloud Business Associate Agreement (BAA), meaning it has achieved HIPAA compliance. Healthcare organizations can now migrate and run their HIPAA-compliant VMware workloads in a fully compatible VMware Cloud Verified stack running natively in Google Cloud with Google Cloud VMware Engine, without changes or re-architecture to tools, processes, or applications. <a href=\"https://cloud.google.com/blog/products/cloud-migration/google-cloud-vmware-engine-has-achieved-hipaa-compliance\">Read more</a>.<br/></li><li><b>Introducing container-native Cloud DNS</b>—Kubernetes networking almost always starts with a DNS request. DNS has broad impacts on your application and cluster performance, scalability, and resilience. That is why we are excited to announce the release of <a href=\"https://cloud.google.com/kubernetes-engine/docs/how-to/cloud-dns\">container-native Cloud DNS</a>—the native integration of Cloud DNS with Google Kubernetes Engine (GKE) to provide in-cluster Service DNS resolution with <a href=\"https://cloud.google.com/dns\">Cloud DNS</a>, our scalable and full-featured DNS service. <a href=\"https://cloud.google.com/blog/products/containers-kubernetes/integrating-cloud-dns-with-gke\">Read more</a>.</li><li><b>Welcoming the EU’s new Standard Contractual Clauses for cross-border data transfers</b>—Learn how we’re incorporating the new Standard Contractual Clauses (SCCs) into our contracts to help protect our customers’ data and meet the requirements of European privacy legislation. <a href=\"https://cloud.google.com/blog/products/compliance/eus-new-standard-contractual-clauses-to-protect-user-privacy\">Read more</a>.</li><li><b>Lowe’s meets customer demand with Google SRE practices</b>—Learn how Low’s has been able to increase the number of releases they can support by adopting Google’s <a href=\"https://sre.google/\" target=\"_blank\">Site Reliability Engineering</a> (SRE) framework and leveraging their partnership with Google Cloud. <a href=\"https://cloud.google.com/blog/products/devops-sre/how-lowes-leverages-google-sre-practices\">Read more</a>.<br/></li><li><b>What’s next for SAP on Google Cloud at SAPPHIRE NOW and beyond</b>—As <a href=\"https://reg.sapevents.sap.com/flow/sap/sapphirenow2021/portal/page/home\" target=\"_blank\">SAP’s SAPPHIRE conference</a> begins this week, we believe businesses have a more significant opportunity than ever to build for their next decade of growth and beyond. Learn more on how we’re working together with our customers, SAP, and our partners to support this transformation. <a href=\"https://cloud.google.com/blog/products/sap-google-cloud/sap-on-google-cloud-updates-at-sapphire-now-2021\">Read more</a>.</li><li><b>Support for Node.js, Python and Java repositories for <a href=\"https://cloud.google.com/artifact-registry\">Artifact Registry</a></b><b>now in Preview</b>–With today’s announcement, you can not only use Artifact Registry to secure and distribute container images, but also manage and secure your other software artifacts. <a href=\"https://cloud.google.com/blog/products/application-development/artifact-registry-adds-node-python-and-java-repositories\">Read more</a>.</li><li><b>What’s next for SAP on Google Cloud at SAPPHIRE NOW and beyond</b>—As <a href=\"https://reg.sapevents.sap.com/flow/sap/sapphirenow2021/portal/page/home\" target=\"_blank\">SAP’s SAPPHIRE conference</a> begins this week, we believe businesses have a more significant opportunity than ever to build for their next decade of growth and beyond. Learn more on how we’re working together with our customers, SAP, and our partners to support this transformation. <a href=\"https://cloud.google.com/blog/products/sap-google-cloud/sap-on-google-cloud-updates-at-sapphire-now-2021\">Read more</a>.<br/></li><li><b>Google named a Leader in The Forrester Wave: Streaming Analytics, Q2 2021 report</b>–Learn about the criteria where Google Dataflow was rated 5 out 5 and why this matters for our customers <a href=\"https://cloud.google.com/blog/products/data-analytics/dataflow-leader-forrester-wave-streaming-analytics-report-2021\">here</a>.<br/></li><li><b>Applied ML Summit this Thursday, June 10</b>–Watch our keynote to learn about predictions for machine learning over the next decade. Engage with distinguished researchers, leading practitioners, and Kaggle Grandmasters during our live Ask Me Anything session. Take part in our modeling workshops to learn how you can iterate faster, and deploy and manage your models with confidence–no matter your level of formal computer science training. Learn how to develop and apply your professional skills, grow your abilities at the pace of innovation, and take your career to the next level. <a href=\"https://cloudonair.withgoogle.com/events/summit-ml-practitioners?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY21-Q2-northam-GEM912-onlineevent-er-gc-ml-practitioners-summit&amp;utm_content=google-cloud-blog-appliedml&amp;utm_term=-\" target=\"_blank\">Register now</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of May 31-Jun 4, 2021</h3><ul><li><b>Security Command Center now supports CIS 1.1 benchmarks and granular access control</b>–<a href=\"https://cloud.google.com/security-command-center\">Security Command Center</a> (SCC) now supports <a href=\"https://www.cisecurity.org/benchmark/google_cloud_computing_platform/\" target=\"_blank\">CIS benchmarks for Google Cloud Platform Foundation v1.1</a>, enabling you to monitor and address compliance violations against industry best practices in your Google Cloud environment. Additionally, SCC now supports fine-grained access control for administrators that allows you to easily adhere to the principles of least privilege—restricting access based on roles and responsibilities to reduce risk and enabling broader team engagement to address security. <a href=\"https://cloud.google.com/blog/products/identity-security/new-capabilities-in-security-command-center-help-manage-risk\">Read more</a>.<br/></li><li><b>Zero-trust managed security for services with Traffic Director</b>–We created <a href=\"https://cloud.google.com/traffic-director\">Traffic Director</a> to bring to you a fully managed service mesh product that includes load balancing, traffic management and service discovery. And now, we’re happy to announce the availability of a fully-managed zero-trust security solution using Traffic Director with Google Kubernetes Engine (GKE) and <a href=\"https://cloud.google.com/certificate-authority-service\">Certificate Authority (CA) Service</a>. <a href=\"https://cloud.google.com/blog/products/networking/traffic-director-integrates-with-ca-service\">Read more</a>.</li><li><b>How one business modernized their data warehouse for customer success</b>–PedidosYa migrated from their old data warehouse to Google Cloud's BigQuery. Now with BigQuery, the Latin American online food ordering company has reduced the total cost per query by 5x. <a href=\"https://cloud.google.com/blog/products/data-analytics/pedidosya-cuts-cost-per-query-by-5x-using-bigquery\">Learn more</a>.</li><li><b>Announcing new Cloud TPU VMs</b>–New Cloud TPU VMs make it easier to use our <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/google-breaks-ai-performance-records-in-mlperf-with-worlds-fastest-training-supercomputer\">industry-leading TPU hardware</a> by providing direct access to TPU host machines, offering a new and improved user experience to develop and deploy TensorFlow, PyTorch, and JAX on <a href=\"https://cloud.google.com/tpu\">Cloud TPUs</a>. <a href=\"https://cloud.google.com/blog/products/compute/introducing-cloud-tpu-vms\">Read more</a>.<br/></li><li><b>Introducing logical replication and decoding for Cloud SQL for PostgreSQL</b>–We’re announcing the public preview of <a href=\"https://cloud.google.com/sql/docs/postgres/replication/configure-logical-replication\">logical replication and decoding for Cloud SQL for PostgreSQL.</a> By releasing those capabilities and enabling change data capture (CDC) from Cloud SQL for PostgreSQL, we strengthen our commitment to building an open database platform that meets critical application requirements and integrates seamlessly with <a href=\"https://cloud.google.com/sql/docs/postgres\">the PostgreSQL ecosystem</a>. <a href=\"https://cloud.google.com/blog/products/databases/you-can-now-use-cdc-from-cloudsql-for-postgresql\">Read more</a>.<br/></li><li><b>How 6 businesses are transforming with SAP on Google Cloud</b>–Thousands of organizations globally rely on SAP for their most mission critical workloads. And for many Google Cloud customers, part of a broader digital transformation journey has included accelerating the migration of these essential SAP workloads to Google Cloud for greater agility, elasticity, and uptime. <a href=\"https://cloud.google.com/blog/products/sap-google-cloud/6-businesses-transforming-sap-google-cloud\">Read six of their stories</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of May 24-May 28, 2021</h3><ul><li><b>Google Cloud for financial services: driving your transformation cloud journey</b>–As we welcome the industry to our Financial Services Summit, we’re sharing more on how Google Cloud accelerates a financial organization’s digital transformation through app and infrastructure modernization, data democratization, people connections, and trusted transactions. <a href=\"https://cloud.google.com/blog/topics/financial-services/helping-the-financial-services-industry-transform\">Read more</a> or <a href=\"https://cloudonair.withgoogle.com/events/summit-finserv?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY21-Q2-NORTHAM-summit-onlineevent-er-gc-finserve&amp;utm_content=finserv_lp&amp;utm_term=-\" target=\"_blank\">watch the summit on demand</a>.<br/></li><li><b>Introducing Datashare solution for financial services</b>–We announced the general availability of <a href=\"https://cloud.google.com/solutions/financial-services/datashare\">Datashare</a> for financial services, a new Google Cloud solution that brings together the entire capital markets ecosystem—data publishers and data consumers—to exchange market data securely and easily. <a href=\"https://cloud.google.com/blog/topics/financial-services/announcing-the-general-availability-of-datashare\">Read more</a>.</li><li><b>Announcing Datastream in Preview</b>–<a href=\"http://cloud.google.com/datastream\">Datastream</a>, a serverless change data capture (CDC) and replication service, allows enterprises to synchronize data across heterogeneous databases, storage systems, and applications reliably and with minimal latency to support real-time analytics, database replication, and event-driven architectures. <a href=\"https://cloud.google.com/blog/products/databases/new-cloud-based-cdc-replication-across-databases\">Read more</a>.</li><li><b>Introducing Dataplex: An intelligent data fabric for analytics at scale</b>–<a href=\"http://cloud.google.com/dataplex\">Dataplex</a> provides a way to centrally manage, monitor, and govern your data across data lakes, data warehouses and data marts, and make this data securely accessible to a variety of analytics and data science tools. <a href=\"https://cloud.google.com/blog/products/data-analytics/introducing-google-cloud-dataplex\">Read more</a>. </li><li><b>Announcing Dataflow Prime</b>–Available in Preview in Q3 2021, Dataflow Prime is a new platform based on a serverless, no-ops, auto-tuning architecture built to bring unparalleled resource utilization and radical operational simplicity to big data processing. Dataflow Prime builds on Dataflow and brings new user benefits with innovations in resource utilization and distributed diagnostics. The new capabilities in Dataflow significantly reduce the time spent on infrastructure sizing and tuning tasks, as well as time spent diagnosing data freshness problems. <a href=\"https://cloud.google.com/blog/products/data-analytics/simplify-and-automate-data-processing-with-dataflow-prime\">Read more</a>.</li><li><b>Secure and scalable sharing for data and analytics with Analytics Hub</b>–With <a href=\"http://cloud.google.com/analytics-hub\">Analytics Hub</a>, available in Preview in Q3, organizations get a rich data ecosystem by publishing and subscribing to analytics-ready datasets; control and monitoring over how their data is being used; a self-service way to access valuable and trusted data assets; and an easy way to monetize their data assets without the overhead of building and managing the infrastructure. <a href=\"https://cloud.google.com/blog/products/data-analytics/introducing-analytics-hub-for-data-analytics-exchanges\">Read more</a>.</li><li><b>Cloud Spanner trims entry cost by 90%</b>–Coming soon to Preview, granular instance sizing in Spanner lets organizations run workloads at as low as 1/10th the cost of regular instances, equating to approximately $65/month. <a href=\"https://cloud.google.com/blog/products/databases/get-more-out-of-spanner-with-granular-instance-sizing\">Read more</a>.</li><li><b>Cloud Bigtable lifts SLA and adds new security features for regulated industries</b>–Bigtable instances with a multi-cluster routing policy across 3 or more regions are now covered by a 99.999% monthly uptime percentage under the new SLA. In addition, new Data Access audit logs can help determine whether sensitive customer information has been accessed in the event of a security incident, and if so, when, and by whom. <a href=\"https://cloud.google.com/blog/products/databases/bigtable-lifts-sla-and-adds-new-security-features\">Read more</a>.</li><li><b>Build a no-code journaling app</b>–In honor of Mental Health Awareness Month, Google Cloud's no-code application development platform, AppSheet, demonstrates how you can build a journaling app complete with titles, time stamps, mood entries, and more. Learn how with this blog and video <a href=\"https://blog.google/products/google-cloud/create-your-own-journaling-app-without-writing-code/\" target=\"_blank\">here</a>.<br/></li><li><b>New features in Security Command Center</b>—On May 24th, Security Command Center Premium launched the general availability of granular <a href=\"https://youtu.be/WlsAMwrHCFA\" target=\"_blank\">access controls at project- and folder-level</a> and Center for Internet Security (CIS) 1.1 benchmarks for Google Cloud Platform Foundation. These new capabilities enable organizations to improve their security posture and efficiently manage risk for their Google Cloud environment. <a href=\"https://cloud.google.com/security-command-center/docs/release-notes#May_24_2021\">Learn more</a>.<br/></li><li><b>Simplified API operations with AI</b>–Google Cloud's API management platform Apigee applies Google's industry leading ML and AI to your API metadata. Understand how it works with anomaly detection <a href=\"https://cloud.google.com/blog/products/api-management/apigee-x-simplifies-api-management-with-ai\">here</a>.<br/></li><li><b>This week: Data Cloud and Financial Services Summits</b>–Our <a href=\"https://cloudonair.withgoogle.com/summit_series_21?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=-&amp;utm_content=collections-page&amp;utm_term=-\" target=\"_blank\">Google Cloud Summit series</a> begins this week with the <b>Data Cloud Summit</b> on Wednesday May 26 (<a href=\"https://cloudonair.withgoogle.com/events/summit-data-cloud?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY21-Q2-NORTHAM-summit-onlineevent-er-gc-data-cloud-summit&amp;utm_content=data_cloud_lp&amp;utm_term=-\" target=\"_blank\">Global</a>). At this half-day event, you’ll learn how leading companies like PayPal, Workday, Equifax, and many others are driving competitive differentiation using Google Cloud technologies to build their data clouds and transform data into value that drives innovation. The following day, Thursday May 27 (<a href=\"https://cloudonair.withgoogle.com/events/summit-finserv?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY21-Q2-NORTHAM-summit-onlineevent-er-gc-finserve&amp;utm_content=finserv_lp&amp;utm_term=-\" target=\"_blank\">Global</a> &amp; <a href=\"https://cloudonair.withgoogle.com/events/summit-emea-finserv?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY21-Q2-emea-summit-onlineevent-er-gc-finserve-emea&amp;utm_content=finserv_emea_lp&amp;utm_term=-\" target=\"_blank\">EMEA</a>) at the <b>Financial Services Summit</b>, discover how Google Cloud is helping financial institutions such as PayPal, Global Payments, HSBC, Credit Suisse, AXA Switzerland and more unlock new possibilities and accelerate business through innovation. <a href=\"https://cloud.google.com/blog/topics/events/news-updates-on-the-google-cloud-summit-digital-event-series-2021\">Read more</a> and <a href=\"https://cloudonair.withgoogle.com/summit_series_21?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=-&amp;utm_content=collections-page&amp;utm_term=-\" target=\"_blank\">explore the entire summit series</a>.</li><li><p><b>Announcing the Google for Games Developer Summit 2021 on July 12th-13th</b>–With a surge of new gamers and an increase in time spent playing games in the last year, it’s more important than ever for game developers to delight and engage players. To help developers with this opportunity, the games teams at Google are back to announce the return of the Google for Games Developer Summit 2021 on July 12th-13th. Hear from experts across Google about new game solutions they’re building to make it easier for you to continue creating great games, connecting with players and scaling your business. Registration is free and open to all game developers. Register for the free online event at <a href=\"https://developersonair.withgoogle.com/events/game-dev-summit-2021\" target=\"_blank\">g.co/gamedevsummit</a> to get more details in the coming weeks. We can’t wait to share our latest innovations with the developer community. <a href=\"https://developersonair.withgoogle.com/events/game-dev-summit-2021\" target=\"_blank\">Learn more</a>.</p></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of May 17-May 21, 2021</h3><ul><li><p><b>Best practices to protect your organization against ransomware threats</b>–For more than 20 years Google has been operating securely in the cloud, using our modern technology stack to provide a more defensible environment that we can protect at scale. While the threat of ransomware isn’t new, our responsibility to help protect you from existing or emerging threats never changes. In our recent blog post, we shared guidance on how organizations can increase their resilience to ransomware and how some of our Cloud products and services can help. <a href=\"https://cloud.google.com/blog/products/identity-security/5-pillars-of-protection-to-prevent-ransomware-attacks\">Read more</a>.<br/></p></li><li><b>Forrester names Google Cloud a Leader in Unstructured Data Security Platforms</b>–Forrester Research has named Google Cloud a Leader in The Forrester Wave: Unstructured Data Security Platforms, Q2 2021 report, and rated Google Cloud highest in the current offering category among the providers evaluated. <a href=\"https://cloud.google.com/blog/products/identity-security/google-a-leader-in-unstructured-data-security-platforms\">Read more</a> or <a href=\"https://cloud.google.com/resources/forrester-unstructured-data-security-2021-report\">download the report</a>.<br/></li><li><b>Introducing Vertex AI: One platform, every ML tool you need</b>–<a href=\"https://cloud.google.com/vertex-ai\">Vertex AI</a> is a managed machine learning (ML) platform that allows companies to accelerate the deployment and maintenance of artificial intelligence (AI) models. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/google-cloud-launches-vertex-ai-unified-platform-for-mlops\">Read more</a>.</li><li><b>Transforming collaboration in Google Workspace</b>–We’re launching smart canvas, a new product experience that delivers the next evolution of collaboration for Google Workspace. Between now and the end of the year, we’re rolling out innovations that make it easier for people to stay connected, focus their time and attention, and transform their ideas into impact. <a href=\"https://cloud.google.com/blog/products/workspace/next-evolution-of-collaboration-for-google-workspace\">Read more</a>.<br/></li><li><b>Developing next-generation geothermal power</b>–At I/O this week, we announced a first-of-its-kind, next-generation geothermal project with clean-energy startup Fervo that will soon begin adding carbon-free energy to the electric grid that serves our data centers and infrastructure throughout Nevada, including our Cloud region in Las Vegas. <a href=\"https://cloud.google.com/blog/products/infrastructure/google-fervo-geothermal-project-creates-carbon-free-energy\">Read more</a>.<br/></li><li><b>Contributing to an environment of trust and transparency in Europe</b>–Google Cloud was one of the first cloud providers to support and adopt the <a href=\"https://scope-europe.eu/en/projects/eu-cloud-code-of-conduct/\" target=\"_blank\">EU GDPR Cloud Code of Conduct </a>(CoC). The CoC is a mechanism for cloud providers to demonstrate how they offer sufficient guarantees to implement appropriate technical and organizational measures as data processors under the GDPR. This week, the Belgian Data Protection Authority, based on a positive opinion by the <a href=\"https://edpb.europa.eu/about-edpb/about-edpb/who-we-are_en\" target=\"_blank\">European Data Protection Board</a> (EDPB), <a href=\"https://www.autoriteprotectiondonnees.be/lautorite-de-protection-des-donnees-approuve-son-premier-code-de-conduite-europeen\" target=\"_blank\">approved</a> the CoC, a product of years of constructive collaboration between the cloud computing community, the European Commission, and European data protection authorities. We are proud to say that <a href=\"https://cloud.google.com/terms/services\">Google Cloud Platform</a> and <a href=\"https://workspace.google.com/intl/en/terms/user_features.html\" target=\"_blank\">Google Workspace</a> already <a href=\"https://cloud.google.com/security/compliance/eu-cloud-code-of-conduct\">adhere</a> to these provisions. <a href=\"https://cloud.google.com/blog/products/compliance/google-cloud-adopts-eu-gdpr-cloud-code-of-conduct\">Learn more</a>.<br/></li><li><b>Announcing Google Cloud datasets solutions</b>–We're adding commercial, synthetic, and first-party data to our <a href=\"https://cloud.google.com/solutions/datasets\">Google Cloud Public Datasets Program</a> to help organizations increase the value of their analytics and AI initiatives, and we're making available an <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/datasets-google-cloud-introducing-our-new-reference-architecture\">open source reference architecture</a> for a more streamlined data onboarding process to the program. <a href=\"https://cloud.google.com/blog/products/data-analytics/datasets-for-enriching-analytics-ai-initiatives\">Read more</a>.<br/></li><li><b>Introducing custom samples in Cloud Code</b>–With new <a href=\"https://cloud.google.com/code/docs/intellij/set-up-template-repo\">custom samples</a> in <a href=\"https://cloud.google.com/code\">Cloud Code</a>, developers can quickly access your enterprise’s best code samples via a versioned Git repository directly from their IDEs. <a href=\"https://cloud.google.com/blog/products/application-development/access-an-orgs-custom-code-repo-from-cloud-code-ides\">Read more</a>.<br/></li><li><b>Retention settings for Cloud SQL</b>–Cloud SQL now allows you to configure backup retention settings to protect against data loss. You can retain between 1 and 365 days’ worth of automated backups and between 1 and 7 days’ worth of transaction logs for point-in-time recovery. See the details <a href=\"https://cloud.google.com/sql/docs/postgres/backup-recovery/backups#retention\">here</a>.<br/></li><li><b>Cloud developer’s guide to Google I/O 2021</b>–<a href=\"https://events.google.com/io/?lng=en\" target=\"_blank\">Google I/O</a> may look a little different this year, but don’t worry, you’ll still get the same first-hand look at the newest launches and projects coming from Google. Best of all, it’s free and available to all (virtually) on May 18-20. <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/cloud-developers-guide-google-io-2021\">Read more</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of May 10-May 14, 2021</h3><ul><li><b>APIs and Apigee power modern day due diligence</b>–With APIs and Google Cloud's Apigee, business due diligence company DueDil revolutionized the way they harness and share their Big Information Graph (B.I.G.) with partners and customers. <a href=\"https://cloud.google.com/blog/products/apigee/google-cloud-helps-duedil-to-deliver-data-insights-at-scale\">Get the full story</a>.<br/></li><li><b>Cloud CISO Perspectives: May 2021</b>–It’s been a busy month here at Google Cloud since our inaugural CISO perspectives blog post in April. Here, VP and CISO of Google Cloud Phil Venables recaps our cloud security and industry highlights, a sneak peak of what’s ahead from Google at RSA, and more. <a href=\"https://cloud.google.com/blog/products/identity-security/cloud-ciso-perspectives-may-2021\">Read more</a>.</li><li><b>4 new features to secure your Cloud Run services</b>–We announced several new ways to secure Cloud Run environments to make developing and deploying containerized applications easier for developers. <a href=\"https://cloud.google.com/blog/products/serverless/improving-the-security-of-your-cloud-run-environment\">Read more</a>.</li><li><b>Maximize your Cloud Run investments with new committed use discounts</b>–We’re introducing self-service spend-based <a href=\"https://cloud.google.com/run/cud\">committed use discounts for Cloud Run</a>, which let you commit for a year to spending a certain amount on Cloud Run and benefiting from a 17% discount on the amount you committed. <a href=\"https://cloud.google.com/blog/products/serverless/introducing-committed-use-discounts-for-cloud-run\">Read more</a>.</li><li><b>Google Cloud Armor Managed Protection Plus is now generally available</b>–Cloud Armor, our Distributed Denial of Service (DDoS) protection and Web-Application Firewall (WAF) service on Google Cloud, leverages the same infrastructure, network, and technology that has protected Google’s internet-facing properties from some of the <a href=\"https://cloud.google.com/blog/products/identity-security/identifying-and-protecting-against-the-largest-ddos-attacks\">largest attacks ever reported</a>. These same tools protect customers’ infrastructure from DDoS attacks, which are increasing in both magnitude and complexity every year. Deployed at the very edge of our network, Cloud Armor absorbs malicious network- and protocol-based volumetric attacks, while mitigating the <a href=\"https://owasp.org/www-project-top-ten/\" target=\"_blank\">OWASP Top 10 risks</a> and maintaining the availability of protected services. <a href=\"https://cloud.google.com/blog/products/identity-security/google-cloud-armor-managed-protection-plus-is-now-ga\">Read more</a>.<br/></li><li><b>Announcing Document Translation for Translation API Advanced in preview</b>–Translation is critical to many developers and localization providers, whether you’re releasing a document, a piece of software, training materials or a website in multiple languages. With Document Translation, now you can directly translate documents in 100+ languages and formats such as Docx, PPTx, XLSx, and PDF while preserving document formatting. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/google-cloud-ai-translation-services-works-for-documents\">Read more</a>.<br/></li><li><b>Introducing BeyondCorp Enterprise protected profiles</b>–Protected profiles enable users to securely access corporate resources from an unmanaged device with the same threat and data protections available in BeyondCorp Enterprise–all from the Chrome Browser. <a href=\"https://cloud.google.com/blog/products/identity-security/new-protected-profiles-enable-remote-work-with-zero-trust\">Read more</a>.<br/></li><li><b>How reCAPTCHA Enterprise protects unemployment and COVID-19 vaccination portals</b>–With so many people visiting government websites to learn more about the COVID-19 vaccine, make vaccine appointments, or file for unemployment, these web pages have become prime targets for bot attacks and other abusive activities. But reCAPTCHA Enterprise has helped state governments protect COVID-19 vaccine registration portals and unemployment claims portals from abusive activities. <a href=\"https://cloud.google.com/blog/products/identity-security/recaptcha-protects-public-services\">Learn more</a>.</li><li><b>Day one with Anthos? Here are 6 ideas for how to get started</b>–Once you have your new application platform in place, there are some things you can do to immediately get value and gain momentum. Here are six things you can do to get you started. <a href=\"https://cloud.google.com/blog/topics/anthos/6-initiatives-to-start-on-your-day-one-anthos-journey\">Read more</a>.</li><li><b>The era of the transformation cloud is here</b>–Google Cloud’s president Rob Enslin shares how the era of the transformation cloud has seen organizations move beyond data centers to change not only where their business is done but, more importantly, how it is done. <a href=\"https://cloud.google.com/blog/topics/inside-google-cloud/innovation-in-the-era-of-the-transformation-cloud\">Read more</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3></h3><h3>Week of May 3-May 7, 2021</h3><ul><li><b>Transforming hard-disk drive maintenance with predictive ML</b>–In collaboration with Seagate, we developed a machine learning system that can forecast the probability of a recurring failing disk—a disk that fails or has experienced three or more problems in 30 days. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/seagate-and-google-predict-hard-disk-drive-failures-with-ml\">Learn how we did it</a>.<br/></li><li><b>Agent Assist for Chat is now in public preview</b>–<a href=\"https://cloud.google.com/agent-assist\">Agent Assist</a> provides your human agents with continuous support during their calls, and now chats, by identifying the customers’ intent and providing them with real-time recommendations such as articles and FAQs as well as responses to customer messages to more effectively resolve the conversation. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/contact-center-ai-agent-assist-for-chat-is-now-in-public-preview\">Read more</a>.</li><li><b>New Google Cloud, AWS, and Azure product map</b>–Our updated product map helps you understand similar offerings from Google Cloud, AWS, and Azure, and you can easily filter the list by product name or other common keywords. <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/handy-new-google-cloud-aws-and-azure-product-map\">Read more</a> or <a href=\"https://cloud.google.com/free/docs/aws-azure-gcp-service-comparison?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY21-Q2-Product-Mapping-Blog&amp;utm_content=documentation\">view the map</a>.</li><li><b>Join our Google Cloud Security Talks on May 12th</b>–We’ll share expert insights into how we’re working to be your most <a href=\"https://cloud.google.com/blog/products/identity-security/delivering-the-industrys-most-trusted-cloud\">trusted cloud</a>. Find the list of topics we’ll cover <a href=\"https://cloud.google.com/blog/products/identity-security/google-cloud-security-talks-q2-2021\">here</a>.</li><li><b>Databricks is now GA on Google Cloud</b>–Deploy or migrate Databricks Lakehouse to Google Cloud to combine the benefits of an open data cloud platform with greater analytics flexibility, unified infrastructure management, and optimized performance. <a href=\"https://cloud.google.com/blog/products/data-analytics/databricks-on-google-cloud-now-ga\">Read more</a>.</li><li><b>HPC VM image is now GA</b>–The CentOS-based HPC VM image makes it quick and easy to create HPC-ready VMs on Google Cloud that are pre-tuned for optimal performance. Check out our <a href=\"http://cloud.google.com/compute/docs/instances/create-hpc-vm\">documentation and quickstart guide</a> to start creating instances using the HPC VM image today.<br/></li><li><b>Take the 2021 State of DevOps survey</b>–Help us shape the future of DevOps and make your voice heard by completing the 2021 State of DevOps survey before June 11, 2021. <a href=\"https://cloud.google.com/blog/products/devops-sre/take-2021-state-devops-survey-shape-future-devops\">Read more</a> or <a href=\"https://google.qualtrics.com/jfe/form/SV_cIb0SmhJPfm8H7n\" target=\"_blank\">take the survey</a>.</li><li><b>OpenTelemetry Trace 1.0 is now available</b>–OpenTelemetry has reached a key milestone: the OpenTelemetry Tracing Specification has reached version <a href=\"https://github.com/open-telemetry/opentelemetry-specification\" target=\"_blank\">1.0</a>. API and SDK release candidates are available for <a href=\"https://github.com/open-telemetry/opentelemetry-java\" target=\"_blank\">Java</a>, <a href=\"https://github.com/open-telemetry/opentelemetry-erlang\" target=\"_blank\">Erlang</a>, <a href=\"https://github.com/open-telemetry/opentelemetry-python\" target=\"_blank\">Python</a>, <a href=\"https://github.com/open-telemetry/opentelemetry-go\" target=\"_blank\">Go</a>, <a href=\"https://github.com/open-telemetry/opentelemetry-js\" target=\"_blank\">Node.js</a>, and <a href=\"https://github.com/open-telemetry/opentelemetry-dotnet\" target=\"_blank\">.Net</a>. Additional languages will follow over the next few weeks. <a href=\"https://cloud.google.com/blog/products/operations/opentelemetry-specification-enables-standardized-tracing\">Read more</a>.</li><li><b>New blueprint helps secure confidential data in AI Platform Notebooks</b>–We’re adding to our portfolio of blueprints with the publication of our <a href=\"https://cloud.google.com/architecture/blueprints/protecting-confidential-data-in-ai-platform-notebooks\">Protecting confidential data in AI Platform Notebooks blueprint guide</a> and <a href=\"https://github.com/GoogleCloudPlatform/notebooks-blueprint-security\" target=\"_blank\">deployable blueprint</a>, which can help you apply data governance and security policies that protect your AI Platform Notebooks containing confidential data. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/ai-platform-notebooks-security-blueprint\">Read more</a>.</li><li><b>The Liquibase Cloud Spanner extension is now GA</b>–<a href=\"https://www.liquibase.org/\" target=\"_blank\">Liquibase</a>, an open-source library that works with a wide variety of databases, can be used for tracking, managing, and automating database schema changes. By providing the ability to integrate databases into your CI/CD process, Liquibase helps you more fully adopt <a href=\"https://cloud.google.com/devops\">DevOps</a> practices. The Liquibase Cloud Spanner extension allows developers to use Liquibase's open-source database library to manage and automate schema changes in Cloud Spanner. <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/include-cloud-spanner-databases-your-cicd-process-liquibase-extension\">Read more</a>.<br/></li><li><b>Cloud computing 101: Frequently asked questions</b>–There are a number of terms and concepts in cloud computing, and not everyone is familiar with all of them. To help, we’ve put together a list of common questions, and the meanings of a few of those acronyms. <a href=\"https://cloud.google.com/blog/topics/inside-google-cloud/cloud-computing-101-frequently-asked-questions\">Read more</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Apr 26-Apr 30, 2021</h3><ul><li><b>Announcing the GKE Gateway controller, in Preview</b>–GKE Gateway controller, Google Cloud’s implementation of the Gateway API, manages internal and external HTTP/S load balancing for a GKE cluster or a fleet of GKE clusters and provides multi-tenant sharing of load balancer infrastructure with centralized admin policy and control. <a href=\"https://cloud.google.com/blog/products/containers-kubernetes/new-gke-gateway-controller-implements-kubernetes-gateway-api\">Read more</a>.<br/></li><li><b>See Network Performance for Google Cloud in Performance Dashboard</b>–The <a href=\"https://console.cloud.google.com/net-intelligence/performance/global-dashboard/packet-loss\">Google Cloud performance view</a>, part of the Network Intelligence Center, provides packet loss and latency metrics for traffic on Google Cloud. It allows users to do informed planning of their deployment architecture, as well as determine in real time the answer to the most common troubleshooting question: \"Is it Google or is it me?\" The Google Cloud performance view is now open for all Google Cloud customers as a public preview. <a href=\"https://console.cloud.google.com/net-intelligence/performance/global-dashboard/packet-loss\">Check it out</a>.</li><li><b>Optimizing data in Google Sheets allows users to create no-code apps</b>–Format columns and tables in Google Sheets to best position your data to transform into a fully customized, successful app–no coding necessary. Read our four best Google Sheets <a href=\"https://cloud.google.com/blog/products/no-code-development/turn-google-sheet-data-into-a-no-code-web-app-with-appsheet\">tips.</a><br/></li><li><b>Automation bots with AppSheet Automation</b>–AppSheet recently released <a href=\"https://cloud.google.com/blog/products/no-code-development/automation-no-code-appsheet-and-google-cloud\">AppSheet Automation</a>, infusing Google AI capabilities to AppSheet's trusted no-code app development platform. Learn step by step how to build your first automation bot on AppSheet <a href=\"https://cloud.google.com/blog/products/no-code-development/automation-bots-with-appsheet-and-no-code\">here.</a> <br/></li><li><b>Google Cloud announces a new region in Israel</b>–Our new region in Israel will make it easier for customers to serve their own users faster, more reliably and securely. <a href=\"https://cloud.google.com/blog/products/infrastructure/new-google-cloud-region-in-israel\">Read more</a>.<br/></li><li><b>New multi-instance NVIDIA GPUs on GKE</b>–We’re launching support for multi-instance GPUs in GKE (currently in Preview), which will help you drive better value from your GPU investments. <a href=\"https://cloud.google.com/blog/products/containers-kubernetes/gke-now-supports-multi-instance-gpus\">Read more</a>.</li><li><b>Partnering with NSF to advance networking innovation</b>–We announced our partnership with the U.S. National Science Foundation (NSF), joining other industry partners and federal agencies, as part of a combined $40 million investment in academic research for <a href=\"https://www.nsf.gov/news/special_reports/announcements/042721.jsp\" target=\"_blank\">Resilient and Intelligent Next-Generation (NextG) Systems</a>, or RINGS. <a href=\"https://cloud.google.com/blog/products/networking/google-partnering-with-nsf-to-innovate-networking\">Read more</a>.</li><li><b>Creating a policy contract with Configuration as Data</b>–Configuration as Data is an emerging cloud infrastructure management paradigm that allows developers to <a href=\"https://cloud.google.com/blog/products/containers-kubernetes/understanding-configuration-as-data-in-kubernetes\">declare the desired state</a> of their applications and infrastructure, without specifying the precise actions or steps for how to achieve it. However, declaring a configuration is only half the battle: you also want policy that defines how a configuration is to be used. <a href=\"https://cloud.google.com/blog/products/containers-kubernetes/how-configuration-as-data-impacts-policy\">This post shows you how</a>.<br/></li><li><b>Google Cloud products deliver real-time data solutions</b>–Seven-Eleven Japan built Seven Central, its new platform for digital transformation, on Google Cloud. Powered by BigQuery, Cloud Spanner, and Apigee API management, Seven Central presents easy to understand data, ultimately allowing for quickly informed decisions. Read their story <a href=\"https://cloud.google.com/blog/products/data-analytics/how-7-eleven-japan-built-its-new-data-platform\">here</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Apr 19-Apr 23, 2021</h3><p></p><p></p><ul><li><p><b>Extreme PD is now GA</b>–On April 20th, Google Cloud’s <a href=\"https://cloud.google.com/persistent-disk\">Persistent Disk</a> launched general availability of Extreme PD, a high performance block storage volume with provisioned IOPS and up to 2.2 GB/s of throughput. <a href=\"https://cloud.google.com/compute/docs/disks/extreme-persistent-disk\">Learn more</a>.<br/></p></li><li><p><b>Research: How data analytics and intelligence tools to play a key role post-COVID-19</b>–A recent <a href=\"https://inthecloud.withgoogle.com/it-leaders-research-21/overview-dl-cd.html?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY21-Q1-NORTHAM-demandgen-website-wd-gcp_gtm_reimagine_master&amp;utm_content=homepage\" target=\"_blank\">Google-commissioned study by IDG</a> highlighted the role of data analytics and intelligent solutions when it comes to helping businesses separate from their competition. The survey of 2,000 IT leaders across the globe reinforced the notion that the ability to derive insights from data will go a long way towards determining which companies win in this new era. <a href=\"https://cloud.google.com/blog/products/data-analytics/post-covid-data-analytics-and-intelligence-tools\">Learn more</a> or <a href=\"https://inthecloud.withgoogle.com/it-leaders-research-21/overview-dl-cd.html?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY21-Q1-NORTHAM-demandgen-website-wd-gcp_gtm_reimagine_master&amp;utm_content=homepage\" target=\"_blank\">download the study</a>.</p></li><li><p><b>Introducing PHP on Cloud Functions</b>–We’re bringing support for PHP, a popular general-purpose programming language, to Cloud Functions. With the Functions Framework for PHP, you can write idiomatic PHP functions to build business-critical applications and integration layers. And with Cloud Functions for PHP, now available in Preview, you can deploy functions in a fully managed PHP 7.4 environment, complete with access to resources in a private VPC network. <a href=\"https://cloud.google.com/blog/products/application-development/php-comes-to-cloud-functions\">Learn more</a>.</p></li><li><p><b>Delivering our 2020 CCAG pooled audit</b>–As our customers increased their use of cloud services to <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/what-zero-trust-identity-security\">meet the demands of teleworking</a> and<a href=\"https://cloud.google.com/blog/topics/public-sector/getting-vaccines-local-communities-safely-and-effectively\"> aid in COVID-19 recovery</a>, we’ve worked hard to meet our commitment to being the industry’s most <a href=\"https://cloud.google.com/blog/products/identity-security/delivering-the-industrys-most-trusted-cloud\">trusted cloud</a>, despite the global pandemic. We’re proud to announce that Google Cloud completed an annual pooled audit with the CCAG in a completely remote setting, and were the only cloud service provider to do so in 2020. <a href=\"https://cloud.google.com/blog/products/compliance/google-completes-annual-pooled-audit-with-ccag-completely-remote\">Learn more</a>.</p></li><li><p><b>Anthos 1.7 now available</b>–We recently released Anthos 1.7, our run-anywhere Kubernetes platform that’s connected to Google Cloud, delivering an array of capabilities that make multicloud more accessible and sustainable. <a href=\"https://cloud.google.com/blog/topics/anthos/whats-new-in-anthos\">Learn more</a>.</p></li><li><p><b>New Redis Enterprise for Anthos and GKE</b>–We’re making Redis Enterprise for Anthos and Google Kubernetes Engine (GKE) available in the Google Cloud Marketplace in private preview. <a href=\"https://cloud.google.com/blog/products/containers-kubernetes/redis-enterprise-available-for-gke-and-anthos\">Learn more</a>.</p></li><li><p><b>Updates to Google Meet</b>–We introduced a refreshed user interface (UI), enhanced reliability features powered by the latest Google AI, and tools that make meetings more engaging—even fun—for everyone involved. <a href=\"https://cloud.google.com/blog/products/google-meet/new-features-for-google-meet\">Learn more</a>.</p></li><li><p><b>DocAI solutions now generally available</b>–<a href=\"https://cloud.google.com/document-ai\">Document (Doc) AI platform</a>, <a href=\"https://cloud.google.com/solutions/lending-doc-ai\">Lending DocAI</a> and <a href=\"https://cloud.google.com/solutions/procurement-doc-ai\">Procurement DocAI</a>, built on decades of AI innovation at Google, bring powerful and useful solutions across lending, insurance, government and other industries. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/get-more-value-from-your-documents-with-docai-and-industry-solutions\">Learn more</a>.</p></li><li><p><b>Four consecutive years of 100% renewable energy</b>–In 2020, Google again matched 100 percent of its global electricity use with purchases of renewable energy. All told, we’ve signed agreements to buy power from more than 50 renewable energy projects, with a combined capacity of 5.5 gigawatts–about the same as a million solar rooftops. <a href=\"https://cloud.google.com/blog/topics/sustainability/google-achieves-four-consecutive-years-of-100-percent-renewable-energy\">Learn more</a>.</p></li><li><p><b>Announcing the Google Cloud region picker</b>–The <a href=\"https://gcp-region-picker.web.app/\" target=\"_blank\">Google Cloud region picker</a> lets you assess key inputs like price, latency to your end users, and carbon footprint to help you choose which Google Cloud region to run on. <a href=\"https://cloud.google.com/blog/topics/sustainability/google-cloud-region-picker-helps-you-make-the-green-choice\">Learn more</a>.</p></li><li><b>Google Cloud launches new security solution WAAP</b>–WebApp and API Protection (WAAP) combines Google Cloud Armor, Apigee, and reCAPTCHA Enterprise to deliver improved threat protection, consolidated visibility, and greater operational efficiencies across clouds and on-premises environments. Learn more about WAAP <a href=\"https://cloud.google.com/blog/products/api-management/better-app-security-with-google-clouds-waap\">here</a>.<br/></li><li><b>New in no-code</b>–As discussed in our recent article, no-code hackathons are trending among innovative organizations. Since then, we've outlined how you can host one yourself specifically designed for your unique business innovation outcomes. Learn how <a href=\"https://cloud.google.com/blog/products/no-code-development/no-code-hackathon-tips-and-best-practices\">here</a>.<br/></li><li><b>Google Cloud Referral Program now available</b>—Now you can share the power of Google Cloud and earn product credit for every new paying customer you refer. Once you join the program, you’ll get a unique referral link that you can share with friends, clients, or others. Whenever someone signs up with your link, they’ll get a $350 product credit—that’s $50 more than the standard trial credit. When they become a paying customer, we’ll reward you with a $100 product credit in your Google Cloud account. Available in the United States, Canada, Brazil, and Japan. <a href=\"https://cloud.google.com/referral-program#apply-now\">Apply for the Google Cloud Referral Program</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Apr 12-Apr 16, 2021</h3><p></p><ul><li><b>Announcing the Data Cloud Summit, May 26, 2021</b>–At this half-day event, you’ll learn how leading companies like PayPal, Workday, Equifax, Zebra Technologies, Commonwealth Care Alliance and many others are driving competitive differentiation using Google Cloud technologies to build their data clouds and transform data into value that drives innovation. <a href=\"https://cloud.google.com/blog/topics/events/news-updates-on-the-google-cloud-summit-digital-event-series-2021\">Learn more</a> and <a href=\"https://cloudonair.withgoogle.com/events/summit-data-cloud\" target=\"_blank\">register at no cost</a>.<br/></li><li><b>Announcing the Financial Services Summit, May 27, 2021</b>–In this 2 hour event, you’ll learn how Google Cloud is helping financial institutions including PayPal, Global Payments, HSBC, Credit Suisse, and more unlock new possibilities and accelerate business through innovation and better customer experiences. <a href=\"https://cloud.google.com/blog/topics/events/news-updates-on-the-google-cloud-summit-digital-event-series-2021\">Learn more</a> and register for free: <a href=\"https://cloudonair.withgoogle.com/events/summit-finserv\" target=\"_blank\">Global</a> &amp; <a href=\"https://cloudonair.withgoogle.com/events/summit-emea-finserv\" target=\"_blank\">EMEA</a>.<br/></li><li><b>How Google Cloud is enabling vaccine equity</b>–In our latest update, we share more on how we’re working with US state governments to help produce equitable vaccination strategies at scale. <a href=\"https://cloud.google.com/blog/topics/public-sector/how-google-cloud-enabling-vaccine-equity\">Learn more</a>.<br/></li><li><b>The new Google Cloud region in Warsaw is open</b>–The Google Cloud region in Warsaw is now ready for business, opening doors for organizations in Central and Eastern Europe. <a href=\"https://cloud.google.com/blog/products/infrastructure/google-cloud-region-in-warsaw-poland-is-now-open\">Learn more</a>.<br/></li><li><b>AppSheet Automation is now GA</b>–Google Cloud’s AppSheet launches general availability of AppSheet Automation, a unified development experience for citizen and professional developers alike to build custom applications with automated processes, all without coding. Learn how companies and employees are reclaiming their time and talent with AppSheet Automation <a href=\"https://cloud.google.com/blog/products/no-code-development/automation-no-code-appsheet-and-google-cloud\">here.</a><br/></li><li><b>Introducing SAP Integration with Cloud Data Fusion</b>–Google Cloud native data integration platform Cloud Data Fusion now offers the capability to seamlessly get data out of SAP Business Suite, SAP ERP and S/4HANA. <a href=\"https://cloud.google.com/blog/products/data-analytics/introducing-sap-integration-cloud-data-fusion\">Learn more</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Apr 5-Apr 9, 2021<br/></h3><p></p><ul><li><b>New Certificate Authority Service (CAS) whitepaper</b>–“How to deploy a secure and reliable public key infrastructure with Google Cloud Certificate Authority Service” (written by Mark Cooper of PKI Solutions and Anoosh Saboori of Google Cloud) covers security and architectural recommendations for the use of the Google Cloud CAS by organizations, and describes critical concepts for securing and deploying a PKI based on CAS. <a href=\"https://cloud.google.com/blog/products/identity-security/how-to-deploy-google-cas-whitepaper\">Learn more</a> or read the <a href=\"https://services.google.com/fh/files/misc/deploying_public_key_infrastructure_with_cas.pdf\" target=\"_blank\">whitepaper</a>.<br/></li><li><b>Active Assist’s new feature, <i>predictive autoscaling</i>, helps improve response times for your applications</b>–When you enable predictive autoscaling, Compute Engine forecasts future load based on your Managed Instance Group’s (MIG) history and scales it out in advance of predicted load, so that new instances are ready to serve when the load arrives. Without predictive autoscaling, an autoscaler can only scale a group reactively, based on observed changes in load in real time. With predictive autoscaling enabled, the autoscaler works with real-time data as well as with historical data to cover both the current and forecasted load. That makes predictive autoscaling ideal for those apps with long initialization times and whose workloads vary predictably with daily or weekly cycles. For more information, see <a href=\"https://cloud.google.com/compute/docs/autoscaler/predictive-autoscaling#how_predictive_autoscaling_works\">How predictive autoscaling works</a> or <a href=\"https://cloud.google.com/compute/docs/autoscaler/predictive-autoscaling#checking_if_predictive_autoscaling_is_suitable_for_your_workload\">check if predictive autoscaling is suitable for your workload</a>, and to learn more about other intelligent features, check out <a href=\"https://cloud.google.com/solutions/active-assist\">Active Assist</a>.<br/></li><li><b>Introducing Dataprep BigQuery pushdown</b>–BigQuery pushdown gives you the flexibility to run jobs using either BigQuery or Dataflow. If you select BigQuery, then Dataprep can automatically determine if data pipelines can be partially or fully translated in a BigQuery SQL statement. Any portions of the pipeline that cannot be run in BigQuery are executed in Dataflow. Utilizing the power of BigQuery results in highly efficient data transformations, especially for manipulations such as filters, joins, unions, and aggregations. This leads to better performance, optimized costs, and increased security with IAM and OAuth support. <a href=\"https://cloud.google.com/blog/products/data-analytics/introducing-dataprep-bigquery-pushdown\">Learn more</a>.<br/></li><li><b>Announcing the Google Cloud Retail &amp; Consumer Goods Summit</b>–The Google Cloud Retail &amp; Consumer Goods Summit brings together technology and business insights, the key ingredients for any transformation. Whether you're responsible for IT, data analytics, supply chains, or marketing, please join! Building connections and sharing perspectives cross-functionally is important to reimagining yourself, your organization, or the world. <a href=\"https://cloud.google.com/blog/topics/events/google-cloud-retail-consumer-goods-summit-future-retail\">Learn more</a> or <a href=\"https://cloudonair.withgoogle.com/events/retailsummit?utm_content=globalblog&amp;utm_source=Google&amp;utm_medium=blog&amp;utm_campaign=FY21-Q2-emea-eventindustry-onlineevent-er-RetailHorizonSummit\" target=\"_blank\">register for free</a>.</li><li><b>New IDC whitepaper assesses multicloud as a risk mitigation strategy</b>–To better understand the benefits and challenges associated with a multicloud approach, we supported IDC’s new whitepaper that investigates how multicloud can help regulated organizations mitigate the risks of using a single cloud vendor. The whitepaper looks at different approaches to multi-vendor and hybrid clouds taken by European organizations and how these strategies can help organizations address concentration risk and vendor-lock in, improve their compliance posture, and demonstrate an exit strategy. <a href=\"https://cloud.google.com/blog/topics/hybrid-cloud/idc-whitepaper-assesses-multicloud-as-risk-mitigation-strategy\">Learn more</a> or <a href=\"https://services.google.com/fh/files/misc/idc_multicloud_whitepaper.pdf\" target=\"_blank\">download the paper</a>.</li><li><b>Introducing request priorities for Cloud Spanner APIs</b>–You can now specify request priorities for some Cloud Spanner APIs. By assigning a HIGH, MEDIUM, or LOW priority to a specific request, you can now convey the relative importance of workloads, to better align resource usage with performance objectives. <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/introducing-request-priorities-cloud-spanner-apis\">Learn more</a>.</li><li><b>How we’re working with governments on climate goals</b>–Google Sustainability Officer Kate Brandt shares more on how we’re partnering with governments around the world to provide our technology and insights to drive progress in sustainability efforts. <a href=\"https://cloud.google.com/blog/topics/public-sector/working-with-governments-on-climate-goals\">Learn more</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Mar 29-Apr 2, 2021<br/></h3><ul><li><b>Why Google Cloud is the ideal platform for Block.one and other DLT companies</b>–Late last year, Google Cloud <a href=\"https://block.one/news/welcome-google-cloud-to-eos-community/\" target=\"_blank\">joined</a> the EOS community, a leading open-source platform for blockchain innovation and performance, and is taking steps to support the EOS Public Blockchain by becoming a <a href=\"https://developers.eos.io/welcome/latest/protocol/consensus_protocol\" target=\"_blank\">block producer</a> (BP). At the time, we outlined how our planned participation underscores the importance of blockchain to the future of business, government, and society. We're sharing more on why Google Cloud is uniquely positioned to be an excellent partner for Block.one and other distributed ledger technology (DLT) companies. <a href=\"https://cloud.google.com/blog/topics/inside-google-cloud/why-google-cloud-is-the-ideal-platform-for-blockone-and-other-dlt-companies\">Learn more</a>.<br/></li><li><b>New whitepaper: Scaling certificate management with Certificate Authority Service</b>–As Google Cloud’s Certificate Authority Service (CAS) approaches general availability, we want to help customers understand the service better. Customers have asked us how CAS fits into our larger security story and how CAS works for various use cases. Our new white paper answers these questions and more. <a href=\"https://cloud.google.com/blog/products/identity-security/how-to-scale-certificate-management-with-google-cas-whitepaper\">Learn more</a> and <a href=\"https://services.google.com/fh/files/misc/scaling_certificate_management_cas.pdf\" target=\"_blank\">download the paper</a>.</li><li><p><b>Build a consistent approach for API consumers</b>–Learn the differences between REST and GraphQL, as well as how to apply REST-based practices to GraphQL. No matter the approach, discover how to manage and treat both options as API products <a href=\"https://cloud.google.com/blog/products/api-management/interacting-with-apis-rest-and-graphql\">here.</a><br/></p></li><li><p><b>Apigee X makes it simple to apply Cloud CDN to APIs</b>–With Apigee X and Cloud CDN, organizations can expand their API programs' global reach. Learn how to deploy APIs across 24 regions and 73 zones <a href=\"https://cloud.google.com/blog/products/api-management/api-performance-and-availability-with-apigee-x-and-cloud-cdn\">here</a>.<br/></p></li><li><p><b>Enabling data migration with Transfer Appliances in APAC</b>—We’re announcing the general availability of Transfer Appliances TA40/TA300 in Singapore. Customers are looking for fast, secure and easy to use options to migrate their workloads to Google Cloud and we are addressing their needs with Transfer Appliances <a href=\"https://cloud.google.com/transfer-appliance/docs/4.0/overview#location-availability\">globally in the US, EU and APAC</a>. Learn more about <a href=\"https://cloud.google.com/transfer-appliance/docs/4.0\">Transfer Appliances TA40 and TA300</a>.<br/></p></li><li><p><b>Windows Authentication is now supported on Cloud SQL for SQL Server in public preview</b>—We’ve launched seamless integration with Google Cloud’s Managed Service for Microsoft Active Directory (AD). This capability is a critical requirement to simplify identity management and streamline the migration of existing SQL Server workloads that rely on AD for access control. <a href=\"https://cloud.google.com/blog/products/databases/windows-authentication-now-supported-by-googles-cloud-sql-database\">Learn more</a> or <a href=\"https://cloud.google.com/sql/docs/sqlserver/ad\">get started</a>.<br/></p></li><li><p><b>Using Cloud AI to whip up new treats with Mars Maltesers</b>—Maltesers, a popular British candy made by Mars, teamed up with our own <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/baking-recipes-made-ai\">AI baker</a> and ML engineer extraordinaire, <a href=\"https://twitter.com/SRobTweets\" target=\"_blank\">Sara Robinson</a>, to create a brand new dessert recipe with Google Cloud AI. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/baking-with-maltesers-marmite-and-cloud-ai\">Find out what happened</a> (recipe included).<br/></p></li><li><p><b>Simplifying data lake management with Dataproc Metastore, now GA</b>—<a href=\"https://cloud.google.com/dataproc-metastore/docs\">Dataproc Metastore</a>, a fully managed, serverless technical metadata repository based on the Apache Hive metastore, is now generally available. Enterprises building and migrating open source data lakes to Google Cloud now have a central and persistent metastore for their open source data analytics frameworks. <a href=\"https://cloud.google.com/blog/products/data-analytics/data-lake-management-just-got-easier-dataproc-metastore-ga\">Learn more</a>.</p></li><li><p><b>Introducing the Echo subsea cable</b>—We announced our investment in Echo, the first-ever cable to directly connect the U.S. to Singapore with direct fiber pairs over an express route. Echo will run from Eureka, California to Singapore, with a stop-over in Guam, and plans to also land in Indonesia. Additional landings are possible in the future. <a href=\"https://cloud.google.com/blog/products/infrastructure/introducing-the-echo-subsea-cable\">Learn more</a>.</p></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Mar 22-Mar 26, 2021<br/></h3><p></p><ul><li><b>10 new videos bring Google Cloud to life</b>—The <a href=\"https://www.youtube.com/channel/UCJS9pqu9BzkAMNTmzNMNhvg\" target=\"_blank\">Google Cloud Tech YouTube channel</a>’s latest video series explains cloud tools for technical practitioners in about 5 minutes each. <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/picture-10-whiteboard-sketch-videos-bring-google-cloud-life\">Learn more</a>.<br/></li><li><b>BigQuery named a Leader in the 2021 Forrester Wave: Cloud Data Warehouse, Q1 2021 report</b>—Forrester gave <a href=\"https://cloud.google.com/bigquery\">BigQuery</a> a score of 5 out of 5 across 19 different criteria. Learn more in our <a href=\"https://cloud.google.com/blog/products/data-analytics/google-cloud-a-leader-in-2021-forrester-wave-cloud-data-warehouse\">blog post</a>, or <a href=\"https://cloud.google.com/forrester-wave-cloud-data-warehouse-2021\">download the report</a>.<br/></li><li><b>Charting the future of custom compute at Google</b>—To meet users’ performance needs at low power, we’re doubling down on custom chips that use System on a Chip (SoC) designs. <a href=\"https://cloud.google.com/blog/topics/systems/the-past-present-and-future-of-custom-compute-at-google\">Learn more</a>.<br/></li><li><b>Introducing Network Connectivity Center</b>—We announced <a href=\"https://cloud.google.com/network-connectivity-center\">Network Connectivity Center</a>, which provides a single management experience to easily create, connect, and manage heterogeneous on-prem and cloud networks leveraging Google’s global infrastructure. Network Connectivity Center serves as a vantage point to seamlessly connect VPNs, partner and dedicated interconnects, as well as third-party routers and Software-Defined WANs, helping you optimize connectivity, reduce operational burden and lower costs—wherever your applications or users may be. <a href=\"https://cloud.google.com/blog/products/networking/announcing-network-connectivity-center\">Learn more</a>.<br/></li><li><b>Making it easier to get Compute Engine resources for batch processing</b>—We announced a new method of obtaining <a href=\"https://cloud.google.com/compute\">Compute Engine</a> instances for batch processing that accounts for availability of resources in zones of a region. Now available in preview for <a href=\"https://cloud.google.com/compute/docs/instance-groups/regional-migs\">regional managed instance groups</a>, you can do this simply by specifying the <code>ANY</code> value in the API. <a href=\"https://cloud.google.com/blog/topics/hpc/a-new-way-to-obtain-compute-engine-vms-for-batch-processing\">Learn more</a>.<br/></li><li><b>Next-gen virtual automotive showrooms are here, thanks to Google Cloud, Unreal Engine, and NVIDIA</b>—We teamed up with <a href=\"https://www.unrealengine.com/en-US/industry/automotive-transportation\" target=\"_blank\">Unreal Engine</a>, the open and advanced real-time 3D creation game engine, and NVIDIA, inventor of the GPU, to launch new virtual showroom experiences for automakers. Taking advantage of the <a href=\"https://www.nvidia.com/en-us/design-visualization/solutions/rendering/\" target=\"_blank\">NVIDIA RTX platform</a> on Google Cloud, these showrooms provide interactive 3D experiences, photorealistic materials and environments, and up to 4K cloud streaming on mobile and connected devices. Today, in collaboration with <a href=\"https://www.mhp.com/en/company\" target=\"_blank\">MHP</a>, the Porsche IT consulting firm, and <a href=\"https://www.monkey-way.com/\" target=\"_blank\">MONKEYWAY</a>, a real-time 3D streaming solution provider, you can see our first virtual showroom, the Pagani Immersive Experience Platform. <a href=\"https://cloud.google.com/blog/topics/retail/virtual-automotive-showrooms-with-google-cloud-unreal-engine-and-nvidia\">Learn more</a>.<br/></li><li><b>Troubleshoot network connectivity with Dynamic Verification (public preview)</b>—You can now check packet loss rate and one-way network latency between two VMs on GCP. This capability is an addition to existing Network Intelligence Center Connectivity Tests which verify reachability by analyzing network configuration in your VPCs. <a href=\"https://cloud.google.com/network-intelligence-center/docs/connectivity-tests\">See more in our documentation.</a></li><li><b>Helping U.S. states get the COVID-19 vaccine to more people</b>—In February, we announced our <a href=\"https://cloud.google.com/blog/topics/public-sector/getting-vaccines-local-communities-safely-and-effectively\">Intelligent Vaccine Impact solution (IVIs)</a> to help communities rise to the challenge of getting vaccines to more people quickly and effectively. Many states have deployed IVIs, and have found it able to meet demand and easily integrate with their existing technology infrastructures. Google Cloud is proud to partner with a number of states across the U.S., including Arizona, the Commonwealth of Massachusetts, North Carolina, Oregon, and the Commonwealth of Virginia to support vaccination efforts at scale. <a href=\"https://cloud.google.com/blog/topics/inside-google-cloud/how-google-cloud-is-supporting-covid-19-vaccination-efforts\">Learn more</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Mar 15-Mar 19, 2021</h3><ul><li><b>A2 VMs now GA: The largest GPU cloud instances with NVIDIA A100 GPUs</b>—We’re announcing the general availability of A2 VMs based on the NVIDIA Ampere A100 Tensor Core GPUs in Compute Engine. This means customers around the world can now run their NVIDIA CUDA-enabled machine learning (ML) and high performance computing (HPC) scale-out and scale-up workloads more efficiently and at a lower cost. <a href=\"https://cloud.google.com/blog/products/compute/a2-vms-with-nvidia-a100-gpus-are-ga\">Learn more</a>.<br/></li><li><b>Earn the new Google Kubernetes Engine skill badge for free</b>—We’ve added a new <a href=\"https://cloud.google.com/training/badges\">skill badge</a> this month, Optimize Costs for Google Kubernetes Engine (GKE), which you can earn for free when you sign up for the Kubernetes track of the <a href=\"https://inthecloud.withgoogle.com/google-cloud-skills/register.html?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY21-Q1-global-trainingandenablement-website-other-skills_challenge&amp;utm_content=gke_cost_optimization\" target=\"_blank\">skills challenge</a>. The skills challenge provides 30 days free access to Google Cloud labs and gives you the opportunity to earn skill badges to showcase different cloud competencies to employers. <a href=\"https://cloud.google.com/blog/topics/training-certifications/how-to-get-the-new-optimize-costs-for-google-kubernetes-engine-skills-badge\">Learn more</a>.<br/></li><li><b>Now available: carbon free energy percentages for our Google Cloud regions</b>—Google first achieved carbon neutrality in 2007, and since 2017 we’ve purchased enough solar and wind energy to match 100% of our global electricity consumption. Now we’re building on that progress to target <a href=\"https://blog.google/outreach-initiatives/sustainability/our-third-decade-climate-action-realizing-carbon-free-future/\" target=\"_blank\">a new sustainability goal</a>: running our business on carbon-free energy 24/7, everywhere, by 2030. Beginning this week, we’re sharing data about how we are performing against that objective so our customers can select Google Cloud regions based on the carbon-free energy supplying them. <a href=\"https://cloud.google.com/blog/topics/sustainability/sharing-carbon-free-energy-percentage-for-google-cloud-regions\">Learn more</a>.<br/></li><li><b>Increasing bandwidth to C2 and N2 VMs</b>—We announced the public preview of 100, 75, and 50 Gbps high-bandwidth network configurations for <a href=\"https://cloud.google.com/compute/docs/machine-types#n2_standard_machine_types\">General Purpose N2</a> and <a href=\"https://cloud.google.com/compute/docs/machine-types#c2_machine_types\">Compute Optimized C2</a> Compute Engine VM families as part of <a href=\"https://cloud.google.com/blog/products/networking/google-cloud-networking-in-depth-how-andromeda-2-2-enables-high-throughput-vms\">continuous efforts to optimize our Andromeda host networking stack</a>. This means we can now offer higher-bandwidth options on existing VM families when using the <a href=\"https://cloud.google.com/compute/docs/networking/using-gvnic\">Google Virtual NIC (gVNIC)</a>. These VMs were previously limited to 32 Gbps. <a href=\"https://cloud.google.com/blog/products/networking/increasing-bandwidth-to-c2-and-n2-vms\">Learn more</a>.</li><li><p><b>New research on how COVID-19 changed the nature of IT</b>—To learn more about the impact of COVID-19 and the resulting implications to IT, Google commissioned a study by IDG to better understand how organizations are shifting their priorities in the wake of the pandemic. <a href=\"https://cloud.google.com/blog/topics/research/new-research-covid-19s-surprising-acceleration-of-it-digital-transformation\">Learn more</a> and <a href=\"https://inthecloud.withgoogle.com/it-leaders-research-21/overview-dl-cd.html?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY21-Q1-NORTHAM-demandgen-website-wd-gcp_gtm_reimagine_master&amp;utm_content=homepage\" target=\"_blank\">download the report</a>.</p></li><li><p><b>New in API security</b>—Google Cloud Apigee API management platform's latest release, <a href=\"https://cloud.google.com/apigee\">Apigee X</a>, works with <a href=\"https://cloud.google.com/armor\">Cloud Armor</a> to protect your APIs with advanced security technology including DDoS protection, geo-fencing, OAuth, and API keys. Learn more about our integrated security enhancements <a href=\"https://cloud.google.com/blog/products/api-management/api-security-with-apigee-and-google-cloud-armor\">here</a>.</p></li><li><p><b>Troubleshoot errors more quickly with Cloud Logging</b>—The Logs Explorer now automatically breaks down your log results by severity, making it easy to spot spikes in errors at specific times. Learn more about our new histogram functionality <a href=\"https://cloud.google.com/logging/docs/view/logs-viewer-interface#histogram-panel\">here</a>.</p></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Mar 8-Mar 12, 2021</h3><p></p><ul><li>Introducing #AskGoogleCloud on Twitter and YouTube—Our first segment on March 12th features Developer Advocates Stephanie Wong, Martin Omander and James Ward to answer questions on the best workloads for serverless, the differences between “serverless” and “cloud native,” how to accurately estimate costs for using Cloud Run, and much more. <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/introducing-askgooglecloud-community-driven-youtube-live-series\">Learn more</a>.<br/></li><li>Learn about the value of no-code hackathons—Google Cloud’s no-code application development platform, AppSheet, helps to facilitate hackathons for “non-technical” employees with no coding necessary to compete. Learn about Globe Telecom’s no-code hackathon as well as their winning AppSheet app <a href=\"https://cloud.google.com/blog/products/no-code-development/no-code-hackathons-with-google-clouds-appsheet\">here</a>.<br/></li><li>Introducing Cloud Code Secret Manager Integration—<a href=\"https://cloud.google.com/secret-manager\">Secret Manager</a> provides a central place and single source of truth to manage, access, and audit secrets across Google Cloud. Integrating <a href=\"https://cloud.google.com/code\">Cloud Code</a> with Secret Manager brings the powerful capabilities of both these tools together so you can create and manage your secrets right from within your preferred IDE, whether that be VS Code, IntelliJ, or Cloud Shell Editor. <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/introducing-cloud-code-secret-manager-integration\">Learn more</a>.<br/></li><li>Flexible instance configurations in Cloud SQL—Cloud SQL for MySQL now supports flexible instance configurations which offer you the extra freedom to configure your instance with the specific number of vCPUs and GB of RAM that fits your workload. To set up a new instance with a flexible instance configuration, see our documentation <a href=\"https://cloud.google.com/sql/docs/mysql/instance-settings#machine-type-2ndgen\">here</a>.<br/></li><li>The Cloud Healthcare Consent Management API is now generally available—The Healthcare Consent Management API is now GA, giving customers the ability to greatly scale the management of consents to meet increasing need, particularly amidst the <a href=\"https://journals.sagepub.com/page/bds/collections/health_data_ecosystem\" target=\"_blank\">emerging task</a> of managing health data for new care and research scenarios. <a href=\"https://cloud.google.com/blog/topics/healthcare-life-sciences/google-cloud-healthcare-consent-management-api-generally-available\">Learn more</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Mar 1-Mar 5, 2021<br/></h3><ul><li>Cloud Run is now available in all Google Cloud regions. <a href=\"https://cloud.google.com/run/docs/locations\">Learn more</a>.<br/></li><li>Introducing Apache Spark Structured Streaming connector for Pub/Sub Lite—We’re announcing the release of an open source <a href=\"https://github.com/googleapis/java-pubsublite-spark\" target=\"_blank\">connector</a> to read streams of messages from <a href=\"https://cloud.google.com/pubsub/lite/docs\">Pub/Sub Lite</a> into Apache Spark.The connector <a href=\"https://github.com/googleapis/java-pubsublite-spark#downloading-and-using-the-connector\" target=\"_blank\">works</a> in all Apache Spark 2.4.X distributions, including Dataproc, Databricks, or manual Spark installations. <a href=\"https://cloud.google.com/blog/products/data-analytics/pubsub-lite-for-your-streaming-applications\">Learn more</a>.<br/></li><li>Google Cloud Next ‘21 is October 12-14, 2021—Join us and learn how the most successful companies have transformed their businesses with Google Cloud. Sign-up at <a href=\"https://cloud.withgoogle.com/next/sf?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY21-Q1-Google-Cloud-Blog\" target=\"_blank\">g.co/cloudnext</a> for updates. <a href=\"https://cloud.google.com/blog/topics/google-cloud-next/announcing-google-cloud-next21\">Learn more</a>.<br/></li><li>Hierarchical firewall policies now GA—Hierarchical firewalls provide a means to enforce firewall rules at the <a href=\"https://cloud.google.com/resource-manager/docs/creating-managing-organization\">organization</a> and <a href=\"https://cloud.google.com/resource-manager/docs/creating-managing-folders\">folder</a> levels in the <a href=\"https://cloud.google.com/resource-manager/docs/cloud-platform-resource-hierarchy\">GCP Resource Hierarchy</a>. This allows security administrators at different levels in the hierarchy to define and deploy consistent firewall rules across a number of projects so they're applied to all VMs in currently existing and yet-to-be-created projects. <a href=\"https://cloud.google.com/blog/products/identity-security/new-google-cloud-hierarchical-firewall-policies\">Learn more</a>.<br/></li><li>Announcing the Google Cloud Born-Digital Summit—Over this half-day event, we’ll highlight proven best-practice approaches to data, architecture, diversity &amp; inclusion, and growth with Google Cloud solutions. <a href=\"https://cloud.google.com/blog/topics/events/announcing-the-google-cloud-born-digital-summit\">Learn more</a> and <a href=\"https://cloudonair.withgoogle.com/events/born-digital-summit?utm_source=Google&amp;utm_medium=Social&amp;utm_content=BlogPostAMERICAS&amp;utm_campaign=\" target=\"_blank\">register for free</a>.<br/></li><li>Google Cloud products in 4 words or less (2021 edition)—Our popular “4 words or less Google Cloud developer’s cheat sheet” is back and updated for 2021. <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/back-popular-demand-google-cloud-products-4-words-or-less-2021-edition\">Learn more</a>.<br/></li><li>Gartner names Google a leader in its 2021 Magic Quadrant for Cloud AI Developer Services report—We believe this recognition is based on Gartner’s evaluation of Google Cloud’s language, vision, conversational, and structured data services and solutions for developers. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/google-cloud-a-leader-in-gartner-mq-for-cloud-ai-developer-services\">Learn more</a>.<br/></li><li>Announcing the Risk Protection Program—The Risk Protection Program offers customers peace of mind through the technology to secure their data, the tools to monitor the security of that data, and an industry-first cyber policy offered by leading insurers. <a href=\"https://cloud.google.com/blog/products/identity-security/google-cloud-risk-protection-program-now-in-preview\">Learn more</a>.<br/></li><li><p>Building the future of work—We’re introducing new innovations in Google Workspace to help people collaborate and find more time and focus, wherever and however they work. <a href=\"https://cloud.google.com/blog/products/workspace/the-future-of-work-with-google-workspace\">Learn more</a>.</p></li><li><p>Assured Controls and expanded Data Regions—We’ve added new information governance features in Google Workspace to help customers control their data based on their business goals. <a href=\"https://cloud.google.com/blog/products/workspace/assured-controls-and-expanded-data-regions-for-google-workspace\">Learn more</a>.</p></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Feb 22-Feb 26, 2021</h3><ul><li><p>21 Google Cloud tools explained in 2 minutes—Need a quick overview of Google Cloud core technologies? Quickly learn these 21 Google Cloud products—each explained in under two minutes. <a href=\"https://cloud.google.com/blog/topics/inside-google-cloud/21-google-cloud-tools-each-explained-under-2-minutes\">Learn more</a>.</p></li><li><p>BigQuery materialized views now GA—Materialized views (MV’s) are precomputed views that periodically cache results of a query to provide customers increased performance and efficiency. <a href=\"https://cloud.google.com/blog/products/data-analytics/bigquery-materialized-views-now-ga\">Learn more</a>.</p></li><li><p>New in BigQuery BI Engine—We’re extending BigQuery BI Engine to work with any BI or custom dashboarding applications that require sub-second query response times. In this preview, BI Engine will work seamlessly with Looker and other popular BI tools such as Tableau and Power BI without requiring any change to the BI tools. <a href=\"https://cloud.google.com/blog/products/data-analytics/bigquery-bi-engine-extends-integration-for-any-bi-solution\">Learn more</a>.</p></li><li><p>Dataproc now supports Shielded VMs—All Dataproc clusters created using Debian 10 or Ubuntu 18.04 operating systems now use <a href=\"https://cloud.google.com/security/shielded-cloud/shielded-vm\">Shielded VMs</a> by default and customers can provide their own <a href=\"https://cloud.google.com/dataproc/docs/reference/rest/v1/ClusterConfig#ShieldedInstanceConfig\">configurations</a> for secure boot, vTPM, and Integrity Monitoring. This feature is just one of the many ways customers that have migrated their Hadoop and Spark clusters to GCP experience continued improvements to their security postures without any additional cost.<br/></p></li><li><p>New Cloud Security Podcast by Google—Our new podcast brings you stories and insights on security in the cloud, delivering security from the cloud, and, of course, on what we’re doing at Google Cloud to help keep customer data safe and workloads secure. <a href=\"https://cloud.google.com/blog/products/identity-security/introducing-google-clouds-new-cloud-security-podcast\">Learn more</a>.<br/></p></li><li><p>New in Conversational AI and Apigee technology—Australian retailer Woolworths provides seamless customer experiences with their virtual agent, Olive. Apigee API Management and Dialogflow technology allows customers to talk to Olive through voice and chat. <a href=\"https://cloud.google.com/blog/products/api-management/conversational-ai-with-dialogflow-and-apigee-api-management\">Learn more</a>.<br/></p></li><li><p>Introducing GKE Autopilot—GKE already offers an industry-leading level of automation that makes setting up and operating a Kubernetes cluster easier and more cost effective than do-it-yourself and other managed offerings. Autopilot represents a significant leap forward. In addition to the fully managed control plane that GKE has always provided, using the Autopilot mode of operation automatically applies industry best practices and can eliminate all node management operations, maximizing your cluster efficiency and helping to provide a stronger security posture. <a href=\"https://cloud.google.com/blog/products/containers-kubernetes/introducing-gke-autopilot\">Learn more</a>.<br/></p></li><li><p>Partnering with Intel to accelerate cloud-native 5G—As we continue to grow cloud-native services for the telecommunications industry, we’re excited to announce a collaboration with Intel to develop reference architectures and integrated solutions for communications service providers to accelerate their deployment of 5G and edge network solutions. <a href=\"https://cloud.google.com/blog/topics/partners/speeding-up-cloud-native-5g-networks-with-intel-and-google-cloud\">Learn more</a>.</p></li><li><p>Veeam Backup for Google Cloud now available—<a href=\"https://www.veeam.com/blog/google-cloud-backup-and-recovery.html\" target=\"_blank\">Veeam Backup for Google Cloud</a> automates Google-native snapshots to securely protect VMs across projects and regions with ultra-low RPOs and RTOs, and store backups in Google Object Storage to enhance data protection while ensuring lower costs for long-term retention.</p></li><li><p>Migrate for Anthos 1.6 GA—With<a href=\"https://cloud.google.com/migrate/anthos/docs\"> Migrate for Anthos</a>, customers and partners can automatically migrate and modernize traditional application workloads running in VMs into containers running on Anthos or GKE. Included in this new release: </p></li><ul><li><p>In-place modernization for Anthos on AWS (Public Preview) to help customers accelerate on-boarding to Anthos AWS while leveraging their existing investment in AWS data sources, projects, VPCs, and IAM controls.</p></li><li><p>Additional Docker registries and artifacts repositories support (GA) including AWS ECR, basic-auth docker registries, and AWS S3 storage to provide further flexibility for customers using Anthos Anywhere (on-prem, AWS, etc). </p></li><li><p>HTTPS Proxy support (GA) to enable M4A functionality (access to external image repos and other services) where a proxy is used to control external access.</p></li></ul></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Feb 15-Feb 19, 2021</h3><ul><li><p>Introducing Cloud Domains in preview—Cloud Domains simplify domain registration and management within Google Cloud, improve the custom domain experience for developers, increase security, and support stronger integrations around DNS and SSL. <a href=\"https://cloud.google.com/blog/products/networking/introducing-cloud-domains\">Learn more</a>.</p></li><li><p>Announcing Databricks on Google Cloud—Our partnership with Databricks enables customers to accelerate Databricks implementations by simplifying their data access, by jointly giving them powerful ways to analyze their data, and by leveraging our combined AI and ML capabilities to impact business outcomes. <a href=\"https://cloud.google.com/blog/products/data-analytics/databricks-on-google-cloud\">Learn more</a>.</p></li><li><p>Service Directory is GA—As the number and diversity of services grows, it becomes increasingly challenging to maintain an inventory of all of the services across an organization. Last year, we launched Service Directory to help simplify the problem of service management. Today, it’s generally available. <a href=\"https://cloud.google.com/blog/products/networking/service-directory-is-ga-and-adds-automatic-service-registration\">Learn more</a>.</p></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Feb 8-Feb 12, 2021</h3><p></p><ul><li><p>Introducing Bare Metal Solution for SAP workloads—We’ve expanded our Bare Metal Solution—dedicated, single-tenant systems designed specifically to run workloads that are too large or otherwise unsuitable for standard, virtualized environments—to include SAP-certified hardware options, giving SAP customers great options for modernizing their biggest and most challenging workloads. <a href=\"https://cloud.google.com/blog/products/sap-google-cloud/introducing-bare-metal-solution-for-sap-workloads\">Learn more</a>.</p></li><li><p>9TB SSDs bring ultimate IOPS/$ to Compute Engine VMs—You can now attach 6TB and 9TB Local SSD to second-generation general-purpose <a href=\"https://cloud.google.com/compute/docs/machine-types\">N2 Compute Engine VMs</a>, for great IOPS per dollar. <a href=\"https://cloud.google.com/blog/products/storage-data-transfer/n2-vms-run-low-latency-io-intensive-workloads-with-9tb-ssd\">Learn more</a>.</p></li><li><p>Supporting the Python ecosystem—As part of our longstanding support for the Python ecosystem, we are happy to increase our support for the <a href=\"https://www.python.org/psf/\" target=\"_blank\">Python Software Foundation</a>, the non-profit behind the Python programming language, ecosystem and community. <a href=\"https://cloud.google.com/blog/products/open-source/supporting-the-python-ecosystem\">Learn more</a>. </p></li><li><p>Migrate to regional backend services for Network Load Balancing—We now support backend services with Network Load Balancing—a significant enhancement over the prior approach, target pools, providing a common unified data model for all our load-balancing family members and accelerating the delivery of exciting features on Network Load Balancing. <a href=\"https://cloud.google.com/blog/products/networking/migrate-to-regional-backend-services-for-network-load-balancing\">Learn more</a>.</p></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Feb 1-Feb 4, 2021<br/></h3><p></p><ul><li>Apigee launches Apigee X—Apigee celebrates its 10 year anniversary with Apigee X, a new release of the Apigee API management platform. Apigee X harnesses the best of Google technologies to accelerate and globalize your API-powered digital initiatives. Learn more about Apigee X and digital excellence <a href=\"https://cloud.google.com/blog/products/api-management/apigee-x-google-clouds-more-powerful-api-management-platform\">here.</a></li><li>Celebrating the success of Black founders with Google Cloud during Black History Month—February is Black History Month, a time for us to come together to celebrate and remember the important people and history of the African heritage. Over the next four weeks, we will highlight four Black-led startups and how they use Google Cloud to grow their businesses. Our <a href=\"https://cloud.google.com/blog/topics/startups/black-history-month-celebrating-success-black-founders-google-cloud\">first feature </a>highlights TQIntelligence and its founder, Yared.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Week of Jan 25-Jan 29, 2021</h3><p></p><ul><li>BeyondCorp Enterprise now generally available—BeyondCorp Enterprise is a zero trust solution, built on Google’s global network, which provides customers with simple and secure access to applications and cloud resources and offers integrated threat and data protection. To learn more, read the <a href=\"https://cloud.google.com/blog/products/identity-security/introducing-beyondcorp-enterprise\">blog post</a>, visit our <a href=\"https://cloud.google.com/beyondcorp-enterprise\">product homepage,</a> and register for our upcoming <a href=\"https://www.brighttalk.com/webcast/18282/465874?utm_source=Google+Cloud+Security&amp;utm_medium=brighttalk&amp;utm_campaign=465874\" target=\"_blank\">webinar</a>.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3></h3><h3></h3><h3></h3><h3>Week of Jan 18-Jan 22, 2021<br/></h3><ul><li><p><b>Cloud Operations Sandbox now available</b>—Cloud Operations Sandbox is an open-source tool that helps you learn SRE practices from Google and apply them on cloud services using Google Cloud’s operations suite (formerly Stackdriver), with everything you need to get started in one click. You can read our <a href=\"https://cloud.google.com/blog/products/operations/on-the-road-to-sre-with-cloud-operations-sandbox\">blog post</a>, or get started by visiting <a href=\"http://cloud-ops-sandbox.dev/\" target=\"_blank\">cloud-ops-sandbox.dev</a>, exploring the <a href=\"https://github.com/GoogleCloudPlatform/cloud-ops-sandbox\" target=\"_blank\">project repo</a>, and following along in the <a href=\"https://github.com/GoogleCloudPlatform/cloud-ops-sandbox/blob/master/docs/README.md\" target=\"_blank\">user guide</a>. </p></li><li><p><b>New data security strategy whitepaper</b>—Our new whitepaper shares our best practices for how to deploy a modern and effective data security program in the cloud. Read the <a href=\"https://cloud.google.com/blog/products/identity-security/start-a-data-security-program-in-a-cloud-native-way-on-google-cloud\">blog post</a> or download the <a href=\"https://services.google.com/fh/files/misc/designing_and_deploying_data_security_strategy.pdf\" target=\"_blank\">paper</a>.   </p></li><li><p><b>WebSockets, HTTP/2 and gRPC bidirectional streams come to Cloud Run</b>—With these capabilities, you can deploy new kinds of applications to Cloud Run that were not previously supported, while taking advantage of serverless infrastructure. These features are now available in public preview for all Cloud Run locations. Read the <a href=\"https://cloud.google.com/blog/products/serverless/cloud-run-gets-websockets-http-2-and-grpc-bidirectional-streams\">blog post</a> or check out the <a href=\"https://deploy.cloud.run/?git_repo=https://github.com/socketio/socket.io.git&amp;dir=examples/whiteboard&amp;revision=f8a66fd11acffb72fcb90750affd5dce42bef977\" target=\"_blank\">WebSockets demo app</a> or the <a href=\"https://github.com/GoogleCloudPlatform/golang-samples/tree/master/run/h2c\" target=\"_blank\">sample h2c server</a> app.</p></li><li><p><b>New tutorial: Build a no-code workout app in 5 steps</b>—Looking to crush your new year’s resolutions? Using AppSheet, Google Cloud’s no-code app development platform, you can build a custom fitness app that can do things like record your sets, reps and weights, log your workouts, and show you how you’re progressing. <a href=\"https://cloud.google.com/blog/products/no-code-development/build-your-own-workout-app-5-stepswithout-coding\">Learn how</a>.</p></li></ul><h3><hr/></h3><h3>Week of Jan 11-Jan 15, 2021</h3><ul><li><b>State of API Economy 2021 Report now available</b>—Google Cloud details the changing role of APIs in 2020 amidst the COVID-19 pandemic, informed by a comprehensive study of Apigee API usage behavior across industry, geography, enterprise size, and more. Discover these 2020 trends along with a projection of what to expect from APIs in 2021. Read our blog post <a href=\"https://cloud.google.com/blog/products/api-management/top-5-trends-for-api-powered-digital-transformation-in-2021\">here</a> or download and read the report <a href=\"https://pages.apigee.com/api-economy-report-register/?utm_source=social&amp;utm_medium=organic&amp;utm_campaign=api-economy\" target=\"_blank\">here.</a><br/></li><li><b>New in the state of no-code</b>—Google Cloud's AppSheet looks back at the key no-code application development themes of 2020. AppSheet contends the rising number of citizen developer app creators will ultimately change the state of no-code in 2021. Read more <a href=\"https://cloud.google.com/blog/products/no-code-development/no-code-momentum-in-2020\">here.</a><br/></li></ul><h3><hr/></h3><h3>Week of Jan 4-Jan 8, 2021</h3><p></p><ul><li><b>Last year's most popular API posts</b>—In an arduous year, thoughtful API design and strategy is critical to empowering developers and companies to use technology for global good. Google Cloud looks back at the must-read API posts in 2020. Read it <a href=\"https://cloud.google.com/blog/products/api-management/google-cloud-2020-api-and-api-management-highlights\">here.</a></li></ul><b><h3><hr/></h3><h3>Week of Dec 21-Dec 25, 2020</h3></b><ul><li><b>A look back at the year across Google Cloud</b>—Looking for some holiday reading? We’ve published recaps of our year across <a href=\"https://cloud.google.com/blog/products/databases/managed-cloud-database-services-what-was-new-in-2020\">databases</a>, <a href=\"https://cloud.google.com/blog/products/serverless/google-cloud-serverless-and-app-dev-services-in-2020\">serverless</a>, <a href=\"https://cloud.google.com/blog/products/data-analytics/data-analytics-at-google-cloud-what-was-new-in-2020\">data analytics</a>, and <a href=\"https://cloud.google.com/blog/products/no-code-development/2020-no-code-app-development-retrospective\">no-code development</a>. Or take a look at our <a href=\"https://cloud.google.com/blog/topics/inside-google-cloud/top-9-posts-from-google-cloud-in-2020\">9 most popular posts of 2020</a>.</li></ul><p></p><h3><hr/></h3><h3>Week of Dec 14-Dec 18, 2020</h3><p></p><ul><li><b>Memorystore for Redis enables TLS encryption support (Preview)</b>—With this release, you can now use Memorystore for applications requiring sensitive data to be encrypted between the client and the Memorystore instance. Read more <a href=\"https://cloud.google.com/memorystore/docs/redis/tls-encryption-overview\">here</a>.<br/></li><li><b>Monitoring Query Language (MQL) for Cloud Monitoring is now generally available</b>—Monitoring Query language provides developers and operators on IT and development teams powerful metric querying, analysis, charting, and alerting capabilities. This functionality is needed for Monitoring use cases that include troubleshooting outages, root cause analysis, custom SLI / SLO creation, reporting and analytics, complex alert logic, and more. <a href=\"https://cloud.google.com/monitoring/mql\">Learn more</a>.</li></ul><b><h3><hr/></h3><h3>Week of Dec 7-Dec 11, 2020</h3></b><ul><li><b>Memorystore for Redis now supports Redis AUTH</b>—With this release you can now use OSS Redis AUTH feature with Memorystore for Redis instances. Read more <a href=\"https://cloud.google.com/memorystore/docs/redis/auth-overview\">here</a>.<br/></li><li><b>New in serverless computing</b>—Google Cloud API Gateway and its service-first approach to developing serverless APIs helps organizations accelerate innovation by eliminating scalability and security bottlenecks for their APIs. Discover more benefits <a href=\"https://cloud.google.com/blog/products/serverless/build-restful-apis-on-serverless-platforms-like-cloud-run\">here.</a></li><li><b>Environmental Dynamics, Inc. makes a big move to no-code</b>—The environmental consulting company EDI built and deployed 35+ business apps with no coding skills necessary with Google Cloud’s AppSheet. This no-code effort not only empowered field workers, but also saved employees over 2,550 hours a year. Get the full story <a href=\"https://cloud.google.com/blog/products/workspace/google-workspace-and-appsheet-help-consultant-edi-with-productivity\">here.</a></li><li><b>Introducing Google Workspace for Government</b>—Google Workspace for Government is an offering that brings the best of Google Cloud’s collaboration and communication tools to the government with pricing that meets the needs of the public sector. Whether it’s powering social care visits, employment support, or virtual courts, Google Workspace helps governments meet the unique challenges they face as they work to provide better services in an increasingly virtual world. <a href=\"https://cloud.google.com/blog/topics/public-sector/google-cloud-unveils-new-offerings-its-global-public-sector-summit\">Learn more</a>.</li></ul><p></p><h3><hr/></h3><h3>Week of Nov 30-Dec 4, 2020</h3><p></p><ul><li><b>Google enters agreement to acquire Actifio</b>—Actifio, a leader in backup and disaster recovery (DR), offers customers the opportunity to protect virtual copies of data in their native format, manage these copies throughout their entire lifecycle, and use these copies for scenarios like development and test. This planned acquisition further demonstrates Google Cloud’s commitment to helping enterprises protect workloads on-premises and in the cloud. <a href=\"https://cloud.google.com/blog/products/storage-data-transfer/google-enters-agreement-to-acquire-actifio\">Learn more</a>.<br/></li><li><b>Traffic Director can now send traffic to services and gateways hosted outside of Google Cloud</b>—Traffic Director support for Hybrid Connectivity <a href=\"https://cloud.google.com/load-balancing/docs/negs\">Network Endpoint Groups</a> (NEGs), now generally available, enables services in your VPC network to interoperate more seamlessly with services in other environments. It also enables you to build advanced solutions based on Google Cloud's portfolio of networking products, such as Cloud Armor protection for your private on-prem services. <a href=\"https://cloud.google.com/blog/products/networking/traffic-director-extends-its-service-mesh-to-non-gcp-endpoints\">Learn more</a>.<br/></li><li><b>Google Cloud launches the Healthcare Interoperability Readiness Program</b>—This program, powered by APIs and Google Cloud’s Apigee, helps patients, doctors, researchers, and healthcare technologists alike by making patient data and healthcare data more accessible and secure. Learn more <a href=\"https://cloud.google.com/blog/topics/healthcare-life-sciences/google-cloud-healthcare-interoperability-readiness-program\">here</a>.<br/></li><li><b>Container Threat Detection in Security Command Center</b>—We announced the general availability of Container Threat Detection, a built-in service in Security Command Center. This release includes multiple detection capabilities to help you monitor and secure your container deployments in Google Cloud. Read more <a href=\"https://cloud.google.com/blog/products/identity-security/container-threat-detection-is-ga\">here</a>.<br/></li><li><b>Anthos on bare metal now GA</b>—Anthos on bare metal opens up new possibilities for how you run your workloads, and where. You can run Anthos on your existing virtualized infrastructure, or eliminate the dependency on a hypervisor layer to modernize applications while reducing costs. <a href=\"https://cloud.google.com/blog/topics/hybrid-cloud/anthos-on-bare-metal-is-now-ga\">Learn more</a>.</li></ul><p></p><h3><hr/></h3><h3>Week of Nov 23-27, 2020</h3><p></p><ul><li><b>Tuning control support in Cloud SQL for MySQL</b>—We’ve made all 80 flags that were previously in preview now generally available (GA), empowering you with the controls you need to optimize your databases. See the full list <a href=\"https://cloud.google.com/sql/docs/mysql/flags#list-flags-mysql\">here</a>.</li><li><b>New in BigQuery ML</b>—We announced the general availability of boosted trees using XGBoost, deep neural networks (DNNs) using TensorFlow, and model export for online prediction. <a href=\"https://cloud.google.com/blog/products/data-analytics/new-ml-models-built-into-cloud-data-analytics\">Learn more</a>.<br/></li><li><b>New AI/ML in retail report</b>—We recently commissioned a survey of global retail executives to better understand which AI/ML use cases across the retail value chain drive the highest value and returns in retail, and what retailers need to keep in mind when going after these opportunities. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/top-10-ai-use-cases-in-retail\">Learn more</a>  or <a href=\"https://inthecloud.withgoogle.com/retail-whitepaper/dl-cd.html\" target=\"_blank\">read the report</a>.<br/></li></ul><p></p><h3><hr/></h3><h3>Week of Nov 16-20, 2020</h3><ul><li><b>New whitepaper on how AI helps the patent industry</b>—Our new paper outlines a methodology to train a BERT (bidirectional encoder representation from transformers) model on over 100 million patent publications from the U.S. and other countries using open-source tooling. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/how-ai-improves-patent-analysis\">Learn more</a> or <a href=\"https://services.google.com/fh/files/blogs/bert_for_patents_white_paper.pdf\" target=\"_blank\">read the whitepaper</a>.</li><li><b>Google Cloud support for .NET 5.0</b>—Learn more about our support of .NET 5.0, as well as <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/net-50-google-cloud\">how to deploy it to Cloud Run</a>.</li><li><b>.NET Core 3.1 now on Cloud Functions</b>—With this integration you can write cloud functions using your favorite .NET Core 3.1 runtime with our Functions Framework for .NET for an idiomatic developer experience. <a href=\"https://cloud.google.com/blog/products/application-development/introducing-net-google-cloud-functions\">Learn more</a>.</li><li><b>Filestore Backups in preview</b>—We announced the availability of the Filestore Backups preview in all regions, making it easier to migrate your business continuity, disaster recovery and backup strategy for your file systems in Google Cloud. <a href=\"https://cloud.google.com/blog/products/storage-data-transfer/introducing-filestore-backups\">Learn more</a>.</li><li><b>Introducing Voucher, a service to help secure the container supply chain</b>—Developed by the Software Supply Chain Security team at Shopify to work with Google Cloud tools, Voucher evaluates container images created by CI/CD pipelines and signs those images if they meet certain predefined security criteria. Binary Authorization then validates these signatures at deploy time, ensuring that only explicitly authorized code that meets your organizational policy and compliance requirements can be deployed to production. <a href=\"https://cloud.google.com/blog/products/devops-sre/introducing-voucher-service-help-secure-container-supply-chain\">Learn more</a>.</li><li><b>10 most watched from Google Cloud Next ‘20: OnAir</b>—Take a stroll through the 10 sessions that were most popular from Next OnAir, covering everything from data analytics to cloud migration to no-code development. <a href=\"https://cloud.google.com/blog/topics/google-cloud-next/10-most-popular-sessions-from-google-cloud-next20-onair\">Read the blog</a>.<br/></li><li><b>Artifact Registry is now GA</b>—With support for container images, Maven, npm packages, and additional formats coming soon, Artifact Registry helps your organization benefit from scale, security, and standardization across your software supply chain. <a href=\"https://cloud.google.com/blog/products/devops-sre/artifact-registry-is-ga\">Read the blog</a>.</li></ul><h3><hr/></h3><h3>Week of Nov 9-13, 2020</h3><p></p><ul><li><b>Introducing the Anthos Developer Sandbox</b>—The Anthos Developer Sandbox gives you an easy way to learn to develop on Anthos at no cost, available to anyone with a Google account. <a href=\"https://cloud.google.com/blog/topics/anthos/introducing-the-anthos-developer-sandbox\">Read the blog</a>.<br/></li><li><b>Database Migration Service now available in preview</b>—Database Migration Service (DMS) makes migrations to Cloud SQL simple and reliable. DMS supports migrations of self-hosted MySQL databases—either on-premises or in the cloud, as well as managed databases from other clouds—to Cloud SQL for MySQL. Support for PostgreSQL is currently available for limited customers in preview, with SQL Server coming soon. <a href=\"https://cloud.google.com/blog/products/databases/database-migration-service-now-available-for-cloud-sql-and-more\">Learn more</a>.<br/></li><li><b>Troubleshoot deployments or production issues more quickly with new logs tailing</b>—We’ve added support for a new API to tail logs with low latency. Using gcloud, it allows you the convenience of tail -f with the powerful query language and centralized logging solution of Cloud Logging. <a href=\"https://cloud.google.com/logging/docs/reference/tools/gcloud-logging#live-tailing\">Learn more</a> about this preview feature.<br/></li><li><b>Regionalized log storage now available in 5 new regions in preview</b>—You can now select where your logs are stored from one of five regions in addition to global—asia-east1, europe-west1, us-central1, us-east1, and us-west1. When you create a logs bucket, you can set the region in which you want to store your logs data. Get started with this <a href=\"https://cloud.google.com/logging/docs/regionalized-logs\">guide</a>.</li></ul><p></p><h3><hr/></h3><h3>Week of Nov 2-6, 2020</h3><p></p><ul><li><b>Cloud SQL adds support for PostgreSQL 13</b>—Shortly after its community GA, Cloud SQL has added support for PostgreSQL 13. You get access to the latest features of PostgreSQL while Cloud SQL handles the heavy operational lifting, so your team can focus on accelerating application delivery. Read more <a href=\"https://cloud.google.com/blog/products/databases/cloud-sql-database-service-adds-postgresql-13\">here</a>.<br/></li><li><b>Apigee creates value for businesses running on SAP</b>—Google Cloud’s API Management platform Apigee is optimized for data insights and data monetization, helping businesses running on SAP innovate faster without fear of SAP-specific challenges to modernization. Read more <a href=\"https://cloud.google.com/blog/products/api-management/how-google-cloud-lets-you-do-more-with-sap\">here.</a> <br/></li><li><b>Document AI platform is live</b>—The new Document AI (DocAI) platform, a unified console for document processing, is now available in preview. You can quickly access all parsers, tools and solutions (e.g. <a href=\"https://cloud.google.com/solutions/lending-doc-ai\">Lending DocAI</a>, <a href=\"https://cloud.google.com/solutions/procurement-doc-ai\">Procurement DocAI</a>) with a unified API, enabling an end-to-end document solution from evaluation to deployment. Read the full story <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/google-cloud-announces-document-ai-platform\">here</a> or check it out in your <a href=\"https://console.cloud.google.com/ai/document-ai?_ga=2.29960255.-1847873956.1563554776\">Google Cloud</a>console.<br/></li><li><b>Accelerating data migration with Transfer Appliances TA40 and TA300</b>—We’re announcing the general availability of new Transfer Appliances. Customers are looking for fast, secure and easy to use options to migrate their workloads to Google Cloud and we are addressing their needs with <a href=\"https://youtu.be/4U3tn_0mX_c?t=1003\" target=\"_blank\">next generation Transfer Appliances</a>. Learn more about <a href=\"https://cloud.google.com/transfer-appliance/docs/4.0\">Transfer Appliances TA40 and TA300</a>.</li></ul><p></p><h3><hr/></h3><h3>Week of Oct 26-30, 2020</h3><p></p><ul><li><b>B.H., Inc. accelerates digital transformation</b>—The Utah based contracting and construction company BHI eliminated IT backlog when non technical employees were empowered to build equipment inspection, productivity, and other custom apps by choosing Google Workspace and the no-code app development platform, AppSheet. Read the full story <a href=\"https://cloud.google.com/blog/products/no-code-development/digital-transformation-with-google-workspace-and-appsheet\">here</a>.<br/></li><li><b>Globe Telecom embraces no-code development</b>—Google Cloud’s AppSheet empowers Globe Telecom employees to do more innovating with less code. The global communications company kickstarted their no-code journey by combining the power of AppSheet with a unique adoption strategy. As a result, AppSheet helped Globe Telecom employees build 59 business apps in just 8 weeks. <a href=\"https://www.youtube.com/watch?v=L0saoOdF_Nw&amp;feature=youtu.be\" target=\"_blank\">Get the full story</a>.<br/></li><li><b>Cloud Logging now allows you to control access to logs via Log Views</b>—Building on the control offered via<a href=\"https://cloud.google.com/logging/docs/buckets\"> Log Buckets</a> (<a href=\"https://cloud.google.com/blog/products/management-tools/cloud-logging-adds-log-buckets-feature\">blog post</a>), you can now configure who has access to logs based on the source project, resource type, or log name, all using standard IAM controls. Logs views, currently in Preview, can help you build a system using the principle of least privilege, limiting sensitive logs to only users who need this information.<a href=\"https://cloud.google.com/logging/docs/logs-views\"> Learn more about Log Views</a>.<br/></li><li><b>Document AI is HIPAA compliant</b>—<a href=\"https://cloud.google.com/document-ai\">Document AI</a> now enables HIPAA compliance. Now Healthcare and Life Science customers such as health care providers, health plans, and life science organizations can unlock insights by quickly extracting structured data from medical documents while safeguarding individuals’ protected health information (PHI). <a href=\"https://cloud.google.com/security/compliance/hipaa-compliance/\">Learn more</a> about Google Cloud’s nearly 100 products that support HIPAA-compliance.</li></ul><p></p><h3><hr/></h3><h3>Week of Oct 19-23, 2020</h3><p></p><ul><li><b>Improved security and governance in Cloud SQL for PostgreSQL</b>—Cloud SQL for PostgreSQL now integrates with <a href=\"https://cloud.google.com/iam/docs/overview\">Cloud IAM</a> (preview) to provide simplified and consistent authentication and authorization. Cloud SQL has also enabled <a href=\"https://cloud.google.com/sql/docs/postgres/pg-audit\">PostgreSQL Audit Extension</a> (preview) for more granular audit logging. <a href=\"https://cloud.google.com/blog/products/databases/securely-managed-cloud-sql-databases\">Read the blog</a>.<br/></li><li><b>Announcing the AI in Financial Crime Compliance webinar</b>—Our executive digital forum will feature industry executives, academics, and former regulators who will discuss how AI is transforming financial crime compliance on November 17. <a href=\"https://cloudonair.withgoogle.com/events/financial_crime_compliance?utm_source=google&amp;utm_medium=blogpost&amp;utm_campaign=&amp;utm_content=blogpost\" target=\"_blank\">Register now.</a><br/></li><li><b>Transforming retail with AI/ML</b>—New research provides insights on high value AI/ML use cases for food, drug, mass merchant and speciality retail that can drive significant value and build resilience for your business. Learn what the top use cases are for your sub-segment and read real world success stories. Download the <a href=\"https://inthecloud.withgoogle.com/retail-whitepaper/dl-cd.html\" target=\"_blank\">ebook here</a> and view this companion <a href=\"https://cloudonair.withgoogle.com/events/transforming-retail-with-ai-20\" target=\"_blank\">webinar</a> which also features insights from Zulily. <br/></li><li><b>New release of Migrate for Anthos</b>—We’re introducing two important new capabilities in the 1.5 release of <a href=\"https://cloud.google.com/migrate/anthos\">Migrate for Anthos</a>, Google Cloud's solution to easily migrate and modernize applications currently running on VMs so that they instead run on containers in Google Kubernetes Engine or Anthos. The first is GA support for modernizing IIS apps running on Windows Server VMs. The second is a new utility that helps you identify which VMs in your existing environment are the best targets for modernization to containers. <a href=\"https://pantheon.corp.google.com/kubernetes/migrate\" target=\"_blank\">Start migrating</a> or check out the assessment tool documentation (<a href=\"https://cloud.google.com/migrate/anthos/docs/linux-assessment-tool\">Linux</a> | <a href=\"https://cloud.google.com/migrate/anthos/docs/windows-assessment-tool\">Windows</a>). <br/></li><li><b>New Compute Engine autoscaler controls</b>—New <a href=\"https://cloud.google.com/compute/docs/autoscaler#scale-in_controls\">scale-in controls</a> in Compute Engine let you limit the VM deletion rate by preventing the autoscaler from reducing a MIG's size by more VM instances than your workload can tolerate to lose. <a href=\"https://cloud.google.com/blog/products/compute/compute-engine-managed-instance-groups-get-scale-in-controls\">Read the blog</a>.<br/></li><li><b>Lending DocAI in preview</b>—<a href=\"https://cloud.google.com/solutions/lending-doc-ai\">Lending DocAI</a> is a specialized solution in our Document AI portfolio for the mortgage industry that processes borrowers’ income and asset documents to speed-up loan applications. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/lending-docai-fast-tracks-the-home-loan-process\">Read the blog</a>, or <a href=\"https://www.youtube.com/watch?v=akp0zeI6_6c&amp;feature=youtu.be&amp;t=885\" target=\"_blank\">check out the product demo</a>.</li></ul><p></p><h3><p></p></h3><p></p><p></p><p></p><h3><hr/></h3><h3>Week of Oct 12-16, 2020</h3><p></p><ul><li><b>New maintenance controls for Cloud SQL</b>—Cloud SQL now offers maintenance deny period controls, which allow you to prevent automatic maintenance from occurring during a 90-day time period. <a href=\"https://cloud.google.com/blog/products/databases/new-maintenance-deny-periods-from-cloud-sql\">Read the blog</a>. <br/></li><li><b>Trends in volumetric DDoS attacks</b>—This week we published a deep dive into DDoS threats, detailing the trends we’re seeing and giving you a closer look at how we prepare for multi-terabit attacks so your sites stay up and running. <a href=\"https://cloud.google.com/blog/products/identity-security/identifying-and-protecting-against-the-largest-ddos-attacks\">Read the blog</a>.<br/></li><li><b>New in BigQuery</b>—We shared a number of updates this week, including <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/smile-new-user-friendly-sql-capabilities-bigquery\">new SQL capabilities</a>, more granular control over your partitions with <a href=\"https://cloud.google.com/bigquery/docs/creating-column-partitions\">time unit partitioning</a>, the general availability of <a href=\"https://cloud.google.com/bigquery/docs/table-access-controls-intro?hl=en\">Table ACLs</a>, and BigQuery System Tables Reports, a solution that aims to help you monitor BigQuery <a href=\"https://cloud.google.com/bigquery/pricing#flat_rate_pricing\">flat-rate</a> slot and reservation utilization by leveraging BigQuery’s underlying INFORMATION_SCHEMA views. <a href=\"https://cloud.google.com/blog/products/data-analytics/speed-up-queries-organize-data-with-new-data-warehouse-features\">Read the blog</a>.</li><li><b>Cloud Code makes YAML easy for hundreds of popular Kubernetes CRDs</b>—We announced authoring support for more than 400 popular Kubernetes CRDs out of the box, any existing CRDs in your Kubernetes cluster, and any CRDs you add from your local machine or a URL. <a href=\"https://cloud.google.com/blog/products/containers-kubernetes/cloud-code-features-expanded-support-for-kubernetes-crds\">Read the blog</a>.</li><li><b>Google Cloud’s data privacy commitments for the AI era</b>—We’ve outlined how our AI/ML Privacy Commitment reflects our belief that customers should have both the <a href=\"https://cloud.google.com/security/\">highest level of security</a> and the highest level of control over data stored in the cloud. <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/google-cloud-unveils-ai-and-ml-privacy-commitment\">Read the blog</a>.</li></ul><p></p><ul><li><p><b>New, lower pricing for Cloud CDN</b>—We’ve reduced the price of cache fill (content fetched from your origin) charges across the board, by up to 80%, along with our recent introduction of <a href=\"https://cloud.google.com/cdn/docs/release-notes#September_14_2020\">a new set of flexible caching capabilities</a>, to make it even easier to use Cloud CDN to optimize the performance of your applications. <a href=\"https://cloud.google.com/blog/products/networking/introducing-lower-simpler-pricing-for-cloud-cdn\">Read the blog</a>.<br/></p></li><li><p><b>Expanding the BeyondCorp Alliance</b>—Last year, we announced our BeyondCorp Alliance with partners that share our Zero Trust vision. Today, we’re announcing new partners to this alliance. <a href=\"https://cloud.google.com/blog/products/identity-security/google-cloud-announces-new-partners-in-its-beyondcorp-alliance\">Read the blog</a>.</p></li><li><p><b>New data analytics training opportunities</b>—Throughout October and November, we’re offering a number of no-cost ways to learn data analytics, with trainings for beginners to advanced users. <a href=\"https://cloud.google.com/blog/topics/training-certifications/google-cloud-data-analytics-training-for-all-skills-levels\">Learn more</a>.</p></li><li><p><b>New BigQuery blog series</b>—BigQuery Explained provides overviews on storage, data ingestion, queries, joins, and more. <a href=\"https://cloud.google.com/blog/topics/developers-practitioners/bigquery-explained-blog-series\">Read the series</a>.</p></li></ul><h3><hr/></h3><h3>Week of Oct 5-9, 2020</h3><ul><li><p><b>Introducing the Google Cloud Healthcare Consent Management API</b>—This API gives healthcare application developers and clinical researchers a simple way to manage individuals’ consent of their health data, particularly important given the new and emerging virtual care and research scenarios related to COVID-19. <a href=\"https://cloud.google.com/blog/topics/healthcare-life-sciences/googles-healthcare-consent-management-api-protects-user-data\">Read the blog</a>.</p></li><li><p><b>Announcing Google Cloud buildpacks</b>—Based on the CNCF buildpacks v3 specification, these buildpacks produce container images that follow best practices and are suitable for running on all of our container platforms: Cloud Run (fully managed), Anthos, and Google Kubernetes Engine (GKE). <a href=\"https://cloud.google.com/blog/products/containers-kubernetes/google-cloud-now-supports-buildpacks\">Read the blog</a>.</p></li><li><p><b>Providing open access to the Genome Aggregation Database (gnomAD)</b>—Our collaboration with Broad Institute of MIT and Harvard provides free access to one of the world's most comprehensive public genomic datasets. <a href=\"https://cloud.google.com/blog/topics/healthcare-life-sciences/google-cloud-providing-free-access-to-genome-aggregation-database\">Read the blog</a>.</p></li><li><p><b>Introducing HTTP/gRPC server streaming for Cloud Run</b>—Server-side HTTP streaming for your serverless applications running on Cloud Run (fully managed) is now available. This means your Cloud Run services can serve larger responses or stream partial responses to clients during the span of a single request, enabling quicker server response times for your applications. <a href=\"https://cloud.google.com/blog/products/serverless/cloud-run-now-supports-http-grpc-server-streaming\">Read the blog</a>.</p></li><li><p><b>New security and privacy features in Google Workspace</b>—Alongside the announcement of Google Workspace we also shared more information on new security features that help facilitate safe communication and give admins increased visibility and control for their organizations. <a href=\"https://cloud.google.com/blog/products/workspace/announcing-new-security-and-privacy-updates-in-google-workspace\">Read the blog</a>.</p></li><li><p><b>Introducing Google Workspace</b>—Google Workspace includes all of the productivity apps you know and use at home, at work, or in the classroom—Gmail, Calendar, Drive, Docs, Sheets, Slides, Meet, Chat and more—now more thoughtfully connected. <a href=\"https://cloud.google.com/blog/products/workspace/introducing-google-workspace\">Read the blog</a>.</p></li><li><p><b>New in Cloud Functions: languages, availability, portability, and more</b>—We extended Cloud Functions—our scalable pay-as-you-go Functions-as-a-Service (FaaS) platform that runs your code with zero server management—so you can now use it to build end-to-end solutions for several key use cases. <a href=\"https://cloud.google.com/blog/products/serverless/a-roundup-of-cloud-functions-enhancements\">Read the blog</a>.</p></li><li><p><b>Announcing the Google Cloud Public Sector Summit, Dec 8-9</b>—Our upcoming two-day virtual event will offer thought-provoking panels, keynotes, customer stories and more on the future of digital service in the public sector. <a href=\"https://cloudonair.withgoogle.com/events/public-sector-summit?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=-&amp;utm_content=google-living-blog\" target=\"_blank\">Register at no cost</a>.</p></li></ul></div></div></body></html>",
  "pubDate": "Wed, 02 Nov 2022 21:00:00 -0000",
  "guid": "https://cloud.google.com/blog/topics/inside-google-cloud/whats-new-google-cloud/",
  "category": [
    "Google Cloud",
    "Google Workspace",
    "Inside Google Cloud"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "What’s new with Google Cloud",
    "description": "Find our newest updates, announcements, resources, events, learning opportunities, and more in one handy location.",
    "image": "https://storage.googleapis.com/gweb-cloudblog-publish/images/whats_new_cloud.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://cloud.google.com/blog/topics/inside-google-cloud/whats-new-google-cloud/"
  },
  "author": {
    "name": "Google Cloud Content & Editorial",
    "title": "",
    "department": "",
    "company": ""
  }
}