{
  "title": "EPISODE 51 A Life for a Whistle: Emmett Till and the Birth of the Civil Rights Movement",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Fri, 21 Jun 2019 15:01:37 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2019/6/21/episode-51-a-life-for-a-whistle-emmett-till-and-the-birth-of-the-civil-rights-movement",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5d0ce68617dcd10001d541ed",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1561129253190-ZBJCV1O7X0S9TL2QQAT6/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5d0cf1234d63df0001bb4677\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1561129253190-ZBJCV1O7X0S9TL2QQAT6/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“Until the philosophy&nbsp;<br>Which hold one race superior and another<br>Inferior<br>Is finally<br>And permanently<br>Discredited<br>And abandoned<br>Everywhere is war”</em> — Bob Marley, <em>War</em>, inspired by a speech by Haile Selassie&nbsp;</p><p class=\"\"><em>“Emmett Till is dead and gone… Why can’t people leave the dead alone and quit trying to stir things up?” —</em> Roy Bryant&nbsp;</p><p class=\"\"><strong><em>“</em></strong><em>I think black peoples' reaction was so visceral. Everybody knew we were under attack and that attack was symbolized by the attack on a 14-year-old boy.” —</em> Rose Jourdain&nbsp;</p><p class=\"\"><em>“The audience fell silent, wondering if Wright would risk his life to accuse a white man in open court. For a moment no one moved. Excruciating tension filled the room while people waited for Wright’s reply. Then, in one of the most dramatic moments in Mississippi trial history, Mose Wright, a poor Black sharecropper, stood up, raised his arm, pointed at Milam, a white man, and said, ‘There he is.’” — </em>Chris Crowe&nbsp;</p><p class=\"\">By 1955, in United States, people liked to say that the worst racial abuses belonged to the past—that the culture that had led to nearly 5,000 people getting lynched between the end of Reconstruction and the mid-1940s no longer existed. But then a 14-year old boy from Chicago jokingly whistled at a white lady in Mississippi, and what followed was a familiar script: the flashing of guns in the middle of the night, kidnapping, torture, African Americans looking for their relatives where bodies were normally dumped, and a justice system that was anything but just. What was not part of the familiar script was Mamie Till’s choice that led to a public funeral attended by tens of thousands, and—many people argued—that lit the spark for the birth of the Civil Rights Movement.&nbsp;</p><p class=\"\">Among other things, in this episode:</p><ul data-rte-list=\"default\"><li><p class=\"\">The culture of lynching and the gutsy Southern ladies standing up against it&nbsp;</p></li><li><p class=\"\">How ‘Brown vs. Board of Education’ set the South on fire&nbsp;</p></li><li><p class=\"\">Paranoia over integration and Communist plots&nbsp;</p></li><li><p class=\"\">William Faulkner and the fear at the roots of white supremacy&nbsp;</p></li><li><p class=\"\">Getting away with murder and boasting about it&nbsp;</p></li><li><p class=\"\">How white supremacists won a battle and lost the war</p></li></ul><p class=\"\">But the craziest thing in this whole story is realising this happened not so long ago…&nbsp;</p><p class=\"\">If you'd like to keep following my work on Luminary, please follow my personal link to their platform to sign up. Thank you for understanding that this move is necessary to keep History on Fire viable. <a href=\"https://luminarypodcasts.com/signup?_branch_match_id=486767570160189673\">luminary.link/history</a>&nbsp;</p><p class=\"\">Onnit has shown me love from day 1. So, please check out their supplements, special foods, clothing, and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>.&nbsp;</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "media:content": {
    "media:title": "EPISODE 51 A Life for a Whistle: Emmett Till and the Birth of the Civil Rights Movement"
  }
}