{
  "id": "tag:blogger.com,1999:blog-2471378914199150966.post-3027035215206834389",
  "published": "2021-11-03T11:00:00.000-07:00",
  "updated": "2021-11-03T11:00:01.529-07:00",
  "title": "Chrome Dev Summit 2021: Moving toward a more powerful and private web",
  "content": "<span class=\"post-author\">By Paul Kinlan, Lead for Chrome Developer Relations</span><p>The big day is finally here. Today, at Chrome Dev Summit 2021 we shared some of the highlights of what we've been working on — the latest product updates,  vision for the web's future and examples of best-in-class web experiences. Over the past year, we've also had a lot of feedback that you want to spend more time learning from and working with the Chrome team and other industry experts. I'm excited to share with you that <a href=\"https://developer.chrome.com/devsummit/schedule/\">we've opened up a lot of spaces for 1:1 office hours, workshops and learning lounges</a> to give you more opportunity to connect with the Chrome team.</p> <p>It's been a busy year for us all and with the continued shift of people moving more of their lives online, it has been more important than ever for us to <a href=\"https://web.dev/compat2021-midyear/\">continue investing in Web Compat</a>, and we've been amazed to see the <a href=\"https://wpt.fyi/compat2021?feature=summary\">improvements in compatibility across the board</a> that is helping to make it easier for you to build sites that work across all browsers for everyone who uses the web.</p> <p>We've also got a number of important updates to core topics that are important to every developer:</p> <ul><li>An update on how we're helping to shift the web towards more privacy-safe technologies and give you more visibility into that process.</li><li>A showcase on how many major companies have bet on the web and brough advanced app-like experiences to anyone who can use a browser.</li><li>An update on Core Web Vitals and some new tools that will make it easier for you to measure your sites.</li><li>A dive into the \"New Responsive\" with highlights of new tools and capabilities for designers that make it easier than ever to build experiences your users love.</li></ul><p>This post is an overview of the latest updates from this year's Chrome Dev Summit keynote. </p><div class=\"separator\" style=\"clear: both; text-align: center;\"><iframe allowfullscreen=\"\" class=\"BLOG_video_class\" height=\"331\" src=\"https://www.youtube.com/embed/n57U2_-3NLQ\" width=\"486\" youtube-src-id=\"n57U2_-3NLQ\"></iframe></div><br /> <h2 style=\"text-align: left;\">Paving a Path Toward a More Secure Web</h2><p>The <a href=\"https://privacysandbox.com/\">Privacy Sandbox</a> continues to be a cornerstone of our ongoing efforts to collaboratively build privacy-preserving technologies for a healthy web. Our <a href=\"https://privacysandbox.com/timeline/\">development timeline</a>, which we'll update monthly, shares when developers and advertisers can expect these technologies to be ready for testing and scaled adoption.<br />This timeline reflects three developmental phases for Privacy Sandbox proposals:</p> <h3>1) Discussion</h3><p>Dozens of ideas for privacy-preserving technologies have been proposed by Chrome and others, for public discussion in forums such as the <a href=\"https://www.w3.org/\">W3C</a> and <a href=\"https://github.com/\">GitHub</a> .  For example, more than 100 organizations are helping to refine <a href=\"https://developer.chrome.com/docs/privacy-sandbox/fledge/\">FLEDGE</a>, a proposal for privacy-preserving remarketing.</p> <h3>2) Testing</h3><p>Success at this stage depends on developers engaging in hands-on testing then sharing their learnings publicly. Yahoo! JAPAN's analysis of the <a href=\"https://developer.chrome.com/docs/privacy-sandbox/attribution-reporting/\">Attribution Reporting API</a> and Criteo's machine learning competition for evaluating privacy concepts are examples we're grateful for. </p> <p>This kind of feedback is critical to getting solutions right. For instance, we're currently improving <a href=\"https://privacysandbox.com/proposals/floc\">FLoC</a> — a proposal for anonymized interest groups — with insights from companies such as CafeMedia.</p> <h3>3) Scaled Adoption</h3><p>Some Privacy Sandbox proposals are already live, such as <a href=\"https://web.dev/user-agent-client-hints/\">User-Agent Client Hints</a> which are meant to replace the User-Agent (UA) string. We'll start to gradually reduce the granularity of information in the UA string in April 2022. We know implementing these changes take time, so companies will have the option to use the UA string as is through March 2023 via an origin trial.</p> <h2>Stepping up In-Browser Experiences </h2> <p>With <a href=\"https://web.dev/fugu-status/\">Project Fugu</a>, we've been introducing APIs that elevate web apps so they can do anything native apps can. We've also been inspired by brands building more immersive web experiences with <a href=\"https://web.dev/progressive-web-apps/\">Progressive Web Apps</a> (PWAs) and modern APIs.</p> <p>Take Adobe, a brand we've been partnering with for more than three years. Photoshop, Creative Cloud Spaces, and Creative Cloud Canvas are now in Public Beta and <a href=\"https://web.dev/ps-on-the-web/\">available in browsers</a>—with more flagship apps to follow. This means creatives can view work, share feedback, and make basic edits without having to download or launch native apps. </p> <p>PWAs have given online video and web conferencing platforms an upgrade too. TikTok found a way to reach video lovers across all devices while YouTube Premium gives people the ability to watch videos offline on laptops and hybrid devices.</p><p>Meet drastically improved the audio and video quality in their PWA, and Kapwing focused on making it easy for users to edit videos collaboratively, anytime, anywhere. Zoom replaced their Chrome App with a PWA, and saw 16.9 million new users join web meetings, an increase of more than seven million users year over year.</p> <p>Developers who want to learn more, or get started with Progressive Web Apps can check out our new <a href=\"https://web.dev/learn/pwa/\">Learn PWA</a> course on web.dev. Three modules were launched today, with many more coming.</p> <h2>Continuously Improving Your Web Experience</h2><p>Measuring site performance is a key part of navigating browsers as they evolve, which is where <a href=\"https://web.dev/vitals/\">Core Web Vitals</a> come in. Compared to a year ago, 20% more page visits in Chrome and 60% of the total visits in Chrome fully meet the recommended Core Web Vitals thresholds.</p> <p>Content management systems, website builders, e-commerce platforms, and JavaScript frameworks have helped push the Web Vitals initiative forward. As we shared in our <a href=\"https://datastudio.google.com/reporting/55bc8fad-44c2-4280-aa0b-5f3f0cd3d2be/page/M6ZPC\">Core Web Vitals Technology Report</a>, sites built on many of these platforms are hitting Core Web Vitals out of the park: </p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-2fx7J8MbJkQ/YYKa-yVn5UI/AAAAAAAABtI/_PucA0H1sccLjJ0Pdw7_Cs147TbkIId-ACLcBGAsYHQ/s1424/copyofchrome-c--jg970ov54vc.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"878\" data-original-width=\"1424\" height=\"394\" src=\"https://1.bp.blogspot.com/-2fx7J8MbJkQ/YYKa-yVn5UI/AAAAAAAABtI/_PucA0H1sccLjJ0Pdw7_Cs147TbkIId-ACLcBGAsYHQ/w640-h394/copyofchrome-c--jg970ov54vc.png\" width=\"640\" /></a></div><p>While this kind of progress is exciting, optimizing for Core Web Vitals can still be challenging. That's why we've been improving our tools to help developers better monitor, measure, and understand site performance. Some of these changes include:</p> <ul><li>Updates in <a href=\"https://web.dev/whats-new-pagespeed-insights\">PageSpeed Insights</a> which make the distinction between \"field data\" from user experiences and \"lab data\" from the Lighthouse report more clear.</li></ul> <ul><li>Capabilities in <a href=\"https://developers.google.com/web/tools/lighthouse\">Lighthouse</a> to audit a complete <a href=\"https://web.dev/lighthouse-user-flows/\">user flow</a> by loading additional pages and simulating scrolls and link clicks.</li></ul> <ul><li>Support for user flows, such as a checkout flow, in <a href=\"https://developer.chrome.com/docs/devtools/\">DevTools</a> with a new <a href=\"https://goo.gle/devtools-recorder\">Recorder panel</a> for exporting a recorded user journey to Puppeteer script.</li></ul> <p>We're also experimenting with two new performance metrics: overall input responsiveness and scrolling and animation smoothness. We'd love to get your feedback, so take a spin through at <a href=\"https://web.dev/responsiveness\">web.dev/responsiveness</a> and <a href=\"https://web.dev/smoothness\">web.dev/smoothness</a>.</p> <h2>Expanding the Toolbox for Digital Interfaces </h2><p>We've got developers and designers covered with tons of changes coming down the pipeline for UI styling and DevTools, including updates to responsive design. Developers can now customize user experiences in a component-driven architecture model, and we're calling this The New Responsive: </p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-pgpFH-BDxeo/YYKbNyN00SI/AAAAAAAABtM/mOgRAUKbpGI6g5mGcYLLhL_kCjKV7cUigCLcBGAsYHQ/s1580/copyofchrome-c--q1umlaeb369.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"864\" data-original-width=\"1580\" height=\"350\" src=\"https://1.bp.blogspot.com/-pgpFH-BDxeo/YYKbNyN00SI/AAAAAAAABtM/mOgRAUKbpGI6g5mGcYLLhL_kCjKV7cUigCLcBGAsYHQ/w640-h350/copyofchrome-c--q1umlaeb369.png\" width=\"640\" /></a></div><br /><p><br /></p> <p>With the new container queries spec—available for testing behind a flag in <a href=\"https://www.google.com/chrome/canary/\">Chrome Canary</a>—developers can access a parent element's width to make styling decisions for its children, nest container queries, and create named queries for easier access and organization.</p> <p>This is a huge shift for component-based development, so we've been providing new DevTools for debugging, styling, and visualizing CSS layouts. To make creating interfaces even easier, we also launched a collection of <a href=\"https://web.dev/patterns/\">off-the-shelf UI patterns</a>.</p> <p>Developers who want to learn more can dive into free resources such as <a href=\"https://web.dev/learn/design/\">Learn Responsive Design</a> on web.dev—a collaboration with Clearleft's Jeremy Keith—and six new modules in our <a href=\"https://web.dev/learn/css/\">Learn CSS</a> course. There are also a few exciting CSS APIs in their first public working drafts, including: </p> <ul><li><strong>Scroll-timeline</strong> for animating an element as people scroll (available via the experimental web platform features flag in Chrome Canary).</li></ul> <ul><li><strong>Size-adjust property</strong> for typography (available in Chromium and Firefox stable).</li></ul> <ul><li><strong>Accent-color</strong> for giving form controls a theme color (available in Chromium and Firefox stable).</li></ul> <p>One feature we're really excited to build on is Dark Mode, especially because we found indications that dark themes use 11% less battery power than light themes for OLED screens. Stay tuned for a machine-learning-aided, auto-dark algorithm feature in an upcoming version of Chrome.</p> <h2>Buckling Down for the Road Ahead</h2><p>Part of what makes the web so special is that it's an open, decentralized ecosystem. We encourage everyone to make the most of this by getting involved in shaping the web's future in places such as: </p> <ul><li>The <a href=\"https://www.chromium.org/\">Chromium open-source project</a></li><li>Standards bodies such as the <a href=\"https://www.w3.org/\">W3C</a> and <a href=\"https://whatwg.org/\">WHATWG</a></li><li><a href=\"https://web.dev/\">web.dev</a> and our <a href=\"https://twitter.com/ChromiumDev?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\">@ChromiumDev</a> Twitter account</li><li>Workshops, group learning lounges, and one-on-one office hours we'll be hosting over the next month</li></ul> <p>We can't wait to see what the web looks like by next year's summit. Until then, check out our library of learning resources on the <a href=\"https://developer.chrome.com/devsummit/courses-and-content/\">Chrome Dev Summit site</a> and the <a href=\"https://www.youtube.com/channel/UCnUYZLuoy1rq1aVMwx4aTzw\">Chrome Developers YouTube channel</a>, and sign up for the <a href=\"https://web.dev/newsletter/\">web.dev newsletter</a>.</p>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Chromium Blog",
    "uri": "http://www.blogger.com/profile/06394244468194711527",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}