{
  "title": "9 ways Data Science can improve your business",
  "dc:creator": "Louis Dorard",
  "pubDate": "Mon, 12 Jan 2015 13:57:00 +0000",
  "link": "https://www.ownml.co/blog/data-science-business",
  "guid": "5206b718e4b0bdc26006bae2:5206b959e4b0bdc26006be4a:548b07e7e4b04308d753bc76",
  "description": "There's a number of ways you could be using Data Science (DS) in your \nbusiness. To manage your DS projects efficiently and have them deliver real \nvalue to your business, you should have a good overview of what DS can help \nyou with and how. I've listed 9 things that I've grouped in 3 areas:\n\n- I. Increasing the number of customers\n- II. Serving customers better\n- III. Serving customers more efficiently\n\nData Science can provide help in each area with the use of Machine Learning \ntechniques. The idea is to map situations to outcomes by analyzing data, so \nwe can then predict outcomes in new situations. Let’s see how this is used \nconcretely... ",
  "content:encoded": "<p>There's a number of ways you could be using Data Science (DS) in your business. To manage your DS projects efficiently and have them deliver real value to your business, you should have a good overview of what DS can help you with and how. I've listed 9 things, but let's first go back to some business fundamentals to see how this list is structured...</p>\n\n<p>Businesses serve customers. Better businesses serve more customers, they serve them better, and in a more efficient way. How well they’re doing that can be measured with revenue and costs, or simply with revenue-costs=profit. The different ways we can improve a business (increase profits) can thus be divided in 3 areas:</p>\n\n<ul>\n<li>I. Increasing the number of customers</li>\n<li>II. Serving customers better</li>\n<li>III. Serving customers more efficiently</li>\n</ul>\n\n<p>Data Science can help in these 3 areas through the use of \"supervised\" Machine Learning (ML) techniques. The idea is to map situations to outcomes, so we can predict outcomes in new situations. One example is predicting whether a customer who's presented a product (situation) will show interest in it or not (outcome). For that, Machine Learning techniques need examples to work with: situations (characterized as finely as possible, along with any contextual information) and outcomes observed in these situations. An analysis of the example data allows to find patterns, and thus relationships between situations and outcomes. Predictions on outcomes are made automatically by using these relationships. Let’s see how this is used in a business context… </p>\n\n<h2 id=\"iincreasingthenumberofcustomers\">I. Increasing the number of customers</h2>\n\n<p>There are two things that affect the number of customers: new customers coming and existing customers leaving.</p>\n\n<ul>\n<li><strong>1. Reducing customer attrition (a.k.a. “churn”)</strong>: We use historical customer data to map snapshots of customers taken at a given point in time (who they are, what they bought, how they interacted with products/services sold to them) to the fact they later churned or not (see my <a href=\"https://blog.kissmetrics.com/improve-by-predicting-churn/\">Kissmetrics article for more practical information</a>). Then, for each current customer we look at the likelihood of (predicted) churn, how valuable the customer is, and we take action to prevent the most valuable customers to churn.</li>\n<li><strong>2. Acquiring new customers</strong>:\n<ul><li><strong>Lead scoring</strong>: We map customers to revenue in order to predict the revenue we would get (if any) from a new prospective customer.</li>\n<li><strong>Optimizing marketing campaigns</strong>: We map lead-campaign combinations to conversion indicators. Then, for a given lead we predict the conversion likelihood with each possible campaign, we multiply that by the predicted revenue for that lead, factor in the cost of the campaign, and thus we can predict Return On Investment.</li></ul></li>\n</ul>\n\n<h2 id=\"iiservingcustomersbetter\">II. Serving customers better</h2>\n\n<p>Serving customers well implies offering products they’re interested in and can afford, or providing services they engage with.</p>\n\n<ul>\n<li><strong>3. Cross-selling products</strong>: We map customer-product pairs to purchase indicator (as recorded in historical data), so we know who to target when launching a new product or when promoting an existing one (you can also optimize promotional campaigns in the same way as seen previously).</li>\n<li><strong>4. Optimizing products and pricing</strong>: We map product characterizations (including price) to numbers of sales, so we can change the price and other characteristics to see how they impact revenue (price * number of sales) and thus to see what would work best.</li>\n<li><strong>5. Increasing engagement</strong>: We observe customer behavior when presented \"items\", in order to map customer-item pairs to interest indicators. We can then predict needs and interests&nbsp;and take them into account in the service provided to the customer.</li>\n</ul>\n\n<h2 id=\"iiiservingcustomersmoreefficiently\">III. Serving customers more efficiently</h2>\n\n<p>Here, we want to improve operations in order to reduce costs. Besides, serving customers efficiently often translates into serving customers well — for instance when we’re able to anticipate issues or to better handle customer support requests.</p>\n\n<ul>\n<li><strong>6. Predicting demand</strong>: This is important to businesses that observe high variability in demand for their services/products, for instance businesses who sell perishable goods: they need to avoid having too much or not enough in stock. The idea is to measure demand and the context in which it occurred, so we can map context to demand. This can also be used in order to decide how much staff to hire in anticipation of how busy the business is going to be.</li>\n<li><strong>7. Automating tasks</strong>: We can save time&nbsp;by having machines perform certain \"intelligent\" tasks automatically. Sometimes we already perform these tasks with hand-crafted rules, but we can also have the machine automatically learn (better?) rules from example data. One example is scoring credit applications or insurance claims, where the outcome is <em>approve</em> or <em>reject</em>. Performing risk analyses automatically from historical data can also be of interest to many, before investing time and money into new projects.</li>\n<li><p><strong>8. Making enterprise apps predictive</strong>: Apps used by employees for customer relationship management, enterprise resource planning, human resources, etc., can help them do their job more efficiently by embedding predictive features that... </p>\n\n<ul><li><strong>Prioritize things</strong>, to direct user focus to what's most important. This can be email (think Google Priority Inbox), customer support requests (to reply more quickly to the important ones),  mentions of your company you should reply to urgently, etc. The \"outcome\" for the corresponding learning tasks is <em>important</em> or <em>not important</em>.</li>\n<li><strong>Use adaptive workflows</strong> based on predictions rather than on manual rules. This can be for instance to route customer support requests to whom will treat them best, in which case the outcome is a customer support team or person.</li>\n<li><strong>Adapt the interface</strong> to show just what users need at the time they use the app, by mapping a context to an action that will need to be performed.</li>\n<li><strong>Set configurations and preferences automatically</strong> by analyzing application usage data.</li></ul>\n\n<p>As Katherine Barr, Partner at VC-firm MDV <a href=\"http://techcrunch.com/2014/12/31/7-venture-capitalists-predict-what-will-happen-in-2015/?ncid=txtlnkusaolp00000629\">said in TechCrunch</a>: \"Pairing human workers with machine learning and automation will transform knowledge work and unleash new levels of human productivity and creativity.\"</p></li>\n</ul>\n\n<h2 id=\"othermachinelearningtechniques\">Other machine learning techniques</h2>\n\n<p>Learning relationships between situations and outcomes is referred to as \"supervised learning\". The \"supervision\" is you telling the system that there is a particular outcome you're interested in. Machine learning techniques can also be used when there is no such outcome, in order to find structure in the data. In that case, we can just talk of \"data points\" instead of situations and outcomes, and we talk of \"unsupervised learning\" techniques. Here are two example applications of unsupervised learning:</p>\n\n<ul>\n<li><strong>9. Predictive maintenance</strong>: Each data point represents the state of a system at a given point in time, and we're interested in detecting states that are abnormal. The idea is that these states would later lead to issues/failures that would require considerable attention to be dealt with. Identifying anomalies in the state of a system allows to better focus the system's maintenance efforts by taking action before failure happens. It is another way of serving customers better and more efficiently. Anomaly detection is also used for fraud detection in credit card companies, where it is preferable to identify suspicious transactions and block them, rather than to reimburse the victim of the fraud after it's happened.</li>\n<li><strong>Segmentation (e.g. customer)</strong>: Each data point is a customer, you specify a number of segments (a.k.a. clusters) and the machine analyzes customer data to assign a segment to each customer, based on similarities between them. This allows to better understand the different types of customers there are. Segmentation can be used in any of the 9 goals listed previously, for instance it can be used to guide the process of creating marketing campaigns by creating at least one per segment.</li>\n</ul>\n\n<p>In the case where there are identified outcomes that we're interested in predicting, it is not always necessary to look for situation-outcome mappings. When looking to recommend items for instance (for cross-selling), you could either look for a mapping from customer and product characterizations to purchase indicator, or you could use other techniques to analyze graph data on who bought what in order to recommend products to a customer based on what others with similar habits bought (without having to look at customer or product characterizations).</p>\n\n<p>&nbsp;</p>\n\n<p>Now that we've seen the different business goals that Data Science and Machine Learning can help you pursue, the next step for you is to figure out the one that would deliver the most value to your business right now — which will it be?</p>\n<iframe scrolling=\"yes\" src=\"https://dl.dropboxusercontent.com/u/685335/optin.html\" allowtransparency=\"true\" width=\"100%\" frameborder=\"0\" id=\"mailchimp\" height=\"400px\"></iframe>\n\n<p>Enjoyed this article? <a href=\"http://www.twitter.com/louisdorard\">Follow me!</a></p>",
  "media:content": {
    "media:title": "9 ways Data Science can improve your business"
  }
}