{
  "title": "#447: Harry Potter Decade in Review",
  "link": "https://audioboom.com/posts/7461216",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4921,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>\n<strong>Please note: </strong>This episode was recorded prior to J.K. Rowling's <a href=\"https://www.nytimes.com/2019/12/19/world/europe/jk-rowling-maya-forstater-transgender.html?searchResultPosition=1\">controversial tweet</a>, which was harmful to the transgender community and allies. As <a href=\"https://twitter.com/MuggleCast/status/1207715938906320896\">we stated</a> on Twitter, trans rights are human rights. We see you, we love you. You are valid. We will always welcome you! We'll share additional thoughts on the situation in Episode 448.<br>\n<br>\n\n</div>\n<div>In our final episode of 2019, we take a look back at another Decade of Harry Potter by reliving the biggest moments and surprises of the past 10 years. What were we feeling then, how do we feel now, and what does it all mean for the decade ahead? Events discussed include: <br>\n<br>\n\n</div>\n<ul>\n<li>June 18, 2010: The Wizarding World of Harry Potter officially opens in Orlando (and basically saves Universal theme parks)!</li>\n<li>November 19, 2010: <em>Deathly Hallows: Part 1</em> hits theaters. It sets a trend for a single book to be split into two films, but this trend may've died this decade too.</li>\n<li>July 15, 2011: The final <em>Harry Potter</em> film, <em>Deathly Hallows: Part 2</em>, is released worldwide! The hosts share their feelings after the final movie, taking into consideration the number of years spent in the fandom.</li>\n<li>April 12, 2012: J.K. Rowling <a href=\"https://www.hollywoodreporter.com/news/jk-rowlings-adult-post-harry-potter-book-casual-vacancy-311519\">announces</a> her first post-<em>Potter</em> novel, <em>The Casual Vacancy. </em>Only one person on the panel has finished it.</li>\n<li>April 14, 2012: Pottermore launches at a time when people truly craved more from J.K. Rowling.</li>\n<li>April 2013: In one of the most shocking moments of the decade, J.K. Rowling secretly publishes <em>The Cuckoo’s Calling</em> under the pseudonym Robert Galbraith. We discuss how word leaked.</li>\n<li>August 27, 2013: MuggleCast ends... and then... two weeks later... Warner Bros. announces the <em>Fantastic Beasts</em> film series.</li>\n<li>December 19, 2013: We hear rumblings that a <em>Harry Potter</em> play is in development, and it looks nothing like what it became. </li>\n<li>January 14, 2016: Wands raised! Alan Rickman, the actor who brilliantly portrayed Professor Severus Snape passes away at 69.</li>\n<li>November 18, 2016: Magic returns to the silver screen as <em>Fantastic Beasts</em> hits theaters</li>\n<li>November 19, 2018: <em>Fantastic Beasts: The Crimes of Grindelwald</em> opens in theaters</li>\n<li>Spring 2019: J.K. Rowling leaves Twitter. Will she ever get back to her usual daily tweeting? </li>\n<li>October 2, 2019: Pottermore officially shuts down.</li>\n<li>What do we expect in the decade ahead for Potter? </li>\n<li>Quizzitch: What characters from the original Harry Potter series have also been in both Cursed Child and the Fantastic Beasts series?</li>\n<li>Bonus MuggleCast: We discuss the things we think will definitely NOT happen in the next decade in Potter!</li>\n<li>Join our community at <a href=\"http://www.Patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n</ul>\n",
  "pubDate": "Mon, 23 Dec 2019 13:00:00 +0000",
  "guid": "tag:audioboom.com,2019-12-22:/posts/7461216",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}