{
  "title": "Do average consumers still need Dropbox?",
  "link": "",
  "published": "2016-03-13T16:00:00-07:00",
  "updated": "2016-03-13T16:00:00-07:00",
  "author": {
    "name": "Wes McKinney"
  },
  "id": "tag:wesmckinney.com,2016-03-13:/blog/do-average-consumers-still-need-dropbox/",
  "summary": "<p><strong>TL;DR:</strong> At the risk of stating the obvious, manual management of files on\ndisks now in 2016 is increasingly old-fashioned and largely unnecessary,\nespecially among the non-technorati. Encapsulated / managed cloud services and\nconsumer web applications have made it anachronistic for most normal\npeople. Whether this is a good thing can be debated, but it is happening\nnonetheless.</p>\n<p>In this post, I explore this topic in some detail as it relates to my personal\nexperience.</p>",
  "content": "<p><strong>TL;DR:</strong> At the risk of stating the obvious, manual management of files on\ndisks now in 2016 is increasingly old-fashioned and largely unnecessary,\nespecially among the non-technorati. Encapsulated / managed cloud services and\nconsumer web applications have made it anachronistic for most normal\npeople. Whether this is a good thing can be debated, but it is happening\nnonetheless.</p>\n<p>In this post, I explore this topic in some detail as it relates to my personal\nexperience.</p>\n\n\n<h3>Data packratry</h3>\n<p>I'm something of a \"data packrat\". Next week is my 31st birthday, and I'm\ncarting around almost 2 decades worth of carefully curated files and other data\nwith personal importance going all the way back to 1998. Among other things\nthis includes:</p>\n<ul>\n<li>All of my e-mail from 1998 to 2006 before moving to GMail for personal email</li>\n<li>All school work high school onward. More LaTeX that I'd like to admit.</li>\n<li>Materials for conference talks and tutorials</li>\n<li>Sensitive personal documents: taxes, investments, expenses, and so forth</li>\n<li>Legal documents: 2 startups' worth of legal documents, apartment leases, and\n  any other contractual matters</li>\n<li>Miscellaneous computer backups (largely disorganized)</li>\n<li>Digital photos</li>\n</ul>\n<p>But, in general, I'm a weird person, so I have no idea how common this is.</p>\n<p>For me, Dropbox came along and radically simplified my personal data management\nafter many years of careful data stewardship on CD-R's, DVD-R's, and a\nsuccession of external hard drives. I also try to forget the number of times I\nforgot to e-mail myself an important file (or copy it to a thumb-drive). (I\nknow I should be moving to <a href=\"https://camlistore.org/\">Camlistore</a>. One of these days!)</p>\n<p>Just a couple of years ago, I went through my spindles of optical disks and\nexternal spinning-rust hard drives and consolidated the last of my precious\nbits in my Dropbox folder. It felt good to decommission all that old physical\nmedia, especially since I'd heard CD-Rs go bad after 20 or 30 years.</p>\n<h3>The Nomadic *Nix Hacker</h3>\n<p>I also work on any of 4 different computers at any given time: powerful desktop\nworkstations at home and at my desk at Cloudera, a Linux laptop for hacking\non-the-go, and a MacBook Pro for PowerPoint and other stuff (e.g. Adobe\nproducts) that don't work well (or at all) in Linux. To keep myself from\ncompletely going crazy, I use some tools to make the cost of jumping from one\nmachine to another low:</p>\n<ul>\n<li><strong>GitHub</strong>: for code, dotfiles, and other environment configuration</li>\n<li><strong>Dropbox</strong>: As a replacement for USB sticks and e-mail for miscellanea (and\n  big stuff that doesn't make sense to put in git)</li>\n</ul>\n<p>Thinking of my computers as fungible Chrome, git, and Emacs terminals has had\nhuge benefits for my productivity, but that's a whole different topic.</p>\n<p>Ubiquitous accessible-everywhere cloud storage has been very helpful for me,\nbut I suspect my needs are atypical. As indispensible as Dropbox has been for\nme as a file syncing tool for Linux, several things have made me wonder why\naverage consumers (who never open the system shell) will continue to need the\nproverbial \"magic folder\".</p>\n<h3>All your data are belong to us</h3>\n<p>The biggest state change to my personal data in the last 2 years was <strong>Google\nPhotos</strong>. After a short trial, I imported all of my digital photos (not that\nmuch of a shutterbug, honestly) from 2005 onward and deleted all the associated\nfiles from my Dropbox. <strong>It felt amazing</strong>. Pedants will note that Google\nPhotos is really just paying Google for cloud storage, but the liberating\naspect of it is that you don't have to wrangle files manually anymore.</p>\n<p>After a little more data reorganization (moving \"cold storage\" to Google Drive,\nwhich I started paying for because of Google Photos), I was able to stop paying\nfor Dropbox, and am unlikely to ever need to again.</p>\n<p>Then I got to thinking, <strong>what data do most average consumers really need to\nkeep in manually-managed cloud storage (aka Dropbox-like)?</strong> The kind of data\nthat I've been hoarding for the last almost-20 years is either irrelevant or\nbeing rapidly replaced by free or very low-cost managed mobile or web\napplications:</p>\n<ul>\n<li><strong>E-mail and messaging</strong>: GMail, Facebook, WhatsApp</li>\n<li><strong>Photos</strong>: Facebook, Instagram, Adobe Cloud products</li>\n<li><strong>Documents</strong>: Google Docs, Office 365, Evernote</li>\n<li><strong>Code (for hackers)</strong>: GitHub and friends</li>\n</ul>\n<p>The only thing I am not sure about is managing ad hoc \"sensitive\ndocuments\". For example: tax documentation, apartments and employment\ncontracts, expenses, and so forth. For now, I'm still bearing the mental burden\nof arranging files in folders and giving them names (naming things is\nexhausting).</p>\n<h3>Conclusions</h3>\n<p>As always, it will be interesting to see how the technology develops, but it\nwould be interesting if, for consumer use cases, manual file management could\nmostly become a thing of the past. The challenge will be how to handle the\noverflow of miscellanea not fitting into one of the tidy \"managed\" cloud\nbuckets.</p>\n<p>To me, the biggest opportunity that I think about is personal financial\ndocument management and taxes. Maybe in the future, we will have online\n\"continuous financial tracking\" so that, come tax season, we only have to\nreveal our personal finances to the IRS electronically and either send or\nreceive a tax payment (or refund).</p>"
}