{
  "id": "https://bibleinoneyear.org/en/youth/186",
  "title": "Day 186: The Light of God’s Smile of Blessing Is On You",
  "description": "Psalm 80:18b,19, 2 Kings vv.19b,20a,21, Acts 24:1–2,5–6,9–16,22–27.  The light of Jesus will always outshine the darkness around (John 1:5)  You have that light within you by the Holy Spirit and wherever you go you bring a light greater than the darkness around you",
  "pubDate": "Mon, 05 Jul 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/186/?ignore",
  "itunes:duration": "13:45",
  "guid": "enyouth05072021-186",
  "length": 825.81,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 186: The Light of God’s Smile of Blessing Is On You",
  "itunes:subtitle": "Psalm 80:18b,19, 2 Kings vv.19b,20a,21, Acts 24:1–2,5–6,9–16,22–27.  The light of Jesus will always outshine the darkness around (John 1:5)  You have that light within you by the Holy Spirit and wherever you go you bring a light greater than the darkness around you",
  "itunes:summary": "After the terrifying, appalling and deadly terrorist attack during her concert in 2017, Ariana Grande returned to the Manchester Arena for the ‘One Love Manchester’ concert. Marcus Mumford, lead singer of the band Mumford and Sons, opened the concert by proclaiming that ‘love casts out fear’. In the middle of the concert, Justin Bieber declared, ‘I’m not going to let go of love, not going to let go of God. God is good in the midst of darkness. God is in the midst. And he loves you. And he is here for you.’ It was like a bright light in the midst of the darkness.\nSt John of the Cross spoke of the ‘dark night of the soul’. I have gone through dark times in my life. There were dark times for the people of God both in the Old and New Testament times. There have been dark periods in the history of the church. But the light of the gospel has never gone out. The light of Jesus will always outshine the darkness around (John 1:5). You have that light within you by the Holy Spirit and wherever you go you bring a light greater than the darkness around you.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 186
}