{
  "title": "The Edition: can China escape its zero Covid trap?",
  "link": "https://audioboom.com/posts/8024516",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2381,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: Is China stuck in a zero-Covid trap?<br>\n<br>\nFor this week’s cover story, Cindy Yu looks at Xi Jinping’s attempt to grapple with Covid. She joins the podcast, along with Ben Cowling, Chair Professor of Epidemiology, School of Public Health, The University of Hong Kong. (01:42)<br>\n<br>\nAlso this week: Whose in The Zac Pack? And what is their influence in No.10?James Heale, <em>The Spectator’s</em> diary editor has written in this week’s magazine about The Zac Pack. A group made up of Carrie Johnson, Lord Goldsmith and some highly influential figures in the Westminster corridors. James is joined by Christian Calgie, a senior reporter at Guido Fawkes to discuss the power this group have in No.10. And their role in Pen Farthing’s animal evacuation out of Afghanistan. (16:40)<br>\n<br>\nAnd finally: A glance back 70 years ago, the Queen as a Princess. This weekend marks the 70th anniversary of Queen Elizabeth II’s accession to the throne. Graham Viney, author of The Last Hurrah: South Africa and the Royal Tour of 1947, writes this week's magazine about how she was prepared for that moment. He joins the podcast, along with the royal commentator and biographer, Angela Levin, author of ‘Harry: A biography of a Prince’. (28:41)<br>\n<br>\nHosted by Lara Prendergast and William MooreProduced by Natasha Feroze<br>\n<br>\nSubscribe to The Spectator today and get a £20 Amazon gift voucher: <a href=\"http://www.spectator.co.uk/voucher\">www.spectator.co.uk/voucher</a><br>\n<br>\nListen to Lara's food podcast Table Talk: <a href=\"https://www.spectator.co.uk/podcasts/table-talk\">https://www.spectator.co.uk/podcasts/table-talk</a>\n</div>\n",
  "pubDate": "Thu, 03 Feb 2022 17:47:34 +0000",
  "guid": "tag:audioboom.com,2022-02-03:/posts/8024516",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}