{
  "title": "Wild Crime",
  "link": "https://audioboom.com/posts/8115119",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 2859,
  "itunes:explicit": "no",
  "itunes:episodeType": "bonus",
  "description": "<div>Harold Henthorn had two wives, 18 years apart. Both women died mysteriously and both times, Harold was the only witness. ALSO each death resulted in massive insurance payouts for Harold. Harold's second wife, Toni, died in a national park. Harold says they had been on a hike, stopped at a scenic overlook, and she fell. But did he push her? When investigators dive into this case, nobody is prepared for what they would find. <br>\n<br>\nPATRICK AND GILLIAN ARE BRING TCO LIVE TO LONDON! Come see us Friday, July 22 at Cadogan Hall. <a href=\"https://www.aegpresents.co.uk/events/detail/true-crime-obsessed-live?cid=AEGPRESUK_TCO_London_SOCIAL_Artist_03052022_OGNC_\">GET YOUR TICKETS HERE!</a><br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 300 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"LuLaRich\"</strong> <strong>\"John Wayne Gacy: Devil in Disguise\" </strong>\"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><strong><br>\n<br>\n</strong><a href=\"https://www.indiegogo.com/projects/obsessed-fest-2022#/\">COME TO OBSESSED FEST!!</a> It's the first-ever OBSESSED NETWORK FAMILY WEEKEND! It's going to be a weekend full of live shows--OWD Friday night, TCO Saturday night (and two non-Obsessed Network live shows as well!), meet & greets, KARAOKE!, meetups, panel chats AND. ONE. INSANE. DRAG. BRUNCH!!! It's all happening at the Hyatt Regency in Columbus, Ohio from September 30 - October 2nd. <a href=\"https://www.indiegogo.com/projects/obsessed-fest-2022#/\">TICKETS ARE ALMOST GONE!! GET YOUR TICKET</a>\n</div>\n<div><br>\n</div>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 05 Jul 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-07-05:/posts/8115119",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}