{
  "id": "yt:video:fR9u2oLHFN8",
  "yt:videoId": "fR9u2oLHFN8",
  "yt:channelId": "UCAL3JXZSzSm8AlZyD3nQdBA",
  "title": "Primitive Technology: Improved Multi-Blade Blower",
  "link": "",
  "author": {
    "name": "Primitive Technology",
    "uri": "https://www.youtube.com/channel/UCAL3JXZSzSm8AlZyD3nQdBA"
  },
  "published": "2022-06-02T21:03:06+00:00",
  "updated": "2022-08-19T15:44:44+00:00",
  "media:group": {
    "media:title": "Primitive Technology: Improved Multi-Blade Blower",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Primitive Technology: Improved Multi-Blade Blower\nSubscribe: http://bit.ly/subPT | Never miss a video! Enable ‘ALL’ Notifications!\nWatch my newest content: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1&index=2\n\nFollow Primitive Technology:\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon: https://patreon.com/user?u=2945881\n\nWatch More Primitive Technology:\nNewest Uploads: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1&index=2\nPyrotechnology: https://youtube.com/playlist?list=PLGnWLXjIDnpBVRqu5lz5JGaQxjPs7q3CJ&playnext=1&index=2\nShelter: https://youtube.com/playlist?list=PLGnWLXjIDnpBBsdKZb-vy30o88SIxItp2&playnext=1&index=2\nWeapons: https://youtube.com/playlist?list=PLGnWLXjIDnpA-XGDrrmVgBnSXx15i2Awp&playnext=1&index=2\nPopular Videos: https://youtube.com/playlist?list=PLGnWLXjIDnpAb29Lrdki5BPjTpMon8zla&playnext=1&index=2\n\nAbout This Video:\nIn the 6 years since I developed the first forge blower (https://youtu.be/VVV4xeWBIxE) I had made very few improvements to it's design. So I decided to do some research and development to see if I could improve it's efficiency. From my research, increasing the number of fan blades from 4 to 8 yielded an increase of 19% volume of airflow. So I set about building a better fan. Instead of splitting the rotor and inserting blades made of bark into it, I made spokes from split cane to hold the blades leaving the rotor intact. This increased the longevity of the rotor as well as the spokes being heavier contributing more momentum, assisting the impeller in winding back in the other direction after each rotation. Instead of bark being used to for the blades, simple (and easier to find) folded leaves formed the blades. These, being flexible, are less likely to break against the walls of the housing as stiff bark does. Finally, a lid was added to the housing to make maintenance easier. The new blower works better than the old one with more airflow occurring. I experimented with different numbers of blades on the impeller (4,6 and 8). The more blades used, the slower the impeller can be spun to produce the same airflow. This makes it easier to operate as the users arms don't have to move as quickly, making it more ergonomic. This conservation of effort will be important in iron smelting later.\n\nAbout Primitive Technology:\nPrimitive technology is a hobby where you build things in the wild completely from scratch using no modern tools or materials. These are the strict rules: If you want a fire, use a fire stick - An axe, pick up a stone and shape it - A hut, build one from trees, mud, rocks etc. The challenge is seeing how far you can go without utilizing modern technology. I do not live in the wild, but enjoy building shelter, tools, and more, only utilizing natural materials. To find specific videos, visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber.\n\n#PrimitiveTechnology #MultiBladeBlower #Pyrotechnology",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}