{
  "title": "The well-posedness of the stochastic nonlinear Schr\\\"odinger equations in $H^2(\\mathbb{R}^d)$. (arXiv:2205.03095v2 [math.AP] UPDATED)",
  "link": "http://arxiv.org/abs/2205.03095",
  "description": "<p>The Cauchy problem for the stochastic nonlinear Schr\\\"odinger equation with a\nmultiplicable noise is considered where the nonlinear term is of a power type\nand its coefficients are complex numbers. In particular, it is extremely\nimportant to consider the complex coefficients in the noise which cover\nnon-conservative case, because they include measurement effects in quantum\nphysics. The main purpose of this paper is to construct classical solutions in\n$H^2(\\mathbb{R}^d)$ for the problem in question. The time local well-posedness\nin $L^2(\\mathbb{R}^d)$ and $H^1(\\mathbb{R}^d)$ was investigated in the papers\n[7,8]. In this paper we study the well-posedness in $H^2(\\mathbb{R}^d)$ by\nmaking use of the rescaling approach as a main tool for dealing with the\nmultiple noise, where we need to take advantage of a slight modification of the\ndeterministic Strichartz estimate to fit into requirements under the setting of\n$H^2(\\mathbb{R}^d)$. The other difficulty lies on the discussion on smoothness\nof functions in the nonlinear term, where the proof of time local\nwell-posedness for the case of $H^2$-solutions does not go similarly as in the\ncases of $L^2$-solutions or $H^1$-solutions, because of the complexity in the\ncomputation of the nonlinear term with lower exponent $\\alpha$. The techniques\nof Kato [18,19] work well on this difficulty even for the stochastic equations.\nWe use the stochastic Strichartz estimate [4,16,17] as well to deal with white\nnoise which did not appear in the proof for $L^2$-solutions or $H^1$-solutions.\nWe also discuss time-global solutions in $H^2(\\mathbb{R}^d)$.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/math/1/au:+Doku_I/0/1/0/all/0/1\">Isamu D&#xf4;ku</a>, <a href=\"http://arxiv.org/find/math/1/au:+Hashimoto_S/0/1/0/all/0/1\">Shunya Hashimoto</a>, <a href=\"http://arxiv.org/find/math/1/au:+Machihara_S/0/1/0/all/0/1\">Shuji Machihara</a>"
}