{
  "title": "Frank Sidney Jones, professor emeritus of urban affairs, dies at 93",
  "link": "https://news.mit.edu/2022/professor-emeritus-frank-sidney-jones-dies-1027",
  "description": "The first African American to receive tenure at MIT, Jones championed greater diversity and inclusion at the Institute and beyond.",
  "pubDate": "Thu, 27 Oct 2022 15:40:00 -0400",
  "guid": "https://news.mit.edu/2022/professor-emeritus-frank-sidney-jones-dies-1027",
  "dc:creator": "Takeo Kuwabara | School of Architecture and Planning",
  "content:encoded": "<p>Frank Sidney Jones, professor emeritus in MIT’s Department of Urban Studies and Planning (DUSP), passed away on Aug. 28 at the age of 93.</p>\n\n<p>In 1971, Jones was named Ford Professor of Urban Affairs and Planning, becoming <a href=\"https://www.technologyreview.com/2020/10/20/1009282/the-long-path-to-inclusivity/\">the first African American to be tenured at MIT</a>. He also taught courses in civil engineering.</p>\n\n<p>From his appointment in 1968 to his retirement in 1992, he focused on issues of race, poverty, and inequality, using his position to advocate for the expanded presence of people of color at the Institute.&nbsp;</p>\n\n<p>“Professor Jones epitomized so much of what we aspire to here in DUSP in our ongoing efforts in support of an antiracist transformation and the mobilization of our research, teaching, internal culture, and external partnerships toward excellence, justice, and diversity,” says Chris Zegras, professor of mobility and urban planning and DUSP department head. “While the world has lost a pioneer, his legacy lives on in our department, as well as across and beyond the Institute.”</p>\n\n<p>Jones was the youngest son of David Dallas and Susie Williams Jones, the president and first lady of Bennett College in Greensboro, North Carolina. After spending his early years in Greensboro, he moved to Boston and graduated from Phillips Andover Academy before attending Harvard College. At Harvard he was proud to be named the first African American manager of the Harvard football team in 1949.&nbsp;</p>\n\n<p>After completing his graduate studies at Harvard Business School (HBS) in 1957, Jones pursued an industry career and served as assistant dean at HBS. He joined MIT as executive director of the Urban Systems Laboratory in 1968.</p>\n\n<p>“Frank Jones was a wonderful colleague,” says professor emeritus and former MIT chancellor Phillip Clay PhD ’75. “He joined the DUSP faculty in the early 1970s, when I was a doctoral student. He was a source of encouragement in my early career. Frank challenged orthodoxy in both the literature and practice of urban planning. He promoted justice and inclusion as core values. He actively engaged students.”</p>\n\n<p>“Frank, together with Ken Manning, was among the first academics to understand the larger meaning of the HIV/AIDS crisis, teaching several courses and seminars to help students draw the meaning of the social impact of the public health crisis. Frank was a major player in the community. He was one of the organizers of The Partnership, an effort to attract Black professionals to the Boston area and provide a networking and professional development platform. The impact of his efforts changed MIT and many other Boston metro-area institutions and corporations.”</p>\n\n<p>Jones was the founding director of the Project on Technology, Race, and Poverty and served on a committee to help select a leader for the newly formed Office of Minority Education (OME), designed to advance the recruitment and education of students of color.</p>\n\n<p>Today, OME facilitates professional development and the building of personal and professional networks, and supports academic excellence for students who are underrepresented, including African American, Native American, and Latinx students across the Institute.</p>\n\n<p>In 1989, Jones was instrumental in creating the Martin Luther King, Jr. Professors and Scholars Program, which continues to bring distinguished visitors to share their wisdom with the MIT community.</p>\n\n<p>“Continuously, forcefully, and successfully, Frank leveled the playing field for African American scholars, reducing the systemic racism and offering paths for scholarship by African Americans at MIT,” says Wesley Harris, the Charles Stark Draper Professor of Aeronautics and Astronautics. “Frank’s sage counsel remains.”</p>\n\n<p>In addition to his work at MIT, Jones served on the governing boards of educational and community-focused organizations including: Mount Holyoke College, Phillips Academy, Charles Stark Draper Labs, Greater Roxbury Community Development Corporation, The Center for Creative Leadership, and The Partnership, Inc.</p>\n\n<p>Jones is survived by his two sons, Christopher and David; daughters-in-law Angela Cook-Jones and Sarah Niemczycki; five grandchildren; and eight nieces and nephews.</p>\n\n<p>“Professor Frank Jones cared deeply about excellence and equity and was a fierce advocate for his students. He inspired me, and frankly all his students, to always remember to help those most in need as we aimed to be our best,” says Karen Fulbright-Anderson MCP ’79, PhD ’85.</p>\n\n<p>Fulbright-Anderson spearheaded the creation of the <a href=\"https://giving.mit.edu/explore/schools/school-of-architecture-and-planning/urban-studies-planning\">Frank S. Jones Student Activities Fund</a> to honor Jones’s legacy of advocacy and compassionate action by supporting students as they work to help others and address some of society's most pressing issues.</p>\n\n<p>Donations honoring Jones's memory may be made to either the fund or Bennett College.<strong> </strong>A memorial service is planned for Nov. 12 at 2 p.m. in the MIT Chapel.</p>",
  "media:content": {
    "media:description": "From his appointment in 1968 to his retirement in 1992, Professor Frank S. Jones focused on issues of race, poverty, and inequality, using his position to advocate for the expanded presence of people of color at the Institute.",
    "media:credit": "Photo courtesy of the Jones family."
  },
  "category": [
    "Faculty",
    "Obituaries",
    "Urban studies and planning",
    "Race",
    "Poverty",
    "Diversity and inclusion",
    "History of MIT",
    "Aeronautical and astronautical engineering",
    "School of Architecture and Planning",
    "School of Engineering"
  ]
}