{
  "title": "Episode 119: &#8220;You Really Got Me&#8221; by the Kinks",
  "link": "https://500songs.com/podcast/episode-119-you-really-got-me-by-the-kinks/",
  "pubDate": "Mon, 05 Apr 2021 23:01:13 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-119-you-really-got-me-by-the-kinks/",
  "description": "Episode one hundred and nineteen of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"You Really Got Me\" by the Kinks, and the song that first took distorted guitar to number one. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/49676952\">on \"G.T.O.\" by Ronny and the Daytonas</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-119-you-really-got-me/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI've used several resources for this and future episodes on the Kinks, most notably<a href=\"https://amzn.to/3cOfO5z\">&nbsp;<em>Ray Davies: A Complicated Life</em></a> by Johnny Rogan and&nbsp;<a href=\"https://amzn.to/3uqKMqA\"><em>You Really Got Me&nbsp;</em></a>by Nick Hasted.\n\n<a href=\"https://amzn.to/2PBB1qE\"><em>X-Ray</em> by Ray Davies</a> is a remarkable autobiography with a framing story set in a dystopian science-fiction future, while&nbsp;<a href=\"https://amzn.to/3mnnHlD\"><em>Kink</em> by Dave Davies </a>is more revealing but less well-written.\n\n<a href=\"https://amzn.to/3sTNeFD\"><em>The Anthology 1964-1971</em> </a>is a great box set that covers the Kinks' Pye years, which overlap almost exactly with their period of greatest creativity. For those who don't want a full box set, <a href=\"https://amzn.to/3mnylZI\">this two-CD set </a>covers all the big hits.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're going to look at a record that has often been called \"the first heavy metal record\", one that introduced records dominated by heavy, distorted, guitar riffs to the top of the UK charts. We're going to look at the first singles by a group who would become second only to the Beatles among British groups in terms of the creativity of their recordings during the sixties, but who were always sabotaged by a record label more interested in short-term chart success than in artist development. We're going to look at the Kinks, and at \"You Really Got Me\":\n\n[Excerpt: The Kinks, \"You Really Got Me\"]\n\nThe story of the Kinks starts with two brothers, Ray and Dave Davies, the seventh and eighth children of a family that had previously had six girls in a row, most of them much older -- their oldest sister was twenty when Ray was born, and Dave was three years younger than Ray.\n\nThe two brothers always had a difficult relationship, partly because of their diametrically opposed personalities. Ray was introverted, thoughtful, and notoriously selfish, while Dave was outgoing in the extreme, but also had an aggressive side to his nature. Ray, as someone who had previously been the youngest child and only boy, resented his younger brother coming along and taking the attention he saw as his by right, while Dave always looked up to his older brother but never really got to know him.\n\nRay was always a quiet child, but he became more so after the event that was to alter the lives of the whole family in multiple ways forever. Rene, the second-oldest of his sisters, had been in an unhappy marriage and living in Canada with her husband, but moved back to the UK shortly before Ray's thirteenth birthday. Ray had been unsuccessfully pestering his parents to buy him a guitar for nearly a year, since Elvis had started to become popular, and on the night before his birthday, Rene gave him one as his birthday present.\n\nShe then went out to a dance hall. She did this even though she'd had rheumatic fever as a child, which had given her a heart condition. The doctors had advised her to avoid all forms of exercise, but she loved dancing too much to give it up for anyone.\n\nShe died that night, aged only thirty-one, and the last time Ray ever saw his sister was when she was giving him his guitar.\n\nFor the next year, Ray was even more introverted than normal, to the point that he ended up actually seeing a child psychologist, which for a working-class child in the 1950s was something that was as far from the normal experience as it's possible to imagine. But even more than that, he became convinced that he was intended by fate to play the guitar. He started playing seriously, not just the pop songs of the time, though there were plenty of those, but also trying to emulate Chet Atkins. Pete Quaife would later recall that when they first played guitar together at school, while Quaife could do a passable imitation of Hank Marvin playing \"Apache\", Davies could do a note-perfect rendition of Atkins' version of \"Malaguena\":\n\n[Excerpt: Chet Atkins, \"Malaguena\"]\n\nRay's newfound obsession with music also drew him closer to his younger brother, though there was something of a cynical motive in this closeness. Both boys got pocket money from their parents, but Dave looked up to his older brother and valued his opinion, so if Ray told him which were the good new records, Dave would go out and buy them -- and then Ray could play them, and spend his own money on other things.\n\nAnd it wasn't just pop music that the two of them were getting into, either. A defining moment of inspiration for both brothers came when a sixteen-minute documentary about Big Bill Broonzy's tour of Belgium, Low Light and Blue Smoke, was shown on the TV:\n\n[Excerpt: Big Bill Broonzy, \"When Did You Leave Heaven?\"]\n\nLike Broonzy's earlier appearances on Six-Five Special, that film had a big impact on a lot of British musicians -- you'll see clips from it both in the Beatles Anthology and in a 1980s South Bank Show documentary on Eric Clapton -- but it particularly affected Ray Davies for two reasons.\n\nThe first was that Ray, more than most people of his generation, respected the older generation's taste in music, and his father approved of Broonzy, saying he sounded like a real man, not like those high-voiced girly-sounding pop singers. The other reason was that Broonzy's performance sounded authentic to him. He said later that he thought that Broonzy sounded like him -- even though Broonzy was Black and American, he sounded *working class* (and unlike many of his contemporaries, Ray Davies did have a working-class background, rather than being comparatively privileged like say John Lennon or Mick Jagger were).\n\nSoon Ray and Dave were playing together as a duo, while Ray was also performing with two other kids from school, Pete Quaife and John Start, as a trio. Ray brought them all together, and they became the Ray Davies Quartet -- though sometimes, if Pete or Dave rather than Ray got them the booking, they would be the Pete Quaife Quartet or the Dave Davies Quartet. The group mostly performed instrumentals, with Dave particularly enjoying playing \"No Trespassing\" by the Ventures:\n\n[Excerpt: The Ventures, \"No Trespassing\"]\n\nBoth Ray and Dave would sing sometimes, with Ray taking mellower, rockabilly, songs, while Dave would sing Little Richard and Lightnin' Hopkins material, but at first they thought they needed a lead singer. They tried with a few different people, including another pupil from the school they all went to who sang with them at a couple of gigs, but John Start's mother thought the young lad's raspy voice was so awful she wouldn't let them use her house to rehearse, and Ray didn't like having another big ego in the group, so Rod Stewart soon went back to the Moontrekkers and left them with no lead singer.\n\nBut that was far from the worst problem the Davies brothers had. When Dave was fifteen, he got his sixteen-year-old girlfriend Susan pregnant. The two were very much in love, and wanted to get married, but both children's parents were horrified at the idea, and so each set of parents told their child that the other had dumped them and never wanted to see them again. Both believed what they were told, and Dave didn't see his daughter for thirty years. The trauma of this separation permanently changed him, and you can find echoes of it throughout Dave's songwriting in the sixties.\n\nRay and Pete, after leaving school, went on to Hornsey Art School, where coincidentally Rod Stewart had also moved on to the year before, though Stewart had dropped out after a few weeks after discovering he was colour-blind. Quaife also dropped out of art school relatively soon after enrolling -- he was kicked out for \"Teddy Boy behaviour\", but his main problem was that he didn't feel comfortable as a working-class lad mixing with Bohemian middle-class people.\n\nRay, on the other hand, was in his element. While Ray grew up on a council estate and was thoroughly working-class, he had always had a tendency to want to climb the social ladder, and he was delighted to be surrounded by people who were interested in art and music, though his particular love at the time was the cinema, and he would regularly go to the college film society's showings of films by people like Bergman, Kurosawa and Truffaut, or silent films by Eisenstein or Griffith, though he would complain about having to pay a whole shilling for entry.\n\nDavies also starred in some now-lost experimental films made by the person who ran the film society, and also started branching out into playing with other people. After a gig at the art college, where Alexis Korner had been supported by the young Rolling Stones, Davies went up to Korner and asked him for advice about moving on in the music world. Korner recommended he go and see Giorgio Gomelsky, the promoter and manager who had put on most of the Stones' early gigs, and Gomelsky got Davies an audition with a group called the Dave Hunt Rhythm and Blues Band. Tom McGuinness had been offered a job with them before he went on to Manfred Mann, but McGuinness thought that the Dave Hunt band were too close to trad for his tastes. Davies, on the other hand, was perfectly happy playing trad along with the blues, and for a while it looked like the Ray Davies Quartet were over, as Ray was getting more prestigious gigs with the Dave Hunt group. Ray would later recall that the Dave Hunt band's repertoire included things like the old Meade Lux Lewis boogie piece \"Honky Tonk Train Blues\", which they would play in the style of Bob Crosby's Bobcats:\n\n[Excerpt: Bob Crosby and the Bobcats, \"Honky Tonk Train Blues\"]\n\nBut while the group were extremely good musicians -- their soprano saxophone player, Lol Coxhill, would later become one of the most respected sax players in Britain and was a big part of the Canterbury Scene in the seventies -- Ray eventually decided to throw his lot in with his brother. While Ray had been off learning from these jazz musicians, Dave, Pete, and John had continued rehearsing together, and occasionally performing whenever Ray was free to join them. The group had by now renamed themselves the Ramrods, after a track by Duane Eddy, who was the first rock and roll musician Ray and Dave had see live:\n\n[Excerpt: Duane Eddy, \"Ramrod\"]\n\nDave had become a far more accomplished guitarist, now outshining his brother, and was also getting more into the London R&B scene. Ray later remembered that the thing that swung it for him was when Dave played him a record by Cyril Davies, \"Country Line Special\", which he thought of as a bridge between the kind of music he was playing with Dave Hunt and the kind of music he wanted to be playing, which he described as \"Big Bill Broonzy with drums\":\n\n[Excerpt: Cyril Davies, \"Country Line Special\"]\n\nThat was, coincidentally, the first recording to feature the piano player Nicky Hopkins, who would later play a big part in the music Ray, Dave, and Pete would make.\n\nBut not John. Shortly after Ray got serious about the Ramrods -- who soon changed their name again to the Boll Weevils -- John Start decided it was time to grow up, get serious, give up the drums, and become a quantity surveyor. There were several factors in this decision, but a big one was that he simply didn't like Ray Davies, who he viewed as an unpleasant, troubled, person.\n\nStart was soon replaced by another drummer, Mickey Willett, and it was Willett who provided the connection that would change everything for the group. Willett was an experienced musician, who had contacts in the business, and so when a rich dilettante wannabe pop star named Robert Wace and his best friend and \"manager\" Grenville Collins were looking for a backing band for Wace, one of Willett's friends in the music business pointed them in the direction of the Boll Weevils.\n\nRobert Wace offered the Boll Weevils a deal -- he could get them lucrative gigs playing at society functions for his rich friends, if they would allow him to do a couple of songs with them in the middle of the show. Wace even got Brian Epstein to come along and see a Boll Weevils rehearsal, but it wasn't exactly a success -- Mickey Willett had gone on holiday to Manchester that week, and the group were drummerless. Epstein said he was vaguely interested in signing Ray as a solo artist, but didn't want the group, and nothing further came of it.\n\nThis is particularly odd because at the time Ray wasn't singing any solo leads. Robert Wace would sing his solo spot, Dave would take the lead vocals on most of the upbeat rockers, and Ray and Dave would sing unison leads on everything else. The group were soon favourites on the circuit of society balls, where their only real competition was Mike d'Abo's band A Band of Angels -- d'Abo had been to Harrow, and so was part of the upper class society in a way that the Boll Weevils weren't.\n\nHowever, the first time they tried to play a gig in front of an audience that weren't already friends of Wace, he was booed off stage. It became clear that there was no future for Robert Wace as a pop star, but there was a future for the Boll Weevils. They came to a deal -- Wace and Collins would manage the group, Collins would put in half his wages from his job as a stockbroker, and Wace and Collins would get fifty percent of the group's earnings.\n\nWace and Collins funded the group recording a demo. They recorded two songs, the old Coasters song \"I'm A Hog For You Baby\":\n\n[Excerpt: The Boll Weevils, \"I'm A Hog For You Baby\"]\n\nand a Merseybeat pastiche written by Dave Davies, \"I Believed You\":\n\n[Excerpt: The Ravens, \"I Believed You\"]\n\nIt shows how up in the air everything was that those tracks have since been released under two names -- at some point around the time of the recording session, the Boll Weevils changed their name yet again, to The Ravens, naming themselves after the recent film, starring Vincent Price, based on the Edgar Allen Poe poem.\n\nThis lineup of the Ravens wasn't to last too long, though. Mickey Willett started to get suspicious about what was happening to all of the money, and became essentially the group's self-appointed shop steward, getting into constant rows with the management. Willett soon found himself edged out of the group by Wace and Collins, and the Ravens continued with a temporary drummer until they could find a permanent replacement.\n\nWace and Collins started to realise that neither of them knew much about the music business, though, and so they turned elsewhere for help with managing the group. The person they turned to was Larry Page. This is not the Larry Page who would later co-found Google, rather he was someone who had had a brief career as an attempt at producing a British teen idol under the name \"Larry Page, the Teenage Rage\" -- a career that was somewhat sabotaged by his inability to sing, and by his producer's insistence that it would be a good idea to record this, as the original was so bad it would never be a hit in the UK:\n\n[Excerpt: Larry Page, \"That'll be the Day\"]\n\nAfter his career in music had come to an ignominious end, Page had briefly tried working in other fields, before going into management. He'd teamed up with Eddie Kassner, an Austrian songwriter who had written for Vera Lynn before going into publishing. Kassner had had the unbelievable fortune to buy the publishing rights for \"Rock Around the Clock\" for two hundred and fifty dollars, and had become incredibly rich, with offices in both London and New York.\n\nPage and Kassner had entered into a complicated business arrangement by which Kassner got a percentage of Page's management income, Kassner would give Page's acts songs, and any song Page's acts wrote would be published by Kassner.\n\nKassner and Page had a third partner in their complicated arrangements -- independent producer Shel Talmy. Talmy had started out as an engineer in Los Angeles, and had come over to the UK for a few weeks in 1962 on holiday, and thought that while he was there he might as well see if he could get some work. Talmy was a good friend of Nik Venet, and Venet gave him a stack of acetates of recent Capitol records that he'd produced, and told him that he could pretend to have produced them if it got him work.\n\nTalmy took an acetate of \"Surfin' Safari\" by the Beach Boys, and one of \"Music in the Air\" by Lou Rawls, into Dick Rowe's office and told Rowe he had produced them. Sources differ over whether Rowe actually believed him, or if he just wanted anyone who had any experience of American recording studio techniques, but either way Rowe hired him to produce records for Decca as an independent contractor, and Talmy started producing hits like \"Charmaine\" by the Bachelors:\n\n[Excerpt: The Bachelors, \"Charmaine\"]\n\nPage, Kassner, Talmy, and Rowe all worked hand in glove with each other, with Page managing artists, Kassner publishing the songs they recorded, Talmy producing them and Rowe signing them to his record label. And so by contacting Page, Wace and Collins were getting in touch with a team that could pretty much guarantee the Ravens a record deal. They cut Page in on the management, signed Ray and Dave as songwriters for Kassner, and got Talmy to agree to produce the group.\n\nThe only fly in the ointment was that Rowe, showing the same judgement he had shown over the Beatles, turned down the opportunity to sign the Ravens to Decca. They had already been turned down by EMI, and Phillips also turned them down, which meant that by default they ended up recording for Pye records, the same label as the Searchers.\n\nAround the time they signed to Pye, they also changed their name yet again, this time to the name that they would keep for the rest of their careers. In the wake of the Profumo sex scandal, and the rumours that went around as a result of it, including that a Cabinet minister had attended orgies as a slave with a sign round his neck saying to whip him if he displeased the guests, there started to be a public acknowledgement of the concept of BDSM, and \"kinky\" had become the buzzword of the day, with the fashionable boots worn by the leather-clad Honor Blackman in the TV show The Avengers being publicised as \"kinky boots\". Blackman and her co-star Patrick MacNee even put out a novelty single, \"Kinky Boots\", in February 1964:\n\n[Excerpt: Patrick MacNee and Honor Blackman, \"Kinky Boots\"]\n\nPage decided that this was too good an opportunity to miss, and that especially given the camp demeanour of both Dave Davies and Pete Quaife it would make sense to call the group \"the Kinks\", as a name that would generate plenty of outrage but was still just about broadcastable. None of the group liked the name, but they all went along with it, and so Ray, Dave, and Pete were now The Kinks.\n\nThe ever-increasing team of people around them increased by one more when a promoter and booking agent got involved. Arthur Howes was chosen to be in charge of the newly-named Kinks' bookings primarily because he booked all the Beatles' gigs, and Wade and Collins wanted as much of the Beatles' reflected glory as they could get. Howes started booking the group in for major performances, and Ray finally quit art school -- though he still didn't think that he was going to have a huge amount of success as a pop star. He did, though, think that if he was lucky he could make enough money from six months of being a full time pop musician that he could move to Spain and take guitar lessons from Segovia.\n\nPye had signed the Kinks to a three-single deal, &nbsp;and Arthur Howes was the one who suggested what became their first single. Howes was in Paris with the Beatles in January 1964, and he noticed that one of the songs that was getting the biggest reaction was their cover version of Little Richard's \"Long Tall Sally\", and that they hadn't yet recorded the song. He phoned Page from Paris, at enormous expense, and told him to get the Kinks into the studio and record the song straight away, because it was bound to be a hit for someone. The group worked up a version with Ray on lead, and recorded it three days later:\n\n[Excerpt: The Kinks, \"Long Tall Sally\"]\n\nRay later recollected that someone at the studio had said to him \"Congratulations, you just made a flop\", and they were correct -- the Kinks' version had none of the power of Little Richard's original or of the Beatles' version, and only scraped its way to number forty-two on the charts.\n\nAs they had no permanent drummer, for that record, and for the next few they made, the Kinks were augmented by Bobby Graham, who had played for Joe Meek as one of Mike Berry and the Outlaws before becoming one of the two main on-call session drummers in the UK, along with fellow Meek alumnus Clem Cattini. Graham is now best known for having done all the drumming credited to Dave Clark on records by the Dave Clark Five such as \"Bits and Pieces\":\n\n[Excerpt: The Dave Clark Five, \"Bits and Pieces\"]\n\nIt's also been reported by various people, notably Shel Talmy, that the session guitarist Jimmy Page played Ray Davies' rhythm parts for him on most of the group's early recordings, although other sources dispute that, including Ray himself who insists that he played the parts. What's definitely not in doubt is that Dave Davies played all the lead guitar.\n\nHowever, the group needed a full-time drummer. Dave Davies wanted to get his friend Viv Prince, the drummer of the Pretty Things, into the group, but when Prince wasn't available they turned instead to Mick Avory, who they found through an ad in the Melody Maker. Avory had actually been a member of the Rolling Stones for a very brief period, but had decided he didn't want to be a full-time drummer, and had quit before they got Charlie Watts in.\n\nAvory was chosen by Ray and the management team, and Dave Davies took an instant dislike to him, partly because Ray liked Avory, but accepted that he was the best drummer available.\n\nAvory wouldn't play on the next few records -- Talmy liked to use musicians he knew, and Avory was a bit of an unknown quantity -- but he was available for the group's first big tour, playing on the bottom of the bill with the Dave Clark Five and the Hollies further up, and their first TV appearance, on Ready Steady Go.\n\nThat tour saw the group getting a little bit of notice, but mostly being dismissed as being a clone of the Rolling Stones, because like the Stones they were relying on the same set of R&B standards that all the London R&B bands played, and the Stones were the most obvious point of reference for that kind of music for most people. Arthur Howes eventually sent someone up to work on the Kinks' stage act with them, and to get them into a more showbiz shape, but the person in question didn't get very far before Graham Nash of the Hollies ordered him to leave the Kinks alone, saying they were \"OK as they are\".\n\nMeanwhile, Larry Page was working with both Ray and Dave as potential songwriters, and using their songs for other acts in the Page/Kassner/Talmy stable of artists. With Talmy producing, Shel Naylor recorded Dave's \"One Fine Day\", a song which its writer dismisses as a throwaway but is actually quite catchy:\n\n[Excerpt: Shel Naylor, \"One Fine Day\"]\n\nAnd Talmy also recorded a girl group called The Orchids, singing Ray's \"I've Got That Feeling\":\n\n[Excerpt: The Orchids, \"I've Got That Feeling\"]\n\nPage also co-wrote a couple of instrumentals with Ray, who was the brother who was more eager to learn the craft of songwriting -- at this point, Dave seemed to find it something of a chore.\n\nPage saw it as his job at this point to teach the brothers how to write -- he had a whole set of ideas about what made for a hit song, and chief among them was that it had to make a connection between the singer and the audience. He told the brothers that they needed to write songs with the words \"I\", \"Me\", and \"You\" in the title, and repeat those words as much as possible.\n\nThis was something that Ray did on the song that became the group's next single, \"You Still Want Me\", a Merseybeat pastiche that didn't even do as well as the group's first record:\n\n[Excerpt: The Kinks, \"You Still Want Me\"]\n\nThe group were now in trouble. They'd had two flop singles in a row, on a three-single contract. It seemed entirely likely that the label would drop them after the next single. Luckily for them, they had a song that they knew was a winner.\n\nRay had come up with the basic melody for \"You Really Got Me\" many years earlier. The song had gone through many changes over the years, and had apparently started off as a jazz piano piece inspired by Gerry Mulligan's performance in the classic documentary Jazz On A Summer's Day:\n\n[Excerpt: Gerry Mulligan, \"As Catch Can\"]\n\nFrom there it had apparently mutated first into a Chet Atkins style guitar instrumental and then into a piece in the style of Mose Allison, the jazz and R&B singer who was a huge influence on the more Mod end of the British R&B scene with records like \"Parchman Farm\":\n\n[Excerpt: Mose Allison, \"Parchman Farm\"]\n\nThrough all of this, the basic melody had remained &nbsp;the same, as had the two chords that underpinned the whole thing. But the song's final form was shaped to a large extent by the advice of Larry Page. As well as the \"you\" and \"me\" based lyrics, Page had also advised Ray that as he wasn't a great singer at this point, what the group needed to do was to concentrate on riffs. In particular, he'd pointed Ray to \"Louie Louie\" by the Kingsmen, which had recently been released in the UK on Pye, the same label the Kinks were signed to, and told him to do something like that:\n\n[Excerpt: The Kingsmen, \"Louie Louie\"]\n\nRay was instantly inspired by \"Louie Louie\", which the Kinks quickly added to their own set, and he retooled his old melody in its image, coming up with a riff to go under it. It seems also to have been Page who made one minor change to the lyric of the song. Where Ray had started the song with the line \"Yeah, you really got me going,\" Page suggested that instead he sing \"Girl, you really got me going\", partly to increase that sense of connection with the audience again, partly to add a tiny bit of variety to the repetitive lyrics, but also partly because the group's sexuality was already coming in for some question -- Dave Davies is bisexual, and Ray has always been keen to play around with notions of gender and sexuality. Starting with the word \"girl\" might help reassure people about that somewhat.\n\nBut the final touch that turned it into one of the great classics came from Dave, rather than Ray. Dave had been frustrated with the sound he was getting from his amplifier, and had slashed the cone with a knife. He then fed the sound from that slashed amp through his new, larger, amp, to get a distorted, fuzzy, sound which was almost unknown in Britain at the time. We've heard examples of fuzz guitar before in this series, of course -- on \"Rocket '88\", and on some of the Johnny Burnette Rock 'n' Roll Trio records, and most recently last week on Ellie Greenwich's demo of \"Do-Wah-Diddy\", but those had been odd one-offs. Dave Davies' reinvention of the sound seems to be the point where it becomes a standard part of the rock guitar toolbox -- but it's very rarely been done as well as it was on \"You Really Got Me\":\n\n[Excerpt: The Kinks, \"You Really Got Me\"]\n\nBut that introduction, and the classic record that followed, nearly never happened. The original recording of \"You Really Got Me\" has been lost, but it was apparently very different. Ray and Dave Davies have said that Shel Talmy overproduced it, turning it into a Phil Spector soundalike, and drenched the whole thing with echo. Talmy, for his part, says that that's not the case -- that the main difference was that the song was taken much slower, and that it was a very different but equally valid take on the song.\n\nRay, in particular, was devastated by the result, and didn't want it released. Pye were insistent -- they had a contract, and they were going to put this record out whatever the performers said. But luckily the group's management had faith in their singer's vision. Larry Page insisted that as he and Kassner owned the publishing, the record couldn't come out in the state it was in, and Robert Wace paid for a new recording session out of his own pocket.\n\nThe group, plus Bobby Graham, piano player Arthur Greenslade, and Talmy, went back into the studio. The first take of the new session was a dud, and Ray worried that Talmy would end the session then and there, but he allowed them to do a second take. And that second take was extraordinary. Going into the solo, Ray yelled \"Oh no!\" with excitement, looking over at Dave, and became convinced that he'd distracted Dave at the crucial moment. Instead, he delivered one of the defining solos of the rock genre:\n\n[Excerpt: The Kinks, \"You Really Got Me\"]\n\n\"You Really Got Me\" was released on the fourth of August 1964, and became a smash hit, reaching number one in September. It was also released in the US, and made the top ten over there. The Kinks were suddenly huge, and Pye Records quickly exercised their option -- so quickly, that the group needed to get an album recorded by the end of August.\n\nThe resulting album is, as one might expect, a patchy affair, made up mostly of poor R&B covers, but there were some interesting moments, and one song from the album in particular, \"Stop Your Sobbing\", showed a giant leap forward in Ray's songwriting:\n\n[Excerpt: The Kinks, \"Stop Your Sobbing\"]\n\nThere may be a reason for that. \"Stop Your Sobbing\" features backing vocals by someone new to the Kinks' circle, Ray's new girlfriend Rasa Didzpetris, who would become a regular feature on the group's records for the next decade. And when we next look at the Kinks, we'll see some of the influence she had on the group.",
  "itunes:subtitle": "Episode one hundred and nineteen of A History of Rock Music in Five Hundred Songs looks at You Really Got Me by the Kinks, and the song that first took distorted guitar to number one. Click the full post to read liner notes, links to more information, an",
  "itunes:keywords": "Alexis Korner,art school,Big Bill Broonzy,British rock,Chet Atkins,Cyril Davies,Dave Davies,Decca Records,Dick Rowe,distorted guitar,Giorgio Gomelsky,Jimmy Page,Joe Meek,Larry Page,Mick Avory,Mike d&#039;Abo,Nicky Hopkins,Nik Venet,Pye Records,Rasa Didzpetris,Ray Davies,riffs,Rod Stewart,Shel Talmy,Six-Five Special,The Kinks,Tom McGuinness",
  "itunes:episodeType": "full",
  "itunes:episode": 119,
  "content:encoded": "Episode one hundred and nineteen of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"You Really Got Me\" by the Kinks, and the song that first took distorted guitar to number one. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/49676952\">on \"G.T.O.\" by Ronny and the Daytonas</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-119-you-really-got-me/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI've used several resources for this and future episodes on the Kinks, most notably<a href=\"https://amzn.to/3cOfO5z\">&nbsp;<em>Ray Davies: A Complicated Life</em></a> by Johnny Rogan and&nbsp;<a href=\"https://amzn.to/3uqKMqA\"><em>You Really Got Me&nbsp;</em></a>by Nick Hasted.\n\n<a href=\"https://amzn.to/2PBB1qE\"><em>X-Ray</em> by Ray Davies</a> is a remarkable autobiography with a framing story set in a dystopian science-fiction future, while&nbsp;<a href=\"https://amzn.to/3mnnHlD\"><em>Kink</em> by Dave Davies </a>is more revealing but less well-written.\n\n<a href=\"https://amzn.to/3sTNeFD\"><em>The Anthology 1964-1971</em> </a>is a great box set that covers the Kinks' Pye years, which overlap almost exactly with their period of greatest creativity. For those who don't want a full box set, <a href=\"https://amzn.to/3mnylZI\">this two-CD set </a>covers all the big hits.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're going to look at a record that has often been called \"the first heavy metal record\", one that introduced records dominated by heavy, distorted, guitar riffs to the top of the UK charts. We're going to look at the first singles by a group who would become second only to the Beatles among British groups in terms of the creativity of their recordings during the sixties, but who were always sabotaged by a record label more interested in short-term chart success than in artist development. We're going to look at the Kinks, and at \"You Really Got Me\":\n\n[Excerpt: The Kinks, \"You Really Got Me\"]\n\nThe story of the Kinks starts with two brothers, Ray and Dave Davies, the seventh and eighth children of a family that had previously had six girls in a row, most of them much older -- their oldest sister was twenty when Ray was born, and Dave was three years younger than Ray.\n\nThe two brothers always had a difficult relationship, partly because of their diametrically opposed personalities. Ray was introverted, thoughtful, and notoriously selfish, while Dave was outgoing in the extreme, but also had an aggressive side to his nature. Ray, as someone who had previously been the youngest child and only boy, resented his younger brother coming along and taking the attention he saw as his by right, while Dave always looked up to his older brother but never really got to know him.\n\nRay was always a quiet child, but he became more so after the event that was to alter the lives of the whole family in multiple ways forever. Rene, the second-oldest of his sisters, had been in an unhappy marriage and living in Canada with her husband, but moved back to the UK shortly before Ray's thirteenth birthday. Ray had been unsuccessfully pestering his parents to buy him a guitar for nearly a year, since Elvis had started to become popular, and on the night before his birthday, Rene gave him one as his birthday present.\n\nShe then went out to a dance hall. She did this even though she'd had rheumatic fever as a child, which had given her a heart condition. The doctors had advised her to avoid all forms of exercise, but she loved dancing too much to give it up for anyone.\n\nShe died that night, aged only thirty-one, and the last time Ray ever saw his sister was when she was giving him his guitar.\n\nFor the next year, Ray was even more introverted than normal, to the point that he ended up actually seeing a child psychologist, which for a working-class child in the 1950s was something that was as far from the normal experience as it's possible to imagine. But even more than that, he became convinced that he was intended by fate to play the guitar. He started playing seriously, not just the pop songs of the time, though there were plenty of those, but also trying to emulate Chet Atkins. Pete Quaife would later recall that when they first played guitar together at school, while Quaife could do a passable imitation of Hank Marvin playing \"Apache\", Davies could do a note-perfect rendition of Atkins' version of \"Malaguena\":\n\n[Excerpt: Chet Atkins, \"Malaguena\"]\n\nRay's newfound obsession with music also drew him closer to his younger brother, though there was something of a cynical motive in this closeness. Both boys got pocket money from their parents, but Dave looked up to his older brother and valued his opinion, so if Ray told him which were the good new records, Dave would go out and buy them -- and then Ray could play them, and spend his own money on other things.\n\nAnd it wasn't just pop music that the two of them were getting into, either. A defining moment of inspiration for both brothers came when a sixteen-minute documentary about Big Bill Broonzy's tour of Belgium, Low Light and Blue Smoke, was shown on the TV:\n\n[Excerpt: Big Bill Broonzy, \"When Did You Leave Heaven?\"]\n\nLike Broonzy's earlier appearances on Six-Five Special, that film had a big impact on a lot of British musicians -- you'll see clips from it both in the Beatles Anthology and in a 1980s South Bank Show documentary on Eric Clapton -- but it particularly affected Ray Davies for two reasons.\n\nThe first was that Ray, more than most people of his generation, respected the older generation's taste in music, and his father approved of Broonzy, saying he sounded like a real man, not like those high-voiced girly-sounding pop singers. The other reason was that Broonzy's performance sounded authentic to him. He said later that he thought that Broonzy sounded like him -- even though Broonzy was Black and American, he sounded *working class* (and unlike many of his contemporaries, Ray Davies did have a working-class background, rather than being comparatively privileged like say John Lennon or Mick Jagger were).\n\nSoon Ray and Dave were playing together as a duo, while Ray was also performing with two other kids from school, Pete Quaife and John Start, as a trio. Ray brought them all together, and they became the Ray Davies Quartet -- though sometimes, if Pete or Dave rather than Ray got them the booking, they would be the Pete Quaife Quartet or the Dave Davies Quartet. The group mostly performed instrumentals, with Dave particularly enjoying playing \"No Trespassing\" by the Ventures:\n\n[Excerpt: The Ventures, \"No Trespassing\"]\n\nBoth Ray and Dave would sing sometimes, with Ray taking mellower, rockabilly, songs, while Dave would sing Little Richard and Lightnin' Hopkins material, but at first they thought they needed a lead singer. They tried with a few different people, including another pupil from the school they all went to who sang with them at a couple of gigs, but John Start's mother thought the young lad's raspy voice was so awful she wouldn't let them use her house to rehearse, and Ray didn't like having another big ego in the group, so Rod Stewart soon went back to the Moontrekkers and left them with no lead singer.\n\nBut that was far from the worst problem the Davies brothers had. When Dave was fifteen, he got his sixteen-year-old girlfriend Susan pregnant. The two were very much in love, and wanted to get married, but both children's parents were horrified at the idea, and so each set of parents told their child that the other had dumped them and never wanted to see them again. Both believed what they were told, and Dave didn't see his daughter for thirty years. The trauma of this separation permanently changed him, and you can find echoes of it throughout Dave's songwriting in the sixties.\n\nRay and Pete, after leaving school, went on to Hornsey Art School, where coincidentally Rod Stewart had also moved on to the year before, though Stewart had dropped out after a few weeks after discovering he was colour-blind. Quaife also dropped out of art school relatively soon after enrolling -- he was kicked out for \"Teddy Boy behaviour\", but his main problem was that he didn't feel comfortable as a working-class lad mixing with Bohemian middle-class people.\n\nRay, on the other hand, was in his element. While Ray grew up on a council estate and was thoroughly working-class, he had always had a tendency to want to climb the social ladder, and he was delighted to be surrounded by people who were interested in art and music, though his particular love at the time was the cinema, and he would regularly go to the college film society's showings of films by people like Bergman, Kurosawa and Truffaut, or silent films by Eisenstein or Griffith, though he would complain about having to pay a whole shilling for entry.\n\nDavies also starred in some now-lost experimental films made by the person who ran the film society, and also started branching out into playing with other people. After a gig at the art college, where Alexis Korner had been supported by the young Rolling Stones, Davies went up to Korner and asked him for advice about moving on in the music world. Korner recommended he go and see Giorgio Gomelsky, the promoter and manager who had put on most of the Stones' early gigs, and Gomelsky got Davies an audition with a group called the Dave Hunt Rhythm and Blues Band. Tom McGuinness had been offered a job with them before he went on to Manfred Mann, but McGuinness thought that the Dave Hunt band were too close to trad for his tastes. Davies, on the other hand, was perfectly happy playing trad along with the blues, and for a while it looked like the Ray Davies Quartet were over, as Ray was getting more prestigious gigs with the Dave Hunt group. Ray would later recall that the Dave Hunt band's repertoire included things like the old Meade Lux Lewis boogie piece \"Honky Tonk Train Blues\", which they would play in the style of Bob Crosby's Bobcats:\n\n[Excerpt: Bob Crosby and the Bobcats, \"Honky Tonk Train Blues\"]\n\nBut while the group were extremely good musicians -- their soprano saxophone player, Lol Coxhill, would later become one of the most respected sax players in Britain and was a big part of the Canterbury Scene in the seventies -- Ray eventually decided to throw his lot in with his brother. While Ray had been off learning from these jazz musicians, Dave, Pete, and John had continued rehearsing together, and occasionally performing whenever Ray was free to join them. The group had by now renamed themselves the Ramrods, after a track by Duane Eddy, who was the first rock and roll musician Ray and Dave had see live:\n\n[Excerpt: Duane Eddy, \"Ramrod\"]\n\nDave had become a far more accomplished guitarist, now outshining his brother, and was also getting more into the London R&B scene. Ray later remembered that the thing that swung it for him was when Dave played him a record by Cyril Davies, \"Country Line Special\", which he thought of as a bridge between the kind of music he was playing with Dave Hunt and the kind of music he wanted to be playing, which he described as \"Big Bill Broonzy with drums\":\n\n[Excerpt: Cyril Davies, \"Country Line Special\"]\n\nThat was, coincidentally, the first recording to feature the piano player Nicky Hopkins, who would later play a big part in the music Ray, Dave, and Pete would make.\n\nBut not John. Shortly after Ray got serious about the Ramrods -- who soon changed their name again to the Boll Weevils -- John Start decided it was time to grow up, get serious, give up the drums, and become a quantity surveyor. There were several factors in this decision, but a big one was that he simply didn't like Ray Davies, who he viewed as an unpleasant, troubled, person.\n\nStart was soon replaced by another drummer, Mickey Willett, and it was Willett who provided the connection that would change everything for the group. Willett was an experienced musician, who had contacts in the business, and so when a rich dilettante wannabe pop star named Robert Wace and his best friend and \"manager\" Grenville Collins were looking for a backing band for Wace, one of Willett's friends in the music business pointed them in the direction of the Boll Weevils.\n\nRobert Wace offered the Boll Weevils a deal -- he could get them lucrative gigs playing at society functions for his rich friends, if they would allow him to do a couple of songs with them in the middle of the show. Wace even got Brian Epstein to come along and see a Boll Weevils rehearsal, but it wasn't exactly a success -- Mickey Willett had gone on holiday to Manchester that week, and the group were drummerless. Epstein said he was vaguely interested in signing Ray as a solo artist, but didn't want the group, and nothing further came of it.\n\nThis is particularly odd because at the time Ray wasn't singing any solo leads. Robert Wace would sing his solo spot, Dave would take the lead vocals on most of the upbeat rockers, and Ray and Dave would sing unison leads on everything else. The group were soon favourites on the circuit of society balls, where their only real competition was Mike d'Abo's band A Band of Angels -- d'Abo had been to Harrow, and so was part of the upper class society in a way that the Boll Weevils weren't.\n\nHowever, the first time they tried to play a gig in front of an audience that weren't already friends of Wace, he was booed off stage. It became clear that there was no future for Robert Wace as a pop star, but there was a future for the Boll Weevils. They came to a deal -- Wace and Collins would manage the group, Collins would put in half his wages from his job as a stockbroker, and Wace and Collins would get fifty percent of the group's earnings.\n\nWace and Collins funded the group recording a demo. They recorded two songs, the old Coasters song \"I'm A Hog For You Baby\":\n\n[Excerpt: The Boll Weevils, \"I'm A Hog For You Baby\"]\n\nand a Merseybeat pastiche written by Dave Davies, \"I Believed You\":\n\n[Excerpt: The Ravens, \"I Believed You\"]\n\nIt shows how up in the air everything was that those tracks have since been released under two names -- at some point around the time of the recording session, the Boll Weevils changed their name yet again, to The Ravens, naming themselves after the recent film, starring Vincent Price, based on the Edgar Allen Poe poem.\n\nThis lineup of the Ravens wasn't to last too long, though. Mickey Willett started to get suspicious about what was happening to all of the money, and became essentially the group's self-appointed shop steward, getting into constant rows with the management. Willett soon found himself edged out of the group by Wace and Collins, and the Ravens continued with a temporary drummer until they could find a permanent replacement.\n\nWace and Collins started to realise that neither of them knew much about the music business, though, and so they turned elsewhere for help with managing the group. The person they turned to was Larry Page. This is not the Larry Page who would later co-found Google, rather he was someone who had had a brief career as an attempt at producing a British teen idol under the name \"Larry Page, the Teenage Rage\" -- a career that was somewhat sabotaged by his inability to sing, and by his producer's insistence that it would be a good idea to record this, as the original was so bad it would never be a hit in the UK:\n\n[Excerpt: Larry Page, \"That'll be the Day\"]\n\nAfter his career in music had come to an ignominious end, Page had briefly tried working in other fields, before going into management. He'd teamed up with Eddie Kassner, an Austrian songwriter who had written for Vera Lynn before going into publishing. Kassner had had the unbelievable fortune to buy the publishing rights for \"Rock Around the Clock\" for two hundred and fifty dollars, and had become incredibly rich, with offices in both London and New York.\n\nPage and Kassner had entered into a complicated business arrangement by which Kassner got a percentage of Page's management income, Kassner would give Page's acts songs, and any song Page's acts wrote would be published by Kassner.\n\nKassner and Page had a third partner in their complicated arrangements -- independent producer Shel Talmy. Talmy had started out as an engineer in Los Angeles, and had come over to the UK for a few weeks in 1962 on holiday, and thought that while he was there he might as well see if he could get some work. Talmy was a good friend of Nik Venet, and Venet gave him a stack of acetates of recent Capitol records that he'd produced, and told him that he could pretend to have produced them if it got him work.\n\nTalmy took an acetate of \"Surfin' Safari\" by the Beach Boys, and one of \"Music in the Air\" by Lou Rawls, into Dick Rowe's office and told Rowe he had produced them. Sources differ over whether Rowe actually believed him, or if he just wanted anyone who had any experience of American recording studio techniques, but either way Rowe hired him to produce records for Decca as an independent contractor, and Talmy started producing hits like \"Charmaine\" by the Bachelors:\n\n[Excerpt: The Bachelors, \"Charmaine\"]\n\nPage, Kassner, Talmy, and Rowe all worked hand in glove with each other, with Page managing artists, Kassner publishing the songs they recorded, Talmy producing them and Rowe signing them to his record label. And so by contacting Page, Wace and Collins were getting in touch with a team that could pretty much guarantee the Ravens a record deal. They cut Page in on the management, signed Ray and Dave as songwriters for Kassner, and got Talmy to agree to produce the group.\n\nThe only fly in the ointment was that Rowe, showing the same judgement he had shown over the Beatles, turned down the opportunity to sign the Ravens to Decca. They had already been turned down by EMI, and Phillips also turned them down, which meant that by default they ended up recording for Pye records, the same label as the Searchers.\n\nAround the time they signed to Pye, they also changed their name yet again, this time to the name that they would keep for the rest of their careers. In the wake of the Profumo sex scandal, and the rumours that went around as a result of it, including that a Cabinet minister had attended orgies as a slave with a sign round his neck saying to whip him if he displeased the guests, there started to be a public acknowledgement of the concept of BDSM, and \"kinky\" had become the buzzword of the day, with the fashionable boots worn by the leather-clad Honor Blackman in the TV show The Avengers being publicised as \"kinky boots\". Blackman and her co-star Patrick MacNee even put out a novelty single, \"Kinky Boots\", in February 1964:\n\n[Excerpt: Patrick MacNee and Honor Blackman, \"Kinky Boots\"]\n\nPage decided that this was too good an opportunity to miss, and that especially given the camp demeanour of both Dave Davies and Pete Quaife it would make sense to call the group \"the Kinks\", as a name that would generate plenty of outrage but was still just about broadcastable. None of the group liked the name, but they all went along with it, and so Ray, Dave, and Pete were now The Kinks.\n\nThe ever-increasing team of people around them increased by one more when a promoter and booking agent got involved. Arthur Howes was chosen to be in charge of the newly-named Kinks' bookings primarily because he booked all the Beatles' gigs, and Wade and Collins wanted as much of the Beatles' reflected glory as they could get. Howes started booking the group in for major performances, and Ray finally quit art school -- though he still didn't think that he was going to have a huge amount of success as a pop star. He did, though, think that if he was lucky he could make enough money from six months of being a full time pop musician that he could move to Spain and take guitar lessons from Segovia.\n\nPye had signed the Kinks to a three-single deal, &nbsp;and Arthur Howes was the one who suggested what became their first single. Howes was in Paris with the Beatles in January 1964, and he noticed that one of the songs that was getting the biggest reaction was their cover version of Little Richard's \"Long Tall Sally\", and that they hadn't yet recorded the song. He phoned Page from Paris, at enormous expense, and told him to get the Kinks into the studio and record the song straight away, because it was bound to be a hit for someone. The group worked up a version with Ray on lead, and recorded it three days later:\n\n[Excerpt: The Kinks, \"Long Tall Sally\"]\n\nRay later recollected that someone at the studio had said to him \"Congratulations, you just made a flop\", and they were correct -- the Kinks' version had none of the power of Little Richard's original or of the Beatles' version, and only scraped its way to number forty-two on the charts.\n\nAs they had no permanent drummer, for that record, and for the next few they made, the Kinks were augmented by Bobby Graham, who had played for Joe Meek as one of Mike Berry and the Outlaws before becoming one of the two main on-call session drummers in the UK, along with fellow Meek alumnus Clem Cattini. Graham is now best known for having done all the drumming credited to Dave Clark on records by the Dave Clark Five such as \"Bits and Pieces\":\n\n[Excerpt: The Dave Clark Five, \"Bits and Pieces\"]\n\nIt's also been reported by various people, notably Shel Talmy, that the session guitarist Jimmy Page played Ray Davies' rhythm parts for him on most of the group's early recordings, although other sources dispute that, including Ray himself who insists that he played the parts. What's definitely not in doubt is that Dave Davies played all the lead guitar.\n\nHowever, the group needed a full-time drummer. Dave Davies wanted to get his friend Viv Prince, the drummer of the Pretty Things, into the group, but when Prince wasn't available they turned instead to Mick Avory, who they found through an ad in the Melody Maker. Avory had actually been a member of the Rolling Stones for a very brief period, but had decided he didn't want to be a full-time drummer, and had quit before they got Charlie Watts in.\n\nAvory was chosen by Ray and the management team, and Dave Davies took an instant dislike to him, partly because Ray liked Avory, but accepted that he was the best drummer available.\n\nAvory wouldn't play on the next few records -- Talmy liked to use musicians he knew, and Avory was a bit of an unknown quantity -- but he was available for the group's first big tour, playing on the bottom of the bill with the Dave Clark Five and the Hollies further up, and their first TV appearance, on Ready Steady Go.\n\nThat tour saw the group getting a little bit of notice, but mostly being dismissed as being a clone of the Rolling Stones, because like the Stones they were relying on the same set of R&B standards that all the London R&B bands played, and the Stones were the most obvious point of reference for that kind of music for most people. Arthur Howes eventually sent someone up to work on the Kinks' stage act with them, and to get them into a more showbiz shape, but the person in question didn't get very far before Graham Nash of the Hollies ordered him to leave the Kinks alone, saying they were \"OK as they are\".\n\nMeanwhile, Larry Page was working with both Ray and Dave as potential songwriters, and using their songs for other acts in the Page/Kassner/Talmy stable of artists. With Talmy producing, Shel Naylor recorded Dave's \"One Fine Day\", a song which its writer dismisses as a throwaway but is actually quite catchy:\n\n[Excerpt: Shel Naylor, \"One Fine Day\"]\n\nAnd Talmy also recorded a girl group called The Orchids, singing Ray's \"I've Got That Feeling\":\n\n[Excerpt: The Orchids, \"I've Got That Feeling\"]\n\nPage also co-wrote a couple of instrumentals with Ray, who was the brother who was more eager to learn the craft of songwriting -- at this point, Dave seemed to find it something of a chore.\n\nPage saw it as his job at this point to teach the brothers how to write -- he had a whole set of ideas about what made for a hit song, and chief among them was that it had to make a connection between the singer and the audience. He told the brothers that they needed to write songs with the words \"I\", \"Me\", and \"You\" in the title, and repeat those words as much as possible.\n\nThis was something that Ray did on the song that became the group's next single, \"You Still Want Me\", a Merseybeat pastiche that didn't even do as well as the group's first record:\n\n[Excerpt: The Kinks, \"You Still Want Me\"]\n\nThe group were now in trouble. They'd had two flop singles in a row, on a three-single contract. It seemed entirely likely that the label would drop them after the next single. Luckily for them, they had a song that they knew was a winner.\n\nRay had come up with the basic melody for \"You Really Got Me\" many years earlier. The song had gone through many changes over the years, and had apparently started off as a jazz piano piece inspired by Gerry Mulligan's performance in the classic documentary Jazz On A Summer's Day:\n\n[Excerpt: Gerry Mulligan, \"As Catch Can\"]\n\nFrom there it had apparently mutated first into a Chet Atkins style guitar instrumental and then into a piece in the style of Mose Allison, the jazz and R&B singer who was a huge influence on the more Mod end of the British R&B scene with records like \"Parchman Farm\":\n\n[Excerpt: Mose Allison, \"Parchman Farm\"]\n\nThrough all of this, the basic melody had remained &nbsp;the same, as had the two chords that underpinned the whole thing. But the song's final form was shaped to a large extent by the advice of Larry Page. As well as the \"you\" and \"me\" based lyrics, Page had also advised Ray that as he wasn't a great singer at this point, what the group needed to do was to concentrate on riffs. In particular, he'd pointed Ray to \"Louie Louie\" by the Kingsmen, which had recently been released in the UK on Pye, the same label the Kinks were signed to, and told him to do something like that:\n\n[Excerpt: The Kingsmen, \"Louie Louie\"]\n\nRay was instantly inspired by \"Louie Louie\", which the Kinks quickly added to their own set, and he retooled his old melody in its image, coming up with a riff to go under it. It seems also to have been Page who made one minor change to the lyric of the song. Where Ray had started the song with the line \"Yeah, you really got me going,\" Page suggested that instead he sing \"Girl, you really got me going\", partly to increase that sense of connection with the audience again, partly to add a tiny bit of variety to the repetitive lyrics, but also partly because the group's sexuality was already coming in for some question -- Dave Davies is bisexual, and Ray has always been keen to play around with notions of gender and sexuality. Starting with the word \"girl\" might help reassure people about that somewhat.\n\nBut the final touch that turned it into one of the great classics came from Dave, rather than Ray. Dave had been frustrated with the sound he was getting from his amplifier, and had slashed the cone with a knife. He then fed the sound from that slashed amp through his new, larger, amp, to get a distorted, fuzzy, sound which was almost unknown in Britain at the time. We've heard examples of fuzz guitar before in this series, of course -- on \"Rocket '88\", and on some of the Johnny Burnette Rock 'n' Roll Trio records, and most recently last week on Ellie Greenwich's demo of \"Do-Wah-Diddy\", but those had been odd one-offs. Dave Davies' reinvention of the sound seems to be the point where it becomes a standard part of the rock guitar toolbox -- but it's very rarely been done as well as it was on \"You Really Got Me\":\n\n[Excerpt: The Kinks, \"You Really Got Me\"]\n\nBut that introduction, and the classic record that followed, nearly never happened. The original recording of \"You Really Got Me\" has been lost, but it was apparently very different. Ray and Dave Davies have said that Shel Talmy overproduced it, turning it into a Phil Spector soundalike, and drenched the whole thing with echo. Talmy, for his part, says that that's not the case -- that the main difference was that the song was taken much slower, and that it was a very different but equally valid take on the song.\n\nRay, in particular, was devastated by the result, and didn't want it released. Pye were insistent -- they had a contract, and they were going to put this record out whatever the performers said. But luckily the group's management had faith in their singer's vision. Larry Page insisted that as he and Kassner owned the publishing, the record couldn't come out in the state it was in, and Robert Wace paid for a new recording session out of his own pocket.\n\nThe group, plus Bobby Graham, piano player Arthur Greenslade, and Talmy, went back into the studio. The first take of the new session was a dud, and Ray worried that Talmy would end the session then and there, but he allowed them to do a second take. And that second take was extraordinary. Going into the solo, Ray yelled \"Oh no!\" with excitement, looking over at Dave, and became convinced that he'd distracted Dave at the crucial moment. Instead, he delivered one of the defining solos of the rock genre:\n\n[Excerpt: The Kinks, \"You Really Got Me\"]\n\n\"You Really Got Me\" was released on the fourth of August 1964, and became a smash hit, reaching number one in September. It was also released in the US, and made the top ten over there. The Kinks were suddenly huge, and Pye Records quickly exercised their option -- so quickly, that the group needed to get an album recorded by the end of August.\n\nThe resulting album is, as one might expect, a patchy affair, made up mostly of poor R&B covers, but there were some interesting moments, and one song from the album in particular, \"Stop Your Sobbing\", showed a giant leap forward in Ray's songwriting:\n\n[Excerpt: The Kinks, \"Stop Your Sobbing\"]\n\nThere may be a reason for that. \"Stop Your Sobbing\" features backing vocals by someone new to the Kinks' circle, Ray's new girlfriend Rasa Didzpetris, who would become a regular feature on the group's records for the next decade. And when we next look at the Kinks, we'll see some of the influence she had on the group.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and nineteen of A History of Rock Music in Five Hundred Songs looks at \"You Really Got Me\" by the Kinks, and the song that first took distorted guitar to number one. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"G.T.O.\" by Ronny and the Daytonas.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI've used several resources for this and future episodes on the Kinks, most notably&nbsp;Ray Davies: A Complicated Life by Johnny Rogan and&nbsp;You Really Got Me&nbsp;by Nick Hasted.\n\nX-Ray by Ray Davies is a remarkable autobiography with a framing story set in a dystopian science-fiction future, while&nbsp;Kink by Dave Davies is more revealing but less well-written.\n\nThe Anthology 1964-1971 is a great box set that covers the Kinks' Pye years, which overlap almost exactly with their period of greatest creativity. For those who don't want a full box set, this two-CD set covers all the big hits.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nTranscript\n\nToday we're going to look at a record that has often been called \"the first heavy metal record\", one that introduced records dominated by heavy, distorted, guitar riffs to the top of the UK charts. We're going to look at the first singles by a group who would become second only to the Beatles among British groups in terms of the creativity of their recordings during the sixties, but who were always sabotaged by a record label more interested in short-term chart success than in artist development. We're going to look at the Kinks, and at \"You Really Got Me\":\n\n[Excerpt: The Kinks, \"You Really Got Me\"]\n\nThe story of the Kinks starts with two brothers, Ray and Dave Davies, the seventh and eighth children of a family that had previously had six girls in a row, most of them much older -- their oldest sister was twenty when Ray was born, and Dave was three years younger than Ray.\n\nThe two brothers always had a difficult relationship, partly because of their diametrically opposed personalities. Ray was introverted, thoughtful, and notoriously selfish, while Dave was outgoing in the extreme, but also had an aggressive side to his nature. Ray, as someone who had previously been the youngest child and only boy, resented his younger brother coming along and taking the attention he saw as his by right, while Dave always looked up to his older brother but never really got to know him.\n\nRay was always a quiet child, but he became more so after the event that was to alter the lives of the whole family in multiple ways forever. Rene, the second-oldest of his sisters, had been in an unhappy marriage and living in Canada with her husband, but moved back to the UK shortly before Ray's thirteenth birthday. Ray had been unsuccessfully pestering his parents to buy him a guitar for nearly a year, since Elvis had started to become popular, and on the night before his birthday, Rene gave him one as his birthday present.\n\nShe then went out to a dance hall. She did this even though she'd had rheumatic fever as a child, which had given her a heart condition. The doctors had advised her to avoid all forms of exercise, but she loved dancing too much to give it up for anyone.\n\nShe died that night, aged only thirty-one, and the last time Ray ever saw his sister was when she was giving him his guitar.\n\nFor the next year, Ray was even more introverted than normal, to the point that he ended up actually seeing a child psychologist, which for a working-class child in the 1950s was something that was as far from the normal experience a",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and nineteen of A History of Rock Music in Five Hundred Songs looks at \"You Really Got Me\" by the Kinks, and the song that first took distorted guitar to number one. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"G.T.O.\" by Ronny and the Daytonas.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI've used several resources for this and future episodes on the Kinks, most notably&nbsp;Ray Davies: A Complicated Life by Johnny Rogan and&nbsp;You Really Got Me&nbsp;by Nick Hasted.\n\nX-Ray by Ray Davies is a remarkable autobiography with a framing story set in a dy",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}