{
  "id": "yt:video:yODghavE__k",
  "yt:videoId": "yODghavE__k",
  "yt:channelId": "UCqnbDFdCpuN8CMEg0VuEBqA",
  "title": "Watch Billy Eichner and Luke Macfarlane on an Awkward Date in ‘Bros’ | Anatomy of a Scene",
  "link": "",
  "author": {
    "name": "The New York Times",
    "uri": "https://www.youtube.com/channel/UCqnbDFdCpuN8CMEg0VuEBqA"
  },
  "published": "2022-09-30T17:00:30+00:00",
  "updated": "2022-10-21T21:51:14+00:00",
  "media:group": {
    "media:title": "Watch Billy Eichner and Luke Macfarlane on an Awkward Date in ‘Bros’ | Anatomy of a Scene",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Neither Bobby (Billy Eichner) nor Aaron (Luke Macfarlane) are the dating type, which only adds to the tension of their Central Park encounter in this scene from “Bros.”\n\nBobby has brought a large blanket to sit on, and Aaron instead chooses a spot on the grass. Aaron also seems distracted by the shirtless dudes playing football, while Bobby becomes convinced that he’s not Aaron’s type. Narrating the scene, the director Nicholas Stoller, who also co-wrote the screenplay with Eichner, said it was based on Eichner’s real experience when he brought a blanket to the park and his date refused to sit on it.\n\nBut the scene, in both a passive-aggressive, and then just plain aggressive way, shows how the two characters are beginning to fall for each other.\n\n“It was important to me to dramatize this shift from trying to be not vulnerable in any way to slowly letting their guard down,” Stoller said. “And because it’s a comedy, we needed to do it comedically, but it also needed to play romantically.”\n\nBecause Bobby feels a little threatened by Aaron’s attraction to athletic, sports-focused “dumb guys,” as he puts it, he interrogates Aaron about that attraction, which leads to some shoving that mirrors that of the guys playing football. That transitions to an intimate moment, which acts as both a tension-breaking joke and a narrative bridge to a possible new direction for these characters.\n\nRead the New York Times review: https://nyti.ms/3Cne8Ne\nSubscribe: http://bit.ly/U8Ys7n&#13;\nMore from The New York Times Video:  http://nytimes.com/video&#13;\n----------&#13;\nWhether it's reporting on conflicts abroad and political divisions at home, or covering the latest style trends and scientific developments, New York Times video journalists provide a revealing and unforgettable view of the world. It's all the news that's fit to watch.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}