{
  "id": "tag:blogger.com,1999:blog-1747027701196237068.post-1832025346045196857",
  "published": "2022-02-01T05:00:00.001-05:00",
  "updated": "2022-02-01T05:00:00.158-05:00",
  "title": "Roger Mooking on Black History Month in Canada",
  "content": "<i><b>Editor's note:</b> This Black History Month, we’re highlighting Black perspectives, and sharing stories from Black Googlers, partners, and culture shapers from across Canada.</i>&nbsp;<div><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEjUavUCi94st9a7LyovJqjDXOpkSk2UVydHJ-BSDujEKF3E3Jcrh6MaDgTF0xbhN7sqXRzU5xA7pWEB17THDGplzBZL568KrUCbwMepfyegBuRXTxaSEq5qiWkMbkSWwSeqezopucpbvhzKwvTp71c2otLJehbbRBa8hWeZxVbaIN3LUzMfRJbgPX9x=s512\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"340\" data-original-width=\"512\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEjUavUCi94st9a7LyovJqjDXOpkSk2UVydHJ-BSDujEKF3E3Jcrh6MaDgTF0xbhN7sqXRzU5xA7pWEB17THDGplzBZL568KrUCbwMepfyegBuRXTxaSEq5qiWkMbkSWwSeqezopucpbvhzKwvTp71c2otLJehbbRBa8hWeZxVbaIN3LUzMfRJbgPX9x=s16000\" /></a></div><blockquote style=\"border: none; margin: 0 0 0 40px; padding: 0px;\"><div><div style=\"text-align: center;\"><i><span style=\"color: #666666;\"><a href=\"https://rogermooking.com/\" rel=\"nofollow\" target=\"_blank\">Roger Mooking </a>is host of Man Fire Food and Wall of Chefs judge on Food Network Canada</span></i></div></div></blockquote><div><span style=\"text-align: left;\"><div style=\"text-align: left;\"><div style=\"text-align: center;\"><br /></div>Black History Month has meant many things to me over the years, and my relationship to it changes almost annually. In my formative years growing up in Edmonton, Alberta, Black History Month was a welcome anomaly from my day- to- day reality and something I embraced like a Kardashian to a selfie.  Since then, I’ve felt all the emotions for this month, ranging from pride to disdain smeared with a trailer load of aloofness.  It’s complicated.    It is necessary and important to recognize our heroes and educate every generation. The other side of this algebraic equation has me perpetually asking “who has granted us this opportunity,” given there is an undeniable power-play in this dynamic.  There is no “white history month” because well…that history will never be relegated at all and certainly not designated to 28 (9 with a leap year) days of the 365 day calendar.</div></span><div style=\"text-align: center;\"><div style=\"text-align: center;\"><span style=\"text-align: left;\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEg46yPJOscdkfFdXz0GNQNnws8CRAJaT99l_bo3bKQPmsU_WhRaRTRBtF6uapCXEg766Jd2IFfs9zxxsPOVPkuHmTzfkpl_LPo4sflLbivpYVIHD-kOoEhcQJimK7cZgu7jsBEn7gfqBPk0nVnVhbQDvkEJvMpt8iHNtdBbpQVtmrBaJ3A743AcpseL=s512\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"512\" data-original-width=\"341\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEg46yPJOscdkfFdXz0GNQNnws8CRAJaT99l_bo3bKQPmsU_WhRaRTRBtF6uapCXEg766Jd2IFfs9zxxsPOVPkuHmTzfkpl_LPo4sflLbivpYVIHD-kOoEhcQJimK7cZgu7jsBEn7gfqBPk0nVnVhbQDvkEJvMpt8iHNtdBbpQVtmrBaJ3A743AcpseL=s16000\" /></a></div></span></div></div></div><div><div style=\"text-align: center;\"><div style=\"text-align: center;\"><span style=\"text-align: left;\"><div style=\"text-align: left;\"><div style=\"text-align: left;\"><div style=\"text-align: center;\"><i><a href=\"https://rogermooking.com/\" rel=\"nofollow\" target=\"_blank\">Mooking</a><span style=\"color: #666666;\"> is best known as the host of grilling and barbecue show Man Fire Food on Food Network Canada and Cooking Channel. The popular travelling food series showcases a dynamic range of live fire cooking, including whole hog barbecue, lobster boils, Hawaiian emu’s, seafood roasts and more!&nbsp;</span></i></div></div></div></span></div></div></div><div><div><div class=\"separator\" style=\"clear: both;\"><div style=\"text-align: center;\"><div style=\"text-align: center;\"><span style=\"text-align: left;\"><div style=\"text-align: left;\"><div style=\"text-align: center;\"><br /></div>BHM always serves as a great reminder when companies and media outlets who don't reach out the other 11 months of the year call during Black History Month for a contribution from people who got that melanin poppin’.  Recently, I’ve observed many more Black faces in front of the camera, and this welcome representation is not something I grew up seeing and it is certainly valuable for the most impressionable formative age Black minds. Unfortunately, although significant, it often feels like performance art as I don’t see the same commitment to that type of representation behind the scenes, in the boardrooms and in the executive levels of these same outlets. This reminder strengthens my resolve to continue doing what I do to level the playing field, which is constantly shifting. Me and my team occupy boardrooms, television sets, creative spaces, studios, and  work in a variety of teams in front of, and behind the camera.  We are always having to manage the creative commerce minefield with a balance of firm resolve, challenging discourse, and good old fun having.</div></span></div></div></div></div><div><div class=\"separator\" style=\"clear: both;\"><div style=\"text-align: center;\"><img alt=\"\" border=\"0\" data-original-height=\"512\" data-original-width=\"341\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEh39AiACHrzKMggi6GxSJGOpFbLEeC26dLNhM5iM_7XbwYCpqHog3vQxw37-Y6Df9VIErzcjkBULnje8W45F_dGU9mIfoB4jUKSNV1svOVYa4TfXcNiLGxMWW2N3uAIvemblN_YxJEHjxkX8PIfVN-ZEyYZptcY_gql8sAzXx-2_EeExRs8I9Lugn-j=s16000\" /></div><span style=\"color: #666666;\"><div style=\"text-align: center;\"><i><span style=\"color: #666666;\">Over the years,&nbsp;</span><a href=\"https://rogermooking.com/\" rel=\"nofollow\" target=\"_blank\">Mooking</a><span style=\"color: #666666;\"> has garnered many accolades including the prestigious “Premiers Award” for excellence in the field of Creative Arts and Design, a Gourmand World Cookbook Award, a Socan Classics Award and countless “Best Of” mentions.&nbsp;</span></i></div></span><span style=\"text-align: left;\"><br />It is wholly common, so much so, that it has become our expectation, that I am asked to participate in a campaign “for my perspective,” only to have my perspective being perceived as too niche or not mass market enough.  This is when my curry chicken becomes a burger.  The confusion is mind numbing because as I walk the streets of this beautiful country, I hear a vast array of languages being spoken, I find authentic restaurants representing every corner of the globe, and see increasing numbers of  babies being born of diverse parents.  It is very clear, and the statistics support the fact, that the “mass market” and “my perspective” is not what it was when I first arrived in Canada at 5 years old.  I’ve observed this shift across the country in major, secondary, and rural communities.  Yet, I am still mostly still facing the same discussions in these business environments that I was having 2 decades ago.  Although the disconnect is incredibly frustrating, my commitment strengthens with every encounter, as they are numerous and often.  Hopefully they will not be as numerous or as often for my kids' kids generation.  Maybe by then, dynamics and representation in favour of marginalized communities will shift enough for there to be need for a “white history month” and my daughters will be asking Bill Gates great grandkids how they feel about it.</span></div></div></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Aaron Brindle",
    "uri": "http://www.blogger.com/profile/13885417405401273013",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}