{
  "title": "Episode 112: &#8220;She Loves You&#8221; by The Beatles",
  "link": "https://500songs.com/podcast/episode-112-she-loves-you-by-the-beatles/",
  "pubDate": "Sat, 30 Jan 2021 16:05:21 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-112-she-loves-you-by-the-beatles/",
  "description": "This week's episode looks at \"She Loves You\", the Beatles in 1963, and the start of Beatlemania in the UK. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/46866081\">on \"Glad All Over\" by the Dave Clark Five.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I have created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-112-she-loves-you-by-the-beatles/\">a Mixcloud playlist</a> containing every song heard in this episode (except for the excerpt of a Beatles audience screaming, and the recording of me singing, because nobody needs those.)\n\nWhile there are many books on the Beatles, and I have read dozens of them,&nbsp; <em>All These Years Vol 1: Tune In</em> by Mark Lewisohn is simply the *only* book worth reading on the Beatles' career up to the end of 1962. It is the most detailed, most accurate, biography imaginable, and the gold standard by which all other biographies of musicians should be measured. I only wish volumes two and three were available already so I could not expect my future episodes on the Beatles to be obsolete when they do come out. There are two versions of the book --&nbsp;<a href=\"https://amzn.to/340FVAD\">a nine-hundred page mass-market version</a>&nbsp;and&nbsp;<a href=\"https://amzn.to/3j508vz\">a 1700-page expanded edition</a>. I recommend the latter.\n\nI have read literally dozens of books on the Beatles, and used bits of information from many of them, but the ones I specifically referred to while writing this episode, other than Tune In, were:\n\n<a href=\"https://amzn.to/3tc1YzZ\"><em>The Complete Beatles Chronicle</em> by Mark Lewisohn</a>,&nbsp;<a href=\"https://amzn.to/3r70SUA\"><em>All The Songs: The Stories Behind Every Beatles Release</em> by Jean-Michel Guesdon</a>,&nbsp;<a href=\"https://amzn.to/3oyiWVN\"><em>And The Band Begins To Play: The Definitive Guide To The Songs of The Beatles&nbsp;</em>by Steve Lambley</a>,&nbsp;<a href=\"https://amzn.to/3r5ACd3\"><em>The Beatles By Ear</em> by Kevin Moore</a>,&nbsp;<a href=\"https://amzn.to/3j20800\"><em>Revolution in the Head</em> by Ian MacDonald</a>, and&nbsp;<a href=\"https://amzn.to/3tbphu4\"><em>The Beatles Anthology</em>.</a>\n\n\"She Loves You\" can be found on <em><a href=\"https://amzn.to/2S1gc5q\">Past Masters</a>,</em> a 2-CD compilation of the Beatles' non-album tracks that includes the majority of their singles and B-sides.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday, we're going to look at a record that is one of the most crucial turning points in the history of rock music, and of popular culture as a whole, a record that took the Beatles from being a very popular pop group to being the biggest band in Britain -- and soon to be the world. We're going to look at \"She Loves You\" by the Beatles:\n\n[Excerpt: The Beatles, \"She Loves You\"]\n\nWhen we left the Beatles, they had just released their first single, and seen it make the top twenty -- though we have, of course, seen them pop up in other people's stories in the course of our narrative, and we've seen how Lennon and McCartney wrote a hit for the Rolling Stones.\n\nBut while we've been looking the other way, the Beatles had become the biggest band in Britain.\n\nEven before \"Love Me Do\" had been released, George Martin had realised that the Beatles had more potential than he had initially thought. He knew \"Love Me Do\" would be only a minor hit, but he didn't mind that -- over the sessions at which he'd worked with the group, he'd come to realise that they had real talent, and more than that, they had real charisma.\n\nThe Beatles' second single was to be their real breakthrough. \"Please Please Me\" was a song that had largely been written by John, and which had two very different musical inspirations. The first was a song originally made famous by Bing Crosby in 1932, \"Please\":\n\n[Excerpt: Bing Crosby, \"Please\"]\n\nLennon had always been fascinated by the pun in the opening line -- the play on the word \"please\" -- and wanted to do something similar himself.\n\nThe other influence is less obvious in the finished record, but makes sense once you realise it. A lot of Roy Orbison's records have a slow build up with a leap into falsetto, like \"Crying\":\n\n[Excerpt: Roy Orbison, \"Crying\"]\n\nNow, I'm going to have to do something I'm a little uncomfortable with here, and which I've honestly been dreading since the start of this project two years ago -- to demonstrate the similarity between \"Please Please Me\" and an Orbison song, I'm going to have to actually sing. I have a terrible voice and appalling pitch, and I could easily win an award for \"person who has the least vocal resemblance to Roy Orbison of anyone in existence\", so this will not be a pleasant sound, but it will hopefully give you some idea of how Lennon was thinking when he was writing \"Please Please Me\":\n\n[Excerpt: Me singing \"Please Please Me\"]\n\nI'm sorry you had to hear that, and I hope we can all move past it together. I promise that won't be a regular feature of the podcast. But I hope it gets the basic idea across, of how the song that's so familiar now could have easily been inspired by Orbison.\n\nLennon had played that to George Martin very early on, but Martin had been unimpressed, thinking it a dirge. At Martin's suggestion, they took the song at a much faster tempo, and they rearranged the song so that instead of Lennon singing it solo, he and McCartney sang it as a duo with Everly Brothers style harmonies. They also changed the ascending \"come on\" section to be a call and response, like many of the Black vocal groups the Beatles were so influenced by, and by taking elements from a variety of sources they changed what had been a derivative piece into something totally original. For good measure, they overdubbed some harmonica from Lennon, to provide some sonic continuity with their earlier single. The result was a very obvious hit:\n\n[Excerpt: The Beatles, \"Please Please Me\"]\n\nAfter they'd finished recording that, George Martin said to them, \"Gentlemen, you've just made your first number one\" -- there are a number of slight variations of the wording depending on when Martin was telling the story, but it was something very close to that.\n\nNow that the Beatles had recorded something that really displayed their talents, they were clearly on their way to becoming very big, and it was at this point that George Martin brought in the final part of the team that would lead to that success; someone who would work closely with himself, the Beatles, and Brian Epstein.\n\nDick James was someone who had himself had been a successful performer -- he's most famous now for having recorded the theme tune for the 1950s Robin Hood TV series:\n\n[Excerpt: Dick James, \"Robin Hood\"]\n\nThat record had been produced by George Martin, as had several of James' other records, but James had recently retired from singing -- in part because he had gone prematurely bald, and didn't look right -- and had set up his own publishing company. George Martin had no great love for the people at Ardmore and Beechwood -- despite them having been the ones who had brought the Beatles to him -- and so he suggested to Brian Epstein that rather than continue with Ardmore and Beechwood, the group's next single should be published by Dick James.\n\nIn particular, he owed James a favour, because James had passed him \"How Do You Do It?\", and Martin hadn't yet been able to get that recorded, and he thought that giving him the publishing for another guaranteed hit would possibly make up for that, though he still intended to get \"How Do You Do It?\" recorded by someone.\n\nEpstein had been unsure about this at first -- Epstein was a man who put a lot of stock in loyalty, but he ended up believing that Ardmore and Beechwood had done nothing to promote \"Love Me Do\" -- he possibly never realised that in fact it was them who were responsible for the record having come out at all, and that they'd had a great deal to do with its chart success. He ended up having a meeting with James, who was enthused by \"Please Please Me\", and wanted the song. Epstein told him he could have it, if he could prove he would be more effective at promoting the song than Ardmore and Beechwood had been with \"Love Me Do\". James picked up the telephone and called the producer of Thank Your Lucky Stars, one of the most popular music programmes on TV, and got the group booked for the show. He had the publishing rights.\n\n\"Please Please Me\" and its B-side \"Ask Me Why\" were published by Dick James Music, but after that point, any songs written by the Beatles for the next few years were published by a new company, Northern Songs. The business arrangements behind this have come in for some unfair criticism over the years, because Lennon and McCartney have later said that they were under the impression that they owned the company outright, but in fact they owned forty percent of the company, with Epstein owning ten percent, and the remaining fifty percent owned by Dick James and his business partner Charles Silver.\n\nObviously it's impossible to know what Lennon and McCartney were told about Northern Songs, and whether they were misled, but at the time this was very far from a bad deal. Most songwriters, even those with far more hits under their belt at the time, wrote for publishing companies owned by other people -- it was almost unheard of for them to even have a share in their own company. And at this time, it was still normal for publishing companies to actually have to work for their money, to push songs and get cover versions of them from established artists. Obviously the Beatles would change all that, and after them the job of a publisher became almost nonexistent, but nobody could have predicted how much the entire world of music was about to change, and so the deal that Lennon and McCartney got was an astonishingly good one for the time.\n\nThis is something that's also true of a lot of the business decisions that Epstein made for the group early on. The Beatles earned incalculably less than they would have if they'd got the kind of contracts that people who started even a year or so after them got -- but their contracts were still vastly superior to anything that other performers in British music at the time were getting. Remember that Larry Parnes' teen idols were on a fixed salary, as were, for example, all the members of the Dave Clark Five except Clark himself, and you can see that the assumptions that apply when you look at later acts don't apply here.\n\nEither way, Dick James now had the publishing of what became the Beatles' first number one:\n\n[Excerpt: The Beatles, \"Please Please Me\"]\n\nAt least, it became the Beatles' first number one as far as anyone paying attention in 1963 was concerned. But it's not their first number one according to any modern reference.\n\nThese days, the British charts are compiled by a company called the Official Charts Company. That company started, under another name, in 1969, and is run by a consortium of record companies and retailers. If you see anywhere referring to \"the UK charts\" after 1969, that's always what they're referring to.\n\nIn 1963, though, there were multiple singles charts in Britain, published by different magazines, and no single standard music-industry one. \"Please Please Me\" went to number one in the charts published by the NME and Melody Maker, two general-interest magazines whose charts were regarded by most people at the time as \"the real charts\", and which had huge audiences. However, it only made number two in the chart published by Record Retailer, a smaller magazine aimed at music industry professionals and the trade, rather than at the wider public.\n\nHowever, because the Official Charts Company is an industry body, the people who ran it were the people Record Retailer was aimed at, and so when they provide lists of historical charts, they use the Record Retailer one for the period from 1960 through 69 (they use the NME chart for 1952 through 59). So retroactively, \"Please Please Me\" does not appear as a number one in the history books, but as far as anyone at the time was concerned, it was.\n\nThe record that kept \"Please Please Me\" off the top on the Record Retailer charts was \"The Wayward Wind\" by Frank Ifield:\n\n[Excerpt: Frank Ifield, \"The Wayward \"Wind\"]\n\nOddly, Ifield would himself record a version of \"Please\", the song that had inspired \"Please Please Me\", the next year:\n\n[Excerpt: Frank Ifield, \"Please\"]\n\nAs a result of the success of \"Please Please Me\", the group were quickly brought into the studio to record an album. George Martin had originally intended to make that a live album, recorded at the Cavern, but having visited it he decided that possibly the huge amounts of condensation dripping from the ceiling might not be a good idea to mix with EMI's expensive electronic equipment. So instead, as we talked about briefly a couple of months back, the group came into Abbey Road on a rare day off from a package tour they were on, and recorded ten more songs that would, with the A- and B-sides of their first two singles, round out an album. Those tracks were a mixture of six songs that they performed regularly as part of their normal set -- covers of songs by the Cookies, the Shirelles, and Arthur Alexander, plus \"Twist and Shout\" and the soft pop ballad \"A Taste of Honey\", all of which they'd performed often enough that they could turn out creditable performances even though they all had colds, and Lennon especially was definitely the worse for wear (you can hear this in some of his vocals -- his nose is particularly congested on \"There's a Place\"), plus four more &nbsp;recent Lennon and McCartney originals.\n\nBy the time that first album came out, Lennon and McCartney had also started expanding their songwriting ambitions, offering songs to other performers. This had always been something that McCartney, in particular, had considered as part of their long-term career path -- he knew that the average pop act only had a very small time in the spotlight, and he would talk in interviews about Lennon and McCartney becoming a songwriting team after that point. That said, the first two Lennon/McCartney songs to be released as singles by other acts -- if you don't count a version of \"Love Me Do\" put out by a group of anonymous session players on a budget EP of covers of hits of the day, anyway -- were both primarily Lennon songs, and were both included on the Please Please Me album.\n\n\"Misery\" was written by Lennon and McCartney on a tour they were on in the early part of the year. That tour was headlined by Helen Shapiro, a sixteen-year-old whose biggest hits had been two years earlier, when she was fourteen:\n\n[Excerpt: Helen Shapiro, \"Walking Back to Happiness\"]\n\nShapiro had also, in 1962, appeared in the film It's Trad, Dad!, which we've mentioned before, and which was &nbsp;the first feature film directed by Richard Lester, who would later play a big part in the Beatles' career.\n\nLennon and McCartney wrote \"Misery\" for Shapiro, but it was turned down by her producer, Norrie Paramor, without Shapiro ever hearing it -- it's interesting to wonder if that might have been, in part, because of the strained relationship between Paramor and George Martin. In the event, the song was picked up by one of the other artists on the tour, Kenny Lynch, who recorded a version of it as a single, though it didn't have any chart success:\n\n[Excerpt: Kenny Lynch, \"Misery\"]\n\nLennon apparently disliked that record, and would mock Lynch for having employed Bert Weedon as the session guitarist for the track, as he regarded Weedon as a laughable figure.\n\nThe other non-Beatles single of Lennon/McCartney songs that came out in early 1963 was rather more successful. Billy J Kramer and the Dakotas were another act that Brian Epstein managed and who George Martin produced. Their first single, \"Do You Want To Know A Secret?\" was a cover of a song mostly written by Lennon, which had been an album track on Please Please Me. Kramer's version went to number two on the charts (or number one on some charts):\n\n[Excerpt: Billy J. Kramer and the Dakotas, \"Do You Want To Know A Secret?\"]\n\nThey also gave a song to Kramer for the B-side -- \"I'll Be On My Way\", which the group never recorded in the studio themselves, though they did do a version of it on a radio show, which was later released on the Live at the BBC set. In 1963 and 64 Lennon and McCartney would write a further three singles for Kramer, \"I'll Keep You Satisfied\", \"Bad to Me\", and \"From a Window\", all of which also became top ten hits for him. and none of which were ever recorded by the Beatles. They also gave him \"I Call Your Name\" as a B-side, but they later recorded that song themselves.\n\nAs well as the Rolling Stones, who we've obviously looked at a few weeks back, Lennon and McCartney also wrote hits in 1963 and early 64 for The Fourmost:\n\n[Excerpt: The Fourmost, \"I'm In Love\"]\n\nCilla Black:\n\n[Excerpt: Cilla Black, \"It's For You\"]\n\nAnd Peter & Gordon:\n\n[Excerpt: Peter & Gordon, \"World Without Love\"]\n\nAs well as a flop for Tommy Quickly:\n\n[Excerpt: Tommy Quickly, \"Tip of My Tongue\"]\n\nKramer, the Fourmost, and Black were all managed by Epstein and produced by Martin, while Quickly was also managed by Epstein, and they were part of a massive shift in British music that started with \"Please Please Me\", and then shifted into gear with Gerry and the Pacemakers, another act managed by Epstein, who Martin also produced. Their first single was a version of \"How Do You Do It?\", the song that Dick James had published and that Martin had tried to get the Beatles to record:\n\n[Excerpt: Gerry and the Pacemakes, \"How Do You Do It?\"]\n\n\"How Do You Do It?\" went to number one, and when it dropped off the top of the charts, it was replaced by the Beatles' next single. \"From Me to You\" was a song they wrote on the tour bus of that Helen Shapiro tour, and lyrically it was inspired by the NME's letter column, which had the header \"From You To Us\":\n\n[Excerpt: The Beatles, \"From Me To You\"]\n\n\"From Me To You\" often gets dismissed when talking about the Beatles' early hits, but it has a few points worth noticing. Firstly, it's the first Beatles single to be written as a true collaboration. Both sides of the \"Love Me Do\" single had been written by McCartney, with Lennon helping him fix up a song he'd started and largely finished on his own. And in turn, both \"Please Please Me\" and its B-side were Lennon ideas, which McCartney helped him finish. \"From Me to You\" and its B-side \"Thank You Girl\" were written together, \"one on one, eyeball to eyeball\", to use Lennon's famous phrase, and that would be the case for the next two singles.\n\nIt's also an interesting stepping stone. The song retains the harmonica from the first two singles, which would be dropped by the next single, and it also has the octave leap into falsetto that \"Please Please Me\" has, on the line \"If there's anything I can do\", but it also has the \"ooh\" at the end of the middle eight leading back into the verse, a trick they'd picked up from \"Twist and Shout\", and an opportunity for Lennon and McCartney to shake their heads while making a high-pitched noise, a bit of stagecraft that set the audiences screaming and which turned up again in the next single.\n\nThe other notable aspect is that the song is more harmonically sophisticated than their previous work. McCartney always singles out the change to the minor of the dominant at the start of the middle eight (on the word &nbsp;\"arms\") as being interesting:\n\n[Excerpt: The Beatles, \"From Me To You\"]\n\nAnd that is an interesting change, and it sets up an unexpected key change to F, but I'd also note the change from G to G augmented at the end of the middle eight, on the \"fied\" of \"satisfied\". That's a very, very, Lennon chord change -- Lennon liked augmented chords in general, and he'd already used one in \"Ask Me Why\", but the G augmented chord in particular is one he would use over and over again.\n\nFor those who don't understand that -- chords are normally made up of three notes, the first, third, and fifth of the scale for a major chord, and the flrst, flattened third, and fifth of a scale for a minor chord. But you can get other chords that have unexpected notes in them, and those can be particularly useful if you want to change key or move between two chords that don't normally go together. All the Beatles had particular favourite odd chords they would use in this way -- Paul would often use a minor fourth instead of a major one, and John would use it occasionally too, so much so that some people refer to a minor fourth as \"the Beatle chord\". George, meanwhile, would often use a diminished seventh in his songwriting, especially a D diminished seventh. And John's chord was G augmented.\n\nAn augmented chord is one where the fifth note is raised a semitone, so instead of the first, third and fifth:\n\n[demonstrates]\n\nit's the first, third, and sharpened fifth:\n\n[demonstrates]\n\nIn this case, John moves from G to G augmented right as they're going into the climax of the middle eight, so the top note of the chord goes higher than you'd normally expect, giving an impression of being so excited you just can't stop going up.\n\n\"From Me To You\" knocked \"How Do You Do It\" off the top of the charts, and at this point, the British music scene had been changed irrevocably. While we've seen that, according to the Official Charts Company, the number one records in the UK for eleven of the first fourteen weeks of 1963 were by either Cliff Richard, the Shadows, or ex-members of the Shadows, with only Frank Ifield breaking their dominance, between the eleventh of April 1963 and the sixteenth of January 1964, thirty-two out of forty weeks at the top were taken up by the Beatles, Gerry and the Pacemakers, and Billy J Kramer and the Dakotas -- all acts from Liverpool, managed by Brian Epstein and produced by George Martin. And two of the other acts to hit number one in that period were Brian Poole and the Tremeloes, who were a London band, but doing a Motown cover, \"Do You Love Me?\", in a style clearly inspired by the Beatles' version of \"Twist and Shout\", and The Searchers, another band from Liverpool who rose to prominence as a result of the sudden dominance of Liverpudlian acts, and who we'll be looking at next week.\n\nThe only pre-April acts to go to number one for the rest of 1963 were Frank Ifield and Elvis. In 1964 there was only Roy Orbison. There would be occasional number one hits by older acts after that -- Cliff Richard would have several more over his career -- but looking at the charts from this time it's almost as if there's a switch thrown, as if when people heard \"Please Please Me\", they decided \"that's what we want now, that's what music should be\", and as soon as there was more supply of stuff like that, as soon as the next Merseybeat single came out, they decided they were going to get that in preference to all other kinds of music.\n\nAnd of course, they were choosing the Beatles over every other Merseybeat act. The Beatles were, of course, a great band, and they are still nearly sixty years later the most commercially successful band ever, but so much has focused on what happened once they hit America, and so much time has passed, that it becomes almost impossible to see clearly just how huge they became how quickly in Britain. But they dominated 1963 culturally in the UK in a way that nothing else has before or since.\n\nAnd the song that cemented that dominance was their next single, \"She Loves You\":\n\n[Excerpt: The Beatles, \"She Loves You\"]\n\n\"She Loves You\" was another step forward in the group's songwriting, and in the technical aspects of their recording. The group were, at this point, still only recording on two-track machines, but Norman Smith, the engineer, and his assistant Geoff Emerick, came up with a few techniques to make the sound more interesting. In particular, Emerick decided to use separate compressors on the drums and bass, rather than putting them both through the same compressor, and to use an overhead mic on Ringo's drums, which he'd never previously used.\n\nBut it was the songwriting itself that was, once again, of most interest. The idea for \"She Loves You\" came from McCartney, who was particularly inspired by a hit by one of the interchangeable Bobbies, Bobby Rydell, who was in the charts at the time with \"Forget Him\":\n\n[Excerpt: Bobby Rydell, \"Forget Him\"]\n\nMcCartney took the idea of having a song be one side of a conversation with someone about their relationship, and decided that it would be an interesting idea to have the song be telling someone else \"she loves you\", rather than be about the singer's own relationships, as their previous singles had been. Everything up to that point had been centred around the first person addressing the second -- \"Love ME Do\", \"PS I Love You\", \"Please Please ME\", \"Ask ME Why\", \"From ME to You\", \"Thank You Girl\". This would be about addressing the second person about a third.\n\nWhile the song was McCartney's idea, he and Lennon wrote it together, but it was Harrison who added a crucial suggestion -- he came up with the idea that the final \"Yeah\" at the end of the chorus should be a major sixth instead of a normal chord, and that they should end with that as well:\n\n[Excerpt: The Beatles, \"She Loves You\"]\n\nGeorge Martin was not keen on that -- while the Beatles saw it as something exciting and new, something they'd not done before, to Martin it was reminiscent of the 1940s -- both the Andrews Sisters and Glenn Miller would use similar tricks, and it was quite dated even then, being a standard technique of barbershop harmony. But to the Beatles, on the other hand, it didn't matter if other people had done it before, *they'd* not done it before, and while they agreed to try it both ways, Martin eventually agreed that it did sound better the way they were doing it.\n\n\"She Loves You\" took, by the standards of the Beatles in 1963, an inordinately long time to record -- though by today's standards it was ridiculously quick. While they had recorded ten tracks in ten hours for the Please Please Me album, they took six hours in total to record just \"She Loves You\" and its B-side \"I'll Get You\". This is partly explained by the fact that Please Please Me consisted of songs they'd been playing every night for years, while John and Paul finished writing \"She Loves You\" only four days before they went into the studio to record it. The arrangement had to be shaped in the studio -- apparently it was George Martin's idea to start with the chorus -- and there are clear edits in the final version, most audibly just before and after the line \"you know it's up to you/I think it's only fair\"\n\n[Excerpt: The Beatles, \"She Loves You\"]\n\nFor those of you who want to see if you can spot the edits, they're most audible on the original CD issue of Past Masters vol. 1 from the eighties -- the later CD versions I have (the 2009 Mono Masters CD and the 2015 reissue of the 1 compilation) have been mastered in a way that makes the edits less obvious. As far as I can tell, there are six audible edit points in the song, even though it's only two minutes twenty-one -- a clear sign that they had to do a lot of studio work to get the song into a releasable shape.\n\nThat work paid off, though. The single sold half a million advance copies before being released, quickly sold over a million, and became the biggest-selling single in British history -- there wouldn't be another single that sold more until fourteen years later, when Paul McCartney's solo single \"Mull of Kintyre\" overtook it.\n\nWhile \"Please Please Me\" and \"From Me To You\" had been big hits, it was \"She Loves You\" that caught the cultural moment in the UK. The \"Yeah Yeah Yeah\" chorus, in particular, caught on in a way few if any cultural phenomena ever had before. The phenomenon known as Beatlemania had, by this point, started in earnest. As the Beatles started their first national tour as headliners, their audiences could no longer hear them playing -- every girl in the audience was screaming at the top of her lungs for the entire performance.\n\nBeatlemania is something that's impossible to explain in conventional terms. While I'm sure everyone listening to this episode has seen at least some of the footage, but for those who haven't, the only way to explain it is to hear the level of the screaming compared to the music. This is from some newsreel footage of the Beatles playing what was then the ABC in Ardwick. It's fascinating because most of the footage of Beatlemania shows gigs in the US at places like Shea Stadium or the Hollywood Bowl -- places where you get enough people that you can understand how they made that much noise. But this is a medium-sized theatre, and having been there many times myself (it's now the Manchester Apollo) I actually can't imagine how a crowd in that venue could make this much noise:\n\n[Excerpt: The Beatles, \"Twist and Shout\", Ardwick ABC]\n\nI won't be including that on the Mixcloud, by the way, as the noise makes it unlistenable, but the footage can easily be found on YouTube and is worth watching.\n\nAfter \"She Loves You\" came their second album, With The Beatles, another album very much along the same lines as the first -- a mixture of Lennon/McCartney songs and covers of records by Black American artists, this time dominated by Motown artists, with versions of \"Money\", \"Please Mr Postman\", and the Miracles' \"You Really Got A Hold On Me\", all with Lennon lead vocals. That went to number one on the album charts, knocking Please Please Me down to number two.\n\n\"She Loves You\", meanwhile, remained at number one for a month, then dropped down into the top three, giving Brian Poole and the Tremeloes and Gerry and the Pacemakers a chance at the top spot, before it returned to number one for a couple of weeks -- the last time a record would go back to number one after dropping off the top until \"Bohemian Rhapsody\" went back to number one after Freddie Mercury died, nearly thirty years later.\n\nBut while all this had been going on in Britain, the Beatles had had no success at all in the USA. Capitol, the label that had the right of first refusal for EMI records in the US, had a consistent pattern of turning down almost every British record, on the grounds that there was no market in the US for foreign records. This also meant that any record that EMI tried to license to any other label, that label knew had been turned down by Capitol. So the Beatles' first singles and album were licensed by a small label, VeeJay, who mostly put out soul records but also licensed Frank Ifield's material and had a hit act in The Four Seasons. VeeJay was close to bankruptcy, though, and didn't do any promotion of the Beatles' music. \"She Loves You\" was put out by an even smaller label, Swan, whose biggest hit act was Freddie \"Boom Boom\" Cannon.\n\nBut Brian Epstein and George Martin were convinced that the Beatles could break America, and the group's next single was written specifically with the American audience in mind, and recorded using the unbelievably advanced technology of four-track tape machines -- the first time they'd used anything other than two-track:\n\n[Excerpt: The Beatles, \"I Want To Hold Your Hand\"]\n\n\"I Want To Hold Your Hand\" went to number one in the UK, of course, replacing \"She Loves You\" -- the only time that an artist would knock themselves off the number one spot until 1981, when John Lennon did it as a solo artist in far more tragic circumstances. At this point, the Beatles had the number one and two spots on the singles chart, the number one and two positions on the album charts, and were at numbers one, two and three on the EP chart.\n\nIt would also be the start of Beatlemania in the USA. After the Beatles' famous appearance on the Royal Variety Performance, at the time the most prestigious booking an entertainer could get in the UK, Brian Epstein flew to New York, with a few aims in mind. He brought Billy J. Kramer with him, as he thought that Kramer had some potential as a lounge singer and could maybe get some club work in the US, but mostly he was there to try to persuade Capitol to release \"I Want to Hold Your Hand\", using the news coverage of Beatlemania as a reason they should pick up on it. By this time, Capitol were running out of excuses. Given the group's popularity was at a different level from any other British artist ever, they had no reason not to release \"I Want to Hold Your Hand\". They agreed they would put it out on January the thirteenth 1964.\n\n[Excerpt: The Beatles, “I Want to Hold Your Hand”]\n\nEpstein also had two more meetings while he was in New York. One was with the makers of the Ed Sullivan Show -- Sullivan had been in London and been at the airport when the Beatles had arrived back from a trip abroad, and had seen the response of the crowds there. He was mildly interested in having the group on his show, and he agreed to book them. The other meeting was with Sid Bernstein, a promoter who had been in the UK and was willing to take a gamble on putting the group on at Carnegie Hall. Both of these were major, major bookings for a group who had so far had no commercial success whatsoever in the US, but by this point the Beatles were *so* big in the UK that people were willing to take a chance on them.\n\nBut it turned out that they weren't taking a chance at all. In November, a CBS journalist had done a quick \"look at those wacky Brits\" piece to use as a filler in the evening news, including some footage of the Beatles performing \"She Loves You\". That had originally been intended to be shown on November the 22nd, but with President Kennedy's murder, the news had more important things to cover. It was eventually shown, introduced by Walter Cronkite, on December the tenth. Cronkite's broadcast got the attention of his friend Ed Sullivan, who had already more or less forgotten that he'd booked this British group whose name he couldn't even remember. He phoned Cronkite and asked him about these \"Bugs, or whatever they call themselves\", and started actually promoting their appearance on his show.\n\nAt the same time, a fifteen-year-old girl named Marsha Albert in Maryland was very impressed with \"She Loves You\", after seeing the news report and wrote to a DJ called Carroll James, asking \"Why can't we have this music in America?\" James got a friend who worked as a flight attendant to bring him a copy of \"I Want to Hold Your Hand\" on her next return from the UK, and started playing it on December the seventeenth. He played it a *lot*, because the audience loved it and kept calling in for more. Capitol tried to get him to stop playing the record -- they weren't planning on releasing it for another month yet! What was he doing, actually promoting this record?!\n\nUnfortunately for Capitol, by the time they got round to this, DJs at a couple of other stations had heard about the reaction the record was getting, and started playing their own copies as well. Capitol changed the release date, and put the record out early, on December the twenty-sixth. It sold a quarter of a million copies in the first three days. By the week of its originally scheduled release date, it was at number one on the Cashbox chart, and it would hit the same position on Billboard soon after. By the time the Beatles arrived in America for their Ed Sullivan show, it was half-way through a seven-week run at the top of the charts, and only got knocked off the top spot by \"She Loves You\", which was in its turn knocked off by \"Can't Buy Me Love\".\n\nThe Beatles had hit America, and the world of music would never be the same again.",
  "itunes:subtitle": "This weeks episode looks at She Loves You, the Beatles in 1963, and the start of Beatlemania in the UK. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus epi",
  "itunes:keywords": "Beatlemania,Bert Weedon,Billy J Kramer,Brian Epstein,British rock,Capitol Records,Dick James,Ed Sullivan,EMI,George Harrison,George Martin,Gerry and the Pacemakers,Helen Shapiro,It&#039;s Trad Dad,John Lennon,Kennedy assassination,Liverpool,Merseybeat,Norrie Paramor,Paul McCartney,Ringo Starr,The Beatles",
  "itunes:episodeType": "full",
  "itunes:episode": 112,
  "content:encoded": "This week's episode looks at \"She Loves You\", the Beatles in 1963, and the start of Beatlemania in the UK. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/46866081\">on \"Glad All Over\" by the Dave Clark Five.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I have created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-112-she-loves-you-by-the-beatles/\">a Mixcloud playlist</a> containing every song heard in this episode (except for the excerpt of a Beatles audience screaming, and the recording of me singing, because nobody needs those.)\n\nWhile there are many books on the Beatles, and I have read dozens of them,&nbsp; <em>All These Years Vol 1: Tune In</em> by Mark Lewisohn is simply the *only* book worth reading on the Beatles' career up to the end of 1962. It is the most detailed, most accurate, biography imaginable, and the gold standard by which all other biographies of musicians should be measured. I only wish volumes two and three were available already so I could not expect my future episodes on the Beatles to be obsolete when they do come out. There are two versions of the book --&nbsp;<a href=\"https://amzn.to/340FVAD\">a nine-hundred page mass-market version</a>&nbsp;and&nbsp;<a href=\"https://amzn.to/3j508vz\">a 1700-page expanded edition</a>. I recommend the latter.\n\nI have read literally dozens of books on the Beatles, and used bits of information from many of them, but the ones I specifically referred to while writing this episode, other than Tune In, were:\n\n<a href=\"https://amzn.to/3tc1YzZ\"><em>The Complete Beatles Chronicle</em> by Mark Lewisohn</a>,&nbsp;<a href=\"https://amzn.to/3r70SUA\"><em>All The Songs: The Stories Behind Every Beatles Release</em> by Jean-Michel Guesdon</a>,&nbsp;<a href=\"https://amzn.to/3oyiWVN\"><em>And The Band Begins To Play: The Definitive Guide To The Songs of The Beatles&nbsp;</em>by Steve Lambley</a>,&nbsp;<a href=\"https://amzn.to/3r5ACd3\"><em>The Beatles By Ear</em> by Kevin Moore</a>,&nbsp;<a href=\"https://amzn.to/3j20800\"><em>Revolution in the Head</em> by Ian MacDonald</a>, and&nbsp;<a href=\"https://amzn.to/3tbphu4\"><em>The Beatles Anthology</em>.</a>\n\n\"She Loves You\" can be found on <em><a href=\"https://amzn.to/2S1gc5q\">Past Masters</a>,</em> a 2-CD compilation of the Beatles' non-album tracks that includes the majority of their singles and B-sides.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday, we're going to look at a record that is one of the most crucial turning points in the history of rock music, and of popular culture as a whole, a record that took the Beatles from being a very popular pop group to being the biggest band in Britain -- and soon to be the world. We're going to look at \"She Loves You\" by the Beatles:\n\n[Excerpt: The Beatles, \"She Loves You\"]\n\nWhen we left the Beatles, they had just released their first single, and seen it make the top twenty -- though we have, of course, seen them pop up in other people's stories in the course of our narrative, and we've seen how Lennon and McCartney wrote a hit for the Rolling Stones.\n\nBut while we've been looking the other way, the Beatles had become the biggest band in Britain.\n\nEven before \"Love Me Do\" had been released, George Martin had realised that the Beatles had more potential than he had initially thought. He knew \"Love Me Do\" would be only a minor hit, but he didn't mind that -- over the sessions at which he'd worked with the group, he'd come to realise that they had real talent, and more than that, they had real charisma.\n\nThe Beatles' second single was to be their real breakthrough. \"Please Please Me\" was a song that had largely been written by John, and which had two very different musical inspirations. The first was a song originally made famous by Bing Crosby in 1932, \"Please\":\n\n[Excerpt: Bing Crosby, \"Please\"]\n\nLennon had always been fascinated by the pun in the opening line -- the play on the word \"please\" -- and wanted to do something similar himself.\n\nThe other influence is less obvious in the finished record, but makes sense once you realise it. A lot of Roy Orbison's records have a slow build up with a leap into falsetto, like \"Crying\":\n\n[Excerpt: Roy Orbison, \"Crying\"]\n\nNow, I'm going to have to do something I'm a little uncomfortable with here, and which I've honestly been dreading since the start of this project two years ago -- to demonstrate the similarity between \"Please Please Me\" and an Orbison song, I'm going to have to actually sing. I have a terrible voice and appalling pitch, and I could easily win an award for \"person who has the least vocal resemblance to Roy Orbison of anyone in existence\", so this will not be a pleasant sound, but it will hopefully give you some idea of how Lennon was thinking when he was writing \"Please Please Me\":\n\n[Excerpt: Me singing \"Please Please Me\"]\n\nI'm sorry you had to hear that, and I hope we can all move past it together. I promise that won't be a regular feature of the podcast. But I hope it gets the basic idea across, of how the song that's so familiar now could have easily been inspired by Orbison.\n\nLennon had played that to George Martin very early on, but Martin had been unimpressed, thinking it a dirge. At Martin's suggestion, they took the song at a much faster tempo, and they rearranged the song so that instead of Lennon singing it solo, he and McCartney sang it as a duo with Everly Brothers style harmonies. They also changed the ascending \"come on\" section to be a call and response, like many of the Black vocal groups the Beatles were so influenced by, and by taking elements from a variety of sources they changed what had been a derivative piece into something totally original. For good measure, they overdubbed some harmonica from Lennon, to provide some sonic continuity with their earlier single. The result was a very obvious hit:\n\n[Excerpt: The Beatles, \"Please Please Me\"]\n\nAfter they'd finished recording that, George Martin said to them, \"Gentlemen, you've just made your first number one\" -- there are a number of slight variations of the wording depending on when Martin was telling the story, but it was something very close to that.\n\nNow that the Beatles had recorded something that really displayed their talents, they were clearly on their way to becoming very big, and it was at this point that George Martin brought in the final part of the team that would lead to that success; someone who would work closely with himself, the Beatles, and Brian Epstein.\n\nDick James was someone who had himself had been a successful performer -- he's most famous now for having recorded the theme tune for the 1950s Robin Hood TV series:\n\n[Excerpt: Dick James, \"Robin Hood\"]\n\nThat record had been produced by George Martin, as had several of James' other records, but James had recently retired from singing -- in part because he had gone prematurely bald, and didn't look right -- and had set up his own publishing company. George Martin had no great love for the people at Ardmore and Beechwood -- despite them having been the ones who had brought the Beatles to him -- and so he suggested to Brian Epstein that rather than continue with Ardmore and Beechwood, the group's next single should be published by Dick James.\n\nIn particular, he owed James a favour, because James had passed him \"How Do You Do It?\", and Martin hadn't yet been able to get that recorded, and he thought that giving him the publishing for another guaranteed hit would possibly make up for that, though he still intended to get \"How Do You Do It?\" recorded by someone.\n\nEpstein had been unsure about this at first -- Epstein was a man who put a lot of stock in loyalty, but he ended up believing that Ardmore and Beechwood had done nothing to promote \"Love Me Do\" -- he possibly never realised that in fact it was them who were responsible for the record having come out at all, and that they'd had a great deal to do with its chart success. He ended up having a meeting with James, who was enthused by \"Please Please Me\", and wanted the song. Epstein told him he could have it, if he could prove he would be more effective at promoting the song than Ardmore and Beechwood had been with \"Love Me Do\". James picked up the telephone and called the producer of Thank Your Lucky Stars, one of the most popular music programmes on TV, and got the group booked for the show. He had the publishing rights.\n\n\"Please Please Me\" and its B-side \"Ask Me Why\" were published by Dick James Music, but after that point, any songs written by the Beatles for the next few years were published by a new company, Northern Songs. The business arrangements behind this have come in for some unfair criticism over the years, because Lennon and McCartney have later said that they were under the impression that they owned the company outright, but in fact they owned forty percent of the company, with Epstein owning ten percent, and the remaining fifty percent owned by Dick James and his business partner Charles Silver.\n\nObviously it's impossible to know what Lennon and McCartney were told about Northern Songs, and whether they were misled, but at the time this was very far from a bad deal. Most songwriters, even those with far more hits under their belt at the time, wrote for publishing companies owned by other people -- it was almost unheard of for them to even have a share in their own company. And at this time, it was still normal for publishing companies to actually have to work for their money, to push songs and get cover versions of them from established artists. Obviously the Beatles would change all that, and after them the job of a publisher became almost nonexistent, but nobody could have predicted how much the entire world of music was about to change, and so the deal that Lennon and McCartney got was an astonishingly good one for the time.\n\nThis is something that's also true of a lot of the business decisions that Epstein made for the group early on. The Beatles earned incalculably less than they would have if they'd got the kind of contracts that people who started even a year or so after them got -- but their contracts were still vastly superior to anything that other performers in British music at the time were getting. Remember that Larry Parnes' teen idols were on a fixed salary, as were, for example, all the members of the Dave Clark Five except Clark himself, and you can see that the assumptions that apply when you look at later acts don't apply here.\n\nEither way, Dick James now had the publishing of what became the Beatles' first number one:\n\n[Excerpt: The Beatles, \"Please Please Me\"]\n\nAt least, it became the Beatles' first number one as far as anyone paying attention in 1963 was concerned. But it's not their first number one according to any modern reference.\n\nThese days, the British charts are compiled by a company called the Official Charts Company. That company started, under another name, in 1969, and is run by a consortium of record companies and retailers. If you see anywhere referring to \"the UK charts\" after 1969, that's always what they're referring to.\n\nIn 1963, though, there were multiple singles charts in Britain, published by different magazines, and no single standard music-industry one. \"Please Please Me\" went to number one in the charts published by the NME and Melody Maker, two general-interest magazines whose charts were regarded by most people at the time as \"the real charts\", and which had huge audiences. However, it only made number two in the chart published by Record Retailer, a smaller magazine aimed at music industry professionals and the trade, rather than at the wider public.\n\nHowever, because the Official Charts Company is an industry body, the people who ran it were the people Record Retailer was aimed at, and so when they provide lists of historical charts, they use the Record Retailer one for the period from 1960 through 69 (they use the NME chart for 1952 through 59). So retroactively, \"Please Please Me\" does not appear as a number one in the history books, but as far as anyone at the time was concerned, it was.\n\nThe record that kept \"Please Please Me\" off the top on the Record Retailer charts was \"The Wayward Wind\" by Frank Ifield:\n\n[Excerpt: Frank Ifield, \"The Wayward \"Wind\"]\n\nOddly, Ifield would himself record a version of \"Please\", the song that had inspired \"Please Please Me\", the next year:\n\n[Excerpt: Frank Ifield, \"Please\"]\n\nAs a result of the success of \"Please Please Me\", the group were quickly brought into the studio to record an album. George Martin had originally intended to make that a live album, recorded at the Cavern, but having visited it he decided that possibly the huge amounts of condensation dripping from the ceiling might not be a good idea to mix with EMI's expensive electronic equipment. So instead, as we talked about briefly a couple of months back, the group came into Abbey Road on a rare day off from a package tour they were on, and recorded ten more songs that would, with the A- and B-sides of their first two singles, round out an album. Those tracks were a mixture of six songs that they performed regularly as part of their normal set -- covers of songs by the Cookies, the Shirelles, and Arthur Alexander, plus \"Twist and Shout\" and the soft pop ballad \"A Taste of Honey\", all of which they'd performed often enough that they could turn out creditable performances even though they all had colds, and Lennon especially was definitely the worse for wear (you can hear this in some of his vocals -- his nose is particularly congested on \"There's a Place\"), plus four more &nbsp;recent Lennon and McCartney originals.\n\nBy the time that first album came out, Lennon and McCartney had also started expanding their songwriting ambitions, offering songs to other performers. This had always been something that McCartney, in particular, had considered as part of their long-term career path -- he knew that the average pop act only had a very small time in the spotlight, and he would talk in interviews about Lennon and McCartney becoming a songwriting team after that point. That said, the first two Lennon/McCartney songs to be released as singles by other acts -- if you don't count a version of \"Love Me Do\" put out by a group of anonymous session players on a budget EP of covers of hits of the day, anyway -- were both primarily Lennon songs, and were both included on the Please Please Me album.\n\n\"Misery\" was written by Lennon and McCartney on a tour they were on in the early part of the year. That tour was headlined by Helen Shapiro, a sixteen-year-old whose biggest hits had been two years earlier, when she was fourteen:\n\n[Excerpt: Helen Shapiro, \"Walking Back to Happiness\"]\n\nShapiro had also, in 1962, appeared in the film It's Trad, Dad!, which we've mentioned before, and which was &nbsp;the first feature film directed by Richard Lester, who would later play a big part in the Beatles' career.\n\nLennon and McCartney wrote \"Misery\" for Shapiro, but it was turned down by her producer, Norrie Paramor, without Shapiro ever hearing it -- it's interesting to wonder if that might have been, in part, because of the strained relationship between Paramor and George Martin. In the event, the song was picked up by one of the other artists on the tour, Kenny Lynch, who recorded a version of it as a single, though it didn't have any chart success:\n\n[Excerpt: Kenny Lynch, \"Misery\"]\n\nLennon apparently disliked that record, and would mock Lynch for having employed Bert Weedon as the session guitarist for the track, as he regarded Weedon as a laughable figure.\n\nThe other non-Beatles single of Lennon/McCartney songs that came out in early 1963 was rather more successful. Billy J Kramer and the Dakotas were another act that Brian Epstein managed and who George Martin produced. Their first single, \"Do You Want To Know A Secret?\" was a cover of a song mostly written by Lennon, which had been an album track on Please Please Me. Kramer's version went to number two on the charts (or number one on some charts):\n\n[Excerpt: Billy J. Kramer and the Dakotas, \"Do You Want To Know A Secret?\"]\n\nThey also gave a song to Kramer for the B-side -- \"I'll Be On My Way\", which the group never recorded in the studio themselves, though they did do a version of it on a radio show, which was later released on the Live at the BBC set. In 1963 and 64 Lennon and McCartney would write a further three singles for Kramer, \"I'll Keep You Satisfied\", \"Bad to Me\", and \"From a Window\", all of which also became top ten hits for him. and none of which were ever recorded by the Beatles. They also gave him \"I Call Your Name\" as a B-side, but they later recorded that song themselves.\n\nAs well as the Rolling Stones, who we've obviously looked at a few weeks back, Lennon and McCartney also wrote hits in 1963 and early 64 for The Fourmost:\n\n[Excerpt: The Fourmost, \"I'm In Love\"]\n\nCilla Black:\n\n[Excerpt: Cilla Black, \"It's For You\"]\n\nAnd Peter & Gordon:\n\n[Excerpt: Peter & Gordon, \"World Without Love\"]\n\nAs well as a flop for Tommy Quickly:\n\n[Excerpt: Tommy Quickly, \"Tip of My Tongue\"]\n\nKramer, the Fourmost, and Black were all managed by Epstein and produced by Martin, while Quickly was also managed by Epstein, and they were part of a massive shift in British music that started with \"Please Please Me\", and then shifted into gear with Gerry and the Pacemakers, another act managed by Epstein, who Martin also produced. Their first single was a version of \"How Do You Do It?\", the song that Dick James had published and that Martin had tried to get the Beatles to record:\n\n[Excerpt: Gerry and the Pacemakes, \"How Do You Do It?\"]\n\n\"How Do You Do It?\" went to number one, and when it dropped off the top of the charts, it was replaced by the Beatles' next single. \"From Me to You\" was a song they wrote on the tour bus of that Helen Shapiro tour, and lyrically it was inspired by the NME's letter column, which had the header \"From You To Us\":\n\n[Excerpt: The Beatles, \"From Me To You\"]\n\n\"From Me To You\" often gets dismissed when talking about the Beatles' early hits, but it has a few points worth noticing. Firstly, it's the first Beatles single to be written as a true collaboration. Both sides of the \"Love Me Do\" single had been written by McCartney, with Lennon helping him fix up a song he'd started and largely finished on his own. And in turn, both \"Please Please Me\" and its B-side were Lennon ideas, which McCartney helped him finish. \"From Me to You\" and its B-side \"Thank You Girl\" were written together, \"one on one, eyeball to eyeball\", to use Lennon's famous phrase, and that would be the case for the next two singles.\n\nIt's also an interesting stepping stone. The song retains the harmonica from the first two singles, which would be dropped by the next single, and it also has the octave leap into falsetto that \"Please Please Me\" has, on the line \"If there's anything I can do\", but it also has the \"ooh\" at the end of the middle eight leading back into the verse, a trick they'd picked up from \"Twist and Shout\", and an opportunity for Lennon and McCartney to shake their heads while making a high-pitched noise, a bit of stagecraft that set the audiences screaming and which turned up again in the next single.\n\nThe other notable aspect is that the song is more harmonically sophisticated than their previous work. McCartney always singles out the change to the minor of the dominant at the start of the middle eight (on the word &nbsp;\"arms\") as being interesting:\n\n[Excerpt: The Beatles, \"From Me To You\"]\n\nAnd that is an interesting change, and it sets up an unexpected key change to F, but I'd also note the change from G to G augmented at the end of the middle eight, on the \"fied\" of \"satisfied\". That's a very, very, Lennon chord change -- Lennon liked augmented chords in general, and he'd already used one in \"Ask Me Why\", but the G augmented chord in particular is one he would use over and over again.\n\nFor those who don't understand that -- chords are normally made up of three notes, the first, third, and fifth of the scale for a major chord, and the flrst, flattened third, and fifth of a scale for a minor chord. But you can get other chords that have unexpected notes in them, and those can be particularly useful if you want to change key or move between two chords that don't normally go together. All the Beatles had particular favourite odd chords they would use in this way -- Paul would often use a minor fourth instead of a major one, and John would use it occasionally too, so much so that some people refer to a minor fourth as \"the Beatle chord\". George, meanwhile, would often use a diminished seventh in his songwriting, especially a D diminished seventh. And John's chord was G augmented.\n\nAn augmented chord is one where the fifth note is raised a semitone, so instead of the first, third and fifth:\n\n[demonstrates]\n\nit's the first, third, and sharpened fifth:\n\n[demonstrates]\n\nIn this case, John moves from G to G augmented right as they're going into the climax of the middle eight, so the top note of the chord goes higher than you'd normally expect, giving an impression of being so excited you just can't stop going up.\n\n\"From Me To You\" knocked \"How Do You Do It\" off the top of the charts, and at this point, the British music scene had been changed irrevocably. While we've seen that, according to the Official Charts Company, the number one records in the UK for eleven of the first fourteen weeks of 1963 were by either Cliff Richard, the Shadows, or ex-members of the Shadows, with only Frank Ifield breaking their dominance, between the eleventh of April 1963 and the sixteenth of January 1964, thirty-two out of forty weeks at the top were taken up by the Beatles, Gerry and the Pacemakers, and Billy J Kramer and the Dakotas -- all acts from Liverpool, managed by Brian Epstein and produced by George Martin. And two of the other acts to hit number one in that period were Brian Poole and the Tremeloes, who were a London band, but doing a Motown cover, \"Do You Love Me?\", in a style clearly inspired by the Beatles' version of \"Twist and Shout\", and The Searchers, another band from Liverpool who rose to prominence as a result of the sudden dominance of Liverpudlian acts, and who we'll be looking at next week.\n\nThe only pre-April acts to go to number one for the rest of 1963 were Frank Ifield and Elvis. In 1964 there was only Roy Orbison. There would be occasional number one hits by older acts after that -- Cliff Richard would have several more over his career -- but looking at the charts from this time it's almost as if there's a switch thrown, as if when people heard \"Please Please Me\", they decided \"that's what we want now, that's what music should be\", and as soon as there was more supply of stuff like that, as soon as the next Merseybeat single came out, they decided they were going to get that in preference to all other kinds of music.\n\nAnd of course, they were choosing the Beatles over every other Merseybeat act. The Beatles were, of course, a great band, and they are still nearly sixty years later the most commercially successful band ever, but so much has focused on what happened once they hit America, and so much time has passed, that it becomes almost impossible to see clearly just how huge they became how quickly in Britain. But they dominated 1963 culturally in the UK in a way that nothing else has before or since.\n\nAnd the song that cemented that dominance was their next single, \"She Loves You\":\n\n[Excerpt: The Beatles, \"She Loves You\"]\n\n\"She Loves You\" was another step forward in the group's songwriting, and in the technical aspects of their recording. The group were, at this point, still only recording on two-track machines, but Norman Smith, the engineer, and his assistant Geoff Emerick, came up with a few techniques to make the sound more interesting. In particular, Emerick decided to use separate compressors on the drums and bass, rather than putting them both through the same compressor, and to use an overhead mic on Ringo's drums, which he'd never previously used.\n\nBut it was the songwriting itself that was, once again, of most interest. The idea for \"She Loves You\" came from McCartney, who was particularly inspired by a hit by one of the interchangeable Bobbies, Bobby Rydell, who was in the charts at the time with \"Forget Him\":\n\n[Excerpt: Bobby Rydell, \"Forget Him\"]\n\nMcCartney took the idea of having a song be one side of a conversation with someone about their relationship, and decided that it would be an interesting idea to have the song be telling someone else \"she loves you\", rather than be about the singer's own relationships, as their previous singles had been. Everything up to that point had been centred around the first person addressing the second -- \"Love ME Do\", \"PS I Love You\", \"Please Please ME\", \"Ask ME Why\", \"From ME to You\", \"Thank You Girl\". This would be about addressing the second person about a third.\n\nWhile the song was McCartney's idea, he and Lennon wrote it together, but it was Harrison who added a crucial suggestion -- he came up with the idea that the final \"Yeah\" at the end of the chorus should be a major sixth instead of a normal chord, and that they should end with that as well:\n\n[Excerpt: The Beatles, \"She Loves You\"]\n\nGeorge Martin was not keen on that -- while the Beatles saw it as something exciting and new, something they'd not done before, to Martin it was reminiscent of the 1940s -- both the Andrews Sisters and Glenn Miller would use similar tricks, and it was quite dated even then, being a standard technique of barbershop harmony. But to the Beatles, on the other hand, it didn't matter if other people had done it before, *they'd* not done it before, and while they agreed to try it both ways, Martin eventually agreed that it did sound better the way they were doing it.\n\n\"She Loves You\" took, by the standards of the Beatles in 1963, an inordinately long time to record -- though by today's standards it was ridiculously quick. While they had recorded ten tracks in ten hours for the Please Please Me album, they took six hours in total to record just \"She Loves You\" and its B-side \"I'll Get You\". This is partly explained by the fact that Please Please Me consisted of songs they'd been playing every night for years, while John and Paul finished writing \"She Loves You\" only four days before they went into the studio to record it. The arrangement had to be shaped in the studio -- apparently it was George Martin's idea to start with the chorus -- and there are clear edits in the final version, most audibly just before and after the line \"you know it's up to you/I think it's only fair\"\n\n[Excerpt: The Beatles, \"She Loves You\"]\n\nFor those of you who want to see if you can spot the edits, they're most audible on the original CD issue of Past Masters vol. 1 from the eighties -- the later CD versions I have (the 2009 Mono Masters CD and the 2015 reissue of the 1 compilation) have been mastered in a way that makes the edits less obvious. As far as I can tell, there are six audible edit points in the song, even though it's only two minutes twenty-one -- a clear sign that they had to do a lot of studio work to get the song into a releasable shape.\n\nThat work paid off, though. The single sold half a million advance copies before being released, quickly sold over a million, and became the biggest-selling single in British history -- there wouldn't be another single that sold more until fourteen years later, when Paul McCartney's solo single \"Mull of Kintyre\" overtook it.\n\nWhile \"Please Please Me\" and \"From Me To You\" had been big hits, it was \"She Loves You\" that caught the cultural moment in the UK. The \"Yeah Yeah Yeah\" chorus, in particular, caught on in a way few if any cultural phenomena ever had before. The phenomenon known as Beatlemania had, by this point, started in earnest. As the Beatles started their first national tour as headliners, their audiences could no longer hear them playing -- every girl in the audience was screaming at the top of her lungs for the entire performance.\n\nBeatlemania is something that's impossible to explain in conventional terms. While I'm sure everyone listening to this episode has seen at least some of the footage, but for those who haven't, the only way to explain it is to hear the level of the screaming compared to the music. This is from some newsreel footage of the Beatles playing what was then the ABC in Ardwick. It's fascinating because most of the footage of Beatlemania shows gigs in the US at places like Shea Stadium or the Hollywood Bowl -- places where you get enough people that you can understand how they made that much noise. But this is a medium-sized theatre, and having been there many times myself (it's now the Manchester Apollo) I actually can't imagine how a crowd in that venue could make this much noise:\n\n[Excerpt: The Beatles, \"Twist and Shout\", Ardwick ABC]\n\nI won't be including that on the Mixcloud, by the way, as the noise makes it unlistenable, but the footage can easily be found on YouTube and is worth watching.\n\nAfter \"She Loves You\" came their second album, With The Beatles, another album very much along the same lines as the first -- a mixture of Lennon/McCartney songs and covers of records by Black American artists, this time dominated by Motown artists, with versions of \"Money\", \"Please Mr Postman\", and the Miracles' \"You Really Got A Hold On Me\", all with Lennon lead vocals. That went to number one on the album charts, knocking Please Please Me down to number two.\n\n\"She Loves You\", meanwhile, remained at number one for a month, then dropped down into the top three, giving Brian Poole and the Tremeloes and Gerry and the Pacemakers a chance at the top spot, before it returned to number one for a couple of weeks -- the last time a record would go back to number one after dropping off the top until \"Bohemian Rhapsody\" went back to number one after Freddie Mercury died, nearly thirty years later.\n\nBut while all this had been going on in Britain, the Beatles had had no success at all in the USA. Capitol, the label that had the right of first refusal for EMI records in the US, had a consistent pattern of turning down almost every British record, on the grounds that there was no market in the US for foreign records. This also meant that any record that EMI tried to license to any other label, that label knew had been turned down by Capitol. So the Beatles' first singles and album were licensed by a small label, VeeJay, who mostly put out soul records but also licensed Frank Ifield's material and had a hit act in The Four Seasons. VeeJay was close to bankruptcy, though, and didn't do any promotion of the Beatles' music. \"She Loves You\" was put out by an even smaller label, Swan, whose biggest hit act was Freddie \"Boom Boom\" Cannon.\n\nBut Brian Epstein and George Martin were convinced that the Beatles could break America, and the group's next single was written specifically with the American audience in mind, and recorded using the unbelievably advanced technology of four-track tape machines -- the first time they'd used anything other than two-track:\n\n[Excerpt: The Beatles, \"I Want To Hold Your Hand\"]\n\n\"I Want To Hold Your Hand\" went to number one in the UK, of course, replacing \"She Loves You\" -- the only time that an artist would knock themselves off the number one spot until 1981, when John Lennon did it as a solo artist in far more tragic circumstances. At this point, the Beatles had the number one and two spots on the singles chart, the number one and two positions on the album charts, and were at numbers one, two and three on the EP chart.\n\nIt would also be the start of Beatlemania in the USA. After the Beatles' famous appearance on the Royal Variety Performance, at the time the most prestigious booking an entertainer could get in the UK, Brian Epstein flew to New York, with a few aims in mind. He brought Billy J. Kramer with him, as he thought that Kramer had some potential as a lounge singer and could maybe get some club work in the US, but mostly he was there to try to persuade Capitol to release \"I Want to Hold Your Hand\", using the news coverage of Beatlemania as a reason they should pick up on it. By this time, Capitol were running out of excuses. Given the group's popularity was at a different level from any other British artist ever, they had no reason not to release \"I Want to Hold Your Hand\". They agreed they would put it out on January the thirteenth 1964.\n\n[Excerpt: The Beatles, “I Want to Hold Your Hand”]\n\nEpstein also had two more meetings while he was in New York. One was with the makers of the Ed Sullivan Show -- Sullivan had been in London and been at the airport when the Beatles had arrived back from a trip abroad, and had seen the response of the crowds there. He was mildly interested in having the group on his show, and he agreed to book them. The other meeting was with Sid Bernstein, a promoter who had been in the UK and was willing to take a gamble on putting the group on at Carnegie Hall. Both of these were major, major bookings for a group who had so far had no commercial success whatsoever in the US, but by this point the Beatles were *so* big in the UK that people were willing to take a chance on them.\n\nBut it turned out that they weren't taking a chance at all. In November, a CBS journalist had done a quick \"look at those wacky Brits\" piece to use as a filler in the evening news, including some footage of the Beatles performing \"She Loves You\". That had originally been intended to be shown on November the 22nd, but with President Kennedy's murder, the news had more important things to cover. It was eventually shown, introduced by Walter Cronkite, on December the tenth. Cronkite's broadcast got the attention of his friend Ed Sullivan, who had already more or less forgotten that he'd booked this British group whose name he couldn't even remember. He phoned Cronkite and asked him about these \"Bugs, or whatever they call themselves\", and started actually promoting their appearance on his show.\n\nAt the same time, a fifteen-year-old girl named Marsha Albert in Maryland was very impressed with \"She Loves You\", after seeing the news report and wrote to a DJ called Carroll James, asking \"Why can't we have this music in America?\" James got a friend who worked as a flight attendant to bring him a copy of \"I Want to Hold Your Hand\" on her next return from the UK, and started playing it on December the seventeenth. He played it a *lot*, because the audience loved it and kept calling in for more. Capitol tried to get him to stop playing the record -- they weren't planning on releasing it for another month yet! What was he doing, actually promoting this record?!\n\nUnfortunately for Capitol, by the time they got round to this, DJs at a couple of other stations had heard about the reaction the record was getting, and started playing their own copies as well. Capitol changed the release date, and put the record out early, on December the twenty-sixth. It sold a quarter of a million copies in the first three days. By the week of its originally scheduled release date, it was at number one on the Cashbox chart, and it would hit the same position on Billboard soon after. By the time the Beatles arrived in America for their Ed Sullivan show, it was half-way through a seven-week run at the top of the charts, and only got knocked off the top spot by \"She Loves You\", which was in its turn knocked off by \"Can't Buy Me Love\".\n\nThe Beatles had hit America, and the world of music would never be the same again.",
  "enclosure": "",
  "itunes:summary": "This week's episode looks at \"She Loves You\", the Beatles in 1963, and the start of Beatlemania in the UK. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Glad All Over\" by the Dave Clark Five.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I have created a Mixcloud playlist containing every song heard in this episode (except for the excerpt of a Beatles audience screaming, and the recording of me singing, because nobody needs those.)\n\nWhile there are many books on the Beatles, and I have read dozens of them,&nbsp; All These Years Vol 1: Tune In by Mark Lewisohn is simply the *only* book worth reading on the Beatles' career up to the end of 1962. It is the most detailed, most accurate, biography imaginable, and the gold standard by which all other biographies of musicians should be measured. I only wish volumes two and three were available already so I could not expect my future episodes on the Beatles to be obsolete when they do come out. There are two versions of the book --&nbsp;a nine-hundred page mass-market version&nbsp;and&nbsp;a 1700-page expanded edition. I recommend the latter.\n\nI have read literally dozens of books on the Beatles, and used bits of information from many of them, but the ones I specifically referred to while writing this episode, other than Tune In, were:\n\nThe Complete Beatles Chronicle by Mark Lewisohn,&nbsp;All The Songs: The Stories Behind Every Beatles Release by Jean-Michel Guesdon,&nbsp;And The Band Begins To Play: The Definitive Guide To The Songs of The Beatles&nbsp;by Steve Lambley,&nbsp;The Beatles By Ear by Kevin Moore,&nbsp;Revolution in the Head by Ian MacDonald, and&nbsp;The Beatles Anthology.\n\n\"She Loves You\" can be found on Past Masters, a 2-CD compilation of the Beatles' non-album tracks that includes the majority of their singles and B-sides.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nTranscript\n\nToday, we're going to look at a record that is one of the most crucial turning points in the history of rock music, and of popular culture as a whole, a record that took the Beatles from being a very popular pop group to being the biggest band in Britain -- and soon to be the world. We're going to look at \"She Loves You\" by the Beatles:\n\n[Excerpt: The Beatles, \"She Loves You\"]\n\nWhen we left the Beatles, they had just released their first single, and seen it make the top twenty -- though we have, of course, seen them pop up in other people's stories in the course of our narrative, and we've seen how Lennon and McCartney wrote a hit for the Rolling Stones.\n\nBut while we've been looking the other way, the Beatles had become the biggest band in Britain.\n\nEven before \"Love Me Do\" had been released, George Martin had realised that the Beatles had more potential than he had initially thought. He knew \"Love Me Do\" would be only a minor hit, but he didn't mind that -- over the sessions at which he'd worked with the group, he'd come to realise that they had real talent, and more than that, they had real charisma.\n\nThe Beatles' second single was to be their real breakthrough. \"Please Please Me\" was a song that had largely been written by John, and which had two very different musical inspirations. The first was a song originally made famous by Bing Crosby in 1932, \"Please\":\n\n[Excerpt: Bing Crosby, \"Please\"]\n\nLennon had always been fascinated by the pun in the opening line -- the play on the word \"please\" -- and wanted to do something similar himself.\n\nThe other influence is less obvious in the finished record, but makes sense once you realise it. A lot of Roy Orbison's records have a slow build up with a le",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "This week's episode looks at \"She Loves You\", the Beatles in 1963, and the start of Beatlemania in the UK. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Glad All Over\" by the Dave Clark Five.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I have created a Mixcloud playlist containing every song heard in this episode (except for the excerpt of a Beatles audience screaming, and the recording of me singing, because nobody needs those.)\n\nWhile there are many books on the Beatles, and I have read dozens of them,&nbsp; All These Years Vol 1: Tune In by Mark Lewisohn is simply the *only* book worth reading on the Beatles' career up to the end of 1962. It is the",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}