{
  "title": "9 Reasons Why the F-35 Needs a New Engine",
  "link": "https://www.heritage.org/defense/commentary/9-reasons-why-the-f-35-needs-new-engine",
  "description": "<p>Fighter engines are incredibly complex machines. We may think of them as things that merely produce thrust, but every engine is born with indelible traits and functions that culminate in the success of the fighter it powers. Thrust is at the top of the list, but an engine’s appetite for fuel, its ability to provide cooling and electrical power for system components and its durability establish the paradigms of performance for the weapons system.</p>\n\n<p>Once fielded, increasing the demand on those capabilities ultimately becomes a zero-sum game, where satisfying the demand on one area comes at the cost of the others. Collectively, the demands on the F-35 weapons system have now outpaced the capabilities of its F135 powerplant. So, right now, the <a href=\"https://breakingdefense.com/2022/09/general-electric-finishes-testing-adaptive-engine-but-will-it-power-the-f-35/\">Air Force is weighing</a> two options: make incremental upgrades to the current F135 engine, or pivot to a new program of record by selecting a winner from two competitors from the service’s Adaptive Engine Transition Program.</p>\n\n<p>There are at least nine reasons why the Air Force should forgo upgrading the current engine and move to acquire the AETP winner if it wants to get the most out of its future F-35s.</p>\n\n<p><strong>1. The F-35 needs more thrust.</strong></p>\n\n<p>The <a href=\"https://man.fas.org/dod-101/sys/ac/docs/m06231998_m104-98.html\">design</a> of the F-35’s Pratt and Whitney F135 engine was crafted around the conceptual dimensions, weight and performance requirements of the Joint Strike Fighter (JSF).  Each of the three jets are now <a data-featherlight=\"image\" href=\"https://upload.wikimedia.org/wikipedia/commons/2/22/F-35_A_B_C_Config.png\">13 percent longer, have wingspans</a> that are more than 16 percent wider and are at least 30 percent heavier than their <a href=\"https://www.fighter-planes.com/info/jsf.htm\">original JSF designs</a>. This has compromised key performance parameters such as acceleration. Rapidly gaining separation from an engagement can mean life or death for a pilot, and the JSF’s additional girth, paired with its engine means the F-35A, F-35B, and F-35C require more time—8 seconds, 16 seconds, and a crippling 43 seconds, respectively—to accelerate from 0.8 Mach to 1.2 Mach. The jet needs more thrust than the F135 can deliver.</p>\n\n<p><strong>2. The F-35 needs more range.</strong></p>\n\n<p>The design objectives for the JSF prioritized a significant increase in fighter combat radius, or the range an aircraft can travel from takeoff to target and then return home. Unfortunately, the jet’s increased size and weight, coupled with increased aircraft cooling demands reduced the <a href=\"https://www.flightglobal.com/pentagon-agrees-to-f-35a-combat-radius-reduction/104390.article\">combat radius</a> of all three variants some 15 percent below the program’s objectives. The F-35 needs a more powerful, fuel-efficient engine.</p>\n\n<p><strong>3. System cooling requirements already exceed F135 design specifications.</strong></p>\n\n<p>Like electricity, the demand for subsystem cooling is measured in kilowatts. The F135 was designed to handle a 15 kilowatts cooling demand, but that requirement has already doubled to an estimated 30 kilowatts. Cooling air is generated primarily by pulling bleed air from the engine and running it through heat exchangers. The F135 meets the 30 kilowatts demand by pulling more bleed air from the engine, which further reduces thrust. By the time Block 4 version of the F-35 is fully fielded in 2028, aircraft sub-systems <a href=\"https://aviationweek.com/defense-space/new-leadership-reimagines-us-air-force-fighter-fleet-structure\">will need a minimum of 47 kilowatts</a> of cooling, and the amount required to meet follow-on capability demands range as high as 60 kilowatts. The F-35’s power plant will need to generate twice the cooling the F135 engine delivers.</p>\n\n<p><strong>4. The F-35’s overtaxed engine is getting old much faster than expected.</strong></p>\n\n<p>The higher cooling demands-to-higher bleed air linkage is where the zero-sum game raises its ugly head with this engine. As more bleed air is pulled for cooling, the engine burns more fuel and runs hotter than it was designed to operate. A higher fuel burn ratio decreases the F-35’s range, and the higher temperatures have already resulted in <a href=\"https://www.defensedaily.com/pratt-whitney-looks-to-enhanced-f-35-engine-for-cooling-advanced-weapons-and-saving-billions-in-life-cycle-costs/air-force/\">markedly higher engine wear</a>, failure rates and repair cycles for the F135.</p>\n\n<p><strong>5. The F135 engine will not meet future electrical power requirements.</strong></p>\n\n<p>Like the demands for thrust, range and cooling, the <a href=\"https://www.globalsecurity.org/military/library/news/2003/11/mil-031105-hamilton-sundstrand01.htm\">voltage generation specification</a> that was designed into the JSF was wholly sufficient for the subsystems envisioned in 2001. However, the performance and tactical effective range of subsystems like a new APG-85 radar [<a href=\"https://www.taxpayer.net/wp-content/uploads/2022/04/FY2023-UPL_Air-Force.pdf\">PDF</a>] and enhanced electronic warfare systems that will come with the F-35 Block 4 will require more electrical power. Add upgrades that are on the horizon like directed energy weapons, and you start hitting voltage stops. The F-35 Joint Program Office has <a href=\"https://www.defensenews.com/industry/2018/06/13/pratt-whitney-is-pitching-a-new-version-of-the-f-35-engine/\">already identified</a> this challenge and signaled the need for an engine that can produce more kilowatts of power.</p>\n\n<p><strong>6. Incremental engine improvements will only address part of the problem.</strong></p>\n\n<p>Pratt has proposed an incremental, scalable engine upgrade called the Enhanced Engine Program (EEP) that can increase thrust by <a href=\"https://aviationweek.com/aerospace/program-management/f135-upgrades-reengining-considered-new-f-35-propulsion-road-map\">6 to 10 percent</a> or <a href=\"https://aviationweek.com/aerospace/program-management/f135-upgrades-reengining-considered-new-f-35-propulsion-road-map\">increase fuel efficiency</a> from 5 to 6 percent. Pratt had previously claimed it could increase thrust by 15 percent and fuel efficiency as much as 20 percent in the same upgrade. It could also deliver up to a 50 percent increase in cooling capacity. The initial cost of EEP is, indeed, projected to be much lower than buying a new engine, but the projected gains will remain estimates until the upgraded engine is paid for and fielded and, even if they pan out, will still fall short of future F-35 weapons system demands.</p>\n\n<p><strong>7. The AETP engine is proven, exceeds current demands and will enable future F-35 upgrades.</strong></p>\n\n<p>The goals for the adaptive engine test program were to prove a <a href=\"https://www.100knots.com/adaptive-engine-transition-program-aetp-a-revolutionary-propulsion-mechanism-for-the-f-35/\">three-stream architecture</a> that improves engine fuel efficiency by 25 percent, increases thrust by 10 percent and significantly improves thermal management (cooling). Pratt and General Electric (GE) were selected to build AETP prototypes. While Pratt’s XA101 is still under development, GE’s XA100 has completed testing and has proven to increase fuel efficiency by 25 percent (enabling 30 percent greater range) and increase thrust by 10 percent to 20 percent (delivering 20 percent more acceleration than the F135). The XA100 provides twice the cooling capacity, and its ceramic matrix composite turbine blades can withstand 500 degrees Fahrenheit—more heat than the F135 engine.</p>\n\n<p>Pratt’s XA101 also shows great promise, and there is every reason to believe that at the end of its testing, the Air Force will have two great options for a next-generation engine. While developing AETP’s technology was essential for the Next Generation Air Dominance (NGAD) family of systems, it will also support every Block 4 upgrade currently envisioned for the F-35 — and that weapons system desperately needs an injection of competition.</p>\n\n<p><strong>8. Competing the next engine for the F-35 will elevate performance and drive down costs.</strong></p>\n\n<p>Competition has been missing from the JSF engine program since the JSF’s second engine, the GE’s F136, was cancelled in 2011. From that point on, Pratt has held the engine monopoly on the F-35 program, leaving no compelling reason for the company to compete on price. With that, the F135 was the only major F-35 sub-system that failed to cut its acquisition costs to reach weapons system program targets, which made bringing the cost of the F-35A below its $80 million target that much more challenging. Having Pratt and GE compete side by side for future engine contracts will force both to maximize the performance and minimize the cost of their engines.</p>\n\n<p><strong>9. Proven performance, then price should be the driving factors for the future F-35 engine.</strong></p>\n\n<p>Cost estimates for a fielded AETP engine generally exceed $6 billion. If cost were the primary driver, the $2 billion price tag for EEP would win hands down—at least at first glance. But the EEP is a band aid approach to addressing the F-35’s fundamental powerplant challenges, and to be successful that “band aid” would have to grow over time. Selecting EEP would mean waving a hand to those additional costs, and the incremental nature of those upgrades would do more to constrain the capabilities of the F-35 weapons system than propel them forward. It would mean ignoring the performance issues that drove competition back into fighter engine procurement in the 1970s. By design, the AETP program would reinvigorate competition and elevate the trajectory of the F-35 for the foreseeable future.</p>\n\n<p>At a time when the U.S. is likely to be outnumbered by its adversaries, particularly in a fight in the Indo-Pacific, it’s important that our aviators have the best fighters America can provide. Air combat is unforgiving when it comes to second best. Putting one of the AETP engines in the F-35 is clearly the best choice for U.S. national security.</p>",
  "pubDate": "Wed, 02 Nov 2022 11:04:40 -0400",
  "dc:creator": "John Venable",
  "guid": "https://www.heritage.org/defense/commentary/9-reasons-why-the-f-35-needs-new-engine"
}