{
  "title": "Cable Giant Charter Once Again Jacks Up Broadband Prices",
  "link": "https://www.techdirt.com/2022/11/04/cable-giant-charter-once-again-jacks-up-broadband-prices/",
  "comments": "https://www.techdirt.com/2022/11/04/cable-giant-charter-once-again-jacks-up-broadband-prices/#comments",
  "dc:creator": "Karl Bode",
  "pubDate": "Fri, 04 Nov 2022 13:24:56 +0000",
  "category": [
    1,
    "charter",
    "charter spectrum",
    "broadband",
    "digital divide",
    "fcc",
    "high speed internet",
    "monopoly",
    "price hikes",
    "telecom"
  ],
  "guid": "https://www.techdirt.com/?p=381549&#038;preview=true&#038;preview_id=381549",
  "description": "Cable giants like Comcast and Charter continue to struggle to retain traditional TV subscribers, so they&#8217;re extracting their pound of flesh from their captive cable broadband customers that have no alternative ISPs to flee to thanks to a continued lack of competition in the United States. Both companies were quick to jack up broadband prices [&#8230;]",
  "content:encoded": "<p>Cable giants like Comcast and Charter continue to struggle to retain traditional TV subscribers, so they&#8217;re extracting their pound of flesh from their captive cable broadband customers that have no alternative ISPs to flee to thanks to a continued lack of competition in the United States. </p>\n<p>Both companies were quick to jack up broadband prices <a href=\"https://www.techdirt.com/2020/12/02/comcast-increases-prices-bogus-fees-middle-pandemic/\">during the pandemic</a>. More recently, in a giant middle finger to net neutrality, Comcast announced it would force you to use Comcast hardware <a href=\"https://www.techdirt.com/2022/10/26/comcast-forces-users-to-buy-comcast-hardware-if-they-want-faster-upload-speeds/\">if you want faster speeds</a>. Now, Charter Communications, whose broadband services are sold under the Spectrum brand, is informing 9.5 million users they&#8217;ll soon be seeing price hikes.</p>\n<p>As with most companies, Charter <a href=\"https://www.fiercetelecom.com/broadband/charter-raises-spectrum-internet-prices-5-month\">vaguely blamed inflation</a> for the $5 monthly price hike on most of its tiers:</p>\n<blockquote class=\"wp-block-quote\">\n<p><em>Executives mentioned plans to hike broadband prices on Charter’s Q3 2022 earnings call, stating the move was a response to inflationary pressure. However, they didn’t provide specifics. In a statement to Fierce, a Charter representative confirmed rack rates for its service tiers will be increasing $5 per month. The change will take effect in most markets starting November 1.</em></p>\n</blockquote>\n<p>These price hikes would have arrived regardless of inflation. And these companies can routinely jack up prices because they see no competitive or regulatory penalty for doing so. In Charter&#8217;s case it was restricted from imposing broadband usage caps and overage fees due to conditions affixed to its merger with Time Warner Cable, but those restrictions have sunsetted, meaning caps won&#8217;t be far behind. </p>\n<p>AT&T also raised prices by $3 <a href=\"https://www.fiercetelecom.com/broadband/att-internet-raises-prices-3-month\">for all of its customers</a>. Cable company Altice jacked up prices <a href=\"https://www.fiercetelecom.com/broadband/altice-usa-hikes-internet-prices-10\">by $10 for all new customers</a>. In wireless, Verizon <a href=\"https://www.fiercewireless.com/wireless/verizon-quietly-hikes-prices-similar-att\">also jacked up prices</a>, while one-time industry darling T-Mobile informed everybody they&#8217;d be implementing <a href=\"https://www.engadget.com/t-mobile-will-start-charging-a-35-fee-on-all-new-activations-and-upgrades-065518011.html\">a new $35 fee</a> for all activations and upgrades. </p>\n<p>Just another round of incredible innovation from an industry that already charges Americans some of the highest prices in the developed world for what&#8217;s very often substandard service and comically terrible customer support. It&#8217;s the kind of freedom you get to enjoy when you not only don&#8217;t have many competitors, but have figured out how to cripple the nation&#8217;s top telecom regulator for <a href=\"https://www.techdirt.com/2022/06/08/telecom-lobbyists-are-about-to-scuttle-the-nomination-of-a-popular-reformer-to-the-fcc-and-nobody-much-seems-to-care/\">six straight years</a>.</p>\n",
  "wfw:commentRss": "https://www.techdirt.com/2022/11/04/cable-giant-charter-once-again-jacks-up-broadband-prices/comments/feed/",
  "slash:comments": 7
}