{
  "title": "Creating Value with Big Data Analytics (book review)",
  "link": "http://www.dataminingblog.com/creating-value-with-big-data-analytics-book-review/",
  "pubDate": "Mon, 19 Mar 2018 21:37:23 +0000",
  "dc:creator": "Sandro Saitta",
  "category": "data mining",
  "guid": "http://www.dataminingblog.com/?p=2497",
  "description": "Verhoef, Kooge and Walk have written a detailed and technical book on the application of data analytics to Marketing. While not stated in the title, the subtitle makes it clear: the book is dedicated to people in Marketing and Sales. The strong academic background of the authors is transparent in the book, which is full [&#8230;]",
  "content:encoded": "<p><img class=\"alignleft wp-image-2498 size-medium\" src=\"http://www.dataminingblog.com/wp-content/uploads/images-200x300.jpg\" alt=\"\" width=\"200\" height=\"300\" srcset=\"http://www.dataminingblog.com/wp-content/uploads/images-200x300.jpg 200w, http://www.dataminingblog.com/wp-content/uploads/images.jpg 600w\" sizes=\"(max-width: 200px) 100vw, 200px\" />Verhoef, Kooge and Walk have written a detailed and technical book on the application of data analytics to Marketing. While not stated in the title, the subtitle makes it clear: the book is dedicated to people in Marketing and Sales.</p>\n<p>The strong academic background of the authors is transparent in the book, which is full of references. In the book, Big Data means lots of data (nothing related to Big Data architectures). While written with an academic angle, the book is full of examples. Marketing topics covered include brand metrics, value to consumer/firm and customer lifetime value (CLV).</p>\n<p>On the data science side, while not going deep in the subjects, the book discusses data quality, privacy & ethics, customer segmentation, regression models and time series. In the &#8220;Big Data&#8221; category, the books covers web analytics, A/B tests, dynamic targeting and social network analysis.</p>\n<p><em>Creating Value with Big Data Analytics</em> also discusses storytelling concepts. Finally, Big Data capabilities within companies are covered. The very last chapter provides several use cases. If you work in applying data science to Maketing/Sales, you will find <em>Creating Value with Big Data Analytics</em> useful. It provides both an overview of the field and a starting point for further readings.</p>\n<p><a class=\"a2a_dd addtoany_share_save addtoany_share\" href=\"https://www.addtoany.com/share#url=http%3A%2F%2Fwww.dataminingblog.com%2Fcreating-value-with-big-data-analytics-book-review%2F&title=Creating%20Value%20with%20Big%20Data%20Analytics%20%28book%20review%29\" data-a2a-url=\"http://www.dataminingblog.com/creating-value-with-big-data-analytics-book-review/\" data-a2a-title=\"Creating Value with Big Data Analytics (book review)\"><img src=\"https://static.addtoany.com/buttons/share_save_171_16.png\" alt=\"Share\"></a></p>"
}