{
  "title": "Expanding accessible learning with Google for Education",
  "link": "https://blog.google/outreach-initiatives/education/ndeam-2022/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"zt0wg\">The need for accessible tools and equitable learning environments has become more critical than ever, as <a href=\"https://nces.ed.gov/programs/coe/indicator/cgg/students-with-disabilities\">the number of students with disabilities</a> is on the rise, including those with specific learning disabilities.</p><p data-block-key=\"9tj7g\">Google for Education uses built-in accessibility features to help support the needs of all students, to help foster inclusive environments so that students can learn individually and as a group. Our accessibility features provide individualized support while giving students the resources they need to learn in a collaborative way.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3 data-block-key=\"zt0wg\">Captions as a tool across Google products</h3><p data-block-key=\"4qa58\">We aim to build helpful features across all our products. One of those features is captions, which are useful not only for those who are deaf or hard of hearing, but also if a room is loud, or a student just needs additional support focusing, or if someone needs support in a different language. Captions are available in <a href=\"https://support.google.com/meet/answer/9300310?hl=en&amp;co=GENIE.Platform%3DDesktop\">Google Meet</a> in six languages, and you can change the font size and placement on the screen. You can also access and add captions to videos in <a href=\"https://support.google.com/youtube/answer/2734796?hl=en\">YouTube</a>, <a href=\"https://support.google.com/drive/answer/1372218?hl=en&amp;co=GENIE.Platform%3DDesktop\">Google Drive</a> and <a href=\"https://support.google.com/chrome/answer/10538231?hl=en\">Chrome</a>. For Android users, captions are also available through <a href=\"https://support.google.com/accessibility/android/answer/9158064?hl=en\">Live Transcribe</a>.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"Gif of multiple types of captions across Google products\" class=\"article-image--large\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/009-ACC-EDU-4poducts-caps-AV.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3 data-block-key=\"zt0wg\">Building accessibility tools into Chromebooks</h3><p data-block-key=\"624ia\">Our accessibility features are easy to use and built directly into Chromebooks, like Select-to-Speak, the ChromeVox screen reader and magnification, that enable every individual to do their best work. Now we’ve added more <a href=\"https://support.google.com/chromebook/answer/12001244?hl=en&amp;ref_topic=9016892\">dictation improvements</a>, like the ability to speak into any text field on the Chromebook simply by clicking on the mic icon in the status area. You can also press Search + d to dictate, and you can now edit using just your voice.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3 data-block-key=\"zt0wg\">More customization options in Google Workspace for Education</h3><p data-block-key=\"elvti\">We recently announced <a href=\"https://workspaceupdates.googleblog.com/2022/08/docs-sheets-slides-drawings-accessibility-preferences.html\">more customization for accessibility settings</a> in Google Docs, Sheets, Slides and Drawings, so users can set accessibility settings for each product individually. And soon, we’ll build upon that by consolidating the Docs settings for screen reader and braille support into a single setting, with a single checkbox. We’ll also soon be adding improvements to voice typing in Google Docs, voice typing for speaker notes in Google Slides, and captions in Google Slides, including adding automatic punctuation and the ability to access from all browsers.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"zt0wg\">For people who are blind or low vision and use screen readers, you can now<a href=\"https://workspaceupdates.googleblog.com/2022/09/google-calendar-announce-shortcuts%20.html\">type a keyboard shortcut</a> (ALT + number, 1-7) that verbalizes the content of a Calendar event. This way, Calendar details can be heard on demand, instead of through time-consuming navigation.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3 data-block-key=\"zt0wg\">Working with partners to expand accessible tools</h3><p data-block-key=\"1aeqa\">We’re supporting teachers through our own tools and partnerships with organizations that share our mission. Many of these <a href=\"https://chromebookapphub.withgoogle.com/apps?filters=accessibility-and-assistive-tools\">apps and extensions</a> integrate with Google tools like Classroom, Google Workspace for Education, and Chromebooks.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"zt0wg\">This includes <a href=\"https://www.texthelp.com/\">Texthelp</a>, a company which makes extensions and tools that help people learn, understand and communicate through the use of digital learning and accessibility tools. Students can use tools like Read&amp;Write to help with reading support, and Equatio to help with creating math equations digitally. Created by an occupational therapist, <a href=\"http://www.snaptypeapp.com/\">SnapType</a> breaks down the barriers to education by helping students feel more confident and independent. Students challenged by handwriting or visual impairments can keep up in class with their peers by using SnapType to easily take a picture of their assignment and then type or dictate their schoolwork.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"zt0wg\">We’re also continually working to update our Help Center articles for screen reader users, including how to <a href=\"https://support.google.com/calendar/answer/6101541\">use a screen reader with Google Calendar</a>, how to <a href=\"https://support.google.com/drive/answer/12169158\">use a screen reader with Google Drive</a>, and how to <a href=\"https://support.google.com/docs/answer/6199477\">make your document or presentation more accessible</a>. Stay up to date on the latest accessibility features from <a href=\"https://edu.google.com/intl/ALL_us/why-google/accessibility/\">Google for Education</a>.</p></div></div></body></html>",
  "pubDate": "Tue, 25 Oct 2022 16:00:00 +0000",
  "guid": "https://blog.google/outreach-initiatives/education/ndeam-2022/",
  "category": [
    "Chromebooks",
    "Accessibility",
    "Education",
    "Google Workspace"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Expanding accessible learning with Google for Education",
    "description": "We’re sharing new accessibility features across ChromeOS and Google Workspace for Education.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/007-ACC-EDU___Accessibility_blog_header_-_ND.max-600x600.png",
    "site_name": "Google",
    "url": "https://blog.google/outreach-initiatives/education/ndeam-2022/"
  },
  "author": {
    "name": "Morgan Weisman",
    "title": "Google for Education",
    "department": "",
    "company": ""
  }
}