{
  "title": "S2 Ep11: #61 - We Vandalized Our Date's Car",
  "link": "https://audioboom.com/posts/7874577",
  "itunes:episode": 11,
  "itunes:title": "#61 - We Vandalized Our Date's Car",
  "itunes:season": 2,
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4536,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Go to <a href=\"http://hellofresh.com/10unfiltered\">http://hellofresh.com/10unfiltered</a><strong> </strong>and use code 10unfiltered for 10 free meals, including free shipping! </p>\n<p>Get $5 off and zero delivery fees on your first order of $15 or more when you download the DoorDash app and enter code UNFILTERED</p>\n<p>Go to <a href=\"http://expressvpn.com/unfiltered\">http://expressvpn.com/unfiltered</a> to get 3 extra months free! </p>\n<p>Go to<a href=\"%20http://brightcellars.com/unfiltered\"> http://brightcellars.com/unfiltered</a> to get 50% off your first 6 bottle order! </p>\n<p>Happy New Year! Bartender, fix me a stiff Zane + Heath: UNFILTERED, would ya?! Oh, you don’t know how to make it? Well that’s easy, it’s just one part alcohol and then one part questionable choices! Not getting it? Here, like this. One shot of tequila, and one shot of Zane getting scammed by his wellness doctor. Two shots of vodka, and two shots of Kenny keying a guy’s car. Oh and luckily, once the hangover wears off from THIS cocktail you realize just how questionable all your choices really were and you’re able to grow from them… or at least that’s what we keep telling ourselves. Sometimes the past is fun though! We chat about the golden age of trashy MTV shows and what we think might end up in a modern day time capsule. If the past isn’t your thing, how about a trip to fantasy land where we discuss our preferred superpowers and where we all have the authority to weigh in on modern medicine? Okay, on second thought maybe we should stay in our lane and stick to just drinking and raising speculation about Ariana Grande’s new engagement. Ooh, another questionable choice! You know what that means!</p>\n<p>Another round over here, bartender! And keep em coming because it has been far too long since I’ve gotten my UNFILTERED fix!</p>\n",
  "itunes:summary": "Go to http://hellofresh.com/10unfiltered and use code 10unfiltered for 10 free meals, including free shipping! \nGet $5 off and zero delivery fees on your first order of $15 or more when you download the DoorDash app and enter code UNFILTERED\nGo to http://expressvpn.com/unfiltered to get 3 extra months free! \nGo to http://brightcellars.com/unfiltered to get 50% off your first 6 bottle order! \nHappy New Year! Bartender, fix me a stiff Zane + Heath: UNFILTERED, would ya?! Oh, you don’t know how to make it? Well that’s easy, it’s just one part alcohol and then one part questionable choices! Not getting it? Here, like this. One shot of tequila, and one shot of Zane getting scammed by his wellness doctor. Two shots of vodka, and two shots of Kenny keying a guy’s car. Oh and luckily, once the hangover wears off from THIS cocktail you realize just how questionable all your choices really were and you’re able to grow from them… or at least that’s what we keep telling ourselves. Sometimes the...",
  "pubDate": "Mon, 04 Jan 2021 11:17:00 +0000",
  "guid": "c6a716b2-4e7e-11eb-913e-9f8c1b0f4839",
  "itunes:author": "Zane & Heath",
  "dc:creator": "Zane & Heath",
  "media:rights": ""
}