{
  "title": "An electronic-based model of the optical nonlinearity of low-density Drude materials. (arXiv:2210.08504v2 [physics.optics] UPDATED)",
  "link": "http://arxiv.org/abs/2210.08504",
  "description": "<p>Low electron density Drude (LEDD) materials such as indium tin oxide (ITO)\nare receiving considerable attention because of their combination of CMOS\ncompatibility, unique epsilon-near-zero (ENZ) behavior, and giant ultrafast\nnonlinear thermo-optic response. However, the understanding of the electronic\nand optical response of LEDD materials is so far based on simplistic extensions\nof known models of noble metals, frequently without the inclusion of the\ninterplay among the lower electron density, relatively high Debye energy, and\nthe non-parabolic band structure. To bridge this knowledge gap, this work\nprovides a complete understanding of the nonlinear electronic-thermal-optical\nresponse of LEDD materials. In particular, we rely on state-of-the-art electron\ndynamics modeling, as well as the newly derived time-dependent permittivity\nmodel for LEDD materials under optical pumping within the adiabatic\napproximation. We find that unlike noble metals, the electron temperatures can\nreach the Fermi temperature, in which case the effective chemical potential\ndramatically decreases and even becomes negative, thus, transiently converting\nthe Drude metal into a semiconductor. We further show that the nonlinear\noptical response of LEDD materials originating from the changes to the real\npart of the permittivity is due to the generation of non-thermal electrons.\nThis resolves the argument about the rise time of the permittivity and shows\nthat it is instantaneous. In this vein, we show that referring to the LEDD\npermittivity as having a ``saturable'' nonlinearity is unsuitable since its\npermittivity dynamics does not originate from population inversion. Finally, we\nanalyze the probe pulse dynamics and unlike previous work, we obtain a\nquantitative agreement with the results of recent experiments.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Un_I/0/1/0/all/0/1\">Ieng Wai Un</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Sarkar_S/0/1/0/all/0/1\">Subhajit Sarkar</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Sivan_Y/0/1/0/all/0/1\">Yonatan Sivan</a>"
}