{
  "id": "tag:blogger.com,1999:blog-6747621709757476971.post-1515747717034816712",
  "published": "2022-04-20T08:07:00.002-07:00",
  "updated": "2022-05-19T12:05:52.562-07:00",
  "category": "",
  "title": "Guest Blog: 10 Years serving clients shows that internet is a mission critical resource for Igniting Business",
  "content": "<blockquote>We’re launching a new guest series on the Google Fiber Blog featuring our awesome Google Fiber Business customers and how they make their internet service work for their businesses and their clients. We’re proud to open this series with a post from Kansas City’s <a href=\"https://www.ignitingbusiness.com/blog/authors/ben-seidel\">Ben Seidel</a>, CEO and Founder of <a href=\"https://www.ignitingbusiness.com/\">Igniting Business</a>, which has served hundreds of small businesses with web design, marketing, and SEO services since 2012. <br /><br /><img alt=\"Thumbnail\" src=\"https://lh5.googleusercontent.com/PMWFhixvHDxvCsYI7L5W7b-ADF-H7fm63N8flM-rgTpgrIhP2w5yXuc7toaFgWc-VtMtYHaoKQKoNclMsTbjSycO8yNyIKjkh4lVhiVh5hbMCC_htv6zNrkCz8SI160ZObl_XbA2MVJFEItUFgw=s16000\" title=\"Ben Seidel, CEO and Founder, Igniting Business\" /></blockquote>According to the <a href=\"https://www.bls.gov/bdm/entrepreneurship/entrepreneurship.htm\">U.S. Bureau of Labor Statistics</a>, only 1/3 of businesses even make it to the 10-year mark. As a family-owned company, <a href=\"https://www.ignitingbusiness.com/\">Igniting Business</a> is defying those odds, reaching the 10-year mark in 2022 with the help of undoubtedly a mission critical resource– reliable and speedy internet. <br /><br /><b>Prioritizing a Mission Critical Resource</b><br /><br />Since we started in 2012, Igniting Business’s goal has been to help small businesses succeed. As a web design and digital marketing company, literally everything we do heavily utilizes the internet! Whether it’s building new websites, launching digital marketing campaigns, providing technical support, or meeting virtually with clients, our business could not survive without reliable and blazing fast internet. <br /><br />Before we upgraded to Google Fiber, we had two internet packages routing to our office from two different providers. Our reliability on internet was so intense that we could no longer afford to be without internet for minutes, let alone hours or even a day. With our advanced setup, if the primary internet failed for more than 60 seconds, it would kick over to our redundant, albeit slower, back-up internet. As you can imagine, this required a more robust IT setup and was expensive. <br /><br />Eventually, we intentionally moved to an office where we knew Google Fiber could be installed, and <a href=\"https://fiber.google.com/business/\">Google Fiber Business’s speed and uptime</a> has dramatically impacted our business. In fact, we no longer need backup internet! With Google Fiber, we have more reliable and faster internet and at a lower price point. <br /><br /><blockquote><img src=\"https://lh3.googleusercontent.com/FGbxVE_n6XUgBTxD4rHj-I-ff9u-mpfEhZuoRj6YRGwpFXxqPoVJdowUiMJn2gEW6kGDr_RZs6tG-cK7I7z8-MXbSxAyR1N_E2xsYqZw-1vmGYjsrpmJlhkftb29XVZGlW5YLgQo3GUETzBV-V8=w400\" /></blockquote><br /><br /><b>Enabling Growth</b><br /><br />As Igniting Business faithfully served our customers, word spread regarding our quality of service and exclusive focus on small businesses. The beauty of our connected world is that we no longer need to be local to do business. <br /><br />As a result, we started receiving work requests from all over the nation. However, our small business clients could not justify the additional cost of flying us out to their location to do business, nor did phone calls create the personal touch that small business owners need before entrusting us with the growth of their business. <br /><br />Having high-speed internet for reliable video streaming, screen sharing, remote training, file sharing, and more enabled our business to proudly work with clients coast-to-coast in 24 states. <br /><br /><b>Making our Business Resilient</b><br /><br />When the pandemic hit and forced nationwide closures, we were in the midst of renovating our new office space in a new building. Thankfully, even amidst a pandemic that brought other businesses to a grinding halt, our reliable internet at the new office allowed our team to still work remotely in a streamlined and connected way with slightly cuter bosses at home. <br /><br /><img src=\"https://lh4.googleusercontent.com/rOLemqdGBLmylNBMwNjT-m94l5EG-eo0oXgI2t-hKkfMkaCy3wYXNnKqhDne498N3qqohPGhe7_YpGf_aSJ9p2JeKhe1FacvK5dxtOJ0njP0oMqXRSzCcW0b-kmCFI5y56kLYZY6EGzwW-vetZY\" /><blockquote>Some of our team members’ home office setups during the pandemic lockdown.</blockquote><br /><br />Our connected team was able to continue helping our clients succeed despite unimaginable challenges brought on by the pandemic. We helped them reach numerous odds-defying achievements: including (1) a single location restaurant opening a 2nd location in 2021, and now a third in 2022 and (2) a software client growing from 16 employees (pre-pandemic) to well over 100. Our clients that valiantly chose to see the newfound circumstances during the pandemic as an opportunity included numerous construction, engineering, and facility maintenance clients who are now hitting record numbers, as well as legal, finance, and healthcare clients who are helping their customers navigate likely one of the most tricky and stressful times of their lives. <br /><br /><b>How Technology Empowers Us to Innovate Into the Future</b><br /><br />We understand, as a small business, our impact can be limited. However, with the connectivity and reach that our Google Fiber internet brings us, we continue to look for ways to serve more businesses, even if we cannot help them directly with our services. During the pandemic we spoke at webinars where we shared marketing insights with 70+ business owners simultaneously and looked for other ways to spark  new growth ideas for small businesses. <br /><br /><img src=\"https://lh6.googleusercontent.com/BE0f63iO2RtU7QDp8Jhk0OlJtmIB_O941i49wbDioV1NQ9hxtdwkiCGmmEARG9yajsXf40NyYUFETH6Dd7gGQ-K_apEMgZAhiE6FHYEHHjGfcfvju0m5rAuOqZubv1HWaWFyX-kEOLubrA8zOMw=w300\" /><br /><br />In 2021, we launched our new website with a robust and free Resources section that includes <a href=\"https://www.ignitingbusiness.com/blog\">content on various web design, SEO, and marketing tactics</a>, a free monthly <a href=\"https://www.ignitingbusiness.com/newsletter\">newsletter with tips and tricks</a>, and even a list of the <a href=\"https://www.ignitingbusiness.com/recommended-tools\">recommended tools</a> and software we use at Igniting Business. Even though we can only serve a finite number of clients directly, we provide our free resources to thousands of small business owners and marketers each month! <br /><br />As we sunset our first decade in business and look to the next, we continue to explore ways to help the small business community thrive, whether it’s locally in Kansas City or 2,000+ miles away, and we know that our Google Fiber internet will help us keep up with whatever that future holds. <br /><br />Thank you to our clients across the nation for working with us and for trusting our team these past 10 years. Cheers to the next decade! <br /><br />Posted by Ben Seidel, CEO and Founder, Igniting Business <br /><br /><br />",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google Fiber",
    "uri": "http://www.blogger.com/profile/08137833201549488546",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}