{
  "title": "The Edition: Can Britain, America and Australia contain China?",
  "link": "https://audioboom.com/posts/7947505",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2582,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: can the new Aukus alliance contain China? In his cover piece this week, James Forsyth writes that the new Aukus pact has fixed the contours of the next 30 years of British foreign policy. Britain, he says, is no longer trying to stay neutral in the competition between America and China. On the podcast James is joined by Francis Pike, author of <em>Empires at War: A Short History of Modern Asia Since World War II</em>, who also wrote for the magazine this week, giving the case against Aukus. (00:45)<br>\n<br>\nAlso this week: what can be done to save the Church of England’s parishes? Back in February, Emma Thompson, a rural parish volunteer, and the Reverend Marcus Walker, Rector of St Bartholomew the Great, London, wrote pieces for the Spectator expressing their concern for the future of the Church of England’s parish system. The Archbishops of Canterbury and York dismissed these concerns as scaremongering from ‘rascally voices’. Seven months on there is a new threat to the parish, which Emma writes about in this week’s magazine. She is joined by Marcus on the podcast to explain what you can do to save your local church. </div>\n<div>. (16:35)<br>\n<br>\nAnd finally: in a time when travel has never been faster, why has so little been done to reform queues? This is the question Harry Mount asks in the magazine this week. He sits down with me now, with the Spectator’s Wiki Man columnist, Rory Sutherland to pitch some transformative ideas on how to update this very British pastime.  (29:10)<br>\n<br>\nHosted by William Moore<br>\n<br>\nProduced by Sam Holmes</div>\n",
  "pubDate": "Thu, 23 Sep 2021 16:03:00 +0000",
  "guid": "tag:audioboom.com,2021-09-23:/posts/7947505",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}