{
  "title": "The Godfather of South Korea’s Chip Industry",
  "link": "https://spectrum.ieee.org/kim-choong-ki",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-man-in-a-dark-suit-bald-with-some-grey-hair-leans-against-a-shiny-blue-wall-in-which-he-is-reflected.png?id=31216838&width=1200&height=800&coordinates=0%2C203%2C0%2C203\"/><br/><br/><p>\n\tThey were called “Kim’s Mafia.” Kim Choong-Ki himself wouldn’t have put it that way. But it was true what semiconductor engineers in South Korea whispered about his former students: They were everywhere.\n</p><p>\n\tStarting in the mid-1980s, as chip manufacturing in the country accelerated, engineers who had studied under Kim at \n\t<a href=\"https://www.kaist.ac.kr/en/\" target=\"_blank\">Korea Advanced Institute of Science and Technology</a> (KAIST) assumed top posts in the industry as well as coveted positions teaching or researching semiconductors at universities and government institutes. By the beginning of the 21st century, South Korea had become a dominant power in the global semiconductor market, meeting more than 60 percent of international demand for memory chips alone. Around the world, many of Kim’s protégés were lauded for their brilliant success in transforming the economy of a nation that had just started assembling radio sets in 1959 and was fabricating outdated memory chips in the early ’80s.\n</p><hr/><p>\n\tThat success can be traced in part to Kim, now an emeritus professor at KAIST. Of average height, with gray hair since his mid-30s, he was the first professor in South Korea to systematically teach semiconductor engineering. From 1975, when the nation had barely begun producing its first transistors, to 2008, when he retired from teaching, Kim trained more than 100 students, effectively creating the first two generations of South Korean semiconductor experts.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A crowd of more than two dozen people seated and standing atop a rock formation. A large white sign is at center.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"dd2f48de8c71c758be94a613d3c278fd\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"65ad3\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-crowd-of-more-than-two-dozen-people-seated-and-standing-atop-a-rock-formation-a-large-white-sign-is-at-center.png?id=31216852&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Kim and his former students and their families celebrate his 60th birthday on the summit of South Korea’s Mount Deokyu.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Chang Hae-Ja</small>\n</p><p>\n\tThe Samsung Welfare Foundation recognized Kim’s influence when it \n\t<a href=\"http://www.hoamfoundation.org/eng/award/part_view.asp?idx=10\" target=\"_blank\">awarded him its prestigious Ho-Am Prize in 1993</a> for “building a solid foundation for Korea’s semiconductor industry.” Since then, he has been revered in the South Korean media as the industry’s “godfather.” Yet even today, Kim remains largely unknown outside of South Korea’s chip community. Who, then, is this inconspicuous semiconductor “Mafia” boss?\n</p><h2>A Start in Camera Chips<br/>\n</h2><p>\n\tKim Choong-Ki was born in Seoul in 1942, when Korea was a colony of the Japanese Empire. His mother taught elementary school; his father, Kim Byung-Woon, was a textile engineer for \n\t<a href=\"http://www.kyungbang.co.kr/eng/company/comp_hist.asp?leftselect=3\" target=\"_blank\">Kyungbang</a>, Korea’s iconic manufacturer of yarns and fabrics. The elder Kim had helped build the company’s first spinning factory, and his engineering savvy and consequent renown impressed his son. “He made a daily tour of the factory,” the younger Kim recalls. “He told me that he could detect which machines were in trouble and why, just by listening to them.” Such lessons planted the seed of an ethos that would drive Kim Choong-Ki’s career—what he came to call the “engineer’s mind.”\n</p><p>\n\tGrowing up, Kim Choong-Ki was a model South Korean student: bookish, obedient, and silent. Although his family pressed him to join his father in the textile industry, he instead chose to pursue electrical engineering. He studied at Seoul National University and then at Columbia University, in New York City, where he earned his doctorate under \n\t<a href=\"https://ieeexplore.ieee.org/author/37272530500\" target=\"_blank\">Edward S. Yang</a>, a specialist in transistor theory. Shortly after, in the summer of 1970, Fairchild Camera and Instrument hired Kim to work in its research and development laboratory in Palo Alto, Calif.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A young man in a jacket and tie stands before a pillared building with dozens of steps leading up to it.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"e18e5ef96f164ac42efefec0e8e32262\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"db5be\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-young-man-in-a-jacket-and-tie-stands-before-a-pillared-building-with-dozens-of-steps-leading-up-to-it.png?id=31218218&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Kim, shown on the Columbia campus, studied for his Ph.D. at the university under Edward S. Yang, a specialist in transistor theory. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Chang Hae-Ja</small>\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A woman with short grey hair is seated at a table. Behind her stand an older man in a hat and young man.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"e589f40bf4f1d9a971469aadccf08b0a\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"88d46\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-woman-with-short-grey-hair-is-seated-at-a-table-behind-her-stand-an-older-man-in-a-hat-and-young-man.png?id=31216878&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\" style=\"max-width: 100%;\">Kim’s mother and father, a renowned Korean textile engineer, visit him in Palo Alto, Calif., in 1972.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\" style=\"max-width: 100%;\">Chang Hae-Ja</small>\n</p><p>\n\tSince World War II, Fairchild Camera had been the world’s leading developer of imaging equipment, including radar cameras, radio compasses, and X-ray machines. In 1957, the company launched the division Fairchild Semiconductor to fabricate transistors and integrated circuits from silicon, then an innovative move, as most semiconductor devices at the time used germanium. The venture spawned dozens of products, including the first silicon integrated circuit, thus fueling the rise of Silicon Valley. As a newcomer to Fairchild’s R&D lab, Kim was put to work on one of these new kinds of chips: the charge-coupled device.\n</p><p>\n\tJust the year before, in 1969, George E. Smith and Willard Boyle at Bell Laboratories \n\t<a href=\"https://ieeexplore.ieee.org/document/6768140\" target=\"_blank\">proposed the idea of the CCD</a>, for which they would later win a Nobel Prize. But it was Kim and his colleagues at Fairchild who realized the first CCD devices that evolved into commercial products widely used in digital photography, radiography, and astronomy. Kim became so proficient in CCD technology that other engineers at the company regularly dropped by his office at the end of the day to pick his brain. “Soon they began to call me Professor CCD,” he remembers.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A young man in a jacket and tie stands in front of a pale brick wall with lettering attached.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"4713a1bfc7179181ffafe819904be5e0\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"74e66\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-young-man-in-a-jacket-and-tie-stands-in-front-of-a-pale-brick-wall-with-lettering-attached.png?id=31218403&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Kim’s colleagues at Fairchild Semiconductor’s research and development laboratories called him “Professor CCD.”</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Chang Hae-Ja</small>\n</p><p>\n\t Among other inventions, Kim helped develop a \n\t<a href=\"https://ieeexplore.ieee.org/document/1451152\" target=\"_blank\">CCD area image sensor that greatly improved low-light detection</a> and the first <a href=\"https://ieeexplore.ieee.org/document/6219610\" target=\"_blank\">two-phase CCD linear image sensor</a>—which, he reported, guaranteed “the ease of use and the high quality of image reproduction.” “Fairchild’s—or better call them Choong-Ki’s—CCDs made possible the wide applications in high-resolution cameras,” Columbia’s Yang says. Without these functional devices, he adds, “there would be no Nobel Prize for the CCD.”\n</p><p>\n\tKim’s time at Fairchild transformed him as much as it did camera technology. His schooling in South Korea and at Columbia had primarily emphasized book learning and theory. But his experience at Fairchild solidified his belief, first inspired by his father, that a true “engineer’s mind” requires practical skill as much as theoretical knowledge. In addition to performing experiments, he made a habit of reading internal technical reports and memos that he found at the company library, some of which he later brought to KAIST and used as teaching material.\n</p><p>\n\tAt Fairchild, Kim also learned how to communicate with and lead other engineers. When he started there, he was soft-spoken and introverted, but his mentors at Fairchild encouraged him to express himself confidently and clearly. Later, the converted Kim would become the “loudest-speaking” professor at KAIST, according to several fellow faculty members, and they say his absence made the whole campus seem quiet.\n</p><p>\n\tKim rose quickly within Fairchild’s hierarchy. But just five years into his tenure, he returned to South Korea. His beloved father had died, and, as the eldest son, he felt a heavy responsibility to care for his widowed mother. Racial discrimination he experienced at Fairchild had also hurt his pride. Most important, however, he had found an ideal place to work back home.\n</p><p>\n\tThen called KAIS (the “T” was added in 1981), Kim’s new employer was the first science and technology university in South Korea and remains one of the most prestigious. The South Korean government had established the institute in 1971 with financing from the United States Agency for International Development and had invited \n\t<a href=\"https://ieeexplore.ieee.org/document/6370209\" target=\"_blank\">Frederick E. Terman</a>, the legendary dean of Stanford University’s school of engineering and a “father” of Silicon Valley, to draw up the blueprint for its direction. Terman stressed that KAIS should aim to “satisfy the needs of Korean industry and Korean industrial establishments for highly trained and innovative specialists, rather than to add to the world’s store of basic knowledge.” It was the perfect place for Kim to spread his newfound philosophy of the “engineer’s mind.”\n</p><h2>South Korea’s Founding Lab<br/>\n</h2><p>\n\tKim’s laboratory at KAIS attracted scores of ambitious master’s and doctoral candidates from almost the moment he arrived in the spring of 1975. The primary reason for the lab’s popularity was obvious: South Korean students were hungry to learn about semiconductors. The government touted the importance of these devices, as did electronics companies like GoldStar and Samsung, which needed them to manufacture their radios, televisions, microwaves, and watches. But the industry had yet to mass-produce its own chips beyond basic integrated circuits such as CMOS watch chips, in large part due to a lack of semiconductor specialists. For 20 years, until the mid-1990s, joining Kim’s lab was essentially the only way for aspiring semiconductor engineers in South Korea to get hands-on training; KAIS was the only university in the country that had able teachers and proper facilities, including clean rooms for assembling high-quality chips.\n</p><p>\n\tBut it wasn’t KAIST’s virtual monopoly on semiconductor training that made Kim a mentor without peer. He introduced a style of teaching and of mastering engineering that was new to South Korea. For instance, his conviction that an “engineer’s mind” requires equal parts theory and application at first puzzled his students, who regarded engineering as chiefly a scholarly discipline. Although they were proficient in mathematics and well read, most of them had never carried out any serious work in design and construction.\n</p><p>\n\tTherefore, one of the first lessons Kim taught his students was how to use their hands. Before they embarked on their own projects, he put them to work cleaning the lab, repairing and upgrading equipment, and tracking down necessary parts. In this way, they learned how to solve problems for themselves and how to improvise in situations for which no textbook had prepared them. Their view of what it means to be an engineer changed profoundly and permanently. Many of them confess they still repeat Kim’s dicta to this day. For example: “Don’t choose the subjects that others have already thrown into the trash can.” And: “Scientists consider \n\t<em>why</em> first, but we engineers must think <em>how</em> first.” And: “Wrong decision is better than slow decision.”\n</p><p>\n\tKim’s former students remember him as kind, humorous, nonauthoritarian, meticulous, and hardworking. But they also say he was strict and could be hot tempered and even terrifying, especially when he thought they were being lazy or sloppy. Legend has it that some of his students entered the lab via a ladder from the rooftop to bypass Kim’s office. One of his biggest grievances was when students failed to properly balance theory and practice. “Make it yourself; then we will start a discussion,” he scolded those who focused too much on intellectual study. On the other hand, he said, “Why don’t you use something malleable within the hard nut on your neck?” as a reproach to those who spent too much time building things, implying that they should also use their brains.\n</p><h3>Meet Kim’s Mafia</h3><br/><p>Many of Kim Choong-Ki’s former students helped lead the rise of semiconductor engineering in South Korean through prominent roles in industry, government, and academia. Here are some of the standouts.</p><h3></h3><br/><img class=\"rm-shortcode\" data-rm-shortcode-id=\"f6889df775be3956a2003f8670c69911\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"e450d\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image.png?id=31254629&width=980\"/><p><strong>Kyung Chong-Min</strong>: As Kim’s first doctoral candidate at KAIST, Kyung became a professor at his alma mater at the age of 30. He is best known for designing microprocessor chips in the early 1990s that were fully compatible with Intel 80386 and 80486 chips. He also established and operated two centers for chip design. </p><h3></h3><br/><img class=\"rm-shortcode\" data-rm-shortcode-id=\"3e48b9bec1113162ce6e6795c5af340b\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"e0050\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image.png?id=31254624&width=980\"/><p><strong></strong><strong>Kwon Oh-Hyun:</strong> Kwon received a master’s degree under Kim and his doctoral degree from Stanford University. At Samsung Electronics, he developed 64-megabit DRAM in the early 1990s and contributed to the development of the company’s System LSI division in the 2000s. He served as CEO and vice-chairman of the company during most of the 2010s. </p><h3></h3><br/><div class=\"horizontal-rule\">\n</div><h3></h3><br/><img class=\"rm-shortcode\" data-rm-shortcode-id=\"9b4083b44637cf08b8ab606f491b69f1\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"dc929\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image.png?id=31254597&width=980\"/><p>\n<strong></strong><strong>Lim Hyung-Kyu:</strong> Lim studied PMOS devices under Kim and later became Samsung’s first overseas scholarship student (at the University of Florida). He was best known for developing NAND flash memory in the early 1990s and was often called “Mr. NAND Flash.” After retiring from Samsung, he served as vice-chairman of the SK conglomerate.\n</p><h3></h3><br/><img class=\"rm-shortcode\" data-rm-shortcode-id=\"e6d73b22a27d00db318b7336d3d2d8b3\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"3cb90\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image.png?id=31254590&width=980\"/><p><strong></strong><strong>Suh Kang-Deog:</strong> Suh received both master’s and doctoral degrees under Kim. At Samsung Electronics, he participated in various memory projects including NAND flash. In 2006 he was elected a Samsung Fellow, the company’s highest honor, for his contributions and in expectation of his future work.  </p><h3></h3><br/><div class=\"horizontal-rule\">\n</div><h3></h3><br/><img class=\"rm-shortcode\" data-rm-shortcode-id=\"d8106f61fe728d8946c478c69c246fb7\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"b9b5b\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image.png?id=31254571&width=980\"/><p><strong></strong><strong>Cho Byung-Jin:</strong> Cho has authored more than 300 technical papers on various subjects. He briefly worked at Hyundai Electronics (now Hynix) and then became a star engineering professor at the National University of Singapore for 10 years. He returned to KAIST in 2007 and pioneered research in graphene and thermoelectric devices.</p><h3></h3><br/><img class=\"rm-shortcode\" data-rm-shortcode-id=\"88d71368f4ec4414324a283038243e64\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"d7338\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image.png?id=31254565&width=980\"/><p><strong>Ha Yong-Min:</strong> Ha is the master of TFT-LCD and OLED technologies at LG Display, having worked on the subject from his graduate years under Kim to the present. Thanks to his efforts, LG Display became a major supplier of TFT-LCD and OLED panels for medium and small electronic devices, including those marketed by Apple, HP, Dell, and Lenovo.</p><h3></h3><br/><div class=\"horizontal-rule\">\n</div><h3></h3><br/><img class=\"rm-shortcode\" data-rm-shortcode-id=\"a1c5f6313c8f09af31ef8385e8e3c499\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"415ac\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image.png?id=31254561&width=980\"/><p><strong>Park Sung-Kye:</strong> Park, sometimes called the “treasure of Hynix,” has developed almost all types of memory chips, including highly efficient and speedier DRAMs and the smallest NAND flash-memory cell. He was also in charge of the development of the 96-layer 3-D NAND flash memory in the late 2010s.</p><h3></h3><br/><img class=\"rm-shortcode\" data-rm-shortcode-id=\"df3c6f293741bb3692c6c0b599d69436\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"68045\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image.png?id=31254749&width=980\"/><p><strong>Chung Han:</strong> Chung is perhaps the most successful engineer-turned-startup-entrepreneur among Kim’s former students. His i3system develops sophisticated infrared image sensors for both defense and commercial markets. Thanks to his more than 30 years of effort, South Korea became the seventh nation in the world to mass-produce infrared image sensors.</p><p>\n\t Kim influenced not only his own students but also countless others through his openness. He cooperated with and even shared laboratory space with other KAIST professors, and he liked to visit other departments and universities to give seminars or simply to gain new ideas and perspectives—behavior that was, and still is, very unusual in South Korean academic culture. In his autobiography, \n\t<a href=\"https://cgt.ucsd.edu/fellows/past/chin.html\" target=\"_blank\">Chin Dae-Je</a>, who developed 16-megabit DRAM at Samsung in 1989 and later served as South Korea’s minister of information and technology, recounts seeking out Kim’s tutelage when Chin was a graduate student at Seoul National University in the mid-1970s. “There was an intense spirit of competition” between SNU and KAIST, recalls Chin, whose alma matter labeled him a “problem student” for studying with a rival professor.\n</p><p>\n\tKim’s collegiality extended beyond academia to industry and government . In the early 1980s, during a sabbatical, he led semiconductor research and development at the government-funded \n\t<a href=\"https://www.etri.re.kr/eng/main/main.etri\" target=\"_blank\">Korea Institute of Electronics Technology</a>, which developed both 32-kilobit and 64-kilobit ROM under his directorship. His popular semiconductor workshops at KAIST inspired GoldStar (LG since 1995), Hyundai Electronics (Hynix since 2001), and Samsung to sponsor their own training programs at KAIST in the 1990s. Kim’s close partnership with these companies also helped launch other pioneering mostly-industry-funded initiatives at KAIST, including the Center for High-Performance Integrated Systems and the <a href=\"https://www.idec.or.kr/\" target=\"_blank\">Integrated-Circuit Design Education Center,</a> both directed by Kim’s former student Kyung Chong-Min. And the semiconductor industry, in turn, benefited from the ever more highly trained workforce emerging from Kim’s orbit.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"More than three dozen people stand in in four rows. A bald man is at the center of the front row.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"946f78f5532ae5ad8a9d75fea834c37f\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"d5149\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/more-than-three-dozen-people-stand-in-in-four-rows-a-bald-man-is-at-the-center-of-the-front-row.png?id=31217297&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Kim [front row, orange tie] also served as director of Korea’s Center for Electro-Optics, a government-sponsored research institute formed to develop technologies for thermal imaging, fiber optics, and lasers.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Chang Hae-Ja</small>\n</p><h2>The Evolution of South Korea’s Semiconductor Industry<br/>\n</h2><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"Two men in academic robes and mortar caps face the camera. Others in similar dress or in suits appear the background facing in different directions.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"fd8c7300f5c7aed0c4a54493bf8cac62\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"b6bf8\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/two-men-in-academic-robes-and-mortar-caps-face-the-camera-others-in-similar-dress-or-in-suits-appear-the-background-facing-in-d.png?id=31255772&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\" style=\"max-width: 100%;\">Chung Jin-Yong [right], a former student of Kim [left], graduated from KAIST in 1976 and later developed DRAM for Hynix.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\" style=\"max-width: 100%;\">Chang Hae-Ja</small>\n</p><p>\n\tKim’s lab at KAIST evolved in parallel with the growth of the semiconductor sector in South Korea, which can be divided into three periods. During the first period, beginning in the mid-1960s, the government led the charge by enacting laws and drawing up plans for industry development, establishing research institutes, and pressing companies and universities to pay more attention to semiconductor technology. Samsung and other electronics companies wouldn’t get serious about manufacturing semiconductor devices until the early 1980s. So when Kim started his lab, almost a decade prior, he was training engineers to meet the industry’s \n\t<em>future</em> needs.\n</p><p>\n\tHis first group of students worked primarily on the design and fabrication of semiconductors using PMOS, NMOS, and CMOS technologies that, while not cutting edge by global standards, were quite advanced for the South Korea of the time. Because there were few industry jobs, many alumni of Kim’s lab took positions at government research institutes, where they developed state-of-the-art experimental chips. An exception was Lim Hyung-Kyu, one of Kim’s first master’s candidates, whom Samsung sent to study at KAIST in 1976. Lim would go on to lead the development of various memory devices at Samsung, most importantly NAND flash memory in the 1990s.\n</p><p>\n\tThe second period started in 1983, when Samsung declared that it would pursue semiconductors aggressively, starting with DRAM. The move drove rival conglomerates such as Hyundai and GoldStar to do likewise. As a result, the South Korean chip industry rapidly expanded. KAIST and other universities provided the necessary manpower, and the government reduced its role. In Kim’s lab, students began to explore emerging technologies—including polysilicon thin-film transistors (for LCD panels), infrared sensors (for military use), and rapid thermal processing (which increased efficiency and reduced costs of semiconductor production)—and published their results in prestigious international journals.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Seven men in academic robes and three others in suits stand shoulder to shoulder.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"ef2079f969f113eabcaff186a43c3920\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"7e6fc\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/seven-men-in-academic-robes-and-three-others-in-suits-stand-shoulder-to-shoulder.png?id=31217167&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">KAIST engineering professors Kim [center, gray robe] and Kwon Young-Se [right, blue hood] pose with master’s graduates in 1982. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Chang Hae-Ja</small>\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A bespectacled man in a suit smiles while holding a smartphone.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"c9b370dd80d4f2c3f1f871bb1000c979\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"198c5\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-bespectacled-man-in-a-suit-smiles-while-holding-a-smartphone.jpg?id=31246169&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\" style=\"max-width: 100%;\">Kim’s former master’s student, Kwon Oh-Hyun, rose to become vice chairman and CEO of Samsung Electronics. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\" style=\"max-width: 100%;\">Saul Loeb/AFP/Getty Images</small>\n</p><p>\n\t KAIST graduates flocked to Samsung, GoldStar/LG, and Hyundai/Hynix. As government influence declined, some alums from the first period who had worked at government research institutes also took corporate jobs. At the same time, more and more of Kim’s former students accepted university professorships. After leaving Kim’s lab in 1991, for instance, Cho Byung-Jin spent four years developing DRAM and flash memory at Hyundai before becoming a star professor at the National University of Singapore and later at KAIST. Kyung Chong-Min, Kim’s first doctoral candidate, joined KAIST’s faculty in 1983; by the time he retired in 2018, Kyung had trained more semiconductor specialists than Kim himself.\n</p><p>\n\tDuring the third period, from 2000 on, industry seized the helm of semiconductor development. Academia churned out more specialists as well as significant research, with minimal contribution from government. Alumni of Kim’s lab continued to lead semiconductor engineering, some of them rising to become high-ranking executives. For example, \n\t<a href=\"https://en.wikipedia.org/wiki/Kwon_Oh-hyun\" target=\"_blank\">Kwon Oh-Hyun</a>, who received his master’s degree from KAIST in 1977, served as CEO at Samsung Electronics for most of the 2010s, when the company dominated the world market in not only memory but also mobile phones, TVs, and home appliances.\n</p><div class=\"ieee-sidebar-medium\">\n<h3>Kim Choong-Ki in Quotes</h3>\n<p>\n\t“If you repeat others’ ideas, you will never overcome them but just follow their buttocks.”\n\t</p>\n<p>\n\t“Be prepared for the worst case.”\n\t</p>\n<p>\n\t“If you work harder, everyone in your laboratory will be more comfortable. If you are comfortable, everyone in your laboratory will have to work harder.”\n\t</p>\n<p>\n\t“The economic development of Korea was dependent on reverse engineering and following [the maps of] advanced countries…. We now have to change our educational policy and teach our students how to draw maps.”\n\t</p>\n<p>\n\t“Make it yourself; then we will start a discussion.”\n\t</p>\n<p>\n\t“Why don’t you use something malleable within the hard nut on your neck?”\n\t</p>\n<p>\n\t“Don’t choose the subjects that others have already thrown into the trash can.”\n\t</p>\n<p>\n\t“Scientists consider \n\t\t<em>why</em> first, but we engineers must think <em>how</em> first.”\n\t</p>\n<p>\n\t“Wrong decision is better than slow decision.”\n\t</p>\n</div><p>\n\tOther alums played key roles in semiconductor research and development. Ha Yong-Min at LG Display mastered TFT-LCD and OLED screens for tablets, notebook computers, and cellphones; Park Sung-Kye, sometimes called the “treasure of Hynix,” developed most of the company’s memory products. In academia, meanwhile, Kim had become a model to emulate. Many of his trainees adopted his methods and principles in teaching and mentoring their own students to become leaders in the field, ensuring a steady supply of highly skilled semiconductor engineers for generations to come.\n</p><p>\n\tIn the spring of 2007, less than a year before Kim turned 65—the compulsory retirement age in South Korean academia—KAIST elected him as one of its first distinguished professors, thus extending his tenure for life. Besides the Ho-Am Prize, he has garnered numerous other awards over the years, including the Order of Civil Merit for “outstanding meritorious services…in the interest of improving citizens’ welfare and promoting national development.” And in 2019, he was named a Person of Distinguished Service to Science and Technology, one of the nation’s highest honors.\n</p><h2>Legend and Legacy</h2><p>\n\tFor young semiconductor engineers in South Korea today, Kim Choong-Ki is a legend—the great unsung hero behind their nation’s ascendancy in chip production. But its dominance in the world market is now under threat. Although South Korea has competed furiously with Taiwan in recent decades, its most formidable challenger in the future will likely be China, whose ambitious \n\t<a href=\"https://www.uschamber.com/assets/archived/images/final_made_in_china_2025_report_full.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Made in China 2025</a> plan prioritizes semiconductor development. Since 2000, the country has been a major importer of South Korean chips. But China’s recent heavy investment in semiconductors and the availability of highly educated Chinese engineers—including semiconductor specialists trained in the United States, Japan, and South Korea—means that Chinese semiconductor companies could soon become major global competitors.\n</p><div class=\"ieee-sidebar-medium\">\n<p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"An elderly man with a fringe of white hair sits in a red leather chair.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"9c290ce389037902651db1fda69df772\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"1fabb\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/an-elderly-man-with-a-fringe-of-white-hair-sits-in-a-red-leather-chair.png?id=31218981&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\" style=\"max-width: 100%;\">Korea Academy of Science and Technology  </small>\n</p>\n<h3>Kim Choong-Ki</h3>\n<p>\n<strong>Date of birth: </strong>1 October 1942\n\t</p>\n<p>\n<strong>Birthplace: </strong>Seoul\n\t</p>\n<p>\n<strong>Height:</strong> 170 centimeters\n\t</p>\n<p>\n<strong>Family: </strong>Wife, (Chang) Hae-Ja; sons, Ho-Sun and Ho-Jung\n\t</p>\n<p>\n<strong>Education: </strong>B.E., Seoul National University, 1965; M.E., Columbia University, 1967; Ph.D., Columbia University 1970\n\t</p>\n<p>\n<strong>First employer: </strong>Fairchild Camera and Instrument Corp.\n\t</p>\n<p>\n<strong>Current job: </strong>Distinguished Professor and Professor Emeritus at KAIST\n\t</p>\n<p>\n<strong>Students: </strong>117 (78 master’s, 39 doctoral)\n\t</p>\n<p>\n<strong>Patents: </strong>15 (3 in the United States, 12 in South Korea)\n\t</p>\n<p>\n<strong>Biggest surprise in career: </strong>Appointment to vice president of KAIST in 1995\n\t</p>\n<p>\n<strong>Hero: </strong>His father, Kim Byung-Woon\n\t</p>\n<p>\n<strong>Favorite periodical: </strong><em>TIME </em>magazine\n\t</p>\n<p>\n<strong>Favorite kind of music: </strong>Classical\n\t</p>\n<p>\n<strong>Favorite movie: </strong><em>Ode to My Father</em>, 2014 (South Korean film)\n\t</p>\n<p>\n<strong>Leisure: </strong>Walking\n\t</p>\n<p>\n<strong>Languages spoken: </strong>English and Korean\n\t</p>\n<p>\n<strong>Car: </strong>Hyundai Genesis\n\t</p>\n<p>\n<strong>Organizational memberships: </strong>IEEE, Korean Institute of Electrical Engineers, The Korean Academy of Science and Technology\n\t</p>\n<p>\n<strong>Major awards: </strong>Ho-Am Prize by the Samsung Welfare Foundation (1993), Moran Medal (1997) and election as Person of Distinguished Service to Science and Technology (2019) by the South Korean government, IEEE Fellow\n\t</p>\n</div><p>\n\tCompounding the problem, the South Korean government has neglected its role in supporting chip development in the 21st century. Nearly 50 years after Kim began educating its first semiconductor engineers, the industry again faces a significant workforce shortage. Experts estimate that \n\t<a href=\"https://www.joongang.co.kr/article/25078089#home\" target=\"_blank\">several thousand new engineering specialists are needed each year</a>, but the country produces only a few hundred. Yet despite companies’ pleas for more workers and universities’ calls for policies that advance academic education and research, the government has done little.\n</p><p>\n\tToward the end of his career, Kim had become concerned with the limitations of the kind of “engineer’s mind” that had taken root in South Korea. “The economic development of Korea was dependent on reverse engineering and following advanced countries,” he said in an interview in 1997. That fast-follower approach, he added, relied on an educational system that taught students “how to read maps”—to identify a known product goal and plot a course for achieving it. “And who made the maps? Advanced countries.” He thus concluded, “We now have to change our educational policy and teach our students how to draw maps.”\n</p><p>\n\tKim himself may not have fully realized this ambitious vision of cultivating a country of creative-minded engineers, capable of pioneering truly groundbreaking technologies that might secure his country’s leadership on the world stage. But hopefully his successors have taken his advice to heart. The future of South Korea depends on it. \n\t<span class=\"ieee-end-mark\"></span>\n</p><p>\n<em>To read more, see “</em><a href=\"https://www.tandfonline.com/doi/abs/10.1080/19378629.2019.1647218?journalCode=test20\" target=\"_blank\">Transfer of ‘Engineer’s Mind’: Kim Choong-Ki and the Semiconductor Industry in South Korea</a>,”<em> Engineering Studies 11:2 (2019), 83-108.</em>\n</p><p><em>This article appears in the October 2022 print issue.</em></p>",
  "pubDate": "Sat, 27 Aug 2022 15:00:00 +0000",
  "guid": "https://spectrum.ieee.org/kim-choong-ki",
  "category": [
    "Semiconductors",
    "South korea",
    "Kaist",
    "Samsung",
    "Lg",
    "Hynix",
    "Engineering education"
  ],
  "dc:creator": "Dong-Won Kim",
  "media:content": ""
}