{
  "title": "Can a Free Market Economy Be Trusted to Recover on Its Own?",
  "link": "https://mises.org/node/60660",
  "description": "<p>Following in the footsteps of John Maynard Keynes, most economists hold that one cannot have complete trust in a market economy, which is seen as inherently unstable. If left free, the market economy could lead to self-destruction, hence the need for the government and the central bank to manage the economy. Successful management in the Keynesian framework is done by influencing overall spending.</p>\n<p>According to this framework, spending generates income, with spending by one individual becoming income of another. The more that is spent, the greater the income will be. Spending drives the economy, and if consumers fail to spend during a recession, it is the role of the government to step in and boost overall spending.</p>\n<h4>Funding and Economic Growth</h4>\n<p>What is missing in the Keynesian story is the matter of funding. For instance, a baker produces ten loaves of bread out of which he consumes two loaves. The saved eight loaves of bread he exchanges for a pair of shoes with a shoemaker. Note the baker funds the purchase of shoes by means of the saved eight loaves of bread.</p>\n<p>The bread maintains the shoemakers’ life and well-being. Likewise, the shoemaker has funded the purchase of bread by means of the saved shoes.</p>\n<p>Assume the baker decides to build another oven to increase production of bread. To implement his plan, the baker hires the services of the oven maker, paying the oven maker with some of the bread he has produced. The building of the oven is supported by the production of bread. If for whatever reasons the flow of the bread production is disrupted the baker would not be able to pay the oven maker. As a result, the making of the oven would have to be abandoned.</p>\n<p>We can infer that what matters for economic growth is not just tools, machinery, and the pool of labor, but an adequate flow of consumer goods that maintains individuals’ life and well-being. By means of a saved consumer good—the bread—the baker can fund the expansion of his production structure. Similarly, other producers must have saved consumer goods—real savings—to fund the purchase of the goods and services they require.</p>\n<p>The introduction of money does not alter the essence of funding. The baker exchanges the saved bread for money and then exchange the money for the shoes. (Money is just the medium of exchange. It is only employed to facilitate the flow of goods; money cannot replace consumer goods.)</p>\n<p>According to popular thinking, the demand for goods grows when the money supply increases. We believe that the demand for goods is constrained by the production of goods. The greater the production of goods, the more goods can one demand, with money simply facilitating the exchange of goods.</p>\n<h4>Government Is Not a Wealth Generator</h4>\n<p>The government as such does not produce real wealth. How, then, can an increase in government outlays grow an economy? People employed by the government expect compensation for their work, but the only way government can pay these workers is by taxing others who generate real wealth. By doing this, the government weakens the wealth-generating process and undermines real economic growth. (We ignore here borrowings from overseas).</p>\n<p><a href=\"https://cdn.mises.org/Human%20Action_3.pdf\">According to</a> Ludwig von Mises:</p>\n<p style=\"margin-left:.5in;\">There is need to emphasize the truism that a government can spend or invest only what it takes away from its citizens and that its additional spending and investment curtails the citizens’ spending and investment to the full extent of its quantity.</p>\n<p>The fiscal and monetary stimulus appears to “work” if the flow of real savings is large enough to support—i.e., fund—government sponsored activities while still permitting an increase in the activities of real wealth generators. However, if the flow of real savings is decreasing, then overall real economic activity will follow suit. The more government spends and the more the central bank pumps new money into the economy, the more will be taken from wealth generators, thereby <a href=\"https://cdn.mises.org/Human%20Action_3.pdf\">undermining prospects</a> for real economic growth.</p>\n<p>When loose monetary and fiscal policies divert bread from the baker, he will have less bread at his disposal, all other things being equal. Consequently, the baker will not be able to secure the services of the oven maker. As a result, it will not be possible to boost the production of bread.</p>\n<p>As the pace of loose monetary policies intensifies, the baker will not have enough bread left to even sustain the workability of the existing oven. (The baker will not have enough bread to pay for the services of a technician to maintain the existing oven in a good shape). Consequently, the production of bread will actually decline.</p>\n<p>Similarly, other wealth generators, because of the increase in government outlays and monetary pumping, will have less real savings at their disposal. This, in turn, hampers the production of their goods and services and slows overall real economic growth.<img border=\"0\" height=\"1\" src=\"file:///C:/Users/danie/AppData/Local/Temp/msohtmlclip1/01/clip_image001.gif\" width=\"1\" /></p>\n<h4>Why Economic Cleansing Promotes Economic Growth</h4>\n<p>The conventional thinking presents economic adjustment—also labeled as “economic recession”—as something that must be avoided. In fact, economic adjustment is nothing more than the reallocation of scarce resources in accordance with consumers’ priorities. Allowing the market to do the allocation always leads to better results. Even the founder of the Soviet Union, Vladimir Lenin, understood this when he introduced the market mechanism for a brief period in March 1921 to restore the supply of goods and prevent economic catastrophe. Yet most experts these days cling to the view that the market cannot be trusted in difficult times.</p>\n<p>Economic problems are better fixed by allowing entrepreneurs the freedom to allocate resources in accordance with individuals’ priorities. Thus, the best stimulus plan is to allow the market mechanism to operate freely, as permitting the market to operate freely results in some economic activities disappearing while some other activities will be expanded.</p>\n<p>Loose fiscal and monetary policies do not rescue the economy, but, instead, rescue activities that are generating products that are on the low priority list of consumers. Policies based on loose money creation and spending sustain waste and promote inefficiency, draining resources from activities that generate wealth.</p>\n<h4>Why Doing Nothing Is the Best Policy to Revive the Economy</h4>\n<p>Decades of reckless monetary and fiscal policies have severely damaged the process of real wealth generation. More loose policies cannot make the current situation better. On the contrary, such policies only further delay the economic recovery.</p>\n<p>The best economic policy is for the Fed and the government to immediately stop their economic interventions. By doing nothing the Fed and the government will enable wealth generators to accumulate real savings. (The policy of doing nothing will force various activities that add nothing to the pool of real savings disappear. This will make the life of wealth generators much easier).</p>\n<p>Over time, the expanding pool of real savings will set a platform for the further expansion of various wealth generating activities. So the sooner the Fed and the government remove themselves from the economy, the sooner a genuine economic recovery is going to emerge.</p>\n<h4>Conclusion</h4>\n<p>Contrary to pundits, neither the Fed nor the government’s loose monetary and fiscal policies can cause an expansion in the pool of real savings. On the contrary, loose policies only weaken the process of real savings formation thereby weakening prospects for a sustained economic expansion.</p>\n<p>If loose monetary and fiscal policies could set in motion economic growth, then by now all the poverty in the world would have been eradicated. The only reason why in the past loose monetary and fiscal policies appeared to have been effective is because the pool of real savings was expanding.</p>\n<p>Once this pool becomes stagnant, declining the illusion of the effectiveness of these policies is shattered. The more aggressive the fiscal and monetary policies stance is the worse the economic conditions become. If the pool of real savings is still intact, then there is no need for the Keynesian policies to revive the economy—the pool will do it. If the pool is in trouble, the Keynesian policies will only make things much worse could cause a prolonged economic depression. Hence the best policy is to do nothing.</p>\n\n",
  "author": "Frank Shostak",
  "enclosure": "",
  "guid": 60660,
  "pubDate": "Mon, 31 Oct 2022 06:00:00 -0500",
  "source": "Mises Wire"
}