{
  "title": "Efficient Testing of Multiport EW Receivers",
  "link": "https://engineeringresources.spectrum.ieee.org/free/w_rohd42/prgm.cgi",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/efficient-testing-of-multiport-ew-receivers.gif?id=29765722&width=1245&height=700&coordinates=63%2C0%2C63%2C0\"/><br/><br/><p>Modern multiport RWRs require modern T&M solutions! Are you interested in generating realistic test signals – in the lab? This webinar can help!</p> <p><strong>Speakers</strong>:</p> <p><strong>Leander Humbert</strong>, <em>Market Segment Manager ADT, Rohde & Schwarz</em></p> <ul> <li>Leander Humbert is a radar technology manager at Rohde & Schwarz. He completed his master's degree in electrical engineering in 2004 at the Helmut Schmidt University in Hamburg. Between 2004 and 2011, he worked as a system engineer for electronic warfare systems at the German Air Force. From 2012 to 2016, he was a technical counselor for missile and air defense related sensor systems at IABG. At Rohde & Schwarz, he deals with all test and measurement aspects and requirements of current and future radar sensors.</li> </ul> <p><strong>Robert Vielhuber</strong>, <em>Senior Product Manager for RF Signal Generators, Rohde & Schwarz</em></p> <ul> <li>Robert Vielhuber covers products for Aerospace & Defense and Automotive applications. He is responsible for the global technical and commercial success of the Rohde & Schwarz radar signal simulation solutions. Robert is a senior specialist in Product Management and Marketing with more than two decades of experience in product management and marketing of electronic high-tech investment goods. He has significant broad experience also due to his earlier experience, where he was responsible for Strategic and Operational Marketing for the Broadcasting products at Rohde & Schwarz. He holds a degree in communication engineering from the University of Applied Sciences in Munich.</li> </ul> <p><strong>Florian Gerbl</strong>, <em>Application Engineer, Rohde & Schwarz</em></p> <ul> <li>Florian Gerbl is an application engineer with Rohde & Schwarz and has a focus on signal generators.</li> </ul>",
  "pubDate": "Thu, 05 May 2022 19:00:01 +0000",
  "guid": "https://engineeringresources.spectrum.ieee.org/free/w_rohd42/prgm.cgi",
  "category": "Type:webinar",
  "dc:creator": "Rohde & Schwarz",
  "media:content": ""
}