{
  "title": "Data Science Learning Club",
  "link": "https://www.becomingadatascientist.com/2015/12/13/data-science-learning-club/",
  "pubDate": "Mon, 14 Dec 2015 02:25:57 +0000",
  "dc:creator": "Renee",
  "category": [
    "learning club",
    "Podcast",
    "resources",
    "thoughts/goals"
  ],
  "guid": "https://www.becomingadatascientist.com/?p=766",
  "description": "I'm working on the last of my recording and editing for \"Episode 0\" of the new Becoming A Data Scientist Podcast, which I'm planning to launch tomorrow! I've already recorded the interviews for episodes 1-3, which will be airing over the next month or so - so exciting! The guests all had interesting and informative things to share, I believe you'll like it a lot.\n\nAt the end of each podcast episode, I'll be \"assigning\" a \"Learning Activity\" for the Data Science Learning Club. ",
  "content:encoded": "<p>I&#8217;m working on the last of my recording and editing for &#8220;Episode 0&#8221; of the new Becoming A Data Scientist Podcast, which I&#8217;m planning to launch tomorrow! I&#8217;ve already recorded the interviews for episodes 1-3, which will be airing over the next month or so &#8211; so exciting! The guests all had interesting and informative things to share, I believe you&#8217;ll like it a lot.</p>\n<p>At the end of each podcast episode, I&#8217;ll be &#8220;assigning&#8221; a &#8220;Learning Activity&#8221; for the Data Science Learning Club. So that is starting tomorrow, too! There won&#8217;t be anyone teaching the content, but we&#8217;ll be exploring it together for 1-2 weeks between podcast episodes (usually 2 weeks). I&#8217;ll post some resources to get everyone started and help out data science beginners, then we&#8217;ll each explore the activity on our own with whatever tools and techniques we choose, and we can post our results so we can all learn from one another. If anyone gets stuck, you can post a question to the forum and hopefully someone will be able to help you through it.</p>\n<p>I just got the Data Science Learning Club forum set up today, and it&#8217;s at this URL: <a href=\"https://www.becomingadatascientist.com/learningclub\" target=\"_blank\">https://www.becomingadatascientist.com/learningclub</a></p>\n<p>Go check it out, register so you can participate, read the <a href=\"https://www.becomingadatascientist.com/learningclub/forum-7.html\" target=\"_blank\">Welcome thread</a>, and introduce yourself in the <a href=\"https://www.becomingadatascientist.com/learningclub/forum-4.html\" target=\"_blank\">Meet &#038; Greet section</a>! Then tomorrow, the first learning activity will launch and you can get started. </p>\n<p>I&#8217;m so excited about launching this podcast and data science learning club, and hope this turns out to be a valuable experience for all of us! Keep an eye out on the blog for the podcast post, which should go up tomorrow!</p>\n<p>Renee</p>\n"
}