{
  "title": "Do A Dead Husband And Wife Haunt This Home? | Best of RGSO",
  "link": "https://audioboom.com/posts/8080497",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1977,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Did the spirit of a deceased couple continue to haunt their home long after they were gone?<br>\n<br>\n\n</div>\n<div>\n<br>\nHere is a preview of the story.<br>\n“In the late 90's I was living in Virginia and working in Washington, D.C. and Layla was living in Wyoming and working for a popular museum and historical center. As part of her salary, she was allowed to live rent free in a small room in the basement of a large ranch-style home that had been owned by the founder of the museum and is used as a sort of hotel for celebrities and VIP guests that come to town for various museum functions. The mansion had its own housekeeping and gardening staff that would come a few times a week, but Layla mostly had the place to herself. Her only responsibilities were to set up coffee and put out a continental breakfast on the mornings that guests were present. She also was on hand to answer questions and to act as sort of a live-in security person. Now when she first moved in Layla had been warned that the museum founders and former owners of the house (a married couple) had died back in the 1970's but the man was still around haunting the place. She was told that he was friendly and just liked to get up to mischief and play pranks occasionally.”<br>\n<br>\n\n</div>\n<div>To hear more real ghost stories, become a supporter of our show and get every episode, including our weekly bonus episodes at <a href=\"http://www.ghostpodcast.com\">http://www.ghostpodcast.com</a> or <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>Follow Tony:<br>\nInstagram: <a href=\"http://HTTP://www.instagram.com/tonybrueski\">HTTP://www.instagram.com/tonybrueski</a><br>\nTikToc: <a href=\"https://www.tiktok.com/@tonybrueski\">https://www.tiktok.com/@tonybrueski</a><br>\nFacebook: <a href=\"https://www.facebook.com/tony.brueski\">https://www.facebook.com/tony.brueski</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Sat, 21 May 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-05-09:/posts/8080497",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}