{
  "title": "The Edition: Superbad",
  "link": "https://audioboom.com/posts/7974030",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2441,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: Has the Biden Presidency stalled or crashed?<br>\n<br>\n\n</div>\n<div>In our cover story this week, Freddy Gray assesses the state of the Biden presidency. With steadily lowering approval ratings, a disastrous Afghanistan withdrawal, and this week’s failure of the Democrats to hold on to the Virginia Governorship, how much trouble is the US’s oldest inaugurated president in? Freddy talks to Lara along with Emily Tamkin, the US editor of the New Statesman and co-host of the World Review Podcast. </div>\n<div>(00:49)</div>\n<div><br>\n</div>\n<div>Also this week: Should we welcome or fear the Metaverse?<br>\n<br>\n\n</div>\n<div>Kit Wilson writes in The Spectator this week about Facebook’s new venture into the Metaverse, a concept that most of us probably hadn’t heard of until last week. To layout the roadmap for what our journey into this new digital reality might look like, Kit joins the podcast along with Tom Renner, a software engineer for NavVis.</div>\n<div>(12:55)</div>\n<div>   </div>\n<div>And finally: Is the idea of ‘buy now pay later’ financially precarious for young people?<br>\n<br>\n\n</div>\n<div>Gus Carter has been exploring the new Swedish-born app that is blowing up with the youth: Klarna. On its face, it seems to just be a modern replacement for a credit card with some gifts thrown in, but could this ‘buy now pay later’ model have some unexpected consequences for its users? Gus talks about his findings along with the author of the blog Young Money Iona Bain. </div>\n<div>(27:33)</div>\n<div>\n<br>\n<br>\n\n</div>\n<div>Hosted by Lara Prendergast</div>\n<div> <br>\nProduced by Sam Holmes</div>\n<div><br>\n</div>\n<div><br>\n</div>\n<div>Subscribe to The Spectator today and get a £20 Amazon gift voucher:</div>\n<div>\n<a href=\"http://www.spectator.co.uk/voucher\">www.spectator.co.uk/voucher</a> </div>\n<div><br>\n</div>\n<div>Listen to Lara’s food-based interview show, Table Talk:</div>\n<div>\n<a href=\"https://www.spectator.co.uk/tabletalk\">https://www.spectator.co.uk/tabletalk</a> </div>\n",
  "pubDate": "Thu, 04 Nov 2021 18:23:52 +0000",
  "guid": "tag:audioboom.com,2021-11-04:/posts/7974030",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}