{
  "title": "Political Capitalism with Randall Holcombe",
  "pubDate": "Fri, 28 Jun 2019 18:08:04 +0000",
  "guid": "e11b50a00f954541ad81d1bf6da9253f",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP124Holcombe_EDR.mp3",
  "itunes:image": "",
  "description": "<div style=\"float: right; padding-left: 10px;\"><a href= \"https://www.amazon.com/Political-Capitalism-Maintained-Cambridge-Economics/dp/1108471773/ref=as_li_ss_il?ie=UTF8&linkCode=li3&tag=economicsde0f-20&linkId=abbef70b728f0d350bc31a77954bb0c8&language=en_US\" target=\"_blank\" rel=\"noopener\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1108471773&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20&language=en_US\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&language=en_US&l=li3&o=1&a=1108471773\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p>Today's guest is <a href=\"http://randallholcombe.com/\" target= \"_blank\" rel=\"noopener\">Randall Holcombe</a> of Florida State University. Our discussion today focuses on his book, <a href= \"https://amzn.to/2XvaXj5\" target=\"_blank\" rel=\"noopener\">Political Capitalism: How Economic and Political Power Is Made and Maintained</a>.</p> <blockquote>Problems associated with cronyism, corporatism, and policies that favor the elite over the masses have received increasing attention in recent years. Political Capitalism explains that what people often view as the result of corruption and unethical behavior are symptoms of a distinct system of political economy. The symptoms of political capitalism are often viewed as the result of government intervention in a market economy, or as attributes of a capitalist economy itself. Randall G. Holcombe combines well-established theories in economics and the social sciences to show that political capitalism is not a mixed economy, or government intervention in a market economy, or some intermediate step between capitalism and socialism. After developing the economic theory of political capitalism, Holcombe goes on to explain how changes in political ideology have facilitated the growth of political capitalism, and what can be done to redirect public policy back toward the public interest.</blockquote> <hr />",
  "content:encoded": "<a href= \"https://www.amazon.com/Political-Capitalism-Maintained-Cambridge-Economics/dp/1108471773/ref=as_li_ss_il?ie=UTF8&linkCode=li3&tag=economicsde0f-20&linkId=abbef70b728f0d350bc31a77954bb0c8&language=en_US\" target=\"_blank\" rel=\"noopener\"></a> <p>Today's guest is <a href=\"http://randallholcombe.com/\" target= \"_blank\" rel=\"noopener\">Randall Holcombe</a> of Florida State University. Our discussion today focuses on his book, <a href= \"https://amzn.to/2XvaXj5\" target=\"_blank\" rel=\"noopener\">Political Capitalism: How Economic and Political Power Is Made and Maintained</a>.</p> Problems associated with cronyism, corporatism, and policies that favor the elite over the masses have received increasing attention in recent years. Political Capitalism explains that what people often view as the result of corruption and unethical behavior are symptoms of a distinct system of political economy. The symptoms of political capitalism are often viewed as the result of government intervention in a market economy, or as attributes of a capitalist economy itself. Randall G. Holcombe combines well-established theories in economics and the social sciences to show that political capitalism is not a mixed economy, or government intervention in a market economy, or some intermediate step between capitalism and socialism. After developing the economic theory of political capitalism, Holcombe goes on to explain how changes in political ideology have facilitated the growth of political capitalism, and what can be done to redirect public policy back toward the public interest. ",
  "enclosure": "",
  "itunes:duration": "48:37",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's guest is  of Florida State University. Our discussion today focuses on his book, . Problems associated with cronyism, corporatism, and policies that favor the elite over the masses have received increasing attention in recent years. Political...",
  "itunes:episode": 124,
  "itunes:episodeType": "full"
}