{
  "title": "138: Killing Versace: The Hunt for A Serial Killer",
  "link": "https://audioboom.com/posts/7619595",
  "itunes:episode": 138,
  "itunes:title": "Killing Versace: The Hunt for A Serial Killer",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2905,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>A little after 8:45 am on the morning of July, 15, 1997, famed fashion designer Gianni Versace was shot execution-style on the front steps of his Miami Beach mansion. The assassin was 28 year old Andrew Cunanan--a hanger on who claimed to have met Versace in San Franciscio a few years before (though nobody knows if this is true.). When Cunanan flees the scene of the murder, a week long manhunt ensues as authorities come to realize that Cunanan had murdered four other men in his cross country journey to assassinate Versace.  <br>\n<br>\n<a href=\"https://www.disappearedpod.com/\">FAM! WE LAUNCHED A NEW PODCAST</a>! <strong>\"Obsessed With: Disappeared.\"</strong> It's a true crime / comedy podcast hosted by Patrick Hinds and Ellyn Marsh--best friends of 20 years. Going in order, Patrick and Ellyn recap episodes of ID's \"Disappeared.\"  Episodes are live now! Be sure to check out our episode covering <a href=\"https://www.disappearedpod.com/episodes/episode/50959f8d/6-the-disappearance-of-maura-murray-s1-e6\">the disappearance of Maura Murray</a> <a href=\"https://www.disappearedpod.com/episodes/episode/50a1423d/an-interview-with-julie-murray-maura-murrays-sister\"><strong>AND PATRICK'S IN-DEPTH INTERVIEW WITH MAURA'S SISTER, JULIE MURRAY!</strong></a><strong><br>\n<br>\nLOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions</div>\n",
  "pubDate": "Tue, 30 Jun 2020 10:02:00 +0000",
  "guid": "tag:audioboom.com,2020-06-30:/posts/7619595",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}