{
  "title": "Episode 71: &#8220;Willie and the Hand Jive&#8221; by Johnny Otis",
  "link": "https://500songs.com/podcast/episode-71-willie-and-the-hand-jive-by-johnny-otis/",
  "pubDate": "Mon, 24 Feb 2020 16:57:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=512",
  "description": "Episode seventy-one of <em>A History of Rock Music in 500 Songs</em> continues our look at British music TV by looking at the first time it affected American R&B, and is also our final look at Johnny Otis.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/34278300\">on \"Short Shorts\" by the Royal Teens</a>, a group whose members went on to be far more important than one might expect.\n\nAlso, this is the first of hopefully many podcasts to come where Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-71-willie-and-the-hand-jive-by-johnny-otis/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nMuch of the information on Otis comes from <a href=\"https://amzn.to/3954r4M\"><em>Midnight at the Barrelhouse: The Johnny Otis Story</em></a> by George Lipsitz.\n\nI've also referred extensively to two books by Otis himself, <a href=\"https://amzn.to/38SvSyZ\"><em>Listen to the Lambs</em></a>, and <a href=\"https://amzn.to/3bYGgXH\"><em>Upside Your Head! Rhythm and Blues on Central Avenue</em></a>.\n\nI've used two main books on the British side of things:\n\n<a href=\"https://amzn.to/2lqg8PS\">Pete Frame's The Restless Generation</a> is the best book available looking at British 50s rock and roll from a historical perspective. Be warned, though -- his jokey and irreverent style can, when dealing with people like Larry Parnes (who was gay and Jewish) very occasionally tip over into reinforcing homophobic and anti-semitic stereotypes for an easy laugh.\n\n<a href=\"https://amzn.to/2lqpk6S\">Billy Bragg's Roots, Radicals, and Rockers: How Skiffle Changed the World</a> is one of the best books I've read on music at all, and talks about the problems between the musicians' unions.\n\n<a href=\"https://amzn.to/32ncZS1\">This three-CD set</a> provides a great overview of Otis' forties and fifties work, both as himself and with other artists. Many of the titles will be very familiar to listeners of this podcast.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nAnd so we come to our last look at Johnny Otis, one of those people who has been turning up throughout the early episodes of the podcast. Indeed, he may continue to appear intermittently until at least the late sixties, as an influence and occasional collaborator. But the days of his influence on rock and roll music more or less came to an end with the rise of the rockabillies in the mid fifties, and from this point on he was not really involved in the mainstream of rock and roll.\n\nBut in one of those curious events that happens sometimes, just as Otis was coming to the end of the run of hits he produced or arranged or performed on for other people, and the run of discoveries that changed music, he had a rock and roll hit under his own name for the first and only time. And that hit was because of the Six-Five Special, the British TV show we talked about last week:\n\n[Excerpt: Johnny Otis, \"Willie and the Hand Jive\"]\n\nThe way this podcast works, telling stories chronologically and introducing new artists as they come along, can sometimes make it seem like the music business in the fifties was in a constant state of revolution, with a new year zero coming up every year or two. \"First-wave rockabilly is *so* January through August 1956, we're into late 1958 and everything's prototype soul now, granddad!\"\n\nBut of course the majority of the podcast so far has looked at a very small chunk of time, concentrating on the mid 1950s, and plenty of people who were making hits in 1955 were still having very active careers as of 1958, and that's definitely the case for Johnny Otis.\n\nWhile he didn't have that many big hits after rockabilly took over from R&B as the predominant form of rock and roll music, he was still making important records. For example, in 1957 he produced and co-wrote \"Lonely, Lonely Nights\" for Little Julian Herrera and the Tigers, which became a local hit, and which he thought at the time was the first big record to feature a Chicano singer.\n\nWe're going to talk about the Chicano identity in future episodes of the show, but Chicano (or Chicana or Chicanx) is a term that is usually used for Americans of Mexican origin. It can be both an ethnic and a cultural identifier, and it has also been used in the past as a racial slur. It's still seen as that by some people, but it's also the chosen identifier for a lot of people who reject other labels like Hispanic or Latino. To the best of my knowledge, it's a word that is considered acceptable and correct for white people to use when talking about people who identify that way -- which, to be clear, not all Americans of Mexican descent do, by any means -- but I'm very happy to have feedback about this from people who are affected by the word.\n\nAnd Little Julian Herrera did identify that way, and he became a hero among the Chicano population in LA when \"Lonely Lonely Nights\" came out on Dig Records, a label Otis owned:\n\n[Excerpt: Little Julian Herrera and the Tigers, \"Lonely, Lonely Nights\"]\n\nBut it turned out shortly afterwards that Herrera wasn't exactly what he seemed. Police came to Otis' door, and told him that the person he knew as Julian Herrera was wanted on charges of rape. And not only that, his birth name was Ron Gregory, and he was of Jewish ethnicity, and from a Hungarian-American family from Massachusetts. Apparently at some point he had run away from home and travelled to LA, where he had been taken in by a Mexican-American woman who had raised him as if he were her own son.\n\nThat was pretty much the end of Little Julian Herrera's career -- and indeed shortly after that, Dig Records itself closed down, and Otis had no record contract.\n\nBut then fate intervened, in the form of Mickey Katz. Mickey Katz was a comedian, who is now probably best known for his famous family -- his son is Joel Grey, the star of Cabaret, while his granddaughter, Jennifer Grey, starred in Dirty Dancing and Ferris Bueller's Day Off.\n\nKatz's comedy consisted of him performing parodies of currently-popular songs, giving them new lyrics referencing Jewish culture. A typical example is his version of \"Sixteen Tons\", making it about working at a deli instead of down a mine:\n\n[Excerpt: Mickey Katz, \"Sixteen Tons\"]\n\nEven though Katz's music was about as far from Otis' as one can imagine, Katz had been a serious musician before he went into comedy, and when he went to see Otis perform live, he recognised his talent as a bandleader, and called his record label, urging them to sign him.\n\nKatz was on Capitol, one of the biggest labels in the country, and so for the first time in many years, Otis had guaranteed major-label distribution for his records.\n\nIn October 1957, Capitol took the unusual step of releasing four Johnny Otis singles at the same time, each of them featuring a different vocalist from his large stable of performers. None did especially well on the American charts at the time, but one, featuring Marie Adams and the Three Tons of Joy, would have a major impact on Otis' career.\n\nMarie Adams was someone who had been on the R&B scene for many years, and had been working with Otis in his show since 1953. She'd been born Ollie Marie Givens, but dropped the Ollie early on.\n\nShe was a shy woman, who had to be pushed by her husband to audition for Don Robey at Peacock Records. Robey had challenged her to sing along with Dinah Washington's record \"Harbor Lights\":\n\n[Excerpt: Dinah Washington, \"Harbor Lights\"]\n\nWhen she'd proved she could sing that, Robey signed her, hoping that he'd have a second Big Mama Thornton on his hands. And her first single seemed to confirm him in that hope -- \"I'm Gonna Play the Honky Tonks\" went to number three on the R&B chart and became one of the biggest hit records Peacock had ever released:\n\n[Excerpt: Marie Adams, \"I'm Gonna Play the Honky Tonks\"]\n\nBut her later career with Peacock was less successful. The follow-up was a version of Johnny Ace's \"My Song\", which seems to have been chosen more because Don Robey owned the publishing than because the song and arrangement were a good fit for her voice, and it didn't do anything much commercially:\n\n[Excerpt: Marie Adams, \"My Song\"\n\nLike many of Peacock's artists who weren't selling wonderfully she was handed over to Johnny Otis to produce, in the hopes that he could get her making hits. Sadly, he couldn't, and her final record for Peacock came in 1955, when Otis produced her on one of many records recorded to cash in on Johnny Ace's death, \"In Memory\":\n\n[Excerpt: Marie Adams, \"In Memory\"]\n\nBut that did so poorly that it's never had an official rerelease, not even on a digital compilation I have which has half a dozen other tributes to Ace on it by people like Vanetta Dillard and Linda Hayes.\n\nAdams was dropped by her record label, but she was impressive enough as a vocalist that Otis -- who always had an ear for great singing -- kept her in his band, as the lead singer of a vocal trio, the Three Tons of Joy, who were so called because they were all extremely fat.\n\n(I say this not as a criticism of them. I'm fat myself and absolutely fat-positive. Fat isn't a term of abuse in my book).\n\nThere seems to be some debate about the identity of the other two in the Three Tons of Joy. I've seen reliable sources refer to them as two sisters, Sadie and Francine McKinley, and as *Adams'* two sisters, Doris and Francine, and have no way of determining which of these is correct. The three of them would do synchronised dancing, even when they weren't singing, and they remained with Otis' show until 1960.\n\nAnd so when Capitol came to release its first batch of Johnny Otis records, one of them had vocals by Marie Adams and the Three Tons of Joy.\n\nThe song in question was \"Ma! He's Making Eyes At Me\", a vaudeville song which dated back to 1921, and had originally sounded like this:\n\n[Excerpt: Billy Jones, \"Ma! She's Making Eyes at Me\"]\n\nIn the hands of the Otis band and the Three Tons of Joy, it was transformed into something that owed more to Ruth Brown (especially with Marie Adams' pronunciation of \"mama\") than to any of the other performers who had recorded versions of the song over the decades:\n\n[Excerpt: Johnny Otis and his Orchestra with Marie Adams and the Three Tons of Joy: \"Ma, He's Making Eyes At Me\"]\n\nIn the US, that did nothing at all on the charts, but for some reason it took off massively in the UK, and went to number two on the pop charts over here. It was so successful, in fact, that there were plans for a Johnny Otis Show tour of the UK in 1958.\n\nThose plans failed, because of something I've not mentioned in this podcast before, but which radically shaped British music culture, and to a lesser extent American music culture, for decades.\n\nBoth the American Federation of Musicians and their British equivalent, the Musicians' Union, had since the early 1930s had a mutual protectionist agreement which prevented musicians from one of the countries playing in the other. After the Duke Ellington band toured the UK in 1933, the ban came into place on both sides.\n\nCertain individual non-instrumental performers from one country could perform in the other, but only if they employed musicians from the other country. So for example Glenn Miller got his first experience of putting together a big band because Ray Noble, a British bandleader, had had hits in the US in the mid thirties. Noble and his vocalist Al Bowlly were allowed to travel to the US, but Noble's band wasn't, and so he had to get an American musician, Miller, to put together a new band.\n\nSimilarly, when Johnnie Ray had toured the UK in the early fifties, he'd had to employ British musicians, and when Lonnie Donegan had toured the US on the back of \"Rock Island Line\"'s success, he was backed by Johnny Burnette and the Rock and Roll Trio -- Donegan was allowed to sing, but not allowed to play guitar.\n\nIn 1955, the two unions finally came to a one-in-one-out agreement, which would last for the next few decades, where musicians from each country could tour, but only as a like-for-like swap. So Louis Armstrong was allowed to tour the UK, but only on condition that Freddie Randall, a trumpet player from Devon, got to tour the US. Stan Kenton's band toured the UK, while the Ted Heath Orchestra (which was not, I should point out, led by the Prime Minister of the same name) toured the US.\n\nWe can argue over whether Freddie Randall was truly an adequate substitute for Louis Armstrong, but I'm sure you can see the basic idea. The union was making sure that Armstrong wasn't taking a job that would otherwise have gone to a British trumpeter. Similarly, when Bill Haley and the Comets became the first American rock and roll group to tour the UK, in 1957, Lonnie Donegan was allowed to tour the US again, and this time he could play his guitar.\n\nThe Three Tons of Joy went over to the UK to appear on the Six-Five Special, backed by British musicians and to scout out some possible tour venues with Otis' manager, but the plans fell through because of the inability to find a British group who could reasonably do a swap with Otis' band.\n\nThey came back to the US, and cut a follow-up to \"Ma, He's Making Eyes at Me\", with vocals by Marie and Johnny Otis:\n\n[Excerpt: Johnny Otis and Marie Adams, \"Bye Bye Baby\"]\n\nThat's an example of what Johnny Otis meant when he said later that he didn't like most of his Capitol recordings, because he was being pushed too far in a commercial rock and roll direction, while he saw himself as far closer in spirit to Count Basie, Lionel Hampton, or Louis Jordan than to Elvis Presley or Buddy Holly. The song is just an endless litany of the titles of recentish rock and roll hits, with little to recommend it.\n\nIt made the top twenty in the UK, mostly on the strength of people having bought the previous single. The record after that was an attempt to capitalise on \"Ma! He's Making Eyes At Me\" -- it was another oldie, this time from 1916, and another song about making eyes at someone. Surely it would give them another UK hit, right?:\n\n[Excerpt: Marie Adams, \"What Do You Want To Make Those Eyes At Me For?\"]\n\nSadly, it sank without a trace -- at least until it was picked up by Emile Ford and the Checkmates, who released a soundalike cover version, which became the last British number one of the fifties and first of the sixties, and was also the first number one hit by a black British artist and the first record by a black British person to sell a million copies:\n\n[Excerpt: Emile Ford and the Checkmates, \"What Do You Want To Make Those Eyes At Me For?\"]\n\nWe'll be hearing more from Ford's co-producer on that record, a young engineer named Joe Meek, later in the series.\n\nBut Otis had another idea for how to crack the British market.\n\nWhile the Three Tons of Joy had been performing on Six-Five Special, they had seen the British audiences doing a weird dance that only used their arms. It was a dance that was originally popularised by a British group that was so obscure that they never made a record, and the only trace they left on posterity was this dance and three photos, all taken on the same night by, of all people, Ken Russell.\n\nFrom those photos, the Bell Cats were one of the many British bands trying to sound like Bill Haley and the Comets. Their regular gig was at a coffee house called The Cat's Whisker, where they were popular enough that the audience were packed in like sardines -- the venue was so often dangerously overcrowded that the police eventually shut it down, and the owner reopened it as the first Angus Steak House, an infamous London restaurant chain.\n\nIn those Bell Cats performances, the audience were packed so tightly that they couldn't dance properly, and so a new dance developed among the customers, and spread -- a dance where you only moved your hands. The hand jive.\n\nThat dance spread to the audiences of the Six-Five Special, so much that Don Lang and his Frantic Five released \"Six-Five Hand Jive\" in March 1958:\n\n[Excerpt: Don Lang and His Frantic Five, \"Six-Five Hand Jive\"]\n\nOddly, despite Six-Five Special not being shown in Sweden, that song saw no less than three Swedish soundalike cover versions, from (and I apologise if I mangle these names) Inger Bergrenn, Towa Carson, and the Monn-Keys.\n\nThe Three Tons of Joy demonstrated the hand jive to Otis, and he decided to write a song about the dance. There was a fad for dance songs in 1958, and he believed that writing a song about a dance that was popular in Britain, where he'd just had a big hit -- and namechecking those other dances, like the Walk and the Stroll -- could lead to a hit followup to \"Ma He's Making Eyes At Me\".\n\nThe dance also appealed to Otis because, oddly, it was very reminiscent of some of the moves that black American people would do when performing \"Hambone\", the folk dance-cum-song-cum-game that we discussed way back in episode thirty, and which inspired Bo Diddley's song \"Bo Didlley\".\n\nOtis coupled lyrics about hand-jiving to the Bo Diddley rhythm -- though he would always claim, for the rest of his life, that he'd heard that rhythm from convicts on a chain gang before Diddley ever made a record:\n\n[Excerpt: Johnny Otis, \"Willie and the Hand Jive\"]\n\nSurprisingly, the record did nothing at all commercially in the UK. In fact, its biggest impact over here was that it inspired another famous dance. Cliff Richard cut his own version of \"Willie and the Hand Jive\" in 1959:\n\n[Excerpt: Cliff Richard and the Shadows, \"Willie and the Hand Jive\"]\n\nHis backing band, the Shadows, were looking for a way to liven up the visual presentation of that song when they performed it live, and they decided that moving in unison would work well for the song, and worked out a few dance steps. The audience reaction was so great that they started doing it on every song. The famous -- or infamous -- Shadows Walk had developed.\n\nBut while \"Willie and the Hand Jive\" didn't have any success in the UK, in the US it became Otis' only top ten pop hit, and his first R&B top ten hit as a performer in six years, reaching number nine on the pop charts and number one on the R&B charts. This was despite several radio stations banning it, as they assumed the \"hand jive\" was a reference to masturbation -- even though on Otis' TV shows and his stage performances, the Three Tons of Joy would demonstrate the dance as Otis sang. As late as the nineties, Otis was still having to deal with questions about whether \"Willie and the Hand Jive\" had some more lascivious meaning.\n\nOf course, with him now being on a major label, he had to do follow-ups to his big hit, like \"Willie Did The Cha-Cha\":\n\n[Excerpt: Johnny Otis, \"Willie Did The Cha-Cha\"]\n\nBut chart success remained elusive, and nothing he did after this point got higher than number fifty-two on the pop charts. The music industry was slowly moving away from the kind of music that Otis had always made -- as genres got narrower, his appreciation for all forms of black American music meant that he no longer appealed to people who wanted one specific style of music.\n\nHe was also becoming increasingly involved in the civil rights movement, writing a weekly newspaper column decrying racism, helping his friend Mervyn Dymally who became the joint first black person elected to statewide office in the USA since the reconstruction, and working with Malcolm X and others. He had to deal with crosses burning on his lawn, and with death threats to his family -- while Otis was white, his wife was black.\n\nThe result was that Otis recorded and toured only infrequently during the sixties, and at one point was making so little as a musician that his wife became the main breadwinner of the family while he was a stay-at-home father.\n\nAfter the Watts riots in 1965, which we'll talk about much more when we get to that time period, Otis wrote the book Listen to the Lambs, a combination political essay, autobiography, and mixture of eyewitness accounts of the riots that made a radical case that the first priority for the black community in which he lived wasn't so much social integration, which he believed impossible in the short term due to white racism, as economic equality -- he thought it was in the best interests, not only of black people but of white people as well, if black people were made equal economic participants in America as rapidly as humanly possible, and if they should be given economic and political control over their own lives and destinies. The book is fierce in its anger at systemic racism, at colonialism, at anglocentric beauty standards that made black people hate their own bodies and faces, at police brutality, at the war in Vietnam, and at the systemic inequalities keeping black people down.\n\nAnd over and again he makes one point, and I'll quote from the book here: \"A newborn Negro baby has less chance of survival than a white. A Negro baby will have its life ended seven years sooner. This is not some biological phenomenon linked to skin colour, like sickle-cell anaemia; this is a national crime, linked to a white-supremacist way of life and compounded by indifference\". Just to remind you, the word he uses there was the correct word for black people at the time he was writing.\n\nSome of the book is heartrending, like the description from a witness -- Otis gives over thirty pages of the book to the voices of black witnesses of the riots -- talking about seeing white police officers casually shoot black teenagers on the street and make bullseye signals to their friends as if they'd been shooting tin cans. Some is, more than fifty years later, out of date or \"of its time\", but the sad thing is that so many of the arguments are as timely now as they were then. Otis wrote a follow-up, Upside Your Head, in the early nineties inspired by the LA riots that followed the Rodney King beating, and no doubt were he alive today he would be completing the trilogy.\n\nBut while politics had become Otis' main occupation, he hadn't stopped making music altogether, and in the late sixties he was contacted by Frank Zappa, who was such a fan of Otis that he copied his trademark beard from Otis. Otis and Zappa worked together in a casual way, with Otis mostly helping Zappa get in touch with musicians he knew who Zappa wanted to work with, like Don \"Sugarcane\" Harris. Otis also conducted the Mothers of Invention in the studio on a few songs while Zappa was in the control room, helping him get the greasy fifties sound he wanted on songs like \"Holiday in Berlin\":\n\n[Excerpt: The Mothers of Invention, \"Holiday in Berlin, Full Blown\"]\n\nApparently while they were recording that, Otis was clapping his hands in the face of the bass player, Roy Estrada, who didn't like it at all. Given what I know of Estrada that's a good thing.\n\nOtis' teenage son Shuggie also played with Zappa, playing bass on \"Son of Mr. Green Genes\" from Zappa's Hot Rats album. Zappa then persuaded a small blues label, Kent Records, which was owned by two other veterans of the fifties music industry, the Bihari brothers, to sign Otis to make an album. \"Cold Shot\" by the New Johnny Otis Show featured a core band of just three people -- Otis himself on piano and drums, Delmar \"Mighty Mouth\" Evans on vocals, and Shuggie playing all the guitar and bass parts. Shuggie was only fifteen at the time, but had been playing with his father's band since he was eleven, often wearing false moustaches and sunglasses to play in venues serving alcohol.\n\nThe record brought Otis his first R&B hit since \"Willie and the Hand Jive\", more than a decade earlier, \"Country Girl\":\n\n[Excerpt: The Johnny Otis Show, \"Country Girl\"]\n\nAround the same time, that trio also recorded another album, called \"For Adults Only\", under the name Snatch and the Poontangs, and with a cover drawn by Otis in a spot-on imitation of the style of Robert Crumb. For obvious reasons I won't be playing any of that record here, but even that had a serious sociological purpose along with the obscene humour -- Otis wanted to preserve bits of black folklore. Songs like \"The Signifying Monkey\" had been performed for years, and had even been recorded by people like Chuck Berry and Willie Dixon, but they'd always stripped out the sexual insults that make up much of the piece's appeal.\n\nOtis would in later years laugh that he'd received accusations of obscenity for \"Roll With Me Henry\" and for \"Willie and the Hand Jive\", but nobody had seemed bothered in the slightest by the records of Snatch and the Poontangs with their constant sexual insults.\n\n\"Cold Shot\" caused a career renaissance for Otis, and he put together a new lineup of the Johnny Otis Show, one that would feature as many as possible of the veteran musicians who he thought deserved exposure to a new audience. Probably the highest point of Otis' later career was a 1970 performance at the Monterey Jazz Festival, where his band featured, along with Johnny and Shuggie, Esther Phillips, Big Joe Turner, Eddie \"Cleanhead\" Vinson, Roy Milton, Pee Wee Crayton, Ivory Joe Hunter, and Roy Brown:\n\n[Excerpt: The Johnny Otis Show featuring Roy Brown, \"Good Rocking Tonight\"]\n\nThat performance was released as a live album, and Clint Eastwood featured footage of that show -- the band performing \"Willie and the Hand Jive\" -- in his classic film Play Misty For Me. It was probably the greatest example of Otis' belief that all the important strands of black American music shared a commonality and could work in combination with each other.\n\nFor the next few decades, Otis combined touring with as many of his old collaborators as possible -- Marie Adams, for example, rejoined the band in 1972 -- with having his own radio show in which he told people about black musical history and interviewed as many old musicians as he could, writing more books, including a cookbook and a collection of his art, running an organic apple juice company and food store, painting old blues artists in a style equally inspired by African art and Picasso, and being the pastor of a Pentecostal church -- but one with a theology so broadminded that it was not only LGBT-affirming but had Buddhist and Jewish congregants. He ran Blues Spectrum Records in the seventies, which put out late-career recordings by people like Charles Brown, Big Joe Turner, and Louis Jordan, some of them their last ever recordings. And he lectured in the history of black music at Berkeley.\n\nJohnny Otis died in 2012, aged ninety, having achieved more than most of us could hope to achieve if we lived five times that long, and having helped many, many more people to make the most of their talents. He died three days before the discovery of whom he was most proud, Etta James, and she overshadowed him in the obituaries, as he would have wanted.",
  "itunes:subtitle": "Episode seventy-one of A History of Rock Music in 500 Songs continues our look at British music TV by looking at the first time it affected American R&B, and is also our final look at Johnny Otis.\n\nPatreon backers also have a ten-minute bonus episode",
  "itunes:keywords": "Bo Diddley,British rock,Capitol Records,Cliff Richard,Dig Records,Don Robey,Frank Zappa,Joe Meek,Johnny Ace,Johnny Otis,Ken Russell,Lonnie Donegan,Malcolm X,Marie Adams and the Three Tons of Joy,Musicians Union,Peacock Records,racism,Roy Brown,Shuggie Otis,Six-Five Special,Snatch and the Poontangs,The Shadows,Watts riots",
  "itunes:episodeType": "full",
  "itunes:episode": 71,
  "content:encoded": "Episode seventy-one of <em>A History of Rock Music in 500 Songs</em> continues our look at British music TV by looking at the first time it affected American R&B, and is also our final look at Johnny Otis.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/34278300\">on \"Short Shorts\" by the Royal Teens</a>, a group whose members went on to be far more important than one might expect.\n\nAlso, this is the first of hopefully many podcasts to come where Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-71-willie-and-the-hand-jive-by-johnny-otis/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nMuch of the information on Otis comes from <a href=\"https://amzn.to/3954r4M\"><em>Midnight at the Barrelhouse: The Johnny Otis Story</em></a> by George Lipsitz.\n\nI've also referred extensively to two books by Otis himself, <a href=\"https://amzn.to/38SvSyZ\"><em>Listen to the Lambs</em></a>, and <a href=\"https://amzn.to/3bYGgXH\"><em>Upside Your Head! Rhythm and Blues on Central Avenue</em></a>.\n\nI've used two main books on the British side of things:\n\n<a href=\"https://amzn.to/2lqg8PS\">Pete Frame's The Restless Generation</a> is the best book available looking at British 50s rock and roll from a historical perspective. Be warned, though -- his jokey and irreverent style can, when dealing with people like Larry Parnes (who was gay and Jewish) very occasionally tip over into reinforcing homophobic and anti-semitic stereotypes for an easy laugh.\n\n<a href=\"https://amzn.to/2lqpk6S\">Billy Bragg's Roots, Radicals, and Rockers: How Skiffle Changed the World</a> is one of the best books I've read on music at all, and talks about the problems between the musicians' unions.\n\n<a href=\"https://amzn.to/32ncZS1\">This three-CD set</a> provides a great overview of Otis' forties and fifties work, both as himself and with other artists. Many of the titles will be very familiar to listeners of this podcast.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nAnd so we come to our last look at Johnny Otis, one of those people who has been turning up throughout the early episodes of the podcast. Indeed, he may continue to appear intermittently until at least the late sixties, as an influence and occasional collaborator. But the days of his influence on rock and roll music more or less came to an end with the rise of the rockabillies in the mid fifties, and from this point on he was not really involved in the mainstream of rock and roll.\n\nBut in one of those curious events that happens sometimes, just as Otis was coming to the end of the run of hits he produced or arranged or performed on for other people, and the run of discoveries that changed music, he had a rock and roll hit under his own name for the first and only time. And that hit was because of the Six-Five Special, the British TV show we talked about last week:\n\n[Excerpt: Johnny Otis, \"Willie and the Hand Jive\"]\n\nThe way this podcast works, telling stories chronologically and introducing new artists as they come along, can sometimes make it seem like the music business in the fifties was in a constant state of revolution, with a new year zero coming up every year or two. \"First-wave rockabilly is *so* January through August 1956, we're into late 1958 and everything's prototype soul now, granddad!\"\n\nBut of course the majority of the podcast so far has looked at a very small chunk of time, concentrating on the mid 1950s, and plenty of people who were making hits in 1955 were still having very active careers as of 1958, and that's definitely the case for Johnny Otis.\n\nWhile he didn't have that many big hits after rockabilly took over from R&B as the predominant form of rock and roll music, he was still making important records. For example, in 1957 he produced and co-wrote \"Lonely, Lonely Nights\" for Little Julian Herrera and the Tigers, which became a local hit, and which he thought at the time was the first big record to feature a Chicano singer.\n\nWe're going to talk about the Chicano identity in future episodes of the show, but Chicano (or Chicana or Chicanx) is a term that is usually used for Americans of Mexican origin. It can be both an ethnic and a cultural identifier, and it has also been used in the past as a racial slur. It's still seen as that by some people, but it's also the chosen identifier for a lot of people who reject other labels like Hispanic or Latino. To the best of my knowledge, it's a word that is considered acceptable and correct for white people to use when talking about people who identify that way -- which, to be clear, not all Americans of Mexican descent do, by any means -- but I'm very happy to have feedback about this from people who are affected by the word.\n\nAnd Little Julian Herrera did identify that way, and he became a hero among the Chicano population in LA when \"Lonely Lonely Nights\" came out on Dig Records, a label Otis owned:\n\n[Excerpt: Little Julian Herrera and the Tigers, \"Lonely, Lonely Nights\"]\n\nBut it turned out shortly afterwards that Herrera wasn't exactly what he seemed. Police came to Otis' door, and told him that the person he knew as Julian Herrera was wanted on charges of rape. And not only that, his birth name was Ron Gregory, and he was of Jewish ethnicity, and from a Hungarian-American family from Massachusetts. Apparently at some point he had run away from home and travelled to LA, where he had been taken in by a Mexican-American woman who had raised him as if he were her own son.\n\nThat was pretty much the end of Little Julian Herrera's career -- and indeed shortly after that, Dig Records itself closed down, and Otis had no record contract.\n\nBut then fate intervened, in the form of Mickey Katz. Mickey Katz was a comedian, who is now probably best known for his famous family -- his son is Joel Grey, the star of Cabaret, while his granddaughter, Jennifer Grey, starred in Dirty Dancing and Ferris Bueller's Day Off.\n\nKatz's comedy consisted of him performing parodies of currently-popular songs, giving them new lyrics referencing Jewish culture. A typical example is his version of \"Sixteen Tons\", making it about working at a deli instead of down a mine:\n\n[Excerpt: Mickey Katz, \"Sixteen Tons\"]\n\nEven though Katz's music was about as far from Otis' as one can imagine, Katz had been a serious musician before he went into comedy, and when he went to see Otis perform live, he recognised his talent as a bandleader, and called his record label, urging them to sign him.\n\nKatz was on Capitol, one of the biggest labels in the country, and so for the first time in many years, Otis had guaranteed major-label distribution for his records.\n\nIn October 1957, Capitol took the unusual step of releasing four Johnny Otis singles at the same time, each of them featuring a different vocalist from his large stable of performers. None did especially well on the American charts at the time, but one, featuring Marie Adams and the Three Tons of Joy, would have a major impact on Otis' career.\n\nMarie Adams was someone who had been on the R&B scene for many years, and had been working with Otis in his show since 1953. She'd been born Ollie Marie Givens, but dropped the Ollie early on.\n\nShe was a shy woman, who had to be pushed by her husband to audition for Don Robey at Peacock Records. Robey had challenged her to sing along with Dinah Washington's record \"Harbor Lights\":\n\n[Excerpt: Dinah Washington, \"Harbor Lights\"]\n\nWhen she'd proved she could sing that, Robey signed her, hoping that he'd have a second Big Mama Thornton on his hands. And her first single seemed to confirm him in that hope -- \"I'm Gonna Play the Honky Tonks\" went to number three on the R&B chart and became one of the biggest hit records Peacock had ever released:\n\n[Excerpt: Marie Adams, \"I'm Gonna Play the Honky Tonks\"]\n\nBut her later career with Peacock was less successful. The follow-up was a version of Johnny Ace's \"My Song\", which seems to have been chosen more because Don Robey owned the publishing than because the song and arrangement were a good fit for her voice, and it didn't do anything much commercially:\n\n[Excerpt: Marie Adams, \"My Song\"\n\nLike many of Peacock's artists who weren't selling wonderfully she was handed over to Johnny Otis to produce, in the hopes that he could get her making hits. Sadly, he couldn't, and her final record for Peacock came in 1955, when Otis produced her on one of many records recorded to cash in on Johnny Ace's death, \"In Memory\":\n\n[Excerpt: Marie Adams, \"In Memory\"]\n\nBut that did so poorly that it's never had an official rerelease, not even on a digital compilation I have which has half a dozen other tributes to Ace on it by people like Vanetta Dillard and Linda Hayes.\n\nAdams was dropped by her record label, but she was impressive enough as a vocalist that Otis -- who always had an ear for great singing -- kept her in his band, as the lead singer of a vocal trio, the Three Tons of Joy, who were so called because they were all extremely fat.\n\n(I say this not as a criticism of them. I'm fat myself and absolutely fat-positive. Fat isn't a term of abuse in my book).\n\nThere seems to be some debate about the identity of the other two in the Three Tons of Joy. I've seen reliable sources refer to them as two sisters, Sadie and Francine McKinley, and as *Adams'* two sisters, Doris and Francine, and have no way of determining which of these is correct. The three of them would do synchronised dancing, even when they weren't singing, and they remained with Otis' show until 1960.\n\nAnd so when Capitol came to release its first batch of Johnny Otis records, one of them had vocals by Marie Adams and the Three Tons of Joy.\n\nThe song in question was \"Ma! He's Making Eyes At Me\", a vaudeville song which dated back to 1921, and had originally sounded like this:\n\n[Excerpt: Billy Jones, \"Ma! She's Making Eyes at Me\"]\n\nIn the hands of the Otis band and the Three Tons of Joy, it was transformed into something that owed more to Ruth Brown (especially with Marie Adams' pronunciation of \"mama\") than to any of the other performers who had recorded versions of the song over the decades:\n\n[Excerpt: Johnny Otis and his Orchestra with Marie Adams and the Three Tons of Joy: \"Ma, He's Making Eyes At Me\"]\n\nIn the US, that did nothing at all on the charts, but for some reason it took off massively in the UK, and went to number two on the pop charts over here. It was so successful, in fact, that there were plans for a Johnny Otis Show tour of the UK in 1958.\n\nThose plans failed, because of something I've not mentioned in this podcast before, but which radically shaped British music culture, and to a lesser extent American music culture, for decades.\n\nBoth the American Federation of Musicians and their British equivalent, the Musicians' Union, had since the early 1930s had a mutual protectionist agreement which prevented musicians from one of the countries playing in the other. After the Duke Ellington band toured the UK in 1933, the ban came into place on both sides.\n\nCertain individual non-instrumental performers from one country could perform in the other, but only if they employed musicians from the other country. So for example Glenn Miller got his first experience of putting together a big band because Ray Noble, a British bandleader, had had hits in the US in the mid thirties. Noble and his vocalist Al Bowlly were allowed to travel to the US, but Noble's band wasn't, and so he had to get an American musician, Miller, to put together a new band.\n\nSimilarly, when Johnnie Ray had toured the UK in the early fifties, he'd had to employ British musicians, and when Lonnie Donegan had toured the US on the back of \"Rock Island Line\"'s success, he was backed by Johnny Burnette and the Rock and Roll Trio -- Donegan was allowed to sing, but not allowed to play guitar.\n\nIn 1955, the two unions finally came to a one-in-one-out agreement, which would last for the next few decades, where musicians from each country could tour, but only as a like-for-like swap. So Louis Armstrong was allowed to tour the UK, but only on condition that Freddie Randall, a trumpet player from Devon, got to tour the US. Stan Kenton's band toured the UK, while the Ted Heath Orchestra (which was not, I should point out, led by the Prime Minister of the same name) toured the US.\n\nWe can argue over whether Freddie Randall was truly an adequate substitute for Louis Armstrong, but I'm sure you can see the basic idea. The union was making sure that Armstrong wasn't taking a job that would otherwise have gone to a British trumpeter. Similarly, when Bill Haley and the Comets became the first American rock and roll group to tour the UK, in 1957, Lonnie Donegan was allowed to tour the US again, and this time he could play his guitar.\n\nThe Three Tons of Joy went over to the UK to appear on the Six-Five Special, backed by British musicians and to scout out some possible tour venues with Otis' manager, but the plans fell through because of the inability to find a British group who could reasonably do a swap with Otis' band.\n\nThey came back to the US, and cut a follow-up to \"Ma, He's Making Eyes at Me\", with vocals by Marie and Johnny Otis:\n\n[Excerpt: Johnny Otis and Marie Adams, \"Bye Bye Baby\"]\n\nThat's an example of what Johnny Otis meant when he said later that he didn't like most of his Capitol recordings, because he was being pushed too far in a commercial rock and roll direction, while he saw himself as far closer in spirit to Count Basie, Lionel Hampton, or Louis Jordan than to Elvis Presley or Buddy Holly. The song is just an endless litany of the titles of recentish rock and roll hits, with little to recommend it.\n\nIt made the top twenty in the UK, mostly on the strength of people having bought the previous single. The record after that was an attempt to capitalise on \"Ma! He's Making Eyes At Me\" -- it was another oldie, this time from 1916, and another song about making eyes at someone. Surely it would give them another UK hit, right?:\n\n[Excerpt: Marie Adams, \"What Do You Want To Make Those Eyes At Me For?\"]\n\nSadly, it sank without a trace -- at least until it was picked up by Emile Ford and the Checkmates, who released a soundalike cover version, which became the last British number one of the fifties and first of the sixties, and was also the first number one hit by a black British artist and the first record by a black British person to sell a million copies:\n\n[Excerpt: Emile Ford and the Checkmates, \"What Do You Want To Make Those Eyes At Me For?\"]\n\nWe'll be hearing more from Ford's co-producer on that record, a young engineer named Joe Meek, later in the series.\n\nBut Otis had another idea for how to crack the British market.\n\nWhile the Three Tons of Joy had been performing on Six-Five Special, they had seen the British audiences doing a weird dance that only used their arms. It was a dance that was originally popularised by a British group that was so obscure that they never made a record, and the only trace they left on posterity was this dance and three photos, all taken on the same night by, of all people, Ken Russell.\n\nFrom those photos, the Bell Cats were one of the many British bands trying to sound like Bill Haley and the Comets. Their regular gig was at a coffee house called The Cat's Whisker, where they were popular enough that the audience were packed in like sardines -- the venue was so often dangerously overcrowded that the police eventually shut it down, and the owner reopened it as the first Angus Steak House, an infamous London restaurant chain.\n\nIn those Bell Cats performances, the audience were packed so tightly that they couldn't dance properly, and so a new dance developed among the customers, and spread -- a dance where you only moved your hands. The hand jive.\n\nThat dance spread to the audiences of the Six-Five Special, so much that Don Lang and his Frantic Five released \"Six-Five Hand Jive\" in March 1958:\n\n[Excerpt: Don Lang and His Frantic Five, \"Six-Five Hand Jive\"]\n\nOddly, despite Six-Five Special not being shown in Sweden, that song saw no less than three Swedish soundalike cover versions, from (and I apologise if I mangle these names) Inger Bergrenn, Towa Carson, and the Monn-Keys.\n\nThe Three Tons of Joy demonstrated the hand jive to Otis, and he decided to write a song about the dance. There was a fad for dance songs in 1958, and he believed that writing a song about a dance that was popular in Britain, where he'd just had a big hit -- and namechecking those other dances, like the Walk and the Stroll -- could lead to a hit followup to \"Ma He's Making Eyes At Me\".\n\nThe dance also appealed to Otis because, oddly, it was very reminiscent of some of the moves that black American people would do when performing \"Hambone\", the folk dance-cum-song-cum-game that we discussed way back in episode thirty, and which inspired Bo Diddley's song \"Bo Didlley\".\n\nOtis coupled lyrics about hand-jiving to the Bo Diddley rhythm -- though he would always claim, for the rest of his life, that he'd heard that rhythm from convicts on a chain gang before Diddley ever made a record:\n\n[Excerpt: Johnny Otis, \"Willie and the Hand Jive\"]\n\nSurprisingly, the record did nothing at all commercially in the UK. In fact, its biggest impact over here was that it inspired another famous dance. Cliff Richard cut his own version of \"Willie and the Hand Jive\" in 1959:\n\n[Excerpt: Cliff Richard and the Shadows, \"Willie and the Hand Jive\"]\n\nHis backing band, the Shadows, were looking for a way to liven up the visual presentation of that song when they performed it live, and they decided that moving in unison would work well for the song, and worked out a few dance steps. The audience reaction was so great that they started doing it on every song. The famous -- or infamous -- Shadows Walk had developed.\n\nBut while \"Willie and the Hand Jive\" didn't have any success in the UK, in the US it became Otis' only top ten pop hit, and his first R&B top ten hit as a performer in six years, reaching number nine on the pop charts and number one on the R&B charts. This was despite several radio stations banning it, as they assumed the \"hand jive\" was a reference to masturbation -- even though on Otis' TV shows and his stage performances, the Three Tons of Joy would demonstrate the dance as Otis sang. As late as the nineties, Otis was still having to deal with questions about whether \"Willie and the Hand Jive\" had some more lascivious meaning.\n\nOf course, with him now being on a major label, he had to do follow-ups to his big hit, like \"Willie Did The Cha-Cha\":\n\n[Excerpt: Johnny Otis, \"Willie Did The Cha-Cha\"]\n\nBut chart success remained elusive, and nothing he did after this point got higher than number fifty-two on the pop charts. The music industry was slowly moving away from the kind of music that Otis had always made -- as genres got narrower, his appreciation for all forms of black American music meant that he no longer appealed to people who wanted one specific style of music.\n\nHe was also becoming increasingly involved in the civil rights movement, writing a weekly newspaper column decrying racism, helping his friend Mervyn Dymally who became the joint first black person elected to statewide office in the USA since the reconstruction, and working with Malcolm X and others. He had to deal with crosses burning on his lawn, and with death threats to his family -- while Otis was white, his wife was black.\n\nThe result was that Otis recorded and toured only infrequently during the sixties, and at one point was making so little as a musician that his wife became the main breadwinner of the family while he was a stay-at-home father.\n\nAfter the Watts riots in 1965, which we'll talk about much more when we get to that time period, Otis wrote the book Listen to the Lambs, a combination political essay, autobiography, and mixture of eyewitness accounts of the riots that made a radical case that the first priority for the black community in which he lived wasn't so much social integration, which he believed impossible in the short term due to white racism, as economic equality -- he thought it was in the best interests, not only of black people but of white people as well, if black people were made equal economic participants in America as rapidly as humanly possible, and if they should be given economic and political control over their own lives and destinies. The book is fierce in its anger at systemic racism, at colonialism, at anglocentric beauty standards that made black people hate their own bodies and faces, at police brutality, at the war in Vietnam, and at the systemic inequalities keeping black people down.\n\nAnd over and again he makes one point, and I'll quote from the book here: \"A newborn Negro baby has less chance of survival than a white. A Negro baby will have its life ended seven years sooner. This is not some biological phenomenon linked to skin colour, like sickle-cell anaemia; this is a national crime, linked to a white-supremacist way of life and compounded by indifference\". Just to remind you, the word he uses there was the correct word for black people at the time he was writing.\n\nSome of the book is heartrending, like the description from a witness -- Otis gives over thirty pages of the book to the voices of black witnesses of the riots -- talking about seeing white police officers casually shoot black teenagers on the street and make bullseye signals to their friends as if they'd been shooting tin cans. Some is, more than fifty years later, out of date or \"of its time\", but the sad thing is that so many of the arguments are as timely now as they were then. Otis wrote a follow-up, Upside Your Head, in the early nineties inspired by the LA riots that followed the Rodney King beating, and no doubt were he alive today he would be completing the trilogy.\n\nBut while politics had become Otis' main occupation, he hadn't stopped making music altogether, and in the late sixties he was contacted by Frank Zappa, who was such a fan of Otis that he copied his trademark beard from Otis. Otis and Zappa worked together in a casual way, with Otis mostly helping Zappa get in touch with musicians he knew who Zappa wanted to work with, like Don \"Sugarcane\" Harris. Otis also conducted the Mothers of Invention in the studio on a few songs while Zappa was in the control room, helping him get the greasy fifties sound he wanted on songs like \"Holiday in Berlin\":\n\n[Excerpt: The Mothers of Invention, \"Holiday in Berlin, Full Blown\"]\n\nApparently while they were recording that, Otis was clapping his hands in the face of the bass player, Roy Estrada, who didn't like it at all. Given what I know of Estrada that's a good thing.\n\nOtis' teenage son Shuggie also played with Zappa, playing bass on \"Son of Mr. Green Genes\" from Zappa's Hot Rats album. Zappa then persuaded a small blues label, Kent Records, which was owned by two other veterans of the fifties music industry, the Bihari brothers, to sign Otis to make an album. \"Cold Shot\" by the New Johnny Otis Show featured a core band of just three people -- Otis himself on piano and drums, Delmar \"Mighty Mouth\" Evans on vocals, and Shuggie playing all the guitar and bass parts. Shuggie was only fifteen at the time, but had been playing with his father's band since he was eleven, often wearing false moustaches and sunglasses to play in venues serving alcohol.\n\nThe record brought Otis his first R&B hit since \"Willie and the Hand Jive\", more than a decade earlier, \"Country Girl\":\n\n[Excerpt: The Johnny Otis Show, \"Country Girl\"]\n\nAround the same time, that trio also recorded another album, called \"For Adults Only\", under the name Snatch and the Poontangs, and with a cover drawn by Otis in a spot-on imitation of the style of Robert Crumb. For obvious reasons I won't be playing any of that record here, but even that had a serious sociological purpose along with the obscene humour -- Otis wanted to preserve bits of black folklore. Songs like \"The Signifying Monkey\" had been performed for years, and had even been recorded by people like Chuck Berry and Willie Dixon, but they'd always stripped out the sexual insults that make up much of the piece's appeal.\n\nOtis would in later years laugh that he'd received accusations of obscenity for \"Roll With Me Henry\" and for \"Willie and the Hand Jive\", but nobody had seemed bothered in the slightest by the records of Snatch and the Poontangs with their constant sexual insults.\n\n\"Cold Shot\" caused a career renaissance for Otis, and he put together a new lineup of the Johnny Otis Show, one that would feature as many as possible of the veteran musicians who he thought deserved exposure to a new audience. Probably the highest point of Otis' later career was a 1970 performance at the Monterey Jazz Festival, where his band featured, along with Johnny and Shuggie, Esther Phillips, Big Joe Turner, Eddie \"Cleanhead\" Vinson, Roy Milton, Pee Wee Crayton, Ivory Joe Hunter, and Roy Brown:\n\n[Excerpt: The Johnny Otis Show featuring Roy Brown, \"Good Rocking Tonight\"]\n\nThat performance was released as a live album, and Clint Eastwood featured footage of that show -- the band performing \"Willie and the Hand Jive\" -- in his classic film Play Misty For Me. It was probably the greatest example of Otis' belief that all the important strands of black American music shared a commonality and could work in combination with each other.\n\nFor the next few decades, Otis combined touring with as many of his old collaborators as possible -- Marie Adams, for example, rejoined the band in 1972 -- with having his own radio show in which he told people about black musical history and interviewed as many old musicians as he could, writing more books, including a cookbook and a collection of his art, running an organic apple juice company and food store, painting old blues artists in a style equally inspired by African art and Picasso, and being the pastor of a Pentecostal church -- but one with a theology so broadminded that it was not only LGBT-affirming but had Buddhist and Jewish congregants. He ran Blues Spectrum Records in the seventies, which put out late-career recordings by people like Charles Brown, Big Joe Turner, and Louis Jordan, some of them their last ever recordings. And he lectured in the history of black music at Berkeley.\n\nJohnny Otis died in 2012, aged ninety, having achieved more than most of us could hope to achieve if we lived five times that long, and having helped many, many more people to make the most of their talents. He died three days before the discovery of whom he was most proud, Etta James, and she overshadowed him in the obituaries, as he would have wanted.",
  "enclosure": "",
  "itunes:summary": "Episode seventy-one of A History of Rock Music in 500 Songs continues our look at British music TV by looking at the first time it affected American R&B, and is also our final look at Johnny Otis.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Short Shorts\" by the Royal Teens, a group whose members went on to be far more important than one might expect.\n\nAlso, this is the first of hopefully many podcasts to come where Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nMuch of the information on Otis comes from Midnight at the Barrelhouse: The Johnny Otis Story by George Lipsitz.\n\nI've also referred extensively to two books by Otis himself, Listen to the Lambs, and Upside Your Head! Rhythm and Blues on Central Avenue.\n\nI've used two main books on the British side of things:\n\nPete Frame's The Restless Generation is the best book available looking at British 50s rock and roll from a historical perspective. Be warned, though -- his jokey and irreverent style can, when dealing with people like Larry Parnes (who was gay and Jewish) very occasionally tip over into reinforcing homophobic and anti-semitic stereotypes for an easy laugh.\n\nBilly Bragg's Roots, Radicals, and Rockers: How Skiffle Changed the World is one of the best books I've read on music at all, and talks about the problems between the musicians' unions.\n\nThis three-CD set provides a great overview of Otis' forties and fifties work, both as himself and with other artists. Many of the titles will be very familiar to listeners of this podcast.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nAnd so we come to our last look at Johnny Otis, one of those people who has been turning up throughout the early episodes of the podcast. Indeed, he may continue to appear intermittently until at least the late sixties, as an influence and occasional collaborator. But the days of his influence on rock and roll music more or less came to an end with the rise of the rockabillies in the mid fifties, and from this point on he was not really involved in the mainstream of rock and roll.\n\nBut in one of those curious events that happens sometimes, just as Otis was coming to the end of the run of hits he produced or arranged or performed on for other people, and the run of discoveries that changed music, he had a rock and roll hit under his own name for the first and only time. And that hit was because of the Six-Five Special, the British TV show we talked about last week:\n\n[Excerpt: Johnny Otis, \"Willie and the Hand Jive\"]\n\nThe way this podcast works, telling stories chronologically and introducing new artists as they come along, can sometimes make it seem like the music business in the fifties was in a constant state of revolution, with a new year zero coming up every year or two. \"First-wave rockabilly is *so* January through August 1956, we're into late 1958 and everything's prototype soul now, granddad!\"\n\nBut of course the majority of the podcast so far has looked at a very small chunk of time, concentrating on the mid 1950s, and plenty of people who were making hits in 1955 were still having very active careers as of 1958, and that's definitely the case for Johnny Otis.\n\nWhile he didn't have that many big hits after rockabilly took over from R&B as the predominant form of rock and roll music, he was still making important records. For example, in 1957 he produced and co-wrote \"Lonely, Lonely Nights\" for Little Julian Herrera and the Tigers, which became a local hit, and which he thought at the time was the first big record to feature a Chicano singer.\n\nWe're going to talk about the Chicano identity in futur",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode seventy-one of A History of Rock Music in 500 Songs continues our look at British music TV by looking at the first time it affected American R&B, and is also our final look at Johnny Otis.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Short Shorts\" by the Royal Teens, a group whose members went on to be far more important than one might expect.\n\nAlso, this is the first of hopefully many podcasts to come where Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nMuch of the information on Otis comes from Midnight at the Barrelhouse: The Johnny Otis Story by George Lipsitz.\n\nI've also referred extensively to two books by Otis himself, Listen to the Lambs, and Upside You",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}