{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-6920905785985672280",
  "published": "2019-09-19T10:00:00.000-07:00",
  "updated": "2019-09-20T15:11:07.808-07:00",
  "title": "Updates to YouTube's verification program",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><br />Update as of 3 p.m. on 9/20/19:<br /><br /><br /><br />Yesterday, we announced changes to the verification badge. The idea behind this update was to protect creators from impersonation and address user confusion. Every year, we receive tens of thousands of complaints from creators about impersonation. Also, nearly a third of YouTube users told us that they misunderstood the badge’s meaning, associating it with *endorsement of content*, and not an indicator of *identity*. While rolling out improvements to this program, we completely missed the mark. We’re sorry for the frustration that this caused and we have a few updates to share.<br /><br /><br /><br />First, we heard loud and clear how much the badge means to you. Channels that already have the verification badge will now keep it and don’t have to appeal. We’ll continue reviewing those channels to ensure we’re protecting creators from impersonation. <br /><br /><br /><br />Just like in the past, all channels that have over 100,000 subscribers will still be eligible to apply. We’ll reopen the application process by the end of October. Going forward, we’ll review those channels to verify their identity. If we determine that a channel is attempting to impersonate, we won’t verify that channel and may take additional action. We’ve improved the process and will verify channels that are:<br /><br /><br /><br /><br /><ul><li>Authentic: Your channel must represent the real creator, brand, or entity you’re claiming to be. We’ll look at a variety of factors to help verify your identity, and may also ask for additional info or documentation.</li><br /><br /><li>Complete: Your channel must be public and have a description, channel icon, and content, and be active on YouTube.</li></ul><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-pUO_I6ilgXQ/XYVOLyeyjbI/AAAAAAAACP8/1id2z7epts0TwZhCWkNxz5ziCBl0pFjaACLcBGAsYHQ/s1600/verification-tweet-v4-01.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"800\" data-original-width=\"1600\" src=\"https://1.bp.blogspot.com/-pUO_I6ilgXQ/XYVOLyeyjbI/AAAAAAAACP8/1id2z7epts0TwZhCWkNxz5ziCBl0pFjaACLcBGAsYHQ/s1600/verification-tweet-v4-01.jpg\" /></a></div><br /><br />Yesterday, we also announced a new look for the verification badge that will be displayed consistently across screens. Due to all the changes we’re announcing today, the new badge will roll out next year.<br /><br /><br /><br />We hope that these clarifications are helpful and that these changes will improve the program for creators in the long run.<br /><br /><br /><br class=\"Apple-interchange-newline\" /> <hr /><br /><br /><br />When viewers come to YouTube, it’s important that they know the channel they are watching is the official presence of the creator, artist, public figure or company that it represents. With that in mind, we’re announcing upcoming changes to our channel verification program starting in late October. There are two parts to the new verification program, a new look and new eligibility requirements. <br /><br /><br /><br /><h3 style=\"text-align: left;\">New look</h3><br /><br /><br />Currently, verified channels have a checkmark next to their channel name. Through our research, we found that viewers often associated the checkmark with an endorsement of content, not identity. To reduce confusion about what being verified means, we’re introducing a new look that helps distinguish the official channel of the creator, celebrity or brand it represents. <br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-2NIpkee5SPA/XYKPnqgNqqI/AAAAAAAACPk/7-FyN4DXKO0MJrRye19RUyysyvAPTvpWgCLcBGAsYHQ/s1600/Creators---V3.gif\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"470\" data-original-width=\"836\" height=\"221\" src=\"https://1.bp.blogspot.com/-2NIpkee5SPA/XYKPnqgNqqI/AAAAAAAACPk/7-FyN4DXKO0MJrRye19RUyysyvAPTvpWgCLcBGAsYHQ/s400/Creators---V3.gif\" width=\"400\" /></a><a href=\"https://1.bp.blogspot.com/-nj6ePNnXvTM/XYKO9FFxx_I/AAAAAAAACPY/AqPIYmXluVEr2tKWgXctTZbLvZNeWyG_gCEwYBhgL/s1600/Music---V3.gif\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"470\" data-original-width=\"836\" height=\"221\" src=\"https://1.bp.blogspot.com/-nj6ePNnXvTM/XYKO9FFxx_I/AAAAAAAACPY/AqPIYmXluVEr2tKWgXctTZbLvZNeWyG_gCEwYBhgL/s400/Music---V3.gif\" width=\"400\" /></a></div><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-zLO8Km9PeXU/XYKOxtSSWPI/AAAAAAAACPU/smllRtOFw1InpyuXr7TZaAKiKTi7NwOhACLcBGAsYHQ/s1600/Creators---V3.gif\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-zLO8Km9PeXU/XYKOxtSSWPI/AAAAAAAACPU/smllRtOFw1InpyuXr7TZaAKiKTi7NwOhACLcBGAsYHQ/s1600/Creators---V3.gif\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><br /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div></div><br />As YouTube has expanded features where viewers interact with channels, including community posts, live chats and comments, the checkmark has been displayed inconsistently. The new look will be displayed more consistently across channel pages, search and comments, and is more difficult to replicate, so that viewers can be sure of a channel’s identity. This new look will also replace the existing music note on Official Artist Channels on YouTube.  <br /><br /><br /><br /><h3 style=\"text-align: left;\">New eligibility requirements</h3><br /><br /><br />Under our current eligibility requirements, channels with more than 100,000 subscribers can be verified regardless of need for proof of authenticity. That worked well when YouTube was smaller, but as YouTube has grown and the ecosystem has become more complex, we needed a new way to verify the identity of channels and help users find the official channel they’re looking for. <br /><br /><br /><br />Our new criteria prioritizes verifying prominent channels that have a clear need for proof of authenticity. We look at a number of factors to determine if a channel meets this criteria, including:<br /><br /><br /><br /><br /><ul style=\"text-align: left;\"><li><b>Authenticity:</b>&nbsp;Does this channel belong to the real creator, artist, public figure or company it claims to represent?</li><li><b>Prominence:</b>&nbsp;Does this channel represent a well-known or highly searched creator, artist, public figure or company? Is this channel widely recognized outside of YouTube and have a strong presence online? Is this a popular channel that has a very similar name to many other channels?</li></ul><br /><br /><br /><br />The new criteria will apply for all channels. Channels that meet the new requirements no longer need to apply; we will automatically apply the new verified treatment. For more info about verification and eligibility, check out our <a href=\"https://support.google.com/youtube/answer/3046484\" target=\"_blank\">Help Center.</a></div><br /><br /><br /><br /><i>Jonathan McPhie, Product Manager</i></div><br /><hr /><br /><ul style=\"text-align: left;\"></ul></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}