{
  "title": "How self-centered shopping has made me happier with the things I buy",
  "link": "https://www.getrichslowly.org/self-centered-shopping/",
  "comments": "https://www.getrichslowly.org/self-centered-shopping/#comments",
  "dc:creator": "J.D. Roth",
  "pubDate": "Thu, 22 Sep 2022 18:22:44 +0000",
  "category": "Shopping",
  "guid": "https://www.getrichslowly.org/?p=244418",
  "description": "<p>I've changed the way I shop over the past few years. And although the shift has been subtle, I've found that I'm <em>much</em> happier with the things I buy.</p>\n<p>In the past, my approach to shopping was simple. If I wanted a new <a href=\"https://seuss.fandom.com/wiki/Thneed\">thneed</a>, I would go to a store (or, with the advent of the internet, a website) and choose from the available thneeds. I'd look at the store's selection (or the website's selection) and pick the one best suited for me.</p>\n<p>If the thneed I wanted was particularly expensive or important, I might expand my search to multiple stores or multiple websites. But usually, I stuck with the first store I visited.</p>\n<p>The key point here is that I allowed the places I shopped to impose limits on the thneeds available to me. I think of this approach as \"store-centered shopping\". Whatever the store has in stock defines my universe of options. </p>\n<p>Now that I'm older, I've flipped the script. Instead of allowing the marketplace to define which thneeds are available to me, I decide exactly what I want <em>before</em> I begin my search. I put myself and my needs first. Once I know what I want, I take the time to locate it. What I want is almost always out there somewhere — if I'm patient enough to track it down.</p>\n<p><strong>I think of this approach \"self-centered shopping\".</strong> I'm putting <em>me</em> first, and that's a Good Thing. In fact, that's an Excellent Thing! This method consistently leads to greater satisfaction with the things I buy. Instead of picking up cheap, mass-market thneeds, I'm buying thneeds that feel as if they were specifically made for me.</p>\n<p>Let me give you a concrete example.</p>\n",
  "content:encoded": "<p>I've changed the way I shop over the past few years. And although the shift has been subtle, I've found that I'm <em>much</em> happier with the things I buy.</p>\n<p>In the past, my approach to shopping was simple. If I wanted a new <a href=\"https://seuss.fandom.com/wiki/Thneed\" rel=\"noopener\">thneed</a>, I would go to a store (or, with the advent of the internet, a website) and choose from the available thneeds. I'd look at the store's selection (or the website's selection) and pick the one best suited for me.</p>\n<p>If the thneed I wanted was particularly expensive or important, I might expand my search to multiple stores or multiple websites. But usually, I stuck with the first store I visited.</p>\n<p>The key point here is that I allowed the places I shopped to impose limits on the thneeds available to me. I think of this approach as &#8220;store-centered shopping&#8221;. Whatever the store has in stock defines my universe of options. </p>\n<p>Now that I'm older, I've flipped the script. Instead of allowing the marketplace to define which thneeds are available to me, I decide exactly what I want <em>before</em> I begin my search. I put myself and my needs first. Once I know what I want, I take the time to locate it. What I want is almost always out there somewhere — if I'm patient enough to track it down.</p>\n<p><strong>I think of this approach &#8220;self-centered shopping&#8221;.</strong> I'm putting <em>me</em> first, and that's a Good Thing. In fact, that's an Excellent Thing! This method consistently leads to greater satisfaction with the things I buy. Instead of picking up cheap, mass-market thneeds, I'm buying thneeds that feel as if they were specifically made for me.</p>\n<p>Let me give you a concrete example.<span id=\"more-244418\"></span></p>\n<h2>Buying a Wallet</h2>\n<p>Every five years or so, I need to replace my wallet. The old one wears out (or gets lost), so I buy a new one.</p>\n<p>The way this has always worked for me is simple. My wallet falls apart (or turns up missing), so I head to a nearby department store to look at their selection. I browse the wallets on display, pick the one I like best, then buy it. It becomes my wallet for the next five years.</p>\n<p>This is how I've <em>always</em> bought wallets since my very first one. I've been doing it for more than thirty years.</p>\n<p>In 2019, I noticed my wallet was beginning to fall apart again. &#8220;Time to buy another,&#8221; I thought to myself, and I realized I was dreading the experience. Just as always, I'd go to the store and choose from a wide selection of sameness. But here's the thing: I don't like most wallets. They work for other people, but they don't work for me.</p>\n<p><iframe loading=\"lazy\" title=\"George&#039;s Exploding Wallet\" width=\"500\" height=\"375\" src=\"https://www.youtube.com/embed/yoPf98i8A0g?feature=oembed&#038;enablejsapi=1&#038;origin=https://www.getrichslowly.org\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n<p>I'm not George Costanza. I don't carry a lot, and I certainly don't pack much cash. I just need something that fits in my pocket and allows me access to a few cards. I don't want bulk, and I don't need leather. I wanted to buy a wallet that worked the way <em>I</em> worked.</p>\n<p>Around this time, I happened to walk past a <a href=\"https://secrid.com/en-us/\" rel=\"noopener\">Secrid</a> store. Secrid is a Dutch company that manufacturers minimalist, metal-based wallets. Intrigued, I stepped inside to browse their selection. I nearly bought a Secrid <a hrf=\"https://secrid.com/en-us/wallets/cardprotector/\">Cardprotector</a> that day, but ultimately decided they were <em>too</em> minimal. (The Cardprotector lets you carry six cards, but that's about it.) When I left the store, though, I knew I'd use a different approach to buying <em>this</em> wallet.</p>\n<p>I made a list of the things I wanted in a wallet. I wanted:</p>\n<ul>\n<li>The slimmest form factor possible. I used the Cardprotector as a baseline: 63mm x 102mm and 40 grams.</li>\n<li>A clear slot for my driver license.</li>\n<li>The ability to carry both my personal credit cards and my business credit cards.</li>\n<li>A place to carry three or four banknotes.</li>\n<li>A <em>little</em> bit of extra room for things like insurance info, my library card, and receipts.</li>\n</ul>\n<p>With these parameters in mind, I scouted Amazon. I checked REI. I visited other stores and sites. I found plenty of minimalist wallets – including lots of Secrid knock-offs — but nothing that met my needs.</p>\n<p>Then I remembered Tom Bihn. The <a href=\"https://www.tombihn.com\" rel=\"noopener\">Tom Bihn company</a> specializes in travel gear. Their <a href=\"https://www.tombihn.com/products/synapse-19?variant=42047639322813\" rel=\"noopener\">Synapse 19</a> is my go-to backpack not only for daily use, but also for extended international travel. (No joke: I've used this simple 19-liter bag for three weeks of European travel before.) Tom Bihn is terrific at packing a lot of features into a small amount of space. Did they sell a travel wallet? They did!</p>\n<p>The Tom Bihn <a href=\"https://www.tombihn.com/products/minimalist-wallets?variant=13762302378047\" rel=\"noopener\">minimalist wallet</a> was <em>exactly</em> what I was looking for: three pockets and the same size as the Secrid Cardprotector (but half the weight). If I were to design a wallet for myself, this is what I'd design. I bought one. I've been using it ever since, and I love it. (Kim loves it too. She ordered one for herself, and she'll now often carry that instead of a purse.)</p>\n<h2>Self-Centered Shopping</h2>\n<p>My wallet story is a simple example that illustrates my new approach: self-centered shopping. I used to allow stores to define my universe of options, which meant that I rarely bought the thneed I actually wanted. I simply bought the closest thing available to my ideal.</p>\n<p>Today, I'm fussier. I've learned to take the time to think through what it is I truly want in a thneed before I buy one. I quite literally take out an index card and make a list of requirements so that I don't forget something important while I'm shopping.</p>\n<p>Yes, this self-centered shopping approach is often more expensive, but I'm okay with that. As I get older, my patience for poor quality grows shorter and shorter. When I buy things — especially things I use every day — I want quality. I want them to meet my needs. And, if possible, I want them to be a pleasure to use. <a href=\"https://www.getrichslowly.org/konmari-method/\">To quote Marie Kondo</a>, I want the thneeds I buy to &#8220;spark joy&#8221;.</p>\n<p>I feel like self-centered shopping is one of those things that some people will consider blindingly obvious: &#8220;Of course that's how you should buy things! Why would you do otherwise?&#8221; But for me, this is a new concept.</p>\n<p>When I was young, our buying choices were limited. We lived in a small town in rural Oregon. Plus, <a href=\"https://www.getrichslowly.org/growing-up-poor/\">my family was poor</a>. When I wanted to buy a thneed, I could choose from those available at Mangus Variety or Parson's Pharmacy. That's it.</p>\n<p>Today, though, I'm older, which means I'm more patient. I have more money than I did when I was younger. And, most importantly, the internet exists. When I want a thneed, I'm not limited to the stock on hand at the pharmacy and department store. Without exaggeration, I can buy <em>any</em> thneed in the world&#8230;if I can find it. And that's why I start by defining exactly what it is I want before I begin my search.</p>\n<blockquote class=\"highlight\"><p>This self-centered shopping approach has also drastically reduced my <a href=\"https://www.getrichslowly.org/control-impulse-spending-with-the-30-day-rule/\">impulse shopping</a>. Turns out I mostly succumb to impulse shopping when I don't actually know what I want!</p></blockquote>\n<h2>Becoming Product Loyal</h2>\n<p>There's been an interesting side effect to this self-centered shopping. It's made me <em>very</em> loyal to specific products from specific companies. When I find something I like, I buy it again and again and again. When it's time to replace my wallet, for instance, I'll buy the exact same wallet from Tom Bihn.</p>\n<p>Or, take my hiking boots. Every five to seven years, I replace a pair of <a href=\"https://www.amazon.com/dp/B000VX6XZC/?tag=grs17-20\" rel=\"noopener\">Timberland Chocorua</a>. (The Amazon history belo0w makes it look like I'm ordering them more often, but that's because I have two pairs in rotation at once: a &#8220;work&#8221; pair and a &#8220;dress&#8221; pair. Each pair lasts five to seven years.)</p>\n<p><a href=\"https://www.amazon.com/dp/B000VX6XZC/?tag=grs17-20\" rel=\"noopener\"><img loading=\"lazy\" src=\"https://www.getrichslowly.org/wp-content/uploads/timberland-chocorua.jpg\" width=\"800\" height=\"846\" class=\"aligncenter green-border\" alt=\"[my Timberland boot order history from Amazon] title=\"my Timberland boot order history from Amazon\" /></a></p>\n<p>I've been wearing these boots almost daily for fifteen years, much to Kim's chagrin. I'll be sad if they're ever discontinued.</p>\n<p>So, my old shopping process was: Realize I need a new thneed, go to the store (or website), and buy the best match.</p>\n<p>My new self-centered shopping process is:</p>\n<ol>\n<li>Take time to decide exactly what I want in a thneed.</li>\n<li>Search extensively to find potential matches. Buy one.</li>\n<li>If the thneed works, great. If not, return it and buy something different. (I almost never have to return anything, though, if I've taken the time to list the features I want.)</li>\n<li>When I learn a thneed is a <em>perfect</em> match, I buy it over and over.</li>\n</ol>\n<p>Looking around my writing desk this morning, I see that most of the things I use every day have now been acquired through self-centered shopping. Here are a few of the tools I bought by searching for <em>exactly</em> what I wanted. These are tools that I buy (or plan to buy) repeatedly because they're perfect for me.</p>\n<ul>\n<li><a href=\"https://www.amazon.com/dp/B08GLWCFC4/?tag=grs17-20\" rel=\"noopener\">Pentel GraphGear 1000</a> 0.5 mm mechanical pencils (except I buy them in blue and red, not pink)</li>\n<li><a href=\"https://www.amazon.com/dp/B00K3KRMFI/?tag=grs17-20\" rel=\"noopener\">Pigma Micron 005</a> pens</li>\n<li><a href=\"https://www.jetpens.com/Hobonichi-Book-Only-Planner-A6-English-2023-Jan-Start/pd/35453\" rel=\"noopener\">Hobonichi Techo</a> daily planners (although fellow notebook nerd <a href=\"https://ournextlife.com\" rel=\"noopener\">Tanja Hester</a> has convinced me to try the <a href=\"https://www.jetpens.com/Kokuyo-Jibun-Techo-Diary-Refill-Mini-B6-Slim-2023-Jan-Start/pd/35522\" rel=\"noopener\">Kokuyo Jibun Techo</a> for 2023)</li>\n<li><a href=\"https://www.amazon.com/dp/B00A6VX3QG/?tag=grs17-20\" rel=\"noopener\">Exacompta 100&#215;150 index cards</a> (and <a href=\"https://www.amazon.com/dp/B07BZ614Z3/?tag=grs17-20\" rel=\"noopener\">Oxford mini index cards</a>)</li>\n<li><a href=\"https://grovemade.com/product/leather-desk-pad/?initial=690\" rel=\"noopener\">Grovemade leather desk pad</a> (and a <a href=\"https://grovemade.com/product/wool-felt-desk-pad/?initial=683\" rel=\"noopener\">wool deskpad</a> for the <a href=\"https://officearrow.com/what-is-a-desk-return/\" rel=\"noopener\">desk return</a>)</li>\n</ul>\n<p>Actually, my desk itself was bought my self-centered shopping method. I'd been using a $90 IKEA desk for more than a decade, but it was woefully inefficient. And messy. I hated it. When we moved to Corvallis last year, I took the time to figure out what my &#8220;dream desk&#8221; would look like. Then I spent a couple of weeks shopping online and off to locate a match. I eventually found an excellent L-shaped traditional desk at a local furniture store, and that's what I'm using today.</p>\n<p>There are still a few tools at my desk that I acquired with my old &#8220;buy whatever the store has&#8221; method: my microphone, my second monitor (so awful!), my pencil sharpener. But you know what? These things work just fine. I'm in no rush to replace them. When I do replace them someday, I'll use my self-centered shopping method.</p>\n<blockquote class=\"highlight\"><p>\nHere's another reason I think self-centered shopping works so well for me.</p>\n<p>When I take the traditional approach to buying a wallet, for example, I go to the store and look at the options. There's usually forty or fifty wallets from which to choose. It's overwhelming. I'm paralyzed by <a href=\"https://www.getrichslowly.org/the-paradox-of-choice-and-the-dangers-of-perfection/\">the paradox of choice</a>.</p>\n<p>With self-centered shopping, though, I don't have a lot of options. Often, it's a struggle to find even <em>one</em> perfect match. This means that I can search until I find one product that fits my criteria, then call it a day. I'm not overwhelmed, and I don't experience the regret that usually comes when you have too many options.\n</p></blockquote>\n<div id=\"mediavine-settings\" data-blacklist-content-desktop=\"1\" data-blacklist-content-mobile=\"1\"></div>\n",
  "wfw:commentRss": "https://www.getrichslowly.org/self-centered-shopping/feed/",
  "slash:comments": 12,
  "media:content": {
    "media:player": "",
    "media:title": "George&#039;s Exploding Wallet",
    "media:description": "Guess what Shannon! The High School is FLOODED!! WOOOO - alex9x12 - The Reverse Peephole",
    "media:thumbnail": "",
    "media:rating": "nonadult"
  }
}