{
  "id": "tag:blogger.com,1999:blog-37798047.post-7031097278681708508",
  "published": "2021-10-31T01:39:00.011-04:00",
  "updated": "2021-10-31T02:15:17.301-04:00",
  "title": "Debunking: that Jones Alfa-Trump report",
  "content": "<p>The Alfa-Trump conspiracy-theory has gotten a new life. Among the new things is a report done by Democrat operative Daniel Jones [<a href=\"https://krebsonsecurity.com/wp-content/uploads/2021/09/JonesvAlfa.pdf\">*</a>]. In this blogpost, I debunk that report.</p><p>If you'll recall, the conspiracy-theory comes from anomalous DNS traffic captured by cybersecurity researchers. In the summer of 2016, while Trump was denying involvement with Russian banks, the Alfa Bank in Russia was doing lookups on the name \"mail1.trump-email.com\". During this time,&nbsp; additional lookups were also coming from two&nbsp;other organizations with suspicious ties to Trump, Spectrum Health and Heartland Payments.</p><p>This is certainly suspicious, but people have taken it further. They have crafted a conspiracy-theory to explain the anomaly, namely that these organizations were secretly connecting to a Trump server.</p><p>We know this explanation to be false. There is no Trump server, no real server at all, and no connections. Instead, the name was created and controlled by Cendyn. The server the name points to for transmitting bulk email and isn't really configured to accept connections. It's built for outgoing spam, not incoming connections. The Trump Org had no control over the name or the server. As Cendyn explains, the contract with the Trump Org ended in March 2016, after which they re-used the IP address for other marketing programs, but since they hadn't changed the DNS settings, this caused lookups of the DNS name.</p><p>This still doesn't answer why Alfa, Spectrum, Heartland, and nobody else were doing the lookups. That's still a question. But the answer isn't secret connections to a Trump server. The evidence is pretty solid on that point.</p><span><a name='more'></a></span><p><br /></p><p><b>Daniel Jones and Democracy Integrity Project</b></p><p>The report is from&nbsp;<a href=\"https://en.wikipedia.org/wiki/Daniel_J._Jones\">Daniel Jones</a>&nbsp;and his Democracy Integrity Project.</p><p>It's at this point that things get squirrely. All sorts of right-wing sites claim he's a front for George Soros, funds Fusion GPS, and involved in the <a href=\"https://en.wikipedia.org/wiki/Steele_dossier\">Steele Dossier</a>. That's right-wing conspiracy theory nonsense.</p><p>But at the same time, he's clearly not an independent and objective analyst. He was hired to further the interests of Democrats.</p><p>If the data and analysis held up, then partisan ties wouldn't matter. But they don't hold up. Jones is clearly trying to be deceptive.</p><p>The deception starts by repeatedly referring to the \"Trump server\". There is no Trump server. There is a Listrak server operated on behalf of Cendyn. Whether the Trump Org had any control over the name or the server is a key <i>question</i>&nbsp;the report should be trying to prove, not a <i>premise</i>. The report clearly understands this fact, so it can't be considered a mere <i>mistake</i>, but a deliberate <i>deception</i>.</p><p>People make assumptions that a domain name like \"<i>trump-email.com</i>\" would be controlled by the Trump organization. It's wasn't. When Trump Hotels hired Cendyn to do marketing for them, Cendyn did what they normally do in such cases, register a domain with their client's name for the sending of bulk emails. They did the same thing with <i>hyatt-email.com</i>, <i>denihan-email.com</i>, <i>mjh-email.com</i>, and so on. What clear is that the Trump organization had no control, no direct ties to this domain until after the conspiracy-theory hit the press.</p><p><br /></p><p><b>Finding #1 - Alfa Bank, Spectrum Health, and Heartland account for nearly all of the DNS lookups for mail1.trump-email.com in the May-September timeframe.</b></p><p>Yup, that's weird and unexplained.</p><p>But it concludes from this that there were connections, saying the following:</p><blockquote>In the DNS environment, if \"computer X\" does a DNS look-up of \"Computer Y,\" it means that \"Computer X\" is trying to connect to \"Computer Y\".</blockquote><p>This is false. That's certainly the assumption we usually make, that it's probably true in most cases. But it's not something we insist upon if there's reason to doubt it. And since there's reason to doubt it here, we would need more evidence to make that conclusion.</p><p>For example, before the contract was canceled in March 2016, there were DNS lookups for the \"mail1.trump-email.com\" name from all over the place. That's because the Listrak server was pumping out bulk emails (\"spam\") promoting Trump Hotels. Servers receiving the emails would often check the identity of the server through DNS lookups, but without any attempt to connect. This fact is footnoted in the Jones report even as it claims otherwise in the main text.</p><p>Obviously, that's no longer the case after March 2016, when the contract was canceled. But if Cendyn repurposes the server for something else, such lookups can still happen without connections. The DNS records hadn't changed. So if the server sends out new things from that IP address, unrelated to Trump Org, it'd still cause DNS lookups for the \"trump-email.com\" domain to happen. It wouldn't mean anybody was trying to connect to the server.</p><p>This is indeed what Cendyn claims, that they repurposed the resources for their hotel meetings app (whereby hotels can schedule conferences and things on their premises).</p><p>It's still suspicious that only those three organizations were involved, but at the same time, it's clearly false to assume this is evidence of <i>connections</i>.</p><p><br /></p><p><b>Finding #2 - Comparison with <i>denihan-email.com</i>.</b></p><p>The Jones report compared the DNS logs of <i>trump-email.com</i>&nbsp;with the domain of another of Cendyn's client, Denihan. Cendyn registered the domain&nbsp;<i>denihan-email.com</i>. This is another hotel company.</p><p>This comparison was obviously bogus. The contract with Cendyn ended in March 2016, after which Cendyn claims it repurposed the server. Jones uses the timeframe August 2016 through September 2016 to compare traffic for those two domains. Of course they'd be different. A valid comparison would be a t timeframe before March 2016, when both were clients of Cendyn.</p><p>Since Jones documents the fact the contract between Cendyn and Trump Org was ended, they are knowingly comparing an apple to an orange. Thus, it's not a mistake but a deception.</p><p>This also points to the fundamental problem with the data-set. We don't really have a full picture of what happened, such as data going back to 2015. We have a carefully curated subset of the data designed to show just what they want us to see.</p><p>Everything points to <i>trump-email.com</i>&nbsp;domain and Listrak servers being just normal Cendyn stuff used for Cendyn's purposes. As far as we can tell, that domain worked the same as other Cendyn clients, such as <i>denihan-email.com</i>, <i>hyatt-email.com</i>, <i>mjh-email.com</i>, and so on. These domains are controlled by Cendyn, not their client's. Cendyn in turn points those names at Listrak servers for sending bulk email.</p><p><br /></p><p><b>Finding #3 - Missing SPF record</b></p><p>The Jone's report points to missing SPF records, showing that the server is not configured correctly for sending mass emails. It includes this exhibit.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-HmZ2g6nPqqA/YX2YgSSY3BI/AAAAAAAAGzs/v40T9gJIBx8iDkJMs7fxRqWR42-Tsn8VwCLcBGAsYHQ/s1808/Screen%2BShot%2B2021-10-30%2Bat%2B3.09.24%2BPM.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"354\" data-original-width=\"1808\" height=\"63\" src=\"https://1.bp.blogspot.com/-HmZ2g6nPqqA/YX2YgSSY3BI/AAAAAAAAGzs/v40T9gJIBx8iDkJMs7fxRqWR42-Tsn8VwCLcBGAsYHQ/s320/Screen%2BShot%2B2021-10-30%2Bat%2B3.09.24%2BPM.png\" width=\"320\" /></a></div><div><br /></div>But a review shows that this is the same configuration as for other Cendyn/Listrak bulk email servers. For example, compared to <i>mjh-email.com</i>, we find it's configured the same:<div><br /><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-k_ObHorZGvc/YX2YvcVSbcI/AAAAAAAAGzw/kUIUGr5ny54cofRfbX1qV4ov2_GwH8CmACLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"286\" data-original-width=\"804\" height=\"114\" src=\"https://lh3.googleusercontent.com/-k_ObHorZGvc/YX2YvcVSbcI/AAAAAAAAGzw/kUIUGr5ny54cofRfbX1qV4ov2_GwH8CmACLcBGAsYHQ/image.png\" width=\"320\" /></a></div></div><div><br /></div><div>The SPF and DMARC standards were not as widely used in 2016, so misconfigurations were common. Moreover, the domains also lacked a DMARC record. Without DMARC, despite SPF being bad, many receivers won't reject the emails.</div><div><br /></div><div>Listrak/Cendyn still fail to have proper DMARC records for their clients, which means that some of their bulk email is getting rejected. They should probably fix that. This doesn't mean Listrak/Cendyn aren't in the bulk email business, only that they could be better at it.</div><div><br /></div><div>Thus, we've shown that <i>trump-email.com</i>&nbsp;had the perfectly normal Cendyn SPF records. Far from proving this isn't a bulk email server, the consistency with Cendyn's normal configuration proves unequivocally that it is.</div><div><br /></div><div><br /></div><div><b>Finding #4 - Accepts emails only from specific senders</b></div><div><br /></div><div>The Jones report shows that the server in question (66.216.133.29) accepts incoming email, but rejects email from the public, accepting email only from specific senders. They assume the specific senders would be those from Alfa Bank, Spectrum, and Heartland.</div><div><br /></div><div>Again, they don't compare properly to other Cendyn/Listrak systems. If they had, they'd have found that they all are configured the same way. There's an entire subnet of servers you can test this way:</div><div><br /></div><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-agPm6PV2POg/YX2cDkubTFI/AAAAAAAAGz8/3KS-_opKTkAi-sMUdGDaF2OV3uB77DkYQCLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"483\" data-original-width=\"780\" height=\"198\" src=\"https://lh3.googleusercontent.com/-agPm6PV2POg/YX2cDkubTFI/AAAAAAAAGz8/3KS-_opKTkAi-sMUdGDaF2OV3uB77DkYQCLcBGAsYHQ/image.png\" width=\"320\" /></a></div><br />All these servers show the same messages, allowing incoming email <i>connections </i>but not incoming email <i>messages</i>.</div><div><br /></div><div>This is a vestigial configuration common to bulk email senders. Spammers only send email. One way to test if somebody is spammer is to connect back. This configuration makes it appear they'll accept email even if they won't, passing the test.</div><div><br /></div><div>In no way is this evidence of secret communications. It's not evidence of their claim that somehow Alfa Bank, Spectrum Health, and Heartland would be on the list of allowed senders. We would need additional evidence to make that claim, not an assumption.</div><div><br /></div><div><br /></div><div><b>Finding #5 - Evidence of human interaction and coordination</b></div><div><br /></div><div>The report claims a direct link between Alfa and Trump with the following:</div><div></div><blockquote><div>On September 23, 2016, two days after <i>The New York Times</i>&nbsp;approached Alfa Bank, the Trump Organization deleted the email server \"mail1.trump-email.com\" ... it would have been a deliberate human action taken by a someone working on behalf of the Trump Organization and not by <i>Alfa Bank</i>. An analyst, quoted in the <i>Slate</i>&nbsp;article by Franklin Foer, observed that <i>\"the knee was struck in Moscow, and the leg kicked in New York.\"</i></div><div></div></blockquote><div>This 'finding' is an excellent demonstration of how to identify conspiracy-theories: anomalies that cannot otherwise be explained become proof of the conspiracy. After all, the conspiracy-theory can explain everything.</div><div><br /></div><div>When I debunked the Alfa-Trump thing back in 2017, reporters grilled me on this specific point. They demanded I come up with an explanation for this coincidence. I told them I had none, but just because I didn't have one, it didn't mean it was proof of the conspiracy theory. There could be lots of explanations, just because we don't know them doesn't mean they don't exist. Just because the conspiracy-theory explains it doesn't mean this is evidence for the conspiracy.</div><div><br /></div><div>But now we do have another explanation: the FBI called Cendyn on the morning of September 23 and asked them about the domain. As the agent reported back:</div><blockquote><div>“Followed up this morning with Central Dynamics [Cendyn] who confirmed that the mail1.trump-email.com domain is an old domain that was set up in approximately 2009 when they were doing business with the Trump Organization that was never used.\" -- <a href=\"http://zububrothers.com/2021/10/31/durham-probe-inches-closer-to-hillary-as-alfa-bank-hoax-plot-thickens/\">*</a></div><div></div></blockquote><div>Thus, it's not NYT contacting Alfa Bank that caused the deletion, it's the FBI calling Cendyn. Thus, there's no evidence Alfa Bank or Trump Org were even involved. The evidence is quite clear that only Cendyn was involved.</div><div><br /></div><div>After Cendyn deletes the domain \"mail1.trump-email.com\", lookups of that name started to fail. The Jones report notes that Alfa Bank then switched to \"trump1.contact-client.com\". It weaves this in to the conspiracy thusly:</div><blockquote><div>The fact that Alfa Bank was the first entity (IP address) to conduct a DNS look-up for \"trump1.contact-client.com\" in the data-set could indicate that someone at Alfa Bank was in some manner made aware of the new Trump Organization server name.</div><div></div></blockquote><div>The name \"contact-client.com\" is part of Cendyn's infrastructure. For their \"<i>mail1.<b>customer</b>-email.com</i>\" domains, there's a matching \"<i><b>customer</b>1.contact-client.com</i>\" domain. We can see test that live right now:</div><div><br /></div><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-eFYblR_11eI/YX4dqVW3VPI/AAAAAAAAG0E/7rSeeXJzRTcOkRK_iFknLrs1EnK8CgiQACLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"277\" data-original-width=\"775\" height=\"114\" src=\"https://lh3.googleusercontent.com/-eFYblR_11eI/YX4dqVW3VPI/AAAAAAAAG0E/7rSeeXJzRTcOkRK_iFknLrs1EnK8CgiQACLcBGAsYHQ/image.png\" width=\"320\" /></a></div><br />This is totally consistent with Cendyn's re-use of the infrastructure for a new purpose, as it would treat both domain names the same. Rather than evidence suggesting human interaction, it's evidence suggesting the opposite, that there was no human interaction.</div><div><br /></div><div><br /></div><div><b>6. The Mandiant report doesn't refuted these findings</b></div><div><br /></div><div>After this thing hit the news, Alfa Bank hired Mandiant to come to their offices and investigate. Their report was inconclusive. They didn't find anything.</div><div><br /></div><div>Note the difference in language. Things Mandiant can't explain demonstrates Mandiant's incompetence, while things Jones can't explain prove the conspiracy-theory. If Mandiant's report should be treated as inclusive and proof of nothing, then so too should the Jones report. The Jones report has even less evidence than the Mandiant report.</div><div><br /></div><div><br /></div><div><b>7. The public statements by Trump et al. are contradictory and incomplete</b></div><div><b><br /></b></div><div>Duh.</div><div><br /></div><div>The Trump Org, Alfa, and Spectrum Health have no idea what happened. Their statements are consistent with knowing they don't have secret communications, but not knowing where this DNS data came from. They are unable to refute the allegations, but at the same time, are concerned for their reputations, and behave accordingly. Which, of course, means the guess at what's going on with more confidence than is warranted.</div><div><br /></div><div>If there were secret communications among them, you'd expect they'd do a better job at coordinating their stories.</div><div><br /></div><div><br /></div><div><b>Conclusion</b></div><div><b><br /></b></div><div>In this blogpost, I've refuted all the findings of the Jones report. There is still the question where this DNS anomaly came from, but the allegation that this proves a secret connect between Alfa Bank and a Trump server is clearly false.</div><div><br /></div><div>Moreover, I've shown that the Jones report is not merely wrong, but deliberately deceptive. They repeatedly reference a \"Trump Organization Server\" even though it's quite clear from the text they know that no such server exists.</div><div><br /></div><div>For example, when Cendyn removed the \"mail1.trump-email.com\" DNS record, it was described as the \"Trump Organization deleted the email server\". It's clear they know that Cendyn simply removed the <i>mail1.trump-email.com</i> record, and that the Listrak server wasn't touched. Yet, they deliberate phrase things this way in order to deceive.</div><div><br /></div><div>What we have is Alfa Bank doing DNS queries. What we don't have is any connection to the Trump Org. Since Jones couldn't create the <i>conclusion</i> based on evidence that Trump Org was involve, he instead made it the <i>premise</i>.</div><div><br /></div><div>This in turn makes it easy to disprove the entire Jones report: since there's not only no evidence of Trump Org involvement, and quite a lot of evidence Trump Org had no control over the domain or servers, it disprove the entire theory that there was secret connections with Alfa Bank.</div><div><br /></div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Robert Graham",
    "uri": "http://www.blogger.com/profile/09879238874208877740",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 2
}