{
  "title": "Streetlight Wi-Fi Hotspots: A Bright Idea",
  "link": "https://spectrum.ieee.org/wi-fi",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/streetlights-seen-against-a-colorful-sky.jpg?id=31291888&width=1200&height=800&coordinates=0%2C78%2C0%2C79\"/><br/><br/><p>Wi-Fi deployed via streetlights—the vision of an international consortium founded by Intel, Facebook, Nokia and others—may one day help augment wireless access throughout cities. However, much remains unknown about the most apt placement for these access points. Now a novel algorithm could help telecommunications companies discover how to best install this infrastructure, a new study finds.<br/></p><p>The international <a href=\"https://telecominfraproject.com/faq/\" target=\"_blank\">Telecom Infra Project</a> envisions making public Wi-Fi available via the 60-gigahertz frequency band (ranging from 57 to 73 GHz) by <a href=\"https://telecominfraproject.com/tip-playbook-for-smart-cities/\" rel=\"noopener noreferrer\" target=\"_blank\">installing access points on light poles</a>. This band is unlicensed, and the<a href=\"https://spectrum.ieee.org/qualcomm-introduces-new-chipsets-for-60-ghz-wifi\" target=\"_self\"> IEEE 802.11ay</a> standard for 60-GHz Wi-Fi released in 2021 supports up to 8.64 GHz of bandwidth.</p><p>A challenge that comes along with using 60-GHz signals is that oxygen absorption exacerbates attenuation, thus limiting their range. If wireless links using these frequencies are relatively short—less than 100 meters—they may still prove useful in dense urban areas. However, much remains unknown about the best way to use such transmissions in cities, such as the ideal height for access points to avoid obstructions that might scatter these signals.</p><p>In the new study, researchers at the National Institute of Standards and Technology (NIST) in Gaithersburg, Md., developed a model for tracking 60-GHz signals that accounted for wide variances in light poles’ height. It uses a new algorithm for analyzing transmission paths that goes beyond usual parameters such as signal angles and delays to include receiver locations.</p><p>The scientists detailed <u><a href=\"https://ieeexplore.ieee.org/document/9765658\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a></u> in a paper published in the August issue of <em>IEEE Antennas and Wireless Propagation Letters</em>.</p><p>The scientists tested their model in downtown Boulder, Colo., with a stationary transmitter mounted on a mast and a mobile receiver on the roof of a van. They measured signals at 4-, 6-, and 9-meter antenna heights, reflecting the ways in which light-pole heights can vary within and between cities.</p><p>The researchers found that their model predicted real-world measurements very well, with an accuracy comparable to that of more complicated methods. In general, the scientists found that the optimal height for Wi-Fi signals depended on the transmission frequency and antenna design. Attaching equipment at lower heights (about 4 meters above street level) proved better for traditional wireless systems with omnidirectional antennas, whereas higher locations 6 or 9 meters up were better for the latest systems such as 5G that use higher, millimeter-wave frequencies and narrow-beam antennas.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A person in a safety vest stands on a platform looking at a large mast in a parking lot.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"28189c97d3b0925a5c9b4ead176588dc\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"9258b\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-person-in-a-safety-vest-stands-on-a-platform-looking-at-a-large-mast-in-a-parking-lot.jpg?id=31291889&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The NIST team works to verify their channel model for evaluating high-frequency wireless-network designs in Boulder, Colo. Researcher Sung Yun Jun checks the alignment of the transmitter, mounted 6 meters high on a mast, with the receiver antenna array on the roof of the blue van. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">NIST</small></p><p>The scientists focused on how transmitted power spread over space at different heights.<br/></p><p>“At lower heights, there are more random obstacles—trees, vehicles, and so on—which impede propagation. As a result, the power is less spread out,” says  Jelena Senic, an electrical engineer at NIST who was a coauthor of the paper detailing the study. “At higher heights, the power is less inhibited—it can bounce around off the buildings multiple times before losing strength, hence the power is more spread out.”</p><p>Senic notes that 5G and 6G wireless-communication systems “will employ antennas with very narrow beamwidths—on the order of a few degrees—and so are often referred to as pencil beams. (They have high <a href=\"https://en.wikipedia.org/wiki/Gain_(antenna)\" target=\"_blank\">antenna gain</a> to compensate for the greater <a href=\"https://en.wikipedia.org/wiki/Path_loss\" rel=\"noopener noreferrer\" target=\"_blank\">path loss</a> experienced at <a href=\"https://spectrum.ieee.org/the-anatomy-of-mmwave-communications-prototype-for-5g-testing\" target=\"_self\">millimeter wave</a> frequencies.) Having the power spread out in space is good for these systems, because they can steer the pencil beams in multiple directions through spatial <a href=\"https://spectrum.ieee.org/neural-network-multiplex?share_id=6966369\" target=\"_self\">multiplexing</a>, with each position providing a separate channel, to increase the combined bit rate over the channels. So higher heights are definitely more advantageous, making lampposts an adequate solution.”</p><p>The researchers also conducted these tests on the NIST campus with comparable results. This suggests this model may generalize to different environments, such as residential areas.</p><p>These findings suggest that cell providers can implement next-generation 5G and 6G systems at low cost, “since lampposts are present everywhere in urban environments,” Senic says. At the same time, customers can expect a variety of new applications such as ultrahigh-definition video streaming and virtual reality, which become possible with multigigabit-per-second data rates and low latency,  she says. “In addition, 60 GHz provides a 14-GHz superwide bandwidth in the unlicensed band,” she adds.</p><p>Jenic cautions that customers “shouldn’t expect Wi-Fi access from lampposts everywhere.” The first targets for this service are likely <a href=\"https://en.wikipedia.org/wiki/Urban_canyon\" rel=\"noopener noreferrer\" target=\"_blank\">urban canyons</a>, “because there the wireless demand is high due to the density of the population.”</p>",
  "pubDate": "Tue, 30 Aug 2022 18:12:54 +0000",
  "guid": "https://spectrum.ieee.org/wi-fi",
  "category": [
    "Streetlights",
    "Mmwave",
    "6g",
    "5g",
    "Nist",
    "Telecommunications",
    "60 ghz",
    "Multiplexing",
    "Wi-fi",
    "Journal watch"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}