{
  "title": "Every Tooth Tracked",
  "description": "<p><em>Note: This is a repost of my <a href=\"https://mitredxcampjan2015.wordpress.com/2015/01/30/dental-imaging-project-every-tooth-tracked/\">January post</a> on MIT Media Lab’s Wordpress blog of their RedX 2015 Camp held at IIT-Bombay. There are a few minor modifications though.</em></p>\n\n<p>We want to track the health of every tooth over time, and therefore wanted an algorithm that could extract the image of every single tooth from the stitch that we obtained in our previous step. Our first attempt was at a completely automated approach, and we soon found a <a href=\"http://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=6482414&amp;tag=1\">paper</a> which attempted to solve a problem that was a subset of ours. They wanted to separate the teeth part from the rest of the image, while we wanted to segment every teeth from the rest of the image. The algorithm that these guys had used was pretty basic (<a href=\"http://cdanup.com/10.1.1.2.1828.pdf\">Active Contours Without Edges</a>), and I got it working within half an hour on MATLAB, with the following results:</p>\n\n<figure>\n\t<img src=\"/images/dental/3k_with_removal.png\" />\n\t<figcaption>Obtained using Active Contours Without Edges (Chan-Vese)</figcaption>\n</figure>\n\n<p>But this approach had a few problems. It was computationally expensive (~ 2min to run on my Intel Core i7 machine), and could not be used to segment an individual tooth out.</p>\n\n<p>So, I started looking at other algorithms, and soon stumbled across the <a href=\"http://www.cs.rug.nl/~roe/publications/parwshed.pdf\">Watershed transform</a>. In order to generate good results, watershed needs certain markers, and these markers can be generated using both automated or manual methods. One popular automated method for generating these markers is ‘opening-by-reconstruction’ and ‘closing-by-reconstruction’. The following results were obtained using MATLAB’s watershed example:</p>\n\n<figure>\n\t<img src=\"/images/dental/49_seg_man.png\" />\n\t<figcaption>Vanilla Watershed with automatic marker generation</figcaption>\n</figure>\n\n<p>As you can see, the above is a complete mess. A lot of unwanted segments are obtained, and some superpixels (clusters of pixels) flow into each other.\nSo, I then tried a manual-marker approach, and the results were much better:</p>\n\n<figure>\n\t<img src=\"/images/dental/49_final.png\" />\n\t<figcaption>Watershed with manually-annotated markers</figcaption>\n</figure>\n\n<p>A <a href=\"http://www.mathworks.com/matlabcentral/fileexchange/44469-gui-image-mask-sample\">matlab-based GUI</a> is used to generate the masks as follows:</p>\n<figure>\n\t<img src=\"/images/dental/gui_marker.png\" />\n</figure>\n\n<p>The mask file looks something like this:</p>\n<figure>\n\t<img src=\"/images/dental/49_msk.png\" />\n\t<figcaption>The mask used to generate the above results</figcaption>\n</figure>\n\n<p>In the final product, we can assume to have a touchscreen based user interface, wherein the user slashes with his finger across every tooth once, and then gets the segmented image as an output. One several such images have been mannually annotated, we could use a learning algorithm that can automatically generate these masks.</p>",
  "pubDate": "Sat, 23 May 2015 00:00:00 +0000",
  "link": "https://avisingh599.github.io/vision/segmenting-teeth/",
  "guid": "https://avisingh599.github.io/vision/segmenting-teeth/"
}