{
  "title": "What if I Can't Lose Weight?",
  "itunes:title": "What if I Can't Lose Weight?",
  "pubDate": "Fri, 30 Sep 2022 07:00:00 +0000",
  "guid": "dc75ffdd-3d6d-4f74-8998-a13e7e510ba2",
  "link": "https://www.phit-n-phat.com/join/",
  "itunes:image": "",
  "description": "<p>Today could be your magic moment.<br /> <br /> The moment you decide again to lose weight. And for some reason, it just works this time. <br /> <br /> My magic moment was when my son Logan was a year old.<br /> <br /> After a lifetime of obesity, I was so miserable, depressed, and out of shape that I couldn’t play with my own child. I was literally just eating my life away.<br /> <br /> I needed to do something.<br /> <br /> That day, I didn’t sit and think, “What if I can’t lose weight?”<br /> <br /> I had done that plenty of times before and it was detrimental to my weightloss.<br /> <br /> I started losing weight when I started asking myself different questions. And anyone can do that.<br /> <br /> In today’s podcast episode, you will learn the simple shift you can make to help you lose weight and keep it off.<br /> <br /> If you're ready to lose your weight for good, join me inside the No BS Weightloss Program: JoinNoBS.com</p>",
  "content:encoded": "<p>Today could be your magic moment.  The moment you decide again to lose weight. And for some reason, it just works this time.   My magic moment was when my son Logan was a year old.  After a lifetime of obesity, I was so miserable, depressed, and out of shape that I couldn’t play with my own child. I was literally just eating my life away.  I needed to do something.  That day, I didn’t sit and think, “What if I can’t lose weight?”  I had done that plenty of times before and it was detrimental to my weightloss.  I started losing weight when I started asking myself different questions. And anyone can do that.  In today’s podcast episode, you will learn the simple shift you can make to help you lose weight and keep it off.  If you're ready to lose your weight for good, join me inside the No BS Weightloss Program: JoinNoBS.com</p>",
  "enclosure": "",
  "itunes:duration": "28:49",
  "itunes:explicit": true,
  "itunes:keywords": "",
  "itunes:subtitle": "Today could be your magic moment.  The moment you decide again to lose weight. And for some reason, it just works this time.   My magic moment was when my son Logan was a year old.  After a lifetime of obesity, I was so miserable, depressed, and...",
  "itunes:episodeType": "full"
}