{
  "title": "Episode 73: &#8220;La Bamba&#8221; by Ritchie Valens",
  "link": "https://500songs.com/podcast/episode-73-la-bamba-by-ritchie-valens/",
  "pubDate": "Mon, 09 Mar 2020 12:52:07 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-73-la-bamba-by-ritchie-valens/",
  "description": "Episode seventy-three of A History of Rock Music in Five Hundred Songs looks at \"La Bamba\" by Ritchie Valens, and is the first of a two-part story which will conclude next week with an episode on Buddy Holly. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/34728238\">on \"Kansas City\" by Wilbert Harrison</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-73-la-bamba/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nOnly one biography of Valens has ever been written -- understandably since his public career lasted a matter of months and he died when he was seventeen -- but <a href=\"https://amzn.to/2IyQVuU\">Beverly Mendheim's book</a> is about as good as one could expect given that.\n\nAnd <a href=\"https://amzn.to/39BzlSR\">this CD</a> compiles all three of the posthumous album releases, Valens' entire musical legacy.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nThis is actually going to be part one of a two-part story, which will be continued in next week's episode. Ritchie Valens died so young that he is nowadays mostly known for his death, but in this episode we're going to look at why people cared about him at all -- the story of the plane crash that took his life will wait for next week's episode. This week, we're going to look at his short recording career, and at his most famous record:\n\n[Excerpt: Ritchie Valens, \"La Bamba\"]\n\nSo far in this podcast, when we've looked at race, we've mostly dealt with either black or white musicians, along with a few people who are clearly white by the standards of 2020 but might not have been considered so at the time.\n\nBut there was, in Los Angeles, a whole parallel music culture growing up around Latino teenagers. This subculture only rarely impinged on the consciousness of the wider American public, but without it we would have had no garage rock and no punk, as we know them today. And the first big star, the person around whom that culture coalesced, was Ritchie Valens.\n\nNow, I have to stress here that I am at even more of a disadvantage when talking about this subculture than I am when talking about black America. While black culture has been extensively documented in all sorts of other popular culture I've consumed, and I've studied mid-twentieth-century black American culture to a reasonable extent (though nowhere near enough, of course, that my thoughts on the subject should be taken as authoritative), I have had almost no exposure to the Latino culture of the same time period.\n\nAnd on top of that, there's an additional problem, which is that I am going to have to refer to quite a few Spanish terms in the course of this episode, and I don't speak Spanish. While I'm going to try my best with those, I will undoubtedly mangle some things.\n\nBut that's sort of appropriate, at least, in the case of Ritchie Valens, because one of the things that people who knew him would say is that he spoke Spanish terribly -- while he was a Mexican-American, he was raised in an English-speaking household, and only spoke Spanish as a second language, in which he wasn't especially fluent.\n\nBy all accounts, in fact, Valens -- who was born Richard Valenzuela, but had his name shortened when he got a record deal -- was at least somewhat unpopular among the other Mexican-Americans at his school. Some of this was due to his appearance -- he was notably light-skinned for a Mexican-American, and apparently there was a level of colourism among Latino kids in that area at that time, and he was also quite fat -- and some was due to his willingness to associate with people of other races, as he had both black and white friends.\n\nValens' big interest in school was music, especially R&B, and especially the music of Little Richard and Larry Williams, and other people who had recorded for Specialty Records. When he was in high school, he joined a group called the Silhouettes, who had named themselves after a recent hit of that name by the Rays:\n\n[Excerpt: The Rays, \"Silhouettes\"]\n\nThat song was also the inspiration for another group, a doo-wop group also called the Silhouettes, who had a hit with \"Get a Job\". That's not this group, and they weren't yet known at the time.\n\nThese Silhouettes never recorded, and after Valens became famous there were a lot of interviews with various members of the band who disagreed, of course, on who it was who invited Valens into the band, who the leader of the band was, and who had really taught Valens everything he knew about performing, as well as disagreeing on what songs the band performed, and who contributed what to the songs that made Valens famous.\n\nThe Silhouettes were by modern standards a very big band, having three trumpets, five saxophones, a vibraphone player, a pianist, a drummer, and a couple of singers, as well as Valens on guitar and vocals. They were very unusual for the time in being a mixed-race group -- they were mostly Mexican-Americans, but there were also black and Italian members (at a time when Italians weren't considered fully white by then-prevailing racial standards) and a Japanese-American saxophone player. Their repertoire was apparently largely based around R&B songs, but they would occasionally play Mexican material, usually when requested for a particular event such as a wedding. Valens usually didn't sing on those songs, because he didn't speak Spanish, but he was eventually persuaded to sing one song in Spanish, \"La Bamba\".\n\n\"La Bamba\" is an old folk song from Veracruz in Mexico, and is an example of a style called son jarocho. The earliest known recording of “La Bamba” is from 1939, but there are suggestions it's been around for centuries:\n\n[Excerpt: El Jarocho, \"La Bamba\"]\n\nThe song is traditionally sung at weddings, and its origins are fairly obscure. I've seen claims that the song has its origins in music made by slaves in Mexico, and that the title is a reference either to the Mbamba tribe from Angola or to a seventeenth-century slave uprising called the Bambarria -- but the only references I can find to that uprising talk about how it was an inspiration for the song, and seem to differ on all the other details.\n\nAs I've said before on this podcast, I tend to doubt a lot of stories claiming that various bits of music and folklore have their origin in African traditions kept up by slaves, as the majority of such stories tend to have very little evidence backing them up, and in the case of “La Bamba” I think it's far more likely that the song, whose lyrics are mostly about a dance, is referring to the Spanish word \"bambolear\", which means to sway, swing, or wobble. Which is not to say that there's no African influence on the song -- I've talked before about how African music has influenced Central and South American musical forms, and the son jarocho tradition “La Bamba” is a part of is a mixture of Spanish, indigenous, and African styles. But I think it's safe to say that the song doesn't have a \"ring a ring a roses\" style hidden meaning (and, for that matter, nor does ring a ring a roses\" in reality) and that it is what it sounds like -- a song about a dance, with nonsense lyrics thrown in.\n\nWhen the Silhouettes played the song, they did it more or less the same way everyone else at the time would play it. There are no recordings of the Silhouettes, but they likely based their performance on a successful recording of the song like the version by Hermanos Huesca:\n\n[Excerpt: Hermanos Huesca, \"La Bamba\"]\n\nThe Silhouettes built up quite a local following, and in January 1958 they played a show that they promoted themselves, in a hall they'd rented out in order to raise money to pay for Valens' family's mortgage payment for that month. One of the people who attended the show was a twenty-year-old from the area named Doug Macchia, who vaguely knew a couple of the band members.\n\nMacchia was, at the time, employed by Bob Keane. We've not mentioned Keane himself before, but we have mentioned one of the labels he owned, Keen Records, which was the label on which he'd released Sam Cooke's \"You Send Me\":\n\n[Excerpt: Sam Cooke, \"You Send Me\"]\n\nMany of the people involved in that record, like guitarist René Hall and drummer Earl Palmer, had worked with many of the Specialty acts that Valens admired, and Keane had started employing them on a regular basis, both on Keen Records and on his new label, Del-Fi.\n\nMacchia recorded the Silhouettes at the gig on a portable tape recorder, and took the recording (which is now lost) to Keane, who was impressed enough with Valens, though not with the other members, that he requested that they come to audition for him in his home recording studio. Valens was at first reluctant to go to the audition when Macchia told him about it, and he also delayed the audition, because when Macchia came round Valens was minding the other children at home and had to wait until his mother got back before he could go to the studio.\n\nWhile he was waiting, Macchia helped Valens finish up a song he was working on, which he named after a girl with whom he'd been having some sort of relationship (people differ on whether it was just a crush he had or whether they were in some great doomed romance):\n\n[Excerpt: Ritchie Valens, \"Donna\"]\n\nWhen it came to the audition, Keane was impressed with Valens, not because of his ability, but because of his energy. Keane signed him, and started shaping him into a new style of performer.\n\nValens was not a particularly proficient guitarist. He had a lot of natural skill, and a love of the instrument, but when he first started recording he could only play in a handful of keys. Almost everything he recorded is in the key of D or A, and had only three or four chords. When he recorded one song and needed to drop the key down to D flat, he ended up tuning his guitar down half a step, because he didn't know the chords in that key -- and on another occasion, when he was trying to tell the bass player on a session what part to play, he became frustrated because the part he could hear in his head had a low D, but the bass only goes down as far as a low E.\n\nHe would rarely play the same song the same way twice, and most of the recordings he completed were pulled together by Bob Keane from multiple takes -- the tapes were spliced so much that Stan Ross, the co-owner of Gold Star Studios, described them as \"looking like they'd been through World War Fourteen\". Valens would go into the studio with a rough idea for a melody and a few words, and improvise several different variations on the song, and the best bits of each improvisation would be used for the finished recording.\n\nAccording to at least some sources, Bob Keane would shape the actual song during the recording and in the edit, helping Valens finish the lyrics and editing together bits of different performances to make a coherent song out of them. Other sources, including Ross, say that wasn't the case and that Valens essentially produced his own sessions and wrote all the material himself. I actually lean towards Keane's claims in this case, because Keane was one of the few record company owners who was himself an accomplished musician, being a fairly respectable jazz clarinettist, and Valens seems to have had a very laissez-faire attitude towards structure.\n\nMembers of the Silhouettes have talked about Valens' performances on stage, where he would start out playing, for example, \"Jenny Jenny\" by Little Richard, but after a few lines, he would start improvising his own new melody and lyrics, which would be different every time. This seems to back up Bob Keane's claims that Valens would only bring in a four or eight-bar riff and a few lines of lyric and improvise the rest in performances which Keane would shape. The most obvious example of Valens working this way is the song \"Ooh My Head\", a song that's credited as a solo Valens composition. Listen to Valens' song:\n\n[Excerpt: Ritchie Valens, \"Ooh My Head\"]\n\nAnd now compare Little Richard's earlier \"Ooh! My Soul\":\n\n[Excerpt: Little Richard, \"Ooh! My Soul!\"]\n\nYou can see that Valens' song seems to have come from precisely this process, of performing someone else's song and changing it around until it became something different, though in this case not all that different.\n\nAmusingly, Led Zeppelin later did exactly the same thing with Valens' song, resulting in \"Boogie With Stu\":\n\n[Excerpt: Led Zeppelin, \"Boogie With Stu\"]\n\nWhile Little Richard never sued over his song being appropriated by Valens, Bob Keane, who owned the publishing for Valens' songs, did sue Led Zeppelin for that one, even though they had tried to forestall the possibility of a lawsuit by crediting Valens' mother as a co-writer.\n\nSo it seems safe to say that Valens' music was largely spontaneous, to the extent that even after the recording had gone out, he would change the song dramatically in live performance. Compare, for example, the studio version of \"Come On Let's Go\":\n\n[Excerpt: Ritchie Valens, \"Come On Let's Go\"]\n\nWith this recording of him performing the song live at his old junior high school after it had already become a hit:\n\n[Excerpt: Ritchie Valens, \"Come On Let's Go (live at Pacoima Junior High School)\"]\n\nAs you can hear, the basic structure of the song remains the same, but there are huge variations in both the lyrics and the melody.\n\nAt the time of his audition, Valens still thought of himself as primarily an R&B singer, and he was being referred to as \"the Little Richard of the Valley\", but Keane had other ideas. Keane didn't believe that anyone other than black people could make good R&B music, and while Valens would record R&B songs as album tracks -- he'd record both \"Bony Moronie\" by Larry Williams and \"Framed\" by the Robins -- Keane was more interested in emphasising the Latin sound of Valens' music.\n\nHappily for Keane, Valens' relatively limited guitar playing skills allowed him to do just that. Most R&B and rock and roll of the time was based on a handful of different chord sequences, of which the most common was the twelve-bar blues. The twelve-bar blues has only three chords in, which are the first, fourth, and fifth chords of the major scale. You play four bars of the first, two bars of the fourth, two more of the first, then one each of the fifth and fourth, and two more of the first, like this:\n\n[demonstrates twelve-bar blues on guitar]\n\nA lot of Latin music uses those same three chords, just arranged in different ways. For example, there's what's known as the I-IV-V-I progression:\n\n[demonstrates on guitar]\n\nThat's the basis of quite a few Latin songs, and it also became the basis of the first record Valens released, \"Come On Let's Go\":\n\n[Excerpt: Ritchie Valens, \"Come On Let's Go\"]\n\n\"Come On Let's Go\" was recorded along with its B-side, a cover of \"Framed\" by the Robins, by Valens at Gold Star studios backed by a group of session musicians who would become regulars on his sessions. The union documents for the sessions are not available, so there's some question as to exactly who played on which recordings, but they would usually involve Rene Hall, Bill Pitman, and/or Carol Kaye on guitar along with Valens himself, Red Callender or Buddy Clarke on standup bass, Earl Palmer on drums, and Ernie Freeman on piano. Sometimes one of the guitarists would instead play a Danelectro bass -- a six-string bass guitar with a unique tone that became a signature of many records made in LA. Many of these musicians would later go on to be important parts of the Wrecking Crew, the informal collective of session musicians who played on a huge number of hit records made in LA in the sixties.\n\n\"Come On Let's Go\" was a minor hit, reaching number forty-two on the Hot One Hundred. This was enough to prove to Keane that his instincts were right -- if he pushed Valens into a Latin rock sound, he could have a big star on his hands. He just needed some more material in that style. And he found the next single by accident, when he heard Valens noodling \"La Bamba\" on his guitar in the back seat of Keane's car.\n\nKeane insisted that that should be Valens' next single, but Valens was very hesitant. He considered the song to be an important part of his family's culture, and didn't want to be accused of selling out his cultural background for a cheap hit. Keane thought that was ridiculous, though personally I have a lot more sympathy with Valens' problem.\n\nValens was also worried about his Spanish -- he basically didn't speak Spanish at all, and he originally thought it might be an idea to get his aunt to help him translate the lyrics into English and sing those. But eventually it was decided that he'd just sing it in the original Spanish, and he got his aunt to write down as many of the lyrics as she could remember, and learned them phonetically. While Valens normally could only sing while playing his guitar, this time he recorded the vocal as an overdub, apparently with Bob Keane standing behind him whispering the lyrics to him.\n\nThe arrangement was very different from any earlier versions of the song, and the result was the first record to successfully meld Latin and rock and roll styles into one coherent whole:\n\n[Excerpt: Ritchie Valens, \"La Bamba\"]\n\nFor the B-side, Keane wanted something that could be a throwaway, so as not to distract from the A-side, and so he just got the musicians to overdub onto the original demo of \"Donna\" that Valens had recorded in his basement:\n\n[Excerpt: Ritchie Valens, \"Donna\"]\n\nAs it turned out, \"Donna\" became the bigger hit -- \"Donna\" reached number two on the charts, while \"La Bamba\" only reached number twenty-two. But \"La Bamba\" is the record that became far more influential.\n\n\"La Bamba\" has another three-chord sequence, based around those same three chords, but in yet another order. This one is known as the three-chord trick, and goes I-IV-V-IV, like this:\n\n[Demonstrates I-IV-V-IV on guitar]\n\n\"La Bamba\" wasn't the first rock and roll record to use that pattern -- there are only a small number of patterns that one can make out of the same three chords, and in particular Chuck Berry had recorded \"Havana Moon\" a year earlier, and that song would itself go on to be particularly influential. But \"La Bamba\" definitely was the one that inspired a *lot* of other records to use the same pattern, and one can hear the distinctly Latin echoes of it in records like \"Hang on Sloopy\":\n\n[Excerpt: The McCoys, \"Hang on Sloopy\"]\n\nor \"Twist and Shout\":\n\n[Excerpt: The Isley Brothers, \"Twist and Shout\"]\n\nBetween that and the influence of \"Havana Moon\" on records like \"Louie Louie\" and \"Wild Thing\", the three-chord trick became one of the most important chord sequences in rock music, and \"La Bamba\" was the first record to make that chord sequence popular, and inspired thousands of garage bands.\n\nOn the back of the success of \"La Bamba\" and \"Donna\", Valens appeared in the Alan Freed film \"Go Johnny Go\", which featured Chuck Berry, Eddie Cochran, the Flamingos and Jackie Wilson. Valens performed \"Ooh My Head\", and also appeared in several scenes of the film, but had no lines, as the musical performers weren't being paid, as the film was considered to be promotion for them, while anyone who had a line was considered an actor and had to be paid.\n\nThat film was the last major piece of work that Valens did before he headed off for what would be his last tour, which we'll talk about next week, when we look at the last recording Buddy Holly released in his lifetime.",
  "itunes:subtitle": "Episode seventy-three of A History of Rock Music in Five Hundred Songs looks at La Bamba by Ritchie Valens, and is the first of a two-part story which will conclude next week with an episode on Buddy Holly. Click the full post to read liner notes, links ",
  "itunes:keywords": "Bob Keane,Del-Fi Records,Earl Palmer,folk music,Gold Star Studios,Keen Records,lawsuits,Led Zeppelin,Ritchie Valens,The Wrecking Crew",
  "itunes:episodeType": "full",
  "itunes:episode": 73,
  "content:encoded": "Episode seventy-three of A History of Rock Music in Five Hundred Songs looks at \"La Bamba\" by Ritchie Valens, and is the first of a two-part story which will conclude next week with an episode on Buddy Holly. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/34728238\">on \"Kansas City\" by Wilbert Harrison</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-73-la-bamba/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nOnly one biography of Valens has ever been written -- understandably since his public career lasted a matter of months and he died when he was seventeen -- but <a href=\"https://amzn.to/2IyQVuU\">Beverly Mendheim's book</a> is about as good as one could expect given that.\n\nAnd <a href=\"https://amzn.to/39BzlSR\">this CD</a> compiles all three of the posthumous album releases, Valens' entire musical legacy.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nThis is actually going to be part one of a two-part story, which will be continued in next week's episode. Ritchie Valens died so young that he is nowadays mostly known for his death, but in this episode we're going to look at why people cared about him at all -- the story of the plane crash that took his life will wait for next week's episode. This week, we're going to look at his short recording career, and at his most famous record:\n\n[Excerpt: Ritchie Valens, \"La Bamba\"]\n\nSo far in this podcast, when we've looked at race, we've mostly dealt with either black or white musicians, along with a few people who are clearly white by the standards of 2020 but might not have been considered so at the time.\n\nBut there was, in Los Angeles, a whole parallel music culture growing up around Latino teenagers. This subculture only rarely impinged on the consciousness of the wider American public, but without it we would have had no garage rock and no punk, as we know them today. And the first big star, the person around whom that culture coalesced, was Ritchie Valens.\n\nNow, I have to stress here that I am at even more of a disadvantage when talking about this subculture than I am when talking about black America. While black culture has been extensively documented in all sorts of other popular culture I've consumed, and I've studied mid-twentieth-century black American culture to a reasonable extent (though nowhere near enough, of course, that my thoughts on the subject should be taken as authoritative), I have had almost no exposure to the Latino culture of the same time period.\n\nAnd on top of that, there's an additional problem, which is that I am going to have to refer to quite a few Spanish terms in the course of this episode, and I don't speak Spanish. While I'm going to try my best with those, I will undoubtedly mangle some things.\n\nBut that's sort of appropriate, at least, in the case of Ritchie Valens, because one of the things that people who knew him would say is that he spoke Spanish terribly -- while he was a Mexican-American, he was raised in an English-speaking household, and only spoke Spanish as a second language, in which he wasn't especially fluent.\n\nBy all accounts, in fact, Valens -- who was born Richard Valenzuela, but had his name shortened when he got a record deal -- was at least somewhat unpopular among the other Mexican-Americans at his school. Some of this was due to his appearance -- he was notably light-skinned for a Mexican-American, and apparently there was a level of colourism among Latino kids in that area at that time, and he was also quite fat -- and some was due to his willingness to associate with people of other races, as he had both black and white friends.\n\nValens' big interest in school was music, especially R&B, and especially the music of Little Richard and Larry Williams, and other people who had recorded for Specialty Records. When he was in high school, he joined a group called the Silhouettes, who had named themselves after a recent hit of that name by the Rays:\n\n[Excerpt: The Rays, \"Silhouettes\"]\n\nThat song was also the inspiration for another group, a doo-wop group also called the Silhouettes, who had a hit with \"Get a Job\". That's not this group, and they weren't yet known at the time.\n\nThese Silhouettes never recorded, and after Valens became famous there were a lot of interviews with various members of the band who disagreed, of course, on who it was who invited Valens into the band, who the leader of the band was, and who had really taught Valens everything he knew about performing, as well as disagreeing on what songs the band performed, and who contributed what to the songs that made Valens famous.\n\nThe Silhouettes were by modern standards a very big band, having three trumpets, five saxophones, a vibraphone player, a pianist, a drummer, and a couple of singers, as well as Valens on guitar and vocals. They were very unusual for the time in being a mixed-race group -- they were mostly Mexican-Americans, but there were also black and Italian members (at a time when Italians weren't considered fully white by then-prevailing racial standards) and a Japanese-American saxophone player. Their repertoire was apparently largely based around R&B songs, but they would occasionally play Mexican material, usually when requested for a particular event such as a wedding. Valens usually didn't sing on those songs, because he didn't speak Spanish, but he was eventually persuaded to sing one song in Spanish, \"La Bamba\".\n\n\"La Bamba\" is an old folk song from Veracruz in Mexico, and is an example of a style called son jarocho. The earliest known recording of “La Bamba” is from 1939, but there are suggestions it's been around for centuries:\n\n[Excerpt: El Jarocho, \"La Bamba\"]\n\nThe song is traditionally sung at weddings, and its origins are fairly obscure. I've seen claims that the song has its origins in music made by slaves in Mexico, and that the title is a reference either to the Mbamba tribe from Angola or to a seventeenth-century slave uprising called the Bambarria -- but the only references I can find to that uprising talk about how it was an inspiration for the song, and seem to differ on all the other details.\n\nAs I've said before on this podcast, I tend to doubt a lot of stories claiming that various bits of music and folklore have their origin in African traditions kept up by slaves, as the majority of such stories tend to have very little evidence backing them up, and in the case of “La Bamba” I think it's far more likely that the song, whose lyrics are mostly about a dance, is referring to the Spanish word \"bambolear\", which means to sway, swing, or wobble. Which is not to say that there's no African influence on the song -- I've talked before about how African music has influenced Central and South American musical forms, and the son jarocho tradition “La Bamba” is a part of is a mixture of Spanish, indigenous, and African styles. But I think it's safe to say that the song doesn't have a \"ring a ring a roses\" style hidden meaning (and, for that matter, nor does ring a ring a roses\" in reality) and that it is what it sounds like -- a song about a dance, with nonsense lyrics thrown in.\n\nWhen the Silhouettes played the song, they did it more or less the same way everyone else at the time would play it. There are no recordings of the Silhouettes, but they likely based their performance on a successful recording of the song like the version by Hermanos Huesca:\n\n[Excerpt: Hermanos Huesca, \"La Bamba\"]\n\nThe Silhouettes built up quite a local following, and in January 1958 they played a show that they promoted themselves, in a hall they'd rented out in order to raise money to pay for Valens' family's mortgage payment for that month. One of the people who attended the show was a twenty-year-old from the area named Doug Macchia, who vaguely knew a couple of the band members.\n\nMacchia was, at the time, employed by Bob Keane. We've not mentioned Keane himself before, but we have mentioned one of the labels he owned, Keen Records, which was the label on which he'd released Sam Cooke's \"You Send Me\":\n\n[Excerpt: Sam Cooke, \"You Send Me\"]\n\nMany of the people involved in that record, like guitarist René Hall and drummer Earl Palmer, had worked with many of the Specialty acts that Valens admired, and Keane had started employing them on a regular basis, both on Keen Records and on his new label, Del-Fi.\n\nMacchia recorded the Silhouettes at the gig on a portable tape recorder, and took the recording (which is now lost) to Keane, who was impressed enough with Valens, though not with the other members, that he requested that they come to audition for him in his home recording studio. Valens was at first reluctant to go to the audition when Macchia told him about it, and he also delayed the audition, because when Macchia came round Valens was minding the other children at home and had to wait until his mother got back before he could go to the studio.\n\nWhile he was waiting, Macchia helped Valens finish up a song he was working on, which he named after a girl with whom he'd been having some sort of relationship (people differ on whether it was just a crush he had or whether they were in some great doomed romance):\n\n[Excerpt: Ritchie Valens, \"Donna\"]\n\nWhen it came to the audition, Keane was impressed with Valens, not because of his ability, but because of his energy. Keane signed him, and started shaping him into a new style of performer.\n\nValens was not a particularly proficient guitarist. He had a lot of natural skill, and a love of the instrument, but when he first started recording he could only play in a handful of keys. Almost everything he recorded is in the key of D or A, and had only three or four chords. When he recorded one song and needed to drop the key down to D flat, he ended up tuning his guitar down half a step, because he didn't know the chords in that key -- and on another occasion, when he was trying to tell the bass player on a session what part to play, he became frustrated because the part he could hear in his head had a low D, but the bass only goes down as far as a low E.\n\nHe would rarely play the same song the same way twice, and most of the recordings he completed were pulled together by Bob Keane from multiple takes -- the tapes were spliced so much that Stan Ross, the co-owner of Gold Star Studios, described them as \"looking like they'd been through World War Fourteen\". Valens would go into the studio with a rough idea for a melody and a few words, and improvise several different variations on the song, and the best bits of each improvisation would be used for the finished recording.\n\nAccording to at least some sources, Bob Keane would shape the actual song during the recording and in the edit, helping Valens finish the lyrics and editing together bits of different performances to make a coherent song out of them. Other sources, including Ross, say that wasn't the case and that Valens essentially produced his own sessions and wrote all the material himself. I actually lean towards Keane's claims in this case, because Keane was one of the few record company owners who was himself an accomplished musician, being a fairly respectable jazz clarinettist, and Valens seems to have had a very laissez-faire attitude towards structure.\n\nMembers of the Silhouettes have talked about Valens' performances on stage, where he would start out playing, for example, \"Jenny Jenny\" by Little Richard, but after a few lines, he would start improvising his own new melody and lyrics, which would be different every time. This seems to back up Bob Keane's claims that Valens would only bring in a four or eight-bar riff and a few lines of lyric and improvise the rest in performances which Keane would shape. The most obvious example of Valens working this way is the song \"Ooh My Head\", a song that's credited as a solo Valens composition. Listen to Valens' song:\n\n[Excerpt: Ritchie Valens, \"Ooh My Head\"]\n\nAnd now compare Little Richard's earlier \"Ooh! My Soul\":\n\n[Excerpt: Little Richard, \"Ooh! My Soul!\"]\n\nYou can see that Valens' song seems to have come from precisely this process, of performing someone else's song and changing it around until it became something different, though in this case not all that different.\n\nAmusingly, Led Zeppelin later did exactly the same thing with Valens' song, resulting in \"Boogie With Stu\":\n\n[Excerpt: Led Zeppelin, \"Boogie With Stu\"]\n\nWhile Little Richard never sued over his song being appropriated by Valens, Bob Keane, who owned the publishing for Valens' songs, did sue Led Zeppelin for that one, even though they had tried to forestall the possibility of a lawsuit by crediting Valens' mother as a co-writer.\n\nSo it seems safe to say that Valens' music was largely spontaneous, to the extent that even after the recording had gone out, he would change the song dramatically in live performance. Compare, for example, the studio version of \"Come On Let's Go\":\n\n[Excerpt: Ritchie Valens, \"Come On Let's Go\"]\n\nWith this recording of him performing the song live at his old junior high school after it had already become a hit:\n\n[Excerpt: Ritchie Valens, \"Come On Let's Go (live at Pacoima Junior High School)\"]\n\nAs you can hear, the basic structure of the song remains the same, but there are huge variations in both the lyrics and the melody.\n\nAt the time of his audition, Valens still thought of himself as primarily an R&B singer, and he was being referred to as \"the Little Richard of the Valley\", but Keane had other ideas. Keane didn't believe that anyone other than black people could make good R&B music, and while Valens would record R&B songs as album tracks -- he'd record both \"Bony Moronie\" by Larry Williams and \"Framed\" by the Robins -- Keane was more interested in emphasising the Latin sound of Valens' music.\n\nHappily for Keane, Valens' relatively limited guitar playing skills allowed him to do just that. Most R&B and rock and roll of the time was based on a handful of different chord sequences, of which the most common was the twelve-bar blues. The twelve-bar blues has only three chords in, which are the first, fourth, and fifth chords of the major scale. You play four bars of the first, two bars of the fourth, two more of the first, then one each of the fifth and fourth, and two more of the first, like this:\n\n[demonstrates twelve-bar blues on guitar]\n\nA lot of Latin music uses those same three chords, just arranged in different ways. For example, there's what's known as the I-IV-V-I progression:\n\n[demonstrates on guitar]\n\nThat's the basis of quite a few Latin songs, and it also became the basis of the first record Valens released, \"Come On Let's Go\":\n\n[Excerpt: Ritchie Valens, \"Come On Let's Go\"]\n\n\"Come On Let's Go\" was recorded along with its B-side, a cover of \"Framed\" by the Robins, by Valens at Gold Star studios backed by a group of session musicians who would become regulars on his sessions. The union documents for the sessions are not available, so there's some question as to exactly who played on which recordings, but they would usually involve Rene Hall, Bill Pitman, and/or Carol Kaye on guitar along with Valens himself, Red Callender or Buddy Clarke on standup bass, Earl Palmer on drums, and Ernie Freeman on piano. Sometimes one of the guitarists would instead play a Danelectro bass -- a six-string bass guitar with a unique tone that became a signature of many records made in LA. Many of these musicians would later go on to be important parts of the Wrecking Crew, the informal collective of session musicians who played on a huge number of hit records made in LA in the sixties.\n\n\"Come On Let's Go\" was a minor hit, reaching number forty-two on the Hot One Hundred. This was enough to prove to Keane that his instincts were right -- if he pushed Valens into a Latin rock sound, he could have a big star on his hands. He just needed some more material in that style. And he found the next single by accident, when he heard Valens noodling \"La Bamba\" on his guitar in the back seat of Keane's car.\n\nKeane insisted that that should be Valens' next single, but Valens was very hesitant. He considered the song to be an important part of his family's culture, and didn't want to be accused of selling out his cultural background for a cheap hit. Keane thought that was ridiculous, though personally I have a lot more sympathy with Valens' problem.\n\nValens was also worried about his Spanish -- he basically didn't speak Spanish at all, and he originally thought it might be an idea to get his aunt to help him translate the lyrics into English and sing those. But eventually it was decided that he'd just sing it in the original Spanish, and he got his aunt to write down as many of the lyrics as she could remember, and learned them phonetically. While Valens normally could only sing while playing his guitar, this time he recorded the vocal as an overdub, apparently with Bob Keane standing behind him whispering the lyrics to him.\n\nThe arrangement was very different from any earlier versions of the song, and the result was the first record to successfully meld Latin and rock and roll styles into one coherent whole:\n\n[Excerpt: Ritchie Valens, \"La Bamba\"]\n\nFor the B-side, Keane wanted something that could be a throwaway, so as not to distract from the A-side, and so he just got the musicians to overdub onto the original demo of \"Donna\" that Valens had recorded in his basement:\n\n[Excerpt: Ritchie Valens, \"Donna\"]\n\nAs it turned out, \"Donna\" became the bigger hit -- \"Donna\" reached number two on the charts, while \"La Bamba\" only reached number twenty-two. But \"La Bamba\" is the record that became far more influential.\n\n\"La Bamba\" has another three-chord sequence, based around those same three chords, but in yet another order. This one is known as the three-chord trick, and goes I-IV-V-IV, like this:\n\n[Demonstrates I-IV-V-IV on guitar]\n\n\"La Bamba\" wasn't the first rock and roll record to use that pattern -- there are only a small number of patterns that one can make out of the same three chords, and in particular Chuck Berry had recorded \"Havana Moon\" a year earlier, and that song would itself go on to be particularly influential. But \"La Bamba\" definitely was the one that inspired a *lot* of other records to use the same pattern, and one can hear the distinctly Latin echoes of it in records like \"Hang on Sloopy\":\n\n[Excerpt: The McCoys, \"Hang on Sloopy\"]\n\nor \"Twist and Shout\":\n\n[Excerpt: The Isley Brothers, \"Twist and Shout\"]\n\nBetween that and the influence of \"Havana Moon\" on records like \"Louie Louie\" and \"Wild Thing\", the three-chord trick became one of the most important chord sequences in rock music, and \"La Bamba\" was the first record to make that chord sequence popular, and inspired thousands of garage bands.\n\nOn the back of the success of \"La Bamba\" and \"Donna\", Valens appeared in the Alan Freed film \"Go Johnny Go\", which featured Chuck Berry, Eddie Cochran, the Flamingos and Jackie Wilson. Valens performed \"Ooh My Head\", and also appeared in several scenes of the film, but had no lines, as the musical performers weren't being paid, as the film was considered to be promotion for them, while anyone who had a line was considered an actor and had to be paid.\n\nThat film was the last major piece of work that Valens did before he headed off for what would be his last tour, which we'll talk about next week, when we look at the last recording Buddy Holly released in his lifetime.",
  "enclosure": "",
  "itunes:summary": "Episode seventy-three of A History of Rock Music in Five Hundred Songs looks at \"La Bamba\" by Ritchie Valens, and is the first of a two-part story which will conclude next week with an episode on Buddy Holly. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Kansas City\" by Wilbert Harrison.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nOnly one biography of Valens has ever been written -- understandably since his public career lasted a matter of months and he died when he was seventeen -- but Beverly Mendheim's book is about as good as one could expect given that.\n\nAnd this CD compiles all three of the posthumous album releases, Valens' entire musical legacy.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nThis is actually going to be part one of a two-part story, which will be continued in next week's episode. Ritchie Valens died so young that he is nowadays mostly known for his death, but in this episode we're going to look at why people cared about him at all -- the story of the plane crash that took his life will wait for next week's episode. This week, we're going to look at his short recording career, and at his most famous record:\n\n[Excerpt: Ritchie Valens, \"La Bamba\"]\n\nSo far in this podcast, when we've looked at race, we've mostly dealt with either black or white musicians, along with a few people who are clearly white by the standards of 2020 but might not have been considered so at the time.\n\nBut there was, in Los Angeles, a whole parallel music culture growing up around Latino teenagers. This subculture only rarely impinged on the consciousness of the wider American public, but without it we would have had no garage rock and no punk, as we know them today. And the first big star, the person around whom that culture coalesced, was Ritchie Valens.\n\nNow, I have to stress here that I am at even more of a disadvantage when talking about this subculture than I am when talking about black America. While black culture has been extensively documented in all sorts of other popular culture I've consumed, and I've studied mid-twentieth-century black American culture to a reasonable extent (though nowhere near enough, of course, that my thoughts on the subject should be taken as authoritative), I have had almost no exposure to the Latino culture of the same time period.\n\nAnd on top of that, there's an additional problem, which is that I am going to have to refer to quite a few Spanish terms in the course of this episode, and I don't speak Spanish. While I'm going to try my best with those, I will undoubtedly mangle some things.\n\nBut that's sort of appropriate, at least, in the case of Ritchie Valens, because one of the things that people who knew him would say is that he spoke Spanish terribly -- while he was a Mexican-American, he was raised in an English-speaking household, and only spoke Spanish as a second language, in which he wasn't especially fluent.\n\nBy all accounts, in fact, Valens -- who was born Richard Valenzuela, but had his name shortened when he got a record deal -- was at least somewhat unpopular among the other Mexican-Americans at his school. Some of this was due to his appearance -- he was notably light-skinned for a Mexican-American, and apparently there was a level of colourism among Latino kids in that area at that time, and he was also quite fat -- and some was due to his willingness to associate with people of other races, as he had both black and white friends.\n\nValens' big interest in school was music, especially R&B, an",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode seventy-three of A History of Rock Music in Five Hundred Songs looks at \"La Bamba\" by Ritchie Valens, and is the first of a two-part story which will conclude next week with an episode on Buddy Holly. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Kansas City\" by Wilbert Harrison.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nOnly one biography of Valens has ever been written -- understandably since his public career lasted a matter of months and he died when he was seventeen -- but Beverly Mendheim's book is about as good as one could expect given that.\n\nAnd this C",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}