{
  "title": "24: Episode 24",
  "link": "https://audioboom.com/posts/7336364",
  "itunes:episode": 24,
  "itunes:title": "Episode 24",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3781,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On our January 23rd, 2006 edition of MuggleCast…<br>\n<br>\n\n</div>\n<div>Boarhounds. Acromantulas. Hippogriffs. Dragons. Hellhounds. Is Hagrid’s understanding of magical creatures a reflection of how others misunderstand him? While his lack of magical training could be an issue, could his knowledge of Tom Riddle prove useful in the Final Book? And just why has Jo kept him around for so long? All those close to Harry throughout the series have met an untimely demise.<br>\n<br>\n\n</div>\n<ul>\n<li>Ciaran guest hosts</li>\n<li>Andrew occasionally sounds like a robot because of a glitch with his mic</li>\n<li>We got the scoop on John Noe’s first days in his college dorm</li>\n<li>Main Topic: Rubeus Hagrid</li>\n<li>Why does he have a love for magical and usually dangerous creatures?</li>\n<li>We discuss his training as a wizard</li>\n<li>What happened with Hagrid the night of Voldemort’s demise?</li>\n<li>Where’s the motorcycle?</li>\n<li>How much does Hagrid know about Tom Riddle?</li>\n<li>We explore his parentage and his relationship with Grawp</li>\n<li>Why has JKR kept him alive and what role will he play in Book 7?</li>\n<li>Will he survive Book 7?</li>\n<li>Where did he go after his expulsion from school?</li>\n<li>How much does Hagrid know about the grounds at Hogwarts?</li>\n<li>Has Robbie Coltrane done a good job portraying everyone’s favorite half-giant?</li>\n<li>What does being the Keeper of the Keys actually mean?</li>\n<li>Can Hagrid become Headmaster or is it more likely he’ll end up Head of Gryffindor?</li>\n<li>Is Ginny a Horcrux?</li>\n<li>Did fake Moody’s foe glass show us something important?</li>\n<li>Did Snape use Occlumency on the Astronomy Tower?</li>\n<li>Dueling Club: Arthur vs. Lucius and Hermione vs. Ginny</li>\n<li>Interview with Luna Lovegood hopeful who made it to the second round</li>\n<li>Ciaran’s Irish Joke of the Day</li>\n<li>Next week’s discussion: Ron Weasley</li>\n</ul>\n",
  "pubDate": "Mon, 23 Jan 2006 00:00:00 +0000",
  "guid": "tag:audioboom.com,2019-08-08:/posts/7336364",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}