{
  "id": "yt:video:RbSJdfkA0Is",
  "yt:videoId": "RbSJdfkA0Is",
  "yt:channelId": "UC3WoPalcYf7d_x4DC2BXAfw",
  "title": "Modern Warfare 2 looks better than real life",
  "link": "",
  "author": {
    "name": "jayvee",
    "uri": "https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw"
  },
  "published": "2022-10-24T15:00:28+00:00",
  "updated": "2022-10-27T22:49:23+00:00",
  "media:group": {
    "media:title": "Modern Warfare 2 looks better than real life",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "why do i keep buying the same game every year\n\nSubscribe to jayveeonYT for more videos!\n► ​https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw?sub_confirmation=1\n\nWatch more videos on jayveeonYT! \n► https://youtube.com/playlist?list=PLGdQpBjWmxqVuXKKNVcccm81dpDwsJPvH\n\n- - - - - - - - - - - - - - - -\n\nFollow jayveeonYT!\n► Twitter: https://twitter.com/jayveeonYT​\n► Discord: https://discord.gg/jayveeonyt\n► Instagram: https://www.instagram.com/jayvee.yt/​\n\nWatch More jayveeonYT!\nLatest Uploads:  \n\nSo I ranked ALL the AC games...\n► https://youtu.be/Z9_Tb_TcPYI\n\nSo I played AC Rogue in 2021...\n► https://youtu.be/LUmOm2whuvY\n\nSo I played AC Syndicate in 2021...\n► https://youtu.be/swJN5NO2gJ8\n\nSo I played AC Unity in 2021...\n► https://youtu.be/UjTt4KtAZO8\n\nSo I played AC Odyssey in 2021…\n► https://youtu.be/guMObmtv54s\n\n- - - - - - - - - - - - - - - -\n\nAbout jayveeonYT:\nNews, reactions, and gameplay of all the biggest RPGs, open world, and action-adventure video games! Jayvee covers Assassin's Creed, Cyberpunk, Fallout, and more!\n\n- - - - - - - - - - - - - - - -\n\nCall of Duty: Modern Warfare II is an upcoming first-person shooter game developed by Infinity Ward and published by Activision. It is a direct sequel to the 2019 reboot, and will serve as the nineteenth installment in the overall Call of Duty series.[2] It is scheduled to be released on October 28, 2022,[3] for PlayStation 4, PlayStation 5, Windows, Xbox One, and Xbox Series X/S.\n\nModern Warfare II brings several new improvements and changes to the series gameplay, such as advanced AI systems in the campaign and co-op modes, water physics, and swimming mechanics, as well as an overhauled vehicle system. New gameplay features and movement tactics include dive to prone, mantle, and ledge hang along with the removal of slide canceling. New vehicle gameplay features include leaning out of vehicle windows, mantling onto a vehicle roof, and hijacking.[4][5][6][7][8] The levelling and Gunsmith system has been revamped, allowing players to fine-tune specific attachments to suit their playstyles. It also offers weapon platforms that branch progression to reduce repetitiveness, as well as featuring a firing range for practice.[9][10][11][12]\n\nModern Warfare II multiplayer features several new game modes: Knockout, where two teams attempt to capture a package with limited lives; and Prisoner Rescue, where an attacking team attempts to extract a hostage while a defending team prevents them by fortifying defenses around the hostage.[13] Third person game modes were confirmed in September along with an undetailed 3v3 Raid game mode.[14] The cooperative Special Ops mode is also confirmed to return, featuring 2-player missions.[15][16]\n\n#gaming #jayvee #callofduty",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}