{
  "id": "yt:video:NifBVOeVdO0",
  "yt:videoId": "NifBVOeVdO0",
  "yt:channelId": "UCweDKPSF65wRw5VHFUJYiow",
  "title": "The Evolution of Speculative Evolution",
  "link": "",
  "author": {
    "name": "Curious Archive",
    "uri": "https://www.youtube.com/channel/UCweDKPSF65wRw5VHFUJYiow"
  },
  "published": "2022-06-23T18:30:27+00:00",
  "updated": "2022-07-05T13:17:42+00:00",
  "media:group": {
    "media:title": "The Evolution of Speculative Evolution",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Speculative Evolution is everywhere. But how did it begin? A breakdown of the incredible history of my favorite genre…\n---\nFollow Curious Archive:\nTwitter: https://twitter.com/Curious_Archive\nInstagram: https://www.instagram.com/CuriousArchive\n\nThumbnail Art - Interfacefive: https://www.deviantart.com/interfacefive\n\nSpeculative Evolution or Speculative Biology can be defined as a genre focused on hypothetical scenarios in the evolution of life.\n\nToday, Speculative Evolution is everywhere — from Subnautica, to Humanity Lost, to the Birrin, to After Man, to All Tomorrows, to any of the hundreds of amazing online projects that explore worlds beyond our own. But… how did we get here? Interest in the biology of fictional life wasn’t always so widespread. Monsters from ancient myth weren’t typically of thought to be part of an ecosystem, they just kind of… existed. The origin and rise of Speculative Evolution as we know it today is a fascinating tale — deeply intertwined with scientific advancement, and full of unexpected twists.\n\nSo, for this special anniversary entry into the archive, I’ll give you the full tour of this genre’s incredible history, and reveal the ‘evolution’ of Speculative Evolution…\n\n0:00 Evolution of Speculative Evolution\n1:02 The Time Machine\n4:03 Life on Mars\n5:54 Visitors from Beyond!\n8:32 The Snouters\n10:37 After Man \n13:00 Age of Docufiction\n15:29 All Tomorrows\n17:02 The Birrin and Beyond\n18:27 A Bright Future...\n\nCopyright Disclaimer: Under section 107 of the Copyright Act 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education, and research. All video/image content is edited under fair use rights for reasons of commentary.\n\nI do not own the images, music, or footage used in this video. All rights and credit goes to the original owners.\n\n♫ Music by Kevin MacLeod (incompetech.com): \nBeauty Flow, Firesong, Impact Lento, Majestic Hills, Bittersweet, Floating Cities\nLicensed under Creative Commons: By Attribution 3.0\n\n#CuriousArchive #SpeculativeBiology #SpeculativeEvolution",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}