{
  "id": "tag:blogger.com,1999:blog-4446292666398344382.post-8755894950917243520",
  "published": "2016-01-31T14:31:00.000-08:00",
  "updated": "2017-01-27T17:49:39.613-08:00",
  "category": "",
  "title": "The Future has more Co-authors",
  "content": "Here's something to noodle on while you finalize your ICML submissions.<br /><br />Have you ever heard of <a href=\"https://en.wikipedia.org/wiki/Max_Martin\">Max Martin</a>?  You probably haven't, which is something considering he (currently) has 21 #1 hits in the United States.  Lennon (26) and McCartney (32) have more, but Max Martin has the advantage of still being alive to catch up.  A phenomenal genius, right?  Well, yes, but if you look at his material he always has co-authors, usually several.  <a href=\"http://www.newyorker.com/culture/cultural-comment/blank-space-what-kind-of-genius-is-max-martin\">His process</a> is highly collaborative, as he manages a constellation of young songwriting talent which he nurtures like a good advisor does grad students and post-docs.  In the increasingly winner-take-all dynamics of pop music, it's better to write a #1 song with 5 people then to write a #20 song by yourself. <br /><br />I think Machine Learning is headed in this direction.  Already in Physics pushing the envelope experimentally involves <a href=\"http://www.sciencedirect.com/science/article/pii/S037026931200857X\">an astonishing number of co-authors</a>.  Presumably Physics theory papers have fewer co-authors, but since <a href=\"https://www.quora.com/What-particles-have-been-predicted-by-the-Standard-Model-but-not-observed\">the standard model is too damn good</a>, in order to make real progress some amazingly difficult experimental work is required. <br /><br />Now consider an historic recent achievement: <a href=\"http://www.nature.com/nature/journal/v529/n7587/full/nature16961.html\">conquering Go</a>.  That paper has 20 authors.  Nature papers are a big deal, so presumably everybody is trying to attribute fairly and this leads to a long author list: nonetheless, there is no denying that this achievement required many people working together, with <a href=\"http://www.nature.com/nature/journal/v529/n7587/full/nature16961.html#contrib-auth\">disparate skills</a>.   I think the days where Hastie and Tibshirani can just crush it by themselves, like Lennon and McCartney in their day, are over.  People with the right theoretical ideas to move something forward in, e.g., reinforcement learning are still going to need a small army of developers and systems experts to build the tools necessary.<br /><br />So here's some advice to any young aspiring academics out there envisioning a future Eureka moment alone at a white-board: if you want to be relevant, pair up with as many talented people as you can.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Paul Mineiro",
    "uri": "http://www.blogger.com/profile/05439062526157173163",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 2
}