{
  "id": "tag:blogger.com,1999:blog-2499715909956774229.post-7134298461730415449",
  "published": "2020-08-30T12:31:00.000-07:00",
  "updated": "2020-08-30T12:31:08.293-07:00",
  "title": "Sorry You're Let Down By the Fed's Monetary Policy Review",
  "content": "<p>On Thursday, the FOMC released a revised&nbsp;<a href=\"https://www.federalreserve.gov/monetarypolicy/files/FOMC_LongerRunGoals.pdf\">Statement of Longer Run Goals and Monetary Policy Strategy</a>, and Jay Powell&nbsp;<a href=\"https://www.federalreserve.gov/newsevents/speech/powell20200827a.htm\">made a speech</a>&nbsp;at the virtual Jackson Hole conference, explaining the changes in the FOMC's approach. The new statement is rather murky, though that's of course nothing new in the world of fedspeak. Why did the FOMC think these changes were needed, and what will they imply for monetary policy going forward?</p><p>We'll start with the statement itself. This document originated in 2012, and at the time was a venue for Ben Bernanke to set down an inflation-targeting goal consistent with the Fed's Congressional dual mandate. Subsequently, the FOMC revisited the Statement annually (more or less), and published revised versions every January. Those previous changes were fairly minor tweaks to the document. Revisions tend to be produced after rounds of haggling among FOMC members, which end when consensus is reached. As a result the document reads like what it is - the work of a committee. Individual words and sentences have been put in to appease one or another faction of the committee, and the result tends to be something that no one likes much. But they will hold their noses and agree to it.You might find it useful to read the&nbsp;<a href=\"https://www.federalreserve.gov/monetarypolicy/guide-to-changes-in-statement-on-longer-run-goals-monetary-policy-strategy.htm\">annotated version</a>, as it shows you all the changes from the last published Statement.</p><p>In the second paragraph of the new Statement, an important new element is a recognition of the role played by low real interest rates (low r*, in fedspeak) in monetary policymaking. You might wonder why that's in there, as it's not apparent what that has to do with stating the FOMC's objectives. First, the Statement says</p><blockquote><p>The Committee judges that the level of the federal funds rate consistent with maximum employment and price stability over the longer run has declined relative to its historical average.</p></blockquote><p>That's just recognition that, over the long run, if the real interest rate is lower, and the inflation target stays at a fixed 2%, this implies a lower average fed funds rate, by the logic of Irving Fisher. The fed funds rate will then more frequently encounter the zero lower bound (ZLB), under the assumption that nominal interest rate variability is about what it was in the past. The conclusion?&nbsp;</p><blockquote><p>&nbsp;...the Committee judges that downward risks to employment and inflation have increased.</p></blockquote><p>I've seen that idea frequently, both in research done at the Board, and public statements by Fed officials. The reasoning comes from Keynesian economics. In a Keynesian world, the zero lower bound is a constraint on policy, and there's a Phillips curve. Nominal interest rate reductions make output and inflation go up, according to Keynesian logic, so if the nominal rate hits the ZLB, the central bank can't increase output and inflation as appropriate. So, if the Fed is encountering the ZLB more frequently, it's running into that problem more frequently, by Keynesian logic. So average inflation and output could on average be too low. But, you might wonder how that's consistent with the previous quote, which says that low r* implies a low average fed funds rate. If inflation and output are on average too low, it seems we could raise the average fed funds rate, have inflation closer to target on average, and have higher average output as we're encountering the ZLB less often.</p><p>But, again, what is the discussion about low r* doing in the Statement? Is this just providing cover for the possibility that the Fed chronically undershoots the 2% inflation target and gets stuck at the ZLB indefinitely?</p><p>The third paragraph addresses issues related to the second part of the Fed's dual mandate - \"maximum employment.\" The old Statement made reference to \"normal\" levels of growth in output and employment, the idea being that the economy could be above or below what might be considered normal. The Committee now appears to think that the relevant metric is the shortfall relative to maximum employment, with maximum employment being some sort of optimal state that we never achieve. In any case, the FOMC does not want, for good reasons I think, to define maximum employment, or to provide measures of it. But then why go to the bother of changing the language? We'll be able to answer that when we get to Powell's speech.</p><p>A key change that might, in principle, amount to something substantive is in the paragraph on inflation:</p><blockquote><p>In order to anchor longer-term inflation expectations at this level, the Committee seeks to achieve inflation that averages 2 percent over time, and therefore judges that, following periods when inflation has been running persistently below 2 percent, appropriate monetary policy will likely aim to achieve inflation moderately above 2 percent for some time.</p></blockquote><p>So, that doesn't appear to commit to anything. If the FOMC were committing to an inflation averaging procedure, it would have to specify at least three things - and maybe more, depending on how complicated they wanted to get. Specifically, first we would need to know over what period the FOMC was averaging over past inflation rates to determine what needs to be made up. Second, the Statement would need to specify the length of the future period over which the FOMC intended to make up the missing inflation. And third, the FOMC would need to specify what the average inflation target would be. They've given us the third number, 2%, but not the other two. To see how actual inflation targeting would work, suppose the FOMC specifies a rolling window relative to the current month, over which it is going to average. For example, if the FOMC chooses a window that goes 2 years into the past, and 2 years into the future, then at each point in time, it would calculate average inflation over the past two years, and then plan to make it up over the next two years, in such a way that average inflation from two years ago to two years hence is anticipated to be 2%. This implies that the target inflation rate will change month-to-month. That's pretty complicated, and hard to explain - which is an argument against inflation averaging - but if you're going to do it, you might as well do it properly.</p><p>So, what we have in the above quote is some half-assed inflation targeting, which one could argue is worse than what was in the statement before. Someone even added the word \"likely,\" so they're telling us they might do it, but maybe not. Great. Finally, the averaging isn't really averaging, as it's not symmetric. Nothing is said about what happens when inflation has been running above target. You might think this is a way of slipping a higher inflation target past you, without saying so. Maybe so, but not to worry, for reasons I'll give you in what follows.</p><p>There is some more language in the Statement about how the FOMC's inflation and maximum employment goals fit together. And the Statement finishes off with a commitment to do a thorough policy review every five years, which seems like a good idea - though if this sort of thing is the result, maybe we would be better off without the review.</p><p>But, on to&nbsp;<a href=\"https://www.federalreserve.gov/newsevents/speech/powell20200827a.htm\">Powell's speech</a>. Powell says there are four things that are driving the change in the FOMC's Statement (using my words here):</p><p>1. Low productivity growth and demographic factors have lowered the average growth rate of real GDP.</p><p>2. r* is expected to remain persistently low.</p><p>3. As of February 2020, the labor market had become unusually and unexpectedly tight, with a very low unemployment rate and a very high vacancy rate.</p><p>4. The Phillips curve is flat.</p><p>And, as further motivation for why the Fed needs to reconsider what it's doing, Powell addresses inflation undershooting, and why that's a bad thing. According to him, here's what can go wrong:</p><blockquote><p><span face=\"\" style=\"background-color: white; color: #333333; font-size: 14px;\">Inflation that runs below its desired level can lead to an unwelcome fall in longer-term inflation expectations, which, in turn, can pull actual inflation even lower, resulting in an adverse cycle of ever-lower inflation and inflation expectations.</span></p></blockquote><p>So, that's an instability story, which crops up from time to time. Basically, the narrative goes, we can get into a deflationary black hole, with inflation falling forever. What causes the deflationary black hole to materialize? According to Powell, it's inflation below the \"desired level.\" So, what central bankers wish for seems to matter for deflationary black holes. Whichever staff members helped write this speech weren't quite doing their jobs in this section.&nbsp;</p><p>The deflationary black hole narrative has been around for a long time. I think I saw it for the first time when nominal interest rates were low in the early 2000s. For example, in 2002,&nbsp;<a href=\"https://www.federalreserve.gov/boarddocs/speeches/2002/20021121/\">Ben Bernanke gave a speech about deflation</a>, which didn't quite go full deflationary-black-hole, but warned of the dangers of deflation that could arise at the zero lower bound. People worried about deflation again in 2008-2009, because of zero lower bound issues, but given that the sustained deflation never materialized, I thought the concern had gone away. Problem is that the deflationary black hole is something we've never seen. Nominal interest rates at or near zero in Japan for 25 years have produced inflation that has averaged about zero. And mainstream theory won't give you a deflationary black hole, though I've seen it in some examples with very sticky prices and very sticky expectations.</p><p>So, what concerns does low inflation raise for Powell?</p><blockquote><span face=\"\" style=\"background-color: white; color: #333333; font-size: 14px;\">...if inflation expectations fall below our 2 percent objective, interest rates would decline in tandem. In turn, we would have less scope to cut interest rates to boost employment during an economic downturn, further diminishing our capacity to stabilize the economy through cutting interest rates.</span><p></p></blockquote><p>When I first read this, I thought that \"interest rates would decline in tandem\" meant long bond yields. That is, anticipated inflation falls, which reduces the inflation premium on long-term bonds. But I think it's clear he means that a drop in anticipated inflation causes the FOMC to drop its fed funds rate target. So that's a strange argument - the problem has to do with our policy response, he's saying. That may actually sense to you, if you've read&nbsp;<a href=\"http://www.columbia.edu/~mu2166/perils.pdf\">Benhabib/Schmitt-Grohe/Uribe (2001) on \"Perils of the Taylor Rule.\"</a>&nbsp; The idea is that an aggressive Taylor-rule central banker, who cuts the nominal interest rate target more than one-for-one when he or she sees a shortfall in inflation relative to target, can get on a path that leads to perpetually low nominal interest rates and inflation. That is, if the central banker sees inflation below target, he or she drops the nominal interest rate rate target. But, the central banker doesn't understand the Fisher effect. The drop in the nominal interest rate results in a decrease in inflation, the decrease in inflation results in lower interest rates, etc., and the rest point is the effective lower bound on the nominal interest rate. Inflation stays below target until the central banker figures out how inflation dynamics work. To me, that seems a nice description of what's been happening in many countries since the financial crisis, and in Japan since about 1995. In practice, I don't think you necessarily need aggressive Taylor rule behavior to get chronic inflation-target undershooting. Probably it's enough that central bankers find few supporters for interest rate increases, and plenty of supporters for cuts. In fact, as I'll discuss later in this piece, the policy trap - perpetually low inflation and low nominal interest rates - could arise if the central bank only cuts and hikes interest rates in response to the unemployment rate, so long as the response is asymmetric.</p><p>This is one of the few cases in economics I know of where a basic, well-entrenched misconception can actually lead to tolerably good results. Low inflation, in contrast to what Powell seems to think, is generally fine. The only cost is to the reputations of central bankers who consistently promise 2% inflation and deliver less.</p><p>The rest of Powell's speech deals with the new statement, and how it reflects these new issues, as Powell sees it. First, Powell thinks it's important that the new Statement says that the FOMC will use its \"full range of tools,\" which it will need, he says, because low r* implies a frequently binding ZLB. It's not clear why this needs to be in the revised Statement, as the previous Statement gave essentially no information about how the Fed intended to realize its goals. Best guess is that the language on tools is in the Statement to allow the unconventional monetary policy enthusiasts on the committee to commit their colleagues to future actions.</p><p>This is more interesting, I think:</p><blockquote><p><span face=\"\" style=\"background-color: white; color: #333333; font-size: 14px;\">...our revised statement says that our policy decision will be informed by our \"assessments of the&nbsp;</span><em style=\"background-color: white; box-sizing: border-box; color: #333333; font-family: arial, helvetica, sans-serif; font-size: 14px;\">shortfalls</em><span face=\"\" style=\"background-color: white; color: #333333; font-size: 14px;\">&nbsp;of employment from its maximum level\" rather than by \"</span><em style=\"background-color: white; box-sizing: border-box; color: #333333; font-family: arial, helvetica, sans-serif; font-size: 14px;\">deviations</em><span face=\"\" style=\"background-color: white; color: #333333; font-size: 14px;\">&nbsp;from its maximum level\" as in our previous statement.</span><span face=\"\" style=\"background-color: white; color: #333333; font-size: 14px;\">&nbsp;This change may appear subtle, but it reflects our view that a robust job market can be sustained without causing an outbreak of inflation.</span></p></blockquote><p>So, Powell's view is that the Phillips curve is flat, thus low unemployment will not increase inflation. So, is the Fed abandoning its Phillips curve model of inflation, which appears to have been driving its decisions ever since I can remember? Apparently not. But if the Phillips curve is flat, so that unemployment is irrelevant for inflation, in the FOMC's view, then what determines inflation, and what does that tell us about how the Fed should control it? Seems part of the answer is in Powell's description of the costs of disinflation. That is, inflation expectations drive inflation. But how do changes in a nominal interest rate target affect inflation expectations, in the minds of FOMC participants? Inquiring minds want to know.</p><p>But, let's see if we can predict the implications of the last quote above for FOMC actions in the future. In the past, most of the short run variation in the FOMC's fed funds rate target has been due to short run variation in the unemployment rate. The FOMC typically finds it easy to cut interest rates in the face of increases in the unemployment rate - they get few arguments about that. It's difficult, however, to justify interest rate hikes. Particularly during the last tightening cycle, running from late 2015 to late 2018, inflation was mostly below target, and the interest rate hikes were justified as preemptive actions. Apparently, Powell is now judging 2015-2018 to be a mistake.</p><p>But it's hard to see what was wrong with the FOMC's performance in 2015-2018, given the observed outcomes and the previous Statement. At the end of the tightening cycle in December 2018, the unemployment rate had fallen to 3.9%, the lowest it had been since the 1950s, and the inflation rate was 1.9%, just shy of the 2% target. I'm having a hard time seeing a mistake.</p><p>Earlier in Powell's speech he tells us the current FOMC consensus on the \"neutral interest rate\" is that it's about 2.5%. That is, if the Fed is hitting its 2% inflation target consistently, and the economy is humming along at maximum employment consistently, then the fed funds rate should be about 2.5%, according to the FOMC. That is, the FOMC thinks r*, the long-run real rate of interest, is about 0.5%. The FOMC also thinks the Phillips curve is flat so, roughly, the FOMC thinks that, to achieve 2% inflation on average, the fed funds rate should average about 2.5%. The FOMC might also think that keeping the fed funds rate at zero will eventually make inflation go up, but that's not consistent with what we observe. The central banks that undershoot their inflation targets tend to be the ones that can't seem to get off the effective lower bound, the Bank of Japan being the prime example.</p><p>So it seems that, to sustain 2% inflation, the FOMC will sometimes have to find an excuse to increase its fed funds rate target. The usual excuse was the one they used last time, which is that a low unemployment rate tells us inflation is about to blow through the roof. That's actually baloney, as Powell recognizes, but it's a piece of fiction that served the purpose. It's hard to convince people that interest rate hikes are a good idea, but for some reason the specter of incipient inflation does the trick. The truth is that, to sustain higher inflation, you need a commitment to a higher nominal interest rate target. Like it or not, that's how it works.</p><p>In any case, the FOMC just denied itself license to use the standard excuse to hike interest rates. If we ever see another increase in the fed funds target range, I'll be amazed.</p><p>The last issue discussed in the speech is what most people have focused on, which is the quasi-inflation-averaging approach. As Powell points out,</p><blockquote><p>...<span face=\"\" style=\"background-color: white; color: #333333; font-size: 14px;\">we are not tying ourselves to a particular mathematical formula that defines the average.</span></p></blockquote><p>This means that the promise is empty, essentially. If it's not written down, the FOMC can't be held to anything.</p><p>But, the key problem Powell seems concerned with, and which is reflected in the statement, is below-target inflation, which needs to be matched by periods of above-target inflation. So how do we get above-target inflation?</p><blockquote><span face=\"\" style=\"background-color: white; color: #333333; font-size: 14px;\">...following periods when inflation has been running below 2 percent, appropriate monetary policy will likely aim to achieve inflation moderately above 2 percent for some time.</span></blockquote><p>Well, that clears it up. Seriously, I'm pretty sure I know what \"appropriate\" means. Given the new Statement and Powell's speech, it seems the FOMC thinks lower for longer will do the trick. As far as I can tell, though, this is just dooming the approach to failure. Lower for longer is just going to produce extended periods with below-target inflation. If no one believes the Fed is committed to increasing nominal interest rates sometime in the future, everyone believes inflation will stay low.</p><p>This is all somewhat depressing. I don't get the sense that the FOMC is learning and improving. This looks like a step backward. But probably they're not going to do any great harm. Low nominal interest rates and low inflation forever is fine. The only cost is that we're in for a long period of excuses for poor performance relative to the stated 2% inflation goal. Not to mention much unconventional (and ineffective, I think) monetary policy, and a large balance sheet that will never shrink.&nbsp;</p><blockquote><p>&nbsp;</p></blockquote>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Stephen Williamson",
    "uri": "http://www.blogger.com/profile/01434465858419028592",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}