{
  "title": "Special Episode: Changing Tides - Water Scarcity",
  "description": "<p>Water scarcity brings unique challenges in the path to a more sustainable future. Solving for them will mean both risk and opportunity for governments, corporates, and investors.</p><p><br></p><p>-----Transcript-----</p><p><strong>Jessica Alsford </strong>Obviously, everyone's minds today are rightly on news out of Europe. We will have an episode to cover this in the coming days, but today we are thinking more long term on sustainability.&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>Welcome to Thoughts on the Market. I'm Jessica Alsford, Global Head of Sustainability Research at Morgan Stanley,&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>And I'm Connor Lynagh, an equity analyst covering energy and industrials here at Morgan Stanley.&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>And on this episode of the podcast, we'll be discussing one of the leading sustainability challenges of the near future, water scarcity, as well as potential solutions that are likely to emerge. It's Thursday, February, the 24th at 3 p.m. in London,&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>and it's 10:00 am in New York.&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>So Jess, we recently collaborated on the report, 'Changing Tides, Investing for Future Water Access.' Maybe the best place to start here is the big picture. Can you walk us through the demand picture and how challenges are expected to change in the industry?&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>So the key issue really is that water is a critical but finite resource, and there's already huge inequality in access to water globally. So over the last century, we've seen water use rising about six fold, and yet there are still around 2 billion people without access to safely managed drinking water and around 3.6 billion without safely managed sanitation. Then add to this the fact that demand is likely to increase by around another 30% by 2050, about 70% of total demand comes from agriculture withdrawals, and clearly we need to increase the amount of food we're producing due to growing population, and there's also going to be incremental water needs from industry and municipalities. A third element to also think about is that this is all happening at the same time that climate change is going to alter the hydrological cycle. And so, this is going to increase the risk of floods in some areas and drought in others. Eight of the 10 largest economies actually have either the same or higher water risk scores than the global average. And so clearly what is already a challenge in terms of providing access to water is only going to become more complicated going forward.&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>So Jess, water is pretty unique when you look at the different challenges that the sustainability community is facing. What do you think is particularly unique and noteworthy about the challenge we're facing here?&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>So the three really big sustainability megatrends that we look at our climate, food and then water. They're all interrelated and they're all really tricky to solve for. But I think there are some unique characteristics about water that do add some complexities to it. First of all, it is finite. So, in theory, we can produce more food, but it's very difficult to make more water. In addition, it's incredibly difficult and costly to transport water around. So, if you think about energy and food, these can be moved over pretty large distances, but water is really a regionally specific commodity. And then the third element really is that water is underpriced if you compare to the actual cost of providing it. There aren't any free markets really to set prices according to supply and demand and because water is essential to life, it's really not straightforward when it comes to thinking about pricing.&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>So Connor, from your perspective, covering some of the stocks exposed to the water theme, what are your thoughts on how water might be priced going forward?&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>Yeah, I mean, I think you really hit on a lot of the big issues, which is that pricing is very heavily regulated relative to a lot of commodities out there. You know, a lot of utilities are not really able to cover their costs without subsidies from the government. And so, you know, I think as a base case, there does need to be an increase in pricing to solve for some of this shortfall that we see out there. But that has to be done delicately. We can't disadvantage members of society that are already struggling. And so, I think what we're going to need to see is some sort of market-based pricing, but in select instances. So, Australia already has a relatively well-developed water market. You're seeing some moves in that direction in California as well. But I think as a first step, I think there's going to be increased focus on larger industrial users paying more than their share and allowing consumers to have a relatively advantaged position on the cost structure.&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>So pricing is clearly one issue, but we also need to see huge investment in global water infrastructure. What are your thoughts on how this develops over the next few years?&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>It’s interesting if you look at a cross-section of countries globally, we tend to spend about 1% of GDP on our water resources. So, I think it's a fair starting point to say that water spending is going to grow in line with GDP. But, as we look at the world today and as you've covered previously, the spending is already not sufficient. It's probably hard to quantify exactly how much we, quote, 'should' spend. But I'll point out a couple of data points here. So globally, we spend about $300 billion per year on water capex. In order to get global water access to those that currently don't have it, this would cost an incremental $115 billion a year. And even in countries like the U.S., where our infrastructure is relatively well developed, we are currently facing a spending shortfall of about $40 billion per year. So, we do think this is going to need to rise significantly.&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>So if we look at climate, for example, we have seen a really big step up in terms of regulation and policy support to really try to drive investment into green infrastructure. And so just picking up on that, for investors who are looking at this theme, where can capital be deployed to help solve this issue?&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>I think that there's obviously just a major infrastructure investment need, but I think that absent major changes in policy, there's a few areas that we still think are relative areas of excess spending growth, if you will, within the sector. So, the first is emerging markets. As countries climb the wealth curve, we do think that their investment is going to increase significantly. I'd point to areas like India and China as areas of significant growth over the next few years. Wastewater management globally I really think that there is going to be increasing regulation and corporate-level focus on this. And then the final thing is applying digital technologies. So, as it stands right now, only about 70% of water globally is connected to a meter. So first and foremost, we need to get a better sense of how we're using our water, where we're using our water. But we can also use cellular technology, digital technologies to better monitor who's using this water in real time, and I think that's going to be a major area of investment, particularly in the US and Europe.&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>So, Jess, obviously there's opportunities for companies that can offer solutions to the water industry, but water access is also a risk for many companies around the world. How should investors think about this?&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>Absolutely. Energy and power generation are the most water intensive sectors. But actually, what's really critical with this theme is access to water on a local level. So actually, our analysis has shown that companies across a wide variety of sectors can really be impacted, whether that be datacenters, pharmaceuticals, apparel or beverages. One of the sectors most at risk is actually copper. So copper is a very water intensive commodity, and a lot of copper just happens to be mined in Chile, which is a country unfortunately already suffering from water scarcity. Now, desalination plants are becoming the norm in Chile as there are competing demands for water between copper mines and also the local population. If we look ahead, we actually think that demand for copper could increase by around 25% per annum. And this is due to the vital role that it's playing in the energy transition, whether it be for renewables or EVs, for example. And with this incremental demand for copper comes incremental demands for water. I'd also point to hydrogen, again, a key piece of the decarbonization puzzle. So, water is needed for hydrogen, whether for cooling, for gray or blue hydrogen, or for the electrolysis process with green hydrogen. And our analysis suggests that almost 60% of future hydrogen projects are located in countries with water stress. So again, this is going to require inventive solutions to ensure that there really is sufficient access to water for all users.&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>Jess, thanks for taking the time to talk.</p><p><br></p><p><strong>Jessica Alsford </strong>Great speaking with you too Connor.&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>And as a reminder, if you enjoy Thoughts on the Market, please do take a moment to rate and review on the Apple Podcasts app. It helps more people to find the show.&nbsp;</p>",
  "itunes:title": "Special Episode: Changing Tides - Water Scarcity",
  "itunes:episodeType": "full",
  "itunes:episode": 561,
  "itunes:summary": "Water scarcity brings unique challenges in the path to a more sustainable future. Solving for them will mean both risk and opportunity for governments, corporates, and investors.",
  "content:encoded": "<p>Water scarcity brings unique challenges in the path to a more sustainable future. Solving for them will mean both risk and opportunity for governments, corporates, and investors.</p><p><br></p><p>-----Transcript-----</p><p><strong>Jessica Alsford </strong>Obviously, everyone's minds today are rightly on news out of Europe. We will have an episode to cover this in the coming days, but today we are thinking more long term on sustainability.&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>Welcome to Thoughts on the Market. I'm Jessica Alsford, Global Head of Sustainability Research at Morgan Stanley,&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>And I'm Connor Lynagh, an equity analyst covering energy and industrials here at Morgan Stanley.&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>And on this episode of the podcast, we'll be discussing one of the leading sustainability challenges of the near future, water scarcity, as well as potential solutions that are likely to emerge. It's Thursday, February, the 24th at 3 p.m. in London,&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>and it's 10:00 am in New York.&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>So Jess, we recently collaborated on the report, 'Changing Tides, Investing for Future Water Access.' Maybe the best place to start here is the big picture. Can you walk us through the demand picture and how challenges are expected to change in the industry?&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>So the key issue really is that water is a critical but finite resource, and there's already huge inequality in access to water globally. So over the last century, we've seen water use rising about six fold, and yet there are still around 2 billion people without access to safely managed drinking water and around 3.6 billion without safely managed sanitation. Then add to this the fact that demand is likely to increase by around another 30% by 2050, about 70% of total demand comes from agriculture withdrawals, and clearly we need to increase the amount of food we're producing due to growing population, and there's also going to be incremental water needs from industry and municipalities. A third element to also think about is that this is all happening at the same time that climate change is going to alter the hydrological cycle. And so, this is going to increase the risk of floods in some areas and drought in others. Eight of the 10 largest economies actually have either the same or higher water risk scores than the global average. And so clearly what is already a challenge in terms of providing access to water is only going to become more complicated going forward.&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>So Jess, water is pretty unique when you look at the different challenges that the sustainability community is facing. What do you think is particularly unique and noteworthy about the challenge we're facing here?&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>So the three really big sustainability megatrends that we look at our climate, food and then water. They're all interrelated and they're all really tricky to solve for. But I think there are some unique characteristics about water that do add some complexities to it. First of all, it is finite. So, in theory, we can produce more food, but it's very difficult to make more water. In addition, it's incredibly difficult and costly to transport water around. So, if you think about energy and food, these can be moved over pretty large distances, but water is really a regionally specific commodity. And then the third element really is that water is underpriced if you compare to the actual cost of providing it. There aren't any free markets really to set prices according to supply and demand and because water is essential to life, it's really not straightforward when it comes to thinking about pricing.&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>So Connor, from your perspective, covering some of the stocks exposed to the water theme, what are your thoughts on how water might be priced going forward?&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>Yeah, I mean, I think you really hit on a lot of the big issues, which is that pricing is very heavily regulated relative to a lot of commodities out there. You know, a lot of utilities are not really able to cover their costs without subsidies from the government. And so, you know, I think as a base case, there does need to be an increase in pricing to solve for some of this shortfall that we see out there. But that has to be done delicately. We can't disadvantage members of society that are already struggling. And so, I think what we're going to need to see is some sort of market-based pricing, but in select instances. So, Australia already has a relatively well-developed water market. You're seeing some moves in that direction in California as well. But I think as a first step, I think there's going to be increased focus on larger industrial users paying more than their share and allowing consumers to have a relatively advantaged position on the cost structure.&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>So pricing is clearly one issue, but we also need to see huge investment in global water infrastructure. What are your thoughts on how this develops over the next few years?&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>It’s interesting if you look at a cross-section of countries globally, we tend to spend about 1% of GDP on our water resources. So, I think it's a fair starting point to say that water spending is going to grow in line with GDP. But, as we look at the world today and as you've covered previously, the spending is already not sufficient. It's probably hard to quantify exactly how much we, quote, 'should' spend. But I'll point out a couple of data points here. So globally, we spend about $300 billion per year on water capex. In order to get global water access to those that currently don't have it, this would cost an incremental $115 billion a year. And even in countries like the U.S., where our infrastructure is relatively well developed, we are currently facing a spending shortfall of about $40 billion per year. So, we do think this is going to need to rise significantly.&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>So if we look at climate, for example, we have seen a really big step up in terms of regulation and policy support to really try to drive investment into green infrastructure. And so just picking up on that, for investors who are looking at this theme, where can capital be deployed to help solve this issue?&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>I think that there's obviously just a major infrastructure investment need, but I think that absent major changes in policy, there's a few areas that we still think are relative areas of excess spending growth, if you will, within the sector. So, the first is emerging markets. As countries climb the wealth curve, we do think that their investment is going to increase significantly. I'd point to areas like India and China as areas of significant growth over the next few years. Wastewater management globally I really think that there is going to be increasing regulation and corporate-level focus on this. And then the final thing is applying digital technologies. So, as it stands right now, only about 70% of water globally is connected to a meter. So first and foremost, we need to get a better sense of how we're using our water, where we're using our water. But we can also use cellular technology, digital technologies to better monitor who's using this water in real time, and I think that's going to be a major area of investment, particularly in the US and Europe.&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>So, Jess, obviously there's opportunities for companies that can offer solutions to the water industry, but water access is also a risk for many companies around the world. How should investors think about this?&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>Absolutely. Energy and power generation are the most water intensive sectors. But actually, what's really critical with this theme is access to water on a local level. So actually, our analysis has shown that companies across a wide variety of sectors can really be impacted, whether that be datacenters, pharmaceuticals, apparel or beverages. One of the sectors most at risk is actually copper. So copper is a very water intensive commodity, and a lot of copper just happens to be mined in Chile, which is a country unfortunately already suffering from water scarcity. Now, desalination plants are becoming the norm in Chile as there are competing demands for water between copper mines and also the local population. If we look ahead, we actually think that demand for copper could increase by around 25% per annum. And this is due to the vital role that it's playing in the energy transition, whether it be for renewables or EVs, for example. And with this incremental demand for copper comes incremental demands for water. I'd also point to hydrogen, again, a key piece of the decarbonization puzzle. So, water is needed for hydrogen, whether for cooling, for gray or blue hydrogen, or for the electrolysis process with green hydrogen. And our analysis suggests that almost 60% of future hydrogen projects are located in countries with water stress. So again, this is going to require inventive solutions to ensure that there really is sufficient access to water for all users.&nbsp;</p><p><br></p><p><strong>Connor Lynagh </strong>Jess, thanks for taking the time to talk.</p><p><br></p><p><strong>Jessica Alsford </strong>Great speaking with you too Connor.&nbsp;</p><p><br></p><p><strong>Jessica Alsford </strong>And as a reminder, if you enjoy Thoughts on the Market, please do take a moment to rate and review on the Apple Podcasts app. It helps more people to find the show.&nbsp;</p>",
  "guid": "gid://art19-episode-locator/V0/vqIobHXUAYYhXV52SEar8ESBaQYq9i_kYvs48cqtVZY",
  "pubDate": "Fri, 25 Feb 2022 04:00:05 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:duration": "00:08:38",
  "enclosure": ""
}