{
  "title": "Episode 112: “Mansfield Park” by Jane Austen, Vol. 3, Ch. 1-8",
  "itunes:title": "“Mansfield Park” by Jane Austen, Vol. 3, Ch. 1-8",
  "pubDate": "Tue, 09 Nov 2021 06:00:00 +0000",
  "guid": "68ee6cff-1edc-4a4b-8087-4de86345a2f1",
  "link": "https://theliterarylife.libsyn.com/episode-112-mansfield-park-by-jane-austen-vol-3-ch-1-8",
  "itunes:image": "",
  "description": "<p>Welcome back for another installment in our series covering <em><a href=\"https://amzn.to/3GGE1HO\">Mansfield Park</a></em> by Jane Austen. Angelina, Cindy and Thomas share their commonplace quotes which leads them into discussing Fanny’s character in contrast to the heroine of a gothic novel. They talk about what makes a good marriage in the Regency period and Jane Austen’s own personal life, as well as the contrast between the household of Sir Thomas compared to Fanny’s own family home.</p> <p>Get in on the Western Films and Fiction webinar on November 22nd with Thomas and James Banks! <a href= \"https://houseofhumaneletters.com/product/western-films-and-western-fiction-a-webinar/\"> Register here</a> to join in! Also, check out the <a href= \"https://houseofhumaneletters.com/\">House of Humane Letters</a> newsletter to stay in the know about our upcoming read-a-long of Shakespeare’s <em><a href=\"https://amzn.to/3mT8Pxb\">The Tempest</a></em>.</p> <p>To view the schedule for the episodes in this series, see our <a href=\"https://www.theliterary.life/upcoming-events/\">Upcoming Events page</a>. Also, if you want to join our members-only forum off Facebook, check out our <a href= \"https://www.patreon.com/theliterarylife\">Patreon page</a> to learn more!</p> <h3>Commonplace Quotes:</h3> <blockquote class=\"wp-block-quote\"> <p>Fear the man who says he knows how things should be. He doesn’t</p> <cite>Alexander Galich</cite></blockquote> <blockquote class=\"wp-block-quote\"> <p>Things were easier for us. We were brought up on stories with happy endings and on the Prayer Book.</p> <cite>C. S. Lewis</cite></blockquote> <blockquote class=\"wp-block-quote\"> <p>One of the most dangerous of literary ventures is the little, shy, unimportant heroine whom none of the other characters value. The danger is that your readers may agree with the other characters. Something must be put into the heroine to make us feel that the other characters are wrong, that she contains the depths they never dreamed of. That is why Charlotte Brontë would have succeeded better with Fanny Price. To be sure, she would have ruined everything else in the book; Sir Thomas and Lady Bertram and Mrs. Norris would have been distorted from credible types of pompous dullness, lazy vapidity and vulgar egoism into fiends complete with horns, tails and rhetoric. But through Fanny there would have blown a storm of passion which made sure that we at least would never think her insignificant.</p> <cite>C. S. Lewis</cite></blockquote> <h3>Something Nasty in the Bookshop</h3> <p><em>by Kingsley Amis</em></p> <p>Between the Gardening and the Cookery<br /> Comes the brief Poetry shelf;<br /> By the Nonesuch Donne, a thin anthology<br /> Offers itself.<br /> <br /> Critical, and with nothing else to do,<br /> I scan the Contents page,<br /> Relieved to find the names are mostly new;<br /> No one my age.<br /> <br /> Like all strangers, they divide by sex:<br /> Landscape Near Parma<br /> Interests a man, so does The Double Vortex,<br /> So does Rilke and Buddha.<br /> <br /> “I travel, you see”, “I think” and “I can read”<br /> These titles seem to say;<br /> But I Remember You, Love is my Creed,<br /> Poem for J.,<br /> <br /> The ladies’ choice, discountenance my patter<br /> For several seconds;<br /> From somewhere in this (as in any) matter<br /> A moral beckons.<br /> <br /> Should poets bicycle-pump the human heart<br /> Or squash it flat?<br /> Man’s love is of man’s life a thing apart;<br /> Girls aren’t like that.<br /> <br /> We men have got love well weighed up; our stuff<br /> Can get by without it.<br /> Women don’t seem to think that’s good enough;<br /> They write about it.<br /> <br /> And the awful way their poems lay them open<br /> Just doesn’t strike them.<br /> Women are really much nicer than men:<br /> No wonder we like them.<br /> <br /> Deciding this, we can forget those times<br /> We stayed up half the night<br /> Chock-full of love, crammed with bright thoughts, names, rhymes,<br /> And couldn’t write.</p> <h3>Book List:</h3> <p><em><a href=\"https://amzn.to/3nQUrVM\">Hallelujah: Cultivating Advent Traditions with Handel’s Messiah</a></em> by Cindy Rollins</p> <p><em><a href=\"https://amzn.to/2ZDPaZD\">That Hideous Strength</a></em> by C. S. Lewis</p> <p><a href=\"https://amzn.to/31ylLQR\"><em>Pamela</em></a> by Samuel Richardson</p> <p><em><a href=\"https://amzn.to/3BXHDSi\">David Copperfield</a></em> by Charles Dickens</p> <p><a href=\"https://amzn.to/300yXNC\"><em>Jane Austen</em></a> by Peter Leithart</p> <h3>Support The Literary Life:</h3> <p>Become a patron of The Literary Life podcast as part of the “Friends and Fellows Community” on <a href= \"https://www.patreon.com/theliterarylife/overview\">Patreon,</a> and get some amazing bonus content! Thanks for your support!</p> <h3>Connect with Us:</h3> <p>You can find Angelina and Thomas at <a href= \"https://houseofhumaneletters.com/\">HouseofHumaneLetters.com</a>, on Instagram <a href= \"https://www.instagram.com/angelinastanford/\">@angelinastanford</a>, and on Facebook at <a href= \"https://www.facebook.com/ANGStanford/\">https://www.facebook.com/ANGStanford/</a></p> <p>Find Cindy at <a href= \"https://cindyrollins.net\">morningtimeformoms.com</a>, on Instagram <a href= \"https://www.instagram.com/cindyordoamoris/\">@cindyordoamoris</a> and on Facebook at <a href= \"https://www.facebook.com/cindyrollins.net/\">https://www.facebook.com/cindyrollins.net/</a>. Check out <a href= \"https://www.patreon.com/cindyrollins?fbclid=IwAR3acx7P6FGt1Us_buk7cIzIaK31FxMaNlK53pKfV5vr8SYphKVywNIAqZ8\">Cindy’s own Patreon page</a> also!</p> <p>Follow <a href= \"https://www.instagram.com/literarylifepodcast/\">The Literary Life</a> on Instagram, and jump into our private Facebook group, The Literary Life Discussion Group, and let’s get the book talk going! <a href= \"http://bit.ly/literarylifeFB\">http://bit.ly/literarylifeFB</a></p>",
  "content:encoded": "<p>Welcome back for another installment in our series covering <em><a href=\"https://amzn.to/3GGE1HO\">Mansfield Park</a></em> by Jane Austen. Angelina, Cindy and Thomas share their commonplace quotes which leads them into discussing Fanny’s character in contrast to the heroine of a gothic novel. They talk about what makes a good marriage in the Regency period and Jane Austen’s own personal life, as well as the contrast between the household of Sir Thomas compared to Fanny’s own family home.</p> <p>Get in on the Western Films and Fiction webinar on November 22nd with Thomas and James Banks! <a href= \"https://houseofhumaneletters.com/product/western-films-and-western-fiction-a-webinar/\"> Register here</a> to join in! Also, check out the <a href= \"https://houseofhumaneletters.com/\">House of Humane Letters</a> newsletter to stay in the know about our upcoming read-a-long of Shakespeare’s <em><a href=\"https://amzn.to/3mT8Pxb\">The Tempest</a></em>.</p> <p>To view the schedule for the episodes in this series, see our <a href=\"https://www.theliterary.life/upcoming-events/\">Upcoming Events page</a>. Also, if you want to join our members-only forum off Facebook, check out our <a href= \"https://www.patreon.com/theliterarylife\">Patreon page</a> to learn more!</p> Commonplace Quotes:  <p>Fear the man who says he knows how things should be. He doesn’t</p> Alexander Galich  <p>Things were easier for us. We were brought up on stories with happy endings and on the Prayer Book.</p> C. S. Lewis  <p>One of the most dangerous of literary ventures is the little, shy, unimportant heroine whom none of the other characters value. The danger is that your readers may agree with the other characters. Something must be put into the heroine to make us feel that the other characters are wrong, that she contains the depths they never dreamed of. That is why Charlotte Brontë would have succeeded better with Fanny Price. To be sure, she would have ruined everything else in the book; Sir Thomas and Lady Bertram and Mrs. Norris would have been distorted from credible types of pompous dullness, lazy vapidity and vulgar egoism into fiends complete with horns, tails and rhetoric. But through Fanny there would have blown a storm of passion which made sure that we at least would never think her insignificant.</p> C. S. Lewis Something Nasty in the Bookshop <p><em>by Kingsley Amis</em></p> <p>Between the Gardening and the Cookery Comes the brief Poetry shelf; By the Nonesuch Donne, a thin anthology Offers itself.  Critical, and with nothing else to do, I scan the Contents page, Relieved to find the names are mostly new; No one my age.  Like all strangers, they divide by sex: Landscape Near Parma Interests a man, so does The Double Vortex, So does Rilke and Buddha.  “I travel, you see”, “I think” and “I can read” These titles seem to say; But I Remember You, Love is my Creed, Poem for J.,  The ladies’ choice, discountenance my patter For several seconds; From somewhere in this (as in any) matter A moral beckons.  Should poets bicycle-pump the human heart Or squash it flat? Man’s love is of man’s life a thing apart; Girls aren’t like that.  We men have got love well weighed up; our stuff Can get by without it. Women don’t seem to think that’s good enough; They write about it.  And the awful way their poems lay them open Just doesn’t strike them. Women are really much nicer than men: No wonder we like them.  Deciding this, we can forget those times We stayed up half the night Chock-full of love, crammed with bright thoughts, names, rhymes, And couldn’t write.</p> Book List: <p><em><a href=\"https://amzn.to/3nQUrVM\">Hallelujah: Cultivating Advent Traditions with Handel’s Messiah</a></em> by Cindy Rollins</p> <p><em><a href=\"https://amzn.to/2ZDPaZD\">That Hideous Strength</a></em> by C. S. Lewis</p> <p><a href=\"https://amzn.to/31ylLQR\"><em>Pamela</em></a> by Samuel Richardson</p> <p><em><a href=\"https://amzn.to/3BXHDSi\">David Copperfield</a></em> by Charles Dickens</p> <p><a href=\"https://amzn.to/300yXNC\"><em>Jane Austen</em></a> by Peter Leithart</p> Support The Literary Life: <p>Become a patron of The Literary Life podcast as part of the “Friends and Fellows Community” on <a href= \"https://www.patreon.com/theliterarylife/overview\">Patreon,</a> and get some amazing bonus content! Thanks for your support!</p> Connect with Us: <p>You can find Angelina and Thomas at <a href= \"https://houseofhumaneletters.com/\">HouseofHumaneLetters.com</a>, on Instagram <a href= \"https://www.instagram.com/angelinastanford/\">@angelinastanford</a>, and on Facebook at <a href= \"https://www.facebook.com/ANGStanford/\">https://www.facebook.com/ANGStanford/</a></p> <p>Find Cindy at <a href= \"https://cindyrollins.net\">morningtimeformoms.com</a>, on Instagram <a href= \"https://www.instagram.com/cindyordoamoris/\">@cindyordoamoris</a> and on Facebook at <a href= \"https://www.facebook.com/cindyrollins.net/\">https://www.facebook.com/cindyrollins.net/</a>. Check out <a href= \"https://www.patreon.com/cindyrollins?fbclid=IwAR3acx7P6FGt1Us_buk7cIzIaK31FxMaNlK53pKfV5vr8SYphKVywNIAqZ8\">Cindy’s own Patreon page</a> also!</p> <p>Follow <a href= \"https://www.instagram.com/literarylifepodcast/\">The Literary Life</a> on Instagram, and jump into our private Facebook group, The Literary Life Discussion Group, and let’s get the book talk going! <a href= \"http://bit.ly/literarylifeFB\">http://bit.ly/literarylifeFB</a></p>",
  "enclosure": "",
  "itunes:duration": "01:22:45",
  "itunes:explicit": false,
  "itunes:keywords": "books,reading,literature,Education,classical,homeschool,charlottemason",
  "itunes:subtitle": "Welcome back for another installment in our series covering  by Jane Austen. Angelina, Cindy and Thomas share their commonplace quotes which leads them into discussing Fanny’s character in contrast to the heroine of a gothic novel. They talk about...",
  "itunes:season": 3,
  "itunes:episode": 112,
  "itunes:episodeType": "full",
  "itunes:author": "Angelina Stanford"
}