{
  "title": "Investing Lessons from 20 Years of Stock Advisor",
  "pubDate": "Tue, 08 Mar 2022 21:00:00 +0000",
  "guid": "e5b7a17d-4076-4ea7-9245-cbeffa1d0785",
  "link": "https://fool.libsyn.com/investing-lessons-from-20-years-of-stock-advisor",
  "itunes:image": "",
  "description": "<p>On this day in 2002, The Motley Fool launched its first subscription service: Stock Advisor. To celebrate we're not breaking out champagne and cake. Instead, we've gathered three members from our investing team (Andy Cross, Asit Sharma, Emily Flippen) to share some of the most important lessons learned over the past two decades, including:<br /> <br aria-hidden=\"true\" /> - The idea that sometimes the best place for new money is a stock you already own<br aria-hidden=\"true\" /> - Importance of diversification<br aria-hidden=\"true\" /> - Putting money into the stock market on a regular basis<br aria-hidden=\"true\" /> - The challenge (and payoff) of letting your winners run<br aria-hidden=\"true\" /> <br aria-hidden=\"true\" /> Stocks discussed: SFIX, LMND, NFLX, CWBHF, BBY<br aria-hidden= \"true\" /> <br aria-hidden=\"true\" /> Host: Chris Hill<br aria-hidden=\"true\" /> Guests: Andy Cross, Asit Sharma, Emily Flippen<br aria-hidden= \"true\" /> Producer: Ricky Mulvey<br aria-hidden=\"true\" /> Engineers: Rick Engdahl, Tim Sparks</p>",
  "content:encoded": "<p>On this day in 2002, The Motley Fool launched its first subscription service: Stock Advisor. To celebrate we're not breaking out champagne and cake. Instead, we've gathered three members from our investing team (Andy Cross, Asit Sharma, Emily Flippen) to share some of the most important lessons learned over the past two decades, including:  - The idea that sometimes the best place for new money is a stock you already own - Importance of diversification - Putting money into the stock market on a regular basis - The challenge (and payoff) of letting your winners run  Stocks discussed: SFIX, LMND, NFLX, CWBHF, BBY  Host: Chris Hill Guests: Andy Cross, Asit Sharma, Emily Flippen Producer: Ricky Mulvey Engineers: Rick Engdahl, Tim Sparks</p>",
  "enclosure": "",
  "itunes:duration": "29:02",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "On this day in 2002, The Motley Fool launched its first subscription service: Stock Advisor. To celebrate we're not breaking out champagne and cake. Instead, we've gathered three members from our investing team (Andy Cross, Asit Sharma, Emily Flippen)...",
  "itunes:episodeType": "full"
}