{
  "title": "175: Serial Killer: Oxygen's \"Kemper on Kemper\"",
  "link": "https://audioboom.com/posts/7838104",
  "itunes:episode": 175,
  "itunes:title": "Serial Killer: Oxygen's \"Kemper on Kemper\"",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3593,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>You guys, please don't let your Wikipedia page start the way this guy's does: \"serial killer, serial rapist, cambial, and necrophile...\" YIIIIIIIIIIIIIIIKES. As a teenager, Kemper killed his grandparents, was sent to a mental hospital WHERE HE WAS RELEASED ON GOOD BEHAVIOR 6 YEARS LATER. He would go on to kill 8 more people--including 6 young women and his own mother. But when he was caught, he agreed to spill alllllllllllllllll the tea about how and why he became a killer in a formal sit-down interview. And so of course they  made a documentary about it.<br>\n<br>\n<a href=\"https://lnk.to/ptzIRNzD\"><strong>CHECK OUT OUR NEW PODCAST: \"Strange And Unexplained With Daisy Eagan\"</strong></a><strong> <br>\n</strong>Do you believe in ghosts? How about bigfoot? Do you think it’s strange and fascinating that a 4 year old in Oklahoma could look at a black and white picture of a man from the 1930s and say ‘that was me. Before.” And then provide actual, verifiable details of the man’s life? If so, “Strange and Unexplained With Daisy Eagan” is about to be your new Favorite podcast. Each week, Daisy looks at real stories of hauntings, disappearances, UFO encounters, the Bermuda Triangle, near death experiences, and anything else that feels just beyond what we can easily make sense of. She is your guide into the inexplicable details of these stories. But she’s also like, “show me the receipts.” <a href=\"https://lnk.to/ptzIRNzD\"><strong>Check out Episodes 1 - 3 RIGHT NOW!</strong></a> <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\" \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n\n</div>\n",
  "pubDate": "Tue, 06 Apr 2021 10:00:00 +0000",
  "guid": "tag:audioboom.com,2021-04-06:/posts/7838104",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}