{
  "id": "yt:video:cK_PS9HXE84",
  "yt:videoId": "cK_PS9HXE84",
  "yt:channelId": "UCG_nvdTLdijiAAuPKxtvBjA",
  "title": "Morbius — How to Get Bullied by the Internet | Anatomy Of A Failure",
  "link": "",
  "author": {
    "name": "Filmento",
    "uri": "https://www.youtube.com/channel/UCG_nvdTLdijiAAuPKxtvBjA"
  },
  "published": "2022-05-28T19:00:17+00:00",
  "updated": "2022-09-10T10:55:56+00:00",
  "media:group": {
    "media:title": "Morbius — How to Get Bullied by the Internet | Anatomy Of A Failure",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Get Surfshark VPN at https://surfshark.deals/FILM and enter promo code FILM for 83% discount and 3 extra months for free!\n\nMorbius is a new sort-of MCU superhero origin movie from Sony, in which Doctor Michael Morbius played by Jared Leto transforms into Morbius. The movie did break all kinds of box office records and sold over 300 morbillion tickets, but the reception wasn't so great. The entire internet was mostly making fun of and memeing Morbius. So in today's Anatomy of a Failure, let's see what Morbius did and didn't do in order to become an easy target online. Let's see why Morbius is a bad movie and how it can avoid the same fate in the sequel.\n\n\nSupport:     https://patreon.com/filmento\nFollow:       https://twitter.com/filmento\n\n\nMusic:\n\nMorbin time:\nhttps://youtu.be/ON_q39LIVlo\n\n#Morbius #AnatomyOfAFailure #MorbiusSweep\n\n-\nMorbius (2022)\nWhile attempting to find a cure for his terminal disease, Dr. Michael Morbius stumbles upon an experimental procedure that may improve his aliment. Although initially considered a success, Dr. Morbius starts to feel a darkness awaken inside of him. The Marvel Comic of the same name inspires this anti-hero's journey. One of the most compelling and conflicted characters in Sony Pictures Universe of Marvel Characters comes to the big screen as Oscar® winner Jared Leto transforms into the enigmatic antihero Michael Morbius. Dangerously ill with a rare blood disorder and determined to save others suffering his same fate, Dr. Morbius attempts a desperate gamble. While at first it seems to be a radical success, everything wrong with morbius honest trailer cinemasins morbius full movie online free morbius bad movie review good movie morbius after credits post credits scene morbius final fight morbius funny moments morbius ending explained morbius only action morbius vs bats morbius opening morbius mcu morbius terrible movie rant great movie morbius 2 morbius 2 clip 4k hd watch full mocie online free morbius reaction official trailer morbius memes morbius spider-man a darkness inside him is unleashed. Will good override evil – or will Morbius succumb to his mysterious new urges? Directed by: Daniel Espinosa\n Screen Story and Screenplay by: Matt Sazama & Burk Sharpless  Based on the Marvel Comics Produced by: Avi Arad Matt Tolmach Lucas Foster Cast: Jared Leto Matt Smith Jared Harris with Tyrese Gibson\n-",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}