{
  "id": "tag:blogger.com,1999:blog-8878620400258430757.post-7538934868620725217",
  "published": "2019-12-09T10:00:00.000-08:00",
  "updated": "2019-12-11T15:06:21.382-08:00",
  "title": "Getting to know a research intern: Paul Rubenstein",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">Research teams are embedded all throughout Google, allowing our discoveries to affect billions of users each day. From creating experiments and prototyping implementations to designing new architectures, our team members and interns work on real-world problems including artificial intelligence, data mining, natural language processing, hardware and software performance analysis, improving compilers for mobile platforms, as well as core search and much more.<br /><br />Google offers a variety of opportunities for students who wish to gain industry experience. Through our Getting to know a research intern series, we provide a glimpse into some of these opportunities as well as the impactful projects research students at Google work on. Today we’re featuring Paul Rubenstein, from the University of Cambridge.<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-C2y8HMJCilY/Xe6KjDcSc0I/AAAAAAAAAx8/VFGWn5uaPB8I-ZSo1IfeKUUch3fIs3QgQCLcBGAsYHQ/s1600/unnamed%2B%25288%2529.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"512\" data-original-width=\"384\" src=\"https://1.bp.blogspot.com/-C2y8HMJCilY/Xe6KjDcSc0I/AAAAAAAAAx8/VFGWn5uaPB8I-ZSo1IfeKUUch3fIs3QgQCLcBGAsYHQ/s1600/unnamed%2B%25288%2529.png\" /></a></div><b>Tell us about yourself and your research topic. How did you end up working in this area?</b><br />I first studied maths at the University of Cambridge and went on to get masters degrees in computational biology and machine learning. I then joined the Cambridge-Tuebingen PhD program where I am now in my final year. In the first two years of my PhD, I worked mostly on theoretical aspects of causal inference. Generally, causal inference is about learning causal structure in the world from a mixture of observational data (passive observation of the world) and interventional data (where you perform experiments and see what happens).<br /><br />In the second half of my PhD, I’ve been working on&nbsp; representation learning (where one tries to learn lower dimensional features of high dimensional inputs such as images that are useful for transferring to other tasks), generative modelling, disentanglement, and some learning theory. Representation learning has been the broad topic of my research internship at Google.<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-e8bqWiwjSLI/Xe6KjAPlmsI/AAAAAAAAAx0/swQdK2oc4o0iac01E2TBsUqCc41zroawQCEwYBhgL/s1600/unnamed%2B%252846%2529.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"384\" data-original-width=\"512\" src=\"https://1.bp.blogspot.com/-e8bqWiwjSLI/Xe6KjAPlmsI/AAAAAAAAAx0/swQdK2oc4o0iac01E2TBsUqCc41zroawQCEwYBhgL/s1600/unnamed%2B%252846%2529.jpg\" /></a></div><b>This is your second internship at Google. Why did you apply the first time, and why did you decide to come back?&nbsp;</b><br />I applied for my first internship because I was interested to see how machine learning is used and developed in an industrial context. I was really impressed by several things about both my team and Google generally: the incredible infrastructure and computational resources, the plethora of interesting problems with practical impact, that academic publishing is encouraged, and that Google is generally a great place to go to work each day.<br /><br />For these reasons and more, I decided to apply for a second internship. This year, I was with the Brain team in Zurich, focusing on fundamental machine learning research. Being on this team is as close as I imagine it gets to being in an academic lab while in industry — people have a lot of freedom in choosing their research topic and writing papers and having a research impact is the main goal, yet there are several advantages over my experience of academia. The level of software engineering skill (and presence of dedicated software engineers collaborating on the projects) lead to shared code bases that enable prototyping and experimenting at large scale much more easily and quickly than in typical academic labs. These factors, combined with a more collaborative atmosphere, lead to the undertaking of larger scale, potentially more impactful projects.<br /><br /><b>What project was your internship focused on? What was the outcome of your research?&nbsp;</b><br />In the first half of the internship, I worked on understanding the theoretical underpinnings of some recently proposed representation learning algorithms. This line of research led to a research paper&nbsp;<a href=\"https://arxiv.org/abs/1907.13625\">On Mutual Information for Representation Learning</a>&nbsp;which is currently under submission at the International Conference on Learning Representations (<a href=\"https://iclr.cc/\">ICLR</a>), one of the top machine learning conferences. In the second half, I worked on new algorithms for representation learning. This work is ongoing, and the resulting paper hasn’t been published yet.<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-WwzAB36zHBM/Xe6KjB5KB3I/AAAAAAAAAyI/LmtleADRuvQU235QLGWVeSelKwtXHN5BwCEwYBhgL/s1600/unnamed%2B%252845%2529.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"512\" data-original-width=\"384\" src=\"https://1.bp.blogspot.com/-WwzAB36zHBM/Xe6KjB5KB3I/AAAAAAAAAyI/LmtleADRuvQU235QLGWVeSelKwtXHN5BwCEwYBhgL/s1600/unnamed%2B%252845%2529.jpg\" /></a></div><b>Did you write your own code? What advice do you have for future interns?</b><br />Yes. Coding at Google is a little different than what I was used to in academia in two main ways. The first is that a lot of code is shared, and as a result, good software engineering practices are followed! This also results in larger code-bases that are a lot more complex than are typical in my PhD. The second is that you have access to a large amount of cutting-edge computational resources. This means that it is possible to run very large scale experiments.<br /><br />My advice to future interns is that once you’ve started, there are many Google-specific things that have to be learned, so when you inevitably get stuck on something, the best thing to do is to ask someone for help. Asking questions is encouraged because it is the fastest way to improve your productivity and thus the productivity of your team!<br /><br /><b>What key skills have you gained from your time at Google? What impact has this internship experience had on your research?</b><br />My software engineering skills have definitely improved a lot as a result of working here. I’ve also learned a lot about how organisations and teams can be structured and managed in order to be most productive. I have learned a great deal about areas of research that I hadn’t worked in before the internship, and I hope to continue my research in these areas after my internship ends. The exposure to good software engineering practices has had a big impact in that it has facilitated my research in more practical areas involving lots of coding, in contrast to the more theoretical research I did earlier in my PhD.<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-U6NNCAGcnIc/Xe6KjedXUSI/AAAAAAAAAyQ/XGgYzT1KBhQuUmQ1T2506quDyZzUBeawQCEwYBhgL/s1600/unnamed%2B%25289%2529.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"512\" data-original-width=\"384\" src=\"https://1.bp.blogspot.com/-U6NNCAGcnIc/Xe6KjedXUSI/AAAAAAAAAyQ/XGgYzT1KBhQuUmQ1T2506quDyZzUBeawQCEwYBhgL/s1600/unnamed%2B%25289%2529.png\" /></a></div><b>Looking back on your experiences now: Why should a PhD student apply for an internship at Google? Any advice to offer?</b><br />My main reasons to do an internship at Google:<br /><br />You will be exposed to very interesting problems that you may not see elsewhere.<br />You will work with and learn from colleagues who are experts in their fields.<br />I may have mentioned this once or twice already, your software engineering skills will improve a lot!<br />It’s incredible the amount you can achieve and learn in a 3-4 month internship at Google.<br /><br />In order to prepare for coding interviews, I recommend the Cracking the Coding Interview book (though some chapters might not be relevant). I typed out my solutions in a Google doc to match the real interview experience as closely as possible. For more practice questions, there are many websites that have libraries of example coding interview questions, you can find many of them on&nbsp;<a href=\"https://techdevguide.withgoogle.com/\">Google's Tech Dev Guide</a>.<br /><br />To prepare for a research interview, I recommend practicing talking about your research at a high level to those that might know only the basics of your area. You should also review the basics of machine learning and deep learning, e.g. be able to explain basic concepts such as empirical risk minimization/generalisation/overfitting, common architectures (MLPs/convolutions,) and training techniques (SGD/momentum/Adam).<br /><div><br /></div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google Students",
    "uri": "http://www.blogger.com/profile/15517669815238556768",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 56
}