{
  "title": "My Journey: From Business Analyst to Data Scientist",
  "link": "https://dimensionless.in/career-transition-my-journey-from-business-analysis-to-data-science/",
  "comments": "https://dimensionless.in/career-transition-my-journey-from-business-analysis-to-data-science/#respond",
  "dc:creator": "Pooja Sahatiya",
  "pubDate": "Tue, 21 Jul 2020 02:30:25 +0000",
  "category": [
    "Career Transitions",
    "Data Science",
    "Career Switch Data Science",
    "Career Transition",
    "data science careers",
    "data science job",
    "data science professional",
    "data science skillset",
    "Data Science Success Story",
    "future ready careers",
    "Hardware Engineer",
    "Learn Data Science and Business Analytics",
    "Machine Learning",
    "Network Engineer",
    "Research Associate"
  ],
  "guid": "https://dimensionless.in/?p=225333",
  "description": "Good course structure and in-depth teaching were 2 key factors that impressed me at Dimensionless.",
  "content:encoded": "\n<h2>Success Story: An upgrade from Analysis to Data Science</h2>\n<p>Akash Lamba was a successful Business Analyst who wanted to take the next step in advancing his career. He joined Dimensionless to switch from Business Analysis to Data Science.</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><i><span style=\"font-weight: 400;\">When you set out to learn a new skill, the biggest hurdle is finding the relevant content. After finding it, a bigger hurdle is learning it thoroughly.</span></i></p>\n<cite>&#8211; <span style=\"font-weight: 400;\">Akash Lamba</span></cite></blockquote>\n\n\n\n<h3>Background</h3>\n\n\n\n<p><strong>Education:</strong> <span style=\"font-weight: 400;\">B.Tech. in Electronics and Telecommunications</span></p>\n\n\n\n<table class=\"wp-block-table is-style-stripes\">\n<tbody>\n<tr>\n<td><strong>Previous Profile  >>></strong></td>\n<td><strong>Current Profile</strong></td>\n</tr>\n<tr>\n<td>\n<p><strong>Profile: </strong><span style=\"font-weight: 400;\">Banking Domain</span></p>\n<p><strong>Designation: </strong><span style=\"font-weight: 400;\">Senior Business Analyst </span></p>\n<strong>Experience: </strong><span style=\"font-weight: 400;\">2 years and 3 months</span></td>\n<td>\n<p><strong>Profile: </strong><span style=\"font-weight: 400;\">Data Scientist</span></p>\n<p><strong>Designation: </strong><span style=\"font-weight: 400;\">Tableau Consultant</span></p>\n<p><strong>Domain:</strong> <span style=\"font-weight: 400;\"> Manufacturing</span></p>\n</td>\n</tr>\n</tbody>\n</table>\n\n\n\n<div class=\"wp-block-spacer\" style=\"height: 32px;\" aria-hidden=\"true\"> </div>\n\n\n\n<h3>My journey into Data Science<br /><br /></h3>\n\n\n\n<h4>Why Data Science?</h4>\n\n\n\n<p><span style=\"font-weight: 400;\">Being a Business Analyst, I was aware that many companies have centred their businesses on data. The demand for Data professionals was going to only increase. The future is bright in data-related profiles and I can see a secure future for myself. After some experience as a Business Analyst, Data Science would be the perfect next step for a career-upgrade. So, I was sure of getting into Data Science.</span></p>\n\n\n\n<h4>Why Dimensionless?</h4>\n\n\n\n<p><span style=\"font-weight: 400;\">When you set out to learn a new skill, the biggest hurdle is finding the relevant content. After finding it, a bigger hurdle is learning it thoroughly.</span></p>\n<p><span style=\"font-weight: 400;\">I did my own research over a couple of days. I came across many courses and after going through many data science courses online I landed on Dimensionless website. When I had a word with a Dimensionless mentor, who reserved a seat for me at their Demo Class. Coming from a similar background, I could judge their knowledge and course curriculum. At the time, Dimensionless was the only class offering the flexibility of time (post-work and weekend classes), a holistic curriculum and mentor-led classes. I decided to sign-up for the ‘Data Science Specialization Course with Python and R’ at Dimensionless. </span></p>\n\n\n\n<h4>Experience with Dimensionless?</h4>\n\n\n\n<p>My experience with Dimensionless was excellent. All the topics were very well-taught and in-depth concepts are covered. The best thing is that I could resolve doubts instantly during the live sessions. The mentors were very friendly and made sure everyone&#8217;s doubts were cleared. In fact, they have always happily helped me with my issues even after the course was completed.<br /><br />Dimensionless makes learning interesting by explaining the concepts well with practical implementation simultaneously. They allow you to attend different classes if you want to expedite your learning or missed any class. HR is very supportive in giving placement assistance and also gives personal attention to build up the resume as well. I definitely recommend Dimensionless to everyone and anyone who is serious about Data Science.</p>\n\n\n\n<h3>Career Transition to Data Science</h3>\n\n\n\n<p>During the last 1 month of the course, with the help of project mentoring and resume-building activities at Dimensionless, I updated my profile. After my resume-building was completed, I started searching for internships in Data Science and finally ended up in a start-up as a Data Science Intern. After completing my internship for 5 months I again started applying for jobs.</p>\n<p>With the help of Dimensionless network and placement assistance, I was able to apply to many companies for Data Science. After circulating my resume and interviewing in my companies I finally got my first job in the Data Science field as a Tableau Consultant. I always loved visualizing data with business domain knowledge and really got lucky to get into my field of interest. </p>\n\n\n\n<figure class=\"wp-block-pullquote\">\n<blockquote>\n<p>Thanks to Dimensionless for supporting me from a time with no job in hand to a time where I finally got my job.</p>\n</blockquote>\n</figure>\n<p>&nbsp;</p>\n<p>There are many more like Akash who have switched to Data Science from different domains. Read their <a href=\"https://dimensionless.in/category/career-transitions/\">success stories here</a>.</p>\n<p>Want to know whether such a Career Transition is possible for you?<br /><strong>Follow this </strong><a href=\"http://dimensionless.in/\"><strong>link</strong></a>, and make it possible with <a href=\"http://dimensionless.in\">Dimensionless Techademy</a>!</p>\n\n\n\n<p>Furthermore, if you want to read more about data science, you can <strong>read our blogs </strong><a href=\"http://dimensionless.in/blog\"><strong>here</strong></a><strong>.</strong></p>\n<p>&nbsp;</p>\n\n\n",
  "wfw:commentRss": "https://dimensionless.in/career-transition-my-journey-from-business-analysis-to-data-science/feed/",
  "slash:comments": 0
}