{
  "title": "Three arrested after attempt to smuggle people in high-powered boat",
  "link": "https://www.asianexpress.co.uk/2022/10/three-arrested-after-attempt-to-smuggle-people-in-high-powered-boat/",
  "comments": "https://www.asianexpress.co.uk/2022/10/three-arrested-after-attempt-to-smuggle-people-in-high-powered-boat/#respond",
  "dc:creator": "Andleeb Hanif",
  "pubDate": "Mon, 31 Oct 2022 13:57:34 +0000",
  "category": [
    "News",
    "Midlands",
    "National",
    "people smuggling",
    "yorkshire"
  ],
  "guid": "https://www.asianexpress.co.uk/?p=45719",
  "description": "<p>Three people have been arrested after a joint operation between the National Crime Agency and the Belgian Federal Police foiled an attempt to smuggle migrants to the UK using a high-powered rigid hulled inflatable boat (RHIB). Belgian officers arrested two men, aged 34 and 44 from Basingstoke, on suspicion of people smuggling offences as they [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.asianexpress.co.uk/2022/10/three-arrested-after-attempt-to-smuggle-people-in-high-powered-boat/\">Three arrested after attempt to smuggle people in high-powered boat</a> appeared first on <a rel=\"nofollow\" href=\"https://www.asianexpress.co.uk\">Asian Express Newspaper</a>.</p>\n",
  "content:encoded": "\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"639\" src=\"https://www.asianexpress.co.uk/wp-content/uploads/2022/10/Boat-in-Belgium_22-1024x639.jpg\" alt=\"\" class=\"wp-image-45720\" srcset=\"https://www.asianexpress.co.uk/wp-content/uploads/2022/10/Boat-in-Belgium_22-1024x639.jpg 1024w, https://www.asianexpress.co.uk/wp-content/uploads/2022/10/Boat-in-Belgium_22-300x187.jpg 300w, https://www.asianexpress.co.uk/wp-content/uploads/2022/10/Boat-in-Belgium_22-768x479.jpg 768w, https://www.asianexpress.co.uk/wp-content/uploads/2022/10/Boat-in-Belgium_22-696x434.jpg 696w, https://www.asianexpress.co.uk/wp-content/uploads/2022/10/Boat-in-Belgium_22-1068x667.jpg 1068w, https://www.asianexpress.co.uk/wp-content/uploads/2022/10/Boat-in-Belgium_22-673x420.jpg 673w, https://www.asianexpress.co.uk/wp-content/uploads/2022/10/Boat-in-Belgium_22.jpg 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /></figure>\n\n\n\n<p>Three people have been arrested after a joint operation between the National Crime Agency and the Belgian Federal Police foiled an attempt to smuggle migrants to the UK using a high-powered rigid hulled inflatable boat (RHIB).</p>\n\n\n\n<p>Belgian officers arrested two men, aged 34 and 44 from Basingstoke, on suspicion of people smuggling offences as they arrived on the coast near Nieuwpoort at 4.30am on Sunday 30 October. Twelve migrants, believed to be Albanian nationals, were also detained.</p>\n\n\n\n<p>A third man, aged 46, was arrested by the NCA in Aylesbury, Buckinghamshire, later the same day on suspicion of assisting unlawful immigration. He remains in custody and is being questioned.</p>\n\n\n\n<p>The group are alleged to be part of a gang organising a series of people smuggling runs to the UK from Europe.</p>\n\n\n\n<p>NCA Branch Commander Colin Williams said: “We believe this operation has disrupted a suspected organised crime group involved in bring people to the UK illegally.</p>\n\n\n\n<p>“Attempts to reach the UK by small boat are extremely dangerous and people smugglers do not care about the safety of their passengers.</p>\n\n\n\n<p>“Working closely with partners including Belgian Federal Police, Border Force and Immigration Enforcement, these arrests show that the NCA will work across international borders to target people smuggling gangs.”</p>\n\n\n\n<p>Belgian Public Prosecutor Frank Demeester said: “The fight against organised human smuggling is an absolute priority for the Public Prosecutor&#8217;s Office of West-Flanders.</p>\n\n\n\n<p>“That is why the Belgian Federal Police have deployed significant resources to thwart these acts of human smuggling. We want to avoid at all costs, that people are put in danger on the North Sea. By now it is common knowledge that international cooperation with British colleagues from the NCA and with our European partners is very good within this phenomenon.”</p>\n\n\n\n<p>The NCA alone has more than 60 live investigations into networks or individuals in the top tier of organised immigration crime or human trafficking.</p>\n\n\n\n<p>Much of this criminality sits outside of the UK and the NCA has built up our intelligence sharing effort with law enforcement partners in Belgium, France and beyond.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.asianexpress.co.uk/2022/10/three-arrested-after-attempt-to-smuggle-people-in-high-powered-boat/\">Three arrested after attempt to smuggle people in high-powered boat</a> appeared first on <a rel=\"nofollow\" href=\"https://www.asianexpress.co.uk\">Asian Express Newspaper</a>.</p>\n",
  "wfw:commentRss": "https://www.asianexpress.co.uk/2022/10/three-arrested-after-attempt-to-smuggle-people-in-high-powered-boat/feed/",
  "slash:comments": 0
}