{
  "title": "What&#8217;s in My Portfolio (and How I Manage It)",
  "link": "https://www.madfientist.com/my-portfolio/",
  "comments": "https://www.madfientist.com/my-portfolio/#comments",
  "dc:creator": "The Mad Fientist",
  "pubDate": "Mon, 18 May 2020 12:18:00 +0000",
  "category": [
    "FIRE (Financial Independence / Retire Early)",
    "Investing"
  ],
  "guid": "http://www.madfientist.com/?p=6643",
  "description": "<p class=\"lead\">Sticking to your long-term investing goals during turbulent times can be difficult but portfolio rules and systems can help.   Here are mine...</p>\n<p class=\"more-link-p\"><a class=\"btn btn-danger\" href=\"https://www.madfientist.com/my-portfolio/\">Read more &#8594;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/my-portfolio/\">What&#8217;s in My Portfolio (and How I Manage It)</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "content:encoded": "\n<p>A pandemic is affecting the entire world.  Economies have shut down.  Over 36 million people in the United States are newly unemployed.  The price of oil went negative for a bit.  We experienced the fastest 30% drop in stocks <em>ever</em> and then got to enjoy a 30%+ rebound immediately after.  </p>\n\n\n\n<p>And all this craziness happened within the last couple of months.</p>\n\n\n\n<p>Although this is an uncomfortable time for everyone, it could also be an incredible learning opportunity.  </p>\n\n\n\n<p>You know what a crash feels like (i.e. peak &#8220;fear&#8221;), what record highs feel like (i.e. peak &#8220;greed&#8221;), and you can appreciate how difficult it is to predict <em>anything</em> about the world or the markets.</p>\n\n\n\n<p>Since being in the middle of market turmoil is a lot different than thinking about a future crash, it&#8217;s worth reflecting on your investment plan.</p>\n\n\n\n<p>As Mike Tyson famously said, &#8220;Everyone has a plan until they get punched in the mouth.&#8221;  Now that you know how it feels to get punched in the mouth, where has your plan fallen over?  Have your emotions caused you to override the rules you had set for yourself?  Are there systems or automations you can put in place so next time that doesn&#8217;t happen?</p>\n\n\n\n<p>While your memories are fresh, think about these extremes and develop a better plan for your portfolio so that the next crash isn&#8217;t as costly or traumatic.</p>\n\n\n\n<h2>What&#8217;s In My Portfolio</h2>\n\n\n\n<p>To help you develop your investing plan, I&#8217;m going to explain all the mechanics of my portfolio.  </p>\n\n\n\n<p>I&#8217;ll dive into the investments I chose, the systems I have in place, and the rules I&#8217;ve set.  I&#8217;ll explain how they trick me into doing the right things at the right times (and keep me from doing the wrong things).</p>\n\n\n\n<p>I&#8217;ll also share a new spreadsheet I created to help you implement similar strategies.</p>\n\n\n\n<p>None of what I do is special, fancy, or complicated but maybe it&#8217;s the simplicity that allows me to stay the course during uncertain times.</p>\n\n\n\n<p>I&#8217;ll also describe what I&#8217;ve learned from the current crisis and explain how I&#8217;ve enhanced my rules based on what I&#8217;ve learned.  Even though I experienced a big crash before as an investor, back in 2007, I still found myself struggling with a certain aspect of my investing plan this time.</p>\n\n\n\n<p>Before diving into my portfolio, let&#8217;s start with the lesson I thought I had learned from my first crash yet still struggled with this time…</p>\n\n\n\n<h2>Learning from My First Crash</h2>\n\n\n\n<p>It was 2007.  </p>\n\n\n\n<p>We had just sold our house in Scotland for over 50% more than we bought it for 2.5 years earlier and I was going to start investing that money into the markets.</p>\n\n\n\n<p>Stocks went down a bit and I was happy that shares were on sale so I bought some.  I can&#8217;t remember the exact percentages but I let&#8217;s say I invested 30% of the money I planned to invest. </p>\n\n\n\n<p>It felt great getting a deal!</p>\n\n\n\n<p>Then the next day was even worse.  I invested a bit more but I didn&#8217;t have as much left so I decreased the amount I put into the markets.</p>\n\n\n\n<p>A few days later, it got much MUCH worse.</p>\n\n\n\n<h2>Catching a Falling Knife</h2>\n\n\n\n<p>As the financial world collapsed, I kept putting more money in but I invested less and less each time because every time I put money in, I&#8217;d lose more money.</p>\n\n\n\n<p>This continued until the market bottomed in March 2009.  </p>\n\n\n\n<p>By then though, I was just trickling in $150 every so often.  Not because I was out of money to invest but because I assumed stocks would keep going down and I didn&#8217;t want to make the mistake I made at the beginning by investing such a big percentage of the cash while things were dropping.</p>\n\n\n\n<p>I remember the market bottom vividly because I was at my grandparent&#8217;s house in Florida and I was going to do my normal small investment but the market had gone up that day.  &#8220;No big deal&#8221;, I thought.  &#8220;I&#8217;ll just invest tomorrow when it goes down again.&#8221;</p>\n\n\n\n<p>Well, it didn&#8217;t get any lower the next day.  Or the next.  It kept going up and I kept waiting for the markets to make new lows.  The new lows didn&#8217;t happen so I didn&#8217;t invest.</p>\n\n\n\n<p>Stocks were the cheapest they&#8217;ll likely ever be in my lifetime and yet I sat on a chunk of uninvested cash because I was trying to time the bottom.</p>\n\n\n\n<p>It&#8217;s easy to see now that I made a mistake but when you&#8217;re in the middle of a big drawdown, it&#8217;s hard to know what to do.</p>\n\n\n\n<p>When the markets started to recover in 2009, it didn&#8217;t feel like things were any better.  It felt like everything was going to keep getting worse so the upward moves didn&#8217;t make sense.</p>\n\n\n\n<p>The thing is, you never know what&#8217;s going to happen or what bad things are already priced into the market.  The world could get worse but if investors already expect it to get worse, stocks could go up.  Or, if investors think things aren&#8217;t improving as fast a expected, stocks could take a big dive even when things in the economy are getting better.</p>\n\n\n\n<p>As I learned, putting money into a falling market is a lot more difficult than it seems.</p>\n\n\n\n<p>Ben Carlson from AWealthOfCommonSense.com summed it up perfectly in <a rel=\"noopener\" aria-label=\"a recent article (opens in a new tab)\" href=\"https://awealthofcommonsense.com/2020/03/what-happens-to-stocks-after-a-big-down-month/\" target=\"_blank\">a recent article</a>:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Every investor is told to buy low and sell high. But most don’t realize that buy low typically works out to buy low, then buy lower, then buy even lower, and once you really hate yourself, buy lower than you thought was possible.</p></blockquote>\n\n\n\n<p>I thought I learned from my 2008/2009 mistake so I assumed I&#8217;d be better prepared this time around.</p>\n\n\n\n<p>I was wrong.</p>\n\n\n\n<p>Although I&#8217;m used to the feeling of buying low, then buying lower, then hating yourself and buying even lower, I started falling into the same trap I fell into in 2007 &#8211; I stopped buying enough because I thought I <em>knew</em> that the markets were going to go lower.</p>\n\n\n\n<p>I had the cash, stocks were on sale, and yet I was timidly trickling money in again because I thought things were going to get worse before they got better (my brain and emotions were again trying to sabotage my plan).</p>\n\n\n\n<p>That&#8217;s where systems and rules can save you (and me).</p>\n\n\n\n<p>So let&#8217;s dive into my portfolio and explore the systems and rules I have in place (including the new rules I&#8217;ve developed to solve this particular problem)…</p>\n\n\n\n<h2>Two Baskets</h2>\n\n\n\n<p>At the very top level, I&#8217;ve split my money into two baskets:</p>\n\n\n\n<ul><li>FI Portfolio</li><li>Cash Buffer/Real-Estate Fund</li></ul>\n\n\n\n<p>My FI portfolio is what we&#8217;d live on if all our other income went away.  </p>\n\n\n\n<p>As explained in the <a href=\"https://www.madfientist.com/safe-withdrawal-rate/\" target=\"_blank\" rel=\"noopener\" aria-label=\"Safe Withdrawal Rate (opens in a new tab)\">Safe Withdrawal Rate</a> post, a 3.5% withdrawal rate is <em>very</em> conservative so I keep enough money in this basket so that 3.5% of the value of the portfolio could sustain our annual spending.</p>\n\n\n\n<p>In my other basket, I&#8217;ve started accumulating cash that I may one day use to buy some real estate.  We currently rent and I enjoy renting but I imagine we&#8217;ll want to put down roots somewhere eventually, and buying somewhere will help us do that, so I&#8217;ve been building up a small real-estate fund over the years.</p>\n\n\n\n<p>When new money comes in, I either top up the FI portfolio (to maintain a 3.5% withdraw rate) or I add it to the real-estate fund. </p>\n\n\n\n<h2>Never Sell</h2>\n\n\n\n<p>One rule I have is that I can never sell anything in my FI Portfolio (unless it&#8217;s for rebalancing purposes).</p>\n\n\n\n<p>Getting back in after selling is one of the hardest things to do as an investor so I don&#8217;t ever put myself in the position to have to do that.</p>\n\n\n\n<p>It&#8217;s very tempting though.  In fact, I thought about it in February before all this stuff kicked off.</p>\n\n\n\n<p>On February 7th, I had dinner with my brother-in-law.  He&#8217;s a microbiologist and I asked him what he thought about the new virus that had forced China to shut down.  He said it was extremely concerning and he thought it was already way too big of a problem to contain.</p>\n\n\n\n<p>At that time, stocks were hitting record highs and hadn&#8217;t seen a significant pullback in a long time.  If there was any time to move some money to cash, it was that one.</p>\n\n\n\n<p>I knew better though and even considering what&#8217;s happened since, I&#8217;m so glad I held my nerve and followed my own rule of never selling.</p>\n\n\n\n<p>Had I sold my stocks on February 10th (the first weekday after that dinner with my brother-in-law), here&#8217;s what would have happened…</p>\n\n\n\n<p>Stocks would have continued their rise for the next nine days.  Each day would have been more excruciating than the last because I would have been second-guessing my decision and beating myself up for going to cash.</p>\n\n\n\n<p>In all honesty, I&#8217;m not sure I would have had the patience to wait and may have bought back in at a higher price before the crash.</p>\n\n\n\n<p>Assuming I did stay in cash, I would have felt like a genius a few weeks later when everything dropped 30%+ but then I would have had to figure out when to get back in, which is even more difficult.</p>\n\n\n\n<p>The markets inexplicably rebounded 30%+ after the March 23rd lows.  There&#8217;s no way I would have bought back into stocks on March 23rd because, at the time, it felt like stocks could easily drop another 20%+ since people were still freaking out and the virus was looking really bad.  </p>\n\n\n\n<p>So after a rebound of 10%, would I have gotten back in then?  Hell no!  I would have assumed it was a dead-cat bounce and stocks would go even lower soon.</p>\n\n\n\n<p>How about today, when we&#8217;re 25%+ above those lows?  Nope.  I&#8217;d be really pissed off I missed out on all those gains but I&#8217;d also worry an even bigger pullback is possible.  Unemployment is soaring, the virus is still killing thousands of people, and the full ramifications of the economic shutdowns aren&#8217;t fully apparent yet.  </p>\n\n\n\n<p>How could I buy stocks in this environment when things are looking worse than they were in early February?</p>\n\n\n\n<p>But what if a new COVID-19 treatment gets approved tomorrow or something else happens that causes markets to keep going up from here?  Could I stand to be in cash and miss out on even more gains and new highs?  </p>\n\n\n\n<p>How would I ever get back in?</p>\n\n\n\n<p>As you can see, it&#8217;s an extremely difficult situation to be in, even if you get out at the right time. That&#8217;s why I don&#8217;t do it.</p>\n\n\n\n<p>Instead, I alter my asset allocation when my risk tolerance changes.</p>\n\n\n\n<p>Let&#8217;s dive into that asset allocation…</p>\n\n\n\n<h2>Portfolio Asset Allocation</h2>\n\n\n\n<p>My FI portfolio is very simple and only consists of three funds:</p>\n\n\n\n<ul><li>Total Stock Market Index Fund</li><li>Total International Stock Market Index Fund</li><li>Total Bond Market Index Fund</li></ul>\n\n\n\n<p>For these three funds, I&#8217;ve settled on the following allocation:</p>\n\n\n\n<ul><li>65%-75% Total Stock Market Index Fund</li><li>25% Total International Stock Market Index Fund</li><li>0-10% Total Bond Market Index Fund</li></ul>\n\n\n\n<p><em>Note: Although my FI portfolio can sustain our spending, my <a rel=\"nofollow noopener\" aria-label=\" (opens in a new tab)\" href=\"https://www.madfientist.com/to-travel-cards/\" target=\"_blank\">credit-card search tool for travel hackers</a> is still bringing in more income than we spend so my asset choices are more aggressive than they would be if I wasn&#8217;t earning any income.</em></p>\n\n\n\n<p>I&#8217;ll explain more later about why my allocations are ranges (and why this has been beneficial recently).</p>\n\n\n\n<h2>Buying Low</h2>\n\n\n\n<p>I like having three funds because it provides a bit of diversification and it also helps me buy low.  </p>\n\n\n\n<p>Since I&#8217;m still earning money, I don&#8217;t sell anything and I just rebalance with new money.</p>\n\n\n\n<p>Each month, I plug my numbers into a spreadsheet and it tells me how out of whack my allocation is and what I need to buy to fix it.</p>\n\n\n\n<p>Here is a simplified version of that spreadsheet (with dummy numbers) that I created to share with you:</p>\n\n\n\n\t\t\t<div class=\"wp-block-image\">\n\t\t\t<figure class=\"aligncenter size-large\"><img loading=\"lazy\" width=\"700\" height=\"253\" src=\"https://www.madfientist.com/wp-content/uploads/2020/05/no-sell-rebalancing.png\" alt=\"\" class=\"wp-image-6655\" srcset=\"//www.madfientist.com/wp-content/uploads/2020/05/no-sell-rebalancing.png 700w, //www.madfientist.com/wp-content/uploads/2020/05/no-sell-rebalancing-300x108.png 300w\" sizes=\"(max-width: 700px) 100vw, 700px\" /></figure></div>\n\t\t\n\n\n<p><em>To download a copy of this spreadsheet, <a href=\"https://pages.madfientist.com/portfolio-strategies\" rel=\"noopener nofollow\" target=\"_blank\">click here</a>!</em></p>\n\n\n\n<p><em>Once you&#8217;ve downloaded the spreadsheet, simply update the numbers shaded in green and it will let you know where you should deploy your cash.</em></p>\n\n\n\n<p>For example, when the international stock fund wasn&#8217;t doing as well as my total stock market fund (as has been the case for the past few years), I knew that any new money I earned should go into the international fund to bring it back in line with my target allocation.</p>\n\n\n\n<h3>How This Tricks Me Into Doing the Right Thing</h3>\n\n\n\n<p>It&#8217;s been hard to invest over the last few years because markets have gone straight up for so long and everything felt expensive.</p>\n\n\n\n<p>When I switched to this system, it became easier because there was always something that looked cheap (even though the cheapness was only relative).  </p>\n\n\n\n<p>So even when all three asset classes were booming (i.e. stocks, international stocks, and bonds), one of them would have lagged behind the rest so it&#8217;d look cheap relative to the other options and I&#8217;d have no trouble buying it.  The desire to bring my portfolio back in line with my target allocation made putting money into an overheated market easier.</p>\n\n\n\n<p>And doing that was the right choice because markets kept going up far longer than I imagined they would.</p>\n\n\n\n<p>Check out this Mad Fientist reader email from April of 2014 (6 years ago!):</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>…given that the dow and the s&P are due for a correction, would you recommend keeping some money on the sidelines until that happens?</p></blockquote>\n\n\n\n<p>And here is my response:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>…market timing is a loser&#8217;s game so I always try to get my money into the market as soon as I can.  If you look back to April of last year, I bet you would have thought that a pullback was imminent and as we know, it wasn&#8217;t.  The market has marched upwards since then so if you had waited for a pullback, you&#8217;d still be waiting.  Also, how will you know it&#8217;s an actual pullback and not just a down day/week?  How long would you wait until you put your money in?  What if the market surges upwards before you do?  There&#8217;s no way to know what&#8217;s going to happen so any sort of timing is a suboptimal strategy in the long run.</p></blockquote>\n\n\n\n<p>It was difficult sending that reply because I too felt like the bull market had gone on for a long time so I was expecting a pullback.  But I knew that trying to time the market was a bad idea so I kept putting money in anyway and I kept recommending that readers do the same.</p>\n\n\n\n<p>I&#8217;m glad I did because the market kept going up until it hit its February 19th high this year, gaining another 80%+!</p>\n\n\n\n<div style=\"width: 710px\" class=\"wp-caption aligncenter\"><a href=\"https://www.madfientist.com/wp-content/uploads/2020/05/stock-prices.png\"><img class=\"size-full wp-image-6465\" src=\"https://www.madfientist.com/wp-content/uploads/2020/05/stock-prices.png\" alt=\"Stock Prices Before and After Email\" width=\"700\"></a><p class=\"wp-caption-text\">Stock Prices Before and After Email (Green Arrow)</p></div>\n\n\n\n<p>The point is, your emotions are trying to force you to change your actions but systems and rules help you fight against that.</p>\n\n\n\n<h2>Why Those Percentages?</h2>\n\n\n\n<p>I didn&#8217;t put a lot of thought into the percentages I picked because I&#8217;m more concerned with sticking to the percentages than picking the perfect percentages.</p>\n\n\n\n<p>I simply looked at the efficient frontier graphs for the various allocations and picked a blend that had high expected returns and acceptable volatility.</p>\n\n\n\n<p><em>For more information on the efficient frontier, check out this post I wrote back in 2013 &#8211; <a href=\"https://www.madfientist.com/unique-risk-minimum-variance-portfolio/\" target=\"_blank\" rel=\"noopener\">Minimum Variance Portfolio</a></em></p>\n\n\n\n<h3>US vs. International Stocks</h3>\n\n\n\n<p>As you can see on the efficient frontier for US and International stocks, somewhere around 70%/30% seems to be a sweet spot for high expected returns and low volatility.</p>\n\n\n\n<div style=\"width: 710px\" class=\"wp-caption aligncenter\"><a href=\"https://www.madfientist.com/wp-content/uploads/2020/05/us-international-efficient-frontier.png\"><img class=\"size-full wp-image-6465\" src=\"https://www.madfientist.com/wp-content/uploads/2020/05/us-international-efficient-frontier.png\" alt=\"U.S./International Stock Efficient Frontier Graph\" width=\"700\"></a><p class=\"wp-caption-text\">Source: https://www.bogleheads.org/wiki/Domestic/International</p></div>\n\n\n\n<p>I settled on 72%/28% US/International for myself because 2s and 8s are nicer-colored numbers in my mind than the other options (I&#8217;m actually serious&#8230;this is why I try to take my ridiculous brain out of my investing decision-making as much as possible).</p>\n\n\n\n<h3>Stocks vs. Bonds</h3>\n\n\n\n<p>Here is the efficient frontier for stocks and bonds (for 1960-2004):</p>\n\n\n\n<div style=\"width: 710px\" class=\"wp-caption aligncenter\"><a href=\"https://www.madfientist.com/wp-content/uploads/2020/05/stocks-bonds-efficient-frontier.png\"><img class=\"size-full wp-image-6465\" src=\"https://www.madfientist.com/wp-content/uploads/2020/05/stocks-bonds-efficient-frontier.png\" alt=\"Stocks/Bonds Efficient Frontier Graph\" width=\"700\" /></a><p class=\"wp-caption-text\">Source: https://www.bogleheads.org/forum/viewtopic.php?t=1005</p></div>\n\n\n\n<p>I settled on 90%/10% for my allocation because I want to mainly be in stocks but I wanted to at least have some bonds for a bit of diversification and to have another asset class to rebalance with.</p>\n\n\n\n<h3>Personal Efficiency Graph</h3>\n\n\n\n<p>These decisions provide me with an aggressive but efficient allocation, as indicated by my own portfolio&#8217;s efficiency graph:</p>\n\n\n\n<div style=\"width: 710px\" class=\"wp-caption aligncenter\"><a href=\"https://www.madfientist.com/wp-content/uploads/2020/05/mad-fientist-portfolio-efficiency-graph.png\"><img class=\"size-full wp-image-6465\" src=\"https://www.madfientist.com/wp-content/uploads/2020/05/mad-fientist-portfolio-efficiency-graph.png\" alt=\"Mad Fientist's Portfolio Efficiency Graph\" width=\"700\" /></a><p class=\"wp-caption-text\">Efficiency Graph for My Portfolio</p></div>\n\n\n\n<p>To automatically generate an efficiency graph for your own portfolio, <a rel=\"noopener\" aria-label=\"click here (opens in a new tab)\" href=\"https://www.madfientist.com/go/personal-capital/\" target=\"_blank\">click here</a> to sign up for a free Personal Capital account and then click on Planning > Investment Checkup!</p>\n\n\n\n<h2>Asset Location</h2>\n\n\n\n<p>In addition to deciding what to invest in (and how much), it&#8217;s also important to think about where each of those funds is going to live.</p>\n\n\n\n<p>Income from bonds usually gets taxed as ordinary income, so bonds are better off in a tax-deferred account like an IRA or 401(k).</p>\n\n\n\n<p>With international stock funds, you can sometimes get a tax credit for foreign taxes paid but only if those funds are in a taxable account.</p>\n\n\n\n<p>Here&#8217;s a great <a href=\"https://www.bogleheads.org/wiki/Tax-efficient_fund_placement\" target=\"_blank\" rel=\"noopener\" aria-label=\"Boglehead post (opens in a new tab)\">Boglehead post</a> all about asset location, if you want to dive deeper into this important aspect of investing.</p>\n\n\n\n<p>This is where I decided to put my different assets:</p>\n\n\n\n<ul><li>Bonds &#8211; Tax-Deferred Accounts (e.g. Traditional IRA, 403b, etc.)</li><li>International Stocks &#8211; Taxable Account </li><li>US Stocks &#8211; Everywhere and Anywhere</li></ul>\n\n\n\n<h3>How This Tricked Me into Buying Bonds</h3>\n\n\n\n<p>These asset location decisions helped me buy into bonds over the last few years and I&#8217;m glad that I did.</p>\n\n\n\n<p>I had been sitting on too much cash over the last few years and I wanted to add to my portfolio but stocks were hitting record highs and I was getting uneasy.  </p>\n\n\n\n<p>My cash wasn&#8217;t being productive so I wanted to diversify into bonds but they seemed like they were terrible investments at the time too.  Interest rates were at record lows and it seemed they could only go up from there (which would cause the value of the bonds to drop).</p>\n\n\n\n<p>I knew that buying bonds was the right decision for my long-term plans but I couldn&#8217;t force myself to use my cash to buy bonds.</p>\n\n\n\n<p>Thankfully, my portfolio structure helped trick me into doing it.  Here&#8217;s what I did:</p>\n\n\n\n<ul><li>I sold $x of stocks in my IRA and bought $x of bonds in the same account</li><li>I bought $x of stocks in my taxable account using my cash</li></ul>\n\n\n\n<p>So in effect, I just bought $x bonds with my cash but it felt way better than that.</p>\n\n\n\n<p>Here&#8217;s how it felt in my mind…</p>\n\n\n\n<ul><li>Hell yeah!! I locked in all those juicy stock gains and didn&#8217;t have to pay any tax on them because they&#8217;re in my IRA!</li><li>I bought the bonds that my portfolio needed and I put them in my tax-deferred IRA, which is where they need to be!</li><li>I maintained my appropriate stock allocation but now I have some stocks in my taxable account with a high cost basis, which I can use for <a rel=\"noopener\" href=\"https://www.madfientist.com/tax-loss-harvesting/\" target=\"_blank\">tax-loss harvesting</a> next time the markets go down!</li></ul>\n\n\n\n<p>This simple change in thinking helped me do something I had been putting off for months and it worked out great because here&#8217;s what happened to the value of those bonds since then (let me remind you, I was <em>convinced</em> when I bought them that they only had one way to go…down):</p>\n\n\n\n<div style=\"width: 710px\" class=\"wp-caption aligncenter\"><a href=\"https://www.madfientist.com/wp-content/uploads/2020/05/bond-prices.png\"><img class=\"size-full wp-image-6465\" src=\"https://www.madfientist.com/wp-content/uploads/2020/05/bond-prices.png\" alt=\"Bond Prices\" width=\"700\" /></a><p class=\"wp-caption-text\">Green arrows indicate where I bought (despite thinking prices would go down)</p></div>\n\n\n\n<p><em>Side Note: It is surprising how easy it is to delude yourself into thinking you know where the markets are going, no matter how many times you failed to make accurate predictions in the past!</em></p>\n\n\n\n<h2>Ranges</h2>\n\n\n\n<p>Let&#8217;s return to the ranges I talked about before.</p>\n\n\n\n<p>I mentioned that I try to have 0%-10% bonds and 90-100% stocks.</p>\n\n\n\n<p>This is great because it allows me to feel like I&#8217;m timing the market (which my brain loves to do) without damaging my long-term investing success.</p>\n\n\n\n<p>When stocks felt overvalued last year, I put more money into bonds and it felt better than investing in expensive stocks.  I kept adding to bonds until I got up to 10%. </p>\n\n\n\n<p>Now that stocks have gone down and bonds have gone up, I can move back into a heavier stock allocation and feel like I&#8217;m taking advantage of the lower stock prices (by selling bonds to buy stocks).</p>\n\n\n\n<h2>Picking a Range</h2>\n\n\n\n<p>If you don&#8217;t know what allocation range you&#8217;d be comfortable with, now is a great time to figure it out.</p>\n\n\n\n<p>Think about how you felt when markets were at all-time highs in February and compare it to how you felt in March when they were over 30% down.  </p>\n\n\n\n<p>In March, did you wish you weren&#8217;t taking as many risks in February?  Did you freak out more than you expected when stocks crashed?  Did you wish you had constructed your portfolio differently to better handle a big drop like that?</p>\n\n\n\n<p>Now, assume these recent market gains are the start of a new multi-year bull market.  What would you like to have your portfolio look like at this stage?  </p>\n\n\n\n<p>If you can figure out a happy allocation for each of these scenarios, set those numbers as your range.</p>\n\n\n\n<h2>Adjust as You Go</h2>\n\n\n\n<p>What you come up with doesn&#8217;t have to be perfect and it will likely change as your situation changes.</p>\n\n\n\n<p>Before this latest downturn, I was very comfortable being 100% in stocks.  I knew that I had a long time horizon and I still had income coming in so I was happy taking more risks to get higher expected returns.  </p>\n\n\n\n<p>But when the markets started tanking in March, I was relieved to have 10% in bonds.  I already hit my FI number so why try to get an outsized return with 100% stocks and deal with the increased risks associated with that allocation when I already have enough?</p>\n\n\n\n<p>I also like having three different types of assets to rebalance between so I now realize that 10% bonds should be my <em>minimum</em>.  My new bond range is 10%-20% and I imagine that will continue increasing as the years go by.</p>\n\n\n\n<p>If stocks hit new lows before this virus is finished, I can sell bonds until I hit 10% and then, when stocks start increasing again, I can slowly build up my bond balance until I hit 20% (hopefully right when the stock market tops out again next time).</p>\n\n\n\n<h2>Catching a Falling Knife (More Intelligently)</h2>\n\n\n\n<p>This brings us back to my problem at the beginning of this article &#8211; trying to buy stocks when the markets are tanking.</p>\n\n\n\n<p>I thought I&#8217;d be prepared this time but my brain and emotions still got in the way so I needed more rules/systems.</p>\n\n\n\n<p>Here&#8217;s what I came up with…</p>\n\n\n\n<p>After the markets had already fallen ~12% from their highs and I felt like much more falling was possible, I created a spreadsheet for my cash-deploying strategy.</p>\n\n\n\n<p>I knew that I had $x in cash that I&#8217;d be willing to deploy and I had $y in bonds that I could sell (to buy more stocks) so I determined the max I could add to my stock portfolio as stock prices decreased and I split up my contributions.</p>\n\n\n\n<p>I set up buying opportunities at -15%, -20%, -25%, -30%, -35%, and -40%.  And instead of buying fewer shares as the market dropped, as I did in 2007/2008, I planned on increasing my purchases at each stage.</p>\n\n\n\n<p>So I determined a value $x where I could invest $x at -15%, $1.5x at -20%, $2x at -25%, $3x at -30%, $3x at -35%, and $3x at -40%.</p>\n\n\n\n<p>If the market ends up going below 40% the February highs, that&#8217;s when I start selling even more bonds to buy stocks.  </p>\n\n\n\n<p>The good thing about this plan is that I&#8217;m happy anywhere in my range so if markets don&#8217;t revisit the March lows, I at least deployed a big chunk of my cash and will benefit from the recovery.  </p>\n\n\n\n<p>If stocks do make new lows and I end up deploying all my cash and selling more bonds, I&#8217;ll still have an appropriate allocation for my risk tolerance and I&#8217;ll be an even better position to take advantage of any recovery that takes place.</p>\n\n\n\n<h2>Limit Orders</h2>\n\n\n\n<p>Since this plan provides specific prices to target, I can set up limit orders in Vanguard to automatically buy shares. This removes the possibility of my brain sabotaging anything.</p>\n\n\n\n<p><em>Note: Limit orders are stock buy/sell orders that specify a price target (e.g. buy x shares of VTI but only if the price is lower than $y).</em></p>\n\n\n\n<p>Limit orders are great because often, especially in extremely volatile times like these, your orders can get filled at prices even lower than the limit price you set.  For example, I had set an order to buy VTI at $143.06 and I ended up getting it for $140.00 because markets opened much lower than expected.</p>\n\n\n\n<p><em>Side note: I accidentally got a ridiculous deal on some shares during the Flash Crash because I had a limit order set up that got filled at an insanely low price.  That&#8217;s why I now set up limit orders whenever I expect a volatile open.</em></p>\n\n\n\n<h2>Spreadsheet</h2>\n\n\n\n<p>If you already downloaded the spreadsheet I mentioned at the beginning of this post, you&#8217;ll notice there&#8217;s a tab call &#8220;Bear-Market Buying&#8221;.</p>\n\n\n\n<p><em>If you haven&#8217;t yet downloaded the spreadsheet, <a href=\"https://pages.madfientist.com/portfolio-strategies\" rel=\"noopener noindex\" target=\"_blank\">click here to download now</a>!</em></p>\n\n\n\n<p>This spreadsheet allows you to easily come up with your own price targets for future market drops.</p>\n\n\n\n\t\t\t<div class=\"wp-block-image\">\n\t\t\t<figure class=\"aligncenter size-large\"><img loading=\"lazy\" width=\"700\" height=\"491\" src=\"https://www.madfientist.com/wp-content/uploads/2020/05/bear-market-buying.png\" alt=\"Bear-Market Buying Strategy\" class=\"wp-image-6660\" srcset=\"//www.madfientist.com/wp-content/uploads/2020/05/bear-market-buying.png 700w, //www.madfientist.com/wp-content/uploads/2020/05/bear-market-buying-300x210.png 300w\" sizes=\"(max-width: 700px) 100vw, 700px\" /></figure></div>\n\t\t\n\n\n<p>All you need to do is fill in the green boxes with your settings and the spreadsheet will automatically calculate the price targets and number of shares to buy at each target.  </p>\n\n\n\n<p>Then, you can create limit orders for these prices and completely ignore what the market is doing!</p>\n\n\n\n<h2>Why Are These Systems/Rules/Plans Valuable?</h2>\n\n\n\n<p>Are these plans and rules perfect?  </p>\n\n\n\n<p>Absolutely not.</p>\n\n\n\n<p>They don&#8217;t have to be though.  As long as they keep me from sabotaging myself, they&#8217;re worthwhile.</p>\n\n\n\n<p>It doesn&#8217;t matter what&#8217;s going on in the outside world because I know if I follow my rules, I&#8217;ll be doing the right thing for my long-term investing goals.</p>\n\n\n\n<p>It allows me to feel good about my actions (or inaction), even in times when my brain is screaming that I&#8217;m doing it wrong. </p>\n\n\n\n<p>I&#8217;ve accepted that I&#8217;m a fallible human.  I understand that my emotions are influencing me far more often than I like.  </p>\n\n\n\n<p>Rather than fight who I am, I instead try to minimize the influence those emotions have on my investing with rules, systems, and automations.</p>\n\n\n\n<p>And in highly uncertain times like these, those things can make all the difference.</p>\n\n\n\n<h2>What About You?</h2>\n\n\n\n<p>Do you have any portfolio rules you follow?  Do you have a better strategy for catching a falling knife?  How has your thinking changed during this latest market turmoil?</p>\n\n\n\n<p>Let me know in the comments below!</p>\n\n\n<h2>Related Post</h2><div><a href='https://www.madfientist.com/coronavirus-market-crash/' target='_blank'><div class='post_card'><div class='post_card_text'><h3 style='color:#399da8;'>Coronavirus Market Crash - Is This Time Different?</h3><p class='post_card_excerpt'>The COVID-19 coronavirus pandemic has caused stocks to crash.  Is this a normal bear market or is it different this time?  JL Collins is here with his answer.</p></div><div class='post_card_image'><img src='https://www.madfientist.com/wp-content/uploads/2020/03/coronavirus-market-crash.jpg' style='border-radius:7px;'/></div></div></a></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/my-portfolio/\">What&#8217;s in My Portfolio (and How I Manage It)</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "wfw:commentRss": "https://www.madfientist.com/my-portfolio/feed/",
  "slash:comments": 121
}