{
  "title": "EPISODE 75: Poets and Pirates, Sex and Drugs, Love and Music: D’Annunzio and L’Impresa di Fiume (Part 1",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Mon, 17 Jan 2022 21:20:19 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2022/1/17/episode-75-poets-and-pirates-sex-and-drugs-love-and-music-dannunzio-and-limpresa-di-fiume-part-1",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:61e5dbf11ca8030a48bc4520",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/4269c4dd-010a-4d5c-82a3-37d92cb3900c/HOF-75.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"61e5dcc82fed782aa0e60cc0\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/4269c4dd-010a-4d5c-82a3-37d92cb3900c/HOF-75.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“We heard that D’Annunzio was coming, and Italy and freedom were coming with him.” — </em> Anonymous Italian citizen of Fiume</p><p class=\"\"><em>“The road of excess leads to the palace of wisdom.”</em> — William Blake </p><p class=\"\"><em>“Legionaries adore him. The men from the palace fear him. Little kids think he’s the devil.”</em> — Leon Kochnitzky about Guido Keller </p><p class=\"\">This is the tale of one of the weirdest cultural-political experiments in modern history. The brutal end of WWI left many Italian soldiers dissatisfied, since the Allies refuse to grant them lands they had conquered at the price of rivers of blood. Feeling cheated by their own government and the Allies, some of these soldiers turned to the most popular man in the entire country: Gabriele D’Annunzio. Saying that he was a famous writer and a veteran of WWI doesn’t capture the magnetic power the man possessed. He was a true rock star before rock stars were a thing. He stopped traffic wherever he went. He made army units desert without using any weapon but his voice. Countless women risked their marriages, families and careers for a chance to have a fling with him. Casanova was an amateur compared to D’Annunzio. In 1919, D’Annunzio agreed to lead renegade units of the Italian Army to taking over the border city of Fiume. Despite the fact that this infuriated the Italian, French, British and American governments, D’Annunzio would go on to rule for fifteen months over an outlaw state where things that were not looked kindly upon in the world of 1919 (from drug use to free love, from the right to vote for women to nudism, from homosexuality to piracy) were widely practiced. </p><p class=\"\">Part One of this two-part series tackles the Italian experience in WWI, D’Annunzio’s literary and military career, the raid to occupy Fiume, the Futurist movement, the wild culture that sweeps through town, a pre-1960s sexual revolution, Guido Keller (the craziest man in town), and much more. </p><p class=\"\"><em>This series is dedicated to Franco Bolelli</em></p>",
  "media:content": {
    "media:title": "EPISODE 75: Poets and Pirates, Sex and Drugs, Love and Music: D’Annunzio and L’Impresa di Fiume (Part 1"
  }
}