{
  "guid": "tag:blogger.com,1999:blog-2761684730989137546.post-6269865662727502823",
  "pubDate": "Wed, 02 Nov 2022 15:04:00 +0000",
  "atom:updated": "2022-11-02T11:04:17.824-04:00",
  "title": "Capitalism Has Failed As Badly As Anything Can Fail — Caitlin Johnstone",
  "description": "<p>&nbsp;Cutting to the chase on \"capitalism\" in its present iteration. It's literally killing us.</p><blockquote><i>Pointing out the various flaws in historical attempts at communism does not address the problem that if we don’t move from competition-based models to collaboration-based ones we’re going to destroy all life on this planet in short order. We’ve still got to find a way to change.<br /><br />Have issues with Stalin and Mao? Okay. Cool. Our competition-based models are still destroying our biosphere and shoving us toward nuclear war. Our survival still depends on moving toward collaboration with each other and with our ecosystem toward the thriving of all beings. Babbling about Stalin and Mao doesn’t magically change the fact that we can’t keep doing this thing where human behavior is driven by profit and competition.<br /><br />Leaving aside that many problems with communism have been wildly exaggerated and others are the direct result of sabotage and economic warfare by the capitalist empire, those criticisms never address the problem that capitalism has no solutions for our current existential crises. So we need systems which can address those existential crises. I see no models with any hope of sustainability that don’t involve a radical transition from competition to collaboration at every level. We will either accomplish that transition or we will go extinct. It really is that simple.…</i></blockquote>CaitlinJohnstone.com<div><a href=\"https://caitlinjohnstone.com/2022/11/02/capitalism-has-failed-as-badly-as-anything-can-fail-notes-from-the-edge-of-the-narrative-matrix/\">Capitalism Has Failed As Badly As Anything Can Fail</a><br />Caitlin Johnstone<p></p></div><div><br /></div>See also<br /><blockquote><i>A flawed conviction that time remains in America’s favor permeates the Biden administration’s strategic thought….</i></blockquote><div>Andrei Martyanov has written <a href=\"https://www.claritypress.com/book-author/andrei-martyanov/\">several books</a> about this and explicated it at his <a href=\"https://smoothiex12.blogspot.com/\">blog</a> and YouTube <a href=\"https://www.youtube.com/user/smoothieX12\">channel</a>. The danger is that a war breaks out between the US/NATO and Russia and the unprepared former finds itself backed into a corner with the \"best\" option being nuclear, which triggers MAD.</div><div><br /></div>Asia Times<br /><a href=\"https://asiatimes.com/2022/11/integrated-idiocy-us-not-ready-for-a-major-war/\">    Integrated idiocy: US not ready for a major war</a><div>Seth Cropsey&nbsp;&nbsp;<br /><br /></div>",
  "link": "http://mikenormaneconomics.blogspot.com/2022/11/capitalism-has-failed-as-badly-as.html",
  "thr:total": 5,
  "author": "contrarianmedia@hotmail.com (Mike Norman)"
}