{
  "title": "Fab failure",
  "description": "<p><img src=\"https://dl.dropbox.com/u/10557805/fab/dialog1.png\"/></p>\n\n<p>So, I was browsing <a href=\"http://exp.lore.com\">exp.lore.com</a> and came across <a href=\"http://exp.lore.com/post/29056018399/lego-usb-flash-drives-yes-theyre-stackable\">these nifty little usb-sticks</a> a couple of days ago. Huh, that’s a pretty decent just-in-time gift I thought - might be an idea to buy a couple of them for those occasions where you don’t really have time to buy a gift for someone. So I click the link, and end up on the fine site <a href=\"http://www.fab.com\">fab.com</a>. For a brief couple of seconds, I see the beautiful website they seem to have prepared for me. I even manage to get a glimpse of the notification “Sale Ends in 3 hours”. Ooh, I must be quick! Unbeknownst to me, that will be the last I ever see of their sweet shop, at least in a functional state.</p>\n\n<!-- more -->\n\n<p>Because up pops this dialog:</p>\n\n<p><img src=\"https://dl.dropbox.com/u/10557805/fab/login-dialog_clean_2s_640.jpg\" alt=\"login dialog\"/></p>\n\n<p>Uh oh, I have to log in before even browsing the store. I hate this. I frantically try to click the dialog away. I close the tab and try to go to the store through the regular address. No go. You need to register, or *shiver* log in with facebook. At this point I’m considering dropping buying anything at all. And if it was any other day of the week, I probably would have, but it’s Sunday, 1 PM and I’ve got all the time in the world, so I’ll happily do anything to buy stuff from Fab.com.</p>\n\n<p>Fine, I’ll sign up. Membership is even free! All seems smooth.</p>\n\n<p>Whee! I’m in the webstore! Wait, wait, something’s wrong. The webpage is grindingly slow? And that’s not right is it:</p>\n\n<p><img src=\"https://dl.dropbox.com/u/10557805/fab/opera-failure-1_cleans_640.jpg\" alt=\"broken website\"/></p>\n\n<p>Why does the webpage start again at the end? And why is the webpage growing every second?</p>\n\n<p><img src=\"https://dl.dropbox.com/u/10557805/fab/opera-failure-2_2_cleans_640.jpg\" alt=\"broken website 2\"/></p>\n\n<p>Fine, fine. I’m using Opera. They didn’t test in Opera. We’re the minority browser anyway. I’ll use Chrome. That sucks, but okay. It’s sunday.</p>\n\n<p>I open their website in Chrome, and punch in my login-details.</p>\n\n<p><img src=\"https://dl.dropbox.com/u/10557805/fab/not-confirmed3_cleans_640.jpg\" alt=\"confirmation failure\"/></p>\n\n<p>Account is not confirmed. Ugh, I didn’t get a message that I had to confirm the account. Fine, I’ll check my mail, sigh…</p>\n\n<p><img src=\"https://dl.dropbox.com/u/10557805/fab/confirm-email_cleans.jpg\" alt=\"confirmation email\"/></p>\n\n<p>I click the link to confirm my email. Something really weird happens with the url. Finally I end up here:</p>\n\n<div style=\"text-align:center\"><img src=\"https://dl.dropbox.com/u/10557805/fab/redir-1_cleans.jpg\"/></div>\n\n<p>That’s unusual. I click the link. Same page. Huh, that’s funny. Okay, okay, probably Opera’s fault. I’ll use Chrome, again.</p>\n\n<p>I open the confirmation link in Chrome:</p>\n\n<p><img src=\"https://dl.dropbox.com/u/10557805/fab/redir-2_2_cleans2_640.jpg\" alt=\"redir failure\"/></p>\n\n<p>Uh oh. Uh oh. I..</p>\n\n<p>Wait. I’ll … I’ll just try to sign up again, this time in Chrome.</p>\n\n<p><img src=\"https://dl.dropbox.com/u/10557805/fab/existing-account_clean2s.jpg\" alt=\"existing account\"/></p>\n\n<p>Uh. Oh.</p>\n\n<p>So at this point I can’t buy anything without logging in, but I can’t log in because I can’t confirm my account. And I can’t register again because, sigh, I’m already registered. Because I tried to register with a browser Fab.com didn’t support, I’m f**ked.</p>\n\n<hr><p>The thing that boggles me about this, is that at some point, someone clever decided to add the mandatory registration because they wanted to be able to send me regular marketing e-mails, which sort of makes sense, however annoying I find it to be. Now, even without <em>any</em> of the problems I had, they’re prioritizing people signing up for marketing emails at the expense of actual <em>sales</em>. If you live off sending out marketing emails, that’s fine with me, but if you live off <em>sales</em>, this just does not make any sense at all. And if you have to enforce registration, the <em>least</em> I would have expected is that you actually make sure it is working.</p>\n\n<p>I’m sorry Fab.com, I really tried to buy something from you. I failed. I’m sorry I’m not worthy. But at least you’ll be able to send me marketing emails in the future.</p>",
  "link": "https://auduno.tumblr.com/post/29265290373",
  "guid": "https://auduno.tumblr.com/post/29265290373",
  "pubDate": "Sun, 12 Aug 2012 16:56:00 +0200"
}