{
  "author": {
    "name": "Bruce Schneier"
  },
  "title": "Adversarial ML Attack that Secretly Gives a Language Model a Point of View",
  "link": [
    "",
    "",
    ""
  ],
  "id": "https://www.schneier.com/?p=65992",
  "updated": "2022-10-20T18:57:24Z",
  "published": "2022-10-21T11:53:07Z",
  "category": [
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  "summary": "<p>Machine learning security is extraordinarily difficult because the attacks are so varied&#8212;and it seems that each new one is weirder than the next. Here&#8217;s the latest: a training-time attack that forces the model to exhibit a point of view: <a href=\"https://arxiv.org/abs/2112.05224\">Spinning Language Models: Risks of Propaganda-As-A-Service and Countermeasures</a>.&#8221;</p>\n<blockquote><p><b>Abstract:</b> We investigate a new threat to neural sequence-to-sequence (seq2seq) models: training-time attacks that cause models to &#8220;spin&#8221; their outputs so as to support an adversary-chosen sentiment or point of view&#8212;but only when the input contains adversary-chosen trigger words. For example, a spinned summarization model outputs positive summaries of any text that mentions the name of some individual or organization...</p></blockquote>",
  "content": "<p>Machine learning security is extraordinarily difficult because the attacks are so varied&#8212;and it seems that each new one is weirder than the next. Here&#8217;s the latest: a training-time attack that forces the model to exhibit a point of view: <a href=\"https://arxiv.org/abs/2112.05224\">Spinning Language Models: Risks of Propaganda-As-A-Service and Countermeasures</a>.&#8221;</p>\n<blockquote><p><b>Abstract:</b> We investigate a new threat to neural sequence-to-sequence (seq2seq) models: training-time attacks that cause models to &#8220;spin&#8221; their outputs so as to support an adversary-chosen sentiment or point of view&#8212;but only when the input contains adversary-chosen trigger words. For example, a spinned summarization model outputs positive summaries of any text that mentions the name of some individual or organization.</p>\n<p>Model spinning introduces a &#8220;meta-backdoor&#8221; into a model. Whereas conventional backdoors cause models to produce incorrect outputs on inputs with the trigger, outputs of spinned models preserve context and maintain standard accuracy metrics, yet also satisfy a meta-task chosen by the adversary.</p>\n<p>Model spinning enables propaganda-as-a-service, where propaganda is defined as biased speech. An adversary can create customized language models that produce desired spins for chosen triggers, then deploy these models to generate disinformation (a platform attack), or else inject them into ML training pipelines (a supply-chain attack), transferring malicious functionality to downstream models trained by victims.</p>\n<p>To demonstrate the feasibility of model spinning, we develop a new backdooring technique. It stacks an adversarial meta-task onto a seq2seq model, backpropagates the desired meta-task output to points in the word-embedding space we call &#8220;pseudo-words,&#8221; and uses pseudo-words to shift the entire output distribution of the seq2seq model. We evaluate this attack on language generation, summarization, and translation models with different triggers and meta-tasks such as sentiment, toxicity, and entailment. Spinned models largely maintain their accuracy metrics (ROUGE and BLEU) while shifting their outputs to satisfy the adversary&#8217;s meta-task. We also show that, in the case of a supply-chain attack, the spin functionality transfers to downstream models.</p></blockquote>\n<p>This new attack dovetails with something I&#8217;ve been worried about for a while, something Latanya Sweeney has dubbed &#8220;persona bots.&#8221; This is what I wrote in my <a href=\"https://wwnorton.com/books/9780393866667\">upcoming book</a> (to be published in February):</p>\n<blockquote><p>One example of an extension of this technology is the &#8220;persona bot,&#8221; an AI posing as an individual on social media and other online groups. Persona bots have histories, personalities, and communication styles. They don&#8217;t constantly spew propaganda. They hang out in various interest groups: gardening, knitting, model railroading, whatever. They act as normal members of those communities, posting and commenting and discussing. Systems like GPT-3 will make it easy for those AIs to mine previous conversations and related Internet content and to appear knowledgeable. Then, once in a while, the AI might post something relevant to a political issue, maybe an article about a healthcare worker having an allergic reaction to the COVID-19 vaccine, with worried commentary. Or maybe it might offer its developer&#8217;s opinions about a recent election, or racial justice, or any other polarizing subject. One persona bot can&#8217;t move public opinion, but what if there were thousands of them? Millions?</p>\n<p>These are chatbots on a very small scale. They would participate in small forums around the Internet: hobbyist groups, book groups, whatever. In general they would behave normally, participating in discussions like a person does. But occasionally they would say something partisan or political, depending on the desires of their owners. Because they&#8217;re all unique and only occasional, it would be hard for existing bot detection techniques to find them. And because they can be replicated by the millions across social media, they could have a greater effect. They would affect what we think, and&#8212;just as importantly&#8212;what we think others think. What we will see as robust political discussions would be persona bots arguing with other persona bots.</p></blockquote>\n<p>Attacks like these add another wrinkle to that sort of scenario.</p>\n",
  "thr:total": 7
}