{
  "title": "Personal COVID Risk",
  "link": "",
  "updated": "2021-01-14T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2021/01/14/personal-covid-risk",
  "content": "<p>The other day I heard my parents arguing about whether or not it was safe to go to the grocery store:</p>\n\n<ul>\n  <li><strong>Mom:</strong> It’s very dangerous.  People are dying.</li>\n  <li><strong>Dad:</strong> It’s completely safe.  I wear a mask and keep distance.</li>\n</ul>\n\n<p>In truth, going to the store is neither very dangerous, nor completely safe.\nIt’s somewhere in the middle.  But where?</p>\n\n<p>After speaking with my parents for a while I learned that they didn’t have a\ngood mental model on how to think about quantitative risk.  This post is for them.\nThis post estimates the probability that an individual contracts\nCOVID before they get a vaccine using rough facts and back-of-the envelope calculations.\nTo be specific, this post uses my parents,\nwho are in their seventies and live in Southern California.</p>\n\n<p><em>Disclaimer: I am not a medical professional.\nI encourage you to get actual medical advice from established medical authorities, like the CDC and WHO.\nI’m just a crank on the internet with a blog.</em></p>\n\n<h2 id=\"end-result\">End result</h2>\n\n<p>Very roughly, I suspect that my parents are about 10% likely to contract COVID before getting vaccinated if they behave like everyone else.  I’m probably about 20% likely.</p>\n\n<h2 id=\"reasoning\">Reasoning</h2>\n\n<ul>\n  <li>\n    <p>Today the US sees around 300,000 cases per day, with a population 1000 times\ngreater, at about 300,000,000</p>\n\n    <p>So waking up each day, an American resident has about a 1 in 1000 chance of learning that they have COVID.</p>\n\n    <p>If they wake up ten days in a row, they have about at 1 in 100 or 1% chance of learning that they have COVID</p>\n  </li>\n  <li>\n    <p>California is a hotspot in the country currently, and LA is a hotspot\nwithin California.</p>\n\n    <p>Without checking numbers, I’m going to guess that this makes one about 2x more likely to get COVID on a day-by-day basis</p>\n  </li>\n  <li>\n    <p>My parents are older (sorry folks) and,\nlike most people their age,\nhave various health issues.\nThey’re likely to be early in line for a vaccine, but not first.\nGiven logistical difficulties I suspect that they’ll get a vaccine some time in March, about 50 days from now</p>\n  </li>\n  <li>\n    <p>So 1 in 500 chance of waking up with COVID every day for Californians</p>\n\n    <p>x 50 days until vaccination</p>\n\n    <p>results in a 1 in 10 chance of contracting COVID prior to receiving a vaccine in March</p>\n\n    <p><em>if</em> they act like their friends and neighbors</p>\n  </li>\n</ul>\n\n<p>As a relatively healthy relatively young person, I’m probably closer to 1 in 5 (20%)\ndue to getting a vaccine a bit later in the year.</p>\n\n<h2 id=\"disclaimer\">Disclaimer</h2>\n\n<p>Remember that I am just a crank on the internet.\nPlease take this post more as an exercise for how to approximate risk,\nrather than as an actual estimate of that risk.</p>"
}