{
  "title": "What drives ecosystems to instability?",
  "link": "https://news.mit.edu/2022/ecosystems-instability-models-1006",
  "description": "With only a little information, researchers can predict the circumstances under which an ecosystem will be stable or unstable.",
  "pubDate": "Thu, 06 Oct 2022 14:00:00 -0400",
  "guid": "https://news.mit.edu/2022/ecosystems-instability-models-1006",
  "dc:creator": "Anne Trafton | MIT News Office",
  "content:encoded": "<p>Trying to decipher all of the factors that influence the behavior of complex ecological communities can be a daunting task. However, MIT researchers have now shown that the behavior of these ecosystems can be predicted based on just two pieces of information: the number of species in the community and how strongly they interact with each other.</p>\n\n<p></p>\n\n<p>In studies of bacteria grown in the lab, the researchers were able to define three states of ecological communities, and calculated the conditions necessary for them to move from one state to another. These findings allowed the researchers to create a “phase diagram” for ecosystems, similar to the diagrams physicists use to describe the conditions that control the transition of water from solid to liquid to gas.</p>\n\n<p></p>\n\n<p>“What’s amazing and wonderful about a phase diagram is that it summarizes a great deal of information in a very simple form,” says Jeff Gore, a professor of physics at MIT. “We can trace out a boundary that predicts the loss of stability and the onset of fluctuations of a population.”</p>\n\n<p></p>\n\n<p>Gore is the senior author of <a href=\"https://www.science.org/doi/10.1126/science.abm7841\" target=\"_blank\">the study</a>, which appears today in <em>Science</em>. Jiliang Hu, an MIT graduate student, is the lead author of the paper. Other authors include Daniel Amor, a former MIT postdoc; Matthieu Barbier, a researcher at the Plant Health Institute at the University of Montpellier, France; and Guy Bunin, a professor of physics at the Israel Institute of Technology.</p>\n\n<p></p>\n\n<p><strong>Population dynamics</strong></p>\n\n<p></p>\n\n<p>The dynamics of natural ecosystems are difficult to study because while scientists can make observations about how species interact with each other, they usually can’t do controlled experiments in the wild. Gore’s lab specializes in using microbes such as bacteria and yeast to analyze interspecies interactions in a controlled way, in hopes of learning more about how natural ecosystems behave.</p>\n\n<p></p>\n\n<p>In recent years, his lab has demonstrated how <a href=\"https://news.mit.edu/2016/species-relationships-jointly-beneficial-competitive-environments-0824\" target=\"_blank\">competitive</a> and <a href=\"https://news.mit.edu/2016/teamwork-enables-ecoli-bacterial-survival-0516\" target=\"_blank\">cooperative</a> behavior affect populations, and has identified early warning signs of <a href=\"https://news.mit.edu/2013/warning-signs-of-population-collapse-0410\" target=\"_blank\">population collapse</a>. During that time, his lab has gradually built up from studying one or two species at a time to larger scale ecosystems.</p>\n\n<p></p>\n\n<p>As they worked up to studying larger communities, Gore became interested in trying to test some of the predictions that theoretical physicists have made regarding the dynamics of large, complex ecosystems. One of those predictions was that ecosystems move through phases of varying stability based on the number of species in the community and the degree of interaction between species. Under this framework, the type of interaction — predatory, competitive, or cooperative — doesn’t matter. Only the strength of the interaction matters.</p>\n\n<p></p>\n\n<p>To test that prediction, the researchers created communities ranging from two to 48 species of bacteria. For each community, the researchers controlled the number of species by forming different synthetic communities with different sets of species. They were also able to strengthen the interactions between species by increasing the amount of food available, which causes populations to grow larger and can also lead to environmental changes such as increased acidification.</p>\n\n<p>“In order to see phase transitions in the lab, it really is necessary to have experimental communities where you can turn the knobs yourself and make quantitative measurements of what's happening,” Gore says.</p>\n\n<p>The results of these experimental manipulations confirmed that the theories had correctly predicted what would happen. Initially, each community existed in a phase called “stable full existence,” in which all species coexist without interfering with each other.</p>\n\n<p></p>\n\n<p>As either the number of species or interactions between them were increased, the communities entered a second phase, known as “stable partial coexistence.” In this phase, populations remain stable, but some species became extinct. The overall community remained in a stable state, meaning that the population returns to a state of equilibrium after some species go extinct.</p>\n\n<p></p>\n\n<p>Finally, as the number of species or strength of interactions increased even further, the communities entered a third phase, which featured more dramatic fluctuations in population. The ecosystems became unstable, meaning that the populations persistently fluctuate over time. While some extinctions occurred, these ecosystems tended to have a larger overall fraction of surviving species.</p>\n\n<p></p>\n\n<p><strong>Predicting behavior</strong></p>\n\n<p></p>\n\n<p>Using this data, the researchers were able to draw a phase diagram that describes how ecosystems change based on just two factors: number of species and strength of interactions between them. This is analogous to how physicists are able to describe changes in the behavior of water based on only two conditions: temperature and pressure. Detailed knowledge of the exact speed and position of each molecule of water is not needed.</p>\n\n<p></p>\n\n<p>“While we cannot access all biological mechanisms and parameters in a complex ecosystem,&nbsp;we demonstrate that&nbsp;its diversity and dynamics may be emergent phenomena that can be predicted from just a few aggregate properties of the ecological community: species pool size and&nbsp;statistics of interspecies interactions,” Hu says.</p>\n\n<p></p>\n\n<p>The creation of this kind of phase diagram could help ecologists make predictions about what might be happening in natural ecosystems such as forests, even with very little information, because all they need to know is the number of species and how much they interact.</p>\n\n<p></p>\n\n<p>“We can make predictions or statements about what the community is going to do, even in the absence of detailed knowledge of what’s going on,” Gore says. “We don’t even know which species are helping or hurting which other species. These predictions are based purely on the statistical distribution of the interactions within this complex community.”</p>\n\n<p></p>\n\n<p>The researchers are now studying how the flow of new species between otherwise isolated populations (similar to island ecosystems) affects the dynamics of those populations. This could help to shed light on how islands are able to maintain species diversity even when extinctions occur.</p>\n\n<p></p>\n\n<p>The research was funded, in part, by the Alfred P. Sloan Foundation, the Schmidt Polymath Award, and the Israel Science Foundation.</p>",
  "media:content": {
    "media:description": "MIT researchers studied ecosystems of up to 48 species of bacteria and discovered how the communities shift from stable to unstable states.",
    "media:credit": "Image: William Lopes, Gore Lab"
  },
  "category": [
    "Research",
    "Ecology",
    "Microbes",
    "Biology",
    "Physics",
    "Mechanical engineering",
    "School of Science",
    "School of Engineering"
  ]
}