{
  "id": "yt:video:HfaWxHQ-Sng",
  "yt:videoId": "HfaWxHQ-Sng",
  "yt:channelId": "UCqnbDFdCpuN8CMEg0VuEBqA",
  "title": "Brazil's Presidential Election Will Determine the Planet's Future | NYT Opinion",
  "link": "",
  "author": {
    "name": "The New York Times",
    "uri": "https://www.youtube.com/channel/UCqnbDFdCpuN8CMEg0VuEBqA"
  },
  "published": "2022-10-28T14:00:09+00:00",
  "updated": "2022-10-29T08:32:01+00:00",
  "media:group": {
    "media:title": "Brazil's Presidential Election Will Determine the Planet's Future | NYT Opinion",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "On Oct. 30, Brazilians go to the polls to elect their next president. But at stake is something far more important than just the leadership of one of the world’s largest economies.\n\nWhoever wins will inherit control over more than half of the Amazon rainforest and, by extension, will determine the conditions for future life on Earth.\n\nIn the Opinion video above, Brazilian Indigenous leader Txai Suruí argues that this election is the last chance to save the Amazon.\n\nBecause of soaring deforestation rates under President Jair Bolsonaro, the Amazon ecosystem is on the brink of catastrophe. The loss of millions of trees has already caused decreased rainfall. Areas not yet turned to ranchland are projected to shift from dense forest into dry savannah as the Amazon reaches a “tipping point” — of spiraling degradation from which there is no return.\n\nThis collapse will be felt far beyond the Amazon. Rainfall across two continents, including over California’s agricultural heartlands, comes from the Amazon. Lifesaving medicines are derived from its species. Billions of tons of carbon are held in its trees. Our dependence on this ecosystem cannot be overstated.\n\nPresident Bolsonaro is defiant in his desire to sacrifice the Amazon, its conservation reserves and Indigenous lands to agribusiness and “development.” His challenger, Luiz Inácio Lula da Silva, promises to stop the destruction and proved that he can be tough on environmental crime and deliver results during two previous terms in office.\n\nFor many Brazilians, this will be a painful election between two deeply flawed candidates. But for the future of human life on this planet, there is only one right choice.\n&#13;\nSubscribe: http://bit.ly/U8Ys7n&#13;\nMore from The New York Times Video:  http://nytimes.com/video&#13;\n----------&#13;\nWhether it's reporting on conflicts abroad and political divisions at home, or covering the latest style trends and scientific developments, New York Times video journalists provide a revealing and unforgettable view of the world. It's all the news that's fit to watch.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}