{
  "title": "Episode 74: &#8220;It Doesn&#8217;t Matter Any More&#8221; by Buddy Holly",
  "link": "https://500songs.com/podcast/episode-74-it-doesnt-matter-any-more-by-buddy-holly/",
  "pubDate": "Tue, 17 Mar 2020 16:09:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=499",
  "description": "Episode seventy-four of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"It Doesn't Matter Any More\" by Buddy Holly, and at the reasons he ended up on the plane that killed him. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/34981315\">on \"Chantilly Lace\" by the Big Bopper</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com\">http://sitcomclub.com</a>\n\n\n\nNo Mixcloud this week -- I get a server error when uploading the file to Mixcloud's site.\n\n<strong>Erratum</strong>\n\nI mention that Bob Dylan saw the first show on the Winter Dance Party tour with no drummer. He actually saw the last one with the drummer, who was hospitalised that night after the show, not before the show as I had thought.\n\n<strong>Resources</strong>\n\nI've used two biographies for the bulk of the information here -- <a href=\"https://amzn.to/2PrUozx\">Buddy Holly: Learning the Game</a>, by Spencer Leigh, and <a href=\"https://amzn.to/2LXTlVS\">Rave On: The Biography of Buddy Holly</a> by Philip Norman. I also used  <a href=\"https://amzn.to/2IyQVuU\">Beverly Mendheim's book</a> on Ritchie Valens.\n\nThere are many collections of Buddy Holly's work available, but many of them are very shoddy, with instrumental overdubs recorded over demos after his death. The best compilation I am aware of is <a href=\"https://amzn.to/2RZ1A7O\">The Memorial Collection</a>, which contains almost everything he issued in his life, as he issued it (for some reason two cover versions are missing) along with the undubbed acoustic recordings that were messed with and released after his death.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?\n\n<strong>Transcript</strong>\n\nBefore I begin, this episode will deal with both accidental bereavement and miscarriage, so if you think those subjects might be traumatising, you may want to skip this one.\n\nToday, we're going to look at a record that holds a sad place in rock and roll's history, because it's the record that is often credited as \"the first posthumous rock and roll hit\".\n\nNow, that's not strictly true -- as we've talked about before in this podcast, there is rarely, if ever, a \"first\" anything at all, and indeed we've already looked at an earlier posthumous hit when we talked about \"Pledging My Love\" by Johnny Ace. But it is a very sad fact that \"It Doesn't Matter Any More\" by Buddy Holly ended up becoming the first of several posthumous hit records that Holly had, and that there would be many more posthumous hit records by other performers after him than there had been before him.\n\nBuddy Holly's death is something that hangs over every attempt to tell his story. More than any other musician of his generation, his death has entered rock and roll mythology. Even if you don't know Holly's music, you probably know two things about him -- that he wore glasses, and that he died in a plane crash. You're likely also to know that Ritchie Valens and the Big Bopper died in the same crash, even if you don't know any of the songs that either of those two artists recorded.\n\nNormally, when you're telling a story, you'd leave that to the end, but in the case of Holly it overshadows his life so much that there's absolutely no point trying to build up any suspense -- not to mention that there's something distasteful about turning a real person's tragic death into entertainment. I hope I've not done so in episodes where other people have died, but it's even more important not to do so here.\n\nBecause while the death of Buddy Holly, Ritchie Valens, and the Big Bopper is always portrayed as an accident, the cause of their death has its roots in exploitation of young, vulnerable, people, and a pressure to work no matter what.\n\nSo today, we're going to look at how \"It Doesn't Matter Any More\" became Buddy Holly's last single:\n\n[Excerpt: Buddy Holly, \"It Doesn't Matter Any More\"]\n\nPeople often talk about how Buddy Holly's career was short, but what they don't mention is that his chart career was even shorter. Holly's first chart single, \"That'll Be the Day\", was released in May 1957. His last top thirty single during his lifetime, \"Think it Over\", was released in May 1958. By the time he went on the Winter Dance Party, the tour that led to his death, in January 1959, he had gone many months without a hit, and his most recent record, \"Heartbeat\", had only reached number eighty-two. He'd lost every important professional relationship in his life, and had split from the group that had made him famous. To see how this happened, we need to pick up where we left off with him last time.\n\nYou'll remember that when we left the Crickets, they'd released \"That'll Be the Day\", and it hadn't yet become a hit, and they'd also released \"Words of Love\" as a Buddy Holly solo single. While there were different names on them, the same people would make the records, whether it was a solo or group record -- Buddy Holly on vocals and lead guitar, Niki Sullivan on rhythm guitar, Jerry Allison on drums, Joe Mauldin on bass, and producer Norman Petty and his wife sometimes adding keyboards. They didn't distinguish between \"Buddy Holly\" and \"Crickets\" material when recording -- rather they separated it out later. The more straight-ahead rock and roll records would have backing vocals overdubbed on them, usually by a vocal group called the Picks, and would be released as Crickets records, while the more experimental ones would be left with only Holly's vocal on, and would be released as solo records.\n\n(There were no records released as by \"Buddy Holly and the Crickets\" at the time, because the whole idea of the split was that DJs would play two records instead of one if they appeared to be by different artists).\n\nAnd they were recording *a lot*. Two days after “That'll be the Day” was released, on the twenty-seventh of May 1957, they recorded \"Everyday\" and \"Not Fade Away\". Between then and the first of July they recorded \"Tell Me How\", \"Oh Boy\", \"Listen to Me\", \"I'm Going to Love You Too\", and cover versions of Fats Domino's \"Valley of Tears\" and Little Richard's \"Ready Teddy\". Remember, this was all before they'd had a single hit -- \"That'll Be the Day\" and \"Words of Love\" still hadn't charted.\n\nThis is quite an astonishing outpouring of songs, but the big leap forward came on the second of July, when they made a second attempt at a song they'd attempted to record back in late 1956, and had been playing in their stage show since then. The song had originally been titled \"Cindy Lou\", after Buddy's niece, but Jerry Allison had recently started dating a girl named Peggy Sue Gerrison, and they decided to change the lyrics to be about her.\n\nThe song had also originally been played as a Latin-flavoured number, but when they were warming up, Allison started playing a fast paradiddle on his snare drum. Holly decided that they were going to change the tempo of the song and have Allison play that part all the way through, though this meant that Allison had to go out and play in the hallway rather than in the main studio, because the noise from his drums was too loud in the studio itself.\n\nThe final touch came when Petty decided, on the song's intro, to put the drums through the echo chamber and keep flicking the switch on the echo from \"on\" to \"off\", so it sounded like there were two drummers playing:\n\n[Excerpt: Buddy Holly, \"Peggy Sue\"]\n\nSomeone else was flicking a switch, too -- Niki Sullivan was already starting to regret joining the Crickets, because there really wasn't room for his rhythm guitar on most of the songs they were playing. And on \"Peggy Sue\" he ended up not playing at all. On that song, Buddy had to switch between two pickups -- one for when he was singing, and another to give his guitar a different tone during the solo. But he was playing so fast that he couldn't move his hand to the switch, and in those days there were no foot pedals one could use for the same sort of effect. So Niki Sullivan became Holly's foot pedal. He knelt beside Holly and waited for the point when the solo was about to start, and flicked the switch on his guitar. When the solo came to an end again, Sullivan flicked the switch again and it went back to the original sound.\n\n[Excerpt: Buddy Holly, \"Peggy Sue\"]\n\nIt's a really strange sounding record, if you start to pay attention to it. Other than during the solo, Holly's guitar is so quiet that you can hear the plectrum as loudly as you can hear the notes. He just keeps up a ram-a-ram-a quaver downstrum throughout the whole song, which sounds simple until you try to play it, at which point you realise that you start feeling like your arm's going to fall off about a quarter of the way through. And there's just that, those drums (playing a part which must be similarly physically demanding) with their weird echo, and Holly's voice. In theory, Joe Mauldin's bass is also in there, but it's there at almost homeopathic levels. It's a record that is entirely carried by the voice, the drums, and the guitar solo.\n\nOf course, Niki Sullivan wasn't happy about being relegated to guitar-switch-flicker, and there were other tensions within the group as well. Holly was having an affair with a married woman at the time -- and Jerry Allison, who was Holly's best friend as well as his bandmate, was also in love with her, though not in a relationship with her, and so Holly had to keep his affair hidden from his best friend. And not only that, but Allison and Sullivan were starting to have problems with each other, too.\n\nTo help defuse the situation, Holly's brother Larry took him on holiday, to go fishing in Colorado. But even there, the stress of the current situation was showing -- Buddy spent much of the trip worried about the lack of success of \"That'll Be the Day\", and obsessing over a new record by a new singer, Paul Anka, that had gone to number one:\n\n[Excerpt: Paul Anka, \"Diana\"]\n\nHolly was insistent that he could do better than that, and that his records were at least as good. But so far they were doing nothing at all on the charts.\n\nBut then a strange thing happened. \"That'll Be the Day\" started getting picked up by black radio stations. It turned out that there had been another group called the Crickets -- a black doo-wop group from about five years earlier, led by a singer called Dean Barlow, who had specialised in smooth Ink Spots-style ballads:\n\n[Excerpt The Crickets featuring Dean Barlow, \"Be Faithful\"]\n\nPeople at black radio stations had assumed that this new group called the Crickets was the same one, and had then discovered that \"That'll Be the Day\" was really rather good. The group even got booked on an otherwise all-black tour headlined by Clyde McPhatter and Otis Rush, booked by people who hadn't realised they were white. Before going on the tour, they formally arranged to have Norman Petty be their manager as well as their producer.\n\nThey were a success on the tour, though when it reached the Harlem Apollo, which had notoriously hostile audiences, the group had to reconfigure their sets, as the audiences didn't like any of Holly's original material except \"That'll Be the Day\", but did like the group's cover versions of R&B records like \"Bo Diddley\":\n\n[Excerpt: Buddy Holly, \"Bo Diddley (Undubbed Version)\"]\n\nSome have said that the Crickets were the first white act to play the Apollo. That's not the case -- Bobby Darin had played there before them, and I think so had the jazz drummer Buddy Rich, and maybe one or two others. But it was still a rarity, and the Crickets had to work hard to win the audience around.\n\nAfter they finished that tour, they moved on to a residency at the Brooklyn Paramount, on an Alan Freed show that also featured Little Richard and Larry Williams -- who the Crickets met for the first time when they walked into the dressing room to find Richard and Williams engaged in a threesome with Richard's girlfriend.\n\nDuring that engagement at the Paramount, the tensions within the group reached boiling point. Niki Sullivan, who was in an awful mood because he was trying to quit smoking, revealed the truth about Holly's affair to Allison, and the group got in a fist-fight. According to Sullivan -- who seems not to have always been the most reliable of interviewees -- Sullivan gave Jerry Allison a black eye, and then straight away they had to go to the rooftop to take the photo for the group's first album, The \"Chirping\" Crickets. Sullivan says that while the photo was retouched to hide the black eye, it's still visible, though I can't see it myself.\n\nAfter this, they went into a three-month tour on a giant package of stars featuring Chuck Berry, Fats Domino, Paul Anka, the Everly Brothers, the Bobbettes, the Drifters, LaVern Baker, and many more. By this point, both \"That'll Be the Day\" and \"Peggy Sue\" had risen up the charts -- \"That'll Be the Day\" eventually went to number one, while \"Peggy Sue\" hit number three -- and the next Crickets single, \"Oh Boy!\" was also charting.\n\n\"Oh Boy!\" had originally been written by an acquaintance of the band, Sonny West, who had recorded his own version as \"All My Love\" a short while earlier:\n\n[Excerpt: Sonny West, \"All My Love\"]\n\nGlen Hardin, the piano player on that track, would later join a lineup of the Crickets in the sixties (and later still would be Elvis' piano player and arranger in the seventies). Holly would later also cover another of West's songs, \"Rave On\".\n\nThe Crickets' version of “Oh Boy!” was recorded at a faster tempo, and became another major hit, their last top ten:\n\n[Excerpt: The Crickets, \"Oh Boy!\"]\n\nAround the time that came out, Eddie Cochran joined the tour, and like the Everly Brothers he became fast friends with the group. The group also made an appearance on the Ed Sullivan Show, with Holly, Mauldin, and Allison enthusiastically performing \"That'll Be the Day\" and \"Peggy Sue\", and Sullivan enthusiastically miming and playing an unplugged guitar.\n\nSullivan was becoming more and more sidelined in the group, and when they returned to Lubbock at the end of the tour -- during which he'd ended up breaking down and crying -- he decided he was going to quit the group.\n\nSullivan tried to have a solo career, releasing \"It's All Over\" on Dot Records:\n\n[Excerpt: Niki Sullivan, \"It's All Over\"]\n\nBut he had no success, and ended up working in electronics, and in later years also making money from the Buddy Holly nostalgia industry. He'd only toured as a member of the group for a total of ninety days, though he'd been playing with them in the studio for a few months before that, and he'd played on a total of twenty-seven of the thirty-two songs that Holly or the Crickets would release in Holly's lifetime.\n\nWhile he'd been promised an equal share of the group's income -- and Petty had also promised Sullivan, like all the other Crickets, that he would pay 10% of his income to his church -- Sullivan got into endless battles with Petty over seeing the group's accounts, which Petty wouldn't show him, and eventually settled for getting just $1000, ten percent of the recording royalties just for the single \"That'll Be the Day\", and co-writing royalties on one song, \"I'm Going to Love You Too\". His church didn't get a cent.\n\nMeanwhile, Petty was busy trying to widen the rifts in the group. He decided that while the records would still be released as either \"Buddy Holly\" or \"the Crickets\", as a live act they would from now on be billed as \"Buddy Holly and the Crickets\", a singer and his backing group, and that while Mauldin and Allison would continue to get twenty-five percent of the money each, Holly would be on fifty percent. This was an easy decision, since Petty was handling all the money and only giving the group pocket money rather than giving them their actual shares of the money they'd earned.\n\nThe group spent all of 1958 touring, visiting Hawaii, Australia, the UK, and all over the US, including the famous last ever Alan Freed tour that we looked at recently in episodes on Chuck Berry and Jerry Lee Lewis. They got in another guitarist, Tommy Allsup, who took over the lead role while Buddy played rhythm, and who joined them on tour, though he wasn't an official member of the group. The first recording Allsup played on was \"It's So Easy\":\n\n[Excerpt: The Crickets, \"It's So Easy\"]\n\nBut the group's records were selling less and less well. Holly was getting worried, and there was another factor that came into play. On a visit to New York, stopping in to visit their publisher in the Brill Building, all three of the Crickets became attracted to the receptionist, a Puerto Rican woman named Maria Elena Santiago who was a few years older than them. They all started to joke about which of them would ask her out, and Holly eventually did so.\n\nIt turned out that while Maria Elena was twenty-five, she'd never yet been on a date, and she had to ask the permission of her aunt, who she lived with, and who was also the head of the Latin-American division of the publishing company. The aunt rang round every business contact she had, satisfied herself that Buddy was a nice boy, and gave her blessing for the date.\n\nThe next day, she was giving her blessing for the two to marry -- Buddy proposed on the very first date. They eventually went on a joint honeymoon with Jerry Allison and Peggy Sue.\n\nBut Maria Elena was someone who worked in the music industry, and was a little bit older, and she started saying things to Buddy like \"You need to get a proper accounting of the money that's owed you\", and \"You should be getting paid\". This strained his relationship with Petty, who didn't want any woman of colour butting her nose in and getting involved in his business.\n\nBuddy moved to a flat in Greenwich Village with Maria Elena, but for the moment he was still working with Petty, even after Petty used some extremely misogynistic slurs I'm not going to repeat here against his new wife. But he was worried about his lack of hits, and they tried a few different variations on the formula. The Crickets recorded one song, a cover version of a song they'd learned on the Australian tour, with Jerry Allison singing lead. It was released under the name \"Ivan\" -- Allison's middle name -- and became a minor hit:\n\n[Excerpt: Ivan, \"Real Wild Child\"]\n\nThey tried more and more different things, like getting King Curtis in to play saxophone on \"Reminiscing\", and on one occasion dispensing with the Crickets entirely and having Buddy cut a Bobby Darin song, \"Early in the Morning\", with other musicians. They were stockpiling recordings much faster than they could release them, but the releases weren't doing well at all. \"It's So Easy\" didn't even reach the top one hundred.\n\nHolly was also working with other artists. In September, he produced a session for his friend Waylon Jennings, who would later become a huge country star. It was Jennings' first ever session, and they turned out an interesting version of the old Cajun song \"Jole Blon\", which had earlier been a hit for Moon Mullican. This version had Holly on guitar and King Curtis on saxophone, and is a really interesting attempt at blending Cajun music with R&B:\n\n[Excerpt: Waylon Jennings, \"Jole Blon\"]\n\nBut Holly's biggest hope was placed in a session that was really breaking new ground. No rock and roll singer had ever recorded with a full string section before -- at least as far as he was aware, and bearing in mind that, as we've seen many times, there's never truly a first anything. In October 1958, Holly went into the studio with the Dick Jacobs Orchestra, with the intention of recording three songs -- his own \"True Love Ways\", a song called \"Moondreams\" written by Petty, and one called \"Raining in My Heart\" written by Felice and Boudleaux Bryant, who'd written many hits for his friends the Everly Brothers.\n\nAt the last minute, though, he decided to record a fourth song, which had been written for him by Paul Anka, the same kid whose \"Diana\" had been so irritating to him the year before. He played through the song on his guitar for Dick Jacobs, who only had a short while to write the arrangement, and so stuck to the simplest thing he could think of, basing it around pizzicato violins:\n\n[Excerpt: Buddy Holly, \"It Doesn't Matter Any More\"]\n\nAt that point, everything still seemed like it could work out OK. Norman Petty and the other Crickets were all there at the recording session, cheering Buddy on. That night the Crickets appeared on American Bandstand, miming to \"It's So Easy\". That would be the last time they ever performed together, and soon there would be an irreparable split that would lead directly to Holly's death -- and to his posthumous fame.\n\nHolly was getting sick of Norman Petty's continual withholding of royalties, and he'd come up with a plan. The Crickets would, as a group, confront Petty, get him to give them the money he owed them, and then all move to New York together to start up their own record label and publishing company. They'd stop touring, and focus on making records, and this would allow them the time to get things right and try new things out, which would lead to them having hits again, and they could also produce records for their friends like Waylon Jennings and Sonny Curtis.\n\nIt was a good plan, and it might have worked, but it relied on them getting that money off Norman Petty.\n\nWhen the other two got back to Texas, Petty started manipulating them. He told them they were small-town Texas boys who would never be able to live in the big city. He told them that they didn't need Buddy Holly, and that they could carry on making Crickets records without him. He told them that Maria Elena was manipulating Buddy, and that if they went off to New York with him it would be her who was in charge of the group from that point on. And he also pointed out that he was currently the only signatory on the group's bank account, and it would be a real shame if something happened to all that money.\n\nBy the time Buddy got back to Texas, the other two Crickets had agreed that they were going to stick with Norman Petty. Petty said it was fine if Buddy wanted to fire him, but he wasn't getting any money until a full audit had been done of the organisation's money. Buddy was no longer even going to get the per diem pocket money or expenses he'd been getting.\n\nHolly went back to New York, and started writing many, many, more songs, recording dozens of acoustic demos for when he could start his plan up:\n\n[Excerpt: Buddy Holly, \"Crying, Waiting, Hoping\"]\n\nIt was a massive creative explosion for the young man. He was not only writing songs himself, but he was busily planning to make an album of Latin music, and he was making preparations for two more projects he'd like to do -- an album of duets on gospel songs with Mahalia Jackson, and an album of soul duets with Ray Charles. He was going to jazz clubs, and he had ambitions of following Elvis into films, but doing it properly -- he enrolled in courses with Lee Strasberg's Actors Studio, to learn Method Acting. Greenwich Village in 1958 was the perfect place for a young man with a huge amount of natural talent and appetite for learning, but little experience of the wider world and culture.\n\nBut the young couple were living off Maria Elena's aunt's generosity, and had no income at all of their own. And then Maria Elena revealed that she was pregnant. And Norman Petty revealed something he'd kept hidden before -- by the terms of Buddy's contract, he hadn't really been recording for Brunswick or Coral, so they didn't owe him a penny. He'd been recording for Petty's company, who then sold the masters on to the other labels, and would get all the royalties. The Crickets bank account into which the royalties had supposedly been being paid, and which Petty had refused to let the band members see, was essentially empty.\n\nThere was only one thing for it. He had to do another tour. And the only one he could get on was a miserable-seeming affair called the Winter Dance Party. While most of the rock and roll package tours of the time had more than a dozen acts on, this one had only five. There was an opening act called Frankie Sardo, and then Dion and the Belmonts, who had had a few minor hits, and had just recorded, but not yet released, their breakthrough record \"Teenager in Love\":\n\n[Excerpt: Dion and the Belmonts, \"Teenager in Love\"]\n\nThen there was the Big Bopper, who was actually a fairly accomplished songwriter but was touring on the basis of his one hit, a novelty song called \"Chantilly Lace\":\n\n[Excerpt: the Big Bopper, \"Chantilly Lace\"]\n\nAnd Ritchie Valens, whose hit \"Donna\" was rising up the charts in a way that \"It Doesn't Matter Any More\" was notably failing to do:\n\n[Excerpt: Ritchie Valens, \"Donna\"]\n\nBuddy put together a new touring band consisting of Tommy Allsup on guitar, Waylon Jennings on bass -- who had never played bass before starting the tour -- and a drummer called Carl Bunch. For a while it looked like Buddy's friend Eddie Cochran was going to go on tour with them as well, but shortly before the tour started Cochran got an offer to do the Ed Sullivan Show, which would have clashed with the tour dates, and so he didn't make it.\n\nMaria Elena was very insistent that she didn't want Buddy to go, but he felt that he had no choice if he was going to support his new child.\n\nThe Winter Dance Party toured Wisconsin, Iowa, and Minnesota, through the end of January and the beginning of February 1959, and the conditions were miserable for everyone concerned. The tour had been put together with no thought of logistics, and it zig-zagged wildly across those three states, with gigs often four hundred miles away from each other. The musicians had to sleep on the tour bus -- or buses. The tour was being run on a shoe-string, and they'd gone with the cheapest vehicle-hire company possible. They went through, according to one biography I've read, eight different buses in eleven days, as none of the buses were able to cope with the Midwestern winter, and their engines kept failing and the heating on several of the buses broke down.\n\nI don't know if you've spent any time in that part of America in the winter, but I go there for Christmas every year (my wife has family in Minnesota) and it's unimaginably cold in a way you can't understand unless you've experienced it. It's not unusual for temperatures to drop to as low as minus forty degrees, and to have three feet or more of snow. Travelling in a bus, with no heating, in that weather, all packed together, was hell for everyone. The Big Bopper and Valens were both fat, and couldn't fit in the small seats easily. Several people on the tour, including Bopper and Valens, got the flu. And then finally Carl Bunch got hospitalised with frostbite.\n\nBuddy's band, which was backing everyone on stage, now had no drummer, and so for the next three days of the tour Holly, Dion, and Valens would all take it in turns playing the drums, as all of them were adequate drummers. The shows were still good, at least according to a young man named Robert Zimmerman, who saw the first drummerless show, in Duluth Minnesota, and who would move to Greenwich Village himself not that long afterwards.\n\nAfter a show in Clear Lake, Iowa, Buddy had had enough. He decided to charter a plane to take him to Fargo, North Dakota, which was just near Moorhead, Minnesota, where they were planning on playing their next show. He'd take everyone's laundry -- everyone stank and had been wearing the same clothes for days -- and get it washed, and get some sleep in a real bed.\n\nThe original plan was to have Allsup and Jennings travel with him, but eventually they gave up their seats to the two other people who were suffering the most -- the Big Bopper and Valens. There are different stories about how that happened, most involving a coin-toss, but they all agree that when Buddy found out that Waylon Jennings was giving up his seat, he jokingly said to Jennings \"I hope your old bus freezes\", and Jennings replied, \"Yeah, well I hope your ol' plane crashes\".\n\nThe three of them got on the plane in the middle of the night, on a foggy winter's night, which would require flying by instruments. Unfortunately, while the pilot on the plane was rated as being a good pilot during the day, he kept almost failing his certification for being bad at flying by instrument. And the plane in question had an unusual type of altitude meter. Where most altitude meters would go up when the plane was going up and down when it was going down, that particular model's meter went down when the plane was going up, and up when it was going down.\n\nThe plane took off, and less than five minutes after takeoff, it plummeted straight down, nose first, into the ground at top speed, killing everyone on board instantly.\n\nAs soon as the news got out, Holly's last single finally started rising up the charts. It ended up going to number thirteen on the US charts, and number one in many other countries.\n\nThe aftermath shows how much contempt the music industry -- and society itself -- had for those musicians at that time. Maria Elena found out about Buddy's death not from the police, but from the TV -- this later prompted changes in how news of celebrity deaths was to be revealed. She was so upset that she miscarried two days later. She was too distraught to attend the funeral, and to this day has still never been able to bring herself to visit her husband's grave. The grief was just too much.\n\nThe rest of the people on the tour were forced to continue the remaining thirteen days of the tour without the three acts anyone wanted to go and see, but were also not paid their full wages, because the bill wasn't as advertised.\n\nA new young singer was picked up to round out the bill on the next gig, a young Minnesotan Holly soundalike called Bobby Vee, whose first single, \"Suzy Baby\", was just about to come out:\n\n[Excerpt: Bobby Vee, \"Suzy Baby\"]\n\nWhen Vee went on tour on his own, later, he hired that Zimmerman kid we mentioned earlier as his piano player. Zimmerman worked under the stage name Elston Gunn, but would later choose a better one.\n\nAfter that date Holly, Valens, and the Bopper were replaced by Fabian, Frankie Avalon, and Jimmy Clanton, and the tour continued.\n\nMeanwhile, the remaining Crickets picked themselves up and carried on. They got Buddy's old friend Sonny Curtis on guitar, and a succession of Holly-soundalike singers, and continued playing together until Joe Mauldin died in 2015. Most of their records without Buddy weren't particularly memorable, but they did record one song written by Curtis which would later become a hit for several other people, \"I Fought the Law\":\n\n[Excerpt: The Crickets, \"I Fought the Law\"]\n\nBut the person who ended up benefiting most from Holly's death was Norman Petty. Suddenly his stockpile of unreleased Buddy Holly recordings was a goldmine -- and not only that, he ended up coming to an agreement with Holly's estate that he could take all those demos Holly had recorded and overdub new backing tracks on them, turning them into full-blown rock and roll songs. Between overdubbed versions of the demos, and stockpiled full-band recordings, Buddy Holly kept having hit singles in the rest of the world until 1965, though none charted in the US, and he made both Petty and his estate very rich.\n\nNorman Petty died in 1984. His last project was a still-unreleased \"updating\" of Buddy's biggest hits with synthesisers.\n\nThese days, Buddy Holly is once again on tour, or at least something purporting to be him is. You can now go and see a \"hologram tour\", in which an image of a look-not-very-alike actor miming to Holly's old recordings is projected on glass, using the old Victorian stage trick Pepper's Ghost, while a live band plays along to the records. Just because you've worked someone to death aged twenty-two, doesn't mean that they can't still keep earning money for you when they're eighty-three. And a hologram will never complain about how cold the tour bus is, or want to wash his laundry.",
  "itunes:subtitle": "Episode seventy-four of A History of Rock Music in Five Hundred Songs looks at It Doesnt Matter Any More by Buddy Holly, and at the reasons he ended up on the plane that killed him. Click the full post to read liner notes, links to more information, and ",
  "itunes:keywords": "Alan Freed,Bob Dylan,Bobby Vee,Brill Building,Brunswick Records,Buddy Holly,Coral Records,Dion and the Belmonts,Ed Sullivan,Eddie Cochran,Jerry Allison,Joe Mauldin,King Curtis,Larry Williams,lawsuits,Little Richard,Norman Petty,Paul Anka,Ritchie Valens,Sonny Curtis,The Big Bopper,the Crickets,Waylon Jennings",
  "itunes:episodeType": "full",
  "itunes:episode": 74,
  "content:encoded": "Episode seventy-four of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"It Doesn't Matter Any More\" by Buddy Holly, and at the reasons he ended up on the plane that killed him. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/34981315\">on \"Chantilly Lace\" by the Big Bopper</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com\">http://sitcomclub.com</a>\n\n\n\nNo Mixcloud this week -- I get a server error when uploading the file to Mixcloud's site.\n\n<strong>Erratum</strong>\n\nI mention that Bob Dylan saw the first show on the Winter Dance Party tour with no drummer. He actually saw the last one with the drummer, who was hospitalised that night after the show, not before the show as I had thought.\n\n<strong>Resources</strong>\n\nI've used two biographies for the bulk of the information here -- <a href=\"https://amzn.to/2PrUozx\">Buddy Holly: Learning the Game</a>, by Spencer Leigh, and <a href=\"https://amzn.to/2LXTlVS\">Rave On: The Biography of Buddy Holly</a> by Philip Norman. I also used  <a href=\"https://amzn.to/2IyQVuU\">Beverly Mendheim's book</a> on Ritchie Valens.\n\nThere are many collections of Buddy Holly's work available, but many of them are very shoddy, with instrumental overdubs recorded over demos after his death. The best compilation I am aware of is <a href=\"https://amzn.to/2RZ1A7O\">The Memorial Collection</a>, which contains almost everything he issued in his life, as he issued it (for some reason two cover versions are missing) along with the undubbed acoustic recordings that were messed with and released after his death.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?\n\n<strong>Transcript</strong>\n\nBefore I begin, this episode will deal with both accidental bereavement and miscarriage, so if you think those subjects might be traumatising, you may want to skip this one.\n\nToday, we're going to look at a record that holds a sad place in rock and roll's history, because it's the record that is often credited as \"the first posthumous rock and roll hit\".\n\nNow, that's not strictly true -- as we've talked about before in this podcast, there is rarely, if ever, a \"first\" anything at all, and indeed we've already looked at an earlier posthumous hit when we talked about \"Pledging My Love\" by Johnny Ace. But it is a very sad fact that \"It Doesn't Matter Any More\" by Buddy Holly ended up becoming the first of several posthumous hit records that Holly had, and that there would be many more posthumous hit records by other performers after him than there had been before him.\n\nBuddy Holly's death is something that hangs over every attempt to tell his story. More than any other musician of his generation, his death has entered rock and roll mythology. Even if you don't know Holly's music, you probably know two things about him -- that he wore glasses, and that he died in a plane crash. You're likely also to know that Ritchie Valens and the Big Bopper died in the same crash, even if you don't know any of the songs that either of those two artists recorded.\n\nNormally, when you're telling a story, you'd leave that to the end, but in the case of Holly it overshadows his life so much that there's absolutely no point trying to build up any suspense -- not to mention that there's something distasteful about turning a real person's tragic death into entertainment. I hope I've not done so in episodes where other people have died, but it's even more important not to do so here.\n\nBecause while the death of Buddy Holly, Ritchie Valens, and the Big Bopper is always portrayed as an accident, the cause of their death has its roots in exploitation of young, vulnerable, people, and a pressure to work no matter what.\n\nSo today, we're going to look at how \"It Doesn't Matter Any More\" became Buddy Holly's last single:\n\n[Excerpt: Buddy Holly, \"It Doesn't Matter Any More\"]\n\nPeople often talk about how Buddy Holly's career was short, but what they don't mention is that his chart career was even shorter. Holly's first chart single, \"That'll Be the Day\", was released in May 1957. His last top thirty single during his lifetime, \"Think it Over\", was released in May 1958. By the time he went on the Winter Dance Party, the tour that led to his death, in January 1959, he had gone many months without a hit, and his most recent record, \"Heartbeat\", had only reached number eighty-two. He'd lost every important professional relationship in his life, and had split from the group that had made him famous. To see how this happened, we need to pick up where we left off with him last time.\n\nYou'll remember that when we left the Crickets, they'd released \"That'll Be the Day\", and it hadn't yet become a hit, and they'd also released \"Words of Love\" as a Buddy Holly solo single. While there were different names on them, the same people would make the records, whether it was a solo or group record -- Buddy Holly on vocals and lead guitar, Niki Sullivan on rhythm guitar, Jerry Allison on drums, Joe Mauldin on bass, and producer Norman Petty and his wife sometimes adding keyboards. They didn't distinguish between \"Buddy Holly\" and \"Crickets\" material when recording -- rather they separated it out later. The more straight-ahead rock and roll records would have backing vocals overdubbed on them, usually by a vocal group called the Picks, and would be released as Crickets records, while the more experimental ones would be left with only Holly's vocal on, and would be released as solo records.\n\n(There were no records released as by \"Buddy Holly and the Crickets\" at the time, because the whole idea of the split was that DJs would play two records instead of one if they appeared to be by different artists).\n\nAnd they were recording *a lot*. Two days after “That'll be the Day” was released, on the twenty-seventh of May 1957, they recorded \"Everyday\" and \"Not Fade Away\". Between then and the first of July they recorded \"Tell Me How\", \"Oh Boy\", \"Listen to Me\", \"I'm Going to Love You Too\", and cover versions of Fats Domino's \"Valley of Tears\" and Little Richard's \"Ready Teddy\". Remember, this was all before they'd had a single hit -- \"That'll Be the Day\" and \"Words of Love\" still hadn't charted.\n\nThis is quite an astonishing outpouring of songs, but the big leap forward came on the second of July, when they made a second attempt at a song they'd attempted to record back in late 1956, and had been playing in their stage show since then. The song had originally been titled \"Cindy Lou\", after Buddy's niece, but Jerry Allison had recently started dating a girl named Peggy Sue Gerrison, and they decided to change the lyrics to be about her.\n\nThe song had also originally been played as a Latin-flavoured number, but when they were warming up, Allison started playing a fast paradiddle on his snare drum. Holly decided that they were going to change the tempo of the song and have Allison play that part all the way through, though this meant that Allison had to go out and play in the hallway rather than in the main studio, because the noise from his drums was too loud in the studio itself.\n\nThe final touch came when Petty decided, on the song's intro, to put the drums through the echo chamber and keep flicking the switch on the echo from \"on\" to \"off\", so it sounded like there were two drummers playing:\n\n[Excerpt: Buddy Holly, \"Peggy Sue\"]\n\nSomeone else was flicking a switch, too -- Niki Sullivan was already starting to regret joining the Crickets, because there really wasn't room for his rhythm guitar on most of the songs they were playing. And on \"Peggy Sue\" he ended up not playing at all. On that song, Buddy had to switch between two pickups -- one for when he was singing, and another to give his guitar a different tone during the solo. But he was playing so fast that he couldn't move his hand to the switch, and in those days there were no foot pedals one could use for the same sort of effect. So Niki Sullivan became Holly's foot pedal. He knelt beside Holly and waited for the point when the solo was about to start, and flicked the switch on his guitar. When the solo came to an end again, Sullivan flicked the switch again and it went back to the original sound.\n\n[Excerpt: Buddy Holly, \"Peggy Sue\"]\n\nIt's a really strange sounding record, if you start to pay attention to it. Other than during the solo, Holly's guitar is so quiet that you can hear the plectrum as loudly as you can hear the notes. He just keeps up a ram-a-ram-a quaver downstrum throughout the whole song, which sounds simple until you try to play it, at which point you realise that you start feeling like your arm's going to fall off about a quarter of the way through. And there's just that, those drums (playing a part which must be similarly physically demanding) with their weird echo, and Holly's voice. In theory, Joe Mauldin's bass is also in there, but it's there at almost homeopathic levels. It's a record that is entirely carried by the voice, the drums, and the guitar solo.\n\nOf course, Niki Sullivan wasn't happy about being relegated to guitar-switch-flicker, and there were other tensions within the group as well. Holly was having an affair with a married woman at the time -- and Jerry Allison, who was Holly's best friend as well as his bandmate, was also in love with her, though not in a relationship with her, and so Holly had to keep his affair hidden from his best friend. And not only that, but Allison and Sullivan were starting to have problems with each other, too.\n\nTo help defuse the situation, Holly's brother Larry took him on holiday, to go fishing in Colorado. But even there, the stress of the current situation was showing -- Buddy spent much of the trip worried about the lack of success of \"That'll Be the Day\", and obsessing over a new record by a new singer, Paul Anka, that had gone to number one:\n\n[Excerpt: Paul Anka, \"Diana\"]\n\nHolly was insistent that he could do better than that, and that his records were at least as good. But so far they were doing nothing at all on the charts.\n\nBut then a strange thing happened. \"That'll Be the Day\" started getting picked up by black radio stations. It turned out that there had been another group called the Crickets -- a black doo-wop group from about five years earlier, led by a singer called Dean Barlow, who had specialised in smooth Ink Spots-style ballads:\n\n[Excerpt The Crickets featuring Dean Barlow, \"Be Faithful\"]\n\nPeople at black radio stations had assumed that this new group called the Crickets was the same one, and had then discovered that \"That'll Be the Day\" was really rather good. The group even got booked on an otherwise all-black tour headlined by Clyde McPhatter and Otis Rush, booked by people who hadn't realised they were white. Before going on the tour, they formally arranged to have Norman Petty be their manager as well as their producer.\n\nThey were a success on the tour, though when it reached the Harlem Apollo, which had notoriously hostile audiences, the group had to reconfigure their sets, as the audiences didn't like any of Holly's original material except \"That'll Be the Day\", but did like the group's cover versions of R&B records like \"Bo Diddley\":\n\n[Excerpt: Buddy Holly, \"Bo Diddley (Undubbed Version)\"]\n\nSome have said that the Crickets were the first white act to play the Apollo. That's not the case -- Bobby Darin had played there before them, and I think so had the jazz drummer Buddy Rich, and maybe one or two others. But it was still a rarity, and the Crickets had to work hard to win the audience around.\n\nAfter they finished that tour, they moved on to a residency at the Brooklyn Paramount, on an Alan Freed show that also featured Little Richard and Larry Williams -- who the Crickets met for the first time when they walked into the dressing room to find Richard and Williams engaged in a threesome with Richard's girlfriend.\n\nDuring that engagement at the Paramount, the tensions within the group reached boiling point. Niki Sullivan, who was in an awful mood because he was trying to quit smoking, revealed the truth about Holly's affair to Allison, and the group got in a fist-fight. According to Sullivan -- who seems not to have always been the most reliable of interviewees -- Sullivan gave Jerry Allison a black eye, and then straight away they had to go to the rooftop to take the photo for the group's first album, The \"Chirping\" Crickets. Sullivan says that while the photo was retouched to hide the black eye, it's still visible, though I can't see it myself.\n\nAfter this, they went into a three-month tour on a giant package of stars featuring Chuck Berry, Fats Domino, Paul Anka, the Everly Brothers, the Bobbettes, the Drifters, LaVern Baker, and many more. By this point, both \"That'll Be the Day\" and \"Peggy Sue\" had risen up the charts -- \"That'll Be the Day\" eventually went to number one, while \"Peggy Sue\" hit number three -- and the next Crickets single, \"Oh Boy!\" was also charting.\n\n\"Oh Boy!\" had originally been written by an acquaintance of the band, Sonny West, who had recorded his own version as \"All My Love\" a short while earlier:\n\n[Excerpt: Sonny West, \"All My Love\"]\n\nGlen Hardin, the piano player on that track, would later join a lineup of the Crickets in the sixties (and later still would be Elvis' piano player and arranger in the seventies). Holly would later also cover another of West's songs, \"Rave On\".\n\nThe Crickets' version of “Oh Boy!” was recorded at a faster tempo, and became another major hit, their last top ten:\n\n[Excerpt: The Crickets, \"Oh Boy!\"]\n\nAround the time that came out, Eddie Cochran joined the tour, and like the Everly Brothers he became fast friends with the group. The group also made an appearance on the Ed Sullivan Show, with Holly, Mauldin, and Allison enthusiastically performing \"That'll Be the Day\" and \"Peggy Sue\", and Sullivan enthusiastically miming and playing an unplugged guitar.\n\nSullivan was becoming more and more sidelined in the group, and when they returned to Lubbock at the end of the tour -- during which he'd ended up breaking down and crying -- he decided he was going to quit the group.\n\nSullivan tried to have a solo career, releasing \"It's All Over\" on Dot Records:\n\n[Excerpt: Niki Sullivan, \"It's All Over\"]\n\nBut he had no success, and ended up working in electronics, and in later years also making money from the Buddy Holly nostalgia industry. He'd only toured as a member of the group for a total of ninety days, though he'd been playing with them in the studio for a few months before that, and he'd played on a total of twenty-seven of the thirty-two songs that Holly or the Crickets would release in Holly's lifetime.\n\nWhile he'd been promised an equal share of the group's income -- and Petty had also promised Sullivan, like all the other Crickets, that he would pay 10% of his income to his church -- Sullivan got into endless battles with Petty over seeing the group's accounts, which Petty wouldn't show him, and eventually settled for getting just $1000, ten percent of the recording royalties just for the single \"That'll Be the Day\", and co-writing royalties on one song, \"I'm Going to Love You Too\". His church didn't get a cent.\n\nMeanwhile, Petty was busy trying to widen the rifts in the group. He decided that while the records would still be released as either \"Buddy Holly\" or \"the Crickets\", as a live act they would from now on be billed as \"Buddy Holly and the Crickets\", a singer and his backing group, and that while Mauldin and Allison would continue to get twenty-five percent of the money each, Holly would be on fifty percent. This was an easy decision, since Petty was handling all the money and only giving the group pocket money rather than giving them their actual shares of the money they'd earned.\n\nThe group spent all of 1958 touring, visiting Hawaii, Australia, the UK, and all over the US, including the famous last ever Alan Freed tour that we looked at recently in episodes on Chuck Berry and Jerry Lee Lewis. They got in another guitarist, Tommy Allsup, who took over the lead role while Buddy played rhythm, and who joined them on tour, though he wasn't an official member of the group. The first recording Allsup played on was \"It's So Easy\":\n\n[Excerpt: The Crickets, \"It's So Easy\"]\n\nBut the group's records were selling less and less well. Holly was getting worried, and there was another factor that came into play. On a visit to New York, stopping in to visit their publisher in the Brill Building, all three of the Crickets became attracted to the receptionist, a Puerto Rican woman named Maria Elena Santiago who was a few years older than them. They all started to joke about which of them would ask her out, and Holly eventually did so.\n\nIt turned out that while Maria Elena was twenty-five, she'd never yet been on a date, and she had to ask the permission of her aunt, who she lived with, and who was also the head of the Latin-American division of the publishing company. The aunt rang round every business contact she had, satisfied herself that Buddy was a nice boy, and gave her blessing for the date.\n\nThe next day, she was giving her blessing for the two to marry -- Buddy proposed on the very first date. They eventually went on a joint honeymoon with Jerry Allison and Peggy Sue.\n\nBut Maria Elena was someone who worked in the music industry, and was a little bit older, and she started saying things to Buddy like \"You need to get a proper accounting of the money that's owed you\", and \"You should be getting paid\". This strained his relationship with Petty, who didn't want any woman of colour butting her nose in and getting involved in his business.\n\nBuddy moved to a flat in Greenwich Village with Maria Elena, but for the moment he was still working with Petty, even after Petty used some extremely misogynistic slurs I'm not going to repeat here against his new wife. But he was worried about his lack of hits, and they tried a few different variations on the formula. The Crickets recorded one song, a cover version of a song they'd learned on the Australian tour, with Jerry Allison singing lead. It was released under the name \"Ivan\" -- Allison's middle name -- and became a minor hit:\n\n[Excerpt: Ivan, \"Real Wild Child\"]\n\nThey tried more and more different things, like getting King Curtis in to play saxophone on \"Reminiscing\", and on one occasion dispensing with the Crickets entirely and having Buddy cut a Bobby Darin song, \"Early in the Morning\", with other musicians. They were stockpiling recordings much faster than they could release them, but the releases weren't doing well at all. \"It's So Easy\" didn't even reach the top one hundred.\n\nHolly was also working with other artists. In September, he produced a session for his friend Waylon Jennings, who would later become a huge country star. It was Jennings' first ever session, and they turned out an interesting version of the old Cajun song \"Jole Blon\", which had earlier been a hit for Moon Mullican. This version had Holly on guitar and King Curtis on saxophone, and is a really interesting attempt at blending Cajun music with R&B:\n\n[Excerpt: Waylon Jennings, \"Jole Blon\"]\n\nBut Holly's biggest hope was placed in a session that was really breaking new ground. No rock and roll singer had ever recorded with a full string section before -- at least as far as he was aware, and bearing in mind that, as we've seen many times, there's never truly a first anything. In October 1958, Holly went into the studio with the Dick Jacobs Orchestra, with the intention of recording three songs -- his own \"True Love Ways\", a song called \"Moondreams\" written by Petty, and one called \"Raining in My Heart\" written by Felice and Boudleaux Bryant, who'd written many hits for his friends the Everly Brothers.\n\nAt the last minute, though, he decided to record a fourth song, which had been written for him by Paul Anka, the same kid whose \"Diana\" had been so irritating to him the year before. He played through the song on his guitar for Dick Jacobs, who only had a short while to write the arrangement, and so stuck to the simplest thing he could think of, basing it around pizzicato violins:\n\n[Excerpt: Buddy Holly, \"It Doesn't Matter Any More\"]\n\nAt that point, everything still seemed like it could work out OK. Norman Petty and the other Crickets were all there at the recording session, cheering Buddy on. That night the Crickets appeared on American Bandstand, miming to \"It's So Easy\". That would be the last time they ever performed together, and soon there would be an irreparable split that would lead directly to Holly's death -- and to his posthumous fame.\n\nHolly was getting sick of Norman Petty's continual withholding of royalties, and he'd come up with a plan. The Crickets would, as a group, confront Petty, get him to give them the money he owed them, and then all move to New York together to start up their own record label and publishing company. They'd stop touring, and focus on making records, and this would allow them the time to get things right and try new things out, which would lead to them having hits again, and they could also produce records for their friends like Waylon Jennings and Sonny Curtis.\n\nIt was a good plan, and it might have worked, but it relied on them getting that money off Norman Petty.\n\nWhen the other two got back to Texas, Petty started manipulating them. He told them they were small-town Texas boys who would never be able to live in the big city. He told them that they didn't need Buddy Holly, and that they could carry on making Crickets records without him. He told them that Maria Elena was manipulating Buddy, and that if they went off to New York with him it would be her who was in charge of the group from that point on. And he also pointed out that he was currently the only signatory on the group's bank account, and it would be a real shame if something happened to all that money.\n\nBy the time Buddy got back to Texas, the other two Crickets had agreed that they were going to stick with Norman Petty. Petty said it was fine if Buddy wanted to fire him, but he wasn't getting any money until a full audit had been done of the organisation's money. Buddy was no longer even going to get the per diem pocket money or expenses he'd been getting.\n\nHolly went back to New York, and started writing many, many, more songs, recording dozens of acoustic demos for when he could start his plan up:\n\n[Excerpt: Buddy Holly, \"Crying, Waiting, Hoping\"]\n\nIt was a massive creative explosion for the young man. He was not only writing songs himself, but he was busily planning to make an album of Latin music, and he was making preparations for two more projects he'd like to do -- an album of duets on gospel songs with Mahalia Jackson, and an album of soul duets with Ray Charles. He was going to jazz clubs, and he had ambitions of following Elvis into films, but doing it properly -- he enrolled in courses with Lee Strasberg's Actors Studio, to learn Method Acting. Greenwich Village in 1958 was the perfect place for a young man with a huge amount of natural talent and appetite for learning, but little experience of the wider world and culture.\n\nBut the young couple were living off Maria Elena's aunt's generosity, and had no income at all of their own. And then Maria Elena revealed that she was pregnant. And Norman Petty revealed something he'd kept hidden before -- by the terms of Buddy's contract, he hadn't really been recording for Brunswick or Coral, so they didn't owe him a penny. He'd been recording for Petty's company, who then sold the masters on to the other labels, and would get all the royalties. The Crickets bank account into which the royalties had supposedly been being paid, and which Petty had refused to let the band members see, was essentially empty.\n\nThere was only one thing for it. He had to do another tour. And the only one he could get on was a miserable-seeming affair called the Winter Dance Party. While most of the rock and roll package tours of the time had more than a dozen acts on, this one had only five. There was an opening act called Frankie Sardo, and then Dion and the Belmonts, who had had a few minor hits, and had just recorded, but not yet released, their breakthrough record \"Teenager in Love\":\n\n[Excerpt: Dion and the Belmonts, \"Teenager in Love\"]\n\nThen there was the Big Bopper, who was actually a fairly accomplished songwriter but was touring on the basis of his one hit, a novelty song called \"Chantilly Lace\":\n\n[Excerpt: the Big Bopper, \"Chantilly Lace\"]\n\nAnd Ritchie Valens, whose hit \"Donna\" was rising up the charts in a way that \"It Doesn't Matter Any More\" was notably failing to do:\n\n[Excerpt: Ritchie Valens, \"Donna\"]\n\nBuddy put together a new touring band consisting of Tommy Allsup on guitar, Waylon Jennings on bass -- who had never played bass before starting the tour -- and a drummer called Carl Bunch. For a while it looked like Buddy's friend Eddie Cochran was going to go on tour with them as well, but shortly before the tour started Cochran got an offer to do the Ed Sullivan Show, which would have clashed with the tour dates, and so he didn't make it.\n\nMaria Elena was very insistent that she didn't want Buddy to go, but he felt that he had no choice if he was going to support his new child.\n\nThe Winter Dance Party toured Wisconsin, Iowa, and Minnesota, through the end of January and the beginning of February 1959, and the conditions were miserable for everyone concerned. The tour had been put together with no thought of logistics, and it zig-zagged wildly across those three states, with gigs often four hundred miles away from each other. The musicians had to sleep on the tour bus -- or buses. The tour was being run on a shoe-string, and they'd gone with the cheapest vehicle-hire company possible. They went through, according to one biography I've read, eight different buses in eleven days, as none of the buses were able to cope with the Midwestern winter, and their engines kept failing and the heating on several of the buses broke down.\n\nI don't know if you've spent any time in that part of America in the winter, but I go there for Christmas every year (my wife has family in Minnesota) and it's unimaginably cold in a way you can't understand unless you've experienced it. It's not unusual for temperatures to drop to as low as minus forty degrees, and to have three feet or more of snow. Travelling in a bus, with no heating, in that weather, all packed together, was hell for everyone. The Big Bopper and Valens were both fat, and couldn't fit in the small seats easily. Several people on the tour, including Bopper and Valens, got the flu. And then finally Carl Bunch got hospitalised with frostbite.\n\nBuddy's band, which was backing everyone on stage, now had no drummer, and so for the next three days of the tour Holly, Dion, and Valens would all take it in turns playing the drums, as all of them were adequate drummers. The shows were still good, at least according to a young man named Robert Zimmerman, who saw the first drummerless show, in Duluth Minnesota, and who would move to Greenwich Village himself not that long afterwards.\n\nAfter a show in Clear Lake, Iowa, Buddy had had enough. He decided to charter a plane to take him to Fargo, North Dakota, which was just near Moorhead, Minnesota, where they were planning on playing their next show. He'd take everyone's laundry -- everyone stank and had been wearing the same clothes for days -- and get it washed, and get some sleep in a real bed.\n\nThe original plan was to have Allsup and Jennings travel with him, but eventually they gave up their seats to the two other people who were suffering the most -- the Big Bopper and Valens. There are different stories about how that happened, most involving a coin-toss, but they all agree that when Buddy found out that Waylon Jennings was giving up his seat, he jokingly said to Jennings \"I hope your old bus freezes\", and Jennings replied, \"Yeah, well I hope your ol' plane crashes\".\n\nThe three of them got on the plane in the middle of the night, on a foggy winter's night, which would require flying by instruments. Unfortunately, while the pilot on the plane was rated as being a good pilot during the day, he kept almost failing his certification for being bad at flying by instrument. And the plane in question had an unusual type of altitude meter. Where most altitude meters would go up when the plane was going up and down when it was going down, that particular model's meter went down when the plane was going up, and up when it was going down.\n\nThe plane took off, and less than five minutes after takeoff, it plummeted straight down, nose first, into the ground at top speed, killing everyone on board instantly.\n\nAs soon as the news got out, Holly's last single finally started rising up the charts. It ended up going to number thirteen on the US charts, and number one in many other countries.\n\nThe aftermath shows how much contempt the music industry -- and society itself -- had for those musicians at that time. Maria Elena found out about Buddy's death not from the police, but from the TV -- this later prompted changes in how news of celebrity deaths was to be revealed. She was so upset that she miscarried two days later. She was too distraught to attend the funeral, and to this day has still never been able to bring herself to visit her husband's grave. The grief was just too much.\n\nThe rest of the people on the tour were forced to continue the remaining thirteen days of the tour without the three acts anyone wanted to go and see, but were also not paid their full wages, because the bill wasn't as advertised.\n\nA new young singer was picked up to round out the bill on the next gig, a young Minnesotan Holly soundalike called Bobby Vee, whose first single, \"Suzy Baby\", was just about to come out:\n\n[Excerpt: Bobby Vee, \"Suzy Baby\"]\n\nWhen Vee went on tour on his own, later, he hired that Zimmerman kid we mentioned earlier as his piano player. Zimmerman worked under the stage name Elston Gunn, but would later choose a better one.\n\nAfter that date Holly, Valens, and the Bopper were replaced by Fabian, Frankie Avalon, and Jimmy Clanton, and the tour continued.\n\nMeanwhile, the remaining Crickets picked themselves up and carried on. They got Buddy's old friend Sonny Curtis on guitar, and a succession of Holly-soundalike singers, and continued playing together until Joe Mauldin died in 2015. Most of their records without Buddy weren't particularly memorable, but they did record one song written by Curtis which would later become a hit for several other people, \"I Fought the Law\":\n\n[Excerpt: The Crickets, \"I Fought the Law\"]\n\nBut the person who ended up benefiting most from Holly's death was Norman Petty. Suddenly his stockpile of unreleased Buddy Holly recordings was a goldmine -- and not only that, he ended up coming to an agreement with Holly's estate that he could take all those demos Holly had recorded and overdub new backing tracks on them, turning them into full-blown rock and roll songs. Between overdubbed versions of the demos, and stockpiled full-band recordings, Buddy Holly kept having hit singles in the rest of the world until 1965, though none charted in the US, and he made both Petty and his estate very rich.\n\nNorman Petty died in 1984. His last project was a still-unreleased \"updating\" of Buddy's biggest hits with synthesisers.\n\nThese days, Buddy Holly is once again on tour, or at least something purporting to be him is. You can now go and see a \"hologram tour\", in which an image of a look-not-very-alike actor miming to Holly's old recordings is projected on glass, using the old Victorian stage trick Pepper's Ghost, while a live band plays along to the records. Just because you've worked someone to death aged twenty-two, doesn't mean that they can't still keep earning money for you when they're eighty-three. And a hologram will never complain about how cold the tour bus is, or want to wash his laundry.",
  "enclosure": "",
  "itunes:summary": "Episode seventy-four of A History of Rock Music in Five Hundred Songs looks at \"It Doesn't Matter Any More\" by Buddy Holly, and at the reasons he ended up on the plane that killed him. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Chantilly Lace\" by the Big Bopper.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com\n\n\n\nNo Mixcloud this week -- I get a server error when uploading the file to Mixcloud's site.\n\nErratum\n\nI mention that Bob Dylan saw the first show on the Winter Dance Party tour with no drummer. He actually saw the last one with the drummer, who was hospitalised that night after the show, not before the show as I had thought.\n\nResources\n\nI've used two biographies for the bulk of the information here -- Buddy Holly: Learning the Game, by Spencer Leigh, and Rave On: The Biography of Buddy Holly by Philip Norman. I also used  Beverly Mendheim's book on Ritchie Valens.\n\nThere are many collections of Buddy Holly's work available, but many of them are very shoddy, with instrumental overdubs recorded over demos after his death. The best compilation I am aware of is The Memorial Collection, which contains almost everything he issued in his life, as he issued it (for some reason two cover versions are missing) along with the undubbed acoustic recordings that were messed with and released after his death.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nBefore I begin, this episode will deal with both accidental bereavement and miscarriage, so if you think those subjects might be traumatising, you may want to skip this one.\n\nToday, we're going to look at a record that holds a sad place in rock and roll's history, because it's the record that is often credited as \"the first posthumous rock and roll hit\".\n\nNow, that's not strictly true -- as we've talked about before in this podcast, there is rarely, if ever, a \"first\" anything at all, and indeed we've already looked at an earlier posthumous hit when we talked about \"Pledging My Love\" by Johnny Ace. But it is a very sad fact that \"It Doesn't Matter Any More\" by Buddy Holly ended up becoming the first of several posthumous hit records that Holly had, and that there would be many more posthumous hit records by other performers after him than there had been before him.\n\nBuddy Holly's death is something that hangs over every attempt to tell his story. More than any other musician of his generation, his death has entered rock and roll mythology. Even if you don't know Holly's music, you probably know two things about him -- that he wore glasses, and that he died in a plane crash. You're likely also to know that Ritchie Valens and the Big Bopper died in the same crash, even if you don't know any of the songs that either of those two artists recorded.\n\nNormally, when you're telling a story, you'd leave that to the end, but in the case of Holly it overshadows his life so much that there's absolutely no point trying to build up any suspense -- not to mention that there's something distasteful about turning a real person's tragic death into entertainment. I hope I've not done so in episodes where other people have died, but it's even more important not to do so here.\n\nBecause while the death of Buddy Holly, Ritchie Valens, and the Big Bopper is always portrayed as an accident, the cause of their death has its roots in exploitation of young, vulnerable, people, and a pressure to work no matter what.\n\nSo today, we're going to look at how \"It Doesn't Matter Any More\" became Buddy Holly's last single:\n\n[Excerpt: Buddy Holly, \"It Doesn't Matter Any More\"]\n\nPeople often talk about how Buddy Holly's career was short, but what they don't me",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode seventy-four of A History of Rock Music in Five Hundred Songs looks at \"It Doesn't Matter Any More\" by Buddy Holly, and at the reasons he ended up on the plane that killed him. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Chantilly Lace\" by the Big Bopper.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com\n\n\n\nNo Mixcloud this week -- I get a server error when uploading the file to Mixcloud's site.\n\nErratum\n\nI mention that Bob Dylan saw the first show on the Winter Dance Party tour with no drummer. He actually saw the last one with the drummer, who was hospitalised that night after the show, not before the show as I had thought.\n\nResources\n\nI've used two biographies for the bulk of the inf",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}