{
  "id": "tag:blogger.com,1999:blog-1747027701196237068.post-8793524908796878114",
  "published": "2022-02-03T05:00:00.005-05:00",
  "updated": "2022-02-03T12:39:42.672-05:00",
  "title": "David Archer: Reflections from an Anti-Racist Psychotherapist",
  "content": "<i><b>Editor's note:</b> This Black History Month, we’re highlighting Black perspectives, and sharing stories from Black Googlers, partners, and culture shapers from across Canada.&nbsp;</i><div><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEiIwl853FamTvvaXN8Ba5EUSs3j8KIkM3xzQ_O4-1Gfz2vpBJD-oX_pbvIBoKYCty19OLZ6CscogGGlzHzAFpb0fWpCNZO7gfH5_RQP3SxR9L2LubJ8UmjzDa0hiun259CoDJx3466AqJ5yhnG3pB1s78oAWJpd77amvfE98euSL7qEMk_x7M24-TeR=s512\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"512\" data-original-width=\"512\" height=\"640\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEiIwl853FamTvvaXN8Ba5EUSs3j8KIkM3xzQ_O4-1Gfz2vpBJD-oX_pbvIBoKYCty19OLZ6CscogGGlzHzAFpb0fWpCNZO7gfH5_RQP3SxR9L2LubJ8UmjzDa0hiun259CoDJx3466AqJ5yhnG3pB1s78oAWJpd77amvfE98euSL7qEMk_x7M24-TeR=w640-h640\" width=\"640\" /></a></div><div style=\"text-align: center;\"><span style=\"font-family: Arial; font-size: 12pt; white-space: pre-wrap;\"><span style=\"color: #666666;\"><div><br /></div></span></span></div><div><div>   <i><a href=\"https://archertherapy.com/\" rel=\"nofollow\" target=\"_blank\">David Archer</a> is an anti-racist psychotherapist, EMDRIA certified EMDR consultant, clinical social worker, couples and family therapist, and mindfulness meditator from Montreal, Canada (Tiohtià:ke). He is an expert clinician who works in private practice with diverse clinical populations. Mr. Archer provides individual and group consultations to other therapists, and presents internationally for conferences, companies, and community organizations. He specializes in efficient psychotherapeutic interventions that are designed to maintain long-lasting changes. He previously authored the highly acclaimed book, audiobook, and eBook called <a href=\"https://www.amazon.com/gp/product/1777450438/ref=as_li_tl?ie=UTF8&amp;tag=archertherapy-20&amp;camp=1789&amp;creative=9325&amp;linkCode=as2&amp;creativeASIN=1777450438&amp;linkId=cbc132618c0d09695be27ec51c847222\" rel=\"nofollow\" target=\"_blank\">Anti-Racist Psychotherapy: Confronting Systemic Racism and Healing Racial Trauma</a> as well as the follow-up book for personal care called Bl<a href=\"https://www.amazon.com/gp/product/1777450446/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=1777450446&amp;linkCode=as2&amp;tag=archertherapy-20&amp;linkId=d4bde4dfae66597d74700bf4e763b9b8\" rel=\"nofollow\" target=\"_blank\">ack Meditation: Ten Practices for Self-Care, Mindfulness, and Self-Determination</a>.&nbsp;</i></div><div><i><br /></i></div><div>Twenty years ago, I was a software engineer. I was fascinated with the ability to transmute lines of code into complex software. Programmers are interested in finding solutions to the endless barrage of error messages that obstruct our everyday apps and platforms. Currently, I am an anti-racist psychotherapist. In this field we also search for logic; within every client’s mind lies a solution that explains the errors they encounter in their lives. The clinician’s job is to elicit solutions. By deciphering the logic of the psyche, we move people to acknowledge their innate gifts and confront the suffering caused by the challenges of living in an imperfect social structure.&nbsp;</div><div><br /></div><div>My clinical experiences led me to the following understanding: anti-Black racism is like a trauma response. Much like the trauma survivor who avoids the source of their injury, the racist operates on the basis of a survival response: a fight, flight, or freeze reaction unconsciously activated to deal with a perceived threat to their insecure power structure.&nbsp;</div><div><br /></div><div>Within the social structure, racism can never be resolved by attending simple workshops, changing profile pictures on social media, or by corporations providing a superficial interest toward people with darker skin complexions. These kinds of performances only placate political interests rather than eradicating social problems. We require systemic interventions to address our overburdened and defunded health care system. There is an urgent need to transform our society into one that views mental health as a human right; and our leaders must understand the importance of anti-racism to encourage an unremitting conviction towards systemic and substantive change.&nbsp;</div><div><br /></div><div>When you hear people say that African-Canadians descended from enslaved people, there is an error in this logic. It refers to the trauma but not to who they were before the traumatization of European colonization. The ancestral Black mother of the human species, “mitochondrial Eve,” lived approximately 200,000 years ago on the African continent. Therefore, the Maafa, the centuries long atrocities of chattel slavery, cannot be seen as the beginning of our story. This is because humanity spent more millennia being melanated in the motherland.&nbsp;</div><div><br /></div><div>Thousands of years ago white people descended from the continent of Africa. This provokes an error in the white consciousness so the construct of race is necessary to divide our shared humanity. The only reason why they created a concept of race was to make a group of humans less human. Race was meant to dehumanize groups of people in order to justify genocide, cultural imperialism, and racial capitalism. Stealing the land from Indigenous people, robbing Africans from their own continent, and dissociating from our common origins are ways of reinforcing the deep multigenerational trauma that pervades our society.&nbsp;</div><div><br /></div><div>There is a higher chance of being traumatized depending on your social identity. Women face gendered violence at a higher rate and people of colour experience colourism differently from one another. Regardless of our labels, all people can heal. My main approach is called EMDR (Eye Movement Desensitization and Reprocessing) therapy. But anti-racist psychotherapy is not limited to EMDR; there are a range of approaches that are neuro-affective in nature, or even community based, that still utilize therapeutic memory reconsolidation. When we try something different, changes can happen.&nbsp;</div><div><br /></div><div>When people begin to reprocess their racial trauma, the goal is not to force them to stop identifying with their race, but to cultivate radical self-acceptance, revolutionary self-love, and a courageous commitment to improving their community. I have helped people to recover even with the odds stacked against them. In recent years, we have improved mental health awareness and have identified improved forms of trauma treatment. In the next few years we must develop the technology to decolonize our psychotherapy, to target higher order problems in our society, and help our families to break the generational cycles that have plagued them.&nbsp;</div><div><br /></div><div>I am old enough to remember not having social media and never hearing of an anti-racist psychotherapist. Imagine what the next 20 years will hold? My job is to help people to make changes in their lives. Once a programmer, always a programmer, debugging through error messages is a life’s work for me. But we need to upgrade our technology. There is a collective responsibility to heal from the trauma of our nations, societies, and families. Healing starts from a simple acknowledgment and sometimes the path can reveal itself. As our technology continues to stimulate our minds, let us have the courage to elevate our hearts as well. </div></div><div><br /></div><div><b>About David Archer:</b></div>David Archer, MSW, MFT, is an anti-racist psychotherapist from Montreal, Canada (Tiohtià:ke). He is an Approved EMDR consultant, works full time in private practice, and provides consulting services for organizations and other therapists. In addition to being trained as a clinical social worker, he is also a registered couple and family therapist.&nbsp;<div><br /></div><div>His philosophies are informed by mindfulness, intersectional feminism, and critical race theory. He provides mental health services practice using EMDR, Brainspotting, EFT, and other mind-body strategies which utilize memory reconsolidation and working memory taxation methods. Areas of interest relate to working with individuals who have suffered from PTSD, racial trauma, minority stress, addictions, relational conflict, and eating disorders. Mr. Archer is an ally of LGBTQ, Black, Indigenous, and oppressed people of color around the world.&nbsp;</div><div><br /></div><div>He is also the recent author of a book called Anti-Racist Psychotherapy: Confronting Systemic Racism and Healing Racial Trauma (available <a href=\"https://amzn.to/3pSBfZX\" rel=\"nofollow\" target=\"_blank\">here</a>) and Black Meditation: Ten Practices for Self-Care, Mindfulness, and Self-Determination (available <a href=\"https://amzn.to/3JEnhm7\" rel=\"nofollow\" target=\"_blank\">here</a>). </div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Aaron Brindle",
    "uri": "http://www.blogger.com/profile/13885417405401273013",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}