{
  "title": "Where are you based?",
  "link": "",
  "updated": "2021-02-28T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2021/02/28/austin",
  "content": "<p>Earlier this month I moved back to Austin.</p>\n\n<p>People often ask where I’m based.  My location history over the past few years\nhas been a bit odd.  This blogpost is an attempt to record this history in an\neffort to avoid repeating myself.</p>\n\n<h3 id=\"leaving-nyc\">Leaving NYC</h3>\n\n<p>I was based in NYC for several years, mostly due to my partner moving there at the time.\nNYC is a fantastic city, but not great for those who prefer nature to people.</p>\n\n<h3 id=\"visiting-california-while-starting-nvidia\">Visiting California while starting NVIDIA</h3>\n\n<p>In 2019 I started a new position at NVIDIA.  When starting out I decided to fly\nto California in order to on-board and get to know the company a bit better.\nOfficially starting in California also helped me get a slightly higher\nsalary (location-based pay is strange for remote workers).</p>\n\n<p>However, the NVIDIA HQ is in Santa Clara, a city where I knew virtually no one,\nwhile most of my friends and family were in the Oakland/Berkeley area.  As a\nresult I stayed in Santa Clara during the week, and then on Friday I would ride\nmy bike to the train, ride up to Berkeley, and work from there for a day with\nthe OSS crowd on the UC Berkeley campus.</p>\n\n<p>This behavior got me into the pattern of living out of AirBnB using mostly a\nroad bike and Amtrak as transit.  This was surprisingly ok.</p>\n\n<h3 id=\"deciding-to-leave-nyc\">Deciding to leave NYC</h3>\n\n<p>Being in California for a month made me realize how much I was missing being\naround nature.  In NYC I didn’t have much to do other than work and socialize\nwith people.  After being in California I picked up many of my old physical\nhobbies and generally felt much happier as a human.</p>\n\n<p>I decided to leave NYC permanently, but wasn’t sure where to go.</p>\n\n<h3 id=\"exploring-la-and-austin\">Exploring LA and Austin</h3>\n\n<p>I knew that the SF Bay Area wasn’t for me (I had lived there for many years\nearlier, and knew that it wasn’t ideal).  I then spent some time in LA (thank\nyou again Amtrak+Road Bike) and Austin to try them out.</p>\n\n<p>I had a couple of friends from childhood in LA, and several work colleagues in\nAustin.  Both are sunny and warm year-round and generally relaxed places to\nlive with nature near by.</p>\n\n<h3 id=\"austin-won\">Austin won</h3>\n\n<p>Austin had an interesting confluence of traits that made me enjoy it.</p>\n\n<ol>\n  <li>It’s entirely walkable downtown</li>\n  <li>It has excellent bike infrastructure</li>\n  <li>It has excellent scooter infrastructure (people love or hate these, with\nreason.  I was disabled at the time, and scooters were A lifesaver).</li>\n  <li>You can bike to a high-tech business scene, or to a swimming hole in about\nten minutes.  This rapid fall-off of city-to-nature fit my personality well.</li>\n  <li>It’s socially progressive</li>\n  <li>But maintains Texan character (arguably SF fared less well here)</li>\n</ol>\n\n<p>So, I flew back to NYC, packed my things in boxes, and shipped them to Austin,\nwhere I took up a lease.</p>\n\n<h3 id=\"business-travel-then-took-over\">Business travel then took over</h3>\n\n<p>This was pre-covid.  I was onboarding and managing a highly remote team, and\nalso at conferences 1-2 times a month.  Eventually it made more sense to live\nsomewhat nomadically.  I did this for about a year, living out of a small “fits\nunder the seat in front of you” sized backpack.  My life became very compact.</p>\n\n<p>And then COVID hit, making that lifestyle reckless.</p>\n\n<h3 id=\"quarantine-in-southern-california\">Quarantine in Southern California</h3>\n\n<p>Like many single millennials during this period,\nI fled back to my suburban birthplace and sheltered with my parents.</p>\n\n<p>This was actually pretty awesome.  There is stigma in North American culture\nabout living with your parents.  People who do this are sometimes considered\nunsuccessful.  As someone who, by some metrics at least, is seen as somewhat\nsuccessful, I’ll happily wave the “live with your parents” flag.  It’s great.</p>\n\n<p>I had spent prolonged periods with my parents before.  As the youngest and\nleast geographically constrained child, I’m often the one who swings by to\nhandle things when necessary, but I had never stayed with them this long.\nCross generational relationships are probably things that we should cultivate\nmore in our society.  My relationship with my parents has evolved considerably\nduring adulthood, but a prolonged duration of living together helped us all\nachieve a deeper growth that benefited all sides I think.</p>\n\n<h3 id=\"but-eventually-it-was-time-to-move-on\">But eventually, it was time to move on</h3>\n\n<p>Earlier this month my parents were vaccinated (woo!) and I was feeling restless.</p>\n\n<p>On February 5th I decided it would be a good idea to return to Texas.\nOn February 8th I got in a car and started the drive.\nOn February 10th I arrived back home in Austin.\nI think I actually was looking forward to two days of the drive more than anything.\nThere is something very satisfying right now about a large-but-simple task that\ndoesn’t require much brain power or decision making to make progress.</p>\n\n<h3 id=\"winter-storm\">Winter storm</h3>\n\n<p>It was cold when I arrived, but a week in I discovered that my return was\nill-timed, and Texas endured a crippling winter storm.  This was hard for many,\nI emerged a bit thinner, but mostly unscathed.</p>\n\n<h3 id=\"home-again\">Home again</h3>\n\n<p>I’ve been in Austin a few weeks now.  It has been great.\nWhen not sheltering from arctic temperatures I’ve enjoyed walking along dry\nriverbeds, paddling in wet ones, and seeing old friends.</p>\n\n<p>I’ve moved back into my building, picked up stuff generously stored at friends’\nhouses, and am looking forward to being here again.  Excitingly, I’m less\ndisabled this time around, and excited about exploring the nature that was only\nsemi-accessible before.</p>"
}