{
  "title": "Does the Muslim ban make us safer?",
  "link": "",
  "published": "2017-03-10T00:00:00-05:00",
  "updated": "2017-03-10T00:00:00-05:00",
  "author": {
    "name": "Tommy Blanchard"
  },
  "id": "tag:tommyblanchard.com,2017-03-10:/does-the-muslim-ban-make-us-safer",
  "summary": "<p>On March 6, Donald Trump signed a second executive order banning people from certain majority-muslim countries from entering the USA. The previous order banned citizens of seven countries: Syria, Iran, Sudan, Libya, Somalia, Yemen, and Iraq, but was stopped after legal action. The new ban applies to six countries - Iraq …</p>",
  "content": "<p>On March 6, Donald Trump signed a second executive order banning people from certain majority-muslim countries from entering the USA. The previous order banned citizens of seven countries: Syria, Iran, Sudan, Libya, Somalia, Yemen, and Iraq, but was stopped after legal action. The new ban applies to six countries - Iraq is not included - and uses different wording in the hopes of being on firmer legal ground.</p>\n<p>Trump and his administration <a href=\"http://www.cnbc.com/2017/01/29/trump-america-proud-nation-of-immigrants-says-this-is-not-about-religion.html\">have claimed that this ban is to protect Americans</a>. How effective is this ban for that purpose? I looked at data originally collected by <a href=\"https://www.newamerica.org/in-depth/terrorism-in-america/part-i-overview-terrorism-cases-2001-today/\">New America</a>. This data is from records of criminal convictions and deaths of terrorists. The data contains terrorist activity from after 9/11 up to 2017.</p>\n<p>The ban is supposed to protect Americans from terrorism. An obvious metric we can look at for how much harm terrorists from the banned countries do to America is looking at the number of people killed on American soil by terrorists from these countries.</p>\n<p><img alt=\"Terrorism deaths\" src=\"https://tommyblanchard.com/images/terrorism/terror-fig1.png\"></p>\n<p>Immigration control isn't going to be of much help curbing harm from terrorists, since the vast majority of terrorism-related deaths are caused by people born in America. A few were caused by people born in other countries, and absolutely none by people from the banned countries.</p>\n<p>However, the fact that terrorists from these countries didn't kill anyone does not mean that there are no terrorists from these countries, contrary to <a href=\"http://www.seattletimes.com/nation-world/nation-politics/ap-fact-check-no-arrests-from-7-nations-in-travel-ban-nope/\">false claims by a federal judge</a>. I was surprised to find that quite a few terrorists come from the banned countries - 58, if we include naturalized citizens and permanent residents. However the breakdown of where they come from is interesting. The vast majority of terrorists from the banned countries come from Somalia. None came from Libya. However, of those that come from the banned countries, most are naturalized citizens or permanent residents, and thus would not have been affected by the ban (except the first ban, which originally applied to permanent residents).</p>\n<p><img alt=\"Terrorist origins\" src=\"https://tommyblanchard.com/images/terrorism/terror-fig2.png\"></p>\n<p>It's important to put the threat foreign terrorists pose to America in context. Currently, <a href=\"http://www.people-press.org/2017/01/24/after-seismic-political-shift-modest-changes-in-publics-policy-agenda/\">even among Democrats, a majority list terrorism as a top policy priority</a>. But would we actually be significantly safer even if we somehow managed to eliminate all terrorism caused by people born outside of America?</p>\n<p>25 deaths over 16 years is not a very large number. On average, only slightly more people die each year by foreign terrorists as from alligator attacks or during enema administrations. More than twice as many people die riding roller-coasters, and the number of people killed each year by lightning is is one and a half times greater than the total number of people killed by foreign terrorists since 9/11.</p>\n<p><img alt=\"Rare deaths\" src=\"https://tommyblanchard.com/images/terrorism/terror-fig3.png\"></p>\n<p>There are plenty of costs to the Muslim ban - it exacerbates <a href=\"https://www.scientificamerican.com/article/trump-immigration-ban-can-worsen-u-s-doctor-shortage-hurt-hospitals/\">the doctor shortage</a> and it <a href=\"http://www.slate.com/articles/health_and_science/climate_desk/2017/02/trump_s_ban_will_also_staunch_scientific_progress.html\">hurts U.S. science</a>. Many worry that <a href=\"http://www.nbcnews.com/news/us-news/trump-travel-ban-makes-america-less-safe-ex-top-security-n717206\">the move hurts intelligence gathering</a> on terrorist organizations by hurting relations with the banned countries, making us less safe from terrorists.</p>\n<p>In terms of protecting Americans, legislation on roller-coasters would likely be more effective at keeping Americans safe than immigration policy reform possibly could.</p>\n<p><em>Sources for non-terrorism death rates:</em></p>\n<p>Alligators: <a href=\"https://en.wikipedia.org/wiki/List_of_fatal_alligator_attacks_in_the_United_States\">Wikipedia</a>. Data for 2001-2017</p>\n<p>Enema administration: <a href=\"https://wonder.cdc.gov/controller/datarequest/D132\">Centers for Disease Control and Prevention</a>. Data for 1999-2016.</p>\n<p>Roller-coasters: <a href=\"http://injuryprevention.bmj.com/content/11/5/309\">Injury Prevention</a>. Data for 1994-2004</p>\n<p>Lightning: <a href=\"http://origin-www.nws.noaa.gov/om/lightning/resources/RecentLightningDeaths.pdf\">National Weather Service</a>. Data for 2006-2013</p>",
  "category": [
    "",
    "",
    "",
    "",
    ""
  ]
}