{
  "title": "Matter Launch Day Event brought big news about future updates, compatible products",
  "link": "https://www.digitaltrends.com/home/matter-launch-day-news/",
  "pubDate": "Fri, 04 Nov 2022 14:58:37 +0000",
  "dc:creator": "Jon Bitner",
  "category": [
    "News",
    "Smart Home",
    "Amazon",
    "matter",
    "Nanoleaf",
    "smart home",
    "SmartThings"
  ],
  "guid": "https://www.digitaltrends.com/?p=3219633",
  "description": "The Matter Launch Event gave us a closer look at which products are implementing the technology, when they'll be available, and what to expect in the future.",
  "content:encoded": "<p>Matter and its accompanying certification program were <a href=\"https://www.digitaltrends.com/home/matter-officially-available/\">announced last month</a>, and now we’re getting our first official look at how companies will be using the new connectivity standard in their smart home lineup.</p>\n<p>The <a href=\"https://csa-iot.org/newsroom/smart-home-innovation-set-to-accelerate-with-matter%ef%bf%bc/\" target=\"_blank\" rel=\"nofollow noopener\">Matter Launch Event</a> kicked off today in Amsterdam &#8212; and it sounds like manufacturers are eager to get the tech integrated with their products. Over 190 devices are already Matter-certified or in line to get certified. The organization has also expanded to eight authorized locations for testing, which should speed up the process and get Matter into your home at an accelerated pace.</p>\n<figure class=\"alignnone\"><img  class=\" size-large wp-image-3219643\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/Matter-CSA.jpg?fit=720%2C405&p=1\" alt=\"The Matter logo on a colorful background.\"   /></figure>\n<p>Matter’s initial launch will support lighting, electrical products, HVAC controls, window coverings, security sensors, door locks, video players, and protocol bridges. During today’s Launch Event, the Connectivity Standards Alliance (CSA) revealed several new smart home categories are being worked on, including door closures, environmental sensors, smoke and carbon monoxide detectors, and motion sensors.</p>\n<p>Teams are also working on Matter support for cameras and home appliances, although these are not yet available to manufacturers.</p>\n<p>Aside from support for new smart home categories and a general rush of excitement from manufacturers, the CSA event brought us some actual dates and specific products that will be getting Matter support. This includes <a href=\"https://developer.amazon.com/en-US/blogs/alexa/device-makers/2022/11/matter-works-with-alexa-introduction-november-2022.html\" target=\"_blank\" rel=\"sponsored nofollow noopener\">17 Echo devices</a> in December with more to follow next year, the Nanoleaf Essentials Bulbs and Lightstrip in 2023, and three sensors from Eve Systems (Eve Energy, Eve Door and Window, Eve Motion) on December 12. Amazon also confirmed that it is collaborating with Samsung SmartThings to improve compatibility between the two ecosystems. Philips Hue Bridge is also receiving an update to Matter early in the next year.</p>\n<p>Matter is expected to play a big role in the smart home industry, so expect to hear even more announcements as we inch closer to 2023.</p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2022/11/Matter-CSA.jpg?p=1",
  "enclosure": "",
  "post-id": 3219633
}