{
  "title": "Episode 80: &#8220;Money&#8221; by Barrett Strong",
  "link": "https://500songs.com/podcast/episode-80-money-by-barrett-strong/",
  "pubDate": "Mon, 27 Apr 2020 19:02:08 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-80-money-by-barrett-strong/",
  "description": "Episode eighty of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Money\" by Barrett Strong, the dispute over its authorship, and the start of a record label that would change music. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/36466350\">on \"Alley Oop\" by the Hollywood Argyles.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Errata</strong>\n\nI say “His name didn't appear on the label of the record.” I mean here that Strong's name didn't appear on the label as a songwriter. It obviously did appear as the performer.\n\nMore significantly, I appear to have got the date when \"Money\" charted wrong -- see the comment thread.\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-80-money/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nYou might want to listen again to t<a href=\"https://www.500songs.com/e/episode-sixty-four-reet-petite-by-jackie-wilson/\">he episode on Jackie Wilson,</a> in which we looked at Berry Gordy's career to this point.\n\nI used six principal sources to put together the narrative for this one, most of which I will be using for most future Motown episodes.\n\n<a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em> by Nelson George</a> is an excellent popular history of the various companies that became Motown.\n\n<a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em> by Berry Gordy</a> is Gordy's own, understandably one-sided, but relatively well-written, autobiography.\n\n<a href=\"https://amzn.to/2VIpXII\"><em>Women of Motown: An Oral History</em> by Susan Whitall</a> is a collection of interviews with women involved in Motown, including Janie Bradford.\n\n<a href=\"https://amzn.to/2xVdvfD\"><em>I Hear a Symphony: Motown and Crossover R&B </em>by J. Andrew Flory</a> is an academic look at Motown.\n\n<a href=\"https://amzn.to/2VLquJX\"><em>The Motown Encyclopaedia</em> by Graham Betts</a> is an exhaustive look at the people and records involved in Motown's thirty-year history.\n\nAnd <a href=\"https://motownjunkies.co.uk/\">Motown Junkies</a> is an infrequently-updated blog looking at (so far) the first 693 tracks released on Motown singles.\n\nThere is a Complete Motown Singles 1959-62 box available from Hip-O-Select with comprehensive liner notes, but if you just want the music, I recommend instead <a href=\"https://amzn.to/2YbX0qa\">this much cheaper bare-bones box</a> from Real Gone Music.\n\nAnd <a href=\"https://amzn.to/35gQ9Nx\">this set</a> contains every recording that Barrett Strong made for Tamla as a performer.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nToday, we're going to look at a record which was the first success for one of the most important record labels of all time, which has one of the most instantly recognisable riffs of any record ever, and which was the product of a one-hit wonder who would, several years later, go on to be a hugely important figure as a writer, rather than a performer. Along the way we're going to look at the beginnings of many, many, other careers we'll be seeing more of in the next couple of years. Today, we're going to look at \"Money\" by Barrett Strong:\n\n[Excerpt: Barrett Strong, \"Money\"]\n\nWhen we left Berry Gordy Jr, he had just stopped writing songs for Jackie Wilson -- while the songs he'd co-written with his sister Gwen and her boyfriend Roquel Davis had been massive hits for Wilson, Wilson's manager had believed that any songwriters could bring the same amount of success, and that Wilson's records were selling solely because of Wilson's performances.\n\nDavis and Gwen had started up a new record label with the help of another Gordy sister, Anna, after whom they named the label. But at the start, Berry Gordy had little involvement in that label. While Gwen had wanted Berry to become a partner in the business, Berry had soured on the idea of business partners after some of his other ventures had failed due to conflicts between him and his partners. Berry was going to work for himself. He would write and produce for his family's record labels, but he wasn't going to be a partner in their businesses.\n\nInstead, he focussed on a group he'd got to know. The Matadors were a vocal group he'd seen audition, and been mildly impressed with, but he had decided to work with them mostly because he was very attracted to one of their singers, Claudette Rogers. He'd worked with them for a few days before asking Claudette out, and she'd turned him down because she was seeing one of the other group members, William Robinson. But by that point Gordy had got to know Robinson, and to appreciate his talent, and his response was just to tell her how lucky she was to have a man like that.\n\nHe took them on as a management project, and also decided to teach Robinson songwriting -- Robinson had written a lot of songs, which showed potential, but Gordy thought none of them were quite there yet. What impressed Gordy most was Robinson's attitude, every time Gordy told him what was wrong with a song -- Robinson would just go on to the next song, as enthusiastic as ever.\n\nEventually, Robinson came up with a song that they thought could be a hit. At the time, the Silhouettes had a big hit with a song called \"Get a Job\":\n\n[Excerpt: The Silhouettes, \"Get a Job\"]\n\nRobinson had come up with an answer song, which he called \"Got a Job\". Gordy decided that that was good enough for him to produce a recording -- he'd recently started up a production company, which he primarily used to produce demos of his own songs, with singers like Eddie Holland.\n\nGordy took the group into the studio, and got a deal with George Goldner's label End Records to distribute the single that resulted. The only thing was, Gordy still wasn't happy with the group's name -- The Matadors sounded too masculine for a group which had a woman in it. So they all chose other names, wrote them down, stuck them in a hat, and the one that came out was \"the Miracles\"; and so \"Got a Job\" by the Miracles came out on End Records on William “Smokey” Robinson's eighteenth birthday:\n\n[Excerpt: The Miracles, \"Got a Job\"]\n\nGordy at this point was a songwriter first and foremost, but he wanted to make sure he was making money from the songs. He had already started his own publishing company, after having not been paid the royalties he was owed on several of his songs. He'd decided that he could use his production company to ensure his songs got a release -- he'd lease the recordings out to other labels, like End, or his sister's label Anna. The recordings themselves were just a way to get some money from the songs, which were his real business.\n\nHe and his second wife Raynoma also used their production company, named Rayber as a portmanteau of their two names, in another way -- they would, for a fee, provide a full professional recording of anyone -- you could walk in and pay for an arrangement of your song by Berry Gordy, instrumental backing, vocals by the Rayber Singers (a fluid group of people that included Raynoma and Eddie Holland), and a copy of the record. If the amateur singer who came in was any good, the results would be quite listenable, as in \"I Can't Concentrate\" by Wade Jones, which they liked so much they later even released it properly:\n\n[Excerpt: \"I Can't Concentrate\", Wade Jones]\n\nBut at this point, Gordy still wasn't making much money at all. In 1959, according to court papers around a claim for child support for his kids, he made $27.70 a week on average -- and almost all of that came from a single one-thousand-dollar cheque for writing \"Lonely Teardrops\" for Jackie Wilson. And producing the Miracles didn't add much to that -- when Gordy received his first royalty cheque from End Records for \"Got a Job\", he was astonished to see that it was only for $3.19.\n\nTo add insult to injury, End Records tried to claim that the Miracles were now their artists, and they were going to record them directly, without the involvement of Gordy. This was a thing that many businesses connected with Morris Levy did, and they were usually successful, because if you get into an argument with the Mafia you'll probably not win. But in the case of Gordy, his family were so well-known and respected in Detroit's black community, and Gordy himself had enough cachet because of his work with Jackie Wilson, that a contingent of black DJs told End Records that they'd stop playing any of their records unless they backed off on the Miracles.\n\nBut all this led Gordy to one conclusion -- one he didn't come to until Smokey Robinson pointed it out to him. He needed to start his own record label, just like his sisters had. The problem was that he had no money, and while his family was, for a black family at the time, very rich, they held their money in a trust and required a proper contract and unanimous approval from all eight siblings before they would provide one of the family with a business loan -- and Berry was regarded by his siblings as a useless drifter and underachiever.\n\nBut eventually he managed to win them round, and they lent him $800. His original idea for the name of the label was \"Tammy\", after Debbie Reynolds' hit, to show that they weren't just aiming at the R&B market:\n\n[Excerpt: Debbie Reynolds, \"Tammy\"]\n\nHowever, it turned out that there was another label called Tammy, and so Gordy decided on Tamla instead.\n\nTamla's first record was by a local singer called Marv Johnson, who had a very similar voice to that of Jackie Wilson, but who was known for having more of an ego than Wilson. There's an anonymous quote by someone who knew both men -- \"The difference between Marv and Jackie Wilson was that Wilson would kiss all the women, especially the ugly ones, because he knew if he did they'd be with him forever. Marv only kissed the pretty ones, and that coldness came through in everything he did.\"\n\nOne can argue about whether it's colder to cynically manipulate people's feelings or to show contempt for them, but it's definitely the case that Marv Johnson does not seem to have been well loved by many of the people who knew him.\n\nJohnson had recorded one previous single, \"My Baby-O\", on another record label:\n\n[Excerpt: Marv Johnson, \"My Baby-O\"]\n\nSome sources claim that Berry Gordy produced that track -- others that he was just present at the session, watching.\n\nWhatever Gordy's involvement with Johnson before signing him to Tamla, the first Tamla single, \"Come to Me\", was the start of something big. It was written by Johnson and Gordy, and featured a group of session players who would form the core of what would become known as the Funk Brothers -- James Jamerson, Benny Benjamin, Eddie Willis, Joe Messina, and Thomas “Beans” Bowles. On top of that, Brian Holland, who with his brother Eddie would later go on to become part of arguably the most important songwriting and production team of the sixties, was on backing vocals:\n\n[Excerpt: Marv Johnson, \"Come to Me\"]\n\nJohnson wrote that song himself, and Gordy polished it up, giving himself a co-writing credit.\n\nAt the start, Tamla was a very, very small operation. Other than the musicians they employed, the team mostly consisted of Berry and Raynoma Gordy, Smokey Robinson acting essentially as Berry's apprentice and assistant, and Janie Bradford, a teenage songwriter with whom Gordy had collaborated on a couple of songs for Jackie Wilson:\n\n[Excerpt: Jackie Wilson, \"The Joke (Is Not On Me)\"]\n\nBradford was given the official job title of receptionist, but she actually did almost all the admin at the label offices, doing everything from sorting out the contracts to mopping the floor, along with chipping in with songs when she had an idea.\n\nBecause they were a shoestring operation, Gordy, Marv Johnson, and Robinson would do most of the legwork of getting the track to radio stations, and it only got local distribution. They followed up with a second Tamla record, three weeks later, written by Berry and sung by Eddie Holland, who had sung on Berry's demos for Jackie Wilson and also had a Wilson-esque voice:\n\n[Excerpt: Eddie Holland, \"Merry Go Round\"]\n\nMarv Johnson's record, \"Come to Me\", became a local hit, but as we've talked about before, when you're running an indie label the last thing you want is a hit -- you have to pay to get the records pressed, but then you have to wait months for the money to come in from the distributors. Becoming too big too fast could be a problem.\n\nLuckily, before the record got too big, United Artists stepped in. They wanted to buy the master for \"Come to Me\", and to buy both Johnson and Holland's contracts from Gordy. Gordy would continue writing and producing for them, but they would be United Artists performers rather than on Tamla. Gordy got enough money from that deal to continue running his label for a while longer, and United Artists got their first R&B star -- \"Come to Me\" ended up going top thirty on the pop charts and top ten on the R&B charts. Not bad at all for something put out on a little micro-label.\n\nEddie Holland, on the other hand, didn't do so well on United Artists -- he wasn't ever a confident performer, and after two years he was back with Gordy's operation, this time working behind the scenes rather than as the main performer.\n\nSo Tamla was ready to put out its third single, and Gordy may have had a plan for how his label was going to get much bigger. It's been suggested by several people that a few of the early acts he signed were intended as ways to get more famous relatives of those acts interested in the label. For example, the first female solo singer he signed to the label, Mable John, was the sister of Little Willie John, the R&B star. Mable was certainly good enough to be hired on her own merits, but at the same time the thought must have crossed Gordy's mind that it would be good to get her brother recording for him.\n\nIn the same way, Smokey Robinson's favourite local group was Nolan Strong and the Diablos, who recorded the doo-wop classic \"The Wind\":\n\n[Excerpt: Nolan Strong and the Diablos, \"The Wind\"]\n\nNolan Strong's cousin Barrett was also an aspiring singer, and Gordy signed him to Tamla, and wrote him a song with his sister Gwen and her then-boyfriend Roquel Davis, the same team with whom he'd collaborated on Jackie Wilson's hits:\n\n[Excerpt: Barrett Strong, \"Let's Rock\"]\n\nUnfortunately, \"Let's Rock\" wasn't a hit, and Gordy seemed to decide to try to throw a lot of records at the wall to see what would stick. Over the next few months, they put out a variety of odd singles, none of which charted, and none of which seem much like the music Gordy was generally known for. There was \"Snake Walk\", a jazz instrumental played by the Funk Brothers under the name The Swinging Tigers, with the songwriting credited to Gordy and Robinson:\n\n[Excerpt: The Swinging Tigers, \"Snake Walk (part 1)\"]\n\nThere was \"It\", a novelty single about an alien, performed by Smokey Robinson and Ronnie White of the Miracles, under the name \"Ron & Bill\":\n\n[Excerpt: Ron & Bill, \"It\"]\n\nAnd a few more. But it wasn't until Barett Strong's second single, in August 1959, that Tamla hit the jackpot again.\n\nThere are three very different stories about how \"Money\" was written. According to Berry Gordy, he came up with the music and the whole first verse and chorus himself, and played it to Janie Bradford, who suggested a couple of lines for the second verse, but he was impressed enough with her lines that he gave her fifty percent of the song, even though she didn't think she'd contributed very much. Barrett Strong came and sat down with them, uninvited, and started singing along, but didn't contribute anything to the writing of the song.\n\nAccording to Janie Bradford, Berry Gordy was playing the riff on the piano, but had no words or melody yet. He said to her, \"I need a title, give me a title, something that everybody wants,\" and she replied \"Money, that's what I want!\" and the two of them wrote the lyrics together based on her lyrical idea.\n\nAnd according to Barrett Strong, who is backed up by the engineer and the guitarist on the session, *Strong* -- who played the piano on the session as well as singing -- was jamming the riff, having hit upon it while messing around with Ray Charles' \"What'd I Say\". Gordy only came into the session after Strong had already taught the instrumental parts to the musicians, and Gordy and Bradford only wrote the lyrics after the instrumental track was already completed.\n\nThe initial filing of the song's copyright credited Strong for words and music, Gordy for words and music, and Bradford only for words. According to both Bradford and Gordy, that's because Bradford, who filled out the form, didn't understand the form and made a mistake. Three years later, Strong's name was taken off the copyright, and he wasn't informed of the change. His name didn't appear on the label of the record.\n\nPersonally, I tend to believe Strong. The song simply doesn't sound that much like Gordy's other songs of the period, which were based far less on riffs, and which didn't tend to be twelve-bar blueses.\n\nWhoever wrote it, the result was a great record, and the first true classic to come out of the Gordy operation:\n\n[Excerpt: Barrett Strong, \"Money\"]\n\nThe B-side isn't quite as good, but it's still a strong ballad, and if you're a fan of John Lennon's solo work you might find the middle eight very familiar:\n\n[Excerpt: Barrett Strong, \"Oh I Apologize\"]\n\n\"Money\" came out on Tamla and was initially fairly unsuccessful, because Tamla didn't have any national distribution. But Anna Records did.\n\nThat label had partnered with Chess Records. Chess had sent Harvey Fuqua, who was working for Chess as an executive as well as a performer, over to work with Anna Records. Fuqua had brought with him another member of his latest lineup of the Moonglows, a young man named Marvin Gay, to work for Anna as a session drummer and part-time janitor, and Marvin soon got into a relationship with Anna Gordy.\n\nBut Marvin wasn't the only one to get into a relationship with a Gordy sister. Harvey Fuqua had been dating Etta James, with whom he was having a few hits as a duet act on Chess:\n\n[Excerpt: Etta James and Harvey Fuqua, \"Spoonful\"]\n\nBut he soon struck up a relationship with Gwen Gordy. He split up with James, Gwen Gordy split up with Roquel Davis -- and then Berry and Gwen Gordy and Roquel Davis wrote a song about the splits, which Etta James performed for Chess, back as a solo artist again:\n\n[Excerpt: Etta James, \"All I Could Do Was Cry\"]\n\nThat became a hit in June 1960, and that was also the month that \"Money\" finally became a hit, nearly a year after it was released. The Tamla record had been a local hit, but Tamla still didn't have any national distribution, so Berry Gordy leased the recording to his sisters' label. It was rereleased on Anna Records, distributed through Chess, and became the first national hit for one of the Gordy family of labels, reaching number two on the R&B charts and number twenty-three on the pop charts. The Gordy family of labels was starting to have some real success:\n\n[Excerpt: Barrett Strong, \"Money\"]\n\nUnfortunately, that would be Barrett Strong's only hit as a performer. Over the next eighteen months he would release a whole variety of singles, none of which had any success, eventually trying the desperate tactic of recording a follow-up to \"Money\", titled \"Money and Me\", with the writing credited to Berry Gordy, Janie Bradford, Smokey Robinson, and Robert Bateman -- a singer who was one of the Rayber singers:\n\n[Excerpt: Barrett Strong, \"Money and Me\"]\n\nThat didn't work, and Strong ended up going back to work on the Chrysler production line, giving up his singing career. But that won't be the last we'll see of him -- he'll be back with a new job in a few years' time.\n\nBut in late 1959, they didn't know yet that \"Money\" would even be a hit, let alone a classic that would be remembered more than sixty years later. Indeed, the biggest success that had come out of the Gordy operation was still Marv Johnson, and while he was signed to United Artists, he was still making records with Berry Gordy. Gordy was writing and producing his records, and now they were also being recorded at Gordy's home -- he and Raynoma had bought a house with a recording studio in the back in August 1959. They named the house Hitsville USA, and it became the headquarters for the Gordy family of labels. Berry and Raynoma lived in a flat upstairs, while the recording studio downstairs was open twenty-two hours a day. Eventually they would buy all the other nearby houses, and turn them into offices for their recording, publishing, and management empire.\n\nThe whole family pitched in to make the company a success. Berry's sister Esther took over the finances of Tamla, with the assistance of her accountant husband. Their other sister Loucye took charge of the record manufacturing side of the business -- liaising with pressing plants, overseeing cover art, and so on. Raynoma managed Jobete, the publishing company named after Berry's first three children, Joy, Berry, and Terry.\n\nThe Hitsville studio was primitive at first -- the echo chamber was also the toilet, and someone had to stand guard outside it while they were recording to make sure no-one used it during a session -- but it was good enough for Gordy to use it to make hit records for Marv Johnson, like \"You Got What It Takes\":\n\n[Excerpt: Marv Johnson, \"You Got What It Takes\"]\n\nThat went top ten on both the pop and R&B charts, as did the follow-up, \"I Love The Way You Love\":\n\n[Excerpt: Marv Johnson, \"I Love the Way You Love\"]\n\nBut those hits were on someone else's label. Berry Gordy was still looking to expand his own record business, and so he decided he was going to start a second label, to go along with Tamla. Smokey Robinson had still not had a hit, though he was writing a lot of material, but then Smokey brought Berry a song he thought was a guaranteed hit, \"Bad Girl\":\n\n[Excerpt: The Miracles, \"Bad Girl\"]\n\nGordy decided that he was going to start up a new label just for groups, while Tamla would be for solo artists, and \"Bad Girl\" was going to be the first release on it.\n\nBut once again, he didn't have a proper national distributor for his record, so after it started selling around Detroit, he licensed the record to Chess Records, who reissued it. \"Bad Girl\" went to number ninety-three on the Hot One Hundred, proving that Smokey Robinson did indeed have the potential to make a real hit.\n\nBut, as was so often the way, Chess didn't pay Gordy's company the proper royalties for the record, and so Gordy decided that his new label was going to have to have national distribution. He wasn't going to let any more of its records come out on Chess or United Artists. From now on, either they were on Tamla, or they were coming out on the new label, Motown.",
  "itunes:subtitle": "Episode eighty of A History of Rock Music in Five Hundred Songs looks at Money by Barrett Strong, the dispute over its authorship, and the start of a record label that would change music. Click the full post to read liner notes, links to more information",
  "itunes:keywords": "Anna Gordy,Anna Records,Barrett Strong,Berry Gordy,Chess Records,End Records,Etta James,George Goldner,Gwen Gordy,Harvey Fuqua,Holland-Dozier-Holland,Jackie Wilson,Janie Bradford,Marv Johnson,Marvin Gaye,Morris Levy,Motown,Raynoma Gordy,Robert Bateman,Roquel Davis,Smokey Robinson,Tamla,The Funk Brothers,The Miracles",
  "itunes:episodeType": "full",
  "itunes:episode": 80,
  "content:encoded": "Episode eighty of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Money\" by Barrett Strong, the dispute over its authorship, and the start of a record label that would change music. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/36466350\">on \"Alley Oop\" by the Hollywood Argyles.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Errata</strong>\n\nI say “His name didn't appear on the label of the record.” I mean here that Strong's name didn't appear on the label as a songwriter. It obviously did appear as the performer.\n\nMore significantly, I appear to have got the date when \"Money\" charted wrong -- see the comment thread.\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-80-money/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nYou might want to listen again to t<a href=\"https://www.500songs.com/e/episode-sixty-four-reet-petite-by-jackie-wilson/\">he episode on Jackie Wilson,</a> in which we looked at Berry Gordy's career to this point.\n\nI used six principal sources to put together the narrative for this one, most of which I will be using for most future Motown episodes.\n\n<a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em> by Nelson George</a> is an excellent popular history of the various companies that became Motown.\n\n<a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em> by Berry Gordy</a> is Gordy's own, understandably one-sided, but relatively well-written, autobiography.\n\n<a href=\"https://amzn.to/2VIpXII\"><em>Women of Motown: An Oral History</em> by Susan Whitall</a> is a collection of interviews with women involved in Motown, including Janie Bradford.\n\n<a href=\"https://amzn.to/2xVdvfD\"><em>I Hear a Symphony: Motown and Crossover R&B </em>by J. Andrew Flory</a> is an academic look at Motown.\n\n<a href=\"https://amzn.to/2VLquJX\"><em>The Motown Encyclopaedia</em> by Graham Betts</a> is an exhaustive look at the people and records involved in Motown's thirty-year history.\n\nAnd <a href=\"https://motownjunkies.co.uk/\">Motown Junkies</a> is an infrequently-updated blog looking at (so far) the first 693 tracks released on Motown singles.\n\nThere is a Complete Motown Singles 1959-62 box available from Hip-O-Select with comprehensive liner notes, but if you just want the music, I recommend instead <a href=\"https://amzn.to/2YbX0qa\">this much cheaper bare-bones box</a> from Real Gone Music.\n\nAnd <a href=\"https://amzn.to/35gQ9Nx\">this set</a> contains every recording that Barrett Strong made for Tamla as a performer.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nToday, we're going to look at a record which was the first success for one of the most important record labels of all time, which has one of the most instantly recognisable riffs of any record ever, and which was the product of a one-hit wonder who would, several years later, go on to be a hugely important figure as a writer, rather than a performer. Along the way we're going to look at the beginnings of many, many, other careers we'll be seeing more of in the next couple of years. Today, we're going to look at \"Money\" by Barrett Strong:\n\n[Excerpt: Barrett Strong, \"Money\"]\n\nWhen we left Berry Gordy Jr, he had just stopped writing songs for Jackie Wilson -- while the songs he'd co-written with his sister Gwen and her boyfriend Roquel Davis had been massive hits for Wilson, Wilson's manager had believed that any songwriters could bring the same amount of success, and that Wilson's records were selling solely because of Wilson's performances.\n\nDavis and Gwen had started up a new record label with the help of another Gordy sister, Anna, after whom they named the label. But at the start, Berry Gordy had little involvement in that label. While Gwen had wanted Berry to become a partner in the business, Berry had soured on the idea of business partners after some of his other ventures had failed due to conflicts between him and his partners. Berry was going to work for himself. He would write and produce for his family's record labels, but he wasn't going to be a partner in their businesses.\n\nInstead, he focussed on a group he'd got to know. The Matadors were a vocal group he'd seen audition, and been mildly impressed with, but he had decided to work with them mostly because he was very attracted to one of their singers, Claudette Rogers. He'd worked with them for a few days before asking Claudette out, and she'd turned him down because she was seeing one of the other group members, William Robinson. But by that point Gordy had got to know Robinson, and to appreciate his talent, and his response was just to tell her how lucky she was to have a man like that.\n\nHe took them on as a management project, and also decided to teach Robinson songwriting -- Robinson had written a lot of songs, which showed potential, but Gordy thought none of them were quite there yet. What impressed Gordy most was Robinson's attitude, every time Gordy told him what was wrong with a song -- Robinson would just go on to the next song, as enthusiastic as ever.\n\nEventually, Robinson came up with a song that they thought could be a hit. At the time, the Silhouettes had a big hit with a song called \"Get a Job\":\n\n[Excerpt: The Silhouettes, \"Get a Job\"]\n\nRobinson had come up with an answer song, which he called \"Got a Job\". Gordy decided that that was good enough for him to produce a recording -- he'd recently started up a production company, which he primarily used to produce demos of his own songs, with singers like Eddie Holland.\n\nGordy took the group into the studio, and got a deal with George Goldner's label End Records to distribute the single that resulted. The only thing was, Gordy still wasn't happy with the group's name -- The Matadors sounded too masculine for a group which had a woman in it. So they all chose other names, wrote them down, stuck them in a hat, and the one that came out was \"the Miracles\"; and so \"Got a Job\" by the Miracles came out on End Records on William “Smokey” Robinson's eighteenth birthday:\n\n[Excerpt: The Miracles, \"Got a Job\"]\n\nGordy at this point was a songwriter first and foremost, but he wanted to make sure he was making money from the songs. He had already started his own publishing company, after having not been paid the royalties he was owed on several of his songs. He'd decided that he could use his production company to ensure his songs got a release -- he'd lease the recordings out to other labels, like End, or his sister's label Anna. The recordings themselves were just a way to get some money from the songs, which were his real business.\n\nHe and his second wife Raynoma also used their production company, named Rayber as a portmanteau of their two names, in another way -- they would, for a fee, provide a full professional recording of anyone -- you could walk in and pay for an arrangement of your song by Berry Gordy, instrumental backing, vocals by the Rayber Singers (a fluid group of people that included Raynoma and Eddie Holland), and a copy of the record. If the amateur singer who came in was any good, the results would be quite listenable, as in \"I Can't Concentrate\" by Wade Jones, which they liked so much they later even released it properly:\n\n[Excerpt: \"I Can't Concentrate\", Wade Jones]\n\nBut at this point, Gordy still wasn't making much money at all. In 1959, according to court papers around a claim for child support for his kids, he made $27.70 a week on average -- and almost all of that came from a single one-thousand-dollar cheque for writing \"Lonely Teardrops\" for Jackie Wilson. And producing the Miracles didn't add much to that -- when Gordy received his first royalty cheque from End Records for \"Got a Job\", he was astonished to see that it was only for $3.19.\n\nTo add insult to injury, End Records tried to claim that the Miracles were now their artists, and they were going to record them directly, without the involvement of Gordy. This was a thing that many businesses connected with Morris Levy did, and they were usually successful, because if you get into an argument with the Mafia you'll probably not win. But in the case of Gordy, his family were so well-known and respected in Detroit's black community, and Gordy himself had enough cachet because of his work with Jackie Wilson, that a contingent of black DJs told End Records that they'd stop playing any of their records unless they backed off on the Miracles.\n\nBut all this led Gordy to one conclusion -- one he didn't come to until Smokey Robinson pointed it out to him. He needed to start his own record label, just like his sisters had. The problem was that he had no money, and while his family was, for a black family at the time, very rich, they held their money in a trust and required a proper contract and unanimous approval from all eight siblings before they would provide one of the family with a business loan -- and Berry was regarded by his siblings as a useless drifter and underachiever.\n\nBut eventually he managed to win them round, and they lent him $800. His original idea for the name of the label was \"Tammy\", after Debbie Reynolds' hit, to show that they weren't just aiming at the R&B market:\n\n[Excerpt: Debbie Reynolds, \"Tammy\"]\n\nHowever, it turned out that there was another label called Tammy, and so Gordy decided on Tamla instead.\n\nTamla's first record was by a local singer called Marv Johnson, who had a very similar voice to that of Jackie Wilson, but who was known for having more of an ego than Wilson. There's an anonymous quote by someone who knew both men -- \"The difference between Marv and Jackie Wilson was that Wilson would kiss all the women, especially the ugly ones, because he knew if he did they'd be with him forever. Marv only kissed the pretty ones, and that coldness came through in everything he did.\"\n\nOne can argue about whether it's colder to cynically manipulate people's feelings or to show contempt for them, but it's definitely the case that Marv Johnson does not seem to have been well loved by many of the people who knew him.\n\nJohnson had recorded one previous single, \"My Baby-O\", on another record label:\n\n[Excerpt: Marv Johnson, \"My Baby-O\"]\n\nSome sources claim that Berry Gordy produced that track -- others that he was just present at the session, watching.\n\nWhatever Gordy's involvement with Johnson before signing him to Tamla, the first Tamla single, \"Come to Me\", was the start of something big. It was written by Johnson and Gordy, and featured a group of session players who would form the core of what would become known as the Funk Brothers -- James Jamerson, Benny Benjamin, Eddie Willis, Joe Messina, and Thomas “Beans” Bowles. On top of that, Brian Holland, who with his brother Eddie would later go on to become part of arguably the most important songwriting and production team of the sixties, was on backing vocals:\n\n[Excerpt: Marv Johnson, \"Come to Me\"]\n\nJohnson wrote that song himself, and Gordy polished it up, giving himself a co-writing credit.\n\nAt the start, Tamla was a very, very small operation. Other than the musicians they employed, the team mostly consisted of Berry and Raynoma Gordy, Smokey Robinson acting essentially as Berry's apprentice and assistant, and Janie Bradford, a teenage songwriter with whom Gordy had collaborated on a couple of songs for Jackie Wilson:\n\n[Excerpt: Jackie Wilson, \"The Joke (Is Not On Me)\"]\n\nBradford was given the official job title of receptionist, but she actually did almost all the admin at the label offices, doing everything from sorting out the contracts to mopping the floor, along with chipping in with songs when she had an idea.\n\nBecause they were a shoestring operation, Gordy, Marv Johnson, and Robinson would do most of the legwork of getting the track to radio stations, and it only got local distribution. They followed up with a second Tamla record, three weeks later, written by Berry and sung by Eddie Holland, who had sung on Berry's demos for Jackie Wilson and also had a Wilson-esque voice:\n\n[Excerpt: Eddie Holland, \"Merry Go Round\"]\n\nMarv Johnson's record, \"Come to Me\", became a local hit, but as we've talked about before, when you're running an indie label the last thing you want is a hit -- you have to pay to get the records pressed, but then you have to wait months for the money to come in from the distributors. Becoming too big too fast could be a problem.\n\nLuckily, before the record got too big, United Artists stepped in. They wanted to buy the master for \"Come to Me\", and to buy both Johnson and Holland's contracts from Gordy. Gordy would continue writing and producing for them, but they would be United Artists performers rather than on Tamla. Gordy got enough money from that deal to continue running his label for a while longer, and United Artists got their first R&B star -- \"Come to Me\" ended up going top thirty on the pop charts and top ten on the R&B charts. Not bad at all for something put out on a little micro-label.\n\nEddie Holland, on the other hand, didn't do so well on United Artists -- he wasn't ever a confident performer, and after two years he was back with Gordy's operation, this time working behind the scenes rather than as the main performer.\n\nSo Tamla was ready to put out its third single, and Gordy may have had a plan for how his label was going to get much bigger. It's been suggested by several people that a few of the early acts he signed were intended as ways to get more famous relatives of those acts interested in the label. For example, the first female solo singer he signed to the label, Mable John, was the sister of Little Willie John, the R&B star. Mable was certainly good enough to be hired on her own merits, but at the same time the thought must have crossed Gordy's mind that it would be good to get her brother recording for him.\n\nIn the same way, Smokey Robinson's favourite local group was Nolan Strong and the Diablos, who recorded the doo-wop classic \"The Wind\":\n\n[Excerpt: Nolan Strong and the Diablos, \"The Wind\"]\n\nNolan Strong's cousin Barrett was also an aspiring singer, and Gordy signed him to Tamla, and wrote him a song with his sister Gwen and her then-boyfriend Roquel Davis, the same team with whom he'd collaborated on Jackie Wilson's hits:\n\n[Excerpt: Barrett Strong, \"Let's Rock\"]\n\nUnfortunately, \"Let's Rock\" wasn't a hit, and Gordy seemed to decide to try to throw a lot of records at the wall to see what would stick. Over the next few months, they put out a variety of odd singles, none of which charted, and none of which seem much like the music Gordy was generally known for. There was \"Snake Walk\", a jazz instrumental played by the Funk Brothers under the name The Swinging Tigers, with the songwriting credited to Gordy and Robinson:\n\n[Excerpt: The Swinging Tigers, \"Snake Walk (part 1)\"]\n\nThere was \"It\", a novelty single about an alien, performed by Smokey Robinson and Ronnie White of the Miracles, under the name \"Ron & Bill\":\n\n[Excerpt: Ron & Bill, \"It\"]\n\nAnd a few more. But it wasn't until Barett Strong's second single, in August 1959, that Tamla hit the jackpot again.\n\nThere are three very different stories about how \"Money\" was written. According to Berry Gordy, he came up with the music and the whole first verse and chorus himself, and played it to Janie Bradford, who suggested a couple of lines for the second verse, but he was impressed enough with her lines that he gave her fifty percent of the song, even though she didn't think she'd contributed very much. Barrett Strong came and sat down with them, uninvited, and started singing along, but didn't contribute anything to the writing of the song.\n\nAccording to Janie Bradford, Berry Gordy was playing the riff on the piano, but had no words or melody yet. He said to her, \"I need a title, give me a title, something that everybody wants,\" and she replied \"Money, that's what I want!\" and the two of them wrote the lyrics together based on her lyrical idea.\n\nAnd according to Barrett Strong, who is backed up by the engineer and the guitarist on the session, *Strong* -- who played the piano on the session as well as singing -- was jamming the riff, having hit upon it while messing around with Ray Charles' \"What'd I Say\". Gordy only came into the session after Strong had already taught the instrumental parts to the musicians, and Gordy and Bradford only wrote the lyrics after the instrumental track was already completed.\n\nThe initial filing of the song's copyright credited Strong for words and music, Gordy for words and music, and Bradford only for words. According to both Bradford and Gordy, that's because Bradford, who filled out the form, didn't understand the form and made a mistake. Three years later, Strong's name was taken off the copyright, and he wasn't informed of the change. His name didn't appear on the label of the record.\n\nPersonally, I tend to believe Strong. The song simply doesn't sound that much like Gordy's other songs of the period, which were based far less on riffs, and which didn't tend to be twelve-bar blueses.\n\nWhoever wrote it, the result was a great record, and the first true classic to come out of the Gordy operation:\n\n[Excerpt: Barrett Strong, \"Money\"]\n\nThe B-side isn't quite as good, but it's still a strong ballad, and if you're a fan of John Lennon's solo work you might find the middle eight very familiar:\n\n[Excerpt: Barrett Strong, \"Oh I Apologize\"]\n\n\"Money\" came out on Tamla and was initially fairly unsuccessful, because Tamla didn't have any national distribution. But Anna Records did.\n\nThat label had partnered with Chess Records. Chess had sent Harvey Fuqua, who was working for Chess as an executive as well as a performer, over to work with Anna Records. Fuqua had brought with him another member of his latest lineup of the Moonglows, a young man named Marvin Gay, to work for Anna as a session drummer and part-time janitor, and Marvin soon got into a relationship with Anna Gordy.\n\nBut Marvin wasn't the only one to get into a relationship with a Gordy sister. Harvey Fuqua had been dating Etta James, with whom he was having a few hits as a duet act on Chess:\n\n[Excerpt: Etta James and Harvey Fuqua, \"Spoonful\"]\n\nBut he soon struck up a relationship with Gwen Gordy. He split up with James, Gwen Gordy split up with Roquel Davis -- and then Berry and Gwen Gordy and Roquel Davis wrote a song about the splits, which Etta James performed for Chess, back as a solo artist again:\n\n[Excerpt: Etta James, \"All I Could Do Was Cry\"]\n\nThat became a hit in June 1960, and that was also the month that \"Money\" finally became a hit, nearly a year after it was released. The Tamla record had been a local hit, but Tamla still didn't have any national distribution, so Berry Gordy leased the recording to his sisters' label. It was rereleased on Anna Records, distributed through Chess, and became the first national hit for one of the Gordy family of labels, reaching number two on the R&B charts and number twenty-three on the pop charts. The Gordy family of labels was starting to have some real success:\n\n[Excerpt: Barrett Strong, \"Money\"]\n\nUnfortunately, that would be Barrett Strong's only hit as a performer. Over the next eighteen months he would release a whole variety of singles, none of which had any success, eventually trying the desperate tactic of recording a follow-up to \"Money\", titled \"Money and Me\", with the writing credited to Berry Gordy, Janie Bradford, Smokey Robinson, and Robert Bateman -- a singer who was one of the Rayber singers:\n\n[Excerpt: Barrett Strong, \"Money and Me\"]\n\nThat didn't work, and Strong ended up going back to work on the Chrysler production line, giving up his singing career. But that won't be the last we'll see of him -- he'll be back with a new job in a few years' time.\n\nBut in late 1959, they didn't know yet that \"Money\" would even be a hit, let alone a classic that would be remembered more than sixty years later. Indeed, the biggest success that had come out of the Gordy operation was still Marv Johnson, and while he was signed to United Artists, he was still making records with Berry Gordy. Gordy was writing and producing his records, and now they were also being recorded at Gordy's home -- he and Raynoma had bought a house with a recording studio in the back in August 1959. They named the house Hitsville USA, and it became the headquarters for the Gordy family of labels. Berry and Raynoma lived in a flat upstairs, while the recording studio downstairs was open twenty-two hours a day. Eventually they would buy all the other nearby houses, and turn them into offices for their recording, publishing, and management empire.\n\nThe whole family pitched in to make the company a success. Berry's sister Esther took over the finances of Tamla, with the assistance of her accountant husband. Their other sister Loucye took charge of the record manufacturing side of the business -- liaising with pressing plants, overseeing cover art, and so on. Raynoma managed Jobete, the publishing company named after Berry's first three children, Joy, Berry, and Terry.\n\nThe Hitsville studio was primitive at first -- the echo chamber was also the toilet, and someone had to stand guard outside it while they were recording to make sure no-one used it during a session -- but it was good enough for Gordy to use it to make hit records for Marv Johnson, like \"You Got What It Takes\":\n\n[Excerpt: Marv Johnson, \"You Got What It Takes\"]\n\nThat went top ten on both the pop and R&B charts, as did the follow-up, \"I Love The Way You Love\":\n\n[Excerpt: Marv Johnson, \"I Love the Way You Love\"]\n\nBut those hits were on someone else's label. Berry Gordy was still looking to expand his own record business, and so he decided he was going to start a second label, to go along with Tamla. Smokey Robinson had still not had a hit, though he was writing a lot of material, but then Smokey brought Berry a song he thought was a guaranteed hit, \"Bad Girl\":\n\n[Excerpt: The Miracles, \"Bad Girl\"]\n\nGordy decided that he was going to start up a new label just for groups, while Tamla would be for solo artists, and \"Bad Girl\" was going to be the first release on it.\n\nBut once again, he didn't have a proper national distributor for his record, so after it started selling around Detroit, he licensed the record to Chess Records, who reissued it. \"Bad Girl\" went to number ninety-three on the Hot One Hundred, proving that Smokey Robinson did indeed have the potential to make a real hit.\n\nBut, as was so often the way, Chess didn't pay Gordy's company the proper royalties for the record, and so Gordy decided that his new label was going to have to have national distribution. He wasn't going to let any more of its records come out on Chess or United Artists. From now on, either they were on Tamla, or they were coming out on the new label, Motown.",
  "enclosure": "",
  "itunes:summary": "Episode eighty of A History of Rock Music in Five Hundred Songs looks at \"Money\" by Barrett Strong, the dispute over its authorship, and the start of a record label that would change music. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Alley Oop\" by the Hollywood Argyles.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nErrata\n\nI say “His name didn't appear on the label of the record.” I mean here that Strong's name didn't appear on the label as a songwriter. It obviously did appear as the performer.\n\nMore significantly, I appear to have got the date when \"Money\" charted wrong -- see the comment thread.\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nYou might want to listen again to the episode on Jackie Wilson, in which we looked at Berry Gordy's career to this point.\n\nI used six principal sources to put together the narrative for this one, most of which I will be using for most future Motown episodes.\n\nWhere Did Our Love Go? The Rise and Fall of the Motown Sound by Nelson George is an excellent popular history of the various companies that became Motown.\n\nTo Be Loved by Berry Gordy is Gordy's own, understandably one-sided, but relatively well-written, autobiography.\n\nWomen of Motown: An Oral History by Susan Whitall is a collection of interviews with women involved in Motown, including Janie Bradford.\n\nI Hear a Symphony: Motown and Crossover R&B by J. Andrew Flory is an academic look at Motown.\n\nThe Motown Encyclopaedia by Graham Betts is an exhaustive look at the people and records involved in Motown's thirty-year history.\n\nAnd Motown Junkies is an infrequently-updated blog looking at (so far) the first 693 tracks released on Motown singles.\n\nThere is a Complete Motown Singles 1959-62 box available from Hip-O-Select with comprehensive liner notes, but if you just want the music, I recommend instead this much cheaper bare-bones box from Real Gone Music.\n\nAnd this set contains every recording that Barrett Strong made for Tamla as a performer.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nToday, we're going to look at a record which was the first success for one of the most important record labels of all time, which has one of the most instantly recognisable riffs of any record ever, and which was the product of a one-hit wonder who would, several years later, go on to be a hugely important figure as a writer, rather than a performer. Along the way we're going to look at the beginnings of many, many, other careers we'll be seeing more of in the next couple of years. Today, we're going to look at \"Money\" by Barrett Strong:\n\n[Excerpt: Barrett Strong, \"Money\"]\n\nWhen we left Berry Gordy Jr, he had just stopped writing songs for Jackie Wilson -- while the songs he'd co-written with his sister Gwen and her boyfriend Roquel Davis had been massive hits for Wilson, Wilson's manager had believed that any songwriters could bring the same amount of success, and that Wilson's records were selling solely because of Wilson's performances.\n\nDavis and Gwen had started up a new record label with the help of another Gordy sister, Anna, after whom they named the label. But at the start, Berry Gordy had little involvement in that label. While Gwen had wanted Berry to become a partner in the business, Berry had soured on the idea of business partners after some of his other ventures had failed due to conflicts between him and his partners. Berry was going to work for himself. He would write and produce for his family's record labels, but he wasn't going to be a partner in their businesses.\n\nInstead, he focusse",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode eighty of A History of Rock Music in Five Hundred Songs looks at \"Money\" by Barrett Strong, the dispute over its authorship, and the start of a record label that would change music. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Alley Oop\" by the Hollywood Argyles.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nErrata\n\nI say “His name didn't appear on the label of the record.” I mean here that Strong's name didn't appear on the label as a songwriter. It obviously did appear as the performer.\n\nMore significantly, I appear to have got the date when \"Money\" charted wrong -- see the comment thread.\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of a",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}