{
  "title": "Tesla’s Autopilot Depends on a Deluge of Data",
  "link": "https://spectrum.ieee.org/tesla-autopilot-data-deluge",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/close-up-of-the-autopilot-screen-in-a-tesla.jpg?id=30541921&width=1200&height=800&coordinates=0%2C162%2C0%2C162\"/><br/><br/><p>In 2019, Elon Musk stood up at a Tesla day devoted to automated driving and <a href=\"https://youtu.be/-b041NXGPZ8?t=3833\" rel=\"noopener noreferrer\" target=\"_blank\">said</a>, “Essentially everyone’s training the network all the time, is what it amounts to. Whether Autopilot’s on or off, the network is being trained.”</p><p>Tesla’s suite of assistive and semi-autonomous technologies, collectively known as <a href=\"https://www.tesla.com/autopilot\" rel=\"noopener noreferrer\" target=\"_blank\">Autopilot</a>, is among the most widely deployed—and undeniably the most controversial—driver-assistance systems on the road today. While many drivers love it, using it for a combined total of more than 5 billion kilometers, the technology has been <a href=\"https://www.consumerreports.org/car-safety/nhtsa-expands-tesla-autopilot-investigation-a7977631326/\" rel=\"noopener noreferrer\" target=\"_blank\">involved in hundreds of crashes</a>, some of them fatal, and is currently the subject of a <a href=\"https://www.nytimes.com/2022/06/09/business/tesla-autopilot-nhtsa-investigation.html\" rel=\"noopener noreferrer\" target=\"_blank\">comprehensive investigation</a> by the National Highway Traffic Safety Administration.</p><p>This second story—in <em>IEEE Spectrum</em>’s series of three on Tesla’s empire of data (<a href=\"https://spectrum.ieee.org/tesla-autopilot-data-scope\" target=\"_blank\">story 1</a>; <a href=\"https://spectrum.ieee.org/tesla-autopilot-data-ownership\" target=\"_blank\">story 3</a>)—focuses on how Autopilot rests on a foundation of data harvested from the company’s own customers. Although the company’s approach has unparalleled scope and includes impressive technological innovations, it also faces particular challenges—not least of which is Musk’s decision to widely deploy the misleadingly named Full Self-Driving feature as a largely untested beta.</p><p class=\"pull-quote\">“Right now, automated vehicles are one to two magnitudes below human drivers in terms of safety performance.”<br/>—Henry Liu, Mcity</p><p>Most companies working on automated driving rely on a small fleet of highly instrumented test vehicles, festooned with high-resolution cameras, radars, and laser-ranging lidar devices. Some of these have been estimated to generate <a href=\"https://www.linkedin.com/pulse/20130502024505-9947747-google-s-self-driving-car-gathers-nearly-1-gb-per-second/\" rel=\"noopener noreferrer\" target=\"_blank\">750 megabytes of sensor data every second</a>, providing a rich seam of training data for neural networks and other machine-learning systems to improve their driving skills.</p><p>Such systems have now effectively solved the task of everyday driving, including for a multitude of road users, different weather conditions, and road types, says Henry Liu, director of <a href=\"https://mcity.umich.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Mcity</a>, a public-private mobility research partnership at the University of Michigan.</p><p>“But right now, automated vehicles are one to two magnitudes below human drivers in terms of safety performance,” says Liu. “And that’s because current automated vehicles can’t handle the curse of rarity: low-frequency, long-tail, safety-critical events that they just don’t see enough to know how to handle.” Think of a deer suddenly springing into the road, or a slick of spilled fuel.</p><p>Tesla’s bold bet is that its own customers can provide the long tail of data needed to boost self-driving cars to superhuman levels of safety. Above and beyond their contractual obligations, many are happy to do so—seeing themselves as willing participants in the development of technology that they have been told will one day soon allow them to simply sit back and enjoy being driven by the car itself. </p><p>For a start, the routing information for every trip undertaken in a recent model Autopilot-equipped Tesla is shared with the company—see the the <a href=\"https://spectrum.ieee.org/tesla-autopilot-data-scope\" target=\"_blank\"><sub></sub>previous installment</a> in this series. But Tesla’s data effort goes far beyond navigation.</p><p>In <a href=\"https://www.youtube.com/watch?v=-b041NXGPZ8\" rel=\"noopener noreferrer\" target=\"_blank\">autonomy</a> <a href=\"https://www.youtube.com/watch?v=hx7BXih7zx8\" rel=\"noopener noreferrer\" target=\"_blank\">presentations</a> over the past few years, Musk and Tesla’s then-head of AI, Andrej Karpathy, detailed the company’s approach, including its so-called Shadow Mode. </p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"The back of a Tesla Model S seen in shadow\" class=\"rm-shortcode\" data-rm-shortcode-id=\"58e06c7ad0310c7ac6836e750ed804d5\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"58151\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/the-back-of-a-tesla-model-s-seen-in-shadow.jpg?id=30542032&width=980\"/>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\"><a href=\"https://unsplash.com/photos/cqvRn7TKdlg\" target=\"_blank\">Philipp Mandler/Unsplash</a></small></p><p>In Shadow Mode, operating on Tesla vehicles since 2016, if the car’s Autopilot computer is not controlling the car, it is simulating the driving process in parallel with the human driver. When its own predictions do not match the driver’s behavior, this might trigger the recording of a short <a href=\"https://spectrum.ieee.org/tesla-autopilot-data-scope\" target=\"_self\">“snapshot”</a> of the car’s cameras, speed, acceleration, and other parameters for later uploading to Tesla. Snapshots are also triggered when a Tesla crashes.</p><p>After the snapshots are uploaded, a team may review them to identify human actions that the system should try to imitate, and input them as training data for its neural networks. Or they may notice that the system is failing, for instance, to properly identify road signs obscured by trees.</p><p>In that case, engineers can train a detector designed specifically for this scenario and download it to some or all Tesla vehicles. “We can beam it down to the fleet, and we can ask the fleet to please apply this detector on top of everything else you’re doing,” <a href=\"https://youtu.be/hx7BXih7zx8?t=717\" rel=\"noopener noreferrer\" target=\"_blank\">said Karpathy</a> in 2020. If that detector thinks it spots such a road sign, it will capture images from the car’s cameras for later uploading,</p><p>His team would quickly receive thousands of images, which they would use to iterate the detector, and eventually roll it out to all production vehicles. “I’m not exactly sure how you build out a data set like this without the fleet,” said Karpathy. An amateur Tesla hacker who tweets using the pseudonym <a href=\"https://twitter.com/greentheonly?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" rel=\"noopener noreferrer\" target=\"_blank\">Green</a> told <em>Spectrum</em> that he identified over 900 Autopilot test campaigns, before the company stopped numbering them in 2019.</p><p class=\"pull-quote\">For all the promise of Tesla’s fleet learning, Autopilot has yet to prove that it can drive as safely as a human, let alone be trusted to operate a vehicle without supervision. </p><p>Liu is bullish on Tesla’s approach to leveraging its ever-growing consumer base. “I don’t think a small…fleet will ever be able to handle these [rare] situations,” he says. “But even with these shadow drivers—and if you deploy millions of these fleet vehicles, that’s a very, very large data collection—I don’t know whether Tesla is fully utilizing them because there’s no public information really available.”</p><p>One obstacle is the sheer cost. Karpathy admitted that having a large team to assess and label images and video was expensive and said that Tesla was working on detectors that can train themselves on video clips captured in Autopilot snapshots. In June, the company duly <a href=\"https://techcrunch.com/2022/06/28/tesla-layoffs-autopilot-workers-san-mateo/\" rel=\"noopener noreferrer\" target=\"_blank\">laid off 195 people working on data annotation</a> at a Bay Area office.</p><p>While the Autopilot does seem to have improved over the years, with Tesla allowing its operation on more roads and in more situations, <a href=\"https://www.theverge.com/2022/7/7/23198997/tesla-fatal-crashes-california-florida-autopilot-nhtsa\" rel=\"noopener noreferrer\" target=\"_blank\">serious and fatal accidents</a> are still occurring. These may or may not have purely technical causes. Certainly, some drivers seem to be overestimating the system’s capabilities or are either accidentally or deliberately failing to supervise it sufficiently.</p><p>Other experts are worried that Tesla’s approach has more fundamental flaws. “The vast majority of the world generally believes that you’re never going to get the same level of safety with a camera-only system that you will based on a system that includes lidar,” says Dr. Matthew Weed, senior director of product management at <a href=\"https://www.luminartech.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Luminar</a>, a company that manufacturers advanced lidar systems.</p><p>He points out that Tesla’s Shadow Mode only captures a small fraction of each car’s driving time. “When it comes to safety, the whole thing is about…your unknown unknowns,” he says. “What are the things that I don’t even know about that will cause my system to fail? Those are really difficult to ascertain in a bulk fleet” that is down-selecting data.</p><p>For all the promise of Tesla’s fleet learning and the enthusiastic support of many of its customers, Autopilot has yet to prove that it can drive as safely as a human, let alone be trusted to operate a vehicle without supervision. And there are other difficulties looming. Andrej Karpathy <a href=\"https://www.cnbc.com/2022/07/13/tesla-ai-leader-andrej-karpathy-announces-hes-leaving-the-company.html\" target=\"_blank\">left Tesla in mid-July</a>, while the company continues to face the damaging possibility of NHTSA issuing a recall for Autopilot in the United States. This would be a terrible PR (and possibly economic) blow for the company but would likely not halt its harvesting of customer data to improve the system, nor prevent its continued deployment overseas.</p><p>Tesla’s use of fleet vehicle data to develop Autopilot echoes the user-fueled rise of Internet giants like Google, YouTube, and Facebook. The more its customers drive, so Musk’s story goes, the better the system performs.</p><p>But just as tech companies have had to come to terms with their complicated relationships with data, so Tesla is beginning to see a backlash. Why does the company charge US $12,000 for a so-called “full self-driving” capability that is utterly reliant on its customers’ data? How much control do drivers have over data extracted from their daily journeys? And what happens when other entities, from companies to the government, seek access to it? These are the themes for our third story.</p><p><em>This article appears in the October 2022 print issue as “The Radical Scope of Tesla’s Data Hoard.”</em></p>",
  "pubDate": "Thu, 04 Aug 2022 20:28:53 +0000",
  "guid": "https://spectrum.ieee.org/tesla-autopilot-data-deluge",
  "category": [
    "Tesla motors",
    "Autopilot",
    "Big data"
  ],
  "dc:creator": "Mark Harris",
  "media:content": ""
}