{
  "title": "What does Stack Overflow want to be when it grows up?",
  "description": "<!--kg-card-begin: markdown--><p>I sometimes get asked by regular people in the actual real world what it is that I do for a living, and here's my 15 second answer:</p>\n<blockquote>\n<p>We built a sort of Wikipedia website for computer programmers to post questions and answers. It's called <a href=\"https://stackoverflow.com\">Stack Overflow</a></p></blockquote>",
  "link": "https://blog.codinghorror.com/what-does-stack-overflow-want-to-be-when-it-grows-up/",
  "guid": "5bcd65fc65068a00bfbc3cc1",
  "dc:creator": "Jeff Atwood",
  "pubDate": "Mon, 22 Oct 2018 10:52:32 GMT",
  "content:encoded": "<!--kg-card-begin: markdown--><p>I sometimes get asked by regular people in the actual real world what it is that I do for a living, and here's my 15 second answer:</p>\n<blockquote>\n<p>We built a sort of Wikipedia website for computer programmers to post questions and answers. It's called <a href=\"https://stackoverflow.com\">Stack Overflow</a>.</p>\n</blockquote>\n<p>As of last month, it's been 10 years since Joel Spolsky and I <a href=\"https://blog.codinghorror.com/stack-overflow-none-of-us-is-as-dumb-as-all-of-us/\">started Stack Overflow</a>. I currently do <a href=\"https://blog.codinghorror.com/civilized-discourse-construction-kit/\">other stuff now</a>, and I have since 2012, but if I will be known for anything when I'm dead, clearly it is going to be good old Stack Overflow.</p>\n<p>Here's where I'd normally segue into a bunch of rah-rah stuff about how great Stack Overflow is, and thus how implicitly great I am by association for being a founder, and all.</p>\n<p><a href=\"http://www.poorlydrawnlines.com/comic/bragging/\"><img src=\"https://blog.codinghorror.com/content/images/2018/10/bragging.png\" alt=\"bragging\" loading=\"lazy\"></a></p>\n<p>I do not care about any of that.</p>\n<p>What I do care about, though, is <em>whether Stack Overflow is useful to working programmers</em>. Let's check in with <a href=\"https://blog.codinghorror.com/you-dont-need-millions-of-dollars/\">one of my idols</a>, John Carmack. How useful is Stack Overflow, from the perspective of what I consider to be one of the greatest living programmers?</p>\n<blockquote class=\"twitter-tweet\" data-conversation=\"none\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/StackExchange?ref_src=twsrc%5Etfw\">@StackExchange</a> <a href=\"https://twitter.com/codinghorror?ref_src=twsrc%5Etfw\">@codinghorror</a> SO has probably added billions of dollars of value to the world in increased programmer productivity.</p>&#x2014; John Carmack (@ID_AA_Carmack) <a href=\"https://twitter.com/ID_AA_Carmack/status/380018564792455168?ref_src=twsrc%5Etfw\">September 17, 2013</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>I won't lie, September 17th, 2013 was a <a href=\"https://www.youtube.com/watch?v=O_05qJTeNNI\">pretty good day</a>. I literally got chills when I read that, and not just because I always read the word \"billions\" in Carl Sagan's voice. It was also pleasantly the opposite of pretty much every <em>other</em> day I'm on Twitter, scrolling through an oppressive, endless litany of shared human suffering and people screaming at each other. Which reminds me, I should <a href=\"https://twitter.com/codinghorror\">check my Twitter</a> and see who else is wrong on the Internet today.</p>\n<p>I am honored and humbled by the public utility that Stack Overflow has unlocked for a whole generation of programmers. But <em>I didn't do that</em>.</p>\n<ul>\n<li><em>You</em> did, when you contributed a well researched question to Stack Overflow.</li>\n<li><em>You</em> did, when you contributed a succinct and clear answer to Stack Overflow.</li>\n<li><em>You</em> did, when you edited a question or answer on Stack Overflow to make it better.</li>\n</ul>\n<p>All those \"fun size\" units of Q&A collectively contributed by working programmers from all around the world ended up building a <a href=\"https://wiki.creativecommons.org/wiki/Case_Studies/StackOverflow.com\">Creative Commons resource</a> that truly rivals Wikipedia within our field. That's ... incredible, actually.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2018/10/stack-overflow-homepage-oct-2018.png\" alt=\"stack-overflow-homepage-oct-2018\" loading=\"lazy\"></p>\n<p>But success stories are boring. The world is filled with people that <a href=\"https://blogs.scientificamerican.com/beautiful-minds/the-role-of-luck-in-life-success-is-far-greater-than-we-realized/\">basically got lucky</a>, and subsequently can't stop telling people how it was all of their hard work and moxie that made it happen. I find failure much more instructive, and when building a business and planning for the future, I take on the role of Abyss Domain Expert&#x2122; and begin a staring contest. It's just a little something I like to do, you know ... <em>for me</em>.</p>\n<p><a href=\"https://www.reddit.com/r/comics/comments/8a4c2h/abyss_oc/\"><img src=\"https://blog.codinghorror.com/content/images/2018/10/abyss-oc.jpg\" alt=\"abyss-oc\" loading=\"lazy\"></a></p>\n<p>Thus, what I'd like to do right now is peer into that glorious abyss for a bit and introspect about <strong>the challenges I see facing Stack Overflow for the next 10 years.</strong> Before I begin, I do want to be absolutely crystal clear about a few things:</p>\n<ol>\n<li>\n<p>I have not worked at Stack Overflow in any capacity whatsoever <a href=\"https://blog.codinghorror.com/farewell-stack-exchange/\">since February 2012</a> and I've had zero day to day operational input since that date, more or less by choice. Do I have opinions about how things should be done? Uh, have you <em>met me?</em> Do I email people every now and then about said opinions? I might, but I honestly do try to keep it to an absolute minimum, and I think my email archive track record here is reasonable.</p>\n</li>\n<li>\n<p>The people working at Stack are amazing and most of them (including much of the Stack Overflow community, while I'm at it) could articulate the mission better &#x2014; and perhaps a tad less crankily &#x2014; than I could by the time I left. Would I trust them with my life? No. But I'd trust them with Joel's life!</p>\n</li>\n<li>\n<p>The whole point of the Stack Overflow exercise is that it's not beholden to me, or Joel, or <a href=\"https://en.wikipedia.org/wiki/Great_man_theory\">any other Great Person</a>. Stack Overflow works because it empowers regular everyday programmers all over the world, just like you, just like me. I guess in my mind it's akin to being a parent. The goal is for your children to eventually grow up to be sane, practicing adults who don't need (or, really, <em>want</em>) you to hang around any more.</p>\n</li>\n<li>\n<p>Understand that you're reading <s>the weak opinions strongly held</s> <a href=\"https://blog.codinghorror.com/strong-opinions-weakly-held/\">the strong opinions weakly held</a> of a co-founder who spent prodigious amounts of time working with the community in the first four years of Stack Overflow's life to shape the rules and norms of the site to fit their needs. These are merely my opinions. I like to think they are <em>informed</em> opinions, but that doesn't necessarily mean I can predict the future, or that I am even qualified to try. But I've never let being \"qualified\" stop me from doing anything, and I ain't about to start tonight.</p>\n</li>\n</ol>\n<h3 id=\"stackoverflowisawikifirst\">Stack Overflow is a wiki first</h3>\n<p>Stack Overflow ultimately has <em>much</em> more in common with Wikipedia than a discussion forum. By this I mean questions and answers on Stack Overflow are not primarily judged by their usefulness to a specific individual, but by <strong>how many <em>other</em> programmers that question or answer can potentially help over time</strong>. I tried as hard as I could to emphasize this relationship from <a href=\"https://blog.codinghorror.com/stack-overflow-none-of-us-is-as-dumb-as-all-of-us/\">launch day in 2008</a>. Note who has top billing in this venn diagram.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2018/10/stack-overflow-venn-diagram.png\" alt=\"stack-overflow-venn-diagram\" loading=\"lazy\"></p>\n<p>Stack Overflow later added a super neat feature to highlight this core value in user profiles, where it shows how many other people you have potentially helped with your contributed questions and answers so far.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2018/10/stackoverflow-people-reached-profile-stat-1.png\" alt=\"stackoverflow-people-reached-profile-stat-1\" loading=\"lazy\"></p>\n<p>The most common complaints I see about Stack Overflow are usually the result of this fundamental misunderstanding about who the questions and answers on the site are ultimately <em>for</em>, and why there's so much strictness involved in the whole process.</p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">I wish more people understood that the goal of Stack Overflow is not \"answer my question\" but \"let's collaboratively build an artifact that will benefit future coders\". Perhaps SO could be doing more to educate people about this.</p>&#x2014; Jeff Atwood (@codinghorror) <a href=\"https://twitter.com/codinghorror/status/991082088689381376?ref_src=twsrc%5Etfw\">April 30, 2018</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>I'm continually amazed at the number of people, even on Hacker News today, who don't realize that every single question and answer is editable on Stack Overflow, even as a completely anonymous user who isn't logged in. Which makes sense, right, <em>because Stack Overflow is a wiki</em>, and that's how wikis work. Anyone can edit them. Go ahead, try it right now if you don't believe me &#x2014; press the \"improve this answer\" or \"improve this question\" button on anything that can be improved, and make it so.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2018/10/stack-overflow-edit-question.png\" alt=\"stack-overflow-edit-question\" loading=\"lazy\"></p>\n<p>The responsibility for this misunderstanding is all on Stack Overflow (and by that I also mean myself, at least up until 2012). I guess the logic is that \"every programmer has surely seen, used, and understands Stack Overflow by now, 10 years in\" but ... I think that's a risky assumption. New programmers are minted every second of every day. Complicating matters further, there are three tiers of usage at Stack Overflow, from biggest to smallest, in inverted pyramid style:</p>\n<ol>\n<li>\n<p><strong>I passively search for programming answers.</strong></p>\n<p>Passively searching and reading highly ranked Stack Overflow answers as they appear in web search results is arguably the <em>primary goal of Stack Overflow</em>. If Stack Overflow is working like it's supposed to, 98% of programmers should get all the answers they need from reading search result pages and wouldn't need to ask or answer a single question in their entire careers. This is a good thing! Great, even!</p>\n</li>\n<li>\n<p><strong>I participate on Stack Overflow when I get stuck on a really hairy problem and searching isn't helping.</strong></p>\n<p>Participating only at those times when you are extra stuck is completely valid. However, I feel this level is where most people tend to run into difficulty on Stack Overflow, because it involves someone who may not be new to Stack Overflow per se, but is new to asking questions, and also at the precise time of stress and tension for them where they <em>must</em> get an answer due to a problem they're facing &#x2026; and they don't have the time or inclination to deal with Stack Overflow's strict wiki type requirements for research effort, formatting, showing previous work, and referencing what they found in prior searches.</p>\n</li>\n<li>\n<p><strong>I participate on Stack Overflow for professional development.</strong></p>\n<p>At this level you're talking about experienced Stack Overflow users who have contributed many answers and thus have a pretty good idea of what makes a great question, the kind they'd want to answer themselves. As a result, they don't tend to ask many questions because they self-medicate through exhaustive searching and research, but when they do ask one, their questions are exemplary.</p>\n</li>\n</ol>\n<p>(There's technically a fourth tier here, for people who want to selflessly contribute creative commons questions and answers to move the entire field of software development forward for the next generation of software developers. But who has time for saints &#x1F607;, y'all make the rest of us look bad, so knock it off already Skeet.)</p>\n<p>It wouldn't shock me at all if people spent <em>years</em> happily at tier 1 and then got a big unpleasant surprise when reaching tier 2. The primary place to deal with this, in my opinion, is a <strong>massively revamped and improved ask page</strong>. It's also fair to note that maybe people don't understand that they're signing up for a sizable chunk of work by implicitly committing to the wiki standard of \"try to make sure it's useful to more people than just yourself\" when asking a question on Stack Overflow, and are then  put off by the negative reaction to what others view as an insufficiently researched question.</p>\n<p>Stack Overflow absorbs so much tension from its adoption of wiki standards for content. Even if you know about that requirement up front, it is not always clear what \"useful\" means, in the same way it's not always clear what topics, people, and places are deserving of a Wikipedia page. <a href=\"https://en.wikipedia.org/wiki/Henrietta_Lacks\">Henrietta Lacks</a>, absolutely, but what about your cousin Dave in Omaha with his weirdo PHP 5.6 issue?</p>\n<h3 id=\"overtimeduplicatesbecomevastlandminefields\">Over time, duplicates become vast landmine fields</h3>\n<p>Here's one thing <a href=\"https://stackoverflow.blog/2009/04/29/handling-duplicate-questions/\">I really, really saw coming</a> and to be honest with you I was kinda glad I left in 2012 before I had to deal with it because of the incredible technical difficulty involved: <strong>duplicates</strong>. Of all the complaints I hear about Stack Overflow, this is the one I am most sympathetic to by far.</p>\n<p>If you accept that Stack Overflow is a wiki type system, then for the same reasons that you obviously can't have five different articles about Italy on Wikipedia, <strong>Stack Overflow can't allow duplicate questions on the exact same programming problem</strong>. While there is a fair amount of code to do pre-emptive searches as people type in questions, plus <em>many</em> exhortations to search before you ask, with an inviting search field and button right there on the mandatory page you see before asking your first question ...</p>\n<p><a href=\"https://stackoverflow.com/questions/ask/advice\"><img src=\"https://blog.codinghorror.com/content/images/2018/10/stack-overflow-how-to-ask.jpg\" alt=\"stack-overflow-how-to-ask\" loading=\"lazy\"></a></p>\n<p>... locating and identifying duplicate content is an insanely difficult problem even for a company like Google that's done nothing but specialize in this exact problem for, what, 20 years now, with a veritable army of the world's most talented engineers.</p>\n<p>When you're asking a question on a site that doesn't allow duplicate questions, the problem space of a site with 1 million existing questions is rather different from a site with 10 million existing questions ... or 100 million. Asking a single unique question goes from mildly difficult to mission almost impossible, because your question needs to thread a narrow path through this vast, enormous field of prior art questions without stepping on any of the vaguely similar looking landmines in the process.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2018/10/stackoverflow-asking-duplicate-question.png\" alt=\"stackoverflow-asking-duplicate-question\" loading=\"lazy\"></p>\n<p>But wait! <em>It gets harder!</em></p>\n<ul>\n<li>\n<p><a href=\"https://stackoverflow.blog/2010/11/16/dr-strangedupe-or-how-i-learned-to-stop-worrying-and-love-duplication/\">Some variance in similar-ish questions is OK</a>, because 10 different people will ask a nearly identical question using 10 different sets of completely unrelated words with no overlap. I know, it sounds crazy, but trust me: humans are amazing at this. We want all those duplicates to exist so they can <em>point to</em> the primary question they are a duplicate of, while still being valid search targets for people who ask questions with unusual or rare word choices.</p>\n</li>\n<li>\n<p>It can be legitimately difficult to determine if your question is a true duplicate. How much overlap is enough before one programming question is a duplicate of another? And by whose definition? Opinions vary. This is subject to human interpretation, and humans are.. unreliable. Nobody will ever be completely happy with this system, pretty much by design. That tension is baked in permanently and forever.</p>\n</li>\n</ul>\n<p>I don't have any real answers on the duplicate problem, which only gets worse over time. But I will point out that there is plenty of precedent <a href=\"https://stackexchange.com/sites#traffic\">on the Stack Exchange network</a> for splitting sites into \"expert\" and \"beginner\" areas with slightly different rulesets. We've seen this for Math vs. MathOverflow, English vs. English Learners, Unix vs. Ubuntu... <strong>perhaps it's time for a more beginner focused Stack Overflow</strong> where duplicates are less frowned upon, and conversational rules are a bit more lenient?</p>\n<h3 id=\"stackoverflowisacompetitivesystemofpeerreview\">Stack Overflow is a competitive system of peer review</h3>\n<p>Stack Overflow was indeed built to be a fairly explicitly competitive system, with the caveat that <a href=\"http://wiki.c2.com/?ThereIsMoreThanOneWayToDoIt\">\"there's always more than one way to do it.\"</a> This design choice was based on my perennial observation that the best way to motivate any programmer .. is to subtly insinuate that <em>another</em> programmer could have maybe done it better.</p>\n<p><a href=\"http://www.geekherocomic.com/2008/11/14/the-best-way-to-improve-code-performance/\"><img src=\"https://blog.codinghorror.com/content/images/2018/10/geek-hero-motivating-programmers.png\" alt=\"geek-hero-motivating-programmers\" loading=\"lazy\"></a></p>\n<p>This is manifested in the public reputation system on Stack Overflow, the <a href=\"https://blog.codinghorror.com/for-a-bit-of-colored-ribbon/\">incredible power of a number printed next to someone's name</a>, writ large. All reputation in Stack Overflow comes from the recognition of your peers, never the \"system\".</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2018/10/stack-overflow-top-rep-by-year.png\" alt=\"stack-overflow-top-rep-by-year\" loading=\"lazy\"></p>\n<p>Once your question is asked, or your answer is posted, it can then be poked, prodded, edited, flagged, closed, opened, upvoted, downvoted, <a href=\"http://www.cs.mun.ca/~harold/Courses/Old/CS1400.W15/Diary/Lubar1992.pdf\">folded and spindled</a> by your peers. The <em>intent</em> is for Stack Overflow to be a system of peer review and friendly competition, like a code review from a coworker you've never met at a different division of the company. It's also completely fair for a fellow programmer to question the premise of your question, as long as it's done in a nice way. For example, <a href=\"https://stackoverflow.com/questions/1732348/regex-match-open-tags-except-xhtml-self-contained-tags\">do you <em>really</em> want to use that regular expression to match HTML?</a></p>\n<p>I fully acknowledge that <strong>competitive peer review systems aren't for everyone</strong>, and thus the overall process of having peers review your question may not always feel great, depending on your circumstances and background in the field &#x2014; <em>particularly</em> when combined with the substantial tensions around utility and duplicates Stack Overflow already absorbed from its wiki elements. Kind of a double whammy there.</p>\n<p>I've heard people describe the process of asking a question on Stack Overflow as anxiety inducing. To me, posting on Stack Overflow is <em>supposed</em> to involve a healthy kind of minor \"let me be sure to show off my best work\" anxiety:</p>\n<ul>\n<li>the anxiety of giving a presentation to your fellow peers</li>\n<li>the anxiety of doing well on a test</li>\n<li>the anxiety of showing up to a new job with talented coworkers you admire</li>\n<li>the anxiety of attending your first day at school with other students at your level</li>\n</ul>\n<p>I imagine systems where there is zero anxiety involved and I can only think of jobs where I had long since stopped caring about the work and thus had no anxiety about whether I even showed for work on any given day. How can that be good? Let's just say I'm not a fan of zero-anxiety systems.</p>\n<p>Maybe competition just isn't your jam. Could there be a less competitive Q&A system, a system without downvotes, a system without close votes, where there was never any anxiety about posting anything, just a network of super supportive folks who believe in you and want you to succeed no matter what? Absolutely! I think many alternative sites <em>should</em> exist on the internet so people can choose an experience that matches their personal preferences and goals. Should Stack build that alternative? Has it already been built? It's an open question; feel free to point out examples in the comments.</p>\n<h3 id=\"stackoverflowisdesignedforpracticingprogrammers\">Stack Overflow is designed for practicing programmers</h3>\n<p>Another point of confusion that comes up a fair bit is who the intended audience for Stack Overflow actually is. That one is straightforward, and it's  been the same from day one:</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2018/10/stackoverflow-for-business-description.png\" alt=\"stackoverflow-for-business-description\" loading=\"lazy\"></p>\n<p>Q&A for <strong>professional and enthusiast programmers</strong>. By that we mean</p>\n<blockquote>\n<p>People who either already have a job as a programmer, or could potentially be hired as a programmer today if they wanted to be.</p>\n</blockquote>\n<p>Yes, in case you're wondering, part of this was an overt business decision. To make money you must have an audience of people already on a programmer's salary, or in the job hunt to be a programmer. The entire Stack Overflow network may be Creative Commons licensed, but it was never a non-profit play. It was planned as a sustainable business from the outset, and that's why <a href=\"https://blog.codinghorror.com/stack-overflow-careers-amplifying-your-awesome/\">we launched Stack Overflow Careers</a> only one year after Stack Overflow itself ... to be honest far sooner than we should have, in retrospect. Careers has since been smartly subsumed into Stack Overflow proper at <a href=\"https://stackoverflow.com/jobs\">stackoverflow.com/jobs</a> for a more integrated and most assuredly way-better-than-2009 experience.</p>\n<p>The choice of audience wasn't meant to be an exclusionary decision in any way, but Stack Overflow was definitely designed as a fairly strict system of peer review, which is great (IMNSHO, obviously) for already practicing professionals, but <strong>pretty much everything you would <em>not</em> want as a student or beginner</strong>. This is why I cringe so hard I practically turn myself inside out when people on Twitter mention that they have pointed their students at Stack Overflow. What you'd want for a beginner or a student in the field of programming is almost <em>the exact opposite</em> of what Stack Overflow does at every turn:</p>\n<ul>\n<li>one on one mentoring</li>\n<li>real time collaborative screen sharing</li>\n<li>live chat</li>\n<li>theory and background courses</li>\n<li>starter tasks and exercises</li>\n<li>playgrounds to experiment in</li>\n</ul>\n<p>These are all very fine and good things, but Stack Overflow does <em>NONE</em> of them, by design.</p>\n<p><em>Can</em> you use Stack Overflow to learn how to program from first principles? Well, technically you can do anything with any software. You could try to have actual conversations on Reddit, if you're a masochist. But the answer is yes. You could learn how to program on Stack Overflow, in theory, if you are a prodigy who is comfortable with the light competitive aspects (reputation, closing, downvoting) and also perfectly willing to define all your contributions to the site in terms of utility to others, not just yourself as a student attempting to learn things. But I <em>suuuuuuper</em> would not recommend it. There are <a href=\"https://blog.codinghorror.com/heres-the-programming-game-you-never-asked-for/\">far better websites and systems out there for learning to be a programmer</a>. <em>Could</em> Stack Overflow build beginner and student friendly systems like this? I don't know, and it's certainly not my call to make. &#x1F914;</p>\n<p>And that's it. We can now resume our normal non-abyss gazing. Or whatever it is that passes for normal in these times.</p>\n<p>I hope all of this doesn't come across as negative. Overall I'd say the state of the Stack is strong. But does it even matter what I think? <a href=\"https://stackoverflow.blog/2008/11/25/stack-overflow-is-you/\">As it was in 2008</a>, so it is in 2018.</p>\n<blockquote>\n<p><strong>Stack Overflow is <em>you</em>.</strong></p>\n<p>This is the scary part, the great leap of faith that Stack Overflow is predicated on: trusting your fellow programmers. The programmers who choose to participate in Stack Overflow are the &#x201C;secret sauce&#x201D; that makes it work. You are the reason I continue to believe in developer community as the greatest source of learning and growth. You are the reason I continue to get so many positive emails and testimonials about Stack Overflow. I can&#x2019;t take credit for that. But you can.</p>\n<p>I learned the collective power of my fellow programmers long ago writing on Coding Horror. The community is far, far smarter than I will ever be. All I can ask &#x2014; all any of us can ask &#x2014; is to help each other along the path.</p>\n<p>And if your fellow programmers decide to recognize you for that, then I say you&#x2019;ve well and truly earned it.</p>\n</blockquote>\n<p>The strength of Stack Overflow begins, and ends, with the <a href=\"https://meta.stackoverflow.com/\">community of programmers that power the site</a>. What should Stack Overflow be when it grows up? <strong>Whatever we make it, together.</strong></p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2018/10/stackoverflow-none-of-us-is-as-dumb-as-all-of-us.jpg\" alt=\"stackoverflow-none-of-us-is-as-dumb-as-all-of-us\" loading=\"lazy\"></p>\n<p>p.s. Happy 10th anniversary Stack Overflow!</p>\n<hr>\n<p><small>Also see Joel's take on 10 years of Stack Overflow with <a href=\"https://www.joelonsoftware.com/2018/04/06/the-stack-overflow-age/\">The Stack Overflow Age</a>, <a href=\"https://www.joelonsoftware.com/2018/04/13/gamification/\">A Dusting of Gamification</a>, and <a href=\"https://www.joelonsoftware.com/2018/04/23/strange-and-maddening-rules/\">Strange and Maddening Rules</a>.</small></p>\n<!--kg-card-end: markdown-->"
}