{
  "title": "Woman At The Water | Best of RGSO",
  "link": "https://audioboom.com/posts/8068003",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2512,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Who was the strange woman, seemingly from another time lingering by the water? <br>\nHere is a preview of the story. <br>\n“As the person came nearer, I could tell it was a young lady, I would say in her mid to late teens, wearing a long white nightgown and a white night cap.  She had long sandy brown hair hanging from under the night cap.  She was pale, but not so much that she seemed unnatural.  She was carrying two wooden water pails, each hanging from one end of a carrying pole she was carrying over her shoulders.  Her arms were outstretched steadying the ends of the pole and as she walked.  She looked down as if she were cautiously watching her step as she walked.<br>\n  She slowly walked closer and closer until she was just beyond the driveway and fence from my friend and me.  I had the impression she was unaware of me and my friend, she never looked our way or acknowledged us in any way.  Neither of us were scared at this point either, simply curious about who this young lady was and what she was doing at my grandparent’s farm.  I was just about to ask who she was when she began to fade into a mist and walked straight through the barbed wire fence.  She continued to fade as she walked across the driveway and had completely vanished by the time, she reached the other side, not fifteen feet from where we were sitting.  The hairs stood up on the back of my neck and chills went down my spine.  I was completely frozen.”<br>\n<br>\nTo hear more real ghost stories, become a supporter of our show and get every episode, including our weekly bonus episodes at <a href=\"http://www.ghostpodcast.com/\">http://www.ghostpodcast.com</a> or <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a> <br>\n<br>\nWatch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\nFollow Tony:<br>\nInstagram: <a href=\"http://http//www.instagram.com/tonybrueski\">HTTP://www.instagram.com/tonybrueski</a><br>\nTikToc: <a href=\"https://www.tiktok.com/@tonybrueski\">https://www.tiktok.com/@tonybrueski</a><br>\nFacebook: <a href=\"https://www.facebook.com/tony.brueski\">https://www.facebook.com/tony.brueski</a><br>\n<br>\nIf you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a>\n</div>\n",
  "pubDate": "Sun, 17 Apr 2022 08:00:00 +0000",
  "guid": "tag:audioboom.com,2022-04-16:/posts/8068003",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}