{
  "title": "EPISODE 39 Joan of Arc (Part 1)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Tue, 18 Sep 2018 13:00:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2018/9/18/episode-39-joan-of-arc-part-1",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5b9be4e3575d1f20ab27bc5a",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1536943816965-ONUFYFTCLLR4ZJNSH0ZD/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5b9be6c7352f5397c5cc7680\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1536943816965-ONUFYFTCLLR4ZJNSH0ZD/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“No person in the Middle Ages, male or female, has been the subject of more historical studies than Joan of Arc.” — </em>Kelly Devries</p><p class=\"\"><em>“The life of Joan is such a flagrant beating of the odds that no facts sufficiently explain the course of it. She was born during one of the most corrupt, demoralized periods of French history; she is considered a religious and military hero, but she had neither religious nor military training.”</em> —Mary Gordon<br><br>By 1429, the heir to the French throne was about to give up and flee in exile. The English and their Burgundian allies controlled huge parts of the country. With Orleans likely to fall in a not too distant future, the path was open for the English to conquer the rest of France. It looked like the game was up for him. As much as he tried, he couldn’t see any logical path to victory. But little did he know that help was on its way—a kind of help that didn’t seem to be logical, reasonable or likely. Help was coming in the form of an illiterate teenage peasant—a female at that—who was going to change his fortunes; a young woman who through sheer willpower would radically change the course of the war. She arrived at the royal court during France’s darkest hour with news that God had sent her to lift the siege of Orleans, and make sure the heir to the throne would be crowned King of France.</p><p class=\"\">The young woman was Joan of Arc, and she was one of the most unusual individuals in history.&nbsp;</p><p class=\"\">At 13 years old, her life was turned upside down when she began hearing voices and having visions of angelic figures delivering her messages. The voices told her that no one on earth—neither knight nor king—could restore the kingdom of France. No one could—no one that is… except for her.&nbsp;</p><p class=\"\">Ok, so we have a possibly insane girl hearing voices, This is hardly the stuff that makes the history books. At best, this would be an interesting case study for the history of mental illness. But that’s not what happened here—because the girl and her voices did change the course of the Hundred Years War between France and England. The voices propelled this young woman away from the typical existence of farm girls in the 1400s, and transformed her into a force of nature who embraced a heroic and tragic destiny that was entirely beyond what anyone from her gender, social class, and age could legitimately expect.&nbsp;</p><p class=\"\">According to logic and common sense, none of the things that happened in our story should have been able to happen. A untrained peasant leading an army of knights? A young woman succeeding where the entire French nobility had failed? What she accomplished would have been exceptional if done by an aristocratic, seasoned male leader. But it seems downright impossible for someone like her. The world she lived in was hyper patriarchal and very class conscious, so on the surface there should have been no chance whatsoever that a young peasant girl could pull it off. She belonged to the wrong gender, wrong social class, and wrong age to achieve what she dreamed of. And yet she did.&nbsp;</p><p class=\"\">In this first episode of this four-part series, we tackle:&nbsp;</p><ul data-rte-list=\"default\"><li><p class=\"\">Joseph Campbell and the Hero’s Journey&nbsp;</p></li><li><p class=\"\">The Passion of Joan of Arc by Carl Theodor Dreyer</p></li><li><p class=\"\">How a baby’s gender caused the Hundred Years War&nbsp;</p></li><li><p class=\"\">Black Death & pillaging mercenaries &nbsp;</p></li><li><p class=\"\">The Mad King&nbsp;</p></li><li><p class=\"\">John the Fearless and his political murders&nbsp;</p></li><li><p class=\"\">Agincourt, 1415&nbsp;</p></li><li><p class=\"\">The Dauphin and the bridge = Michael Corleone and the restaurant&nbsp;</p></li><li><p class=\"\">Civil wars and English invasions&nbsp;</p></li><li><p class=\"\">The siege at Orleans begins&nbsp;</p></li></ul><p class=\"\">This episode of History on Fire is brought to you by ForHims.com—a one-stop shop for hair loss, skincare, and sexual wellness for men. Try hims for a month today for just $5 while supplies last. See website for full details. Go to <a href=\"https://www.forhims.com/history5\">https://www.forhims.com/history5</a>&nbsp;</p><p class=\"\"><br>This episode is brought to you by NordicTrack. NordicTrack has a series of training equipment to give you amazing workouts in the convenience of your home, including treadmills, exercise bikes, incline trainers, etc.&nbsp; Personally, I’m a huge fan of their products so I am quite excited to let you know about them. History on Fire listeners get $ 75 off your NordicTrack purchase by visiting: <a href=\"https://www.nordictrack.com/history\">https://www.nordictrack.com/history</a> and using the offer code ‘history’ at checkout. <br></p><p class=\"\">This episode is sponsored by <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a> For less than $ 10 per meal, Blue Apron delivers straight to your door seasonal recipes along with pre-portioned ingredients to make delicious, home-cooked meals. Get $ 30 off your first order—with free shipping—by going to <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a>&nbsp;</p><p class=\"\">This episode is also brought to you by Casper. With over 20,000 reviews and an average of 4.8 stars across Casper, Amazon, and Google, Casper is becoming the Internet’s favorite mattress.<br> Get $50 toward <em>select mattresses </em>by visiting <a href=\"http://casper.com/hof\">casper.com/hof</a> and using HOF at checkout. <em>Terms and conditions apply</em>.</p><p class=\"\">This episode is also brought to you by <a href=\"https://www.greats.com/\">https://www.greats.com/</a> GREATS is a wonderful sneaker company offering men's and women's styles. Save 15% on your first purchase with our code, HISTORY.&nbsp;</p><p class=\"\">Please, also show some love to my regular sponsors by shopping for supplements, special foods, clothing, and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">And if you are in the market for backpacks, computer bags and other hemp gear, check out my favorites at <a href=\"http://www.dsgear.com\">http://www.dsgear.com</a>&nbsp;</p><p class=\"\">History on Fire is brought to you by Kannaway. All CBD products are from organic, non-GMO European HEMP grown on generational family farms. The products all have a triple authenticated process guaranteeing you’re getting exactly what you are paying for. Because all of the CBD is from hemp and NOT cannabis, it is legal to use and possess in all 50 states AND Europe! Now you can get 100% THC-free CBD oil from hemp, delivered to your door in all 50 of the Unites States and the whole of Europe. Please check them out at: <a href=\"https://kannaway.com/2496006\">https://kannaway.com/2496006</a>&nbsp;</p><p class=\"\">A huge thank you to <a href=\"https://www.dynastyforge.com/\">https://www.dynastyforge.com/</a> for sharing with me their amazing swords.&nbsp;</p><p class=\"\">If you train in Jiujitsu (or any other sport for that matter), check out the knee braces at <a href=\"https://nevertapgear.com/\">https://nevertapgear.com/</a>&nbsp;</p><p class=\"\">PATREON NEWS: I have just started a Patreon account!!!! If you feel in a generous mood, please, check it out at <a href=\"http://www.patreon.com/historyonfire\">www.patreon.com/historyonfire</a>&nbsp;</p><p class=\"\">And Donations in crypto-currencies can be made to:&nbsp;</p><p class=\"\">Btc: 1Fdzfr1aPMFdwBY5GXe71nLo11HSMxEfRw</p><p class=\"\">Eth: 0x0deedc896c8e23c3a9daf39e4a9fadada656e924&nbsp;</p><p class=\"\">Ltc: LMW7m54iovT1GK6yZxYXUVPT52pXD9CmjN&nbsp;</p><p class=\"\">Zec: t1NgHHkaEqFM9XzdAZf5u16MRmmz6ruHyTD&nbsp;</p><p class=\"\">Slt: 0x0deedc896c8e23c3a9daf39e4a9fadada656e924</p><p class=\"\">My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>. Thank you to Onnit, Datsusara, Float Clinic, Shaman’s Simple Solutions, War Fuel, Proven Nutrition, and Fight Chix for sponsoring her for her first MMA fight. If you’d like to check out Fight Chix merchandise, you can get a 20% discount by going to <a href=\"http://www.fightchix.com/\">http://www.fightchix.com/</a> and entering the code Fire20 upon checkout.</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\"><br>For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "1:52:04",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 39,
  "itunes:title": "EPISODE 39 Joan of Arc (Part 1)",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 39 Joan of Arc (Part 1)"
  }
}