{
  "id": "tag:blogger.com,1999:blog-5547907074344788039.post-451169000531764920",
  "published": "2015-03-09T19:58:00.000-07:00",
  "updated": "2015-03-09T19:58:28.722-07:00",
  "title": "Advice to graduate students interviewing for industry positions",
  "content": "<div>A couple of weeks ago I saw a post in a LinkedIn group&nbsp;which went something like this: \"I've just received a Ph.D. in physics and I know python and R. I've been applying for data scientist roles. However, I'm not getting much traction. Do you think that I need to learn a BI tool such as Tableau?\"&nbsp;To summarize, this is a <i>physics Ph.D</i>., <i>python</i> and <i>R</i>! That is pretty much a trifecta for an ideal data scientist&nbsp;background. In the current climate, he should be inundated by offers. </div><div><br /></div><div>I didn't interview this person but I assume&nbsp;that he could be doing a better job at selling himself based on his background, experience,&nbsp;and skill set. This is something that I have seen many times when interviewing graduate students over the years. Many students grossly undersell themselves, which is huge shame.&nbsp;Thus, I want to take the opportunity to give a few pieces of&nbsp;advice from a hiring manager's perspective.</div><div><br /></div><div>When I've interviewed graduate students wrapping up their Ph.D.s,&nbsp;too many times the conversation goes like this:</div><ul><li><b>Me</b>: so&nbsp;tell me&nbsp;about yourself&nbsp;and what you've been doing at University of X.</li><li><b>Candidate</b>: I was working in Professor Boson's lab which studies Doppler Shifts. While we have a&nbsp;pretty good idea of Y, we don't understand Z....<i>[science, science, science]</i>...and our group was specifically looking at <i>[science, science, science]</i>...</li><li><b>Me</b>: OK&nbsp;but&nbsp;what what was your role?</li><li><b>Candidate</b>: I was analyzing red shifts using geodesic equations...<i>[science, science, science]</i>...</li></ul><div>(if you haven't worked it out, I know nothing about this particular&nbsp;area. I'm just trying to make a point.)</div><div><br /></div><div>Don't get me wrong. I have a science background&nbsp;and was a professor. I love science, learning about anything new, and could chat about it&nbsp;all day. However, from a hiring manager's perspective, so far in this conversation,&nbsp;I haven't heard anything that is relevant or useful to me.&nbsp;My organization doesn't study red shifts.&nbsp;What I'm interested in are transferable skills that can be applied to different domains or the problem sets in my company. Thus, what I want&nbsp;to hear about are problem solving skills, coding skills, data munging skills, how you overcame a huge challenge and so on.</div><div><br /></div><div>So, I often have to push the conversation quickly to these areas.&nbsp;After&nbsp;some probing,&nbsp;I might then find out that they had to process huge amounts of data from optical arrays, or they had to deal with a significant missing data problem and impute values, or they had to develop some sophisticated computer vision algorithms. They do in&nbsp;fact have a more interesting and marketable skill set that they, unfortunately, aren't leading with.&nbsp;In short, I find that graduate students often&nbsp;don't think about what skills they posses that are valuable to an organization to which they are applying. Draw attention&nbsp;to&nbsp;those clearly in your resume and in&nbsp;how you talk about yourself during a phone screen. In essence, explain why we would be a good match.</div><div><br /></div><div>The fact that you are completing a Ph.D. shows focus, persistence, and dedication. Research is often open-ended and you have to get a sense of where the ripe questions and approaches are and know when to give up and tackle it another way. That is a highly valuable skill. Dealing with messy real world or voluminous data are problems that we face in industry. We want smart, creative thinkers who can switch domains, own a&nbsp;problem, think laterally to deal with unknown but inevitable issues that will crop up, and who, ultimately, still produce results. We want good communicators. We want to know what combination of those you are. Where do you shine and what do you bring to the table? And, we need to make an initial assessment of all of this in 30 to 45 minutes over a phone line.&nbsp;It's tough so you have to put your best foot froward. Want an insider tip?&nbsp;You can get more of my time if, in advance of the call, you have a github account or a competition profile on Kaggle&nbsp;listed on your resume that I can check out.&nbsp;</div><div><br /></div><div>No, you don't need to learn Tableau to get my attention. You likely already have a great set of skills.&nbsp;Just sell me on what they are. What can you&nbsp;do?</div><div><br /></div><div>Good luck!</div><div><br /></div><div>&nbsp;</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Carl Anderson",
    "uri": "http://www.blogger.com/profile/11930448254473684406",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 6
}