{
  "id": "yt:video:iQNdkdqoIdw",
  "yt:videoId": "iQNdkdqoIdw",
  "yt:channelId": "UCBn6YYmhnruGtEtlKxYbQ9A",
  "title": "In Defence of Grammatical Gender",
  "link": "",
  "author": {
    "name": "K Klein",
    "uri": "https://www.youtube.com/channel/UCBn6YYmhnruGtEtlKxYbQ9A"
  },
  "published": "2022-09-21T07:00:12+00:00",
  "updated": "2022-10-29T08:47:51+00:00",
  "media:group": {
    "media:title": "In Defence of Grammatical Gender",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "I finally talk about grammatical gender again – there was so much to say, and I didn’t even get into phonoaesthetics! Talking of aesthetics, sorry for cripplingly bad audio.\n\nMistakes of the video: \"il uomo\" is incorrect, it's \"l'uomo\". *sigh*. And \"kiuri\" is a stupid typo, it's \"kizuri\".\n\nContact NMorrag (composer for outro): morragtimemusic@gmail.com\nThanks to my patrons!!\nPatreon: https://www.patreon.com/user?u=73482298\n\n\nSources:\n\nAlcock, K. (2000). \" Grammatical noun class agreement processing in Kiswahili\". Language and Speech.\n\nBoroditsky, L. (2009). \"How does our language shape the way we think?\". Edge. [Retrieved 8/09/2022]\n\nContini-Morava, E. (2000). \"Noun Class as Number in Swahili\". Between Grammar and Lexicon. Ed. Contini-Morava, E. & Tobin, Y.\n\nCorbett, G. (2013). \"Number of Genders\". The World Atlas of Language Structures Online. Leipzig: Max Planck Institute for Evolutionary Anthropology. [Retrieved 14/09/2022].\n\nRoché, M. (1992). \"Le masculin est-il plus productif que le féminin ?\". Langue française (96) 113–124.\n\nSaussure, F. (1916). Cours De Linguistique Générale. Paris: Payot.\n\nTextor, C. (2022). Number of Chinese Communist Party members in China 2010/2021, by gender.\n\nWilliams, A., Cotterell, R., Wolf-Sonkin, L., Blasi, D., Wallach, H. (2021). \"On the Relationships Between the Grammatical Genders of Inanimate Nouns and Their Co-Occurring Adjectives and Verbs\". Transactions of the Association for Computational Linguistics (9) 139–159.\n\nOffice for National Statistics. (2022). Opinions and Lifestyle Survey 16/02/2022 to 13/03/2022.\n\n\nVideos mentioned (in order of appearance):\n\nhttps://www.youtube.com/watch?v=46ehrFk-gLk&t=82s by Tom Scott\n\nhttps://www.youtube.com/watch?v=3B_uGsgXKdk by K Klein\n\nhttps://www.youtube.com/watch?v=3AnG3tbwlIw&t=470s by Luke Ranieri\n\nhttps://www.youtube.com/watch?v=7kV_bLrfUxs by Simon Roper\n\n\nNOTES FROM VIDEO (in order of appearance):\n\nNote 1: Here, I pronounce these words with stress on the prefix rather than the first syllable of the noun stem, where it should be. This was done to emphasise where these words are different; I don’t mean to give the impression that this is how these words should be pronounced in Swahili.\n\nNote 2: I should have said “animate” here, not “m-wa class”, because nouns of other classes are given “m-wa” concords when they are animate. Hence, the speaker can conclude from hearing these concords only that the noun is animate, which narrows the options down to 7-15% of all nouns.\n\nNote 3: Obviously, Mandarin Chinese does have gendered language in the sense that there are words to describe differences in gender. However, it does not have any grammatical gendered language, which English does have – for instance, it would be considered incorrect to refer to a man as “she”. In modern usage, in writing, 他 (he) and 她 (she) are usually differentiated, but this separation only occurred in the 1910s with the coinage of 她.\n\nNote 4: However, note that there are counterexamples to this. In Swahili, many nouns describing people, even when they are in a class other than m-wa (class 1/2), use m-wa concords because their animacy takes priority over their morphological class. For instance, “fundi” (“craftsman”), plural “mafundi”, is placed in the “ma” class (class 5/6) because of how its plural is formed, but still uses m-wa concords.\n\nNote 5: I’m not saying that showing this kind of thing with emphasis is any worse inherently. It does work in English, even in writing with good use of italics. However, in speech it can definitely be confusing, with people often having to repeat themselves. Note that I am arguing from experience here.\n\nNote 6: “iel”, sometimes spelt “ielle”, (accusative “lea”, dative “lui”, emphatic “ellui”) is a French neopronoun meant for use by non-binary people. It is a merger of “il” and “elle” (and the accusative and emphatic forms are also merged from the accusative and emphatic forms of these pronouns).\n\n\nChapters:\n00:00 – Introduction\n01:12 – “Grammatical Gender Carries No Meaning”\n02:46 – “… and That’s a Bad Thing”\n03:56 – “Grammatical Gender Changes How You Think”\n05:57 – “Male”, “Female” and “Neutral”\n06:36 – A Misanalysis of What Grammatical Gender Is\n10:09 – Trans People and Grammatical Gender\n11:50 – Credits\n\nWritten and Created by Me\nArt by kvd102\nOutro Music by NMorrag\n\nTranslations:\nLuca Massenzio - Italian",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}