{
  "id": "tag:blogger.com,1999:blog-6894866515532737257.post-5590930125926287962",
  "published": "2018-06-22T08:52:00.000-07:00",
  "updated": "2018-06-22T08:54:20.216-07:00",
  "title": "Inference in three hours",
  "content": "I am preparing a talk for the Joint Statistical Meetings (<a href=\"http://ww2.amstat.org/meetings/jsm/2018/\">JSM 2018</a>) in August.&nbsp; It's part of a session called \"<a href=\"http://ww2.amstat.org/meetings/jsm/2018/onlineprogram/ActivityDetails.cfm?SessionID=215024\">Bringing Intro Stats into a Multivariate and Data-Rich World</a>\"; my talk is called \"Inference in Three Hours, and More Time for the Good Stuff\".<br /><br />Here's what I said I would talk about:<br /><blockquote class=\"tr_bq\"><i>Teaching statistical inference using mathematical methods takes too much time, emphasizes the least important material, and leaves many students unprepared to apply statistics in the real world. Simple computer simulations can demonstrate the fundamental ideas of statistical inference quickly, clearly, and memorably. Computational methods are also robust and flexible, making it possible to work with a wider range of data and experiments. And by teaching statistical inference better and faster, we leave time for the most important goals of statistics education: preparing students to use data to answer questions and guide decision making under uncertainty. In this talk, I discuss problems with current approaches and present educational material I have developed based on computer simulations in Python.</i></blockquote>I have slides for the talk now:<br /><br /><iframe allowfullscreen=\"true\" frameborder=\"0\" height=\"299\" mozallowfullscreen=\"true\" src=\"https://docs.google.com/presentation/d/e/2PACX-1vSOvOq60uGshS-bWLdr3QXG46z3tI_9jmVfRFzfZaHB-48AtWqdJATGNc8lYbJEUIULvRwlrIA5kEg4/embed?start=false&amp;loop=false&amp;delayms=3000\" webkitallowfullscreen=\"true\" width=\"480\"></iframe> <br /><br /><a href=\"https://github.com/AllenDowney/CompStats/blob/master/resampling.ipynb\">And here's the Jupyter notebook they are based on.</a><br /><br />I have a few weeks until the conference, so comments and suggestions are welcome.<br /><br />----<br /><br />Coincidentally, I got question on Twitter today that's related to my talk:<br /><blockquote class=\"tr_bq\"><i>Very late to this post by @AllenDowney, but quite informative:&nbsp;<a href=\"http://allendowney.blogspot.com/2015/11/recidivism-and-single-case-probabilities.html\">http://allendowney.blogspot.com/2015/11/recidivism-and-single-case-probabilities.html</a> &nbsp;…<br />Have one question though: seems a lot of the single case reasoning here is similar to what I was taught was a mistaken conclusion: “that there is a 95% prob that a parameter lies within the given 95% CI.” What is the difference? Seems I am missing some nuance?</i></blockquote>The post @cutearguments asks about is \"Recidivism and single-case probabilities\", where I make an argument that single-case probabilities are not a special problem, even under the frequentist interpretation of probability; they only seem like a special problem because they make the <a href=\"https://en.wikipedia.org/wiki/Reference_class_problem\">reference class problem</a>&nbsp;particularly salient.<br /><br />So what does that have to do with confidence intervals?&nbsp; Let me start with the example in my talk: suppose you are trying to estimate the average height of men in the U.S.&nbsp; You collect a sample and generate an estimate, like 178 cm, and a 95% confidence interval, like (177, 179) cm.<br /><br />Naively, it is tempting to say that there is a 95% chance that the true value (the actual average height of every male resident in the population) falls in the 95% confidence interval.&nbsp; But that's not true.<br /><br />There are two reasons you might hear for <i>why</i> it's not true:<br /><br />1) The true value is unknown, but it is not a random quantity, so it is either in the interval or it's not.&nbsp; You can't assign a probability to it.<br /><br />2) The 95% confidence interval does not have a 95% chance of containing the true value because that's just not what it means.&nbsp; A confidence interval quantifies variability due to random sampling; that's all.<br /><br />The first argument is bogus; the second is valid.<br /><br />If you are a Bayesian, the first argument is bogus because it is entirely unproblematic to make probability statements about unknown quantities, whether they are considered random or not.<br /><br />If you are a frequentist, the first argument is still bogus because even if the true value is not a random quantity, the confidence interval is.&nbsp; And furthermore, it belongs to a natural reference class, the set of confidence intervals we would get by running the experiment many times.&nbsp; If we agree to treat it as a member of that reference class, we should have no problem giving it a probability of containing the true value.<br /><br />But that probability is not 95%.&nbsp; &nbsp;If you want an interval with a 95% chance of containing the true value, you need a Bayesian credible interval.<br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Allen Downey",
    "uri": "http://www.blogger.com/profile/01633071333405221858",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}