{
  "title": "Galactic satellite systems in CDM, WDM and SIDM. (arXiv:2208.07376v3 [astro-ph.GA] UPDATED)",
  "link": "http://arxiv.org/abs/2208.07376",
  "description": "<p>We investigate the population of bright satellites ($M_{*} \\geq 10^{5}\n\\mathrm{M}_{\\odot}$) of haloes of mass comparable to that of the Milky Way in\ncosmological simulations in which the dark matter (DM) is either cold, warm or\nself-interacting (CDM, WDM and SIDM respectively). The nature of the DM gives\nrise to differences in the abundance and structural properties of field halos.\nIn WDM, the main feature is a reduction in the total number of galaxies that\nform, reflecting a suppression of low-mass DM haloes and lower galaxy formation\nefficiency compared to CDM. For SIDM, the changes are structural, restricted to\nthe central regions of haloes and dependent on the assumed self-interaction\ncross-section. We also consider different baryonic subgrid physics models for\ngalaxy formation, in which supernova gas blowouts can or cannot induce the\nformation of a core in dwarf galaxies. Overall, the inclusion of baryons lessen\nthe differences in the halo properties in the different DM models compared to\nDM-only simulations. This affects the satellite properties at infall and\ntherefore their subsequent tidal stripping and survival rates. Nonetheless, we\nfind slightly less concentrated satellite radial distributions as the SIDM\ncross-section increases. Unfortunately, we also find that the satellite\npopulations in simulations with baryon-induced cores in CDM and WDM can mimic\nthe results found in SIDM, making the satellite stellar mass and maximum\ncircular velocity functions heavily degenerate on the assumed nature of the DM\nand the adopted subgrid modelling. These degeneracies preclude using the\nbrightest satellites of the Milky Way to constrain the nature of DM.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Moreno_V/0/1/0/all/0/1\">Victor J. Forouhar Moreno</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Benitez_Llambay_A/0/1/0/all/0/1\">Alejandro Benitez-Llambay</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Cole_S/0/1/0/all/0/1\">Shaun Cole</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Frenk_C/0/1/0/all/0/1\">Carlos Frenk</a>"
}