{
  "title": "Using Lastpass with Ansible Vault",
  "link": "https://streamhacker.com/2020/02/24/using-lastpass-with-ansible-vault/#utm_source=feed&#038;utm_medium=feed&#038;utm_campaign=feed",
  "comments": "https://streamhacker.com/2020/02/24/using-lastpass-with-ansible-vault/#respond",
  "dc:creator": "Jacob",
  "pubDate": "Tue, 25 Feb 2020 01:37:52 +0000",
  "category": [
    "security",
    "ansible",
    "devops",
    "encryption",
    "lastpass"
  ],
  "guid": "https://streamhacker.com/?p=2128",
  "description": "How to integrate Lastpass with Ansible Vault to simplify vault password management.",
  "content:encoded": "\n<p><a href=\"https://www.ansible.com/\">Ansible</a> is a framework that helps with automating deployments, among other things. It has a feature called <a href=\"https://docs.ansible.com/ansible/latest/user_guide/vault.html\">Ansible Vault</a> that enables you to encrypt secrets in your ansible files. These vault encrypted secrets can only be decrypted if you provide the correct password. This means you can store things like database passwords and other sensitive settings in your repository, in a secure manner. For password access to your secrets, you are given 3 options:</p>\n\n\n\n<ol><li>Ansible asks you to enter a password every time the secrets are needed</li><li>You provide a file that has the password in it</li><li>You leave everything decrypted until you&#8217;re ready to commit your changes, then you encrypt them using option 1 or 2 (and later decrypt when you want to make changes).</li></ol>\n\n\n\n<p>Entering a password all the time gets annoying real quick, but having a password file laying around does not seem all that secure. Plus it&#8217;s hard to share securely if you&#8217;re collaborating with others. Option 3 requires you to not make a mistake and accidentally commit decrypted secrets. What if there was a better way?</p>\n\n\n\n<p><a href=\"https://lastpass.wo8g.net/c/1960948/566009/8692\">Lastpass</a> is a great place to store your passwords, and generate secure ones, but it is annoying to lookup, copy, then paste the password back in ansible, and you need to add <code>—ask-vault-pass</code> to every ansible command. However, Lastpass has a neat command line utility that you can use to get a password saved in Lastpass. With some minor scripting, you can integrate this with the ansible password file, so that you don&#8217;t have a plaintext password file laying around. I learned a lot about how to do this from <a href=\"https://www.koszek.com/blog/2017/03/05/how-to-use-ansible-vault-with-lastpass/\">How to use Ansible Vault with LastPass</a> but decided that simple scripting worked better for me than install a ruby gem.</p>\n\n\n\n<ol><li>Install <a href=\"https://github.com/lastpass/lastpass-cli\">lastpass-cli</a></li><li>Create a bash script we&#8217;ll call <code>lpass_vault.sh</code>. This must be located wherever you run <code>ansible</code> from, and be executable</li>\n\n\n<div class=\"wp-block-syntaxhighlighter-code \"><pre class=\"brush: plain; title: ; notranslate\">\n#!/bin/bash\nPASSWORD=`lpass show --password \"ansible vault\"`\necho $PASSWORD\n</pre></div>\n\n\n<li>Create an entry in your Lastpass account with the <strong>Name</strong> <code>\"ansible vault\"</code>. This is what is referenced in the script above.</li>\n<li>Add the following to environment. You could add it to the bottom of <code>bin/activate</code> if you&#8217;re using python virtualenv:</li>\n\n\n<div class=\"wp-block-syntaxhighlighter-code \"><pre class=\"brush: plain; title: ; notranslate\">\nexport ANSIBLE_VAULT_PASSWORD_FILE=`command -v ./lpass_vault.sh`\n</pre></div>\n\n\n<li>Then run <code>lpass login</code> to ensure lastpass is setup</li>\n\n\n\n<li>Now you can run <code>ansible</code> with vault encrypted secrets, and at worst you’ll be prompted for your lastpass master password.</li></ol>\n\n\n\n<p>This isn&#8217;t only more convenient for an individual, it can also be great for teams: you can check vault encrypted secrets into a  shared repository, then share the password in <a href=\"https://github.com/lastpass/lastpass-cli\">Lastpass</a>. Now nothing is exposed in the repository, and the only people that can access the secrets are those with the Lasspass password.</p>\n",
  "wfw:commentRss": "https://streamhacker.com/2020/02/24/using-lastpass-with-ansible-vault/feed/",
  "slash:comments": 0,
  "post-id": 2128
}