{
  "id": "https://bibleinoneyear.org/en/youth/141",
  "title": "Day 141: Good Government?",
  "description": "Psalm 65:1-4, 1 Samuel 8:19-22, 10:1,6-7, John 12:12-33.  Governments reflect the mix that is in us all of what is good and true alongside what is sinful and flawed However, be assured that one day there will be a new type of government – the kingship of Jesus (John 12:12–36)",
  "pubDate": "Fri, 21 May 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/141/?ignore",
  "itunes:duration": "14:44",
  "guid": "enyouth21052021-141",
  "length": 884.11,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 141: Good Government?",
  "itunes:subtitle": "Psalm 65:1-4, 1 Samuel 8:19-22, 10:1,6-7, John 12:12-33.  Governments reflect the mix that is in us all of what is good and true alongside what is sinful and flawed However, be assured that one day there will be a new type of government – the kingship of Jesus (John 12:12–36)",
  "itunes:summary": "Government is the system or group of people governing an organised community, often a state. It usually consists of legislative, executive and judiciary. Government is the mechanism for deciding state policies and the means by which those policies are enforced. Historically, forms of government have included theocracy, autocracy (such as monarchy), oligarchy, aristocracy and democracy.\nSir Winston Churchill once said that ‘Democracy is the worst form of government except for all those other forms that have been tried from time to time.’\nGovernments have their ups and downs. Our politicians are human beings with human weaknesses like our own.\nThere is a certain ambivalence about all human government in the Bible. There are parts where human government is affirmed as God-given (for instance, in Romans 13), and others where it is pictured as being under demonic control (for instance, in Revelation 13). Together they represent the reality of human government. Governments reflect the mix that is in us all of what is good and true alongside what is sinful and flawed.\nHowever, be assured that one day there will be a new type of government – the kingship of Jesus (John 12:12–36).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 141
}