{
  "title": "Metamaterials Could Solve One of 6G’s Big Problems",
  "link": "https://spectrum.ieee.org/metamaterials-could-solve-one-of-6gs-big-problems",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/an-illustration-depicting-cellphone-users-at-street-level-in-a-city-with-wireless-signals-reaching-them-via-reflecting-surfaces.jpg?id=31252545&width=1200&height=800&coordinates=0%2C208%2C0%2C0\"/><br/><br/><p>\n<strong>For all the tumultuous </strong>revolution in wireless technology over the past several decades, there have been a couple of constants. One is the overcrowding of radio bands, and the other is the move to escape that congestion by exploiting higher and higher frequencies. And today, as engineers roll out 5G and plan for 6G wireless, they find themselves at a crossroads: After years of designing superefficient transmitters and receivers, and of compensating for the signal losses at the end points of a radio channel, they’re beginning to realize that they are approaching the practical limits of transmitter and receiver efficiency. From now on, to get high performance as we go to higher frequencies, we will need to engineer the <em>wireless channel itself</em>. But how can we possibly engineer and control a wireless environment, which is determined by a host of factors, many of them random and therefore unpredictable?\n</p><p>\n\tPerhaps the most promising solution, right now, is to use reconfigurable intelligent surfaces. These are planar structures typically ranging in size from about 100 square centimeters to about 5 square meters or more, depending on the frequency and other factors. These surfaces use advanced substances called \n\t<a href=\"https://www.forbes.com/sites/forbestechcouncil/2022/07/07/what-are-metamaterials-and-what-does-this-science-have-to-do-with-the-future-of-space/?sh=2986c4413487\" rel=\"noopener noreferrer\" target=\"_blank\">metamaterials</a> to reflect and refract electromagnetic waves. Thin two-dimensional metamaterials, known as metasurfaces, can be designed to sense the local electromagnetic environment and tune the wave’s key properties, such as its <a href=\"https://www.nature.com/articles/s41377-021-00552-3\" rel=\"noopener noreferrer\" target=\"_blank\">amplitude, phase, and polarization</a>, as the wave is reflected or refracted by the surface. So as the waves fall on such a surface, it can alter the incident waves’ direction so as to strengthen the channel.  In fact, these metasurfaces can be programmed to make these changes dynamically, reconfiguring the signal in real time in response to changes in the wireless channel. Think of reconfigurable intelligent surfaces as the next evolution of the repeater concept.\n</p><p class=\"pull-quote\">\n\tReconfigurable intelligent surfaces could play a big role in the coming integration of wireless and satellite networks.\n</p><p>\n\tThat’s important, because as we move to higher frequencies, the propagation characteristics become more “hostile” to the signal. The wireless channel varies constantly depending on surrounding objects. At 5G and 6G frequencies, the wavelength is vanishingly small compared to the size of buildings, vehicles, hills, trees, and rain. Lower-frequency waves diffract around or through such obstacles, but higher-frequency signals are absorbed, reflected, or scattered. Basically, at these frequencies, the line-of-sight signal is about all you can count on.\n</p><p>\n\tSuch problems help explain why the topic of\n\t<a href=\"https://www.sciencedirect.com/science/article/pii/S2352864821000912\" rel=\"noopener noreferrer\" target=\"_blank\"> reconfigurable intelligent surfaces</a> (RIS) is one of the hottest in wireless research. The hype is justified. A landslide of R&D activity and results has gathered momentum over the last several years, set in motion by the development of the first digitally controlled metamaterials <a href=\"https://encyclopedia.pub/entry/history/show/32830\" rel=\"noopener noreferrer\" target=\"_blank\">almost 10 years ago</a>.\n</p><div class=\"ieee-sidebar-medium\">\n<p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n\t\tThis article was jointly produced by \n\t\t<em>IEEE Spectrum</em> and <em>Proceedings of the IEEE </em>with similar versions published in both publications. For more on reconfigurable intelligent surfaces, those with access to IEEE Xplore can download <a href=\"https://ieeexplore.ieee.org/stamp/stamp.jsp?isnumber=9896612\" target=\"_blank\">a complete special issue</a> on the topic.\n\t</p>\n</div><p>\n\tRIS prototypes are showing great promise at scores of laboratories around the world. And yet one of the first major projects, the European-funded \n\t<a href=\"https://www.visorsurf.eu/\" rel=\"noopener noreferrer\" target=\"_blank\">Visorsurf</a>, began just five years ago and ran until 2020. The first public demonstrations of the technology occurred in late 2018, by <a href=\"https://www.docomo.ne.jp/english/corporate/\" rel=\"noopener noreferrer\" target=\"_blank\">NTT Docomo</a> in Japan and<a href=\"https://www.metawave.com/\" rel=\"noopener noreferrer\" target=\"_blank\"> Metawave</a>, of Carlsbad, Calif.\n</p><p>\n\tToday, hundreds of researchers in Europe, Asia, and the United States are working on applying RIS to produce programmable and smart wireless environments. Vendors such as Huawei, Ericsson, NEC, Nokia, Samsung, and ZTE are working alone or in collaboration with universities. And major network operators, such as NTT Docomo, Orange, China Mobile, China Telecom, and BT are all carrying out substantial RIS trials or have plans to do so. This work has repeatedly demonstrated the ability of RIS to greatly strengthen signals in the most problematic bands of 5G and 6G.\n</p><h2>How reconfigurable intelligent surfaces strengthen a wireless signal</h2><p>\n\tTo understand how RIS improves a signal, consider the electromagnetic environment. \n\t<a href=\"https://www.businesstechweekly.com/operational-efficiency/wireless-networks/cellular-networks/\" rel=\"noopener noreferrer\" target=\"_blank\">Traditional cellular networks</a> consist of scattered base stations that are deployed on masts or towers, and on top of buildings and utility poles in urban areas. Objects in the path of a signal can block it, a problem that becomes especially bad at 5G’s higher frequencies, such as the <a href=\"https://www.techtarget.com/searchnetworking/definition/millimeter-wave-MM-wave#\" rel=\"noopener noreferrer\" target=\"_blank\">millimeter-wave bands</a> between 24.25 and 52.6 gigahertz. And it will only get worse if communication companies go ahead with plans to exploit <a href=\"https://www.edn.com/sub-terahertz-research-in-6g-wireless-where-should-you-start/\" rel=\"noopener noreferrer\" target=\"_blank\">subterahertz bands</a>, between 90 and 300 GHz, in 6G networks. Here’s why. With 4G and similar lower-frequency bands, reflections from surfaces can actually strengthen the received signal, as reflected signals combine. However, as we move higher in frequencies, such <a href=\"https://www.electronics-notes.com/articles/antennas-propagation/propagation-overview/multipath-propagation.php#\" rel=\"noopener noreferrer\" target=\"_blank\">multipath effects</a> become much weaker or disappear entirely. The reason is that surfaces that appear smooth to a longer-wavelength signal are relatively rough to a shorter-wavelength signal. So rather than reflecting off such a surface, the signal simply scatters.\n</p><p>\n\tOne solution is to use more powerful base stations or to install more of them throughout an area. But that strategy can double costs, or worse. Repeaters or relays can also improve coverage but here, too, the costs can be prohibitive. RIS, on the other hand, promises greatly improved coverage at just marginally higher cost\n</p><div class=\"rm-embed embed-media\"><div class=\"flourish-embed flourish-cards\" data-src=\"visualisation/10941421?607871\">\n<script src=\"https://public.flourish.studio/resources/embed.js\"> </script>\n</div></div><p>\n\tThe key feature of RIS that makes it attractive in comparison with these alternatives is its nearly passive nature. The absence of amplifiers to boost the signal means that an RIS node can be powered with just a battery and a small solar panel.\n</p><p>\n\tRIS functions like a very sophisticated mirror, whose orientation and curvature can be adjusted in order to focus and redirect a signal in a specific direction. But rather than physically moving or reshaping the mirror, you electronically alter its surface so that it changes key properties of the incoming \n\t<a href=\"http://electron9.phys.utk.edu/optics421/modules/m1/emwaves.htm\" rel=\"noopener noreferrer\" target=\"_blank\">electromagnetic wave</a>, such as the phase.\n</p><p>\n\tThat’s what the metamaterials do. This emerging class of materials exhibits properties beyond (from the Greek \n\t<em>meta</em>) those of natural materials, such as anomalous reflection or refraction. The materials are fabricated using ordinary metals and electrical insulators, or dielectrics. As an electromagnetic wave impinges on a metamaterial, a predetermined gradient in the material alters the phase and other characteristics  of the wave, making it possible to bend the wave front and redirect the beam as desired.\n</p><p>\n\tAn RIS node is made up of hundreds or thousands of metamaterial elements called unit cells. Each cell consists of metallic and dielectric layers along with one or more switches or other tunable components. A typical structure includes an upper metallic patch with switches, a biasing layer, and a metallic ground layer separated by dielectric substrates. By controlling the biasing—the voltage between the metallic patch and the ground layer—you can switch each unit cell on or off and thus control how each cell alters the phase and other characteristics of an incident wave.\n</p><p>\n\tTo control the direction of the larger wave reflecting off the entire RIS, you synchronize all the unit cells to create patterns of \n\t<a href=\"https://www.phys.uconn.edu/~gibson/Notes/Section5_2/Sec5_2.htm\" rel=\"noopener noreferrer\" target=\"_blank\">constructive and destructive interference</a> in the larger reflected waves [ see illustration below]. This interference pattern reforms the incident beam and sends it in a particular direction determined by the pattern. This basic operating principle, by the way, is the same as that of a phased-array radar.\n</p><h3>Beamforming by constructive and destructive interference</h3><br/><img class=\"rm-shortcode\" data-rm-shortcode-id=\"28a6d2cedeefffce6750988a7c21767f\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"84106\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image.png?id=31258733&width=980\"/><p>A reconfigurable intelligent surface comprises an array of unit cells. In each unit cell, a metamaterial alters the phase of an incoming radio wave, so that the resulting waves interfere with one another [above, top]. Precisely controlling the patterns of this constructive and destructive interference allows the reflected wave to be redirected [bottom], improving signal coverage.</p><h3></h3><br/><div class=\"rblad-ieee_in_content\"></div><h3></h3><br/><p>An RIS has other useful features. Even without an amplifier, an RIS manages to provide substantial gain—about 30 to 40 decibels relative to isotropic (dBi)—depending on the size of the surface and the frequency. That’s because the gain of an antenna is <a href=\"https://www.phys.hawaii.edu/~anita/new/papers/militaryHandbook/antennas.pdf\" target=\"_blank\">proportional to the antenna’s aperture</a> area. An RIS has the equivalent of many antenna elements covering a large aperture area, so it has higher gain than a conventional antenna does.</p><p>All the many unit cells in an RIS are controlled by a logic chip, such as a <a href=\"https://www.xilinx.com/products/silicon-devices/fpga/what-is-an-fpga.html\" target=\"_blank\">field-programmable gate array</a> with a microcontroller, which also stores the many coding sequences needed to dynamically tune the RIS. The controller gives the appropriate instructions to the individual unit cells, setting their state. The most common coding scheme is simple binary coding, in which the controller toggles the switches of each unit cell on and off. The unit-cell switches are usually semiconductor devices, such as <a href=\"https://en.wikipedia.org/wiki/PIN_diode\" rel=\"noopener noreferrer\" target=\"_blank\">PIN diodes</a> or field-effect transistors.</p><p>The important factors here are power consumption, speed, and flexibility, with the control circuit usually being one of the most power-hungry parts of an RIS. Reasonably efficient RIS implementations today have a total power consumption of around a few watts to a dozen watts during the switching state of reconfiguration, and much less in the idle state.</p><h2>Engineers use simulations to decide where to deploy RIS nodes</h2><p>To deploy RIS nodes in a real-world network, researchers must first answer three questions: How many RIS nodes are needed? Where should they be placed? And how big should the surfaces be? As you might expect, there are complicated calculations and trade-offs.</p><p>Engineers can identify the best RIS positions by planning for them when the base station is designed. Or it can be done afterward by identifying, in the coverage map, the areas of poor signal strength. As for the size of the surfaces, that will depend on the frequencies (lower frequencies require larger surfaces) as well as the number of surfaces being deployed.</p><p>To optimize the network’s performance, researchers rely on simulations and measurements. At <a href=\"https://carrier.huawei.com/en/\" rel=\"noopener noreferrer\" target=\"_blank\">Huawei Sweden</a>, where I work, we’ve had a lot of discussions about the best placement of RIS units in urban environments. We’re using a proprietary platform, called the Coffee Grinder Simulator, to <a href=\"https://ieeexplore.ieee.org/document/9852389\" rel=\"noopener noreferrer\" target=\"_blank\">simulate an RIS installation</a> prior to its construction and deployment. We’re partnering with <a href=\"https://www.cnrs.fr/en/cnrs\" rel=\"noopener noreferrer\" target=\"_blank\">CNRS Research</a> and <a href=\"https://www.centralesupelec.fr/en\" rel=\"noopener noreferrer\" target=\"_blank\">CentraleSupélec</a>, both in France, among others.</p><p>In a recent project, we used simulations to quantify the performance improvement gained when multiple RIS were deployed in a typical urban 5G network. As far as we know, this was the first large-scale, system-level attempt to gauge RIS performance in that setting. We optimized the RIS-augmented wireless coverage through the use of efficient deployment algorithms that we developed. Given the locations of the base stations and the users, the algorithms were designed to help us select the optimal three-dimensional locations and sizes of the RIS nodes from among thousands of possible positions on walls, roofs, corners, and so on. The output of the software is an RIS deployment map that maximizes the number of users able to receive a target signal.</p><h3></h3><br/><div class=\"rblad-ieee_in_content\"></div><h3></h3><br/><img alt=\"An array of electronic devices sits atop a supporting structure.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"96ece9d103af560f5688ff5603c19b8a\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"2a98c\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/an-array-of-electronic-devices-sits-atop-a-supporting-structure.jpg?id=31253227&width=980\"/><h3></h3><br/><div class=\"rblad-ieee_in_content\"></div><h3></h3><br/><p>Of course, the users of special interest are those at the edges of the cell-coverage area, who have the worst signal reception. Our results showed big improvements in coverage and data rates at the cell edges—and also for users with decent signal reception, especially in the millimeter band.</p><p>We also investigated how potential RIS hardware trade-offs affect performance. Simply put, every RIS design requires compromises—such as digitizing the responses of each unit cell into binary phases and amplitudes—in order to construct a less complex and cheaper RIS. But it’s important to know whether a design compromise will create additional beams to undesired directions or cause interference to other users. That’s why we studied the impact of network interference due to multiple base stations, reradiated waves by the RIS, and other factors.</p><p>Not surprisingly, our simulations confirmed that both larger RIS surfaces and larger numbers of them improved overall performance. But which is preferable? When we factored in the costs of the RIS nodes and the base stations, we found that in general a smaller number of larger RIS nodes, deployed further from a base station and its users to provide coverage to a larger area, was a particularly cost-effective solution.</p><p>The size and dimensions of the RIS depend on the operating frequency [see illustration below] . We found that a small number of rectangular RIS nodes, each around 4 meters wide for C-band frequencies (3.5 GHz) and around half a meter wide for millimeter-wave band (28 GHz), was a good compromise, and could boost performance significantly in both bands. This was a pleasant surprise: RIS improved signals not only in the millimeter-wave (5G high) band, where coverage problems can be especially acute, but also in the C band (5G mid).</p><h3></h3><br/><div class=\"flourish-embed flourish-table\" data-src=\"visualisation/10950128?607871\"><script src=\"https://public.flourish.studio/resources/embed.js\"></script></div><h3></h3><br/><img class=\"rm-shortcode\" data-rm-shortcode-id=\"b293f526599e1135fcde3e046820f376\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"ae6de\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image.png?id=31301079&width=980\"/><p>\n<br/>\n</p><p>\n\tTo extend wireless coverage indoors, researchers in Asia are investigating a really intriguing possibility: covering room windows with transparent RIS nodes. Experiments at NTT Docomo and at Southeast and Nanjing universities, both in China, used smart films or smart glass. The films are fabricated from transparent conductive oxides (such as \n\t<a href=\"https://en.wikipedia.org/wiki/Indium_tin_oxide#\" target=\"_blank\">indium tin oxide</a>), graphene, or silver nanowires and do not noticeably reduce light transmission. When the films are placed on windows, signals coming from outside can be refracted and boosted as they pass into a building, enhancing the coverage inside.\n</p><h2>What will it take to make RIS nodes intelligent?</h2><p>\n\tPlanning and installing the RIS nodes is only part of the challenge. For an RIS node to work optimally, it needs to have a configuration, moment by moment, that is appropriate for the state of the communication channel in the instant the node is being used. The best configuration requires an accurate and instantaneous estimate of the channel. Technicians can come up with such an estimate by measuring the “channel impulse response” between the base station, the RIS, and the users. This response is measured using pilots, which are reference signals known beforehand by both the transmitter and the receiver. It’s a standard technique in wireless communications. Based on this estimation of the channel, it’s possible to calculate the phase shifts for each unit cell in the RIS.\n</p><p>\n\tThe current approaches perform these calculations at the base station. However, that requires a huge number of pilots, because every unit cell needs its own phase configuration. There are various ideas for reducing this overhead, but so far none of them are really promising.\n</p><p>\n\tThe total calculated configuration for all of the unit cells is fed to each RIS node through a wireless control link. So each RIS node needs a wireless receiver to periodically collect the instructions. This of course consumes power, and it also means that the RIS nodes are fully dependent on the base station, with unavoidable—and unaffordable—overhead and the need for continuous control. As a result, the whole system requires a flawless and complex orchestration of base stations and multiple RIS nodes via the wireless-control channels.\n</p><p>\n\tWe need a better way. Recall that the “I” in RIS stands for intelligent. The word suggests real-time, dynamic control of the surface from within the node itself—the ability to learn, understand, and react to changes. We don’t have that now. Today’s RIS nodes cannot perceive, reason, or respond; they only execute remote orders from the base station. That’s why my colleagues and I at Huawei have started working on a project we call Autonomous RIS (AutoRIS). The goal is to enable the RIS nodes to autonomously control and configure the phase shifts of their unit cells. That will largely eliminate the base-station-based control and the massive signaling that either limit the data-rate gains from using RIS, or require synchronization and additional power consumption at the nodes. The success of AutoRIS might very well help determine whether RIS will ever be deployed commercially on a large scale.\n</p><p>\n\tOf course, it’s a rather daunting challenge to integrate into an RIS node the necessary receiving and processing capabilities while keeping the node lightweight and low power. In fact, it will require a huge research effort. For RIS to be commercially competitive, it will have to preserve its low-power nature.\n</p><p>\n\tWith that in mind, we are now exploring the integration of an ultralow-power AI chip in an RIS, as well as the use of extremely efficient machine-learning models to provide the intelligence. These smart models will be able to produce the output RIS configuration based on the received data about the channel, while at the same time classifying users according to their contracted services and their network operator. Integrating AI into the RIS will also enable other functions, such as dynamically predicting upcoming RIS configurations and grouping users by location or other behavioral characteristics that affect the RIS operation.\n</p><p>\n\tIntelligent, autonomous RIS won’t be necessary for all situations. For some areas, a static RIS, with occasional reconfiguration—perhaps a couple of times per day or less—will be entirely adequate. In fact, there will undoubtedly be a range of deployments from static to fully intelligent and autonomous. Success will depend on not just efficiency and high performance but also ease of integration into an existing network.\n</p><p class=\"pull-quote\">\n\t6G promises to unleash staggering amounts of bandwidth—but only if we can surmount a potentially ruinous range problem.\n</p><p>\n\tThe real test case for RIS will be 6G. The coming generation of wireless is expected to embrace autonomous networks and smart environments with real-time, flexible, software-defined, and adaptive control. Compared with 5G, 6G is expected to provide much higher data rates, greater coverage, lower latency, more intelligence, and sensing services of much higher accuracy. At the same time, a key driver for 6G is sustainability—we’ll need more energy-efficient solutions to achieve the “net zero” emission targets that many network operators are striving for. RIS fits all of those imperatives.\n</p><p>\n\tStart with massive MIMO, which stands for \n\t<a href=\"https://www.electronics-notes.com/articles/antennas-propagation/mimo/what-is-mimo-multiple-input-multiple-output-wireless-technology.php\" rel=\"noopener noreferrer\" target=\"_blank\">multiple-input multiple-output</a>. This foundational 5G technique uses multiple antennas packed into an array at both the transmitting and receiving ends of wireless channels, to send and receive many signals at once and thus dramatically boost network capacity. However, the desire for higher data rates in 6G will demand even more massive MIMO, which will require many more radio-frequency chains to work and will be power-hungry and costly to operate. An energy-efficient and less costly alternative will be to place multiple low-power RIS nodes between massive MIMO base stations and users as we have described in this article.\n</p><p>\n\tThe millimeter-wave and subterahertz 6G bands promise to unleash staggering amounts of bandwidth, but only if we can surmount a potentially ruinous range problem without resorting to costly solutions, such as ultradense deployments of base stations or active repeaters. My opinion is that only RIS will be able to make these frequency bands commercially viable at a reasonable cost.\n</p><p>\n\tThe communications industry is already touting sensing—high-accuracy localization services as well as object detection and posture recognition—as an important possible feature for 6G. Sensing would also enhance performance. For example, highly accurate localization of users will help steer wireless beams efficiently. Sensing could also be offered as a new network service to vertical industries such as smart factories and autonomous driving, where detection of people or cars could be used for mapping an environment; the same capability could be used for surveillance in a home-security system. The large aperture of RIS nodes and their resulting high resolution mean that such applications will be not only possible but probably even cost effective.\n</p><p>\n\tAnd the sky is not the limit. RIS could enable the integration of satellites into 6G networks. Typically, a satellite uses a lot of power and has large antennas to compensate for the long-distance propagation losses and for the modest capabilities of mobile devices on Earth. RIS could play a big role in minimizing those limitations and perhaps even allowing direct communication from satellite to 6G users. Such a scheme could lead to more efficient satellite-integrated 6G networks.\n</p><p>\n\tAs it transitions into new services and vast new frequency regimes, wireless communications will soon enter a period of great promise and sobering challenges. Many technologies will be needed to usher in this next exciting phase. None will be more essential than reconfigurable intelligent surfaces.\n<span class=\"ieee-end-mark\"></span>\n</p><p>\n<em>The author wishes to acknowledge the help of Ulrik Imberg in the writing of this article.<br/></em></p><p><em>This article appears in the November 2022 print issue as “6G’s Metamaterials Solution.”<br/></em></p>",
  "pubDate": "Sat, 03 Sep 2022 21:00:00 +0000",
  "guid": "https://spectrum.ieee.org/metamaterials-could-solve-one-of-6gs-big-problems",
  "category": [
    "6g",
    "Metamaterials",
    "5g",
    "Wireless communication"
  ],
  "dc:creator": "Marios Poulakis",
  "media:content": ""
}