{
  "title": "179: Ending Mental Illness with Dr. Daniel & Tana Amen",
  "pubDate": "Thu, 28 May 2020 14:20:21 +0000",
  "guid": "1a7453a7-b503-490b-8f64-4dd8030d1f40",
  "link": "https://sites.libsyn.com/94610/179-ending-mental-illness-with-dr-daniel-tana-amen",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">How do you end mental illness? </span></p> <p><span style=\"font-weight: 400;\">I’m excited to welcome back two dear brain warrior friends, mental superheroes, and best-selling authors,</span> <strong>Dr. Daniel and Tana Amen</strong><span style=\"font-weight: 400;\">. This conversation is so important as many people are struggling to deal with everything going on in the world today. </span></p> <p><span style=\"font-weight: 400;\">In this episode, we discuss Dr. Amen’s new book,</span> <em><span style=\"font-weight: 400;\">The End of Mental Illness</span></em><span style=\"font-weight: 400;\">, and some simple tips on how to improve your mindset and daily approach to life. If you have found yourself struggling during these uncertain times, this episode offers an alternative way of thinking as it relates to mental illness and the power you have to improve it. </span></p> <p><em>* The information in this podcast is not intended to be construed as medical advice, nor is the information a substitute for professional medical expertise or treatment. If you or any other person has a medical concern, you should consult with your health care provider or seek other professional medical treatment. *</em></p> <p class=\"p1\">*** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. ***</p>",
  "content:encoded": "<p>How do you end mental illness? </p> <p>I’m excited to welcome back two dear brain warrior friends, mental superheroes, and best-selling authors, Dr. Daniel and Tana Amen. This conversation is so important as many people are struggling to deal with everything going on in the world today. </p> <p>In this episode, we discuss Dr. Amen’s new book, <em>The End of Mental Illness</em>, and some simple tips on how to improve your mindset and daily approach to life. If you have found yourself struggling during these uncertain times, this episode offers an alternative way of thinking as it relates to mental illness and the power you have to improve it. </p> <p><em>* The information in this podcast is not intended to be construed as medical advice, nor is the information a substitute for professional medical expertise or treatment. If you or any other person has a medical concern, you should consult with your health care provider or seek other professional medical treatment. *</em></p> <p class=\"p1\">*** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. ***</p>",
  "enclosure": "",
  "itunes:duration": "14:21",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "How do you end mental illness?  I’m excited to welcome back two dear brain warrior friends, mental superheroes, and best-selling authors, Dr. Daniel and Tana Amen. This conversation is so important as many people are struggling to deal with...",
  "itunes:episodeType": "full"
}