{
  "title": "FRED Maps Rise as GeoFRED Sets",
  "link": "https://news.research.stlouisfed.org/2022/06/fred-maps-rise-as-geofred-sets/",
  "dc:creator": "",
  "pubDate": "Tue, 07 Jun 2022 16:40:03 +0000",
  "category": "FRED Announcements",
  "guid": "https://news.research.stlouisfed.org/?p=6116",
  "description": "<p>As surely as the sun rises, FRED continues to provide great data tools. The latest is our new mapping feature. You can customize, share, and download geographical maps of data directly in FRED. These maps are available for series in &#8230; <a href=\"https://news.research.stlouisfed.org/2022/06/fred-maps-rise-as-geofred-sets/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a></p>\nThe post <a href=\"https://news.research.stlouisfed.org/2022/06/fred-maps-rise-as-geofred-sets/\">FRED Maps Rise as GeoFRED Sets</a> first appeared on <a href=\"https://news.research.stlouisfed.org\">St. Louis Fed Economic Research</a>.",
  "content:encoded": "<p></p>\n\n\n\n<p>As surely as the sun rises, FRED continues to provide great data tools. The latest is our new mapping feature. You can customize, share, and download geographical maps of data directly in FRED.</p>\n\n\n\n<p>These maps are available for series in a dataset that have geographical characteristics, such as per capita personal income for U.S. states: For example, Missouri personal income can be examined on a U.S. state map.</p>\n\n\n<p><iframe src=\"https://fred.stlouisfed.org/graph/graph-landing.php?m=QhfA&width=670&height=640\" scrolling=\"no\" frameborder=\"0\" style=\"overflow:hidden; width:670px; height:690px;\" allowtransparency=\"true\" loading=\"lazy\"></iframe></p>\n\n\n\n<p>Our <a href=\"https://geofred.stlouisfed.org/\">GeoFRED website</a> will close down Sept. 1, 2022, and we know a change like this can be disruptive, especially if you use GeoFRED as a teaching tool. So we hope our new FRED map feature will be a helpful alternative to engage with data.&nbsp;</p>\n\n\n\n<p>Maps provide a cross-sectional perspective that lets you compare regions on a map while complementing and expanding the data analysis you get on a time-series graph. FRED has 9 types of maps: U.S. counties, U.S. metro areas, U.S. states, nations, Federal Reserve Districts, Census regions, Census divisions, BEA regions, and NECTAs (New England city and town areas).</p>\n\n\n\n<p>Check out our <a href=\"https://fredhelp.stlouisfed.org/#fred-maps\">FRED map tutorials</a> for additional guidance on how to use this new feature and try it out to:</p>\n\n\n\n<ul><li>Supplement your data story with an interactive map.</li><li>Share your customized map with an option to automatically update the map with the latest data.</li><li>Embed your maps in your favorite blog site.</li><li>Download all data on the map into a single file.</li></ul>\n\n\n\n<p></p>The post <a href=\"https://news.research.stlouisfed.org/2022/06/fred-maps-rise-as-geofred-sets/\">FRED Maps Rise as GeoFRED Sets</a> first appeared on <a href=\"https://news.research.stlouisfed.org\">St. Louis Fed Economic Research</a>."
}