{
  "title": "Moonbats and Wingnuts - 1 Dec. 2008",
  "link": "https://dts.podtrac.com/redirect.mp3/traffic.libsyn.com/secure/awww/081201-AWWW-moonbats-and-wingnuts.mp3",
  "description": "[This episode first aired September 20, 2008.]  Here's a bit of political slang now making the rounds: sleepover. No, we're not talking about another pol caught with his pants down. We're talking about spending the night with, well, a voting machine. In this week's episode, we examine this and other examples of political language.  You call the repairman to fix a balky garage door, but when he gets there, it inexplicably works. You summon a plumber, only to find that when he arrives, your toilet's no longer leaking--and you're out $150. Or you discover that somewhere between your home and the doctor's office, your kid's sore throat miraculously healed. A caller in Traverse City, Michigan, is tearing her hair out over this phenomenon, which she calls \"phixophobia.\" But, she asks, might there be an even better word for the way inanimate objects seem to conspire against us? We think so: resistentialism.  Great Scott! You've heard the expression. But who was Scott and why was he so great? Or was he an impressive Scotsman? Martha and Grant can't say for sure, although the evidence points toward a Civil War soldier who happened to go by that name.  Our hosts bandy about some more political slang terms and explain their meaning and origin. Or did you already know the difference between a moonbat and a wingnut?  Quiz Guy John Chaneski strikes up the band, begins the beguine, and treats Martha and Grant to musical quiz. Warning: Songs may be sung. Not to worry, though--all three have promised to keep their day jobs.  If someone handed you something and told you to stick it in your jockey box, where would you put it? A Baltimore caller who grew up in Utah says when he used this term on a road trip with a friend, his pal was flummoxed. Is jockey box an expression peculiar to one part of the country?  Is that oh-so-handy sticky stuff called \"duct tape\" or \"duck tape\"? An Emmy-nominated filmmaker is wondering, specifically because he has to instruct narrators to be careful to avoid running together a T sound at the end of a word with the T sound at the beginning of a word. And that has him further wondering if such elision of consonants has created other terms. We offer him an answer and a glass of ice tea. Or would that be iced tea?  It's Obamarama time! We discuss the growing number of plays on the name of the Democratic presidential candidate.  A North Carolina pediatrician is this week's contestant for an animal-themed version of our slang quiz. He tries to figure out the meaning of dead cat bounce and pigeon pair.  A caller's question about the word wonky, in the sense of askew, leads to a broader question: What makes a word slang, anyway?  Why do we say something is jet black? Does it have to do with the color of a 747's exhaust? Or skid marks on the runway? Or something else entirely? We provide a color with a mineralogical answer.  A listener phones with his pet restaurant peeve: When your waiter ask, \"Are you working on that?\" Martha and Grant agree and pile on with gusto.  --  Get your language question answered on the air! Call or write 24 hours a day: (877) WAY-WORD/(877) 929-9673, words@waywordradio.org, or visit our web site and discussion forums at http://waywordradio.org. Copyright 2008, Wayword LLC.\n        \nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "pubDate": "Mon, 01 Dec 2008 05:01:00 -0000",
  "itunes:episodeType": "full",
  "itunes:author": "Hosted by Martha Barnette and Grant Barrett. Produced by Stefanie Levine.",
  "itunes:image": "",
  "itunes:subtitle": "In this week's episode, we examine 'sleepovers' and other examples of political language.",
  "itunes:summary": "[This episode first aired September 20, 2008.]  Here's a bit of political slang now making the rounds: sleepover. No, we're not talking about another pol caught with his pants down. We're talking about spending the night with, well, a voting machine. In this week's episode, we examine this and other examples of political language.  You call the repairman to fix a balky garage door, but when he gets there, it inexplicably works. You summon a plumber, only to find that when he arrives, your toilet's no longer leaking--and you're out $150. Or you discover that somewhere between your home and the doctor's office, your kid's sore throat miraculously healed. A caller in Traverse City, Michigan, is tearing her hair out over this phenomenon, which she calls \"phixophobia.\" But, she asks, might there be an even better word for the way inanimate objects seem to conspire against us? We think so: resistentialism.  Great Scott! You've heard the expression. But who was Scott and why was he so great? Or was he an impressive Scotsman? Martha and Grant can't say for sure, although the evidence points toward a Civil War soldier who happened to go by that name.  Our hosts bandy about some more political slang terms and explain their meaning and origin. Or did you already know the difference between a moonbat and a wingnut?  Quiz Guy John Chaneski strikes up the band, begins the beguine, and treats Martha and Grant to musical quiz. Warning: Songs may be sung. Not to worry, though--all three have promised to keep their day jobs.  If someone handed you something and told you to stick it in your jockey box, where would you put it? A Baltimore caller who grew up in Utah says when he used this term on a road trip with a friend, his pal was flummoxed. Is jockey box an expression peculiar to one part of the country?  Is that oh-so-handy sticky stuff called \"duct tape\" or \"duck tape\"? An Emmy-nominated filmmaker is wondering, specifically because he has to instruct narrators to be careful to avoid running together a T sound at the end of a word with the T sound at the beginning of a word. And that has him further wondering if such elision of consonants has created other terms. We offer him an answer and a glass of ice tea. Or would that be iced tea?  It's Obamarama time! We discuss the growing number of plays on the name of the Democratic presidential candidate.  A North Carolina pediatrician is this week's contestant for an animal-themed version of our slang quiz. He tries to figure out the meaning of dead cat bounce and pigeon pair.  A caller's question about the word wonky, in the sense of askew, leads to a broader question: What makes a word slang, anyway?  Why do we say something is jet black? Does it have to do with the color of a 747's exhaust? Or skid marks on the runway? Or something else entirely? We provide a color with a mineralogical answer.  A listener phones with his pet restaurant peeve: When your waiter ask, \"Are you working on that?\" Martha and Grant agree and pile on with gusto.  --  Get your language question answered on the air! Call or write 24 hours a day: (877) WAY-WORD/(877) 929-9673, words@waywordradio.org, or visit our web site and discussion forums at http://waywordradio.org. Copyright 2008, Wayword LLC.\n        \nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "content:encoded": "<p>[This episode first aired September 20, 2008.]<br> <br> Here's a bit of political slang now making the rounds: sleepover. No, we're not talking about another pol caught with his pants down. We're talking about spending the night with, well, a voting machine. In this week's episode, we examine this and other examples of political language.<br> <br> You call the repairman to fix a balky garage door, but when he gets there, it inexplicably works. You summon a plumber, only to find that when he arrives, your toilet's no longer leaking--and you're out $150. Or you discover that somewhere between your home and the doctor's office, your kid's sore throat miraculously healed. A caller in Traverse City, Michigan, is tearing her hair out over this phenomenon, which she calls \"phixophobia.\" But, she asks, might there be an even better word for the way inanimate objects seem to conspire against us? We think so: resistentialism.<br> <br> Great Scott! You've heard the expression. But who was Scott and why was he so great? Or was he an impressive Scotsman? Martha and Grant can't say for sure, although the evidence points toward a Civil War soldier who happened to go by that name.<br> <br> Our hosts bandy about some more political slang terms and explain their meaning and origin. Or did you already know the difference between a moonbat and a wingnut?<br> <br> Quiz Guy John Chaneski strikes up the band, begins the beguine, and treats Martha and Grant to musical quiz. Warning: Songs may be sung. Not to worry, though--all three have promised to keep their day jobs.<br> <br> If someone handed you something and told you to stick it in your jockey box, where would you put it? A Baltimore caller who grew up in Utah says when he used this term on a road trip with a friend, his pal was flummoxed. Is jockey box an expression peculiar to one part of the country?<br> <br> Is that oh-so-handy sticky stuff called \"duct tape\" or \"duck tape\"? An Emmy-nominated filmmaker is wondering, specifically because he has to instruct narrators to be careful to avoid running together a T sound at the end of a word with the T sound at the beginning of a word. And that has him further wondering if such elision of consonants has created other terms. We offer him an answer and a glass of ice tea. Or would that be iced tea?<br> <br> It's Obamarama time! We discuss the growing number of plays on the name of the Democratic presidential candidate.<br> <br> A North Carolina pediatrician is this week's contestant for an animal-themed version of our slang quiz. He tries to figure out the meaning of dead cat bounce and pigeon pair.<br> <br> A caller's question about the word wonky, in the sense of askew, leads to a broader question: What makes a word slang, anyway?<br> <br> Why do we say something is jet black? Does it have to do with the color of a 747's exhaust? Or skid marks on the runway? Or something else entirely? We provide a color with a mineralogical answer.<br> <br> A listener phones with his pet restaurant peeve: When your waiter ask, \"Are you working on that?\" Martha and Grant agree and pile on with gusto.<br> <br> --<br> <br> Get your language question answered on the air! Call or write 24 hours a day: (877) WAY-WORD/(877) 929-9673, words@waywordradio.org, or visit our web site and discussion forums at http://waywordradio.org. Copyright 2008, Wayword LLC.</p> <a href=\"http://feeds.waywordradio.org/~f/awwwpodcast?a=TGazS1v4\"></a> <a href=\"http://feeds.waywordradio.org/~f/awwwpodcast?a=JzDl510c\"></a> <a href=\"http://feeds.waywordradio.org/~f/awwwpodcast?a=FnPcFBxh\"></a> <a href=\"http://feeds.waywordradio.org/~f/awwwpodcast?a=KN9tqag3\"></a> <a href=\"http://feeds.waywordradio.org/~f/awwwpodcast?a=FIx6iFDh\"></a> <a href=\"http://feeds.waywordradio.org/~f/awwwpodcast?a=9qIYL3cs\"></a> <a href=\"http://feeds.waywordradio.org/~f/awwwpodcast?a=FMETSVTu\"></a> <p></p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p>",
  "itunes:duration": 3105,
  "itunes:explicit": "no",
  "guid": "http://awww.libsyn.com/index.php?post_id=408436#",
  "enclosure": ""
}