{
  "title": "528: We're Going Back to Hogwarts!",
  "link": "https://audioboom.com/posts/7932799",
  "itunes:episode": 528,
  "itunes:title": "We're Going Back to Hogwarts!",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3893,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>CHOO CHOO! Join us as we head back to Hogwarts on this week's episode of MuggleCast! Andrew, Eric, Micah and Meg as they play a few games and discuss the school's prime locations for first kisses, homework, parties and more! Plus, with David Yates beginning a new project, could the latest Fantastic Beasts news spell more trouble for the five-part movie franchise?<br>\n<br>\n\n</div>\n<ul>\n<li>Last chance! Only one day remains to select your 2021 MuggleCast patrons physical gift! Join us at <a href=\"https://www.patreon.com/mugglecast\">Patreon</a> and make your selection between our throwback socks and the customizable wooden car <strong>by September 1st!</strong>\n</li>\n<li>With so much time having already elapsed between Crimes of Grindelwald and Fantastic Beasts 3, what do we make of <a href=\"https://deadline.com/2021/08/harry-potter-fantastic-beasts-david-yates-sony-next-project-1234816953/\">the news</a> that there will be a \"break\" between Fantastic Beasts 3 and 4?</li>\n<li>Could the Fantastic Beasts franchise rest on the success of the third film? Andrew has a theory for what this break really means!</li>\n<li>Main Discussion: It's time to go Back to Hogwarts!</li>\n<li>Where would each of the hosts sit on the Hogwarts Express? What would be the first thing each of us did upon return to Hogwarts?</li>\n<li>\"What Would You Do?\" & Guess That Book (Back to Hogwarts Edition)</li>\n<li>Where at Hogwarts would you: have your first kiss? Do your homework? Have some \"me\" time? Hold secret parties?</li>\n<li>Quizzitch: In what books does Harry not directly interact with Draco Malfoy while on the Hogwarts Express? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week's episode is sponsored by <a href=\"http://www.meundies.com/mugglecast\">MeUndies</a> (get 15% off your first order plus free shipping ) and <a href=\"http://www.greencheef.com/mugglecast100\">GreenChef</a> (get $100 off plus free shipping)!</li>\n</ul>\n",
  "pubDate": "Tue, 31 Aug 2021 09:00:00 +0000",
  "guid": "tag:audioboom.com,2021-08-30:/posts/7932799",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}