{
  "id": "tag:blogger.com,1999:blog-1747027701196237068.post-4646607968628939238",
  "published": "2022-01-21T09:44:00.002-05:00",
  "updated": "2022-01-21T09:44:57.963-05:00",
  "title": "Speaking our language: The importance of a Mandarin Pixel 6 ad with Simu Liu",
  "content": "<div class=\"separator\" style=\"clear: both; text-align: center;\"><iframe allowfullscreen='allowfullscreen' webkitallowfullscreen='webkitallowfullscreen' mozallowfullscreen='mozallowfullscreen' width='449' height='373' src='https://www.blogger.com/video.g?token=AD6v5dyZAGvkrDA8P7UgpvoJ7wj8IHl7HW11xwgz8SDhpRrNsoeb8DTOIOqE6EcITFRiVNEPYiwIEAHGx7NhQOJ-OQ' class='b-hbp-video b-uploaded' frameborder='0'></iframe></div><br /><div>Language is one of the most universal experiences we share— but, sometimes it becomes a frustrating barrier. With the help of technology, people should be able to overcome language barriers and connect with the world around them in new and meaningful ways.&nbsp;</div><div>That was what we set out to do in our latest <a href=\"https://store.google.com/ca/product/pixel_6_pro?hl=en-GB\" rel=\"nofollow\" target=\"_blank\">Google Pixel 6 </a>ad campaign with a little help from our friend and <a href=\"https://canada.googleblog.com/2021/12/canadian-actor-simu-liu.html\" rel=\"nofollow\" target=\"_blank\">Canadian Pixel Ambassador Simu Liu</a>. Beginning January 24th, you’ll see a brand new 30-second ad spot centred around the Pixel 6 - and it will be delivered entirely in Mandarin. Simu, who speaks fluent Mandarin, used his talents to show off what’s possible with one of the phone’s most helpful  features, <a href=\"https://www.youtube.com/watch?v=8yGN55SkXGY&amp;t=65s\" rel=\"nofollow\" target=\"_blank\">Live Translate</a>.&nbsp;</div><div><br /></div><div>“In my conversations with the Google team, they really encouraged me to spearhead the creative thinking and direction in how we would introduce the Pixel 6 to Canadians,”  says Liu. “I was able to involve my parents in the commercial to highlight the Live Translate function, which allows you to translate between over 46 different languages. I think it’s a great tool for immigrant families to communicate with people.”&nbsp;</div><div><br /></div><div>The new video, which <a href=\"https://www.instagram.com/p/CY_Z9_qFt5G/\" rel=\"nofollow\" target=\"_blank\">Simu recently shared on Instagram</a>, demonstrates the capabilities and powerful potential of Interpreter Mode in Live Translate. Simu’s unparalleled charm and personality shine through as he tries to live up to his parents’ expectations, and soon everyone is using Live Translate to get their message across. Mandarin is the <a href=\"https://www.clo-ocol.gc.ca/en/newsletter/2018/top-5-languages-spoken-canada\">third-most spoken language</a> Canadians use in their homes, right behind English and French. By producing an ad spoken almost entirely in Mandarin, we hope Canadians will try to unlock communication simply using their phones.&nbsp;</div><div><br /></div><div>“Simu has been an engaged partner throughout this process. In continuing this relationship, we wanted him to inject his personality and heritage into the project in an authentic way, “ says Andrew Rapsey,  Head of Product Marketing and Brand Partnerships with Google Canada. “We want to continue to demonstrate how Pixel features like Live Translate can help connect Canadians in ways they never thought were possible. Why not double down on that commitment with a national commercial shot entirely in Mandarin?”&nbsp;</div><div><br /></div><div>Interpreter Mode on Pixel 6 provides smart, simple translation of in-person conversations directly on the device. By simply prompting Google Assistant and asking it to “Be My Interpreter”, the Pixel 6 will take turns translating what is said based on the languages that are selected. This is just one of the many Live Translate features included on Pixel, which features best-in-class speed and accuracy thanks to the strides we continue to make in machine learning and the <a href=\"https://blog.google/products/pixel/introducing-google-tensor/\" rel=\"nofollow\" target=\"_blank\">Google Tensor chip</a>.</div><div><br /></div><div>Live Translate also automatically detects if a message in your chat apps is different from your system language, and offers the option to automatically translate, all right on the device. Live Caption Translate takes speech to text and uses our dedicated translation model to convert that text into select languages. Users can also use <a href=\"https://lens.google/\" rel=\"nofollow\" target=\"_blank\">Google Lens</a> to detect and translate text on signs or menus. Whether you’re having a full conversation with a relative in their native language, or interpreting the menu at a new restaurant, Live Translate on Pixel 6 makes the process seamless.&nbsp;</div><div><br /></div><div>The new Mandarin ad campaign starring Simu will go live on January 24th. Canadians can expect to see the ads on select English-language broadcast and digital outlets, and will air alongside our recently-announced French-language ad with <a href=\"https://canada.googleblog.com/2022/01/canadian-tennis-star-leylah-fernandez.html\" rel=\"nofollow\" target=\"_blank\">Canadian Tennis Star Leylah Fernandez</a>. The Google Pixel 6 and Pixel 6 Pro are now available on the <a href=\"https://store.google.com/ca/product/pixel_6?gclid=Cj0KCQjw5oiMBhDtARIsAJi0qk1sfLPZTvkoGN8csgY3hAjYu8iIMxQ7k320t54T2DFBg2MvwKVGV5YaAj8VEALw_wcB&amp;gclsrc=aw.ds&amp;hl=en-GB\" rel=\"nofollow\" target=\"_blank\">Google Store</a>.  </div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Aaron Brindle",
    "uri": "http://www.blogger.com/profile/13885417405401273013",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}