{
  "guid": "1a6d68e4-793f-4fd3-9e92-5ede332ffa6e",
  "title": "Jenna Bush Hager: \"Allow For That Space\"",
  "description": "<p>You probably know Jenna Bush Hager as Hoda’s co-host on TODAY with Hoda & Jenna. As you’ll hear, they’re so friendly on air because they’re real friends off-air — and their friendship has only grown and deepened over the years. And because this podcast has been about friendship and wisdom, there’s no better way to bring it all home than with a girlfriend. For our last episode of Season One, we invite you into an intimate conversation, touching on everything from lessons learned by example during childhood to what it means for Jenna to turn 40. Together, Hoda and Jenna talk about birth, love, loss and the importance of work ethic. Plus, a special look back at the highlights and moments that touch on what Hoda is finally making space for.</p>\n",
  "pubDate": "Mon, 1 Nov 2021 08:00:00 +0000",
  "author": "news.podcasts@nbcuni.com (Hoda Kotb, Jenna Bush Hager)",
  "link": "https://making-space-with-hoda-kotb.simplecast.com/episodes/jenna-bush-hager-allow-for-that-space-l_zcsB8Z",
  "content:encoded": "<p>You probably know Jenna Bush Hager as Hoda’s co-host on TODAY with Hoda & Jenna. As you’ll hear, they’re so friendly on air because they’re real friends off-air — and their friendship has only grown and deepened over the years. And because this podcast has been about friendship and wisdom, there’s no better way to bring it all home than with a girlfriend. For our last episode of Season One, we invite you into an intimate conversation, touching on everything from lessons learned by example during childhood to what it means for Jenna to turn 40. Together, Hoda and Jenna talk about birth, love, loss and the importance of work ethic. Plus, a special look back at the highlights and moments that touch on what Hoda is finally making space for.</p>\n",
  "enclosure": "",
  "itunes:title": "Jenna Bush Hager: \"Allow For That Space\"",
  "itunes:author": "Hoda Kotb, Jenna Bush Hager",
  "itunes:duration": "00:31:03",
  "itunes:summary": "Jenna Bush Hager joins co-host and friend Hoda Kotb for an intimate conversation touching on love, loss, work ethic and what it means for Jenna to turn 40.",
  "itunes:subtitle": "Jenna Bush Hager joins co-host and friend Hoda Kotb for an intimate conversation touching on love, loss, work ethic and what it means for Jenna to turn 40.",
  "itunes:keywords": "jenna bush, daily boost, make space, today show, new, education, fame, hoda, loss, hoda kotb, today, charity, self help, positivity, new podcast, author, love, mental health, president george h.w. bush, childhood, making space, motherhood, hoda & jenna, recovery, lifestyle, nbc, mentorship, the today show, growth, self-improvement, sisterhood, jenna bush hager, confidence, nbc news, friendship, home, career, life, today with hoda and jenna, white house, entertainment, jenna and hoda, president george w. bush, teacher, birth, hoda and jenna, jenna hager, barbara bush, self-esteem, motivation, marriage, spirituality, addiction, inspiration, laura bush, teaching, feel good, humanitarian, family",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:season": 1
}