{
  "id": "tag:blogger.com,1999:blog-2499715909956774229.post-5609579759188580",
  "published": "2018-08-07T11:08:00.001-07:00",
  "updated": "2018-08-07T11:08:15.020-07:00",
  "title": "Fed's Portfolio Manager Says Not to Worry",
  "content": "I ran across an interesting talk by <a href=\"https://www.newyorkfed.org/newsevents/speeches/2018/pot180803\">Simon Potter,</a> who is responsible for the System Open Market Account at the New York Fed. Potter is a powerful person in the Fed system, as he looks after the specifics of monetary policy implementation. His talk addresses issues that I discussed in <a href=\"http://newmonetarism.blogspot.com/2018/07/fed-balance-sheet-policy-and-treasury.html\">this previous blog post.</a><br /><br />The first order of business in the talk is the phasing out of the Fed's reinvestment policy. Recall that, after the buildup in the Fed's balance sheet that occurred from 2009-2014, the size of the Fed's asset portfolio, in nominal terms, was held constant by purchasing new assets as the existing assets matured. In fall 2017, the FOMC began a phaseout of the reinvestment program which will be completed this fall. After that, the size of the balance sheet will continue to fall until the Fed either decides reduction should cease, or it resumes asset purchases. There have been no public statements about whether the Fed might choose to maintain a significant stock of excess reserve balances in the financial system (retain the current floor system) or revert to the system in place before the financial crisis, perhaps modified in some fashion.<br /><br />Potter provides a useful figure that shows what happens as reinvestment is phased out, and after:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-IRnbUEic0WI/W2jdal7mU9I/AAAAAAAADK0/z1_msnAuZ2k8QVjiepBLgnfK69DyZ7R5wCLcBGAs/s1600/reinvest.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-IRnbUEic0WI/W2jdal7mU9I/AAAAAAAADK0/z1_msnAuZ2k8QVjiepBLgnfK69DyZ7R5wCLcBGAs/s640/reinvest.png\" width=\"640\" height=\"480\" data-original-width=\"1000\" data-original-height=\"750\" /></a></div>That's interesting, as it shows us how the caps on balance sheet reduction work. When the FOMC set up the phaseout in its reinvestment program, it included specific caps (increasing over time as shown in the figure) for Treasuries and for MBS. The caps limit the quantity of assets that can mature without triggering some reinvestment. Ultimately, these caps won't bind in the near term for MBS, but you can see that they matter for Treasury securities. Intuitively, caps might seem reasonable. You can see in the figure that Treasury securities on the Fed's balance sheet mature in a rather lumpy fashion, so smoothing might appear to be an OK idea. Indeed, as Potter says:<br /><blockquote>The cap-based program to normalize the balance sheet...is the mechanism by which the decline in the balance sheet is kept to a gradual and predictable pace.</blockquote>But I'm wondering why this matters. The concern seems to be that if reserves fell by a large amount in a given month, this could be disruptive. Consider this though. Here's the Treasury's general account with the Fed:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-jbHO9j4colI/W2jfkvpcZiI/AAAAAAAADLA/xk3eNtMZRno3YHcQHBZr9Ab1vcmNbFiDgCLcBGAs/s1600/general%2Baccount.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-jbHO9j4colI/W2jfkvpcZiI/AAAAAAAADLA/xk3eNtMZRno3YHcQHBZr9Ab1vcmNbFiDgCLcBGAs/s640/general%2Baccount.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>Every time the balance in the Treasury's general account increases, reserves held in the private sector decrease by the same amount, everything else held constant. So, apparently reserves can move by two or three hundred billion dollars over a short time, and the Fed does not consider that disruptive, at the current time. So why do we need a cap on balance sheet reduction to prevent $20 or $30 billion of assets from running off? I think you could make a case that the caps are disruptive, as that means the Fed is engaging in on-again off-again purchases of on-the-run Treasury securities.<br /><br />Next, there's an issue concerning the recent reconfiguration in overnight interest rates that I discussed in <a href=\"http://newmonetarism.blogspot.com/2018/07/fed-balance-sheet-policy-and-treasury.html\">my previous post. </a> Basically, the FOMC set up a system of monetary policy implementation with a target range of 25 basis points for the fed funds rate, bounded by the interest rate on reserves (IOER) on the high side and the interest rate on reverse repurchase agreements issued by the Fed (the ON-RRP rate), on the low side. But recently, the fed funds rate has moved up very close to IOER, and overnight repo rates have moved up close to IOER as well. Further, other than at quarter-end, there is essentially no takeup for the Fed's ON-RRPs, so the ON-RRP facility has become irrelevant - basically that \"lower bound\" on the fed funds rate isn't bounding anything.<br /><br />What does Potter think is going on? Well, apparently he's sticking to the same story that appeared in the FOMC minutes for the June FOMC meeting, with some more details. That is,<blockquote>...a shift in flows in the Treasury market had the effect of pushing both Treasury bill yields and repo rates higher in February and March. Figure 6 shows cumulative net Treasury bill issuance since the beginning of last year, as well as projections through the third quarter of this year as reported by a private-sector forecaster. The substantial run-up in net bill issuance over the past few quarters, along with other factors, contributed to notable growth in securities dealers’ inventory of Treasury securities, shown in Figure 7—inventories that likely required financing in the repo market.</blockquote>Here's Figure 6, so you can see what he's referring to:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-0NYtsNP7XHw/W2jkN6bMlgI/AAAAAAAADLM/EMLPyQr7dQkWY-khOY6LvO4nGuXlPjvEwCLcBGAs/s1600/bill%2Bissuance.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://3.bp.blogspot.com/-0NYtsNP7XHw/W2jkN6bMlgI/AAAAAAAADLM/EMLPyQr7dQkWY-khOY6LvO4nGuXlPjvEwCLcBGAs/s640/bill%2Bissuance.png\" width=\"640\" height=\"480\" data-original-width=\"1000\" data-original-height=\"750\" /></a></div>So, Potter's claiming that the reason that overnight rates tightened up around IOER is that there was a (possibly temporary) increase in the supply of Treasury bills, which increased the quantity of collateral available in repo markets, thus expanding the supply of overnight credit.<br /><br />I'm not sure what to make of that argument, so I thought I would look at more details of Treasury issuance, and the composition of outstanding Treasury debt. Here's annual data on Treasury bills, notes, and bonds. If you're not familiar with the terminology, bills are 1-year maturity and less, notes are 2, 3, 5, and 10-year securities, and bonds are anything exceeding 10 years. <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-bcmtflX4qdk/W2jl2KrnEpI/AAAAAAAADLc/EybQZcI5QGA7-QhYUj-ZcG9UwzrG0XgWACLcBGAs/s1600/outstanding.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://3.bp.blogspot.com/-bcmtflX4qdk/W2jl2KrnEpI/AAAAAAAADLc/EybQZcI5QGA7-QhYUj-ZcG9UwzrG0XgWACLcBGAs/s640/outstanding.png\" width=\"640\" height=\"512\" data-original-width=\"1048\" data-original-height=\"839\" /></a></div>That data goes up to 2017, but currently the stock of bills outstanding is about $2.2 trillion, the stock of notes is over $9 trillion, and the stock of bonds is about $2 trillion. And that's a big difference from before the financial crisis - the average maturity of outstanding Treasury debt has increased considerably. Indeed, at the same time the Fed was attempting to reduce the average maturity of consolidated government debt outstanding, the Treasury was increasing it. So, a back-of-the-envelope calculation is that the Fed purchased about $3.75 trillion in long-maturity assets from before the recession through the end of 2014. From the last chart, it looks like those purchases were more than offset, in terms of average maturity of the outstanding debt, by what the Treasury was doing. So, if people try to tell you that QE worked in practice because it reduced the average maturity of Treasuries outstanding, that can't be correct - the combined effect of Treasury/Fed debt management was to lengthen average maturity. This point has been made by others - John Cochrane in particular I think - at least concerning an earlier period.<br /><br />But the fact that the Fed's QE programs were not working the way Ben Bernanke envisioned - by reducing average maturity of the consolidated government debt outstanding - doesn't mean that these purchases didn't do something. Large scale asset purchases can have detrimental effects simply by replacing Treasury securities (useful collateral) with reserves, which are not so useful, at least as overnight assets. And flows seem to be important, as on-the-run Treasury securities are apparently a key form of collateral in repo markets.<br /><br />We should check on the net flows of Treasury issuance, by type security. To provide some smoothing, I'll take 6-month moving averages:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-9GEsDU0tji0/W2jqVC35gaI/AAAAAAAADLs/o9gzMdG0jJA23vraByZHnlwFWshShil4gCLcBGAs/s1600/netissue.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-9GEsDU0tji0/W2jqVC35gaI/AAAAAAAADLs/o9gzMdG0jJA23vraByZHnlwFWshShil4gCLcBGAs/s640/netissue.png\" width=\"640\" height=\"513\" data-original-width=\"1045\" data-original-height=\"837\" /></a></div>Total net issuance of Treasuries will of course tend to move with the federal government deficit:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-S8Fq8ycSgdw/W2jq7fKpBPI/AAAAAAAADL0/cYpjwd34k9AZy5CH7VLcXZeS0yBkGDV_ACLcBGAs/s1600/deficit.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://3.bp.blogspot.com/-S8Fq8ycSgdw/W2jq7fKpBPI/AAAAAAAADL0/cYpjwd34k9AZy5CH7VLcXZeS0yBkGDV_ACLcBGAs/s640/deficit.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>But the deficit numbers are seasonally adjusted. Part of what the debt managers in the Treasury department do is to smooth out effects due to lumpy incoming revenue by using Treasury bill issues as a buffer. For example, every February and March there are typically large issues of T-bills, which are then retired when you pay your income taxes in April. Thus, you can see in the second to last chart that T-bill issues (even though I've used moving averages) are quite volatile relative to notes and bonds. Net T-bill issuance has indeed been increasing on trend recently, but as I noted in my previous post, there's nothing so unusual about total net Treasury issuance, and good reasons to think that there's strong, if not increasing, demand for Treasuries in the market, in part due to regulatory reasons.<br /><br />So, I'm inclined to think that it's the change in the Fed's reinvestment policy that's to blame for the tightening up in overnight interest rates - I don't think it's the Treasury's fault. But why won't the Fed admit it? Because it doesn't fit their narrative. QE was sold as a good thing - Bernanke claimed it would flatten the yield curve, reduce long bond yields, and increase spending. But it appears that QE may have sucked good collateral out of markets for secured overnight credit, thus reducing overnight secured rates relative to overnight unsecured rates. There's nothing good about that - it just reflects inefficiency.<br /><br />Finally, Potter discusses what he calls a \"technical adjustment\" in administered interest rates. The range for the fed funds rate is 1.75%-2%, but currently the ON-RRP rate is set at 1.75%, and IOER at 1.95%, as there appeared to be some worry that the fed funds rate would trade above the stated range. Here's what's happened since the June meeting to the key overnight rates:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-CNsBAiHE7Wk/W2jvaK34YBI/AAAAAAAADMA/G71TRJEaApU5sxJe_mvXeky5fdZvY8uFgCLcBGAs/s1600/overnight.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-CNsBAiHE7Wk/W2jvaK34YBI/AAAAAAAADMA/G71TRJEaApU5sxJe_mvXeky5fdZvY8uFgCLcBGAs/s640/overnight.png\" width=\"640\" height=\"517\" data-original-width=\"984\" data-original-height=\"795\" /></a></div>As you can see, the fed funds rate has settled in at four basis points below IOER, basically the narrowest persistent spread observed since interest rate hikes began in late 2015. But, in terms of control over the Fed's target interest rate, this looks like a big success. Under the current operating procedure the New York Fed can nail the fed funds rate target. The unexpected feature here, which Potter doesn't comment on, is that the ON-RRP program is irrelevant - the IOER is doing all the work.<br /><br />An interesting feature of the last chart is that the repo rate, while much closer than it was to IOER and the fed funds rate, does not track IOER closely. That's a puzzle to me as, in other countries where central banks target a repo rate, for example in Canada, the interest rate on reserves essentially pegs the overnight repo rate (e.g. Spring 2009 to Spring 2010 in Canada) with a floor system.<br /><br />Potter comments on the reasons for the \"technical adjustment\" of setting IOER five basis points below the upper bound on the fed funds target range:<br /><blockquote>The target range is an important feature of the FOMC’s public communications, and maintaining federal funds rates within it is therefore taken quite seriously. Public confidence in our ability to maintain rates within the target range is important for ensuring that expectations for the FOMC’s future policy stance are properly incorporated into the term structure of interest rates, and thereby appropriately affect financial conditions and the broader economy.</blockquote>For me, the public confidence issue of whether the fed funds rate might exceed the top of the range by a few basis points is a minor one compared to what I've been discussing. No one in the Fed System, including the guy who implements monetary policy, can give a convincing story about why the whole target range approach still makes any sense, why the ON-RRP facility is now irrelevant, and why IOER, overnight repo rates, and the fed funds rate are now about the same. I'm feeling somewhat underconfident, and look forward to being enlightened.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Stephen Williamson",
    "uri": "http://www.blogger.com/profile/01434465858419028592",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 2
}