{
  "title": "#478: How MuggleNet Created a Harry Potter Encyclopedia",
  "link": "https://audioboom.com/posts/7659881",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3502,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Welcome to the show Marissa, co-author of <a href=\"https://www.mugglenet.com/2020/06/the-unofficial-harry-potter-character-compendium-is-mugglenets-first-book-in-over-a-decade-get-yours-now/\">MuggleNet's new Character Compendium</a>, available now in bookstores everywhere!</li>\n<li>MuggleMail has Umbridge fever! An e-mail from Matt suggests actress Olivia Coleman for the future role of Umbridge in a Harry Potter TV series! <a href=\"https://www.youtube.com/watch?v=Jd3r_Id78ck\">Here is a highlight reel</a> for your consideration.</li>\n<li>Should MuggleCast make Umbridge pillows that you can punch? And, finally, a mention of Umbridge from <em>Half-Blood Prince</em> is brought to our attention.</li>\n<li>In our Main Discussion, we ask Marissa about the creation of <a href=\"https://amzn.to/3kP0ibP\"><em>The Unofficial Harry Potter Character Compendium: MuggleNet's Ultimate Guide to Who's Who in the Wizarding World</em></a>. How did this book come about, how did they gather information on over 700 characters, and which characters stood out to her in her research?!</li>\n<li>Special sections in the Barnes & Noble edition discuss MuggleNet's favorite non-canon characters, and who is the REAL hero of the Harry Potter series?</li>\n<li>What is the role of a fan site in 2020? We discuss the early days of MuggleNet and where it stands today</li>\n<li>The hosts play <em>GUESS. THAT. CHARACTER!</em>\n</li>\n<li>Quizzitch: What is Daisy Pennifold known for?</li>\n<li>This week's episode is sponsored by Quip! Visit <a href=\"https://getquip.com/muggle\">GetQuip.com/muggle</a> and get your first refill FREE.</li>\n<li>Join our community at <a href=\"http://www.patreon.com/mugglecast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 18 Aug 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-08-17:/posts/7659881",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}