{
  "id": "tag:blogger.com,1999:blog-1176949257541686127.post-2170097726716362650",
  "published": "2022-05-11T14:00:00.004-04:00",
  "updated": "2022-05-11T15:36:41.904-04:00",
  "title": "Taking on the Next Generation of Phishing Scams",
  "content": "<span class=\"byline-author\">Posted by Daniel Margolis, Software Engineer, Google Account Security Team</span>&nbsp;<br /><br />Every year, security technologies improve: <a href=\"https://www.google.com/chrome/security/\">browsers get better</a>, <a href=\"https://transparencyreport.google.com/https/overview?hl=en\">encryption becomes ubiquitous on the Web</a>, authentication becomes stronger. But phishing persistently remains a threat (as shown by <a href=\"https://www.techrepublic.com/article/phishing-attack-spoofs-us-department-of-labor-to-steal-account-credentials/\">a recent phishing attack on the U.S. Department of Labor</a>) because users retain the ability to log into their online accounts, often with a simple password, from anywhere in the world. It’s why today <a href=\"https://blog.google/technology/safety-security/io-safer-with-google/\">at I/O we announced</a> new ways we’re reducing the risks of phishing by: scaling phishing protections to Google Docs, Sheets and Slides, continuing to auto enroll people in 2-Step Verification and more. This blog will deep dive into the method of phishing and how it has evolved today. <br /><br />As phishing adoption has grown, multi-factor authentication has become a particular focus for attackers. In some cases, attackers phish SMS codes directly, by following a legitimate \"one-time passcode\" (triggered by the attacker trying to log into the victim's account) with a spoofed message asking the victim to \"reply back with the code you just received.” <div><br /></div><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><span id=\"docs-internal-guid-d336c65d-7fff-2523-0bc6-6857d58fddc2\"><span style=\"font-family: Arial; font-size: 11pt; font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\"><span style=\"border: none; display: inline-block; height: 261px; overflow: hidden; width: 598px;\"><img height=\"261\" src=\"https://lh3.googleusercontent.com/3_JG4oFsxf0ckmkhGsng8MKKL6v7zp82C9X6BN61-cA-asXYu-k_ypFcNcyA3QM-baUy3jcsWWqaOsnThDOlrFGX7tPZpLnwZVSf19eCHLddK6EfBgAdZfipEWI7mT0loyJQxuuPdlj0ANjPtxS1nU6k5pja39cn34iQBzcZYOlP8C4GyFlXVVHuLKp1eg\" style=\"margin-left: 0px; margin-top: 0px;\" width=\"598\" /></span></span></span></div><br /></div><div class=\"separator\" style=\"clear: both;\"><span id=\"docs-internal-guid-e9f84392-7fff-27c5-459e-e465cf40d6ac\"><p dir=\"ltr\" style=\"line-height: 1.38; margin-bottom: 0pt; margin-left: 36pt; margin-top: 0pt;\"><i><span style=\"font-family: Arial; font-size: 11pt; font-variant-east-asian: normal; font-variant-numeric: normal; font-weight: 700; vertical-align: baseline; white-space: pre-wrap;\">Left: </span><span style=\"font-family: Arial; font-size: 11pt; font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\">legitimate Google SMS verification. </span><span style=\"font-family: Arial; font-size: 11pt; font-variant-east-asian: normal; font-variant-numeric: normal; font-weight: 700; vertical-align: baseline; white-space: pre-wrap;\">Right: </span><span style=\"font-family: Arial; font-size: 11pt; font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\">spoofed message asking victim to share verification code.</span></i></p><br />In other cases, attackers have leveraged more sophisticated dynamic phishing pages to conduct relay attacks. In these attacks, a user thinks they're logging into the intended site, just as in a standard phishing attack. But instead of deploying a simple static phishing page that saves the victim's email and password when the victim tries to login, the phisher has deployed a web service that logs into the actual website at the same time the user is falling for the phishing page.<br /><br />The simplest approach is an almost off-the-shelf \"reverse proxy\" which acts as a \"person in the middle\", forwarding the victim's inputs to the legitimate page and sending the response from the legitimate page back to the victim's browser. </span></div><div class=\"separator\" style=\"clear: both;\"><span><br /></span></div><div><br /></div><span id=\"docs-internal-guid-117dac65-7fff-c183-8ef7-5d6fe6c12956\"><div style=\"text-align: center;\"><img height=\"282\" src=\"https://lh4.googleusercontent.com/Udpuz-nCz_0KBw03t-cDZpTOuKykjFPeepnKIFQbLFZg4_zJtU31YADObLIfesVQbY3rQcO60cJhOHQUGHEeWif8bSyNBl9R7KyDg7llvLlNnWZ2RrLdU4Gb1SYkL1mP8ZuCb4d5a-MIoj1mSfdk92gYZEsOZUdHBOpgi26ybluj_iGzy0osmVFeYWu8XA=w640-h282\" style=\"font-family: Arial; font-size: 11pt; margin-left: 0px; margin-top: 0px; white-space: pre-wrap;\" width=\"640\" /></div></span></div><br />These attacks are especially challenging to prevent because additional authentication challenges shown to the attacker—like a prompt for an SMS code—are also relayed to the victim, and the victim's response is in turn relayed back to the real website. In this way, the attacker can count on their victim to solve any authentication challenge presented.<br /><br />Traditional multi-factor authentication with PIN codes can only do so much against these attacks, and authentication with smartphone approvals via a prompt — while more secure against SIM-swap attacks — is still vulnerable to this sort of real-time interception.<br /><br /><div><b>The Solution Space</b><br /><br />Over the past year, we've <a href=\"https://blog.google/technology/safety-security/making-sign-safer-and-more-convenient/\">started to automatically enable device-based two-factor authentication</a> for our users. This authentication not only helps protect against traditional password compromise but, with technology improvements, we can also use it to help defend against these more sophisticated forms of phishing.<br /><br />Taking a broad view, most efforts to protect and defend against phishing fall into the following categories:</div><ul style=\"text-align: left;\"><li><a href=\"https://dev.chromium.org/Home/chromium-security/enamel\">Browser UI improvements</a> to help users identify authentic websites.</li><li><a href=\"https://support.google.com/accounts/answer/6208650?hl=en\">Password managers</a> that can validate the identity of the web page before logging in.</li><li>Phishing detection, both in <a href=\"https://safety.google/gmail/\">email</a>—the most common delivery channel—and in the <a href=\"https://safebrowsing.google.com/\">browser</a> itself, to warn users about suspicious web pages.</li><li>Preventing the person-in-the-middle attacks mentioned above by <a href=\"https://security.googleblog.com/2019/04/better-protection-against-man-in-middle.html\">preventing automated login attempts</a>.</li><li>Phishing-resistant authentication using <a href=\"https://fidoalliance.org/how-fido-works/\">FIDO</a> with security keys or a Bluetooth connection to your phone.</li><li>Hardening the Google Prompt challenge to help users identify suspicious sign-in attempts, or to ask them to take additional steps that can defeat phishing (like navigating to a new web address, or to join the same wireless network as the computer they're logging into).</li></ul><b><br />Expanding phishing-resistant authentication to more users</b><br /><br />Over the last decade we’ve been working hard with a number of industry partners on expanding phishing-resistant authentication mechanisms, as part of <a href=\"https://fidoalliance.org/\">FIDO Alliance</a>. Through these efforts we introduced physical FIDO security keys, such as the <a href=\"https://store.google.com/product/titan_security_key\">Titan Security Key</a>, which prevent phishing by verifying the identity of the website you're logging into. (This verification protects against the \"person-in-the-middle\"  phishing described above.) Recently, we <a href=\"https://blog.google/technology/safety-security/one-step-closer-to-a-passwordless-future/\">announced</a> a major milestone with the FIDO Alliance, Apple and Microsoft by expanding our support for the FIDO Sign-in standards, helping to launch us into a truly passwordless, phishing-resistant future.<br /><br />Even though security keys work great, we don't expect everyone to add one to their keyring.<div><br /></div><div style=\"text-align: center;\"><span id=\"docs-internal-guid-07ca03a2-7fff-c86b-7b62-942de06fca4b\"><span style=\"font-family: Arial; font-size: 11pt; font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\"><span style=\"border: none; display: inline-block; height: 292px; overflow: hidden; width: 187px;\"><img height=\"292\" src=\"https://lh5.googleusercontent.com/mfA6Tdirh69yBDEWZ8Rg_T2mJTJLkWRyPZ1P9gZ6e7IZsVC1fCSeDzxtesmgZPailMYzd4GHRJc5s0Lh2VPm8gg24tPWUJB5UDFCH2bcYBUHoPo6yPRAW3I-H3iu4FKi17XwIQlG-9MnxQ7yA9CrSt8uNobMG5USw3b1Dd_ef9-C8YZbmzXhx-0Irfnj8A\" style=\"margin-left: 0px; margin-top: 0px;\" width=\"187\" /></span></span></span></div><br /><br />Instead, to make this level of security more accessible, we're building it into mobile phones. Unlike physical FIDO security keys that need to be connected to your device via USB, we use Bluetooth to ensure your phone is close to the device you're logging into. Like physical security keys, this helps prevent a distant attacker from tricking you into approving a sign-in on their browser, giving us an added layer of security against the kind of \"person in the middle\" attacks that can still work against SMS or Google Prompt.<br /><br />(<a href=\"https://blog.google/technology/safety-security/security-myth-busting-and-spring-cleaning/\">But don't worry</a>: this doesn't allow computers within Bluetooth range to login as you—it only grants that approval to the computer you're logging into. And we only use this to verify that your phone is near the device you're logging into, so you only need to have Bluetooth on during login.)<br /><br />Over the next couple of months we’ll be rolling out this technology in more places, which you might notice as a request for you to enable Bluetooth while logging in, so we can perform this additional security check. If you've signed into your Google account on your Android phone, we can enroll your phone automatically—just like with Google Prompt—allowing us to give this added layer of security to many of our users without the need for any additional setup.<br /><br />But unfortunately this secure login doesn't work everywhere—for example, when logging into a computer that doesn't support Bluetooth, or a browser that doesn't support security keys. That's why, if we are to offer phishing-resistant security to everyone, we have to offer backups when security keys aren't available—and those backups must also be secure enough to prevent attackers from taking advantage of them.<div><b><br /></b></div><b><div><b><br /></b></div>Hardening existing challenges against phishin</b>g<br /><br />Over the past few months, we've started experimenting with making our traditional Google Prompt challenges more phishing resistant.<br /><br />We already use different challenge experiences depending on the situation—for example, sometimes we ask the user to match a PIN code with what they're seeing on the screen in addition to clicking \"allow\" or \"deny\". This can help prevent static phishing pages from tricking you into approving a challenge.<br /><br />We've also begun experimenting with more involved challenges for higher-risk situations, including more prominent warnings when we see you logging in from a computer that we think might belong to a phisher, or asking you to join your phone to the same Wi-Fi network as the computer you're logging into so we can be sure the two are near each other. Similar to our use of Bluetooth for Security Keys, this prevents an attacker from tricking you into logging into a \"person-in-the-middle\" phishing page.<div><br /></div><div><span><b><br /></b></span></div><div><span id=\"docs-internal-guid-8260b069-7fff-359e-1f66-97166e03f387\"><b>Bringing it all together</b></span></div><br />Of course, while all of these options dramatically increase account security, we also know that they can be a challenge for some of our users, which is why we're rolling them out gradually, as part of a risk-based approach that also focuses on usability. If we think an account is at a higher risk, or if we see abnormal behavior, we're more likely to use these additional security measures.<br /><br />Over time, as FIDO2 authentication becomes more widely available, we expect to be able to make it the default for many of our users, and to rely on stronger versions of our existing challenges like those described above to provide secure fallbacks.<br /><br />All these new tools in our toolbox—detecting browser automation to prevent \"person in the middle\" attacks, warning users in Chrome and Gmail, making the Google Prompt more secure, and automatically enabling Android phones as easy-to-use Security Keys—work together to allow us to better protect our users against phishing.<br /><br />Phishing attacks have long been seen as a persistent threat, but these recent developments give us the ability to really move the needle and help more of our users stay safer online.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Unknown",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}