{
  "title": "133: Gringo: The Dangerous Life of John McAfee",
  "link": "https://audioboom.com/posts/7585545",
  "itunes:episode": 133,
  "itunes:title": "Gringo: The Dangerous Life of John McAfee",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3186,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>YOU GUYS, DO YOU HAVE A PC? I PROMISE I WON’T TELL GILLIAN? <em>Gringo</em> tells the story of John McAfee who invented anti-virus software, AND AS BORING AS THAT SOUNDS, I PROMISE THIS IS ANYTHING BUT! He owned that software company for, like, two weeks, got bought out, and relocated to Belize. There, he devolved into a SUPER-PARANOID, UBER-RICK lunatic. He gets mixed up in drug trafficking, sex offender shit, AND MURDERS HIS NEXT DOOR NEIGHBOR. Ugh, it’s a lot. OH, and he absconds to Guatemala…and the Guatemalans are PISSSSSSSSSED about it. <br>\n<br>\n\n</div>\n<div>Then he comes back to the US and runs for President. Because, of course. <br>\n<br>\n<a href=\"https://www.disappearedpod.com/podcast/episode/5096dd2f/1-obsessed-with-disappeared-preview\"><strong>FAM! THE PREVIEW FOR OUR NEXT ORIGINAL PODCAST IS LIVE! </strong></a>Come check out the preview for \"Obsessed With: Disappeared.\" It's a true crime / comedy podcast hosted by Patrick Hinds and Ellyn Marsh--best friends of 20 years. Going in order, Patrick and Ellyn recap episodes of ID's \"Disappeared.\" We launch on May 27th, <strong>BUT WE'D LOVE FOR YOU TO LISTEN TO THE PREVIEW AND SUBSCRIBE NOW!</strong> <a href=\"https://www.disappearedpod.com/podcast/episode/5096dd2f/1-obsessed-with-disappeared-preview\"><strong>Go here!</strong></a><strong><br>\n<br>\nLOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 19 May 2020 04:01:00 +0000",
  "guid": "tag:audioboom.com,2020-05-19:/posts/7585545",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}