{
  "title": "A Way for Biden to Help Black People",
  "description": "<p>Last week, President Biden <a href=\"https://twitter.com/FreeBeacon/status/1585293597796360194?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1585293597796360194%7Ctwgr%5E8a462f8fbc5ab8643632cb173d27a4811e9bfff5%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fviewfromthewing.com%2Fpresident-biden-charging-for-extra-legroom-seats-after-ticket-purchase-is-racist%2F\">said</a>:</p>\n<blockquote><p>Some airlines, if you want six more inches between you and the seat in front, you pay more money but you don&#8217;t know it until you purchase your ticket. Look, folks, these are junk fees, they&#8217;re unfair and they hit marginalized Americans the hardest, especially low-income folks and people of color.</p></blockquote>\n<p>Actually, I just flew on Thursday and Monday, and I purchased more leg room. It felt closer to 3 inches than 6 inches, but whatever it was made a big difference. You actually do know it before you purchase your ticket. Indeed, the airlines make it quite obvious. Why doesn&#8217;t Biden know that? Could it be that he hasn&#8217;t purchased an airline ticket in a long time? Just a hunch.</p>\n<p>How are they unfair? They give people a choice. Lower-income people who, I presume he&#8217;s saying, value leg room less, can pay less. How does that hit marginalized Americans? Actually, I think it helps. The reason is that the payment for those extra 3 inches, multiplied over all the passengers who pay it on a given flight, more than makes up for the lost revenue from the extra seats the airline could have had, or else the airlines wouldn&#8217;t do it. If so, this helps marginalized Americans because the airline makes more money on the flight with more legroom. The airline needs to make a certain amount of revenue to justify a flight. There will be more flights and, therefore, more seats.</p>\n<p>So Biden can help marginalized Americans by withdrawing his statement.</p>\n<div class=\"block-quote\">\n<div class=\"pull-quote-blue\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-62150\" src=\"https://www.econlib.org/wp-content/uploads/2022/11/Unknown-2.jpeg\" alt=\"\" width=\"92\" height=\"92\" /></div>\n</div>\n<p>There&#8217;s a specific way he can disproportionately help black Americans: get the Food and Drug Administration to back off from its proposal to ban menthol cigarettes. The Harvard School of Public Health <a href=\"https://www.hsph.harvard.edu/news/hsph-in-the-news/fda-ban-menthol-cigarettes-flavored-cigars/\">states</a>:</p>\n<blockquote><p>Manufacturers have long targeted Black Americans with advertisements for menthol cigarettes, which remain the overwhelming preference among Black smokers. Although they smoke at similar rates as the general population, Black smokers experience greater health consequences from the habit. This has been linked in part to their higher consumption of menthol cigarettes.</p></blockquote>\n<p>Manufacturers tend to &#8220;target&#8221; people who want their product. The FDA is proposing to target black Americans by banning the product. If your view is that people&#8217;s preferences don&#8217;t count and that the government should prevent people from doing something that harms them, then you could conclude that the FDA is helping them. But if your view is that people should be allowed to consume even things that harm them, especially when they know, as pretty much everyone does, that cigarettes harm those who smoke them long-term, then you would conclude that the FDA is hurting them.</p>\n<p>My view is the latter.</p>\n<p>&nbsp;</p>\n(4 COMMENTS)",
  "link": "https://www.econlib.org/a-way-for-biden-to-help-black-people/",
  "guid": "https://www.econlib.org/a-way-for-biden-to-help-black-people/",
  "category": [
    "Regulation",
    "Revealed Preference",
    "airline seats",
    "cigarettes",
    "Joe Biden",
    "menthol cigarettes"
  ],
  "pubDate": "Wed, 02 Nov 2022 12:00:23 +0000"
}