{
  "title": "Orbital liquid in the $e_g$ orbital Hubbard model in $d=\\infty$ dimensions. (arXiv:2211.01884v1 [cond-mat.str-el])",
  "link": "http://arxiv.org/abs/2211.01884",
  "description": "<p>We demonstrate that the three-dimensional $e_g$ orbital Hubbard model can be\ngeneralized to arbitrary dimension $d$, and that the form of the result is\ndetermined uniquely by the requirements that\n</p>\n<p>(i) the two-fold degeneracy of the $e_g$ orbital be retained, and (ii) the\ncubic lattice be turned into a hypercubic lattice. While the local Coulomb\ninteraction $U$ is invariant for each basis of orthogonal orbitals, the form of\nthe kinetic energy depends on the orbital basis and takes the most symmetric\nform for the so-called complex-orbital basis. Characteristically, with respect\nto this basis, the model has two hopping channels, one that is orbital-flavor\nconserving, and a second one that is orbital-flavor non-conserving. We show\nthat the noninteracting electronic structure consists of two nondegenerate\nbands of plane-wave real-orbital single-particle states for which the orbital\ndepends on the wave vector. Due to the latter feature each band is unpolarized\nat any filling, and has a non-Gaussian density of states at $d=\\infty$. The\n\\textit{orbital liquid} state is obtained by filling these two bands up to the\nsame Fermi energy. We investigate the $e_g$ orbital Hubbard model in the limit\n$d\\to\\infty$, treating the on-site Coulomb interaction $U$ within the\nGutzwiller approximation, thus determining the correlation energy of the\norbital liquid and the (disordered) para-orbital states. (...) We show that the\norbital liquid is the ground state everywhere in the $(n,U)$ phase diagram\nexcept close to half-filling at sufficiently large $U$, where ferro-orbital\norder with real orbitals occupied is favored. The latter feature is shown to be\nspecific for $d=\\infty$, being of mathematical nature due to the exponential\ntails in the density of states.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Feiner_L/0/1/0/all/0/1\">Louis Felix Feiner</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Oles_A/0/1/0/all/0/1\">Andrzej M. Ole&#x15b;</a>"
}