{
  "title": "EPISODE 72: John Brown (Part 3): Violent Delights, Violent Ends",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Fri, 26 Mar 2021 15:48:26 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2021/3/26/episode-72-john-brown-part-3-violent-delights-violent-ends",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:605e015cba0c476bd243545c",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1616773668522-K3PHHDXUVBBIMEEE080J/HOF-72-JohnBrown-III.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"HOF-72-JohnBrown-III.jpg\" data-load=\"false\" data-image-id=\"605e0223a13c0b5976b14f3d\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1616773668522-K3PHHDXUVBBIMEEE080J/HOF-72-JohnBrown-III.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“I, John Brown, am now quite certain that the crimes of this guilty land will never be purged away but with blood.”</em> — John Brown&nbsp;</p><p class=\"\"><em>“If you seek my blood, you can have it at any moment without the mockery of a trial.” —</em> John Brown&nbsp;</p><p class=\"\"><em>“John Brown, and a thousand John Browns, can invade us, and the Government will not protect us. To secure our rights and protect our honor we will dissever the ties that bind us together, even if it rushes us into a sea of blood.\" —</em> Mississippi congressman Reuben Davis</p><p class=\"\"><em>“John Brown began the war that ended American slavery and made this a free Republic.”</em> — Frederick Douglass&nbsp;</p><p class=\"\"><em>\"I looked at the traitor with unlimited, undeniable contempt.\"</em> — John Wilkes Booth</p><p class=\"\"><em>“He done more in dying than 100 men would in living.”</em> — Harriet Tubman&nbsp;</p><p class=\"\"><em>“Dear Husband, I want you to buy me as soon as possible for if you do not get me somebody else will. The servants are very disagreeable. They do all that they can to set my mistress against me. Dear Husband, you do not see the trouble I see the last two years. It has been like a troubled dream to me. It is said, Master is in want of money. If so, I know not what time he may sell me and then all my bright hopes of the future are blasted. For there has been one bright hope to cheer me in all my troubles, that is to be with you. For if I thought I should never see you this earth would have no charms for me. Do all you can for me, which I have no doubt you will. I want to see you so much, the children are all well. The baby cannot walk, yet, all it can do is step around everything by holding on. It is very much like Agnes. I must bring my letter to close, as I have no more news to write. You must write soon and say when you think you can come. Your affectionate wife, Harriet Newby.”</em></p><p class=\"\"><em>“I believe I’ll go with the old man.”</em> — Shields Green</p><p class=\"\"><em>“Had I interfered in the manner which I admit… in behalf of the rich, the powerful… the so-called great… every man in this Court would have deemed it an act worthy of reward rather than punishment.”</em> — John Brown&nbsp;</p><p class=\"\"><em>\"I am quite cheerful in view of my approaching end, being fully persuaded that I am worth inconceivably more to hang than for any other purpose.” “I can recover all the lost capital by only hanging a few moments by the neck...”&nbsp;</em></p><p class=\"\">The subject of this series is easily one of the most divisive individuals in U.S. history. The man we are talking about is Mr. John Brown. Many, in fact, see Brown’s actions as the spark that ignited the Civil War. He has been described as a civil rights hero, a terrorist, and everything in between. Some have argued he was clinically insane. Others believe he was the most principled man of his age. Regardless of how we interpret his story, certain facts are beyond dispute. Throughout his life, slavery was the law of the land in much of the United States. With hardly any abolitionist willing to do more than use words against slavery, while pro-slavery forces demonstrated they were quite skilled at using violence to further their worldview, it seemed inevitable that slavery would last for the foreseeable future. To John Brown, that was an unacceptable option. Allowing it to continue for one more second was cowardly and evil.&nbsp; If pacifist means weren’t enough to bring about the end of slavery, then John Brown was more than ready to speak the language of violence. For the sake of destroying slavery, he would shed the blood of his enemies, the blood of his family, and his own blood.&nbsp;</p><p class=\"\">In this final episode of this series, we’ll cover: John Brown’s meeting with Harriet Tubman, a raid to free slaves and bring them to Canada, the loyalty of Shields Green, Dangerfield Newby dying to save his family, the attack on Harpers Ferry, stealing George Washington’s sword, drunkards shooting corpses, Silas Soule’s jailbreaking skills, the trial of John Brown, the dangers posed by Zombie John Brown, guest appearances by Robert E. Lee, Stonewall Jackson, John Wilkes Booth and Jeb Stuart, and much more.</p>",
  "media:content": {
    "media:title": "EPISODE 72: John Brown (Part 3): Violent Delights, Violent Ends"
  }
}