{
  "id": "tag:blogger.com,1999:blog-1747027701196237068.post-54110087067984288",
  "published": "2021-12-16T10:06:00.003-05:00",
  "updated": "2021-12-16T10:12:17.843-05:00",
  "title": "20 years of Google in Canada",
  "content": "<div class=\"separator\" style=\"clear: both; text-align: center;\"><iframe allowfullscreen=\"\" class=\"BLOG_video_class\" height=\"354\" src=\"https://www.youtube.com/embed/DKDGJMoR7BU\" width=\"426\" youtube-src-id=\"DKDGJMoR7BU\"></iframe></div><br /><div><br /></div>It’s 2001 and Nickelback’s “How You Remind Me” is blaring from car radios, Drake made his debut on “Degrassi: The Next Generation”, we were all recovering from the shock of 9/11.  And Harry Potter first appeared on movie screens giving us the license to believe in magic. Chris Hadfield was the first Canadian to do a space walk. And yet, we could only take fuzzy, grainy photos with our cell phones.&nbsp;<div><br /></div><div>Twenty years later, the world has changed, online and off. The Harry Potter crew are no longer children and we’ve moved from Nickelback to The Weeknd. The hit musical Come from Away is returning to the stage to remind us that human connection and kindness still define us as Canadians. And wow, can we ever take a high quality photo with our new cell phones (especially with the <a href=\"https://blog.google/products/pixel/meet-pixel-6-pixel-6-pro/\" rel=\"nofollow\" target=\"_blank\">Pixel</a>, naturally).&nbsp;</div><div><br /></div><div>Google Canada has changed, too. This month marks the 20th anniversary of Google’s arrival in Canada. And if you don’t remember the pomp and circumstance around the event, it’s because there wasn’t any.&nbsp;</div><div><br /></div><div>Google Canada began with a single hire in a small workspace in Toronto in 2001 and a few short years later, Google opened its Montréal office.  In 2005, Google set up shop in Canada’s technology hub, Waterloo, Ontario, and over the years we have become a part of the Waterloo region technology community, contributing volunteer hours to STEM education programs and hiring engineers to build Google products that Canadians and people around the world use every day. And now, Google Canada is home to more than 2,500 employees.&nbsp;</div><div><br /></div><div>We’ve had our share of adventures - <a href=\"https://blog.google/products/maps/building-map-canadas-north/\">bringing maps to the north</a>, <a href=\"https://toronto.ctvnews.ca/google-canada-commits-1-million-to-help-small-businesses-get-online-during-covid-19-1.4957995\" rel=\"nofollow\" target=\"_blank\">helping Canadian businesses tap into the digital economy</a>, opening Cloud regions in <a href=\"https://cloud.google.com/blog/products/gcp/gcp-arrives-in-canada-with-launch-of-montreal-region\" rel=\"nofollow\" target=\"_blank\">Montréal</a> and <a href=\"https://cloud.google.com/blog/products/infrastructure/google-cloud-toronto-region-now-open\" rel=\"nofollow\" target=\"_blank\">Toronto</a> to serve Canadian businesses, <a href=\"https://www.youtube.com/playlist?list=PL2zzFmCbIz4ehThTV07s_znCL1x-v9evv\" rel=\"nofollow\" target=\"_blank\">introducing the world to Canadian creators on YouTube</a> and <a href=\"https://canada.googleblog.com/2020/02/\" rel=\"nofollow\" target=\"_blank\">building new offices in Waterloo, Toronto and Montréal</a>. For the past twenty years, we’ve been fortunate enough to help Canadians search, grow and connect to the world around them using Google products and services.&nbsp;</div><div><br /></div><div><b>Creating opportunity for all Canadians</b>&nbsp;</div><div>During our time here, Google Canada has been investing in the communities where we live and work, through Google.org Community Grants, Google for Startups Accelerator programs, and investments in digital skills training. Over the last 20 years, Google has invested $25 million in Canadian non profits, looking to expand economic opportunity and to help Canadians learn new skills, through commitments to organizations like <a href=\"https://canada.googleblog.com/2021/05/creating-onramp-to-jobs-in-canada-with.html\" rel=\"nofollow\" target=\"_blank\">NPower Canada</a> and <a href=\"https://canada.googleblog.com/2021/12/our-600000-commitment-to-reskill.html\" rel=\"nofollow\" target=\"_blank\">ComIT</a>.&nbsp;</div><div><br /></div><div>And we have a long history of working closely with community partners and organizations across Canada to make STEM programs accessible to all students. In 2021, we reached more than 200,000 Canadian learners through STEM outreach and we trained approximately 4,000 educators in CS First. Our STEM and CS First outreach is orchestrated by Google Canada in conjunction with <a href=\"https://cobblestonecollective.ca/\" rel=\"nofollow\" target=\"_blank\">The Cobblestone Collective</a> and supplemented by our Google Canada volunteers to support their local communities.&nbsp;</div><div><br /></div><div>&nbsp;<b>A home for Canadian engineering excellence</b>&nbsp;</div><div><br /></div><div>Canada has been synonymous with top notch computer science and engineering for more than 50 years. And most recently, AI research and advancement. It’s for this reason that in 2013 Google welcomed Geoffrey Hinton, a pioneer in the field of deep learning, to the Google Toronto office. And in  2016, Google Research started a Canadian centre of AI excellence by bringing Google Brain to Montréal. Google Brain is a deep learning artificial intelligence research team dedicated to artificial intelligence and every day, these world-leading teams tackle some of the biggest technological challenges of our time.&nbsp;</div><div><br /></div><div>Google Canada engineers have conceived of, developed, and implemented innovative products that many Canadians might take for granted:&nbsp;</div><div><ul style=\"text-align: left;\"><li>In 2011, Google Canada engineers played a key role in the development of the first Gmail app for iOS, bringing a Gmail app to the world for <a href=\"https://gmail.googleblog.com/2011/11/introducing-gmail-app-for-iphone-ipad.html\" rel=\"nofollow\" target=\"_blank\">iPhone, iPad and iPod touch</a>.&nbsp;</li><li>The <a href=\"https://cloud.google.com/healthcare-api\" rel=\"nofollow\" target=\"_blank\">Cloud Healthcare API</a>, developed by the Cloud Healthcare &amp; Life Sciences team in Waterloo since 2017, allows healthcare customers to organize and analyze their healthcare data in a scalable, compliant and privacy sensitive way. In 2020, the Cloud Healthcare API became widely available to healthcare organizations around the world.&nbsp;</li><li>Our Safe Browsing team in Montréal protects over 4 billion devices worldwide each year, delivering millions of warnings a month about phishing scams and other online threats.&nbsp;</li></ul><b>Providing platforms for Canadian success stories:</b>&nbsp;</div><div>For over 20 years, Google has helped Canadian businesses of all sizes use our digital tools to grow and reach customers across the globe. Before COVID-19, making the transition to digital was aspirational for most business owners. When the pandemic upended all of our lives, it became essential. To better understand how Google products helped Canadian workers and businesses in 2020, Google commissioned independent consultancy <a href=\"https://canada.googleblog.com/2021/10/helping-600000-canadian-businesses.html\" rel=\"nofollow\" target=\"_blank\">Public First</a> to take a look and they found that Google’s search and advertising tools helped provide an estimated $26 billion in economic activity for over 600,000 businesses in Canada. And in 2020 alone, the total economic impact of Google products and services in Canada is equivalent to 1.3% of total GDP, or the equivalent of supporting 235,000 jobs.&nbsp;</div><div><br /></div><div>&nbsp;And YouTube has facilitated the rise of the Canadian creator economy, helping content creators build sustainable businesses on the platform. A report by <a href=\"https://canada.googleblog.com/2021/06/youtube-canadas-creative-ecosystem.html\" rel=\"nofollow\" target=\"_blank\">Oxford Economics</a> estimates that in 2020, YouTube’s creative ecosystem contributed approximately $923 million to Canada’s GDP. In that same period YouTube supported the equivalent of 34,100 full-time employment jobs across Canada. Access to YouTube’s open platform continues to create a real and positive impact on the wider Canadian economy, and we can’t wait to watch the next generation of Canadian creators grow, create and connect on the platform.&nbsp;</div><div><br /></div><div>This month, Google Canada is officially 20 years old and more than 2,500 Googlers strong. We’re working, living, and growing in communities across this country. We’re delivering innovations that are helping people through the toughest times of their lives. And we’re doing all of that as we stay committed to the same goal we were founded on: to organize the world’s information and make it universally accessible and useful.&nbsp;</div><div><br /></div><div>It only seems fitting that to celebrate the past 20 years, we take a look back at the most <a href=\"https://twitter.com/googlecanada/status/1468250521618288642?s=20\" rel=\"nofollow\" target=\"_blank\">interesting searches</a> over these two decades, to reflect back what Canadians have been curious about. And it turns out, what we’re most curious about is us.  At its heart, Google is a place for people to ask questions – about ourselves, current events, and the world we are striving to create. So, after 20 years of Googling, we just wanted to say to all Canadians: <a href=\"https://www.youtube.com/watch?v=DKDGJMoR7BU\" rel=\"nofollow\" target=\"_blank\">thanks for asking.</a>&nbsp;</div><div><br /></div><div>Here’s to everything that comes next.&nbsp;</div><div><br /></div><div><span class=\"post-author\">Posted by Google Canada</span></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Aaron Brindle",
    "uri": "http://www.blogger.com/profile/13885417405401273013",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}