{
  "title": "The Edition: Court of Chaos",
  "link": "https://audioboom.com/posts/7978044",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2604,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: Who is advising the PM? </div>\n<div><br>\n</div>\n<div>In our cover story this week, our editor Fraser Nelson takes a deep dive into No. 10 politics and finds a court of chaos inside. With a large parliamentary majority, an extremely young team and the departure of Domonic Cummings is there anyone left in the Conservative party who can stand up to the Prime Minister? Fraser talks on the podcast with former Conservative party chairman, Kenneth Baker on the reign of King Boris. (00:45)<br>\n<br>\n\n</div>\n<div><br>\n</div>\n<div>Also this week: Should the West be prepared to defend Taiwan?</div>\n<div><br>\n</div>\n<div>Tensions over the island of Taiwan are rising at an alarming rate. In <em>The Spectator</em> this week Alessio Patalano, professor of war and strategy at King’s College, and Elbridge Colby, author of <em>Strategy of Denia</em>l, both write about what the West can do to defend Taiwan’s autonomy. On the podcast, Alessio and Elbridge talk further about the future of this disputed territory. (17:09)</div>\n<div>  <br>\n<br>\n\n</div>\n<div>And finally: How do you join the world of underground chess? </div>\n<div><br>\n</div>\n<div>One of the world’s oldest games is making something of a comeback, with underground chess clubs starting up all over the world. Jamie Njoku-Goodwin, CEO of UK music, writes about this phenomenon in this week’s <em>Spectator</em>. He joins the podcast along with Nick Moar, <em>The Spectator’s</em> social media editor and chess enthusiast to discuss their favourite pastime. Nick and James are also joined by the grandmaster himself, Malcolm Pein who wanted in on the fun. (30:56)</div>\n<div><br>\n</div>\n<div><br>\n</div>\n<div>Hosted by Lara Prendergast</div>\n<div><br>\n</div>\n<div>Produced by Sam Holmes</div>\n<div><br>\n</div>\n<div><br>\n</div>\n<div>Subscribe to The Spectator today and get a £20 Amazon gift voucher:</div>\n<div>\n<a href=\"http://www.spectator.co.uk/voucher\">www.spectator.co.uk/voucher</a> </div>\n<div><br>\n</div>\n<div>Listen to Lara’s food-based interview show, Table Talk:</div>\n<div>\n<a href=\"https://www.spectator.co.uk/tabletalk\">https://www.spectator.co.uk/tabletalk</a> </div>\n",
  "pubDate": "Thu, 11 Nov 2021 16:55:00 +0000",
  "guid": "tag:audioboom.com,2021-11-11:/posts/7978044",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}