{
  "title": "550: What if Harry told Narcissa that Draco was dead? And more MuggleMail",
  "link": "https://audioboom.com/posts/8031274",
  "itunes:episode": 550,
  "itunes:title": "What if Harry told Narcissa that Draco was dead? And more MuggleMail",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4639,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Our mailbag is overflowing with feedback from our recent Snape and Lily episode, and people want to talk about Jacob in the upcoming <em>Fantastic Beasts</em> film. We hear from another one of our youngest fans, and even dig up a classic e-mail from 2006. All on this latest milestone episode of MuggleCast!<br>\n<br>\n\n</div>\n<div>Important Note: Next week, we're celebrating Black History Month by talking about how the books handle representation. If you're a listener of color and have feedback on this topic, <a href=\"https://mugglecast.com/contact/\">please send us your owls</a>!<br>\n<br>\n\n</div>\n<ul>\n<li>Previously unseen photos of Ariana Dumbledore <a href=\"https://www.mugglenet.com/2022/02/exclusive-leaked-photos-confirm-scenes-filmed-with-ariana-dumbledore/\">have leaked online</a>, and Andrew and Micah did an IG Live about it. View that now on <a href=\"https://www.instagram.com/mugglecast/?hl=en\">our Instagram</a>.</li>\n<li>Last week, Eric attended <a href=\"https://www.albionschoolofsorcery.com/\">Albion School</a>, a live action roleplay, and had a blast.</li>\n<li>The results of our listener house survey are in! Find out what Hogwarts house the majority of our listeners are in! (It's very close, but not as close as O.G. Pottermore said they were.)</li>\n<li>Voicemails kick off from an Aquarius listener who brings even more insight into Lily's character from her horoscope.</li>\n<li>More voicemails cover bagel flavorings of the 1930's, Narcissa's love for Draco (What if Harry had told Narcissa that Draco was dead?), and something misunderstood about Harry Potter.</li>\n<li>Two listeners e-mail us with theories on how Jacob remembered Queenie, and whether his account of it to Newt can be trusted.</li>\n<li>Is Draco's future wife linked to Nagini? And could Jacob's wand help get him in to wizarding spaces?</li>\n<li>Is Cursed Child and other Potter missteps giving outside spectators a very bad impression of the Harry Potter franchise on a whole?</li>\n<li>What memory does Snape use to summon a Patronus? And why exactly did Lily choose James?</li>\n<li>In an email from 2006, one listener guesses at what Dumbledore is really seeing when he takes Riddle's potion.</li>\n<li>Chicken Soup for the MuggleCast soul returns and this time it's from a teenager who found us last year.</li>\n<li>Quizzitch: What two solutions does Hermione offer Ron to help it stop raining in Yaxley's office?  <a href=\"https://mugglecast.com/quizzitch/\">Submit your answer</a>!</li>\n<li>This week's episode is sponsored by MasterClass (go to <a href=\"http://www.masterclass.com/mugglecast\">Masterclass.com/mugglecast</a> for 15% off an annual membership) and BetterHelp  (go to <a href=\"https://www.betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a> for 10% off your first month)</li>\n</ul>\n",
  "pubDate": "Tue, 15 Feb 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-02-14:/posts/8031274",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}