{
  "id": "https://bibleinoneyear.org/en/youth/329",
  "title": "Day 329: Know When to Kneel",
  "description": "Psalm 133:1,3b, Ezekiel 47:6,9,12, 1 Peter 4:1–2,7–16,19.  Three themes dominate his remarkable ministry: unity, love and the Holy Spirit  They are distinct, but closely linked",
  "pubDate": "Thu, 25 Nov 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/329/?ignore",
  "itunes:duration": "14:58",
  "guid": "enyouth25112021-329",
  "length": 898.93,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 329: Know When to Kneel",
  "itunes:subtitle": "Psalm 133:1,3b, Ezekiel 47:6,9,12, 1 Peter 4:1–2,7–16,19.  Three themes dominate his remarkable ministry: unity, love and the Holy Spirit  They are distinct, but closely linked",
  "itunes:summary": "Raniero Cantalamessa is a Capuchin monk. In 1977, he was sent by the Vatican to be an observer at a conference in Kansas City, USA where there were 20,000 Catholics and 20,000 other Christians. On the last day of the conference, after someone had spoken about the tragedy of all the divisions in the body of Christ (the church), 40,000 people knelt in repentance. As Father Raniero looked out, he saw the words ‘JESUS IS LORD’ on a big neon sign over the conference venue. He describes how, at that moment, he caught a glimpse of what Christian unity is all about – 40,000 people kneeling in repentance under the Lordship of Jesus.\nHe asked ‘a lay Protestant’ to pray for him to experience more of the Holy Spirit. The Holy Spirit filled him. He experienced God’s love for him in a new way. He found himself speaking ‘in a manner like speaking in tongues’. The Bible came alive in a new way. He received a new ministry. In 1980, he was invited by Pope John Paul II to be the preacher to the Papal Household. This is what he has been ever since. In 2020, he was made a cardinal by Pope Francis. Three themes dominate his remarkable ministry: unity, love and the Holy Spirit. They are distinct, but closely linked.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 329
}