{
  "title": "253: White Hot: The Rise and Fall of Abercrombie & Fitch",
  "link": "https://audioboom.com/posts/8152176",
  "itunes:episode": 253,
  "itunes:title": "White Hot: The Rise and Fall of Abercrombie & Fitch",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3944,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Were you cool enough to wear Abercrombie? Did you wait in line to be granted the opportunity to walk past a shirtless teenaged model into a store with too-loud music and over priced cargo shorts? I KNOW YOU DID BECAUSE WE DID TOO! This doc is one part nostalgia and one part expose about how one of the world's most famous brand thrived on exclusion. <br>\n<br>\n<a href=\"https://www.indiegogo.com/projects/obsessed-fest-2022#/\">COME TO OBSESSED FEST!!</a> But only if you want to see ALL YOUR FAVORITE TRUE CRIME PODCASTERS IN THE SAME PLCE FOR A WHOLE WEEKEND! Damien Echols of the West Memphis Three will be joining Gillian and Bob Ruff on the mainstage for a WM3 Panel, Rabia Chaudry is doing a Q&A answering all your questions and giving you all the updates on Adnan Syed's case, we have live episode tapings from Let's Go To Court, Strange And Unexplained, Red Handed and more, plus Karaoke and Gillian's Taylor Swift Singalong! ALL OF THIS AND SO MUCH MORE IS INCLUDED IN YOUR FESTIVAL PASS! And then, if you want, you can add on live shows from True Crime Obsessed, Morbid, Obsessed With Disappeared, and Scamfluencers!  <a href=\"https://www.indiegogo.com/projects/obsessed-fest-2022#/\">TICKETS ARE ALMOST GONE!! GET YOUR TICKET</a> <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 300 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"LuLaRich\"</strong> <strong>\"John Wayne Gacy: Devil in Disguise\" </strong>\"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 06 Sep 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-09-05:/posts/8152176",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}