{
  "title": "Episode 49: Classroom Management - An Interview with Dr. Ross Green part 2",
  "pubDate": "Thu, 06 Mar 2008 20:50:00 +0000",
  "guid": "episode-49-classroom-management-an-interview-wi",
  "link": "http://www.thepsychfiles.com/2008/03/06/episode-49-classroom-management-an-interview-with-dr-ross-green-part-2/",
  "itunes:image": "",
  "description": "In this episode I continue the interview on Collaborative Problem Solving in the classroom with Dr. Ross Green, author of The Explosive Child.  As I stated in the previous episode, there are a variety of classroom management techniques, all designed to help solve the issue of how to discipline children who are having behavioral problems.  I think you'll find that Dr. Green's approach makes a lot of sense and it can be implemented in the classroom as well as at home.  A fascinating interview.",
  "content:encoded": "In this episode I continue the interview on Collaborative Problem Solving in the classroom with Dr. Ross Green, author of The Explosive Child.  As I stated in the previous episode, there are a variety of classroom management techniques, all designed to help solve the issue of how to discipline children who are having behavioral problems.  I think you'll find that Dr. Green's approach makes a lot of sense and it can be implemented in the classroom as well as at home.  A fascinating interview.",
  "enclosure": "",
  "itunes:duration": "32:43",
  "itunes:explicit": false,
  "itunes:keywords": "Management,Teaching,Classroom",
  "itunes:subtitle": "In this episode I continue the interview on Collaborative Problem Solving in the classroom with Dr. Ross Green, author of The Explosive Child.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "In this episode I continue the interview on Collaborative Problem Solving in the classroom with Dr. Ross Green, author of The Explosive Child. As I stated in the previous episode, there are a variety of classroom management techniques, all designed to help solve the issue of how to discipline children who are having behavioral problems. I think you'll find that Dr. Green's approach makes a lot of sense and it can be implemented in the classroom as well as at home. A fascinating interview."
}