{
  "title": "#462: Kreacher and the Keys (OOTP 25, The Beetle at Bay)",
  "link": "https://audioboom.com/posts/7561543",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5565,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>News covers JKR's childhood home and her recent thoughts on Prisoner of Azkaban and Order of the Phoenix. One of these was her easiest Potter book to write.</li>\n<li>Muggle Mail includes Voldemort's possession of Ginny and The Knight Bus in Goblet of Fire</li>\n<li>\n<a href=\"http://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a> continues with Order of the Phoenix – Chapter 25: The Beetle at Bay</li>\n<li>7-Word Summary: Valentine’s Day happens amidst many bad choices</li>\n<li>Mass Breakout from Azkaban!</li>\n<li>Why doesn't Ron react at all to hearing Antonin Dolohov's name?</li>\n<li>Is Fudge wrong to think Sirius Black could be behind the breakout?</li>\n<li>Neville's shift in mentality: the hosts each submit his \"glow up\" track! Add yours to <a href=\"https://open.spotify.com/playlist/48kq2Zc2KUpfXSULxOQRJO?si=EJmJixtGSomEtF52hjGb3g\">this Spotify list</a>!</li>\n<li>Bye bye, Broderick Bode! We hardly knew ye!</li>\n<li>Hagrid and Trelawney: were their classes destined for scrutiny and failure since Prisoner of Azkaban?</li>\n<li>How is Umbridge able to attend every Care of Magical Creatures and Divination class? Doesn't she have classes to teach herself?</li>\n<li>Educational Decree No. 26 - joke's on you Dolores! </li>\n<li>Harry and Cho's first date: Quidditch, dementors, Madam Pudifoot's, Roger Davies, Cedric, Hermione and more!</li>\n<li>Is The Daily Prophet getting pressured by the Ministry? </li>\n<li>Hermione’s clever plan to have Rita Skeeter tell Harry’s story in The Quibbler</li>\n<li>The Umbridge Suck Count climbs to 56!</li>\n<li>The hosts give their MVP of the Week and Rename The Chapter!</li>\n<li>Quizzitch: What topic does Xenophilius Lovegood tell Luna that Harry’s story is outselling?</li>\n<li>This week's episode is brought to you by Literati (get 25% off your first two orders by visiting <a href=\"http://www.Literati.com/MuggleCast\">Literati.com/MuggleCast</a>) and Quip (get your first refill kit free by visiting <a href=\"http://www.GetQuip.com/Muggle\">GetQuip.com/Muggle</a>)</li>\n<li>Join our community at <a href=\"http://www.patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 21 Apr 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-04-20:/posts/7561543",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}