{
  "id": "https://bibleinoneyear.org/en/youth/233",
  "title": "Day 233: How to Find and Keep Peace",
  "description": "Psalm 101:1–6, 2 Chronicles 14:2–7, 15:1–4, 1 Corinthians 14:22–40.  It means wholeness, soundness, well-being, oneness with God – every kind of blessing and good In order to bring peace to others, we first need to find and hold on to peace within ourselves",
  "pubDate": "Sun, 21 Aug 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/233/",
  "itunes:duration": "15:16",
  "guid": "enyouth21082022-233",
  "length": 916.85,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 233: How to Find and Keep Peace",
  "itunes:subtitle": "Psalm 101:1–6, 2 Chronicles 14:2–7, 15:1–4, 1 Corinthians 14:22–40.  It means wholeness, soundness, well-being, oneness with God – every kind of blessing and good In order to bring peace to others, we first need to find and hold on to peace within ourselves",
  "itunes:summary": "In 1555, Nicholas Ridley, a former Bishop of London, was burned at the stake in Oxford because of his beliefs. On the night before Ridley&#039;s execution, his brother offered to remain with him in the prison chamber to be of assistance and comfort. Nicholas declined the offer and replied that he meant to go to bed and sleep as quietly as ever he did in his life. Because he knew the peace of God, he could rest in the strength of the everlasting arms of his Lord to meet his need.\nPeace is a great blessing. ‘Peace’ is a word of huge significance in the Bible. The Hebrew word for peace, Shalom, translated by the Greek word eirene, means far more than the absence of war or hostility. It is not just an absence of certain circumstances but the presence of God and his reign. It means wholeness, soundness, well-being, oneness with God – every kind of blessing and good.\nIn order to bring peace to others, we first need to find and hold on to peace within ourselves.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 598
}