{
  "title": "Ex-Gojek VP&#8217;s mobile café network Jago nets US$2.2M pre-Series A",
  "link": "https://e27.co/ex-gojek-vps-mobile-cafe-network-jago-nets-us2-2m-pre-series-a-20221027/",
  "dc:creator": "Sainul",
  "pubDate": "Thu, 27 Oct 2022 03:07:33 +0000",
  "category": [
    "Food & Beverage",
    "Indonesia",
    "Investments",
    "Arkblu Capital",
    "Beenext",
    "CyberAgent Capital",
    "gojek",
    "Intudo Ventures",
    "Jago"
  ],
  "guid": "https://e27.co/?p=475079",
  "description": "<p>Jago, an Indonesia-based mobile café network, today announced the completion of a US$2.2 million pre-Series A round of financing led by Intudo Ventures and Beenext. CyberAgent Capital and Arkblu Capital also joined the oversubscribed round. The funds will be directed towards expanding to over 200 mobile cafés, covering 20 hyperlocal areas in Jakarta. The company [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/ex-gojek-vps-mobile-cafe-network-jago-nets-us2-2m-pre-series-a-20221027/\">Ex-Gojek VP&#8217;s mobile café network Jago nets US$2.2M pre-Series A</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<img loading=\"lazy\" class=\"aligncenter size-full wp-image-475080\" src=\"https://e27.co/wp-content/uploads/2022/10/Jago_pre_series_a_news.png\" alt=\"\" width=\"690\" height=\"388\" />\n<p>Jago, an Indonesia-based mobile café network, today announced the completion of a US$2.2 million pre-Series A round of financing led by Intudo Ventures and Beenext.</p>\n<p>CyberAgent Capital and Arkblu Capital also joined the oversubscribed round.</p>\n<p>The funds will be directed towards expanding to over 200 mobile cafés, covering 20 hyperlocal areas in Jakarta. The company will also strengthen its core team in operations and technology.</p>\n<p>Launched in June 2020, Jago is a micro mobile retailer that meets customers whenever and wherever they want. With a fleet of fully electric mobile cafés operating in key locations in Jakarta, Jago offers a hyperlocal approach to retail by serving neighbourhoods within a 1-2km radius to prepare and deliver fresh beverages within minutes quickly.</p>\n<p>The carts operate in areas that are either high density with demand from residential and business areas or where coffee shops are less abundant despite robust demand for fresh coffee products.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/why-indonesia-only-intudo-ventures-believes-sea-as-one-cohesive-market-is-a-fallacy-20220812/\">Why ‘Indonesia-only’ Intudo Ventures believes SEA as one cohesive market is a fallacy</a></strong></p>\n<p>Jago provides &#8220;quality&#8221; café beverages served by baristas equipped with all the tools and ingredients needed to prepare fresh drinks on the spot, including hot & cold, coffee & tea, and other speciality drinks.</p>\n<p>Jago Coffee offers both in-person grab-and-go and mobile orders, offering pickup and delivery services for fresh café-grade coffees directly to consumers. Users can download the Jago app on iOS and Android to order freshly brewed beverages for pickup and delivery.</p>\n<p>Starting at IDR 8,000 (US$0.55) per cup, Jago claims its fresh beverages offer a higher quality alternative to instant and ready-to-drink coffee while ensuring convenience and cost-effectiveness.</p>\n<p>“Our innovative business model, pairing mobile cafés with our Jago app, creates unrivalled access for coffee anytime, anywhere, without sacrificing quality, price, or convenience. We are building new possibilities for last-mile retail that is sustainable and fulfilling for Indonesian consumers to meet their daily coffee and refreshment needs,” said Tanu.</p>\n<p>Jago is led by co-founders Yoshua Tanu (CEO) and Christopher Oentojo (CTO). In addition to Jago, Tanu is also the co-founder of Common Grounds, a premium chain of café stores in Indonesia. Before founding Jago, Christopher was Vice President of Product at Gojek, where he led the launch of GoCar and the company’s internal mapping initiative.</p>\n<p>In addition, Daniel Sidik has recently joined Jago as COO and CMO. Sidik brings extensive F&B experience, joining the company after co-founding and leading as the CEO of Reddog, a popular Korean-style hotdog chain in Indonesia with over 40 retail outlets after only two years from launch.</p>\n<p>&#8212;</p>\n<p><a rel=\"follow\" href=\"https://e27.co/echelon/asia/\" target=\"_blank\" rel=\"noopener\" >Echelon 2022</a> is happening from 27-28 October at Resorts World Sentosa in Singapore!</p>\n<p>Echelon 2022 aims to provide intimate and focused discussions on key topics and business matching services to facilitate business-driven connections during the two-day event. e27 will curate and invite key stakeholders of startups, investors, corporates, and ecosystem enablers to drive towards fruitful business outcomes at Echelon.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/ex-gojek-vps-mobile-cafe-network-jago-nets-us2-2m-pre-series-a-20221027/\">Ex-Gojek VP&#8217;s mobile café network Jago nets US$2.2M pre-Series A</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}