{
  "title": "Myanmar studies academics decry SOAS Professor of Burmese Language post closure",
  "link": "https://www.newmandala.org/myanmar-studies-academics-decry-soas-professor-of-burmese-language-post-closure/",
  "dc:creator": "Dorothy Mason",
  "pubDate": "Mon, 24 Oct 2022 05:34:43 +0000",
  "category": [
    "Myanmar",
    "Myanmar Research Centre"
  ],
  "guid": "https://www.newmandala.org/?p=60049",
  "description": "<p>Losing the position will end an important legacy of language scholarship and close opportunities for scholars interested in broader Burma/Myanmar studies.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/myanmar-studies-academics-decry-soas-professor-of-burmese-language-post-closure/\">Myanmar studies academics decry SOAS Professor of Burmese Language post closure</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n",
  "content:encoded": "<p><a href=\"#burma\">မြန်မာဘာသာပြန် ​အောက်တွင်ပါရှိသည်</a></p>\n<p>The University of London’s School of Oriental and African Studies (SOAS) announced in August that it would be terminating the Professor of Burmese post, ending over a century of high-level Burmese language tuition at the school.</p>\n<p>News of the proposed cut shocked colleagues in Myanmar/Burma studies communities worldwide, prompting countless expressions of support online and a petition to reinstate the position, which garnered over 1000 signatures in just over a week. Within days of the announcement, academics at the Australian National University drafted an <a href=\"https://www.petitiononline.uk/reinstate_the_post_of_professor_of_burmese_at_soas_university_of_london\">open letter</a> to the SOAS Board of Directors, imploring them to reverse their decision and pledging their support to Professor Justin Watkins, who currently holds the professorship.</p>\n<p>Professor Watkins, who has taught Burmese at SOAS since 1999, shared the news of his imminent dismissal in a <a href=\"about:blank\">blog post</a> urging concerned individuals to write to the school directly. He says this is a short-sighted move which, if it goes through, will have lasting effects on Myanmar studies in the UK and around the world.</p>\n<p>“The sad thing is that my position is the only specifically Burma-related research and teaching position in any UK university,” says Professor Watkins. “The feeling is that once it’s gone, it can never come back.”</p>\n<h4>Bad timing</h4>\n<p>Professor Watkins’ post was first put in jeopardy in 2020, when SOAS was facing a financial crisis caused partly by funding cuts to the university sector. With the help of a donation from Myanmar businessman Serge Pun and plans for further fundraising to build up an endowment, Professor Watkins persuaded the school to extend his contract for a further two years.</p>\n<p>Now, the school is a much better position financially—so it’s hard to understand why the post has once again been put on the chopping block.</p>\n<p>SOAS’ decision is particularly concerning given that Myanmar is currently facing a protracted political and social crisis. The military junta staged a coup in February 2021, prompting armed rebellion and a nationwide <a href=\"about:blank\">civil disobedience movement</a>. The civilian response has been met with brutal repression. The armed forces have taken over numerous universities, schools and religious sites, burned villages, and attacked civilians, <a href=\"https://www.abc.net.au/news/2022-09-20/myanmar-army-helicopter-fires-on-school/101455958\">including children</a>. As of <a href=\"https://aappb.org/\">10</a> <a href=\"https://aappb.org/\">October</a>, the military has killed more than 2,300 people and arrested over 15,000. Among those detained is <a href=\"about:blank\">Australian academic Sean Turnell</a>, a former economic advisor to the Aung San Suu Kyi government who was <a href=\"about:blank\">sentenced</a> in a kangaroo court on 29 September 2022, for allegedly breaching the Official Secrets Act.</p>\n<p>“The symbolism of having the one post that’s explicitly linked to Myanmar [being cut] right now sends an extraordinary message to the rest of the world,” says Professor Watkins.</p>\n<p>The coup put an end to the proposed endowment to keep the Burmese Language professorship. In a statement released in response to a request for comment, SOAS said it will “offer a wealth of opportunities to learn about Myanmar and Burmese culture through [their] BA Languages and Cultures and MA South-East and Pacific Asian Studies degrees, where students can focus on South-East Asian Languages and Cultures,” adding that “both these courses offer the option to learn Burmese.” But the opportunities to learn the language at a scholarly level will be gone, as the school will only offer one module of beginner’s Burmese a year.</p>\n<p>Axing the high-level Burmese teaching program will make it all-but impossible for students to conduct meaningful research on Myanmar—and therefore to accurately interpret and understand the current crisis as it is unfolding.</p>\n<p>“There are fine Myanmar studies scholars in universities around the UK…but nothing language-related [other than what is offered at SOAS],” says Professor Watkins. “That really downgrades the UK’s capacity to train its own scholars and diplomats.”</p>\n<p>“There aren’t many places around the world where you can learn Burmese in an academic context. So for one of them—and one of the oldest ones—to disappear is cause for concern,” he adds. <em class=\"help-text\">\n\t<div class=\"post alignleft\">\n\t\t<div class=\"post-image\">\n\t\t\t<span class=\"post-label\">\n\t\t\t\tRelated\t\t\t</span>\n\t\t\t\n\t\t\t\t\t\t\t<a href=\"https://www.newmandala.org/lost-in-tongue/\">\n\t\t\t\t\t<img width=\"276\" height=\"184\" src=\"http://www.newmandala.org/wp-content/uploads/cache/2019/12/NEWMANDELA-1/2321814694.jpg\" class=\" wp-post-image\" alt=\"\" loading=\"lazy\" />\t\t\t\t</a>\n\t\t\t\t\t</div><!-- /.post-image -->\n\t\n\t\t<h3 class=\"post-title\">\n\t\t\t<a href=\"https://www.newmandala.org/lost-in-tongue/\">Lost in tongue: the politics of mother tongue education in Myanmar</a>\n\t\t</h3><!-- /.post-title -->\n\t\t\n\t\t\t\t<div class=\"post-entry\">\n\t\t\t<p>A glimpse into the current state of mother tongue education and its connections to the broader ethnic reconciliation process. </p>\n\t\t</div><!-- /.post-entry -->\n\t\n\t\t<div class=\"post-actions\">\n\t\t\t<div class=\"post-meta\">\n\t\t\t\t<p>\n\t\t\t\t\t\t<a class=\"post-author\" href=\"https://www.newmandala.org/author/andrekwok/\">Andre Kwok</a>\n\t\t\t\t\n\t\t\t\t\t13 December, 2019\t\t\t\t</p>\n\t\t\t</div><!-- /.post-meta -->\n\t\t</div><!-- /.post-actions -->\n\t</div><!-- /.post -->\n\t</em></p>\n<p>Dr Yuri Takahashi is teacher and convenor of the <a href=\"about:blank\">Burmese language minor</a> at the Australian National University—the only university in the southern hemisphere to offer Burmese at degree level. She said she was “shocked and saddened” to hear of SOAS’ decision, and showed her support to Professor Watkins.</p>\n<p>She also says the political situation in Myanmar highlights the ongoing need for advanced Burmese language tuition.</p>\n<p>“If you talk and exchange with Myanmar people, your understanding of Myanmar will be deepened and widened,” says Dr Takahashi. “Particularly after the coup, Burmese language study is increasingly important, because now we really need to get accurate information about what’s going on in Myanmar” she adds. “In that hard situation, what are Myanmar people thinking? How do they feel? How can we understand their joy and sorrow and very sensitive emotional expressions?”</p>\n<p>“I know that for many students, Burmese is not an attractive language to study [right now], because we can’t travel there and there are very few job opportunities,” says Dr Takahashi. “But now is the time to learn, to understand [peoples] thoughts and emotions. To do so, we need to learn [their] language.”</p>\n<h4>Not just a loss of language</h4>\n<p>Losing the Professor of Burmese language post at SOAS would not only end an important legacy of language scholarship at the school. It would also mean closing off opportunities for scholars interested in Burma/Myanmar studies more broadly, including those interested in learning other Myanmar languages.</p>\n<p>“We have had scholars from or researching other parts of Myanmar who have come to SOAS for the Burmese language related focus, even though Burmese itself isn’t the language they would work on,” says Professor Watkins. “Switching off Burmese also switches off all the other related strands of research.”</p>\n<p>“There is a lot of work to be done in all aspects of Myanmar studies, and having no centre of networks for that in the UK—and no point of contact at SOAS where people can come and visit and make connections—I think that’s one of the saddest things,” he adds.</p>\n<p>In addition to his role as teacher of Burmese, Professor Watkins is a central node in a network of scholarship. He is a point of contact for those interested in SOAS’ extensive Burmese library collection, as well as responds to questions from people interested in Myanmar studies based around Europe and the UK.<br />\n<a name=\"burma\"></a><br />\n“A lot of the work I do is answering queries,” he says. “These often [come from] really interesting people wanting to do amazing work, and nurturing those networks…is an incredibly satisfying and important part of the role. I think it would be sad if that came to an end as well.”</p>\n<p><em>Professor Watkins and Burma/Myanmar colleagues around the world continue to fight SOAS’ decision. To sign the petition asking SOAS to reinstate the professorship, </em><a href=\"about:blank\"><em>click here</em></a><em>; to write to SOAS directly, visit </em><a href=\"about:blank\"><em>this page</em></a><em>. If you know a source of philanthropic funding which might help SOAS to reinstate the post, please contact Professor Watkins. </em></p>\n<h3>ခေါင်းစဉ်- မြန်မာဘာသာစကားပါမောက္ခရာထူးနေရာအား ရပ်စဲလိုက်သော SOAS ၏ ဆုံးဖြတ်ချက်ကို မြန်မာ့ရေးရာပညာရှင်များက ရှုတ်ချလိုက်သည်</h3>\n<p>ယခုနှစ် သြဂုတ်လတွင် University of London&#8217;s School of Oriental and African Studies (SOAS) မှ မြန်မာဘာသာ ပါမောက္ခရာထူးနေရာအား ရပ်စဲလိုက်ကြောင်း ကြေငြာခဲ့သဖြင့် ကျောင်း၏ ရာစုနှစ်တစ်ခုကျော် သက်တမ်းရှိပီဖြစ်သော မြန်မာဘာသာစကားသင်ကြားမှုသည် အဆုံးသတ်တော့မည်ဖြစ်သည်။<br />\nအဆိုပါသတင်းသည် တစ်ကမ္ဘာလုံးရှိ မြန်မာ့(ဗမာ) အရေးလေ့လာနေကြသော လုပ်ဖော်ကိုင်ဖက်များအား တုန်လှုပ်ချောက်ချားစေခဲ့သဖြင့် ရာထူးနေရာပြန်လည်ခန့်အပ်ရန် အွန်လိုင်းတွင် ထောက်ခံကြောင်း ပြောဆိုမှုများ မရေမတွက်နိုင်အောင်ပေါ်ထွက်လာခဲ့သည်။ ဆုံးဖြတ်ချက်အား ပြန်လည်ပြင်ဆင်ပေးရန် လက်မှတ်ထိုးတောင်းဆိုသောလှုပ်ရှားမှုတွင် တပတ်အတွင်း လူပေါင်း ၁၀၀၀ ကျော်ပါဝင်ခဲ့ကြသည်။ ကြေငြာချက်ထုတ်ပြန်ပီး ရက်ပိုင်းအတွင်းတွင် သြစတြေးလျအမျိုးသားတက္ကသိုလ်မှ ပညာရှင်များက SOAS ဒါရိုက်တာဘုတ်အဖွဲ့ထံ အိတ်ဖွင့်ပေးစာတစ်စောင် ရေးသားခဲ့ပြီး ၎င်းတို့၏ ဆုံးဖြတ်ချက်ကို ပြင်ဆင်ပေးရန်နှင့် လက်ရှိပါမောက္ခ Justin Watkins အား ထောက်ခံကြောင်း ဖော်ပြခဲ့ကြသည်။<br />\n၁၉၉၉ ခုနှစ်ကတည်းက SOAS တွင် မြန်မာစာကို သင်ကြားနေခဲ့သော ပါမောက္ခ Watkins က ၎င်းမကြာမီ ထုတ်ပယ်ခံရတော့မည်ဆိုသည့် သတင်းကို ၎င်း၏ကိုယ်ပိုင်ဘလော့ဂ်တွင် မျှဝေခဲ့ပြီး စိုးရိမ်မကင်းရှိသူများအနေဖြင့် ကျောင်းသို့ တိုက်ရိုက်စာရေးပေးပို့ကြရန် တိုက်တွန်းနှိုးဆော်ထားသည်။ ကျောင်း၏အဆိုပါလုပ်ဆောင်ချက်သည် ရေတိုအမြင်ဖြင့်ပြုလုပ်ခြင်းဖြစ်ပြီး ယူကေနှင့် ကမ္ဘာတဝှမ်းရှိ မြန်မာ့အရေးလေ့လာမှုများအပေါ် ရေရှည်အကျိုးသက်ရောက်မှုများရှိလာစေမည်ဖြစ်ကြောင်း ၎င်းက ပြောဆိုသည်။<br />\n&#8220;ဝမ်းနည်းစရာကောင်းတာကတော့ ကျွန်တော့်ရာထူးက ယူကေတက္ကသိုလ်အများကြီးရှိတဲ့ထဲက တခုတည်းသော မြန်မာနိုင်ငံနဲ့ ပတ်သက်တဲ့ သုတေသနနဲ့ သင်ကြားရေးဆိုင်ရာ ရာထူးနေရာပဲဖြစ်တယ်&#8221; ဟု ပါမောက္ခ Watkins က ပြောဆိုသည်။ &#8220;ခံစားချက်ကတော့ ဒီဟာကပျောက်ပြီးသွားရင် ဘယ်တော့မှ ပြန်ရနိုင်တော့မှာမဟုတ်ဘူး&#8221;</p>\n<p>မှားယွင်းသောအချိန်ကာလ<br />\n၂၀၂၀ ခုနှစ်အတွင်း တက္ကသိုလ်ကဏ္ဍ ရံပုံငွေဖြတ်တောက်ခံရမှု၏ တစ်စိတ်တစ်ပိုင်းအကျိုးဆက်အဖြစ် SOAS တက္ကသိုလ်သည် ဘဏ္ဍာရေးအကျပ်အတည်းနှင့် ရင်ဆိုင်နေရချိန်တွင် ပရော်ဖက်ဆာ Watkins ၏ ရာထူးနေရာသည် ပထမဆုံးအကြိမ်အန္တရာယ်ကြုံတွေ့ခဲ့သည်။ သို့သော် မြန်မာစီးပွားရေးလုပ်ငန်းရှင် Serge Pun ၏ လှူဒါန်းမှုအကူအညီ၊ ထောက်ပံမှုရရှိရေး ရန်ပုံငွေရှာဖွေရေးအစီအစဉ်များနှင့်အတူ ပါမောက္ခ Watkins သည် နောက်ထပ်နှစ်နှစ်စာချုပ်သက်တမ်းတိုးရန် ကျောင်းကို စည်းရုံးနိုင်ခဲ့သည်။<br />\nယခုအခါ ကျောင်းသည် ငွေရေးကြေးရေးအရ ပိုမိုကောင်းမွန်သော အနေအထားရောက်ရှိနေသော်လည်းဘဲ ဘာကြောင့်အဆိုပါရာထူးနေရာအား ရုတ်သိမ်းရန်ထပ်မံဆုံးဖြတ်ခဲ့သည်မှာ နားလည်ရခက်စေသည်။<br />\nSOAS ၏ ဆုံးဖြတ်ချက်သည် အထူးသဖြင့် မျက်မှောက်ကာလကဲ့သို့ မြန်မာနိုင်ငံသည် နိုင်ငံရေးနှင့် လူမှုရေး အကျပ်အတည်း ရင်ဆိုင်နေရသည့်အချိန်ဖြစ်နေသဖြင့် စိုးရိမ်မကင်းပိုမိုဖြစ်စေသည်။ ၂၀၂၁ ခုနှစ် ဖေဖော်ဝါရီလတွင် စစ်အစိုးရက အာဏာသိမ်းခဲ့ပြီးနောက် လက်နက်ကိုင်ပုန်ကန်မှုနှင့် နိုင်ငံလုံးဆိုင်ရာ အကြမ်းမဖက်အာဏာဖီဆန်ရေးလှုပ်ရှားမှုများကို ပေါ်ပေါက်စေခဲ့သည်။ အရပ်သားများ၏ တုံ့ပြန်မှုသည် ရက်စက်ကြမ်းကြုတ်သော ဖိနှိပ်မှုများနှင့် ရင်ဆိုင်နေရသည်။ စစ်တပ်သည် တက္ကသိုလ်များ၊ ကျောင်းများနှင့် ဘာသာရေးအဆောက်အအုံအများအပြားကို သိမ်းပိုက်ပြီး ရွာများကို မီးရှို့ကာ ကလေးငယ်များ အပါအဝင် အရပ်သားများကို တိုက်ခိုက်ခဲ့သည်။ ၂၀၂၂ ခုနှစ် အောက်တိုဘာလ ၁၀ ရက်နေ့အထိ စစ်တပ်က လူပေါင်း ၂၃၀၀ ကျော်ကို သတ်ဖြတ်ခဲ့ပြီး ၁၅၀၀၀ ကျော်အား ဖမ်းဆီးခဲ့သည်။ ဖမ်းဆီးခံရသူများထဲတွင် ဒေါ်အောင်ဆန်းစုကြည်အစိုးရ၏ စီးပွားရေးအကြံပေးဟောင်းဖြစ်သူ သြစတြေးလျပညာရှင် Sean Turnell လည်းပါဝင်ပြီး ၎င်းအား နိုင်ငံတော်လျှို့ဝှက်ချက်အက်ဥပဒေ ဖောက်ဖျက်မှုဖြင့် ပြီးခဲ့သည့် စက်တင်ဘာလအတွင်းက စစ်တပ်ကြိုးဆွဲရာကသည့် တရားရုံးက အမိန့်စီရင်ချက်ချခဲ့သည်။<br />\n“မြန်မာနိုင်ငံနှင့် ထင်ထင်ရှားရှား ဆက်စပ်နေသည့် သင်္ကေတတခုအား ယခုလိုကာလတွင် ဖြတ်တောက်လိုက်ခြင်းက ကမ္ဘာတစ်ဝှမ်းသို့ မကြုံစဖူးသော သတင်းစကားပါးလိုက်သကဲ့သို့ ဖြစ်စေသည်” ဟု ပါမောက္ခ Watkins ကဆိုသည်။<br />\nအာဏာသိမ်းမှုက မြန်မာဘာသာစကားဆိုင်ရာ ပါမောက္ခရာထူးကို ဆက်ထိန်းထားနိုင်ရန် အဆိုပြုထားသော ထောက်ပံ့ကြေးကို အဆုံးသတ်သွားစေခဲ့သည်။ မှတ်ချက်ပေးရန် တောင်းဆိုချက်ကို တုံ့ပြန်သော SOAS ၏ ထုတ်ပြန်ကြေညာချက်တွင် “ကျောင်းသားများအနေဖြင့် အရှေ့တောင်အာရှ ဘာသာစကားများနှင့် ယဉ်ကျေးမှုများကို အထူးပြုလေ့လာနိုင်သော BA Languages and Cultures နှင့် MA South-Pacific Asian Studies ဘွဲ့များမှတဆင့် မြန်မာနှင့် မြန်မာ့ယဉ်ကျေးမှုအကြောင်း လေ့လာရန် အခွင့်အလမ်းများစွာ ရရှိမည်ဖြစ်ပြီး၊ အဆိုပါသင်တန်းနှစ်ခုလုံးတွင် မြန်မာစာကို သင်ယူနိုင်သည့် အခွင့်အလမ်းများရှိမည် ဖြစ်သည်” ဟု ဖော်ပြထားပါသည်။ သို့သော် ကျောင်းမှ ပို့ချသောသင်တန်းမှာ တနှစ်စာအတွက် အခြေခံအဆင့်သင်ခန်းစာတစ်ခုသာ ဖြစ်သောကြောင့် မြန်မာဘာသာစကားအား ပညာရှင်အဆင့် သင်ယူနိုင်ရန် အခွင့်အလမ်းများ မရှိတော့ပေ။<br />\nအဆင့်မြင့်မြန်မာစာသင်ကြားမှုအစီအစဉ်ကို ဖယ်ထုတ်လိုက်ခြင်းကြောင့် ကျောင်းသားများအနေဖြင့် အရည်အသွေးပြည့်ဝသော မြန်မာနိုင်ငံနှင့်ပတ်သက်သည့် သုတေသနများပြုလုပ်ရန် မဖြစ်နိုင်တော့ပေ။ ထို့ကြောင့် လက်ရှိဖြစ်ပေါ်နေသော အကျပ်အတည်းကို တိကျစွာနားလည်သဘောပေါက်ရန်လည်း မလွယ်ကူနိုင်တော့ပေ။<br />\n“ယူကေက တက္ကသိုလ်တွေမှာ မြန်မာ့အရေးနှံ့စပ်တဲ့ ပညာရှင်ကောင်းများစွာရှိပါတယ်… ဒါပေမယ့် ဘာသာစကားနဲ့ဆိုင်တဲ့ [SOAS ကလွဲရင်] သူတဦးတယောက်မှ မရှိပါဘူး” ဟု ပါမောက္ခ Watkins ကဆိုသည်။ “အဲ့ဒါ (ဆုံးဖြတ်ချက်) က UK အနေနဲ့ သူရဲ့ ပညာရှင်နဲ့ သံတမန်တွေကို လေ့ကျင့်ပေးနိုင်တဲ့ စွမ်းရည်ကို တကယ်ကို နှိမ့်ချသွားစေပါတယ်။”<br />\n“ကမ္ဘာတဝှမ်းမှာ ပညာရှင်အဆင့် မြန်မာဘာသာစကားကို သင်ယူလေ့လာနိုင်တဲ့ နေရာတွေ အများကြီး မရှိပါဘူး။ ဒါကြောင့် အခုလိုသက်တမ်းအရှည်ဆုံး အစီအစဥ်တခု ပျောက်သွားမယ်ဆိုတာက စိုးရိမ်ဖို့ကောင်းပါတယ်” ဟု သူက ထပ်ပြောသည်။<br />\nသြစတြေးလျအမျိုးသားတက္ကသိုလ်သည် မြန်မာစာကို ဘွဲ့ဒီဂရီအဆင့်တွင်လေ့လာနိုင်ရန် ဆောင်ရွက်ထားသော ကမ္ဘာတောင်ဘက်ခြမ်းရှိ တစ်ခုတည်းသောတက္ကသိုလ်ဖြစ်ပြီး အဆိုပါတက္ကသိုလ်တွင် မြန်မာဘာသာစကားကို သင်ကြားပို့ချပေးနေသူ ဒေါက်တာ Yuri Takahashi က SOAS ၏ ဆုံးဖြတ်ချက်ကိုကြားသိပီးနောက် &#8220;တုန်လှုပ်ပြီး စိတ်မကောင်းဖြစ်မိသည်&#8221; ဟုဆိုသည်။ သူမအနေဖြင့် ပါမောက္ခ Watkins အား ထောက်ခံအားပေးကြောင်းပြောဆိုခဲ့သည်။<br />\nမြန်မာနိုင်ငံ၏ နိုင်ငံရေးအခြေအနေက အဆင့်မြင့်မြန်မာဘာသာစကားသင်ကြားမှုအတန်းများ စဥ်ဆက်မပြတ်လိုအပ်နေမှုကို မီးမောင်းထိုးပြနေသည်ဟုလည်း သူမက ဆိုသည်။<br />\n“မြန်မာလူမျိုးတွေနဲ့ စကားပြောဆိုဆက်ဆံမယ်ဆိုရင် မြန်မာနိုင်ငံအပေါ် နားလည်မှုတွေက ပိုမိုနက်ရှိုင်းပြီး ကျယ်ပြန့်လာမှာပါ” ဟု ဒေါက်တာ Takahashi က ဆိုသည်။ “အထူးသဖြင့် အာဏာသိမ်းပြီးနောက်ပိုင်း မြန်မာဘာသာစကားလေ့လာဖို့က ပိုအရေးကြီးလာပါတယ်။ အကြောင်းကတော့ အခုမြန်မာနိုင်ငံမှာ ဖြစ်ပျက်နေတဲ့ အကြောင်းအရာတွေကို တိတိကျကျသိဖို့အလွန်အရေးကြီးတာကြောင့်ဖြစ်ပါတယ်” ဟု ၎င်းက ထပ်လောင်းပြောဆိုသည်။ “ဒီလိုခက်ခဲကြမ်းတမ်းတဲ့အချိန်ကာလမှ မြန်မာလူမျိုးတွေ ဘာတွေတွေးနေလဲ။ သူတို့ ဘယ်လိုခံစားနေရလဲ။ သူတို့၏ ပျော်ရွှင်မှု၊ ဝမ်းနည်းမှုနှင့် အလွန်သိမ်မွေ့တဲ့ စိတ်ပိုင်းဆိုင်ရာ ဖော်ပြချက်တွေကို ကျွန်မတို့ ဘယ်လိုနားလည်နိုင်မလဲ။” “ကျောင်းသား တော်တော်များများအတွက် မြန်မာစကားက လေ့လာသင်ယူဖို့အနေနဲ့ သိပ်ပြီးဆွဲဆောင်မှုရှိတဲ့ ဘာသာစကားတစ်ခု မဟုတ်ဘူးဆိုတာ ကျွန်မသိပါတယ်။ အကြောင်းကတော့ ကျွန်မတို့ အဲဒီကို သွားလို့မရသလို၊ အလုပ်အကိုင် အခွင့်အလမ်းတွေကလည်း အရမ်းနည်းပါးနေလို့ပါ” ဟု ဒေါက်တာ Takahashi က ဆိုသည်။ “ဒါပေမယ့် အခုအချိန်က သူတို့တွေရဲ့ အတွေးအမြင်နဲ့ ခံစားချက်တွေကို နားလည်ဖို့ သင်ယူဖို့ အချိန်ကောင်းဖြစ်ပါတယ်။ အဲဒီအတွက် ကျွန်မတို့ [သူတို့] ဘာသာစကားကို သင်ယူရမယ်။”</p>\n<p>ဘာသာစကား ဆုံးရှုံးမှုထက်ပိုပါတယ်<br />\nSOAS တွင် မြန်မာဘာသာစကား ပါမောက္ခရာထူးကို ဆုံးရှုံးလိုက်ရခြင်းက ကျောင်းရှိ အရေးပါသော ဘာသာစကားသင်ကြားမှု အမွေအနှစ်ကို အဆုံးသတ်စေရုံသာမက၊ မြန်မာဘာသာစကားကို လေ့လာသင်ယူလိုသူများအပါအဝင် မြန်မာ့အရေးစိတ်ဝင်တစားလေ့လာလိုသော ပညာရှင်များအတွက် အခွင့်အလမ်းများ ဆုံးရှုံးသွားခြင်းဖြစ်သည်။<br />\n“မြန်မာဘာသာစကားက ၎င်းတို့ရဲ့ အဓိကအသုံးပြုလေ့လာတဲ့ ဘာသာစကားမဟုတ်သော်လည်းဘဲ SOAS မှာ မြန်မာဘာသာစကား အထူးပြုတဲ့အစီအစဥ်ရှိမှုကြောင့် မြန်မာပြည်က သို့မဟုတ် မြန်မာ့အရေးကို အထူးပြုသုတေသနပြုသူတွေက ဒီကိုလာရောက်လေ့လာကြလေ့ရှိပါတယ်” လို့ ပါမောက္ခ Watkins ကဆိုပါတယ်။ “မြန်မာဘာသာစကားသင်ကြားမှုကို ပိတ်လိုက်ခြင်းက ဆက်စပ်နေတဲ့သုတေသနတွေ အားလုံးကို ပိတ်လိုက်သလိုပါဘဲ။”<br />\n“မြန်မာ့အရေးလေ့လာမှုနဲ့ ပတ်သက်ရင် ကဏ္ဍပေါင်းစုံမှာ လုပ်စရာတွေ အများကြီးရှိနေပါတယ်။ UK မှာ အဲဒီအတွက် စုံချက်ရှိမနေပါဘူး။ လူတွေ လာရောက်လည်ပတ်နိုင်ဖို့ ချိတ်ဆက်ဆက်သွယ်နိုင်ဖို့ SOAS မှာ တာဝန်ခံသူမရှိတော့ပါဘူး။ ကျနော့်အတွက်တော့ ဒါဟာ ဝမ်းနည်းစရာအကောင်းဆုံးတွေထဲက တခုပါဘဲ” ဟု ၎င်းက ထပ်လောင်းပြောဆိုသည်။<br />\nပါမောက္ခ Watkins သည် မြန်မာစာဆရာတာဝန်အပြင် ပညာရပ်ဆိုင်ရာကွန်ရက်တခုလုံး၏ အဓိကနေရာတွင်ရှိနေသူဖြစ်သည်။ သူသည် SOAS ၏ ကြွယ်ဝသော မြန်မာစာပေစုစည်းမှုများအား စိတ်ဝင်စားသူများအတွက် အဓိကအဆက်အသွယ်ဖြစ်သလို ဥရောပနှင့် ယူကေတဝှမ်းရှိ မြန်မာ့အရေး စိတ်ဝင်စားသူများ၏ မေးမြန်းဆက်သွယ်မှုများကို အဓိကဖြေကြားပေးနေသူလည်းဖြစ်သည်။<br />\n“ကျွန်တော်လုပ်ရတဲ့ အလုပ်တော်တော်များများက မေးခွန်းတွေကို ဖြေဆိုရတာပါ” ဟု ၎င်းက ဆိုသည်။ “ဒီမေးခွန်းတွေက အံ့သြစရာကောင်းတဲ့အလုပ်တွေကို လုပ်ဆောင်လိုကြတဲ့ အလွန်တရာ စိတ်ဝင်စားစရာကောင်းတဲ့ သူတွေ၊ ကွန်ရက်တွေကို ပြုစုပျိုးထောင်ပေးချင်သူတွေကနေ လာတတ်တယ်။ ဒီအချက်တွေကြောင့် ကျနော့်အလုပ်က မယုံနိုင်လောက်အောင် ကျေနပ်စရာကောင်းပြီး အရေးကြီးတဲ့ အစိတ်အပိုင်းတစ်ခုအဖြစ်ရှိနေတာပါ။ ဒီအတိုင်းသာ ပြီးဆုံးသွားခဲ့ရင်တော့ ဝမ်းနည်းစရာ ကောင်းလိမ့်မယ် ထင်ပါတယ်။”<br />\nပါမောက္ခ Watkins နှင့် ကမ္ဘာတဝှမ်းရှိ မြန်မာ/ဗမာ လုပ်ဖော်ကိုင်ဖက်များသည် SOAS ၏ ဆုံးဖြတ်ချက်ကို ပြောင်းလဲနိုင်ရန် ဆက်လက်ရင်ဆိုင်နေကြပါသည်။ ပါမောက္ခရာထူးကို ပြန်လည်အသက်သွင်းနိုင်ရန်အတွက် SOAS ထံ တောင်းဆိုသည့် အသနားခံစာကို လက်မှတ်ရေးထိုးရန်၊ ဤနေရာကို နှိပ်ပါ။ SOAS သို့ တိုက်ရိုက်စာရေးလိုပါက ဤစာမျက်နှာသို့ သွားပါ။ အဆိုပါရာထူးနေရာကိုပြန်လည်ထည့်သွင်းရန်အတွက် SOAS ကိုကူညီနိုင်သည့် ပရဟိတရန်ပုံငွေအရင်းအမြစ်ကို သင်သိပါက၊ ကျေးဇူးပြု၍ ပါမောက္ခ Watkins သို့ ဆက်သွယ်ပါ။</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/myanmar-studies-academics-decry-soas-professor-of-burmese-language-post-closure/\">Myanmar studies academics decry SOAS Professor of Burmese Language post closure</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n"
}