{
  "title": "Stephen Welby: A Man on a Mission",
  "link": "https://spectrum.ieee.org/stephen-welby-profile",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-smiling-man-in-a-suit-and-glasses.jpg?id=31832314&width=1200&height=800&coordinates=0%2C0%2C0%2C300\"/><br/><br/><p>\n\tIn his five years as IEEE’s executive director and chief operating officer, Stephen Welby has led the organization through a global pandemic, a changing publishing landscape, and soaring geopolitical tensions. Welby, an IEEE Fellow, is leaving at the end of the year to spend more time with his family while he explores his career options. The IEEE Board of Directors has named <a href=\"https://www.linkedin.com/in/sophiamuirhead/\" target=\"_blank\">Sophie Muirhead</a>, IEEE’s current general counsel and chief compliance officer, as his replacement.</p><p>\n\tWelby directs the daily operations of IEEE and its approximately 1,000 employees. While the IEEE Board of Directors sets the organization’s policies and strategic direction, the executive director’s job is to implement them and provide input about issues affecting the organization’s future.\n</p><hr/><p>\n\t“I feel comfortable with stepping out of my role at this time because I feel that, in almost every way, thanks to the hard work of volunteers and staff, IEEE is stronger than when I arrived,” Welby says.\n</p><p>\n\tIEEE’s mission of advancing technology for the benefit of humanity drew him to the organization, he says, after he served a term in the Obama administration as U.S. assistant secretary of defense for research and engineering.\n</p><h3>About Stephen Welby</h3><br/><p>\n<strong>Employer:</strong> IEEE\n</p><p>\n<strong>Title:</strong> Executive Director and Chief Operating Officer\n</p><p>\n<strong>Member grade:</strong> Fellow\n</p><p>\n<strong>Alma mater:</strong> The Cooper Union, New York, N.Y.\n</p><p>\n\tThe IEEE position “offered an opportunity to influence and engage a global community,” Welby says. “The work that IEEE is doing is important, and the ideas embedded in our mission statement are big drivers for ensuring that we leave a better world to future generations.\n</p><p>\n\t“IEEE has an ambitious agenda: supporting our members around the world; deepening our technical engagement in emerging areas; building communities and disseminating technical information; meeting a growing demand for technical education; exploring new frontiers of technical standards; and engaging with the broader public about the critical role that technical professionals play in building a better world.”\n</p><h2>A commitment to diversity and the open access publishing model</h2><p>\n\tWelby lists his most important accomplishments as helping to strengthen IEEE’s commitment to diversity, inclusion, and professional ethics; updating the organization’s publication model to increase its embrace of open access; and shoring up its financial footing.\n</p><p>\n\t“IEEE is very considerate in trying to make sure that it is a voice for all of our members,” he says. “We’ve been taking steps to be as inclusive as possible and to find ways that people can participate and contribute—which ties back to our mission. We’ve got to find ways to be open, welcoming, and maybe more than encouraging to ensure that everybody can contribute to the best of their abilities.”\n</p><p>\n\tDuring his tenure, the IEEE Board revised its \n\t<a href=\"https://www.ieee.org/about/diversity-index.html\" rel=\"noopener noreferrer\" target=\"_blank\">policy on diversity</a> to ensure that members have a safe, inclusive place for collegial discourse. Changes also were made to the <a href=\"https://spectrum.ieee.org/board-of-directors-approves-revisions-to-the-ieee-code-of-ethics\" target=\"_self\">IEEE Code of Ethics </a> to focus members on key elements of the code, a commitment not to engage in harassment, and to protect the privacy of others.\n</p><p class=\"pull-quote\">\n\t“The work that IEEE is doing is important, and the ideas embedded in our mission statement are big drivers for ensuring that we leave a better world to future generations.”\n</p><p>\n\tWhen Welby began working for IEEE, he says, the open access publishing movement was perceived as a threat, but today he sees it as an opportunity. The movement calls for making research publications available without fees for the reader.\n</p><p>\n\t“This requires a shift to new business models to cover expenses that were previously funded with subscription fees,” he says. “IEEE has been responsive to this change in a careful, deliberate, and responsible way. We are offering a wide variety of opportunities and tools for people to engage with. The evolution of our publication activity has been about responding to community demands for new and diverse offerings.”\n</p><p>\n<span></span>Twenty open access journals have been launched in the past five years, for a total of 29 in the portfolio. Today they make up more than 20 percent of IEEE’s journal publishing output and that percentage is growing, Welby says.\n</p><p>\n\tHe says he is proud that IEEE is much stronger financially than when he started. In 2018, its total net assets were US $391 million, and by the end of last year it had more than $851 million, he says. He adds that he anticipates strong results for this year as well.\n</p><p>\n\t“To support our mission in perpetuity, IEEE needs strong financial reserves—ideally reserves that are large enough to serve as reliable and stabilizing sources of revenue,” he says. “Doubling our reserves has been a significant accomplishment and represents an investment in our future and our long-term commitment to our mission.”\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A smiling man stands in front of racks of servers\" class=\"rm-shortcode\" data-rm-shortcode-id=\"e56498f718b700ffe74a5fab3754237c\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"368f2\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-smiling-man-stands-in-front-of-racks-of-servers.jpg?id=31832322&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Welby visits IEEE’s server room in its offices in Piscataway, N.J.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Brad Trent</small>\n</p><p>\n\tOther achievements, he says, include the \n\t<a href=\"http://standards.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Standards Association’s</a> facilitation of discussions about the responsible use of <a href=\"https://standards.ieee.org/initiatives/artificial-intelligence-systems/\" rel=\"noopener noreferrer\" target=\"_blank\">artificial intelligence</a>.\n</p><p>\n\tAnother is the work that IEEE-USA has done in helping to shape public policy concerning technology. He points to major U.S. legislation passed this year: the \n\t<a href=\"https://www.congress.gov/bill/117th-congress/house-bill/5376/text\" rel=\"noopener noreferrer\" target=\"_blank\">Inflation Reduction Act</a>, and the <a href=\"https://www.congress.gov/bill/116th-congress/senate-bill/4982/text\" rel=\"noopener noreferrer\" target=\"_blank\">Creating Helpful Incentives for Producing Semiconductors for America and Foundries Act</a>. Welby predicts that other countries will make similar investments, and he says he hopes IEEE will support those as well.\n</p><p>\n\t“IEEE is in an interesting spot relative to public policy in the United States, Europe, and elsewhere because we talk to the concerns of technologists, and about technology and how it impacts regulations and legislation,” he says. “We’re not arguing for a particular stakeholder; we’re arguing for investments in advancing technology. We’re engaged around the world in helping to ensure that research is adequately funded and that technical education gets the support it needs.”\n</p><h2>The impact of the pandemic and global tensions</h2><p>\n\tLeading a global organization that depends on in-person meetings and events has proven especially challenging in recent years. After the coronavirus pandemic began spreading in 2020, the organization suddenly shifted its business model from building communities through in-person engagement to relying almost exclusively on digital delivery, Welby says.\n</p><p>\n\t“IEEE has a reputation for being a conservative organization, for being slow to change, and sometimes for being overly rule-bound and bureaucratic,” he says. “But in the face of a global crisis, we adapted quickly. Staff and volunteers worked closely together to redesign and redeploy IEEE activities in a manner that allowed our communities to remain connected even while physically distancing themselves for safety. There was great trust, great collaboration, and great success.\n</p><p>\n\t “The ability to respond, to change, to evolve, and to adapt is one of IEEE’s great strengths,” he adds. “That makes me feel it will be ready to take on whatever the future brings and deliver on our mission.”\n</p><p>\n\tGeopolitical tensions in recent years have impacted IEEE, he notes. Conflict among countries, trade restrictions, and proliferating international sanctions among nations have created new challenges for IEEE activities, he says.\n</p><p>\n\t“We have worked hard to stay focused on IEEE’s role in supporting an international community of engineers and technical professionals that spans national borders and supports a global commitment to expanding the scientific and technical knowledge of humankind,” he says. “But IEEE also must operate in compliance with applicable laws and regulations while seeking clarification of those that appear misapplied in the IEEE context. At the same time, we are sympathetic to the hardships that international tension can place on our members.”\n</p><p>\n\tCoordinating the enormous scope and scale of IEEE activities is complex. IEEE operates in 160 countries; has 46 societies and councils; has 343 sections in 10 geographic regions; maintains a portfolio of more than 1,075 technical standards; publishes 200 transactions, journals, and magazines; and holds more than 1,900 conferences and events.\n</p><p>\n\t“Trying to maintain coordination and synchronization across this enormous portfolio, managing risk, and prioritizing resources is a continuous challenge,” Welby says.\n</p><p>\n\tHe says his one regret is that more progress has not been made in evolving IEEE’s membership model. The model has remained relatively unchanged since the organization was established in 1963. He points out that overall membership growth has largely flattened, despite the increased role that technology plays in society. Across IEEE there has been a decline in the share of members working in industry, while at the same time there has been recent strong growth in student membership.\n</p><p>\n\t“We continue to rely on face-to-face interaction for many of our core membership activities, despite the growth of online, virtual, and digital communities,” Welby says. “Prospective volunteers are working longer hours [and] have family commitments. Plus, there are other activities competing for their time. The time and energy commitments that IEEE has traditionally demanded of its volunteers may not be a viable strategy in coming decades. It may be time to fundamentally rethink the structure of IEEE membership and explore different ways to engage our members.”\n</p><p>\n\tHe notes that those concerns have been studied and debated, and initiatives have been undertaken to explore alternative membership models. But, he says, there remains more work to do to develop consensus on the future of membership.\n</p><h2>Meeting with industry leaders and engineering students</h2><p>\n\tWelby says he’ll miss the concentrated chaos of an IEEE Board meeting series, where many decisions—great and small—are debated and decided in a short period of time. He’ll also miss talking to audiences of thousands of people about important technical topics, he says, and meeting with leaders from government and industry.\n</p><p>\n\t“I have had the opportunity to see the amazing diversity of our membership,” he says, “and the fantastic work that they do, and their impact on the world. I spent a lot of time talking to as many volunteers in different roles as I could. I have particularly enjoyed engaging with students around the world and seeing their enthusiasm, their creativity, and their optimism. They give me great hope for our future.”\n</p><p>\n\tWelby adds that he could not have accomplished as much as he did without the support and confidence of the IEEE presidents and boards he served, the thousands of IEEE volunteers, his senior management team, and the professional staff members around the world “who brought their creativity, commitment, and technical skills to every task.”\n</p><p>\n\t“I will leave it to others to assess how effective I have been,” he says. “But I have woken up every day for the last five years thinking about what I could do to improve and advance IEEE’s mission.”\n</p>",
  "pubDate": "Wed, 28 Sep 2022 18:00:01 +0000",
  "guid": "https://spectrum.ieee.org/stephen-welby-profile",
  "category": [
    "Ieee member news",
    "Careers",
    "Steven welby",
    "Diversity",
    "Inclusion",
    "Ethics",
    "Open access",
    "Type:ti"
  ],
  "dc:creator": "Kathy Pretz",
  "media:content": ""
}