{
  "id": "https://bibleinoneyear.org/en/youth/19",
  "title": "Day 19: The Most Valuable Thing in the World",
  "description": "Psalm 11:1,7, Genesis 38:25–26, 39:6–22, Matthew 13:36–46.  This is the most valuable pearl of all  It is worth selling ‘everything’ in order to get hold of it",
  "pubDate": "Wed, 19 Jan 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/19/",
  "itunes:duration": "13:39",
  "guid": "enyouth19012022-19",
  "length": 819.62,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 19: The Most Valuable Thing in the World",
  "itunes:subtitle": "Psalm 11:1,7, Genesis 38:25–26, 39:6–22, Matthew 13:36–46.  This is the most valuable pearl of all  It is worth selling ‘everything’ in order to get hold of it",
  "itunes:summary": "Raj was one of six children born into a wealthy Brahmin family - the highest caste in the Indian caste system.\nAt the age of twenty-three, Raj encountered Jesus. His family disinherited him. They cut him off. As far as they were concerned he was dead. They even held a funeral service for him. Neither his parents, nor his brothers and sisters have ever spoken to him again.\nFor several weeks he wandered around the streets of Bangalore. He had virtually no food to eat. He walked all day and slept in the park at night.\nHe started a new life. He began to speak about his new-found faith. Through him, many other people encountered Jesus. For several years he was the National Director of Alpha in India. He says that he has had a blessed life and that God has more than compensated for his losses. Although he left ‘everything’, in Jesus Christ he found the ‘pearl… of great value’ (Matthew 13:45–46).\nRelationships are our most valuable possession. But there is one special relationship for which you were created. This is the most valuable pearl of all. It is worth selling ‘everything’ in order to get hold of it.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 384
}