{
  "id": "yt:video:630ssQ72pyA",
  "yt:videoId": "630ssQ72pyA",
  "yt:channelId": "UCG_nvdTLdijiAAuPKxtvBjA",
  "title": "Sonic 2 — How to Break the Video Game Movie Curse | Film Perfection",
  "link": "",
  "author": {
    "name": "Filmento",
    "uri": "https://www.youtube.com/channel/UCG_nvdTLdijiAAuPKxtvBjA"
  },
  "published": "2022-05-18T17:15:00+00:00",
  "updated": "2022-05-20T07:23:12+00:00",
  "media:group": {
    "media:title": "Sonic 2 — How to Break the Video Game Movie Curse | Film Perfection",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Thanks to Established Titles for sponsoring this video! Use code Filmento to get 10% off on top of their big Memorial Day sale: https://establishedtitles.com/Filmento\n\n2022's Sonic the Hedgehog 2 continues the story of 2020's surprise hit Sonic the Hedgehog. There's a lot to like in the sequel, from in-form Jim Carrey to new characters like Knuckles and Tails. But just like in the first movie, the most amazing thing about Sonic 2 is how it manages to feel like a proper movie despite being based on a video game. Just last week we talked about how Uncharted was affected by the video game movie stigma, and yet Sonic 2 passes all those problems easily. So in today's Film Perfection, let's see how the movie did it. Building on my video on the first Sonic movie, here's a few more ways to break the video game movie curse.\n\nSupport:     https://patreon.com/filmento\nFollow:        https://twitter.com/filmento\n\nMusic:\nhttps://youtu.be/5DwS72t1ky8\nhttps://youtu.be/TT_b3YU8SRk\nhttps://www.youtube.com/c/WhiteBatAudio\n\n#Sonic2 #SonicTheHedgehog2 #FilmPerfection\n\n\n-\nSonic the Hedgehog 2 (2022)\nThe world’s favorite blue hedgehog is back for a next-level adventure in SONIC THE HEDGEHOG 2. After settling in Green Hills, Sonic is eager to prove he has what it takes to be a true hero. His test comes when Dr. Robotnik returns, this time with a new partner, Knuckles, in search for an emerald that has the power to destroy civilizations. Sonic teams up with his own sidekick, Tails, and together they embark on a globe-trotting journey to find the emerald before it falls into the wrong hands. From the filmmakers behind The Fast and the Furious and Deadpool, SONIC THE HEDGEHOG 2 stars James Marsden, Ben Schwartz as the voice of Sonic, Tika Sumpter, Natasha Rothwell, Adam Pally, and Jim Carrey returning, alongside new additions Shemar Moore, with Idris Elba as the voice of Knuckles, and Colleen O'Shaughnessey as the voice of Tails.\n-\nAssassin's Creed (2016)\nIn this feature-film adaptation of the hugely popular video-game series, death-row convict Callum Lynch (Michael Fassbender) relives his ancestor's memories as an assassin in 15th century Spain. From this out-of-body experience, Lynch gains the training he needs to battle a conspiracy in the present day. Marion Cotillard, Jeremy Irons, everything wrong with Sonic the hedgehog 2 honest trailer Sonic 2 ending explained after credits scene sonic vs knuckles sonic vs robotnik eggman sonic 2 full movie online free clips 4k hd only action cinemasins sonic 2 best moments funniest moments sonic 2 tails knuckles sonic 2 great movie bad movie funny moments sonic 3 shadow sonic 2 easter eggs best moments sonic 2 golden sonic ending final battle temple battle sonic 2 snowboard mountain Michael Kenneth Williams, Brendan Gleeson, and Charlotte Rampling co-star. Directed by Justin Kurzel (The Snowtown Murders).",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}