{
  "title": "California’s Proposed Law Could Change the Internet",
  "link": "https://spectrum.ieee.org/californias-proposed-law-could-change-the-internet",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-little-girls-face-lit-up-by-the-smart-phone-she-is-looking-at-in-a-dark-room.jpg?id=31704747&width=1200&height=600&coordinates=0%2C121%2C0%2C919\"/><br/><br/><p><strong>Today, for better </strong>or worse, the Internet is a rather free range for children. Websites ask their users’ ages, sure. But virtually anyone who came of age around the rise of the Internet can probably relate a time or 20 when they gave a false birthdate.</p><p>A California law now in the works might bring that world to a crashing halt.</p><p><a href=\"https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202120220AB2273\" rel=\"noopener noreferrer\" target=\"_blank\">AB 2273</a>, or the California Age-Appropriate Design Code Act, promises to make the Internet safer for children—in part by tightening age verification. Its opponents instead believe that, in the process, AB 2273 could completely decimate the existing Internet as we know it.</p><hr/><p>AB 2273 isn’t final just yet. To become California law, a bill has to pass both houses of the state legislature—the Assembly and the Senate—and then attain the signature of the governor. AB 2273 passed the Assembly on 29 August, and the Senate the next day, posting it to Governor Gavin Newsom’s desk. As of this writing, Newsom has yet to sign the bill. There’s little indication whether he will.</p><p>Suppose he does sign. Then, beginning on 1 July 2024, any website or app that “conducts business in California” and “provides an online service, product, or feature likely to be accessed by children” would need to follow yet-to-be-crafted code. </p><p>California wouldn’t be the first jurisdiction to tighten age-related design standards for websites. AB 2273 explicitly cites an existing law in the United Kingdom, which expects websites to comply with a bespoke <a href=\"https://ico.org.uk/for-organisations/guide-to-data-protection/ico-codes-of-practice/age-appropriate-design-a-code-of-practice-for-online-services/\" rel=\"noopener noreferrer\" target=\"_blank\">age-appropriate design code</a>. (In fact, both bills <a href=\"https://www.techdirt.com/2022/08/25/why-is-a-british-baroness-drafting-california-censorship-laws/\" rel=\"noopener noreferrer\" target=\"_blank\">share a backer</a>, one Baroness Beeban Kidron, <a href=\"https://www.telegraph.co.uk/news/2022/08/13/turned-back-film-career-protect-children-online/\" rel=\"noopener noreferrer\" target=\"_blank\">a campaigner</a> for children’s rights online.)</p><p>That U.K. law <a href=\"https://www.ft.com/content/41b33aa7-7a59-4b50-be47-9911adb34d3e\" rel=\"noopener noreferrer\" target=\"_blank\">has already made ripples</a>. YouTube disabled its autoplay feature for users under 18. Instagram started preventing adults from messaging under-18s who don’t follow them. TikTok stopped sending under-18s push notifications after a certain point each evening.</p><p>But according to <a href=\"https://law.scu.edu/faculty/profile/goldman-eric/\" rel=\"noopener noreferrer\" target=\"_blank\">Eric Goldman</a>, a law professor at Santa Clara University and one of the bill’s harshest critics, in a U.S. regulatory environment that’s generally even less friendly to businesses, California’s code is likely to be stricter. “Any ‘lessons learned’ in the U.K. do not extend to the U.S. because the law literally cannot be implemented in the same way,” he says.</p><h2>What does California’s AB 2273 require tech companies to do?</h2><p>Though California’s code doesn’t yet exist, AB 2273 lays out a few requirements. For one, websites must report their data-management practices to a California government agency. Also, websites can’t collect or sell data on children (including geolocation) that isn’t absolutely necessary for children to use the website. And websites must tell a child when a parent or guardian is tracking their activity on that site.</p><p>Where AB 2273 becomes more than a little controversial is the requirement that, to determine which users ought to experience what, websites must “estimate the age of child users with a reasonable level of certainty.” </p><p>“Assuming businesses do not want to intentionally degrade their value proposition to adults, then they have no alternative other than to authenticate the age of all of their customers and then segregate adults from children, with different offerings for each,” says Goldman. </p><p>How a website will “estimate the age of child users” isn’t clear, and <a href=\"https://www.techdirt.com/2022/08/29/age-verification-providers-say-dont-worry-about-california-design-code-youll-just-have-to-scan-your-face-for-every-website-you-visit/\" target=\"_blank\">according to Techdirt</a>, it might vary by website. A child entering a “high-risk” website, then, might need to submit an ID document for age verification. That failing, a child might literally have to scan their face. Not only is face recognition a technology whose reliability is questionable, mandating it could make websites inaccessible to people without a functioning camera. </p><p>And although the law champions privacy, it’s not clear that authentication along those lines could even be done in a privacy-conscious manner. Goldman says that websites might rely on insecure third-party services.</p><p>If AB 2273 passes, then its effects could spread well beyond the state’s borders. Websites will be left with two options: geolocating users in California (perhaps blocking them completely, potentially risking revenue), or applying the rules to all their users. Many websites will just find it easier to do the latter.</p><p>Then around the world, users might have to face the same age-authentication gauntlet that Californians would. And, according to Goldman, other jurisdictions might take after California in drafting their own laws.</p><p>Some of AB 2273’s sponsors and defenders see the bill as a necessary measure in a world where children are vulnerable to dangers like <a href=\"https://www.wired.com/story/facebook-social-media-privacy-dark-patterns/\" target=\"_blank\">manipulative websites</a>, <a href=\"https://news.bloomberglaw.com/privacy-and-data-security/childrens-apps-unknowingly-collecting-data-pose-compliance-risk\" rel=\"noopener noreferrer\" target=\"_blank\">invasive apps</a>, and <a href=\"https://www.theverge.com/2021/11/18/22789886/states-attorneys-general-investigate-instagram-meta-child-safety-engagement\" rel=\"noopener noreferrer\" target=\"_blank\">social-media addiction</a>.</p><p>But from many corners, the reaction has been less than positive. AB 2273 has garnered a wide range of opponents,  including  <a href=\"https://iapp.org/news/a/california-age-appropriate-design-code-final-passage-brings-mixed-reviews/\" rel=\"noopener noreferrer\" target=\"_blank\">privacy advocates</a> and <a href=\"https://www.axios.com/2022/08/29/california-childrens-internet-privacy-rules\" rel=\"noopener noreferrer\" target=\"_blank\">big tech</a>. Santa Clara’s Goldman likens the law to a neutron bomb. “It will depopulate the Internet and turn many services into ghost towns,” he says.</p>Of course, this is all still hypothetical. For now, the bill awaits Governor Newsom’s signature. Even if that happens, AB 2273 is hardly immune to lawsuits. NetChoice—an advocacy group that has helped take other laws passed in <a href=\"https://netchoice.org/unconstitutional-social-media-bill-circumvents-rights-afforded-under-the-constitution/\" rel=\"noopener noreferrer\" target=\"_blank\">Florida</a> and <a href=\"https://netchoice.org/netchoice-ccia-v-paxton/\" rel=\"noopener noreferrer\" target=\"_blank\">Texas</a> to court—has already <a href=\"https://netchoice.org/gov-newsom-must-say-no-to-ca-tech-bills-that-will-fail-families/\" rel=\"noopener noreferrer\" target=\"_blank\">come out</a> against the bill.",
  "pubDate": "Tue, 20 Sep 2022 16:00:00 +0000",
  "guid": "https://spectrum.ieee.org/californias-proposed-law-could-change-the-internet",
  "category": [
    "Age restriction",
    "California",
    "Legislation",
    "Internet",
    "Privacy"
  ],
  "dc:creator": "Rahul Rao",
  "media:content": ""
}