{
  "title": "Nanowire Synapses 30,000x Faster Than Nature’s",
  "link": "https://spectrum.ieee.org/neuromorphic-computing-superconducting-synapse",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/small-and-large-squares-on-a-grey-background.jpg?id=32013586&width=2000&height=1500&coordinates=41%2C0%2C41%2C0\"/><br/><br/><p>Artificial-intelligence systems are increasingly limited by the hardware used to implement them. Now comes a new superconducting photonic circuit that mimics the links between brain cells—burning just 0.3 percent of the energy of its human counterparts while operating some 30,000 times as fast.</p><p>In <u><a href=\"https://spectrum.ieee.org/deep-neural-network\" target=\"_self\">artificial neural networks</a></u>, components called neurons are fed data and cooperate to solve a problem, such as <u><a href=\"https://spectrum.ieee.org/deep-learning-facial-recognition-technology\" target=\"_self\">recognizing faces</a></u>. The neural net repeatedly adjusts the <u><a href=\"https://spectrum.ieee.org/artificial-synapses\" target=\"_self\">synapses</a></u>—the links between its neurons—and determines whether the resulting patterns of behavior are better at finding a solution. Over time, the network discovers which patterns are best at computing results. It then adopts these patterns as defaults, mimicking the process of learning in the human brain.</p><p>Although <u><a href=\"https://spectrum.ieee.org/ai-failures\" target=\"_self\">AI systems</a></u> are increasingly finding <u><a href=\"https://spectrum.ieee.org/trustworthy-ai\" target=\"_self\">real-world applications</a></u>, they face a number of major challenges, given the hardware used to run them. One solution that researchers have investigated to solve this problem is to develop brain-inspired “<u><a href=\"https://spectrum.ieee.org/neuromorphic-computing-more-than-ai\" target=\"_self\">neuromorphic</a>”</u> computer hardware.</p><p class=\"pull-quote\">“When I look around at all the concepts that have been unearthed, I really feel like we’re onto something.”<br/>—Jeffrey Shainline, NIST</p><p>For instance, neuromorphic microchip components may “<u><a href=\"https://spectrum.ieee.org/neuromorphic-computing-with-lohi2\" target=\"_self\">spike</a></u>,” or generate an output signal, only after they receive a certain amount of input signals over a given time, a strategy that more closely mimics how real biological neurons behave. By only rarely firing spikes, these devices shuffle around much less data than typical artificial neural networks and, in principle, require much less power and communication bandwidth.</p><p>However, neuromorphic hardware typically uses conventional electronics, which ends up limiting their complexity and speed. For example, biological neurons can each possess tens of thousands of synapses, but neuromorphic devices struggle to connect their artificial neurons to a few others. One solution is <u><a href=\"https://spectrum.ieee.org/neural-network-multiplex\" target=\"_self\">multiplexing</a></u>, in which a single data channel may carry many signals at the same time. However, as chips become larger and more intricate, computations may slow down.</p><p>In a new study, researchers explored using optical transmitters and receivers to connect neurons instead. Optical links, or waveguides, can in principle connect each neuron with thousands of others at light-speed communication rates.</p><p>The scientists used superconducting nanowire devices capable of detecting single photons. These optical signals are the smallest possible, constituting the physical limit of energy efficiency.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"\" class=\"rm-shortcode\" data-rm-shortcode-id=\"c0ebb87f220db2429fc16ec5641dd6d3\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"d90a0\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/this-artist-u2019s-u00a0rendering-shows-how-superconducting-circuits-that-mimic-synapses-u2014points-of-interface-between-neuron.jpg?id=32013601&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">This artist’s rendering shows how superconducting circuits that mimic synapses—points of interface between neurons in the brain—might be used to create artificial optoelectronic neurons of the future.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">J. Chiles and J. Shainline/NIST</small></p><p>Performing photonic neural computations is often tricky because optical cavities that can entrap light for long spans of time are usually needed. Creating such cavities, and linking them with many waveguides, is very challenging to accomplish on an integrated microchip.</p><p>Instead, the researchers developed hybrid circuitry, in which the output signals from each detector were converted to ultrafast electrical pulses roughly 2 picoseconds long. These pulses each consisted of a single magnetic fluctuation, or <u><a href=\"https://en.wikipedia.org/wiki/Fluxon\" rel=\"noopener noreferrer\" target=\"_blank\">fluxon</a></u>, within a network of <a href=\"https://en.wikipedia.org/wiki/SQUID\" target=\"_blank\">superconducting quantum-interference devices</a>, or SQUIDs. </p><p>“We’ve been doing theoretical work for years to try to identify the principles that will enable technology that can achieve the physical limits of neuromorphic computing,” says <a href=\"https://www.nist.gov/people/jeff-shainline\" target=\"_blank\">Jeffrey Shainline</a>, a researcher at NIST. “Pursuit of that objective has delivered us to this concept—combine optical communication at the single-photon level with neural computation performed by Josephson junctions.”</p><p>SQUIDs consist of one or more <a href=\"https://spectrum.ieee.org/a-new-hypersensitive-magnetometer-based-on-kinetic-inductance\" target=\"_self\"><u>Josephson j</u><u>unctions</u></a>—a sandwich of superconducting materials separated by a thin insulating film. If the current through the Josephson junction exceeds a certain threshold value, the SQUID begins to produce fluxons.<br/></p><p>Upon sensing a photon, the single-photon detector yields fluxons, which collect as current in the SQUID’s superconducting loop. This stored current serves as a form of memory, providing a record of how many times a neuron produced a spike.</p><p>“It was surprising that it was pretty easy to get the circuits to work,” Shainline says. “The fabrication and experiments took quite a bit of time in the design phase, but the circuits actually worked the first time we fabricated them. That bodes well for the future scalability of such systems.”</p><p>The scientists integrated the single-photon detector with the Josephson junction, creating a superconducting synapse. They calculated that the synapses are capable of spike rates exceeding 10 million hertz while consuming roughly 33 attojoules of power per synaptic event (an attojoule is 10<sup>-18</sup> of a joule). In contrast, human neurons have a maximum average spike rate of about <u><a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5067378/\" target=\"_blank\">340 hertz</a></u> and consume roughly <u><a href=\"https://www.sciencedirect.com/science/article/pii/S2542435121000052\" rel=\"noopener noreferrer\" target=\"_blank\">10 femtojoules</a></u> per synaptic event (a femtojoule is 10<sup>-15</sup> of a joule).</p><p>“When I look around at all the concepts that have been unearthed, I really feel like we’re onto something,” Shainline says. “It could be profoundly transformative.”</p><p>In addition, the scientists can vary the output from their devices from hundreds of nanoseconds to milliseconds. This means the hardware can interface with a range of systems, from high-speed electronics to more leisurely interactions with humans.</p><p>In the future, the researchers will combine their new synapses with on-chip sources of light to create fully integrated superconducting neurons.</p><p>“There are big remaining challenges there, but if we can get that last part integrated, there are many reasons to think the result could be a computational platform of immense power for artificial intelligence,” Shainline says.</p><p>The scientists recently detailed <u><a href=\"https://www.nature.com/articles/s41928-022-00840-9\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a></u> online in the journal <em>Nature Electronics</em>.</p>",
  "pubDate": "Fri, 28 Oct 2022 17:24:53 +0000",
  "guid": "https://spectrum.ieee.org/neuromorphic-computing-superconducting-synapse",
  "category": [
    "Superconducting",
    "Artificial intelligence",
    "Synapse",
    "Josephson junctions",
    "Single-photon detectors",
    "Neural networks",
    "Spiking neural networks",
    "Optoelectronics",
    "Neuromorphic computing"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}