{
  "title": "525 - Bivalent COVID-19 Booster Updates: Dr. Andy Pekosz on Efficacy, Recommendations, and More",
  "itunes:title": "525 - Bivalent COVID-19 Booster Updates: Dr. Andy Pekosz on Efficacy, Recommendations, and More",
  "pubDate": "Mon, 03 Oct 2022 10:00:00 +0000",
  "guid": "9b93dfff-6058-4675-8ec0-d23bcb539430",
  "link": "https://johnshopkinssph.libsyn.com/525-bivalent-covid-19-booster-updates-dr-andy-pekosz-on-efficacy-recommendations-and-more",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Who should get a bivalent booster? How effective are they? How should people space out shots after infection, original strain boosters, and a host of other combinations of immunity and exposure? Can you get a bivalent booster and a flu shot at the same time and are there any benefits to spacing them out? How long did it take for us to get these boosters, and what’s the hope for longer-term immunity? Virologist <strong>Dr. Andy Pekosz</strong> talks with <strong>Stephanie Desmon</strong> about bivalents and answers listener questions sent to</span> <a href= \"mailto:publichealthquestion@jhu.edu\"><span style=\"font-weight: 400;\"> publichealthquestion@jhu.edu</span></a><span style= \"font-weight: 400;\">.</span></p>",
  "content:encoded": "<p>Who should get a bivalent booster? How effective are they? How should people space out shots after infection, original strain boosters, and a host of other combinations of immunity and exposure? Can you get a bivalent booster and a flu shot at the same time and are there any benefits to spacing them out? How long did it take for us to get these boosters, and what’s the hope for longer-term immunity? Virologist Dr. Andy Pekosz talks with Stephanie Desmon about bivalents and answers listener questions sent to <a href= \"mailto:publichealthquestion@jhu.edu\"> publichealthquestion@jhu.edu</a>.</p>",
  "enclosure": "",
  "itunes:duration": "17:04",
  "itunes:explicit": false,
  "itunes:keywords": "vaccine,protection,Pandemic,Variant,boosters,omicron,covid,bivalent",
  "itunes:subtitle": "Who should get a bivalent booster? How effective are they? How should people space out shots after infection, original strain boosters, and a host of other combinations of immunity and exposure? Can you get a bivalent booster and a flu shot at the...",
  "itunes:season": 6,
  "itunes:episode": 525,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}