{
  "title": "Re-thinking the U-Curve of Inequality with Vincent Geloso",
  "pubDate": "Tue, 01 Nov 2016 15:08:52 +0000",
  "guid": "903a568e7f115a1d198be3374db3f4cf",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EPGeloso_EDR.mp3",
  "itunes:image": "",
  "description": "<p>What follows is an edited transcript of my conversation with <a href=\"https://vincentgeloso.com/\" target=\"_blank\">Vincent Geloso</a>.</p> <hr /> <p><strong>Petersen:</strong> My guest today is Vincent Geloso of the Free Market Institute at Texas Tech University. Vincent, welcome to Economics Detective Radio.</p> <p><strong>Geloso:</strong> It's a pleasure to be here.</p> <p><strong>Petersen:</strong> So the paper we'll be discussing today is titled <a href= \"http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2845367\" target=\"_blank\">\"A U-curve of Inequality? Measuring Inequality in the Interwar Period\"</a> which Vincent has co-authored with John Moore and Phillips Schlosser. The paper casts doubt on the claim from, most notably, <a href=\"http://amzn.to/2e7unQc\" target= \"_blank\">Thomas Piketty</a> and others that inequality fell from the 1920s to the 1960s and rose thereafter. So, Vincent let's start by discussing the inequality literature prior to this paper. What is this U-curve and where did it come from?</p> <p><strong>Geloso:</strong> The U-curve is probably the most important stylized fact we have now in the debate over inequality and the idea is that, if you look at the twentieth century, there's a high point of inequality in the 1910s, 1920s and then from the 1930s onwards up to 1970s, it falls dramatically to very low levels and re-increases thereafter, returning to 1920s-like levels of inequality. So the U-curve is the story of inequality in the twentieth century. It's mostly a U.S. story because for other countries it looks less like the U-curve than an inverted J. So it's higher in the 1920s, it still falls like in the U.S. but really increases much more modestly than the United States in places like Sweden, or France, or Canada. But the general story is that there was a high level of inequality at the beginning of the century well up to the mid-second-half of the twentieth century and it re-increased in the latter years and then we have been on a surge since then.</p> <div style=\"float: right; margin-left: 10px;\"><a href= \"https://www.amazon.com/Capital-Twenty-Century-Thomas-Piketty/dp/067443000X/ref=as_li_ss_il?ie=UTF8&qid=1478012100&sr=8-1&keywords=capital&linkCode=li2&tag=economicsde0f-20&linkId=6608646c91b76631a9311bbf7c5b1678\" target=\"_blank\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=067443000X&Format=_SL160_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20\" alt=\"\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&l=li2&o=1&a=067443000X\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p><strong>Petersen:</strong> So, a lot of this is coming from Thomas Piketty, who of course wrote the surprising bestseller <a href=\"http://amzn.to/2e7unQc\" target=\"_blank\">\"Capital in the Twenty-First Century.\"</a> Could you talk a little bit about where his data came from?</p> <p><strong>Geloso:</strong> Okay, by the way, this is where there's a failing on my part which I think I always find funny; an anecdote to tell about Piketty. I'm originally from Quebec, so I am a French-Canadian, I speak fluent French. His work started coming out in French first and I initially started to write elements of the paper we're discussing today back when it was only in French. And then I told myself, \"There's no point, it's only a French book, nobody reads French. What's the point of writing a paper about a book that no one will read?\" Biggest mistake of my career, I guess, not writing that paper before.</p> <p>But anyways, besides that, his entire argument is based largely on <a href=\"http://eml.berkeley.edu/~saez/pikettyqje.pdf\" target= \"_blank\">his most influential paper</a>---which I think was published in 2003 in the Quarterly Journal of Economics---which was using tax data. So, the records, the fiscal statistics to create measurements of income inequality in the United States and the advantage of that is that since the income tax started in 1910s you've got a long, long period of measurement of income inequality with the same source.</p> <p>So it's a great advantage because a lot of the people before like <a href= \"http://blog.bearing-consulting.com/wp-content/uploads/2012/09/Economic.Growth.and_.Income.Inequality.pdf\" target=\"_blank\">Kuznets</a>, like others had to use residual estimates, different sources, they were amalgamating different sources together and it was always a problem because you couldn't create one homogeneous time-series of inequality. You could get a rough idea and there's a few papers---for those who read economic history stuff---there was a paper by <a href= \"http://www.nber.org/chapters/c7443.pdf\" target=\"_blank\">Lindert and Williamson</a> in the 70s in research in economic history and you can see their first graph in that paper was a series of different measures of inequality. They were all pointing to the general similar shaped curve but they were all from massively different statistics, different sources. So one was the 50:10 ratio of earnings, another one was a measure of income, the other was wages and they are all different measures, they are not perfect.</p> <p>You can get a good idea, a rough idea but you cannot have a continuous time estimate which is what Piketty innovated by using the tax-wealth with Emmanuel Saez, recreating this long continuous trend in data from 1917 to the modern day. And they keep updating it regularly to include the new data on a yearly basis.</p> <p><strong>Petersen:</strong> So tell me about tax avoidance. How does that affect things?</p> <p><strong>Geloso:</strong> Okay, this is where the existing data that all the different sources had---Piketty made advancement. Rather than having variance across different sources, he was eliminating that variance. But there's still an issue of variance within a source. So it's not because you have used a homogenous source that the quality of the data contained within the source is consistent. There's actually quite a lot of variance in data quality because of the way the tax system was done.</p> <p>So a lot of the debate today for the data for today has been---has there been such a large increase in inequality as Piketty and Saez and Atkinson and others have been pointing out? And the reason for that was largely because, as <a href= \"http://www.wsj.com/articles/alan-reynolds-why-pikettys-wealth-data-are-worthless-1404945590\" target=\"_blank\">Alan Reynolds</a>, as <a href= \"http://www.nber.org/chapters/c6240\" target=\"_blank\">Joel Slemrod</a>, and a few others have pointed out, the tax changes of the 1980s were so large that people shifted the way they reported income. They changed the way they reported tax liability. What used to be classified as corporate income became classified as individual income, and so you get an artificial increase because of a way the tax system has changed. And this is why a lot of people say, as soon as you correct for the effect of changes in tax reporting behavior, you actually get a much more modest increase of inequality.</p> <p>But that's from 1980 to today with a massive tax change in the 1980s. If you go back further in time, to the interwar period the tax changes are much more dramatic. In 1913, the tax rate was 7%, went up to 15% in 1916 to 73% until 1921, went back down to 24% by 1929, went back up to 79% by 1939. Imagine, that's a lot of movements in the way taxes will affect behavior and it will affect reporting behavior. So, will you report, will you be as honest as you would be when you're filing taxes at 79%, as you are when you're filing taxes at 24%? So you're getting---because of these massive changes in tax regimes that are happening over very short periods of time---these massive changes affect the quality of the data set that Piketty is using for the left side of his U-curve.</p> <p>The left side of the U-curve is probably inaccurate to a very high level because of tax avoidance, and this is where the economists in general failed to talk to historians because there's a few papers out there that did measure---especially in the Journal of Economic History---that did measure changes in reporting. So changes in tax avoidance occur basically to a large level by the top incomes, as <a href= \"https://www.jstor.org/stable/2123554?seq=1#fndtn-page_scan_tab_contents\" target=\"_blank\">Gene Smiley argues in the Journal of Economic History</a>, for example, which Piketty has never cited neither Saez, neither anyone in the debate. And he did corrections, so he checked: Okay, when a tax rate went down from 73% to 24%, did people change their reporting behavior? Did more rich people start to report incomes? And the answer is 'yes.'</p> <p>And as soon as he started doing corrections for that to control the \"artificialness\"---if that's a word---of the tax changes on affecting the level of inequality, he actually finds that the 1920s have a much lower level of inequality because of the reduction in tax rates and there was very little upward trend, especially when we're comparing with the Piketty, with the <a href= \"http://www.shsu.edu/eco_mwf/inequality.html\" target=\"_blank\">Mark Frank</a> data, with the Kuznets data and it shows that as soon as you adjust for tax avoidance the left side of the U-curve flattens dramatically and it looks more like an L---an inverted L---or a J, but it doesn't look at all like a U-curve and that's just tax avoidance for the 1920s. The increases in the 1930s in tax rates would have had the opposite effect where people would have reported less income.</p> <p>So, the level of inequality in the 1920s is overestimated in Piketty and it's underestimated for the 1930s. So you're kind of flattening the entire interwar period as soon as you consider the one issue of tax avoidance. And there are estimates out there in the <a href= \"https://www.econbiz.de/Record/tax-avoidance-in-the-1915-1929-era-keehn-richard/10009923534\" target=\"_blank\">Essays in Economic and Business History by Gene Smiley and Richard Keehn</a>. Smiley's article in the JEH, which has been ignored in the literature, but which did check that people at the top of the income distribution are generally very sensitive to changes in tax regime in the way they report their tax liability.</p> <p><strong>Petersen:</strong> So, today they would do that by maybe registering---having their money in the Cayman Islands or Ireland or the Isle of Man, their tax shelters abroad. Was the avoidance different in the 1920s? I expect it would be harder to enforce taxes given that the income tax was so new and there were all these changes and they didn't have electronic records, or how did it work?</p> <p><strong>Geloso:</strong> You're thinking of avoidance in a very negative term which is the illegal part, which is what has somewhat permeated the public debate and I have this reflex myself. I think of avoidance always in that way. But avoidance is sometimes just planning your taxes, your sources of income, differently. One example would be---and it's not really applicable to our case---parents can put their kids on company payroll because it's cheaper dollar for dollar relative to giving them an allowance from after-tax personal income.</p> <p>So, people can change their behavior in their way to get money, in the way they report their income. So you can pass corporate income as a personal income or personal income as corporate income. You can deduct expenses one way or another. And one way or another it comes to affecting the quality of the data set. And it does matter, because if you look at the 1980s when there was a rapid change in the income tax rate, which was much more important a change than the change in the corporate tax rate, it led people to change the type of incorporation they were in, so they became S corporations, so corporations that were not subjected necessarily to the corporate income tax. So, it affected the way people reported, classified their income and it appears artificially the income inequality statistics.</p> <p>The 1920s' equivalent was municipal bonds. Municipal bonds were assets that delivered incomes but they were not subjected to taxes so this was like a tax shelter that was completely legal and that rich people used in dramatic amount to reduce their tax liability. So, when people think of tax avoidance it's generally this idea that people just reorganized their classification of income to make sure they have the smallest liability possible and in a situation like that, what you get is a much different level and trend of inequality because of the changes in tax regimes that induce changes in tax reporting behavior.</p> <p><strong>Petersen:</strong> So is Piketty not adjusting for this at all? He's just taking the tax data at face value?</p> <p><strong>Geloso:</strong> He's trying some stuff but he gets a lot of the tax history quite wrong and what alerted us to this is that Gene Smiley's paper, which is not in an obscure journal, it's in the Journal of Economic History which is considered a top tier journal in the profession of economics---it's not AER, it's not QJE, but it is a very respectable journal. And Smiley's article is also very cited. There's a large number of citations of that paper and Piketty just ignores it. And you skim through his book and the discussion is always brushed aside and these effects of changes in tax regimes is always minimized as if it was not important.</p> <p>But tax avoidance is only like a fraction of the problem, because if you look, there's another issue that's much more dramatic than tax avoidance. Alone the issue of tax avoidance, if you take Smiley's stuff, changes the narrative dramatically but that's just our first shot in this debate with me, John, and Philip. It's our first shot, the second shot is that filing requirements were nowhere close to what they are like today. And actually this is something funny, the idea of Piketty is that you can create a series assuming tax compliance for a country that was founded on a tax revolt which is---for a historian---kind of a weird assumption built in the way he does his history part. And if you look at it, one of the example is that you look at the changes in wages of people---wages for unskilled workers, wages for mining workers, for agricultural workers---they do not evolve at all like his bottom 90% of income behaves, it behaves actually very differently.</p> <p>So, in our paper we show that the quality of what's at the bottom of the income distribution is dramatically different, so wages go up much faster than the income of the bottom 90%. And this is wages.</p> <p>So, you think what, maybe hours are going down? No they're not in the 1920s and 30s---well in the 30's they're going down---but in 1920s hours are actually staying stable and in some industries are actually slightly increasing. So you should not see what Piketty's data suggest, which is that there was stagnation in the income of the bottom 90%. There was declining unemployment, there was rising wages and hours remaining relatively stable.</p> <p>It's impossible to reconcile these facts with those of Piketty without considering that there might be problems in the way people filed their taxes. And this is where the entire thing breaks down and you look at, for example, the number of tax filers that were actually there. And you look at that as a percentage of the American population, up to the 1930s---so until the Second World War---there's never more than 6 or seven 7 percent of population that files in tax reports.</p> <p><strong>Petersen:</strong> And you'd expect it to be the wealthier people too, who are filing right? Because you have people below a certain income, they don't file income tax, right?</p> <p><strong>Geloso:</strong> Exactly. This wouldn't be a problem if your distribution of people behaved equal to the distribution of the general population and the movements were the same. It wouldn't be a problem. The thing is when you look at the number of adjusted tax returns which is what Piketty and other people like <a href= \"http://www.parisschoolofeconomics.eu/docs/ydepot/semin/texte0506/SOM2006REG.pdf\" target=\"_blank\">Estelle Sommeiller</a> or Mark Frank do. They try to re-correct this issue of a very small number of tax reports that were actually filed in and they get an idea---and this is figured too, I think, in our paper. There's a steady upward trend in the number of adjusted tax units but when you look at the actual number of tax units it moves so much. It goes up and down and it doubles in the span of two years, then it reduces by half in the span of another two years and these are such large movements in the number of tax units that it's hard to see that this might be a representative sample of the American population.</p> <p>Differences in reports and such changes in our reporting---and the number of reports I should say---suggest that there is actually a problem in the quality of the data. And this is where we're saying that if you combine this with the observation that wages were increasing, unemployment was falling, and that hours were more or less stable, and that you add this fact of the massive changes in tax returns, you can easily question the quality of the data from the 1920s and the 1930s.</p> <p>This is where we're coming in and we're saying, no, the people who reported taxes were very volatile. They were rich people who reacted to changes in income taxes. Lower income individuals also were very much tax resisters. There's an entire story told by David Beito. I think it's with University North Carolina Press. He has <a href= \"https://mises.org/library/taxpayers-revolt-tax-resistance-during-great-depression\" target=\"_blank\">a book on tax resistance in the United States during the 1920s and 30s</a> and there's actually a large documentation of anti-tax leagues that have massive memberships of common individuals who are resisting filing taxes at that time.</p> <p>So it's quite plausible to say that, if there's such a difference in wages, in hours, in unemployment what they and these massive changes in the number of tax returns filed, it suggests that probably the poor people just didn't file in their taxes. So, any movement at the bottom of the distribution does not exist according to Piketty's data. But there were movements at the bottom. There were people who moved from poor Kansas to Illinois. They were still in the bottom 90% but by moving from farming Kansas to Chicago to work in a garment industry, they get a gain in income but that is not captured in Piketty's data because it's highly likely that poor individuals tended to file fewer tax returns and were probably more hostile to filing them, and the rich were just reacting to changes in tax regimes. So, the tax filing requirements would actually lower the level of inequality overall from the 1920s and 1930s.</p> <p>So, the tax avoidance issue would change the trend and the issue of tax filing requirements would drop the level because we're not capturing bottom incomes properly. So you're changing the U-curve progressively as each of our critiques is embedded in the argument you actually progressively bring down the left side of the U-curve and it looks more and more like a J, or an L, or a hockey stick.</p> <p><strong>Petersen:</strong> I remember in 2012 Mitt Romney got in trouble for pointing out that 47% of the population doesn't pay income tax. So if Mitt Romney were running for president in the 1920s, I guess he would have said something like 94% of people are not filing and paying income taxes. Is that right?</p> <p><strong>Geloso:</strong> Exactly. That would be a very accurate. Well it's 94% of people. The taxes were based on households, but still 6% and then later on after the Second World War it jumped above 40%. So there's a massive change not only in tax regimes in terms of rates, but filing requirement regimes, which will also change the tax behavior of individuals. And not only that, this is something that actually, it was buried in a footnote of Smiley's article which is---still I will point out not cited by Saez and Piketty---but it's so rigorous and it contains so many pieces of information that are crucial.</p> <p>Until 1938 public sector employees were not mandated to file in taxes. This is an unknown fact. Until 1938 they did not have to file in taxes. So this is actually a very very big factor. So in terms of wage earners, so not everyone, it excludes farmers, but all wage earners, 12% of them were government workers. This is a substantial share of the workforce and not only that, their earnings are slightly above the rest of the workforce and the increase in their earnings is above those of the other workers in the United States in that period. But they're just not considered in the tax distribution. So until the public salary Act of 1939---which was debated in the Senate in 1938-1939, the 1.2 million federal employees---this is a large number---were drawing large wages and they're just not included in the statistics based on tax data.</p> <p>This has a massive impact on the level of inequality. Public workers were not in the top 1%, they were not the richest, they were not poor and they were earning much more over time. I'm not trying to debate whether it was efficient government spending or if they were paid at actually providing public goods that people actually did want. But set that issue aside, they had higher wages than the average representative of a sizeable share of the workforce and their wages increased much more importantly than other ones.</p> <p>So you're affecting the trend. You're affecting the level and you add this other issue and then look again, imagine the U-curve in your head. Tax avoidance, it changed the trend. It made it less, it made it much lower in the 1920s than it was. It increased it relative to the Piketty data in the 1930s. The entire level then is reduced by adjusting for tax filing problems and then if you tried to adjust the issue of public sector employees who didn't have to file in their taxes you drop the level again, so it's looking less and less like a U-curve than what Piketty claims.</p> <p>So, we haven't made all these adjustments, we're just stating facts that should be known in the inequality debate. Our goal is later on to test each of our points. We're sending such a large number of criticisms that there's bound to be one that sticks in terms of the data quality. Because these are such huge data quality that it effects a major stylized fact about inequality: the U-curve. If today we believe that the U-curve---there's a debate over whether or not there's been such a large increase---everybody agrees that there's been an increase, but there's a massive debate over how big this increase is today.</p> <p>Imagine how crucial it would be to correctly debate the level of inequality and the trend of the left side of the U-curve. And if we're having all these debates with all the survey data, all the census data, all the private big data stuff that we have out there for the modern era and we still have high level of uncertainty, imagine anything with all the points I've mentioned for the interwar period, the left side of the U-curve. Everything seems to indicate that's probably much lower. I'm not saying there's not a U-curve, maybe it looks like a ball, a very modest ball, or there's a slight decrease, there's a slight increase, but it's not Piketty's U-curve, it's not the same stylized fact. And it changes the narrative we should have about inequality.</p> <p><strong>Petersen:</strong> Yeah, I'll never forget one experience I had. It was the original Occupy movement and I went down to see the protests going on in Victoria B.C. where I was at the time and one guy just had a big sign where he had printed off a graph. You know, an inequality graph of the 1% versus the 99% from Piketty and Saez. I'm not sure if it went all the way back to the 1920s but really, that's sort of a very clear sign that these debates are expanding beyond academia and having a big effect on the public and their perception of the world we live in, the ideal policies that we should be pursuing. A big part of the U-curve narrative is to say look at how successful the policies in the 40s and 50s were at reducing inequality and of course if we do away with this U-curve then maybe those policies, all they did was bring more people into the data set.</p> <p><strong>Geloso:</strong> Yes, and it changes who reports in the data set. I know <a href= \"http://economicsdetective.com/2016/09/marx-errors-continuing-influence-phil-magness/\" target=\"_blank\">Phil Magness</a>, who is joining our team with me and John Moore and Bill Schlosser. Phil Magness has been working on showing that <a href=\"http://philmagness.com/?p=1828\" target= \"_blank\">a lot of the changes in our tax regime actually just mimic the entire movement of the income share of the top 1%</a>. It follows what share of taxes they're asked to pay and it leads to changes in reporting and basically it's a story of tax regimes and it changes the entire narrative.</p> <p>But what I find much more depressing---and this is a depressing fact---if just one of our criticisms lands and sticks, the U-curve doesn't look like a U. Let's say it looks like a J. So there's a mid-point in the 1920s and we've been increasing since then at a relatively high rate since the 1970s. So it fell from 1920 to 1970 and then it re-increased.</p> <p>If you look at what caused the leveling from 1920 to 1970, a lot of it has nothing to do with state intervention, with the efforts at redistribution. There's probably a sizable share of it that has to do with that. But there's also a sizable, and probably the larger share, that comes from poor regions catching up with rich regions. If you look at for example the history of inequality in the United States you would see that if you decompose the variance---so what caused the inequality---for most of American history a large share of inequality was caused by differences between states rather than differences between individuals.</p> <p>One way to see it, and I'm making a caricature here to get the point across, but you could have the same shape of distribution in income in Kansas and New York. But since the average in New York is much higher than in Kansas, you average the two in, you get a much higher level of inequality, so you can get like a Gini coefficient for the two of them of .4 but in each of them individually taken the level inequality is like .2. And this is what happens for most of US history. There are massive gaps between regions rather than gaps between skills, between levels, so Mississippi is poorer than New York for a long period of time. But in the 40s, 50s, 60s, 70s this gap basically volatilized, it began to disappear.</p> <p>One of the massive story of the twentieth century---some economists are aware---is this massiveness of convergence between regions. So the South gets richer. Poor black people move from poor states in the South where they're sharecroppers, they move to the North where they become wage earners in garment factories, in manufacturing and their earnings grow dramatically. So there's a massive convergence during that period. But, if you think about it for a second, it means that the gap between regions and the gap between races is actually a big driver in the leveling part of the U-curve, but that has nothing to do with tax redistribution. It has nothing to do with this.</p> <p>So, as soon as we integrate our criticism into the tax data, and we show that the U-curve looks less and less like a U, the left side of it makes it look less and less like a U. And you consider these two economic history facts that I've just mentioned, it's incredibly depressing to consider in the inequality narrative, to say well a lot of it is just stuff that would have happened anyways. There would have been a decline in inequality regardless of how much the state intervened to redistribute income because there was this convergence. And not only that, the leveling of inequality was not as great as we say it was. So it changes the entire story.</p> <p>We have inequality and how to address the issue and, not only that, I will point out that across the same period the one thing that goes up relatively steadily is government spending to GDP. If you were to account for all our criticism and then consider which part of inequality was reduced by government redistribution, it becomes more and more depressing because it seems like the effect is much smaller than people believe.</p> <p>This is where we're trying to disentangle all these elements to tell the correct story of inequality in the United States and it starts with getting the shape of inequality right. But look at the story I have just told you. As soon as we make this small change of properly assessing things, the entire narrative we have then changes. And this is why it's a dramatic fact to get right and which is why we're somewhat disappointed with Piketty's stuff because he's not making the right level of methodological discussion.</p> <p><strong>Petersen:</strong> Right. Piketty uses his narrative to push for large-scale taxes and redistribution.</p> <p><strong>Geloso:</strong> Yes. I'm not saying that what he does is bad. It was a massive improvement relative to what was there before. But his story has flaws, and these flaws tend to support his narrative. We point out the flaws that would support a different narrative, that point out that probably inequality is not as high as we say. It probably would have fallen up in the 1970s because of very natural forces and if you think about the fact that since the 1970s there's been a slight divergence---so, imagine the leveling of inequality between regions in the United States. The divergence fell until the 1970s, but it has increased modestly since then because of regulation on housing, things that limit mobility across states that the depress income growth in some areas.</p> <p>So you end up with a slight divergence since then and it is caused by states. It's not caused by anything that the government is doing. It's really an issue of very regionalized factors and each time you consider each of these nuances in, the narrative changes. And it changes dramatically against the story Piketty's telling and it shows that the flaws are biased in favor of the conclusion he supported.</p> <p><strong>Petersen:</strong> Right. And I know Phil Magness has really criticized him on this, that he makes a lot of decisions where you could go one way or the other and they always seem to turn out his way. Which is maybe a coincidence, or maybe it's not really the best way to do social science.</p> <p>You point out that there were big price differentials between regions so how does that play into the regional inequality story?</p> <p><strong>Geloso:</strong> So, we're basing our discussion on this part of a longer series of papers where each of the points we've discussed will basically be one paper in itself. Here we're just stating this entire case for skepticism, then we'll see how big the impact is. Regardless, even if they're all minor, they will all change the narrative. And prices, regional price differences are an issue in that.</p> <p>So, when you compare nominal income across a country you are getting an idea of inequality but---you will agree with me. So, you're in Vancouver. I'm originally from Montreal. If I give you a dollar income in Vancouver and I give myself a one-dollar income in Montreal you think that dollar will go as far in Vancouver as it does in Montreal?</p> <p><strong>Petersen:</strong> I think it probably won't.</p> <p><strong>Geloso:</strong> Exactly. So you would expect that regional price differences will affect the level of inequality. And there's actually a lot of people that do that. Each time you make controls for the level of price differences, you actually find that the level of inequality falls modestly. But it falls.</p> <p>But the thing is, the price differences that we have today between Vancouver to Montreal or between New York and the region of Mississippi are not at all what these gaps used to be in 1920 or in 1925. In 1925 the gaps would have been much, much, much larger and from 1925 to the 1940s there's been a convergence of prices across regions. So for the first 50 years, roughly, of the twentieth century you get a convergence of prices across regions. So if you just took nominal income without correcting for regional price differences, you would get a massive drop in inequality.</p> <p>However, if you were to correct for an increasingly smaller mistake because, if you think about it, if the wage gaps used to be on average 25% in 1890, let's say, and they used to be 5% in 1950, the error is decreasing over time. So you're getting the level off by a smaller and smaller quantity over time. So it means that the trend changes. The smaller your measurement error caused by regional price differences falls, the less pronounced the fall in inequality becomes. So you get a massive drop in inequality as measured by nominal income, which is not what it is when you correct the regional price differences, so you put this in real dollars adjusted for purchasing power parity.</p> <p>And not only that, the errors caused by regional prices actually also follow a U-curve. So the errors that would be caused by price level differences across regions declined up to 1950 but since then they've re-increased. So if before you're getting a lower and lower trend---a lower trend by a diminishing amount of error---that means the right side of the curve, that means the increasing disparity in prices across regions since 1950. It means that you're actually increasing nominal prices using nominal income across the country. You will underestimate the increase in inequality since then.</p> <p>So there are actually massive measurement errors caused by this issue of regional prices. When I say massive, I shouldn't say massive because it's dishonest but it affects both the level and the trends. So it affects the shape of the curve and remember we're making all these criticisms to the U-curve story piece by piece. Each one of them has a small prickly effect on the shape of the curve. As soon as one or more starts sticking---and they're all documented otherwise for other periods---not prior interwar period, not a sufficiently as we'd wish to, which is why we're doing this project of massive data collection.</p> <p>It changes the narrative, changes the story, changes the way the curve looks and it's not much of a U-curve anymore and the proper measurements get you a very different story of the evolution of inequality. And that different story forces you to change interpretations and solutions and the entire structure of the debate must change to reflect the higher level of precision that is required for that debate.</p> <p><strong>Petersen:</strong> So. I'm trying to think of why these prices between regions might fall in the first half of the twentieth century and rise thereafter. I suppose a lot of it would be real estate, housing?</p> <p><strong>Geloso:</strong> Exactly. So housing markets in the U.S. are more or less freer in the first half of the twentieth century than they are today. So most prices, if you can trade a good across borders it will arbitrage out price differences minus transport, right? So if goods are movable more or less as well, and you find it for food, for TVs, for durable goods, you tend to find that there's actually still convergence.</p> <p>But housing, you can't really move a house. There's actually movable houses but they're not a massive share of the market. So you'd expect less ability---and I'm saying this as a euphemism---but you'd expect less ability for arbitrage with housing. The only way you can do arbitrage for housing is by moving around.</p> <p>So I am in Mississippi and I see super high wages in New York. I move from Mississippi to New York. So in Mississippi there's one more housing unit available and in New York there's one less housing unit available. I've driven up housing prices in New York and I've got higher wages but housing is a little more expensive in New York and then it falls in the region where I left in terms of housing, so that real wages in that region converged. So there's a convergence in real wages by people moving around.</p> <p>The problem now is that, there is very, very, very little ability to move around in the United States because zoning restrictions actually make it harder for people to come and exploit the productivity of large cities like New York. So it prevents this convergence in real terms across regions.</p> <p>So a large part of the increase in inequality needs to be corrected for regional price differences, which is the argument about housing. And this is where it's probably that the soundest part of our argument is that the Rognlie papers that attack Piketty state that a large part of inequality was driven by rents towards housing, so the fact that income derives from housing is increasing importantly as a share of total income and has nothing to do with capital itself. It's really the artificial restrictions on housing.</p> <p>And this is largely the problem the inability of people to move to where wages are the most important. This changes the narrative. So that's why the story of regionally correcting price differences is crucial and it's rarely done over a long time series data set. But given the evolution of prices in the United States since 1900, it will affect the trend dramatically.</p> <p>It will affect the level, the shape, and this is not integrated in the argument. And this is why we're saying in this paper, each time you make a correction to get a higher level of precision, it's getting more and more plausible that the curve of inequality doesn't look like a U, it looks probably like an L, probably like a J, but not a U. So the early period of the twentieth century is not as high as people have claimed and there's probably been an increase since the 1970s. Not as much as some would claim, but the increase seems to have happened. The U-curve is probably just fictional. It is the result of poor controls or variations in equality of the taxes.</p> <p><strong>Petersen:</strong> We've discussed the housing issue on <a href= \"http://economicsdetective.com/2016/09/trailer-parks-zoning-market-urbanism-nolan-gray/\" target=\"_blank\">other</a> <a href= \"http://economicsdetective.com/2016/09/urban-development-growth-ponzi-scheme-strong-towns-chuck-marohn/\" target=\"_blank\">episodes</a> of <a href= \"http://economicsdetective.com/2016/10/new-york-urbanism-stephen-smith/\" target=\"_blank\">this</a> <a href= \"http://economicsdetective.com/2016/10/land-use-restrictions-make-housing-unaffordable-emily-hamilton/\" target=\"_blank\">podcast</a> but it's sort of a one-two punch to inequality, where the people who, you know, maybe have bought a house in the San Francisco Bay area in the 1980s, have seen the value of that house skyrocket. And so of course that would contribute to the upper end of that wealth distribution. And the people who live in Mississippi and might like to move to the San Francisco Bay area and work for Google, can't afford to do it because of the extremely high price of rent there. So, that's reducing mobility and exacerbating these regional differences and also directly increasing the wealth of people who own homes who are, of course, already on the wealthier side.</p> <p><strong>Geloso:</strong> Yes, in a static term, correcting for price differences across region. So if you were to take a picture of the economy right now and you make a picture of inequality based only on nominal incomes across the country---just using U.S. dollars---you'll get a higher level than if you correct for regional price differences.</p> <p>However, it's quite likely that if you were to make a movie of how inequality evolved, the housing restrictions---and this is a comment that's outside our paper and it's just something I think it's worth commenting on---if you make it so that it's impossible to move from low-income Mississippi to high-income California, you're going to make sure that inequality stays high and probably increases.</p> <p>If, let's say, there's a shock to international trade and Mississippi area tended to be manufacturing and people can't move from manufacturing to higher productivity jobs in San Francisco. So in dynamic terms, housing restrictions by preventing mobility prevent a strong equalizing source of income. So in static terms you get the level wrong, but in a dynamic term you're preventing the powerful force of mobility across the country---and this is something I like to point out---if you look for example, you bring someone from Italy to Canada in 1890, his income increased 300% as soon as he got to Canada. He was much richer the minute he set foot in Canada. You probably increased inequality in Canada---I don't know about if you decrease it or increase it in Italy---but when you move that guy away, you probably reduce global inequality. So by moving people to where the incomes are higher you level off inequality.</p> <p>In the United States it's the same narrative, you prevent this equalizing force from working through housing restrictions and making adjustments for---this is beyond the scope of our own research---but making adjustments for the increasing restrictiveness of housing that prevents mobility, you will probably get a large part of increasing inequality in the United States or even in England, which is also a situation like that, and in France, is not the result of terrible market forces responding to terrible government policies.</p> <p><strong>Petersen:</strong> My guest today has been Vincent Geloso. Vincent thanks for being part of Economics Detective Radio.</p> <p><strong>Geloso:</strong> It was a pleasure.</p> <hr /> <p> </p>",
  "content:encoded": "<p>What follows is an edited transcript of my conversation with <a href=\"https://vincentgeloso.com/\" target=\"_blank\">Vincent Geloso</a>.</p>  <p>Petersen: My guest today is Vincent Geloso of the Free Market Institute at Texas Tech University. Vincent, welcome to Economics Detective Radio.</p> <p>Geloso: It's a pleasure to be here.</p> <p>Petersen: So the paper we'll be discussing today is titled <a href= \"http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2845367\" target=\"_blank\">\"A U-curve of Inequality? Measuring Inequality in the Interwar Period\"</a> which Vincent has co-authored with John Moore and Phillips Schlosser. The paper casts doubt on the claim from, most notably, <a href=\"http://amzn.to/2e7unQc\" target= \"_blank\">Thomas Piketty</a> and others that inequality fell from the 1920s to the 1960s and rose thereafter. So, Vincent let's start by discussing the inequality literature prior to this paper. What is this U-curve and where did it come from?</p> <p>Geloso: The U-curve is probably the most important stylized fact we have now in the debate over inequality and the idea is that, if you look at the twentieth century, there's a high point of inequality in the 1910s, 1920s and then from the 1930s onwards up to 1970s, it falls dramatically to very low levels and re-increases thereafter, returning to 1920s-like levels of inequality. So the U-curve is the story of inequality in the twentieth century. It's mostly a U.S. story because for other countries it looks less like the U-curve than an inverted J. So it's higher in the 1920s, it still falls like in the U.S. but really increases much more modestly than the United States in places like Sweden, or France, or Canada. But the general story is that there was a high level of inequality at the beginning of the century well up to the mid-second-half of the twentieth century and it re-increased in the latter years and then we have been on a surge since then.</p> <a href= \"https://www.amazon.com/Capital-Twenty-Century-Thomas-Piketty/dp/067443000X/ref=as_li_ss_il?ie=UTF8&qid=1478012100&sr=8-1&keywords=capital&linkCode=li2&tag=economicsde0f-20&linkId=6608646c91b76631a9311bbf7c5b1678\" target=\"_blank\"></a> <p>Petersen: So, a lot of this is coming from Thomas Piketty, who of course wrote the surprising bestseller <a href=\"http://amzn.to/2e7unQc\" target=\"_blank\">\"Capital in the Twenty-First Century.\"</a> Could you talk a little bit about where his data came from?</p> <p>Geloso: Okay, by the way, this is where there's a failing on my part which I think I always find funny; an anecdote to tell about Piketty. I'm originally from Quebec, so I am a French-Canadian, I speak fluent French. His work started coming out in French first and I initially started to write elements of the paper we're discussing today back when it was only in French. And then I told myself, \"There's no point, it's only a French book, nobody reads French. What's the point of writing a paper about a book that no one will read?\" Biggest mistake of my career, I guess, not writing that paper before.</p> <p>But anyways, besides that, his entire argument is based largely on <a href=\"http://eml.berkeley.edu/~saez/pikettyqje.pdf\" target= \"_blank\">his most influential paper</a>---which I think was published in 2003 in the Quarterly Journal of Economics---which was using tax data. So, the records, the fiscal statistics to create measurements of income inequality in the United States and the advantage of that is that since the income tax started in 1910s you've got a long, long period of measurement of income inequality with the same source.</p> <p>So it's a great advantage because a lot of the people before like <a href= \"http://blog.bearing-consulting.com/wp-content/uploads/2012/09/Economic.Growth.and_.Income.Inequality.pdf\" target=\"_blank\">Kuznets</a>, like others had to use residual estimates, different sources, they were amalgamating different sources together and it was always a problem because you couldn't create one homogeneous time-series of inequality. You could get a rough idea and there's a few papers---for those who read economic history stuff---there was a paper by <a href= \"http://www.nber.org/chapters/c7443.pdf\" target=\"_blank\">Lindert and Williamson</a> in the 70s in research in economic history and you can see their first graph in that paper was a series of different measures of inequality. They were all pointing to the general similar shaped curve but they were all from massively different statistics, different sources. So one was the 50:10 ratio of earnings, another one was a measure of income, the other was wages and they are all different measures, they are not perfect.</p> <p>You can get a good idea, a rough idea but you cannot have a continuous time estimate which is what Piketty innovated by using the tax-wealth with Emmanuel Saez, recreating this long continuous trend in data from 1917 to the modern day. And they keep updating it regularly to include the new data on a yearly basis.</p> <p>Petersen: So tell me about tax avoidance. How does that affect things?</p> <p>Geloso: Okay, this is where the existing data that all the different sources had---Piketty made advancement. Rather than having variance across different sources, he was eliminating that variance. But there's still an issue of variance within a source. So it's not because you have used a homogenous source that the quality of the data contained within the source is consistent. There's actually quite a lot of variance in data quality because of the way the tax system was done.</p> <p>So a lot of the debate today for the data for today has been---has there been such a large increase in inequality as Piketty and Saez and Atkinson and others have been pointing out? And the reason for that was largely because, as <a href= \"http://www.wsj.com/articles/alan-reynolds-why-pikettys-wealth-data-are-worthless-1404945590\" target=\"_blank\">Alan Reynolds</a>, as <a href= \"http://www.nber.org/chapters/c6240\" target=\"_blank\">Joel Slemrod</a>, and a few others have pointed out, the tax changes of the 1980s were so large that people shifted the way they reported income. They changed the way they reported tax liability. What used to be classified as corporate income became classified as individual income, and so you get an artificial increase because of a way the tax system has changed. And this is why a lot of people say, as soon as you correct for the effect of changes in tax reporting behavior, you actually get a much more modest increase of inequality.</p> <p>But that's from 1980 to today with a massive tax change in the 1980s. If you go back further in time, to the interwar period the tax changes are much more dramatic. In 1913, the tax rate was 7%, went up to 15% in 1916 to 73% until 1921, went back down to 24% by 1929, went back up to 79% by 1939. Imagine, that's a lot of movements in the way taxes will affect behavior and it will affect reporting behavior. So, will you report, will you be as honest as you would be when you're filing taxes at 79%, as you are when you're filing taxes at 24%? So you're getting---because of these massive changes in tax regimes that are happening over very short periods of time---these massive changes affect the quality of the data set that Piketty is using for the left side of his U-curve.</p> <p>The left side of the U-curve is probably inaccurate to a very high level because of tax avoidance, and this is where the economists in general failed to talk to historians because there's a few papers out there that did measure---especially in the Journal of Economic History---that did measure changes in reporting. So changes in tax avoidance occur basically to a large level by the top incomes, as <a href= \"https://www.jstor.org/stable/2123554?seq=1#fndtn-page_scan_tab_contents\" target=\"_blank\">Gene Smiley argues in the Journal of Economic History</a>, for example, which Piketty has never cited neither Saez, neither anyone in the debate. And he did corrections, so he checked: Okay, when a tax rate went down from 73% to 24%, did people change their reporting behavior? Did more rich people start to report incomes? And the answer is 'yes.'</p> <p>And as soon as he started doing corrections for that to control the \"artificialness\"---if that's a word---of the tax changes on affecting the level of inequality, he actually finds that the 1920s have a much lower level of inequality because of the reduction in tax rates and there was very little upward trend, especially when we're comparing with the Piketty, with the <a href= \"http://www.shsu.edu/eco_mwf/inequality.html\" target=\"_blank\">Mark Frank</a> data, with the Kuznets data and it shows that as soon as you adjust for tax avoidance the left side of the U-curve flattens dramatically and it looks more like an L---an inverted L---or a J, but it doesn't look at all like a U-curve and that's just tax avoidance for the 1920s. The increases in the 1930s in tax rates would have had the opposite effect where people would have reported less income.</p> <p>So, the level of inequality in the 1920s is overestimated in Piketty and it's underestimated for the 1930s. So you're kind of flattening the entire interwar period as soon as you consider the one issue of tax avoidance. And there are estimates out there in the <a href= \"https://www.econbiz.de/Record/tax-avoidance-in-the-1915-1929-era-keehn-richard/10009923534\" target=\"_blank\">Essays in Economic and Business History by Gene Smiley and Richard Keehn</a>. Smiley's article in the JEH, which has been ignored in the literature, but which did check that people at the top of the income distribution are generally very sensitive to changes in tax regime in the way they report their tax liability.</p> <p>Petersen: So, today they would do that by maybe registering---having their money in the Cayman Islands or Ireland or the Isle of Man, their tax shelters abroad. Was the avoidance different in the 1920s? I expect it would be harder to enforce taxes given that the income tax was so new and there were all these changes and they didn't have electronic records, or how did it work?</p> <p>Geloso: You're thinking of avoidance in a very negative term which is the illegal part, which is what has somewhat permeated the public debate and I have this reflex myself. I think of avoidance always in that way. But avoidance is sometimes just planning your taxes, your sources of income, differently. One example would be---and it's not really applicable to our case---parents can put their kids on company payroll because it's cheaper dollar for dollar relative to giving them an allowance from after-tax personal income.</p> <p>So, people can change their behavior in their way to get money, in the way they report their income. So you can pass corporate income as a personal income or personal income as corporate income. You can deduct expenses one way or another. And one way or another it comes to affecting the quality of the data set. And it does matter, because if you look at the 1980s when there was a rapid change in the income tax rate, which was much more important a change than the change in the corporate tax rate, it led people to change the type of incorporation they were in, so they became S corporations, so corporations that were not subjected necessarily to the corporate income tax. So, it affected the way people reported, classified their income and it appears artificially the income inequality statistics.</p> <p>The 1920s' equivalent was municipal bonds. Municipal bonds were assets that delivered incomes but they were not subjected to taxes so this was like a tax shelter that was completely legal and that rich people used in dramatic amount to reduce their tax liability. So, when people think of tax avoidance it's generally this idea that people just reorganized their classification of income to make sure they have the smallest liability possible and in a situation like that, what you get is a much different level and trend of inequality because of the changes in tax regimes that induce changes in tax reporting behavior.</p> <p>Petersen: So is Piketty not adjusting for this at all? He's just taking the tax data at face value?</p> <p>Geloso: He's trying some stuff but he gets a lot of the tax history quite wrong and what alerted us to this is that Gene Smiley's paper, which is not in an obscure journal, it's in the Journal of Economic History which is considered a top tier journal in the profession of economics---it's not AER, it's not QJE, but it is a very respectable journal. And Smiley's article is also very cited. There's a large number of citations of that paper and Piketty just ignores it. And you skim through his book and the discussion is always brushed aside and these effects of changes in tax regimes is always minimized as if it was not important.</p> <p>But tax avoidance is only like a fraction of the problem, because if you look, there's another issue that's much more dramatic than tax avoidance. Alone the issue of tax avoidance, if you take Smiley's stuff, changes the narrative dramatically but that's just our first shot in this debate with me, John, and Philip. It's our first shot, the second shot is that filing requirements were nowhere close to what they are like today. And actually this is something funny, the idea of Piketty is that you can create a series assuming tax compliance for a country that was founded on a tax revolt which is---for a historian---kind of a weird assumption built in the way he does his history part. And if you look at it, one of the example is that you look at the changes in wages of people---wages for unskilled workers, wages for mining workers, for agricultural workers---they do not evolve at all like his bottom 90% of income behaves, it behaves actually very differently.</p> <p>So, in our paper we show that the quality of what's at the bottom of the income distribution is dramatically different, so wages go up much faster than the income of the bottom 90%. And this is wages.</p> <p>So, you think what, maybe hours are going down? No they're not in the 1920s and 30s---well in the 30's they're going down---but in 1920s hours are actually staying stable and in some industries are actually slightly increasing. So you should not see what Piketty's data suggest, which is that there was stagnation in the income of the bottom 90%. There was declining unemployment, there was rising wages and hours remaining relatively stable.</p> <p>It's impossible to reconcile these facts with those of Piketty without considering that there might be problems in the way people filed their taxes. And this is where the entire thing breaks down and you look at, for example, the number of tax filers that were actually there. And you look at that as a percentage of the American population, up to the 1930s---so until the Second World War---there's never more than 6 or seven 7 percent of population that files in tax reports.</p> <p>Petersen: And you'd expect it to be the wealthier people too, who are filing right? Because you have people below a certain income, they don't file income tax, right?</p> <p>Geloso: Exactly. This wouldn't be a problem if your distribution of people behaved equal to the distribution of the general population and the movements were the same. It wouldn't be a problem. The thing is when you look at the number of adjusted tax returns which is what Piketty and other people like <a href= \"http://www.parisschoolofeconomics.eu/docs/ydepot/semin/texte0506/SOM2006REG.pdf\" target=\"_blank\">Estelle Sommeiller</a> or Mark Frank do. They try to re-correct this issue of a very small number of tax reports that were actually filed in and they get an idea---and this is figured too, I think, in our paper. There's a steady upward trend in the number of adjusted tax units but when you look at the actual number of tax units it moves so much. It goes up and down and it doubles in the span of two years, then it reduces by half in the span of another two years and these are such large movements in the number of tax units that it's hard to see that this might be a representative sample of the American population.</p> <p>Differences in reports and such changes in our reporting---and the number of reports I should say---suggest that there is actually a problem in the quality of the data. And this is where we're saying that if you combine this with the observation that wages were increasing, unemployment was falling, and that hours were more or less stable, and that you add this fact of the massive changes in tax returns, you can easily question the quality of the data from the 1920s and the 1930s.</p> <p>This is where we're coming in and we're saying, no, the people who reported taxes were very volatile. They were rich people who reacted to changes in income taxes. Lower income individuals also were very much tax resisters. There's an entire story told by David Beito. I think it's with University North Carolina Press. He has <a href= \"https://mises.org/library/taxpayers-revolt-tax-resistance-during-great-depression\" target=\"_blank\">a book on tax resistance in the United States during the 1920s and 30s</a> and there's actually a large documentation of anti-tax leagues that have massive memberships of common individuals who are resisting filing taxes at that time.</p> <p>So it's quite plausible to say that, if there's such a difference in wages, in hours, in unemployment what they and these massive changes in the number of tax returns filed, it suggests that probably the poor people just didn't file in their taxes. So, any movement at the bottom of the distribution does not exist according to Piketty's data. But there were movements at the bottom. There were people who moved from poor Kansas to Illinois. They were still in the bottom 90% but by moving from farming Kansas to Chicago to work in a garment industry, they get a gain in income but that is not captured in Piketty's data because it's highly likely that poor individuals tended to file fewer tax returns and were probably more hostile to filing them, and the rich were just reacting to changes in tax regimes. So, the tax filing requirements would actually lower the level of inequality overall from the 1920s and 1930s.</p> <p>So, the tax avoidance issue would change the trend and the issue of tax filing requirements would drop the level because we're not capturing bottom incomes properly. So you're changing the U-curve progressively as each of our critiques is embedded in the argument you actually progressively bring down the left side of the U-curve and it looks more and more like a J, or an L, or a hockey stick.</p> <p>Petersen: I remember in 2012 Mitt Romney got in trouble for pointing out that 47% of the population doesn't pay income tax. So if Mitt Romney were running for president in the 1920s, I guess he would have said something like 94% of people are not filing and paying income taxes. Is that right?</p> <p>Geloso: Exactly. That would be a very accurate. Well it's 94% of people. The taxes were based on households, but still 6% and then later on after the Second World War it jumped above 40%. So there's a massive change not only in tax regimes in terms of rates, but filing requirement regimes, which will also change the tax behavior of individuals. And not only that, this is something that actually, it was buried in a footnote of Smiley's article which is---still I will point out not cited by Saez and Piketty---but it's so rigorous and it contains so many pieces of information that are crucial.</p> <p>Until 1938 public sector employees were not mandated to file in taxes. This is an unknown fact. Until 1938 they did not have to file in taxes. So this is actually a very very big factor. So in terms of wage earners, so not everyone, it excludes farmers, but all wage earners, 12% of them were government workers. This is a substantial share of the workforce and not only that, their earnings are slightly above the rest of the workforce and the increase in their earnings is above those of the other workers in the United States in that period. But they're just not considered in the tax distribution. So until the public salary Act of 1939---which was debated in the Senate in 1938-1939, the 1.2 million federal employees---this is a large number---were drawing large wages and they're just not included in the statistics based on tax data.</p> <p>This has a massive impact on the level of inequality. Public workers were not in the top 1%, they were not the richest, they were not poor and they were earning much more over time. I'm not trying to debate whether it was efficient government spending or if they were paid at actually providing public goods that people actually did want. But set that issue aside, they had higher wages than the average representative of a sizeable share of the workforce and their wages increased much more importantly than other ones.</p> <p>So you're affecting the trend. You're affecting the level and you add this other issue and then look again, imagine the U-curve in your head. Tax avoidance, it changed the trend. It made it less, it made it much lower in the 1920s than it was. It increased it relative to the Piketty data in the 1930s. The entire level then is reduced by adjusting for tax filing problems and then if you tried to adjust the issue of public sector employees who didn't have to file in their taxes you drop the level again, so it's looking less and less like a U-curve than what Piketty claims.</p> <p>So, we haven't made all these adjustments, we're just stating facts that should be known in the inequality debate. Our goal is later on to test each of our points. We're sending such a large number of criticisms that there's bound to be one that sticks in terms of the data quality. Because these are such huge data quality that it effects a major stylized fact about inequality: the U-curve. If today we believe that the U-curve---there's a debate over whether or not there's been such a large increase---everybody agrees that there's been an increase, but there's a massive debate over how big this increase is today.</p> <p>Imagine how crucial it would be to correctly debate the level of inequality and the trend of the left side of the U-curve. And if we're having all these debates with all the survey data, all the census data, all the private big data stuff that we have out there for the modern era and we still have high level of uncertainty, imagine anything with all the points I've mentioned for the interwar period, the left side of the U-curve. Everything seems to indicate that's probably much lower. I'm not saying there's not a U-curve, maybe it looks like a ball, a very modest ball, or there's a slight decrease, there's a slight increase, but it's not Piketty's U-curve, it's not the same stylized fact. And it changes the narrative we should have about inequality.</p> <p>Petersen: Yeah, I'll never forget one experience I had. It was the original Occupy movement and I went down to see the protests going on in Victoria B.C. where I was at the time and one guy just had a big sign where he had printed off a graph. You know, an inequality graph of the 1% versus the 99% from Piketty and Saez. I'm not sure if it went all the way back to the 1920s but really, that's sort of a very clear sign that these debates are expanding beyond academia and having a big effect on the public and their perception of the world we live in, the ideal policies that we should be pursuing. A big part of the U-curve narrative is to say look at how successful the policies in the 40s and 50s were at reducing inequality and of course if we do away with this U-curve then maybe those policies, all they did was bring more people into the data set.</p> <p>Geloso: Yes, and it changes who reports in the data set. I know <a href= \"http://economicsdetective.com/2016/09/marx-errors-continuing-influence-phil-magness/\" target=\"_blank\">Phil Magness</a>, who is joining our team with me and John Moore and Bill Schlosser. Phil Magness has been working on showing that <a href=\"http://philmagness.com/?p=1828\" target= \"_blank\">a lot of the changes in our tax regime actually just mimic the entire movement of the income share of the top 1%</a>. It follows what share of taxes they're asked to pay and it leads to changes in reporting and basically it's a story of tax regimes and it changes the entire narrative.</p> <p>But what I find much more depressing---and this is a depressing fact---if just one of our criticisms lands and sticks, the U-curve doesn't look like a U. Let's say it looks like a J. So there's a mid-point in the 1920s and we've been increasing since then at a relatively high rate since the 1970s. So it fell from 1920 to 1970 and then it re-increased.</p> <p>If you look at what caused the leveling from 1920 to 1970, a lot of it has nothing to do with state intervention, with the efforts at redistribution. There's probably a sizable share of it that has to do with that. But there's also a sizable, and probably the larger share, that comes from poor regions catching up with rich regions. If you look at for example the history of inequality in the United States you would see that if you decompose the variance---so what caused the inequality---for most of American history a large share of inequality was caused by differences between states rather than differences between individuals.</p> <p>One way to see it, and I'm making a caricature here to get the point across, but you could have the same shape of distribution in income in Kansas and New York. But since the average in New York is much higher than in Kansas, you average the two in, you get a much higher level of inequality, so you can get like a Gini coefficient for the two of them of .4 but in each of them individually taken the level inequality is like .2. And this is what happens for most of US history. There are massive gaps between regions rather than gaps between skills, between levels, so Mississippi is poorer than New York for a long period of time. But in the 40s, 50s, 60s, 70s this gap basically volatilized, it began to disappear.</p> <p>One of the massive story of the twentieth century---some economists are aware---is this massiveness of convergence between regions. So the South gets richer. Poor black people move from poor states in the South where they're sharecroppers, they move to the North where they become wage earners in garment factories, in manufacturing and their earnings grow dramatically. So there's a massive convergence during that period. But, if you think about it for a second, it means that the gap between regions and the gap between races is actually a big driver in the leveling part of the U-curve, but that has nothing to do with tax redistribution. It has nothing to do with this.</p> <p>So, as soon as we integrate our criticism into the tax data, and we show that the U-curve looks less and less like a U, the left side of it makes it look less and less like a U. And you consider these two economic history facts that I've just mentioned, it's incredibly depressing to consider in the inequality narrative, to say well a lot of it is just stuff that would have happened anyways. There would have been a decline in inequality regardless of how much the state intervened to redistribute income because there was this convergence. And not only that, the leveling of inequality was not as great as we say it was. So it changes the entire story.</p> <p>We have inequality and how to address the issue and, not only that, I will point out that across the same period the one thing that goes up relatively steadily is government spending to GDP. If you were to account for all our criticism and then consider which part of inequality was reduced by government redistribution, it becomes more and more depressing because it seems like the effect is much smaller than people believe.</p> <p>This is where we're trying to disentangle all these elements to tell the correct story of inequality in the United States and it starts with getting the shape of inequality right. But look at the story I have just told you. As soon as we make this small change of properly assessing things, the entire narrative we have then changes. And this is why it's a dramatic fact to get right and which is why we're somewhat disappointed with Piketty's stuff because he's not making the right level of methodological discussion.</p> <p>Petersen: Right. Piketty uses his narrative to push for large-scale taxes and redistribution.</p> <p>Geloso: Yes. I'm not saying that what he does is bad. It was a massive improvement relative to what was there before. But his story has flaws, and these flaws tend to support his narrative. We point out the flaws that would support a different narrative, that point out that probably inequality is not as high as we say. It probably would have fallen up in the 1970s because of very natural forces and if you think about the fact that since the 1970s there's been a slight divergence---so, imagine the leveling of inequality between regions in the United States. The divergence fell until the 1970s, but it has increased modestly since then because of regulation on housing, things that limit mobility across states that the depress income growth in some areas.</p> <p>So you end up with a slight divergence since then and it is caused by states. It's not caused by anything that the government is doing. It's really an issue of very regionalized factors and each time you consider each of these nuances in, the narrative changes. And it changes dramatically against the story Piketty's telling and it shows that the flaws are biased in favor of the conclusion he supported.</p> <p>Petersen: Right. And I know Phil Magness has really criticized him on this, that he makes a lot of decisions where you could go one way or the other and they always seem to turn out his way. Which is maybe a coincidence, or maybe it's not really the best way to do social science.</p> <p>You point out that there were big price differentials between regions so how does that play into the regional inequality story?</p> <p>Geloso: So, we're basing our discussion on this part of a longer series of papers where each of the points we've discussed will basically be one paper in itself. Here we're just stating this entire case for skepticism, then we'll see how big the impact is. Regardless, even if they're all minor, they will all change the narrative. And prices, regional price differences are an issue in that.</p> <p>So, when you compare nominal income across a country you are getting an idea of inequality but---you will agree with me. So, you're in Vancouver. I'm originally from Montreal. If I give you a dollar income in Vancouver and I give myself a one-dollar income in Montreal you think that dollar will go as far in Vancouver as it does in Montreal?</p> <p>Petersen: I think it probably won't.</p> <p>Geloso: Exactly. So you would expect that regional price differences will affect the level of inequality. And there's actually a lot of people that do that. Each time you make controls for the level of price differences, you actually find that the level of inequality falls modestly. But it falls.</p> <p>But the thing is, the price differences that we have today between Vancouver to Montreal or between New York and the region of Mississippi are not at all what these gaps used to be in 1920 or in 1925. In 1925 the gaps would have been much, much, much larger and from 1925 to the 1940s there's been a convergence of prices across regions. So for the first 50 years, roughly, of the twentieth century you get a convergence of prices across regions. So if you just took nominal income without correcting for regional price differences, you would get a massive drop in inequality.</p> <p>However, if you were to correct for an increasingly smaller mistake because, if you think about it, if the wage gaps used to be on average 25% in 1890, let's say, and they used to be 5% in 1950, the error is decreasing over time. So you're getting the level off by a smaller and smaller quantity over time. So it means that the trend changes. The smaller your measurement error caused by regional price differences falls, the less pronounced the fall in inequality becomes. So you get a massive drop in inequality as measured by nominal income, which is not what it is when you correct the regional price differences, so you put this in real dollars adjusted for purchasing power parity.</p> <p>And not only that, the errors caused by regional prices actually also follow a U-curve. So the errors that would be caused by price level differences across regions declined up to 1950 but since then they've re-increased. So if before you're getting a lower and lower trend---a lower trend by a diminishing amount of error---that means the right side of the curve, that means the increasing disparity in prices across regions since 1950. It means that you're actually increasing nominal prices using nominal income across the country. You will underestimate the increase in inequality since then.</p> <p>So there are actually massive measurement errors caused by this issue of regional prices. When I say massive, I shouldn't say massive because it's dishonest but it affects both the level and the trends. So it affects the shape of the curve and remember we're making all these criticisms to the U-curve story piece by piece. Each one of them has a small prickly effect on the shape of the curve. As soon as one or more starts sticking---and they're all documented otherwise for other periods---not prior interwar period, not a sufficiently as we'd wish to, which is why we're doing this project of massive data collection.</p> <p>It changes the narrative, changes the story, changes the way the curve looks and it's not much of a U-curve anymore and the proper measurements get you a very different story of the evolution of inequality. And that different story forces you to change interpretations and solutions and the entire structure of the debate must change to reflect the higher level of precision that is required for that debate.</p> <p>Petersen: So. I'm trying to think of why these prices between regions might fall in the first half of the twentieth century and rise thereafter. I suppose a lot of it would be real estate, housing?</p> <p>Geloso: Exactly. So housing markets in the U.S. are more or less freer in the first half of the twentieth century than they are today. So most prices, if you can trade a good across borders it will arbitrage out price differences minus transport, right? So if goods are movable more or less as well, and you find it for food, for TVs, for durable goods, you tend to find that there's actually still convergence.</p> <p>But housing, you can't really move a house. There's actually movable houses but they're not a massive share of the market. So you'd expect less ability---and I'm saying this as a euphemism---but you'd expect less ability for arbitrage with housing. The only way you can do arbitrage for housing is by moving around.</p> <p>So I am in Mississippi and I see super high wages in New York. I move from Mississippi to New York. So in Mississippi there's one more housing unit available and in New York there's one less housing unit available. I've driven up housing prices in New York and I've got higher wages but housing is a little more expensive in New York and then it falls in the region where I left in terms of housing, so that real wages in that region converged. So there's a convergence in real wages by people moving around.</p> <p>The problem now is that, there is very, very, very little ability to move around in the United States because zoning restrictions actually make it harder for people to come and exploit the productivity of large cities like New York. So it prevents this convergence in real terms across regions.</p> <p>So a large part of the increase in inequality needs to be corrected for regional price differences, which is the argument about housing. And this is where it's probably that the soundest part of our argument is that the Rognlie papers that attack Piketty state that a large part of inequality was driven by rents towards housing, so the fact that income derives from housing is increasing importantly as a share of total income and has nothing to do with capital itself. It's really the artificial restrictions on housing.</p> <p>And this is largely the problem the inability of people to move to where wages are the most important. This changes the narrative. So that's why the story of regionally correcting price differences is crucial and it's rarely done over a long time series data set. But given the evolution of prices in the United States since 1900, it will affect the trend dramatically.</p> <p>It will affect the level, the shape, and this is not integrated in the argument. And this is why we're saying in this paper, each time you make a correction to get a higher level of precision, it's getting more and more plausible that the curve of inequality doesn't look like a U, it looks probably like an L, probably like a J, but not a U. So the early period of the twentieth century is not as high as people have claimed and there's probably been an increase since the 1970s. Not as much as some would claim, but the increase seems to have happened. The U-curve is probably just fictional. It is the result of poor controls or variations in equality of the taxes.</p> <p>Petersen: We've discussed the housing issue on <a href= \"http://economicsdetective.com/2016/09/trailer-parks-zoning-market-urbanism-nolan-gray/\" target=\"_blank\">other</a> <a href= \"http://economicsdetective.com/2016/09/urban-development-growth-ponzi-scheme-strong-towns-chuck-marohn/\" target=\"_blank\">episodes</a> of <a href= \"http://economicsdetective.com/2016/10/new-york-urbanism-stephen-smith/\" target=\"_blank\">this</a> <a href= \"http://economicsdetective.com/2016/10/land-use-restrictions-make-housing-unaffordable-emily-hamilton/\" target=\"_blank\">podcast</a> but it's sort of a one-two punch to inequality, where the people who, you know, maybe have bought a house in the San Francisco Bay area in the 1980s, have seen the value of that house skyrocket. And so of course that would contribute to the upper end of that wealth distribution. And the people who live in Mississippi and might like to move to the San Francisco Bay area and work for Google, can't afford to do it because of the extremely high price of rent there. So, that's reducing mobility and exacerbating these regional differences and also directly increasing the wealth of people who own homes who are, of course, already on the wealthier side.</p> <p>Geloso: Yes, in a static term, correcting for price differences across region. So if you were to take a picture of the economy right now and you make a picture of inequality based only on nominal incomes across the country---just using U.S. dollars---you'll get a higher level than if you correct for regional price differences.</p> <p>However, it's quite likely that if you were to make a movie of how inequality evolved, the housing restrictions---and this is a comment that's outside our paper and it's just something I think it's worth commenting on---if you make it so that it's impossible to move from low-income Mississippi to high-income California, you're going to make sure that inequality stays high and probably increases.</p> <p>If, let's say, there's a shock to international trade and Mississippi area tended to be manufacturing and people can't move from manufacturing to higher productivity jobs in San Francisco. So in dynamic terms, housing restrictions by preventing mobility prevent a strong equalizing source of income. So in static terms you get the level wrong, but in a dynamic term you're preventing the powerful force of mobility across the country---and this is something I like to point out---if you look for example, you bring someone from Italy to Canada in 1890, his income increased 300% as soon as he got to Canada. He was much richer the minute he set foot in Canada. You probably increased inequality in Canada---I don't know about if you decrease it or increase it in Italy---but when you move that guy away, you probably reduce global inequality. So by moving people to where the incomes are higher you level off inequality.</p> <p>In the United States it's the same narrative, you prevent this equalizing force from working through housing restrictions and making adjustments for---this is beyond the scope of our own research---but making adjustments for the increasing restrictiveness of housing that prevents mobility, you will probably get a large part of increasing inequality in the United States or even in England, which is also a situation like that, and in France, is not the result of terrible market forces responding to terrible government policies.</p> <p>Petersen: My guest today has been Vincent Geloso. Vincent thanks for being part of Economics Detective Radio.</p> <p>Geloso: It was a pleasure.</p>  <p> </p>",
  "enclosure": "",
  "itunes:duration": "49:42",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What follows is an edited transcript of my conversation with .  Petersen: My guest today is Vincent Geloso of the Free Market Institute at Texas Tech University. Vincent, welcome to Economics Detective Radio. Geloso: It's a pleasure to be here...."
}