{
  "id": "yt:video:Ob4ypR6K9Ig",
  "yt:videoId": "Ob4ypR6K9Ig",
  "yt:channelId": "UCddem5RlB3bQe99wyY49g0g",
  "title": "1944 ARMY-NAVY SCREEN MAGAZINE #39  WWII NEWSREEL  JAPANESE IMPERIAL ARMY ACADEMY   WAR DOGS XD60624",
  "link": "",
  "author": {
    "name": "PeriscopeFilm",
    "uri": "https://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g"
  },
  "published": "2022-11-05T19:29:46+00:00",
  "updated": "2022-11-05T19:29:46+00:00",
  "media:group": {
    "media:title": "1944 ARMY-NAVY SCREEN MAGAZINE #39  WWII NEWSREEL  JAPANESE IMPERIAL ARMY ACADEMY   WAR DOGS XD60624",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g/join\n\nWant to learn more about Periscope Film and get access to exclusive swag? Join us on Patreon. Visit https://www.patreon.com/PeriscopeFilm\nVisit our website www.PeriscopeFilm.com\n\nThis 1944 newsreel is episode #39 of the Army-Navy Screen Magazine. This series was released biweekly during WWII and was essentially a series of entertaining short films for military personnel. It was produced by the Army Information Branch, the Army Pictorial Service, the Air forces, and the Navy Department. This issue includes three segments, the first profiling the Japanese Imperial Army Academy, the second looking at the lives of dogs pressed into military service, and the third \"By Request\" answering letters sent in by G.I.s.  \n\nJapan’s West Point, or the Japanese Imperial Army Academy (00:37). A Japanese Army officer (00:46). Japanese soldiers at a battleground (00:53). Soldiers marching in rows (01:05), and a soldier on a horse holding a sword (01:23). At a school in Tokyo with over 2000 students entering (01:31). Students are taking an exam inside a classroom (01:45). The students who managed to pass the exam are greeted by the CO at a military academy (01:58). Soldiers are walking up from sleeping in a dorm (02:27), and they rush out after getting dressed (02:32). They wash off and do jumping exercises (02:37), followed by Jiu-Jitsu training (02:54), bowing exercises towards the Tokyo Imperial Palace, the residency of the Emperor of Japan, Hirohito, during the Second World War (03:06). Military students attend classes inside classrooms (03:23), before having signal practice with white flags, surveying practice, and yelling practice to prepare to give commands (04:10). The fields of specializing are cannons, cavalry school, armed forces, engineering, artillery, and air forces (04:28). Pilots enter a military aircraft and practice flying (05:05). Officer candidates are taken on a tactical tour to a historical battlefield in Manchuria (05:16). The soldiers run up a hill and rehearse an attack (05:53). Transported by train, the soldiers return to the academy (06:05). A field maneuver of soldiers firing cannons (06:15). Emperor Hirohito, attends the graduation of the military students (06:47). Females attend from a special Japanese school of army brides (07:09). The honor student receives a scroll (07:16). Boxes are carried out from ship by soldiers (07:51). Numerous dead bodies lie across the grounds of a battlefield (07:57). The second segment of the film \"Three Feet In Heaven\"  begins with a dog sitting on grass (08:15). These are civilian dogs which have joined the U.S. military. A document of an honorable discharge (08:21). Dogs are examined and trained to become dogs of war service (08:37). Dogs are sitting inside a movie theater watching a film about Adolf Hitler to learn about the enemy (09:14). Dogs are trained to unlearn war training to reenter civilian life (09:47). A dog is washed and examined, before being transported to a farm for post-service dogs (10:24). Many different races of dogs live in dog houses on the farm (10:55). They play freely in the surrounding forest (11:52). A dog is driven away from the farm to reunited with a family of four in their home (12:09). The dog and a young daughter sit on a blanket on grass (12:49). The final segment \"By Request\" begins inside the office of the Army-Navy Screen Magazine (13:34). A member of the Women's Army Corps (WAC) is shown sitting at a desk. She reads a letter of request from a soldier, who expresses a craving for a sandwich and a glass of cold milk (13:43). A sandwich and a glass of milk is places on a table (14:32), and a young woman eats it (15:03). The WAC reads another request from another soldier asking for pictures of the partisan leader of Yugoslavia, Josip Broz Tito (15:16). Footage of Marshall Tito deep in the mountains of Yugoslavia (15:30). The WAC grants the final request (16:04), and footage of a Jimmy Durante performance is played (16:20). The End (17:39). \n\nWe encourage viewers to add comments and, especially, to provide additional information about our videos by adding a comment!  See something interesting?  Tell people what it is and what they can see by writing something for example: \"01:00:12:00 -- President Roosevelt is seen meeting with Winston Churchill at the Quebec Conference.\"\n\nThis film is part of the Periscope Film LLC archive, one of the largest historic military, transportation, and aviation stock footage collections in the USA. Entirely film backed, this material is available for licensing in 24p HD, 2k and 4k. For more information visit http://www.PeriscopeFilm.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}