{
  "title": "Violence, Lynchings, Civil War, and Witch Trials with Cornelius Christian",
  "pubDate": "Fri, 16 Oct 2015 17:00:00 +0000",
  "guid": "794b9453b4a7e09113ab0d162dd17de8",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/Violence_Lynchings_Civil_War_and_Witch_Trials_with_Cornelius_Christian.mp3",
  "itunes:image": "",
  "description": "<p><a href=\"https://sites.google.com/site/corneliuseconomics/home\" target=\"_blank\">Cornelius Christian</a> is an Assistant Professor of Economics at St. Francis Xavier University. His research concerns development economics, economic history, and the economics of conflict and violence, which is the topic of this episode of Economics Detective Radio.</p>\n<p>Cornelius' paper \"Lynchings, Labour, and Cotton in the US South\" deals with violence against black people in the post-reconstruction South. Historians have hypothesized that there was an economic motive to lynchings, noting that more of them occurred when cotton prices were low. Black and white workers competed with one another in the agricultural labour market. Cornelius' findings indicate that lynchings were used by white labourers to scare black workers out of the labour market, thus raising their own wages. He finds that lynchings happen in the wake of economic shocks when agricultural wages are low. He also finds that, when lynchings occur in a given area, black people tend to migrate out of the area and agricultural wages rise for the remaining white workers.</p>\n<p>In \"Economic shocks and unrest in French West Africa,\" Cornelius and his coauthor James Fenske show that, while economic shocks matter as a cause of civil unrest, the institutional context matters. During French West Africa's colonial era, there were oppressive poll taxes that had to be paid regardless of crop yields. When negative economic shocks occurred, either because of low world prices for agricultural goods or poor rainfall, farmers were not able to pay these taxes and engaged in riots and political violence. In the post-colonial era, the poll taxes no longer exist and political violence no longer follows negative economic shocks.</p>\n<p>Cornelius references <a href=\"http://scholar.harvard.edu/files/dell/files/revolutiondraft.pdf\" target=\"_blank\">recent research linking droughts during the Mexican Revolution to insurgency in particular areas</a>. Areas that had particularly bad droughts during the Mexican Revolution produced larger uprisings, and that in turn affected the political and economic fates of these areas up to the present day. He also references <a href=\"http://onlinelibrary.wiley.com/doi/10.3982/ECTA8183/abstract\" target=\"_blank\"\">Bruckner and Ciccone's 2011 Econometrica paper, \"Rain and the Democratic Window of Opportunity,\"</a> which shows that democratic change frequently occurs in the wake of negative economic shocks in Sub-Saharan Africa. Bruckner and Ciccone are testing <a href=\"https://www.aeaweb.org/articles.php?doi=10.1257/aer.91.4.938\" target=\"_blank\">Acemoglu and Robinson's (2001) thesis in \"A Theory of Political Transitions.\"</a></p>\n<p>We discuss the fall of the Soviet Union and some research showing that East Germans still expect the state to do more for them than West Germans. However, the younger generation's attitude is more similar to those of West Germans.</p>\n<p>Cornelius' most recent research deals with witch trials in early modern Scotland. Unlike the other cases of violence he's looked at, witch trials happened more after positive economic shocks rather than negative ones. The reason, Cornelius discovered, was because early modern Scots cared a great deal that the proper legal procedures were followed in each witch trial. These procedures were costly, and so people could only afford to try and execute a witch when times were good. Witch trials are, essentially, luxury goods.</p>\n<p>The common thread in Cornelius' research is that context matters. There's no one thing that causes violence in all times and places; it depends on the institutional context. In the post-reconstruction South, colonial West Africa, and revolutionary Mexico, negative economic shocks led to violence. However, this was not the case in post-colonial West Africa and early modern Scotland. History is not deterministic, so to understand history we need to understand the incentives faced by the individuals of a given time and place.</p>",
  "content:encoded": "<p><a href=\"https://sites.google.com/site/corneliuseconomics/home\" target=\"_blank\">Cornelius Christian</a> is an Assistant Professor of Economics at St. Francis Xavier University. His research concerns development economics, economic history, and the economics of conflict and violence, which is the topic of this episode of Economics Detective Radio.</p>\n<p>Cornelius' paper \"Lynchings, Labour, and Cotton in the US South\" deals with violence against black people in the post-reconstruction South. Historians have hypothesized that there was an economic motive to lynchings, noting that more of them occurred when cotton prices were low. Black and white workers competed with one another in the agricultural labour market. Cornelius' findings indicate that lynchings were used by white labourers to scare black workers out of the labour market, thus raising their own wages. He finds that lynchings happen in the wake of economic shocks when agricultural wages are low. He also finds that, when lynchings occur in a given area, black people tend to migrate out of the area and agricultural wages rise for the remaining white workers.</p>\n<p>In \"Economic shocks and unrest in French West Africa,\" Cornelius and his coauthor James Fenske show that, while economic shocks matter as a cause of civil unrest, the institutional context matters. During French West Africa's colonial era, there were oppressive poll taxes that had to be paid regardless of crop yields. When negative economic shocks occurred, either because of low world prices for agricultural goods or poor rainfall, farmers were not able to pay these taxes and engaged in riots and political violence. In the post-colonial era, the poll taxes no longer exist and political violence no longer follows negative economic shocks.</p>\n<p>Cornelius references <a href=\"http://scholar.harvard.edu/files/dell/files/revolutiondraft.pdf\" target=\"_blank\">recent research linking droughts during the Mexican Revolution to insurgency in particular areas</a>. Areas that had particularly bad droughts during the Mexican Revolution produced larger uprisings, and that in turn affected the political and economic fates of these areas up to the present day. He also references ",
  "enclosure": "",
  "itunes:duration": 0,
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "is an Assistant Professor of Economics at St. Francis Xavier University. His research concerns development economics, economic history, and the economics of conflict and violence, which is the topic of this episode of Economics Detective..."
}