{
  "title": "516 - Operation Good Food and Beverages: A Youth-Led Movement to Reverse Racialized Marketing of Foods to Black Americans",
  "itunes:title": "516 - Operation Good Food and Beverages: A Youth-Led Movement to Reverse Racialized Marketing of Foods to Black Americans",
  "pubDate": "Mon, 12 Sep 2022 10:00:00 +0000",
  "guid": "c9bdd12b-2e78-47d4-a0a5-911ce43d7931",
  "link": "https://johnshopkinssph.libsyn.com/516-operation-good-food-and-beverages-a-youth-led-movement-to-reverse-racialized-marketing-of-foods-to-black-americans",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Unhealthy, fast, and cheap foods are often marketed to Black Americans who suffer from higher rates of obesity and other non-communicable health problems.</span> <strong>Dr. Shiriki Kumanyika</strong><span style= \"font-weight: 400;\">, a research professor at Drexel University and the founder of the Council of Black Health, talks with</span> <strong>Lindsay Smith Rogers</strong> <span style= \"font-weight: 400;\">about Operation Good Food and Beverages, a project supported by the Bloomberg American Health Initiative, which advocates for better food policies and encourages youth to embrace healthy eating as a radical act. Learn</span> <a href= \"http://operationgoodfb.com\"><span style= \"font-weight: 400;\">more</span></a><span style= \"font-weight: 400;\">.</span></p>",
  "content:encoded": "<p>Unhealthy, fast, and cheap foods are often marketed to Black Americans who suffer from higher rates of obesity and other non-communicable health problems. Dr. Shiriki Kumanyika, a research professor at Drexel University and the founder of the Council of Black Health, talks with Lindsay Smith Rogers about Operation Good Food and Beverages, a project supported by the Bloomberg American Health Initiative, which advocates for better food policies and encourages youth to embrace healthy eating as a radical act. Learn <a href= \"http://operationgoodfb.com\">more</a>.</p>",
  "enclosure": "",
  "itunes:duration": "12:44",
  "itunes:explicit": false,
  "itunes:keywords": "food,kids,health,children,Youth,obesity,diabetes,Childhood",
  "itunes:subtitle": "Unhealthy, fast, and cheap foods are often marketed to Black Americans who suffer from higher rates of obesity and other non-communicable health problems. Dr. Shiriki Kumanyika, a research professor at Drexel University and the founder of the Council...",
  "itunes:season": 6,
  "itunes:episode": 516,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}