{
  "title": "Episode 43: &#8220;I Gotta Know&#8221; by Wanda Jackson",
  "link": "https://500songs.com/podcast/episode-43-i-gotta-know-by-wanda-jackson/",
  "pubDate": "Mon, 29 Jul 2019 03:35:43 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-43-i-gotta-know-by-wanda-jackson/",
  "description": "Episode forty-three of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"I Gotta Know\" by Wanda Jackson, and the links between rockabilly and the Bakersfield Sound. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/28727356\">\"Bacon Fat\" by Andre Williams</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-43-i-gotta-know/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nMy main source for this episode is <a href=\"https://amzn.to/2Ml6ppi\">Wanda Jackson's autobiography, <em>Every Night is Saturday Night</em></a>.\n\nI also made reference to the website <a href=\"http://www.womeninrockproject.org/\">Women in Rock & Roll's First Wave</a>, and I am very likely to reference that again in future episodes on Wanda Jackson and others.\n\nI mentioned the podcast Cocaine and Rhinestones, and its episode on <a href=\"https://cocaineandrhinestones.com/merle-haggard-okie-from-muskogee\">\"Okie From Muskogee\"</a>. Several other episodes of that podcast touch tangentially on people mentioned in this episode too -- the two-parter on Buck Owens and Don Rich, the episode on Ralph Mooney, and the episode on the Louvin Brothers all either deal with musicians who played on Wanda's records, with Ken Nelson, or both. Generally I think most people who enjoy this podcast will enjoy that one as well.\n\nAnd <a href=\"https://amzn.to/2Y9Gng3\">this compilation</a> collects most of Jackson's important early work.\n\n<strong>Errata</strong>\n\nI say Jackson's career spans more than the time this podcast covers. I meant in length of time – this podcast covers sixty-two years, and Jackson's career so far has lasted seventy-one – but the ambiguity could suggest that this podcast doesn't cover anything prior to 1948.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're going to talk about someone whose career as a live performer spans more than the time that this podcast covers. Wanda Jackson started performing in 1948, and she finally retired from live performance in March 2019, though she has an album coming out later this year. She is only the second performer we've dealt with who is still alive and working, and she has the longest career of any of them.\n\nWanda Jackson is, simply, the queen of rockabilly, and she's a towering figure in the genre.\n\nJackson was born in Oklahoma, but as this was the tail-end of the great depression, she and her family migrated to California when she was small, as stragglers in the great migration that permanently changed California.\n\nThe migration of the Okies in the 1930s is a huge topic, and one that I don't have the space to explain in this podcast -- if you're interested in it, I'd recommend as a starting point listening to the episode of the great country music podcast Cocaine & Rhinestones on \"Okie From Muskogee\", which I'll link in the show notes. The very, very, shortened version is that bad advice as to best farming practices created an environmental disaster on an almost apocalyptic scale across the whole middle of America, right at the point that the country was also going through the worst economic disaster in its history. As entire states became almost uninhabitable, three and a half million people moved from the Great Plains to elsewhere in the US, and a large number of them moved to California, where no matter what state they actually came from they became known as \"Okies\".\n\nBut the thing to understand about the Okies for this purpose is that they were a despised underclass -- and as we've seen throughout this series, members of despised underclasses often created the most exciting and innovative music.\n\nThe music the Okies who moved to California made was far more raucous than the country music that was popular in the Eastern states, and it had a huge admixture of blues and boogie woogie in it. Records like Jack Guthrie's \"Oakie Boogie\", for example, a clear precursor of rockabilly:\n\n[Excerpt: Jack Guthrie, \"Oakie Boogie\"]\n\nWe talked way back in episode three about Western Swing and the distinction in the thirties and forties between country music and western music. The \"Western\" in that music came from the wild west, but it also referred to the west coast and the migrants from the Dust Bowl. Of the two biggest names in Western Swing, one, Bob Wills, was from Texas but moved to Oklahoma, while the other, Spade Cooley, was from Oklahoma but moved to California.\n\nIt was the Western Swing that was being made by Dust Bowl migrants in California in the 1940s that, when it made its way eastwards to Tennessee, transmuted itself into rockabilly. And that is the music that young Wanda Jackson was listening to when she was tiny. Her father, who she absolutely adored, was a fan of Bob Wills, Spade Cooley, and Tex Williams, as well as of Jimmie Rodgers' hillbilly music and the blues. They lived in Greenfield, a town a few miles away from Bakersfield, where her father worked, and if any of you know anything at all about country music that will tell you a lot in itself. Bakersfield would become, in the 1950s, the place where musicians like Buck Owens, Merle Haggard, and Wynn Stewart, most of them from Dust Bowl migrant families themselves, developed a tough form of honky-tonk country and western that was influenced by hillbilly boogie and Western Swing.\n\nWanda Jackson spent the formative years of her childhood in the same musical and social environment as those musicians, and while she and her family moved back to Oklahoma a few years later, she had already been exposed to that style of music. At the time, when anyone went out to dance, it was to live music, and since her parents couldn't afford babysitters, when they went out, as they did most weekends, they took Wanda with them, so between the ages of five and ten she seems to have seen almost every great Western band of the forties.\n\nHer first favourite as a kid was Spade Cooley, who was, along with Bob Wills, considered the greatest Western Swing bandleader of all. However, this podcast has a policy of not playing Cooley's records (the balance of musical importance to outright evil is tipped too far in his case, and I advise you not to look for details as to why), so I won't play an excerpt of him here, as I normally would.\n\nThe other artist she loved though was a sibling group called The Maddox Brothers and Rose, who were a group that bridged the gap between Western Swing and the newer Bakersfield Sound:\n\n[Excerpt: The Maddox Brothers and Rose, \"George's Playhouse Boogie\"]\n\nThe Maddox Brothers and Rose were also poor migrants who'd moved to California, though in their case they'd travelled just *before* the inrush of Okies rather than at the tail end of it. They're another of those groups who are often given the credit for having made the first rock and roll record, although as we've often discussed that's a largely meaningless claim. They were, however, one of the big influences both on the Bakersfield Sound and on the music that became rockabilly.\n\nWanda loved the Maddox Brothers and Rose, and in particular she loved their stage presence -- the shiny costumes they wore, and the feistiness of Rose, in particular. She decided before she was even in school that she wanted to be \"a girl singer\", as she put it, just like Rose Maddox.\n\nWhen she was six, her father bought her a guitar from the Sears Roebuck catalogue and started teaching her chords. He played a little guitar and fiddle, and the two of them would play together every night. They'd sit together and try to work out the chords for songs they knew from the radio or records, and Wanda's mother would write down the chords in a notebook for them.\n\nShe also taught herself to yodel, since that was something that all the country and western singers at the time would do, and had done ever since the days of Jimmie Rodgers in the late twenties and early thirties. The record she copied to learn to yodel was \"Chime Bells\" by Elton Britt, \"Country Music's Yodelling Cowboy Crooner\":\n\n[Excerpt: Elton Britt, \"Chime Bells\"]\n\nBy the time she was in her early teens, she was regularly performing for her friends at parties, and her friends dared her to audition for a local radio show that played country music and had a local talent section. Her friends all went with her to the station, and she played Jimmie Rodgers' \"Blue Yodel #6\" for the DJ who ran the show.\n\n[Excerpt: Jimmie Rodgers, \"Blue Yodel #6\"]\n\nTo her shock, but not the shock of her friends, the DJ loved her sound, and gave her a regular spot on the local talent section of his show, which in turn led to her getting her own fifteen-minute radio show, in which she would sing popular country hits of the time period. One of the people whose songs she would perform on a regular basis was Hank Thompson.\n\nThompson was a honky-tonk singer who performed a pared-down version of the Bob Wills style of Western Swing. Thompson's music was using the same rhythms and instrumentation as Wills, but with much more focus on the vocals and the song than on instrumental solos. Thonpson's music was one of several precursors to the music that became rockabilly, though he was most successful with mid-tempo ballads like \"The Wild Side of Life\":\n\n[Excerpt: Hank Thompson, \"The Wild Side of Life\"]\n\nThompson, like Wanda, lived in Oklahoma, and he happened to be driving one day and hear her show on the radio. He phoned her up at the station and asked her if she would come and perform with his band that Saturday night. When she told him she'd have to ask her mother, he laughed at first -- he hadn't realised she was only fourteen, because her voice made her sound so much older.\n\nAt this time, it was normal for bands that toured to have multiple featured singers and to perform in a revue style, rather than to have a single lead vocalist -- there were basically two types of tour that happened: package tours featuring multiple different acts doing their own things, and revues, where one main act would introduce several featured guests to join them on stage. Johnny Otis and James Brown, for example, both ran revue shows at various points, and Hank Thompson's show seems also to have been in this style.\n\nJackson had never played with a band before, and by her own account she wasn't very good when she guested with Thompson's band for the first time. But Thompson had faith in her. He couldn't take her on the road, because she was still so young she had to go to school, but every time he played Oklahoma he'd invite her to do a few numbers with his band, mentoring her and teaching her on stage how to perform with other musicians.\n\nThompson also invited Jackson to appear on his local TV show, which led to her getting a TV show of her own in the Oklahoma area, and she became part of a loose group of locally-popular musicians, including the future homophobic campaigner against human rights Anita Bryant.\n\nWhile she was still in high school, Thompson recorded demos of her singing and took them to his producer, Ken Nelson, at Capitol Records. Nelson liked her voice, but when he found out she was under eighteen he decided to pass on recording her, just due to the legal complications and the fact that she'd not yet finished school.\n\nInstead, Jackson was signed to Decca Records, where she cut her first recordings with members of Thompson's band. Her first single was a duet with another featured singer from Thompson's band, Billy Gray. Thompson, who was running the session, basically forced Jackson to sing it against her objections. She didn't have a problem with the song itself, but she didn't want to make her name from a duet, rather than as a solo artist.\n\n[Excerpt: Billy Gray and Wanda Jackson, \"You Can't Have My Love\"]\n\nShe might not have been happy with the recording at first, but she was feeling better about it by the time she started her senior year in High School with a top ten country single.\n\nHer followups were less successful, and she became unhappy with the way her career was going. In particular she was horrified when she first played the Grand Ole Opry. She was told she couldn't go onstage in the dress she was wearing, because her shoulders were uncovered and that was obscene -- at this time, Jackson was basically the only country singer in the business who was trying to look glamorous rather than like a farmgirl -- and then, when she did get on stage, wearing a jacket, she was mocked by a couple of the comedy acts, who stood behind her making fun of her throughout her entire set. Clearly the country establishment wasn't going to get along with her at all.\n\nBut then she left school, and became a full-time musician, and she made a decision which would have an enormous effect on her. Her father was her manager, but if she was going to get more gigs and perform as a solo artist rather than just doing the occasional show with Hank Thompson, she needed a booking agent, and neither she nor her father had an idea how to get one.\n\nSo they did what seemed like the most obvious thing to them, and bought a copy of Billboard and started looking through the ads. They eventually found an ad from a booking agent named Bob Neal, in Memphis, and phoned him up, explaining that Wanda was a recording artist for Decca records.\n\nNeal had heard her records, which had been locally popular in Memphis, and was particularly looking for a girl singer to fill out the bill on a tour he was promoting with a new young singer he managed, named Elvis Presley.\n\nBackstage after her support slot on the first show of the tour, she and her father heard a terrible screaming coming from the auditorium. They thought at first that there must have been a fire, and Wanda's father went out to investigate, telling her not to come with him. He came back a minute later telling her, \"You've got to come see this\".\n\nThe screaming was, of course, at Elvis, and immediately Wanda knew that he was not any ordinary country singer. The two of them started dating, and Elvis even gave Wanda his ring, which is still in her possession, and while they eventually drifted apart, he had a profound influence on her.\n\nHer father was not impressed with Elvis' performance, saying \"That boy's got to get his show in order... He's all over the stage messin' around. And he's got to stop slurrin' his words, too.\"\n\nWanda, on the other hand, was incredibly impressed with him, and as the two of them toured -- on a bill which also included Bob Neal's other big act of the time, Johnny Cash -- he would teach her how to be more of a rock and roller like him. In particular, he taught her to strum the acoustic guitar with a single strum, rather than to hit each string individually, which was the style of country players at the time.\n\nMeanwhile, her recording career was flagging -- she hadn't had another hit with any of her solo recordings, and she was starting to wonder if Decca was the right place for her. She did, though, have a hit as a songwriter, with a song called \"Without Your Love\", which she'd written for Bobby Lord, a singer who appeared with her on the radio show Ozark Jubilee.\n\n[Excerpt: Bobby Lord, \"Without Your Love\"]\n\nThat song had gone to the top ten in the country charts, and turned out to be Lord's only hit single.\n\nBut while she could come up with a hit for him, she wasn't having hits herself, and she decided that she wanted to leave Decca. Her contract was up, and while they did have the option to extend it for another year and were initially interested in exercising the option, Decca agreed to let her go.\n\nMeanwhile, Wanda was also thinking about what kind of music she wanted to make in the future. Elvis had convinced her that she should move into rockabilly, but she didn't know how to do it. She talked about this to Thelma Blackmon, the mother of one of her schoolfriends, who had written a couple of songs for her previously, and Blackmon came back with a song called \"I Gotta Know\", which Jackson decided would be perfect to restart her career.\n\nAt this point Hank Thompson went to Ken Nelson, and told him that that underage singer he'd liked was no longer underage, and would he be interested in signing her?\n\nHe definitely was interested, and he took her into the Capitol tower to record with a group of session musicians who he employed for as many of his West Coast sessions as possible, and who were at that point just beginning to create what later became the Bakersfield Sound.\n\nThe musicians on that session were some of the best in the country music field -- Jelly Sanders on fiddle, Joe Maphis on guitar, and the legendary Ralph Mooney on steel guitar, and they were perfect for recording what would become a big country hit.\n\nBut \"I Gotta Know\" was both country and rock and roll. While the choruses are definitely country:\n\n[Excerpt: Wanda Jackson, \"I Gotta Know\"]\n\nthe verses are firmly in the rock and roll genre:\n\n[Excerpt: Wanda Jackson, \"I Gotta Know\"]\n\nNow, I'm indebted to the website \"Women in Rock & Roll's First Wave\", which I'll link in the shownotes, for this observation, but this kind of genre-mixing was very common particularly with women, and particularly with women who had previously had careers outside rock and roll and were trying to transition into it. While male performers in that situation would generally jump in head first and come up with an embarrassment like Perry Como's version of \"Ko Ko Mo\", female performers would do something rather different.\n\nThey would, in fact, tend to do what Jackson did here, and combine the two genres, either by having a verse in one style and a chorus in the other, as Wanda does, or in other ways, as in for example Kay Starr's \"Rock and Roll Waltz\":\n\n[Excerpt: Kay Starr, \"Rock and Roll Waltz\"]\n\nStarr is a particularly good example here, because she's doing what a lot of female performers were doing at the time, which is trying to lace the recording with enough irony and humour that it could be taken as either a record in the young persons' style parodying the old persons' music, or a record in the older style mocking the new styles. By sitting on the fence in this way and being ambiguous enough, the established stars could back down if this rock and roll music turned out to be just another temporary fad.\n\nJackson isn't quite doing that, but with her Elvis-style hiccups on the line \"I gotta know, I gotta know\", she comes very close to parody, in a way that could easily be written off if the experiment had failed.\n\nThe experiment didn't fail, however, and \"I Gotta Know\" became Jackson's biggest hit of the fifties, making its way to number fifteen on the country charts -- rather oddly, given that she was clearly repositioning herself for the rockabilly market, it seemed to sell almost solely to the country market, and didn't cross over the way that Carl Perkins or Gene Vincent did.\n\nHer next single could have been the one that cemented her reputation as the greatest female rockabilly star of all, had it not been for one simple mistake. The song \"Hot Dog! That Made Him Mad!\" had been a favourite in her stage act for years, and she would let out a tremendous growl on the title line when she got to it, which would always get audiences worked up.\n\nUnfortunately, she horrified Ken Nelson in the studio by taking a big drink of milk while all the session musicians were on a coffee break. She hadn't realised what milk does to a singer's throat, and when they came to record the song she couldn't get her voice to do the growl that had always worked on stage. The result was still a good record, but it wasn't the massive success it would otherwise have been:\n\n[Excerpt: Wanda Jackson, \"Hot Dog! That Made Him Mad!\"]\n\nAfter that failed, Ken Nelson floundered around for quite a while trying to find something else that could work for Jackson. She kept cutting rockabilly tracks, but they never quite had the power of her stage performances, and meanwhile Nelson was making mistakes in what material he brought in, just as he was doing at the same time with Gene Vincent. Just like with Vincent, whenever Wanda brought in her own material, or material she'd picked to cover by other people, it worked fine, but when Nelson brought in something it would go down like a lead balloon.\n\nProbably the worst example was a terrible attempt to capitalise on the current calypso craze, a song called \"Don'a Wanna\", which was written by Boudleaux Bryant, one of the great songwriters of the fifties, but which wouldn't have been his best effort even before it was given a racist accent at Nelson's suggestion (and which Jackson cringed at doing even at the time, let alone sixty years later):\n\n[Excerpt: Wanda Jackson, \"Don'a Wanna\"]\n\nMuch better was \"Cool Love\", which Jackson co-wrote herself, with her friend Vicki Countryman, Thelma Blackmon's daughter:\n\n[Excerpt: Wanda Jackson, \"Cool Love\"]\n\nThat one is possibly too closely modelled after Elvis' recent hits, right down to the backing vocals, but it features a great Buck Owens guitar solo, it's fun, and Jackson is clearly engaged with the material.\n\nBut just like all the other records since \"I Wanna Know\", \"Cool Love\" did nothing on the charts -- and indeed it wouldn't be until 1960 that Jackson would reach the charts again in the USA. But when she did, it would be with recordings she'd made years earlier, during the time period we're talking about now.\n\nAnd before she did, she would have her biggest success of all, and become the first rock and roll star about whom the cliche really was true -- even though she was having no success in her home country, she was big in Japan.\n\nBut that's a story for a few weeks' time...",
  "itunes:subtitle": "Episode forty-three of A History of Rock Music in Five Hundred Songs looks at I Gotta Know by Wanda Jackson, and the links between rockabilly and the Bakersfield Sound. Click the full post to read liner notes, links to more information, and a transcript ",
  "itunes:keywords": "Bakersfield Sound,Buck Owens,Capitol Records,country and western,Decca Records,Elvis Presley,Grand Ole Opry,Johnny Cash,Ken Nelson,rockabilly,Wanda Jackson,western swing",
  "itunes:episodeType": "full",
  "itunes:episode": 43,
  "content:encoded": "Episode forty-three of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"I Gotta Know\" by Wanda Jackson, and the links between rockabilly and the Bakersfield Sound. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/28727356\">\"Bacon Fat\" by Andre Williams</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-43-i-gotta-know/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nMy main source for this episode is <a href=\"https://amzn.to/2Ml6ppi\">Wanda Jackson's autobiography, <em>Every Night is Saturday Night</em></a>.\n\nI also made reference to the website <a href=\"http://www.womeninrockproject.org/\">Women in Rock & Roll's First Wave</a>, and I am very likely to reference that again in future episodes on Wanda Jackson and others.\n\nI mentioned the podcast Cocaine and Rhinestones, and its episode on <a href=\"https://cocaineandrhinestones.com/merle-haggard-okie-from-muskogee\">\"Okie From Muskogee\"</a>. Several other episodes of that podcast touch tangentially on people mentioned in this episode too -- the two-parter on Buck Owens and Don Rich, the episode on Ralph Mooney, and the episode on the Louvin Brothers all either deal with musicians who played on Wanda's records, with Ken Nelson, or both. Generally I think most people who enjoy this podcast will enjoy that one as well.\n\nAnd <a href=\"https://amzn.to/2Y9Gng3\">this compilation</a> collects most of Jackson's important early work.\n\n<strong>Errata</strong>\n\nI say Jackson's career spans more than the time this podcast covers. I meant in length of time – this podcast covers sixty-two years, and Jackson's career so far has lasted seventy-one – but the ambiguity could suggest that this podcast doesn't cover anything prior to 1948.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're going to talk about someone whose career as a live performer spans more than the time that this podcast covers. Wanda Jackson started performing in 1948, and she finally retired from live performance in March 2019, though she has an album coming out later this year. She is only the second performer we've dealt with who is still alive and working, and she has the longest career of any of them.\n\nWanda Jackson is, simply, the queen of rockabilly, and she's a towering figure in the genre.\n\nJackson was born in Oklahoma, but as this was the tail-end of the great depression, she and her family migrated to California when she was small, as stragglers in the great migration that permanently changed California.\n\nThe migration of the Okies in the 1930s is a huge topic, and one that I don't have the space to explain in this podcast -- if you're interested in it, I'd recommend as a starting point listening to the episode of the great country music podcast Cocaine & Rhinestones on \"Okie From Muskogee\", which I'll link in the show notes. The very, very, shortened version is that bad advice as to best farming practices created an environmental disaster on an almost apocalyptic scale across the whole middle of America, right at the point that the country was also going through the worst economic disaster in its history. As entire states became almost uninhabitable, three and a half million people moved from the Great Plains to elsewhere in the US, and a large number of them moved to California, where no matter what state they actually came from they became known as \"Okies\".\n\nBut the thing to understand about the Okies for this purpose is that they were a despised underclass -- and as we've seen throughout this series, members of despised underclasses often created the most exciting and innovative music.\n\nThe music the Okies who moved to California made was far more raucous than the country music that was popular in the Eastern states, and it had a huge admixture of blues and boogie woogie in it. Records like Jack Guthrie's \"Oakie Boogie\", for example, a clear precursor of rockabilly:\n\n[Excerpt: Jack Guthrie, \"Oakie Boogie\"]\n\nWe talked way back in episode three about Western Swing and the distinction in the thirties and forties between country music and western music. The \"Western\" in that music came from the wild west, but it also referred to the west coast and the migrants from the Dust Bowl. Of the two biggest names in Western Swing, one, Bob Wills, was from Texas but moved to Oklahoma, while the other, Spade Cooley, was from Oklahoma but moved to California.\n\nIt was the Western Swing that was being made by Dust Bowl migrants in California in the 1940s that, when it made its way eastwards to Tennessee, transmuted itself into rockabilly. And that is the music that young Wanda Jackson was listening to when she was tiny. Her father, who she absolutely adored, was a fan of Bob Wills, Spade Cooley, and Tex Williams, as well as of Jimmie Rodgers' hillbilly music and the blues. They lived in Greenfield, a town a few miles away from Bakersfield, where her father worked, and if any of you know anything at all about country music that will tell you a lot in itself. Bakersfield would become, in the 1950s, the place where musicians like Buck Owens, Merle Haggard, and Wynn Stewart, most of them from Dust Bowl migrant families themselves, developed a tough form of honky-tonk country and western that was influenced by hillbilly boogie and Western Swing.\n\nWanda Jackson spent the formative years of her childhood in the same musical and social environment as those musicians, and while she and her family moved back to Oklahoma a few years later, she had already been exposed to that style of music. At the time, when anyone went out to dance, it was to live music, and since her parents couldn't afford babysitters, when they went out, as they did most weekends, they took Wanda with them, so between the ages of five and ten she seems to have seen almost every great Western band of the forties.\n\nHer first favourite as a kid was Spade Cooley, who was, along with Bob Wills, considered the greatest Western Swing bandleader of all. However, this podcast has a policy of not playing Cooley's records (the balance of musical importance to outright evil is tipped too far in his case, and I advise you not to look for details as to why), so I won't play an excerpt of him here, as I normally would.\n\nThe other artist she loved though was a sibling group called The Maddox Brothers and Rose, who were a group that bridged the gap between Western Swing and the newer Bakersfield Sound:\n\n[Excerpt: The Maddox Brothers and Rose, \"George's Playhouse Boogie\"]\n\nThe Maddox Brothers and Rose were also poor migrants who'd moved to California, though in their case they'd travelled just *before* the inrush of Okies rather than at the tail end of it. They're another of those groups who are often given the credit for having made the first rock and roll record, although as we've often discussed that's a largely meaningless claim. They were, however, one of the big influences both on the Bakersfield Sound and on the music that became rockabilly.\n\nWanda loved the Maddox Brothers and Rose, and in particular she loved their stage presence -- the shiny costumes they wore, and the feistiness of Rose, in particular. She decided before she was even in school that she wanted to be \"a girl singer\", as she put it, just like Rose Maddox.\n\nWhen she was six, her father bought her a guitar from the Sears Roebuck catalogue and started teaching her chords. He played a little guitar and fiddle, and the two of them would play together every night. They'd sit together and try to work out the chords for songs they knew from the radio or records, and Wanda's mother would write down the chords in a notebook for them.\n\nShe also taught herself to yodel, since that was something that all the country and western singers at the time would do, and had done ever since the days of Jimmie Rodgers in the late twenties and early thirties. The record she copied to learn to yodel was \"Chime Bells\" by Elton Britt, \"Country Music's Yodelling Cowboy Crooner\":\n\n[Excerpt: Elton Britt, \"Chime Bells\"]\n\nBy the time she was in her early teens, she was regularly performing for her friends at parties, and her friends dared her to audition for a local radio show that played country music and had a local talent section. Her friends all went with her to the station, and she played Jimmie Rodgers' \"Blue Yodel #6\" for the DJ who ran the show.\n\n[Excerpt: Jimmie Rodgers, \"Blue Yodel #6\"]\n\nTo her shock, but not the shock of her friends, the DJ loved her sound, and gave her a regular spot on the local talent section of his show, which in turn led to her getting her own fifteen-minute radio show, in which she would sing popular country hits of the time period. One of the people whose songs she would perform on a regular basis was Hank Thompson.\n\nThompson was a honky-tonk singer who performed a pared-down version of the Bob Wills style of Western Swing. Thompson's music was using the same rhythms and instrumentation as Wills, but with much more focus on the vocals and the song than on instrumental solos. Thonpson's music was one of several precursors to the music that became rockabilly, though he was most successful with mid-tempo ballads like \"The Wild Side of Life\":\n\n[Excerpt: Hank Thompson, \"The Wild Side of Life\"]\n\nThompson, like Wanda, lived in Oklahoma, and he happened to be driving one day and hear her show on the radio. He phoned her up at the station and asked her if she would come and perform with his band that Saturday night. When she told him she'd have to ask her mother, he laughed at first -- he hadn't realised she was only fourteen, because her voice made her sound so much older.\n\nAt this time, it was normal for bands that toured to have multiple featured singers and to perform in a revue style, rather than to have a single lead vocalist -- there were basically two types of tour that happened: package tours featuring multiple different acts doing their own things, and revues, where one main act would introduce several featured guests to join them on stage. Johnny Otis and James Brown, for example, both ran revue shows at various points, and Hank Thompson's show seems also to have been in this style.\n\nJackson had never played with a band before, and by her own account she wasn't very good when she guested with Thompson's band for the first time. But Thompson had faith in her. He couldn't take her on the road, because she was still so young she had to go to school, but every time he played Oklahoma he'd invite her to do a few numbers with his band, mentoring her and teaching her on stage how to perform with other musicians.\n\nThompson also invited Jackson to appear on his local TV show, which led to her getting a TV show of her own in the Oklahoma area, and she became part of a loose group of locally-popular musicians, including the future homophobic campaigner against human rights Anita Bryant.\n\nWhile she was still in high school, Thompson recorded demos of her singing and took them to his producer, Ken Nelson, at Capitol Records. Nelson liked her voice, but when he found out she was under eighteen he decided to pass on recording her, just due to the legal complications and the fact that she'd not yet finished school.\n\nInstead, Jackson was signed to Decca Records, where she cut her first recordings with members of Thompson's band. Her first single was a duet with another featured singer from Thompson's band, Billy Gray. Thompson, who was running the session, basically forced Jackson to sing it against her objections. She didn't have a problem with the song itself, but she didn't want to make her name from a duet, rather than as a solo artist.\n\n[Excerpt: Billy Gray and Wanda Jackson, \"You Can't Have My Love\"]\n\nShe might not have been happy with the recording at first, but she was feeling better about it by the time she started her senior year in High School with a top ten country single.\n\nHer followups were less successful, and she became unhappy with the way her career was going. In particular she was horrified when she first played the Grand Ole Opry. She was told she couldn't go onstage in the dress she was wearing, because her shoulders were uncovered and that was obscene -- at this time, Jackson was basically the only country singer in the business who was trying to look glamorous rather than like a farmgirl -- and then, when she did get on stage, wearing a jacket, she was mocked by a couple of the comedy acts, who stood behind her making fun of her throughout her entire set. Clearly the country establishment wasn't going to get along with her at all.\n\nBut then she left school, and became a full-time musician, and she made a decision which would have an enormous effect on her. Her father was her manager, but if she was going to get more gigs and perform as a solo artist rather than just doing the occasional show with Hank Thompson, she needed a booking agent, and neither she nor her father had an idea how to get one.\n\nSo they did what seemed like the most obvious thing to them, and bought a copy of Billboard and started looking through the ads. They eventually found an ad from a booking agent named Bob Neal, in Memphis, and phoned him up, explaining that Wanda was a recording artist for Decca records.\n\nNeal had heard her records, which had been locally popular in Memphis, and was particularly looking for a girl singer to fill out the bill on a tour he was promoting with a new young singer he managed, named Elvis Presley.\n\nBackstage after her support slot on the first show of the tour, she and her father heard a terrible screaming coming from the auditorium. They thought at first that there must have been a fire, and Wanda's father went out to investigate, telling her not to come with him. He came back a minute later telling her, \"You've got to come see this\".\n\nThe screaming was, of course, at Elvis, and immediately Wanda knew that he was not any ordinary country singer. The two of them started dating, and Elvis even gave Wanda his ring, which is still in her possession, and while they eventually drifted apart, he had a profound influence on her.\n\nHer father was not impressed with Elvis' performance, saying \"That boy's got to get his show in order... He's all over the stage messin' around. And he's got to stop slurrin' his words, too.\"\n\nWanda, on the other hand, was incredibly impressed with him, and as the two of them toured -- on a bill which also included Bob Neal's other big act of the time, Johnny Cash -- he would teach her how to be more of a rock and roller like him. In particular, he taught her to strum the acoustic guitar with a single strum, rather than to hit each string individually, which was the style of country players at the time.\n\nMeanwhile, her recording career was flagging -- she hadn't had another hit with any of her solo recordings, and she was starting to wonder if Decca was the right place for her. She did, though, have a hit as a songwriter, with a song called \"Without Your Love\", which she'd written for Bobby Lord, a singer who appeared with her on the radio show Ozark Jubilee.\n\n[Excerpt: Bobby Lord, \"Without Your Love\"]\n\nThat song had gone to the top ten in the country charts, and turned out to be Lord's only hit single.\n\nBut while she could come up with a hit for him, she wasn't having hits herself, and she decided that she wanted to leave Decca. Her contract was up, and while they did have the option to extend it for another year and were initially interested in exercising the option, Decca agreed to let her go.\n\nMeanwhile, Wanda was also thinking about what kind of music she wanted to make in the future. Elvis had convinced her that she should move into rockabilly, but she didn't know how to do it. She talked about this to Thelma Blackmon, the mother of one of her schoolfriends, who had written a couple of songs for her previously, and Blackmon came back with a song called \"I Gotta Know\", which Jackson decided would be perfect to restart her career.\n\nAt this point Hank Thompson went to Ken Nelson, and told him that that underage singer he'd liked was no longer underage, and would he be interested in signing her?\n\nHe definitely was interested, and he took her into the Capitol tower to record with a group of session musicians who he employed for as many of his West Coast sessions as possible, and who were at that point just beginning to create what later became the Bakersfield Sound.\n\nThe musicians on that session were some of the best in the country music field -- Jelly Sanders on fiddle, Joe Maphis on guitar, and the legendary Ralph Mooney on steel guitar, and they were perfect for recording what would become a big country hit.\n\nBut \"I Gotta Know\" was both country and rock and roll. While the choruses are definitely country:\n\n[Excerpt: Wanda Jackson, \"I Gotta Know\"]\n\nthe verses are firmly in the rock and roll genre:\n\n[Excerpt: Wanda Jackson, \"I Gotta Know\"]\n\nNow, I'm indebted to the website \"Women in Rock & Roll's First Wave\", which I'll link in the shownotes, for this observation, but this kind of genre-mixing was very common particularly with women, and particularly with women who had previously had careers outside rock and roll and were trying to transition into it. While male performers in that situation would generally jump in head first and come up with an embarrassment like Perry Como's version of \"Ko Ko Mo\", female performers would do something rather different.\n\nThey would, in fact, tend to do what Jackson did here, and combine the two genres, either by having a verse in one style and a chorus in the other, as Wanda does, or in other ways, as in for example Kay Starr's \"Rock and Roll Waltz\":\n\n[Excerpt: Kay Starr, \"Rock and Roll Waltz\"]\n\nStarr is a particularly good example here, because she's doing what a lot of female performers were doing at the time, which is trying to lace the recording with enough irony and humour that it could be taken as either a record in the young persons' style parodying the old persons' music, or a record in the older style mocking the new styles. By sitting on the fence in this way and being ambiguous enough, the established stars could back down if this rock and roll music turned out to be just another temporary fad.\n\nJackson isn't quite doing that, but with her Elvis-style hiccups on the line \"I gotta know, I gotta know\", she comes very close to parody, in a way that could easily be written off if the experiment had failed.\n\nThe experiment didn't fail, however, and \"I Gotta Know\" became Jackson's biggest hit of the fifties, making its way to number fifteen on the country charts -- rather oddly, given that she was clearly repositioning herself for the rockabilly market, it seemed to sell almost solely to the country market, and didn't cross over the way that Carl Perkins or Gene Vincent did.\n\nHer next single could have been the one that cemented her reputation as the greatest female rockabilly star of all, had it not been for one simple mistake. The song \"Hot Dog! That Made Him Mad!\" had been a favourite in her stage act for years, and she would let out a tremendous growl on the title line when she got to it, which would always get audiences worked up.\n\nUnfortunately, she horrified Ken Nelson in the studio by taking a big drink of milk while all the session musicians were on a coffee break. She hadn't realised what milk does to a singer's throat, and when they came to record the song she couldn't get her voice to do the growl that had always worked on stage. The result was still a good record, but it wasn't the massive success it would otherwise have been:\n\n[Excerpt: Wanda Jackson, \"Hot Dog! That Made Him Mad!\"]\n\nAfter that failed, Ken Nelson floundered around for quite a while trying to find something else that could work for Jackson. She kept cutting rockabilly tracks, but they never quite had the power of her stage performances, and meanwhile Nelson was making mistakes in what material he brought in, just as he was doing at the same time with Gene Vincent. Just like with Vincent, whenever Wanda brought in her own material, or material she'd picked to cover by other people, it worked fine, but when Nelson brought in something it would go down like a lead balloon.\n\nProbably the worst example was a terrible attempt to capitalise on the current calypso craze, a song called \"Don'a Wanna\", which was written by Boudleaux Bryant, one of the great songwriters of the fifties, but which wouldn't have been his best effort even before it was given a racist accent at Nelson's suggestion (and which Jackson cringed at doing even at the time, let alone sixty years later):\n\n[Excerpt: Wanda Jackson, \"Don'a Wanna\"]\n\nMuch better was \"Cool Love\", which Jackson co-wrote herself, with her friend Vicki Countryman, Thelma Blackmon's daughter:\n\n[Excerpt: Wanda Jackson, \"Cool Love\"]\n\nThat one is possibly too closely modelled after Elvis' recent hits, right down to the backing vocals, but it features a great Buck Owens guitar solo, it's fun, and Jackson is clearly engaged with the material.\n\nBut just like all the other records since \"I Wanna Know\", \"Cool Love\" did nothing on the charts -- and indeed it wouldn't be until 1960 that Jackson would reach the charts again in the USA. But when she did, it would be with recordings she'd made years earlier, during the time period we're talking about now.\n\nAnd before she did, she would have her biggest success of all, and become the first rock and roll star about whom the cliche really was true -- even though she was having no success in her home country, she was big in Japan.\n\nBut that's a story for a few weeks' time...",
  "enclosure": "",
  "itunes:summary": "Episode forty-three of A History of Rock Music in Five Hundred Songs looks at \"I Gotta Know\" by Wanda Jackson, and the links between rockabilly and the Bakersfield Sound. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Bacon Fat\" by Andre Williams.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nMy main source for this episode is Wanda Jackson's autobiography, Every Night is Saturday Night.\n\nI also made reference to the website Women in Rock & Roll's First Wave, and I am very likely to reference that again in future episodes on Wanda Jackson and others.\n\nI mentioned the podcast Cocaine and Rhinestones, and its episode on \"Okie From Muskogee\". Several other episodes of that podcast touch tangentially on people mentioned in this episode too -- the two-parter on Buck Owens and Don Rich, the episode on Ralph Mooney, and the episode on the Louvin Brothers all either deal with musicians who played on Wanda's records, with Ken Nelson, or both. Generally I think most people who enjoy this podcast will enjoy that one as well.\n\nAnd this compilation collects most of Jackson's important early work.\n\nErrata\n\nI say Jackson's career spans more than the time this podcast covers. I meant in length of time – this podcast covers sixty-two years, and Jackson's career so far has lasted seventy-one – but the ambiguity could suggest that this podcast doesn't cover anything prior to 1948.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nToday we're going to talk about someone whose career as a live performer spans more than the time that this podcast covers. Wanda Jackson started performing in 1948, and she finally retired from live performance in March 2019, though she has an album coming out later this year. She is only the second performer we've dealt with who is still alive and working, and she has the longest career of any of them.\n\nWanda Jackson is, simply, the queen of rockabilly, and she's a towering figure in the genre.\n\nJackson was born in Oklahoma, but as this was the tail-end of the great depression, she and her family migrated to California when she was small, as stragglers in the great migration that permanently changed California.\n\nThe migration of the Okies in the 1930s is a huge topic, and one that I don't have the space to explain in this podcast -- if you're interested in it, I'd recommend as a starting point listening to the episode of the great country music podcast Cocaine & Rhinestones on \"Okie From Muskogee\", which I'll link in the show notes. The very, very, shortened version is that bad advice as to best farming practices created an environmental disaster on an almost apocalyptic scale across the whole middle of America, right at the point that the country was also going through the worst economic disaster in its history. As entire states became almost uninhabitable, three and a half million people moved from the Great Plains to elsewhere in the US, and a large number of them moved to California, where no matter what state they actually came from they became known as \"Okies\".\n\nBut the thing to understand about the Okies for this purpose is that they were a despised underclass -- and as we've seen throughout this series, members of despised underclasses often created the most exciting and innovative music.\n\nThe music the Okies who moved to California made was far more raucous than the country music that was popular in the Eastern states, and it had a huge admixture of blues and boogie woogie in it. Records like Jack Guthrie's \"Oakie Boogie\", for example, a clear precursor of rockabilly:\n\n[Excerpt: Jack Guthrie, \"Oakie Boogie\"]\n\nWe talked way back in episode three about Western Swing and the distinction in the thirties and forties between country music and wes",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode forty-three of A History of Rock Music in Five Hundred Songs looks at \"I Gotta Know\" by Wanda Jackson, and the links between rockabilly and the Bakersfield Sound. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Bacon Fat\" by Andre Williams.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nMy main source for this episode is Wanda Jackson's autobiography, Every Night is Saturday Night.\n\nI also made reference to the website Women in Rock & Roll's First Wave, and I am very likely to reference that again in future episodes on Wanda Jackson and others.\n\nI mentioned the podcast Cocaine and Rhinestones, and its episode on \"Okie From Muskogee\". Several other episodes of that podcast touch tangentially on people mentioned in this episode too -- the two-parter on Buck Owens and Don Rich, the e",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}