{
  "title": "S1 E2: Doing the Real Work to Free Yourself",
  "link": "https://live-sounds-true-podcast.pantheonsite.io/podcast/doing-the-real-work-to-free-yourself/",
  "pubDate": "Wed, 07 Jul 2021 15:00:28 +0000",
  "guid": "https://resources.soundstrue.com/?post_type=podcast&#038;p=9177",
  "description": "According to Michael Singer, the only one stopping you from experiencing the heights of divine ecstasy and freedom is you. In this podcast, he describes the real work of the spiritual path as the process of removing our inner blockages and self-made obstacles in order to uncover the natural states of bliss and spiritual liberation that are our birthright. He also discusses discovering \"witness consciousness,\" the cause of karma, the art of relaxing and releasing resistance to our experience, and more.",
  "content:encoded": "<p><span style=\"font-weight: 400;\">According to Michael Singer, the only one stopping you from experiencing the heights of divine ecstasy and freedom is </span><i><span style=\"font-weight: 400;\">you.</span></i><span style=\"font-weight: 400;\"> In this podcast, he describes the real work of the spiritual path as the process of removing our inner blockages and self-made obstacles in order to uncover the natural states of bliss and spiritual liberation that are our birthright. He also discusses discovering &#8220;witness consciousness,&#8221; the cause of karma, the art of relaxing and releasing resistance to our experience, and more.</span></p>\n",
  "enclosure": "",
  "itunes:subtitle": "According to Michael Singer, the only one stopping you from experiencing the heights of divine ecstasy and freedom is you. In this podcast, he describes the real work of the spiritual path as the process of removing our inner blockages and self-made ob...",
  "itunes:summary": "According to Michael Singer, the only one stopping you from experiencing the heights of divine ecstasy and freedom is you. In this podcast, he describes the real work of the spiritual path as the process of removing our inner blockages and self-made obstacles in order to uncover the natural states of bliss and spiritual liberation that are our birthright. He also discusses discovering \"witness consciousness,\" the cause of karma, the art of relaxing and releasing resistance to our experience, and more.",
  "itunes:author": "Michael Singer",
  "itunes:image": "",
  "itunes:duration": "1:05:53"
}