{
  "id": "https://bibleinoneyear.org/en/youth/116",
  "title": "Day 116: Right Relationships",
  "description": "Proverbs 10:21,28, Joshua 10:25, Luke 23:32–43.  ‘Righteousness’ is ultimately about *right relationships* – a right relationship with God and right relationships with others  In the New Testament, we come to understand that this righteousness is only possible through faith in Jesus Christ (see Romans 3:21 – 4:25)",
  "pubDate": "Tue, 26 Apr 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/116/",
  "itunes:duration": "12:50",
  "guid": "enyouth26042022-116",
  "length": 770.4,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 116: Right Relationships",
  "itunes:subtitle": "Proverbs 10:21,28, Joshua 10:25, Luke 23:32–43.  ‘Righteousness’ is ultimately about *right relationships* – a right relationship with God and right relationships with others  In the New Testament, we come to understand that this righteousness is only possible through faith in Jesus Christ (see Romans 3:21 – 4:25)",
  "itunes:summary": "At an Alpha Conference we held in East Malaysia, there were people from all over Asia. Many had been persecuted because of their faith. One man told me that his father had been imprisoned for six years for the simple fact that he was a Christian pastor. He himself was imprisoned for a year, aged nineteen, for speaking out on behalf of his father.\nIt is a terrible injustice when the innocent are convicted and imprisoned – even worse when they are executed.\nIn the New Testament passage for today we read of one of the greatest injustices in human history. Jesus was totally innocent. He was ‘a righteous man’ (Luke 23:47). Yet he was executed by crucifixion. The apostle Peter explains it like this: ‘For Christ died for sins once for all, the righteous for the unrighteous, to bring you to God’ (1 Peter 3:18).\nThe word ‘righteous’ is often associated with the ‘self-righteous’, and has almost become a term of abuse. However, ‘righteous’ in the Bible is a wonderful word. It is also extremely important for our understanding of the whole Bible. ‘Righteousness’ is ultimately about right relationships – a right relationship with God and right relationships with others. In the New Testament, we come to understand that this righteousness is only possible through faith in Jesus Christ (see Romans 3:21 – 4:25).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 481
}