{
  "title": "TU57: Healthy Dating for Women Who Love Women with Guest Pam Greenstone LPC",
  "link": "https://therapistuncensored.com/episodes/tu57-healthy-dating-for-women-who-love-women-with-guest-pam-greenstone-lpc/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu57-healthy-dating-for-women-who-love-women-with-guest-pam-greenstone-lpc",
  "pubDate": "Mon, 12 Mar 2018 19:42:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=5936",
  "description": "Dating bites (& no, that’s not necessarily a complaint :)). Learn to get out there and enjoy yourself as you peruse your choices.  This episode is for everyone – all genders and sexualities – but today we focus on same-sex oriented women in the LGBTQ community.\n\nIf you’re a queer woman who has been struggling with your dating life or if you’re still considering whether or not to come out, you’ll enjoy this discussion with co-host Sue Marriott LCSW, and Austin-base therapist Pam Greenstone. They’ ll discuss the importance of building up a multi-faceted support system, identifying red flags in a partner as well as yourself, and pacing out a relationship.\n\nLearn to identify internalized sexual stigma and how to come to rely on others to keep you regulated in the early days of dating someone new. You’ll learn about some researched differences in dating in the heterosexual community and that in the LGBTQI community as well as gender role differences that come to play in some, but not all, same-sex relationships.\n\nSIGN UP FOR OUR LIVE CONFERENCE ON ATTACHMENT APRIL 7, 2018 –  Healing Adult Attachment, the 3 Pillars of Integrated Treatment  with Dr. David Elliott (Thank you to our fabulous co-sponsor Austin IN Connection.)\n\nOnline reading group to start mid April, 2018 for Elliott’s book – Attachment Disturbances in Adults Comprehensive Treatment and Repair (Norton 2016) by Daniel Brown and David Elliott. Reserve your slot today!\n\n\n\n0:00-15:00\n\nIntroduction\n\nInclusivity of LGBTQI community and discussion\n\nPam’s interest in the topic, desire for healthy dating patterns in community\n\nCultural context of homophobia, internalized sexual stigma, difficulty of ascribing to typical gender norms\n\nImportance of the support system\n\nImportance of gay pride as celebration rather than merely toleration\n\n15:00-30:00\n\nBuilding up an adequate support system\n\nConcentric circles of support: Self (middle) (Family & Friends/Layer A) (Layer B) (Layer C)\n\nMiddle Layer: Working on your own internalized sexual stigma, deciding whether or not to come out and the actual factors in that decision\n\nLayer A: People that support you and will come get you. They know when something is off in your dating life\n\n(Myth of) the U-Haul effect\n\nLooking for your own red flags\n\nThe notion of a partner “being the one” vs. nurturing a pairing\n\nIdentifying red flags\n\n30:00-45:00\n\nPacing in dating is vital, pushing for space to know how you feel without them\n\nValue of group therapy while dating, ability of others to see when you’re impaired in a way from dopamine\n\nImportance of remembering you’re flawed as well and finding a “good enough” partner\n\nFiguring out how much to share with partner right off the bat, enjoying the infancy of a relationship and not rushing\n\n45:00-60:00\n\nGetting out of dating and taking the pressure off\n\nSocialization of women to not disappoint or initiate\n\nYou don’t have to take responsibility for someone else’s emotions\n\nStrength of gay men – capacity of direct honesty\n\nDifferences between male and female same-sex couples\n\nIf you’re dating, look at your support system, look at your own red flags as well as others, finding a pace in dating\n\nWrap up and outro\n\n \n\nResources:\n\nIf the Buddha Dated: A Handbook for Finding Love on a Spiritual Path by Charlotte Kasl Pam’s recommendation for what to read next.\n\nHow to contact Pam!\n\nConscious Lesbian Dating and Love Ruth Schwarts and Michelle Murrain\n\nLesbian Sex Bible by Diana Cage (just so we are clear that women can have fun dating and not jump to relationships)\n\nTreating Out of Control Sexual Behavior by Doug Braun-Harvey (previous Therapist Uncensored guest with GLBTQI focus, this book is NOT related to gay dating but a different topic that we are just re-introducing because of it’s pro-sex inclusive messaging, which Doug brings.)\n\nBetter yet, hear our interview Refreshing Sexual Vitality with Doug Braun-Harvey,",
  "enclosure": "",
  "itunes:subtitle": "Dating bites (& no, that’s not necessarily a complaint :)). Learn to get out there and enjoy yourself as you peruse your choices.  This episode is for everyone – all genders and sexualities – but today we focus on same-sex oriented women in the LGBTQ c...",
  "itunes:summary": "This episode is for everyone – all genders and sexualities - but today we focus on same-sex oriented women in the LGBTQ community.  Learn to get out there and enjoy yourself as you peruse your choices.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "58:05"
}