{
  "title": "Why Henry Cavill is better as the Witcher than Superman",
  "link": "https://www.digitaltrends.com/movies/henry-cavill-better-as-geralt-the-witcher-than-superman/",
  "pubDate": "Sat, 05 Nov 2022 21:01:51 +0000",
  "dc:creator": "David Caballero",
  "category": [
    "Features",
    "Movies & TV",
    "dceu",
    "Henry Cavill",
    "Netflix",
    "Superman",
    "the witcher"
  ],
  "guid": "https://www.digitaltrends.com/?p=3219771",
  "description": "Henry Cavill made headlines last week when he announced he wouldn't return to The Witcher. However, is it wrong to say Cavill is a better Geralt than Superman?",
  "content:encoded": "<p>Henry Cavill sure loves getting people talking.  This week, Cavill returned alongside Millie Bobbie Brown in the safe and charming <em>Enola Holmes 2</em>, reprising his role as a hulking and slightly less capable Sherlock Holmes. More importantly, the actor donned the red and blue again with a cameo appearance <a href=\"https://www.digitaltrends.com/movies/black-adam-ending-explained/\">at the end of <em>Black Adam</em></a>. Cavill&#8217;s seconds on screen sent fans into a frenzy, and his <a href=\"https://twitter.com/screenrant/status/1587173901498748928\" target=\"_blank\" rel=\"noopener\">many</a>, <a href=\"https://www.digitalspy.com/movies/a41855299/superman-henry-cavill-james-gunn-dc/\" target=\"_blank\" rel=\"noopener\">many</a>, <a href=\"https://www.youtube.com/watch?v=Srx0YGQ-_Dg\" target=\"_blank\" rel=\"noopener\"><em>many</em></a> statements about Superman&#8217;s long-awaited return made it clear his new take on the Last Son of Krypton would be far removed from the stoic man-god he played in previous DCEU entries.</p>\n<p>However, Cavill&#8217;s biggest news came over the weekend, with a bombshell report about his exit from Netflix&#8217;s hit <em>The Witcher</em>. Shortly after <a href=\"https://twitter.com/witchernetflix/status/1586433840318648321\" target=\"_blank\" rel=\"noopener\">the show&#8217;s Twitter account</a> posted the news, <a class=\"hoverZoomLink\" href=\"https://www.instagram.com/p/CkTv9FyPnNz/?hl=en\" target=\"_blank\" rel=\"noopener\">Cavill took to Instagram</a> to make a vague statement about his departure. The news shocked the business, with few, if any, outlets anticipating the announcement, not to mention Cavill&#8217;s rabid fandom, who immediately started pointing fingers while scrambling for an explanation.</p>\n<p>It&#8217;s always hard to see an actor depart a beloved role, especially when said actor does a good job with the part. However, Cavill&#8217;s exit from the show became an even more delicate subject, considering the abruptness of the news and the lack of clarity regarding his motives. Vagueness only benefits the rumor mill, and the rumors are not looking good for anyone involved. But Cavill is arguably making a mistake in forsaking a role that critics and audiences agree was meant for him, perhaps even more than Superman. And while playing the Man of Steel in a major motion picture might seem more appealing than spending four more seasons slumming in the Continent down on Netflix, Geralt might be the role Cavill was born to play.</p>\n<h2>Cavill respects The Witcher&#8217;s character and lore</h2>\n<figure class=\"alignnone\"><img  class=\" size-large wp-image-2950914\" src=\"https://www.digitaltrends.com/wp-content/uploads/2021/12/the-witcher-season-2-henry-cavill-geralt.jpg?fit=720%2C404&p=1\" alt=\"Geralt sitting on a tree and looking tired in The Witcher.\"   /></figure>\n<p>Although Cavill&#8217;s experience in <em>The Witcher</em> always seemed positive, the show itself has always been somewhat controversial. Season 1 received considerable criticism for its confusing storytelling approach, earning a mediocre <a href=\"https://www.rottentomatoes.com/tv/the_witcher/s01\" target=\"_blank\" rel=\"noopener\">68% on Rotten Tomatoes</a>. The performances &#8212; particularly Cavill and series standout Anya Chalotra &#8212; earned praise, but the writing attracted mixed-to-negative reviews. Still, critics and fans agreed the show had potential and attributed the imbalance to it being its first season. <a href=\"https://www.digitaltrends.com/movies/the-witcher-season-2-review/\">Season 2 of <em>The Witcher</em></a> received considerably more praise from critics, who praised the tone, performances, and the more unified and focused plot. However, fans were not so receptive toward the new season.</p>\n<p>The show made many changes to the source material, including altering certain characters&#8217; fates, changing major storylines, and playing fast and loose with the lore. Controversy will always arise whenever an adaptation changes aspects of the source material. However, <em>The Witcher</em>&#8216;s main problem is its lack of a clear vision of what it wants to be, a confusion shared by everyone in front of and behind the camera. Whereas the games are very clear about being distinct stories inspired by the characters and events from the novels, the show marketed itself as an adaptation of the novels. Alas, it failed to live up to that promise.</p>\n<iframe src=\"https://www.youtube.com/embed/tN6EIt9cq4w\" width=\"640\" height=\"360\"></iframe>\n<p>During the show&#8217;s press tours, Cavill went on about how <a href=\"https://www.philstar.com/entertainment/2021/12/05/2145712/henry-cavill-pushing-changes-witcher-2-meeting-pinoy-fans\" target=\"_blank\" rel=\"noopener\">he wanted to be faithful to the books</a>. Furthermore, he talked about how it was a struggle to reconcile his love for the books with &#8220;the showrunners&#8217; vision,&#8221; making it seem like there was a genuine problem within the show&#8217;s creative team.</p>\n<p>Cavill has become a poster child for the geek community; <a href=\"https://www.digitaltrends.com/movies/henry-cavill-superman-enola-holmes-2-gaming-pc-build/\">he adores his PC</a>, plays <em>World of Warcraft</em>, brags about his passion for <em>Warhammer</em> on Instagram, and goes on about his love for fantasy novels. Fans consider him the King of the Nerds, a title he doesn&#8217;t seem to mind. And, if the King of Nerds himself, who famously <a href=\"https://www.vulture.com/2019/07/henry-cavill-in-the-witcher-the-story-behind-the-casting.html\" target=\"_blank\" rel=\"noopener\">fought to win the role of Geralt</a>, seems unhappy with his show, then it must be because the showrunners aren&#8217;t taking the source material seriously, right? That&#8217;s what his fans believe; unfortunately, the rumors surrounding <em>The Witcher</em>&#8216;s production seem to confirm it.</p>\n<figure class=\"alignnone\"><img  class=\" size-large wp-image-2569475\" src=\"https://www.digitaltrends.com/wp-content/uploads/2020/10/the-witcher-on-netflix.jpg?fit=720%2C405&p=1\" alt=\"Geralt with his hands on a table looking serious in The Witcher.\"   /></figure>\n<p>A few weeks ago, Beau DeMayo, who worked as a writer on <em>The Witcher</em>, <a href=\"https://sffgazette.com/fantasy/television/the-witcher-writer-beau-demayo-says-many-scribes-working-on-the-a2336\" target=\"_blank\" rel=\"noopener\">claimed during an Instagram Q&A</a> that several of the show&#8217;s writers &#8220;actively disliked the books and games&#8221; and openly &#8220;mocked the source material.&#8221; The scathing news followed several other incidents in which the creative minds behind the show seemed to misunderstand the source material. A major piece of news came out after season 2&#8217;s premiere, in which showrunner Lauren Schmidt Hissrich confessed <a href=\"https://www.polygon.com/22846536/the-witcher-roach-season-2-scene-henry-cavill\" target=\"_blank\" rel=\"noopener\">Cavill rewrote Roach&#8217;s death scene</a>, turning it into a heartfelt moment as opposed to the scene&#8217;s original humorous tone.</p>\n<p>With a divisive second season and news that the show&#8217;s writer&#8217;s room dislikes the source material, Cavill&#8217;s exit seems to make sense. His fans believe the show failed him, while trades and insiders try to beat each other and find the real reason behind his departure. However, few are wondering if Cavill should&#8217;ve left the show, especially considering the ink isn&#8217;t dry on his Superman contract; according to some, there might not even be one. So was he right to leave? Probably not.</p>\n<h2>He&#8217;s a better fit for Geralt than Superman</h2>\n<figure class=\"alignnone\"><img  class=\" size-large wp-image-2829639\" src=\"https://www.digitaltrends.com/wp-content/uploads/2021/10/the-witcher-season-2-trailer.jpg?fit=720%2C405&p=1\" alt=\"Geralt looking confused in in The Witcher.\"   /></figure>\n<p>What makes Cavill such a convincing and compelling Geralt? For starters, he fits the physical bill to a tee. The guy is massive, with arms the size of tree trunks and thighs threatening to burst out of his pants. Cavill has the physique of a hero, or in this case, a monster hunter. Sure, the wig looked cheap in season 1, but Cavill&#8217;s screen presence was overwhelming.</p>\n<p>Still, beyond any physical trait, Cavill understands Geralt. The White Wolf is a complex character in the books and games, a sensitive wannabe philosopher masquerading as a brutal and stoic monster killer. Geralt is funny, possessing a dry sense of humor and curiosity beyond anyone&#8217;s expectations. Despite his hulking appearance, he is a softie, deeply insecure and struggling with feelings of inadequacy bordering on self-pity. Above all, and most surprisingly, Geralt is a hopeful man. He is cynical and pragmatic but still believes; he struggles to maintain his humanity in a world that constantly tries to deprive him of it and makes the best out of his nomadic, solitary lifestyle.</p>\n<p>Cavill knows all this about Geralt and incorporates it beautifully into his portrayal. Say what you will about Cavill&#8217;s acting abilities, but the guy embodies Geralt perfectly. Even during season 1, when he confusingly spends most of the time in sulking silence, the actor embodies Geralt&#8217;s main traits effortlessly. He is curious, observing from the corner and analyzing his surroundings. He is gentle, treating his friends and allies with care while still keeping them at a distance. He is moral, hesitating before every action he makes and being afraid to mess up like he has many times before.</p>\n<iframe src=\"https://www.youtube.com/embed/v_bnu-6oOwc\" width=\"1440\" height=\"810\"></iframe>\n<p>Season 2 allows Cavill more room to explore Geralt&#8217;s psyche. Placing his tender side front and center as he finds himself caring for Ciri and mourning the supposedly dead Yennefer, Cavill finds new layers to complete his portrayal of Geralt. The result is a comprehensive take on a character who defies people&#8217;s expectations. Like the Geralt on the page, Cavill&#8217;s Geralt is a pleasant surprise &#8212; perhaps not the kind that takes your breath away, but certainly the type that brings a warm smile to your face.</p>\n<p>Most importantly, Cavill&#8217;s passion for Geralt was always blatantly obvious. The guy <em>wanted</em> to be Geralt, and it showed. How often are actors so passionate about the role they&#8217;re playing? Many take these high-profile jobs for the paycheck and to add a major franchise to their resume. But Cavill loved <em>The Witcher</em> and ensured everyone knew it.</p>\n<p>Now, Liam Hemsworth is an ok actor. He is not a movie star, but he is not <em>completely</em> awful. However, when you had someone like Cavill, who set the bar high, actively contributed to creating a fully-fledged version of the character, and had genuine passion for the project, it&#8217;s hard not to think of the replacement as a poor man&#8217;s excuse. Netflix and <em>The Witcher</em> are setting up Hemsworth for failure. Unless this man gets Andrzej Sapkowski into a room and writes a thousand-page dissertation on Geralt&#8217;s psyche, chances are his efforts will always pale in comparison to Cavill&#8217;s.</p>\n<h2>The White Wolf or the Last Son of Krypton?</h2>\n<figure class=\"alignnone\"><img  class=\" size-large wp-image-3213002\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/10/henry-cavill-superman-return.jpg?fit=720%2C405&p=1\" alt=\"Superman gazes in the distance in an image from Henry Cavill's Instagram.\"   /></figure>\n<p>It&#8217;s hard not to think that Cavill jumped from the <em>Witcher</em> ship because something better came along, mainly the chance to wear the red cape again. Indeed, the Man of Steel is not only <a href=\"https://www.digitaltrends.com/movies/5-most-powerful-dceu-characters-ranked/\">the most powerful DC character</a> but an outright pop culture icon with an indelible place in our collective imagination. Only a fool would say no at the chance to play him.</p>\n<p>And yet, one can&#8217;t help but think that Cavill is a better fit with Geralt than Superman. The Last Son of Krypton is a shameless boy scout; he is a mama&#8217;s boy, a trooper, and an unassuming goofball. Superman is the sort of unabashedly cheery person that can only exist in comic books. He is too much but is never annoying or tiresome. He is the ultimate role model, a living, breathing ray of sunshine. That&#8217;s difficult to portray. Many actors have tried, but only a few have truly succeeded.</p>\n<p>Cavill is a charming guy, and while he can undoubtedly portray a hopeful and positive Superman, can he live up to the expectations of millions of people? He hasn&#8217;t been Superman in five years, and fans have been tirelessly clamoring for his return. They will expect the very best version of the Man of Steel to date. Cavill needs to be perfect &#8212; not good, not great &#8212; because nothing else will suffice.</p>\n<p>Then there&#8217;s the brooding elephant in the room. Many fans wanted Cavill back, because he represents the beginning of the DCEU, and his return would mean restoring a particular director&#8217;s vision. But Cavill has made it blatantly clear he wants nothing to do with the stoic version of Superman, which means no restoring of anything.</p>\n<p>Will those fans support Cavill&#8217;s new, more traditional take, or will they turn their backs on him? Cavill seems to be entering his new Superman journey with far more obstacles than when he first took on the role in 2013. 11 years is a significant amount of time. Is there still room for his Superman? Is there still an audience, or was the noise to bring him back just that: noise?</p>\n<iframe src=\"https://www.youtube.com/embed/zPziCLFQL-E\" width=\"640\" height=\"360\"></iframe>\n<p>With Geralt, Cavill had something good, a character untouched by anyone else, with enough appeal to cement itself as a major player in pop culture. If Cavill indeed had a problem with the behind-the-scenes talent, surely he had enough pull to renegotiate their approach to the show? Fans would&#8217;ve rallied behind him. However, if it was a Superman-or-Geralt situation, was the best choice not Geralt? It would&#8217;ve hurt to say goodbye to Superman, but he had an entire continent to make up for the loss.</p>\n<p>Alas, the deed is done, and Henry Cavill is the Witcher no more. The show&#8217;s future doesn&#8217;t seem promising &#8212; we can probably say goodbye to the proposed seven-season plan. I&#8217;d be surprised if it makes it past Hemsworth&#8217;s first season. As for Superman, only time will tell, but Cavill faces an uphill battle. Unlike with Geralt, Cavill re-enters the Superman camp with a divided fandom split in half about whether he is a good choice for the role. The DCEU is on the verge of collapse, and James Gunn and Peter Safran will surely do everything in their now considerable power to keep it afloat. If Cavill plays his cards right, that might include him. If he doesn&#8217;t, or if his take on Superman underperforms in any way, we could be seeing a new Man of Steel in years. Then, all this mess would&#8217;ve been for nothing.</p>\n<p><em>You can stream the first two seasons of </em>The Witcher<em> on Netflix. You can also stream </em>Man of Steel<em> on HBO Max. Don&#8217;t bother with </em>Justice League<em> though.</em></p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2021/12/the-witcher-season-2-henry-cavill-geralt-sword.jpg?p=1",
  "enclosure": "",
  "post-id": 3219771
}