{
  "title": "Sounding Out the Acoustic Integrated Circuit",
  "link": "https://spectrum.ieee.org/acoustic-integrated-circuit",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-gold-chip-on-a-copper-peg-board-with-wires.jpg?id=30154689&width=2000&height=1500&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>\n\tAcoustic devices now play key roles in mobile phones and other electronics, but these often control sound waves passively. Now scientists have for the first time developed a way to electrically control and modify sound waves on a chip actively, potentially one day enabling more complex acoustic circuitry.<br/>\n</p><p>\n\tA modern cellphone possesses dozens of <a href=\"https://spectrum.ieee.org/acoustic-amplifier\" target=\"_self\">acoustic devices</a> based on piezoelectric crystals, which can convert electric signals to sound waves and vice versa. These components are often used to manipulate acoustic waves that ripple on the surfaces of solid materials.\n</p><p>\n\tAcoustic waves travel at the speed of sound, making them much slower than electromagnetic signals of the same frequency. However, they also possess much shorter wavelengths. For instance, compared with gigahertz electromagnetic waves, acoustic wavelengths are five orders of magnitude shorter.\n</p><p>\n\tThe comparably shorter wavelengths of acoustic waves means they are often easy to use in ultracompact devices. Surface acoustic wave (SAW) filters are often used in mobile phones to help extract desirable signals from all the radio waves hitting their antennas.\n</p><p>\n\tHowever, most acoustic devices are passive components. Now scientists have developed a way to control and tune SAWs electrically. This may one day open the door to more complex sound-based devices, such as acoustic integrated circuits.\n</p><p>\n\tIn a new study, researchers experimented with the piezoelectric material <a href=\"https://en.wikipedia.org/wiki/Lithium_niobate\" target=\"_blank\">lithium niobate</a>. When they applied an electric field to it, they could vary the lithium niobate’s elasticity—how much it distorted in the face of mechanical pressure—due to a phenomenon known as the <a href=\"https://www.sciencedirect.com/topics/physics-and-astronomy/electroacoustics\" target=\"_blank\">electroacoustic effect</a>. In this way, they could manipulate the phase, amplitude, and frequency of gigahertz SAWs rippling across the lithium niobate.\n</p><p>\n\tThe scientists not only showed they could manipulate acoustic waves at room temperature, but also at millikelvin temperatures a few thousandths of a degree above absolute zero. “Most semiconductor devices cannot work at both temperatures, but our devices work well,” says study lead author Linbo Shao at Virginia Tech in Blacksburg.\n</p><p>\n\tThese findings suggest this breakthrough might find applications in quantum computing, which often requires extraordinary cold to keep heat from disrupting their workings. Previous research suggested that pulses of acoustic energy known as <a href=\"https://en.wikipedia.org/wiki/Phonon\" target=\"_blank\">phonons</a> may help relay information between the components known as <a href=\"https://spectrum.ieee.org/silicon-spin-qubits\" target=\"_self\">quantum bits or qubits</a> on which quantum computers rely.\n</p><p>\n\tThe researchers are now working to build more complex, large-scale acoustic devices.\n</p><p>\n\t“We envision a hardware platform of acoustic-wave integrated circuits, which can be potentially used for microwave signal processing and also quantum circuits,” Shao says.\n</p><p>\n\tThe scientists detailed <a href=\"https://www.nature.com/articles/s41928-022-00773-3\" target=\"_blank\">their findings</a> last month in the journal <em>Nature Electronics</em>.\n</p>",
  "pubDate": "Wed, 20 Jul 2022 13:44:52 +0000",
  "guid": "https://spectrum.ieee.org/acoustic-integrated-circuit",
  "category": [
    "Saw",
    "Phonons",
    "Lithium niobate",
    "Quantum computing",
    "Qubits",
    "Acoustics",
    "Electroacoustic effect"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}