{
  "id": "yt:video:PH1p28qOSJI",
  "yt:videoId": "PH1p28qOSJI",
  "yt:channelId": "UCkR0GY0ue02aMyM-oxwgg9g",
  "title": "Prey for the Devil Movie Clip - Not With God (2022)",
  "link": "",
  "author": {
    "name": "Rotten Tomatoes Coming Soon",
    "uri": "https://www.youtube.com/channel/UCkR0GY0ue02aMyM-oxwgg9g"
  },
  "published": "2022-10-31T13:00:12+00:00",
  "updated": "2022-10-31T13:00:12+00:00",
  "media:group": {
    "media:title": "Prey for the Devil Movie Clip - Not With God (2022)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Check out the new movie clip for Prey for the Devil starring Colin Salmon! \n\n► Buy Tickets to Prey for the Devil: https://www.fandango.com/prey-for-the-devil-2022-226171/movie-overview?cmp=CSYT_YouTube_Desc\n\nSubscribe to the channel and click the bell icon to be notified of all the best clips and behind the scenes content: http://bit.ly/2CMX5D1 \n\nUS Release Date: October 28, 2022\nStarring: Jacqueline Byers, Colin Salmon, Christian Navarro\nDirector: Daniel Stamm\nSynopsis: Sister Ann (Jacqueline Byers) believes she is answering a calling to be the first female exorcist… but who, or what, called her?  In response to a global rise in demonic possessions, Ann seeks out a place at an exorcism school reopened by the Catholic Church. Until now these schools have only trained priests in the Rite of Exorcism – but a professor (Colin Salmon) recognizes Sister Ann’s gifts and agrees to train her. Thrust onto the spiritual frontline with fellow student Father Dante (Christian Navarro), Sister Ann finds herself in a battle for the soul of a young girl, who Sister Ann believes is possessed by the same demon that tormented her own mother years ago. Determined to root out the evil, Ann soon realizes the Devil has her right where he wants her.\n\n► Learn more: https://www.rottentomatoes.com/m/prey_for_the_devil?cmp=CSYT_YouTube_Desc\n\nWatch More:  \n► Rotten Tomatoes Originals: http://bit.ly/2D3sipV    \n► Fresh New Clips: https://bit.ly/3mJePrv    \n► Hot New Trailers: http://bit.ly/2qThrsF   \n► New TV This Week: https://bit.ly/3Or3I2w  \n \nRotten Tomatoes COMING SOON takes you deeper into the best upcoming movies through clips, behind the scenes videos, and exclusive content.\n\n#PreyForTheDevil",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}