{
  "title": "Ep 353: Women in Wine and the Subtle Symphony of Quiet Misogyny",
  "itunes:title": "Women in Wine and the Subtle Symphony of Quiet Misogyny",
  "pubDate": "Tue, 01 Dec 2020 23:40:57 +0000",
  "guid": "3b9af93b-c44b-482b-8ea9-ca5a8a22bf6c",
  "link": "https://winefornormalpeople.libsyn.com/ep-353-women-in-wine-and-the-subtle-symphony-of-quiet-misogyny",
  "itunes:image": "",
  "description": "<p>This is a transcript of the first part of the podcast. The second part of the show discusses these points in more detail. </p> <p> </p> <p><span style=\"text-decoration: underline;\"><strong>Women in Wine and the Subtle Symphony of Quiet Misogyny</strong></span></p> <p>After mulling over the various scandals in wine lately, and thinking about my position in the wine world, I have a perspective to add beyond just a social media post to call out the behavior of those in the wine business, those who have minimized the situation, and the hollow calls for change that likely won’t happen.</p> <p> </p> <p><strong>Part I: What’s in the news, and what I have seen…</strong></p> <p>If you missed it, in the past few months, a spate of “scandals” has broken out in the wine world regarding women in wine.</p> <p> </p> <p>First, it was <a href=\"https://timatkin.com/on-wine-bitch/\">the #winebitch scandal in the United Kingdom</a>. This occurred when a well-known TV wine personality from the “Wine Show” in the UK and his cronies passed around text messages debasing young female and “softer” male wine influencers. I didn’t see these messages before they were removed from the web, but I’ve heard from those who did that the threads were raunchy, rude rants. They were also far-reaching – covering everything from the lack of value of these people’s contributions to the wine world (one could say that topic is at least ok to discuss although not in the manner raised) to criticizing their looks, children, and families (not even remotely ok).</p> <p> </p> <p>On the heels of this, an exposé in the <a href= \"https://www.nytimes.com/2020/10/29/dining/drinks/court-of-master-sommeliers-sexual-harassment-wine.html#:~:text=Twenty%2Done%20women%20told%20The,assaulted%20by%20male%20master%20sommeliers.&text=And%20one%20woman%20said%20she,a%20constant%20for%20women%20somms.\"> New York Times revealed that the highest-ranking men of the cult of Master Sommeliers</a>, as I like to call it and <a href= \"https://www.winefornormalpeople.com/professional-certifications-for-doctors-lawyers-and-finance-pros-are-real-but-not-for-wine/\"> have written about before</a>, have been demanding sexual favors and even raping (young) women in exchange for guaranteed career advancement. I have made the argument for a long time that the Court of Master Sommeliers is an exclusive in-crowd of people who know each other and who dictate membership based not only on skill but on favoritism. Apparently, that favoritism stretches far beyond the run of the mill BS that I had speculated about.</p> <p> </p> <p>Is this surprising? No. When I worked at the big hulking winery in the mid-2000s, executive assistants who had been there for 35 years told me that the senior executives and owners used to say wildly inappropriate things to them, and kiss and grope them while they were trying to work. Although these women tried (literally) to run away from these predators, this mistreatment was acceptable behavior and the women’s silence was the only way to maintain employment.</p> <p> </p> <p>I’m not excusing the behavior, but maybe this legacy means we need to take a historical view to understand the issues. Wine in the United States is an old school industry. Its very structure is based on something that was set up in 1933 after Congress’s failed attempt to ban alcohol through a constitutional amendment. Doubting the public could handle itself properly, Congress encouraged states to set up roadblocks and a three-tier system that treats adults as children with choices made for them about what, when, and how they can buy wine, gives certain huge producers and distributors power over markets, and in certain states, despite Supreme Court rulings, denies citizens the ability to procure the wines they prefer to drink.</p> <p> </p> <p>Further, for those in the industry, if you don’t drink copious amounts with your customers and co-workers, and if you are a woman not willing to be a good old boy and listen to piggish talk and smoke cigars, you’re a pariah. It’s an industry based on power in the hands of the few (like many industries).</p> <p> </p> <p>The deification of sommeliers, who completely disconnect with the very people they are supposed to serve in pursuit of a title that will give them power, is another outgrowth of this. The conclusion: the wine industry is based on other people who apparently know better than you (whomever <em>you</em> are), making decisions for you that you may or may not agree with. The recent scandals prove that little has changed since the incidents of the “Mad Men” era the women at the big winery told me about. And as more women have entered the industry, the opportunities for this kind of behavior have just multiplied.  <strong>Sexism in the wine industry is a subtle symphony of quiet misogyny.</strong></p> <p> </p> <p> </p> <p>As for me, I can’t count the number of times I have been ignored when I am in a group of industry men talking about wine. I am usually invisible to them and generally have no value. When I am with MC Ice in a setting that is not for podcast fans and listeners, men ask <em>him</em> the questions about wine even after he tells them what I do. And although I was too old and not cute enough to be a candidate for sexual harassment when I entered wine (I’m not sad about this, don’t worry!), the invisibility factor and belittlement factor was high with my male colleagues and bosses.</p> <p> </p> <p>Women in high positions in wine are also guilty of this type of behavior – ignoring those they feel are unimportant or who lack status (men and women at conferences will ignore me until someone else tells them my audience is large and then there’s huge interest on their part, huge disgust on mine). Plenty of women in wine are just about self-preservation. In fact, <a href= \"https://www.jancisrobinson.com/articles/women-and-wine-tipping-point\"> an article by Jancis Robinson is nothing short of a “there’s nothing to see here” rant about how the younger generation has social media to make “a fuss” as she puts it</a>. She argues that change should come for the economic viability of the wine industry, not for the absolute immorality of the acts of misogyny and inequality. I fear that her stance and that of those who support her show us that many women of the old guard are equally at fault for ignoring what goes on in the real world with normal wine people, AKA, the unwashed masses.</p> <p> </p> <p> </p> <p><strong>Part II: The Solution -- No, it’s not more women’s only groups or women’s scholarships</strong></p> <p>I don’t really consider myself part of the industry -- I chose to blaze my own path and work with what I consider to be the best sides of wine – producers and wine drinkers – and abandon the business for the very reasons I just described. Because of that I often stay out of these debates. But this is one that I need to discuss. Because like everything else in wine, the issue has been framed in a way that just doesn’t work and won’t bring structural change.</p> <p> </p> <p>So now I’d like to talk about the fix. Because the fix is not letting the men and women with stale ideas in the wine industry and financial interest steer this ship. And this is what is happening now. The wine industry LOVES to take the issue of the day, elevate it, and sweep it under the rug, or marginalize it so it becomes a splinter group. That’s what I see happening now: <strong><em>women’s initiatives! Let’s create a group to forward the cause of Women in Wine! Let’s make it so that women get promoted and we have our own safe space! Let’s give scholarships to women!</em></strong></p> <p> </p> <p>This tack lacks imagination and accomplishes nothing: We’ve already done this and it doesn’t work. The large corporations become sponsors of these “women-first” organizations so the problems they themselves create in the industry can’t be discussed in an open forum. Further, often the events are too costly and in places where the people who would benefit most can’t afford to get to (Napa and New York ain’t cheap). And frankly, once these organizations are off the ground, the women form their own in-crowd and never reach the people who may need the most help; Think of the young woman starting out in wine in Alabama who may be getting harassed but has nowhere to turn, or the sommelier in Omaha who has been told she can’t advance because men won’t take her seriously at a steakhouse. The elite women’s groups and scholarships for the few lucky enough to get them do nothing to help the majority of women.</p> <p> </p> <p>And while I applaud the people who are trying to lift up other women (unlike many in the old guard who feel they need to keep rising stars down to maintain their own status), we do not and cannot operate in a bubble. These organizations that are supporting women need to take a hard look at how to make change. The only way to make this work is to enlist male allies; not to cloister off in group of women who believe what you believe. Men and women must work together to create a productive solution that doesn’t make this problem a “women’s issue,” thus giving these predators and subtle sexists the power to make the situation an “us” vs. “them” issue.</p> <p> </p> <p>The organizations for women are already funded and organized, but now it’s time for them to move beyond talk and into action. They should take a page from the LGBTQ community: <a href= \"https://pflag.org/\">PFLAG</a> could serve as a great model – chapters exist all over the US to help people work together to understand the issues, foster acceptance, and create safer and more inclusive communities for people of the LGBTQ community. This volunteer chapter structure allows dialog, understanding, and true change and it is not dependent on how much money you have or whether or not you can pay $1,000 for a weekend conference in New York or Napa. With well-known, funded, publicized, and gender inclusive chapters change can happen in any community where women and decent, good men are willing to work to solve the problems in wine.</p> <p> </p> <p>Women are hurt and outraged but they should heed the warning: it is never right to close ranks and push people to the margins who want to help and who are willing, during our darkest times, to stand up for us and with us to help fight the darker elements of sexism. This is not a “women’s issue.” This is a cultural change that must happen in the wine industry and it can’t be done with scholarships and conferences of women alone. It must be a joint effort from everyone who is willing to be educated and to advocate for fairness.</p> <p> </p> <p>Until we address the problem and come up with an innovative, inclusive solution, the engine of sexism and discrimination will continue in wine, stifling creativity, destroying the self-esteem of outstanding people, and holding the entire wine industry back from progress it deserves. </p> <p> <strong>_______________________________________________</strong></p> <p><strong>Thanks to our sponsors this week:</strong></p> <p><a href=\"http://www.wineaccess.com/normal\" target=\"_blank\" rel= \"noopener\"><strong>Wine Access </strong></a><a href= \"http://www.wineaccess.com/normal\"><img class= \"img-responsive alignright\" style=\"float: right;\" src= \"https://assets.libsyn.com/secure/show/45638/wineaccess-logo-round-black.jpg\" alt=\"\" width=\"84\" height=\"84\" /></a></p> <p><em>Visit: <a href=\"http://www.wineaccess.com/normal\" target= \"_blank\" rel=\"noopener\">www.wineaccess.com/normal</a> and for a limited time get $20 off your first order of $50 or more! </em></p> <p>I’m so excited to introduce <a href= \"http://www.wineaccess.com/normal\">Wine Access</a> to you. <a href= \"http://www.wineaccess.com/normal\">Wine Access</a> is a web site that has exclusive wines that overdeliver for the price (of which they have a range). </p> <ul> <li>They offer top quality wines by selecting diverse, interesting, quality bottles you may not have access to at local shops.</li> <li><a href=\"http://www.wineaccess.com/normal\" target=\"_blank\" rel= \"noopener\">Wine Access</a> provides extensive tasting notes, stories about the wine and a really cool bottle hanger with pairings, flavor profile, and serving temps.</li> <li>Wines are warehoused in perfect conditions and shipped in temperature safe packs. Satisfaction is guaranteed! </li> </ul> <p>Check it out today! <em><a href= \"http://www.wineaccess.com/normal\" target=\"_blank\" rel= \"noopener\">www.wineaccess.com/normal</a> </em></p> <p> </p> <p><strong><a href= \"https://www.patreon.com/winefornormalpeople\"><img class= \"img-responsive alignright\" style=\"float: right;\" src= \"https://assets.libsyn.com/secure/show/45638/patreon_icon.jpg\" alt= \"\" width=\"106\" height=\"106\" /></a>Thanks to </strong><strong>YOU! </strong>The podcast supporters on Patreon, who are helping us to make the podcast possible and who we give goodies in return for their help! Check it out today:<br /> <a href= \"https://www.patreon.com/winefornormalpeople\">https://www.patreon.com/winefornormalpeople</a></p> <p> </p> <p>And to sign up for classes (now for UK and Euro time zones!) please go to <a href= \"http://www.winefornormalpeople.com/classes!\">www.winefornormalpeople.com/classes!</a> </p>",
  "content:encoded": "<p>This is a transcript of the first part of the podcast. The second part of the show discusses these points in more detail. </p> <p> </p> <p>Women in Wine and the Subtle Symphony of Quiet Misogyny</p> <p>After mulling over the various scandals in wine lately, and thinking about my position in the wine world, I have a perspective to add beyond just a social media post to call out the behavior of those in the wine business, those who have minimized the situation, and the hollow calls for change that likely won’t happen.</p> <p> </p> <p>Part I: What’s in the news, and what I have seen…</p> <p>If you missed it, in the past few months, a spate of “scandals” has broken out in the wine world regarding women in wine.</p> <p> </p> <p>First, it was <a href=\"https://timatkin.com/on-wine-bitch/\">the #winebitch scandal in the United Kingdom</a>. This occurred when a well-known TV wine personality from the “Wine Show” in the UK and his cronies passed around text messages debasing young female and “softer” male wine influencers. I didn’t see these messages before they were removed from the web, but I’ve heard from those who did that the threads were raunchy, rude rants. They were also far-reaching – covering everything from the lack of value of these people’s contributions to the wine world (one could say that topic is at least ok to discuss although not in the manner raised) to criticizing their looks, children, and families (not even remotely ok).</p> <p> </p> <p>On the heels of this, an exposé in the <a href= \"https://www.nytimes.com/2020/10/29/dining/drinks/court-of-master-sommeliers-sexual-harassment-wine.html#:~:text=Twenty%2Done%20women%20told%20The,assaulted%20by%20male%20master%20sommeliers.&text=And%20one%20woman%20said%20she,a%20constant%20for%20women%20somms.\"> New York Times revealed that the highest-ranking men of the cult of Master Sommeliers</a>, as I like to call it and <a href= \"https://www.winefornormalpeople.com/professional-certifications-for-doctors-lawyers-and-finance-pros-are-real-but-not-for-wine/\"> have written about before</a>, have been demanding sexual favors and even raping (young) women in exchange for guaranteed career advancement. I have made the argument for a long time that the Court of Master Sommeliers is an exclusive in-crowd of people who know each other and who dictate membership based not only on skill but on favoritism. Apparently, that favoritism stretches far beyond the run of the mill BS that I had speculated about.</p> <p> </p> <p>Is this surprising? No. When I worked at the big hulking winery in the mid-2000s, executive assistants who had been there for 35 years told me that the senior executives and owners used to say wildly inappropriate things to them, and kiss and grope them while they were trying to work. Although these women tried (literally) to run away from these predators, this mistreatment was acceptable behavior and the women’s silence was the only way to maintain employment.</p> <p> </p> <p>I’m not excusing the behavior, but maybe this legacy means we need to take a historical view to understand the issues. Wine in the United States is an old school industry. Its very structure is based on something that was set up in 1933 after Congress’s failed attempt to ban alcohol through a constitutional amendment. Doubting the public could handle itself properly, Congress encouraged states to set up roadblocks and a three-tier system that treats adults as children with choices made for them about what, when, and how they can buy wine, gives certain huge producers and distributors power over markets, and in certain states, despite Supreme Court rulings, denies citizens the ability to procure the wines they prefer to drink.</p> <p> </p> <p>Further, for those in the industry, if you don’t drink copious amounts with your customers and co-workers, and if you are a woman not willing to be a good old boy and listen to piggish talk and smoke cigars, you’re a pariah. It’s an industry based on power in the hands of the few (like many industries).</p> <p> </p> <p>The deification of sommeliers, who completely disconnect with the very people they are supposed to serve in pursuit of a title that will give them power, is another outgrowth of this. The conclusion: the wine industry is based on other people who apparently know better than you (whomever <em>you</em> are), making decisions for you that you may or may not agree with. The recent scandals prove that little has changed since the incidents of the “Mad Men” era the women at the big winery told me about. And as more women have entered the industry, the opportunities for this kind of behavior have just multiplied.  Sexism in the wine industry is a subtle symphony of quiet misogyny.</p> <p> </p> <p> </p> <p>As for me, I can’t count the number of times I have been ignored when I am in a group of industry men talking about wine. I am usually invisible to them and generally have no value. When I am with MC Ice in a setting that is not for podcast fans and listeners, men ask <em>him</em> the questions about wine even after he tells them what I do. And although I was too old and not cute enough to be a candidate for sexual harassment when I entered wine (I’m not sad about this, don’t worry!), the invisibility factor and belittlement factor was high with my male colleagues and bosses.</p> <p> </p> <p>Women in high positions in wine are also guilty of this type of behavior – ignoring those they feel are unimportant or who lack status (men and women at conferences will ignore me until someone else tells them my audience is large and then there’s huge interest on their part, huge disgust on mine). Plenty of women in wine are just about self-preservation. In fact, <a href= \"https://www.jancisrobinson.com/articles/women-and-wine-tipping-point\"> an article by Jancis Robinson is nothing short of a “there’s nothing to see here” rant about how the younger generation has social media to make “a fuss” as she puts it</a>. She argues that change should come for the economic viability of the wine industry, not for the absolute immorality of the acts of misogyny and inequality. I fear that her stance and that of those who support her show us that many women of the old guard are equally at fault for ignoring what goes on in the real world with normal wine people, AKA, the unwashed masses.</p> <p> </p> <p> </p> <p>Part II: The Solution -- No, it’s not more women’s only groups or women’s scholarships</p> <p>I don’t really consider myself part of the industry -- I chose to blaze my own path and work with what I consider to be the best sides of wine – producers and wine drinkers – and abandon the business for the very reasons I just described. Because of that I often stay out of these debates. But this is one that I need to discuss. Because like everything else in wine, the issue has been framed in a way that just doesn’t work and won’t bring structural change.</p> <p> </p> <p>So now I’d like to talk about the fix. Because the fix is not letting the men and women with stale ideas in the wine industry and financial interest steer this ship. And this is what is happening now. The wine industry LOVES to take the issue of the day, elevate it, and sweep it under the rug, or marginalize it so it becomes a splinter group. That’s what I see happening now: <em>women’s initiatives! Let’s create a group to forward the cause of Women in Wine! Let’s make it so that women get promoted and we have our own safe space! Let’s give scholarships to women!</em></p> <p> </p> <p>This tack lacks imagination and accomplishes nothing: We’ve already done this and it doesn’t work. The large corporations become sponsors of these “women-first” organizations so the problems they themselves create in the industry can’t be discussed in an open forum. Further, often the events are too costly and in places where the people who would benefit most can’t afford to get to (Napa and New York ain’t cheap). And frankly, once these organizations are off the ground, the women form their own in-crowd and never reach the people who may need the most help; Think of the young woman starting out in wine in Alabama who may be getting harassed but has nowhere to turn, or the sommelier in Omaha who has been told she can’t advance because men won’t take her seriously at a steakhouse. The elite women’s groups and scholarships for the few lucky enough to get them do nothing to help the majority of women.</p> <p> </p> <p>And while I applaud the people who are trying to lift up other women (unlike many in the old guard who feel they need to keep rising stars down to maintain their own status), we do not and cannot operate in a bubble. These organizations that are supporting women need to take a hard look at how to make change. The only way to make this work is to enlist male allies; not to cloister off in group of women who believe what you believe. Men and women must work together to create a productive solution that doesn’t make this problem a “women’s issue,” thus giving these predators and subtle sexists the power to make the situation an “us” vs. “them” issue.</p> <p> </p> <p>The organizations for women are already funded and organized, but now it’s time for them to move beyond talk and into action. They should take a page from the LGBTQ community: <a href= \"https://pflag.org/\">PFLAG</a> could serve as a great model – chapters exist all over the US to help people work together to understand the issues, foster acceptance, and create safer and more inclusive communities for people of the LGBTQ community. This volunteer chapter structure allows dialog, understanding, and true change and it is not dependent on how much money you have or whether or not you can pay $1,000 for a weekend conference in New York or Napa. With well-known, funded, publicized, and gender inclusive chapters change can happen in any community where women and decent, good men are willing to work to solve the problems in wine.</p> <p> </p> <p>Women are hurt and outraged but they should heed the warning: it is never right to close ranks and push people to the margins who want to help and who are willing, during our darkest times, to stand up for us and with us to help fight the darker elements of sexism. This is not a “women’s issue.” This is a cultural change that must happen in the wine industry and it can’t be done with scholarships and conferences of women alone. It must be a joint effort from everyone who is willing to be educated and to advocate for fairness.</p> <p> </p> <p>Until we address the problem and come up with an innovative, inclusive solution, the engine of sexism and discrimination will continue in wine, stifling creativity, destroying the self-esteem of outstanding people, and holding the entire wine industry back from progress it deserves. </p> <p> _______________________________________________</p> <p>Thanks to our sponsors this week:</p> <p><a href=\"http://www.wineaccess.com/normal\" target=\"_blank\" rel= \"noopener\">Wine Access </a><a href= \"http://www.wineaccess.com/normal\"></a></p> <p><em>Visit: <a href=\"http://www.wineaccess.com/normal\" target= \"_blank\" rel=\"noopener\">www.wineaccess.com/normal</a> and for a limited time get $20 off your first order of $50 or more! </em></p> <p>I’m so excited to introduce <a href= \"http://www.wineaccess.com/normal\">Wine Access</a> to you. <a href= \"http://www.wineaccess.com/normal\">Wine Access</a> is a web site that has exclusive wines that overdeliver for the price (of which they have a range). </p> <ul> <li>They offer top quality wines by selecting diverse, interesting, quality bottles you may not have access to at local shops.</li> <li><a href=\"http://www.wineaccess.com/normal\" target=\"_blank\" rel= \"noopener\">Wine Access</a> provides extensive tasting notes, stories about the wine and a really cool bottle hanger with pairings, flavor profile, and serving temps.</li> <li>Wines are warehoused in perfect conditions and shipped in temperature safe packs. Satisfaction is guaranteed! </li> </ul> <p>Check it out today! <em><a href= \"http://www.wineaccess.com/normal\" target=\"_blank\" rel= \"noopener\">www.wineaccess.com/normal</a> </em></p> <p> </p> <p><a href= \"https://www.patreon.com/winefornormalpeople\"></a>Thanks to YOU! The podcast supporters on Patreon, who are helping us to make the podcast possible and who we give goodies in return for their help! Check it out today: <a href= \"https://www.patreon.com/winefornormalpeople\">https://www.patreon.com/winefornormalpeople</a></p> <p> </p> <p>And to sign up for classes (now for UK and Euro time zones!) please go to <a href= \"http://www.winefornormalpeople.com/classes!\">www.winefornormalpeople.com/classes!</a> </p>",
  "enclosure": "",
  "itunes:duration": "43:18",
  "itunes:explicit": false,
  "itunes:keywords": "women,wine,sexism",
  "itunes:subtitle": "This is a transcript of the first part of the podcast. The second part of the show discusses these points in more detail.    Women in Wine and the Subtle Symphony of Quiet Misogyny After mulling over the various scandals in wine lately, and...",
  "itunes:episode": 353,
  "itunes:episodeType": "full",
  "itunes:author": "Wine for Normal People"
}