{
  "title": "S15 Ep14: Haunting in the Heartland",
  "link": "https://audioboom.com/posts/8098509",
  "itunes:episode": 14,
  "itunes:title": "Haunting in the Heartland",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5100,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio is in the heat of a Haunting in the Heartland today with guest Steve Shippy star of the new Travel Channel Series by the same name,<br>\n<br>\nWhy do so many communities across America have stories of unexplained paranormal experiences that, through word-of-mouth and consistency, turn into lore? In the new Travel Channel series, “Haunting in the Heartland,” premiering on Friday, February 21 at 10 p.m. ET/PT, paranormal investigator and documentary filmmaker Steve Shippy visits Midwestern towns that have been traumatized for generations by ripples of fear. <br>\n<br>\nLook Here for more Info: <a href=\"https://www.travelchannel.com/shows/haunting-in-the-heartland\">https://www.travelchannel.com/shows/haunting-in-the-heartland</a><br>\n<br>\nVisit our shop for exciting new items, clothes, books and more: <a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping. <br>\n<br>\nIf your resolution is to get fit this year, start by getting socks that can keep up, every step of the way. Bombas can help with performance socks in styles made specially for basketball, tennis, running, golf, and more...  Go to <a href=\"http://BOMBAS.com/darkness\">BOMBAS.com/darkness</a> TODAY, and get twenty percent off your first purchase.",
  "itunes:summary": "Darkness Radio is in the heat of a Haunting in the Heartland today with guest Steve Shippy star of the new Travel Channel Series by the same name,\n\nWhy do so many communities across America have stories of unexplained paranormal experiences...",
  "pubDate": "Sun, 16 Feb 2020 10:00:00 +0000",
  "guid": "5ea17e89-a937-423f-8a0e-fe3f3aacf7fd",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}