{
  "title": "Laura McLean, Suvani Suri, Thomas Smith, Aasma Tulika and Shareeka Helaluddin: Capture All",
  "itunes:author": "Liquid Architecture",
  "itunes:subtitle": "",
  "itunes:summary": "How can sound and listening be mobilised for understanding questions of power, capture, and extraction under networked capitalism and data colonialism?\n\nCapture All is a multiyear collaboration between Liquid Architecture and Sarai, featuring artists, scholars, and writers based in India and Australia contributing to a series of critical intensives and dialogues, public programs and publications.\n\nCapture All curator Laura McLean and artists, Suvani Suri, Thomas Smith, Aasma Tulika, and Shareeka Helaluddin talk through the works developed through Capture All in relation to cross-cultural exchange, scale, and technologies as well as reflecting on the shared experience and learnings that took place.\n\nThis project is contextualised by Sarai’s pioneering work on media and information, urbanism, infrastructure, media archaeology, data and law, the commons, and the public domain in South Asia, and in Liquid Architecture’s ongoing research projects, including ‘Machine Listening’, a constantly evolving platform investigating the effects of algorithmic, machinic, networked and technologised listening on our social and political lives.\n\nLed by research curators Laura McLean (Liquid Architecture) and Mehak Sawhney (Sarai), Capture All considers Australia and India’s complex relationships to coloniality and extraction across physical and digital spaces. \n\nA Capture All digital collection has been published in Liquid Architecture’s online journal Disclaimer featuring works from Tom Smith, Shareeka Helaluddin, Uzma Falak, Aasma Tulika, and Suvani Suri. \n\nhttps://disclaimer.org.au/contents/capture-all\n\nProduced by Mara Schwerdtfeger. \n\nFinancial support from patrons at any level has a resounding impact on our work. You can support Liquid Architecture’s weekly podcast and our online journal Disclaimer, for new thinking and writing on listening and sound through a Patreon subscription, for as little as $5 a month. \n\nhttps://www.patreon.com/liquidarchitecture\n\nFor the past 20 years, Liquid Architecture has been Australia’s leading organisation for artists working with sound and listening. LA investigates the sounds themselves, but also the ideas communicated about, and the meaning of, sound and listening.\n\nhttps://liquidarchitecture.org.au/",
  "itunes:image": "",
  "enclosure": "",
  "guid": "https://liquidarchitecture.org.au/podcast/laura-mclean-suvani-suri-thomas-smith-aasma-tulika-and-shareeka-helaluddin-capture-all",
  "pubDate": "Tue, 30 Aug 2022 08:00:00 +1000",
  "itunes:duration": "50:59",
  "itunes:explicit": "no"
}