{
  "title": "Email is 50 years old, and still where it’s @",
  "link": "https://blog.google/products/gmail/email-is-50-years-old-and-still-where-its/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>50 years ago this month, Ray Tomlinson sent the very first email. He was a programmer working on ARPANET, the system that laid the groundwork for what would become the internet as we know it today. He tested the messaging system by sending emails to himself, and later said that the first note was probably something like “QWERTYUIOP.”</p><p>More than 30 years after this breakthrough, a Google engineer named Paul Buchheit conducted his own email experiments. In a 2005 <a href=\"https://googleblog.blogspot.com/2005/10/guess-what-just-turned-34.html\">blog post</a>, Paul described the problem he was trying to solve:</p><p>“My email was a mess. Important messages were hopelessly buried, and conversations were a jumble…I couldn't always get to my email because it was stuck on one computer, and web interfaces were unbearably clunky. And I had spam. A lot of it.” These pain points are part of what motivated Paul to come up with a better system — Gmail.</p><p>Buchheit created Gmail as a browser-based email program that allowed users to easily search their own messages. “With Gmail, I got the opportunity to change email — to build something that would work for me, not against me.” He wasn’t sure what the reception would be like, but when he released a beta to fellow Googlers, they wanted more.</p><p>Eventually, Gmail <a href=\"http://googlepress.blogspot.com/2004/04/google-gets-message-launches-gmail.html\">launched to the public on April 1, 2004</a>. Its search function was lightning fast and it came with 1 GB of storage — 500 times more than prevailing inboxes of the time. But that wasn’t enough to convince people it wasn’t a joke. (The date — <a href=\"https://www.washingtonpost.com/history/2019/04/01/when-google-first-announced-gmail-it-was-brushed-off-an-april-fools-day-joke/\">April Fool’s Day</a> — likely had something to do with it.)</p><p>Despite the launch day hijinks, Gmail won consumers over, and became a central part of the work we do at Google. But we never could have done it if Ray Tomlinson hadn’t hit that @ sign and started it all 50 years ago. To celebrate, we asked a few Googlers to share their favorite Gmail hacks.</p><p><b>Laura Mae Martin, Executive Productivity Advisor</b></p><p>“It's hard to answer old emails when there are shiny new ones coming in. Use features like <a href=\"https://support.google.com/mail/answer/7622010?co=GENIE.Platform%3DDesktop&amp;hl=en\">Snooze</a> and <a href=\"https://support.google.com/mail/answer/5904?co=GENIE.Platform%3DDesktop&amp;hl=en\">Starred</a> emails and <a href=\"https://support.google.com/mail/answer/9694882?hl=en\">different inbox setups</a> to make it easier to stay on task.”</p><p><b>John Shriver-Blake, Senior Product Manager, Gmail Enterprise</b></p><p>“I’m a fan of <a href=\"https://support.google.com/mail/answer/7674059\">confidential mode</a> in Gmail. It lets you protect sensitive information in messages and attachments and ensures that whoever receives the confidential email can’t forward, copy or print it.”</p><p><b>Neena Kamath, Product Lead, Gmail</b></p><p>\"What I love about Gmail is how it's evolved over the years. Fifteen years ago, I was obsessed with Conversation View! Back then, having all your emails about a single topic in one place hadn't been done before, and it saved me so much time. Now, I'm obsessed with <a href=\"https://support.google.com/a/users/answer/9308680?hl=en&amp;co=GENIE.Platform%3DAndroid\">Smart Reply</a>. It not only saves me time, but also makes me more polite : )!\"</p><p><b>Bao Lam, Head of Marketing, Gmail &amp; Chat</b></p><p>“<a href=\"https://support.google.com/a/users/answer/9395629?hl=en\">Schedule send</a> in Gmail means that I don’t clutter up people’s inboxes if I’m catching up on emails at odd moments — which is especially helpful when so many of us are working across different time zones.”</p><p>You can learn more about the <a href=\"https://cloud.google.com/blog/products/workspace/celebrating-50-years-of-email\">history of email, Gmail and the power of the @ sign</a> over on the Cloud blog.</p></div></div></body></html>",
  "pubDate": "Fri, 29 Oct 2021 16:08:00 +0000",
  "guid": "https://blog.google/products/gmail/email-is-50-years-old-and-still-where-its/",
  "category": [
    "Google Workspace",
    "Gmail"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Email is 50 years old, and still where it’s @",
    "description": "We're celebrating 50 years of email with a few tips and tricks from our Gmail team.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/email.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://blog.google/products/gmail/email-is-50-years-old-and-still-where-its/"
  },
  "author": {
    "name": "Dominic Smith",
    "title": "Content Lead",
    "department": "Google Workspace",
    "company": ""
  }
}