{
  "title": "543: Harry Potter Reunion Special Preview, More 'Secrets of Dumbledore' Trailer Analysis, Year in Review",
  "link": "https://audioboom.com/posts/8000876",
  "itunes:episode": 543,
  "itunes:title": "Harry Potter Reunion Special Preview, More 'Secrets of Dumbledore' Trailer Analysis, Year in Review",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3881,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode, we preview the forthcoming Harry Potter Reunion Special, dive deeper into The Secrets of Dumbledore trailer, take listener feedback on just what in the world Jacob is doing with a wand and look ahead to 2022! Plus, a bonus MuggleCast you won't want to miss - just what goes down at a Hogwarts Holiday staff party!<br>\n<br>\n\n</div>\n<ul>\n<li>Another year, gone (in your best Dumbledore voice)!</li>\n<li>We discuss the upcoming Harry Potter Reunion Special. The trailer was supposed to be released last week prior to our recording, but never appeared. It was eventually <a href=\"https://www.youtube.com/watch?v=fFGS4zZWGoA&ab_channel=HBOMax\">released</a> Monday, December 20th.</li>\n<li>Rumors abound about a member of the trio not being present for the reunion!</li>\n<li>Don't forget, we'll be recording our first MuggleCast of 2022 following the airing of the reunion on HBO MAX!</li>\n<li>We return to analyzing The Secrets of Dumbledore Trailer now that we've had more time with it</li>\n<li>Look close... can you see Ariana?</li>\n<li>Dumbledore is in New York City! What brings him there?</li>\n<li>Could the portkey in the Room of Requirement be a Tibetan Prayer Wheel?</li>\n<li>Rise Great Avenger! Laura calls out some very watery phoenix imagery behind the title card!</li>\n<li>Listener feedback covers all things Jacob!</li>\n<li>Did Dumbledore enchant Jacob's want to work only in times of need?</li>\n<li>Was Jacob expelled from Ilvermorny? Could he be a late bloomer?</li>\n<li>Does Jacob get a wand because, well, it would just be too dangerous for him NOT to have one?</li>\n<li>Could Credence hold the secret to destroying the blood pact?</li>\n<li>What do we have to look forward to in the wizarding world in 2022?</li>\n<li>Quizzitch: What is the street address for Weasley’s Wizard Wheezes in the books? <a href=\"https://mugglecast.com/quizzitch/\">Submit your answer</a>! </li>\n<li>This week's episode is brought to you by BetterHelp (get 10% off your first month at <a href=\"http://www.betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a>)!</li>\n<li>Coming up on Bonus MuggleCast later this week (<a href=\"http://www.patreon.com/mugglecast\">available on Patreon</a>), the hosts discuss just what goes down at a Hogwarts Holiday Staff Party (Warning: This might not be suitable for younger audiences)!</li>\n</ul>\n",
  "pubDate": "Tue, 21 Dec 2021 10:00:00 +0000",
  "guid": "tag:audioboom.com,2021-12-20:/posts/8000876",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}