{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-8933985999587683917",
  "published": "2020-04-23T09:00:00.000-07:00",
  "updated": "2020-04-27T16:38:48.159-07:00",
  "title": "Observing Ramadan at home",
  "content": "The month of Ramadan begins today, with millions around the world beginning a time of reflection, fasting and prayer that will feel very different than in years past, as faith communities find new ways to celebrate safely in order to reduce the spread of COVID-19 within their communities. <br /><br />During these difficult times, it’s incredibly important for us to continue to connect with each other and feel part of our wider communities, even from home. Community is an important part of Ramadan, and Muslims around the world are going online to share and celebrate safely while staying at home. <br /><br />To assist faith organizations everywhere who may be new to online services, YouTube has brought together helpful information to get started with live streaming. Please visit our <a href=\"https://www.youtube.com/playlist?list=PLpjK416fmKwSJ5EvkT9th8mmz_p8x1ReL\" target=\"_blank\">Playlist</a> and <a href=\"https://support.google.com/youtube/topic/9257891?hl=en&amp;ref_topic=9257610\" target=\"_blank\">Help Center</a> for best practices, or check out instructions for hosting a live stream event either from a <a href=\"https://www.youtube.com/watch?v=V2nFR-nxUCo\" target=\"_blank\">mobile device</a> or <a href=\"https://www.youtube.com/watch?v=Ok3qM3ecWJU\" target=\"_blank\">desktop</a>.  <br /><br />YouTube will also be home to a wide range of Ramadan content over the coming weeks. From sahur (pre-dawn meal) and iftar (breaking of fast) activities, to faithful fashion to live streams of religious ceremonies, please visit our <a href=\"https://www.youtube.com/stayhome\" target=\"_blank\">Stay Home #WithMe</a> and <a href=\"https://www.youtube.com/user/YouTubeArabia\" target=\"_blank\">YouTube Arabia</a> channels for the latest.  <br /><br /><h3>Upcoming highlights: </h3><br /><br /><ul><li>Daily prayer services from Mecca and Madinah are live streamed from both <a href=\"https://www.youtube.com/user/SaudiQuranTv/featured\" target=\"_blank\">SaudiQuranTV</a> and <a href=\"https://www.youtube.com/channel/UC_ANPr8IkWibKlKhmi_-H1g\" target=\"_blank\">haraiminfo</a>. </li></ul><br /><br /><br /><ul><li>Major Indonesian TV networks <a href=\"https://www.youtube.com/channel/UC24_Z2L-8Ki183AI9zJJzNQ\" target=\"_blank\">TRANS7</a> and <a href=\"https://www.youtube.com/user/metrotvnews\" target=\"_blank\">MetroTV</a> will launch a series of shows and news segments throughout Ramadan, focusing on entertaining, informing, and educating viewers on Ramadan topics from breakfasting, sahur, family life, and looking after the needy during this challenging time. Music label  <a href=\"https://www.youtube.com/channel/UCE0laCY30f_ky80J0BxD3dA\" target=\"_blank\">3D Entertainment</a> recently released <a href=\"https://www.youtube.com/watch?v=JbGPGr_Y9hU\" target=\"_blank\">Ramadan Berkah</a> to celebrate the Holy Month, while <a href=\"https://www.youtube.com/channel/UChvdpkJqIaVo7kbKPtmKXhA\" target=\"_blank\">NAGASWARA</a> will publish ten episodes of Ramadan acoustic music sessions.  </li></ul><br /><br /><br /><ul><li>In Singapore, <a href=\"https://www.youtube.com/c/MuslimSg\" target=\"_blank\">Muslim.Sg</a> is producing many videos that you can binge-watch in the comfort of your home: a weekly talk show with Asatizah Youth Network, a video where religious teachers answer the most Googled questions on Ramadan and a moving short film about celebrating Hari Raya (Eid) amidst the COVID-19 pandemic. </li></ul><br /><br /><br /><ul><li><a href=\"https://www.youtube.com/user/tvjakim\" target=\"_blank\">JAKIM</a>, Malaysia’s Department of Islamic Development, is planning to use their YouTube channel to launch daily live streams of Quran reading sessions, talk shows featuring religious leaders in Malaysia, and tutorials on how to perform Ramadan rituals.  </li></ul><br /><br /><br /><ul><li><a href=\"https://www.youtube.com/channel/UCMT3W4oP94ZxbY9jPu8DQZg\" target=\"_blank\">Aysha Harun</a>, an LA-based hijabi fashion and beauty vlogger, will kick off the third year of her annual Ramadan Daily series, giving viewers a glimpse into her everyday life with family and iftar preparations. </li></ul><br /><br /><br /><ul><li><a href=\"https://www.youtube.com/channel/UC5xAPCVizxOfnMECMXkal2Q\" target=\"_blank\">Baim Wong</a>, a famous actor in Indonesia and his wife Paula, are joining other Muslim families on YouTube in Indonesia to share daily content around their sahur, iftar, and other family activities while they #StayHome. As part of GEMAS (Gerakan Memakai Masker), a nationwide initiative that Baim Wong founded to provide 30 million free masks for the underprivileged in Indonesia, Baim Wong will also release content on how people from different regions in Indonesia are helping each other during this difficult time.  </li></ul><br /><br /><br /><ul><li><a href=\"https://www.youtube.com/user/thesaudireporters\" target=\"_blank\">The Saudi Reporters</a> are one of the oldest and most successful creators in Saudi Arabia. From sketches and competitions, to comedy series and vlogs, they make millions across the Arab world laugh with them through their videos. This year they will be releasing the second season of their animation series Boody and Zozo.  </li></ul><br /><br /><br /><ul><li><a href=\"https://www.youtube.com/dinatokio\" target=\"_blank\">Dina Tokio</a> is a UK stylist who began vlogging while working in a call centre. Today, she has her own clothing line and is one of the most high profile modest fashion influencers in the world. As a proud member of the Muslim community, Dina will be posting Ramavlogs as often possible during the month, including plans to host a live iftar once a week on YouTube with her husband Sid.  </li></ul><br /><br /><br /><ul><li>Turkish chef, TV presenter, and food columnist, <a href=\"https://www.youtube.com/user/refikaninmutfagi\" target=\"_blank\">Refika Birgül</a>, is planning a number of videos focused on Ramadan, for both her <a href=\"https://www.youtube.com/user/refikaninmutfagi\" target=\"_blank\">Turkish</a> and <a href=\"https://www.youtube.com/user/refikaskitchen\" target=\"_blank\">English</a> channels, including how to set the dream iftar table, a Ramadan recipe series, and much more.  </li></ul><br /><br /><br /><ul><li>Anas and Asala, known as the <a href=\"https://www.youtube.com/channel/UCqJNTGwKmgMCwfYDbnz514Q\" target=\"_blank\">Anasala Family</a>, are a young Syrian couple, living in Canada, who vlog about daily life as Arabs in the Western world. This Ramadan they will be releasing a series of videos about what it’s like observing Ramadan while under quarantine.  </li></ul><br /><br />We wish safe and healthy holidays for faith communities across the world. <br /><br /><i>— The YouTube Team  </i>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}