{
  "title": "Alexander Mikaberidze interview about Napoleonic military history book &#8220;The Napoleonic Wars&#8221; (Oxford University Press, 2020)",
  "link": "http://warscholar.org/napoleonic-military-history-book-the-napoleonic-wars-oxford-university-press-2020-alex-mikaberidze-interview/",
  "pubDate": "Thu, 30 Jul 2020 00:51:18 +0000",
  "guid": "http://warscholar.org/?p=1576",
  "comments": "http://warscholar.org/napoleonic-military-history-book-the-napoleonic-wars-oxford-university-press-2020-alex-mikaberidze-interview/#respond",
  "wfw:commentRss": "http://warscholar.org/napoleonic-military-history-book-the-napoleonic-wars-oxford-university-press-2020-alex-mikaberidze-interview/feed/",
  "slash:comments": 0,
  "category": [
    "All Gunpowder War",
    "All Napoleon",
    "19th century war",
    "academic",
    "audio interviews",
    "author",
    "books",
    "Britain",
    "france",
    "germany",
    "Napoleonic Wars",
    "Oxford University Press",
    "podcast",
    "Russia"
  ],
  "description": "Alex Mikaberidze Napoleonic Wars Interview Interview Summary Check out this book here   https://amzn.to/308FVxH Alex Mikaberidze has been studying and writing on the Napoleonic Wars and Middle Eastern history for many years. He recently completed a ten year project writing on the global impact of the Napoleonic wars. We spoke about the Napoleonic wars, Napoleon, the…",
  "enclosure": "",
  "itunes:subtitle": "Alex Mikaberidze Napoleonic Wars Interview Interview Summary Check out this book here   https://amzn.to/308FVxH Alex Mikaberidze has been studying and writing on the Napoleonic Wars and Middle Eastern history for many years.",
  "itunes:summary": "Alex Mikaberidze Napoleonic Wars Interview<br />\nInterview Summary<br />\n<a href=\"https://amzn.to/308FVxH\">Check out this book here</a>   <a href=\"https://amzn.to/308FVxH\">https://amzn.to/308FVxH</a><br />\nAlex Mikaberidze has been studying and writing on the Napoleonic Wars and Middle Eastern history for many years. He recently completed a ten year project writing on the global impact of the Napoleonic wars. We spoke about the Napoleonic wars, Napoleon, the War of 1812, and the process of writing the book.<br />\n(THE AUDIO PLAYER IS AT THE BOTTOM OF THE POST.)<br />\n0:43 &#8211; Alex talks about how he became interested in the Napoleonic Wars.<br />\n2:32 &#8211; Alex talks about the languages he knows and its applications to this research.<br />\n3:33 &#8211; Alex talks about how his history of the Napoleonic Wars is different from other books on the subject.<br />\n9:07 &#8211; Alex talks about the various impacts of the Napoleonic Wars.<br />\n12:45 &#8211; Alex talks about the economics of the Napoleonic Wars.<br />\n16:58 &#8211; Alex talks about the importance of Napoleon in everything that happened in this period.<br />\n20:45 &#8211; Alex talks about why Napoleon made himself Emperor and what effects that had.<br />\n25:56 &#8211; Alex talks about how some Russians were happy that Napoleon made himself an Emperor.<br />\n27:06 &#8211; Alex talks about Napoleon not being a warmonger and his immense intellectual curiosity.<br />\n29:38 &#8211; Alex talks about Napoleon being a micro-manager.<br />\n32:46 &#8211; Alex talks about why the Russians did not surrender to Napoleon when he took Moscow.<br />\n38:41 &#8211; Alex discusses what might have happened if Napoleon had abolished serfdom in Russia.<br />\n39:31 &#8211; Alex talks about the military changes engendered by the Napoleonic Wars.<br />\n41:24 &#8211; Alex talks about changes in the Ottoman military.<br />\n43:22 &#8211; Alex talks about changes in the Iranian military.<br />\n45: &#8211; Alex talks about the political changes caused by the Napoleonic Wars especially with Spain and its colonies.<br />\n49:16 &#8211; Alex talks about what countries gained the most and lost the most from the Napoleonic Wars.<br />\n51:49 &#8211; Alex talks about British wins in India and Africa due to the wars. He discusses the rise of Russian power after the Napoleonic Wars.<br />\n54:58 &#8211; Alex talks about how badly France, Spain, and Portugal ended up after the wars.<br />\n56:49 &#8211; Alex talks about how he did his research and the main archives her used.<br />\n58:20 &#8211; Alex talks about the places he visited for his research.<br />\n1:01:00 &#8211; Alex talks about the tug of war between modernization and tradition during the Napoleonic Wars.<br />\n1:03:28 &#8211; Alex talks about Napoleon&#8217;s refusal to make a compromise deal in 1813.<br />\n1:05:51 &#8211; Alex about the writing and publishing process.<br />\n1:09:57 &#8211; Alex talks about research into the Louisiana Purchase and American and Russian competition in western North America.<br />\n1:14:33 &#8211; Alex can be found on facebook and on the Louisiana State University Shreveport website.<br />\nLinks of interest<br />\n<a href=\"https://amzn.to/308FVxH\">https://amzn.to/308FVxH</a><br />\n<a href=\"https://www.lsus.edu/alexander-mikaberidze\">https://www.lsus.edu/alexander-mikaberidze</a><br />\nContact Information<br />\nFor more “Military History Inside Out” please follow me at <a href=\"http://www.warscholar.org/\">www.warscholar.org</a>, on Facebook at <a href=\"https://www.facebook.com/Warscholarorg-Military-History-News-and-Education-115795938127/\">warscholar</a>, on twitter at <a href=\"https://twitter.com/Warscholar\">Warscholar</a>, on youtube at <a href=\"https://www.youtube.com/user/warscholar1945/\">warscholar1945</a> and on Instagram <a href=\"https://www.instagram.com/crisalvarezwarscholar/\">@crisalvarezswarscholar</a>. Or subscribe to the podcast on <a href=\"https://itunes.apple.",
  "itunes:author": "Cris Alvarez",
  "itunes:image": "",
  "itunes:duration": "1:17:08",
  "post-id": 1576
}