{
  "guid": "urn:uuid:04bbf394-74b5-4d7f-af89-5a7cd3a52d7a",
  "link": "https://www.who.int/news/item/18-10-2022-who-launches-new-campaign-to-amplify-the-lived-experience-of-people-affected-by-cancer",
  "a10:author": {
    "a10:name": ""
  },
  "title": "WHO launches new campaign to amplify the lived experience of people affected by cancer",
  "description": "WHO is launching the first global survey to better understand and address the needs of all those affected by cancer.",
  "pubDate": "Mon, 17 Oct 2022 13:47:03 Z",
  "a10:content": "<p>Today, WHO is launching the first <a href=\"https://extranet.who.int/dataformv3/index.php/933528?lang=en\">global survey</a> to better understand and address the needs of all those affected by cancer. The survey is part of a broader campaign, designed with and intended to amplify the voices of those\n    affected by cancer &ndash; survivors, caregivers and the bereaved &ndash; as part of WHO&rsquo;s Framework for Meaningful Engagement of People Living with Noncommunicable diseases (PLWNCDs). This Framework is a commitment to respectfully and meaningfully\n    engage PLWNCDs in co-designing policies, programmes, and solutions. The survey results will feed into the design of policies and programmes to offer better well-being in the context of a cancer diagnosis and co-create solutions for the future.</p><p>Nearly every family globally is affected by cancer, either directly &ndash; 1 in 5 people are diagnosed with cancer during their lifetime &ndash; or as caregivers or family-members. A cancer diagnosis triggers a broad and profound effect on the health\n    and well-being of all those involved. &ldquo;For too long, the focus in cancer control has been on clinical care and not on the broader needs of people affected by cancer,&rdquo; said Dr Tedros Adhanom Ghebreyesus, Director-General of the World Health\n    Organization. &ldquo;Global cancer policies must be shaped by more than data and scientific research, to include the voices and insight of people impacted by the disease.\"</p><p>Recent studies have shown that nearly half of people diagnosed with cancer experience anxiety and loss of faith and may be abandoned by their intimate partners. In low- and middle-income countries, financial hardship and loss of assets can be experienced\n    by 70% or more of those affected. &ldquo;When my daughter was diagnosed with cancer, our lives changed drastically and in ways that we did not expect. The effects of cancer last a lifetime,&rdquo; said Ruth Hoffman, President of the American Childhood\n    Cancer Organization.</p><p>Understanding and amplifying the lived experiences of people affected by cancer can create more effective and supportive systems. Yet, the needs and preferences of people with cancer and their caregivers remain unknown to many providers and policy-makers.\n    &ldquo;We are making a long-term commitment to place people affected by cancer properly at the center of the agenda, to co-create better solutions&rdquo; explained Dr Bente Mikkelsen, Director of the Department of Noncommunicable Diseases at WHO.\n    &ldquo;This campaign will include four phases: releasing the global survey, hosting national consultations, presenting best practices and implementing community-led initiatives. We are ready to open a new chapter and improve the well-being of people\n    affected by cancer.&rdquo;</p><p>The ambition of the global survey is to reach more than 100&nbsp;000 responders from 100 countries, a majority of whom live in low- and middle-income countries. The survey results are expected in early 2023 and, thereafter, used to shape policies, programmes\n    and services for people affected by cancer globally.</p><div class=\"button button-dark-border\"><a href=\"https://extranet.who.int/dataformv3/index.php/933528?lang=en\">Take the global survey</a></div><p>&nbsp;</p>"
}