{
  "title": "S1E54 - Always be Ready to Pivot with Olympic Silver Medalist Lauren Gibbs",
  "guid": "https://pinecast.com/guid/7ce68a80-49c2-44bd-ab1b-9d69f3da9628",
  "pubDate": "Thu, 03 Feb 2022 07:30:00 -0000",
  "itunes:duration": "00:43:23",
  "description": "<p>With the Winter Olympic Games upon us, it's perfectly fitting to bring Lauren Gibbs back on the show. If you haven't already heard Lauren's incredible journey from the corporate world to the Olympic podium in just three years while in her 30s, all you need to do is go back to Episode 6 - 'You're Never Too Old To Dream Big with Olympic Medalist' - and listen to her hilarious and wild journey into the world of bobsled. Throughout her career, she has made eight national teams, competed in 44 World Cups, and has won 17 World Cup medals, two World Championship medals, one of which was gold in 2020, and an Olympic medal in 2018. Today, Lauren provides an update on her incredible story.</p>\n<p>She picks up the story at the point where the pandemic began to derail training and sponsorships, and goes on to describe the mindset shift she went through and the value of always being ready to pivot. As always, Lauren is open, candid, and vulnerable, as she discusses not being chosen for the Olympic team a second time, the struggle of keeping a certain weight to compete, and how she became friends with her competitors. She also offers some great advice about learning how to tell your story to attract sponsors and supporters, and about different apps to help athletes on various stages of their journey. Lauren finishes up by giving us a rundown of athletes to keep an eye out for at the Winter Games, and an update on what she is up to these days, especially her work with Heroic. A remarkable woman with an equally remarkable story to share, Lauren Gibbs demonstrates once again here today that she is a talented, resilient, and inspiring individual from whom we can all learn so very much about both sport and life in general.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Lauren Gibb's astonishing career from age 30</li>\n<li>How she was affected by the pandemic</li>\n<li>Lauren's work with Kara Winger on Parity</li>\n<li>How she pivoted and supported herself with COVID and the Tokyo games being postponed</li>\n<li>Lauren's physical, emotional, and mental state</li>\n<li>Her advice and insight for aspiring athletes</li>\n<li>The value of sharing your story in your athletic career</li>\n<li>Her transformation from high school and college to now</li>\n<li>The difference between quitting and knowing when it's time to move on</li>\n<li>The uniqueness of bobsled and how Lauren navigated its complexity</li>\n<li>The adrenaline letdown after success</li>\n<li>Lauren's friendship and connection with Kaillee Humphries and Elana Meyers Taylor</li>\n<li>The competitive dynamics among women in the same team in sports</li>\n<li>The challenges women face in sports, particularly Olympics</li>\n<li>Insights on the upcoming Winter Sports and exciting newcomers</li>\n<li>Update on what Lauren is currently doing</li>\n<li>Details about Heroic and her work there</li>\n</ul>\n<p>Quotes:</p>\n<ul>\n<li>\"It's been tough to see people struggle. I've been very fortunate, but I enjoy life with other people. And so, to see people around you and people you don't know struggling is always hard. My heart goes out to anybody that's been adversely affected by the pandemic. That's a lot of people.\"</li>\n<li>\"Then, when the pandemic hit, everything went away. And it was a quick lesson to me on how quickly life can change and how you have to prepare for a pivot. So you always have to be ready for a pivot.\"</li>\n<li>\"Olympics was never my end goal when I started bobsled, which I think sounds probably crazy to most people.\"</li>\n<li>\"You have to figure out what your story is because everybody has a story that people can learn and grow from.\"</li>\n<li>\"People just want to know about real people. They want to know about your struggles, successes, and the weird things you do in your sport that people would never think of. So share as much as yourself as feels comfortable, but also remember, once you share it, you can't take it back. So really show up as yourself.\"</li>\n<li>\"Don't try and be this person you think everybody wants to see or hear from because no matter who you are, there's enough people in this world that your story will click with - the people that it needs to click with.\"</li>\n<li>\"As someone who's on the other side, I can't wait to help athletes that need help in their journey because people help me. So I think just realize that more people out there want to help you than you think. So you’ve got to share your story and figure out what you're all about.\"</li>\n<li>\"I was one of those people who were fairly good at a lot of things. And so, when things got difficult, I would just quit. And I've realized that quitting feels worse than failing. And I was always more afraid of failure than I was excited for success, that I would quit before I got there. I've learned that that's more dissatisfying because you don't really learn anything from just quitting.\"</li>\n<li>\"That conversation with my dad was such a gift. He wasn't telling me that the Olympics weren't worth my time or worthless. Basically, he was telling me that the Olympics don't define Lauren Gibbs. And it can be so easy for an athlete to feel defined by their successes or losses in a sport. That's unhealthy. That's not good. You should do it because you love it. \"</li>\n<li>\"You are not your sport; your sport is something that you do.\"</li>\n<li>\"If you're depending on this result to change how you feel about life or yourself, whether you get the result or not, it's not going to do it.\"</li>\n<li>\"That's how you become a leader at anything. You have a goal in mind, and you work towards that daily. It really focuses on the small wins and the daily activity and then having this great support system.\"</li>\n</ul>\n<p>Show Links</p>\n<p><a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold </a>Website\n<a href=\"https://www.amazon.com/Life-10-Meters-Lessons-Champion/dp/B096CQW2L7/ref=sr_1_3?crid=2AXVGI3HL987J&dchild=1&keywords=laura+wilkinson+life+at+10+meters&qid=1624113646&sprefix=Laura+Wilkinson%2Caps%2C227&sr=8-3\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a></p>\n<p>Laura's Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura's Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura's Facebook</a></p>\n<p>Lauren's Social Media:\n<a href=\"https://www.instagram.com/lagibbs84/\" rel=\"nofollow\">Lauren's Instagram</a>\n<a href=\"https://www.linkedin.com/in/lauren-gibbs/\" rel=\"nofollow\">Lauren's LinkedIn</a>\n<a href=\"https://www.heroic.us/\" rel=\"nofollow\">Heroic</a></p>",
  "itunes:title": "Always be Ready to Pivot with Olympic Silver Medalist Lauren Gibbs",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 54
}