{
  "title": "Serbian president warns of ‘hellish’ winter",
  "link": "https://www.rt.com/news/565903-europe-hell-winter-serbia/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565903-europe-hell-winter-serbia/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363e6082030277501735899.jpg\" /> Rising prices of electricity and gas portend a “hell of a winter” in the EU, according to Serbian President Aleksandar Vucic <br/><a href=\"https://www.rt.com/news/565903-europe-hell-winter-serbia/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Aleksandar Vucic pointed to rising electricity and gas prices in Europe with cold weather approaching</strong></p>\n            \n                        \n            <p>European countries are in for a <em>&ldquo;hell&rdquo;</em> of a winter due to the skyrocketing cost of energy, Serbian President Aleksandar Vucic said on Thursday. Meanwhile, the government in Belgrade has done its best to stockpile natural gas, in case the pipeline supplying the fuel, via Turkey, is sabotaged.</p>\n<p><strong></strong><em>&ldquo;Colder weather will start in five to seven days and then Europe will start to burn its gas reserves,&rdquo;</em> Vucic told reporters after observing military exercises at a range in eastern Serbia.</p>\n<p><strong></strong><em>&ldquo;Yesterday, the price of gas was $219 for 1,000 cubic meters and today it&rsquo;s $450,&rdquo; </em>Vucic added.<em> &ldquo;It&rsquo;s going to go up every day, because when the first batch starts leaving the stockpile and there is nothing to replenish it with, the price will rise.&rdquo;</em></p>\n<p><strong></strong>The Serbian president noted that this will also make electricity more expensive, pointing to a similar jump in price on the European spot market, which he said went from &euro;156 per megawatt-hour on Wednesday to &euro;240 on Thursday.&nbsp;</p>\n<blockquote>\n<p><em><strong>This will be a hell of a difficult winter.</strong></em></p>\n</blockquote>\n<p><strong></strong>Vucic insisted that Serbia itself is well prepared, having stockpiled 667 million cubic meters of gas at four facilities. The people of Serbia have no reason to worry, even if <a href=\"https://www.rt.com/russia/564609-trurkstream-gas-hub-peskov/\">something happens</a> to the TurkStream pipeline delivering natural gas from Russia, he said.&nbsp;</p>\n<p><strong></strong><a href=\"https://www.rt.com/business/565848-craters-discovered-nord-stream-blast/\"></a></p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636388812030273e3d6c29c5.jpg\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/business/565848-craters-discovered-nord-stream-blast/\">Craters discovered at Nord Stream blast site</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p><em>&ldquo;If they cut it tomorrow, or carry out a sabotage and play stupid again &ndash; even though it is known who&rsquo;s behind the Baltic blasts, but we all play stupid so as to not harm the country&rsquo;s interests &ndash; we would survive. I&rsquo;m not sure about others,&rdquo;</em> Vucic said, referring to the September explosions that damaged the Nord Stream pipelines.</p>\n<p>Moscow has blamed the UK for orchestrating the sabotage, which London has denied.</p>\n<p><strong></strong>Serbia is not a member of the EU and has not joined the bloc&rsquo;s sanctions against Moscow, despite the rising pressure from Brussels to do so.</p>\n<p><strong></strong>European gas futures were <a href=\"https://www.rt.com/business/565855-eu-gas-prices-soar/\">trading</a> between $1,333 and $1,405 per 1,000 cubic meters on Thursday, amid fears that the unusually warm weather will soon give way to more seasonal November temperatures.&nbsp;</p>\n<p><strong></strong>The flow of natural gas from Russia, which the EU long relied upon, has been <a href=\"https://www.rt.com/business/565723-russian-gas-supplies-west/\">disrupted</a> this year by a combination of factors. In addition to EU sanctions against Moscow over the conflict in Ukraine complicating payments, the Nord Stream pipelines were damaged by explosions in September. A pipeline through Poland stopped working in May due to counter-sanctions, while gas transit through Ukraine was stopped in October.&nbsp;</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 17:26:08 +0000",
  "dc:creator": "RT"
}