{
  "id": "https://bibleinoneyear.org/en/youth/174",
  "title": "Day 174: Three Keys to Great Friendships",
  "description": "Psalm 77:11-12,20, 1 Kings 11:34–39, Acts 15:22,36–40.  We see examples of relationships at their very best, but we also see examples of their frailty and failure  Through these examples and the teaching of the Bible we see three keys",
  "pubDate": "Wed, 23 Jun 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/174/?ignore",
  "itunes:duration": "14:16",
  "guid": "enyouth23062021-174",
  "length": 856.19,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 174: Three Keys to Great Friendships",
  "itunes:subtitle": "Psalm 77:11-12,20, 1 Kings 11:34–39, Acts 15:22,36–40.  We see examples of relationships at their very best, but we also see examples of their frailty and failure  Through these examples and the teaching of the Bible we see three keys",
  "itunes:summary": "A leading UK retail chain commissioned a survey by a team of psychologists into their key customer demographic: Millennials (those born between 1981 and the early 2000s, and also known as Generation Y). They interviewed 800 people. The results were so startling that they did not believe them. They interviewed another 800 and got the same results.\nThe results portrayed an alarming picture of an increasingly lonely and lost generation. More people live alone than at any other point in our recorded social history. On average, Millennials spend six-and-a-half hours a day on social media. Many who were interviewed considered work to be something they fitted in between social media and lunch! They found people had a very large number of ‘friends’ but an increasing sense of loneliness.\nThere is nothing wrong with social media, but it is no substitute for real, face-to-face friendships. We were created for friendship with God (Genesis 3:8) and with one another (2:18).\nMarriage is part of the solution to aloneness. Friendship, vital also in marriage, is a crucial part of the solution too. Jesus set an example of close friendship with men and women. He demonstrated that marriage is not the only solution to aloneness. In one respect, friendship is even more important than marriage. Marriage is temporary; friendship is eternal. ‘Friendship’, as C.S. Lewis writes, is the ‘crown of life and school of virtue’. Friendship multiplies joy and divides sorrow.\nThe Bible is very realistic. We see examples of relationships at their very best, but we also see examples of their frailty and failure. Through these examples and the teaching of the Bible we see three keys.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 174
}