{
  "id": "yt:video:13hCkUiu_mI",
  "yt:videoId": "13hCkUiu_mI",
  "yt:channelId": "UCP3alkHEJhoxTpy3iVON-lg",
  "title": "Field Theory Fundamentals in 20 Minutes!",
  "link": "",
  "author": {
    "name": "Physics with Elliot",
    "uri": "https://www.youtube.com/channel/UCP3alkHEJhoxTpy3iVON-lg"
  },
  "published": "2022-02-11T20:27:03+00:00",
  "updated": "2022-06-27T23:02:01+00:00",
  "media:group": {
    "media:title": "Field Theory Fundamentals in 20 Minutes!",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Field theory is the mathematical language that we use to describe the deepest theories of physics. I'll teach you the basics in about 20 minutes. Get the notes for free here: https://courses.physicswithelliot.com/notes-sign-up\n\nThe most fundamental laws of nature that human beings have understood---the standard model of particle physics and Einstein's theory of gravity---are written in the language of field theory; quantum in the first case and classical in the second. The first field theory that you're likely to meet in your physics classes is electromagnetism, which describes the electric and magnetic fields through which light waves ripple all around us. But electromagnetism is actually fairly complicated; to learn field theory, it's better to start with a simpler example, and that's what I do in this video. I'll teach you the fundamentals using the Klein-Gordon theory of a real, scalar field. We'll see how to write down the Lagrangian, apply the principle of least action to obtain the Klein-Gordon field equation, how to solve it using plane waves, and how relativity is built in from the beginning.\nWe'll also take a peek at quantum field theory along the way.\n\nGet all the links here: https://www.physicswithelliot.com/fields-mini\n\nThe principle of least action: https://youtu.be/sUk9y23FPHk\n\nThe Lagrangian for a special relativistic particle: https://youtu.be/KVk1QNTWBxQ\n\nThe Lagrangian for a general relativistic particle: https://youtu.be/h2SEK6Jjv3Y\n\nTutoring  inquiries: https://www.physicswithelliot.com/tutoring\n\nIf you find the content I’m creating valuable and would like to help make it possible for me to continue sharing more, please consider supporting me! You can make a recurring contribution at https://www.Patreon.com/PhysicsWithElliot, or make a one time contribution at https://www.physicswithelliot.com/support-me. Thank you so much!\n\nAbout physics mini lessons:\nIn these intermediate-level physics lessons, I'll try to give you a self-contained introduction to some fascinating physics topics. If you're just getting started on your physics journey, you might not understand every single detail in every video---that's totally fine! What I'm really hoping is that you'll be inspired to go off and keep learning more on your own.\n\nAbout me:\nI’m Dr. Elliot Schneider. I love physics, and I want to help others learn (and learn to love) physics, too. Whether you’re a beginner just starting out with your physics studies, a more advanced student, or a lifelong learner, I hope you’ll find resources here that enable you to deepen your understanding of the laws of nature. For more cool physics stuff, visit me at https://www.physicswithelliot.com.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}