{
  "title": "KYAN Therapeutics bags US$5M to bridge the cancer care gap using tech",
  "link": "https://e27.co/kyan-therapeutics-bags-us5m-to-bridge-the-cancer-care-gap-using-tech-20221026/",
  "dc:creator": "Sainul",
  "pubDate": "Wed, 26 Oct 2022 09:09:41 +0000",
  "category": [
    "Biotech",
    "Investments",
    "Singapore",
    "Altara Ventures",
    "Enterprise Singapore",
    "K3 Ventures",
    "KYAN Therapeutics",
    "SEEDS Capital"
  ],
  "guid": "https://e27.co/?p=474984",
  "description": "<p>Singapore-based KYAN Therapeutics, a biotech company with novel personalised medicine and drug-dose combination optimisation technology, has closed a US$5 million oversubscribed pre-Series A funding round. Altara Ventures led the round and was joined by Enterprise Singapore (SEEDS Capital), K3 Ventures, and prominent angel investors. KYAN will use the funds to advance clinical development, expand lab [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/kyan-therapeutics-bags-us5m-to-bridge-the-cancer-care-gap-using-tech-20221026/\">KYAN Therapeutics bags US$5M to bridge the cancer care gap using tech</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<div id=\"attachment_475021\" style=\"width: 700px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-475021\" loading=\"lazy\" class=\"size-full wp-image-475021\" src=\"https://e27.co/wp-content/uploads/2022/10/KYAN_Therapeutics_pre_A_news.png\" alt=\"\" width=\"690\" height=\"388\" /><p id=\"caption-attachment-475021\" class=\"wp-caption-text\">Hugo Saavedra, Chairman and CEO of KYAN Therapeutics</p></div>\n<p>Singapore-based KYAN Therapeutics, a biotech company with novel personalised medicine and drug-dose combination optimisation technology, has closed a US$5 million oversubscribed pre-Series A funding round.</p>\n<p>Altara Ventures led the round and was joined by Enterprise Singapore (SEEDS Capital), K3 Ventures, and prominent angel investors.</p>\n<p>KYAN will use the funds to advance clinical development, expand lab infrastructure and treat more patients globally.</p>\n<p>Hugo Saavedra, Chairman and CEO of KYAN Therapeutics, said: &#8220;KYAN is on a mission to bridge the cancer care gap by advancing revolutionary technologies. This funding will help KYAN establish our commercial lab, fund additional clinical trials, and expand our team.&#8221;</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/how-iprice-navigates-the-seven-seas-20221025/\">How iPrice Group navigates the seven SEAs</a></strong></p>\n<p>&#8220;We have ambitious goals to expand globally, and Singapore is the perfect place for us to set up our new global headquarters given the access to strategic investors, leading clinical collaborators and great talent,&#8221; he added.</p>\n<p>KYAN Therapeutics tackles the complexity of cancer by combining small data AI and biological experiments. From drug development to personalised medicine, KYAN offers a solution to identify the optimal outcome for millions of possible drug-dose combinations.</p>\n<p>This funding news comes on the heels of KYAN&#8217;s recent announcement of positive clinical study findings on its guided treatment platform for patients with relapsed and refractory lymphoma.</p>\n<p>According to the company, the prospective and interventional study resulted in 59 per cent of treated patients with improved progression-free survival (PFS) compared to their last line of treatment.</p>\n<p>&#8212;</p>\n<div class=\"post-container x-post-content\">\n<p><span >Echelon 2022 aims to provide intimate and focused discussions on key topics and business matching services to facilitate business-driven connections during the two-day event. </span><strong><span >e27 </span></strong><span >will curate and invite key stakeholders of startups, investors, corporates, and ecosystem enablers to drive towards fruitful business outcomes at Echelon. </span></p>\n<p><span >Here’s the full list of the <a rel=\"follow\" href=\"https://e27.co/echelon/asia/agenda/\" rel=\"follow\">speakers for the 2022 edition</a>, which will be co-located with SWITCH at Resorts World Sentosa from 27 to 28 October 2022. </span><a class=\"editor-rtfLink\" rel=\"follow\" href=\"https://e27.co/echelon/asia/\" target=\"_blank\" rel=\"follow noopener\"><span >Learn more here</span></a><span >. </span></p>\n</div>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/kyan-therapeutics-bags-us5m-to-bridge-the-cancer-care-gap-using-tech-20221026/\">KYAN Therapeutics bags US$5M to bridge the cancer care gap using tech</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}