{
  "title": "Hua Hsu on STAY TRUE: A MEMOIR",
  "pubDate": "Thu, 29 Sep 2022 10:00:00 +0000",
  "guid": "9712150c-e9c4-4be4-a385-b1ff5f3103d6",
  "link": "http://pouredover.libsyn.com/hua-hsu-on-stay-true-a-memoir",
  "itunes:image": "",
  "description": "<p>“I think I figured a lot of things out literally as I was writing the book. I'm usually an obsessive methodical writer, or I have everything, if not mapped out, I kind of know spatially, what's going to happen in a piece of writing. But with this, I just kind of had to write it to figure out what it was. For years, friends knew that I was working on this — friends who were in the book, actually. But I could never explain what it was nor could they imagine what it might be. You know, I would just say, <em>I'm writing the story of us, I'm writing a story about Ken</em>.”<br /> <br /> Whether he’s riffing on music or sports or Asian American icons like Maxine Hong Kingston, Hua Hsu’s work in <em>The New Yorker </em>is a joy to read. Now he’s turning inward in his new book, <a href= \"https://www.barnesandnoble.com/w/stay-true-hua-hsu/1140674653?ean=9780385547772\"> <em>Stay True</em></a>, a beautifully written story of unexpected friendship, shocking loss, and his own coming of age. Hua joins us on the show to talk about grief and growing up, inside jokes, his literary influences, changing the conversations we’re having about Asian America, and much more with Poured Over’s host, Miwa Messer.</p> <p> </p> <p>Featured Books (Episode)</p> <p><em>Stay True: A Memoir</em> by Hua Hsu </p> <p><em>A Floating Chinaman: Fantasy and Failure across the Pacific</em> by Hua Hsu </p> <p><em>The Hanging on Union Square</em> by H. T. Tsiang </p> <p><em>Tripmaster Monkey: His Fake Book</em> by Maxine Hong Kingston </p> <p> </p> <p>Poured Over is produced and hosted by Miwa Messer and mixed by Harry Liang. Follow us here for new episodes Tuesdays and Thursdays with occasional Saturdays.<br /> <br /> A complete transcript of this episode is available <a href= \"https://www.barnesandnoble.com/blog/poured-over-hua-hsu-on-stay-true/\"> here</a>.</p>",
  "content:encoded": "<p>“I think I figured a lot of things out literally as I was writing the book. I'm usually an obsessive methodical writer, or I have everything, if not mapped out, I kind of know spatially, what's going to happen in a piece of writing. But with this, I just kind of had to write it to figure out what it was. For years, friends knew that I was working on this — friends who were in the book, actually. But I could never explain what it was nor could they imagine what it might be. You know, I would just say, <em>I'm writing the story of us, I'm writing a story about Ken</em>.”  Whether he’s riffing on music or sports or Asian American icons like Maxine Hong Kingston, Hua Hsu’s work in <em>The New Yorker </em>is a joy to read. Now he’s turning inward in his new book, <a href= \"https://www.barnesandnoble.com/w/stay-true-hua-hsu/1140674653?ean=9780385547772\"> <em>Stay True</em></a>, a beautifully written story of unexpected friendship, shocking loss, and his own coming of age. Hua joins us on the show to talk about grief and growing up, inside jokes, his literary influences, changing the conversations we’re having about Asian America, and much more with Poured Over’s host, Miwa Messer.</p> <p> </p> <p>Featured Books (Episode)</p> <p><em>Stay True: A Memoir</em> by Hua Hsu </p> <p><em>A Floating Chinaman: Fantasy and Failure across the Pacific</em> by Hua Hsu </p> <p><em>The Hanging on Union Square</em> by H. T. Tsiang </p> <p><em>Tripmaster Monkey: His Fake Book</em> by Maxine Hong Kingston </p> <p> </p> <p>Poured Over is produced and hosted by Miwa Messer and mixed by Harry Liang. Follow us here for new episodes Tuesdays and Thursdays with occasional Saturdays.  A complete transcript of this episode is available <a href= \"https://www.barnesandnoble.com/blog/poured-over-hua-hsu-on-stay-true/\"> here</a>.</p>",
  "enclosure": "",
  "itunes:duration": "53:39",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "“I think I figured a lot of things out literally as I was writing the book. I'm usually an obsessive methodical writer, or I have everything, if not mapped out, I kind of know spatially, what's going to happen in a piece of writing. But with this, I...",
  "itunes:episodeType": "full"
}