{
  "title": "All Roads Lead to Toll Roads: Robert Poole on America's Highways",
  "pubDate": "Sun, 01 Jul 2018 04:16:13 +0000",
  "guid": "75069b5e34dd4d58b79a5a82399f2b3e",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP99Poole_EDR.mp3",
  "itunes:image": "",
  "description": "<div style=\"float: right; padding-left: 10px;\"><a href= \"https://www.amazon.com/Rethinking-Americas-Highways-21st-Century-Infrastructure/dp/022655757X/ref=as_li_ss_il?ie=UTF8&qid=1530417163&sr=8-1&keywords=robert+poole&dpID=41oItVlIzZL&preST=_SY291_BO1,204,203,200_QL40_&dpSrc=srch&linkCode=li3&tag=economicsde0f-20&linkId=4e5db1d2b390cecddea20f76d6a06fcb\" target=\"_blank\" rel=\"noopener\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=022655757X&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&l=li3&o=1&a=022655757X\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p>Today's episode of Economics Detective Radio features a conversation with Robert Poole of the Reason Foundation. Robert is the author of <a href=\"https://amzn.to/2KytLaG\" target=\"_blank\" rel=\"noopener\">Rethinking America's Highways: A 21st-Century Vision for Better Infrastructure</a>, a book on how to fix America's infrastructure woes by changing the way roadways are funded:</p> <blockquote>Americans spend hours every day sitting in traffic. And the roads they idle on are often rough and potholed, their exits, tunnels, guardrails, and bridges in terrible disrepair. According to transportation expert Robert Poole, this congestion and deterioration are outcomes of the way America provides its highways. Our twentieth-century model overly politicizes highway investment decisions, short-changing maintenance and often investing in projects whose costs exceed their benefits.</blockquote> <p>We discuss this book, as well as Robert's recent controversial piece in Reason, <a href= \"https://reason.com/archives/2018/06/18/stop-trying-to-get-workers-out\" target=\"_blank\" rel=\"noopener\">\"Stop Trying to Get Workers Out of Their Cars.\"</a> I challenge him on the issue of upzoning and we discuss the some of the necessary conditions for a successful implementation of mass transit. Robert argues that mass transit works best in cities with a high concentration of jobs in a central business district. Without a single concentrated area that many thousands of people want to commute to and from, a mass transit system often can't get the necessary ridership to justify its cost.</p> <hr /> <p> </p>",
  "content:encoded": "<a href= \"https://www.amazon.com/Rethinking-Americas-Highways-21st-Century-Infrastructure/dp/022655757X/ref=as_li_ss_il?ie=UTF8&qid=1530417163&sr=8-1&keywords=robert+poole&dpID=41oItVlIzZL&preST=_SY291_BO1,204,203,200_QL40_&dpSrc=srch&linkCode=li3&tag=economicsde0f-20&linkId=4e5db1d2b390cecddea20f76d6a06fcb\" target=\"_blank\" rel=\"noopener\"></a> <p>Today's episode of Economics Detective Radio features a conversation with Robert Poole of the Reason Foundation. Robert is the author of <a href=\"https://amzn.to/2KytLaG\" target=\"_blank\" rel=\"noopener\">Rethinking America's Highways: A 21st-Century Vision for Better Infrastructure</a>, a book on how to fix America's infrastructure woes by changing the way roadways are funded:</p> Americans spend hours every day sitting in traffic. And the roads they idle on are often rough and potholed, their exits, tunnels, guardrails, and bridges in terrible disrepair. According to transportation expert Robert Poole, this congestion and deterioration are outcomes of the way America provides its highways. Our twentieth-century model overly politicizes highway investment decisions, short-changing maintenance and often investing in projects whose costs exceed their benefits. <p>We discuss this book, as well as Robert's recent controversial piece in Reason, <a href= \"https://reason.com/archives/2018/06/18/stop-trying-to-get-workers-out\" target=\"_blank\" rel=\"noopener\">\"Stop Trying to Get Workers Out of Their Cars.\"</a> I challenge him on the issue of upzoning and we discuss the some of the necessary conditions for a successful implementation of mass transit. Robert argues that mass transit works best in cities with a high concentration of jobs in a central business district. Without a single concentrated area that many thousands of people want to commute to and from, a mass transit system often can't get the necessary ridership to justify its cost.</p>  <p> </p>",
  "enclosure": "",
  "itunes:duration": "51:02",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's episode of Economics Detective Radio features a conversation with Robert Poole of the Reason Foundation. Robert is the author of , a book on how to fix America's infrastructure woes by changing the way roadways are funded: Americans spend...",
  "itunes:episode": 99,
  "itunes:episodeType": "full"
}