{
  "id": "yt:video:KyEoKOsU7wg",
  "yt:videoId": "KyEoKOsU7wg",
  "yt:channelId": "UCMTk_R_Y49jvq-HQXDmKI0Q",
  "title": "The Curious Case of CreepShow Art - A Question of Character | TRO ft. SisterZio & ItzRooster",
  "link": "",
  "author": {
    "name": "The Right Opinion",
    "uri": "https://www.youtube.com/channel/UCMTk_R_Y49jvq-HQXDmKI0Q"
  },
  "published": "2022-07-29T19:00:02+00:00",
  "updated": "2022-08-01T15:53:13+00:00",
  "media:group": {
    "media:title": "The Curious Case of CreepShow Art - A Question of Character | TRO ft. SisterZio & ItzRooster",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Get Surfshark VPN at https://surfshark.deals/opinion - Enter promo code OPINION for 83% off + 3 months for FREE!\n\nThe Right Opinion: The Curious Case of CreepShow Art - A Question of Character | TRO ft. SisterZio & ItzRooster\n\n0:00 - Intro\n3:34 - Introduction\n9:33 - The Content Cycle\n19:11 - Strike 1\n26:42 - Strike 2\n34:17 - Addressing The Faults\n43:37 - This Is Her\n51:35 - Hopeless\n1:11:51 - Peaches\n1:16:56 - Strike 3\n1:22:38 - Strike 4?\n1:28:43 - The Real Amy\n2:09:55 - Shannon's Return\n2:19:30 - Emily's Response\n2:30:14 - Breadcrumbs\n2:37:44 - Moving On\n\nIntro:\n\nCovering drama, isn’t it just the most fun pastime to talk about? \n\nWell, not always, but as people online have grown more invested in the escapades of online creators, coverage is inevitable. At the same time, reporting can take many different forms, and over the years each audience niche has gradually been filled by their corresponding correspondents, whether that’s to do with breaking the news as it happens with an emphatic tone, or analysing the intricacies of a situation through a more retrospective perspective. What matters to people is that they have a voice relaying to them what’s going on in the world, and that voice is at least somewhat reliable, from there they can construct their own hot takes to share to their social media accounts that permeate their relative platforms.\n\nA lot of content is typically very organised, with attention to production value and a clear structure, even if it may not be the most highbrow. However, this sort of content can also have its disadvantages, my sort of content even, it can feel quite distant to some viewers, and if that audience can’t connect to the creator, then they may not feel an interest in the topic that they’re talking about. Sometimes, organisation is unattractive, as much as it pains me to admit. In those cases, viewers may find solace in a creator with a more casual approach to talking about drama, one that reacts to it in an unedited, and unrestrained way, that reflects our innate human reaction to the discovery of revelations about certain shenanigans, and that’s the genre where the person at the centre of today’s video thrived, a person by the name of CreepShow Art.\n\nWatch more to find out!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}