{
  "title": "149: Heidi Fleiss: The Would-Be Madam Of Crystal",
  "link": "https://audioboom.com/posts/7682574",
  "itunes:episode": 149,
  "itunes:title": "Heidi Fleiss: The Would-Be Madam Of Crystal",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3307,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>SEX!<br>\nDRUGS!<br>\nEXOTIC BIRDS?<br>\n<br>\nYou all know Heidi Fleiss, right? The 'madam' of the 90s with the infamous black book who got busted for selling sex but never, like, named names, so took the fall for all the people who used her services? WE SEE YOU CHARLIE SHEEN, YOU PILE OF HUMAN GARBAGE. Anyway, after an encounter with ROSEANNE-GARBAGE-BARR she decides to move to Nevada to open a stud farm....WHAT'S A STUD FARM, YOU ASK? It's, apparently, a brothel full of heterosexual men who are hired to have sex with women. To which we say, if everyone is consenting, GREAT! But....it's not gonna happen. You know it, I know it, the people of Nevada know it, but Heidi Fleiss doesn't know it. BUT THIS FILM CREW IS GONNA FOLLOW HER AROUND FOR 10 MONTHS ANYWAY! Ugh, this one is a mess!<br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<strong>FAM!! WE LAUNCHED A NEW PODCAST!! </strong><a href=\"https://www.unjustandunsolved.com/post/preview-unjust-and-unsolved\">Check out the trailer for \"Unjust and Unsolved\" with investigative journalist Maggie Freleng. </a>\"Unjust and Unsolved\" is a podcast about wrongful convictions. Each episode tells the story of a wrongfully convicted person who was convicted of a very serious crime despite substantial evidence pointing away from their guilt. The stories are told through Maggie's original interviews with the convicted, their loved ones and lawyers, exhaustive investigative work, and news footage. Maggie also tells the story of the crime, details how the person was convicted, and lays out all the evidence. <strong>FIND AND SUBSCRIBE TO \"UNJUST AND UNSOLVED WHEREVER YOU GET YOUR PODCASTS!</strong>\n</div>\n",
  "pubDate": "Mon, 14 Sep 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-09-14:/posts/7682574",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}