{
  "title": "SC EP:531 It Had A Man’s Face",
  "itunes:title": "SC EP:531 It Had A Man’s Face",
  "pubDate": "Sat, 06 Apr 2019 19:40:25 +0000",
  "guid": "gid://art19-episode-locator/V0/Xex4ffcbBPlPy7AERGjWXQMOsiF5D8Mn8liYu-F1Pgc",
  "link": "https://traffic.libsyn.com/secure/sasquatchchronicles/508.mp3",
  "itunes:image": "",
  "description": "<p>Tonight I will be speaking to three guests who all have very different encounters. Matt writes “The encounter happened during July of 95. I live in NC near the Uwharrie mountains now. Back in 95 I lived at the base of the Blue Ridge mountains. Wilkes county to be exact. Me and my friend Mike were headed from the bottom of the mountain to a friend’s house on the top of the mountain.</p> <p>We decided to take the scenic route, late afternoon. The scenic route was a pavement to gravel road called Big Ivy. It was paved at the base of the mountain. But as soon as you started up, it turned to gravel. It was hot even on the side of the mountain, and we were smoking cigarettes. So we had the windows open. We got half way up the mountain, around dusk, and rounded a curve to the left. The road had a drop off to the right, and a very steep bank to the left. As we came around the curve I noticed something walking up onto the side of the road on the right.</p> <p>At first in the dusk, I thought it was a real tall man in a trenchcoat. I said to Mike, “Who’s the trenchcoat”? I looked back and immediately stopped the truck. I saw it wasn’t a man. But whatever it was, it was 7-8′ tall. It just stood there stunned as we were that the other was there. The orange hair on it’s right leg had several places where it was matted together. It had a man’s face more than an apes. At least that’s the way I saw it. With hair up the cheeks of it’s face It had a slight grin on it’s face. Almost like it was smiling. I’m not sure if it was a male or female. I looked at it with awe.</p> <p>Mike however was on the side of the vehicle closest to it, and went into a panic. Kicking the floor board, pushing himself back into the seat. He started yelling “Get out of here”! Startled by his panic, I turned to look at him. Causing me to miss the Bigfoot cross the road right in front of the headlights. When I looked back, he was climbing up the bank on the left, with ease.</p> <p>This bank is so steep, I would have to climb up it on my belly. The Bigfoot went right up in no time flat. I ignored Mike’s yells, and got out of the vehicle. I immediately caught the smell. The smell of water rot, BO, and urine. Foul. I heard him crashing thru the brush on top of the hill. I stood around for a few minutes. Got back in the truck and we left. Excitedly telling our friend about the encounter. He dismissed us and our story. I went back to the spot after work the next day. Saw no trace of what went through there. There is a house on top of the hill. So I couldn’t go on top of the bank and look. But it was hot and dry so no footprints on the side of the road. There is a spring box on the side of the road, will a constantly running overflow pipe. That water supply on the side of the mountain maybe why he was in that area.\"</p> <p>I will also be welcoming to the show Shawn and Shawn writes “I’m from Alabama, born and raised but I moved to Utah for college. I’ve had a few different experiences in both states as well as nearby western Georgia. The Georgia experience is the one I’d like to share.</p> <p>I had recently moved back home to Alabama after finishing in Utah. I had been employed at a lawn maintenance company while going to college. This company is a Fortune 500 and is located in all 50 states and in every city of marginal populations. They handle fertilizer and weed control as well as aerations/dethatching, insect control and services for trees and shrubs both residential and for commercial accounts. I arranged to be transferred to a branch in Georgia as I was moving back to Alabama. My dad has recently been diagnosed with cancer and my mom needed help with the property. They live in a two-story house my dad built on a nice sized portion of land, it’s in the boonies with houses here and there but mostly it’s Alabama soft wood forests in all directions for miles and miles. As an only child helping became my torch to carry with all the animals and miscellaneous yard work not to mention driving my dad to the doctor or picking up groceries and paying the bills.</p> <p>This branch I transferred to in Georgia was about an hour away and only serviced areas in Georgia. One of our commercial accounts was for large tracks of Pine woods for Mead Paper. Some of these 100s of acres went specifically for paper pulp production, some equally sized portions Mead sold to furniture/construction companies but Mead still owned the actual land the trees come from and maintained the upkeep or a better way of saying that is, they hired other companies to take care of it.</p> <p>We had been hired by Mead to do Mauget treatments(pronounced Moe-shay or Moe-jay think French accents). A Mauget is essentially a treatment for trees that involve drilling(taping) roughly 1/12 the diameter of the trunk, equally spaced with about 6 injection points. We could inject iron if the soil was low due to the forests being reused so often, fungicides and insecticides. We were there because pine beetles had been eating up acreages of trees for the construction/furniture profits.</p> <p>These jobs typically take weeks to complete and had crews of 1 salesmen who was responsible for the account and 3-4 technicians. It was one of the only jobs we did where the sales rep helped with applications. State and federal laws govern how to prepare and clean up while doing tree injections. We don’t want iron capsules contaminating the soil or the poisons drifting into water supplies. We would get to the parcel of land around 7:30am with a google map loaded showing the target area. We also had the trees marked off by surveyors who would come in and designate the initial area and through out the weeks come back and mark the rest of the areas with ribbons while we were in other areas.</p> <p>I was the salesman of the account and met with a representative from Mead on-site 3 days before the job was to start so I could get a view of the land and work out the quickest way possible. He was running about 10 minutes late and I was in the truck calling in sales to our office. It was late February roughly 5:00 pm. I was parked on a dirt logging road, both sides of the road was going to be the area we treated. The road went down further about a half mile and ended with a cleared area for trucks to park or turn around. I got off the call and just had an uneasy feeling so I decided to drive down to the dead end and turn around so when the Mead rep got there our drivers sides would be next to each other and we wouldn’t need to get out to have a conversation. I didn’t know why but I didn’t want to get out and go for a walk inspecting woods this close to dark.</p> <p>When I got to the turn around I could tell this area hadn’t been used in a long time, the grass had grown up, there was no loading or logging equipment just a few boxes of ribbons left from the survey crew to use during the job. It was still light out but dark enough for the headlights to come on in the woods. I sat in the lot facing towards the road so I could drive and meet him when I saw him coming with the bed of the truck close to a mound of dirt pushed up right at the boundary of the woods behind me.</p> <p>I heard something crack really loud behind me off in the woods. I figured it was a limb break off a beetle infested tree. No more than 5 seconds later I heard thumping, the best way to describe it is someone running on a hard or compacted floor with extra large shoes flopping down with each step. I turned and put my right arm behind the passenger seat so I could look out the back window. I saw a single pine moving very rapidly back and worth, I could only see the top 60% of the tree because of the large mound of dirt moved to clear the area. It continued for about 10 seconds until I heard a loud series of knocks coming from the driver side off in the woods. I looked to my left and thought I saw a dark figure moving toward where the clearing becomes the road. Then I heard walking behind the truck, immediately I heard three distinctive “whoops,” I mean it was clearly a “woooowhooop, whoop whop!” that came from the same area I saw something walking. Then my truck was pelted with tiny pebbles once I left and looked at then they looked like little tiny pieces of gravel. Something was tossing pebbles from the wood line behind me. I put the truck in drive because things were really starting to freak me out and I heard the loudest yell I can ever remember. It wasn’t guttural but it was low and very reverberating as soon as it finished from behind the truck I heard what I can only describe as a shriek but it was very throaty and raspy.</p> <p>That was it for me, I pulled off and I was getting ready to get on the paved road to leave I saw my Mead contact parked waiting for me. He apologized for being late and we talked about the area and job. He told me flat out he hates coming to this area. I asked him why and he told me about Chris Thompkins. You might know this name if you follow Missing 411. He was a surveyor who went missing working with his crew pretty much in this same area in 2002. I hadn’t heard anything about it. He explained Chris was surveying with his crew spaced about 50 ft apart, he was last in line and just vanished.</p> <p>I told him about the noises I heard and he said he had experienced similar sounds back there and told me he saw a large animal run across the road on two legs and drop to all four when it made it into the woods.</p> <p>The first few days of the job went great but day 4 the survey guys asked us on the way in if we had taken their boxes of ribbons. I told them we wouldn’t have any use for them and I saw them in the clearing where everyone parked. He said someone must have came back there and took them because they couldn’t find them. They left for the day and said they’d come back tonight and lay some down for us to complete in the morning. We only had about 15 trees left in the area since they couldn’t mark any the rest of the day so I sent all but one technician home early. It was about 5:30pm when we finished and we’re picking up the injection caps from trees. He heard it first and asked what the hell is that!? It was the same yell I had heard about a week earlier. I told him I didn’t know and let’s finish grabbing the trash so we could leave. That’s when I heard something whiz throw the air. The cap injectors are cylinders that get a hole punched in one end and I was hearing the wind pass over it as it went through the air. I didn’t see it but we heard it. Two more where thrown and that was enough for us. We walked a pretty fast pace back to the truck and packed the truck up with the drills and spent caps. We sat and listened for about 30 minutes it was about 6:10pm. There was dozens of yells and whooping and that strange shriek. As we were leaving the cleared area we saw a large animal peering around a tree about 15 ft from the dirt road. It was rocking to our left and bobbing back behind the trunk over and over. The only knocking we heard was as we were leaving down the dirt road towards the main paved road.</p> <p>To cut the reading down I’ll condense the rest. The job started going slow because the survey ribbons kept getting torn off the trees and just littered the ground. We would find clumps of them wrapped together sometimes just laying in the middle of the clearing. They started using blue paint to mark and that’s when some drills started getting broken and trees we treated we would find, I mean they were pushed over. That’s the only way I can say it. Not all of them not even most of them but a good number the further back we treated.</p> <p>We ended up completing about 70% of the area and Mead canceled the rest. The rep would only tell me we did a great job all things considered and they were going to let the land “sit” for awhile. Ever since I always wondered about the missing surveyor and if any of us were in any real danger.”</p> <p> James will be also sharing his encounter. James writes “During the winter of 1993 I shipped off to Fort Leonardwood, MO for basic training and would eventually become a transportation expert in the National Guard. Fourteen months later I would then enlist into Active Duty after attempting a semester of college. I would find myself at Fort Knox, KY. About a year and a half while in my second unit the Brigade would move out towards western Kentucky, not far from Central City to conduct a month long field exercise. This is where I would witness one of these creatures.</p> <p>Last one day a battle buddy and I headed for the showers which were located near the entrance of the training area. The building was located over a hundred yards from the staging area where all large vehicles were to park. A road ran from the gate in front of the building towards the staging area which then split off into two separate directions. In the fork of this intersection was located the ammo/ fuel point. The road the split off to the left separated the staging area and the fuel point. At the back end of the staging area was a row of conex containers. Behind these containers was a hill. Near the end of the containers and not too far from the fuel point was a street light. Now this row ran about a hundred yards which came to a deep raven. We parked our vehicle, a HEMMET (10 Ton cargo truck). I was a PFC (Private First Class) at the time and my battle buddy was a SPC (Specialist) so he told me to go take my shower first, which I did. When I finished and headed back it was starting to get dark. I climbed into the drivers side of the vehicle and waited for him to return. We were facing the shower building and how I was seated I was facing out the passenger window looking at the end of the containers near the street light. It didn’t light up a huge area but I could see part way up the hill and the end of the containers.</p> <p>After a while I noticed “someone” come walking off the side of the hill. At first I didn’t think much about it believing someone was lost while doing night time land navigation. I watched for about five minutes till the figure walked behind the containers to never be seen again. As I continued to watch somethings started to make me question what I was looking at. They were tall and broad, wasn’t carrying a weapon of any type, and wasn’t wearing any battle raddle, especially a pro-mask (gas mask). Then I noticed that their pants weren’t bloused into boots. The figure had their head down, walking back and forth as if they were looking for something. Then they walked behind the containers where the top of their head reached the top of the container and really noticed how big this individual was.</p> <p>I am 6’3″ and if I stand in side a conex with boots on, stand on my toes and reach up I can grab the top of the conex.</p> <p>During this field exercise the majority would return to the rear for the weekend while each unit kept a small crew back to watch everything. Half way through the exercise my battle buddy and I was sent to the fuel/ ammo point. I took this time to walk over to where I saw the figure to see if any tracks could be seen. I found nothing which wasn’t a surprise for several reasons; it had rain by that time and the ground was so compacted that a HUMVEE would hardly leave a track there.</p> <p>There was no interaction between the subject and myself. I haven’t had any other encounters either.”</p> <p> </p>",
  "content:encoded": "<p>Tonight I will be speaking to three guests who all have very different encounters. Matt writes “The encounter happened during July of 95. I live in NC near the Uwharrie mountains now. Back in 95 I lived at the base of the Blue Ridge mountains. Wilkes county to be exact. Me and my friend Mike were headed from the bottom of the mountain to a friend’s house on the top of the mountain.</p> <p>We decided to take the scenic route, late afternoon. The scenic route was a pavement to gravel road called Big Ivy. It was paved at the base of the mountain. But as soon as you started up, it turned to gravel. It was hot even on the side of the mountain, and we were smoking cigarettes. So we had the windows open. We got half way up the mountain, around dusk, and rounded a curve to the left. The road had a drop off to the right, and a very steep bank to the left. As we came around the curve I noticed something walking up onto the side of the road on the right.</p> <p>At first in the dusk, I thought it was a real tall man in a trenchcoat. I said to Mike, “Who’s the trenchcoat”? I looked back and immediately stopped the truck. I saw it wasn’t a man. But whatever it was, it was 7-8′ tall. It just stood there stunned as we were that the other was there. The orange hair on it’s right leg had several places where it was matted together. It had a man’s face more than an apes. At least that’s the way I saw it. With hair up the cheeks of it’s face It had a slight grin on it’s face. Almost like it was smiling. I’m not sure if it was a male or female. I looked at it with awe.</p> <p>Mike however was on the side of the vehicle closest to it, and went into a panic. Kicking the floor board, pushing himself back into the seat. He started yelling “Get out of here”! Startled by his panic, I turned to look at him. Causing me to miss the Bigfoot cross the road right in front of the headlights. When I looked back, he was climbing up the bank on the left, with ease.</p> <p>This bank is so steep, I would have to climb up it on my belly. The Bigfoot went right up in no time flat. I ignored Mike’s yells, and got out of the vehicle. I immediately caught the smell. The smell of water rot, BO, and urine. Foul. I heard him crashing thru the brush on top of the hill. I stood around for a few minutes. Got back in the truck and we left. Excitedly telling our friend about the encounter. He dismissed us and our story. I went back to the spot after work the next day. Saw no trace of what went through there. There is a house on top of the hill. So I couldn’t go on top of the bank and look. But it was hot and dry so no footprints on the side of the road. There is a spring box on the side of the road, will a constantly running overflow pipe. That water supply on the side of the mountain maybe why he was in that area.\"</p> <p>I will also be welcoming to the show Shawn and Shawn writes “I’m from Alabama, born and raised but I moved to Utah for college. I’ve had a few different experiences in both states as well as nearby western Georgia. The Georgia experience is the one I’d like to share.</p> <p>I had recently moved back home to Alabama after finishing in Utah. I had been employed at a lawn maintenance company while going to college. This company is a Fortune 500 and is located in all 50 states and in every city of marginal populations. They handle fertilizer and weed control as well as aerations/dethatching, insect control and services for trees and shrubs both residential and for commercial accounts. I arranged to be transferred to a branch in Georgia as I was moving back to Alabama. My dad has recently been diagnosed with cancer and my mom needed help with the property. They live in a two-story house my dad built on a nice sized portion of land, it’s in the boonies with houses here and there but mostly it’s Alabama soft wood forests in all directions for miles and miles. As an only child helping became my torch to carry with all the animals and miscellaneous yard work not to mention driving my dad to the doctor or picking up groceries and paying the bills.</p> <p>This branch I transferred to in Georgia was about an hour away and only serviced areas in Georgia. One of our commercial accounts was for large tracks of Pine woods for Mead Paper. Some of these 100s of acres went specifically for paper pulp production, some equally sized portions Mead sold to furniture/construction companies but Mead still owned the actual land the trees come from and maintained the upkeep or a better way of saying that is, they hired other companies to take care of it.</p> <p>We had been hired by Mead to do Mauget treatments(pronounced Moe-shay or Moe-jay think French accents). A Mauget is essentially a treatment for trees that involve drilling(taping) roughly 1/12 the diameter of the trunk, equally spaced with about 6 injection points. We could inject iron if the soil was low due to the forests being reused so often, fungicides and insecticides. We were there because pine beetles had been eating up acreages of trees for the construction/furniture profits.</p> <p>These jobs typically take weeks to complete and had crews of 1 salesmen who was responsible for the account and 3-4 technicians. It was one of the only jobs we did where the sales rep helped with applications. State and federal laws govern how to prepare and clean up while doing tree injections. We don’t want iron capsules contaminating the soil or the poisons drifting into water supplies. We would get to the parcel of land around 7:30am with a google map loaded showing the target area. We also had the trees marked off by surveyors who would come in and designate the initial area and through out the weeks come back and mark the rest of the areas with ribbons while we were in other areas.</p> <p>I was the salesman of the account and met with a representative from Mead on-site 3 days before the job was to start so I could get a view of the land and work out the quickest way possible. He was running about 10 minutes late and I was in the truck calling in sales to our office. It was late February roughly 5:00 pm. I was parked on a dirt logging road, both sides of the road was going to be the area we treated. The road went down further about a half mile and ended with a cleared area for trucks to park or turn around. I got off the call and just had an uneasy feeling so I decided to drive down to the dead end and turn around so when the Mead rep got there our drivers sides would be next to each other and we wouldn’t need to get out to have a conversation. I didn’t know why but I didn’t want to get out and go for a walk inspecting woods this close to dark.</p> <p>When I got to the turn around I could tell this area hadn’t been used in a long time, the grass had grown up, there was no loading or logging equipment just a few boxes of ribbons left from the survey crew to use during the job. It was still light out but dark enough for the headlights to come on in the woods. I sat in the lot facing towards the road so I could drive and meet him when I saw him coming with the bed of the truck close to a mound of dirt pushed up right at the boundary of the woods behind me.</p> <p>I heard something crack really loud behind me off in the woods. I figured it was a limb break off a beetle infested tree. No more than 5 seconds later I heard thumping, the best way to describe it is someone running on a hard or compacted floor with extra large shoes flopping down with each step. I turned and put my right arm behind the passenger seat so I could look out the back window. I saw a single pine moving very rapidly back and worth, I could only see the top 60% of the tree because of the large mound of dirt moved to clear the area. It continued for about 10 seconds until I heard a loud series of knocks coming from the driver side off in the woods. I looked to my left and thought I saw a dark figure moving toward where the clearing becomes the road. Then I heard walking behind the truck, immediately I heard three distinctive “whoops,” I mean it was clearly a “woooowhooop, whoop whop!” that came from the same area I saw something walking. Then my truck was pelted with tiny pebbles once I left and looked at then they looked like little tiny pieces of gravel. Something was tossing pebbles from the wood line behind me. I put the truck in drive because things were really starting to freak me out and I heard the loudest yell I can ever remember. It wasn’t guttural but it was low and very reverberating as soon as it finished from behind the truck I heard what I can only describe as a shriek but it was very throaty and raspy.</p> <p>That was it for me, I pulled off and I was getting ready to get on the paved road to leave I saw my Mead contact parked waiting for me. He apologized for being late and we talked about the area and job. He told me flat out he hates coming to this area. I asked him why and he told me about Chris Thompkins. You might know this name if you follow Missing 411. He was a surveyor who went missing working with his crew pretty much in this same area in 2002. I hadn’t heard anything about it. He explained Chris was surveying with his crew spaced about 50 ft apart, he was last in line and just vanished.</p> <p>I told him about the noises I heard and he said he had experienced similar sounds back there and told me he saw a large animal run across the road on two legs and drop to all four when it made it into the woods.</p> <p>The first few days of the job went great but day 4 the survey guys asked us on the way in if we had taken their boxes of ribbons. I told them we wouldn’t have any use for them and I saw them in the clearing where everyone parked. He said someone must have came back there and took them because they couldn’t find them. They left for the day and said they’d come back tonight and lay some down for us to complete in the morning. We only had about 15 trees left in the area since they couldn’t mark any the rest of the day so I sent all but one technician home early. It was about 5:30pm when we finished and we’re picking up the injection caps from trees. He heard it first and asked what the hell is that!? It was the same yell I had heard about a week earlier. I told him I didn’t know and let’s finish grabbing the trash so we could leave. That’s when I heard something whiz throw the air. The cap injectors are cylinders that get a hole punched in one end and I was hearing the wind pass over it as it went through the air. I didn’t see it but we heard it. Two more where thrown and that was enough for us. We walked a pretty fast pace back to the truck and packed the truck up with the drills and spent caps. We sat and listened for about 30 minutes it was about 6:10pm. There was dozens of yells and whooping and that strange shriek. As we were leaving the cleared area we saw a large animal peering around a tree about 15 ft from the dirt road. It was rocking to our left and bobbing back behind the trunk over and over. The only knocking we heard was as we were leaving down the dirt road towards the main paved road.</p> <p>To cut the reading down I’ll condense the rest. The job started going slow because the survey ribbons kept getting torn off the trees and just littered the ground. We would find clumps of them wrapped together sometimes just laying in the middle of the clearing. They started using blue paint to mark and that’s when some drills started getting broken and trees we treated we would find, I mean they were pushed over. That’s the only way I can say it. Not all of them not even most of them but a good number the further back we treated.</p> <p>We ended up completing about 70% of the area and Mead canceled the rest. The rep would only tell me we did a great job all things considered and they were going to let the land “sit” for awhile. Ever since I always wondered about the missing surveyor and if any of us were in any real danger.”</p> <p> James will be also sharing his encounter. James writes “During the winter of 1993 I shipped off to Fort Leonardwood, MO for basic training and would eventually become a transportation expert in the National Guard. Fourteen months later I would then enlist into Active Duty after attempting a semester of college. I would find myself at Fort Knox, KY. About a year and a half while in my second unit the Brigade would move out towards western Kentucky, not far from Central City to conduct a month long field exercise. This is where I would witness one of these creatures.</p> <p>Last one day a battle buddy and I headed for the showers which were located near the entrance of the training area. The building was located over a hundred yards from the staging area where all large vehicles were to park. A road ran from the gate in front of the building towards the staging area which then split off into two separate directions. In the fork of this intersection was located the ammo/ fuel point. The road the split off to the left separated the staging area and the fuel point. At the back end of the staging area was a row of conex containers. Behind these containers was a hill. Near the end of the containers and not too far from the fuel point was a street light. Now this row ran about a hundred yards which came to a deep raven. We parked our vehicle, a HEMMET (10 Ton cargo truck). I was a PFC (Private First Class) at the time and my battle buddy was a SPC (Specialist) so he told me to go take my shower first, which I did. When I finished and headed back it was starting to get dark. I climbed into the drivers side of the vehicle and waited for him to return. We were facing the shower building and how I was seated I was facing out the passenger window looking at the end of the containers near the street light. It didn’t light up a huge area but I could see part way up the hill and the end of the containers.</p> <p>After a while I noticed “someone” come walking off the side of the hill. At first I didn’t think much about it believing someone was lost while doing night time land navigation. I watched for about five minutes till the figure walked behind the containers to never be seen again. As I continued to watch somethings started to make me question what I was looking at. They were tall and broad, wasn’t carrying a weapon of any type, and wasn’t wearing any battle raddle, especially a pro-mask (gas mask). Then I noticed that their pants weren’t bloused into boots. The figure had their head down, walking back and forth as if they were looking for something. Then they walked behind the containers where the top of their head reached the top of the container and really noticed how big this individual was.</p> <p>I am 6’3″ and if I stand in side a conex with boots on, stand on my toes and reach up I can grab the top of the conex.</p> <p>During this field exercise the majority would return to the rear for the weekend while each unit kept a small crew back to watch everything. Half way through the exercise my battle buddy and I was sent to the fuel/ ammo point. I took this time to walk over to where I saw the figure to see if any tracks could be seen. I found nothing which wasn’t a surprise for several reasons; it had rain by that time and the ground was so compacted that a HUMVEE would hardly leave a track there.</p> <p>There was no interaction between the subject and myself. I haven’t had any other encounters either.”</p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "01:13:06",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,camping,strange,scary,aliens,ufo,Outdoors,paranormal,Bigfoot,woods,cryptozoology,sasquatch,encounter,cryptid,cryptids,dogman,bobgimlin,bigfootencounters,pattersonfilm,pattersongimlinfilm",
  "itunes:subtitle": "Tonight I will be speaking to three guests who all have very different encounters. Matt writes “The encounter happened during July of 95. I live in NC near the Uwharrie mountains now. Back in 95 I lived at the base of the Blue Ridge mountains....",
  "itunes:episode": 531,
  "itunes:episodeType": "full"
}