{
  "title": "Millionaire Interview 338",
  "link": "https://esimoney.com/millionaire-interview-338/",
  "comments": "https://esimoney.com/millionaire-interview-338/#comments",
  "dc:creator": "ESI",
  "pubDate": "Mon, 24 Oct 2022 09:00:19 +0000",
  "category": [
    "Interviews",
    "Millionaires"
  ],
  "guid": "https://esimoney.com/?p=8776",
  "description": "<p>Here’s our latest interview with a millionaire as we seek to learn from those who have grown their wealth to high heights. If you’d like to be considered for an interview, drop me a note and we can chat about specifics. This interview took place in June. My questions are in bold italics and their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/millionaire-interview-338/\">Millionaire Interview 338</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "content:encoded": "<p><a href=\"https://esimoney.com/wp-content/uploads/2022/06/Modern-apartment-complex-new.jpg\"><img class=\"alignleft size-medium wp-image-8777\" src=\"https://esimoney.com/wp-content/uploads/2022/06/Modern-apartment-complex-new-300x200.jpg\" alt=\"\" width=\"300\" height=\"200\" srcset=\"https://esimoney.com/wp-content/uploads/2022/06/Modern-apartment-complex-new-300x200.jpg 300w, https://esimoney.com/wp-content/uploads/2022/06/Modern-apartment-complex-new.jpg 750w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a>Here’s our latest <a href=\"https://esimoney.com/category/millionaires/\">interview with a millionaire</a> as we seek to learn from those who have grown their wealth to high heights.</p>\n<p>If you’d like to be considered for an interview, <a href=\"https://esimoney.com/contact/\">drop me a note</a> and we can chat about specifics.</p>\n<p>This interview took place in June.</p>\n<p>My questions are in bold italics and their responses follow in black.</p>\n<p>Let&#8217;s get started&#8230;</p>\n<h4><span style=\"text-decoration: underline;\"><strong>OVERVIEW</strong></span></h4>\n<p><em><strong>How old are you (and spouse if applicable, plus how long you&#8217;ve been married)?</strong></em></p>\n<p>I am a single, 52-year-old woman who has never been married.</p>\n<p><em><strong>Do you have kids/family (if so, how old are they)?</strong></em></p>\n<p>I have no kids.</p>\n<p><em><strong>What area of the country do you live in (and urban or rural)?</strong></em></p>\n<p>I live in the suburbs of Nevada.</p>\n<p><em><strong>What is your current net worth?</strong></em></p>\n<p>My current net worth is $15-20 million.</p>\n<p><em><strong>What are the main assets that make up your net worth (stocks, real estate, business, home, retirement accounts, etc.) and any debt that offsets part of these?</strong></em></p>\n<p>I currently share one commercial property with my sister and I own 12 houses. All of the real estate has been paid off.</p>\n<p>I have $600,000 in the bank.</p>\n<p>I have $1,030,000 million in a Roth IRA, $850,000 in another retirement fund, $10,600,000 in stocks and mutual funds.</p>\n<p>My father passed away in March 2022 and left me $1,000,000 in his retirement fund.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>EARN</strong></span></h4>\n<p><em><strong>What is your job?</strong></em></p>\n<p>I previously owned my own medical practice but sold the practice in March 2022.</p>\n<p>I am a family practice physician.</p>\n<p><em><strong>What is your annual income?</strong></em></p>\n<p>$310,000 per year from my job as a physician.</p>\n<p><em><strong>Tell us about your income performance over time. What was the starting salary of your first job, how did it grow from there (and what you did to make it grow), and where are you now?</strong></em></p>\n<p>My first job out of residency in California paid me $110,000 per year in 1999.</p>\n<p>I moved out of state two years later and worked for a company for 6 months. The hospital subsidized my salary of $144,000 per year.</p>\n<p>Unfortunately, they went bankrupt and I had to moonlight in urgent cares and workman comp facilities while I was building my practice. I worked 7 days a week for two years until my practice was stable for me to quit the moonlighting jobs.</p>\n<p>When I opened my own practice, I had a few physicians work as independent contractors. I would pay them 50% of what they collected. I was often seeing over 40 patients a day, going to the office on Saturdays and just did not enjoy medicine.</p>\n<p>Besides my own practice, I also did clinical research on the side. They rented part of the office and they would pay me a set amount of money for each patient I saw depending on the clinical study. For example, I could see a patient for a physical and get paid $50, evaluate an EKG and get $15.</p>\n<p>I also teach medical students on the side. The school would pay me $350 per student per month. I usually see 2 students per month. Although I probably brought in $500,000 salary, I only paid myself $250,000 at the advice of my accountant.</p>\n<p>In the last year, I decided to sell my practice and actually sold my practice which closed 3/15/22 for $1.7 million.</p>\n<p>I quit research but continue to teach medical students. Since I have no kids, I see these students as my children and can pass on my knowledge.</p>\n<p>Since then, my life has become much easier. I am now seeing about 25-30 patients a day, have my weekends free, and now I get 4 weeks of paid vacation plus continuing medical education time. I also eliminated all the administration duties.</p>\n<p>I bought my first home in California in 2000 and then moved to Nevada. After buying and living in my first home in Nevada in 2001, I moved in 2 years and bought another home in 2003. After a few years, the real estate market dropped and I started to purchase single family homes in the area.</p>\n<p>These are the purchase prices of my houses which I purchased. I’m not sure about the value of the house but put very conservative numbers for their current value:</p>\n<ul>\n<li>$259,000 California purchased 2000, estimated value $850,000</li>\n<li>$202,500 Nevada purchased 2001, estimated value $450,000</li>\n<li>$682,000 Nevada purchased 2003, estimated value $680,000</li>\n<li>$805,000 Nevada commercial property 2005, estimated value $1,000,000</li>\n<li>$336,000 Nevada purchased 2008,estimated value $600,000</li>\n<li>$320,000 Nevada purchased 2009, estimated value $600,000</li>\n<li>$296,000 Nevada purchased 2010, estimated value $600,000</li>\n<li>$259,090 Nevada purchased 2010, estimated value $550,000</li>\n<li>$299,900 Nevada purchased 2011, estimated value $600,000</li>\n<li>$339,500 Nevada purchased 2011, estimated value $600,000</li>\n<li>$349,200 Nevada purchased 2012, estimated value $600,000</li>\n<li>$381,200 Nevada purchased 2017, estimated value $600,000</li>\n<li>$395,990 Nevada purchased 2018, estimated value $600,000</li>\n</ul>\n<p>My rental income is $28,820 per month if every tenant pays.</p>\n<p><em><strong>What tips do you have for others who want to grow their career-related income?</strong></em></p>\n<p>I can only speak for medicine. Most physicians will tell you not to go into primary care. I agree in some aspects because we need to deal with several patient problems instead of just one issue. Just last week, I had a patient complaining about 5 different issues.</p>\n<p>The good thing about primary care is that you do feel like a real physician because you can handle multiple medical issues. I have the ability to moonlight while building up my practice. If I were a Cardiologist, I could not moonlight at the urgent care. I also could participate in clinical research as well as teaching. My options are open.</p>\n<p>If you really want to grow your practice, you can hire extenders to help you see patients. I think my issue is that I need to trust that the provider does not make a clinical error in case I get sued.</p>\n<p>As I’ve done, you can also buy your own building and rent out the space back to yourself.</p>\n<p><em><strong>What&#8217;s your work-life balance look like?</strong></em></p>\n<p>After I sold my practice, I have more free time. I work my 40 hours and have my weekends back. This is all brand new to me. I do enjoy watching television and playing the piano. I love walking. I try to walk 5 miles on the weekdays and more on the weekends.</p>\n<p>When I had my own practice, I was working after seeing patients, going to the clinic on the weekends to finished administrative duties or buying clinic items.</p>\n<p>I also manage my own properties so usually there’s some errand that needs to be done.</p>\n<p><em><strong>Do you have any sources of income besides your career? If so, can you list them, give us a feel for how much you earn with each, and offer some insight into how you developed them?</strong></em></p>\n<p>Besides my salary, I have income from my rental properties.</p>\n<p>I make $28,820 per month from my individual properties and I share the $8,670 per month with my sister for the commercial property.</p>\n<p>The company that purchased my clinic is renting the clinic from us.</p>\n<p>The medical school usually sends me 0-3 students per month and pays me $350 per student per month.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>SAVE</strong></span></h4>\n<p><em><strong>What is your annual spending?</strong></em></p>\n<p>My spending is minimum. Most of the expenses are associated with the rental houses such as the pool, HOA, gardening fees etc.</p>\n<p>My splurge is usually going out to eat maybe once every 1-2 weeks and Netflix, Hulu, and Sling.</p>\n<p>I’m fortunate because pharm reps often bring us food for lunch and I can often eat the left overs for dinner. Prior, I would buy clothes but as an employee, I have uniform scrubs.</p>\n<p>My monthly expense not including investments are probably $1000-1500 depending on the electricity bill.</p>\n<p><em><strong>What are the main categories (expenses) this spending breaks into?</strong></em></p>\n<ul>\n<li>Groceries $100-200</li>\n<li>Utilities $500-750 ($92 gas, trash $50 every 3 months, power $165, solar $250, water $165)</li>\n<li>Restaurant $100</li>\n<li>Gas $100</li>\n<li>Internet $63</li>\n<li>TV $45</li>\n</ul>\n<p><em><strong>Do you have a budget? If so, how do you implement it?</strong></em></p>\n<p>I have no budget.</p>\n<p><em><strong>What percentage of your gross income do you save and how has that changed over time?</strong></em></p>\n<p>I have autopayments of investments.</p>\n<p>If the market drops, I’ll often purchase more stocks/mutual funds.</p>\n<p>Currently, I invest in Vanguard $2,000 every month.</p>\n<p>Because I recently became a salaried employee, I’m only taking in $400 per paycheck because I put most of the money in retirement and taxes. Just my last paycheck on Friday increased to a net income of $6,900 because I already maxed my retirement income so I’ll increase my monthly contribution to Vanguard.</p>\n<p><em><strong>What&#8217;s your best tip for saving (accumulating) money?</strong></em></p>\n<p>Automatically invest your money monthly.</p>\n<p><em><strong>What&#8217;s your best tip for spending less money?</strong></em></p>\n<p>I’m already pretty frugal so this is a hard question.</p>\n<p>When we were young, my mom trained us. All I ever heard was that we have no money.</p>\n<p>Maybe pay cash and then you are less willing to spend money.</p>\n<p>When we were young, going out to eat was a treat and we needed to save money so I was trained that you only order water as a drink when dining out. To this day, I still only drink water as a beverage at restaurants. I don’t drink coffee and I don’t drink alcohol.</p>\n<p><em><strong>What is your favorite thing to spend money on/your secret splurge?</strong></em></p>\n<p>Hulu, Netflix, Sling and eating out.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>INVEST</strong></span></h4>\n<p><em><strong>What is your investment philosophy/plan?</strong></em></p>\n<p>I think you need to split your investments with a mixture of stocks and real estate.</p>\n<p>If you have money, just buy and eventually, it should go up.</p>\n<p>Make sure you have enough money if your rentals are empty.</p>\n<p><em><strong>What has been your best investment?</strong></em></p>\n<p>I think right now, it’s real estate. I was lucky.</p>\n<p>I had $1 million cash that I decided to just put in $100,000 every month into Vanguard until the $1 million ran out. I must have entered it incorrectly. The Vanguard representative called me to ask if I really wanted to invest $1 million and I said yes. They actually purchased $1 million in stock that day.</p>\n<p>When I saw what I did, I turned pale white. That stock is now over $3 million.</p>\n<p><em><strong>What has been your worst investment?</strong></em></p>\n<p>I loaned money to someone who went bankrupt.</p>\n<p>I had held Exxon Mobil for 20 years and it was turning negative. I told myself everyone is going into electric cars and once it turned positive, I would sell.</p>\n<p>After I sold and within a year or so, Russia invaded Ukraine and of course, the Exxon Mobil went up.</p>\n<p><em><strong>What&#8217;s been your overall return?</strong></em></p>\n<p>The stock market has taken a dip so it’s about 9%.</p>\n<p>I have more than doubled my money on every house except 3 houses.</p>\n<p><em><strong>How often do you monitor/review your portfolio?</strong></em></p>\n<p>I use to look at the stock portfolio daily but with the drop in the market, I don’t want to look.</p>\n<p>Previously, I would reassess every year.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>NET WORTH</strong></span></h4>\n<p><em><strong>How did you accumulate your net worth?</strong></em></p>\n<p>I started out in residency investing $50 per month automatically in Exxon Mobil.</p>\n<p>When I had more money, that increased to $250 per dividend reinvestment company. I had 4 at that time &#8212; McDonald’s, SBC, and Pfizer. I would put $100-250 per month in each stock and reinvest the dividends. I then added Vanguard and would slowly increase how much I invested.</p>\n<p>I also invested in other companies but my financial planner advised me to consolidate all of the stocks into Vanguard. At one point, I invested $6,350 per month.</p>\n<p>After I moved to Vanguard, I invest $2000 per month because I could not continue the dividend reinvestment programs.</p>\n<p>I also saved money and I would look at Zillow, Redfin, etc. and look for houses. I purchased property in my community. I would walk around and would call agents to make purchases of homes. I would see if they would give me a deal if I did not have an agent. I also went into a new housing development and purchased a home in my area.</p>\n<p>If you have a decent location for your property, decent families will rent from you. If you are going to go into a new housing development, have your favorite agent represent you and see if they will give you a percentage back to you. The developers pay the agents a percent commission.</p>\n<p>If you hold your properties and stocks long enough, I think it will grow. Just don’t get too greedy and over extend yourself.</p>\n<p><em><strong>What would you say is your greatest strength in the ESI wealth-building model (Earn, Save or Invest) and why would you say it&#8217;s tops?</strong></em></p>\n<p>I think you need all of these. I could not do it with only one.</p>\n<p>Make your money, save and invest it into real estate and or stocks.</p>\n<p><em><strong>What road bumps did you face along the way to becoming a millionaire and how did you handle them?</strong></em></p>\n<p>At one time, half the houses I owned were empty. I was lucky because with my salary, I could afford the houses being empty. I would advertise the homes on Zillow, etc. and show the houses to the prospective tenants myself. I would find out what they did not like and try to show them another house I owed which was empty.</p>\n<p>When I lost my job first moving to Nevada, I wanted to move back to California but I did not want to be a “failure” and ask for my old job back. As I mentioned, I worked two years straight working in workman’s comp and urgent cares while opening up my practice. I think I worked about 60-80 hours a week with no days off for two years straight. I was exhausted and often miserable but I was determined to succeed.</p>\n<p><em><strong>What are you currently doing to maintain/grow your net worth?</strong></em></p>\n<p>After I sold my practice, I decided I had enough of real estate. Although it’s made me more money, I manage all the properties so I was tired of dealing with broken items.</p>\n<p>I invested in the stock market but lately, it has not been good. I hope they will increase with time.</p>\n<p><em><strong>Do you have a target net worth you are trying to attain?</strong></em></p>\n<p>I think I’ve reached my target net worth.</p>\n<p><em><strong>How old were you when you made your first million and have you had any significant behavior shifts since then?</strong></em></p>\n<p>I think I made my first million in the mid-30’s. Only recently have I shifted my behavior. I’ve always been frugal and that’s a characteristic that’s hard to change. I still try to buy things on sale, never order drinks at a restaurant, etc.</p>\n<p>Because I sold my practice, I’m “forced” to take vacation because I cannot accumulate the hours. I will now need to go on vacation.</p>\n<p><em><strong>What money mistakes have you made along the way that others can learn from?</strong></em></p>\n<p>After lending money to that individual, I’m gun shy to lend anyone money.</p>\n<p>I think I’m a control freak. Looking back, MAYBE I could have continued running my own office. I should have delegated more jobs to others. With medicine, the insurance companies may increase the premiums to their customers but they don’t share that with the physicians. With most insurances, I am paid the same amount I was paid 20 years ago so the only way to make more money is to see more patients and I already maxed out. With recent salary increases to the employees, I think I’m happy I sold my practice.</p>\n<p>I think because I’m frugal, I don’t want to pay 8% to a property manager to run the rental homes. Because I was doing everything myself, I burned out. Between being a doctor and managing my practice, I just could not do everything. I forgot which book I read but it mentioned that you should spend your energy making more money and not spending your time doing things that others can do for you for less money.</p>\n<p>Another mistake I made is to be friends with the tenants and when that happens, it’s very hard for me to increase the rent. Most of my houses are rented below value but I’m also lazy to try to clean them out and rent them again.</p>\n<p><em><strong>What advice do you have for ESI Money readers on how to become wealthy?</strong></em></p>\n<p>For me the stock market and real estate have helped me. I would invest as much as you feel comfortable slowly each month into the stock market. SP500 is great. You don’t need to think.</p>\n<p>If you want to buy houses, I would save up for a down payment of 25%. Be sure you can pay the mortgage if you have no tenant and know there are bad tenants. Buy in an area with good school districts so you attract those families. You can also use your house as a starter home and upgrade and rent your first house. That way, you have a lower down payment and lower interest rate. Location is the key and make sure you are in an area that has potential to grow. Make sure your state is landlord friendly.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>FUTURE</strong></span></h4>\n<p><em><strong>What are your plans for the future regarding lifestyle?</strong></em></p>\n<p>I just started working for this company. My contract is for two years. After that, I will decide if I like working for someone or just retire.</p>\n<p>Because I’m too young to qualify for Medicare and most of my friends are still working, I may just work enough hours to qualify for full time (30 hours) which should be easy. I just want the company to continue renting my property that I share with my sister.</p>\n<p><em><strong>What are your retirement plans?</strong></em></p>\n<p>I think I’ll just exercise more and take classes.</p>\n<p>I may help my sister by helping to care for my niece.</p>\n<p><em><strong>Are there any issues in retirement that concern you? If so, how are you planning to address them?</strong></em></p>\n<p>I’m afraid I’ll be bored so that’s why I may work enough to maintain full time status.</p>\n<p>I also need health insurance. I even thought of working for Starbuck’s part time just for health benefits and I don’t drink coffee!!</p>\n<h4><span style=\"text-decoration: underline;\"><strong>MISCELLANEOUS</strong></span></h4>\n<p><em><strong>How did you learn about finances and at what age did it &#8220;click&#8221;?</strong></em></p>\n<p>My parents have always been involved with real estate but I hated it as a child because they would always go over the weekends to repair the apartments themselves.</p>\n<p>My mom told me to invest and I would go to the library to read up on stocks. When I saw the investments grow to $100,000, that’s when it clicked.</p>\n<p><em><strong>Who inspired you to excel in life? Who are your heroes?</strong></em></p>\n<p>I owe everything to my parents. They came from another country and they are the American dream.</p>\n<p>They have always told me to work hard, save, and be frugal. Without them, I am nothing.</p>\n<p><em><strong>Do you have any favorite money books you like/recommend? If so, can you share with us your top three and why you like them?</strong></em></p>\n<p>I love “<a href=\"https://esimoney.com/the-best-personal-finance-books-of-all-time-the-millionaire-next-door/\">Millionaire Next Door</a>.”</p>\n<p>I always thought millionaires spent a lot of money and drove expensive cars. I found out they worked just like me and that’s how they became rich.</p>\n<p><em><strong>Do you give to charity? Why or why not? If you do, what percent of time/money do you give?</strong></em></p>\n<p>I do contribute to charity. I usually donate in times a crisis like Ukraine, hurricane, etc. I usually do it when someone is willing to double my contribution. I also donate to my undergraduate, kids in need like Kevin Durant Foundation, Opus 188 Harlem School of Music.</p>\n<p>Because my father recently died, he always wanted to set up a scholarship to help someone just like him and we will be doing that in his name this year. The university said that $100,000 would fund the scholarship for its lifetime.</p>\n<p><em><strong>Do you plan to leave an inheritance for your heirs (how do you plan to distribute your wealth at your death)? What are your reasons behind this plan?</strong></em></p>\n<p>I only have my sister and cousins. Right now, I have everything left to my sister but she has mentioned she doesn’t need all this so we will probably donate.</p>\n<p>I don’t think it’s good to have one person inherit so much. I think you appreciate money more when you have worked for it.</p>\n<p>I’ve opened 529 plans for my cousins’ kids. I think education is everything.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/millionaire-interview-338/\">Millionaire Interview 338</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "wfw:commentRss": "https://esimoney.com/millionaire-interview-338/feed/",
  "slash:comments": 25
}