{
  "title": "A Bayesian inference of relativistic mean-field model for neutron star matter from observation of NICER and GW170817/AT2017gfo. (arXiv:2211.02007v1 [astro-ph.HE])",
  "link": "http://arxiv.org/abs/2211.02007",
  "description": "<p>The observations of optical and near-infrared counterparts of binary neutron\nstar mergers not only enrich our knowledge about the abundance of heavy\nelements in the Universe, or help reveal the remnant object just after the\nmerger as generally known, but also can effectively constrain dense nuclear\nmatter properties and the equation of state (EOS) in the interior of the\nmerging stars. Following the relativistic mean-field description of nuclear\nmatter, we perform the Bayesian inference of the EOS and the nuclear matter\nproperties using the first multi-messenger event GW170817/AT2017gfo, together\nwith the NICER mass-radius measurements of pulsars. The kilonova is described\nby a radiation-transfer model with the dynamical ejecta, and light curves\nconnect with the EOS through the quasi-universal relations between the ejecta\nproperties (the ejected mass, velocity, opacity or electron fraction) and\nbinary parameters (the mass ratio and reduced tidal deformability). It is found\nthat the posterior distributions of the reduced tidal deformability from the\nAT2017gfo analysis display a bimodal structure, with the first peak enhanced by\nthe GW170817 data, leading to slightly softened posterior EOSs, while the\nsecond peak cannot be achieved by a nuclear EOS with saturation properties in\ntheir empirical ranges. The inclusion of NICER data in our analyses results in\nstiffened EOS posterior because of the massive pulsar PSR J0740+6620. We give\nresults at nuclear saturation density for the nuclear incompressibility, the\nsymmetry energy and its slope, as well as the nucleon effective mass, from our\nanalysis of those observational data.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Zhu_Z/0/1/0/all/0/1\">Zhenyu Zhu</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Li_A/0/1/0/all/0/1\">Ang Li</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+liu_T/0/1/0/all/0/1\">Tong liu</a>"
}