{
  "title": "#425: Half-Blood Prince in Review",
  "link": "https://audioboom.com/posts/7316571",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5066,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Fire at Leavesden Studios! Did it impact the Studio Tour at all? </li>\n<li>Almost all of the hosts have been leveling up in Wizards Unite!</li>\n<li>We'll be in Orlando this August for Podcast Movement and want to meet up with YOU at CityWalk!</li>\n<li>MuggleCasTBT takes us all the way back to 2006 for a final battle prediction!</li>\n<li>We tie up loose ends with our Harry Potter and the Half-Blood Prince book-in-review episode!</li>\n<li>14-Word Summary: Harry Potter and Dumbledore discover the secret about Lord Voldemort’s Horcruxes from the memories</li>\n<li>The hosts Rename the Book with some interesting titles and hand out their MVP of the Book awards</li>\n<li>Was Half-Blood Prince anyone's favorite book? Least favorite book? Patrons weigh in with their thoughts!</li>\n<li>From The Cave to the fake horcrux discovery, the hosts give their favorite and least favorite moments of Half-Blood Prince</li>\n<li>Horace Slughorn and Rufus Scrimgeour headline our most notable new characters</li>\n<li>What were the Top 7 Moments of Half-Blood Prince?</li>\n<li>We discuss several book-to-movie comparisons as well as Jim Broadbent's portrayal of Slughorn</li>\n<li>What lies ahead now that Half-Blood Prince is a wrap?</li>\n<li>Emails cover Elphias Doge, Ginny and Grindelwald's reaction to Dumbledore's death</li>\n<li>Voicemails include Dumbledore's movie tribute, Snape being labeled a coward and Death Eater tattoos</li>\n<li>Quizzitch: Which Harry Potter books do not have a chapter with the same name as their title?</li>\n<li>Send us your odds and ends thoughts from Sorcerer's Stone! Use the contact form, our voicemail line, or e-mail mugglecast@gmail.com directly</li>\n<li>This episode is brought to you by Thirdlove: Go to <a href=\"http://Thirdlove.com/MuggleCast\">Thirdlove.com/MuggleCast</a> to find your perfect bra and get 15% off your first purchase!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Mon, 15 Jul 2019 19:36:56 +0000",
  "guid": "tag:audioboom.com,2019-07-15:/posts/7316571",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}