{
  "title": "Methane research takes on new urgency at MIT",
  "link": "https://news.mit.edu/2022/methane-research-takes-new-urgency-mit-1102",
  "description": "Desiree Plata's research focuses on developing technologies and strategies for environmental sustainability.",
  "pubDate": "Wed, 02 Nov 2022 13:50:00 -0400",
  "guid": "https://news.mit.edu/2022/methane-research-takes-new-urgency-mit-1102",
  "dc:creator": "Eric Brown | MIT Industrial Liaison Program",
  "content:encoded": "<p>One of the most notable climate change provisions in the 2022 Inflation Reduction Act is the first U.S. federal tax on a greenhouse gas (GHG). That the fee targets methane (CH<sub>4</sub>), rather than carbon dioxide (CO<sub>2</sub>), emissions is indicative of the urgency the scientific community has placed on reducing this short-lived but powerful gas. Methane persists in the air about 12 years&nbsp;— compared to more than 1,000 years for CO<sub>2</sub> — yet it immediately causes about 120 times more warming upon release. The gas is responsible for at least a quarter of today’s gross warming.&nbsp;</p>\n\n<p>“Methane has a disproportionate effect on near-term warming,” says Desiree Plata, the director of <a href=\"http://methane.mit.edu/\">MIT Methane Network</a>. “CH<sub>4</sub> does more damage than CO<sub>2</sub> no matter how long you run the clock. By removing methane, we could potentially avoid critical climate tipping points.”&nbsp;</p>\n\n<p>Because GHGs have a runaway effect on climate, reductions made now will have a far greater impact than the same reductions made in the future. Cutting methane emissions will slow the thawing of permafrost, which could otherwise lead to massive methane releases, as well as reduce increasing emissions from wetlands.&nbsp;&nbsp;</p>\n\n<p>“The goal of MIT Methane Network is to reduce methane emissions by 45 percent by 2030, which would save up to 0.5 degree C of warming by 2100,” says Plata, an associate professor of civil and environmental engineering at MIT and director of the Plata Lab. “When you consider that governments are trying for a 1.5-degree reduction of all GHGs by 2100, this is a big deal.”&nbsp;</p>\n\n<p>Under normal concentrations, methane, like CO<sub>2</sub>, poses no health risks. Yet methane assists in the creation of high levels of ozone. In the lower atmosphere, ozone is a key component of air pollution, which leads to “higher rates of asthma and increased emergency room visits,” says Plata.&nbsp;</p>\n\n<p>Methane-related projects at the Plata Lab include a filter made of zeolite — the same clay-like material used in cat litter — designed to convert methane into CO<sub>2</sub> at dairy farms and coal mines. At first glance, the technology would appear to be a bit of a hard sell, since it converts one GHG into another. Yet the zeolite filter’s low carbon and dollar costs, combined with the disproportionate warming impact of methane, make it a potential game-changer.</p>\n\n<p>The sense of urgency about methane has been amplified by recent studies that show humans are generating far more methane emissions than previously estimated, and that the rates are rising rapidly. Exactly how much methane is in the air is uncertain. Current methods for measuring atmospheric methane, such as ground, drone, and satellite sensors, “are not readily abundant and do not always agree with each other,” says Plata.&nbsp;&nbsp;</p>\n\n<p>The Plata Lab is collaborating with Tim Swager in the MIT Department of Chemistry to develop low-cost methane sensors. “We are developing chemiresisitive sensors that cost about a dollar that you could place near energy infrastructure to back-calculate where leaks are coming from,” says Plata.&nbsp;&nbsp;</p>\n\n<p>The researchers are working on improving the accuracy of the sensors using machine learning techniques and are planning to integrate internet-of-things technology to transmit alerts. Plata and Swager are not alone in focusing on data collection: the Inflation Reduction Act adds significant funding for methane sensor research.&nbsp;</p>\n\n<p>Other research at the Plata Lab includes the development of nanomaterials and heterogeneous catalysis techniques for environmental applications. The lab also explores mitigation solutions for industrial waste, particularly those related to the energy transition. Plata is the co-founder of an lithium-ion battery recycling startup called Nth Cycle.&nbsp;</p>\n\n<p>On a more fundamental level, the Plata Lab is exploring how to develop products with environmental and social sustainability in mind. “Our overarching mission is to change the way that we invent materials and processes so that environmental objectives are incorporated along with traditional performance and cost metrics,” says Plata. “It is important to do that rigorous assessment early in the design process.”</p>\n<p><strong>MIT amps up methane research&nbsp;</strong></p>\n\n<p>The MIT Methane Network brings together 26 researchers from MIT along with representatives of other institutions “that are dedicated to the idea that we can reduce methane levels in our lifetime,” says Plata. The organization supports research such as Plata’s zeolite and sensor projects, as well as designing pipeline-fixing robots, developing methane-based fuels for clean hydrogen, and researching the capture and conversion of methane into liquid chemical precursors for pharmaceuticals and plastics. Other members are researching policies to encourage more sustainable agriculture and land use, as well as methane-related social justice initiatives.&nbsp;</p>\n\n<p>“Methane is an especially difficult problem because it comes from all over the place,” says Plata. A recent Global Carbon Project study estimated that half of methane emissions are caused by humans. This is led by waste and agriculture (28 percent), including cow and sheep belching, rice paddies, and landfills.&nbsp;&nbsp;</p>\n\n<p>Fossil fuels represent 18 percent of the total budget. Of this, about 63 percent is derived from oil and gas production and pipelines, 33 percent from coal mining activities, and 5 percent from industry and transportation. Human-caused biomass burning, primarily from slash-and-burn agriculture, emits about 4 percent of the global total.&nbsp;&nbsp;</p>\n\n<p>The other half of the methane budget includes natural methane emissions from wetlands (20 percent) and other natural sources (30 percent). The latter includes permafrost melting and natural biomass burning, such as forest fires started by lightning.&nbsp;&nbsp;</p>\n\n<p>With increases in global warming and population, the line between anthropogenic and natural causes is getting fuzzier. “Human activities are accelerating natural emissions,” says Plata. “Climate change increases the release of methane from wetlands and permafrost and leads to larger forest and peat fires.”&nbsp;&nbsp;</p>\n\n<p>The calculations can get complicated. For example, wetlands provide benefits from CO<sub>2</sub> capture, biological diversity, and sea level rise resiliency that more than compensate for methane releases. Meanwhile, draining swamps for development increases emissions.&nbsp;</p>\n\n<p>Over 100 nations have signed onto the U.N.’s Global Methane Pledge to reduce at least 30 percent of anthropogenic emissions within the next 10 years. The U.N. report estimates that this goal can be achieved using proven technologies and that about 60 percent of these reductions can be accomplished at low cost.&nbsp;</p>\n\n<p>Much of the savings would come from greater efficiencies in fossil fuel extraction, processing, and delivery. The methane fees in the Inflation Reduction Act are primarily focused on encouraging fossil fuel companies to accelerate ongoing efforts to cap old wells, flare off excess emissions, and tighten pipeline connections.&nbsp;&nbsp;</p>\n\n<p>Fossil fuel companies have already made far greater pledges to reduce methane than they have with CO<sub>2</sub>, which is central to their business. This is due, in part, to the potential savings, as well as in preparation for methane regulations expected from the Environmental Protection Agency in late 2022. The regulations build upon existing EPA oversight of drilling operations, and will likely be exempt from the U.S. Supreme Court’s ruling that limits the federal government’s ability to regulate GHGs.&nbsp;</p>\n\n<p><strong>Zeolite filter targets methane in dairy and coal&nbsp;</strong></p>\n\n<p>The “low-hanging fruit” of gas stream mitigation addresses most of the 20 percent of total methane emissions in which the gas is released in sufficiently high concentrations for flaring. Plata’s zeolite filter aims to address the thornier challenge of reducing the 80 percent of non-flammable dilute emissions.&nbsp;</p>\n\n<p>Plata found inspiration in decades-old catalysis research for turning methane into methanol. One strategy has been to use an abundant, low-cost aluminosilicate clay called zeolite.&nbsp;&nbsp;</p>\n\n<p>“The methanol creation process is challenging because you need to separate a liquid, and it has very low efficiency,” says Plata. “Yet zeolite can be very efficient at converting methane into CO<sub>2</sub>, and it is much easier because it does not require liquid separation. Converting methane to CO<sub>2</sub> sounds like a bad thing, but there is a major anti-warming benefit. And because methane is much more dilute than CO<sub>2</sub>, the relative CO<sub>2</sub> contribution is minuscule.”&nbsp;&nbsp;</p>\n\n<p>Using zeolite to create methanol requires highly concentrated methane, high temperatures and pressures, and industrial processing conditions. Yet Plata’s process, which dopes the zeolite with copper, operates in the presence of oxygen at much lower temperatures under typical pressures. “We let the methane proceed the way it wants from a thermodynamic perspective from methane to methanol down to CO<sub>2</sub>,” says Plata.&nbsp;</p>\n\n<p>Researchers around the world are working on other dilute methane removal technologies. Projects include spraying iron salt aerosols into sea air where they react with natural chlorine or bromine radicals, thereby capturing methane. Most of these geoengineering solutions, however, are difficult to measure and would require massive scale to make a difference.&nbsp;&nbsp;</p>\n\n<p>Plata is focusing her zeolite filters on environments where concentrations are high, but not so high as to be flammable. “We are trying to scale zeolite into filters that you could snap onto the side of a cross-ventilation fan in a dairy barn or in a ventilation air shaft in a coal mine,” says Plata. “For every packet of air we bring in, we take a lot of methane out, so we get more bang for our buck.”&nbsp;&nbsp;</p>\n\n<p>The major challenge is creating a filter that can handle high flow rates without getting clogged or falling apart. Dairy barn air handlers can push air at up to 5,000 cubic feet per minute and coal mine handlers can approach 500,000 CFM.&nbsp;</p>\n\n<p>Plata is exploring engineering options including fluidized bed reactors with floating catalyst particles. Another filter solution, based in part on catalytic converters, features “higher-order geometric structures where you have a porous material with a long path length where the gas can interact with the catalyst,” says Plata. “This avoids the challenge with fluidized beds of containing catalyst particles in the reactor. Instead, they are fixed within a structured material.”&nbsp;&nbsp;</p>\n\n<p>Competing technologies for removing methane from mine shafts “operate at temperatures of 1,000 to 1,200 degrees C, requiring a lot of energy and risking explosion,” says Plata. “Our technology avoids safety concerns by operating at 300 to 400 degrees C. It reduces energy use and provides more tractable deployment costs.”&nbsp;</p>\n\n<p>Potentially, energy and dollar costs could be further reduced in coal mines by capturing the heat generated by the conversion process. “In coal mines, you have enrichments above a half-percent methane, but below the 4 percent flammability threshold,” says Plata. “The excess heat from the process could be used to generate electricity using off-the-shelf converters.”&nbsp;</p>\n\n<p>Plata’s dairy barn research is funded by the Gerstner Family Foundation and the coal mining project by the U.S. Department of Energy. “The DOE would like us to spin out the technology for scale-up within three years,” says Plata. “We cannot guarantee we will hit that goal, but we are trying to develop this as quickly as possible. Our society needs to start reducing methane emissions now.”&nbsp;</p>",
  "media:content": {
    "media:description": "“The goal of MIT Methane Network is to reduce methane emissions by 45 percent by 2030, which would save up to 0.5 degree C of warming by 2100,” says Associate Professor Desiree Plata. “When you consider that governments are trying for a 1.5-degree reduction of all GHGs by 2100, this is a big deal.”",
    "media:credit": "Photo: David Sella"
  },
  "category": [
    "Civil and environmental engineering",
    "Industry",
    "Greenhouse gases",
    "Emissions",
    "Carbon Emissions",
    "Methane",
    "Global Warming",
    "Climate change",
    "Sustainability",
    "Ozone",
    "Chemistry",
    "Sensors",
    "Data",
    "Department of Energy (DoE)",
    "Research",
    "School of Engineering",
    "School of Science"
  ]
}