{
  "title": "Looking at 2019 NFC East Offensive Spending vs. Production with nflfastR",
  "description": "<p>I have been following <a href=\"https://github.com/maksimhorowitz/nflscrapR\">nflscrapR</a> and NFL analytics community on Twitter for a while now and digging into the package has long been an item on my to-do list. With a lot more free time on my hands due to the pandemic and the recent release of <a href=\"https://github.com/mrcaseb/nflfastR\">nflfastR</a>, a new</p>",
  "link": "https://www.danielforsyth.me/looking-at-2019-nfc-east-spending-and-production-with-nfl/",
  "guid": "5efbd731ee06a20039ef71df",
  "dc:creator": "Daniel Forsyth",
  "pubDate": "Wed, 08 Jul 2020 16:55:25 GMT",
  "content:encoded": "<p>I have been following <a href=\"https://github.com/maksimhorowitz/nflscrapR\">nflscrapR</a> and NFL analytics community on Twitter for a while now and digging into the package has long been an item on my to-do list. With a lot more free time on my hands due to the pandemic and the recent release of <a href=\"https://github.com/mrcaseb/nflfastR\">nflfastR</a>, a new package which builds on nflscrapr, I decided it was time to dive in. </p><p>If you are not familiar nflscrapR, and now nflfastR, are packages that pull play-by-play data from the NFL API and then parse the text description of each play to give you a cleaned up, analysis ready dataset. Open source sports data is hard to come by so the package(s) and community around them have become quite popular. On top of the play-by-play data they also includes built in models such as Expected Points (EP) and Win Probability (WP). </p><p>If you are not familiar with EP or WP the original paper is available <a href=\"https://arxiv.org/abs/1802.00998\">here</a>. To summarize:</p><h3 id=\"expected-points\">Expected Points </h3><p>At its core EP looks at the current in-game situation and, using a model trained on historical play-by-play data, says based on the current in-game situation what do teams typically go on to do. To accomplish this EP uses a multinomial logistic regression model to estimate the expected points for a given situation. It takes the following input features:</p><ul><li>Current down</li><li>Number of seconds remaining in the half</li><li>Yards from the endzone</li><li>A log transform of yards to go for a first down</li><li>A binary indicator for whether or not it is a goal down situation</li><li>Another binary indicator for whether or not there is less than two minutes remaining in the half </li></ul><p>The model uses these features, which describe the current in-game drive situation, to estimate the probabilities of the response variable which in this scenario is every possible drive outcome:</p><ul><li>Touchdown (7)</li><li>Field Goal (3)</li><li>Safety (2)</li><li>No Score (0)</li><li>&#x2212;Touchdown (-7)</li><li>&#x2212;Field Goal (-3)</li><li>&#x2212;Safety (-2) </li></ul><p>Finally it takes these predicted probabilities and multiplies them by their respective point values to get the Expected Points of that particular situation. </p><h3 id=\"win-probability\">Win Probability</h3><p>WP follows the same framework but instead of asking what do teams go on to do during a drive in this situation it asks how often does a team in this situation <em>win the game.</em> WP also uses a different model, a generalized additive model, as well as a different set of features to describe the game state:</p><ul><li>Expected score differential</li><li>Number of seconds remaining in game</li><li>Expected score time ratio</li><li>Current half of the game (1st, 2nd, or overtime)</li><li>Number of seconds remaining in half</li><li>Indicator for whether or not time remaining in half is<br>under two minutes</li><li>Time outs remaining for offensive (possession) team</li><li>Time outs remaining for defensive team</li></ul><h3 id=\"epa-and-wpa\">EPA and WPA</h3><p>With both EP and WP the core value comes when you look at the difference in values between two plays. If you consider the current play Vi and the following play Vf you can place either EP or WP in and calculate Vf-Vi to determine the <em>Expected Points Added</em> (EPA) and <em>WPA</em> (Win Probability Added) of that particular play. As an Eagles fan I particularly enjoyed this example from the paper:</p><blockquote>During Super Bowl LII the Philadelphia Eagles&#x2019; Nick Foles received a touchdown when facing fourth down on their opponent&#x2019;s one yard line with thirty-eight seconds remaining in the half. At the start of the play the Eagles&#x2019; expected points was V i &#x2248; 2.78, thus resulting in EPA &#x2248; 7 &#x2212; 2.78 = 4.22. In an analogous calculation, this famous play known as the &#x201C;Philly special&#x201D; resulted in WPA &#x2248; 0.1266 as the Eagles&#x2019; increased their lead before the end of the half.</blockquote><!--kg-card-begin: html--><iframe src=\"https://giphy.com/embed/JPTn4ykXUDuvu\" width=\"480\" height=\"270\" frameborder=\"0\" class=\"giphy-embed\" allowfullscreen></iframe><p><a href=\"https://giphy.com/gifs/special-philly-JPTn4ykXUDuvu\">via GIPHY</a></p><!--kg-card-end: html--><h3 id=\"2019-nfc-east-offensive-spending\">2019 NFC East Offensive Spending</h3><p>For my own analysis I wanted to look into the 2019 NFC East offensive spending and see how offensive production compared. I was able to pull salary data from <a href=\"https://www.spotrac.com/nfl\">spotrac</a> to put together the below chart on spending by team and position. </p><!--kg-card-begin: html--><img alt=\"Image Description\" src=\"https://www.danielforsyth.me/content/images/2020/07/Rplot-1.png\" style=\"width: 667px; height:386px\"><!--kg-card-end: html--><p>Some quick takeaways from this:</p><ul><li>Dak was on the last year of his rookie contract so the Cowboys were spending very little on quarterbacks.</li><li>On the other end of the spectrum Eli Manning was also on the final year of his deal but took home 23M or almost 12% of the entire Giants cap space.</li><li>All four teams in the division spent roughly the same amount on running backs.</li><li>Washington spent nearly double the rest of division on tight ends with Jordan Reed and Vernon Davis both on lucrative deals, both of whom ended up on the IR.</li><li>Dallas spent the most out of the group in wide receivers - and for good reason.</li></ul><h3 id=\"spending-vs-production\">Spending vs. Production</h3><p>Next I wanted to see how this spending compared to the offensive output of each position. To do this I looked at the average EPA per play by position and compared it to the cap % spent. I should state that this approach is rather crude and does have its limitations:</p><ol><li>EPA is based on the outcome of the entire play which consists of 11 offensive players. Theoretically the credit should be divided among these players and not given solely to the one key offensive player involved. </li><li>You need to consider certain players contracts in the context of their career progression like Dak and Eli.</li></ol><p>That being said EPA can work well as a proxy measure and I thought this would be an interesting way to get my feet wet with NFL data. </p><!--kg-card-begin: html--><img alt=\"Image Description\" src=\"https://www.danielforsyth.me/content/images/2020/07/qb_plot.png\" style=\"width: 766px; height:491px\"><!--kg-card-end: html--><!--kg-card-begin: html--><img alt=\"Image Description\" src=\"https://www.danielforsyth.me/content/images/2020/07/rb_plot_1.png\" style=\"width: 766px; height:491px\"><!--kg-card-end: html--><!--kg-card-begin: html--><img alt=\"Image Description\" src=\"https://www.danielforsyth.me/content/images/2020/07/wr_plot.png\" style=\"width: 766px; height:491px\"><!--kg-card-end: html--><!--kg-card-begin: html--><img alt=\"Image Description\" src=\"https://www.danielforsyth.me/content/images/2020/07/te_plot.png\" style=\"width: 766px; height:491px\"><!--kg-card-end: html--><p>Takeaways:</p><p><em>Quarterbacks</em> - Its hard to gauge too much here due to Dak and Eli's situations but you can see just how valuable Dak was to the Cowboys and that they're going to have to empty the bank to secure him long term. </p><p><em>Running Backs</em> - All four teams are pretty tightly clustered here which is in line with the NFL analytics communities darling mantra that <em>running backs don't matter.</em></p><p><em>Wide Receivers</em> - Washington, New York and Philadelphia paid between five to ten percent of cap on their receivers and all got roughly the same output while the Cowboys paid a bit more and got significantly higher output from their star receiving core.</p><p><em>Tight Ends</em> - Washington spent more than twice the rest of the division on tight ends and ended up with an average EPA per play less the -.1. This was mostly due to bad fortune with Jordan Reed and Vernon Davis both suffering concussions and missing all or most of the season respectively. </p><p>While this analysis was interesting I think a logical next step with would be to factor in offensive line ratings for each team as you can imagine a good line will: give the quarterback more time in the pocket, create more room for running backs, and give tight ends and receivers more time to run their routes. This would alleviate some of the credit distribution issues without getting into more complex modeling. It would also be interesting to look more into individual players and their value as well as how this changes throughout their career.</p><p>If you have any questions, feedback, advice, or corrections please get in touch with me on <a href=\"https://twitter.com/Daniel_Forsyth1\">Twitter</a> or email me - link on sidebar. Also wanted to give a shoutout to the developers of both nflscrapR and nflfastR for creating such useful tools that allow anyone to get involved in the NFL data world. </p>"
}