{
  "title": "Private Semi-supervised Knowledge Transfer for Deep Learning from Noisy Labels. (arXiv:2211.01628v1 [cs.LG])",
  "link": "http://arxiv.org/abs/2211.01628",
  "description": "<p>Deep learning models trained on large-scale data have achieved encouraging\nperformance in many real-world tasks. Meanwhile, publishing those models\ntrained on sensitive datasets, such as medical records, could pose serious\nprivacy concerns. To counter these issues, one of the current state-of-the-art\napproaches is the Private Aggregation of Teacher Ensembles, or PATE, which\nachieved promising results in preserving the utility of the model while\nproviding a strong privacy guarantee. PATE combines an ensemble of \"teacher\nmodels\" trained on sensitive data and transfers the knowledge to a \"student\"\nmodel through the noisy aggregation of teachers' votes for labeling unlabeled\npublic data which the student model will be trained on. However, the knowledge\nor voted labels learned by the student are noisy due to private aggregation.\nLearning directly from noisy labels can significantly impact the accuracy of\nthe student model.\n</p>\n<p>In this paper, we propose the PATE++ mechanism, which combines the current\nadvanced noisy label training mechanisms with the original PATE framework to\nenhance its accuracy. A novel structure of Generative Adversarial Nets (GANs)\nis developed in order to integrate them effectively. In addition, we develop a\nnovel noisy label detection mechanism for semi-supervised model training to\nfurther improve student model performance when training with noisy labels. We\nevaluate our method on Fashion-MNIST and SVHN to show the improvements on the\noriginal PATE on all measures.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Zhang_Q/0/1/0/all/0/1\">Qiuchen Zhang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ma_J/0/1/0/all/0/1\">Jing Ma</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lou_J/0/1/0/all/0/1\">Jian Lou</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xiong_L/0/1/0/all/0/1\">Li Xiong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Jiang_X/0/1/0/all/0/1\">Xiaoqian Jiang</a>"
}