{
  "title": "AOC HUMILIATED Over Funding Nuclear War",
  "itunes:title": "AOC HUMILIATED Over Funding Nuclear War",
  "pubDate": "Fri, 21 Oct 2022 05:30:00 +0000",
  "guid": "c560f84e-59ec-4983-9cfa-bad596cdcfec",
  "link": "https://thejimmydoreshow.libsyn.com/aoc-humiliated-over-funding-nuclear-war",
  "itunes:image": "",
  "description": "<p>During a recent sparsely attended town hall event, Congresswoman Alexandria Ocasio-Cortez was confronted by anti-war activists who demanded that AOC stop supporting the war in Ukraine that is rapidly leading the US and Russia to the brink of nuclear war. Instead of engaging with her critics, Congresswoman Ocasio-Cortez called the activists “rude,” insisted they wait their turn in line and later upbraided them for shouting over a deaf constituent who she alleged had been trying to speak.</p> <p>Jimmy and America’s Comedian Kurt Metzger discuss AOC’s rank hypocrisy and how she used to emphasize the importance of activists holding the powerful to account even if it means making them uncomfortable.<br /> <br /> Plus a segment on a Pfizer executive's admission to the European Parliament that the company's COVID vaccine was not tested for transmissibility before gaining approval for distribution.<br /> <br /> Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Harrison Ford and the duo of Barack Obama and James Carville!</p>",
  "content:encoded": "<p>During a recent sparsely attended town hall event, Congresswoman Alexandria Ocasio-Cortez was confronted by anti-war activists who demanded that AOC stop supporting the war in Ukraine that is rapidly leading the US and Russia to the brink of nuclear war. Instead of engaging with her critics, Congresswoman Ocasio-Cortez called the activists “rude,” insisted they wait their turn in line and later upbraided them for shouting over a deaf constituent who she alleged had been trying to speak.</p> <p>Jimmy and America’s Comedian Kurt Metzger discuss AOC’s rank hypocrisy and how she used to emphasize the importance of activists holding the powerful to account even if it means making them uncomfortable.  Plus a segment on a Pfizer executive's admission to the European Parliament that the company's COVID vaccine was not tested for transmissibility before gaining approval for distribution.  Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Harrison Ford and the duo of Barack Obama and James Carville!</p>",
  "enclosure": "",
  "itunes:duration": "01:03:32",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "During a recent sparsely attended town hall event, Congresswoman Alexandria Ocasio-Cortez was confronted by anti-war activists who demanded that AOC stop supporting the war in Ukraine that is rapidly leading the US and Russia to the brink of nuclear...",
  "itunes:episodeType": "full",
  "itunes:summary": "During a recent sparsely attended town hall event, Congresswoman Alexandria Ocasio-Cortez was confronted by anti-war activists who demanded that AOC stop supporting the war in Ukraine that is rapidly leading the US and Russia to the brink of nuclear war. Instead of engaging with her critics, Congresswoman Ocasio-Cortez called the activists “rude,” insisted they wait their turn in line and later upbraided them for shouting over a deaf constituent who she alleged had been trying to speak. Jimmy and America’s Comedian Kurt Metzger discuss AOC’s rank hypocrisy and how she used to emphasize the importance of activists holding the powerful to account even if it means making them uncomfortable. Plus a segment on a Pfizer executive's admission to the European Parliament that the company's COVID vaccine was not tested for transmissibility before gaining approval for distribution. Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Harrison Ford and the duo of Barack Obama and James Carville!"
}