{
  "title": "Making Smart Phones Dumb Again",
  "link": "",
  "published": "2017-09-07T08:00:00-07:00",
  "updated": "2017-09-07T08:00:00-07:00",
  "author": {
    "name": "Wes McKinney"
  },
  "id": "tag:wesmckinney.com,2017-09-07:/blog/dumb-smartphones/",
  "summary": "<h2>Modern Day Gollums</h2>\n<p>You can see the hype building. The rabid, foamed-mouth speculation. Apple is\nabout to release a new, never-before-seen iPhone model. Edge-to-edge screen,\n<a href=\"https://www.cnet.com/news/iphone-8-home-button-biggest-change/\">no home button</a>?  <a href=\"http://time.com/4927440/iphone-8-edition-names/\">What will it be called?</a> You can see the upcoming\nqueue at the Apple Store, the zombies lining up for the feeding …</p>",
  "content": "<h2>Modern Day Gollums</h2>\n<p>You can see the hype building. The rabid, foamed-mouth speculation. Apple is\nabout to release a new, never-before-seen iPhone model. Edge-to-edge screen,\n<a href=\"https://www.cnet.com/news/iphone-8-home-button-biggest-change/\">no home button</a>?  <a href=\"http://time.com/4927440/iphone-8-edition-names/\">What will it be called?</a> You can see the upcoming\nqueue at the Apple Store, the zombies lining up for the feeding. <em>My\nprecious...</em></p>\n<p>For many people nowadays, the smart phone has become the single most important\nobject in their lives. In public places (like public transportation, cafés, or\nrestaurants), I frequently see the vast majority of people glued to their\nphones, often ignoring the people they're there with.</p>\n<p>Once upon a time, it was thought that smart phones were created to improve our\nlives. Think how much time you'll save! Access to the whole of the world's\ninformation in a tiny form factor that also happens to take great pictures. I\nworry that exactly the opposite is happening, that current-day smart phones are\nhurting us more as a people than they are helping.</p>\n<p>I don't have any answers, but I'll tell you how I'm coping with it.</p>\n<h2>Our Minds, Addled by Push Notifications</h2>\n<p>A recent <a href=\"https://www.wired.com/story/turn-off-your-push-notifications/\">Wired article</a> proclaimed, \"Push notifications are ruining my\nlife. Yours too, I bet.\"</p>\n<p>If you value deep thought and creativity, it's hard to argue with this. Phone\napps have been optimized for <em>microengagement</em>, slurping up little bits of your\ntime and figuring out how to get you to come back as soon as possible for your\nnext hit. Every favorite, every like, every Snap is a tiny dopamine fix that\nleaves you yearning for more. The phone is a slot machine that is always paying\nout.</p>\n<p>App developers are not evil people (well, not <em>all</em> of them), but fine-grained\ndata collection and A/B testing may have had unintended consequences. Every\naspect of every app has been vigorously optimized for engagement and\nrevenue. They're supposed to be addictive. Smart phones have become <strong>revenue\nsyphons</strong>. Your data is a commodity that is sliced and diced and sold to the\nhighest bidder. Advertisers bid on ad space based on your internet behavior. As\nsomeone once quipped (and I can't find the original quote), \"Facebook knows\nwhat you do with your friends; Google knows what you do when you're alone.\"</p>\n<h2>A Message from the Universe</h2>\n<p>Steve Jobs famously said that the 4-inch iPhone was the perfect size. In 2014,\nI upgraded to an iPhone 6, the first with a larger form factor. Something\ndidn't seem right. It was too big. What was worse, I found myself spending more\ntime on the phone. This was a device that was more about content consumption\nthan about living your life.</p>\n<p>A little over a year later, I sold my iPhone 6 and \"downgraded\" to a 4-inch\niPhone SE. This was fine for a while, but I continued to be skeptical about how\nmuch time I was spending staring at my phone. I found it was especially bad\nwhen I was stressed out or procrastinating. I deleted social media apps like\nFacebook and Twitter and tried to train myself not to mindlessly look at\ne-mail, news, or time-wasting internet sites. The results were mixed.</p>\n<p>Then Donald Trump got elected President of the United States. I'm a fairly\napolitical humanist, but regardless of your affiliations you can probably agree\nthat the news has been a continuous tire fire since last November. I found\nmyself looking at the news more and more and my stress levels escalating.</p>\n<p>In July of this year, I was visiting Portland and hung out with my friend\nKevin. I had been thinking about ditching my smart phone, and while we were\ntalking shop he mentioned his <a href=\"https://keminglabs.com/talks/#bangbangcon2015\">dumb phone project</a>. My resolve to do\nsomething about the phone situation became firmer.</p>\n<p>When I think about this topic, it always brings to mind the <a href=\"https://www.youtube.com/watch?v=Pe-zq4bFPFU\">Technology Loop\nsketch</a> from Portlandia. In it, Fred Armisen is bouncing around between\ndifferent devices and has a mini-meltdown (watch the video, it's only 2\nminutes). So as I was leaving Portland a couple of days after hanging out with\nKevin, I was in line for a flight to Burbank and... <em>there's Fred Armisen\nboarding my flight</em>. It was a Message from the Universe.</p>\n<h2>Dumb Phones, Data Zombies, and the Future</h2>\n<p>After a few days of contemplation between different kinds of \"dumb phones\"\n(like flip phones), I decided rather than going \"full dumb phone\" that I would\ninstead get the <em>dumbest smart phone I could find</em>. It needs to do:</p>\n<ul>\n<li>Text messages with with physical or virtual keyboard</li>\n<li>Phone calls (with Bluetooth for hands-free)</li>\n<li>Pictures and MMS</li>\n<li>Ability to Google things in a pinch</li>\n<li>Possibly some forms of maps (but not a hard requirement)</li>\n<li>Not be Android or iOS-based, because that's a gateway to the phone apps I'm\n  trying to avoid</li>\n</ul>\n<p>The best option I've found is a ... Blackberry. I was able to pick up a <a href=\"http://amzn.to/2wJuLiw\">Q10\nfrom Amazon</a> for about $100, one of the last phones Blackberry made before\ngoing out of business. I switched from my $60/month data zombie plan with\nT-Mobile to a $25/month plan from <a href=\"https://www.simplemobile.com\">Simple Mobile</a>. So far it's going great.</p>\n<p>I still have my old iPhone at home which I need for various random tasks, but I\nam quite happy to no longer be tethered to the internet 24/7. I've been\nenjoying leaving the home and spending time with friends without even having\nthe option to look at the internet in a meaningful way (the Blackberry being so\ncrippled by modern standards). There's other options like the <a href=\"https://www.thelightphone.com\">Light Phone</a>\nto consider, too.</p>\n<p>I hope that, in the future, some phone option exists which is optimized for\nhelping you live a productive and mindful existence that is more focused on\ncreativity and engaging with people. I find that my best ideas occur after\nperiods of deep thought, and I've already found it more beneficial to spend my\nidle moments thinking about things instead of mindlessly poking around apps.</p>\n<p>I'm not sure how to make this happen so long as smart phones provide a conduit\nfor internet businesses to monetize your attention span. If anyone reading has\nany ideas, I would love to hear about them.</p>"
}