{
  "title": "TU158: Are You Cool, or Just Cut Off?  Dismissing/Avoidant Styles of Relating in Adulthood &#8211; REPLAY",
  "link": "https://therapistuncensored.com/episodes/replay-tu59-are-you-cool-or-just-cut-off-dismissing-avoidant-styles-of-relating-in-adulthood/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=replay-tu59-are-you-cool-or-just-cut-off-dismissing-avoidant-styles-of-relating-in-adulthood",
  "pubDate": "Tue, 05 Oct 2021 06:25:16 +0000",
  "guid": "https://therapistuncensored.com/?p=11917",
  "description": "This is the first in a loosely organized 3 episode series on the basics of modern attachment. New season starts Nov 1.  You may think you are calm cool and collected, but ask around.  :)  This episode pairs with the next 2 in discussing attachment patterns in adulthood and are the core content from which we will pick up again Season 6.  We keep learning a lot and updating our model so tune in and see where we go with it over time, okay?",
  "enclosure": "",
  "itunes:subtitle": "For the \"talk to the hand\" sort of people... you know who you are (or let&#039;s say, those close to you know who you are!)",
  "itunes:summary": "Don&#039;t be fooled by the illusion of security. This episode is especially for those “talk to the hand” kind of people or those that love them. You know, the uber-independent, rational, left-brain, excel spreadsheet person that sees others emotions as needy and weak.<br />\n<br />\nCo-hosts Sue Marriott LCSW, CGP and Ann Kelley PhD translate decades of research and clinical experience into easy to understand usable points to help you improve your understanding of why people appear so irrational at times. They talk about how internal working models of the world are formed outside of our awareness in our early life and how they get passed forward over time, sometimes causing relationship trouble.<br />\n<br />\nEarly stress responses and relationships create a pathway, and how we talk not what we say are clues to which pathway we may be on. This episode specifically focuses on the blue side of the spectrum, which you may be familiar from research as Dismissive or Avoidant.<br />\n<br />\nHosts also discuss how an individual can move towards the secure middle of the spectrum and why it is important to integrate logic with emotion. www.therapistuncensored.com/episodes",
  "itunes:author": "Sue Marriott, Ann Kelley",
  "itunes:image": "",
  "itunes:season": 5,
  "itunes:episode": 158,
  "itunes:title": "Are You Cool or Just Cut Off?  Dismissing/Avoidant Attachment",
  "itunes:duration": "36:12"
}