{
  "title": "Attachment-Focused EMDR &#8211; Tools &#038; Techniques to Heal Trauma with Dr. Laurel Parnell (170)",
  "link": "https://therapistuncensored.com/episodes/emdr-170/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=emdr-170",
  "pubDate": "Tue, 01 Mar 2022 07:10:39 +0000",
  "guid": "https://therapistuncensored.com/?p=12613",
  "description": "A theory around trauma is that when it occurs it \"gets locked in the nervous system\" and the way in which the body stores the trauma - in the form of thoughts, feelings, and bodily sensations - can be left fragmented, therefore delaying true healing. Eye Movement Desensitization and Reprocessings, also known as EMDR, is an evolving science that utilizes bilateral stimulation to help connect the left side of the brain to the right in order to form more cohesive, healing thoughts to better support the healing process. Tune in for this episode as co-host Dr. Ann Kelley and Dr. Parnell take a deep dive into the evolution and successes of EMDR.",
  "enclosure": "",
  "itunes:subtitle": "A theory around trauma is that when it occurs it \"gets locked in the nervous system\" and the way in which the body stores the trauma - in the form of thoughts, feelings, and bodily sensations - can be left fragmented, therefore delaying true healing.",
  "itunes:summary": "When talk therapy isn't enough<br />\nHow Attachment-Focused EMDR works and when to use it<br />\nWhile talk therapy can be an incredible resource for working through and healing traumas - sometimes it is not enough. The theory around trauma is that when it occurs it \"gets locked in the nervous system\" in the form of fragmented thoughts, feelings, and bodily sensations. This makes true healing difficult.  Eye Movement Desensitization and Reprocessing, also known as EMDR, is an evolving science that utilizes bilateral stimulation to help connect the left side of the brain to the right in order to form more cohesive, healing thoughts to better support the healing process.<br />\n<br />\nDr. Laurel Parnell is a leading expert in EMDR, and uses her vast knowledge to help train thousands of clinicians worldwide to spread the safe science. Using the \"lighting it up and linking it up\" methodology combined with the Four Foundational Resources, Parnell helps individuals suffering from PTSD and other obstacles better navigate their world and release some of the tension stored within the body and mind. Tune in for this episode as co-host Dr. Ann Kelley and Dr. Parnell take a deep dive into the evolution and successes of EMDR.<br />\n<br />\n<br />\n&nbsp;<br />\n<br />\n\"...people can spend years in talk therapy working through some horrible accident, and they're not getting better because the therapy isn't reaching where the trauma's stored and it's not helping with that integration of the nonverbal experience...\"<br />\n<br />\n<a style=\"color: #000000;\" href=\"http://therapistuncensored.com/join\">J</a><a style=\"color: #000000;\" href=\"http://therapistuncensored.com/join\">oin</a><a style=\"color: #000000;\" href=\"http://therapistuncensored.com/join\"> our Therapist Uncensored online community </a>as a TU Neuronerd and help support getting this content out to the world.<a href=\"http://therapistuncensored.com/join\"> </a><br />\nFor deeper dives into topics and extra episodes, join our online community for as little as $5 a month and get deep-dive content, ad-free feed, Ask Me Anything sessions, discounts on anything we produce and unique study opportunities. <br />\nAbout Laurel Parnell<br />\n<br />\n<br />\nClinical psychologist and director of the Parnell Institute for Attachment-Focused EMDR, Dr. Laurel Parnell is a leading expert on Eye Movement Desensitization and Reprocessing (EMDR). She has served on the faculty of the California Institute for Integral Studies in San Francisco, as well as at John F. Kennedy University. Parnell is also the co-director of the non-profit Trauma Assistance Program-International, \"TAP-IN\". She has dedicated her life to training thousands of clinicians both nationally and internationally and is the author of six books on EMDR.<br />\n<br />\n&nbsp;<br />\nTime Stamps<br />\n1:11 - What we do with EMDR<br />\n<br />\n5:44 - Introducing the Four Foundational Resources<br />\n<br />\n12:30 - Explanation of what Standard EMDR looks like<br />\n<br />\n16:05 - Breaking Down Bilateral Stimulation<br />\n<br />\n21:12 - The Connection between REM Sleep & EMDR<br />\n<br />\n27:49 - \"Little T\" Traumas and \"Big T\" Traumas<br />\n<br />\n29:57 - \"Creating Ideal Communities\" for Healing<br />\n<br />\n35:22 - Integrating Attachment-Focused EMDR<br />\n<br />\n46:53 - How to Integrate EMDR Virtually<br />\n<br />\n53:04 - Making Modifications to the Practice<br />\n<br />\n1:06:55 - Understanding EMDR Timelines<br />\nResources<br />\n<a href=\"https://drlaurelparnell.com/\">Dr. Laurel Parnell's Website</a><br />\n<br />\n<a href=\"https://parnellemdr.com/\">Parnell Institute EMDR Website</a><br />\n<br />\n<a href=\"https://parnellemdr.com/trainings-workshops/\">EMDR Training Workshops</a><br />\n<br />\n<a href=\"https://www.facebook.com/groups/698283370573947\">Parnell Institute Facebook Group </a><br />\n<br />\n<a href=\"https://parnellemdr.com/members/\">Find an EMDR Trained Therapist </a><br />\n<br />\n",
  "itunes:author": "Sue Marriott LCSW, CGP & Ann Kelley PhD",
  "itunes:image": "",
  "itunes:season": 6,
  "itunes:episode": 170,
  "itunes:title": "Attachment-Focused EMDR - Tools & Techniques to Heal Trauma with Dr. Laurel Parnell",
  "itunes:duration": "1:11:30"
}