{
  "title": "Episode 84: How To Make Learning Fun Again Part 1 - Piaget",
  "pubDate": "Mon, 19 Jan 2009 19:55:04 +0000",
  "guid": "episode-84-how-to-make-learning-fun-again-part-1",
  "link": "http://www.thepsychfiles.com/2009/01/19/episode-84-how-to-make-learning-fun-again-part-1-piaget/",
  "itunes:image": "",
  "description": "How can we make learning as fun as it was when you were a child?  We can.  Listen to Dr. Eugene Geist as he explains the cognitive development theories of Jean Piaget and you'll understand why we are all geared to learn.  We actively seek out learning experiences.  How can we keep that excitement alive?  Find out in this episode and in the episodes to follow as we examine ideas such as constructivism, problem-based learning, inquiry-based learning and democratic schools.  This episode will also be helpful if you need to learn the different stages of Piaget's theory of cognitive development.",
  "content:encoded": "How can we make learning as fun as it was when you were a child?  We can.  Listen to Dr. Eugene Geist as he explains the cognitive development theories of Jean Piaget and you'll understand why we are all geared to learn.  We actively seek out learning experiences.  How can we keep that excitement alive?  Find out in this episode and in the episodes to follow as we examine ideas such as constructivism, problem-based learning, inquiry-based learning and democratic schools.  This episode will also be helpful if you need to learn the different stages of Piaget's theory of cognitive development.",
  "enclosure": "",
  "itunes:duration": "29:42",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,lecture,constructivism,piaget",
  "itunes:subtitle": "How can we make learning as fun as it was when you were a child? Listen to Dr. Eugene Geist as he explains the cognitive development theories of Jean Piaget and you'll understand why we are all geared to learn.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "How can we make learning as fun as it was when you were a child? We can. Listen to Dr. Eugene Geist as he explains the cognitive development theories of Jean Piaget and you'll understand why we are all geared to learn. We actively seek out learning experiences. How can we keep that excitement alive? Find out in this episode and in the episodes to follow as we examine ideas such as constructivism, problem-based learning, inquiry-based learning and democratic schools. This episode will also be helpful if you need to learn the different stages of Piaget's theory of cognitive development."
}