{
  "id": "tag:blogger.com,1999:blog-6894866515532737257.post-5404055702663061571",
  "published": "2018-02-08T13:15:00.005-08:00",
  "updated": "2018-02-08T13:17:43.709-08:00",
  "title": "Build your own SOTU",
  "content": "<a href=\"https://www.nytimes.com/interactive/2018/02/06/opinion/trump-speech-mental-capacity.html\">In the New York Time on Tuesday, John McWhorter</a> argues that Donald Trump's characteristic speech patterns are not, a<span style=\"font-family: inherit;\">s some have suggested, evidence of mental decline.&nbsp; Rather, the quality of Trump's public speech has declined because, according to McWhorter:</span><br /><span style=\"font-family: inherit;\"><br /></span><span style=\"font-family: inherit;\">1) \"The&nbsp;<span style=\"background-color: white; color: #333333;\">younger Mr. Trump [...] had a businessman’s normal inclination to present himself in as polished a manner as possible in public settings\", and&nbsp;</span></span><br /><span style=\"font-family: inherit;\"><br /></span><span style=\"font-family: inherit;\">2)&nbsp; The older Trump has \"settled into his normal\" because as president, he \"has no impetus to speak in a way unnatural to him in public\".</span><br /><br />It's an interesting article, and I encourage you to read it before I start getting silly about it.<br /><br />I would like to suggest an alternative interpretation, which is that the older Trump's speech sounds as it does because it is being generated by a <a href=\"https://en.wikipedia.org/wiki/Markov_chain\">Markov chain</a>.<br /><br />A Markov chain is a random process that generates a sequence of tokens; in this case, the tokens are words.&nbsp; I explain the details below, but first I want to show some results.&nbsp; Compare these two paragraphs:<br /><blockquote class=\"tr_bq\"><i>\"You know, if you're a conservative Republican, if I were a liberal, if, like, okay, if I ran as a liberal Democrat, they would say I'm one of the smartest people anywhere in the world – it’s true! – but when you're a conservative Republican they try – oh, they do a number\"</i></blockquote><blockquote class=\"tr_bq\"><i>\"I mean—think of this—I hate to say it but it’s the same wall that we’re always talking about. It’s—you know, wherever we need, we don’t make a good chance to make a deal on DACA, I really have gotten to like. And I know it’s a hoax.\"</i></blockquote>One of those paragraphs was generated by a Markov chain I trained with the unedited transcript from this&nbsp;<a href=\"https://www.wsj.com/articles/transcript-of-donald-trump-interview-with-the-wall-street-journal-1515715481\">recent interview with the Wall Street Journal</a>.&nbsp; The other was generated by Donald Trump.&nbsp; Can you tell which is which?<br /><br />Ok, let's make it a little harder.&nbsp; Here are ten examples: some are from Trump, some are from Markov.&nbsp; See if you can tell which are which.<br /><br /><i>1) I would have said it’s all in the messenger; fellas, and it is fellas because, you know, they don’t, they haven’t figured that the women are smarter right now than the men, so, you know, it’s gonna take them about another 150 years — but the Persians are great negotiators, the Iranians are great negotiators, so, and they, they just killed, they just killed us.</i><br /><i><br /></i><i>2) And we have sort of interesting, but when people make misstatements somebody has some, you know, I went through some that weren’t so elegant. But all I’m asking is one thing, you know Obama felt—President Obama felt it was his biggest problem is going to be Dreamers also. But there’s a big difference—first of all, there’s a big problem, and they were only going to be solved.&nbsp;</i><br /><i><br /></i><i>3) One of the promises that you know is being very seriously negotiated right now is the wall and the wall will happen. And if you look—point, after point, after point—now we’ve had some turns. You always have to have flexibility.&nbsp;</i><br /><i><br /></i><i>4) Yeah, Rex and I think we’ll have something on that. We’ll find out. But people do leave. You guys may leave but I don’t know of one politician in Washington—if you’re a politician and somebody called up that they have phony sources, when the sources don’t exist, yeah I think would be frankly a positive for our country made wealthy.</i><br /><i><br /></i><i>5) They have an election coming up fairly shortly, and I understand that that makes it a little bit difficult for them, and I’m not looking to make the other side—so we’ll either make a deal or—there’s no rush, but I will say that if we don’t make a fair deal for this country, a Trump deal, then we’re not going to have—then we’re going to have a—I will terminate.</i><br /><i><br /></i><i>6) You’re here, you’ve got the wall is the same wall I’ve always talked about. I think we have companies pouring back into this country and you don’t know who’s there, you’ve got the wall will happen.&nbsp; We have a very old report. Business, generally, manufacturing the same wall that we’re talking about or whatever it may be.</i><br /><i><br /></i><i>7) And they endorsed us unanimously. I had meetings with them, they need see-through. So, we need a form of fence or window. I said why you need that—makes so much sense? They said because we have to see who’s on the other side.</i><br /><i><br /></i><i>8) Well they will make sure that no country including Russia can have anything to do with my win. Hope, just out of the most elegant debate—I thought it was a dead meeting. No, I never forget, when I fired, all these people, they all wanted him fired until I said, ‘We got to get worse'.&nbsp;</i><br /><i><br /></i><i>9) The governor of Wisconsin has been fantastic in their presentations and everything else. But I’m the one who got them to look at it. Now we need people because they’re going to have thousands of people working it’s going to be a—you know—that’s—that’s the company that makes the Apple iPhone.</i><br /><i><br /></i><i>10) So, they make up a television show. As you know, I went to the—I went to the—I went to the—I went to the employees—to millions and millions of employees. And AT&amp;T started it, but I will terminate Nafta. OK? You know, we only have a thing called trade.&nbsp;</i><br /><br />The first person to submit correct answers will be sequestered in a sensory deprivation tank until <a href=\"https://www.timeanddate.com/countdown/generic?iso=20210120T09&amp;p0=900&amp;msg=Inauguration+2021&amp;font=sanserif\">January 20, 2021</a>.<br /><br /><a href=\"https://github.com/AllenDowney/ProbablyOverthinkingIt/blob/master/markov/markov.ipynb\">Here's the Jupyter notebook I used to generate the examples</a>.&nbsp; If you want to know more about how it works, <a href=\"http://greenteapress.com/thinkpython2/html/thinkpython2014.html#sec159\">see this section of Think Python, second edition</a>.<br /><br /><br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Allen Downey",
    "uri": "http://www.blogger.com/profile/01633071333405221858",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}