{
  "title": "Cecilia Vicuña: Listening with the Fingers",
  "itunes:author": "Liquid Architecture",
  "itunes:subtitle": "Artist Profile",
  "itunes:summary": "In September and October 2016 the Chilean artist and poet Cecilia Vicuña visited Australia for a series of performances, readings, interviews and collaborations. Cecilia had been invited, on behalf of Liquid Architecture, by fellow Chilean artist and curator Camila Marambio. \nListening With Fingers, published on Disclaimer, brings together a material archive of Cecilia’s activities in Australia. Documentation, recordings, transcripts, and interviews are collected alongside a new recording of the artist reading poems, sent via voice message to the editors in late 2020. \n\nPresented here are excerpts from this collection including moments from Cecilia and Camila’s performance in an abandoned limestone quarry in Queenstown, Tasmania intersected with extracts from an Interview with Miyuki Jokiranta for Unconformist Radio. We then hear moments of conversation between Cecilia and editor Autumn Royal in which Cecilia speaks to the importance of oral culture, the under valuing of her work in the past, and her friendship with Leonora Carrington. Following this is a segment of Vicuna’s performance for Liquid Architecture’s project Why Listen to Animals? in which she presented a set of ten ‘answers’ sung-spoken in the form of a poetic decalogue with collaborators Bryan Phillips, Sarita Gálvez and Camila Marambio. Closing this sampler is a reading of the poem Word and Thread from Vicuña’s appearance on the radio program Parallel Lines hosted by Sara Savage on Triple R.\n\nhttps://www.mixcloud.com/liquid-architecture/cecilia-vicu%C3%B1a-listening-with-the-fingers/\n\nImage: Keelan O'Hehir\n\nTranscript: https://docs.google.com/document/d/1XEt-MTdzjIER1R9Tz2-DwOZJT-6gQedof3rAyU790M0/edit?usp=sharing\n\nFinancial support from patrons at any level has a resounding impact on our work. You can support Liquid Architecture’s weekly podcast and our online journal Disclaimer, for new thinking and writing on listening and sound through a Patreon subscription, for as little as $5 a month. \n\nhttps://www.patreon.com/liquidarchitecture\n\nFor the past 20 years, Liquid Architecture has been Australia’s leading organisation for artists working with sound and listening. LA investigates the sounds themselves, but also the ideas communicated about, and the meaning of, sound and listening.",
  "itunes:image": "",
  "enclosure": "",
  "guid": "https://liquidarchitecture.org.au/podcast/cecilia-vicuna-listening-with-the-fingers",
  "pubDate": "Thu, 01 Jul 2021 08:00:00 +1000",
  "itunes:duration": "34:13",
  "itunes:explicit": "no"
}