{
  "title": "145: Blago: The Rise and Fall of Rod Blagojevich",
  "link": "https://audioboom.com/posts/7660378",
  "itunes:episode": 145,
  "itunes:title": "Blago: The Rise and Fall of Rod Blagojevich",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 3082,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Rod \"Blago\" Blagojevich had a charmed path to the Governor's Mansion in Illinois: He married Patty Mell, the daughter of a powerful Democratic Alderman who helped him jump from state legislator to Governor in just 10 years. And then he F***ED it all up. When Obama (COME BACK, GIRL!) was elected President, and it was up to Blago to appoint a replacement, he went all over Chicago trying to SELL. THAT. SEAT. And the FBI has the tapes to prove it! OH OH OH!! And when he got caught and knew he was headed for trial, HE WENT ON THE CELEBRITY APPRENTICE to try to get too famous to send to jail. Thaaaaaaaaat didn't go as planned. <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<a href=\"https://www.disappearedpod.com/\">FAM! WE LAUNCHED A NEW PODCAST</a>! <strong>\"Obsessed With: Disappeared.\"</strong> It's a true crime / comedy podcast hosted by Patrick Hinds and Ellyn Marsh--best friends of 20 years. Going in order, Patrick and Ellyn recap episodes of ID's \"Disappeared.\"  Episodes are live now! Be sure to check out our episode covering <a href=\"https://www.disappearedpod.com/episodes/episode/50959f8d/6-the-disappearance-of-maura-murray-s1-e6\">the disappearance of Maura Murray</a> <a href=\"https://www.disappearedpod.com/episodes/episode/50a1423d/an-interview-with-julie-murray-maura-murrays-sister\"><strong>AND PATRICK'S IN-DEPTH INTERVIEW WITH MAURA'S SISTER, JULIE MURRAY!</strong></a>\n</div>\n",
  "pubDate": "Tue, 18 Aug 2020 09:55:08 +0000",
  "guid": "tag:audioboom.com,2020-08-18:/posts/7660378",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}