{
  "guid": "urn:uuid:4ac77158-2a0b-4b32-b66b-6a9c57386953",
  "link": "https://www.who.int/news/item/21-10-2022-world-health-organization-(who)-response-to-the-external-evaluation-of-the-access-to-covid-19-tools-accelerator-(act-a)",
  "a10:author": {
    "a10:name": ""
  },
  "title": "World Health Organization (WHO) response to the External Evaluation of the Access to COVID-19 Tools Accelerator (ACT-A)",
  "description": "<p>WHO appreciates the broad range of views on the ACT-Accelerator (ACT-A) setup, operations and results that are captured in the External Evaluation, which was commissioned by the ACT-A Facilitation Council. Of particular value in this report are the perspectives expressed by a number of countries in Africa, South America and Asia that used ACT-A processes and services during the pandemic, but whose voices have not always been heard in such reviews.&nbsp;<br /></p><p>While acknowledging the limitations that have been cited by the authors and other commentators, this report does provide important perspectives that add to the growing number of evaluations, reports, reviews and recommendations that aim to inform the establishment of a stronger countermeasures platform. Collectively, this work will help shape efforts to build on the experience of ACT-A and other instruments and initiatives (e.g. the Pandemic Influenza Preparedness (PIP) Framework, the &lsquo;100 Day Mission&rsquo;) to ensure the world can rely on a more robust platform for accelerating the development, and equitable allocation and delivery of countermeasures in future pandemics.&nbsp;</p><p>Of particular note in this report is the strong, majority position of survey respondents that the innovative and collaborative ACT-A arrangement was the right approach for accelerating access to COVID-19 countermeasures at a time when the global community needed to act quickly and decisively to combat a poorly understood threat. &nbsp;The report also documents important results that were achieved through the ACT-A approach, including the unprecedented speed of its core agencies in delivering vaccines and diagnostics to the lowest income countries, as compared to previous pandemics, and in driving crucial market interventions that substantially reduced prices and enhanced access to diagnostics, oxygen and antivirals at a critical time. The counterfactual is that in the absence of ACT-A, equity in access to countermeasures would have been much worse.&nbsp;</p><p>WHO concurs with the challenges identified in the areas of the Health Systems Connector (vs. the HSRC) and the quality assurance of rapid diagnostics. With respect to the former, this lesson was learned and corrected in the course of ACT-A, with the Connector being substantially revamped and relaunched in 2021 (a point that is not fully reflected in the report). Addressing gaps in WHO&rsquo;s capacity to assess the very high volume of diagnostics submissions during the course of the pandemic was inherently more challenging and signals the vital need for additional financing and personnel for this area, adjustments to the assessment process for emergency situations, and greater support from collaborating agencies.<br /></p><p>The report also reinforces previously identified shortcomings in the ACT-A operating model that were largely the result of the urgency and speed with which ACT-A had to be established.&nbsp;&nbsp;</p><p>These findings support the existing consensus on the vital need to ensure the future countermeasures platform is more inclusive, has greater transparency in its operations and establishes robust mechanisms for collective accountability.&nbsp; The report particularly highlights the need to completely rethink and rework key processes with low- and lower-middle income countries to ensure their full and meaningful engagement.&nbsp; An important omission in this evaluation is an assessment of the role and impact of industry in ACT-A through its participation in the Facilitation Council, Principals Group and some Pillars, and the degree to which this did or did not facilitate the coalition&rsquo;s core objective of ensuring equitable access to vaccines, tests and treatments in real time.&nbsp;</p><p>In formulating other recommendations on the way forward, however, the report seems to have based some important conclusions on incomplete information or a misunderstanding of key aspects of the ACT-A collaboration. This appears to be the case in areas such as how targets for product volumes were established, the original ambition for the COVAX Facility, the nature of the COVID Vaccines Delivery Platform (CoVDP) and its mode of operations, and the key role of individual ACT-A agencies in resource mobilization. Most importantly, and contrary to the data presented, the report could inadvertently lead readers to conclude that creating a more robust countermeasures platform is best achieved by starting from scratch, rather than building on the considerable, documented strengths of the ACT-A collaboration and its three product pillars. The framing of an important survey question(s) may have contributed to this perspective. From a pragmatic perspective, it would seem more advantageous to harness and build on the substantial experience that international health agencies and partners have gained through their work in ACT-A, while also addressing the shortcomings of this model.&nbsp;</p><p>Notwithstanding these issues, the perspectives captured in this report strongly reinforce the need for an inclusive, robust process that engages countries, relevant international health agencies and organizations, civil society and community organizations, donors, industry and other stakeholders, to co-create a countermeasures platform that is anchored in the principles of speed and equity. This process will need to be informed by all such reviews and experience to optimize upstream operations (e.g. R&amp;D, market shaping), downstream work (e.g. procurement, delivery), collective accountability and financing. WHO will take such a process forward with partners and stakeholders and with urgency, because, as the evaluation report again emphasizes, this cannot wait for the next pandemic.&nbsp;</p><p>WHO is deeply grateful for the extraordinary role that Norway and South Africa have played in co-chairing the ACT-A Facilitation Council throughout these turbulent times, and for commissioning this External Evaluation that is an important contribution to our collective efforts to build a safer, fairer world, together.</p><p>&nbsp;</p>",
  "pubDate": "Fri, 21 Oct 2022 14:49:13 Z"
}