{
  "title": "154: Death at the Mansion: Rebecca Zahau. Part 2",
  "link": "https://audioboom.com/posts/7709845",
  "itunes:episode": 154,
  "itunes:title": "Death at the Mansion: Rebecca Zahau. Part 2",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3749,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>WILLIAM ELIZABETH AND BLAZER HOLES ARE BACK!<br>\n<br>\nOn July 13, 2011, the body of 32 year-old Rebecca Zahau was found naked, bound, and hanging from a balcony at the Spreckels Mansion in Coronado, California. The death was quickly ruled a suicide, but many strange facts surround the case. The son of Rebecca's boyfriend, the Billionaire Jonah Shacknai, had fallen from a staircase inside the mansion just 2 days before and was now in critical condition. Jonah's brother, his ex-wife, and ex-wife's sister all had access to the mansion and felt that Rebecca was at least partially responsible for the accident. In episode 2, we have to deal with some audio hack trying to sell us \"voice finger printing\" AND prepare for the return of the garbage minute!!<br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n<div>\n<a href=\"https://audioboom.com/posts/7703675-death-at-the-mansion-rebecca-zahau-part-1/edit\">Update Description<br>\n</a><br>\n\n</div>\n<div>\n<br>\n<br>\n\n</div>\n<div>\n<br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 20 Oct 2020 10:33:04 +0000",
  "guid": "tag:audioboom.com,2020-10-20:/posts/7709845",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}