{
  "title": "Starfall: Finding a Meteorite with Drones and AI",
  "link": "https://spectrum.ieee.org/how-to-find-meteorites",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-man-stands-in-the-desert-holding-a-remote-controller-for-a-drone-that-hovers-in-the-air-behind-him-he-is-pointing-to-a-small.jpg?id=29590669&width=1200&height=800&coordinates=0%2C0%2C0%2C100\"/><br/><br/><p>Go outside on a clear night, and if you’re very lucky you will see the sky falling. NASA estimates that 50,000 <a href=\"https://solarsystem.nasa.gov/asteroids-comets-and-meteors/meteors-and-meteorites/in-depth/\" rel=\"noopener noreferrer\" target=\"_blank\">meteorites</a> from space have been found on Earth.</p><p>The shooting stars or fireballs they form as they enter the atmosphere can be beautiful, but they’re hard to track. Of those 50,000, astronomers have been able to plot the past orbits of only <a href=\"https://www.meteoriteorbits.info/\" rel=\"noopener noreferrer\" target=\"_blank\">about 40</a>.</p><p>Which is why <a href=\"https://scholar.google.com/citations?user=2OZ1qikAAAAJ&hl=en\" rel=\"noopener noreferrer\" target=\"_blank\">Seamus Anderson</a> and his colleagues at <a href=\"https://sstc.curtin.edu.au/\" rel=\"noopener noreferrer\" target=\"_blank\">Curtin University</a> in Australia may have made an important first. They <a href=\"https://arxiv.org/abs/2203.01466\" rel=\"noopener noreferrer\" target=\"_blank\" title=\"Link: https://arxiv.org/abs/2203.01466\">report they’ve recovered a meteorite</a> in the remote Australian outback—one that once followed an ellipse between the orbits of Venus and Jupiter—and they picked it out of nowhere with two drones and machine learning.</p><p>“It was a semi-surprise,” says Anderson, an American who came to Curtin in 2018 to do his Ph.D. work on technology for meteorite searches. “We weren’t expecting to have that much success the first time.”</p><p>Curtin’s Space Science and Technology Center, in the city of Perth, runs the <a href=\"https://dfn.gfo.rocks/\" rel=\"noopener noreferrer\" target=\"_blank\">Desert Fireball Network</a>, a system of 50 automated cameras that monitor Australia’s night skies for incoming meteors. One night last year, two of the cameras tracked a streak in the sky, and the system calculated that a small rock had probably crashed in the desert scrub of Western Australia, in a region known as the Nullarbor. The observations weren’t ideal—they estimated that the meteorite weighed between 150 and 700 grams and had come down in an area of 5 square kilometers—but Anderson and two colleagues decided to make a field trip. In December, they set out from Perth on a drive of more than 1,000 km looking for a needle in a haystack: one blackened piece of rock on the desert floor, 50 km from the nearest paved road.</p><p>In the past, the trip would have been all but pointless. Meteorite hunters usually search the ground on foot, walking back and forth in a grid pattern and hoping they hit pay dirt. Eighty percent of the time, they fail.</p><p>“It’s been shown that people are just terrible at these kinds of repetitive tasks,” says Anderson. “A major problem is humans just not paying attention.”</p><p class=\"pull-quote\">Through repetition, the machine and the researchers learned to deal with false positives: bottles, cans, desert plant roots, and occasional kangaroo bones.</p><p>That’s where technology came in. They used off-the-shelf hardware—a quadcopter drone with a 44-megapixel camera and a desktop computer with a good video card. The unusual part was the convolutional neural network they ran on it—machine-learning software not often carried by campers in the outback.</p><p>“The holy grail of meteorite hunting right now is a drone that can grid a geographic area, look at the ground, and find meteorites with AI,” says <a href=\"https://www.amsmeteors.org/author/mike-hankey/\" rel=\"noopener noreferrer\" target=\"_blank\">Mike Hankey</a> of the American Meteor Society.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Overhead shot shows 3 people in the desert pointing at the ground.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"3142d36d8fb9cbedce984e69a035c636\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"78c01\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/overhead-shot-shows-3-people-in-the-desert-pointing-at-the-ground.jpg?id=29590700&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Seamus Anderson [right] poses with his two colleagues, both pointing at the meteorite they just found. The photo was taken with the drone they had used to locate the specimen.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Seamus Anderson/Curtin University</small></p><p>A machine-learning system needs training—data about the world from which it can extrapolate—so the researchers fed it drone images of the Nullarbor terrain. Some of them included meteorite samples borrowed from a local museum and planted on the ground. Those images were given a score of 1—a definite meteorite, even if each appeared only as a black dot. Other images showing random terrain nearby were scored as 0—no meteorite here. Through repetition, the machine and the researchers learned to deal with false positives: bottles, cans, desert plant roots, and occasional kangaroo bones.</p><p>“It’s like training your kid to figure out what a dog looks like,” says Anderson now. “You could show lots of images of nothing but black Labs—and then, when it sees a picture of a German Shepard, it’s maybe going to freak out and not know exactly what it’s supposed to do. So you have to give it many opportunities to know what a meteorite can look like in that background.”</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Top satellite image  has insets of a meteor falling and blue lines indicating search zones. Bottom shows an orbital map and a closer satellite of the desert with dots showing searched areas.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"79f9b3684624dceb53f458f7654574fd\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"b21b1\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/top-satellite-image-has-insets-of-a-meteor-falling-and-blue-lines-indicating-search-zones-bottom-shows-an-orbital-map-and-a-cl.jpg?id=29590680&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Top: The incoming meteor and where it landed in Western Australia. Bottom left: The likely orbit of the meteoroid before it hit the Earth. Bottom: The section of desert scientists searched.</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">\n            Seamus Anderson/Curtin University\n        </small>\n</p><p>They began surveying: 43 drone flights over three days, going back and forth at an altitude of about 20 meters, recording 57,255 images. Back at camp, they began to process their images. From the first four flights alone, the algorithm gave 59,384 objects a score of at least 0.7 on that scale of 0 to 1—a lot of possible specimens. The researchers were quickly able to narrow them down to 259 and then 38, which they reinspected with a second, smaller drone. Soon they were down to four, and set out on foot, guided by GPS, to find them.</p><p>Before we reach the conclusion, it’s worth pausing to ask why meteorites are worth chasing. Space scientists will say that some date from the beginnings of the solar system. Some contain amino acids, those most basic building blocks of life. A few are <a href=\"https://spectrum.ieee.org/chelyabinsklike-impacts-more-common-than-scientists-thought\" target=\"_self\">large enough</a> to do harm. Others, Anderson points out, contain rare elements, perhaps valuable for future technologies but hard to mine on Earth.</p><p>So there was a lot to think about in the desert heat—life, the universe, the reliability of their algorithm—as Anderson and his two comrades paced the ground looking for a blackened rock.</p><p>“Then one of my friends on the trip, John Fairweather, said one of the most annoying things you can hear at that moment—like, ‘Hey, is this the meteorite?’” Anderson says. He thought it was a joke. “And I thought, ‘That’s not funny right now, John.’ And I looked over and, literally, he’s got the rock.”</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Closeup of the meteorite on the desert floor in Australia, with a pen to show its size.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"f035f185a238057aaab6020369a0f3a3\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"25f51\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/closeup-of-the-meteorite-on-the-desert-floor-in-australia-with-a-pen-to-show-its-size.jpg?id=29590699&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The meteorite, named DFN 09, is shown here with a pen for scale.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Seamus Anderson/Curtin University</small></p><p>Anderson looked around to be sure the surroundings matched what the overhead drone image had shown. They did. The rock was a chondrite, a common type of iron-rich meteorite. It was 5 centimeters long, about the size of an egg, and weighed 70 grams. Most important to Anderson, the algorithm had given this particular patch of ground a score of 1.0—a perfect match.</p><p>“And I stood there, and I basically just screamed for a minute or two. Yes, it was awesome.”</p>",
  "pubDate": "Thu, 24 Mar 2022 21:41:38 +0000",
  "guid": "https://spectrum.ieee.org/how-to-find-meteorites",
  "category": [
    "Neural networks",
    "Drones",
    "Meteors"
  ],
  "dc:creator": "Ned Potter",
  "media:content": ""
}