{
  "id": "yt:video:lnCXFSaBfN0",
  "yt:videoId": "lnCXFSaBfN0",
  "yt:channelId": "UCMk_WSPy3EE16aK5HLzCJzw",
  "title": "The Ainu language - short history, plus a note about last speakers and pandemics",
  "link": "",
  "author": {
    "name": "NativLang",
    "uri": "https://www.youtube.com/channel/UCMk_WSPy3EE16aK5HLzCJzw"
  },
  "published": "2020-04-24T17:00:17+00:00",
  "updated": "2022-07-23T07:15:32+00:00",
  "media:group": {
    "media:title": "The Ainu language - short history, plus a note about last speakers and pandemics",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "A brief animated history of a language native to northern Japan and the edge of Siberia.\n\nSubscribe for more: https://www.youtube.com/subscription_center?add_user=NativLang\nBecome my patron: https://www.patreon.com/NativLang \n\nEarnings from this and other NativLang videos this month will be donated. The highlighted message at 5:49 is from Cultural Survival, though I may add others:\nhttps://mailchi.mp/culturalsurvival.org/covid19\n\n~ Briefly ~ \n\nI've spent the first part of this pandemic researching the languages of Siberia. Along the way I noticed how many languages were spoken by just a very, very small community. Today let's take some minutes to think about one such language traditional to the edge of southeastern Siberia.\n\nStart in Japan, then journey through a brief history of Ainu. It's missing many details, but you'll end up with a sense of who the speakers are, where they have lived, down to where the language holds on at present in Japan. Even learn some features that make it similar to and very different from Japanese and from nearby Siberian languages.\n\nWe'll end with a note about languages with few speakers left (often few elders - sometimes just one!) The month of this video's release, YT ad revenue from across NativLang videos will go to groups who are aware of this issue and support indigenous communities.\n\n~ Credits ~\n\nArt, narration, animation and much of the music by Josh from NativLang\n\nSources for claims made, and credits for most of the music, fonts, sfx:\nhttps://docs.google.com/document/d/1wZwR7UWVF7M637OQecDRF5Ay3kQV1lZmHcGbbaJrCkE/\n\nMusic:\nPlease see my doc above for sources. There I give full credit to Kevin MacLeod (incompetech.com) for the track at the start and a couple in the middle.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}