{
  "title": "Look to Speak launches in Ukraine",
  "link": "https://blog.google/outreach-initiatives/accessibility/look-to-speak-launches-in-ukraine/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"rxv34\">Nearly two years ago, Google launched <a href=\"https://blog.google/outreach-initiatives/accessibility/look-to-speak/\">Look to Speak</a>, an Android app that allows people to use their eyes to select pre-written phrases and have them spoken aloud. Since then, the app has launched in 18 additional languages. Most recently, we made the app available in Ukrainian to help refugees and veterans of the war.</p><p data-block-key=\"8l7gf\">As a speech and language therapist working at Google, I’ve seen how technology can help people express their everyday needs, feelings and identity. To hear from someone about how Look to Speak can be particularly helpful in Ukraine where people are dealing with the injuries and side effects of war, I spoke with Oksana Lyalka, the founder and president of the Ukrainian Society for Speech and Language Therapy.</p><p data-block-key=\"fe5n2\"><b>What is the situation like for veterans and refugees of the war in Ukraine who have speech and motor impairments?</b></p><p data-block-key=\"233ke\">Due to direct injuries and conditions caused by the war, the number of people with both motor and speech impairments are likely increasing. In addition, indirect impact like stress and malnutrition causes an increased risk of strokes, which can also lead to motor and speech impairments — and access to care remains limited. Also, for many refugees who left Ukraine and are in foreign countries, it’s difficult to get the help they need because many of them already have chronic impairments and their insurance does not cover therapy for communication disorders in another country. Plus, communication is a language-specific impairment. Meaning, it’s difficult to get the help they need in their native language outside of Ukraine.</p><p data-block-key=\"es3l4\"><b>What are the specific challenges that people are facing?</b></p><p data-block-key=\"5gtrb\">They are mainly left on their own with speech and motor impairments. Because: 1) There’s a shortage of speech language therapists. 2) There are even fewer who understand what these patients deal with. 3) Therapy is costly and not everyone has the resources to afford it, especially in war time.</p><p data-block-key=\"3uvf1\"><b>How could a tool like Look to Speak be helpful in Ukraine?</b></p><p data-block-key=\"fp0rr\">When someone has only a speech disorder, they can still write to communicate. But when there are also motor disorders like we’ve discussed, people can end up with no way to communicate. With Look to Speak, even if someone can’t communicate using their mouth, they can communicate with their eyes. This allows caregivers and others in their environment to listen and understand in new ways. Communication is a two-way process, and the Look to Speak app can act as a bridge.</p><p data-block-key=\"djkeq\"><b>The First Lady of Ukraine Olena Zelenska on the Look to Speak app:</b></p><p data-block-key=\"6p7uc\">\"One of everyone’s fundamental needs is the ability to communicate and interact with those around them. For most people, it is unnoticeable and automatic, similar to breathing. However, due to various factors, a person may lose this ability and be unable to talk or use a computer, tablet, mobile phone, or other devices. Especially now, in times when the war daily multiplies the chances of finding oneself in such conditions, we as a society must unite and help each other as much as we can to overcome these terrible circumstances. One of the examples of Ukraine's responsible cooperation with world technological leaders is the localization of Google’s Look to Speak app. It helps people with motor and speech impairments to communicate using their eye movements. It is good to know that Ukrainian public organizations in health care, medical institutions, and everyone who needs it can use advanced digital solutions now adapted to the needs of Ukrainian users. I am sure that initiatives like Look to Speak will not only provide new opportunities for our citizens but will also serve as a model for other technological companies that are now supporting Ukraine.\"</p><p data-block-key=\"6cj3d\">To learn more about Look to Speak in Ukraine, watch <a href=\"https://www.youtube.com/watch?v=1EvL8VqFHCI\">this video</a> in Ukrainian.</p></div></div></body></html>",
  "pubDate": "Thu, 03 Nov 2022 17:00:00 +0000",
  "guid": "https://blog.google/outreach-initiatives/accessibility/look-to-speak-launches-in-ukraine/",
  "category": "Accessibility",
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Look to Speak launches in Ukraine",
    "description": "Learn about Look to Speak, an Android app which enables people to use their eyes to select pre-written phrases and have them spoken aloud.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/LTS_thumbnail_221025a_1.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://blog.google/outreach-initiatives/accessibility/look-to-speak-launches-in-ukraine/"
  },
  "author": {
    "name": "Richard Cave",
    "title": "Speech & Language Therapist",
    "department": "",
    "company": ""
  }
}