{
  "title": "Censored! Journalist Chris Hedges Erased From YouTube!",
  "itunes:title": "Censored! Journalist Chris Hedges Erased From YouTube!",
  "pubDate": "Fri, 01 Apr 2022 03:54:06 +0000",
  "guid": "99de4049-62f7-4c9c-a8a5-cea311834787",
  "link": "https://thejimmydoreshow.libsyn.com/censored-journalist-chris-hedges-erased-from-youtube",
  "itunes:image": "",
  "description": "<p>Award-winning journalist and bestselling author Chris Hedges talks to Jimmy about his effective silencing by YouTube, with six years’ worth of Hedges’ show, ​​”On Contact,” deleted from the platform simply because the program appeared on the Russian-affiliated network RT. As a result, hundreds of episodes featuring interviews with a wide range of guests, the vast majority of which had nothing to do with Russia, have been removed from public view.</p> <p>Plus a segment on the curious case of the Anti-Defamation League downplaying concerns about the neo-Nazi Azov Battalion in Ukraine.<br /> <br /> Also featuring Stef Zamorano, Howard Skora and Mike MacRae! And phone calls from Al Pacino and Joe Biden!</p>",
  "content:encoded": "<p>Award-winning journalist and bestselling author Chris Hedges talks to Jimmy about his effective silencing by YouTube, with six years’ worth of Hedges’ show, ​​”On Contact,” deleted from the platform simply because the program appeared on the Russian-affiliated network RT. As a result, hundreds of episodes featuring interviews with a wide range of guests, the vast majority of which had nothing to do with Russia, have been removed from public view.</p> <p>Plus a segment on the curious case of the Anti-Defamation League downplaying concerns about the neo-Nazi Azov Battalion in Ukraine.  Also featuring Stef Zamorano, Howard Skora and Mike MacRae! And phone calls from Al Pacino and Joe Biden!</p>",
  "enclosure": "",
  "itunes:duration": "01:02:37",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Award-winning journalist and bestselling author Chris Hedges talks to Jimmy about his effective silencing by YouTube, with six years’ worth of Hedges’ show, ​​”On Contact,” deleted from the platform simply because the program appeared on...",
  "itunes:episodeType": "full",
  "itunes:summary": "Award-winning journalist and bestselling author Chris Hedges talks to Jimmy about his effective silencing by YouTube, with six years’ worth of Hedges’ show, ​​”On Contact,” deleted from the platform simply because the program appeared on the Russian-affiliated network RT. As a result, hundreds of episodes featuring interviews with a wide range of guests, the vast majority of which had nothing to do with Russia, have been removed from public view. Plus a segment on the curious case of the Anti-Defamation League downplaying concerns about the neo-Nazi Azov Battalion in Ukraine. Also featuring Stef Zamorano, Howard Skora and Mike MacRae! And phone calls from Al Pacino and Joe Biden!"
}