{
  "title": "S15 Ep58: Supernatural News/Parashare: Ozzy vs The Paranormal Edition",
  "link": "https://audioboom.com/posts/8098465",
  "itunes:episode": 58,
  "itunes:title": "Supernatural News/Parashare: Ozzy vs The Paranormal Edition",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5314,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio presents Supernatural News: Ozzy vs The Paranormal Edition.<br>\n<br>\nThe boys are back with more colorful stories of Supernatural Shenanigans this week. Ghostly Adventures with the Tiger King, Scottish X-Files, Dead Mans Fingers and China seeks the sound of a Dragon.<br>\n<br>\nFor more books on Paranormal & True Crime, visit here: <a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping.",
  "itunes:summary": "Darkness Radio presents Supernatural News: Ozzy vs The Paranormal Edition.\n\nThe boys are back with more colorful stories of Supernatural Shenanigans this week. Ghostly Adventures with the Tiger King, Scottish X-Files, Dead Mans Fingers...",
  "pubDate": "Sat, 18 Jul 2020 08:00:00 +0000",
  "guid": "e39fbbcd-7ad5-420d-bab0-e1ca6caffc29",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}