{
  "guid": "tag:blogger.com,1999:blog-2761684730989137546.post-6676903077756868260",
  "pubDate": "Wed, 02 Nov 2022 15:50:00 +0000",
  "atom:updated": "2022-11-02T11:50:23.963-04:00",
  "title": "Some notes on the political economy of central banking — Nick Johnson",
  "description": "<i><blockquote>I have just finished a very useful collection of some of the papers of economist Gerald Epstein, entitled The Political Economy of Central Banking. Epstein is Professor of Economics and Co-Director in the Political Economy Research Institute (PERI) at the University of Massachusetts-Amherst in the US, which is known for the progressive research agendas of its members.<br /><br />Rather than write a lengthy review, this post sets out some of the key points made in the book and which stood out for me as being original and important. Epstein’s focus on central banks (CBs) remains especially relevant in today’s world of increased inflation and CB efforts to return it to target rates.…</blockquote></i><div>Gerald Epstein,&nbsp;Professor of Economics and a founding Co-director of the Political Economy Research Institute (PERI)<span style=\"color: #333333; font-family: Droid Sans, sans-serif;\"><span style=\"background-color: white;\"><span style=\"font-size: 14px;\">, UMASS (Amherst),</span></span></span>&nbsp;is a Post Keynesian economist.</div><div><br />The Political Economy of Development<br /><a href=\"https://peofdev.wordpress.com/2022/11/02/some-notes-on-the-political-economy-of-central-banking/\">Some notes on the political economy of central banking<br /></a>Nick Johnson</div><div><br /></div><div>See also&nbsp;</div><i><blockquote>Charles Kindleberger ranks as one of the twentieth century's best known and most influential international economists. This book traces the evolution of his thinking in the context of a 'key-currency' approach to the rise of the dollar system, here revealed as the indispensable framework for global economic development since World War II. Unlike most of his colleagues, Kindleberger was deeply interested in history, and his economics brimmed with real people and institutional details. His research at the New York Fed and BIS during the Great Depression, his wartime intelligence work, and his role in administering the Marshall Plan gave him deep insight into how the international financial system really operated. A biography of both the dollar and a man, this book is also the story of the development of ideas about how money works. It throws revealing light on the underlying economic forces and political obstacles shaping our globalized world.…</blockquote></i>New book. Not MMT per se but related.<br /><br />Cambridge University Press<br />Money and Empire: Charles P. Kindleberger and the Dollar System<div>Perry Mehrling | Professor of International Political Economy at the Pardee School of Global Studies, Boston University<br /><br /></div>",
  "link": "http://mikenormaneconomics.blogspot.com/2022/11/some-notes-on-political-economy-of.html",
  "thr:total": 1,
  "author": "contrarianmedia@hotmail.com (Mike Norman)"
}