{
  "title": "For Better or Worse, Tesla Bot Is Exactly What We Expected",
  "link": "https://spectrum.ieee.org/tesla-optimus-robot",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-humanoid-robot-with-metal-and-wires-exposed-stands-on-stage.jpg?id=31851352&width=1245&height=700&coordinates=0%2C115%2C0%2C115\"/><br/><br/><p>\n\tAt the end of Tesla’s 2021 AI Day last August, \n\t<a href=\"https://spectrum.ieee.org/elon-musk-robot\" target=\"_self\">Elon Musk introduced a concept for “Tesla Bot,”</a> an electromechanically actuated, autonomous bipedal “general purpose” humanoid robot. Musk suggested that a prototype of Tesla Bot (also called “Optimus”) would be complete within the next year. After a lot of hype, a prototype of Tesla Bot was indeed unveiled last night at Tesla’s 2022 AI Day. And as it turns out, the hype was just that—hype.\n</p><p>\n\tWhile there’s absolutely nothing \n\t<em>wrong</em> with the humanoid robot that Musk very briefly demonstrated on stage, there’s nothing uniquely <em>right</em>, either. We were hoping for (if not necessarily expecting) more from Tesla. And while the robot isn’t exactly a disappointment, there’s very little to suggest that it disrupts robotics the way that SpaceX did for rockets or Tesla did for electric cars.\n</p><p>\n\tYou can watch the entire 3+ hour live stream archived on YouTube \n\t<a href=\"https://www.youtube.com/watch?v=ODSJsviD_SU\" rel=\"noopener noreferrer\" target=\"_blank\">here</a> (which also includes car stuff and whatnot), but we’re just going to focus on the most interesting bits about Tesla Bot/Optimus.\n</p><hr/><h2>Setting Expectations<br/>\n</h2><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Elon Musk on stage with two Tesla engineers.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"6f5cb4220433b1450d86b022c985b25c\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"23ad0\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/elon-musk-on-stage-with-two-tesla-engineers.png?id=31851307&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Before revealing the robot, Musk attempted to set reasonable expectations for the prototype.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Tesla</small>\n</p><p>\n\tThese quotes are all from Musk.\n</p><blockquote>\n\t“I do want to set some expectations with respect to our Optimus robot… Last year was just a person in a robot suit, but we’ve come a long way, and compared to that, it’s going to be very impressive.”\n</blockquote><p>\n\tIt’s far, far too late for Musk to be attempting to set reasonable expectations for this robot (or Tesla’s robotics program in general). Most roboticists know better than to use humans when setting expectations for humanoid robots, because disappointment is inevitable. And trying to save it at the literal last minute by saying “compared to not having a robot at all, our robot will be very impressive,” while true, is not going to fix things.\n</p><blockquote>\n<em>“I think there’s some potential that what we’re doing here at Tesla could make a meaningful contribution to AGI.”</em>\n</blockquote><p>\n\tYeah, I’m not touching that.\n</p><p>\n<div class=\"rblad-ieee_in_content\"></div>\n</p><p>\n\tRight before the robot was brought on stage, one of the engineers made clear that this was going to be the first time that the robot would be walking untethered and unsupported. If true, that’s bonkers, because why the heck would you wait until \n\t<em>this moment</em> to give that a try? I’m not particularly impressed, just confused.\n</p><p>\n\tFor some context on what you’re about to see, a brief callback to a year ago last August, when I predicted what was in store for 2022:\n</p><blockquote>\n<em>It’s possible, even likely, that Tesla will build some sort of Tesla Bot by sometime next year, as Musk says. I think that it won’t look all that much like the concept images in this presentation. I think that it’ll be able to stand up, and perhaps walk. Maybe withstand a shove or two and do some basic object recognition and grasping. And I think after that, progress will be slow. But the hard part is not </em><em><strong>building </strong></em><em>a robot, it’s getting that robot to do </em><em><strong>useful stuff</strong></em><em>, and I think Musk is way out of his depth here.</em>\n</blockquote><h2>Tesla Bot Development Platform Demo</h2><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"39d188961e8e294502919847dd38d9f3\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/uncvPWe008I?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n</p><p>\n\tI’m reminded of the 2015 DARPA Robotics Challenge, because \n\t<a href=\"https://spectrum.ieee.org/darpa-robotics-challenge-drc-finals-know-your-robots\" target=\"_self\">many of the humanoid platforms looked similar to the way Tesla Bot looks</a>. I guess there’s only so much you can do with a mostly naked electromechanical humanoid in terms of form factor, but at first glance there’s nothing particularly innovative or futuristic about Tesla’s design. If anything, the robot’s movement is not quite up to DRC standards, since it looks like it would have trouble with any kind of accidental contact or even a bit of nonlevel floor (and Musk suggested as much).\n</p><p>\n\tOn stage, the robot did very little. It walked successfully, but not very dynamically. The “moves” it made may well have been entirely scripted, so we don’t know to what extent the robot can balance on its own. I’m glad it didn’t fall on its face, but if it had, I wouldn’t have been surprised or judged it too harshly.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"The humanoid robot stands near a desk and extends its arm to grab a watering can.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"3682f5765e596d1c73522b30193378af\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"91e18\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/the-humanoid-robot-stands-near-a-desk-and-extends-its-arm-to-grab-a-watering-can.png?id=31851310&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Tesla showed videos of the robot watering plants, carrying a box, and picking up a metal bar at a factory. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Tesla</small>\n</p><p>\n\tAfter the very brief live demo, Musk showed some video clips of the prototype robot doing other things (starting at 19:30 in the live stream). These clips included the robot walking while carrying a box of unspecified weight and placing it on a table, and grasping a watering can. The watering can was somewhat impressive, because gripping that narrow handle looks tricky.\n</p><p class=\"pull-quote\">\n\t“The robot can actually do a lot more than we’ve just showed you. We just didn’t want it to fall on its face.”\n\t<br/>\n\t—Elon Musk\n</p><p>\n\tHowever, despite the added footage from the robot’s sensors, we have no idea how this was actually done—whether it was autonomous or not, or how many tries it took to get right. There’s also a clip of a robot picking up an object and attempting to place it in a bin, but the video cuts right before the placement is successful. This makes me think that we’re seeing carefully curated best-case scenarios for performance.\n</p><blockquote>\n\tThat was our rough development robot, using semi-off-the-shelf actuators, but we’ve gone a step farther than that already. We actually have an Optimus bot with fully Tesla-designed actuators, battery pack, control system, everything—it wasn’t quite ready to walk, but we wanted to show you something that’s fairly close to what will go into production.\n</blockquote><h2>Tesla Bot Latest Generation Demo</h2><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"01c1820322b73c6bb8405cc72c1856ce\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/q_tgzTQK_hc?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n</p><p>\n\tThis looks a bit more like the concept that Tesla showed last year, although obviously it’s less functional than the other prototype we saw. It’s tempting to project the capabilities of the first robot onto the second robot, but it would be premature to do so.\n</p><blockquote>\n<em>Here you’re seeing Optimus with the degrees of freedom that we expect to have in the Optimus production unit, which is the ability to move all the fingers independently and opposable thumbs, so that it’s able to operate tools and do useful things. </em>\n</blockquote><h2>Cost and Competition</h2><h3>How Much Does Tesla’s Robot Cost?</h3><br/><p>\n\tMusk expects the robot to cost less than a car: “much less than $20,000,” he said at the event.\n</p><blockquote>\n<em>Our goal is to make a useful humanoid robot as quickly as possible. We’ve designed it using the same discipline that we use in designing the car, which is to design it for manufacturing, such that it’s possible to make the robot at high volume with low cost and high reliability. That’s incredibly important.… <br/><br/>Optimus is designed to be an extremely capable robot, but made in very high volume, ultimately millions of units. And it is expected to cost much less than a car—much less than [US] $20,000 would be my guess.<br/>\n</em>\n</blockquote><p>\n\tI generally agree with Musk here, in that historically, humanoid robots were not designed for manufacturability. This is changing, however, and I think that other companies likely have a head start over Tesla in manufacturability now. But it’s entirely possible that Tesla will be able to rapidly catch up if it’s able to leverage all that car-building expertise into robot building somehow. It’s not a given that it’ll work that way, but it’s a good idea, potentially a big advantage.</p><p>As for the production volume and cost, I have no idea what “expected” means. This line got some applause, but as far as I’m concerned, these numbers are basically meaningless at the moment.\n</p><h3>​What Will the Tesla Robot Be Used for?</h3><br><p>\n\tMusk said the robot will be able to operate tools and do useful things like carrying and manipulating objects in factories and other settings.\n</p><p>\n\tJust like last year, he’s implying that the robot will be able to carry out useful tasks because it has the necessary degrees of freedom. But of course the hardware is only the first step toward operating tools and doing useful things, and the software is, I would argue, much harder and far more time consuming, and Tesla seems to have barely started work on that side of things.</p></br><p>\n<div class=\"rblad-ieee_in_content\"></div>\n</p><blockquote>\n<em>You’ve all seen very impressive humanoid robot demonstrations, and that’s great, but what are they missing? They’re missing a brain—they don’t have the intelligence to navigate the world by themselves. </em>\n</blockquote><p>\n\tI’m not exactly sure whom Musk is throwing shade at, but there are only a couple of companies that would probably qualify as having “very impressive humanoid robot demonstrations.” And those companies do, in fact, have robots that broadly have the kind of intelligence that allows them to navigate at least some of the world by themselves, much better than we have seen from Optimus at this point. If Musk is saying that those robots are insufficiently autonomous or world-aware, then okay, but so far Tesla has not done better, and doing better will be a lot of work.\n</p><blockquote>\n<em>The team has put in an incredible amount of work, seven days a week, to get to the demonstration today. I’m super proud, and they’ve really done a great job.</em>\n</blockquote><p>\n\tWhile the actual achievements here have been mercilessly overshadowed by the hype surrounding them, this is truly an astonishing amount of work to be done in such a short time, and Tesla’s robotics team should be proud of what they’ve accomplished. And while there will inevitably be comparisons to other companies with humanoid robots, it’s critical to remember the context here: Tesla has made this happen in something like eight months. It’s nuts.\n</p><blockquote>\n<em>There’s still a lot of work to be done to refine Optimus and improve it, and that’s really why we’re holding this event—to convince some of the most talented people in the world to join Tesla and help make it a reality, help bring it to fruition at scale so that it can help millions of people. </em>\n</blockquote><p>\n\tI can see the appeal of Tesla for someone who wants to start a robotics career, since you’d get to work on a rapidly evolving hardware platform backed by what I can only assume are virtually unlimited resources.\n</p><blockquote>\n<em>…This means a future of abundance, a future where there is no poverty, where you can have whatever you want in terms of products and services. It really is a fundamental transformation of civilization as we know it.</em>\n</blockquote><p>\n\tMaybe just, like, get your robot to reliably and affordably do A Single Useful Thing, first?\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"The images showing the evolution of the robot.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"5868f1430ca97eecbb9b5e653c07b9a6\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"8f96f\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/the-images-showing-the-evolution-of-the-robot.png?id=31851313&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Three versions of the Optimus design: Concept, Development Platform, and Latest Generation. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Tesla</small>\n</p><p>\n\tMusk takes a break after this, and we get some actual specific information from a series of Tesla robotics team members about the latest generation Optimus.\n</p><h2>Optimus Hardware</h2><ul>\n<li>28 degrees of freedom</li>\n<li>11 additional degrees of freedom in each hand</li>\n<li>2.3 kilowatt-hour, 52-volt battery pack, “perfect for about a full day of work”</li>\n</ul><p>\n\tWe’ll come back to the hands, but that battery really stands out for being able to power the robot for an entire day(ish). Again, we have to point out that until Tesla actually demonstrates this, it’s not all that meaningful, but Tesla does know a heck of a lot about power systems and batteries, and I’m guessing that the company will be able to deliver on this.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Computer generated image showing the robot on the ground after a fall.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"e59f1d8ff5496a215b27f843f3306fd9\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"b3160\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/computer-generated-image-showing-the-robot-on-the-ground-after-a-fall.png?id=31851322&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Tesla is using simulations to design the robot’s structure so that it can suffer minimal damage after a fall.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Tesla</small>\n</p><p>\n\tI appreciate that Tesla is thinking very early about how to structure its robot to be able to fall down safely and get up again with only superficial damage—although the company doesn’t seem to be taking advantage of any kind of protective motion for fall mitigation, which is an active area of research elsewhere. And what is not mentioned in this context is the safety of others. I’m glad the robot won’t get damaged all that much when it falls, but can Tesla say the same for whoever might be standing next to it?\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Six images showing the robot's actuators.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"c235bcc540c0a617dbfb782ebce7e4c0\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"515eb\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/six-images-showing-the-robot-s-actuators.png?id=31851323&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Optimus will use six different actuators: three rotary and three linear units.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Tesla</small>\n</p><p>\n\tTesla’s custom actuators seem very reasonable. Not special, particularly, but Tesla has to make its own actuators if it needs a lot of them, which it supposedly will. I’d expect these to be totally decent considering the level of mechanical expertise Tesla has, but as far as I can tell nothing here is crazy small or cheap or efficient or powerful or anything like that. And it’s very hard to tell from these slides and from the presentation just how well the actuators are going to work, especially for dynamic motions. The robot’s software has a lot of catching up to do first.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Computer generated image showing the robot's hand.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"cd2a434449b0a323ab089975d7b5df1f\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"a4fb2\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/computer-generated-image-showing-the-robot-s-hand.png?id=31851339&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Optimus will feature a bioinspired hand design with cable-driven actuators.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Tesla</small>\n</p><p>\n\tEach hand has six cable-driven actuators for fingers and thumb (with springs to provide the opening force), which Tesla chose for simplicity and to minimize part count. This is perhaps a little surprising, since cable drives typically aren’t as durable and can be more finicky to keep calibrated. The five-finger hand is necessary, Tesla says, because Optimus will be working with human tools in human environments. And that’s certainly one perspective, although it’s a big trade-off in complexity. The hand is designed to carry a 9-kilogram bag.\n</p><h2>Optimus Software</h2><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Tesla engineer stands near Optimus prototype on stage.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"7942b73a6d6cf5b2901256f818314f70\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"4bd3a\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/tesla-engineer-stands-near-optimus-prototype-on-stage.png?id=31851341&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Tesla is using software components developed for its vehicles and porting them to the robot’s environment.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Tesla</small>\n</p><p>\n\tSoftware! The following quote comes from \n\t<a href=\"https://www.linkedin.com/in/milankovac/\" rel=\"noopener noreferrer\" target=\"_blank\">Milan Kovac</a>, who’s on the autonomy team.\n</p><blockquote>\n<em>All those cool things we showed earlier in the videos were possible in just a few months, thanks to the amazing work we’ve done on Autopilot over the past few years. Most of those components ported quite easily over to the bot’s environment. If you think about it, we’re just moving from a robot on wheels to a robot on legs. Some of the components are similar, and some others required more heavy lifting. </em>\n</blockquote><p>\n\tI still fundamentally disagree with the implied “humanoid robots are just cars with legs” thing, but it’s impressive that they were able to port much at all—I was highly skeptical of that last year, but I’m more optimistic now, and being able to generalize between platforms (on some level) could be huge for both Tesla and for autonomous systems more generally. I’d like more details on what was easy, and what was not.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Images showing how the robot sees the world through cameras and computer generated views.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"34e71d0c157cb3f93c78afa789ad3202\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"56dd7\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/images-showing-how-the-robot-sees-the-world-through-cameras-and-computer-generated-views.png?id=31851342&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Tesla showed how sensing used in its vehicles can help the Optimus robot navigate.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Tesla</small>\n</p><p>\n\tWhat we’re seeing above, though, is one of the reasons I was skeptical. That occupancy grid (where the robot’s sensors are detecting potential obstacles) on the bottom is very car-ish, in that the priority is to make absolutely sure that the robot stays very far away from anything it could conceivably run into.\n</p><p>\n\tBy itself, this won’t transfer well to a humanoid robot that needs to directly interact with objects to do useful tasks. I’m sure there are lots of ways to adapt the Tesla car’s obstacle-avoidance system, but that’s the question: How hard is that transfer, and is it better than using a solution developed specifically for mobile manipulators?\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Tesla engineer on stage next to Optimus prototype.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"fd7d7a62940c9cf92af59401309597cb\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"5ac5e\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/tesla-engineer-on-stage-next-to-optimus-prototype.png?id=31851349&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Tesla explained the challenges of dynamic walking in humanoid robots, and its approach to motion planning.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Tesla</small>\n</p><p>\n\tThe next part of the presentation focused on some motion planning and state-estimation stuff that was very basic, as far as I could make out. There’s nothing wrong with the basics, but it’s slightly weird that Tesla spent so much time on this. I guess it’s important context for most of the people watching, but the team sort of talked about it like they’d discovered how to do all of this stuff themselves, which I hope they didn’t, because again, very, very basic stuff that other humanoid robots have been doing for a very long time.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Slide shown by Tesla engineer to explain the robot's Motion Control.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"5351d3a2d227cdd24702f3a72085099c\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"3174c\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/slide-shown-by-tesla-engineer-to-explain-the-robot-s-motion-control.png?id=31851351&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Tesla adopted a traditional approach to motion control, based on a model of the robot and state estimation.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Tesla</small>\n</p><p>\n\tOne more quote from \n\t<a href=\"https://www.linkedin.com/in/milankovac/\" target=\"_blank\">Milan Kovac</a>:\n</p><blockquote>\n<em>Within the next few weeks, we’re going to start focusing on a real use case at one of our factories. We’re really going to try to nail this down, and iron out all of the elements needed to deploy this product in the real world. I’m pretty sure we can get this done within the next few months or years, and make this product a reality and change the entire economy.</em>\n</blockquote><p>\n\tIgnoring that last bit about changing the entire economy, and possibly also ignoring the time frame because “next few months or years” is not particularly meaningful, the push to make Tesla Bot useful is another substantial advantage that Tesla has. Unlike most companies working on humanoid robots, Tesla is potentially its own biggest customer, at least initially, and having these in-house practical tasks for the robot to train on could really help accelerate development.\n</p><p class=\"pull-quote\">\n\t“Optimus is designed to be an extremely capable robot, but made in very high volume, ultimately millions of units. And it is expected to cost much less than a car—much less than [US] $20,000 would be my guess.”\n\t<br/>\n\t—Elon Musk\n</p><p>\n\tHowever, I’m having trouble imagining what Tesla Bot would actually \n\t<strong>do</strong> in a factory that would be uniquely useful and not done better by a nonhumanoid robot. I’m very interested to see what Tesla comes up with here, and whether the company can make it happen in months (or years). I suspect it’s going to be much more difficult than it’s suggesting it will be, especially as it gets to 90 percent of where it wants to be and start trying to crack that last 10 percent that’s necessary for something reliable.\n</p><p>\n<span></span>This was the end of the formal presentation about Optimus, but there was a Q&A at the end with Musk where he gave some additional information about the robot side of things. He also gave some additional noninformation, which is worth including just in case you haven’t yet had enough eye rolling for one day.\n</p><h2>Audience Q&A</h2><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Elon Musk stands on stage with the Tesla AI team.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"c07fde9e7c6a986b25c10333adf1d915\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"2bfd5\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/elon-musk-stands-on-stage-with-the-tesla-ai-team.png?id=31851353&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Musk expects Optimus to cost less than a car, “much less than [US] $20,00 dollars would be my guess,” he said.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Tesla</small>\n</p><blockquote>\n<em>Our goal with Optimus is to have a robot that’s maximally useful as quickly as possible. There are a lot of ways to solve the various problems of a humanoid robot, and we’re probably not barking up the right tree on all the technical solutions. We’re open to evolving the technical solutions that you see here over time. But we had to pick something. We’re trying to follow the goal of fastest pathway to a useful robot that can be made at volume. And we’re going to test the robot internally in our factory to see how useful it is, because you have to close the loop on reality to confirm that the robot is, in fact, useful.</em>\n</blockquote><p>\n\tThis is a variation on the minimum-viable-product idea, although it seems to be more from the perspective of making a generalist robot, which is somewhat at odds with something minimally viable. It’s good that Musk views the hardware as something in flux, and that he’s framed everything within a plan for volume production. This isn’t the only way to do it—you can first build a useful robot and then figure out how to make it cheaper, but Tesla’s approach could get the company to production faster. If, that is, it is able to confirm that the robot is in fact useful. I’m still not convinced that it will be, at least not on a time scale that will satisfy Musk.\n</p><blockquote>\n<em>I think we’ll want to have really fun versions of Optimus. Optimus can be utilitarian, and do tasks, but it can also be like a friend, and a buddy, and hang out with you. I’m sure people will think of great uses for this robot. Once you have the core intelligence and actuators figured out, you can put all sorts of costumes, I guess, on the robot.</em>\n</blockquote><p>\n<div class=\"rblad-ieee_in_content\"></div>\n</p><p>\n\tWhile Musk seems to be mostly joking here, the whole “it’s going to be your friend” is really not a good perspective to bring to a robot like this, in my opinion. Or probably any robot, at all honestly.\n</p><blockquote>\n<em>We want over time for Optimus to be the kind of android that you see in sci-fi, like in Star Trek: The Next Generation, like Data. But obviously we could program the robot to be less robotlike and more friendly, and it can obviously learn to emulate humans and feel very natural.</em>\n</blockquote><p>\n\tLess robotlike and more friendly than a human pretending to be a robot trying to be a human? Good luck with that.\n</p><blockquote>\n<em>We’re going to start Optimus with very simple tasks in the factory, like maybe carrying a part from one place to another, or loading a part into a conventional robot cell. We’ll start with how do we make it useful at all, and then gradually expand the number of situations in which it’s useful. I think the number of situations where Optimus is useful will grow exponentially.</em>\n</blockquote><p>\n\tI think it’s more likely that in the short-to-medium term, Tesla will struggle to find situations where Optimus is uniquely useful in an efficient and cost-effective way.\n</p><blockquote>\n<em>In terms of when people can order one, I think it’s not that far away. I don’t know, I’d say within three years, probably not more than five years. </em>\n</blockquote><p>\n\tUh. Maybe as a research platform?\n</p><blockquote>\n<em>I think Optimus is going to be incredible in five years. In 10 years, mind-blowing. I’m really interested to see that happen, and I hope you are too.</em>\n</blockquote><p>\n\tDespite my skepticism on the time frame here, five years is a long time for any robot, and 10 years is basically forever. I’m also really interested to see these things happen, although Musk’s definitions of “incredible” and “mind-blowing” may be much different than mine. But we’ll see, won’t we?\n</p><h2>What’s Next for Tesla Bot?</h2><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Elon Musk with the Tesla AI team on stage.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"e60812eea3ae614cdd856560ee5de8a9\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"e9e95\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/elon-musk-with-the-tesla-ai-team-on-stage.jpg?id=31851355&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Tesla’s AI Day serves as a recruitment event for the company. “There’s still a lot of work to be done to refine Optimus and improve it, and that’s really why we’re holding this event—to convince some of the most talented people in the world to join Tesla,” Musk said.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Tesla</small>\n</p><p>\n\tI think Elon Musk now has a \n\t<a href=\"https://spectrum.ieee.org/elon-musk-robot\" target=\"_self\">somewhat better idea of what he’s doing with Tesla Bot</a>. The excessive hype is still there, but now that the company has actually built something, Musk seems to have a much better idea of how hard it actually is.\n</p><p>\n\tThings are only going to get more difficult from here.\n</p><p>\n\tMost of what we saw in the presentation was hardware. And hardware is important and a necessary first step, but software is arguably a much more significant challenge when it comes to making robotics useful in the real world. Understanding and interacting with the environment, reasoning and decision-making, the ability to learn and be taught new tasks—these are all necessary pieces of the puzzle of a useful robot that Tesla is trying to put together, but they’re all also extremely difficult, cutting-edge problems, despite the enormous amount of work that the research community has put into them.\n</p><p>\n\tAnd so far, we (still) have very little indication that Tesla is going to be any better at tackling this stuff than anyone else. There doesn’t appear to be anything all that special or exciting from Tesla that provides any unique foundation for Musk’s vision in a way that’s likely to allow the company to outpace other companies working on similar things. I’ll reiterate what I said a year ago: The hard part is not \n\t<em>building</em> a robot, it’s getting that robot to <em>do useful stuff</em>.\n</p><p class=\"pull-quote\">\n\t“I think Optimus is going to be incredible in five years. In 10 years, mind-blowing. I’m really interested to see that happen, and I hope you are too.”\n\t<br/>\n\t—Elon Musk\n</p><p>\n\tI could, of course, be wrong. Tesla likely has more resources to throw at this problem than almost anyone else. Maybe the automotive software will translate much better and faster than I think it will. There could be a whole bunch of simple but valuable use cases in Tesla’s own factories that will provide critical stepping-stones for Optimus. Tesla’s battery and manufacturing expertise could have an outsized influence on the affordability, reliability, and success of the robot. The company’s basic approach to planning and control could become a reliable foundation that will help the system mature faster. And the team is obviously very talented and willing to work extremely hard, which could be the difference between modest success and slow failure.\n</p><p>\n\tHonestly, I would love to be wrong. We’re just starting to see some realistic possibilities with commercial legged and humanoid robots. There are lots of problems to solve, but also lots of potential, and Tesla finding success would be a huge confidence boost in commercial humanoids broadly. We can also hope that all of the resources that Tesla is putting toward Optimus will either directly or indirectly assist other folks working on humanoid robots, if Tesla is willing to share some of what it learns. But as of today, this is all just hoping, and it’s on Tesla to actually make it happen.\n</p>",
  "pubDate": "Sat, 01 Oct 2022 18:50:51 +0000",
  "guid": "https://spectrum.ieee.org/tesla-optimus-robot",
  "category": [
    "Humanoid robots",
    "Tesla",
    "Optimus robot",
    "Elon musk",
    "Robotics",
    "Tesla",
    "Tesla bot"
  ],
  "dc:creator": "Evan Ackerman",
  "media:content": ""
}