{
  "id": "tag:blogger.com,1999:blog-2499715909956774229.post-6866895192997492494",
  "published": "2018-07-06T10:17:00.000-07:00",
  "updated": "2018-07-06T10:17:40.051-07:00",
  "title": "Fed Balance Sheet Policy, and Treasury Debt Management",
  "content": "I happened to be entertaining myself, reading the <a href=\"https://www.federalreserve.gov/monetarypolicy/fomcminutes20180613.htm\">FOMC minutes from the June 12-13 meeting,</a> when I ran across this, in a discussion led by the people from the New York Fed who manage the System Open Market Account (SOMA): <blockquote>The deputy manager followed with a discussion of money markets and open market operations. Rates on Treasury repurchase agreements (repo) had remained elevated in recent weeks, apparently responding, in part, to increased Treasury issuance over recent months. In light of the firmness in repo rates, the volume of operations conducted through the Federal Reserve's overnight reverse repurchase agreement facility remained low. Elevated repo rates may also have contributed to some upward pressure on the effective federal funds rate in recent weeks as lenders in that market shifted some of their investments to earn higher rates available in repo markets.</blockquote>First, it seems a good sign that the Fed is paying attention to Treasury debt management. After all, the large asset purchase programs the Fed engaged in from late 2008 to late 2014 were a form of debt management. The Fed conducted assets swaps of short-maturity reserves for long-maturity Treasuries and mortgage backed securities, and swaps of shorter-maturity Treasuries in its portfolio for long-maturity assets. In so doing, the Fed wanted to change relative asset supplies at different maturities with the purpose of altering the term structure of interest rates - basically, flattening in the yield curve. Or, that was the theory, at least.<br /><br />But in conducting its quantitative easing (QE) programs, the Fed appeared to be paying no attention to what the Treasury was doing. That's somewhat disturbing, as one of the Treasury's jobs is to manage the government debt - to decide when to issue debt, how much to issue, and what maturities to issue. If the Fed wants to manage the government debt, maybe it should be coordinating with the Treasury, or maybe it should ask Congress to add debt management to the Fed's job description.<br /><br />But, back to the FOMC minutes. The quote is factually correct, in that there was larger issuance of Treasury securities in the first part of this year:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-ohakqHUORX0/Wz-SgZo5EII/AAAAAAAADHQ/8NDwC0e7xbcv7C15CdMq3hnFBCKRKIFZQCLcBGAs/s1600/iss.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://3.bp.blogspot.com/-ohakqHUORX0/Wz-SgZo5EII/AAAAAAAADHQ/8NDwC0e7xbcv7C15CdMq3hnFBCKRKIFZQCLcBGAs/s640/iss.png\" width=\"640\" height=\"511\" data-original-width=\"1048\" data-original-height=\"837\" /></a></div>You can't quite see it in that chart, but it helps to take a 6-month moving average:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-aVxrsDQNNb4/Wz-TRtYN0sI/AAAAAAAADHY/LW1eoJ7EeP8wx-9d0WQWQrH1kiRqSUFkgCLcBGAs/s1600/aver.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-aVxrsDQNNb4/Wz-TRtYN0sI/AAAAAAAADHY/LW1eoJ7EeP8wx-9d0WQWQrH1kiRqSUFkgCLcBGAs/s640/aver.png\" width=\"640\" height=\"521\" data-original-width=\"1034\" data-original-height=\"842\" /></a></div>So, indeed, average issuance over the last six months took a jump of about $100 billion per month early this year, relative to last year. If you thought about that in the context of a reduction in the Fed's uptake of Treasuries and close substitutes, with the reduction in that monthly uptake currently capped at $30 billion, then it might seem like the Treasury's activities are more important. In <a href=\"http://newmonetarism.blogspot.com/2018/07/fed-balance-sheet-news.html\">my last post,</a> I was blaming the cessation of the Fed's reinvestment program for the tightening up of overnight interest rates. That is, all overnight interest rates - repo rates, the fed funds rate - are close to the interest rate on reserves (IOER) currently, and that's a new phenomenon. In the quote above, it looks like the SOMA people are blaming the Treasury for this. A bit of an odd tactic that, as one might think the Fed would take the blame when their floor system starts to work the way it should.<br /><br />But, that increase in new Treasury issues in January through May of this year didn't occur for no reason. When the Treasury has a month when a lot of government debt matures, it will issue more Treasuries to finance the principal payments and to fill the holes in financial markets left by the departing Treasuries. We should actually be more interested in net Treasury issue - the value of new securities sold minus the outflow from maturing debt. Here's what that looks like:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-bK1KWbAA6Eo/Wz-eXHg89JI/AAAAAAAADHo/zLQlDRXHK0g9BoHA5dsZjaynDtdqsrd_QCLcBGAs/s1600/net.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-bK1KWbAA6Eo/Wz-eXHg89JI/AAAAAAAADHo/zLQlDRXHK0g9BoHA5dsZjaynDtdqsrd_QCLcBGAs/s640/net.png\" width=\"640\" height=\"513\" data-original-width=\"1045\" data-original-height=\"837\" /></a></div>So, nothing particularly unusual going on there recently. Just for good measure, we'll look at a 6-month moving average as well:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-3ZD-wW7oX04/Wz-fY6hhQjI/AAAAAAAADH0/z7u8oqsm9Ww6T1fLZz7yYUQ3OPRo3cy-ACLcBGAs/s1600/netav.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-3ZD-wW7oX04/Wz-fY6hhQjI/AAAAAAAADH0/z7u8oqsm9Ww6T1fLZz7yYUQ3OPRo3cy-ACLcBGAs/s640/netav.png\" width=\"640\" height=\"518\" data-original-width=\"1034\" data-original-height=\"837\" /></a></div>That spikes up in the first part of this year, but it was also way down in the last part of last year. Also, note the quantities here. The cap on the value of securities in its portfolio the Fed will allow to mature is currently $30 billion, and that will increase to $40 billion in July, and finally $50 billion. The net flow of new Treasuries has averaged about $60 billion since 2014, so $30-$50 billion is large relative to that and, I think, consistent with the idea that it's the Fed's non-reinvestment policy that's mitigating a scarcity of safe collateral in the repo market. We have to account for mortgage-backed securities in the calculation, but I don't think that changes the story.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Stephen Williamson",
    "uri": "http://www.blogger.com/profile/01434465858419028592",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 3
}