{
  "title": "#149/Modernism Week: The Alexander's Winning Bet + Colleen Duffy of Devil Doll",
  "pubDate": "Mon, 22 Jun 2020 07:00:00 +0000",
  "guid": "9523b2cb-d018-4b2f-af5c-7e2d5aceba15",
  "link": "https://traffic.libsyn.com/secure/usmodernist/USM_149_V2.mp3",
  "itunes:image": "",
  "description": "<p>There’s a shining star for <strong>Robert and Helene Alexander</strong> on the Palm Springs Walk of Stars - installed last February during Modernism Week.  Although largely unknown outside of California, the Alexanders were critically important developers and builders to the expansion of Modernism. While other developers were afraid of Modernist design, as a lot still are today, sad to say, the Alexanders went all-in, working with important architects like <a href= \"http://www.usmodernist.org/cody\"><strong>William Cody</strong></a> and <a href=\"http://www.usmodernist.org/krisel\"><strong>Bill Krisel</strong></a> to create thousands of homes we love around Palm Springs. Host <strong>George Smart</strong> talks with <strong>Jill Alexander Kitnick</strong>, daughter of the Alexanders, and <strong>Jim Harlan</strong>, author of a new book on the Alexanders. </p> <p>Later in the show, George and Tom chat with special musical guest <strong>Colleen Duffy</strong> from Devil Doll, singing from her new album plus her biggest hit Bourbon in your Eyes. </p>",
  "content:encoded": "<p>There’s a shining star for Robert and Helene Alexander on the Palm Springs Walk of Stars - installed last February during Modernism Week.  Although largely unknown outside of California, the Alexanders were critically important developers and builders to the expansion of Modernism. While other developers were afraid of Modernist design, as a lot still are today, sad to say, the Alexanders went all-in, working with important architects like <a href= \"http://www.usmodernist.org/cody\">William Cody</a> and <a href=\"http://www.usmodernist.org/krisel\">Bill Krisel</a> to create thousands of homes we love around Palm Springs. Host George Smart talks with Jill Alexander Kitnick, daughter of the Alexanders, and Jim Harlan, author of a new book on the Alexanders. </p> <p>Later in the show, George and Tom chat with special musical guest Colleen Duffy from Devil Doll, singing from her new album plus her biggest hit Bourbon in your Eyes. </p>",
  "enclosure": "",
  "itunes:duration": "57:05",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "There’s a shining star for Robert and Helene Alexander on the Palm Springs Walk of Stars - installed last February during Modernism Week.  Although largely unknown outside of California, the Alexanders were critically important developers and...",
  "itunes:episodeType": "full",
  "itunes:author": "george smart"
}