{
  "id": "tag:blogger.com,1999:blog-15418143.post-3843217399785041099",
  "published": "2015-11-07T03:35:00.001-05:00",
  "updated": "2016-06-13T07:41:20.597-05:00",
  "category": [
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  "title": "The Deep Learning Gold Rush of 2015",
  "content": "In the last few decades, we have witnessed major technological innovations such as personal computers and the internet finally reach the mainstream. And with mobile devices and social networks on the rise, we're now more connected than ever. <i>So what's next? When is it coming? And how will it change our lives?</i> Today I'll tell you that the next big advance is well underway and it's being fueled by a recent technique in the field of&nbsp;Artificial Intelligence<b> </b>known as<b>&nbsp;Deep Learning</b>.<br /><div style=\"text-align: center;\"><b><br class=\"Apple-interchange-newline\" /></b></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://2.bp.blogspot.com/-KLOHUJmgbR4/VjRs4tdbZ8I/AAAAAAAAOU8/QzvI87MUF18/s1600/california_gold_rush-01.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"256\" src=\"https://2.bp.blogspot.com/-KLOHUJmgbR4/VjRs4tdbZ8I/AAAAAAAAOU8/QzvI87MUF18/s400/california_gold_rush-01.png\" width=\"400\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><i>The California Gold Rush of 2015 is all about Deep Learning.&nbsp;</i></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><i>It's everywhere, you just don't know how to look.</i></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><br />All of today's excitement in Artificial Intelligence and Machine Learning stems from ground-breaking results in speech and visual object recognition using Deep Learning[1]. These algorithms are being applied to all sorts of data, and the learned deep neural networks outperform traditional expert systems carefully designed by scientists and engineers. End-to-end learning of deep representations from raw data is now possible due to a handful of well-performing deep learning recipes (<a href=\"http://www.cs.nyu.edu/~yann/talks/lecun-ranzato-icml2013.pdf\">ConvNets</a>, <a href=\"https://www.cs.toronto.edu/~hinton/absps/JMLRdropout.pdf\">Dropout</a>, <a href=\"http://www.cs.toronto.edu/~fritz/absps/reluICML.pdf\">ReLUs</a>, <a href=\"http://deeplearning.cs.cmu.edu/pdfs/Hochreiter97_lstm.pdf\">LSTM</a>, <a href=\"https://www.cs.toronto.edu/~vmnih/docs/dqn.pdf\">DQN</a>,&nbsp;<a href=\"http://www.image-net.org/\">ImageNet</a>).&nbsp;But if there's one final takeaway that we can extract from decades of machine learning research, is that for many problems going deep isn't a choice, it's often a <i>requirement</i>.<br /><br />Most of the apps and services you're already using (AirBnB, Snapchat, Twitch.tv, Uber, Yelp, LinkedIn, etc) are quite data-hungry and before you know it, they're all going to go mega-deep. So whether you need to revitalize your data science team with deep learning or you're starting an AI-from-day-one operation, it's pretty clear that everybody is rushing to get some of this&nbsp;<b>Silicon Valley Gold.</b><br /><br /><h3>From Titans to Gold Miners: Your atypical Gold Rush</h3>Like all great gold rushes, this movement is led by new faces, which are pouring into Silicon Valley like droves. But these aren't your typical unskilled immigrants willing to pick up a hammer, nor your fresh computer science grads with some app-writing skills. The key deep learning players of today (known as the Titans of Deep Learning) are computer science professors and researchers (seldom born in the USA) leaving their academic posts and bringing their students and ideas straight into Silicon Valley.<br /><br /><div style=\"text-align: center;\">\"<i>Turn on, Tune in, Dropout</i>\" -- Timothy Leary</div><br />Recently, Google and Facebook announced that their operations are now being powered by Deep Learning [2,3]. And with most Deep Learning Titans representing the tech giants (<a href=\"http://yann.lecun.com/\">Yann LeCun</a> at Facebook Research, <a href=\"http://www.cs.toronto.edu/~hinton/\">Geoffrey Hinton</a> at Google, <a href=\"http://www.andrewng.org/\">Andrew Ng</a> at Baidu), <b>Deep Learning is likely to become one of the most sought after tech skills</b>. With&nbsp;<a href=\"http://fortune.com/2015/11/06/toyota-ai-silicon-valley-robotics/\">Toyota to invest in $1 Billion in Robotics and Artificial Intelligence Research</a>&nbsp;(November 6, 2015), the announcement of&nbsp;<a href=\"http://blog.ycombinator.com/yc-research\">YC Research</a>&nbsp;(October 7, 2015), and the new&nbsp;<a href=\"https://www.google.com/about/careers/search#!t=jo&amp;jid=147545001&amp;\">Google Brain Residency Program</a>&nbsp;\"Pre-doc\" AI jobs (October 26, 2015), Silicon Valley just got a whole lot more interesting.<br /><br /><h3><b>Silicon Valley re-defines itself, yet again&nbsp;</b></h3>To understand why it took so long for Deep Learning to take-off, let's take a brief look at the key technologies which defined Silicon Valley over the last 50 years. &nbsp;The following timeline gives an overview of where Silicon Valley has been and where it's going.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://2.bp.blogspot.com/-8GD4qeDAvow/VjRx4jVpD8I/AAAAAAAAOVM/59xpx5CH1jk/s1600/mi-01.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"255\" src=\"https://2.bp.blogspot.com/-8GD4qeDAvow/VjRx4jVpD8I/AAAAAAAAOVM/59xpx5CH1jk/s400/mi-01.png\" width=\"400\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><span style=\"font-size: xx-small;\">Figure Adapted from <a href=\"http://steveblank.com/secret-history/\">Steve Blank's Secret History of Silicon Valley</a></span></div><br /><br /><b>1970s: Semiconductors&nbsp;</b><br />The story of the digital-era starts with semiconductors. \"Silicon\" in \"Silicon Valley\" originally referred to the silicon chip or integrated circuit innovations as well as the location (close to Stanford) of much tech-related activity. The dominant firm from that time period was Fairchild Semiconductor International and it eventually gave rise to more recognizable companies like Intel. For a more detailed discussion of this birthing era, take a look at Steve Blank's <a href=\"http://steveblank.com/secret-history/\">Secret History of Silicon Valley</a>[4].<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://tctechcrunch2011.files.wordpress.com/2014/07/endeavor-insight-sv-2-retina.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"http://tctechcrunch2011.files.wordpress.com/2014/07/endeavor-insight-sv-2-retina.png\" height=\"400\" width=\"395\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><span style=\"font-size: x-small;\">Read more about Fairchild at&nbsp;TechCrunch's <a href=\"http://techcrunch.com/2014/07/26/the-first-trillion-dollar-startup/\">First Trillion-Dollar Startup&nbsp;</a></span></div><br /><b>1980s: Personal Computers</b><br />Initially computers were quite large and used solely by research labs, government, and big businesses. But it was the personal computer which turned computer programming from a hobby into a vital skill. You no longer needed to be an MIT student to program on one of these badboys. While both Microsoft and Apple were founded in 1975 and 1976, respectively, they persevered due to their pioneering work in graphical user interfaces. This was the birth of the modern user-friendly Operating System. IBM approached Microsoft in 1980, regarding its upcoming personal computer, and from then on Microsoft would be King for a very long time.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://www.mac-history.net/wp-content/uploads/2011/01/PC_IBM_03_10_1983_BW_939.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"http://www.mac-history.net/wp-content/uploads/2011/01/PC_IBM_03_10_1983_BW_939.jpg\" height=\"400\" width=\"298\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><span style=\"font-size: x-small;\">See Mac-history's article on <a href=\"http://www.mac-history.net/apple/2011-01-30/microsofts-relationship-with-apple\">Microsoft's relationship with Apple</a></span></div><br /><br /><b>1990s: Internet</b><br />While the nerds at Universities were posting ascii messages on newsgroups in the 90s, service providers in the 1990s like AOL helped make the internet accessible to everyone. Remember getting all those AOL disks in the mail? Buying a chunk of digital real state (your own domain name) became possible and anybody with a dial up connection and some primitive text/HTML skills could start posting online content. With a mission statement like \"organize the world's information\", it was eventually Google that got the most of out the late 90s dot-com bubble, and remains a very strong player in all things tech.<br /><br /><b>2000s:&nbsp;</b><b>Mobile</b><b>&nbsp;and Social</b><br />While the dot-com bubble was about creating an online presence for startups and established companies, the way we use the internet has dramatically changed since 2001. A ton of new social communities have emerged, and due to Facebook we're now stars in our own reality show. Social and advertising have essentially turned the modern internet into a mainstream TV-like experience. The internet is no longer only for the nerds. The kings of this era (Google and Facebook) are also the biggest players in the Deep Learning space, because they have the largest user bases and in-house apps which can benefit most from machine learning.<br /><br /><b>2010-2015: Deep Learning comes to the party</b><br /><span style=\"text-align: center;\">Spend more than a day in Silicon Valley and you'll hear the popular expression, \"Software is eating the world.\"&nbsp;</span><span style=\"text-align: center;\">Rampant spreading of software was only possible once the internet (1990s) AND mobile devices (2000s) became essential parts of our lives. No longer do we physically mail floppy disks, and social media fuels any app that goes viral.&nbsp;</span><span style=\"text-align: center;\"><span style=\"text-align: start;\">What traditional software is missing (or has been missing up until now) is the ability to improve over time from everyday use.&nbsp;</span></span><span style=\"text-align: center;\">If that same software is able to connect to a large Deep Learning system and start improving, then we have a game-changer on our hands. This is already happening with online advertising, digital assistants like Siri, and smart auto-responders like <a href=\"http://googleresearch.blogspot.com/2015/11/computer-respond-to-this-email.html\">Google's new email auto-reply feature</a>.</span><br /><br /><span style=\"text-align: center;\"><br /></span><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://4.bp.blogspot.com/-dJHGkYU-o9M/VjSBqTFLu1I/AAAAAAAAOVc/LydkP3tNOZ8/s1600/single_layer.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"182\" src=\"https://4.bp.blogspot.com/-dJHGkYU-o9M/VjSBqTFLu1I/AAAAAAAAOVc/LydkP3tNOZ8/s400/single_layer.png\" width=\"400\" /></a></div><div class=\"\" style=\"clear: both; text-align: center;\"><span style=\"font-size: x-small;\">The hierarchical award-winning&nbsp;<i>\"AlexNet\"</i>&nbsp;Deep Learning architecture&nbsp;</span></div><div class=\"\" style=\"clear: both; text-align: center;\"><span style=\"font-size: x-small;\">Visualized using MIT's Toolbox for&nbsp;<a href=\"http://vision03.csail.mit.edu/cnn_art/index.html\">Deep Learning Neuron Visualization</a></span></div><div><br /></div><br />Massive hiring of deep learning experts by the leading tech companies has only begun, but we also should be on the lookout for new ventures built on top of Deep Learning, not just a revitalization of last decade's successes. On this front, keep a close look at the following&nbsp;<i>Deep Learning Cloud Service</i>&nbsp;upstarts:&nbsp;<a href=\"http://www.socher.org/\">Richard Socher</a>&nbsp;from&nbsp;<a href=\"http://metamind.io/\">MetaMind</a>,&nbsp;<a href=\"http://www.matthewzeiler.com/\">Matthew Zeiler</a>&nbsp;from&nbsp;<a href=\"http://clarifai.com/\">Clarifai</a>, and <a href=\"http://homes.cs.washington.edu/~guestrin/\">Carlos Guestrin</a> from <a href=\"https://dato.com/\">Dato</a>.<br /><i><br /></i><b>2015-2020: Deep Learning Revitalizes Robotics</b><br />Recently it has been shown that Deep Learning can be used to help robots learn tasks involving movement, object manipulation, and decision making[6,7,8,9]. Before Deep Learning, lots of different pieces of robotic software and hardware would have to be developed independently and then hacked together for demo day. Today, you can use one of a handful of \"Deep Learning for Robotics recipes\" and start watching your robot learn the task you care about.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://www.technologyreview.com/sites/default/files/images/Baxter%20grip.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"http://www.technologyreview.com/sites/default/files/images/Baxter%20grip.png\" height=\"320\" width=\"257\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><span style=\"text-align: start;\">Robots Learns to Grasp using Deep Learning at Carnegie Mellon University.&nbsp;</span></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><span style=\"text-align: start;\"><a href=\"http://arxiv.org/abs/1509.06825\">Supersizing Self-supervision: Learning to Grasp from 50K Tries and 700 Robot Hours</a>&nbsp;</span>[6]</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><span style=\"text-align: start;\"><br /></span></div>With their 2013 acquisition of Boston Dynamics (a hardware play), 2014 acquisition of DeepMind (a software play), and a serious autonomous car play, Google is definitely early to the Robotics party. But the noteworthy bits are happening at the intersection of deep learning and robotics. &nbsp;I suggest taking a closer look at the Robotics research of <a href=\"http://www.cs.berkeley.edu/~pabbeel/\">Pieter Abbeel</a> of Berkeley, <a href=\"http://www.cs.cmu.edu/~abhinavg/\">Abhinav Gupta</a> of Carnegie Mellon, and <a href=\"http://www.cs.stanford.edu/people/asaxena/index.html\">Ashutosh Saxena</a> of Stanford -- all likely stars in the next<i> Deep Learning for Robotics</i> race. As long as <a href=\"http://people.csail.mit.edu/brooks/\">Rodney Brooks</a> keeps creating innovative Robotics platforms like Baxter, my expectations for Robotics are off the charts.<br /><br /><h3>Conclusion</h3>Unlike in 1849, the Deep Learning Gold Rush of 2015 is <i>not</i> going to bring some 300,000 gold-seekers in boats to California's mainland. This isn't a bring-your-own-hammer kind of game -- the Titans have already descended from their Ivory Towers and handed us ample mining tools. But it won't hurt to gain some experience with traditional \"shallow\" machine learning techniques so you can appreciate the power of Deep Learning.<br /><br />I hope you enjoyed today's read and have a better sense of how Silicon Valley is undergoing a transformation. And remember, today's wave of Deep Learning upstart CEOs have PhDs, but once Deep Learning software becomes more user-friendly (TensorFlow?), maybe&nbsp;you won't have to wait so long to <i>dropout</i>.<br /><br /><br /><b>References</b><br /><br /><span style=\"font-size: x-small;\">[1] Krizhevsky, A., Sutskever, I. and Hinton, G. E.&nbsp;<a href=\"http://papers.nips.cc/paper/4824-imagenet-classification-with-deep-convolutional-neural-networks.pdf\">ImageNet Classification with Deep Convolutional Neural Networks.</a>&nbsp;In NIPS 2012.</span><br /><span style=\"font-size: x-small;\">[2] D'Onfro, J.&nbsp;<a href=\"http://www.businessinsider.com/google-on-machine-learning-2015-10\">Google is 're-thinking' all of its products to include machine learning.</a>&nbsp;Business Insider. October 22, 2015.</span><br /><span style=\"font-size: x-small;\">[3] D'Onfro, J.&nbsp;<a href=\"http://how%20facebook%20will%20use%20artificial%20intelligence%20to%20organize%20insane%20amounts%20of%20data%20into%20the%20perfect%20news%20feed%20and%20a%20personal%20assistant%20with%20superpowers/\">How Facebook will use artificial intelligence to organize insane amounts of data into the perfect News Feed and a personal assistant with superpowers</a>. Business Insider. November 3, 2015.</span><br /><span style=\"font-size: x-small;\">[4] Blank, S.&nbsp;<a href=\"http://steveblank.com/secret-history/\">Secret History of Silicon Valley</a>. 2008.</span><br /><span style=\"font-size: x-small;\">[5]&nbsp;Donglai Wei, Bolei Zhou, Antonio Torralba William T. Freeman. <a href=\"http://vision03.csail.mit.edu/cnn_art/index.html\">mNeuron: A Matlab Plugin to Visualize Neurons from Deep Models</a>. 2015.</span><br /><span style=\"font-size: x-small;\">[6] Lerrel Pinto, Abhinav Gupta. <a href=\"http://arxiv.org/abs/1509.06825\">Supersizing Self-supervision: Learning to Graspfrom 50K Tries and 700 Robot Hours</a>. arXiv. 2015.</span><br /><span style=\"font-size: x-small;\">[7] Sergey Levine, Chelsea Finn, Trevor Darrell, Pieter Abbeel.&nbsp;<a href=\"http://rll.berkeley.edu/RSS2015-BlueSky-Shakey/Levine-ShakeyWS-2015.pdf\">End-to-End Training of Deep Visuomotor Policies</a>. In RSS 2015.</span><br /><span style=\"font-size: x-small;\">[8]&nbsp;Mnih, Volodymyr, et al. \"<a href=\"http://www.nature.com/nature/journal/v518/n7540/full/nature14236.html\">Human-level control through deep reinforcement learning</a>.\" Nature 518.7540 (2015): 529-533.</span><br /><span style=\"font-size: x-small;\">[9] Ian Lenz, Ross Knepper, and Ashutosh Saxena. <a href=\"http://deepmpc.cs.cornell.edu/\">DeepMPC: Learning Deep Latent Features for Model Predictive Control</a>. &nbsp;In Robotics Science and Systems (RSS), 2015</span><br /><br /><br /><div><br /></div><br /><br /><br /><br /><br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Tomasz Malisiewicz",
    "uri": "http://www.blogger.com/profile/17507234774392358321",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 4
}