{
  "id": "tag:blogger.com,1999:blog-2957813557601703695.post-4111774385042629385",
  "published": "2022-10-25T17:01:00.006+05:00",
  "updated": "2022-10-25T17:01:47.400+05:00",
  "category": [
    "",
    "",
    "",
    ""
  ],
  "title": "LUMS Energy Institute makes important contribution to Pakistan’s Electricity Analysis",
  "content": "<p>Lahore: The LUMS Energy Institute released its second edition of Pakistan Electricity Outlook 2022 - a report with a detailed analysis of the electric power system of Pakistan. It carries a critical review of the National Transmission &amp; Despatch Company’s (NTDC) Indicative Generation Capacity Expansion Plan (IGCEP) for 2021.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhhbhDR_nc_uZTosF8lwVnq5eXg1CrUypVOG-yH-SqgY41wrqDhivmhZEYLw_nHOmnjN88JG74yMFSHVMIOJRV_GPcCNQ84j-LKB5Yw3jJVRD3YRLlGqf50S2U4Vi8cENfbr-IWhGmrD5dko3YLOOSvMkPWlV_5HKuEvf3XWaQj63KEezVWfwTPhToNDA/s746/LEI%20-%20Image%20-%20English%20(2).jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"526\" data-original-width=\"746\" height=\"452\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhhbhDR_nc_uZTosF8lwVnq5eXg1CrUypVOG-yH-SqgY41wrqDhivmhZEYLw_nHOmnjN88JG74yMFSHVMIOJRV_GPcCNQ84j-LKB5Yw3jJVRD3YRLlGqf50S2U4Vi8cENfbr-IWhGmrD5dko3YLOOSvMkPWlV_5HKuEvf3XWaQj63KEezVWfwTPhToNDA/w640-h452/LEI%20-%20Image%20-%20English%20(2).jpg\" width=\"640\" /></a></div><br /><p><br /></p><p>During the ceremony, Dr. Fiaz Chaudhry, Director, of LUMS Energy Institute, shared that following the launch of the first edition of the Pakistan Electricity Outlook released in January 2020, spurred unprecedented decisions in the power sector by the government.&nbsp;</p><p>“LUMS Energy Institute was established as a think-tank and centre of excellence for improved policy outcomes across the energy landscape of Pakistan. We are proud to operate as a knowledge hub of Pakistan in the most objective manner and will continue to do so to exemplify talent, independence, and professionalism,” said Dr. Chaudhry.</p><p>The Report involves modelling and analysis of the NTDC system through LUMS in-house Power Dispatch Model (LPDM) from 2022 up to 2029-30. The results cover several points like capacity and energy balance, dispatch analyses by fuel type, capacity payments, energy payments, power purchase price, and projected quantities of fuels. It also analyses nine alternative scenarios to demonstrate the impact on IGCEP outlook, when key variables are changed.</p><p>The Pakistan Electricity Outlook 2022 reveals that a period of the expensive capacity surplus will sustain over the modelled period, ranging from over 15% in summers to over 40% in winters over peak demand, despite an optimistic growth in projected demand. This means that the amount of capacity the government has already installed (including that which is under construction/development)—the power system—will remain in surplus capacity, much more than needed. As a result, consumers will be bound to pay for this excess capacity regardless of use, which is currently 900 billion and will rise to 1600 billion by 2030.&nbsp;</p><p>Representatives of public and private Energy companies took part in the event and lauded the efforts of the Institute. The Report was presented to US Ambassador Donald Blome who visited the LUMS Energy Institute to discuss potential collaboration in Green Energy solutions.&nbsp;</p><div><br /></div><div class=\"blogger-post-footer\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js\"></script>\n<!-- MobileAds -->\n<ins class=\"adsbygoogle\"\n     style=\"display:inline-block;width:320px;height:50px\"\n     data-ad-client=\"ca-pub-2762820915666464\"\n     data-ad-slot=\"9814557735\"></ins>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Admin",
    "uri": "https://www.blogger.com/profile/00179371387546033311",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}