{
  "id": "https://bibleinoneyear.org/en/youth/123",
  "title": "Day 123: How to Make Good Choices",
  "description": "Psalm 55:22, 23c, Joshua 24:14–15a, 15c, John 3:30, 34–36.  Your choices matter  Some choices have life-changing consequences",
  "pubDate": "Tue, 03 May 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/123/",
  "itunes:duration": "13:40",
  "guid": "enyouth03052022-123",
  "length": 820.22,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 123: How to Make Good Choices",
  "itunes:subtitle": "Psalm 55:22, 23c, Joshua 24:14–15a, 15c, John 3:30, 34–36.  Your choices matter  Some choices have life-changing consequences",
  "itunes:summary": "Before we start the Bible in One Year for today we wanted to let you know about our annual Leadership Conference coming up on Tuesday 4 May and again on Wednesday 5 May. It’s online, 2 hours, and free – and we would love you to join us. Pippa and I will be hosting live from London and we will be speaking to some hugely inspiring friends including the Archbishop of Cape Town, Thabo Makgoba, Rick and Kay Warren (co pastors of Saddleback church), Heidy Quah, founder of Refuge for the Refugees, and Francis Collins – one of the greatest scientists in our world today, who is leading the charge in the fight against Covid 19. Our hope is that everyone who joins will be inspired, encouraged, and refreshed by the Holy Spirit. To find out more and to register please visit leadershipconference.org.uk.\nCharles Finney, lawyer and evangelist, was speaking in a New York church in the 1830s. At the end of each evening, he gave people the opportunity to come to the front of the room and commit their life to Jesus. A great many lawyers came to hear him. One night, the Chief Justice of New York was sitting way up in the gallery. As he listened to Finney proclaiming the gospel he became convinced it was true.\nThen this question came into his mind: ‘Will you go forward like the other ordinary people?’ Something within him made him think that it would be inappropriate to do so, because of his prestigious social position (at the top of the legal hierarchy of New York State). He sat there pondering the choice he had to make. Then he thought, ‘Why not? I am convinced of the truth... why should I not do it like any other person?’\nHe got up from his seat in the gallery, went down the staircase and came up the stairs at the back to where Finney was preaching. Finney, in the middle of his sermon, felt someone tugging at his jacket. He turned around. The Chief Justice said, ‘Mr Finney, if you will call people forward I will come.’ Finney stopped his talk and said, ‘The Chief Justice says that if I call people forward he will come. I ask you to come forward now.’\nThe Chief Justice went forward. Almost every lawyer in Rochester, New York, followed him! It is said that 100,000 people were converted in the next twelve months in that area. One person’s choice affected the lives of numerous others.\nLife is full of choices. We make choices every day of our lives. You can make bad choices or you can make good choices. Your choices matter. Some choices have life-changing consequences.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 488
}