{
  "title": "#419: Snape Loves Dumbledore (HBP 27, The Lightning Struck Tower)",
  "link": "https://audioboom.com/posts/7278534",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5019,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>We're joined by Slug Club member Alicia, who wants to know: How does Ollivander's stay in business?</li>\n<li>Harry Potter and the Cursed Child is coming to Canada -- it's the sixth production!</li>\n<li>MuggleMail: Horcruxes probably can't be made via assisted suicide; what's the best DVD/Blu-ray set available?; thank goodness the Trio didn't have to go into The Cave; in defense of Harry Potter.</li>\n<li>We've passed 1,000 Patrons, an amazing milestone! Thank you to everyone for their support.</li>\n<li>Chapter by Chapter: Half-Blood Prince Chapter 27, The Lightning Struck Tower.</li>\n<li>Harry has to face one of the worst situations for a child to be in.</li>\n<li>Dumbledore once again experiences The Surge: He's damn good on a broom.</li>\n<li>Dumbledore speaks to Draco in a way that's reminiscent of how he'd speak to Tom.</li>\n<li>Harry needs a cloak that deflects spells -- he's been frozen under the cloak twice in one book.</li>\n<li>Why is Draco incapable of killing Dumbledore?</li>\n<li>Would this have been a different situation if Draco were a few years older?</li>\n<li>Severus... Please: This line was an amazing bit of work from Rowling.</li>\n<li>Snape's Avada Kedavra isn't written like the Killing Curse typically is. Is it because Snape was also trying to A) Prove he meant it, and B) move the body away from further harm?</li>\n<li>To say goodbye to Dumbledore, we read Patrons' favorite Dumbledore lines in Dumbledore (and Micah) voices.</li>\n<li>In light of analyzing this scene, we revisit Andrew's Astronomy Tower of Terror ride idea. This time it has exciting new twists!</li>\n<li>Quizzitch: Who did Draco mistake for being dead?</li>\n<li>This week's episode is brought to you by The Wizarding World Figurine Collection from Eaglemoss Hero Collector (get two figurines for the price of one, plus free shipping, at <a href=\"http://HeroCollector.com/Wizards\">HeroCollector.com/Wizards</a>) and OpenFit (text MuggleCast to 303030 for a FREE month trial)!</li>\n</ul>\n",
  "pubDate": "Mon, 03 Jun 2019 13:38:45 +0000",
  "guid": "tag:audioboom.com,2019-06-03:/posts/7278534",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}