{
  "title": "Twitter verification has always been a mess. Charging $8 a month won’t fix it.",
  "description": "<p>It’s only been a matter of days since Elon Musk took over Twitter, but he’s already shaking up the platform in major ways. Few of his ideas have attracted as much attention, or controversy, as his plan to start charging for verification as part of a bigger overhaul to Twitter’s subscription service, Blue.</p><p>Calling the current system “bullshit,” he said that his plan is to add verification as a perk to Twitter Blue, which will increase in price from $5 a month to $8 a month. All users who pay will get the checkmark, while those who don’t — even if they were verified under Twitter's previous system — will lose it. Subscriptions will also reduce ads and make accounts more visible in replies and search, a sort of anti-shadowban.</p><span id=\"end-legacy-contents\"></span><div id=\"49dd6f7ac5624101ad5dcea17396ad55\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Twitter’s current lords & peasants system for who has or doesn’t have a blue checkmark is bullshit. <br><br>Power to the people! Blue for $8/month.</p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1587498907336118274?ref_src=twsrc%5Etfw\">November 1, 2022</a></blockquote></div><p>But while Musk’s plans may win him some fans among those who despise the idea of “blue check Twitter,” it also shows that he fundamentally misunderstands verification. And while he is correct that the current system is broken, charging for verification would make it worse, not better.</p><h2>Verification is about authenticity</h2><p>Musk’s plan ignores the reason verification was created to begin with: to convey authenticity. Because Twitter doesn’t have a real-names policy, a verified badge helps distinguish whether an account belongs to the person or entity whose name is at the top. From Twitter’s <a href=\"https://help.twitter.com/en/managing-your-account/about-twitter-verified-accounts\">help center:</a> “The blue Verified badge on Twitter lets people know that an account of public interest is authentic.”</p><p>It may seem like a status symbol to some, but the reason it’s handed out to journalists, celebrities, public officials and other notable figures is because there is inherent risk in <em>not verifying</em> those people.</p><p>“Verification was never meant to convey status,” says Nu Wexler, a policy consultant and former policy communications rep at Twitter. “It was simply a way for Twitter to address impersonation attempts.”</p><figure><img src=\"https://s.yimg.com/os/creatr-uploaded-images/2022-11/d7a60270-5c55-11ed-afdb-6f707568389c\" alt=\"Musk replies that impersonation already happens \" data-uuid=\"54893d14-e87b-3c4c-a7a6-b1cebf71fe69\"><figcaption></figcaption><div class=\"photo-credit\">Screenshot via Twitter</div></figure><p>But Musk seems unmoved by concerns about impersonation. In response to a question about whether newly verified users would be able to impersonate Musk himself, he said “that already happens very frequently.”</p><p>Musk isn’t wrong on this point. Hacking verified accounts and then changing their profiles to look like Musk is <a href=\"https://www.bbc.com/news/technology-46097853\">a known scam</a>. But getting rid of these types of scammers was supposedly one his main motivations for buying Twitter for $44 billion in the first place. (Ironically, scammers are already using the prospect of paid verification as a <a href=\"https://twitter.com/yoyoel/status/1588233453216346112\">phishing ploy</a>, according to Twitter’s head of safety.)</p><p>Impersonation scams can have real consequences, as actor Robert Kazinsky pointed out in a viral Twitter thread. “I don’t tweet much, I am scared of the internet, I struggle with a lot of things in life. But this account exists so that fake accounts can’t,” he wrote, adding that in the past people impersonating him online have used his identity to start conversations with children.</p><div id=\"090bcf97d9d947daa1329c1088ef1def\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Verification is a public service, it is a good deed performed by companies who contribute very little good to the world in my opinion. We should be making easier clearer paths to verification for everyone, not making it harder. It is their responsibility, not a business model.</p>— Rob Kazinsky (@RobertKazinsky) <a href=\"https://twitter.com/RobertKazinsky/status/1587935665500880896?ref_src=twsrc%5Etfw\">November 2, 2022</a></blockquote></div><p>Making verification solely dependent on who is willing to pay for it could have even bigger implications for the spread of misinformation. Around the world, public officials, government agencies, journalists, activists and others use Twitter to communicate important information to the public. Making their verification contingent on paying, or making it easier for someone else to impersonate them, would undermine the idea of Twitter as the “town square” Musk wants it to be.</p><h2>Verification has always been confusing and unfair</h2><p>Musk is correct that Twitter’s existing verification system could be a whole lot better. Verification on Twitter has always been a mess, but not because it’s sometimes perceived as a status symbol.</p><p>The reality is that Twitter has never been able to properly explain how verification works or why some people get it and others don’t. The company introduced it in 2009, but didn’t have a public-facing request tool until 2016. Instead, for nearly a decade, the company would quietly verify celebrities, journalists and other public figures mostly through backchannel connections via agents and public relations staffers. This meant that even some public figures who clearly qualified for it didn’t know how to be verified.</p><p>The decision to open up verification requests to the public in 2016 was supposed to resolve this. But a little more than a year after opening public requests, the company paused the effort amid a backlash after verifying a white nationalist.</p><p>Verification remained “paused” for the next <em>four years</em>. Except it wasn’t entirely on hold. The company continued to quietly grant verification to thousands of accounts via the same behind-the-scenes process it had used for years. In other words: it remains just as opaque and confusing as it ever was.</p><p>Even when Twitter said it would <a href=\"https://www.engadget.com/twitter-verified-more-than-1000-health-experts-new-verification-push-170028498.html\">expand verification</a> to more doctors and health experts at the start of the COVID-19 pandemic, there was still widespread confusion about how these verifications would occur. Some researchers who were verified as part of the expansion were unsure how it happened.</p><p>Finally, in 2021, Twitter re-opened verification only to pause it — again — after just <a href=\"https://www.engadget.com/twitter-request-verification-150035250.html\">eight days </a>because the company mistakenly verified a <a href=\"https://www.engadget.com/twitter-cormac-mccarthy-verified-144247866.htmlhttps://www.engadget.com/twitter-cormac-mccarthy-verified-144247866.html\">fake Cormac McCarthy</a> account. (Verification requests <a href=\"https://www.engadget.com/twitter-reopens-public-verifications-165631631.html\">resumed a month</a> later.)</p><h2>Twitter Blue and verification serve different purposes</h2><p>So, yes, verification has always had significant issues. And Musk isn’t even the first to propose verification for everyone as a way to fix it. Former CEO Jack Dorsey said he wanted to open it to everyone back <a href=\"https://www.cnbc.com/2018/03/09/twitter-could-let-everyone-get-a-blue-tick-for-verification-jack-dorsey.html\">in 2018</a>. “The intention is to open verification for everyone … And people can verify more facts about themselves and we don’t have to be the judge or imply any bias on our part,” he said in a livestream.</p><p>But making verification part of Twitter Blue, which is designed to provide extra perks for those who pay, doesn’t address the underlying issue. While it may theoretically give everyone the <em>opportunity</em> to be verified, it also creates new incentives for people trying to take advantage of the platform, says Wexler.</p><p>“There's a market for Twitter to charge power uses for certain features like an edit button or priority customer service,” he says. “But selling authenticity is just inviting bad actors to impersonate elected officials and news outlets.”</p><p>One solution would be to separate verification and identity authentication. And even Musk seems to recognize the need for additional context for some accounts. He <a href=\"https://twitter.com/elonmusk/status/1587527711228149765\">said</a> there “will be a secondary tag below the name for someone who is a public figure, which is already the case for politicians.”</p><div id=\"91bcf47eb3764f92b5e15480c05a1826\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Is this Twitter’s NEW verification badge? <br><br>Spotted on an internal version of Twitter<br><br>h/t <a href=\"https://twitter.com/KurtWagner8?ref_src=twsrc%5Etfw\">@KurtWagner8</a><a href=\"https://t.co/hQZTq0gdRU\">pic.twitter.com/hQZTq0gdRU</a></p>— Matt Navarra (@MattNavarra) <a href=\"https://twitter.com/MattNavarra/status/1588146115014189060?ref_src=twsrc%5Etfw\">November 3, 2022</a></blockquote></div><p>An early version of this appears to have already surfaced, on Dorsey’s Twitter account, which according to a screenshot of an internal build of the service, had an “official account” label underneath his blue check.</p><p>But extra labels don’t address the real danger that would be posed by the impersonators verification was created to fight.</p>",
  "link": "https://www.engadget.com/elon-musk-verification-twitter-blue-161532924.html?src=rss",
  "source_id": "engadget_479",
  "guid": "95d5a141-7239-4c8f-a87a-667fb1415f0b",
  "dc:creator": "Karissa Bell",
  "source": "Engadget",
  "dc:publisher": "Engadget",
  "dc:rightsHolder": "Engadget",
  "pubDate": "Fri, 04 Nov 2022 16:15:32 +0000",
  "ingested": 1667591602,
  "modified": "2022-11-04T19:53:30+00:00",
  "category": [
    "Information Technology",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Karissa Bell"
  ],
  "media:content": [
    {
      "media:keywords": "headline",
      "media:media_html": "",
      "dc:identifier": 1,
      "media:credit": "",
      "media:description": "",
      "media:title": ""
    },
    {
      "media:media_html": "",
      "dc:identifier": 2,
      "media:credit": "NurPhoto via Getty Images",
      "media:description": "Twitter logo displayed on a phone screen and Elon Musk's Twitter account displayed on a laptop screen are seen in this illustration photo taken in Krakow, Poland on November 1, 2022. (Photo by Jakub Porzycki/NurPhoto via Getty Images)",
      "media:title": "Elon Musk 'Twitter Complaint Hotline Operator' Photo Illustrations"
    }
  ]
}