{
  "title": "Going the extra mile in digital innovation for Singapore&#8217;s commuter experience",
  "link": "https://e27.co/going-the-extra-mile-in-digital-innovation-for-singapores-commuter-experience-20221027/",
  "dc:creator": "Cheryl Salvador",
  "pubDate": "Fri, 28 Oct 2022 02:00:34 +0000",
  "category": [
    "Singapore",
    "Smart Cities",
    "Sponsored",
    "MRT",
    "singapore",
    "SMRT Stellar Lifestyle",
    "Stellar Lifestyle",
    "Switch Stellar Lifestyle"
  ],
  "guid": "https://e27.co/?p=475188",
  "description": "<p>In 2020, the average commute time in Singapore was 46 minutes. Commuters brave crowds, traffic congestion, and bad weather to get from point A to point B, and all these can add stress and pressure that affect creativity and productivity. Singapore is one of the few countries worldwide that have made commuting efficient. Now, they&#8217;re [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/going-the-extra-mile-in-digital-innovation-for-singapores-commuter-experience-20221027/\">Going the extra mile in digital innovation for Singapore&#8217;s commuter experience</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<img loading=\"lazy\" class=\"size-full wp-image-475192 aligncenter\" src=\"https://e27.co/wp-content/uploads/2022/10/pexels-soulful-pizza-3914755.jpg\" alt=\"Stellar Lifestyle\" width=\"690\" height=\"390\" />\n<p>In 2020, the average commute time in Singapore was 46 minutes. Commuters brave crowds, traffic congestion, and bad weather to get from point A to point B, and all these can add stress and pressure that affect creativity and productivity.</p>\n<p>Singapore is one of the few countries worldwide that have made commuting efficient. Now, they&#8217;re also aiming to make it meaningful, enjoyable, and valuable.</p>\n<p>The Singapore Mass Rapid Transit (MRT) is a source of national pride. It reflects the nation&#8217;s arduous journey from being a third-world to a first-world country where citizens are provided with a convenient and efficient way to travel. Since the first line opened in 1987, the MRT has spanned more than 200 kilometres, while five MRT lines host more than 130 stations throughout the island.</p>\n<p>The MRT system is a significant part of Singapore&#8217;s daily life. At least two million people use it to go to work, school, or any destination daily, with foot traffic accounting for more than half of the national population.</p>\n<h1><b>Creating better experiences with innovative touch points for commuters</b></h1>\n<p>Over the years, the public transport system has kept up with the rising and changing demands of commuters and the technological world. Providing a positive commuting experience at the heart of its innovation pursuits, SMRT now aims to ensure that passengers get more out of every commuting touch point.</p>\n<p>Passenger information services, signages, consumer amenities, retail shops, and advertising spaces keep the commuters engaged and informed. In addition, stations are filled with shops, booth activations, and activities to make travelling more exciting and fun. An efficient system also improves commuters&#8217; health and well-being as an accessible mode of transportation reduces the stress of travelling.</p>\n<p>Stellar Lifestyle, the business arm of SMRT Corporation Ltd, is a leading player responsible for countless enhancements to the country’s transport system. It is the largest managing agent of retail and advertising spaces in the country&#8217;s rail network, handling over 600 retail areas in the North-South Line, East-West Line, Circle Line, Thomson-East-Coast Line, LRT, and bus interchanges. It&#8217;s also known for operating Kallang Wave Mall, a 40,000-square-metre home to retail and food spots that cater to customers&#8217; lifestyles.</p>\n<p><b>Also read: <a rel=\"follow\" href=\"https://e27.co/25-years-in-singapore-this-industry-veteran-discusses-innovation-20221027/\">25 years in Singapore: This industry veteran discusses innovation</a></b></p>\n<p>Integration is Stellar Lifestyle&#8217;s key driver in creating lively transit destinations. One of its top engagement solutions is Stellar Ace&#8217;s Omnichannel Architects, which receives 35 million audiences through its daily touchpoint ecosystem, featuring a range of activities that include home, travel, food, shopping, and play. It also aims to maximise different parts of the customer journey through advertising that supports retailers, engaging customers throughout the whole sale process.</p>\n<p>Also under Stellar Ace is the engagement platform WINK+ that rewards users with points per active engagement with WINK+ activities such as the WINKmets campaign known for its digital avatar influencers that will call for content generation anchored in the latest trends and happenings on the island to mark Singapore&#8217;s 57th National Day.</p>\n<p>Singapore&#8217;s MRT system is no longer just a train network; it has become a landmark. With vibrant transit spaces designed for interactive commuter experience, taking the train is meant to be more of an enjoyable trip than a tedious chore.</p>\n<img loading=\"lazy\" class=\"size-full wp-image-475189 aligncenter\" src=\"https://e27.co/wp-content/uploads/2022/10/SWITCH-Stellar-Lifestyle-x-e27-02.png\" alt=\"Stellar Lifestyle\" width=\"690\" height=\"390\" />\n<h2><b>Hive by Stellar Lifestyle: The Queen Bee in innovation</b></h2>\n<p>With numerous initiatives to engage commuters, Stellar Lifestyle aims to maximise the MRT network&#8217;s potential for growth and innovation. It is expanding its reach from daily commuters to Singaporean small and medium enterprises (SMEs) with a key project called Hive by Stellar Lifestyle, at Esplanade MRT.</p>\n<p>Poised to become the Queen Bee in retail innovation, Hive by Stellar Lifestyle is a new living lab meant to support local SMEs with digital business transformation programmes by connecting people and places with the help of its curated network of transformational brands. It will find its home within the MRT network and house innovative and ambitious entrepreneurs who want to try different ventures.</p>\n<h2><b>Stellar Lifestyle innovation programmes: Partnering with trailblazers</b></h2>\n<p>With ambitious projects, Stellar Lifestyle hopes to take the MRT experience to the next level by partnering with innovators that develop modern infrastructure and produce never-been-done experiences.</p>\n<img loading=\"lazy\" class=\"aligncenter wp-image-475190 size-full\" src=\"https://e27.co/wp-content/uploads/2022/10/SWITCH-Stellar-Lifestyle-x-e27-01.png\" alt=\"Stellar Lifestyle\" width=\"690\" height=\"390\" />\n<p>Noyes Technologies, a Munich-based company with the goal of simplifying small warehouse automation, is one of Stellar Lifestyle&#8217;s partners. Its automated storage system, NoyesStorage, could allow businesses and commuters to pick up goods on the way, providing convenience and relieving their stress. “In a world that is constantly accelerating and where everything has to go faster, it is important to reduce the stress in everyday life for everyone,” a Noyes Technologies executive said.</p>\n<p><b>Also read: <a rel=\"follow\" href=\"https://e27.co/investments-in-startups-grew-by-more-than-45-per-annum-in-2021-20221027/\">Investments in startups grew by more than 45% per annum in 2021</a></b></p>\n<p>Another partner is 1cool, a company providing sustainable cooling solutions to problems caused by normal air conditioners. When talking about the partnership, a 1cool representative shared that the company is “collaborating with SMRT to develop cooling solutions to solve Stellar Lifestyle’s problems and transform unused spaces into revenue.” Stellar Lifestyle teamed up with 1cool to deploy DewCoolers, a standalone device that can be used in place of air conditioners, to give commuters a relaxing and pleasant alfresco dining experience.</p>\n<img loading=\"lazy\" class=\"size-full wp-image-475191 aligncenter\" src=\"https://e27.co/wp-content/uploads/2022/10/SWITCH-Stellar-Lifestyle-x-e27-03.png\" alt=\"Stellar Lifestyle\" width=\"690\" height=\"390\" />\n<p>Speaking of dining experiences, Singrow will also be instrumental in Stellar Lifestyle&#8217;s goal of enhancing commuters&#8217; health and well-being with its agricultural technology that helps farmers grow flavourful climate-agnostic crops. Its Blooom Fruit, a concept by Singrow, Juice, and Smoothie bar, which will highlight the world&#8217;s first tropical-resilient strawberries, will grace train stations to promote food security and resilience and offer commuters healthy choices. “We want commuters — as consumers — to be actively involved with their purchase choices to help build Singapore&#8217;s &#8220;30 by 30&#8221; food resilience ecosystem,” a representative from Singrow said in an interview.</p>\n<p>Commuters are not the only ones benefitting from Stellar Lifestyle&#8217;s initiatives. Food and retail businesses can get Waffle Technologies Pte Ltd’s support through a POS-driven CRM system. Using the technology will give merchants valuable insights about their customers&#8217; preferences or which stations they frequent, allowing them to personalise their marketing and services.</p>\n<p>When asked about working with Stellar Lifestyle, a Waffle Technologies’ executive highlighted the partnership’s benefits. “By understanding commuter&#8217;s behaviours, Stellar Lifestyle will be able to achieve a better tenant mix to improve every commuter&#8217;s experience, and run relevant personalised campaigns for them — which not only brings an awesome customer experience for commuters but also more business to their tenants!” the representative said.</p>\n<p><b>Also read: <a rel=\"follow\" href=\"https://e27.co/journey-to-the-top-from-developer-to-ceo-20221025/\">Journey to the top: From developer to CEO</a></b></p>\n<p>When it comes to safety, Teredo Analytics will work with Stellar Lifestyle through its expertise in acoustics, Internet-of-Things, and Artificial Intelligence. According to a Teredo Analytics representative, the partnership allowed the company to garner “valuable advice and guidance offered by Stellar Lifestyle’s team, which has enabled us to better fine-tune and tailor our product to suit the customer’s needs.” For example, its lift monitoring solution has a predictive capability to lower the risk of a sudden lift failure within the train station, ensuring safety and comfort for passengers, especially those with mobility issues.</p>\n<p>Safety is also Reachbots Automation&#8217;s focus as it lends Stellar Lifestyle its modular mobile robots that can reach hard-to-access confined spaces. The robots inspect inaccessible areas while an operator monitors the progress from a safe location.</p>\n<p>With these robots, Stellar Lifestyle can regularly check and maintain critical safety in the built environment facilities. A Reachbots Automation executive lauded the partnership, saying “the resources and domain knowledge that Stellar Lifestyle has provided me with has certainly allowed us to develop and refine our robot design for a wider range of confined environments.”</p>\n<p>All aspects of commuting get the attention they deserve to keep a well-oiled transport system for commuters and tenants. But it does not stop here, as Stellar Lifestyle wants to do more for Singapore startups.</p>\n<h2><b>Stellar Lifestyle’s Innovation Programme: Tapping startups&#8217; potential</b></h2>\n<p>To help its business partners achieve their goals, Stellar Lifestyle partnered with Enterprise Singapore. The joint funding partnership aims to support startup innovation within the MRT network, bolstering the entrepreneurial ecosystem with innovative technologies and solutions to contribute to the growth of the Stellar Lifestyle&#8217;s business partners. These solutions range from finding ways for MRT tenants to lower operational costs, improve profitability, enhance customer data analytics, and implement sustainable practices.</p>\n<p>“We are delighted to partner Enterprise Singapore, as our shared belief in a practical innovation approach will help startups conceptualise, prototype, and develop their solutions. We will also validate these solutions in a real-world environment through our living lab ‘Hive by Stellar Lifestyle’ located at Esplanade MRT Station,” shared Tony Heng, President and Stellar Lifestyle.</p>\n<h2><b>Reimagining the transit experience</b></h2>\n<p>The exciting projects in the pipeline reiterate the importance of smart solutions to engage with MRT commuters and set an innovative commuter lifestyle. When the rail network circulates efficiently in a vibrant and healthy environment, the commuters will enjoy quality transit that is empowering, engaging, and enjoyable — all while keeping them on the go.</p>\n<p>For more information, visit <a rel=\"follow\" href=\"http://www.stellarlifestyle.com\">www.stellarlifestyle.com</a>.sg and www.hivebystellarlifestyle.com!</p>\n<p>—</p>\n<p>This article is produced by the <b>e27</b> team, sponsored by SMRT Stellar</p>\n<p>We can share your story at <b>e27</b>, too. Engage the Southeast Asian tech ecosystem by bringing your story to the world. Visit us at <a rel=\"follow\" href=\"https://e27.co/advertise?utm_source=e27&utm_medium=boilerplate&utm_campaign=lead_gen\">e27.co/advertise</a> to get started.</p>\n<p>&#8211; &#8211;</p>\n<p>Photo by <a rel=\"follow\" href=\"https://www.pexels.com/photo/marina-bay-sands-3914755/\">Soulful Pizza</a> via <a rel=\"follow\" href=\"https://www.pexels.com/\">Pexels</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/going-the-extra-mile-in-digital-innovation-for-singapores-commuter-experience-20221027/\">Going the extra mile in digital innovation for Singapore&#8217;s commuter experience</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}