{
  "id": "yt:video:2zlmNgXyCek",
  "yt:videoId": "2zlmNgXyCek",
  "yt:channelId": "UCOY6nAvXpLem0XczOq3wYQA",
  "title": "Rooting for the Anti-Hero",
  "link": "",
  "author": {
    "name": "Du Cinema",
    "uri": "https://www.youtube.com/channel/UCOY6nAvXpLem0XczOq3wYQA"
  },
  "published": "2022-10-06T13:00:08+00:00",
  "updated": "2022-11-05T15:53:03+00:00",
  "media:group": {
    "media:title": "Rooting for the Anti-Hero",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "It's me hi, i'm the problem it's me. In this video essay we will explore the grey area between Good and Evil. I will dive deep into the dark philosophy behind American Psycho, Breaking Bad, The Joker, Avatar and take you on a tour through the minds of so called \"literally me\" characters like Walter White, The Joker, Bruce Wayne, Zuko, Donnie Darko and many many more. Why is it that these characters so popular nowadays? Is there maybe something inside of us that is craving to embody the dark side?\n\nSwiss philosopher Carl Jung made the distinction between The Persona and The Shadow Self.\nThe persona being our outward face we present to the world. And the shadow, our darker side, often left untouched…\n\nTaste of Cherry, Pain and Glory & the Heart of Darkness Documentary are now showing on MUBI in the Netherlands. Get 30 days free at http://mubi.com/ducinema\n\n0:00 Beyond Good and Evil\n1:48 The Persona\n3:18 The Shadow Self\n5:28 Confronting the inner Monster\n9:20 How an Anti-Hero turns into a Villain\n13:02 Become a monster, then control it\n14:55 I Am The Shadows\n\nStory, narration and editing by Eloi du Cinema. \n- My instagram: https://www.instagram.com/eloiducinema/ \n- Business Inquiries: ducinemaofficial@gmail.com\n\nThe rights for all the songs in this video are purchased through Artlist: https://artlist.io/Eloi-3497535\nTsungi Horn - Zuko Theme, Avatar The Last Airbender\nLittle Touch of Heaven - Marco Martini \nGnossiene 3 - Romi Kopelman \nBlue Spirit - Zuko Theme, Avatar The Last Airbender\nOutlaws - Max. H\nEastern Duduk Ambient - Raphael Krux\nPrince Zuko Flashback - Avatar The Last Airbender\nSynthetic Network - C.K. Martin\nTundra - Jakub Pietras\nAvatar's Love Theme - Kalimba Instrumental\n\n\nCopyright Disclaimer under section 107 of the Copyright Act 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.\n\n#joker #breakingbad #walterwhite #carljung #jordanpeterson",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}