{
  "title": "501: Fantastic Beasts 3 Opening Scene Ideas, MuggleMail",
  "link": "https://audioboom.com/posts/7800523",
  "itunes:episode": 501,
  "itunes:title": "Fantastic Beasts 3 Opening Scene Ideas, MuggleMail",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3791,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>A new Harry Potter Exhibition will be touring the globe. How similar will it be to the one we've already been to?</li>\n<li>The hosts discuss how they would like to see <em>Fantastic Beasts 3</em> start, from blood pact flashbacks to a street chase in Rio!</li>\n<li>Will director David Yates finally make a substantive flashback sequence?</li>\n<li>Will the colors of this film at last be cheery and bright?</li>\n<li>Lynx Line: Our <a href=\"https://www.patreon.com/muggleast\">Patrons</a> weigh in with their opening ideas. What if our heroes are all turned into Nifflers?</li>\n<li>Could Leta Lestrange still be alive?</li>\n<li>Voicemails cover thoughts on being an adult Harry Potter fan, how John Williams joined the world of Harry Potter, getting our kids into Harry, and what if Voldemort had killed Draco?</li>\n<li>Ron, Neville, and Ginny are three potential POV's that our e-mails analyze for the story.</li>\n<li>The last two e-mails involve Snape and his love for Lily. What if Harry had been a girl, and did he leave Harry under the rubble in Godric's Hollow?</li>\n<li>We answer a question sent to us in July 2007!</li>\n<li>Our pick-up lines segment from Episode 500 inspired a Chicken Soup segment this week.</li>\n<li>Quizzitch: When Harry and Dumbledore Apparate to the Cave, what is the first spell Dumbledore uses? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week's episode is sponsored by <a href=\"http://www.meundies.com/mugglecast\">MeUndies</a> and <a href=\"http://www.GetQuip.com/muggle\">Quip</a>\n</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like a personalized thank you video from one of the hosts and Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 16 Feb 2021 12:00:00 +0000",
  "guid": "tag:audioboom.com,2021-02-15:/posts/7800523",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}