{
  "guid": "https://podcasts.nationalreview.com/?p=1539",
  "title": "Episode 12: Anthony Fisher / Pink Floyd",
  "description": "<p>Scot and Jeff talk to Anthony Fisher about Pink Floyd.</p>\n<p><b><span>Introducing the Band</span><br />\n</b>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Anthony Fisher, writer/reporter for The Week, Daily Beast and others, producer of <a href=\"http://wethefifth.com/\" target=\"_blank\">The Fifth Column podcast</a>, and Writer/Director of the <a href=\"http://t.sidekickopen04.com/e1t/c/5/f18dQhb0S7lC8dDMPbW2n0x6l2B9nMJW7t5XX43M2w8vW7fR_6z63Bt1-VcVQQM56dT2wdD3ZBY02?t=http%3A%2F%2Fwww.sidewalktrafficmovie.com%2Fscreenings%2F&si=4663439755051008&pi=405eba2d-0870-48fe-b249-a49aa1339ef9\" target=\"_blank\">award-winning</a> indie feature film “<a href=\"http://t.sidekickopen04.com/e1t/c/5/f18dQhb0S7lC8dDMPbW2n0x6l2B9nMJW7t5XX43M2w8vW7fR_6z63Bt1-VcVQQM56dT2wdD3ZBY02?t=https%3A%2F%2Fwww.google.com%2Furl%3Fsa%3Dt%26rct%3Dj%26q%3D%26esrc%3Ds%26source%3Dweb%26cd%3D1%26cad%3Drja%26uact%3D8%26ved%3D0ahUKEwiGsvjs9Z_XAhVI4oMKHV65DOgQtwIIKDAA%26url%3Dhttps%253A%252F%252Fwww.youtube.com%252Fwatch%253Fv%253DWamZ69qs_2c%26usg%3DAOvVaw2pL3rZeZmuXjfU19GIL7A9&si=4663439755051008&pi=405eba2d-0870-48fe-b249-a49aa1339ef9\" target=\"_blank\">Sidewalk Traffic</a>” — a comedy drama about new fatherhood, depression, and holding on to your dreams and letting go of your baggage. Available on iTunes, Amazon, Youtube, Google Play, and most major VOD platforms. Follow him on Twitter at @<a href=\"https://twitter.com/anthonyLfisher\" target=\"_blank\">anthonyLfisher</a> and <a href=\"http://theweek.com/authors/anthony-l-fisher\" target=\"_blank\">read his work here</a>.</p>\n<p><b><span>Anthony’s Musical Pick: Pink Floyd</span><br />\n</b>Gravity bongs at the ready — it’s time to travel out into interstellar space, as Political Beats finally covers one of the true big beasts of classic rock, Pink Floyd. Anthony’s introduction to the band hits a lot of the same notes that most younger fans will recognize: hearing “Comfortably Numb” as a kid, with his mom saying “ugh this music is boring” as he sits there listening to Dave Gilmour soloing, transfixed. Jeff tells his amusingly quotidian “intro to Floyd” story, which could alternately be titled “the first time Jeff got high.” (Yes, it too involves “Comfortably Numb.”) Jeff then goes on to discuss how, as his musical tastes developed (and his preference for avant-garde wackiness grew), he found himself hanging on to Floyd’s earlier, ropier, more improvisational and instrumental years over their later commercial mega-hits.</p>\n<p><u>KEY TRACK</u>: “<a href=\"https://www.youtube.com/watch?v=PKjr0MGikxc\" target=\"_blank\">Comfortably Numb (live August 1988)</a>” (<i>Delicate Sound Of Thunder</i>, 1988)</p>\n<p><b><span>From Blues-Rock (?!) to Space-Rock: the Syd Barrett Era, 1965-1968</span><br />\n</b>Fans know this already, but the rest of you may not: Pink Floyd, the <i>sine qua non</i> space-rock/psychedelic/hyper-stylized programmatic group of the classic-rock era, began life as a BLUES band. And they were terrible! Just truly, goofy, silly-sounding stuff. Floyd really only found their voice with the emergence of doomed frontman Syd Barrett’s songwriting voice, a highly psychedelicized British pastoral style supplemented by the band’s predilection for lengthy live instrumental freakout jams. The gang is actually surprisingly ambivalent about the Barrett era of Floyd, despite the fervor of its cult fans: neither Scot nor Jeff have much time for the tweeness of Barrett’s songs about gnomes, the I-Ching, and currant buns, but everyone enjoys the bonkers insanity of “Bike” and Anthony points out that “Astronomy Domine” is one of the most muscular, threatening psychedelic masterpieces of an era rife with them. Jeff points out that he owns 27 separate performances of “Interstellar Overdrive” alone, by way of arguing that this is the true masterpiece from Floyd’s debut LP <i>The Piper At The Gates Of Dawn </i>(1967), while Scot and Anthony also single out “Lucifer Sam,” a song about a housecat that is way better than that description might make you think it is.</p>\n<p>During this part of the show, Jeff works an interstitial conversation in about Pink Floyd’s five early non-album singles, all of which he considers top-shelf. “Arnold Layne” and “See Emily Play” are already well-loved (and well-known) enough as Syd Barrett tunes to need no introduction or defense, but Jeff is at great pains to point out that “It Would Be So Nice” and “Point Me At The Sky” are, if anything, even better, and inexplicably underrated by both band and fans alike. Jeff also points out how pivotal Rick Wright was to Floyd at this point in their career; Roger Waters was actually an afterthought in 1967-68, and it was Wright who carried the most singing, performing, and songwriting weight behind Barrett until 1969. People, go listen to the wistful sadness of the B-side “Paintbox.”</p>\n<p>The discussion of Wright carries the gang into <i>A Saucerful Of Secrets</i> (1968), where all agree that his “Remember A Day” is a highlight (indeed, probably the best song on the record). Jeff rates <i>Saucerful</i> significantly higher than either Anthony or Scot do, but then he has an avowed preference for horrible noise. The gang discusses Syd’s fade into non-functionality, with “Jugband Blues” as a key track signalling Barrett’s creepily altogether-too-on-the-nose farewell to the Floyd (and to sanity).</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=1HR4GOlUdSk\" target=\"_blank\">I’m A King Bee</a>” (<i>The Early Years 1965-1972</i>, 2016); “<a href=\"https://www.youtube.com/watch?v=sHO8dvEQpaI\" target=\"_blank\">Arnold Layne</a>” (A-side of single, 1967); “<a href=\"https://www.youtube.com/watch?v=EOta1fulN1Y\" target=\"_blank\">Astronomy Domine</a>” (<i>The Piper At The Gates Of Dawn</i>, 1967); “<a href=\"https://www.youtube.com/watch?v=f35gUESUFvU\" target=\"_blank\">Lucifer Sam</a>” (<i>The Piper At The Gates Of Dawn</i>, 1967); “<a href=\"https://www.youtube.com/watch?v=2PoLaX4IA_0\" target=\"_blank\">Bike</a>” (<i>The Piper At The Gates Of Dawn</i>, 1967); “<a href=\"https://www.youtube.com/watch?v=xaK4r0pQaJ0\" target=\"_blank\">Interstellar Overdrive</a>” (<i>The Piper At The Gates Of Dawn</i>, 1967); “<a href=\"https://www.youtube.com/watch?v=HwV3aTh6pi8\" target=\"_blank\">See Emily Play</a>” (A-side of single, 1967); “<a href=\"https://www.youtube.com/watch?v=jzHub9o9FQY\" target=\"_blank\">Apples And Oranges</a>” (A-side of single, 1967); “<a href=\"https://www.youtube.com/watch?v=imfR5M9ZXBs\" target=\"_blank\">Paintbox</a>” (B-side of “Apples And Oranges,” 1967); “<a href=\"https://www.youtube.com/watch?v=AsSi1w1w9_0\" target=\"_blank\">It Would Be So Nice</a>” (A-side of single, 1967); “<a href=\"https://www.youtube.com/watch?v=sBC86e5cT5U\" target=\"_blank\">Remember A Day</a>” (<i>A Saucerful Of Secrets</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=Cu5acxwxc00\" target=\"_blank\">Set The Controls For The Heart Of The Sun</a>” (<i>A Saucerful Of Secrets</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=S7RL1F7hqRc\" target=\"_blank\">A Saucerful Of Secrets</a>” (<i>A Saucerful Of Secrets</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=9I3dgUzBHno\" target=\"_blank\">Jugband Blues</a>” (<i>A Saucerful Of Secrets</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=XCiLw0a6dZo\" target=\"_blank\">Point Me At The Sky</a>” (A-side of single, 1968)</p>\n<p><b><span>The Soundtrack Era: <i>More, Ummagumma, Atom Heart Mother, Meddle, </i>and <i>Obscured By Clouds</i> (1969-1972)</span><br />\n</b>This is Jeff’s favorite era of Pink Floyd, though he’ll be damned if he can give you a rational justification as to why. <i>More</i> (1969) is the middling soundtrack to a forgettable film of the same name, but its atmospheric instrumentals are interesting and Anthony and Jeff agree that “Cymbaline” (a fully-realized, catchy verse/chorus/verse construction) is the first sign of things to come in terms of Roger Waters’ songwriting ability. The gang ponders whether <i>Ummagumma</i> (1969) is the worst double-album ever released by a major band (Scot cites to a recent Red Hot Chili Peppers album as “obviously worse”), but Jeff perversely considers it one of their two essential records. All agree that the studio half of <i>Ummagumma</i> is mostly a flaming dumpster fire (Jeff singles out Gilmour’s “Narrow Way” suite, Scot has praise for part of Wright’s “Sysyphus”), but the real point here is the live disc, a four track example of Pink Floyd in early 1969 playing their exploratory repertoire in absolutely commanding fashion. Jeff loves early live Floyd — it is his primary obsession with the band — and considers this one disc so obligatory as to justify the rest of the studio garbage.</p>\n<p>Nobody has much good to say about <i>Ummagumma</i>‘s 1970 follow-up <i>Atom Heart Mother</i> either (Jeff can barely believe that it hit #1 in the UK record charts), though Anthony will stand up for the early unadorned “band-only” version of the title suite. The one piece that everyone agrees on is Rick Wright’s “Summer ’68,” a criminally forgotten piano ballad hidden away on the middle of the record that suggests that, as late as 1970, Wright was still bringing the best music to the Floyd collective.</p>\n<p>It’s hard to think of an about-face reversal as abrupt as the transition from <i>Atom Heart Mother</i> to <i>Meddle</i> (1971), however. Sure, “Echoes” has too many minutes of ‘whale noises’ in the middle. Sure, we probably didn’t need to hear about Seamus the dog. But otherwise, <i>Meddle</i> is a crowning achievement of pre-<i>Dark Side</i> Pink Floyd, from the terrifying proto-industrial grind of “One Of These Days” to the dreamy diurnal epic of “Echoes.” Jeff also rhapsodizes about “Fearless” for several minutes until Anthony points out that he sounds just like a stoner from a Richard Linklater film.</p>\n<p>The final album of Floyd’s transitional pre-<i>Dark Side</i> phase is another movie soundtrack, <i>Obscured By Clouds</i> (1972). This one is usually beloved by hardcore fans as a secret gem, but the gang isn’t too terribly impressed — they’re all already tired of Roger whining about his dead dad (yeah, war sucks, we know) in “Free Four.” But Anthony loves “Childhood’s End” (he just wishes Roger had written the lyrics, to make them sharper), Jeff and Scot both dig on the instrumental “Obscured By Clouds”/”When You’re In” pairing, and everyone praises the two unabashedly pop songs on the record: “Wot’s…Uh The Deal” and Rick Wright’s “Stay.”</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=-HCJHpWH8x0\" target=\"_blank\">Main Theme</a>” (<i>More</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=DySNnz5N9WA\" target=\"_blank\">Green Is The Colour</a>” (<i>More</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=ietkuUZwjpU\" target=\"_blank\">Cymbaline</a>” (<i>More</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=G8SDKMBLjPU\" target=\"_blank\">The Narrow Way, Pt. 1</a>” (<i>Ummagumma</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=tOicKSGPkK8\" target=\"_blank\">The Narrow Way, Pt. 3</a>” (<i>Ummagumma</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=EweTMtJa2JU\" target=\"_blank\">Sysyphus, Pt. 2</a>” (<i>Ummagumma</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=O8OE4gedQuc&index=2&list=PLBsdrStCgZ2S9vRXY6SqeH_GpZ94cuKio\" target=\"_blank\">Careful With That Axe, Eugene (live May 2nd, 1969)</a>” (<i>Ummagumma</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=Ijy4GCcBgVw\" target=\"_blank\">Interstellar Overdrive (live May 2nd, 1969)</a>” (outtake from <i>Ummagumma</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=zXUa_oWiE6Q\" target=\"_blank\">Summer ’68</a>” (<i>Atom Heart Mother</i>, 1971); “Fat Old Sun” (<i>Atom Heart Mother</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=dfqEab9oCp0\" target=\"_blank\">Atom Heart Mother (alternate version)</a>” (<i>The Early Years 1965-1972</i>, 2016); “<a href=\"https://www.youtube.com/watch?v=48PJGVf4xqk\" target=\"_blank\">One Of These Days</a>” (<i>Meddle</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=t3J_2R9rAp8\" target=\"_blank\">Fearless</a>” (<i>Meddle</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=53N99Nim6WE\" target=\"_blank\">Echoes</a>” (<i>Meddle</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=16V-wNwlTw0\" target=\"_blank\">Obscured By Clouds</a>“/”<a href=\"https://www.youtube.com/watch?v=6vr07uuBjg4\" target=\"_blank\">When You’re In</a>” (<i>Obscured By Clouds</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=k6JpS1XYGJQ\" target=\"_blank\">Wot’s…Uh, The Deal</a>” (<i>Obscured By Clouds</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=2A7xoKo7sGM\" target=\"_blank\">Childhood’s End</a>” (<i>Obscured By Clouds</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=Rhge-ZOgfsw\" target=\"_blank\">Stay</a>” (<i>Obscured By Clouds</i>, 1972)</p>\n<p><b><span>Eclipse: Pink Floyd Become International Superstars with <i>Dark Side Of The Moon</i>, <i>Wish You Were Here</i>, <i>Animals</i> and </span><i><span>The Wall</span><br />\n</i></b>The gang has a laugh about how comically impossible it is to say anything new about <i>Dark Side Of The Moon</i> (1973). It’s all been done! But they plow forward gamely nonetheless, emphasizing that although the big ‘radio hits’ on this record have been played into the ground (“Time,” “Money,” etc.), all the rest is still immensely powerful, and evidence that Floyd, under Waters’ influence, had transitioned into a much more musically focused phase that would pay enormous commercial and critical dividends. Still, Jeff, Scott and Anthony can’t help but point out that the <i>best</i> contributions to <i>Dark Side</i> remain Rick Wright’s…those slow, patiently developing piano chords are wildly effective not only on “Us And Them” (which had been kicking around since 1970) but also on “The Great Gig In The Sky” as well. Anthony praises Roger Waters’ lyrical and metric sensibility on the “Brain Damage”/”Eclipse” suite, while Jeff points out that if you want to know why <i>Dark Side</i> is considered the hi-fi gold standard for audiophile production, you need merely listen to these two songs.</p>\n<p>People get tired of <i>Dark Side Of The Moon. </i>People get tired of <i>The Wall</i>. Some people have never had any time at all for <i>Animals</i>. But nobody has gotten tired of Pink Floyd’s <i>Dark Side</i> follow-up, the Syd Barrett tribute (and music industry lament) of <i>Wish You Were Here</i> (1975). This one gets a unanimous thumbs-up from the gang (even Jeff, who openly writes off this era). Scot talks about the pleasures of the title track and how it slowly unfolds into its final chorus, and argues that “Have A Cigar” features one of Gilmour’s finest guitar solos. Anthony calls this the ultimate “teenage blacklight” get-blazed album. We would recommend this album to you, but then again how on earth could it be possible that you haven’t already heard this album?</p>\n<p><i>Animals</i> (1977) is the very odd, very strident next step in the Pink Floyd discography: Roger Waters takes over with a series of thinly veiled Orwellian allegories (is there even a veil on “Pigs (Three Different Ones)”?), but the gang overlooks that because the <i>music</i> is still so endlessly, recombinatively creative. Anthony and Jeff both agree that “Dogs” is one of the best Pink Floyd songs ever recorded, and the “jazz chill”-cum-“raving and drooling” slice of rage that is “Sheep” also comes in for praise.</p>\n<p><i>The Wall</i> (1979) is where the gang sharply departs from critical and commercial consensus. Popular opinion holds <i>The Wall — </i>Roger Waters’ opus to the alienation he experienced from life as a world-famous rock star — to be their crowning achievement. Meanwhile, none of the gang likes it that much (Jeff memorably describes it as a “meticulously crafted piece of shit”). Jeff, Scot, and Anthony are all a little bit turned off by Waters’ rock star trip on this album (Scot also points out how utterly shot Roger’s voice sounds throughout the record), and argue that the turn toward highly programmatic musical theater hamstrings the band. That said, all agree that there are several great moments to be found on <i>The Wall</i>, though they also agree it’s telling that most of them are ones where David Gilmour has an outsized involvement. (The one exception may be Anthony’s pick of “Nobody Home,” which was itself written by Waters about Rick Wright, whom Waters kicked out of the band at this time.) Still, despite the bombast, it is an amazingly well produced and sequenced album — Jeff thinks the segue from “Happiest Days Of Our Lives” into “Another Brick Pt. 2” may justify the entire mess.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=mPGv8L3a_sY&index=5&list=PLEQdwrAGbxncZFLH4KETau3-uncnqVtWD\" target=\"_blank\">The Great Gig In The Sky</a>” (<i>Dark Side Of The Moon</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=rwPM01cbQBc\" target=\"_blank\">Money</a>” (<i>Dark Side Of The Moon</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=GKiLEgAzFDQ\" target=\"_blank\">Us And Them</a>” (<i>Dark Side Of The Moon</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=DVQ3-Xe_suY\" target=\"_blank\">Brain Damage/Eclipse</a>” (<i>Dark Side Of The Moon</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=tbdpv7G_PPg\" target=\"_blank\">Have A Cigar</a>” (<i>Wish You Were Here</i>, 1975); “<a href=\"https://www.youtube.com/watch?v=9pkh8zi_eic\" target=\"_blank\">Shine On You Crazy Diamond</a>” (<i>Wish You Were Here</i>, 1975); “<a href=\"https://www.youtube.com/watch?v=hjpF8ukSrvk\" target=\"_blank\">Wish You Were Here</a>” (<i>Wish You Were Here</i>, 1975); “<a href=\"https://www.youtube.com/watch?v=4QA30qkRYy8\" target=\"_blank\">Dogs</a>” (<i>Animals</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=3GE-sfEbJ7I\" target=\"_blank\">Sheep</a>” (<i>Animals</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=x-xTttimcNk\" target=\"_blank\">Comfortably Numb</a>” (<i>The Wall</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=dJNekD3dnQY\" target=\"_blank\">The Happiest Days Of Our Lives”/”Another Brick In The Wall (Part 2)</a>” (<i>The Wall</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=xe3NUKCnZp4\" target=\"_blank\">Mother</a>” (<i>The Wall</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=bn6YnUt4Vuk\" target=\"_blank\">Goodbye Blue Sky</a>” (<i>The Wall</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=soL8JK6kALc\" target=\"_blank\">Hey You</a>” (<i>The Wall</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=gNMGrkCNLVk\" target=\"_blank\">Nobody Home</a>” (<i>The Wall</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=j2s8yGMEbSs\" target=\"_blank\">Run Like Hell</a>” (<i>The Wall</i>, 1979)</p>\n<p><b><span>Collapse: <i>The Final Cut</i> and the Post-Waters Era of Floyd</span><br />\n</b>It’s tough sledding ahead as the gang tries to make sense of Pink Floyd’s post-<i>Wall </i>era. Nobody can offer a rational defense of the unmusical, maudlin, self-regarding politicized tripe that is <i>The Final Cut</i> (1983), an album that is almost bizarrely unlistenable outside of a few isolated tracks. Anthony sums it up by pointing out that “The Fletcher Memorial Home” features Roger Waters putting all of his political enemies into a gas chamber and then flipping the switch to “on,” like an alt-right meme…<i>except deadly serious</i>. As hard to justify as <i>The Final Cut</i> is, the gang can’t really find that much more to say in defense of the first Gilmour-only Floyd album <i>A Momentary Lapse Of Taste</i>…erm, I meant <i>Reason</i> (1987). This is just elevator muzak, yuppie lullaby mush, and even if “Learning To Fly” is a nice little toe-tapper it certainly doesn’t sound like Pink Floyd. Neither does <i>The pision Bell</i> (1994), really, although both Jeff and Anthony are willing to go to bat a bit more for it. “Poles Apart,” “What Do You Want From Me?,” “Coming Back To Life,” and “Marooned” are all nice little songs. But the spirit is gone, and this sounds like David Gilmour solo work rather than proper Floyd. A brief discussion of the Wright-posthumous <i>Endless River</i> wraps things up.<b> </b></p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=rhFCywuSDMI\" target=\"_blank\">The Gunner’s Dream</a>” (<i>The Final Cut</i>, 1983); “<a href=\"https://www.youtube.com/watch?v=DoEe5JcKzvU\" target=\"_blank\">The Fletcher Memorial Home</a>” (<i>The Final Cut</i>, 1983); “<a href=\"https://www.youtube.com/watch?v=9Q7BYoUMjFE\" target=\"_blank\">Learning To Fly</a>” (<i>A Momentary Lapse Of Reason</i>, 1987); “<a href=\"https://www.youtube.com/watch?v=KmlZ1WhlYsM\" target=\"_blank\">What Do You Want From Me?</a>” (<i>The pision Bell</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=8EHHUiRuJAk\" target=\"_blank\">Marooned</a>” (<i>The pision Bell</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=tC8631Kqzb0\" target=\"_blank\">Coming Back To Life</a>” (<i>The pision Bell</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=5ciWB7VykII\" target=\"_blank\">Poles Apart</a>” (<i>The pision Bell</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=lku1fP-LszI\" target=\"_blank\">High Hopes</a>” (<i>The pision Bell</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=Snb6rD-f_4g\" target=\"_blank\">Autumn ’68</a>” (<i>The Endless River</i>, 2014)</p>\n<p><b><span>Finale</span><br />\n</b>Anthony, Scot and Jeff each name their two key albums and five key songs by Pink Floyd.</p>\n",
  "pubDate": "Mon, 6 Nov 2017 00:44:26 +0000",
  "author": "studio@nationalreview.com (National Review)",
  "link": "https://www.nationalreview.com/media/political-beats",
  "content:encoded": "<p>Scot and Jeff talk to Anthony Fisher about Pink Floyd.</p>\n<p><b><span>Introducing the Band</span><br />\n</b>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Anthony Fisher, writer/reporter for The Week, Daily Beast and others, producer of <a href=\"http://wethefifth.com/\" target=\"_blank\">The Fifth Column podcast</a>, and Writer/Director of the <a href=\"http://t.sidekickopen04.com/e1t/c/5/f18dQhb0S7lC8dDMPbW2n0x6l2B9nMJW7t5XX43M2w8vW7fR_6z63Bt1-VcVQQM56dT2wdD3ZBY02?t=http%3A%2F%2Fwww.sidewalktrafficmovie.com%2Fscreenings%2F&si=4663439755051008&pi=405eba2d-0870-48fe-b249-a49aa1339ef9\" target=\"_blank\">award-winning</a> indie feature film “<a href=\"http://t.sidekickopen04.com/e1t/c/5/f18dQhb0S7lC8dDMPbW2n0x6l2B9nMJW7t5XX43M2w8vW7fR_6z63Bt1-VcVQQM56dT2wdD3ZBY02?t=https%3A%2F%2Fwww.google.com%2Furl%3Fsa%3Dt%26rct%3Dj%26q%3D%26esrc%3Ds%26source%3Dweb%26cd%3D1%26cad%3Drja%26uact%3D8%26ved%3D0ahUKEwiGsvjs9Z_XAhVI4oMKHV65DOgQtwIIKDAA%26url%3Dhttps%253A%252F%252Fwww.youtube.com%252Fwatch%253Fv%253DWamZ69qs_2c%26usg%3DAOvVaw2pL3rZeZmuXjfU19GIL7A9&si=4663439755051008&pi=405eba2d-0870-48fe-b249-a49aa1339ef9\" target=\"_blank\">Sidewalk Traffic</a>” — a comedy drama about new fatherhood, depression, and holding on to your dreams and letting go of your baggage. Available on iTunes, Amazon, Youtube, Google Play, and most major VOD platforms. Follow him on Twitter at @<a href=\"https://twitter.com/anthonyLfisher\" target=\"_blank\">anthonyLfisher</a> and <a href=\"http://theweek.com/authors/anthony-l-fisher\" target=\"_blank\">read his work here</a>.</p>\n<p><b><span>Anthony’s Musical Pick: Pink Floyd</span><br />\n</b>Gravity bongs at the ready — it’s time to travel out into interstellar space, as Political Beats finally covers one of the true big beasts of classic rock, Pink Floyd. Anthony’s introduction to the band hits a lot of the same notes that most younger fans will recognize: hearing “Comfortably Numb” as a kid, with his mom saying “ugh this music is boring” as he sits there listening to Dave Gilmour soloing, transfixed. Jeff tells his amusingly quotidian “intro to Floyd” story, which could alternately be titled “the first time Jeff got high.” (Yes, it too involves “Comfortably Numb.”) Jeff then goes on to discuss how, as his musical tastes developed (and his preference for avant-garde wackiness grew), he found himself hanging on to Floyd’s earlier, ropier, more improvisational and instrumental years over their later commercial mega-hits.</p>\n<p><u>KEY TRACK</u>: “<a href=\"https://www.youtube.com/watch?v=PKjr0MGikxc\" target=\"_blank\">Comfortably Numb (live August 1988)</a>” (<i>Delicate Sound Of Thunder</i>, 1988)</p>\n<p><b><span>From Blues-Rock (?!) to Space-Rock: the Syd Barrett Era, 1965-1968</span><br />\n</b>Fans know this already, but the rest of you may not: Pink Floyd, the <i>sine qua non</i> space-rock/psychedelic/hyper-stylized programmatic group of the classic-rock era, began life as a BLUES band. And they were terrible! Just truly, goofy, silly-sounding stuff. Floyd really only found their voice with the emergence of doomed frontman Syd Barrett’s songwriting voice, a highly psychedelicized British pastoral style supplemented by the band’s predilection for lengthy live instrumental freakout jams. The gang is actually surprisingly ambivalent about the Barrett era of Floyd, despite the fervor of its cult fans: neither Scot nor Jeff have much time for the tweeness of Barrett’s songs about gnomes, the I-Ching, and currant buns, but everyone enjoys the bonkers insanity of “Bike” and Anthony points out that “Astronomy Domine” is one of the most muscular, threatening psychedelic masterpieces of an era rife with them. Jeff points out that he owns 27 separate performances of “Interstellar Overdrive” alone, by way of arguing that this is the true masterpiece from Floyd’s debut LP <i>The Piper At The Gates Of Dawn </i>(1967), while Scot and Anthony also single out “Lucifer Sam,” a song about a housecat that is way better than that description might make you think it is.</p>\n<p>During this part of the show, Jeff works an interstitial conversation in about Pink Floyd’s five early non-album singles, all of which he considers top-shelf. “Arnold Layne” and “See Emily Play” are already well-loved (and well-known) enough as Syd Barrett tunes to need no introduction or defense, but Jeff is at great pains to point out that “It Would Be So Nice” and “Point Me At The Sky” are, if anything, even better, and inexplicably underrated by both band and fans alike. Jeff also points out how pivotal Rick Wright was to Floyd at this point in their career; Roger Waters was actually an afterthought in 1967-68, and it was Wright who carried the most singing, performing, and songwriting weight behind Barrett until 1969. People, go listen to the wistful sadness of the B-side “Paintbox.”</p>\n<p>The discussion of Wright carries the gang into <i>A Saucerful Of Secrets</i> (1968), where all agree that his “Remember A Day” is a highlight (indeed, probably the best song on the record). Jeff rates <i>Saucerful</i> significantly higher than either Anthony or Scot do, but then he has an avowed preference for horrible noise. The gang discusses Syd’s fade into non-functionality, with “Jugband Blues” as a key track signalling Barrett’s creepily altogether-too-on-the-nose farewell to the Floyd (and to sanity).</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=1HR4GOlUdSk\" target=\"_blank\">I’m A King Bee</a>” (<i>The Early Years 1965-1972</i>, 2016); “<a href=\"https://www.youtube.com/watch?v=sHO8dvEQpaI\" target=\"_blank\">Arnold Layne</a>” (A-side of single, 1967); “<a href=\"https://www.youtube.com/watch?v=EOta1fulN1Y\" target=\"_blank\">Astronomy Domine</a>” (<i>The Piper At The Gates Of Dawn</i>, 1967); “<a href=\"https://www.youtube.com/watch?v=f35gUESUFvU\" target=\"_blank\">Lucifer Sam</a>” (<i>The Piper At The Gates Of Dawn</i>, 1967); “<a href=\"https://www.youtube.com/watch?v=2PoLaX4IA_0\" target=\"_blank\">Bike</a>” (<i>The Piper At The Gates Of Dawn</i>, 1967); “<a href=\"https://www.youtube.com/watch?v=xaK4r0pQaJ0\" target=\"_blank\">Interstellar Overdrive</a>” (<i>The Piper At The Gates Of Dawn</i>, 1967); “<a href=\"https://www.youtube.com/watch?v=HwV3aTh6pi8\" target=\"_blank\">See Emily Play</a>” (A-side of single, 1967); “<a href=\"https://www.youtube.com/watch?v=jzHub9o9FQY\" target=\"_blank\">Apples And Oranges</a>” (A-side of single, 1967); “<a href=\"https://www.youtube.com/watch?v=imfR5M9ZXBs\" target=\"_blank\">Paintbox</a>” (B-side of “Apples And Oranges,” 1967); “<a href=\"https://www.youtube.com/watch?v=AsSi1w1w9_0\" target=\"_blank\">It Would Be So Nice</a>” (A-side of single, 1967); “<a href=\"https://www.youtube.com/watch?v=sBC86e5cT5U\" target=\"_blank\">Remember A Day</a>” (<i>A Saucerful Of Secrets</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=Cu5acxwxc00\" target=\"_blank\">Set The Controls For The Heart Of The Sun</a>” (<i>A Saucerful Of Secrets</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=S7RL1F7hqRc\" target=\"_blank\">A Saucerful Of Secrets</a>” (<i>A Saucerful Of Secrets</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=9I3dgUzBHno\" target=\"_blank\">Jugband Blues</a>” (<i>A Saucerful Of Secrets</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=XCiLw0a6dZo\" target=\"_blank\">Point Me At The Sky</a>” (A-side of single, 1968)</p>\n<p><b><span>The Soundtrack Era: <i>More, Ummagumma, Atom Heart Mother, Meddle, </i>and <i>Obscured By Clouds</i> (1969-1972)</span><br />\n</b>This is Jeff’s favorite era of Pink Floyd, though he’ll be damned if he can give you a rational justification as to why. <i>More</i> (1969) is the middling soundtrack to a forgettable film of the same name, but its atmospheric instrumentals are interesting and Anthony and Jeff agree that “Cymbaline” (a fully-realized, catchy verse/chorus/verse construction) is the first sign of things to come in terms of Roger Waters’ songwriting ability. The gang ponders whether <i>Ummagumma</i> (1969) is the worst double-album ever released by a major band (Scot cites to a recent Red Hot Chili Peppers album as “obviously worse”), but Jeff perversely considers it one of their two essential records. All agree that the studio half of <i>Ummagumma</i> is mostly a flaming dumpster fire (Jeff singles out Gilmour’s “Narrow Way” suite, Scot has praise for part of Wright’s “Sysyphus”), but the real point here is the live disc, a four track example of Pink Floyd in early 1969 playing their exploratory repertoire in absolutely commanding fashion. Jeff loves early live Floyd — it is his primary obsession with the band — and considers this one disc so obligatory as to justify the rest of the studio garbage.</p>\n<p>Nobody has much good to say about <i>Ummagumma</i>‘s 1970 follow-up <i>Atom Heart Mother</i> either (Jeff can barely believe that it hit #1 in the UK record charts), though Anthony will stand up for the early unadorned “band-only” version of the title suite. The one piece that everyone agrees on is Rick Wright’s “Summer ’68,” a criminally forgotten piano ballad hidden away on the middle of the record that suggests that, as late as 1970, Wright was still bringing the best music to the Floyd collective.</p>\n<p>It’s hard to think of an about-face reversal as abrupt as the transition from <i>Atom Heart Mother</i> to <i>Meddle</i> (1971), however. Sure, “Echoes” has too many minutes of ‘whale noises’ in the middle. Sure, we probably didn’t need to hear about Seamus the dog. But otherwise, <i>Meddle</i> is a crowning achievement of pre-<i>Dark Side</i> Pink Floyd, from the terrifying proto-industrial grind of “One Of These Days” to the dreamy diurnal epic of “Echoes.” Jeff also rhapsodizes about “Fearless” for several minutes until Anthony points out that he sounds just like a stoner from a Richard Linklater film.</p>\n<p>The final album of Floyd’s transitional pre-<i>Dark Side</i> phase is another movie soundtrack, <i>Obscured By Clouds</i> (1972). This one is usually beloved by hardcore fans as a secret gem, but the gang isn’t too terribly impressed — they’re all already tired of Roger whining about his dead dad (yeah, war sucks, we know) in “Free Four.” But Anthony loves “Childhood’s End” (he just wishes Roger had written the lyrics, to make them sharper), Jeff and Scot both dig on the instrumental “Obscured By Clouds”/”When You’re In” pairing, and everyone praises the two unabashedly pop songs on the record: “Wot’s…Uh The Deal” and Rick Wright’s “Stay.”</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=-HCJHpWH8x0\" target=\"_blank\">Main Theme</a>” (<i>More</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=DySNnz5N9WA\" target=\"_blank\">Green Is The Colour</a>” (<i>More</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=ietkuUZwjpU\" target=\"_blank\">Cymbaline</a>” (<i>More</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=G8SDKMBLjPU\" target=\"_blank\">The Narrow Way, Pt. 1</a>” (<i>Ummagumma</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=tOicKSGPkK8\" target=\"_blank\">The Narrow Way, Pt. 3</a>” (<i>Ummagumma</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=EweTMtJa2JU\" target=\"_blank\">Sysyphus, Pt. 2</a>” (<i>Ummagumma</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=O8OE4gedQuc&index=2&list=PLBsdrStCgZ2S9vRXY6SqeH_GpZ94cuKio\" target=\"_blank\">Careful With That Axe, Eugene (live May 2nd, 1969)</a>” (<i>Ummagumma</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=Ijy4GCcBgVw\" target=\"_blank\">Interstellar Overdrive (live May 2nd, 1969)</a>” (outtake from <i>Ummagumma</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=zXUa_oWiE6Q\" target=\"_blank\">Summer ’68</a>” (<i>Atom Heart Mother</i>, 1971); “Fat Old Sun” (<i>Atom Heart Mother</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=dfqEab9oCp0\" target=\"_blank\">Atom Heart Mother (alternate version)</a>” (<i>The Early Years 1965-1972</i>, 2016); “<a href=\"https://www.youtube.com/watch?v=48PJGVf4xqk\" target=\"_blank\">One Of These Days</a>” (<i>Meddle</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=t3J_2R9rAp8\" target=\"_blank\">Fearless</a>” (<i>Meddle</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=53N99Nim6WE\" target=\"_blank\">Echoes</a>” (<i>Meddle</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=16V-wNwlTw0\" target=\"_blank\">Obscured By Clouds</a>“/”<a href=\"https://www.youtube.com/watch?v=6vr07uuBjg4\" target=\"_blank\">When You’re In</a>” (<i>Obscured By Clouds</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=k6JpS1XYGJQ\" target=\"_blank\">Wot’s…Uh, The Deal</a>” (<i>Obscured By Clouds</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=2A7xoKo7sGM\" target=\"_blank\">Childhood’s End</a>” (<i>Obscured By Clouds</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=Rhge-ZOgfsw\" target=\"_blank\">Stay</a>” (<i>Obscured By Clouds</i>, 1972)</p>\n<p><b><span>Eclipse: Pink Floyd Become International Superstars with <i>Dark Side Of The Moon</i>, <i>Wish You Were Here</i>, <i>Animals</i> and </span><i><span>The Wall</span><br />\n</i></b>The gang has a laugh about how comically impossible it is to say anything new about <i>Dark Side Of The Moon</i> (1973). It’s all been done! But they plow forward gamely nonetheless, emphasizing that although the big ‘radio hits’ on this record have been played into the ground (“Time,” “Money,” etc.), all the rest is still immensely powerful, and evidence that Floyd, under Waters’ influence, had transitioned into a much more musically focused phase that would pay enormous commercial and critical dividends. Still, Jeff, Scott and Anthony can’t help but point out that the <i>best</i> contributions to <i>Dark Side</i> remain Rick Wright’s…those slow, patiently developing piano chords are wildly effective not only on “Us And Them” (which had been kicking around since 1970) but also on “The Great Gig In The Sky” as well. Anthony praises Roger Waters’ lyrical and metric sensibility on the “Brain Damage”/”Eclipse” suite, while Jeff points out that if you want to know why <i>Dark Side</i> is considered the hi-fi gold standard for audiophile production, you need merely listen to these two songs.</p>\n<p>People get tired of <i>Dark Side Of The Moon. </i>People get tired of <i>The Wall</i>. Some people have never had any time at all for <i>Animals</i>. But nobody has gotten tired of Pink Floyd’s <i>Dark Side</i> follow-up, the Syd Barrett tribute (and music industry lament) of <i>Wish You Were Here</i> (1975). This one gets a unanimous thumbs-up from the gang (even Jeff, who openly writes off this era). Scot talks about the pleasures of the title track and how it slowly unfolds into its final chorus, and argues that “Have A Cigar” features one of Gilmour’s finest guitar solos. Anthony calls this the ultimate “teenage blacklight” get-blazed album. We would recommend this album to you, but then again how on earth could it be possible that you haven’t already heard this album?</p>\n<p><i>Animals</i> (1977) is the very odd, very strident next step in the Pink Floyd discography: Roger Waters takes over with a series of thinly veiled Orwellian allegories (is there even a veil on “Pigs (Three Different Ones)”?), but the gang overlooks that because the <i>music</i> is still so endlessly, recombinatively creative. Anthony and Jeff both agree that “Dogs” is one of the best Pink Floyd songs ever recorded, and the “jazz chill”-cum-“raving and drooling” slice of rage that is “Sheep” also comes in for praise.</p>\n<p><i>The Wall</i> (1979) is where the gang sharply departs from critical and commercial consensus. Popular opinion holds <i>The Wall — </i>Roger Waters’ opus to the alienation he experienced from life as a world-famous rock star — to be their crowning achievement. Meanwhile, none of the gang likes it that much (Jeff memorably describes it as a “meticulously crafted piece of shit”). Jeff, Scot, and Anthony are all a little bit turned off by Waters’ rock star trip on this album (Scot also points out how utterly shot Roger’s voice sounds throughout the record), and argue that the turn toward highly programmatic musical theater hamstrings the band. That said, all agree that there are several great moments to be found on <i>The Wall</i>, though they also agree it’s telling that most of them are ones where David Gilmour has an outsized involvement. (The one exception may be Anthony’s pick of “Nobody Home,” which was itself written by Waters about Rick Wright, whom Waters kicked out of the band at this time.) Still, despite the bombast, it is an amazingly well produced and sequenced album — Jeff thinks the segue from “Happiest Days Of Our Lives” into “Another Brick Pt. 2” may justify the entire mess.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=mPGv8L3a_sY&index=5&list=PLEQdwrAGbxncZFLH4KETau3-uncnqVtWD\" target=\"_blank\">The Great Gig In The Sky</a>” (<i>Dark Side Of The Moon</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=rwPM01cbQBc\" target=\"_blank\">Money</a>” (<i>Dark Side Of The Moon</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=GKiLEgAzFDQ\" target=\"_blank\">Us And Them</a>” (<i>Dark Side Of The Moon</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=DVQ3-Xe_suY\" target=\"_blank\">Brain Damage/Eclipse</a>” (<i>Dark Side Of The Moon</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=tbdpv7G_PPg\" target=\"_blank\">Have A Cigar</a>” (<i>Wish You Were Here</i>, 1975); “<a href=\"https://www.youtube.com/watch?v=9pkh8zi_eic\" target=\"_blank\">Shine On You Crazy Diamond</a>” (<i>Wish You Were Here</i>, 1975); “<a href=\"https://www.youtube.com/watch?v=hjpF8ukSrvk\" target=\"_blank\">Wish You Were Here</a>” (<i>Wish You Were Here</i>, 1975); “<a href=\"https://www.youtube.com/watch?v=4QA30qkRYy8\" target=\"_blank\">Dogs</a>” (<i>Animals</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=3GE-sfEbJ7I\" target=\"_blank\">Sheep</a>” (<i>Animals</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=x-xTttimcNk\" target=\"_blank\">Comfortably Numb</a>” (<i>The Wall</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=dJNekD3dnQY\" target=\"_blank\">The Happiest Days Of Our Lives”/”Another Brick In The Wall (Part 2)</a>” (<i>The Wall</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=xe3NUKCnZp4\" target=\"_blank\">Mother</a>” (<i>The Wall</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=bn6YnUt4Vuk\" target=\"_blank\">Goodbye Blue Sky</a>” (<i>The Wall</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=soL8JK6kALc\" target=\"_blank\">Hey You</a>” (<i>The Wall</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=gNMGrkCNLVk\" target=\"_blank\">Nobody Home</a>” (<i>The Wall</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=j2s8yGMEbSs\" target=\"_blank\">Run Like Hell</a>” (<i>The Wall</i>, 1979)</p>\n<p><b><span>Collapse: <i>The Final Cut</i> and the Post-Waters Era of Floyd</span><br />\n</b>It’s tough sledding ahead as the gang tries to make sense of Pink Floyd’s post-<i>Wall </i>era. Nobody can offer a rational defense of the unmusical, maudlin, self-regarding politicized tripe that is <i>The Final Cut</i> (1983), an album that is almost bizarrely unlistenable outside of a few isolated tracks. Anthony sums it up by pointing out that “The Fletcher Memorial Home” features Roger Waters putting all of his political enemies into a gas chamber and then flipping the switch to “on,” like an alt-right meme…<i>except deadly serious</i>. As hard to justify as <i>The Final Cut</i> is, the gang can’t really find that much more to say in defense of the first Gilmour-only Floyd album <i>A Momentary Lapse Of Taste</i>…erm, I meant <i>Reason</i> (1987). This is just elevator muzak, yuppie lullaby mush, and even if “Learning To Fly” is a nice little toe-tapper it certainly doesn’t sound like Pink Floyd. Neither does <i>The pision Bell</i> (1994), really, although both Jeff and Anthony are willing to go to bat a bit more for it. “Poles Apart,” “What Do You Want From Me?,” “Coming Back To Life,” and “Marooned” are all nice little songs. But the spirit is gone, and this sounds like David Gilmour solo work rather than proper Floyd. A brief discussion of the Wright-posthumous <i>Endless River</i> wraps things up.<b> </b></p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=rhFCywuSDMI\" target=\"_blank\">The Gunner’s Dream</a>” (<i>The Final Cut</i>, 1983); “<a href=\"https://www.youtube.com/watch?v=DoEe5JcKzvU\" target=\"_blank\">The Fletcher Memorial Home</a>” (<i>The Final Cut</i>, 1983); “<a href=\"https://www.youtube.com/watch?v=9Q7BYoUMjFE\" target=\"_blank\">Learning To Fly</a>” (<i>A Momentary Lapse Of Reason</i>, 1987); “<a href=\"https://www.youtube.com/watch?v=KmlZ1WhlYsM\" target=\"_blank\">What Do You Want From Me?</a>” (<i>The pision Bell</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=8EHHUiRuJAk\" target=\"_blank\">Marooned</a>” (<i>The pision Bell</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=tC8631Kqzb0\" target=\"_blank\">Coming Back To Life</a>” (<i>The pision Bell</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=5ciWB7VykII\" target=\"_blank\">Poles Apart</a>” (<i>The pision Bell</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=lku1fP-LszI\" target=\"_blank\">High Hopes</a>” (<i>The pision Bell</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=Snb6rD-f_4g\" target=\"_blank\">Autumn ’68</a>” (<i>The Endless River</i>, 2014)</p>\n<p><b><span>Finale</span><br />\n</b>Anthony, Scot and Jeff each name their two key albums and five key songs by Pink Floyd.</p>\n",
  "enclosure": "",
  "itunes:title": "Episode 12: Anthony Fisher / Pink Floyd",
  "itunes:author": "National Review",
  "itunes:duration": "01:44:10",
  "itunes:summary": "Scot and Jeff talk to Anthony Fisher about Pink Floyd.",
  "itunes:subtitle": "Scot and Jeff talk to Anthony Fisher about Pink Floyd.",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 12
}