{
  "title": "Vacancy of Senior Research Scientist in Data Analytics, Data61, CSIRO, Sydney",
  "link": "https://rdatamining.wordpress.com/2017/10/06/vacancy-of-senior-research-scientist-in-data-analytics-data61-csiro-sydney/",
  "comments": "https://rdatamining.wordpress.com/2017/10/06/vacancy-of-senior-research-scientist-in-data-analytics-data61-csiro-sydney/#comments",
  "dc:creator": "Yanchang Zhao",
  "pubDate": "Fri, 06 Oct 2017 02:41:47 +0000",
  "category": [
    "Data Mining",
    "Uncategorized"
  ],
  "guid": "http://rdatamining.wordpress.com/?p=564",
  "description": "Senior Research Scientist URL: https://jobs.csiro.au/job/Sydney%2C-NSW-Senior-Research-Scientist/428894500/ Undertake innovative research in the area of Data Analytics Use your expertise in machine learning or data mining to solve real-word problems! Join CSIRO Data61&#8217;s team, the largest data innovation group in Australia &#160; The &#8230; <a href=\"https://rdatamining.wordpress.com/2017/10/06/vacancy-of-senior-research-scientist-in-data-analytics-data61-csiro-sydney/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p><strong>Senior Research Scientist</strong></p>\n<p>URL: <a href=\"https://jobs.csiro.au/job/Sydney%2C-NSW-Senior-Research-Scientist/428894500/\" target=\"_blank\" rel=\"noopener\">https://jobs.csiro.au/job/Sydney%2C-NSW-Senior-Research-Scientist/428894500/</a></p>\n<ul>\n<li>Undertake innovative research in the area of Data Analytics</li>\n<li>Use your expertise in machine learning or data mining to solve real-word problems!</li>\n<li>Join CSIRO Data61&#8217;s team, the largest data innovation group in Australia</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>The Position</strong></p>\n<p>At Data61 we are bringing together exceptional people from research and industry to create the largest data innovation group in Australia.  Data61’s Analytics Research Group delivers innovative data analytical solutions for industry, and currently has an opportunity for an experienced senior research scientist in the field of machine learning and/or data mining.</p>\n<p>As the successful candidate you will join an award-winning team and benefit from interactions with Data61’s world-class researchers.  You will perform various data analytics related to infrastructure and asset management as outlined below.</p>\n<p>Under the direction of the Principal Research Scientist you will:</p>\n<ul>\n<li>Develop algorithm, interface, and system for intelligent infrastructure/asset management.</li>\n<li>Research on data analytics and related topics for infrastructure and asset management.</li>\n<li>Conduct data pre-processing, analysis, and other necessary tasks related to the research problem.</li>\n<li>Communicate effectively and respectfully with all staff, clients and suppliers in the interests of good business practice, collaboration and enhancement of CSIRO’s reputation.</li>\n<li>Work as part of a multi-disciplinary, often regionally dispersed research team, to carry out tasks under limited direction in support of scientific research.</li>\n<li>Work collaboratively with colleagues within your team, the business unit and across CSIRO, to reach objectives.</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>Location:  </strong>           Eveleigh, NSW</p>\n<p><strong>Salary:   </strong>              CSOF6 &#8211; AU $109K &#8211; $128K plus up to 15.4% superannuation</p>\n<p><strong>Tenure:   </strong>             Specified term of 3 years</p>\n<p><strong>Reference:    </strong>       46943</p>\n<p><strong>Closing date:  </strong>     Applications will remain open until filled.</p>\n<p>&nbsp;</p>\n<p><strong>Pre-Requisites:</strong></p>\n<p>Education/Qualifications: A doctorate and or equivalent research experience in a relevant discipline area, such as Machine learning and Data Mining.</p>\n<p>Communication: Excellent written and oral communication skills, evidenced by high-level reporting, presentation and negotiation abilities, and the capacity to identify and influence critical stakeholders to gain support for contentious proposals/ideas.</p>\n<p><strong>To be successful you will need:</strong></p>\n<p>Experience in conducting research projects either within universities or within an industry based research lab.</p>\n<p>Excellent research record evidenced by quality publications in high impact Machine Learning, AI, Data Mining conferences and journals.</p>\n<p>Proven track-record of contributions towards industrial innovation.</p>\n<p>Experience in (co-)supervising PhD students or research staff in research projects and high-quality publications.</p>\n<p>Good programming skills using Python, Matlab, or similar program.</p>\n<p>A significant record of science innovation and creativity plus the ability to apply well developed research skills to scientific investigations.</p>\n<p><strong>Desirable criteria:</strong></p>\n<p>Experience with one or more of the following:</p>\n<p>o Bayesian nonparametrics</p>\n<p>o nonhomogeneous stochastic process</p>\n<p>o large scale data mining/processing/inference</p>\n<p>o Experience with dynamic processes/networks, or spatial-temporal data.</p>\n<p><strong>How to Apply:</strong></p>\n<p>Please upload one document only containing both your CV/Resume and cover letter providing enough information relevant to this position to enable the selection panel to determine your suitability.  If your application proceeds to the next stage you may be asked to provide additional information.</p>\n<p>Please view the full position details and instructions on how to apply here:<br />\n<a href=\"http://www.csiro.au/~/media/Positions/2017/Data61/46943_Senior_Research_Scienist_Data_Analytics_CSOF6_PD.docx\" target=\"_blank\" rel=\"noopener\">http://www.csiro.au/~/media/Positions/2017/Data61/46943_Senior_Research_Scienist_Data_Analytics_CSOF6_PD.docx</a></p>\n<p>Who we are:<br />\nThe Commonwealth Scientific and Industrial Research Organisation (CSIRO)<br />\n<a href=\"http://www.csiro.au/\" target=\"_blank\" rel=\"noopener\">http://www.csiro.au/</a></p>\n",
  "wfw:commentRss": "https://rdatamining.wordpress.com/2017/10/06/vacancy-of-senior-research-scientist-in-data-analytics-data61-csiro-sydney/feed/",
  "slash:comments": 1,
  "media:content": {
    "media:title": "rdatamining"
  }
}