{
  "title": "Calculating the intersection area of 3+ circles",
  "link": "",
  "updated": "2013-11-19T00:00:00-08:00",
  "id": "http://www.benfrederickson.com/calculating-the-intersection-of-3-or-more-circles/",
  "content": "\n        \n            <img src=\"http://www.benfrederickson.com/images/circle-intersection/circleintersection.gif\" width=\"100%\" style=\"max-width:500px\">\n        \n        <p>While attempting to learn Javascript and D3.js a couple months ago, I wrote a\nlittle library for <a href=\"/2013/05/09/venn-diagrams-with-d3.js.html\">displaying area proportional venn\ndiagrams</a>.</p>\n\n<p>One thing this library didn’t do though is consider the intersection areas of\n3 or more circles when placing each set in the venn diagram. Its a trickier\nproblem than I first thought, mainly because of all the special cases that can\narise when the number of circles gets large. While the 2 circle case is a simple calculus\nproblem, I failed to extend this solution to calculate the intersection area\nof an arbitrary number of circles.</p>\n\n<p>The research papers I read on this both avoided calculating the circle\nintersection by using approximation techniques. One paper <a href=\"http://bioinformatics.oxfordjournals.org/content/early/2004/11/30/bioinformatics.bti169.full.pdf\">approximated the circles using\npolygons</a>\nand used polygon intersection techniques to get the area, and the other\n<a href=\"http://www.cs.uic.edu/~wilkinson/Publications/venneuler.pdf\">approximated by plotting each circle and using binary indexing to compute the\narea</a>. I\ntried out the latter approach, but found it to be too slow for realtime use.</p>\n\n<p>Since then, I’ve had some ideas on different approaches to this problem that I wanted to try out.\nTo keep up with learning D3, I also thought I’d try visualizing each approach here.</p>\n\n<p class='more'><a href='http://www.benfrederickson.com/calculating-the-intersection-of-3-or-more-circles/'>Read more ...</a></p>\n     "
}