{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-2023207336800236439",
  "published": "2022-09-23T13:24:00.001-05:00",
  "updated": "2022-09-23T16:50:20.750-05:00",
  "category": [
    "",
    "",
    "",
    ""
  ],
  "title": "Brexit might not have been such a bad idea after all -- EU insanity",
  "content": "<p>I was for Fixit, not Brexit. The EU is a great idea. They put together articles of confederation, empowering an out of control bureaucracy. OK, we did that too, minus the bureaucracy part. Try again, with a real constitution, a real federal government, clear separation of powers, checks and balances, and a careful list of limitations, not long vague aspirations.&nbsp;</p><p>Europe has not taken that suggestion, nor the hint offered by the Brits leaving. The latest evidence is a tiny puff in this hurricane of hot air, which I found on <a href=\"https://twitter.com/emilyjblanchard/status/1573260938077442048\" target=\"_blank\">this tweet</a>.&nbsp;</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhd4H-zA6r-mSvYoHIWMzEguB6whqnwn5c_-7JNg89_G_ZuVpd9mlNF19EccRoeA9qqkk8wMjISl4fSBCIOanHatCzz_J323NPD0k3XF8JCmArPmgNZmOOut-a1mwkNtEZfMZC8o-XHUVCTP_R2jHFeSaRU7pYnxByNRb-YxJY57rKV8GxS9fr8gZo/s1250/Screen%20Shot%202022-09-23%20at%2010.32.10%20AM.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1250\" data-original-width=\"1206\" height=\"320\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhd4H-zA6r-mSvYoHIWMzEguB6whqnwn5c_-7JNg89_G_ZuVpd9mlNF19EccRoeA9qqkk8wMjISl4fSBCIOanHatCzz_J323NPD0k3XF8JCmArPmgNZmOOut-a1mwkNtEZfMZC8o-XHUVCTP_R2jHFeSaRU7pYnxByNRb-YxJY57rKV8GxS9fr8gZo/s320/Screen%20Shot%202022-09-23%20at%2010.32.10%20AM.png\" width=\"309\" /></a></div>That sounds interesting, in a waste time on twitter while procrastinating getting to work sort of way. And I was encouraged--EC bureaucracies looking for outside advice, breaking out of the bubble seems like a good idea. Hey, maybe I'll apply, I thought.&nbsp;<div><br /></div><div>I followed the <a href=\"https://single-market-economy.ec.europa.eu/calls-expression-interest/deadline-20221010-call-expression-interest-expert-economic-advice-dg-internal-market-industry_en\" target=\"_blank\">link to the official announcement</a>&nbsp;and it offers in a nutshell what's going on in EU \"policy-making,\" (and a hint why I hate that word)</div><div><div><br /></div><blockquote><div>The latest communication on industrial policy strategy (<a href=\"https://ec.europa.eu/info/sites/default/files/communication-industrial-strategy-update-2020_en.pdf\" target=\"_blank\">COM(2021) 350final</a>) has shifted the attention towards an ecosystem approach to industrial policy, focusing on industrial ecosystems and their complex interconnections related, among other things, to entrepreneurship (and SMEs), innovation, skills, value creation and social impact.</div></blockquote><div>After mulling over the obvious reality of war, supply chains, etc.&nbsp;</div><blockquote><div>..a reactive stance is not sufficient and needs to be complemented by a forward-looking reflection aimed at properly considering externalities and risk factors to be prepared for - and therefore more and more resilient against - possible additional challenges (for instance in terms of disruptions and shortages but also new, far from impossible health crises), remaining consistent with crucial long-term objectives. Progress is more than innovation and EU competitiveness, more than continuous growth and geopolitical predominance. [Who are you kidding?] <i>It is also quality of life, sustainable production and energy generation, digitally advanced (but also digitally safe and fair) infrastructure, “enlightened” decision-making at corporate level eventually influenced by well-informed choices at consumer level</i>.</div></blockquote><div>My emphasis. The subject is a bit mysterious in all these passive sentences, but I believe it is \"EU industrial policy.\" I'm glad it will take on scare-quote enlightened decision making at the corporate level and allow eventually for some \"well-informed\" choices \"at the consumer level.\" That's you with the pitchforks. &nbsp;</div><blockquote><div>This may imply putting into question traditional policy yardsticks such as the focus on industrial sectors as done with the shift towards an ecosystem approach,<i> [the focus on] on the overarching principle of economic efficiency as a first best for resources allocation e.g. by factoring in risks associated to critical strategic dependencies,</i> or the focus on traditional stakeholders (for instance, by including a wider set of actors, in a truly ecosystem mindset going beyond industrial activity and including other relevant players, such as universities, research centres, and even the role of local communities). This may be more effectively inspired by policy missions, rather than sectoral or even social cleavages.</div></blockquote><div>Well, no wonder they need some outside economists if they're going to perfectly foresee \"critical strategic dependencies\" in the \"ecosystem,\" such as, oh, maybe Russia might turn off the gas some day. &nbsp;\"Policy missions, rather than sectoral or even social cleavages?\" I have no idea what that means.&nbsp;</div><div><br /></div><blockquote><div>This may also imply some reshuffling in policy priorities, for instance by having some ethical yardsticks considered upfront (namely, but not only, with respect to innovation), </div></blockquote><p>\"by having ethical yardsticks considered upfront.\" Don't you love passive voice? \"namely... with respect to innovation\" is truly chilling. That means, before you can innovate, the great directorate of industrial policy will decide if your innovation is \"ethical,\" as it affects \"stakeholders\" and the \"industrial ecosystem.\" What is the chance James Watt's steam engine will make it past that?&nbsp;</p><blockquote><div>by enshrining sustainability considerations (and related externalities often ignored in the past) in trade-offs underlying corporate choices, by thoroughly considering social impact of public and private investment as a major element of choice. </div></blockquote><p>Passive means us. Can any investment get past this? Oh yes,&nbsp;</p><blockquote><div>“Social cheerleading” and “greenwashing” should become strictly unfeasible, starting from becoming easily detectable. This may imply rethinking the incentives and mechanisms to better align public goals and private behaviour. It may also imply refining our metric to measure progress.</div></blockquote><p>Heavens, we wouldn't want to have any greenwashing here.&nbsp;</p><blockquote><p>If addressed only from a national perspective, all the challenges and reflections above would seem and would be unsurmountable. A truly coordinated European approach exploiting the potential of the Single Market would be of the utmost importance...</p></blockquote></div><div>Now you know why the Brits left.&nbsp;</div><div><br /></div><div><div></div><blockquote><div>What follows is a non-exhaustive list of examples of themes of interest to DG GROW within the broad areas defined above: [edited here] &nbsp;</div></blockquote><blockquote><div>• Industrial policy in the Single Market: moving forward avoiding fragmentation and minimising short-term losses</div></blockquote><div></div><div>Aha, so industrial policy involve \"short term\" losses!&nbsp;</div><blockquote><div>• A mission-oriented Single Market to increase ownership, generate momentum and help prioritising actions aimed at improving its functioning</div></blockquote><div>Ownership can be transferred, but how can ownership be increased? Otherwise as empty a sentence as I've seen in a long time.&nbsp;</div><blockquote><div>• Strategic dependencies, monitoring risks and building supply chains resilience</div></blockquote><div>Yes, you did such a great job on that one by banning fracking and decommissioning nuclear power.</div><div></div><blockquote><div>• Dependencies and the search for new economic models</div><div>• Alternative purposeful business practices</div></blockquote><div></div><div>Just savor the empty words. Or are they Orwellian and full of meaning?&nbsp;</div><div></div><blockquote><div>• Unlocking the green business case; the role of the Single Market</div><div>• Investment needs to leap forward</div></blockquote><p>A Great Leap Forward? How are you going to leap forward given the previous page that says, basically, all investment must stop?&nbsp;</p><blockquote><div>• New metrics to measure economic progress</div></blockquote></div><div>We haven't dug ourselves into a 20 meter hole. It's only a tenth of a furlong! &nbsp;</div><div><br /></div><div>I am tempted to apply. I offer this: \"Cut the BS, get out of the way, quit and get some real jobs. The pretense of technocratic competence to understand and manipulate such a huge Rube-Goldberg view of the world is just laughable.\" Send the 15,0000 euro check to Hoover.&nbsp;</div><div><br /></div><div>I originally thought this would be illegal. <a href=\"https://cadmus.eui.eu/handle/1814/65947\" target=\"_blank\">But on a little research,</a> the Lisbon Treaty, which was supposed to improve the EU, takes a big step backwards.&nbsp;</div><blockquote><div>The Lisbon Treaty introduced in its Art. 3 new language into primary law that expresses the ambition to give the EU a stronger social dimension.1 In comparison to its predecessor provision of Art. 4 (1) of the Treaty Establishing the European Community, which solely relied on the ‘principle of an open market economy with free competition’, the basic objectives of the EU were broadened. Art. 3 TEU now includes objectives that come across as a promise to rebalance market and non-market values through the foundational provisions of the European Union. In line with other wide-ranging objectives, like fighting social exclusion, this article includes the eye-catching sentence that the EU aims for ‘a highly competitive social market economy’ that seeks to achieve ‘full employment and social progress’</div></blockquote><div>Liz Truss may struggle to convince the UK that to fix supply you have to fix supply (<a href=\"https://www.wsj.com/articles/tories-struggle-to-get-britains-economic-mojo-back-taxes-revival-plan-prime-minister-liz-truss-voters-regulation-economic-turn-11663856682\" target=\"_blank\">great WSJ commentary by Joe Sternmberg here</a>) but at least she knows where to go. Europe still seems lost in the fog. &nbsp;</div><div><br /></div><div>This is of course likely to go nowhere, to just employ PhD economists to write reports nobody reads. But who knows, having missed a real estate bust, a sovereign debt crisis, a pandemic, an energy crisis and a war, the ECB is doubling down on climate change stress tests, so you never know what foolishness can actually make it into policy.&nbsp;</div><div><br /></div><div>And it's not all so bad. Ukrainians look East vs. West. A bunch of bureaucratic tomfoolery looks a whole lot better than what Vlad the Impaler has to offer. Go Europe. Some day, fixit.</div><div><p><br /></p></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 11
}