{
  "title": "The Great Firewall of China &#8211; Part 1",
  "link": "https://malicious.life/the-great-firewall-of-china-part-1/",
  "pubDate": "Fri, 14 Aug 2020 08:03:24 +0000",
  "guid": "https://malicious.life/?p=1077",
  "comments": "https://malicious.life/the-great-firewall-of-china-part-1/#respond",
  "wfw:commentRss": "https://malicious.life/the-great-firewall-of-china-part-1/feed/",
  "slash:comments": 0,
  "category": "Uncategorized",
  "description": "The Great Firewall is just mind-bogglingly big, repressing freedom of speech and information for over 800 million Chinese internet users every year. The Great Firewall is so big that it’s worth asking: how did the Chinese manage to build it in the first place? 20 years ago, our info-sec technology was much less advanced than it is today. China was a second-rate technology power, not even comparable to their position today. Most of all: a firewall, like the one they proposed, had never existed before--or, for that matter, since. How, then, did they pull it off?",
  "content:encoded": "\n<p>The Great Firewall is just mind-bogglingly big, repressing freedom of speech and information for over 800 million Chinese internet users every year. The Great Firewall is <em>so</em> big that it’s worth asking: how did the Chinese manage to build it in the first place? 20 years ago, our info-sec technology was much less advanced than it is today. China was a second-rate technology power, not even comparable to their position today. Most of all: a firewall, like the one they proposed, had never existed before&#8211;or, for that matter, <em>since</em>. How, then, did they pull it off?</p>\n",
  "enclosure": "",
  "itunes:subtitle": "The Great Firewall is just mind-bogglingly big, repressing freedom of speech and information for over 800 million Chinese internet users every year. The Great Firewall is so big that it’s worth asking: how did the Chinese manage to build it in the firs...",
  "itunes:summary": "The Great Firewall is just mind-bogglingly big, repressing freedom of speech and information for over 800 million Chinese internet users every year. The Great Firewall is so big that it’s worth asking: how did the Chinese manage to build it in the first place? 20 years ago, our info-sec technology was much less advanced than it is today. China was a second-rate technology power, not even comparable to their position today. Most of all: a firewall, like the one they proposed, had never existed before--or, for that matter, since. How, then, did they pull it off?",
  "itunes:author": "Cybereason",
  "itunes:image": "",
  "itunes:duration": "40:09"
}