{
  "title": "Developing community around design",
  "link": "https://news.mit.edu/2022/developing-community-around-design-1017",
  "description": "MIT Morningside Academy for Design’s inaugural fellows chart a new course.",
  "pubDate": "Mon, 17 Oct 2022 11:00:00 -0400",
  "guid": "https://news.mit.edu/2022/developing-community-around-design-1017",
  "dc:creator": "Maria Iacobo | School of Architecture and Planning",
  "content:encoded": "<p>When the creation of the <a href=\"https://news.mit.edu/2022/morningside-academy-design-0314\">MIT Morningside Academy for Design</a> (MAD) — a major interdisciplinary center housed in the MIT School of Architecture and Planning (SA+P) — was announced last spring, it promised to build on the Institute’s legendary leadership in design-focused education and provide a hub for cross-disciplinary design work across MIT. The 14 graduate students enrolled as MAD’s inaugural cohort of design fellows are making good on that promise with research projects supporting a range of efforts, with many demonstrating a strong interest in working at the interface of design and sustainability.</p>\n\n<p>The fellows are currently enrolled in masters or doctoral programs across MIT. Engineers, business students, architects, city planners, policy developers — they all wanted to participate in the academy to expand their understanding of design and enrich their ongoing projects or theses.</p>\n\n<p>“While design is viewed in many ways across the MIT community, these fellowships prioritize students whose education and research emphasize design with a focus on users who will benefit from or interface with their work,” says John Ochsendorf, MAD’s founding director and the Class of 1942 Professor and a professor of architecture and of civil and environmental engineering.</p>\n\n<p>The 2022 Design Fellows are: Surbhi Agrawal, Jonathan Bessette, Justin Brazier, Alexander Crease, Ganit Goldstein, Kyle Gordon, Elijah Martin, Mariama N’Diaye, AJ Perez, Pedro Reynolds-Cuéllar, Francesca Riccio-Ackerman, Jana Saadi, Natha (Bam) Singhasaneh, and Jonathan Zong. Additional biographical information for the fellows is <a href=\"https://design.mit.edu/people/fellows\" target=\"_blank\">available on the Morningside Academy for Design website</a>.</p>\n\n<p>Some of the research projects the fellows are pursuing include designing deployable desalination and water treatment systems for humanitarian crises; investigating the agency and impact of design on cultural identity, agriculture, and environmental education; examining how computational design workflow can be used to generate sustainable customized garments; and using recycled consumer plastics to 3D print low-cost housing.</p>\n\n<p>Maria Yang, associate dean of the MIT School of Engineering and associate director for MAD, studies “how designers design” to improve design quality. She says design approaches that address the real needs of human users are particularly critical because of their ability to help designers make immediate impact in their work.</p>\n\n<p>“I knew from my own research in human-centered design process that there are many labs and departments across MIT who engage in socially impactful, design-focused research, but it wasn’t until we solicited applications for the fellowships that I realized just how much of the Institute is engaged in design-related research, as well as the depth, quality, and creativity of the work,” says Yang.</p>\n\n<p>Mariama N’Diaye is currently working on a dual masters in city planning in the Department of Urban Studies and Planning and in business administration at MIT Sloan School of Management. A Senegalese American from New York City, N’Diaye had previously been awarded a Fulbright Scholarship in which she spent a year conducting ethnographic research in Milan using a “design-thinking lens” to examine how the city’s agencies were working to support its growing non-European Union migrant population. She says she jumped at the chance to apply for a MAD fellowship.</p>\n\n<p>“I’ve been screaming the word ‘design’ for a while,” says N’Diaye. “The worlds of the urban planning space and the MBA space don’t necessarily think about design the same way that I do. For example, when I say ‘design,’ I mean design as a way of process, the way we engage with communities and the users for who we are creating new things, whether it’s a policy, a program, or a place. How do we design those processes to make people who are a part of it be at the center of decision-making?”</p>\n\n<p>N’Diaye’s thesis is focused on governance innovation and cities, and her professional goal is to work on international public sector innovation.</p>\n\n<p>Media arts and sciences PhD candidate Pedro Reynolds-Cuéllar SM ’18 was similarly excited to learn about the MAD fellowships last spring, in part because of the prospect of charting a formal education around design at MIT.</p>\n\n<p>“It also felt like a good opportunity to build community at MIT, especially after not being able to connect as much due to the pandemic,” he says.</p>\n\n<p>“In Colombia and other countries, there are different collectives that live outside of mainstream society,” says Reynolds-Cuéllar. “What you find when you enter these places is that technological artifacts are thought out and built differently than the artifacts that surround us in the U.S. daily. Just observing the history of these artifacts, and the way in which people in these places and cultures think of building them, and then comparing it with the way we think and build artifacts, reveals some of the things we could do better.</p>\n\n<p>“Some of the farmers I have encountered are the ultimate designers. The way they think about building things is very different than the way I’ve seen people think about building things at MIT. Everything these farmers design has to return to nature, one way or another, and usually these creations have tight connections to their culture. When I look at the way some things are built at MIT, people are far removed from the places where the raw materials are, so there really is no connection and understanding of the ecological impact of using these materials nor its connection to culture.”</p>\n\n<p>MAD celebrates its launch with a day-long forum — <a href=\"https://design.mit.edu/\">The Power of Design</a> — at the MIT Museum on Oct. 18. Three sessions will illustrate how design impacts the world in which we live. Faculty moderators are Maria Yang; Skylar Tibbits, associate professor in SA+P and director of the Self-Assembly Lab; and Dava Newman, director of the MIT Media Lab. &nbsp;</p>\n\n<p>The academy was established through a $100 million gift from the Morningside Foundation, the philanthropic arm of the T.H. Chan family. Its founding support includes funding for the fellowships, faculty chairs, opportunities for undergraduate students, and support for classes and curriculum development in design. MAD expects to also offer a variety of public events to the broader MIT community. In addition, the <a href=\"https://impactclimate.mit.edu/\">MIT Climate &amp; Sustainability Consortium</a> is proving funding for three fellows as part of the inaugural class. These fellows are working on projects that have a sustainability focus.</p>\n\n<p>The design fellows receive full tuition, health insurance, and a stipend. They are required to participate in a six-unit academic seminar each semester, intended to enrich and expand the work of each fellow, while building community around design across MIT.</p>\n\n<p>Still early in their first semester together, N’Diaye says that discussions among the fellows have been particularly helpful.</p>\n\n<p>“It’s been extremely beneficial to me,” says N’Diaye. “Just being able to connect to each other, learn from each other, to push each other, to hold ourselves accountable to getting our work done, and to be connected to the breadth of diversity of work that we wouldn’t have had the chance to be exposed to has been just great. We use that time as well to help shape the future of design at MIT.”</p>",
  "media:content": {
    "media:description": "The inaugural cohort of MIT Morningside Academy for Design fellows includes (top row, l-r) Surbhi Agrawal, Jonathan Bessette, Justin Brazier, Alexander Crease, Ganit Goldstein; (middle row, l-r) Kyle Gordon, Elijah Martin, Mariama N'Diaye, AJ Perez, Pedro Reynolds-Cuéllar; (bottom row, l-r) Francesca Riccio-Ackerman, Jana Saadi, Natha (Bam) Singhasaneh, and Jonathan Zong.",
    "media:credit": "Photos courtesy of the MIT Morningside Academy for Design."
  },
  "category": [
    "Awards, honors and fellowships",
    "Design",
    "Graduate, postdoctoral",
    "Architecture",
    "Mechanical engineering",
    "Urban studies and planning",
    "Media Lab",
    "Education, teaching, academics",
    "Sustainability",
    "Research",
    "Students",
    "School of Architecture and Planning",
    "MIT Museum",
    "School of Engineering",
    "MIT Sloan School of Management"
  ]
}