{
  "title": "Episode 22: &#8220;The Wallflower&#8221; by Etta James",
  "link": "https://500songs.com/podcast/episode-22-the-wallflower-by-etta-james/",
  "pubDate": "Mon, 04 Mar 2019 01:41:40 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-22-the-wallflower-by-etta-james/",
  "description": "Welcome to episode twenty-two of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"The Wallflower\" by Etta James. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nAlso, remember I'm halfway through the<a href=\"https://www.kickstarter.com/projects/andrewhickey/a-history-of-rock-music-in-500-songs-vol-1\"> Kickstarter for the first book based on this series.</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-22-the-wallflower/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI used a few books for this podcast, most of which I've mentioned before:\n\n<a href=\"https://amzn.to/2B30b6c\">Honkers & Shouters: The Golden Years of Rhythm and Blues</a> by Arnold Shaw, one of the most important books on early 50s rhythm and blues\n\n<a href=\"https://amzn.to/2SY9jkw\">Hound Dog: The Leiber and Stoller Autobiography</a> by Jerry Leiber, Mike Stoller, and David Ritz.\n\n<a href=\"https://amzn.to/2RpFb4G\">Midnight at the Barrelhouse: The Johnny Otis Story</a> by George Lipsitz.\n\n<a href=\"https://amzn.to/2GYXHep\">This collection</a> of Etta James' early work has all the songs by her I excerpted here *except* \"The Wallflower\".\n\n\"The Wallflower\", though, can be found on <a href=\"https://amzn.to/2VtBybi\">this excellent and cheap 3-CD collection of Johnny Otis material,</a> which also includes two other songs we've already covered, three more we will be covering, and a number which have been excerpted in this and other episodes.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nBefore I start, a quick content warning -- there's some mention of child abuse here. Nothing explicit, and not much, but it could cause some people to be upset, so I thought I'd mention it. If you're worried, there is, like always a full transcript of the episode at 500songs.com so you can read it as text if that might be less upsetting.\n\nWe've talked a little about answer songs before, when we were talking about \"Hound Dog\" and \"Bear Cat\", but we didn't really go into detail there. But answer songs were a regular thing in the 1950s, and responsible for some of the most well-known songs of the period. In the blues, for example, Muddy Waters' \"Mannish Boy\" is an answer song to Bo Diddley's \"I'm A Man\", partly mocking Diddley for being younger than Waters. But \"I'm A Man\" was, in itself, a response to Waters' \"Hoochie Coochie Man\".\n\nAnd, the \"Bear Cat\" debacle aside, this was an understood thing. It was no different to the old blues tradition of the floating lyric -- you'd do an answer song to a big hit, and hopefully get a little bit of money off its coattails, but because everyone did it, nobody complained about it being done to them. Especially since the answer songs never did better than the original. \"Bear Cat\" might have gone to number three, but \"Hound Dog\" went to number one, so where was the harm?\n\nBut there was one case where an answer song became so big that it started the career of a blues legend, had a film named after it, and was parodied across the Atlantic.\n\nThe story starts, just like so many of these stories do, with Johnny Otis. In 1953, Otis discovered a Detroit band called the Royals, who had recently changed their name from the Four Falcons to avoid confusion with another Detroit band, the Falcons -- this kind of confusion of names was common at the time, given the way every vocal group in the country seemed to be naming themselves after birds. Shortly after Otis discovered them, their lead singer was drafted, and Sonny Woods, one of the band's members, suggested that as a replacement they should consider Hank Ballard, a friend of his who worked on the same Ford assembly line as him. Ballard didn't become the lead singer straight away -- Charles Sutton moved to the lead vocal role at first, while Ballard took over Sutton's old backing vocal parts -- but he slowly became more important to the band's sound.\n\nBallard was an interesting singer in many ways -- particularly in his influences. While most R&B singers of this time wanted to be Clyde McPhatter or Wynonie Harris, Ballard was a massive fan of Gene Autry, the country and western singer who was hugely influential on Bill Haley and Les Paul. Despite this, though, his vocals didn't sound like anyone else's before him. You can find singers later on who sounded like Ballard -- most notably both Jackie Wilson and Chubby Checker started out as Hank Ballard soundalikes -- but nobody before him who sounded like that.\n\nOnce Ballard was one of the Mindighters, they had that thing that every band needed to stand out -- a truly distinctive sound of their own.\n\nOtis became the band's manager, and got them signed to King Records, one of the most important labels in the history of very early rock and roll. Their first few singles were all doo-wop ballads, many of them written by Otis, and they featured Sutton on lead. They were pleasant enough, but nothing special, as you can hear...\n\n[excerpt The Royals \"Every Beat of My Heart\"]\n\nThat's a song Johnny Otis wrote for them, and it later became a million seller for Gladys Knight and the Pips, but there's nothing about that track that really stands out -- it could be any of a dozen or so vocal groups of the time. But that started to change when Hank Ballard became the new lead singer on the majority of their records. Around that time, the band also changed its name to The Midnighters, as once again they discovered that another band had a similar-sounding name. And it was as the Midnighters that they went on to have their greatest success, starting with \"Get It\"\n\n[excerpt of The Midnighters, \"Get It\"]\n\n\"Get It\" was the first of a string of hits for the band, but it's the band's second hit that we're most interested in here. Hank Ballard had been a fan of Billy Ward and his Dominoes, and their hit \"Sixty Minute Man\", which had been considered a relatively filthy song for the time period.\n\n\"Get It\" had been mildly risque for the period, but Ballard wanted to write something closer to \"Sixty Minute Man\", and so he came up with a song that he initially titled \"Sock It To Me, Mary\". Ralph Bass, the producer, thought the song was a little too strong for radio play, and so the group reworked it in the studio, with the new title being taken partially from the name of the engineer's wife, Annie. The song they eventually recorded was called \"Work With Me Annie\"\n\n[excerpt of The Midnighters, \"Work With Me Annie\"]\n\nThat's certainly suggestive, but it wouldn't set too many people on the warpath in 2019. In 1954, though, that kind of thing was considered borderline pornographic. \"Give me all my meat?\" That's... well, no-one seemed sure quite what it was, but it was obviously filthy and should be banned. So of course it went to number one in the R&B chart. Getting banned on the radio has always been a guaranteed way to have a hit. And it helped that the song was ridiculously catchy, the kind of thing that you keep humming for weeks\n\nThe Midnighters followed up with a song that was even more direct -- \"Sexy Ways\"\n\n[excerpt of The Midnighters, \"Sexy Ways\"]\n\nThat, too, went right up the charts. But \"Work With Me Annie\" had been such a success that the band recorded two direct followups -- \"Annie Had A Baby\" and \"Annie's Aunt Fanny\".\n\nAnd they weren't the only ones to record answer songs to their record. There were dozens of them -- even a few years later, in 1958, Buddy Holly would be singing about how \"Annie's been working on the midnight shift\". But we want to talk about one in particular, here. One sung from the perspective of \"Annie\" herself.\n\nJamesetta Hawkins did not have the easiest of lives, growing up. She went through a variety of foster homes, and was abused by too many of them. But she started singing from a very early age, and had formal musical training. Sadly, that training was by another abuser, who used to punch her in the chest if she wasn't singing from the diaphragm. But she still credited that training with the powerful voice she developed later.\n\nJamesetta was another discovery of Johnny Otis. When she was introduced to Otis, at first he didn't want a new girl singer, but she impressed him so much that he agreed to sign her -- so long as she got her parents' permission, because she was only sixteen. There was one problem with that. She didn't know her father, and her mother was in jail. So she faked a phone call -- \"calling her mother\" while keeping a finger on the phone's button to ensure there was no actual call. She later provided him with a forged letter.\n\nMeanwhile, Jerry Leiber and Mike Stoller, Otis' former colleagues, were working on their own records with the Robins. The Robins had been through a few lineup changes, recorded for half a dozen small labels, and several of them had, on multiple occasions, had run-ins with the law. But they'd ended up recording for Spark Records, the label Leiber and Stoller had formed with their friend Lester Sill.\n\nTheir first record to become really, really big, was \"Riot in Cell Block Number Nine\". Like many Leiber and Stoller songs, this combined a comedy narrative -- this time about a riot in a jail, a storyline not all that different from their later song \"Jailhouse Rock\" -- with a standard blues melody.\n\n[Excerpt \"Riot in Cell Block Number Nine\" by the Robins]\n\nThat is, incidentally, probably the first record to incorporate the influence of the famous stop-time riff which Willie Dixon had come up with for Muddy Waters. You've undoubtedly heard it before if you've heard any blues music at all, most famously in Waters' \"Mannish Boy\"\n\n[Excerpt, Muddy Waters, \"Mannish Boy\"]\n\nBut it had first been used (as far as I can tell – remembering that there is never a true “first”) in Waters' \"Hoochie Coochie Man\", which first hit the R&B charts in March 1954:\n\n[Excerpt, Muddy Waters, \"Hoochie Coochie Man\"]\n\nThe Robins' record came out in May 1954. So it's likely that Leiber and Stoller heard “Hoochie Coochie Man” and immediately wrote “Riot”.\n\nHowever, they had a problem -- Bobby Nunn, the Robins' bass singer, simply couldn't get the kind of menacing tones that the song needed -- he was great for joking with Little Esther and things of that nature, but he just couldn't do that scary growl.\n\nOr at least, that's the story as Leiber and Stoller always told it. Other members of the Robins later claimed that Nunn had refused to sing the lead, finding the lyrics offensive. Terrell Leonard said \"We didn't understand our heritage. These two white songwriters knew our culture better than we did. Bobby wouldn't do it.\"\n\nBut they knew someone who would. Richard Berry was a singer with a doo-wop group called The Flairs, who recorded for Modern and RPM records. In particular, they'd recorded a single called \"She Wants to Rock\", which had been produced by Leiber and Stoller:\n\n[excerpt: The Flairs, \"She Wants to Rock\"]\n\nThat song was written by Berry, but you can hear a <em>very</em> clear stylistic connection with Leiber and Stoller's work. They were obviously sympathetic, musically, and clearly Leiber and Stoller remembered him and liked his voice, and they got him to sing the part that Nunn would otherwise have sung. \"Riot in Cell Block #9\" became a massive hit, though Berry never saw much money from it. This would end up being something of a pattern for Richard Berry's life, sadly. Berry was one of the most important people in early rock and roll, but his work either went uncredited or unpaid, or sometimes both.\n\nBut one thing that \"Riot in Cell Block #9\" did was cement Berry's reputation within the industry as someone who would be able to turn in a good vocal, at short notice, on someone else's record.\n\nAnd so, when it came time for Jamesetta Hawkins to record the new answer song for \"Work With Me Annie\", and they needed someone to be Henry, who Annie was engaging in dialogue, Johnny Otis called in Berry as well. Otis always liked to have a bit of saucy, sassy, back-and-forth between a male and female singer, and that seemed particularly appropriate for this song.\n\nThe record Otis, Hawkins, and Berry came up with was a fairly direct copy of \"Work With Me Annie\", but even more blatant about its sexuality.\n\n[excerpt Etta James: \"The Wallflower (Roll With Me Henry)\"]\n\nThe record was called \"The Wallflower\", but everyone knew it as \"Roll With Me Henry\". The song was credited to Jamesetta, under the new name Johnny Otis had given her, a simple reversal of her forename. Etta James was on her way to becoming a star.\n\nThe song as recorded is credited to Hank Ballard, Etta James, and Johnny Otis as writers, but Richard Berry always claimed he should have had a credit as well, claiming that his vocal responses were largely improvised. This is entirely plausible -- Berry was a great songwriter himself, who wrote several classic songs, and they sound like the kind of thing that one could come up with off the cuff. It's also certainly the case that there were more than a few records released around this time that didn't go to great lengths to credit the songwriters accurately, especially for contributions made in the studio during the recording session.\n\n\"The Wallflower\" went to number one on the R&B charts, but it didn't become the biggest hit version of that song, because once again we're looking at a white person copying a black person's record and making all the money off it. And Georgia Gibbs' version is one of those ones which we can't possibly justify as being a creative response. It's closer to the Crew Cuts than to Elvis Presley -- it's a note-for-note soundalike cover, but one which manages to staggeringly miss the point, not least because Gibbs changes the lyrics from \"Roll With Me Henry\" to the much less interesting \"Dance With Me Henry\".\n\n[excerpt Georgia Gibbs \"Dance With Me Henry\"]\n\nOn the other hand, it did have two advantages for the radio stations -- the first was that Gibbs was white, and the second was that it was less sexually explicit than Etta James' version -- \"The Wallflower\" may not sound particularly explicit to our ears, but anything that even vaguely hinted at sexuality, especially women's sexuality, and most especially *black* women's sexuality, was completely out of the question for early-fifties radio.\n\nThis wasn't the only time that Georgia Gibbs ripped off a black woman's record -- her cover version of LaVern Baker's \"Tweedle Dee\" also outsold Baker's original, and was similarly insipid compared to its inspiration. But at least in this case Etta James got some of the songwriting royalties, unlike Lavern Baker, who didn't write her record.\n\nAnd again, this is something we've talked about a bit and we will no doubt talk about more -- it's people like Georgia Gibbs who created the impression that all white rock and roll stars of the fifties merely ripped off black musicians, because there were so many who did, and who did it so badly. Some of the records we'll be talking about as important in this series are by white people covering black musicians, but the ones that are actually worth discussing were artists who put their own spin on the music and made it their own. You might argue about whether Elvis Presley or Arthur Crudup recorded the better version of \"That's All Right, Mama\", or whether Jerry Lee Lewis improved on Big Maybelle's original \"Whole Lotta Shakin'\" but it's an argument you can have, with points that can be made on both sides. Those records aren't just white people cashing in on black musicians' talent, they're part of an ongoing conversation between different musicians -- a conversation which, yes, has a racial power dynamic which should not be overlooked and needs to be addressed, but not an example of an individual white person deliberately using racism to gain success which should rightfully be a black person's.\n\nYou can't say that for this Georgia Gibbs record. It was an identical arrangement, the vocal isn't an interpretation as much as just existing, and the lyrics have been watered down to remove anything that might cause offence. No-one -- at least no-one who isn't so prudish as to actually take offence at the phrase \"roll with me\" -- listening to the two records could have any doubt as to which was by an important artist and which was by someone whose only claim to success was that she was white and the people she was imitating weren't.\n\nEtta James later rerecorded the track with those lyrics herself.\n\n[excerpt: Etta James \"Dance With Me Henry\"]\n\nIf you can't beat 'em, join 'em, I suppose. After all, \"Dance With Me Henry\" was an absolutely massive, huge hit. It was so popular that it spawned answer songs of its own. Indeed, even the Midnighters themselves recorded an answer to the answer – Gibbs' version, not Etta James' – when they recorded \"Henry's Got Flat Feet, Can't Dance No More\"\n\n[excerpt \"Henry's Got Flat Feet\", The Midnighters]\n\nAnd \"Dance With Me Henry\" got into the popular culture in a big way. The song was so popular that Abbott and Costello's last film was named after it, in a hope of catching some of its popularity. And it inspired other comedy as well.\n\nAnd here, again, we're going to move briefly over to the UK. Rock and roll hadn't properly hit Britain yet, though as it turns out it was just about to. But American hit records did get heard over here, and \"Dance With Me Henry\" was popular enough to come to the notice of the Goons.\n\nThe Goon Show was the most influential radio show of the 1950s, and probably of all time. The comedy trio of Spike Milligan, Peter Sellers, and Harry Secombe are namechecked as an influence by every great British creative artist of the 1960s and 70s, pretty much without exception. Not just comedians -- though there wouldn't be a Monty Python, for example, without the Goons -- but musicians, poets, painters. To understand British culture in the fifties and sixties, you need to understand the Goons. And they made records at times - - and one of the people who worked with them on their records was a young producer named George Martin.\n\nGeorge Martin had a taste for sonic experimentation that went well with the Goons' love of sound effects and silly voices, and in 1955 they went into the studio to record what became a legendary single -- Spike Milligan and Peter Sellers performing \"Unchained Melody\", which had been one of the biggest hits of the year in a less comedic version.\n\n[excerpt \"Unchained Melody\" by the Goons]\n\nThat track became legendary because it didn't see a legal release for more than thirty years. The publishers of \"Unchained Melody\" wouldn't allow them to release such a desecration of such a serious, important, work of art, and it and its B-side weren't released until the late 1980s, although the record was widely discussed. It became something of a holy grail for fans of British comedy, and was only finally released at all because George Martin's old friend, and Goon fan, Paul McCartney ended up buying the publishing rights to \"Unchained Melody\". And because that single was left unreleased for more than thirty years, so was its B-side.\n\nThat B-side was... well... this...\n\n[excerpt, Peter Sellers and Spike Milligan \"Dance With Me Henry\"]\n\nWhether that's a more or less respectful cover version than Georgia Gibbs', I'll let you decide...\n\nOf course, in the context of a British music scene that was currently going through the skiffle craze, that version of \"Dance With Me Henry\" would have seemed almost normal.\n\nBack in the US, Richard Berry was back at work as a jobbing musician. He wrote one song, between sets at a gig, which he scribbled down on a napkin and didn't record for two years, but \"Louie Louie\" didn't seem like the kind of thing that would have any commercial success, so he stuck to recording more commercial material, like \"Yama Yama Pretty Mama\":\n\n[Excerpt: Richard Berry \"Yama Yama Pretty Mama\"]\n\nWe'll pick back up with Richard Berry in a couple of years' time, when people remember that song he wrote on the napkin.\n\nMeanwhile, Etta James continued with her own career. She recorded a follow-up to \"the Wallflower\", \"Hey Henry\", but that wasn't a hit, and was a definite case of diminishing returns:\n\n[excerpt: Etta James, \"Hey Henry\"]\n\nBut her third single, \"Good Rockin' Daddy\", was a top ten R&B hit, and showed she could have a successful career.\n\nBut after this, it would be five years before she had another hit, which didn't happen until 1960, when after signing with Chess Records she released a couple of hit duets with Harvey Fuqua, formerly of the Moonglows.\n\n[excerpt: Etta James and Harvey Fuqua, \"Spoonful\"]\n\nThose duets saw the start of an incredible run of hits on the R&B charts, including some of the greatest records ever made. While we're unlikely to be covering her more as the story goes on -- her work was increasingly on the borderline between blues and jazz, rather than being in the rock and roll style of her early recordings with Johnny Otis -- she had an incredible career as one of the greatest blues singers of her generation, and continued recording until shortly before her death in 2011. She died three days after Johnny Otis, the man who had discovered her all those decades earlier.",
  "itunes:subtitle": "Welcome to episode twenty-two of A History of Rock Music in Five Hundred Songs. Today were looking at The Wallflower by Etta James. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nAlso, remember Im ha",
  "itunes:keywords": "Bo Diddley,Chess Records,Etta James,George Martin,Georgia Gibbs,Hank Ballard,Harvey Fuqua,Johnny Otis,LaVern Baker,Leiber and Stoller,Muddy Waters,Peter Sellers,Ralph Bass,Richard Berry,Spike Milligan,the blues,the Goons,The Robins,white cover versions,Willie Dixon",
  "itunes:episodeType": "full",
  "itunes:episode": 22,
  "content:encoded": "Welcome to episode twenty-two of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"The Wallflower\" by Etta James. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nAlso, remember I'm halfway through the<a href=\"https://www.kickstarter.com/projects/andrewhickey/a-history-of-rock-music-in-500-songs-vol-1\"> Kickstarter for the first book based on this series.</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-22-the-wallflower/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI used a few books for this podcast, most of which I've mentioned before:\n\n<a href=\"https://amzn.to/2B30b6c\">Honkers & Shouters: The Golden Years of Rhythm and Blues</a> by Arnold Shaw, one of the most important books on early 50s rhythm and blues\n\n<a href=\"https://amzn.to/2SY9jkw\">Hound Dog: The Leiber and Stoller Autobiography</a> by Jerry Leiber, Mike Stoller, and David Ritz.\n\n<a href=\"https://amzn.to/2RpFb4G\">Midnight at the Barrelhouse: The Johnny Otis Story</a> by George Lipsitz.\n\n<a href=\"https://amzn.to/2GYXHep\">This collection</a> of Etta James' early work has all the songs by her I excerpted here *except* \"The Wallflower\".\n\n\"The Wallflower\", though, can be found on <a href=\"https://amzn.to/2VtBybi\">this excellent and cheap 3-CD collection of Johnny Otis material,</a> which also includes two other songs we've already covered, three more we will be covering, and a number which have been excerpted in this and other episodes.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nBefore I start, a quick content warning -- there's some mention of child abuse here. Nothing explicit, and not much, but it could cause some people to be upset, so I thought I'd mention it. If you're worried, there is, like always a full transcript of the episode at 500songs.com so you can read it as text if that might be less upsetting.\n\nWe've talked a little about answer songs before, when we were talking about \"Hound Dog\" and \"Bear Cat\", but we didn't really go into detail there. But answer songs were a regular thing in the 1950s, and responsible for some of the most well-known songs of the period. In the blues, for example, Muddy Waters' \"Mannish Boy\" is an answer song to Bo Diddley's \"I'm A Man\", partly mocking Diddley for being younger than Waters. But \"I'm A Man\" was, in itself, a response to Waters' \"Hoochie Coochie Man\".\n\nAnd, the \"Bear Cat\" debacle aside, this was an understood thing. It was no different to the old blues tradition of the floating lyric -- you'd do an answer song to a big hit, and hopefully get a little bit of money off its coattails, but because everyone did it, nobody complained about it being done to them. Especially since the answer songs never did better than the original. \"Bear Cat\" might have gone to number three, but \"Hound Dog\" went to number one, so where was the harm?\n\nBut there was one case where an answer song became so big that it started the career of a blues legend, had a film named after it, and was parodied across the Atlantic.\n\nThe story starts, just like so many of these stories do, with Johnny Otis. In 1953, Otis discovered a Detroit band called the Royals, who had recently changed their name from the Four Falcons to avoid confusion with another Detroit band, the Falcons -- this kind of confusion of names was common at the time, given the way every vocal group in the country seemed to be naming themselves after birds. Shortly after Otis discovered them, their lead singer was drafted, and Sonny Woods, one of the band's members, suggested that as a replacement they should consider Hank Ballard, a friend of his who worked on the same Ford assembly line as him. Ballard didn't become the lead singer straight away -- Charles Sutton moved to the lead vocal role at first, while Ballard took over Sutton's old backing vocal parts -- but he slowly became more important to the band's sound.\n\nBallard was an interesting singer in many ways -- particularly in his influences. While most R&B singers of this time wanted to be Clyde McPhatter or Wynonie Harris, Ballard was a massive fan of Gene Autry, the country and western singer who was hugely influential on Bill Haley and Les Paul. Despite this, though, his vocals didn't sound like anyone else's before him. You can find singers later on who sounded like Ballard -- most notably both Jackie Wilson and Chubby Checker started out as Hank Ballard soundalikes -- but nobody before him who sounded like that.\n\nOnce Ballard was one of the Mindighters, they had that thing that every band needed to stand out -- a truly distinctive sound of their own.\n\nOtis became the band's manager, and got them signed to King Records, one of the most important labels in the history of very early rock and roll. Their first few singles were all doo-wop ballads, many of them written by Otis, and they featured Sutton on lead. They were pleasant enough, but nothing special, as you can hear...\n\n[excerpt The Royals \"Every Beat of My Heart\"]\n\nThat's a song Johnny Otis wrote for them, and it later became a million seller for Gladys Knight and the Pips, but there's nothing about that track that really stands out -- it could be any of a dozen or so vocal groups of the time. But that started to change when Hank Ballard became the new lead singer on the majority of their records. Around that time, the band also changed its name to The Midnighters, as once again they discovered that another band had a similar-sounding name. And it was as the Midnighters that they went on to have their greatest success, starting with \"Get It\"\n\n[excerpt of The Midnighters, \"Get It\"]\n\n\"Get It\" was the first of a string of hits for the band, but it's the band's second hit that we're most interested in here. Hank Ballard had been a fan of Billy Ward and his Dominoes, and their hit \"Sixty Minute Man\", which had been considered a relatively filthy song for the time period.\n\n\"Get It\" had been mildly risque for the period, but Ballard wanted to write something closer to \"Sixty Minute Man\", and so he came up with a song that he initially titled \"Sock It To Me, Mary\". Ralph Bass, the producer, thought the song was a little too strong for radio play, and so the group reworked it in the studio, with the new title being taken partially from the name of the engineer's wife, Annie. The song they eventually recorded was called \"Work With Me Annie\"\n\n[excerpt of The Midnighters, \"Work With Me Annie\"]\n\nThat's certainly suggestive, but it wouldn't set too many people on the warpath in 2019. In 1954, though, that kind of thing was considered borderline pornographic. \"Give me all my meat?\" That's... well, no-one seemed sure quite what it was, but it was obviously filthy and should be banned. So of course it went to number one in the R&B chart. Getting banned on the radio has always been a guaranteed way to have a hit. And it helped that the song was ridiculously catchy, the kind of thing that you keep humming for weeks\n\nThe Midnighters followed up with a song that was even more direct -- \"Sexy Ways\"\n\n[excerpt of The Midnighters, \"Sexy Ways\"]\n\nThat, too, went right up the charts. But \"Work With Me Annie\" had been such a success that the band recorded two direct followups -- \"Annie Had A Baby\" and \"Annie's Aunt Fanny\".\n\nAnd they weren't the only ones to record answer songs to their record. There were dozens of them -- even a few years later, in 1958, Buddy Holly would be singing about how \"Annie's been working on the midnight shift\". But we want to talk about one in particular, here. One sung from the perspective of \"Annie\" herself.\n\nJamesetta Hawkins did not have the easiest of lives, growing up. She went through a variety of foster homes, and was abused by too many of them. But she started singing from a very early age, and had formal musical training. Sadly, that training was by another abuser, who used to punch her in the chest if she wasn't singing from the diaphragm. But she still credited that training with the powerful voice she developed later.\n\nJamesetta was another discovery of Johnny Otis. When she was introduced to Otis, at first he didn't want a new girl singer, but she impressed him so much that he agreed to sign her -- so long as she got her parents' permission, because she was only sixteen. There was one problem with that. She didn't know her father, and her mother was in jail. So she faked a phone call -- \"calling her mother\" while keeping a finger on the phone's button to ensure there was no actual call. She later provided him with a forged letter.\n\nMeanwhile, Jerry Leiber and Mike Stoller, Otis' former colleagues, were working on their own records with the Robins. The Robins had been through a few lineup changes, recorded for half a dozen small labels, and several of them had, on multiple occasions, had run-ins with the law. But they'd ended up recording for Spark Records, the label Leiber and Stoller had formed with their friend Lester Sill.\n\nTheir first record to become really, really big, was \"Riot in Cell Block Number Nine\". Like many Leiber and Stoller songs, this combined a comedy narrative -- this time about a riot in a jail, a storyline not all that different from their later song \"Jailhouse Rock\" -- with a standard blues melody.\n\n[Excerpt \"Riot in Cell Block Number Nine\" by the Robins]\n\nThat is, incidentally, probably the first record to incorporate the influence of the famous stop-time riff which Willie Dixon had come up with for Muddy Waters. You've undoubtedly heard it before if you've heard any blues music at all, most famously in Waters' \"Mannish Boy\"\n\n[Excerpt, Muddy Waters, \"Mannish Boy\"]\n\nBut it had first been used (as far as I can tell – remembering that there is never a true “first”) in Waters' \"Hoochie Coochie Man\", which first hit the R&B charts in March 1954:\n\n[Excerpt, Muddy Waters, \"Hoochie Coochie Man\"]\n\nThe Robins' record came out in May 1954. So it's likely that Leiber and Stoller heard “Hoochie Coochie Man” and immediately wrote “Riot”.\n\nHowever, they had a problem -- Bobby Nunn, the Robins' bass singer, simply couldn't get the kind of menacing tones that the song needed -- he was great for joking with Little Esther and things of that nature, but he just couldn't do that scary growl.\n\nOr at least, that's the story as Leiber and Stoller always told it. Other members of the Robins later claimed that Nunn had refused to sing the lead, finding the lyrics offensive. Terrell Leonard said \"We didn't understand our heritage. These two white songwriters knew our culture better than we did. Bobby wouldn't do it.\"\n\nBut they knew someone who would. Richard Berry was a singer with a doo-wop group called The Flairs, who recorded for Modern and RPM records. In particular, they'd recorded a single called \"She Wants to Rock\", which had been produced by Leiber and Stoller:\n\n[excerpt: The Flairs, \"She Wants to Rock\"]\n\nThat song was written by Berry, but you can hear a <em>very</em> clear stylistic connection with Leiber and Stoller's work. They were obviously sympathetic, musically, and clearly Leiber and Stoller remembered him and liked his voice, and they got him to sing the part that Nunn would otherwise have sung. \"Riot in Cell Block #9\" became a massive hit, though Berry never saw much money from it. This would end up being something of a pattern for Richard Berry's life, sadly. Berry was one of the most important people in early rock and roll, but his work either went uncredited or unpaid, or sometimes both.\n\nBut one thing that \"Riot in Cell Block #9\" did was cement Berry's reputation within the industry as someone who would be able to turn in a good vocal, at short notice, on someone else's record.\n\nAnd so, when it came time for Jamesetta Hawkins to record the new answer song for \"Work With Me Annie\", and they needed someone to be Henry, who Annie was engaging in dialogue, Johnny Otis called in Berry as well. Otis always liked to have a bit of saucy, sassy, back-and-forth between a male and female singer, and that seemed particularly appropriate for this song.\n\nThe record Otis, Hawkins, and Berry came up with was a fairly direct copy of \"Work With Me Annie\", but even more blatant about its sexuality.\n\n[excerpt Etta James: \"The Wallflower (Roll With Me Henry)\"]\n\nThe record was called \"The Wallflower\", but everyone knew it as \"Roll With Me Henry\". The song was credited to Jamesetta, under the new name Johnny Otis had given her, a simple reversal of her forename. Etta James was on her way to becoming a star.\n\nThe song as recorded is credited to Hank Ballard, Etta James, and Johnny Otis as writers, but Richard Berry always claimed he should have had a credit as well, claiming that his vocal responses were largely improvised. This is entirely plausible -- Berry was a great songwriter himself, who wrote several classic songs, and they sound like the kind of thing that one could come up with off the cuff. It's also certainly the case that there were more than a few records released around this time that didn't go to great lengths to credit the songwriters accurately, especially for contributions made in the studio during the recording session.\n\n\"The Wallflower\" went to number one on the R&B charts, but it didn't become the biggest hit version of that song, because once again we're looking at a white person copying a black person's record and making all the money off it. And Georgia Gibbs' version is one of those ones which we can't possibly justify as being a creative response. It's closer to the Crew Cuts than to Elvis Presley -- it's a note-for-note soundalike cover, but one which manages to staggeringly miss the point, not least because Gibbs changes the lyrics from \"Roll With Me Henry\" to the much less interesting \"Dance With Me Henry\".\n\n[excerpt Georgia Gibbs \"Dance With Me Henry\"]\n\nOn the other hand, it did have two advantages for the radio stations -- the first was that Gibbs was white, and the second was that it was less sexually explicit than Etta James' version -- \"The Wallflower\" may not sound particularly explicit to our ears, but anything that even vaguely hinted at sexuality, especially women's sexuality, and most especially *black* women's sexuality, was completely out of the question for early-fifties radio.\n\nThis wasn't the only time that Georgia Gibbs ripped off a black woman's record -- her cover version of LaVern Baker's \"Tweedle Dee\" also outsold Baker's original, and was similarly insipid compared to its inspiration. But at least in this case Etta James got some of the songwriting royalties, unlike Lavern Baker, who didn't write her record.\n\nAnd again, this is something we've talked about a bit and we will no doubt talk about more -- it's people like Georgia Gibbs who created the impression that all white rock and roll stars of the fifties merely ripped off black musicians, because there were so many who did, and who did it so badly. Some of the records we'll be talking about as important in this series are by white people covering black musicians, but the ones that are actually worth discussing were artists who put their own spin on the music and made it their own. You might argue about whether Elvis Presley or Arthur Crudup recorded the better version of \"That's All Right, Mama\", or whether Jerry Lee Lewis improved on Big Maybelle's original \"Whole Lotta Shakin'\" but it's an argument you can have, with points that can be made on both sides. Those records aren't just white people cashing in on black musicians' talent, they're part of an ongoing conversation between different musicians -- a conversation which, yes, has a racial power dynamic which should not be overlooked and needs to be addressed, but not an example of an individual white person deliberately using racism to gain success which should rightfully be a black person's.\n\nYou can't say that for this Georgia Gibbs record. It was an identical arrangement, the vocal isn't an interpretation as much as just existing, and the lyrics have been watered down to remove anything that might cause offence. No-one -- at least no-one who isn't so prudish as to actually take offence at the phrase \"roll with me\" -- listening to the two records could have any doubt as to which was by an important artist and which was by someone whose only claim to success was that she was white and the people she was imitating weren't.\n\nEtta James later rerecorded the track with those lyrics herself.\n\n[excerpt: Etta James \"Dance With Me Henry\"]\n\nIf you can't beat 'em, join 'em, I suppose. After all, \"Dance With Me Henry\" was an absolutely massive, huge hit. It was so popular that it spawned answer songs of its own. Indeed, even the Midnighters themselves recorded an answer to the answer – Gibbs' version, not Etta James' – when they recorded \"Henry's Got Flat Feet, Can't Dance No More\"\n\n[excerpt \"Henry's Got Flat Feet\", The Midnighters]\n\nAnd \"Dance With Me Henry\" got into the popular culture in a big way. The song was so popular that Abbott and Costello's last film was named after it, in a hope of catching some of its popularity. And it inspired other comedy as well.\n\nAnd here, again, we're going to move briefly over to the UK. Rock and roll hadn't properly hit Britain yet, though as it turns out it was just about to. But American hit records did get heard over here, and \"Dance With Me Henry\" was popular enough to come to the notice of the Goons.\n\nThe Goon Show was the most influential radio show of the 1950s, and probably of all time. The comedy trio of Spike Milligan, Peter Sellers, and Harry Secombe are namechecked as an influence by every great British creative artist of the 1960s and 70s, pretty much without exception. Not just comedians -- though there wouldn't be a Monty Python, for example, without the Goons -- but musicians, poets, painters. To understand British culture in the fifties and sixties, you need to understand the Goons. And they made records at times - - and one of the people who worked with them on their records was a young producer named George Martin.\n\nGeorge Martin had a taste for sonic experimentation that went well with the Goons' love of sound effects and silly voices, and in 1955 they went into the studio to record what became a legendary single -- Spike Milligan and Peter Sellers performing \"Unchained Melody\", which had been one of the biggest hits of the year in a less comedic version.\n\n[excerpt \"Unchained Melody\" by the Goons]\n\nThat track became legendary because it didn't see a legal release for more than thirty years. The publishers of \"Unchained Melody\" wouldn't allow them to release such a desecration of such a serious, important, work of art, and it and its B-side weren't released until the late 1980s, although the record was widely discussed. It became something of a holy grail for fans of British comedy, and was only finally released at all because George Martin's old friend, and Goon fan, Paul McCartney ended up buying the publishing rights to \"Unchained Melody\". And because that single was left unreleased for more than thirty years, so was its B-side.\n\nThat B-side was... well... this...\n\n[excerpt, Peter Sellers and Spike Milligan \"Dance With Me Henry\"]\n\nWhether that's a more or less respectful cover version than Georgia Gibbs', I'll let you decide...\n\nOf course, in the context of a British music scene that was currently going through the skiffle craze, that version of \"Dance With Me Henry\" would have seemed almost normal.\n\nBack in the US, Richard Berry was back at work as a jobbing musician. He wrote one song, between sets at a gig, which he scribbled down on a napkin and didn't record for two years, but \"Louie Louie\" didn't seem like the kind of thing that would have any commercial success, so he stuck to recording more commercial material, like \"Yama Yama Pretty Mama\":\n\n[Excerpt: Richard Berry \"Yama Yama Pretty Mama\"]\n\nWe'll pick back up with Richard Berry in a couple of years' time, when people remember that song he wrote on the napkin.\n\nMeanwhile, Etta James continued with her own career. She recorded a follow-up to \"the Wallflower\", \"Hey Henry\", but that wasn't a hit, and was a definite case of diminishing returns:\n\n[excerpt: Etta James, \"Hey Henry\"]\n\nBut her third single, \"Good Rockin' Daddy\", was a top ten R&B hit, and showed she could have a successful career.\n\nBut after this, it would be five years before she had another hit, which didn't happen until 1960, when after signing with Chess Records she released a couple of hit duets with Harvey Fuqua, formerly of the Moonglows.\n\n[excerpt: Etta James and Harvey Fuqua, \"Spoonful\"]\n\nThose duets saw the start of an incredible run of hits on the R&B charts, including some of the greatest records ever made. While we're unlikely to be covering her more as the story goes on -- her work was increasingly on the borderline between blues and jazz, rather than being in the rock and roll style of her early recordings with Johnny Otis -- she had an incredible career as one of the greatest blues singers of her generation, and continued recording until shortly before her death in 2011. She died three days after Johnny Otis, the man who had discovered her all those decades earlier.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode twenty-two of A History of Rock Music in Five Hundred Songs. Today we're looking at \"The Wallflower\" by Etta James. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nAlso, remember I'm halfway through the Kickstarter for the first book based on this series.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI used a few books for this podcast, most of which I've mentioned before:\n\nHonkers & Shouters: The Golden Years of Rhythm and Blues by Arnold Shaw, one of the most important books on early 50s rhythm and blues\n\nHound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz.\n\nMidnight at the Barrelhouse: The Johnny Otis Story by George Lipsitz.\n\nThis collection of Etta James' early work has all the songs by her I excerpted here *except* \"The Wallflower\".\n\n\"The Wallflower\", though, can be found on this excellent and cheap 3-CD collection of Johnny Otis material, which also includes two other songs we've already covered, three more we will be covering, and a number which have been excerpted in this and other episodes.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nBefore I start, a quick content warning -- there's some mention of child abuse here. Nothing explicit, and not much, but it could cause some people to be upset, so I thought I'd mention it. If you're worried, there is, like always a full transcript of the episode at 500songs.com so you can read it as text if that might be less upsetting.\n\nWe've talked a little about answer songs before, when we were talking about \"Hound Dog\" and \"Bear Cat\", but we didn't really go into detail there. But answer songs were a regular thing in the 1950s, and responsible for some of the most well-known songs of the period. In the blues, for example, Muddy Waters' \"Mannish Boy\" is an answer song to Bo Diddley's \"I'm A Man\", partly mocking Diddley for being younger than Waters. But \"I'm A Man\" was, in itself, a response to Waters' \"Hoochie Coochie Man\".\n\nAnd, the \"Bear Cat\" debacle aside, this was an understood thing. It was no different to the old blues tradition of the floating lyric -- you'd do an answer song to a big hit, and hopefully get a little bit of money off its coattails, but because everyone did it, nobody complained about it being done to them. Especially since the answer songs never did better than the original. \"Bear Cat\" might have gone to number three, but \"Hound Dog\" went to number one, so where was the harm?\n\nBut there was one case where an answer song became so big that it started the career of a blues legend, had a film named after it, and was parodied across the Atlantic.\n\nThe story starts, just like so many of these stories do, with Johnny Otis. In 1953, Otis discovered a Detroit band called the Royals, who had recently changed their name from the Four Falcons to avoid confusion with another Detroit band, the Falcons -- this kind of confusion of names was common at the time, given the way every vocal group in the country seemed to be naming themselves after birds. Shortly after Otis discovered them, their lead singer was drafted, and Sonny Woods, one of the band's members, suggested that as a replacement they should consider Hank Ballard, a friend of his who worked on the same Ford assembly line as him. Ballard didn't become the lead singer straight away -- Charles Sutton moved to the lead vocal role at first, while Ballard took over Sutton's old backing vocal parts -- but he slowly became more important to the band's sound.\n\nBallard was an interesting singer in many ways -- particularly in his influences. While most R&B singers of this time wanted to be Clyde McPhatter or Wynonie Harris, Ballard was a massive fan of Gene Autry, the country and western singer who was hugely influential on Bill Haley and Les Paul. Despite",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode twenty-two of A History of Rock Music in Five Hundred Songs. Today we're looking at \"The Wallflower\" by Etta James. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nAlso, remember I'm halfway through the Kickstarter for the first book based on this series.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI used a few books for this podcast, most of which I've mentioned before:\n\nHonkers & Shouters: The Golden Years of Rhythm and Blues by Arnold Shaw, one of the most important books on early 50s rhythm and blues\n\nHound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz.\n\nMidnight at the Barrelhouse: The Johnny Otis Story by George Lipsitz.\n\nThis collection of Etta James' early work has all the songs by her I excerpted here *except* \"The Wallflower\".\n\n\"The Wallflower\", though, can be found on this excellen",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}