{
  "id": "https://bibleinoneyear.org/en/youth/217",
  "title": "Day 217: Perfected in Weakness",
  "description": "Psalm 91:1-5, 1 Chronicles 21:13, 1 Corinthians 1:18,20–29, 2:1–5.  There is also a bad side  In the passages for today we see both the good and the bad sides of weakness, fear and trembling",
  "pubDate": "Thu, 05 Aug 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/217/?ignore",
  "itunes:duration": "13:02",
  "guid": "enyouth05082021-217",
  "length": 782.86,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 217: Perfected in Weakness",
  "itunes:subtitle": "Psalm 91:1-5, 1 Chronicles 21:13, 1 Corinthians 1:18,20–29, 2:1–5.  There is also a bad side  In the passages for today we see both the good and the bad sides of weakness, fear and trembling",
  "itunes:summary": "I kept getting these phone calls. They came mostly from church leaders. They were from many different parts of the church. They were always long telephone conversations. They all wanted to know: ‘How come you get so many people from outside of the church on the course?’ ‘What exactly is Alpha?’ ‘How do you run it?’\nI thought perhaps the best solution was to get them together in one place and tell them all at the same time. As a result, we put on our first Alpha Conference in May 1993. To our astonishment a thousand church leaders turned up. I was relatively new to Christian ministry and was extremely daunted at the thought of a thousand church leaders, most of whom were far more experienced in ministry than I was.\nThe words of the apostle Paul, in today’s New Testament passage, seemed to sum up exactly how I felt. I read them to the delegates at the start of the conference:\nWhen I came to you, brothers and sisters, I did not come with eloquence or superior wisdom as I proclaimed to you the testimony about God. For I resolved to know nothing while I was with you except Jesus Christ and him crucified. I came to you in weakness and fear, and with much trembling. My message and my preaching were not with wise and persuasive words, but with a demonstration of the Spirit’s power, so that your faith might not rest on human wisdom, but on God’s power. (1 Corinthians 2:1–5)\nOver the years we have done hundreds of conferences. At every Alpha Conference I start by reading 1 Corinthians 2:1–5. It is always what I feel; I always feel nervous. There is always an element of ‘weakness and fear, and... much trembling’. But I thank God that it does not depend on wise and persuasive words but on a demonstration of the Spirit’s power. And God’s power is perfected in weakness (2 Corinthians 12:9).\nThere is a good side to ‘weakness’, ‘fear’ and ‘trembling’. There is also a bad side. In the passages for today we see both the good and the bad sides of weakness, fear and trembling.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 217
}