{
  "title": "Are robots taking our jobs?",
  "link": "https://audioboom.com/posts/7908429",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2960,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In the future, what forces will cause the economy to grow and stagnate? What impact will AI and automation have on the economy? Is capitalism a sustainable economic model?<br>\n<br>\n\n</div>\n<div>Today on The Sound of Economics, we're asking the big questions. In order to find answers, our own <a href=\"https://www.bruegel.org/author/giuseppe-porcaro/\">Giuseppe Porcaro</a> hosts <a href=\"https://www.bruegel.org/author/aaron-benanav/\">Aaron Benanav</a>, recent author of Automation and the Future of Work. Benanav argues that the \"rise of the robots\" may not really explain future employment crises, or our failure to move into a post-scarcity era.<br>\n<br>\n\n</div>\n<div>Meanwhile, Bruegel Research Fellow <a href=\"https://www.bruegel.org/author/laura-nurski/\">Laura Nurski</a> adds insight from her own research at Bruegel's <a href=\"https://www.bruegel.org/the-future-of-work-and-inclusive-growth-project/\">Future of work and inclusive growth</a> project, and <a href=\"https://www.bruegel.org/author/alexis-moraitis/\">Alexis Moraitis</a> at Lancaster University considers how advances in technology could impact the international political economy.<br>\n<br>\n\n</div>\n<div>If you want to learn more about the possible robot uprising, check out our work on <a href=\"https://www.bruegel.org/tag/AI/\">artificial intelligence in the workplace</a>, or listen to our past podcast, <a href=\"https://www.bruegel.org/2021/06/the-skills-of-the-future/\">The Skills of the Future</a>.</div>\n",
  "itunes:summary": "What will be the impact of automation on the economy? Bruegel's own Giuseppe Porcaro discusses with Aaron Benanav, Laura Nurski, and Alexis Moraitis.",
  "pubDate": "Tue, 20 Jul 2021 12:29:25 +0000",
  "guid": "tag:audioboom.com,2021-07-20:/posts/7908429",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}