{
  "title": "Payments Evolution from Paper to Electronic Payments  by Merchant Type",
  "link": "https://fedinprint.org/item/fedbwp/94224/original",
  "description": "The use of paper instruments—cash and checks—has been declining in the United States, and consumers have been gradually replacing paper with cards and electronic payments. Stavins (2021) examines the evolution of payments from paper to cards and electronic payments, while Shy (2020) shows the payments landscape across merchant types. This paper combines the cross-sectional analysis across merchants with the aggregate time series study to analyze the evolution of consumer payments by merchant type. Using data from a representative diary survey of US consumers collected annually over the past several years, we examine changes for each merchant type to assess which transactions shifted from paper to electronic payments and from in-person to remote transactions. We find that cash use declined faster than check use, in large part because transactions shifted from in person to remote. While the cash-use share of transactions dropped for almost all merchant types, changes in check use were much more heterogenous across merchants. COVID-19 accelerated the payments evolution away from cash for some merchant types, as their drop in cash payments was much larger during the pandemic than prior to it. Merchants whose transactions are typically conducted in person experienced the largest decline in cash payments during the pandemic. Regression results show that the probability of using either cash or checks declined significantly in 2019 and 2020, even after controlling for merchant types, the dollar value of transactions, and consumers’ socio-demographic attributes.",
  "guid": "https://fedinprint.org/item/fedbwp/94224/original",
  "dc:creator": "Shy, Oz; Stavins, Joanna; Cohen, Ruth",
  "dc:date": "2022-02-01",
  "rdau:hasExtent": 39,
  "dc:subject": "consumer payments; merchant category; cash; check; cards; electronic payments; COVID-19",
  "swpo:hasNumber": "22-6",
  "identifiers:doi": "10.29412/res.wp.2022.06",
  "bibo:series": "Working Papers"
}