{
  "title": "Summer of Data Science Goal-Setting",
  "link": "https://www.becomingadatascientist.com/2018/06/06/summer-of-data-science-goal-setting/",
  "pubDate": "Wed, 06 Jun 2018 06:14:49 +0000",
  "dc:creator": "Renee",
  "category": [
    "#SoDS",
    "resources",
    "#SODS18",
    "goal setting",
    "learning data science",
    "SMART goals",
    "summer of data science"
  ],
  "guid": "https://www.becomingadatascientist.com/?p=1559",
  "description": "The purpose of the Summer of Data Science is to learn a specific topic or complete a specific project or read a book or finish a course so you can check something off of your long data science “to learn” list, and have fun achieving goals along with other data science learners during a fixed period of time. The deadline should be motivating, to get you to start and finish something before the summer is over.\n\nWeek 1 was all about brainstorming ideas and gathering resources – dreaming up what you’d love to learn, and finding content that will help you learn it.\n\nWeek 2 (which started yesterday, but don’t worry, jump in any time even if you see this a month from now) is all about goal-setting.",
  "content:encoded": "<p>The purpose of the <a href=\"https://www.becomingadatascientist.com/2018/05/28/summer-of-data-science-2018-sods18-launch-day/\">Summer of Data Science</a> is to learn a specific topic or complete a project or read a book or finish a course so you can check something off of your long data science &#8220;to learn&#8221; list (get used to it being long, data scientists always have more to learn, so it never gets shorter!), and have fun achieving goals along with other data science learners during a fixed period of time. The deadline should be motivating, to get you to start and finish something before the summer is over.</p>\n<p>Week 1 was all about brainstorming ideas and gathering resources &#8211; dreaming up what you&#8217;d love to learn, and finding content that will help you learn it.</p>\n<p>Week 2 (which started yesterday, but don&#8217;t worry, jump in any time even if you see this blog post a month from now) is all about <strong>goal-setting</strong>.</p>\n<p>You should set a #SoDS18 goal that&#8217;s lofty enough to excite and motivate you, but not so out of reach that you&#8217;ll never complete it and only get disheartened when halfway through the summer you realize you are only 10% of the way there.</p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">Make sure to keep goals attainable! Last year my goals were too expansive and by week 4 there was zero chance of accomplishing all of them which was super demotivating <a href=\"https://t.co/uXiwUFNYU5\">https://t.co/uXiwUFNYU5</a></p>\n<p>&mdash; Nick Heitzman <img src=\"https://s.w.org/images/core/emoji/72x72/1f4ca.png\" alt=\"📊\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /><img src=\"https://s.w.org/images/core/emoji/72x72/1f4c8.png\" alt=\"📈\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> (@NickDoesData) <a href=\"https://twitter.com/NickDoesData/status/1001194480152776704?ref_src=twsrc%5Etfw\">May 28, 2018</a></p></blockquote>\n<p><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>I also want to make sure you know what makes a good goal. I like the definition used by the <a href=\"https://en.wikipedia.org/wiki/SMART_criteria\" target=\"_blank\">SMART</a> approach:</p>\n<blockquote><p>Your goal should be</p>\n<ul>\n<li><strong>S</strong>pecific</li>\n<li><strong>M</strong>easurable</li>\n<li><strong>A</strong>chievable</li>\n<li><strong>R</strong>elevant</li>\n<li><strong>T</strong>ime-Bound</li>\n</ul>\n</blockquote>\n<p>Instead of explaining each of these in detail (you can read more about it <a href=\"https://www.smartsheet.com/blog/essential-guide-writing-smart-goals\" target=\"_blank\">elsewhere on the internet</a>), I&#8217;m going to give an example of things you can jot down for yourself for each of these, then an example summary tweet for 2 different #SoDS18 goals.</p>\n<p>Let&#8217;s say the idea you had for what to learn this summer is <strong>&#8220;Start learning Python&#8221;</strong>, and the resource you found is <a href=\"https://www.dataquest.io\" rel=\"noopener\" target=\"_blank\">DataQuest</a>. Let&#8217;s turn that into a SMART goal:</p>\n<p><strong>Specific</strong> &#8211; Learn how to import, clean, and visualize data using python and pandas</p>\n<p><strong>Measurable</strong> &#8211; Complete all courses in the DatQuest <a href=\"https://www.dataquest.io/path/data-scientist/\" target=\"_blank\">Data Scientist Path</a></p>\n<p><strong>Achievable</strong> &#8211; I can spend at least 6 hours on this project every weekend, plus occasional weekday evenings, so I have enough time available to do the work [Note from Renee: I have not actually researched how long this course series would take to complete]. I have joined the #py4ds Slack community and will ask for help there and on DataQuest if I get stuck so I don&#8217;t get set far behind.</p>\n<p><strong>Relevant</strong> &#8211; I want to add python and pandas to my resume, and it&#8217;s my first step on my new path to becoming a data scientist, so it&#8217;s relevant to my career goals and I&#8217;m motivated to accomplish it.</p>\n<p><strong>Time-Bound</strong> &#8211; the Summer of Data Science ends on September 3, so I will finish this first goal by August 3 in order to have time to complete a small project during the last month of #SoDS18.</p>\n<p>Example tweet to share this goal with the world:</p>\n<blockquote><p>My 1st#SoDS18 goal: I will learn to import, clean, and visualize data with python & pandas by spending 6-8 hours per week on the Data Scientist Path on DataQuest, and will complete it by August 3. I&#8217;ll ask in #py4ds Slack if I need help.</p></blockquote>\n<p>Or, if your idea is to <strong>&#8220;do a machine learning project using at least 2 different algorithms on some kind of dataset that could help people&#8221;</strong>. That can be converted to a SMART goal like:</p>\n<p><strong>Specific</strong> &#8211; Learn how to use random forest and logistic regression in R by experimenting with data from the <a href=\"https://www.kaggle.com/donorschoose/io/data\" target=\"_blank\">Kaggle DonorsChoose.org Dataset</a> to develop a list of donors to email about a particular type of project request</p>\n<p><strong>Measurable</strong> &#8211; I will complete exploratory data analysis on the available DonorsChoose data files and write a blog post about my findings that includes at least 3 visualizations. Then I will find out what it means to submit a Kaggle Kernel, build 2 machine learning models using random forest and logistic regression algorithms and compare their model evaluation metrics to each other, submit the Kernel (even if the contest period is over), and find and study at least 2 other people&#8217;s submissions to understand different approaches to the problem. Then I will write another blog post summarizing my results and findings.</p>\n<p><strong>Achievable</strong> &#8211; I have read about random forest and logistic regression online, and my friend gave me the <a href=\"https://amzn.to/2JwjsDb\" target=\"_blank\">Introduction to Statistical Learning</a> book so I can better understand these machine learning algorithms. I have a bunch of resources bookmarked online in case I need extra references to understand the book. I will tweet using the #rstats hashtag or talk to my friend if I need help. If I find out the dataset I found isn&#8217;t great for learning these 2 algorithms, I will search for another dataset as needed. I can dedicate 2 hours a day 4 days per week to working on the project and researching these topics.</p>\n<p><strong>Relevant</strong> &#8211; I started learning R over the last year and have used it to complete labs at school, but want to expand my machine learning capabilities and apply my skills to a real-world dataset before I start applying for jobs in the fall.</p>\n<p><strong>Time-Bound</strong> &#8211; I have 12 weeks to complete the project this summer.</p>\n<p>Example tweet</p>\n<blockquote><p>My #SoDS18 goals are to:<br />\n-explore the DonorsChoose Kaggle dataset<br />\n-use ISL book & online resources to learn to build random forest and logistic regression models<br />\n-create and submit a Kaggle Kernel to help DonorsChoose<br />\n-write at least 2 blog posts about it over the next 12 weeks</p></blockquote>\n<p>I think you get the idea!</p>\n<p>I should also mention that you don&#8217;t want to over-plan. Notice the note about switching datasets if one doesn&#8217;t work out &#8211; plan to be flexible! You don&#8217;t yet know what you&#8217;re getting into, and you might need to find more time finding good resources to learn, getting help, or pivoting if your original plan doesn&#8217;t work out. That&#8217;s OK! Just go with the flow and try to achieve something comparable to your initial goal. But, you need an initial goal in order to figure out where you are relative to it!</p>\n<p>So, finish brainstorming your learning ideas and finding resources this week, then narrow it down to a SMART goal, and tweet about it with the #SoDS18 hashtag so we know what you plan to learn during the Summer of Data Science 2018!</p>\n<p>And if you&#8217;re still looking for project ideas, check out <a href=\"https://twitter.com/dataandme/status/1004176865618223104\" rel=\"noopener\" target=\"_blank\">Mara Averick&#8217;s post</a>, browse the <a href=\"https://twitter.com/search?f=tweets&#038;vertical=default&#038;q=%23SoDS18&#038;src=savs\" rel=\"noopener\" target=\"_blank\">#SoDS18 hashtag</a>, or join a data science learning community! (More about this in another blog post later this week!)</p>\n<p>&nbsp;</p>\n"
}