{
  "title": "Why I bought a NEW car",
  "link": "https://www.getrichslowly.org/my-miata/",
  "comments": "https://www.getrichslowly.org/my-miata/#comments",
  "dc:creator": "J.D. Roth",
  "pubDate": "Mon, 26 Sep 2022 12:00:38 +0000",
  "category": "Transportation",
  "guid": "https://www.getrichslowly.org/?p=244388",
  "description": "<p>I am 53 years old. Never in my life have I allowed myself to buy a car I truly love...until now. This is the story of how I allowed myself to make a <em>huge</em> purchase just for the joy of it. And it wasn't even a purchase I'd intended to make. Let me explain.</p>\n<p>During the peak of the pandemic (early July 2020), I paid $35,990 for a used 2019 Mini Countryman SE All4. The Countryman — which I call a \"Maxi Cooper\" — isn't a bad car, but I regretted buying it almost immediately. I'd intended to replace my 2004 Mini Cooper with a newer version of the same model, but allowed myself to be talked into a compact SUV.</p>\n<p>For two years, I drove the Maxi Cooper and tolerated it. It wasn't a bad car by any means, but it was a bad car for <em>me</em>. I'm not an SUV guy. I'm a small-car guy.</p>\n<p>Last month, I took the Maxi Cooper for an oil change. While I was waiting, the dealer offered to buy it back from me. I wasn't expecting that.</p>\n<p>As you probably know, the used-car market in the U.S. has been crazy for a couple of years. According to the U.S. Federal Reserve, <a href=\"https://fred.stlouisfed.org/series/CUSR0000SETA02\">prices on used vehicles are up <em>55%</em> since July 2020</a>. Prices for new vehicles have also increased during that time, <a href=\"https://fred.stlouisfed.org/series/CUUR0000SETA01\">but by only 18%</a>.</p>\n<p>Because I write about money, I'm aware that used-car prices are high, but I hadn't considered that <em>I</em> might sell the car I purchased only two years ago. I'm the sort of person who buys a car and keeps it for a decade or more. But when the Mini dealer told me they'd pay $33,000 for a car I'd bought 26 months earlier, I was intrigued.</p>\n<p>I contacted one of my buddies, a former car salesman. \"What am I missing here, Jeremy?\" I asked. \"This seems like a pretty good deal.\"</p>\n<p>\"It's not just a good deal,\" Jeremy said. \"It's a <em>miracle</em>. It's as if you leased that car for $115 per month. You should take the offer. Now. Before they change their mind.\"</p>\n<blockquote class=\"highlight\"><p>\nBefore you read my story, you might want to read this similar story from Liz at Frugalwoods: <a href=\"https://www.frugalwoods.com/2022/08/30/why-we-bought-a-new-car/\"><strong>Why we bought a NEW car.</strong></a> Here's a relevant excerpt:</p>\n<p>\"In normal economic times – or rather, in past economic times – used cars were remarkably cheaper than new cars, which made the depreciation on new cars astronomical. In other words, new cars would lose a tremendous amount of their value as soon as they were no longer new.</p>\n<p>\"Used cars, on the other hand, had a much more gradual depreciation curve, which meant you could buy a used car for a reasonable price and then, if needed, re-sell that used car at a reasonable loss. Currently, thanks to supply chain issues, a shortage of computer chips and inflation, used cars are no longer a deal.\"\n</p></blockquote>\n",
  "content:encoded": "<p>I am 53 years old. Never in my life have I allowed myself to buy a car I truly love&#8230;until now. This is the story of how I allowed myself to make a <em>huge</em> purchase just for the joy of it. And it wasn't even a purchase I'd intended to make. Let me explain.</p>\n<p>During the peak of the pandemic (early July 2020), I paid $35,990 for a used 2019 Mini Countryman SE All4. The Countryman — which I call a &#8220;Maxi Cooper&#8221; — isn't a bad car, but I regretted buying it almost immediately. I'd intended to replace my 2004 Mini Cooper with a newer version of the same model, but allowed myself to be talked into a compact SUV.</p>\n<p>For two years, I drove the Maxi Cooper and tolerated it. It wasn't a bad car by any means, but it was a bad car for <em>me</em>. I'm not an SUV guy. I'm a small-car guy.</p>\n<p>Last month, I took the Maxi Cooper for an oil change. While I was waiting, the dealer offered to buy it back from me. I wasn't expecting that.</p>\n<p>As you probably know, the used-car market in the U.S. has been crazy for a couple of years. According to the U.S. Federal Reserve, <a href=\"https://fred.stlouisfed.org/series/CUSR0000SETA02\" rel=\"noopener\">prices on used vehicles are up <em>55%</em> since July 2020</a>. Prices for new vehicles have also increased during that time, <a href=\"https://fred.stlouisfed.org/series/CUUR0000SETA01\" rel=\"noopener\">but by only 18%</a>.</p>\n<p>Because I write about money, I'm aware that used-car prices are high, but I hadn't considered that <em>I</em> might sell the car I purchased only two years ago. I'm the sort of person who buys a car and keeps it for a decade or more. But when the Mini dealer told me they'd pay $33,000 for a car I'd bought 26 months earlier, I was intrigued.</p>\n<p>I contacted one of my buddies, a former car salesman. &#8220;What am I missing here, Jeremy?&#8221; I asked. &#8220;This seems like a pretty good deal.&#8221;</p>\n<p>&#8220;It's not just a good deal,&#8221; Jeremy said. &#8220;It's a <em>miracle</em>. It's as if you leased that car for $115 per month. You should take the offer. Now. Before they change their mind.&#8221;</p>\n<blockquote class=\"highlight\"><p>\nBefore you read my story, you might want to read this similar story from Liz at Frugalwoods: <a href=\"https://www.frugalwoods.com/2022/08/30/why-we-bought-a-new-car/\" rel=\"noopener\"><strong>Why we bought a NEW car.</strong></a> Here's a relevant excerpt:</p>\n<p>&#8220;In normal economic times – or rather, in past economic times – used cars were remarkably cheaper than new cars, which made the depreciation on new cars astronomical. In other words, new cars would lose a tremendous amount of their value as soon as they were no longer new.</p>\n<p>&#8220;Used cars, on the other hand, had a much more gradual depreciation curve, which meant you could buy a used car for a reasonable price and then, if needed, re-sell that used car at a reasonable loss. Currently, thanks to supply chain issues, a shortage of computer chips and inflation, used cars are no longer a deal.&#8221;\n</p></blockquote>\n<p><span id=\"more-244388\"></span></p>\n<h2>Unprepared to Purchase</h2>\n<p>After the Mini dealer offered to buy my vehicle, I immersed myself in car information. As I did, I made myself a promise: For the first (and perhaps only) time in my life, I was going to buy a model I wanted <em>without</em> making compromises.</p>\n<p>You see, every car I've ever owned has involved some sort of sacrifice. When I was young, the chief compromise was cost. I couldn't afford more expensive vehicles, so my options were limited. In more recent years, I've compromised by buying used. Then by purchasing a compact SUV instead of a sports car. And so on.</p>\n<p>This time, I didn't want to compromise. I wanted to buy <em>exactly</em> the car I wanted. But which car would that be?</p>\n<p>Because I hadn't intended to get rid of my Maxi Cooper, I'd done zero thinking about what kind of car I might buy to replace it. Normally, people figure out what kind of car they want before selling their old one. I was doing things in reverse. I was applying my <a href=\"https://www.getrichslowly.org/self-centered-shopping/\">self-centered shopping</a> strategy to buying a car!</p>\n<p>For a time, I considered <em>not</em> replacing the car at all. I still own a 1993 Toyota pickup. It's ugly, but it works. Plus, Corvallis is a small city with excellent infrastructure for alternative transportation. I walk 20+ miles per week through town and would happily walk more. This summer, I've been biking for longer errands too. Going car-free was certainly an option I considered, as was buying another 2004 Mini Cooper. Ultimately, though, I decided to use this opportunity to upgrade to a some sort of new car.</p>\n<p>Before we go any farther, it's important to note a few things about my relationship with automobiles.</p>\n<ul>\n<li>I'm not a car guy. I'm not a motorhead. I don't obsess over cars and I never have. I do like certain cars, but I'm not normally somebody who buys car magazines or watches car videos.</li>\n<li>I believe that used cars are almost always the smart financial choice.</li>\n<li>I'm in favor of electric cars but think the technology is young, so I'm reluctant to buy in wholly. That said, I made my car search electric-first.</li>\n<li>I like sports cars. I'm not a speed demon, and I don't need a car to have a high top speed. But I like the styling of sports cars, and I like that they're &#8220;zippy&#8221; — they have good acceleration and good handling.</li>\n<li>My #1 source for car info — by far — is <em>Consumer Reports</em> magazine.</li>\n<li>Most of all, I believe in small cars. I always have. I do not undertand the American obsession with large vehicles. It makes zero sense to me. When I rent cars in Europe, I'm always pleased with how many small cars are on the road. They're almost <em>all</em> small cars.</li>\n</ul>\n<p>My ideal car remains a 2004 Mini Cooper — but with modern technology updates to bring it into the world of 2022. Unfortunately, that car doesn't exist. Modern Minis are larger than they were twenty years ago. Worse, their customer satisfaction scores have eroded. (I also like the <a href=\"https://en.wikipedia.org/wiki/Audi_A1\" rel=\"noopener\">Audi A1</a>, but it's not available in the U.S.)</p>\n<h2>A Very Short Search</h2>\n<p>I spent an intense 24 hours researching my options. As I read about cars, I created a list of requirements for my next vehicle.  I had a handful of criteria, most of which you can probably guess based on my comments above.</p>\n<ul>\n<li>First, the car had to be small. This limited me to compacts, subcompacts, and sports cars.</li>\n<li>Second, the car had to be fuel efficient. Electric would be nice, but it wasn't a requirement.</li>\n<li>Third, the car had to be <em>fun</em>. It didn't have to be fast, but it had to be zippy. It had to handle well.</li>\n<li>Fourth, <em>Consumer Reports</em> had to love it. The car had to get a high reliability rating from the organization, as well as a high road score and a high overall score.</li>\n<li>Fifth, it had to be a car that customers loved. I made the mistake once of purchasing a Ford Focus. <em>Consumer Reports</em> loved the Focus but owners hated it. So did I. It was the most un-fun car I've ever owned — like a storage container on wheels.</li>\n<li>Sixth, it had to have a manual transmission. I don't like driving automatics.</li>\n</ul>\n<p>Early in my research, I discovered the <a href=\"https://www.consumerreports.org/car-finder/\" rel=\"noopener\"><em>Consumer Reports</em> car finder</a> tool. This three-question quiz (which is only available to subscribers) proved helpful.</p>\n<p><a href=\"https://www.consumerreports.org/car-finder/\" rel=\"noopener\"><img loading=\"lazy\" src=\"https://www.getrichslowly.org/wp-content/uploads/cr-car-search-scaled.jpg\" width=\"800\" height=\"978\" class=\"aligncenter green-border\" alt=\"[search results from Consumer Reports] title=\"search results from Consumer Reports\" /></a></p>\n<p>According to this tool, the five cars best suited to my needs were the Kia Niro Electric, the Ford Mustang Mach-E, the Mazda Miata, the Tesla Model 3, and the Hyundai Ioniq 5.</p>\n<p>Although I was tempted, I ruled out the Tesla because (a) it's too expensive and (b) it has mediocre reliability. I eliminated the Kia and Hyundai because they didn't earn top owner satisfaction marks. And the electric Mustang isn't actually a sedan; like my Maxi Cooper, it's an SUV. (I'm not sure why <em>Consumer Reports</em> recommended SUVs to me when I deliberately left them out of my search parameters.) That left one car: the Mazda Miata.</p>\n<p>Here's the thing: I've always been drawn to Miatas. I like how they look. They're consistently highly-rated by both customers and professional reviewers alike. And they check all of the same boxes for me that the Mini Cooper does.</p>\n<p>The Miata quickly soared to the top of my very short list. Also on that list were the Mini Cooper (which I still love despite its drawbacks) and the more-practical Subaru Outback (which is the unofficial state car of Oregon).</p>\n<p>Here are comparison pages from <em>Consumer Reports</em> and Kelly Blue Book:</p>\n<p><img src=\"https://www.getrichslowly.org/wp-content/uploads/cr-compare.jpg\" widthh=\"800\" height=\"380\" class=\"aligncenter green-border\" alt=\"[Consumer Reports car comparisons] title=\"Consumer Reports car comparisons\" /></p>\n<p><img loading=\"lazy\" src=\"https://www.getrichslowly.org/wp-content/uploads/kbb-compare.jpg\" width=\"800\" height=\"633\" class=\"aligncenter green-border\" alt=\"[Kelly Blue Book car comparison]\" title=\"Kelly Blue Book car comparison\" /></p>\n<p>Looking at those stats, I think you can see why the Miata quickly became the only car I was seriously considering. The car's only major downside was a middling road score. Reading <a href=\"https://www.consumerreports.org/cars/mazda/mx-5-miata/2022/road-test-report/?pagestop\" rel=\"noopener\">the <em>Consumer Reports</em> review,</a> I recognized that the <em>reasons</em> for this low road score — road noise and lack of space — didn't bother me.</p>\n<blockquote><p>\nThe MX-5's sparkling combination of nimble fun and thriftiness has made it a favorite at our test track — and the current model holds to the standard.</p>\n<p>The Miata is a completely impractical car. It seats two (tightly), it will barely haul a load of groceries, and it's loud inside. Yet we're smitten with this plucky ragtop.</p>\n<p>There isn't a better fun-per-dollar performance car on the market that delivers the Miata's magic. After a long winter's nap, the MX-5 will revive your senses the first spring day you drop the top and hit the curvy roads.</p>\n<p>This Mazda is one of the last intimate driving experiences; you feel like part of the machine that's melding with the road. The Miata's steering gives immediate turn-in response, and the car remains playful and predictable even when pressing the limits of the tires.\n</p></blockquote>\n<p>I stopped looking at other models and began trying to find reasons <em>not</em> to buy a Miata. I couldn't find any.</p>\n<ul>\n<li><a href=\"https://www.consumerreports.org/cars/mazda/mx-5-miata/2022/road-test-report/?pagestop\" rel=\"noopener\"><em>Consumer Reports</em> likes the Miata.</a></li>\n<li><a href=\"https://www.edmunds.com/mazda/mx-5-miata/\" rel=\"noopener\">Edmunds likes the Miata.</a></li>\n<li><a href=\"https://www.motortrend.com/cars/mazda/miata/2022/\" rel=\"noopener\"><em>Motor Trend</em> likes the Miata.</a></li>\n</ul>\n<p>The Miata reviews on YouTube all reinforced what the written articles had said. But it was <a href=\"https://www.youtube.com/watch?v=iGXFdQJcIb4\" rel=\"noopener\">this review</a> from a car-care channel that made me decide at last that the Miata was the car I wanted: &#8220;It'll bring joy to your heart every time you drive it.&#8221;</p>\n<p class=\"youtube\"><iframe loading=\"lazy\" class=\"aligncenter\" src=\"https://www.youtube.com/embed/iGXFdQJcIb4?rel=0\" width=\"100%\" height=\"150\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<h2>Buying My Miata</h2>\n<p>Buying a car is a big decision, and I'm not accustomed to jumping into things like this. I take my time. I ruminate. I consider every angle. That's not what I did this time. On the last Thursday in August, I drove to Salem to visit the nearest Mazda dealer.</p>\n<p>I'd called the salesman in advance, so he had a Miata ready to drive. Before we left the parking lot (after driving only fifty feet), I knew that I was going to buy a Miata — <em>if</em> I could get $33,000 for my Maxi Cooper. For the sake of show, I drove five miles around Salem streets while making pleasant conversation with the salesman. I explained that I hadn't intended to buy a new car, but that the Mini dealer had made me an offer I couldn't refuse. Would he be willing to match the offer? &#8220;Maybe,&#8221; he said.</p>\n<p>When we returned to the dealership, I gave the salesman the file of paperwork for my Maxi Cooper — including the written offer the Mini dealer had made me the day before. He took the info to his boss. Ten minutes later, he came back with some good news. &#8220;We'll match their offer,&#8221; he said.</p>\n<p>&#8220;Great,&#8221; I said. I pulled out another piece of paper, a printout from the dealership's website. &#8220;This is the car I want. It's a gray hardtop. But your website says the vehicle is in transit.&#8221;</p>\n<p><img loading=\"lazy\" src=\"https://www.getrichslowly.org/wp-content/uploads/my-miata-scaled.jpg\" width=\"800\" height=\"420\" class=\"aligncenter green-border\" alt=\"[listing for the Miata I wanted] title=\"listing for the Miata I wanted\" /></p>\n<p>This was the only time during the entire process that the salesman balked. &#8220;What can I do to send you home with a car <em>today</em>?&#8221; he said. He pulled out a piece of paper and <a href=\"https://www.consumerreports.org/consumerist/dealerships-rip-you-off-with-the-four-square-heres-how-to-beat-it/\" rel=\"noopener\">started with the four-square</a>.</p>\n<p>&#8220;Well, I'm not going home with a car today,&#8221; I said. &#8220;You don't have a car that I want. This is the car I want,&#8221; I said as I pointed to my printout. The dealership had five Miatas on the lot, but none in the precise configuration I wanted. They were red or automatic transmission or soft-top — or all of the above. I wanted gray, manual transmission, and hard-top. (<em>All</em> Miatas are convertible.)</p>\n<p>The salesman nodded. &#8220;No problem,&#8221; he said. We talked briefly about price but the dealership was unwilling to budge from the $39,245 listed on the website (including a mandatory $1995 markup due to the current car market). I was fine with that. We shook hands and reached a tentative agreement but signed no paperwork. He'd call me when my car came in.</p>\n<h2>My Miata</h2>\n<p>As I drove home, I thought about the numbers. To an old guy like me, $40,000 seems like a <em>lot</em> to pay for a car. Even $20,000 seems like a lot to pay for a car. I asked myself if I might not be just as happy in, say, a Chevy Spark? But I knew that wouldn't be the case. As I said earlier, I've compromised on cars my entire life. This once, I wanted to indulge myself.</p>\n<p>I realized that the fundamental question I needed to answer was this: <strong>Would I rather have (a) the 2019 Maxi Cooper and $7000 <em>-or-</em> (b) a brand-new 2022 Mazda Miata?</strong> Thinking about it from this perspective, the answer was easy. I'd choose the Miata every single time!</p>\n<p>But maybe I was thinking crazy? Maybe I was being too emotional? (I'm under no delusion that this decision was logical. It was emotional. I'm okay with that. I just didn't want to make a decision that was so emotional that it crossed over to stupid.)</p>\n<p>To double-check, I sought the counsel of two people I trust. First, I asked my buddy Jeff (<a href=\"https://thehappyphilosopher.com\" rel=\"noopener\">The Happy Philosopher</a>) what he thought. &#8220;Do it!&#8221; he said. Then I asked my girlfriend, Kim. I was worried that she'd object. She didn't object it. &#8220;You should absolutely do it,&#8221; she said. And so I did it. I bought the Miata.</p>\n<p>The Mazda salesman called me on the last day of the August. &#8220;Your Miata arrived this morning,&#8221; he said. &#8220;If you'd like, we can do the deal today.&#8221; I stopped what I was doing, drove to Salem, and bought a new car.</p>\n<p><img loading=\"lazy\" src=\"https://www.getrichslowly.org/wp-content/uploads/jdmiata.jpeg\" width=\"800\" height=\"450\" class=\"aligncenter\" alt=\"[Standing next to my new Miata]\" title=\"Standing next to my new Miata\" /></p>\n<p>My new Miata was <em>so</em> new that it had only five miles on the odometer. &#8220;I've been doing this for thirty years,&#8221; the finance guy told me as I was signing papers. &#8220;I think that's the lowest number I've ever seen on an odometer.&#8221;</p>\n<p>I took the long way home, driving from Salem to Corvallis on winding riverside roads, then through rolling hills and farmland. The top was down. The sun warmed my skin as the wind blew through my hair. Taylor Swift crooned &#8220;Welcome to New York&#8221; on the stereo. I smiled, inside and out. The Miata indeed brought joy to my heart.</p>\n<p>In June, I wrote that <a href=\"https://www.getrichslowly.org/growing-up-poor/\">growing up poor</a> messed with my mind, still makes me feel guilty for buying Nice Things. The Miata is unquestionably a Nice Thing. I don't feel guilty about buying the Miata. </p>\n<p>When I think of the choice I made, I'm reminded of Ramit Sethi's admonition that <a href=\"https://www.youtube.com/watch?v=ZjT2_8CsGXE\" rel=\"noopener\">money should be used to build a rich life</a>. This car is a part of <em>my</em> rich life.</p>\n<div id=\"mediavine-settings\" data-blacklist-content-desktop=\"1\" data-blacklist-content-mobile=\"1\"></div>\n",
  "wfw:commentRss": "https://www.getrichslowly.org/my-miata/feed/",
  "slash:comments": 28,
  "media:content": {
    "media:player": "",
    "media:title": "Should you buy a Mazda MX-5? Does the Miata Still Has The Magic of The Original?",
    "media:description": "Does the Mazda Miata Still Has the Magic of the Original? Should you buy a Mazda MX-5 in 2022? In this video we&#039;ll do a full review of the 2022 Mazda MX-5 RF...",
    "media:thumbnail": "",
    "media:rating": "nonadult"
  }
}