{
  "guid": "https://podcasts.nationalreview.com/?p=2947",
  "title": "Episode 33: Kevin Madden / Wilco",
  "description": "<p>Scot and Jeff talk to Kevin Madden about Wilco.</p>\n<p><span><strong>Introducing the Band<br />\n</strong></span>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\">@EsotericCD</a>) with guest Kevin Madden, Republican strategist, CNN Commentator and former advisor to President George W. Bush, Gov. Mitt Romney, Republican House Leaders John Boehner and Tom DeLay.” Follow Kevin on Twitter at <a href=\"https://twitter.com/KevinMaddenDC\">@KevinMaddenDC</a>.</p>\n<p><strong><span>Kevin’s Music Pick: Wilco<br />\n</span></strong>This week the gang gets a shot in the arm as they celebrate Wilco, one of the great genre-transcending American groups of the past quarter century. This is a band that had a cult and critical following long before they emerged into wider prominence in the 21st century, and co-host Scot was there from the start: Wilco is one of the bands nearest and dearest to him in his entire life. Kevin tells the story of sitting in Yonkers city hall during his years as an aide to the city council president and having his head turned around by hearing a song on the radio: “California Stars,” which set him on the path to lifelong fandom. Jeff tells a more familiar story for many, one of finding Wilco due to the hype surrounding <i>Yankee Hotel Foxtrot</i> and being mildly perplexed at first until the eventual discovery of <i>Summerteeth</i> clicked everything into place for him.</p>\n<p><b><span>Too Far Apart: Uncle Tupelo and the origins of Wilco</span><br />\n</b>As much as the gang would have loved to, there just wasn’t any time to seriously discuss Uncle Tupelo, the groundbreaking band from southern Illinois led by Jay Farrar that formed in 1989 and ended up defining the entire subgenre of alt-country. Instead, Scot gives a brief rundown of their career and points out that by far the more important thing, as far as the present episode is concerned, is that Uncle Tupelo <i>also</i> happened to contain a second key member in the quiet, retiring bassist Jeff Tweedy, who began writing more and more songs as the band’s career progressed. This led to incurable friction with Farrar, and when Tupelo eventually collapsed and Farrar quit, Tweedy took the rest of the band with him and renamed it Wilco. Farrar began a new band named Son Volt, and for the next two records, a ‘battle of the bands’ (as Kevin calls it) was on between Son Volt and Wilco.</p>\n<p>The overwhelming critical consensus is that Farrar won round one in a knock-out with Son Volt’s magnificent debut <i>Trace; </i>Wilco’s 1995 debut <i>A.M.</i> was seen by most as an afterthought — a middling continuation of the Uncle Tupelo sound — and proof that the real magic in the band came from Jay Farrar. In retrospect we now know that not to be the case, but the gang argues that <i>A.M.</i> is itself an underrated record in its own right, far too quickly dismissed by critics and fans (and even the band) for failing to advance much on Uncle Tupelo’s original sound. Scot and Kevin praise the guitarwork of Brian Henneman (on temporary loan from the Bottle Rockets) in particular, and note that the embryonic “Tweedy style” of lyrical introversion is found in so many of the highlights of this record, like “Box Full Of Letters” and “Should’ve Been In Love.”</p>\n<p><b><span>Misunderstood: Jay Bennett and </span><i><span>Being There</span><br />\n</i></b>All talk of Wilco as an also-ran in the alt-country scene immediately ended with their second album, 1996’s sprawling 2CD masterpiece <i>Being There</i>. And yet with this record Tweedy was already declaring, on songs such as “Misunderstood” and “Sunken Treasure” (which, as Jeff notes, tellingly open disc 1 and disc 2 respectively), that Wilco was not content to be a mere alt-country act anymore. The impetus behind this shift was Tweedy’s for sure–all of the songs on this LP are solo songwriting credits–but a major reason for the success of Wilco’s sudden musical complexity must be laid at the feet of their newest member, Jay Bennett. Originally hired to be the band’s lead guitarist, Bennett immediately revealed a passion for piano and keyboards and used his skill with them to bathe nearly every song on <i>Being There</i> with graceful and haunting coloristic touches. From “Red-Eyed And Blue” (which Jeff is passionate about) to “Outta Mind (Outta Site)” (which sounds more like a Beach Boys Christmas album outtake than anything else), Bennett’s impact as a performer and an arranger are instantly felt, and his creative contributions to the band would rapidly rise to the level of a near-even collaboration with Tweedy on subsequent records. All three of the gang are effusive in their praise of <i>Being There</i>, a record which finds Wilco stepping into a much larger world of art-rock while still keeping its feet solidly in the world of country balladry and sprightly rockers that had been the Uncle Tupelo calling card. What impresses even more than the variety of this record is its consistency: as a double album with 18 songs, it should drag and yet there few if any perceptible weak spots.</p>\n<p><span><b>A Shot in the Arm: <i>Mermaid Avenue</i> and <i>Summerteeth<br />\n</i></b></span>On tour, Wilco ran into venerable UK political guitar-folkie Billy Bragg and predictably hit it off. Thus, when Bragg was approached by Woody Guthrie’s daughter with the opportunity to work with a huge tranche of Woody’s unpublished lyrics and write new music to it, he decided to recruit Wilco to collaborate with him and bring American roots authenticity to the project. The result was an unalloyed triumph: the gang argues that two volumes of <i>Mermaid Avenue</i> are no mere side-project (though neither Scot nor Jeff have much time for the Billy Bragg material on these two discs), but a key part of Wilco’s discography and the connective material that bridges the gap both between <i>Being There</i> and <i>Summerteeth</i> (in the case of <i>Vol. 1</i>) and <i>Summerteeth</i> and <i>Yankee Hotel Foxtrot</i> (in the case of <i>Vol. 2</i>). Jeff argues that Tweedy and Bennett were liberated by having such eloquent texts to craft music around, and that the result are songs that often times feel ‘more Wilco than Wilco’, particularly on gems like “California Stars” (again, one of Kevin’s favorites), “At My Window Sad And Lonely,” “One By One,” “Airline To Heaven,” and the epic “Remember The Mountain Bed.” At the time of its release, <i>Mermaid Avenue</i> was celebrated by critics as a stunning reassessment and recontextualization of Woody Guthrie’s art; in retrospect, it is also obvious that it is a key link in the chain demonstrating the process by which Tweedy and Bennett were reassessing and recontextualizing their own music with Wilco.</p>\n<p>The results of that reassessment are, by universal agreement between Jeff, Scot, and Kevin, the true masterpiece of Wilco’s career, the glorious <i>Summerteeth</i> (1999). Fans whose last checkpoint for Wilco was (the wonderful, but still largely rooted in well-worn alt-country sounds) <i>Being There</i> must have been completely shocked by the mutagenic growth on display with <i>Summerteeth</i>, a sonically complex, glossy, almost summery-sounding album of art-rock, art-pop, and weirdly crabbed balladry. Scot gets emotional talking about this album, as it is a part of the fabric of his young life – he remembers the first time he heard and spun “I’m Always In Love” on his college radio station, blown away by the complete shift in style after <i>Being There</i>. Jeff is fascinated by the contrast between the vibrantly arranged and produced music (he affectionately calls it the “Jay Bennett goofy synthesizer album”) and the naggingly recurrent darkness of the lyrics: Tweedy is singing about death, doubt, inability to communicate, dashed hopes, the frustration of unrequited faith, and broken relationships, but you would have to listen very carefully to find that in, say, the ethereally pure beauty of “A Shot In The Arm,” which may just be the greatest song of their career. The gang spends a full twenty minutes rhapsodizing about <i>Summerteeth</i>, from “Can’t Stand It” all the way to “Candyfloss,” and all we can say to you is: <u>please listen to this album</u>.</p>\n<p><span><b>The Late Greats: From <i>Yankee Hotel Foxtrot </i>to <i>A Ghost Is Born</i></b></span><b><i><span> </span><br />\n</i></b>This brings the gang to the great white whale of the Wilco discography, <i>Yankee Hotel Foxtrot</i> (2001). As Wilco’s most famous and widely-praised album, and a record with not one but <i>two</i> compelling narratives surrounding it, its place in the critical firmament of 21st-century rock is fixed. Nevertheless, Scot, Kevin and Jeff are all in agreement that <i>YHF</i> is at least somewhat overrated, and none of them rate it as the band’s best work (they are unanimous in choosing <i>Summerteeth</i> instead). Jeff is the most direct in his critique, arguing that this record and the next witness Jeff Tweedy at his (intentionally, one presumes) slackest in terms of vocal approach and commitment to melody. Even on the nominally uptempo numbers on this record, Tweedy’s singing is slack, seemingly stoned, and delivered with a whispery flat affect that betrays hints of deeper demons underneath the surface. Meanwhile much of the music (e.g. “I Am Trying To Break Your Heart,” “Radio Cure,” “I’m The Man Who Loves You”) relies far more on the interest of their backing tracks–specifically the tape loops and various percussive cacophonies that wind in and out of the songs–than they do on the melodic interest of the writing.</p>\n<p>That said, these criticisms feel small compared to the breathtaking scope of <i>Yankee Hotel Foxtrot</i>, an album as purely consistent in tone and mood as any in Wilco’s career. Kevin cites to “Ashes Of American Flags” in particular as representative of the whole of <i>YHF</i>: a ghostly, almost evanescent melody (Jeff isn’t even quite sure it’s a ‘song’ per se), a descent into noisy chaos at the end of the track, but an overall atmosphere of aching beauty and grandeur. Jeff prefers the more lyrically direct material like the wistfully nostalgic “Heavy Metal Drummer” and the lyrical “Poor Places,” while Scot declares that “Pot Kettle Black” is the album’s masterpiece and dares all comers to fight him on the matter.</p>\n<p>It’s impossible to discuss <i>YHF</i> without discussing the documentary <i>I Am Trying To Break Your Heart</i>, filmed during these sessions. It caught the band in the midst of twin crises. First up was their record-label disaster: at work on what would become the band’s universally-acknowledged masterpiece, Wilco found the final product rejected by their label Reprise, and dropped as recording artists. (The resulting outrage from critics, who had been given copies of <i>YHF </i>by the band’s manager, created a huge backlash and secured them a new deal with a different label in short order…and also generated enough buzz to make the record Wilco’s first real chart success.) More importantly, the cameras documented the painful dissolution of the relationship between Jeff Tweedy and Jay Bennett; Bennett was a full participant in the sessions and co-wrote most of the album’s songs, but would be fired by Tweedy immediately afterwards, and the film captures their ongoing communication breakdown in a particularly poignant way. Scot insists that when Jay Bennett left Wilco he took a certain amount of their special magic with him, but Jeff isn’t quite so sure…he thinks Tweedy was being driven by different demons during this era.</p>\n<p>Just exactly what that was became painfully apparent by the time of 2004’s <i>A Ghost Is Born</i>: the record’s release was delayed at the last second because Tweedy needed to check into rehab to rid himself of an addiction to prescription painkillers acquired over the last several years of self-medicating to ward off panic attacks, migraines, and clinical depression. <i>A Ghost Is Born</i> is the sound of that exhaustion, and while Scot disdains it, Jeff rates it highly, seeing in its exhausted and paranoid tones and outre experiments the last truly fearlessly experimental record of Wilco’s career. Sure, nobody needs to hear the hopelessly misbegotten “Less Than You Think” (a middling folk song married to 12 minutes of boring tuneless noise serving no worthy end), but drug-exhausted chance-taking pays off wildly elsewhere on songs like “At Least That’s What You Said”–whose “clever song + guitar freakout” format would establish a template Tweedy carried forward on the rest of their career–and the singular “Spiders (Kidsmoke),” an out-of-nowhere tribute to Krautrock (the specific reference points are Kraftwerk and especially Neu!) that sees Wilco pushing out into genres they had never before even hinted at attempting and succeeding wildly.</p>\n<p>P.S. None of us can really figure out what “Muzzle Of Bees” is supposed to be about either. You are not alone.</p>\n<p><span><b>On And On And On: From <i>Sky Blue Sky</i> to <i>Schmilco</i>, and the Present Day<br />\n</b></span>Jeff Tweedy’s post-rehab career with Wilco encompasses a full five albums — fully half of their studio discography — so it may seem presumptuous to place all of these under the same heading. And yet, on another level the grouping feels correct: the healthy, happy, sober Jeff Tweedy made music with Wilco that felt fundamentally different from the more tortured, crabbed music of their career up to <i>A Ghost Is Born</i>. Wilco loses a significant amount of their weirdness and settles into a series of well-written, well-produced albums full of quirky tunes and impressive guitar solos that nevertheless lack the same sense of danger as their early career (this is, not without reason, sometimes referred to by critics as the “dad-rock” phase of Wilco’s career). Dad-rock or not, Kevin insists on the quality of 2006’s <i>Sky Blue Sky </i>(the first record released by the stable present-day lineup of Wilco) and rates it among their finest work. Scot likes this record a lot more than he thought he did back in the day, and cites “Side With The Seeds” in particular as a standout, while Jeff goes with the haunting album closer “On And On And On,” an immensely moving song about mortality.</p>\n<p>With “Wilco (the song)” off of <i>Wilco </i>(2009) the band unexpectedly scores a rock ‘trifecta’ (album/song/band all of the same name, e.g. Bad Company or Talk Talk), but aside from the title track (which Kevin notes is a perniciously listenable earworm), the gang agrees that this is a much more unfocused record than the previous one. Still, this song is as professional and assuredly listenable as all of Wilco’s late period records, with highlights like “One Wing” (Jeff’s pick), “You And I” (Kevin’s favorite) and the disguised Civil War tale of “I’ll Fight” (Scot’s favorite, and one of his five favorite Wilco songs ever). Unfortunately, <i>The Whole Love</i> (2011) is as close as Wilco comes to sounding generic in their career, with only “Art Of Almost” standing out. (Jeff damns it thus: “Very professional. Very tasteful. Very likable. <i>Dad-rock</i>.”)</p>\n<p>That leads us to the present day and the one-two punch of <i>Star Wars</i> (2015) and <i>Schmilco</i> (2016), which were recorded at the same sessions and then divided after the fact into two very different sounding albums: <i>Star Wars</i> (yes, Tweedy named it after one of the most famous movies of all time–for absolutely no reason whatsoever–and then put a painting of a cat on the cover), released for free online as a surprise record, is by gang consensus the better of the two, a left turn into harder rock sounds than either the sedate <i>The Whole Love</i> or the unrepentantly folky <i>Schmilco. </i>Scot likes <i>Star Wars</i> quite a bit (its tightness brevity is a real plus), in particular the groove of “Random Name Generator” and “Taste The Ceiling.” Jeff and Kevin both agree (Kevin shouts out to “You Satellite”), and all are agreed that the soft <i>Schmilco</i> is the weaker half of these sessions, barely rising above a whisper (though “Cry All Day” is a fine song).</p>\n<p><b><span>Finale</span><br />\n</b>Kevin, Scot, and Jeff each name their two key albums and five key songs by Wilco.</p>\n",
  "pubDate": "Mon, 7 May 2018 14:00:14 +0000",
  "author": "studio@nationalreview.com (National Review)",
  "link": "https://www.nationalreview.com/media/political-beats",
  "content:encoded": "<p>Scot and Jeff talk to Kevin Madden about Wilco.</p>\n<p><span><strong>Introducing the Band<br />\n</strong></span>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\">@EsotericCD</a>) with guest Kevin Madden, Republican strategist, CNN Commentator and former advisor to President George W. Bush, Gov. Mitt Romney, Republican House Leaders John Boehner and Tom DeLay.” Follow Kevin on Twitter at <a href=\"https://twitter.com/KevinMaddenDC\">@KevinMaddenDC</a>.</p>\n<p><strong><span>Kevin’s Music Pick: Wilco<br />\n</span></strong>This week the gang gets a shot in the arm as they celebrate Wilco, one of the great genre-transcending American groups of the past quarter century. This is a band that had a cult and critical following long before they emerged into wider prominence in the 21st century, and co-host Scot was there from the start: Wilco is one of the bands nearest and dearest to him in his entire life. Kevin tells the story of sitting in Yonkers city hall during his years as an aide to the city council president and having his head turned around by hearing a song on the radio: “California Stars,” which set him on the path to lifelong fandom. Jeff tells a more familiar story for many, one of finding Wilco due to the hype surrounding <i>Yankee Hotel Foxtrot</i> and being mildly perplexed at first until the eventual discovery of <i>Summerteeth</i> clicked everything into place for him.</p>\n<p><b><span>Too Far Apart: Uncle Tupelo and the origins of Wilco</span><br />\n</b>As much as the gang would have loved to, there just wasn’t any time to seriously discuss Uncle Tupelo, the groundbreaking band from southern Illinois led by Jay Farrar that formed in 1989 and ended up defining the entire subgenre of alt-country. Instead, Scot gives a brief rundown of their career and points out that by far the more important thing, as far as the present episode is concerned, is that Uncle Tupelo <i>also</i> happened to contain a second key member in the quiet, retiring bassist Jeff Tweedy, who began writing more and more songs as the band’s career progressed. This led to incurable friction with Farrar, and when Tupelo eventually collapsed and Farrar quit, Tweedy took the rest of the band with him and renamed it Wilco. Farrar began a new band named Son Volt, and for the next two records, a ‘battle of the bands’ (as Kevin calls it) was on between Son Volt and Wilco.</p>\n<p>The overwhelming critical consensus is that Farrar won round one in a knock-out with Son Volt’s magnificent debut <i>Trace; </i>Wilco’s 1995 debut <i>A.M.</i> was seen by most as an afterthought — a middling continuation of the Uncle Tupelo sound — and proof that the real magic in the band came from Jay Farrar. In retrospect we now know that not to be the case, but the gang argues that <i>A.M.</i> is itself an underrated record in its own right, far too quickly dismissed by critics and fans (and even the band) for failing to advance much on Uncle Tupelo’s original sound. Scot and Kevin praise the guitarwork of Brian Henneman (on temporary loan from the Bottle Rockets) in particular, and note that the embryonic “Tweedy style” of lyrical introversion is found in so many of the highlights of this record, like “Box Full Of Letters” and “Should’ve Been In Love.”</p>\n<p><b><span>Misunderstood: Jay Bennett and </span><i><span>Being There</span><br />\n</i></b>All talk of Wilco as an also-ran in the alt-country scene immediately ended with their second album, 1996’s sprawling 2CD masterpiece <i>Being There</i>. And yet with this record Tweedy was already declaring, on songs such as “Misunderstood” and “Sunken Treasure” (which, as Jeff notes, tellingly open disc 1 and disc 2 respectively), that Wilco was not content to be a mere alt-country act anymore. The impetus behind this shift was Tweedy’s for sure–all of the songs on this LP are solo songwriting credits–but a major reason for the success of Wilco’s sudden musical complexity must be laid at the feet of their newest member, Jay Bennett. Originally hired to be the band’s lead guitarist, Bennett immediately revealed a passion for piano and keyboards and used his skill with them to bathe nearly every song on <i>Being There</i> with graceful and haunting coloristic touches. From “Red-Eyed And Blue” (which Jeff is passionate about) to “Outta Mind (Outta Site)” (which sounds more like a Beach Boys Christmas album outtake than anything else), Bennett’s impact as a performer and an arranger are instantly felt, and his creative contributions to the band would rapidly rise to the level of a near-even collaboration with Tweedy on subsequent records. All three of the gang are effusive in their praise of <i>Being There</i>, a record which finds Wilco stepping into a much larger world of art-rock while still keeping its feet solidly in the world of country balladry and sprightly rockers that had been the Uncle Tupelo calling card. What impresses even more than the variety of this record is its consistency: as a double album with 18 songs, it should drag and yet there few if any perceptible weak spots.</p>\n<p><span><b>A Shot in the Arm: <i>Mermaid Avenue</i> and <i>Summerteeth<br />\n</i></b></span>On tour, Wilco ran into venerable UK political guitar-folkie Billy Bragg and predictably hit it off. Thus, when Bragg was approached by Woody Guthrie’s daughter with the opportunity to work with a huge tranche of Woody’s unpublished lyrics and write new music to it, he decided to recruit Wilco to collaborate with him and bring American roots authenticity to the project. The result was an unalloyed triumph: the gang argues that two volumes of <i>Mermaid Avenue</i> are no mere side-project (though neither Scot nor Jeff have much time for the Billy Bragg material on these two discs), but a key part of Wilco’s discography and the connective material that bridges the gap both between <i>Being There</i> and <i>Summerteeth</i> (in the case of <i>Vol. 1</i>) and <i>Summerteeth</i> and <i>Yankee Hotel Foxtrot</i> (in the case of <i>Vol. 2</i>). Jeff argues that Tweedy and Bennett were liberated by having such eloquent texts to craft music around, and that the result are songs that often times feel ‘more Wilco than Wilco’, particularly on gems like “California Stars” (again, one of Kevin’s favorites), “At My Window Sad And Lonely,” “One By One,” “Airline To Heaven,” and the epic “Remember The Mountain Bed.” At the time of its release, <i>Mermaid Avenue</i> was celebrated by critics as a stunning reassessment and recontextualization of Woody Guthrie’s art; in retrospect, it is also obvious that it is a key link in the chain demonstrating the process by which Tweedy and Bennett were reassessing and recontextualizing their own music with Wilco.</p>\n<p>The results of that reassessment are, by universal agreement between Jeff, Scot, and Kevin, the true masterpiece of Wilco’s career, the glorious <i>Summerteeth</i> (1999). Fans whose last checkpoint for Wilco was (the wonderful, but still largely rooted in well-worn alt-country sounds) <i>Being There</i> must have been completely shocked by the mutagenic growth on display with <i>Summerteeth</i>, a sonically complex, glossy, almost summery-sounding album of art-rock, art-pop, and weirdly crabbed balladry. Scot gets emotional talking about this album, as it is a part of the fabric of his young life – he remembers the first time he heard and spun “I’m Always In Love” on his college radio station, blown away by the complete shift in style after <i>Being There</i>. Jeff is fascinated by the contrast between the vibrantly arranged and produced music (he affectionately calls it the “Jay Bennett goofy synthesizer album”) and the naggingly recurrent darkness of the lyrics: Tweedy is singing about death, doubt, inability to communicate, dashed hopes, the frustration of unrequited faith, and broken relationships, but you would have to listen very carefully to find that in, say, the ethereally pure beauty of “A Shot In The Arm,” which may just be the greatest song of their career. The gang spends a full twenty minutes rhapsodizing about <i>Summerteeth</i>, from “Can’t Stand It” all the way to “Candyfloss,” and all we can say to you is: <u>please listen to this album</u>.</p>\n<p><span><b>The Late Greats: From <i>Yankee Hotel Foxtrot </i>to <i>A Ghost Is Born</i></b></span><b><i><span> </span><br />\n</i></b>This brings the gang to the great white whale of the Wilco discography, <i>Yankee Hotel Foxtrot</i> (2001). As Wilco’s most famous and widely-praised album, and a record with not one but <i>two</i> compelling narratives surrounding it, its place in the critical firmament of 21st-century rock is fixed. Nevertheless, Scot, Kevin and Jeff are all in agreement that <i>YHF</i> is at least somewhat overrated, and none of them rate it as the band’s best work (they are unanimous in choosing <i>Summerteeth</i> instead). Jeff is the most direct in his critique, arguing that this record and the next witness Jeff Tweedy at his (intentionally, one presumes) slackest in terms of vocal approach and commitment to melody. Even on the nominally uptempo numbers on this record, Tweedy’s singing is slack, seemingly stoned, and delivered with a whispery flat affect that betrays hints of deeper demons underneath the surface. Meanwhile much of the music (e.g. “I Am Trying To Break Your Heart,” “Radio Cure,” “I’m The Man Who Loves You”) relies far more on the interest of their backing tracks–specifically the tape loops and various percussive cacophonies that wind in and out of the songs–than they do on the melodic interest of the writing.</p>\n<p>That said, these criticisms feel small compared to the breathtaking scope of <i>Yankee Hotel Foxtrot</i>, an album as purely consistent in tone and mood as any in Wilco’s career. Kevin cites to “Ashes Of American Flags” in particular as representative of the whole of <i>YHF</i>: a ghostly, almost evanescent melody (Jeff isn’t even quite sure it’s a ‘song’ per se), a descent into noisy chaos at the end of the track, but an overall atmosphere of aching beauty and grandeur. Jeff prefers the more lyrically direct material like the wistfully nostalgic “Heavy Metal Drummer” and the lyrical “Poor Places,” while Scot declares that “Pot Kettle Black” is the album’s masterpiece and dares all comers to fight him on the matter.</p>\n<p>It’s impossible to discuss <i>YHF</i> without discussing the documentary <i>I Am Trying To Break Your Heart</i>, filmed during these sessions. It caught the band in the midst of twin crises. First up was their record-label disaster: at work on what would become the band’s universally-acknowledged masterpiece, Wilco found the final product rejected by their label Reprise, and dropped as recording artists. (The resulting outrage from critics, who had been given copies of <i>YHF </i>by the band’s manager, created a huge backlash and secured them a new deal with a different label in short order…and also generated enough buzz to make the record Wilco’s first real chart success.) More importantly, the cameras documented the painful dissolution of the relationship between Jeff Tweedy and Jay Bennett; Bennett was a full participant in the sessions and co-wrote most of the album’s songs, but would be fired by Tweedy immediately afterwards, and the film captures their ongoing communication breakdown in a particularly poignant way. Scot insists that when Jay Bennett left Wilco he took a certain amount of their special magic with him, but Jeff isn’t quite so sure…he thinks Tweedy was being driven by different demons during this era.</p>\n<p>Just exactly what that was became painfully apparent by the time of 2004’s <i>A Ghost Is Born</i>: the record’s release was delayed at the last second because Tweedy needed to check into rehab to rid himself of an addiction to prescription painkillers acquired over the last several years of self-medicating to ward off panic attacks, migraines, and clinical depression. <i>A Ghost Is Born</i> is the sound of that exhaustion, and while Scot disdains it, Jeff rates it highly, seeing in its exhausted and paranoid tones and outre experiments the last truly fearlessly experimental record of Wilco’s career. Sure, nobody needs to hear the hopelessly misbegotten “Less Than You Think” (a middling folk song married to 12 minutes of boring tuneless noise serving no worthy end), but drug-exhausted chance-taking pays off wildly elsewhere on songs like “At Least That’s What You Said”–whose “clever song + guitar freakout” format would establish a template Tweedy carried forward on the rest of their career–and the singular “Spiders (Kidsmoke),” an out-of-nowhere tribute to Krautrock (the specific reference points are Kraftwerk and especially Neu!) that sees Wilco pushing out into genres they had never before even hinted at attempting and succeeding wildly.</p>\n<p>P.S. None of us can really figure out what “Muzzle Of Bees” is supposed to be about either. You are not alone.</p>\n<p><span><b>On And On And On: From <i>Sky Blue Sky</i> to <i>Schmilco</i>, and the Present Day<br />\n</b></span>Jeff Tweedy’s post-rehab career with Wilco encompasses a full five albums — fully half of their studio discography — so it may seem presumptuous to place all of these under the same heading. And yet, on another level the grouping feels correct: the healthy, happy, sober Jeff Tweedy made music with Wilco that felt fundamentally different from the more tortured, crabbed music of their career up to <i>A Ghost Is Born</i>. Wilco loses a significant amount of their weirdness and settles into a series of well-written, well-produced albums full of quirky tunes and impressive guitar solos that nevertheless lack the same sense of danger as their early career (this is, not without reason, sometimes referred to by critics as the “dad-rock” phase of Wilco’s career). Dad-rock or not, Kevin insists on the quality of 2006’s <i>Sky Blue Sky </i>(the first record released by the stable present-day lineup of Wilco) and rates it among their finest work. Scot likes this record a lot more than he thought he did back in the day, and cites “Side With The Seeds” in particular as a standout, while Jeff goes with the haunting album closer “On And On And On,” an immensely moving song about mortality.</p>\n<p>With “Wilco (the song)” off of <i>Wilco </i>(2009) the band unexpectedly scores a rock ‘trifecta’ (album/song/band all of the same name, e.g. Bad Company or Talk Talk), but aside from the title track (which Kevin notes is a perniciously listenable earworm), the gang agrees that this is a much more unfocused record than the previous one. Still, this song is as professional and assuredly listenable as all of Wilco’s late period records, with highlights like “One Wing” (Jeff’s pick), “You And I” (Kevin’s favorite) and the disguised Civil War tale of “I’ll Fight” (Scot’s favorite, and one of his five favorite Wilco songs ever). Unfortunately, <i>The Whole Love</i> (2011) is as close as Wilco comes to sounding generic in their career, with only “Art Of Almost” standing out. (Jeff damns it thus: “Very professional. Very tasteful. Very likable. <i>Dad-rock</i>.”)</p>\n<p>That leads us to the present day and the one-two punch of <i>Star Wars</i> (2015) and <i>Schmilco</i> (2016), which were recorded at the same sessions and then divided after the fact into two very different sounding albums: <i>Star Wars</i> (yes, Tweedy named it after one of the most famous movies of all time–for absolutely no reason whatsoever–and then put a painting of a cat on the cover), released for free online as a surprise record, is by gang consensus the better of the two, a left turn into harder rock sounds than either the sedate <i>The Whole Love</i> or the unrepentantly folky <i>Schmilco. </i>Scot likes <i>Star Wars</i> quite a bit (its tightness brevity is a real plus), in particular the groove of “Random Name Generator” and “Taste The Ceiling.” Jeff and Kevin both agree (Kevin shouts out to “You Satellite”), and all are agreed that the soft <i>Schmilco</i> is the weaker half of these sessions, barely rising above a whisper (though “Cry All Day” is a fine song).</p>\n<p><b><span>Finale</span><br />\n</b>Kevin, Scot, and Jeff each name their two key albums and five key songs by Wilco.</p>\n",
  "enclosure": "",
  "itunes:title": "Episode 33: Kevin Madden / Wilco",
  "itunes:author": "National Review",
  "itunes:duration": "02:18:31",
  "itunes:summary": "Scot and Jeff talk to Kevin Madden about Wilco.",
  "itunes:subtitle": "Scot and Jeff talk to Kevin Madden about Wilco.",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 33
}