{
  "title": "Can your phone tell if a bridge is in good shape?",
  "link": "https://news.mit.edu/2022/phone-sense-bridge-integrity-1103",
  "description": "A new study suggests mobile data collected while traveling over bridges could help evaluate their integrity.",
  "pubDate": "Thu, 03 Nov 2022 12:00:00 -0400",
  "guid": "https://news.mit.edu/2022/phone-sense-bridge-integrity-1103",
  "dc:creator": "Peter Dizikes | MIT News Office",
  "content:encoded": "<p>Want to know if the Golden Gate Bridge is holding up well? There could be an app for that.</p>\n\n<p></p>\n\n<p>A new study involving MIT researchers shows that mobile phones placed in vehicles, equipped with special software, can collect useful structural integrity data while crossing bridges. In so doing, they could become a less expensive alternative to sets of sensors attached to bridges themselves.</p>\n\n<p></p>\n\n<p>“The core finding is that information about structural health of bridges can be extracted from smartphone-collected accelerometer data,” says Carlo Ratti, director of the MIT Sensable City Laboratory and co-author of a new paper summarizing the study’s findings.</p>\n\n<p></p>\n\n<p>The research was conducted, in part, on the Golden Gate Bridge itself. The study showed that mobile devices can capture the same kind of information about bridge vibrations that stationary sensors compile. The researchers also estimate that, depending on the age of a road bridge, mobile-device monitoring could add from 15 percent to 30 percent more years to the structure’s lifespan.</p>\n\n<p>“These results suggest that massive and inexpensive datasets collected by smartphones could play an important role in monitoring the health of existing transportation infrastructure,” the authors write in their new paper.</p>\n\n<p>The study, “Crowdsourcing Bridge Vital Signs with Smartphone Vehicle Trips,” is being published in <em>Communications Engineering</em>.</p>\n\n<p></p>\n\n<p>The authors are Thomas J. Matarazzo, an assistant professor of civil and mechanical engineering at the United States Military Academy at West Point; Daniel Kondor, a postdoc at the Complexity Science Hub in Vienna; Sebastiano Milardo, a researcher at the Senseable City Lab; Soheil S. Eshkevari, a senior research scientist at DiDi Labs and a former member of Senseable City Lab; Paolo Santi, principal research scientist at the Senseable City Lab and research&nbsp;director&nbsp;at the Italian National Research Council; Shamim N. Pakzad, a professor and chair of the Department of Civil and Environmental Engineering at Lehigh University; Markus J. Buehler, the Jerry McAfee Professor in Engineering and professor of civil and environmental engineering and of mechanical engineering at MIT; and Ratti, who is also professor of the practice in MIT’s Department of Urban Studies and Planning.</p>\n\n<p></p>\n\n<p>Bridges naturally vibrate, and to study the essential “modal frequencies” of those vibrations in many directions, engineers typically place sensors, such as accelerometers, on bridges themselves. Changes in the modal frequencies over time may indicate changes in a bridge’s structural integrity.</p>\n\n<p></p>\n\n<p>To conduct the study, the researchers developed an Android-based mobile phone application to collect accelerometer data when the devices were placed in vehicles passing over the bridge. They could then see how well those data matched up with data record by sensors on bridges themselves, to see if the mobile-phone method worked.</p>\n\n<p>“In our work, we designed a methodology for extracting modal vibration frequencies from noisy data collected from smartphones,” Santi says. “As data from multiple trips over a bridge are recorded, noise generated by engine, suspension and traffic vibrations, [and] asphalt, tend to cancel out, while the underlying dominant frequencies emerge.”</p>\n\n<p>In the case of the Golden Gate Bridge, the researchers drove over the bridge 102 times with their devices running, and the team used 72 trips by Uber drivers with activated phones as well. The team then compared the resulting data to that from a group of 240 sensors that had been placed on the Golden Gate Bridge for three months.</p>\n\n<p>The outcome was that the data from the phones converged with that from the bridge’s sensors; for 10 particular types of low-frequency vibrations engineers measure on the bridge, there was a close match, and in five cases, there was no discrepancy between the methods at all.</p>\n\n<p>“We were able to show that many of these frequencies correspond very accurately to the prominent modal frequencies of the bridge,” Santi says. &nbsp;</p>\n\n<p>However, only 1 percent of all bridges in the U.S. are suspension bridges. About 41 percent are much smaller concrete span bridges. So, the researchers also examined how well their method would fare in that setting.</p>\n\n<p></p>\n\n<p>To do so, they studied a bridge in Ciampino, Italy, comparing 280 vehicle trips over the bridge to six sensors that had been placed on the bridge for seven months. Here, the researchers were also encouraged by the findings, though they found up to a 2.3 percent divergence between methods for certain modal frequencies over all 280 trips, and a 5.5 percent divergence over a smaller sample. That suggests a larger volume of trips could yield more useful data.</p>\n\n<p></p>\n\n<p>“Our initial results suggest that only a [modest amount] of trips over the span of a few weeks are sufficient to obtain useful information about bridge modal frequencies,” Santi says.</p>\n\n<p></p>\n\n<p>Looking at the method as a whole, Buehler observes, “Vibrational signatures are emerging as a powerful tool to assess properties of large and complex systems, ranging from viral properties of pathogens to structural integrity of bridges as shown in this study. It’s a universal signal found widely in the natural and built environment that we’re just now beginning to explore as a diagnostic and generative tool in engineering.”</p>\n\n<p></p>\n\n<p>As Ratti acknowledges, there are ways to refine and expand the research, including accounting for the effects of the smartphone mount in the vehicle, the influence of the vehicle type on the data, and more.</p>\n\n<p></p>\n\n<p>“We still have work to do, but we believe that our approach could be scaled up easily — all the way to the level of an entire country,” Ratti says. “It might not reach the accuracy that one can get using fixed sensors installed on a bridge, but it could become a very interesting early-warning system. Small anomalies could then suggest when to carry out further analyses.”</p>\n\n<p>The researchers received support from Anas S.p.A., Allianz, Brose, Cisco, Dover Corporation, Ford, the Amsterdam Institute for Advanced Metropolitan Solutions, the Fraunhofer Institute, the former Kuwait-MIT Center for Natural Resources and the Environment, Lab Campus, RATP, Singapore–MIT Alliance for Research and Technology (SMART), SNCF Gares &amp; Connexions, UBER, and the U.S. Department of Defense High-Performance Computing Modernization Program.</p>",
  "media:content": {
    "media:description": "MIT researchers find data collected by mobile phones could be used to evaluate the structural integrity of bridges.",
    "media:credit": "Image: MIT News with images from iStockphoto"
  },
  "category": [
    "Infrastructure",
    "Data",
    "Sensors",
    "Mobile devices",
    "Crowdsourcing",
    "Transportation",
    "Civil and environmental engineering",
    "Urban studies and planning",
    "Mechanical engineering",
    "School of Architecture and Planning",
    "School of Engineering"
  ]
}