{
  "title": "Sketchy Hotel | RGSO Classic",
  "link": "https://audioboom.com/posts/8120716",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2209,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>What was the entity lurking behind the doors of a sketchy motel late one night?<br>\nHere is a preview of the story.<br>\n“We were visiting Reno for our annual golf trip. We were not staying in some sketchy motel, our event brought us to one of the nicer casino hotels downtown. I wish I could remember the room number because we're staying again there this year. Anyway, when I checked in, I did my usual look-see around the room. Afterward, I plopped down on the chair next to the window and admired \"beautiful\" view of downtown Reno. It is then I noticed some graffiti written in Sharpie on the nightstand. It said, \"RIP Swagger.\" Okay, this place was sketchy after all. RIP Swagger was also written on the wall behind the nightstand and on the wall behind the curtain. I immediately wondered if \"Swagger\" died in this room. No time to ponder, there were free drinks upstairs in the hospitality suite.”<br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Sat, 30 Jul 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-07-14:/posts/8120716",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}