{
  "id": "yt:video:5CXmNJdIJuc",
  "yt:videoId": "5CXmNJdIJuc",
  "yt:channelId": "UCccafaIN6dwBwyl1cwNH90w",
  "title": "REBUS: The Latest Unified Model of How Psychedelics Work | Relaxed Beliefs Under pSychedelics",
  "link": "",
  "author": {
    "name": "The Psychedelic Scientist",
    "uri": "https://www.youtube.com/channel/UCccafaIN6dwBwyl1cwNH90w"
  },
  "published": "2021-02-19T18:52:27+00:00",
  "updated": "2022-05-28T03:42:31+00:00",
  "media:group": {
    "media:title": "REBUS: The Latest Unified Model of How Psychedelics Work | Relaxed Beliefs Under pSychedelics",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Building on my previous video on the Entropic Brain Hypothesis, in this video I present the RElaxed Beliefs Under pSychedelics (REBUS) model of how psychedelics work.\n\nThis is the latest unified scientific model of psychedelic drug action, proposed by leading psychedelic neuroscientist Dr. Robin Carhart-Harris.\n\nI dive into what exactly it proposes, on both a psychological and brain level, and provide all the background needed to get a grasp of it. \n\nAs always, I do my best to make my videos accessible to a non-scientific audience, without sacrificing too much depth or nuance.\n\nEnjoy!\n\nThe paper that proposed this model can be found here: https://pharmrev.aspetjournals.org/content/71/3/316\n---\n\nDon't forget to follow me on social media for all the latest updates. Especially Instagram where I post the most!\n\nInstagram\nhttps://www.instagram.com/thepsychede... \n\nTwitter\nhttps://twitter.com/ThePsychedSci\n\nFacebook\nhttps://www.facebook.com/The-Psychede... \n\nMore info about me:\n\nManesh Girn is a Neuroscience PhD student at McGill University and has been lead or co-author on over a dozen scientific publications and book chapters on topics including psychedelics, meditation, daydreaming, and brain networks. \n\nManesh currently has ongoing collaborations with Robin Carhart-Harris and others at the Imperial College Center for Psychedelic Research and is investigating the brain changes underlying psilocybin, LSD, and DMT.\n\nhttps://twitter.com/MGirnNeuro\nhttps://www.researchgate.net/profile/...",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}