{
  "guid": "urn:uuid:9dac9e26-3cb2-4202-a646-da361fc60181",
  "link": "https://www.who.int/news/item/17-10-2022-unicef-and-who-welcome-ksrelief-funding-for-measles-and-polio-epidemics-prevention",
  "a10:author": {
    "a10:name": ""
  },
  "title": "UNICEF and WHO welcome KSrelief funding for measles and polio epidemics prevention",
  "description": "<p>The World Health Organization (WHO) and UNICEF welcomed today funding agreements from the King Salman Humanitarian Aid and Relief Centre (KSrelief) valued at US$ 10 million to further bolster polio and measles programmes in eight countries. The agreement was signed on the sidelines of the World Health Summit in Berlin.<br /></p><p>The new funding will provide UNICEF and WHO with US$ 5 million each in response to a call for emergency action by WHO and UNICEF to avert major polio and measles epidemics. WHO and UNICEF have urged countries to prioritize&nbsp;vaccination for children&nbsp;as they rebuild&nbsp;their immunization systems following major global immunization disruptions caused by COVID-19. The pandemic has left millions of vulnerable children at heightened risk of preventable childhood diseases. </p><p>With this generous contribution from KSrelief, WHO will support the polio and measles programmes in&nbsp; Somalia, Iraq, and Sudan through the procurement of laboratory equipment; enhancing surveillance; digitalisation of EPI; strengthening the cold chain; and trainings of campaign vaccinators. UNICEF will support the five high-risk countries of Afghanistan, Central African Republic, Democratic Republic of the Congo, Guinea, and Pakistan with the procurement and in-country distribution of polio and measles vaccines and supplies like cold chain equipment and syringes; recruitment and training of vaccinators; and sustainably strengthening immunization systems.</p><p>&nbsp;&ldquo;COVID-19 has had a devastating effect on immunisation services globally,\" said Dr Tedros Adhanom Ghebreyesus, Director-General of WHO. \"KSrelief's generous support will help WHO to save children&rsquo;s lives, benefiting an estimated 50 million people and averting major outbreaks of vaccine-preventable diseases including polio and measles in Somalia, Iraq and Sudan.\"</p><p>&ldquo;We can't let COVID-19 drive new epidemics of childhood disease, \" said UNICEF Executive Director Catherine Russell. \"The pandemic disrupted routine immunization services around the world, leaving millions of vulnerable children at heightened risk of polio, measles and other preventable childhood diseases. This new agreement will translate into lives saved and stronger immunization systems that will benefit millions of children.&rdquo; </p><p>Dr Abdullah Al Rabeeah, Supervisor General of King Salman Humanitarian Aid and Relief Centre (KSrelief) stated: &ldquo;This cooperation agreement will strengthen global action to protect vulnerable children at increased risk from preventable childhood diseases; it also affirms the Kingdom of Saudi Arabia's dedication to saving lives and safeguarding futures. The agreement is the result of the Kingdom&rsquo;s commitment to working with the WHO and UNICEF to jointly address global health challenges.&rdquo;</p><p>----------------------------------------------------------------------------------------------------</p><p>At the World Health Summit, which brings together governments, donors, civil society and advocates, UNICEF and WHO renewed calls for urgent action to avert measles and polio epidemics and reaffirm commitments to eradicate vaccine-preventable diseases.</p>",
  "pubDate": "Mon, 17 Oct 2022 15:51:48 Z"
}