{
  "title": "Dynamical simulations of carotenoid photoexcited states using density matrix renormalization group techniques. (arXiv:2211.02022v1 [physics.chem-ph])",
  "link": "http://arxiv.org/abs/2211.02022",
  "description": "<p>We present a dynamical simulation scheme to model the highly correlated\nexcited state dynamics of linear polyenes. We apply it to investigate the\ninternal conversion processes of carotenoids following their photoexcitation.\nWe use the extended Hubbard-Peierls model, $\\hat{H}_{\\textrm{UVP}}$, to\ndescribe the $\\pi$-electronic system coupled to nuclear degrees of freedom\nsupplemented by a Hamiltonian, $\\hat{H}_{\\epsilon}$, that explicitly breaks\nboth the particle-hole and two-fold rotation symmetries of idealized\ncarotenoids. The electronic degrees of freedom are treated quantum mechanically\nby solving the time-dependent Schr\\\"odinger equation using the adaptive\ntime-dependent DMRG (tDMRG) method, while nuclear dynamics are treated via the\nEhrenfest equations of motion. By defining adiabatic excited states as the\neigenstates of the full Hamiltonian,\n$\\hat{H}=\\hat{H}_{\\textrm{UVP}}+\\hat{H}_{\\epsilon}$, and diabatic excited\nstates as eigenstates of $\\hat{H}_{\\textrm{UVP}}$, we present a computational\nframework to monitor the internal conversion process from the initial\nphotoexcited state to the singlet triplet-pair states of carotenoids. We\nfurther incorporate Lanczos-DMRG to the tDMRG-Ehrenfest method to calculate\ntransient absorption spectra from the evolving photoexcited state. We describe\nthe accuracy and convergence criteria for DMRG, and show that this method\naccurately describes the dynamics of carotenoid excited states. We also discuss\nthe effect of $\\hat{H}_{\\epsilon}$ on the internal conversion process, and show\nthat its effect on the extent of internal conversion can be described by a\nLandau-Zener-type transition. This methodological paper is a companion to our\nmore explanatory discussion of carotenoid excited state dynamics in,\n$\\textit{Photoexcited state dynamics and singlet fission in carotenoids}$, D.\nManawadu, T. N. Georges and W. Barford, $\\textit{J. Phys. Chem. A}$ (2023).\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Manawadu_D/0/1/0/all/0/1\">Dilhan Manawadu</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Valentine_D/0/1/0/all/0/1\">Darren J. Valentine</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Barford_W/0/1/0/all/0/1\">William Barford</a>"
}