{
  "title": "Auto Racing Test Drives Its Own EV Future",
  "link": "https://spectrum.ieee.org/auto-racing-electric-future",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/cars-racing-on-a-dirt-track.jpg?id=31446037&width=1200&height=800&coordinates=0%2C104%2C0%2C105\"/><br/><br/><p>With superpowered cars like the <a href=\"https://ev-database.org/car/1405/Tesla-Model-S-Plaid\" target=\"_blank\">Model S Plaid</a>, Tesla upended the stereotype of electric cars as being slow, frumpy, and boring.</p><p>Now electric cars are making scorching inroads on the racing scene, faster than many folks dared to believe.</p><p><a href=\"https://www.fiaformulae.com/en\" rel=\"noopener noreferrer\" target=\"_blank\">Formula E</a>, the FIA’s offshoot of the global spectacle that is <a href=\"https://www.nytimes.com/2022/07/14/magazine/formula-1-miami-drive-to-survive.html\" rel=\"noopener noreferrer\" target=\"_blank\">Formula 1</a>, has gone from awkward baby steps to sprint-level speed in just eight years. Its own stepchild, the inaugural <a href=\"https://www.extreme-e.com/\" target=\"_blank\">Extreme E</a> series, is staging electric off-road battles in such exotic locales as Greenland, Senegal, and Sardinia, with five teams led by racing superstars including <a href=\"https://chipganassiracing.com/\" target=\"_blank\">Chip Ganassi</a>, <a href=\"https://en.wikipedia.org/wiki/Nico_Rosberg\" target=\"_blank\">Nico Rosberg</a>, and <a href=\"https://en.wikipedia.org/wiki/Michael_Andretti\" target=\"_blank\">Michael Andretti</a>. The latest such event from the FIA, or Fédération Internationale de l’Automobile,  is <a href=\"https://www.fiaworldrallycross.com/world-rx/news/world-rx/2022/world-rx-s-electric-era-to-start-in-norway-next-month/\" target=\"_blank\">World Rallycross</a>, a wild-and-wooly mix of off-road rallying and tarmac sections. That series unexpectedly swore off gasoline and staged its <a href=\"https://insideevs.com/news/607122/world-rallycross-ditch-gas-for-electric-cars/\" rel=\"noopener noreferrer\" target=\"_blank\">first all-electric race</a> on 13–14 August in Hell, Norway.</p><p>Behind the spent carbon fumes, a skeptic might detect a whiff of electric opportunism on the part of some lesser racing organizations, desperate to grab a foothold, headlines, or the overtaxed attention spans of sports and racing fans. (Extreme E’s events are being held with no spectators, created entirely for Web and TV broadcast). But commercial interests or hucksterism aside, few would argue that the technology itself isn’t making impressive strides.</p><p class=\"pull-quote\">“For each race minute, we will get 1 kilowatt-hour back from each axle.”<br/>—Björn Förster, Porsche</p><p>A remorseless stopwatch comparison of Formula E—the current state-of-the-art in racing EVs—vs. F1 doesn’t flatter the battery brigade. At the <a href=\"https://www.formula1.com/en/racing/2022/Monaco.html\" target=\"_blank\">Monaco Grand Prix</a> circuit, where Formula E recently ran the full course for the first time, an F1 car driven by the likes of <a href=\"https://en.wikipedia.org/wiki/Lewis_Hamilton\" target=\"_blank\">Lewis Hamilton</a> is faster by at least 10 seconds per lap, an embarrassing eternity in racing terms. With about 1,050 horsepower, the F1 car has more than three times the power, vastly more aerodynamic downforce, and it’s lighter as well, at roughly 795 kilograms. But the picture is skewed at the top of the heap: Top F1 teams <a href=\"https://www.thedrive.com/accelerator/40525/it-cost-mercedes-459m-to-win-the-f1-championship-in-2020\" target=\"_blank\">spend nearly US $500 million </a>to run two cars for a single race season, though that includes <a href=\"https://www.forbes.com/sites/brettknight/2021/07/22/formula-1-highest-paid-drivers-hamilton-verstappen/?sh=5244d7db1182\" target=\"_blank\">superstar driver salaries</a> that can top US $50 million. Still, Ferrari, Red Bull, Mercedes, and McLaren spend hundreds of millions of dollars each year on race engineering and R&D alone. The FIA caps the cost of a single F1 engine at around US $15 million, but some teams try to hide true costs to avoid penalties.<br/></p><p>So the performance gap remains huge, but Formula E is trying to close it. In Formula E’s early years beginning in 2014, drivers actually had to jump into a second car in the pits around the event’s midpoint, because a single car couldn’t complete a full race on a single charge. Due in part to those stamina demands, these original electric, open-wheel racers brought a puny 177 kilowatts (240 horsepower), less than many family sedans, and maxed out around 225 kilometers per hour. Today’s second-generation car has a 250 kW (335-hp) electric motor on its rear axle, and can reach a solid 280 km/h. But it’s the latest Formula E car that’s set to turn heads, including at the annual race on the piers of Brooklyn, with the Manhattan skyline as dramatic backdrop—which happens to be a short walk from my apartment in the Red Hook neighborhood.</p><p>The third-generation Formula E car, set to make its competitive debut in Saudi Arabia in early 2023, is smaller, lighter, faster and more environmentally friendly than any electric racer in history.</p><p>The series’ first dual-power-train car brings a robust 600 kW, (805 hp), boosted by a new 250-kW front motor. Theoretically, the cars can top 320 km/h, though the series’ shorter street courses won’t leave enough room to actually reach those speeds. The car sucks up so much energy through regenerative braking—about 40 percent of its total power—that no hydraulic rear brakes are required, a racing first regardless of power-train type. Eliminating those brakes helps trim 60 kg of weight, dropping the total to 840 kg; or 1,848 pounds, only about 100 more than an F1 monster. Ultrafast charging at 600 kW nearly doubles the most powerful public chargers for civilian drivers. The cars feature recyclable batteries and bodies made from linen and recycled carbon fiber from last year’s cars. <a href=\"https://www.hankooktire.com/global/en/tires/tires-overview.html\" target=\"_blank\">Hankook tires</a> use natural rubber and recycled fiber and will be recycled after every race.</p><p class=\"pull-quote\">The GT4 e Performance has 10 handling settings to take advantage of an EV’s extreme torque sensitivity, in a way that makes internal-combustion-engine cars’ “torque vectoring” controls seem primitive.</p><p>With all race series increasingly focused on such sustainability, reduced emissions and solid citizenship, a potential changing of the guard was on full display at this year’s <a href=\"https://www.goodwood.com/motorsport/festival-of-speed/\" target=\"_blank\">Goodwood Festival of Speed</a> in the United Kingdom. At Goodwood’s notorious, hay-bale-lined Hillclimb, even showroom EVs such as the Lucid Air posted times that—to use a British term—gobsmacked old-timers and the younger set alike. A car called the <a href=\"https://mcmurtry.com/speirling/\" target=\"_blank\">McMurtry Spierling</a>—an oddball, single-seat track car—set the Hillclimb record by more than one second over the <a href=\"https://en.wikipedia.org/wiki/Volkswagen_I.D._R\" target=\"_blank\">Volkswagen ID.R</a>. That Volkswagen itself had merely set a stunning<a href=\"https://www.youtube.com/watch?v=ZnXtAK3dYoE\" target=\"_blank\"> Pikes Peak hill-climb</a> record; and clocked the second-fastest time of any car in history on the Nürburgring Nordschleife circuit (at about 6 minutes and 5 seconds). That’s second only to Porsche’s <a href=\"https://en.wikipedia.org/wiki/Porsche_919_Hybrid\" target=\"_blank\">919 Evo Hybrid</a>, a monster built from the bones of its LeMans-winning race car, specifically to set a record on the ‘Ring.<br/></p><p>In realms such as the 24 Hours of LeMans, Porsche’s legendary sports cars and racing prototypes have posted more wins and championships than any manufacturer. And Porsche also chose Goodwood for the debut of its incredible <a href=\"https://www.youtube.com/watch?v=tp1KVHym_DY\" target=\"_blank\">Porsche Cayman GT4 ePerformance</a>. That car, based on its showroom Cayman sports car, previews a coming generation of Porsche’s customer racing teams, proving that, as one executive told <em>IEEE Spectrum</em>, “The electric future can be fun.”</p><p>The Cayman e-Performance clearly shows Porsche on the cusp of building all-electric cars that can match the performance of its top production-based 911 GT racers—while using a fraction of the energy, and with zero tailpipe emissions.</p><p>The all-electric GT4 can already match the Monaco lap times of the brand’s fearsome <a href=\"https://motorsports.porsche.com/international/en/category/cars/911-gt3-r\" target=\"_blank\">911 GT3 Cup racer</a>. The curvaceous prototype now embarks on a two-year world tour to prove its viability for racing customers and series honchos alike. Björn Förster, the GT4 ePerformance’s head of technical development, told me that “With this laboratory of ePerformance, we have just started to step into our new playground.”</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"porsche electric vehicle driving on a track\" class=\"rm-shortcode\" data-rm-shortcode-id=\"44f4442b170a2cd32bb655dc7f0f8181\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"f723b\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/porsche-electric-vehicle-driving-on-a-track.jpg?id=31446264&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The 718 Cayman GT4 ePerformance.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Porsche AG</small></p><p>Even the engineers of Porsche, born with gasoline in their veins, are learning new tricks in this electric lab. Here’s one: Adding all-wheel drive actually makes the GT4 “lighter,” Förster says.</p><p>“Why would you put on another power train to make a car lighter?” Förster asks. “But that was the big learning we had in the beginning of development.”</p><p>This counterintuitive claim doesn’t apply to the street. But on track—where cars swing from full throttle to full, neck-straining braking at every corner entry and exit—it’s a different story. Because of that constant, brutally front-loaded braking, Porsche learned a driven front axle more than doubles energy capture via regenerative braking. Enough energy, in fact, to carry <em>220 fewer kilograms</em> of battery. The result is a “lighter” electric Porsche racer with more of the quicksilver agility for which they’re known.</p><p>“For each race minute, we will get 1 kilowatt-hour back from each axle,” Förster says.</p><p>Over a 25-minute race, that’s 50 kWh of energy capture, which nearly matches the total 60 kWh of usable battery power in a buffered, 80-kWh pack. Add the two numbers, and the GT4 ePerformance has the 110 kWh necessary to run a full Cup race and (ideally) take the checkered flag. This plug-in GT4 can also charge from 5 to 80 percent in 15 minutes.</p><p class=\"pull-quote\">Internal combustion is notoriously inefficient, turning at most 40 percent of burnt fossil-fuel energy into forward motion. On the street, EVs are beginning to top 90 percent efficiency, with the latest Formula E car targeting 95 percent, aided by recovering so much otherwise wasted braking energy. </p><p>To overcome racing’s daunting issue of running out of battery juice, the GT4 ePerformance can also flexibly adjust power at will to run at maximum performance for a set race time; with no components reaching a thermal overload that requires dialing down power to cool things off.</p><p>So the GT4 can blast through a full Cup race at the sweet spot of 603 hp. Flip a switch, and the Porsche can spool up 1,073 hp—more juice than an F1 car—for roughly 18 minutes. Dial back to 402 hp, and stamina grows to more than 45 minutes. As with street cars and their performance settings, that previews how racers can easily optimize cars for various race series and applications.</p><p>Experts add that, because of the physical nature of electric motors and their magnetic fields, EVs are opening new worlds of system feedback and perception, with handling advantages that internal-combustion-engine (ICE) cars can only dream of. General Motors’ street EVs can already measure electric torque every 10 microseconds, and adjust output before tires even begin to slip—a potential game changer in terms of control strategies. The GT4 e Performance has 10 handling settings to take advantage of this newfound sensitivity, in a way that makes ICE cars’ “torque vectoring” controls seem primitive.</p><p>Of course, ICEs are notoriously inefficient, turning (at most) 40 percent of their burnt-fossil energy into forward motion. On the street, EVs are beginning to top 90 percent efficiency, with the latest Formula E car targeting 95 percent, greatly aided by recovering so much braking energy that would otherwise be wasted.</p><p>Street or track, try this for game changer, Förster says: The Porsche’s battery stores the equivalent of 9 liters (2.4 gallons) of fuel.</p><p>“We have an electric race car with a “tank” of 9 liters, that can run a half hour on track,” Förster says. Its traditional GT Cup race could run for 3 minutes, or just two laps, on the same amount of fuel. That means efficiency rises by a factor of 10. For now, he says, the only reason ICE can compete is because of the unmatched energy density of its polluting, carbon-based fuel.</p><p>“The efficiency of an electric drivetrain is already so good that you don’t have to develop anything more,” he says. “If you’re attracted by lap time, you have to go for an electric car.”</p>",
  "pubDate": "Fri, 02 Sep 2022 17:45:20 +0000",
  "guid": "https://spectrum.ieee.org/auto-racing-electric-future",
  "category": [
    "Electric vehicles",
    "Automobiles",
    "Racing"
  ],
  "dc:creator": "Lawrence Ulrich",
  "media:content": ""
}