{
  "title": "Makeup Artistry Requires Emotional Intelligence | Quinn Murphy",
  "pubDate": "Mon, 28 Jun 2021 08:00:00 +0000",
  "guid": "aadcc42e-932e-45a4-a8ce-7504238d06a7",
  "link": "https://beautyuncovered.libsyn.com/makeup-artistry-requires-emotional-intelligence-quinn-murphy",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Today we have Quinn Murphy, a bi-coastal makeup artist. His celebrity clients include Lily Aldridge, Karlie Kloss, Kate Hudson, Olivia Palermo, Diane Kruger, Dakota Fanning, and Alison Brie. His work has appeared in publications such as Allure, Glamour, Vogue, Style, LOVE, Elle, Harper's Bazaar, and Interview. He is the host of the really popular podcast,</span> <em><span style=\"font-weight: 400;\">In My Chair</span></em><span style=\"font-weight: 400;\">. </span></p> <p><span style=\"font-weight: 400;\">Beauty Uncovered is brought to you by Olaplex, which invites you to go beyond the surface with the only system that rebuilds broken hair bonds. You can find out more at Olaplex.com</span></p>",
  "content:encoded": "<p>Today we have Quinn Murphy, a bi-coastal makeup artist. His celebrity clients include Lily Aldridge, Karlie Kloss, Kate Hudson, Olivia Palermo, Diane Kruger, Dakota Fanning, and Alison Brie. His work has appeared in publications such as Allure, Glamour, Vogue, Style, LOVE, Elle, Harper's Bazaar, and Interview. He is the host of the really popular podcast, <em>In My Chair</em>. </p> <p>Beauty Uncovered is brought to you by Olaplex, which invites you to go beyond the surface with the only system that rebuilds broken hair bonds. You can find out more at Olaplex.com</p>",
  "enclosure": "",
  "itunes:duration": "31:58",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today we have Quinn Murphy, a bi-coastal makeup artist. His celebrity clients include Lily Aldridge, Karlie Kloss, Kate Hudson, Olivia Palermo, Diane Kruger, Dakota Fanning, and Alison Brie. His work has appeared in publications such as Allure,...",
  "itunes:episode": 18,
  "itunes:episodeType": "full"
}