{
  "title": "Exploring the State-of-the-Art Language Modeling Methods and Data Augmentation Techniques for Multilingual Clause-Level Morphology. (arXiv:2211.01736v1 [cs.CL])",
  "link": "http://arxiv.org/abs/2211.01736",
  "description": "<p>This paper describes the KUIS-AI NLP team's submission for the 1$^{st}$\nShared Task on Multilingual Clause-level Morphology (MRL2022). We present our\nwork on all three parts of the shared task: inflection, reinflection, and\nanalysis. We mainly explore two approaches: Transformer models in combination\nwith data augmentation, and exploiting the state-of-the-art language modeling\ntechniques for morphological analysis. Data augmentation leads a remarkable\nperformance improvement for most of the languages in the inflection task.\nPrefix-tuning on pretrained mGPT model helps us to adapt reinflection and\nanalysis tasks in a low-data setting. Additionally, we used pipeline\narchitectures using publicly available open source lemmatization tools and\nmonolingual BERT-based morphological feature classifiers for reinflection and\nanalysis tasks, respectively. While Transformer architectures with data\naugmentation and pipeline architectures achieved the best results for\ninflection and reinflection tasks, pipelines and prefix-tuning on mGPT received\nthe highest results for the analysis task. Our methods achieved first place in\neach of the three tasks and outperforms mT5-baseline with ~89\\% for inflection,\n~80\\% for reinflection and ~12\\% for analysis. Our code\nhttps://github.com/emrecanacikgoz/mrl2022 is publicly available.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Acikgoz_E/0/1/0/all/0/1\">Emre Can Acikgoz</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chubakov_T/0/1/0/all/0/1\">Tilek Chubakov</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kural_M/0/1/0/all/0/1\">M&#xfc;ge Kural</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sahin_G/0/1/0/all/0/1\">G&#xf6;zde G&#xfc;l &#x15e;ahin</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yuret_D/0/1/0/all/0/1\">Deniz Yuret</a>"
}