{
  "title": "Work reimagined: new ways to collaborate safer, smarter and simpler with G Suite",
  "link": "https://blog.google/products/g-suite/work-reimagined-new-ways-to-collaborate-safer-smarter-and-simpler-with-g-suite/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Over the last decade we’ve witnessed the maturation of G Suite—from the introduction of Gmail and Google Docs to more recent advancements in AI and machine learning that are powering, and protecting, the world's email. Now, more than 4 million paying businesses are using our suite to reimagine how they work, and companies like Whirlpool, Nielsen, BBVA and Broadcom are among the many who choose G Suite to move faster, better connect their teams and advance their competitive edge.</p><p>In the past year, our team has worked hard to offer nearly 300 new capabilities for G Suite users. Today, we’re excited to share some of the new ways organizations can use G Suite to focus on creative work and move their business forward—keep an eye out for additional announcements to come tomorrow as well.</p><p>Here’s what we’re announcing today:<br/></p><p></p><ul><li><p>Security center investigation tool (available in an Early Adopter Program* for G Suite Enterprise customers)</p></li><li><p>Data regions (available now for G Suite Business and Enterprise customers)</p></li><li><p>Smart Reply in Hangouts Chat (coming soon to G Suite customers)</p></li><li><p>Smart Compose (coming soon to G Suite customers)</p></li><li><p>Grammar Suggestions in Google Docs (available in an Early Adopter Program for G Suite customers today)</p></li><li><p>Voice commands in Hangouts Meet hardware (coming to select Hangouts Meet hardware customers later this year)</p></li></ul><h3>Nothing matters more than security</h3><p>Businesses need a way to simplify their security management, which is why earlier this year we introduced the <a href=\"https://gsuite.google.com/products/admin/security-center/\">security center</a> for G Suite. The security center brings together security analytics, actionable insights and best practice recommendations from Google to help you protect your organization, data and users.</p><p><b>Today, we’re announcing our new investigation tool</b> in security center, which adds integrated remediation to the prevention and detection capabilities of the security center. Admins can identify which users are potentially infected, see if anything’s been shared externally and remove access to Drive files or delete malicious emails. Since the investigation tool makes it possible to review your data security in one place and has a simple UI, it makes it easier to take action against threats without having to worry about analyzing logs which can be time-consuming and require complex scripting. Investigation tool is available today as part of our <a href=\"https://gsuite.google.com/campaigns/index__investigation-security.html\">Early Adopter Program</a> (EAP) for G Suite Enterprise customers. <a href=\"https://gsuiteupdates.googleblog.com/2018/07/fix-security-threats-g-suite-investigation-tool.html)\">Learn more</a>.<br/></p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"Investigation Tool in Security Center - G Suite Next '18\" class=\"article-image--large\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/Blog-investigation-tool-1920x1080_1.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>In addition to giving admins a simpler way to keep data secure, we’re constantly working to ensure that they have the transparency and control they need. <b>That’s why we’re adding support for data regions to G Suite.</b> For organizations with data control requirements, G Suite will now let customers choose where to store primary data for select G Suite apps—globally distributed, U.S. or Europe. We’re also making it simple to manage your data regions on an ongoing basis. For example, when a file’s owner changes or moves to another organizational unit, we automatically move the data—with no impact on the file’s availability to collaborators. Plus, users continue to get full edit rights on content while data is being moved.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"Data Regions - G Suite Next '18\" class=\"article-image--large\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/Gsuite_DataRegions_1.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Rob Tollerton, Director of IT at PricewaterhouseCoopers International Limited (PwCIL), and his team are using G Suite to manage global data policies: \"Given PwC is a global network with operations in 158 countries, I am very happy to see Google investing in data regions for G Suite and thrilled by how easy and intuitive it will be to set up and manage multi-region policies for our domain.“</p><p>Data regions for G Suite is generally available to all G Suite Business and Enterprise customers today at no additional cost. We're continually investing in the offering and will expand it further over time. <a href=\"https://gsuiteupdates.googleblog.com/2018/07/gsuite-data-regions.html\">Learn more</a>.</p></div></div><div class=\"block-pull_quote\"><div class=\"uni-pull-quote h-c-page\"><section class=\"h-c-grid\"><div class=\"uni-pull-quote__wrapper h-c-grid__col h-c-grid__col--8 h-c-grid__col-m--6 h-c-grid__col-l--6 h-c-grid__col--offset-2 h-c-grid__col-m--offset-3 h-c-grid__col-l--offset-3\"><div class=\"uni-pull-quote__inner-wrapper h-c-copy h-c-copy\"><q class=\"uni-pull-quote__text\">I am very happy to see Google investing in data regions for G Suite and thrilled by how easy it will be to set up and manage multi-region policies.</q> <cite class=\"uni-pull-quote__author\"><span class=\"uni-pull-quote__author-meta\"><strong class=\"h-u-font-weight-medium\">Rob Tollerton</strong><br/> Director of IT, PwCIL</span></cite></div></div></section></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Let machines do the mundane work</h3><p>We’ve spent many years as a company investing in AI and machine learning, and we’re dedicated to a simple idea: rather than replacing human skills, we think AI has endless potential to <a href=\"https://www.blog.google/perspectives/fei-fei-li/how-make-ai-good-for-people/\">enhance them</a>. Google AI is already helping millions of people around the world navigate, communicate and get things done in our consumer products. In G Suite, we’re using AI to help businesses and their employees do their best work.</p><p>Many of you use Smart Reply in Gmail. It processes hundreds of millions of messages daily and already drives more than 10 percent of email replies. Today we’re announcing that <b>Smart Reply is coming to Hangouts Chat</b> to help you respond to messages quicker so you can free up time to focus on creative work.</p><p>Our technology recognizes which messages most likely need responses, and proposes three different replies that sound like how you typically respond. The proposed responses are casual enough for chat and yet appropriate in a workplace. Smart Reply in Hangouts Chat will be available to G Suite customers in the coming weeks.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"Smart Reply in Hangouts Chat - G Suite Next '18\" class=\"article-image--large\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/SmartReplyV2_in_Chat_cz4jjUr.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Smart Reply makes sending short replies easy, especially on the go. But we know that the most time-consuming emails require longer, more complex thoughts. That’s why we built <a href=\"https://www.blog.google/products/gmail/subject-write-emails-faster-smart-compose-gmail/\">Smart Compose</a>, which you may have heard Sundar <a href=\"https://www.youtube.com/watch?v=vWLcyFtni6U&amp;itct=CAsQpDAYCCITCLevpoL2_dkCFTLIwQod-1oGBTIHcmVsYXRlZEjvpNiYoPmEpIoB&amp;app=desktop\">talk about</a> at Google I/O this year. Smart Compose intelligently autocompletes your emails; it can fill in greetings, sign offs and common phrases so you can collaborate efficiently. We first launched Smart Compose to consumers in May, and now <b>Smart Compose in Gmail is ready for G Suite customers.</b></p><p>In addition to autocompleting common phrases, Smart Compose can insert personalized information like your office or home address, so you don’t need to spend time in repetitive tasks. And best of all, it will get smarter with time—for example, learning how you prefer to greet certain people in emails to ensure that when you use Smart Compose you sound like yourself.</p><p>Smart Compose in Gmail will be available to G Suite customers in the coming weeks.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"Smart Compose - G Suite Next '18\" class=\"article-image--large\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/New_Smart-compose-2560x1440_1.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>We’re also using AI to help people write more clearly and effectively. It can be tricky at times to catch things like spelling and grammatical errors that inadvertently change the meaning of a sentence. That’s why <b>we’re introducing grammar suggestions in Docs.</b> To solve grammar corrections, we use a unique machine translation-based approach to recognize errors and suggest corrections on the fly. Our AI can catch several different types of corrections, from simple grammatical rules like how to use articles in a sentence (like “a” versus “an”), to more complicated grammatical concepts such as how to use subordinate clauses correctly. Machine learning will help improve this capability over time to detect trickier grammar issues. And because it’s built natively in Docs, it’s highly secure and reliable. Grammar suggestions in Docs is available today in our <a href=\"http://g.co/GrammarEAP\">Early Adopter Program</a>.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"Grammar in Docs - G Suite Next '18\" class=\"article-image--large\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/Spelling-grammar-1280x720.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Beyond writing, we’re also working to improve meetings. Last fall, G Suite launched <a href=\"https://www.blog.google/products/g-suite/meeting-room-g-suite/\">Hangouts Meet hardware</a>, enabling organizations to have reliable, effective video meetings at scale. Many people still view connecting to video meetings as daunting, which is why we’re using Google AI to create a more inviting experience.</p><p>We're excited to see so many people actively engaged with Google Assistant through voice—managing their smart home and entertainment—and today, <b>we’re bringing some of that same magic to conference rooms with voice commands for Hangouts Meet hardware</b>so that teams can connect to a video meeting in seconds. We plan to roll this out to select Meet hardware customers later this year.</p><h3>Simplify work with G Suite</h3><p>One of the reasons why G Suite is able to deliver real transformation to businesses is that it’s simple to use and adopt. G Suite was born in the cloud and built for the cloud, which means real-time collaboration is effortless. This is why more than a billion people rely on G Suite apps like Gmail, Docs, Drive and more in their personal lives. Instead of defaulting to old habits—like saving content on your desktop—G Suite saves your work securely in the cloud and provides a means for teams to push the boundaries of what they create.</p><p>In fact, 74 percent of all time spent in Docs, Sheets and Slides is on collaborative work—that is, multiple people creating and editing content together. This is a stark difference from what businesses see with legacy tools, where the work is often done individually on a desktop client.</p>So that’s how we’re reimagining work. Learn more about these announcements by visiting the <a href=\"https://gsuite.google.com/\">G Suite website</a>—or stay tuned for more updates in G Suite tomorrow.<p><br/></p><p></p><p><i>*The G Suite Trusted Tester and Early Adopter Programs will soon be renamed as Alpha and Beta, respectively. More details to come.</i></p><p></p></div></div></body></html>",
  "pubDate": "Tue, 24 Jul 2018 16:00:00 +0000",
  "guid": "https://blog.google/products/g-suite/work-reimagined-new-ways-to-collaborate-safer-smarter-and-simpler-with-g-suite/",
  "category": [
    "Docs",
    "Gmail",
    "Google Workspace",
    "Google Cloud",
    "Meet",
    "Safety & Security"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Work reimagined: new ways to collaborate safer, smarter and simpler with G Suite",
    "description": "Advances in G Suite to help businesses stay competitive.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Wagtail_CMS.max-600x600.png",
    "site_name": "Google",
    "url": "https://blog.google/products/g-suite/work-reimagined-new-ways-to-collaborate-safer-smarter-and-simpler-with-g-suite/"
  },
  "author": {
    "name": "Prabhakar Raghavan",
    "title": "Vice President of Apps",
    "department": "Google Cloud",
    "company": ""
  }
}