{
  "title": "Robo-Ostrich Sprints to 100-meter World Record",
  "link": "https://spectrum.ieee.org/bipedal-robot-world-record-speed",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-robot-with-two-orange-ostrich-like-legs-and-no-torso-sprints-along-a-running-track.jpg?id=31833360&width=1200&height=400&coordinates=0%2C213%2C0%2C214\"/><br/><br/><p>For a robot that shares a leg design with the fastest-running bird on the planet, we haven’t ever really gotten a sense of how fast <a href=\"https://spectrum.ieee.org/agility-robotics-introduces-cassie-a-dynamic-and-talented-robot-delivery-ostrich\" target=\"_self\">Agility Robotics’ Cassie</a> is actually able to move. <a href=\"https://www.youtube.com/watch?v=a_YGPbWJO5g\" rel=\"noopener noreferrer\" target=\"_blank\">Oregon State University’s Cassie successfully ran a 5k last year</a>, but it was the sort of gait that we’ve come to expect from humanoid robots—more of a jog, really, with measured steps that didn’t inspire a lot of confidence in higher speeds. Turns out, Cassie was just holding back, because she’s just sprinted her way to <a href=\"https://today.oregonstate.edu/news/bipedal-robot-developed-oregon-state-achieves-guinness-world-record-100-meters\" rel=\"noopener noreferrer\" target=\"_blank\">a Guinness World Record for fastest 100-meter run by a bipedal robot</a>.</p><hr/><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"44ce5ed9ae8e165b932b0311254b93a8\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/DdojWYOK0Nc?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n</p><p>Cassie’s average speed was just over 4 meters per second, completing the 100 meters in 24.73 seconds. And for a conventional<sup>1</sup> bipedal robot, that is <em>fast</em>. Moreover, her top speed was certainly higher than 4 m/s, since <a href=\"https://www.guinnessworldrecords.com/world-records/629600-fastest-100-m-by-a-bipedal-robot\" target=\"_blank\">the record attempt required a standing start</a> (along with a return to the starting point without falling over). This is also by far the most ostrichlike I’ve ever seen Cassie move, with a springy birdlike gait. With a feathery costume on, the robot would be a dead ringer for the real bird, and it would give Cassie something to aspire to, since a real ostrich can run the 100-meter in 5 seconds flat. </p><p>This was not an autonomous run, since this version of Cassie has no external sensors, and there was a human with a remote doing the steering. OSU’s Dynamic Robotics Laboratory has been working on <a href=\"https://www.youtube.com/watch?v=Wb0tIWBrjmc\" target=\"_blank\">this kind of dynamic movement</a> for a while, but the sprinting in particular required some extra training in the form of gait optimization in simulation. And according to the researchers, one of the most difficult challenges was actually getting Cassie to reach a sprint from a standing start and then slow down to a stop on the other end without borking herself.</p><p>“This may be the first bipedal robot to learn to run, but it won’t be the last,” Agility Robotics’ Jonathan Hurst said. “I believe control approaches like this are going to be a huge part of the future of robotics. The exciting part of this race is the potential. Using learned policies for robot control is a very new field, and this 100-meter dash is showing better performance than other control methods. I think progress is going to accelerate from here.”</p><p>I certainly hope that this won’t be the last bipedal robot to learn to run, because I would pay money to attend a live bipedal robot race.</p><div class=\"horizontal-rule\"></div><p><sup>1</sup>Arguably, the fastest bipedal legged robot was probably the <a href=\"https://www.youtube.com/watch?v=LTIpdtv_AK8\" rel=\"noopener noreferrer\" target=\"_blank\">OutRunner</a>—depending on what you decide counts as “legged” and “bipedal,” although it would not have qualified for this particular record due to its difficulty with starting and stopping.</p>",
  "pubDate": "Wed, 28 Sep 2022 16:36:30 +0000",
  "guid": "https://spectrum.ieee.org/bipedal-robot-world-record-speed",
  "category": [
    "Agility robotics",
    "Cassie",
    "Bipedal robots",
    "Robotics"
  ],
  "dc:creator": "Evan Ackerman",
  "media:content": ""
}