{
  "title": "Physics-enhanced deep surrogates for PDEs. (arXiv:2111.05841v2 [cs.LG] UPDATED)",
  "link": "http://arxiv.org/abs/2111.05841",
  "description": "<p>We present a ''physics-enhanced deep-surrogate'' (''PEDS'') approach towards\ndeveloping fast surrogate models for complex physical systems, which is\ndescribed by partial differential equations (PDEs) and similar models.\nSpecifically, a unique combination of a low-fidelity, explainable physics\nsimulator and a neural network generator is proposed, which is trained\nend-to-end to globally match the output of an expensive high-fidelity numerical\nsolver. We consider low-fidelity models derived from coarser discretizations\nand/or by simplifying the physical equations, which are several orders of\nmagnitude faster than a high-fidelity ''brute-force'' PDE solver. The neural\nnetwork generates an approximate input, which is adaptively mixed with a\ndownsampled guess and fed into the low-fidelity simulator. In this way, by\nincorporating the limited physical knowledge from the differentiable\nlow-fidelity model ''layer'', we ensure that the conservation laws and\nsymmetries governing the system are respected by the design of our hybrid\nsystem. Experiments on three test problems -- diffusion, reaction-diffusion,\nand electromagnetic scattering models -- show that a PEDS surrogate can be up\nto 3$\\times$ more accurate than a ''black-box'' neural network with limited\ndata ($\\approx 10^3$ training points), and reduces the data needed by at least\na factor of 100 for a target error of $5\\%$, comparable to fabrication\nuncertainty. PEDS even appears to learn with a steeper asymptotic power law\nthan black-box surrogates. In summary, PEDS provides a general, data-driven\nstrategy to bridge the gap between a vast array of simplified physical models\nwith corresponding brute-force numerical solvers, offering accuracy, speed,\ndata efficiency, as well as physical insights into the process.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Pestourie_R/0/1/0/all/0/1\">Rapha&#xeb;l Pestourie</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Mroueh_Y/0/1/0/all/0/1\">Youssef Mroueh</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Rackauckas_C/0/1/0/all/0/1\">Chris Rackauckas</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Das_P/0/1/0/all/0/1\">Payel Das</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Johnson_S/0/1/0/all/0/1\">Steven G. Johnson</a>"
}