{
  "id": "https://bibleinoneyear.org/en/youth/117",
  "title": "Day 117: How to Live a Life of Victory",
  "description": "Psalm 51:10–12,17–18, Joshua 11:23, Luke 24:1–32. ’ The cross was *not* a defeat  On the cross, Jesus won a great victory for us over sin, death and the powers of evil",
  "pubDate": "Wed, 27 Apr 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/117/",
  "itunes:duration": "13:51",
  "guid": "enyouth27042022-117",
  "length": 831.79,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 117: How to Live a Life of Victory",
  "itunes:subtitle": "Psalm 51:10–12,17–18, Joshua 11:23, Luke 24:1–32. ’ The cross was *not* a defeat  On the cross, Jesus won a great victory for us over sin, death and the powers of evil",
  "itunes:summary": "Years ago, a young member of our congregation at HTB had a job working in the library of a major national newspaper. This newspaper kept files of old cuttings about every well-known person. The files were kept in rows of long shelves and were separated into ‘living people’ and ‘dead people’.\nOne day, the young man was looking through the files of dead people and came across a large file marked ‘Jesus Christ’. He glanced over his shoulder to check that no one was looking and quickly moved the file from the ‘dead people’ section to the ‘living people’ section.\nJesus Christ is alive. He is risen from the dead. To anyone looking for him among files of dead people, the angels would say, ‘Why do you look for the living among the dead? He is not here; he has risen!’ (Luke 24:5–6).\nVictory is not a dirty word. Jesus is the great victor. As Bishop Lesslie Newbigin often said, ‘The resurrection is not the reversal of a defeat but the manifestation of a victory.’ The cross was not a defeat. On the cross, Jesus won a great victory for us over sin, death and the powers of evil.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 482
}