{
  "title": "Fighting in Eastern Congo Puts Civilians at Risk, Again",
  "link": "https://www.hrw.org/news/2022/11/01/fighting-eastern-congo-puts-civilians-risk-again",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        Civilians flee fighting between M23 rebels and the Congolese army near Kibumba, North Kivu, eastern Democratic Republic of Congo, October 29, 2022.\n                    © 2022 Moses Sawasawa/AP Photo \n          \n\n  \n<p>Last weekend, M23 rebels captured new territory in the Democratic Republic of Congo’s North Kivu province. Tens of thousands of people fled for safety, adding to an already catastrophic humanitarian situation in eastern Congo.<br /><br />\nThe armed group, which receives direct support from Rwanda, began an offensive on October 20 and took over much of Rutshuru territory, marching into the towns of Rutshuru Center and Kiwanja. Both towns had been harboring many of the 186,000 displaced people who had fled resurgent fighting between M23 and Congolese forces over the past few months. Now many of these people are again on the run.<br /><br />\nIn 2012, Human Rights Watch documented widespread abuses by M23 fighters against civilians, including numerous killings and rapes. The failure of the Congolese and Rwandan authorities to hold the group accountable for past crimes heightens concerns for the safety of civilians now under its control.<br /><br />\nThe M23 was formed in 2012 by Congolese army deserters, themselves former rebels of an armed group called the National Congress for the Defense of the People (CNDP), also backed by Rwanda. After the CNDP seized Kiwanja in 2008, its forces summarily executed dozens of civilians over two days. “We haven’t forgotten the 2008 massacre,” a 44-year-old resident of Kiwanja said recently. “And in 2012, they threw me into a cell, but I had done nothing. Will they target people again?”<br /><br />\nSpeaking at a United Nations briefing last week, United States Ambassador to the UN Robert Wood called “on state actors to stop their support for [armed] groups, including the Rwandan Defense Force’s assistance to M23.”<br /><br />\nRwandan officials denied supporting rebel forces in Congo in 2008 and 2012, and have denied supporting the M23 this year. Instead, the Rwandan government honed in on violence and hate speech against people perceived as Tutsi or Rwandans in Congo, which it blames on the, “collusion between the Congolese armed forces with the Democratic Forces for the Liberation of Rwanda (FDLR),” a largely Rwandan Hutu armed group with some leaders linked to the 1994 Rwanda genocide. Collusion this year between the FDLR and the Congolese army, which Human Rights Watch documented, does not justify Rwanda supporting the abusive M23.<br /><br />\nThe African Union is calling for dialogue. Any regional agreement is going to need to address the protection and humanitarian concerns of affected civilians. It is critical to ensure that those responsible for past atrocities, whether committed by the M23 or other armed groups, or government armed forces, are brought to justice. Otherwise, the population’s plight is unlikely to change.</p>",
  "pubDate": "Tue, 01 Nov 2022 01:00:00 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/01/fighting-eastern-congo-puts-civilians-risk-again"
}