{
  "id": "https://bibleinoneyear.org/en/youth/271",
  "title": "Day 271: Seven Life-Changing Habits",
  "description": "Psalm 114:1-8, Nahum 1:7-15, Ephesians 6:10–20.  As St Paul puts it, ‘Our struggle is not against flesh and blood, but against the rulers, against the authorities, against the powers of this dark world and against the *spiritual forces of evil* in the heavenly realms’ (Ephesians 6:12) Today’s passages show us that the battle is won through the victorious power of the Lord",
  "pubDate": "Wed, 28 Sep 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/271/",
  "itunes:duration": "15:01",
  "guid": "enyouth28092022-271",
  "length": 901.62,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 271: Seven Life-Changing Habits",
  "itunes:subtitle": "Psalm 114:1-8, Nahum 1:7-15, Ephesians 6:10–20.  As St Paul puts it, ‘Our struggle is not against flesh and blood, but against the rulers, against the authorities, against the powers of this dark world and against the *spiritual forces of evil* in the heavenly realms’ (Ephesians 6:12) Today’s passages show us that the battle is won through the victorious power of the Lord",
  "itunes:summary": "For many years, Bruce Streather, a successful lawyer, was an atheist. He never went to church, even though his family did. Most weekends he played golf. Eventually, as a result of considerable persuasion from his wife and three teenage daughters, he came on Alpha. He was extremely argumentative and hostile. None of the sessions had any impact on him until, towards the end of the course, he heard the talk ‘How Can I Resist Evil?’ Afterwards he came up to me and said, ‘In my work as a lawyer, I have seen so much evil. I have always believed in the power of evil. Tonight, it struck me that if there is a power of evil, it makes sense to believe that there is also a power of good.’\nThat night Bruce became a Christian. Ever since, he has been a committed member of the church with a very powerful and effective ministry affecting the lives of hundreds of people.\nWe struggle against the global evils of terrorism, racial injustice, the tragic plight of refugees, deadly viruses (such as COVID-19), starvation, poverty, the destruction of the environment, corrupt governments and countless other domestic, local and international issues. We also face struggles against evil in our own lives – temptation, sin and addiction.\nThe Bible is realistic about this struggle. In the Old Testament, we read about physical battles against the forces of evil. In the New Testament, the struggle is more often described as a spiritual battle. As St Paul puts it, ‘Our struggle is not against flesh and blood, but against the rulers, against the authorities, against the powers of this dark world and against the spiritual forces of evil in the heavenly realms’ (Ephesians 6:12).\nToday’s passages show us that the battle is won through the victorious power of the Lord.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 636
}