{
  "title": "This Startup Builds USVs That Collect Data About Oceans",
  "link": "https://spectrum.ieee.org/julie-angus-profile",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-woman-standing-on-a-vessel-in-front-of-a-red-circular-object-with-instruments-on-the-bottom-of-it.png?id=30091129&width=1200&height=800&coordinates=0%2C0%2C0%2C1\"/><br/><br/><p>Because most of the ocean’s vast area is far from land, it can be dangerous and expensive for crewed vessels to conduct research expeditions. This spurred Julie Angus to cofound the startup <a href=\"https://openoceanrobotics.com\" rel=\"noopener noreferrer\" target=\"_blank\">Open Ocean Robotics</a> to design, build, and operate oceangoing uncrewed surface vehicle (USV) drones. She is the company’s CEO.</p><p>“Our planet’s oceans are full of information that can help us protect at-risk marine life, allow ships to select more fuel-efficient routes, crack down on illegal fishing, better understand the impacts of climate change, and more,” Angus says. The IEEE member also belongs to the <a href=\"https://ieeeoes.org\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Oceanic Engineering Society</a>.</p><hr/><p>The startup offers marine data as a service using its solar-powered<a href=\"https://openoceanrobotics.com/dataxplorer\" rel=\"noopener noreferrer\" target=\"_blank\"> Data Xplorer</a> ocean drones, which eliminate the need for traditional crewed vessels. They can travel for months at a time collecting ocean and environmental data. </p><p>“Our team will help you plan the mission and execute it from start to finish,” she says.</p><p>The company designs and builds the drone’s hull, deck, and circuit boards. There is a patent pending on the self-righting roll-bar system. The drone is equipped with electro-optical and infrared cameras. Its <a href=\"https://www.newventuresbc.com/wp-content/uploads/2019/07/DataXplorer.png\" rel=\"noopener noreferrer\" target=\"_blank\">sensors</a> include hydrophones that can listen to marine life, as well as environmental sensors to measure water temperature, salinity, turbidity, and weather conditions. The USV weighs just over 100 kilograms, and its motor propels it at up to 33.3 kilometers per hour.</p><p>“We have 360-degree video streaming, so the operator can use a joystick to remotely drive the boat,” Angus says. “Otherwise, our command-and-control portal can program a vehicle for autonomous activity, such as uploading a route [for] doing a grid survey.” Thanks to the combination of solar cells and lithium batteries, she says, “our boats can operate and travel nonstop for months, without needing refueling or external recharging.”</p><p>Open Ocean Robotics has received several awards and recognitions, including being named a 2019 <a href=\"https://entrepreneurship.ieee.org/entrepreneurship-stars-2019/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE N3XT Star</a>. The N3XT program showcases engineering-driven founders and entrepreneurial topics. </p><p>The company began in the Anguses’ garage on Vancouver Island, B.C., Canada, in 2018. The following year, the company moved to the <a href=\"https://vitp.ca/\" rel=\"noopener noreferrer\" target=\"_blank\">Vancouver Island Technology Park</a> research and tech center. Today, Open Ocean has more than two dozen full-time employees, plus contractors and part-time staff, bringing the total to just over 30. The company has received more than US $5 million in funding.</p><p>Angus knows firsthand about how challenging the ocean can be. Her water expeditions throughout the world include five months during 2005 and 2006, when she and her husband rowed from Portugal to Costa Rica. It was the first time a woman had rowed across the Atlantic Ocean from mainland to mainland. In 2009, the couple cofounded <a href=\"http://www.angusrowboats.com\" rel=\"noopener noreferrer\" target=\"_blank\">Angus Rowboats</a>, which manufactures rowboats and creates sailboat kits and plans for the recreational market.</p><p class=\"pull-quote\">“Our boats can operate and travel nonstop for months, without needing refueling or external recharging.”</p><p>Angus also brings an academic perspective to her ponderings of the deep. She has a bachelor’s degree in biology and psychology from <a href=\"https://www.mcmaster.ca/\" rel=\"noopener noreferrer\" target=\"_blank\">McMaster University</a>, in Hamilton, Ont., Canada, and a master’s degree in molecular biology from the <a href=\"https://www.uvic.ca/\" rel=\"noopener noreferrer\" target=\"_blank\">University of Victoria</a>, in British Columbia. </p><p> As of June, Open Ocean Robotics had three Data Xplorers in service, and two more nearly completed. It plans to start manufacturing another 10 later this year. </p><p>“We are still primarily doing pilot projects in both Canada and the United States, but we are transitioning into more recurring-revenue contracts,” Angus says.</p><p>The startup is eager for new technology such as smaller base stations for low Earth orbit communication satellites when its USV can’t get cellular service. The company also plans to invest in continued advancements in photovoltaic cells and in power storage—and smaller, more energy-efficient sensors.</p><p>Although Open Ocean is committed to its maritime focus, “we are not necessarily limiting ourselves to surface vehicles,” Angus says. “I can also imagine having aerial drones or underwater vehicles as part of our data-collection services. For us, the goal is data collection, helping to build an Internet of Things for the sea.”</p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"d888d493d28b8edc048bbc2e91496bf0\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/eKUQoOPSzFY?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Data Xplorer</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">\n<a href=\"https://www.youtube.com/watch?v=eKUQoOPSzFY\" target=\"_blank\">www.youtube.com</a>\n</small>\n</p><p><em>This article appears in the August 2022 print issue as “Julie Angus.”</em></p>",
  "pubDate": "Thu, 14 Jul 2022 18:06:48 +0000",
  "guid": "https://spectrum.ieee.org/julie-angus-profile",
  "category": [
    "Careers",
    "Drone",
    "Profiles",
    "Robotics",
    "Startups",
    "Type:departments",
    "Uncrewed surface vehicle"
  ],
  "dc:creator": "Daniel P. Dern",
  "media:content": ""
}