{
  "title": "A shocking true crime story is revealed in A Friend of the Family: True Evil",
  "link": "https://www.digitaltrends.com/movies/jan-broberg-faces-the-past-in-a-friend-of-the-family-true-evil/",
  "pubDate": "Fri, 04 Nov 2022 14:15:20 +0000",
  "dc:creator": "Blair Marnell",
  "category": [
    "Movies & TV",
    "News",
    "A Friend of the Family",
    "A Friend of the Family: True Evil",
    "peacock",
    "Streaming",
    "TV"
  ],
  "guid": "https://www.digitaltrends.com/?p=3219898",
  "description": "Kidnapping victim Jan Broberg opens up about her past and discovers another victim in Peacock's trailer for A Friend of the Family: True Evil.",
  "content:encoded": "<p>Peacock&#8217;s <a href=\"https://www.digitaltrends.com/movies/a-friend-of-the-family-trailer/\"><em>A Friend of the Family</em></a> miniseries is currently dramatizing the story of Jan Broberg, a woman who was abducted twice: Once when she was 12, and again when she was 14 years old. The man who took Jan was not a stranger to her or her parents. His name was Robert Berchtold, and he was the titular &#8220;friend of the family.&#8221; While the miniseries still has a few episodes left before the finale on November 10, the real Jan Broberg is confronting that dark period in her life in Peacock&#8217;s upcoming companion documentary, <em>A Friend of the Family: True Evil</em>.</p>\n<iframe src=\"https://www.youtube.com/embed/jQ2n3A3mwVg\" width=\"640\" height=\"360\"></iframe>\n<p>In the trailer above, Broberg touches upon one of the most shocking aspects of her story: Berchtold was sexually intimate with both of Broberg&#8217;s parents. But this sexual predator also set his sights on Broberg when she was just a child, and he attempted to brainwash her while abusing her and taking her away from her family twice. It&#8217;s a horrific experience to relive even decades later; yet, perhaps the cruelest twist is that Broberg wasn&#8217;t Berchold&#8217;s only victim.</p>\n<figure class=\"alignnone\"><img  class=\" size-large wp-image-3219902\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/A-Friend-of-the-Family-True-Evil-Trailer.jpg?fit=720%2C405&p=1\" alt=\"Jan Broberg in A Friend of the Family True Evil.\"   /></figure>\n<p>The name of Berchtold&#8217;s other victim isn&#8217;t mentioned in the trailer, but she is seen speaking with Broberg as they attempt to come to terms with what happened to them when they were children. It&#8217;s not a happy story by any stretch of the imagination, yet through this tragedy, Broberg and her family have endured and found a purpose by exposing the evil things that were done to her.</p>\n<p><em>A Friend of the Family: True Evil</em> will premiere on Peacock on November 15.</p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2022/11/A-Friend-of-the-Family-True-Evil-Trailer.jpg?p=1",
  "enclosure": "",
  "post-id": 3219898
}