{
  "title": "My Mom Died on Saturday",
  "link": "https://danielmiessler.com/blog/my-mom-died-on-saturday/",
  "dc:creator": "Daniel Miessler",
  "pubDate": "Mon, 19 Sep 2022 05:10:33 +0000",
  "category": "Personal",
  "guid": "https://danielmiessler.com/?p=138217",
  "description": "My mom died on Saturday. My biological mother became unable to function when I was around five due to mental illness, which left my dad and me on our own. Sometime after we were blessed with a strong, beautiful soul named Rhonda. My dad and I were like rescue dogs, and she saved us. She brought so much&#8230;",
  "content:encoded": "<p><img decoding=\"async\" loading=\"lazy\" src=\"https://danielmiessler.com/images/mom2.png\" alt=\"RhondaMiessler\" width=\"650\" height=\"689\" class=\"aligncenter size-full wp-image-138224\" /></p>\n\n<p>My mom died on Saturday.</p>\n\n<p>My biological mother became unable to function when I was around five due to mental illness, which left my dad and me on our own. Sometime after we were blessed with a strong, beautiful soul named Rhonda.</p>\n\n<p>My dad and I were like rescue dogs, and she saved us. She brought so much love into what was a hard, matter-of-fact relationship between my dad and I. She taught him to be kinder with me, and with himself. And she spent her whole life helping me to open up about about my own internal life.</p>\n\n<p>She stayed on me about homework and school, and there is zero doubt in my mind that I would not have graduated high-school were it not for her.</p>\n\n<p>She had a tremendous talent for listening to people, and it was only around 5 years ago that I realized my enjoyment of helping people came from her. During one conversation she was talking about how people are just struggling through life, and why we need to help them get through it.</p>\n\n<p><img decoding=\"async\" loading=\"lazy\" src=\"https://danielmiessler.com/images/mom3.png\" alt=\"mom3\" width=\"650\" height=\"431\" class=\"aligncenter size-full wp-image-138226\" /></p>\n\n<p>My daft self was like, &#8220;Wow, we&#8217;re so similar in that way!&#8221; It wasn&#8217;t until days later that I realized we didn&#8217;t arrive at this independently, but rather that <em>I learned it from her</em>. She loved talking to and helping people, and she passed some of that to me.</p>\n\n<p>People have been coming around randomly, after hearing the news, talking bout how easy it was to talk to her, and how much she helped them. It was sweet and beautiful to hear.</p>\n\n<p>She died of an aggressive type of cancer that was supposed to take her within weeks or months, that had no chance of remission. But the diagnosis was back in 2020, and the oncologists were able to give us a miraculous extra two years with her. I am forever thankful to them for that time.</p>\n\n<p>She died peacefully in her sleep, with my dad sleeping next to her.</p>\n\n<p>I will miss her.</p>\n"
}