{
  "title": "Join the Women of Publishing webinar series",
  "link": "https://blog.google/products/adsense/join-women-publishing-webinar-series/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>With our third annual <a href=\"https://events.withgoogle.com/womenofpublishing2021/\">2021 Women of Publishing Leadership Series</a>, we're<b> </b>eager to accelerate the growth of women-led small-medium publishing businesses and create an international community. The annual program registration is now open, so apply by Sunday, March 7 to join us for our exclusive livestream sessions. </p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>What you can expect</h3><p>On March 16, the Women of Publishing Leadership Series is bringing together female entrepreneurs and leaders, who have successfully funded their passions through monetization platforms using Google AdMob or Google AdSense. Carrying the spirit of International Women's Day, the first online session kicks off on March 16. </p><p>This two-day virtual event (March 16-17) will teach you how Google tools can help fuel your business growth, share data-driven monetization tactics for web and apps and enable connections with other women. The sessions will also include discussions on sustaining momentum in this fast-paced and evolving digital ecosystem.</p><p>The program is designed to help participants learn how to maximize the value of their publishing business and earn more revenue. The curriculum is tailored for small and medium-sized businesses. Women from all types of digital backgrounds: apps, news, gaming, entertainment, video, e-commerce, etc. are encouraged to apply. New to Google's monetization platforms? We'd love for you to join and learn about how we can partner with you and grow your online business.</p><p>Applications close on March 7, 2021. Join the 2021 Women of Publishing community <a href=\"https://events.withgoogle.com/womenofpublishing2021/\"><b>by applying on our website</b></a>..</p><p></p><p></p><p></p></div></div></body></html>",
  "pubDate": "Tue, 16 Feb 2021 17:00:00 +0000",
  "guid": "https://blog.google/products/adsense/join-women-publishing-webinar-series/",
  "category": [
    "Education",
    "AdSense",
    "AdMob",
    "Diversity and Inclusion"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Join the Women of Publishing webinar series",
    "description": "This masterclass is an opportunity for women leaders to enhance their business’ digital strategy through an exclusive series.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/213-GAD-WomensPublishing-BLOGHEADER-NK_7JRurUA.gif",
    "site_name": "Google",
    "url": "https://blog.google/products/adsense/join-women-publishing-webinar-series/"
  },
  "author": [
    {
      "name": "Nicole Salcido",
      "title": "Administrative Business Partner",
      "department": "",
      "company": ""
    },
    {
      "name": "Paola Guevara",
      "title": "Partner Experience Specialist",
      "department": "",
      "company": ""
    }
  ]
}