{
  "title": "7: Episode 7",
  "link": "https://audioboom.com/posts/7316365",
  "itunes:episode": 7,
  "itunes:title": "Episode 7",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3837,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On our September 18th, 2005 edition of MuggleCast…<br>\n<br>\n\n</div>\n<div>Did Draco have a different task? Did Dumbledore have an Unbreakable Vow? Who ordered the removal of ‘the truth’ about R.A.B. from the Harry Potter Lexicon? Plus, while JK Rowling squares off against eBay, various Potter sites team up to support the victims of Hurricane Katrina. We’ll even tell you the Top 13 Reasons You Know You Listen To MuggleCast.<br>\n<br>\n\n</div>\n<div>From yelling out spells to making up words… all that and more ahead with Andrew, Ben, Eric, John (TLC), and Melissa (TLC) on this week’s edition of MuggleCast.<br>\n<br>\n\n</div>\n<ul>\n<li>Micah reports from the brand new New York City news center</li>\n<li>Top 13 Reasons You Know You Listen to MuggleCast When…</li>\n<li>Spy on Spartz is back!</li>\n<li>Who’s at fault in the JK Rowling vs. eBay battle?</li>\n<li>Will eBay’s purchase of Skype help prevent these occurrences happen in the future?</li>\n<li>Reminder to Andrew: Melissa wants to talk about ‘the deal’ after recording</li>\n<li>An update on Potter Fans for Katrina</li>\n<li>Big props to HPANA for helping promoting</li>\n<li>We preview the new Goblet of Fire Lego sets with Joe of <a href=\"http://MillionairePlayboy.com\">MillionairePlayboy.com</a>\n</li>\n<li>“<em>CRUCIO</em>!” cries Ben</li>\n<li>Does the Potions book have any significance hidden in the Room of Requirement in HP7?</li>\n<li>John invents a new plural form of ‘Horcrux’: ‘Horcri’</li>\n<li>Why did Dumbledore drop out so easily?</li>\n<li>What happened with the “RAB” revelation on the HP Lexicon?</li>\n<li>Malfoy chosen to get the Death Eaters in the castle?</li>\n<li>We cover more Unbreakable Vow theories.</li>\n<li>Check out this EXCELLENT <a href=\"http://www.mugglenet.com/mugglecast/arounddesk.jpg\">piece of fanart</a>. Thanks to “Emerson Lover” Mamatha!</li>\n</ul>\n",
  "pubDate": "Sun, 18 Sep 2005 00:00:00 +0000",
  "guid": "tag:audioboom.com,2019-07-15:/posts/7316365",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}