{
  "title": "526: In Defense of Slytherin House",
  "link": "https://audioboom.com/posts/7925002",
  "itunes:episode": 526,
  "itunes:title": "In Defense of Slytherin House",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4843,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Welcome Tylor, President of the Wizarding World-inspired animal rights nonprofit, <a href=\"https://www.protegofoundation.org/\">The Protego Foundation</a>, and co-host of <a href=\"https://www.thechickpeeps.com/\">The ChickPeeps</a> podcast with Evanna Lynch!</li>\n<li>Who is Tylor's favorite character? The answer may shock you (but is perfect for this episode)!</li>\n<li>Main Discussion: In Defense of Slytherin House</li>\n<li>What do we make of the first words revealed to us by the Sorting Hat about Salazar Slytherin? Does this introduction mislead us?</li>\n<li>Is there an argument to be made that Slytherin’s preference for pure-blood students could have been due to muggle persecution of wizardry? </li>\n<li>Andrew shares why he converted to Slytherin House</li>\n<li>How much of Salazar Slytherin’s legacy should be used against current members of his house?</li>\n<li>The Slytherin Spectrum: we rate notable members of Slytherin House, including Merlin, Severus Snape, Regulus Black, Leta Lestrange, Dolores Umbridge, Horace Slughorn and more!</li>\n<li>Which characters are still down with Slytherin's pure-blood mania? Which are on the right side of history, but may have some ingrained blood status bias?</li>\n<li>Each hosts says something nice about Slytherin House and listeners give their thoughts!</li>\n<li>Quizzitch: What living creature are both Marvolo Gaunt and Salazar Slytherin compared to, in appearance? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, including our new physical gifts! Also access to our recording studio, Bonus MuggleCast, a personalized thank you video from one of the hosts and more!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 17 Aug 2021 08:00:00 +0000",
  "guid": "tag:audioboom.com,2021-08-16:/posts/7925002",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}