{
  "title": "S14 Ep22: David Bowie, UFOs, Witchcraft: The Occult Saga of Walli Elmlark",
  "link": "https://audioboom.com/posts/8098608",
  "itunes:episode": 22,
  "itunes:title": "David Bowie, UFOs, Witchcraft: The Occult Saga of Walli Elmlark",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5353,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS goes on a psychedelic ride, David Bowie, UFOs, Witchcraft: The Occult Saga of Walli Elmlark - The \"Rock and Roll\" Witch of New York with Timothy Beckley.<br>\n<br>\nThis is the compelling story of the Wiccan lady Walli Elmlark who saved the life of David Bowie through witchcraft, and put a spell on pop stars and other high profile celebrities during the most dynamic period in rock music – the 1970s.<br>\n<br>\nGet the book here: <a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nPLUS:  Dave gets down to the real story of his haunted hospital stay on Theater of the Mind<br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nDigestive troubles? \tWeight gain?\tLow energy?\tAchy Joints?<br>\nIf you’ve been struggling with any of these, Dr. Steven Gundry says you’re not alone<br>\nAnd he knows the real cause! Watch the free video at <a href=\"http://totalrestore2.com\">totalrestore2.com</a> to find out more! <br>\n<br>\nHas life piled on the anxiety to an overwhelming crescendo? Sunday Scaries can give you relief! Sunday Scaries are CBD Gummies custom formulated with a 10mg of blend of broad spectrum and isolate CBD as well as vitamins B12 and D3 for mood boosters. They are made with natural ingredients and are free of gluten, dairy, yeast, egg, soy and peanuts. Get 10 percent off and free shipping  at <a href=\"http://sundayscaries.com\">sundayscaries.com</a> and use the code word DARKNESS .",
  "itunes:summary": "BEYOND the DARKNESS goes on a psychedelic ride, David Bowie, UFOs, Witchcraft: The Occult Saga of Walli Elmlark - The \"Rock and Roll\" Witch of New York with Timothy Beckley.\n\nThis is the compelling story of the Wiccan lady Walli...",
  "pubDate": "Sun, 17 Mar 2019 05:00:00 +0000",
  "guid": "1e2e39a5-af46-44f6-9850-5a15a32b6a8a",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}