{
  "title": "Episode 32: &#8220;I Got A Woman&#8221; by Ray Charles",
  "link": "https://500songs.com/podcast/episode-32-i-got-a-woman-by-ray-charles/",
  "pubDate": "Mon, 13 May 2019 04:15:59 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-32-i-got-a-woman-by-ray-charles/",
  "description": "Welcome to episode thirty-two of <em>A History of Rock Music in Five Hundred Songs</em>. This one looks at \"I Got A Woman\" by Ray Charles. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-32-i-got-a-woman/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nFor more on Charles Brown and Nat Cole, Patreon backers might want to listen to <a href=\"https://www.patreon.com/posts/23406506\">the Christmas Patreon-only episode</a>.\n\nMost of the information here comes from Charles' autobiography, <a href=\"https://amzn.to/2JhC7TO\"><em>Brother Ray</em></a>, which gives a very clear view of his character, possibly not always in the ways he intended.\n\nAll the Ray Charles music used in this podcast, and the Guitar Slim track, are on <a href=\"https://amzn.to/2JeTlRP\"><em>The Complete Swing Time and Atlantic Recordings</em></a>. Charles' work from 1955 through about 1965 covers more genres of American music than any other body of work I can think of, and does so wonderfully.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nLet's talk about melisma.\n\nOne of the major things that you'll notice about the singers we've covered so far is that most of them sound very different from anyone who's been successful as a pure vocalist in the last few decades. There's a reason for that.\n\nAmong the pop songwriters of the thirties, forties, and fifties -- not the writers of blues and country music so much, but the people writing Broadway musicals and the repertoire the crooners were singing -- melisma was absolutely anathema.\n\nMelisma is a technical musical term, but it has a simple meaning -- it's when you sing multiple notes to the same syllable of lyric. This is something that has always existed since people started singing -- for example, at the start of \"The Star-Spangled Banner\", \"Oh say...\", there are two notes on the syllable \"oh\". That's melisma.\n\nBut among the songwriters who were registered with ASCAP in the middle of the last century, there was a strongly-held view that this was pure laziness. You wrote one syllable of lyric for one note of melody, and if you didn't, you were doing something wrong. The lyricist Sammy Cahn used to talk about how he wrote the lyric to \"Pocketful of Miracles\" -- \"Practicality doesn't interest me\" -- but then the composer wrote a melody with one more note per line than he'd written syllables for the lyric. Rather than let the song contain melisma, he did this:\n\n[Excerpt: Frank Sinatra, \"Pocketful of Miracles\", with Sinatra singing \"pee-racticality dee-oesn't interest me\"]\n\nThat was the kind of thing songwriters would do to avoid even the hint of melisma. And singers were the same. If you listen to any of the great voices of the first part of the twentieth century -- Sinatra, Bing Crosby, Tony Bennett -- they will almost without exception hit the note dead on, one note per syllable. No ornamentation, no frills. There were a few outliers -- Billie Holiday and Ella Fitzgerald, for example, would both use a little melisma (Holiday more than Ella) to ornament their sound -- but generally that was what good singing *was*. You sang the notes, one note per syllable.\n\nAnd this was largely the case in the blues, as well as in the more upmarket styles. The rules weren't stuck to quite as firmly there, but still, you'd mostly sing the song as it was written, and it would largely be written without melisma.\n\nThere was one area where that was not the case – gospel, specifically black gospel.\n\n[Excerpt: Rosetta Tharpe, \"Precious Lord, Take My Hand\"]\n\nWe looked at gospel already, of course, but we didn't talk about this particular characteristic of the music. You see, in black gospel -- and pretty much only in black gospel music, at the time we're talking about -- the use of melisma was how you conveyed emotion. You ornamented the notes, you'd sing more notes per syllable, and that was how you showed how moved you were by the spirit.\n\nAnd these days, that style is what people now think of as good or impressive singing. There are a *lot* of class and race issues around taste in this that I'm not going to unpick here -- we've got a whole four hundred and sixty-eight more episodes in which to discuss these things, after all -- but when you hear someone on The Voice or American Idol or The X Factor trying to impress with their vocals, it's their command of melisma they're trying to impress with. The more they can ornament the notes, the more they fit today's standards of good singing.\n\nAnd that changed because, in the 1950s, there was a stream of black singers who came out of the gospel tradition and introduced its techniques into pop music.\n\nBefore talking about that, it's worth talking about the musical boundaries we're going to be using in this series, because while it's called \"A History of Rock Music in 500 Songs\", I am not planning on using a narrow definition of \"rock music\", because what counts as rock tends to be retroactively redefined to exclude branches of music where black people predominate. So for example, there's footage of Mohammed Ali calling Sam Cooke \"the greatest rock and roll singer in the world\", and at the time absolutely nobody would have questioned Cooke being called \"rock and roll\", but these days he would only be talked about as a soul singer.\n\nAnd much of the music that we would now call \"soul\" was so influential on the music that we now call rock music that it's completely ridiculous to even consider them separately until the late seventies at the earliest. So while we're going to mostly look at music that has been labelled rock or rock and roll, don't be surprised to find soul, funk, hip-hop, country, or any other genre that has influenced rock turning up. And especially don't be surprised to see that happening if it was music that was thought of as rock and roll at the time, but has been retroactively relabelled.\n\nSo today, we're going to talk about a record that's been widely credited as the first soul record, but which was released as rock and roll. And we're going to talk about a musician who cut across all the boundaries that anyone tries to put on music, a man who was equally at home in soul, jazz, R&B, country, and rock and roll. We're going to talk about the great Ray Charles.\n\n[Excerpt: Ray Charles, “I Got a Woman”]\n\nRay Charles had an unusual upbringing -- though perhaps one that's not as unusual as people would like to think. As far as I can tell from his autobiography, he was the product of what we would now call a polyamorous relationship. His father was largely absent, but he was brought up by his mother, who he called \"Mama\", and by his father's wife, who he called \"Mother\". Both women knew of, approved of, and liked each other, as far as young Ray was concerned.\n\nHis given name was Ray Charles Robinson, but he changed it when he became a professional musician, due to the popularity of the boxer Sugar Ray Robinson, whose peak years were around the same time as Charles' -- he didn't want to be confused with another, more famous, Ray Robinson. From a very young age, he was fascinated by the piano, and that fascination intensified when, before he reached adolescence, he became totally blind.\n\nThat blindness would shape his life, even though -- and perhaps because -- he had a strong sense of independence. He wasn't going to let his disability define him, and he often said that the three things that he didn't want were a dog, a cane, and a guitar, because they were the things all blind men had.\n\nNow, I want to make it very clear that I'm not talking here about the rights and wrongs of Charles' own attitude to his disability. I'm disabled myself, but his disability is not mine, and he is from another generation. I'm just stating what that attitude was, and how it affected his life and career. And the main thing it did was make him even more fiercely independent. He not only got about on his own without a cane or a dog, he also at one point even used to go riding a motorbike by himself.\n\nOther than his independence, the main thing everyone noted about the young Ray Charles Robinson was his proficiency on the piano, and by his late teens he was playing great jazz piano, inspired by Art Tatum, who like Ray was blind. Tatum was such a proficient pianist that there is a term in computational musicology, the tatum, meaning \"the smallest time interval between successive notes in a rhythmic phrase\".\n\n[Excerpt; Art Tatum, \"I Wish I Were Twins\"]\n\nCharles never got quite that good, but he was inspired by Tatum's musicality, and he became a serious student of the instrument, becoming a very respectable jazz pianist.\n\nWhen his mother died, when he was fifteen, Charles decided to leave school and set up on his own as a musician. Initially, he toured only round Georgia and Florida, and early on he made a handful of records. His very earliest recordings, oddly, sound a lot like his mature style -- his first record, \"Wondering and Wondering\", was almost fully-formed mature Ray Charles:\n\n[Excerpt: Ray Charles, \"Wondering and Wondering\"]\n\nBut he soon changed his style to be more popular. He moved to the West Coast, and unsuccessfully auditioned to play piano with Lucky Millinder's band, and would occasionally play jazz with Bumps Blackwell and Dizzy Gillespie. But while his association with Bumps Blackwell would continue long into the future, playing jazz wasn't how Ray Charles was going to make his name.\n\nOn the West Coast in the late forties and early fifties, the most popular style for black musicians was a particular kind of smooth blues, incorporating aspects of crooning alongside blues and jazz. Two of the biggest groups in the R&B field were the Nat \"King\" Cole Trio and Johnny Moore's Three Blazers featuring Charles Brown. Both of these had very similar styles, featuring a piano player who sang smooth blues, with an electric guitarist and a bass player, and sometimes a drummer.\n\nWe've heard Nat \"King\" Cole before, playing piano with Les Paul and Illinois Jacquet, but it's still hard for modern listeners to remember that before his massive pop success with ballads like \"Unforgettable\", Cole was making music which may not have been quite as successful commercially, but which was incredibly influential on the burgeoning rock music field.\n\nA typical example of the style is Cole's version of \"Route Sixty-Six\":\n\n[Excerpt: Nat \"King\" Cole Trio, \"Route Sixty Six\"]\n\nYou'll note, I hope, the similarity to the early recordings by the Chuck Berry Trio in particular -- Berry would often say that while Louis Jordan music was the music he would play to try to make a living, Nat \"King\" Cole was the musician he most liked to listen to, and the Chuck Berry Trio was clearly an attempt to emulate this style.\n\nThe other group I mentioned, The Three Blazers, were very much in the same style as the Nat Cole Trio, but were a couple of rungs down the entertainment ladder, and Charles Brown, their singer, would be another huge influence on Ray Charles early on. Charles formed his own trio, the McSon Trio (the \"Son\" came from the Robinson in his own name, the \"Mc\" from the guitarist's name).\n\n[Excerpt: The McSon Trio \"Don't Put All Your Dreams In One Basket\"]\n\nThe McSon Trio quickly changed their name to the Ray Charles Trio, as their pianist and singer became the obvious star of the show.\n\nCharles soon tired of running his own trio, though, and went fully solo, travelling to gigs on his own and working with local pickup bands rather than having his own steady musicians. This also gave him the opportunity to collaborate with a wider variety of other musicians than having a fixed band would.\n\nAround this time Charles was introduced by Bumps Blackwell to Quincy Jones, with whom he would go on to collaborate in various ways for much of the rest of his career. But his most important collaboration in his early career was with the blues musician Lowell Fulson. Fulson was one of the pioneers of the smooth West Coast blues sound, and Charles became his pianist and musical director for a short time. Charles didn't perform on many of Fulson's sessions, but you can get an idea of the kind of thing that he would have been playing with Fulson from Fulson's biggest record, \"Reconsider Baby\", which came out shortly after Charles' time with Fulson:\n\n[Excerpt: Lowell Fulson, \"Reconsider Baby\"]\n\nSo Charles was splitting his time between making his own Nat Cole or Charles Brown style records, touring on his own, and touring with Fulson. He also worked on other records for other musicians. The most notable of these was a blues classic, by another of the greats of West Coast blues, \"The Things That I Used To Do\" by Guitar Slim.\n\n[Excerpt: \"The Things That I Used To Do\" by Guitar Slim]\n\nSlim was one of the great blues guitarists of the 1950s, and he was also one of the great showmen, whose performance style included things like a guitar cord that was allegedly three hundred and fifty feet long, so he could keep his guitar plugged into the amplifier but walk through the crowd and even out into the street, while still playing his guitar. Slim would later be a huge influence on musicians like Jimi Hendrix, but \"The Things That I Used To Do\", his most famous record, is as much Charles' record as it is Guitar Slim's -- Charles produced, arranged, and played piano, and the result sounds far more like the work that Charles was doing at the time than it does Guitar Slim's other work, though it still has Slim's recognisable guitar sound.\n\nHe finally got the opportunity to stand out when he moved from Swing Time to Atlantic Records. While several of the Swing Time recordings were minor successes, people kept telling him how much he sounded like Nat Cole or Charles Brown. But he realised that it was unlikely that anyone was telling Nat Cole or Charles Brown how much they sounded like Ray Charles, and that he would never be in the first rank of musicians unless he got a style that was uniquely his.\n\nEverything changed with \"Mess Around\", which was his first major venture into the Atlantic house style. \"Mess Around\" is credited to Ahmet Ertegun, the owner of Atlantic Records, as the writer, but it should really be credited as a traditional song arranged by Ray Charles, Jesse Stone, and Ertegun. Ertegun did contribute to the songwriting -- rather surprisingly, given the habit of record executives of just taking credit for something that they had nothing to do with. Ertegun told Charles to play some piano in the style of Pete Johnson, and Charles responded by playing \"Cow Cow Blues\", a 1928 song by Cow Cow Davenport:\n\n[Excerpt: Cow Cow Davenport, \"Cow Cow Blues\"]\n\nErtegun came up with some new words for that, mostly based around traditional floating lyrics. Jesse Stone came up with an arrangement, and the result was titled \"Mess Around\":\n\n[Excerpt: Ray Charles and his Orchestra, \"Mess Around\"]\n\nFor his next few records, Charles was one of many artists making records with the standard Atlantic musicians and arrangers -- the same people who were making records with Ruth Brown or LaVern Baker. By this point, he had gained enough confidence in the studio that he was able to sing like himself, not like Charles Brown or Nat Cole or anyone else. The music he was making was generic R&B, but it didn't sound like anyone else at all:\n\n[Excerpt: Ray Charles, \"It Should Have Been Me\"]\n\n\"Mess Around\" and \"It Should Have Been Me\" were Charles' two biggest hits to date, both making the top five on the R&B charts. His breakout, though, came with a song that he based around a gospel song. At this time, gospel music was not much of an influence on most of the rhythm and blues records that were charting, but as Charles would later say, \"the church was something which couldn’t be taken out of my voice even if I had wanted to take it out. Once I decided to be natural, I was gone. It’s like Aretha: She could do “Stardust,” but if she did her thing on it, you’d hear the church all over the place.\"\n\nCharles had now formed his own band, which was strongly influenced by Count Basie. The Count Basie band was, like Lionel Hampton's, one of the bands that had most influenced early R&B, and its music was exactly the kind of combination of jump band and classy jazz that Charles liked:\n\n[Excerpt: Count Basie, \"One O'Clock Jump\"]\n\nCharles' own band was modelled on the Basie band, though slimmed down because of the practicalities of touring with a big band in the fifties. He had three sax players, piano, bass, drums, two trumpets, and a trombone, and he added a girl group, called the Raelettes, who were mostly former members of a girl group called the Cookies (who would go on to have a few hits themselves over the years).\n\nCharles was now able to record his own band, rather than the Atlantic session musicians, and have them playing his own arrangements rather than Jesse Stone's. And the first recording session he did with his own band produced his first number one. Charles' trumpet player, Renald Richard, brought Charles a set of blues lyrics, and Charles set them to a gospel tune he'd been listening to.\n\nThe Southern Tones were a gospel act recording for Duke Records, and they never had much success. They'd be almost forgotten now were it not for this one record:\n\n[Excerpt, The Southern Tones, \"It Must Be Jesus\"]\n\nCharles took that melody, and the lyrics that Renald Richard had given him, and created a record which was utterly unlike anything else that had ever been recorded. This was a new fusion of gospel, the blues, big band jazz, and early rock and roll. Nobody had ever done anything like it before. In the context of 1954, when every fusion of ideas from different musics, and every new musical experiment, was labeled \"rock and roll\", this was definitely a rock and roll record, but in later decades they would say that this music had soul:\n\n[Excerpt, \"I Got a Woman\", Ray Charles]\n\nThat song was close enough to gospel to cause Charles some very real problems. Gospel singers who went over to making secular music were considered by their original fans to be going over to the side of the Devil. It wasn't just that they were performing secular music -- it was very specifically that they were using musical styles that were created in order to worship God, and turning them to secular purposes.\n\nAnd this criticism was applied, loudly, to Charles, even though he had never been a gospel singer. But while the gospel community was up in arms, people were listening. \"I Got a Woman\" went to number one on the R&B charts, and quickly entered the stage repertoire of another musician who had church music in his veins:\n\n[Excerpt, Elvis Presley, \"I Got a Woman\"]\n\nEven as it kicked off a whole new genre, \"I Got A Woman\" became a rock and roll standard. It would be covered by the Everly Brothers, the Beatles, the Monkees...\n\nRay Charles was, in the minds of his detractors, debasing something holy, but those complaints didn't stop Charles from continuing to rework gospel songs and turn them into rock and roll classics. For his next single, he took the old gospel song \"This Little Light of Mine\":\n\n[Excerpt: Etta James, \"This Little Light of Mine\"]\n\nAnd reworked it into \"This Little Girl of Mine\":\n\n[Excerpt: Ray Charles: \"This Little Girl of Mine\"]\n\nRay Charles had hit on a formula that any other musician would have happily milked for decades. But Ray Charles wasn't a musician who would stick to just one style of music. This wandering musical mind would ensure that for the next few years Ray Charles would be probably the most vital creative force in American music, but it also meant that he would swing wildly between commercial success and failure. After a run of huge hits in 1954, 55, and 56 -- classic songs like \"Hallelujah, I Love Her So\", \"Drown in My Own Tears\", and \"Lonely Avenue\" -- he hit a dry patch, with such less-than-stellar efforts as \"My Bonnie\" and \"Swanee River Rock\". But you can't keep a good man down for long, and when we next look at Ray Charles, in 1959, we'll see him once again revolutionise both rock and roll and the music he invented, the music that we now call soul.",
  "itunes:subtitle": "Welcome to episode thirty-two of A History of Rock Music in Five Hundred Songs. This one looks at I Got A Woman by Ray Charles. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, ",
  "itunes:keywords": "Ahmet Ertegun,Art Tatum,Atlantic Records,Bumps Blackwell,Charles Brown,Count Basie,gospel,Guitar Slim,jazz,Jesse Stone,Lowell Fulson,Nat King Cole,Quincy Jones,Ray Charles,soul,Swing Time Records",
  "itunes:episodeType": "full",
  "itunes:episode": 32,
  "content:encoded": "Welcome to episode thirty-two of <em>A History of Rock Music in Five Hundred Songs</em>. This one looks at \"I Got A Woman\" by Ray Charles. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-32-i-got-a-woman/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nFor more on Charles Brown and Nat Cole, Patreon backers might want to listen to <a href=\"https://www.patreon.com/posts/23406506\">the Christmas Patreon-only episode</a>.\n\nMost of the information here comes from Charles' autobiography, <a href=\"https://amzn.to/2JhC7TO\"><em>Brother Ray</em></a>, which gives a very clear view of his character, possibly not always in the ways he intended.\n\nAll the Ray Charles music used in this podcast, and the Guitar Slim track, are on <a href=\"https://amzn.to/2JeTlRP\"><em>The Complete Swing Time and Atlantic Recordings</em></a>. Charles' work from 1955 through about 1965 covers more genres of American music than any other body of work I can think of, and does so wonderfully.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nLet's talk about melisma.\n\nOne of the major things that you'll notice about the singers we've covered so far is that most of them sound very different from anyone who's been successful as a pure vocalist in the last few decades. There's a reason for that.\n\nAmong the pop songwriters of the thirties, forties, and fifties -- not the writers of blues and country music so much, but the people writing Broadway musicals and the repertoire the crooners were singing -- melisma was absolutely anathema.\n\nMelisma is a technical musical term, but it has a simple meaning -- it's when you sing multiple notes to the same syllable of lyric. This is something that has always existed since people started singing -- for example, at the start of \"The Star-Spangled Banner\", \"Oh say...\", there are two notes on the syllable \"oh\". That's melisma.\n\nBut among the songwriters who were registered with ASCAP in the middle of the last century, there was a strongly-held view that this was pure laziness. You wrote one syllable of lyric for one note of melody, and if you didn't, you were doing something wrong. The lyricist Sammy Cahn used to talk about how he wrote the lyric to \"Pocketful of Miracles\" -- \"Practicality doesn't interest me\" -- but then the composer wrote a melody with one more note per line than he'd written syllables for the lyric. Rather than let the song contain melisma, he did this:\n\n[Excerpt: Frank Sinatra, \"Pocketful of Miracles\", with Sinatra singing \"pee-racticality dee-oesn't interest me\"]\n\nThat was the kind of thing songwriters would do to avoid even the hint of melisma. And singers were the same. If you listen to any of the great voices of the first part of the twentieth century -- Sinatra, Bing Crosby, Tony Bennett -- they will almost without exception hit the note dead on, one note per syllable. No ornamentation, no frills. There were a few outliers -- Billie Holiday and Ella Fitzgerald, for example, would both use a little melisma (Holiday more than Ella) to ornament their sound -- but generally that was what good singing *was*. You sang the notes, one note per syllable.\n\nAnd this was largely the case in the blues, as well as in the more upmarket styles. The rules weren't stuck to quite as firmly there, but still, you'd mostly sing the song as it was written, and it would largely be written without melisma.\n\nThere was one area where that was not the case – gospel, specifically black gospel.\n\n[Excerpt: Rosetta Tharpe, \"Precious Lord, Take My Hand\"]\n\nWe looked at gospel already, of course, but we didn't talk about this particular characteristic of the music. You see, in black gospel -- and pretty much only in black gospel music, at the time we're talking about -- the use of melisma was how you conveyed emotion. You ornamented the notes, you'd sing more notes per syllable, and that was how you showed how moved you were by the spirit.\n\nAnd these days, that style is what people now think of as good or impressive singing. There are a *lot* of class and race issues around taste in this that I'm not going to unpick here -- we've got a whole four hundred and sixty-eight more episodes in which to discuss these things, after all -- but when you hear someone on The Voice or American Idol or The X Factor trying to impress with their vocals, it's their command of melisma they're trying to impress with. The more they can ornament the notes, the more they fit today's standards of good singing.\n\nAnd that changed because, in the 1950s, there was a stream of black singers who came out of the gospel tradition and introduced its techniques into pop music.\n\nBefore talking about that, it's worth talking about the musical boundaries we're going to be using in this series, because while it's called \"A History of Rock Music in 500 Songs\", I am not planning on using a narrow definition of \"rock music\", because what counts as rock tends to be retroactively redefined to exclude branches of music where black people predominate. So for example, there's footage of Mohammed Ali calling Sam Cooke \"the greatest rock and roll singer in the world\", and at the time absolutely nobody would have questioned Cooke being called \"rock and roll\", but these days he would only be talked about as a soul singer.\n\nAnd much of the music that we would now call \"soul\" was so influential on the music that we now call rock music that it's completely ridiculous to even consider them separately until the late seventies at the earliest. So while we're going to mostly look at music that has been labelled rock or rock and roll, don't be surprised to find soul, funk, hip-hop, country, or any other genre that has influenced rock turning up. And especially don't be surprised to see that happening if it was music that was thought of as rock and roll at the time, but has been retroactively relabelled.\n\nSo today, we're going to talk about a record that's been widely credited as the first soul record, but which was released as rock and roll. And we're going to talk about a musician who cut across all the boundaries that anyone tries to put on music, a man who was equally at home in soul, jazz, R&B, country, and rock and roll. We're going to talk about the great Ray Charles.\n\n[Excerpt: Ray Charles, “I Got a Woman”]\n\nRay Charles had an unusual upbringing -- though perhaps one that's not as unusual as people would like to think. As far as I can tell from his autobiography, he was the product of what we would now call a polyamorous relationship. His father was largely absent, but he was brought up by his mother, who he called \"Mama\", and by his father's wife, who he called \"Mother\". Both women knew of, approved of, and liked each other, as far as young Ray was concerned.\n\nHis given name was Ray Charles Robinson, but he changed it when he became a professional musician, due to the popularity of the boxer Sugar Ray Robinson, whose peak years were around the same time as Charles' -- he didn't want to be confused with another, more famous, Ray Robinson. From a very young age, he was fascinated by the piano, and that fascination intensified when, before he reached adolescence, he became totally blind.\n\nThat blindness would shape his life, even though -- and perhaps because -- he had a strong sense of independence. He wasn't going to let his disability define him, and he often said that the three things that he didn't want were a dog, a cane, and a guitar, because they were the things all blind men had.\n\nNow, I want to make it very clear that I'm not talking here about the rights and wrongs of Charles' own attitude to his disability. I'm disabled myself, but his disability is not mine, and he is from another generation. I'm just stating what that attitude was, and how it affected his life and career. And the main thing it did was make him even more fiercely independent. He not only got about on his own without a cane or a dog, he also at one point even used to go riding a motorbike by himself.\n\nOther than his independence, the main thing everyone noted about the young Ray Charles Robinson was his proficiency on the piano, and by his late teens he was playing great jazz piano, inspired by Art Tatum, who like Ray was blind. Tatum was such a proficient pianist that there is a term in computational musicology, the tatum, meaning \"the smallest time interval between successive notes in a rhythmic phrase\".\n\n[Excerpt; Art Tatum, \"I Wish I Were Twins\"]\n\nCharles never got quite that good, but he was inspired by Tatum's musicality, and he became a serious student of the instrument, becoming a very respectable jazz pianist.\n\nWhen his mother died, when he was fifteen, Charles decided to leave school and set up on his own as a musician. Initially, he toured only round Georgia and Florida, and early on he made a handful of records. His very earliest recordings, oddly, sound a lot like his mature style -- his first record, \"Wondering and Wondering\", was almost fully-formed mature Ray Charles:\n\n[Excerpt: Ray Charles, \"Wondering and Wondering\"]\n\nBut he soon changed his style to be more popular. He moved to the West Coast, and unsuccessfully auditioned to play piano with Lucky Millinder's band, and would occasionally play jazz with Bumps Blackwell and Dizzy Gillespie. But while his association with Bumps Blackwell would continue long into the future, playing jazz wasn't how Ray Charles was going to make his name.\n\nOn the West Coast in the late forties and early fifties, the most popular style for black musicians was a particular kind of smooth blues, incorporating aspects of crooning alongside blues and jazz. Two of the biggest groups in the R&B field were the Nat \"King\" Cole Trio and Johnny Moore's Three Blazers featuring Charles Brown. Both of these had very similar styles, featuring a piano player who sang smooth blues, with an electric guitarist and a bass player, and sometimes a drummer.\n\nWe've heard Nat \"King\" Cole before, playing piano with Les Paul and Illinois Jacquet, but it's still hard for modern listeners to remember that before his massive pop success with ballads like \"Unforgettable\", Cole was making music which may not have been quite as successful commercially, but which was incredibly influential on the burgeoning rock music field.\n\nA typical example of the style is Cole's version of \"Route Sixty-Six\":\n\n[Excerpt: Nat \"King\" Cole Trio, \"Route Sixty Six\"]\n\nYou'll note, I hope, the similarity to the early recordings by the Chuck Berry Trio in particular -- Berry would often say that while Louis Jordan music was the music he would play to try to make a living, Nat \"King\" Cole was the musician he most liked to listen to, and the Chuck Berry Trio was clearly an attempt to emulate this style.\n\nThe other group I mentioned, The Three Blazers, were very much in the same style as the Nat Cole Trio, but were a couple of rungs down the entertainment ladder, and Charles Brown, their singer, would be another huge influence on Ray Charles early on. Charles formed his own trio, the McSon Trio (the \"Son\" came from the Robinson in his own name, the \"Mc\" from the guitarist's name).\n\n[Excerpt: The McSon Trio \"Don't Put All Your Dreams In One Basket\"]\n\nThe McSon Trio quickly changed their name to the Ray Charles Trio, as their pianist and singer became the obvious star of the show.\n\nCharles soon tired of running his own trio, though, and went fully solo, travelling to gigs on his own and working with local pickup bands rather than having his own steady musicians. This also gave him the opportunity to collaborate with a wider variety of other musicians than having a fixed band would.\n\nAround this time Charles was introduced by Bumps Blackwell to Quincy Jones, with whom he would go on to collaborate in various ways for much of the rest of his career. But his most important collaboration in his early career was with the blues musician Lowell Fulson. Fulson was one of the pioneers of the smooth West Coast blues sound, and Charles became his pianist and musical director for a short time. Charles didn't perform on many of Fulson's sessions, but you can get an idea of the kind of thing that he would have been playing with Fulson from Fulson's biggest record, \"Reconsider Baby\", which came out shortly after Charles' time with Fulson:\n\n[Excerpt: Lowell Fulson, \"Reconsider Baby\"]\n\nSo Charles was splitting his time between making his own Nat Cole or Charles Brown style records, touring on his own, and touring with Fulson. He also worked on other records for other musicians. The most notable of these was a blues classic, by another of the greats of West Coast blues, \"The Things That I Used To Do\" by Guitar Slim.\n\n[Excerpt: \"The Things That I Used To Do\" by Guitar Slim]\n\nSlim was one of the great blues guitarists of the 1950s, and he was also one of the great showmen, whose performance style included things like a guitar cord that was allegedly three hundred and fifty feet long, so he could keep his guitar plugged into the amplifier but walk through the crowd and even out into the street, while still playing his guitar. Slim would later be a huge influence on musicians like Jimi Hendrix, but \"The Things That I Used To Do\", his most famous record, is as much Charles' record as it is Guitar Slim's -- Charles produced, arranged, and played piano, and the result sounds far more like the work that Charles was doing at the time than it does Guitar Slim's other work, though it still has Slim's recognisable guitar sound.\n\nHe finally got the opportunity to stand out when he moved from Swing Time to Atlantic Records. While several of the Swing Time recordings were minor successes, people kept telling him how much he sounded like Nat Cole or Charles Brown. But he realised that it was unlikely that anyone was telling Nat Cole or Charles Brown how much they sounded like Ray Charles, and that he would never be in the first rank of musicians unless he got a style that was uniquely his.\n\nEverything changed with \"Mess Around\", which was his first major venture into the Atlantic house style. \"Mess Around\" is credited to Ahmet Ertegun, the owner of Atlantic Records, as the writer, but it should really be credited as a traditional song arranged by Ray Charles, Jesse Stone, and Ertegun. Ertegun did contribute to the songwriting -- rather surprisingly, given the habit of record executives of just taking credit for something that they had nothing to do with. Ertegun told Charles to play some piano in the style of Pete Johnson, and Charles responded by playing \"Cow Cow Blues\", a 1928 song by Cow Cow Davenport:\n\n[Excerpt: Cow Cow Davenport, \"Cow Cow Blues\"]\n\nErtegun came up with some new words for that, mostly based around traditional floating lyrics. Jesse Stone came up with an arrangement, and the result was titled \"Mess Around\":\n\n[Excerpt: Ray Charles and his Orchestra, \"Mess Around\"]\n\nFor his next few records, Charles was one of many artists making records with the standard Atlantic musicians and arrangers -- the same people who were making records with Ruth Brown or LaVern Baker. By this point, he had gained enough confidence in the studio that he was able to sing like himself, not like Charles Brown or Nat Cole or anyone else. The music he was making was generic R&B, but it didn't sound like anyone else at all:\n\n[Excerpt: Ray Charles, \"It Should Have Been Me\"]\n\n\"Mess Around\" and \"It Should Have Been Me\" were Charles' two biggest hits to date, both making the top five on the R&B charts. His breakout, though, came with a song that he based around a gospel song. At this time, gospel music was not much of an influence on most of the rhythm and blues records that were charting, but as Charles would later say, \"the church was something which couldn’t be taken out of my voice even if I had wanted to take it out. Once I decided to be natural, I was gone. It’s like Aretha: She could do “Stardust,” but if she did her thing on it, you’d hear the church all over the place.\"\n\nCharles had now formed his own band, which was strongly influenced by Count Basie. The Count Basie band was, like Lionel Hampton's, one of the bands that had most influenced early R&B, and its music was exactly the kind of combination of jump band and classy jazz that Charles liked:\n\n[Excerpt: Count Basie, \"One O'Clock Jump\"]\n\nCharles' own band was modelled on the Basie band, though slimmed down because of the practicalities of touring with a big band in the fifties. He had three sax players, piano, bass, drums, two trumpets, and a trombone, and he added a girl group, called the Raelettes, who were mostly former members of a girl group called the Cookies (who would go on to have a few hits themselves over the years).\n\nCharles was now able to record his own band, rather than the Atlantic session musicians, and have them playing his own arrangements rather than Jesse Stone's. And the first recording session he did with his own band produced his first number one. Charles' trumpet player, Renald Richard, brought Charles a set of blues lyrics, and Charles set them to a gospel tune he'd been listening to.\n\nThe Southern Tones were a gospel act recording for Duke Records, and they never had much success. They'd be almost forgotten now were it not for this one record:\n\n[Excerpt, The Southern Tones, \"It Must Be Jesus\"]\n\nCharles took that melody, and the lyrics that Renald Richard had given him, and created a record which was utterly unlike anything else that had ever been recorded. This was a new fusion of gospel, the blues, big band jazz, and early rock and roll. Nobody had ever done anything like it before. In the context of 1954, when every fusion of ideas from different musics, and every new musical experiment, was labeled \"rock and roll\", this was definitely a rock and roll record, but in later decades they would say that this music had soul:\n\n[Excerpt, \"I Got a Woman\", Ray Charles]\n\nThat song was close enough to gospel to cause Charles some very real problems. Gospel singers who went over to making secular music were considered by their original fans to be going over to the side of the Devil. It wasn't just that they were performing secular music -- it was very specifically that they were using musical styles that were created in order to worship God, and turning them to secular purposes.\n\nAnd this criticism was applied, loudly, to Charles, even though he had never been a gospel singer. But while the gospel community was up in arms, people were listening. \"I Got a Woman\" went to number one on the R&B charts, and quickly entered the stage repertoire of another musician who had church music in his veins:\n\n[Excerpt, Elvis Presley, \"I Got a Woman\"]\n\nEven as it kicked off a whole new genre, \"I Got A Woman\" became a rock and roll standard. It would be covered by the Everly Brothers, the Beatles, the Monkees...\n\nRay Charles was, in the minds of his detractors, debasing something holy, but those complaints didn't stop Charles from continuing to rework gospel songs and turn them into rock and roll classics. For his next single, he took the old gospel song \"This Little Light of Mine\":\n\n[Excerpt: Etta James, \"This Little Light of Mine\"]\n\nAnd reworked it into \"This Little Girl of Mine\":\n\n[Excerpt: Ray Charles: \"This Little Girl of Mine\"]\n\nRay Charles had hit on a formula that any other musician would have happily milked for decades. But Ray Charles wasn't a musician who would stick to just one style of music. This wandering musical mind would ensure that for the next few years Ray Charles would be probably the most vital creative force in American music, but it also meant that he would swing wildly between commercial success and failure. After a run of huge hits in 1954, 55, and 56 -- classic songs like \"Hallelujah, I Love Her So\", \"Drown in My Own Tears\", and \"Lonely Avenue\" -- he hit a dry patch, with such less-than-stellar efforts as \"My Bonnie\" and \"Swanee River Rock\". But you can't keep a good man down for long, and when we next look at Ray Charles, in 1959, we'll see him once again revolutionise both rock and roll and the music he invented, the music that we now call soul.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode thirty-two of A History of Rock Music in Five Hundred Songs. This one looks at \"I Got A Woman\" by Ray Charles. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nFor more on Charles Brown and Nat Cole, Patreon backers might want to listen to the Christmas Patreon-only episode.\n\nMost of the information here comes from Charles' autobiography, Brother Ray, which gives a very clear view of his character, possibly not always in the ways he intended.\n\nAll the Ray Charles music used in this podcast, and the Guitar Slim track, are on The Complete Swing Time and Atlantic Recordings. Charles' work from 1955 through about 1965 covers more genres of American music than any other body of work I can think of, and does so wonderfully.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nLet's talk about melisma.\n\nOne of the major things that you'll notice about the singers we've covered so far is that most of them sound very different from anyone who's been successful as a pure vocalist in the last few decades. There's a reason for that.\n\nAmong the pop songwriters of the thirties, forties, and fifties -- not the writers of blues and country music so much, but the people writing Broadway musicals and the repertoire the crooners were singing -- melisma was absolutely anathema.\n\nMelisma is a technical musical term, but it has a simple meaning -- it's when you sing multiple notes to the same syllable of lyric. This is something that has always existed since people started singing -- for example, at the start of \"The Star-Spangled Banner\", \"Oh say...\", there are two notes on the syllable \"oh\". That's melisma.\n\nBut among the songwriters who were registered with ASCAP in the middle of the last century, there was a strongly-held view that this was pure laziness. You wrote one syllable of lyric for one note of melody, and if you didn't, you were doing something wrong. The lyricist Sammy Cahn used to talk about how he wrote the lyric to \"Pocketful of Miracles\" -- \"Practicality doesn't interest me\" -- but then the composer wrote a melody with one more note per line than he'd written syllables for the lyric. Rather than let the song contain melisma, he did this:\n\n[Excerpt: Frank Sinatra, \"Pocketful of Miracles\", with Sinatra singing \"pee-racticality dee-oesn't interest me\"]\n\nThat was the kind of thing songwriters would do to avoid even the hint of melisma. And singers were the same. If you listen to any of the great voices of the first part of the twentieth century -- Sinatra, Bing Crosby, Tony Bennett -- they will almost without exception hit the note dead on, one note per syllable. No ornamentation, no frills. There were a few outliers -- Billie Holiday and Ella Fitzgerald, for example, would both use a little melisma (Holiday more than Ella) to ornament their sound -- but generally that was what good singing *was*. You sang the notes, one note per syllable.\n\nAnd this was largely the case in the blues, as well as in the more upmarket styles. The rules weren't stuck to quite as firmly there, but still, you'd mostly sing the song as it was written, and it would largely be written without melisma.\n\nThere was one area where that was not the case – gospel, specifically black gospel.\n\n[Excerpt: Rosetta Tharpe, \"Precious Lord, Take My Hand\"]\n\nWe looked at gospel already, of course, but we didn't talk about this particular characteristic of the music. You see, in black gospel -- and pretty much only in black gospel music, at the time we're talking about -- the use of melisma was how you conveyed emotion. You ornamented the notes, you'd sing more notes per syllable, and that was how you showed how moved you were by the spirit.\n\nAnd these days, that style is what people now think of as good or impressive singin",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode thirty-two of A History of Rock Music in Five Hundred Songs. This one looks at \"I Got A Woman\" by Ray Charles. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nFor more on Charles Brown and Nat Cole, Patreon backers might want to listen to the Christmas Patreon-only episode.\n\nMost of the information here comes from Charles' autobiography, Brother Ray, which gives a very clear view of his character, possibly not always in the ways he intended.\n\nAll the Ray Charles music used in this podcast, and the Guitar Slim track, are on The Complete Swing Time and Atlantic Recordings. Charles' work from 1955 through about 1965 covers more genres of American music than any other body of work I can think of, and does so wonderfully.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Pat",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}