{
  "title": "What is it like to remember every day of your life? With Michael Yassa, PhD, and Markie Pasternak",
  "itunes:title": "What is it like to remember every day of your life? With Michael Yassa, PhD, and Markie Pasternak",
  "pubDate": "Wed, 05 May 2021 10:30:00 +0000",
  "guid": "6fc8bf39-49b3-4c09-a3cc-84430d0add8c",
  "link": "https://apa.org/speakingofpsychology",
  "itunes:image": "",
  "description": "<p>For people with Highly Superior Autobiographical Memory, or HSAM, every day is memorable. Ask them what they were doing on this date 10 years ago, and they’ll be able to tell you. Markie Pasternak, one of the youngest people identified with HSAM, and Michael Yassa, PhD, director of the Center for the Neurobiology of Learning and Memory at the University of California Irvine, talk about what it’s like to have this ability, what we know about how the brains of people with HSAM store and retrieve this vast amount of autobiographical information, and what studying this unique ability can teach us more generally about how memory works.<br /> <br /> Are you enjoying Speaking of Psychology? We’d love to know what you think of the podcast, what you would change about it, and what you’d like to hear more of. Please take our listener survey at www.apa.org/podcastsurvey.<br /> <br /> <strong>Links</strong><br /> <br /> Michael Yassa, PhD - faculty.sites.uci.edu/myassa<br /> Markie Pasternak - http://livingwithtotalrecall.home.blog</p>",
  "content:encoded": "<p>For people with Highly Superior Autobiographical Memory, or HSAM, every day is memorable. Ask them what they were doing on this date 10 years ago, and they’ll be able to tell you. Markie Pasternak, one of the youngest people identified with HSAM, and Michael Yassa, PhD, director of the Center for the Neurobiology of Learning and Memory at the University of California Irvine, talk about what it’s like to have this ability, what we know about how the brains of people with HSAM store and retrieve this vast amount of autobiographical information, and what studying this unique ability can teach us more generally about how memory works.  Are you enjoying Speaking of Psychology? We’d love to know what you think of the podcast, what you would change about it, and what you’d like to hear more of. Please take our listener survey at www.apa.org/podcastsurvey.  Links  Michael Yassa, PhD - faculty.sites.uci.edu/myassa Markie Pasternak - http://livingwithtotalrecall.home.blog</p>",
  "enclosure": "",
  "itunes:duration": "38:50",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For people with Highly Superior Autobiographical Memory, or HSAM, every day is memorable. Ask them what they were doing on this date 10 years ago, and they’ll be able to tell you. Markie Pasternak, one of the youngest people identified with HSAM,...",
  "itunes:episode": 140,
  "itunes:episodeType": "full"
}