{
  "title": "Package support offer",
  "link": "https://itsalocke.com/blog/package-support-offer/",
  "pubDate": "Mon, 15 Oct 2018 00:00:00 +0000",
  "guid": "https://itsalocke.com/blog/package-support-offer/",
  "description": "<p>The R community and the package ecosystem are awesome but it can be difficult to sustain your R packages when you only have so much free time. To make a stellar package you&rsquo;ve got to keep on top of the issues, make great documentation, have that all important hex sticker, and generally have good quality code. This all takes time, time you don&rsquo;t always have. We would like to help.</p>\n\n<p>Once per month, we&rsquo;ll select (from applicants) one package to setup for success. These packages will have general utility to a broad part of the community but could benefit from some decidated time to help give it the boost it needs to be more widely adopted.</p>\n\n<p>For the selected packages we will then work with the package author to ensure:</p>\n\n<ul>\n<li>The GitHub repo is setup well and go over all existing issues to make sure they&rsquo;re well formed, tagged, and prioritised. (3 hours of Locke Data time)</li>\n<li>The package implements best practices in terms of the code, tests, and documentation. (5 hours of Locke Data time)</li>\n<li>The package is easy to market with a pkgdown site and a logo. (Up to a day of Locke Creatives time)</li>\n<li>The package starts getting coverage by showcasing the package in our blog. (Up to 3 hours of Locke Data time)</li>\n</ul>\n\n<p>In return you&rsquo;ll list us as sponsors in the DESCRIPTION using the <code>fnd</code> tag and list our support on the README (and therefore the pkgdown). We&rsquo;ll also tell folks we helped you.</p>\n\n<p>If you think your package fits the bill (i.e. broadly applicable) and you could benefit from our support getting your package into shape then <a href=\"https://airtable.com/shrH3z9fQIbEJzPUn\">apply now</a>.</p>\n\n<p><em>PS We can also offer this service commercially, and provide CRAN submission and ongoing maintainence options too if you&rsquo;re a company who just wants to get stuff live.</em></p>"
}