{
  "id": "tag:blogger.com,1999:blog-6894866515532737257.post-9073386458976131188",
  "published": "2018-01-08T09:10:00.003-08:00",
  "updated": "2018-01-08T09:10:28.942-08:00",
  "title": "Computation in STEM Workshop",
  "content": "Last week I had the pleasure of visiting UC Davis, where I co-led (along with <a href=\"http://www.moorepants.info/about.html\">Jason Moore</a>) a <a href=\"http://mae.ucdavis.edu/events/a-workshop-on-computational-thinking-in-the-engineering-curriculum/\">workshop on using computation in the STEM curriculum</a>.<br /><br />We had about 20 participants, including faculty, staff, and graduate students from engineering, math, natural sciences and social sciences.&nbsp; Classes at UC Davis start today, so we appreciate the time the participants took from a busy week!<br /><br />We hope to run this workshop again at Olin College's&nbsp;<a href=\"http://www.olin.edu/collaborate/collaboratory/summer-institute/\">Summer Institute 2018</a>.<br /><div><br /></div>Abstract:<br /><blockquote class=\"tr_bq\"><i>This workshop invites faculty to think about computation in the context of engineering education and to design classroom experiences that develop programming skills and apply them to engineering topics. Starting from examples in signal processing and mechanics, participants will identify topics that might benefit from a computational approach and design course materials to deploy in their classes. Although our examples come from engineering, this workshop may also be of interest to faculty in the natural and social sciences as well as mathematics.</i></blockquote><br />Here are our slides:<br /><br /><iframe allowfullscreen=\"true\" frameborder=\"0\" height=\"299\" mozallowfullscreen=\"true\" src=\"https://docs.google.com/presentation/d/e/2PACX-1vTCq_A4DKcigYd8JZBTFV5YCtX_OVbKaOz_y3dgq-836_jQ4uHRP1javXpXCkE4pj5Una21Lttvkg3a/embed?start=false&amp;loop=false&amp;delayms=3000\" webkitallowfullscreen=\"true\" width=\"480\"></iframe> <br /><br />Video from the workshop will be available soon.<br /><br />Many thanks to Jason Moore in the MAE Department at UC Davis for inviting me and running the workshop with me, to Pamela Reynolds at the <a href=\"http://dsi.ucdavis.edu/\">UC Davis Data Science Initiative</a> for hosting us, and to the Collaboratory at Olin College for supporting my participation.&nbsp; This workshop was supported by funding from the Undergraduate Instructional Innovation Program, which is funded by the Association of American Universities (AAU) and Google, and administered by UC Davis's Center for Educational Effectiveness.<br /><br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Allen Downey",
    "uri": "http://www.blogger.com/profile/01633071333405221858",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}