{
  "title": "Conflict Flares Up in Nagorno-Karabakh, with Joshua Kucera (PODCAST 9-29-2020)",
  "description": "<p><em>This is the web version of Foreign Exchanges, but did you know you can get it delivered right to your inbox? Sign up today:</em></p><p>Today I’m joined by reporter Joshua Kucera of <a target=\"_blank\" href=\"https://eurasianet.org/\">Eurasianet</a>, a great source for news and analysis on the Caucasus and Central Asia. As you may be aware, fighting broke out several days ago between Armenian and Azerbaijani forces over the disputed Nagorno-Karabakh region. Josh gives us an update on that situation (current as of Tuesday evening, September 29, in the Caucasus) as well as some of the historical and political context to the Nagorno-Karabkh dispute and some perspective on the potential for this latest clash to escalate into a full-blown war or even a wider regional conflict.</p><p>This map of the situation as it’s been frozen in place since the 1990s Nagorno-Karabakh War ended may be helpful:</p><p><em>Source: Wikimedia Commons</em></p><p>You may also appreciate this photo of Armenian Prime Minister Nikol Pashinyan and Russian President Vladimir Putin pretending to like each other, which as you’ll see is relevant to the discussion:</p><p><em>Source: Russian government via Wikimedia Commons</em></p><p>Josh’s latest, which attempts to suss out what Azerbaijan is trying to accomplish with this latest round of fighting, is now available <a target=\"_blank\" href=\"https://eurasianet.org/as-fighting-rages-what-is-azerbaijans-goal\">at Eurasianet</a>. You can also find him on Twitter: <a target=\"_blank\" href=\"https://twitter.com/joshuakucera\">@joshuakucera</a>.</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://fx.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">fx.substack.com/subscribe</a>",
  "link": "https://fx.substack.com/p/conflict-flares-up-in-nagorno-karabakh",
  "guid": "substack:post:5399857",
  "dc:creator": "Derek Davison",
  "pubDate": "Tue, 29 Sep 2020 16:31:24 GMT",
  "enclosure": "",
  "itunes:author": "Derek Davison",
  "itunes:explicit": "No",
  "itunes:duration": 4263,
  "itunes:image": ""
}