{
  "title": "Chinese Whispers: the next technological arms race",
  "link": "https://audioboom.com/posts/8118325",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2630,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Semiconductors are the most important thing that you've never heard of. These little computer chips provide the processing power for everything from cars and iPhones, to unmanned drones and missiles. In Beijing's Made in China 2025 industrial strategy, through which China seeks to move up the value chain to become a high-tech superpower, semiconductor self-sufficiency was one of the targets. <br>\n<br>\n\n</div>\n<div>Beijing is falling far behind on this target. MIC 2025 stated the aim of meeting 70 per cent of China's demand through domestic production by 2025, but, seven years on, it is only meeting 20 per cent of its domestic needs (by one estimate). The world's leading manufacturer of semiconductors is in fact in Taiwan. The Taiwanese Semiconductor Manufacturing Company dominates more than half the global market, and controls 90 per cent of the cutting edge 5 to 10 nanometre sector (in this industry, size matters; the smaller the chip, the better). Even American companies like Intel outsource a substantial amount of production to TSMC.<br>\n<br>\n\n</div>\n<div>A tech arms race is underway.  In order to control the supply of this small but vital component, China and the US are desperately funnelling money into their own national champions, whilst 'kneecapping' each other's efforts, as Nigel Inkster tells Cindy Yu on this episode. He's the former director of operations and intelligence at MI6 and author of <em> The Great Decoupling: China, America and the Struggle for Technological Supremacy</em>.<br>\n<br>\n\n</div>\n<div>They discuss Washington's relatively effective efforts on this front – from instituting export controls on western companies (not just American) that supply Chinese semiconductor companies, to pressurising TSMC to share its know-how worldwide (TSMC will open an Arizona branch in two years, thanks to pressure from President Trump). It's got wolf warrior and Foreign Ministry spokesperson Zhao Lijian hopping mad; he has accused the Americans of practising 'technological terrorism'.<br>\n<br>\n\n</div>\n<div>Yet America's approach could be instructive for the UK, where there's a live political question over the Chinese acquisition of Newport Wafer Fab, a relatively low-end semiconductor manufacturing site that is the subject of an ongoing national security review.<br>\n<br>\n\n</div>\n<div>Some in the West also fear that TSMC's success will lure China to invade Taiwan, while some in Taipei see the company as their 'silicon shield', Nigel says, as its accidental destruction (or at the hands of the Taiwanese or American governments) may deter China from an aggressive incursion.<br>\n<br>\n\n</div>\n<div>On the episode, Nigel and Cindy discuss all this and more (whether China is inherently less innovative, how painful and inevitable a tech arms race would be, and Nigel's reaction to MI5 and the FBI's recent joint warning about Chinese espionage).</div>\n",
  "pubDate": "Mon, 11 Jul 2022 15:43:40 +0000",
  "guid": "tag:audioboom.com,2022-07-11:/posts/8118325",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}