{
  "title": "Greta Thunberg calls for downfall of capitalism",
  "link": "https://www.rt.com/news/565836-greta-thunberg-climate-capitalism/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565836-greta-thunberg-climate-capitalism/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362d6a32030272f2f67db89.jpg\" /> Greta Thunberg has called for an end to capitalism, blaming climate change on economic growth <br/><a href=\"https://www.rt.com/news/565836-greta-thunberg-climate-capitalism/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The teenage climate activist also blamed “racism” for warming the planet</strong></p>\n            \n                        \n            <p>Swedish eco-activist Greta Thunberg has turned her attention to the political arena, calling for the downfall of capitalism, which she claimed is responsible for climate change.</p>\n<p>The 19-year-old climate campaigner launched her book &ndash; &lsquo;The Climate Book&rsquo; &ndash; in London on Sunday night, telling the audience that the world is <em>&ldquo;never going back to normal again.&rdquo;</em> She argued that global warming can only be solved by a<em> &ldquo;system-wide transformation,&rdquo;</em> according to a write-up of the event by the Telegraph.</p>\n<p>The capitalist system, Thunberg continued, is <em>&ldquo;defined by colonialism, imperialism, oppression and genocide by the so-called global North to accumulate wealth that still shapes our current world order.&rdquo;</em></p>\n<p><em>&ldquo;If economic growth is our only priority, then what we are experiencing now should be exactly what we should be expecting,&rdquo;</em> she added, before calling the extraction of fossil fuels <em>&ldquo;racist.&rdquo;</em></p>\n<p></p>\n<p>As some of Thunberg&rsquo;s critics pointed out online, global living standards have broadly risen&nbsp;under capitalism, while carbon emissions have fallen in the capitalist USA since the turn of the millennium. Thunberg replied&nbsp;to these critics on Wednesday, stating that she is not advocating for a return to <em>&ldquo;socialism, liberalism, communism, conservatism, centrism, you name it,&rdquo;</em> which she said <em>&ldquo;have all failed.&rdquo;</em></p>\n<p>Thunberg, who has previously been criticized for failing to offer solutions to the problems she outlines, did not say what kind of system she would replace capitalism with.</p>\n<p>Shooting to fame after she organized a series of school walk-outs in her native Sweden in 2018, Thunberg has since delivered her dramatic predictions of ecological armageddon to lawmakers across the Western world, to UN summits, and to the World Economic Forum&rsquo;s yearly gatherings at Davos, Switzerland. WEF founder Klaus Schwab is also an advocate of radically restructuring the global order, a vision&nbsp;he calls <em>&ldquo;the Great Reset.&rdquo;</em></p>\n<p>Despite spending several years on the globalist circuit, Thunberg will skip the UN COP27 climate conference in Egypt next week, telling her audience that she now views the summit as a <em>&ldquo;scam&rdquo;</em> and an example of <em>&ldquo;greenwashing&rdquo;</em> &ndash; an attempt by politicians to falsely portray themselves as environmentally friendly.&nbsp;</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/544593-greta-thunberg-blasts-biden-climate/\">\n            <span>READ MORE: </span>Greta Thunberg blasts portrayal of Joe Biden as ‘climate leader’\n        </a>\n    </p>\n\n    \n",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 21:21:39 +0000",
  "dc:creator": "RT"
}