{
  "title": "How the need to belong drives human behavior, with Geoffrey L. Cohen, PhD",
  "itunes:title": "How the need to belong drives human behavior, with Geoffrey L. Cohen, PhD",
  "pubDate": "Wed, 14 Sep 2022 10:30:00 +0000",
  "guid": "f2fb55ac-c1b1-4c69-995c-41b370e8198a",
  "link": "http://sopapa.libsyn.com/how-the-need-to-belong-drives-human-behavior-with-geoffrey-l-cohen-phd",
  "itunes:image": "",
  "description": "<p>The desire to belong is a fundamental part of human nature. Geoffrey Cohen, PhD, of Stanford University, talks about how feeling like an outsider can harm us; why threats to belonging drive problems as varied as achievement gaps and political polarization; and how to boost people’s sense of belonging, especially among those most at risk of feeling like outsiders.<br /> <br /> <br /> <strong>LInks</strong><br /> <br /> <br /> <a href=\"https://ed.stanford.edu/faculty/glc\">Geoffrey Cohen, PhD</a><br /> <br /> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Home Page</a></p>",
  "content:encoded": "<p>The desire to belong is a fundamental part of human nature. Geoffrey Cohen, PhD, of Stanford University, talks about how feeling like an outsider can harm us; why threats to belonging drive problems as varied as achievement gaps and political polarization; and how to boost people’s sense of belonging, especially among those most at risk of feeling like outsiders.   LInks   <a href=\"https://ed.stanford.edu/faculty/glc\">Geoffrey Cohen, PhD</a>  <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Home Page</a></p>",
  "enclosure": "",
  "itunes:duration": "32:58",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "The desire to belong is a fundamental part of human nature. Geoffrey Cohen, PhD, of Stanford University, talks about how feeling like an outsider can harm us; why threats to belonging drive problems as varied as achievement gaps and political...",
  "itunes:episode": 206,
  "itunes:episodeType": "full",
  "itunes:author": "American Psychological Association"
}