{
  "title": "#463: Umbridge's Quibbles (OOTP 26, Seen and Unforeseen)",
  "link": "https://audioboom.com/posts/7566914",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4334,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Happy Birthday, Eric!</li>\n<li>Quizzitch Live: The Prisoner of Knowledge was a huge success! We hope you joined us and had fun!</li>\n<li>Muggle Mail covers COVID-19 at Hogwarts and more Hagrid/Harry comparisons!</li>\n<li>\n<a href=\"http://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a> continues with Order of the Phoenix – Chapter 26: Seen and Unforeseen</li>\n<li>7-Word Summary: Dreams enter the mind through Snape’s lessons </li>\n<li>How much legitimacy does Rita Skeeter provide to Harry's story?</li>\n<li>Umbridge's latest Educational Decree: does it violate freedom of speech and freedom of the press?</li>\n<li>Should Hermione have given Harry advice about Cho BEFORE their date?</li>\n<li>Does Quidditch create bad blood amongst the Hogwarts Houses?</li>\n<li>Inside Harry's Dreams: Neville, McGonagall, Voldemort, Rookwood and more!</li>\n<li>How is Voldemort not aware of proper prophecy protocol?</li>\n<li>The truth about Broderick Bode and Sturgis Podmore is revealed!</li>\n<li>Bad Hermione! Should Harry have told someone what he saw in his dream?</li>\n<li>Does Snape share what he is seeing inside Harry's mind with Dumbledore?</li>\n<li>The door to the Department of Mysteries finally opens!</li>\n<li>Snape's childhood was a rough one!</li>\n<li>Trelawney and Firenze</li>\n<li>The Umbridge Suck Count climbs to 62!</li>\n<li>The hosts give their MVP of the Week and Rename The Chapter!</li>\n<li>Quizzitch: Who retrieves the list of Dumbledore’s Army members for Umbridge?</li>\n<li>This week's episode is brought to you by MeUndies! Get 15% off your first order and free shipping by going to <a href=\"http://www.MeUndies.com/MuggleCast\">MeUndies.com/MuggleCast</a>\n</li>\n<li>Join our community at <a href=\"http://www.patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 28 Apr 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-04-27:/posts/7566914",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}