{
  "title": "259: The Lizzie Borden Murders",
  "link": "https://audioboom.com/posts/8176531",
  "itunes:episode": 259,
  "itunes:title": "The Lizzie Borden Murders",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3708,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>The Borden murders are the most infamous double murders in American History, but there's more to the story than you've been told. On the morning of August 4, 1892, Lizzy's step mother, Abby, was bludgeoned to death in an upstairs bedroom of the family home. A few hours later, Lizzie's father, Andrew, met the same fate on the couch in the downstairs family room. Lizzie and the maid were the only other people home. But Lizzie swore she didn't do it--and there was little evidence to prove that she did.  So who did killed these people? And why? Detectives in 2021 are taking another look at the case.<br>\n<br>\n<a href=\"https://www.patreon.com/posts/true-crime-live-73308747\">FAM!! THE FULL VIDEO OF OUR LIVE SHOW FILMED AT OBSESSED FEST  IS NOW LIVE ON PATREON!</a> The Broadway Dancers! The Obsessed Fest crowd! The Energy! The laughs!! <a href=\"https://www.patreon.com/posts/true-crime-live-73308747\">You can see it all now by joining here!</a><br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 300 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Bad Vegan\" \"LuLaRich\" \"John Wayne Gacy: Devil in Disguise\" \"Night Stalker\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a> <br>\n<br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 18 Oct 2022 09:58:26 +0000",
  "guid": "tag:audioboom.com,2022-10-18:/posts/8176531",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}