{
  "title": "Ep 189: The Psych Files Brief #6 - Facebook Untagging, Money and Happiness, and Memory and Aging",
  "pubDate": "Wed, 13 Feb 2013 14:48:02 +0000",
  "guid": "e5af228a9da24cbeaedee7be259cdebf",
  "link": "https://traffic.libsyn.com/secure/thepsychfiles/TPF_189_Brief6_021113.mp3",
  "itunes:image": "",
  "description": "<p>We have some great articles covered in this episode so I hope you find them thought-provoking. We cover four topics, all of which can be relevant to your everyday life.  First, a throwback to a previous episode on how to spend your money; experiences only beat out material possessions if they are spent with others. Social settings beat solitary settings every time.<br /><br />Next, did you know a social networking site you frequent may be your approach to impression management? Yes, I am talking about Facebook. Untagging, deleting, and liking certain pages, the site gives you the ability to boost your first impression and prospective employers are treating your wall like a newer, more honest resume.<br /><br />As a college student there are two things I love: procrastinating and sleeping. Our third article revolves around memory and its relation to sleep. No more all nighters cramming for exams; slow wave sleep is the key to memory recall and academic success, but only in young adults.<br /><br />Lastly, we found how smiling can lower dominance in serious situations. If you’re going to get in a fight you better do it with a frown. </p>",
  "content:encoded": "<p>We have some great articles covered in this episode so I hope you find them thought-provoking. We cover four topics, all of which can be relevant to your everyday life.  First, a throwback to a previous episode on how to spend your money; experiences only beat out material possessions if they are spent with others. Social settings beat solitary settings every time.Next, did you know a social networking site you frequent may be your approach to impression management? Yes, I am talking about Facebook. Untagging, deleting, and liking certain pages, the site gives you the ability to boost your first impression and prospective employers are treating your wall like a newer, more honest resume.As a college student there are two things I love: procrastinating and sleeping. Our third article revolves around memory and its relation to sleep. No more all nighters cramming for exams; slow wave sleep is the key to memory recall and academic success, but only in young adults.Lastly, we found how smiling can lower dominance in serious situations. If you’re going to get in a fight you better do it with a frown. </p>",
  "enclosure": "",
  "itunes:duration": "34:25",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "We have some great articles covered in this episode so I hope you find them thought-provoking. We cover four topics, all of which can be relevant to your everyday life.  First, a throwback to a previous episode on how to spend your money;...",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "We have some great articles covered in this episode so I hope you find them thought-provoking. We cover four topics, all of which can be relevant to your everyday life.  First, a throwback to a previous episode on how to spend your money; experiences only beat out material possessions if they are spent with others. Social settings beat solitary settings every time. Next, did you know a social networking site you frequent may be your approach to impression management? Yes, I am talking about Facebook. Untagging, deleting, and liking certain pages, the site gives you the ability to boost your first impression and prospective employers are treating your wall like a newer, more honest resume. As a college student there are two things I love: procrastinating and sleeping. Our third article revolves around memory and its relation to sleep. No more all nighters cramming for exams; slow wave sleep is the key to memory recall and academic success, but only in young adults. Lastly, we found how smiling can lower dominance in serious situations. If you’re going to get in a fight you better do it with a frown."
}