{
  "title": "TU52: Using Mindfulness, Movement and Yoga to Manage Arousal, with Guest Kelly Inselmann",
  "link": "https://therapistuncensored.com/episodes/tu52-using-mindfulness-movement-and-yoga-to-manage-arousal-with-guest-kelly-inselmann/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu52-using-mindfulness-movement-and-yoga-to-manage-arousal-with-guest-kelly-inselmann",
  "pubDate": "Mon, 08 Jan 2018 12:01:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=5823",
  "description": "Use these neuroscience-backed techniques to conquer your anxiety and depression with a few simple yoga and mindfulness principles.\n\nThis podcast will teach you how combining movement, rhythm and sound as well as practicing mindfulness can allow for a calm alertness and tackle everyday life. Psychotherapist and Yoga Instructor Kelly Inselmann joins Dr. Ann Kelley in an extensive discussion about tapping into your body and gaining a better understanding and awareness of it to ultimately improve your mental health.\n\nThis podcast is paired with a bonus episode, a 12-minute track of a high-quality mediation specifically for you, our listeners. Thank you Kelly for this offering! Click here to hear that Bonus Meditation. \n\n \n\nWho is Kelly Inselmann: \n\n\n\nKelly is a psychotherapist and yoga instructor in Austin, TX, and Sue is super-thrilled she’s also a Certified Group Psychotherapist. Kelly studies and teaches kundalini yoga as taught by Yogi Bhajan. She began her study 25 years ago and is certified as a yoga teacher at the highest level (500 hours). She continues to actively study with senior teachers throughout the country. She is a certified yoga therapist through the International Association of Yoga Therapists.\n\n \n\n0:00-15:00\n\nIntroduction (you may want to start w/ the bonus track first)\n\nMindfulness and coming into the present moment\n\nPractices and meditation as being tools for consciousness and learning to be with yourself\n\nPrinciples of Kundalini Yoga: movement, rhythm & sound\n\nSaying a mantra out loud gets your circulation moving and balances your hemispheres\n\nCombination of meditation and movement works through bilateral stimulation, soothing the amygdule\n\nHow Kelly integrated Kundalini into her life and practice\n\nEfficiency of Kundalini\n\nImportance of choosing the right class and teacher\n\nEssentials\n\n15:00-30:00\n\nYoga allowing for a full body experience\n\nGetting in tune with your body and recognizing limits allows for neuro-plasticity in the brain and increases capacity to endure discomfort\n\nEffects of integration, particularly through bilateral stimulation\n\nAlternate nostril breathing creates a relaxation effect and energy alternatively: a calm alert\n\nAchieving clarity in your mind and more awareness about your body\n\nImpact on brain development: increased grey matter in cortex, hippocampus\n\nCreation of new neural pathways, increasing neural pathways allows for mental and physical regulation\n\nImportance of mantra for later recollection to cue self. Using a mantra to bring your whole system to a calmer place.\n\n30:00-45:00\n\nImportance of connecting to group not only in therapy but in yoga as well\n\nIntegrating yoga and meditation just twenty minutes a day at home could have an extremely beneficial outcome\n\nMeditation is easier when moving because it releases tensions and transitions into a state of relaxation, allows you to get in touch with your breathing\n\nEffect of yoga in aging and mental decline: lowered inflammation in the body and improved memory\n\nWrap up\n\n \n\n \n\nResources:\n\nYoga and Talk, Integrating Yoga and Psychotherapy – Kelly Inselmann\n\nJoy Boots for Cancer Survivors – Kelly Inselmann\n\nTrauma Sensitive Yogo in Therapy: Bringing the Body Into Treatment by David Emerson\n\nOvercoming Trauma Through Yoga: Reclaiming your body by David Emerson\n\n \n\nTweet",
  "enclosure": "",
  "itunes:subtitle": "Use these neuroscience-backed techniques to conquer your anxiety and depression with a few simple yoga and mindfulness principles. - This podcast will teach you how combining movement, rhythm and sound as well as practicing mindfulness can allow for a...",
  "itunes:summary": "Conquer your stress and worry using the neuroscience-backed techniques in this episode.  Movement and yoga can enhance the depth of therapy and assist in reducing your upset no matter where you are.  Also see the bonus track that accompanies this episode, a 12-minute high-quality meditation that you definitely want to give a try! Don&apos;t be scared, you&apos;ll be surprised you like it.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "46:54"
}