{
  "title": "Earnings, Eggnog, and Year-End Financial Advice",
  "pubDate": "Fri, 20 Dec 2019 21:35:49 +0000",
  "guid": "a2790c6a-3fa0-4d16-aa38-0e3d419e6311",
  "link": "https://fool.libsyn.com/earnings-eggnog-and-year-end-financial-advice",
  "itunes:image": "",
  "description": "<p>Nike scores with its Jordan brand. IAC buys Care.com for $500 million. FedEx delivers disappointing earnings. Bed Bath & Beyond surges after its new CEO cleans house. And General Mills gets a big boost from Blue Buffalo. Motley Fool analysts Ron Gross and Jason Moser discuss those stories, weigh in on surprising earnings from Blackberry and Winnebago, and debate the relative merits of eggnog and mistletoe. And we talk about why American Tower and Cerence are two stocks to watch. Plus, Motley Fool retirement expert Robert Brokamp serves up some year-end financial advice and talks retirement and saving for college.<br /> <br /> GETQUIP.COM/fool to save on gift sets and to get your first refill FREE with a refill plan.</p> <p> </p>",
  "content:encoded": "<p>Nike scores with its Jordan brand. IAC buys Care.com for $500 million. FedEx delivers disappointing earnings. Bed Bath & Beyond surges after its new CEO cleans house. And General Mills gets a big boost from Blue Buffalo. Motley Fool analysts Ron Gross and Jason Moser discuss those stories, weigh in on surprising earnings from Blackberry and Winnebago, and debate the relative merits of eggnog and mistletoe. And we talk about why American Tower and Cerence are two stocks to watch. Plus, Motley Fool retirement expert Robert Brokamp serves up some year-end financial advice and talks retirement and saving for college.  GETQUIP.COM/fool to save on gift sets and to get your first refill FREE with a refill plan.</p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "39:57",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Nike scores with its Jordan brand. IAC buys Care.com for $500 million. FedEx delivers disappointing earnings. Bed Bath & Beyond surges after its new CEO cleans house. And General Mills gets a big boost from Blue Buffalo. Motley Fool analysts Ron...",
  "itunes:episodeType": "full"
}