{
  "title": "Update on the fake story about the river laborers paying people to whip them",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/29/update-on-the-fake-story-about-the-river-laborers-paying-people-to-whip-them/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/29/update-on-the-fake-story-about-the-river-laborers-paying-people-to-whip-them/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Sat, 29 Oct 2022 13:36:10 +0000",
  "category": [
    "Economics",
    "Zombies"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=47956",
  "description": "As you might remember from a few months ago, there was a story going around that some economists just looooved to tell. The story had all sorts of attributes that you might expect would make economists happy, including a paradox &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/29/update-on-the-fake-story-about-the-river-laborers-paying-people-to-whip-them/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>As you might remember <a href=\"https://statmodeling.stat.columbia.edu/2022/03/06/who-whips-the-whippers-an-infinite-regress-of-political-economy/\">from a few months ago</a>, there was a story going around that some economists just looooved to tell.  The story had all sorts of attributes that you might expect <a href=\"https://statmodeling.stat.columbia.edu/2018/04/26/quick-rule-thumb-someone-seems-acting-like-jerk-economist-will-defend-behavior-essence-morality-someone-seems-something-nice/\">would make economists happy</a>, including a paradox in which apparently bad behavior (whipping people to get them to work harder) was actually good, a subplot in which a do-gooder from the outside just doesn&#8217;t understand the real world, and an ethnic slur!  What more could you possibly ask for?</p>\n<p>Well, you could ask that, if the story is being reported as being true, that there was any evidence it actually happened.</p>\n<p>Below are a few versions of the story.</p>\n<p>From Stephen Cheung in 2018:</p>\n<blockquote><p>In 1970, Toronto’s John McManus was my guest in Seattle. I chatted to him about what happened when I was a refugee in wartime Guangxi. The journey from Liuzhou to Guiping was by river, and there were men on the banks whose job was to drag the boat with ropes. There was also an overseer armed with a whip. According to my mother, the whipper was hired to do just that by the boatmen! My tale went the rounds, and it was seized by a number of neo-institutional economists. . . . However, this could be a story invented by my mother – the smartest person I have ever known – to entertain a boy of seven!</p></blockquote>\n<p>From Michael Munger in 2018:</p>\n<blockquote><p>There’s a famous example in China, where a group of coolies … have to pull a barge up the Yangtze River … There’s a trade-off … how do you make the 30 guys work hard? The insight of the team production problem is we need … division of labor. … If I’m pulling, I can’t spend my time watching you and you can’t spend your time watching me. We’ll create a new job, called the monitor. … We’ll give the monitor a whip. Now this looks like slavery. The great thing about this, and this is from an article by an economist named Steven NS Cheung. He found that this guy with a whip&#8212;and this is the most incredible thing Russ!&#8212;this guy with a whip was hired and paid by the coolies!</p></blockquote>\n<p>Interesting how, when a story is described as &#8220;incredible,&#8221; it often is literally not credible.</p>\n<p>Clement and McCormick (1989):</p>\n<blockquote><p>[the] famous Chinese boatpullers fable [where] the monitor uses his vision, intuition, and experience to determine shirking, counseling the loafers with his whip.</p></blockquote>\n<p>Super-clever and counterintuitive to describe whipping as &#8220;counseling&#8221;:  that&#8217;s the kind of outside-the-box thinking that will take you far in academia.</p>\n<p>Supreet Kaur, Michael Kremer, and Sendhil Mullainathan (2015):</p>\n<blockquote><p>. . . in a story by Steven Cheung (1983, 8): “On a boat trip up China’s Yangtze River in the 19th Century, a titled English woman complained to her host of the cruelty to the oarsmen. One burly coolie stood over the rowers with a whip, making sure there were no laggards. Her host explained that the boat was jointly owned by the oarsmen, and that they hired the man responsible for flogging.”</p></blockquote>\n<p>This one&#8217;s notable in that it puts an entire passage in quotes, but it turns out the passage was not in Cheung (1983) at all&#8212;not on page 8 or anywhere else in that article&#8212;it actually came from a collection from 1998 of old Harvard Business School exam questions.</p>\n<p>It&#8217;s an awesome transposition in that it adds the &#8220;titled English woman,&#8221; who is a stand-in for all those soft-headed non-economists out there who aren&#8217;t willing to think the unthinkable etc., and also it changes various details, for example the people pulling the boat became oarsman, and of course the word &#8220;coolie&#8221; was introduced.  I guess he had to be &#8220;burly,&#8221; what with all the flogging he had to do!  In a particularly modern touch, the host was there to &#8220;explain&#8221; the principles of Econ 101 to the silly lady.</p>\n<p>And what about the woman being &#8220;titled&#8221;&#8212;that particular elaboration seems gratuitous, no?  But it fits in well with economists&#8217; view of themselves as tribunes of the people, consumer sovereignty and all that.  The story wouldn&#8217;t work so well if the person who &#8220;complained&#8221; was herself poor and maybe some had experience with physical pain herself.</p>\n<p>On the plus side, Kaur et al. <a href=\"https://www.journals.uchicago.edu/doi/abs/10.1086/721271\">issued a correction</a>:</p>\n<blockquote><p>While the incorrect quote also appears in other earlier sources, it does not appear in Cheung’s original article. . . . The inaccurate quote was included simply as a way to illustrate the idea that joint production might necessitate the need for monitoring. . . . However, the quote is in no way central to the core point of the paper, or even for the discussion in section VI of the paper. . . . this incorrect quote can be omitted from the paper without any impact on the substance of the paper.</p></blockquote>\n<p>I think they&#8217;re right&#8212;the paper would&#8217;ve been just fine without the quote&#8212;it&#8217;s just funny that 3 authors and some number of reviewers and journal editors all read the paper, and none of them noticed how ridiculous the story was.</p>\n<p>And just one more thing.  Let&#8217;s accept that the substance of the paper is unaffected by the whipped-boatmen story.  But, the fact that many economists have presented the story as true, even though it&#8217;s actually the result of a series of wild embellishments from an initially speculative source . . . that&#8217;s interesting, right?  I don&#8217;t have it in me to write an article on the topic that would pass muster at the Journal of Political Economy (or any journal at all!), but I think there&#8217;s something there!</p>\n<p>To put it another way, if the whipped-boatmen story is so consistent with the substantive message of the paper that it was included <em>as an example to demonstrate the theory</em>,(as the authors put it in their rejoinder, &#8220;The inaccurate quote was included simply as a way to illustrate the idea that joint production might necessitate the need for monitoring.&#8221;), and then it turns out the story is false, then maybe this should cast some doubt on said theory?  Maybe joint production might not necessitate the need for monitoring as often as they think?  At least not in the sense of &#8220;counseling the loafers with his whip&#8221;?</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/29/update-on-the-fake-story-about-the-river-laborers-paying-people-to-whip-them/feed/",
  "slash:comments": 16
}