{
  "title": "S5 Ep48: Backstage: Making the most of climate modelling",
  "link": "https://audioboom.com/posts/7281861",
  "itunes:episode": 48,
  "itunes:title": "Backstage: Making the most of climate modelling",
  "itunes:season": 5,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1511,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this episode of 'The Sound of Economics', Bruegel senior fellow Georg Zachmann continues the Backstage series with an interview with Massimo Tavoni, professor at the Politecnico di Milano and director of EIEE.</div>\n<div><br>\n</div>\n<div>The discussion point is climate modelling - specifically its use and the necessity of complexity in some of its formulations.</div>\n<div><br>\n</div>\n<div>Some climate models are very straightforward, and this allows for the building of a solid base. But interaction between complex systems requires consideration of a multitude of factors, not all of which are easily measurable.</div>\n<div><br>\n</div>\n<div>Modelling can be productive as a means of plotting a route to a policy goal such as the Paris Agreement. And the outcomes are best viewed as producing only one of many possible routes that could be taken.</div>\n<div><br>\n</div>\n<div>These models are increasingly relevant for numerous sectors, all beginning to factor in not only climate change but climate-change policy.</div>\n<div><br>\n</div>\n<div>If you are interested in more on this topic, we recommend the Bruegel Blueprint co-written by Georg Zachmann with Grégory Caleys and Gustav Fredriksson on <a href=\"http://bruegel.org/2018/11/distributional-effects-of-climate-policies/\">the distributional effects of climate policies</a>.</div>\n<div>\n<br>\n<br>\n\n</div>\n",
  "itunes:summary": "Bruegel senior fellow Georg Zachmann interviews Massimo Tavoni, professor at the Politecnico di Milano and director of EIEE, on the purpose of climate and energy models, what they can deliver and what are the most recent developments in their formulation.",
  "pubDate": "Thu, 06 Jun 2019 14:16:58 +0000",
  "guid": "tag:audioboom.com,2019-06-06:/posts/7281861",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}