{
  "title": "Unsupervised Anomaly Detection of Paranasal Anomalies in the Maxillary Sinus. (arXiv:2211.01371v1 [eess.IV])",
  "link": "http://arxiv.org/abs/2211.01371",
  "description": "<p>Deep learning (DL) algorithms can be used to automate paranasal anomaly\ndetection from Magnetic Resonance Imaging (MRI). However, previous works relied\non supervised learning techniques to distinguish between normal and abnormal\nsamples. This method limits the type of anomalies that can be classified as the\nanomalies need to be present in the training data. Further, many data points\nfrom normal and anomaly class are needed for the model to achieve satisfactory\nclassification performance. However, experienced clinicians can segregate\nbetween normal samples (healthy maxillary sinus) and anomalous samples\n(anomalous maxillary sinus) after looking at a few normal samples. We mimic the\nclinicians ability by learning the distribution of healthy maxillary sinuses\nusing a 3D convolutional auto-encoder (cAE) and its variant, a 3D variational\nautoencoder (VAE) architecture and evaluate cAE and VAE for this task.\nConcretely, we pose the paranasal anomaly detection as an unsupervised anomaly\ndetection problem. Thereby, we are able to reduce the labelling effort of the\nclinicians as we only use healthy samples during training. Additionally, we can\nclassify any type of anomaly that differs from the training distribution. We\ntrain our 3D cAE and VAE to learn a latent representation of healthy maxillary\nsinus volumes using L1 reconstruction loss. During inference, we use the\nreconstruction error to classify between normal and anomalous maxillary\nsinuses. We extract sub-volumes from larger head and neck MRIs and analyse the\neffect of different fields of view on the detection performance. Finally, we\nreport which anomalies are easiest and hardest to classify using our approach.\nOur results demonstrate the feasibility of unsupervised detection of paranasal\nanomalies from MRIs with an AUPRC of 85% and 80% for cAE and VAE, respectively.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+Bhattacharya_D/0/1/0/all/0/1\">Debayan Bhattacharya</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Behrendt_F/0/1/0/all/0/1\">Finn Behrendt</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Becker_B/0/1/0/all/0/1\">Benjamin Tobias Becker</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Beyersdorff_D/0/1/0/all/0/1\">Dirk Beyersdorff</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Petersen_E/0/1/0/all/0/1\">Elina Petersen</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Petersen_M/0/1/0/all/0/1\">Marvin Petersen</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Cheng_B/0/1/0/all/0/1\">Bastian Cheng</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Eggert_D/0/1/0/all/0/1\">Dennis Eggert</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Betz_C/0/1/0/all/0/1\">Christian Betz</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Hoffmann_A/0/1/0/all/0/1\">Anna Sophie Hoffmann</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Schlaefer_A/0/1/0/all/0/1\">Alexander Schlaefer</a>"
}