{
  "id": "tag:blogger.com,1999:blog-4371296950668142214.post-5456544175244277583",
  "published": "2021-08-05T09:57:00.002+10:00",
  "updated": "2021-08-05T18:13:13.363+10:00",
  "title": "Aussies can now save vaccination certificates on Android devices",
  "content": "Since the onset of the COVID-19, Australia has faced many seasons and surges of the pandemic.  As we continue to battle the Delta variant across multiple states, Government and health authorities are working harder than ever to test and vaccinate people – and pave the way to safely open up communities.&nbsp;<div><br /></div><div>To support these efforts, we’ve been working with <a href=\"https://www.servicesaustralia.gov.au/\" target=\"_blank\">Services Australia</a> to give you a convenient and secure way to view, save and show your vaccination status and information, straight from your smartphone.&nbsp;</div><div><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-VSwSUQ3-hZE/YQsnaD1mvSI/AAAAAAAAC3k/5_Ejdko0TrYrD1kLKDQdJcPELK5cUsxQgCLcBGAsYHQ/s2048/AU-Covid%2B1x.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1367\" data-original-width=\"2048\" height=\"426\" src=\"https://1.bp.blogspot.com/-VSwSUQ3-hZE/YQsnaD1mvSI/AAAAAAAAC3k/5_Ejdko0TrYrD1kLKDQdJcPELK5cUsxQgCLcBGAsYHQ/w640-h426/AU-Covid%2B1x.jpg\" width=\"640\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div>So, we just expanded our COVID Card feature to Australia – providing a simple, private and secure way to save and access vaccination information on Android smartphones after you’ve had your second jab. Vaccine information is only stored on your device (it is not stored by Google).&nbsp;</div><div><br /></div><div>To access your vaccination certificate, simply login to the <a href=\"https://play.google.com/store/apps/details?id=au.gov.dhs.expressplus.medicare&amp;hl=en_AU&amp;gl=US\">Express Plus Medicare app</a> or via the Medicare portal of the <a href=\"https://my.gov.au/\">MyGov website</a> and select the options to ‘View your COVID-19 digital certificate’ and ‘Save to Phone.’&nbsp;&nbsp;</div><div><br /></div><div>For added convenience, you can access your vaccine information even when you’re offline, which means you do not need mobile or wifi connection. If you have the Google Pay app on your Android phone, you can also access the certificate from the same place where you access your other cards and other passes.</div><div><br /></div><div>Every time you access your certificate, you will be asked for the password, pin or biometric method that you have set up for your Android device. If you do not have this set up on your phone, you’ll be prompted to do so to strengthen security.&nbsp;</div><div><br /></div><div>The launch of the COVID Card feature in Australia builds on the many ways we’ve been <a href=\"https://australia.googleblog.com/2020/04/how-were-responding-to-covid-19.html\">working to help</a> authorities, businesses and Australians stay safe and informed during the pandemic. This includes surfacing the <a href=\"https://www.google.com/search?q=coronavirus\">latest updates, health and travel advice from authorities</a>, and giving almost $5M AUD in ad grants to the Federal Government to support these public health initiatives. We’ve provided regular updates on <a href=\"https://trends.google.com/trends/story/US_cu_4Rjdh3ABAABMHM_en_en-AU\">Search trends</a> and launched <a href=\"http://google.com/covid19/mobility\">COVID-19 Community Mobility Reports</a> to offer local insights on the impact of social distancing. And to help meet the cost of the virus, we’ve offered $20M in ad credits to businesses to support their pivot to online trading during these challenging times. To keep across the latest news, check out our local COVID microsite featuring the latest updates and health resources:  <a href=\"http://google.com.au/covid19\">google.com.au/covid19.</a>&nbsp;</div><div><br /></div><div><span class=\"byline-author\">Posted by Samantha Yorke, Government Affairs and Public Policy, Google Australia</span></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "anzprteam",
    "uri": "http://www.blogger.com/profile/06099752084931732403",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}