{
  "title": "Episode 153: &#8220;Heroes and Villains&#8221; by the Beach Boys",
  "link": "https://500songs.com/podcast/episode-153-heroes-and-villains-by-the-beach-boys/",
  "pubDate": "Tue, 13 Sep 2022 05:55:28 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1330",
  "description": "Episode one hundred and fifty-three of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Heroes and Villains” by the Beach Boys, and the collapse of the <em>Smile</em> album. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a sixteen-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/71907204\">\"I Had Too Much to Dream Last Night\" by the Electric Prunes.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nThere is no Mixcloud this week, because there were too many Beach Boys songs in the episode.\n\nI used many resources for this episode. As well as the books I referred to in all the Beach Boys episodes, listed below, I used Domenic Priore's book <a href=\"https://amzn.to/3U32SfQ\"><em>Smile: The Story of Brian Wilson's Lost Masterpiece</em></a> and <a href=\"https://amzn.to/3LalmH1\">Richard Henderson's 33 1/3 book on Van Dyke Parks' Song Cycle</a>.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes, including several on both the Beach Boys and Gary Usher.  His books can be found at <a href=\"https://payhip.com/CMusicBooks\">https://payhip.com/CMusicBooks</a>\n\nAndrew Doe’s <a href=\"http://www.bellagio10452.com/\">Bellagio 10452 </a>site is an invaluable resource.\n\nJon Stebbins’ <a href=\"https://amzn.to/2S0eQIs\">The Beach Boys FAQ </a>is a good balance between accuracy and readability.\n\nAnd <a href=\"https://amzn.to/3i22CcH\">Philip Lambert’s <em>Inside the Music of Brian Wilson</em></a> is an excellent, though sadly out of print, musicological analysis of Wilson’s music from 1962 through 67.\n\n<a href=\"https://amzn.to/3RXpjRD\"><em>Catch a Wave: The Rise, Fall, and Redemption of the Beach Boys' Brian Wilson</em></a> by Peter Ames Carlin is the best biography of Wilson.\n\nI have also referred to Brian Wilson’s autobiography, <em><a href=\"https://amzn.to/3AMbmys\">I Am Brian Wilson</a></em>, and to Mike Love’s, <em><a href=\"https://amzn.to/3AMbmys\">Good Vibrations: My Life as a Beach Boy</a>.</em>\n\nAs a good starting point for the Beach Boys’ music in general, I would recommend <a href=\"https://amzn.to/3i0tsC9\">this budget-priced three-CD set</a>, which has a surprisingly good selection of their material on it, including the single version of “Heroes and Villains”.\n\nThe box set <a href=\"https://amzn.to/3wC2Ylh\"><em>The Smile Sessions </em></a> contains an attempt to create a finished album from the unfinished sessions, plus several CDs of outtakes and session material.\n\n<strong>Transcript</strong>\n[Opening -- \"intro to the album\" studio chatter into \"Our Prayer\"]\nBefore I start, I'd just like to note that this episode contains some discussion of mental illness, including historical negative attitudes towards it, so you may want to check the transcript or skip this one if that might be upsetting.\n\nIn November and December 1966, the filmmaker David Oppenheim and the conductor and composer Leonard Bernstein collaborated on a TV film called \"Inside Pop: The Rock Revolution\".  The film was an early attempt at some of the kinds of things this podcast is doing, looking at how music and social events interact and evolve, though it was dealing with its present rather than the past.\nThe film tried to cast as wide a net as possible in its fifty-one minutes. It looked at two bands from Manchester -- the Hollies and Herman's Hermits -- and how the people identified as their leaders, \"Herman\" (or Peter Noone) and Graham Nash, differed on the issue of preventing war:\n[Excerpt: Inside Pop, the Rock Revolution]\n\nAnd it made a star of East Coast teenage singer-songwriter Janis Ian with her song about interracial relationships, \"Society's Child\":\n\n[Excerpt: Janis Ian, \"Society's Child\"]\n\nAnd Bernstein spends a significant time, as one would expect, analysing the music of the Beatles and to a lesser extent the Stones, though they don't appear in the show. Bernstein does a lot to legitimise the music just by taking it seriously as a subject for analysis, at a time when most wouldn't:\n\n[Excerpt: Leonard Bernstein talking about \"She Said She Said\"]\n\nYou can't see it, obviously, but in the clip that's from, as the Beatles recording is playing, Bernstein is conducting along with the music, as he would a symphony orchestra, showing where the beats are falling.\n\nBut of course, given that this was filmed in the last two months of 1966, the vast majority of the episode is taken up with musicians from the centre of the music world at that time, LA.\n\nThe film starts with Bernstein interviewing Tandyn Almer,  a jazz-influenced songwriter who had recently written the big hit \"Along Comes Mary\" for The Association:\n[Excerpt: Inside Pop: The Rock Revolution]\n\nIt featured interviews with Roger McGuinn, and with the protestors at the Sunset Strip riots which were happening contemporaneously with the filming:\n\n[Excerpt: Inside Pop: The Rock Revolution]\n\nAlong with Frank Zappa's rather acerbic assessment of the potential of the youth revolutionaries:\n\n[Excerpt: Inside Pop: The Rock Revolution]\n\nAnd ended (other than a brief post-commercial performance over the credits by the Hollies) with a performance by Tim Buckley, whose debut album, as we heard in the last episode, had featured Van Dyke Parks and future members of the Mothers of Invention and Buffalo Springfield:\n\n[Excerpt: Inside Pop: The Rock Revolution]\n\nBut for many people the highlight of the film was the performance that came right before Buckley's, film of Brian Wilson playing a new song from the album he was working on. One thing I should note -- many sources say that the voiceover here is Bernstein. My understanding is that Bernstein wrote and narrated the parts of the film he was himself in, and Oppenheim did all the other voiceover writing and narration, but that Oppenheim's voice is similar enough to Bernstein's that people got confused about this:\n\n[Excerpt: Inside Pop: The Rock Revolution]\n\nThat particular piece of footage was filmed in December 1966, but it wasn't broadcast until April the twenty-fifth, 1967, an eternity in mid-sixties popular music. When it was broadcast, that album still hadn't come out.\n\nPrecisely one week later, the Beach Boys' publicist Derek Taylor announced that it never would:\n\n[Excerpt: Brian Wilson, \"Surf's Up\"]\n\nOne name who has showed up in a handful of episodes recently, but who we've not talked that much about, is Van Dyke Parks. And in a story with many, many, remarkable figures, Van Dyke Parks may be one of the most remarkable of all. Long before he did anything that impinges on the story of rock music, Parks had lived the kind of life that would be considered unbelievable were it to be told as fiction.\n\nParks came from a family that mixed musical skill, political progressiveness, and achievement. His mother was a scholar of Hebrew, while his father was a neurologist, the first doctor to admit Black patients to a white Southern hospital, and had paid his way through college leading a dance band.\nParks' father was also, according to the 33 1/3 book on Song Cycle, a member of \"John Philip Sousa's Sixty Silver Trumpets\", but literally every reference I can find to Sousa leading a band of that name goes back to that book, so I've no idea what he was actually a member of, but we can presume he was a reasonable musician.\n\nYoung Van Dyke started playing the clarinet at four, and was also a singer from a very early age, as well as playing several other instruments. He went to the American Boychoir School in Princeton, to study singing, and while there he sang with Toscaninni, Thomas Beecham, and other immensely important conductors of the era.\n\nHe also had a very special accompanist for one Christmas carolling session. The choir school was based in Princeton, and one of the doors he knocked on while carolling was that of Princeton's most famous resident, Albert Einstein, who heard the young boy singing \"Silent Night\", and came out with his violin and played along.\n\nYoung Van Dyke was only interested in music, but he was also paying the bills for his music tuition himself -- he had a job. He was a TV star. From the age of ten, he started getting roles in TV shows -- he played the youngest son in the 1953 sitcom Bonino, about an opera singer, which flopped because it aired opposite the extremely popular Jackie Gleason Show. He would later also appear in that show, as one of several child actors who played the character of Little Tommy Manicotti, and he made a number of other TV appearances, as well as having a small role in Grace Kelly's last film, The Swan, with Alec Guinness and Louis Jourdain.\n\nBut he never liked acting, and just did it to pay for his education. He gave it up when he moved on to the Carnegie Institute, where he majored in composition and performance. But then in his second year, his big brother Carson asked him to drop out and move to California.\n\nCarson Parks had been part of the folk scene in California for a few years at this point. He and a friend had formed a duo called the Steeltown Two, but then both of them had joined the folk group the Easy Riders, a group led by Terry Gilkyson.\n\nBefore Carson Parks joined, the Easy Riders had had a big hit with their version of \"Marianne\", a calypso originally by the great calypsonian Roaring Lion:\n\n[Excerpt: The Easy Riders, \"Marianne\"]\n\nThey hadn't had many other hits, but their songs became hits for other people -- Gilkyson wrote several big hits for Frankie Laine, and the Easy Riders were the backing vocalists on Dean Martin's recording of a song they wrote, \"Memories are Made of This\":\n\n[Excerpt: Dean Martin and the Easy Riders, \"Memories are Made of This\"]\n\nCarson Parks hadn't been in the group at that point -- he only joined after they'd stopped having success -- and eventually the group had split up. He wanted to revive his old duo, the Steeltown Two, and persuaded his family to let his little brother Van Dyke drop out of university and move to California to be the other half of the duo. He wanted Van Dyke to play guitar, while he played banjo. Van Dyke had never actually played guitar before, but as Carson Parks later said \"in 90 days, he knew more than most folks know after many years!\"\n\nVan Dyke moved into an apartment adjoining his brother's, owned by Norm Botnick, who had until recently been the principal viola player in a film studio orchestra, before the film studios all simultaneously dumped their in-house orchestras in the late fifties, so was a more understanding landlord than most when it came to the lifestyles of musicians. Botnick's sons, Doug and Bruce, later went into sound engineering -- we've already encountered Bruce Botnick in the episode on the Doors, and he will be coming up again in the future.\n\nThe new Steeltown Two didn't make any records, but they developed a bit of a following in the coffeehouses, and they also got a fair bit of session work, mostly through Terry Gilkyson, who was by that point writing songs for Disney and would hire them to play on sessions for his songs. And it was Gilkyson who both brought Van Dyke Parks the worst news of his life to that point, and in doing so also had him make his first major mark on music.\n\nGilkyson was the one who informed Van Dyke that another of his brothers, Benjamin Riley Parks, had died in what was apparently a car accident. I say it was apparently an accident because Benjamin Riley Parks was at the time working for the US State Department, and there is apparently also some evidence that he was assassinated in a Cold War plot.\n\nGilkyson also knew that neither Van Dyke nor Carson Parks had much money, so in order to help them afford black suits and plane tickets to and from the funeral, Gilkyson hired Van Dyke to write the arrangement for a song he had written for an upcoming Disney film:\n\n[Excerpt: Jungle Book soundtrack, \"The Bare Necessities\"]\n\nThe Steeltown Two continued performing, and soon became known as the Steeltown Three, with the addition of a singer named Pat Peyton. The Steeltown Three recorded two singles, \"Rock Mountain\", under that group name:\n\n[Excerpt: The Steeltown Three, \"Rock Mountain\"]\n\nAnd a version of \"San Francisco Bay\" under the name The South Coasters, which I've been unable to track down. Then the three of them, with the help of Terry Gilkyson, formed a larger group in the style of the New Christy Minstrels -- the Greenwood County Singers. Indeed, Carson Parks would later claim that  Gilkyson had had the idea first -- that he'd mentioned that he'd wanted to put together a group like that to Randy Sparks, and Sparks had taken the idea and done it first.\n\nThe Greenwood County Singers had two minor hot one hundred hits, only one of them while Van Dyke was in the band -- \"The New 'Frankie and Johnny' Song\", a rewrite by Bob Gibson and Shel Silverstein of the old traditional song \"Frankie and Johnny\":\n\n[Excerpt: The Greenwood County Singers, \"The New Frankie and Johnny Song\"]\n\nThey also recorded several albums together, which gave Van Dyke the opportunity to practice his arrangement skills, as on this version of  \"Vera Cruz\" which he arranged:\n[Excerpt: The Greenwood County Singers, \"Vera Cruz\"]\n\nSome time before their last album, in 1965, Van Dyke left the Greenwood County Singers, and was replaced by Rick Jarrard, who we'll also be hearing more about in future episodes. After that album, the group split up, but Carson Parks would go on to write two big hits in the next few years. The first and biggest was a song he originally wrote for a side project. His future wife Gaile Foote was also a Greenwood County Singer, and the two of them thought they might become folk's answer to Sonny and Cher or Nino Tempo and April Stevens:\n\n[Excerpt: Carson and Gaile, \"Somethin' Stupid\"]\n\nThat obviously became a standard after it was covered by Frank and Nancy Sinatra. Carson Parks also wrote \"Cab Driver\", which in 1968 became the last top thirty hit for the Mills Brothers, the 1930s vocal group we talked about way way back in episode six:\n\n[Excerpt: The Mills Brothers, \"Cab Driver\"]\n\nMeanwhile Van Dyke Parks was becoming part of the Sunset Strip rock and roll world. Now, until we get to 1967, Parks has something of a tangled timeline. He worked with almost every band around LA in a short period, often working with multiple people simultaneously, and nobody was very interested in keeping detailed notes. So I'm going to tell this as a linear story, but be aware it's very much not -- things I say in five minutes might happen after, or in the same week as, things I say in half an hour.\n\nAt some point in either 1965 or 1966 he joined the Mothers of Invention for a brief while. Nobody is entirely sure when this was, and whether it was before or after their first album. Some say it was in late 1965, others in August 1966, and even the kind of fans who put together detailed timelines are none the wiser, because no recordings have so far surfaced of Parks with the band. Either is plausible, and the Mothers went through a variety of keyboard players at this time -- Zappa had turned to his jazz friend Don Preston, but found Preston was too much of a jazzer and told him to come back when he could play \"Louie Louie\" convincingly, asked Mac Rebennack to be in the band but sacked him pretty much straight away for drug use, and eventually turned to Preston again once Preston had learned to rock and roll. Some time in that period, Van Dyke Parks was a Mother, playing electric harpsichord. He may even have had more than one stint in the group -- Zappa said \"Van Dyke Parks played electric harpsichord in and out.\"\n\nIt seems likely, though, that it was in summer of 1966, because in an interview published in Teen Beat Magazine in December 66, but presumably conducted a few months prior, Zappa was asked to describe the band members in one word each and replied:\n\"Ray—Mahogany\nRoy—Asbestos\nJim—Mucilage\nDel—Acetate\nVan Dyke—Pinocchio\nBilly—Boom\nI don't know about the rest of the group—I don't even know about these guys.\"\n\nSources differ as to why Parks didn't remain in the band -- Parks has said that he quit after a short time because he didn't like being shouted at, while Zappa said \"Van Dyke was not a reliable player. He didn't make it to rehearsal on time and things like that.\"\n\nBoth may be true of course, though I've not heard anyone else ever criticise Parks for his reliability. But then also Zappa had much more disciplinarian standards than most rock band leaders.\n\nIt's possibly either through Zappa that he met Tom Wilson, or through Tom Wilson that he met Frank Zappa, but either way Parks, like the Mothers of Invention, was signed to MGM records in 1966, where he released two solo singles co-produced by Wilson and an otherwise obscure figure named Tim Alvorado. The first was \"Number Nine\", which we heard last week, backed with \"Do What You Wanta\":\n[Excerpt: Van Dyke Parks, \"Do What You Wanta\"]\n\nAt least one source I've read says that the lyrics to \"Do What You Wanta\" were written not by Parks but by his friend Danny Hutton, but it's credited as a Parks solo composition on the label.\n\nIt was after that that the Van Dyke Parks band -- or as they were sometimes billed, just The Van Dyke Parks formed, as we discussed last episode, based around Parks, Steve Stills, and Steve Young, and they performed a handful of shows with bass player Bobby Rae and drummer Walt Sparman, playing a mix of original material, primarily Parks' songs, and covers of things like \"Dancing in the Street\". The one contemporaneous review of a live show I've seen talks about  the girls in the audience screaming and how \"When rhythm guitarist Steve Stillman imitated the Barry McGuire emotional scene, they almost went wiggy\".\n\nBut The Van Dyke Parks soon split up, and Parks the individual recorded his second single, \"Come to the Sunshine\":\n\n[Excerpt: Van Dyke Parks, \"Come to the Sunshine\"]\n\nAround the time he left the Greenwood County Singers, Van Dyke Parks also met Brian Wilson for the first time, when David Crosby took him up to Wilson's house to hear an acetate of the as-yet-unreleased track \"Sloop John B\". Parks was impressed by Wilson's arrangement techniques, and in particular the way he was orchestrating instrumental combinations that you couldn't do with a standard live room setup, that required overdubbing and close-micing. He said later \"The first stuff I heard indicated this kind of curiosity for the recording experience, and when I went up to see him in '65 I don't even think he had the voices on yet, but I heard that long rotational breathing, that long flute ostinato at the beginning... I knew this man was a great musician.\"\n[Excerpt: The Beach Boys, \"Sloop John B (instrumental)\"]\n\nIn most of 1966, though, Parks was making his living as a session keyboard player and arranger, and much of the work he was getting was through Lenny Waronker.\n\nWaronker was a second-generation music industry professional. His father, Si Waronker, had been a violinist in the Twentieth Century Fox studio orchestra before founding Liberty Records (the label which indirectly led to him becoming immortalised in children's entertainment, when Liberty Records star David Seville named his Chipmunk characters after three Liberty executives, with Simon being Si Waronker's full forename). The first release on Liberty Records had been a version of \"The Girl Upstairs\", an instrumental piece from the Fox film The Seven-Year Itch. The original recording of that track, for the film, had been done by the Twentieth Century Fox Orchestra, written and conducted by Alfred Newman, the musical director for Fox:\n\n[Excerpt: Alfred Newman, \"The Girl Upstairs\"]\n\nLiberty's soundalike version was conducted by Newman's brother Lionel, a pianist at the studio who later became Fox's musical director for TV, just as his brother was for film, but who also wrote many film scores himself.\n\nAnother Newman brother, Emil, was also a film composer, but the fourth brother, Irving, had gone into medicine instead. However, Irving's son Randy wanted to follow in the family business, and he and Lenny Waronker, who was similarly following his own father by working for Liberty Records' publishing subsidiary Metric Music, had been very close friends ever since High School. Waronker got Newman signed to Metric Music, where he wrote \"They Tell Me It's Summer\" for the Fleetwoods:\n\n[Excerpt: The Fleetwoods, \"They Tell Me It's Summer\"]\n\nNewman also wrote and recorded a single of his own in 1962, co-produced by Pat Boone:\n[Excerpt: Randy Newman, \"Golden Gridiron Boy\"]\n\nBefore deciding he wasn't going to make it as a singer and had better just be a professional songwriter.\nBut by 1966 Waronker had moved on from Metric to Warner Brothers, and become a junior A&R man. And he was put in charge of developing the artists that Warners had acquired when they had bought up a small label, Autumn Records. Autumn Records was a San Francisco-based label whose main producer, Sly Stone, had now moved on to other things after producing the hit record \"Laugh Laugh\" for the Beau Brummels:\n\n[Excerpt: The Beau Brummels, \"Laugh Laugh\"]\n\nThe Beau Brummels  had had another hit after that and were the main reason that Warners had bought the label, but their star was fading a little. Stone had also been mentoring several other groups, including the Tikis and the Mojo Men, who all had potential. Waronker gathered around himself a sort of brains trust of musicians who he trusted as songwriters, arrangers, and pianists -- Randy Newman, the session pianist Leon Russell, and Van Dyke Parks. Their job was to revitalise the career of the Beau Brummels, and to make both the Tikis and the Mojo Men into successes. The tactic they chose was, in Waronker's words, “Go in with a good song and weird it out.”\n\nThe first good song they tried weirding out was in late 1966, when Leon Russell came up with a clarinet-led arrangement of Paul Simon's \"59th Street Bridge Song (Feeling Groovy)\" for the Tikis, who performed it but who thought that their existing fanbase wouldn't accept something so different, so it was put out under another name, suggested by Parks, Harpers Bizarre:\n\n[Excerpt: Harpers Bizarre, \"Feeling Groovy\"]\n\nWaronker said of Parks and Newman “They weren’t old school guys. They were modern characters but they had old school values regarding certain records that needed to be made, certain artists who needed to be heard regardless. So there was still that going on. The fact that ‘Feeling Groovy’ was a number 10 hit nationwide and ‘Sit Down, I Think I Love You’  made the Top 30 on Western regional radio, that gave us credibility within the company. One hit will do wonders, two allows you to take chances.”\nWe heard \"Sit Down, I Think I Love You\" last episode -- that's the song by Parks' old friend Stephen Stills that Parks arranged for the Mojo Men:\n\n[Excerpt: The Mojo Men, \"Sit Down, I Think I Love You\"]\n\nDuring 1966 Parks also played on Tim Buckley's first album, as we also heard last episode:\n[Excerpt: Tim Buckley, \"Aren't You the Girl?\"]\n\nAnd he also bumped into Brian Wilson on occasion, as they were working a lot in the same studios and had mutual friends like Loren Daro and Danny Hutton, and he suggested the cello part on \"Good Vibrations\". Parks also played keyboards on \"5D\" by the Byrds:\n\n[Excerpt: The Byrds, \"5D (Fifth Dimension)\"]\n\nAnd on the Spirit of '67 album for Paul Revere and the Raiders, produced by the Byrds' old producer Terry Melcher. Parks played keyboards on much of the album, including the top five hit \"Good Thing\":\n[Excerpt: Paul Revere and the Raiders, \"Good Thing\"]\n\nBut while all this was going on, Parks was also working on what would become the work for which he was best known. As I've said, he'd met Brian Wilson on a few occasions, but it wasn't until summer 1966 that the two were formally introduced by Terry Melcher, who knew that Wilson needed a new songwriting collaborator, now Tony Asher's sabbatical from his advertising job was coming to an end, and that Wilson wanted someone who could do work that was a bit more abstract than the emotional material that he had been writing with Asher.\n\nMelcher invited both of them to a party at his house on Cielo Drive -- a house which would a few years later become notorious -- which was also attended by many of the young Hollywood set of the time. Nobody can remember exactly who was at the party, but Parks thinks it was people like Jack Nicholson and Peter and Jane Fonda.\n\nParks and Wilson hit it off, with Wilson saying later \"He seemed like a really articulate guy, like he could write some good lyrics\". Parks on the other hand was delighted to find that Wilson \"liked Les Paul, Spike Jones, all of these sounds that I liked, and he was doing it in a proactive way.\"\n\nBrian suggested Parks write the finished lyrics for \"Good Vibrations\", which was still being recorded at this time, and still only had Tony Asher's dummy lyrics,  but Parks was uninterested. He said that it would be best if he and Brian collaborate together on something new from scratch, and Brian agreed.\nThe first time Parks came to visit Brian at Brian's home, other than the visit accompanying Crosby the year before, he was riding a motorbike -- he couldn't afford a car -- and forgot to bring his driver's license with him. He was stopped by a police officer who thought he looked too poor to be in the area, but Parks persuaded the police officer that if he came to the door, Brian Wilson would vouch for him. Brian got Van Dyke out of any trouble because the cop's sister was a Beach Boys fan, so he autographed an album for her.\n\nBrian and Van Dyke talked for a while. Brian asked if Van Dyke needed anything to help his work go smoothly, and Van Dyke said he needed a car. Brian asked what kind. Van Dyke said that Volvos were supposed to be pretty safe. Brian asked how much they cost. Van Dyke said he thought they were about five thousand dollars. Brian called up his office and told them to get a cheque delivered to Van Dyke for five thousand dollars the next day, instantly earning Van Dyke's loyalty.\n\nAfter that, they got on with work. To start with, Brian played Van Dyke a melody he'd been working on, a melody based on a descending scale starting on the fourth:\n\n[Plays \"Heroes and Villains\" melody]\n\nParks told Wilson that the melody reminded him vaguely of Marty Robbins' country hit \"El Paso\" from 1959, a song about a gunfighter, a cantina, and a dancing woman:\n\n[Excerpt: Marty Robbins, \"El Paso\"]\n\nWilson said that he had been thinking along the same lines, a sort of old west story, and thought maybe it should be called \"Heroes and Villains\". Parks started writing, matching syllables to Wilson's pre-conceived melody -- \"I've been in this town so long that back in the city I've been taken for lost and gone and unknown for a long, long time\"\n\n[Excerpt: Brian Wilson and Van Dyke Parks, \"Heroes and Villains demo\"]\n\nAs Parks put it \"The engine had started. It was very much ad hoc. Seat of the pants. Extemporaneous values were enforced. Not too much precommitment to ideas. Or, if so, equally pursuing propinquity.\"\nSlowly, over the next several months, while the five other Beach Boys were touring, Brian and Van Dyke refined their ideas about what the album they were writing, initially called Dumb Angel but soon retitled Smile, should be.\n\nFor Van Dyke Parks it was an attempt to make music about America and American mythology. He was disgusted, as a patriot, with the Anglophilia that had swept the music industry since the arrival of the Beatles in America two and a half years earlier, particularly since that had happened so soon after the deaths both of President Kennedy and of Parks' own brother who was working for the government at the time he died.\n\nSo for him, the album was about America, about Plymouth Rock, the Old West, California, and Hawaii. It would be a generally positive version of the country's myth, though it would of course also acknowledge the bloodshed on which the country had been built:\n\n[Excerpt: The Beach Boys, \"Bicycle Rider\" section]\n\nAs he put it later \"I was dead set on centering my life on the patriotic ideal. I was a son of the American revolution, and there was blood on the tracks. Recent blood, and it was still drying. The whole record seemed like a real effort toward figuring out what Manifest Destiny was all about. We'd come as far as we could, as far as Horace Greeley told us to go. And so we looked back and tried to make sense of that great odyssey.\"\n\nBrian had some other ideas -- he had been studying the I Ching, and Subud, and he wanted to do something about the four classical elements, and something religious -- his ideas were generally rather unfocused at the time, and he had far more ideas than he knew what to usefully do with. But he was also happy with the idea of a piece about America, which fit in with his own interest in \"Rhapsody in Blue\", a piece that was about America in much the same way.\n\n\"Rhapsody in Blue\" was an inspiration for Brian primarily in how it weaved together variations on themes. And there are two themes that between them Brian was finding endless variations on. The first theme was a shuffling between two chords a fourth away from each other.\n\n[demonstrates G to C on guitar]\n\nWhere these chords are both major, that's the sequence for \"Fire\":\n\n[Excerpt: The Beach Boys, \"Mrs. O'Leary's Cow/Fire\"]\n\nFor the \"Who ran the Iron Horse?\" section of \"Cabin Essence\":\n\n[Excerpt: The Beach Boys, \"Cabinessence\"]\n\nFor \"Vegetables\":\n\n[Excerpt: The Beach Boys, \"Vegetables\"]\n\nAnd more.\nSometimes this would be the minor supertonic and dominant seventh of the key, so in C that would be Dm to G7:\n\n[Plays Dm to G7 fingerpicked]\n\nThat's the \"bicycle rider\" chorus we heard earlier, which was part of a song known as \"Roll Plymouth Rock\" or \"Do You Like Worms\":\n\n[Excerpt: The Beach Boys, \"Bicycle Rider\"]\n\nBut which later became a chorus for \"Heroes and Villains\":\n\n[Excerpt: The Beach Boys, \"Heroes and Villains\"]\n\nBut that same sequence is also the beginning of \"Wind Chimes\":\n\n[Excerpt: The Beach Boys, \"Wind Chimes\"]\n\nThe \"wahalla loo lay\" section of \"Roll Plymouth Rock\":\n\n[Excerpt: The Beach Boys, \"Roll Plymouth Rock\"]\n\nAnd others, but most interestingly, the minor-key rearrangement of \"You Are My Sunshine\" as \"You Were My Sunshine\":\n\n[Excerpt: The Beach Boys, \"You Were My Sunshine\"]\n\nI say that's most interesting, because that provides a link to another of the major themes which Brian was wringing every drop out of, a phrase known as \"How Dry I Am\", because of its use under those words in an Irving Berlin song, which was a popular barbershop quartet song but is now best known as a signifier of drunkenness in Looney Tunes cartoons:\n\n[Excerpt: Daffy Duck singing \"How Dry I Am\" ]\n\nThe phrase is a common one in early twentieth century music, especially folk and country, as it's made up of notes in the pentatonic scale -- it's the fifth, first, second, and third of the scale, in that order:\n\n[demonstrates \"How Dry I Am\"]\n\nAnd so it's in the melody to \"This Land is Your Land\", for example, a song which is very much in the same spirit of progressive Americana in which Van Dyke Parks was thinking:\n\n[Excerpt: Woody Guthrie, \"This Land is Your Land\"]\n\nIt's also the start of the original melody of \"You Are My Sunshine\":\n\n[Excerpt: Jimmie Davis, \"You Are My Sunshine\" ]\n\nBrian rearranged that melody when he stuck it into a minor key, so it's no longer \"How Dry I Am\" in the Beach Boys version, but if you play the \"How Dry I Am\" notes in a different rhythm, you get this:\n\n[Plays \"He Gives Speeches\" melody]\n\nWhich is the start of the melody to \"He Gives Speeches\":\n\n[Excerpt: The Beach Boys, \"He Gives Speeches\"]\n\nPlay those notes backwards, you get:\n\n[Plays \"He Gives Speeches\" melody backwards]\n\nDo that and add onto the end a passing sixth and then the tonic, and then you get:\n\n[Plays that]\n\nWhich is the vocal *countermelody* in \"He Gives Speeches\":\n\n[Excerpt: The Beach Boys, \"He Gives Speeches\"]\n\nAnd also turns up in some versions of \"Heroes and Villains\":\n\n[Excerpt: The Beach Boys, \"Heroes and Villains (alternate version)\"]\n\nAnd so on. Smile was an intricate web of themes and variations, and it incorporated motifs from many sources, both the great American songbook and the R&B of Brian's youth spent listening to Johnny Otis' radio show. There were bits of \"Gee\" by the Crows, of \"Twelfth Street Rag\", and of course, given that this was Brian Wilson, bits of Phil Spector. The backing track to the verse of \"Heroes and Villains\":\n\n[Excerpt: The Beach Boys, \"Heroes and Villains\"]\n\nOwed more than a little to a version of \"Save the Last Dance For Me\" that Spector had produced for Ike and Tina Turner:\n\n[Excerpt: Ike and Tina Turner, \"Save the Last Dance For Me\"]\n\nWhile one version of the song “Wonderful” contained a rather out-of-place homage to Etta James and “The Wallflower”:\n\n[Excerpt: “Wonderful (Rock With Me Henry)”]\n\nAs the recording continued, it became more and more obvious that the combination of these themes and variations was becoming a little too much for Brian.  Many of the songs he was working on were made up of individual modules that he was planning to splice together the way he had with \"Good Vibrations\", and some modules were getting moved between tracks, as he tried to structure the songs in the edit. He'd managed it with \"Good Vibrations\", but this was an entire album, not just a single, and it was becoming more and more difficult.\n\nDavid Anderle, who was heading up the record label the group were looking at starting, would talk about Brian playing him acetates with sections edited together one way, and thinking it was perfect, and obviously the correct way to put them together, the only possible way, and then hearing the same sections edited together in a different way, and thinking *that* was perfect, and obviously the correct way to put them together.\n\nBut while a lot of the album was modular, there were also several complete songs with beginnings, middles, ends, and structures, even if they were in several movements. And those songs showed that if Brian could just get the other stuff right, the album could be very, very, special. There was \"Heroes and Villains\" itself, of course, which kept changing its structure but was still based around the same basic melody and story that Brian and Van Dyke had come up with on their first day working together. There was also \"Wonderful\", a beautiful, allusive, song about innocence lost and regained:\n\n[Excerpt: The Beach Boys, \"Wonderful\"]\n\nAnd there was CabinEssence, a song which referenced yet another classic song, this time \"Home on the Range\", to tell a story of idyllic rural life and of the industrialisation which came with westward expansion:\n\n[Excerpt: The Beach Boys, \"CabinEssence\"]\n\nThe arrangement for that song inspired Van Dyke Parks to make a very astute assessment of Brian Wilson. He said later \"He knew that he had to adhere to the counter-culture, and I knew that I had to. I think that he was about as estranged from it as I was.... At the same time, he didn't want to lose that kind of gauche sensibility that he had. He was doing stuff that nobody would dream of doing. You would never, for example, use one string on a banjo when you had five; it just wasn't done. But when I asked him to bring a banjo in, that's what he did. This old-style plectrum thing. One string. That's gauche.\"\n\nBoth Parks and Wilson were both drawn to and alienated from the counterculture, but in very different ways, and their different ways of relating to the counterculture created the creative tension that makes the Smile project so interesting. Parks is fundamentally a New Deal Liberal, and was excited by the progresssive nature of the counterculture, but also rather worried about its tendency to throw the baby out with the bathwater, and to ignore the old in pursuit of the new. He was an erudite, cultured, sophisticated man who thought that there was value to be found in the works and attitudes of the past, even as one must look to the future.\n\nHe was influenced by the beat poets and the avant garde art of the time, but also said of his folk music period \"A harpist would bring his harp with him and he would play and recite a story which had been passed down the generations. This particular legacy continued through Arthurian legend, and then through the Middle Ages, and even into the nineteenth century. With all these songs, half of the story was the lyrics, and the folk songs were very interesting. They were tremendously thought-driven songs; there was nothing confusing about that. Even when the Kingston Trio came out -- and Brian has already admitted his debt to the Kingston Trio -- 'Tom Dooley', the story of a murder most foul 'MTA' an urban nightmare -- all of this thought-driven music was perfectly acceptable.  It was more than a teenage romantic crisis.\"\n\nBrian Wilson, on the other hand, was anything *but* sophisticated. He is a simple man in the best sense of the term -- he likes what he likes, doesn't like what he doesn't like, and has no pretensions whatsoever about it. He is, at heart, a middle-class middle-American brought up in suburbia, with a taste for steaks and hamburgers, broad physical comedy, baseball, and easy listening music.\n\nWhere Van Dyke Parks was talking about \"thought-driven music\", Wilson's music, while thoughtful, has always been driven by feelings first and foremost. Where Parks is influenced by Romantic composers like Gottschalk but is fundamentally a craftsman, a traditionalist, a mason adding his work to a cathedral whose construction started before his birth and will continue after his death, Wilson's music has none of the stylistic hallmarks of Romantic music, but in its inspiration it is absolutely Romantic -- it is the immediate emotional expression of the individual, completely unfiltered. When writing his own lyrics in later years Wilson would come up with everything from almost haiku-like lyrics like \"I'm a leaf on a windy day/pretty soon I'll be blown away/How long with the wind blow?/Until I die\" to \"He sits behind his microphone/Johnny Carson/He speaks in such a manly tone/Johnny Carson\", depending on whether at the time his prime concern was existential meaninglessness or what was on the TV.\n\nWilson found the new counterculture exciting, but was also very aware he didn't fit in. He was developing a new group of friends, the hippest of the hip in LA counterculture circles -- the singer Danny Hutton, Mark Volman of the Turtles, the writers Michael Vosse and Jules Siegel, scenester and record executive David Anderle -- but there was always the underlying implication that at least some of these people regarded him as, to use an ableist term but one which they would probably have used, an idiot savant. That they thought of him, as his former collaborator Tony Asher would later uncharitably put it, as \"a genius musician but an amateur human being\".\n\nSo for example when Siegel brought the great postmodern novelist Thomas Pynchon to visit Brian, both men largely sat in silence, unable to speak to each other; Pynchon because he tended to be a reactive person in conversation and would wait for the other person to initiate topics of discussion, Brian because he was so intimidated by Pynchon's reputation as a great East Coast intellectual that he was largely silent for fear of making a fool of himself.\n\nIt was this gaucheness, as Parks eventually put it, and Parks' understanding that this was actually a quality to be cherished and the key to Wilson's art, that eventually gave the title to the most ambitious of the complete songs the duo were working on. They had most of the song -- a song about the power of music, the concept of enlightenment, and the rise and fall of civilisations:\n\n[Excerpt: The Beach Boys, \"Surf's Up\"]\n\nBut Parks hadn't yet quite finished the lyric. The Beach Boys had been off on tour for much of Brian and Van Dyke's collaboration, and had just got back from their first real tour of the UK, where Pet Sounds had been a smash hit, rather than the middling success it had been in the US, and \"Good Vibrations\" had just become their first number one single. Brian and Van Dyke played the song for Brian's brother Dennis, the Beach Boys' drummer, and the band member most in tune with Brian's musical ambitions at this time.\n\nDennis started crying, and started talking about how the British audiences had loved their music, but had laughed at their on-stage striped-shirt uniforms. Parks couldn't tell if he was crying because of the beauty of the unfinished song, the humiliation he had suffered in Britain, or both. Dennis then asked what the name of the song was, and as Parks later put it \"Although it was the most gauche factor, and although maybe Brian thought it was the most dispensable thing, I thought it was very important to continue to use the name and keep the elephant in the room -- to keep the surfing image but to sensitise it to new opportunities. One of these would be an eco-consciousness; it would be speaking about the greening of the Earth, aboriginal people, how we had treated the Indians, taking on those things and putting them into the thoughts that come with the music. That was a solution to the relevance of the group, and I wanted the group to be relevant.\"\n\nVan Dyke had decided on a title: \"Surf's Up\":\n\n[Excerpt: The Beach Boys, \"Surf's Up\"]\n\nAs the group were now back from their tour, the focus for recording shifted from the instrumental sessions to vocal ones. Parks had often attended the instrumental sessions, as he was an accomplished musician and arranger himself, and would play on the sessions, but also wanted to learn from what Brian was doing -- he's stated later that some of his use of tuned percussion in the decades since, for example, has come from watching Brian's work.\n\nBut while he was also a good singer, he was not a singer in the same style as the Beach Boys, and they certainly didn't need his presence at those sessions, so he continued to work on his lyrics, and to do his arrangement and session work for other artists, while they worked in the studio.\n\nHe was also, though, starting to distance himself from Brian for other reasons. At the start of the summer, Brian's eccentricity and whimsy had seemed harmless -- indeed, the kind of thing he was doing, such as putting his piano in a sandbox so he could feel the sand with his feet while he wrote, seems very much on a par with Maureen Cleave's descriptions of John Lennon in the same period. They were two newly-rich, easily bored, young men with low attention spans and high intelligence who could become deeply depressed when understimulated and so would get new ideas into their heads, spend money on their new fads, and then quickly discard them.\n\nBut as the summer wore on into autumn and winter, Brian's behaviour became more bizarre, and to Parks' eyes more distasteful. We now know that Brian was suffering a period of increasing mental ill-health, something that was probably not helped by the copious intake of cannabis and amphetamines he was using to spur his creativity, but at the time most people around him didn't realise this, and general knowledge of mental illness was even less than it is today. Brian was starting to do things like insist on holding business meetings in his swimming pool, partly because people wouldn't be able to spy on him, and partly because he thought people would be more honest if they were in the water.\n\nThere were also events like the recording session where Wilson paid for several session musicians, not to play their instruments, but to be recorded while they sat in a pitch-black room and played the party game Lifeboat with Jules Siegel and several of Wilson's friends, most of whom were stoned and not really understanding what they were doing, while they got angrier and more frustrated.\n\nAlan Jardine -- who unlike the Wilson brothers, and even Mike Love to an extent, never indulged in illegal drugs -- has talked about not understanding why, in some vocal sessions, Brian would make the group crawl on their hands and knees while making noises like animals:\n\n[Excerpt: The Beach Boys, \"Heroes and Villains Part 3 (Animals)\"]\n\nAs Parks delicately put it \"I sensed all that was destructive, so I withdrew from those related social encounters.\"\n\nWhat this meant though was that he was unaware that not all the Beach Boys took the same attitude of complete support for the work he and Brian had been doing that Dennis Wilson -- the only other group member he'd met at this point -- took.\n\nIn particular, Mike Love was not a fan of Parks' lyrics. As he said later \"I called it acid alliteration. The [lyrics are] far out. But do they relate like 'Surfin' USA,' like 'Fun Fun Fun,' like 'California Girls,' like 'I Get Around'? Perhaps not! So that's the distinction. See, I'm into success. These words equal successful hit records; those words don't\"\n\nNow, Love has taken a lot of heat for this over the years, and on an artistic level that's completely understandable. Parks' lyrics were, to my mind at least, the best the Beach Boys ever had -- thoughtful, intelligent, moving, at times profound, often funny, often beautiful.\n\nBut, while I profoundly disagree with Love, I have a certain amount of sympathy for his position. From Love's perspective, first and foremost, this is his source of income. He was the only one of the Beach Boys to ever have had a day job -- he'd worked at his father's sheet metal company -- and didn't particularly relish the idea of going back to manual labour if the rock star gig dried up. It wasn't that he was *opposed* to art, of course -- he'd written the lyrics to \"Good Vibrations\", possibly the most arty rock single released to that point, hadn't he? -- but that had been *commercial* art. It had sold. Was this stuff going to sell? Was he still going to be able to feed his wife and kids?\n\nAlso, up until a few months earlier he had been Brian's principal songwriting collaborator. He was *still* the most commercially successful collaborator Brian had had. From his perspective, this was a partnership, and it was being turned into a dictatorship without him having been consulted. Before, it had been \"Mike, can you write some lyrics for this song about cars?\", now it was \"Mike, you're going to sing these lyrics about a crow uncovering a cornfield\".\n\nAnd not only that, but Mike had not met Brian's new collaborator, but knew he was hanging round with Brian's new druggie friends. And Brian was behaving increasingly weirdly, which Mike put down to the influence of the drugs and these new friends.\n\nIt can't have helped that at the same time the group's publicist, Derek Taylor, was heavily pushing the line \"Brian Wilson is a genius\". This was causing Brian some distress -- he didn't think of himself as a genius, and he saw the label as a burden, something it was impossible to live up to -- but was also causing friction in the group, as it seemed that their contributions were being dismissed.\n\nAgain, I don't agree with Mike's position on any of this, but it is understandable. It's also the case that Mike Love is, by nature, a very assertive and gregarious person, while Brian Wilson, for all that he took control in the studio, is incredibly conflict-avoidant and sensitive. From what I know of the two men's personalities, and from things they've said, and from the session recordings that have leaked over the years, it seems entirely likely that Love will have seen himself as having reasonable criticisms, and putting them to Brian clearly with a bit of teasing to take the sting out of them; while Brian will have seen Love as mercilessly attacking and ridiculing the work that meant so much to him in a cruel and hurtful manner, and that neither will have understood at the time that that was how the other was seeing things.\n\nLove's criticisms intensified. Not of everything -- he's several times expressed admiration for \"Heroes and Villains\" and \"Wonderful\" -- but in general he was not a fan of Parks' lyrics. And his criticisms seemed to start to affect Brian. It's difficult to say what Brian thinks about Parks' lyrics, because he has a habit in interviews of saying what he thinks the interviewer wants to hear, and the whole subject of Smile became a touchy one for him for a long time, so in some interviews he has talked about how dazzlingly brilliant they are, while at other times he's seemed to agree with Love, saying they were \"Van Dyke Parks lyrics\", not \"Beach Boys lyrics\". He may well sincerely think both at the same time, or have thought both at different times.\n\nThis came to a head with a session for the tag of \"Cabinessence\":\n\n[Excerpt: The Beach Boys, \"Cabinessence\"]\n\nLove insisted on having the line \"over and over the crow flies uncover the cornfield\" explained to him, and Brian eventually decided to call Van Dyke Parks and have him come to the studio.\n\nUp to this point, Parks had no idea that there was anything controversial, so when Brian phoned him up and very casually said that Mike had a few questions about the lyrics, could he come down to the studio? He went without a second thought. He later said \"The only person I had had any interchange with before that was Dennis, who had responded very favorably to 'Heroes and Villains' and 'Surf's Up'. Based on that, I gathered that the work would be approved. But then, with no warning whatsoever, I got that phone call from Brian. And that's when the whole house of cards came tumbling down.\"\n\nParks got to the studio, where he was confronted by an angry Mike Love, insisting he explain the lyrics. Now, as will be, I hope, clear from everything I've said, Parks and Love are very, very, *very* different people. Having met both men -- albeit only in formal fan-meeting situations where they're presenting their public face -- I actually find both men very likeable, but in very different ways. Love is gregarious, a charmer, the kind of man who would make a good salesman and who people use terms like \"alpha male\" about. He's tall, and has a casual confidence that can easily read as arrogance, and a straightforward sense of humour that can sometimes veer into the cruel.\n\nParks, on the other hand, is small, meticulously well-mannered and well-spoken, has a high, precise, speaking voice which probably reads as effeminate to the kind of people who use terms like \"alpha male\", and the kind of devastating intelligence and Southern US attention to propriety which means that if he *wanted* to say something cruel about someone, the victim would believe themselves to have been complimented until a horrific realisation two days after the event.\n\nIn every way, from their politics to their attitudes to art versus commerce to their mannerisms to their appearance, Mike Love and Van Dyke Parks are utterly different people, and were never going to mix well. And Brian Wilson, who was supposed to be the collaborator for both of them, was not mediating between them, not even expressing an opinion -- his own mental problems had reached the stage where he simply couldn't deal with the conflict. Parks felt ambushed and hurt, Love felt angry, especially when Parks could not explain the literal meaning of his lyrics. Eventually Parks just said \"I have no excuse, sir\", and left.\n\nParks later said \"That's when I lost interest. Because basically I was taught not to be where I wasn't wanted, and I could feel I wasn't wanted. It was like I had someone else's job, which was abhorrent to me, because I don't even want my own job. It was sad, so I decided to get away quick.\"\n\nParks continued collaborating with Wilson, and continued attending instrumental sessions, but it was all wheelspinning -- no significant progress was made on any songs after that point, in early December.\nIt was becoming clear that the album wasn't going to be ready for its planned Christmas release, and it was pushed back to January, but Brian's mental health was becoming worse and worse. One example that's often cited as giving an insight into Brian's mental state at the time is his reaction to going to the cinema to see John Frankenheimer's classic science fiction horror film Seconds. Brian came in late, and the way the story is always told, when he was sat down the screen was black and a voice said from the darkness, \"Hello Mr. Wilson\".\n\nThat moment does not seem to correspond with anything in the actual film, but he probably came in around the twenty-four minute mark, where the main character walks down a corridor, filmed in a distorted, hallucinatory manner, to be greeted:\n\n[Excerpt: Seconds, 24:00]\n\nBut as Brian watched the film, primed by this, he became distressed by a number of apparent similarities to his life. The main character was going through death and rebirth, just as he felt he was. Right after the moment I just excerpted, Mr. Wilson is shown a film, and of course Brian was himself watching a film. The character goes to the beach in California, just like Brian. The character has a breakdown on a plane, just like Brian, and has to take pills to cope, and the breakdown happens right after this:\n\n[Excerpt: Seconds, from about 44:22]\n\nA studio in California? Just like where Brian spent his working days?\n\nThat kind of weird coincidence can be affecting enough in a work of art when one is relatively mentally stable, but Brian was not at all stable. By this point he was profoundly paranoid -- and he may have had good reason to be. Some of Brian's friends from this time period have insisted that Brian's semi-estranged abusive father and former manager, Murry, was having private detectives watch him and his brothers to find evidence that they were using drugs.\n\nIf you're in the early stages of a severe mental illness *and* you're self-medicating with illegal drugs, *and* people are actually spying on you, then that kind of coincidence becomes a lot more distressing. Brian became convinced that the film was the work of mind gangsters, probably in the pay of Phil Spector, who were trying to drive him mad and were using telepathy to spy on him.\n\nHe started to bar people who had until recently been his friends from coming to sessions -- he decided that Jules Siegel's girlfriend was a witch and so Siegel was no longer welcome -- and what had been a creative process in the studio degenerated into noodling and second-guessing himself. He also, with January having come and the album still not delivered, started doing side projects,  some of which, like his production of tracks for photographer Jasper Daily, seem evidence either of his bizarre sense of humour, or of his detachment from reality, or both:\n\n[Excerpt: Jasper Daily, \"Teeter Totter Love\"]\n\nAs 1967 drew on, things got worse and worse. Brian was by this point concentrating on just one or two tracks, but endlessly reworking elements of them. He became convinced that the track \"Fire\" had caused some actual fires to break out in LA, and needed to be scrapped. The January deadline came and went with no sign of the album. To add to that, the group discovered that they were owed vast amounts of unpaid royalties by Capitol records, and legal action started which meant that even were the record to be finished it might become a pawn in the legal wrangling.\n\nParks eventually became exasperated by Brian -- he said later \"I was victimised by Brian Wilson's buffoonery\" -- and he quit the project altogether in February after a row with Brian. He returned a couple of weeks later out of a sense of loyalty, but quit again in April.\n\nBy April, he'd been working enough with Lenny Waronker that Waronker offered him a contract with Warner Brothers as a solo artist -- partly because Warners wanted some insight into Brian Wilson's techniques as a hit-making producer.\n\nTo start with, Parks released a single, to dip a toe in the water, under the pseudonym \"George Washington Brown\". It was a largely-instrumental cover version of Donovan's song \"Colours\", which Parks chose because after seeing the film Don't Look Back, a documentary of Bob Dylan's 1965 British tour, he felt saddened at the way Dylan had treated Donovan:\n\n[Excerpt: George Washington Brown, \"Donovan's Colours\"]\n\nThat was not a hit, but it got enough positive coverage, including an ecstatic review from Richard Goldstein in the Village Voice, that Parks was given carte blanche to create the album he wanted to create, with one of the largest budgets of any album released to that date. The result was a masterpiece, and very similar to the vision of Smile that Parks had had -- an album of clever, thoroughly American music which had more to do with Charles Ives than the British Invasion:\n\n[Excerpt: Van Dyke Parks, \"The All Golden\"]\n\nBut Parks realised the album, titled Song Cycle, was doomed to failure when at a playback session, the head of Warner Brothers records said \"Song Cycle? So where are the songs?\"\n\nAccording to Parks, the album was only released because Jac Holzman of Elektra Records was also there, and took out his chequebook and said he'd release the album if Warners wouldn't, but it had little push, apart from some rather experimental magazine adverts which were, if anything, counterproductive.\n\nBut Waronker recognised Parks' talent, and had even written into Parks' contract that Parks would be employed as a session player at scale on every session Waronker produced -- something that didn't actually happen, because Parks didn't insist on it, but which did mean Parks had a certain amount of job security. Over the next couple of years Parks and Waronker co-produced the first albums by two of their colleagues from Waronker's brains trust, with Parks arranging -- Randy Newman:\n\n[Excerpt: Randy Newman, \"I Think It's Going to Rain Today\"]\n\nAnd Ry Cooder:\n\n[Excerpt: Ry Cooder, \"One Meat Ball\"]\n\nWaronker would refer to himself, Parks, Cooder, and Newman as \"the arts and crafts division\" of Warners, and while these initial records weren't very successful, all of them would go on to bigger things. Parks would be a pioneer of music video, heading up Warners' music video department in the early seventies, and would also have a staggeringly varied career over the years, doing everything from teaming up again with the Beach Boys to play accordion on \"Kokomo\" to doing the string arrangements on Joanna Newsom's album Ys, collaborating with everyone from U2 to Skrillex,  discovering Rufus Wainwright, and even acting again, appearing in Twin Peaks. He also continued to make massively inventive solo albums, releasing roughly one every decade, each unique and yet all bearing the hallmarks of his idiosyncratic style.\n\nAs you can imagine, he is very likely to come up again in future episodes, though we're leaving him for now.\n\nMeanwhile, the Beach Boys were floundering, and still had no album -- and now Parks was no longer working with Brian, the whole idea of Smile was scrapped. The priority was now to get a single done, and so work started on a new, finished, version of \"Heroes and Villains\", structured in a fairly conventional manner using elements of the Smile recordings.\n\nThe group were suffering from numerous interlocking problems at this point, and everyone was stressed -- they were suing their record label, Dennis' wife had filed for divorce, Brian was having mental health problems, and Carl had been arrested for draft dodging -- though he was later able to mount a successful defence that he was a conscientious objector. Also, at some point around this time, Bruce Johnston seems to have temporarily quit the group, though this was never announced -- he doesn't seem to have been at any sessions from late May or early June through mid-September, and didn't attend the two shows they performed in that time.\n\nThey were meant to have performed three shows, but even though Brian was on the board of the Monterey Pop Festival, they pulled out at the last minute, saying that they needed to deal with getting the new single finished and with Carl's draft problems. Some or all of these other issues almost certainly fed into that, but the end result was that the Beach Boys were seen to have admitted defeat, to have handed the crown of relevance off to the San Francisco groups.\n\nAnd even if Smile had been released, there were other releases stealing its thunder. If it had come out in December it would have been massively ahead of its time, but after the Beatles released Sgt Pepper it would have seemed like it was a cheap copy -- though Parks has always said he believes the Beatles heard some of the Smile tapes and copied elements of the recordings, though I don't hear much similarity myself.\n\nBut I do hear a strong similarity in \"My World Fell Down\" by Sagittarius, which came out in June, and which was largely made by erstwhile collaborators of Brian -- Gary Usher produced, Glen Campbell sang lead, and Bruce Johnston sang backing vocals:\n\n[Excerpt: Sagittarius, \"My World Fell Down\"]\n\nBrian was very concerned after hearing that that someone *had* heard the Smile tapes, and one can understand why.\n\nWhen \"Heroes and Villains\" finally came out, it was a great single, but only made number twelve in the charts. It was fantastic, but out of step with the times, and nothing could have lived up to the hype that had built up around it:\n\n[Excerpt: The Beach Boys, \"Heroes and Villains\"]\n\nInstead of Smile, the group released an album called Smiley Smile, recorded in a couple of months in Brian's home studio, with no studio musicians and no involvement from Bruce, other than the previously released singles, and with the production credited to \"the Beach Boys\" rather than Brian.\n\nSmiley Smile has been unfairly dismissed over the years, but it's actually an album that was ahead of its time. It's a collection of stripped down versions of Smile songs and new fragments using some of the same motifs, recorded with minimal instrumentation. Some of it is on a par with the Smile material it's based on:\n\n[Excerpt: The Beach Boys, \"Wonderful\"]\n\nSome is, to my ears, far more beautiful than the Smile versions:\n\n[Excerpt: The Beach Boys, \"Wind Chimes\"]\n\nAnd some has a fun goofiness which relates back to one of Brian's discarded ideas for Smile, that it be a humour album:\n\n[Excerpt: The Beach Boys, \"She's Going Bald\"]\n\nThe album was a commercial flop, by far the least successful thing the group had released to that point in the US, not even making the top forty when it came out in September, though it made the top ten in the UK, but interestingly it *wasn't* a critical flop, at least at first.\n\nWhile the scrapping of Smile had been mentioned, it still wasn't widely known, and so for example Richard Goldstein, the journalist whose glowing review of \"Donovan's Colours\" in the Village Voice had secured Van Dyke Parks the opportunity to make Song Cycle, gave it a review in the New York Times which is written as if Goldstein at least believes it *is* the album that had been promised all along, and he speaks of it very perceptively -- and here I'm going to quote quite extensively, because the narrative about this album has always been that it was panned from the start and made the group a laughing stock:\n\n\"Smiley Smile hardly reads like a rock cantata. But there are moments in songs such as 'With Me Tonight' and 'Wonderful' that soar like sacred music. Even the songs that seem irrelevant to a rock-hymn are infused with stained-glass melodies. Wilson is a sound sculptor and his songs are all harmonious litanies to the gentle holiness of love — post-Christian, perhaps but still believing.\n'Wind Chimes', the most important piece on the album, is a fine example of Brian Wilson's organic pop structure. It contains three movements. First, Wilson sets a lyric and melodic mood (\"In the late afternoon, you're hung up on wind chimes\"). Then he introduces a totally different scene, utilizing passages of pure, wordless harmony. His two-and-a-half minute hymn ends with a third movement in which the voices join together in an exquisite round, singing the words, \"Whisperin' winds set my wind chimes a-tinklin'.\" The voices fade out slowly, like the bittersweet afternoon in question.\n\nThe technique of montage is an important aspect of Wilson's rock cantata, since the entire album tends to flow as a single composition. Songs like 'Heroes and Villains', are fragmented by speeding up or slowing down their verses and refrains. The effect is like viewing the song through a spinning prism. Sometimes, as in 'Fall Breaks and Back to Winter' (subtitled \"W. Woodpecker Symphony\"), the music is tiered into contrapuntal variations on a sliver of melody. The listener is thrown into a vast musical machine of countless working gears, each spinning in its own orbit.\"\n\nThat's a discussion of the album that I hear when I listen to Smiley Smile, and the group seem to have been artistically happy with it, at least at first. They travelled to Hawaii to record a live album (with Brian, as Bruce was still out of the picture), taking the Baldwin organ that Brian used all over Smiley Smile with them, and performed rearranged versions of their old hits in the Smiley Smile style. When the recordings proved unusable, they recreated them in the studio, with Bruce returning to the group, where he would remain, with the intention of overdubbing audience noise and releasing a faked live album:\n\n[Excerpt: The Beach Boys, \"California Girls [Lei'd studio version]\"]\n\nThe idea of the live album, to be called Lei'd in Hawaii, was scrapped, but that's not the kind of radical reimagining of your sound that you do if you think you've made an artistic failure. Indeed, the group's next album, Wild Honey, which came out in late 1967, is very much a successor to Smiley Smile in its stripped-down sound, but with a set of songs that have a certain amount of influence from the soul music that Carl and Mike were now listening to.\n\n[Excerpt: The Beach Boys, \"Wild Honey\"]\n\nThe singles from \"Wild Honey\" were moderately successful, and it looked like the group were going to reinvent themselves, but then the critical consensus changed. First there was Jules Siegel's article on Smile, titled \"Goodbye Surfing, Hello God\", which had been intended for the Saturday Evening Post but had itself gone through endless delays, and which eventually came out in Cheetah magazine roughly a month after Smiley Smile came out, and which became the first draft of history as far as Smile was concerned -- telling the story not of an album scrapped and reworked, but of Icarus soaring too close to the sun, while his bandmates pulled the feathers off. It reinforced all the \"genius\" stories that Wilson had found so upsetting, while implicitly making any new music that actually got released pale in comparison to a mythical album that had never been finished and which could take on any shape the listener imagined.\n\nMeanwhile, Jann Wenner wrote an article in his new magazine Rolling Stone -- a magazine which explicitly sided with San Francisco in the war between Frisco and LA, and which over the years would contribute to almost all the LA bands being critically sidelined or forgotten in the US, no matter how good they'd been -- dismissing all the hype about the group and about Brian's genius, and arguing that they were only a moderately good pop band, and not even that good live, and should stick to the fun stuff they knew and not try to play with the big boys.\n\nAnd more or less overnight these two views became the sum total of American critical opinion of the Beach Boys -- a mainstream opinion that dismissed them as frothy lightweight has-beens who'd made a few good singles but had been overtaken, and a more hipsterish, underground, version that said that Brian Wilson was a genius but he had been sabotaged by his bandmates and the proof of that genius had never been released, so you'd best just take it on trust.\n\nNeither required any acknowledgement of any work the group might do in the future, any capacity of progress or relevance for them, or any reason to engage critically with any new work they did. Brian Wilson was permanently cast as either an overrated dilettante who believed his own press or a tragic victim sabotaged by his family; his bandmates, either way, as talentless hacks. And as anyone who has tried to talk about the Beach Boys online knows, that dual consensus remains largely in place today, irrespective of any actual qualities of the music.\n\nAt least for the moment, though, the group were still on a commercial and critical upswing in the UK, at a time when critical reputations were much less coupled than they are now, and when Mike and Bruce decided to drop in at the Beatles' Christmas launch party for their new film, Magical Mystery Tour, they were treated as honoured guests, and invited to jam on stage with, depending on which version of events you believe, either John, Paul, and Ringo, the Bonzo Dog Doo-Dah Band, or some combination of all of the above.\n\nAnd they had a new mutual acquaintance. A few days before, at the instigation of Dennis Wilson, the Beach Boys had met up with the Maharishi, who the Beatles had started seeing a couple of months earlier. Dennis himself didn't remain impressed with the Maharishi for long, and went off looking for another guru to follow, but Mike Love became a devoted follower, as he is to this day, and two months later Mike Love would join the Beatles and Donovan on a retreat with the Maharishi in Rishikesh, in India.\n\nWhat nobody could know at the time was that the songs the Beatles would write on that retreat would intersect horribly, in unpredictable ways, with Dennis Wilson's search for a guru. Ways which would ultimately lead back to the house on Cielo Drive where Brian and Van Dyke first agreed to collaborate.\nBut that, I am glad to say, is a much darker story for another time.",
  "itunes:subtitle": "Episode one hundred and fifty-three of A History of Rock Music in Five Hundred Songs looks at “Heroes and Villains” by the Beach Boys, and the collapse of the Smile album. Click the full post to read liner notes, links to more information, and a transcri",
  "itunes:keywords": "Brian Wilson,Bruce Botnick,Bruce Johnston,Danny Hutton,Dennis Wilson,Derek Taylor,Donovan,Four Mills Brothers,Frank Zappa,Graham Nash,Jann Wenner,Lenny Waronker,Leon Russell,Leonard Bernstein,Mark Volman,Mike Love,Murry Wilson,Paul Revere and the Raiders,Peter Noone,Phil Spector,Randy Newman,Sly Stone,Steve Stills,Tandyn Almer,Terry Melcher,The Beach Boys,The Beatles,The Beau Brummels,The Byrds,Tim Buckley,Tom Wilson,Van Dyke Parks",
  "itunes:episode": 153,
  "content:encoded": "Episode one hundred and fifty-three of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Heroes and Villains” by the Beach Boys, and the collapse of the <em>Smile</em> album. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a sixteen-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/71907204\">\"I Had Too Much to Dream Last Night\" by the Electric Prunes.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nThere is no Mixcloud this week, because there were too many Beach Boys songs in the episode.\n\nI used many resources for this episode. As well as the books I referred to in all the Beach Boys episodes, listed below, I used Domenic Priore's book <a href=\"https://amzn.to/3U32SfQ\"><em>Smile: The Story of Brian Wilson's Lost Masterpiece</em></a> and <a href=\"https://amzn.to/3LalmH1\">Richard Henderson's 33 1/3 book on Van Dyke Parks' Song Cycle</a>.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes, including several on both the Beach Boys and Gary Usher.  His books can be found at <a href=\"https://payhip.com/CMusicBooks\">https://payhip.com/CMusicBooks</a>\n\nAndrew Doe’s <a href=\"http://www.bellagio10452.com/\">Bellagio 10452 </a>site is an invaluable resource.\n\nJon Stebbins’ <a href=\"https://amzn.to/2S0eQIs\">The Beach Boys FAQ </a>is a good balance between accuracy and readability.\n\nAnd <a href=\"https://amzn.to/3i22CcH\">Philip Lambert’s <em>Inside the Music of Brian Wilson</em></a> is an excellent, though sadly out of print, musicological analysis of Wilson’s music from 1962 through 67.\n\n<a href=\"https://amzn.to/3RXpjRD\"><em>Catch a Wave: The Rise, Fall, and Redemption of the Beach Boys' Brian Wilson</em></a> by Peter Ames Carlin is the best biography of Wilson.\n\nI have also referred to Brian Wilson’s autobiography, <em><a href=\"https://amzn.to/3AMbmys\">I Am Brian Wilson</a></em>, and to Mike Love’s, <em><a href=\"https://amzn.to/3AMbmys\">Good Vibrations: My Life as a Beach Boy</a>.</em>\n\nAs a good starting point for the Beach Boys’ music in general, I would recommend <a href=\"https://amzn.to/3i0tsC9\">this budget-priced three-CD set</a>, which has a surprisingly good selection of their material on it, including the single version of “Heroes and Villains”.\n\nThe box set <a href=\"https://amzn.to/3wC2Ylh\"><em>The Smile Sessions </em></a> contains an attempt to create a finished album from the unfinished sessions, plus several CDs of outtakes and session material.\n\n<strong>Transcript</strong>\n[Opening -- \"intro to the album\" studio chatter into \"Our Prayer\"]\nBefore I start, I'd just like to note that this episode contains some discussion of mental illness, including historical negative attitudes towards it, so you may want to check the transcript or skip this one if that might be upsetting.\n\nIn November and December 1966, the filmmaker David Oppenheim and the conductor and composer Leonard Bernstein collaborated on a TV film called \"Inside Pop: The Rock Revolution\".  The film was an early attempt at some of the kinds of things this podcast is doing, looking at how music and social events interact and evolve, though it was dealing with its present rather than the past.\nThe film tried to cast as wide a net as possible in its fifty-one minutes. It looked at two bands from Manchester -- the Hollies and Herman's Hermits -- and how the people identified as their leaders, \"Herman\" (or Peter Noone) and Graham Nash, differed on the issue of preventing war:\n[Excerpt: Inside Pop, the Rock Revolution]\n\nAnd it made a star of East Coast teenage singer-songwriter Janis Ian with her song about interracial relationships, \"Society's Child\":\n\n[Excerpt: Janis Ian, \"Society's Child\"]\n\nAnd Bernstein spends a significant time, as one would expect, analysing the music of the Beatles and to a lesser extent the Stones, though they don't appear in the show. Bernstein does a lot to legitimise the music just by taking it seriously as a subject for analysis, at a time when most wouldn't:\n\n[Excerpt: Leonard Bernstein talking about \"She Said She Said\"]\n\nYou can't see it, obviously, but in the clip that's from, as the Beatles recording is playing, Bernstein is conducting along with the music, as he would a symphony orchestra, showing where the beats are falling.\n\nBut of course, given that this was filmed in the last two months of 1966, the vast majority of the episode is taken up with musicians from the centre of the music world at that time, LA.\n\nThe film starts with Bernstein interviewing Tandyn Almer,  a jazz-influenced songwriter who had recently written the big hit \"Along Comes Mary\" for The Association:\n[Excerpt: Inside Pop: The Rock Revolution]\n\nIt featured interviews with Roger McGuinn, and with the protestors at the Sunset Strip riots which were happening contemporaneously with the filming:\n\n[Excerpt: Inside Pop: The Rock Revolution]\n\nAlong with Frank Zappa's rather acerbic assessment of the potential of the youth revolutionaries:\n\n[Excerpt: Inside Pop: The Rock Revolution]\n\nAnd ended (other than a brief post-commercial performance over the credits by the Hollies) with a performance by Tim Buckley, whose debut album, as we heard in the last episode, had featured Van Dyke Parks and future members of the Mothers of Invention and Buffalo Springfield:\n\n[Excerpt: Inside Pop: The Rock Revolution]\n\nBut for many people the highlight of the film was the performance that came right before Buckley's, film of Brian Wilson playing a new song from the album he was working on. One thing I should note -- many sources say that the voiceover here is Bernstein. My understanding is that Bernstein wrote and narrated the parts of the film he was himself in, and Oppenheim did all the other voiceover writing and narration, but that Oppenheim's voice is similar enough to Bernstein's that people got confused about this:\n\n[Excerpt: Inside Pop: The Rock Revolution]\n\nThat particular piece of footage was filmed in December 1966, but it wasn't broadcast until April the twenty-fifth, 1967, an eternity in mid-sixties popular music. When it was broadcast, that album still hadn't come out.\n\nPrecisely one week later, the Beach Boys' publicist Derek Taylor announced that it never would:\n\n[Excerpt: Brian Wilson, \"Surf's Up\"]\n\nOne name who has showed up in a handful of episodes recently, but who we've not talked that much about, is Van Dyke Parks. And in a story with many, many, remarkable figures, Van Dyke Parks may be one of the most remarkable of all. Long before he did anything that impinges on the story of rock music, Parks had lived the kind of life that would be considered unbelievable were it to be told as fiction.\n\nParks came from a family that mixed musical skill, political progressiveness, and achievement. His mother was a scholar of Hebrew, while his father was a neurologist, the first doctor to admit Black patients to a white Southern hospital, and had paid his way through college leading a dance band.\nParks' father was also, according to the 33 1/3 book on Song Cycle, a member of \"John Philip Sousa's Sixty Silver Trumpets\", but literally every reference I can find to Sousa leading a band of that name goes back to that book, so I've no idea what he was actually a member of, but we can presume he was a reasonable musician.\n\nYoung Van Dyke started playing the clarinet at four, and was also a singer from a very early age, as well as playing several other instruments. He went to the American Boychoir School in Princeton, to study singing, and while there he sang with Toscaninni, Thomas Beecham, and other immensely important conductors of the era.\n\nHe also had a very special accompanist for one Christmas carolling session. The choir school was based in Princeton, and one of the doors he knocked on while carolling was that of Princeton's most famous resident, Albert Einstein, who heard the young boy singing \"Silent Night\", and came out with his violin and played along.\n\nYoung Van Dyke was only interested in music, but he was also paying the bills for his music tuition himself -- he had a job. He was a TV star. From the age of ten, he started getting roles in TV shows -- he played the youngest son in the 1953 sitcom Bonino, about an opera singer, which flopped because it aired opposite the extremely popular Jackie Gleason Show. He would later also appear in that show, as one of several child actors who played the character of Little Tommy Manicotti, and he made a number of other TV appearances, as well as having a small role in Grace Kelly's last film, The Swan, with Alec Guinness and Louis Jourdain.\n\nBut he never liked acting, and just did it to pay for his education. He gave it up when he moved on to the Carnegie Institute, where he majored in composition and performance. But then in his second year, his big brother Carson asked him to drop out and move to California.\n\nCarson Parks had been part of the folk scene in California for a few years at this point. He and a friend had formed a duo called the Steeltown Two, but then both of them had joined the folk group the Easy Riders, a group led by Terry Gilkyson.\n\nBefore Carson Parks joined, the Easy Riders had had a big hit with their version of \"Marianne\", a calypso originally by the great calypsonian Roaring Lion:\n\n[Excerpt: The Easy Riders, \"Marianne\"]\n\nThey hadn't had many other hits, but their songs became hits for other people -- Gilkyson wrote several big hits for Frankie Laine, and the Easy Riders were the backing vocalists on Dean Martin's recording of a song they wrote, \"Memories are Made of This\":\n\n[Excerpt: Dean Martin and the Easy Riders, \"Memories are Made of This\"]\n\nCarson Parks hadn't been in the group at that point -- he only joined after they'd stopped having success -- and eventually the group had split up. He wanted to revive his old duo, the Steeltown Two, and persuaded his family to let his little brother Van Dyke drop out of university and move to California to be the other half of the duo. He wanted Van Dyke to play guitar, while he played banjo. Van Dyke had never actually played guitar before, but as Carson Parks later said \"in 90 days, he knew more than most folks know after many years!\"\n\nVan Dyke moved into an apartment adjoining his brother's, owned by Norm Botnick, who had until recently been the principal viola player in a film studio orchestra, before the film studios all simultaneously dumped their in-house orchestras in the late fifties, so was a more understanding landlord than most when it came to the lifestyles of musicians. Botnick's sons, Doug and Bruce, later went into sound engineering -- we've already encountered Bruce Botnick in the episode on the Doors, and he will be coming up again in the future.\n\nThe new Steeltown Two didn't make any records, but they developed a bit of a following in the coffeehouses, and they also got a fair bit of session work, mostly through Terry Gilkyson, who was by that point writing songs for Disney and would hire them to play on sessions for his songs. And it was Gilkyson who both brought Van Dyke Parks the worst news of his life to that point, and in doing so also had him make his first major mark on music.\n\nGilkyson was the one who informed Van Dyke that another of his brothers, Benjamin Riley Parks, had died in what was apparently a car accident. I say it was apparently an accident because Benjamin Riley Parks was at the time working for the US State Department, and there is apparently also some evidence that he was assassinated in a Cold War plot.\n\nGilkyson also knew that neither Van Dyke nor Carson Parks had much money, so in order to help them afford black suits and plane tickets to and from the funeral, Gilkyson hired Van Dyke to write the arrangement for a song he had written for an upcoming Disney film:\n\n[Excerpt: Jungle Book soundtrack, \"The Bare Necessities\"]\n\nThe Steeltown Two continued performing, and soon became known as the Steeltown Three, with the addition of a singer named Pat Peyton. The Steeltown Three recorded two singles, \"Rock Mountain\", under that group name:\n\n[Excerpt: The Steeltown Three, \"Rock Mountain\"]\n\nAnd a version of \"San Francisco Bay\" under the name The South Coasters, which I've been unable to track down. Then the three of them, with the help of Terry Gilkyson, formed a larger group in the style of the New Christy Minstrels -- the Greenwood County Singers. Indeed, Carson Parks would later claim that  Gilkyson had had the idea first -- that he'd mentioned that he'd wanted to put together a group like that to Randy Sparks, and Sparks had taken the idea and done it first.\n\nThe Greenwood County Singers had two minor hot one hundred hits, only one of them while Van Dyke was in the band -- \"The New 'Frankie and Johnny' Song\", a rewrite by Bob Gibson and Shel Silverstein of the old traditional song \"Frankie and Johnny\":\n\n[Excerpt: The Greenwood County Singers, \"The New Frankie and Johnny Song\"]\n\nThey also recorded several albums together, which gave Van Dyke the opportunity to practice his arrangement skills, as on this version of  \"Vera Cruz\" which he arranged:\n[Excerpt: The Greenwood County Singers, \"Vera Cruz\"]\n\nSome time before their last album, in 1965, Van Dyke left the Greenwood County Singers, and was replaced by Rick Jarrard, who we'll also be hearing more about in future episodes. After that album, the group split up, but Carson Parks would go on to write two big hits in the next few years. The first and biggest was a song he originally wrote for a side project. His future wife Gaile Foote was also a Greenwood County Singer, and the two of them thought they might become folk's answer to Sonny and Cher or Nino Tempo and April Stevens:\n\n[Excerpt: Carson and Gaile, \"Somethin' Stupid\"]\n\nThat obviously became a standard after it was covered by Frank and Nancy Sinatra. Carson Parks also wrote \"Cab Driver\", which in 1968 became the last top thirty hit for the Mills Brothers, the 1930s vocal group we talked about way way back in episode six:\n\n[Excerpt: The Mills Brothers, \"Cab Driver\"]\n\nMeanwhile Van Dyke Parks was becoming part of the Sunset Strip rock and roll world. Now, until we get to 1967, Parks has something of a tangled timeline. He worked with almost every band around LA in a short period, often working with multiple people simultaneously, and nobody was very interested in keeping detailed notes. So I'm going to tell this as a linear story, but be aware it's very much not -- things I say in five minutes might happen after, or in the same week as, things I say in half an hour.\n\nAt some point in either 1965 or 1966 he joined the Mothers of Invention for a brief while. Nobody is entirely sure when this was, and whether it was before or after their first album. Some say it was in late 1965, others in August 1966, and even the kind of fans who put together detailed timelines are none the wiser, because no recordings have so far surfaced of Parks with the band. Either is plausible, and the Mothers went through a variety of keyboard players at this time -- Zappa had turned to his jazz friend Don Preston, but found Preston was too much of a jazzer and told him to come back when he could play \"Louie Louie\" convincingly, asked Mac Rebennack to be in the band but sacked him pretty much straight away for drug use, and eventually turned to Preston again once Preston had learned to rock and roll. Some time in that period, Van Dyke Parks was a Mother, playing electric harpsichord. He may even have had more than one stint in the group -- Zappa said \"Van Dyke Parks played electric harpsichord in and out.\"\n\nIt seems likely, though, that it was in summer of 1966, because in an interview published in Teen Beat Magazine in December 66, but presumably conducted a few months prior, Zappa was asked to describe the band members in one word each and replied:\n\"Ray—Mahogany\nRoy—Asbestos\nJim—Mucilage\nDel—Acetate\nVan Dyke—Pinocchio\nBilly—Boom\nI don't know about the rest of the group—I don't even know about these guys.\"\n\nSources differ as to why Parks didn't remain in the band -- Parks has said that he quit after a short time because he didn't like being shouted at, while Zappa said \"Van Dyke was not a reliable player. He didn't make it to rehearsal on time and things like that.\"\n\nBoth may be true of course, though I've not heard anyone else ever criticise Parks for his reliability. But then also Zappa had much more disciplinarian standards than most rock band leaders.\n\nIt's possibly either through Zappa that he met Tom Wilson, or through Tom Wilson that he met Frank Zappa, but either way Parks, like the Mothers of Invention, was signed to MGM records in 1966, where he released two solo singles co-produced by Wilson and an otherwise obscure figure named Tim Alvorado. The first was \"Number Nine\", which we heard last week, backed with \"Do What You Wanta\":\n[Excerpt: Van Dyke Parks, \"Do What You Wanta\"]\n\nAt least one source I've read says that the lyrics to \"Do What You Wanta\" were written not by Parks but by his friend Danny Hutton, but it's credited as a Parks solo composition on the label.\n\nIt was after that that the Van Dyke Parks band -- or as they were sometimes billed, just The Van Dyke Parks formed, as we discussed last episode, based around Parks, Steve Stills, and Steve Young, and they performed a handful of shows with bass player Bobby Rae and drummer Walt Sparman, playing a mix of original material, primarily Parks' songs, and covers of things like \"Dancing in the Street\". The one contemporaneous review of a live show I've seen talks about  the girls in the audience screaming and how \"When rhythm guitarist Steve Stillman imitated the Barry McGuire emotional scene, they almost went wiggy\".\n\nBut The Van Dyke Parks soon split up, and Parks the individual recorded his second single, \"Come to the Sunshine\":\n\n[Excerpt: Van Dyke Parks, \"Come to the Sunshine\"]\n\nAround the time he left the Greenwood County Singers, Van Dyke Parks also met Brian Wilson for the first time, when David Crosby took him up to Wilson's house to hear an acetate of the as-yet-unreleased track \"Sloop John B\". Parks was impressed by Wilson's arrangement techniques, and in particular the way he was orchestrating instrumental combinations that you couldn't do with a standard live room setup, that required overdubbing and close-micing. He said later \"The first stuff I heard indicated this kind of curiosity for the recording experience, and when I went up to see him in '65 I don't even think he had the voices on yet, but I heard that long rotational breathing, that long flute ostinato at the beginning... I knew this man was a great musician.\"\n[Excerpt: The Beach Boys, \"Sloop John B (instrumental)\"]\n\nIn most of 1966, though, Parks was making his living as a session keyboard player and arranger, and much of the work he was getting was through Lenny Waronker.\n\nWaronker was a second-generation music industry professional. His father, Si Waronker, had been a violinist in the Twentieth Century Fox studio orchestra before founding Liberty Records (the label which indirectly led to him becoming immortalised in children's entertainment, when Liberty Records star David Seville named his Chipmunk characters after three Liberty executives, with Simon being Si Waronker's full forename). The first release on Liberty Records had been a version of \"The Girl Upstairs\", an instrumental piece from the Fox film The Seven-Year Itch. The original recording of that track, for the film, had been done by the Twentieth Century Fox Orchestra, written and conducted by Alfred Newman, the musical director for Fox:\n\n[Excerpt: Alfred Newman, \"The Girl Upstairs\"]\n\nLiberty's soundalike version was conducted by Newman's brother Lionel, a pianist at the studio who later became Fox's musical director for TV, just as his brother was for film, but who also wrote many film scores himself.\n\nAnother Newman brother, Emil, was also a film composer, but the fourth brother, Irving, had gone into medicine instead. However, Irving's son Randy wanted to follow in the family business, and he and Lenny Waronker, who was similarly following his own father by working for Liberty Records' publishing subsidiary Metric Music, had been very close friends ever since High School. Waronker got Newman signed to Metric Music, where he wrote \"They Tell Me It's Summer\" for the Fleetwoods:\n\n[Excerpt: The Fleetwoods, \"They Tell Me It's Summer\"]\n\nNewman also wrote and recorded a single of his own in 1962, co-produced by Pat Boone:\n[Excerpt: Randy Newman, \"Golden Gridiron Boy\"]\n\nBefore deciding he wasn't going to make it as a singer and had better just be a professional songwriter.\nBut by 1966 Waronker had moved on from Metric to Warner Brothers, and become a junior A&R man. And he was put in charge of developing the artists that Warners had acquired when they had bought up a small label, Autumn Records. Autumn Records was a San Francisco-based label whose main producer, Sly Stone, had now moved on to other things after producing the hit record \"Laugh Laugh\" for the Beau Brummels:\n\n[Excerpt: The Beau Brummels, \"Laugh Laugh\"]\n\nThe Beau Brummels  had had another hit after that and were the main reason that Warners had bought the label, but their star was fading a little. Stone had also been mentoring several other groups, including the Tikis and the Mojo Men, who all had potential. Waronker gathered around himself a sort of brains trust of musicians who he trusted as songwriters, arrangers, and pianists -- Randy Newman, the session pianist Leon Russell, and Van Dyke Parks. Their job was to revitalise the career of the Beau Brummels, and to make both the Tikis and the Mojo Men into successes. The tactic they chose was, in Waronker's words, “Go in with a good song and weird it out.”\n\nThe first good song they tried weirding out was in late 1966, when Leon Russell came up with a clarinet-led arrangement of Paul Simon's \"59th Street Bridge Song (Feeling Groovy)\" for the Tikis, who performed it but who thought that their existing fanbase wouldn't accept something so different, so it was put out under another name, suggested by Parks, Harpers Bizarre:\n\n[Excerpt: Harpers Bizarre, \"Feeling Groovy\"]\n\nWaronker said of Parks and Newman “They weren’t old school guys. They were modern characters but they had old school values regarding certain records that needed to be made, certain artists who needed to be heard regardless. So there was still that going on. The fact that ‘Feeling Groovy’ was a number 10 hit nationwide and ‘Sit Down, I Think I Love You’  made the Top 30 on Western regional radio, that gave us credibility within the company. One hit will do wonders, two allows you to take chances.”\nWe heard \"Sit Down, I Think I Love You\" last episode -- that's the song by Parks' old friend Stephen Stills that Parks arranged for the Mojo Men:\n\n[Excerpt: The Mojo Men, \"Sit Down, I Think I Love You\"]\n\nDuring 1966 Parks also played on Tim Buckley's first album, as we also heard last episode:\n[Excerpt: Tim Buckley, \"Aren't You the Girl?\"]\n\nAnd he also bumped into Brian Wilson on occasion, as they were working a lot in the same studios and had mutual friends like Loren Daro and Danny Hutton, and he suggested the cello part on \"Good Vibrations\". Parks also played keyboards on \"5D\" by the Byrds:\n\n[Excerpt: The Byrds, \"5D (Fifth Dimension)\"]\n\nAnd on the Spirit of '67 album for Paul Revere and the Raiders, produced by the Byrds' old producer Terry Melcher. Parks played keyboards on much of the album, including the top five hit \"Good Thing\":\n[Excerpt: Paul Revere and the Raiders, \"Good Thing\"]\n\nBut while all this was going on, Parks was also working on what would become the work for which he was best known. As I've said, he'd met Brian Wilson on a few occasions, but it wasn't until summer 1966 that the two were formally introduced by Terry Melcher, who knew that Wilson needed a new songwriting collaborator, now Tony Asher's sabbatical from his advertising job was coming to an end, and that Wilson wanted someone who could do work that was a bit more abstract than the emotional material that he had been writing with Asher.\n\nMelcher invited both of them to a party at his house on Cielo Drive -- a house which would a few years later become notorious -- which was also attended by many of the young Hollywood set of the time. Nobody can remember exactly who was at the party, but Parks thinks it was people like Jack Nicholson and Peter and Jane Fonda.\n\nParks and Wilson hit it off, with Wilson saying later \"He seemed like a really articulate guy, like he could write some good lyrics\". Parks on the other hand was delighted to find that Wilson \"liked Les Paul, Spike Jones, all of these sounds that I liked, and he was doing it in a proactive way.\"\n\nBrian suggested Parks write the finished lyrics for \"Good Vibrations\", which was still being recorded at this time, and still only had Tony Asher's dummy lyrics,  but Parks was uninterested. He said that it would be best if he and Brian collaborate together on something new from scratch, and Brian agreed.\nThe first time Parks came to visit Brian at Brian's home, other than the visit accompanying Crosby the year before, he was riding a motorbike -- he couldn't afford a car -- and forgot to bring his driver's license with him. He was stopped by a police officer who thought he looked too poor to be in the area, but Parks persuaded the police officer that if he came to the door, Brian Wilson would vouch for him. Brian got Van Dyke out of any trouble because the cop's sister was a Beach Boys fan, so he autographed an album for her.\n\nBrian and Van Dyke talked for a while. Brian asked if Van Dyke needed anything to help his work go smoothly, and Van Dyke said he needed a car. Brian asked what kind. Van Dyke said that Volvos were supposed to be pretty safe. Brian asked how much they cost. Van Dyke said he thought they were about five thousand dollars. Brian called up his office and told them to get a cheque delivered to Van Dyke for five thousand dollars the next day, instantly earning Van Dyke's loyalty.\n\nAfter that, they got on with work. To start with, Brian played Van Dyke a melody he'd been working on, a melody based on a descending scale starting on the fourth:\n\n[Plays \"Heroes and Villains\" melody]\n\nParks told Wilson that the melody reminded him vaguely of Marty Robbins' country hit \"El Paso\" from 1959, a song about a gunfighter, a cantina, and a dancing woman:\n\n[Excerpt: Marty Robbins, \"El Paso\"]\n\nWilson said that he had been thinking along the same lines, a sort of old west story, and thought maybe it should be called \"Heroes and Villains\". Parks started writing, matching syllables to Wilson's pre-conceived melody -- \"I've been in this town so long that back in the city I've been taken for lost and gone and unknown for a long, long time\"\n\n[Excerpt: Brian Wilson and Van Dyke Parks, \"Heroes and Villains demo\"]\n\nAs Parks put it \"The engine had started. It was very much ad hoc. Seat of the pants. Extemporaneous values were enforced. Not too much precommitment to ideas. Or, if so, equally pursuing propinquity.\"\nSlowly, over the next several months, while the five other Beach Boys were touring, Brian and Van Dyke refined their ideas about what the album they were writing, initially called Dumb Angel but soon retitled Smile, should be.\n\nFor Van Dyke Parks it was an attempt to make music about America and American mythology. He was disgusted, as a patriot, with the Anglophilia that had swept the music industry since the arrival of the Beatles in America two and a half years earlier, particularly since that had happened so soon after the deaths both of President Kennedy and of Parks' own brother who was working for the government at the time he died.\n\nSo for him, the album was about America, about Plymouth Rock, the Old West, California, and Hawaii. It would be a generally positive version of the country's myth, though it would of course also acknowledge the bloodshed on which the country had been built:\n\n[Excerpt: The Beach Boys, \"Bicycle Rider\" section]\n\nAs he put it later \"I was dead set on centering my life on the patriotic ideal. I was a son of the American revolution, and there was blood on the tracks. Recent blood, and it was still drying. The whole record seemed like a real effort toward figuring out what Manifest Destiny was all about. We'd come as far as we could, as far as Horace Greeley told us to go. And so we looked back and tried to make sense of that great odyssey.\"\n\nBrian had some other ideas -- he had been studying the I Ching, and Subud, and he wanted to do something about the four classical elements, and something religious -- his ideas were generally rather unfocused at the time, and he had far more ideas than he knew what to usefully do with. But he was also happy with the idea of a piece about America, which fit in with his own interest in \"Rhapsody in Blue\", a piece that was about America in much the same way.\n\n\"Rhapsody in Blue\" was an inspiration for Brian primarily in how it weaved together variations on themes. And there are two themes that between them Brian was finding endless variations on. The first theme was a shuffling between two chords a fourth away from each other.\n\n[demonstrates G to C on guitar]\n\nWhere these chords are both major, that's the sequence for \"Fire\":\n\n[Excerpt: The Beach Boys, \"Mrs. O'Leary's Cow/Fire\"]\n\nFor the \"Who ran the Iron Horse?\" section of \"Cabin Essence\":\n\n[Excerpt: The Beach Boys, \"Cabinessence\"]\n\nFor \"Vegetables\":\n\n[Excerpt: The Beach Boys, \"Vegetables\"]\n\nAnd more.\nSometimes this would be the minor supertonic and dominant seventh of the key, so in C that would be Dm to G7:\n\n[Plays Dm to G7 fingerpicked]\n\nThat's the \"bicycle rider\" chorus we heard earlier, which was part of a song known as \"Roll Plymouth Rock\" or \"Do You Like Worms\":\n\n[Excerpt: The Beach Boys, \"Bicycle Rider\"]\n\nBut which later became a chorus for \"Heroes and Villains\":\n\n[Excerpt: The Beach Boys, \"Heroes and Villains\"]\n\nBut that same sequence is also the beginning of \"Wind Chimes\":\n\n[Excerpt: The Beach Boys, \"Wind Chimes\"]\n\nThe \"wahalla loo lay\" section of \"Roll Plymouth Rock\":\n\n[Excerpt: The Beach Boys, \"Roll Plymouth Rock\"]\n\nAnd others, but most interestingly, the minor-key rearrangement of \"You Are My Sunshine\" as \"You Were My Sunshine\":\n\n[Excerpt: The Beach Boys, \"You Were My Sunshine\"]\n\nI say that's most interesting, because that provides a link to another of the major themes which Brian was wringing every drop out of, a phrase known as \"How Dry I Am\", because of its use under those words in an Irving Berlin song, which was a popular barbershop quartet song but is now best known as a signifier of drunkenness in Looney Tunes cartoons:\n\n[Excerpt: Daffy Duck singing \"How Dry I Am\" ]\n\nThe phrase is a common one in early twentieth century music, especially folk and country, as it's made up of notes in the pentatonic scale -- it's the fifth, first, second, and third of the scale, in that order:\n\n[demonstrates \"How Dry I Am\"]\n\nAnd so it's in the melody to \"This Land is Your Land\", for example, a song which is very much in the same spirit of progressive Americana in which Van Dyke Parks was thinking:\n\n[Excerpt: Woody Guthrie, \"This Land is Your Land\"]\n\nIt's also the start of the original melody of \"You Are My Sunshine\":\n\n[Excerpt: Jimmie Davis, \"You Are My Sunshine\" ]\n\nBrian rearranged that melody when he stuck it into a minor key, so it's no longer \"How Dry I Am\" in the Beach Boys version, but if you play the \"How Dry I Am\" notes in a different rhythm, you get this:\n\n[Plays \"He Gives Speeches\" melody]\n\nWhich is the start of the melody to \"He Gives Speeches\":\n\n[Excerpt: The Beach Boys, \"He Gives Speeches\"]\n\nPlay those notes backwards, you get:\n\n[Plays \"He Gives Speeches\" melody backwards]\n\nDo that and add onto the end a passing sixth and then the tonic, and then you get:\n\n[Plays that]\n\nWhich is the vocal *countermelody* in \"He Gives Speeches\":\n\n[Excerpt: The Beach Boys, \"He Gives Speeches\"]\n\nAnd also turns up in some versions of \"Heroes and Villains\":\n\n[Excerpt: The Beach Boys, \"Heroes and Villains (alternate version)\"]\n\nAnd so on. Smile was an intricate web of themes and variations, and it incorporated motifs from many sources, both the great American songbook and the R&B of Brian's youth spent listening to Johnny Otis' radio show. There were bits of \"Gee\" by the Crows, of \"Twelfth Street Rag\", and of course, given that this was Brian Wilson, bits of Phil Spector. The backing track to the verse of \"Heroes and Villains\":\n\n[Excerpt: The Beach Boys, \"Heroes and Villains\"]\n\nOwed more than a little to a version of \"Save the Last Dance For Me\" that Spector had produced for Ike and Tina Turner:\n\n[Excerpt: Ike and Tina Turner, \"Save the Last Dance For Me\"]\n\nWhile one version of the song “Wonderful” contained a rather out-of-place homage to Etta James and “The Wallflower”:\n\n[Excerpt: “Wonderful (Rock With Me Henry)”]\n\nAs the recording continued, it became more and more obvious that the combination of these themes and variations was becoming a little too much for Brian.  Many of the songs he was working on were made up of individual modules that he was planning to splice together the way he had with \"Good Vibrations\", and some modules were getting moved between tracks, as he tried to structure the songs in the edit. He'd managed it with \"Good Vibrations\", but this was an entire album, not just a single, and it was becoming more and more difficult.\n\nDavid Anderle, who was heading up the record label the group were looking at starting, would talk about Brian playing him acetates with sections edited together one way, and thinking it was perfect, and obviously the correct way to put them together, the only possible way, and then hearing the same sections edited together in a different way, and thinking *that* was perfect, and obviously the correct way to put them together.\n\nBut while a lot of the album was modular, there were also several complete songs with beginnings, middles, ends, and structures, even if they were in several movements. And those songs showed that if Brian could just get the other stuff right, the album could be very, very, special. There was \"Heroes and Villains\" itself, of course, which kept changing its structure but was still based around the same basic melody and story that Brian and Van Dyke had come up with on their first day working together. There was also \"Wonderful\", a beautiful, allusive, song about innocence lost and regained:\n\n[Excerpt: The Beach Boys, \"Wonderful\"]\n\nAnd there was CabinEssence, a song which referenced yet another classic song, this time \"Home on the Range\", to tell a story of idyllic rural life and of the industrialisation which came with westward expansion:\n\n[Excerpt: The Beach Boys, \"CabinEssence\"]\n\nThe arrangement for that song inspired Van Dyke Parks to make a very astute assessment of Brian Wilson. He said later \"He knew that he had to adhere to the counter-culture, and I knew that I had to. I think that he was about as estranged from it as I was.... At the same time, he didn't want to lose that kind of gauche sensibility that he had. He was doing stuff that nobody would dream of doing. You would never, for example, use one string on a banjo when you had five; it just wasn't done. But when I asked him to bring a banjo in, that's what he did. This old-style plectrum thing. One string. That's gauche.\"\n\nBoth Parks and Wilson were both drawn to and alienated from the counterculture, but in very different ways, and their different ways of relating to the counterculture created the creative tension that makes the Smile project so interesting. Parks is fundamentally a New Deal Liberal, and was excited by the progresssive nature of the counterculture, but also rather worried about its tendency to throw the baby out with the bathwater, and to ignore the old in pursuit of the new. He was an erudite, cultured, sophisticated man who thought that there was value to be found in the works and attitudes of the past, even as one must look to the future.\n\nHe was influenced by the beat poets and the avant garde art of the time, but also said of his folk music period \"A harpist would bring his harp with him and he would play and recite a story which had been passed down the generations. This particular legacy continued through Arthurian legend, and then through the Middle Ages, and even into the nineteenth century. With all these songs, half of the story was the lyrics, and the folk songs were very interesting. They were tremendously thought-driven songs; there was nothing confusing about that. Even when the Kingston Trio came out -- and Brian has already admitted his debt to the Kingston Trio -- 'Tom Dooley', the story of a murder most foul 'MTA' an urban nightmare -- all of this thought-driven music was perfectly acceptable.  It was more than a teenage romantic crisis.\"\n\nBrian Wilson, on the other hand, was anything *but* sophisticated. He is a simple man in the best sense of the term -- he likes what he likes, doesn't like what he doesn't like, and has no pretensions whatsoever about it. He is, at heart, a middle-class middle-American brought up in suburbia, with a taste for steaks and hamburgers, broad physical comedy, baseball, and easy listening music.\n\nWhere Van Dyke Parks was talking about \"thought-driven music\", Wilson's music, while thoughtful, has always been driven by feelings first and foremost. Where Parks is influenced by Romantic composers like Gottschalk but is fundamentally a craftsman, a traditionalist, a mason adding his work to a cathedral whose construction started before his birth and will continue after his death, Wilson's music has none of the stylistic hallmarks of Romantic music, but in its inspiration it is absolutely Romantic -- it is the immediate emotional expression of the individual, completely unfiltered. When writing his own lyrics in later years Wilson would come up with everything from almost haiku-like lyrics like \"I'm a leaf on a windy day/pretty soon I'll be blown away/How long with the wind blow?/Until I die\" to \"He sits behind his microphone/Johnny Carson/He speaks in such a manly tone/Johnny Carson\", depending on whether at the time his prime concern was existential meaninglessness or what was on the TV.\n\nWilson found the new counterculture exciting, but was also very aware he didn't fit in. He was developing a new group of friends, the hippest of the hip in LA counterculture circles -- the singer Danny Hutton, Mark Volman of the Turtles, the writers Michael Vosse and Jules Siegel, scenester and record executive David Anderle -- but there was always the underlying implication that at least some of these people regarded him as, to use an ableist term but one which they would probably have used, an idiot savant. That they thought of him, as his former collaborator Tony Asher would later uncharitably put it, as \"a genius musician but an amateur human being\".\n\nSo for example when Siegel brought the great postmodern novelist Thomas Pynchon to visit Brian, both men largely sat in silence, unable to speak to each other; Pynchon because he tended to be a reactive person in conversation and would wait for the other person to initiate topics of discussion, Brian because he was so intimidated by Pynchon's reputation as a great East Coast intellectual that he was largely silent for fear of making a fool of himself.\n\nIt was this gaucheness, as Parks eventually put it, and Parks' understanding that this was actually a quality to be cherished and the key to Wilson's art, that eventually gave the title to the most ambitious of the complete songs the duo were working on. They had most of the song -- a song about the power of music, the concept of enlightenment, and the rise and fall of civilisations:\n\n[Excerpt: The Beach Boys, \"Surf's Up\"]\n\nBut Parks hadn't yet quite finished the lyric. The Beach Boys had been off on tour for much of Brian and Van Dyke's collaboration, and had just got back from their first real tour of the UK, where Pet Sounds had been a smash hit, rather than the middling success it had been in the US, and \"Good Vibrations\" had just become their first number one single. Brian and Van Dyke played the song for Brian's brother Dennis, the Beach Boys' drummer, and the band member most in tune with Brian's musical ambitions at this time.\n\nDennis started crying, and started talking about how the British audiences had loved their music, but had laughed at their on-stage striped-shirt uniforms. Parks couldn't tell if he was crying because of the beauty of the unfinished song, the humiliation he had suffered in Britain, or both. Dennis then asked what the name of the song was, and as Parks later put it \"Although it was the most gauche factor, and although maybe Brian thought it was the most dispensable thing, I thought it was very important to continue to use the name and keep the elephant in the room -- to keep the surfing image but to sensitise it to new opportunities. One of these would be an eco-consciousness; it would be speaking about the greening of the Earth, aboriginal people, how we had treated the Indians, taking on those things and putting them into the thoughts that come with the music. That was a solution to the relevance of the group, and I wanted the group to be relevant.\"\n\nVan Dyke had decided on a title: \"Surf's Up\":\n\n[Excerpt: The Beach Boys, \"Surf's Up\"]\n\nAs the group were now back from their tour, the focus for recording shifted from the instrumental sessions to vocal ones. Parks had often attended the instrumental sessions, as he was an accomplished musician and arranger himself, and would play on the sessions, but also wanted to learn from what Brian was doing -- he's stated later that some of his use of tuned percussion in the decades since, for example, has come from watching Brian's work.\n\nBut while he was also a good singer, he was not a singer in the same style as the Beach Boys, and they certainly didn't need his presence at those sessions, so he continued to work on his lyrics, and to do his arrangement and session work for other artists, while they worked in the studio.\n\nHe was also, though, starting to distance himself from Brian for other reasons. At the start of the summer, Brian's eccentricity and whimsy had seemed harmless -- indeed, the kind of thing he was doing, such as putting his piano in a sandbox so he could feel the sand with his feet while he wrote, seems very much on a par with Maureen Cleave's descriptions of John Lennon in the same period. They were two newly-rich, easily bored, young men with low attention spans and high intelligence who could become deeply depressed when understimulated and so would get new ideas into their heads, spend money on their new fads, and then quickly discard them.\n\nBut as the summer wore on into autumn and winter, Brian's behaviour became more bizarre, and to Parks' eyes more distasteful. We now know that Brian was suffering a period of increasing mental ill-health, something that was probably not helped by the copious intake of cannabis and amphetamines he was using to spur his creativity, but at the time most people around him didn't realise this, and general knowledge of mental illness was even less than it is today. Brian was starting to do things like insist on holding business meetings in his swimming pool, partly because people wouldn't be able to spy on him, and partly because he thought people would be more honest if they were in the water.\n\nThere were also events like the recording session where Wilson paid for several session musicians, not to play their instruments, but to be recorded while they sat in a pitch-black room and played the party game Lifeboat with Jules Siegel and several of Wilson's friends, most of whom were stoned and not really understanding what they were doing, while they got angrier and more frustrated.\n\nAlan Jardine -- who unlike the Wilson brothers, and even Mike Love to an extent, never indulged in illegal drugs -- has talked about not understanding why, in some vocal sessions, Brian would make the group crawl on their hands and knees while making noises like animals:\n\n[Excerpt: The Beach Boys, \"Heroes and Villains Part 3 (Animals)\"]\n\nAs Parks delicately put it \"I sensed all that was destructive, so I withdrew from those related social encounters.\"\n\nWhat this meant though was that he was unaware that not all the Beach Boys took the same attitude of complete support for the work he and Brian had been doing that Dennis Wilson -- the only other group member he'd met at this point -- took.\n\nIn particular, Mike Love was not a fan of Parks' lyrics. As he said later \"I called it acid alliteration. The [lyrics are] far out. But do they relate like 'Surfin' USA,' like 'Fun Fun Fun,' like 'California Girls,' like 'I Get Around'? Perhaps not! So that's the distinction. See, I'm into success. These words equal successful hit records; those words don't\"\n\nNow, Love has taken a lot of heat for this over the years, and on an artistic level that's completely understandable. Parks' lyrics were, to my mind at least, the best the Beach Boys ever had -- thoughtful, intelligent, moving, at times profound, often funny, often beautiful.\n\nBut, while I profoundly disagree with Love, I have a certain amount of sympathy for his position. From Love's perspective, first and foremost, this is his source of income. He was the only one of the Beach Boys to ever have had a day job -- he'd worked at his father's sheet metal company -- and didn't particularly relish the idea of going back to manual labour if the rock star gig dried up. It wasn't that he was *opposed* to art, of course -- he'd written the lyrics to \"Good Vibrations\", possibly the most arty rock single released to that point, hadn't he? -- but that had been *commercial* art. It had sold. Was this stuff going to sell? Was he still going to be able to feed his wife and kids?\n\nAlso, up until a few months earlier he had been Brian's principal songwriting collaborator. He was *still* the most commercially successful collaborator Brian had had. From his perspective, this was a partnership, and it was being turned into a dictatorship without him having been consulted. Before, it had been \"Mike, can you write some lyrics for this song about cars?\", now it was \"Mike, you're going to sing these lyrics about a crow uncovering a cornfield\".\n\nAnd not only that, but Mike had not met Brian's new collaborator, but knew he was hanging round with Brian's new druggie friends. And Brian was behaving increasingly weirdly, which Mike put down to the influence of the drugs and these new friends.\n\nIt can't have helped that at the same time the group's publicist, Derek Taylor, was heavily pushing the line \"Brian Wilson is a genius\". This was causing Brian some distress -- he didn't think of himself as a genius, and he saw the label as a burden, something it was impossible to live up to -- but was also causing friction in the group, as it seemed that their contributions were being dismissed.\n\nAgain, I don't agree with Mike's position on any of this, but it is understandable. It's also the case that Mike Love is, by nature, a very assertive and gregarious person, while Brian Wilson, for all that he took control in the studio, is incredibly conflict-avoidant and sensitive. From what I know of the two men's personalities, and from things they've said, and from the session recordings that have leaked over the years, it seems entirely likely that Love will have seen himself as having reasonable criticisms, and putting them to Brian clearly with a bit of teasing to take the sting out of them; while Brian will have seen Love as mercilessly attacking and ridiculing the work that meant so much to him in a cruel and hurtful manner, and that neither will have understood at the time that that was how the other was seeing things.\n\nLove's criticisms intensified. Not of everything -- he's several times expressed admiration for \"Heroes and Villains\" and \"Wonderful\" -- but in general he was not a fan of Parks' lyrics. And his criticisms seemed to start to affect Brian. It's difficult to say what Brian thinks about Parks' lyrics, because he has a habit in interviews of saying what he thinks the interviewer wants to hear, and the whole subject of Smile became a touchy one for him for a long time, so in some interviews he has talked about how dazzlingly brilliant they are, while at other times he's seemed to agree with Love, saying they were \"Van Dyke Parks lyrics\", not \"Beach Boys lyrics\". He may well sincerely think both at the same time, or have thought both at different times.\n\nThis came to a head with a session for the tag of \"Cabinessence\":\n\n[Excerpt: The Beach Boys, \"Cabinessence\"]\n\nLove insisted on having the line \"over and over the crow flies uncover the cornfield\" explained to him, and Brian eventually decided to call Van Dyke Parks and have him come to the studio.\n\nUp to this point, Parks had no idea that there was anything controversial, so when Brian phoned him up and very casually said that Mike had a few questions about the lyrics, could he come down to the studio? He went without a second thought. He later said \"The only person I had had any interchange with before that was Dennis, who had responded very favorably to 'Heroes and Villains' and 'Surf's Up'. Based on that, I gathered that the work would be approved. But then, with no warning whatsoever, I got that phone call from Brian. And that's when the whole house of cards came tumbling down.\"\n\nParks got to the studio, where he was confronted by an angry Mike Love, insisting he explain the lyrics. Now, as will be, I hope, clear from everything I've said, Parks and Love are very, very, *very* different people. Having met both men -- albeit only in formal fan-meeting situations where they're presenting their public face -- I actually find both men very likeable, but in very different ways. Love is gregarious, a charmer, the kind of man who would make a good salesman and who people use terms like \"alpha male\" about. He's tall, and has a casual confidence that can easily read as arrogance, and a straightforward sense of humour that can sometimes veer into the cruel.\n\nParks, on the other hand, is small, meticulously well-mannered and well-spoken, has a high, precise, speaking voice which probably reads as effeminate to the kind of people who use terms like \"alpha male\", and the kind of devastating intelligence and Southern US attention to propriety which means that if he *wanted* to say something cruel about someone, the victim would believe themselves to have been complimented until a horrific realisation two days after the event.\n\nIn every way, from their politics to their attitudes to art versus commerce to their mannerisms to their appearance, Mike Love and Van Dyke Parks are utterly different people, and were never going to mix well. And Brian Wilson, who was supposed to be the collaborator for both of them, was not mediating between them, not even expressing an opinion -- his own mental problems had reached the stage where he simply couldn't deal with the conflict. Parks felt ambushed and hurt, Love felt angry, especially when Parks could not explain the literal meaning of his lyrics. Eventually Parks just said \"I have no excuse, sir\", and left.\n\nParks later said \"That's when I lost interest. Because basically I was taught not to be where I wasn't wanted, and I could feel I wasn't wanted. It was like I had someone else's job, which was abhorrent to me, because I don't even want my own job. It was sad, so I decided to get away quick.\"\n\nParks continued collaborating with Wilson, and continued attending instrumental sessions, but it was all wheelspinning -- no significant progress was made on any songs after that point, in early December.\nIt was becoming clear that the album wasn't going to be ready for its planned Christmas release, and it was pushed back to January, but Brian's mental health was becoming worse and worse. One example that's often cited as giving an insight into Brian's mental state at the time is his reaction to going to the cinema to see John Frankenheimer's classic science fiction horror film Seconds. Brian came in late, and the way the story is always told, when he was sat down the screen was black and a voice said from the darkness, \"Hello Mr. Wilson\".\n\nThat moment does not seem to correspond with anything in the actual film, but he probably came in around the twenty-four minute mark, where the main character walks down a corridor, filmed in a distorted, hallucinatory manner, to be greeted:\n\n[Excerpt: Seconds, 24:00]\n\nBut as Brian watched the film, primed by this, he became distressed by a number of apparent similarities to his life. The main character was going through death and rebirth, just as he felt he was. Right after the moment I just excerpted, Mr. Wilson is shown a film, and of course Brian was himself watching a film. The character goes to the beach in California, just like Brian. The character has a breakdown on a plane, just like Brian, and has to take pills to cope, and the breakdown happens right after this:\n\n[Excerpt: Seconds, from about 44:22]\n\nA studio in California? Just like where Brian spent his working days?\n\nThat kind of weird coincidence can be affecting enough in a work of art when one is relatively mentally stable, but Brian was not at all stable. By this point he was profoundly paranoid -- and he may have had good reason to be. Some of Brian's friends from this time period have insisted that Brian's semi-estranged abusive father and former manager, Murry, was having private detectives watch him and his brothers to find evidence that they were using drugs.\n\nIf you're in the early stages of a severe mental illness *and* you're self-medicating with illegal drugs, *and* people are actually spying on you, then that kind of coincidence becomes a lot more distressing. Brian became convinced that the film was the work of mind gangsters, probably in the pay of Phil Spector, who were trying to drive him mad and were using telepathy to spy on him.\n\nHe started to bar people who had until recently been his friends from coming to sessions -- he decided that Jules Siegel's girlfriend was a witch and so Siegel was no longer welcome -- and what had been a creative process in the studio degenerated into noodling and second-guessing himself. He also, with January having come and the album still not delivered, started doing side projects,  some of which, like his production of tracks for photographer Jasper Daily, seem evidence either of his bizarre sense of humour, or of his detachment from reality, or both:\n\n[Excerpt: Jasper Daily, \"Teeter Totter Love\"]\n\nAs 1967 drew on, things got worse and worse. Brian was by this point concentrating on just one or two tracks, but endlessly reworking elements of them. He became convinced that the track \"Fire\" had caused some actual fires to break out in LA, and needed to be scrapped. The January deadline came and went with no sign of the album. To add to that, the group discovered that they were owed vast amounts of unpaid royalties by Capitol records, and legal action started which meant that even were the record to be finished it might become a pawn in the legal wrangling.\n\nParks eventually became exasperated by Brian -- he said later \"I was victimised by Brian Wilson's buffoonery\" -- and he quit the project altogether in February after a row with Brian. He returned a couple of weeks later out of a sense of loyalty, but quit again in April.\n\nBy April, he'd been working enough with Lenny Waronker that Waronker offered him a contract with Warner Brothers as a solo artist -- partly because Warners wanted some insight into Brian Wilson's techniques as a hit-making producer.\n\nTo start with, Parks released a single, to dip a toe in the water, under the pseudonym \"George Washington Brown\". It was a largely-instrumental cover version of Donovan's song \"Colours\", which Parks chose because after seeing the film Don't Look Back, a documentary of Bob Dylan's 1965 British tour, he felt saddened at the way Dylan had treated Donovan:\n\n[Excerpt: George Washington Brown, \"Donovan's Colours\"]\n\nThat was not a hit, but it got enough positive coverage, including an ecstatic review from Richard Goldstein in the Village Voice, that Parks was given carte blanche to create the album he wanted to create, with one of the largest budgets of any album released to that date. The result was a masterpiece, and very similar to the vision of Smile that Parks had had -- an album of clever, thoroughly American music which had more to do with Charles Ives than the British Invasion:\n\n[Excerpt: Van Dyke Parks, \"The All Golden\"]\n\nBut Parks realised the album, titled Song Cycle, was doomed to failure when at a playback session, the head of Warner Brothers records said \"Song Cycle? So where are the songs?\"\n\nAccording to Parks, the album was only released because Jac Holzman of Elektra Records was also there, and took out his chequebook and said he'd release the album if Warners wouldn't, but it had little push, apart from some rather experimental magazine adverts which were, if anything, counterproductive.\n\nBut Waronker recognised Parks' talent, and had even written into Parks' contract that Parks would be employed as a session player at scale on every session Waronker produced -- something that didn't actually happen, because Parks didn't insist on it, but which did mean Parks had a certain amount of job security. Over the next couple of years Parks and Waronker co-produced the first albums by two of their colleagues from Waronker's brains trust, with Parks arranging -- Randy Newman:\n\n[Excerpt: Randy Newman, \"I Think It's Going to Rain Today\"]\n\nAnd Ry Cooder:\n\n[Excerpt: Ry Cooder, \"One Meat Ball\"]\n\nWaronker would refer to himself, Parks, Cooder, and Newman as \"the arts and crafts division\" of Warners, and while these initial records weren't very successful, all of them would go on to bigger things. Parks would be a pioneer of music video, heading up Warners' music video department in the early seventies, and would also have a staggeringly varied career over the years, doing everything from teaming up again with the Beach Boys to play accordion on \"Kokomo\" to doing the string arrangements on Joanna Newsom's album Ys, collaborating with everyone from U2 to Skrillex,  discovering Rufus Wainwright, and even acting again, appearing in Twin Peaks. He also continued to make massively inventive solo albums, releasing roughly one every decade, each unique and yet all bearing the hallmarks of his idiosyncratic style.\n\nAs you can imagine, he is very likely to come up again in future episodes, though we're leaving him for now.\n\nMeanwhile, the Beach Boys were floundering, and still had no album -- and now Parks was no longer working with Brian, the whole idea of Smile was scrapped. The priority was now to get a single done, and so work started on a new, finished, version of \"Heroes and Villains\", structured in a fairly conventional manner using elements of the Smile recordings.\n\nThe group were suffering from numerous interlocking problems at this point, and everyone was stressed -- they were suing their record label, Dennis' wife had filed for divorce, Brian was having mental health problems, and Carl had been arrested for draft dodging -- though he was later able to mount a successful defence that he was a conscientious objector. Also, at some point around this time, Bruce Johnston seems to have temporarily quit the group, though this was never announced -- he doesn't seem to have been at any sessions from late May or early June through mid-September, and didn't attend the two shows they performed in that time.\n\nThey were meant to have performed three shows, but even though Brian was on the board of the Monterey Pop Festival, they pulled out at the last minute, saying that they needed to deal with getting the new single finished and with Carl's draft problems. Some or all of these other issues almost certainly fed into that, but the end result was that the Beach Boys were seen to have admitted defeat, to have handed the crown of relevance off to the San Francisco groups.\n\nAnd even if Smile had been released, there were other releases stealing its thunder. If it had come out in December it would have been massively ahead of its time, but after the Beatles released Sgt Pepper it would have seemed like it was a cheap copy -- though Parks has always said he believes the Beatles heard some of the Smile tapes and copied elements of the recordings, though I don't hear much similarity myself.\n\nBut I do hear a strong similarity in \"My World Fell Down\" by Sagittarius, which came out in June, and which was largely made by erstwhile collaborators of Brian -- Gary Usher produced, Glen Campbell sang lead, and Bruce Johnston sang backing vocals:\n\n[Excerpt: Sagittarius, \"My World Fell Down\"]\n\nBrian was very concerned after hearing that that someone *had* heard the Smile tapes, and one can understand why.\n\nWhen \"Heroes and Villains\" finally came out, it was a great single, but only made number twelve in the charts. It was fantastic, but out of step with the times, and nothing could have lived up to the hype that had built up around it:\n\n[Excerpt: The Beach Boys, \"Heroes and Villains\"]\n\nInstead of Smile, the group released an album called Smiley Smile, recorded in a couple of months in Brian's home studio, with no studio musicians and no involvement from Bruce, other than the previously released singles, and with the production credited to \"the Beach Boys\" rather than Brian.\n\nSmiley Smile has been unfairly dismissed over the years, but it's actually an album that was ahead of its time. It's a collection of stripped down versions of Smile songs and new fragments using some of the same motifs, recorded with minimal instrumentation. Some of it is on a par with the Smile material it's based on:\n\n[Excerpt: The Beach Boys, \"Wonderful\"]\n\nSome is, to my ears, far more beautiful than the Smile versions:\n\n[Excerpt: The Beach Boys, \"Wind Chimes\"]\n\nAnd some has a fun goofiness which relates back to one of Brian's discarded ideas for Smile, that it be a humour album:\n\n[Excerpt: The Beach Boys, \"She's Going Bald\"]\n\nThe album was a commercial flop, by far the least successful thing the group had released to that point in the US, not even making the top forty when it came out in September, though it made the top ten in the UK, but interestingly it *wasn't* a critical flop, at least at first.\n\nWhile the scrapping of Smile had been mentioned, it still wasn't widely known, and so for example Richard Goldstein, the journalist whose glowing review of \"Donovan's Colours\" in the Village Voice had secured Van Dyke Parks the opportunity to make Song Cycle, gave it a review in the New York Times which is written as if Goldstein at least believes it *is* the album that had been promised all along, and he speaks of it very perceptively -- and here I'm going to quote quite extensively, because the narrative about this album has always been that it was panned from the start and made the group a laughing stock:\n\n\"Smiley Smile hardly reads like a rock cantata. But there are moments in songs such as 'With Me Tonight' and 'Wonderful' that soar like sacred music. Even the songs that seem irrelevant to a rock-hymn are infused with stained-glass melodies. Wilson is a sound sculptor and his songs are all harmonious litanies to the gentle holiness of love — post-Christian, perhaps but still believing.\n'Wind Chimes', the most important piece on the album, is a fine example of Brian Wilson's organic pop structure. It contains three movements. First, Wilson sets a lyric and melodic mood (\"In the late afternoon, you're hung up on wind chimes\"). Then he introduces a totally different scene, utilizing passages of pure, wordless harmony. His two-and-a-half minute hymn ends with a third movement in which the voices join together in an exquisite round, singing the words, \"Whisperin' winds set my wind chimes a-tinklin'.\" The voices fade out slowly, like the bittersweet afternoon in question.\n\nThe technique of montage is an important aspect of Wilson's rock cantata, since the entire album tends to flow as a single composition. Songs like 'Heroes and Villains', are fragmented by speeding up or slowing down their verses and refrains. The effect is like viewing the song through a spinning prism. Sometimes, as in 'Fall Breaks and Back to Winter' (subtitled \"W. Woodpecker Symphony\"), the music is tiered into contrapuntal variations on a sliver of melody. The listener is thrown into a vast musical machine of countless working gears, each spinning in its own orbit.\"\n\nThat's a discussion of the album that I hear when I listen to Smiley Smile, and the group seem to have been artistically happy with it, at least at first. They travelled to Hawaii to record a live album (with Brian, as Bruce was still out of the picture), taking the Baldwin organ that Brian used all over Smiley Smile with them, and performed rearranged versions of their old hits in the Smiley Smile style. When the recordings proved unusable, they recreated them in the studio, with Bruce returning to the group, where he would remain, with the intention of overdubbing audience noise and releasing a faked live album:\n\n[Excerpt: The Beach Boys, \"California Girls [Lei'd studio version]\"]\n\nThe idea of the live album, to be called Lei'd in Hawaii, was scrapped, but that's not the kind of radical reimagining of your sound that you do if you think you've made an artistic failure. Indeed, the group's next album, Wild Honey, which came out in late 1967, is very much a successor to Smiley Smile in its stripped-down sound, but with a set of songs that have a certain amount of influence from the soul music that Carl and Mike were now listening to.\n\n[Excerpt: The Beach Boys, \"Wild Honey\"]\n\nThe singles from \"Wild Honey\" were moderately successful, and it looked like the group were going to reinvent themselves, but then the critical consensus changed. First there was Jules Siegel's article on Smile, titled \"Goodbye Surfing, Hello God\", which had been intended for the Saturday Evening Post but had itself gone through endless delays, and which eventually came out in Cheetah magazine roughly a month after Smiley Smile came out, and which became the first draft of history as far as Smile was concerned -- telling the story not of an album scrapped and reworked, but of Icarus soaring too close to the sun, while his bandmates pulled the feathers off. It reinforced all the \"genius\" stories that Wilson had found so upsetting, while implicitly making any new music that actually got released pale in comparison to a mythical album that had never been finished and which could take on any shape the listener imagined.\n\nMeanwhile, Jann Wenner wrote an article in his new magazine Rolling Stone -- a magazine which explicitly sided with San Francisco in the war between Frisco and LA, and which over the years would contribute to almost all the LA bands being critically sidelined or forgotten in the US, no matter how good they'd been -- dismissing all the hype about the group and about Brian's genius, and arguing that they were only a moderately good pop band, and not even that good live, and should stick to the fun stuff they knew and not try to play with the big boys.\n\nAnd more or less overnight these two views became the sum total of American critical opinion of the Beach Boys -- a mainstream opinion that dismissed them as frothy lightweight has-beens who'd made a few good singles but had been overtaken, and a more hipsterish, underground, version that said that Brian Wilson was a genius but he had been sabotaged by his bandmates and the proof of that genius had never been released, so you'd best just take it on trust.\n\nNeither required any acknowledgement of any work the group might do in the future, any capacity of progress or relevance for them, or any reason to engage critically with any new work they did. Brian Wilson was permanently cast as either an overrated dilettante who believed his own press or a tragic victim sabotaged by his family; his bandmates, either way, as talentless hacks. And as anyone who has tried to talk about the Beach Boys online knows, that dual consensus remains largely in place today, irrespective of any actual qualities of the music.\n\nAt least for the moment, though, the group were still on a commercial and critical upswing in the UK, at a time when critical reputations were much less coupled than they are now, and when Mike and Bruce decided to drop in at the Beatles' Christmas launch party for their new film, Magical Mystery Tour, they were treated as honoured guests, and invited to jam on stage with, depending on which version of events you believe, either John, Paul, and Ringo, the Bonzo Dog Doo-Dah Band, or some combination of all of the above.\n\nAnd they had a new mutual acquaintance. A few days before, at the instigation of Dennis Wilson, the Beach Boys had met up with the Maharishi, who the Beatles had started seeing a couple of months earlier. Dennis himself didn't remain impressed with the Maharishi for long, and went off looking for another guru to follow, but Mike Love became a devoted follower, as he is to this day, and two months later Mike Love would join the Beatles and Donovan on a retreat with the Maharishi in Rishikesh, in India.\n\nWhat nobody could know at the time was that the songs the Beatles would write on that retreat would intersect horribly, in unpredictable ways, with Dennis Wilson's search for a guru. Ways which would ultimately lead back to the house on Cielo Drive where Brian and Van Dyke first agreed to collaborate.\nBut that, I am glad to say, is a much darker story for another time.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and fifty-three of A History of Rock Music in Five Hundred Songs looks at “Heroes and Villains” by the Beach Boys, and the collapse of the Smile album. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a sixteen-minute bonus episode available, on \"I Had Too Much to Dream Last Night\" by the Electric Prunes.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nThere is no Mixcloud this week, because there were too many Beach Boys songs in the episode.\n\nI used many resources for this episode. As well as the books I referred to in all the Beach Boys episodes, listed below, I used Domenic Priore's book Smile: The Story of Brian Wilson's Lost Masterpiece and Richard Henderson's 33 1/3 book on Van Dyke Parks' Song Cycle.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes, including several on both the Beach Boys and Gary Usher.  His books can be found at https://payhip.com/CMusicBooks\n\nAndrew Doe’s Bellagio 10452 site is an invaluable resource.\n\nJon Stebbins’ The Beach Boys FAQ is a good balance between accuracy and readability.\n\nAnd Philip Lambert’s Inside the Music of Brian Wilson is an excellent, though sadly out of print, musicological analysis of Wilson’s music from 1962 through 67.\n\nCatch a Wave: The Rise, Fall, and Redemption of the Beach Boys' Brian Wilson by Peter Ames Carlin is the best biography of Wilson.\n\nI have also referred to Brian Wilson’s autobiography, I Am Brian Wilson, and to Mike Love’s, Good Vibrations: My Life as a Beach Boy.\n\nAs a good starting point for the Beach Boys’ music in general, I would recommend this budget-priced three-CD set, which has a surprisingly good selection of their material on it, including the single version of “Heroes and Villains”.\n\nThe box set The Smile Sessions  contains an attempt to create a finished album from the unfinished sessions, plus several CDs of outtakes and session material.\n\nTranscript\n[Opening -- \"intro to the album\" studio chatter into \"Our Prayer\"]\nBefore I start, I'd just like to note that this episode contains some discussion of mental illness, including historical negative attitudes towards it, so you may want to check the transcript or skip this one if that might be upsetting.\n\nIn November and December 1966, the filmmaker David Oppenheim and the conductor and composer Leonard Bernstein collaborated on a TV film called \"Inside Pop: The Rock Revolution\".  The film was an early attempt at some of the kinds of things this podcast is doing, looking at how music and social events interact and evolve, though it was dealing with its present rather than the past.\nThe film tried to cast as wide a net as possible in its fifty-one minutes. It looked at two bands from Manchester -- the Hollies and Herman's Hermits -- and how the people identified as their leaders, \"Herman\" (or Peter Noone) and Graham Nash, differed on the issue of preventing war:\n[Excerpt: Inside Pop, the Rock Revolution]\n\nAnd it made a star of East Coast teenage singer-songwriter Janis Ian with her song about interracial relationships, \"Society's Child\":\n\n[Excerpt: Janis Ian, \"Society's Child\"]\n\nAnd Bernstein spends a significant time, as one would expect, analysing the music of the Beatles and to a lesser extent the Stones, though they don't appear in the show. Bernstein does a lot to legitimise the music just by taking it seriously as a subject for analysis, at a time when most wouldn't:\n\n[Excerpt: Leonard Bernstein talking about \"She Said She Said\"]\n\nYou can't see it, obviously, but in the clip that's from, as the Beatles recording is playing, Bernstein is conducting along with the music, as he would a symphony orchestra, showing where the beats are falling.\n\nBut of course, given tha",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and fifty-three of A History of Rock Music in Five Hundred Songs looks at “Heroes and Villains” by the Beach Boys, and the collapse of the Smile album. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a sixteen-minute bonus episode available, on \"I Had Too Much to Dream Last Night\" by the Electric Prunes.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nThere is no Mixcloud this week, because there were too many Beach Boys songs in the episode.\n\nI used many resources for this episode. As well as the books I referred to in all the Beach Boys episodes, listed below, I used Domenic Priore's book Smile: The Story of Brian Wilson's Lost Masterpiece and Richard Henderson's 33 1/3 book on Van Dyke Parks' Song Cy",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}