{
  "title": "Regulation Basics: Protection or Connection Neural Pathways &#8211; Which System are You Running Right Now? (166)",
  "link": "https://therapistuncensored.com/episodes/regulation-protection-versus-connection-pathways-166/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=regulation-protection-versus-connection-pathways-166",
  "pubDate": "Tue, 04 Jan 2022 03:00:24 +0000",
  "guid": "https://therapistuncensored.com/?p=12429",
  "description": "Everyone is familiar with reacting “in the heat of the moment,” but do we really understand what that means? In this episode, Sue Marriott and Ann Kelley unravel the mystery behind our nervous systems auto-pilot settings. They simplify otherwise complex ideas by breaking in to 2 main points.   Becoming aware whether you are in the Protection versus Connection pathways in our nervous system helps us manage them. How does our story affect how we react and deal with conflict, and how can we mitigate it? Tune in for this insightful and eye-opening discussion on our internal working models when interacting with others.   More at www.therapistuncensored.com/episodes",
  "enclosure": "",
  "itunes:subtitle": "Everyone is familiar with reacting “in the heat of the moment,” but do we really understand what that means? In this episode, Sue Marriott and Ann Kelley unravel the mystery behind our nervous systems auto-pilot settings.",
  "itunes:summary": "Everyone is familiar with reacting “in the heat of the moment,” but do we really understand what that means? Regulation basics include the protection or connection pathways to interpersonal relating.<br />\n<a href=\"https://ter.li/therapistuncensored\"></a><a href=\"https://ter.li/therapistuncensored\">Get 2 months free with this link!</a><br />\n<br />\nIn this episode, Sue Marriott and Ann Kelley unravel the mystery behind our nervous systems auto-pilot settings: protection vs connection. They simplify otherwise complex ideas by breaking in to 2 main points.   Becoming aware whether you are in the Protection/Defense versus Connection/Secure pathways in our nervous system helps us manage them. Also, how does our story affect how we react and deal with conflict, and how can we mitigate it?<br />\nTune in for this insightful and eye-opening discussion on our internal working models when interacting with others.<br />\nShow Notes about regulation and the protection or connection pathways:<br />\n00:00 Understanding our internal working model<br />\n01:05 Our body responds so much faster than our mind<br />\n<br />\n03:11 The story we tell amplifies the body’s response<br />\n05:30 Story vs State: Protective System and the Relational Connective System<br />\n08:11 Awareness of our state and identifying the tells of a protective system<br />\n16:12 The awareness of self in the presence of another, the relational system<br />\n17:49 Our smartest brain<br />\n19:30 Tells when you’re in a relational, connective, and reflective place<br />\n25:21 Tolerating difficult emotions<br />\n29:32 Use your own name to identify yourself<br />\n31:24 Ways to calm your body down<br />\n36:40 Pre-emptive strike; we get defensive because of the threat inside of our body<br />\n39:26 Positive interpretation of a story<br />\n41:02 Conclusion<br />\nFULL TRANSCRIPT BELOW Keep scrolling -<br />\nImportant Links:<br />\nSteve Porges, of course!  We have tons of stuff on Polyvagal Theory in our library, but here is a previous episode with Dr. Steve Porges directly, plus it includes lot's of other resources <a href=\"https://therapistuncensored.com/episodes/tu93-polyvagal-theory-in-action-the-practice-of-body-regulation-with-dr-stephen-porges/\">click here! </a><br />\n<br />\nGreat regulation PDF resource by former guest, <a href=\"https://www.rhythmofregulation.com/resources\">Deb</a> <a href=\"https://www.rhythmofregulation.com/resources\">Dana - Rhythm of Regulation</a><br />\nIf you enjoyed this content, please send it on to somebody you feel could use it. Word of mouth helps the podcast grow so more people can benefit from this free resource. Sharing is caring they say, and so are ratings and reviews!  :)<br />\nHelp support Therapist Uncensored by becoming a Premium member. Join our private Neuronerd community and support the production of this indie-produced cis-female led show!  As a bonus to helping spread this content, you will receive all episodes ad-free, deep dive premium episodes, access to reading and learning opportunities, extra episodes, plus of course discounts on everything we produce. <br />\n<br />\nWe love options so we are giving you a choice: if you are more visual and prefer direct communication and staying closely in touch with our activities join here: <a href=\"https://www.patreon.com/therapistuncensored\">https//www.Patreon.com/therapistuncensored</a>.  If you love listening to additional content and prefer to easily download bonus audio content to your normal feed, join us here: <a href=\"https://www.therapistuncensored.com/join\">https://www.therapistuncensored.com/join</a>. Either way, you will be part of our Neuronerd community and receive all of the ad-free episodes and bonuses. Platinum level Neuronerds and Benefactors meet with us, personally and get their own thank you page on our website! <br />\n<br />\n <br />\n<br />\n&nbsp;<br />\n<br />\n&nbsp;<br />\n<br />\n<a href=\"http://therapistuncensored.",
  "itunes:author": "Sue Marriott LCSW, CGP & Ann Kelley PhD",
  "itunes:image": "",
  "itunes:duration": "41:01"
}