{
  "title": "US weighs in on key ally&#039;s tensions with Iran",
  "link": "https://www.rt.com/news/565824-white-house-iran-saudi-tensions/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565824-white-house-iran-saudi-tensions/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63628b572030270e804a699c.jpg\" /> The US won’t hesitate to attack if Iran attacks Saudi Arabia, the White House stated in response to media reports <br/><a href=\"https://www.rt.com/news/565824-white-house-iran-saudi-tensions/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The White House is “concerned about the threat picture” in the Middle East, and Saudi Arabia in particular</strong></p>\n            \n                        \n            <p>The US is <em>&ldquo;concerned&rdquo;</em> about the risk of Iranian&nbsp;operations targeting&nbsp;Saudi Arabia, the White House stated on Wednesday. While neither Riyadh nor Tehran have made any official statements, the Wall Street Journal reported on Tuesday that Saudi intelligence had alerted the US of an <em>&ldquo;imminent&rdquo;</em> Iranian attack in the Middle East.</p>\n<p><strong></strong><em>&ldquo;We are concerned about the threat picture, and we remain in constant contact through military and intelligence channels with the Saudis,&rdquo;</em> an unnamed spokesperson from the National Security Council revealed to Reuters.&nbsp;</p>\n<p><strong></strong>The US <em>&ldquo;will not hesitate to act in the defense of our interests and partners,&rdquo; </em>the&nbsp;official added.</p>\n<p><strong></strong>Reuters noted that the Saudi government did not respond to the agency&rsquo;s request for comment. US and Saudi military forces have reportedly been placed on high alert.&nbsp;</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63618a1b85f54015db63a231.jpg\" alt=\"Iranian troops attend a maneuver in northwestern Iran, October 17, 2022\" />\n            <figcaption><a href=\"https://www.rt.com/news/565763-saudi-arabia-iran-attack/\">Saudi Arabia fears imminent attack from Iran – WSJ</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>The Sunni Saudis have long been at odds with the Shia Iranians, relying on US military hardware and bases for protection. However, the US has <a href=\"https://www.rt.com/business/564512-biden-warns-opec-consequences/\">threatened</a> to freeze military cooperation with Saudi Arabia after OPEC+ announced an oil production cut against US President Joe Biden&rsquo;s wishes. Riyadh also&nbsp;revealed that Biden had asked to delay the announcement until after the November US midterm elections.</p>\n<p><strong></strong>Iran has vowed to punish the perpetrators of the mass shooting at the Shia holy site of Shah Cheragh on October 26, when 15 people were killed. Islamic State (IS, formerly ISIS) has taken responsibility for the act.</p>\n<p><strong></strong>Speaking on Tuesday, Iran&rsquo;s Supreme Leader Ayatollah Ali Khamenei <a href=\"https://en.mehrnews.com/news/193177/US-not-untouchable-power-rather-it-is-totally-vulnerable\" target=\"_blank\" rel=\"noopener noreferrer\">blamed</a> the US, the<em> &ldquo;Zionist Israeli regime, and some malicious European regimes&rdquo;</em> for the recent unrest in Iran, describing it as <em>&ldquo;a hybrid war,&rdquo;</em> but did not mention Saudi Arabia.</p>",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 17:54:18 +0000",
  "dc:creator": "RT"
}