{
  "title": "Eric Holder's Supreme Court Protest",
  "description": "Dahlia Lithwick is joined by former Attorney General Eric Holder as Amicus begins its summer season while the Supreme Court is in recess. General Holder describes his feelings when, as President Barack Obama’s Attorney General, he realized he could not in good conscience take part in the long-held tradition of the AG arguing an “easy case” before the Supreme Court. The issue? That same court had just eviscerated the Voting Rights Act in a case that will forever bear his name: Shelby County v Holder. General Holder wants us to take the steps beyond anger at the assault on voting rights, and move forward with joy toward action. His book, Our Unfinished March, is both a history of how voting rights became broken, and an action plan for delivering the promise of democracy: that the people pick their leaders.\nSign up for Slate Plus now to listen and support our show.\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "pubDate": "Sat, 16 Jul 2022 07:00:00 -0000",
  "itunes:title": "Eric Holder's Supreme Court Protest",
  "itunes:episodeType": "full",
  "itunes:author": "Slate Podcasts",
  "itunes:subtitle": "President Obama’s Attorney General reveals why he decided to boycott SCOTUS",
  "itunes:summary": "Dahlia Lithwick is joined by former Attorney General Eric Holder as Amicus begins its summer season while the Supreme Court is in recess. General Holder describes his feelings when, as President Barack Obama’s Attorney General, he realized he could not in good conscience take part in the long-held tradition of the AG arguing an “easy case” before the Supreme Court. The issue? That same court had just eviscerated the Voting Rights Act in a case that will forever bear his name: Shelby County v Holder. General Holder wants us to take the steps beyond anger at the assault on voting rights, and move forward with joy toward action. His book, Our Unfinished March, is both a history of how voting rights became broken, and an action plan for delivering the promise of democracy: that the people pick their leaders.\nSign up for Slate Plus now to listen and support our show.\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "content:encoded": "<p>Dahlia Lithwick is joined by former Attorney General Eric Holder as Amicus begins its summer season while the Supreme Court is in recess. General Holder describes his feelings when, as President Barack Obama’s Attorney General, he realized he could not in good conscience take part in the long-held tradition of the AG arguing an “easy case” before the Supreme Court. The issue? That same court had just eviscerated the Voting Rights Act in a case that will forever bear his name: <em>Shelby County v Holder</em>. General Holder wants us to take the steps beyond anger at the assault on voting rights, and move forward with joy toward action. His book, <a href=\"http://www.amazon.com/dp/0593445740/?tag=slatmaga-20\"><em>Our Unfinished March</em></a>, is both a history of how voting rights became broken, and an action plan for delivering the promise of democracy: that the people pick their leaders.</p><p><a href=\"https://my.slate.com/plus?utm_medium=link&utm_campaign=plus_pod&utm_content=Amicus&utm_source=show_notes\">Sign up for Slate Plus</a> now to listen and support our show.</p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p>",
  "itunes:duration": 2989,
  "guid": 1000570032494,
  "enclosure": ""
}