{
  "title": "Announcing the 2022 Wolfram Innovator Award Winners",
  "link": "https://blog.wolfram.com/2022/10/19/announcing-the-2022-wolfram-innovator-award-winners/",
  "comments": "https://blog.wolfram.com/2022/10/19/announcing-the-2022-wolfram-innovator-award-winners/#comments",
  "pubDate": "Thu, 20 Oct 2022 03:47:44 +0000",
  "dc:creator": "Danielle Mayer",
  "category": "Events, New Technology, Wolfram News",
  "guid": "https://blog.wolfram.com/?p=86007",
  "description": "Our annual Wolfram Technology Conference returned to an in-person gathering October 18–21, 2022, in our headquarter city of Champaign, Illinois, USA. One of our very favorite events that took place during the conference was the Innovator Award ceremony and keynote dinner, where Stephen Wolfram recognized eight exceptional individuals and teams from across fields, disciplines and [&#8230;]",
  "content:encoded": "<p><img class=\"aligncenter box-shadow\" title=\"Announcing the 2022 Wolfram Innovator Award Winners\" src=\"https://content.wolfram.com/uploads/sites/39/2022/10/WTC-InnovatorAwards-GroupPhoto-blog.png\" alt=\"Announcing the 2022 Wolfram Innovator Award Winners\" width=\"620\" height=\"315\"/></p>\n<p>Our annual <a href='https://www.wolfram.com/events/technology-conference/2022/'>Wolfram Technology Conference</a> returned to an in-person gathering October 18–21, 2022, in our headquarter city of Champaign, Illinois, USA. One of our very favorite events that took place during the conference was the <a href='https://www.wolfram.com/events/technology-conference/innovator-award/?source=nav'>Innovator Award</a> ceremony and keynote dinner, where <a href='https://www.stephenwolfram.com/'>Stephen Wolfram</a> recognized eight exceptional individuals and teams from across fields, disciplines and the world for their computational excellence applying Wolfram technologies in innovative and exciting ways.<span id=\"more-86007\"></span></p>\n<p>We are pleased to introduce and congratulate the 2022 Wolfram Innovator Award winners.</p>\n<p><img class=\"aligncenter\" src=\"https://content.wolfram.com/uploads/sites/39/2022/10/01-PaulRGarvey2.png\" alt=\"Paul R. Garvey\" title=\"Paul R. Garvey\" width=\"400\" height=\"auto\"></p>\n<h2 id='paul-r.-garvey,-phd'>Paul R. Garvey</h2>\n<h3>Distinguished Chief Engineer/Scientist, The MITRE Corporation</h3>\n<p>Paul R. Garvey is a distinguished chief engineer/scientist at <a href='https://www.mitre.org/' target=_blank rel=noopener>The MITRE Corporation</a>, a not-for-profit organization operating federally funded research and development centers for the US government. He has decades of experience in systems operations research, network modeling, mission systems risk analyses, and the application of risk-decision analytics across a variety of problems in the federal government. His current work involves modeling the network structure of the US food supply chain, which is being done in collaboration with datasets and published studies by the <a href='https://illinois.edu/' target=_blank rel=noopener>University of Illinois Urbana-Champaign</a> (UIUC) research team led by Professor Megan Konar.</p>\n<p>Garvey has authored several textbooks, written numerous papers, holds a US patent, and continues to contribute his expertise and extensive <a href='https://www.wolfram.com/language/'>Wolfram Language</a> abilities to tackle big problems. One example is his work “<a href='https://www.mitre.org/news-insights/publication/us-food-supply-chain-security-network-analysis' target=_blank rel=noopener>US Food Supply Chain Security: A Network Analysis</a>,” in conjunction with UIUC.<br />\nUtilizing <a href='https://www.wolfram.com/mathematica/'>Mathematica&#8217;s</a> network modeling technologies, they identified critical US counties and links associated with the meat supply chain, which is characterized by 2,817 US counties (nodes) and 30,670 origin-to-destination links (edges) that exist between them.</p>\n<p><span></p>\n<p><img class=\"aligncenter\" src=\"https://content.wolfram.com/uploads/sites/39/2022/10/02-GevaResearchGroup.png\" alt=\"Compute-to-Learn, the Geva Research Group\" title=\"Compute-to-Learn, the Geva Research Group\" width=\"400\" height=\"auto\"></p>\n<h2 id='compute-to-learn-project,-the-geva-research-group'>Compute-to-Learn Project, the Geva Research Group</h2>\n<h3>University of Michigan Ann Arbor</h3>\n<h3>Accepted by: Ellen Mulvihill</h3>\n<p>The <a href='http://websites.umich.edu/~pchem/compute-to-learn.html' target=_blank rel=noopener>Compute-to-Learn project</a> provides students with the opportunity to engage in creative forms of active learning. Compute-to-Learn activities stem from evidence-based, student-centered learning approaches, such as emphasis on real-world applications to promote students’ integration of new ideas, as well as authentic, collaborative environments that apprentice students as members of a scientific discipline (via practices such as explanatory writing and peer review). Students participate in tutorials and training related to Mathematica; research and propose an original Demonstration idea; workshop the idea during design and production stages; and, finally, submit the final product to external review prior to publication and dissemination on the <a href='https://demonstrations.wolfram.com/'>Wolfram Demonstrations Project</a> website. The Compute-to-Learn pedagogy is implemented within a peer-led honors studio environment. It has been offered in the University of Michigan chemistry department since 2015.</p>\n<p><span></p>\n<p><img class=\"aligncenter\" src=\"https://content.wolfram.com/uploads/sites/39/2022/10/03-TetsuoIda.png\" alt=\"Tetsuo Ida\" title=\"Tetsuo Ida\" width=\"400\" height=\"auto\"></p>\n<h2 id='tetsuo-ida'>Tetsuo Ida</h2>\n<h3>Professor Emeritus, University of Tsukuba</h3>\n<p>Tetsuo Ida is a professor emeritus in the department of computer science and faculty of engineering, informatics and systems for the <a href='https://www.tsukuba.ac.jp/en/' target=_blank rel=noopener>University of Tsukuba</a>.</p>\n<p>Ida contributed greatly to expanding the use of computation in art, and is a pioneer of computational origami in particular. He and his team treat origami as a subject of art and a science and technology of shapes. They developed a software system called <a href='https://www.i-eos.org/' target=_blank rel=noopener>Eos</a> (E-origami system) to reason about origami computationally. Eos is written in Wolfram Language and is available as a package for Mathematica.</p>\n<p><span></p>\n<p><img class=\"aligncenter\" src=\"https://content.wolfram.com/uploads/sites/39/2022/10/04-RicardoMartinezLagunes2.png\" alt=\"Ricardo Mart&iacute;nez-Lagunes\" title=\"Ricardo Mart&iacute;nez-Lagunes\" width=\"400\" height=\"auto\"></p>\n<h2 id='ricardo-mart&iacute;nez-lagunes'>Ricardo Mart&iacute;nez-Lagunes</h2>\n<h3>Consultant, World Bank and Inter-American Development Bank</h3>\n<p>Ricardo Martínez-Lagunes is a consultant for both the <a href='https://www.worldbank.org/en/home' target=_blank rel=noopener>World Bank</a> and the <a href='https://www.iadb.org/en' target=_blank rel=noopener>Inter-American Development Bank</a>. His main professional activities currently focus on water resources policy, information systems for water resource management and environmental economic accounts and assessments.</p>\n<p>Martínez-Lagunes is using Wolfram technologies to develop the next generation of computational water policy analytical tools to better understand and tackle challenges such as improving water utilities. In addition, he has demonstrated the ability to ingest large and disconnected datasets, compute and visualize that information more efficiently and create computationally dynamic dashboards for decision makers for policy design for investment/funding initiatives.</p>\n<p></span></p>\n<p><img class=\"aligncenter\" src=\"https://content.wolfram.com/uploads/sites/39/2022/10/05-WilliamASethares.png\" alt=\"William A. Sethares\" title=\"William A. Sethares\" width=\"400\" height=\"auto\"></p>\n<h2 id='william-a.-sethares'>William A. Sethares</h2>\n<h3>Professor, Electrical and Computer Engineering</h3>\n<h3>University of Wisconsin&ndash;Madison</h3>\n<p>Bill Sethares is a researcher and professor of electrical and computer engineering at the College of Engineering at the <a href='https://engineering.wisc.edu/' target=_blank rel=noopener>University of Wisconsin–Madison</a>, focusing on signal processing with applications in acoustics, image processing, communications and optimization.</p>\n<p>At the University of Wisconsin–Madison, Sethares attracts students from majors beyond engineering with his computationally rich image processing course material and project-based learning (all Wolfram Language–based, of course!). Sethares is a founding member of the <a href='https://leocode.org' target=_blank rel=noopener>LEOcode project</a> and brings computation to art historians in the form of applications used to find patterns in watermarks and canvases. These can help to identify and date historical papers and paintings.</p>\n<p></span></p>\n<p><img class=\"aligncenter\" src=\"https://content.wolfram.com/uploads/sites/39/2022/10/06-LaurentSimon.png\" alt=\"Laurent Simon\" title=\"Laurent Simon\" width=\"400\" height=\"auto\"></p>\n<h2 id='laurent-simon'>Laurent Simon</h2>\n<h3>Professor of Chemical Engineering and Vice Provost for Undergrad Studies</h3>\n<h3>New Jersey Institute of Technology</h3>\n<p>Laurent Simon is a professor of chemical engineering and the vice provost for undergraduate studies at the <a href='https://www.njit.edu/' target=_blank rel=noopener>New Jersey Institute of Technology</a>.</p>\n<p>Simon’s current research focuses on transdermal drug delivery, protein purification, process modeling and control; these projects involve writing Wolfram Language code that is instrumental in building population pharmacokinetic/pharmacodynamic models and designing transdermal drug-delivery systems. These same research tools, deployed with <a href='https://www.wolfram.com/products/webmathematica/'>webMathematica</a>, are now used to enhance chemical engineering curricula with applications in biological engineering.</p>\n<p></span></p>\n<p><img class=\"aligncenter\" src=\"https://content.wolfram.com/uploads/sites/39/2022/10/07-DanielSze.png\" alt=\"Daniel Sze\" title=\"Daniel Sze\" width=\"400\" height=\"auto\"></p>\n<h2 id='daniel-sze'>Daniel Sze</h2>\n<h3>Research Fellow, Georgia Pacific Innovation Center</h3>\n<p>Daniel Sze is a research fellow at the <a href='https://www.gp.com/' target=_blank rel=noopener>Georgia Pacific Innovation Center</a>, working with dynamic system modeling to realize a new way to conduct research, tests and exploration in a much more cost-effective and timely way.</p>\n<p>Sze’s work focuses on quickly building interactive design tools and dynamic system modeling of some of Georgia Pacific’s largest papermaking systems. Dan is currently supporting an initiative to model large papermaking machines using <a href='https://www.wolfram.com/system-modeler/'>Wolfram System Modeler</a>, producing a GUI to easily change parameters related to friction, torque, speed and other variables to better understand the way large papermaking machines function under those circumstances.</p>\n<p></span></p>\n<p><img class=\"aligncenter\" src=\"https://content.wolfram.com/uploads/sites/39/2022/10/08-TELCONET.png\" alt=\"Telconet\" title=\"Telconet\" width=\"400\" height=\"auto\"></p>\n<h2 id='telconet'>Telconet</h2>\n<h3 id='award-accepted-by:-igor-krochin,-director'>Award Accepted by: Igor Krochin, Director</h3>\n<p>Igor Krochin is the managing director of <a href='https://www.telconet.net/' target=_blank rel=noopener>Telconet</a>, the largest telecom company in Ecuador. They own some of the first certified cloud and data centers in Latin America, along with the first fiber-optic cable factory in the region. </p>\n<p>Tomislav Topic and Krochin lead Telconet in implementing Wolfram Language solutions in a wide variety of areas, including events log correlations, route analysis and optimization, big data analysis and failure correlation, resulting in better planning and scalability. Telconet continues to build infrastructure and deploy services, including internet connectivity, that help students and educators in the region become empowered with Wolfram technologies, such as the <a href='https://es.wolframalpha.com/'>Spanish version of Wolfram|Alpha</a>, by accessing powerful and sophisticated computation from anywhere.</p>\n<p></span></p>\n<p>Please join us in congratulating these winners for their exceptional contributions applying computational intelligence.</p>\n",
  "wfw:commentRss": "https://blog.wolfram.com/2022/10/19/announcing-the-2022-wolfram-innovator-award-winners/feed/",
  "slash:comments": 1
}