{
  "title": "TransRec: Learning Transferable Recommendation from Mixture-of-Modality Feedback. (arXiv:2206.06190v2 [cs.IR] UPDATED)",
  "link": "http://arxiv.org/abs/2206.06190",
  "description": "<p>Learning large-scale pre-trained models on broad-ranging data and then\ntransfer to a wide range of target tasks has become the de facto paradigm in\nmany machine learning (ML) communities. Such big models are not only strong\nperformers in practice but also offer a promising way to break out of the\ntask-specific modeling restrictions, thereby enabling task-agnostic and unified\nML systems. However, such a popular paradigm is mainly unexplored by the\nrecommender systems (RS) community. A critical issue is that standard\nrecommendation models are primarily built on categorical identity features.\nThat is, the users and the interacted items are represented by their unique\nIDs, which are generally not shareable across different systems or platforms.\nTo pursue the transferable recommendations, we propose studying pre-trained RS\nmodels in a novel scenario where a user's interaction feedback involves a\nmixture-of-modality (MoM) items, e.g., text and images. We then present\nTransRec, a very simple modification made on the popular ID-based RS framework.\nTransRec learns directly from the raw features of the MoM items in an\nend-to-end training manner and thus enables effective transfer learning under\nvarious scenarios without relying on overlapped users or items. We empirically\nstudy the transferring ability of TransRec across four different real-world\nrecommendation settings. Besides, we look at its effects by scaling source and\ntarget data size. Our results suggest that learning neural recommendation\nmodels from MoM feedback provides a promising way to realize universal RS.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Wang_J/0/1/0/all/0/1\">Jie Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yuan_F/0/1/0/all/0/1\">Fajie Yuan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cheng_M/0/1/0/all/0/1\">Mingyue Cheng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Jose_J/0/1/0/all/0/1\">Joemon M. Jose</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yu_C/0/1/0/all/0/1\">Chenyun Yu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kong_B/0/1/0/all/0/1\">Beibei Kong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+He_X/0/1/0/all/0/1\">Xiangnan He</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_Z/0/1/0/all/0/1\">Zhijin Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hu_B/0/1/0/all/0/1\">Bo Hu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Li_Z/0/1/0/all/0/1\">Zang Li</a>"
}