{
  "title": "75: Understanding Habit Triggers with James Clear",
  "pubDate": "Thu, 18 Oct 2018 17:41:18 +0000",
  "guid": "5dc450ac6b05494981c5a3fe5fa992e3",
  "link": "https://sites.libsyn.com/94610/75-understanding-habit-triggers-with-james-clear",
  "itunes:image": "",
  "description": "<p>Do you watch too much Netflix or check your phone first thing in the morning?<br /> <br /> We all have habits we want to change for the better. But how do you form healthy habits?<br /> <br /> Usually, when we’re talking about changing habits, we’re focused mostly on the habits we want to take on, like journaling, meditating, working out at the gym, eating healthy, etc. Or getting rid of negative habits that get in our way of accomplishing the goal.<br /> <br /> In the previous episodes, we talked about how “you create your habits, then your habits create you.” But how do you go about creating those habits?<br /> <br /> I’m excited about this episode because we brought in James Clear, the author of Atomic Habits, to talk about how we form habits and the triggers we have in our environment that leads to those habits.<br /> <br /> Listen in as we go over how tiny changes can have remarkable results on your daily habits.<br /> <br /> ** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. ** </p>",
  "content:encoded": "<p>Do you watch too much Netflix or check your phone first thing in the morning?  We all have habits we want to change for the better. But how do you form healthy habits?  Usually, when we’re talking about changing habits, we’re focused mostly on the habits we want to take on, like journaling, meditating, working out at the gym, eating healthy, etc. Or getting rid of negative habits that get in our way of accomplishing the goal.  In the previous episodes, we talked about how “you create your habits, then your habits create you.” But how do you go about creating those habits?  I’m excited about this episode because we brought in James Clear, the author of Atomic Habits, to talk about how we form habits and the triggers we have in our environment that leads to those habits.  Listen in as we go over how tiny changes can have remarkable results on your daily habits.  ** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. ** </p>",
  "enclosure": "",
  "itunes:duration": "18:27",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Do you watch too much Netflix or check your phone first thing in the morning?  We all have habits we want to change for the better. But how do you form healthy habits?  Usually, when we’re talking about changing habits, we’re focused mostly on the...",
  "itunes:episodeType": "full"
}