{
  "title": "Zero-Energy Tech Heats When Cold and Cools When Hot",
  "link": "https://spectrum.ieee.org/passive-radiative-cooling-device",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-blue-gloved-hand-holds-a-grey-square-in-front-of-a-green-plant.jpg?id=31787347&width=1245&height=700&coordinates=0%2C278%2C0%2C279\"/><br/><br/><p>A new heat-management device senses temperature and in response changes its shape to heat up or cool down, all without using any external energy. By supplementing commercial heating and cooling technologies, the zero-energy device could cut down the year-round energy demand of building temperature control, its developers say.</p><p>Heating and cooling accounts for <a href=\"https://www.un.org/en/actnow/facts-and-figures\" target=\"_blank\">nearly half of global energy consumption</a>. To bring down the greenhouse gas emissions from temperature management, researchers have recently sped up the hunt for high-performance technologies that can adjust temperatures without consuming much energy, if any. </p><p>One way to do this is to tap into the sun and outer space, respectively, as hot and cold sources. Smart windows, for instance, can be triggered by heat or electricity to switch between absorbing the sun’s infrared heat on cold days or reflecting it in the summer. For a zero-energy option, some teams have made <a href=\"https://spectrum.ieee.org/efficient-airconditioning-by-beaming-heat-into-space\" target=\"_self\">passive radiative cooling</a> systems that beam heat directly into outer space at infrared wavelengths that pass straight through Earth’s atmosphere. </p><p>Rujun Ma and colleagues at <a href=\"https://en.wikipedia.org/wiki/Nankai_University\" target=\"_blank\">Nankai University</a>, in Tianjin, China, wanted to make a dual-mode device that switches between heating and cooling modes by perceiving temperature change. “The ultimate goal of thermal management is temperature control,” Ma says, so having a temperature-responsive system makes most sense. And while color-changing windows and infrared modulators that respond to temperature changes have been produced, they can do either heating or cooling, but not both.</p><p>What makes the new device unique is its ability to work across wavelengths ranging from the visible band to the infrared band, “covering the entire region that contributes to radiative thermal management, including solar heating and radiative cooling,” Ma says. </p><p>The team looked for inspiration to the Himalayan rabbit’s fur—which is white when the weather is warm but darkens when it is cold—and the opening and folding of the leaves of the <a href=\"https://www.gardenlively.com/touch-me-not-plant/\" target=\"_blank\">touch-me-not (<em>Mimosa pudica</em>) plant</a>.</p><p>The device consists of two main layers. The top layer is a temperature-sensitive actuator sheet that emits infrared radiation. This sheet is made of specially designed polymers that respond unevenly to temperature changes, making it roll up when cold and unfurl when it is hot. The bottom layer is a thermochromic substrate that changes color in response to temperature and also absorbs visible light. </p><p>In heating mode, when the ambient temperature is low, the actuator sheet curls up and the thermochromic substrate turns gray, absorbs sunlight, and warms up. Conversely, in cooling mode, the actuator lays flat and covers the substrate, reflecting sunlight and emitting infrared radiation to siphon away any heat in the substrate. The trigger temperature for switching between modes can be adjusted by tweaking the polymers in the actuator and the thermochromic powders that go in the substrate.</p><p>In the lab, the 4-by-4-centimeter device lasted through 500 rolling and unfolding cycles. Ma and his colleagues also tested the device outdoors, as they detail in their paper published in <em><a href=\"https://www.pnas.org/doi/abs/10.1073/pnas.2207353119\" rel=\"noopener noreferrer\" target=\"_blank\">Proceedings of the National Academy of Sciences</a></em>. Based on the field experiments, they calculated that the device had a solar heating power of around 252.2 watts per square meter and a cooling power of around 59.7 W/m<sup>2</sup>. </p><p>The researchers translated these numbers to energy savings based on heating in January temperatures and cooling in July. Calculations showed that this device saved the most energy per area for temperature control, compared with other temperature-responsive thermal-management devices reported so far.</p><p>“It will significantly improve thermal energy utilization efficiency,” says Ma, “although there is still a lot of room for improvement in solar heating power and radiative cooling power.”</p>",
  "pubDate": "Thu, 22 Sep 2022 17:51:00 +0000",
  "guid": "https://spectrum.ieee.org/passive-radiative-cooling-device",
  "category": [
    "Radiative cooling",
    "Solar thermal",
    "Infrared",
    "Passive cooling",
    "Heat management"
  ],
  "dc:creator": "Prachi Patel",
  "media:content": ""
}