{
  "guid": "urn:uuid:9bc12090-eb5e-4887-bb5d-c099e6ec2942",
  "link": "https://www.who.int/news/item/16-03-2022-who-announces-film-festival-shortlist-and-jury",
  "a10:author": {
    "a10:name": ""
  },
  "title": "WHO announces Film Festival shortlist and jury, including Sharon Stone, Emilia Clarke, Mia Maestro, Anita Abada, Eddie Ndopu and Dr Eckart von Hirschhausen",
  "description": "<p>More than 1000 film makers from over 110 countries have submitted short films for the 3rd edition of the WHO Health for All Film Festival (HAFF), on themes ranging from the trauma of war to living with COVID-19. Some 70 films have been chosen for the shortlist, which will be reviewed by international actors and development leaders, before the announcement of the winners in mid-May 2022.&nbsp;</p><p>This large participation from patients, health workers, health activists, NGOs, students, public institutions, as well as from professional film makers, demonstrates the potential of the Festival to contribute to health promotion and education. Including the submissions received in 2022, almost 3500 films have been registered by the festival since its launch in 2020, many specifically made for the initiative.<br /></p><p><em>&ldquo;The success of the WHO Health for All Film Festival mirrors the great interest and heightened awareness globally in the importance of health and ensuring people are able to attain the highest levels of physical and mental well-being,&rdquo; </em>said WHO Director-General Dr Tedros Adhanom Ghebreyesus.&nbsp;<em>&ldquo;The wide range of subjects featured in this year&rsquo;s submissions, and the high calibre of judges, underscores the growing importance of the festival as a platform to bring urgent health issues to the public&rsquo;s attention.&rdquo;</em><em></em><br /></p><p>The following distinguished professionals, artists and activists, joined by three WHO senior experts, comprise this year&rsquo;s festival jury: <strong>Sharon Stone</strong> (actor from the USA);&nbsp;<strong>Emilia Clarke </strong>(actor from the UK); <strong>Mia Maestro</strong> (actor from Argentina); <strong>Anita Abada</strong> (producer from Nigeria); <strong>Eddie Ndopu</strong> (UN SDGs Advocate from South Africa), and <strong>Dr Eckart von Hirschhausen</strong> (TV presenter from Germany).<br /></p><p>The 70 shortlisted films are available to view online in six playlists, one for each of the three main competition categories: Universal Health Coverage, Health emergencies, and Better health and well-being, as well as three more on Rehabilitation, Health innovation and Very Short Films.<br /></p><p>An additional playlist - out of competition - will be published by the end of March to contribute to the 2022 World Health Day theme of &ldquo;Our Planet, Our Health&rdquo;. This playlist will gather submissions from all three HAFF editions, as well as other productions from WHO and other United Nations agencies.</p><p>A wide range of health topics are covered by the new 2022 selection: trauma of wars; noncommunicable diseases, including mental health issues; disability; malaria; communicable diseases, including COVID-19, HIV-AIDS; as well as environmental and social factors of health, including gender-based violence, road safety and pollution. The benefits of sports and arts on health are also part of this selection.<br /></p><p>The public is encouraged to choose one of the films that they would like to champion and comment about its story / topic, before 10<sup>th</sup> of May 2022. &nbsp;Comments can be posted in their social media using #Film4health or through the YouTube playlists available from the Festival&rsquo;s website (link below) as well as WHO&rsquo;s YouTube channel. Some comments from the public will be featured during the HAFF virtual Awards Ceremony in mid-May.</p><p>In the coming weeks, jurors will review the shortlisted films and recommend winners to the WHO Director-General, who will make the final decision. Three <em>&ldquo;GRAND PRIX&rdquo; </em>and four special prizes will be announced mid-May during an online Awards Ceremony followed by a series of online discussions with winners and jurors.<br /></p><p>For more details on the official selection, the jury composition and further information, please visit&nbsp;<a href=\"https://www.who.int/initiatives/the-health-for-all-film-festival\">https://www.who.int/film-festival</a></p><p>&nbsp;</p><p>&nbsp;</p>",
  "pubDate": "Thu, 10 Mar 2022 19:01:08 Z"
}