{
  "title": "Studying floods to better predict their dangers",
  "link": "https://news.mit.edu/2022/understanding-floods-katerina-boukin-1013",
  "description": "A fourth-generation civil engineer, graduate student Katerina Boukin researches the growing yet misunderstood threat of pluvial flooding, including flash floods.",
  "pubDate": "Thu, 13 Oct 2022 15:15:00 -0400",
  "guid": "https://news.mit.edu/2022/understanding-floods-katerina-boukin-1013",
  "dc:creator": "Andrew Paul Laurent | MIT Concrete Sustainability Hub",
  "content:encoded": "<p>“My job is basically flooding Cambridge,” says <a href=\"https://cee.mit.edu/people_individual/katerina-boukin/\" target=\"_blank\">Katerina “Katya” Boukin</a>, a graduate student in civil and environmental engineering at MIT and the <a href=\"https://cshub.mit.edu/\">MIT Concrete Sustainability Hub’s</a> resident expert on flood simulations.&nbsp;</p>\n\n<p>You can often find her fine-tuning high-resolution flood risk models for the City of Cambridge, Massachusetts, or talking about hurricanes with fellow researcher <a href=\"https://cshub.mit.edu/ipek-bensu-manav-0\">Ipek Bensu Manav</a>.</p>\n\n<p>Flooding represents <a href=\"https://www.un.org/en/development/desa/population/publications/pdf/technical/TP2019-4.pdf\">one of the world’s gravest natural hazards</a>. Extreme climate events inducing flooding, like severe storms, winter storms, and tropical cyclones, caused an <a href=\"https://www.ncdc.noaa.gov/billions\">estimated $128.1 billion of damages in 2021 alone</a>.&nbsp;</p>\n\n<p>Climate simulation models suggest that severe storms will become more frequent in the coming years, necessitating a better understanding of which parts of cities are most vulnerable — an understanding that can be improved through modeling.</p>\n\n<p>A problem with current flood models&nbsp;is that they struggle to account for an oft-misunderstood type of flooding known as pluvial flooding.&nbsp;</p>\n\n<p>“You might think of flooding as the overflowing of a body of water, like a river. This is fluvial flooding. This can be somewhat predictable, as you can think of proximity to water as a risk factor,” Boukin explains.</p>\n\n<p>However, the “flash flooding” that <a href=\"https://www.weather.gov/jetstream/flood\">causes many deaths each year</a> can happen even in places nowhere near a body of water. This is an example of pluvial flooding, which is affected by terrain, urban infrastructure, and the dynamic nature of storm loads.</p>\n\n<p>“If we don’t know how a flood is propagating, we don’t know the risk it poses to the urban environment. And if we don’t understand the risk, we can’t really discuss mitigation strategies,” says Boukin, “That’s why I pursue improving flood propagation models.”</p>\n\n<p>Boukin is leading development of a new flood prediction method that seeks to address these shortcomings. By better representing the complex morphology of cities, Boukin’s approach may provide a clearer forecast of future urban flooding.</p>\n<p>“In contrast to the more typical traditional catchment model, our method has rainwater spread around the urban environment based on the city’s topography, below-the-surface features like sewer pipes, and the characteristics of local soils,” notes Boukin.</p>\n\n<p>“We can simulate the flooding of regions with local rain forecasts. Our results can show how flooding propagates by the foot and by the second,” she adds.</p>\n\n<p>While Boukin’s current focus is flood simulation, her unconventional academic career has taken her research in many directions, like examining structural bottlenecks in dense urban rail systems and forecasting ground displacement due to tunneling.&nbsp;</p>\n\n<p>“I’ve always been interested in the messy side of problem-solving. I think that difficult problems present a real chance to gain a deeper understanding,” says Boukin.</p>\n\n<p>Boukin credits her upbringing for giving her this perspective. A native of Israel, Boukin says that civil engineering is the family business. “My parents are civil engineers, my mom’s parents are, too, her grandfather was a professor in civil engineering, and so on. Civil engineering is my bloodline.”</p>\n\n<p>However, the decision to follow the family tradition did not come so easily. “After I took the Israeli equivalent of the SAT, I was at a decision point: Should I go to engineering school or medical school?” she recalls.</p>\n\n<p>“I decided to go on a backpacking trip to help make up my mind. It’s sort of an Israeli rite to explore internationally, so I spent six months in South America. I think backpacking is something everyone should do.”</p>\n\n<p>After this soul searching, Boukin landed on engineering school, where she fell in love with structural engineering. “It was the option that felt most familiar and interesting. I grew up playing with AutoCAD on the family computer, and now I use AutoCAD professionally!” she notes.</p>\n\n<p>“For my master’s degree, I was looking to study in a department that would help me integrate knowledge from fields like climatology and civil engineering. I found the <a href=\"https://cee.mit.edu/\"><u>MIT Department of Civil and Environmental Engineering</u></a> to be an excellent fit,” she says.</p>\n\n<p>“I am lucky that MIT has so many people that work together as well as they do. I ended up at the Concrete Sustainability Hub, where I’m working on projects which are the perfect fit between what I wanted to do and what the department wanted to do.”&nbsp;</p>\n\n<p>Boukin’s move to Cambridge has given her a new perspective on her family and childhood.&nbsp;</p>\n\n<p>“My parents brought me to Israel when I was just 1 year old. In moving here as a second-time immigrant, I have a new perspective on what my parents went through during the move to Israel. I moved when I was 27 years old, the same age as they were. They didn’t have a support network and worked any job they could find,” she explains.</p>\n\n<p>“I am incredibly grateful to them for the morals they instilled in my sister, who recently graduated medical school, and I. I know I can call my parents if I ever need something, and they will do whatever they can to help.”</p>\n\n<p>Boukin hopes to honor her parents’ efforts through her research.</p>\n\n<p>“Not only do I want to help stakeholders understand flood risks, I want to make awareness of flooding more accessible. Each community needs different things to be resilient, and different cultures have different ways of delivering and receiving information,” she says.</p>\n\n<p>“Everyone should understand that they, in addition to the buildings and infrastructure around them, are part of a complex ecosystem. Any change to a city can affect the rest of it. If designers and residents are aware of this when considering flood mitigation strategies, we can better design cities and understand the consequences of damage.”</p>",
  "media:content": {
    "media:description": "“If we don’t know how a flood is propagating, we don’t know the risk it poses to the urban environment. And if we don’t understand the risk, we can’t really discuss mitigation strategies,” says CSHub researcher Katya Boukin. “That’s why I pursue improving flood propagation models.”",
    "media:credit": "Photo: Andrew Paul Laurent"
  },
  "category": [
    "Civil and environmental engineering",
    "Concrete Sustainability Hub",
    "Computer modeling",
    "Climate",
    "Climate change",
    "Research",
    "Cambridge, Boston and region",
    "Alumni/ae",
    "Profile",
    "Water",
    "School of Engineering"
  ]
}