{
  "title": "#482: Never-Before-Seen Harry Potter Scenes We Want in a TV Series",
  "link": "https://audioboom.com/posts/7682315",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4784,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Muggle Mail answers some of our questions regarding Neville's sorting, and asks why Harry isn't more grateful to Lupin.</li>\n<li>This week the hosts ask, What are key, never-before-seen moments from the Harry Potter books that we want to see adapted in the TV series? This is our chance to FINALLY see some critical scenes that never made it into the books or films!</li>\n<li>Andrew kicks things off with light and grim moments: The creation of the Marauders Map, and the entire night of James and Lily's deaths.</li>\n<li>Will we finally get to see Azkaban in person, and answer how grown wizards interact with Dementors?</li>\n<li>What about Moody being overtaken by Pettigrew and Crouch, and other Death Eater things?</li>\n<li>Fresh off our Order of the Phoenix re-read, Laura asks that we see where Dumbledore ran off to.</li>\n<li>Will the show track Snape becoming the HBP? What about Dumbledore searching for Horcruxes?</li>\n<li>What scenes might we see in a future Fantastic Beasts film?</li>\n<li>What pizza toppings exist in the Wizarding World? Hippogriff? Niffler? Bowtruckle?</li>\n<li>Micah recounts the Top 7 scenes that were never adapted for the film: Winky, Nearly Headless Nick, and more!</li>\n<li>For Quizzitch: In GOF, what does \"Mad-Eye\" say ambushed him?</li>\n<li>Andrew has a show-stopping revelation about how to make the TV series happen.</li>\n<li>You can join our community at <a href=\"http://www.patreon.com/mugglecast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!!</li>\n<li>This week's episode is brought to you by Quip (Visit <a href=\"http://GetQuip.com/Muggle\">GetQuip.com/Muggle</a> and get your first refill free) and BetterHelp (Get 10% off your first month by visiting <a href=\"http://BetterHelp.com/mugglecast\">BetterHelp.com/mugglecast</a>)</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 15 Sep 2020 11:00:00 +0000",
  "guid": "tag:audioboom.com,2020-09-14:/posts/7682315",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}