{
  "guid": "prx_137_98124171-bc1d-4ff9-90ad-45998c779c12",
  "title": "763 - Veserium Adventure",
  "pubDate": "Sun, 14 Apr 2019 23:00:00 -0000",
  "link": "https://beta.prx.org/stories/272082",
  "description": "<p>Two heroes, Ray and Michael, sculpt sounds and save the world from singularity while you sleep.<br>\n<br>\nWho is Veserium? From their Patreon page- “We believe that when great minds work together, <strong>we can forge the future.  </strong>We are an electronic music duo, and we want to forge the future of music. We want it to be a future in which music performances are engaging and authentic expressions of emotion—not just DJs pressing play on stage. We’ve been working on this mission for a while now, and it’s led us to create technology that enables us to create music like no one has ever done before. The core of the technology is a pair of gloves that allows us to control music in thin air with motions and gestures. With this tech, we’re able to literally shape sound—molding and sculpting it as we please.<br>\n<br>\nWe’re using these gloves to craft a distinctive musical style, and to put on live performances that have never been seen in EDM. Our fans are able to engage with our music on an entirely new level, being able to both see and hear the music created in front of their eyes.” <a href=\"https://www.veserium.com/\" rel=\"nofollow\" target=\"_blank\">https://www.veserium.com/</a></p>\n\n<p>(You can find all of our sponsors or become a patron on our new website <a href=\"http://www.sleepwithmepodcast.com%C2%A0story\" rel=\"nofollow\" target=\"_blank\">http://www.sleepwithmepodcast.com story</a> starts at about 18:00)</p>\n\n<p>Tonight’s episode is sponsored by Casper. Get $100 toward select mattresses by visiting <a href=\"http://www.casper.com/sleepwith\" rel=\"nofollow\" target=\"_blank\">http://www.casper.com/sleepwith</a> and using “sleepwith” at checkout. Terms and Conditions apply. You can be sure of your purchase with Casper’s 100 night risk-free, sleep-on-it trial.<br>\n<br>\nWelcome our newest sponsor Robinhood - an investing app that lets you buy and sell stocks, E-T-F’s (exchange-traded funds), options, and cryptos- all commission-free. They strive to make financial services work for everyone, not just the wealthy.<br>\nRobinhood is giving listeners a FREE stock like Apple, Ford or Sprint to help build your portfolio. Sign up at <a href=\"http://sleep.robinhood.com\" rel=\"nofollow\" target=\"_blank\">sleep.robinhood.com</a>!</p>",
  "enclosure": "",
  "itunes:title": "Veserium Adventure",
  "itunes:subtitle": "Two heroes, Ray and Michael, sculpt sounds and save the world from singularity while you sleep.",
  "itunes:explicit": false,
  "itunes:episodeType": "full",
  "itunes:episode": 763,
  "itunes:duration": "01:07:43"
}