{
  "id": "https://bibleinoneyear.org/en/youth/287",
  "title": "Day 287: How to Avoid Backsliding",
  "description": "Psalm 119:33–37, Jeremiah 30:14-22, 31:12-13, 2 Thessalonians 2:1–17.  In today’s New Testament passage, Paul invokes the image of the *phalanx* Shoulder to shoulder, the church can stand firm  This is one of many occasions that Paul exhorts the church to ‘stand firm’ (2 Thessalonians 2:15)",
  "pubDate": "Thu, 14 Oct 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/287/?ignore",
  "itunes:duration": "15:17",
  "guid": "enyouth14102021-287",
  "length": 917.05,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 287: How to Avoid Backsliding",
  "itunes:subtitle": "Psalm 119:33–37, Jeremiah 30:14-22, 31:12-13, 2 Thessalonians 2:1–17.  In today’s New Testament passage, Paul invokes the image of the *phalanx* Shoulder to shoulder, the church can stand firm  This is one of many occasions that Paul exhorts the church to ‘stand firm’ (2 Thessalonians 2:15)",
  "itunes:summary": "As a young man, Philip was kidnapped and held hostage in Greece. There he remained for several years. During this time he received a military education. Then he returned to his homeland, which had conceded many defeats and had lost much land. Within five years he had become king.\nPhilip II of Macedon desperately needed his army to stand firm. He is remembered for two major innovations. First is the sarissa, a very long spear. Second is the re-development of a rectangular military formation used by ancient armies (known as a phalanx). A core of highly-trained infantrymen, armed with Philip’s longer spears, stood shoulder to shoulder in files normally eight men deep.\nAs long as they stood firm and did not break rank they were virtually invincible and struck fear into the hearts of their enemies. Using this tactic, Philip united the city-states of Greece and conquered the city of Philippi (that is named after him) in 356 BC (see Philippians 1:27).\nSometimes, it seems that the Christian life is like facing a powerful enemy. It feels like an intense struggle in which another army is attempting to push us back and break down our ranks. If we don’t stand firm, we fall on our backs and slide in the mud in the wrong direction. We have seen how Jeremiah warned the people many times against backsliding (Jeremiah 2:19; 3:22; 5:6; 14:7; 15:6).\nIt is not a matter of us standing firm on our own. We are part of a community. In today’s New Testament passage, Paul invokes the image of the phalanx Shoulder to shoulder, the church can stand firm. This is one of many occasions that Paul exhorts the church to ‘stand firm’ (2 Thessalonians 2:15).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 287
}