{
  "title": "Episode 139: &#8220;Eight Miles High&#8221; by the Byrds",
  "link": "https://500songs.com/podcast/episode-139-eight-miles-high-by-the-byrds/",
  "pubDate": "Wed, 22 Dec 2021 18:33:29 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=986",
  "description": "Episode one hundred and thirty-nine of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Eight Miles High” by the Byrds, and the influence of jazz and Indian music on psychedelic rock. This is a long one... Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/60221026\">on \"Winchester Cathedral\" by the New Vaudeville Band</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nNo Mixcloud this time, as there were multiple artists with too many songs.\n\nInformation on John Coltrane came from <em>Coltrane</em> by Ben Ratliffe, while information on Ravi Shankar came from <a href=\"https://amzn.to/3JdVYyG\"><em>Indian Sun: The Life and Music of Ravi Shankar</em> by Oliver Craske</a>.\n\nFor information on the Byrds, I relied mostly on <a href=\"https://amzn.to/3rsesTF\">Timeless Flight Revisited by Johnny Rogan,</a> with some information from <a href=\"https://amzn.to/36RTDrp\">Chris Hillman’s autobiography</a>.\n\n<a href=\"http://www.scottlernermusic.com/ftp/coltrane%2520dissertation.pdf\">This dissertation looks at the influence of Slonimsky on Coltrane</a>.\n\nAll Coltrane's music is worth getting, but <a href=\"https://amzn.to/3qm4kvC\">this 5-CD set</a> containing <em>Impressions</em> is the most relevant cheap selection of his material for these purposes.\n\n<a href=\"https://amzn.to/3piGYHV\">This collection</a> has the Shankar material released in the West up to 1962.\n\nAnd<a href=\"https://amzn.to/3rpSZLj\"> this three-CD set</a> is a reasonable way of getting most of the Byrds’ important recordings.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nThis episode is the second part of a loose trilogy of episodes set in LA in 1966. We're going to be spending a *lot* of time around LA and Hollywood for the next few months -- seven of the next thirteen episodes are based there, and there'll be more after that.\n\nBut it's going to take a while to get there. This is going to be an absurdly long episode, because in order to get to LA in 1966 again, we're going to have to start off in the 1940s in New York, and take a brief detour to India. Because in order to explain this:\n\n[Excerpt: The Byrds, \"Eight Miles High\"]\n\nWe're first going to have to explain this:\n\n[Excerpt: John Coltrane, \"India (#3)\"]\n\nBefore we begin this, I just want to say something. This episode runs long, and covers a *lot* of musical ground, and as part of that it covers several of the most important musicians of the twentieth century -- but musicians in the fields of jazz, which is a music I know something about, but am not an expert in, and Hindustani classical music, which is very much not even close to my area of expertise. It also contains a chunk of music theory, which again, I know a little about -- but only really enough to know how much I don't know.\n\nI am going to try to get the information about these musicians right, but I want to emphasise that at times I will be straying *vastly* out of my lane, in ways that may well seem like they're minimising these musicians. I am trying to give just enough information about them to tell the story, and I would urge anyone who becomes interested in the music I talk about in the early parts of this episode to go out and find more expert sources to fill in the gap. And conversely, if you know more about these musics than I do, please forgive any inaccuracies. I am going to do my best to get all of this right, because accuracy is important, but I suspect that every single sentence in the first hour or so of this episode could be footnoted with something pointing out all the places where what I've said is only somewhat true. Also, I apologise if I mispronounce any names or words in this episode, though I've tried my best to get it right -- I've been unable to find recordings of some words and names being spoken, while with others I've heard multiple versions.\n\nTo tell today's story, we're going to have to go right back to some things we looked at in the first episode, on \"Flying Home\". For those of you who don't remember -- which is fair enough, since that episode was more than three years ago -- in that episode we looked at a jazz record by the Benny Goodman Sextet, which was one of the earliest popular recordings to feature electric guitar:\n\n[Excerpt: The Benny Goodman Sextet, \"Flying Home\"]\n\nNow, we talked about quite a lot of things in that episode which have played out in later episodes, but one thing we only mentioned in passing, there or later, was a style of music called bebop. We did talk about how Charlie Christian, the guitarist on that record, was one of the innovators of that style, but we didn't really go into what it was properly.\n\nIndeed, I deliberately did not mention in that episode something that I was saving until now, because we actually heard *two* hugely influential bebop musicians in that episode,  and I was leaving the other one to talk about here.\n\nIn that episode we saw how Lionel Hampton, the Benny Goodman band's vibraphone player, went on to form his own band, and how that band became one of the foundational influences for the genres that became known as jump blues and R&B. And we especially noted the saxophone solo on Hampton's remake of \"Flying Home\", played by Illinois Jacquet:\n\n[Excerpt: Lionel Hampton, \"Flying Home\"]\n\nWe mentioned in that episode how Illinois Jacquet's saxophone solo there set the template for all tenor sax playing in R&B and rock and roll music for decades to come -- his honking style became quite simply how you play rock and roll or R&B saxophone, and without that solo you don't have any of the records by Fats Domino, Little Richard, the Coasters, or a dozen other acts that we discussed.\n\nBut what we didn't look at in that episode is that that is a big band record, so of course there is more than just one saxophone player on it. And one of the other saxophone players on that recording is Dexter Gordon, a musician who was originally from LA. Those of you with long memories will remember that back in the first year or so of the podcast we talked a lot about the music programme at Jefferson High School in LA, and about Samuel Browne, the music teacher whose music programme gave the world the Coasters, the Penguins, the Platters, Etta James, Art Farmer, Richard Berry, Big Jay McNeely, Barry White, and more other important musicians than I can possibly name here. Gordon was yet another of Browne's students -- one who Browne regularly gave detention to, just to make him practice his scales.\n\nGordon didn't get much chance to shine in the Lionel Hampton band, because he was only second tenor, with Jacquet taking many of the solos. But he was learning from playing in a band with Jacquet, and while Gordon didn't ever develop a honk like Jacquet's, he did adopt some of Jacquet's full tone in his own sound. There aren't many recordings of Gordon playing solos in his early years, because they coincided with the American Federation of Musicians' recording strike that we talked about in those early episodes, but he did record a few sessions in 1943 for a label small enough not to be covered by the ban, and you can hear something of Jacquet's tone in those recordings, along with the influence of Lester Young, who influenced all tenor sax players at this time:\n\n[Excerpt: Nat \"King\" Cole with Dexter Gordon, \"I've Found a New Baby\"]\n\nThe piano player on that session, incidentally, is Nat \"King\" Cole, when he was still one of the most respected jazz pianists on the scene, before he switched primarily to vocals.\n\nAnd Gordon took this Jacquet-influenced tone, and used it to become the second great saxophone hero of bebop music, after Charlie Parker -- and the first great tenor sax hero of the music.\n\nI've mentioned bebop before on several occasions, but never really got into it in detail. It was a style that developed in New York in the mid to late forties, and a lot of the earliest examples of it went unrecorded thanks to that musicians' strike, but the style emphasised small groups improvising together, and expanding their sense of melody and harmony. The music prized virtuosity and musical intelligence over everything else, and was fast and jittery-sounding. The musicians would go on long, extended, improvisations, incorporating ideas both from the blues and from the modern classical music of people like Bartok and Stravinsky, which challenged conventional tonality.\n\nIn particular, one aspect which became prominent in bebop music was a type of scale known as the bebop scale. In most of the music we've looked at in this podcast to this point, the scales used have been seven-note scales -- do-re-mi-fa-so-la-ti- which make an octave with a second, higher, do tone. So in the scale of C major we have C, D, E, F, G, A, B, and then another C:\n\n[demonstrates]\n\nBebop scales, on the other hand, would generally have an extra note in, making an eight-note scale, by adding in what is called a chromatic passing note. For example, a typical bebop C major scale might add in the note G#, so the scale would go C,D,E,F,G,G#, A, B, C:\n\n[demonstrates]\n\nYou'd play this extra note for the most part, when moving between the two notes it's between, so in that scale you'd mostly use it when moving from G to A, or from A to G. Now I'm far from a bebop player, so this won't sound like bebop, but I can demonstrate the kind of thing if I first noodle a little scalar melody in the key of C major:\n\n[demonstrates]\n\nAnd then play the same thing, but adding in a G# every time I go between the G and the A in either direction:\n\n[demonstrates]\n\nThat is not bebop music, but I hope you can see what a difference that chromatic passing tone makes to the melody. But again, that's not bebop, because I'm not a bebop player. Dexter Gordon, though, *was* a bebop player.\n\nHe moved to New York while playing with Louis Armstrong's band, and soon became part of the bebop scene, which at the time centred around Charlie Christian, the trumpet player Dizzy Gillespie, and the alto sax player Charlie Parker, sometimes nicknamed \"bird\" or \"Yardbird\", who is often regarded as the greatest of them all. Gillespie, Parker, and Gordon also played in Billy Eckstine's big band, which gave many of the leading bebop musicians the opportunity to play in what was still the most popular idiom at the time -- you can hear Gordon have a saxophone battle with Gene Ammons on \"Blowing the Blues Away\" in a lineup of the band that also included Art Blakey on drums and Dizzy Gillespie on trumpet:\n\n[Excerpt: Billy Eckstine, \"Blowing the Blues Away\"]\n\nBut Gordon was soon leading his own small band sessions, and making records for labels like Savoy, on which you can definitely hear the influence of Illinois Jacquet on his tone, even as he's playing music that's more melodically experimental by far than the jump band music of the Hampton band:\n\n[Excerpt: Dexter Gordon, \"Dexter Digs In\"]\n\nBasically, in the late 1940s, if you were wanting to play bebop on the saxophone, you had two models to follow -- Charlie Parker, the great alto saxophonist with his angular, atonal, melodic sense and fast, virtuosic, playing, or Dexter Gordon, the tenor saxophonist, whose style had more R&B grease and wit to it, who would quote popular melodies in his own improvisations.\n\nAnd John Coltrane followed both. Coltrane's first instrument was the alto sax, and when he was primarily an alto player he would copy Charlie Parker's style. When he switched to being primarily a tenor player -- though he would always continue playing both instruments, and later in his career would also play soprano sax -- he took up much of Gordon's mellower tone, though he was also influenced by other tenor players, like Lester Young, the great player with Count Basie's band, and Johnny Hodges, who played with Duke Ellington.\n\nNow, it is important to note here that John Coltrane is a very, very, big deal. Depending on your opinion of Ornette Coleman's playing, Coltrane is by most accounts either the last or penultimate truly great innovator in jazz saxophone, and arguably the single foremost figure in the music in the last half of the twentieth century. In this podcast I'm only able to tell you enough about him to give you the information you need to understand the material about the Byrds, but were I to do a similar history of jazz in five hundred songs, Coltrane would have a similar position to someone like the Beatles -- he's such a major figure that he is literally venerated as a saint by the African Orthodox Church, and a couple of other Episcopal churches have at least made the case for his sainthood. So anything I say here about him is not even beginning to scratch the surface of his towering importance to jazz music, but it will, I hope, give some idea of his importance to the development of the Byrds -- a group of whom he was almost certainly totally unaware.\n\nColtrane started out playing as a teenager, and his earliest recordings were when he was nineteen and in the armed forces, just after the end of World War II. At that time, he was very much a beginner, although a talented one, and on his early amateur recordings you can hear him trying to imitate Parker without really knowing what it was that Parker was doing that made him so great. But as well as having some natural talent, he had one big attribute that made him stand out -- his utter devotion to his music. He was so uninterested in anything other than mastering his instrument that one day a friend was telling him about a baseball game he'd watched, and all Coltrane could do was ask in confusion \"Who's Willie Mays?\"\n\nColtrane would regularly practice his saxophone until his reed was red with blood, but he would also study other musicians. And not just in jazz. He knew that Charlie Parker had intensely studied Stravinsky's Firebird Suite, and so Coltrane would study that too:\n\n[Excerpt: Stravinsky, \"Firebird Suite\"]\n\nColtrane joined the band of Eddie \"Cleanhead\" Vinson, who was one of those figures like Johnny Otis, with whom Vinson would later perform for many years, who straddled the worlds of jazz and R&B. Vinson was a blues shouter in the style of Big Joe Turner, but he was also a bebop sax player, and what he wanted was a tenor sax player who could play tenor the way Charlie Parker played alto, but do it in an R&B setting. Coltrane switched from alto to tenor, and spent a year or so playing with Vinson's band.\n\nNo recordings exist of Coltrane with Vinson that I'm aware of, but you can get an idea of what he sounded like from his next band. By this point, Dizzy Gillespie had graduated from small bebop groups to leading a big band, and he got Coltrane in as one of his alto players, though Coltrane would often also play tenor with Gillespie, as on this recording from 1951, which has Coltrane on tenor, Gillespie on trumpet, with Kenny Burrell and two of the future Modern Jazz Quartet, Milt Jackson and Percy Heath, showing that the roots of modern jazz were not very far at all from the roots of rock and roll:\n\n[Excerpt: Dizzy Gillespie, \"We Love to Boogie\"]\n\nAfter leaving Gillespie's band, Coltrane played with a lot of important musicians over the next four or five years, like Johnny Hodges, Earl Bostic, and Jimmy Smith, and occasionally sat in with Miles Davis, but at this point he was still not a major musician in the genre. He was a competent, working, sideman, but he was also struggling with alcohol and heroin, and hadn't really found his own voice. But then Miles Davis asked Coltrane to join his band full-time. Coltrane was actually Davis' second choice -- he really wanted Sonny Rollins, who was widely considered the best new tenor player around, but he was eventually persuaded to take Coltrane.\n\nDuring his first period with Davis, Coltrane grew rapidly as a musician, and also played on a *lot* of other people's sessions. In a three year period Coltrane went from Davis to Thelonius Monk's group then back to Davis' group, and also recorded as both a sideman and a band leader on a ton of sessions. You can get a box set of his recordings from May 1956 through December 1958 that comes to nineteen CDs -- and that's not counting the recordings with Miles Davis, which aren't included on that set.\n\nUnsurprisingly, just through playing this much, Coltrane had grown enormously as a player, and he was particularly fascinated by harmonics, playing with the notes of a chord, in arpeggios, and pushing music to its harmonic limits, as you can hear in his solo on Davis' \"Straight, No Chaser\", which pushes the limits of the jazz solo as far as they'd gone to that point:\n\n[Excerpt: Miles Davis, \"Straight, No Chaser\"]\n\nBut on the same album as that, \"Milestones\", we also have the first appearance of a new style, modal jazz. Now, to explain this, we have to go back to the scales again. We looked at the normal Western scale, do-re-mi-fa-so-la-ti-do, but you can start a scale on any of those notes, and which note you start on creates what is called a different mode. The modes are given Greek names, and each mode has a different feel to it. If you start on do, we call this the major scale or the Ionian mode. This is the normal scale we heard before -- C,D,E,F,G,A,B,C:\n\n[demonstrates]\n\nMost music – about seventy percent of the melodies you're likely to have heard, uses that mode. If you start on re, it would go re-mi-fa-so-la-ti-do-re, or D,E,F,G,A,B,C,D, the Dorian mode:\n\n[demonstrates]\n\nMelodies with this mode tend to have a sort of wistful feel, like \"Scarborough Fair\":\n\n[Excerpt: Simon and Garfunkel, \"Scarborough Fair\"]\n\nor many of George Harrison's songs:\n\n[Excerpt: The Beatles, \"I Me Mine\"]\n\nStarting on mi, you have the Phrygian mode, mi-fa-so-la-ti-do-re-mi:\n\n[demonstrates]\n\nThe Phrygian mode is not especially widely used, but does turn up in some popular works like Barber's Adagio for Strings:\n\n[Excerpt: Barber, \"Adagio for Strings\"]\n\nThen there's the Lydian mode, fa-so-la-ti-do-re-mi-fa:\n\n[demonstrates]\n\nThis mode isn't used much at all in pop music -- the most prominent example I can think of is \"Pretty Ballerina\" by the Left Banke:\n\n[Excerpt: The Left Banke, \"Pretty Ballerina\"]\n\nStarting on so, we have so-la-ti-do-re-mi-fa-so -- the Mixolydian mode:\n\n[demonstrates]\n\nThat mode has a sort of bluesy or folky tone to it, and you also find it in a lot of traditional tunes, like \"She Moves Through the Fair\":\n\n[Excerpt: Davey Graham, \"She Moved Thru' The Bizarre/Blue Raga\"]\n\nAnd in things like \"Norwegian Wood\" by the Beatles:\n\n[Excerpt: The Beatles, \"Norwegian Wood\"]\n\nThough that goes into Dorian for the middle section.\n\nStarting on la, we have the Aeolian mode, which is also known as the natural minor scale, and is often just talked about as “the minor scale”:\n\n[demonstrates]\n\nThat's obviously used in innumerable songs, for example \"Losing My Religion\" by REM:\n\n[Excerpt: REM, \"Losing My Religion\"]\n\nAnd finally you have the Locrian mode ti-do-re-mi-fa-so-la-ti:\n\n[demonstrates]\n\nThat basically doesn't get used, unless someone wants to show off that they know the Locrian mode. The only vaguely familiar example I can think of is \"Army of Me\" by Bjork:\n\n[Excerpt: Bjork, \"Army of Me\"]\n\nI hope that brief excursion through the seven most common modes in Western diatonic music gives you some idea of the difference that musical modes can make to a piece.\n\nAnyway, as I was saying, on the \"Milestones\" album, we get some of the first examples of a form that became known as modal jazz. Now, the ideas of modal jazz had been around for a few years at that point -- oddly, it seems to be one of the first types of popular music to have existed in theory before existing in practice. George Russell, an acquaintance of Davis who was a self-taught music theorist, had written a book in 1953 titled The Lydian Chromatic Concept of Tonal Organization. That book argues that rather than looking at the diatonic scale as the basis for music, one should instead look at a chord progression called the circle of fifths. The circle of fifths is exactly what it sounds like -- you change chords to one a fifth away from it, and then do that again and again, either going up, so you'd have chords with the roots C-G-D-A-E-B-F# and so on:\n\n[demonstrates]\n\nOr, more commonly, going down, though usually when going downwards you tend to cheat a bit and sharpen one of the notes so you can stay in one key, so you'd get chords with roots C-F-B-E-A-D-G, usually the chords C, F, B diminished, Em, Am, Dm, G:\n\n[demonstrates]\n\nThat descending cycle of fifths is used in all sorts of music, everything from \"You Never Give Me Your Money\" by the Beatles:\n\n[Excerpt: The Beatles, \"You Never Give Me Your Money\"]\n\nto \"I Will Survive\" by Gloria Gaynor:\n\n[Excerpt: Gloria Gaynor, \"I Will Survive\"]\n\nBut what Russell pointed out is that if you do the upwards cycle of fifths, and you *don't* change any of the notes, the first seven root notes you get are the same seven notes you'd find in the Lydian mode, just reordered -- C-D-E-F#-G-A-B . Russell then argued that much of the way harmony and melody work in jazz could be thought of as people experimenting with the way the Lydian mode works, and the way the cycle of fifths leads you further and further away from the tonal centre.\n\nNow, you could probably do an entire podcast series as long as this one on the implications of this, and I am honestly just trying to summarise enough information here that you can get a vague gist, but Russell's book had a profound effect on how jazz musicians started to think about harmony and melody. Instead of improvising around the chord changes to songs, they were now basing improvisations and compositions around modes and the notes in them. Rather than having a lot of chord changes, you might just play a single root note that stays the same throughout, or only changes a couple of times in the whole piece, and just imply changes with the clash between the root note and whatever modal note the solo instrument is playing.\n\nThe track \"Milestones\" on the Milestones album shows this kind of thinking in full effect -- the song consists of a section in G Dorian, followed by a section in A Aeolian (or E Phrygian depending on how you look at it). Each section has only one implied chord -- a Gm7 for the G Dorian section, and an Am7(b13) for the A Aeolian section -- over which Davis, Cannonball Adderley on alto sax, and Coltrane on tenor, all solo:\n\n[Excerpt: Miles Davis, \"Milestones\"]\n\n(For the pedants among you, that track was originally titled \"Miles\" on the first pressings of the album, but it was retitled \"Milestones\" on subsequent pressings).\n\nThe modal form would be taken even further on Davis' next album to be recorded, Porgy and Bess, which featured much fuller orchestrations and didn't have Coltrane on it. Davis later said that when the arranger Gil Evans wrote the arrangements for that album, he didn't write any chords at all, just a scale, which Davis could improvise around. But it was on the album after that, Kind of Blue, which again featured Coltrane on saxophone, that modal jazz made its big breakthrough to becoming the dominant form of jazz music.\n\nAs with what Evans had done on Porgy and Bess, Davis gave the other instrumentalists modes to play, rather than a chord sequence to improvise over or a melody line to play with. He explained his thinking behind this in an interview with Nat Hentoff, saying \"When you're based on chords, you know at the end of 32 bars that the chords have run out and there's nothing to do but repeat what you've just done—with variations. I think a movement in jazz is beginning away from the conventional string of chords ... there will be fewer chords but infinite possibilities as to what to do with them.\"\n\nThis style shows up in \"So What\", the opening track on the album, which is in some ways a very conventional song structure -- it's a thirty-two bar AABA structure. But instead of a chord sequence, it's based on modes in two keys -- the A section is in D Dorian, while the B section is in E-flat Dorian:\n\n[Excerpt: Miles Davis, \"So What\"]\n\nKind of Blue would become one of the contenders for greatest jazz album of all time, and one of the most influential records ever made in any genre -- and it could be argued that that track we just heard, \"So What\", inspired a whole other genre we'll be looking at in a future episode -- but Coltrane still felt the need to explore more ideas, and to branch out on his own.\n\nIn particular, while he was interested in modal music, he was also interested in exploring more kinds of scales than just modes, and to do this he had to, at least for the moment, reintroduce chord changes into what he was doing. He was inspired in particular by reading Nicolas Slonimsky's classic Thesaurus of Scales and Melodic Patterns.\n\nColtrane had recently signed a new contract as a solo artist with Atlantic Records, and recorded what is generally considered his first true masterpiece album as a solo artist, Giant Steps, with several members of the Davis band, just two weeks after recording Kind of Blue.\n\nThe title track to Giant Steps is the most prominent example of what are known in jazz as the Coltrane changes -- a cycle of thirds, similar to the cycle of fifths we talked about earlier. The track itself seems to have two sources. The first is the bridge of the old standard \"Have You Met Miss Jones?\", as famously played by Coleman Hawkins:\n\n[Excerpt: Coleman Hawkins, \"Have You Met Miss Jones?\"\n\nAnd the second is an exercise from Slonimsky's book:\n\n[Excerpt: Pattern #286 from Thesaurus of Scales and Melodic Patterns]\n\nColtrane combined these ideas to come up with \"Giant Steps\", which is based entirely around these cycles of thirds, and Slonimsky's example:\n\n[Excerpt: John Coltrane, \"Giant Steps\"]\n\nNow, I realise that this is meant to be a history of rock music, not jazz musicology theory time, so I promise you I am just hitting the high points here. And only the points that affect Coltrane's development as far as it influenced the music we're looking at in this episode. And so we're actually going to skip over Coltrane's commercial high-point, My Favourite Things, and most of the rest of his work for Atlantic, even though that music is some of the most important jazz music ever recorded.\n\nInstead, I'm going to summarise a whole lot of very important music by simply saying that while Coltrane was very interested in this musical idea of the cycle of thirds, he did not like being tied to precise chord changes, and liked the freedom that modal jazz gave to him. By 1960, when his contract with Atlantic was ending and his contract with Impulse was beginning, and he recorded the two albums Olé and Africa/Brass pretty much back to back, he had hit on a new style with the help of Eric Dolphy, a flute, clarinet, and alto sax player who would become an important figure in Coltrane's life. Dolphy died far too young -- he went into a diabetic coma and doctors assumed that because he was a Black jazz musician he must have overdosed, even though he was actually a teetotal abstainer, so he didn't get the treatment he needed -- but he made such a profound influence on Coltrane's life that Coltrane would carry Dolphy's picture with him after his death.\n\nDolphy was even more of a theorist than Coltrane, and another devotee of Slonimsky's book, and he was someone who had studied a great deal of twentieth-century classical music, particularly people like Bartok, Messiaen, Stravinsky, Charles Ives, and Edgard Varese. Dolphy even performed Varese's piece Density 21.5 in concert, an extremely demanding piece for solo flute. I don't know of a recording of Dolphy performing it, sadly, but this version should give some idea:\n\n[Excerpt: Edgard Varese, \"Density 21.5\"]\n\nEncouraged by Dolphy, Coltrane started making music based around no changes at all, with any changes being implied by the melody. The title song of Africa/Brass, \"Africa\", takes up an entire side of one album, and doesn't have a single actual chord change on it, with Dolphy and pianist McCoy Tyner coming up with a brass-heavy arrangement for Coltrane to improvise over a single chord:\n\n[Excerpt: The John Coltrane Quartet: \"Africa\"]\n\nThis was a return to the idea of modal jazz, based on scales rather than chord changes, but by implying chord changes, often changes based on thirds, Coltrane was often using different scales than the modes that had been used in modal jazz.\n\nAnd while, as the title suggested, \"Africa\" was inspired by the music of Africa, the use of a single drone chord underneath solos based on a scale was inspired by the music of another continent altogether.\n\nSince at least the mid-1950s, both Coltrane and Dolphy had been interested in Indian music. They appear to have first become interested in a record released by Folkways, Music Of India, Morning And Evening Ragas by Ali Akbar Khan:\n\n[Excerpt: Ali Akbar Khan, \"Rag Sindhi Bhairavi\"]\n\nBut the musician they ended up being most inspired by was a friend of Khan's, Ravi Shankar, who like Khan had been taught by the great sarod player Alauddin Khan, Ali Akbar Khan's father. The elder Khan, who was generally known as \"Baba\", meaning \"father\", was possibly *the* most influential Indian musician of the first half of the twentieth century, and was a big part of the revitalisation of Indian music that went hand in hand with the growth of Indian nationalism. He was an ascetic who lived for music and nothing else, and would write five to ten new compositions every day, telling Shankar \"Do one thing well and you can achieve everything. Do everything and you achieve nothing\".\n\nAlauddin Khan was a very religious Muslim, but one who saw music as the ultimate way to God and could find truths in other faiths. When Shankar first got to know him, they were both touring as musicians in a dance troupe run by Shankar's elder brother, which was promoting Indian arts in the West, and he talked about taking Khan to hear the organ playing at Notre Dame cathedral, and Khan bursting into tears and saying \"here is God\".\n\nKhan was not alone in this view. The classical music of Northern India, the music that Khan played and taught, had been very influenced by Sufism, which was for most of Muslim history the dominant intellectual and theological tradition in Islam. Now, I am going to sum up a thousand years of theology and practice, of a religion I don't belong to, in a couple of sentences here, so just assume that what I'm saying is wrong, and *please* don't take offence if you are Sufi yourself and believe I am misrepresenting you. But my understanding of Sufism is that Sufis are extremely devoted to attaining knowledge and understanding of God, and believe that strict adherence to Muslim law is the best way to attain that knowledge -- that it is the way that God himself has prescribed for humans to know him -- but that such knowledge can be reached by people of other faiths if they approach their own traditions with enough devotion. Sufi ideas infuse much of Northern Indian classical music, and so for example it has been considered acceptable for Muslims to sing Hindu religious music and Hindus to sing songs of praise to Allah.\n\nSo while Ravi Shankar was Hindu and Alauddin Khan was Muslim, Khan was able to become Shankar's guru in what both men regarded as a religious observance, and even to marry Khan's daughter. Khan was a famously cruel disciplinarian -- once hospitalising a student after hitting him with a tuning hammer -- but he earned the devotion of his students by enforcing the same discipline on himself. He abstained from sex so he could put all his energies into music, and was known to tie his hair to the ceiling while he practiced, so he could not fall asleep no matter how long he kept playing.\n\nBoth Khan and his son Ali Akhbar Khan played the sarod, while Shankar played the sitar, but they all played the same kind of music, which is based on the concept of the raga.\n\nNow, in some ways, a raga can be considered equivalent to a mode in Western music:\n\n[Excerpt: Ali Akbar Khan, \"Rag Sindhi Bhairavi\"]\n\nBut a raga is not *just* a mode -- it sits somewhere between Western conceptions of a mode and a melody. It has a scale, like a mode, but it can have different scales going up or down, and rules about which notes can be moved to from which other notes. So for example (and using Western tones so as not to confuse things further), a raga might say that it's possible to move up from the note G to D, but not down from D to G.\n\nRagas are essentially a very restrictive set of rules which allow the musician playing them to improvise freely within those rules.\n\nIn the late 1940s and early 1950s, the violinist Yehudi Mehuin, at the time the most well-known classical musician in the world, had become fascinated by Indian music as part of a wider programme of his to learn more music outside what he regarded as the overly-constricting scope of the Western classical tradition in which he had been trained. He had become a particular fan of Shankar, and had invited him over to the US to perform. Shankar had refused to come at that point, sending his brother-in-law Ali Akbar Khan over, as he was in the middle of a difficult divorce, and that had been when Khan had recorded that album which had fascinated Coltrane and Dolphy. But Shankar soon followed himself, and made his own records:\n\n[Excerpt: Ravi Shankar, \"Raga Hamsadhwani\"]\n\nThe music that both Khan and Shankar played was a particular style of Hindustani classical music, which has three elements -- there's a melody instrument, in Shankar's case the sitar and in Khan's the sarod, both of them fretted stringed instruments which have additional strings that resonate along with the main melody string, giving their unique sound. These are the most distinctive Indian instruments, but the melody can be played on all sorts of other instruments, whether Indian instruments like the bansuri and shehnai, which are very similar to the flute and oboe respectively, or Western instruments like the violin. Historically, the melody has also often been sung rather than played, but Indian instrumental music has had much more influence on Western popular music than Indian vocal music has, so we're mostly looking at that here.\n\nAlong with the melody instrument there's a percussion instrument, usually the tabla, which is a pair of hand drums. Rather than keep a steady, simple, beat like the drum kit in rock music, the percussion has its own patterns and cycles, called talas, which like ragas are heavily formalised but leave a great amount of room for improvisation. The percussion and the melody are in a sort of dialogue with each other, and play off each other in a variety of ways.\n\nAnd finally there's the drone instrument, usually a stringed instrument called a tamboura. The drone is what it sounds like -- a single note, sustained and repeated throughout the piece, providing a harmonic grounding for the improvisations of the melody instrument. Sometimes, rather than just a single root note, it will be a root and fifth, providing a single chord to improvise over, but as often it will be just one note. Often that note will be doubled at the octave, so you might have a drone on both low E and high E.\n\nThe result provides a very strict, precise, formal, structure for an infinitely varied form of expression, and Shankar was a master of it:\n\n[Excerpt: Ravi Shankar, \"Raga Hamsadhwani\"]\n\nDolphy and, especially, Coltrane became fascinated by Indian music, and Coltrane desperately wanted to record with Shankar -- he even later named his son Ravi in honour of the great musician. It wasn't just the music as music, but music as spiritual practice, that Coltrane was engaged with. He was a deeply religious man but one who was open to multiple faith traditions -- he had been brought up as a Methodist, and both his grandfathers were ministers in the African Methodist Episcopal Zion Church, but his first wife, Naima, who inspired his personal favourite of his own compositions, was a Muslim, while his second wife, Swamini Turiyasangitananda (who he married after leaving Naima in 1963 and who continued to perform as Alice Coltrane even after she took that name, and was herself an extraordinarily accomplished jazz musician on both piano and harp), was a Hindu, and both of them profoundly influenced Coltrane's own spirituality. Some have even suggested that Coltrane's fascination with a cycle of thirds came from the idea that the third could represent both the Christian Trinity and the Hindu trimurti -- the three major forms of Brahman in Hinduism, Brahma, Vishnu, and Shiva.\n\nSo a music which was a religious discipline for more than one religion, and which worked well with the harmonic and melodic ideas that Coltrane had been exploring in jazz and learning about through his studies of modern classical music, was bound to appeal to Coltrane, and he started using the idea of having two basses provide an octave drone similar to that of the tamboura, leading to tracks like \"Africa\" and \"Olé\":\n\n[Excerpt: John Coltrane, \"Olé\"]\n\nSeveral sources have stated that that song was an influence on \"Light My Fire\" by the Doors, and I can sort of see that, though most of the interviews I've seen with Ray Manzarek have him talking about Coltrane's earlier version of \"My Favourite Things\" as the main influence there.\n\nColtrane finally managed to meet with Shankar in December 1961, and spent a lot of time with him -- the two discussed recording an album together with McCoy Tyner, though nothing came of it. Shankar said of their several meetings that month: \"The music was fantastic. I was much impressed, but one thing distressed me. There was turbulence in the music that gave me a negative feeling at times, but I could not quite put my finger on the trouble … Here was a creative person who had become a vegetarian, who was studying yoga, and reading the Bhagavad-Gita, yet in whose music I still heard much turmoil. I could not understand it.\"\n\nColtrane said in turn \"I like Ravi Shankar very much. When I hear his music, I want to copy it – not note for note of course, but in his spirit. What brings me closest to Ravi is the modal aspect of his art. Currently, at the particular stage I find myself in, I seem to be going through a modal phase … There’s a lot of modal music that is played every day throughout the world. It is particularly evident in Africa, but if you look at Spain or Scotland, India or China, you’ll discover this again in each case … It’s this universal aspect of music that interests me and attracts me; that’s what I’m aiming for.\"\n\nAnd the month before Coltrane met Shankar, Coltrane had had a now-legendary residency at the Village Vanguard in New York with his band, including Dolphy, which had resulted not only in the famous Live at the Village Vanguard album, but in two tracks on Coltrane's studio album Impressions.\n\nThose shows were among the most controversial in the history of jazz, though the Village Vanguard album is now often included in lists of the most important records in jazz. Downbeat magazine, the leading magazine for jazz fans at the time, described those shows as \"musical nonsense\" and \"a horrifying demonstration of what appears to be a growing anti-jazz trend\" -- though by the time Impressions came out in 1963, that opinion had been revised somewhat. Harvey Pekar, the comic writer and jazz critic, also writing in DownBeat, gave Impressions five stars, saying \"Not all the music on this album is excellent (which is what a five-star rating signifies,) but some is more than excellent\".\n\nAnd while among Coltrane fans the piece from these Village Vanguard shows that is of most interest is the extended blues masterpiece \"Chasin' the Trane\" which takes up a whole side of the Village Vanguard LP, for our purposes we're most interested in one of the two tracks that was held over for Impressions. This was another of Coltrane's experiments in using the drones he'd found in Indian musical forms, like \"Africa\" and \"Olé\". This time it was also inspired by a specific piece of music, though not an instrumental one. Rather it was a vocal performance -- a recording on a Folkways album of Pandita Ramji Shastri Dravida chanting one of the Vedas, the religious texts which are among the oldest texts sacred to any surviving religion:\n\n[Excerpt: Pandita Ramji Shastri Dravida, \"Vedic Chanting\"]\n\nColtrane took that basic melodic idea, and combined it with his own modal approach to jazz, and the inspiration he was taking from Shankar's music, and came up with a piece called \"India\":\n\n[Excerpt: John Coltrane, \"India\"]\n\nWhich is where we came in, isn't it?\n\n[Excerpt: The Byrds, \"Eight Miles High\"]\n\nSo now, finally, we get to the Byrds.\n\nEven before \"Mr. Tambourine Man\" went to number one in the charts, the Byrds were facing problems with their sound being co-opted as the latest hip thing. Their location in LA, at the centre of the entertainment world, was obviously a huge advantage to them in many ways, but it also made them incredibly visible to people who wanted to hop onto a bandwagon. The group built up much of their fanbase playing at Ciro's -- the nightclub on the Sunset Strip that we mentioned in the previous episode which later reopened as It's Boss -- and among those in the crowd were Sonny and Cher. And Sonny brought along his tape recorder.\n\nThe Byrds' follow-up single to \"Mr. Tambourine Man\", released while that song was still going up the charts, was another Dylan song, \"All I Really Want to Do\". But it had to contend with this:\n\n[Excerpt: Cher, \"All I Really Want to Do\"]\n\nCher's single, produced by Sonny, was her first solo single since the duo had become successful, and came out before the Byrds' version, and the Byrds were convinced that elements of the arrangement, especially the guitar part, came from the version they'd been performing live – though of course Sonny was no stranger to jangly guitars himself, having co-written “Needles and Pins”, the song that pretty much invented the jangle. Cher made number fifteen on the charts, while the Byrds only made number forty. Their version did beat Cher's in the UK charts, though.\n\nThe record company was so worried about the competition that for a while they started promoting the B-side as the A-side. That B-side was an original by Gene Clark, though one that very clearly showed the group's debt to the Searchers:\n\n[Excerpt: The Byrds, \"I'll Feel a Whole Lot Better\"]\n\nWhile it was very obviously derived from the Searchers' version of \"Needles and Pins\", especially the riff, it was still a very strong, original, piece of work in its own right. It was the song that convinced the group's producer, Terry Melcher, that they were a serious proposition as artists in their own right, rather than just as performers of Dylan's material, and it was also a favourite of the group's co-manager, Jim Dickson, who picked out Clark's use of the word \"probably\" in the chorus as particularly telling -- the singer thinks he will feel better when the subject of the song is gone, but only probably. He's not certain.\n\n\"I'll Feel a Whole Lot Better\", after being promoted as the A-side for a short time, reached number one hundred and two on the charts, but the label quickly decided to re-flip it and concentrate on promoting the Dylan song as the single.\n\nThe group themselves weren't too bothered about their thunder having been stolen by Sonny and Cher, but their new publicist was incandescent. Derek Taylor had been a journalist for the Daily Express, which at that time was a respectable enough newspaper (though that is very much no longer the case). He'd become involved in the music industry after writing an early profile on the Beatles, at which point he had been taken on by the Beatles' organisation first to ghostwrite George Harrison's newspaper column and Brian Epstein's autobiography, and then as their full-time publicist and liner-note writer. He'd left the organisation at the end of 1964, and had moved to the US, where he had set up as an independent music publicist, working for the Byrds, the Beach Boys, and various other acts in their overlapping social circles, such as Paul Revere and the Raiders.\n\nTaylor was absolutely furious on the group's behalf, saying \"I was not only disappointed, I was disgusted. Sonny and Cher went to Ciro's and ripped off the Byrds and, being obsessive, I could not get this out of my mind that Sonny and Cher had done this terrible thing. I didn't know that much about the record business and, in my experience with the Beatles, cover versions didn't make any difference. But by covering the Byrds, it seemed that you could knock them off the perch. And Sonny and Cher, in my opinion, stole that song at Ciro's and interfered with the Byrds' career and very nearly blew them out of the game.\"\n\nBut while the single was a comparative flop, the Mr. Tambourine Man album, which came out shortly after, was much more successful. It contained the A and B sides of both the group's first two singles, although a different vocal take of \"All I Really Want to Do\" was used from the single release, along with two more Dylan covers, and a couple more originals -- five of the twelve songs on the album were original in total, three of them Gene Clark solo compositions and the other two co-written by Clark and Roger McGuinn. To round it out there was a version of the 1939 song \"We'll Meet Again\", made famous by Vera Lynn, which you may remember us discussing in episode ninety as an example of early synthesiser use, but which had recently become popular in a rerecorded version from the 1950s, thanks to its use at the end of Dr. Strangelove; there was a song written by Jackie DeShannon; and \"The Bells of Rhymney\", a song in which Pete Seeger set a poem about a mining disaster in Wales to music.\n\nSo a fairly standard repertoire for early folk-rock, though slightly heavier on Dylan than most.\n\nWhile the group's Hollywood notoriety caused them problems like the Sonny and Cher one, it did also give them advantages. For example, they got to play at the fourth of July party hosted by Jane Fonda, to guests including her father Henry and brother Peter, Louis Jordan, Steve McQueen, Warren Beatty, and Sidney Poitier. Derek Taylor, who was used to the Beatles' formal dress and politeness at important events, imposed on them by Brian Epstein, was shocked when the Byrds turned up informally dressed, and even more shocked when Vito Paulekas and Carl Franzoni showed up.\n\nVito (who was always known by his first name) and Franzoni are both important but marginal figures in the LA scene. Neither were musicians, though Vito did make one record, produced by Kim Fowley:\n\n[Excerpt: Vito and the Hands, \"Vito and the Hands\"]\n\nRather Vito was a sculptor in his fifties, who had become part of the rock and roll scene and had gathered around him a dance troupe consisting largely of much younger women, and also of himself and Franzoni. Their circle, which also included Arthur Lee and Bryan MacLean, who weren't part of their dance troupe but were definitely part of their crowd, will be talked about much more in future episodes, but for now we'll just say that they are often considered proto-hippies, though they would have disputed that characterisation themselves quite vigorously; that they were regular dancers at Ciro's and became regular parts of the act of both the Byrds and the Mothers of Invention; and we'll give this rather explicit description of their performances from Frank Zappa:\n\n\"The high point of the performance was Carl Franzoni, our 'go-go boy.' He was wearing ballet tights, frugging violently. Carl has testicles which are bigger than a breadbox. Much bigger than a breadbox. The looks on the faces of the Baptist teens experiencing their grandeur is a treasured memory.\"\n\nPaints a vivid picture, doesn't it? So you can possibly imagine why Derek Taylor later said \"When Carl Franzoni and Vito came, I got into a terrible panic\". But Jim Dickson explained to him that it was Hollywood and people were used to that kind of thing, and even though Taylor described seeing Henry Fonda and his wife pinned against the wall by the writhing Franzoni and the other dancers, apparently everyone had a good time.\n\nAnd then the next month, the group went on their first UK tour. On which nobody had a good time:\n\n[Excerpt: The Byrds, \"Eight Miles High\"]\n\nEven before the tour, Derek Taylor had reservations. Obviously the Byrds should tour the UK -- London, in particular, was the centre of the cultural world at that time, and Taylor wanted the group to meet his old friends the Beatles and visit Carnaby Street. But at the same time, there seemed to be something a little... off... about the promoters they were dealing with, Joe Collins, the father of Joan and Jackie Collins, and a man named Mervyn Conn. As Taylor said later \"All I did know was that the correspondence from Mervyn Conn didn't assure me. I kept expressing doubts about the contents of the letters. There was something about the grammar. You know, 'I'll give you a deal', and 'We'll get you some good gigs'. The whole thing was very much showbusiness. Almost pantomime showbusiness.\"\n\nBut still, it seemed like it was worth making the trip, even when Musicians Union problems nearly derailed the whole thing. We've talked previously about how disagreements between the unions in the US and UK meant that musicians from one country couldn't tour the other for decades, and about how that slightly changed in the late fifties. But the new system required a one-in, one-out system where tours had to be set up as exchanges so nobody was taking anyone's job, and nobody had bothered to find a five-piece group of equivalent popularity to the Byrds to tour America in return. Luckily, the Dave Clark Five stepped into the breach, and were able to do a US tour on short notice, so that problem was solved.\n\nAnd then, as soon as they landed, the group were confronted with a lawsuit. From the Birds:\n\n[Excerpt: The Birds, \"No Good Without You Baby\"]\n\nThese Birds, spelled with an \"i\", not a \"y\", were a Mod group from London, who had started out as the Thunderbirds, but had had to shorten their name when the London R&B singer Chris Farlowe and his band the Thunderbirds had started to have some success. They'd become the Birds, and released a couple of unsuccessful singles, but had slowly built up a reasonable following and had a couple of TV appearances. Then they'd started to receive complaints from their fans that when they went into the record shops to ask for the new record by the Birds, they were being sold some jangly folky stuff about tambourines, rather than Bo Diddley inspired R&B.\n\nSo the first thing the American Byrds saw in England, after a long and difficult flight which had left them very tired and depressed, especially Gene Clark, who hated flying, was someone suing them for loss of earnings.\n\nThe lawsuit never progressed any further, and the British group changed their name to Birds Birds, and quickly disappeared from music history -- apart from their guitarist, Ronnie Wood, who we'll be hearing from again. But the experience was not exactly the welcome the group had been hoping for, and is reflected in one of the lines that Gene Clark wrote in the song he later came up with about the trip -- \"Nowhere is there love to be found among those afraid of losing their ground\".\n\nAnd the rest of the tour was not much of an improvement. Chris Hillman came down with bronchitis on the first night, David Crosby kept turning his amp up too high, resulting in the other members copying him and the sound in the venues they were playing seeming distorted, and most of all they just seemed, to the British crowds, to be unprofessional. British audiences were used to groups running on, seeming excited, talking to the crowd between songs, and generally putting on a show. The Byrds, on the other hand, sauntered on stage, and didn't even look at the audience, much less talk to them. What seemed to the LA audience as studied cool seemed to the UK audience like the group were rude, unprofessional, and big-headed. At one show, towards the end of the set, one girl in the audience cried out \"Aren't you even going to say anything?\", to which Crosby responded \"Goodbye\" and the group walked off, without any of them having said another word. When they played the Flamingo Club, the biggest cheer of the night came when their short set ended and the manager said that the club was now going to play records for dancing until the support act, Geno Washington and the Ramjam Band, were ready to do another set.\n\nMichael Clarke and Roger McGuinn also came down with bronchitis, the group were miserable and sick, and they were getting absolutely panned in the reviews. The closest thing they got to a positive review was when Paul Jones of Manfred Mann was asked about them, and he praised some of their act -- perceptively pointing to their version of \"We'll Meet Again\" as being in the Pop Art tradition of recontextualising something familiar so it could be looked at freshly -- but even he ended up also criticising several aspects of the show and ended by saying \"I think they're going to be a lot better in the future\".\n\nAnd then, just to rub salt in the wound, Sonny and Cher turned up in the UK. The Byrds' version of \"All I Really Want to Do\" massively outsold theirs in the UK, but their big hit became omnipresent:\n\n[Excerpt: Sonny and Cher, \"I Got You Babe\"]\n\nAnd the press seemed to think that Sonny and Cher, rather than the Byrds, were the true representatives of the American youth culture. The Byrds were already yesterday's news.\n\nThe tour wasn't all bad -- it did boost sales of the group's records, and they became friendly with the Beatles, Stones, and Donovan. So much so that when later in the month the Beatles returned to the US, the Byrds were invited to join them at a party they were holding in Benedict Canyon, and it was thanks to the Byrds attending that party that two things happened to influence the Beatles' songwriting. The first was that Crosby brought his Hollywood friend Peter Fonda along. Fonda kept insisting on telling people that he knew what it was like to actually be dead, in a misguided attempt to reassure George Harrison, who he wrongly believed was scared of dying, and insisted on showing them his self-inflicted bullet wounds.\n\nThis did not go down well with John Lennon and George Harrison, both of whom were on acid at the time. As Lennon later said, \"We didn't want to hear about that! We were on an acid trip and the sun was shining and the girls were dancing and the whole thing was beautiful and Sixties, and this guy – who I really didn't know; he hadn't made Easy Rider or anything – kept coming over, wearing shades, saying, \"I know what it's like to be dead,\" and we kept leaving him because he was so boring! ... It was scary. You know ... when you're flying high and [whispers] \"I know what it's like to be dead, man\"\n\nEventually they asked Fonda to get out, and the experience later inspired Lennon to write this:\n\n[Excerpt: The Beatles, \"She Said, She Said\"]\n\nIncidentally, like all the Beatles songs of that period, that was adapted for the cartoon TV series based on the group, in this case as a follow-the-bouncing-ball animation. There are few things which sum up the oddness of mid-sixties culture more vividly than the fact that there was a massively popular kids' cartoon with a cheery singalong version of a song about a bad acid trip and knowing what it's like to be dead.\n\nBut there was another, more positive, influence on the Beatles to come out of them having invited the Byrds to the party. Once Fonda had been kicked out, Crosby and Harrison became chatty, and started talking about the sitar, an instrument that Harrison had recently become interested in. Crosby showed Harrison some ragas on the guitar, and suggested he start listening to Ravi Shankar, who Crosby had recently become a fan of. And we'll be tracking Shankar's influence on Harrison, and through him the Beatles, and through them the whole course of twentieth century culture, in future episodes.\n\nCrosby's admiration both of Ravi Shankar and of John Coltrane was soon to show in the Byrds' records, but first they needed a new single. They'd made attempts at a version of \"The Times They Are A-Changin'\", and had even tried to get both George Harrison and Paul McCartney to add harmonica to that track, but that didn't work out. Then just before the UK tour, Terry Melcher had got Jack Nitzsche to come up with an arrangement of Dylan's \"It's All Over Now, Baby Blue\":\n\n[Excerpt: The Byrds, \"It's All Over Now, Baby Blue (version 1)\"]\n\nNitzsche's arrangement was designed to sound as much like a Sonny and Cher record as possible, and at first the intention was just to overdub McGuinn's guitar and vocals onto a track by the Wrecking Crew. The group weren't happy at this, and even McGuinn, who was the friendliest of the group with Melcher and who the record was meant to spotlight, disliked it. The eventual track was cut by the group, with Jim Dickson producing, to show they could do a good job of the song by themselves, with the intention that Melcher would then polish it and finish it in the studio, but Melcher dropped the idea of doing the song at all.\n\nThere was a growing factionalism in the group by this point, with McGuinn and to a lesser extent Michael Clarke being friendly with Melcher. Crosby disliked Melcher and was pushing for Jim Dickson to replace him as producer, largely because he thought that Melcher was vetoing Crosby's songs and giving Gene Clark and Roger McGuinn free run of the songwriting. Dickson on the other hand was friendliest with Crosby, but wasn't much keener on Crosby's songwriting than Melcher was, thinking Gene Clark was the real writing talent in the group. It didn't help that Crosby's songs tended to be things like harmonically complex pieces based on science fiction novels -- Crosby was a big fan of the writer Robert Heinlein, and in particular of the novel Stranger in a Strange Land, and brought in at least two songs inspired by that novel, which were left off albums -- his song \"Stranger in a Strange Land\" was eventually recorded by the San Francisco group Blackburn & Snow:\n\n[Excerpt: Blackburn & Snow, \"Stranger in a Strange Land\"]\n\nOddly, Jim Dickson objected to what became the Byrds' next single for reasons that come from the same roots as the Heinlein novel. A short while earlier, McGuinn had worked as a guitarist and arranger on an album by the folk singer Judy Collins, and one of the songs she had recorded on that album was a song written by Pete Seeger, setting the first eight verses of chapter three of the Biblical book of Ecclesiastes to music:\n\n[Excerpt: Judy Collins, \"Turn Turn Turn (To Everything There is a Season\"]\n\nMcGuinn wanted to do an electric version of that song as the Byrds' next single, and Melcher sided with him, but Dickson was against the idea, citing the philosopher Alfred Korzybski, who was a big influence both on the counterculture and on Heinlein. Korzybski, in his book Science and Sanity, argued that many of the problems with the world are caused by the practice in Aristotelean logic of excluding the middle and only talking about things and their opposites, saying that things could be either A or Not-A, which in his view excluded most of actual reality. Dickson's argument was that the lyrics to “Turn! Turn! Turn!” with their inflexible Aristotelianism, were hopelessly outmoded and would make the group a laughing stock among anyone who had paid attention to the intellectual revolutions of the previous few decades. \"A time of love, a time of hate\"? What about all the times that are neither for loving or hating, and all the emotions that are complex mixtures of love and hate? In his eyes, this was going to make the group look like lightweights.\n\nTerry Melcher disagreed, and forced the group through take after take, until they got what became the group's second number one hit:\n\n[Excerpt: The Byrds, \"Turn! Turn! Turn!\"]\n\nAfter the single was released and became a hit, the battle lines in the group hardened. It was McGuinn and Melcher on one side, Crosby and Dickson on the other, with Chris Hillman, Michael Clarke, and Gene Clark more or less neutral in the middle, but tending to side more and more with the two Ms largely because of Crosby's ability to rub everyone up the wrong way.\n\nAt one point during the sessions for the next album, tempers flared so much that Michael Clarke actually got up, went over to Crosby, and punched Crosby so hard that he fell off his seat. Crosby, being Hollywood to the bone, yelled at Clarke \"You'll never work in this town again!\", but the others tended to agree that on that occasion Crosby had it coming. Clarke, when asked about it later, said \"I slapped him because he was being an asshole. He wasn't productive. It was necessary.\"\n\nThings came to a head in the filming for a video for the next single, Gene Clark's \"Set You Free This Time\". Michael Clarke was taller than the other Byrds, and to get the shot right, so the angles would line up, he had to stand further from the camera than the rest of them. David Crosby -- the member with most knowledge of the film industry, whose father was an Academy Award-winning cinematographer, so who definitely understood the reasoning for this -- was sulking that once again a Gene Clark song had been chosen for promotion rather than one of his songs, and started manipulating Michael Clarke, telling him that he was being moved backwards because the others were jealous of his good looks, and that he needed to move forward to be with the rest of them.\n\nMultiple takes were ruined because Clarke listened to Crosby, and eventually Jim Dickson got furious at Clarke and went over and slapped him on the face. All hell broke loose. Michael Clarke wasn't particularly bothered by being slapped by Dickson, but Crosby took that as an excuse to leave, walking off before the first shot of the day had been completed. Dickson ran after Crosby, who turned round and punched Dickson in the mouth. Dickson grabbed hold of Crosby and held him in a chokehold. Gene Clark came up and pulled Dickson off Crosby, trying to break up the fight, and then Crosby yelled \"Yeah, that's right, Gene! Hold him so I can hit him again!\"\n\nAt this point if Clark let Dickson go, Dickson would have attacked Crosby again. If he held Dickson, Crosby would have taken it as an invitation to hit him more. Clark's dilemma was eventually relieved by Barry Feinstein, the cameraman, who came in and broke everything up.\n\nIt may seem odd that Crosby and Dickson, who were on the same side, were the ones who got into a fight, while Michael Clarke, who had previously hit Crosby, was listening to Crosby over Dickson, but that's indicative of how everyone felt about Crosby. As Dickson later put it, \"People have stronger feelings about David Crosby. I love David more than the rest and I hate him more than the rest. I love McGuinn the least, and I hate him the least, because he doesn't give you emotional feedback. You don't get a chance. The hate is in equal proportion to how much you love them.\"\n\nMcGuinn was finding all this deeply distressing -- Dickson and Crosby were violent men, and Michael Clarke and Hillman could be provoked to violence, but McGuinn was a pacifist both by conviction and temperament. Everything was conspiring to push the camps further apart. For example, Gene Clark made more money than the rest because of his songwriting royalties, and so got himself a good car. McGuinn had problems with his car, and knowing that the other members were jealous of Clark, Melcher offered to lend McGuinn one of his own Cadillacs, partly in an attempt to be friendly, and partly to make sure the jealousy over Clark's car didn't cause further problems in the group.\n\nBut, of course, now Gene Clark had a Ferrarri and Roger McGuinn had a Cadillac, where was David Crosby's car? He stormed into Dickson's office and told him that if by the end of the tour the group were going on, Crosby didn't have a Bentley, he was quitting the group.\n\nThere was only one thing for it. Terry Melcher had to go. The group had recorded their second album, and if they couldn't fix the problems within the band, they would have to deal with the problems from outside. While the group were on tour, Jim Dickson told Melcher they would no longer be working with him as their producer.\n\nOn the tour bus, the group listened over and over to a tape McGuinn had made of Crosby's favourite music. On one side was a collection of recordings of Ravi Shankar, and on the other was two Coltrane albums -- Africa/Brass and Impressions:\n\n[Excerpt: John Coltrane, \"India\"]\n\nThe group listened to this, and basically no other music, on the tour, and while they were touring Gene Clark was working on what he hoped would be the group's next single -- an impressionistic song about their trip to the UK, which started \"Six miles high and when you touch down, you'll find that it's stranger than known\". After he had it half complete, he showed it to Crosby, who helped him out with the lyrics, coming up with lines like \"Rain, grey town, known for its sound\" to describe London. The song talked about the crowds that followed them, about the music -- namechecking the Small Faces, who at the time had only released two singles and had one minor UK hit -- and about the feeling of being lost and a stranger in a strange land.\n\nThe pair then brought the song to McGuinn, who made two further changes -- he suggested that while \"six miles high\" was an accurate description of how far up a transatlantic flight gets, eight was a better number than six, partly for numerological reasons, partly because it just sounded good, and partly because the Beatles had used it for \"Eight Days a Week\".\n\nThe other major change that McGuinn made was to suggest that they incorporate some of the music they'd been listening to. While the song had chord changes, they decided to make it sound more droning, and also to have McGuinn play a guitar intro that was very closely based on Coltrane's \"India\".\n\nThe group were all thrilled with the song, and recorded it in RCA Studios on December the twenty-second, 1965:\n\n[Excerpt: The Byrds, \"Eight Miles High (version 1)\"]\n\nThey were convinced it was going to be a hit, but Columbia Records wouldn't put it out. Not because of the experimental music, nor because of the double meaning of the word \"high\", but because it had been recorded in RCA Studios, and Columbia would only release music recorded in their own studios. So they went back a month later and remade the track, with Columbia West Coast Vice President Allen Stanton as nominal producer. None of the group thought that that was as good a recording, but it was the one that finally got released:\n\n[Excerpt: The Byrds, \"Eight Miles High\"]\n\nThe song got banned by many radio stations for promoting drug use -- though at the time the group insisted that it was really about flying rather than drugs, but later they did admit the obvious fact that it was also very much a drug-influenced song. The publicity for the song called it \"raga rock\", and described the B-side, a Shankar-influenced song by Crosby, the same way. But \"Eight Miles High\" is now widely regarded as one of the first examples, if not the first example, of psychedelic rock. Of course, as we've said many times on this podcast, there is no actual first example of anything, but \"Eight Miles High\" was, if nothing else, an early example of the style. It sounded like nothing else on the radio at the time.\n\n[Excerpt: The Byrds, “Eight Miles High”]\n\nBut despite that, it made number fifteen on the charts, their third top twenty hit. The Byrds had proved they could have a hit without Terry Melcher.\n\nBut as it turned out, Melcher wasn't the only one to part ways with the group. Gene Clark had become increasingly unhappy with all the infighting in the group, much of which seemed to be centred on him having more songs on the group's albums than McGuinn and Crosby, and he was also becoming slightly withdrawn and paranoid. He no longer wanted to be stuck in the middle of the clash between Crosby and McGuinn, and he left the group, citing his fear of flying.\n\nFrom this point on, McGuinn and Crosby would get as many songs as they wanted on the albums. And the group never had another top twenty hit single.",
  "itunes:subtitle": "Episode one hundred and thirty-nine of A History of Rock Music in Five Hundred Songs looks at “Eight Miles High” by the Byrds, and the influence of jazz and Indian music on psychedelic rock. This is a long one... Click the full post to read liner notes, ",
  "itunes:keywords": "Alfred Korzybski,Ali Akbar Khan,Arthur Lee,Bryan Maclean,Carl Franzoni,Cher,Chris Hillman,David Crosby,Derek Taylor,Dexter Gordon,Dizzy Gillespie,Edgard Varese,Eric Dolphy,Frank Zappa,Gene Clark,George Harrison,Illinois Jacquet,Jack Nitzsche,Jane Fonda,Jim Dickson,John Coltrane,John Lennon,Judy Collins,Kim Fowley,Michael Clarke,Miles Davis,Nicolas Slonimsky,Paul Jones,Pete Seeger,Peter Fonda,Ravi Shankar,Robert Heinlein,Roger McGuinn,Ron Wood,Sonny Bono,Stravinsky,Terry Melcher,The Beatles,The Byrds,Vito Paulekas",
  "itunes:episodeType": "full",
  "itunes:episode": 139,
  "content:encoded": "Episode one hundred and thirty-nine of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Eight Miles High” by the Byrds, and the influence of jazz and Indian music on psychedelic rock. This is a long one... Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/60221026\">on \"Winchester Cathedral\" by the New Vaudeville Band</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nNo Mixcloud this time, as there were multiple artists with too many songs.\n\nInformation on John Coltrane came from <em>Coltrane</em> by Ben Ratliffe, while information on Ravi Shankar came from <a href=\"https://amzn.to/3JdVYyG\"><em>Indian Sun: The Life and Music of Ravi Shankar</em> by Oliver Craske</a>.\n\nFor information on the Byrds, I relied mostly on <a href=\"https://amzn.to/3rsesTF\">Timeless Flight Revisited by Johnny Rogan,</a> with some information from <a href=\"https://amzn.to/36RTDrp\">Chris Hillman’s autobiography</a>.\n\n<a href=\"http://www.scottlernermusic.com/ftp/coltrane%2520dissertation.pdf\">This dissertation looks at the influence of Slonimsky on Coltrane</a>.\n\nAll Coltrane's music is worth getting, but <a href=\"https://amzn.to/3qm4kvC\">this 5-CD set</a> containing <em>Impressions</em> is the most relevant cheap selection of his material for these purposes.\n\n<a href=\"https://amzn.to/3piGYHV\">This collection</a> has the Shankar material released in the West up to 1962.\n\nAnd<a href=\"https://amzn.to/3rpSZLj\"> this three-CD set</a> is a reasonable way of getting most of the Byrds’ important recordings.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nThis episode is the second part of a loose trilogy of episodes set in LA in 1966. We're going to be spending a *lot* of time around LA and Hollywood for the next few months -- seven of the next thirteen episodes are based there, and there'll be more after that.\n\nBut it's going to take a while to get there. This is going to be an absurdly long episode, because in order to get to LA in 1966 again, we're going to have to start off in the 1940s in New York, and take a brief detour to India. Because in order to explain this:\n\n[Excerpt: The Byrds, \"Eight Miles High\"]\n\nWe're first going to have to explain this:\n\n[Excerpt: John Coltrane, \"India (#3)\"]\n\nBefore we begin this, I just want to say something. This episode runs long, and covers a *lot* of musical ground, and as part of that it covers several of the most important musicians of the twentieth century -- but musicians in the fields of jazz, which is a music I know something about, but am not an expert in, and Hindustani classical music, which is very much not even close to my area of expertise. It also contains a chunk of music theory, which again, I know a little about -- but only really enough to know how much I don't know.\n\nI am going to try to get the information about these musicians right, but I want to emphasise that at times I will be straying *vastly* out of my lane, in ways that may well seem like they're minimising these musicians. I am trying to give just enough information about them to tell the story, and I would urge anyone who becomes interested in the music I talk about in the early parts of this episode to go out and find more expert sources to fill in the gap. And conversely, if you know more about these musics than I do, please forgive any inaccuracies. I am going to do my best to get all of this right, because accuracy is important, but I suspect that every single sentence in the first hour or so of this episode could be footnoted with something pointing out all the places where what I've said is only somewhat true. Also, I apologise if I mispronounce any names or words in this episode, though I've tried my best to get it right -- I've been unable to find recordings of some words and names being spoken, while with others I've heard multiple versions.\n\nTo tell today's story, we're going to have to go right back to some things we looked at in the first episode, on \"Flying Home\". For those of you who don't remember -- which is fair enough, since that episode was more than three years ago -- in that episode we looked at a jazz record by the Benny Goodman Sextet, which was one of the earliest popular recordings to feature electric guitar:\n\n[Excerpt: The Benny Goodman Sextet, \"Flying Home\"]\n\nNow, we talked about quite a lot of things in that episode which have played out in later episodes, but one thing we only mentioned in passing, there or later, was a style of music called bebop. We did talk about how Charlie Christian, the guitarist on that record, was one of the innovators of that style, but we didn't really go into what it was properly.\n\nIndeed, I deliberately did not mention in that episode something that I was saving until now, because we actually heard *two* hugely influential bebop musicians in that episode,  and I was leaving the other one to talk about here.\n\nIn that episode we saw how Lionel Hampton, the Benny Goodman band's vibraphone player, went on to form his own band, and how that band became one of the foundational influences for the genres that became known as jump blues and R&B. And we especially noted the saxophone solo on Hampton's remake of \"Flying Home\", played by Illinois Jacquet:\n\n[Excerpt: Lionel Hampton, \"Flying Home\"]\n\nWe mentioned in that episode how Illinois Jacquet's saxophone solo there set the template for all tenor sax playing in R&B and rock and roll music for decades to come -- his honking style became quite simply how you play rock and roll or R&B saxophone, and without that solo you don't have any of the records by Fats Domino, Little Richard, the Coasters, or a dozen other acts that we discussed.\n\nBut what we didn't look at in that episode is that that is a big band record, so of course there is more than just one saxophone player on it. And one of the other saxophone players on that recording is Dexter Gordon, a musician who was originally from LA. Those of you with long memories will remember that back in the first year or so of the podcast we talked a lot about the music programme at Jefferson High School in LA, and about Samuel Browne, the music teacher whose music programme gave the world the Coasters, the Penguins, the Platters, Etta James, Art Farmer, Richard Berry, Big Jay McNeely, Barry White, and more other important musicians than I can possibly name here. Gordon was yet another of Browne's students -- one who Browne regularly gave detention to, just to make him practice his scales.\n\nGordon didn't get much chance to shine in the Lionel Hampton band, because he was only second tenor, with Jacquet taking many of the solos. But he was learning from playing in a band with Jacquet, and while Gordon didn't ever develop a honk like Jacquet's, he did adopt some of Jacquet's full tone in his own sound. There aren't many recordings of Gordon playing solos in his early years, because they coincided with the American Federation of Musicians' recording strike that we talked about in those early episodes, but he did record a few sessions in 1943 for a label small enough not to be covered by the ban, and you can hear something of Jacquet's tone in those recordings, along with the influence of Lester Young, who influenced all tenor sax players at this time:\n\n[Excerpt: Nat \"King\" Cole with Dexter Gordon, \"I've Found a New Baby\"]\n\nThe piano player on that session, incidentally, is Nat \"King\" Cole, when he was still one of the most respected jazz pianists on the scene, before he switched primarily to vocals.\n\nAnd Gordon took this Jacquet-influenced tone, and used it to become the second great saxophone hero of bebop music, after Charlie Parker -- and the first great tenor sax hero of the music.\n\nI've mentioned bebop before on several occasions, but never really got into it in detail. It was a style that developed in New York in the mid to late forties, and a lot of the earliest examples of it went unrecorded thanks to that musicians' strike, but the style emphasised small groups improvising together, and expanding their sense of melody and harmony. The music prized virtuosity and musical intelligence over everything else, and was fast and jittery-sounding. The musicians would go on long, extended, improvisations, incorporating ideas both from the blues and from the modern classical music of people like Bartok and Stravinsky, which challenged conventional tonality.\n\nIn particular, one aspect which became prominent in bebop music was a type of scale known as the bebop scale. In most of the music we've looked at in this podcast to this point, the scales used have been seven-note scales -- do-re-mi-fa-so-la-ti- which make an octave with a second, higher, do tone. So in the scale of C major we have C, D, E, F, G, A, B, and then another C:\n\n[demonstrates]\n\nBebop scales, on the other hand, would generally have an extra note in, making an eight-note scale, by adding in what is called a chromatic passing note. For example, a typical bebop C major scale might add in the note G#, so the scale would go C,D,E,F,G,G#, A, B, C:\n\n[demonstrates]\n\nYou'd play this extra note for the most part, when moving between the two notes it's between, so in that scale you'd mostly use it when moving from G to A, or from A to G. Now I'm far from a bebop player, so this won't sound like bebop, but I can demonstrate the kind of thing if I first noodle a little scalar melody in the key of C major:\n\n[demonstrates]\n\nAnd then play the same thing, but adding in a G# every time I go between the G and the A in either direction:\n\n[demonstrates]\n\nThat is not bebop music, but I hope you can see what a difference that chromatic passing tone makes to the melody. But again, that's not bebop, because I'm not a bebop player. Dexter Gordon, though, *was* a bebop player.\n\nHe moved to New York while playing with Louis Armstrong's band, and soon became part of the bebop scene, which at the time centred around Charlie Christian, the trumpet player Dizzy Gillespie, and the alto sax player Charlie Parker, sometimes nicknamed \"bird\" or \"Yardbird\", who is often regarded as the greatest of them all. Gillespie, Parker, and Gordon also played in Billy Eckstine's big band, which gave many of the leading bebop musicians the opportunity to play in what was still the most popular idiom at the time -- you can hear Gordon have a saxophone battle with Gene Ammons on \"Blowing the Blues Away\" in a lineup of the band that also included Art Blakey on drums and Dizzy Gillespie on trumpet:\n\n[Excerpt: Billy Eckstine, \"Blowing the Blues Away\"]\n\nBut Gordon was soon leading his own small band sessions, and making records for labels like Savoy, on which you can definitely hear the influence of Illinois Jacquet on his tone, even as he's playing music that's more melodically experimental by far than the jump band music of the Hampton band:\n\n[Excerpt: Dexter Gordon, \"Dexter Digs In\"]\n\nBasically, in the late 1940s, if you were wanting to play bebop on the saxophone, you had two models to follow -- Charlie Parker, the great alto saxophonist with his angular, atonal, melodic sense and fast, virtuosic, playing, or Dexter Gordon, the tenor saxophonist, whose style had more R&B grease and wit to it, who would quote popular melodies in his own improvisations.\n\nAnd John Coltrane followed both. Coltrane's first instrument was the alto sax, and when he was primarily an alto player he would copy Charlie Parker's style. When he switched to being primarily a tenor player -- though he would always continue playing both instruments, and later in his career would also play soprano sax -- he took up much of Gordon's mellower tone, though he was also influenced by other tenor players, like Lester Young, the great player with Count Basie's band, and Johnny Hodges, who played with Duke Ellington.\n\nNow, it is important to note here that John Coltrane is a very, very, big deal. Depending on your opinion of Ornette Coleman's playing, Coltrane is by most accounts either the last or penultimate truly great innovator in jazz saxophone, and arguably the single foremost figure in the music in the last half of the twentieth century. In this podcast I'm only able to tell you enough about him to give you the information you need to understand the material about the Byrds, but were I to do a similar history of jazz in five hundred songs, Coltrane would have a similar position to someone like the Beatles -- he's such a major figure that he is literally venerated as a saint by the African Orthodox Church, and a couple of other Episcopal churches have at least made the case for his sainthood. So anything I say here about him is not even beginning to scratch the surface of his towering importance to jazz music, but it will, I hope, give some idea of his importance to the development of the Byrds -- a group of whom he was almost certainly totally unaware.\n\nColtrane started out playing as a teenager, and his earliest recordings were when he was nineteen and in the armed forces, just after the end of World War II. At that time, he was very much a beginner, although a talented one, and on his early amateur recordings you can hear him trying to imitate Parker without really knowing what it was that Parker was doing that made him so great. But as well as having some natural talent, he had one big attribute that made him stand out -- his utter devotion to his music. He was so uninterested in anything other than mastering his instrument that one day a friend was telling him about a baseball game he'd watched, and all Coltrane could do was ask in confusion \"Who's Willie Mays?\"\n\nColtrane would regularly practice his saxophone until his reed was red with blood, but he would also study other musicians. And not just in jazz. He knew that Charlie Parker had intensely studied Stravinsky's Firebird Suite, and so Coltrane would study that too:\n\n[Excerpt: Stravinsky, \"Firebird Suite\"]\n\nColtrane joined the band of Eddie \"Cleanhead\" Vinson, who was one of those figures like Johnny Otis, with whom Vinson would later perform for many years, who straddled the worlds of jazz and R&B. Vinson was a blues shouter in the style of Big Joe Turner, but he was also a bebop sax player, and what he wanted was a tenor sax player who could play tenor the way Charlie Parker played alto, but do it in an R&B setting. Coltrane switched from alto to tenor, and spent a year or so playing with Vinson's band.\n\nNo recordings exist of Coltrane with Vinson that I'm aware of, but you can get an idea of what he sounded like from his next band. By this point, Dizzy Gillespie had graduated from small bebop groups to leading a big band, and he got Coltrane in as one of his alto players, though Coltrane would often also play tenor with Gillespie, as on this recording from 1951, which has Coltrane on tenor, Gillespie on trumpet, with Kenny Burrell and two of the future Modern Jazz Quartet, Milt Jackson and Percy Heath, showing that the roots of modern jazz were not very far at all from the roots of rock and roll:\n\n[Excerpt: Dizzy Gillespie, \"We Love to Boogie\"]\n\nAfter leaving Gillespie's band, Coltrane played with a lot of important musicians over the next four or five years, like Johnny Hodges, Earl Bostic, and Jimmy Smith, and occasionally sat in with Miles Davis, but at this point he was still not a major musician in the genre. He was a competent, working, sideman, but he was also struggling with alcohol and heroin, and hadn't really found his own voice. But then Miles Davis asked Coltrane to join his band full-time. Coltrane was actually Davis' second choice -- he really wanted Sonny Rollins, who was widely considered the best new tenor player around, but he was eventually persuaded to take Coltrane.\n\nDuring his first period with Davis, Coltrane grew rapidly as a musician, and also played on a *lot* of other people's sessions. In a three year period Coltrane went from Davis to Thelonius Monk's group then back to Davis' group, and also recorded as both a sideman and a band leader on a ton of sessions. You can get a box set of his recordings from May 1956 through December 1958 that comes to nineteen CDs -- and that's not counting the recordings with Miles Davis, which aren't included on that set.\n\nUnsurprisingly, just through playing this much, Coltrane had grown enormously as a player, and he was particularly fascinated by harmonics, playing with the notes of a chord, in arpeggios, and pushing music to its harmonic limits, as you can hear in his solo on Davis' \"Straight, No Chaser\", which pushes the limits of the jazz solo as far as they'd gone to that point:\n\n[Excerpt: Miles Davis, \"Straight, No Chaser\"]\n\nBut on the same album as that, \"Milestones\", we also have the first appearance of a new style, modal jazz. Now, to explain this, we have to go back to the scales again. We looked at the normal Western scale, do-re-mi-fa-so-la-ti-do, but you can start a scale on any of those notes, and which note you start on creates what is called a different mode. The modes are given Greek names, and each mode has a different feel to it. If you start on do, we call this the major scale or the Ionian mode. This is the normal scale we heard before -- C,D,E,F,G,A,B,C:\n\n[demonstrates]\n\nMost music – about seventy percent of the melodies you're likely to have heard, uses that mode. If you start on re, it would go re-mi-fa-so-la-ti-do-re, or D,E,F,G,A,B,C,D, the Dorian mode:\n\n[demonstrates]\n\nMelodies with this mode tend to have a sort of wistful feel, like \"Scarborough Fair\":\n\n[Excerpt: Simon and Garfunkel, \"Scarborough Fair\"]\n\nor many of George Harrison's songs:\n\n[Excerpt: The Beatles, \"I Me Mine\"]\n\nStarting on mi, you have the Phrygian mode, mi-fa-so-la-ti-do-re-mi:\n\n[demonstrates]\n\nThe Phrygian mode is not especially widely used, but does turn up in some popular works like Barber's Adagio for Strings:\n\n[Excerpt: Barber, \"Adagio for Strings\"]\n\nThen there's the Lydian mode, fa-so-la-ti-do-re-mi-fa:\n\n[demonstrates]\n\nThis mode isn't used much at all in pop music -- the most prominent example I can think of is \"Pretty Ballerina\" by the Left Banke:\n\n[Excerpt: The Left Banke, \"Pretty Ballerina\"]\n\nStarting on so, we have so-la-ti-do-re-mi-fa-so -- the Mixolydian mode:\n\n[demonstrates]\n\nThat mode has a sort of bluesy or folky tone to it, and you also find it in a lot of traditional tunes, like \"She Moves Through the Fair\":\n\n[Excerpt: Davey Graham, \"She Moved Thru' The Bizarre/Blue Raga\"]\n\nAnd in things like \"Norwegian Wood\" by the Beatles:\n\n[Excerpt: The Beatles, \"Norwegian Wood\"]\n\nThough that goes into Dorian for the middle section.\n\nStarting on la, we have the Aeolian mode, which is also known as the natural minor scale, and is often just talked about as “the minor scale”:\n\n[demonstrates]\n\nThat's obviously used in innumerable songs, for example \"Losing My Religion\" by REM:\n\n[Excerpt: REM, \"Losing My Religion\"]\n\nAnd finally you have the Locrian mode ti-do-re-mi-fa-so-la-ti:\n\n[demonstrates]\n\nThat basically doesn't get used, unless someone wants to show off that they know the Locrian mode. The only vaguely familiar example I can think of is \"Army of Me\" by Bjork:\n\n[Excerpt: Bjork, \"Army of Me\"]\n\nI hope that brief excursion through the seven most common modes in Western diatonic music gives you some idea of the difference that musical modes can make to a piece.\n\nAnyway, as I was saying, on the \"Milestones\" album, we get some of the first examples of a form that became known as modal jazz. Now, the ideas of modal jazz had been around for a few years at that point -- oddly, it seems to be one of the first types of popular music to have existed in theory before existing in practice. George Russell, an acquaintance of Davis who was a self-taught music theorist, had written a book in 1953 titled The Lydian Chromatic Concept of Tonal Organization. That book argues that rather than looking at the diatonic scale as the basis for music, one should instead look at a chord progression called the circle of fifths. The circle of fifths is exactly what it sounds like -- you change chords to one a fifth away from it, and then do that again and again, either going up, so you'd have chords with the roots C-G-D-A-E-B-F# and so on:\n\n[demonstrates]\n\nOr, more commonly, going down, though usually when going downwards you tend to cheat a bit and sharpen one of the notes so you can stay in one key, so you'd get chords with roots C-F-B-E-A-D-G, usually the chords C, F, B diminished, Em, Am, Dm, G:\n\n[demonstrates]\n\nThat descending cycle of fifths is used in all sorts of music, everything from \"You Never Give Me Your Money\" by the Beatles:\n\n[Excerpt: The Beatles, \"You Never Give Me Your Money\"]\n\nto \"I Will Survive\" by Gloria Gaynor:\n\n[Excerpt: Gloria Gaynor, \"I Will Survive\"]\n\nBut what Russell pointed out is that if you do the upwards cycle of fifths, and you *don't* change any of the notes, the first seven root notes you get are the same seven notes you'd find in the Lydian mode, just reordered -- C-D-E-F#-G-A-B . Russell then argued that much of the way harmony and melody work in jazz could be thought of as people experimenting with the way the Lydian mode works, and the way the cycle of fifths leads you further and further away from the tonal centre.\n\nNow, you could probably do an entire podcast series as long as this one on the implications of this, and I am honestly just trying to summarise enough information here that you can get a vague gist, but Russell's book had a profound effect on how jazz musicians started to think about harmony and melody. Instead of improvising around the chord changes to songs, they were now basing improvisations and compositions around modes and the notes in them. Rather than having a lot of chord changes, you might just play a single root note that stays the same throughout, or only changes a couple of times in the whole piece, and just imply changes with the clash between the root note and whatever modal note the solo instrument is playing.\n\nThe track \"Milestones\" on the Milestones album shows this kind of thinking in full effect -- the song consists of a section in G Dorian, followed by a section in A Aeolian (or E Phrygian depending on how you look at it). Each section has only one implied chord -- a Gm7 for the G Dorian section, and an Am7(b13) for the A Aeolian section -- over which Davis, Cannonball Adderley on alto sax, and Coltrane on tenor, all solo:\n\n[Excerpt: Miles Davis, \"Milestones\"]\n\n(For the pedants among you, that track was originally titled \"Miles\" on the first pressings of the album, but it was retitled \"Milestones\" on subsequent pressings).\n\nThe modal form would be taken even further on Davis' next album to be recorded, Porgy and Bess, which featured much fuller orchestrations and didn't have Coltrane on it. Davis later said that when the arranger Gil Evans wrote the arrangements for that album, he didn't write any chords at all, just a scale, which Davis could improvise around. But it was on the album after that, Kind of Blue, which again featured Coltrane on saxophone, that modal jazz made its big breakthrough to becoming the dominant form of jazz music.\n\nAs with what Evans had done on Porgy and Bess, Davis gave the other instrumentalists modes to play, rather than a chord sequence to improvise over or a melody line to play with. He explained his thinking behind this in an interview with Nat Hentoff, saying \"When you're based on chords, you know at the end of 32 bars that the chords have run out and there's nothing to do but repeat what you've just done—with variations. I think a movement in jazz is beginning away from the conventional string of chords ... there will be fewer chords but infinite possibilities as to what to do with them.\"\n\nThis style shows up in \"So What\", the opening track on the album, which is in some ways a very conventional song structure -- it's a thirty-two bar AABA structure. But instead of a chord sequence, it's based on modes in two keys -- the A section is in D Dorian, while the B section is in E-flat Dorian:\n\n[Excerpt: Miles Davis, \"So What\"]\n\nKind of Blue would become one of the contenders for greatest jazz album of all time, and one of the most influential records ever made in any genre -- and it could be argued that that track we just heard, \"So What\", inspired a whole other genre we'll be looking at in a future episode -- but Coltrane still felt the need to explore more ideas, and to branch out on his own.\n\nIn particular, while he was interested in modal music, he was also interested in exploring more kinds of scales than just modes, and to do this he had to, at least for the moment, reintroduce chord changes into what he was doing. He was inspired in particular by reading Nicolas Slonimsky's classic Thesaurus of Scales and Melodic Patterns.\n\nColtrane had recently signed a new contract as a solo artist with Atlantic Records, and recorded what is generally considered his first true masterpiece album as a solo artist, Giant Steps, with several members of the Davis band, just two weeks after recording Kind of Blue.\n\nThe title track to Giant Steps is the most prominent example of what are known in jazz as the Coltrane changes -- a cycle of thirds, similar to the cycle of fifths we talked about earlier. The track itself seems to have two sources. The first is the bridge of the old standard \"Have You Met Miss Jones?\", as famously played by Coleman Hawkins:\n\n[Excerpt: Coleman Hawkins, \"Have You Met Miss Jones?\"\n\nAnd the second is an exercise from Slonimsky's book:\n\n[Excerpt: Pattern #286 from Thesaurus of Scales and Melodic Patterns]\n\nColtrane combined these ideas to come up with \"Giant Steps\", which is based entirely around these cycles of thirds, and Slonimsky's example:\n\n[Excerpt: John Coltrane, \"Giant Steps\"]\n\nNow, I realise that this is meant to be a history of rock music, not jazz musicology theory time, so I promise you I am just hitting the high points here. And only the points that affect Coltrane's development as far as it influenced the music we're looking at in this episode. And so we're actually going to skip over Coltrane's commercial high-point, My Favourite Things, and most of the rest of his work for Atlantic, even though that music is some of the most important jazz music ever recorded.\n\nInstead, I'm going to summarise a whole lot of very important music by simply saying that while Coltrane was very interested in this musical idea of the cycle of thirds, he did not like being tied to precise chord changes, and liked the freedom that modal jazz gave to him. By 1960, when his contract with Atlantic was ending and his contract with Impulse was beginning, and he recorded the two albums Olé and Africa/Brass pretty much back to back, he had hit on a new style with the help of Eric Dolphy, a flute, clarinet, and alto sax player who would become an important figure in Coltrane's life. Dolphy died far too young -- he went into a diabetic coma and doctors assumed that because he was a Black jazz musician he must have overdosed, even though he was actually a teetotal abstainer, so he didn't get the treatment he needed -- but he made such a profound influence on Coltrane's life that Coltrane would carry Dolphy's picture with him after his death.\n\nDolphy was even more of a theorist than Coltrane, and another devotee of Slonimsky's book, and he was someone who had studied a great deal of twentieth-century classical music, particularly people like Bartok, Messiaen, Stravinsky, Charles Ives, and Edgard Varese. Dolphy even performed Varese's piece Density 21.5 in concert, an extremely demanding piece for solo flute. I don't know of a recording of Dolphy performing it, sadly, but this version should give some idea:\n\n[Excerpt: Edgard Varese, \"Density 21.5\"]\n\nEncouraged by Dolphy, Coltrane started making music based around no changes at all, with any changes being implied by the melody. The title song of Africa/Brass, \"Africa\", takes up an entire side of one album, and doesn't have a single actual chord change on it, with Dolphy and pianist McCoy Tyner coming up with a brass-heavy arrangement for Coltrane to improvise over a single chord:\n\n[Excerpt: The John Coltrane Quartet: \"Africa\"]\n\nThis was a return to the idea of modal jazz, based on scales rather than chord changes, but by implying chord changes, often changes based on thirds, Coltrane was often using different scales than the modes that had been used in modal jazz.\n\nAnd while, as the title suggested, \"Africa\" was inspired by the music of Africa, the use of a single drone chord underneath solos based on a scale was inspired by the music of another continent altogether.\n\nSince at least the mid-1950s, both Coltrane and Dolphy had been interested in Indian music. They appear to have first become interested in a record released by Folkways, Music Of India, Morning And Evening Ragas by Ali Akbar Khan:\n\n[Excerpt: Ali Akbar Khan, \"Rag Sindhi Bhairavi\"]\n\nBut the musician they ended up being most inspired by was a friend of Khan's, Ravi Shankar, who like Khan had been taught by the great sarod player Alauddin Khan, Ali Akbar Khan's father. The elder Khan, who was generally known as \"Baba\", meaning \"father\", was possibly *the* most influential Indian musician of the first half of the twentieth century, and was a big part of the revitalisation of Indian music that went hand in hand with the growth of Indian nationalism. He was an ascetic who lived for music and nothing else, and would write five to ten new compositions every day, telling Shankar \"Do one thing well and you can achieve everything. Do everything and you achieve nothing\".\n\nAlauddin Khan was a very religious Muslim, but one who saw music as the ultimate way to God and could find truths in other faiths. When Shankar first got to know him, they were both touring as musicians in a dance troupe run by Shankar's elder brother, which was promoting Indian arts in the West, and he talked about taking Khan to hear the organ playing at Notre Dame cathedral, and Khan bursting into tears and saying \"here is God\".\n\nKhan was not alone in this view. The classical music of Northern India, the music that Khan played and taught, had been very influenced by Sufism, which was for most of Muslim history the dominant intellectual and theological tradition in Islam. Now, I am going to sum up a thousand years of theology and practice, of a religion I don't belong to, in a couple of sentences here, so just assume that what I'm saying is wrong, and *please* don't take offence if you are Sufi yourself and believe I am misrepresenting you. But my understanding of Sufism is that Sufis are extremely devoted to attaining knowledge and understanding of God, and believe that strict adherence to Muslim law is the best way to attain that knowledge -- that it is the way that God himself has prescribed for humans to know him -- but that such knowledge can be reached by people of other faiths if they approach their own traditions with enough devotion. Sufi ideas infuse much of Northern Indian classical music, and so for example it has been considered acceptable for Muslims to sing Hindu religious music and Hindus to sing songs of praise to Allah.\n\nSo while Ravi Shankar was Hindu and Alauddin Khan was Muslim, Khan was able to become Shankar's guru in what both men regarded as a religious observance, and even to marry Khan's daughter. Khan was a famously cruel disciplinarian -- once hospitalising a student after hitting him with a tuning hammer -- but he earned the devotion of his students by enforcing the same discipline on himself. He abstained from sex so he could put all his energies into music, and was known to tie his hair to the ceiling while he practiced, so he could not fall asleep no matter how long he kept playing.\n\nBoth Khan and his son Ali Akhbar Khan played the sarod, while Shankar played the sitar, but they all played the same kind of music, which is based on the concept of the raga.\n\nNow, in some ways, a raga can be considered equivalent to a mode in Western music:\n\n[Excerpt: Ali Akbar Khan, \"Rag Sindhi Bhairavi\"]\n\nBut a raga is not *just* a mode -- it sits somewhere between Western conceptions of a mode and a melody. It has a scale, like a mode, but it can have different scales going up or down, and rules about which notes can be moved to from which other notes. So for example (and using Western tones so as not to confuse things further), a raga might say that it's possible to move up from the note G to D, but not down from D to G.\n\nRagas are essentially a very restrictive set of rules which allow the musician playing them to improvise freely within those rules.\n\nIn the late 1940s and early 1950s, the violinist Yehudi Mehuin, at the time the most well-known classical musician in the world, had become fascinated by Indian music as part of a wider programme of his to learn more music outside what he regarded as the overly-constricting scope of the Western classical tradition in which he had been trained. He had become a particular fan of Shankar, and had invited him over to the US to perform. Shankar had refused to come at that point, sending his brother-in-law Ali Akbar Khan over, as he was in the middle of a difficult divorce, and that had been when Khan had recorded that album which had fascinated Coltrane and Dolphy. But Shankar soon followed himself, and made his own records:\n\n[Excerpt: Ravi Shankar, \"Raga Hamsadhwani\"]\n\nThe music that both Khan and Shankar played was a particular style of Hindustani classical music, which has three elements -- there's a melody instrument, in Shankar's case the sitar and in Khan's the sarod, both of them fretted stringed instruments which have additional strings that resonate along with the main melody string, giving their unique sound. These are the most distinctive Indian instruments, but the melody can be played on all sorts of other instruments, whether Indian instruments like the bansuri and shehnai, which are very similar to the flute and oboe respectively, or Western instruments like the violin. Historically, the melody has also often been sung rather than played, but Indian instrumental music has had much more influence on Western popular music than Indian vocal music has, so we're mostly looking at that here.\n\nAlong with the melody instrument there's a percussion instrument, usually the tabla, which is a pair of hand drums. Rather than keep a steady, simple, beat like the drum kit in rock music, the percussion has its own patterns and cycles, called talas, which like ragas are heavily formalised but leave a great amount of room for improvisation. The percussion and the melody are in a sort of dialogue with each other, and play off each other in a variety of ways.\n\nAnd finally there's the drone instrument, usually a stringed instrument called a tamboura. The drone is what it sounds like -- a single note, sustained and repeated throughout the piece, providing a harmonic grounding for the improvisations of the melody instrument. Sometimes, rather than just a single root note, it will be a root and fifth, providing a single chord to improvise over, but as often it will be just one note. Often that note will be doubled at the octave, so you might have a drone on both low E and high E.\n\nThe result provides a very strict, precise, formal, structure for an infinitely varied form of expression, and Shankar was a master of it:\n\n[Excerpt: Ravi Shankar, \"Raga Hamsadhwani\"]\n\nDolphy and, especially, Coltrane became fascinated by Indian music, and Coltrane desperately wanted to record with Shankar -- he even later named his son Ravi in honour of the great musician. It wasn't just the music as music, but music as spiritual practice, that Coltrane was engaged with. He was a deeply religious man but one who was open to multiple faith traditions -- he had been brought up as a Methodist, and both his grandfathers were ministers in the African Methodist Episcopal Zion Church, but his first wife, Naima, who inspired his personal favourite of his own compositions, was a Muslim, while his second wife, Swamini Turiyasangitananda (who he married after leaving Naima in 1963 and who continued to perform as Alice Coltrane even after she took that name, and was herself an extraordinarily accomplished jazz musician on both piano and harp), was a Hindu, and both of them profoundly influenced Coltrane's own spirituality. Some have even suggested that Coltrane's fascination with a cycle of thirds came from the idea that the third could represent both the Christian Trinity and the Hindu trimurti -- the three major forms of Brahman in Hinduism, Brahma, Vishnu, and Shiva.\n\nSo a music which was a religious discipline for more than one religion, and which worked well with the harmonic and melodic ideas that Coltrane had been exploring in jazz and learning about through his studies of modern classical music, was bound to appeal to Coltrane, and he started using the idea of having two basses provide an octave drone similar to that of the tamboura, leading to tracks like \"Africa\" and \"Olé\":\n\n[Excerpt: John Coltrane, \"Olé\"]\n\nSeveral sources have stated that that song was an influence on \"Light My Fire\" by the Doors, and I can sort of see that, though most of the interviews I've seen with Ray Manzarek have him talking about Coltrane's earlier version of \"My Favourite Things\" as the main influence there.\n\nColtrane finally managed to meet with Shankar in December 1961, and spent a lot of time with him -- the two discussed recording an album together with McCoy Tyner, though nothing came of it. Shankar said of their several meetings that month: \"The music was fantastic. I was much impressed, but one thing distressed me. There was turbulence in the music that gave me a negative feeling at times, but I could not quite put my finger on the trouble … Here was a creative person who had become a vegetarian, who was studying yoga, and reading the Bhagavad-Gita, yet in whose music I still heard much turmoil. I could not understand it.\"\n\nColtrane said in turn \"I like Ravi Shankar very much. When I hear his music, I want to copy it – not note for note of course, but in his spirit. What brings me closest to Ravi is the modal aspect of his art. Currently, at the particular stage I find myself in, I seem to be going through a modal phase … There’s a lot of modal music that is played every day throughout the world. It is particularly evident in Africa, but if you look at Spain or Scotland, India or China, you’ll discover this again in each case … It’s this universal aspect of music that interests me and attracts me; that’s what I’m aiming for.\"\n\nAnd the month before Coltrane met Shankar, Coltrane had had a now-legendary residency at the Village Vanguard in New York with his band, including Dolphy, which had resulted not only in the famous Live at the Village Vanguard album, but in two tracks on Coltrane's studio album Impressions.\n\nThose shows were among the most controversial in the history of jazz, though the Village Vanguard album is now often included in lists of the most important records in jazz. Downbeat magazine, the leading magazine for jazz fans at the time, described those shows as \"musical nonsense\" and \"a horrifying demonstration of what appears to be a growing anti-jazz trend\" -- though by the time Impressions came out in 1963, that opinion had been revised somewhat. Harvey Pekar, the comic writer and jazz critic, also writing in DownBeat, gave Impressions five stars, saying \"Not all the music on this album is excellent (which is what a five-star rating signifies,) but some is more than excellent\".\n\nAnd while among Coltrane fans the piece from these Village Vanguard shows that is of most interest is the extended blues masterpiece \"Chasin' the Trane\" which takes up a whole side of the Village Vanguard LP, for our purposes we're most interested in one of the two tracks that was held over for Impressions. This was another of Coltrane's experiments in using the drones he'd found in Indian musical forms, like \"Africa\" and \"Olé\". This time it was also inspired by a specific piece of music, though not an instrumental one. Rather it was a vocal performance -- a recording on a Folkways album of Pandita Ramji Shastri Dravida chanting one of the Vedas, the religious texts which are among the oldest texts sacred to any surviving religion:\n\n[Excerpt: Pandita Ramji Shastri Dravida, \"Vedic Chanting\"]\n\nColtrane took that basic melodic idea, and combined it with his own modal approach to jazz, and the inspiration he was taking from Shankar's music, and came up with a piece called \"India\":\n\n[Excerpt: John Coltrane, \"India\"]\n\nWhich is where we came in, isn't it?\n\n[Excerpt: The Byrds, \"Eight Miles High\"]\n\nSo now, finally, we get to the Byrds.\n\nEven before \"Mr. Tambourine Man\" went to number one in the charts, the Byrds were facing problems with their sound being co-opted as the latest hip thing. Their location in LA, at the centre of the entertainment world, was obviously a huge advantage to them in many ways, but it also made them incredibly visible to people who wanted to hop onto a bandwagon. The group built up much of their fanbase playing at Ciro's -- the nightclub on the Sunset Strip that we mentioned in the previous episode which later reopened as It's Boss -- and among those in the crowd were Sonny and Cher. And Sonny brought along his tape recorder.\n\nThe Byrds' follow-up single to \"Mr. Tambourine Man\", released while that song was still going up the charts, was another Dylan song, \"All I Really Want to Do\". But it had to contend with this:\n\n[Excerpt: Cher, \"All I Really Want to Do\"]\n\nCher's single, produced by Sonny, was her first solo single since the duo had become successful, and came out before the Byrds' version, and the Byrds were convinced that elements of the arrangement, especially the guitar part, came from the version they'd been performing live – though of course Sonny was no stranger to jangly guitars himself, having co-written “Needles and Pins”, the song that pretty much invented the jangle. Cher made number fifteen on the charts, while the Byrds only made number forty. Their version did beat Cher's in the UK charts, though.\n\nThe record company was so worried about the competition that for a while they started promoting the B-side as the A-side. That B-side was an original by Gene Clark, though one that very clearly showed the group's debt to the Searchers:\n\n[Excerpt: The Byrds, \"I'll Feel a Whole Lot Better\"]\n\nWhile it was very obviously derived from the Searchers' version of \"Needles and Pins\", especially the riff, it was still a very strong, original, piece of work in its own right. It was the song that convinced the group's producer, Terry Melcher, that they were a serious proposition as artists in their own right, rather than just as performers of Dylan's material, and it was also a favourite of the group's co-manager, Jim Dickson, who picked out Clark's use of the word \"probably\" in the chorus as particularly telling -- the singer thinks he will feel better when the subject of the song is gone, but only probably. He's not certain.\n\n\"I'll Feel a Whole Lot Better\", after being promoted as the A-side for a short time, reached number one hundred and two on the charts, but the label quickly decided to re-flip it and concentrate on promoting the Dylan song as the single.\n\nThe group themselves weren't too bothered about their thunder having been stolen by Sonny and Cher, but their new publicist was incandescent. Derek Taylor had been a journalist for the Daily Express, which at that time was a respectable enough newspaper (though that is very much no longer the case). He'd become involved in the music industry after writing an early profile on the Beatles, at which point he had been taken on by the Beatles' organisation first to ghostwrite George Harrison's newspaper column and Brian Epstein's autobiography, and then as their full-time publicist and liner-note writer. He'd left the organisation at the end of 1964, and had moved to the US, where he had set up as an independent music publicist, working for the Byrds, the Beach Boys, and various other acts in their overlapping social circles, such as Paul Revere and the Raiders.\n\nTaylor was absolutely furious on the group's behalf, saying \"I was not only disappointed, I was disgusted. Sonny and Cher went to Ciro's and ripped off the Byrds and, being obsessive, I could not get this out of my mind that Sonny and Cher had done this terrible thing. I didn't know that much about the record business and, in my experience with the Beatles, cover versions didn't make any difference. But by covering the Byrds, it seemed that you could knock them off the perch. And Sonny and Cher, in my opinion, stole that song at Ciro's and interfered with the Byrds' career and very nearly blew them out of the game.\"\n\nBut while the single was a comparative flop, the Mr. Tambourine Man album, which came out shortly after, was much more successful. It contained the A and B sides of both the group's first two singles, although a different vocal take of \"All I Really Want to Do\" was used from the single release, along with two more Dylan covers, and a couple more originals -- five of the twelve songs on the album were original in total, three of them Gene Clark solo compositions and the other two co-written by Clark and Roger McGuinn. To round it out there was a version of the 1939 song \"We'll Meet Again\", made famous by Vera Lynn, which you may remember us discussing in episode ninety as an example of early synthesiser use, but which had recently become popular in a rerecorded version from the 1950s, thanks to its use at the end of Dr. Strangelove; there was a song written by Jackie DeShannon; and \"The Bells of Rhymney\", a song in which Pete Seeger set a poem about a mining disaster in Wales to music.\n\nSo a fairly standard repertoire for early folk-rock, though slightly heavier on Dylan than most.\n\nWhile the group's Hollywood notoriety caused them problems like the Sonny and Cher one, it did also give them advantages. For example, they got to play at the fourth of July party hosted by Jane Fonda, to guests including her father Henry and brother Peter, Louis Jordan, Steve McQueen, Warren Beatty, and Sidney Poitier. Derek Taylor, who was used to the Beatles' formal dress and politeness at important events, imposed on them by Brian Epstein, was shocked when the Byrds turned up informally dressed, and even more shocked when Vito Paulekas and Carl Franzoni showed up.\n\nVito (who was always known by his first name) and Franzoni are both important but marginal figures in the LA scene. Neither were musicians, though Vito did make one record, produced by Kim Fowley:\n\n[Excerpt: Vito and the Hands, \"Vito and the Hands\"]\n\nRather Vito was a sculptor in his fifties, who had become part of the rock and roll scene and had gathered around him a dance troupe consisting largely of much younger women, and also of himself and Franzoni. Their circle, which also included Arthur Lee and Bryan MacLean, who weren't part of their dance troupe but were definitely part of their crowd, will be talked about much more in future episodes, but for now we'll just say that they are often considered proto-hippies, though they would have disputed that characterisation themselves quite vigorously; that they were regular dancers at Ciro's and became regular parts of the act of both the Byrds and the Mothers of Invention; and we'll give this rather explicit description of their performances from Frank Zappa:\n\n\"The high point of the performance was Carl Franzoni, our 'go-go boy.' He was wearing ballet tights, frugging violently. Carl has testicles which are bigger than a breadbox. Much bigger than a breadbox. The looks on the faces of the Baptist teens experiencing their grandeur is a treasured memory.\"\n\nPaints a vivid picture, doesn't it? So you can possibly imagine why Derek Taylor later said \"When Carl Franzoni and Vito came, I got into a terrible panic\". But Jim Dickson explained to him that it was Hollywood and people were used to that kind of thing, and even though Taylor described seeing Henry Fonda and his wife pinned against the wall by the writhing Franzoni and the other dancers, apparently everyone had a good time.\n\nAnd then the next month, the group went on their first UK tour. On which nobody had a good time:\n\n[Excerpt: The Byrds, \"Eight Miles High\"]\n\nEven before the tour, Derek Taylor had reservations. Obviously the Byrds should tour the UK -- London, in particular, was the centre of the cultural world at that time, and Taylor wanted the group to meet his old friends the Beatles and visit Carnaby Street. But at the same time, there seemed to be something a little... off... about the promoters they were dealing with, Joe Collins, the father of Joan and Jackie Collins, and a man named Mervyn Conn. As Taylor said later \"All I did know was that the correspondence from Mervyn Conn didn't assure me. I kept expressing doubts about the contents of the letters. There was something about the grammar. You know, 'I'll give you a deal', and 'We'll get you some good gigs'. The whole thing was very much showbusiness. Almost pantomime showbusiness.\"\n\nBut still, it seemed like it was worth making the trip, even when Musicians Union problems nearly derailed the whole thing. We've talked previously about how disagreements between the unions in the US and UK meant that musicians from one country couldn't tour the other for decades, and about how that slightly changed in the late fifties. But the new system required a one-in, one-out system where tours had to be set up as exchanges so nobody was taking anyone's job, and nobody had bothered to find a five-piece group of equivalent popularity to the Byrds to tour America in return. Luckily, the Dave Clark Five stepped into the breach, and were able to do a US tour on short notice, so that problem was solved.\n\nAnd then, as soon as they landed, the group were confronted with a lawsuit. From the Birds:\n\n[Excerpt: The Birds, \"No Good Without You Baby\"]\n\nThese Birds, spelled with an \"i\", not a \"y\", were a Mod group from London, who had started out as the Thunderbirds, but had had to shorten their name when the London R&B singer Chris Farlowe and his band the Thunderbirds had started to have some success. They'd become the Birds, and released a couple of unsuccessful singles, but had slowly built up a reasonable following and had a couple of TV appearances. Then they'd started to receive complaints from their fans that when they went into the record shops to ask for the new record by the Birds, they were being sold some jangly folky stuff about tambourines, rather than Bo Diddley inspired R&B.\n\nSo the first thing the American Byrds saw in England, after a long and difficult flight which had left them very tired and depressed, especially Gene Clark, who hated flying, was someone suing them for loss of earnings.\n\nThe lawsuit never progressed any further, and the British group changed their name to Birds Birds, and quickly disappeared from music history -- apart from their guitarist, Ronnie Wood, who we'll be hearing from again. But the experience was not exactly the welcome the group had been hoping for, and is reflected in one of the lines that Gene Clark wrote in the song he later came up with about the trip -- \"Nowhere is there love to be found among those afraid of losing their ground\".\n\nAnd the rest of the tour was not much of an improvement. Chris Hillman came down with bronchitis on the first night, David Crosby kept turning his amp up too high, resulting in the other members copying him and the sound in the venues they were playing seeming distorted, and most of all they just seemed, to the British crowds, to be unprofessional. British audiences were used to groups running on, seeming excited, talking to the crowd between songs, and generally putting on a show. The Byrds, on the other hand, sauntered on stage, and didn't even look at the audience, much less talk to them. What seemed to the LA audience as studied cool seemed to the UK audience like the group were rude, unprofessional, and big-headed. At one show, towards the end of the set, one girl in the audience cried out \"Aren't you even going to say anything?\", to which Crosby responded \"Goodbye\" and the group walked off, without any of them having said another word. When they played the Flamingo Club, the biggest cheer of the night came when their short set ended and the manager said that the club was now going to play records for dancing until the support act, Geno Washington and the Ramjam Band, were ready to do another set.\n\nMichael Clarke and Roger McGuinn also came down with bronchitis, the group were miserable and sick, and they were getting absolutely panned in the reviews. The closest thing they got to a positive review was when Paul Jones of Manfred Mann was asked about them, and he praised some of their act -- perceptively pointing to their version of \"We'll Meet Again\" as being in the Pop Art tradition of recontextualising something familiar so it could be looked at freshly -- but even he ended up also criticising several aspects of the show and ended by saying \"I think they're going to be a lot better in the future\".\n\nAnd then, just to rub salt in the wound, Sonny and Cher turned up in the UK. The Byrds' version of \"All I Really Want to Do\" massively outsold theirs in the UK, but their big hit became omnipresent:\n\n[Excerpt: Sonny and Cher, \"I Got You Babe\"]\n\nAnd the press seemed to think that Sonny and Cher, rather than the Byrds, were the true representatives of the American youth culture. The Byrds were already yesterday's news.\n\nThe tour wasn't all bad -- it did boost sales of the group's records, and they became friendly with the Beatles, Stones, and Donovan. So much so that when later in the month the Beatles returned to the US, the Byrds were invited to join them at a party they were holding in Benedict Canyon, and it was thanks to the Byrds attending that party that two things happened to influence the Beatles' songwriting. The first was that Crosby brought his Hollywood friend Peter Fonda along. Fonda kept insisting on telling people that he knew what it was like to actually be dead, in a misguided attempt to reassure George Harrison, who he wrongly believed was scared of dying, and insisted on showing them his self-inflicted bullet wounds.\n\nThis did not go down well with John Lennon and George Harrison, both of whom were on acid at the time. As Lennon later said, \"We didn't want to hear about that! We were on an acid trip and the sun was shining and the girls were dancing and the whole thing was beautiful and Sixties, and this guy – who I really didn't know; he hadn't made Easy Rider or anything – kept coming over, wearing shades, saying, \"I know what it's like to be dead,\" and we kept leaving him because he was so boring! ... It was scary. You know ... when you're flying high and [whispers] \"I know what it's like to be dead, man\"\n\nEventually they asked Fonda to get out, and the experience later inspired Lennon to write this:\n\n[Excerpt: The Beatles, \"She Said, She Said\"]\n\nIncidentally, like all the Beatles songs of that period, that was adapted for the cartoon TV series based on the group, in this case as a follow-the-bouncing-ball animation. There are few things which sum up the oddness of mid-sixties culture more vividly than the fact that there was a massively popular kids' cartoon with a cheery singalong version of a song about a bad acid trip and knowing what it's like to be dead.\n\nBut there was another, more positive, influence on the Beatles to come out of them having invited the Byrds to the party. Once Fonda had been kicked out, Crosby and Harrison became chatty, and started talking about the sitar, an instrument that Harrison had recently become interested in. Crosby showed Harrison some ragas on the guitar, and suggested he start listening to Ravi Shankar, who Crosby had recently become a fan of. And we'll be tracking Shankar's influence on Harrison, and through him the Beatles, and through them the whole course of twentieth century culture, in future episodes.\n\nCrosby's admiration both of Ravi Shankar and of John Coltrane was soon to show in the Byrds' records, but first they needed a new single. They'd made attempts at a version of \"The Times They Are A-Changin'\", and had even tried to get both George Harrison and Paul McCartney to add harmonica to that track, but that didn't work out. Then just before the UK tour, Terry Melcher had got Jack Nitzsche to come up with an arrangement of Dylan's \"It's All Over Now, Baby Blue\":\n\n[Excerpt: The Byrds, \"It's All Over Now, Baby Blue (version 1)\"]\n\nNitzsche's arrangement was designed to sound as much like a Sonny and Cher record as possible, and at first the intention was just to overdub McGuinn's guitar and vocals onto a track by the Wrecking Crew. The group weren't happy at this, and even McGuinn, who was the friendliest of the group with Melcher and who the record was meant to spotlight, disliked it. The eventual track was cut by the group, with Jim Dickson producing, to show they could do a good job of the song by themselves, with the intention that Melcher would then polish it and finish it in the studio, but Melcher dropped the idea of doing the song at all.\n\nThere was a growing factionalism in the group by this point, with McGuinn and to a lesser extent Michael Clarke being friendly with Melcher. Crosby disliked Melcher and was pushing for Jim Dickson to replace him as producer, largely because he thought that Melcher was vetoing Crosby's songs and giving Gene Clark and Roger McGuinn free run of the songwriting. Dickson on the other hand was friendliest with Crosby, but wasn't much keener on Crosby's songwriting than Melcher was, thinking Gene Clark was the real writing talent in the group. It didn't help that Crosby's songs tended to be things like harmonically complex pieces based on science fiction novels -- Crosby was a big fan of the writer Robert Heinlein, and in particular of the novel Stranger in a Strange Land, and brought in at least two songs inspired by that novel, which were left off albums -- his song \"Stranger in a Strange Land\" was eventually recorded by the San Francisco group Blackburn & Snow:\n\n[Excerpt: Blackburn & Snow, \"Stranger in a Strange Land\"]\n\nOddly, Jim Dickson objected to what became the Byrds' next single for reasons that come from the same roots as the Heinlein novel. A short while earlier, McGuinn had worked as a guitarist and arranger on an album by the folk singer Judy Collins, and one of the songs she had recorded on that album was a song written by Pete Seeger, setting the first eight verses of chapter three of the Biblical book of Ecclesiastes to music:\n\n[Excerpt: Judy Collins, \"Turn Turn Turn (To Everything There is a Season\"]\n\nMcGuinn wanted to do an electric version of that song as the Byrds' next single, and Melcher sided with him, but Dickson was against the idea, citing the philosopher Alfred Korzybski, who was a big influence both on the counterculture and on Heinlein. Korzybski, in his book Science and Sanity, argued that many of the problems with the world are caused by the practice in Aristotelean logic of excluding the middle and only talking about things and their opposites, saying that things could be either A or Not-A, which in his view excluded most of actual reality. Dickson's argument was that the lyrics to “Turn! Turn! Turn!” with their inflexible Aristotelianism, were hopelessly outmoded and would make the group a laughing stock among anyone who had paid attention to the intellectual revolutions of the previous few decades. \"A time of love, a time of hate\"? What about all the times that are neither for loving or hating, and all the emotions that are complex mixtures of love and hate? In his eyes, this was going to make the group look like lightweights.\n\nTerry Melcher disagreed, and forced the group through take after take, until they got what became the group's second number one hit:\n\n[Excerpt: The Byrds, \"Turn! Turn! Turn!\"]\n\nAfter the single was released and became a hit, the battle lines in the group hardened. It was McGuinn and Melcher on one side, Crosby and Dickson on the other, with Chris Hillman, Michael Clarke, and Gene Clark more or less neutral in the middle, but tending to side more and more with the two Ms largely because of Crosby's ability to rub everyone up the wrong way.\n\nAt one point during the sessions for the next album, tempers flared so much that Michael Clarke actually got up, went over to Crosby, and punched Crosby so hard that he fell off his seat. Crosby, being Hollywood to the bone, yelled at Clarke \"You'll never work in this town again!\", but the others tended to agree that on that occasion Crosby had it coming. Clarke, when asked about it later, said \"I slapped him because he was being an asshole. He wasn't productive. It was necessary.\"\n\nThings came to a head in the filming for a video for the next single, Gene Clark's \"Set You Free This Time\". Michael Clarke was taller than the other Byrds, and to get the shot right, so the angles would line up, he had to stand further from the camera than the rest of them. David Crosby -- the member with most knowledge of the film industry, whose father was an Academy Award-winning cinematographer, so who definitely understood the reasoning for this -- was sulking that once again a Gene Clark song had been chosen for promotion rather than one of his songs, and started manipulating Michael Clarke, telling him that he was being moved backwards because the others were jealous of his good looks, and that he needed to move forward to be with the rest of them.\n\nMultiple takes were ruined because Clarke listened to Crosby, and eventually Jim Dickson got furious at Clarke and went over and slapped him on the face. All hell broke loose. Michael Clarke wasn't particularly bothered by being slapped by Dickson, but Crosby took that as an excuse to leave, walking off before the first shot of the day had been completed. Dickson ran after Crosby, who turned round and punched Dickson in the mouth. Dickson grabbed hold of Crosby and held him in a chokehold. Gene Clark came up and pulled Dickson off Crosby, trying to break up the fight, and then Crosby yelled \"Yeah, that's right, Gene! Hold him so I can hit him again!\"\n\nAt this point if Clark let Dickson go, Dickson would have attacked Crosby again. If he held Dickson, Crosby would have taken it as an invitation to hit him more. Clark's dilemma was eventually relieved by Barry Feinstein, the cameraman, who came in and broke everything up.\n\nIt may seem odd that Crosby and Dickson, who were on the same side, were the ones who got into a fight, while Michael Clarke, who had previously hit Crosby, was listening to Crosby over Dickson, but that's indicative of how everyone felt about Crosby. As Dickson later put it, \"People have stronger feelings about David Crosby. I love David more than the rest and I hate him more than the rest. I love McGuinn the least, and I hate him the least, because he doesn't give you emotional feedback. You don't get a chance. The hate is in equal proportion to how much you love them.\"\n\nMcGuinn was finding all this deeply distressing -- Dickson and Crosby were violent men, and Michael Clarke and Hillman could be provoked to violence, but McGuinn was a pacifist both by conviction and temperament. Everything was conspiring to push the camps further apart. For example, Gene Clark made more money than the rest because of his songwriting royalties, and so got himself a good car. McGuinn had problems with his car, and knowing that the other members were jealous of Clark, Melcher offered to lend McGuinn one of his own Cadillacs, partly in an attempt to be friendly, and partly to make sure the jealousy over Clark's car didn't cause further problems in the group.\n\nBut, of course, now Gene Clark had a Ferrarri and Roger McGuinn had a Cadillac, where was David Crosby's car? He stormed into Dickson's office and told him that if by the end of the tour the group were going on, Crosby didn't have a Bentley, he was quitting the group.\n\nThere was only one thing for it. Terry Melcher had to go. The group had recorded their second album, and if they couldn't fix the problems within the band, they would have to deal with the problems from outside. While the group were on tour, Jim Dickson told Melcher they would no longer be working with him as their producer.\n\nOn the tour bus, the group listened over and over to a tape McGuinn had made of Crosby's favourite music. On one side was a collection of recordings of Ravi Shankar, and on the other was two Coltrane albums -- Africa/Brass and Impressions:\n\n[Excerpt: John Coltrane, \"India\"]\n\nThe group listened to this, and basically no other music, on the tour, and while they were touring Gene Clark was working on what he hoped would be the group's next single -- an impressionistic song about their trip to the UK, which started \"Six miles high and when you touch down, you'll find that it's stranger than known\". After he had it half complete, he showed it to Crosby, who helped him out with the lyrics, coming up with lines like \"Rain, grey town, known for its sound\" to describe London. The song talked about the crowds that followed them, about the music -- namechecking the Small Faces, who at the time had only released two singles and had one minor UK hit -- and about the feeling of being lost and a stranger in a strange land.\n\nThe pair then brought the song to McGuinn, who made two further changes -- he suggested that while \"six miles high\" was an accurate description of how far up a transatlantic flight gets, eight was a better number than six, partly for numerological reasons, partly because it just sounded good, and partly because the Beatles had used it for \"Eight Days a Week\".\n\nThe other major change that McGuinn made was to suggest that they incorporate some of the music they'd been listening to. While the song had chord changes, they decided to make it sound more droning, and also to have McGuinn play a guitar intro that was very closely based on Coltrane's \"India\".\n\nThe group were all thrilled with the song, and recorded it in RCA Studios on December the twenty-second, 1965:\n\n[Excerpt: The Byrds, \"Eight Miles High (version 1)\"]\n\nThey were convinced it was going to be a hit, but Columbia Records wouldn't put it out. Not because of the experimental music, nor because of the double meaning of the word \"high\", but because it had been recorded in RCA Studios, and Columbia would only release music recorded in their own studios. So they went back a month later and remade the track, with Columbia West Coast Vice President Allen Stanton as nominal producer. None of the group thought that that was as good a recording, but it was the one that finally got released:\n\n[Excerpt: The Byrds, \"Eight Miles High\"]\n\nThe song got banned by many radio stations for promoting drug use -- though at the time the group insisted that it was really about flying rather than drugs, but later they did admit the obvious fact that it was also very much a drug-influenced song. The publicity for the song called it \"raga rock\", and described the B-side, a Shankar-influenced song by Crosby, the same way. But \"Eight Miles High\" is now widely regarded as one of the first examples, if not the first example, of psychedelic rock. Of course, as we've said many times on this podcast, there is no actual first example of anything, but \"Eight Miles High\" was, if nothing else, an early example of the style. It sounded like nothing else on the radio at the time.\n\n[Excerpt: The Byrds, “Eight Miles High”]\n\nBut despite that, it made number fifteen on the charts, their third top twenty hit. The Byrds had proved they could have a hit without Terry Melcher.\n\nBut as it turned out, Melcher wasn't the only one to part ways with the group. Gene Clark had become increasingly unhappy with all the infighting in the group, much of which seemed to be centred on him having more songs on the group's albums than McGuinn and Crosby, and he was also becoming slightly withdrawn and paranoid. He no longer wanted to be stuck in the middle of the clash between Crosby and McGuinn, and he left the group, citing his fear of flying.\n\nFrom this point on, McGuinn and Crosby would get as many songs as they wanted on the albums. And the group never had another top twenty hit single.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and thirty-nine of A History of Rock Music in Five Hundred Songs looks at “Eight Miles High” by the Byrds, and the influence of jazz and Indian music on psychedelic rock. This is a long one... Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Winchester Cathedral\" by the New Vaudeville Band.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nNo Mixcloud this time, as there were multiple artists with too many songs.\n\nInformation on John Coltrane came from Coltrane by Ben Ratliffe, while information on Ravi Shankar came from Indian Sun: The Life and Music of Ravi Shankar by Oliver Craske.\n\nFor information on the Byrds, I relied mostly on Timeless Flight Revisited by Johnny Rogan, with some information from Chris Hillman’s autobiography.\n\nThis dissertation looks at the influence of Slonimsky on Coltrane.\n\nAll Coltrane's music is worth getting, but this 5-CD set containing Impressions is the most relevant cheap selection of his material for these purposes.\n\nThis collection has the Shankar material released in the West up to 1962.\n\nAnd this three-CD set is a reasonable way of getting most of the Byrds’ important recordings.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nThis episode is the second part of a loose trilogy of episodes set in LA in 1966. We're going to be spending a *lot* of time around LA and Hollywood for the next few months -- seven of the next thirteen episodes are based there, and there'll be more after that.\n\nBut it's going to take a while to get there. This is going to be an absurdly long episode, because in order to get to LA in 1966 again, we're going to have to start off in the 1940s in New York, and take a brief detour to India. Because in order to explain this:\n\n[Excerpt: The Byrds, \"Eight Miles High\"]\n\nWe're first going to have to explain this:\n\n[Excerpt: John Coltrane, \"India (#3)\"]\n\nBefore we begin this, I just want to say something. This episode runs long, and covers a *lot* of musical ground, and as part of that it covers several of the most important musicians of the twentieth century -- but musicians in the fields of jazz, which is a music I know something about, but am not an expert in, and Hindustani classical music, which is very much not even close to my area of expertise. It also contains a chunk of music theory, which again, I know a little about -- but only really enough to know how much I don't know.\n\nI am going to try to get the information about these musicians right, but I want to emphasise that at times I will be straying *vastly* out of my lane, in ways that may well seem like they're minimising these musicians. I am trying to give just enough information about them to tell the story, and I would urge anyone who becomes interested in the music I talk about in the early parts of this episode to go out and find more expert sources to fill in the gap. And conversely, if you know more about these musics than I do, please forgive any inaccuracies. I am going to do my best to get all of this right, because accuracy is important, but I suspect that every single sentence in the first hour or so of this episode could be footnoted with something pointing out all the places where what I've said is only somewhat true. Also, I apologise if I mispronounce any names or words in this episode, though I've tried my best to get it right -- I've been unable to find recordings of some words and names being spoken, while with others I've heard multiple versions.\n\nTo tell today's story, we're going to have to go right back to some things we looked at in the first episode, on \"Flying Home\". For those of you who don't rememb",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and thirty-nine of A History of Rock Music in Five Hundred Songs looks at “Eight Miles High” by the Byrds, and the influence of jazz and Indian music on psychedelic rock. This is a long one... Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Winchester Cathedral\" by the New Vaudeville Band.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nNo Mixcloud this time, as there were multiple artists with too many songs.\n\nInformation on John Coltrane came from Coltrane by Ben Ratliffe, while information on Ravi Shankar came from Indian Sun: The Life and Music of Ravi Shankar by Oliver Craske.\n\nFor information on the Byrds, I relied mostly on Timeless Flight Revisited by Jo",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}