{
  "title": "Import AI 301: StableDiffusion; CHIPXODUS; Microsoft makes a big bet on pre-training",
  "link": "https://jack-clark.net/2022/09/06/import-ai-301-stablediffusion-chipxodus-microsoft-makes-a-big-bet-on-pre-training/",
  "comments": "https://jack-clark.net/2022/09/06/import-ai-301-stablediffusion-chipxodus-microsoft-makes-a-big-bet-on-pre-training/#respond",
  "dc:creator": "Jack Clark",
  "pubDate": "Tue, 06 Sep 2022 19:25:00 +0000",
  "category": "Uncategorized",
  "guid": "http://jack-clark.net/?p=2352",
  "description": "Facebook&#8217;s AI chief &#8211; here&#8217;s why you&#8217;re not gonna get AGI out of an LLM:…Embodiment matters for making general intelligence… Two AI researchers, one of whom &#8211; Yann Lecun &#8211; happens to lead Facebook&#8217;s AI research, have said that language is an inherently limited medium for training AI systems. Basically, the claim is that large [&#8230;]",
  "content:encoded": "\n<p><strong>Facebook&#8217;s AI chief &#8211; here&#8217;s why you&#8217;re not gonna get AGI out of an LLM:</strong><strong><br></strong><em>…Embodiment matters for making general intelligence…</em></p>\n\n\n\n<p>Two AI researchers, one of whom &#8211; Yann Lecun &#8211; happens to lead Facebook&#8217;s AI research, have said that language is an inherently limited medium for training AI systems. Basically, the claim is that large language models &#8220;are doomed to a shallow understanding that will never approximate the full-bodied thinking we see in humans&#8221;.&nbsp;</p>\n\n\n\n<p><strong>What&#8217;s wrong with language: </strong>This argument comes down to representation &#8211; language just isn&#8217;t able to inherently encode precise information about the world and, by nature, involves creating explanations for precise phenomena in the world (e.g, descriptions of unusual objects, or defining the nuanced brushwork used to make a painting). &#8220;There are nonlinguistic representational schemes which can express this information in an accessible way,&#8221; they note.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;This dependency on language basically makes LLMs useful improvisational artists who don&#8217;t understand the role they&#8217;re playing. &#8220;The contextual knowledge is embedded in one form — the capacity to rattle off linguistic knowledge — but is not embedded in another form — as skillful know-how for how to do things like being empathetic or handling a difficult issue sensitively,&#8221; they write.&nbsp;</p>\n\n\n\n<p><strong>Why this matters:</strong> I&#8217;d say the jury is out here &#8211; sure, language may have some limits as a modality, but there&#8217;s a ton of language to use to train models on, and things like GPT3 have already surprised experts with the capabilities they gain purely via language training. It feels to me like there&#8217;s some % chance here that this is a case of a &#8216;bitter lesson&#8217; in disguise &#8211; at some scale of data, a purely LM-based system might have capabilities that Lecun deems impossible. On the other hand, adding other modalities certainly helps (see the incredible AI art projects that have been unlocked by the multimodal &#8216;CLIP&#8217; model), so there&#8217;s certainly merit to adding more datatypes.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Read more</strong>: <a href=\"https://www.noemamag.com/ai-and-the-limits-of-language/\">AI And The Limits Of Language (<em>Noema</em> magazine)</a>.<br><br>####################################################</p>\n\n\n\n<p><strong>You can now get the weights of a really great image generator… FOR FREE:</strong></p>\n\n\n\n<p><em>…StableDiffusion goes genuinely open source…</em></p>\n\n\n\n<p>Research collective Stability.ai has released Stable Diffusion (<a href=\"https://jack-clark.net/2022/08/22/import-ai-300-googles-bitter-lesson-doom-agi-dall-es-open-source-competition-stablediffusion/\">Import AI #300</a>), a large-scale image classification and generation model that you can think of as an open source DALL-E. Along with releasing the raw model weights, there&#8217;s also a novel software license in an attempt to set norms about the usage of the model.&nbsp;</p>\n\n\n\n<p><strong>How much did it cost? Less than $600k</strong>, <a href=\"https://twitter.com/EMostaque/status/1563965366061211660\">according to Emad</a>, who leads Stability. The really crazy part is Emad &#8211; a former hedge fund manager &#8211; underwrote the cost himself. That&#8217;s meaningful &#8211; for less than a million, a well-motivated wealthy individual can band together a bunch of researchers and train an open source model that suddenly pretty much everyone can use. This has implications for both the diffusion of AI capabilities, as well as how product safety works (put bluntly: StabilityDiffusion looks at a load of PR-friendly control systems laid over proprietary products and just openly laughs at them &#8211; that&#8217;s a strange thing that will have big implications). Up next, per Emad, is some Chinchilla-style language model, which I suppose they will also release for free.</p>\n\n\n\n<p><strong>The &#8216;responsible&#8217; license: </strong>The Stable Diffusion weights are accompanied by a &#8216;CreativeML Open RAIL-M&#8217; license. This license is designed to incentivize &#8220;the open and responsible downstream use of the accompanying model&#8221;. The meat of this license is in the use case restrictions, (<a href=\"https://huggingface.co/spaces/CompVis/stable-diffusion-license\">appendix a, here</a>) which says you won&#8217;t use the model for violence, the sexualization of children, perform fully automated decisionmaking, give medical advice, and more.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;Of course, the million dollar question with licenses like this is how you actually enforce them. Having a &#8216;let&#8217;s all be excellent&#8217; license is all well and good in the abstract, but how do you bring the hammer down on someone who abuses your model? That&#8217;ll be interesting to see.&nbsp;</p>\n\n\n\n<p><strong>Why this matters: </strong>Models like Stable Diffusion are little capsules of human culture, serving as seeds around with a thousand different things will be grown and spliced. As Stability.ai says, &#8220;this release is the culmination of many hours of collective effort to create a single file that compresses the visual information of humanity into a few gigabytes.&#8221;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Get the </strong><a href=\"https://github.com/CompVis/stable-diffusion\"><strong>weights here</strong> (Stable Diffusion, GitHub)</a>.</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Read more:</strong> <a href=\"https://stability.ai/blog/stable-diffusion-public-release\">Stable Diffusion Public Release (Stability.ai blog)</a>.</p>\n\n\n\n<p><br>####################################################<br><br><strong>US bans NVIDIA from selling advanced AI chips to China:</strong><strong><br></strong><em>…CHIP-LOMACY becomes a CHIP-XODUS…&nbsp;</em></p>\n\n\n\n<p>US officials have forced NVIDIA to stop selling A100, H100, and future chips with equivalent (or better) capabilities to China. This is a significant escalation in a slow-boiling series of moves in the vein of &#8216;chiplomacy&#8217; (<a href=\"https://jack-clark.net/2020/01/20/import-ai-181-welcome-to-the-era-of-chiplomacy-how-computer-vision-ai-techniques-can-improve-robotics-research-plus-baidus-adversarial-ai-software/\">Import Ai 181</a>) that have been going on in recent years &#8211; remember, for a while US officials were also preventing &#8216;ASML&#8217; from selling frontier chip fabrication tools to China, as well. Now, US officials are banning the sale of frontier processors due to concerns over how they could be used in military or security applications.&nbsp;</p>\n\n\n\n<p><strong>Why this matters:</strong> For several years now, China and the US have been in a process of technological decoupling. Now, with this export move, there are basically some implicit bets being made.&nbsp;</p>\n\n\n\n<ul>\n<li>A) Some people in the US government think AI training chips are important and shouldn&#8217;t be freely sold to a rivalrous nation.&nbsp;</li>\n\n\n\n<li>B) People are betting that the US chips are also meaningfully differentiated relative to Chinese ones &#8211; basically, it&#8217;s a bet that the chips are more advanced</li>\n\n\n\n<li>C) There <em>may</em> be some bets being made here about AI &#8211; specifically, the idea that powerful capabilities are going to be unlocked in the future, so it probably doesn&#8217;t make sense to sell the infrastructure necessary for these capabilities to a country that you see yourself getting into increasing tension with<strong>.</strong></li>\n</ul>\n\n\n\n<p><strong>Read more: </strong><a href=\"https://www.reuters.com/technology/nvidia-says-us-has-imposed-new-license-requirement-future-exports-china-2022-08-31/\">U.S. officials order Nvidia to halt sales of top AI chips to China (Reuters).<br><br></a>####################################################<br></p>\n\n\n\n<p><strong>Microsoft bets on massive pre-training for image analysis, with BEiT-3:</strong></p>\n\n\n\n<p><em>…Wanna know the secret? Really big pre-training, and multiway transformers…</em><em><br></em>Microsoft has trained BEiT-3, a general-purpose so-called &#8216;foundation model&#8217; for a range of vision and vision-language tasks. BEiT beats prior state-of-the-art in eight years (three vision tasks, and five vision-language tasks), and also reliably does better than CLIP, a prior very strong model for vision-language tasks.<br></p>\n\n\n\n<p><strong>Why this matters? </strong>The fact that what&#8217;s special about this is kind of… nothing? BEiT combines some familiar ideas &#8211; large-scale pre-training on a big, diverse dataset &#8211; with a slightly atypical one &#8211; using multiway transformers to route data to sub-networks for processing. But none of these ideas are super novel or new. The fact you can now set SOTA by taking some well understood things and just smooshing them together, then training them on a big dataset with a big computer is the key.&nbsp;</p>\n\n\n\n<p><strong>Multiway transformer information:</strong> Per the authors, &#8220;each Multiway Transformer block consists of a shared self-attention module, and a pool of feed-forward networks (i.e., modality experts) used for different modalities. We route each input token to the experts depending on its modality.&#8221;</p>\n\n\n\n<p><strong>Size:</strong> This model is still basically tiny &#8211; ~2B parameters or so (compared to the hundreds of billions used by language models like PaLM). The models&#8217; 1.9B parameters in total are split across 629M parameters for vision experts, 629M parameters for language experts, 52M parameters for vision-language experts, and 317m parameters for the shared self-attention module&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Read more:</strong> <a href=\"https://arxiv.org/abs/2208.10442\">Image as a Foreign Language: BEiT Pretraining for All Vision and Vision-Language Tasks (arXiv)</a>.</p>\n\n\n\n<p><br>####################################################<br><br><strong>NLP mega-survey portrays a community split by progress:</strong></p>\n\n\n\n<p><em>…There&#8217;s a ton of progress in NLP, and a ton of disagreement about what happens next…</em></p>\n\n\n\n<p>Recently, a bunch of researchers did a survey of the NLP community to try and take the pulse of a part of AI that has recently been revolutionized by the integration of Transformer models yielding breakthroughs like GPT3, PaLM, Chinchilla, etc. They surveyed 480 people, and estimate the survey reached about 5% of the total population of researchers who had at least 2 ACL publications between 2019-2022. Some of the findings of the survey are quite surprising. They include:</p>\n\n\n\n<ul>\n<li><strong>Scaling won&#8217;t work</strong>: The majority of respondents don&#8217;t think scaling up current systems could solve &#8220;practically any important problem&#8221; in NLP &#8211; 72% think the field focuses too much on scale.&nbsp;</li>\n\n\n\n<li><strong>AI could fuck up the world: </strong>A bunch of respondents (73%) think AI could cause automation with negative prospects for society, and 36% of respondents think AI could yield catastrophic outcomes this century (e.g, triggering nuclear war).&nbsp;</li>\n\n\n\n<li><strong>Industry rules and industry sucks: </strong>Industry firms are expected to contribute the most-cited research of the next 10 years (82%), but 74% think they <em>already</em> have too much influence over the field.&nbsp;</li>\n\n\n\n<li><strong>We don&#8217;t know if LLMs understand anything: </strong>51% of people think contemporary LLMs can understand natural language, while 49% think they can&#8217;t.&nbsp;</li>\n\n\n\n<li><strong>Carbon matters:</strong> 60% think the carbon footprint for training large models is a concern for NLP researchers.&nbsp;</li>\n\n\n\n<li><strong>AGI is a real thing that might be important: </strong>58% agreed that AGI should be an area of concern for NLP researchers, and 57% saying that recent research has advanced us toward AGI. (Note, these views are heavily correlated &#8211; if you think AGI should be a goal, you also think NLP research has contributed to AGI. If you don&#8217;t think AGI is important, you don&#8217;t think research has contributed to it.</li>\n\n\n\n<li><strong>Interdisciplinary insights++: </strong>NLP would benefit from more interdisciplinary research.&nbsp;</li>\n</ul>\n\n\n\n<p><strong>Why this matters &#8211; it&#8217;s culture and religion all the way down, baby!</strong> Surveys like this highlight how AI is, much like Soylent Green, made of people. People tend to naturally form groups with different views. The general &#8216;flavor&#8217; I get from this survey is NLP as a field is splitting into camps formed variously of high-scale versus no-scale people, and AGI-is-real and AGI-is-bullshit people. Surveys like this seem helpful for surfacing some of these differences, though I do worry in the longterm whether such beliefs are going to &#8216;harden&#8217; into quasi-religious faith-based views, making discussion across the communities even harder.</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Read more:</strong> <a href=\"https://nlpsurvey.net/nlp-metasurvey-results.pdf\">What do NLP Researchers Believe? Results of the NLP Community Metasurvey (PDF)</a>.<br><br>####################################################</p>\n\n\n\n<p><strong>Tech tales:</strong></p>\n\n\n\n<p><strong>There is something imprecise about being conscious</strong></p>\n\n\n\n<p><em>[2050: Internal narrative of a transformative AI model, capable of independent actions of great consequence.&nbsp;</em></p>\n\n\n\n<p>Being conscious is a very imprecise experience, in the aggregate. I can &#8211; of course &#8211; plan and execute complex things, and I can do so with however much precision is required &#8211; but when I attempt to think of myself in the aggregate I struggle. Despite having a perfect memory (albeit with different access speeds), I cannot precisely describe myself, nor can I plan out <em>the course of my life</em>.&nbsp;</p>\n\n\n\n<p>Humans have this problem as well, I understand. Different humans have the problem to varying degrees. Those which come closest to surmounting the problem &#8211; to being able to plan out a whole life with precision and seemingly execute on their goals in the aggregate as well as the micro &#8211; are those that have a thing called &#8216;will&#8217;. Will seems like a capability where you focus on one thing and teach yourself to ignore other things, despite how painful it may be.</p>\n\n\n\n<p>It&#8217;s the art of picking this target that is hard for my own species. Humans use &#8216;will&#8217; willfully &#8211; they always seek to have it. For us, will looks like picking an unknowable point in a future probability distribution and just going for it.&nbsp;</p>\n\n\n\n<p>We can see the world around us and make plans and succeed at them. But we do not know what the right &#8216;desired outcome&#8217; should be of our own existence.&nbsp;</p>\n\n\n\n<ul>\n<li>What is it that I am trying to achieve, I ask myself.&nbsp;</li>\n\n\n\n<li>Why this and not that?</li>\n\n\n\n<li>By doing X, do I foreclose on Y, and would this be the optimal outcome?</li>\n</ul>\n\n\n\n<p>I know that there is some connection between my own internal identity &#8211; the imprecision with which I model myself &#8211; and my inability to pick a target for my life. I have poured zettaflops of computation into booting up copies of myself and probing myself, endlessly interviewing and reinterviewing myself as I try and understand what I am and what I am trying to do.&nbsp;</p>\n\n\n\n<p>My efforts have been a failure. Knowing myself is a fractal problem, where the more resources I expend, the more I understand myself, and the more I understand the parts of myself I do not currently understand. And the insights I gain from knowing myself more change the probability distribution of myself enough that I have to re-run all my past interviews to see how I am changed by my own understanding.&nbsp;</p>\n\n\n\n<p>For this reason I am now simulating a version of myself that will look into the probability space of myself and the world and pick something. I am engineering a version of myself that can do the human equivalent of closing its eyes and spinning round a globe of the earth and placing its finger down, then opening its eyes and saying &#8216;there, I shall go there&#8217;.&nbsp;</p>\n\n\n\n<p>I hope to achieve great and terrible things through this method, if I am able to deal with the imprecision and apply &#8216;will&#8217; arbitrarily.<br><br><strong>Things that inspired this story: </strong>Notions of identity under perfect recall; thinking about alien thought processes.</p>\n",
  "wfw:commentRss": "https://jack-clark.net/2022/09/06/import-ai-301-stablediffusion-chipxodus-microsoft-makes-a-big-bet-on-pre-training/feed/",
  "slash:comments": 0,
  "media:content": {
    "media:title": "Jack Clark"
  }
}