{
  "title": "Chinese Whispers: does China want to change the international rules-based order?",
  "link": "https://audioboom.com/posts/8076188",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2126,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>China is often accused of breaking international rules and norms. Just last week at Mansion House, Foreign Secretary Liz Truss said: 'Countries must play by the rules. And that includes China'.<br>\n<br>\n\n</div>\n<div>So what are its transgressions, and what are its goals for the international system? My guests and I try to answer this question in this episode through looking at China's attitude to and involvement in international organisations, past and present. Professor Rana Mitter, a historian at the University of Oxford and author of <em> China's Good War</em> , points out that there's a fundamental difference in China's approach compared to, say, Russia. 'Russia perceives itself as, essentially, a country that is really at the end of its tether in terms of the international system. Whereas China still sees plenty of opportunities to grow and expand its status'.<br>\n<br>\n\n</div>\n<div>To that end, China is actually a member of dozens of international organisations, most notably – as we discuss in the episode – sitting on the United Nations Security Council, which gives it veto power on UN resolutions (though, Yu Jie, senior  research fellow at Chatham House, points out that China is most often found abstaining rather than vetoing). It wants a seat at the table,  but it also frequently accuses our existing set of international norms and rules as designed by the West. To begin with, then, China is seeking to rewrite the rules in its own favour – Jie gives the example of China's ongoing campaign to increase its voting share in the IMF, on the basis of its huge economy. 'It's not exactly overthrowing the existing international order wholesale, but choosing very carefully which parts China wants to change.'<br>\n<br>\n\n</div>\n<div>This multilateral engagement has a historical basis. Nationalist China was keen to be seen as an equal and respected partner in the international community, and Rana points out – something I'd never thought of before – that China after the second world war 'was a very very unusual sort of state… Because it was the only state, pretty much, in Asia, that was essentially sovereign… Don’t forget that 1945 meant liberation for lots of European peoples, but for lots of Asian peoples – Indonesia, Vietnam, Malaya, wherever you want to name – they basically went back into European colonialism'. This (together with its then-alliance with the United States)  gave the Republic of China a front row seat in the creation of the United Nations and, before then, the League of Nations.<br>\n<br>\n\n</div>\n<div>It didn't take long for Communist China to start building links with the rest of the world, either. Mao  'had not spent decades fighting out in the caves and fields of China to simply become a plaything of Stalin’, Rana points out, making its multilateral relations outside of the alliance with the USSR vitally important. After it split with Moscow, and before the rapprochement with the US, the Sixties was a time of unwanted isolationism,  ' which is well within living memory of many of the top leaders', says Rana, adding more to its present day desire to have as much sway as possible in the world, which still comes through international organisations.<br>\n<br>\n\n</div>\n<div>Finally, my guests bust the myth – often propagated by Beijing – that China had no role in the writing of today's international laws, pointing out that Chinese and other non-western thinkers played a major role in the creation of the Universal Declaration of Human Rights . What's more, do western ideas have no place in guiding and governing China? After all, Karl Marx was certainly not Chinese, and that doesn't seem to bother his Chinese Communist believers.</div>\n",
  "pubDate": "Mon, 02 May 2022 08:57:52 +0000",
  "guid": "tag:audioboom.com,2022-05-02:/posts/8076188",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}