{
  "title": "S02.22: Sarah's on Deadline AMA",
  "category": [
    "AMA",
    "full-length episode",
    "S02 - Interstitials"
  ],
  "dc:creator": "Jennifer Prokop",
  "pubDate": "Wed, 05 Feb 2020 05:00:00 +0000",
  "link": "https://fatedmates.net/episodes/2020/2/4/s0222-february-ama",
  "guid": "5bc7409ec46f6d369ce5f644:5bcf6773419202388fdccb10:5e399622e5c7b532f0dc0524",
  "description": "<p class=\"\">We promised we’d get to the rest of our Holiday AMA questions eventually, and Sarah’s on deadline, so this seemed like the perfect week to do it! Join us for a freewheeling hour during which Sarah cannot remember Tessa Thompson’s name, we talk about how much we’d like to meet Sandra Brown, and how romance really does have something for everyone, including an entire series about romance during power outages.</p><p class=\"\"></p><p class=\"\">Also, we forgot to mention that Tuesday was Derek Craven Day! Lots of fun was had by all goofballs who joined us on the Internet to celebrate, and Lisa Kleypas herself even got involved! If you haven’t read <a href=\"https://amzn.to/37Y8eAB\"><em>Dreaming of You</em></a>, you can get it for $2.99 right now in ebook! Also, do not miss this incredible <a href=\"https://twitter.com/BGSU_PopCultLib/status/1224755574287433728\">Craven Day thread on Twitter</a> from Steve Ammindown and the Browne Pop Culture Library. And if you want Derek Craven t-shirts? <a href=\"https://www.teepublic.com/t-shirt/7834770-derek-craven-would-never\">Those exist now</a>!</p><p class=\"\">Next week, the book is in and we’re back in business! Lorraine Heath’s <em>Waking Up With the Duke</em> is our next read—a book that blooded Sarah. Get it<em> </em>at <a href=\"https://amzn.to/2ReCfWR\">Amazon</a>, <a href=\"https://www.barnesandnoble.com/w/waking-up-with-the-duke-lorraine-heath/1100050545?ean=9780062022455\">Barnes & Noble</a>, <a href=\"https://books.apple.com/us/book/waking-up-with-the-duke/id421967388?app=itunes&at=1l3vpAR&mt=11\">Apple Books</a>, or <a href=\"https://www.kobo.com/us/en/ebook/waking-up-with-the-duke\">Kobo</a>.</p><p class=\"\"><a href=\"https://fatedmates.net/episodes/2020/2/4/s0222-february-ama\" target=\"\"><strong>Full Show Notes @ FATEDMATES.NET</strong></a></p><p class=\"\"><strong>- Question 1:</strong> Weird but true: the more specific the request, the more likely we are to come up with a recommendation. So if you just need \"enemies to lovers\" and you've already read <a href=\"https://amzn.to/2ts6Y9J\">Her Best Worst Mistake,</a> or \"friends to lovers\" and you've already read <a href=\"https://amzn.to/2OHlsdx\">Scoring Off the Field</a>, then you just need to google it.</p><p class=\"\"><strong>- Question 2:</strong> Who are we fancasting? These beautiful people: Nikolaj Coster-Waldau, Henry Cavill, Tessa Thompson, and Tom Hardy. Also, listening to <a href=\"https://youtu.be/pkqqs0iEWTA\">Henry Cavill</a> and <a href=\"https://youtu.be/y5X3gLwvrRI\">Tom Hardy</a> grunt is one of our favorite things.</p><p class=\"\"><strong>- Question 3</strong>: Who do we want to have lunch or tea with? Kresley Cole, obviously! Sarah said Joanna Lindsey. Jen says Julie Garwood. We'd both love to meet Sandra Brown. Jen still can't believe the people she's met, and hopes she was <a href=\"https://youtu.be/lOgbxRJikiM\">cool like Yolanda</a>.</p><p class=\"\"><strong>- Question 4:</strong> Do we have recommendation for lesbian and f/f romance? Is it more difficult to find? Check out <a href=\"https://www.boldstrokesbooks.com/\">Bold Strokes Books</a>. strands of f/f, and others have different roots. We will keep looking for some history of f/f romance and link to them if we find one. But in the meantime, <a href=\"https://loandbehold.substack.com/p/the-invisible-lesbian-in-young-adult\">YA author, critic, and expert Malinda Lo wrote about \"The Invisible Lesbian\" in YA</a>, and it's right on point and worth your time. But we do have lots of great f/f romances that we love in the photo array below.</p><p class=\"\"><strong>- Question 5: </strong>What about steampunk? Is that ever coming back? We don't know! But all we can do is recommend these ones we do know. Sorry!</p><p class=\"\"><strong>- Question 6:</strong> What is like Harry Potter for grown-ups? <a href=\"https://amzn.to/31oGZg0\">Burn For Me</a> by Illona Andrews (Jen also liked the Kate Daniels series). That's it. That's the answer.</p><p class=\"\"><strong>- Question 7: </strong>Books with power outages? Read this Naima Simone series called Blackout Billionares.</p><p class=\"\"><strong>- Question 8:</strong> How to get started with reviewing and NetGalley? You should look at lists that big reviewing clearinghouses make--<a href=\"https://www.kirkusreviews.com/features/2020-preview-romance-fiction-look-new-year/\">Kirkus</a> (Jen writes that one!), Booklist, and <a href=\"https://www.publishersweekly.com/pw/by-topic/new-titles/adult-announcements/article/81915-spring-2020-announcements-romance-erotica.html\">PW</a>. Just trying to look at some of these lists will give you a sense of what books will be coming out. <a href=\"https://www.tbqsbookpalace.com/p/2020-r.html\">The Book Queen is keeping a list of 2020 new releaes</a>. But <a href=\"https://bookish.netgalley.com/exclusive-interviews/01/2020/netgalley-tips-publicist/\">Estelle from Forever Romance wrote a great piece about how to get started with NetGalley</a>.</p><p class=\"\"><strong>- Question 9:</strong> Looking for hardcore enemies to lovers with kids in the mix. Jen recommends Wait For It by Molly O'Keefe. Lord of Scoundrels is great for this, too!</p><p class=\"\"><strong>- Quesiton 10: </strong>Books that made us literally laugh out loud. Jen recommends I Think I Might Love You by Christina C Jones. Sarah recommends It Takes Two by Jenny Holiday. Christina has a huge backlist, and Jenny's newest book, <a href=\"https://amzn.to/2RY9SwA\">Mermaid Inn</a>, came out last week.</p><p class=\"\"><strong>- Question 11:</strong> Looking for books with a heist plot and polyamory. Jen thinks Katrina Jackson has cornered the market on this request and we have all been blessed by it.</p><p class=\"\"><strong>- Quesiton 12:</strong> A question if there are any romances with a Muslim hero and heroine with on-page sex. Jen couldn't think of any, but asked author Farah Heron. Farah also couldn't think of one, but we do recommend her book The Chai Factor.</p><p class=\"\"><strong>- Quesiton 13:</strong> Jackie from Elyria Ohio (where Jen went to high school!) is looking for historical with a murder and a twist. We recommend Kelly Bowen and Sarah's book No Good Duke Goes Unpunished.</p><p class=\"\"><strong>- Quesiton 14:</strong> Sarah is looking for books with virgin heroes--but hot!</p><p class=\"\"><strong>- Question 15:</strong> A book with a grovel so unconvincing that the character has to do it again. Oh, we have suggestions but also you should check out <a href=\"https://www.jenreadsromance.com/post/rombklove-day-3-groveling\">Jen's treatise on groveling</a>.</p><p class=\"\"><strong>- Quesiton 16: </strong>What are some museums we love? Sarah talked about these in England: <a href=\"https://www.museumoflondon.org.uk/museum-london\">The Museum of London</a>, <a href=\"https://foundlingmuseum.org.uk/\">The Foundling Museum</a>, <a href=\"https://www.soane.org/\">The Soane's Museum</a>, and <a href=\"https://www.bl.uk/\">The British Library</a>. She also loves <a href=\"https://www.museumofsex.com/\">the Museum of Sex</a> in New York, and the <a href=\"https://www.gardnermuseum.org/organization/theft#gref\">Isabella Gardner Museum</a> in Boston. Jen doesn't research, but in Chicago, she recommends <a href=\"https://www.artic.edu/\">The Art Institute</a> and the <a href=\"http://nationalmuseumofmexicanart.org/\">National Museum of Mexican Art.</a> If you're ever in Cleveland, the <a href=\"https://www.rockhall.com/exhibits\">Rock & Roll Hall of Fame</a> is so cool, and in Houston, check out the most meditative place Jen has ever been, <a href=\"https://www.nytimes.com/2017/08/23/magazine/the-rothko-chapel.html\">The Rothko Chapel.</a>(when this aired in Feb 2020, the chapel was temporarily closed for renovations! <a href=\"http://www.rothkochapel.org/\">Please check the website</a>).</p>",
  "itunes:author": "Fated Mates",
  "itunes:subtitle": "Jen and Sarah revisit their holiday AMA questions",
  "itunes:summary": "We promised we’d get to the rest of our Holiday AMA questions eventually, and Sarah’s on deadline, so this seemed like the perfect week to do it! Join us for a freewheeling hour during which Sarah cannot remember Tessa Thompson’s name, we talk about how much we’d like to meet Sandra Brown, and how romance really does have something for everyone, including an entire series about romance during power outages.",
  "itunes:explicit": "yes",
  "itunes:duration": "01:13:13",
  "itunes:image": "",
  "itunes:season": 2,
  "itunes:episode": 22,
  "itunes:title": "S02.22: Sarah's on Deadline AMA",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "S02.22: Sarah's on Deadline AMA"
  }
}