{
  "title": "An Exercise Program for the Fat Web",
  "description": "<!--kg-card-begin: markdown--><p>When I wrote about <a href=\"https://blog.codinghorror.com/app-pocalypse-now/\">App-pocalypse Now</a> in 2014, I implied the future still belonged to the web. And it does. But it's also true that the web has changed a lot in the last 10 years, much less the last 20 or 30.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/05/fat-city-apple-ii.png\" alt=\"fat city\" loading=\"lazy\"></p>\n<p>Websites have gotten a lot</p>",
  "link": "https://blog.codinghorror.com/an-exercise-program-for-the-fat-web/",
  "guid": "5988f60721f57d0019a2e12a",
  "dc:creator": "Jeff Atwood",
  "pubDate": "Thu, 30 May 2019 11:04:52 GMT",
  "content:encoded": "<!--kg-card-begin: markdown--><p>When I wrote about <a href=\"https://blog.codinghorror.com/app-pocalypse-now/\">App-pocalypse Now</a> in 2014, I implied the future still belonged to the web. And it does. But it's also true that the web has changed a lot in the last 10 years, much less the last 20 or 30.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/05/fat-city-apple-ii.png\" alt=\"fat city\" loading=\"lazy\"></p>\n<p>Websites have gotten a lot &#x2026; <em>fatter</em>.</p>\n<p>While I think it's irrational to pine for the bad old days of <a href=\"http://info.cern.ch/\">HTML 1.0 websites</a>, there are some legitimate concerns here. The best summary is Maciej Ceg&#x142;owski's <a href=\"http://idlewords.com/talks/website_obesity.htm\">The Website Obesity Crisis</a>.</p>\n<blockquote>\n<p>To channel a famous motivational speaker, I could go out there tonight, with the materials you&#x2019;ve got, and rewrite the sites I showed you at the start of this talk to make them load in under a second. In two hours.</p>\n<p>Can you? Can you?</p>\n<p>Of course you can! It&#x2019;s not hard! We knew how to make small websites in 2002. It&#x2019;s not like the secret has been lost to history, like Greek fire or Damascus steel.</p>\n<p>But we face pressure to make these sites bloated.</p>\n<p>I bet if you went to a client and presented a 200 kilobyte site template, you&#x2019;d be fired. Even if it looked great and somehow included all the tracking and ads and social media crap they insisted on putting in. It&#x2019;s just so far out of the realm of the imaginable at this point.</p>\n</blockquote>\n<p>The <a href=\"http://idlewords.com/talks/website_obesity.htm\">whole article is essential</a>; you should stop what you're doing and read it now if you haven't already. But if you don't have time, here's the key point:</p>\n<blockquote>\n<p>This is a screenshot from an NPR article discussing the rising use of ad blockers. The page is 12 megabytes in size in a stock web browser. <strong>The same article with basic ad blocking turned on is 1 megabyte.</strong></p>\n</blockquote>\n<p>That's right, through the simple act of running an ad blocker, you've reduced that website's payload by twelve times. Twelve! That's like the most effective exercise program <em>ever!</em></p>\n<p>Even the traditional advice to <a href=\"https://hackernoon.com/10-things-i-learned-making-the-fastest-site-in-the-world-18a0e1cdf4a7\">keep websites lean and mean for mobile</a> no longer applies because new mobile devices, at least on the Apple side, are <em>faster than most existing desktops and laptops.</em></p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">The iPhone XS is faster than an iMac Pro on the Speedometer 2.0 JavaScript benchmark. It's the fastest device I've ever tested. Insane 45% jump over the iPhone 8/X chip. How does Apple do it?! &#x2728; <a href=\"https://t.co/5nCKZUCAYK\">pic.twitter.com/5nCKZUCAYK</a></p>&#x2014; DHH (@dhh) <a href=\"https://twitter.com/dhh/status/1043277162676072449?ref_src=twsrc%5Etfw\">September 21, 2018</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Despite <a href=\"https://danluu.com/web-bloat/\">claims to the contrary</a>, the bad guy isn't web bloat, per se. <strong>The bad guy is <em>advertising</em></strong>. Unlimited, unfettered ad \"tech\" has creeped into everything and subsumed the web.</p>\n<p>Personally I don't even want to run ad blockers, and I didn't for a long time &#x2013; but it's increasingly difficult to avoid running an ad blocker unless you want a clunky, substandard web experience. There's a <em>reason</em> the most popular browser plugins are inevitably ad blockers, isn't there? Just ask Google:</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/05/chrome-best-extensions-google-search.png\" alt=\"chrome-best-extensions-google-search\" loading=\"lazy\"></p>\n<p>So it's all the more surprising to learn that Google is <a href=\"https://9to5google.com/2019/05/29/chrome-ad-blocking-enterprise-manifest-v3/\">suddenly clamping down hard on adblockers in Chrome</a>.  Here's what the author of uBlock Origin, an ad blocking plugin for Chrome, <a href=\"https://github.com/uBlockOrigin/uBlock-issues/issues/338#issuecomment-496009417\">has to say</a> about today's announcement:</p>\n<blockquote>\n<p>In order for Google Chrome to reach its current user base, it had to support content blockers &#x2014; these are the top most popular extensions for any browser. Google strategy has been to find the optimal point between the two goals of growing the user base of Google Chrome and preventing content blockers from harming its business.</p>\n<p>The blocking ability of the webRequest API caused Google to yield control of content blocking to content blockers. Now that Google Chrome is the dominant browser, it is in a better position to shift the optimal point between the two goals which benefits Google's primary business.</p>\n<p>The deprecation of the blocking ability of the webRequest API is to gain back this control, and to further instrument and report how web pages are filtered, since the exact filters which are applied to web pages are useful information which will be collectable by Google Chrome.</p>\n</blockquote>\n<p>The ad blockers themselves are arguably just as complicit. Eye/o GmbH owns <a href=\"https://adblockplus.org/\">AdBlock</a> and <a href=\"https://www.ublock.org/\">uBlock</a>, employs 150 people, and in 2016 they had 50 million euros in revenue, of which about 50% was profit. Google's <a href=\"https://help.getadblock.com/support/solutions/articles/6000092027-why-does-adblock-allow-non-intrusive-ads-\">paid \"Acceptable Ads\" program</a> is a way to funnel money into adblockers to, uh, <em>encourage</em> them to display certain ads. With money. Lots &#x2026; and lots &#x2026; of money. &#x1F911;</p>\n<p>We simultaneously have a very real web obesity crisis, and a looming crackdown on ad blockers, seemingly the only viable weight loss program for websites. What's a poor web citizen to do? Well, there is one thing you can do to escape the need for browser-based adblockers, at least on your home network. Install and configure <a href=\"https://pi-hole.net/\">Pi-Hole</a>.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/05/pi-hole-screenshot.png\" alt=\"pi-hole-screenshot\" loading=\"lazy\"></p>\n<p>I've talked about the amazing Raspberry Pi before <a href=\"https://blog.codinghorror.com/the-raspberry-pi-has-revolutionized-emulation/\">in the context of classic game emulation</a>, but this is another brilliant use for a Pi.</p>\n<p>Here's why it's so cool. If you disable the DHCP server on your router, and let the Pi-Hole become your primary DHCP server, <strong>you get automatic DNS based blocking of ads for every single device on your network</strong>. It's kind of scary how powerful DNS can be, isn't it?</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/05/pi-hole-action-shot.jpg\" alt=\"pi-hole-action-shot\" loading=\"lazy\"></p>\n<p>My Pi-Hole took me about 1 hour to set up, start to finish. All you need is</p>\n<ul>\n<li>a <a href=\"https://www.amazon.com/dp/B07BC7BMHY/?tag=codihorr-20\">Raspberry Pi 3b+ kit</a> $59</li>\n<li>a quality <a href=\"https://www.amazon.com/dp/B00WR4IJBE/?tag=codihorr-20\">32GB SD card</a> $9</li>\n<li>an ethernet cable</li>\n</ul>\n<p>I do recommend the 3b+ because it has <a href=\"https://www.pidramble.com/wiki/benchmarks/networking\">native gigabit ethernet</a> and a bit more muscle. But <a href=\"https://discourse.pi-hole.net/t/what-model-raspberry-pi-should-i-use-for-pi-hole/9635\">literally any Raspberry Pi</a> you can find laying around will work, though I'd <em>strongly</em> advise you to pick one with a wired ethernet port since it'll be your DNS server.</p>\n<p>I'm not going to write a whole Pi-Hole installation guide, because there are <a href=\"https://www.smarthomebeginner.com/pi-hole-tutorial-whole-home-ad-blocking/\">lots of great ones</a> out there already. It's not difficult, and there's a slick web GUI waiting for you once you complete initial setup. For your initial testing, pick any IP address you like on your network that won't conflict with anything active. Once you're happy with the basic setup and web interface:</p>\n<ul>\n<li>Turn OFF your router's DHCP server &#x2013; existing leases will continue to work, so nothing will be immediately broken.</li>\n<li>Turn ON the pi-hole DHCP server, in the web GUI.</li>\n</ul>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/05/pi-hole-dhcp-server.png\" alt=\"pi-hole-dhcp-server\" loading=\"lazy\"></p>\n<p>Once you do this, all your network devices will start to grab their DHCP leases from your Pi-Hole, which will <em>also</em> tell them to route all their DNS requests through the Pi-Hole, and that's when the &#x2728; magic &#x2728; happens!</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/05/pi-hole-blacklists.png\" alt=\"pi-hole-blacklists\" loading=\"lazy\"></p>\n<p>All those DNS requests from all the devices on your network will be checked against the ad blacklists; anything matching is quickly and silently discarded <strong>before it ever reaches your browser.</strong></p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/05/pi-hole-dashboard-stats.png\" alt=\"pi-hole-dashboard-stats\" loading=\"lazy\"></p>\n<p>(The Pi-Hole also acts as a <a href=\"https://discourse.pi-hole.net/t/will-pi-hole-slow-down-my-network/2048\">caching DNS server</a>, so repeated DNS requests will be serviced rapidly from your local network, too.)</p>\n<p>If you're worried about stability or reliability, you can easily add a cheap battery backed USB plug, or even a second backup Pi-Hole as your secondary DNS provider if you prefer belt and suspenders protection. Switching back to plain boring old vanilla DNS is as easy as unplugging the Pi and flicking the DHCP server setting in your router back on.</p>\n<p>At this point if you're interested (and you should be!), just give it a try. If you're looking for more information, the project has an <a href=\"https://discourse.pi-hole.net\">excellent forum</a> full of FAQs and roadmaps.</p>\n<p><a href=\"https://discourse.pi-hole.net\"><img src=\"https://blog.codinghorror.com/content/images/2019/05/pi-hole-forums.png\" alt=\"pi-hole-forums\" loading=\"lazy\"></a></p>\n<p>You can even <a href=\"https://discourse.pi-hole.net/c/feature-requests?order=votes\">vote for your favorite upcoming features!</a></p>\n<p>I avoided the Pi-Hole project for a while because I didn't need it, and I'd honestly rather jump in later when things are more mature.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/05/pi-hole-pin.jpg\" alt=\"pi-hole-pin\" loading=\"lazy\"></p>\n<p>With the latest Chrome crackdown on ad blockers, now is the time, and I'm impressed how simple and easy <a href=\"https://pi-hole.net/\">Pi-Hole</a> is to run. Just find a quiet place to plug it in, spend an hour configuring it, and promptly proceed to forget about it forever as you enjoy a lifetime subscription to <em>a glorious web ad instant weight loss program across every single device on your network with (almost) zero effort!</em></p>\n<p>Finally, an exercise program I can believe in.</p>\n<!--kg-card-end: markdown-->"
}