{
  "title": "Episode 72: &#8220;Trouble&#8221; by Elvis Presley",
  "link": "https://500songs.com/podcast/episode-72-trouble-by-elvis-presley/",
  "pubDate": "Mon, 02 Mar 2020 10:03:32 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-72-trouble-by-elvis-presley/",
  "description": "Episode seventy-two of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Trouble\" by Elvis Presley, his induction into the army, and his mother's death. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/34510124\">on \"When\" by the Kalin Twins</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust%20\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-72-trouble/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\n<a href=\"https://amzn.to/2SY9jkw\">Hound Dog: The Leiber and Stoller Autobiography</a> by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nThere are many, many books about Elvis Presley out there, but the one I'm using as my major resource for information on him, and which has guided my views as to the kind of person he was, is <a href=\"https://amzn.to/2EjL4b9\"><em>Last Train to Memphis</em> by Peter Guralnick</a>, generally considered the best biography of him.\n\n<a href=\"https://amzn.to/2Vw2yGU\"><em>The Colonel</em> </a>by Alanna Nash is a little more tabloidy than those two, but is the only full-length biography I know of of Colonel Tom Parker.\n\n<a href=\"https://amzn.to/2Mm3E6h\">This box set</a> contains all the recordings, including outtakes, for Elvis' 1950s films, while <a href=\"https://amzn.to/2SirZxR\">this one</a> contains just the finished versions of every record he made in the fifties.\n\nAnd <a href=\"https://amzn.to/39dGwAk\">King Creole</a> itself is well worth watching.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nAs 1957 turned into 1958, Elvis' personal life was going badly wrong, even as he was still the biggest star in the world. In particular, his relationships with everyone involved in his career -- everyone except the Colonel, of course -- were getting weakened.\n\nIn September, Scotty Moore and Bill Black had written to Elvis, resigning from his band -- they'd been put on a salary, rather than a split of the money, and then Elvis' concert schedule had been cut back so much that they'd only played fourteen shows so far all year. They were getting into debt while Elvis was earning millions, but worse than that, they felt that the Colonel was controlling access to Elvis so much that they couldn't even talk to him.\n\nDJ Fontana wouldn't sign the letter -- he'd joined the group later than the others, and so he'd not lost his position in the way that the others had. But the other two were gone. Elvis offered them a fifty dollar raise, but Scotty said that on top of that he would need a ten thousand dollar bonus just to clear his debts -- and while Elvis was considering that, a newspaper interview with Moore and Black appeared, in which they talked about Elvis having broken his promise to them that when he earned more, they would earn more.\n\nElvis was incensed, and decided that he didn't need them anyway. He could replace them easily. And for one show, he did just that. He played the fair at his old home town of Tupelo, Mississippi, with DJ and the Jordanaires, and with two new musicians. On guitar was Hank Garland, a great country session musician who was best known for his hit \"Sugarfoot Rag\":\n\n[Excerpt: Hank Garland, \"Sugarfoot Rag\"]\n\nGarland would continue to play with Elvis on recordings and occasional stage performances until 1961, when he was injured in an accident and became unable to perform. On bass, meanwhile, was Chuck Wigington, a friend of DJ's who, like DJ, had been a regular performer in the Louisiana Hayride band, and who had also played for many years with Pee Wee King and his Golden West Cowboys:\n\n[Excerpt: Pee Wee King and his Golden West Cowboys, \"Screwball\"]\n\nWigington actually didn't have a contract for the show, and he wasn't even a full-time musician at the time -- he had to take a leave of absence from his job working in a bank in order to play the gig.\n\nMeanwhile, Scotty and Bill were off on their own playing the Dallas State Fair. But Elvis found that performing live without Scotty and Bill was just not the same, even though Garland and Wigington were perfectly fine musicians, and he decided to offer Scotty and Bill their old jobs back -- sort of. They'd be getting paid a per diem whether or not they were performing, which was something, but after the next recording sessions Bill never again recorded with Elvis -- he was replaced in the studio by Bob Moore. Scotty remained a regular in Elvis' studio band too, but only on rhythm guitar -- Hank Garland was going to be the lead player on Elvis' records from now on.\n\nThe new arrangement required a lot of compromise on both sides, but it meant that Moore and Black were on a better financial footing, and Elvis could remain comfortable on stage, but it was now very clear that the Colonel, at least, saw Black and Moore as replaceable, and neither of them were necessary for Elvis to continue making hit records.\n\nHis relationship with the two men who had come up with him had now permanently changed -- and that was going to be the case with a lot of other relationships as well.\n\nIn particular, the Colonel was starting to think that Leiber and Stoller should be got rid of. The two of them were dangerous as far as the Colonel was concerned. Elvis respected them, they weren't under the Colonel's control, they didn't even *like* the Colonel, and they had careers that didn't rely on their association with Elvis.\n\nBut they were also people who were able to generate hits for Elvis, and they were currently working for RCA, so while that was the case he would put them to use. But they were loose cannons.\n\nNow, before we go further, I should point out that what I'm about to describe is *one* way that Leiber and Stoller have explained what happened. In various different tellings, they've told events in different orders, and described things slightly differently. This is, to the best of my understanding, the most likely series of events, but I could be wrong.\n\nLeiber and Stoller had a complex attitude towards their work with Elvis. They liked Elvis himself, a lot, and they admired and respected his work ethic in the studio, and shared his taste in blues music. But at the same time, they didn't consider the work they were doing with Elvis to be real art, in the way that they considered their R&B records to be. It was easy money -- anything Elvis recorded was guaranteed to sell in massive amounts, so they didn't have to try too hard to write anything particularly good for him, but they didn't like the Colonel, and they were already, after a couple of films, getting bored with the routine nature of writing for Elvis' films.\n\nI'm going to paraphrase a quote from Jerry Leiber here, because I don't want to get this podcast moved into the adults-only section on Apple Podcasts, and the Leiber quote is quite full of expletives, but the gist of it is that they believed that if they were given proper artistic freedom with Elvis they could have made history, but that the people in his management team only wanted money. Every film needed just a few songs to plug into gaps, and they were usually the same type of songs to go in the same type of gaps. They were bored.\n\nAnd they actually had a plan for a project that would stretch them all creatively. Leiber vaguely knew the film producer Charles Feldman, who had produced On The Waterfront and The Seven-Year Itch, and Feldman had come to Leiber with a proposition. He'd recently acquired the rights to the novel A Walk on the Wild Side, set in New Orleans, and he thought that it would be perfect for Elvis. He'd have the script written by Budd Schulberg, and have Elia Kazan direct -- the same team that had made On The Waterfront.\n\nElvis would be working with people who had made Marlon Brando, one of his idols, a star. Leiber and Stoller would write the songs, and given that Kazan was known as an actors' director, the chances were that the film could take Elvis to the next level in film stardom -- he could become another Sinatra, someone who was equally respected as an actor and as a singer.\n\nLeiber took the proposal to Jean Aberbach, who was one of the heads of Hill and Range, the music publishing company that handled all the songs that Elvis performed. Aberbach listened to the proposal, called the Colonel to relay the idea, and then said \"If you ever try to interfere with the business or artistic workings of the process known as Elvis Presley, if you ever start thinking in this direction again, you will never work for us again.\"\n\nSo they resigned themselves to just churning out the same stuff for Elvis' films. Although, while they were soured on the process, the next film would be more interesting:\n\n[Excerpt: Elvis Presley, \"King Creole\"]\n\n\"King Creole\" was the first of Elvis' films to be based on a book -- though \"Loving You\" had been based on a short story that had appeared in a magazine. \"A Stone For Danny Fisher\" was one of Harold Robbins' early novels, and was about a boxer in New York who accepts a bribe from criminals to lose a fight, but then wins the fight anyway, goes on the run, but encounters the criminals who bribed him two years later. It's the kind of basic plot that has made perfectly good films in the past -- like the Bruce Willis sequence in Pulp Fiction, for example.\n\nBut while it's a fairly decent plot, it is... not the plot of \"King Creole\". Hal Wallis had bought the rights to the book in the hope of making it a vehicle for James Dean, before Dean's death. When it was reworked as a Presley vehicle, obviously it was changed to be about a singer rather than a boxer, and so the whole main plotline about throwing a fight was dropped, and then the setting was changed to New Orleans... and truth be told, the resulting film seems to have more than a hint of \"Walk on the Wild Side\" about it, with both being set in New Orleans' underworld, and both having a strained relationship between a father and a son as a main theme.\n\nOddly, Leiber and Stoller have never mentioned these similarities, even though it seems very likely to me that someone involved in the Elvis organisation took their idea and used it without credit. They've both, though, talked about how dull they found working on the film's soundtrack -- and even though they were currently Elvis' favourite writers, and producing his sessions, they ended up writing only three of the eleven songs for the film.\n\n\"King Creole\" is, in fact, a rather good film. It has a good cast, including Walter Matthau, and it was directed by Michael Curtiz, who was one of those directors of the time who could turn his hand to anything and make good films in a huge variety of genres. He'd directed, among many, many, many other films, \"White Christmas\", the Errol Flynn Robin Hood, and \"Casablanca\".\n\nHowever, Leiber and Stoller's writing for the film was more or less on autopilot, and they produced songs like \"Steadfast, Loyal, and True\", which is widely regarded as the very worst song they ever wrote:\n\n[Excerpt: Elvis Presley, \"Steadfast, Loyal, and True\"]\n\nThat said, there is an important point that should be made about the songs Elvis recorded for his films generally, and which applies to that song specifically. Many of the songs Elvis would record for his films in later years are generally regarded as being terrible, terrible songs, and with good reason. Songs like \"There's No Room to Rhumba in a Sports Car\", \"Yoga is as Yoga Does\", \"Queenie Wahini's Papaya\", or \"Ito Eats\" have few if any merits.\n\nBut in part that's because they are not intended to work as songs divorced from their context in the film. They're part of the storytelling, not songs that were ever intended to be listened to as songs on their own.\n\nBut still, Leiber and Stoller could undoubtedly have come up with something better than \"Steadfast, Loyal, and True\", had they not been working with the attitude of \"that'll do, it's good enough\".\n\nIndeed, the most artistically interesting song on the soundtrack is one that was not written by Leiber and Stoller at all, a jazz song sung as a duet with Kitty White, \"Crawfish\":\n\n[Excerpt: Elvis Presley and Kitty White, \"Crawfish\"]\n\nWhile other songwriters were turning out things like that, Leiber and Stoller were putting in a minimal amount of effort, despite their previous wish to try to be more artistically adventurous with their work with Elvis. They still, however, managed to write one song that would become known as a classic, even if they mostly did it as a joke:\n\n[Excerpt: Elvis Presley, \"Trouble\"]\n\nThat song combines two different elements of Leiber and Stoller's writing we've looked at previously. The first is their obsession with that stop-time blues riff, which had first turned up in Muddy Waters' \"Hoochie Coochie Man\" back in 1954:\n\n[Excerpt: Muddy Waters, \"Hoochie Coochie Man\"]\n\nLeiber and Stoller had latched on to that riff, as we saw when we talked about \"Riot in Cell Block #9\" back in the episode on \"The Wallflower\". They would consistently use it as a signifier of the blues -- they used the same riff not only in \"Riot in Cell Block #9\" and \"Trouble\", but also \"I'm A Woman\" for Peggy Lee and \"Santa Claus is Back in Town\" for Elvis, and slight variations of it in \"Framed\" by the Robins and \"Alligator Wine\" by Screamin' Jay Hawkins, among many others.\n\nIt's clearly a riff that they loved -- so much so that they pretty much single-handedly made it into something people will now think of as a generic indicator of the blues rather than, as it was originally, a riff that was used on one specific song -- but it's also a riff they could fall back on when they were just phoning in a song.\n\nThe other aspect of their songwriting that \"Trouble\" shows is their habit of writing songs as jokes and then giving them to singers as serious songs. They'd done this before with Elvis, when they'd written \"Love Me\" as a parody of a particular kind of ballad, and he'd then sung it entirely straight. Leiber compared “Trouble” to another song they'd written as a joke, \"Black Denim Trousers and Motorcycle Boots\":\n\n[Excerpt: The Cheers, \"Black Denim Trousers and Motorcycle Boots\"]\n\nLeiber later said of \"Trouble\", comparing it to that song, \"the only people who are going to take them seriously are Hell's Angels and Elvis Presley. I suppose there was a bit of contempt on our part.\" He went on to say \"There's something laughable there. I mean, if you get Memphis Slim or John Lee Hooker singing it, it sounds right, but Elvis did not sound right to us. \"\n\nEither way, Elvis performs the song with enough ferocity that it sounded right to a lot of other people:\n\n[Excerpt: Elvis Presley, \"Trouble\" 2]\n\nHe thought well enough of the song that when, a decade later, he recorded what became known as his comeback special, that was the first song in the show. And while Leiber clearly thought that Elvis didn't really sound like he was trouble in that song, you only have to compare, for example, the French cover version of it by Johnny Hallyday -- the man often referred to as the French Elvis -- to see how much less intense the vocal could have been:\n\n[Excerpt: Johnny Hallyday, \"La Bagarre\"]\n\nBut some time after the King Creole sessions, the Colonel had the chance to separate Elvis from Leiber and Stoller for good. Elvis wanted them at all of his sessions, but Jerry Leiber got pneumonia and was unable to travel to a session. The Colonel kept insisting, and eventually Leiber asked Stoller what he should do, and Stoller said to tell him to do something to himself using words that you can't use without being bumped into the adult section of the podcast directories.\n\nI assume from looking at the dates that this was for a session in June 1958 which Chet Atkins produced. From this point on, Leiber and Stoller would never work in the studio with Elvis again, and nor would they ever again be commissioned to write a song for him. They soon lost their jobs at RCA, which left them to concentrate on their work with R&B artists like the Clovers, the Coasters, and the Drifters.\n\nTheir active collaboration with Elvis -- a collaboration that would define all of them in the eyes of the public -- had lasted only ten months, from April 1957 through February 1958.\n\nBut Elvis kept an eye on their careers. He took note of songs they wrote for LaVern Baker:\n\n[Excerpt: LaVern Baker, \"Saved\"]\n\nThe Clovers:\n\n[Excerpt: The Clovers, \"Bossa Nova Baby\"]\n\nThe Coasters:\n\n[Excerpt: The Coasters, \"Little Egypt\"]\n\nand more, and would record many more of their songs. He'd just never again have them write a song specifically for him.\n\nNot that this mattered in the short term for Leiber and Stoller, as that June 1958 session was Elvis' last one for a couple of years. Because Colonel Parker had forced Elvis into the Army.\n\nAt the time, and for many years afterwards, the US military still drafted every man in his early twenties for two years, and so of course Elvis was going to be drafted, but both the Army and Elvis assumed he'd be able to join Special Services, which would mean he'd be able to continue his career, so long as he performed a few free concerts for the military.\n\nBut Colonel Parker had other ideas. He didn't want his boy going around doing free shows all over the place and devaluing his product, and he also thought that Elvis was getting too big for his boots. Getting him sent away to Germany to spend two years scrubbing latrines and driving tanks, and away from all the industry people who might fill his head with ideas, sounded like an excellent plan. And not only that, but if he didn't give RCA much of a backlog to release while he was away, RCA would realise how much they needed the Colonel.\n\nSo the Colonel leaked to the press that Elvis was going to get special treatment, and got a series of stories planted saying how awful it was that they were going to treat Elvis with kid gloves, so that he could then indignantly deny that Elvis would do anything other than his duty.\n\nFor the next two years, the only recordings Elvis would make would be private ones, of himself and his army friends playing and singing during their down time:\n\n[Excerpt: Elvis Presley, \"Earth Angel\"]\n\nBut there was still one final person in the Colonel's way, and fate took care of that:\n\n[Excerpt: Gladys Presley, \"Home Sweet Home\"]\n\nElvis' mother had been unwell for some time -- and the descriptions of her illness sound an awful lot like the descriptions of Elvis' own final illness a couple of decades later. Recent reports have suggested that Elvis may have had hereditary autoimmune problems -- and that would seem to make a lot of sense given everything we know about him. Given that, it seems likely that his mother also had those problems. It also won't have helped that she was on a series of fad diets, and taking diet pills, in order to lose weight, as the Colonel kept pressuring her to look thinner in photos with Elvis.\n\nWhatever the cause, she ended up hospitalised with hepatitis, which seemed to come from nowhere. Elvis was given compassionate leave to visit her in hospital, where she had the pink Cadillac that Elvis had bought her parked outside the window, so she could see it.\n\nWhen she died on August 14, aged forty-six, Elvis was distraught. There are descriptions in biographies of him that go into detail about his reactions. I won't share those, because reading about them, even more than sixty years later, after everyone involved is dead, feels prurient to me, like an intrusion on something we're not meant to see or even really to comprehend. Suffice it to say that his mother's death was almost certainly the greatest trauma, by far, that Elvis ever experienced.\n\nAt the funeral, Elvis got the Blackwood Brothers -- Gladys' favourite gospel quartet -- to sing \"Precious Memories\":\n\n[Excerpt: The Blackwood Brothers, \"Precious Memories\"]\n\nGladys' death, even more than his induction into the army, was the real end of the first phase of Elvis' life and career. From that point on, while he always cared about his father, he had nobody in his life who he could trust utterly. And even more importantly, Colonel Parker now had nobody standing in his way. Gladys had never really liked or trusted Colonel Parker, but Vernon Presley saw him as somebody with whom he could do business, and as the only person around his son who really understood business. The Colonel had little but contempt for Vernon Presley, but knew how to keep him happy.\n\nWhile Elvis was in the Army, of course Scotty and Bill had to find other work. Scotty became a record producer, producing the record \"Tragedy\" for Thomas Wayne, whose full name was Thomas Wayne Perkins, and who was the brother of Johnny Cash's guitarist Luther Perkins:\n\n[Excerpt: Thomas Wayne, \"Tragedy\"]\n\nThat went to number five on the pop charts, and after that Scotty took a job working for Sam Phillips, and when Elvis got out of the Army and Scotty rejoined him, he continued working for Phillips for a number of years.\n\nBill Black, meanwhile, formed Bill Black's Combo, who had a number of instrumental hits over the next few years:\n\n[Excerpt: Bill Black's Combo, \"Hearts of Stone\"]\n\nUnlike Scotty, Bill never worked with Elvis again after Elvis joined the army, and he concentrated on his own career. Bill Black's Combo had eight top forty hits, and were popular enough that they became the opening act for the Beatles' first US tour. Unfortunately, by that point, Black himself was too ill to tour, and he had to send the group out without him. He died in 1965, aged thirty-nine, from a brain tumour.\n\nAs Elvis entered the Army, a combination of deliberate effort on the Colonel's part and awful events had meant that every possible person who could give Elvis advice about his career, everyone who might tell him to trust his own artistic instincts, or who might push him in new directions, was either permanently removed from his life or distanced from him enough that they could have no further influence on him.\n\nFrom now on, the Colonel was in charge.",
  "itunes:subtitle": "Episode seventy-two of A History of Rock Music in Five Hundred Songs looks at Trouble by Elvis Presley, his induction into the army, and his mothers death. Click the full post to read liner notes, links to more information, and a transcript of the episod",
  "itunes:keywords": "Bill Black,Chet Atkins,Colonel Tom Parker,conscription,D.J. Fontana,Elvis Presley,Hank Garland,Hill and Range publishing,Jean Aberbach,Leiber and Stoller,RCA Records,riffs,Sam Phillips,Scotty Moore,The Jordanaires",
  "itunes:episodeType": "full",
  "itunes:episode": 72,
  "content:encoded": "Episode seventy-two of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Trouble\" by Elvis Presley, his induction into the army, and his mother's death. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/34510124\">on \"When\" by the Kalin Twins</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust%20\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-72-trouble/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\n<a href=\"https://amzn.to/2SY9jkw\">Hound Dog: The Leiber and Stoller Autobiography</a> by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nThere are many, many books about Elvis Presley out there, but the one I'm using as my major resource for information on him, and which has guided my views as to the kind of person he was, is <a href=\"https://amzn.to/2EjL4b9\"><em>Last Train to Memphis</em> by Peter Guralnick</a>, generally considered the best biography of him.\n\n<a href=\"https://amzn.to/2Vw2yGU\"><em>The Colonel</em> </a>by Alanna Nash is a little more tabloidy than those two, but is the only full-length biography I know of of Colonel Tom Parker.\n\n<a href=\"https://amzn.to/2Mm3E6h\">This box set</a> contains all the recordings, including outtakes, for Elvis' 1950s films, while <a href=\"https://amzn.to/2SirZxR\">this one</a> contains just the finished versions of every record he made in the fifties.\n\nAnd <a href=\"https://amzn.to/39dGwAk\">King Creole</a> itself is well worth watching.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nAs 1957 turned into 1958, Elvis' personal life was going badly wrong, even as he was still the biggest star in the world. In particular, his relationships with everyone involved in his career -- everyone except the Colonel, of course -- were getting weakened.\n\nIn September, Scotty Moore and Bill Black had written to Elvis, resigning from his band -- they'd been put on a salary, rather than a split of the money, and then Elvis' concert schedule had been cut back so much that they'd only played fourteen shows so far all year. They were getting into debt while Elvis was earning millions, but worse than that, they felt that the Colonel was controlling access to Elvis so much that they couldn't even talk to him.\n\nDJ Fontana wouldn't sign the letter -- he'd joined the group later than the others, and so he'd not lost his position in the way that the others had. But the other two were gone. Elvis offered them a fifty dollar raise, but Scotty said that on top of that he would need a ten thousand dollar bonus just to clear his debts -- and while Elvis was considering that, a newspaper interview with Moore and Black appeared, in which they talked about Elvis having broken his promise to them that when he earned more, they would earn more.\n\nElvis was incensed, and decided that he didn't need them anyway. He could replace them easily. And for one show, he did just that. He played the fair at his old home town of Tupelo, Mississippi, with DJ and the Jordanaires, and with two new musicians. On guitar was Hank Garland, a great country session musician who was best known for his hit \"Sugarfoot Rag\":\n\n[Excerpt: Hank Garland, \"Sugarfoot Rag\"]\n\nGarland would continue to play with Elvis on recordings and occasional stage performances until 1961, when he was injured in an accident and became unable to perform. On bass, meanwhile, was Chuck Wigington, a friend of DJ's who, like DJ, had been a regular performer in the Louisiana Hayride band, and who had also played for many years with Pee Wee King and his Golden West Cowboys:\n\n[Excerpt: Pee Wee King and his Golden West Cowboys, \"Screwball\"]\n\nWigington actually didn't have a contract for the show, and he wasn't even a full-time musician at the time -- he had to take a leave of absence from his job working in a bank in order to play the gig.\n\nMeanwhile, Scotty and Bill were off on their own playing the Dallas State Fair. But Elvis found that performing live without Scotty and Bill was just not the same, even though Garland and Wigington were perfectly fine musicians, and he decided to offer Scotty and Bill their old jobs back -- sort of. They'd be getting paid a per diem whether or not they were performing, which was something, but after the next recording sessions Bill never again recorded with Elvis -- he was replaced in the studio by Bob Moore. Scotty remained a regular in Elvis' studio band too, but only on rhythm guitar -- Hank Garland was going to be the lead player on Elvis' records from now on.\n\nThe new arrangement required a lot of compromise on both sides, but it meant that Moore and Black were on a better financial footing, and Elvis could remain comfortable on stage, but it was now very clear that the Colonel, at least, saw Black and Moore as replaceable, and neither of them were necessary for Elvis to continue making hit records.\n\nHis relationship with the two men who had come up with him had now permanently changed -- and that was going to be the case with a lot of other relationships as well.\n\nIn particular, the Colonel was starting to think that Leiber and Stoller should be got rid of. The two of them were dangerous as far as the Colonel was concerned. Elvis respected them, they weren't under the Colonel's control, they didn't even *like* the Colonel, and they had careers that didn't rely on their association with Elvis.\n\nBut they were also people who were able to generate hits for Elvis, and they were currently working for RCA, so while that was the case he would put them to use. But they were loose cannons.\n\nNow, before we go further, I should point out that what I'm about to describe is *one* way that Leiber and Stoller have explained what happened. In various different tellings, they've told events in different orders, and described things slightly differently. This is, to the best of my understanding, the most likely series of events, but I could be wrong.\n\nLeiber and Stoller had a complex attitude towards their work with Elvis. They liked Elvis himself, a lot, and they admired and respected his work ethic in the studio, and shared his taste in blues music. But at the same time, they didn't consider the work they were doing with Elvis to be real art, in the way that they considered their R&B records to be. It was easy money -- anything Elvis recorded was guaranteed to sell in massive amounts, so they didn't have to try too hard to write anything particularly good for him, but they didn't like the Colonel, and they were already, after a couple of films, getting bored with the routine nature of writing for Elvis' films.\n\nI'm going to paraphrase a quote from Jerry Leiber here, because I don't want to get this podcast moved into the adults-only section on Apple Podcasts, and the Leiber quote is quite full of expletives, but the gist of it is that they believed that if they were given proper artistic freedom with Elvis they could have made history, but that the people in his management team only wanted money. Every film needed just a few songs to plug into gaps, and they were usually the same type of songs to go in the same type of gaps. They were bored.\n\nAnd they actually had a plan for a project that would stretch them all creatively. Leiber vaguely knew the film producer Charles Feldman, who had produced On The Waterfront and The Seven-Year Itch, and Feldman had come to Leiber with a proposition. He'd recently acquired the rights to the novel A Walk on the Wild Side, set in New Orleans, and he thought that it would be perfect for Elvis. He'd have the script written by Budd Schulberg, and have Elia Kazan direct -- the same team that had made On The Waterfront.\n\nElvis would be working with people who had made Marlon Brando, one of his idols, a star. Leiber and Stoller would write the songs, and given that Kazan was known as an actors' director, the chances were that the film could take Elvis to the next level in film stardom -- he could become another Sinatra, someone who was equally respected as an actor and as a singer.\n\nLeiber took the proposal to Jean Aberbach, who was one of the heads of Hill and Range, the music publishing company that handled all the songs that Elvis performed. Aberbach listened to the proposal, called the Colonel to relay the idea, and then said \"If you ever try to interfere with the business or artistic workings of the process known as Elvis Presley, if you ever start thinking in this direction again, you will never work for us again.\"\n\nSo they resigned themselves to just churning out the same stuff for Elvis' films. Although, while they were soured on the process, the next film would be more interesting:\n\n[Excerpt: Elvis Presley, \"King Creole\"]\n\n\"King Creole\" was the first of Elvis' films to be based on a book -- though \"Loving You\" had been based on a short story that had appeared in a magazine. \"A Stone For Danny Fisher\" was one of Harold Robbins' early novels, and was about a boxer in New York who accepts a bribe from criminals to lose a fight, but then wins the fight anyway, goes on the run, but encounters the criminals who bribed him two years later. It's the kind of basic plot that has made perfectly good films in the past -- like the Bruce Willis sequence in Pulp Fiction, for example.\n\nBut while it's a fairly decent plot, it is... not the plot of \"King Creole\". Hal Wallis had bought the rights to the book in the hope of making it a vehicle for James Dean, before Dean's death. When it was reworked as a Presley vehicle, obviously it was changed to be about a singer rather than a boxer, and so the whole main plotline about throwing a fight was dropped, and then the setting was changed to New Orleans... and truth be told, the resulting film seems to have more than a hint of \"Walk on the Wild Side\" about it, with both being set in New Orleans' underworld, and both having a strained relationship between a father and a son as a main theme.\n\nOddly, Leiber and Stoller have never mentioned these similarities, even though it seems very likely to me that someone involved in the Elvis organisation took their idea and used it without credit. They've both, though, talked about how dull they found working on the film's soundtrack -- and even though they were currently Elvis' favourite writers, and producing his sessions, they ended up writing only three of the eleven songs for the film.\n\n\"King Creole\" is, in fact, a rather good film. It has a good cast, including Walter Matthau, and it was directed by Michael Curtiz, who was one of those directors of the time who could turn his hand to anything and make good films in a huge variety of genres. He'd directed, among many, many, many other films, \"White Christmas\", the Errol Flynn Robin Hood, and \"Casablanca\".\n\nHowever, Leiber and Stoller's writing for the film was more or less on autopilot, and they produced songs like \"Steadfast, Loyal, and True\", which is widely regarded as the very worst song they ever wrote:\n\n[Excerpt: Elvis Presley, \"Steadfast, Loyal, and True\"]\n\nThat said, there is an important point that should be made about the songs Elvis recorded for his films generally, and which applies to that song specifically. Many of the songs Elvis would record for his films in later years are generally regarded as being terrible, terrible songs, and with good reason. Songs like \"There's No Room to Rhumba in a Sports Car\", \"Yoga is as Yoga Does\", \"Queenie Wahini's Papaya\", or \"Ito Eats\" have few if any merits.\n\nBut in part that's because they are not intended to work as songs divorced from their context in the film. They're part of the storytelling, not songs that were ever intended to be listened to as songs on their own.\n\nBut still, Leiber and Stoller could undoubtedly have come up with something better than \"Steadfast, Loyal, and True\", had they not been working with the attitude of \"that'll do, it's good enough\".\n\nIndeed, the most artistically interesting song on the soundtrack is one that was not written by Leiber and Stoller at all, a jazz song sung as a duet with Kitty White, \"Crawfish\":\n\n[Excerpt: Elvis Presley and Kitty White, \"Crawfish\"]\n\nWhile other songwriters were turning out things like that, Leiber and Stoller were putting in a minimal amount of effort, despite their previous wish to try to be more artistically adventurous with their work with Elvis. They still, however, managed to write one song that would become known as a classic, even if they mostly did it as a joke:\n\n[Excerpt: Elvis Presley, \"Trouble\"]\n\nThat song combines two different elements of Leiber and Stoller's writing we've looked at previously. The first is their obsession with that stop-time blues riff, which had first turned up in Muddy Waters' \"Hoochie Coochie Man\" back in 1954:\n\n[Excerpt: Muddy Waters, \"Hoochie Coochie Man\"]\n\nLeiber and Stoller had latched on to that riff, as we saw when we talked about \"Riot in Cell Block #9\" back in the episode on \"The Wallflower\". They would consistently use it as a signifier of the blues -- they used the same riff not only in \"Riot in Cell Block #9\" and \"Trouble\", but also \"I'm A Woman\" for Peggy Lee and \"Santa Claus is Back in Town\" for Elvis, and slight variations of it in \"Framed\" by the Robins and \"Alligator Wine\" by Screamin' Jay Hawkins, among many others.\n\nIt's clearly a riff that they loved -- so much so that they pretty much single-handedly made it into something people will now think of as a generic indicator of the blues rather than, as it was originally, a riff that was used on one specific song -- but it's also a riff they could fall back on when they were just phoning in a song.\n\nThe other aspect of their songwriting that \"Trouble\" shows is their habit of writing songs as jokes and then giving them to singers as serious songs. They'd done this before with Elvis, when they'd written \"Love Me\" as a parody of a particular kind of ballad, and he'd then sung it entirely straight. Leiber compared “Trouble” to another song they'd written as a joke, \"Black Denim Trousers and Motorcycle Boots\":\n\n[Excerpt: The Cheers, \"Black Denim Trousers and Motorcycle Boots\"]\n\nLeiber later said of \"Trouble\", comparing it to that song, \"the only people who are going to take them seriously are Hell's Angels and Elvis Presley. I suppose there was a bit of contempt on our part.\" He went on to say \"There's something laughable there. I mean, if you get Memphis Slim or John Lee Hooker singing it, it sounds right, but Elvis did not sound right to us. \"\n\nEither way, Elvis performs the song with enough ferocity that it sounded right to a lot of other people:\n\n[Excerpt: Elvis Presley, \"Trouble\" 2]\n\nHe thought well enough of the song that when, a decade later, he recorded what became known as his comeback special, that was the first song in the show. And while Leiber clearly thought that Elvis didn't really sound like he was trouble in that song, you only have to compare, for example, the French cover version of it by Johnny Hallyday -- the man often referred to as the French Elvis -- to see how much less intense the vocal could have been:\n\n[Excerpt: Johnny Hallyday, \"La Bagarre\"]\n\nBut some time after the King Creole sessions, the Colonel had the chance to separate Elvis from Leiber and Stoller for good. Elvis wanted them at all of his sessions, but Jerry Leiber got pneumonia and was unable to travel to a session. The Colonel kept insisting, and eventually Leiber asked Stoller what he should do, and Stoller said to tell him to do something to himself using words that you can't use without being bumped into the adult section of the podcast directories.\n\nI assume from looking at the dates that this was for a session in June 1958 which Chet Atkins produced. From this point on, Leiber and Stoller would never work in the studio with Elvis again, and nor would they ever again be commissioned to write a song for him. They soon lost their jobs at RCA, which left them to concentrate on their work with R&B artists like the Clovers, the Coasters, and the Drifters.\n\nTheir active collaboration with Elvis -- a collaboration that would define all of them in the eyes of the public -- had lasted only ten months, from April 1957 through February 1958.\n\nBut Elvis kept an eye on their careers. He took note of songs they wrote for LaVern Baker:\n\n[Excerpt: LaVern Baker, \"Saved\"]\n\nThe Clovers:\n\n[Excerpt: The Clovers, \"Bossa Nova Baby\"]\n\nThe Coasters:\n\n[Excerpt: The Coasters, \"Little Egypt\"]\n\nand more, and would record many more of their songs. He'd just never again have them write a song specifically for him.\n\nNot that this mattered in the short term for Leiber and Stoller, as that June 1958 session was Elvis' last one for a couple of years. Because Colonel Parker had forced Elvis into the Army.\n\nAt the time, and for many years afterwards, the US military still drafted every man in his early twenties for two years, and so of course Elvis was going to be drafted, but both the Army and Elvis assumed he'd be able to join Special Services, which would mean he'd be able to continue his career, so long as he performed a few free concerts for the military.\n\nBut Colonel Parker had other ideas. He didn't want his boy going around doing free shows all over the place and devaluing his product, and he also thought that Elvis was getting too big for his boots. Getting him sent away to Germany to spend two years scrubbing latrines and driving tanks, and away from all the industry people who might fill his head with ideas, sounded like an excellent plan. And not only that, but if he didn't give RCA much of a backlog to release while he was away, RCA would realise how much they needed the Colonel.\n\nSo the Colonel leaked to the press that Elvis was going to get special treatment, and got a series of stories planted saying how awful it was that they were going to treat Elvis with kid gloves, so that he could then indignantly deny that Elvis would do anything other than his duty.\n\nFor the next two years, the only recordings Elvis would make would be private ones, of himself and his army friends playing and singing during their down time:\n\n[Excerpt: Elvis Presley, \"Earth Angel\"]\n\nBut there was still one final person in the Colonel's way, and fate took care of that:\n\n[Excerpt: Gladys Presley, \"Home Sweet Home\"]\n\nElvis' mother had been unwell for some time -- and the descriptions of her illness sound an awful lot like the descriptions of Elvis' own final illness a couple of decades later. Recent reports have suggested that Elvis may have had hereditary autoimmune problems -- and that would seem to make a lot of sense given everything we know about him. Given that, it seems likely that his mother also had those problems. It also won't have helped that she was on a series of fad diets, and taking diet pills, in order to lose weight, as the Colonel kept pressuring her to look thinner in photos with Elvis.\n\nWhatever the cause, she ended up hospitalised with hepatitis, which seemed to come from nowhere. Elvis was given compassionate leave to visit her in hospital, where she had the pink Cadillac that Elvis had bought her parked outside the window, so she could see it.\n\nWhen she died on August 14, aged forty-six, Elvis was distraught. There are descriptions in biographies of him that go into detail about his reactions. I won't share those, because reading about them, even more than sixty years later, after everyone involved is dead, feels prurient to me, like an intrusion on something we're not meant to see or even really to comprehend. Suffice it to say that his mother's death was almost certainly the greatest trauma, by far, that Elvis ever experienced.\n\nAt the funeral, Elvis got the Blackwood Brothers -- Gladys' favourite gospel quartet -- to sing \"Precious Memories\":\n\n[Excerpt: The Blackwood Brothers, \"Precious Memories\"]\n\nGladys' death, even more than his induction into the army, was the real end of the first phase of Elvis' life and career. From that point on, while he always cared about his father, he had nobody in his life who he could trust utterly. And even more importantly, Colonel Parker now had nobody standing in his way. Gladys had never really liked or trusted Colonel Parker, but Vernon Presley saw him as somebody with whom he could do business, and as the only person around his son who really understood business. The Colonel had little but contempt for Vernon Presley, but knew how to keep him happy.\n\nWhile Elvis was in the Army, of course Scotty and Bill had to find other work. Scotty became a record producer, producing the record \"Tragedy\" for Thomas Wayne, whose full name was Thomas Wayne Perkins, and who was the brother of Johnny Cash's guitarist Luther Perkins:\n\n[Excerpt: Thomas Wayne, \"Tragedy\"]\n\nThat went to number five on the pop charts, and after that Scotty took a job working for Sam Phillips, and when Elvis got out of the Army and Scotty rejoined him, he continued working for Phillips for a number of years.\n\nBill Black, meanwhile, formed Bill Black's Combo, who had a number of instrumental hits over the next few years:\n\n[Excerpt: Bill Black's Combo, \"Hearts of Stone\"]\n\nUnlike Scotty, Bill never worked with Elvis again after Elvis joined the army, and he concentrated on his own career. Bill Black's Combo had eight top forty hits, and were popular enough that they became the opening act for the Beatles' first US tour. Unfortunately, by that point, Black himself was too ill to tour, and he had to send the group out without him. He died in 1965, aged thirty-nine, from a brain tumour.\n\nAs Elvis entered the Army, a combination of deliberate effort on the Colonel's part and awful events had meant that every possible person who could give Elvis advice about his career, everyone who might tell him to trust his own artistic instincts, or who might push him in new directions, was either permanently removed from his life or distanced from him enough that they could have no further influence on him.\n\nFrom now on, the Colonel was in charge.",
  "enclosure": "",
  "itunes:summary": "Episode seventy-two of A History of Rock Music in Five Hundred Songs looks at \"Trouble\" by Elvis Presley, his induction into the army, and his mother's death. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"When\" by the Kalin Twins.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nHound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nThere are many, many books about Elvis Presley out there, but the one I'm using as my major resource for information on him, and which has guided my views as to the kind of person he was, is Last Train to Memphis by Peter Guralnick, generally considered the best biography of him.\n\nThe Colonel by Alanna Nash is a little more tabloidy than those two, but is the only full-length biography I know of of Colonel Tom Parker.\n\nThis box set contains all the recordings, including outtakes, for Elvis' 1950s films, while this one contains just the finished versions of every record he made in the fifties.\n\nAnd King Creole itself is well worth watching.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nAs 1957 turned into 1958, Elvis' personal life was going badly wrong, even as he was still the biggest star in the world. In particular, his relationships with everyone involved in his career -- everyone except the Colonel, of course -- were getting weakened.\n\nIn September, Scotty Moore and Bill Black had written to Elvis, resigning from his band -- they'd been put on a salary, rather than a split of the money, and then Elvis' concert schedule had been cut back so much that they'd only played fourteen shows so far all year. They were getting into debt while Elvis was earning millions, but worse than that, they felt that the Colonel was controlling access to Elvis so much that they couldn't even talk to him.\n\nDJ Fontana wouldn't sign the letter -- he'd joined the group later than the others, and so he'd not lost his position in the way that the others had. But the other two were gone. Elvis offered them a fifty dollar raise, but Scotty said that on top of that he would need a ten thousand dollar bonus just to clear his debts -- and while Elvis was considering that, a newspaper interview with Moore and Black appeared, in which they talked about Elvis having broken his promise to them that when he earned more, they would earn more.\n\nElvis was incensed, and decided that he didn't need them anyway. He could replace them easily. And for one show, he did just that. He played the fair at his old home town of Tupelo, Mississippi, with DJ and the Jordanaires, and with two new musicians. On guitar was Hank Garland, a great country session musician who was best known for his hit \"Sugarfoot Rag\":\n\n[Excerpt: Hank Garland, \"Sugarfoot Rag\"]\n\nGarland would continue to play with Elvis on recordings and occasional stage performances until 1961, when he was injured in an accident and became unable to perform. On bass, meanwhile, was Chuck Wigington, a friend of DJ's who, like DJ, had been a regular performer in the Louisiana Hayride band, and who had also played for many years with Pee Wee King and his Golden West Cowboys:\n\n[Excerpt: Pee Wee King and his Golden West Cowboys, \"Screwball\"]\n\nWigington actually didn't have a contract for the show, and he wasn't even a full-time musician at the time -- he had to take a leave of absence from his job working in a bank in order to play the gig.\n\nMeanwhile, Scotty and Bill were off on their own playing the Dallas State Fair. Bu",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode seventy-two of A History of Rock Music in Five Hundred Songs looks at \"Trouble\" by Elvis Presley, his induction into the army, and his mother's death. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"When\" by the Kalin Twins.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nHound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nThere are many, many books about Elvis Presley out there, but the one I'm using as my major resource for information on him, and which has guided my views a",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}