{
  "title": "560: The Best Characters, Scenes, and Beasts of 'Secrets of Dumbledore'",
  "link": "https://audioboom.com/posts/8072338",
  "itunes:episode": 560,
  "itunes:title": "The Best Characters, Scenes, and Beasts of 'Secrets of Dumbledore'",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3833,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>This week, we continue our review of <em>Fantastic Beasts: The Secrets of Dumbledore</em>, this time focusing on the various odds and ends of the film! Plus, we hand out our \"Bunty Awards,\" which are accolades for several aspects of the movie! Stay tuned for many, many more thoughts on the weeks and months ahead!<br>\n<br>\n\n</div>\n<ul>\n<li>The \"Bunty\" award for our Favorite New Character, Favorite New Beast, etc</li>\n<li>What was the one stand-out scene of the film?</li>\n<li>Was the movie poster for the film misleading? (YES)</li>\n<li>Eric took a stopwatch into his <em>Secrets of Dumbledore</em> screening... for a very specific experiment.</li>\n<li>We, like Jacob, were confused by the plot to confuse Grindelwald.</li>\n<li>What about Grindelwald's visions in the puddles and mirrors, what do they mean?</li>\n<li>Was Credence made to sound more like Aberforth at the start of the film? And was anyone else thinking he would have a romance with Queenie from their early interaction?</li>\n<li>The re-use of classic Harry Potter lines is scrutinized by Micah.</li>\n<li>Was the Anton Vogel actor too similar in appearance to Mads as Grindelwald, and did that lead to confusion about the plot and characters?</li>\n<li>Could Credence be conceivably written out of the franchise at this point? And why can't the phoenix intervene to save him from his condition? It's... right there.</li>\n<li>How do we feel about all the Aberforth and goat stuff now after seeing this movie?</li>\n<li>Why doesn't anyone in the film call the head of the International Confederation of Wizards by its book-given title?</li>\n<li>Revisiting some 'Crackpot Theories,' could Leta still live?</li>\n<li>Quizzitch: According to The Secrets of Dumbledore, What is Bunty’s given surname? <a href=\"https://mugglecast.com/quizzitch/\">Submit your answer</a>!</li>\n<li>This week's episode is sponsored by BetterHelp (Get 10% off your first month at <a href=\"https://www.BetterHelp.com/mugglecast\">BetterHelp.com/mugglecast</a>) and Masterclass (get 15% off an annual membership at <a href=\"https://www.Masterclass.com/mugglecast\">Masterclass.com/mugglecast</a>!)</li>\n</ul>\n",
  "pubDate": "Tue, 26 Apr 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-04-25:/posts/8072338",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}