{
  "title": "#301 — The Politics of Unreality: Ukraine and Nuclear Risk",
  "pubDate": "Tue, 25 Oct 2022 16:21:03 +0000",
  "guid": "10a8d744-1426-45b7-9fff-aa8930c5c66c",
  "link": "https://wakingup.libsyn.com/301-the-politics-of-unreality-ukraine-and-nuclear-risk",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Only the first hour of this episode is available on the paywalled podcast version (the BLACK podcast logo). If you’d like to hear the full 1 hour and 39 minutes of this episode and gain access to all full-length episodes of the podcast, you’ll need to SUBSCRIBE</span> <a href= \"https://www.samharris.org/subscribe\"><span style= \"font-weight: 400;\">here</span></a><span style= \"font-weight: 400;\">. If you’re already subscribed and on the private RSS feed, the podcast logo should appear RED.</span></p> <p><span style=\"font-weight: 400;\">Sam Harris speaks with Timothy Snyder about the ongoing war in Ukraine. They discuss the effect of Russian propaganda, Putin’s motives, whether the US and NATO bear some responsibility for the war, widespread calls for de-escalation, nuclear blackmail and nuclear risk, and other topics.</span></p> <p><span style=\"font-weight: 400;\">Learning how to train your mind is the single greatest investment you can make in life. That’s why Sam Harris created the</span> <a href= \"http://wakingup.com/\"><span style=\"font-weight: 400;\">Waking Up</span></a> <span style=\"font-weight: 400;\">app. From rational mindfulness practice to lessons on some of life’s most important topics, join Sam as he demystifies the practice of meditation and explores the theory behind it.</span></p> <p><span style=\"font-weight: 400;\"> </span></p> <p><span style=\"font-weight: 400;\">If the Making Sense podcast logo in your player is BLACK, you can SUBSCRIBE to gain access to all full-length episodes at</span> <a href= \"http://samharris.org/subscribe\"><span style= \"font-weight: 400;\">samharris.org/subscribe</span></a><span style= \"font-weight: 400;\">.</span></p>",
  "content:encoded": "<p>Only the first hour of this episode is available on the paywalled podcast version (the BLACK podcast logo). If you’d like to hear the full 1 hour and 39 minutes of this episode and gain access to all full-length episodes of the podcast, you’ll need to SUBSCRIBE <a href= \"https://www.samharris.org/subscribe\">here</a>. If you’re already subscribed and on the private RSS feed, the podcast logo should appear RED.</p> <p>Sam Harris speaks with Timothy Snyder about the ongoing war in Ukraine. They discuss the effect of Russian propaganda, Putin’s motives, whether the US and NATO bear some responsibility for the war, widespread calls for de-escalation, nuclear blackmail and nuclear risk, and other topics.</p> <p>Learning how to train your mind is the single greatest investment you can make in life. That’s why Sam Harris created the <a href= \"http://wakingup.com/\">Waking Up</a> app. From rational mindfulness practice to lessons on some of life’s most important topics, join Sam as he demystifies the practice of meditation and explores the theory behind it.</p> <p> </p> <p>If the Making Sense podcast logo in your player is BLACK, you can SUBSCRIBE to gain access to all full-length episodes at <a href= \"http://samharris.org/subscribe\">samharris.org/subscribe</a>.</p>",
  "enclosure": "",
  "itunes:duration": "01:00:53",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Only the first hour of this episode is available on the paywalled podcast version (the BLACK podcast logo). If you’d like to hear the full 1 hour and 39 minutes of this episode and gain access to all full-length episodes of the podcast, you’ll...",
  "itunes:episodeType": "full"
}