{
  "id": "tag:blogger.com,1999:blog-2471378914199150966.post-7351459372120961354",
  "published": "2022-06-23T15:04:00.002-07:00",
  "updated": "2022-07-20T09:43:34.710-07:00",
  "category": "",
  "title": "Chrome 104 Beta: New Media Query Syntax, Region Capture, and More",
  "content": "<p>Unless otherwise noted, changes described below apply to the newest Chrome beta channel release for Android, Chrome OS, Linux, macOS, and Windows. Learn more about the features listed here through the provided links or from the list on <a href=\"https://www.chromestatus.com/features#milestone%3D76\">ChromeStatus.com</a>. Chrome 104 is beta as of June 23, 2022. You can <a href=\"https://www.google.com/chrome/beta/\">download the latest on Google.com</a> for desktop or on Google Play Store on Android. </p> <h1>Region Capture</h1><p>Chrome on Desktop can now crop self-captured video tracks. Web apps are already able to capture video in a tab using <code>getDisplayMedia()</code>. Region capture allows web apps to crop a track and remove content from it, typically before sharing it remotely. </p> <p>For example, consider a productivity web app with built-in video conferencing. During a video conference, a web app could use cropping to exclude the video conferencing portion of the screen (outlined in red below) avoiding a hall-of-mirrors effect. For more information, see <a href=\"https://developer.chrome.com/docs/web-platform/region-capture/\">Better tab sharing with Region Capture</a>.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgahf8S_W0OwGCUp7HAQGJRFoi3qKbWWbcvI0mGRS95y5hjltIaPR-7uuq-R95UDaX3u8ZjAkTEqleyg-CInac2RDKiB_T31dA2gm-WrNlBhES5hrECaKCaTBdX5ZyhTH5WyUs2jovh0v1aAme3F92uZOXOTwN4PN5DYziAvWwxvYDSk2s60q4CD3YBaQ/s845/region-capture.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"A region capture window: broadcast content in blue, cropped content in red.\" border=\"0\" data-original-height=\"599\" data-original-width=\"845\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgahf8S_W0OwGCUp7HAQGJRFoi3qKbWWbcvI0mGRS95y5hjltIaPR-7uuq-R95UDaX3u8ZjAkTEqleyg-CInac2RDKiB_T31dA2gm-WrNlBhES5hrECaKCaTBdX5ZyhTH5WyUs2jovh0v1aAme3F92uZOXOTwN4PN5DYziAvWwxvYDSk2s60q4CD3YBaQ/s16000/region-capture.png\" title=\"When broadcasting content, the red portion will be cropped.\" /></a></div><br /><p><br /></p> <h1>Media Queries Level 4 Syntax and Evaluation</h1><p>Media Queries enable <a href=\"https://web.dev/learn/design/\">responsive design</a>, and the range features that enable testing the minimum and maximum size of the viewport are used <a href=\"https://almanac.httparchive.org/en/2021/css#media-features-in-use\">by around 80% of sites</a> that use media queries. </p> <p>The Media Queries Level 4 specification includes a new syntax for these range queries. They can now be written using ordinary mathematical comparison operators. Also supported are the logical operators <code>or</code> and <code>not</code>, and nesting and evaluation of \"unknown\" features. For example, a media query previously written like this:</p> <pre>@media (min-width: 400px) { … }<br /></pre> <p>Can now be written like this:</p> <pre>@media (width &gt;= 400px) { … }<br /></pre> <p>For more information, see <a href=\"http://developer.chrome.com/blog/media-query-range-syntax/\">New syntax for range media queries in Chrome 104</a>. </p> <h1>Origin Trials</h1><p>This version of Chromium supports the origin trials described below. Origin trials allow you to try new features and give feedback on usability, practicality, and effectiveness to the web standards community. To register for any of the origin trials currently supported in Chromium, including the ones described below, visit the <a href=\"https://developers.chrome.com/origintrials/#/trials/active\">Chrome Origin Trials dashboard</a>. To learn more about origin trials in Chrome, visit the <a href=\"https://web.dev/origin-trials/\">Origin Trials Guide for Web Developers</a>. Microsoft Edge runs its own origin trials separate from Chrome. To learn more, see the <a href=\"https://developer.microsoft.com/en-us/microsoft-edge/origin-trials/\">Microsoft Edge Origin Trials Developer Console</a>. </p> <h2>New Origin Trials</h2> <h3>Focusgroup</h3><p>The <code>focusgroup</code> CSS property improves keyboard focus navigation using the keyboard arrow keys among a set of focusable elements. Adding this feature to browsers allows web developers to control focus navigation without custom solutions that can lead to a lack of consistency, accessibility, and interoperability. <a href=\"https://developer.microsoft.com/en-us/microsoft-edge/origin-trials/html-focusgroup-attribute/registration/\">Sign up here</a> for the Microsoft Edge origin trial. It's scheduled to last through 107.</p> <h3>Opt Out of Credit Card Storage</h3><p>Secure Payment Confirmation now supports a means for users to opt out of storing their credit card data to make later purchases easier. To use the new feature, set <code>showOptOut</code> to <code>true</code> on <code>methodData.data</code>, which is passed as the first parameter of the <code>PaymentRequest()</code> constructor. For example:</p> <pre>const methodata = [{ <br />  …<br />  data: {<br />    …<br />    showOptOut: true<br />    …<br />  }<br />}];<br />const request = new PaymentRequest(methodData, details);<br /></pre> <p>To see an example in context <a href=\"https://rsolomakhin.github.io/pr/spc-opt-out/\">check out the demo</a>. You can <a href=\"https://developer.chrome.com/origintrials/#/view_trial/3293257227514675201\">sign up here</a> for the origin trial. It's scheduled to last through Chrome 106.</p> <h3>Shared Element Transitions</h3><p>Shared Element Transitions enables the creation of polished transitions in single-page applications (SPAs). Minimal development effort is required by devs to make transitions look nice; they can choose to use default animation properties, or they can customize their own transition effects to achieve the desired transition experience.Transitions are set declaratively using CSS properties. For more information, see <a href=\"https://github.com/WICG/shared-element-transitions/blob/main/explainer.md\">Shared Element Transitions</a>. Visit the dashboard to <a href=\"https://www.google.com/url?q=https://chromestatus.com/feature/5193009714954240&amp;sa=D&amp;source=docs&amp;ust=1655396015685272&amp;usg=AOvVaw3HhlvSDCzPW65WHM23ioHj\">sign up for the origin trial</a>.</p> <h2>Completed Origin Trials</h2><p>The following features, previously in a Chrome origin trial, are now enabled by default.</p> <h3>Speculation Rules</h3><p>Speculation rules provide a mechanism for web content to permit <a href=\"https://www.chromestatus.com/feature/5740655424831488\">prefetching or prerendering of certain URLs</a>. For example:</p> <pre>&lt;script type=\"speculationrules\"&gt;<br />  {<br />    \"prefetch\": [<br />      {\"source\": \"list\", \"urls\": [\"/weather/kitchener\", \"/weather/seattle\", \"/weather/tokyo\"]}<br />    ]<br />  }<br />&lt;/script&gt;<br /></pre> <h3>Subresource Loading with Web Bundles</h3><p>Subresource loading with web bundles is a way to load many resources efficiently. To use the feature a web page declares that certain resources are provided by a web bundle at a particular URL. For example:</p> <pre>&lt;script type=\"webbundle\"&gt;<br />{<br />   \"source\": \"https://example.com/dir/subresources.wbn\",<br />   \"resources\": [\"https://example.com/dir/a.js\", \"https://example.com/dir/b.js\", \"https://example.com/dir/c.png\"]<br />}<br />&lt;/script&gt;<br /></pre> <p>For information on creating web bundles, see <a href=\"https://web.dev/web-bundles/\">Get started with Web Bundles</a>. For more information on subresource loading using web bundles, see <a href=\"https://chromium.googlesource.com/chromium/src.git/+/refs/heads/master/content/browser/web_package/subresource_loading_origin_trial.md\">Origin Trial for Subresource Loading with Web Bundles</a>.</p> <h1>Other Features in this Release</h1> <h2>Cookie Expires/Max-Age Attribute Upper Limit</h2><p>When cookies are set with an explicit Expires/Max-Age attribute <a href=\"https://www.chromestatus.com/feature/4887741241229312\">the value will now be capped</a> to no more than 400 days. Previously, there was no limit and cookies could expire as much as multiple millennia in the future. This follows a <a href=\"https://httpwg.org/http-extensions/draft-ietf-httpbis-rfc6265bis.html#name-the-expires-attribute:~:text=The%20limit%20SHOULD%20NOT%20be%20greater%20than%20400%20days%20(34560000%20seconds)%20in%20the%20future.\">change in the spec</a>.<br /><br />400 days was chosen as a round number close to 13 months. This duration ensures that sites visited roughly once a year (for example, sites for choosing health insurance benefits) will continue to work.</p> <h2>CSS object-view-box</h2><p>The <a href=\"https://www.chromestatus.com/feature/5213032857731072\"><code>object-view-box</code> property</a> allows authors to specify a portion of an image that should draw within the content box of a target replaced element. This enables creation of images with a custom glow or shadow applied, with proper <code>ink-overflow</code> behavior such as a CSS shadow would have. For more information, see <a href=\"https://ishadeed.com/article/css-object-view-box/\">First Look At The CSS object-view-box Property</a>.</p> <h2>Fullscreen Capability Delegation</h2><p><a href=\"https://www.chromestatus.com/feature/6441688242323456\">Fullscreen Capability Delegation</a> allows a Window to transfer the ability to call <code>requestFullscreen()</code> to another Window it trusts after relinquishing the transient user activation at the sender Window. This feature is based on the <a href=\"https://chromestatus.com/feature/5708770829139968\">general delegation mechanism</a> that shipped in Chrome 100.</p> <h2>Multi-Screen Window Placement: Fullscreen Companion Window</h2><p>Fullscreen Companion Window allows sites to place fullscreen content and a popup window on separate screens from a single user activation. There is a <a href=\"https://michaelwasserman.github.io/window-placement-demo/\">demo available</a> with <a href=\"https://github.com/michaelwasserman/window-placement-demo\">source code</a> on GitHub.</p> <h2>Permissions Policy for Web Bluetooth API</h2><p>Web Bluetooth is <a href=\"https://www.chromestatus.com/feature/6439287120723968\">now controllable with a Permissions Policy</a>. The token is named <code>\"bluetooth\"</code> and has a default allowlist of <code>'self'</code>.</p> <h2>visual-box on overflow-clip-margin</h2><p>The <a href=\"https://www.chromestatus.com/feature/5082351989161984\"><code>overflow-clip-margin</code> property</a> specifies how far an element's content is allowed to paint before being clipped. This feature allows using <code>visual-box</code> values to configure the reference box that defines the overflow clip edge the content is clipped to. </p> <h2>Web Custom Formats for Async Clipboard API</h2><p><a href=\"https://www.chromestatus.com/feature/5649558757441536\">Web Custom Formats</a> lets websites read and write arbitrary unsanitized payloads using a standardized web custom format, as well as read and write a limited subset of OS-specific formats (for supporting legacy apps).<br /><br />The name of the clipboard format is mangled by the browser in a standardized way to indicate that the content is from the web. This allows platform applications to opt-in to accepting the unsanitized content.</p> <p>Some web app developers want to exchange data payloads between web and platform applications via operating system clipboards. The <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Clipboard_API\">Clipboard API</a> supports the most popular standardized data types (text, image, rich text) across all platforms. However, this API does not scale to the long tail of specialized formats. In particular, custom formats, non-web-standard formats like TIFF (a large image format), and proprietary formats like <code>docx</code> (a document format), are not supported by the current Web Platform.</p> <h2>WebGL Canvas Color Management</h2><p>As per the spec, Chromium's implementation of WebGL <a href=\"https://chromestatus.com/feature/4814886323355648\">now allows specifying</a>:</p> <ul><li>The color space of a drawing buffer.</li><li>The color space that content should be converted to when importing as a texture.</li></ul> <p>Before this version of Chrome, both of these defaulted to sRGB. Now they can also use \"display-p3\".</p> <h1>Deprecations, and Removals</h1><p>This version of Chrome introduces the deprecations and removals listed below. Visit ChromeStatus.com for lists of <a href=\"https://www.chromestatus.com/features#browsers.chrome.status%3A%22Deprecated%22\">current deprecations</a>  and <a href=\"https://www.chromestatus.com/features#browsers.chrome.status:%22Removed%22\">previous removals</a>.</p> <h2>Block Third-Party Contexts Navigating to Filesystem URLs</h2><p>iframes can <a href=\"https://chromestatus.com/feature/5816343679991808\">no longer navigate to filesystem URLs</a>. Top frame support for navigating to filesystem URLs was dropped in Chrome 68.</p> <h2>Remove Non-Standard Client Hint Mode</h2><p>Four client hints (<code>dpr</code>, <code>width</code>, <code>viewport-width</code>, and <code>device-memory</code>) have a default allowlist of <code>self</code> but behave as though they have a default allowlist of <code>*</code> on Android, contrary to the spec. <a href=\"https://www.chromestatus.com/feature/5694492182052864\">This is now fixed</a>, increasing privacy on Android by requiring explicit delegation of these hints.</p> <h2>Remove U2F API (Cryptotoken)</h2><p>Chrome's legacy U2F API for interacting with security keys <a href=\"https://www.chromestatus.com/feature/5759004926017536\">is no longer supported</a>. U2F security keys themselves are not deprecated and will continue to work.</p> <p>Affected sites should migrate to the <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Web_Authentication_API\">Web Authentication API</a>. Credentials that were originally registered via the U2F API can be challenged via web authentication. USB security keys that are supported by the U2F API are also supported by the Web Authentication API.</p> <p>U2F is Chrome's original security key API. It allows sites to register public key credentials on USB security keys and challenge them for building phishing-resistant two-factor authentication systems. U2F never became an open web standard and was subsumed by the Web Authentication API (launched in Chrome 67). Chrome never directly supported the FIDO U2F JavaScript API, but rather shipped a component extension called cryptotoken, which exposes an equivalent <code>chrome.runtime.sendMessage()</code> method. U2F and Cryptotoken are firmly in maintenance mode and have encouraged sites to migrate to the Web Authentication API for the last two years.</p>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Chromium Blog",
    "uri": "http://www.blogger.com/profile/06394244468194711527",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}