{
  "title": "A Comparative Study of Smartphone and Smart TV Apps. (arXiv:2211.01752v1 [cs.SE])",
  "link": "http://arxiv.org/abs/2211.01752",
  "description": "<p>Context: Smart TVs have become one of the most popular television types. Many\napp developers and service providers have designed TV versions for their\nsmartphone applications. Despite the extensive studies on mobile app analysis,\nits TV equivalents receive far too little attention. The relationship between\nphone and TV has not been the subject of research works. Objective: In this\npaper, we aim to characterize the relationship between smartphone and smart TV\napps. To fill this gap, we conduct a comparative study on smartphone and smart\nTV apps in this work, which is the starting and fundamental step to uncover the\ndomain-specific challenges. Method: We gather a large-scale phone/TV app pairs\nfrom Google Play Store. We then analyzed the app pairs quantitatively and\nqualitatively from a variety of perspectives, including non-code (e.g.,\nmetadata, resources, permissions, etc.), code (e.g., components, methods, user\ninteractions, etc.), security and privacy (e.g., reports of AndroBugs and\nFlowDroid). Results: Our experimental results indicate that (1) the code of the\nsmartphone and TV apps can be released in the same app package or in separate\napp packages with the same package name; (2) 43% of resource files and 50% of\ncode methods are reused between phone/TV app pairs; (3) TV and phone versions\nof the same app often encounter different kinds of security vulnerabilities;\nand (4) TV apps encounter fewer user interactions than their phone versions,\nbut the type of user interaction events, surprisingly, are similar between\nphone/TV apps. Conclution: Our findings are valuable for developers and\nacademics in comprehending the TV app ecosystem by providing additional insight\ninto the migration of phone apps to TVs and the design mechanism of analysis\ntools for TV apps.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Liu_Y/0/1/0/all/0/1\">Yonghui Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chen_X/0/1/0/all/0/1\">Xiao Chen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_Y/0/1/0/all/0/1\">Yue Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kong_P/0/1/0/all/0/1\">Pingfan Kong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Bissyande_T/0/1/0/all/0/1\">Tegawend&#xe9; F. Bissyande</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Klein_J/0/1/0/all/0/1\">Jacques Klein</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sun_X/0/1/0/all/0/1\">Xiaoyu Sun</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chen_C/0/1/0/all/0/1\">Chunyang Chen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Grundy_J/0/1/0/all/0/1\">John Grundy</a>"
}