{
  "title": "Obedience to Your Husband in Islam - Part 1",
  "itunes:title": "Obedience to Your Husband in Islam - Part 1",
  "pubDate": "Sat, 09 Feb 2019 06:16:30 +0000",
  "guid": "c646041f89174a9b8e893bfcbc35b17e",
  "link": "https://wivesofjannah.libsyn.com/obedience-to-your-husband-in-islam-part-1",
  "itunes:image": "",
  "description": "<p>This Wives of Jannah special feature podcast features Megan Wyatt, founder of Wives of Jannah interviewing guest speaker Sr. Noha Alshugairi who is a licensed Marriage & Family therapist and certified Positive Discipline trainer focused on the Muslim community and based in Orange County, California.<br /> <br /> Originally a webinar, Megan interviewed Sr. Noha on the meaning of obedience to one's husband in Islam, the rights of a husband and the rights of a wife, and discussing the goal of marriage in Islam.<br /> <br /> This podcast is timeless in its points and serves as a strong foundation for understanding the dynamics between a husband and wife in Islam. <br /> <br /> Along with obedience, they discuss domestic violence, sexual intimacy, financial control, the right to say no, the role of culture in a marriage, and how to understand the meaning of love and mercy in marriage. <br /> <br /> This is broken up into a three part series so make sure to listen to them in order. <br /> <br /> If you'd like to get in touch with Sr. Noha, please visit her website at <a href= \"http://www.sakinacounseling.com/\">http://www.sakinacounseling.com/</a>. <br />  <br /> To ask a question or download a free ebook visit <a href= \"http://www.wivesofjannah.com\">www.wivesofjannah.com/ebooks<br /> www.wivesofjannah.com/askaquestion<br /> <br /></a></p>",
  "content:encoded": "<p>This Wives of Jannah special feature podcast features Megan Wyatt, founder of Wives of Jannah interviewing guest speaker Sr. Noha Alshugairi who is a licensed Marriage & Family therapist and certified Positive Discipline trainer focused on the Muslim community and based in Orange County, California.  Originally a webinar, Megan interviewed Sr. Noha on the meaning of obedience to one's husband in Islam, the rights of a husband and the rights of a wife, and discussing the goal of marriage in Islam.  This podcast is timeless in its points and serves as a strong foundation for understanding the dynamics between a husband and wife in Islam.   Along with obedience, they discuss domestic violence, sexual intimacy, financial control, the right to say no, the role of culture in a marriage, and how to understand the meaning of love and mercy in marriage.   This is broken up into a three part series so make sure to listen to them in order.   If you'd like to get in touch with Sr. Noha, please visit her website at <a href= \"http://www.sakinacounseling.com/\">http://www.sakinacounseling.com/</a>.    To ask a question or download a free ebook visit <a href= \"http://www.wivesofjannah.com\">www.wivesofjannah.com/ebooks www.wivesofjannah.com/askaquestion </a></p>",
  "enclosure": "",
  "itunes:duration": "29:29",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Wives of Jannah Special Feature Podcast with Megan Wyatt",
  "itunes:episodeType": "full",
  "itunes:author": "Megan Wyatt"
}