{
  "title": "TU 160:  Disorganized Attachment, It’s Not Crazy; It’s a Solution to an Unsolvable Problem –- REPLAY",
  "link": "https://therapistuncensored.com/episodes/tu-161-its-not-crazy-its-a-solution-to-an-unsolvable-problem-disorganized-attachment-replay/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu-161-its-not-crazy-its-a-solution-to-an-unsolvable-problem-disorganized-attachment-replay",
  "pubDate": "Tue, 26 Oct 2021 08:15:40 +0000",
  "guid": "https://therapistuncensored.com/?p=11933",
  "description": "The is the third and final episode of our three-part series on attachment where Ann and Sue take a deep dive into the fourth category on what we call the basic attachment spectrum: disorganized attachment. No matter your trauma history, this category relates to everyone and can be applicable in many areas of life. Follow along to see how disorganized attachment appears and affects adolescent and adult life, and ways to help conquer this disconnection and form healthier, more secure relationships.",
  "enclosure": "",
  "itunes:subtitle": "Unresolved / disorganized attachment is the least understood set of strategies in the attachment landscape - let&#039;s debunk myths and get a real sense of what it feels like",
  "itunes:summary": "This episode wraps up our 3-part series on the basics of attachment and what we call the attachment spectrum. Follow along as Ann and Sue take a deep dive into the fourth category: disorganized attachment. Regardless of your trauma history, this category resonates with everyone and many different areas of life. Learn more about how disorganized attachment appears and affects adolescent and adult life, and ways to combat these difficulties and form healthier, more secure relationships. Find more at www.therapistuncensored.com/episodes",
  "itunes:author": "Sue Marriott, Ann Kelley",
  "itunes:image": "",
  "itunes:season": 5,
  "itunes:episode": 13,
  "itunes:title": "Disorganized Attachment, It’s Not Crazy; It’s a Solution to an Unsolvable Problem –- REPLAY",
  "itunes:duration": "37:59"
}