{
  "title": "REOPENING EUROPE - Reopening Future?",
  "link": "https://audioboom.com/posts/7661363",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2622,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>This is the last episode of the summer feature of the Sound of Economics recorded as part of the Reopening Europe project.</div>\n<div> </div>\n<div>Between the 12th and the 27th of June, we traveled over 2700 kilometres through the Netherlands, Germany, France, Austria, Slovenia and Italy to collect voices from the ground during the weeks when the borders were reopening after the COVID-19 spring lockdown.  </div>\n<div> </div>\n<div>Since the start of summer, the pandemic has continued to ravage the globe, and in Europe we are currently seeing a resurgence of infections. The next few months continue to be uncertain in terms of medical and economic consequences. </div>\n<div> </div>\n<div>Given this context, the Reopening Europe project assumes additional layers: documenting the seemingly ephemeral moment of the summer reopenings, and reflecting about the hopes and wishes of Europeans at a unique moment. </div>\n<div> </div>\n<div>That is why, in this concluding episode of this feature, we reflect about the future. Not as an escapist wishful thinking, but as an attempt to start re-imagining a society, an economy and politics cohabiting with the virus and eventually overcoming it.   </div>\n<div> </div>\n<div>For this reflection Giuseppe Porcaro is joined by Bruegel’s senior scholar Alicia Garcia Herrero and Rutger Sjögrim, the architect that built the space ship featured in the movie Aniara (2018), and member of the Secretary studio in Stockholm. </div>\n",
  "itunes:summary": "Imagining a society, an economy and politics cohabiting with the virus and eventually overcoming it.",
  "pubDate": "Wed, 19 Aug 2020 12:32:36 +0000",
  "guid": "tag:audioboom.com,2020-08-19:/posts/7661363",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}