{
  "id": "https://bibleinoneyear.org/en/youth/30",
  "title": "Day 30: Does God Answer All Your Prayers?",
  "description": "Psalm 17:15, Job 16:1–21, Matthew 20:20–34.  We need to remember that God sees things from an eternal perspective and that there are some things we may never understand in this life In the passages for today we see examples of all three types of response from God",
  "pubDate": "Sat, 30 Jan 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/30/?ignore",
  "itunes:duration": "12:55",
  "guid": "enyouth30012021-30",
  "length": 775.76,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 30: Does God Answer All Your Prayers?",
  "itunes:subtitle": "Psalm 17:15, Job 16:1–21, Matthew 20:20–34.  We need to remember that God sees things from an eternal perspective and that there are some things we may never understand in this life In the passages for today we see examples of all three types of response from God",
  "itunes:summary": "I love cricket. At least, I love watching it; I was never any good at playing it. But I know many people don’t like cricket and don’t even understand the rules of it (especially if they come from a country where it isn’t a popular sport). So I hope you will forgive me for using a cricketing analogy.\nWhen two batsmen are running between the wickets on a cricket pitch, they need to co-ordinate the decision about whether to run or not. One will shout to the other ‘Yes’ (that is, ‘Let’s run’), or ‘No’ (that is, ‘Stay where you are’), or ‘Wait’ (that is, ‘Let’s see what happens before we decide whether to run’).\nGod hears all your prayers (Psalm 139:4, 1 John 5:14–15, 1 Peter 3:12) and, in one sense, he answers all your prayers. But we do not always receive what we ask for. When we ask God for something, the response will be ‘Yes’ or ‘No’ or ‘Wait’.\nJohn Stott wrote that God will answer ‘No’ if the things we ask for ‘are either not good in themselves, or not good for us or for others, directly or indirectly, immediately or ultimately’.\nWe don’t always get to know the reason why the answer is ‘No’. We need to remember that God sees things from an eternal perspective and that there are some things we may never understand in this life.\nIn the passages for today we see examples of all three types of response from God.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 30
}