{
  "title": "Democratizing luxury | How Rent the Runway changed the way we shop and grew to a $1B company – an interview with co founder Jenny Fleiss",
  "pubDate": "Tue, 17 Sep 2019 16:22:33 +0000",
  "guid": "f402c6ea740941cf84bd399dd359d5be",
  "link": "https://tonyrobbins.libsyn.com/democratizing-luxury-how-rent-the-runway-changed-the-way-we-shop-and-grew-to-a-1b-company-an-interview-with-co-founder-jenny-fleiss",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Jenny Fleiss created Rent the Runway, a company now valued at $1 billion, in the wake of the most</span> <em><span style=\"font-weight: 400;\">severe</span></em> <span style=\"font-weight: 400;\">economic recession the United States has seen since the Great Depression. When everyone else was panicking in 2008 and 2009, Jenny and co founder Jennifer Hyman saw an opportunity.</span></p> <p><span style=\"font-weight: 400;\">The problem they were trying to solve was simple enough: Looking into your closet and realizing you don’t have anything to wear to an important event, like a wedding, but don’t have the budget to buy something new. So they innovated, and created an entirely NEW way to shop by allowing women to rent designer clothing, online, for a</span> <em><span style= \"font-weight: 400;\">fraction</span></em> <span style= \"font-weight: 400;\">of what it actually costs. </span></p> <p><span style=\"font-weight: 400;\">Today, the rental, or sharing economy is booming – companies like WeWork, REI, and Zipcar make it possible for us to experience something, without the cost of ownership. But to put this in perspective, nothing like this existed at the time. </span></p> <p><span style=\"font-weight: 400;\">Jenny shares how she and her co founder got Rent the Runway up and running – and how they grew the business to where it is today. You’ll</span> <em><span style= \"font-weight: 400;\">also</span></em> <span style= \"font-weight: 400;\">hear Jenny’s philosophy on how she approaches hiring talent at JetBlack, a personal shopping service she co founded after leaving Rent the Runway, which is not only critical when you’re starting a business, but also when scaling it. </span></p> <p><span style=\"font-weight: 400;\">The interviewer for this episode is Scott Harris, a coach, mentor and a speaker at many of Tony’s events, including his business event, Business Mastery. </span></p>",
  "content:encoded": "<p>Jenny Fleiss created Rent the Runway, a company now valued at $1 billion, in the wake of the most <em>severe</em> economic recession the United States has seen since the Great Depression. When everyone else was panicking in 2008 and 2009, Jenny and co founder Jennifer Hyman saw an opportunity.</p> <p>The problem they were trying to solve was simple enough: Looking into your closet and realizing you don’t have anything to wear to an important event, like a wedding, but don’t have the budget to buy something new. So they innovated, and created an entirely NEW way to shop by allowing women to rent designer clothing, online, for a <em>fraction</em> of what it actually costs. </p> <p>Today, the rental, or sharing economy is booming – companies like WeWork, REI, and Zipcar make it possible for us to experience something, without the cost of ownership. But to put this in perspective, nothing like this existed at the time. </p> <p>Jenny shares how she and her co founder got Rent the Runway up and running – and how they grew the business to where it is today. You’ll <em>also</em> hear Jenny’s philosophy on how she approaches hiring talent at JetBlack, a personal shopping service she co founded after leaving Rent the Runway, which is not only critical when you’re starting a business, but also when scaling it. </p> <p>The interviewer for this episode is Scott Harris, a coach, mentor and a speaker at many of Tony’s events, including his business event, Business Mastery. </p>",
  "enclosure": "",
  "itunes:duration": "26:34",
  "itunes:explicit": false,
  "itunes:keywords": "the,runway,startup,tony,jenny,rent,robbins,fleiss,jetblack",
  "itunes:subtitle": "Jenny Fleiss created Rent the Runway, a company now valued at $1 billion, in the wake of the most severe economic recession the United States has seen since the Great Depression. When everyone else was panicking in 2008 and 2009, Jenny and co founder...",
  "itunes:episodeType": "full"
}