{
  "id": "yt:video:-iQ7XrehKdw",
  "yt:videoId": "-iQ7XrehKdw",
  "yt:channelId": "UCdZcGRaBV-VRRyU4t6Ur0mw",
  "title": "Thinking vs. Knowing: The Semantics and Pragmatics of Presuppositions",
  "link": "",
  "author": {
    "name": "The Ling Space",
    "uri": "https://www.youtube.com/channel/UCdZcGRaBV-VRRyU4t6Ur0mw"
  },
  "published": "2017-03-30T18:46:31+00:00",
  "updated": "2022-10-23T19:26:45+00:00",
  "media:group": {
    "media:title": "Thinking vs. Knowing: The Semantics and Pragmatics of Presuppositions",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "What's the difference between \"thinking\" and \"knowing\"? What rules do we follow for adjusting our conversational worlds? In this week's episode, we delve into the semantics and pragmatics of presuppositions: which words come equipped with them, how presuppositions depend on the situation and our mental worlds, and what antipresuppositions can tell us about the mechanics of interpreting sentences.\n\nThis is Topic #87!\n\nThis week's tag language: Ewe!\n\nRelated videos:\nHow Do Conversations Work? Gricean Maxims - https://youtu.be/rzxyjFHh-y8\nHow Do We Build Meaning With Math? Set Theory and Adjectives - https://youtu.be/M96aiDk2ePw\nHow Do We Capture the Truth of Beliefs? Type Theory - https://youtu.be/CWE9ycOxCEQ\n\nLast episode:\nHow Do We Put Sentences Inside Other Sentences? Complementizer Phrases - https://youtu.be/q9g77Wj5wr0\n\nOther of our semantics and pragmatics videos:\nHow Do We Create a Shared World in Conversation? Common Ground - https://youtu.be/gQqXmhqM13U\nHow Does One Greek Letter Help Us Understand Language? Lambda Calculus - https://youtu.be/BwWQDzXBuwg\nHow Do We Signal What's Important in Conversation? Information Structure - https://youtu.be/gZ6o8yFvJYI\n\nOur website also has extra content about this week's topic, discussing why presuppositions are so resilient, at: http://www.thelingspace.com/episode-87/\n\nFind us on all the social media worlds:\nTumblr: http://thelingspace.tumblr.com/\nTwitter: http://twitter.com/TheLingSpace\nFacebook: http://www.facebook.com/thelingspace/\n\nAnd at our website, http://www.thelingspace.com/ !\nYou can also find our store at the website, https://thelingspace.storenvy.com/\n\nWe also have forums to discuss this episode, and linguistics more generally.\n\nSources:\nMost information in this episode comes from this paper:\nhttp://semanticsarchive.net/Archive/GI3YzhlM/AntipresuppositionsVersion1.pdf\n\nFor more information on scalar implicatures, we also used: https://web.stanford.edu/class/linguist236/implicature/materials/ling236-handout-04-23-scalars.pdf\n\nLooking forward to next time!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}