{
  "id": "https://bibleinoneyear.org/en/youth/363",
  "title": "Day 363: Your Crown Is Coming",
  "description": "Psalm 149:4–5a, Nehemiah 9:38, 10:39b, Revelation 2:1–4,7–12. According to the New Testament, every Christian will be crowned and will reign even longer and there will be an even bigger cause for celebration and rejoicing than that of any earthly ruler  You will reign *with Christ* (Revelation 20:4,6)",
  "pubDate": "Wed, 29 Dec 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/363/?ignore",
  "itunes:duration": "13:54",
  "guid": "enyouth29122021-363",
  "length": 834.17,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 363: Your Crown Is Coming",
  "itunes:subtitle": "Psalm 149:4–5a, Nehemiah 9:38, 10:39b, Revelation 2:1–4,7–12. According to the New Testament, every Christian will be crowned and will reign even longer and there will be an even bigger cause for celebration and rejoicing than that of any earthly ruler  You will reign *with Christ* (Revelation 20:4,6)",
  "itunes:summary": "Queen Elizabeth II acceded to the throne in 1952. At her coronation in Westminster Abbey, she was handed a Bible, anointed and then crowned by the Archbishop of Canterbury.\nHer Diamond Jubilee was a multinational celebration marking the sixtieth anniversary of her accession to the throne. The climax was a weekend in June 2012 filled with street parties and concerts, a special service of thanksgiving and the largest river-pageant for 300 years. The whole country came together to celebrate. On 6 February 2017, she became the first British monarch to celebrate a Sapphire Jubilee, commemorating sixty-five years on the throne.\nAccording to the New Testament, every Christian will be crowned and will reign even longer and there will be an even bigger cause for celebration and rejoicing than that of any earthly ruler. You will reign with Christ (Revelation 20:4,6). What does this mean? Who reigns with him? When does this reign begin?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 363
}