{
  "title": "PubCast Season 2: turning passions into profits",
  "link": "https://blog.google/products/adsense/pubcast-season-2-turning-passions-profits/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p><a href=\"https://talksatgoogle.libsyn.com/size/5/?search=PubCast\">PubCast</a> is a podcast featuring the stories of website creators and app developers who turned their passions into profit with help from Google. In our second season of the series, you’ll hear from small business founders across the globe sharing how they launched their digital businesses and navigated challenges like the pandemic. Using AdSense, Ad Manager and AdMob to earn ad revenue, these businesses create free content, tools and resources that contribute to a thriving, open internet.</p><p>You can listen to the miniseries on the <a href=\"https://podcasts.google.com/feed/aHR0cHM6Ly90YWxrc2F0Z29vZ2xlLmxpYnN5bi5jb20vcnNz\">Talks@Google podcast channel</a> — just look for PubCast in the episode title — or anywhere you find podcasts.</p><p>Check out our Season 2 episodes:</p><ol><li><a href=\"https://talksatgoogle.libsyn.com/jessica-rovello-building-your-favorite-games-and-a-thriving-digital-business-pubcast\"><b>Jessica Rovello | Building your favorite games and a thriving digital business</b></a><b>:</b> Jessica Rovello is the CEO and Co-Founder of <a href=\"https://www.arkadium.com/\">Arkadium</a>, a game development company that has built hundreds of games enjoyed on over 800 million devices worldwide. Arkadium has been voted one of <a href=\"https://www.inc.com/magazine/201606/christine-lagorio/best-workplaces-2016-arkadium.html\">Inc. Magazine's best places to work</a> and takes an employee-centric approach to growth.</li><li><a href=\"https://talksatgoogle.libsyn.com/chef-dennis-littley-helping-the-world-create-restaurant-quality-food-at-home-pubcast\"><b>Dennis Littley | Helping the world create restaurant-quality food at home</b></a><b>:</b> Chef Dennis Littley got his start as a classically trained chef, and kindled his passion for teaching by creating a culinary program at the high school he worked at. Now, Chef Dennis works full time on his food and travel site, <a href=\"https://www.askchefdennis.com/\">Ask Chef Dennis</a>, helping people create restaurant-quality meals at home.</li><li><a href=\"https://talksatgoogle.libsyn.com/christeen-skinner-bringing-astrology-online-and-building-an-audience-from-zero-pubcast\"><b>Christeen Skinner |</b> <b>Bringing astrology online and building an audience from zero</b></a><b>:</b> Christeen Skinner is the Director of <a href=\"https://www.cityscopes.com/\">City Scopes</a>, an astrology-focused company founded in 1998 in London. The company has grown to offer a variety of resources, like <a href=\"http://horoscopes.co.uk/\">astrology sites</a>, training courses, books and more. Christeen now focuses her time on expanding into other areas, such as using astrology to try to predict financial outcomes.</li><li><a href=\"https://talksatgoogle.libsyn.com/paul-husbands-amplifying-caribbean-artists-on-the-world-stage-pubcast\"><b>Paul Husbands |</b> <b>Amplifying Caribbean artists on the world stage</b></a><b>:</b> Paul Husbands is the CEO and Founder of <a href=\"https://selectacharts.com/\">Selecta Charts</a>, a first-of-its-kind music streaming platform for Caribbean artists. Since its launch, Selecta Charts has drawn thousands of listeners and propelled hundreds of artists to new heights.</li><li><a href=\"https://talksatgoogle.libsyn.com/horatiu-boeriu-how-bmw-blog-drove-their-way-to-journalistic-success-pubcast\"><b>Horatiu Boeriu | From zero to millions: How BMW Blog drove to journalistic success</b></a><b>:</b> Horatiu Boeriu is the CEO and Founder of <a href=\"https://www.bmwblog.com/\">BMW Blog</a>, a Chicago-based website dedicated to automotive journalism with a focus on the BMW brand. Horatiu transformed his website from a passion project into a respected media outlet in the car industry, and has grown his audience to several million car enthusiasts.</li></ol><p>Are you a digital business owner who uses AdSense, AdMob or Ad Manager, and want to be featured on PubCast? Fill out our <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdBwO7mwMWbVruwqL-FP1cVt7aXAScswXMsvKcpJsacTGd4JA/viewform?usp=sf_link\">feedback form</a>, including your contact information and a few sentences about your business.</p><p>And if you’re interested in learning how to earn money from your site or app, check out how Google AdSense, AdMob and Ad Manager <a href=\"https://support.google.com/adsense/answer/9234653?hl=en\">can help</a>.</p></div></div></body></html>",
  "pubDate": "Tue, 23 Nov 2021 18:00:00 +0000",
  "guid": "https://blog.google/products/adsense/pubcast-season-2-turning-passions-profits/",
  "category": [
    "Google Ad Manager",
    "AdSense"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "PubCast Season 2: turning passions into profits",
    "description": "PubCast is a miniseries that explores how website creators and app developers turned their passions into profit.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/pubcast_2880_1200_with_ad.max-600x600.png",
    "site_name": "Google",
    "url": "https://blog.google/products/adsense/pubcast-season-2-turning-passions-profits/"
  },
  "author": {
    "name": "Gigi Grimes",
    "title": "Publisher Marketing Manager",
    "department": "",
    "company": ""
  }
}