{
  "title": "Episode 81: &#8220;Shout&#8221; by the Isley Brothers",
  "link": "https://500songs.com/podcast/episode-81-shout-by-the-isley-brothers/",
  "pubDate": "Mon, 04 May 2020 14:43:53 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-81-shout-by-the-isley-brothers/",
  "description": "Episode eighty-one of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Shout\" by the Isley Brothers, and the beginnings of a career that would lead to six decades of hit singles. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/36736079\">on \"Tell Laura I Love Her\" by Ray Peterson.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-81-shout-by-the-isley-brothers/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nAmazingly, there are no books on the Isley Brothers, unless you count a seventy-two page self-published pamphlet by Rudolph Isley's daughter, so I've had to piece this together from literally dozens of different sources.\n\nThe ones I relied on most were <a href=\"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.614.4623&rep=rep1&type=pdf\">this section of a very long article on Richie Barrett</a>, <a href=\"http://web.archive.org/web/20151103184336/https://www.wsj.com/articles/how-the-isley-brothers-created-shout-1446572577\">this interview with Ronald Isley</a>, and <a href=\"https://amzn.to/2YvkwOY\">Icons of R&B and Soul by Bob Gulla</a>.\n\nThe information on Hugo and Luigi comes mostly from two books -- <a href=\"https://amzn.to/35vb0Nb\"><em>Dream Boogie: The Triumph of Sam Cooke</em> by Peter Guralnick</a>, and  <a href=\"https://amzn.to/2KXNLBV\"><em>Godfather of the Music Business: Morris Levy</em> by Richard Carlin.</a>\n\nThere are many compilations of the public-domain recordings of the Isleys.<a href=\"https://amzn.to/2Yx7Ffe\"> This one</a> seems the most complete.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nToday we're going to take one of our rare looks -- at this point in the story anyway -- at an act that is still touring today. Indeed, when I started writing this script back in February, I started by saying that I would soon be seeing them live in concert, as I have a ticket for an Isley Brothers show in a couple of months. Of course, events have overtaken that, and it's extremely unlikely that anyone will be going to any shows then, but it shows a fundamental difference between the Isley Brothers and most of the other acts we've looked at, as even those who are still active now mostly concentrate on performing locally rather than doing international tours playing major venues.\n\nOf course, the version of the Isley Brothers touring today isn't quite the same as the group from the 1950s, but Ronald Isley, the group's lead singer, remains in the group -- and, indeed, has remained artistically relevant, with collaborations with several prominent hip-hop artists. The Isleys had top forty hits in the sixties, seventies, eighties, nineties, and two thousands, and as recently as 2006 they had an album go to number one on the R&B charts.\n\nBut today, we're going to look back at the group's very first hit, from 1959.\n\n[Excerpt: The Isley Brothers, \"Shout\"]\n\nThe Isley Brothers were destined to be a vocal group even before they were born, indeed even before their parents were married. When O'Kelly Isley senior was discussing his marriage proposal with his future in-laws, he told his father-in-law-to-be that he intended to have four sons, and that they were going to be the next Mills Brothers. Isley Sr had been a vaudeville performer himself, and as with so many family groups the Isleys seem to have gone into the music business more to please their parents than because they wanted to do it themselves.\n\nAs it turned out, O'Kelly and Sallye Isley had six children, all boys, and the eldest four of them did indeed form a vocal group. Like many black vocal groups in the early fifties, they were a gospel group, and O'Kelly Jr, Rudolph, Ronald, and Vernon Isley started performing around the churches in Cincinnati as teenagers, having been trained by their parents. They appeared on Ted Mack's Amateur Hour, the popular TV talent show which launched the careers of many entertainers, and won -- their prize was a jewelled watch, which the boys would take turns wearing.\n\nBut then tragedy struck. Vernon, the youngest of the four singing Isleys, and the one who was generally considered to be far and away the most talented singer in the group, was hit by a car and killed while he was riding his bike, aged only thirteen.\n\nThe boys were, as one would imagine, devastated by the death of their little brother, and they also thought that that should be the end of their singing career, as Vernon had been their lead singer. It would be two years before they would perform live again. By all accounts, their parents put pressure on them during that time, telling them that it would be the only way to pay respect to Vernon. Eventually a compromise was reached between parents and brothers -- Ron agreed that he would attempt to sing lead, if in turn the group could stop singing gospel music and start singing doo-wop songs, like the brothers' favourite act Billy Ward and the Dominoes.\n\nWe've talked before about how Billy Ward & The Dominoes were a huge influence on the music that became soul, with hit records like \"Have Mercy Baby\":\n\n[Excerpt: Billy Ward and the Dominoes, \"Have Mercy Baby\"]\n\nBoth Ward's original lead singer Clyde McPhatter and McPhatter's later replacement Jackie Wilson sang in a style that owed a lot to the church music that the young Isleys had also been performing, and so it was natural for them to make the change to singing in the style of the Dominoes. As soon as Ronald Isley started singing lead, people started making comparisons both to McPhatter and to Wilson. Indeed, Ronald has talked about McPhatter as being something of a mentor figure for the brothers, teaching them how to sing, although it's never been clear exactly at what point in their career they got to know McPhatter.\n\nBut their real mentor was a much less well-known singer, Beulah Bryant.\n\nThe three eldest Isley brothers, O'Kelly, Rudolph, and Ronald, met Bryant on the bus to New York, where they were travelling to try and seek their fortunes. Bryant was one of the many professional blues shouters who never became hugely well known, but who managed to have a moderately successful career from the fifties through to the eighties, mostly in live performances, though she did make a handful of very listenable records:\n\n[Excerpt: Beulah Bryant, \"What Am I Gonna Do?\"]\n\nWhen they got to New York, while they had paid in advance for somewhere to stay, they were robbed on their second day in the city and had no money at all. But Bryant had contacts in the music industry, and started making phone calls for her young proteges, trying to get them bookings. At first she was unsuccessful, and the group just hung around the Harlem Apollo and occasionally performed at their amateur nights.\n\nEventually, though, Bryant got Nat Nazzaro to listen to them over the phone. Nazzaro was known as \"the monster agent\" -- he was one of the most important booking agents in New York, but he wasn't exactly fair to his young clients. He would book a three-person act, but on the contracts the act would consist of four people -- Nazzaro would be the fourth person, and he would get an equal share of the performance money, as well as getting his normal booking agent's share.\n\nNazzaro listened to the Isleys over the phone, and then he insisted they come and see him in person, because he was convinced that they had been playing a record down the phone rather than singing to him live. When he found out they really did sound like that, Nazzaro started getting them the kind of bookings they could only dream of -- they went from having no money at all to playing on Broadway for $750 a week, and then playing the Apollo for $950 a week, at least according to O'Kelly Isley Jr's later recollection. This was an astonishing sum of money to a bunch of teenagers in the late 1950s.\n\nBut they still hadn't made a record, and their sets were based on cover versions of songs by other people, things like \"Rock and Roll Waltz\" by Kay Starr:\n\n[Excerpt: Kay Starr, \"Rock and Roll Waltz\"]\n\nIt was hardly the kind of material they would later become famous for. And nor was their first record. They had signed to a label called Teenage Records, a tiny label owned by two former musicians, Bill \"Bass\" Gordon and Ben Smith. As you might imagine, there were a lot of musicians named Ben Smith and it's quite difficult to sort out which was which -- even Marv Goldberg, who normally knows these things, seems confused about which Ben Smith this was, describing him as a singer on one page and a sax player on another page. As Ben Smith the sax player seems to have played on some records for Teenage, it was probably him, in which case this Ben Smith probably also played alto sax for Lucky Millinder's band and wrote the hit \"I Dreamed I Dwelt in Harlem\" for Glenn Miller:\n\n[Excerpt: The Glenn Miller Orchestra, \"I Dreamed I Dwelt in Harlem\"]\n\nIt's more certain exactly who Bill \"Bass\" Gordon was -- he was the leader of Bill \"Bass\" Gordon and the Colonials, who had recorded the doo-wop track \"Two Loves Have I\":\n\n[Excerpt: Bill \"Bass\" Gordon and the Colonials, \"Two Loves Have I\"]\n\nSmith and Gordon signed the Isley Brothers to Teenage Records, and in June 1957 the first Isley Brothers single, \"Angels Cried\", came out:\n\n[Excerpt: The Isley Brothers, \"Angels Cried\"]\n\nUnfortunately, the single didn't have any real success, and the group decided that they wanted to record for a better label. According to O'Kelly Isley they got some resistance from Teenage Records, who claimed to have them under contract -- but the Isley Brothers knew better. They had signed a contract, certainly, but then the contract had just been left on a desk after they'd signed it, rather than being filed, and they'd swiped it from the desk when no-one was looking. Teenage didn't have a copy of the contract, so had no proof that they had ever signed the Isley Brothers, and the brothers were free to move on to another label.\n\nThey chose to sign to Gone Records, one of the family of labels that was owned and run by George Goldner. Goldner assigned Richie Barrett, his talent scout, producer, and arranger, to look after the Isleys, as he had previously done with Frankie Lymon and the Teenagers and the Chantels, as well as his own group the Valentines:\n\n[The Valentines, \"The Woo Woo Train\"]\n\nBy this point, Barrett had established an almost production-line method of making records. He would block-book a studio and some backing musicians for up to twenty-four hours, get as many as ten different vocal groups into the studio, and record dozens of tracks in a row, usually songs written by either group members or by Barrett.\n\nThe Isleys' first record with Barrett, \"Don't Be Jealous\", was a fairly standard doo-wop ballad, written by Ron Isley:\n\n[Excerpt: The Isley Brothers, \"Don't Be Jealous\"]\n\nThere's some suggestion that Barrett is also singing on that recording with the group -- it certainly sounds like there are four voices on there, not just three. Either way, the song doesn't show much of the style that the Isley Brothers would later make their own. Much more like their later recordings was the B-side, another Ronald Isley song, which could have been a classic in the Coasters' mould had it not been for the lyrics, which were an attempt at a hip rewriting of \"Old McDonald\":\n\n[Excerpt: The Isley Brothers, \"Rockin' McDonald\"]\n\nThey were nearly there, but not quite. The next single, \"I Wanna Know\", came closer -- you can hear they were clearly trying to incorporate elements of other people's successful records -- Ronald Isley's vocal owes a lot to Little Richard, while the piano playing has the same piano \"ripping\" that Jerry Lee Lewis had made his own. But you can also hear the style that would make them famous coming to the fore.\n\nBut they were not selling records, and Richie Barrett was stretched very thin. A few more singles were released on Gone (often pairing a previously-released track with a new B-side) but nothing was successful enough to justify them staying on with Goldner's label.\n\nBut just as they'd moved from a micro-indie label to a large indie without having had any success, now they were going to move from a large indie to a major label, still not having had a hit. They took one of their records to Hugo and Luigi at RCA records, and the duo signed them up.\n\nHugo and Luigi were strange, strange, figures in popular music in the 1950s. They were two cousins, Hugo Peretti and Luigi Creatore, who were always known by their first names, and had started out making children's records before being hired by Mercury Records, where they would produce, among other things, the cover versions by Georgia Gibbs of black records that we've talked about previously, and which were both ethically and musically appalling:\n\n[Excerpt: Georgia Gibbs, \"Dance With Me Henry\"]\n\nAfter a couple of years of consistently producing hits, they got tempted away from Mercury by Morris Levy, who was setting up a new label, Roulette, with George Goldner and Alan Freed. Goldner and Freed quickly dropped out of the label, but Hugo and Luigi ended up having a fifty percent stake in the new label. While they were there, they showed they didn't really get rock and roll music at all -- they produced follow-up singles by a lot of acts who'd had hits before they started working with Hugo and Luigi, but stopped as soon as the duo started producing them, like Frankie Lymon:\n\n[Excerpt: Frankie Lymon, \"Goodie Goodie\"]\n\nBut they still managed to produce a string of hits like \"Honeycomb\" by Jimmie Rodgers (who is not either the blues singer or the country singer of the same name), which went to number one:\n\n[Excerpt: Jimmie Rogers, \"Honeycomb\"]\n\nAnd they also recorded their own tracks for Roulette, like the instrumental Cha-Hua-Hua:\n\n[Excerpt: Hugo and Luigi, \"Cha-Hua-Hua\"]\n\nAfter a year or so with Roulette, they were in turn poached by RCA -- Morris Levy let them go so long as they gave up their shares in Roulette for far less than they were worth. At RCA they continued their own recording career, with records like \"Just Come Home\":\n\n[Excerpt: Hugo and Luigi, \"Just Come Home\"]\n\nThey also produced several albums for Perry Como. So you would think that they would be precisely the wrong producers for the Isley Brothers. And the first record they made with the trio would tend to suggest that there was at least some creative difference there. \"I'm Gonna Knock on Your Door\" was written by Aaron Schroeder and Sid Wayne, two people who are best known for writing some of the less interesting songs for Elvis' films, and has a generic, lightweight, backing track -- apart from an interestingly meaty guitar part. The vocals have some power to them, and the record is pleasant, and in some ways even ground-breaking -- it doesn't sound like a late fifties record as much as it does an early sixties one, and one could imagine, say, Gerry and the Pacemakers making a substantially identical record. But it falls between the stools of R&B and pop, and doesn't quite convince as either:\n\n[Excerpt: The Isley Brothers, \"I'm Gonna Knock on Your Door\"]\n\nThat combination of a poppy background and soulful vocals would soon bear a lot of fruit for another artist Hugo and Luigi were going to start working with, but it didn't quite work for the Isleys yet.\n\nBut their second single for RCA was far more successful. At this point the Isleys were a more successful live act than recording act, and they would mostly perform songs by other people, and one song they performed regularly was \"Lonely Teardrops\", the song that Berry and Gwen Gordy and Roquel Davis had written for Jackie Wilson:\n\n[Excerpt: Jackie Wilson, \"Lonely Teardrops\"]\n\nThe group would perform that at the end of their shows, and they started to extend it, with Ron Isley improvising as the band vamped behind him, starting with the line \"say you will\" from Wilson's song. He'd start doing a call and response with his brothers, singing a line and getting them to sing the response \"Shout\". These improvised, extended, endings to the song got longer and longer, and got the crowds more and more excited, and they started incorporating elements from Ray Charles records, too, especially \"What'd I Say\" and \"I Got a Woman\".\n\nWhen they got back to New York at the end of the tour, they told Hugo and Luigi how well these performances, which they still thought of as just long performances of \"Lonely Teardrops\", had gone. The producers suggested that if they went down that well, what they should do is cut out the part that was still \"Lonely Teardrops\" and just perform the extended tag. As it turned out, they kept in a little of \"Lonely Teardrops\" -- the \"Say you will, say you will\" line -- and the resulting song, like Ray Charles' similar call-and-response based \"What'd I Say\", was split over two sides of a single, as \"Shout (Parts One and Two)\":\n\n[Excerpt: The Isley Brothers, \"Shout (Parts One and Two)\"]\n\nThat was nothing like anything that Hugo and Luigi had ever produced before, and it became the Isley Brothers' first chart hit, reaching number forty-seven. More importantly for them, the song was credited to the three brothers, so they made money from the cover versions of the song that charted much higher. In the USA, Joey Dee and the Starliters made number six in 1962 with their version:\n\n[Excerpt: Joey Dee and the Starliters, \"Shout\"]\n\nIn the UK, Lulu and the Luvvers made number seven in 1964:\n\n[Excerpt: Lulu and the Luvvers, \"Shout\"]\n\nAnd in Australia, Johnny O'Keefe released his version only a month after the Isleys released theirs, and reached number two:\n\n[Excerpt: Johnny O'Keefe, \"Shout\"]\n\nDespite all these cover versions, the Isleys' version remains the definitive one, and itself ended up selling over a million copies, though it never broke into the top forty.\n\nIt was certainly successful enough that it made sense to record an album. Unfortunately, for the album, also titled Shout!, the old Hugo and Luigi style came out, and apart from one new Isleys original, \"Respectable\", which became their next single, the rest of the album was made up of old standards, rearranged in the \"Shout!\" style. Sometimes, this almost worked, as on \"Ring-A-Ling A-Ling (Let The Wedding Bells Ring)\", whose words are close enough to Little Richard-style gibberish that Ronald Isley could scream them effectively. But when the Isleys take on Irving Berlin's \"How Deep is the Ocean\" or \"He's Got the Whole World in His Hands\", neither the song nor the group are improved by the combination.\n\nThey released several more singles on RCA, but none of them repeated the success of \"Shout!\". At this point they moved across to Atlantic, where they started working with Leiber and Stoller. Leiber and Stoller kept them recording old standards as B-sides, but for the A-sides they went back to gospel-infused soul party songs, like the Leiber and Stoller song \"Teach Me How To Shimmy\" and the Isleys' own \"Standing On The Dance Floor\", a rewrite of an old gospel song called \"Standing at the Judgment\":\n\n[Excerpt: The Isley Brothers, \"Standing on the Dance Floor\"]\n\nBut none of these songs scraped even the bottom of the charts, and the brothers ended up leaving Atlantic after a year, and signing with a tiny label, Scepter. After having moved from a tiny indie label to a large indie to a major label, they had now moved back down from their major label to a large indie to a tiny indie. They were still a great live act, but they appeared to be a one-hit wonder.\n\nBut all that was about to change, when they recorded a cover version of a flop single inspired by their one hit, combined with a dance craze. The Isley Brothers were about to make one of the most important records of the 1960s, but \"Twist and Shout\" is a story for another time.",
  "itunes:subtitle": "Episode eighty-one of A History of Rock Music in Five Hundred Songs looks at Shout by the Isley Brothers, and the beginnings of a career that would lead to six decades of hit singles. Click the full post to read liner notes, links to more information, an",
  "itunes:keywords": "Aaron Schroeder,Alan Freed,Atlantic Records,Clyde McPhatter,doo wop,George Goldner,Georgia Gibbs,Gone Records,Hugo and Luigi,Jackie Wilson,Joey Dee and the Starliters,Leiber and Stoller,Morris Levy,RCA Records,Riichie Barrett,Roulette Records,The Isley Brothers,vocal groups",
  "itunes:episodeType": "full",
  "itunes:episode": 81,
  "content:encoded": "Episode eighty-one of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Shout\" by the Isley Brothers, and the beginnings of a career that would lead to six decades of hit singles. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/36736079\">on \"Tell Laura I Love Her\" by Ray Peterson.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-81-shout-by-the-isley-brothers/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nAmazingly, there are no books on the Isley Brothers, unless you count a seventy-two page self-published pamphlet by Rudolph Isley's daughter, so I've had to piece this together from literally dozens of different sources.\n\nThe ones I relied on most were <a href=\"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.614.4623&rep=rep1&type=pdf\">this section of a very long article on Richie Barrett</a>, <a href=\"http://web.archive.org/web/20151103184336/https://www.wsj.com/articles/how-the-isley-brothers-created-shout-1446572577\">this interview with Ronald Isley</a>, and <a href=\"https://amzn.to/2YvkwOY\">Icons of R&B and Soul by Bob Gulla</a>.\n\nThe information on Hugo and Luigi comes mostly from two books -- <a href=\"https://amzn.to/35vb0Nb\"><em>Dream Boogie: The Triumph of Sam Cooke</em> by Peter Guralnick</a>, and  <a href=\"https://amzn.to/2KXNLBV\"><em>Godfather of the Music Business: Morris Levy</em> by Richard Carlin.</a>\n\nThere are many compilations of the public-domain recordings of the Isleys.<a href=\"https://amzn.to/2Yx7Ffe\"> This one</a> seems the most complete.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nToday we're going to take one of our rare looks -- at this point in the story anyway -- at an act that is still touring today. Indeed, when I started writing this script back in February, I started by saying that I would soon be seeing them live in concert, as I have a ticket for an Isley Brothers show in a couple of months. Of course, events have overtaken that, and it's extremely unlikely that anyone will be going to any shows then, but it shows a fundamental difference between the Isley Brothers and most of the other acts we've looked at, as even those who are still active now mostly concentrate on performing locally rather than doing international tours playing major venues.\n\nOf course, the version of the Isley Brothers touring today isn't quite the same as the group from the 1950s, but Ronald Isley, the group's lead singer, remains in the group -- and, indeed, has remained artistically relevant, with collaborations with several prominent hip-hop artists. The Isleys had top forty hits in the sixties, seventies, eighties, nineties, and two thousands, and as recently as 2006 they had an album go to number one on the R&B charts.\n\nBut today, we're going to look back at the group's very first hit, from 1959.\n\n[Excerpt: The Isley Brothers, \"Shout\"]\n\nThe Isley Brothers were destined to be a vocal group even before they were born, indeed even before their parents were married. When O'Kelly Isley senior was discussing his marriage proposal with his future in-laws, he told his father-in-law-to-be that he intended to have four sons, and that they were going to be the next Mills Brothers. Isley Sr had been a vaudeville performer himself, and as with so many family groups the Isleys seem to have gone into the music business more to please their parents than because they wanted to do it themselves.\n\nAs it turned out, O'Kelly and Sallye Isley had six children, all boys, and the eldest four of them did indeed form a vocal group. Like many black vocal groups in the early fifties, they were a gospel group, and O'Kelly Jr, Rudolph, Ronald, and Vernon Isley started performing around the churches in Cincinnati as teenagers, having been trained by their parents. They appeared on Ted Mack's Amateur Hour, the popular TV talent show which launched the careers of many entertainers, and won -- their prize was a jewelled watch, which the boys would take turns wearing.\n\nBut then tragedy struck. Vernon, the youngest of the four singing Isleys, and the one who was generally considered to be far and away the most talented singer in the group, was hit by a car and killed while he was riding his bike, aged only thirteen.\n\nThe boys were, as one would imagine, devastated by the death of their little brother, and they also thought that that should be the end of their singing career, as Vernon had been their lead singer. It would be two years before they would perform live again. By all accounts, their parents put pressure on them during that time, telling them that it would be the only way to pay respect to Vernon. Eventually a compromise was reached between parents and brothers -- Ron agreed that he would attempt to sing lead, if in turn the group could stop singing gospel music and start singing doo-wop songs, like the brothers' favourite act Billy Ward and the Dominoes.\n\nWe've talked before about how Billy Ward & The Dominoes were a huge influence on the music that became soul, with hit records like \"Have Mercy Baby\":\n\n[Excerpt: Billy Ward and the Dominoes, \"Have Mercy Baby\"]\n\nBoth Ward's original lead singer Clyde McPhatter and McPhatter's later replacement Jackie Wilson sang in a style that owed a lot to the church music that the young Isleys had also been performing, and so it was natural for them to make the change to singing in the style of the Dominoes. As soon as Ronald Isley started singing lead, people started making comparisons both to McPhatter and to Wilson. Indeed, Ronald has talked about McPhatter as being something of a mentor figure for the brothers, teaching them how to sing, although it's never been clear exactly at what point in their career they got to know McPhatter.\n\nBut their real mentor was a much less well-known singer, Beulah Bryant.\n\nThe three eldest Isley brothers, O'Kelly, Rudolph, and Ronald, met Bryant on the bus to New York, where they were travelling to try and seek their fortunes. Bryant was one of the many professional blues shouters who never became hugely well known, but who managed to have a moderately successful career from the fifties through to the eighties, mostly in live performances, though she did make a handful of very listenable records:\n\n[Excerpt: Beulah Bryant, \"What Am I Gonna Do?\"]\n\nWhen they got to New York, while they had paid in advance for somewhere to stay, they were robbed on their second day in the city and had no money at all. But Bryant had contacts in the music industry, and started making phone calls for her young proteges, trying to get them bookings. At first she was unsuccessful, and the group just hung around the Harlem Apollo and occasionally performed at their amateur nights.\n\nEventually, though, Bryant got Nat Nazzaro to listen to them over the phone. Nazzaro was known as \"the monster agent\" -- he was one of the most important booking agents in New York, but he wasn't exactly fair to his young clients. He would book a three-person act, but on the contracts the act would consist of four people -- Nazzaro would be the fourth person, and he would get an equal share of the performance money, as well as getting his normal booking agent's share.\n\nNazzaro listened to the Isleys over the phone, and then he insisted they come and see him in person, because he was convinced that they had been playing a record down the phone rather than singing to him live. When he found out they really did sound like that, Nazzaro started getting them the kind of bookings they could only dream of -- they went from having no money at all to playing on Broadway for $750 a week, and then playing the Apollo for $950 a week, at least according to O'Kelly Isley Jr's later recollection. This was an astonishing sum of money to a bunch of teenagers in the late 1950s.\n\nBut they still hadn't made a record, and their sets were based on cover versions of songs by other people, things like \"Rock and Roll Waltz\" by Kay Starr:\n\n[Excerpt: Kay Starr, \"Rock and Roll Waltz\"]\n\nIt was hardly the kind of material they would later become famous for. And nor was their first record. They had signed to a label called Teenage Records, a tiny label owned by two former musicians, Bill \"Bass\" Gordon and Ben Smith. As you might imagine, there were a lot of musicians named Ben Smith and it's quite difficult to sort out which was which -- even Marv Goldberg, who normally knows these things, seems confused about which Ben Smith this was, describing him as a singer on one page and a sax player on another page. As Ben Smith the sax player seems to have played on some records for Teenage, it was probably him, in which case this Ben Smith probably also played alto sax for Lucky Millinder's band and wrote the hit \"I Dreamed I Dwelt in Harlem\" for Glenn Miller:\n\n[Excerpt: The Glenn Miller Orchestra, \"I Dreamed I Dwelt in Harlem\"]\n\nIt's more certain exactly who Bill \"Bass\" Gordon was -- he was the leader of Bill \"Bass\" Gordon and the Colonials, who had recorded the doo-wop track \"Two Loves Have I\":\n\n[Excerpt: Bill \"Bass\" Gordon and the Colonials, \"Two Loves Have I\"]\n\nSmith and Gordon signed the Isley Brothers to Teenage Records, and in June 1957 the first Isley Brothers single, \"Angels Cried\", came out:\n\n[Excerpt: The Isley Brothers, \"Angels Cried\"]\n\nUnfortunately, the single didn't have any real success, and the group decided that they wanted to record for a better label. According to O'Kelly Isley they got some resistance from Teenage Records, who claimed to have them under contract -- but the Isley Brothers knew better. They had signed a contract, certainly, but then the contract had just been left on a desk after they'd signed it, rather than being filed, and they'd swiped it from the desk when no-one was looking. Teenage didn't have a copy of the contract, so had no proof that they had ever signed the Isley Brothers, and the brothers were free to move on to another label.\n\nThey chose to sign to Gone Records, one of the family of labels that was owned and run by George Goldner. Goldner assigned Richie Barrett, his talent scout, producer, and arranger, to look after the Isleys, as he had previously done with Frankie Lymon and the Teenagers and the Chantels, as well as his own group the Valentines:\n\n[The Valentines, \"The Woo Woo Train\"]\n\nBy this point, Barrett had established an almost production-line method of making records. He would block-book a studio and some backing musicians for up to twenty-four hours, get as many as ten different vocal groups into the studio, and record dozens of tracks in a row, usually songs written by either group members or by Barrett.\n\nThe Isleys' first record with Barrett, \"Don't Be Jealous\", was a fairly standard doo-wop ballad, written by Ron Isley:\n\n[Excerpt: The Isley Brothers, \"Don't Be Jealous\"]\n\nThere's some suggestion that Barrett is also singing on that recording with the group -- it certainly sounds like there are four voices on there, not just three. Either way, the song doesn't show much of the style that the Isley Brothers would later make their own. Much more like their later recordings was the B-side, another Ronald Isley song, which could have been a classic in the Coasters' mould had it not been for the lyrics, which were an attempt at a hip rewriting of \"Old McDonald\":\n\n[Excerpt: The Isley Brothers, \"Rockin' McDonald\"]\n\nThey were nearly there, but not quite. The next single, \"I Wanna Know\", came closer -- you can hear they were clearly trying to incorporate elements of other people's successful records -- Ronald Isley's vocal owes a lot to Little Richard, while the piano playing has the same piano \"ripping\" that Jerry Lee Lewis had made his own. But you can also hear the style that would make them famous coming to the fore.\n\nBut they were not selling records, and Richie Barrett was stretched very thin. A few more singles were released on Gone (often pairing a previously-released track with a new B-side) but nothing was successful enough to justify them staying on with Goldner's label.\n\nBut just as they'd moved from a micro-indie label to a large indie without having had any success, now they were going to move from a large indie to a major label, still not having had a hit. They took one of their records to Hugo and Luigi at RCA records, and the duo signed them up.\n\nHugo and Luigi were strange, strange, figures in popular music in the 1950s. They were two cousins, Hugo Peretti and Luigi Creatore, who were always known by their first names, and had started out making children's records before being hired by Mercury Records, where they would produce, among other things, the cover versions by Georgia Gibbs of black records that we've talked about previously, and which were both ethically and musically appalling:\n\n[Excerpt: Georgia Gibbs, \"Dance With Me Henry\"]\n\nAfter a couple of years of consistently producing hits, they got tempted away from Mercury by Morris Levy, who was setting up a new label, Roulette, with George Goldner and Alan Freed. Goldner and Freed quickly dropped out of the label, but Hugo and Luigi ended up having a fifty percent stake in the new label. While they were there, they showed they didn't really get rock and roll music at all -- they produced follow-up singles by a lot of acts who'd had hits before they started working with Hugo and Luigi, but stopped as soon as the duo started producing them, like Frankie Lymon:\n\n[Excerpt: Frankie Lymon, \"Goodie Goodie\"]\n\nBut they still managed to produce a string of hits like \"Honeycomb\" by Jimmie Rodgers (who is not either the blues singer or the country singer of the same name), which went to number one:\n\n[Excerpt: Jimmie Rogers, \"Honeycomb\"]\n\nAnd they also recorded their own tracks for Roulette, like the instrumental Cha-Hua-Hua:\n\n[Excerpt: Hugo and Luigi, \"Cha-Hua-Hua\"]\n\nAfter a year or so with Roulette, they were in turn poached by RCA -- Morris Levy let them go so long as they gave up their shares in Roulette for far less than they were worth. At RCA they continued their own recording career, with records like \"Just Come Home\":\n\n[Excerpt: Hugo and Luigi, \"Just Come Home\"]\n\nThey also produced several albums for Perry Como. So you would think that they would be precisely the wrong producers for the Isley Brothers. And the first record they made with the trio would tend to suggest that there was at least some creative difference there. \"I'm Gonna Knock on Your Door\" was written by Aaron Schroeder and Sid Wayne, two people who are best known for writing some of the less interesting songs for Elvis' films, and has a generic, lightweight, backing track -- apart from an interestingly meaty guitar part. The vocals have some power to them, and the record is pleasant, and in some ways even ground-breaking -- it doesn't sound like a late fifties record as much as it does an early sixties one, and one could imagine, say, Gerry and the Pacemakers making a substantially identical record. But it falls between the stools of R&B and pop, and doesn't quite convince as either:\n\n[Excerpt: The Isley Brothers, \"I'm Gonna Knock on Your Door\"]\n\nThat combination of a poppy background and soulful vocals would soon bear a lot of fruit for another artist Hugo and Luigi were going to start working with, but it didn't quite work for the Isleys yet.\n\nBut their second single for RCA was far more successful. At this point the Isleys were a more successful live act than recording act, and they would mostly perform songs by other people, and one song they performed regularly was \"Lonely Teardrops\", the song that Berry and Gwen Gordy and Roquel Davis had written for Jackie Wilson:\n\n[Excerpt: Jackie Wilson, \"Lonely Teardrops\"]\n\nThe group would perform that at the end of their shows, and they started to extend it, with Ron Isley improvising as the band vamped behind him, starting with the line \"say you will\" from Wilson's song. He'd start doing a call and response with his brothers, singing a line and getting them to sing the response \"Shout\". These improvised, extended, endings to the song got longer and longer, and got the crowds more and more excited, and they started incorporating elements from Ray Charles records, too, especially \"What'd I Say\" and \"I Got a Woman\".\n\nWhen they got back to New York at the end of the tour, they told Hugo and Luigi how well these performances, which they still thought of as just long performances of \"Lonely Teardrops\", had gone. The producers suggested that if they went down that well, what they should do is cut out the part that was still \"Lonely Teardrops\" and just perform the extended tag. As it turned out, they kept in a little of \"Lonely Teardrops\" -- the \"Say you will, say you will\" line -- and the resulting song, like Ray Charles' similar call-and-response based \"What'd I Say\", was split over two sides of a single, as \"Shout (Parts One and Two)\":\n\n[Excerpt: The Isley Brothers, \"Shout (Parts One and Two)\"]\n\nThat was nothing like anything that Hugo and Luigi had ever produced before, and it became the Isley Brothers' first chart hit, reaching number forty-seven. More importantly for them, the song was credited to the three brothers, so they made money from the cover versions of the song that charted much higher. In the USA, Joey Dee and the Starliters made number six in 1962 with their version:\n\n[Excerpt: Joey Dee and the Starliters, \"Shout\"]\n\nIn the UK, Lulu and the Luvvers made number seven in 1964:\n\n[Excerpt: Lulu and the Luvvers, \"Shout\"]\n\nAnd in Australia, Johnny O'Keefe released his version only a month after the Isleys released theirs, and reached number two:\n\n[Excerpt: Johnny O'Keefe, \"Shout\"]\n\nDespite all these cover versions, the Isleys' version remains the definitive one, and itself ended up selling over a million copies, though it never broke into the top forty.\n\nIt was certainly successful enough that it made sense to record an album. Unfortunately, for the album, also titled Shout!, the old Hugo and Luigi style came out, and apart from one new Isleys original, \"Respectable\", which became their next single, the rest of the album was made up of old standards, rearranged in the \"Shout!\" style. Sometimes, this almost worked, as on \"Ring-A-Ling A-Ling (Let The Wedding Bells Ring)\", whose words are close enough to Little Richard-style gibberish that Ronald Isley could scream them effectively. But when the Isleys take on Irving Berlin's \"How Deep is the Ocean\" or \"He's Got the Whole World in His Hands\", neither the song nor the group are improved by the combination.\n\nThey released several more singles on RCA, but none of them repeated the success of \"Shout!\". At this point they moved across to Atlantic, where they started working with Leiber and Stoller. Leiber and Stoller kept them recording old standards as B-sides, but for the A-sides they went back to gospel-infused soul party songs, like the Leiber and Stoller song \"Teach Me How To Shimmy\" and the Isleys' own \"Standing On The Dance Floor\", a rewrite of an old gospel song called \"Standing at the Judgment\":\n\n[Excerpt: The Isley Brothers, \"Standing on the Dance Floor\"]\n\nBut none of these songs scraped even the bottom of the charts, and the brothers ended up leaving Atlantic after a year, and signing with a tiny label, Scepter. After having moved from a tiny indie label to a large indie to a major label, they had now moved back down from their major label to a large indie to a tiny indie. They were still a great live act, but they appeared to be a one-hit wonder.\n\nBut all that was about to change, when they recorded a cover version of a flop single inspired by their one hit, combined with a dance craze. The Isley Brothers were about to make one of the most important records of the 1960s, but \"Twist and Shout\" is a story for another time.",
  "enclosure": "",
  "itunes:summary": "Episode eighty-one of A History of Rock Music in Five Hundred Songs looks at \"Shout\" by the Isley Brothers, and the beginnings of a career that would lead to six decades of hit singles. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Tell Laura I Love Her\" by Ray Peterson.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nAmazingly, there are no books on the Isley Brothers, unless you count a seventy-two page self-published pamphlet by Rudolph Isley's daughter, so I've had to piece this together from literally dozens of different sources.\n\nThe ones I relied on most were this section of a very long article on Richie Barrett, this interview with Ronald Isley, and Icons of R&B and Soul by Bob Gulla.\n\nThe information on Hugo and Luigi comes mostly from two books -- Dream Boogie: The Triumph of Sam Cooke by Peter Guralnick, and  Godfather of the Music Business: Morris Levy by Richard Carlin.\n\nThere are many compilations of the public-domain recordings of the Isleys. This one seems the most complete.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nToday we're going to take one of our rare looks -- at this point in the story anyway -- at an act that is still touring today. Indeed, when I started writing this script back in February, I started by saying that I would soon be seeing them live in concert, as I have a ticket for an Isley Brothers show in a couple of months. Of course, events have overtaken that, and it's extremely unlikely that anyone will be going to any shows then, but it shows a fundamental difference between the Isley Brothers and most of the other acts we've looked at, as even those who are still active now mostly concentrate on performing locally rather than doing international tours playing major venues.\n\nOf course, the version of the Isley Brothers touring today isn't quite the same as the group from the 1950s, but Ronald Isley, the group's lead singer, remains in the group -- and, indeed, has remained artistically relevant, with collaborations with several prominent hip-hop artists. The Isleys had top forty hits in the sixties, seventies, eighties, nineties, and two thousands, and as recently as 2006 they had an album go to number one on the R&B charts.\n\nBut today, we're going to look back at the group's very first hit, from 1959.\n\n[Excerpt: The Isley Brothers, \"Shout\"]\n\nThe Isley Brothers were destined to be a vocal group even before they were born, indeed even before their parents were married. When O'Kelly Isley senior was discussing his marriage proposal with his future in-laws, he told his father-in-law-to-be that he intended to have four sons, and that they were going to be the next Mills Brothers. Isley Sr had been a vaudeville performer himself, and as with so many family groups the Isleys seem to have gone into the music business more to please their parents than because they wanted to do it themselves.\n\nAs it turned out, O'Kelly and Sallye Isley had six children, all boys, and the eldest four of them did indeed form a vocal group. Like many black vocal groups in the early fifties, they were a gospel group, and O'Kelly Jr, Rudolph, Ronald, and Vernon Isley started performing around the churches in Cincinnati as teenagers, having been trained by their parents. They appeared on Ted Mack's Amateur Hour, the popular TV talent show which launched the careers of many entertainers, and won -- their prize was a jewelled watch, which the boys would take turns wearing.\n\nBut then tragedy struck. Vernon, the youngest of the four sing",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode eighty-one of A History of Rock Music in Five Hundred Songs looks at \"Shout\" by the Isley Brothers, and the beginnings of a career that would lead to six decades of hit singles. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Tell Laura I Love Her\" by Ray Peterson.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nAmazingly, there are no books on the Isley Brothers, unless you count a seventy-two page self-published pamphlet by Rudolph Isley's daughter, so I've had to piece this together from literally dozens of different sources.\n\nThe ones I relied on most were this sec",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}