{
  "title": "Episode 101 - Maximilien Van Haaster Interview",
  "itunes:episode": 101,
  "itunes:title": "Episode 101 - Maximilien Van Haaster Interview",
  "itunes:episodeType": "full",
  "guid": "1260e556-e16a-4ba3-97c9-30faea89f574",
  "link": "https://share.transistor.fm/s/32c5d441",
  "description": "<p>As we get closer to the Tokyo Olympics, we're excited to bring you a great interview today with an athlete who is set to compete in only a couple of weeks time, Canadian fencer Maximilien Van Haaster! We learn from Max just how he got into the sport of fencing and how the different areas of the sport, and the sport in general, work. He also takes us through his experiences in Rio and what his hopes are for Tokyo, as well as giving us an insight into just what preparations he is currently doing with the games so close. It's a great chat which we know you won't want to miss, so get to listening!</p>",
  "content:encoded": "<p>As we get closer to the Tokyo Olympics, we're excited to bring you a great interview today with an athlete who is set to compete in only a couple of weeks time, Canadian fencer Maximilien Van Haaster! We learn from Max just how he got into the sport of fencing and how the different areas of the sport, and the sport in general, work. He also takes us through his experiences in Rio and what his hopes are for Tokyo, as well as giving us an insight into just what preparations he is currently doing with the games so close. It's a great chat which we know you won't want to miss, so get to listening!</p>",
  "pubDate": "Wed, 07 Jul 2021 01:19:29 +1000",
  "author": "Ben Waterworth",
  "enclosure": "",
  "itunes:author": "Ben Waterworth",
  "itunes:image": "",
  "itunes:duration": 4613,
  "itunes:summary": "As we get closer to the Tokyo Olympics, we're excited to bring you a great interview today with an athlete who is set to compete in only a couple of weeks time, Canadian fencer Maximilien Van Haaster! We learn from Max just how he got into the sport of fencing and how the different disciplines of the sport, and the sport in general, work. He also takes us through his experiences in Rio and what his hopes are for Tokyo, as well as giving us an insight into just what preparations he is currently doing with the games so close. It's a great chat which we know you won't want to miss, so get to listening!",
  "itunes:subtitle": "As we get closer to the Tokyo Olympics, we're excited to bring you a great interview today with an athlete who is set to compete in only a couple of weeks time, Canadian fencer Maximilien Van Haaster! We learn from Max just how he got into the sport of fe",
  "itunes:keywords": "olympics, off the podium, comedy, funny, interview, colin hilding, jarrod loobeek, ben waterworth, olympic games, sport, australia, canada",
  "itunes:explicit": "No"
}