{
  "title": "8 Key Lessons from the Ultralearning Experiment (and a Huge Announcement)",
  "link": "https://www.madfientist.com/ultralearning-experiment-results/",
  "comments": "https://www.madfientist.com/ultralearning-experiment-results/#comments",
  "dc:creator": "The Mad Fientist",
  "pubDate": "Fri, 02 Oct 2020 10:22:03 +0000",
  "category": [
    "FIRE (Financial Independence / Retire Early)",
    "Interviews"
  ],
  "guid": "http://www.madfientist.com/?p=6863",
  "description": "<p class=\"lead\">The Ultralearning Experiment was a bigger success than I'd even hoped and here's what I learned from it (plus a massive announcement)!</p>\n<p class=\"more-link-p\"><a class=\"btn btn-danger\" href=\"https://www.madfientist.com/ultralearning-experiment-results/\">Read more &#8594;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/ultralearning-experiment-results/\">8 Key Lessons from the Ultralearning Experiment (and a Huge Announcement)</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "content:encoded": "\n<p>Last year, I conducted an <a rel=\"noopener\" href=\"https://www.madfientist.com/scott-young-interview/\" target=\"_blank\">experiment in Ultralearning</a> that I hoped would help me achieve a lifelong dream of mine of writing and releasing an album.</p>\n\n\n\n<p>I&#8217;m happy to say it was far more successful than I ever imagined it would be!</p>\n\n\n\n<p><em>If you don&#8217;t know what the Ultralearning Experiment is, check out the experiment&#8217;s <a href=\"https://www.madfientist.com/ultralearning-experiment/\" target=\"_blank\" rel=\"noopener\">homepage</a> to learn all about it.</em></p>\n\n\n\n<p>As I mentioned in the initial <a rel=\"noopener\" href=\"https://www.madfientist.com/scott-young-interview/\" target=\"_blank\">Ultralearning podcast episode</a>, the hope for the 3-month experiment was that it would accelerate my progress towards my goal and make the process more enjoyable.</p>\n\n\n\n<p>Well, it did all that and more&#8230;</p>\n\n\n\n<p>I ended up finishing a song during that 3-month experiment and I can&#8217;t believe it but I just <a href=\"https://www.madfientist.com/album/\" target=\"_blank\" rel=\"noopener\">released that single</a> today!</p>\n\n\n\n<p>Not only did I write a song during the experiment, I continued writing music since then and I now have enough material for an album!</p>\n\n\n\n<p><em>To find out all about my music project and to pre-order the album, <a rel=\"noopener\" href=\"https://www.madfientist.com/album/\" target=\"_blank\">click here</a>.</em></p>\n\n\n\n<p>Never in my wildest dreams would I have thought this experiment would help me make so much progress but it has!</p>\n\n\n\n<p>In today&#8217;s podcast episode, I go through everything I learned and explain why the Ultralearning Experiment helped me push past the self-doubt and self-destructive habits that have plagued me in the past.  </p>\n\n\n\n<p>I also describe the new routines the experiment helped me develop and why those new habits have allowed me accomplish more than I ever have before:</p>\n\n\n<h2>Listen Now</h2><div style='padding:20px'><audio class=\"wp-audio-shortcode\" id=\"audio-6863-7\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio/mpeg\" src=\"https://traffic.libsyn.com/secure/madfientist/ultralearning-experiment-results.mp3?_=7\" /><a href=\"https://traffic.libsyn.com/secure/madfientist/ultralearning-experiment-results.mp3\">https://traffic.libsyn.com/secure/madfientist/ultralearning-experiment-results.mp3</a></audio></div><ul><li>Listen on <a href='https://open.spotify.com/show/5AjnvxZb6ZScoI6KCV0hxo' target='_blank'>Spotify</a> or <a href='https://www.madfientist.com/go/itunes/' target='_blank'>Apple Podcasts</a></li><li>Download MP3 by right-clicking <a href='https://traffic.libsyn.com/secure/madfientist/ultralearning-experiment-results.mp3' target='_blank' rel='nofollow'>here</a></li></ul>\n\n\n\n<h2>Highlights</h2>\n\n\n\n<ul><li>How to get your brain ready (and why it&#8217;s essential for making progress)</li><li>The best way to make developing new habits easier</li><li>What you should focus on and why</li><li>How to be original and creative</li><li>Why you should make your project &#8220;real&#8221; (even if it makes you feel silly)</li><li>When it&#8217;s worth spending more money instead of less</li><li>Why you should expect to encounter the &#8220;gap&#8221; and how to get over it</li></ul>\n\n\n\n<h2>Show Links</h2>\n\n\n\n<ul><li><a rel=\"noopener\" href=\"https://www.madfientist.com/album/\" target=\"_blank\">Listen to My First Single and Pre-Order My Album!</a></li><li><a rel=\"noopener\" href=\"https://www.madfientist.com/best-and-worst-about-fi/\" target=\"_blank\">The Best and Worst Thing About FI</a></li><li><a rel=\"noopener\" href=\"https://www.madfientist.com/ultralearning-experiment/\" target=\"_blank\">Ultralearning Experiment Homepage</a></li><li><a href=\"https://amzn.to/3nhTeFQ\" target=\"_blank\" rel=\"nofollow noopener\">Ultralearning by Scott Young</a></li><li><a rel=\"noopener\" href=\"https://www.madfientist.com/scott-young-interview/\" target=\"_blank\">Scott Young on the Financial Independence Podcast</a></li><li><a href=\"https://amzn.to/3cKmmRd\" target=\"_blank\" rel=\"nofollow noopener\">Digital Minimalism by Cal Newport</a></li><li><a rel=\"noopener\" href=\"https://www.madfientist.com/cal-newport-interview/\" target=\"_blank\">Cal Newport on the Financial Independence Podcast</a></li><li><a href=\"https://amzn.to/3l18g0D\" target=\"_blank\" rel=\"nofollow noopener\">Atomic Habits by James Clear</a></li><li><a rel=\"noopener\" href=\"https://www.madfientist.com/james-clear-interview/\" target=\"_blank\">James Clear on the Financial Independence Podcast</a></li><li><a href=\"https://www.madfientist.com/ramit-sethi-interview/\" target=\"_blank\" rel=\"noopener\">Ramit Sethi on the Financial Independence Podcast</a></li><li><a rel=\"noopener\" href=\"https://www.creativepeptalk.com/episodes/2019/10/29/250-how-to-find-your-style\" target=\"_blank\">Creative Pep Talk Podcast &#8211; How to Find Your Style</a></li><li><a href=\"https://youtu.be/X2wLP0izeJE\" target=\"_blank\" rel=\"nofollow noopener\">Ira Glass talking about the &#8220;Gap&#8221;</a></li></ul>\n\n\n\n<h2>Full Transcript</h2>\n\n\n\n<div class=\"transcript\"><strong>Mad Fientist: </strong>Hey, what&#8217;s up, everybody? Welcome to the Financial Independence Podcast. <br><br>Today&#8217;s episode is the single most terrifying and exciting episode I&#8217;ve ever released. And I will get to why in a second, but if you remember back in September, I shared with you my lifelong goal of releasing an album and really that&#8217;s the whole reason I wanted to achieve financial independence, because I thought that work was the one thing that was holding me back, which it wasn&#8217;t. <br><br>And I&#8217;ve talked about that in that article, The Best and Worst Thing About FI, which I&#8217;ll link to in the show notes, if you haven&#8217;t read that yet. <br><br>So I shared that goal with you back in September. And then in October, I released an episode with Scott Young, who is the author of Ultralearning and I sat down with him and sort of put together an ultralearning experiment for my music project. And I thought that would be a really good way to kick off the project in a way that&#8217;s a lot more focused than I had been in previous years.<br><br>So even though I left my job back in 2016, I wasn&#8217;t really making as much progress as I had hoped. And I&#8217;ll talk about why that was today and how I overcame those things that were blocking me. But I figured if I could sit and do a ultralearning experiment over three months and really focus then I had hoped that that would sort of make me progress more than I had in the past.<br><br>In the episode I talked about, you know, I felt like I was going five miles per hour and I wasn&#8217;t even sure if I was pointing in the right direction, I felt like I was in the dark and yeah, I was moving around, but I didn&#8217;t know if I was actually making progress. And I thought that if I spend three months on this ultralearning experiment, hopefully by the end of it, I&#8217;ll be going 15 miles per hour, so I can feel the breeze in my face and enjoy the journey a little bit more and I&#8217;ll know that I&#8217;m pointing in the right direction. <br><br>So that was the whole goal of it. And I have to say it exceeded all expectations. And that&#8217;s why today is the most terrifying and exciting day. I have just released my first single and I am planning to release an album on January 22nd, 2021.<br><br>I honestly can&#8217;t really believe it. And I&#8217;m so excited to share with you how it came about and what worked and how the ultralearning experiment allowed me to get over some of the hurdles I wasn&#8217;t able to get over before and all the things I learned along the way, because it&#8217;s been probably the most difficult thing I&#8217;ve done in my life, but it&#8217;s also been one of the most rewarding as well.<br><br>And now here I am. in this place where I feel like I&#8217;m really doing what I wanted to do and it&#8217;s been fantastic. So before we get into the episode, if you want to go listen to the first single I released, which is actually the song that I wrote during the actual ultralearning experiment, you can go to  madfientist.com/album and from there you can preorder the album. <br><br>And once you do that, you&#8217;ll be sent an email immediately with links to the single and everything. I&#8217;m not going to be sharing any of the music project on Mad Fientist itself, because I want to keep those two things separate because I feel like the music project is going to just keep getting weirder and weirder from here on out so, you know, keeping that away from my respectable, Mad Fientist persona is probably a good idea. <br><br>So that&#8217;s how I&#8217;m just going to keep it separate so if you go to that page, there&#8217;s a buy button. It&#8217;s five bucks for the album and you can preorder it and it will be released in January, but that&#8217;ll put you on a special email list where I&#8217;ll send you this single and then a bunch of future stuff I have planned for everybody that downloaded the album. <br><br>So if you do do that, thank you so much. You are literally making my dream come true, which is amazing. So I appreciate it in advance.<br><br>Before I get into what I learned from the ultralearning experiment, I&#8217;ll give you a quick recap on what that actually was. So if you haven&#8217;t listened to that episode yet, I definitely recommended it. It is episode 55. So if you go to  madfientist.com/episode55 it&#8217;ll take you right to the show notes for that page. And in that episode I talked to Scott Young about his concept of ultralearning.<br><br>In his book, he states that your deepest moments of happiness don&#8217;t come from doing easy things. They come from realizing your potential and overcoming your own limiting beliefs about yourself. And he says that ultralearning offers a path to master the things that will bring you deep satisfaction and self confidence.<br><br>So I definitely recommend you check out the book and that episode, and especially the episode, just because we went through and sort of developed my ultralearning plan. <br><br>And I&#8217;ll give you a quick summary of it so that you don&#8217;t have to go and listen to it right away. But I definitely suggest you listen to it after if you haven&#8217;t already.<br><br>So we went through and decided that last September, 2019, I would spend September, October and November focused solely on this ultralearning experiment. And like I said before, I wanted to sort of just make sure I was going in the right direction and pick up a little speed so that I&#8217;d actually enjoy the journey because prior to the ultralearning experiment, it was like pulling teeth, actually sitting down to do music.<br><br>And I think that was a lot of, it was psychological. I felt like I couldn&#8217;t do it. And I was worried that trying would make me realize that I couldn&#8217;t do it. So I would procrastinate a lot. I would always find something else to do. And it was just pretty awful. I didn&#8217;t enjoy the process. I didn&#8217;t enjoy any of it.<br><br>And it was just a constant reminder that the thing that I wanted to do most is something that I wasn&#8217;t able to do. So I hoped the ultralearning experiment would help me get over that. And thankfully it has, which is definitely one of the biggest benefits of it because now it&#8217;s a whole different world.<br><br>I enjoy the process. And actually today, I had to not do any music because I&#8217;d been planning to record this episode but each morning I start with music and then I&#8217;ve been getting so sucked into the whole music thing that I don&#8217;t have time to record this episode. So today I had to not do music so that I could actually record this episode.<br><br>And that&#8217;s just 180 degrees from where I was back in August of last year, where you know, I would do anything else, but music, because that was the hardest thing I had to do all day. So that&#8217;s really the gist of my ultralearning project. And I had hoped, as I said, to just feel like I was moving in the right direction and enjoying the journey more.<br><br>And in the back of my mind, I&#8217;d secretly hoped that I could write a song that I&#8217;d be proud of during that time. But I didn&#8217;t believe that I would, because I had never been able to do that in the past. So the fact that I was able to do that and now I&#8217;m releasing that to you today is just mind blowing to me.<br><br>And I can&#8217;t believe that I&#8217;ve written many songs after that. So, this really was a turning point in my journey. <br><br>Anyway, that&#8217;s enough introduction so let&#8217;s dive into some of the most impactful changes that I made, how they impacted my progress, and what I learned from this whole thing.<br><br>The first big change I made was that I removed all distractions. That&#8217;s something that I always had trouble with before is that I would always find something else to do that wasn&#8217;t writing music and it would feel productive because whatever I would do would be a productive thing. It would be another task, something other than music. But it would be productive procrastination. So it was easier to justify. And with the ultralearning experiment, I blocked off three months and I said, I&#8217;m not doing anything else. And that was big because that meant I didn&#8217;t work on Mad Fientists. There wasn&#8217;t a Mad Fientist thing that I could work on that would make me feel productive, even though it wasn&#8217;t what I was meant to be doing.<br><br>So focusing solely on this ultralearning project was really important. And I also used this as an opportunity to follow Cal Newport&#8217;s advice. If you remember, I interviewed Cal back in episode 52, and he talked about the importance of deep work and also removing your digital distractions from your life.<br><br>So in that episode, he talked about his digital decluttering, where you just sort of remove all of your digital inputs and then only add back in the ones that are really important to you. So I did that and I realized how frazzled my mind was all the time. I was always looking for that dopamine hit of Twitter or news or anything online that I would normally just browse mindlessly and take up a huge chunk of my day.<br><br>And I cut all that stuff out. And that was important because it let my brain get back into a normal state where it wasn&#8217;t like a junkie looking for a hit all the time. It was calmer and more focused and that made a big difference too. <br><br>So in the morning when I was about to do music, I would shut my email down.<br><br>And that way, if I got into a good flow state, when I was doing the music stuff, I wouldn&#8217;t get taken out of that by some random email that came in and I would limit my social media and news reading and Twitter and all that sort of stuff until in the evening time, when I had already exhausted all of my willpower on the music stuff.<br><br>So I&#8217;m starting with this tip because that was just a way to get your brain into a state where you can actually do better things. So if you haven&#8217;t checked out Cal&#8217;s episode yet definitely recommend it. It is at madfientist.com/episode52. And this digital decluttering is something that you should really revisit a lot because I, myself find that I fall back into the same bad habits.<br><br>One thing that&#8217;s been helpful recently is I have a Mac and there&#8217;s something called Screen Time where you can go in and you can limit the amount of hours or minutes that you spend on certain sites, using certain apps, things like that. And recently I&#8217;ve had to go in there and actually limit the amount of Twitter I can access, or news and things like that because I found myself just slowly slipping back into these bad habits where you&#8217;re, I just felt my brain getting to that state again, where I couldn&#8217;t actually focus because I was just always looking for the next story to read or the next article to read.<br><br>This is something I&#8217;m still struggling with, but keep revisiting, because I have seen the benefits of, you know, getting a handle on the mindless internet browsing all the time.<br><br>The next biggest thing that worked for me is a concept I picked up from another past podcast guest, James Clear. I interviewed James back in episode 48. So if you want to listen to that episode, just go to madfientist.com/episode48. And in that episode, we talked about his book Atomic Habits, which if you haven&#8217;t read it yet, and you are interested in developing better habits, I can&#8217;t recommend it more highly.<br><br>It is one of the most actionable books I&#8217;ve ever read. It&#8217;s really engaging. It all makes sense and is very effective. So one of the topics that he discusses in that book is called habit stacking. So, you know, we&#8217;re all human. We all have habits that we already have. So it&#8217;s much easier to stack a different habit on top of a existing habit than it is to just try to create a new habit from scratch.<br><br>So to give you an example of how important this was for me, like I said before, I would procrastinate all day and I knew I needed to write music, but I would always find something else to do. So my whole day would be feeling guilty that I wasn&#8217;t doing my main task for the day. And I would put it off until the end of the day.<br><br>And by the end of the day, I had lost all of my willpower, all of my motivation, all of my confidence. And by then I would just be like, Oh, I&#8217;ll just do it tomorrow. And that&#8217;s why I never got anything done because I would constantly just be putting it off. And yeah, I&#8217;ve listened to podcasts and I&#8217;ve read books and everybody says, do your most important thing first, but when your most important thing is your hardest thing, it&#8217;s very difficult to roll out of bed and be like, okay, I&#8217;m going to tackle my hardest thing of the day. <br><br>So here&#8217;s how habit stacking came into play for me. One of my most enjoyable things in the morning is making my cup of coffee. I have a pour over coffee and it&#8217;s sorta just like a relaxing ritual where I make coffee and it smells great.<br><br>And then I get to enjoy this amazing cup of coffee afterwards. So that was already an established habit and one that I was not going to break because it&#8217;s such an enjoyable habit. And it was the first thing I did in the morning. So, what I did for this ultralearning experiment is I said, okay, that&#8217;s my established habit and I&#8217;m gonna stack music on top of that. <br><br>So I did not allow myself to drink coffee anywhere else in the house. I had to sit at my synthesizers and keyboards and all my musical instruments. At the desk. And I had to do music when I was drinking my coffee and that changed everything that meant that no matter what I was going to get some music.  And even if I only did five or 10 minutes, I would get it in because I was drinking my coffee and I would be doing music during that coffee drinking. And it just made my whole day so much better because it wasn&#8217;t the day of like frustration and guilt instead. It was like, Oh, I already did my most important thing today.<br><br>And now I can do whatever I want after it. And it was a lot easier to do that since I stacked it on top of the coffee habit, because then I just got so preprogrammed. I was just like a robot. As soon as I would finish making the coffee, I would just go and sit at this desk that I would never have normally sat at when I was drinking my coffee.<br><br>Another thing that&#8217;s been very helpful is the idea of immersion. So I realized that one of my big issues is that my identity is tied to math and science so much that that&#8217;s what makes me feel like I can&#8217;t do anything artistic. Like I&#8217;ve always been a math and science guy. I&#8217;ve always been good at math growing up.<br><br>I was a computer science major and I was a computer software developer for my career. And I&#8217;ve always just been that side of the brain. And I&#8217;ve always told myself that artists are different. So for this ultralearning experiment, I decided to completely immerse myself in music and that meant cutting out everything else.<br><br>So I don&#8217;t know if you&#8217;ve noticed, but you know, I haven&#8217;t really been active in the FI space very much. <br><br>I haven&#8217;t been going to FIRE conferences. I haven&#8217;t been speaking anywhere as the Mad Fientist. I haven&#8217;t been doing much of that at all. And the reason for that is because I was like, I&#8217;m going to try to just change my perception of myself and change my identity by fully immersing myself in the music world. So instead of going to FinCon like I had in years past, I went to  MoogFest, which is a synthesizer conference, and I went to a lot more concerts. I started hanging out with more musicians.<br><br>I started following the musicians on Twitter instead of financial writers. I spent my free time reading articles about synthesizers instead of financial topics. And, it actually worked. It&#8217;s very surprising to me that it worked, but it sort of made me feel like I was in that world. And the more I felt like I belonged in that world, the more confidence I had to do, what people in that world do, which is write music and perform music. <br><br>And that&#8217;s something the ultralearning experiment gave me because I&#8217;d dedicated three months to it. And I cleared my schedule. I cleared my non-musical tasks and I was able to really just focus and immerse myself in the world of music.<br><br>And it was the same with books. Like all the books I got out of the library at that time were all music books. And I feel like it did trick my brain into thinking, Hey, actually, this guy&#8217;s a musician. That&#8217;s all he does all he does his music. So he&#8217;s a musician.  He&#8217;s in this world, so sure he can do it.<br><br>And that was actually a really big deal.<br><br>Once I got into the ultralearning experiment. One of the main things that kept driving me forward was the time tracking. So before I started, I created a spreadsheet where each of the columns had a task at the top of it. And then each row was a day. And all I would do is just fill in the number of minutes I spent doing those tasks and I would just keep track of how many minutes a day I was doing on each of those tasks. And at the end of the month, I could tell it up and see how many hours I was putting in for the month. <br><br>And like I said before, I was trying to aim for 25 hours a week. And the way I ordered the columns is I put the most direct activities, like writing songs is what I wanted to do so that was the most impactful, direct activity I could do. And then I just put it&#8217;s less direct activities to the right of that. So the goal was first to just put the hours. And so that was the primary target was just to hit my hours for the month.<br><br>But also I wanted to make as many of those hours to be on the left side of the spreadsheet. So in the show notes for this episode, which is episode 59, I&#8217;ll put a screenshot of my spreadsheet that I used, but that was actually really important because after a few hours of working hard, I would lose motivation and I could have easily found something nonproductive to do at that time.<br><br>But the fact that I was trying to hit these certain number of hours would mean that, I would bring up my spreadsheet and be like, okay, I can&#8217;t write any more songs today just cause I just can&#8217;t take it anymore. It&#8217;s too hard. But what else could I do? So I could maybe do this software that, you know, teaching me how to better design sounds, or I could actually just watch a few YouTube videos, which even though that&#8217;s passive learning it&#8217;s that was like my last resort. If I had lost all willpower and I needed to do something, I would watch a video about mixing. And even though that was very passive, I would still learn something and still be immersed in the music and be forcing myself to put those hours in. And at first, a lot of my time was spent doing indirect stuff because I just couldn&#8217;t face the direct stuff.<br><br>And it was really tough, but I just kept putting the hours in kept trying to do the direct stuff. And I&#8217;ll put a graph in the show notes for this episode too. And you can sort of see, see how my activity not only increased as time went on and my confidence increased, but also the directness of the activities I was doing increased as well.<br><br>I had started on lots of videos, lots of software, lots of tutorials and learning, but I gradually started funneling most of my time into the actual important thing, which is the writing of the music. So, if you want to take a project seriously, and you are stressed out about it, then focusing on putting in the hours, I think is a very good place to put your focus because it is something that you can control.<br><br>No matter how you feel, how creative you are, how much good stuff&#8217;s coming out or not. And it&#8217;s a great thing to focus on.<br><br>Another reason the ultralearning project was so beneficial is because it forced me to push through when times got tough and times got tough a lot during this process. As I mentioned before, this has been a lifelong struggle and it&#8217;s just something I felt like I couldn&#8217;t do. And I felt like I was in the dark and not really knowing where I was going so early on, obviously all of those same things were affecting me.<br><br>But since I committed to this project, I just kept putting in the hours and slowly but surely it got easier. And I started breaking through some of those mental barriers that I had. And actually this is a good time to talk about that. It is insane how the ego tries to protect itself. If you read my Best and Worst Thing About FI article, you know that the reason that I never really pursued music in my adult life is because I believe my ego was too fragile and it was trying to protect me because I&#8217;ve had this lifelong dream of releasing an album and rather than try and fail, I was just, just not doing anything because that just kept the dream alive and it kept my brain happy.<br><br>But that obviously would guarantee failure because I&#8217;m not working towards the goal. So even though it was guaranteeing failure, it was keeping the dream and the hope alive. So when I actually started working hard on this during the ultralearning experiment, it was amazing all the ways my brain tried to protect me and stop me from, you know, risking this thing of losing my dream.<br><br>Once, I guess my brain realized that I was not gonna stop doing what I was doing, then I would fall asleep at night and as I was drifting off, like my self doubt had switched from, &#8220;Oh, you can&#8217;t do this&#8221; to &#8220;You&#8217;re doing this, but you&#8217;re too old to do this.&#8221; And I would just have these evenings where I was like, what am I doing?<br><br>I&#8217;m writing music. I&#8217;m in my late thirties. What, am I going to go on tour? And like live in a van and, you know, drink beer like I&#8217;m in my twenties? And then looking back on it, it seems like it was a way for my brain to like talk me out of the ultralearning experiment. Thoughts started creeping in like, do you actually want to do this?  You don&#8217;t really want to do this, this isn&#8217;t your real dream. You don&#8217;t want to be doing this and spending all your time doing this right now. <br><br>And it was just amazing that those were the things that would keep me up at night and make me struggle to fall asleep. But again, I just think it was maybe the ego trying to protect me from trying and failing.  Trying to talk myself out of actually giving it a shot.<br><br>And I know I seem like a crazy person talking about my brain like it&#8217;s not part of me, but. It, it, it did feel like it was just like somebody else in my head was trying to like, say, Oh, you don&#8217;t want to do this. You&#8217;re too old to do this. You can&#8217;t do this and all these things, but the ultralearning experiment, made me just push through all that.<br><br>And I&#8217;d wake up the next morning and do what I was meant to do. Even though you have the night before I was doubting everything about what I was doing. So, not only did it help me push through some of the mental blocks that I had, but it also forced me to push through some of the actual activities that I was struggling with.<br><br>So about halfway through the experiment, I came up with a song idea, which ended up being the first single that I released today. And it was great. I was so excited. I was like, wow, I can&#8217;t believe this. This is actually maybe something that could turn into a song I&#8217;d be happy to release.<br><br>And then came lyric writing and I thought, Hey, I&#8217;m a writer. I write all the time. I&#8217;m sure I can write lyrics. <br><br>And I went up to one of the local bars to have a beer while I was writing my lyrics. And it was so hard. It was just this whole other world of writing that I just said never practiced. And I would have definitely quit because it was like, so soul destroying, trying to do it.<br><br>And I struggled so much and I tried to do it another day and just completely struggled. And I would have definitely just scrapped it and either made it an instrumental or just given up completelt. <br><br>But again, because I had to put in the hours I pushed through and wrote some lyrics and I got it done and it was the same with vocals.  So I had the lyrics. And then I started thinking about singing them, which I don&#8217;t want to be a singer, but I am doing this on my own over here. So I was like, well, I guess I&#8217;m gonna have to sing it. So I tried singing it. I absolutely hated the sound of it. And again, I would have quit. I would have had this been five years ago.  I would have scrapped it, scrapped the whole idea of the song and quit. But again, since I was forced to put in the hours and I wanted to get this done, I just pushed through. And my temporary solution was to just use a vocoder so that I sounded more like a robot and less like me. And, the final mix that I&#8217;ll put on the album is actually less vocoded than some of the earlier mixes.<br><br>But again, I just had to find solutions to the problems and the ultralearning experiment was great for that because I had to fill a lot of hours and you might as well find solutions when you&#8217;re putting in that many hours. So that was really beneficial. <br><br>This is the lesson about creativity that didn&#8217;t come out of ultralearning itself, but it came out of the months I spent trying to produce something from scratch and it is actually a Mad Fientist reader named Barb who put me onto this podcast. <br><br>When I mentioned that this was my goal, she reached out to me in a comment on one of my posts and said, Hey, if you&#8217;re trying to write music, then maybe the Creative Pep Talk podcast will be helpful to you. And one episode in particular was extremely helpful. So I&#8217;ll link to this in the show notes, but it was an episode on how to find your style. <br><br>So when I started trying to write music, I thought that I had to be the most unique, original thing in the world. Like. I&#8217;m not going to use your normal scales.  I&#8217;ll just create my own notes and scales and chords, and it&#8217;s just going to blow your mind. But the more I&#8217;ve learned about writing music, that would be awful to write a song like that because our ears are so used to hearing certain things, chord progressions, and certain notes with certain chords.  To think that I had to come up with like all original stuff is just insane because that would just result in terrible music that nobody would like, including myself.<br><br>So that&#8217;s always been a struggle, like, I need to be really unique and interesting. And that&#8217;s what creativity is. It&#8217;s like reinventing the wheel and it&#8217;s really not that. So this podcast was incredibly helpful because what he talks about in it is that, we&#8217;re unique people and our influences are unique.<br><br>So we&#8217;re unique, so are our influences. So if you just follow your instincts and follow what you like, it&#8217;s going to come out unique because you&#8217;re going to take some things from this genre or some things from this band, and you&#8217;re going to combine it in this way that nobody else has combined it in that way before, because you know, they haven&#8217;t had the same influences you have.<br><br>So that freed me up mentally to be less stressed for sitting down and coming up with something really unique. And instead it just allowed me to experiment more and be like, Oh, I like that sound. I&#8217;ll use that. And then combine that with something else. And as long as I&#8217;m liking it, as I&#8217;m going along, then hopefully at the end of it, it&#8217;s going to be something good that I like, which is what the whole goal is because I can&#8217;t control what other people like. So it&#8217;s just, if I like it, and if it&#8217;s good enough for me to release, then that&#8217;s success to me. And that was huge. <br><br>So I definitely recommend you checking out that podcast episode. <br><br>And in that actual episode, he talks about something that Ira Glass said, which was also a really helpful in making me less stressed about not being where I want to be at this stage.<br><br>And that was that, people who create stuff get into it because they&#8217;re big fans of that medium. So for him, it&#8217;s, you know, creating radio broadcasts and telling stories. And for me, it&#8217;s writing songs and listening to songs. And the reason we get into these things is because we love, for me music or for him storytelling.<br><br>So we have good tastes and we know what sounds good and we know what looks good. And then we can tell good from bad. And it&#8217;s because we&#8217;re such big fans that we just know what we like, we know what&#8217;s interesting to us. So. You get into something because you want to create something as good as the stuff that you love so much, but the problem is your skills aren&#8217;t there yet.<br><br>So there&#8217;s a gap. There&#8217;s a gap between what you&#8217;re creating and what you know to be good. And he says that, you know, a lot of people never cross that gap because it&#8217;s it&#8217;s soul destroying. Like I&#8217;ve, I&#8217;ve been in the other side of that gap for all of my life and anything that I tried to create, wasn&#8217;t up to the standards that I was used to because I was comparing it to, you know, the finished works of some amazing artists that have been working at their craft for 30 years or so.<br><br>So I was always comparing my stuff to that and was obviously never even close. And what he says is, is that. If you can just keep working eventually you&#8217;re going to cross that gap and yeah, you&#8217;ll never maybe feel like you&#8217;re totally in the same league as some of your heroes, but you&#8217;re going to get closer and closer over time.<br><br>The more you work at it, and it&#8217;s a natural process to feel like you&#8217;re, there&#8217;s a huge gaping chasm between you and what you want to be. And that&#8217;s because you have good taste and that&#8217;s because you know what you like, and, to go back to the Creative Pep Talk podcast that I was mentioning, you can embrace those influences.<br><br>And yet you realize that you&#8217;re not there yet, but embrace it and draw from it and take inspiration from this band and take other inspiration from this other artist. And you can use that to create your own style. And again, maybe realize that you&#8217;re never going to be where you want to be because you just hold your idols up to a standard that you may never feel like your reach, but striving for that, and using those influences is going to hopefully get you over the gap that Ira Glass talks about.  And on the other side of the gap, also helps you develop your own style and your own uniqueness that will then maybe make somebody else look up to you and what you&#8217;ve done over the years.<br><br>So I will link to that Creative Pep Talk podcast and also the Ira Glass video, where he talks about the gap, because both are worth listening to or watching. <br><br>The next thing I learned from all of this is the importance of making it real. And this is actually a weird one, but it has been way more helpful than I expected.<br><br>So I already talked a little bit about sort of changing your identity and. One good way of making that identity shift is to make the project that you&#8217;re working on even more real. <br><br>So years ago, I got a logo designed for my band and big thanks to Jason out there for working with me on that. And this seemed at the time to be an insane thing to do because I had never written a song.<br><br>And yet here I was getting a logo designed for a band that doesn&#8217;t exist. And, I did the same thing with a website. I, I registered a domain. Actually, hold on, I&#8217;m going to go check and see when I registered it and come back. <br><br>Wow, so I just found out I registered the domain way back in 2010. So 10 years ago, I registered a domain for a band that I had not yet started and had never written a song before.<br><br>It is a four-character .com domain, so I&#8217;m definitely glad I got it when I did, but still 10 years is a long time. And so when I was doing these things, they seemed crazy at the time, but I realized they were really beneficial because they made the project real and I could see it was something to grab onto, even though I was struggling with the actual process of writing the songs that would then be on the album that would then be promoted on the website. <br><br>It made the project real and having a logo to look at and having social media accounts for this fake band that didn&#8217;t exist actually made it real and sort of helped change my mindset about it. From, I can&#8217;t do this to, Oh, actually I am doing this.  <br><br>And I did the same thing with songs I&#8217;ve over the last year or so. I was just collecting song title ideas in an Evernote. And that also seemed crazy at the time too, because I&#8217;d never written a song that I actually liked enough that I would think about releasing. So what&#8217;s the point of having all these song names when I can&#8217;t write music, but that became so useful over the last few months, because I have written a bunch of songs. And now I have all these song names which have then inspired a bunch of lyrics. So all of these crazy things that I did over the years to make this project more real are now coming in handy and are making these other tasks that I need to do much easier. <br><br>So this list of song names is now inspiring lyrics and making the lyric writing a lot easier. And now that I actually do have music to release, I already have a website. I already have a logo. And all of these things that I put together in the years past helped lead to this.<br><br>This one is actually money related and I have to thank Ramit Sethi for inspiring this one. And Ramit was also on the podcast. He was episode number 53, and he inspired me to be less cheap when it comes to things that are really important to me, which, it turned out to be a huge blessing for this project.<br><br>So like I said before, anything could have stopped me. I always had an excuse. There was always something better to do. There was always some reason that I couldn&#8217;t sit down and write music and had I not invested in some really good gear. I think that could have stopped me from progressing as fast as I did.<br><br>So, for example, this microphone that I&#8217;m talking to you on is a Shure SM7b, and it&#8217;s pretty expensive. It&#8217;s like 400 bucks, but I&#8217;ve been using it for this podcast for awhile and it&#8217;s been great. But the reason I bought it is because it&#8217;s also a great vocal microphone. So when I was trying to record vocals for some of these songs that I&#8217;ve written and was not happy with how it sounded had I not had this microphone and instead had a cheap microphone, I would have blamed the microphone and then would have just moved on to something else rather than try to actually make the vocal sound good using the microphone that I had. <br><br>And this SM7b is based on the SM7 microphone, which is what Michael Jackson used to record Thriller.<br><br>So it&#8217;s like, if I can&#8217;t make my vocal sound good, then it&#8217;s obviously something with how I&#8217;m processing them or how I&#8217;m singing them and it&#8217;s not the microphone because obviously that record sounded amazing. So Ramit inspired me to not be so cheap with everything which came at a great time because I&#8217;ve since had to buy some gear to set up my home recording studio and rather than go for the cheapest option, I&#8217;ve gone for the cheapest, really high quality option.<br><br>Having good gear to rely on has taken away all my excuses of why this doesn&#8217;t sound the way I needed to. And instead put it on myself to get better at what I&#8217;m doing. And I haven&#8217;t had an easy scapegoat to blame for things, not sounding the way I want them to. <br><br>So my advice to you is to follow a Ramit&#8217;s advice.  If this is something that&#8217;s really important to you, like music is to me and, you know, you have money saved up, you&#8217;re not going to break the bank, then investing in high quality gear to support that hobby is well worth it, in my opinion. <br><br>And I get so much joy from using this microphone that I&#8217;m talking to now, and it is definitely worth the investment, even though it did cost a little more upfront.<br><br>So those were the main takeaways from my ultralearning experiment. And hopefully it helps you on your creative journey, whatever it is you&#8217;re trying to accomplish. Before I finish up, though, I just want to address one other thing. And that was the S curve of progress. The way he sort of described it as that, you know, when you start out, imagine yourself on a beach and you&#8217;re trying to swim out to sea.<br><br>At first it&#8217;s great. You just wade into the water and you know, it feels good having water on your feet and your ankles. And it&#8217;s nice and you think, Hey, this is great. This is going to be fun. And then, you know, you start getting a little bit deeper and then the waves start crashing into you. And it&#8217;s a struggle just to stay afloat, let alone, get out to sea.<br><br>So it&#8217;d be really easy to give up at that stage and just go back onto the sand. But, once you get past those initial breakers, then things smooth out and it gets a lot easier. And he said, that&#8217;s the same with anything creative. You know, at first you&#8217;re excited and you&#8217;re making a lot of progress and it&#8217;s fun.<br><br>And then you just hit like a brick wall and you feel like you&#8217;re not making any progress and you don&#8217;t really know how to make progress, but then all of a sudden you break through the other side and you resume your upward march and it gets a lot easier. <br><br>So he said that and I&#8217;d hoped that he was right, but I didn&#8217;t know if that would happen to me or if I was just unable to swim and I would just sink to the bottom.<br><br>I&#8217;m happy to say that, just a few weeks ago, I feel like I leveled up and it came out of nowhere. It was, you know, after lots of months of putting in the hours. And I felt like I was sort of slowly progressing during that time, but nothing big. And then just a few weeks ago, it was just like a switch flipped in my mind. And I was able to do things that I wasn&#8217;t able to do before.<br><br>And I was able to see things a lot clearer. That was incredibly exciting. So if you are out there and you are trying and you feel like you&#8217;re just not making any progress, realize that lots of connections are being formed in your brain. And lots of things are being connected and joined together. And even if you don&#8217;t feel like you&#8217;re making progress, things are happening, that will then hopefully level you up to a whole other place when you least expect it.<br><br>Because experiencing it for myself just a few weeks ago has really made me excited for the future, because I know that even if I feel stuck and if I feel like I&#8217;m not really doing any better than I was a month ago, I know things are happening and hopefully I&#8217;ll get another jump up in abilities that I wouldn&#8217;t have otherwise had I not put in the hours.<br><br>So again, it&#8217;s been one of the most difficult things I&#8217;ve ever done, but it&#8217;s also been one of the most rewarding and to have this big of a project to work on during these weird COVID times has been a real big blessing because I&#8217;ve just been able to focus and sort of try to block everything else out in the world.<br><br>And it&#8217;s been a great distraction and a great thing to focus on. So if you&#8217;re in the position where you have a lot more free time on your hands, because of COVID (I know the parents out there have no seconds to spare these days), but if you are in the position where COVID is opened up a lot of free time, then I would definitely recommend starting your own ultralearning experiment and seeing what happens.<br><br>Because even though this was an extremely difficult year, I can tell you that it&#8217;s more difficult not doing it because that was what I spent the rest of my adult life doing was just putting it off and procrastinating. And even though that seemed easier at the time, it really wore on me and ended up being a lot more difficult than just sitting down and getting to work.<br><br>So I highly recommend you starting your own ultralearning project and making progress on the things that are important to you. <br><br>And if you want to hear the song that came out of this ultralearning experiment for me then head to madfientist.com/album and you can preorder the album there and you&#8217;ll immediately get a link to the single.<br><br>And it&#8217;s crazy releasing this now because the lyrics talk about viruses, germs, and outbreaks and things like that. And it sounds like I wrote it for COVID, but I definitely did not. I wrote this back in 2019.<br><br>If you do preorder the album soon after this episode airs, you&#8217;ll be able to hear a synthy, electronic cover of a Sonic Youth song that I did.<br><br>Since it&#8217;s a song that I mixed and mastered myself, I&#8217;ll probably take it down and remix it for the album but it&#8217;s currently up on Spotify now so you can check that out too. <br><br>Anyway, thanks so much for listening. <br><br>I hope this was helpful and if you do buy the album and get the single, I hope you it.  This is a terrifying day for me but it&#8217;s also really exciting because it&#8217;s the start of making this project real real, instead of pretend real like I&#8217;ve been pretending for, I guess, 10 years now.<br><br>So thanks to everyone who helped along the way and big thanks to you for letting me share it with you. <br><br>Take care and I&#8217;ll speak to you again soon.</div>\n\n\n\n\n\n<h2>Related Post</h2><div><a href='https://www.madfientist.com/best-and-worst-about-fi/' target='_blank'><div class='post_card'><div class='post_card_text'><h3 style='color:#399da8;'>The Best and Worst Thing About Financial Independence</h3><p class='post_card_excerpt'>The best thing about financial independence is also the worst. I explain what it is and also share details about the secret project I've been working on!</p></div><div class='post_card_image'><img src='https://www.madfientist.com/wp-content/uploads/2019/09/best-and-worst-about-fi.jpg' style='border-radius:7px;'/></div></div></a></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/ultralearning-experiment-results/\">8 Key Lessons from the Ultralearning Experiment (and a Huge Announcement)</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "wfw:commentRss": "https://www.madfientist.com/ultralearning-experiment-results/feed/",
  "slash:comments": 26,
  "enclosure": ""
}