{
  "title": "How We Teach The Leaders of Tomorrow To Be Curious, Ask Questions and Not Be Afraid To Fail Fast To Learn Fast",
  "link": "http://rocketdatascience.org/?p=1524",
  "comments": "http://rocketdatascience.org/?p=1524#respond",
  "dc:creator": "Kirk Borne",
  "pubDate": "Fri, 16 Oct 2020 21:25:50 +0000",
  "category": [
    "Artificial Intelligence",
    "Big Data",
    "Data Science",
    "Machine Learning",
    "Strategy"
  ],
  "guid": "http://rocketdatascience.org/?p=1524",
  "description": "I recently enjoyed recording a podcast with Joe DosSantos (Chief Data Officer at Qlik). This was one in a series of #DataBrilliant podcasts by Qlik, which you can also access here (Apple Podcasts) and here (Spotify). I summarize below some of the topics that Joe and I discussed in the podcast. Be sure to listen [&#8230;]",
  "content:encoded": "\n<p>I recently enjoyed recording a podcast with <a rel=\"noreferrer noopener\" aria-label=\"Joe DosSantos (opens in a new tab)\" href=\"https://blog.qlik.com/joe-dossantos/\" target=\"_blank\">Joe DosSantos</a> (Chief Data Officer at <a rel=\"noreferrer noopener\" aria-label=\"Qlik (opens in a new tab)\" href=\"https://www.qlik.com/\" target=\"_blank\">Qlik</a>). This was one in a series of <a rel=\"noreferrer noopener\" aria-label=\"#DataBrilliant podcasts by Qlik (opens in a new tab)\" href=\"https://www.listennotes.com/podcasts/data-brilliant-qlik-oWOh2H5Y97U/\" target=\"_blank\">#DataBrilliant podcasts by Qlik</a>, which you can also access <a rel=\"noreferrer noopener\" aria-label=\"here (opens in a new tab)\" href=\"https://podcasts.apple.com/us/podcast/data-brilliant/id1510000879\" target=\"_blank\">here</a> (Apple Podcasts) and <a rel=\"noreferrer noopener\" aria-label=\"here (opens in a new tab)\" href=\"https://open.spotify.com/show/6s4HW4jvJ5x7xZaYz1TVrb\" target=\"_blank\">here</a> (Spotify). I summarize below some of the topics that Joe and I discussed in the podcast. Be sure to listen to the full recording of our lively conversation, which covered Data Literacy, Data Strategy, Data Leadership, and more.</p>\n\n\n\n<p><strong>The Age of Hype Cycles</strong></p>\n\n\n\n<p>The data age has been marked by numerous “hype cycles.” First, we heard how Big Data, Data Science, Machine Learning (ML) and Advanced Analytics would have the honor to be the technologies that would cure cancer, end world hunger and solve the world’s biggest challenges. Then came third-generation Artificial Intelligence (AI), Blockchain and soon Quantum Computing, with each one seeking that honor.</p>\n\n\n\n<p>From all this hope and hype, one constant has always been there: a focus on value creation from data. As a scientist, I have always recommended a scientific approach: State your problem first, be curious (ask questions), collect facts to address those questions (acquire data), investigate, analyze, ask more questions, include a sensible serving of skepticism, and (above all else) aim to fail fast in order to learn fast. As I discussed with Joe DosSantos when I spoke with him for the latest episode of Data Brilliant, you don’t need to be a data scientist to follow these principles. These apply to everyone, in all organizations and walks of life, in every sector.</p>\n\n\n\n<p>One characteristic of science that is especially true in data science and implicit in ML is the concept of continuous learning and refining our understanding. We build models to test our understanding, but these models are not “one and done.” They are part of a cycle of learning. In ML, the learning cycle is sometimes called backpropagation, where the errors (inaccurate predictions) of our models are fed back into adjusting the model’s input parameters in a way that aims to improve the output accuracy. A more colloquial expression for this is: good judgment comes from experience, and experience comes from bad judgment.</p>\n\n\n\n<p><strong>Data Literacy For All</strong></p>\n\n\n\n<p>I know that for some, the term data and some of the other terminology I’ve mentioned already can be scary. But they shouldn’t be. We are all surrounded by – and creating – masses of data every single day. As Joe and I talked about, one of the first hurdles in data literacy is getting people to recognize that everything is data. What you see with your eyes? That’s data. What you hear with your ears? Data. The words that come out of your mouth that other people hear? That’s all data. Images, text, documents, audio, video and all the apps on your phone, all the things you search for on the internet? Yet again, that’s data.</p>\n\n\n\n<p>Every single day, everyone around the world is using data and the principles I mention above, many without realizing it. So, now we need to bring this value to our businesses.</p>\n\n\n\n<p><strong>How To Build A Successful Enterprise Data Strategy</strong></p>\n\n\n\n<p>In my chat with Joe, we talked about many data concepts in the context of enterprise digital transformation. As always, but especially during the race toward digital transformation that has been accelerated by the 2020 pandemic, a successful enterprise data strategy that leads to business value creation can benefit from first addressing these six key questions:</p>\n\n\n\n<p>(1) What mission objective and outcomes are you aiming to achieve?</p>\n\n\n\n<p>(2) What is the business problem, expressed in data terminology? Specifically, is it a detection problem (fraud or emergent behavior), a discovery problem (new customers or new opportunities), a prediction problem (what will happen) or an optimization problem (how to improve outcomes)?</p>\n\n\n\n<p>(3) Do you have the talent (key people representing diverse perspectives), tools (data technologies) and techniques (AI and ML knowledge) to make it happen?</p>\n\n\n\n<p>(4) What data do you have to fuel the algorithms, the training and the modeling processes?</p>\n\n\n\n<p>(5) Is your organizational culture ready for this (for data-informed decisions; an experimentation mindset; continuous learning; fail fast to learn fast; with principled AI and data governance)?</p>\n\n\n\n<p>(6) What operational technology environment do you have to deploy the implementation (cloud or on-premise platform)?</p>\n\n\n\n<p><strong>Data Leadership</strong></p>\n\n\n\n<p>As Joe and I discussed, your ultimate business goal is to build a data-fueled enterprise that delivers business value from data. Therefore, ask questions, be purposeful (goal-oriented and mission-focused), be reasonable in your expectations and remain reasonably skeptical – because as famous statistician, George Box, once said “all models are wrong, but some are useful.”</p>\n\n\n\n<p>Now, listen to the full podcast <a href=\"https://blog.qlik.com/how-we-teach-the-leaders-of-tomorrow-to-be-curious-ask-questions-and-not-be-afraid-to-fail-fast-to-learn-fast\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"here (opens in a new tab)\">here</a>.</p>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" width=\"1024\" height=\"536\" src=\"http://rocketdatascience.org/wp-content/uploads/2020/10/episode-6-blog-asset-1200x628-1024x536.jpg\" alt=\"\" class=\"wp-image-1534\" srcset=\"http://rocketdatascience.org/wp-content/uploads/2020/10/episode-6-blog-asset-1200x628-1024x536.jpg 1024w, http://rocketdatascience.org/wp-content/uploads/2020/10/episode-6-blog-asset-1200x628-300x157.jpg 300w, http://rocketdatascience.org/wp-content/uploads/2020/10/episode-6-blog-asset-1200x628-768x402.jpg 768w, http://rocketdatascience.org/wp-content/uploads/2020/10/episode-6-blog-asset-1200x628-624x327.jpg 624w, http://rocketdatascience.org/wp-content/uploads/2020/10/episode-6-blog-asset-1200x628.jpg 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /></figure>\n",
  "wfw:commentRss": "http://rocketdatascience.org/?feed=rss2&#038;p=1524",
  "slash:comments": 0
}