{
  "title": "Chinese Whispers: will Truss declare a genocide in Xinjiang?",
  "link": "https://audioboom.com/posts/8152138",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1418,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>After a long summer of hustings, Liz Truss has finally been confirmed today as the next leader of the Conservative party. As she gets the keys to Downing Street, she'll finally be able to carry out her vision of Sino-British relations. But what is that vision?<br>\n<br>\nOn the latest Chinese Whispers, Cindy Yu speaks to Sam Hogg, editor of the must-read Beijing to Britain newsletter, about what we know about Truss's views on China so far. Will she declare a genocide in Xinjiang? What is an acceptable level of trade with Beijing?<br>\n<br>\nThe difficulty for Truss is that she has never had to balance her opinions on China with the wider remit of government (for example, when it comes to the trading relationship that she lambasted her rival Rishi Sunak for pursuing, while at the Treasury). As Sam points out, taking the example of declaring a genocide in Xinjiang (something she has privately expressed support for): <br>\n<br>\n\n</div>\n<blockquote>‘When you officially recognise that a genocide is taking place, that puts an onus on the country that has done so to try and actively stop that, using a variety of means (that could be sanctions for example). With that in mind, one can see why it’s a useful campaign pledge, but a difficult policy to carry out once in power’</blockquote><div>Then she might be held hostage by China hawks on the backbenches – those MPs like Iain Duncan Smith who have lent her his support, but may want to see her be as vocally sceptical of China in Downing Street as she has been so far. In that case, there could be a vibe similar to how the hardline Brexiteers held previous Conservative prime ministers to ransom on seeing through their visions. ‘She’s made a series of political contracts with various backbenchers about how hawkish she is going to be towards China. And each of these backbenchers will have a limited amount of patience’, Sam points out.<br>\n<br>\nWe won't have long to find out as she gets her feet under the desk at No. 10 and, in a couple of months, meets with President Xi Jinping at the G20 summit in Indonesia.</div>\n",
  "pubDate": "Mon, 05 Sep 2022 16:50:58 +0000",
  "guid": "tag:audioboom.com,2022-09-05:/posts/8152138",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}