{
  "title": "Designing my life, part one: Building a compass",
  "link": "https://www.getrichslowly.org/building-a-compass/",
  "comments": "https://www.getrichslowly.org/building-a-compass/#comments",
  "dc:creator": "J.D. Roth",
  "pubDate": "Thu, 01 Sep 2022 18:49:00 +0000",
  "category": [
    "Planning",
    "Books"
  ],
  "guid": "https://www.getrichslowly.org/?p=244297",
  "description": "<p><a href=\"https://www.amazon.com/dp/1101875321/?tag=grs17-20\"><img src=\"https://www.getrichslowly.org/wp-content/uploads/designing_your_life.jpeg\" width=\"339\" height=\"480\" class=\"alignright\" /></a>Last week, <a href=\"https://www.getrichslowly.org/designing-your-life/\">I raved about</a> the book <a href=\"https://www.amazon.com/dp/1101875321/?tag=grs17-20\"><em>Designing Your Life</em></a> by Bill Burnett and Dave Evans. These two Stanford design professors have taken design principles and applied them to helping people figure out what they want to be when they grow up.</p>\n<p>After advocating <em>Designing Your Life</em> to several friends, two of them suggested that we work through the book's exercises together. One of those friends is Kim, my long-term girlfriend. The other is Craig, a college classmate. I thought it might be fun to share some of these exercises as we complete them over the next couple of months.</p>\n<p>Because I want to respect the intellectual property of the authors, I'm not going to describe the exercises <em>exactly</em>. Instead, I'll provide a vague overview and then discuss my own answers. (And, when it makes sense, I'll also include answers from my friends.)</p>\n<p>With that out of the way, let's dive in! Let's see what happens as I begin the process of designing my life.</p>\n",
  "content:encoded": "<p><a href=\"https://www.amazon.com/dp/1101875321/?tag=grs17-20\" rel=\"noopener\"><img loading=\"lazy\" src=\"https://www.getrichslowly.org/wp-content/uploads/designing_your_life.jpeg\" width=\"339\" height=\"480\" class=\"alignright\" /></a>Last week, <a href=\"https://www.getrichslowly.org/designing-your-life/\">I raved about</a> the book <a href=\"https://www.amazon.com/dp/1101875321/?tag=grs17-20\" rel=\"noopener\"><em>Designing Your Life</em></a> by Bill Burnett and Dave Evans. These two Stanford design professors have taken design principles and applied them to helping people figure out what they want to be when they grow up.</p>\n<p>After advocating <em>Designing Your Life</em> to several friends, two of them suggested that we work through the book's exercises together. One of those friends is Kim, my long-term girlfriend. The other is Craig, a college classmate. I thought it might be fun to share some of these exercises as we complete them over the next couple of months.</p>\n<p>Because I want to respect the intellectual property of the authors, I'm not going to describe the exercises <em>exactly</em>. Instead, I'll provide a vague overview and then discuss my own answers. (And, when it makes sense, I'll also include answers from my friends.)</p>\n<p>With that out of the way, let's dive in! Let's see what happens as I begin the process of designing my life.<span id=\"more-244297\"></span></p>\n<h2>Start Where You Are</h2>\n<p><img loading=\"lazy\" class=\"alignright\" title=\"Start where you are quote by Arthur Ashe\" src=\"https://www.getrichslowly.org/images/2017/ashequote-sky.png\" alt=\"Start where you are quote by Arthur Ashe\" width=\"350\" height=\"350\"/>The first step to designing your life, say the authors, is to start where you are. I like that advice! In fact, that's also <em>my</em> advice to folks who are trying to turn around their financial lives: <a href=\"https://www.getrichslowly.org/start-where-you-are/\">start where you are</a>.</p>\n<p>In the case of life design, Burnett and Evans want readers to perform a self-assessment. This assessment involves honestly evaluating four aspects of your life — health, love, play, and work — by giving each a rating, then writing a short description of the current state of each.</p>\n<p>Here's how I rated these four aspects of my own life:</p>\n<ul>\n<li><strong>Health (37.5%, rising)</strong> — After achieving the best fitness of my life a decade ago, I allowed my health to slowly but steadily decline. I've arrested this fall and begun to turn things around, but there's a lot of effort ahead of me if I want to become fit again.</li>\n<li><strong>Love (62.5%, rising)</strong> — I'm pleased with the relationship I have with Kim, but we both agree we could prioritize each other more, especially day to day. I also have work to do with my family and friend relationships. The good news is that I'm <em>doing</em> this work, and this area of my life is improving too.</li>\n<li><strong>Play (50%, rising)</strong> — I've neglected productive play for several years. Kim noted recently that when we met in 2012, I had all sorts of things going on: Spanish lessons, guitar classes, volunteering at a school, Crossfit five times a week. Perhaps because of <a href=\"https://www.getrichslowly.org/marijuana-and-me/\">my marijuana use</a>, I discarded all of those things. My only play involves videogames and anime. I'm in the process of rediscovering productive play.</li>\n<li><strong>Work (56%, rising)</strong> — Since I repurchased this site, I've struggled to find purpose and clarity with my work. I lost my way. I believe that's changing; I now have a clear vision for what I want this site to be. I'm not 100% sure how to reach this destination, but that's fine. I'll figure it out. The ship is now on course.</li>\n</ul>\n<p>This first <em>Designing Your Life</em> exercise isn't mean to be actionable. It's an assessment. Like your net worth, this is a snapshot of a moment in time. But once you've taken this snapshot, once you've determined your location on the &#8220;map&#8221; of life, it's time to figure out where you want to go. That involves building a metaphorical compass.</p>\n<h2>Building a Compass</h2>\n<p>In the second chapter of <em>Designing Your Life</em>, readers are asked to write two thoughtful mini-essays: a Workview and a Lifeview. These short reflections are meant to be statements of purpose. They are very much like the <a href=\"https://www.getrichslowly.org/personal-mission-statement/\">personal mission statement</a> I encourage my audience to create.</p>\n<p>Kim and I haven't compared the results of this exercise yet, but on Tuesday night Craig and I connected by Facetime to discuss our visions of work and life. I enjoyed this process very much and felt like it helped me appreciate him more as a human being (and a friend). This was, in part, because our responses had a lot of overlap. We share a lot of core values.</p>\n<p>With Craig's permission, I'm going to share his Workview and Lifeview as well as my own. I think you might these interesting.</p>\n<h3>Workview</h3>\n<p>Here is Craig's view of work:</p>\n<blockquote><p>\n<strong><em>Craig's Workview</em></strong><br />\nI work for money happily for awhile if it the pay seems fair, but experience, learning, and growth are essential if I am to remain happy for long. Work for money, or status, clouds any effort with petty concerns of parity, competition, and greed. Still, we live in this Capitalist system, cannot escape it on our own, and there are undeniably worse systems.</p>\n<p>Confidence that the work I am doing is fair, supports life, and does not do permanent harm to natural systems, is important to me. This sort of <a href=\"https://en.wikipedia.org/wiki/Noble_Eightfold_Path#Right_livelihood\" rel=\"noopener\">&#8220;right livelihood&#8221;</a> is aspirational, and perhaps impossible at certain timescales if all impacts are taken into account.</p>\n<p>I most value work that I can see. Producing a tangible product in particular is rewarding. This is perhaps why growing things has always been a part of my life or aspirations. Fostering abundance in the form of food is endlessly satisfying. Tangible tools that enable my work are also satisfying. </p>\n<p>I think the most meaningful work possible right now is in restoring natural systems.\n</p></blockquote>\n<p>And here is my own view of work:</p>\n<blockquote><p>\n<strong><em>J.D.'s Workview</em></strong><br />\nWork plays several roles for me. It's my primary means to earn money, of course, but it's also a chance for me to spend my time in a way that brings me fulfillment while also contributing something to society at large. It's a way for me to improve my life while also improving the lives of others. I'm fortunate to have found a way to do this while making money. (Right now, though, I make <em>very</em> little money.) I've found my <a href=\"https://en.wikipedia.org/wiki/Ikigai\" rel=\"noopener\">ikigai</a>.</p>\n<p>I want to keep these two ideas — GRS can help me and others simultaneously — in the forefront of my mind as I make work decisions in the future. I want to remain clear on my passion and purpose.</p>\n<p>My aim is to transform Get Rich Slowly into a valuable, easy-to-access resource for folks who want to learn how to master their money (and their lives). I want the site to be uncluttered, accurate, and reliable. I want to put the reader first. Ideally, it will produce income for me but I'm okay with that being a lower objective, one that might take time to figure out.\n</p></blockquote>\n<p>Craig and I were surprised to see that we had similar expectations of work. We understand that work is a means to obtain money. And we both agree that work ought to be fulfilling for us personally. But we both want our work to mean something more, to benefit the world at large.</p>\n<p>Craig brought up the Buddhist notion of &#8220;right livelihood&#8221;. I mentioned the Japanese concept of <em>ikigai</em>. All of this reminded me of the discussion of &#8220;personal dharma&#8221; from Stephen Cope's book, <a href=\"https://www.amazon.com/dp/0553386077/?tag=grs17-20\" rel=\"noopener\"><em>The Great Work of Your Life</em></a>.</p>\n<p><a href=\"https://www.amazon.com/dp/0553386077/?tag=grs17-20\" rel=\"noopener\"><img loading=\"lazy\" src=\"https://www.getrichslowly.org/wp-content/uploads/dharma.jpg\" width=\"800\" height=\"500\" class=\"aligncenter green-border\" alt=\"Personal dharma\" title=\"Personal dharma\" /></a></p>\n<p>After a couple of days to think about our discussion, I'd say that both Craig and I want to do work that fosters abundance, that achieves a win-win outcome for us and others.</p>\n<h3>Lifeview</h3>\n<p>Next, here are our reflections on the meaning and purpose of life. Note how much overlap we have here. It's a bit eerie. (We didn't discuss any of this in advance.)</p>\n<blockquote><p>\n<strong><em>Craig's Lifeview</em></strong><br />\nFirst, do no harm, and also do some good once in awhile, is essential advice for living. I live a rich inner life which has many rewards, but can be selfish when practiced to extremes. Sharing knowledge and insight is rewarding. Giving comfort to others, in whatever form that may take, is still more rewarding.</p>\n<p>There is no god, but the human search for meaning that inspired the creation of gods can make certain religious traditions and rituals meaningful. The sublime fact that the entire earth is an insignificant dot in the vastness of space, and our lives here an unnoticed blip in the vastness of time, is somehow comforting.</p>\n<p>Natural systems will eventually end our lives and use our remains for food, and participation in this cycle is also comforting. In the meantime, if stewarded, nature will shower us with abundance beyond belief.</p>\n<p>In the end, laughter is the only reasonable response to life’s vicisitudes. Sharing laughter is perhaps the best way to conquer fear and pain. &#8220;For what do we live, but to make sport for our neighbors, and laugh at them in our turn?&#8221; &#8211; Austen, <em>Pride and Prejudice</em>\n</p></blockquote>\n<p>And here is mine:</p>\n<blockquote><p>\n<strong><em>J.D.'s Lifeview</em></strong><br />\nI believe that life has no inherent meaning. This could easily be a source of despair, leading to hedonism and/or antisocial behavior. I choose instead to see it as an opportunity to create my own meaning, to find my own sense of purpose.</p>\n<p>I believe that morality has nothing to do with which god you worship, which country you live in, which political faction you belong to. Morality is about one thing only: How you treat other people. (And, to a lesser degree, how you treat all living things.)</p>\n<p>Morality is about how you treat others. It's about how you treat those with whom you have a power imbalance. (For instance, how you treat servers or sales staff, how you treat the homeless, how you treat your children or your employees or your pets.) And, especially, how you treat those with whom you disagree. (How Christians treat atheists, for instance, or how Democrats treat Republicans.)</p>\n<p>I value curiosity. I value knowledge. I value kindness. I value mutual aid and support. I believe that we grow as individuals when we have deep connections with other people, especially those in our neighborhood and community. So much of the current conflict in our world comes from an unwillingness to engage productively with folks who disagree with us. I want to form bonds with people from all walks of life.</p>\n<p>I believe that I can make the most difference in the world by working from the center outward. I must practice rational self-centeredness, putting my needs first (but without depriving others of their needs). From this strong base, I can support Kim. Then my friends and family. And from there, I can focus on improving the world as a whole.</p>\n<p>My aim is to leave the world a better place than I found it.\n</p></blockquote>\n<p>After sharing our Lifeviews with each other, Craig and I discussed the notion of <a href=\"https://www.getrichslowly.org/social-capital/\">social capital</a>. This is actually an idea that Craig introduced me to nearly twenty years ago when he told me about the book <a href=\"https://www.amazon.com/dp/0743203046/?tag=grs17-20\" rel=\"noopener\"><em>Bowling Alone</em></a> by Robert Putnam. We agree that social capital seems to have collapsed in the United States — and perhaps the internet is responsible for this. We both would like our lives and work to encourage the growth of social capital.</p>\n<h2>Not Unto Ourselves Alone Are We Born</h2>\n<p><img loading=\"lazy\" src=\"https://www.getrichslowly.org/wp-content/uploads/wu-seal-gold.png\" width=\"248\" height=\"241\" class=\"alignright\" alt=\"Not unto ourselves alone are we born\" title=\"Not unto ourselves alone are we born\" />Why do Craig and I share such similar worldviews? I'm not 100% sure. It could very well be because we attended the same college (<a href=\"http://willamette.edu\" rel=\"noopener\">Willamette University</a>) at the same time. I think it's worth noting that Angela Rozmyn (from <a href=\"https://treadlightlyretireearly.com\" rel=\"noopener\">Tread Lightly, Retire Early</a>) and I also share similar worldviews. She also attended Willamette.</p>\n<p>The Willamette University motto is <a href=\"https://en.wikipedia.org/wiki/Non_nobis_solum\" rel=\"noopener\"><em>non nobis solum nati sumus</em></a>, which translates to English as &#8220;not unto ourselves alone are we born&#8221;. Clearly, both Craig and I have incorporated this notion into our views of work and life. Angela too.</p>\n<p>The authors of <a href=\"https://www.amazon.com/dp/1101875321/?tag=grs17-20\" rel=\"noopener\"><em>Designing Your Life</em></a> say that your Workview and your Lifeview are meant to act as compasses. They provide direction when you've lost your way. When you reach a fork in the road, consulting these compasses should help you determine which path to choose.</p>\n<p>I think this is a great exercise. In fact, it's likely that I'll adapt it to fit my own presentations. I feel as if my workshops on finding purpose have certain gaps. The exercises in <em>Designing Your Life</em> help to fill those gaps.</p>\n<p>Next up? Chapters three and four of <em>Designing Your Life</em>. For the next couple of weeks, Craig and I will each be keeping a &#8220;Good Time Journal&#8221; in which we log our activities and rate how engaged and energized we are by the things we do. Then we'll use mindmapping to see what we can learn from this journal.</p>\n<p>Should be fun!</p>\n<div id=\"mediavine-settings\" data-blacklist-content-desktop=\"1\" data-blacklist-content-mobile=\"1\"></div>\n",
  "wfw:commentRss": "https://www.getrichslowly.org/building-a-compass/feed/",
  "slash:comments": 11
}