{
  "id": "yt:video:hzz36cvo88U",
  "yt:videoId": "hzz36cvo88U",
  "yt:channelId": "UCAL3JXZSzSm8AlZyD3nQdBA",
  "title": "Primitive Technology: Adobe wall (dry stacked)",
  "link": "",
  "author": {
    "name": "Primitive Technology",
    "uri": "https://www.youtube.com/channel/UCAL3JXZSzSm8AlZyD3nQdBA"
  },
  "published": "2019-09-05T21:00:11+00:00",
  "updated": "2022-03-18T06:35:04+00:00",
  "media:group": {
    "media:title": "Primitive Technology: Adobe wall (dry stacked)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Join me for my first Reddit AMA on Friday 1st November 9am BST / 6pm AEST. My username is u/JohnPlant. The AMA will be on the “r/IAmA” subreddit. \nPrimitive Technology: Adobe wall (dry stacked) - Building an adobe wall from scratch.\nGet my new book:  http://po.st/PrimTechBook | Subscribe: http://bit.ly/subPT\nMy hut burned down, so I built a new one: https://youtube.com/watch?v=YmFTK-rnzfk&list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj\n\nFollow Primitive Technology:\nPatreon: https://patreon.com/user?u=2945881\n\nWatch More Primitive Technology:\nLatest Uploads: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1\nPyrotechnology: https://youtube.com/playlist?list=PLGnWLXjIDnpBVRqu5lz5JGaQxjPs7q3CJ&playnext=1\nShelter: https://youtube.com/playlist?list=PLGnWLXjIDnpBBsdKZb-vy30o88SIxItp2&playnext=1\nWeapons: https://youtube.com/playlist?list=PLGnWLXjIDnpA-XGDrrmVgBnSXx15i2Awp&playnext=1\nPopular Videos: https://youtube.com/playlist?list=PLGnWLXjIDnpAb29Lrdki5BPjTpMon8zla&playnext=1\n\nAbout This Video:\nI made clay bricks, air dried them and then built a dry stacked (no mortar) wall from those bricks. Brick making is a time consuming process. To amass enough bricks for a large scale firing will take a long time to do. In the previous hut (that burnt down) bricks were stored inside the hut out of the rain to dry before firing. This took up considerable space within the hut. So with this hut, bricks were stored under the eves of the hut forming a temporary wall around the work space. Clay was taken from a pit and carried to the hut site. The clay was mixed with water in a pit. The ceramic brick mold (made of fired clay in a previous video) was soaked in water and wood ash to make it slippery so that the clay would slide out easily. Bricks were then formed on the floor of half the hut. When the bricks had dried enough they were then stacked under the eaves to form a growing wall. I'll continue making clay bricks and when an opportunity rises, I will take them out and fire them, upgrading them from adobe bricks to fired clay bricks. These will in theory be used in a permanent hut constructed from bricks and mortar. \n\nAbout Primitive Technology:\nPrimitive technology is a hobby where you build things in the wild completely from scratch using no modern tools or materials. These are the strict rules: If you want a fire, use a fire stick - An axe, pick up a stone and shape it - A hut, build one from trees, mud, rocks etc. The challenge is seeing how far you can go without utilizing modern technology. I do not live in the wild, but enjoy building shelter, tools, and more, only utilizing natural materials. To find specific videos, visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}