{
  "title": "The Future of Food, Energy and Space | Tony sits down with 4 visionary business leaders creating solutions to global problems",
  "pubDate": "Fri, 08 Jan 2021 23:49:38 +0000",
  "guid": "7a8b66ec-4991-4894-a002-2dd16bb8f615",
  "link": "https://tonyrobbins.libsyn.com/the-future-of-food-energy-and-space-tony-sits-down-with-4-visionary-business-leaders-creating-solutions-to-global-problems",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">This past year was a trying one for all of us, and this new year has started off with challenges, too. It would be easy to believe that we as a society are headed in a negative direction, to be fearful of the future – but as Tony says, Fear is simply imagination undirected. What happens when you give direction to your imagination? That’s what we call faith.</span></p> <p><span style=\"font-weight: 400;\">Faith is not learned, it’s something we are born with. Faith is what fuels us through times of fear and uncertainty. It is more powerful than any emotion, even fear. When all hell is breaking loose, it gives us the ability to find our center, to help ourselves and others to find answers, to find a higher meaning in the midst of our pain and in spite of our fear. And if you’re a leader, you take that certainty and transfer it into others, because human conviction has a viral effect and will spread. Faith is knowing that at our core we're more than anything we will ever face, and we can handle whatever life brings us. We always have and we always will. That is the power of the human race.</span></p> <p><span style=\"font-weight: 400;\">In this episode, Tony sits down with four extraordinary human beings that are working to solve major global issues, who believe so strongly in their solutions and have so much certainty that it’s almost contagious! </span></p> <p><span style=\"font-weight: 400;\">These four leaders are not only world changing technology experts, but the founders and CEOs of companies that are bringing the stuff of science-fiction novels</span> <em><span style=\"font-weight: 400;\">to life</span></em><span style=\"font-weight: 400;\">. And faster than anyone thought possible. They're doing things that will change the lives of billions of people all across the globe. Their ultimate outcome is to increase that quality of life for everyone in existence and for generations to come. </span></p> <p><span style=\"font-weight: 400;\">In this episode, you will learn about: </span></p> <p><strong>The future of food.</strong> <span style= \"font-weight: 400;\">Hear from CEO and co-founder of <a href= \"https://eatupwardfarms.com/\">Upward Farms</a>, Jason Green. (Yes, you read that right – he may indeed have a green thumb!) Upward Farms is a Brooklyn-based indoor aquaponic farm sustainably growing leafy greens and fish with the highest ecological and quality standards. Jason is changing the way we grow food and challenging the environmentally devastating practices we’ve been using for so long. </span></p> <p><strong>The future of energy</strong><span style= \"font-weight: 400;\">. Learn from the genius mind behind the monetization of search words, Bill Gross, whose company, <a href= \"https://www.idealab.com/\">Idealab</a>, is the longest running technology incubator in the</span> <em><span style= \"font-weight: 400;\">history of the world</span></em><span style= \"font-weight: 400;\">. He’s taking on sustainable energy like no human on earth has done before. </span></p> <p><strong>The future of space.</strong> <span style= \"font-weight: 400;\">Hear from Mikhail Kokorich, CEO of <a href= \"https://momentus.space/\">Momentus</a>, a space transportation company. Mikhail’s commercial and private space travel is the stuff of every sci-fi lover's dreams. But he’s taking it from beyond the pages of books and movies and making it real with special water propulsion technology. And he’s not just stopping at transportation. </span></p> <p><strong>The future of business.</strong> <span style= \"font-weight: 400;\">Tony pulls insights from</span> <span style= \"font-weight: 400;\">founder and general partner of <a href= \"https://www.primemoverslab.com/\">Prime Movers Lab</a>, Dakin Sloss. His company is all about seeing the value in people’s visions for starting new companies, and providing the funding and guidance to get them off the ground. But these aren’t your average entrepreneurial startups, these are companies that will change the way we experience life. </span></p> <p><span style=\"font-weight: 400;\">Most of you know that Tony is incredibly passionate about anything that can increase the quality of people's lives. He’s obsessed with finding answers and solutions. He’s also obsessed with finding entrepreneurs and companies that are on the brink of changing the world and being a part of that in any way he can. For Tony, this usually means more than just investing with them financially, but going on a journey with them, and investing on a soul-level. We hope you enjoy this episode!</span></p> <p><span style=\"font-weight: 400;\"><strong>\"I'm obsessed with entrepreneurs and companies that are about to change the world.\" - Tony Robbins</strong></span></p>",
  "content:encoded": "<p>This past year was a trying one for all of us, and this new year has started off with challenges, too. It would be easy to believe that we as a society are headed in a negative direction, to be fearful of the future – but as Tony says, Fear is simply imagination undirected. What happens when you give direction to your imagination? That’s what we call faith.</p> <p>Faith is not learned, it’s something we are born with. Faith is what fuels us through times of fear and uncertainty. It is more powerful than any emotion, even fear. When all hell is breaking loose, it gives us the ability to find our center, to help ourselves and others to find answers, to find a higher meaning in the midst of our pain and in spite of our fear. And if you’re a leader, you take that certainty and transfer it into others, because human conviction has a viral effect and will spread. Faith is knowing that at our core we're more than anything we will ever face, and we can handle whatever life brings us. We always have and we always will. That is the power of the human race.</p> <p>In this episode, Tony sits down with four extraordinary human beings that are working to solve major global issues, who believe so strongly in their solutions and have so much certainty that it’s almost contagious! </p> <p>These four leaders are not only world changing technology experts, but the founders and CEOs of companies that are bringing the stuff of science-fiction novels <em>to life</em>. And faster than anyone thought possible. They're doing things that will change the lives of billions of people all across the globe. Their ultimate outcome is to increase that quality of life for everyone in existence and for generations to come. </p> <p>In this episode, you will learn about: </p> <p>The future of food. Hear from CEO and co-founder of <a href= \"https://eatupwardfarms.com/\">Upward Farms</a>, Jason Green. (Yes, you read that right – he may indeed have a green thumb!) Upward Farms is a Brooklyn-based indoor aquaponic farm sustainably growing leafy greens and fish with the highest ecological and quality standards. Jason is changing the way we grow food and challenging the environmentally devastating practices we’ve been using for so long. </p> <p>The future of energy. Learn from the genius mind behind the monetization of search words, Bill Gross, whose company, <a href= \"https://www.idealab.com/\">Idealab</a>, is the longest running technology incubator in the <em>history of the world</em>. He’s taking on sustainable energy like no human on earth has done before. </p> <p>The future of space. Hear from Mikhail Kokorich, CEO of <a href= \"https://momentus.space/\">Momentus</a>, a space transportation company. Mikhail’s commercial and private space travel is the stuff of every sci-fi lover's dreams. But he’s taking it from beyond the pages of books and movies and making it real with special water propulsion technology. And he’s not just stopping at transportation. </p> <p>The future of business. Tony pulls insights from founder and general partner of <a href= \"https://www.primemoverslab.com/\">Prime Movers Lab</a>, Dakin Sloss. His company is all about seeing the value in people’s visions for starting new companies, and providing the funding and guidance to get them off the ground. But these aren’t your average entrepreneurial startups, these are companies that will change the way we experience life. </p> <p>Most of you know that Tony is incredibly passionate about anything that can increase the quality of people's lives. He’s obsessed with finding answers and solutions. He’s also obsessed with finding entrepreneurs and companies that are on the brink of changing the world and being a part of that in any way he can. For Tony, this usually means more than just investing with them financially, but going on a journey with them, and investing on a soul-level. We hope you enjoy this episode!</p> <p>\"I'm obsessed with entrepreneurs and companies that are about to change the world.\" - Tony Robbins</p>",
  "enclosure": "",
  "itunes:duration": "01:55:36",
  "itunes:explicit": false,
  "itunes:keywords": "energy,technology,space,business,future,sustainablefarming",
  "itunes:subtitle": "This past year was a trying one for all of us, and this new year has started off with challenges, too. It would be easy to believe that we as a society are headed in a negative direction, to be fearful of the future – but as Tony says, Fear is...",
  "itunes:episodeType": "full"
}