{
  "id": "https://bibleinoneyear.org/en/youth/315",
  "title": "Day 315: Stick At It",
  "description": "Psalm 123:1,2b–4, Ezekiel 22:1–2,3a,4,12, Hebrews 10:19–25a,26,36–39.  The writer of Hebrews encourages his readers not to be ‘quitters’ but ‘to stick it out’ (vv 34–39, MSG)",
  "pubDate": "Thu, 11 Nov 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/315/?ignore",
  "itunes:duration": "15:29",
  "guid": "enyouth11112021-315",
  "length": 929.52,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 315: Stick At It",
  "itunes:subtitle": "Psalm 123:1,2b–4, Ezekiel 22:1–2,3a,4,12, Hebrews 10:19–25a,26,36–39.  The writer of Hebrews encourages his readers not to be ‘quitters’ but ‘to stick it out’ (vv 34–39, MSG)",
  "itunes:summary": "Maryam and Marziyeh were arrested in Iran in 2009. Their crime: being Christians. They were blindfolded, interrogated and became ill during their time in prison. They were taken to court. Mr Haddad, the prosecuting lawyer, asked the two women if they were Christians. ‘We love Jesus,’ they replied. He repeated his question and they responded, ‘Yes, we are Christians.’\nMr Haddad asked whether they regretted becoming Christians, to which they replied, ‘We have no regrets.’ Then he stated emphatically, ‘You should renounce your faith verbally and in written form.’ They stood firm and replied, ‘We will not deny our faith.’\nWhen Mr Haddad told the women to return to prison to think about their options and come back to him when they were ready (to comply), Maryam and Marziyeh responded, ‘We have already done our thinking.’\nThe author of Hebrews writes to Christians who are the subject of persecution: ‘You stood your ground in a great contest in the face of suffering’ (Hebrews 10:32) – as Maryam and Marziyeh did before their prosecutors. (Thank God they have been released – we interviewed them as part of the Alpha Film Series: https://alpha.org/watch/alpha-film-series/)\nThe will to persevere is often the difference between success and failure. This is true of learning a new skill or sport or achieving success at schook or work. As has been said, ‘Observe the postage stamp; its usefulness depends on the ability to stick to one thing till it gets there.’ ‘Stickability’ is also a key to the Christian life. If you want to learn to read the Bible, pray, resist evil or whatever else, learn to persevere. The writer of Hebrews encourages his readers not to be ‘quitters’ but ‘to stick it out’ (vv.34–39, MSG).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 315
}