{
  "title": "The Fatal Flaw of the Pulse Oximeter",
  "link": "https://spectrum.ieee.org/pulse-oximeters-encode-racial-bias-with-clear-consequences-for-covid-19-patients",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-black-hospital-patient-with-a-pulse-oximeter-on-their-finger.jpg?id=30012999&width=1245&height=700&coordinates=0%2C318%2C0%2C318\"/><br/><br/><p>If someone is seeking medical care, the color of their skin shouldn’t matter. But, according to new research, pulse oximeters’ performance and accuracy apparently hinges on it. Inaccurate blood-oxygen measurements, in other words, made by pulse oximeters have had <a href=\"https://journals.lww.com/ajnonline/fulltext/2021/04000/pulse_oximetry_may_be_inaccurate_in_patients_with.9.aspx\" target=\"_blank\">clear consequences for people of color</a> during the COVID-19 pandemic. </p><p>“That device ended up being essentially a gatekeeper for how we treat a lot of these patients,” said Dr. <a href=\"https://www.bcm.edu/people-search/tianshi-wu-65121\" rel=\"noopener noreferrer\" target=\"_blank\">Tianshi David Wu</a>, an assistant professor of medicine at Baylor College of Medicine, in Houston, and one of the authors of the study.</p><hr/><p>For decades, scientists have found that pulse oximeters, devices that estimate blood-oxygen saturation, can be affected by a person’s skin color. In 2021, the FDA <a href=\"https://www.fda.gov/medical-devices/safety-communications/pulse-oximeter-accuracy-and-limitations-fda-safety-communication\" rel=\"noopener noreferrer\" target=\"_blank\">issued a warning</a> about this limitation of pulse oximeters. The agency says it plans to hold a <a href=\"https://www.fda.gov/medical-devices/safety-communications/pulse-oximeter-accuracy-and-limitations-fda-safety-communication\" target=\"_blank\">meeting on pulse oximeters</a> later this year. Because low oxygen saturation, called <a href=\"https://www.mayoclinic.org/symptoms/hypoxemia/basics/definition/sym-20050930\" target=\"_blank\">hypoxemia</a>, is a common symptom of COVID-19, low blood-oxygen levels qualify patients to receive certain medications. In the first study to examine this issue among COVID-19 patients, published in <em><a href=\"https://jamanetwork.com/journals/jamainternalmedicine/fullarticle/2792653#:~:text=Conclusions%20and%20Relevance%20The%20results,or%20unrecognized%20eligibility%20for%20COVID%2D\" rel=\"noopener noreferrer\" target=\"_blank\">JAMA Internal Medicine</a> </em>in May, researchers found that the inaccurate measurements resulted in a “systemic failure,” delaying care for many Black and Hispanic patients, and in some cases, preventing them from receiving proper medications. The study adds a growing sense of urgency to an issue raised decades ago. </p><p class=\"pull-quote\">“We found that in Black and Hispanic patients, there was a significant delay in identifying severe COVID compared to white patients.”<br/>—Dr. Ashraf Fawzy, Johns Hopkins University</p><p><a href=\"https://spectrum.ieee.org/should-you-trust-apples-new-blood-oxygen-sensor\" target=\"_self\">Pulse oximeters</a> work by passing light through part of the body, usually a finger. These devices infer a patient's blood-oxygen saturation (that is, the percentage of hemoglobin carrying oxygen) from the absorption of light by <a href=\"https://www.mountsinai.org/health-library/tests/hemoglobin#:~:text=Hemoglobin%20is%20a%20protein%20in,is%20exchanged%20for%20carbon%20dioxide.\" target=\"_blank\">hemoglobin</a>, the pigment in blood that carries oxygen. In theory, pulse oximeters shouldn’t be affected by anything other than the levels of oxygen in the blood. But research has shown otherwise. </p><p>“If you have melanin, which is the pigment that's responsible for skin color…that could potentially affect the transmittance of the light going through the skin,” said <a href=\"https://cbee.umbc.edu/govind-rao/\" rel=\"noopener noreferrer\" target=\"_blank\">Govind Rao</a>, a professor of engineering and director of the Center for Advanced Sensor Technology at the University of Maryland, Baltimore County, who was not involved in the study. </p><p>To examine how patients with COVID-19 were affected by this flaw in pulse oximeters, researchers used data from over 7,000 COVID-19 patients in the <a href=\"https://www.hopkinsmedicine.org/about/johnshopkins-health-system-corp.html\" target=\"_blank\">Johns Hopkins hospital system</a>, which includes five hospitals, between March 2020 and November 2021. In the first part of the study, researchers compared blood-oxygen saturation for the 1,216 patients who had measurements taken using both a pulse oximeter and arterial blood-gas analysis, which determines the same measure using a direct analysis of blood. The researchers found that the pulse oximeter overestimated blood-oxygen saturation by an average of 1.7 percent for Asian patients, 1.2 percent for Black patients, and 1.1 percent for Hispanic patients. </p><p>Then, the researchers used these results to create a statistical model to estimate what the arterial blood-gas measurements would be for patients with only pulse-oximeter measurements. Because arterial blood gas requires a needle to be inserted into an artery to collect the blood, most patients only have a pulse-oximeter measurement. </p><p>To qualify for COVID-19 treatment with <a href=\"https://www.covid19treatmentguidelines.nih.gov/therapies/antiviral-therapy/remdesivir/\" target=\"_blank\">remdesivir</a>, an antiviral drug, and <a href=\"https://medlineplus.gov/druginfo/meds/a682792.html\" target=\"_blank\">dexamethasone</a>, a steroid, patients had to have a blood-oxygen saturation of 94 percent or less. Based on the researchers’ model, nearly 30 percent of the 6,673 patients about whom they had enough information to predict their arterial blood-gas measurements met this cutoff. Many of these patients, most of whom were Black or Hispanic, had their treatment delayed for between 5 and 7 hours, with Black patients being delayed on average 1 hour more than white patients. </p><p>“We found that in Black and Hispanic patients, there was a significant delay in identifying severe COVID compared to white patients,” said Dr. <a href=\"https://www.hopkinsmedicine.org/profiles/details/ashraf-fawzy\" rel=\"noopener noreferrer\" target=\"_blank\">Ashraf Fawzy</a>, assistant professor of medicine at Johns Hopkins University and an author of the study. </p><p>There were 451 patients who never qualified for treatments but that the researchers predicted likely should have; 55 percent were Black, while 27 percent were Hispanic. </p><p>The study “shows how urgent it is to move away from pulse [oximeters],” said Rao, and to find alternatives ways of measuring blood-oxygen saturation. </p><p>Studies finding that skin color can affect pulse oximeters go back <a href=\"https://scholar.google.com/scholar?q=pulse+oximeter+racial+bias&hl=en&as_sdt=0%2C22&as_ylo=1970&as_yhi=1990\" target=\"_blank\">as far as the 1980s</a>. Despite knowledge of the issue, there are few ways of addressing it. Wu says increasing awareness helps, and that it also may be helpful to do more arterial blood-gas analyses.</p><p>A long-term solution will require changing the technology, either by using a different method entirely or having devices that can better adjust results to account for differences in skin color. One technological alternative is having devices that measure oxygen diffusing across the skin, called transdermal measurement, which Rao’s lab is working on developing. </p><p>The researchers said one limitation of their study involved the way patients race was self-identified—meaning a wide range of skin pigmentation could be represented in each of the sample groups, depending on how each patient self-identified. The researchers also did not measure how delaying or denying treatment affected the patients clinically, for instance how likely they were to die, how sick they were, or how long they were sick. The researchers are currently working on a study examining these additional questions and factors. </p><p>Although the problem of the racial bias of pulse oximeters has no immediate solution, said the researchers, they are confident the primary hurdle is not technological. </p><p>“We do believe that technology exists to fix this problem, and that would ultimately be the most equitable solution for everybody,” said Wu. </p>",
  "pubDate": "Fri, 24 Jun 2022 13:00:01 +0000",
  "guid": "https://spectrum.ieee.org/pulse-oximeters-encode-racial-bias-with-clear-consequences-for-covid-19-patients",
  "category": [
    "Bias",
    "Racial diversity",
    "Pulse oximetry",
    "Product design",
    "Medical technology"
  ],
  "dc:creator": "Rebecca Sohn",
  "media:content": ""
}