{
  "title": "Russian arms and influence in Myanmar",
  "link": "https://www.eastasiaforum.org/2022/11/05/russian-arms-and-influence-in-myanmar/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=russian-arms-and-influence-in-myanmar",
  "comments": "https://www.eastasiaforum.org/2022/11/05/russian-arms-and-influence-in-myanmar/#respond",
  "dc:creator": "Narayanan Ganesan",
  "pubDate": "Sat, 05 Nov 2022 11:00:53 +0000",
  "category": [
    "International Relations",
    "Military",
    "Myanmar",
    "Russia",
    "ASEAN",
    "China",
    "China Myanmar border",
    "ethnic armed groups Myanmar",
    "ethnic conflict Myanmar",
    "military aid Myanmar",
    "moscow",
    "Myanmar junta",
    "Myanmar–Russia relations",
    "Russian fighter aircraft",
    "Russian military equipment",
    "sanctioned states",
    "sanctions",
    "sanctions on Russia",
    "Southeast Asia",
    "United States"
  ],
  "guid": "https://www.eastasiaforum.org/?p=1316910",
  "description": "<p>Author: Narayanan Ganesan, Hiroshima City University Myanmar’s coup leader and de facto head of state, General Min Aung Hlaing, has paid two visits to Russia in 2022. Such visits are the culmination of bilateral ties that have grown since 2014. Relations between Myanmar and Russia are military-focussed. Myanmar has long relied on Russia for the [&#8230;]</p>\nThe post <a href=\"https://www.eastasiaforum.org/2022/11/05/russian-arms-and-influence-in-myanmar/\">Russian arms and influence in Myanmar</a> first appeared on <a href=\"https://www.eastasiaforum.org\">East Asia Forum</a>.",
  "content:encoded": "<p>Author: Narayanan Ganesan, Hiroshima City University</p>\n<p>Myanmar’s coup leader and de facto head of state, General Min Aung Hlaing, has paid two visits to Russia in 2022. Such visits are the culmination of <a href=\"https://www.crisisgroup.org/asia/south-east-asia/myanmar-russia-internal/coming-terms-myanmars-russia-embrace\" target=\"_blank\" rel=\"noopener noreferrer\">bilateral ties</a> that have grown since 2014.</p>\n<p><span id=\"more-1316910\"></span><img class=\"aligncenter wp-image-1316917 size-medium\" title=\"Russian President Vladimir Putin shakes hands with Myanmar's Prime Minister Min Aung Hlaing during a meeting on the sidelines of the 2022 Eastern Economic Forum (EEF) in Vladivostok, Russia, 7 September, 2022 (Photo: Sputnik/Valeriy Sharifulin/Pool via Reuters).\" src=\"https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-09-07T061557Z_1721150813_RC24CW9N4Z3G_RTRMADP_3_RUSSIA-MYANMAR-PUTIN-HLAING-400x256.jpg\" alt=\"Russian President Vladimir Putin shakes hands with Myanmar's Prime Minister Min Aung Hlaing during a meeting on the sidelines of the 2022 Eastern Economic Forum (EEF) in Vladivostok, Russia, 7 September, 2022 (Photo: Sputnik/Valeriy Sharifulin/Pool via Reuters).\" width=\"400\" height=\"256\" srcset=\"https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-09-07T061557Z_1721150813_RC24CW9N4Z3G_RTRMADP_3_RUSSIA-MYANMAR-PUTIN-HLAING-400x256.jpg 400w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-09-07T061557Z_1721150813_RC24CW9N4Z3G_RTRMADP_3_RUSSIA-MYANMAR-PUTIN-HLAING-600x384.jpg 600w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-09-07T061557Z_1721150813_RC24CW9N4Z3G_RTRMADP_3_RUSSIA-MYANMAR-PUTIN-HLAING-150x96.jpg 150w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-09-07T061557Z_1721150813_RC24CW9N4Z3G_RTRMADP_3_RUSSIA-MYANMAR-PUTIN-HLAING-768x491.jpg 768w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-09-07T061557Z_1721150813_RC24CW9N4Z3G_RTRMADP_3_RUSSIA-MYANMAR-PUTIN-HLAING-1536x983.jpg 1536w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-09-07T061557Z_1721150813_RC24CW9N4Z3G_RTRMADP_3_RUSSIA-MYANMAR-PUTIN-HLAING-scaled.jpg 2048w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-09-07T061557Z_1721150813_RC24CW9N4Z3G_RTRMADP_3_RUSSIA-MYANMAR-PUTIN-HLAING-300x192.jpg 300w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-09-07T061557Z_1721150813_RC24CW9N4Z3G_RTRMADP_3_RUSSIA-MYANMAR-PUTIN-HLAING-100x64.jpg 100w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-09-07T061557Z_1721150813_RC24CW9N4Z3G_RTRMADP_3_RUSSIA-MYANMAR-PUTIN-HLAING-500x320.jpg 500w\" sizes=\"(max-width: 400px) 100vw, 400px\" /></p>\n<p>Relations between Myanmar and Russia are military-focussed. Myanmar has long relied on Russia for the postgraduate training of its military officers, especially those in the air force. While China has proved to be a great power ally at times when Myanmar was subject to widespread international sanctions, which have been imposed intermittently and to varying degrees since 1962, better ties with Russia afford the military junta the opportunity to interact with international leaders and gain international recognition.</p>\n<p>Ties with Moscow also allow the military to diversify weapon procurements away from China, its traditional provider of developmental aid and weaponry. The military is suspicious of China’s support for the Wa, Kokang and Kachin ethnic armed groups, which control large swathes of territory along the lengthy China–Myanmar border.</p>\n<p>Myanmar has come to rely on Russian fighter aircraft, helicopters and air defence systems to <a href=\"https://www.eastasiaforum.org/2022/09/29/myanmars-civil-war-meanders-onward/\" target=\"_blank\" rel=\"noopener noreferrer\">engage</a> ethnic armed groups that have intensified attacks against the military. The Kachin, Karen and Karenni ethnic armed groups have similarly trained and fought alongside the Peoples’ Defence Forces (PDF) — the armed wing of the National Unity Government. Russian fighter aircraft and helicopters, regarded as superior to Chinese alternatives, have been regularly used in unfavourable fighting conditions.</p>\n<p>It is not uncommon for sanctioned regimes to help each other advance their common development and security interests. North Korea and Iran, subject to a range of sanctions, have done this historically. Russia and China, Myanmar’s security and economic patrons, are threatened by Washington and Western countries. Despite their rivalry from 1970–1990, they enjoy a more productive bilateral relationship. Russia maintains cordial relations with India and Vietnam, its partners during the Cold War.</p>\n<p>Sanctioned regimes with convergent interests can bypass the deleterious effects of sanctions by sourcing developmental and other needs from isolated regimes. But forming a coalition of sanction-abiding states to enhance the enforcement of sanctions risks alienating countries unaligned with the United States and the European Union. That limits the type of economic responses available to the international community.</p>\n<p>Sanctions against Myanmar are complicated by China’s good relationship with Russia, Myanmar and North Korea. The attempted isolation of China by the United States and Europe would be difficult since many Asian countries have strong trade relations and shared development interests with Beijing.</p>\n<p>ASEAN has been very critical of the military coup in Myanmar and has isolated the military regime by excluding its officials from ministerial meetings. ASEAN’s collective position against the Myanmar coup has strong support from Indonesia, Malaysia, the Philippines and Singapore. Member countries have also reduced trade and investment in Myanmar. But the Indonesia-inspired <a href=\"https://asean.org/tag/five-point-consensus/\" target=\"_blank\" rel=\"noopener noreferrer\">Five Point Consensus plan</a>, crafted in April 2021 to contain political violence and return Myanmar to a modicum of normalcy, was <a href=\"https://www.irrawaddy.com/news/burma/myanmar-junta-slams-malaysias-call-for-asean-to-engage-shadow-govt.html\" target=\"_blank\" rel=\"noopener noreferrer\">rebuffed by the military junta</a>.</p>\n<p>Cambodian Prime Minister Hun Sen’s attempts to engage the Myanmar regime as <a href=\"https://www.eastasiaforum.org/2022/01/18/prospects-for-cambodias-chairing-of-asean-in-2022/\" target=\"_blank\" rel=\"noopener noreferrer\">ASEAN Chair</a> have come to nought and Indonesia looks set to support the status quo when it assumes the ASEAN Chair. The United Nations Secretary General’s Special Envoy, Noeleen Heyzer, has been equally unsuccessful in her attempts to engage all parties, including former state counsellor Aung San Suu Kyi.</p>\n<p>Malaysia is the most strident critic of Myanmar, openly dealing with the parallel National Unity Government. But ASEAN has little leverage over Myanmar’s policies towards Russia. Singapore was labelled unfriendly by Russia when it openly criticised its war in Ukraine, Indonesia continues to maintain cordial ties with Moscow and Malaysia purchased a Russian aircraft in August 2022.</p>\n<p>China and Russia can collectively assist Myanmar with continued developmental, infrastructural and military aid to help offset the effects of international sanctions. That means ASEAN can do little to stop Myanmar–Russia ties from growing, even if their relationship bodes ill for Southeast Asia.</p>\n<p><em>Narayanan Ganesan is a Professor at the Hiroshima Peace Institute, Hiroshima City University.</em></p>The post <a href=\"https://www.eastasiaforum.org/2022/11/05/russian-arms-and-influence-in-myanmar/\">Russian arms and influence in Myanmar</a> first appeared on <a href=\"https://www.eastasiaforum.org\">East Asia Forum</a>.",
  "wfw:commentRss": "https://www.eastasiaforum.org/2022/11/05/russian-arms-and-influence-in-myanmar/feed/",
  "slash:comments": 0,
  "post-id": 1316910
}