{
  "id": "yt:video:YKGb_BJellA",
  "yt:videoId": "YKGb_BJellA",
  "yt:channelId": "UCAsLjyYl9GW66G1mpMzr8IA",
  "title": "I Lost Weight So I Could Prove Them Wrong",
  "link": "",
  "author": {
    "name": "MinuteVideos",
    "uri": "https://www.youtube.com/channel/UCAsLjyYl9GW66G1mpMzr8IA"
  },
  "published": "2021-06-08T13:00:10+00:00",
  "updated": "2022-05-21T02:26:30+00:00",
  "media:group": {
    "media:title": "I Lost Weight So I Could Prove Them Wrong",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "'I was diagnosed with Anorexia and couldn't believe it. I knew my condition was serious when I could no longer feed myself as I had to be fed through tubes. I was in the hospital for weeks. There was no other option than to drop out of school and my mom even had to quit her job to take care of me.\n\nI learned how little value other peoples opinions have. The most important things are the love you have from friends and family but even more important than that is the love you should have for yourself. I am me. I am beautiful in my own way and I don't feel the need to have to follow society and trends about being skinny. Why do I need people who only love me for how I look? It's been a long journey getting here, I really hope that my story can help to warn people that are about to fall into the same trap.'\n\nWe chose this story because we want to encourage people to speak up if something similar has happened to them and to seek help if they're still in such a situation. We hope this video will encourage people to feel empathy and compassion for those who have gone through such experiences. And we hope that it will encourage us all to do what we can to prevent these things from happening. Even if it does happen we want to encourage people to speak up for their own safety\n\nSubmit your story at: https://community02.com/story/new\nLike us on Facebook: https://www.facebook.com/minutevideos.productions\nFollow us on Instagram: http://www.instagram.com/minutevideosdotcom\nSupport us on Patreon: https://www.patreon.com/minutevideos\n\n#influencer #instagrammodel #anorexia",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}