{
  "title": "The Ultrarich's dirty secret: not paying taxes",
  "link": "",
  "published": "2019-01-07T00:00:00-08:00",
  "updated": "2019-01-07T00:00:00-08:00",
  "author": {
    "name": "Wes McKinney"
  },
  "id": "tag:wesmckinney.com,2019-01-07:/blog/thoughts-on-taxes/",
  "summary": "<p>The tax situation in the United States is pretty messed up.</p>\n<p>Much ado has been made over the last week about <a href=\"https://twitter.com/aoc\">AOC</a> suggesting bringing back\nthe pre-Reagan era 70% marginal tax rate on regular income over\n$10,000,000. This means that if you made $12 million in normal income …</p>",
  "content": "<p>The tax situation in the United States is pretty messed up.</p>\n<p>Much ado has been made over the last week about <a href=\"https://twitter.com/aoc\">AOC</a> suggesting bringing back\nthe pre-Reagan era 70% marginal tax rate on regular income over\n$10,000,000. This means that if you made $12 million in normal income in a\nsingle year, you would pay 70% of the last $2 million to the federal\ngovernment.</p>\n<p>At the same time, the American taxpayer still hasn't seen Donald J. Trump's tax\nreturns. There has been speculation about why they have not been made public. I\nam pretty sure I know the reason: people would be disturbed not only how little\ntaxes he is paying, but also how low his adjusted gross income (AGI) is. In\nother words, I would guess that Trump is holding a lot of his wealth in\noffshore accounts, outside of the grasp of the IRS.</p>\n<p>Since I graduated from college in 2007, I have had a small window into the\nfinancial lives of very wealthy people, from hedge fund managers to Silicon\nValley millionaires and billionaires. At the same time, many people I know\n(myself included, depending on the year) have joined the ranks of the High\nEarning, Not Rich Yet (HENRY) class of working Americans. This has given me\nsome perspective on our current tax policy, which to me seems in many ways to\nbe grossly unfair to people who depend on a regular job for their livelihood.</p>\n<p>While I am no economist, just a lowly computer programmer, I will dig into\nthese topics to offer my perspective and experience.</p>\n<h2>Capital gains rate: does it still make sense?</h2>\n<p>Generally speaking, people in the United States make two different kinds of\nincome: normal income and capital gains. \"Normal income\" is the kind that you\nmake as a full time employee (reported on a W-2 form) or an independent\ncontractor (reported on a 1099 form). \"Capital gains\" is profit from\ninvestments or proceeds from assets bought and sold, like stocks or real\nestate.</p>\n<p>Personally, most of the income I make is from normal employment, followed by\nbook royalties from \"Python for Data Analysis\" which are recognized as 1099\nindependent contractor income. Depending on the year, I may make some\ninvestment income, but as a non-millionaire, it is a relatively small amount of\nmoney.</p>\n<p>The thing about capital gains versus normal income is that the marginal tax\nrate on capital gains is much lower. Short term capital gains (e.g. money that\nyou made from day trading stocks or options) is treated like normal income, so\nlet's consider Long Term Capital Gains (LTCG): profit made on assets held for\none year or more. The LTCG tax rate for 2018 is either 15% or 20% depending on\nwhether your total income (adjusted gross income, or AGI) is more or less than\nabout $400,000, i.e. whether or not you are a member of the \"1%\" of earners in\nthe US.</p>\n<p>By contrast, normal income tax rates top out at 37% on income made over\n$500,000. Income between $38,701 and $82,500 is taxed at 22%, which is already\nhigher than the LTCG rate. Additionally, depending on where you live, such\nincome may be subjected to additional state and local taxes. If you live in New\nYork City, these state and local taxes can add up to about an additional\n10%. This can mean paying nearly 50% of income marginally in various forms of\ntaxes.</p>\n<p>In many cases, the wealthier someone is, the higher the fraction of their\nincome is capital gains. They may not make any normal income at all, simply\n\"living off their wealth\". Many people consider this \"not having to work to\nlive\" to be the definition of being rich or wealthy. I've heard friends talk\nabout what their \"number\" is (how much money they need to have in the bank)\nwhere they feel like they don't have to work anymore.</p>\n<p>What is disturbing to me about the capital gains tax rate is that if you\ncompare two people who respectively make $250,000 per year and $5 million per\nyear, the person making $5 million per year may well be paying a lot lower net\ntax rate on their earnings. Why, as you become increasingly wealthy, should\nyour tax rate <em>go down</em>?</p>\n<p>The reason for the low LTCG tax rate, of course, is to \"incentivize\ninvestment\". I can understand the original rationale for this, but the way that\nthe tax code has evolved has subverted much of the original intent. The wide\ndisparity in tax rate between normal income and LTCG has created an enormous\nincentive for the uberwealthy to structure their income to pass through various\n\"loop holes\" in the tax code to be recognized as capital gains. As one famous\nexample, hedge fund managers for years have been passing their performance and\nmanagement fees through the \"carried interest\" loop hole, so that even if a\nfund manager makes $100 million in fees in a single year, they will only pay\n20% in taxes.</p>\n<p>Personally, I think super rich people paying only 20% tax rate, regardless of\nhow they made the money, is ridiculously unfair to all of the Americans who\nwork full-time to make ends meet, many of whom are paying a higher tax rate. If\nI were in charge of the tax code, I would tax capital gains for high income\nindividuals at normal income tax rates or close to it.</p>\n<p>The problems don't stop at the capital gains tax rate, so let's move on to the\nnext important topic.</p>\n<h2>Next level rich: paying no taxes</h2>\n<p>As far as I can tell, many people with extremely high net worth (over $100\nmillion) are concerned with two things:</p>\n<ul>\n<li>Not paying taxes</li>\n<li>Passing on their wealth to their children tax-free when they die</li>\n</ul>\n<p>This last topic has been a frequently bone of contention in American politics:\non death, estates are generally subjected to taxation (known as the \"estate\ntax\" or also the \"death tax\" by some opponents). One argument frequently cited\nby opponents is that this money has \"already been taxed\", so taxation on\ntransfer to children is effectively \"double taxation\". Whatever.</p>\n<p>The desire of the ultrawealthy to avoid taxes has spawned an\nindustry of \"estate planners\" and attorneys who assist in various tax avoidance\nschemes. Without getting too much into the details, let's look at some\nprinciple use cases to understand how this works.</p>\n<p>If you are extremely wealthy, the biggest expenses in your life may be the\nfollowing:</p>\n<ul>\n<li>Real estate</li>\n<li>Cars</li>\n<li>Private aviation (including private jet ownership)</li>\n</ul>\n<p>The big question is: why would you \"patriate\" income in the United States to\npay for these things if you don't have to? For a lot of super rich people,\nsignificant capital gains are generated from international business activity\nand held in offshore bank accounts, typically in \"tax havens\" like the Cayman\nIslands. Why transfer money to your US accounts and pay taxes if you can have a\nshell company in the Cayman Islands pay for your private jet expenses and buy\nand hold your real estate?</p>\n<p>Outside of providing a tax-free way to pay for one's lifestyle, tax havens\nserve an additional purpose: avoiding the inheritance tax on death. The\nchildren of the super rich are likely to continue living a similar kind of\nlifestyle, and they will keep working with the same tax attorneys and estate\nplanners who helped their parents avoid taxes in the first place.</p>\n<p>This brings us back to Donald Trump. A <a href=\"https://www.nytimes.com/interactive/2018/10/02/us/politics/donald-trump-tax-schemes-fred-trump.html\">recent New York Times investigation</a>\nalleged that Trump's father, Fred Trump, engaged in various schemes to transfer\nhundreds of millions of dollars in wealth to his children without paying\ntaxes. Why would the son (Donald) be any less of a tax cheat? What difference\ndoes it make to his children if their wealth is held in the Cayman Islands or\nin the United States? This, I think, is the real reason why we'll never see\nTrump's tax returns. It would raise too many questions about where income is\ngenerated and where it is held.</p>\n<h2>Summary</h2>\n<p>The unfortunate part of all of this is that there is little that the United\nStates government can do to address the problems with tax havens and the\nultrarich.</p>\n<p>Outside of this though, very rich people really ought to be paying a lot more\ntaxes income earned in the United States. To me, the most fair thing seems to\nbe:</p>\n<ul>\n<li>A much higher marginal tax rate on income in excess of $1 million</li>\n<li>A much higher long term capital gains rate for high earners, if not equal to\n  the normal income tax rate</li>\n</ul>\n<p>I recognize that neither of these things is likely to happen in the current\npolitical climate, but it is important for more people to believe that these\nideas are neither radical nor unreasonable. Even if the above proposals are\nimplemented, rich people are still going to \"cheat the system\" in some ways,\npaying far less than their share of taxes.</p>\n<p>As a working professional, I am happy to do my part to fund the government, and\nI am okay with my tax rate staying the same or increasing. I think everyone\nelse, including very rich people, should do the same.</p>"
}