{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-3069080608786776078",
  "published": "2022-09-21T10:42:00.000-05:00",
  "updated": "2022-09-21T10:42:02.719-05:00",
  "category": [
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  "title": "Gramm, Early and the Unfixable Problem",
  "content": "<p>Phil Gramm and John Early have a <a href=\"https://www.wsj.com/articles/child-poverty-data-are-missing-something-refundable-tax-credit-tranfser-payments-census-estimates-household-income-11663689293\" target=\"_blank\">new WSJ oped,</a> based on their smashing <a href=\"https://www.amazon.com/Myth-American-Inequality-Government-Biases/dp/1538167387\" target=\"_blank\">new book</a>. Both are based on an astounding fact: <i>The numbers used by the Census Bureau, and countless following researchers, to define income inequality and poverty do not include taxes, which reduce income of the rich, and transfers, which increase income of the poor.</i> The latter, obviously, matters to just how many Americans fall in the Census Bureau's definition of poverty.</p><p>Specifically, in the oped, the new refundable tax credit cannot, by arithmetic, do anything to alleviate measured child poverty because&nbsp;</p><blockquote><p>\"the income numbers used to calculate the official poverty rates don’t count refundable tax credits as income to the recipients. \"</p></blockquote><p>This is wonderful for advocates of ever larger transfer programs, as it creates a problem that can never be measured to be fixed!&nbsp;</p><p>The more general issue&nbsp;</p><blockquote><p>The Census Bureau fails to count two-thirds of all government transfer payments to households in the income numbers it uses to calculate not only poverty levels but also income inequality and income growth. In addition to not counting refundable tax credits, which are paid by checks from the U.S. Treasury, the official Census Bureau measure doesn’t count food stamps, Medicaid, the Children’s Health Insurance Program, rent subsidies, energy subsidies and health-insurance subsidies under the Affordable Care Act. In total, benefits provided in more than 100 other federal, state and local transfer payments aren’t counted by the Census Bureau as income to the recipients</p></blockquote><p>The book goes on to show how this startling omission overturns just about everything you've heard from the hyperventilating classes about income inequality. Granted, spending zillions on rotten health insurance that people value much less than a dollar per dollar is not quite the same as cash, but there are lots of cash or cash equivalent transfers in there.&nbsp;</p><p>A question I do not know the answer to: Do means-tested programs count as \"income\" the transfers from other means-tested programs? If a program is only available to, say, those with less than $50,000 per year income, does that figure include any other means-tested programs? &nbsp;Even the ones that send cash, rather than in-kind transfers such as rent, energy, and health insurance subsidies? I suspect largely no. If not, the incentives for means-tested programs are far worse than even they appear. Facts welcome.</p><p>One might easily respond that ok, but evil capitalism created wider pre-tax pre-transfer inequality, and only by the grace of larger and larger transfers has some measure of stability been restored. Well, which is the cause and which is the effect -- wider pre-tax pre-transfer inequality, or the large expansion of means-tested programs, all of which add to the stupendous marginal tax rates facing Americans with less opportunity? The book goes on to argue convincingly the latter. I'll cover that later. Noting here, they anticipate the argument.&nbsp;</p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 22
}