{
  "title": "Influences of mass transfer stability criterion on double white dwarf populations. (arXiv:2211.01861v1 [astro-ph.SR])",
  "link": "http://arxiv.org/abs/2211.01861",
  "description": "<p>Mass transfer stability is an essential issue in binary evolution. Ge et al.\nstudied critical mass ratios for dynamically stable mass transfer by\nestablishing adiabatic mass loss model and found that the donor stars on the\ngiant branches tend to be more stable than that based on the composite\npolytropic stellar model. We would investigate the influence of mass transfer\nstability on the formation and properties of DWD populations. We performed a\nseries of binary population synthesis, where the critical mass ratios from\nadiabatic mass loss model (Ge's model) and that from the composite polytropic\nmodel are adopted, respectively. For Ge's model, most of the DWDs are produced\nfrom the stable non-conservative Roche lobe overflow plus common envelope (CE)\nejection channel (RL+CE channel) regardless of the CE ejection efficiency\n$\\alpha_{CE}$. While the results of the polytropic model strongly depend on the\nadopted value of $\\alpha_{ CE}$. We find DWDs produced from the RL+CE channel\nhave comparable WD masses and the mass ratio distribution peaks at around 1.\nBased on the magnitude-limited sample of DWDs, the space densities for the\ndetectable DWDs and those with extremely low-mass WD (ELM WD) companions in\nGe's model is $1347$ and $473 kpc^{-3}$, respectively, close to observations.\nWhile the polytropic model overpredicts space density of DWDs by a factor of\nabout $2-3$. We also find that the results of DWD merger rate distribution in\nGe's model reproduce the observations better than that of the polytropic model,\nand the merger rate of DWDs with ELM WD companions in the Galaxy is about\n$1.8\\times 10^{-3} yr^{-1}$ in Ge's model, which is comparable to the\nobservation estimation. We confirm that the mass transfer stability plays\nimportant roles in the formation and properties of DWD populations, and then in\nthe progenitors of SNe Ia and detectable GW sources.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+LI_Z/0/1/0/all/0/1\">Zhenwei LI</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Chen_X/0/1/0/all/0/1\">Xuefei Chen</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Ge_H/0/1/0/all/0/1\">Hongwei Ge</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Chen_H/0/1/0/all/0/1\">Hai-Liang Chen</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Han_Z/0/1/0/all/0/1\">Zhanwen Han</a>"
}