{
  "title": "Sonya Holowell (Artist Profile)",
  "itunes:author": "Liquid Architecture",
  "itunes:subtitle": "Artist Profile",
  "itunes:summary": "Close collaborator, writer and experimental musician James Hazel unfurls the complex weavings of Holowell's nuanced approach to vocal composition and improvisation in Dancing on The Margins: The Manifold, Minor Voci of Sonya Holowell published on Disclaimer.\n\nhttps://disclaimer.org.au/contents/dancing-on-the-margins-the-manifold-minor-voci-of-sonya-holowell\n\nOn the podcast Sonya Holowell talks through how her voice as the instrument anchors her body through multidisciplinary practice; the freedom improvisation contains in allowing mistakes to further creativity; and the use and dis-use of scores and notation.\n\nImage: Sam Provost\nMusic: Sumn Conduit performing at the Blake Poetry Prize, Casula Powerhouse. \n\nUsing the poems, notes and inspirations:\nEverything Must Go - Meredith Wattison\nRogue Objects - Gershon Maller\nPencils from Heaven - Kirsten Krauth\n...And Since Then I Didn’t Grow Anything There - Monica Rani Rudhar\nTrigon - Szymon Dorabialski\n\nProduced by Mara Schwerdtfeger. \n\nhttps://www.patreon.com/liquidarchitecture\n\nFinancial support from patrons at any level has a resounding impact on our work. You can support Liquid Architecture’s weekly podcast and our online journal Disclaimer, for new thinking and writing on listening and sound through a Patreon subscription, for as little as $5 a month. \n\nhttps://liquidarchitecture.org.au/\n\nFor the past 20 years, Liquid Architecture has been Australia’s leading organisation for artists working with sound and listening. LA investigates the sounds themselves, but also the ideas communicated about, and the meaning of, sound and listening.",
  "itunes:image": "",
  "enclosure": "",
  "guid": "https://liquidarchitecture.org.au/podcast/sonya-holowell-artist-profile",
  "pubDate": "Tue, 23 Aug 2022 08:00:00 +1000",
  "itunes:duration": "23:49",
  "itunes:explicit": "no"
}