{
  "title": "6 ways SMEs in Singapore can pay attention to organic reach",
  "link": "https://e27.co/6-ways-smes-in-singapore-can-pay-attention-to-organic-reach-20220508/",
  "dc:creator": "Hemant Doshi",
  "pubDate": "Fri, 04 Nov 2022 04:00:50 +0000",
  "category": [
    "Community",
    "SaaS",
    "Singapore",
    "Social Enterprise",
    "Metigy"
  ],
  "guid": "https://e27.co/?p=459231",
  "description": "<p>The onset of the pandemic blindsided many businesses in Singapore and inadvertently placed social media at the heart of a company’s outreach strategy. It no longer became an option to have a social media presence. It was the place to see and be seen, helping brands to remain relevant and continue to engage better with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/6-ways-smes-in-singapore-can-pay-attention-to-organic-reach-20220508/\">6 ways SMEs in Singapore can pay attention to organic reach</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<img loading=\"lazy\" class=\"aligncenter wp-image-459306 size-full\" src=\"https://e27.co/wp-content/uploads/2022/05/e27-51.png\" alt=\"\" width=\"690\" height=\"390\" />\n<p><span style=\"font-weight: 400;\">The onset of the pandemic blindsided many businesses in Singapore and inadvertently placed social media at the heart of a company’s outreach strategy. It no longer became an option to have a social media presence. It was the place to see and be seen, helping brands to remain relevant and continue to engage better with their audiences.</span></p>\n<p><span style=\"font-weight: 400;\">In Singapore, there were 4.7 million social media users in 2020 (out of a total population of almost six million people), and </span><a rel=\"follow\" href=\"https://www.statista.com/statistics/975069/internet-penetration-rate-in-singapore/\"><span style=\"font-weight: 400;\">close to 90 per cent of the population </span></a><span style=\"font-weight: 400;\">used the internet. This number is expected to grow more than 93 per cent by 2025, according to Statista, showing no signs of the digital network slowing down in the Lion City.  </span></p>\n<p><span style=\"font-weight: 400;\">Most brands <a rel=\"follow\" href=\"https://e27.co/social-media-marketing-for-small-business-owners-20190815/\">jumped onto the social media bandwagon to ensure survivability</a>, making the space crowded and noisy and easy for a company’s reach to be hampered. What’s more is today’s audience is constantly distracted and interrupted, with customer attention spans drastically dropping. </span></p>\n<p><span style=\"font-weight: 400;\">Despite these setbacks, businesses can still organically reach and engage with communities to navigate business growth through the web, successfully. What does it take to do that?</span></p>\n<h1>What is organic reach?</h1>\n<p><span style=\"font-weight: 400;\">Organic reach is a social media marketing metric measuring the number of unique accounts that have seen a post on a social media platform.  In short, it measures how many people have seen the post once.</span></p>\n<p><span style=\"font-weight: 400;\">Most importantly, organic reach excludes any reach resulting from paid promotion, and it specifically measures the natural or ‘organic’ reach of the post.</span></p>\n<p><span style=\"font-weight: 400;\">Sometimes paid promotions and ad boosts are not accessible to all, leaving businesses wondering what they can do to increase their organic reach and make sure they are interacting with the right audience. </span></p>\n<p>Here are six ways businesses can increase organic reach:</p>\n<h2><strong>Eyeing the prize</strong></h2>\n<p><span style=\"font-weight: 400;\">The golden rule for businesses to engage better is to concentrate their efforts on a few platforms core to their business, as opposed to sharing content across multiple social media channels in the name of &#8216;spreading the word&#8217;.  </span></p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/5-video-marketing-trends-that-marketers-can-leverage-in-2022-20220423/\">5 video marketing trends that marketers can leverage in 2022</a></strong></p>\n<p><span style=\"font-weight: 400;\">There are many factors to take into account when picking and choosing the right social media platform. Where is the audience spending most of their time? What is working for the brand’s competitors? These are questions businesses should be thinking about. </span></p>\n<p><span style=\"font-weight: 400;\">Also considering those different demographics spend different amounts of time across different platforms, while YouTube and WhatsApp are the most popular social media channels in Singapore, Facebook is currently losing interest in the eyes of the younger generation who are flocking to Instagram, TikTok and Snapchat. </span></p>\n<h2>Optimising social media platforms</h2>\n<p><span style=\"font-weight: 400;\">Social media algorithms, much like search engines, are designed to find pages matching a user’s criteria and deliver them in the feed. This implies that brands should optimise social media content in the same way as a website.</span></p>\n<p><span style=\"font-weight: 400;\">Brands want to be remembered, easy to find and give their customers a smooth experience to follow through on their journey with their business. Usernames have to be readable, short and easy to remember, and photos/logos need to be recognisable to the brand. </span></p>\n<p><span style=\"font-weight: 400;\">A professional-looking social media account is more likely to ensure customers engage with the brand online. The company’s ‘about’ section and website are also key to making customers follow through with the brand from the social media platform; they need to be keyword-rich and trackable.</span></p>\n<h2>Trendjacking as a way to boost marketing efforts</h2>\n<p><span style=\"font-weight: 400;\">I’ve talked about the noise already existing and cluttering the social media space. Trendjacking content provides useful information to a brand’s social media audience in a timely and relevant fashion, allowing the material to &#8216;work smarter&#8217; and increase interaction rates, while retaining good sentiment. Ultimately, this benefits the brand by improving awareness.</span></p>\n<p><span style=\"font-weight: 400;\">Showcasing the brand’s social listening skills helps them build better recall and will best serve the online community, placing trust in the brand’s ability to share with their audience only what is relevant to them.  </span></p>\n<p><span style=\"font-weight: 400;\">Noting down what trends to ride, along with choosing the right content format and platform, gives businesses the ability to move quickly on the opportunities that come their way. </span></p>\n<h2>Post evergreen content to social media channels</h2>\n<p><span style=\"font-weight: 400;\">Although audience attention spans are limited, it doesn’t mean brands should give up on evergreen content. Evergreen content will be relevant and discoverable to the brand’s audience indefinitely.  Popular hashtags are a good way to make sure material can be found again. </span></p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/airbnb-global-community-20211103/\">Former Airbnb marketing head on building a global community through international expansion</a></strong></p>\n<h2>Quality over quantity</h2>\n<p><span style=\"font-weight: 400;\">To break through the social chatter online, brands should focus on getting their posts tailored and relevant. At times, less is more. Posting quality and relevant content than worrying about frequency and volume of content will help improve engagement. </span></p>\n<h2>Target hours and social media spend</h2>\n<p><span style=\"font-weight: 400;\">A myth that still exists is that posting during peak online periods is the greatest play, but it means brands are also publishing content when everyone else is. When waiting till non-peak hours to post, businesses will have a better chance of being heard among the noise of other postings online. </span></p>\n<p><span style=\"font-weight: 400;\">Using an AI-powered marketing platform allows suggestions based on audience engagement so look into using tech that helps brands pinpoint the right time to post. It can also provide insights that allow brands to learn from the online interactions an audience is having with their content. </span></p>\n<p><span style=\"font-weight: 400;\">If a particular piece of content performs well organically, it will benefit from extra momentum created through ad spending and paid boosts, making the content work harder.</span></p>\n<p>&#8211;</p>\n<p>Editor’s note: <b >e27</b> aims to foster thought leadership by publishing views from the community. Share your opinion by <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://e27.co/contributor\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://e27.co/contributor\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">submitting</a> an article, video, podcast, or infographic</p>\n<p>Join our <b >e27</b> <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://t.me/joinchat/HmTbfBcGCZeykhM8NOlQ-g\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://t.me/joinchat/HmTbfBcGCZeykhM8NOlQ-g\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">Telegram group</a>, <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://www.facebook.com/groups/e27co/permalink/886904662065955/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.facebook.com/groups/e27co/permalink/886904662065955/\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">FB community</a>, or like the <b >e27</b> <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://www.facebook.com/e27/?ref=your_pages\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.facebook.com/e27/?ref=your_pages\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">Facebook page</a></p>\n<p>Image Credit: Canva Pro</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/6-ways-smes-in-singapore-can-pay-attention-to-organic-reach-20220508/\">6 ways SMEs in Singapore can pay attention to organic reach</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}