{
  "title": "Robust Few-shot Learning Without Using any Adversarial Samples. (arXiv:2211.01598v1 [cs.CV])",
  "link": "http://arxiv.org/abs/2211.01598",
  "description": "<p>The high cost of acquiring and annotating samples has made the `few-shot'\nlearning problem of prime importance. Existing works mainly focus on improving\nperformance on clean data and overlook robustness concerns on the data\nperturbed with adversarial noise. Recently, a few efforts have been made to\ncombine the few-shot problem with the robustness objective using sophisticated\nMeta-Learning techniques. These methods rely on the generation of adversarial\nsamples in every episode of training, which further adds a computational\nburden. To avoid such time-consuming and complicated procedures, we propose a\nsimple but effective alternative that does not require any adversarial samples.\nInspired by the cognitive decision-making process in humans, we enforce\nhigh-level feature matching between the base class data and their corresponding\nlow-frequency samples in the pretraining stage via self distillation. The model\nis then fine-tuned on the samples of novel classes where we additionally\nimprove the discriminability of low-frequency query set features via cosine\nsimilarity. On a 1-shot setting of the CIFAR-FS dataset, our method yields a\nmassive improvement of $60.55\\%$ &amp; $62.05\\%$ in adversarial accuracy on the PGD\nand state-of-the-art Auto Attack, respectively, with a minor drop in clean\naccuracy compared to the baseline. Moreover, our method only takes $1.69\\times$\nof the standard training time while being $\\approx$ $5\\times$ faster than\nstate-of-the-art adversarial meta-learning methods. The code is available at\nhttps://github.com/vcl-iisc/robust-few-shot-learning.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Nayak_G/0/1/0/all/0/1\">Gaurav Kumar Nayak</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Rawal_R/0/1/0/all/0/1\">Ruchit Rawal</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Khatri_I/0/1/0/all/0/1\">Inder Khatri</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chakraborty_A/0/1/0/all/0/1\">Anirban Chakraborty</a>"
}