{
  "title": "Phase Transitions in Learning and Earning under Price Protection Guarantee. (arXiv:2211.01798v1 [stat.ML])",
  "link": "http://arxiv.org/abs/2211.01798",
  "description": "<p>Motivated by the prevalence of ``price protection guarantee\", which allows a\ncustomer who purchased a product in the past to receive a refund from the\nseller during the so-called price protection period (typically defined as a\ncertain time window after the purchase date) in case the seller decides to\nlower the price, we study the impact of such policy on the design of online\nlearning algorithm for data-driven dynamic pricing with initially unknown\ncustomer demand. We consider a setting where a firm sells a product over a\nhorizon of $T$ time steps. For this setting, we characterize how the value of\n$M$, the length of price protection period, can affect the optimal regret of\nthe learning process. We show that the optimal regret is\n$\\tilde{\\Theta}(\\sqrt{T}+\\min\\{M,\\,T^{2/3}\\})$ by first establishing a\nfundamental impossible regime with novel regret lower bound instances. Then, we\npropose LEAP, a phased exploration type algorithm for \\underline{L}earning and\n\\underline{EA}rning under \\underline{P}rice Protection to match this lower\nbound up to logarithmic factors or even doubly logarithmic factors (when there\nare only two prices available to the seller). Our results reveal the surprising\nphase transitions of the optimal regret with respect to $M$. Specifically, when\n$M$ is not too large, the optimal regret has no major difference when compared\nto that of the classic setting with no price protection guarantee. We also show\nthat there exists an upper limit on how much the optimal regret can deteriorate\nwhen $M$ grows large. Finally, we conduct extensive numerical experiments to\nshow the benefit of LEAP over other heuristic methods for this problem.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/stat/1/au:+Feng_Q/0/1/0/all/0/1\">Qing Feng</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Zhu_R/0/1/0/all/0/1\">Ruihao Zhu</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Jasin_S/0/1/0/all/0/1\">Stefanus Jasin</a>"
}