{
  "title": "Episode 77: Lost at School - An Interview with Ross Green Part 2",
  "pubDate": "Mon, 03 Nov 2008 02:43:47 +0000",
  "guid": "episode-77-lost-at-school-an-interview-with-ros",
  "link": "http://www.thepsychfiles.com/2008/11/02/episode-77-lost-at-school-an-interview-with-ross-green-part-2/",
  "itunes:image": "",
  "description": "Still looking for an alternative to Time out?  If you are a teacher, a childcare worker, or anyone who works with kids and is frustrated at the fact that for some children time out just doesn't work.  In fact, for some kids time out may actually be a reward because of the popularity it may provide for them from other kids.  If you're worried that time out is not helping, and that the child is headed down a road of developing a personal identity that includes rebel or troublemaker and the end of that road can only be jail, then you need to listen to Dr. Ross Green talk about Collaborative Problem Solving.  We need to treat children different today and this approach holds a lot of insights into that new approach.",
  "content:encoded": "Still looking for an alternative to Time out?  If you are a teacher, a childcare worker, or anyone who works with kids and is frustrated at the fact that for some children time out just doesn't work.  In fact, for some kids time out may actually be a reward because of the popularity it may provide for them from other kids.  If you're worried that time out is not helping, and that the child is headed down a road of developing a personal identity that includes rebel or troublemaker and the end of that road can only be jail, then you need to listen to Dr. Ross Green talk about Collaborative Problem Solving.  We need to treat children different today and this approach holds a lot of insights into that new approach.",
  "enclosure": "",
  "itunes:duration": "32:57",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology",
  "itunes:subtitle": "Still looking for an alternative to Time out? If you are a teacher or a childcare worker and are frustrated at the fact that for some children time out just doesn't work. You need to listen to Dr. Ross Green talk about Collaborative Problem Solving.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Still looking for an alternative to Time out? If you are a teacher, a childcare worker, or anyone who works with kids and is frustrated at the fact that for some children time out just doesn't work. In fact, for some kids time out may actually be a reward because of the popularity it may provide for them from other kids. If you're worried that time out is not helping, and that the child is headed down a road of developing a personal identity that includes rebel or troublemaker and the end of that road can only be jail, then you need to listen to Dr. Ross Green talk about Collaborative Problem Solving. We need to treat children different today and this approach holds a lot of insights into that new approach."
}