{
  "id": "yt:video:LxoyaCSWFGs",
  "yt:videoId": "LxoyaCSWFGs",
  "yt:channelId": "UCRRr_xrOm66qaigIbwFLvbQ",
  "title": "The scariest climate science paper I've ever read?",
  "link": "",
  "author": {
    "name": "Simon Clark",
    "uri": "https://www.youtube.com/channel/UCRRr_xrOm66qaigIbwFLvbQ"
  },
  "published": "2022-09-19T12:00:11+00:00",
  "updated": "2022-09-25T11:05:16+00:00",
  "media:group": {
    "media:title": "The scariest climate science paper I've ever read?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Learn more about how the natural world works with Brilliant: https://www.brilliant.org/simonclark\n\nThis month a paper came out that honestly chilled me. It was about tipping points in climate - a well-known concept that the climate can change abruptly if certain conditions are met in certain elements of the climate system, such as excess melting of the Greenland ice sheet. That wasn't new. What was new was the threshold these tipping elements could flip - according to this research, we could be triggering some tipping elements already - and if we warm the planet by just 1.5°C then we are *likely* to do so.\n\nThe climate is still within our control. But if we keep emitting as we are, that isn't always going to be the case.\n\nEvery. Tenth. Of. A. Degree. Counts.\n\nReferences:\n1. https://journals.ametsoc.org/view/journals/clim/18/22/jcli3587.1.xml\n2. https://www.pnas.org/doi/full/10.1073/pnas.0705414105\n3. http://sciencepolicy.colorado.edu/students/envs_4800/russill_2009.pdf\n4. https://www.science.org/doi/10.1126/science.abn7950\n5. https://www.youtube.com/watch?v=UOd-Jgly9Us\n\nYou can support the channel by becoming a patron at http://www.patreon.com/simonoxfphys\n\nCheck out my website! https://www.simonoxfphys.com/\n\n---------- II ----------\n\nMy twitter - http://www.twitter.com/simonoxfphys\nMy facebook - http://www.facebook.com/youtubesimon\nMy insta - http://www.instagram.com/simonoxfphys\nMy goodreads - http://www.goodreads.com/simonoxfphys\n\n---------- II ----------\n\nMusic by Epidemic Sound: http://epidemicsound.com\nSome stock footage courtesy of Getty.\nEdited by Luke Negus.\n\nVideo about tipping points in climate and a new paper about climate tipping points, talking about the shutdown of the thermohaline circulation, permafrost thaw, collapse of ice sheets, and extinction of corals. This new paper from McKay et al showed that there isn't a neat relationship between cumulative carbon emissions and global warming - there can be step changes thanks to internal variability, rapidly pushing the Earth into different climates. In this video I talk about climate tipping points, how some are already possible today, and will become likely at just 1.5C of warming.\n\nHuge thanks to my supporters on Patreon: Justin Warren, Jack Grimm, Angela Flierman, Alipasha Sadri, Calum Storey, Mattophobia, Riz, Jan Krüger, The Confusled, Wessel van der Heijden, Conor Safbom, William Pettersson, Paul H and Linda L, Simon Stelling, Gabriele Siino, Ieuan Williams, Candace H, Tom Malcolm, Marcus Bosshard, Leonard Neamtu, Shab Kumar, Brady Johnston, Liat Khitman, Kent & Krista Halloran, Rapssack, Kevin O'Connor, Timo Kerremans, Ashley Wilkins, Michael Parmenter, Samuel Baumgartner, Dan Sherman, ST0RMW1NG 1, Adrian Sand, Morten Engsvang, Cio Cio San, Farsight101, K.L, fourthdwarf, Daan Sneep, Felix Freiberger, Chris Field, ChemMentat, Kolbrandr, , Sebastain Graf, Dan Nelson, Shane O'Brien, Alex, Fujia Li, Will Tolley, Cody VanZandt, Jesper Koed, Jonathan Craske, Albrecht Striffler, Igor Francetic, Jack Troup, SexyCaveman , Sean Richards, Kedar , Omar Miranda, Alastair Fortune, bitreign33 , Mat Allen, Rafaela Corrêa Pereira, Colin J. Brown, Princess Andromeda, Mach_D, Thusto , Andy Hartley, Lachlan Woods, Dan Hanvey, Simon Donkers, Kodzo , James Bridges, Liam , Andrea De Mezzo, Wendover Productions, Kendra Johnson.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}