{
  "title": "75: Dan Millman- The Hidden School: Return of The Peaceful Warrior",
  "pubDate": "Wed, 28 Jun 2017 18:46:13 +0000",
  "guid": "a1198113352611fd43ce2bc98a54e917",
  "link": "https://lifeonpurpose.libsyn.com/75-dan-millman-the-hidden-school-return-of-the-peaceful-warrior",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #75</strong>, Peaceful Warrior's <strong>Dan Millman</strong> returns to the show! Dan is a former world champion athlete, university coach, martial arts instructor, and college professor. After an intensive twenty-year spiritual quest, Dan's teaching found its form as the <strong>Peaceful Warrior’s Way</strong>, expressed fully in his seventeen books — including the seminal <strong>Way of the Peaceful Warrior</strong> — and lectures. His work continues to evolve over time, to meet the needs of a changing world.</p> <p>In this inspiring conversation, we discussed his brand new book, <strong>The Hidden School</strong> <em>(Simon and Schuster)</em>, the long-awaited conclusion to the Peaceful Warrior saga. Dan takes readers on an epic spiritual quest across the world as he searches for the link between everyday life and transcendent possibility. Along the way, he uncovers lessons of life hidden in plain sight—insights pointing the way to an inspired life in the eternal present.</p> <p><em>“In Way of the Peaceful Warrior, Dan Millman established himself as a master of teaching through story. Now, in this exciting adventure, he reveals how deep learning can be found in unexpected places. The wisdom he shares will illuminate many lives.\"</em><br /> <strong>don Miguel Ruiz</strong>, author of The Four Agreements</p> <p>About: <strong>Dan Millman</strong> is a former world champion athlete, university coach, martial arts instructor, and college professor.</p> <p>After an intensive, twenty-year spiritual quest, Dan’s teaching found its form as the Peaceful Warrior’s Way, expressed fully in his books and lectures. His work continues to evolve over time, to meet the needs of a changing world.</p> <p>Dan’s seventeen books, including Way of the Peaceful Warrior, have inspired and informed millions of readers in 29 languages worldwide. The feature film, “Peaceful Warrior,” starring Nick Nolte, was adapted from Dan’s first book, based upon incidents from his life.</p> <p>Much of Dan’s time is devoted to writing and speaking. His keynotes, seminars, and workshops span the generations to influence men and women from all walks of life, including leaders in the fields of health, psychology, education, business, politics, sports, entertainment, and the arts.</p> <p>Dan and his wife Joy live in Brooklyn, NY. They have three grown daughters and four grandchildren.</p> <p>To learn more about Dan's work, visit: <a href= \"http://www.peacefulwarrior.com/\" target= \"_blank\">http://www.peacefulwarrior.com/</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #75, Peaceful Warrior's Dan Millman returns to the show! Dan is a former world champion athlete, university coach, martial arts instructor, and college professor. After an intensive twenty-year spiritual quest, Dan's teaching found its form as the Peaceful Warrior’s Way, expressed fully in his seventeen books — including the seminal Way of the Peaceful Warrior — and lectures. His work continues to evolve over time, to meet the needs of a changing world.</p> <p>In this inspiring conversation, we discussed his brand new book, The Hidden School <em>(Simon and Schuster)</em>, the long-awaited conclusion to the Peaceful Warrior saga. Dan takes readers on an epic spiritual quest across the world as he searches for the link between everyday life and transcendent possibility. Along the way, he uncovers lessons of life hidden in plain sight—insights pointing the way to an inspired life in the eternal present.</p> <p><em>“In Way of the Peaceful Warrior, Dan Millman established himself as a master of teaching through story. Now, in this exciting adventure, he reveals how deep learning can be found in unexpected places. The wisdom he shares will illuminate many lives.\"</em> don Miguel Ruiz, author of The Four Agreements</p> <p>About: Dan Millman is a former world champion athlete, university coach, martial arts instructor, and college professor.</p> <p>After an intensive, twenty-year spiritual quest, Dan’s teaching found its form as the Peaceful Warrior’s Way, expressed fully in his books and lectures. His work continues to evolve over time, to meet the needs of a changing world.</p> <p>Dan’s seventeen books, including Way of the Peaceful Warrior, have inspired and informed millions of readers in 29 languages worldwide. The feature film, “Peaceful Warrior,” starring Nick Nolte, was adapted from Dan’s first book, based upon incidents from his life.</p> <p>Much of Dan’s time is devoted to writing and speaking. His keynotes, seminars, and workshops span the generations to influence men and women from all walks of life, including leaders in the fields of health, psychology, education, business, politics, sports, entertainment, and the arts.</p> <p>Dan and his wife Joy live in Brooklyn, NY. They have three grown daughters and four grandchildren.</p> <p>To learn more about Dan's work, visit: <a href= \"http://www.peacefulwarrior.com/\" target= \"_blank\">http://www.peacefulwarrior.com/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "45:44",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #75, Peaceful Warrior's Dan Millman returns to the show! Dan is a former world champion athlete, university coach, martial arts instructor, and college professor. After an intensive twenty-year spiritual quest, Dan's..."
}