{
  "title": "#489: The Politics of the Wizarding World",
  "link": "https://audioboom.com/posts/7720431",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4974,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>In  celebration of Halloween, <a href=\"https://www.youtube.com/watch?v=6AmVWSA3zcM\">we hosted a brand-new, spoooooky edition of Quizzitch Live</a>! Join us later this November for another round of trivia!</li>\n<li>News: MinaLima <a href=\"https://twitter.com/rowlinglibrary/status/1322265964122169346\">confirms they are working on</a> a Chamber of Secrets Illustrated Edition while Laura introduces us to the <a href=\"https://www.tiktok.com/@t22felton/video/6884690238946561285?_d=secCgsIARCbDRgBIAIoARI%2BCjyPau0yNO%2FsQGzvkaOqQc6GVjucs9A8Goj6yNh6z7of2Uy2LsaFVZvPziIlrH%2FlTnCMjvynE9VkLSZ4FxoaAA%3D%3D&language=en&preview_pb=0&sec_user_id=MS4wLjABAAAAZDzBT9vvgApYBro9rsV1gM5WE_JtwMW5DMhYe89KB875I9RNuavZCC5hTGCw6ocd&share_item_id=6884690238946561285&share_link_id=940204CF-095A-475F-8CC1-53FA124275C5&timestamp=1603994865&tt_from=copy&u_code=d9acj2di7dah8e&user_id=6759763966274700293&utm_campaign=client_share&utm_medium=ios&utm_source=copy&source=h5_m\">latest trend on TikTok</a>... POTTAH!</li>\n<li>Muggle Mail covers Halloween Happenings at Hogwarts, additional Potter plot holes and more scary moments from Chamber of Secrets and Deathly Hallows!</li>\n<li>With Election Day upon us, this week's main discussion focuses on Politics of the Wizarding World!</li>\n<li>Neville Chamberlain & The Mitford Sisters: which historic figures do we think may have inspired certain characters in the Harry Potter series?</li>\n<li>We discuss Nazi Germany's connection to the plots of both Harry Potter and Fantastic Beasts</li>\n<li>Government corruption: Cornelius Fudge, Lucius Malfoy and Dolores Umbridge</li>\n<li>Why Hagrid's arrest, Dumbledore's banishment and Buckbeak's execution defined Ministry interference and governmental abuse of power</li>\n<li>How The Daily Prophet acts as state-influenced media</li>\n<li>What problems do we think the wizarding government needs to address?</li>\n<li>Why does The International Statute of Secrecy still exist?</li>\n<li>Can we please banish Time Turners, Love Potions and Veritaserum already?</li>\n<li>Could the political aspects of Harry Potter be one of the reasons we love the series so much?</li>\n<li>The results are in from our \"You Decide 2020 Minster of Magic\" campaign! Find out who won: Hermione Granger, Aberforth Dumbledore, Kingsley Shacklebolt or Dolores Umbridge?</li>\n<li>Quizzitch: Which Minister founded the Department of Magical Law Enforcement?</li>\n<li>Chicken Soup For The MuggleCast Soul</li>\n<li>This week's episode is sponsored by Hello Fresh (visit <a href=\"http://www.HelloFresh.com/muggle90\">HelloFresh.com/muggle90</a> and use code muggle90 at checkout for $90 off your order!) and MeUndies (visit <a href=\"http://MeUndies.com/mugglecast\">MeUndies.com/mugglecast</a> to see their new line of Harry Potter undies!)</li>\n<li>Support us on Patreon and receive magical benefits, like Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 03 Nov 2020 11:00:00 +0000",
  "guid": "tag:audioboom.com,2020-11-02:/posts/7720431",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}