{
  "title": "Join \"Data School Insiders\" on Patreon",
  "description": "<!--kg-card-begin: markdown--><p>Four years ago, I started Data School to share my data science knowledge and <strong>help aspiring data scientists achieve their dreams</strong>. Today, I'm excited to share with you a new opportunity to support me so that I can create more tutorials and continue to reach students around the</p>",
  "link": "https://www.dataschool.io/join-data-school-insiders-on-patreon/",
  "guid": "5c5c44a4331d440017e2be04",
  "dc:creator": "Kevin Markham",
  "pubDate": "Fri, 13 Jul 2018 00:31:57 GMT",
  "content:encoded": "<!--kg-card-begin: markdown--><p>Four years ago, I started Data School to share my data science knowledge and <strong>help aspiring data scientists achieve their dreams</strong>. Today, I'm excited to share with you a new opportunity to support me so that I can create more tutorials and continue to reach students around the world!</p>\n<p><strong>I've created a new Patreon community</strong> called \"Data School Insiders\", and I'd love for you to <a href=\"https://www.patreon.com/dataschool\">join me</a>. Patreon is a membership platform that allows you to support your favorite creators in return for <strong>exclusive rewards</strong>... it's like an ongoing Kickstarter campaign!</p>\n<p>By joining Data School Insiders, you'll be <strong>pledging to support me financially</strong> so that I can continue to create high-quality data science tutorials for EVERYONE.</p>\n<p>You can pledge any amount you like (as little as $1 per month) and for any length of time. In return, you'll receive some valuable rewards, like <strong>bonus videos and private webcasts!</strong></p>\n<p>But this isn't just about pledges and rewards. I believe that we can <strong>build a stronger data science community</strong>, deepen our connections, and support one another through Data School Insiders.</p>\n<div align=\"center\">\n<h2>\n<a href=\"https://www.patreon.com/dataschool\"> >>> Join Data School Insiders <<< </a>\n</h2>\n</div>\n<div align=\"center\">\n<iframe width=\"853\" height=\"480\" src=\"https://www.youtube.com/embed/RVcEiixeKBk?rel=0&showinfo=0\" frameborder=\"0\" allowfullscreen></iframe>\n</div>\n<blockquote>\n<p><em>\"You are one of the 4 instructors who has helped me get my <strong>dream job in Data Science</strong> at the age of 40.\"</em> - Anand Subramanian</p>\n<p><em>\"I've got a lot to thank you for. I now have an <strong>opportunity at Apple!</strong>\"</em> - Iceus (YouTube)</p>\n<p><em>\"If it wasn't for your videos, I wouldn't have been able to <strong>pass my courses</strong>.\"</em> - Ranjan Rehman</p>\n</blockquote>\n<h2 id=\"rewardlevels\">Reward Levels</h2>\n<p><a href=\"https://www.patreon.com/join/dataschool/checkout?rid=2689163\">Student Supporter ($1/month)</a></p>\n<ul>\n<li>Access my private Patreon activity feed and get notified every time I publish a new tutorial</li>\n<li>Provide crucial feedback that will help me to decide what I should create next</li>\n<li>Keep the Data School blog ad-free</li>\n<li>Feel good about enabling me to create free content that helps students around the world!</li>\n</ul>\n<p><a href=\"https://www.patreon.com/join/dataschool/checkout?rid=2689168\">Classroom Crew ($5/month)</a></p>\n<ul>\n<li>Participate in live Q&A webcasts (for Insiders only)</li>\n<li>Get immediate access to 24+ hours of webcast recordings</li>\n<li>Get advance access to upcoming blog posts and videos</li>\n<li>Plus, all of the rewards above!</li>\n</ul>\n<p><a href=\"https://www.patreon.com/join/dataschool/checkout?rid=2689171\">Faculty Lounge ($10/month)</a></p>\n<ul>\n<li>Access a private forum where you can ask questions, get feedback, share ideas, and network with other Insiders (and me!)</li>\n<li>Access bonus educational content that will never be released publicly (videos, notebooks, etc.)</li>\n<li>Receive substantial discounts on future courses and products</li>\n<li>Plus, all of the rewards above!</li>\n</ul>\n<p><a href=\"https://www.patreon.com/join/dataschool/checkout?rid=2689175\">Business School ($20/month)</a></p>\n<ul>\n<li>Get a behind-the-scenes look at Data School: How I create and edit videos, how my business works, what tools and services I use, etc.</li>\n<li>Receive my best tips on content creation, marketing, running a business, teaching, growing a YouTube channel, and more</li>\n<li>Access a restricted area of our private forum where we can discuss business, marketing, and other content from this reward level</li>\n<li>Plus, all of the rewards above!</li>\n</ul>\n<h2 id=\"frequentlyaskedquestions\">Frequently Asked Questions</h2>\n<p><strong>Why do you need to raise money?</strong></p>\n<p>I truly enjoy creating videos and blog posts for the Data School community, which is why I quit my job to focus solely on Data School. However, these lessons take an incredible amount of time to create. (For example, my pandas video series required over 200 hours of work, and even a single blog post can take over 25 hours!)</p>\n<p>I've managed to sustain Data School financially by teaching one paid course, and I'll be selling more courses in the future. But I want to find a sustainable way to keep making free content, and your support will allow me to do this!</p>\n<p><strong>Where will the money go?</strong></p>\n<p>First, it will help to cover my existing costs, such as blog hosting, webcasting, newsletter software, editing tools, and more.</p>\n<p>Second, it will allow me to hire people to help with certain tasks (video editing, transcription, graphic design, etc.), which will free up my time to create more content!</p>\n<p>Third, it will allow me to upgrade my existing recording setup, which will enhance the video quality and make it easier to record videos.</p>\n<p><strong>Do I have to pledge in US Dollars?</strong></p>\n<p>No, you can use any currency and your pledge will be converted into dollars.</p>\n<p><strong>Are there any extra fees?</strong></p>\n<p>There are no extra fees, unless your bank charges a fee to convert to US Dollars.</p>\n<p><strong>What if I need to change or cancel my pledge?</strong></p>\n<p>You can change or cancel your pledge at any time - there's no long term commitment.</p>\n<p><strong>I want to help, but I can't afford it... can I still receive your tutorials?</strong></p>\n<p>YES! The pledges from this campaign will enable me to continue creating tutorials for EVERYONE. You'll still receive lots of free content through the Data School blog and YouTube channel!</p>\n<div align=\"center\">\n<h2>\n<a href=\"https://www.patreon.com/dataschool\"> >>> Join Data School Insiders <<< </a>\n</h2>\n</div>\n<div align=\"center\">\n<iframe width=\"853\" height=\"480\" src=\"https://www.youtube.com/embed/4V5jrPaNrjY?rel=0&showinfo=0\" frameborder=\"0\" allowfullscreen></iframe>\n</div>\n<p>Regardless of whether you join, I want to THANK YOU for your support over the years. I'm truly grateful that you are part of the Data School community, and I look forward to supporting you for years to come!</p>\n<p>Kevin Markham<br>\n<em>Founder, Data School</em></p>\n<p>P.S. Have a question about Data School Insiders? <strong>Please let me know in the comments!</strong></p>\n<!--\n<blockquote class=\"twitter-tweet\" data-cards=\"hidden\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">NEW! Support Data School on <a href=\"https://twitter.com/Patreon?ref_src=twsrc%5Etfw\">@Patreon</a>: <a href=\"https://t.co/reh08pJSPh\">https://t.co/reh08pJSPh</a> 🎉<br><br>You'll be enabling me to create new data science tutorials, AND you'll receive exclusive rewards... like bonus videos, private webcasts, behind-the-scenes content, and more!<br><br>Thank you SO MUCH for your support! 😍 <a href=\"https://t.co/xhvFdxuHHB\">pic.twitter.com/xhvFdxuHHB</a></p>&mdash; Kevin Markham (@justmarkham) <a href=\"https://twitter.com/justmarkham/status/1017393995025133568?ref_src=twsrc%5Etfw\">July 12, 2018</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n--><!--kg-card-end: markdown-->"
}