{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-2202159201225318181",
  "published": "2020-06-30T09:30:00.000-07:00",
  "updated": "2020-06-30T10:05:42.666-07:00",
  "title": "To our YouTube TV members: an update to our content and price",
  "content": "In 2017, we introduced YouTube TV, live TV designed for the YouTube generation&nbsp;<span style=\"background-color: white; color: #222222; font-family: &quot;roboto&quot; , &quot;arial&quot; , sans-serif; font-size: 16px;\">—</span>&nbsp;those who want to stream TV when and how they want, without commitments. We’ve just passed the three-year mark, so I wanted to take this opportunity to update you on how we’re thinking about YouTube TV.<br /><br />Since launch, we’ve listened to your feedback and worked to build an experience that fits the needs of everyone in your family, by adding highly-requested content like<a href=\"http://www.pbs.org/about/blogs/news/pbs-member-stations-now-live-on-youtube-tv/\" target=\"_blank\"> PBS</a> and <a href=\"https://youtube.googleblog.com/2019/04/updates-to-youtube-tv-more-content-new-price.html\" target=\"_blank\">Discovery Network</a> brands, including HGTV and Food Network, and <a href=\"https://twitter.com/YouTubeTV/status/1205608388283060224\" target=\"_blank\">launching</a> <a href=\"https://twitter.com/YouTubeTV/status/1207057960725295107\" target=\"_blank\">new</a> <a href=\"https://twitter.com/YouTubeTV/status/1212810846780502016\" target=\"_blank\">features</a> to reinvent how you watch live TV.  <br /><br />As we continue to build a best-in-class experience for you, we have a few updates to share: new content launching today, new features we’ve recently introduced, and an updated price.  <br /><br /><h3>More content to enjoy, starting today </h3><br />Earlier this year, <a href=\"https://www.businesswire.com/news/home/20200507005293/en/ViacomCBS-Google-Announce-Expanded-Distribution-Agreement\" target=\"_blank\">we let you know</a> that we’d soon be adding more of ViacomCBS’s family of brands to YouTube TV, which includes 8 of your favorite channels launching today: BET, CMT, Comedy Central, MTV, Nickelodeon, Paramount Network, TV Land and VH1.  <br /><br />That means you can follow the biggest stories in news, politics and pop culture with “The Daily Show with Trevor Noah;” catch up with Catelynn, Cheyenne, Maci, Mackenzie and Amber on “Teen Mom OG;” join the search for America’s next drag superstar with “RuPaul’s Drag Race;” go on an adventure with “SpongeBob SquarePants;” and follow the fictional lives of the Dutton family on the new season of “Yellowstone,” airing now.    <br /><br />BET Her, MTV2, MTV Classic, Nick Jr., NickToons, and TeenNick are also set to come to YouTube TV at a later date.  <br /><br />In addition to our base plan of now more than 85+ channels, we also recently <a href=\"https://twitter.com/YouTubeTV/status/1265733378357297153\" target=\"_blank\">introduced</a> Cinemax and HBO Max, which includes all of HBO plus a robust library of content and original series, to our growing list of add-on channels, making YouTube TV your one-stop shop for entertainment. <br /><br /><h3>The latest features to try while you sit back with your favorite shows </h3><br />We’re always listening to our member’s feedback on the channels they want to see on YouTube TV, but we’re also continuously building new features and making improvements that reinvent how you watch TV and interact with your favorite content on YouTube TV. Here are just a few of those features and updates we’ve launched recently: <br /><br /><br /><ul><li><b>Jump to the news that matters most to you: </b>We’ve been testing a new feature that allows you to jump to various segments within select news programs on YouTube TV, and have just brought this to all users. Similar to our <a href=\"https://twitter.com/YouTubeTV/status/1205608388283060224\" target=\"_blank\">key plays view</a> for sports, on some programs you’ll be able to jump to specific news clips within the complete recording. This feature is available on TV screens now and will come to mobile devices in the coming weeks.</li></ul><ul><li><b>Control over your recorded content: </b>In addition to your unlimited DVR space, YouTube TV members can pause, rewind, and fast forward through all their recorded shows, regardless of network.</li></ul><ul><li><b>Go easy on the eyes with Dark Mode: </b>We recently introduced a dark theme to both desktop and mobile devices to help tone down your screen’s glare and experience YouTube TV with a dark background.</li></ul><ul><li><b>Mark a show as watched:</b> You now have an option to select “Mark as Watched” on desktop and mobile devices for any TV show you’ve already seen, a top requested feature from our members.</li></ul><ul><li><b>A fresh new look for the Live Guide:</b> Based on your feedback, we’ve updated the Live Guide on desktop so you can see what’s on, now, and also scroll ahead 7 days into the future.  </li></ul><br /><br /><h3>An update to your price </h3><br />As we continue to evaluate how to provide the best possible service and content for you, our membership price will be $64.99. This new price takes effect today, June 30, for new members. Existing subscribers will see these changes reflected in their subsequent billing cycle on or after July 30. <br /><br />We don’t take these decisions lightly, and realize how hard this is for our members. That said, this new price reflects the rising cost of content and we also believe it reflects the complete value of YouTube TV, from our breadth of content to the features that are changing how we watch live TV. YouTube TV is the only streaming service that includes a DVR with unlimited storage space, plus 6 accounts per household each with its own unique recommendations, and 3 concurrent streams. It's all included in the base cost of YouTube TV, with no contract and no hidden fees. <br /><br />While we would love every member to continue to stay with our service, we understand that some of you may choose to pause or cancel your membership. We want to make YouTube TV flexible for you, so members can pause or cancel anytime <a href=\"https://tv.youtube.com/settings/subscriptions?setac=cancel_choice\" target=\"_blank\">here</a>.  <br /><br />As the streaming industry continues to evolve, we are working to build new flexible models for YouTube TV users, so we can continue to provide a robust and innovative experience for everyone in your household without the commitments of traditional TV. <br /><br />Thank you for being a part of the YouTube TV family. We’ll continue to work to make it the best place to watch live TV, how you want it. <br /><br /><i>Christian Oestlien, Vice President of Product Management, YouTube TV </i>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}