{
  "id": "yt:video:l8kRDCZfKvI",
  "yt:videoId": "l8kRDCZfKvI",
  "yt:channelId": "UCVHxJghKAB_kA_5LMM8MD3w",
  "title": "the LOSS of architectural BEAUTY: america's ugly housing developments",
  "link": "",
  "author": {
    "name": "oliSUNvia",
    "uri": "https://www.youtube.com/channel/UCVHxJghKAB_kA_5LMM8MD3w"
  },
  "published": "2022-01-24T18:53:40+00:00",
  "updated": "2022-08-18T22:24:43+00:00",
  "media:group": {
    "media:title": "the LOSS of architectural BEAUTY: america's ugly housing developments",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "check out AtlasVPN's special deal for 86% OFF a 3-year subscription https://atlasv.pn/oliSUNvia !\n\ni talk about architectural beauty as capturing the shared identity of a community (as perfectly as possible) and why modern american housing developments fail to deliver in this regard. beauty is a valuable good that should be made more accessible to the public. P.S. anyone catch beethoven's ninth symphony playing when i mentioned the piece?\n\n✧･ﾟ: *✧･ﾟ:* i'd love to hear what you have to say  *:･ﾟ✧*:･ﾟ✧\n\nTIMESTAMPS:\n0:00 intro\n2:16 modernist architecture\n3:18 some historical background\n6:02 what IS architectural beauty?\n9:32 the rationalization of society\n13:03 how to control rationalization?\n15:16 why the government should be involved \n16:45 margaret kohn's solidarism theory\n18:22 can rationalization be compatible with architectural beauty?\n20:02 the trade-off between beauty and efficiency\n21:47 what about interior design?\n23:14 closing remarks\n\n★・・・・・★・・・・・★\nIf you want extra ways to support my channel and get more content, check out my PATREON: patreon.com/oliSUNvia\n\nsocials: \n  ,, instagram: @olisunvia\n  ,, tiktok: @olisunvia (v lame pls don't judge)\n  ,, vsco: @olisunvia\n  ,, spotify: liv sun\n  ,, pinterest: @olisunvia (i'm super creative with usernames)\n\nFOR BUSINESS INQUIRIES:\nolisunvia@nebula.tv\n★・・・・・★・・・・・★\n\nSOURCES:\nRoger Scruton. \"Why Beauty Matters?\" https://vimeo.com/549715999\nParsons, G. \"Beauty and Public Policy.\" https://www.academia.edu/1140538/Beauty_and_Public_Policy \nRitzer, G. \"The 'McDonaldization' of Society.\" https://doi.org/10.1111/j.1542-734X.1983.0601_100.x \nKohn, M. \"Public Goods and Social Justice.\" https://doi.org/10.1017/S1537592719004614 \nBritish Gov. \"National Planning Policy Framework.\" https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1005759/NPPF_July_2021.pdf\nGuillén, M. F. \"Scientific Management’s Lost Aesthetic: Architecture, Organization, and  the Taylorized Beauty of the Mechanical.\" https://doi.org/10.2307/2393654 \nTorabi, Z., & Brahman, S. \"Effective Factors in Shaping the Identity of Architecture.\"\nhttps://doi.org/10.5829/idosi.mejsr.2013.15.1.2357 \nDuque, E. \"‘House Form and Culture’ revisited: A subaltern critique of  Rapoport’s reading of vernacular.\"\nFlorida, R., Mellander, C., & Stolarick, K. \"Beautiful Places: The Role of Perceived  Aesthetic Beauty in Community Satisfaction.\" https://doi.org/10.1080/00343404.2010.486784 \nHewitt, A. \"Privatizing the public: Three rhetorics of art’s public good in ‘Third Way’  cultural policy.\" https://doi.org/10.1386/aps.1.1.19_1 \nJokilehto, J. I. \"A history of architectural conservation: The contribution of English,  French, German and Italian thought towards an international approach to the  conservation of cultural property.\" https://elibrary.ru/item.asp?id=6842256 \nMeltzer, T. \"Robot doctors, online lawyers and automated architects: The future  of the professions?\" The Guardian.\nPearce, M. T., Zaidel, D. W., Vartanian, O., Skov, M., Leder, H., Chatterjee, A., & Nadal, M.  \"Neuroaesthetics: The Cognitive Neuroscience of Aesthetic Experience.\" https://doi.org/10.1177/1745691615621274 \nRowe, H. A. \"The Rise and Fall of Modernist Architecture.\"  http://www.inquiriesjournal.com/articles/1687/the-rise-and-fall-of-modernist-architecture Steiner, W. Venus in Exile: The Rejection of Beauty in Twentieth-Century Art.\nStrom, K. A. \"Modern Architecture Is Shoddy As Well As Ugly.\" https://nationalvanguard.org/2020/04/modern-architecture-is-shoddy-as-well as-ugly/\nWassenberg, F. \"Beyond an Ugly Appearance: Understanding the Physical Design and  Built Environment of Large Housing Estates.\" https://doi.org/10.1007/978-3-319-92813- 5_2 \nBilliani, F., & Pennacchietti, L. \"Fascism and Architecture.\" https://doi.org/10.1007/978-3-030-19428-4_4 \nZheng, Y., & Taylor, R. N. \"A classification and rationalization of model-based software  development.\" https://doi.org/10.1007/s10270-013-0355-3\n\nMUSIC:\nBeethoven: Symphony No. 3, Eroica, Mov. 4\nBeethoven: Sonata No. 16, Mov. 3\nLiszt: Liebestraum No. 3\nBeethoven, arr. Liszt: Symphony No.9, Mov. 2 \nBeethoven: Symphony No. 9, Mov. 4\n\ntags: architectural beauty, beautiful architecture, beauty, aesthetics, gothic, modern architecture, modernist architecture, modernism, why beauty matters, why modern architecture sucks, why so many suburbs look the same, why do people hate modern architecture, suburbia, why does suburbia suck, planned housing developments, america's ugly neighbourhoods, america affordable housing, philosophy, the growth ponzi scheme, video essay, social commentary, the suburban wasteland, roger scruton, walter gropius, le corbusier, functionalism, capitalism, shanspeare, jodan theresa, cj the x, tiffany ferg, alice cappelle",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}