{
  "title": "EPISODE 71: John Brown (Part 2): A Reckoning in Blood",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Fri, 26 Mar 2021 15:43:50 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2021/3/26/episode-71-john-brown-part-2-a-reckoning-in-blood",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:605e00939c8cef27246cb4ef",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1616773394916-3R1SP2BFPRFHB85IUY6L/HOF-71-JohnBrown-II.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"HOF-71-JohnBrown-II.jpg\" data-load=\"false\" data-image-id=\"605e0111c3727d3b6ef6d430\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1616773394916-3R1SP2BFPRFHB85IUY6L/HOF-71-JohnBrown-II.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“I think he [God] has used me as an instrument to kill men; and if I live, I think he will use me as an instrument to kill a good many more.” —</em> John Brown </p><p class=\"\"><em>“I had reached the point at which I was not afraid to die. This spirit made me a freeman in fact, while I remained a slave in form.” —</em> Frederick Douglass </p><p class=\"\"><em> “I have only a short time to live, only death to die and I will die fighting for this cause.&nbsp;&nbsp;There will be no peace in this land until slavery is done for.”</em> — John Brown</p><p class=\"\"><em>“We will continue to tar and feather, drown, lynch, and hang every white-livered abolitionist who dares to pollute our soil.” —</em> Dr. John H Stringfellow</p><p class=\"\"><em>“Caution!? Caution!?—he exploded—I am eternally tired of hearing that word Caution! It is nothing but the word of cowardice!”</em> — John Brown </p><p class=\"\"><em>“To know and not to act is not to know.”</em> — Wang Yangming </p><p class=\"\"><em>“Behind them lay five twisted, red and mangled corpses. Behind them rose the stifled wailing of widows and little children… but before them rode a man, tall, dark, grim-faced and awful. His hands were red and his name was John Brown. Such was the cost of freedom.” — </em>DuBois</p><p class=\"\">The subject of this series is easily one of the most divisive individuals in U.S. history. The man we are talking about is Mr. John Brown. Many, in fact, see Brown’s actions as the spark that ignited the Civil War. He has been described as a civil rights hero, a terrorist, and everything in between. Some have argued he was clinically insane. Others believe he was the most principled man of his age. Regardless of how we interpret his story, certain facts are beyond dispute. Throughout his life, slavery was the law of the land in much of the United States. With hardly any abolitionist willing to do more than use words against slavery, while pro-slavery forces demonstrated they were quite skilled at using violence to further their worldview, it seemed inevitable that slavery would last for the foreseeable future. To John Brown, that was an unacceptable option. Allowing it to continue for one more second was cowardly and evil.  If pacifist means weren’t enough to bring about the end of slavery, then John Brown was more than ready to speak the language of violence. For the sake of destroying slavery, he would shed the blood of his enemies, the blood of his family, and his own blood. </p><p class=\"\">In this second episode of a three-part series, we see John Brown meeting Frederick Douglass & visiting Europe, the passing of the Fugitive Slave Law, the experiment at North Elba, Bleeding Kansas, the pathetic story of the Border Ruffians, revising the notion of abolitionist pacifism, blood on the floor of the Senate, the Pottawatomie massacre, guerrilla in Kansas, and much more.</p>",
  "media:content": {
    "media:title": "EPISODE 71: John Brown (Part 2): A Reckoning in Blood"
  }
}