{
  "title": "Cost-effective labelling robot wins the 2022 igus ROIBOT Award",
  "link": "https://www.iaasiaonline.com/cost-effective-labelling-robot-wins-the-2022-igus-roibot-award/",
  "dc:creator": "Tzelong",
  "pubDate": "Tue, 01 Nov 2022 01:29:50 +0000",
  "category": [
    "Industry News",
    "Recent News",
    "Robotics",
    "Robots",
    "igus",
    "roibot award"
  ],
  "guid": "https://www.iaasiaonline.com/?p=38735",
  "description": "<p>Cost-effective labelling robot wins the 2022 igus ROIBOT Award An amortisation period of 16 to 24 months and a zero margin of error convinces the panel of expert judges for the robotics competition Simple, cost-effective automation solutions can be found both in an increasing number of Small and Medium Enterprises and among large industrial players. &#8230;</p>\n<p class=\"read-more\"> <a class=\"\" href=\"https://www.iaasiaonline.com/cost-effective-labelling-robot-wins-the-2022-igus-roibot-award/\"> <span class=\"screen-reader-text\">Cost-effective labelling robot wins the 2022 igus ROIBOT Award</span> Read More &#187;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com/cost-effective-labelling-robot-wins-the-2022-igus-roibot-award/\">Cost-effective labelling robot wins the 2022 igus ROIBOT Award</a> appeared first on <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com\">IAA - Industrial Automation</a>.</p>\n",
  "content:encoded": "<p><strong>Cost-effective labelling robot wins the 2022 igus ROIBOT Award</strong></p>\n<p><strong>An amortisation period of 16 to 24 months and a zero margin of error convinces the panel of expert judges for the robotics competition</strong><span id=\"more-38735\"></span></p>\n<p><strong>Simple, cost-effective automation solutions can be found both in an increasing number of Small and Medium Enterprises and among large industrial players. Every two years, igus presents the ROIBOT Award for the most creative applications. This year, the inventors of a labelling robot, the developers of a fully automatic container system for growing vegetables and herbs, and the designers of a wallpapering device received the coveted prize.</strong></p>\n<p>&nbsp;</p>\n<p>Robots are in use all over the world – in logistics, laboratories, and agriculture. Every two years, experts from industry and trade press work with igus GmbH to honour the most cost-effective, creative, clever solutions with the ROIBOT Award. The focus of the competition is on igus Low Cost Automation solutions such as delta robots, Cartesian robots, and articulated arm robots. The award&#8217;s name says it all and reveals main decision criterion for the panel of judges: return on investment that quickly pays for the outlay. A total of 110 submissions from 20 countries show the diverse application options for cost-effective robotics. In the second iteration of the competition, MFG Technik & Service GmbH won over the judges with its &#8220;LabelMonkey&#8221; labelling robot, winning robotic components worth 5,000 euros. A robolink DP multi-axis articulated robot for 7,700 euros is the heart of this system. Its two printing modules ensure that logistics labels are reliably affixed to pallets. The LabelMonkey is a simple, cost-effective mechanism for the end user. The system pays for itself in just 16 to 24 months, making it very attractive for many logisticians to use.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><strong>Automatic harvest assistant takes second place</strong></p>\n<p>The increasing extremes in weather conditions due to climate change requires ever greater expenditure of resources and personnel in agriculture. Then there is crop storage and the long transport routes. Farmionic, an Austrian company, has therefore set itself a very special goal: The engineers are developing the vegetable garden of the future. It is a fully automatic, resource-conserving container system for growing vegetables and herbs with 24/7 availability, anywhere in the world. A robolink DP robot takes on all tasks, from planting to harvesting, on a seventh axis. The robotics system costs 11,200 euros. It pays for itself in 13 to 15 months. The pioneering invention took second place. tapo-fix GmbH & Co. KG, based in Wolfsburg, took third. Using a room linear robot, the manufacturer of wallpapering equipment for home and crafts has developed an extremely affordable automation solution for applying paste to metal. The acquisition value is 6,700 euros. To free up employees, the dosing robot is now assuming this task. It works extremely precisely and hand-in-hand with staff, saving the company up to 8,000 euros per year.</p>\n<p><strong> </strong></p>\n<p>Find out more about the 2022 ROIBOT Award winners at: <a href=\"https://www.igus.eu/info/roibot-winners-2022\">https://www.igus.eu/roibot-winners-2022</a></p>\n<p><!--more--></p>\n<p><strong><b>CLICK </b></strong><a href=\"https://www.iaasiaonline.com/industry-news/\"><strong><u><b>HERE</b></u></strong></a><strong><b> FOR LATEST NEWS.</b></strong></p>\n<p><strong><b>READ CURRENT AND PAST </b></strong><a href=\"https://www.iaasiaonline.com/magazine/\"><strong><u><b>ISSUES</b></u></strong></a><strong><b> OF IAA.</b></strong></p>\n<p><strong><b>KEEP YOURSELF UPDATED, </b></strong><a href=\"https://www.iaasiaonline.com/subscription/\"><strong><u><b>SUBSCRIBE</b></u></strong></a><strong><b> TO IAA NOW!</b></strong></p>\n<p><strong><b>AND DON’T FORGET FOLLOW US ON </b></strong><a href=\"https://www.facebook.com/IAAsia/\"><strong><u><b>FACEBOOK</b></u></strong></a><strong><b>,</b></strong><a href=\"https://www.linkedin.com/showcase/industrial-automation-asia/\"><strong><u><b> LINKEDIN</b></u></strong></a><strong><b> AND </b></strong><a href=\"https://twitter.com/IAA_Asia\"><strong><u><b>TWITTER!</b></u></strong></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com/cost-effective-labelling-robot-wins-the-2022-igus-roibot-award/\">Cost-effective labelling robot wins the 2022 igus ROIBOT Award</a> appeared first on <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com\">IAA - Industrial Automation</a>.</p>\n"
}