{
  "title": "Extracting Spatial Interaction Patterns between Urban Road Networks and Mixed Functions. (arXiv:2211.01545v1 [physics.soc-ph])",
  "link": "http://arxiv.org/abs/2211.01545",
  "description": "<p>In the field of urban planning, road network system planning is often the\nfirst step and the main purpose of urban planning is to create a spatial\nconfiguration of different functions such as residence, education, business,\netc. Generally speaking, the more mixed the functions of an area has, the more\npossible its vitality may be. Therefore, in this article, we propose a new\nframework to study the specific spatial influence patterns of the overall\nstructure and different sub-structures of road networks on the mixed functions.\nTaking road segment as the basic unit, we characterize mixed functions\naggregation of road networks with the number of POIs categories within 100\nmeters around every road segment. At the same time, on the basis of centrality\nmeasurement in graph theory, we use 4 indexes to reflect the characteristics of\nthe urban road network structure, including degree, closeness, betweenness, and\nlength. We conduct our methods and experiments using the road networks and POI\ndata within the 5th ring road of Beijing. The results demonstrate that urban\nroad networks inherently influence the aggregation of urban mixed functions in\nvarious patterns and the patterns of road network sub-structures is also quite\ndifferent. Our study shows that the higher the degree of the road network\nstructure has, the more likely it will attract functions' aggregation. It also\nreveals that diversified local degree will help gather urban functions. In\naddition to those, the analysis as well validates the importance of small-grids\ntypology of urban road networks and the closeness to the center of cities.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Xiao_H/0/1/0/all/0/1\">Huidan Xiao</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Yang_T/0/1/0/all/0/1\">Tao Yang</a>"
}