{
  "id": "yt:video:bi7E9S0n6zQ",
  "yt:videoId": "bi7E9S0n6zQ",
  "yt:channelId": "UCcRV5FPxxWFdS4Fjnk9FQvA",
  "title": "The Peter Lindsay Memorial Lecture 2022 | Can we trust the statistics in the media?",
  "link": "",
  "author": {
    "name": "Imperial College London",
    "uri": "https://www.youtube.com/channel/UCcRV5FPxxWFdS4Fjnk9FQvA"
  },
  "published": "2022-10-26T17:36:54+00:00",
  "updated": "2022-10-27T19:38:35+00:00",
  "media:group": {
    "media:title": "The Peter Lindsay Memorial Lecture 2022 | Can we trust the statistics in the media?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Delivered by Professor Sir David Spiegelhalter FRS OBE\n\nAbstract:\nThe current pandemic has emphasised the key role that statistics play in understanding what is going on in the world.  But how do we decide whether to trust the numbers that get put in front of us?  Are they being used to inform or persuade us? Using a wide range of examples, I will look at the way that statistics can be used to try and persuade audiences to think or act in a certain way, contrast this with efforts to make communication 'trustworthy', and list the questions that you should ask whenever you are presented with claims based on numbers.\n\nBiography:\nProfessor Sir David Spiegelhalter FRS OBE is Chair of the Winton Centre for Risk and Evidence Communication in the Centre for Mathematical Sciences at the University of Cambridge, which aims to improve the way that statistical evidence is used by health professionals, patients, lawyers and judges, media and policy-makers. He has been very busy over the COVID crisis. He presented the BBC4 documentaries “Tails you Win: the Science of Chance”, the award-winning “Climate Change by Numbers”, and in 2011 came 7th in an episode of BBC1’s Winter Wipeout. His bestselling book, The Art of Statistics, was published in March 2019, and Covid by Numbers came out in September 2021.\n\nHe was knighted in 2014 for services to medical statistics, was President of the Royal Statistical Society (2017-2018), and became a Non-Executive Director of the UK Statistics Authority in 2020.\n-----------\n\nPeter Lindsay, an alumnus of Imperial College who died in 2006, was Emeritus Professor at King’s College London and Research Professor at Queen Mary, University of London, and was distinguished for his contributions to microwave device theory, quantum electronics and the application of lasers in engineering.\n\nProfessor Lindsay came to London in 1939 and gained a BSc, MSc and PhD at Imperial in quick succession. He specialised in research on microwave electron tubes (valves) and produced seminal papers on electron velocity distributions and noise phenomena in magnetron devices.\n\nHe worked in industry and academia in the US before returning to the UK as a lecturer in electrical engineering at King’s where he was was awarded a personal chair in physical electronics in 1974, and also served as Dean of Engineering. Peter was a Fellow of the Institution of Electrical Engineers, the Institute of Physics, and the City and Guilds College.\n\nThe annual lecture invites eminent speakers to discuss developments that are enhancing the knowledge and understanding of scientists and researchers who are at the forefront of tackling challenges.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}