{
  "title": "The Inflation Reduction Act vs. China’s PV Dominance",
  "link": "https://spectrum.ieee.org/senate-bill-inflation-reduction-act-solar",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/many-sheep-below-blue-solar-panels.jpg?id=31948365&width=1200&height=800&coordinates=0%2C142%2C0%2C142\"/><br/><br/><p>The falling costs of solar photovoltaics have been crucial for the clean-energy technology’s rise. And China has been <a href=\"https://www.iea.org/news/the-world-needs-more-diverse-solar-panel-supply-chains-to-ensure-a-secure-transition-to-net-zero-emissions\" rel=\"noopener noreferrer\" target=\"_blank\">instrumental</a> in making <a href=\"https://spectrum.ieee.org/us-imposes-much-stiffer-tariffs-on-chinese-solar-manufacturers\" target=\"_self\">solar power affordable</a> in many parts of the world, thanks in part to the country’s low energy and labor costs. </p><p>On the flip side, over the past decade, the global manufacturing capacity for solar panels has shifted out of Europe, Japan, and the United States almost entirely to China. According to a <a href=\"https://www.iea.org/reports/solar-pv-global-supply-chains\" rel=\"noopener noreferrer\" target=\"_blank\">recent report</a> by the International Energy Agency, the country manufactures over 80 percent of all the main elements needed for solar panels: <a href=\"https://en.wikipedia.org/wiki/Polycrystalline_silicon\" target=\"_blank\">polysilicon</a>, ingots, wafers, cells, and modules. This heavy concentration of the PV supply chain in one region of the world does not bode well for a secure, risk-free transition. </p><p>Many hopes are on the <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/08/15/by-the-numbers-the-inflation-reduction-act/\" target=\"_blank\">Inflation Reduction Act</a> (IRA), signed by President Biden into law in August, to spur the U.S. solar industry. The IRA will provide financial incentives that encourage domestic manufacturing and deployment of solar technologies. </p><p>But a limited domestic supply chain of solar PV components in the United States has analysts being cautiously optimistic. “The IRA is definitely going to have an impact, but a lot hinges on the details,” says Sylvia Leyva Martinez, an analyst at research and consultancy firm <a href=\"https://www.woodmac.com/\" target=\"_blank\">Wood Mackenzie</a> and author of a <a href=\"https://www.woodmac.com/press-releases/u.s.-solar-market-ready-for-rebound-after-tumultuous-first-half-of-2022/\" rel=\"noopener noreferrer\" target=\"_blank\">new Solar Market Insight report</a> together with the <a href=\"https://www.seia.org/\" target=\"_blank\">Solar Energy Industries Association</a> (SEIA).</p><p>The IRA will give <a href=\"https://www.pv-magazine.com/2022/08/15/whats-in-the-inflation-reduction-act-for-the-solar-industry/\" rel=\"noopener noreferrer\" target=\"_blank\">tax credits</a> to solar power projects that purchase domestically produced hardware. It will provide direct tax credits for manufacturing polysilicon and other components in the solar supply chain, and it will give loan guarantees to new factories that make any component.</p><p>According to the Wood Mackenzie report, the IRA should help the solar market grow by 40 percent, or about 62 gigawatts of additional solar capacity, between 2023 and 2027. But, says Martinez, “I don’t think it would remove China’s position as the market leader because they already dominate.”</p><p>It’s simply too hard for any other country to compete with the low costs of solar PV manufacturing in China right now. If U.S. solar-module manufacturing capacity does indeed increase enough, she says, and “if they’re competitive enough with those produced in China or Southeast Asia, that would help other countries have an alternative source for modules.” </p><p>In the meantime, what could more immediately help the U.S. market, and in turn those in Europe and Japan, is the creation of a demand-supply ecosystem, she says. Case in point: the June <a href=\"https://www.prnewswire.com/news-releases/leading-us-solar-companies-announce-consortium-to-spend-over-6-billion-on-solar-modules-and-support-expansion-of-domestic-supply-chain-301571646.html\" rel=\"noopener noreferrer\" target=\"_blank\">announcement</a> of the US Solar Buyer Consortium formed by four major solar project developers in the United States. These companies—led by <a href=\"https://www.aes.com/\" target=\"_blank\">AES Corp</a>., which provides clean energy to the likes of Amazon, Google, and Microsoft—have committed to buying 7 GW of domestic solar panels each year starting in 2024. </p><p>“That could match U.S. demand with U.S. supply,” she says. “But it could also set an example for how supply-demand partnerships are helping to create a self-sufficient domestic market.”</p><p>The big hurdle for the U.S. solar industry to overcome is its supply constraint, says Martinez. The United States has a small number of solar-module manufacturers with limited production capacity. The same applies to polysilicon: a small amount of polysilicon is produced in the country today, but most of it is for electronics, not for solar applications. And while a few U.S. polysilicon companies, such as <a href=\"https://www.recsilicon.com/\" target=\"_blank\">REC Silicon</a>, are increasing production, in response to the IRA, China currently makes more than three-quarters of the world’s polysilicon. </p><p>Polysilicon and module capacity aside, there is no production of silicon ingot, wafer, or solar cells in the United States at all. “In order to have a fully domestic supply, there needs to be increased production capacity across the supply chain,” she says.</p><p>Given these supply-chain issues, Wood Mackenzie and the SEIA don’t expect the full benefits of the IRA to kick in until at least 2024. The SEIA expects the IRA to create new investments in domestic solar module, tracker, inverter, and racking production capacity within the next three years, and investments in solar ingot, wafer, and cell capacity within the next five years. </p><p>Time will tell whether the IRA will boost U.S. solar, says Martinez, but for now it’s still a welcome measure. As Martinez’s colleague Michelle Davis, lead author of the report, put it in a press release: “The Inflation Reduction Act has given the solar industry the most long-term certainty it has ever had.”</p>",
  "pubDate": "Sat, 15 Oct 2022 14:34:34 +0000",
  "guid": "https://spectrum.ieee.org/senate-bill-inflation-reduction-act-solar",
  "category": [
    "Solar manufacturing",
    "Inflation reduction act",
    "China",
    "Solar panels"
  ],
  "dc:creator": "Prachi Patel",
  "media:content": ""
}