{
  "title": "The Edition: Boris’s bunker",
  "link": "https://audioboom.com/posts/8028933",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1969,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: What’s the mood like in Boris’s bunker?</div>\n<div><br>\n</div>\n<div>For this week’s cover story, James Forsyth writes about the defensive bunker mentality inside No. 10 and the PM’s strategy of keeping MPs sweet to hold back a no confidence vote. James joins the podcast along with Spectator Editor Fraser Nelson to discuss.  (00:50)</div>\n<div><br>\n</div>\n<div>Also this week: Have we forgotten how to take a joke?</div>\n<div><br>\n</div>\n<div>Jimmy Carr has caused an online outcry after an off-colour joke from his new show, His Dark Material was clipped and posted without context on social media. Ministers, such as Nadine Dorries and Sajid Javid, have now criticised a comedian for telling a joke. In the Spectator this week both in print and online, two of our writers came to Carr’s defence. The Spectator’s associate editor Douglas Murray joins the podcast, along with Sam Holmes, who is The Spectator’s Podcast Producer by day, and a stand up comedian by night. (11:38)</div>\n<div><br>\n</div>\n<div>And finally: Has Covid permanently changed how people take Communion?<br>\n<br>\n\n</div>\n<div>During the Covid pandemic, churches had to rethink the way they gave communion to their congregations. But will we ever go back to the old normal? Ysenda Maxtone Graham mourns the loss of the tradition of the communal cup in this week's Spectator. She joins the podcast along with Revd Dr Andrew Atherstone, a Tutor in Church History at Wycliffe Hall, Oxford, who has written a study entitled, Drink This, All of You’: Individual Cups at Holy Communion.<em> </em>(21:42)</div>\n<div><br>\n</div>\n<div>Hosted by Lara Prendergast and William Moore</div>\n<div><br>\n</div>\n<div>Produced by Sam Holmes</div>\n<div><br>\n</div>\n<div>Subscribe to The Spectator today and get a £20 Amazon gift voucher:<a href=\"http://www.spectator.co.uk/voucher\">www.spectator.co.uk/voucher</a>\n</div>\n<div><br>\n</div>\n<div>Listen to Lara's food podcast Table Talk: <a href=\"https://www.spectator.co.uk/podcasts/table-talk\">https://www.spectator.co.uk/podcasts/table-talk</a>\n</div>\n",
  "pubDate": "Thu, 10 Feb 2022 10:46:06 +0000",
  "guid": "tag:audioboom.com,2022-02-10:/posts/8028933",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}