{
  "id": "yt:video:w-537G_cn9U",
  "yt:videoId": "w-537G_cn9U",
  "yt:channelId": "UCMTk_R_Y49jvq-HQXDmKI0Q",
  "title": "The Manipulation Of Mini Ladd - A History Of Lies | TRO",
  "link": "",
  "author": {
    "name": "The Right Opinion",
    "uri": "https://www.youtube.com/channel/UCMTk_R_Y49jvq-HQXDmKI0Q"
  },
  "published": "2021-06-02T22:00:01+00:00",
  "updated": "2022-01-08T03:59:08+00:00",
  "media:group": {
    "media:title": "The Manipulation Of Mini Ladd - A History Of Lies | TRO",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The Right Opinion: The Manipulation Of Mini Ladd - A History Of Lies  | TRO\n\n00:00 | Part 1 - Intro\n~\n07:24 | Part 2 - Mini Chadd\n14:13 | Part 3 - Mad Ladd\n21:58 | Part 4 - Mini Gladd\n27:56 | Part 5 - Mini Dadd\n35:20 | Part 6 - Mini Cladd\n42:28 | Part 7 - Mini Fadd\n52:02 | Part 8 - Mini Cadd\n1:01:05 | Part 9 - Mini Sadd\n1:09:08 | Part 10 - His Apology\n1:21:45 | Part 11 - Mini Gadd\n1:30:58 | Part 12 - Mini Ladd\n~\n1:39:23 | Part 13 - Outro & Credits\n\nHello ladies and gentlemen, and welcome to The Right Opinion, the home of a twat with too much free time, and the past, it’s a strange thing, and one that, in times like these, we probably long for more than ever. \n\nAlthough I do relate to this sentiment, more than you can possibly know, I likely wouldn’t take anyone other than the person that I am today, minus the chronic health issues of course. Yes, if we can transpose the current version of ourselves to past scenarios, then that’s the choice that many would probably take, it would have likely saved me, and others, from unnecessary disputes and distress, however, at the same time, without many of those past scenarios, we probably wouldn’t be where we are today. In many ways, it’s a paradoxical conundrum, and the best you can do is be thankful for your present wisdom. \n\nAs internet dwellers we tend not to talk about our possibly tainted backstories too much, because other people have a nature to be quite judgemental, and if that’s not who we are today, then what right do people really have to know. However, it’s almost always important we keep the past in mind, because if not, we may be destined to repeat it, and for many people that’s the last thing we want. With this said, there are some who will repeat it regardless, whether they know it’s wrong or not, and for those individuals, well, we may have to be a bit more vocal in how we reprimand them. This is especially true if those individuals hold a relative amount of influence as say, I don’t know, a YouTuber, with dedicated fans, probably serving as a role model to a fair proportion of them. What about when said drama involves your followers? Well then, let’s discuss today’s topic…\n\nGamers unite, yes, we are once more heading back to that corner of YouTube to set the backdrop for today’s discourse, and we’ll begin by talking about one of the titans of the gaming community, Vanoss.\n\nEvan Fong, also known as VanossGaming, is a creator who posts montage-style content of him and his friends playing a variety of video games, on paper, it sounds fairly unexceptional, but the editing, and interplay between Fong and his comrades has garnered widespread attention from viewers, establishing his channel as a cornerstone in the YouTube gaming subculture that has flourished in the past decade. On his channel, he would feature a retinue of creators who would aid that back-and-forth energy that buoyed his content, this roster would evolve over the years, but one individual who became a pretty regular fixture on the channel during the mid 2010s was a gentleman by the name of Mini Ladd.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}