{
  "title": "British Government Is Scanning All Internet Devices Hosted In UK",
  "link": "https://news.slashdot.org/story/22/11/04/2246214/british-government-is-scanning-all-internet-devices-hosted-in-uk?utm_source=rss1.0mainlinkanon&utm_medium=feed",
  "description": "An anonymous reader quotes a report from BleepingComputer: The United Kingdom's National Cyber Security Centre (NCSC), the government agency that leads the country's cyber security mission, is now scanning all Internet-exposed devices hosted in the UK for vulnerabilities. The goal is to assess UK's vulnerability to cyber-attacks and to help the owners of Internet-connected systems understand their security posture. \"These activities cover any internet-accessible system that is hosted within the UK and vulnerabilities that are common or particularly important due to their high impact,\" the agency said. \"The NCSC uses the data we have collected to create an overview of the UK's exposure to vulnerabilities following their disclosure, and track their remediation over time.\"\n \nNCSC's scans are performed using tools hosted in a dedicated cloud-hosted environment from scanner.scanning.service.ncsc.gov.uk and two IP addresses (18.171.7.246 and 35.177.10.231). The agency says that all vulnerability probes are tested within its own environment to detect any issues before scanning the UK Internet. \"We're not trying to find vulnerabilities in the UK for some other, nefarious purpose,\" NCSC technical director Ian Levy explained. \"We're beginning with simple scans, and will slowly increase the complexity of the scans, explaining what we're doing (and why we're doing it).\" The NCSC says it will \"take steps to remove [any sensitive or personal data] and prevent it from being captured again in the future.\"\n \nBritish organizations can opt out of having their servers scanned by emailing a list of IP addresses they want to be excluded at scanning@ncsc.gov.uk.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=British+Government+Is+Scanning+All+Internet+Devices+Hosted+In+UK%3A+https%3A%2F%2Fbit.ly%2F3fINshg\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F22%2F11%2F04%2F2246214%2Fbritish-government-is-scanning-all-internet-devices-hosted-in-uk%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/22/11/04/2246214/british-government-is-scanning-all-internet-devices-hosted-in-uk?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=22334551&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>",
  "dc:creator": "BeauHD",
  "dc:date": "2022-11-05T13:00:00+00:00",
  "dc:subject": "uk",
  "slash:department": "public-service-announcement",
  "slash:section": "news",
  "slash:comments": 25,
  "slash:hit_parade": "25,25,21,16,5,3,2"
}