{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-6351741081325813620",
  "published": "2020-02-11T00:01:00.000-08:00",
  "updated": "2020-02-11T00:01:01.607-08:00",
  "title": "Safer Internet Day: 5 ways we’re building a safer YouTube",
  "content": "Keeping you and your family safe online is a top priority at YouTube. Today on Safer Internet Day, we’re sharing some of the ways we work to keep YouTube safe, and how you can be more in control of your YouTube experience. From built-in protections to easy-to-use tools, we hope you’ll take advantage of these tips:  <br /><br /><h3>1. Learn more about the content available on YouTube </h3><br />We work hard to maintain a safe community and have <a href=\"https://www.youtube.com/about/policies/#community-guidelines\" target=\"_blank\">guidelines</a> that explain what we allow and don’t allow on YouTube. Most of what we remove is <a href=\"https://transparencyreport.google.com/youtube-policy/removals?hl=en\" target=\"_blank\">first-detected by machines</a>, which means we actually review and remove prohibited content before you ever see it. But no system is perfect, so we make sure if you see something that doesn’t belong on YouTube, you can <a href=\"https://support.google.com/youtube/topic/9387085?hl=en-GB&amp;ref_topic=2803138\" target=\"_blank\">flag it</a> for us and we’ll quickly review it. If you want to know what happened to a video you flagged, just visit your <a href=\"https://www.youtube.com/reporthistory\" target=\"_blank\">reporting history</a> to find out.   <br /><br /><h3>2. Learn more about what data we collect and how to update your privacy settings  </h3><br />Check out <a href=\"https://myaccount.google.com/u/0/yourdata/youtube?hl=en&amp;e=ReorderPrivacyCheckupSteps\" target=\"_blank\">Your Data in YouTube</a> to browse or delete your YouTube activity and learn more about how we use data. Your YouTube privacy settings include managing your search and watch history.  If you prefer more private viewing, you can use Incognito mode on the YouTube mobile app or Chrome browser on your computer. <a href=\"https://support.google.com/youtube/answer/9040743?hl=en\" target=\"_blank\">Learn more.</a><br /><br />You can also take the <a href=\"https://myaccount.google.com/privacycheckup?e=ReorderPrivacyCheckupSteps\" target=\"_blank\">Privacy Checkup</a> and we’ll walk you through key privacy settings step-by-step. For YouTube, you’ll be able to do things like easily pause your <a href=\"https://myactivity.google.com/activitycontrols/youtube?utm_source=retention-promo\" target=\"_blank\">YouTube History</a>, or automatically delete data that may be used for your recommendations.   <br /><br /><h3>3. Check in on your security settings and keep your passwords safe </h3><br />Head over to <a href=\"https://myaccount.google.com/security-checkup?hl=en&amp;e=ReorderPrivacyCheckupSteps\" target=\"_blank\">Security Checkup</a> for personalized recommendations to help protect your data and devices across Google, including YouTube. Here, you can manage which third-party apps have access to your account data and also take the <a href=\"https://passwords.google.com/checkup/start\" target=\"_blank\">Password Checkup</a>, which tells you if any of your passwords are weak and how to change them. In addition, you can access <a href=\"https://passwords.google.com/?ep=1&amp;rapt=AEjHL4NBgnRi808tPRqJiqLcdRrRG1VjZoB5owjGkbfZwymFYNwwqe41cImikbmV13XTKG_Jq5WJTTQ5CgfZUK-we0Ev5JQ3Jg\" target=\"_blank\">Password Manager</a> in your Google Account to help you remember and securely store strong passwords for all your online accounts. <br /><br /><h3>4. Learn more about how ads work and control what ads you see on YouTube </h3><br /><a href=\"https://safety.google/privacy/ads-and-data/\" target=\"_blank\">We do not sell your personal information</a> to anyone, and give you transparency, choice and control over how your information is used as a part of Google. If you’re curious about why you’re seeing an ad, you can click on <a href=\"https://support.google.com/accounts/answer/1634057\" target=\"_blank\">Why this ad</a> for more information. If you no longer find a specific ad relevant, you can choose to block that ad by using the <a href=\"https://support.google.com/ads/answer/2662922\" target=\"_blank\">Mute this ad</a> control. And you can always control the kinds of ads you see, or turn off ads personalization any time in your <a href=\"https://adssettings.google.com/authenticated\" target=\"_blank\">Ad Settings</a>.   <br /><br /><h3>5. Try the YouTube Kids app, built with parental controls </h3><br />We recommend parents use <a href=\"https://www.youtubekids.com/\" target=\"_blank\">YouTube Kids</a> if they plan to allow kids under 13 to watch independently. YouTube Kids is a separate app with family-friendly videos and parental controls. We work hard to keep the videos on YouTube Kids suitable for kids and have recently reduced the number of channels on the app. The app also empowers parents to choose what’s the right experience for their kids and family, such as which content is available for their kids, how long they can use the app for and <a href=\"https://www.youtube.com/kids/\" target=\"_blank\">much more. </a><br /><br />In addition to YouTube Kids, we also recently made <a href=\"https://youtube.googleblog.com/2020/01/better-protecting-kids-privacy-on-YouTube.html\" target=\"_blank\">changes</a> to Made for Kids content on YouTube to better protect children’s privacy.  <br /><br />Finally if you have any questions or feedback, let us know! We are available 24/7 on @TeamYouTube, or you can always check out our <a href=\"https://support.google.com/youtube/community\" target=\"_blank\">YouTube Help Community</a> to learn about the latest announcements. Responsibility is our number one priority, and together with you, we will continue our ongoing efforts to build a safer YouTube.  <br /><br /><i><span style=\"background-color: white; color: #3c4043; font-family: &quot;arial&quot; , sans-serif; font-size: 14px;\">—&nbsp;</span>The YouTube Team </i>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}