{
  "title": "Canada's Cartel Problem with Maxime Bernier",
  "pubDate": "Fri, 17 Feb 2017 21:07:11 +0000",
  "guid": "80142bb8d4ae568c75a990583e70a337",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/Ep45Bernier_EDR.mp3",
  "itunes:image": "",
  "description": "<p>What follows is an edited transcript of my conversation with Maxime Bernier. If you like his ideas, I encourage you to go <a href=\"http://www.maximebernier.com/\" target=\"_blank\">to his website to learn more about them</a>.</p> <hr /> <p><strong>Petersen:</strong> You're listening to Economics Detective Radio. Before we start let me give a quick disclaimer that although today's guest is a politician this show is nonpartisan and doesn't endorse any particular candidate for office. My guest and I are also Canadian so we'll be talking about some Canada-specific issues. I know I have an international audience but sometimes it's fun to learn about what's going on in other countries. So I hope you'll listen nonetheless. And now on to the episode.</p> <p>My guest today is Maxime Bernier, he is the Member of Parliament for Beauce, Quebec and a contender for the Conservative Party leadership race. Maxime, welcome to Economics Detective Radio.</p> <p><strong>Bernier:</strong> Thank you very much for having me.</p> <p><strong>Petersen:</strong> So, our topic today will be Canada's economy and its economic policy. There's a lot to get to on this topic but let's start with the positive. <a href= \"https://www.fraserinstitute.org/studies/economic-freedom-of-the-world-2016-annual-report\" target=\"_blank\">The Fraser Institute's Economic Freedom of the World Index</a> ranks Canada as the fifth freest country in the world, actually tied for fifth. We're well ahead of our neighbors, the Americans, who come in at number 16. So, to start our discussion, Maxime, what is Canada doing right with respect to its economic policy?</p> <p><strong>Bernier:</strong> First of all, I think that this was the ranking that the Fraser Institute did a year ago, if I remember very well, and at that time we had a balanced budget when we were in government and also we were successful in lowering taxes for every Canadian. And I think that's a key when you speak about more freedom you must also have less government and a limited government in Ottawa. And I think that was the goal of the Conservative government when we were in government.</p> <p>And also we have a lot of free trade. That's very important. We signed free-trade agreements with I think, if my memory is good, 45 countries. So, when you have more free trade like that, Canadians are able to buy goods from every country and they are able to also export products. So, that's helping also.</p> <p>More free trade, less government, lower taxes and I think that's a big reason why we are there now.</p> <p><strong>Petersen:</strong> Yeah, there's a pretty general economic freedom, and you mentioned that that ranking came out last year and we have had a change of government recently so let's see if we can keep our high position.</p> <p>But let's move on to some specific areas where we're not so free. Let's start with telecommunications. Canadians have some of the most expensive cell phone bills in the world. You personally did some work in deregulating the telecommunications sector when you were Industry Minister in 2006-2007. Can you talk a little bit about the changes that happened then and where we are now?</p> <p><strong>Bernier:</strong> Yeah, at that time we wanted to deregulate the telecom industry, mostly the regulation that was imposed by the CRTC. We were successful in doing that, and afterwards I think we had a little bit more competition in Canada in telecom.</p> <p>But we didn't have time to also abolish the restriction on foreign investment in telecommunication. And so I think that would be the next step to take to have a bit more competition. And so that's why in my program I have a very strong platform about deregulating and also abolishing the prohibition on foreign investment in telecom and also in the aviation sector. So like that, corporations from outside Canada will be able to invest here in telecom and that will help Canadian consumers, who will have more choices and lower prices. But it was the deregulation that we did---that I did when I was Industry Minister---that was the first part of the deregulation. So now we must go ahead with abolishing the prohibition on foreign investment in telecom.</p> <p><strong>Petersen:</strong> Right. The vast majority of Canadians live right on the border with the United States and if you just step across the border suddenly you can buy a data plan for much less. One thing I was struck by when visiting the United States was that people just watch YouTube videos when they're on their mobile data. And you don't see that in Canada because it's so incredibly expensive. So, I wouldn't be surprised if we allow the American companies to sell to us if we wouldn't get exactly the same plan they're getting which would be great.</p> <p><strong>Bernier:</strong> Yes, I just want to add that Verizon, I think they wanted to come to Canada but they were not able to. They had created a Canadian corporation and all that and at the end, they decided not to come to Canada like their operations in the US. So, I think that will be a big step if we are successful in abolishing the restriction on foreign investments. That would make a difference for Canadian consumers.</p> <p><strong>Petersen:</strong> So, we have a similar issue with the airlines. It's very, very expensive to make a domestic flight within Canada, for instance, flying Vancouver to Toronto is about twice as much as flying L.A. to New York even though they are similar distances. So, do you want to comment on that situation? We only have the two airlines West-Jet and Air Canada. Could that be similarly fixed?</p> <p><strong>Bernier:</strong> Yes, you're absolutely right. If you want to fly from Canada to another country it is still competitive, but if you want to fly in Canada, inside the country, from example Montreal to Toronto, or other cities like that, it is very expensive. Because, like you said, we have only two main carriers in Canada: West-Jet and Air Canada. And we don't have like other countries a low-cost carrier.</p> <p>So, we need to have one and I know that some business entrepreneurs want to create one low-cost carrier but their funding, their capital it's coming from the U.S. and from U.K. And you still have the same things in aviation, we have a restriction on foreign investment coming from other countries. So, that's why we must abolish that and like that we'll have a low-cost carrier and that will compete against Air Canada and West-Jet. That adds more competition, more choice and at the end lower prices.</p> <p>So, I know that the Federal Government and the Minister of Transport, they're looking at it right now because these entrepreneurs want to create that corporation, a low-cost carrier. And they're ready for that. They're looking at it right now so, I hope they will abolish that but I'm not so sure. This is why for me, I have a platform that is based on more freedom and less government and it will be always good for Canadians. That is why I'm pushing that very hard, I wrote to the Minister about that to be sure that they will abolish foreign restriction in the investment in the aviation sector.</p> <p>I don't know if they will do it but if not I will do it when I will be the leader of the party and Prime Minister.</p> <p><strong>Petersen:</strong> Yes, I hope you succeed in that. This one is a particularly important one because if airfare is expensive then more people drive and driving is statistically much more dangerous. So, you have more highway fatalities. I personally drove over 1,200 kilometers to visit family over Christmas. So, I'd really love to have an option to fly cheaply but it's just out of reach at our current airfare prices.</p> <p>We also have a problem here in Canada, a similar related problem with cartels. We tend to create cartels in a lot of industries and we have one set of policies called Supply Management that applies to poultry, dairy products, even maple syrup (which is very quintessentially Canadian) keeping these prices artificially high. So, could you talk a bit about Supply Management for those who maybe haven't heard of it?</p> <p><strong>Bernier:</strong> Yes, Supply Management it is a legal cartel for dairy, poultry and eggs and the like. The producers on the Supply Management are able to fix high prices for these products and they are fixing the production also. That's why it's a cartel, they're fixing the production for the Canadian market and they are fixing the price, every year they increase the price of these products.</p> <p>So, I am the only candidate for the leadership of the Conservative Party of Canada and also the only member of Parliament who's speaking for Canadian consumers and that wants them to save $2.6 billion every year. Because that's the cost of keeping that cartel and for a family the cost is $500 every year. I want them to be able to buy poultry, eggs, and milk from other countries---they want to export that---but because we have tariffs at the border of 300% on products coming from other countries to be sure that the dairy producer in Canada will be able to fix high prices for their products.</p> <p>So, for me, if you believe in a free market you must abolish that and I don't want to do work for 19,000 farmers that are on Supply Management, I want to work with 35 million Canadians. And I think that's the most important for me and actually, the farmers just represent 10% of the farmers and all the other farmers in Canada, like the beef producers and all the other farmers are not on the Supply Management, they are operating in a free market. So, it is not fair and to be fair we need to abolish that but because as a special interest group they are very powerful and they're very well connected with the politicians, they were able to keep that privilege for a very long time and I think now it's time to speak for Canadian consumers and that's what I'm doing so I hope to be successful with that.</p> <p><strong>Petersen:</strong> Ironically Facebook has been serving me advertisements from the Canadian milk producers and their tagline or slogan is Canadian milk is worth crying over, or spilt Canadian milk is worth crying over, or something like that. And the irony is that if they supply too much milk, because of Supply Management they actually have to dump it to keep the price high. So it is really just wasting perfectly good milk and poultry.</p> <p><strong>Bernier:</strong> Yes. If they produce too much they cannot export their surplus because it's a subsidized milk. So that's why it's bad for them. They are producing good products, good milk, good dairy, good poultry, and eggs and I want them to be able to export their products to other countries and right now on Supply Management they can't because they have the responsibility and the obligation to produce only for the Canadian market.</p> <p><strong>Petersen:</strong> You mentioned the 300% border tariff on U.S. dairy. I think in the U.S. they have a different policy where they actually subsidize it and keep the price artificially low. But we had <a href= \"http://www.npr.org/sections/thetwo-way/2012/09/27/161917296/cheese-smuggling-ring-is-brought-down-in-canda\" target=\"_blank\">this strange situation a few years back where Canadian pizzerias were smuggling in black market mozzarella over the border and got caught</a>. You shouldn't have to smuggle mozzarella cheese. If we had a free market, there would just be one price for mozzarella cheese and you wouldn't get a benefit by smuggling it.</p> <p>You mentioned that you're really the only one calling for an end to this Supply Management policy and yet our Prime Minister for almost a decade, Stephen Harper, has a Master's degree in economics. He must have known that this policy was not good for Canadians. And most of the MPs are smart people, they must realize it, but is it as simple as the cartels themselves just making big donations and buying protection for this policy?</p> <p><strong>Bernier:</strong> First of all, you're right, when we were in government that was the policy of our government to keep that cartel, that Supply Management system. All the members of the Conservative Party of Canada voted in 2004 in a convention to protect these farmers and after that when we were in government in 2006-2007, that was the policy of the government, and that was the policy of the government until the end, until 2015.</p> <p>And I think that at that time we didn't want to displease the cartel and that special interest group. And I tried to fight for that on the cabinet table but I wasn't successful. Most importantly, I think now I'm able to do it and I will ask---if I'm the leader of the Conservative Party---I will ask the members to decide on that and to review their policy statement that they did more than 12 years ago, and I hope the members will abolish that and they will believe in a free market also for producers on Supply Management.</p> <p><strong>Petersen:</strong> Have the supply managed industries been pushing back against you? Have they been taking out ads or funding your opponents? How are they trying to protect their cartel status?</p> <p><strong>Bernier:</strong> For sure. It's an important cartel in Quebec and in Ontario, they want to do everything for Maxime Bernier to not be elected. And so I think they are buying memberships to vote for the leadership of our party to be able to vote because, as you know, you need to be a member.</p> <p>If you want to be a member and support my candidacy you can go on <a href=\"http://www.maximebernier.com/\" target=\"_blank\">my website www.maximebernier.com</a> and you'll be able to become a member for only $15. But, yes, the dairy producers are working to be sure that I won't be elected.</p> <p>But there's more Canadians than dairy producers. So, I'm working hard to be sure to be successful because they want to keep their privilege and we'll see what will happen. And it's easy for them because I'm the only candidate who wants to abolish that and speaking for Canadian consumers, so they can vote for all the other candidates and they will have somebody who will support their special interest.</p> <p><strong>Petersen:</strong> I hope you succeed. And you're right there are more Canadians than supply managed firms or farmers that benefit from this particular policy. But you have this issue of the cost being dispersed and so although there are fewer farmers who benefit from the cartel and from Supply Management there may be a lot more motivated per capita. So, I hope you can succeed in getting over that, sort of, public choice hurdle. But my cynicism kind of says that it's an uphill battle.</p> <p><strong>Bernier:</strong> Absolutely. But also, I must say that the other farmers that are not on Supply Management, they have a huge interest also for that cartel to be abolished because it's not fair for them. Each time Canada is negotiating a free trade agreement with another country they have access, for example, Canadian beef will have access to the other country's market, but they won't have the full access because we're not giving full access to their milk, poultry, and eggs. So at the end, they are paying a little bit for that and they don't have the access that they would have otherwise. And they understand that. So the other farmers that are not on Supply Management have the interest to be sure that we have all these steps that can counterbalance the special interest group.</p> <p><strong>Petersen:</strong> I wonder about that because if beef and poultry are substitutes then you would think that the beef producers would want their competitor to have higher prices than they do so people would maybe buy more beef. But there is the issue of the international agreements.</p> <p>You've called for the privatization of Canada Post and the removal of its monopoly on letter mail. That's another area where Canadians pay more, not just for letters but also parcels shipping to and from and within Canada is much more expensive than it is in the United States and other places. So could you talk about what the legal status of Canada Post is and what both parcel shipping and regular mail are, what the legal status of both of those is?</p> <p><strong>Bernier:</strong> Yes, you're absolutely right. Canada Post is a state-owned enterprise and I think in 2017 we must do like other countries and privatized that. They are charging at a huge cost because they are not competitive, they have huge expenses and they're not so efficient.</p> <p>So, my thinking about that is, these are not services that Canadians need to be delivered by a government entity. We have a private sector for delivery and I think that it is not an essential service for Canadians any more. And they are using Canada Post less and less with emails and all that, and so we must do like in Belgium, like in U.K., like in France and privatized it.</p> <p>Also, they're charging very high prices for their products. So, if we have more competition, that will help and at the end that's the solution. But they want to keep that and for me if you want to speak for Canadian consumers you must go ahead and do that reform, that's my proposal.</p> <p><strong>Petersen:</strong> Yes, it's such a big issue because in other countries that have much cheaper shipping, people are opened up to the whole global marketplace, you don't have to go to your local store to buy any particular good, you can buy it online and have it shipped to you. But for Canadians, you're adding $10-$15 to the price and so Canadians aren't really online buying things nearly as much as, for instance, our neighbors the Americans.</p> <p>And when Canadians want to run online businesses and maybe ship things to other people to stay competitive they often have to drive across the border and ship from the United States because it is just so much cheaper.</p> <p>And Canada Post has a legal monopoly on letter mail which is a little bit odd. Why should one particular government entity have the legal right to ship our mail? It's kind of an odd historical anomaly that we could be rid of.</p> <p><strong>Bernier:</strong> And you have to think the price also. It's not a free market. It is them who are fixing the price because, like you said, they have a legal monopoly. That's what I want to do, I want to be sure that we can have competition there.</p> <p><strong>Petersen:</strong> You've also called for reducing trade restrictions within Canada. This is one of those things that is so odd, is that we're one country, ten provinces, but we restrict many goods from being shipped within our own country across borders. So for instance alcohol. If you have a craft brewery or a winery in British Columbia it's very hard to ship it to even Alberta right next door. Can you talk about some of the internal trade restrictions that we have in Canada?</p> <p><strong>Bernier:</strong> Yes. We have a lot of them in these kinds of industries, but for me it is a bit of a shame that after 150 years we don't have an economy of exchange in Canada, because that was the goal of the Fathers of our Constitution. The fathers of our country, they wanted to have an economic union and we don't have that because of some restrictions, legislation, and regulation by provinces.</p> <p>So, my goal is to be sure that we'll have an economic union. And to do that, it's against the Constitution and so I want to be sure to have a team in Ottawa of civil servants that will look at all the regulations and the legislations that are imposed by provinces and to bring provinces in front of the court when they don't respect the Constitution. Nobody has had the courage to do that and I think it's time to do it. And that will be the only solution because I cannot change the legislation or regulation at the provincial level and at the federal level we must respect the Constitution.</p> <p>But I can assure Canadians that we'll do everything for the provinces to respect the Constitution. That's why we're going to bring the province in front of the court and the court will decide if it's constitutional or not. And I think it won't be because it's clear in the Constitution that we must be able to sell and buy goods from any province in Canada. That would be the solution. Because if you ask the provinces to do that, they have the problem and they cannot find the solution. So, that's why every year you have a meeting with the premier at the provincial level and they're saying, you know, we will abolish trade barriers and all that and it is not happening.</p> <p>And they're the problem and they're not able to do that. They want to protect their own little market it is not good for Canadians, so we must do something at the federal level and that's what I want to do. I want to do a strong analysis of every regulation, legislation that provinces are imposing, legislations that are against free trade and after that bring them in court and the court will decide. And in the end I'm sure it will be unconstitutional and maybe when you do that, in five years after that, you have a real economic union in Canada like the fathers of our Constitution wanted.</p> <p><strong>Petersen:</strong> Yes. One wonders what is even the point of having a country if you're not going to have at least free trade within your borders? That seems to be the main benefit of all confederating and joining into one country instead of being 10 smaller countries.</p> <p>Do you have any concluding thoughts, anything we didn't cover that you'd like to say?</p> <p><strong>Bernier:</strong> First of all I want to thank you for giving me that opportunity to speak with your people and if they want to know a little a bit more about our economic policy, they can go on <a href=\"http://www.maximebernier.com/\" target= \"_blank\">my website www.maximebernier.com</a>. Everything is there and I'm very proud of our platform. It's a platform that is based on individual freedom, personal responsibility, respect, and fairness and it is a platform that is based on real conservative values and the values of Western Civilization. So, if people like that they can become a member and they can vote for the leadership. I appreciate that you gave me this opportunity and maybe another time we can go on and speak about other economic issues.</p> <p><strong>Petersen:</strong> My guest today has been Maxime Bernier. Maxime, thanks for being part of Economics Detective Radio.</p> <p><strong>Bernier:</strong> Thank you very much and have a nice day.</p> <hr /> <p> </p>",
  "content:encoded": "<p>What follows is an edited transcript of my conversation with Maxime Bernier. If you like his ideas, I encourage you to go <a href=\"http://www.maximebernier.com/\" target=\"_blank\">to his website to learn more about them</a>.</p>  <p>Petersen: You're listening to Economics Detective Radio. Before we start let me give a quick disclaimer that although today's guest is a politician this show is nonpartisan and doesn't endorse any particular candidate for office. My guest and I are also Canadian so we'll be talking about some Canada-specific issues. I know I have an international audience but sometimes it's fun to learn about what's going on in other countries. So I hope you'll listen nonetheless. And now on to the episode.</p> <p>My guest today is Maxime Bernier, he is the Member of Parliament for Beauce, Quebec and a contender for the Conservative Party leadership race. Maxime, welcome to Economics Detective Radio.</p> <p>Bernier: Thank you very much for having me.</p> <p>Petersen: So, our topic today will be Canada's economy and its economic policy. There's a lot to get to on this topic but let's start with the positive. <a href= \"https://www.fraserinstitute.org/studies/economic-freedom-of-the-world-2016-annual-report\" target=\"_blank\">The Fraser Institute's Economic Freedom of the World Index</a> ranks Canada as the fifth freest country in the world, actually tied for fifth. We're well ahead of our neighbors, the Americans, who come in at number 16. So, to start our discussion, Maxime, what is Canada doing right with respect to its economic policy?</p> <p>Bernier: First of all, I think that this was the ranking that the Fraser Institute did a year ago, if I remember very well, and at that time we had a balanced budget when we were in government and also we were successful in lowering taxes for every Canadian. And I think that's a key when you speak about more freedom you must also have less government and a limited government in Ottawa. And I think that was the goal of the Conservative government when we were in government.</p> <p>And also we have a lot of free trade. That's very important. We signed free-trade agreements with I think, if my memory is good, 45 countries. So, when you have more free trade like that, Canadians are able to buy goods from every country and they are able to also export products. So, that's helping also.</p> <p>More free trade, less government, lower taxes and I think that's a big reason why we are there now.</p> <p>Petersen: Yeah, there's a pretty general economic freedom, and you mentioned that that ranking came out last year and we have had a change of government recently so let's see if we can keep our high position.</p> <p>But let's move on to some specific areas where we're not so free. Let's start with telecommunications. Canadians have some of the most expensive cell phone bills in the world. You personally did some work in deregulating the telecommunications sector when you were Industry Minister in 2006-2007. Can you talk a little bit about the changes that happened then and where we are now?</p> <p>Bernier: Yeah, at that time we wanted to deregulate the telecom industry, mostly the regulation that was imposed by the CRTC. We were successful in doing that, and afterwards I think we had a little bit more competition in Canada in telecom.</p> <p>But we didn't have time to also abolish the restriction on foreign investment in telecommunication. And so I think that would be the next step to take to have a bit more competition. And so that's why in my program I have a very strong platform about deregulating and also abolishing the prohibition on foreign investment in telecom and also in the aviation sector. So like that, corporations from outside Canada will be able to invest here in telecom and that will help Canadian consumers, who will have more choices and lower prices. But it was the deregulation that we did---that I did when I was Industry Minister---that was the first part of the deregulation. So now we must go ahead with abolishing the prohibition on foreign investment in telecom.</p> <p>Petersen: Right. The vast majority of Canadians live right on the border with the United States and if you just step across the border suddenly you can buy a data plan for much less. One thing I was struck by when visiting the United States was that people just watch YouTube videos when they're on their mobile data. And you don't see that in Canada because it's so incredibly expensive. So, I wouldn't be surprised if we allow the American companies to sell to us if we wouldn't get exactly the same plan they're getting which would be great.</p> <p>Bernier: Yes, I just want to add that Verizon, I think they wanted to come to Canada but they were not able to. They had created a Canadian corporation and all that and at the end, they decided not to come to Canada like their operations in the US. So, I think that will be a big step if we are successful in abolishing the restriction on foreign investments. That would make a difference for Canadian consumers.</p> <p>Petersen: So, we have a similar issue with the airlines. It's very, very expensive to make a domestic flight within Canada, for instance, flying Vancouver to Toronto is about twice as much as flying L.A. to New York even though they are similar distances. So, do you want to comment on that situation? We only have the two airlines West-Jet and Air Canada. Could that be similarly fixed?</p> <p>Bernier: Yes, you're absolutely right. If you want to fly from Canada to another country it is still competitive, but if you want to fly in Canada, inside the country, from example Montreal to Toronto, or other cities like that, it is very expensive. Because, like you said, we have only two main carriers in Canada: West-Jet and Air Canada. And we don't have like other countries a low-cost carrier.</p> <p>So, we need to have one and I know that some business entrepreneurs want to create one low-cost carrier but their funding, their capital it's coming from the U.S. and from U.K. And you still have the same things in aviation, we have a restriction on foreign investment coming from other countries. So, that's why we must abolish that and like that we'll have a low-cost carrier and that will compete against Air Canada and West-Jet. That adds more competition, more choice and at the end lower prices.</p> <p>So, I know that the Federal Government and the Minister of Transport, they're looking at it right now because these entrepreneurs want to create that corporation, a low-cost carrier. And they're ready for that. They're looking at it right now so, I hope they will abolish that but I'm not so sure. This is why for me, I have a platform that is based on more freedom and less government and it will be always good for Canadians. That is why I'm pushing that very hard, I wrote to the Minister about that to be sure that they will abolish foreign restriction in the investment in the aviation sector.</p> <p>I don't know if they will do it but if not I will do it when I will be the leader of the party and Prime Minister.</p> <p>Petersen: Yes, I hope you succeed in that. This one is a particularly important one because if airfare is expensive then more people drive and driving is statistically much more dangerous. So, you have more highway fatalities. I personally drove over 1,200 kilometers to visit family over Christmas. So, I'd really love to have an option to fly cheaply but it's just out of reach at our current airfare prices.</p> <p>We also have a problem here in Canada, a similar related problem with cartels. We tend to create cartels in a lot of industries and we have one set of policies called Supply Management that applies to poultry, dairy products, even maple syrup (which is very quintessentially Canadian) keeping these prices artificially high. So, could you talk a bit about Supply Management for those who maybe haven't heard of it?</p> <p>Bernier: Yes, Supply Management it is a legal cartel for dairy, poultry and eggs and the like. The producers on the Supply Management are able to fix high prices for these products and they are fixing the production also. That's why it's a cartel, they're fixing the production for the Canadian market and they are fixing the price, every year they increase the price of these products.</p> <p>So, I am the only candidate for the leadership of the Conservative Party of Canada and also the only member of Parliament who's speaking for Canadian consumers and that wants them to save $2.6 billion every year. Because that's the cost of keeping that cartel and for a family the cost is $500 every year. I want them to be able to buy poultry, eggs, and milk from other countries---they want to export that---but because we have tariffs at the border of 300% on products coming from other countries to be sure that the dairy producer in Canada will be able to fix high prices for their products.</p> <p>So, for me, if you believe in a free market you must abolish that and I don't want to do work for 19,000 farmers that are on Supply Management, I want to work with 35 million Canadians. And I think that's the most important for me and actually, the farmers just represent 10% of the farmers and all the other farmers in Canada, like the beef producers and all the other farmers are not on the Supply Management, they are operating in a free market. So, it is not fair and to be fair we need to abolish that but because as a special interest group they are very powerful and they're very well connected with the politicians, they were able to keep that privilege for a very long time and I think now it's time to speak for Canadian consumers and that's what I'm doing so I hope to be successful with that.</p> <p>Petersen: Ironically Facebook has been serving me advertisements from the Canadian milk producers and their tagline or slogan is Canadian milk is worth crying over, or spilt Canadian milk is worth crying over, or something like that. And the irony is that if they supply too much milk, because of Supply Management they actually have to dump it to keep the price high. So it is really just wasting perfectly good milk and poultry.</p> <p>Bernier: Yes. If they produce too much they cannot export their surplus because it's a subsidized milk. So that's why it's bad for them. They are producing good products, good milk, good dairy, good poultry, and eggs and I want them to be able to export their products to other countries and right now on Supply Management they can't because they have the responsibility and the obligation to produce only for the Canadian market.</p> <p>Petersen: You mentioned the 300% border tariff on U.S. dairy. I think in the U.S. they have a different policy where they actually subsidize it and keep the price artificially low. But we had <a href= \"http://www.npr.org/sections/thetwo-way/2012/09/27/161917296/cheese-smuggling-ring-is-brought-down-in-canda\" target=\"_blank\">this strange situation a few years back where Canadian pizzerias were smuggling in black market mozzarella over the border and got caught</a>. You shouldn't have to smuggle mozzarella cheese. If we had a free market, there would just be one price for mozzarella cheese and you wouldn't get a benefit by smuggling it.</p> <p>You mentioned that you're really the only one calling for an end to this Supply Management policy and yet our Prime Minister for almost a decade, Stephen Harper, has a Master's degree in economics. He must have known that this policy was not good for Canadians. And most of the MPs are smart people, they must realize it, but is it as simple as the cartels themselves just making big donations and buying protection for this policy?</p> <p>Bernier: First of all, you're right, when we were in government that was the policy of our government to keep that cartel, that Supply Management system. All the members of the Conservative Party of Canada voted in 2004 in a convention to protect these farmers and after that when we were in government in 2006-2007, that was the policy of the government, and that was the policy of the government until the end, until 2015.</p> <p>And I think that at that time we didn't want to displease the cartel and that special interest group. And I tried to fight for that on the cabinet table but I wasn't successful. Most importantly, I think now I'm able to do it and I will ask---if I'm the leader of the Conservative Party---I will ask the members to decide on that and to review their policy statement that they did more than 12 years ago, and I hope the members will abolish that and they will believe in a free market also for producers on Supply Management.</p> <p>Petersen: Have the supply managed industries been pushing back against you? Have they been taking out ads or funding your opponents? How are they trying to protect their cartel status?</p> <p>Bernier: For sure. It's an important cartel in Quebec and in Ontario, they want to do everything for Maxime Bernier to not be elected. And so I think they are buying memberships to vote for the leadership of our party to be able to vote because, as you know, you need to be a member.</p> <p>If you want to be a member and support my candidacy you can go on <a href=\"http://www.maximebernier.com/\" target=\"_blank\">my website www.maximebernier.com</a> and you'll be able to become a member for only $15. But, yes, the dairy producers are working to be sure that I won't be elected.</p> <p>But there's more Canadians than dairy producers. So, I'm working hard to be sure to be successful because they want to keep their privilege and we'll see what will happen. And it's easy for them because I'm the only candidate who wants to abolish that and speaking for Canadian consumers, so they can vote for all the other candidates and they will have somebody who will support their special interest.</p> <p>Petersen: I hope you succeed. And you're right there are more Canadians than supply managed firms or farmers that benefit from this particular policy. But you have this issue of the cost being dispersed and so although there are fewer farmers who benefit from the cartel and from Supply Management there may be a lot more motivated per capita. So, I hope you can succeed in getting over that, sort of, public choice hurdle. But my cynicism kind of says that it's an uphill battle.</p> <p>Bernier: Absolutely. But also, I must say that the other farmers that are not on Supply Management, they have a huge interest also for that cartel to be abolished because it's not fair for them. Each time Canada is negotiating a free trade agreement with another country they have access, for example, Canadian beef will have access to the other country's market, but they won't have the full access because we're not giving full access to their milk, poultry, and eggs. So at the end, they are paying a little bit for that and they don't have the access that they would have otherwise. And they understand that. So the other farmers that are not on Supply Management have the interest to be sure that we have all these steps that can counterbalance the special interest group.</p> <p>Petersen: I wonder about that because if beef and poultry are substitutes then you would think that the beef producers would want their competitor to have higher prices than they do so people would maybe buy more beef. But there is the issue of the international agreements.</p> <p>You've called for the privatization of Canada Post and the removal of its monopoly on letter mail. That's another area where Canadians pay more, not just for letters but also parcels shipping to and from and within Canada is much more expensive than it is in the United States and other places. So could you talk about what the legal status of Canada Post is and what both parcel shipping and regular mail are, what the legal status of both of those is?</p> <p>Bernier: Yes, you're absolutely right. Canada Post is a state-owned enterprise and I think in 2017 we must do like other countries and privatized that. They are charging at a huge cost because they are not competitive, they have huge expenses and they're not so efficient.</p> <p>So, my thinking about that is, these are not services that Canadians need to be delivered by a government entity. We have a private sector for delivery and I think that it is not an essential service for Canadians any more. And they are using Canada Post less and less with emails and all that, and so we must do like in Belgium, like in U.K., like in France and privatized it.</p> <p>Also, they're charging very high prices for their products. So, if we have more competition, that will help and at the end that's the solution. But they want to keep that and for me if you want to speak for Canadian consumers you must go ahead and do that reform, that's my proposal.</p> <p>Petersen: Yes, it's such a big issue because in other countries that have much cheaper shipping, people are opened up to the whole global marketplace, you don't have to go to your local store to buy any particular good, you can buy it online and have it shipped to you. But for Canadians, you're adding $10-$15 to the price and so Canadians aren't really online buying things nearly as much as, for instance, our neighbors the Americans.</p> <p>And when Canadians want to run online businesses and maybe ship things to other people to stay competitive they often have to drive across the border and ship from the United States because it is just so much cheaper.</p> <p>And Canada Post has a legal monopoly on letter mail which is a little bit odd. Why should one particular government entity have the legal right to ship our mail? It's kind of an odd historical anomaly that we could be rid of.</p> <p>Bernier: And you have to think the price also. It's not a free market. It is them who are fixing the price because, like you said, they have a legal monopoly. That's what I want to do, I want to be sure that we can have competition there.</p> <p>Petersen: You've also called for reducing trade restrictions within Canada. This is one of those things that is so odd, is that we're one country, ten provinces, but we restrict many goods from being shipped within our own country across borders. So for instance alcohol. If you have a craft brewery or a winery in British Columbia it's very hard to ship it to even Alberta right next door. Can you talk about some of the internal trade restrictions that we have in Canada?</p> <p>Bernier: Yes. We have a lot of them in these kinds of industries, but for me it is a bit of a shame that after 150 years we don't have an economy of exchange in Canada, because that was the goal of the Fathers of our Constitution. The fathers of our country, they wanted to have an economic union and we don't have that because of some restrictions, legislation, and regulation by provinces.</p> <p>So, my goal is to be sure that we'll have an economic union. And to do that, it's against the Constitution and so I want to be sure to have a team in Ottawa of civil servants that will look at all the regulations and the legislations that are imposed by provinces and to bring provinces in front of the court when they don't respect the Constitution. Nobody has had the courage to do that and I think it's time to do it. And that will be the only solution because I cannot change the legislation or regulation at the provincial level and at the federal level we must respect the Constitution.</p> <p>But I can assure Canadians that we'll do everything for the provinces to respect the Constitution. That's why we're going to bring the province in front of the court and the court will decide if it's constitutional or not. And I think it won't be because it's clear in the Constitution that we must be able to sell and buy goods from any province in Canada. That would be the solution. Because if you ask the provinces to do that, they have the problem and they cannot find the solution. So, that's why every year you have a meeting with the premier at the provincial level and they're saying, you know, we will abolish trade barriers and all that and it is not happening.</p> <p>And they're the problem and they're not able to do that. They want to protect their own little market it is not good for Canadians, so we must do something at the federal level and that's what I want to do. I want to do a strong analysis of every regulation, legislation that provinces are imposing, legislations that are against free trade and after that bring them in court and the court will decide. And in the end I'm sure it will be unconstitutional and maybe when you do that, in five years after that, you have a real economic union in Canada like the fathers of our Constitution wanted.</p> <p>Petersen: Yes. One wonders what is even the point of having a country if you're not going to have at least free trade within your borders? That seems to be the main benefit of all confederating and joining into one country instead of being 10 smaller countries.</p> <p>Do you have any concluding thoughts, anything we didn't cover that you'd like to say?</p> <p>Bernier: First of all I want to thank you for giving me that opportunity to speak with your people and if they want to know a little a bit more about our economic policy, they can go on <a href=\"http://www.maximebernier.com/\" target= \"_blank\">my website www.maximebernier.com</a>. Everything is there and I'm very proud of our platform. It's a platform that is based on individual freedom, personal responsibility, respect, and fairness and it is a platform that is based on real conservative values and the values of Western Civilization. So, if people like that they can become a member and they can vote for the leadership. I appreciate that you gave me this opportunity and maybe another time we can go on and speak about other economic issues.</p> <p>Petersen: My guest today has been Maxime Bernier. Maxime, thanks for being part of Economics Detective Radio.</p> <p>Bernier: Thank you very much and have a nice day.</p>  <p> </p>",
  "enclosure": "",
  "itunes:duration": "26:43",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What follows is an edited transcript of my conversation with Maxime Bernier. If you like his ideas, I encourage you to go .  Petersen: You're listening to Economics Detective Radio. Before we start let me give a quick disclaimer that although today's..."
}