{
  "title": "Colin Ware on cognition",
  "link": "https://medriscoll.com/2016/01/30/thinking-is-not-something-that-goes-on-entirely/",
  "comments": "https://medriscoll.com/2016/01/30/thinking-is-not-something-that-goes-on-entirely/#respond",
  "dc:creator": "Michael Driscoll",
  "pubDate": "Sat, 30 Jan 2016 16:21:03 +0000",
  "category": "Uncategorized",
  "guid": "https://medriscoll.com/2016/01/30/thinking-is-not-something-that-goes-on-entirely/",
  "description": "<p>Thinking is not something that goes on entirely, or even mostly, inside people’s heads. Little intellectual work is accomplished with our eyes and ears closed. Most cognition is done as a kind of interaction with cognitive tools, pencils and paper, calculators, and, increasingly, computer-based intellectual supports and information systems. Neither is cognition mostly accomplished alone<a class=\"more-link\" href=\"https://medriscoll.com/2016/01/30/thinking-is-not-something-that-goes-on-entirely/\">Continue reading <span class=\"screen-reader-text\">\"Colin Ware on cognition\"</span></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://medriscoll.com/2016/01/30/thinking-is-not-something-that-goes-on-entirely/\">Colin Ware on cognition</a> appeared first on <a rel=\"nofollow\" href=\"https://medriscoll.com\">m. e. driscoll</a>.</p>\n",
  "content:encoded": "\n<blockquote class=\"wp-block-quote long\"><p>Thinking is not something that goes on entirely, or even mostly, inside people’s heads. Little intellectual work is accomplished with our eyes and ears closed. Most cognition is done as a kind of interaction with cognitive tools, pencils and paper, calculators, and, increasingly, computer-based intellectual supports and information systems. Neither is cognition mostly accomplished alone with a computer. It occurs as a process in systems containing many people and many cognitive tools. Since the beginning of science, diagrams, mathematical notations, and writing have been essential tools of the scientist. Now we have powerful interactive analytic tools, such as MATLAB, Maple, Mathematica, and S-PLUS, together with databases. The entire fields of genomics and proteomics are built on computer storage and analytic tools.</p><cite>Colin Ware.&nbsp;<em>Information Visualization: Perception for Design.</em></cite></blockquote>\n<p>The post <a rel=\"nofollow\" href=\"https://medriscoll.com/2016/01/30/thinking-is-not-something-that-goes-on-entirely/\">Colin Ware on cognition</a> appeared first on <a rel=\"nofollow\" href=\"https://medriscoll.com\">m. e. driscoll</a>.</p>\n",
  "wfw:commentRss": "https://medriscoll.com/2016/01/30/thinking-is-not-something-that-goes-on-entirely/feed/",
  "slash:comments": 0,
  "post-id": 67
}