{
  "title": "Nanosensors target enzymes to monitor and study cancer",
  "link": "https://news.mit.edu/2022/nanosensors-target-enzymes-monitor-and-study-cancer-1102",
  "description": "By analyzing enzyme activity at the organism, tissue, and cellular scales, new sensors could provide new tools to clinicians and cancer researchers.",
  "pubDate": "Wed, 02 Nov 2022 15:00:00 -0400",
  "guid": "https://news.mit.edu/2022/nanosensors-target-enzymes-monitor-and-study-cancer-1102",
  "dc:creator": "Bendta Schroeder | Erika Reinfeld | Koch Institute",
  "content:encoded": "<p>Cancer is characterized by a number of key biological processes known as the “hallmarks of cancer,” which remodel cells and their immediate environment so that tumors can form, grow, and thrive. Many of these changes are mediated by specific genes and proteins, working in tandem with other cellular processes, but the specifics vary from cancer type to cancer type, and even from patient to patient.</p>\n\n<p>Sensitive tools for measuring protein or gene expression, even on the single cell level, have helped researchers understand the different cell types present in a tumor’s microenvironment and how this composition changes after treatments. However, these assays don’t necessarily show which proteins are active or relevant to tumor progression, or allow clinicians to noninvasively monitor the progress of the disease or its response to treatment. A protein could be present in a cancer cell as a bystander, for example, but not an active participant in its cellular transformations. Enzymes, which catalyze biochemical reactions inside cells, may give a clearer picture of which genes or proteins to target at a particular time.</p>\n\n<p>In work <a href=\"https://www.nature.com/articles/s41467-022-32988-5\" target=\"_blank\">recently published in <em>Nature Communications</em></a>, researchers from the MIT Koch Institute for Integrative Cancer Research have developed a set of enzyme-targeting nanoscale tools to monitor cancer progression and treatment response in real time, map enzyme activity to precise locations within a tumor, and isolate relevant cell populations for analysis.</p>\n\n<p>“We hope that this new suite of tools can be useful in the clinic and the lab alike,” says Sangeeta Bhatia, the John J. and Dorothy Wilson Professor of Health Sciences and Technology, professor of electrical engineering the computer science, and senior author of the study. “With further development, the nanosensors could be used by clinicians to tailor treatments to a patient’s specific cancer, and to monitor cancer progression and treatment response, while researchers could use them to better understand the molecular biology of cancer and develop new tools to diagnose, track, and treat the disease.”</p>\n\n<p>Bhatia is also a member of MIT’s Koch Institute for Integrative Cancer Research and Institute for Medical Engineering and Science. The study, conducted in collaboration with the laboratory of Tyler Jacks, was led by Ava Amini (Soleimany) ’16, a former graduate student from the Bhatia laboratory; and postdoc Jesse Kirkpatrick, also from the Bhatia lab.</p>\n\n<p><strong>Tracking tumors in real time</strong></p>\n\n<p>For several years, the Bhatia laboratory has been developing noninvasive urine tests for the detection of cancer, including colon, <a href=\"https://news.mit.edu/2017/new-technology-detect-tiny-ovarian-tumors-0410\">ovarian</a>, and <a href=\"https://news.mit.edu/2020/urine-sensor-test-detect-lung-tumors-0401\">lung</a> cancer. The tests rely on <a href=\"https://news.mit.edu/2014/a-paper-diagnostic-for-cancer-0224\">nanoparticles</a> that interact with tumor proteins called proteases. Proteases are a type of enzyme that act as molecular scissors to cleave proteins and break them down into smaller components. Proteases help cancer cells escape from tumors by cutting through the extracellular network of proteins that holds cells in place.</p>\n\n<p>The nanoparticles are coated with peptides (short protein fragments) that target cancer-linked proteases. When the nanoparticles arrive at the tumor site, the peptides are cut and release biomarkers that can be detected in the urine.</p>\n\n<p>In the current study, the researchers tested whether they could use this technology not just to detect cancer, but to track the development of cancer and its response to treatments accurately and sensitively over time. The team created a panel of 14 nanoparticles designed to target proteases overexpressed in non-small cell lung cancer induced in a mouse model. These nanoparticles had been adapted to release barcoded peptides when they encounter dysregulated enzymes in the tumor microenvironment.</p>\n\n<p>Each nanosensor was able to track different patterns of protease activity, which changed dramatically as the tumor progressed. After treatment with a lung cancer-targeting drug, the researchers were able to find signs tumor regression quickly, within just three days of administering treatment.</p>\n\n<p><strong>Cell maps and populations</strong></p>\n\n<p>While the existing nanosensor technique could be used to track tumor progression and treatment response in general, by itself, it could not shed any light on the specific cellular process at work.</p>\n\n<p>“Like many of the tools available to assess molecular markers for cancer, our urine reporter treats the body like a black box,” says Kirkpatrick. “While we get some information about the state of the disease, we wanted to know more about the cells or proteins that are causing the disease to behave in a particular way.”</p>\n\n<p>Having identified nanosensors of interest, researchers mapped where in the tumor microenvironment the enzymes acting on these sensors were active. They adapted their nanoprobes to leave behind fluorescent tags when they are cleaved from the nanosensor, assigning different tags to different proteases. After applying the nanoprobes to samples of lung tissue, they looked for patterns in how the tags were distributed.</p>\n\n<p>One tag resulted in a curious spindle-like pattern that turned out to belong to the tumor vasculature. Researchers pinpointed the protease activity to specific types of cells: endothelial cells, which line blood vessels, and pericytes, which regulate vascular function and are actively recruited in angiogenesis — one of the archetypal hallmarks of cancer cell growth. Angiogenesis allows tumor cells to recruit existing blood vessels and stimulate new ones to form, in order to obtain the nutrients needed for tumor formation and progression.</p>\n\n<p>Using their nanoprobes to label and sort cells based on their enzymatic activity, the team identified populations of cells associated with vasculature that displayed heightened expression of genes related to angiogenesis. The researchers also found evidence of signaling between pericytes and the endothelial cells that together comprise angiogenic blood vessels in vascular tissue.</p>\n\n<p><strong>Hallmark observations</strong></p>\n\n<p>In future work, the team seeks to identify the specific protease active in pericytes and dissect its role in angiogenesis. With this knowledge, they hope to develop formulations of therapies that can be delivered to patients to disrupt the recruitment and formation of blood vessels associated with tumor growth.</p>\n\n<p>Ultimately, however, the team envisions panels of nanoprobes targeting several important features of cancer simultaneously and noninvasively in patients. Other hallmarks of cancer include proliferative signaling, the evasion of growth suppressors, genome instability, resistance to cell death, deregulated metabolism, and activation of invasion and metastasis. Because cancer alters protease activity across all of these processes, the team’s nanoprobes could be designed to target these different processes, with the aim of providing a comprehensive picture of tumor activity driving the disease. The approach could be used by researchers looking to investigate key biological phenomena in cancer models, as well as by clinicians seeking to monitor cancer progression noninvasively and select treatments for their patients.</p>\n\n<p>The study was supported, in part, by the Virginia and D.K. Ludwig Fund for Cancer Research, the Koch Institute Frontier Research Program through a gift from Upstage Lung Cancer, the Koch Institute’s Marble Center for Cancer Nanomedicine, and Johnson &amp; Johnson.</p>",
  "media:content": {
    "media:description": "Researchers from the Bhatia Lab engineered targeted nanoprobes to measure enzyme activity in highly specific locations within cancer tissue. This image shows the probes (red) localizing to blood vessels (green) within lung cancer tumors, where active enzymes help newly recruited vessels feed the growing tumor.",
    "media:credit": "Image courtesy of the researchers."
  },
  "category": [
    "Research",
    "Cancer",
    "Cells",
    "Genetics",
    "Disease",
    "Health care",
    "Proteins",
    "Sensors",
    "Diagnostics",
    "Koch Institute",
    "Nanoscience and nanotechnology",
    "Institute for Medical Engineering and Science (IMES)",
    "Electrical Engineering & Computer Science (eecs)",
    "School of Engineering"
  ]
}