{
  "title": "How grieving changes the brain, with Mary-Frances O’Connor, PhD",
  "itunes:title": "How grieving changes the brain, with Mary-Frances O’Connor, PhD",
  "pubDate": "Wed, 30 Mar 2022 10:30:00 +0000",
  "guid": "cc9b61ad-d8c8-4722-bd87-8202661796bc",
  "link": "http://sopapa.libsyn.com/how-grieving-changes-the-brain-with-mary-frances-oconnor-phd",
  "itunes:image": "",
  "description": "<p>Few of us will make it through life without losing someone we love. Mary-Frances O’Connor, PhD, of the University of Arizona, discusses howneuroscience can help us to better understand grief and resilience after loss, why grief is different from depression, effective therapy for grief, whether it’s possible to experience grief over the death of a celebrity, and how to support people when they are grieving.<br /> <br /> <strong>Links</strong><br /> <br /> <a href=\"https://www.maryfrancesoconnor.com\">Mary-Frances O’Connor, PhD</a><br /> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Homepage</a></p>",
  "content:encoded": "<p>Few of us will make it through life without losing someone we love. Mary-Frances O’Connor, PhD, of the University of Arizona, discusses howneuroscience can help us to better understand grief and resilience after loss, why grief is different from depression, effective therapy for grief, whether it’s possible to experience grief over the death of a celebrity, and how to support people when they are grieving.  Links  <a href=\"https://www.maryfrancesoconnor.com\">Mary-Frances O’Connor, PhD</a> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Homepage</a></p>",
  "enclosure": "",
  "itunes:duration": "33:56",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Few of us will make it through life without losing someone we love. Mary-Frances O’Connor, PhD, of the University of Arizona, discusses howneuroscience can help us to better understand grief and resilience after loss, why grief is different from...",
  "itunes:episode": 184,
  "itunes:episodeType": "full"
}