{
  "id": "yt:video:Q8_QhPC9lWo",
  "yt:videoId": "Q8_QhPC9lWo",
  "yt:channelId": "UCRRr_xrOm66qaigIbwFLvbQ",
  "title": "How to feed a planet with 10 billion people",
  "link": "",
  "author": {
    "name": "Simon Clark",
    "uri": "https://www.youtube.com/channel/UCRRr_xrOm66qaigIbwFLvbQ"
  },
  "published": "2022-07-13T10:01:07+00:00",
  "updated": "2022-07-13T20:43:21+00:00",
  "media:group": {
    "media:title": "How to feed a planet with 10 billion people",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "After learning about the future of food, learn more about its history with CuriosityStream! https://www.curiositystream.com/simonclark\n\nIn this episode in the PhD stories series, I visited the University of Wageningen in the Netherlands to chat to Francesco, a grad student who is researching the extraordinary photosynthesis abilities of Hirschfeldia incana. This is just a weed, sure, but a weed who has exceptionally high rates of photosynthesis, and may just be the way to feed a future Earth with 10 billion people on it.\n\nWatch the other videos in this series! https://www.youtube.com/playlist?list=PLiZiIJMDh4ynIla_W5TH7nXn30N5M_-KH\n\n- Francesco's project page https://www.wur.nl/en/project/resolving-the-extreme-photosynthetic-efficiency-of-grey-mustard-hirschfeldia-incana.htm\n- Paper on Hirschfeldia incana https://www.biorxiv.org/content/10.1101/2022.01.29.478283v1\n- Francesco on LinkedIn https://www.linkedin.com/in/francesco-garassino/\n- Francesco on Twitter https://twitter.com/FrancGarassino\n\nYou can support the channel by becoming a patron at http://www.patreon.com/simonoxfphys\n\nCheck out my website! https://www.simonoxfphys.com/\n\n---------- II ----------\n\nMy twitter - http://www.twitter.com/simonoxfphys\nMy facebook - http://www.facebook.com/youtubesimon\nMy insta - http://www.instagram.com/simonoxfphys\nMy goodreads - http://www.goodreads.com/simonoxfphys\n\n---------- II ----------\n\nMusic by Epidemic Sound: http://epidemicsound.com\nSome stock footage from Getty.\n\nIn this grad school vlog I talk to Francesco Garassino, a PhD student at the University of Wageningen, who is researching photosynthesis in the department of plant science. What's it like doing a PhD in plant science? What's it like doing a PhD in the Netherlands? We talk about why his species of plant has such high rates of photosynthesis, what it's like to build your own lab equipment, and how plant science can feed a planet with 10 billion people.\n\nHuge thanks to my supporters on Patreon: Conor Safbom, William Pettersson, Paul H and Linda L, InDefenseOfToucans, Savannah, Jimmy Lee, Simon Stelling, Gabriele Siino, Bjorn Bakker, Ieuan Williams, Candace H, Tom Malcolm, Marcus Bosshard, Shab Kumar, Brady Johnston, Liat Khitman, Jesper Norsted, Kent & Krista Halloran, Rapssack, Kevin O'Connor, Timo Kerremans, Ashley Wilkins, Michael Parmenter, Samuel Baumgartner, Dan Sherman, ST0RMW1NG 1, Adrian Sand, Morten Engsvang, Farsight101, K.L, poundedjam, fourthdwarf, Daan Sneep, Felix Freiberger, Chris Field, Robert Connell, ChemMentat, Kolbrandr, , Sebastain Graf, Dan Nelson, Shane O'Brien, Alex, Fujia Li, Will Tolley, Cody VanZandt, Jesper Koed, Jonathan Craske, Albrecht Striffler, Igor Francetic, Jack Troup, SexyCaveman , Sean Richards, Kedar , Omar Miranda, Alastair Fortune, bitreign33 , Mat Allen, Anne Smith, Rafaela Corrêa Pereira, Colin J. Brown, Princess Andromeda, Mach_D, Thusto , Andy Hartley, Lachlan Woods, Dan Hanvey, Simon Donkers, Kodzo , James Bridges, Liam , Andrea De Mezzo, Wendover Productions, Kendra Johnson.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}