{
  "title": "Doubling down on sustainability innovation in Kendall Square",
  "link": "https://news.mit.edu/2022/kendall-square-association-sustainability-1024",
  "description": "The Kendall Square Association’s annual meeting highlights local efforts to develop and shift toward clean energy solutions.",
  "pubDate": "Mon, 24 Oct 2022 15:00:00 -0400",
  "guid": "https://news.mit.edu/2022/kendall-square-association-sustainability-1024",
  "dc:creator": "Zach Winn | MIT News Office",
  "content:encoded": "<p>From its new headquarters in Cambridge’s Kendall Square, The Engine is investing in a number of “tough tech” startups seeking to transform the world’s energy systems. A few blocks away, the startup Inari is using gene editing to improve seeds’ resilience to climate change. On the MIT campus nearby, researchers are working on groundbreaking innovations to meet the urgent challenges our planet faces.</p>\n\n<p>Kendall Square is known as the biotech capital of the world, but as the latest annual meeting of the Kendal Square Association (KSA) made clear, it’s also a thriving hub of sustainability-related innovation.</p>\n\n<p>The Oct. 20 event, which began at MIT’s Welcome Center before moving to the MIT Museum for a panel discussion, brought together professionals from across Cambridge’s prolific innovation ecosystem — not just entrepreneurs working at startups, but also students, restaurant and retail shop owners, and people from local nonprofits.</p>\n\n<p>Titled “[Re] Imagining a Sustainable Future,” the meeting highlighted advances in climate change technologies that are afoot in Kendall Square, to help inspire and connect the community as it works toward common sustainability goals.</p>\n\n<p>“Our focus is on building a better future together — and together is the most important word there,” KSA Executive Director Beth O’Neill Maloney said in her opening remarks. “This is an incredibly innovative ecosystem and community that’s making changes that affect us here in Kendall Square and far, far beyond.”</p>\n\n<p><strong>The pace of change</strong></p>\n\n<p>The main event of the evening was a panel discussion moderated by Lee McGuire, the chief communications officer of the Broad Institute of MIT and Harvard. The panel featured Stuart Brown, chief financial officer at Inari; Emily Knight, chief operating officer at The Engine; and Joe Higgins, vice president for campus services and stewardship at MIT.</p>\n\n<p>“Sustainability is obviously one of the most important — if not the most important — challenge facing us as a society today,” said McGuire, opening the discussion. “Kendall Square is known for its work in biotech, life sciences, AI, and climate, and the more we dug into it the more we realized how interconnected all of those things are. The talent in Kendall Square wants to work on problems relevant for humanity, and the tools and skills you need for that can be very similar depending on the problem you’re working on.”</p>\n\n<p>Higgins, who oversees the creation of programs to reduce MIT’s environmental impact and improve the resilience of campus operations, focused on the enormity of the problem humanity is facing. He showed the audience a map of the U.S. power grid, with power plants and transmission lines illuminated in a complex web across the country, to underscore the scale of electrification that will be needed to mitigate the worst effects of climate change.</p>\n\n<p>“The U.S. power grid is the largest machine ever made by mankind,” Higgins said. “It’s been developed over 100 years; it has 7,000 generating plants that feed into it every day; it has 7 million miles of cable and wires; there are transformers and substations; and it lives in every single one of your walls. But people don’t think about it that much.”</p>\n\n<p>Many cities, states, and organizations like MIT have made commitments to shift to 100 percent clean energy in coming decades. Higgins wanted the audience to try to grasp what that’s going to take.</p>\n\n<p>“Hundreds of millions of devices and equipment across the planet are going to have to be swapped from fossil fuel to electric-based,” Higgins said. “Our cars, appliances, processes in industry, like making steel and concrete, are going to need to come from this grid. It’ll need to undergo a major modernization and transformation. The good news is it’s already changing.”</p>\n\n<p>Multiple panelists pointed to developments like the passing of the Inflation Reduction Act to show there was progress being made in reaching urgent sustainability goals.</p>\n\n<p>“There is a tide change coming, and it’s not only being driven by private capital,” Knight said. “There’s a huge opportunity here, and it’s a really important part of this [Kendall Square] ecosystem.”</p>\n\n<p>Chief among the topics of discussion was technology development. Even as leaders implement today’s technologies to decarbonize, people in Kendall Square keep a close eye on the new tech being developed and commercialized nearby.</p>\n\n<p>“I was trying to think about where we are with gene editing,” Brown said. “CRISPR’s been around for 10 years. Compare that to video games. Pong was the first video game when it came out in 1972. Today you have Chess.com using artificial intelligence to power chess games. On gene editing and a lot of these other technologies, we’re much closer to Pong than we are to where it’s going to be. We just can’t imagine today the technology changes we’re going to see over the next five to 10 years.\"</p>\n\n<p>In that regard, Knight discussed some of the promising portfolio companies of The Engine, which invests in early stage, technologically innovative companies. In particular, she highlighted two companies seeking to transform the world’s energy systems with entirely new, 100 percent clean energy sources. MIT spinout Commonwealth Fusion Systems is working on nuclear fusion reactors that could provide abundant, safe, and constant streams of clean energy to our grids, while fellow MIT spinout Quaise Energy is seeking to harvest a new kind of deep geothermal energy using millimeter wave drilling technology.</p>\n\n<p>“All of our portfolio companies have a focus on sustainability in one way or another,” Knight said. “People who are working on these very hard technologies will change the world.”</p>\n\n<p>Knight says the kind of collaboration championed by the KSA is important for startups The Engine invests in.</p>\n\n<p>“We know these companies need a lot of people around them, whether from government, academia, advisors, corporate partners, anyone who can help them on their path, because for a lot of them this is a new path and a new market,” Knight said.</p>\n\n<p><strong>Reasons for hope</strong></p>\n\n<p>The KSA is made up of over 150 organizations across Kendall Square. From major employers like Sanofi, Pfizer, MIT, and the Broad Institute to local nonprofit organizations, startups, and independent shops and restaurants, the KSA represents the entire Kendall ecosystem.</p>\n\n<p>O’Neill Maloney celebrated a visible example of sustainability in Kendall Square early on by the Charles River Conservancy, which has built a floating wetland designed to naturally remove harmful algae blooms from Charles River.</p>\n\n<p>Other examples of sustainability work in the neighborhood can be found at MIT. Under its “Fast Forward” climate action plan, the Institute has set a goal of eliminating&nbsp;<a href=\"https://climate.mit.edu/climateaction/fastforward#ReduceMITsOwnClimateImpact\" target=\"_blank\">direct emissions from its campus by 2050</a>, including a near-term milestone of achieving net-zero emissions by 2026. Since 2014, when MIT launched a five-year plan for action on climate change, net campus emissions have already been cut by 20 percent by making its campus buildings more energy efficient, transitioning to electric vehicles, and enabling large-scale renewable energy projects, among other strategies.</p>\n\n<p>In the face of a daunting global challenge, such milestones are reason for optimism.</p>\n\n<p>“If anybody’s going to be able to do this [shift to 100 percent clean energy] and show how it can be done at an urban, city scale, it’s probably MIT and the city of Cambridge,” McGuire said. “We have a lot of good ingredients to figure this out.”</p>\n\n<p>Throughout the night, many speakers, attendees, and panelists echoed that sentiment. They said they see plenty of reasons for hope.</p>\n\n<p>“I’m absolutely optimistic,” Higgins said. “I’m seeing utility companies working with businesses working with regulators — people are coming together on this topic. And one of these new technologies being commercialized is going to change things before 2030, whether its fusion, deep geothermal, small modular nuclear reactors, the technology is just moving so quickly.”</p>",
  "media:content": {
    "media:description": "The main event of this year's Kendall Square Association meeting was a panel discussion about sustainability initiatives in the area. The panelists were, from left to right, Joe Higgins, vice president for campus services and stewardship at MIT; Stuart Brown, chief financial officer at Inari; and Emily Knight, chief operating officer at The Engine. At the far right, Lee McGuire, the chief communications officer of the Broad Institute of MIT and Harvard, moderated the discussion."
  },
  "category": [
    "Cambridge, Boston and region",
    "Kendall Square",
    "Special events and guest speakers",
    "Industry",
    "Biotechnology",
    "Energy",
    "Sustainability",
    "Climate change",
    "Environment",
    "Technology and society",
    "Innovation and Entrepreneurship (I&E)",
    "Renewable energy",
    "Community"
  ]
}