{
  "title": "Large-Scale Integrated Flexible Tactile Sensor Array for Sensitive Smart Robotic Touch. (arXiv:2208.10933v2 [cond-mat.mtrl-sci] UPDATED)",
  "link": "http://arxiv.org/abs/2208.10933",
  "description": "<p>In the long pursuit of smart robotics, it has been envisioned to empower\nrobots with human-like senses, especially vision and touch. While tremendous\nprogress has been made in image sensors and computer vision over the past\ndecades, the tactile sense abilities are lagging behind due to the lack of\nlarge-scale flexible tactile sensor array with high sensitivity, high spatial\nresolution, and fast response. In this work, we have demonstrated a 64x64\nflexible tactile sensor array with a record-high spatial resolution of 0.9 mm\n(equivalently 28.2 pixels per inch), by integrating a high-performance\npiezoresistive film (PRF) with a large-area active matrix of carbon nanotube\nthin-film transistors. PRF with self-formed microstructures exhibited high\npressure-sensitivity of ~385 kPa-1 for MWCNTs concentration of 6%, while the\n14% one exhibited fast response time of ~3 ms, good linearity, broad detection\nrange beyond 1400 kPa, and excellent cyclability over 3000 cycles. Using this\nfully integrated tactile sensor array, the footprint maps of an artificial\nhoneybee were clearly identified. Furthermore, we hardware-implemented a smart\ntactile system by integrating the PRF-based sensor array with a memristor-based\ncomputing-in-memory chip to record and recognize handwritten digits and Chinese\ncalligraphy, achieving high classification accuracies of 98.8% and 97.3% in\nhardware, respectively. The integration of sensor networks with deep learning\nhardware may enable edge or near-sensor computing with significantly reduced\npower consumption and latency. Our work could pave the road to building\nlarge-scale intelligent sensor networks for next-generation smart robotics.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Zhao_Z/0/1/0/all/0/1\">Zhenxuan Zhao</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Tang_J/0/1/0/all/0/1\">Jianshi Tang</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Yuan_J/0/1/0/all/0/1\">Jian Yuan</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Li_Y/0/1/0/all/0/1\">Yijun Li</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Dai_Y/0/1/0/all/0/1\">Yuan Dai</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Yao_J/0/1/0/all/0/1\">Jian Yao</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Zhang_Q/0/1/0/all/0/1\">Qingtian Zhang</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Ding_S/0/1/0/all/0/1\">Sanchuan Ding</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Li_T/0/1/0/all/0/1\">Tingyu Li</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Zhang_R/0/1/0/all/0/1\">Ruirui Zhang</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Zheng_Y/0/1/0/all/0/1\">Yu Zheng</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Zhang_Z/0/1/0/all/0/1\">Zhengyou Zhang</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Qiu_S/0/1/0/all/0/1\">Song Qiu</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Li_Q/0/1/0/all/0/1\">Qingwen Li</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Gao_B/0/1/0/all/0/1\">Bin Gao</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Deng_N/0/1/0/all/0/1\">Ning Deng</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Qian_H/0/1/0/all/0/1\">He Qian</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Xing_F/0/1/0/all/0/1\">Fei Xing</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+You_Z/0/1/0/all/0/1\">Zheng You</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Wu_H/0/1/0/all/0/1\">Huaqiang Wu</a>"
}