{
  "title": "Navigating Macro Headwinds: A Conversation With the Founders of Brex and Chief",
  "description": "What’s top of mind for exceptional entrepreneurs? In the latest episode of Exchanges at Goldman Sachs, Goldman Sachs’ Kim Posnett, global head of Investment Banking Services, sat down with two company founders — Henrique Dubugras, co-founder and co-CEO at Brex and Carolyn Childers, co-founder and CEO at Chief — to discuss their founder journeys, how their businesses are adapting to a challenging macro environment, and what they are most optimistic about for their futures. The episode was recorded at the firm’s annual Builders and Innovators Summit.",
  "pubDate": "Tue, 25 Oct 2022 04:00:00 -0000",
  "itunes:episodeType": "full",
  "itunes:author": "Goldman Sachs",
  "itunes:subtitle": "",
  "itunes:summary": "What’s top of mind for exceptional entrepreneurs? In the latest episode of Exchanges at Goldman Sachs, Goldman Sachs’ Kim Posnett, global head of Investment Banking Services, sat down with two company founders — Henrique Dubugras, co-founder and co-CEO at Brex and Carolyn Childers, co-founder and CEO at Chief — to discuss their founder journeys, how their businesses are adapting to a challenging macro environment, and what they are most optimistic about for their futures. The episode was recorded at the firm’s annual Builders and Innovators Summit.",
  "content:encoded": "<p>What’s top of mind for exceptional entrepreneurs? In the latest episode of <em>Exchanges at Goldman Sachs, </em>Goldman Sachs’ <strong>Kim Posnett</strong>, global head of Investment Banking Services, sat down with two company founders — <strong>Henrique Dubugras</strong>, co-founder and co-CEO at Brex<strong> </strong>and<strong> Carolyn Childer</strong>s, co-founder and CEO at Chief —<strong> </strong>to discuss their founder journeys, how their businesses are adapting to a challenging macro environment, and what they are most optimistic about for their futures. The episode was recorded at the firm’s annual Builders and Innovators Summit. </p>",
  "itunes:duration": 1367,
  "guid": "7d68d99c-53e8-11ed-a24a-6b8591b83ac7",
  "enclosure": ""
}