{
  "id": "yt:video:qTOFFN_0idA",
  "yt:videoId": "qTOFFN_0idA",
  "yt:channelId": "UC5Jz6SBlu2Sv61kfssv4DOw",
  "title": "Tunable Stiffness Compliant Mechanism with Bistable Switch",
  "link": "",
  "author": {
    "name": "The FACTs of Mechanical Design",
    "uri": "https://www.youtube.com/channel/UC5Jz6SBlu2Sv61kfssv4DOw"
  },
  "published": "2022-05-18T14:53:17+00:00",
  "updated": "2022-08-19T15:42:13+00:00",
  "media:group": {
    "media:title": "Tunable Stiffness Compliant Mechanism with Bistable Switch",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This video depicts a translational binary stiffness compliant mechanism that achieves two different states of stiffness by being triggered using a simple bistable switch. One state is very compliant while the other state is very stiff. The mechanism was designed by Reinier Kuppens while working in my lab at UCLA as a visiting scholar from Delft University.\n\nFurther details about the mechanism are published in the Journal of Mechanisms and Robotics, and can be found at this link: \n\nhttps://asmedigitalcollection.asme.org/mechanismsrobotics/article-abstract/13/2/021010/1093285/Compliant-Mechanisms-That-Use-Static-Balancing-to?redirectedFrom=fulltext\n\nA raw video of this mechanism was previously uploaded to Reinier’s YouTube channel: \n\nhttps://www.youtube.com/watch?v=vkpembB9J_s\n\nbut this video is intended to explain the mechanical principles behind how the mechanism works. This video is the third part of a five-part mini-series about binary-stiffness compliant mechanisms. Be sure to watch the other parts to learn more about how they work and for what applications they could be used. \n\nThe part files for this mechanism can be downloaded from Thingiverse at this link:\nhttps://www.thingiverse.com/thing:5436891\n\nAlso, to understand more about compliant mechanisms in general, be sure to watch the other videos in my Compliant Mechanism Design series on this channel. \n\nAcknowledgements: \nThis video would not have been possible without the brilliance of Reinier Kuppens, Just Herder, and Miguel Bessa, so a huge thanks to them.\n\nDisclaimer: \nResponsibility for the content of this video is my own. The University of California, Los Angeles is not involved with this channel nor does it endorse its content.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}