{
  "title": "How Does a Parenting Influencer Do Her Job?",
  "description": "Continuing her exploration into the influencer industry, Rachelle chats with Ilana Wiles, creator of the blog Mommy Shorts and author of The Mommy Shorts Guide to Remarkably Average Parenting. Ilana started her parenting blog when she was laid off from her full-time advertising job shortly after returning from maternity leave. As her audience grew both on the blog and on Instagram, her online presence eventually became her main gig. In this episode, Ilana talks about how she made the decision to quit freelance advertising work to focus on Mommy Shorts, all the hidden work that goes into her job and what her two kids think of her career built on talking about them.\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "pubDate": "Sun, 22 Sep 2019 10:00:00 -0000",
  "itunes:title": "How Does a Parenting Influencer Do Her Job?",
  "itunes:episodeType": "full",
  "itunes:author": "Slate Podcasts",
  "itunes:subtitle": "",
  "itunes:summary": "Continuing her exploration into the influencer industry, Rachelle chats with Ilana Wiles, creator of the blog Mommy Shorts and author of The Mommy Shorts Guide to Remarkably Average Parenting. Ilana started her parenting blog when she was laid off from her full-time advertising job shortly after returning from maternity leave. As her audience grew both on the blog and on Instagram, her online presence eventually became her main gig. In this episode, Ilana talks about how she made the decision to quit freelance advertising work to focus on Mommy Shorts, all the hidden work that goes into her job and what her two kids think of her career built on talking about them.\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "content:encoded": "<p>Continuing her exploration into the influencer industry, Rachelle chats with Ilana Wiles, creator of the blog <a href=\"https://www.mommyshorts.com/\">Mommy Shorts </a>and author of <a href=\"https://www.amazon.com/Mommy-Shorts-Remarkably-Average-Parenting/dp/1419722190\"><em>The Mommy Shorts Guide to Remarkably Average Parenting</em></a>. Ilana started her parenting blog when she was laid off from her full-time advertising job shortly after returning from maternity leave. As her audience grew both on the blog and on Instagram, her online presence eventually became her main gig. In this episode, Ilana talks about how she made the decision to quit freelance advertising work to focus on Mommy Shorts, all the hidden work that goes into her job and what her two kids think of her career built on talking about them.</p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p>",
  "itunes:duration": 3017,
  "guid": "0f1f7900-e9de-11e8-bf7c-4396e59965f3",
  "enclosure": ""
}