{
  "title": "Explosive Power Beats Even Moore’s Law",
  "link": "https://spectrum.ieee.org/nuclear-bomb",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-photo-of-a-nuclear-explosion-with-islands-in-the-foreground.jpg?id=30007111&width=1200&height=800&coordinates=114%2C0%2C114%2C0\"/><br/><br/><p>\n<strong>The rising number </strong>of components on a microchip is the go-to example of roaring innovation. Intel’s first microprocessor, <a href=\"https://spectrum.ieee.org/chip-hall-of-fame-intel-4004-microprocessor\" target=\"_self\">the 4004</a>, released in 1971, had 2,300 transistors; half a century later the highest count <a href=\"https://spectrum.ieee.org/nanosheets-ibms-path-to-5nanometer-transistors\" target=\"_self\">surpasses 50 billion,</a> for the Apple M1 Max—<a href=\"https://en.wikipedia.org/wiki/Moore%27s_law\" target=\"_blank\">an increase of seven orders of magnitude</a>. Most other technical advances have lagged behind: During the entire 20th century, maximum travel speeds rose less than tenfold, from about <a href=\"https://www.railwaywondersoftheworld.com/locomotive-speed-records.html\" target=\"_blank\">100 kilometers per </a>hour for express trains to <a href=\"https://en.wikipedia.org/wiki/Cruise_(aeronautics)#:~:text=The%20typical%20cruising%20airspeed%20for,%3B%20547%E2%80%93575%20mph).\" target=\"_blank\">900 km/h</a> for cruising jetliners. Skyscrapers got only <a href=\"https://www.emporis.com/statistics/history-of-worlds-tallest-buildings\" target=\"_blank\">2.4 times as tall</a>, from the <a href=\"https://en.wikipedia.org/wiki/Singer_Building#:~:text=With%20a%20roof%20height%20of,one%2Dsixth%20of%20that%20area.\" target=\"_blank\">Singer Building</a> (187 meters) to the <a href=\"https://en.wikipedia.org/wiki/Petronas_Towers\" target=\"_blank\">Petronas Towers</a> (452 meters).\n</p><p>\n\tBut there is one accomplishment that, unfortunately, has seen even higher gains since 1945: the destructive power of explosives.\n</p><hr/><p>\n\tModern explosives date to the 19th century, with trinitrotoluene (\n\t<a href=\"https://en.wikipedia.org/wiki/TNT\" target=\"_blank\">TNT</a>) and <a href=\"https://en.wikipedia.org/wiki/Dynamite\" target=\"_blank\">dynamite</a> in the 1860s, followed by <a href=\"https://en.wikipedia.org/wiki/RDX\" target=\"_blank\">RDX</a> (Royal Demolition Explosive), patented in 1898. During the Second World War, explosive power rained on European and Japanese cities in the form of mass-scale bombing, and by the war’s end, in 1945, the most powerful explosive weapon was the Nazi <a href=\"https://en.wikipedia.org/wiki/V-2_rocket\" target=\"_blank\">V-2</a> rocket. It carried 910 kilograms of <a href=\"https://en.wikipedia.org/wiki/Amatol\" target=\"_blank\">amatol</a>—a blend of TNT and ammonium nitrate—and had an explosive energy of about 3.5 gigajoules.\n</p><p>\n\tThe increase in explosive power, over 16 years, matches what Moore’s Law has accomplished in the 50 years since 1970\n\t<br/>\n</p><p>\n\tAnd then came an entirely new class of explosives, those exploiting nuclear fission and fusion. The bomb that exploded over \n\t<a href=\"https://atomicarchive.com/resources/documents/pdfs/00313791.pdf\" target=\"_blank\">Hiroshima</a> on 7 August 1945 released 63 GJ of energy, half of it as the blast wave, about a third as thermal radiation. The Nagasaki bomb, dropped two days later, released about 105 GJ. But these first two bombs were tiny when compared to what came later. The most powerful U.S. hydrogen (or fusion) bomb, tested in 1954, was equivalent to <a href=\"https://en.wikipedia.org/wiki/Castle_Bravo\" target=\"_blank\">15 megatons of TNT</a> (63 petajoules). This was far surpassed on 30 October 1961, when the Soviet Union tested the RDS-220 bomb above Novaya Zemlya in the Arctic Ocean. Fifty-nine years later, in August 2020, Rosatom (Russia’s atomic energy agency) released a 40-minute-long film that claimed that the bomb, nicknamed the <em>tsar bomba</em>—the emperor’s bomb—had had a yield of <a href=\"https://en.wikipedia.org/wiki/Tsar_Bomba\" target=\"_blank\">50 megatons</a>.\n</p><div class=\"flourish-embed flourish-chart\" data-src=\"visualisation/10193323?602891\">\n<script src=\"https://public.flourish.studio/resources/embed.js\"> </script>\n</div><p>\n\tIn this \n\t<a href=\"https://www.livescience.com/tsar-bomba-secret-test-footage-declassified.html\" target=\"_blank\">remarkable video</a>, the antiquated analog instrumentation provides a strange contrast with the weapon’s immense destructive power. The bomb—hung beneath the belly of a Tu-95 bomber—was dropped by parachute from a height of 10.5 kilometers and detonated 4 km above the ground. The explosion released 210 PJ of energy, three orders of magnitude more than the Nagasaki bomb, creating a mushroom cloud of 60-65 km in diameter and a flash visible from nearly 1,000 km away. And soon afterward Nikita Khrushchev, the Soviet premier, claimed that his country had built but not tested a bomb twice as powerful.\n</p><p>\n\tThe last V-2 attack on London came on \n\t<a href=\"https://en.wikipedia.org/wiki/March_1945#:~:text=Soviet%20military%20commander-,March%2027%2C%201945%20(Tuesday),(present%2Dday%20Montenegro).\" target=\"_blank\">27 March 1945</a>, less than six weeks before the Nazi surrender. By the Novaya Zemlya test in 1961, the maximum explosive energy of weapons had risen by seven orders of magnitude, to more than 200 PJ. That increase, over 16 years, matches what Moore’s Law has accomplished in the 50 years since 1970. It is a reminder of the terrible priorities of modern civilization.\n</p><p>\n<em>This article appears in the July 2022 print issue as “A Moore’s Law—for Bombs.”</em>\n</p>",
  "pubDate": "Tue, 28 Jun 2022 15:00:01 +0000",
  "guid": "https://spectrum.ieee.org/nuclear-bomb",
  "category": [
    "Explosive power",
    "Atom bomb",
    "H-bomb",
    "V-2 rocket",
    "Nuclear bomb",
    "Nuclear weapons",
    "Energy"
  ],
  "dc:creator": "Vaclav Smil",
  "media:content": ""
}