{
  "id": "https://bibleinoneyear.org/en/youth/336",
  "title": "Day 336: From Vision to Action*",
  "description": "Proverbs 29:18, Daniel 8:26, 1 John 3:1–7,8b–9. Vision without action is merely a dream  Action without vision is a nightmare! But *vision combined with action* can change the world",
  "pubDate": "Thu, 02 Dec 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/336/?ignore",
  "itunes:duration": "14:26",
  "guid": "enyouth02122021-336",
  "length": 866.93,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 336: From Vision to Action*",
  "itunes:subtitle": "Proverbs 29:18, Daniel 8:26, 1 John 3:1–7,8b–9. Vision without action is merely a dream  Action without vision is a nightmare! But *vision combined with action* can change the world",
  "itunes:summary": "Jackie Pullinger has spent her life working with the poor and destitute, triad gang members, heroin and opium addicts. She has helped thousands to come off drugs through the power of the Holy Spirit. She has seen transformation in numerous lives and has made a huge impact on the city of Hong Kong.\nJackie wrote, ‘I have spent over half my life in a dark, foul smelling place because I had a “vision” of another city ablaze with light, it was my dream. There was no more crying, no more death or pain. The sick were healed, addicts set free, the hungry filled. There were families for orphans, homes for the homeless, and new dignity for those who lived in shame. I had no idea how to bring this about but with “visionary zeal” imagined introducing the Walled City people to the one who could change it all: Jesus.’\nVision is a ‘holy discontent’ – a deep dissatisfaction with what is, combined with a clear grasp of what could be. It is a picture – ‘a mental sight’ – of the future that inspires hope.\nVision without action is merely a dream. Action without vision is a nightmare! But vision combined with action can change the world.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 336
}