{
  "title": "Weaponized Robots Letter Calls for Policy, Tech Fixes",
  "link": "https://spectrum.ieee.org/robots-with-weapons-industry-initiative",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/boston-dynamics-spot-robot-set-against-a-mocha-colored-background-containing-logos-of-several-robotics-companies-and-the-text-of.jpg?id=31877429&width=1200&height=600&coordinates=0%2C546%2C0%2C547\"/><br/><br/><p>\n\tYesterday, six companies that build or support sophisticated mobile robots (led by Boston Dynamics) \n\t<a href=\"https://www.bostondynamics.com/open-letter-opposing-weaponization-general-purpose-robots\" rel=\"noopener noreferrer\" target=\"_blank\">published an open letter to the robotics community and industry pledging to not weaponize their general-purpose robots</a>. Signed by Agility Robotics, ANYbotics, Clearpath Robotics, Open Robotics, and Unitree, in addition to Boston Dynamics, the letter seeks to ensure that the companies’ robots are used safely and ethically, in a way that helps rather than harms.\n</p><p>\n\tBoston Dynamics and others find themselves in an increasingly difficult position. These companies are striving to make useful, general-purpose robots, and that means making them useful for anything—even things that they should not be used for. There have been a bunch of high-profile examples of robot misuse recently (that we’re not going to link to), and the companies building the robots being misused have taken it personally—as they should, because those misused robots are very easy to identify. Plus any misperceptions that these misused robots could be autonomous (though they aren’t) makes an implied false connection between the actions of the robot and the ethics of the company.\n</p><p>\n<div class=\"rblad-ieee_in_content\"></div>\n</p><p>\n\tThe letter is just one step, and not the first for any of these companies, toward friendlier, safer robots. But it’s going to take a lot of difficult, complicated steps, and there isn’t even an obvious path forward: As we heard from many of these folks a couple of years ago, <a href=\"https://spectrum.ieee.org/when-robots-enter-the-world-who-is-responsible-for-them\" target=\"_self\">it’s hard to maintain responsibility for robots out in the world</a>.\n</p><p>\n\tWith this complexity in mind, we spoke with <a href=\"https://www.linkedin.com/in/brendanschulman/\" rel=\"noopener noreferrer\" target=\"_blank\">Brendan Schulman, vice president of policy and government relations at Boston Dynamics</a>, to better understand what this letter means.\n</p><hr/><div class=\"ieee-sidebar-medium\">\n<h3>An Open Letter to the Robotics Industry and our Communities,<br/>\nGeneral Purpose Robots Should Not Be Weaponized\n\t</h3>\n<p>\n\tWe are some of the world’s leading companies dedicated to introducing new generations of advanced mobile robotics to society. These new generations of robots are more accessible, easier to operate, more autonomous, affordable, and adaptable than previous generations, and capable of navigating into locations previously inaccessible to automated or remotely-controlled technologies. We believe that advanced mobile robots will provide great benefit to society as co-workers in industry and companions in our homes.\n\t</p>\n<p>\n\tAs with any new technology offering new capabilities, the emergence of advanced mobile robots offers the possibility of misuse. Untrustworthy people could use them to invade civil rights or to threaten, harm, or intimidate others. One area of particular concern is weaponization. We believe that adding weapons to robots that are remotely or autonomously operated, widely available to the public, and capable of navigating to previously inaccessible locations where people live and work, raises new risks of harm and serious ethical issues. Weaponized applications of these newly-capable robots will also harm public trust in the technology in ways that damage the tremendous benefits they will bring to society. For these reasons, we do not support the weaponization of our advanced-mobility general-purpose robots. For those of us who have spoken on this issue in the past, and those engaging for the first time, we now feel renewed urgency in light of the increasing public concern in recent months caused by a small number of people who have visibly publicized their makeshift efforts to weaponize commercially available robots.\n\t</p>\n<p>\n\tWe pledge that we will not weaponize our advanced-mobility, general-purpose robots or the software we develop that enables advanced robotics and we will not support others to do so. When possible, we will carefully review our customers’ intended applications to avoid potential weaponization. We also pledge to explore the development of technological features that could mitigate or reduce these risks. To be clear, we are not taking issue with existing technologies that nations and their government agencies use to defend themselves and uphold their laws.\n\t</p>\n<p>\n\tWe understand that our commitment alone is not enough to fully address these risks, and therefore we call on policymakers to work with us to promote safe use of these robots and to prohibit their misuse. We also call on every organization, developer, researcher, and user in the robotics community to make similar pledges not to build, authorize, support, or enable the attachment of weaponry to such robots. We are convinced that the benefits for humanity of these technologies strongly outweigh the risk of misuse, and we are excited about a bright future in which humans and robots work side by side to tackle some of the world’s challenges.\n\t</p>\n<p>\n\tSigned,\n\t</p>\n<p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"\" class=\"rm-shortcode\" data-rm-shortcode-id=\"c09b5d5d4b42818a4afe2d4a883b9eba\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"707a8\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image.png?id=31877427&width=980\"/>\n</p>\n</div><p>\n<strong><em>IEEE Spectrum</em>: There have been some similar letters in the past where the robotics industry has advocated against weaponizing robots. Why is this letter different?</strong>\n</p><p>\n<strong>Brendan Schulman: </strong>This is the first time that companies which are developing and selling general-purpose robots—that are increasingly being used in workplaces and communities—have gotten together to say something about this issue. I think that makes it distinct from other efforts that have been going on in a broader robotics context for a number of years. It’s not about military robots per se, and that’s made quite clear in the letter. We’re not taking issue with weapons systems that are already governed by an international legal framework.\n</p><p class=\"pull-quote\">“We’re calling on policymakers to do something about this issue. We acknowledge that our commitment alone is not enough to address the ethics and public-trust concerns.”<br/>\n\t—Brendan Schulman, Boston Dynamics\n</p><p>\n\tThe focus of the letter is on these new, widely accessible general-purpose commercial robots, where in some cases we’ve lately seen people potentially misusing them by weaponizing them. And that’s the issue for us, because that’s an ethical concern as well as the risk of a loss of public trust in robotics—that the public will begin to feel that all of these companies developing these highly advanced mobile robots are just one step away from deploying weapons in our communities, when in fact the whole point is to create robots that help people and do good things.</p><p>\n<strong>Before publishing the letter signed by these six companies, did you contact anyone else? Did any companies decline to participate?</strong>\n</p><p>\n<strong>Schulman:</strong> These are the companies that happened to be discussing this issue for the last few months, just among themselves. We decided to get together and publish this letter after a summer of a number of prominent stunts involving people weaponizing commercially available robots. We thought it was time to say something about that.\n</p><p>\n\tWe invite everyone to join us, and we certainly welcome a broader group—not just industry, but across academia and government.\n</p><p>\n<strong>What do you hope this letter will accomplish?</strong>\n</p><p>\n<strong>Schulman: </strong>It’s important to keep in mind that we’re calling on policymakers to do something about this issue. We acknowledge that our commitment alone is not enough to address the ethics and public-trust concerns. And we really want to figure out what types of policy solutions could be put in place to address this risk, as well as what kinds of technology solutions might exist or might be developed.\n</p><p>\n\tIn the drone space, for example, where I worked previously, one of the technology-based solutions to public accountability concerns for drones was Remote ID, which targeted the anonymity of drone operations. There may be solutions like that in the general-purpose robotics space as well, and this letter is committing to exploring whether there are such solutions and how to develop and implement them. But it’s an open question.\n</p><p>\n\tI would like to think that we’ve gone a step further with this letter, both in bringing together the broader industry, but also really reaching out to policymakers as well as technologists to say, “work with us to help solve these challenges.”\n</p><p><div class=\"rblad-ieee_in_content\"></div></p><p>\n<strong>The letter focuses on “weaponized” robots. What does “weaponized” mean, exactly?</strong>\n</p><p>\n<strong>Schulman: </strong>This is part of the discussion we’ve been having in the industry and with other stakeholders.\n</p><p>\n\tOne of the examples that has come up in discussions is about a year ago, \n\t<a href=\"https://dronedj.com/2021/10/12/video-shows-a-peruvian-cop-drone-rescuing-an-sol-pigeon/\" rel=\"noopener noreferrer\" target=\"_blank\">a drone in Peru was equipped with a knife and used to free a pigeon that got tangled in power lines</a>. That sounds like a weaponized robot, but it was used for a beneficial purpose, and I don’t think any of us would object to that. So there’s a nuanced and detailed discussion to be had, and some of us are beginning to have that conversation, and we hope to continue it with policymakers: how do we define weapon, and how do we define what a robot is in terms of the capabilities that we are concerned about when it comes to misuse.\n</p><p>\n\tOur goal is to arrive at something more specific than just this initial letter, which is really just the beginning of the conversation. A lot of these definitional questions and parameters for what kinds of weapons and robots would be included in a policy-based prohibition is exactly the discussion we want everyone to have, including the broader robotics community, academia, government, civil-rights stakeholders, and law-enforcement agencies. This is a discussion that doesn’t start or end with industry alone.\n</p><p class=\"pull-quote\">“What doesn’t exist is a framework for how advanced commercial robots are being used in society, and how we might impose limitations on their misuse, specifically weaponization.”<br/>\n\t—Brendan Schulman, Boston Dynamics\n</p><p>\n\tFor Boston Dynamics, I can say that we prohibit and would condemn any device on the robot that is designed to harm humans. I think that’s a pretty broad category; obviously there are weapons known as “less-lethal” weapons, but those are still designed to harm or incapacitate. And our company would prohibit those. When you start talking about devices that could be used to harm someone, but that are really designed to do something else, then you start to have a more difficult line to draw. But I think in this early era of advanced mobile robots, it will be pretty clear.\n\t<br/>\n</p><p>\n<strong>The letter is very specific that it does not support the weaponization of general-purpose robots. Does that leave companies that sign this letter free to develop robots for other purposes that may include weaponization?</strong>\n</p><p>\n<strong>Schulman: </strong>What we’re focusing on with this coalition are the kinds of robots that are more affordable, adaptable, accessible, and easy to operate. That is a new thing, and that’s the kind of new thing that we have increasingly seen raising concerns among members of the public, among government stakeholders, within the media, and within the robotics and academic communities as well.\n</p><p>\n\tWhat’s not new is that militaries have long had what could be described as weaponized mobile robots. Those weapons systems are not what the letter is about. If a defense contractor is developing a weapons system for the military that is to be used by the military under existing legal doctrines and conventions on warfare, and it’s subject to those safeguards rather than out there for public purchase and use, that’s absolutely in a different category—that whole development, procurement, and use process exists under a framework that’s been developed for decades, and certainly there are ongoing ethics discussions in that context too. What doesn’t exist is a framework for how advanced commercial robots are being used in society, and how we might impose limitations on their misuse, specifically weaponization.\n</p><p>\n\tBut, I think there needs to be a nuanced discussion about what kinds of constraints we might ask policymakers to impose, and what we do about products that potentially cross over from civilian to military use. It’s a complicated question that needs to be discussed more broadly.\n</p><p><div class=\"rblad-ieee_in_content\"></div></p><p>\n<strong>What happens next? How do you hope technology and policy can be leveraged to make progress toward the goals of this letter?</strong>\n</p><p>\n<strong>Schulman: </strong>Let’s start with technology. This is a call for the exploration of potential solutions, which could be anything from a remote identification and accountability mechanism, as we’ve seen lately on consumer aerial robots, to things like data logging or payload detection or perhaps remote disabling technologies. It’s something that we are starting to explore, and we very much invite ideas for other technology-based solutions that might help address this concern.\n</p><p>\n\tPolicymakers are likely to focus on proscribed conduct, which would potentially prohibit the weaponization of a robot. You’d have to define what kinds of weapons, and what kinds of robotic technologies these prohibitions would apply to, so it would require some thoughtfulness. There have been bills introduced over the years that have prohibited weaponized drones, and I think that other robots could follow a similar pattern in that over time; policymakers and other stakeholders figure out what kind of conduct is the real concern, and what legal provisions would prohibit that.\n</p><p>\n\tWe’d love to continue discussing these issues with policymakers. Again, this is really just the beginning, and in some cases, members of this coalition have been in discussions with policymakers about this for a while. I think the letter demonstrates that there is a broad sentiment by the advanced mobile robotic industry, across three continents, that something should be done. But certainly the robotics community is far broader than just us, and it would be great to hear more ideas. I hope the letter will spur these additional conversations and perhaps speed up the process of trying to reach solutions.\n</p>",
  "pubDate": "Fri, 07 Oct 2022 15:39:57 +0000",
  "guid": "https://spectrum.ieee.org/robots-with-weapons-industry-initiative",
  "category": [
    "Boston dynamics",
    "Weaponized robots",
    "Legged robots",
    "Agility robotics",
    "Unitree",
    "Open robotics",
    "Clearpath robotics",
    "Robotics"
  ],
  "dc:creator": "Evan Ackerman",
  "media:content": ""
}