{
  "title": "Ecosystem Roundup: SEA&#8217;s startup funding hits 7-quarter low in Q3; Alta buys Hg Exchange; Hodlnaut founders hid financial documents, court says",
  "link": "https://e27.co/alta-fundnel-acquires-hg-exchange-20221101/",
  "dc:creator": "Sainul",
  "pubDate": "Tue, 01 Nov 2022 03:57:14 +0000",
  "category": [
    "e27 Pro",
    "Investments",
    "News",
    "Altara Ventures",
    "Amazon.",
    "Ascend Vietnam Ventures",
    "Bukalapak",
    "Fundnel",
    "Grab",
    "Hg Exchange",
    "Hodlnaut",
    "RakkaR Digital",
    "SCB 10X",
    "Sendhelper",
    "StraitsX",
    "Wavemaker Partners"
  ],
  "guid": "https://e27.co/?p=475391",
  "description": "<p>SEA&#8217;s startup funding hits seven-quarter low in Q3 at US$3.7B Startups in the region secured US$3.72B in VC funding in Q3, down 22% from the previous quarter and 36.4% year on year; On the other hand, the deal volume increased 11% Q-o-Q to 277 during the period. Alta (Fundnel) acquires Hg Exchange The acquisition will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/alta-fundnel-acquires-hg-exchange-20221101/\">Ecosystem Roundup: SEA&#8217;s startup funding hits 7-quarter low in Q3; Alta buys Hg Exchange; Hodlnaut founders hid financial documents, court says</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<div id=\"attachment_211253\" style=\"width: 700px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-211253\" loading=\"lazy\" class=\"size-full wp-image-211253\" src=\"https://e27.co/wp-content/uploads/2018/11/Fundnel_Founders_Investment.png\" alt=\"\" width=\"690\" height=\"390\" /><p id=\"caption-attachment-211253\" class=\"wp-caption-text\">(L-R) Alta Co-Founders Kelvin Lee (CEO), Khai Lin Sng (CFO) and Benjamin Twoon (COO)</p></div>\n<p><a rel=\"follow\" href=\"https://www.dealstreetasia.com/stories/se-asia-q3-funding-313454\">SEA&#8217;s startup funding hits seven-quarter low in Q3 at US$3.7B</a><br />\nStartups in the region secured US$3.72B in VC funding in Q3, down 22% from the previous quarter and 36.4% year on year; On the other hand, the deal volume increased 11% Q-o-Q to 277 during the period.</p>\n<p><a rel=\"follow\" href=\"https://www.coindesk.com/business/2022/10/31/singapore-based-digital-marketplace-alta-acquires-hg-exchange/\">Alta (Fundnel) acquires Hg Exchange</a><br />\nThe acquisition will enable Alta to support the tokenisation and digital custody of alternative assets, creating an end-to-end solution that makes it cheaper and faster to trade private securities, funds, and asset-backed securities.</p>\n<p><a rel=\"follow\" href=\"https://www.dealstreetasia.com/stories/challenge-for-vc-exits-313621\">Exit route getting tougher for VCs in SEA as recession looms</a><br />\nAccording to Altara Ventures&#8217;s Gavin Teo, would-be buyers are focused on their own businesses and facing higher costs of capital, meaning less valuable shares and higher borrowing costs to finance acquisitions.</p>\n<p><a rel=\"follow\" href=\"https://www.dealstreetasia.com/stories/ascend-vietnam-closes-debut-fund-314074\">Ascend Vietnam closes debut early-stage fund at US$64M</a><br />\nIn June, Ascend announced that it had exceeded the US$50M target for the fund, which will see seeding up to US$2M into 25 startups and following up with cheques of up to US$5M.</p>\n<p><a rel=\"follow\" href=\"https://www.dealstreetasia.com/stories/amazon-vietnam-growth-314272\">Amazon Vietnam says growth is defying global slowdown</a><br />\nGijae Seong, head of Amazon Global Selling in Vietnam, said the local division has grown more strongly this year than in 2021, even as the company last week reported a US$2.5B Q3 operating loss for its international segment.</p>\n<p><a rel=\"follow\" href=\"https://www.techinasia.com/bukalapak-q3-financial\">Bukalapak posts 86% YoY revenue growth in Q3 2022</a><br />\nIt recorded US$57.6M in the quarter; This comes on the back of a strong performance from Mitra Bukalapak, an O2O solution that helps small retailers in the country procure physical goods to sell.</p>\n<p><a rel=\"follow\" href=\"https://www.techinasia.com/recession-run-wavemakers-santos-sees-crisis-flight-quality\">Wavemaker’s Paul Santos sees a crisis as a flight to quality</a><br />\n“If in a crisis your customers find less value in your product, then you have to ask yourself why. But if your customers continue to find value in your offering, then that’s interesting,” says Wavemaker&#8217;s managing partners.</p>\n<p><a rel=\"follow\" href=\"https://www.techinasia.com/straitsx-grab-test-purposebound-money-temaseksponsored-vouchers\">Grab, StraitsX to test ‘purpose-bound money’ at SG fintech festival</a><br />\nThe pilot will involve 5,000 trial participants that will use the vouchers through their preferred blockchain e-wallet app; Purpose-bound money enables senders to dictate conditions for the use of their digital SGD.</p>\n<p><a rel=\"follow\" href=\"https://finance.yahoo.com/news/indonesia-stock-exchange-signs-mou-010000816.html\">Indonesia&#8217;s IDX signs MoU with SG-based green fintech firm MVGX</a><br />\nIDX is preparing a trading system for a carbon exchange in Indonesia; MVGX will provide IDX with opportunities to explore its industry-grade software to establish IDX’s carbon exchange capabilities.</p>\n<p><a rel=\"follow\" href=\"https://www.techinasia.com/hodlnaut-founders-hid-financial-documents-singapore-court-report\">Hodlnaut founders hid financial documents, says court report</a><br />\nThey withheld financial documents from Holdnaut&#8217;s Interim Judicial Managers (IJMs) at EY Corporate Advisors; This comes just a week after the IJMs and Hodlnaut co-founder Simon Lee filed affidavits against each other over allegations of dishonesty.</p>\n<p><a rel=\"follow\" href=\"https://www.techinasia.com/scb-10x-invests-10m-sg-crypto-safeguard-startup\">SCB 10X invests US$10M in SG crypto custodian RakkaR Digital</a><br />\nThe startup provides institutions on the digital asset custody platform Fireblocks with a place to store and manage their Web3 assets; The firm’s institutional customers include ANZ, BNP Paribas, BlockFi, and Nexo.</p>\n<p><a rel=\"follow\" href=\"https://e27.co/post-covid-19-demand-for-home-services-have-smoothened-from-weekend-spikes-to-weekdays-rupam-biswas-of-sendhelper-20221028/\">&#8216;Post-COVID-19, demand for home services have smoothened from weekend spikes to weekdays&#8217;</a><br />\nRupam Biswas of Sendhelper said when there is no fear around COVID-19, more orders come in because people spend more time at home and are comfortable with home services.</p>\n<p><a rel=\"follow\" href=\"https://e27.co/fundraising-in-time-of-crisis-why-sea-founders-can-remain-hopeful-20221028/\">Fundraising in time of crisis: Why SEA founders can remain hopeful</a><br />\nIn the startup ecosystem, raising VC funding is often viewed as an important milestone that a startup must go through; however, it is important to acknowledge that not all companies will raise external funding.</p>\n<p><a rel=\"follow\" href=\"https://e27.co/five-smart-ways-to-decarbonise-supply-chains-and-logistics-with-ai-20221027/\">5 smart ways to decarbonise supply chains and logistics with AI</a><br />\nGreen logistics facilitates sustainable logistics operations by reducing energy consumption or using alternative energy sources for logistics processes across various logistics legs.</p>\n<p><a rel=\"follow\" href=\"https://e27.co/5-customer-experience-cx-trends-to-consider-in-2022-20221027/\">5 customer experience trends to consider in 2022</a><br />\nMore businesses will leverage communications technologies enhanced by AI that help customer support teams do more with less; Businesses that are proactive instead of reactive to the needs and expectations of their customers will win customer loyalty.</p>\n<p>&#8212;</p>\n<p>Fundraising or preparing your startup for fundraising? Build your investor network, search from 400+ SEA investors on e27, and get connected or get insights regarding fundraising. <a class=\"ProsemirrorEditor-link\" rel=\"follow\" href=\"https://e27.co/membership/?utm_source=Boilerplate&utm_medium=Articles&utm_campaign=300TRIAL&utm_id=300TRIAL\" rel=\"follow\">Try e27 Pro for free today</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/alta-fundnel-acquires-hg-exchange-20221101/\">Ecosystem Roundup: SEA&#8217;s startup funding hits 7-quarter low in Q3; Alta buys Hg Exchange; Hodlnaut founders hid financial documents, court says</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}