{
  "title": "With This Bionic Nose, COVID Survivors May Smell the Roses Again",
  "link": "https://spectrum.ieee.org/covid-smell-prosthetic",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/two-scientists-in-white-lab-coats-look-at-a-mannequin-head-thats-wearing-a-pair-of-black-glasses-with-wires-sticking-out-from-s.png?id=31947210&width=1245&height=700&coordinates=0%2C42%2C0%2C172\"/><br/><br/><p>\n<strong>Richard Costanzo stands</strong> beside a mannequin head sporting spectacles decked with electronics and holds a vial of blue liquid up to a tiny sensor. An LED glows blue, and Costanzo’s phone displays the word “Windex.” Then he waves a vial of purple liquid and gets a purple light along with the message “Listerine.”\n</p><p>\n\t“There won’t be Scotch tape on the final model,” says \n\t<a href=\"https://medschool.vcu.edu/about/portfolio/detail.html?id=rcostanz\" rel=\"noopener noreferrer\" target=\"_blank\">Costanzo</a>, as he rearranges the gear in his lab at <a href=\"https://www.vcu.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Virginia Commonwealth University</a> (VCU), in Richmond. The prototype is a partial demonstration of a concept that he’s been working on for decades: a neuroprosthetic for smell. The mannequin represents someone who has lost their sense of smell to <a href=\"https://spectrum.ieee.org/tag/covid-19\" target=\"_blank\">COVID-19</a>, brain injury, or some other medical condition. It is also intended to show off the sensor, which is the same type used for commercial electronic noses, or \n\t<a href=\"https://en.wikipedia.org/wiki/Electronic_nose\" target=\"_blank\">e-noses</a>. In the final product, the sensor won’t light up an LED but will instead send a signal to the user’s brain.\n</p><p>\n\tIn the lab’s back room, another model shows the second half of the concept: There, the e-nose sensor transmits its signal to a small array of electrodes taken from a \n\t<a href=\"https://en.wikipedia.org/wiki/Cochlear_implant\" rel=\"noopener noreferrer\" target=\"_blank\">cochlear implant</a>. For people with hearing loss, such implants feed information about sound to the inner ear and then to the brain. The implant is also about the right size for the olfactory bulb on the edge of the brain. Why not use it to convey information about odor?\n</p><div class=\"rm-embed embed-media\"><div class=\"flourish-embed flourish-interactive diagram\" data-src=\"visualisation/11477812?602891\">\n<script src=\"https://public.flourish.studio/resources/embed.js\"> </script>\n</div></div><p>\n\tThis project could be a career-capping achievement for \n\tCostanzo, a professor emeritus of physiology and biophysics who in the 1980s cofounded VCU’s \n\t<a href=\"https://ent.vcu.edu/specialties/smell-and-taste-disorders-center/\" target=\"_blank\">Smell and Taste Disorders Center,</a> one of the first such clinics in the country. After years of research on olfactory loss and investigations into the possibility of biological regeneration, he began working on a hardware solution in the 1990s.<br/>\n</p><p>\n\tA self-described electronics buff, Costanzo enjoyed his experiments with sensors and electrodes. But the project really took off in 2011 when he began talking with his colleague \n\t<a href=\"https://www.vcuhealth.org/find-a-provider/daniel-coelho\" target=\"_blank\">Daniel Coelho</a>, a professor of otolaryngology at VCU and an expert in cochlear implants. They recognized at once that a smell prosthetic could be similar to a cochlear implant: “It’s taking something from the physical world and translating it into electrical signals that strategically target the brain,” Coelho says. In 2016 the two researchers were awarded a U.S. patent for their <a href=\"https://patents.google.com/patent/US9517342B2/fr\" target=\"_blank\">olfactory-implant system</a>.\n</p><div class=\"rm-embed embed-media\"><div class=\"flourish-embed flourish-interactive diagram\" data-src=\"visualisation/11478179?602891\">\n<script src=\"https://public.flourish.studio/resources/embed.js\"> </script>\n</div></div><p>\n\tCostanzo’s quest became abruptly more relevant in early 2020, when many patients with a new illness called COVID-19 realized they had lost their senses of smell and taste. Three years into the pandemic, some of those patients have still not recovered those faculties. When you also consider people who have lost their sense of smell due to other diseases, brain injury, and aging, this niche technology starts to look like a viable product. Add in Costanzo and Coelho’s other collaborators—including an electronic nose expert in England, several clinicians in Boston, and a businessman in Indiana—and you have a dream team who just might make it happen.\n</p><p>\n\tCostanzo says he’s wary of hype and doesn’t want to give people the impression that a commercial device will be available any day now. But he does want to offer hope. Right now, the team is focused on getting the sensors to detect more than a few odors and figuring out how best to interface with the brain. “I think we’re several years away from cracking those nuts,” Costanzo says, “but I think it’s doable.”\n</p><h2>How people can lose their sense of smell</h2><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"Headshot of a smiling man with a shaved head and blue checkered shirt.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"f8b8779b7d571d9aae42016642fdd348\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"d9892\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/headshot-of-a-smiling-man-with-a-shaved-head-and-blue-checkered-shirt.jpg?id=31947103&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">After Scott Moorehead lost his sense of smell after a head injury, he began supporting research on smell prosthetic technology.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Round Room</small>\n</p><p>\n<strong><a href=\"https://www.linkedin.com/in/scott-moorehead-bb547b37/\" rel=\"noopener noreferrer\" target=\"_blank\">Scott Moorehead</a> just</strong> <strong>wanted</strong> to teach his 6-year-old son how to skateboard. On a Sunday in 2012 he was demonstrating some moves in the driveway of his Indiana home when the skateboard hit a crack and flipped him off. “The back of my skull bore the brunt of the fall,” he says. He spent three days in the intensive care unit, where doctors treated him for multiple skull fractures, massive internal bleeding, and damage to his brain’s frontal lobe.\n</p><p>\n\tOver weeks and months his hearing came back, his headaches went away, and his irritability and confusion faded. But he never regained his sense of smell.\n</p><p>\n\tMoorehead’s accident permanently disconnected the nerves that run from the nose to the olfactory bulb at the base of the brain. Along with his sense of smell, he lost all but a rudimentary sense of taste. “Flavor comes mostly from smell,” he explains. “My tongue on its own can only do sweet, salty, spicy, and bitter. You can blindfold me and put 10 flavors of ice cream in front of me, and I won’t know the difference: They’ll all taste slightly sweet, except chocolate that’s a bit bitter.”\n</p><p>\n\tMoorehead grew depressed: Even more than the flavors of food, he missed the unique smells of the people he loved. And on one occasion he was oblivious to a gas leak, only realizing the danger when his wife came home and raised the alarm.\n</p><p>\n<a href=\"https://en.wikipedia.org/wiki/Anosmia\" target=\"_blank\">Anosmia</a>, or the inability to smell, can be caused not only by head injuries but also by exposure to certain toxins and by a variety of medical problems—including tumors, Alzheimer’s, and viral diseases, such as COVID. The sense of smell also commonly atrophies with age; in <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5033684/\" target=\"_blank\">a 2012 study</a> in which more than 1,200 adults were given olfactory exams, 39 percent of participants age 80 and above had olfactory dysfunction.\n</p><p>\n\tThe loss of smell and taste have been dominant symptoms of COVID since the beginning of the pandemic. People with COVID-induced anosmia currently have only three options: Wait and see if the sense comes back on its own, ask for a steroid medication that reduces inflammation and may speed recovery, or begin \n\t<a href=\"https://www.enthealth.org/be_ent_smart/smell-retraining-therapy/\" target=\"_blank\">smell rehab</a>, in which they expose themselves to a few familiar scents each day to encourage the restoration of the nose-brain nerves. Patients typically do best if they seek out medication and rehab within a few weeks of experiencing symptoms, before scar tissue builds up. But even then, these interventions don’t work for everyone.\n</p><p>\n\tIn April 2020, researchers at VCU’s smell and taste clinic launched a nationwide survey of adults who had been diagnosed with COVID to determine the prevalence and duration of smell-related symptoms. They’ve followed up with those people at regular intervals, and this past August they published results from people who were two years past their initial diagnosis. The \n\t<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9375644/\" target=\"_blank\">findings</a> were striking: Thirty-eight percent reported a full recovery of smell and taste, 54 percent reported a partial recovery, and 7.5 percent reported no recovery at all. “It’s a serious quality of life issue,” says <a href=\"https://ent.vcu.edu/about/faculty/evan-reiter-md-facs.html\" target=\"_blank\">Evan Reiter</a>, director of the VCU clinic.\n</p><p>\n\tWhile other researchers are investigating biological approaches, such as using stem cells to regenerate odor receptors and nerves, Costanzo believes the hardware approach is the only solution for people with total loss of smell. “When the pathways are really out of commission, you have to replace them with technology,” he says.\n</p><p>\n\tUnlike most anosmics, Scott Moorehead didn’t give up when his doctors told him there was nothing he could do to recover his sense of smell. As the CEO of a \n\t<a href=\"https://www.roundroom.com/\" target=\"_blank\">cellphone retail company</a> with stores in 43 states, he had the resources to invest in long-shot research. And when a colleague told him about the work at VCU, he got in touch and offered to help. Since 2015, Moorehead has put almost US $1 million into the research. He also licensed the technology from VCU and launched a startup called Sensory Restoration Technologies.\n</p><p>\n\tWhen COVID struck, Moorehead saw an opportunity. Although they were far from having a product to advertise, he scrambled to put up a \n\t<a href=\"https://www.sensoryrestorationtechnologies.com/\" target=\"_blank\">website</a> for the startup. He remembers saying: “People are losing their sense of smell. People need to know we exist!”\n</p><h2>How the sense of smell works</h2><p>\n<strong>Equivalent neuroprosthetics exist</strong> for other senses. Cochlear implants are the most successful neurotechnology to date, with \n\t<a href=\"https://www.nidcd.nih.gov/health/cochlear-implants\" target=\"_blank\">more than 700,000 devices</a> implanted in ears around the world. Retina implants have been developed for blind people (though some bionic-vision systems <a href=\"https://spectrum.ieee.org/bionic-eye-obsolete\" target=\"_self\">have had commercial trouble</a>), and researchers are even working on restoring the sense of touch to people with <a href=\"https://spectrum.ieee.org/creating-a-prosthetic-hand-that-can-feel\" target=\"_self\">prosthetic limbs</a> and <a href=\"https://spectrum.ieee.org/brain-implants-and-wearables-let-paralyzed-people-move-again\" target=\"_self\">paralysis</a>. But smell and taste have long been considered too hard a challenge.\n</p><p>\n\tTo understand why, you need to understand the marvelous complexity of the human olfactory system. When the smell of a rose wafts up into your nasal cavity, the odor molecules bind to receptor neurons that send electrical signals up the olfactory nerves. Those nerves pass through a bony plate to reach the olfactory bulb, a small neural structure in the forebrain. From there, information goes to the amygdala, a part of the brain that governs emotional responses; the hippocampus, a structure involved in memory; and the frontal cortex, which handles cognitive processing.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"An anatomical diagram shows a three-layered structure with olfactory receptors at the bottom, where they\\u2019re binding with odorant molecules, a layer of bone in the middle, and a yellow shape representing the olfactory bulb at top. The olfactory receptor cells have long protrusions that go up through the bone to the olfactory bulb. \" class=\"rm-shortcode\" data-rm-shortcode-id=\"83b0f019d176fe2816b32842afdf775a\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"9c310\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/an-anatomical-diagram-shows-a-three-layered-structure-with-olfactory-receptors-at-the-bottom-where-they-u2019re-binding-with-od.png?id=31947120&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Odor molecules that enter the nose bind to olfactory receptor cells, which send signals through the bone of the cribriform plate to reach the olfactory bulb. From there, the signals are sent to the brain.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">James Archer/Anatomy Blue</small>\n</p><p>\n\tThose branching neural connections are the reason that smells can sometimes hit with such force, conjuring up a happy memory or a traumatizing event. “The olfactory system has access to parts of the brain that other senses don’t,” Costanzo says. The diversity of brain connections, Coelho says, also suggests that stimulating the olfactory system could have other applications, going well beyond appreciating food or noticing a gas leak: “It could affect mood, memory, and cognition.”\n</p><p>\n\tThe biological system is difficult to replicate for a few reasons. A human nose has around 400 different types of receptors that detect odor molecules. Working together, those receptors enable humans to distinguish between a staggering number of smells: A 2014 study estimated the number at \n\t<a href=\"https://www.science.org/doi/10.1126/science.1249168\" target=\"_blank\">1 trillion</a>. Until now, it hasn’t been practical to put 400 sensors on a chip that would be attached to a user’s eyeglasses. What’s more, researchers don’t yet fully understand the olfactory code by which stimulating certain combinations of receptors leads to perceptions of odor in the brain. Luckily, Costanzo and Coelho know people working on both of those problems.\n</p><h2>Progress on e-noses and brain stimulation</h2><p>\n<strong>E-noses are already</strong> <strong>used</strong> today in a variety of industrial, office, and residential settings—if you have a typical carbon-monoxide detector in your home, you have a very simple e-nose.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"Headshot of a smiling man with glasses.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"99c643d40df38e64646fd50aee0cca8a\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"1ac78\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/headshot-of-a-smiling-man-with-glasses.jpg?id=31941916&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Krishna Persaud is advising the Virginia Commonwealth University team on e-nose sensors.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">The University of Manchester</small>\n</p><p>\n\t“Traditional gas sensors are based on semiconductors like metal oxides,” explains \n\t<a href=\"https://www.research.manchester.ac.uk/portal/en/researchers/krishna-persaud(e1566e46-12eb-41ed-af14-937f42255f4e).html\" target=\"_blank\">Krishna Persaud</a>, a leading e-nose researcher and a professor of chemoreception at the University of Manchester, in England. He’s also an advisor to Costanzo and Coelho. In the most typical e-nose setup, he says, “when a molecule interacts with the semiconductor material, a change in resistance occurs that you can measure.” Such sensors have been shrinking over the last two decades, Persaud says, and they’re now the size of a microchip. “That makes them very convenient to put in a small package,” he says. In the VCU team’s early experiments, they used an off-the-shelf sensor from a Japanese company called <a href=\"https://www.figarosensor.com/product/\" target=\"_blank\">Figaro</a>.\n</p><p>\n\tThe problem with such commercially available sensors, Persaud says, is that they can’t distinguish between very many different odors. That’s why he’s been working with new materials, such as conductive polymers that are cheap to manufacture, low power, and can be grouped together in an array to provide sensitivity to dozens of odors. For the neuroprosthetic, “in principle, several hundred [sensors] could be feasible,” Persaud says.\n</p><p>\n\tA first-generation product wouldn’t allow users to smell hundreds of different odors. Instead, the VCU team imagines initially including receptors for a few safety-related smells, such as smoke and natural gas, as well as a few pleasurable ones. They could even customize the prosthetic to give users smells that are meaningful to them: the smell of bread for a home baker, for example, or the smell of a pine forest for an avid hiker.\n</p><p>\n\tPairing this e-nose technology with the latest neurotechnology is Costanzo and Coelho’s current challenge. While working with Persaud to test new sensors, they’re also partnering with clinicians in Boston to investigate the best method of sending signals to the brain.\n</p><p>\n\tThe VCU team laid the groundwork with animal experiments. In experiments with rats in \n\t<a href=\"https://pubmed.ncbi.nlm.nih.gov/27165674/\" target=\"_blank\">2016</a> and <a href=\"https://pubmed.ncbi.nlm.nih.gov/29719130/\" target=\"_blank\">2018</a>, the team showed that using electrodes to directly stimulate spots on the surface of the olfactory bulb generated patterns of neural activity deep in the bulb, in the neurons that passed messages on to other parts of the brain. The researchers called these patterns odor maps. But while the neural activity indicated that the rats were perceiving <em>something</em>, the rats couldn’t tell the researchers what they smelled.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A doctor stands over a patient seated in a chair and holds an endoscopy probe inside her nostril. On the wall, a screen shows the images that the probe is capturing.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"e27a14e2cab1a74dce003585a1ae29ce\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"6683c\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-doctor-stands-over-a-patient-seated-in-a-chair-and-holds-an-endoscopy-probe-inside-her-nostril-on-the-wall-a-screen-shows-th.jpg?id=31941924&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Eric Holbrook, an otolaryngologist, often works with patients who need surgeries in their sinus cavities. He has helped the VCU team with preliminary clinical experiments.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Massachusetts Eye and Ear</small>\n</p><p>\n\tTheir next step was to recruit collaborators who could perform similar trials with human volunteers. They started with one of Costanzo’s former students, \n\t<a href=\"https://doctors.masseyeandear.org/details/214/eric-holbrook-otolaryngology-boston\" target=\"_blank\">Eric Holbrook</a>, an associate professor of otolaryngology at Harvard Medical School and director of rhinology at <a href=\"https://www.masseyeandear.org/\" target=\"_blank\">Massachusetts Eye and Ear</a>. Holbrook spends much of his time operating on people’s <a href=\"https://en.wikipedia.org/wiki/Paranasal_sinuses\" target=\"_blank\">sinus cavities</a>, including the <a href=\"https://en.wikipedia.org/wiki/Ethmoid_sinus\" target=\"_blank\">ethmoid sinus cavities</a>, which are positioned just below the cribriform plate, a bony structure that separates the olfactory receptors from the olfactory bulb.\n</p><p>\n\tHolbrook discovered, in 2018, that placing electrodes on the bone transmitted an electrical pulse to the olfactory bulb. In a trial with awake patients, three of the five volunteers \n\t<a href=\"https://onlinelibrary.wiley.com/doi/full/10.1002/alr.22237\" target=\"_blank\">reported smell perception</a> during this stimulation, with the reported odors including “an onionlike smell,” “antiseptic-like and sour,” and “fruity but bad.” While Holbrook sees the trial as a good proof of concept for an olfactory-implant system, he says that poor conductance through the bone was an important limiting factor. “If we are to provide discrete, separate areas of stimulation,” he says, “it can’t be through bone and will need to be on the olfactory bulb itself.”\n</p><p>\n\tPlacing electrodes on the olfactory bulb would be new territory. “Theoretically,” says Coelho, “there are many different ways to get there.” Surgeons could go down through the brain, sideways through the eye socket, or up through the nasal cavity, breaking through the cribriform plate to reach the bulb. Coelho explains that rhinology surgeons often perform low-risk surgeries that involve breaking through the cribriform plate. “What’s new isn’t how to get there or clean up afterward,” he says, “it’s how do you keep an indwelling foreign body in there without causing problems.”\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A surgeon wearing scrubs and a facemask holds the end of a robotic surgical tool.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"c06dd9e1c2c5649ad622eee6c3a4d21b\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"d3a7b\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-surgeon-wearing-scrubs-and-a-facemask-holds-the-end-of-a-robotic-surgical-tool.jpg?id=31941926&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Mark Richardson, a neurosurgeon, has epilepsy patients who volunteer for neuroscience studies while they’re in the hospital for brain monitoring with implanted electrodes.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Pat Piasecki</small>\n</p><p>\n\tAnother tactic entirely would be to skip over the olfactory bulb and instead stimulate “downstream” parts of the brain that receive signals from the olfactory bulb. Championing that approach is another of Costanzo’s former students, \n\t<a href=\"https://www.brainmodulationlab.org/mark-richardson\" target=\"_blank\">Mark Richardson</a>, director of functional neurosurgery at Massachusetts General Hospital. Richardson often has epilepsy patients spend several days in the hospital with electrodes in their brains, so that doctors can determine which brain regions are involved in their seizures and plan surgical treatments. While such patients are waiting around, however, they’re often recruited for neuroscience studies.\n</p><p>\n\tTo contribute to Costanzo and Coelho’s research, Richardson’s team asked epilepsy patients in the monitoring unit to take a sniff of a wand imbued with a smell such as peppermint, fish, or banana. The electrodes in their brains showed the pattern of resulting neural activity “in areas where we expected, but also in areas where we didn’t expect,” Richardson says. To better understand the brain responses, his team has just begun another round of experiments with a tool called an olfactometer that will release more precisely timed bursts of smell.\n</p><p>\n\tOnce the researchers know where the brain lights up with activity in response to, say, the smell of peppermint, they can try stimulating those areas with electricity alone in hopes of creating the same sensation. “With the existing technology, I think we’re closer to inducing the [smell perceptions] with brain stimulation than with olfactory-bulb stimulation,” Richardson says. He notes that there are already approved implants for brain stimulation and says using such a device would make the regulatory path easier. However, the distributed nature of smell perception within the brain poses a new complication: A user would likely need multiple implants to stimulate different areas. “We might need to hit different sites in quick succession or all at once,” he says.\n</p><h2>The path to a commercial device</h2><p>\n<strong>Across the Atlantic,</strong> the European Union is funding its own olfactory-implant project, called \n\t<a href=\"https://cordis.europa.eu/project/id/964529\" target=\"_blank\">ROSE</a> (Restoring Odorant detection and recognition in Smell dEficits). It launched in 2021 and involves seven institutions across Europe.\n</p><p>\n<a href=\"https://www.linkedin.com/in/thomas-hummel-b1486817/\" target=\"_blank\">Thomas Hummel</a>, head of the <a href=\"https://www.uniklinikum-dresden.de/en/the-hospital/departments-and-institutes/otorhinolaryngology/interdisciplinary-center-smell-taste\" target=\"_blank\">Smell & Taste Clinic</a> at the Technical University of Dresden and a member of the consortium, says the ROSE researchers are partnering with <a href=\"https://aryballe.com/\" target=\"_blank\">Aryballe</a>, a French company that makes a tiny sensor for odor analytics. The partners are currently experimenting with stimulating both the olfactory bulb and the prefrontal cortex. “All the parts that are needed for the device, they already exist,” he says. “The difficulty is to bring them together.” Hummel estimates that the consortium’s research could lead to a commercial product in 5 to 10 years. “It’s a question of effort and a question of funding,” he says.\n</p><p>\n\tPersaud, the e-nose expert, says the jury is out on whether a neuroprosthetic could be commercially viable. “Some people with anosmia would do anything to have that sense back to them,” he says. “It’s a question of whether there are enough of those people out there to make a market for this device,” he says, given that surgery and implants always carry some amount of risk.\n</p><p>\n\tThe VCU researchers have already had an informal meeting with regulators from the U.S. Food and Drug Administration, and they’ve started the early steps of the process for approving an implanted medical device. But Moorehead, the investor who tends to focus on practical matters, says this dream team might not take the technology all the way to the finish line of an FDA-approved commercial system. He notes that there are plenty of existing medical-implant companies that have that expertise, such as the Australian company \n\t<a href=\"https://www.cochlear.com/us/en/about-us\" target=\"_blank\">Cochlear</a>, which dominates the cochlear-implant market. “If I can get [the project] to the stage where it’s attractive to one of those companies, if I can take some of the risk out of it for them, that will be my best effort,” Moorehead says.\n</p><p>\n\tRestoring people’s ability to smell and taste is the ultimate goal, Costanzo says. But until then, there’s something else he can give them. He often gets calls from desperate people with anosmia who have found out about his work. “They’re so appreciative that someone is working on a solution,” Costanzo says. “My goal is to provide hope for these people.” \n\t<span class=\"ieee-end-mark\"></span>\n</p><p>\n<em>This article appears in the November 2022 print issue as “A Bionic Nose to Smell the Roses Again.”</em>\n</p>",
  "pubDate": "Mon, 17 Oct 2022 15:00:00 +0000",
  "guid": "https://spectrum.ieee.org/covid-smell-prosthetic",
  "category": [
    "Covid-19",
    "E-nose",
    "Neuroprosthetic",
    "Neurotech",
    "Neurotechnology",
    "Type:cover"
  ],
  "dc:creator": "Eliza Strickland",
  "media:content": ""
}