{
  "title": "LE3D: A Lightweight Ensemble Framework of Data Drift Detectors for Resource-Constrained Devices. (arXiv:2211.01840v1 [cs.LG])",
  "link": "http://arxiv.org/abs/2211.01840",
  "description": "<p>Data integrity becomes paramount as the number of Internet of Things (IoT)\nsensor deployments increases. Sensor data can be altered by benign causes or\nmalicious actions. Mechanisms that detect drifts and irregularities can prevent\ndisruptions and data bias in the state of an IoT application. This paper\npresents LE3D, an ensemble framework of data drift estimators capable of\ndetecting abnormal sensor behaviours. Working collaboratively with surrounding\nIoT devices, the type of drift (natural/abnormal) can also be identified and\nreported to the end-user. The proposed framework is a lightweight and\nunsupervised implementation able to run on resource-constrained IoT devices.\nOur framework is also generalisable, adapting to new sensor streams and\nenvironments with minimal online reconfiguration. We compare our method against\nstate-of-the-art ensemble data drift detection frameworks, evaluating both the\nreal-world detection accuracy as well as the resource utilisation of the\nimplementation. Experimenting with real-world data and emulated drifts, we show\nthe effectiveness of our method, which achieves up to 97% of detection accuracy\nwhile requiring minimal resources to run.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Mavromatis_I/0/1/0/all/0/1\">Ioannis Mavromatis</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sanchez_Mompo_A/0/1/0/all/0/1\">Adrian Sanchez-Mompo</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Raimondo_F/0/1/0/all/0/1\">Francesco Raimondo</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Pope_J/0/1/0/all/0/1\">James Pope</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Bullo_M/0/1/0/all/0/1\">Marcello Bullo</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Weeks_I/0/1/0/all/0/1\">Ingram Weeks</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kumar_V/0/1/0/all/0/1\">Vijay Kumar</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Carnelli_P/0/1/0/all/0/1\">Pietro Carnelli</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Oikonomou_G/0/1/0/all/0/1\">George Oikonomou</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Spyridopoulos_T/0/1/0/all/0/1\">Theodoros Spyridopoulos</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Khan_A/0/1/0/all/0/1\">Aftab Khan</a>"
}