{
  "id": "yt:video:sSJmUmCHAJY",
  "yt:videoId": "sSJmUmCHAJY",
  "yt:channelId": "UCV4Rx1m-9HmtqHET7GjnVOA",
  "title": "The surprising variety of simulating fluids - a vivid exploration",
  "link": "",
  "author": {
    "name": "braintruffle",
    "uri": "https://www.youtube.com/channel/UCV4Rx1m-9HmtqHET7GjnVOA"
  },
  "published": "2022-06-17T10:04:35+00:00",
  "updated": "2022-06-30T16:30:38+00:00",
  "media:group": {
    "media:title": "The surprising variety of simulating fluids - a vivid exploration",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "A vivid introduction to fluid simulation.\n\nTopics covered: rarefied gas dynamics, continuum gas dynamics, fluid motion descriptions & coordinates (spatially fixed (Eulerian), material-fixed (Lagrangian), arbitrary), reducibility aspects, motivation on modeling unresolved flow structures, ensemble averages of microscopically and macroscopically varying data, usefulness of the modeling hierarchy, simplifying and decoupling the evolution equations, Navier-Stokes equations, compressible flow and the incompressible flow assumptions, and buoyancy-driven flow (Boussinesq approximation).\n\n\nSpecial thanks to my supporters:\n-----------------------------------------------------\nAxisAngles\nYuxuan Zhang\nHouston Lucas\nPatrick Gibson\n... and all my patrons!\n\nIf you like what you see and want to support my work, join my Patreon feed. I really appreciate it!\nhttps://www.patreon.com/braintruffle\n\n\nTimetable:\n-----------------\n00:00 - What's going on\n02:15 - Recap on continuous fluid fields\n05:06 - Continuous evolution and local similarity\n06:52 - Motion description and evolution equations\n20:41 - Ensemble averages of macroscopic data\n23:52 - Usefulness of the modeling hierarchy\n25:13 - Playing with the equations\n27:50 - Compressible and incompressible flow\n32:39 - Buoyancy-driven flow\n37:22 - Decoupling of the equations\n39:30 - Thanks to my supporters and recap\n\n\nSelected Learning Resources:\n------------------------------------------------\n02:15 - Continuous flow fields from rarefied gas dynamics and continuum gas dynamics: [1,2,3,4,5,6]\n04:10 - Continuous perspective on the microscale; continuum micromechanics (to be discussed): [7]\n06:52 - Fluid motion description and coordinates (spatially fixed (Eulerian), material-fixed (Lagrangian), arbitrary); evolution equations; material derivative; discretization aspects: [8,9,10]\n22:05 - Ensemble averages of microscopic and macroscopic data; modeling unresolved flow structures; Kolmogorov microscales (to be discussed); turbulence modelling (to be discussed); 2d vs 3d turbulence (to be discussed): [1,11,12]\n27:50 - Compressible flow; incompressible flow assumptions: [2]\n32:39 - Buoyancy-driven flow (Boussinesq approximation); treating slight density variations: [13]\n37:22 - Decoupling the equations: [2]\n\nReferences:\n[1] - Lecture Notes: from \"http://volkov.eng.ua.edu/ME591_491_NEGD/2017-Spring-NEGD-01-ElemKineticTheory.pdf\" to \"NEGD-06\"\n[2] - Book: White, Frank M. \"Fluid mechanics.\" Tata McGraw-Hill Education, 2010.\n[3] - Book: Anderson, John D. \"Governing equations of fluid dynamics. Computational fluid dynamics.\" Springer, Berlin, Heidelberg, 1992. 15-51.\n[4] - Paper: Macrossan, M. N. \"Scaling parameters for hypersonic flow: correlation of sphere drag data.\", 2007.\n[5] - Lecture Notes: Cerfon, Antoine. \"Mechanics (Classical and Quantum).\" \"https://www.math.nyu.edu/~cerfon/mechanics.html\"\n[6] - Lecture Notes: Kenkre, V. M.. \"Statistical Mechanics.\" \"https://www.unm.edu/~aierides/505/\" specifically \".../bbgky2.pdf\" &  \".../bbgky3.pdf\"\n[7] - Paper: Zaoui, André. \"Continuum micromechanics: survey.\" Journal of Engineering Mechanics-ASCE 128.8 (2002): 808-816.\n[8] - Essay: Price, James F. \"Lagrangian and eulerian representations of fluid flow: Kinematics and the equations of motion.\" MIT OpenCourseWare, 2006.\n[9] - Book: Donea, J., Huerta, A., Ponthot, J.-Ph. and Rodríguez-Ferran, A., \"Arbitrary Lagrangian-Eulerian methods,\nThe Encyclopedia of Computational Mechanics\", Wiley, Vol. 1, Chapter 14, pp. 413-437, 2004\n[10] - Book: Bennett, Andrew. \"Lagrangian fluid dynamics.\" Cambridge University Press, 2006.\n[11] - Lecture Notes: Lermusiaux, P. \"Numerical Fluid Mechanics.\" \"https://ocw.mit.edu/courses/2-29-numerical-fluid-mechanics-spring-2015/pages/syllabus/\"\n[12] - Paper: Boffetta, Guido, and Robert E. Ecke. \"Two-dimensional turbulence.\" Annual review of fluid mechanics 44.1 (2012): 427-451.\n[13] - Paper: Mayeli, Peyman, and Gregory J. Sheard. \"Buoyancy-driven flows beyond the Boussinesq approximation: A brief review.\" International Communications in Heat and Mass Transfer 125 (2021): 105316.\n\n\nPlease note:\n--------------------\nThis series focuses specifically on the aspect of information reduction in dynamical systems. For clarity, I had to omit many exciting facets of the topics addressed in the video. So, the video itself is a reduction. :-)\n\nI hope you enjoyed this little braintruffle!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}