{
  "title": "529 - Debra Berger",
  "description": "<p>My friend Debra is a magical woman living a magical life. She’s the hub of many  wheels, the grain of sand in the oyster, the sun in solar systems, the log that breaks the logjam. She hangs out with movie stars, billionaires, artists, and visionaries. Her energy, generosity, and spirit attract the kinds of people most of us spend our lives hoping to meet — and nothing makes her happier than connecting them to one another and watching amazing things ensue. </p><p>Be sure to check out our <a target=\"_blank\" href=\"https://chrisryan.substack.com/p/254-debra-berger-actor-artist-mother-7ff?s=w#details\">previous episode</a> as well.</p><p>You can check out some of Debra’s creations in Vejer de la Frontera <a target=\"_blank\" href=\"https://www.casasvejerdebra.com/debra-berger/\">here</a>.</p><p>Intro music “Brightside of the Sun,” by <a target=\"_blank\" href=\"https://basinandrange.bandcamp.com/track/brightside-of-the-sun\">Basin and Range</a>. Outro: “Party at the End of the World,” by <a target=\"_blank\" href=\"https://www.carsieblanton.com/\">Carsie Blanton</a>.</p><p>A little something just for subscribers: This song/video of “Make Art not Friends,” by Sturgill Simpson keeps blowing my mind.</p><p><p>Tangentially Speaking with Chris Ryan is a reader-supported publication. To get access to bonus content including bonus episodes, newsletters, and exclusive blog posts, please become a paid subscriber.</p></p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://chrisryan.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">chrisryan.substack.com/subscribe</a>",
  "link": "https://chrisryan.substack.com/p/529-debra-berger",
  "guid": "substack:post:57626831",
  "dc:creator": "Chris Ryan",
  "pubDate": "Sat, 04 Jun 2022 16:00:49 GMT",
  "enclosure": "",
  "itunes:author": "Chris Ryan",
  "itunes:explicit": "No",
  "itunes:image": ""
}