{
  "title": "What’s the Tech Background of an Autonomous-Vehicle Engineer?",
  "link": "https://spectrum.ieee.org/av-engineer-jobs",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-smiling-man-in-a-black-shirt-and-jeans-in-the-foreground-behind-him-is-an-autonomous-car-that-says-cruise-on-the-side.jpg?id=30068063&width=1200&height=800&coordinates=0%2C0%2C0%2C182\"/><br/><br/><p><a href=\"https://www.getcruise.com/careers\" rel=\"noopener noreferrer\" target=\"_blank\">Cruise</a>, the San-Francisco–based designer and operator of all-electric self-driving cars, employs nearly 2,000 engineers, including somewhere between 300 and 900 engineers with Ph.D. degrees. They work in hardware and software. They specialize in AI, security, and safety. And though, indeed, some have robotics, automation, or automotive backgrounds, many don’t. Instead, they come from an incredibly long list of different technical fields—e-commerce, finance, game development, animation, cameras, semiconductors, and app development.</p><p>Here’s what <a href=\"https://www.linkedin.com/in/mohamedelshenawy\" rel=\"noopener noreferrer\" target=\"_blank\">Mohamed Elshenawy</a>, Cruise’s executive vice president of engineering, told <em>IEEE Spectrum</em> about the company’s workforce. (Elshenawy himself came to Cruise from stints as chief technology officer at a financial services startup and leader of a technology team at Amazon.)</p><p><em>I<strong>EEE Spectrum:</strong></em> <strong>Let’s start with the big picture of your engineering team.</strong></p><p><strong>Mohamed Elshenawy: </strong>In AI, we have machine-learning (ML) engineers that build the on-the-road decision-making modules. We also have the engineers that help build the tools for our continuous-learning machine. We have data engineers and data scientists, and even UI folks that help with the tools that the main core ML engineers use.</p><p>In robotics, we have AV foundations engineers, who build and maintain our robotics operating systems, and embedded systems developers.</p><p>In our security and safety operations, we have engineers working on threat modeling, app security engineering, IT enterprise security, and the security of the vehicle itself, along with all the systems engineers responsible for test validation, generating test-case scenarios, and tracking it all.</p><p>Our hardware engineers build our own EVs from the ground up, in partnership with <a href=\"https://www.gm.com/\" target=\"_blank\">GM</a> and <a href=\"http://www.honda.com/\" target=\"_blank\">Honda</a>. They handle the definition, design, development, and production of sensors, compute modules, and related hardware and include about 50 engineering disciplines, including acoustic engineers, power engineers, system-on-chips people, and so on.</p><p>Finally, we have the product engineering team—that covers both user-facing and internal apps—and the infrastructure team which builds the technical foundations (cloud infrastructure, internal tools, etc.) that the rest of our engineers rely on every day to get work done.</p><h3></h3><br/><div class=\"flourish-embed flourish-chart\" data-src=\"visualisation/10499631?594662\"><script src=\"https://public.flourish.studio/resources/embed.js\"></script></div><p><strong>Where do these engineers generally come from?</strong></p><p><strong>Elshenawy:</strong> Many of our AI engineers come from academia, consumer tech, and finance. Our simulation group is part of this team. They include several engineers that helped build <em>The Sims</em> and others that worked for gaming and animation studios like <a href=\"https://www.pixar.com/\" target=\"_blank\">Pixar</a>, <a href=\"https://www.lucasfilm.com/what-we-do/games/\" target=\"_blank\">LucasArts</a>, and <a href=\"https://www.ubisoft.com/en-us/\" target=\"_blank\">Ubisoft</a>. Our hardware engineers include people who came from <a href=\"https://www.kodak.com/en\" target=\"_blank\">Kodak</a>, <a href=\"https://www.jpl.nasa.gov/\" rel=\"noopener noreferrer\" target=\"_blank\">JPL</a>, and chipmakers, as well as academia. For robotics, we generally look to robotics, other automotive, and aerospace companies for hiring. On the security side, we hire a mix of researchers and practitioners—and even literal hackers, including the team that infamously <a href=\"https://www.wired.com/2015/07/hackers-remotely-kill-jeep-highway/\" rel=\"noopener noreferrer\" target=\"_blank\">hacked a Jeep</a>. Our product and infrastructure engineers come from a variety of traditional engineering companies as well as startups; they’ve previously built videoconferencing software, cloud computing platforms, and even a meditation app.</p><p><strong>How has the mix shifted over the years?</strong></p><p><strong>Elshenawy:</strong> We’re solving for a problem that is mainly rooted in general AI, so we’ve always been heavy on the AI side of things. Because we are cloud native, we are able to leverage a lot of the existing technology that is provided by cloud providers, such as <a href=\"https://cloud.google.com/\" target=\"_blank\">Google Cloud Platform</a> and <a href=\"https://azure.microsoft.com/en-us/\" target=\"_blank\">Azure</a>; we don’t need to reinvent that. So we’re leaning more heavily towards AI, robotics, and hardware over time.</p><p>Also, we’re ramping up product engineering now that we have started charging members of the public to ride in fully driverless cars. We expect that to continue to grow there as we solve for the technology and expand to multiple cities in the United States and internationally.</p><p><strong>You mean people working on the customer-facing app?</strong></p><p><strong>Elshenawy:</strong> That and a lot more. This includes the customer-facing app that lets you order a ride, the in-car experience, and all the fleet operation on the back end, where we control our fleet, placing our fleet ahead of demand and determining pricing, and all the services that keep these lights on.</p><h3></h3><br/><div class=\"flourish-embed flourish-chart\" data-src=\"visualisation/10520927?594662\"><script src=\"https://public.flourish.studio/resources/embed.js\"></script></div><p><strong>What do your engineers have in common?</strong><br/></p><p><strong>Elshenawy:</strong> The self-driving cars problem is a great AI problem, and some people think about it as essentially a research problem, because you’re pushing the state of the art. But when you think about how you are actually going to pragmatically ship something continuously, it’s all rooted in experimentation.</p><p>So one common factor that we find in the engineers who are successful here, regardless of where in our organization that they land, is having the experimentation mind-set, the humble, resilient mind-set of someone who’s continuously curious and very agile in nature. There are certain types of engineers that don’t deal well with uncertainty and experimentation, and there are other engineers who thrive under an environment of continuous learning.</p><p>So the common trait among all these engineers is that learning, curiosity, and experimentation mind-set, and having the agility to deal with an unknown problem like this one.</p><p><strong>What are the hardest roles to fill right now?</strong></p><p><strong>Elshenawy:</strong> Software, in general, has a shortage and will always have less supply than demand in the coming years, particularly in AI, applied machine learning, and deep learning, and we will continue to need these engineers in many different areas as we grow. Robotics specializations, and in general, control theory, will be very important as we go forward and those areas will continually face high demand.</p>",
  "pubDate": "Mon, 11 Jul 2022 17:45:43 +0000",
  "guid": "https://spectrum.ieee.org/av-engineer-jobs",
  "category": [
    "Ai",
    "Artificial intelligence",
    "Autonomous vehicles",
    "Engineering jobs",
    "Software engineering jobs",
    "Cruise",
    "Careers"
  ],
  "dc:creator": "Tekla S. Perry",
  "media:content": ""
}