{
  "title": "A comparison of the impacts of CMEs and CIRs on the Martian dayside and nightside ionospheric species. (arXiv:2207.09832v2 [physics.space-ph] UPDATED)",
  "link": "http://arxiv.org/abs/2207.09832",
  "description": "<p>Measurements from the Mars Atmosphere and Volatile EvolutioN (MAVEN)\nspacecraft, orbiting Mars are used for investigating the impact of coronal mass\nejections (CMEs) and corotating interaction regions (CIRs) on Martian\nionospheric species. We have chosen 15 CME and 15 CIR events at Mars from the\nexisting catalogs. We have extensively analyzed Martian dayside and nightside\nprofiles of ionospheric species during each of the CME and CIR events. We have\nselected the disturbed orbit plasma density profiles which are beyond the quiet\ntime mean profile during each event. The primary focus of this paper is to\nprovide a comparative average scenario of the variation of Martian ionospheric\nspecies during CME and CIR events between 150-500 km altitudes. A significant\ndifference can be observed in the profiles of Martian dayside and nightside\nionospheric species (O+, O2+, CO2+, NO+, C+, N+, &amp; OH+) during CMEs and CIRs.\nThe difference is more prominent on the nightside in comparison to the dayside\nionosphere. We have observed that the plasma densities were lower during CIRs\ncompared to CMEs. During CIRs, the nightside ion density is one order of\nmagnitude less (above 250 km) in comparison to CMEs. The mean peak altitude and\ndensity of the lighter ions (O+, C+, N+, &amp; OH+) were at lower altitudes during\nthe CIRs compared to CMEs. Therefore, this study suggests that the impact of\nCIRs on the Martian ionospheric species is more prominent compared to CMEs.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Ram_L/0/1/0/all/0/1\">Lot Ram</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Rout_D/0/1/0/all/0/1\">Diptiranjan Rout</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Rathi_R/0/1/0/all/0/1\">Rahul Rathi</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Mondal_S/0/1/0/all/0/1\">Subarna Mondal</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Sarkhel_S/0/1/0/all/0/1\">Sumanta Sarkhel</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Halekas_J/0/1/0/all/0/1\">Jasper Halekas</a>"
}