{
  "itunes:episodeType": "full",
  "itunes:title": "When Kids Say Shocking or Rude Things – What’s a Parent To Do?",
  "title": "When Kids Say Shocking or Rude Things – What’s a Parent To Do?",
  "itunes:author": "JLML Press",
  "itunes:subtitle": "A parent is distressed that his son says he doesn…",
  "itunes:summary": "A parent is distressed that his son says he doesn’t like, or is afraid of Black people, a sentiment that is abhorrent to him. \"Worst of all,\" the dad writes, \"he will say this when he sees Black neighbors.\" The dad realizes that his strong reactions may be making matters worse, but his son's statements are striking a particularly sensitive nerve. \"If this were literally anything else I would just minimize my responses to it and acknowledge the feeling.”  This parent feels at a loss and is hoping Janet has a solution. \"This is absolutely the biggest parenting challenge I have faced.\" \n\nFor more advice on common parenting issues, please check out Janet's best-selling books on Audible, FREE with a 30-day trial membership if you use this link: adbl.co/2OBVztZ. Paperbacks and e-books are also available at Amazon, Google Play, Barnes & Noble and Apple Books. \n\nJanet's exclusive audio series \"Sessions\" is available for download. This is a collection of recorded one-on-one consultations with parents discussing their most immediate and pressing concerns (www.SessionsAudio.com).\n\nAdvertising Inquiries: https://redcircle.com/brands\n\nPrivacy & Opt-Out: https://redcircle.com/privacy",
  "description": "<p>A parent is distressed that his son says he doesn’t like, or is afraid of Black people, a sentiment that is abhorrent to him. \"Worst of all,\" the dad writes, \"he will say this when he sees Black neighbors.\" The dad realizes that his strong reactions may be making matters worse, but his son's statements are striking a particularly sensitive nerve. \"If this were literally anything else I would just minimize my responses to it and acknowledge the feeling.” This parent feels at a loss and is hoping Janet has a solution. \"This is absolutely the biggest parenting challenge I have faced.\" </p><p>For more advice on common parenting issues, please check out Janet's best-selling books on Audible, FREE with a 30-day trial membership if you use this link: adbl.co/2OBVztZ. </p><p>Paperbacks and e-books are also available at Amazon, Google Play, Barnes & Noble and Apple Books. </p><p>Janet's exclusive audio series \"Sessions\" is available for download. This is a collection of recorded one-on-one consultations with parents discussing their most immediate and pressing concerns (www.SessionsAudio.com).</p><br/><br/>Advertising Inquiries: <a href='https://redcircle.com/brands'>https://redcircle.com/brands</a><br/><br/>Privacy & Opt-Out: <a href='https://redcircle.com/privacy'>https://redcircle.com/privacy</a>",
  "content:encoded": "<p>A parent is distressed that his son says he doesn’t like, or is afraid of Black people, a sentiment that is abhorrent to him. &#34;Worst of all,&#34; the dad writes, &#34;he will say this when he sees Black neighbors.&#34; The dad realizes that his strong reactions may be making matters worse, but his son&#39;s statements are striking a particularly sensitive nerve. &#34;If this were literally anything else I would just minimize my responses to it and acknowledge the feeling.” This parent feels at a loss and is hoping Janet has a solution. &#34;This is absolutely the biggest parenting challenge I have faced.&#34; </p><p>For more advice on common parenting issues, please check out Janet&#39;s best-selling books on Audible, FREE with a 30-day trial membership if you use this link: adbl.co/2OBVztZ. </p><p>Paperbacks and e-books are also available at Amazon, Google Play, Barnes &amp; Noble and Apple Books. </p><p>Janet&#39;s exclusive audio series &#34;Sessions&#34; is available for download. This is a collection of recorded one-on-one consultations with parents discussing their most immediate and pressing concerns (www.SessionsAudio.com).</p><br/><br/>Advertising Inquiries: <a href='https://redcircle.com/brands'>https://redcircle.com/brands</a><br/><br/>Privacy & Opt-Out: <a href='https://redcircle.com/privacy'>https://redcircle.com/privacy</a>",
  "enclosure": "",
  "guid": "tag:soundcloud,2010:tracks/897777442",
  "link": "https://soundcloud.com/janet-lansbury/when-kids-say-shocking-or-rude-things-whats-a-parent-to-do",
  "pubDate": "Tue, 22 Sep 2020 18:54:43 &#43;0000",
  "itunes:image": "",
  "itunes:duration": 1141,
  "itunes:explicit": "no"
}