{
  "title": "Dem SuperPAC Behind Joe Rogan Smear Campaign",
  "itunes:title": "Dem SuperPAC Behind Joe Rogan Smear Campaign",
  "pubDate": "Fri, 11 Feb 2022 07:44:55 +0000",
  "guid": "271fd80d-736a-421a-a125-b43ca92284aa",
  "link": "https://thejimmydoreshow.libsyn.com/dem-superpac-behind-joe-rogan-smear-campaign",
  "itunes:image": "",
  "description": "<p>It's been revealed that Meidas Touch, a Democratically-affiliated SuperPAC, has been the driving force behind the campaign to smear Joe Rogan as a racist, anti-trans spreader of vaccine misinformation. Aided, of course, by a compliant media eager to take down a successful podcaster who's not part of their \"club.\"<br /> <br /> Plus segments on \"Rising\" host Ryan Grim's attack on the Canadian truckers and a new report revealing that Tucker Carlson is the most watched cable news host among Democrats</p> <p>Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Joe Biden and Al Pacino!</p>",
  "content:encoded": "<p>It's been revealed that Meidas Touch, a Democratically-affiliated SuperPAC, has been the driving force behind the campaign to smear Joe Rogan as a racist, anti-trans spreader of vaccine misinformation. Aided, of course, by a compliant media eager to take down a successful podcaster who's not part of their \"club.\"  Plus segments on \"Rising\" host Ryan Grim's attack on the Canadian truckers and a new report revealing that Tucker Carlson is the most watched cable news host among Democrats</p> <p>Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Joe Biden and Al Pacino!</p>",
  "enclosure": "",
  "itunes:duration": "01:05:24",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "It's been revealed that Meidas Touch, a Democratically-affiliated SuperPAC, has been the driving force behind the campaign to smear Joe Rogan as a racist, anti-trans spreader of vaccine misinformation. Aided, of course, by a compliant media eager to...",
  "itunes:episodeType": "full",
  "itunes:summary": "It's been revealed that Meidas Touch, a Democratically-affiliated SuperPAC, has been the driving force behind the campaign to smear Joe Rogan as a racist, anti-trans spreader of vaccine misinformation. Aided, of course, by a compliant media eager to take down a successful podcaster who's not part of their \"club.\" Plus segments on \"Rising\" host Ryan Grim's attack on the Canadian truckers and a new report revealing that Tucker Carlson is the most watched cable news host among Democrats Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Joe Biden and Al Pacino!"
}