{
  "title": "534: What The Heck Is Going On With Credence in 'Fantastic Beasts'?",
  "link": "https://audioboom.com/posts/7958937",
  "itunes:episode": 534,
  "itunes:title": "What The Heck Is Going On With Credence in 'Fantastic Beasts'?",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4431,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode of MuggleCast, we follow up on our original character discussion on Credence Barebone, aka Corvus Lestrange, aka \"Aurelius Dumbledore\"? Wading deep into prophecy, including forming one of our own using Nostradamus, the hosts try to answer the question: \"Just what is going on with Credence?\" Listen as we find some answers by reviewing the scenes and subplots of <em>Fantastic Beasts: The Crimes of Grindelwald.<br>\n</em><br>\n\n</div>\n<ul>\n<li>We heard from the creator behind <a href=\"https://www.harrypotterdatabase.com/deleted-and-unreleased-scenes\">Harry Potter Database</a> and its astonishing collection of deleted and unreleased movie scenes!</li>\n<li>The surprise main character in <em>Crimes of Grindelwald</em> is Credence Barebone! Micah points out why this is more usual than unusual.</li>\n<li>Filmmakers chose twice not to include a scene where Credence survives his bout with MACUSA, both the end of the first film and the start of the second. Would such a scene have been an improvement?</li>\n<li>What brought Credence to \"Circus Arcanus,\" and is it all one master manipulation from Grindelwald that has set Credence on his path to find his 'family'?</li>\n<li>What do Credence's name origins tell us about the character, for his various names?</li>\n<li>We revisit an old e-mail which explains how Greek mythology may influence the future of the character.</li>\n<li>The hosts read aloud the predictions of Tycho Dodonus... and try to identify characters within.</li>\n<li>Could the \"son cruelly banished\" be somebody else, like Albus Dumbledore?</li>\n<li>Eric reads key passages from the script book which lends a little insight into that humongous shipwreck. Does the script book quietly reveal an important element?</li>\n<li>We revisit major theories about Credence including, is he Ariana's twin? Does he have her Obscurus? Is he really Corvus Lestrange, or a science experiment made by Dumbledore and Grindelwald?</li>\n<li>The hosts pick some numbers at random, and consult Nostradamus himself for a prediction of the future!</li>\n<li>Quizzitch: What was Leta Lestrange’s mother’s name? <a href=\"https://www.mugglecast.com/quizzitch/\">Submit your answer</a>!</li>\n<li>This week's episode is brought to you by Quip (get your first refill free at <a href=\"http://www.GetQuip.com/muggle\">GetQuip.com/muggle</a>) and Thirdlove (Get 20% off your first order at <a href=\"http://www.Thirdlove.com/mugglecast\">Thirdlove.com/mugglecast</a>)</li>\n</ul>\n",
  "pubDate": "Tue, 12 Oct 2021 14:25:04 +0000",
  "guid": "tag:audioboom.com,2021-10-12:/posts/7958937",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}