{
  "title": "AI Language Models Are Struggling to “Get” Math",
  "link": "https://spectrum.ieee.org/large-language-models-math",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/the-words-alice-has-five-more-balls-than-bob-who-has-two-balls-after-he-gives-four-to-charlie-how-many-balls-does-alice-have.jpg?id=31891762&width=1200&height=400&coordinates=0%2C221%2C0%2C222\"/><br/><br/><p>If computers are good at anything, they are good at math. So it may come as a surprise that after much struggling, top machine-learning researchers have recently made breakthroughs in teaching computers math.<br/></p><p>Over the past year, researchers from the University of California, Berkeley, OpenAI, and Google have made progress in teaching basic math concepts to <a href=\"https://spectrum.ieee.org/tag/large-language-models\" target=\"_blank\">natural language generation models</a>—algorithms such as <a href=\"https://arxiv.org/abs/2103.03874\" target=\"_blank\">GPT-2/3</a> and <a href=\"https://arxiv.org/abs/2109.02102\" target=\"_blank\">GPT-Neo</a>. However, until recently, language models regularly failed to solve even simple word problems, such as “Alice has five more balls than Bob, who has two balls after he gives four to Charlie. How many balls does Alice have?”</p><p>“When we say computers are very good at math, they’re very good at things that are quite specific,” says <a href=\"https://research.google/people/GuyGurAri/\" target=\"_blank\">Guy Gur-Ari</a>, a machine-learning expert at Google. Computers are good at arithmetic—plugging numbers in and calculating is child’s play. But outside of formal structures, computers struggle.</p><p class=\"pull-quote\">“I think there’s this notion that humans doing math have some rigid reasoning system—that there’s a sharp distinction between knowing something and not knowing something.”<br/>—Ethan Dyer, Google</p><p>Solving word problems, or “<a href=\"https://pll.harvard.edu/course/quantitative-reasoning-practical-math?delta=0\" target=\"_blank\">quantitative reasoning</a>,” is deceptively tricky because it requires a robustness and rigor that many other problems don’t. If any step during the process goes wrong, the answer will be wrong. “When multiplying really large numbers together…they’ll forget to carry somewhere and be off by one,” says Vineet Kosaraju, a machine-learning expert at OpenAI. Other mistakes made by language models are less human, such as misinterpreting 10 as a 1 and a 0, not 10.</p><p>“We work on math because we find it independently very interesting,” says <a href=\"https://scholar.google.com/citations?user=stCljMYAAAAJ&hl=en\" target=\"_blank\">Karl Cobbe</a>, a machine-learning expert at OpenAI. But as Gur-Ari puts it, if it’s good at math, “it’s probably also good at solving many other useful problems.”</p><p>As machine-learning models are trained on larger samples of data, they tend to grow more robust and make fewer mistakes. But scaling up seems to go only so far with quantitative reasoning; researchers realized that the mistakes language models make seemed to require a more targeted approach.</p><p>Last year, two different teams of researchers, at UC Berkeley and OpenAI, released two data sets, <a href=\"https://paperswithcode.com/paper/measuring-mathematical-problem-solving-with\" target=\"_blank\">MATH</a> and <a href=\"https://paperswithcode.com/dataset/gsm8k\" rel=\"noopener noreferrer\" target=\"_blank\">GSM8K</a>, respectively, which contain thousands of math problems across geometry, algebra, precalculus, and more. “We basically wanted to see if it was a problem with data sets,” says Steven Basart, a researcher at the <a href=\"https://safe.ai/\" target=\"_blank\">Center for AI Safety</a> who worked on MATH. Language models were known to be bad at word problems—but how bad were they, and could they be fixed by introducing better formatted, bigger data sets? The MATH group found just how challenging quantitative reasoning is for top-of-the-line language models, which scored less than 7 percent. (A human grad student scored 40 percent, while a math olympiad champ scored 90 percent.)</p><p>Models attacking GSM8K problems, which had easier grade-school-level problems, reached about 20 percent accuracy. The OpenAI researchers used two main techniques: fine-tuning and verification. In fine-tuning, researchers take a pretrained language model that includes irrelevant information (Wikipedia articles on zambonis, the dictionary entry for “gusto,” and the like) and then show the model, <em>Clockwork Orange</em>–style, only the relevant information (math problems). Verification, on the other hand, is more of a review session. “The model gets to see a lot of examples of its own mistakes, which is really valuable,” Cobbe says.</p><p>At the time, OpenAI predicted a model would need to be trained on 100 times more data to reach 80 percent accuracy on GSM8K. But in June, Google’s Minerva announced <a href=\"https://ai.googleblog.com/2022/06/minerva-solving-quantitative-reasoning.html\" target=\"_blank\">78 percent accuracy</a> with minimal scaling upwards. “It’s ahead of any of the trends that we were expecting,” Cobbe says. Basart agrees. “That’s shocking. I thought it would take longer,” he says.</p><p>Minerva uses Google’s own language model, <a href=\"https://ai.googleblog.com/2022/04/pathways-language-model-palm-scaling-to.html\" target=\"_blank\">Pathways Language Model</a> (PaLM), which is fine-tuned on scientific papers from the <a href=\"http://arxiv.org\" target=\"_blank\">arXiv</a> online preprint server and other sources with formatted math. Two other strategies helped Minerva. In “chain-of-thought prompting,” Minerva was required to break down larger problems into more palatable chunks. The model also used majority voting—instead of being asked for one answer, it was asked to solve the problem 100 times. Of those answers, Minerva picked the most common answer.</p><p>The gains from these new strategies were enormous. Minerva shot up to 50 percent accuracy on MATH and nearly 80 percent accuracy on GSM8K, as well as the MMLU, a more general set of STEM questions that included chemistry and biology. When Minerva was asked to redo a random sample of slightly tweaked questions, it performed just as well, suggesting that its capabilities were not from mere memorization.</p><p>What Minerva knows—or doesn’t know—about math is fuzzier. Unlike proof assistants, which come with built-in structure, Minerva and other language models have no formal structure. They can have strange, messy reasoning and still arrive at the right answer. As numbers grow larger, the language models’ accuracy falters, something that would never happen on a <a href=\"https://en.wikipedia.org/wiki/TI-84_Plus_series\" target=\"_blank\">TI-84</a>.</p><p>“Just how smart is it—or isn’t it?” asks Cobbe. Though models like Minerva might arrive at the same answer as a human, the actual process they’re following could be wildly different. On the other hand, chain-of-thought prompting is familiar to any human student who’s been asked to “show your work.”</p><p>“I think there’s this notion that humans doing math have some rigid reasoning system—that there’s a sharp distinction between knowing something and not knowing something,” says <a href=\"https://scholar.google.com/citations?user=LWeVRdUAAAAJ&hl=en\" target=\"_blank\">Ethan Dyer</a>, a machine-learning expert at Google. But humans give inconsistent answers, make errors, and fail to apply core concepts, too. The borders, at this frontier of machine learning, are blurred.</p><p><br/></p><p><strong></strong><em><strong>Update 14 Oct. 2022: </strong>A previous version of this story extraneously alluded to the DALL-E/DALL-E 2 art-generation AI in the context of </em><em>large language generation models being taught to handle math word problems. </em><em>Of course, neither DALL-E nor DALL-E 2 is a large language generation model. (And it was not studied in the math word problem research.) So to avoid confusion, references to it were cut. </em></p>",
  "pubDate": "Wed, 12 Oct 2022 13:55:00 +0000",
  "guid": "https://spectrum.ieee.org/large-language-models-math",
  "category": [
    "Large language models",
    "Machine learning",
    "Artificial intelligence",
    "Mathematics"
  ],
  "dc:creator": "Dan Garisto",
  "media:content": ""
}