{
  "title": "Joining NVidia",
  "link": "",
  "updated": "2018-11-26T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2018/11/26/joining-nvidia",
  "content": "<h2 id=\"summary\">Summary</h2>\n\n<p>I left employment at Anaconda Inc. last week.\nI start employment at NVIDIA next month.\nSurprisingly little will change.</p>\n\n<h2 id=\"history\">History</h2>\n\n<p>Four and a half years ago, Anaconda Inc (then Continuum Analytics) was kind\nenough to hire me to work on open source software to help scale the PyData\necosystem.</p>\n\n<p>I spent most of that time developing <a href=\"https://dask.org\">Dask</a>, a Python-native\nlibrary for scalable computing, as well as working with the broader Numeric\nPython community to scale their workloads to multi-core and distributed\nsystems.</p>\n\n<h2 id=\"thank-you-continuumanaconda\">Thank you Continuum/Anaconda</h2>\n\n<p>This has been a tremendously satisfying experience.  It has been intellectually\nstimulating work, and I feel that I’ve had a positive social impact, both on\nthe numeric Python community (Python now feels like a reasonable place to do\nscalable analytics) and more importantly on a number of humanitarian issues\nthat are important to me like climate change, human health, civic data\nanalysis, and so on.  I’ve also had the opportunity to engage with stakeholders\nin other software projects, small companies, large companies, government\nagencies, non-profit foundations and so forth; these interactions have helped\nme to become more effective in advocating and integrating open source software\ninto the broader world.</p>\n\n<p>Finally, this experience has been satisfying because I feel that I’ve helped\nothers to form a community.  There is a wonderful community of people who work\non and use Dask around the world within a great variety of different domains.\nSeeing bonds form and ideas flow between these groups has been wonderful, and I\nhope that these interactions will have cascading effects.  This group\naccomplishes more than I ever could have both because many of them are better\nprogrammers than I am, and because their range of perspectives provides much\nbetter coverage of the space.  Somehow, I still seem to get credit for things\n:)</p>\n\n<p>Starting this process was only possible because I was employed to do it as a\nfull-time job, so thank you Continuum/Anaconda for the opportunity to pursue\nthis work.</p>\n\n<h2 id=\"change-is-good\">Change is good</h2>\n\n<p>I joined Anaconda after quitting a postdoc position that, while fine, gave me\nnone of the satisfaction above.  After quitting I realized</p>\n\n<p><strong>“Hey, I should quit things more often!”</strong></p>\n\n<p>It’s good to change context and get a fresh perspective from time to time.\nChanging jobs is a great way to do that, especially if the new job knows\nsomething that you don’t.</p>\n\n<h2 id=\"starting-at-nvidia\">Starting at NVIDIA</h2>\n\n<p>I’ll be joining the AI Infrastructure division at NVIDIA, and the\n<a href=\"https://rapids.ai/\">Rapids</a> group in particular.</p>\n\n<p>Not much will change about my job and day-to-day activities.  I will continue\nto focus on general open source Dask development and maintenance.  What will\nchange though is that hopefully we’ll get several more people to start\ndeveloping and maintaining the project into the future.  NVIDIA is using Dask\nto provide scalability within their data analytics tool suite, Rapids (more\ndown below), and so they want to ensure that the Dask project grows quickly.</p>\n\n<p>We should expect the Dask+GPU experience will improve significantly (it’s\nusable now, but there’s plenty of room for improvement), but we shouldn’t\nexpect Dask to become GPU-specific.  This was one of the first concerns I\nraised with NVIDIA management, and they quickly agreed that they didn’t want to\ngo in that direction.  Their objective is to make it as easy as possible\nfor PyData-Dask-CPU users to become PyData-Dask-GPU users without noticing the\nchange, and as a result they seem fully committed to investing in an\nimproved Dask experience overall.</p>\n\n<h2 id=\"what-will-anaconda-do\">What will Anaconda do?</h2>\n\n<p>Anaconda fully supports this move.  They’re excited about the growth of the\nproject beyond their institution and the opportunities that this change brings\nto the broader community.  Anaconda will continue to develop and support the\nDask project for the foreseeable future.</p>\n\n<p>I’m looking forward to continuing interactions with the current core Dask\ndevelopers at Anaconda, who do more work on the project than I do these days.\nFortunately, because the OSS interactions at Anaconda have always been out in\nthe open there’s actually very little change to how we operate as a larger\ngroup except that, again, there will be more of us :)</p>\n\n<h2 id=\"why-does-nvidia-want-to-invest-in-dask\">Why does NVIDIA want to invest in Dask?</h2>\n\n<p>NVIDIA wants to expand the adoption of GPUs in data science.\nThey believe that Dask can help them with that goal.</p>\n\n<p>The rise of general purpose GPU computing and the recent explosion of deep\nlearning have driven interest in GPUs in recent years.\nGPUs provide multiple orders of magnitude performance increases on many\ncomputational problems <em>when they are used correctly</em>.  Unfortunately, using a\nGPU correctly is a challenging task even for most computer scientists who are\ntrained in their use.  GPUs are generally not accessible today to the\nmajority of people doing computing who do not have extensive GPU programming\nexperience.</p>\n\n<p>Deep learning libraries like Tensorflow, PyTorch, CuPy/Chainer, and Keras are\nnotable exceptions.  They provide high-level APIs that allow modestly skilled\nPython programmers to use GPUs for the particular domain of array computing.\nThis approach of connecting a high-level API to efficient low-level code is a\nfamiliar one in the Python ecosystem.  Most of our popular libraries do the\nsame.  We can probably repeat this experience for other applications.</p>\n\n<p><a href=\"https://rapids.ai/\">Rapids</a> is an initiative within NVIDIA to expand the use\nof GPUs beyond just deep learning to broader data science applications.  They\nwant to create several new libraries that provide high-level Python APIs to\nlow-level GPU code.  They started with <a href=\"https://github.com/rapidsai/cudf\">cuDF</a>\na clone of a subset of the Pandas API, and are looking to do this with other\nlibraries as well.</p>\n\n<p>To scale these libraries, they will use Dask.  Dask provides all of\nnecessary features for scaling (networking, resilience, scheduling, etc..)\nwithout being opinionated on what kinds of computations are done on each node,\nwhich makes it a nice fit when building out a new scalable computing stack.\nAdditionally, because Dask already has connections to many of the existing\nPython libraries (Pandas, Scikit-Learn, etc..) it’s easy to port a large subset\nof that functionality over to Rapids.</p>\n\n<p>Finally, Dask is a semi-successful example of transitioning a community to use\na new hardware architecture with minimal fuss (single-threaded -&gt; parallel).\nPresumably there is something to learn culturally as well as NVIDIA tries to\nintroduce GPUs to a broader set of high-level computing workflows.</p>\n\n<h2 id=\"future-work\">Future Work</h2>\n\n<p>Again, because Dask is already developed by people from many institutions (less\nthan half of the core committers work at Anaconda) most of the day-to-day\nactivities remain the same.  However, now that there are a few sizable\ncorporations making significant investments we may want to solidify some\ncommunity structures:</p>\n\n<ol>\n  <li>\n    <p>We should start conversations around applying for NumFOCUS fiscal\nsponsorship, which will require us to formalize a variety of governance\nrequirements that we should have done long ago (code of conduct, steering\ncouncil, etc..)</p>\n  </li>\n  <li>\n    <p>We may establish more communication mechanisms, including perhaps regular\nmonthly meetings, a mailing list for project announcements, and so on.</p>\n  </li>\n  <li>\n    <p>NVIDIA management and I will work on laying out a plan for near-term work\non their end. This will probably occur a month or two after I start\nemployment there.</p>\n  </li>\n</ol>\n\n<h2 id=\"hiring\">Hiring</h2>\n\n<p>Finally, both Anaconda and NVIDIA are currently hiring developers to work on\nDask.  Come join, there’s plenty to do.</p>\n\n<p>Edit: Anaconda Inc. has a <a href=\"https://boards.greenhouse.io/anaconda/jobs/1396688\">Dask-related job posting here</a>.</p>"
}