{
  "title": "Chef José Andrés on Paella, Philanthropy and Mastering Your Fire",
  "description": "This week on Homemade, host Sabrina Medora is joined by a true force of positivity in the culinary world. Chef José Andrés is known just as much for his generosity as he is for his recipes: Through founding World Central Kitchen, José and a dedicated team are able to arrive quickly in areas where natural disasters have occurred to cook and deliver meals to those in need. Thus, he’s been named one of Time Magazine’s 100 Most Influential People, been nominated for a Nobel Peace Prize and has been honored under President Obama as an ambassador for citizenship and naturalization. On today’s show, you’ll hear how Chef Andrés cooks with his wife and children, why World Central Kitchen has made remarkable strides during the pandemic, and how he lent a hand in creating a specific emoji on your smartphone! \nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "pubDate": "Wed, 01 Dec 2021 09:00:00 -0000",
  "itunes:episodeType": "full",
  "itunes:season": 2,
  "itunes:episode": 35,
  "itunes:author": "Allrecipes",
  "itunes:subtitle": "",
  "itunes:summary": "This week on Homemade, host Sabrina Medora is joined by a true force of positivity in the culinary world. Chef José Andrés is known just as much for his generosity as he is for his recipes: Through founding World Central Kitchen, José and a dedicated team are able to arrive quickly in areas where natural disasters have occurred to cook and deliver meals to those in need. Thus, he’s been named one of Time Magazine’s 100 Most Influential People, been nominated for a Nobel Peace Prize and has been honored under President Obama as an ambassador for citizenship and naturalization. On today’s show, you’ll hear how Chef Andrés cooks with his wife and children, why World Central Kitchen has made remarkable strides during the pandemic, and how he lent a hand in creating a specific emoji on your smartphone! \nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "content:encoded": "<p>This week on Homemade, host Sabrina Medora is joined by a true force of positivity in the culinary world. Chef José Andrés is known just as much for his generosity as he is for his recipes: Through founding World Central Kitchen, José<strong> </strong>and a dedicated team are able to arrive quickly in areas where natural disasters have occurred to cook and deliver meals to those in need. Thus, he’s been named one of Time Magazine’s 100 Most Influential People, been nominated for a Nobel Peace Prize and has been honored under President Obama as an ambassador for citizenship and naturalization. On today’s show, you’ll hear how Chef Andrés cooks with his wife and children, why World Central Kitchen has made remarkable strides during the pandemic, and how he lent a hand in creating a specific emoji on your smartphone! </p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p>",
  "itunes:duration": 2180,
  "itunes:explicit": "no",
  "guid": "ecf812c8-35d5-11ec-a7a3-af886b4f2c18",
  "enclosure": ""
}