{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-7035245267377066042",
  "published": "2022-09-30T11:10:00.012-05:00",
  "updated": "2022-10-06T16:50:14.921-05:00",
  "category": [
    "",
    "",
    ""
  ],
  "title": "A familiar finance fable in UK bonds",
  "content": "<p><a href=\"https://www.dailymail.co.uk/news/article-11264825/Is-real-scandal-financiers-able-risk-pensions-asks-GUY-ADAMS.html\" target=\"_blank\">Guy Adams in the Daily Mail </a>has an intriguing story of what's going on in UK bond markets. &nbsp;It's intriguing because it's so utterly familiar. And it reveals that all the masses of regulation and armies of regulators aimed at preventing exactly this sort of thing from happening again and again have failed again.&nbsp;</p><p>UC pensions take in contributions when people are young, invest them, and then pay out fixed amounts when people get old. They hold large quantities of government bonds, currently 1.5 trillion pounds per Adams. That's a good strategy: if you have fixed payments to make, invest in risk free assets that provide fixed payments, and ignore the mark to market. But it fell apart in a classic way.&nbsp;</p><p><i>Leverage</i></p><p>As often is the case, however, they didn't have enough assets to pay out the promises. So... Lever up! Pensions used their government bonds as collateral, borrowed money, and invested that money in more government bonds or, to a lesser extent, in stocks or other investments.&nbsp;<span></span></p><a name='more'></a><p></p><p>So now rather than a portfolio that matches liabilities (pension payments) with assets (government bond coupons), you have a portfolio that is making a bet on declining interest rates and rising stock prices.&nbsp;</p><p>How many times have CEOS and university presidents set (average) rate of return targets, and just levered up to meet them? Risk 101.&nbsp;</p><p>It paid off. For a while.&nbsp;</p><blockquote><p>&nbsp;in the ten years to January, while stocks recovered from the financial crisis, the proportion of pension schemes which were under-funded fell from 80 per cent to around 20 per cent.</p></blockquote><blockquote><p>During the Covid crisis in 2020, the yield of gilts (then regarded as a ‘safe haven’) fell to almost zero, meaning that their value rose substantially.</p></blockquote><blockquote><p>Yet, as ever in the world of investing, greater rewards tend to carry greater risk. And with pension funds becoming more and more comfortable using LDIs to dramatically ‘leverage’ their holdings – at times using them to purchase £3 of gilts for every £1 they actually invested – they would inevitably become sensitive to changes in market conditions. ...</p></blockquote><p>I.e. rising interest rates. &nbsp;This is a huge bet. The pensions are borrowing short term to buy long-term bonds. Small changes in long-term interest rates can imply huge changes in long-term bond prices.&nbsp;</p><blockquote><p>&nbsp;By early this week, gilts which had been worth £3.50 in January were valued at as little as 50p.&nbsp;</p></blockquote><p>Now wait a minute, you say, interest rates haven't gone up that much. But long term bond prices are very sensitive to small changes in interest rates, especially when interest rates are low. For example, a 30 year zero coupon bond paying 100 pounds is worth 100 pounds when the interest rate is zero. If the interest rate goes up to 2%, that is the same thing as the price going down to 100/(1.02)^30 = 55.2 pounds, half the original value. Borrowing to invest in long-term bonds is a very risky strategy on a mark to market basis.</p><p><i>Selling options</i></p><p>When interest rates are zero, they can't go down any more. So, you can see that leveraging in to long-term bonds in a time of low interest rates has a quite skewed distribution of returns. You can make a little bit of money most of the time, if interest rates stay low or go down a hair more. But when interest rates rise, you can lose a lot of money all of a sudden. This is a tried and true method of boosting fund performance. For a while. \"Write out of the money puts.\" \"Short volatility.\" \"Write insurance.\" \"Collect pennies in front of a steam roller.\" Then of course the grim reaper comes and it all falls apart massively.&nbsp;</p><p><i>Collateral&nbsp;</i></p><p>Well, wait, you ask. Who cares about mark to market? The market value of the pension fund's liabilities -- the pensions -- has also gone down. The mismatch is &nbsp;bad, but not that bad.&nbsp;</p><p>Oh yes it is. When the value of the government bonds used as collateral falls by half, the fund has to come up with<i> cash </i>to cover the mark to market losses on their collateral:&nbsp;&nbsp;</p><blockquote><p>This [loss] in turn meant that pension funds were required to hold less cash as collateral for the bonds they kept in LDIs, allowing more money to be returned to their pot.</p></blockquote><p>Again, in plainer English. You have 1,000 pounds of bonds. You use that as collateral to borrow 1000 pounds, and invest in another 1000 pounds of bonds. The bond prices fall to 500 pounds. Now you have to come up with 500 pounds cash, right now, to replace the missing collateral on your loan. You must sell the &nbsp;500 pounds of bonds you bought immediately. &nbsp;</p><blockquote><p>For pension funds which held LDIs, this caused immediate problems. The UK gilts they were using as collateral on other investments were suddenly worth an awful lot less and cash was needed to plug the gap. Unfortunately, the only way they could raise cash was to sell large quantities of gilts, which in turn had the effect of driving the price even lower.</p></blockquote><p>This is a risk-management failure that happens over and over. Even seemingly good hedges or ``arbitrage'' &nbsp;strategies fall apart because you have to post extra collateral when markets move against you.&nbsp;</p><p><i>Spiral</i></p><blockquote><p>Of course, that meant they needed even more loot. And so a sort of vicious circle was created. ‘I have called it the death spiral,’ Mackenzie said last night. ‘That’s what we were in. A sort of volatility vortex. It became self-fulfilling. Pension funds were essentially eating themselves.’</p></blockquote><blockquote><p>For a few short hours, early on Wednesday, the market became effectively paralysed. That forced the Bank of England to take dramatic action, stepping in as a sort of ‘buyer of last resort’ and agreeing to plough about £65billion into gilts over the coming weeks.</p></blockquote><div>Now wait a minute, you say, especially if you got your degree at the University of Chicago. If people are selling in a panic and driving prices down, why doesn't Goldman or Blackrock stop playing ESG games for 5 minutes and scoop up the bonds? Well, they don't, at least fully, and at the very high frequency we're taking about. Collateral has to be posted daily. &nbsp;(Just why they don't is a very good question.)&nbsp;</div><div><br /></div><div><i>Creative finance&nbsp;</i></div><p>The scheme was called \"Leveraged Liability-Driven Investments,\" and involved a lot of fees. I presume the fees and complexity are necessary to get around regulations that said funds have to hold government bonds to match their payouts and not take risks. Yes, we're holding those bonds. We just incidentally borrowed against them to buy something else, and unwind the regulation.&nbsp;</p><blockquote><p>The genius of these products was that, despite performing solidly, they looked extremely conservative – at least on paper. Government bonds are among the most reliable investments. The world of pensions is designed to be dull. While the sheer volume of gilts being packaged into these products was unprecedented, regulators and the vast majority of observers saw nothing in the way of red flags.</p></blockquote><p>But really, is it that hard to see though? &nbsp;We teach every MBA the lesson of mortgage-backed securities held by \"special purpose vehicles\" that issued overnight debt and how that fell apart.&nbsp;</p><p></p><p><i>Prophets ignored</i></p><p>Perhaps regulators can complain that nobody could see it coming. But as usual at least some people did see through the scheme.&nbsp;</p><p></p><blockquote><p>One day in May 2019, a Dutch financier named Hans Van Zwol hit ‘send’ on a document outlining what he suggested was a ‘terrible’ threat to the global economy....</p></blockquote><p></p><blockquote><p>... the bespectacled fund manager had become concerned about a range of complex products known in the trade as ‘Leveraged Liability-Driven Investments’ or LDIs.&nbsp;</p></blockquote><p></p><blockquote><p>Yet neither the industry nor regulators seemed to act. Indeed, as recently as July, an article by a writer in the Financial Times noted that: ‘LDI managers claim that their activities pose no systemic risk and I read the Bank of England financial policy committee’s silence as agreement.’</p></blockquote><blockquote><p>Events of recent days would, of course, prove them (and the Government) quite wrong. Negligent, even.&nbsp;</p></blockquote><p>Well, prophets are only recognized ex-post. But regulators cannot say that it was impossible to see.&nbsp;</p><div><i>The coverup</i></div><div><i><br /></i></div><div>I was a loud critic of the Dodd-Frank approach to regulation, arguing for lots of equity rather than continued high leverage and the fantasy that regulators would really really see asset risks building up next time. That has obviously failed once again. But at least they had the decency to notice something went wrong, to say the words \"moral hazard\" and to do <i>something</i> about it.&nbsp;</div><div><br /></div><div>The Fed engaged in a massive bailout in 2020, and nobody is peeping a word about it other than congratulating the Fed for saving the world once again. Why did the world need saving, in all the ways that Dodd-Frank and stress tests were supposed to prevent? Silence.&nbsp;</div><blockquote><div>As the dust settles, and taxpayers count the cost, there will naturally be calls for a prompt investigation into how pension funds were allowed to invest billions in such high-risk products. Smooth financiers, who for years profited from these exotic deals, will shrug their shoulders while politicians deflect and regulators seek others to blame.</div></blockquote><blockquote><p>History, meanwhile, suggests no one will be properly held accountable. And therein lies the real scandal. For as so often when financial markets implode, the outrageous fact is that this was well and truly a crisis foretold.</p></blockquote><div>As with the FDA and the CDC we have entered the CYA era of government, in which nobody can admit mistakes or reform institutions.&nbsp;</div><div><br /></div><div><i>Over and over</i></div><div><br /></div><div>I italicized the headings to emphasize how common this story is. Over and over, plus ça change, plus c'est la même chose. And now the same crew, having missed debt financed mortgage backed securities in special purpose vehicles (2008), having missed banks loading up on Greek debt (2010), having completely missed that a pandemic or other supply shock might cause trouble (2020), having missed that energy prices might rise or war might break out (2022), is off on the quest to stress test banks for climate change.&nbsp;</div><div><br /></div><div><i>Update</i></div><div><i><br /></i></div><div><a href=\"https://www.ft.com/content/8b34f3fc-ec08-4d6f-864b-a482217a841a\" target=\"_blank\">Great coverage by Robert Armstrong</a> at FT Unhinged. Armstrong adds the use of derivatives to goose the portfolios, and points out that the 1% or more interest rate moves happened in a matter of days, really pushing the collateral channel. He also asks why central banks don't directly control long-term rates rather than, or rather than just, short term rates. It's a good question.&nbsp;</div><div><br /></div><div><a href=\"https://www.bloomberg.com/opinion/articles/2022-09-30/hardly-a-surprise-pension-funds-stoked-the-uk-rout\" target=\"_blank\">Great coverage here by Allison Schrager</a> at Bloomberg. HT Casey Mulligan.</div><div><br /></div><div><a href=\"https://johnhcochrane.blogspot.com/2022/10/uk-finance-fable-update.html\" target=\"_blank\">More update here</a></div><div><br /></div><blockquote><div></div></blockquote><div><br /></div><div><br /></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 18
}