{
  "title": "Special Episode, Pt. 2: Inflation Around the World",
  "description": "<p>The challenges of inflation can be felt around the world, but understanding the regional differences is key to an effective 2022 for both central banks and investors.</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market. I'm Andrew Sheets, Chief Cross Asset Strategist for Morgan Stanley Research.</p><p><br></p><p><strong>Seth Carpenter </strong>And I'm Seth Carpenter, Morgan Stanley's Chief Global Economist.</p><p><br></p><p><strong>Andrew Sheets </strong>And on part 2 of this special episode of Thoughts on the Market, we'll be continuing our discussion on central banks, inflation, and the outlook for markets. It's Tuesday, February 22nd at 1:00 p.m. in London.</p><p><br></p><p><strong>Seth Carpenter </strong>And 8:00 a.m. in New York.</p><p><br></p><p><strong>Andrew Sheets </strong>So Seth, you lay out the challenge that central banks face because they are being pulled in two directions. If they raise rates too quickly, the economy could slow too quickly. That means real people lose their jobs, real businesses have trouble getting loans. On the other hand, if they don't raise rates quickly enough, there's a risk that inflation would be higher and that has a real impact on the economy and people's lives. When it comes to, kind of, which side of caution to air on, how do you think central banks are thinking about that at the moment? And what would you be watching to indicate which side of that debate they're starting to come down on?</p><p><br></p><p><strong>Seth Carpenter </strong>I think if we're looking at the developed market, central banks, the Fed, the ECB, the Bank of England right now, I think they have a high conviction that the current stance of policy is just too accommodative given the state of the real economy and where inflation is. So I think right now all of them believe they need to get going, that starting now is fine. That mindset I don't think though will last too terribly long because over time we will start to see some outright tightening. So for the Fed, where does that point change? I think once they start to run off their balance sheet, probably sometime around the middle of this year, they're going to start to get much more cautious, they're going to look at markets and say how much of this tightening is being transmitted first through financial markets and then to the economy. So they'll be looking at credit spreads, they'll be looking at risk markets to ask, are we getting some traction? We think, especially if we're right and a bunch of the inflation that we're seeing now is this frictional inflation, that comes down in the latter half of the year. We think that hiking cycle is going to slow down over time. And so much like the Bank of England's forecast based on market pricing, we think there's probably a bit too much that's baked into markets in terms of how much hiking they do. They start off reasonably swiftly, knowing that they were too far away, knowing that they were being very accommodative. But in the latter half of the year, the pace of tightening starts to slow down.</p><p><br></p><p><strong>Andrew Sheets </strong>Seth, another question that I get quite a bit is at what point will market volatility cause the Fed or another central bank to change their policy? There's an idea in the market that if stocks drop or if credit spreads widen, or if there's higher volatility, then central banks would look at that and respond to that. From a central bank standpoint, how do you think central banks think about market volatility? And what are some important ways that you think investors either correctly or kind of incorrectly think about that reaction function?</p><p><br></p><p><strong>Seth Carpenter </strong>I can say over the 15 years that I spent at the Fed drafting policy documents, briefing the committee on policy options, thinking about how markets are affecting the economy, I can tell you the following. The market tends to have an overdeveloped sense of how sensitive central banks are to equity market reactions in particular. Equity market changes are important, it can be a very high frequency signal that there is cause to investigate what's going on in the economy. But they give many, many, many false signals as well, and so I would say that a sharp drop in equity prices would be the sort of thing that would get the attention of central bankers but would not force their hand to make a change. Instead, there would be further investigation. In addition, the whole point of tightening monetary policy is to tighten financial conditions and thereby slow the economy. So, it is not a question of are we getting credit spread widening? Are we getting softer asset prices? The answer to that is that's part of the plan. I think the real question is how large is the move in asset prices and how quick is the move in asset prices? If we have a very orderly tightening of financial conditions that plays out over several months, I don't think that's the sort of thing that causes the central bank to reverse course. If instead, over the course of a month you get a very sharp and disruptive widening and spreads, I think that really does cause a substantial reconsideration of the plan.</p><p><br></p><p><strong>Andrew Sheets </strong>So, Seth, I think it's fair to say one of the challenges of your job at Morgan Stanley is you only have the entire global economy to look after. This is an inflation story that does look similar in some ways around the world, but also looks different. Your global economics team has done some interesting research recently on Asia and how Asia, which is an enormous economy in its own right, is seeing quite different, you know, inflation dynamics and labor market dynamics. I was hoping you could touch a little bit on that and how the regional differences can actually be pretty significant.</p><p><br></p><p><strong>Seth Carpenter </strong>Absolutely. And I think Asia is very much the counterpoint to what we've seen in the rest of the globe in terms of the inflationary process. So inflation in Asia has been quite subdued, and I think there's some very clear reasons for that. First, when we think about food and energy inflation in Asia, many of the countries there have much more direct government intervention in those markets, and that has been helping to keep those inflation rates low. Second, when it comes to core consumer spending, there's been a bigger lag in consumer spending recovery in a lot of Asian economies than there have been in the developed market economies, which I think reflects two issues. One, aggressive COVID response, and second, much less fiscal transfers to the household sector, that is in the United States and in some other countries really helped to support consumer spending, especially on goods. And finally, in many Asian economies, there's been a bit less in the way of supply chain disruptions for the local market. So there really has been a big difference. I'll go you one further, when we think about the central bank's response, not only do we have the large developed market economy central bank starting to hike, the PBOC is going in exactly the opposite direction. The Chinese economy slowed aggressively for reasons that we can get into on another podcast, but the PBOC has eased. So, it is very much a differential outlook for both inflation and central banking in Asia versus the rest of the world.</p><p><br></p><p><strong>Seth Carpenter </strong>But I have to say, Andrew, let me turn it around to you because inflation is clearly the key story this year. The change in developed market, central banks towards hiking is huge this year. How is all of this debate affecting your views on strategy as it markets across assets across the globe?</p><p><br></p><p><strong>Andrew Sheets </strong>So I think there are a couple of important elements that are driving the way we're thinking about markets. The first is one key output of higher inflation is higher interest rates, or certainly investor concern around higher interest rates, if we look at how the market has historically performed as interest rates go up, what really matters, maybe simplistically, is how good the economy is. If interest rates are going up, but the underlying economy is still ultimately solid and strong, a lot of assets end up doing OK. And so if I think about, you know, the base case that you and the Morgan Stanley Global Economic Team have laid out where we have some maybe growth softness in the first quarter of this year, but overall 2022 is a pretty solid year for growth. I think that still means that overall, markets can avoid some of the more negative scenarios that would otherwise come with higher rates. But the second issue here that I think is important, and I think this dovetails nicely with your discussion on Asia relative to say the U.S., is that the challenges around inflation and rate hikes also have a lot of global differences. The more expensive your market is, the higher your rate of inflation, the less your central bank has done to this point. Which describes the U.S. pretty accurately, it's a more expensive market, the inflation rate is higher, the Fed has not made its first rate hike yet. I think that's a market where there's more uncertainty and where my colleague Mike Wilson, our Chief U.S. Equity Strategist, is forecasting a more difficult year for returns. You know, in contrast, in Europe the valuations aren't as expensive, the inflation rate isn't as high. I actually think it's OK for investors to kind of have different views on the impact of inflation, different views for 2022, because these trends are very different globally. And I think we're going to see a market that has much more diverse performance, it's going to be less one direction, it's going to be less unified. And I think that's OK, I think that would reflect a global backdrop for inflation and monetary policy and valuations that is quite different depending on where you look.</p><p><strong>&nbsp;</strong></p><p><strong>Seth Carpenter </strong>Great. Well, you know, as the saying goes, forecasting is hard, especially about the future. But I have very high conviction in the following forecast: you and I are going to have a lot to talk about over the balance of this year. It's been great talking to you, Andrew.</p><p><br></p><p><strong>Andrew Sheets </strong>It's been great talking to you, Seth. As a reminder, if you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcasts app. It helps more people find the show.</p>",
  "itunes:title": "Special Episode, Pt. 2: Inflation Around the World",
  "itunes:episodeType": "full",
  "itunes:episode": 559,
  "itunes:summary": "The challenges of inflation can be felt around the world, but understanding the regional differences is key to an effective 2022 for both central banks and investors.",
  "content:encoded": "<p>The challenges of inflation can be felt around the world, but understanding the regional differences is key to an effective 2022 for both central banks and investors.</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market. I'm Andrew Sheets, Chief Cross Asset Strategist for Morgan Stanley Research.</p><p><br></p><p><strong>Seth Carpenter </strong>And I'm Seth Carpenter, Morgan Stanley's Chief Global Economist.</p><p><br></p><p><strong>Andrew Sheets </strong>And on part 2 of this special episode of Thoughts on the Market, we'll be continuing our discussion on central banks, inflation, and the outlook for markets. It's Tuesday, February 22nd at 1:00 p.m. in London.</p><p><br></p><p><strong>Seth Carpenter </strong>And 8:00 a.m. in New York.</p><p><br></p><p><strong>Andrew Sheets </strong>So Seth, you lay out the challenge that central banks face because they are being pulled in two directions. If they raise rates too quickly, the economy could slow too quickly. That means real people lose their jobs, real businesses have trouble getting loans. On the other hand, if they don't raise rates quickly enough, there's a risk that inflation would be higher and that has a real impact on the economy and people's lives. When it comes to, kind of, which side of caution to air on, how do you think central banks are thinking about that at the moment? And what would you be watching to indicate which side of that debate they're starting to come down on?</p><p><br></p><p><strong>Seth Carpenter </strong>I think if we're looking at the developed market, central banks, the Fed, the ECB, the Bank of England right now, I think they have a high conviction that the current stance of policy is just too accommodative given the state of the real economy and where inflation is. So I think right now all of them believe they need to get going, that starting now is fine. That mindset I don't think though will last too terribly long because over time we will start to see some outright tightening. So for the Fed, where does that point change? I think once they start to run off their balance sheet, probably sometime around the middle of this year, they're going to start to get much more cautious, they're going to look at markets and say how much of this tightening is being transmitted first through financial markets and then to the economy. So they'll be looking at credit spreads, they'll be looking at risk markets to ask, are we getting some traction? We think, especially if we're right and a bunch of the inflation that we're seeing now is this frictional inflation, that comes down in the latter half of the year. We think that hiking cycle is going to slow down over time. And so much like the Bank of England's forecast based on market pricing, we think there's probably a bit too much that's baked into markets in terms of how much hiking they do. They start off reasonably swiftly, knowing that they were too far away, knowing that they were being very accommodative. But in the latter half of the year, the pace of tightening starts to slow down.</p><p><br></p><p><strong>Andrew Sheets </strong>Seth, another question that I get quite a bit is at what point will market volatility cause the Fed or another central bank to change their policy? There's an idea in the market that if stocks drop or if credit spreads widen, or if there's higher volatility, then central banks would look at that and respond to that. From a central bank standpoint, how do you think central banks think about market volatility? And what are some important ways that you think investors either correctly or kind of incorrectly think about that reaction function?</p><p><br></p><p><strong>Seth Carpenter </strong>I can say over the 15 years that I spent at the Fed drafting policy documents, briefing the committee on policy options, thinking about how markets are affecting the economy, I can tell you the following. The market tends to have an overdeveloped sense of how sensitive central banks are to equity market reactions in particular. Equity market changes are important, it can be a very high frequency signal that there is cause to investigate what's going on in the economy. But they give many, many, many false signals as well, and so I would say that a sharp drop in equity prices would be the sort of thing that would get the attention of central bankers but would not force their hand to make a change. Instead, there would be further investigation. In addition, the whole point of tightening monetary policy is to tighten financial conditions and thereby slow the economy. So, it is not a question of are we getting credit spread widening? Are we getting softer asset prices? The answer to that is that's part of the plan. I think the real question is how large is the move in asset prices and how quick is the move in asset prices? If we have a very orderly tightening of financial conditions that plays out over several months, I don't think that's the sort of thing that causes the central bank to reverse course. If instead, over the course of a month you get a very sharp and disruptive widening and spreads, I think that really does cause a substantial reconsideration of the plan.</p><p><br></p><p><strong>Andrew Sheets </strong>So, Seth, I think it's fair to say one of the challenges of your job at Morgan Stanley is you only have the entire global economy to look after. This is an inflation story that does look similar in some ways around the world, but also looks different. Your global economics team has done some interesting research recently on Asia and how Asia, which is an enormous economy in its own right, is seeing quite different, you know, inflation dynamics and labor market dynamics. I was hoping you could touch a little bit on that and how the regional differences can actually be pretty significant.</p><p><br></p><p><strong>Seth Carpenter </strong>Absolutely. And I think Asia is very much the counterpoint to what we've seen in the rest of the globe in terms of the inflationary process. So inflation in Asia has been quite subdued, and I think there's some very clear reasons for that. First, when we think about food and energy inflation in Asia, many of the countries there have much more direct government intervention in those markets, and that has been helping to keep those inflation rates low. Second, when it comes to core consumer spending, there's been a bigger lag in consumer spending recovery in a lot of Asian economies than there have been in the developed market economies, which I think reflects two issues. One, aggressive COVID response, and second, much less fiscal transfers to the household sector, that is in the United States and in some other countries really helped to support consumer spending, especially on goods. And finally, in many Asian economies, there's been a bit less in the way of supply chain disruptions for the local market. So there really has been a big difference. I'll go you one further, when we think about the central bank's response, not only do we have the large developed market economy central bank starting to hike, the PBOC is going in exactly the opposite direction. The Chinese economy slowed aggressively for reasons that we can get into on another podcast, but the PBOC has eased. So, it is very much a differential outlook for both inflation and central banking in Asia versus the rest of the world.</p><p><br></p><p><strong>Seth Carpenter </strong>But I have to say, Andrew, let me turn it around to you because inflation is clearly the key story this year. The change in developed market, central banks towards hiking is huge this year. How is all of this debate affecting your views on strategy as it markets across assets across the globe?</p><p><br></p><p><strong>Andrew Sheets </strong>So I think there are a couple of important elements that are driving the way we're thinking about markets. The first is one key output of higher inflation is higher interest rates, or certainly investor concern around higher interest rates, if we look at how the market has historically performed as interest rates go up, what really matters, maybe simplistically, is how good the economy is. If interest rates are going up, but the underlying economy is still ultimately solid and strong, a lot of assets end up doing OK. And so if I think about, you know, the base case that you and the Morgan Stanley Global Economic Team have laid out where we have some maybe growth softness in the first quarter of this year, but overall 2022 is a pretty solid year for growth. I think that still means that overall, markets can avoid some of the more negative scenarios that would otherwise come with higher rates. But the second issue here that I think is important, and I think this dovetails nicely with your discussion on Asia relative to say the U.S., is that the challenges around inflation and rate hikes also have a lot of global differences. The more expensive your market is, the higher your rate of inflation, the less your central bank has done to this point. Which describes the U.S. pretty accurately, it's a more expensive market, the inflation rate is higher, the Fed has not made its first rate hike yet. I think that's a market where there's more uncertainty and where my colleague Mike Wilson, our Chief U.S. Equity Strategist, is forecasting a more difficult year for returns. You know, in contrast, in Europe the valuations aren't as expensive, the inflation rate isn't as high. I actually think it's OK for investors to kind of have different views on the impact of inflation, different views for 2022, because these trends are very different globally. And I think we're going to see a market that has much more diverse performance, it's going to be less one direction, it's going to be less unified. And I think that's OK, I think that would reflect a global backdrop for inflation and monetary policy and valuations that is quite different depending on where you look.</p><p><strong>&nbsp;</strong></p><p><strong>Seth Carpenter </strong>Great. Well, you know, as the saying goes, forecasting is hard, especially about the future. But I have very high conviction in the following forecast: you and I are going to have a lot to talk about over the balance of this year. It's been great talking to you, Andrew.</p><p><br></p><p><strong>Andrew Sheets </strong>It's been great talking to you, Seth. As a reminder, if you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcasts app. It helps more people find the show.</p>",
  "guid": "gid://art19-episode-locator/V0/cz9R7XgDRg5bP825-ZFOpjytcvfcRCgggjyqoK1z0o8",
  "pubDate": "Wed, 23 Feb 2022 02:16:44 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:duration": "00:08:57",
  "enclosure": ""
}