{
  "title": "Why does China care about the Olympics?",
  "link": "https://audioboom.com/posts/8010329",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2488,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>'If table tennis set the stage for China’s international diplomacy, then volleyball rebuilt the nation’s confidence', ran one article in the <em>People's Daily</em> around the time of the 2016 Rio Olympics. Sports has had a long political history in China, Cindy Yu's guest in this week's Chinese Whispers tells her. She is Dr Susan Brownell, Professor of Anthropology at the University of Missouri. She has been in and out of China since the 1980s, when she went to Peking University as a student and ended up represented the institution as a track runner.<br>\n<br>\n\n</div>\n<div>On this episode, Cindy finds out why exactly China cares about the Olympics just so much. And it certainly does – Susan and Cindy reminisce about 2008, when China spent $100 million on a four-hour long opening ceremony and $7 billion on the whole Games. Working in Beijing that year, Susan saw, firsthand, the excitement that local officials and people put into the preparations ('There were huge programmes to teach English to everybody, especially in Beijing. You know, the old ladies and the taxi drivers'), but also the fear and intensity that came with this – 'all the government officials involved in the effort were just kind of quaking'.<br>\n<br>\n\n</div>\n<div>The reason for all this – and the reason why a snub at the imminent Winter Olympics, as numerous countries around the world announce boycotts, will be remembered by China – is because sports has long been political. In the ping pong diplomacy of the 1970s, games played between Chinese and American teams allowed Nixon's America and Mao's China to get closer to each other. In the five women's volleyball team world victories of the 1980s, China was able to find a new source of national pride, as its people tried to recover from the wounds of the Cultural Revolution. In 2008, seven years after accession to the WTO and at a time when a more liberal China could still be imagined, the Summer Olympics provided a chance to show the world what 21st century China was all about. 'It was China's coming out party', Susan says.<br>\n<br>\n\n</div>\n<div>To be sure, this Olympics matters less – winter Olympics always do, and after all, China has 'already emerged as a superpower'. But even so, it will have a political dimension – just see how China eagerly invited President Putin last year. <br>\n<br>\n\n</div>\n<div>On the episode, they also make a brief digression into the demolitions that happened in Beijing – leading to headlines in the <em>New York Times</em> like '<a href=\"https://www.nytimes.com/2006/07/12/world/asia/12beijing.html\">Olympics Imperil Historic Beijing Neighborhood</a>'. Susan corrects media reports and says that, in fact, in the areas reconstructed for the Games, it was mainly small shops not residences that were destroyed. She befriended one man who was dislocated from his mechanical repair shop there and became a taxi driver because of the Olympics, and Cindy reflects on her memories of a 'demolition era', where China's rapid growth meant the words<em> chaiqian</em> (demolish and relocate) were commonly marked on old buildings across Chinese cities. But tune in to hear how some ingenious Chinese – including members of Cindy's family – welcomed the destruction of their property as it allowed them to game the system of government compensation.</div>\n",
  "pubDate": "Mon, 10 Jan 2022 18:21:39 +0000",
  "guid": "tag:audioboom.com,2022-01-10:/posts/8010329",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}