{
  "title": "S15 Ep18: The Journey",
  "link": "https://audioboom.com/posts/8098505",
  "itunes:episode": 18,
  "itunes:title": "The Journey",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 8235,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio gets enlightened today as we take The Journey, Dave's story of spirits, serpents, soul searching and facing Death! Join us for the most personal episode in our history with special guest, G.K, Darkness Dave and Tim Dennis.<br>\n<br>\nThis past month has been HUGE for your ol' pal, Darkness Dave. New revelations of found family and a life changing event that has been 52 years in the making. Join Tim as he navigates this unusual set of circumstances that had Dave confront his fear of Death, Snakes, Spirits and Time with their special guest G.K. <br>\n<br>\nPlease consider donating to the Special Olympics and help us in our yearly drive to raise much needed funds for these awesome competitors, let's blow past our goal! <br>\n<br>\nDonate Here: <a href=\"https://bit.ly/2uEHZRi\">https://bit.ly/2uEHZRi</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping. <br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !",
  "itunes:summary": "Darkness Radio gets enlightened today as we take The Journey, Dave's story of spirits, serpents, soul searching and facing Death! Join us for the most personal episode in our history with special guest, G.K, Darkness Dave and Tim Dennis.\n\nThis...",
  "pubDate": "Sun, 01 Mar 2020 10:00:00 +0000",
  "guid": "08e7db80-8765-4047-a4f3-9b2434f1052d",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}