{
  "id": "https://bibleinoneyear.org/en/youth/334",
  "title": "Day 334: Intimate Connection",
  "description": "Psalm 136:1, Daniel 6:13,16–23, 1 John 1:3,5–9, 2:1–6.  You can be real before God and before others  The result is a level of authenticity, vulnerability and intimate connection with one another that is best summed up in this beautiful word, ‘fellowship’",
  "pubDate": "Tue, 30 Nov 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/334/?ignore",
  "itunes:duration": "15:41",
  "guid": "enyouth30112021-334",
  "length": 941.74,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 334: Intimate Connection",
  "itunes:subtitle": "Psalm 136:1, Daniel 6:13,16–23, 1 John 1:3,5–9, 2:1–6.  You can be real before God and before others  The result is a level of authenticity, vulnerability and intimate connection with one another that is best summed up in this beautiful word, ‘fellowship’",
  "itunes:summary": "Fellowship – it’s a wonderful word. It’s what you were made for. It satisfies the deepest longings of your heart. It is the answer to loneliness. Nothing in this life compares with it. It starts now and goes on for ever.\nThere is no greater joy in life than fellowship. John wants his readers to enjoy the same fellowship he has: ‘We want you to enjoy this, too. Your joy will double our joy!’ (1 John 1:3, MSG).\nKoinonia, the Greek word used for fellowship, is almost untranslatable. It expresses ‘a relationship of great intimacy and depth… it even became the favourite expression for the marital relationship – the most intimate between human beings’. It is a rich word that describes a life together in which everything is shared. This is the word that John uses of our intimate relationship with God (v.3).\nIt also describes our relationship with one another. You can have deep genuine friendships and honest communication. There is no need for masks or ‘spin’ or ‘image’. You can be real before God and before others. The result is a level of authenticity, vulnerability and intimate connection with one another that is best summed up in this beautiful word, ‘fellowship’.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 334
}