{
  "title": "8: Episode 8",
  "link": "https://audioboom.com/posts/7316366",
  "itunes:episode": 8,
  "itunes:title": "Episode 8",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3144,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On our September 24th, 2005 edition of MuggleCast…<br>\n<br>\n\n</div>\n<div>While spying <em>eyes</em> can’t seem to find Spartz this week, just what is the connection between Harry and Lily’s? And can you compare a teacher you once had to one at Hogwarts? The crew weighs in on characterization: everything from Luna and Neville’s coin obsession to Dumbledore’s beloved profession. Plus, the polls are now open for you to decide the funniest fate for the Dark Lord. And Jamie even makes a request for rabbit voicemails.<br>\n<br>\n\n</div>\n<div>From the first-ever MuggleNet female host to the first-ever Andrew Listener Challenge…all that and more ahead with Andrew, Eric, Jamie, and Laura on this week?s edition of MuggleCast.<br>\n<br>\n\n</div>\n<ul>\n<li>Our first MuggleNet female staffer joins in on the discussion!</li>\n<li>Vote for your favorite entry in our Voldemort contest</li>\n<li>Andrew thanks the fans who made fan sites</li>\n<li>Main topic: Characterization in the Potter books</li>\n<li>Hogwarts VS real teachers</li>\n<li>Hermione’s friendships</li>\n<li>What would happen if Hogwarts is closed?</li>\n<li>We ask Laura how busy MuggleNet Fan Fiction is</li>\n<li>Spy on Spartz</li>\n<li>Jamie’s British Joke of the Day (x2)</li>\n<li>The Brit puts out a request for rabbit impressions</li>\n<li>New segment: Andrew’s Listener Challenge</li>\n<li>Harry having his mother’s eyes– how could it affect HP7?</li>\n<li>Neville and Luna with those coins</li>\n<li>How long could HP7 possibly last? Could it be years?</li>\n</ul>\n",
  "pubDate": "Sat, 24 Sep 2005 00:00:00 +0000",
  "guid": "tag:audioboom.com,2019-07-15:/posts/7316366",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}