{
  "title": "S15 Ep8: Supernatural News/Parashare: Chris Jericho Rock and Wrestling Rager At Sea Edition",
  "link": "https://audioboom.com/posts/8098515",
  "itunes:episode": 8,
  "itunes:title": "Supernatural News/Parashare: Chris Jericho Rock and Wrestling Rager At Sea Edition",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4992,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Dave and Tim have always wanted to be Paranormal Pirates and got the chance this week to sail the seven seas with Chris Jericho, the cast of AEW, and all his rockin' friends!  oh yeah!  They recorded Supernatural News from the Bliss Lounge of the Norwegian Pearl, and instead of ARRRReading your stories for parashare, you get actual, live, listener encounters!! <br>\n<br>\nCall and share your story 651-300-4977<br>\n<br>\nVisit our shop for books and great gift items: <a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL games and playing against the hosts of different Podcast One shows!  If you play along with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nStart listening with a 30-day Audible trial. Choose 1 audiobook and 2 Audible Originals<br>\nabsolutely free. Visit audible dot com slash btd or text btd to 500-500",
  "itunes:summary": "Dave and Tim have always wanted to be Paranormal Pirates and got the chance this week to sail the seven seas with Chris Jericho, the cast of AEW, and all his rockin' friends!  oh yeah!  They recorded Supernatural News from the Bliss...",
  "pubDate": "Sat, 25 Jan 2020 07:00:00 +0000",
  "guid": "75156896-0002-45d3-9522-58a1fa3c4f4e",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}