{
  "title": "A Better Algorithm for Area Proportional Venn and Euler Diagrams",
  "link": "",
  "updated": "2015-06-29T00:00:00-07:00",
  "id": "http://www.benfrederickson.com/better-venn-diagrams/",
  "content": "\n        \n            <img src=\"http://www.benfrederickson.com/images/seriousvenn/venn.gif\" width=\"100%\" style=\"max-width:500px\">\n        \n        <p>A while ago I wrote a small <a href=\"https://github.com/benfred/venn.js\">library for displaying Venn and Euler diagrams</a> when trying to learn Javascript.</p>\n\n<p>By specifying the sizes of each area in the diagram, \nthe library automatically draws a Venn or Euler diagram such that areas displayed have sizes that \napproximately match the input.</p>\n\n<div style=\"display: table; margin: auto\">\n<div id=\"artvenn\"></div>\n<h6 id=\"artvennlabel\" style=\"text-align:center;margin-top:0px;display:none\"><small>Sample output of this library, from <a href=\"http://venndiagrams.tumblr.com/post/91164801034\">this tumblr</a></small></h6>\n<p></p>\n</div>\n\n<p>It turned out that displaying the circles is trivial - but calculating the positions of the circles\nsuch that the diagram is area proportional is a surprisingly\ntricky numerical optimization problem.</p>\n\n<p>The <a href=\"/venn-diagrams-with-d3.js/\">original solution</a> I came up with worked fairly well, but there were a couple of minor cases that <a href=\"/multidimensional-scaling/#applications_to_venn\">it broke down on</a>. Since people kept on starring this library on\nGitHub, I thought I would do them all the favour of fixing these errors by\nimplementing an idea I had for a new layout algorithm.</p>\n\n<p>I tested this new algorithm, and found that it works exceedingly well. In\nfact it far surpasses the <a href=\"http://www.cs.uic.edu/~wilkinson/Publications/venneuler.pdf\">best published academic research on laying out\narea proportional Venn and Euler\ndiagrams</a>. I’ve included some interactive graphs showing\nthe performance on this benchmark here, as well as a visualization of how this\nalgorithm works.</p>\n\n<p class='more'><a href='http://www.benfrederickson.com/better-venn-diagrams/'>Read more ...</a></p>\n     "
}