{
  "title": "Humble Pie, Turkey Stocks, & Stocks We’re Thankful For",
  "pubDate": "Fri, 29 Nov 2019 10:00:00 +0000",
  "guid": "4dc6e6f0-024f-4bb9-a1a6-53c59354ddff",
  "link": "https://fool.libsyn.com/humble-pie-turkey-stocks-stocks-were-thankful-for",
  "itunes:image": "",
  "description": "<p>It’s our Thanksgiving Special! Analysts Andy Cross, Ron Gross, and Jason Moser share why they’re thankful for stocks MarketAxess, CRISPR, and Zoetis. They discuss why investors might want to avoid stock market turkeys Uber, TripAdvisor, and Smile Direct. And since no Thanksgiving is complete without dessert, we dig into a few slices of humble pie and talk Arista, Camping World Holdings, and Eventbrite. Plus, we revisit our conversation with Oaktree Capital co-founder Howard Marks, author of <em>Mastering the Market Cycle: Getting the Odds on Your Side.<br /> <br /></em>Thanks Health IQ.  See if you qualify for lower rates! Go to <a href= \"http://www.healthiq.com/fool\">www.healthiq.com/fool</a>.<br /> <br /> <a href= \"http://www.getquip.com/fool\">www.GETQUIP.COM/fool</a> for your first refill free!</p>",
  "content:encoded": "<p>It’s our Thanksgiving Special! Analysts Andy Cross, Ron Gross, and Jason Moser share why they’re thankful for stocks MarketAxess, CRISPR, and Zoetis. They discuss why investors might want to avoid stock market turkeys Uber, TripAdvisor, and Smile Direct. And since no Thanksgiving is complete without dessert, we dig into a few slices of humble pie and talk Arista, Camping World Holdings, and Eventbrite. Plus, we revisit our conversation with Oaktree Capital co-founder Howard Marks, author of <em>Mastering the Market Cycle: Getting the Odds on Your Side. </em>Thanks Health IQ.  See if you qualify for lower rates! Go to <a href= \"http://www.healthiq.com/fool\">www.healthiq.com/fool</a>.  <a href= \"http://www.getquip.com/fool\">www.GETQUIP.COM/fool</a> for your first refill free!</p>",
  "enclosure": "",
  "itunes:duration": "41:11",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "It’s our Thanksgiving Special! Analysts Andy Cross, Ron Gross, and Jason Moser share why they’re thankful for stocks MarketAxess, CRISPR, and Zoetis. They discuss why investors might want to avoid stock market turkeys Uber, TripAdvisor, and Smile...",
  "itunes:episodeType": "full"
}