{
  "title": "Entangled Photons Can Come Out in Webs Now",
  "link": "https://spectrum.ieee.org/metasurface-entangled-photons",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/purple-toned-close-up-of-an-object-which-has-many-squares-on-it-covered-in-green-light.jpg?id=31842638&width=1200&height=800&coordinates=0%2C112%2C0%2C113\"/><br/><br/><p>The equipment that generates <a href=\"https://spectrum.ieee.org/what-is-quantum-entanglement\" target=\"_blank\">quantum entanglement</a> is often bulky and produces entangled photons only one pair at a time. Now scientists have created a device roughly one-third as thick as a penny that can yield complex webs of entangled photons—not just in pairs but several pairs all linked together. The invention may not only greatly simplify the setup needed for quantum technology but also help support more complex quantum applications.</p><p>A common way to generate entangled photons is by shining a beam of light at a special “<a href=\"https://spectrum.ieee.org/quantum-holography-using-undetected-light\" target=\"_self\">nonlinear crysta</a>l.” These crystals each can split a photon into two lower-energy, longer-wavelength entangled photons.</p><p class=\"pull-quote\">“The opportunities are vast, and we have just scratched the surface.”<br/>—Igal Brener, Sandia National Laboratories</p><p>The conventional techniques for producing entangled photons are not flexible—they generate pairs of photons only within specific ranges of wavelengths that are typically very narrow, says study cosenior author <a href=\"https://mpl.mpg.de/research-at-mpl/independent-research-groups/chekhova-research-group/\" target=\"_blank\">Maria Chekhova</a>, a physicist at the Max Planck Institute for the Science of Light in Erlangen, Germany. This narrow bandwidth can limit communication rates.</p><p>In addition, the standard methods for producing entangled photons end up dictating many of the properties of the entangled photons, such as their wavelength and polarization, Chekhova adds. More equipment is needed if one wants to further manipulate these features, she explains.</p><p>Moreover, nonlinear crystals are often bulky. This can prove cumbersome for applications that require many entangled photons. “A quantum computation source would require tens or hundreds of bulky crystals,” says study cosenior author <a href=\"https://www.lanl.gov/search-capabilities/profiles/igal-brener.shtml\" target=\"_blank\">Igal Brener</a>, a physicist at Sandia National Laboratories’ Center for Integrated Nanotechnologies in Albuquerque.</p><p>Instead of a lab full of crystals, lenses, mirrors, filters, and other equipment to generate entangled photons, scientists now find that devices only roughly a half-millimeter thick may suffice. The devices are <a href=\"https://spectrum.ieee.org/metalens\" target=\"_self\">metasurfaces</a>, which are surfaces covered with forests of microscopic pillars.</p><p>“We just need to focus one or more lasers onto a flat sample, and the rest is done by the metasurface,” Brener says.</p><p>The metasurfaces each consist of a glass surface 500 micromillimeters thick covered with gallium arsenide structures that each resemble cubes roughly 300 nanometers wide with notches cut into them. The way in which the composition, structure, and placement of each metasurface’s nanostructures are tailored could help the scientists control many features of light falling onto the devices.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A silver square with 110 pink rectangles in a grid. Blue waves come in the back and orange and red waves come out the front and are linked by white light.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"bc4935a69e19bdaad3cd85e538c3e18a\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"b9db1\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-silver-square-with-110-pink-rectangles-in-a-grid-blue-waves-come-in-the-back-and-orange-and-red-waves-come-out-the-front-and.jpg?id=31842653&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">In this artist rendering of a metasurface, light passes through tiny rectangular structures—the building blocks of the metasurface—and creates pairs of entangled photons at different wavelengths.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Sandia National Laboratories</small></p><p>Shining a laser beam onto these metasurfaces can result in entangled photons emerging. “One single metasurface can, in principle, create several types of entangled photon pairs,” Brener says. “Creating more complex quantum states using multiple photon pairs can lead to new or more efficient ways to do quantum computation, <a href=\"https://spectrum.ieee.org/superradiance-sensor\" target=\"_self\">sensing</a>, encryption, and so on.”</p><p>In addition, metasurfaces could manipulate a range of the entangled photons’ features, “but we haven’t explored that degree of freedom yet,” Brener says. “The opportunities are vast, and we have just scratched the surface.”</p><p>Currently the efficiency of these metasurfaces is low. “We had a rate of less than one pair per second, and standard crystals give hundreds of thousands pairs per second,” Chekhova says. However, she notes, further modifications of the devices may improve efficiency by at least a thousandfold.</p><p>The group’s research was detailed in a study <a href=\"https://www.science.org/doi/10.1126/science.abq8684\" rel=\"noopener noreferrer\" target=\"_blank\">online</a> 25 August in <em>Science. </em></p>",
  "pubDate": "Fri, 30 Sep 2022 15:02:09 +0000",
  "guid": "https://spectrum.ieee.org/metasurface-entangled-photons",
  "category": [
    "Gallium arsenide",
    "Quantum computing",
    "Quantum cryptography",
    "Quantum sensor",
    "Entanglement",
    "Nonlinear",
    "Metasurfaces"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}