{
  "title": "How We Determined Which Disinformation Publishers Profit From Google’s Ad Systems",
  "link": "https://www.propublica.org/article/google-ads-misinformation-methodology",
  "pubDate": "Sat, 29 Oct 2022 04:59:00 -0400",
  "guid": "https://www.propublica.org/article/google-ads-misinformation-methodology",
  "description": "\n                <p class=\"byline\">\n                by <a class=\"name\" href=\"https://www.propublica.org/people/ruth-talbot\">Ruth Talbot</a>, <a class=\"name\" href=\"https://www.propublica.org/people/jeff-kao\">Jeff Kao</a>, <a class=\"name\" href=\"https://www.propublica.org/people/craig-silverman\">Craig Silverman</a> and <a class=\"name\" href=\"https://www.propublica.org/people/anna-kluhspies\">Anna Klühspies</a>                </p>\n                                             \n\n                                                                    \n            \n                <p>ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive <a href=\"https://www.propublica.org/newsletters/the-big-story?source=54G&placement=top-note&region=national\">our biggest stories</a> as soon as they’re published.</p>\n\n            \n\n                \n\n      \n  \n\n\n\n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.0\">Our story “<a href=\"https://www.propublica.org/article/google-alphabet-ads-fund-disinformation-covid-elections\">How Google’s Ad Business Funds Disinformation Around the World</a>” found that, despite Google’s public commitments to fight disinformation, it continues to allow websites to use Google’s ad systems to profit from false and misleading content. Our reporting identified websites that were allowed to continue to collect revenue from Google ads, even on stories that appeared to be in violation of the company’s policies against unreliable and harmful claims related to COVID-19, health, elections and climate change. We also found that websites containing misinformation in languages other than English and smaller markets were more likely to be allowed to continue to profit from Google ads than similar English-language websites.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.1\">We analyzed datasets of articles and websites containing false claims to determine what proportion of them made money using Google’s ad platforms. We obtained these datasets from organizations that track online disinformation around the world and wrote software to determine whether a web address was currently earning money from Google ads. Between Aug. 23 and Sept. 13, 2022, we ran the datasets through this software system to calculate the proportion of web addresses monetizing with Google ads for each dataset. We include our detailed findings in Appendix A.</p>\n\nData Sources\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.2\">We analyzed 17 article and website datasets, totaling more than 13,000 active articles and over 8,000 domains, obtained from nine fact-checking and news quality monitoring organizations. Some of the datasets cover articles and websites from a particular country or region, while others cover subject matter, such as COVID-19 misinformation or climate change misinformation. In Appendix B we include a description of each dataset and the organizations that provided them.</p>\n\nData Cleaning\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.3\">The datasets varied in size, types of content and level of curation. We filtered all URL datasets to include only articles published after 2019 to keep the datasets recent and roughly within the same time frame. If the dataset provided information on the type of fact-checked content, we limited it to the most serious forms of disinformation or disinformation purveyors. For example, Brazil’s Netlab provided a column distinguishing between suspected and confirmed purveyors of disinformation, allowing us to select confirmed purveyors. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.4\">Some datasets included links to social media platforms, such as Facebook or Twitter. We excluded these links from our analysis. Some datasets also had links to images or pdfs, which we similarly excluded. See Appendix C for a full list of exclusions.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.5\">The datasets from the International Fact-Checking Network and Raskrinkavanje included articles that had been archived using a webpage archiving service such as archive.today. In these cases, we wrote programs to extract the original web addresses of the false or misleading articles. For the IFCN dataset, we extracted by hand any addresses that we could not extract by code. For Raskrinkavanje, we excluded from our final analysis any remaining links that could not be extracted. Links that could not be extracted accounted for less than 1% of the total webpages from the datasets. We do not have reason to believe these excluded links biased our results. See <a href=\"\">Appendix C</a> for more detailed information.</p>\n\nAnalyzing a Web Address\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.6\">Our system to determine whether a web address was currently earning money with Google’s ad systems consists of two components: a web scraper and a data analysis script.</p>\n\nWeb Scraper\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.7\">A web scraper is software that can systematically extract and save data from a visited web page. ProPublica’s scraper uses a library called <a href=\"https://playwright.dev/\">Playwright</a>, which can mimic human behavior when visiting a site and is often used for automated website testing.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"2.0\">When our web scraper visits any web address, URL or base domain, it collects and saves the following information:\n<ol><li>All network requests initiated by the webpage. Network requests are used to retrieve web content such as images, text and ads or to provide information such as user actions or profile information back to the web servers. </li>\n<li>The response for each network request, if those requests went out to Google servers (a handful of servers we identified as serving or related to Google’s ad content). When successful, these responses contain ad content that the website loads onto the page.</li>\n<li>The webpage content. Once the webpage loads, the scraper captures its HTML, the code that defines what a visitor to that page would see.</li></ol>\nWhen our web scraper visits a base domain, the location at which an entire site resides, it also saves the following information:\n<ol start=4><li>The ads.txt file: The ads.txt file lists all of a website’s advertising partners. Not all websites make this file available to visitors, but it is highly recommended by Google and the <a href=\"https://iabtechlab.com/\">IAB Tech Lab</a> as a web advertising transparency best practice.</li>\n<li>A random subpage: When visiting a website, the scraper will select an arbitrary subpage link found on the base domain (e.g. for test.com, test.com/morecontent) and also scrape the same information for that page. This is done to capture cases where the homepage for a website does not run ads, but sections of the website do.\n</li></ol></p>\n        \n    \n                    \nAnalysis Script\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.0\">Our analysis tool processes the above data from each URL to determine whether the address is valid, and if so whether it is monetizing with Google’s ad systems. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.1\">We manually identified 10 separate network request and response pairs that indicate a webpage is making a request to a Google server for one or multiple ads. If the response did not contain advertising content, then we did not count the website as monetizing with Google. (This may occur, for example, if the webpage makes an ad request, but Google has demonetized the specific page or website.) We then wrote software that would look for these request-response pairs in the data collected by our web scraper.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.2\">We also identified scenarios where a scraper visit did not result in valid webpage content. These invalid visits can mean the scraper was redirected to a different page from the original page, the content at the web address is no longer available, or the server is no longer reachable.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.3\">Thus, for a single web address, there are three possible outcomes of the analysis:</p>\n\n<ol>\n<li>The web address is valid, and it is monetizing with Google’s ad systems.</li>\n<li>The web address is valid, but it is not monetizing with Google’s ad systems.</li>\n<li>The web address is not valid or the content has been removed.</li>\n</ol>\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.4\">We scraped and analyzed each web address in our 17 datasets to determine which of the three categories it fell under. We then compiled the results in a spreadsheet. Appendix A provides the detailed results of this analysis. </p>\n\nVerifying the Results\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.5\">We hand-checked the results of all of the smaller domain datasets by visiting each page and determining the validity of its web address and whether the webpage was monetizing via Google’s ad systems. For the larger datasets containing individual webpages, we extracted and checked a random sample of web addresses by hand, using a 90% confidence level and 10% margin of error.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.6\">The scraper and analysis tools were designed to make false positives (where we falsely flag a web address as monetizing with Google) very rare. In fact, we never identified a false positive during our audit. There were some instances where ads were displayed at the time of the scrape but not when we manually visited the page later on (or vice versa). In these cases, we manually examined the scraped data to confirm ad content was served at the time of the scrape. There were a few rare instances where content returned from the ad server was never loaded on the page, possibly because of coding errors on the webpage. We still counted these cases as positives, since they are indications of an active monetization relationship with Google.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.7\">False negatives (where the scraper did not find ads on the page but ads were present) were more common due to several scenarios: For example, the scraper was sometimes blocked from accessing a page or failed to bypass page pop-ups such as consent forms. In our audits we saw false negative rates of between 0% and 13%. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.8\">Because we found false negatives more often than false positives, the true proportion of these web addresses monetizing with Google’s ad systems is likely slightly higher than what we reported.</p>\n        \n    \n                    \n<p class=\"c4\">Dataset name</p>\n<p class=\"c4\">Data source</p>\n<p class=\"c4\">Languages covered</p>\n<p class=\"c4\">Regions covered</p>\n<p class=\"c4\">Domains or Web Pages</p>\n<p class=\"c4\">Number&nbsp;of valid web addresses analyzed</p>\n<p class=\"c4\">Number&nbsp;of valid web addresses monetizing Google ads</p>\n<p class=\"c11\">% of valid web addresses monetizing Google &nbsp;ads</p>\n<p class=\"c4\">Africa Check</p>\n<p class=\"c4\">Misinformation</p>\n<p class=\"c4\">Web Pages</p>\n<p class=\"c4\">Africa Check</p>\n<p class=\"c4\">English</p>\n<p class=\"c4\">Nigeria, South Africa, and Kenya</p>\n<p class=\"c4\">Web pages</p>\n<p class=\"c4\">66</p>\n<p class=\"c4\">38</p>\n<p class=\"c4\">57.6</p>\n<p class=\"c4\">Africa Check </p>\n<p class=\"c4\">Misinformation</p>\n<p class=\"c4\">Web Pages</p>\n<p class=\"c4\">Senegal</p>\n<p class=\"c4\">Africa Check</p>\n<p class=\"c4\">French</p>\n<p class=\"c4\">Senegal, Guinea, Mali, C&ocirc;te d'Ivoire, and Cameroon</p>\n<p class=\"c4\">Web pages</p>\n<p class=\"c4\">44</p>\n<p class=\"c4\">29</p>\n<p class=\"c4\">65.9</p>\n<p class=\"c4\">Balkans </p>\n<p class=\"c4\">MisinformationWeb Pages</p>\n<p class=\"c4\">Raskrinkavanje</p>\n<p class=\"c4\">Bosnian-Croatian-Serbian</p>\n<p class=\"c11\">Serbia, Croatia, Bosnia and Herzegovina</p>\n<p class=\"c4\">Web pages</p>\n<p class=\"c4\">9,973</p>\n<p class=\"c4\">6,216</p>\n<p class=\"c4\">62.3</p>\n<p class=\"c4\">Balkans Publishers</p>\n<p class=\"c4\">&#8203;&#8203;Raskrinkavanje</p>\n<p class=\"c4 c18\"></p>\n<p class=\"c4 c18\"></p>\n<p class=\"c4\">Bosnian-Croatian-Serbian</p>\n<p class=\"c11\">Serbia, Croatia, Bosnia and Herzegovina</p>\n<p class=\"c4\">Domains</p>\n<p class=\"c4\">30</p>\n<p class=\"c4\">26</p>\n<p class=\"c4\">86.7</p>\n<p class=\"c4\">Brazil Publishers</p>\n<p class=\"c4\">Netlab</p>\n<p class=\"c4\">Portuguese</p>\n<p class=\"c4\">Brazil</p>\n<p class=\"c4\">Domains</p>\n<p class=\"c4\">30</p>\n<p class=\"c4\">24</p>\n<p class=\"c4\">80</p>\n<p class=\"c4\">Latin American Publishers</p>\n<p class=\"c4\">Chequeado</p>\n<p class=\"c4\">Spanish, Portuguese</p>\n<p class=\"c11\">Argentina, Bolivia, Brazil, Colombia, Costa Rica, Cuba, Ecuador, Venezuela, Peru and Mexico</p>\n<p class=\"c4\">Domains</p>\n<p class=\"c4\">49</p>\n<p class=\"c4\">19</p>\n<p class=\"c4\">38.8</p>\n<p class=\"c4\">Covid Disinformation Pages</p>\n<p class=\"c4\">International Fact-Checking Network</p>\n<p class=\"c4\">Various</p>\n<p class=\"c4\">Global</p>\n<p class=\"c4\">Web pages</p>\n<p class=\"c4\">814</p>\n<p class=\"c4\">338</p>\n<p class=\"c4\">41.5</p>\n<p class=\"c4\">NewsGuard Publisher list</p>\n<p class=\"c4\">NewsGuard</p>\n<p class=\"c4\">Various</p>\n<p class=\"c4\">Global</p>\n<p class=\"c4\">Domains</p>\n<p class=\"c4\">7,739</p>\n<p class=\"c4\">4,186</p>\n<p class=\"c4\">54.1</p>\n<p class=\"c4\">Turkey Disinformation Pages</p>\n<p class=\"c4\">Teyit</p>\n<p class=\"c4\">Turkish</p>\n<p class=\"c4\">Turkey</p>\n<p class=\"c4\">Web pages</p>\n<p class=\"c4\">1,035</p>\n<p class=\"c4\">756</p>\n<p class=\"c4\">73</p>\n<p class=\"c4\">Turkey Publishers</p>\n<p class=\"c4\">Teyit</p>\n<p class=\"c4\">Turkish</p>\n<p class=\"c4\">Turkey</p>\n<p class=\"c4\">Domains</p>\n<p class=\"c4\">50</p>\n<p class=\"c4\">45</p>\n<p class=\"c4\">90</p>\n<p class=\"c4\">Spanish Language Publishers</p>\n<p class=\"c4\">EU DisinfoLab</p>\n<p class=\"c4\">Spanish</p>\n<p class=\"c4\">Spain</p>\n<p class=\"c4\">Domains</p>\n<p class=\"c4\">32</p>\n<p class=\"c4\">14</p>\n<p class=\"c4\">43.8</p>\n<p class=\"c4\">German Language Publishers</p>\n<p class=\"c4\">EU DisinfoLab</p>\n<p class=\"c4\">German</p>\n<p class=\"c4\">Germany, Austria and Switzerland</p>\n<p class=\"c4\">Domains</p>\n<p class=\"c4\">30</p>\n<p class=\"c4\">10</p>\n<p class=\"c4\">33.3</p>\n<p class=\"c4\">EU </p>\n<p class=\"c4\">Disinformation Pages</p>\n<p class=\"c4\">EU DisinfoLab</p>\n<p class=\"c4\">Various</p>\n<p class=\"c4\">EU</p>\n<p class=\"c4\">Web pages</p>\n<p class=\"c4\">235</p>\n<p class=\"c4\">57</p>\n<p class=\"c4\">24.3</p>\n<p class=\"c4\">Climate </p>\n<p class=\"c4\">Disinformation Pages</p>\n<p class=\"c4\">Science Feedback</p>\n<p class=\"c4\">Various</p>\n<p class=\"c4\">Global</p>\n<p class=\"c4\">Web pages</p>\n<p class=\"c4\">427</p>\n<p class=\"c4\">86</p>\n<p class=\"c4\">20.1</p>\n\n</p>\n        \n    \n                    \nAppendix B: Organization and Dataset details\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.0\">All datasets were filtered to remove duplicates, archived URLs that could not be successfully unarchived, data before 2019 and URLs from social media sites such as Facebook, Twitter, Weibo, Pinterest, Telegram and WhatsApp (see full list in Appendix C). </p>\n\nAfrica Check\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.1\">Website: <a href=\"https://africacheck.org/\">https://africacheck.org/</a> </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.2\">Description: Africa Check is an African nonprofit fact-checking organization founded in South Africa in 2012.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.3\">Datasets analyzed:</p>\n\n<ul>\n<li>Articles in French from Senegal, Guinea, Mali, Côte d’Ivoire and Cameroon between 2019 and 2022 fact-checked and determined to be misinformation.</li>\n<li>Articles in English from Nigeria, South Africa and Kenya between 2019 and 2022 fact-checked and determined to be misinformation.Raskrinkavanje\n</li>\n</ul>\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.4\">Website: <a href=\"https://raskrinkavanje.ba/\">https://raskrinkavanje.ba/</a> </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.5\">Description: Raskrinkavanje is a fact-checking program for media organizations in the Balkans. It was founded in 2017 by Zašto ne, a civil society organization based in Bosnia and Herzegovina.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.6\">Datasets analyzed: </p>\n\n<ul>\n<li>Articles from the region between 2019 and July 2022 that were fact-checked by Raskrinkavanje and determined to be misinformation.</li>\n<li>Thirty websites that were most frequently identified as publishing misinformation by Raskrinkavanje in the region from 2019 to July 2022.Netlab\n</li>\n</ul>\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.7\">Website: <a href=\"http://www.netlab.eco.ufrj.br/\">http://www.netlab.eco.ufrj.br/</a></p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.8\">Description: Netlab is a research laboratory of the School of Communication of the Federal University of Rio de Janeiro (UFRJ) that uses network analysis to study online misinformation.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.9\">Datasets analyzed: </p>\n\n<ul>\n<li>A list of websites shared within Brazilian right wing and left wing WhatsApp and Telegram groups and channels in August 2022 and flagged by researchers as a source of disinformation in Portuguese.Chequeado\n</li>\n</ul>\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.10\">Website: <a href=\"https://chequeado.com/\">https://chequeado.com/</a> </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.11\">Description: Chequeado is a nonpartisan, nonprofit news monitoring and fact-checking organization founded in Argentina in 2010.  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.12\">Datasets analyzed: </p>\n\n<ul>\n<li>Websites determined by LatamChequea, Chequado’s fact-checking partners in Latin America, to be spreading false information.International Fact-Checking Network\n</li>\n</ul>\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.13\">Website: <a href=\"https://www.poynter.org/ifcn/\">https://www.poynter.org/ifcn/</a> </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.14\">Description: The International Fact-Checking Network is a network of 100 fact-checking organizations around the world. It was launched in 2015 by the Poynter Institute, a nonprofit journalism institute based in St. Petersburg, Florida. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.15\">Datasets analyzed:</p>\n\n<ul>\n<li>COVID: links to social media and news content spreading misinformation about the COVID-19 pandemic.NewsGuard\n</li>\n</ul>\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.16\">Website: <a href=\"https://www.newsguardtech.com/\">https://www.newsguardtech.com/</a></p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.17\">Description: NewsGuard is a company that provides trust ratings for the most visited websites in the U.S., U.K., Canada, Germany, France and Italy.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.18\">Datasets analyzed:</p>\n\n<ul>\n<li>Domains for news websites around the world rated by NewGuard. Reliability ratings range from 0 to 100 (0 being completely untrustworthy).Teyit\n</li>\n</ul>\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.19\">Website: <a href=\"https://teyit.org/\">https://teyit.org/</a> </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.20\">Description: Teyit is a Turkish nonprofit fact-checking and media literacy social enterprise founded in 2016.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.21\">Datasets analyzed: </p>\n\n<ul>\n<li>Articles that were published in 2019 or later that contained claims categorized as “incorrect association,” “manipulation,” or “distortion” and which the fact-checkers had not seen subsequently corrected. (Fact-checkers provided access to a database containing a wide range of thousands of fact-checks which ProPublica filtered based on the previous criteria.)EU DisinfoLab\n</li>\n</ul>\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.22\">Website: <a href=\"https://www.disinfo.eu/\">https://www.disinfo.eu/</a></p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.23\">Description: EU DisinfoLab is a Brussels-based nonprofit organization that studies misinformation in the EU.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.24\">Datasets analyzed:</p>\n\n<ul>\n<li>Articles from the region between 2019 and present that were fact-checked by EU DisinfoLab and determined to be misinformation.</li>\n<li>Websites from Spain and German-speaking countries that were identified as sources of false and misleading claims in the regions.Science Feedback\n</li>\n</ul>\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.25\">Website: <a href=\"https://sciencefeedback.co/\">https://sciencefeedback.co/</a> </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.26\">Description: Science Feedback is a nonprofit based in France that produces scientist-expert fact-checks for health and climate news articles.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.27\">Datasets analyzed: </p>\n\n<ul>\n<li>Articles related to climate and climate change published in 2019 or later that Science Feedback rated their lowest rating, “False.”</li>\n</ul>\nAppendix C: Dataset Cleaning Criteria\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.28\">All datasets were cleaned with the intention of removing invalid links, social media traffic, archived content and images/PDFs. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.29\">Any links originating from the below social media or content hosting sites were removed from the final analysis. </p>\n\n<ul>\n<li>Google Drive</li>\n<li>Facebook</li>\n<li>Instagram</li>\n<li>Pinterest</li>\n<li>Telegram</li>\n<li>TikTok</li>\n<li>Twitter</li>\n<li>Vimeo</li>\n<li>Weibo</li>\n<li>WhatsApp</li>\n<li>YouTube </li>\n</ul>\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.30\">Any links ending in any of the below were automatically excluded from the final analysis:</p>\n\n<ul>\n<li>.png</li>\n<li>.jpg</li>\n<li>.jpeg</li>\n<li>.pdf</li>\n<li>?type=image</li>\n</ul>\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.31\">Any of the archiving sites below were visited and an attempt was made to extract the archived URL. If the extraction failed or the extracted link was of a type that should be excluded from the final analysis anyway, the URL was discarded. </p>\n\n<ul>\n<li>Web.archive.org</li>\n<li>Webcache.googleusercontent.com</li>\n<li>Archive.today</li>\n<li>google.com/url?</li>\n<li>perma.cc</li>\n</ul>\n</p>\n        \n                                   ",
  "dc:subject": "",
  "dc:date": "2022-10-29T04:59:00-04:00",
  "dc:creator": "by Ruth Talbot, Jeff Kao, Craig Silverman and Anna Klühspies"
}