{
  "title": "BRYCE HALL WILL HATE TAYLER HOLDER FOREVER — BFFs EP. 96",
  "description": "<p>We're back with our most recurring guest Bryce Hall who in typical Bryce Hall fashion is late despite living 5 minutes away from Josh's new place. We get into headlines with Monty Lopez still going off on social media, Addison staying away from her parent drama publicly, Monty writing an... interesting diss track about Sheri and Yung Gravy, him potentially starting and OnlyFans with Ava Louise, Yung Gravy calling out Dave about his Sheri Nicole take, and Monty Lopez going off on Sofia Franklyn.\n\nWe continue with Tayler Holder and Charly Jordan potentially getting back together, Charly texting Bryce about what he said about her on TeaTalk, Nessa's copycat claiming what she was doing was a \"social experiment\", Leonardo DiCaprio not dating anyone over the age of 25, Lana Rhoades calling out her NBA baby daddy, Kanye West going off on Instagram (again), Mr. Beast's insane burger shop opening, Bryce's Tik Toks that he has been posting with Addison, a Tik Tokker getting revenge on her haters by DM'ing their husbands, Kate Moss pulling a diamond from Johnny Depp's butt crack, and end with some BFFS corner where Josh may or may not have been posting some interesting Tik Toks about his \"girl\".\n\nSupport Our Sponsors!\nBeis: Go to https://barstool.link/BeisBFF for 15% off your first purchase!\nBirddogs: Go to https://barstool.link/BirddogsBSS and use promo code BFF for a free Birddogs rope hat!</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "0eca1dc4-a7c5-4b37-9e48-c1c6059903c1",
  "pubDate": "Thu, 8 Sep 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "00:46:09",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}