{
  "title": "Criminal Minds: Evolution trailer exposes a serial killer network",
  "link": "https://www.digitaltrends.com/movies/criminal-minds-evolution-trailer-exposes-a-serial-killer-network/",
  "pubDate": "Fri, 04 Nov 2022 20:37:35 +0000",
  "dc:creator": "Blair Marnell",
  "category": [
    "Movies & TV",
    "News",
    "best thrillers",
    "criminal minds",
    "Criminal Minds: Evolution",
    "paramount plus",
    "serial killers"
  ],
  "guid": "https://www.digitaltrends.com/?p=3220588",
  "description": "The Behavioral Analysis Unit team is back in Criminal Minds: Evolution, and they're facing a new generation of serial killers who have joined forces.",
  "content:encoded": "<p>If there was ever going to be a serial killer network, it would probably be CBS. For the last two decades, CBS has had, shall we say, an unhealthy fixation on serial killer-of-the-week dramas. Among the ocean of CBS procedural dramas, <a href=\"https://www.digitaltrends.com/movies/paget-brewster-hypochondriac-interview/\"><em>Criminal Minds</em></a> had a successful 15-season run that ended in 2020. After only a two-year hiatus, a new iteration of the show is returning in just a few weeks. But in the new trailer for Paramount+&#8217;s <em>Criminal Minds: Evolution</em>, the serial killers haven&#8217;t just upped their game. They&#8217;ve banded together.</p>\n<iframe src=\"https://www.youtube.com/embed/dMhK_IN8oIQ\" width=\"640\" height=\"360\"></iframe>\n<p>The reunited members of the FBI&#8217;s Behavioral Analysis Unit team soon realize that the serial killers were impacted by the pandemic as well. And without their usual hunting grounds, these psychos have formed their own serial killer social network. That&#8217;s putting the team to the ultimate test since this is far from a textbook case. If anything, it&#8217;s rewriting their entire playbook.</p>\n<figure class=\"alignnone\"><img  class=\" size-large wp-image-3220624\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/Criminal-Minds-Evolution-trailer.jpg?fit=720%2C405&p=1\" alt=\"The cast of Criminal Minds: Evolution.\"   /></figure>\n<p>Joe Mantegna is once again back as David Rossi, alongside Paget Brewster as Emily Prentiss, A.J. Cook as Jennifer &#8220;JJ&#8221; Jareau, Kirsten Vangsness as Penelope Garcia, Aisha Tyler as Tara Lewis, and Adam Rodriguez as Luke Alvez. Zach Gilford will also appear on a recurring basis as Elias Voit alongside Josh Stewart as Will LaMontagne Jr.</p>\n<p><a href=\"https://www.digitaltrends.com/movies/paramount-plus-price-plans-movies-shows-sports/\">Paramount+</a> is giving <em>Criminal Minds: Evolution</em> a special Thanksgiving premiere on Thursday, November 24. The first two episodes of the revival series will be released on that day, to give the holiday season an unsettling flavor. Three episodes will be released weekly through December 15, before the show goes on hiatus until January 12, 2023. At that point, the five remaining episodes of the season will once again debut weekly.</p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2022/11/Criminal-Minds-Evolution-trailer.jpg?p=1",
  "enclosure": "",
  "post-id": 3220588
}