{
  "title": "Why Graphyne Isn’t Graphene 2.0",
  "link": "https://spectrum.ieee.org/graphyne-wondering-over-the-new-wonder-material",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/illustration-of-graphyne-structure.jpg?id=30012828&width=1200&height=800&coordinates=0%2C8%2C0%2C8\"/><br/><br/><p>Since graphene’s discovery 18 years ago—leading to a Nobel Prize in Physics in 2010—the versatile material has been investigated for hundreds of applications. These include strong <a href=\"https://spectrum.ieee.org/graphene-composites-go-big\" target=\"_self\">composite materials</a>, high-capacity battery electrodes, transparent conductive coatings for displays and solar cells, <a href=\"https://spectrum.ieee.org/smallest-transistor-one-carbon-atom\" target=\"_self\">supersmall</a> and <a href=\"https://spectrum.ieee.org/ucla-builds-fastest-graphene-transistor-yet\" target=\"_self\">ultrafast transistors</a>, and <a href=\"https://spectrum.ieee.org/printed-electronics-graphene-emulsion\" target=\"_self\">printable electronics</a>.</p><p>While graphene is finding its way into sports equipment and car tires for its mechanical strength, though, its highly touted electronic applications have been slower to materialize. One reason is that bulk graphene is not a semiconductor. To make it semiconductive, which is crucial for transistors, it must be produced in the form of nanoribbons with the right dimensional ratios.</p><p>There’s another one-dimensional form of carbon related to graphene that scientists first predicted back in 1987, that is a semiconductor without needing to be cut into certain shapes and sizes. But this material, graphyne, has proven nearly impossible to make in more than microscopic quantities.</p><p>Now, researchers at the University of Colorado in Boulder have reported a method to produce graphyne in bulk. “By using our method we can make bulk powder samples,” says <a href=\"https://www.colorado.edu/chemistry/wei-zhang\" target=\"_blank\">Wei Zhang</a>, a professor of chemistry at University of Colorado Boulder. “We find multilayer sheets of graphyne made of 20 to 30 layers. We are pretty confident we can use different exfoliation methods to gather a few layers or even a single layer.”</p><p>Graphite, diamond, fullerenes, and graphene are all carbon allotropes, and their diverse properties arise from the combination and arrangement of multiple types of bonds between their carbon atoms. So while the 3D cubic lattice of carbon atoms in diamond make it exceptionally hard, graphene’s single layer of carbon atoms in a hexagonal lattice make it extremely conductive.</p><p>Graphyne is similar to graphene in that it’s an atom-thick sheet of carbon atoms. But instead of a hexagonal lattice, it can take on different structures of spaced-apart rings connected via triple bonds between carbon atoms.</p><p>The material’s unique conducting, semiconducting, and optical properties could make it even more exciting for electronic applications than graphene. Graphyne's intrinsic electron mobility could, in theory, be 50 percent higher than graphene. In some graphynes, electrons can be conducted only in one direction. And the material has other exciting properties such as ion mobility, which is important for battery electrodes. </p><p>Zhang, Yingjie Zhao of Qingdao University of Science and Technology, in China, and their colleagues made graphyne using a method called <a href=\"https://en.wikipedia.org/wiki/Alkyne_metathesis\" target=\"_blank\">alkyne metathesis</a>. This is a catalyst-triggered organic reaction in which chemical bonds between carbon atoms in hydrocarbon molecules can crack open and reform to reach a more stable structure.</p><p>The process is complicated and slow. But it produces enough graphyne for scientists to be able to study the material’s properties in depth and evaluate its uses for potential applications. “It will take at least a couple years to have some fundamental understanding of the material,” says Zhang. “Then it will be in good shape for people to take it to a higher level, which is targeting specific semiconducting or battery applications.”</p><p>He and his colleagues plan to investigate ways to produce the material in much larger quantities. Being able to use solution-based chemical reactions would be critical for making graphyne at industrially relevant scales, he says. </p><p>It’s just the beginning for graphyne though, and for now, just being able to make this long-hypothesized material in sufficient quantities is an exciting first step. “Fullerenes were discovered in the 1980s, then nanotubes in the early '90s, then graphene in 2004,” Zhang says. “From discovery of a new carbon allotrope to its intensive study to first application, the timeline is becoming shorter. I’m already receiving calls from venture capitalists around the world. But I tell them it’s a little bit early.”</p>",
  "pubDate": "Thu, 23 Jun 2022 18:20:00 +0000",
  "guid": "https://spectrum.ieee.org/graphyne-wondering-over-the-new-wonder-material",
  "category": [
    "Graphene",
    "Graphyne",
    "Nanomaterials"
  ],
  "dc:creator": "Prachi Patel",
  "media:content": ""
}