{
  "title": "5 Takeaways From Our Investigation Into RealPage’s Rent-Setting Algorithm",
  "link": "https://www.propublica.org/article/why-rent-is-so-high",
  "pubDate": "Fri, 28 Oct 2022 07:00:00 -0400",
  "guid": "https://www.propublica.org/article/why-rent-is-so-high",
  "description": "\n                <p class=\"byline\">\n                by <a class=\"name\" href=\"https://www.propublica.org/people/sophia-kovatch\">Sophia Kovatch</a>                </p>\n                                             \n\n                                                                    \n            \n                <p>ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive <a href=\"https://www.propublica.org/newsletters/the-big-story?source=54G&placement=top-note&region=national\">our biggest stories</a> as soon as they’re published.</p>\n\n            \n\n                \n\n      \n  \n\n\n\n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.0\">Nationwide, <a href=\"https://www.redfin.com/news/redfin-rental-report-september-2022/\">rent was up by 9%</a> in September compared to the previous year. That’s the first time in 2022 that rent increases were in the single digits, down from an 18% increase in March, according to an analysis by the real estate company Redfin. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.1\">While supply and demand, high mortgage interest rates and other economic factors are certainly at play in rising rents, <a href=\"https://www.propublica.org/article/yieldstar-rent-increase-realpage-rent\">an investigation by ProPublica</a> found another key factor: a rental pricing software owned by real estate tech firm RealPage. Here’s what we learned.</p>\n        \n    \n                        \n    \n        How RealPage’s Rent-Setting Algorithm Works\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.0\">The software collects tons of data from its clients, many of whom price tens of thousands of units. All together, RealPage says its rent-setting algorithm holds <a href=\"https://www.realpage.com/asset-optimization/revenue-management/\">lease transaction data</a> for more than 13 million units across the country.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.1\">Each day, the software recommends a new price for every available unit. To determine the new rate, it draws from competitor data on the actual rent tenants paid, as opposed to the publicly advertised rent.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.2\">The use of private competitor data — though it is aggregated and anonymized — to set prices is one of the concerns experts raised. The practice could allow RealPage to stifle rental competition, they said, driving up rents across the country and, potentially, even violating antitrust laws. Experts said that RealPage also sponsors meetings that gather competitors together to talk about pricing, which could also be a warning sign of collusion.</p>\n        \n    \n                        \n    \n        What You Need to Know About RealPage\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.0\"><strong>1. Landlords use RealPage to make more money.</strong> RealPage boasts that it helps landlords <a href=\"https://www.propublica.org/article/yieldstar-rent-increase-realpage-rent\">outperform the market by up to 7%</a> — that is, its software users can expect better-than-market-average revenues, even in weak markets. Greystar, the largest property manager in the U.S., outperformed its markets by 4.8% in one downturn, according to RealPage materials.   </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.1\">RealPage promises streamlined apartment pricing and flexible options for renters, but the true benefit for landlords is just how far the software will push rents up — far beyond what most property managers are willing to do manually. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.2\"><strong>2. RealPage believes it is driving rents higher across the country.</strong> A now-deleted video showed a RealPage executive saying in 2021 that the company’s software was a driver of <a href=\"https://www.multihousingnews.com/2021-rent-growth/\">double-digit rent increases</a> across the country. Another executive said most property managers would be hesitant to raise rents by double digits without the assistance of the software. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.3\">Take this example from Seattle: In a RealPage-priced building in a downtown Seattle ZIP code, rent rose by 33% in one year for a couple living in a one-bedroom apartment. In a non-algorithm-priced building in the same ZIP code, rent for another tenant’s studio rose by just 3.9% over a similar period. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.4\">Property managers don’t have to accept the software’s recommendations — they are free to reject the algorithm’s price if they feel it’s too high or low. But overall, about 90% of recommendations are implemented, former employees said. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.5\"><strong>3. RealPage discourages landlords from bargaining with tenants over rents.</strong> One of the developers of RealPage’s price-setting software said leasing agents have “too much empathy” with renters, which can lead them to hesitate to seek the highest rents. The software automates rent-setting calculations, leading to more revenue for landlords and property management companies. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.6\">This may be why RealPage discourages bargaining with tenants about rent. When you take the human element out of the equation, profits seem to soar. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.7\"><strong>4. Critics say RealPage may encourage pricing collusion among landlords.</strong> When RealPage acquired LRO, its main pricing competitor, in 2017, the Department of Justice’s antitrust division investigated the deal. The merger ultimately proceeded, doubling the number of units RealPage priced — and expanding its cache of data.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.8\">Legal experts have raised concerns that RealPage’s software could be facilitating collusion among clients in places where many of them use it to set rents. In particular, the company’s User Group — a forum for clients to work together and suggest software improvements — could be an “antitrust red flag,” they said. The group has more than 1,000 members and two subcommittees on pricing, which meet in private at annual conferences. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.9\">Days after ProPublica released its investigation into RealPage, a group of <a href=\"https://www.propublica.org/article/realpage-accused-of-collusion-in-new-lawsuit\">renters filed a lawsuit</a> alleging that nine of the largest property management firms in the U.S. are working together to artificially inflate rents, violating federal law. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.10\"><strong>5. RealPage says it uses data in a “legally compliant” way.</strong> The company told ProPublica that it “uses aggregated market data from a variety of sources in a legally compliant manner.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.11\">RealPage noted that landlords who use employees to manually set prices “typically” conduct phone surveys to check competitors’ rents, which the company says could result in anti-competitive behavior.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.12\">“RealPage’s revenue management solutions prioritize a property’s own internal supply/demand dynamics over external factors such as competitors’ rents,” <a href=\"https://www.documentcloud.org/documents/23127400-realpage-statement?responsive=1&title=1\">a company statement</a> said, “and therefore help eliminate the risk of collusion that could occur with manual pricing.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.13\">The statement said RealPage’s software also helps prevent rents from reaching unaffordable levels because it detects drops in demand, like those that happen seasonally, and can respond to them by lowering rents.</p>\n        \n    \n                        \n    \n        Other Reasons Rent Is So High\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.0\">Although RealPage’s software is affecting rental prices in markets across the country, it’s far from the only factor in increasing rents. Here are some other things that help explain why rent is so high. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.1\"><strong>1. Private equity-owned rentals:</strong> Since 2011, there’s been a steady increase in the number of <a href=\"https://www.propublica.org/article/when-private-equity-becomes-your-landlord\">rental units owned by private equity-backed firms</a>, according to reporting by ProPublica. These property management firms aim to increase short-term profits by increasing rents, cutting costs, or both. By 2021, more than half of the top 35 apartment building owners were backed by <a href=\"https://www.propublica.org/article/what-is-private-equity\">private equity</a>, likely contributing to higher rents around the country.</p>\n        \n    \n                            \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"9.0\"><strong>2. High cost of homebuying:</strong> Property values in many markets escalated steeply in the years after the Great Recession. More recently, average interest rates on 30-year fixed-rate mortgages in the U.S. have soared, now <a href=\"https://www.bankrate.com/mortgages/analysis/\">surpassing 7%</a> — nearly double what they were this time last year. Both trends have slowed homebuying, pushing rental demand and prices higher. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"9.1\"><strong>3. Slow, expensive construction:</strong> Supply chain issues have slowed housing construction, reducing the rental supply as demand increases. As inflation affects every sector of the economy, the costs of labor and materials go up, making it hard to build housing people can afford. The nation has lagged in constructing the new housing units needed in most years since the Great Recession.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"9.2\"><strong>4. Supply and demand:</strong> With more people forced to rent, there simply aren’t enough rental units to go around — especially in some markets that saw an influx of new renters during the pandemic. Higher competition for rentals drives prices up.</p>\n        \n             \n\n                                    \n        \n                        <p><a href=\"https://www.propublica.org/people/heather-vogell\">Heather Vogell</a> contributed reporting.</p>\n\n        \n\n    \n                                         ",
  "dc:subject": "",
  "dc:date": "2022-10-28T07:00:00-04:00",
  "dc:creator": "by Sophia Kovatch"
}