{
  "title": "NBA week 12 summary, week 13 predictions",
  "link": "",
  "published": "2015-01-30T12:36:00-08:00",
  "updated": "2015-01-30T12:36:00-08:00",
  "author": {
    "name": "Jonathan Landy"
  },
  "id": "tag:efavdb.com,2015-01-30:/nba-week-12-summary-week-13-predictions",
  "summary": "<p><a href=\"https://efavdb.com/wp-content/uploads/2015/01/10941913_10101474381893663_4472456147644800505_n.jpg\"><img alt=\"10941913_10101474381893663_4472456147644800505_n\" src=\"https://efavdb.com/wp-content/uploads/2015/01/10941913_10101474381893663_4472456147644800505_n.jpg\"></a></p>\n<p>We correctly predicted 36/53 of the games this past week, which equates to an accuracy of 67.9% &#8212; a slight improvement over the past couple of weeks, but still short of the 70% level we strive for (off by about one game!). The breakdown by point spread is below …</p>",
  "content": "<p><a href=\"https://efavdb.com/wp-content/uploads/2015/01/10941913_10101474381893663_4472456147644800505_n.jpg\"><img alt=\"10941913_10101474381893663_4472456147644800505_n\" src=\"https://efavdb.com/wp-content/uploads/2015/01/10941913_10101474381893663_4472456147644800505_n.jpg\"></a></p>\n<p>We correctly predicted 36/53 of the games this past week, which equates to an accuracy of 67.9% &#8212; a slight improvement over the past couple of weeks, but still short of the 70% level we strive for (off by about one game!). The breakdown by point spread is below, and the new predictions are&nbsp;up.</p>\n<p>This week, we also updated the design of the <a href=\"http://efavdb.github.io/weekly-nba-predictions\">weekly <span class=\"caps\">NBA</span> predictions page</a>. We&#8217;ve improved the visual look and also opted to print out the win-loss records next to each team. This is actually pretty useful because it provides a quick check whether our predictions are unusual in some way. Often, I&#8217;ve found that if a prediction disagrees with the record-based favorite, a quick check at the dashboard wheel can give some insight into why (eg, checking prior matches of the pair, or perhaps checking whether the predicted winner has managed to beat some surprisingly good teams, etc.). This sort of situation is actually where I have the most fun using the wheel. We&#8217;ve also implemented some changes to our weekly predictions page processing code that allows for it to be viewed nicely on any screen size &#8212; a significant improvement for us cell phone viewers! We&#8217;ll try to implement a similarly flexible version of the dashboard soon,&nbsp;too.</p>\n<p>One last point: Thanks to James Kung for inviting us to what turned out to be a very memorable game last Friday (pic above, also courtesy of James)! edit: the <a href=\"https://www.youtube.com/watch?v=Wxjsz92v53M\">youtube vid</a> of Klay&#8217;s historic quarter. edit 2: What&#8217;s not shown in the video, and what really got the crowd excited from the start of Klay&#8217;s run, was the fact that the Warriors seemingly missed their previous 20 shots. This let the Kings come back from a large early Warriors lead. The crowd was on their feet Klay&#8217;s second shot&nbsp;onwards.</p>\n<table>\n<thead>\n<tr>\n<th>Point spread</th>\n<th># games</th>\n<th>Accuracy</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>&lt; 5</td>\n<td>10</td>\n<td>50%</td>\n</tr>\n<tr>\n<td>5-9</td>\n<td>21</td>\n<td>76%</td>\n</tr>\n<tr>\n<td>10-14</td>\n<td>9</td>\n<td>67%</td>\n</tr>\n<tr>\n<td>&gt;14</td>\n<td>13</td>\n<td>69%</td>\n</tr>\n</tbody>\n</table>",
  "category": ""
}