{
  "title": "544: The Harry Potter Stars Reunite, and We Review!",
  "link": "https://audioboom.com/posts/8006734",
  "itunes:episode": 544,
  "itunes:title": "The Harry Potter Stars Reunite, and We Review!",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 6288,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>MuggleCast excitedly kicks off the year 2022 with their review of the brand new <em>Harry Potter 20th Anniversary: Return to Hogwarts</em> reunion special! Join Andrew, Eric, Micah and Laura as they go \"chapter-by-chapter\" on the 100 minute show and discuss the highs and lows, cast members who were noticeably absent, and how the reunion special did or didn't meet their expectations. We also have a mail-bag show next week, so be sure to send us <a href=\"https://mugglecast.com/contact/\">YOUR thoughts on the special</a>!<br>\n<br>\n\n</div>\n<ul>\n<li>2022 started off with a brand new <a href=\"https://play.hbomax.com/page/urn:hbo:page:GYbzrRAvf-ZPCKQEAAAAX:type:feature\">Reunion Special</a>, looking back on the making of all 8 films and featuring the cast including Dan, Rupert and Emma</li>\n<li>Harry Potter Reunion Special First Impressions: did it satisfy our craving? Did it make us cry? (Spoiler alert: yes, it did.)</li>\n<li>Andrew found the beginning to be a little clunky, and the fact that Rupert, Dan and Emma were not physically all in the same space was ultimately a missed opportunity.</li>\n<li>Laura thinks the special would have benefitted from having a dedicated host to guide us through the many different interviews and set a more static tone for the special.</li>\n<li>Micah wanted to see more groups together and would have expected a higher focus on the first film, which is celebrating its 20th anniversary and not the others.</li>\n<li>Eric wanted more Ian Hart! They brought him in for a whole day and he only appears in the last 5 minutes of the show? Release the Snyder Cut of <em>Back to Hogwarts</em>, you cowards!</li>\n<li>We all appreciate getting to hear from all 4 directors who helmed the <em>Potter</em> films.</li>\n<li>Dan Radcliffe's chat with Chris Columbus and some archival footage of the young trio warmed all of our hearts, multiple times.</li>\n<li>Hearing Alfonso Cuarón discuss <em>Prisoner of Azkaban</em> changed Micah's mind on the film! Eric is not so cheaply bought... but admits that Cuarón clearly really cares and that his take on Harry's adolescence is valid.</li>\n<li>Dan Radcliffe and Gary Oldman's chat shows that they truly mean a lot to one another and is great to see.</li>\n<li>After seeing Mike Newell wrestle with the Phelps Twins and break some of his own ribs while doing so, everything we've ever wondered about why the <em>Goblet of Fire</em> movie is the way it is makes perfect sense.</li>\n<li>The trio talking teenage hormones reignites the spark of all of our ships, including Emma and Tom who CLEARLY HAVE SOMETHING GOING ON...</li>\n<li>...but perhaps not as much as Dan and Helena Bonham Carter! That steamy handwritten note, wowza...</li>\n<li>The hosts lament the exclusion of a Sirius/Bellatrix duel that was evidently filmed, and recount other surprising times during this special where an actor says something shocking which paints director choices in a questionable light.</li>\n<li>Evanna Lynch appears with an inspirational message for the outsiders in all of us.</li>\n<li>The cast discussing their on-screen kisses is very popcorn worthy, even if the kisses themselves weren't all so.</li>\n<li>The In Memoriam segment touches us all as we reflect on cast members who are no longer with us, and the nice things said about them in this special.</li>\n<li>RIP also to Millie the hamster. We never knew ye before!</li>\n<li>The special ends back at the beginning, with footage of the 11-year-old trio, and lots of emotional admissions from the actors about each other and the films' legacy.</li>\n<li>The hosts discuss JK Rowling's appearance in archived footage and what mystery still remains about her involvement in this special.</li>\n<li>Quizzitch: What is the name of Rupert Grint's child? <a href=\"https://mugglecast.com/quizzitch/\">Submit your answer</a>! </li>\n<li>Finally, Eric and Micah played Fandom Feud last week, with fellow members of HP Fandom to benefit trans-supportive charities. Check out the whole video of both games they played over on <a href=\"https://youtu.be/HE9WiMuVbsE\">YouTube</a>!</li>\n</ul>\n",
  "pubDate": "Mon, 03 Jan 2022 18:36:16 +0000",
  "guid": "tag:audioboom.com,2022-01-03:/posts/8006734",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}