{
  "id": "yt:video:RYwsqz6Q-N4",
  "yt:videoId": "RYwsqz6Q-N4",
  "yt:channelId": "UC5Jz6SBlu2Sv61kfssv4DOw",
  "title": "Compliant mechanisms with NO stiffness!?! – #VeritasiumContest",
  "link": "",
  "author": {
    "name": "The FACTs of Mechanical Design",
    "uri": "https://www.youtube.com/channel/UC5Jz6SBlu2Sv61kfssv4DOw"
  },
  "published": "2021-07-01T13:04:50+00:00",
  "updated": "2022-07-19T17:20:13+00:00",
  "media:group": {
    "media:title": "Compliant mechanisms with NO stiffness!?! – #VeritasiumContest",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "#VeritasiumContest\n\nI am posting this video in response to a contest announced by Veritasium challenging educators to explain a counter intuitive concept in one minute or less (https://www.veritasium.com/contest).\n\nSince the prize money is coming from a UCLA professor who lost a physics bet to Derek from Veritasium, this is my attempt as a fellow UCLA professor to redeem my university’s reputation.\n\nThis video explains how compliant mechanisms can use prestressed flexures to achieve zero stiffness at their resting position. This property is highly counter intuitive because compliant mechanisms deform by definition and one would think that deformations always produce resistance and thus stiffness. But they don’t if the principles of stiffness cancelation and static balancing are implemented!\n\nThe compliant mechanisms presented at the end of the video were designed by Reinier Kuppens (https://www.youtube.com/user/MrReinish) while he was visiting my lab at UCLA from Delft University. The designs are published in the journal, Extreme Mechanics at the following link:\n\nhttps://www.sciencedirect.com/science/article/pii/S235243162030290X\n \nApologies to my subscribers if they have already seen my lengthier videos about this concept. You can check them out on my channel “The FACTs of Mechanical Design” (www.youtube.com/TheFACTsofMechanicalDesign) at these links if you haven't seen them:\n\nhttps://www.youtube.com/watch?v=R_-KHQVmjMM&t=253s\nhttps://www.youtube.com/watch?v=CV-zewG3lBY&t=3s\n\nAlso if you are interested to learn more about compliant mechanisms, check out the compliant mechanism course videos on my channel, or see the following Veritasium video:\n\nhttps://www.youtube.com/watch?v=97t7Xj_iBv0&t=549s\n\nThe part files for these mechanisms can be downloaded from Thingiverse at:\nhttps://www.thingiverse.com/thefactsofmechanicaldesign/designs\n\nAcknowledge: This work would not have been possible without the help of Reinier Kuppens, Just Herder, and Miguel Bessa.\n\nDisclaimer:  Responsibility for the content of this video is my own. The University of California, Los Angeles is not involved with this channel nor does it endorse its content.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}