{
  "id": "https://bibleinoneyear.org/en/youth/127",
  "title": "Day 127: Twelve Ways to Be Useful to God",
  "description": "Psalm 57:7–11, Judges 6:6,13a,14–16a, John 5:19,30. ’Thankfully, God uses cracked pots! You do not need to be perfect for God to use you  We want our lives to count for something",
  "pubDate": "Fri, 07 May 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/127/?ignore",
  "itunes:duration": "13:02",
  "guid": "enyouth07052021-127",
  "length": 782.5,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 127: Twelve Ways to Be Useful to God",
  "itunes:subtitle": "Psalm 57:7–11, Judges 6:6,13a,14–16a, John 5:19,30. ’Thankfully, God uses cracked pots! You do not need to be perfect for God to use you  We want our lives to count for something",
  "itunes:summary": "A water-bearer in India had two large pots, both hung on the ends of a pole, which he carried across his neck. One of the pots had a crack in it while the other pot was perfect and always delivered a full portion of water. At the end of the long walk from the stream to the house, the cracked pot always arrived half full.\nThe poor cracked pot was ashamed of its own imperfection, and miserable that it was able to accomplish only half of what it had been made to do. After two years of what it perceived to be a bitter failure, it spoke to the water-bearer one day by the stream:\n‘I am ashamed of myself, and I want to apologise to you. I have been able to deliver only half my load because this crack in my side causes water to leak out all the way back to your house. Because of my flaws, you have to do all of this work, and you don’t get full value from your efforts.’\nThe bearer said to the pot, ‘Did you notice that there were flowers only on your side of the path, but not on the other pot’s side? That’s because I have always known about your flaw, and I planted flower seeds on your side of the path, and every day while we walk back, you’ve watered them. For two years I have been able to pick these beautiful flowers to decorate the table. Without you being just the way you are, there would not be this beauty to grace the house.’\nThankfully, God uses cracked pots! You do not need to be perfect for God to use you. We want our lives to count for something. If you want to be useful to God, here are twelve keys:",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 127
}