{
  "title": "Is technology killing empathy? With Sherry Turkle, PhD",
  "itunes:title": "Is technology killing empathy? With Sherry Turkle, PhD",
  "pubDate": "Wed, 04 May 2022 10:30:00 +0000",
  "guid": "af27713f-7fcf-44bf-96a9-0e7fdb8ff549",
  "link": "http://sopapa.libsyn.com/is-technology-killing-empathy-with-sherry-turkle-phd",
  "itunes:image": "",
  "description": "<p>Over the past couple of decades, our devices have become our constant companions. More and more, we live in a digital, virtual world. Dr. Sherry Turkle, MIT professor and founding director of the MIT Initiative on Technology and Self, discusses how digital communication has affected our ability to talk to each other, how conversation itself changed in the digital age, why she thinks social media is an “anti-empathy machine” and her advice on how to reclaim space for conversation in our lives.<br /> <br /> Links<br /> <br /> <a href=\"https://sherryturkle.mit.edu\">Sherry Turkle, PhD</a><br /> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Homepage</a><br /> <br /> Sponsor<br /> <br /> <a href=\"https://www.newporthealthcare.com\">Newport Healthcare</a></p>",
  "content:encoded": "<p>Over the past couple of decades, our devices have become our constant companions. More and more, we live in a digital, virtual world. Dr. Sherry Turkle, MIT professor and founding director of the MIT Initiative on Technology and Self, discusses how digital communication has affected our ability to talk to each other, how conversation itself changed in the digital age, why she thinks social media is an “anti-empathy machine” and her advice on how to reclaim space for conversation in our lives.  Links  <a href=\"https://sherryturkle.mit.edu\">Sherry Turkle, PhD</a> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Homepage</a>  Sponsor  <a href=\"https://www.newporthealthcare.com\">Newport Healthcare</a></p>",
  "enclosure": "",
  "itunes:duration": "43:18",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Over the past couple of decades, our devices have become our constant companions. More and more, we live in a digital, virtual world. Dr. Sherry Turkle, MIT professor and founding director of the MIT Initiative on Technology and Self, discusses how...",
  "itunes:episode": 189,
  "itunes:episodeType": "full"
}