{
  "title": "S14 Ep74: The Ghost Between Us",
  "link": "https://audioboom.com/posts/8098556",
  "itunes:episode": 74,
  "itunes:title": "The Ghost Between Us",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 7434,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS discovers The Ghost Between Us with guest Pete Nunweiler.<br>\n<br>\nOn June 1, 2018, Pete Nunweiler quit his corporate America job to publish the first book in his paranormal trilogy called \"The Ghost Between Us.\" <br>\n<br>\nAs a paranormal enthusiast, Pete decided to share some of his personal experiences in a fictional world.  The Ghost Between Us trilogy is now his personal best-selling series. Today he shares the true stories behind this series.<br>\n<br>\nGet his books here: <a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nVisit his site here: <a href=\"https://www.petenunweiler.com/\">https://www.petenunweiler.com/</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nCarnival Row is a one-hour fantasy drama series starring Orlando Bloom and Cara Delevingne . The series is set in a Victorian fantasy world filled with mythological immigrant creatures whose exotic homelands were invaded by the empires of man. Come together on August 30th to watch Carnival Row only on Amazon Prime Video this Labor Day Weekend!<br>\n<br>\nFeals naturally helps reduce stress, anxiety, pain, and sleeplessness.  Place a few drops of Feals under your tongue and feel the difference within minutes. Become a member today by going to <a href=\"http://Feals.com/DARKNESS\">Feals.com/DARKNESS</a> and you'll get 50% off your first order with free shipping<br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.",
  "itunes:summary": "BEYOND the DARKNESS discovers The Ghost Between Us with guest Pete Nunweiler.\n\nOn June 1, 2018, Pete Nunweiler quit his corporate America job to publish the first book in his paranormal trilogy called \"The Ghost Between Us.\" \n\nAs...",
  "pubDate": "Sun, 08 Sep 2019 08:00:00 +0000",
  "guid": "1c9a38d6-8bec-4c63-bc42-3a781982d5b8",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}