{
  "title": "On MOOCs and The Audacious",
  "link": "https://datasciencelab.wordpress.com/2013/12/17/on-moocs-and-the-audacious/",
  "comments": "https://datasciencelab.wordpress.com/2013/12/17/on-moocs-and-the-audacious/#respond",
  "dc:creator": "datasciencelab",
  "pubDate": "Tue, 17 Dec 2013 16:31:48 +0000",
  "category": [
    "Ressources",
    "coursera",
    "courses",
    "edX",
    "mooc",
    "udacity"
  ],
  "guid": "http://datasciencelab.wordpress.com/?p=358",
  "description": "As already discussed at The Data Science Lab, massive open online courses are shaking many concepts in the traditional higher-education landscape. The mere fact that thousands of students can now simultaneously attend graduate-level lectures all around the globe without physically putting a foot on campus might lead to the redefinition of the &#8220;college experience&#8221;. Thus [&#8230;]",
  "content:encoded": "<p>As <a href=\"https://datasciencelab.wordpress.com/2013/10/28/learning-machine-learning-online/\" title=\"Learning Machine Learning Online\">already discussed at The Data Science Lab</a>, massive open online courses are shaking many concepts in the traditional higher-education landscape. The mere fact that thousands of students can now simultaneously attend graduate-level lectures all around the globe without physically putting a foot on campus might lead to the redefinition of the &#8220;college experience&#8221;. </p>\n<p>Thus far, the courses offered by <a href=\"https://www.coursera.org/\">Coursera</a> and <a href=\"https://www.edx.org/\">edX</a> could be understood as an extension of otherwise regular university courses, simply made available to students outside the classroom by means of technology. The materials did somehow exist in a similar form prior to being offered online; transferring them to a MOOC-appropriate format certainly involves extra overhead work from the lecturer, but the structure of the syllabus essentially remains unchanged. </p>\n<p>But as <a href=\"http://www.forbes.com/sites/michaelhorn/2013/12/12/the-audacity-of-udacity/\">an article in Forbes reports</a>, an audacious player in the MOOC providers league, <a href=\"https://www.udacity.com/\">Udacity</a>, is set to disrupt the market with its offers of coaching for students as well as verified certification for their final projects. As Michael Horn bluntly puts it:</p>\n<blockquote><p>But the real disruption in U.S. higher education was never going to come from slapping traditional courses online for free. That is mostly glorified edutainment—not a bad thing for humanity by any means and potentially a useful upgrade over a traditional textbook, but not disruptive to the higher education sector writ large in and of itself. The real disruption in higher education was always going to come from a new system that looks quite difrom the current one, begins by serving nonconsumers of traditional higher education, and integrates with employer needs to help students make progress in their lives because of an understanding that employers are ultimately—like it or not—the end customers for higher education because they ultimately finance much of the system for students.</p></blockquote>\n<p>Browsing Udacity&#8217;s offering in the Data Science track, one finds interesting videos and catchy trailers. We can choose among <a href=\"https://www.udacity.com/course/ud359\">Introduction to Data Science</a>, <a href=\"https://www.udacity.com/course/ud032\">Data Wrangling with MongoDB</a>, <a href=\"https://www.udacity.com/course/ud617\">Introduction to Hadoop and MapReduce</a> and some other courses, priced at around 100$-150$/month for a duration of 1-2 months. </p>\n<p>I do not doubt that there is a market for Udacity&#8217;s offers, and I am sure that the quality of their mentoring and materials are worth the investment. However, let&#8217;s us not forget that there are other approaches to MOOCs, as <a href=\"http://www.kdnuggets.com/2013/04/caltech-abu-mostafa-mooc-learning-from-data-machine-learning.html\">this interview with Prof. Abu-Mostafa illustrates</a>. He makes a very interesting and profound point, with which we at The Data Science Lab thoroughly agree: </p>\n<blockquote><p>Stick to your guns. Don&#8217;t water down the course to increase the numbers. Make the course as interesting as possible WITHOUT compromising the rigor and the content. What matters is what the students actually learn and retain. This is real education not a video game or a popularity contest.</p></blockquote>\n<p>What is, in your opinion, the best way to organize MOOCs in hot topics, such as Data Science, that attract tons of attention from media and aspiring practitioners alike?</p>\n",
  "wfw:commentRss": "https://datasciencelab.wordpress.com/2013/12/17/on-moocs-and-the-audacious/feed/",
  "slash:comments": 0,
  "media:content": {
    "media:title": "datasciencelab"
  }
}