{
  "id": "yt:video:9fLUxRsMJC8",
  "yt:videoId": "9fLUxRsMJC8",
  "yt:channelId": "UCbu2SsF-Or3Rsn3NxqODImw",
  "title": "Infinity Ward Fixes Modern Warfare 2 Vault Edition Confusion | GameSpot News",
  "link": "",
  "author": {
    "name": "GameSpot",
    "uri": "https://www.youtube.com/channel/UCbu2SsF-Or3Rsn3NxqODImw"
  },
  "published": "2022-11-04T21:30:02+00:00",
  "updated": "2022-11-05T07:24:57+00:00",
  "media:group": {
    "media:title": "Infinity Ward Fixes Modern Warfare 2 Vault Edition Confusion | GameSpot News",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "MW2 Vault Edition players get a bonus, Marvel Snap will let you play with friends, and Final Fantasy XVI is almost finished.\n#Gaming @ModernWarfare2 #MarvelSnap #FFXVI \n\nDid you pick up the Modern Warfare Vault Edition? Good news! You’re getting 10 hours of double xp and double weapons xp tokens.\n\nInitially this offer was only available to purchasers of the Vault edition that picked up the game via one of the previous, recent Call of Duty titles: Modern Warfare 2019, Black Ops Cold War, or Vanguard.\n\nHowever, since almost no one purchases a game in that manner, the vast majority of people that picked up the Vault edition were not eligible for these bonuses, leading to confusion amongst many of the players that picked up the more expensive version of the game\n\n\"We understand there has been some confusion about an in-game store exclusive reward for the Vault Edition,\" reads an image Tweeted out by the official Call of Duty Twitter. “ Therefore, we've decided to reward all players that currently own or purchase any version of the MWII Vault Edition with 10 hours of double xp tokens and 10 hours of double weapon xp tokens. Current owners who have not already received the tokens should expect to see them in their account over the next 48 hours”\n\nThat means, even if you purchase the Vault Edition after this announcement was made via the means of your choosing, you’re still going to net yourself those double XP and double weapons XP tokens, which, yeah, you should get if you’re paying $100 for this game.\n\nNow, if only there was double XP in Marvel Snap, the new hit mobile card game from former Hearthstone devs, and my personal latest obsession.\n\nIf you’ve been playing Marvel Snap, and you’ve wanted to absolutely wipe the floor with your friends that are also just as addicted, you won’t have to wait long. An update that is coming to the game before the end of the year will allow you to do just that.\n\nAs reported by The Washington Post, a new Battle mode will be coming to Marvel Snap before the end of 2022, and will allow players to challenge specific people, like friends, as opposed to using the game's current matchmaking system, but matches will work differently to the regular mode already in the game.\n\nIn the current mode, players play for ranked points, with the Snap mechanic effectively serving as a way to double down on the amount of ranked points on the line. As it wouldn't exactly be fair to bet ranked points on matches between friends, Battle mode will instead introduce a HP system. \n\nEach player will have 10 HP, with the number of points on the line for a given match instead affecting the losing player's HP pool as opposed to rank. Battle mode matches will consist of multiple rounds, and the first player to lose all their HP will lose the match.\n\nMarvel Snap is currently the 5th most popular free-to-play game on the App Store, but can also be played via Steam. If you haven’t checked it out yet, I implore you do, unless you have responsibilities in your life you absolutely cannot neglect.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}