{
  "title": "Cheating in sports vs. cheating in journalism vs. cheating in science",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/17/cheating-in-sports-vs-cheating-in-journalism-vs-cheating-in-science/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/17/cheating-in-sports-vs-cheating-in-journalism-vs-cheating-in-science/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Mon, 17 Oct 2022 13:27:01 +0000",
  "category": [
    "Miscellaneous Science",
    "Sociology",
    "Sports",
    "Zombies"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=48066",
  "description": "Sports cheating has been in the news lately. Nothing about the Astros, but the chess-cheating scandal that people keep talking about&#8212;or, at least, people keep sending me emails asking me to blog about it&#8212;and the cheating scandals in poker and &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/17/cheating-in-sports-vs-cheating-in-journalism-vs-cheating-in-science/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>Sports cheating has been in the news lately.  Nothing about the Astros, but the chess-cheating scandal that people <a href=\"https://defector.com/hans-niemann-remains-defiant/\">keep talking about</a>&#8212;or, at least, people keep sending me emails asking me to blog about it&#8212;and the cheating scandals in <a href=\"https://defector.com/historically-strange-poker-hand-leads-to-dramatic-cheating-allegation/\">poker</a> and <a href=\"https://defector.com/pro-fishing-has-its-own-cheating-scandal-involving-weights-in-prize-winning-fish/\">fishing</a>.  All of this, though, is nothing compared to the juiced elephant in the room:  the drug-assisted home run totals of 1998-2001, which kept coming up during the past few months as Aaron Judge approached and then eventually reached the record-breaking total of 62 home runs during a season.</p>\n<p>On this blog we haven&#8217;t talked much about cheating in sports (there was <a href=\"https://statmodeling.stat.columbia.edu/2020/12/24/dream-investigation-results-official-report-by-the-minecraft-speedrunning-team/\">this post</a>, though, and also something a few years back about one of those runners who wasn&#8217;t really finishing the races), but we&#8217;ve occasionally talked about cheating in journalism (for example <a href=\"https://statmodeling.stat.columbia.edu/2019/09/15/boston-globe-columnist-suspended-investigation-marathon-bombing-stories-dont-add/\">here</a>, <a href=\"https://statmodeling.stat.columbia.edu/2016/10/17/should/\">here</a>, <a href=\"https://statmodeling.stat.columbia.edu/2013/11/12/plaig-3/\">here</a>, and <a href=\"https://statmodeling.stat.columbia.edu/2015/08/03/the-plagiarist-next-door-strikes-back-different-standards-of-plagiarism-in-different-communities/\">here</a>&#8212;hey, those last two are about cheating in journalism about chess!), and we&#8217;ve talked lots and lots about cheating in science.</p>\n<p>So this got me thinking:  What are the differences between cheating in sports, journalism, and science?</p>\n<p><strong>1.  The biggest difference that I see is that in sports, when you cheat, you&#8217;re actually doing what you claim to do, you&#8217;re just doing it using an unauthorized method.  With cheating in journalism and science, typically you&#8217;re not doing what you claimed.</strong></p>\n<p>Let me put it this way:  Barry Bonds may have juiced, but he really did hit 7 zillion home runs.  Lance Armstrong doped, but he really did pedal around France faster than anyone else.  Jose Altuve really did hit the ball out of the park.  Stockfish-aided or not, that dude really did checkmate the other dude&#8217;s king.  Etc.  The only cases I can think of, where the cheaters didn&#8217;t actually do what they claimed to do, are the Minecraft guy, Rosie Ruiz, and those guys who did a &#8220;Mark Twain&#8221; on their fish.  Usually, what sports cheaters do is use unapproved methods to achieve real ends.</p>\n<p>But when journalism cheaters cheat, the usual way they do it is by making stuff up.  That is, they put things in the newspaper that didn&#8217;t really happen.  The problem with Stephen Glass or Janet Cooke or Jonah Lehrer is not that they achieved drug-enhanced scoops or even that they broke some laws in order to break some stories.  No, the problem was that they reported things that weren&#8217;t true.  I&#8217;m not saying that journalism cheats are worse than sports cheats, just that it&#8217;s a different thing.  Sometimes cheating writers cheat by copying others&#8217; work without attribution, and that alone doesn&#8217;t necessarily lead to falsehoods getting published, but it often does, which makes sense:  once you start copying without attribution, it becomes harder for readers to <a href=\"http://www.stat.columbia.edu/~gelman/research/published/GelmanBasbollAmericanScientist.pdf\">track down your sources</a> and find your errors, which in turn makes it easier to be sloppy and reduces the incentives for accuracy.</p>\n<p>When scientists cheat, sometimes it&#8217;s by just making things up, or presenting claims with no empirical support&#8212;for example, there&#8217;s no evidence that the Irrationality guy ever had that <a href=\"https://statmodeling.stat.columbia.edu/2022/01/06/shreddergate-and-an-idea-for-a-museum-of-scholarly-misconduct/\">custom-made shredder</a>, or that the Pizzagate guy ever really ran a &#8220;masterpiece&#8221; of an experiment with a <a href=\"https://statmodeling.stat.columbia.edu/2019/08/20/did-that-bottomless-soup-bowl-experiment-ever-happen/\">bottomless soup bowl</a> or had people lift an 80-pound rock, or that Mary Rosh ever did that survey.  Other times they just say things that aren&#8217;t true, for example describing a 3-day study as <a href=\"https://statmodeling.stat.columbia.edu/2018/04/06/important-distinction-truth-evidence/\">&#8220;long-term&#8221;</a>.  In that latter case you might say that the scientist in question is just an idiot, not a cheater&#8212;but, ultimately, I do think it&#8217;s a form of cheating to publish a scientific paper with a title that doesn&#8217;t describe its contents.</p>\n<p>But I think the main why scientists cheat is by being loose enough with their reasoning that they can make strong claims that aren&#8217;t supported by the data.  Is this &#8220;cheating,&#8221; exactly?  I&#8217;m not sure.  Take something like that ESP guy or the beauty-and-sex-ratio guy who manage to find statistical methods that give them the answers they want.  At some level, the boundary between incompetence and cheating doesn&#8217;t really matter; recall <a href=\"https://statmodeling.stat.columbia.edu/2009/05/24/handy_statistic/\">Clarke&#8217;s Law</a>.</p>\n<p>The real point here, though, is that, whatever you want to call it, the problem with bad science is that it comes up with false or unsupported claims.  To put it another way:  it&#8217;s not that Mark Hauser or whoever is taking some drugs that allow him to make a discovery that nobody else could make; the problem is that he&#8217;s claiming something&#8217;s a discovery but it isn&#8217;t.  To put it yet another way:  there is no perpetual motion machine.</p>\n<p>The scientific analogy to sports cheating would be something like . . . Scientist B breaks into Scientist A&#8217;s lab, steals his compounds, and uses them to make a big discovery.  Or, Scientist X cuts corners by using some forbidden technique, for example violating some rule regarding safe disposal of chemical waste, and this allows him to work faster and make some discovery.  But I don&#8217;t get a sense that this happens much, or at least I don&#8217;t really hear about it.  There was the Robert Gallo story, but even there the outcome was not a new discovery, it was just a matter of credit.</p>\n<p>And the journalistic analogy to sports cheating would be something like that hacked phone scandal in Britain a few years back . . . OK, I guess that does happen sometimes.  But my guess is that the kinds of journalists who&#8217;d hack phones are also the kind of journalists who&#8217;d make stuff up or suppress key parts of a story or otherwise manipulate evidence in a way to mislead.  In which case, again, they can end up publishing something that didn&#8217;t happen, or polluting the <a href=\"https://statmodeling.stat.columbia.edu/2022/01/07/pnas-gigo-qrp-wtf-approaching-the-platonic-ideal-of-junk-science/\">scientific</a> and <a href=\"https://statmodeling.stat.columbia.edu/2019/08/15/replication-police-methodological-terrorism-stasi-nudge-shoot-the-messenger-wtf/\">popular</a> literature.</p>\n<p><strong>2.  Another difference is that sports have a more clearly-defined goal than journalism or science.</strong>  An extreme example is bicycle racing:  if the top cyclists are doping and you want to compete on their level, then you have to dope also; there&#8217;s simply no other option.  But in journalism, no matter how successful Mike Barnicle was, other journalists didn&#8217;t have to fabricate to keep up with him.  There are enough true stories to report, that honest journalists can compete.  Yes, restricting yourself to the truth can put you at a disadvantage, but it doesn&#8217;t crowd you out entirely.  Similarly, if you&#8217;re a social scientist who&#8217;s not willing to fabricate surveys or report hyped-up conclusions based on forking paths, yes, your job is a bit harder, but you can still survive in the publication jungle.  There are enough paths to success that cheating is not a necessity, even if it&#8217;s a viable option.</p>\n<p><strong>3.  The main similarity I see among misbehavior in sports, journalism, and science is that the boundary between cheating and legitimate behavior is blurry.</strong>  When &#8220;everybody does it,&#8221; is it cheating?  With science there&#8217;s also the unclear distinction between cheating and simple incompetence&#8212;with the twist that incompetence at scientific reasoning could represent a sort of super-competence at scientific self-promotion.  Only a fool would say that the replication rate in psychology is &#8220;<a href=\"https://statmodeling.stat.columbia.edu/2016/03/09/bruised-and-battered-i-couldnt-tell-what-i-felt-i-was-ungeneralizable-to-myself/\">statistically indistinguishable from 100%</a>&#8220;&#8212;but being that sort of fool can be a step toward success in our Ted/Freakonomics/NPR media environment.  You&#8217;d think that professional athletes would be more aware of what drugs they put in their bodies than scientists would be aware of what numbers they put into their t-tests, but sports figures have sometimes claimed that they took banned drugs without their knowledge.  The point is that a lot is happening at once, and there are people who will do what it takes to win.</p>\n<p><strong>4.</strong>  Finally, it can be entertaining to talk about cheating in science, but <a href=\"https://statmodeling.stat.columbia.edu/2022/06/06/should-we-spend-so-much-time-talking-about-cheaters-and-fraudsters/\">as I&#8217;ve said before</a>, I think the much bigger problem is scientists who are not trying to cheat but are just using bad methods with noisy data. Indeed, the focus on cheaters can let incompetent but sincere scientists off the hook. Recall our discussion from a few years ago, The flashy crooks get the headlines, but the bigger problem is everyday routine bad science done by non-crooks.  <a href=\"https://statmodeling.stat.columbia.edu/2020/07/29/the-crooks-get-the-headlines-but-the-real-problem-is-bad-science-done-by-non-crooks/\">The flashy crooks get the headlines, but the bigger problem is everyday routine bad science done by non-crooks.</a>  Similarly, with journalism, I&#8217;d say the bigger problem is not the fabricators so much as the everyday corruption of slanted journalism, and <a href=\"https://statmodeling.stat.columbia.edu/2022/05/22/what-happen-to-that-los-angeles-tunnel-that-axios-was-saying-was-coming-soon-in-2018/\">public relations presented in journalistic form</a>.  To me, the biggest concern with journalistic cheating is not so much the cases of fraud as much as when the establishment closes ranks to <a href=\"https://statmodeling.stat.columbia.edu/2014/11/22/blogs-twitter/\">defend</a> the fraudster, just as in academia there&#8217;s no real mechanism to do anything about bad science.</p>\n<p>Cheating in sports feels different, maybe in part because a sport is <em>defined</em> by its rules in a way that we would not say about journalism or science.</p>\n<p><strong>P.S.</strong>  After posting the above, I got to thinking about cheating in business, politics, and war, which seem to me to have a different flavor than cheating in sports, journalism, or science.  I have personal experience in sports, journalism, and science, but little to no experience in business, politics, and war.  So I&#8217;m just speculating, but here goes:<br />\nTo me, what&#8217;s characteristic about cheating in business, politics, and war is that some flexible line is pushed to the breaking point.  For example, losing candidates will often try to sow doubt about the legitimacy of an election, but they rarely take it to the next level and get on the phone with election officials and demand they add votes to their total.  Similarly with business cheating such as creative accounting, dumping of waste, etc.:  it&#8217;s standard practice to work at the edge of what&#8217;s acceptable, but cheaters such as the Theranos gang go beyond hype to flat-out lying.  Same thing for war crimes:  there&#8217;s no sharp line, and cheating or violation arises when armies go far beyond what is currently considered standard behavior.  This all seems different than cheating in sports, journalism, or science, all of which are more clearly defined relative to objective truth.</p>\n<p>I think there&#8217;s more to be said on all this.</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/17/cheating-in-sports-vs-cheating-in-journalism-vs-cheating-in-science/feed/",
  "slash:comments": 30
}