{
  "title": "Why Did They Run From Ghosts?  Best Of RGSO",
  "link": "https://audioboom.com/posts/8114230",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1852,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>What did a child experience that mad them run like the wind to get home?<br>\nHere is a preview of the story.<br>\n“My heart stops and I turn white it was probably only a second or two, but it felt like an hour tile I turned and ran home as fast as I could. Things were somewhat normal for a while. I was at my friend's house, and his stepdad was taking me home, when he turned down my street he said \"hey I know this street, when I was about your age, I was in a band with a buddy that lived on the end of the street. I haven't been over here since.... well ...since his sister went missing.\" My stomach sank, the only thing I could think is this is confirmation. I get dropped off and run inside and lose my mind. Am I crazy? Am I really dreaming of a cold case of a neighbor girl killed a decade plus ago and buried in the orange Grove near my house? So, I decided to just go on with life and just live with it because who can I tell, who's going to listen. If someone does dig there and a body is turns up what then? Oh, hey Mr Policeman I just randomly dug this one spot in this abandoned orange Grove and found a body. Suspicious. I have pretty blue eyes I'm not fit for prison, and I know it. But back on track with the story a couple weeks later that same buddy is over, and I tell him everything, so he comes up with the great idea of a Ouija board and makes one on notebook paper and use a guitar pick as the finger thing, turned off the lights light a candle.”<br>\n<br>\n\n</div>\n<div>To hear more real ghost stories, become a supporter of our show and get every episode, including our weekly bonus episodes at <a href=\"http://www.ghostpodcast.com\">http://www.ghostpodcast.com</a> or <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>Follow Tony:<br>\nInstagram: <a href=\"http://HTTP://www.instagram.com/tonybrueski\">HTTP://www.instagram.com/tonybrueski</a><br>\nTikToc: <a href=\"https://www.tiktok.com/@tonybrueski\">https://www.tiktok.com/@tonybrueski</a><br>\nFacebook: <a href=\"https://www.facebook.com/tony.brueski\">https://www.facebook.com/tony.brueski</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Sun, 03 Jul 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-07-02:/posts/8114230",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}