{
  "title": "Chinese Whispers: what happens when China's population shrinks?",
  "link": "https://audioboom.com/posts/8035281",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2741,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>China’s population is ageing. It’s estimated that a quarter of Chinese people will be elderly within three decades. The relaxing of its one child policy – first to two children in 2016 and then to three last year – hasn’t stimulated fertility rate, which is still stagnant at 1.7 births per woman. In November last year, nappy producers supposedly pivoted their marketing towards elderly clients over parents of babies.<br>\n<br>\n\n</div>\n<div>Demographers and economists warn about the problems that an ageing – and eventually shrinking – population will cause, in China and elsewhere. On this episode, I speak to the demographer Wang Feng, Professor of Sociology at University of California, Irvine, about what awaits China. For Professor Wang, care of the elderly will soon become an issue, with more than 365 million over 65s expected by 2050. The Chinese welfare state is minimal (ironic given its socialist pretensions), something of a ‘postcode lottery’, I put to Professor Wang. He says that ‘China has already missed the time window for establishing an equitable national social security system’ – it has already become too expensive, too fast. <br>\n<br>\n\n</div>\n<div>We also discuss the one child policy at length – its logic at the time, whether Communist leaders foresaw the problems it would cause for their successors and, fascinatingly, whether there was any opposition within the Chinese Communist Party to the policy (the answer is yes ­– and if you caught my episode on the legacy of Deng Xiaoping, you will not be surprised to learn that the resistance was led by Hu Yaobang and Zhao Ziyang). Professor Wang points out that one of the reasons why the policy took so long to go even as China liberalised relatively in the 1990s and 2000s, under the helm of Jiang Zemin and Hu Jintao:<br>\n<br>\n\n</div>\n<blockquote>‘They were people who grew up, like myself, at the end of the Cultural Revolution. Their knowledge of population was all learned from the time when China implemented the one child policy, when there was so much propaganda about how population would be the root of all problems for China. I think that generation of leaders were deeply intoxicated by these teachings’</blockquote><div>In a way, there’s poetic justice for a government who thought that, in Professor Wang’s words, ‘you can just plan [births] and constrain them as you would grow trees or wheat’. Today’s China, regardless of the loosening of the one child policy (to two in 2016; and three last year, which I wrote about at the time), is just not having babies. For the Professor, there’s a fundamental truth: ‘The ageing society is not something that China, or any other country, can reverse’. The crux lies in how to adapt society to be better prepared – fixing the welfare state, the healthcare system, and maturing the financial system so the ageing population can invest for retirement.<br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 22 Feb 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-02-21:/posts/8035281",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}