{
  "id": "yt:video:-GjOKU3t2ng",
  "yt:videoId": "-GjOKU3t2ng",
  "yt:channelId": "UCRRr_xrOm66qaigIbwFLvbQ",
  "title": "The Dark Secret Behind Taylor Swift's Private Jet",
  "link": "",
  "author": {
    "name": "Simon Clark",
    "uri": "https://www.youtube.com/channel/UCRRr_xrOm66qaigIbwFLvbQ"
  },
  "published": "2022-08-12T10:00:20+00:00",
  "updated": "2022-08-19T20:30:53+00:00",
  "media:group": {
    "media:title": "The Dark Secret Behind Taylor Swift's Private Jet",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Get with the times, Taylor. Or better yet, get with the future of aviation on CuriosityStream https://www.curiositystream.com/simonclark\n\nYou can support the channel and help me make more videos like this one by becoming a patron at http://www.patreon.com/simonoxfphys\n\nThis is a silly little video talking about why Taylor Swift using her private jet isn't the end of the world, but the fact that we're talking about it is a little worrying. Our individual actions on climate are not meaningful, but the system they take place in is - and that's what we should be discussing. The fact that we think of our carbon footprints has a quite interesting history that makes me break out the tin foil.\n\nReferences in this video:\n1. https://weareyard.com/insights/worst-celebrity-private-jet-co2-emission-offenders\n2. https://www.rollingstone.com/music/music-news/kylies-17-minute-flight-has-nothing-on-the-170-trips-taylor-swifts-private-jets-took-this-year-1390083/\n3. https://ec.europa.eu/commission/presscorner/detail/en/MEMO_06_218\n4. https://ourworldindata.org/grapher/annual-co-emissions-by-region?time=1990..latest\n5.https://www.eea.europa.eu/themes/climate/eu-greenhouse-gas-inventory\n6. https://www.bbc.co.uk/news/uk-politics-62221444\n7. https://www.nature.com/articles/d41586-021-02847-2\n\nCheck out my website! https://www.simonoxfphys.com/\n\n---------- II ----------\n\nMy twitter - http://www.twitter.com/simonoxfphys\nMy facebook - http://www.facebook.com/youtubesimon\nMy insta - http://www.instagram.com/simonoxfphys\n\n---------- II ----------\n\nMusic by Epidemic Sound: http://epidemicsound.com\nSome stock footage courtesy of Getty\n\nVideo essay about Taylor Swift and her private jet, how many flights did Taylor Swift take this year, Taylor Swift caused climate change. Why is everyone talking about Taylor Swift and her private jet? How did Swifties react? \n\nHuge thanks to my supporters on Patreon: Calum Storey, Mattophobia, Riz, Jan Krüger, The Confusled, Wessel van der Heijden, Conor Safbom, William Pettersson, Paul H and Linda L, InDefenseOfToucans, Savannah, Jimmy Lee, Simon Stelling, Gabriele Siino, Bjorn Bakker, Ieuan Williams, Candace H, Tom Malcolm, Marcus Bosshard, Leonard Neamtu, Shab Kumar, Brady Johnston, Liat Khitman, Jesper Norsted, Kent & Krista Halloran, Rapssack, Kevin O'Connor, Timo Kerremans, Ashley Wilkins, Michael Parmenter, Samuel Baumgartner, Dan Sherman, ST0RMW1NG 1, Adrian Sand, Morten Engsvang, Cio Cio San, Farsight101, K.L, poundedjam, fourthdwarf, Daan Sneep, Felix Freiberger, Chris Field, Robert Connell, ChemMentat, Kolbrandr, , Sebastain Graf, Dan Nelson, Shane O'Brien, Alex, Fujia Li, Will Tolley, Cody VanZandt, Jesper Koed, Jonathan Craske, Albrecht Striffler, Igor Francetic, Jack Troup, SexyCaveman , Sean Richards, Kedar , Omar Miranda, Alastair Fortune, bitreign33 , Mat Allen, Anne Smith, Rafaela Corrêa Pereira, Colin J. Brown, Princess Andromeda, Mach_D, Thusto , Andy Hartley, Lachlan Woods, Dan Hanvey, Simon Donkers, Kodzo , James Bridges, Liam , Andrea De Mezzo, Wendover Productions, Kendra Johnson.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}