{
  "id": "yt:video:CcdSeqqMR5M",
  "yt:videoId": "CcdSeqqMR5M",
  "yt:channelId": "UCX6b17PVsYBQ0ip5gyeme-Q",
  "title": "How Society Affects Your Health: Crash Course Public Health #4",
  "link": "",
  "author": {
    "name": "CrashCourse",
    "uri": "https://www.youtube.com/channel/UCX6b17PVsYBQ0ip5gyeme-Q"
  },
  "published": "2022-08-25T17:00:13+00:00",
  "updated": "2022-09-01T08:21:15+00:00",
  "media:group": {
    "media:title": "How Society Affects Your Health: Crash Course Public Health #4",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Society does a lot to improve our health, from sanitation to healthy foods. But society can have negative impacts on our health as well, and whether or not we get the positive impacts or the negative ones, can often come down to social and economic standing. In this episode of Crash Course Public Health, we’re going to take a look at some of the basic societal elements that affect our health, and why they are often tied to economic inequality. \n\nCheck out our shared playlist with APHA: https://www.youtube.com/playlist?list=PLDjqc55aK3kywF2dd97_Jh5iP0d2ARhdo \n\nVanessa’s channel: https://www.youtube.com/braincraft \n\nTranscript: https://docs.google.com/document/d/1sewRwMAgUw1Akns5h5ipqDgWLwYkvUArJ9WvgmVGOqw/edit?usp=sharing\nSources: https://docs.google.com/document/d/1OHJiQ1njj5jWJC1YLDBzQgKC1QfnVgqJbbpK6qs7ekA/edit?usp=sharing\n\nChapters:\nIntroduction: Society and Your Health 00:00\nDefining Society 01:42\nFood Inequality 03:12\nHousing Inequality 04:54\nHealthcare Inequality 05:31\nIncome Inequality 07:43\nSocioeconomic Status 10:04\nReview & Credits 12:14\n\n***\nWatch our videos and review your learning with the Crash Course App! \nDownload here for Apple Devices: https://apple.co/3d4eyZo\nDownload here for Android Devices: https://bit.ly/2SrDulJ\n\nCrash Course is on Patreon! You can support us directly by signing up at http://www.patreon.com/crashcourse\n\nThanks to the following patrons for their generous monthly contributions that help keep Crash Course free for everyone forever:\nKatie, Hilary Sturges, Austin Zielman, Tori Thomas, Justin Snyder, daniel blankstein, Hasan Jamal, DL Singfield, Amelia Ryczek, Ken Davidian, Stephen Akuffo, Toni Miles, Steve Segreto, Michael M. Varughese, Kyle & Katherine Callahan, Laurel Stevens, Michael Wang, Stacey Gillespie (Stacey J), Burt Humburg, Allyson Martin, Aziz Y, Shanta, DAVID MORTON HUDSON, Perry Joyce, Scott Harrison, Mark & Susan Billian, Junrong Eric Zhu, Alan Bridgeman, Rachel Creager, Breanna Bosso, Matt Curls, Tim Kwist, Jonathan Zbikowski, Jennifer Killen, Sarah & Nathan Catchings, team dorsey, Trevin Beattie, Divonne Holmes à Court, Eric Koslow, Jennifer Dineen, Indika Siriwardena, Jason Rostoker, Shawn Arnold, Siobhán, Ken Penttinen, Nathan Taylor, Les Aker, William McGraw, ClareG, Rizwan Kassim, Constance Urist, Alex Hackman, Jirat, Pineapples of Solidarity, Katie Dean, NileMatotle, Wai Jack Sin, Ian Dundore, Justin, Mark, Caleb Weeks\n__\n\nWant to find Crash Course elsewhere on the internet?\nFacebook - http://www.facebook.com/YouTubeCrashCourse\nTwitter - http://www.twitter.com/TheCrashCourse\nInstagram - https://www.instagram.com/thecrashcourse/\n\nCC Kids: http://www.youtube.com/crashcoursekids",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}