{
  "title": "S14 Ep17: Supernatural News/Parashare: Episode 202",
  "link": "https://audioboom.com/posts/8098613",
  "itunes:episode": 17,
  "itunes:title": "Supernatural News/Parashare: Episode 202",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5221,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS laughs their way thru another week of Supernatural News & Parashare!<br>\n<br>\nA.I. wants to get Tim arrested, A Lake Monster stalks, A Chupacabra Massacre, Zombie Marriage & More. Plus YOUR stories in ParaShare.<br>\n<br>\nWarning:  Some adult language appears in this episode!!!<br>\n<br>\nRemember to call and share your stories for future episodes 651-300-4977<br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nTrying to solve your own life’s mysteries?  Psychic Source is a 24/7 phone, online chat and video psychic service.  Your first three minutes are free plus it’s only .83 cents a minute for a reading up to 30-minutes. Just mention promo code DARKNESS when you call  1-800-355-9214 or sign up online at psychic source dot com.<br>\n<br>\nDigestive troubles? \tWeight gain?\tLow energy?\tAchy Joints?<br>\nIf you’ve been struggling with any of these, Dr. Steven Gundry says you’re not alone<br>\nAnd he knows the real cause! Watch the free video at <a href=\"http://totalrestore2.com\">totalrestore2.com</a> to find out more! <br>\n<br>\nHas life piled on the anxiety to an overwhelming crescendo? Sunday Scaries can give you relief! Sunday Scaries are CBD Gummies custom formulated with a 10mg of blend of broad spectrum and isolate CBD as well as vitamins B12 and D3 for mood boosters. They are made with natural ingredients and are free of gluten, dairy, yeast, egg, soy and peanuts. Get 10 percent off and free shipping  at <a href=\"http://sundayscaries.com\">sundayscaries.com</a> and use the code word DARKNESS .",
  "itunes:summary": "BEYOND the DARKNESS laughs their way thru another week of Supernatural News & Parashare!\n\nA.I. wants to get Tim arrested, A Lake Monster stalks, A Chupacabra Massacre, Zombie Marriage & More. Plus YOUR stories in ParaShare.\n\nWarning:...",
  "pubDate": "Sat, 02 Mar 2019 10:00:00 +0000",
  "guid": "67604e2e-ff28-4511-94b8-69148614e87e",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}