{
  "title": "TU95: Oxytocin &#038; Dogs (&#038; Pets in General) as Attachment Figures",
  "link": "https://therapistuncensored.com/episodes/tu95-oxytocin-dogs-pets-in-general-as-attachment-figures/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu95-oxytocin-dogs-pets-in-general-as-attachment-figures",
  "pubDate": "Wed, 01 May 2019 06:39:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7070",
  "description": "Oxytocin and dogs!\nOur pet relationships provide a trust and bonding boost, and is the natural love drug our bodies make at key relational moments such as child-birth, nursing, orgasm and falling in love.* In this episode we discuss how to create this moral molecule without even needing complicated human relationships by connecting mutually to our companion pets. What’s not to love about that?\n\nThe science now is clear – this inter-species relationship is mutually beneficial and potentially life-changing for both of you. Lower cortisol, higher oxytocin, more trust and connection – ba bing!\n\nMost of us can relate to having a beloved pet that has been a significant part of our lives. We love them, and the cool thing is, they love us back unconditionally it seems, without regard to our moral failings. In fact, there is now crazy hard science research to back up the power of this connection, particularly regarding dogs.\n\nIn our last episode, we told you that we’d be talking more about the love drug, oxytocin, and how we can actively induce the release of this hormone in our bodies in order to promote our favorite subject, building security. In this one we get real and walk the walk of vulnerability.\n So, what do pets, specifically dogs, have to do with oxytocin and building security?\nWell, security happens through safe connection, and connection both induces the release of oxytocin and is created by it’s presence. This cascade creates a feeling of physiological safety and openness and warmth in our bodies, which helps us to bond and build security.\n\nBelieve it or not, we can consciously manipulate our body’s release of oxytocin through the bond we create with our beloved pets. And if you’ve been following the podcast, you know this ties into the previous 2 episodes on Polyvagal Theory and our autonomic nervous system.\n\nIn this episode, join Ann and Sue as they talk about what this experience looks like in real life and how to cultivate the love-drug cross-species. Also hear Sue’s incredibly powerful story of tragic loss, and renewed hope, all related to pets.\n\n*Of course we are simplifying a bit – nothing is all good. Oxytocin isn’t always a love-drug, it can cause aggression or feelings of loneliness. For example if the wolves had made eye-contact as the companion dogs did (the wolves made much less eye contact and had no increase in the hormone), it would probably have spiked aggression rather than bonding (an urge to protect their bonded pack rather than attach to the alien human), but we are focusing here on the most major findings of the neuropeptide.\n\nCooper comforting Sue… I know so MANY of you have pets as primaries, it’s a real relationship (scientifically and intuitively) that truly comforts and heals.\nEpisode 95 show notes:\nOxytocin – Ann and Sue’s favorite neuropeptide, AKA the cuddle drug, the love drug, the moral molecule.\n\nResearch shows that the bond we have with our pets is reciprocal. The pleasure center of the brain lights up in us and in our animal partners. Cortisol levels decrease, and oxytocin levels increase in humans and animals when we have high eye contact. The most significant increase (up to almost 300%) is seen with dogs and varies based on breed. It’s an extra boost if we catch our dogs looking at us first.\n\nDon’t be embarrassed about your significant other with 4 legs, or less. Hear about bonding with fish, monkey’s picking and humans grooming behavior, and what lice has to do with it all.\n\nDogs and any other beloved pet can be serious attachment figure in our lives, helping us to build a sense of safety and security in the world. It can be a very powerful relationship that is just as strong, and sometimes stronger, than human connections. Granted some people have pets as just animals, an object to guard their home or to rescue or to get dates, but that is totally different from the potential real attachment relationships that in the right circumstances can enhance the li...",
  "enclosure": "",
  "itunes:subtitle": "Oxytocin and dogs! Our pet relationships provide a trust and bonding boost, and is the natural love drug our bodies make at key relational moments such as child-birth, nursing, orgasm and falling in love.* In this episode we discuss how to create this...",
  "itunes:summary": "Want a totally free, no-hangover naturally produced cuddle-drug? <br />\nOxytocin provides a boost of the best bonding drug possible and is the natural love drug our bodies make at key relational moments such as child-birth, nursing, orgasm and falling in love.  In this episode we discuss how to create this moral molecule without even needing complicated human relationships by connecting mutually to our companion pets.  What&apos;s not to love about that?",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "33:19"
}