{
  "id": "https://bibleinoneyear.org/en/youth/148",
  "title": "Day 148: How to Respond to Conflict",
  "description": "Proverbs 13:10,12,19, 1 Samuel 22:17, 23:14–18, John 18:3–24.  However, there are times when these intensify and we seem to be coming under attack Martin Luther King said that the ultimate measure of a person is not where they stand in ‘moments of convenience’, but where they stand in ‘moments of challenge, moments of great crisis and controversy’",
  "pubDate": "Fri, 28 May 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/148/?ignore",
  "itunes:duration": "12:48",
  "guid": "enyouth28052021-148",
  "length": 768.21,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 148: How to Respond to Conflict",
  "itunes:subtitle": "Proverbs 13:10,12,19, 1 Samuel 22:17, 23:14–18, John 18:3–24.  However, there are times when these intensify and we seem to be coming under attack Martin Luther King said that the ultimate measure of a person is not where they stand in ‘moments of convenience’, but where they stand in ‘moments of challenge, moments of great crisis and controversy’",
  "itunes:summary": "A springbok is a gazelle-like antelope. Normally they are very alert to predators. However, I remember watching a BBC wildlife programme that filmed two springboks fighting each other in the Kalahari Desert. As they became absorbed in the fight, they did not notice the lion prowling around them, waiting for his opportunity to attack.\nAs I watched, it struck me as a warning especially for the church. When, in the church, we fight one another, we become very vulnerable to attack. ‘The devil prowls around like a roaring lion looking for someone to devour’ (1 Peter 5:8).\nWhen God calls you to follow him, he does not call you to a life of ease. Life on earth involves many battles, in all of which God promises you victory through Jesus Christ. There is never going to be a moment in your earthly life when everything is perfect. There are always going to be challenges, difficulties and problems to solve. However, there are times when these intensify and we seem to be coming under attack.\nMartin Luther King said that the ultimate measure of a person is not where they stand in ‘moments of convenience’, but where they stand in ‘moments of challenge, moments of great crisis and controversy’.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 148
}