{
  "title": "Accelerating climate action at Google and beyond",
  "link": "https://blog.google/outreach-initiatives/sustainability/cop27-google-climate-action/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"2jq1m\">Next week at <a href=\"https://cop27.eg/#/\">COP27</a>, global leaders will gather in Egypt to build momentum for climate action. Climate change is one of humanity’s most urgent challenges, and this decade is critical in setting the world on a path to a sustainable future. Google is committed to reducing our own emissions and using technology to help everyone make sustainable choices.</p><p data-block-key=\"dq5c4\">Today, we’re releasing a <a href=\"https://www.gstatic.com/gumdrop/sustainability/google-2022-climate-action-progress-update.pdf\">paper</a> that shares updates on the work we have been doing as part of <a href=\"https://blog.google/outreach-initiatives/sustainability/our-third-decade-climate-action-realizing-carbon-free-future/\">our third decade of climate action</a>. Here’s a look at our progress and ambitions.</p><h3 data-block-key=\"cp4ni\">Built to be sustainable</h3><p data-block-key=\"5iv0c\">Sustainability has always been a core value for Google, and we know taking action starts with operating our business more sustainably.</p><p data-block-key=\"74iqt\">Last year we announced our goal of achieving net-zero emissions across our operations and value chain — including our consumer hardware products — by 2030. We aim to reduce 50% of our combined scope 1<footnote id=\"dd5395e2-42f7-4b8b-b115-2140526244e4\">[dd5395]</footnote>, scope 2<footnote id=\"c32b8a73-a6bb-458f-8bbc-cdd48c00e4bd\">[c32b8a]</footnote>, and scope 3<footnote id=\"19a61733-28bb-4f68-86ad-826be80ca69f\">[19a617]</footnote>absolute emissions (versus our 2019 baseline) before 2030, and plan to invest in nature-based and technology-based carbon removal solutions to neutralize our remaining emissions. There are three ways we are working towards this goal: advancing carbon-free energy (CFE), reducing emissions within our value chain, and addressing our residual emissions with carbon removal and other solutions.</p><p data-block-key=\"4hfa2\">Our net zero goal builds on two decades of climate action at Google. We started purchasing renewable energy in 2010, and in 2017 we became the first major company to match 100% of our annual electricity use with renewable energy purchases. We have continued to do so for <a href=\"https://cloud.google.com/blog/topics/sustainability/5-years-of-100-percent-renewable-energy\">five consecutive years</a>, and in 2020 we set the even more ambitious goal of operating our data centers and office campuses on <a href=\"https://sustainability.google/progress/energy/\">24/7 CFE</a> by 2030.</p><h3 data-block-key=\"a3f2t\">Accelerate action through partners</h3><p data-block-key=\"1iejf\">While we’re committed to reaching our goals, our impact is far greater when we work together. That’s why we collaborate with thousands of partners across multiple industries — from cities and governments to companies and nonprofits — to advance sustainability and climate progress.</p><p data-block-key=\"8mh4s\">Over half of the global population lives in cities, and urban areas account for over two-thirds of global energy consumption and <a href=\"https://www.worldbank.org/en/topic/urbandevelopment/overview#1\">more than 70% of global carbon emissions</a>. To help reduce these emissions, we aim to help more than 500 cities and local governments reduce an aggregate of 1 gigaton of carbon emissions annually by 2030. We are working to achieve this through tools like our <a href=\"https://insights.sustainability.google/\">Environmental Insights Explorer</a>, which empowers cities and regions with actionable data and insights to reduce global emissions, and Project Green Light, an AI tool that provides recommendations for city planners to optimize traffic light timing to reduce stop-and-go traffic.</p><p data-block-key=\"70k5p\">Likewise, many of the world’s biggest brands are working to operate more sustainably. Through Google Cloud, we’re helping customers minimize environmental impact. This summer we announced <a href=\"https://cloud.google.com/blog/topics/sustainability/how-partners-benefit-from-google-cloud-ready-sustainability\">Google Cloud Ready - Sustainability designation</a> to showcase partners that are committed to helping organizations accelerate their sustainability programs.</p><p data-block-key=\"1919j\">We are also building tools to strengthen communities’ response to extreme weather events. For example, our <a href=\"https://www.youtube.com/watch?v=Mz0ikfuE_z0\">forecasting initiative</a> provides flood alerts and information to at-risk communities. During Pakistan’s severe flooding this year, we provided nationwide SOS alerts with links to the latest information from government authorities.</p><h3 data-block-key=\"aionb\">Empowering everyone to make more sustainable choices</h3><p data-block-key=\"f5n84\">The billions of people who use our products and services are looking for ways to live more sustainably, and <a href=\"https://blog.google/outreach-initiatives/sustainability/sustainability-2021/\">we want to make it easier for them to do so</a>. In 2022, Google searches reached all-time highs for terms including “<a href=\"https://trends.google.com/trends/explore?q=%2Fm%2F0h1dq_f&amp;date=all\">rooftop solar power</a>,” “<a href=\"https://trends.google.com/trends/explore?date=all&amp;q=%2Fm%2F06xbd\">solar energy</a>,” “<a href=\"https://trends.google.com/trends/explore?date=all&amp;q=%2Fm%2F0bh99y_\">electric bicycles</a>,” and “<a href=\"https://trends.google.com/trends/explore?date=all&amp;geo=US&amp;q=electric%20cars\">electric cars</a>.”</p><p data-block-key=\"5tqsa\">Last year, we rolled out <a href=\"https://blog.google/products/maps/3-new-ways-navigate-more-sustainably-maps\">eco-friendly routing</a> on Google Maps in the U.S. and Canada, and this year it expanded to 40 countries across Europe. This tool gets people to their destinations as quickly as possible while minimizing fuel consumption. Already it has helped avoid an estimate of more than half a million metric tons of carbon emissions — that’s equivalent to <a href=\"https://www.blog.google/around-the-globe/google-europe/eco-friendly-routing-in-europe/\">taking approximately 100,000 fuel-based cars off the road</a><footnote id=\"31542c0b-355b-4e2f-9579-0cf432f5e167\">[31542c]</footnote>.</p><p data-block-key=\"3cna5\">As of this month, anyone with an eligible Nest thermostat in the continental U.S. can join <a href=\"https://nestrenew.google.com/welcome/?utm_source=keyword-blog&amp;utm_medium=google_oo&amp;utm_campaign=third_decade_climate_action\">Nest Renew</a>, which can <a href=\"https://blog.google/products/google-nest/nest-renew-clean-energy/\">automatically shift their</a> energy consumption to the times of day when grid electricity is cleaner or less expensive.</p><p data-block-key=\"3q12s\">As we work to provide products and services that help people make sustainable choices and reduce their carbon footprints, we’ll continue improving our ability to measure the individual and collective impact of these decisions. This is important not only for Google, but also for the growing number of companies offering solutions to help their customers reduce emissions.</p><h3 data-block-key=\"6fq32\">A more sustainable future, for all</h3><p data-block-key=\"d8sq1\">This year, we’ve seen major steps forward on climate policy in the U.S., Europe, and other regions. We are excited about the potential of new policy measures and corporate commitments that will help us reach historic emissions reductions in the next decade. The conversations at COP27 will be a critical moment to continue building momentum and move from pledges to progress.</p><p data-block-key=\"52rhh\">Our aim is to make every day more sustainable through our operations, partnerships and products. We’re energized by the progress we’ve made so far, and more motivated than ever to do our part to accelerate the transition to a more sustainable future for all.</p></div></div></body></html>",
  "pubDate": "Tue, 01 Nov 2022 13:00:00 +0000",
  "guid": "https://blog.google/outreach-initiatives/sustainability/cop27-google-climate-action/",
  "category": "Sustainability",
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Accelerating climate action at Google and beyond",
    "description": "A new paper we published today shares updates on the work we have been doing as part of our third decade of climate action.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/EUE-APW-120721-953-Edit.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://blog.google/outreach-initiatives/sustainability/cop27-google-climate-action/"
  },
  "author": {
    "name": "Kate Brandt",
    "title": "Chief Sustainability Officer, Google",
    "department": "",
    "company": ""
  }
}