{
  "title": "How USB Came to Be",
  "link": "https://spectrum.ieee.org/how-usb-came-to-be",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/close-up-of-a-white-usb-cable-on-a-red-background-info-for-editor-if-needed-usb-cable-for-an-apple-g4-computer-2003-this-usb.jpg?id=29403591&width=1245&height=700&coordinates=0%2C187%2C0%2C188\"/><br/><br/><p>Today even the least tech-savvy consumers can attach a camera, printer, scanner, or other accessory to their PC effortlessly. But in the early 1990s, attaching a peripheral to a computer was not so simple.</p><p>Before the development of USB (Universal Serial Bus), it was often tricky to connect external devices. Users sometimes needed to open up their computer and add hardware to give them the communications port they needed.</p><hr/><p>The Universal Serial Bus, which was released in 1996 by <a href=\"https://www.intel.com/content/www/us/en/homepage.html\" rel=\"noopener noreferrer\" target=\"_blank\">Intel</a>, simplified things. USB ports now are standard on personal computers and are built into many other electronic devices such as smartphones, eBook readers, and game consoles.</p><p>The ubiquitous USB standard has been commemorated with an <a href=\"http://ieeemilestones.ethw.org/Main_Page\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Milestone</a>. The <a href=\"http://www.ieee-oregon.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Oregon Section</a> sponsored the nomination. The dedication ceremony is still being planned.</p><p>Administered by the <a href=\"http://www.ieee.org/about/history_center/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE History Center</a> and <a href=\"https://www.ieeefoundation.org/donate_history\" rel=\"noopener noreferrer\" target=\"_blank\">supported by donors</a>, the Milestone program recognizes outstanding technical developments around the world.</p><p>“I thought [USB] was a [one-off US] $40 million opportunity,” <a href=\"https://www.linkedin.com/in/ajay-bhatt-ab37b74\" rel=\"noopener noreferrer\" target=\"_blank\">Ajay Bhatt</a>, one of the engineers at Intel who helped develop it, said in a 2013 <a href=\"https://www.cnn.com/2013/04/26/tech/innovation/usb-intel-billion-seller/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">interview with CNN</a> about the technology. “I couldn’t imagine where USB has gone or where it will continue to go. This has exceeded the wildest of my imaginations.”</p><p><strong>COLLABORATION IS KEY</strong></p><p>Many of the problems consumers encountered when they tried to attach peripherals to their computer in the 1990s arose because of the lack of standard practices among the industry’s many suppliers, as noted in the Milestone’s entry on the <a href=\"http://ieeemilestones.ethw.org/Milestone-Proposal:Universal_Serial_Bus_(USB)\" rel=\"noopener noreferrer\" target=\"_blank\">Engineering and Technology History Wiki</a>. Another problem was that most PCs had a limited number of input ports, and adding more could be difficult.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A man in glasses smiles at the camera. In the foreground is a computer. Info for editor if needed: Ajay Bhatt, Chief Platform Architect at Mobile Platform Group, Intel Corporation poses for a profile shoot on January 20, 2010 in New Delhi, India.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"cf1031e25ae1c32893261f5fd6e0d302\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"5cd8c\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-man-in-glasses-smiles-at-the-camera-in-the-foreground-is-a-computer-info-for-editor-if-needed-ajay-bhatt-chief-platform-ar.jpg?id=29403698&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\" style=\"max-width: 100%;\">Ajay Bhatt is one of the engineers at Intel who helped develop USB.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\" style=\"max-width: 100%;\">Pradeep Gaur/Mint/Getty Images</small></p><p>Bhatt says that even as a technologist, he struggled with upgrading his PC.</p><p>“I looked at the architecture, and I thought, ‘You know what? There are better ways of working with computers, and this is just too difficult,’” he said in a 2019 interview with <a href=\"https://www.fastcompany.com/3060705/an-oral-history-of-the-usb\" rel=\"noopener noreferrer\" target=\"_blank\"><em>Fast Company</em></a>.</p><p>In the early 1990s, Bhatt told his boss about his idea of developing a universal “plug -and-play” communication system—something the user didn’t need to adjust. His manager wasn’t interested.</p><p class=\"pull-quote\">“I couldn’t imagine where USB has gone or where it will continue to go. This has exceeded the wildest of my imaginations.”</p><p>Bhatt was passionate about his idea, though, so he decided to join a different research team at Intel. And there he was given the green light.</p><p>In 1992 Bhatt visited the <a href=\"https://foursquare.com/v/intel--jones-farm-conference-center/4b7429e6f964a520b3ca2de3\" rel=\"noopener noreferrer\" target=\"_blank\">Jones Farm Conference Center</a>, in Hillsboro, Ore., where he met with engineers from different tech companies who also were looking into developing a plug-and-play scheme. It was there that engineers from <a href=\"https://www.compaq.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Compaq</a>, <a href=\"https://en.wikipedia.org/wiki/Digital_Equipment_Corporation\" rel=\"noopener noreferrer\" target=\"_blank\">Digital Equipment Corp.</a> (DEC), <a href=\"https://history-computer.com/ibm-history/\" rel=\"noopener noreferrer\" target=\"_blank\">IBM</a>, Intel, <a href=\"https://www.microsoft.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Microsoft</a>,<a href=\"https://en.wikipedia.org/wiki/Nortel\" rel=\"noopener noreferrer\" target=\"_blank\"> </a><a href=\"https://www.necam.com/\" rel=\"noopener noreferrer\" target=\"_blank\">NEC</a>, and<a href=\"https://www.necam.com/\" rel=\"noopener noreferrer\" target=\"_blank\"> </a><a href=\"https://en.wikipedia.org/wiki/Nortel\" rel=\"noopener noreferrer\" target=\"_blank\">Nortel</a> formed an alliance.</p><p>“The industry as a whole recognized that it had a big problem that needed to be solved,” <a href=\"http://www.pappas.me/Jim.htm\" rel=\"noopener noreferrer\" target=\"_blank\">Jim Pappas</a> said in an <a href=\"https://www.intel.com/content/dam/www/public/us/en/documents/articles/usb-two-decades-of-plug-and-play-article.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Intel article</a> on the USB interface. At the time of the meeting, Pappas was an engineering manager at DEC, but he eventually joined Intel as a program manager for its USB-development team.</p><p><strong>FROM DREAM TO REALITY</strong></p><p>Before the group began developing USB, it explored what was already available. It looked at Ethernet-like technologies, audio interfaces, Apple’s GeoPort, and <a href=\"https://standards.ieee.org/ieee/1394/4377/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE 1394</a>—also known as the Firewire standard. But none had all the traits the team sought. In particular, the engineers wanted something that was inexpensive, user-friendly, able to power peripherals, and offered a lot of bandwidth.To keep manufacturing costs down, the engineers designed USB to work with a slender, four-conductor cable that could be as long as 5 meters. One end of the cable had an A connector, which plugged into the computer; the B connector on the other end plugged into the external device.</p><p>At the time, computers didn’t typically provide power for such external devices. Most peripherals had to be plugged into an outlet while connected to a PC. But USB allowed a computer to supply sufficient power for some peripherals.</p><p>Another advantage of USB was that, in principle, it allowed as many as 127 peripherals to be connected to one PC at a time. A single computer was unlikely to have 127 USB ports, but the number of ports available could be increased by adding USB hubs.</p><p>For a name, the development team looked for something users could relate to, and they also wanted it to describe the technology. The engineers chose the word <em>bus</em> because it was both a technical term (a bus is used to carry data in a computer) and one consumers would recognize, according to the <em>Fast Company</em> article. Buses, in most people’s minds, were vehicles that got passengers from Point A to Point B, <a href=\"https://www.linkedin.com/in/bala-cadambi-1503304\" target=\"_blank\">Bala Cadambi</a>, who worked on the USB development team, said in the 2019 interview. <em>Universal</em> marked the USB as a tool that could be used with any hardware.</p><p>The team announced its first design in 1995. At 12 megabits per second, USB 1.0 was “faster than anything else that normally would come at the back of the PC,” Pappas told <em>Fast Company</em>.</p><p>The team encountered a problem, though: 12 Mb/s was too fast for computer mouses, joysticks, keyboards, and other accessories with unshielded cables. The engineers solved the problem by arranging for USB 1.0 to support communications at 1.5 Mb/s as well.</p><p>That approach allowed USB to work at low speed for low-cost peripherals with unshielded cables and at high speed for devices with shielded cables, such as printers and floppy-disk drives.</p><p>USB 1.1, released in 1996, did not become popular until 1998, after it was showcased at the <a href=\"https://en.wikipedia.org/wiki/COMDEX\" rel=\"noopener noreferrer\" target=\"_blank\">COMDEX</a> trade show in Las Vegas. At a news conference there, an Intel team attached <a href=\"https://www.intel.com/pressroom/archive/releases/1998/us111698.htm\" rel=\"noopener noreferrer\" target=\"_blank\">127 peripherals to one PC</a>. The engineers hired <a href=\"https://billnye.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Bill Nye</a> to plug in the last of the devices. In Pappas’s 2019 <em>Fast Company</em> interview, he said that once Nye did so, the team sent a document to various destinations to print. “We had a whole stage full of different printers!” Pappas said.</p><p>The delay between the release of USB 1.1 in 1996 and when it caught on is understandable because Microsoft <a href=\"https://en.wikipedia.org/wiki/Windows_98\" rel=\"noopener noreferrer\" target=\"_blank\">Windows 98</a>, which was released in June 1998, was the first operating system to support USB. Two months later, <a href=\"https://www.apple.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Apple</a> released its iMac, which lacked a floppy-disk drive but did have a pair of USB ports. Although Apple was not among the companies that worked on the USB project, it helped make the technology mainstream.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A USB stick about to be connected to a computer\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"a5f1f2f38f6a1ded17d326b21d34cf32\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"62539\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-usb-stick-about-to-be-connected-to-a-computer.jpg?id=29403716&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\" style=\"max-width: 100%;\">USB ports are now standard in computers.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\" style=\"max-width: 100%;\">Mint/Getty Images</small></p><p>Since then, three more USB generations have emerged. The most recent, USB4, was released in 2019.<br/></p><p>“Who would have thought that a connector that we had defined in the early ’90s would still be usable today?” Cadambi said in the <em>Fast Company</em> interview. “That’s very rare. We had cost constraints, performance constraints. It was designed for a desktop, not a smartphone. Looking back at it, it was wonderful that we accomplished what we did, that it withstood the test of time.”</p><p>The Milestone plaque, which is to be displayed in the lobby of the Jones Farm Conference Center, reads:</p><p><em>An industry consortium published the first Universal Serial Bus (USB) specification in January 1996. Initially intended to simplify attaching electronic devices to a PC, USB became a very successful low-cost, high-speed interface for home and business use. Its ability to support new device classes and functionalities, including data storage, power delivery, and battery charging, has made USB’s cabling, connectors, and logo recognizable worldwide.</em></p>",
  "pubDate": "Tue, 22 Feb 2022 19:00:00 +0000",
  "guid": "https://spectrum.ieee.org/how-usb-came-to-be",
  "category": [
    "Usb",
    "Ieee milestone",
    "Intel",
    "Microsoft",
    "Apple",
    "Ieee history center",
    "Universal serial bus",
    "Tech history",
    "Ieee history",
    "Type:ti"
  ],
  "dc:creator": "Joanna Goodrich",
  "media:content": ""
}