{
  "title": "12: Barbara Marx Hubbard on Conscious Evolution: Awakening the Power of Our Social Potential",
  "pubDate": "Fri, 27 Feb 2015 23:33:30 +0000",
  "guid": "0ae8e399cc5db553dcb0b3459e68fe04",
  "link": "https://traffic.libsyn.com/secure/lifeonpurpose/LifeOnPurposeBarbara.mp3",
  "itunes:image": "",
  "description": "<p>In 1945 the United States dropped atomic bombs on Japan, and the world caught its breath. This pivotal event deeply impacted the young <strong>Barbara Marx Hubbard</strong>, who found herself asking President Eisenhower, \"What is the meaning of our power that is good\"? Barbara's 40+ year inquiry, and the answers she has found, offer invaluable assistance to us all at this time in our history. Despite the state of the world, we are truly on the threshold of great possibility, of our own conscious evolution.</p>\n<p>In this inspirational conversation, <strong>Barbara</strong> and I discuss the revised and updated edition of <em><strong>Conscious Evolution: Awakening the Power of Our Social Potential</strong></em> (New World Library), her seminal book first published in 1998, which laid the foundation for the significance and impact around the world of the idea of conscious evolution.</p>\n<p>About: <strong>Barbara Marx Hubbard</strong> has been called \"the voice for conscious evolution...\" by Deepak Chopra. She is the subject of Neale Donald Walsch’s book The Mother of Invention. And many would agree she is the global ambassador for conscious change.</p>\n<p>At her heart, <strong>Barbara Marx Hubbard</strong> is a visionary, a social innovator. She is an evolutionary thinker who believes that global change happens when we work collectively and selflessly for the greater good. She realizes that the lessons of evolution teach us that problems are evolutionary drivers, and crises precede transformation, giving a new way of seeing and responding to our global situation.</p>\n<p>As a prolific author and educator, <strong>Barbara</strong> has written seven books on social and planetary evolution.  She has produced, hosted, and contributed to countless documentaries seen by millions of people around the world.  In conjunction with the Shift Network, <strong>Barbara</strong> co-produced the worldwide \"Birth 2012\" multi-media event that was seen as a historic turning point in exposing the social, spiritual, scientific, and technological potential in humanity.</p>\n<p>In 1984 her name was placed in nomination for the Vice Presidency of the United States on the Democratic ticket, calling for a \"Peace Room\" to scan for, map, connect and communicate what is working in America and the world. She also co-chaired a number of Soviet-American Citizen Summits, introducing a new concept called \"SYNCON\" to foster synergistic convergence with opposing groups. In addition she co-founded the World Future Society, and the Association for Global New Thought.</p>\n<p><strong>Barbara Marx Hubbard</strong> is not an idealist, nor does she believe that social and planetary change is simple.  But she does believe that humanity has the tools, fortitude, and resolve to take the leap towards conscious evolution.</p>\n<p>To learn more about <strong>Barbara</strong> and her work, visit: <a href=\"http://evolve.org\" target=\"_blank\">http://evolve.org</a>.</p>",
  "content:encoded": "<p>In 1945 the United States dropped atomic bombs on Japan, and the world caught its breath. This pivotal event deeply impacted the young Barbara Marx Hubbard, who found herself asking President Eisenhower, \"What is the meaning of our power that is good\"? Barbara's 40+ year inquiry, and the answers she has found, offer invaluable assistance to us all at this time in our history. Despite the state of the world, we are truly on the threshold of great possibility, of our own conscious evolution.</p>\n<p>In this inspirational conversation, Barbara and I discuss the revised and updated edition of <em>Conscious Evolution: Awakening the Power of Our Social Potential</em> (New World Library), her seminal book first published in 1998, which laid the foundation for the significance and impact around the world of the idea of conscious evolution.</p>\n<p>About: Barbara Marx Hubbard has been called \"the voice for conscious evolution...\" by Deepak Chopra. She is the subject of Neale Donald Walsch’s book The Mother of Invention. And many would agree she is the global ambassador for conscious change.</p>\n<p>At her heart, Barbara Marx Hubbard is a visionary, a social innovator. She is an evolutionary thinker who believes that global change happens when we work collectively and selflessly for the greater good. She realizes that the lessons of evolution teach us that problems are evolutionary drivers, and crises precede transformation, giving a new way of seeing and responding to our global situation.</p>\n<p>As a prolific author and educator, Barbara has written seven books on social and planetary evolution.  She has produced, hosted, and contributed to countless documentaries seen by millions of people around the world.  In conjunction with the Shift Network, Barbara co-produced the worldwide \"Birth 2012\" multi-media event that was seen as a historic turning point in exposing the social, spiritual, scientific, and technological potential in humanity.</p>\n<p>In 1984 her name was placed in nomination for the Vice Presidency of the United States on the Democratic ticket, calling for a \"Peace Room\" to scan for, map, connect and communicate what is working in America and the world. She also co-chaired a number of Soviet-American Citizen Summits, introducing a new concept called \"SYNCON\" to foster synergistic convergence with opposing groups. In addition she co-founded the World Future Society, and the Association for Global New Thought.</p>\n<p>Barbara Marx Hubbard is not an idealist, nor does she believe that social and planetary change is simple.  But she does believe that humanity has the tools, fortitude, and resolve to take the leap towards conscious evolution.</p>\n<p>To learn more about Barbara and her work, visit: <a href=\"http://evolve.org\" target=\"_blank\">http://evolve.org</a>.</p>",
  "enclosure": "",
  "itunes:duration": "53:33",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "In 1945 the United States dropped atomic bombs on Japan, and the world caught its breath. This pivotal event deeply impacted the young Barbara Marx Hubbard, who found herself asking President Eisenhower, \"What is the meaning of our power that is..."
}