{
  "title": "TU94: The Science of Self-Regulation – Breaking Down Polyvagal Theory",
  "link": "https://therapistuncensored.com/episodes/tu94-the-science-of-self-regulation-breaking-down-polyvagal-theory/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu94-the-science-of-self-regulation-breaking-down-polyvagal-theory",
  "pubDate": "Wed, 17 Apr 2019 21:34:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7044",
  "description": "The science of relaxing into love, this episode continues the exploration of Polyvagal Theory, one of the most important theories of our generation, especially when it comes to trauma and psychological treatment.\n\nJoin Sue Marriott and Ann Kelley as they continue to break down and bring Polyvagal Theory to life. Through discussion and real-life examples of what happens when our bodies experience threat, you will learn how to recognize when you or your loved one is experiencing an unconscious physiological threat response as well as some practical self-regulation skills to move back into safety. Additionally, we will begin unfolding how powerful relationships are in helping us establish, maintain and return to a physiological state of safety. It’s true, love really is a drug!\n\nCheck out TU93b, our interview with Dr Stephen Porges, the father of Polyvagal Theory by clicking here! \nWhy are we so jazzed about Polyvagal Theory (PVT)?\n\n \tPVT looks at the body related to attachment, related to getting close to one another, and to co-regulation and ties it all together!\n\nWhat’s PVT all about?\n\n \tPVT is an evolutionarily based theory that explains how our bodies sense danger and threat and also how we respond.\n \tIt helps us to understand what is going on physiologically during these times, so we can learn to recognize our bodies’ signals and utilize skills to regulate our nervous system.\n\nPolyvagal Theory Breakdown\nThe bottom line is are we safe or are we in danger?\nNeuroception:\nOur brains are always scanning for info from the environment that regulates whether we feel safe or not safe. It is spontaneous and completely outside of our awareness.\nOld View:\n\n \tOnly Fight or Flight Response Systems, but that’s outdated.\n\nPolyvagal View:\n\n \tWe not only have a Fight or Flight Response, we also have a Freeze Response.\n\nThe Systems and the Vagus Nerve\nAutonomic Nervous System –\n\n \tAutonomic=Automatic – all the things our bodies do for us without thinking\n \tExamples: blinking, digestion, etc…\n \tBreathing is the only autonomic process we can manipulate consciously\n\nParasympathetic\n\n \tPara=Paralyzed\n \tThis is the brake.\n\nSympathetic\n\n \tEnergizing\n \tWhere “Fight and Flight” are\n \tPrehistoric example (Old View):\n \tbeing attacked by a saber tooth tiger, response will be to run from it or fight it, literally.\n \tEveryday example:\n \tA mad spouse, angry boss, disapproving parent\n \tFight=defensiveness, blame, etc.\n \tFlight=withdrawing, physically leaving a party, stonewalling\n\nThe Vagus Nerve\n\n \tLargest nerve in the body\n \tAll mammals and vertebrates have it, some versions of it in fish\n \tRuns throughout our entire body\n \tInformation Freeway – carries information from scans of the environment to the brain\n\n\nOur Brains: Safety vs Danger\nSafety:\n\n \tThis is the Social Engagement System (The Green Zone)\n \tWhen we are safe, the lights are on all the way to the top of our minds.\n \tWe are our very best selves.\n \tHearts are open\n \tWhole neuro psychological, the biological system is signaling safety: the heart rate slows, breath is steady, able to digest food, make eye contact, have movement in our face so other people can read us, inner ear relaxes, ears relaxes enabling us to pick up human voice very, very well.\n\nDanger:\n\n \tWhen in danger, our brains work in reverse order.\n \tbreathing quickens and is shallow, heart rate increases, non-vital body functions are shut down, Inner ear constricts because it listening for high tones and low tones – listening for predators, oxygen level decreases, stress hormones (cortisol, norepinephrine, and adrenaline) are dumped into system.\n\nNeural WiFi:\n\n \tOur unconscious neurological states of feeling safe or feeling threatened translate to the people we interact with, even through the phone.\n \tExample: Sue & Ann’s phone conversation\n\nBottom Up:\n\n \tVagus nerve: picks info up from our body bottom and carries it up to the brain\n \tBrain:",
  "enclosure": "",
  "itunes:subtitle": "The science of relaxing into love, this episode continues the exploration of Polyvagal Theory, one of the most important theories of our generation, especially when it comes to trauma and psychological treatment. -",
  "itunes:summary": "The science of relaxing into love, this episode continues the exploration of Polyvagal Theory by bringing it to life through discussion and real-life examples.  Sue Marriott and Ann Kelley continue to break down one of the most important theories of our generation when it comes to trauma and psychological treatment.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "30:43"
}