{
  "id": "https://bibleinoneyear.org/en/youth/96",
  "title": "Day 96: Press Through",
  "description": "Proverbs 8:34–35, Deuteronomy 4:29-31, 5:6, 28–29, Luke 11:5–11. God loves you  God does not force himself upon you, but he promises to reveal himself to you if you persistently *seek* him",
  "pubDate": "Wed, 06 Apr 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/96/",
  "itunes:duration": "13:00",
  "guid": "enyouth06042022-96",
  "length": 780.62,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 96: Press Through",
  "itunes:subtitle": "Proverbs 8:34–35, Deuteronomy 4:29-31, 5:6, 28–29, Luke 11:5–11. God loves you  God does not force himself upon you, but he promises to reveal himself to you if you persistently *seek* him",
  "itunes:summary": "‘Can you see anything?’ his assistant asked as Carter’s eyes adjusted to the semi-darkness. Carter could see well enough, but he had difficulty speaking because of the dazzling array of treasure spread out before him.\nFor more than two thousand years, tourists, grave robbers and archaeologists had searched for the burial places of Egypt’s Pharaohs. Armed with only a few scraps of evidence, British archaeologist Howard Carter’s search, after many years, seemed doomed to failure.\nBut Carter pressed through and finally unlocked an ancient Egyptian tomb. No one in the modern world had ever seen anything like it. The king’s embalmed body lay within a nest of three coffins, the inner one of solid gold. On the king’s head was a magnificent golden portrait mask and numerous pieces of jewellery lay on the body and in its wrappings.\nOther rooms were crammed with statues, a chariot, weapons, chests, vases, daggers, jewels and a throne. It was the priceless tomb and treasure of King Tutankhamun, who reigned from 1352 to 1343 BC. It was 3265 years later, on 26 November 1922, that Carter made this discovery.\nHoward Carter made the world’s most exciting archaeological find because he did not give up seeking. He pressed through. He persevered. A river cuts through rock not because of its power but because of its persistence.\nGod loves you. God does not force himself upon you, but he promises to reveal himself to you if you persistently seek him.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 461
}