{
  "title": "005 DACA (English)",
  "itunes:title": "005 DACA (English)",
  "pubDate": "Sun, 10 Jan 2021 19:21:55 +0000",
  "guid": "6f87454b-48e8-49f3-9f4b-1cf0db031e92",
  "link": "https://larchitect.libsyn.com/005-daca-0",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Some may have only heard the acronym DACA and may not be very clear on what it really is. I will describe a few details.</span> <span style= \"font-weight: 400;\">According to the American Immigration Council, “DACA i</span><span style=\"font-weight: 400;\">s an exercise of prosecutorial discretion, providing temporary relief from deportation (deferred action) and work authorization to certain young undocumented immigrants who were brought to the United States as children.” Now in normal English, I take that to mean that they help children who were brought to the US, before they were of legal age.</span> <span style=\"font-weight: 400;\">DACA is an acronym for Deferred Action for Childhood Arrivals. It is a program created by the Obama administration for the purpose of taking pressure off young immigrants. DACA has allowed eligible young adults to lawfully work, attend school, and live life without the threat of deportation.</span></p>",
  "content:encoded": "<p>Some may have only heard the acronym DACA and may not be very clear on what it really is. I will describe a few details. According to the American Immigration Council, “DACA is an exercise of prosecutorial discretion, providing temporary relief from deportation (deferred action) and work authorization to certain young undocumented immigrants who were brought to the United States as children.” Now in normal English, I take that to mean that they help children who were brought to the US, before they were of legal age. DACA is an acronym for Deferred Action for Childhood Arrivals. It is a program created by the Obama administration for the purpose of taking pressure off young immigrants. DACA has allowed eligible young adults to lawfully work, attend school, and live life without the threat of deportation.</p>",
  "enclosure": "",
  "itunes:duration": "27:32",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "005 DACA (English)",
  "itunes:season": 2,
  "itunes:episode": 5,
  "itunes:episodeType": "full",
  "itunes:author": "Michael Todoran"
}