{
  "id": "yt:video:LQR5Us3D_ZA",
  "yt:videoId": "LQR5Us3D_ZA",
  "yt:channelId": "UCRRr_xrOm66qaigIbwFLvbQ",
  "title": "Assume a spherical cow.",
  "link": "",
  "author": {
    "name": "Simon Clark",
    "uri": "https://www.youtube.com/channel/UCRRr_xrOm66qaigIbwFLvbQ"
  },
  "published": "2022-07-21T10:00:32+00:00",
  "updated": "2022-08-19T15:33:56+00:00",
  "media:group": {
    "media:title": "Assume a spherical cow.",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "It makes the maths easier. But what else? Learn to code like this yourself with Brilliant! https://www.brilliant.org/simonclark\n\nA spherical cow is such a meme within physics that it has its own Wikipedia page, but why do physics use it? Why do we make approximations about the universe when describing it with equations? I'd argue that the only way to take our understanding beyond the simple is to make the universe simple...\n\nCreated using Michael Fogleman's genius primitive script: https://github.com/fogleman/primitive\n\nYou can support the channel by donating at http://www.patreon.com/simonoxfphys\n\nCheck out my website! https://www.simonoxfphys.com/\n\n---------- II ----------\n\nMy twitter - http://www.twitter.com/simonoxfphys\nMy facebook - http://www.facebook.com/youtubesimon\nMy insta - http://www.instagram.com/simonoxfphys\nMy goodreads - http://www.goodreads.com/simonoxfphys\n\n---------- II ----------\n\nMusic by Epidemic Sound: http://epidemicsound.com\nEdited by Luke Negus.\n\nVisualisation about approximations in physics, assume a spherical cow, primitive look at the universe.\n\nHuge thanks to my supporters on Patreon: Josh Schiager, Farsight101, Liam Margetts, K.L, poundedjam, Alanah Mack, Stormchaser007 , Daan Sneep, Felix Freiberger, Robert Connell, Jaime Stark, Kolbrandr, , Sebastain Graf, Dan Nelson, Shane O'Brien, Fujia Li, Harry Eakins, Will Tolley, Nafi Iftekhar, Andrew Young, Cody VanZandt, Jesper Koed, Jovana, Albrecht Striffler, hennersfl, Federico Ameijenda, Jon Sjöberg, Igor Francetic, Jack Troup, Austin Frazee, SexyCaveman , James Munro, Oskar Hellström, Sean Richards, Kedar , Omar Miranda, Alastair Fortune, bitreign33 , Mat Allen, Anne Smith, Colin J. Brown, Princess Andromeda, Aron Kári Ágústsson, Leighton Mackenzie, BenDent , Charles Bray, Thusto , Andy Hartley, Lachlan Woods, Tim Boxall, Dan Hanvey, Simon Donkers, Kodzo , James Bridges, Liam , Andrea De Mezzo, Wendover Productions, Kendra Johnson.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}