{
  "id": "yt:video:liHlCRpS70k",
  "yt:videoId": "liHlCRpS70k",
  "yt:channelId": "UCJZ94qp4dtCw0Q5UQqAkg7w",
  "title": "Lars Andersen: Recreating Comanche Archery",
  "link": "",
  "author": {
    "name": "larsandersen23",
    "uri": "https://www.youtube.com/channel/UCJZ94qp4dtCw0Q5UQqAkg7w"
  },
  "published": "2021-09-28T14:11:55+00:00",
  "updated": "2022-03-04T07:33:46+00:00",
  "media:group": {
    "media:title": "Lars Andersen: Recreating Comanche Archery",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Comanche archer were the only archers in history who could easily defeat firearms, but how did they do archery?\nJoe Rogan Experience suggested they did archery like me, but this is wrong!\nComanche archery is a completely different and partially forgotten method.\n\nThere are many descriptions that they were incredibly good and very very fast, but no known method with the arrow on the left and arrows held in bow hand, is as fast as the Arabic method I usually use, where I only use one movement for each arrow.\n\nSo something was missing?\nAlong with Dave Mead I started researching and testing.\nEric Smith has been kind to tell his great-grandfather's experience of actually being shot after with arrows by Comanche which are written down and therefore confirm that they actually had 5 arrows in the air at the same time, when they were at war, and not just as games or the like.\nAnd a number of other descriptions are known of how extremely fast they shot arrows.\n\nIt is 150 years since this extreme horse archery war method was used in reality, so much knowledge has been lost\n\nWe talked to a lot of people including Comanche people for trying to recreate this archery.\n\nWith many experiments with all sorts of variation, no one was near fast enough because there were several movements needed for each arrow.\nI ended up, if the arrow is placed horizontally in the bow hand before or while shooting then you can shoot in one motion and it works really well and also on horseback.\nAnd if you do not use the arrows, they can easily be brought back in front of the bow in one movement\n\nOf course, it is not possible to know whether this method is the real Comanche method but it works well and fits with equipment and works well on horseback and can do everything described in historical sources.\n\nIt is also impossible to know if there is only one Comanche archery method, or several different.\nEric Smith told me he thinks so good archers they could both shot right and left around the bow and could use several methods, and this I think too.\n\nBut regardless of history, it's a really cool and fun way to do archery\nas other archers should try too and it is very easy to learn!!\n\nSincerely\nLars Andersen\n\nDanish language podcast about Recreating Comanche Archery\nhttps://anchor.fm/lars-andersen5/episodes/Bueskytte-Lars-Andersen-Fortller-om-at-prve-at-genskabe-den-comanche-bueskydning-e1813eu/a-a6jr1eg\n\nDave Mead\nhttps://www.youtube.com/channel/UC1yAT871XCCC1ZCVOyZm8fg\n\nEric Smith\nhttp://www.plainsindianbows.com\n\nJoe Rogan S.C. Gwynne \nhttps://soundcloud.com/approvedbyyou/joe-rogan-experience-1397-sc-gwynne",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}