{
  "title": "#472: DUBBLEDORE! (OOTP 35, 'Beyond the Veil')",
  "link": "https://audioboom.com/posts/7624179",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4481,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>News covers the <a href=\"https://www.wizardingworld.com/chapters/reading-the-mirror-of-erised\">latest chapter of Sorcerer's Stone</a> with Matthew Lewis and Imelda Staunton. Plus, an <a href=\"https://www.bloomberg.com/news/articles/2020-06-29/harry-potter-game-developers-rattled-by-j-k-rowling-backlash\">update on the Harry Potter RPG</a>!</li>\n<li>Chapter-by-Chapter continues with Harry Potter and the Order of the Phoenix – Chapter 35: Beyond The Veil</li>\n<li>7-Word Summary: Sirius falls through the unknown to death </li>\n<li>Our initial impressions of Bellatrix Lestrange</li>\n<li>Dreams vs. Reality: Where’s Sirius, and how can you tell what's a dream and what's not?</li>\n<li>What do we make of Harry’s leadership in his first real battle? </li>\n<li>Why didn't Voldemort just infiltrate the Ministry himself?</li>\n<li>Was Dumbledore’s plan to keep Harry out of the loop a good one?</li>\n<li>\"Accio, Prophecy!\" - are we being for real now?</li>\n<li>We reminisce about The Broken Prophecy and the theories that followed</li>\n<li>The Evolution of Neville Longbottom: Why is this the chapter where he really comes into his own.</li>\n<li>How talented are the Order? Are they fighting fire with fire against the Death Eaters?</li>\n<li>DUBBLEDORE! Did we prefer his book or movie entrance?</li>\n<li>Goodbye, Sirius! We play a couple songs to pay tribute to this beloved character.</li>\n<li>We give our MVP of the Week and Rename The Chapter!</li>\n<li>Quizzitch: What planet does not survive the battle in the Department of Mysteries?</li>\n<li>Join our community at <a href=\"http://www.patreon.com/mugglecast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast! This week we'll discuss if the Death Eaters do or don't care that Voldemort is a half-blood.</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 07 Jul 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-07-06:/posts/7624179",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}