{
  "title": "China’s Growing Political Autocracy Limits Its Economic Prospects",
  "link": "https://www.heritage.org/asia/commentary/chinas-growing-political-autocracy-limits-its-economic-prospects",
  "description": "<p>Chinese President Xi Jinping’s attempt to build a more socialist economy with excessive Communist Party control contradicts more market-oriented reforms China has tried to implement since the late 1970s. On October 16, the 20th National Congress of the Chinese Communist Party reaffirmed Xi’s control over the country and his party for a <a href=\"https://www.dailysignal.com/2022/10/25/bolder-and-more-confident-what-to-expect-for-xi-jinpings-third-term/\">third term</a> and, in doing so, endorsed his dangerously flawed economic policies.</p>\n\n<p>The belated release of official figures after the Party Congress adjourned showing 3.9% year-over-year growth in the third quarter of 2022 was an attempt to downplay Xi’s gross mismanagement of the economy as he tries to claim success for a gradual economic recovery. However, there are growing questions about the accuracy of the economic figures the Communist Party is publishing.</p>\n\n<p>Indeed, China’s economy is unlikely to gain steam anytime soon. Its leadership looks poised to continue the same policies that slowed growth in recent months, including the <a href=\"https://www.dailysignal.com/2022/04/14/in-china-public-health-takes-back-seat-to-politics/\">“zero-COVID”</a> and “<a href=\"https://www.china-briefing.com/news/china-common-prosperity-what-does-it-mean-for-foreign-investors/\">common prosperity</a>” policies. The common prosperity policy includes imposing new regulatory crackdowns and higher taxes on large private companies in the education, finance, and e-commerce industries to rein in rich individuals and corporations from growing too powerful in the eyes of the Communist Party.  </p>\n\n<p>The impacts of these and other autocratic policies can be seen throughout the Chinese economy.</p>\n\n<p>Investment in the real estate and residential property sectors fell by 8% and 26% respectively in the first nine months of 2022. The September unemployment rate (5.5%), and especially youth unemployment rate (18%), have remained high, according to the <a href=\"http://www.stats.gov.cn/english/\">National Bureau of Statistics of China</a>. And external trade has not yet returned to levels before the large-scale economic lockdown in several important cities from April to June due to the zero-COVID policy.</p>\n\n<p>Trade statistics from China’s important trading partners also reveal the country’s weakening economic conditions. Taiwan’s and South Korea’s annual exports to China registered the largest decline in September (compared to the previous eight months of this year) according to <a href=\"https://www.mof.gov.tw/eng\">Taiwan’s Ministry of Finance</a> and <a href=\"https://unipass.customs.go.kr/ets/index_eng.do\">Korea Customs</a>.</p>\n\n<p>The two countries are the main suppliers of key components for China’s manufacturing production. The reduction in their exports to China implies a slowing down in its domestic manufacturing industry. <a href=\"https://www.moea.gov.tw/Mns/dos/content/ContentLink.aspx?menu_id=9423\">Taiwan’s official figures</a> also show that orders for shipments from China and Hong Kong in September decreased significantly—by almost 30%.</p>\n\n<p>To some extent, slowing economic growth is expected as China transforms from a labor-intensive manufacturing economy to a higher value-added manufacturing- and service-oriented economy. The same patterns were experienced by other countries transitioning from producing low-value- to high-value-added products. What makes China’s case unique is that its economic transformation is being driven by government initiatives instead of by market forces.</p>\n\n<p>To climb the ladder in the global supply chain network, the Chinese government has forcefully pulled labor-intensive manufacturing production (e.g., textile, plastics, etc.) out of China for more than a decade by enforcing wage hikes and strict environmental rules.</p>\n\n<p>Nevertheless, the government has thus far failed to transform China into a key technology hub. China only has been able to achieve the manufacturing of “high technology” products (e.g., smartphones, computers, robots, etc.) through the importation and assembly of key components and equipment from abroad.  </p>\n\n<p>China’s heavy reliance on foreign technology has made it easier for the <a href=\"https://www.dailysignal.com/2022/07/26/china-is-us-toughest-adversary-gop-congressman-says/\">U.S.</a> to <a href=\"https://www.csis.org/analysis/choking-chinas-access-future-ai\">choke off development of its high tech industry</a>, notably its semiconductor chips and artificial intelligence components. New U.S. export restrictions on semiconductor chips and equipment to China may further slow its technological ambitions and economic growth.</p>\n\n<p><a href=\"https://www.bloomberg.com/news/articles/2022-10-24/china-s-plunging-market-has-become-a-high-risk-bet-on-xi-jinping?sref=InMWfBxD#xj4y7vzkg\">China’s plunging stock market</a> and <a href=\"https://finance.yahoo.com/news/china-stocks-slide-leadership-overhaul-012926088.html\">weaker currency</a> have further stoked <a href=\"https://www.dailysignal.com/2022/07/07/chinas-stars-dim-for-investors/\">investors</a>’ worries about the country’s near-term economic future.</p>\n\n<p>Moreover, in the long run, China’s export prospects are likely to be squeezed between competition from developing countries’ growing manufacturing strength and China’s inability to climb the global supply chain network due to its technological limitations. The bleak export outlook might constrain the growth of its income per capita, thus restraining the consumption potential of its citizens, and that’s in addition to the potential constraints already being imposed by the fact that it has an increasingly aging population.</p>\n\n<p><a href=\"https://www.dailysignal.com/2022/02/01/government-interference-in-economy-isnt-way-to-compete-with-china/\">China</a> considered its active involvement in the global economy as a panacea to boost its own economy. But in fact, globalization has been a double-edged sword. While the nation intends to continue to reap the benefits from its greater investment and trade with other countries, it has become much more reliant on foreign technology and on U.S. and European market demand to sustain its economic development.  </p>\n\n<p>This lack of understanding of its position in the global economic system has resulted in its complacency. Its high-speed economic growth over the past few decades emboldened its ambition to compete with the United States in high-tech industry. But because of its increased reliance on communist ideology to overshadow any hints of capitalist reforms, it continues to fall behind.</p>\n\n<p>The new Communist Party-appointed leadership team that joins Chairman Xi in his third term does not seem to understand the challenges, opportunities, and reforms needed to better integrate with the global capitalist economy. Instead, they remain committed to Xi’s vision for economic policy—one based on the same Marxist-Leninist ideology that has failed to deliver solutions to some of China’s most daunting economic challenges.</p>\n\n<p><em>This piece originally appeared in <a href=\"https://www.dailysignal.com/2022/10/31/chinas-growing-political-autocracy-limits-its-economic-prospects\">The Daily Signal</a></em></p>",
  "pubDate": "Wed, 02 Nov 2022 11:32:27 -0400",
  "dc:creator": "Min-Hua Chiang",
  "guid": "https://www.heritage.org/asia/commentary/chinas-growing-political-autocracy-limits-its-economic-prospects"
}