{
  "title": "Liberty Counsel Used Documents From Gab, ADF for Its Anti-COVID Vaccine Campaign",
  "link": "https://www.splcenter.org/hatewatch/2022/11/01/liberty-counsel-used-documents-gab-adf-its-anti-covid-vaccine-campaign",
  "description": "<div class=\"field field-name-field-story-type field-type-list-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Hatewatch</div>\n      </div>\n</div>\n<div class=\"field field-name-field-long-text field-type-text-long field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><p>The Liberty Counsel (LC) took documents from outside hate groups and hard-right figures to craft religious-based vaccine exemption requests during the COVID-19 pandemic, leaked documents reviewed by Hatewatch appear to show.</p>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-image field-type-image field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"></div>\n      </div>\n</div>\n<div class=\"field field-name-title-field field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><h1>Liberty Counsel Used Documents From Gab, ADF for Its Anti-COVID Vaccine Campaign</h1>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><p>Hatewatch reviewed over 40 documents from a leak of files showing the LC’s anti-vaccine and health protocol activism. Most of the documents are publicly available on the LC website. However, the LC website was down after a hacker who identifies with the Anonymous movement <a href=\"https://theintercept.com/2022/08/25/liberty-counsel-data-breach/\"> exploited vulnerabilities</a> in the website’s software. The hacker released the leak on Enlace Hacktivista, a <a href=\"https://www.checkpoint.com/cyber-hub/threat-prevention/what-is-hacktivism/\"> hacktivist</a> site. Transparency collective Distributed Denial of Secrets, which provides access to journalists, allowed Hatewatch to review the documents. Hatewatch then reviewed the documents on the LC website when it was back online. The documents’ metadata matched.</p>\n<p>The documents include LC’s boilerplate religious exemption requests for various faiths, students, employees and pastors.<strong> </strong>Hatewatch reviewed metadata from the files and public information suggesting that some of these requests were created by outside parties, including an employee of the SPLC-designated anti-LGBTQ hate group Alliance Defending Freedom (ADF) and Andrew Torba, <a href=\"https://www.splcenter.org/hatewatch/2019/06/19/gab-waited-days-remove-user-arrested-inciting-violence\"> the CEO of Gab</a>, a social media site popular with the hard right.<strong> </strong>The leak also shows the LC stored a trove of misinformation regarding COVID-19 vaccines.</p>\n<p>The LC is an <a href=\"https://www.splcenter.org/fighting-hate/extremist-files/group/liberty-counsel\"> anti-LGBTQ hate group</a>, but it works on various cultural issues popular with the hard right under the guise of religious activism. The U.S. Supreme Court cited an LC brief in its June 24 decision to end 50 years of abortion protection. The LC has also worked against vaccine mandates for decades.</p>\n<p>The LC did not respond to Hatewatch’s request for comment.</p>\n<h2>Boilerplate requests</h2>\n<p>The LC hosts boilerplate religious exemptions on its website for Catholic, Orthodox and Protestant Christians and Jewish people. Also, the leak contains broad employment and student exemption requests. Hatewatch examined metadata for these files, some of which appears to show who created the documents.</p>\n<p>Metadata lists Bridgett DeLapp as the creator of the student, employment and pastoral exemption requests.</p>\n<p>DeLapp worked as a digital designer at the White House during the Trump administration, according to government records. DeLapp attended Hillsdale College in Hillsdale, Michigan. In 2016, she also told the <em>Hillsdale Collegian</em>, the college newspaper, that she worked on the campaigns of two conservative Republican Michigan Supreme Court justices, Joan Larsen and David Viviano. Larsen was on Trump’s short list for Supreme Court vacancies, and Viviano is DeLapp’s uncle, she said. DeLapp also told the Hillsdale College Student Activities Board in 2018 that she was the digital director for the Michigan Republican Party.</p>\n<p>After the leaving the White House, DeLapp joined the <a href=\"https://www.splcenter.org/fighting-hate/extremist-files/group/alliance-defending-freedom\"> Alliance Defending Freedom</a>, an anti-LGBTQ hate group, as a campaign manager in February 2021, according to a data broker. DeLapp became ADF’s director for visual communications in August 2021.</p>\n<p>The metadata for the student exemption suggests DeLapp created the document while employed at ADF.</p>\n<p>Hatewatch asked the LC and ADF about the documents. Neither responded. Hatewatch was unable to find DeLapp’s contact information.</p>\n<p>The metadata for the Orthodox Christian request lists “John and Karen Seipp” as the creator. But the document’s origins likely lie in Gab, a social media site popular with the hard right.</p>\n<p>The document shares metadata with another trove of religious exemption requests on Gab. The metadata for the Gab files also contains the names John and Karen Seipp, but the “create” and “modify” dates in the Gab files precede those on the LC files, suggesting the LC retrieved some of its exemption requests from Gab.</p>\n<p>A Change.org petition calling for Michigan State University to end its mask-wearing and vaccine mandates features the text of the LC and Gab Orthodox exemption request. However, the petition lists Gab CEO Andrew Torba as the author. <a href=\"https://www.adl.org/blog/gab-ceo-andrew-torba-broadcasts-his-antisemitism-across-social-media-platforms\"> Torba espouses antisemitic</a>, far-right Christian Nationalist rhetoric.</p>\n<p>Torba did not respond to Hatewatch’s request for comment.</p>\n<h2>Religious reasoning</h2>\n<p>The Liberty Counsel discusses its reasoning for its anti-vaccine positions in a presentation titled “Vaccines and Religious Liberty.” LC chairperson Matthew Staver appears to have given the presentation on Oct. 22, 2020, less than two months before U.S. health officials <a href=\"https://www.supremecourt.gov/opinions/urls_cited/ot2021/21a90/21a90-1.pdf\"> administered the first COVID-19 vaccine</a> to the public.</p>\n<p>The document, which contains PowerPoint slides, starts with anti-abortion talking points and cites the chicken pox, hepatitis A and rubella vaccines, versions of which use fetal cells derived from aborted fetuses. Health officials say the fetuses were voluntarily aborted in the 1960s and no new abortions are required to produce these vaccines.</p>\n<p>The LC has since claimed in legal threats and in its boilerplate exemption forms that the use of fetal tissue in the testing of the Pfizer and Moderna vaccines constitutes a reasonable religious objection. Neither <a href=\"https://www.health.nd.gov/sites/www/files/documents/COVID%20Vaccine%20Page/COVID-19_Vaccine_Fetal_Cell_Handout.pdf\"> use</a> aborted fetal tissue in their development or production. However, researchers used fetal tissue to prove cells could accept the vaccines.</p>\n<p>The Catholic Church takes an anti-abortion stance, which has caused some Catholics to worry about receiving the vaccines. But the Catholic Church approved the use of COVID-19 vaccines in December 2020, Dr. Jason Eberl, a professor of healthcare ethics and director of the Albert Gnaegi Center for Health Care Ethics at Saint Louis University, told Hatewatch.</p>\n<p>The church’s Congregation for the Doctrine of the Faith (CDF), which Eberl described as “arguably the most important office in the Vatican other than the pope himself,” declared, “It’s permissible to … receive a vaccine despite this connection to abortion” to safeguard personal and public health.</p>\n<p>“Basically, what the CDF said is that any Catholic in good conscience can receive any of the approved or authorized COVID-19 vaccines,” Eberl said. He explained the December 2020 pronouncement followed a <a href=\"https://www.immunize.org/talking-about-vaccines/vaticandocument.htm\"> similar decision in 2005</a> from an advisory council called the Pontifical Academy for Life.</p>\n<p>“To my knowledge,” Eberl continued, “no church leader who’s in communion with the Vatican has definitively said that a Catholic cannot receive these vaccines.”</p>\n<p>Similarly, the <a href=\"https://www.goarch.org/-/holy-eparchial-synod-ccmmunique\"> Orthodox Church said</a>, “There is no exemption in the Orthodox Church for Her faithful from any vaccination for religious reasons, including the coronavirus vaccine.”</p>\n<p>Mainstream, anti-abortion, conservative Protestant organizations such as the Christian Medical &amp; Dental Associations (CMDA) have said the vaccines <a href=\"https://cmda.org/the-ethics-of-the-sars-cov-2-vaccines-revisited/\"> are ethically sound</a>.</p>\n<p>There are various <a href=\"https://pubmed.ncbi.nlm.nih.gov/12309928/\">views on abortion</a> among Jewish people. Generally, followers of Judaism hold life as sacred, but some <a href=\"https://www.ncjw.org/wp-content/uploads/2019/05/Judaism-and-Abortion-FINAL.pdf\"> do not consider a fetus alive</a> until birth has begun. However, even conservative movements such as the ultra-Orthodox Chabad movement <a href=\"https://www.chabad.org/library/article_cdo/aid/4980531/jewish/Can-I-Use-Vaccines-Made-From-Fetal-Tissue-or-Non-Kosher-Animals.htm\"> say it is fine to take the COVID-19 vaccine</a>.</p>\n<h2>Misinformation trove</h2>\n<p>Hatewatch’s review of the cache found the LC stored a trove of misinformation and mistruths regarding COVID-19 vaccines, many of which news media and health experts fought to dispel as misinformation.</p>\n<p>The LC files contain debunked papers about mRNA COVID-19 vaccines that osteopathic physician Joseph Mercola authored. <em>The New York Times</em> <a href=\"https://www.nytimes.com/2021/07/24/technology/joseph-mercola-coronavirus-misinformation-online.html\"> called</a> Mercola the “most influential spreader of coronavirus misinformation online” in a 2021 article.</p>\n<p>One LC-hosted Mercola publication titled “Might COVID Injections Reduce Lifespan?” claims evidence suggests the COVID vaccine shortened lifespans by years. Social media users posted similar misinformation “thousands” of times, according to Reuters. This claim is <a href=\"https://www.reuters.com/article/factcheck-mrna-vaccines/fact-check-there-is-no-evidence-mrna-vaccines-reduce-life-expectancy-or-cause-severe-health-issues-including-infertility-and-neuro-cognitive-problems-idUSL1N2MC0VF\"> false</a>.</p>\n<p>Another Mercola paper claims COVID-19 vaccines cause miscarriages. The paper said, “Getting the COVID shot during the first 20 weeks of pregnancy is extremely risky – the risk of miscarriage is anywhere between 82% and 91%.”</p>\n<p>The paper uses a faulty analysis of the Centers for Disease Control and Prevention’s (CDC) Vaccine Adverse Effects Reporting System (VAERS) database, where people can report side effects they experience after vaccination.</p>\n<p>Studies disprove these claims. One <a href=\"https://www.nejm.org/doi/full/10.1056/NEJMc2113891\">study</a> showed the risk of miscarriage following a COVID-19 vaccination during the first 20 weeks of pregnancy was roughly 18%, well within the expected risk range.</p>\n<p>Similar misinformation appears in religious exemption requests. The Jewish request document contains similarly misleading claims about the VAERS database.</p>\n<p>VAERS does not prove causation for side effects. According to <a href=\"https://www.muhealth.org/our-stories/scary-reports-deaths-following-covid-19-vaccination-arent-what-they-seem\"> MU Health Care</a>, part of the University of Missouri, “If a 90-year-old nursing home resident got the vaccine and then died days, weeks or even months later of another ailment, the resident’s death would be reported to VAERS.”</p>\n<p>Further, all VAERS reports are unverified.</p>\n<p><em>Editor’s note: Megan Squire contributed to this reporting.</em></p>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-byline field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Creede Newton</div>\n      </div>\n</div>\n<div class=\"field field-name-field-addthis field-type-addthis field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><div class=\"addthis_toolbox addthis_default_style  \" addthis:title=\"Liberty Counsel Used Documents From Gab, ADF for Its Anti-COVID Vaccine Campaign - Southern Poverty Law Center\" addthis:url=\"https://www.splcenter.org/hatewatch/2022/11/01/liberty-counsel-used-documents-gab-adf-its-anti-covid-vaccine-campaign\"><a href=\" \" class=\"addthis_button_facebook\" aria-label=\"Facebook: Share this page\"></a>\n<a href=\" \" class=\"addthis_button_twitter\" aria-label=\"Twitter: Share this page\"></a>\n</div>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-publish-date field-type-date field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><span class=\"date-display-single\">November 01, 2022</span></div>\n      </div>\n</div>",
  "pubDate": "Tue, 01 Nov 2022 14:38:25 +0000",
  "dc:creator": "chris.heller_1541",
  "guid": "17204 at https://www.splcenter.org"
}