{
  "id": "tag:blogger.com,1999:blog-5547907074344788039.post-340901294506403627",
  "published": "2015-06-12T20:23:00.000-07:00",
  "updated": "2015-06-12T20:23:38.621-07:00",
  "title": "Data is not the new middle manager",
  "content": "<div><div>In April, the Wall Street Journal published article that claimed, as its title, \"<a href=\"http://www.wsj.com/articles/data-is-the-new-middle-manager-1429478017\">data is the new middle manager</a>\" and, further, in the opening paragraph set out this bold claim:</div><div><br /></div><div><i>Firms are keeping head counts low, and even eliminating management positions, by replacing them with something you wouldn’t immediately think of as a drop-in substitute for leaders and decision-makers: data.</i></div><div><br /></div><div>As we say in England: codswallop! (Yes, it is in the dictionary. Think \"Baloney\" or \"BS.\") Data are replacing leaders and leadership? Really?</div><div><br /></div><div>As you can imagine, it caused a bit of a stir within the data science field at the time. I've heard a few people mention it since, one of whom who called it a \"useful meme,\" but I simply can't believe that basic premise. I strongly believe that</div><div><br /></div><div><ul><li>Humans make decisions.</li><li>Algorithms make decisions.</li><li>Data do not and cannot make decisions.&nbsp;</li></ul></div><div><br /></div><div>The article has bothered for me a couple of months, simmering away in the back of my mind. Part of the reason is that I agreed with much of the article in terms of the value of data, data tools, broad data access, and operational decision-making pushed out to the fringes. However, all tolled, the arguments presented didn't provide evidence to back up the article's major, and erroneous, claim.</div></div><div><br /></div><div>It is true that</div><ul><li>Data has indeed become more readily captured and more broadly accessible within orgs. That's a good thing.</li><li>Data tools for reporting, analysis, and data discovery are better, cheaper, and easier&nbsp;to use than ever before. That's a good thing.</li><li>Operational and tactical (but not strategic) decision-making can, or is, being pushed down to the front lines of orgs. Transparency via data helps achieve that. That's a good thing.</li></ul><div>However, all these points don't lend weight that data is the new middle manager. I can’t ask data, numbers, a question: hey 6, should we switch shipping carriers? 42, you have all the answers, how much should I increase my ad spend budget?&nbsp;As Scott Berken puts it, \"<a href=\"http://scottberkun.com/2013/danger-of-faith-in-data\">Data&nbsp;is&nbsp;non&nbsp;conscious:&nbsp;it&nbsp;is&nbsp;merely&nbsp;a&nbsp;list&nbsp;of&nbsp;stupid,&nbsp;dead&nbsp;numbers</a>\".</div><div><br /></div><div>Data is of course a key ingredient here but its role is to <i>augment</i> the decision maker: humans or machines. The latter is especially interesting because I would expect its role to increase over time as we gather more data and feed it to ever better machine learning techniques on ever more powerful platforms.&nbsp;As I argue in <a href=\"http://shop.oreilly.com/product/0636920035848.do\">my book</a>, if you have a sufficiently stable or predictable environment and a sufficiently good algorithm that you <i>can</i>&nbsp;in fact make decisions based on data alone, without human intervention, then this is called <i>automation</i>, a good example of which just in time replenishment in supply chains. You should be doing that where possible.&nbsp;That can eliminate bodies, allows quicker, more consistent, and less emotion-based responses etc. However, this is not what is being claimed. The claim is that management positions are being eliminated because data are now acting as a middle manager, making decisions. </div><div><br /></div><div>The author claims that the cost of data tools, once so expensive that companies could only provide them to managers, has decreased significantly such that they can now be more democratized, accessible to the front lines. That empowers those <i>people</i> to make informed operational and tactical decisions.&nbsp;Such tools and data access can also facilitate coordination among teams. One can keep abreast of what else is happening in the company and help <i>people</i> make decisions accordingly.&nbsp;However, I don't think either of these eliminate the need for true leadership, people whose job is to think strategically and to make strategic decisions, people whose job it is to inspire, align, and rally the troops. If managers are just a conduit for information and serve a coordination role, that is neither leadership nor decision making. </div><div><br /></div><div>Better data processing tools can indeed eliminate bodies, specifically data pullers and crunchers, if instead you engender a self-service culture and everyone has the tools, skills, and access that they need. However, these bodies are not leaders or decision makers.</div><div><br /></div><div>Organizations should be leveraging data as a strategic asset as much as possible but, ultimately, you need people to release its value.&nbsp;</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Carl Anderson",
    "uri": "http://www.blogger.com/profile/11930448254473684406",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}