{
  "id": "yt:video:bqH66rUT_LA",
  "yt:videoId": "bqH66rUT_LA",
  "yt:channelId": "UC5miyvhPsWWyfTulnJ43koQ",
  "title": "BBH Big Boo's Balcony 0xA Idea for Potential 1h Strat",
  "link": "",
  "author": {
    "name": "UncommentatedPannen",
    "uri": "https://www.youtube.com/channel/UC5miyvhPsWWyfTulnJ43koQ"
  },
  "published": "2022-09-11T19:37:57+00:00",
  "updated": "2022-09-11T21:58:54+00:00",
  "media:group": {
    "media:title": "BBH Big Boo's Balcony 0xA Idea for Potential 1h Strat",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "I show an idea for a potential 1 hour strat for collecting Big Boo's Balcony 0xA. However, I can't find a way to make it work due to Mario always sliding off the roof. Note that I used hacks to place the scuttlebugs into their starting positions.\n\nThe original strat for this was 13 hours (https://youtu.be/OLmxy5cYfdk), which involved moving the scuttlebugs into the bookshelf room. Later, I showed an improvement that did this in 3 hours (https://youtu.be/xd9OFhnyiP8), which involved bouncing on the scuttlebugs as they fell down in order to get onto the roof using a misalignment. The main suboptimal aspect of that strat is that raising the scuttlebugs involves travelling through some doors in the mansion, making it slow. If we could instead raise the scuttlebugs solely within the foyer, then it's much faster (about 1 hour). However, this means that the scuttlebugs must be nearer to the front door of the mansion, and so not close to the misalignment. Without the misalignment though, we can't land on the roof... unless we use a star dance clip.\n\nBy using a star dance clip, we can ascend a tiny bit higher, allowing Mario to get onto the roof of the mansion. However, part of doing a star dance is Mario facing directly towards the camera, causing Mario to face downhill and do a butt slide as soon as the star dance is done. However, butt sliding isn't good here, because it results in Mario sliding off with no ability to do anything else. On the other hand, if we were able to face uphill and do a stomach slide when the star dance ended, then we'd have access to diving once Mario slid off the roof, which usually lets us grind on the edge and ultimately frame walk up. I've looked into various ways to get around this, but none of them have worked:\n(1) I tried turning the camera so that Mario faces uphill on the roof. However, the camera is blocked by the mansion's wall, and so I wasn't able to get the camera to be north of Mario when he faces it.\n(2) I tried locking the camera in place. However, the camera doesn't remain locked during the star-appearing cutscene.\n(3) I tried butt sliding into the platform that Big Boo is on. While Mario can bonk once on this and remain on the roof during the bonk, he then slides off right afterwards.\n(4) I tried having Big Boo come over and knock into Mario to change his angle. However, there doesn't appear to be enough time for Big Boo to come all the way over.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}