{
  "title": "#495: Taste-Testing Harry Potter Themed Drinks, 2020 Year in Review",
  "link": "https://audioboom.com/posts/7755827",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3325,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>As 2020 comes to a close, we're so thankful to have all of you! Happy Holidays and Happy New Year!</li>\n<li>To celebrate the holidays, the hosts each pick <a href=\"https://www.buzzfeed.com/fjelstud/20-alcoholic-beverages-inspired-by-the-harry-potte\">a Harry Potter-themed cocktail</a> of their choice and taste test live on air!</li>\n<li>See who comes out the winner as Andrew, Eric, Laura and Micah battle it out for the title of <a href=\"https://apps.apple.com/il/app/heads-up-best-charades-game/id623592465\">Heads Up</a> champ!</li>\n<li>Main Discussion: 2020 Year in Review. From Grindelwald's recasting to J.K. Rowling's tweets to Hogwarts Legacy and Harry Potter at Home, we reflect on the most notable Potter moments of 2020</li>\n<li>And on top of it all, we celebrated our 15th anniversary!</li>\n<li>Muggle Mail covers some thoughts on our gizmos and gadgets episode, a defining chapter for Molly Weasley and more!</li>\n<li>Chicken Soup For The MuggleCast Soul</li>\n<li>Quizzitch: The Fizzing Whizbee is said to contain parts of which Fantastic Beast?</li>\n<li>This week's episode is sponsored by ThirdLove (visit <a href=\"http://www.thirdlove.com/mugglecast\">ThirdLove.com/mugglecast</a> for 10% off your first purchase), <a href=\"https://www.literati.com/mugglecast\">Literati</a> (get 25% off your first two orders!) and <a href=\"http://www.betterhelp.com/mugglecast\">BetterHelp</a> (Receive 10% off your first month).</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like Bonus MuggleCast, where this week we look ahead and discuss what to expect for the Wizarding World in 2021!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 22 Dec 2020 12:00:00 +0000",
  "guid": "tag:audioboom.com,2020-12-21:/posts/7755827",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}