{
  "title": "A Survey of Augmented Piano Prototypes: Has Augmentation Improved Learning Experiences?. (arXiv:2208.09929v3 [cs.HC] UPDATED)",
  "link": "http://arxiv.org/abs/2208.09929",
  "description": "<p>Humans have been developing and playing musical instruments for millennia.\nWith technological advancements, instruments were becoming ever more\nsophisticated. In recent decades computer-supported innovations have also been\nintroduced in hardware design, usability, and aesthetics. One of the most\ncommonly digitally augmented instruments is the piano. Besides electronic\nkeyboards, several prototypes augmenting pianos with different projections\nproviding various levels of interactivity on and around the keyboard have been\nimplemented in order to support piano players. However, it is still not\nunderstood if these solutions are indeed supporting the learning process. In\nthis paper we present a systematic review of augmented piano prototypes\nfocusing on instrument learning, which is based on the four themes derived from\ninterviews of piano experts to better understand the problems of teaching the\npiano. These themes are: (i) synchronised movement and body posture, (ii)\nsight-reading, (iii) ensuring motivation, and (iv) encouraging improvisation.\nWe found that prototypes are saturated on the synchronisation themes, and there\nare opportunities for sight-reading, motivation, and improvisation themes. We\nconclude by presenting recommendations on augmenting piano systems towards\nenriching the piano learning experience as well as on possible directions to\nexpand knowledge in the area.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Deja_J/0/1/0/all/0/1\">Jordan Aiko Deja</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Mayer_S/0/1/0/all/0/1\">Sven Mayer</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Pucihar_K/0/1/0/all/0/1\">Klen &#x10c;opi&#x10d; Pucihar</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kljun_M/0/1/0/all/0/1\">Matja&#x17e; Kljun</a>"
}