{
  "title": "Religion as a Hybrid War Weapon to Achieve Russia’s Geopolitical Goals",
  "link": "https://jamestown.org/religion-as-a-hybrid-war-weapon-to-achieve-russias-geopolitical-goals/",
  "dc:creator": "web1983",
  "pubDate": "Fri, 30 Jul 2021 16:58:11 +0000",
  "category": "Uncategorised",
  "guid": "https://jamestown.org/?p=90196",
  "description": "<p>On July 28, Ukrainian Orthodox Christians celebrated the 1,033rd anniversary of the Baptism of Kyivan Rus—a remarkable annual event for Ukrainian history and another reason for Russian President Vladimir Putin’s political speculations. After the Ecumenical Patriarch of Constantinople, Bartholomew I, signed the Ukrainian Orthodox Church tomos in 2019, granting it autocephaly—independence from the Russian Orthodox Church (see EDM, July 26, &#8230; <a href=\"https://jamestown.org/religion-as-a-hybrid-war-weapon-to-achieve-russias-geopolitical-goals/\" class=\"more\"></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/religion-as-a-hybrid-war-weapon-to-achieve-russias-geopolitical-goals/\">Religion as a Hybrid War Weapon to Achieve Russia’s Geopolitical Goals</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n",
  "content:encoded": "<p>On July 28, Ukrainian Orthodox Christians celebrated the 1,033<sup>rd</sup> anniversary of the Baptism of Kyivan Rus—a remarkable annual event for Ukrainian history and another reason for Russian President Vladimir Putin’s political speculations. After the Ecumenical Patriarch of Constantinople, Bartholomew I, signed the Ukrainian Orthodox Church <em>tomos </em>in 2019, granting it <em>autocephaly</em>—independence from the Russian Orthodox Church (see <a href=\"https://jamestown.org/program/ukrainian-orthodox-church-seeks-independence-from-russian-patriarchate/\">EDM</a>, July 26, 2018; <a href=\"https://www.rferl.org/a/ukrainian-orthodox-church-marks-one-year-of-independence-from-moscow/30393633.html\">RFE</a>, January 23, 2020)—experts warned that Moscow would double its efforts to weaponize religious issues as an element of its “hybrid war” against Ukraine  (<a href=\"https://warsawinstitute.org/ukraine-vs-russia-religion-weapon/\">Warsawinstitute.org</a>, January 31, 2019).</p>\n<p>In his recent article “On the Historical Unity of Russians and Ukrainians” (<a href=\"http://kremlin.ru/events/president/news/66181\">Kremlin.ru</a>, July 12), Putin appeals to “Orthodox Christianity unity” in nearly every paragraph, with a special emphasis on Kyivan Prince Vladimir the Great’s adoption of the Christian faith in 988 as a symbol of kinship. Moreover, the fact of the Kyivan Rus’ ruler being baptized in Chersonesus (today, Sevastopol, Crimea) has been used by Putin as a justification for the occupation of Crimea, namely “to unify the sacred lands of the Slavic nations’ cradle—Kyivan Rus” (<u><a href=\"https://www.pnp.ru/social/kak-yubiley-kreshheniya-rusi-otmetyat-tam-gde-ona-krestilas.html\">Parlamentskaya Gazeta</a></u>, July 27, 2018). Yet not only is the association of the terms “Rus” and “Russia&#8221; historically erroneous (<a href=\"https://fakeoff.org/history/pochemu-rossiyane-ne-russkie-a-kievskaya-rus-ne-rossiya\">Fakeoff.org</a>, February 18, 2015; <a href=\"https://www.radiosvoboda.org/a/30548881.html#:~:text=%D0%A2%D0%B5%D1%80%D0%BC%D1%96%D0%BD%20%D0%A0%D0%BE%D1%81%D1%96%D1%8F%20%E2%80%93%20%D1%86%D0%B5%20%D0%B3%D1%80%D0%B5%D1%86%D1%8C%D0%BA%D0%B8%D0%B9%20%D0%B2%D1%96%D0%B4%D0%BF%D0%BE%D0%B2%D1%96%D0%B4%D0%BD%D0%B8%D0%BA,%D0%BF%D0%B5%D1%80%D0%B5%D0%B2\">RFE</a>, April 12, 2020), but the fact of Russia’s adoption of Kyivan Rus Baptism Day in 2010—only two years after Ukrainian erstwhile president Viktor Yushchenko’s 2008 decree establishing the holiday—raises questions about Russia’s actual intentions (<a href=\"https://zakon.rada.gov.ua/cgi-bin/laws/main.cgi?nreg=668%2F2008#Text\">Rada.gov.ua</a>, July 25, 2008; <a href=\"http://kremlin.ru/events/president/news/7913\">Kremlin.ru</a>, June 1, 2010).</p>\n<p>According to the most recent Razumkov Analytical Center poll, 34 percent of Ukrainians identify themselves with the autocephalous Orthodox Church of Ukraine of the Kyiv Patriarchate (UOC-KP), with only 13.8 percent of respondents leaning toward the Ukrainian Orthodox Church of the Moscow Patriarchate (UOC-MP). In turn, 27.6 percent of Ukrainians consider themselves Orthodox but not belonging to any specific church, 9.3 percent say they are Christian but not Orthodox, 8.8 percent do not affiliate with any religion at all, 5.6 percent claim to be atheists, and 0.6 percent lean toward other religions—the predominant views among youth who despise the interfaith conflicts inside the country (<a href=\"https://razumkov.org.ua/napriamky/sotsiologichni-doslidzhennia/konfesiina-ta-tserkovna-nalezhnist-gromadian-ukrainy-sichen-2020r\">Razumkov.org.ua</a>, February 3, 2020).</p>\n<p>Therefore, the effectiveness of religion as the Kremlin’s hybrid war weapon against Ukraine, especially over the last several years, is questionable. Membership in the Moscow-affiliated Orthodox Church has been persistently dropping among Ukrainian society since the start of the war with Russia. The UOC-MP has been repeatedly rebuked and criticized for not officially condemning (and instead even supporting) Russia’s occupation of Crimea and eastern Ukrainian regions (see <a href=\"https://jamestown.org/program/ukrainian-orthodox-church-seeks-independence-from-russian-patriarchate/\">EDM</a>, July 26, 2018). Since the beginning of Russia’s military intervention in 2014, pro-Moscow priests have been caught leading Russian ideological campaigns such as the notorious “The Gift of the Magi” (<em>“Dary volkhvov”</em>) operation. In February of 2014, the Gift of the Magi, a holy Orthodox golden adornment that was supposed to be transferred from Greece to Kyiv, ended up in Crimea under the guard of Igor Girkin—a separatist leader later responsible for the catastrophic shootdown of Flight MH-17 over Donbas (<a href=\"https://www.interpretermag.com/evidence-of-separatists-possession-of-buk-system-before-downing-of-mh17/\">The Interpreter</a>, July 27, 2014). The so-called “priests” subsequently gathered crowds of Crimean citizens to “observe the holy piece,” during which time the public was openly encouraged to pray for Crimea’s integration into Russia amid uncertainty caused by the Revolution of Dignity in Ukraine (<a href=\"https://www.radiosvoboda.org/a/okupacia-krimu-moskovsky-patriarkhat/31122625.html\">RFE</a>, February 27). Large numbers of Ukrainians have also been repelled by mandatory prayers within UOC-MP parishes for church leader Patriarch Kirill of Moscow—a close ally of Putin—as well as numerous incidents of local UOC-MP clerics refusing to conduct funeral services for Ukrainian soldiers killed on the front lines (<a href=\"https://www.religion.in.ua/news/ukrainian_news/26535-na-zhitomirshhine-svyashhennik-upc-otkazyvaetsya-otpevat-pogibshix-ukrainskix-soldat.html\">Religion.in.ua</a>, August 4, 2014).</p>\n<p>The Kremlin’s religious propaganda is not limited to internal affairs, however. After Patriarch Kirill’s letter to Pope Francis, United Nations Secretary General Antonio Guterres, German Chancellor Angela Merkel and French President Emmanuel Macron complaining of the “Moscow-backed Church’s oppression by the Ukrainian government” (<a href=\"https://mospat.ru/ru/news/46863/\">Mospat.ru</a>, December 14, 2018), a wave of Russian Orthodox religious leaders added to this onslaught of disinformation. Thus, pro-Russian Bishop Gedeon complained to the US Department of State about his deportation from Ukraine and alleged abuses leveled against the UOC-MP by Kyiv (<u><a href=\"https://spzh.news/ru/news/60189-jepiskopa-gedeona-priglasili-vystupity-v-oon-i-kongresse-ssha\">Spzh.news</a></u>, February 16, 2019). This was followed by another bishop, Viktor Kotsaba, composing a letter with similar charges addressed to the European Parliament (<a href=\"https://risu.ua/yepiskop-upc-mp-skarzhitsya-deputatam-yevroparlamentu-na-goninnya-ta-prosit-pro-osobistu-zustrich_n102966\">Risu.ua</a>, February 28, 2020). None of these appeals were taken into consideration by the West—another failure of Russia’s “religious” policy.</p>\n<p>Of course, all such complaints to the West about purported attacks on the Russian Church in Ukraine disregard or draw attention away from actual abuses occurring inside Russia. Indeed, just a year before Patriarch Kirill addressed the Normandy Format representatives about what he claimed were infringements of human rights in Ukraine (<a href=\"http://www.patriarchia.ru/db/text/4893992.html\">Patriarchia.ru</a>, May 17, 2017), he had explicitly referred to the concept of human rights as a “global heresy” (<a href=\"https://www.interfax.ru/russia/499346\">Interfax</a>, March 20, 2016). And later, he openly demonized the LGBTQ+ communities in both Ukraine (<a href=\"https://dumskaya.net/news/podryvaet-reputatciyu-odessy-greko-katoliki-vmes-102172/\">Dumskaya.net</a>, August 20, 2019) and Georgia, mainly amid recent violent protests in the latter (<u><a href=\"https://www.kommersant.ru/doc/4890499\">Kommersant</a></u>, July 8, 2021). Moreover, while promoting Russia as a supposed luminary of Orthodox Christianity and a holy savior around the world, Moscow ignores the persecutions of other religious groups in its “multiculturally friendly” state (<a href=\"https://www.hrw.org/news/2020/01/09/russia-escalating-persecution-jehovahs-witnesses\">Hrw.org</a>, January 9, 2020; <a href=\"https://www.crisisgroup.org/russian-origin-muslim-diaspora-ripple-effects-conflict\">Crisisgroup.org</a>, May 12, 2021), including the intimidation of Crimean Tatar Muslims in occupied Crimea (<a href=\"https://www.state.gov/reports/2020-report-on-international-religious-freedom/ukraine/crimea/\">State.gov</a>, May 12).</p>\n<p>Because the Moscow Patriarchate has lost significant support among progressive Ukrainian citizens, Putin’s continuing line of “religious” attack is now arguably targeted toward only two main groups: the country’s remaining UOC-MP parishioners, such as those who gathered on Tuesday in the Ukrainian capital (despite COVID-19 restrictions) for a Kyivan Rus Baptism Day procession (<a href=\"https://hromadske.ua/posts/tisyachi-viryan-upc-mp-berut-uchast-u-hresnij-hodi-do-dnya-hreshennya-kiyivskoyi-rusi-foto\">Hromadske.ua</a>, July 27), as well as Russian devotees willing to fight a “holy war” in Donbas (<a href=\"https://www.bbc.com/news/magazine-30518054\">BBC</a>, December 18, 2014). While the UOC-MP’s influence has continued to decline sharply since 2014, mainly due to the Church’s obsolete practices and notorious examples of disrespect for Ukraine’s modern aspirations, the danger of Russian “religiously” minded militants remains. Therefore, Ukrainian officials will need to be on guard for possible outbreaks of new clashes in the occupied territories and the rest of the country that coincide with the upcoming visit of Bartholomew I of Constantinople to Ukraine—another great outrage for the Kremlin (<a href=\"https://www.radiosvoboda.org/a/news-epifanij-vselenskyj-patriarx-vizyt/31221848.html\">RFE</a>, April 25).</p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/religion-as-a-hybrid-war-weapon-to-achieve-russias-geopolitical-goals/\">Religion as a Hybrid War Weapon to Achieve Russia’s Geopolitical Goals</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n"
}