{
  "title": "Biden promises to shut US coal power plants",
  "link": "https://www.rt.com/news/565975-biden-democrats-coal-power/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565975-biden-democrats-coal-power/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63657ad92030271d4f6e00fd.jpg\" /> US President Joe Biden doubled down on anti-coal policies ahead of the midterm election, promising wind and solar power instead <br/><a href=\"https://www.rt.com/news/565975-biden-democrats-coal-power/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The US president wants to see “wind and solar” replace coal-fueled power plants</strong></p>\n            \n                        \n            <p>Speaking at an event in California on Friday, US President Joe Biden said his government intended to shut down coal-fueled power plants <em>&ldquo;all across America&rdquo;</em> and replace them with wind- or solar-powered generators.</p>\n<p>Biden was in San Diego as part of a West Coast trip to fundraise for Democrats ahead of next week&rsquo;s midterm elections. During a speech on Friday, the president reminisced about visiting a former coal power plant in Massachusetts, which had been repurposed to wind power generation. He said&nbsp;it had been done because to continue using coal was just too expensive &ndash; presumably due to the costs imposed by government regulations.</p>\n<p><strong></strong><em>&ldquo;We&rsquo;re gonna be shutting these plants down all across America, and having wind and solar,&rdquo;</em> Biden told the audience.</p>\n\n            <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Biden: “We’re gonna be shutting these [coal] plants down all across America, and having wind and solar.”<br><br> <a href=\"https://t.co/MGM2oYLRxm\">pic.twitter.com/MGM2oYLRxm</a></p>&mdash; The Post Millennial (@TPostMillennial) <a href=\"https://twitter.com/TPostMillennial/status/1588623447046823936?ref_src=twsrc%5Etfw\">November 4, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n    \n\n<p>Biden&rsquo;s remarks came during an event at Viasat Inc., intended to highlight the <em>&ldquo;CHIPS and Science Act&rdquo;</em> his government enacted in August. The bill set aside around $280 billion for domestic microchip manufacturing.&nbsp;</p>\n<p>According to Reuters, Biden&rsquo;s trip to the manufacturing facility is <em>&ldquo;aimed at bolstering support for Democrats, who face a real risk of losing their razor-thin majorities in the US Congress.&rdquo;</em> California is a Democrat stronghold with little chance of an upset in the upcoming midterms, however.</p>\n<p><strong></strong>The president&rsquo;s promise of putting coal miners and power-plant workers out of jobs backfired almost instantly, with opposition Republicans <a href=\"https://twitter.com/RNCResearch/status/1588622773534052352\" target=\"_blank\" rel=\"noopener noreferrer\">sharing</a> the clip on Twitter and other social media platforms.</p>\n<p>Biden has doubled down on the push to shut down industries that his government sees as contributing to global warming, pledging to cut US carbon emissions in half by 2030. This is proceeding regardless of his other stated goal of racial <em>&ldquo;equity.&rdquo;</em> Last month, Democrats running New Mexico closed down a coal mine and the nearby power plant, eliminating hundreds of jobs in the already impoverished Navajo country, AP <a href=\"https://www.daily-times.com/story/news/local/navajo-nation/2022/10/02/san-juan-county-communities-feel-the-impacts-of-coal-plant-closure/69533460007/\" target=\"_blank\" rel=\"noopener noreferrer\">reported</a>.</p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 21:29:22 +0000",
  "dc:creator": "RT"
}