{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-5167912231335591442",
  "published": "2022-10-06T16:49:00.003-05:00",
  "updated": "2022-10-06T16:58:00.468-05:00",
  "category": [
    "",
    "",
    ""
  ],
  "title": "UK finance fable update",
  "content": "<p>Update to my <a href=\"https://johnhcochrane.blogspot.com/2022/09/a-familiar-finance-fable-in-uk-bonds.html\" target=\"_blank\">previous post on the UK treasury imbrogli</a>o:&nbsp;</p><div><a href=\"https://committees.parliament.uk/publications/30136/documents/174584/default/\" target=\"_blank\">The Bank of England explains,</a>&nbsp;saying about as much as I did. Pension funds levered up, lost money when treasury prices fell, needed to post collateral, and then started selling en masse. The explanation starts with lovely central-bankerese (my italics):&nbsp;</div><blockquote>Against the backdrop of an<i>&nbsp;unprecedented&nbsp;</i>[really? Literally never?]&nbsp;<i>repricing</i>&nbsp;[translation: fall in prices] in UK assets, the Bank announced a temporary and targeted intervention on Wednesday 28 September to&nbsp;<i>restore market functioning&nbsp;</i>in long-dated government bonds and&nbsp;reduce risks from <i>contagion to credit conditions&nbsp;</i>for UK households and businesses.&nbsp;</blockquote><p>It goes on to a hilarious graph to explain how you lose money when you borrow to lever up a portfolio:</p><div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgAI1cFcZcjac6FBY6qdOg1nw5IGU9Mz-v1p2PeNE_VGqmY7CHavRLY_PBmLjAvLT9SWO98ZxbjiUYs9PZuFPOt8aT5CzPilvuCJYXTMHCFAOKFIqcW5Aak7g9LZFk1wknONctBKKgl-hP6S3_UpPn6OpmORmb7LftRxID1nQZziVnUTpWwPwZJiR4/Screen%20Shot%202022-10-06%20at%202.14.03%20PM.png\" style=\"display: block; padding: 1em 0px; text-align: center;\"><img alt=\"\" border=\"0\" data-original-height=\"0\" data-original-width=\"0\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgAI1cFcZcjac6FBY6qdOg1nw5IGU9Mz-v1p2PeNE_VGqmY7CHavRLY_PBmLjAvLT9SWO98ZxbjiUYs9PZuFPOt8aT5CzPilvuCJYXTMHCFAOKFIqcW5Aak7g9LZFk1wknONctBKKgl-hP6S3_UpPn6OpmORmb7LftRxID1nQZziVnUTpWwPwZJiR4/s600/Screen%20Shot%202022-10-06%20at%202.14.03%20PM.png\" width=\"600\" /></a></div> Why is this so funny? Notice on the left hand side a gap between assets and liabilities, yet in the fourth bar there is a positive \"capital\" bar. &nbsp;Accounting 101, assets = liabilities, including capital. I guess UK regulations operate differently.&nbsp;<div><br /></div><div>But enough fun, let's get to the point. In answer to my question, roughly \"you're supposed to be this great gargantuan regulator, how could you miss something so simple?,\" the bank offers, deep in the report, this:&nbsp;</div><div><blockquote><div>The FPC has previously identified underlying vulnerabilities in the system of market- based finance, a number of which were exposed in the ‘dash for cash’ episode in March 20202. The Bank and the FPC strongly support and engage with the important programme of domestic and international work to understand and, where necessary, address those vulnerabilities.</div></blockquote><blockquote><p>The FPC conducted an assessment of the risks from leverage in the non-bank financial system in 2018, and highlighted the need to monitor risks associated with the use of leverage by LDI funds.&nbsp;</p></blockquote><div>It's so nice you've been studying this. But then double, how did this happen?&nbsp;<span><a name='more'></a></span></div><blockquote><div>Whilst the PRA regulates bank counterparties of LDI funds, the Bank does not directly regulate pension schemes, LDI managers or LDI funds. Pension schemes and LDI managers are regulated by The Pensions Regulator (TPR) and the Financial Conduct Authority (FCA). LDI funds themselves are typically based outside the UK. In this context, given our financial stability mandate, and as stated in the FPC’s November 2018 Financial Stability Report, the Bank has worked with other domestic regulators – including TPR and the FCA – on enhancing monitoring of the risks. That included working with TPR on a survey of DB pension schemes in 2019, and prompting work to improve DB pension liquidity risk management. Given that LDI funds are largely not based in the UK, this also underlines the importance of work on this topic being pursued internationally.</div></blockquote><div>In short, &nbsp;\"where is your homework?\" \"Jimmy was supposed to write up the lab report.\" Really, though, if you were working on it, and knew about it, it's doubly shocking that nobody did anything about it.&nbsp;</div><blockquote><div>... it should also be recognised that the scale and speed of repricing leading up to Wednesday 28 September far exceeded historical moves, and therefore exceeded price moves that are likely to have been part of risk management practices or regulatory stress tests. &nbsp;&nbsp;</div></blockquote><blockquote><div>The 30 year nominal gilt yield rose by 160 basis points in just a few days, having only had a yield of around 1.2% at the start of the year. On Wednesday 28 September the intraday range of the yield on 30 year gilts of 127 basis points was higher than the annual range for 30 year gilts in all but 4 of the last 27 years. In the 2018 assessment noted above, the FPC assessed the capacity of the biggest derivatives users among UK pension schemes to cover the posting of variation margin calls on OTC interest rate derivatives from up to a 100 basis point instantaneous increases in rates across all maturities and in all currencies. Other tests and risk management practices have similarly assumed a maximum of a 100 basis point move in such a short time period.&nbsp;</div></blockquote><div>In short, once again \"it's a 100 year flood that nobody could have imagined.\" The sort of flood that seems to happen about once a year. And 100 basis points is an awfully round number. &nbsp;</div><blockquote><div>There has been significant progress, both domestically and internationally, on the regulation and monitoring of the non-bank sector in recent years. Much of this has been led by the Financial Stability Board, which set out its analysis of risks relating to non- banks and a program of work last year and is due to report on next steps in November. &nbsp;Through the work of the FPC and the Bank more widely, as well as that of the FCA, the UK has been actively engaging with this programme. This episode underlines the necessity of this work leading to effective policy outcomes.</div></blockquote><div>The eternal call for more research.&nbsp;</div><div><br /></div><div>A last thought. If some people are clearly selling in distress, why are others not buying? Why is your fire sale not my buying opportunity. Well, imagine if every Saturday, when garage sales start at 9 am, the Fed or Bank of England swoops in and buys up all the good stuff at inflated prices. There is then no point in cruising the garage sales any more, and then every time someone wants to sell anything the Fed or Bank of England <i>has </i>to swoop in and buy.&nbsp;</div><div><br /></div><div>Why do Chase, Citi, Goldman Sachs, or multi-strategy &nbsp;hedge funds not keep some spare balance sheet capacity around to swoop in and buy in these events? Well, knowledge that the Fed and Bank of England will always swoop in first and cut off the profits might well be a part of the answer. &nbsp;</div><div><br /></div><div>I repeat. The model that financial institutions can lever up, but omniscient regulators will foresee risks, is irretrievably broken. If you need more research on this one, we'll never get there. We are firmly in the regime of lever to your heart's content, the Fed and BoE, and thus taxpayers, will offer a free put option on losses. Until, someday soon, they too run out of bailout money.&nbsp;</div><div>&nbsp;</div><div>I should change the tone of this post -- let us not blame the BoE and Fed. They are smart, they are human, they are doing their best. It's just that the best that these great people can do, with 15 years since 2008 to do it, is not enough for this most simple task. And woefully inadequate for the much larger task they have set themselves.&nbsp;</div><div><br /></div><div><br /></div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 18
}