{
  "title": "WOF 104: Sports and Spirituality",
  "pubDate": "Mon, 04 Dec 2017 10:00:00 +0000",
  "guid": "3ae3743ccf05cfe59dab82647ddbafa6",
  "link": "http://wordonfireshow.com/episode104/",
  "itunes:image": "",
  "description": "<p>If you've listened to any number of Bishop Robert Barron's homilies or lectures, you've likely heard him use sports analogies to create a vision of the spiritual life. In this episode of the Word On Fire Show, Bishop Barron discusses how the world of sports and athleticism can help us grow in faith and understanding. The listener question asks about leisure and the Sabbath.</p> <h3><strong>Topics Discussed</strong></h3> <ul> <li><strong>0:05</strong> - Introduction</li> <li><strong>1:30</strong> - What is Bishop Barron's background with sports?</li> <li><strong>4:00</strong> - Why does the culture hold sports in such high regard up and down the ages?</li> <li><strong>6:00</strong> - How do the rules in sports relate to religion?</li> <li><strong>10:30</strong> - What do coaches teach us about real love?</li> <li><strong>15:00</strong> - How do the rigors of sports offer insights about the rigors of the spiritual life?</li> <li><strong>20:00</strong> - Does athleticism and fitness ever do harm to the spirit?</li> <li><strong>22:47</strong> - Listener Question: Why is leisure important on the Sabbath?</li> </ul>",
  "content:encoded": "<p>If you've listened to any number of Bishop Robert Barron's homilies or lectures, you've likely heard him use sports analogies to create a vision of the spiritual life. In this episode of the Word On Fire Show, Bishop Barron discusses how the world of sports and athleticism can help us grow in faith and understanding. The listener question asks about leisure and the Sabbath.</p> Topics Discussed <ul> <li>0:05 - Introduction</li> <li>1:30 - What is Bishop Barron's background with sports?</li> <li>4:00 - Why does the culture hold sports in such high regard up and down the ages?</li> <li>6:00 - How do the rules in sports relate to religion?</li> <li>10:30 - What do coaches teach us about real love?</li> <li>15:00 - How do the rigors of sports offer insights about the rigors of the spiritual life?</li> <li>20:00 - Does athleticism and fitness ever do harm to the spirit?</li> <li>22:47 - Listener Question: Why is leisure important on the Sabbath?</li> </ul>",
  "enclosure": "",
  "itunes:duration": "27:04",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "If you've listened to any number of Bishop Robert Barron's homilies or lectures, you've likely heard him use sports analogies to create a vision of the spiritual life. In this episode of the Word On Fire Show, Bishop Barron discusses how the world of...",
  "itunes:episodeType": "full"
}