{
  "title": "AI Algorithm Bias: What Can Be Done About It?",
  "link": "https://www.aei.org/technology-and-innovation/ai-algorithms-bias-what-can-be-done-about-it/",
  "dc:creator": "Matthew Glavish",
  "pubDate": "Mon, 31 Oct 2022 10:00:00 +0000",
  "category": [
    "Technology and Innovation",
    "Artificial intelligence",
    "Automation",
    "bias",
    "Innovation",
    "technology"
  ],
  "guid": "https://www.aei.org/?p=1008664023",
  "description": "<p>As AI algorithms will reflect the biases of the data used to train them, thoughtful modeling practices can help minimize the negative effects of these inherent errors.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/technology-and-innovation/ai-algorithms-bias-what-can-be-done-about-it/\">AI Algorithm Bias: What Can Be Done About It?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<p>Artificial intelligence (AI) algorithms are a fact of modern digital life. They inhabit the “<a href=\"https://www.arimetrics.com/en/digital-glossary/black-box-algorithm\" target=\"_blank\" rel=\"noreferrer noopener\">black boxes</a>” by which <a href=\"https://www.simplilearn.com/how-netflix-uses-ai-data-science-and-ml-article\" target=\"_blank\" rel=\"noreferrer noopener\">Netflix determines which programs</a> to recommend or—infamously—<a href=\"https://www.forbes.com/sites/kashmirhill/2012/02/16/how-target-figured-out-a-teen-girl-was-pregnant-before-her-father-did/?sh=121d7b066668\" target=\"_blank\" rel=\"noreferrer noopener\">who</a> should be targeted for baby product advertising. They are also increasingly used to <a href=\"https://blog.mcquaig.com/ai-recruiting/?creative=630514210501&campaign=%7bcampaign%7d&keyword=&matchtype=&network=g&device=c&gclid=CjwKCAjw2OiaBhBSEiwAh2ZSP2xw8OpAilm-Xfj-zADe4SW9_f-Y5QWcLiBeOYguKzx7VNFCa2wkNBoCiioQAvD_BwE\" target=\"_blank\" rel=\"noreferrer noopener\">short-list applicants</a> for recruitment decisions, <a href=\"https://aws.amazon.com/health/machine-learning/?trk=4fc067d2-884f-4438-885e-f8fab01b4adc&sc_channel=ps&s_kwcid=AL!4422!3!608594786365!p!!g!!ai%20and%20medicine&ef_id=CjwKCAjw2OiaBhBSEiwAh2ZSPxn_TIpvsfMVO1vp5_lKsFLSxqCRX6COPXnW9pNvZ8DoP_769mVvpRoCsTEQAvD_BwE:G:s&s_kwcid=AL!4422!3!608594786365!p!!g!!ai%20and%20medicine\" target=\"_blank\" rel=\"noreferrer noopener\">read medical images</a> and make diagnoses, <a href=\"https://www.linkedin.com/pulse/prediction-loan-eligibility-using-machine-learning-models-raja-basu/?trk=articles_directory\" target=\"_blank\" rel=\"noreferrer noopener\">determine applicant eligibility</a> for loans, and <a href=\"https://www.nzherald.co.nz/nz/nz-developed-ai-can-predict-kids-hospital-risk/UNNQNQJNBTGRN3SBUYGCJS6ZB4/\" target=\"_blank\" rel=\"noreferrer noopener\">identify children “at risk”</a> of hospital admission, thereby facilitating preemptive allocation of social support to prevent future harm and reduce hospitalization costs.</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" width=\"4743\" height=\"3162\" src=\"https://www.aei.org/wp-content/uploads/2022/10/Artificial-intelligence-generic-stock-photo.jpeg?x91208\" alt=\"\" class=\"wp-image-1008664024\"/><figcaption>via Adobe open commons</figcaption></figure>\n\n\n\n<p>While the workings within the black box may appear mysterious, it must be remembered that algorithms are just specified processes or designated sets of rules for using inputs to get a defined output. There is nothing particularly special about computers and algorithms. A knitting pattern is an algorithm, just like the checklist that pilots go through before the plane takes off. Algorithms serve to reduce variability in the interpretation and use of inputs when seeking outputs. When precisely followed (i.e., with none of the variation that might occur when humans interpret inputs differently), the outputs will be predictable.</p>\n\n\n\n<p>On one hand, algorithms are simply models built using observed data. AI algorithms are an advancement on standard algorithms because specified processes can be used in building and refining the algorithm itself. Input data can be used to “train” the model without human involvement. Hence, models tend to <a href=\"https://www.15minutebusinessbooks.com/blog/2021/07/19/noise-a-flaw-in-human-judgement-by-daniel-kahneman-olivier-sibony-and-cass-r-sunstein-here-are-my-five-lessons-and-takeaways/\" target=\"_blank\" rel=\"noreferrer noopener\">outperform human decision makers</a> for consistency when it comes to decisions such as the sentences judges impose for crimes (in which it has been shown that the judge’s biases, disposition, or even whether or not they had lunch can lead to inconsistencies between sentences for otherwise identical crimes).</p>\n\n\n\n<p>On the other hand, AI algorithms, as deterministic programs, will reflect any errors or inconsistencies inherent in the data or human processes used to specify and train them in the first place. Just as with any other computer program, “garbage in” leads to “garbage out.” The model will be only as good as the data training it. Hence, algorithms trained to <a href=\"https://singularityhub.com/2019/01/28/can-ai-tell-the-difference-between-a-polar-bear-and-a-can-opener/\" target=\"_blank\" rel=\"noreferrer noopener\">identify polar bears</a> may fail to identify a polar bear in a zoo if all the training examples show polar bears in their natural, snowy, environment. The algorithm doesn’t recognize a polar bear the same way a human would, and the common repeated characteristics in the input data—in this case snow—could cause the algorithm to fail at identifying the polar bear in a snowless zoo.</p>\n\n\n\n<p>Similarly, biases, unintended or otherwise, captured in the training data will be <a href=\"https://www.productivity.govt.nz/futureworknzblog/biased-algorithms-a-good-or-bad-thing/\" target=\"_blank\" rel=\"noreferrer noopener\">reliably replicated</a> in the algorithm-determined models. If, for example, the data for deciding who is eligible for a loan includes biases against, say, women (even if gender isn’t specifically included as a variable in the training data), then the ensuing model will deliver decisions biased against women. But if the decision maker explicitly wants to bias decisions in favor of a specific group, then a model derived from unbiased data will not serve the purpose. As AI algorithms extend the art of decision-making modeling, it thus makes sense to subject their uses to a set of well-tested principles governing the design and use of models.</p>\n\n\n\n<p>First, the modeler must understand the context in which the algorithm will be used—that is, have a clear understanding of the problem to which an answer is sought. Models should assist in making decisions, not become rule makers that then indiscriminately determine the future outcome. Though, in some cases, this may be the decision maker’s objective—for example, social media algorithms created for removing terrorist material. </p>\n\n\n\n<p>Second, the modeler needs to know the data used to train the algorithm. They should know where and how was the data was collected, what biases may have been present in its collection, and what data is actually being included in the algorithm and what isn’t. This will assist in identifying the model’s limits—what it will be good at doing and where it may fall short. This will then help answer future questions when the algorithm appears to provide anomalous outputs. Understanding the data also minimizes the risk of algorithms and data being used in situations where they are more likely to lead to errors or anomalies.</p>\n\n\n\n<p>These precautions help resist the “rush to computerize” urge. Just because the data exists and computer algorithms enable it does not always mean that any one AI model will be good or fit for the purpose to which it is applied. Thoughtful modeling practice will necessarily lead to better AI modeling.</p>\n\n\n<div class=\"related-items shortcode \"><p><strong>See also:  </strong><a href=\"https://www.aei.org/technology-and-innovation/scaling-in-ai-and-automation-a-roadmap-for-policymakers/\">Harnessing the Best of Automation While Minimizing the Downside Risks</a> | <a href=\"https://www.aei.org/technology-and-innovation/whats-holding-up-the-autonomous-vehicle-takeover/\">What’s Holding Up the Autonomous Vehicle Takeover?</a> | <a href=\"https://www.aei.org/op-eds/does-artificial-intelligence-really-reduce-jobs-a-historic-perspective/\">Does Artificial Intelligence Really Reduce Jobs? A Historic Perspective</a> | <a href=\"https://www.aei.org/technology-and-innovation/the-challenge-of-encoding-values-in-ai/\">The Challenge of Encoding Values in AI</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/technology-and-innovation/ai-algorithms-bias-what-can-be-done-about-it/\">AI Algorithm Bias: What Can Be Done About It?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}