{
  "title": "555: 'Hogwarts Legacy' Reveals Huge Sneak Peek, '98-'99 Hogwarts School Year Deep Dive",
  "link": "https://audioboom.com/posts/8051699",
  "itunes:episode": 555,
  "itunes:title": "'Hogwarts Legacy' Reveals Huge Sneak Peek, '98-'99 Hogwarts School Year Deep Dive",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4282,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's MuggleCast, we return to an e-mail that we received that asks us what the 1998-1999 Hogwarts school year would have been like, when Hermione returned to complete her Hogwarts education and when Ginny and Luna were her classmates. The hosts think critically and speculate which accommodations might be made in wake of the destruction of the school and considering the mental health and well-being of students and staff! Plus, a recent <em>Hogwarts Legacy</em> trailer gives us the first real look inside the much-anticipated Wizarding World game. All this and more can be found inside the episode!<br>\n<br>\n\n</div>\n<ul>\n<li>Playstation's <a href=\"https://www.youtube.com/watch?v=sxKixtrxYRg\">'State of Play' event</a> gives <em>Potter</em> fans an in-depth look at <em>Hogwarts Legacy</em>. The hosts discuss what interests them about it as gamers.</li>\n<li>Main Discussion: Annette asks us, what do we think the 1998/1999 school year would have looked like at Hogwarts?</li>\n<li>September 1 is only 4 months after the Battle of Hogwarts! Is that enough time to repair the school and memorialize the fallen?</li>\n<li>What would the Sorting Hat's song be like? More calls for unity, amid Slytherin's recent walkout?</li>\n<li>If McGonagall was now headmistress, who would take her spot as head of Gryffindor House and professor of Transfiguration? Is Oliver Wood too young / too obvious?</li>\n<li>What would Hogwarts' graduation ceremony look like, and why did we never see one?</li>\n<li>Would Ron and Harry pop by on the weekends to visit their girlfriends Hermione and Ginny?</li>\n<li>Will Hogwarts FINALLY, finally, get some grief counselors? And did Dumbledore put an unnecessary target on Hogwarts when he was headmaster?</li>\n<li>The hosts discuss tributes that occurred to students who died during their own educational history.</li>\n<li>Listeners provide their questions, such as: will rebuilding Hogwarts add elevators and unisex bathrooms? What happens to the statues of the knights that defended the school?</li>\n<li>Quizzitch: This Week's CURRENT Quizzitch Question: Finish this line: \"Minister, the evidence of the Dark Lord's return is _______.\" A) Incomparable B) Inconvenient C) Inconceivable! D) Incontrovertible  <a href=\"https://mugglecast.com/quizzitch/\">Submit your answer</a>!</li>\n<li>This week's episode is sponsored by MasterClass (go to <a href=\"http://www.masterclass.com/mugglecast\">Masterclass.com/mugglecast</a> for 15% off an annual membership) and BetterHelp  (go to <a href=\"https://www.betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a> for 10% off your first month)</li>\n</ul>\n",
  "pubDate": "Tue, 22 Mar 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-03-21:/posts/8051699",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}