{
  "title": "Pakistani protesters clash with police after former PM is shot",
  "link": "https://www.rt.com/news/566005-pakistan-khan-assassination-protest/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/566005-pakistan-khan-assassination-protest/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636676712030273c5208b0ec.jpg\" /> Protests over an alleged assassination attempt targeting Pakistan’s former prime minister, Imran Khan, have raged for a second day <br/><a href=\"https://www.rt.com/news/566005-pakistan-khan-assassination-protest/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Imran Khan says he will resume his march on the capital after recovering from his injuries</strong></p>\n            \n                        \n            <p>Protests over an alleged assassination attempt targeting Pakistan&rsquo;s former prime minister, Imran Khan, continued across the country for a second day on Friday.</p>\n<p>Khan, who has been calling on supporters to take to the streets since being removed from power in a parliamentary vote in April, was attacked in the city of Wazirabad on Thursday.</p>\n<p>Several shots were fired at the opposition politician as he waved to the crowd from a truck during his protest march toward the capital Islamabad. According to medics, two bullets hit the former PM in the leg, and the injuries are not life-threatening.</p>\n<p>On Friday, Khan recorded a video address from hospital, telling his supporters and members of his Pakistan Tehreek-e-Insaf (PTI) party that the shooting had not affected his determination to seek an early election and demand the resignation of current Prime Minister Shehbaz Sharif. <em>&ldquo;I will give a call to march on Islamabad once I get better,&rdquo;</em> he pledged.</p>\n<p>The former prime minister has accused Sharif, along with Interior Minister Rana Sanaullah and intelligence official Major-General Faisal Nasser, of trying to kill him, but has provided no evidence to back up his claim. Thursday&rsquo;s attack saw one person killed and 11 others injured, Khan said.&nbsp;</p>\n<p>The military has called the accusations <em>&ldquo;baseless and irresponsible,&rdquo;</em> and the government has denied any involvement.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363b8c185f54032380c81b0.jpg\" alt=\"Pakistan Tehreek-e-Insaf, Imran Khan, who injured in a shooting incident, is seen after the incident, in in Wazirabad, Pakistan, Thursday, Nov. 3, 2022.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565872-former-pakistani-pm-shot-assasination-attempt/\">Former Pakistani PM shot in ‘assassination attempt’</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Khan&rsquo;s statement came as supporters were out on the streets, protesting for a second day.</p>\n<p>Several major rallies took place in the Islamabad-Rawalpindi metropolitan area, with demonstrators carrying portraits of Khan and Pakistan&rsquo;s national flag, while chanting slogans including: <em>&ldquo;Announce a new election date.&rdquo;</em></p>\n<p>Clashes broke out near the Faizabad Bridge in the capital, with riot police using tear gas and batons to disperse the crowd. Security forces said they were acting in response to protesters attacking officers with sticks and stones. <em>&ldquo;Many&rdquo;</em> demonstrators were arrested, according to the Dawn news outlet.</p>\n<p>Videos on social media showed an angry crowd gathered after dark outside what was said to be the Pakistani army&rsquo;s headquarters in Rawalpindi.&nbsp;</p>\n<p>People also amassed at the spot where Khan was shot, and called for his march on the capital to be resumed immediately. <em>&ldquo;It cannot stop. People are very angry, it will become more intense,&rdquo;</em> one of the activists told Reuters.</p>\n<p>In Lahore, the capital of the eastern state of Punjab, demonstrators set car tires on fire and blocked roads. Witnesses also saw rocks being hurled at the gates of the provincial governor&rsquo;s office, destroying security cameras and inflicting other damage.</p>\n<p>Roads were also blocked in the northwestern city of Peshawar, while in the southern city of Karachi police used tear gas.</p>\n<p>Khan, 70, is a former cricketer who served as Pakistan&rsquo;s prime minister from 2018 until his removal from office after a no-confidence vote in April this year.</p>",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 15:49:52 +0000",
  "dc:creator": "RT"
}