{
  "title": "JADEN HOSSLER WON'T LET IT GO — BFFs EP. 90 WITH TANA MONGEAU",
  "description": "<p>We start the podcast joined by Tana, who finally decides to show up after he multiple bailings. We get into Dave's evisceration of her before jumping into one of the best headlines show we have ever had.\n\nWe cover Lil Huddy going at Charli and Landon with his new song, Heidi's response, Charli and Landon going back at him, Josie Canseco getting in the mix, and Josh doing a little bit of trolling.\n\nWe then get into the Jaden drama of the weekend with him being at the same part as Josh and Nessa and the fan behavior that came out of that, his Twitter tirades, Josh's trolling on Tik Tok, Jaden claiming he apologized, and what really happened when Josh and Jaden saw each other in person.\n\nWe then get into some less dramatic headlines with Sheri Nicole owning Monty Lopez, Britney Spears making her music comeback, and Elon Musk being everywhere.\n\nWe end with BFFs corner of Dave's trip to London, Bri hooking up with a certain Tik Tokker, and finish with a game of \"Social Media Happily Ever After\" where we go through social media couples and say if we think they will end up together or if it is only a matter of time until the split.\n\nSupport our sponsors!\n\nMattress Firm: To Unjunk your Sleep, go to https://barstool.link/MFRMBSS  or a Mattress Firm store today and speak with a Sleep Expert\n\nSummer:  Download Summer today at https://barstool.link/SummerBFFs \n\nTakis: Find Takis on Amazon Today and \"Face the Intensity\"</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "9cb8870d-4405-46e7-bbb7-ac41baa43ec1",
  "pubDate": "Thu, 28 Jul 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "01:06:29",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}