{
  "guid": "c9c4c608-555e-4bfd-b3ae-84ed334f9e1e",
  "title": "Seth Godin - The Generosity of Authority",
  "description": "<p>Seth Godin joins us to explain the generosity of authority.</p><h2>Talking Points</h2><ul><li>What “authority” means to Seth</li><li>The first things that Seth thinks of when it comes to funding a mission</li><li>Two different games</li><li>Writing every day</li><li>Levels of freelancing</li><li>Imposter syndrome</li><li>Podcasting</li><li>Akimbo workshops</li><li>Comfort zone vs. safety zone</li><li>Publishing</li><li>Word of mouth</li><li>Writing a book</li><li>Finding your alignment</li><li>Making a decision</li></ul><h2>Quotable Quotes</h2><p>“The more they charge, the more authority they actually get.” –SG</p><p>“If you win the game to be the most generous, then you earn the privilege in the area where you seek to have authority, to exchange status.” –SG</p><p>“If you’re not feeling like an imposter, I would argue, you’re not working hard enough.” –SG</p><p>“If you think your secret is what people are paying for, you’re crazy.” –SG</p><h2>Related Links</h2><p><a href=\"https://www.sethgodin.com/\">Seth Godin</a><br /><a href=\"http://akimboworkshops.mystrikingly.com/\">Akimbo Workshops</a></p><h2>Transcript</h2><h3>Jonathan Stark</h3><p>Hello and welcome to the Business of Authority. I'm Jonathan Stark.</p><h3>Rochelle Moulton</h3><p>And I'm Rochelle Moulton.</p><h3>Jonathan Stark</h3><p>And today we are joined by legendary marketer Seth Godin. Seth, welcome to the show.</p><h3>Seth Godin</h3><p>Thank you for having me.</p><h3>Jonathan Stark</h3><p>Thank you so much for joining us. I'm very excited about this conversation. I've been thinking about it for two years, so I'll try not to pummel you with random questions that are too weird but the first we want to start with, given the show title, it's the Business of Authority, what does the word authority mean to you in the context of a business?</p><h3>Seth Godin</h3><p>That's a great place to start. I don't think it means what most people use the word authority to mean. Authority usually means what a manager has, which is power, which is the ability to get other people to do what want even if they don't want to do it. I would say that in your case what we're actually talking about is reputation. What we're talking about is a variation of trust, which is trust to the power of provability, meaning not only do I trust you but I can go to my partners, my bosses and my employees and insist that they trust you as well because you have earned that through your reputation.</p><h3>Jonathan Stark</h3><p>Yes, I love the distinction. It's not the boss kind of authority. You will \"respect my authorita\", fabulous. Okay, so what are first things that come to mind when someone is starting to establish authority? I think it happens over time, has a lot to do with, like you said, trust and that trust has to exist in something and that something is the audience. So, you're on a mission and authority is on a mission. They're moving toward a vision that they see in the future. They're trying to lead people to that goal. What are the first things that come to mind when you think about funding that mission by building a business around it so that you can keep doing it?</p><h3>Seth Godin</h3><p>There was a pre-question which I'll do first. Yes, as you pointed out it is in the eye of the beholder. There's a funny joke, being headed executive gets bumped off a flight on Delta and marches up to the counter and says, \"Do you know who I am?\", and the person behind the counter gets on the PA system and says, \"Medical alert, we have someone with amnesia at the front desk. He doesn't know who he is.\" If she doesn't know who you are then it doesn't matter who you are and this is the McKinsey Trap. The McKinsey Trap is you're getting paid X number of dollars at McKinsey and you realize they're marking you up 4X, so you quit McKinsey and go out on your own and you can't even get paid a quarter of what you used to get paid. Well, it's the same consultant giving the same advice, so why is there a 16X difference in the comp. The reason is because when you hire McKinsey you are not buying advice. You are buying the privilege of telling the board what McKinsey said and that's what they sell. That is my current definition of useful authority in this case. It has nothing to do with proving you are right and everything to do with the mantel that you have earned in the eye of the consumer.</p><h3>Seth Godin</h3><p>Now, what that gets us is to is this whole riff about status roles because status roles are everything in our culture. Who's up? Who's down? Who gets to eat first? Why is someone dating a supermodel? Why did you buy that car? What neighborhood do you live in? All of these are status exchanges where we are trying to buy safety, or leverage or authority by acquisition of something that gives us a sense of status, so McKinsey maintains their status by acting like a diva, by not making sales calls, by charging extra. The more they charge the more authority they actually get and so while we may be tempted to hustle to get our authority, to somehow prove that we are right we are actually giving up authority when you do that because in our culture the signals that come with authority are not the same as the signals that come from the desperate chase of proving you're right.</p><h3>Jonathan Stark</h3><p>Yeah and that's something we talk about all the time. I think the tricky part for people who are listening who probably agree with that, it's like, \"But you can't start off by acting like a diva\", right? I mean, that doesn't seem to track. There has to be this sort of progression where there's trust built and then later when you're IDEO and you've got every Fortune 500 logo on your homepage and they're all amazing brands, at a certain point it feels like you reach a critical mass and you can maintain that authority position with these status games that you just referred to. Is that the way you start though? You just go out on your own and you play hard to get with your clients. That doesn't seem like it would work.</p><h3>Seth Godin</h3><p>Correct, another great insight. In fact, there's two games and I just described the second game. The first game is a completely different game. It is not a junior version of the other game. It is the game of who can be the most generous, that if you win the game to be the most generous then you earn the privilege in the area where you seek to have authority to exchange status.</p><h3>Seth Godin</h3><p>So, I'll use my example. Not because I have an enormous amount of authority because I haven't sought to do that but you blog every day for a thousand days in a row. That's free. You make YouTube videos. That's free but then someone calls you up to give a speech. That's not free. That's expensive and what that means is you don't give speeches for a while because you're not willing to give a $500.00 speech because people who have something to say don't give $500.00 speeches. You will give a free speech at Ted. You will organize your own conference. Organizing a conference is generous but if you want me to get on a plane and come give a speech to your organization, that's expensive and I'm fine if you don't want to buy it because I got other things I can do that are generous instead.</p><h3>Jonathan Stark</h3><p>Well, that tracks with our normal story here, that's for sure. You may or may not know this but both Rochelle and I are daily emailers inspired by you and a friend of mine, Philip Morgan. It's transformative on your business. It's not just in the sense of you're \"giving away the farm\" so to speak in a particular format and being generous and sharing the ideas, honestly I think of it every day as \"who can I help today,\" how am I going to help them, what can I write today that's going to help the kind of person who's on my list. That's great and it leads to all the things we're talking about, the expensive speeches for example, but the thing about it that it is not obvious from the outside is that it makes the writer better, not just communicating but just like a deeper thinking because you get... After the first three months of writing every day you've burned through all of the trite, obvious stuff and you need to start really digging deep looking for-</p><h3>Seth Godin</h3><p>Exactly.</p><h3>Jonathan Stark</h3><p>Yeah, it's amazing. It is absolutely amazing. It sounds terrifying to people when we suggest that they write every day about a particular, with a particular worldview let's say, not necessarily particular focus but like a worldview and around an idea but it terrifies people. They think like, \"Oh no, I'll never be able to keep up with it. I'll run out of things to write.\" Is there anything you can say to inspire people to perhaps take that leap, take that... It feels risky to people that are scared of it.</p><h3>Seth Godin</h3><p>For sure, I have a riff about the Boston Marathon, which is if you hire a running coach you will not say to her, \"Teach me how to run the Boston Marathon without getting tired.\" In fact, everyone who runs the Boston Marathon is tired. The question is where do you put the tired. If you want to run a marathon you have to be prepared to put the tired somewhere. Well, if you want to be an independent voice with authority you're going to have to do things that feel risky. If you're not prepared to do things that feel risky you should go get a job.</p><h3>Rochelle Moulton</h3><p>Perfect.</p><h3>Jonathan Stark</h3><p>Yes, correct. I want to shift gears a little bit and talk about something I heard you say. I think it was in the marketing seminar. I went through the marketing seminar. It's fabulous. I highly recommend it. I think it was in there that you described yourself as a freelancer at one point.</p><h3>Seth Godin</h3><p>And today as well. I'm back at it, yeah.</p><h3>Jonathan Stark</h3><p>Okay, so I want to talk about that because you're not really like any freelancer I know and I know a lot of freelancers. So, we have this mental framework here on the show about the progression from zero to authority if that's the path that you want to go down. Not everyone does but if it is the path you want to go down with the folks we work with it starts off as a technician who has this skill that they apply on a time basis for it's like a mercenary type of thing, like, \"Hey, do you need some code? I'll write some code. It took me 10 hours. Give me a thousand bucks.\" Then it moves to an area where they're more advisory, consultative, where they're an expert at writing code, or copywriting or photography and they can teach it, or guide people or decrease risk for clients who have a big project that involves that thing. They're sort of moving up the food chain in terms of applying their expertise but they're not applying it directly. They're advising about their expertise.</p><h3>Jonathan Stark</h3><p>Then there's this level above that which we would call an authority where it's more of a thought leadership place where there's an audience that's following you to a destination and there are business models that seem to line up with those three levels. The first one is what I would normally call freelancer where you're a mercenary. You're a \"free lance\" who is available for hire and it's not really... They take any comer who's like, \"Oh, someone wants to hire me to write code or write copy. Great, let's do it.\" Then this middle level, the expert, aligns up with consultant a lot of times or trainer and then the top tier authority a lot of times lines up with speaker, talking head on TV, author. Author's right in the word, so when I heard you say that you saw yourself as a freelancer rather than an entrepreneur, that didn't really track with me-</p><h3>Seth Godin</h3><p>Well, we have a semantic difference here, so I think your three levels are very smart but they are three levels of freelancing and let me make the distinction because of all the single sentences I have uttered on stage more people have told me this has changed their life than just about anything. Freelancers and entrepreneurs are different. Freelancers get paid when they work. Entrepreneurs build something bigger than themselves, so Larry Ellison is an entrepreneur. He does not write code. He does not make sales calls. In fact, Larry Ellison's only job at Oracle is to hire people to do jobs he invents. That's his only job and if he finds himself doing any work whatsoever he's doing something to harm the shareholders.</p><h3>Seth Godin</h3><p>Now, I have been an entrepreneur. I have built companies that changed parts of the world and I didn't like it. I was good at it but I didn't like it because I like doing things with my own two hands. If you read a blog post, I wrote it. If I was an entrepreneur that would be wrong. I should hire someone to write my blog post. If you take a workshop with Akimbo, I created it with my own two hands and then there are people who I think I work for, they don't work for me, who run Akimbo. That's not my job. That's their job and so I'm finding joy by doing the work. Entrepreneurs shouldn't do the work. Jack Dorsey should not be touching code, et cetera.</p><h3>Seth Godin</h3><p>All right, so how do you move up as a freelancer? Well, the way I describe your three tiers is this. You cannot move up as a freelancer by working more hours. The only way to move up is to get better clients. What does it mean to have better clients? Clients who trust you more. Clients who challenge you. Clients who give you more leverage. Clients who pay you better. Better clients will get you better clients because your book will look better. Your work will look better and so the quest, if you are on the authority track, can be defined as what work do I need to do today to get better clients a month from now.</p><h3>Seth Godin</h3><p>If you're just working for hire for anybody, JUUL, some cigarette company, it's not going to help you get better clients, so turn them down. Partly because it would be a moral failing to do the work but mostly because it's going to get in the way of you getting better clients and what I find, and we run a freelancers workshop so I've talked to hundreds and hundreds of freelancers about this, is the fear kicks in and this is the other riff which is imposter syndrome. People say, \"What do I do with imposter syndrome?\" The women who tell me this think only women have it. The men who tell me this think everyone has it but imposter syndrome is this idea that you feel like a fraud and what should I do with this. I don't deserve better clients. I feel like a fraud. Well, and a quick little aside, I used to have a record label and I did it as an experiment. I gave all the money to the artists and one of the artists, a married couple who lived in a van, and they would drive from town to town. They would play at the easily booked coffee shop. Then after they'd been there for two nights they'd drive to the next town.</p><h3>Seth Godin</h3><p>I took them aside and I said, \"Guys, you got to stay in town. Stay in a town and work your way up because it's a better audience. They pay better. The mics work better. Everything is better\" but I could see from the look in their eyes. They didn't think they deserved to play at Passim because they felt like imposters. My answer is, \"Of course you feel like an imposter. If you are doing work that matters you are an imposter. You can't certify that you've done this exact thing before and it's guaranteed to work. You can't, so because you're a good person and an honest person inside you feel like a fraud because you're acting as if, because you're describing a future that isn't here yet and if you're not feeling like an imposter I would argue you are not working hard enough.\"</p><h3>Rochelle Moulton</h3><p>Wow.</p><h3>Jonathan Stark</h3><p>Yeah and by the way, nice shout out to Cambridge. I like that. So, there's a thing in the pricing world, my focus is pricing, and there's a thing in the pricing world called \"selling to your own wallet\" which this reminds me of, where it's not the same thing but it's similar where someone who can't imagine that they would pay X dollars for a watch or whatever. They imagine that no one would. I think that's fairly common. I don't think that's a shocking revelation, like \"Wow, I can't believe somebody would pay a million dollars for Paul Newman's Rolex, that's just insanity\" but someone paid it. Is it insane? Is it not insane? It doesn't really matter. The problem is when you start to apply that to your own business and you think, \"I can't imagine anybody paying me $10,000.00 a month to maybe pick up the phone once in a while.\" Well, you better start imagining it if that's where you want to go and you can't just expect people to start writing you $10,000.00 checks every month if you're not delivering value, so you do have to figure out that puzzle. How can I deliver more than $10,000.00 of value every month to someone by just picking up the phone when they call?</p><h3>Jonathan Stark</h3><p>The paralysis comes from not believing that they're worthy of that, that their expertise is not actually that valuable to anyone because they don't value it as much as they should themselves.</p><h3>Seth Godin</h3><p>Yeah, that's a great point and you know the thing is most of the people you and I, the three of us talk to, don't make their own clothes. If someone came to you and said, \"You must make your own clothes.\" It is not allowed anymore. It's immoral to make your own clothes. We would be annoyed and offended. How dare you? If you stood out front of the fancy watch store, and this is probably a worthwhile exercise and told people on their way in they're not allowed to go in to buy a watch. They're not allowed to buy a wedding ring. Go to a wedding that costs $50,000.00 and start heckling the bride and groom. You're not allowed. No, have some empathy, right? Have some empathy to realize that different people will make different choices about how they're going to spend their money. Your job is once they've made that choice how can you satisfy that need and so when I go out for my anniversary dinner I am not hoping the restaurant will charge me less. I'm hoping that we will have a better time, so that's the restaurateur's job is not to lower the price but to increase what I came for.</p><h3>Seth Godin</h3><p>So, I think it's a little bit of a trap to say, \"I hope I'll get paid a lot of money just to answer the phone.\" I think the right question is how can I create an environment where the people who hire me on retainer see their career's turbocharged because their bosses are so impressed that they're able to call me whenever they want. What would I have to do to make those conditions possible?</p><h3>Jonathan Stark</h3><p>I want to shift gears yet again and talk about podcasting for a second. We mentioned earlier sharing your expertise freely in particular ways and then charging a premium in other formats, say podcasting versus speaking in person. Geez, it's been like five seasons now of the Akimbo podcast I think and I think you've been on a million, maybe a thousand, thousands of podcasts but the only one I was aware of that you publishing was like a recording of a course of some kind or a workshop that you did years ago. Why that change? What made you... Is it something about podcasting? To me, it feels like it might be competing with books as a primary source of authority and then there's this question of self-publish versus traditionally published books. How do you see podcasts fitting into the authority landscape?</p><h3>Seth Godin</h3><p>It's important to note that in addition to being a hypocrite I'm not a very good role model. The reason is because this is my hobby, that this work that I am doing every day... I'm 59 years old. I was born on the right day to the right parents. I won the internet lottery. This is my hobby and so people who try to do what I'm doing because they think I've thought through it, how to maximize something, are going to make a big mistake. Do as I say, not as I do because when I say it I'm describing what I wish I had heard when I was 30. But, I could do all sorts of things to make more money than I make now. Podcasting was an interesting problem five years ago. I'm a new media scholar. That's what I focus on. This is a form of new media. It's disruptive. It's interesting. It's personal so I came up with a podcast but I didn't want to do it because it's too much work and because there are all sorts of other personal things I had about it. Then some podcasting people called me up and called my bluff. They said, \"We have a hunch you've figured out how to do a podcast but we'll pay you\" and I could do a lot of good with that money, so I'm thinking...</p><h3>Seth Godin</h3><p>Well, now I'm stealing money from poor children if I don't do this podcast. I can't keep whining about it. I either got to do it or never speak of it again and so I like these people and I said, \"Sure, this sounds like something to add to my hobby list.\" I will say though, as the person who founded the podcasting fellowship, that in fact, surprise, surprise, it gets you more speaking gigs and I make more from speaking gigs than I make from writing books, that in fact the 100,000 plus people who listen to the podcast prefer my voice to my blog posts and that means that they're likely to want to engage with other changes I'm trying to make in the world but that's not why I made it. I made it because I'm a little bit of an egomaniac. I thought I had something to say and I like the sound of my own voice.</p><h3>Jonathan Stark</h3><p>Well, I love it. I highly recommend people listen to Akimbo and it's not overly produced, maybe like an NPR is super, super heavily produced but you definitely have a lot of sound editing. There's a lot going on there. I applaud you because that is a lot of work. We try and keep things simple here over at the Business of Authority. No music, we've got a no music rule.</p><h3>Jonathan Stark</h3><p>You mentioned the podcast fellowship and then there's the marketing seminar. I think you're up to the eighth one. Tell us a bit about how the Akimbo workshops fit into your master plan. I know you seem like an educator. To me, you've got that great talk about what are schools for. As someone who homeschools their kids I completely resonate with that. For you, is the workshop approach the way to have the biggest impact or is just a hobby and it's just something you like to do?</p><h3>Seth Godin</h3><p>No, this is not a hobby. This is too much work to be a hobby. I do the workshops because I'm a teacher and this is the single, most effective form of teaching I have ever done by a lot. A book can sell a quarter of a million or a million copies and I will change X number of lives where X is a number less than a hundred, maybe it's a thousand. Whereas, when a thousand people take one of our workshops we will change the lives of 500 of them and not all completely but really deeply because doing the work, doing the work together, doing the work in public, is so different than listening to a podcast or an audio book, so I'm still doing the other stuff drip by drip, day by day but when I saw what the altMBA was able to do for people I knew that it would be malpractice to not try to push it forward and then I encourage lots of other people to copy what we're doing because if enough people copy it then I don't have to do it anymore.</p><h3>Jonathan Stark</h3><p>Yeah, me included. I don't know if you even remember but I emailed you after I went through TMS and I was like, \"This format that you've come up with is genius. The combination of the cohort with the lessons dripped out over time and sort of people working through it together, more like study groups and online\", yeah, it's great. You're welcome. That's where the pricing seminar came from because my focus is pricing.</p><h3>Jonathan Stark</h3><p>So, your riff on education is like what's education for. Are we trying to make kids into factory workers? It seems like that's kind of how it's set up, at least how it was setup and there's still a lot of hangover from that. That ties into a concept in the Icarus Deception which absolutely blew my mind about the comfort zone versus the safety zone. I don't need to tell it. Could you riff on the comfort zone versus safety zone and how that fits with education?</p><h3>Seth Godin</h3><p>Anytime you riff on a book that I wrote eight years ago you do need to remind me but in this case I remember.</p><h3>Jonathan Stark</h3><p>Good.</p><h3>Seth Godin</h3><p>So, why are there so many victims of massive change in our world? Why is it that when the world changes people who are supposed to be alert, whether it's Western Union, or the old version of Microsoft... I mean, Steven Ballmer is supposed to know what's going to happen next. That's his job and the same thing's true when we think about people going through school or graduating in enormous amounts of debt. Didn't they see it? Why is there so much pain? Well, the answer is because we have a narrative about where we would be safe. Let's call that our comfort zone. The comfortable thing is to go to a famous college and go into debt to get a piece of paper that will guarantee us a safe job going forward but that is not actually a safe place. It just feels safe. It is simply comfortable and this idea that safe is risky and vice versa is only present when the world changes. When the world is the way the world is then those two are aligned. Safety and comfort among rational people is the same but when the world is changing that's when we make mistakes.</p><h3>Seth Godin</h3><p>So, how will we use our discomfort as a compass to point us to where we will ultimately be safe? I believe that every good person in the book publishing world is going to be out of a job in 20 years and that's because they are doing things that are comfortable right now, not things that are safe. What would be safe is for them to connect directly with readers. What would be safe is for them to explore. They should be in my business, right? They should be running live events. They should be running these interactions, on, and on and on, because that's the safe thing to do. It's just not comfortable and as a result good, hardworking people are going to slam into a wall because one day the backlist isn't going to pay all the bills. The end.</p><h3>Seth Godin</h3><p>To come back to the listeners of this august podcast. There are all sorts of things you conventional do as a freelancer, as a consultant, that are comfortable but I got to tell you in a world where everyone is a click away and where Zoom is a click away they're not safe anymore.</p><h3>Jonathan Stark</h3><p>Right, I get it all the time from students where I'll make some suggestion that, \"Here's a tactic that you could try. It fits with our strategy. We've defined an objective for you. We see where you want to go.\" Tactics, they come and go. You change them. You experiment with them. You see what's going to work different for different people and you can get so much pushback, like change the headline on your site a little bit. Oh, that seems too risky. It's like, \"Well, it's not like it's a lion.\" What's going to happen? Lightening bolts are going to shoot out of the keyword? Risky, how? It's 100% the comfort versus risk thing, so when I read that my head exploded. I was like, \"Oh, right, that's exactly what it is.\"</p><h3>Jonathan Stark</h3><p>In my consulting business I saw the same thing. When I was doing mobile consulting 2010, '11, '12, these big corporations... I wrote a book and corporations were like, \"Yeah, we need this guy. Come in and tell us what to do.\" I would come in and say, \"Well, here's the situation. This is the way it's going to be in five years for sure. Mobile phones are going to be the computing platform. That's it. So, get there. It's going to take a while. You're a huge organization. You need to do these things to get there\" and they wouldn't. It was one of the big reasons I left consulting was because it was like one time where I felt like I was like, \"Wow, I really know what to do here, like this\" and their competitors did it and now they're suffering, the whole thing. They were so, like for a big organization they were so fearful of doing anything that wasn't the norm in a context where everything was changing and you end up with Blockbuster, and Tower Records and all of these companies just disappearing overnight. Things like Airbnb, and Uber and Netflix seemingly out of nowhere but they were enabled by this mobile platform. It's unbelievable.</p><h3>Seth Godin</h3><p>I agree with everything you just said except for the last sentence.</p><h3>Jonathan Stark</h3><p>Okay.</p><h3>Seth Godin</h3><p>It's totally believable! It would be stunning if it wasn't true.</p><h3>Jonathan Stark</h3><p>Sure.</p><h3>Rochelle Moulton</h3><p>Actually I'd like to get Seth's view on this. Comfortable versus safe, if you're an authority or you're on the authority track, you're consulting, you're freelancing and you've got a big idea and you think it's a book. What's the comfortable versus safe approach for publishing or producing a book now?</p><h3>Seth Godin</h3><p>Okay, so we're going to go as quick as we can through this book thing. First thing, a book is a Proustian souvenir that for many people of many ages but all of us over 30 means something. To some people it means school and it is to be avoided. To some people it means status. To some people it means wisdom, a level of achievement. Just the presence of the thing is different than saying, \"I took all of these ideas and tweeted them\", that the object itself has a value.</p><h3>Seth Godin</h3><p>Now, publishing is not the same as printing. Anyone can print. It is cheap. Publishing is about taking financial risk to get people who are unaware of an idea to become aware of it and pay money for it. That's what publishers do. The number of actual publishers in the US is very small and the imprimatur that they provide certainly has value but less than it used to because if you can print a document that looks just like what they would do to the uninitiated it is the same thing. Now, this leads to one of many pitfalls.</p><h3>Seth Godin</h3><p>Pitfall number one is you do the comfortable thing, which is you cut little, tiny corners that you don't think anyone will notice and your self-published book is obviously self-published and then not only haven't you succeeded, you've failed because you're so desperate you're self-publishing your book in a pretend effort at authority. So, it would have been better if you had done nothing.</p><h3>Seth Godin</h3><p>We did a book for charity last year and it took my creative director and I, between us, 400 hours to make it look like a real book. It's not something you just upload to CreateSpace and you're done.</p><h3>Seth Godin</h3><p>Now, when you get a book then you've come to the conclusion that now you need to make it a bestseller because that's where the status really lies. Well, what's obvious to anyone in the industry is you can buy your slot on the New York Times Bestseller list now, so it's now worth nothing. Don't even bother because everyone's doing it. They're all buying their way. It doesn't mean nearly as much as you think and so it's just this huge distraction where we believe we are about to be judged so we spend an unreasonable amount of time and money for this signifier that's not actually much of a signifier at all.</p><h3>Seth Godin</h3><p>The real signifier is did someone other than you tell me about your book. That is the signifier because now the book is serving its true function which is it is a permanent container for the ideas of a single person. If someone tells me about your book, your book has just increased your authority. What we have to begin with is you have to write a book that other people will choose to talk about in a way that gives you authority. That is really hard to do. Do that first. Don't worry about the tactics of how can I get Adrian Zackheim to publish my book at Penguin in a thinly veiled attempt to become seen as some sort of authority.</p><h3>Seth Godin</h3><p>So, when I published Purple Cow I was on the outs. My previous publisher, Simon and Schuster, had fired me because my book before that they didn't understand and it did very poorly and so I self-published Purple Cow years before self-publishing was easy and I put it in a milk carton-</p><h3>Jonathan Stark</h3><p>Just to make it easier on yourself.</p><h3>Seth Godin</h3><p>I could tell you an hour's worth of stories about that but the punchline was if you bought the 10 pack or the 12 pack of the milk carton you gave it away and the act of you giving it away is where I got my authority from and it became the bestselling marketing book of the decade because people talked about it, not because my publisher which I ended up acquiring, did a good job of publishing it. That's silly. They don't do a good job of publishing anything.</p><h3>Seth Godin</h3><p>I guess what my rant is about is you're already in one business. Don't try to get yourself into another business of being a publisher. You're probably going to be terrible at it. If you're going to make a printed artifact open your wallet, blow out the dust and spend the money to make it magnificent and the way you do that is by going to the bookstore, finding a book that already has authority, handing it to your printer/designer and saying, \"It has to look exactly like this\", same paperweight, same paper stock, same typeface, same trim size, same embossing. Copy this. All your ideas, all your words, no one cares about that. It's got to look and feel right.</p><h3>Seth Godin</h3><p>Okay, so then you say, not how do I get everyone in America to read this. Everyone in America isn't going to read it. You say, \"Who are the 250 people who if they read this and told someone else I would be on my way and then you, or even better a more prestigious colleague of yours, send the book free to those 250 people. If those 250 people after getting the book don't talk about you didn't right a good enough book. The end.</p><h3>Rochelle Moulton</h3><p>Wow.</p><h3>Jonathan Stark</h3><p>Yes, thank you for that.</p><h3>Rochelle Moulton</h3><p>Love it.</p><h3>Jonathan Stark</h3><p>My takeaway from that is what's important is word of mouth, not a book. Is that fair?</p><h3>Seth Godin</h3><p>Yeah, the book is simply a way to create an artifact that works harder for you every day than you could do without it.</p><h3>Jonathan Stark</h3><p>Okay, so where my brain is going is, is the word of mouth of, \"Hey, you should listen to Akimbo\" or \"Hey, you should listen to the Business of Authority\", is that kind of word of mouth... Do you think that carries the same kind of weight because I'm starting to think it does?</p><h3>Seth Godin</h3><p>It might carry even more. It depends on whether your book can enjoy word of mouth without people reading it.</p><h3>Jonathan Stark</h3><p>Wow.</p><h3>Rochelle Moulton</h3><p>That's the challenge.</p><h3>Seth Godin</h3><p>Thomas Piketty has benefited from this. His book, Capital, is the most unread book published that year. We know this for a fact. If we multiply the number of people who purchased it times the percentage in the Kindle that was indicated that they read, it had more unread pages than any other book of the year but-</p><h3>Jonathan Stark</h3><p>That's brutal.</p><h3>Seth Godin</h3><p>Yeah but it's true and after reading 10 pages you knew everything you needed to know to talk about the book and so the book served its purpose. The book was not a ripoff. You got your $30.00's worth which is after reading 10 pages you knew enough to be able to talk with some confidence about the inequity in our society and recommend that people who disagreed with you read the whole book.</p><h3>Jonathan Stark</h3><p>Yeah, it's painful actually but it makes sense. I feel like it gets back to the status a little bit, like you want to say you read it or you want to be on your bookshelf. You want to be the kind of person who you think agrees with it. You're more buying it as an artifact or a conversation piece than an educational type of thing.</p><h3>Seth Godin</h3><p>Right, so one thing you could do if you were in the pricing business and you wanted to be the most expensive pricing consultant is you could take everything you know, put it into a loose leaf binder, only make 400 of them, hand number each one and give them to your best clients with extracting a promise that they will not make copies and share with other people. Then they will and once people start getting this priceless notebook which is handed from person to person they will realize it's too much work for them to go through all of it. They'll call you and hire you.</p><h3>Jonathan Stark</h3><p>I 100% agree with that. That would totally work. That is so funny. I don't know. I feel like we're bashing books a little bit here.</p><h3>Seth Godin</h3><p>Not at all, books have been very, very good to me. Just use them for the right reason. That's all I'm saying.</p><h3>Jonathan Stark</h3><p>Yeah and we talked about that in the past where it's like if you're going to write a book, both of us, our general advice is first decide who it's for. Not just like, \"I want to write a book with this title.\" It's like who's this for. Who's going to be transformed by this? Then start working out, okay, now that I know who it's for here's the way I need to deliver this information. It seems obvious to me because I've got the curse of knowledge. How am I going to deliver it to this particular person in the most effective way that is going to turn that light bulb on for them?</p><h3>Jonathan Stark</h3><p>Okay, so that's how I would approach writing any book. It needs to be good for the reader but then we also categorize into where do you see this book fitting into your business. Is this going to be a 300 page business card that you use to get consulting clients or is this going to be like a revenue stream that you want to actually be bringing in money every month from selling this directly?</p><h3>Seth Godin</h3><p>I think it's the third one.</p><h3>Jonathan Stark</h3><p>Okay.</p><h3>Seth Godin</h3><p>You only said two. The third one is I would like to change my pocket of the culture to create an environment that helps the people I seek to serve and that also allows me to be a participant in how it moves forward.</p><h3>Jonathan Stark</h3><p>Okay, that's fair. I wouldn't use a book for that though.</p><h3>Seth Godin</h3><p>Well, it depends. If you're Bruce Schneier and you're the leading computer security expert then your book on that, or if you're Don Norman and you're the leading expert on user-centric design, or you're the guys at... I can go down the list of the people you've heard of who have actually changed a culture by earning the privilege to change the culture by having the chops to put it in writing and say this. They gave away everything they knew because you have to give away everything you know because if you think your secret is what people are paying for you're crazy.</p><h3>Rochelle Moulton</h3><p>I was just thinking. It made me think of something I heard you say, Seth, that writing a book is a generous act.</p><h3>Seth Godin</h3><p>Yeah.</p><h3>Rochelle Moulton</h3><p>Do you feel it was generous in some of those examples? Can you talk more about that generosity?</p><h3>Seth Godin</h3><p>The generous act to write a good book and what that means is that the reader cannot tell what your incentive is other than you're trying to make things better. In the business world we can sniff it out immediately, when you are... I'm not going to mention this super agent because that's why they write the book, so I would mention them but if it's just one, self-aggrandizing anecdote after another, well yeah, now we know why you wrote the book but we got nothing out of it. But, the magic of a book is... I wrote the Icarus Deception however many years ago and it's still doing things for people with no incremental effort on my part. Another reader costs me nothing. The fact that I make it huller, maybe the advanced learn or not. I have no idea. I don't keep track but that's not why a good author talks about her book. A good author talks about her book because she knows she's probably never going to get another royalty check but if another person would read the book things would be better.</p><h3>Rochelle Moulton</h3><p>Yeah, it's that transformation that you're trying to make with the idea inside your book.</p><h3>Seth Godin</h3><p>Let's get back to I have no idea how many people are listening to this but my guess is that 92% of them act in selfish, short-term ways because they're afraid, because they're afraid they don't have anything really important to say because they're afraid if they blow up their industry by giving away the secrets they will be ostracized because they don't want to be on the spot because they don't actually want be the leader.</p><h3>Seth Godin</h3><p>And so what they do is they think small. They play small ball. They try to transact and that's why they're still frustrated. It's interesting. My son gets Dental Town magazine and Dental Town magazine, if you have any fear of the dentist you should not read Dental Town magazine because there are articles about basically how to under serve your patients so they'll pay you more.</p><h3>Jonathan Stark</h3><p>Oh man.</p><h3>Rochelle Moulton</h3><p>Ouch.</p><h3>Seth Godin</h3><p>And, you don't want dentists doing that. You want a dentist who decides that the best way to be a successful dentist is to get better dental patients and to make it so that they don't have to come very often because if you do those two things they will talk about you, there'll be a waiting list, and on, and on and on. On the other hand if you're trying to churn the file, get people to get a cleaning every four weeks instead of every 50 weeks and you're justifying it because there's one little footnote that says more cleanings equals better healthcare, yeah. Well, would you do it for free because if you wouldn't do it for free don't tell me you're doing it out of kindness. Whereas, I feel very confident in saying I would write books for free and I do because I am not writing them to get clients. I don't have any clients. I am doing it because I want to change the culture.</p><h3>Jonathan Stark</h3><p>Yeah and that's a core premise of this podcast. We've done a bunch of episodes on what's your big idea, why do you get out of bed in the morning, what is your purpose here, why bother. If it's just this self-promotional act then that's not interesting and it probably won't work anyway. But the book thing, it's more like, \"Okay, I've got this mission that I'm on. I need to fund it somehow and maybe a book is the way to do it. Maybe it's not. Maybe the book is going to get me consulting gigs and I'll do the book for free or I'll give it away.\"</p><h3>Jonathan Stark</h3><p>I get this pushback a lot of times where people are exactly like you're saying, where they're like, \"Yeah, I'd love to change the world but the people who I want to help can't afford me\" or \"My spouse won't let me do this because he or she's afraid that we will lose our standard of living because I've got this great job with Google, or Facebook or something and I like this idea of going out and helping people do whatever the thing is that they're passionate about.\" It could be spouse. It could be parents. It could be friends. Everybody's kind of like, \"Well, that won't work\" or \"How are you going to keep making $300,000.00 a year? How are you going to keep making even $50,000.00 a year by doing X, Y and Z\" and maybe it's imagined or maybe it's real but I get tons of people who have that fear. I don't think that's completely a comfort thing. Being willing to throw away your standard of living seems a little... That's a pretty tall order.</p><h3>Seth Godin</h3><p>I'm going to interrupt on the last point. I have worked with and know people who's standard of living is $3.00 a day and those people were making three, or five or $10.00 a day. I will not change places with them but on a good day they are happier than you or me and everyone on a good day is happier than someone else. The question is always going to be compared to what. If you're willing to turn off cable TV, eat rice and beans, move to a small little rental on the outskirts of town and ride a bicycle because it will give you the freedom to change your part of the world for the better then go do it. But if you're not, then stop pretending you want to change your corner of the world for the better and just go back to work.</p><h3>Seth Godin</h3><p>The problem is when we're out of alignment between the two, where we want to leave McKinsey, get paid what we got paid at McKinsey, only work with non-profits, only work with clients we're proud of and have the privilege of walking out anytime someone disagrees with us, that's out of alignment, can't happen.</p><h3>Jonathan Stark</h3><p>Perfect, yes, absolutely and you're talking to a guy who did used to be a musician and live in his van, so I totally, totally get it.</p><h3>Rochelle Moulton</h3><p>What if we gave Seth an opportunity to talk about what he'd like to talk about at the very end. You know who our audience is, Seth, people on this road to authority, most have independent businesses. They're trying to make a difference in the world. They want to get paid at the same time. What else would you have to say to them?</p><h3>Seth Godin</h3><p>This is what I came to say. You don't need more time. You just need to decide. You need to decide whether you actually want to change your corner of the culture and if you do you have to find the bravery and the boldness to do it in a way that others will choose to talk about. If you want to just have a job with no boss, you already have that and then you can go find slightly better clients and that's your progression. There's nothing wrong with it but if you're taking the time to listen to two leaders as we have here my guess is you have an itch and what we know is the culture needs you to go scratch it by doing this work. That's my mission and it might be yours.</p><h3>Jonathan Stark</h3><p>Where's the best place for people to go to find out all things Seth?</p><h3>Seth Godin</h3><p>The workshops are all at Akimbo.com, A-K-I-M-B-O, and if you type my name into Google I'm sure you'll find more than you need.</p><h3>Jonathan Stark</h3><p>Yeah, absolutely, folks, definitely check out the blog/daily mailing list. It's fabulous. Seth is the Confucius of marketing.</p><h3>Rochelle Moulton</h3><p>And the books, the books live forever. 10 years old, 20 years old, they're still relevant, highly readable.</p><h3>Seth Godin</h3><p>Well, thank you. That means a lot. I'm going to sign off. Go make a ruckus and thank you both for your time. I appreciate it.</p><h3>Jonathan Stark</h3><p>Thanks so much, Seth.</p><h3>Rochelle Moulton</h3><p>Thank you, Seth.</p>\n",
  "pubDate": "Mon, 14 Oct 2019 10:00:08 +0000",
  "author": "jstark@jonathanstark.com (Seth Godin)",
  "link": "https://thebusinessofauthority.com/episodes/seth-godin-the-generosity-of-authority-AZnoj5hN",
  "content:encoded": "<p>Seth Godin joins us to explain the generosity of authority.</p><h2>Talking Points</h2><ul><li>What “authority” means to Seth</li><li>The first things that Seth thinks of when it comes to funding a mission</li><li>Two different games</li><li>Writing every day</li><li>Levels of freelancing</li><li>Imposter syndrome</li><li>Podcasting</li><li>Akimbo workshops</li><li>Comfort zone vs. safety zone</li><li>Publishing</li><li>Word of mouth</li><li>Writing a book</li><li>Finding your alignment</li><li>Making a decision</li></ul><h2>Quotable Quotes</h2><p>“The more they charge, the more authority they actually get.” –SG</p><p>“If you win the game to be the most generous, then you earn the privilege in the area where you seek to have authority, to exchange status.” –SG</p><p>“If you’re not feeling like an imposter, I would argue, you’re not working hard enough.” –SG</p><p>“If you think your secret is what people are paying for, you’re crazy.” –SG</p><h2>Related Links</h2><p><a href=\"https://www.sethgodin.com/\">Seth Godin</a><br /><a href=\"http://akimboworkshops.mystrikingly.com/\">Akimbo Workshops</a></p><h2>Transcript</h2><h3>Jonathan Stark</h3><p>Hello and welcome to the Business of Authority. I'm Jonathan Stark.</p><h3>Rochelle Moulton</h3><p>And I'm Rochelle Moulton.</p><h3>Jonathan Stark</h3><p>And today we are joined by legendary marketer Seth Godin. Seth, welcome to the show.</p><h3>Seth Godin</h3><p>Thank you for having me.</p><h3>Jonathan Stark</h3><p>Thank you so much for joining us. I'm very excited about this conversation. I've been thinking about it for two years, so I'll try not to pummel you with random questions that are too weird but the first we want to start with, given the show title, it's the Business of Authority, what does the word authority mean to you in the context of a business?</p><h3>Seth Godin</h3><p>That's a great place to start. I don't think it means what most people use the word authority to mean. Authority usually means what a manager has, which is power, which is the ability to get other people to do what want even if they don't want to do it. I would say that in your case what we're actually talking about is reputation. What we're talking about is a variation of trust, which is trust to the power of provability, meaning not only do I trust you but I can go to my partners, my bosses and my employees and insist that they trust you as well because you have earned that through your reputation.</p><h3>Jonathan Stark</h3><p>Yes, I love the distinction. It's not the boss kind of authority. You will \"respect my authorita\", fabulous. Okay, so what are first things that come to mind when someone is starting to establish authority? I think it happens over time, has a lot to do with, like you said, trust and that trust has to exist in something and that something is the audience. So, you're on a mission and authority is on a mission. They're moving toward a vision that they see in the future. They're trying to lead people to that goal. What are the first things that come to mind when you think about funding that mission by building a business around it so that you can keep doing it?</p><h3>Seth Godin</h3><p>There was a pre-question which I'll do first. Yes, as you pointed out it is in the eye of the beholder. There's a funny joke, being headed executive gets bumped off a flight on Delta and marches up to the counter and says, \"Do you know who I am?\", and the person behind the counter gets on the PA system and says, \"Medical alert, we have someone with amnesia at the front desk. He doesn't know who he is.\" If she doesn't know who you are then it doesn't matter who you are and this is the McKinsey Trap. The McKinsey Trap is you're getting paid X number of dollars at McKinsey and you realize they're marking you up 4X, so you quit McKinsey and go out on your own and you can't even get paid a quarter of what you used to get paid. Well, it's the same consultant giving the same advice, so why is there a 16X difference in the comp. The reason is because when you hire McKinsey you are not buying advice. You are buying the privilege of telling the board what McKinsey said and that's what they sell. That is my current definition of useful authority in this case. It has nothing to do with proving you are right and everything to do with the mantel that you have earned in the eye of the consumer.</p><h3>Seth Godin</h3><p>Now, what that gets us is to is this whole riff about status roles because status roles are everything in our culture. Who's up? Who's down? Who gets to eat first? Why is someone dating a supermodel? Why did you buy that car? What neighborhood do you live in? All of these are status exchanges where we are trying to buy safety, or leverage or authority by acquisition of something that gives us a sense of status, so McKinsey maintains their status by acting like a diva, by not making sales calls, by charging extra. The more they charge the more authority they actually get and so while we may be tempted to hustle to get our authority, to somehow prove that we are right we are actually giving up authority when you do that because in our culture the signals that come with authority are not the same as the signals that come from the desperate chase of proving you're right.</p><h3>Jonathan Stark</h3><p>Yeah and that's something we talk about all the time. I think the tricky part for people who are listening who probably agree with that, it's like, \"But you can't start off by acting like a diva\", right? I mean, that doesn't seem to track. There has to be this sort of progression where there's trust built and then later when you're IDEO and you've got every Fortune 500 logo on your homepage and they're all amazing brands, at a certain point it feels like you reach a critical mass and you can maintain that authority position with these status games that you just referred to. Is that the way you start though? You just go out on your own and you play hard to get with your clients. That doesn't seem like it would work.</p><h3>Seth Godin</h3><p>Correct, another great insight. In fact, there's two games and I just described the second game. The first game is a completely different game. It is not a junior version of the other game. It is the game of who can be the most generous, that if you win the game to be the most generous then you earn the privilege in the area where you seek to have authority to exchange status.</p><h3>Seth Godin</h3><p>So, I'll use my example. Not because I have an enormous amount of authority because I haven't sought to do that but you blog every day for a thousand days in a row. That's free. You make YouTube videos. That's free but then someone calls you up to give a speech. That's not free. That's expensive and what that means is you don't give speeches for a while because you're not willing to give a $500.00 speech because people who have something to say don't give $500.00 speeches. You will give a free speech at Ted. You will organize your own conference. Organizing a conference is generous but if you want me to get on a plane and come give a speech to your organization, that's expensive and I'm fine if you don't want to buy it because I got other things I can do that are generous instead.</p><h3>Jonathan Stark</h3><p>Well, that tracks with our normal story here, that's for sure. You may or may not know this but both Rochelle and I are daily emailers inspired by you and a friend of mine, Philip Morgan. It's transformative on your business. It's not just in the sense of you're \"giving away the farm\" so to speak in a particular format and being generous and sharing the ideas, honestly I think of it every day as \"who can I help today,\" how am I going to help them, what can I write today that's going to help the kind of person who's on my list. That's great and it leads to all the things we're talking about, the expensive speeches for example, but the thing about it that it is not obvious from the outside is that it makes the writer better, not just communicating but just like a deeper thinking because you get... After the first three months of writing every day you've burned through all of the trite, obvious stuff and you need to start really digging deep looking for-</p><h3>Seth Godin</h3><p>Exactly.</p><h3>Jonathan Stark</h3><p>Yeah, it's amazing. It is absolutely amazing. It sounds terrifying to people when we suggest that they write every day about a particular, with a particular worldview let's say, not necessarily particular focus but like a worldview and around an idea but it terrifies people. They think like, \"Oh no, I'll never be able to keep up with it. I'll run out of things to write.\" Is there anything you can say to inspire people to perhaps take that leap, take that... It feels risky to people that are scared of it.</p><h3>Seth Godin</h3><p>For sure, I have a riff about the Boston Marathon, which is if you hire a running coach you will not say to her, \"Teach me how to run the Boston Marathon without getting tired.\" In fact, everyone who runs the Boston Marathon is tired. The question is where do you put the tired. If you want to run a marathon you have to be prepared to put the tired somewhere. Well, if you want to be an independent voice with authority you're going to have to do things that feel risky. If you're not prepared to do things that feel risky you should go get a job.</p><h3>Rochelle Moulton</h3><p>Perfect.</p><h3>Jonathan Stark</h3><p>Yes, correct. I want to shift gears a little bit and talk about something I heard you say. I think it was in the marketing seminar. I went through the marketing seminar. It's fabulous. I highly recommend it. I think it was in there that you described yourself as a freelancer at one point.</p><h3>Seth Godin</h3><p>And today as well. I'm back at it, yeah.</p><h3>Jonathan Stark</h3><p>Okay, so I want to talk about that because you're not really like any freelancer I know and I know a lot of freelancers. So, we have this mental framework here on the show about the progression from zero to authority if that's the path that you want to go down. Not everyone does but if it is the path you want to go down with the folks we work with it starts off as a technician who has this skill that they apply on a time basis for it's like a mercenary type of thing, like, \"Hey, do you need some code? I'll write some code. It took me 10 hours. Give me a thousand bucks.\" Then it moves to an area where they're more advisory, consultative, where they're an expert at writing code, or copywriting or photography and they can teach it, or guide people or decrease risk for clients who have a big project that involves that thing. They're sort of moving up the food chain in terms of applying their expertise but they're not applying it directly. They're advising about their expertise.</p><h3>Jonathan Stark</h3><p>Then there's this level above that which we would call an authority where it's more of a thought leadership place where there's an audience that's following you to a destination and there are business models that seem to line up with those three levels. The first one is what I would normally call freelancer where you're a mercenary. You're a \"free lance\" who is available for hire and it's not really... They take any comer who's like, \"Oh, someone wants to hire me to write code or write copy. Great, let's do it.\" Then this middle level, the expert, aligns up with consultant a lot of times or trainer and then the top tier authority a lot of times lines up with speaker, talking head on TV, author. Author's right in the word, so when I heard you say that you saw yourself as a freelancer rather than an entrepreneur, that didn't really track with me-</p><h3>Seth Godin</h3><p>Well, we have a semantic difference here, so I think your three levels are very smart but they are three levels of freelancing and let me make the distinction because of all the single sentences I have uttered on stage more people have told me this has changed their life than just about anything. Freelancers and entrepreneurs are different. Freelancers get paid when they work. Entrepreneurs build something bigger than themselves, so Larry Ellison is an entrepreneur. He does not write code. He does not make sales calls. In fact, Larry Ellison's only job at Oracle is to hire people to do jobs he invents. That's his only job and if he finds himself doing any work whatsoever he's doing something to harm the shareholders.</p><h3>Seth Godin</h3><p>Now, I have been an entrepreneur. I have built companies that changed parts of the world and I didn't like it. I was good at it but I didn't like it because I like doing things with my own two hands. If you read a blog post, I wrote it. If I was an entrepreneur that would be wrong. I should hire someone to write my blog post. If you take a workshop with Akimbo, I created it with my own two hands and then there are people who I think I work for, they don't work for me, who run Akimbo. That's not my job. That's their job and so I'm finding joy by doing the work. Entrepreneurs shouldn't do the work. Jack Dorsey should not be touching code, et cetera.</p><h3>Seth Godin</h3><p>All right, so how do you move up as a freelancer? Well, the way I describe your three tiers is this. You cannot move up as a freelancer by working more hours. The only way to move up is to get better clients. What does it mean to have better clients? Clients who trust you more. Clients who challenge you. Clients who give you more leverage. Clients who pay you better. Better clients will get you better clients because your book will look better. Your work will look better and so the quest, if you are on the authority track, can be defined as what work do I need to do today to get better clients a month from now.</p><h3>Seth Godin</h3><p>If you're just working for hire for anybody, JUUL, some cigarette company, it's not going to help you get better clients, so turn them down. Partly because it would be a moral failing to do the work but mostly because it's going to get in the way of you getting better clients and what I find, and we run a freelancers workshop so I've talked to hundreds and hundreds of freelancers about this, is the fear kicks in and this is the other riff which is imposter syndrome. People say, \"What do I do with imposter syndrome?\" The women who tell me this think only women have it. The men who tell me this think everyone has it but imposter syndrome is this idea that you feel like a fraud and what should I do with this. I don't deserve better clients. I feel like a fraud. Well, and a quick little aside, I used to have a record label and I did it as an experiment. I gave all the money to the artists and one of the artists, a married couple who lived in a van, and they would drive from town to town. They would play at the easily booked coffee shop. Then after they'd been there for two nights they'd drive to the next town.</p><h3>Seth Godin</h3><p>I took them aside and I said, \"Guys, you got to stay in town. Stay in a town and work your way up because it's a better audience. They pay better. The mics work better. Everything is better\" but I could see from the look in their eyes. They didn't think they deserved to play at Passim because they felt like imposters. My answer is, \"Of course you feel like an imposter. If you are doing work that matters you are an imposter. You can't certify that you've done this exact thing before and it's guaranteed to work. You can't, so because you're a good person and an honest person inside you feel like a fraud because you're acting as if, because you're describing a future that isn't here yet and if you're not feeling like an imposter I would argue you are not working hard enough.\"</p><h3>Rochelle Moulton</h3><p>Wow.</p><h3>Jonathan Stark</h3><p>Yeah and by the way, nice shout out to Cambridge. I like that. So, there's a thing in the pricing world, my focus is pricing, and there's a thing in the pricing world called \"selling to your own wallet\" which this reminds me of, where it's not the same thing but it's similar where someone who can't imagine that they would pay X dollars for a watch or whatever. They imagine that no one would. I think that's fairly common. I don't think that's a shocking revelation, like \"Wow, I can't believe somebody would pay a million dollars for Paul Newman's Rolex, that's just insanity\" but someone paid it. Is it insane? Is it not insane? It doesn't really matter. The problem is when you start to apply that to your own business and you think, \"I can't imagine anybody paying me $10,000.00 a month to maybe pick up the phone once in a while.\" Well, you better start imagining it if that's where you want to go and you can't just expect people to start writing you $10,000.00 checks every month if you're not delivering value, so you do have to figure out that puzzle. How can I deliver more than $10,000.00 of value every month to someone by just picking up the phone when they call?</p><h3>Jonathan Stark</h3><p>The paralysis comes from not believing that they're worthy of that, that their expertise is not actually that valuable to anyone because they don't value it as much as they should themselves.</p><h3>Seth Godin</h3><p>Yeah, that's a great point and you know the thing is most of the people you and I, the three of us talk to, don't make their own clothes. If someone came to you and said, \"You must make your own clothes.\" It is not allowed anymore. It's immoral to make your own clothes. We would be annoyed and offended. How dare you? If you stood out front of the fancy watch store, and this is probably a worthwhile exercise and told people on their way in they're not allowed to go in to buy a watch. They're not allowed to buy a wedding ring. Go to a wedding that costs $50,000.00 and start heckling the bride and groom. You're not allowed. No, have some empathy, right? Have some empathy to realize that different people will make different choices about how they're going to spend their money. Your job is once they've made that choice how can you satisfy that need and so when I go out for my anniversary dinner I am not hoping the restaurant will charge me less. I'm hoping that we will have a better time, so that's the restaurateur's job is not to lower the price but to increase what I came for.</p><h3>Seth Godin</h3><p>So, I think it's a little bit of a trap to say, \"I hope I'll get paid a lot of money just to answer the phone.\" I think the right question is how can I create an environment where the people who hire me on retainer see their career's turbocharged because their bosses are so impressed that they're able to call me whenever they want. What would I have to do to make those conditions possible?</p><h3>Jonathan Stark</h3><p>I want to shift gears yet again and talk about podcasting for a second. We mentioned earlier sharing your expertise freely in particular ways and then charging a premium in other formats, say podcasting versus speaking in person. Geez, it's been like five seasons now of the Akimbo podcast I think and I think you've been on a million, maybe a thousand, thousands of podcasts but the only one I was aware of that you publishing was like a recording of a course of some kind or a workshop that you did years ago. Why that change? What made you... Is it something about podcasting? To me, it feels like it might be competing with books as a primary source of authority and then there's this question of self-publish versus traditionally published books. How do you see podcasts fitting into the authority landscape?</p><h3>Seth Godin</h3><p>It's important to note that in addition to being a hypocrite I'm not a very good role model. The reason is because this is my hobby, that this work that I am doing every day... I'm 59 years old. I was born on the right day to the right parents. I won the internet lottery. This is my hobby and so people who try to do what I'm doing because they think I've thought through it, how to maximize something, are going to make a big mistake. Do as I say, not as I do because when I say it I'm describing what I wish I had heard when I was 30. But, I could do all sorts of things to make more money than I make now. Podcasting was an interesting problem five years ago. I'm a new media scholar. That's what I focus on. This is a form of new media. It's disruptive. It's interesting. It's personal so I came up with a podcast but I didn't want to do it because it's too much work and because there are all sorts of other personal things I had about it. Then some podcasting people called me up and called my bluff. They said, \"We have a hunch you've figured out how to do a podcast but we'll pay you\" and I could do a lot of good with that money, so I'm thinking...</p><h3>Seth Godin</h3><p>Well, now I'm stealing money from poor children if I don't do this podcast. I can't keep whining about it. I either got to do it or never speak of it again and so I like these people and I said, \"Sure, this sounds like something to add to my hobby list.\" I will say though, as the person who founded the podcasting fellowship, that in fact, surprise, surprise, it gets you more speaking gigs and I make more from speaking gigs than I make from writing books, that in fact the 100,000 plus people who listen to the podcast prefer my voice to my blog posts and that means that they're likely to want to engage with other changes I'm trying to make in the world but that's not why I made it. I made it because I'm a little bit of an egomaniac. I thought I had something to say and I like the sound of my own voice.</p><h3>Jonathan Stark</h3><p>Well, I love it. I highly recommend people listen to Akimbo and it's not overly produced, maybe like an NPR is super, super heavily produced but you definitely have a lot of sound editing. There's a lot going on there. I applaud you because that is a lot of work. We try and keep things simple here over at the Business of Authority. No music, we've got a no music rule.</p><h3>Jonathan Stark</h3><p>You mentioned the podcast fellowship and then there's the marketing seminar. I think you're up to the eighth one. Tell us a bit about how the Akimbo workshops fit into your master plan. I know you seem like an educator. To me, you've got that great talk about what are schools for. As someone who homeschools their kids I completely resonate with that. For you, is the workshop approach the way to have the biggest impact or is just a hobby and it's just something you like to do?</p><h3>Seth Godin</h3><p>No, this is not a hobby. This is too much work to be a hobby. I do the workshops because I'm a teacher and this is the single, most effective form of teaching I have ever done by a lot. A book can sell a quarter of a million or a million copies and I will change X number of lives where X is a number less than a hundred, maybe it's a thousand. Whereas, when a thousand people take one of our workshops we will change the lives of 500 of them and not all completely but really deeply because doing the work, doing the work together, doing the work in public, is so different than listening to a podcast or an audio book, so I'm still doing the other stuff drip by drip, day by day but when I saw what the altMBA was able to do for people I knew that it would be malpractice to not try to push it forward and then I encourage lots of other people to copy what we're doing because if enough people copy it then I don't have to do it anymore.</p><h3>Jonathan Stark</h3><p>Yeah, me included. I don't know if you even remember but I emailed you after I went through TMS and I was like, \"This format that you've come up with is genius. The combination of the cohort with the lessons dripped out over time and sort of people working through it together, more like study groups and online\", yeah, it's great. You're welcome. That's where the pricing seminar came from because my focus is pricing.</p><h3>Jonathan Stark</h3><p>So, your riff on education is like what's education for. Are we trying to make kids into factory workers? It seems like that's kind of how it's set up, at least how it was setup and there's still a lot of hangover from that. That ties into a concept in the Icarus Deception which absolutely blew my mind about the comfort zone versus the safety zone. I don't need to tell it. Could you riff on the comfort zone versus safety zone and how that fits with education?</p><h3>Seth Godin</h3><p>Anytime you riff on a book that I wrote eight years ago you do need to remind me but in this case I remember.</p><h3>Jonathan Stark</h3><p>Good.</p><h3>Seth Godin</h3><p>So, why are there so many victims of massive change in our world? Why is it that when the world changes people who are supposed to be alert, whether it's Western Union, or the old version of Microsoft... I mean, Steven Ballmer is supposed to know what's going to happen next. That's his job and the same thing's true when we think about people going through school or graduating in enormous amounts of debt. Didn't they see it? Why is there so much pain? Well, the answer is because we have a narrative about where we would be safe. Let's call that our comfort zone. The comfortable thing is to go to a famous college and go into debt to get a piece of paper that will guarantee us a safe job going forward but that is not actually a safe place. It just feels safe. It is simply comfortable and this idea that safe is risky and vice versa is only present when the world changes. When the world is the way the world is then those two are aligned. Safety and comfort among rational people is the same but when the world is changing that's when we make mistakes.</p><h3>Seth Godin</h3><p>So, how will we use our discomfort as a compass to point us to where we will ultimately be safe? I believe that every good person in the book publishing world is going to be out of a job in 20 years and that's because they are doing things that are comfortable right now, not things that are safe. What would be safe is for them to connect directly with readers. What would be safe is for them to explore. They should be in my business, right? They should be running live events. They should be running these interactions, on, and on and on, because that's the safe thing to do. It's just not comfortable and as a result good, hardworking people are going to slam into a wall because one day the backlist isn't going to pay all the bills. The end.</p><h3>Seth Godin</h3><p>To come back to the listeners of this august podcast. There are all sorts of things you conventional do as a freelancer, as a consultant, that are comfortable but I got to tell you in a world where everyone is a click away and where Zoom is a click away they're not safe anymore.</p><h3>Jonathan Stark</h3><p>Right, I get it all the time from students where I'll make some suggestion that, \"Here's a tactic that you could try. It fits with our strategy. We've defined an objective for you. We see where you want to go.\" Tactics, they come and go. You change them. You experiment with them. You see what's going to work different for different people and you can get so much pushback, like change the headline on your site a little bit. Oh, that seems too risky. It's like, \"Well, it's not like it's a lion.\" What's going to happen? Lightening bolts are going to shoot out of the keyword? Risky, how? It's 100% the comfort versus risk thing, so when I read that my head exploded. I was like, \"Oh, right, that's exactly what it is.\"</p><h3>Jonathan Stark</h3><p>In my consulting business I saw the same thing. When I was doing mobile consulting 2010, '11, '12, these big corporations... I wrote a book and corporations were like, \"Yeah, we need this guy. Come in and tell us what to do.\" I would come in and say, \"Well, here's the situation. This is the way it's going to be in five years for sure. Mobile phones are going to be the computing platform. That's it. So, get there. It's going to take a while. You're a huge organization. You need to do these things to get there\" and they wouldn't. It was one of the big reasons I left consulting was because it was like one time where I felt like I was like, \"Wow, I really know what to do here, like this\" and their competitors did it and now they're suffering, the whole thing. They were so, like for a big organization they were so fearful of doing anything that wasn't the norm in a context where everything was changing and you end up with Blockbuster, and Tower Records and all of these companies just disappearing overnight. Things like Airbnb, and Uber and Netflix seemingly out of nowhere but they were enabled by this mobile platform. It's unbelievable.</p><h3>Seth Godin</h3><p>I agree with everything you just said except for the last sentence.</p><h3>Jonathan Stark</h3><p>Okay.</p><h3>Seth Godin</h3><p>It's totally believable! It would be stunning if it wasn't true.</p><h3>Jonathan Stark</h3><p>Sure.</p><h3>Rochelle Moulton</h3><p>Actually I'd like to get Seth's view on this. Comfortable versus safe, if you're an authority or you're on the authority track, you're consulting, you're freelancing and you've got a big idea and you think it's a book. What's the comfortable versus safe approach for publishing or producing a book now?</p><h3>Seth Godin</h3><p>Okay, so we're going to go as quick as we can through this book thing. First thing, a book is a Proustian souvenir that for many people of many ages but all of us over 30 means something. To some people it means school and it is to be avoided. To some people it means status. To some people it means wisdom, a level of achievement. Just the presence of the thing is different than saying, \"I took all of these ideas and tweeted them\", that the object itself has a value.</p><h3>Seth Godin</h3><p>Now, publishing is not the same as printing. Anyone can print. It is cheap. Publishing is about taking financial risk to get people who are unaware of an idea to become aware of it and pay money for it. That's what publishers do. The number of actual publishers in the US is very small and the imprimatur that they provide certainly has value but less than it used to because if you can print a document that looks just like what they would do to the uninitiated it is the same thing. Now, this leads to one of many pitfalls.</p><h3>Seth Godin</h3><p>Pitfall number one is you do the comfortable thing, which is you cut little, tiny corners that you don't think anyone will notice and your self-published book is obviously self-published and then not only haven't you succeeded, you've failed because you're so desperate you're self-publishing your book in a pretend effort at authority. So, it would have been better if you had done nothing.</p><h3>Seth Godin</h3><p>We did a book for charity last year and it took my creative director and I, between us, 400 hours to make it look like a real book. It's not something you just upload to CreateSpace and you're done.</p><h3>Seth Godin</h3><p>Now, when you get a book then you've come to the conclusion that now you need to make it a bestseller because that's where the status really lies. Well, what's obvious to anyone in the industry is you can buy your slot on the New York Times Bestseller list now, so it's now worth nothing. Don't even bother because everyone's doing it. They're all buying their way. It doesn't mean nearly as much as you think and so it's just this huge distraction where we believe we are about to be judged so we spend an unreasonable amount of time and money for this signifier that's not actually much of a signifier at all.</p><h3>Seth Godin</h3><p>The real signifier is did someone other than you tell me about your book. That is the signifier because now the book is serving its true function which is it is a permanent container for the ideas of a single person. If someone tells me about your book, your book has just increased your authority. What we have to begin with is you have to write a book that other people will choose to talk about in a way that gives you authority. That is really hard to do. Do that first. Don't worry about the tactics of how can I get Adrian Zackheim to publish my book at Penguin in a thinly veiled attempt to become seen as some sort of authority.</p><h3>Seth Godin</h3><p>So, when I published Purple Cow I was on the outs. My previous publisher, Simon and Schuster, had fired me because my book before that they didn't understand and it did very poorly and so I self-published Purple Cow years before self-publishing was easy and I put it in a milk carton-</p><h3>Jonathan Stark</h3><p>Just to make it easier on yourself.</p><h3>Seth Godin</h3><p>I could tell you an hour's worth of stories about that but the punchline was if you bought the 10 pack or the 12 pack of the milk carton you gave it away and the act of you giving it away is where I got my authority from and it became the bestselling marketing book of the decade because people talked about it, not because my publisher which I ended up acquiring, did a good job of publishing it. That's silly. They don't do a good job of publishing anything.</p><h3>Seth Godin</h3><p>I guess what my rant is about is you're already in one business. Don't try to get yourself into another business of being a publisher. You're probably going to be terrible at it. If you're going to make a printed artifact open your wallet, blow out the dust and spend the money to make it magnificent and the way you do that is by going to the bookstore, finding a book that already has authority, handing it to your printer/designer and saying, \"It has to look exactly like this\", same paperweight, same paper stock, same typeface, same trim size, same embossing. Copy this. All your ideas, all your words, no one cares about that. It's got to look and feel right.</p><h3>Seth Godin</h3><p>Okay, so then you say, not how do I get everyone in America to read this. Everyone in America isn't going to read it. You say, \"Who are the 250 people who if they read this and told someone else I would be on my way and then you, or even better a more prestigious colleague of yours, send the book free to those 250 people. If those 250 people after getting the book don't talk about you didn't right a good enough book. The end.</p><h3>Rochelle Moulton</h3><p>Wow.</p><h3>Jonathan Stark</h3><p>Yes, thank you for that.</p><h3>Rochelle Moulton</h3><p>Love it.</p><h3>Jonathan Stark</h3><p>My takeaway from that is what's important is word of mouth, not a book. Is that fair?</p><h3>Seth Godin</h3><p>Yeah, the book is simply a way to create an artifact that works harder for you every day than you could do without it.</p><h3>Jonathan Stark</h3><p>Okay, so where my brain is going is, is the word of mouth of, \"Hey, you should listen to Akimbo\" or \"Hey, you should listen to the Business of Authority\", is that kind of word of mouth... Do you think that carries the same kind of weight because I'm starting to think it does?</p><h3>Seth Godin</h3><p>It might carry even more. It depends on whether your book can enjoy word of mouth without people reading it.</p><h3>Jonathan Stark</h3><p>Wow.</p><h3>Rochelle Moulton</h3><p>That's the challenge.</p><h3>Seth Godin</h3><p>Thomas Piketty has benefited from this. His book, Capital, is the most unread book published that year. We know this for a fact. If we multiply the number of people who purchased it times the percentage in the Kindle that was indicated that they read, it had more unread pages than any other book of the year but-</p><h3>Jonathan Stark</h3><p>That's brutal.</p><h3>Seth Godin</h3><p>Yeah but it's true and after reading 10 pages you knew everything you needed to know to talk about the book and so the book served its purpose. The book was not a ripoff. You got your $30.00's worth which is after reading 10 pages you knew enough to be able to talk with some confidence about the inequity in our society and recommend that people who disagreed with you read the whole book.</p><h3>Jonathan Stark</h3><p>Yeah, it's painful actually but it makes sense. I feel like it gets back to the status a little bit, like you want to say you read it or you want to be on your bookshelf. You want to be the kind of person who you think agrees with it. You're more buying it as an artifact or a conversation piece than an educational type of thing.</p><h3>Seth Godin</h3><p>Right, so one thing you could do if you were in the pricing business and you wanted to be the most expensive pricing consultant is you could take everything you know, put it into a loose leaf binder, only make 400 of them, hand number each one and give them to your best clients with extracting a promise that they will not make copies and share with other people. Then they will and once people start getting this priceless notebook which is handed from person to person they will realize it's too much work for them to go through all of it. They'll call you and hire you.</p><h3>Jonathan Stark</h3><p>I 100% agree with that. That would totally work. That is so funny. I don't know. I feel like we're bashing books a little bit here.</p><h3>Seth Godin</h3><p>Not at all, books have been very, very good to me. Just use them for the right reason. That's all I'm saying.</p><h3>Jonathan Stark</h3><p>Yeah and we talked about that in the past where it's like if you're going to write a book, both of us, our general advice is first decide who it's for. Not just like, \"I want to write a book with this title.\" It's like who's this for. Who's going to be transformed by this? Then start working out, okay, now that I know who it's for here's the way I need to deliver this information. It seems obvious to me because I've got the curse of knowledge. How am I going to deliver it to this particular person in the most effective way that is going to turn that light bulb on for them?</p><h3>Jonathan Stark</h3><p>Okay, so that's how I would approach writing any book. It needs to be good for the reader but then we also categorize into where do you see this book fitting into your business. Is this going to be a 300 page business card that you use to get consulting clients or is this going to be like a revenue stream that you want to actually be bringing in money every month from selling this directly?</p><h3>Seth Godin</h3><p>I think it's the third one.</p><h3>Jonathan Stark</h3><p>Okay.</p><h3>Seth Godin</h3><p>You only said two. The third one is I would like to change my pocket of the culture to create an environment that helps the people I seek to serve and that also allows me to be a participant in how it moves forward.</p><h3>Jonathan Stark</h3><p>Okay, that's fair. I wouldn't use a book for that though.</p><h3>Seth Godin</h3><p>Well, it depends. If you're Bruce Schneier and you're the leading computer security expert then your book on that, or if you're Don Norman and you're the leading expert on user-centric design, or you're the guys at... I can go down the list of the people you've heard of who have actually changed a culture by earning the privilege to change the culture by having the chops to put it in writing and say this. They gave away everything they knew because you have to give away everything you know because if you think your secret is what people are paying for you're crazy.</p><h3>Rochelle Moulton</h3><p>I was just thinking. It made me think of something I heard you say, Seth, that writing a book is a generous act.</p><h3>Seth Godin</h3><p>Yeah.</p><h3>Rochelle Moulton</h3><p>Do you feel it was generous in some of those examples? Can you talk more about that generosity?</p><h3>Seth Godin</h3><p>The generous act to write a good book and what that means is that the reader cannot tell what your incentive is other than you're trying to make things better. In the business world we can sniff it out immediately, when you are... I'm not going to mention this super agent because that's why they write the book, so I would mention them but if it's just one, self-aggrandizing anecdote after another, well yeah, now we know why you wrote the book but we got nothing out of it. But, the magic of a book is... I wrote the Icarus Deception however many years ago and it's still doing things for people with no incremental effort on my part. Another reader costs me nothing. The fact that I make it huller, maybe the advanced learn or not. I have no idea. I don't keep track but that's not why a good author talks about her book. A good author talks about her book because she knows she's probably never going to get another royalty check but if another person would read the book things would be better.</p><h3>Rochelle Moulton</h3><p>Yeah, it's that transformation that you're trying to make with the idea inside your book.</p><h3>Seth Godin</h3><p>Let's get back to I have no idea how many people are listening to this but my guess is that 92% of them act in selfish, short-term ways because they're afraid, because they're afraid they don't have anything really important to say because they're afraid if they blow up their industry by giving away the secrets they will be ostracized because they don't want to be on the spot because they don't actually want be the leader.</p><h3>Seth Godin</h3><p>And so what they do is they think small. They play small ball. They try to transact and that's why they're still frustrated. It's interesting. My son gets Dental Town magazine and Dental Town magazine, if you have any fear of the dentist you should not read Dental Town magazine because there are articles about basically how to under serve your patients so they'll pay you more.</p><h3>Jonathan Stark</h3><p>Oh man.</p><h3>Rochelle Moulton</h3><p>Ouch.</p><h3>Seth Godin</h3><p>And, you don't want dentists doing that. You want a dentist who decides that the best way to be a successful dentist is to get better dental patients and to make it so that they don't have to come very often because if you do those two things they will talk about you, there'll be a waiting list, and on, and on and on. On the other hand if you're trying to churn the file, get people to get a cleaning every four weeks instead of every 50 weeks and you're justifying it because there's one little footnote that says more cleanings equals better healthcare, yeah. Well, would you do it for free because if you wouldn't do it for free don't tell me you're doing it out of kindness. Whereas, I feel very confident in saying I would write books for free and I do because I am not writing them to get clients. I don't have any clients. I am doing it because I want to change the culture.</p><h3>Jonathan Stark</h3><p>Yeah and that's a core premise of this podcast. We've done a bunch of episodes on what's your big idea, why do you get out of bed in the morning, what is your purpose here, why bother. If it's just this self-promotional act then that's not interesting and it probably won't work anyway. But the book thing, it's more like, \"Okay, I've got this mission that I'm on. I need to fund it somehow and maybe a book is the way to do it. Maybe it's not. Maybe the book is going to get me consulting gigs and I'll do the book for free or I'll give it away.\"</p><h3>Jonathan Stark</h3><p>I get this pushback a lot of times where people are exactly like you're saying, where they're like, \"Yeah, I'd love to change the world but the people who I want to help can't afford me\" or \"My spouse won't let me do this because he or she's afraid that we will lose our standard of living because I've got this great job with Google, or Facebook or something and I like this idea of going out and helping people do whatever the thing is that they're passionate about.\" It could be spouse. It could be parents. It could be friends. Everybody's kind of like, \"Well, that won't work\" or \"How are you going to keep making $300,000.00 a year? How are you going to keep making even $50,000.00 a year by doing X, Y and Z\" and maybe it's imagined or maybe it's real but I get tons of people who have that fear. I don't think that's completely a comfort thing. Being willing to throw away your standard of living seems a little... That's a pretty tall order.</p><h3>Seth Godin</h3><p>I'm going to interrupt on the last point. I have worked with and know people who's standard of living is $3.00 a day and those people were making three, or five or $10.00 a day. I will not change places with them but on a good day they are happier than you or me and everyone on a good day is happier than someone else. The question is always going to be compared to what. If you're willing to turn off cable TV, eat rice and beans, move to a small little rental on the outskirts of town and ride a bicycle because it will give you the freedom to change your part of the world for the better then go do it. But if you're not, then stop pretending you want to change your corner of the world for the better and just go back to work.</p><h3>Seth Godin</h3><p>The problem is when we're out of alignment between the two, where we want to leave McKinsey, get paid what we got paid at McKinsey, only work with non-profits, only work with clients we're proud of and have the privilege of walking out anytime someone disagrees with us, that's out of alignment, can't happen.</p><h3>Jonathan Stark</h3><p>Perfect, yes, absolutely and you're talking to a guy who did used to be a musician and live in his van, so I totally, totally get it.</p><h3>Rochelle Moulton</h3><p>What if we gave Seth an opportunity to talk about what he'd like to talk about at the very end. You know who our audience is, Seth, people on this road to authority, most have independent businesses. They're trying to make a difference in the world. They want to get paid at the same time. What else would you have to say to them?</p><h3>Seth Godin</h3><p>This is what I came to say. You don't need more time. You just need to decide. You need to decide whether you actually want to change your corner of the culture and if you do you have to find the bravery and the boldness to do it in a way that others will choose to talk about. If you want to just have a job with no boss, you already have that and then you can go find slightly better clients and that's your progression. There's nothing wrong with it but if you're taking the time to listen to two leaders as we have here my guess is you have an itch and what we know is the culture needs you to go scratch it by doing this work. That's my mission and it might be yours.</p><h3>Jonathan Stark</h3><p>Where's the best place for people to go to find out all things Seth?</p><h3>Seth Godin</h3><p>The workshops are all at Akimbo.com, A-K-I-M-B-O, and if you type my name into Google I'm sure you'll find more than you need.</p><h3>Jonathan Stark</h3><p>Yeah, absolutely, folks, definitely check out the blog/daily mailing list. It's fabulous. Seth is the Confucius of marketing.</p><h3>Rochelle Moulton</h3><p>And the books, the books live forever. 10 years old, 20 years old, they're still relevant, highly readable.</p><h3>Seth Godin</h3><p>Well, thank you. That means a lot. I'm going to sign off. Go make a ruckus and thank you both for your time. I appreciate it.</p><h3>Jonathan Stark</h3><p>Thanks so much, Seth.</p><h3>Rochelle Moulton</h3><p>Thank you, Seth.</p>\n",
  "enclosure": "",
  "itunes:title": "Seth Godin - The Generosity of Authority",
  "itunes:author": "Seth Godin",
  "itunes:image": "",
  "itunes:duration": "00:42:03",
  "itunes:summary": "Seth Godin joins us to explain the generosity of authority.",
  "itunes:subtitle": "Seth Godin joins us to explain the generosity of authority.",
  "itunes:keywords": "marketing",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 100
}