{
  "title": "Entanglement complexity of the Rokhsar-Kivelson-sign wavefunctions. (arXiv:2211.01428v1 [quant-ph])",
  "link": "http://arxiv.org/abs/2211.01428",
  "description": "<p>In this paper we study the transitions of entanglement complexity in an\nexemplary family of states - the Rokhsar-Kivelson-sign wavefunctions - whose\ndegree of entanglement is controlled by a single parameter. This family of\nstates is known to feature a transition between a phase exhibiting volume-law\nscaling of entanglement entropy and a phase with sub-extensive scaling of\nentanglement, reminiscent of the many-body-localization transition of\ndisordered quantum Hamiltonians [Physical Review B 92, 214204 (2015)]. We study\nthe singularities of the RK-sign wavefunctions and their entanglement\ncomplexity across the transition using several tools from quantum information\ntheory: fidelity metric; entanglement spectrum statistics; entanglement entropy\nfluctuations; stabilizer R\\'enyi Entropy; and the performance of a\ndisentangling algorithm. Across the whole volume-law phase the states feature\nuniversal entanglement spectrum statistics. Yet a \"super-universal\" regime\nappears for small values of the control parameter in which all metrics become\nindependent of the parameter itself; the entanglement entropy as well as the\nstabilizer R\\'enyi entropy appear to approach their theoretical maximum; the\nentanglement fluctuations scale to zero as in output states of random universal\ncircuits, and the disentangling algorithm has essentially null efficiency. All\nthese indicators consistently reveal a complex pattern of entanglement. In the\nsub-volume-law phase, on the other hand, the entanglement spectrum statistics\nis no longer universal, entanglement fluctuations are larger and exhibiting a\nnon-universal scaling; and the efficiency of the disentangling algorithm\nbecomes finite. Our results, based on model wavefunctions, suggest that a\nsimilar combination of entanglement scaling properties and of entanglement\ncomplexity features may be found in high-energy Hamiltonian eigenstates.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/quant-ph/1/au:+Piemontese_S/0/1/0/all/0/1\">Stefano Piemontese</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Roscilde_T/0/1/0/all/0/1\">Tommaso Roscilde</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Hamma_A/0/1/0/all/0/1\">Alioscia Hamma</a>"
}