{
  "title": "563: Analyzing Eulalie Hicks, Our Favorite New Character",
  "link": "https://audioboom.com/posts/8084426",
  "itunes:episode": 563,
  "itunes:title": "Analyzing Eulalie Hicks, Our Favorite New Character",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3669,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In their first dedicated character discussion since the premiere of <em>Secrets of Dumbledore</em>, the hosts of MuggleCast turn the pages of their study guides to Professor Eulalie Hicks of Ilvermorny! \"Lally\" was a huge highlight of the third <em>Beasts</em> film, and we're here to say why that was. Join Andrew, Eric, Micah and Laura as they analyze the character through her words, attitude and relationships. It's a fun episode for sure.<br>\n<br>\n\n</div>\n<ul>\n<li>Main Discussion: Professor Eulalie \"Lally\" Hicks in <em>Secrets of Dumbledore</em>\n</li>\n<li>Going back to the first section he ever headed on MuggleNet, Micah starts us off with Lally's Name Origin</li>\n<li>Jessica Williams, who portrays Lally, was herself a big Harry Potter fan, and even shares his birthday!</li>\n<li>The announcement of Jessica's casting likely took place at the next table over from Andrew, Eric and Micah when they saw <em>Cursed Child</em> on Broadway.</li>\n<li>What makes Eulalie a member of Thunderbird house? It's been a while since the hosts had a chance to talk about Ilvermorny canon.</li>\n<li>As a Charms professor, Eulalie's surely competent in some of our favorite Charms, which we recap.</li>\n<li>Lally, like Newt, wrote a book which is widely circulated. She also has a unique-looking wand.</li>\n<li>Professor Hicks and Professor Hagrid both share a job title in common! But... what does it mean?</li>\n<li>We received some insightful e-mails regarding Lally's \"Transatlantic\" accent, a relic of <a href=\"https://www.youtube.com/watch?v=ea9_Xh9ZphI&feature=youtu.be\">Old Hollywood in the 1930's and 40's</a>.</li>\n<li>Lally's friendhsip with Jacob is a reason to see the film, even if it got off to a rocky (problematic?) start. The hosts discuss.</li>\n<li>What do we see happening between Theseus and Lally romantically, if anything, and why?</li>\n<li>Andrew's idea for a Eulalie Hicks spinoff TV show will have you ready and waiting for the first season.</li>\n<li>Quizzitch: What did students have to do in their end of year exam for Charms class in Harry’s year one?</li>\n<li>This week's episode is brought to you by <a href=\"https://www.framebridge.com\">Framebridge</a> (Use promo code MUGGLE for 15% off your first order), <a href=\"https://warbyparker.com/mugglecast\">Warby Parker</a> (Go to <a href=\"http://WarbyParker.com/mugglecast\">WarbyParker.com/mugglecast</a> and try five pairs for free right at home), and <a href=\"https://www.shudder.com\">AMC Shudder</a> (Use code MUGGLECAST for 30 days of Shudder for free)</li>\n</ul>\n",
  "pubDate": "Tue, 17 May 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-05-16:/posts/8084426",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}