{
  "title": "Ranking-based Group Identification via Factorized Attention on Social Tripartite Graph. (arXiv:2211.01830v1 [cs.SI])",
  "link": "http://arxiv.org/abs/2211.01830",
  "description": "<p>Due to the proliferation of social media, a growing number of users search\nfor and join group activities in their daily life. This develops a need for the\nstudy on the ranking-based group identification (RGI) task, i.e., recommending\ngroups to users. The major challenge in this task is how to effectively and\nefficiently leverage both the item interaction and group participation of\nusers' online behaviors. Though recent developments of Graph Neural Networks\n(GNNs) succeed in simultaneously aggregating both social and user-item\ninteraction, they however fail to comprehensively resolve this RGI task. In\nthis paper, we propose a novel GNN-based framework named Contextualized\nFactorized Attention for Group identification (CFAG). We devise tripartite\ngraph convolution layers to aggregate information from different types of\nneighborhoods among users, groups, and items. To cope with the data sparsity\nissue, we devise a novel propagation augmentation (PA) layer, which is based on\nour proposed factorized attention mechanism. PA layers efficiently learn the\nrelatedness of non-neighbor nodes to improve the information propagation to\nusers. Experimental results on three benchmark datasets verify the superiority\nof CFAG. Additional detailed investigations are conducted to demonstrate the\neffectiveness of the proposed framework.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Yang_M/0/1/0/all/0/1\">Mingdai Yang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_Z/0/1/0/all/0/1\">Zhiwei Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yang_L/0/1/0/all/0/1\">Liangwei Yang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_X/0/1/0/all/0/1\">Xiaolong Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_C/0/1/0/all/0/1\">Chen Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Peng_H/0/1/0/all/0/1\">Hao Peng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yu_P/0/1/0/all/0/1\">Philip S. Yu</a>"
}