{
  "title": "Episode 101: The Psychology of Music: The Role of Expectations and Minor Chords",
  "pubDate": "Sat, 01 Aug 2009 11:39:33 +0000",
  "guid": "episode-101-the-psychology-of-music-the-role-of",
  "link": "http://www.thepsychfiles.com/2009/08/episode-101-the-psychology-of-music-the-role-of-expectations-and-minor-chords/",
  "itunes:image": "",
  "description": "How does music affect us emotionally?  Why do minor chords sound so sad? In this episode of The Psych Files I explore ideas from Daniel Leviton's fascinating book, Your Brain on Music, especially those ideas concerned with what composers do to draw you into their music by first conforming to your musical expectations and then carefully confounding them in order to surprise and delight. I talk with guitarist and composer David Temple to get his perspective on this process as well.  Along the way you'll hear excerpts from some fascinating pieces of music and David and I will discuss what makes them so compelling, especially those in the minor key.  My My piano playing skills are pretty rough but get ready for some fun.",
  "content:encoded": "How does music affect us emotionally?  Why do minor chords sound so sad? In this episode of The Psych Files I explore ideas from Daniel Leviton's fascinating book, Your Brain on Music, especially those ideas concerned with what composers do to draw you into their music by first conforming to your musical expectations and then carefully confounding them in order to surprise and delight. I talk with guitarist and composer David Temple to get his perspective on this process as well.  Along the way you'll hear excerpts from some fascinating pieces of music and David and I will discuss what makes them so compelling, especially those in the minor key.  My My piano playing skills are pretty rough but get ready for some fun.",
  "enclosure": "",
  "itunes:duration": "44:35",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,of,music,psychology,lecture,Daniel,levitin",
  "itunes:subtitle": "How does music affect us emotionally?  Why do minor chords so sad? In this episode of The Psych Files I explore ideas from Daniel Leviton's fascinating book, Your Brain on Music.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "How does music affect us emotionally? Why do minor chords sound so sad? In this episode of The Psych Files I explore ideas from Daniel Leviton's fascinating book, Your Brain on Music, especially those ideas concerned with what composers do to draw you into their music by first conforming to your musical expectations and then carefully confounding them in order to surprise and delight. I talk with guitarist and composer David Temple to get his perspective on this process as well. Along the way you'll hear excerpts from some fascinating pieces of music and David and I will discuss what makes them so compelling, especially those in the minor key. My My piano playing skills are pretty rough but get ready for some fun."
}