{
  "id": "yt:video:cfKr6rnpakE",
  "yt:videoId": "cfKr6rnpakE",
  "yt:channelId": "UC-3SbfTPJsL8fJAPKiVqBLg",
  "title": "Fire Ants Turn Into a Stinging Life Raft to Survive Floods | Deep Look",
  "link": "",
  "author": {
    "name": "Deep Look",
    "uri": "https://www.youtube.com/channel/UC-3SbfTPJsL8fJAPKiVqBLg"
  },
  "published": "2022-09-27T12:56:44+00:00",
  "updated": "2022-11-02T13:35:05+00:00",
  "media:group": {
    "media:title": "Fire Ants Turn Into a Stinging Life Raft to Survive Floods | Deep Look",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "During hurricane season, as floodwater flows into their nest, red fire ants build a terrifying raft – out of their own interlocking bodies. If you wade into this ant raft nightmare, you’ll likely get a vicious bite and sting.\n\nSUBSCRIBE to Deep Look! https://www.youtube.com/user/kqeddeeplook?sub_confirmation=1\nPlease join our community on Patreon! https://www.patreon.com/deeplook\n\nDEEP LOOK is a ultra-HD (4K) short video series created by KQED San Francisco and presented by PBS Digital Studios. See the unseen at the very edge of our visible world. Explore big scientific mysteries by going incredibly small. \n\n-- \n\nDuring hurricane season, as residents of states like Florida, Texas, Louisiana and South Carolina escape rising waters, they sometimes have the added misfortune of wading into large groups of floating red fire ants that have assembled into a raft. These ants, whose scientific name is Solenopsis invicta, are also known as red imported fire ants or RIFA because they arrived in the United States from South America. There, they evolved on the margins of rivers that flood regularly, in an area that encompasses western Brazil, northern Argentina, Paraguay and Bolivia. \n\n---+ What happens if a red fire ant bites you?\n\nIt’s more accurate to say that red fire ants bite *and*  sting. They use their large mandibles to grab onto the skin and anchor themselves. Then, they dig their stinger in – sometimes multiple times – and inject venom. An itchy welt pops up at the site of the sting and later turns into a pus-filled blister called a pustule. A small number of people are allergic to red fire ant venom and can go into anaphylactic shock and die if they don’t receive prompt medical care. \n\n---+ Why are red imported fire ants a problem?\n\nIn addition to their stings, red imported fire ants damage crops, hurt livestock and displace native ants. \n\n---+ Find additional resources and a transcript on KQED Science:\n\nhttps://www.kqed.org/science/1980343/fire-ants-turn-their-babies-into-a-stinging-life-raft \n\n---+ More Great Deep Look episodes:\n\nKidnapper Ants Steal Other Ants’ Babies - And Brainwash Them\nhttps://youtu.be/sC4MjPKf3jY\n\nHoneypot Ants Turn Their Biggest Sisters into Jugs of Nectar\nhttps://youtu.be/Rid_YW3P8CA\n \nWhere Are the Ants Carrying All Those Leaves?\nhttps://youtu.be/-6oKJ5FGk24\n\n🏆Congratulations🏆 to these fans on our Deep Look Community Tab to correctly answer our GIF challenge! \n\nMayur Agrawal\nDeath is our worst Enemy\nPreet Budhwani\nGaz L\n\n---+ Thank you to our Top Patreon Supporters ($10+ per month)!\n\nJessica\nBurt Humburg\nKaren Reynolds\nDaisuke Goto\nAllison & Maka Masuda\nDavid Deshpande\nChris B Emrick\nCompanion Cube\nTianxing Wang\nMark Jobes\nKevin Judge\nBlanca Vides\nJana Brenning \nLaurel Przybylski \nAurora \nJason Jia\nmonoirre \nTitania Juang\nRoberta K Wright\nKW \nSupernovabetty \nAnastasia Grinkevic\nEl Samuels\nKimberly Hall\nCarrie Mukaida\nJellyman\nJessica Hiraoka\nNicky Orino\nCristen Rasmussen\nCindy McGill\nMehdi\nNoreen Herrington\nShonara Rivas\nKelly Hong\nSueEllen McCann\nMisia Clive\nLaurel Przybylski\nNicolette Ray\nCaitlin McDonough\nShonara Rivas \nLouis O'Neill\n吳怡彰 \nShelley Pearson Cranshaw\nElizabeth Ann Ditz\nJeremiah Sullivan\nDelphine Tseng\nWade Tregaskis\nLevi Cai\nTierZoo \nSilvan\nSyniurge \nKenneth Fyrsterling\n\n---+ Follow Deep Look and KQED Science on social:\n \nhttps://www.tiktok.com/@deeplookofficial\nhttps://www.patreon.com/deeplook\nInstagram: https://www.instagram.com/kqedscience\nTwitter: https://www.twitter.com/kqedscience\n\n---+ About KQED\n \nKQED, an NPR and PBS affiliate in San Francisco, CA, serves Northern California and beyond with a public-supported alternative to commercial TV, radio and web media. Funding for Deep Look is provided in part by PBS Digital Studios. Deep Look is a project of KQED Science, the largest science and environment reporting unit in California. KQED Science is supported by the Dirk and Charlene Kabcenell Foundation, Campaign 21 and the members of KQED.\n\n#solenopsisinvicta #antraft #fireants",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}