{
  "id": "yt:video:0VdixO5GEz4",
  "yt:videoId": "0VdixO5GEz4",
  "yt:channelId": "UCohJ129sdAX08pkeCyQL9Jw",
  "title": "Learn How To Pronounce ANY French Word or Phrase - Best Free Resource",
  "link": "",
  "author": {
    "name": "Learn French With Frencheezi",
    "uri": "https://www.youtube.com/channel/UCohJ129sdAX08pkeCyQL9Jw"
  },
  "published": "2020-09-22T14:31:05+00:00",
  "updated": "2022-05-25T01:02:20+00:00",
  "media:group": {
    "media:title": "Learn How To Pronounce ANY French Word or Phrase - Best Free Resource",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Ever wondered how to pronounce a particular French word or phrase? I'm sure you have. French pronunciation can be rather puzzling at times! And whilst google translate is often pretty accurate, it's not always so and it's quite robotic! In this video I share an amazing free resource where you'll be able to listen to any French word or phrase, pronounced by native French speakers! And just so you know, in case you're learning other foreign languages, French is only one of the languages covered on this website! So, please go and check it out. You'll wonder how you ever managed without!\n\nP.S: This video is NOT sponsored. I just use the site myself and thought you'd also find it useful! \n&#13;\n_____&#13;\n&#13;\n// I T A L K I   P R O M O&#13;\n▶️ http://promos.italki.com/frencheezee&#13;\n(this is an affiliate link)&#13;\n&#13;\n_____&#13;\n&#13;\n// P A T R E O N&#13;\nSupport my work and get cool rewards!&#13;\n▶️ https://www.patreon.com/frencheezi&#13;\n&#13;\n_____&#13;\n&#13;\n// W A T CH   N E X T&#13;\n&#13;\nTOP 30 FRENCH PHRASES BEGINNER EDITION&#13;\n▶️ https://www.youtube.com/watch?v=V96wrSZFzCE&#13;\n&#13;\nTOP 30 FRENCH PHRASES INTERMEDIATE EDITION&#13;\n▶️ https://www.youtube.com/watch?v=8sXE54qMlyY&#13;\n&#13;\nTOP 10 BASIC FRENCH WORDS&#13;\n▶️ https://www.youtube.com/watch?v=ixUsp-vvbMM&#13;\n&#13;\n&#13;\n_____&#13;\n&#13;\n// F O L L O W   M E&#13;\n▶️ Facebook | http://www.facebook.com/pages/frencheezi&#13;\n▶️ Twitter | https://twitter.com/frencheezi&#13;\n▶️ Instagram | https://instagram.com/frencheezi&#13;\n&#13;\n_____&#13;\n&#13;\n// A B O U T   M E&#13;\n&#13;\nBonjour ! I'm Cindy, a native French speaker. I moved to the UK in 2005,  am now bilingual in French and English, have a degree in modern languages (English and Spanish) and a passion for teaching French. I wish you good luck on your French learning journey, and if you ever have any doubts or questions regarding a particular aspect of the language, give me a shout! I'm always happy to help!  &#13;\n&#13;\n_____&#13;\n&#13;\n// DISCLOSURE&#13;\n&#13;\nFrom time to time I use affiliate links in my videos. When this is the case, I always disclose it. Purchasing through an affiliate link will never affect you negatively and may even give you a discount not available to other customers. I will also get a small commission, helping me run this channel. Thank you for trusting me with my truthful opinion.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}