{
  "title": "2022 Global Economic Outlook, Pt. 1: Optimism in the New Year",
  "description": "<p>Andrew Sheets speaks with Chief Global Economist Seth Carpenter on Morgan Stanley’s more optimistic economic outlook for 2022 and how consumer spending, labor, and inflation contribute to that story.</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market. I'm Andrew Sheets, Chief Cross Asset Strategist for Morgan Stanley Research.</p><p><br></p><p><strong>Seth Carpenter </strong>And I'm Seth Carpenter. I'm Morgan Stanley's Chief Global Economist.</p><p><br></p><p><strong>Andrew Sheets </strong>And on part one of this special episode of Thoughts on the market, we'll be discussing the 2022 outlook for the global economy and how that outlook could impact markets in the coming year. It's Thursday, November 18th at 5:00 p.m. in London.</p><p><br></p><p><strong>Seth Carpenter</strong> And that makes it noon in New York City.</p><p><br></p><p><strong>Andrew Sheets </strong>So, Seth, welcome to Thoughts on the Market. You are Morgan Stanley's new chief global economist and, while we've just sat down to work on our year ahead outlook and we're going to discuss that, I was hoping you could just give listeners a little background around yourself and what brings you to this role?</p><p><br></p><p><strong>Seth Carpenter </strong>Thanks, Andrew. This has been a great experience for me working on the outlook as my introduction to Morgan Stanley. I guess I've been here just a few months now. Before coming to Morgan Stanley, I was at another big sell-side bank for a few years, spent a little time on the buy-side. But most of my career, I have to say, I spent in Washington DC. I spent 15 years of my career at the Federal Reserve working on all sorts of aspects about monetary policy. And then I spent two and a half years at the U.S. Treasury Department. So, I'm really, really a product of Washington more than I am Wall Street.</p><p><br></p><p><strong>Andrew Sheets</strong> Well, that's great. And so well, let's get right into it because, you know, this is a big collaborative process that you and I and a lot of our colleagues work on. And so let's start with that global economic picture. You know, as you step back and you think about our expectations, how good is the global economy going to be next year?</p><p><br></p><p><strong>Seth Carpenter </strong>Yeah, I have to say our economics team around the world is actually fairly optimistic-- call it bullish-- relative to consensus. When I think about the global economy, clearly the two biggest economies are the U.S. and China. And so starting with the U.S., Ellen Zentner, our chief U.S. economist, has an outlook that the U.S. economy is going to slow down next year, but boy, still be going kind of fast. Right around four and a half percent, which is, you know, slower than the growth rate that we're getting this year, but still a really, really solid growth for the for the year as a whole. And I think in that there's a lot of things going on. We're still getting lots of job gains and the more job gains we have, the more consumer spending we get. And of course, consumer spending, that's 70% of US GDP. I think as well, we're looking forward to there being a big restocking of inventories. I think everyone has heard about the global supply chain issue and inventories in the United States in particular are very, very lean. And so we're looking for a bit of an extra boost to the economy coming from that inventory restocking. So it's a pretty optimistic case; slower than this year, to be sure, but still a pretty optimistic outlook.</p><p><br></p><p><strong>Andrew Sheets </strong>And Seth, what about that other big driver of the global economy, China? How do you think its economy looks next year?</p><p><br></p><p><strong>Seth Carpenter</strong> Robin Xing is our chief China economist, and he is also similarly a bit optimistic relative to consensus. Deceleration, to be sure, from where we were before COVID. But five and a half percent growth is still going to put our forecast, you know, higher than most other people making these sorts of forecasts. And there, when I talked to Robin, what he tells me is, you know, there was a slowdown in the Chinese economy this year in Q3, but a lot of that was policy induced as the policymakers in Beijing are trying to take another step in reorienting the Chinese economy. And because the slowdown was policy induced, we're going to get a recovery that's also policy induced. And so, he's actually pretty constructive about how growth for next year is going to turn out.</p><p><br></p><p><strong>Andrew Sheets </strong>So Seth, one question about the economy next year is, well, in 2021, we had all of this fiscal support, all this government support for growth and that's not going to be there in the same way. And you hear a lot about this concept of the fiscal cliff of the government support that was there falling away and even reversing and being a drag on growth. How do you square that with what seemed like pretty optimistic economic projections from our side?</p><p><br></p><p><strong>Seth Carpenter </strong>So here's how the US team would talk about it. When we think about what drove the fiscal policy this year, what drove the high deficit this year, a lot of it was income replacement. Many people had lost their jobs, many people were out of work and government transfers were replacing a fair amount of that income. And so as we move into next year, we're already seeing many of those jobs coming back, to be sure, not all of them yet. But in the forecast, jobs keep coming back and with it, labor income. And so what the government support had been doing, in part, was providing income to allow spending to go on in 2021. Next year in the forecast, it's labor income that allows the same type of spending to go on. And so as a result, there's no discrete step down that's coming from that removal of fiscal policy. And moreover, I think one thing that avid readers of economic data will know is that the saving rate i.e. how much of current income is being spent versus being saved. The saving rate is actually quite elevated. And part of that is this government transfer of income, not all of it being spent in the current period. Well, the US team says we're going to take some of that excess savings and assume that a portion of it actually gets spent in 2022. So that's another factor that's going to reduce the likelihood of us having a fiscal drag the way other forecasters probably have in their numbers.</p><p><br></p><p><strong>Andrew Sheets </strong>Seth, another concern that comes up a lot in these conversations is around the i-word: inflation. You know, you and I and some of our colleagues just did a large webcast for many of our investment clients. And I think without exaggeration, maybe 80% of the questions were in in some way related to inflationary risks and the inflationary backdrop. So, you know, we think growth is going to be good next year-- it might be better than expected-- but what does that imply for the inflation outlook and, how big of a risk is it that inflation is eating away at the spending power of the consumer and other parts of the economy?</p><p><br></p><p><strong>Seth Carpenter </strong>No question that inflation is sort of the key question in macro these days and into next year. And I think there is a real risk that high prices end up eating into purchasing power. It's clear that people who are on fixed income, people who are at the lower end of the income distribution, when the price of gasoline is going up, when the price is food is going up, that's very, very real for those people and it can affect how much extra discretionary spending they have. So I think that that clearly matters a lot. And I think one of the challenges between being an economist, thinking in terms of the technical data side of things, versus communicating to a broader audience is that inflation is about the rate of change of those prices, as opposed to what regular people see every day, which is the level of those prices. So in our-- in the forecast the US team has there are a lot of those prices that actually stay high, but the rate at which they go up in the forecast actually peaks at the beginning of 2022 and then starts to come down. It starts to come down for a few reasons. First: oil. If we look at the futures curve, looks as if oil prices should probably peak around December and then gradually come down over the course of next year. I think in addition to that, everyone has been talking about the global supply chain sort of bottlenecks in terms of consumer goods getting to consumers being a real challenge now takes time. It's proven to be quite durable so far. The maintained assumption that the economics team around the world had was the following: that those supply chain frictions-- be it the Port of Los Angeles and shipping containers, be it semiconductor production in East Asia, the whole kit and caboodle-- goes back to something that looks like normal at the end of 2022. But what that means in the forecast is things are about at their worst now, start to get better at the beginning of the year, and then take the whole year to get better. But if that's the case, then the easier access to the consumer goods should mean that prices on those consumer goods that have been going up so dramatically should probably stop going up sometime around the beginning of the year. And in fact, maybe start to go back towards more normal levels over time. So that's what's in the forecast.</p><p><br></p><p><strong>Andrew Sheets </strong>Seth, another thing I was hoping to ask you about as it relates to inflation is, you know, how much of this with your global hat on is a global phenomenon versus, you know, some more specific, idiosyncratic things related to the U.S. economy. You know, when you when you look across some different regions, some other major markets, are they having similar inflationary dynamics? Is it different? And importantly, could we see more divergence in the inflation picture going forward into next year?</p><p><br></p><p><strong>Seth Carpenter </strong>Oh, absolutely. So, looking across different countries, there's unquestionably a global component to this inflationary surge. I think what can differ, though, is how that inflationary impulse is transmitted to to different economies over time. So, you know, we've talked through our views on what happens in the United States. And in countries where you tend to have more of a history of high and variable inflation, it's easier for those sort of pricing pressures to spread to other components. Add to that in countries where if it's a small, open economy with a floating exchange rate, you can easily imagine that country's currency could decline a bit in value, which means all of their imported goods are more expensive as well, which then leads to more inflation. So clearly a common shock. The net effect across economies, though, can be quite different. I'd say one component that's a bit different in the United States than others is the structure of our of our labor market. In a lot of European countries, there was a mechanism put in place, a policy put in place to essentially try to freeze people in place attached to their employer; in the U.K. they call it 'the furlough scheme.' In the United States there was no similar specific plan that was covering the entire country. That friction in the labor market is quite difficult to overcome. And we're seeing some of that show through by, in some cases, businesses needing to pay more to attract new workers. And so, like I said, a clear common global shock, but the transmission varies by country.</p><p><br></p><p><strong>Andrew Sheets </strong>Thanks for listening. We'll be back in your feed soon for part two of my conversation with Seth Carpenter on the outlook for the global economy in 2022.</p><p><br></p><p><strong>Andrew Sheets </strong>And as a reminder, if you enjoy thoughts on the market, please take a moment to rate and review us on the Apple Podcast app. It helps more people find the show.</p>",
  "itunes:title": "2022 Global Economic Outlook, Pt. 1: Optimism in the New Year",
  "itunes:episodeType": "full",
  "itunes:episode": 497,
  "itunes:summary": "Andrew Sheets speaks with Chief Global Economist Seth Carpenter on Morgan Stanley’s more optimistic economic outlook for 2022 and how consumer spending, labor, and inflation contribute to that story.",
  "content:encoded": "<p>Andrew Sheets speaks with Chief Global Economist Seth Carpenter on Morgan Stanley’s more optimistic economic outlook for 2022 and how consumer spending, labor, and inflation contribute to that story.</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market. I'm Andrew Sheets, Chief Cross Asset Strategist for Morgan Stanley Research.</p><p><br></p><p><strong>Seth Carpenter </strong>And I'm Seth Carpenter. I'm Morgan Stanley's Chief Global Economist.</p><p><br></p><p><strong>Andrew Sheets </strong>And on part one of this special episode of Thoughts on the market, we'll be discussing the 2022 outlook for the global economy and how that outlook could impact markets in the coming year. It's Thursday, November 18th at 5:00 p.m. in London.</p><p><br></p><p><strong>Seth Carpenter</strong> And that makes it noon in New York City.</p><p><br></p><p><strong>Andrew Sheets </strong>So, Seth, welcome to Thoughts on the Market. You are Morgan Stanley's new chief global economist and, while we've just sat down to work on our year ahead outlook and we're going to discuss that, I was hoping you could just give listeners a little background around yourself and what brings you to this role?</p><p><br></p><p><strong>Seth Carpenter </strong>Thanks, Andrew. This has been a great experience for me working on the outlook as my introduction to Morgan Stanley. I guess I've been here just a few months now. Before coming to Morgan Stanley, I was at another big sell-side bank for a few years, spent a little time on the buy-side. But most of my career, I have to say, I spent in Washington DC. I spent 15 years of my career at the Federal Reserve working on all sorts of aspects about monetary policy. And then I spent two and a half years at the U.S. Treasury Department. So, I'm really, really a product of Washington more than I am Wall Street.</p><p><br></p><p><strong>Andrew Sheets</strong> Well, that's great. And so well, let's get right into it because, you know, this is a big collaborative process that you and I and a lot of our colleagues work on. And so let's start with that global economic picture. You know, as you step back and you think about our expectations, how good is the global economy going to be next year?</p><p><br></p><p><strong>Seth Carpenter </strong>Yeah, I have to say our economics team around the world is actually fairly optimistic-- call it bullish-- relative to consensus. When I think about the global economy, clearly the two biggest economies are the U.S. and China. And so starting with the U.S., Ellen Zentner, our chief U.S. economist, has an outlook that the U.S. economy is going to slow down next year, but boy, still be going kind of fast. Right around four and a half percent, which is, you know, slower than the growth rate that we're getting this year, but still a really, really solid growth for the for the year as a whole. And I think in that there's a lot of things going on. We're still getting lots of job gains and the more job gains we have, the more consumer spending we get. And of course, consumer spending, that's 70% of US GDP. I think as well, we're looking forward to there being a big restocking of inventories. I think everyone has heard about the global supply chain issue and inventories in the United States in particular are very, very lean. And so we're looking for a bit of an extra boost to the economy coming from that inventory restocking. So it's a pretty optimistic case; slower than this year, to be sure, but still a pretty optimistic outlook.</p><p><br></p><p><strong>Andrew Sheets </strong>And Seth, what about that other big driver of the global economy, China? How do you think its economy looks next year?</p><p><br></p><p><strong>Seth Carpenter</strong> Robin Xing is our chief China economist, and he is also similarly a bit optimistic relative to consensus. Deceleration, to be sure, from where we were before COVID. But five and a half percent growth is still going to put our forecast, you know, higher than most other people making these sorts of forecasts. And there, when I talked to Robin, what he tells me is, you know, there was a slowdown in the Chinese economy this year in Q3, but a lot of that was policy induced as the policymakers in Beijing are trying to take another step in reorienting the Chinese economy. And because the slowdown was policy induced, we're going to get a recovery that's also policy induced. And so, he's actually pretty constructive about how growth for next year is going to turn out.</p><p><br></p><p><strong>Andrew Sheets </strong>So Seth, one question about the economy next year is, well, in 2021, we had all of this fiscal support, all this government support for growth and that's not going to be there in the same way. And you hear a lot about this concept of the fiscal cliff of the government support that was there falling away and even reversing and being a drag on growth. How do you square that with what seemed like pretty optimistic economic projections from our side?</p><p><br></p><p><strong>Seth Carpenter </strong>So here's how the US team would talk about it. When we think about what drove the fiscal policy this year, what drove the high deficit this year, a lot of it was income replacement. Many people had lost their jobs, many people were out of work and government transfers were replacing a fair amount of that income. And so as we move into next year, we're already seeing many of those jobs coming back, to be sure, not all of them yet. But in the forecast, jobs keep coming back and with it, labor income. And so what the government support had been doing, in part, was providing income to allow spending to go on in 2021. Next year in the forecast, it's labor income that allows the same type of spending to go on. And so as a result, there's no discrete step down that's coming from that removal of fiscal policy. And moreover, I think one thing that avid readers of economic data will know is that the saving rate i.e. how much of current income is being spent versus being saved. The saving rate is actually quite elevated. And part of that is this government transfer of income, not all of it being spent in the current period. Well, the US team says we're going to take some of that excess savings and assume that a portion of it actually gets spent in 2022. So that's another factor that's going to reduce the likelihood of us having a fiscal drag the way other forecasters probably have in their numbers.</p><p><br></p><p><strong>Andrew Sheets </strong>Seth, another concern that comes up a lot in these conversations is around the i-word: inflation. You know, you and I and some of our colleagues just did a large webcast for many of our investment clients. And I think without exaggeration, maybe 80% of the questions were in in some way related to inflationary risks and the inflationary backdrop. So, you know, we think growth is going to be good next year-- it might be better than expected-- but what does that imply for the inflation outlook and, how big of a risk is it that inflation is eating away at the spending power of the consumer and other parts of the economy?</p><p><br></p><p><strong>Seth Carpenter </strong>No question that inflation is sort of the key question in macro these days and into next year. And I think there is a real risk that high prices end up eating into purchasing power. It's clear that people who are on fixed income, people who are at the lower end of the income distribution, when the price of gasoline is going up, when the price is food is going up, that's very, very real for those people and it can affect how much extra discretionary spending they have. So I think that that clearly matters a lot. And I think one of the challenges between being an economist, thinking in terms of the technical data side of things, versus communicating to a broader audience is that inflation is about the rate of change of those prices, as opposed to what regular people see every day, which is the level of those prices. So in our-- in the forecast the US team has there are a lot of those prices that actually stay high, but the rate at which they go up in the forecast actually peaks at the beginning of 2022 and then starts to come down. It starts to come down for a few reasons. First: oil. If we look at the futures curve, looks as if oil prices should probably peak around December and then gradually come down over the course of next year. I think in addition to that, everyone has been talking about the global supply chain sort of bottlenecks in terms of consumer goods getting to consumers being a real challenge now takes time. It's proven to be quite durable so far. The maintained assumption that the economics team around the world had was the following: that those supply chain frictions-- be it the Port of Los Angeles and shipping containers, be it semiconductor production in East Asia, the whole kit and caboodle-- goes back to something that looks like normal at the end of 2022. But what that means in the forecast is things are about at their worst now, start to get better at the beginning of the year, and then take the whole year to get better. But if that's the case, then the easier access to the consumer goods should mean that prices on those consumer goods that have been going up so dramatically should probably stop going up sometime around the beginning of the year. And in fact, maybe start to go back towards more normal levels over time. So that's what's in the forecast.</p><p><br></p><p><strong>Andrew Sheets </strong>Seth, another thing I was hoping to ask you about as it relates to inflation is, you know, how much of this with your global hat on is a global phenomenon versus, you know, some more specific, idiosyncratic things related to the U.S. economy. You know, when you when you look across some different regions, some other major markets, are they having similar inflationary dynamics? Is it different? And importantly, could we see more divergence in the inflation picture going forward into next year?</p><p><br></p><p><strong>Seth Carpenter </strong>Oh, absolutely. So, looking across different countries, there's unquestionably a global component to this inflationary surge. I think what can differ, though, is how that inflationary impulse is transmitted to to different economies over time. So, you know, we've talked through our views on what happens in the United States. And in countries where you tend to have more of a history of high and variable inflation, it's easier for those sort of pricing pressures to spread to other components. Add to that in countries where if it's a small, open economy with a floating exchange rate, you can easily imagine that country's currency could decline a bit in value, which means all of their imported goods are more expensive as well, which then leads to more inflation. So clearly a common shock. The net effect across economies, though, can be quite different. I'd say one component that's a bit different in the United States than others is the structure of our of our labor market. In a lot of European countries, there was a mechanism put in place, a policy put in place to essentially try to freeze people in place attached to their employer; in the U.K. they call it 'the furlough scheme.' In the United States there was no similar specific plan that was covering the entire country. That friction in the labor market is quite difficult to overcome. And we're seeing some of that show through by, in some cases, businesses needing to pay more to attract new workers. And so, like I said, a clear common global shock, but the transmission varies by country.</p><p><br></p><p><strong>Andrew Sheets </strong>Thanks for listening. We'll be back in your feed soon for part two of my conversation with Seth Carpenter on the outlook for the global economy in 2022.</p><p><br></p><p><strong>Andrew Sheets </strong>And as a reminder, if you enjoy thoughts on the market, please take a moment to rate and review us on the Apple Podcast app. It helps more people find the show.</p>",
  "guid": "gid://art19-episode-locator/V0/smXvDVYsEAeQXVmb3ACTXYa2W8a4M_SM_R9jBnJ62qM",
  "pubDate": "Thu, 18 Nov 2021 23:33:49 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:duration": "00:09:55",
  "enclosure": ""
}