{
  "title": "Footage of Hideo Kojima's next game may have leaked in bizarre fashion",
  "description": "<p>For many people, the list of their most hotly anticipated video games will include \"whatever <a href=\"https://www.engadget.com/tag/hideo%20kojima/\"><ins>Hideo Kojima</ins></a> is working on.\" If you're one of those folks, you may be interested to learn that a video showing the <a href=\"https://www.engadget.com/tag/death%20stranding/\"><em><ins>Death Stranding</ins></em></a><em>&nbsp;</em>auteur's next title seems to have leaked ahead of a formal reveal from his studio, Kojima Productions.</p><p>The video, which has been removed from Streamable for violating the platform's terms of service, shows a character who looks like Mama from <em>Death Stranding. </em>That character was played by <em>Maid</em> and <em>Once Upon a Time in Hollywood </em>actor Margaret Qualley. The character shown here navigates dark corridors with the help of a flashlight while an ominous figure follows them. Eventually, someone or some<em>thing </em>catches up to them. A game over screen is then shown, along with text reading \"A Hideo Kojima Game\" and \"Overdose.\"</p><span id=\"end-legacy-contents\"></span><p>Reporter Tom Henderson <a href=\"https://insider-gaming.com/kojima-overdose-gameplay-leaked/\"><ins>noted</ins></a> that the footage was the same as the leaked video he described in June at <a href=\"https://tryhardguides.com/hideo-kojimas-new-horror-game-is-dubbed-overdose/\"><em><ins>Try Hard Guides</ins></em></a>. Kojima Productions seemingly asked him to take down the initial report — a request that <em>Try Hard </em>declined.</p><p>The presentation of the video is bizarre. The gameplay footage has a picture-in-picture view of a person seemingly playing the game, as though they are a Twitch streamer. Text reading \"camera player 1\" appears at the top of the screen, suggesting that this is from a playtest. The footage appears on a YouTube-style interface, indicating that it may have been stored on Google Drive. It gets stranger, because someone has filmed that footage offscreen. That version of the video is then played on a tablet, which, according to a pretty prominent reflection on that screen, is being filmed offscreen a second time by a shirtless person.</p><p>It's all very unusual. As <a href=\"https://www.polygon.com/23440326/hideo-kojima-new-game-overdose-leak-margaret-qualley\"><em><ins>Polygon</ins></em></a><em>&nbsp;</em>notes, there's at least a small chance that the footage is fake, even though creating it would require a lot of effort from some prankster. Qualley's character model looks just like the one used in <em>Death Stranding</em> —which may indicate that <em>Overdose </em>is a direct follow-up to Kojima's last game. It's also odd to see the name of a game's creator pop up during a game over screen, though this is likely work-in-progress footage (though it's not impossible to imagine Kojima actually putting his name on a game over screen).&nbsp;</p><p>In any case, we may not have to wait too much longer to gain more clarity as to what's going on here. Kojima has been <a href=\"https://www.engadget.com/hideo-kojima-elle-fanning-game-teaser-182532503.html\"><ins>teasing</ins></a> his next project, and he's a regular presence at The Game Awards, the next edition of which takes place in a month. Kojima is developing a game <a href=\"https://www.engadget.com/hideo-kojima-next-game-xbox-game-studios-183606097.html\"><ins>in partnership with Microsoft</ins></a>, but a <em>Death Stranding </em>sequel is reportedly in the works too.</p><p>If the reports and rumors hold up, <em>Overdose </em>will be the first full horror game from Kojima. The only horror project that the Metal Gear creator has released to date is <em>P.T.</em>, an infamous playable teaser <a href=\"https://www.engadget.com/kojima-pt-silent-hills-ps5-backward-compatability-205847752.html\"><ins>that's no longer available</ins></a>. It was designed as a proof of concept for <em>Silent Hills</em>, <a href=\"https://www.engadget.com/2015-04-27-silent-hills-hideo-kojima-del-toro-canceled.html\"><ins>a project that was canceled</ins></a> amid Kojima's acrimonious departure from Konami (which, coincidentally, <a href=\"https://www.engadget.com/silent-hill-new-games-townfall-ascension-f-220813742.html\"><ins>just revived the Silent Hill franchise</ins></a>).</p><p>Meanwhile, Kojima <a href=\"https://www.pushsquare.com/news/2022/11/kojima-productions-isnt-for-sale-despite-ridiculously-high-offers\"><ins>claimed this week</ins></a> that he'd received some “ridiculously high” offers for Kojima Productions. However, he has no plans to sell the company as he wants to retain creative independence.</p>",
  "link": "https://www.engadget.com/hideo-kojima-overdose-leak-death-stranding-margaret-qualley-154257824.html?src=rss",
  "source_id": "engadget_479",
  "guid": "d99fd168-a9c0-49e2-bb98-0e69ef54caaa",
  "dc:creator": "Kris Holt",
  "source": "Engadget",
  "dc:publisher": "Engadget",
  "dc:rightsHolder": "Engadget",
  "pubDate": "Fri, 04 Nov 2022 15:42:57 +0000",
  "ingested": 1667576578,
  "modified": "2022-11-04T15:43:07+00:00",
  "category": [
    "Media",
    "Video Games",
    "Arts & Entertainment",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Kris Holt"
  ],
  "media:content": [
    {
      "media:keywords": "headline",
      "media:media_html": "",
      "dc:identifier": 1,
      "media:credit": "",
      "media:description": "",
      "media:title": ""
    },
    {
      "media:media_html": "",
      "dc:identifier": 2,
      "media:credit": "CHARLY TRIBALLEAU via Getty Images",
      "media:description": "Japanese video game designer, writer, director and producer Hideo Kojima speaks on stage to present his new video game \"Death Stranding\" during the Tokyo Game Show in Makuhari, Chiba Prefecture on September 12, 2019. (Photo by CHARLY TRIBALLEAU / AFP)        (Photo credit should read CHARLY TRIBALLEAU/AFP via Getty Images)",
      "media:title": "JAPAN-TECHNOLOGY-GAMING-GAMES"
    }
  ]
}