{
  "title": "S15 Ep10: A Walk In The Shadows",
  "link": "https://audioboom.com/posts/8098513",
  "itunes:episode": 10,
  "itunes:title": "A Walk In The Shadows",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4524,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS takes A Walk In The Shadows with Mike Ricksecker!  Mike has had a ton of experiences with the mysterious shadow people , and recounts his first experiences with them as a child and some creepy cases he has investigated! Mike also delves into where he believes where these shadow people come from and what their intent might be! <br>\n<br>\nGet his book here:   <a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nVisit Mike Here:     <a href=\"https://www.mikericksecker.com/\">https://www.mikericksecker.com/</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL gam,es and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !",
  "itunes:summary": "BEYOND the DARKNESS takes A Walk In The Shadows with Mike Ricksecker!  Mike has had a ton of experiences with the mysterious shadow people , and recounts his first experiences with them as a child and some creepy cases he has investigated!...",
  "pubDate": "Sun, 02 Feb 2020 07:00:00 +0000",
  "guid": "a321d128-705f-49d1-a471-d7ece0693cd3",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}