{
  "title": "S15 Ep39: The Human Hybridization Program with Geraldine Orozco",
  "link": "https://audioboom.com/posts/8098484",
  "itunes:episode": 39,
  "itunes:title": "The Human Hybridization Program with Geraldine Orozco",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6463,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio contemplates the Human Hybridization Program with guest Geraldine Orozco<br>\n<br>\nToday Dave & Tim sit down to dig into the Human Hybridization Program. <br>\nAbductions. Reproduction experiments. Memories of seeing children off-planet. The idea of humans participating in an alien hybrid program sounds absurd until you talk to people who have experienced it. On October 14, 2013 Geraldine experienced a vivid abduction from her home, this is her story! <br>\n<br>\nThere are many aspects to the Hybridization Program, some experiencers may encounter higher vibrational experiences, while others can experience trauma.   Terrestrial experiences such as in Military Abductions (MilAb) are often lead by factions of the Government, with or without ET involvement. Other programs include Extraterrestrial/inter-dimensional experiences conducted  in a controlled environment by means of technology such as aboard craft or interdimensionally.  Our guest, Geraldine Orozco believes all cases are just as valid and require support, understanding, and compassion.<br>\n<br>\nVisit her site here: <a href=\"https://www.hybridmother.com/\">https://www.hybridmother.com/</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping.",
  "itunes:summary": "Darkness Radio contemplates the Human Hybridization Program with guest Geraldine Orozco\n\nToday Dave & Tim sit down to dig into the Human Hybridization Program. \nAbductions. Reproduction experiments. Memories of seeing children off-planet....",
  "pubDate": "Sun, 10 May 2020 08:00:00 +0000",
  "guid": "f7702b77-2cfb-4b79-b2e9-0cce5ed33208",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}