{
  "title": "On the Concept of Motion",
  "link": "https://writings.stephenwolfram.com/2022/03/on-the-concept-of-motion/",
  "comments": "https://writings.stephenwolfram.com/2022/03/on-the-concept-of-motion/#comments",
  "pubDate": "Fri, 18 Mar 2022 21:40:17 +0000",
  "dc:creator": "Stephen Wolfram",
  "category": [
    "Language and Communication",
    "Philosophy",
    "Physics"
  ],
  "guid": "https://writings.stephenwolfram.com/?p=36204",
  "description": "<span class=\"thumbnail\"><img width=\"128\" height=\"108\" src=\"https://content.wolfram.com/uploads/sites/43/2022/03/motion-icon2.png\" class=\"attachment-thumbnail size-thumbnail wp-post-image\" alt=\"\" /></span>How Is It That Things Can Move? It seems like the kind of question that might have been hotly debated by ancient philosophers, but would have been settled long ago: how is it that things can move? And indeed with the view of physical space that’s been almost universally adopted for the past two thousand [&#8230;]",
  "content:encoded": "<span class=\"thumbnail\"><img width=\"128\" height=\"108\" src=\"https://content.wolfram.com/uploads/sites/43/2022/03/motion-icon2.png\" class=\"attachment-thumbnail size-thumbnail wp-post-image\" alt=\"\" /></span><h2 id='how-is-it-that-things-can-move?'>How Is It That Things Can Move?</h2>\n<p>It seems like the kind of question that might have been hotly debated by ancient philosophers, but would have been settled long ago: how is it that things can move? And indeed with the view of physical space that’s been almost universally adopted for the past two thousand years it’s basically a non-question. As crystallized by the likes of Euclid it’s been assumed that space is ultimately just a kind of “geometrical background” into which any physical thing can be put—and then moved around. </p>\n<p>But in our <a href='https://www.wolframphysics.org/' target=_blank rel=noopener>Physics Project</a> we’ve developed a fundamentally different view of space—in which space is not just a background, but has its <a href='https://writings.stephenwolfram.com/2020/04/finally-we-may-have-a-path-to-the-fundamental-theory-of-physics-and-its-beautiful/#what-is-space'>own elaborate composition and structure</a>. And in fact, we posit that space is in a sense everything that exists, and that all “things” are ultimately just features of the structure of space. We imagine that at the lowest level, space consists of large numbers of abstract “atoms of space” connected in a hypergraph that’s continually getting updated according to definite rules and that’s a huge version of something like this:</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: 3px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822Zimg1.png\" alt='' title='' width='578' height='219' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822Yimg1_copy-v3.txt\">\n\t\t\t\t\t<span class='close' id='1_out'>&#10005</span></p>\n<pre class='text' id='1_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p><span id=\"more-36204\"></span></p>\n<p>But with this setup, what even is motion? It’s no longer something baked into our basic ideas about space. Instead—much like the ancient philosophers imagined—it’s something we can try to derive from a lower level of description. It’s not something we can take for granted—and indeed it’s going to turn out that its character depends in fundamental ways on issues like <a href='https://writings.stephenwolfram.com/2021/03/what-is-consciousness-some-new-perspectives-from-our-physics-project/'>our nature as observers</a>.</p>\n<p>To have a concept of motion, one has to have not only a concept of space—and time—but also a concept of “things”. One has to have something definite that one can imagine moves through space with time. And in effect the concept of “pure motion” is that there can be a “thing” that “just moves” without “changing its character”. But if the thing is “made of atoms of space” that are continually getting updated, what does this mean? Somehow the identity of the “thing” has to be associated with some collective characteristic that doesn’t depend on the particular atoms of space from which it’s made.</p>\n<p>There’s an immediate analogy here. Consider something like a vortex in a fluid. The vortex can move around as a “thing” even though “underneath” it’s made of an ever-changing collection of lots of discrete molecules. If we looked in microscopic detail, we’d see effects from those discrete molecules. But at the scale at which we humans typically operate, we just consider there to be a definite “thing” we describe as a vortex—that at this level of description exhibits “pure motion”.</p>\n<p>Our fundamental model of space is not so different from this. At the lowest level there’s continual activity associated with the application of rules that create new atoms of space and new connections between them. And just as continual collisions between molecules in a fluid “knit together” the structure of the fluid, so also the continual rewriting of the hypergraph that connects atoms of space knits together the structure of space. But then on top of this there can be “localized collective features” that have a certain persistence. And these are the “things” (or “objects”) that we can consider to “show pure motion”.</p>\n<p>Physics suggests two kinds of things like this. The first are particles, like electrons or photons or quarks. And the second are black holes. As of now, we have no specific evidence that particles like electrons are “made of anything”; they just seem to act like geometrical points. But in our Physics Project we posit that they are <a href='https://writings.stephenwolfram.com/2020/04/finally-we-may-have-a-path-to-the-fundamental-theory-of-physics-and-its-beautiful/#elementary-particles-old-and-new'>ultimately &#8220;made of space&#8221;</a> and actually contain large numbers of atoms of space that collectively form some kind of persistent structure a bit like a vortex in a fluid. </p>\n<p>Black holes operate on a very different scale—though I suspect they’re actually very similar in character to particles. And in fact for black holes <a href='https://www.wolframphysics.org/bulletins/2020/05/event-horizons-singularities-and-other-exotic-spacetime-phenomena/' target=_blank rel=noopener>we already have a sense</a> from traditional general relativity that they can just be “made of space”—though without our discrete underlying model there are some inevitable mathematical hacks involved.</p>\n<p>So what is it that leads to persistent structures? Often one can identify it as something “topological”. There’s an underlying “medium” in which all sorts of essentially continuous changes can be made. But then there are structures that can’t be created or destroyed by such continuous changes—in effect because they are “topologically distinct”. Vortices are one such example—because around the core of the vortex, independent of what “continuous deformations” one makes, there’s always a constant circulation of fluid, that can’t be gotten rid of except by some kind of discontinuous change. (In reality, of course, vortices are eventually damped out by viscosity generated as a result of microscopic motion, but the point is that this takes a while, and until it’s happened, the vortex can reasonably be considered to persistently be a “thing”.)</p>\n<p>In our Physics Project, we’ve already been able to figure out quite a bit about how black holes work. We know less about the specifics of how particles work. But the basic idea is that somehow there are features that are local and persistent that we can identify as particles—and perhaps these features have topological origins that make it inevitable that, for example, all electrons “intrinsically seem the same”, and that there are only a discrete set of possible types of particles (at least at our energy scales).</p>\n<p>So in the end what we imagine is that there are certain “carriers of pure motion”: certain collective features of space that are persistent enough that we can consider them to “just move”, without changing. At the outset it’s not obvious that any such features should exist at all, and that pure motion should ever be possible. Unlike in the traditional “pure geometrical” view of space, in our Physics Project it’s something one has to explicitly derive from the underlying structure of the model—though it seems quite likely that it’s ultimately an inevitable and ubiquitous consequence of rather general “topological” features of hypergraph rewriting. </p>\n<p>We keep on talking about “features that persist”. But what does this really mean? As soon as something moves it’ll be made of different atoms of space. So what does it mean for it to “persist”? In the end it’s all about what observers perceive. Do we view it as being the “same thing” but in a different place? Or do we say it’s different because some detail of it is different?</p>\n<p>And actually this kind of issue already comes up even before we’re talking about motion and the persistence of “objects”: it’s crucial just in the emergence of the basic notion of space itself. At the level of individual atoms of space there isn’t anything we can really call “space”, just like at the level of individual molecules there isn’t anything we can reasonably call a fluid. And instead, the notion of space—or of fluids—emerges when we look at things in the kind of way that observers like us do. We’re not tracking what’s happening at the level of individual atoms of space—or individual molecules; we’re looking at things in a more coarse-grained way, that it turns out we can summarize in terms of what amount to continuum concepts.</p>\n<p>Once again, it’s not obvious things will work like this. Down at the level of atoms of space—or, for that matter, molecules—there are definite computational rules being followed. And from the <a href='https://www.wolframscience.com/nks/chap-12--the-principle-of-computational-equivalence/'>Principle of Computational Equivalence</a> it’s almost inevitable that there’ll be <a href='https://www.wolframscience.com/nks/p737--computational-irreducibility/'>computational irreducibility</a>, implying that there’s no way to find the outcome except in effect by doing an irreducible amount of computational work. If we as observers were computationally unbounded then, yes, we could always “decode” what’s going on, and “see down” to the behavior of individual atoms of space or individual molecules. But if we’re computationally bounded we can’t do this. And, as I’ve argued <a href='https://writings.stephenwolfram.com/2021/03/what-is-consciousness-some-new-perspectives-from-our-physics-project/'>elsewhere</a>, that’s both why we believe in the Second Law of thermodynamics, and why we perceive there to be something like ordinary “geometrical space”. </p>\n<p>In other words, our inability to track the details means that in a first approximation we can summarize what’s going on just by saying we’ve got something that seems like our ordinary notion of space. And going one step beyond that is what has us talking about “persistent objects in space”. But now we’re back to discussing what it means for an object to “be persistent”. Ultimately it’s that we as observers somehow perceive it to “be the same”, even though perhaps in a “different place”. </p>\n<p>A key finding of our Physics Project is that certain basic laws of physics—in particular general relativity and quantum mechanics—inevitably seem to emerge as soon as we assume that observers have two basic characteristics: first, that they are computationally bounded, and second, that they are persistent in time.</p>\n<p>In our Physics Project the passage of time corresponds to the inexorable (and irreducible) computational process of updating the “spatial hypergraph” that represents the lowest-level structure of the universe. And when we talk formally we can imagine looking at this “from the outside”. But in reality we as observers must be embedded within the system, being continually updated and changed just like the rest of the system.</p>\n<p>But here there’s a crucial point. Even though the particular configuration of atoms in our brains is continually changing, we think it’s “still us”. Or, in other words, we have the perception that we persist through time. Now it could be that this wouldn’t be a consistent thing to imagine, and that if we imagined it, we’d never be able to form a coherent view of the world. But in fact what our Physics Project implies is that with this assumption we can (subject to various conditions) form a coherent view of the world, and it’s one where the core known laws of physics are in evidence.</p>\n<p>OK, so we ourselves are persistent essentially because we assume that we are (and in most situations nothing goes wrong if we do this). But the persistence of something like a particle, or a black hole, is a different story. From our point of view, we’re not “inside” things like these; instead we’re “looking at them from the outside”. </p>\n<p>But what do we notice in them? Well, that depends on our “powers of observation”. The basic idea of particles, for example, is that they should be objects that can somehow be separated from each other and from everything else. In our Physics Project, though, any particle must ultimately be “embedded as a part of space”. So when we say that it’s a “separable object” what we’re imagining is just that there’s some attribute of it that we can identify and observe independent of its “environment”. </p>\n<p>But just what this is can depend on our characteristics as observers, and the fact that we operate on certain scales of length and time. If we were able to go down to the level of individual atoms of space we probably wouldn’t be able to “see” that there’s anything like a particle there at all. That’s something that emerges for observers with our kinds of characteristics.</p>\n<p>Quite what the full spectrum of “conceivable persistent features” might be isn’t clear (though we’ll see some exotic possibilities below). But as soon as one can identify a persistent feature, one can ask about motion. Is it possible for that feature to “move” from being embedded at one “place” to another?</p>\n<p>There’s yet another subtlety here, though. Our ordinary experience of motion involves things going from one place to another by progressively “visiting every place in between”. But ultimately, as soon as we’re dealing with discrete atoms of space, this can’t be how things work. And instead what we need to discuss is whether something somehow “maintains its form” at intermediate stages as it “moves”.</p>\n<p>For example, we probably wouldn’t consider it motion in the ordinary sense if what we had was a kind of <em>Star Trek</em>&#8211;like “transporter” in which objects get completely disassembled, then get “transmitted to a different place” and reassembled. But somehow it does seem more like “ordinary motion” if there’s a collection of pixel values that move across a computer screen—even if at intermediate moments they are distorted by all sorts of aliasing effects.</p>\n<p>Even in ordinary general relativity there are issues with the idea of motion—at least for extended objects. If we’re in a region of space that’s reasonably flat it’s fine. But if we’re near a spacetime singularity then inevitably objects won’t be able to “maintain their integrity”—and instead they’ll effectively be “shredded”—and so can’t be interpreted as “just moving”. When we’re dealing not with geometric continuum spacetime but instead with our spatial hypergraph, there’ll always be something analogous to “shredding” on a small enough scale, and the question is whether at the level we perceive things we’ll be able to tell that there’s something persistent that isn’t shredded.</p>\n<p>So, in the end, how is it that things can move? Ultimately it’s something that has to be formally derived from the underlying model, based on the characteristics of the observer. At least conceptually the first step is to identify what kinds of things the observer considers “the same”, and what details make them “seem different”. Then one needs to determine whether there are structures that would be considered the same by the observer, but which progressively change ”where they’re embedded”. And if so, we’ve identified “motion”.</p>\n<p>For us humans with our current state of technological development, particles and objects made of them are the most obvious things to consider. So in a sense the question reduces to whether there are “lumps of space” that persist in maintaining (perhaps topological) features recognized by our powers of perception. And to determine this is a formal question that’s important to explore as our Physics Project progresses.</p>\n<h2 id='motion-can-be-a-complicated-story'>Motion Can Be a Complicated Story</h2>\n<p>We’ve talked about “persistent structures” as “carriers of pure motion”. But how do such structures actually work? Ultimately it can be a very complicated story. But here we’ll consider a simplified case that begins to illustrate some of the issues. We’ll be talking not about the actual model of space in our Physics Project, but instead about the <a href='https://www.wolframscience.com/nks/chap-2--the-crucial-experiment/'>cellular automaton systems</a> I’ve studied for many years in which space is effectively predefined to consist of a rigid array of cells, each with a discrete value updated according to a local rule. </p>\n<p>Here’s an example in which there quickly emerge obvious “<a href='https://www.wolframscience.com/nks/p282--structures-in-class-4-systems/'>localized persistent structures</a>” that we can think of as being roughly like particles:</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: 5px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img2.png\" alt='' title='' width='578' height='289' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img2_copy.txt\">\n\t\t\t\t\t<span class='close' id='2_out'>&#10005</span></p>\n<pre class='text' id='2_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>Some “stay still” relative to the fixed cellular automaton background; others “move”. With this specific cellular automaton, it’s easy to identify certain <a href='https://www.wolframscience.com/nks/p284--structures-in-class-4-systems/'>possible &#8220;particles&#8221;</a>, some “staying still” and some “showing motion”: </p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: 5px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img3.png\" alt='' title='' width='578' height='289' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img3_copy.txt\">\n\t\t\t\t\t<span class='close' id='3_out'>&#10005</span></p>\n<pre class='text' id='3_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>But consider instead a cellular automaton with very different behavior:</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: -3px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img4.png\" alt='' title='' width='578' height='301' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img4_copy.txt\">\n\t\t\t\t\t<span class='close' id='4_out'>&#10005</span></p>\n<pre class='text' id='4_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>Does this support the concept of motion? Certainly not as obviously as the previous case. And in fact there doesn’t seem to be anything identifiable that systematically propagates across the system. Or in other words, at least with our typical “powers of perception” we don’t “see motion” here.</p>\n<p>There’s a whole spectrum of more complicated cases, however. Consider for example:</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: 5px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img5.png\" alt='' title='' width='578' height='289' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img5_copy.txt\">\n\t\t\t\t\t<span class='close' id='5_out'>&#10005</span></p>\n<pre class='text' id='5_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>Here one can easily identify “particle-like” structures, but they never seem to “keep moving forever”; instead they always fairly quickly interact and “annihilate”. But to expect otherwise is to imagine an idealization in which there is at some level “only one object” in the whole system. As soon as there are multiple objects it’s basically inevitable that they’ll eventually interact. Or, put another way, motion in any real situation will never be about “persistently moving” forever; it’s just about persisting for at least long enough to be identified as something separate and definite. (This is very similar to the situation in quantum field theory where actual particles eventually interact, even though their formal definition assumes no interaction.) </p>\n<p>Here’s another case, where on a large scale there’s no “obvious motion” to be seen</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: 5px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img6.png\" alt='' title='' width='578' height='289' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img6_copy.txt\">\n\t\t\t\t\t<span class='close' id='6_out'>&#10005</span></p>\n<pre class='text' id='6_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>but where locally one can identify rather simple “particle-like” structures</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: 5px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img7.png\" alt='' title='' width='578' height='181' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img7_copy.txt\">\n\t\t\t\t\t<span class='close' id='7_out'>&#10005</span></p>\n<pre class='text' id='7_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>that on their own can be thought of as “exhibiting motion”, even though there are other structures that for example just expand, apparently without bound:</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: -3px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img8.png\" alt='' title='' width='578' height='246' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img8_copy.txt\">\n\t\t\t\t\t<span class='close' id='8_out'>&#10005</span></p>\n<pre class='text' id='8_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>Sometimes there can be lots of “particle-like” activity, but with other things consistently mixed in:</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: -3px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img9.png\" alt='' title='' width='577' height='346' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img9_copy.txt\">\n\t\t\t\t\t<span class='close' id='9_out'>&#10005</span></p>\n<pre class='text' id='9_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>Here’s a slightly more exotic example, where continual “streams of particles” are produced:</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: 5px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img10.png\" alt='' title='' width='575' height='297' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img10_copy.txt\">\n\t\t\t\t\t<span class='close' id='10_out'>&#10005</span></p>\n<pre class='text' id='10_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>In all the examples we’ve seen so far the “particles” exist on a “blank” or otherwise simple background. But it’s also perfectly possible for them to be on a <a href='https://www.wolframscience.com/nks/notes-6-8--background-in-rule-110/'>background with more elaborate structure</a>:</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: 5px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img11.png\" alt='' title='' width='578' height='289' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img11_copy.txt\">\n\t\t\t\t\t<span class='close' id='11_out'>&#10005</span></p>\n<pre class='text' id='11_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>But what about a seemingly random background? Here’s at least a partial example where there are both structures that “respond to the background” and ones that have “intrinsic particle-like form”:</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: 5px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img12.png\" alt='' title='' width='578' height='289' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img12_copy.txt\">\n\t\t\t\t\t<span class='close' id='12_out'>&#10005</span></p>\n<pre class='text' id='12_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>What does all this mean for the concept of motion? The most important point is that we’ve seen that “objects” that can be thought of as “showing pure motion” can emerge even in underlying systems that don’t seem to have any particular “built-in concept of motion”. But what we’ve also seen is that along with “objects that show pure motion” there can be all sorts of other effects and phenomena. And in our actual Physics Project these can necessarily in a sense be much more extreme. </p>\n<p>The cellular automaton systems we’ve been discussing so far have a built-in underlying notion of space, which exists even if the system basically “doesn’t do anything”. But in our Physics Project the structure of space itself is created through activity. So—as we discussed in the previous section—“objects” or particles have to somehow exist “on top” of this. </p>\n<p>It’s fairly clear roughly how such particles must work, being based for example on essentially topological features of the system. But we don’t yet know the details, and there’s probably quite a depth of mathematical formalism that needs to be built to clarify them. It’s still possible, though, to explore at least some toy examples. </p>\n<p>Consider the hypergraph rewriting rule:</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: -5px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img13.png\" alt='' title='' width='486' height='75' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img13_copy.txt\">\n\t\t\t\t\t<span class='close' id='13_out'>&#10005</span></p>\n<pre class='text' id='13_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>It maintains a very simple (effectively 1D and cyclic) form of space (with rewrites shown in red):</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: 3px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img14B.png\" alt='' title='' width='635' height='' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img14_copy.txt\">\n\t\t\t\t\t<span class='close' id='14_out'>&#10005</span></p>\n<pre class='text' id='14_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>If the initial conditions contain a feature that can be interpreted as something like a “particle” then the rules are such that this can “move around”, but can’t be destroyed:</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: 3px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img15B.png\" alt='' title='' width='635' height='' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img15_copy.txt\">\n\t\t\t\t\t<span class='close' id='15_out'>&#10005</span></p>\n<pre class='text' id='15_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>It’s a little clearer what’s going on if instead of looking at an explicit sequence of hypergraphs we instead generate <a href='https://writings.stephenwolfram.com/2020/04/finally-we-may-have-a-path-to-the-fundamental-theory-of-physics-and-its-beautiful/#the-graph-of-causal-relationships'>causal graphs</a> (see the next section) that show the “spacetime” network of causal relationships between updating events. Here’s the causal graph for the “space only, no particles” case (where here we can think of time as effectively running from left to right):</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img16.png\" alt='' title='' width='567' height='160' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img16_copy.txt\">\n\t\t\t\t\t<span class='close' id='16_out'>&#10005</span></p>\n<pre class='text' id='16_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>Here’s the causal graph when there’s a “particle” included:</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img17.png\" alt='' title='' width='566' height='185' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img17_copy.txt\">\n\t\t\t\t\t<span class='close' id='17_out'>&#10005</span></p>\n<pre class='text' id='17_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>And here’s the result when there are “two particles”—where things begin to get more complicated:</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img18.png\" alt='' title='' width='569' height='188' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img18_copy.txt\">\n\t\t\t\t\t<span class='close' id='18_out'>&#10005</span></p>\n<pre class='text' id='18_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id='the-observer-is-actually-inside-the-system'>The Observer Is Actually inside the System</h2>\n<p>We’ve discussed what it takes for an observer to identify something as “moving” in a system. But so far there’s an important piece we’ve left out. Because in effect we’ve assumed that the observer is “outside the system” and “looking in”. But if we imagine that we’re dealing with a complete model of the physical universe the observer necessarily has to “be inside”. And ultimately the observer has got to be “made of the same stuff” as whatever thing it is to which we’re attributing motion.</p>\n<p>How does an observer observe? Ultimately whatever is “happening in the outside world” must affect the observer, and the observer must change as a result. Our Physics Project has a fundamental way to think about change, in terms of elementary “updating events”. In addition to imagining that space is made up of discrete “atoms of space”, we imagine that change is made up of discrete “atoms of change” or “events”.</p>\n<p>In the hypergraph that represents space and everything in it, each event updates (or “rewrites”) the hypergraph, by “consuming” some collection of hyperedges, and generating a new collection. But actually events are a more general concept that don’t for example depend on having an underlying hypergraph. We can just think of them as <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#the-formal-structure-of-multicomputation'>consuming collections of &#8220;tokens&#8221;</a>, whatever they may be, and generating new ones. </p>\n<p>But events satisfy a very important constraint, which in some sense is responsible for the very existence of what we think of as time. And the constraint is that for any event to happen, all the tokens it’s going to consume have to exist. But those tokens have to have “come from somewhere”. And at least if we ignore what happens “at the very beginning” every token that’s going to be consumed has to have been generated by some other event. In other words, there’s a certain necessary ordering among events. And we can capture this by constructing a <a href='https://www.wolframphysics.org/technical-introduction/the-updating-process-for-string-substitution-systems/events-and-their-causal-relationships/' target=_blank rel=noopener>causal graph</a> that captures the causal relationships that must exist between events.</p>\n<p>As a <a href='https://www.wolframphysics.org/technical-introduction/the-updating-process-for-string-substitution-systems/causal-foliations-and-causal-cones/#p-237' target=_blank rel=noopener>simple example</a>, here’s a system that consists of a string of As and Bs, and in which each “updating event” (indicated as a yellow box) corresponds to an application of the rule BA&#8594;AB:</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822Zimg2.png\" alt='' title='' width='496' height='387' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822Zimg2_copy.txt\">\n\t\t\t\t\t<span class='close' id='2_out'>&#10005</span></p>\n<pre class='text' id='2_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>Here’s the causal graph for this superimposed:</p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822Zimg3.png\" alt='' title='' width='496' height='387' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822Zimg3_copy.txt\">\n\t\t\t\t\t<span class='close' id='3_out'>&#10005</span></p>\n<pre class='text' id='3_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>Imagine that some collection of characters on the left-hand side represents “an observer”. <a href='https://www.wolframscience.com/nks/p516--space-time-and-relativity/'>The only way this observer can be affected</a> by what happens on the right-hand side is as a result of its events being affected by events on the right-hand side. But what event is affected by what other event is exactly what the causal graph defines. And so in the end we can say that what the observer can “perceive” is just the causal graph of causal relationships between events.</p>\n<p>“From the outside” we might see some particular “absolute” arrangement of events in the cellular-automaton-like picture above. But the point is that “from the inside” the observer can’t perceive this “absolute arrangement”. All they can perceive is the causal graph. Or, put another way, the observer doesn’t have any “absolute knowledge” of the system; all they “know about” is “effects on them”.</p>\n<p>So what does this imply about motion? In something like a cellular automaton there’s a fixed concept of space that we typically “look at from the outside”—and we can readily “see what’s moving” relative to that fixed, absolute “background space”. But in something like our Physics Project we imagine that any observer must be inside the system, able to “tell what’s going on” only from the causal graph.</p>\n<p>In standard physics we might posit that to find out “where something is” we’d have to probe it, say with light signals. Here we’ve broken everything down to the level of elementary events and we’re in some sense “representing everything that can happen” in terms of the causal graph of relationships between events.</p>\n<p>And in fact as soon as we assume that our “perceived reality” has to be based on the causal graph, we’ve inevitably abandoned any absolute notion of space. All we as observers can know is “relative information”, defined for us by the causal graph.</p>\n<p>Looking at our BA&#8594;AB system above we can see that “viewed from the outside” there’s a lot of arbitrariness in “when we do” each update. But it turns out that none of this matters to the causal graph we construct—because this particular underlying system has the property of <a href='https://www.wolframphysics.org/technical-introduction/the-updating-process-for-string-substitution-systems/the-phenomenon-of-causal-invariance/' target=_blank rel=noopener>causal invariance</a>, which makes the causal graph have the same structure independent of these choices. And in general whenever there’s causal invariance (which there inevitably will be at least at the <a href='https://writings.stephenwolfram.com/2021/11/the-concept-of-the-ruliad/'>ultimate level of the ruliad</a>) this has the important implication that there’s <a href='https://www.wolframscience.com/nks/p516--space-time-and-relativity/'>relativistic invariance in the system</a>.</p>\n<p>We won’t go into this in detail here. Because while it certainly affects the specifics of how motion works there are more fundamental issues to discuss about the underlying concept of motion itself. </p>\n<p>We’ve already discussed the idea that observers like us posit our own persistence through time. But now we can be a bit more precise—and say that what we really posit is that we “follow the causal graph”. It could be that our perception samples all sorts of events—that we might think of as being “all over spacetime”. But in fact we assume that we don’t “jump around the causal graph”, and that instead our experiences are based on “coherent paths” through the causal graph.</p>\n<p>We never in any absolute sense “know where we are”. But we construct our notion of place by positing that we exist at a definite—and in a sense “coherent”—place, relative to which we perceive other things. If our perception of “where we are” could “jump around” the causal graph, we’d never be able to define a coherent concept of pure motion. </p>\n<p>To make this a little bit “more practical” let’s discuss (as <a href='https://writings.stephenwolfram.com/2020/10/faster-than-light-in-our-model-of-physics-some-preliminary-thoughts/'>I did some time ago</a>) the question of faster-than-light travel in our Physics Project. By the very definition of the causal graph the effect of one event on another is represented by the presence of a “causal path” between the events within the graph. We can assume that “traversing” each “causal edge” (i.e. going from one event to the next) takes a certain elementary time. But to work out “how fast the effect propagated” we need to know how “far away in space” the event that was affected is.</p>\n<p>But recall that all the observer ultimately has available is the causal graph. So any questions about “distances in space” have to be deduced from the causal graph. And the nature of the observer—and the assumptions they make about themselves—inevitably affect the deductions they make. </p>\n<p>Imagine a causal graph that is mostly a grid, but suppose there is a single edge that “jumps across the grid”, connecting events that would otherwise be distant in the graph. If we as observers were sensitive to that single edge it’d make us think that the two events it joins are “very close together”. But if we look only at the “bulk structure” of the causal graph, we’d ignore that edge in our definition of the “layout of space”, and consider it only as some kind of “microscopic anomaly”. </p>\n<p>So should we in fact <a href='https://writings.stephenwolfram.com/2020/10/faster-than-light-in-our-model-of-physics-some-preliminary-thoughts/#to-travel-to-communicate'>include that single edge when we define our concept of motion</a>? If we posit that we “exist at a definite place” then the presence of such an edge in what “constitutes us” means the “place we’re at” must extend to wherever in the causal graph the edge reaches. But if there are enough “stray edges” (or in general <a href='https://writings.stephenwolfram.com/2020/10/faster-than-light-in-our-model-of-physics-some-preliminary-thoughts/#can-we-make-tunnels-in-space'>what I call &#8220;space tunnels&#8221;</a>) we as observers would inevitably get very “delocalized”.</p>\n<p>To be able to “observe motion” we’d better be observers who can coherently form a notion of space in which there can be consistent “local places”. And if there’s some elaborate pattern of space tunnels this could potentially be broken. Although ultimately it won’t be unless the space tunnels are somehow coherent enough to “get observers like us through them”.</p>\n<p>Earlier we saw that the concept of motion depends on the idea that we as observers can identify “things” as “persistent” relative to the “background structure of space”. And now we can see that in fact motion depends on a certain persistence in time and “coherence” in place not only for the “thing” we posit is moving, but also for us as observers observing it.</p>\n<p>In our Physics Project we imagine that both time and space are fundamentally discrete. But the concept of persistence—or “coherence”—implies that at least at the level of our perception there must be a certain effectively continuous character to them. There’s a certain resonance with things like Zeno’s paradoxes. Yes, our models may define only what happens at a sequence of discrete steps. But the perception that we persistently exist will make us effectively fill in all the “intervening moments”—to form what we experience as a “continuous thread of existence”. </p>\n<p>The idea that pure motion is possible is thus intimately connected to the idea of the continuum. Pure motion in a sense posits that there is some kind of “thread of existence” for “things” that leads from one place and time to another. But ultimately all that’s relevant is that observers like us perceive there to be such a thread. And the whole point is that the possibility of such perception can be deduced as a matter of formal derivation from the structure of the underlying model and general characteristics of us as observers.</p>\n<p>But in describing our perception what we’ll tend to do is to talk in terms of the continuum. Because that’s the level of description at which we can abstractly discuss pure motion, without having to get into the mechanics of how it happens. And in effect the “derivation of pure motion” is thus directly connected to the “derivation of the continuum”: pure motion is in a sense an operational consequence not necessarily of an actual continuum world, but of a continuum perception of the world by an embedded observer like us.</p>\n<h2 id='motion-beyond-physical-space:-the-branchial-case'>Motion beyond Physical Space: The Branchial Case</h2>\n<p>Our everyday experience of motion has to do with ordinary, physical space. But the <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/'>multicomputational paradigm</a> inspired by our Physics Project inevitably leads to other kinds of space—that are different in character and interpretation from ordinary, physical space, but have deep analogies to it. So in the context of these other kinds of space, what analogs of the concept of “pure motion” might there be?</p>\n<p>Let’s talk first about <a href='https://www.wolframphysics.org/technical-introduction/the-updating-process-for-string-substitution-systems/the-concept-of-branchial-graphs/' target=_blank rel=noopener>branchial space</a>, which in our Physics Project is interpreted as the space of quantum states. To approach this from a simple example, let’s consider the multiway graph generated by applying the rule {A&#8594;AB,B&#8594;A} in all possible ways to each “state”: </p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: 5px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img21.png\" alt='' title='' width='529' height='274' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/sw031822img21_copy.txt\">\n\t\t\t\t\t<span class='close' id='21_out'>&#10005</span></p>\n<pre class='text' id='21_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>We can think of each path through this graph as defining a possible history for the system, leading to a complicated pattern of possible “threads of history”, sometimes branching and sometimes merging. But now consider taking a “branchial slice” across this system—and then characterizing the “multicomputational behavior” of the system by constructing what we call the branchial graph by joining states that share an ancestor on the step before: </p>\n<table class='InCell'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img style=\"margin-left: 5px\" class='' src=\"https://content.wolfram.com/uploads/sites/43/2022/03/finalimagev5.png\" alt='' title='' width='522' height='258' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/43/2022/03/finalimagev4_copy.txt\">\n\t\t\t\t\t<span class='close' id='22_out'>&#10005</span></p>\n<pre class='text' id='22_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p>For physics, we interpret the nodes of these graphs as quantum states, so that the branchial graph effectively gives us a “<a href='https://www.wolframphysics.org/technical-introduction/potential-relation-to-physics/quantum-formalism/' target=_blank rel=noopener>map of quantum entanglements</a>” between states. And just like for the hypergraph that we imagine defines the relations between the atoms of physical space, we think about the limit of a very large branchial graph—that gives us what we can call branchial space. As we’ve <a href='https://www.wolframphysics.org/technical-introduction/the-updating-process-for-string-substitution-systems/typical-forms-of-branchial-graphs/' target=_blank rel=noopener>discussed elsewhere</a>, branchial space is in many ways much wilder than ordinary, physical space, and is for example probably exponential-dimensional.</p>\n<p>In basic quantum mechanics, distances in branchial space are probably related to differences in phase between quantum amplitudes. In more complicated cases they probably correspond to more complicated transformations between quantum states. So how might we think about “motion” in branchial space?</p>\n<p>Although we’ve <a href='https://www.wolframphysics.org/technical-introduction/potential-relation-to-physics/matter-energy-and-gravitation/' target=_blank rel=noopener>discussed it at length elsewhere</a>, we didn’t above talk about what we might call “bulk motion” in physical space, as effectively produced by the curvature of space associated with gravity. But in branchial space there <a href='https://www.wolframphysics.org/technical-introduction/potential-relation-to-physics/correspondence-between-relativity-and-quantum-mechanics/' target=_blank rel=noopener>seems to be a directly analogous phenomenon</a>—in which the presence of energy (which corresponds to the density of activity in the system) leads to an effective curvature in branchial space which deflects all paths, in a way that seems to produce the change of quantum phase specified by the path integral. </p>\n<p>But can we identify specific things moving and preserving their identity in branchial space, as we can identify things like particles moving in physical space? It’s a tricky story, incompletely figured out, and deeply connected to issues of quantum measurement. But just like in physical space, an important issue is to define what “observers like us” are like. And a crucial first step is to realize that—as entities embedded in the universe—we must inevitably have multiple histories. So to ask how we perceive what happens in the universe is in effect to ask how a “branching mind” perceives a branching universe. </p>\n<p>And the crucial point—directly analogous to what we’ve discussed in the case of physical space—is that whatever one might be able to “see from outside”, we “internally” assume that we as observers have a certain persistence and coherence. In particular, even though “from the outside” the multiway graph might show many branching threads of history, our perception is that we have a single thread of experience. </p>\n<p>In ordinary quantum mechanics, it’s quite tricky to see how this “conflation of threads of history” interacts even with “bulk motion” in branchial space. Typically, as in traditional quantum measurement, one just considers “snapshots” at particular times. Yes, one can imagine that things like <a href='https://www.wolframphysics.org/technical-introduction/potential-relation-to-physics/wave-particle-duality-uncertainty-relations-etc/' target=_blank rel=noopener>wave packets spread out in branchial space</a>, but—a bit like discussing “motion” for gravitational fields or even gravitational waves in spacetime—there isn’t the same kind of systematic concept of pure motion that we’ve encountered with things like particles in physical space.</p>\n<p>When we get to quantum field theory—or the full quantum gravity associated with our models—it will probably be a different story. Perhaps we can view certain configurations of quantum fields as being like structures in branchial space, that an observer will consider to be localized and persistent. Indeed, it’s easy to imagine that in the branchial graph—or even more so the multiway causal graph—there may be things like “topologically stable” structures that we can reasonably think of as “things that move”. But just what the character and interpretation of such things might be, we don’t yet know.</p>\n<h2 id='motion-in-rulial-space'>Motion in Rulial Space</h2>\n<p>There’s physical space, and there’s branchial space. But in a sense the ultimate kind of space is rulial space. The story begins with <a href='https://writings.stephenwolfram.com/2021/11/the-concept-of-the-ruliad/'>the ruliad</a>, which represents the entangled limit of all possible computations. The ruliad is what we imagine underlies not only physics <a href='https://writings.stephenwolfram.com/2022/03/the-physicalization-of-metamathematics-and-its-implications-for-the-foundations-of-mathematics/'>but also mathematics</a>. When we “experience physics” we’re sampling a certain slice of the ruliad that’s accessible to physical observers like us. And when we “experience mathematics” we’re sampling a slice of the ruliad that’s accessible to “mathematical observers” like us. </p>\n<p>So what do different “places” in rulial space correspond to? Fundamentally they’re different choices for the rules we sample from the ruliad. Ultimately everything is part of the unique object that is the ruliad. But at different places in the ruliad we’ll have different specific experiences as observers.</p>\n<p>Inevitably, though, there’s a translation that can be made. It’s basically like the situation with different computational systems that—according to the <a href='https://www.wolframscience.com/nks/chap-12--the-principle-of-computational-equivalence/'>Principle of Computational Equivalence</a>—are generically universal: there’s always an “interpreter” that can be created in one system that can translate to the other.</p>\n<p>In a sense the idea of different places in rulial space is quite familiar from our everyday experience. Because it’s directly analogous to the idea that different minds “parse” and “experience” the world differently. Whether one’s talking about a human brain or an artificial neural net, the details of its past experience will cause it to represent things in the world in different ways, and to process them differently.</p>\n<p>At the very lowest level, the components of the systems will—like any other universal computer—be able to emulate the detailed operations of other systems. But at this level there are no “things that are moving from one place to another in rulial space”; everything is just being “atomized”.</p>\n<p>So are there in fact robust structures that can “move across rulial space”? The <a href='https://writings.stephenwolfram.com/2021/11/the-concept-of-the-ruliad/#communicating-across-rulial-space'>answer, I think, is yes</a>. But it’s a strange story. I suspect that the analog in rulial space of particles in physical space is basically concepts—say of the kind that might be represented by words in a human <a href='https://writings.stephenwolfram.com/2019/05/what-weve-built-is-a-computational-language-and-thats-very-important/'>(or computational) language</a>.</p>\n<p>Imagine thinking about a cat. There’s a particular representation of a cat in one’s brain—and in detail it’ll be different from the representation in anyone else’s brain. But now imagine using the word “cat”, or in some way communicating the concept of “cat”. The “cat” concept is something robust, that we’re used to seeing “transmitted” from one brain to another—even though different brains represent it differently.</p>\n<p>Things might not work this way. It could be that there’d be no robust way to transmit anything about the thinking going on in one brain to another brain. But that’s where the idea of concepts comes in. They’re an abstracted way to “transport” some feature of thinking in one brain to another.</p>\n<p>And in a sense they’re a reflection of the possibility of pure motion in rulial space: they’re a way to have some kind of persistent “thing” that can be traced across rulial space. </p>\n<p>But just like our examples of motion, the way this works depends on the characteristics of the observers observing it—and insofar as we are the observers, it therefore depends on us. We know from experience that we form concepts, and that they have a certain robustness. But why is this? In a sense, concepts are a way of coarse-graining things so that we—as computationally bounded entities—can deal with them. And the fact that we take concepts to maintain some kind of fixed meaning is part of our perception that we maintain a single persistent thread of experience.</p>\n<p>It is strange to think that something as explicit and concrete as an electron in physical space could in some sense be similar to an abstract concept like “cat”. But this is the kind of thing that happens when one has something as fundamental and general as the ruliad underlying everything.</p>\n<p>We know that our general characteristics as observers inevitably lead to certain general laws of physics. And so similarly we can expect that our general characteristics as observers will lead to certain general laws about the overall representation of things. Perhaps we’ll be able to identify analogs of energy and gravity and quantum mechanics. But a first step is to identify the analog of motion, and the kinds of things which can exhibit pure motion.</p>\n<p>In physical space, particles like electrons are our basic “carriers of motion”. In rulial space “concepts” seem to be our best description of the “carriers of motion” (though there are presumably higher-level constructs too, like analogies and syntactic structures). And, yes, it might seem very odd to say that something as apparently human-centered as “concepts” can be associated with something as fundamental as motion. But as we’ve emphasized several times here, “pure motion” is something that relies on the observer, and on the observer having what amounts to a “sensory apparatus” that considers a “thing” to maintain a persistent character. So when it comes to the representation of “arbitrary content” it’s not surprising that we as observers have to talk about the fundamental way we think about things, and about constructs like concepts.</p>\n<p>But are things like concepts the only kind of persistent structures that can exist in rulial space? They’re ones that we as observers can readily parse out of the ruliad—based for example on the particular ways of thinking that we’ve embraced so far in our intellectual development. But we can certainly imagine that there’s the possibility for “robust communication” independent, for example, of human minds.</p>\n<p>There’s a great tendency, though, to try to relate things back to human constructs. For example, we might consider a machine-learning system that’s successfully discovered a <a href='https://writings.stephenwolfram.com/2018/11/logic-explainability-and-the-future-of-understanding/#the-concept-of-concepts'>distinction that can repeatedly be used</a> for some purpose. And, yes, we can imagine “transporting” that to a different system. But we’ll tend to think of this again in terms of some “feature” or “concept”, even though, for example, we might not happen (at least yet) to have some word for it in a human language, or a computational language intended for use by humans.</p>\n<p>We can similarly talk about communication with or between other animals, or, more ambitiously, we can discuss <a href='https://writings.stephenwolfram.com/2018/01/showing-off-to-the-universe-beacons-for-the-afterlife-of-our-civilization/'>communications with or between &#8220;alien intelligences&#8221;</a>. We might assume that we would be able to say nothing about such cases. But ultimately we imagine that everything is represented somewhere in the ruliad. And in effect by doing things like <a href='https://www.wolframscience.com/nks/chap-3--the-world-of-simple-programs/'>exploring arbitrarily chosen programs</a> we can investigate possible “raw material” for “alien intelligence”.</p>\n<p>And it’s then at some level a <a href='https://www.wolframscience.com/nks/'>matter of science</a>—or, more specifically, <a href='https://writings.stephenwolfram.com/2021/09/charting-a-course-for-complexity-metamodeling-ruliology-and-more/#the-pure-basic-science-of-ruliology'>ruliology</a>—to try to identify “transportable elements” between different programs, or, in effect, between different places in rulial space. At a simple level we might say we’re looking for “common principles”—which puts us back to something like “concepts”. But in general we can imagine a more elaborate computational structure for our “transportable elements” in rulial space.</p>\n<p>In physical space we know that we can make “material objects” out of particles like electrons and quarks, and then “move these around” in physical space. Within the domain of “human-thinking rulial space” we can do something analogous with descriptions “made from known concepts”. And in both cases we can imagine that there are more general constructs that are “possible”, even though we human observers as we are now might not be able to “parse them out of the ruliad”.</p>\n<p>The constraints of computational boundedness and perception of persistence are probably pretty fundamental to any form of experience that can be connected to us. But as we develop what amount to new sensory capabilities or new ways of thinking we can expect that our “range” as observers will at least somewhat increase. </p>\n<p>And in a sense our very exploration of the concept of motion here can be thought of as a way to make possible a little bit more motion in rulial space. The concept of motion is a very general one. And one that we now see is deeply tied into ideas about observers and multicomputation. The question of how things can move is the same one that was asked in antiquity. But the tower of ideas that we can now bring to bear in answering is very different, and it’s sobering to see just how far we really were earlier in intellectual history from being able to meaningfully address it.</p>\n",
  "wfw:commentRss": "https://writings.stephenwolfram.com/2022/03/on-the-concept-of-motion/feed/",
  "slash:comments": 5
}