{
  "title": "How did Bill James get this one wrong on regression to the mean?  Here are 6 reasons:",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/13/bill-james-vs-kahneman-and-tversky/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/13/bill-james-vs-kahneman-and-tversky/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Thu, 13 Oct 2022 13:46:58 +0000",
  "category": [
    "Causal Inference",
    "Miscellaneous Statistics",
    "Sports",
    "Zombies"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=47423",
  "description": "I&#8217;m a big fan of Bill James, but I think he might be picking up the wrong end of the stick here. The great baseball analyst writes about what he calls the Law of Competitive Balance. His starting point is &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/13/bill-james-vs-kahneman-and-tversky/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>I&#8217;m a <a href=\"https://www.baseballprospectus.com/news/article/13810/baseball-proguestus-a-statistician-rereads-bill-james/\">big fan</a> of Bill James, but I think he might be picking up the wrong end of the stick here.</p>\n<p>The great baseball analyst <a href=\"https://web.archive.org/web/20220426120747/https://www.billjamesonline.com/the_law_of_competitive_balance_redux/\">writes about</a> what he calls the Law of Competitive Balance.  His starting point is that teams that are behind are motivated to work harder to have a chance of winning, which moves them to switch to high-variance strategies such as long passes in football (more likely to score a touchdown, also more likely to get intercepted), etc.  Here&#8217;s Bill James:</p>\n<blockquote><p>Why was there an increased chance of a touchdown being thrown? </p>\n<p>Because the team was behind.</p>\n<p>Because the team was behind, they had an increased NEED to score.</p>\n<p>Because they had an increased need to score points, they scored more points. </p>\n<p>That is one of three key drivers of The Law of Competitive Balance:  that success increases when there is an increased need for success.   This applies not merely in sports, but in every area of life.  But in the sports arena, it implies that the sports universe is asymmetrical. . . .</p>\n<p>Because this is true, the team which has the larger need is more willing to take chances, thus more likely to score points.  The team which is ahead gets conservative, predictable, limited.  This moves the odds.   The team which, based on their position, would have a 90% chance to win doesn’t actually have a 90% chance to win.  They may have an 80% chance to win; they may have an 88% chance to win, they may have an 89.9% chance to win, but not 90.</p></blockquote>\n<p>I think he&#8217;s mixing a correct point here with an incorrect point.</p>\n<p>James&#8217;s true statement is that, as he puts it, &#8220;there is an imbalance in the motivation of the two teams, an imbalance in their willingness to take risks.&#8221;  The team that&#8217;s behind is motivated to switch to strategies that increase the variance of the score differential, even at the expense of lowering its expected score differential.  Meanwhile, the team that&#8217;s ahead is motivated to switch to strategies that decrease the variance of the score differential, even at the expense of lowering <em>its</em> expected score differential.  In basketball, it can be as simple as the team that&#8217;s behind pushing up the pace and the team that&#8217;s ahead slowing things down.  The team that&#8217;s trailing is trying to have some chance of catching up&#8212;their goal is to win, not to lose by a smaller margin; conversely, the team that&#8217;s in the lead is trying to minimize the chance of the score differential going to zero, not to run up the score.  As James says, these patterns are averages and won&#8217;t occur from play to play.  Even if you&#8217;re behind by 10 in a basketball game with 3 minutes to play, you&#8217;ll still take the open layup rather than force the 3-pointer, and even if you&#8217;re ahead by 10, you&#8217;ll still take the open shot with 20 seconds left on the shot clock rather than purely trying to eat up time.  But on average the logic of the game leads to different strategies for the leading and trailing teams, and that will have consequences on the scoreboard.</p>\n<p>James&#8217;s mistake is to think, when this comes to probability of winning, that this dynamic on balance favors the team that&#8217;s behind.  When strategies are flexible, the team that&#8217;s behind does not necessarily increase its probability of winning relative to what that probability would be if team strategies were constant.  Yes, the team that&#8217;s behind will use strategies to increase the probability of winning, but the team that&#8217;s ahead will alter its strategy too.  Speeding up the pace of play should, on average, increase the probability of winning for the trailing team (for example, increasing the probability from, I dunno, 10% to 15%), but meanwhile the team that&#8217;s ahead is slowing down the pace of play, which should send that probability back down.  On net, will this favor the leading team or the trailing team when it comes to win probability?  It will depend on the game situation.  In some settings (for example, a football game where the team that&#8217;s ahead has the ball on first down with a minute left), it will favor the team that&#8217;s ahead.  In other settings it will go the other way.</p>\n<p>James continues:</p>\n<blockquote><p>That is one of the three key drivers of the Law of Competitive Balance.  The others, of course, are adjustments and effort.  When you’re losing, it is easier to see what you are doing wrong.  Of course a good coach can recognize flaws in their plan of attack even when they are winning, but when you’re losing, they beat you over the head.</p></blockquote>\n<p>I don&#8217;t know about that.  As a coach myself, I could just as well argue the opposite point, as follows.  When you&#8217;re winning, you can see what works while having the freedom to experiment and adapt to fix what doesn&#8217;t work.  But when you&#8217;re losing, it can be hard to know where to start or have a sense of what to do to improve.</p>\n<p>Later on in his post, James mentions that, when you&#8217;re winning, part of that will be due to situational factors that won&#8217;t necessarily repeat.  The quick way to say that is that, when you&#8217;re winning, part of your success is likely to be from &#8220;luck&#8221;; a formulation that I&#8217;m OK with as long as we take this term generally enough to refer to factors that don&#8217;t necessarily repeat, such as pitcher/batter matchups, to take an example from James&#8217;s post.</p>\n<p>But James doesn&#8217;t integrate this insight into his understanding of the law of competitive balance.  Instead, he writes:</p>\n<blockquote><p>If a baseball team is 20 games over .500 one year, they tend to be 10 games over the next.   If a team is 20 games under .500 one year, they tend to be 10 games under the next year.  If a team improves by 20 games in one year (even from 61-101 to 81-81) they tend to fall back by 10 games the next season.   If they DECLINE by 10 games in a year, they tend to improve by 5 games the next season. </p>\n<p>I began to notice similar patterns all over the map.   If a batter hits .250 one year and .300 the next, he tends to hit about .275 the third year.  Although I have not demonstrated that similar things happen in other sports, I have no doubt that they do.   I began to wonder if this was actually the same thing happening, but in a different guise.  You get behind, you make adjustments.  You lose 100 games, you make adjustments.  You get busy.  You work harder.  You take more chances.  You win 100 games, you relax.  You stand pat.</p></blockquote>\n<p>James&#8217;s description of the data is fine; his mistake is to attribute these changes to teams &#8220;making adjustments&#8221; or &#8220;standing pat.&#8221;  That could be, but it could also be that teams that win 100 games &#8220;push harder&#8221; and that teams that lose 100 games &#8220;give up.&#8221;  The real point is statistical, which is that this sort of &#8220;regression to the mean&#8221; will happen without any such adjustment effects, just from &#8220;luck&#8221; or &#8220;random variation&#8221; or varying situational factors.</p>\n<p>Here&#8217;s a famous example from Tversky and Kahneman (1973):</p>\n<blockquote><p>The instructors in a flight school adopted a policy of consistent positive reinforcement recommended by psychologists. They verbally reinforced each successful execution of a flight maneuver. After some experience with this training approach, the instructors claimed that contrary to psychological doctrine, high praise for good execution of complex maneuvers typically results in a decrement of performance on the next try.</p></blockquote>\n<p>Actually, though:</p>\n<blockquote><p>Regression is inevitable in flight maneuvers because performance is not perfectly reliable and progress between successive maneuvers is slow. Hence, pilots who did exceptionally well on one trial are likely to deteriorate on the next, regardless of the instructors&#8217; reaction to the initial success. The experienced flight instructors actually discovered the regression but attributed it to the detrimental effect of positive reinforcement.</p></blockquote>\n<p>&#8220;Performance is not perfectly reliable and progress between successive maneuvers is slow&#8221;:  That describes pro sports!</p>\n<p>As we write in Regression and Other Stories, the point here is that a <em>quantitative</em> understanding of prediction clarifies a fundamental <em>qualitative</em> confusion about variation and causality.  From purely mathematical considerations, it is expected that the best pilots will decline, relative to the others, while the worst will improve in their rankings, in the same way that we expect daughters of tall mothers to be, on average, tall but not quite as tall as their mothers, and so on.</p>\n<p>I was surprised to see Bill James make this mistake.  All the years I&#8217;ve read him writing about the law of competitive balance and the plexiglass principle, I always assumed that he&#8217;d understood this as an inevitable statistical consequence of variation without needing to try to attribute it to poorly-performing teams trying harder etc.</p>\n<p><strong>How did he get this one so wrong?  Here are 6 reasons.</strong></p>\n<p>This raises a new question, which is how could such a savvy analyst make such a basic mistake?  I have six answers:</p>\n<p>1.  Multiplicity.  Statistics is <a href=\"https://statmodeling.stat.columbia.edu/2016/03/11/statistics-is-like-basketball-or-knitting/\">hard</a>, and if you do enough statistics, you&#8217;ll eventually make some mistakes.  I make mistakes too!  It just happens that this &#8220;regression to the mean&#8221; fallacy is a mistake that James made.</p>\n<p>2.  It&#8217;s a <em>basic</em> mistake and an <em>important</em> mistake, but it&#8217;s not a <em>trivial</em> mistake.  Regression to the mean is a notoriously difficult topic to teach (you can cruise over to chapter 6 of <a href=\"http://www.stat.columbia.edu/~gelman/regression/\">our book</a> and see how we do; maybe not so great!).</p>\n<p>3.  Statistics textbooks, including my own, are full of boring details, so I can see that, whether or not Bill James has read any such books, he wouldn&#8217;t get so much out of them.</p>\n<p>4.  In his attribution of regression to the mean, James is making an error of <em>causal reasoning</em> and a <em>modeling</em> error, but it&#8217;s not a <em>prediction</em> error.  The law of competitive balance and the plexiglass principle give valid predictions, and they represent insights that were not widely available in baseball (and many other fields) before James came along.  Conceptual errors aside, James was still moving the ball forward, as it were.  When he goes beyond prediction in his post, for example making strategy recommendations, I&#8217;m doubtful, but I&#8217;m guessing that the main influence on readers of his &#8220;law of competitive balance&#8221; is to the predictive part.</p>\n<p>5.  Hero worship.  The man is a living legend.  That&#8217;s great&#8212;he deserves all his fame&#8212;but the drawback is that maybe it&#8217;s a bit too easy for him to fall for his own hype and not question himself or fully hear criticism.  We&#8217;ve seen the same thing happen with baseball and political analyst Nate Silver, who continues to do excellent work but sometimes can&#8217;t seem to digest feedback from outsiders.</p>\n<p>6.  Related to point 5 is that James made his breakthroughs by fighting the establishment.  For many decades he&#8217;s been saying outrageous things and standing up for his outrageous claims even when they&#8217;ve been opposed by experts in the field.  So he keeps doing it, which in some ways is great but can also lead him astray, by trusting his intuitions too much and not leaving himself more open for feedback.</p>\n<p>I guess we could say that, in sabermetrics, James was on a winning streak for a long time so he relaxes. He stands pat.  He has less motivation to see what&#8217;s going wrong.</p>\n<p><strong>P.S.</strong>  Again, I&#8217;m a big fan of Bill James.  It&#8217;s interesting when smart people make mistakes.  When dumb people make mistakes, that&#8217;s boring.  When someone who&#8217;s thought so much about statistics makes such a basic statistical error, that&#8217;s interesting to me.  And, as noted in item 4 above, I can see how James could have this misconception for decades without it having much negative effect on his work.</p>\n<p><strong>P.P.S.</strong>  Just to clarify:  Bill James made two statements.  The first was predictive and correct; the second was causal and misinformed.</p>\n<p>His first, correct statement is that there is &#8220;regression to the mean&#8221; or &#8220;competitive balance&#8221; or &#8220;plexiglas&#8221; or whatever you want to call it:  players or teams that do well in time 1 tend to decline in time 2, and players or teams that do poorly in time 2 tend to improve in time 2.  This statement, or principle, is correct, and it can be understood as a general mathematical or statistical pattern that arises when correlations are less than 100%.  This pattern is not always true&#8212;it depends on the joint distribution of the before and after measurements (<a href=\"https://statmodeling.stat.columbia.edu/2022/10/13/bill-james-vs-kahneman-and-tversky/#comment-2104254\">see here</a>) but it is typically the case.</p>\n<p>His second, misinformed statement is that this is caused by players or teams that are behind at time 1 being more innovative or trying harder and players or teams that are ahead at time 2 being complacent or standing pat.  This statement is misinformed because the descriptive phenomenon of regression-to-the-mean or competitive-balance or plexiglas will happen even in the absence of any behavioral changes.  And, as discussed in the above post, behavioral changes can go in either direction; there&#8217;s no good reason to think that, when both teams perform strategic adjustments, that these adjustments on net will benefit the team that&#8217;s behind.</p>\n<p>This is all difficult because it is natural to observe the first, correct predictive statement and from this to mistakenly infer the second, misinformed causal statement.  Indeed this inference is such a common error that it is a major topic in statistics and is typically covered in introductory texts. We devote a whole chapter to it in Regression and Other Stories, and if you&#8217;re interested in understanding this I recommend you read chapter 6; the book is <a href=\"http://www.stat.columbia.edu/~gelman/regression/\">freely available online</a>.</p>\n<p>For the reasons discussed above, I&#8217;m not shocked that Bill James made this error:  for his purposes, the predictive observation has been more important than the erroneous causal inference, and he figured this stuff out on his own, without the benefit or hindrance of textbooks, and given his past success as a rebel, I can see how it can be hard for him to accept when outsiders point out a subtle mistake. But, as noted in the P.S. above, when smart people get things wrong, it&#8217;s interesting; hence this post.</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/13/bill-james-vs-kahneman-and-tversky/feed/",
  "slash:comments": 52
}