{
  "id": "yt:video:rzucANvHlvc",
  "yt:videoId": "rzucANvHlvc",
  "yt:channelId": "UCBH5VZE_Y4F3CMcPIzPEB5A",
  "title": "Energy Crisis Dos and Don'ts With Doomberg",
  "link": "",
  "author": {
    "name": "Real Vision Finance",
    "uri": "https://www.youtube.com/channel/UCBH5VZE_Y4F3CMcPIzPEB5A"
  },
  "published": "2022-10-31T20:42:10+00:00",
  "updated": "2022-11-01T19:13:26+00:00",
  "media:group": {
    "media:title": "Energy Crisis Dos and Don'ts With Doomberg",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "“This should be fun,” tweeted Doomberg amid reports President Joe Biden will propose a “windfall tax” on profits of oil and gas producers, as political leaders continue to pose against the global energy problem. Andreas Steno Larsen welcomes the congenitally acerbic and always insightful Green Chicken for today’s Daily Briefing to talk about realistic solutions to a situation that only seems to be growing worse by the day – with inflation yet to peak and still more resource-scarcity promised by Russia’s withdrawal from the Black Sea Grain Initiative. We also hear from White Tundra Investments CEO Shubham Garg, who shares his reasoning for exponential growth in global oil demand. Watch Shubham Garg’s complete presentation here: https://www.realvision.com/shows/3-ideas/videos/where-to-pick-in-canadas-energy-patch-LwzQ?tab=details. We want to hear from you too – please share your comments, questions, and suggestions.\n\n\n\nThanks for watching The Daily Briefing. Sign up here with your email address to have every episode delivered to your inbox Monday-Friday: http://rvtv.io/DailyBriefEmail\n\nAbout Real Vision™:\nReal Vision™ is where you can gain an understanding of the complex world of finance, business and the global economy with real in-depth analysis from real experts. \n\nConnect with Real Vision™ Online:\nTwitter: https://rvtv.io/twitter\nInstagram: https://rvtv.io/instagram\nFacebook: https://rvtv.io/facebook\nLinkedin: https://rvtv.io/linkedin \n\nEnergy Crisis Dos and Don'ts With Doomberg.\n\nDisclaimer:\nThis is pretty obvious, but we should probably say it anyway so that there is absolutely no confusion…The material in REAL VISION GROUP video programs and publications {collectively referred to as “RV RELEASES”} is provided for informational purposes only and is NOT investment advice. The information in RV RELEASES has been obtained from sources believed to be reliable, but Real Vision and its contributors, distributors and/or publisher, licensors, and their respective employees, contractors , agents, suppliers and vendors { collectively, “Affiliated Parties”} make no representation or warranty as to the accuracy, timeliness or completeness of the content in RV RELEASES. Any data included in RV RELEASES are illustrative only and not for investment purposes. Any opinion or recommendation expressed in RV RELEASES is subject to change without notice. RV Releases do not recommend, explicitly nor implicitly, nor suggest or recommend any investment strategy. Real Vision Group and its Affiliated Parties disclaim all liability for any loss that may arise (whether direct indirect, consequential, incidental, punitive or otherwise) from any use of the information in RV RELEASES. Real Vision Group and its Affiliated Parties do not have regard to any individual’s, group of individuals’ or entity’s specific investment objectives, financial situation or circumstance. RV RELEASES do not express any opinion on the future value of any security, currency or other investment instrument. You should seek expert financial and other advice regarding the appropriateness of the material discussed or recommended in RV RELEASES and should note that investment values may fall, you may receive less back than originally invested and past performances is not necessarily reflective of future performances. Well that was pretty intense! We hope you got all of that – now stop reading the small print and go and enjoy Real Vision.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}