{
  "title": "Churches Are Breaking the Law by Endorsing in Elections, Experts Say. The IRS Looks the Other Way.",
  "link": "https://www.propublica.org/article/irs-church-nonprofit-endorsements-johnson-amendment",
  "pubDate": "Sun, 30 Oct 2022 06:00:00 -0400",
  "guid": "https://www.propublica.org/article/irs-church-nonprofit-endorsements-johnson-amendment",
  "description": "\n                <p class=\"byline\">\n                by <a class=\"name\" href=\"https://www.propublica.org/people/jeremy-schwartz\">Jeremy Schwartz</a> and <a class=\"name\" href=\"https://www.propublica.org/people/jessica-priest\">Jessica Priest</a>                </p>\n                                             \n\n                                                                    \n            \n                <p>ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive <a href=\"https://www.propublica.org/newsletters/the-big-story?source=54G&placement=top-note&region=texas\">our biggest stories</a> as soon as they’re published.</p>\n\n            \n\n                \n\n\n\n                                                                    \n            \n                <p>This article is co-published with The Texas Tribune, a nonprofit, nonpartisan local newsroom that informs and engages with Texans. Sign up for <a href=\"https://www.texastribune.org/newsletters/briefweekly/\">The Brief Weekly</a> to get up to speed on their essential coverage of Texas issues.</p>\n\n            \n\n                \n\n      \n  \n\n\n\n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.0\">Six days before a local runoff election last year in Frisco, a prosperous and growing suburb of Dallas, Brandon Burden paced the stage of KingdomLife Church. The pastor told congregants that demonic spirits were operating through members of the City Council.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.1\">Grasping his Bible with both hands, Burden said God was working through his North Texas congregation to take the country back to its Christian roots. He lamented that he lacked jurisdiction over the state Capitol, where he had gone during the 2021 Texas legislative session to lobby for conservative priorities like expanded gun rights and a ban on abortion.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.2\">“But you know what I got jurisdiction over this morning is an election coming up on Saturday,” Burden told parishioners. “I got a candidate that God wants to win. I got a mayor that God wants to unseat. God wants to undo. God wants to shift the balance of power in our city. And I have jurisdiction over that this morning.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.3\">What Burden said that day in May 2021 was a violation of a long-standing federal law barring churches and nonprofits from directly or indirectly participating in political campaigns, tax law experts told ProPublica and The Texas Tribune. Although the provision was mostly uncontroversial for decades after it passed in 1954, it has become a target for both evangelical churches and former President Donald Trump, who vowed to eliminate it.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.4\">Burden’s sermon is among those at 18 churches identified by the news organizations over the past two years that appeared to violate the Johnson Amendment, a measure named after its author, former President Lyndon B. Johnson. Some pastors have gone so far as to paint candidates they oppose as demonic.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.5\">At one point, churches fretted over losing their tax-exempt status for even unintentional missteps. But the IRS has largely abdicated its enforcement responsibilities as churches have become more brazen. In fact, the number of apparent violations found by ProPublica and the Tribune, and confirmed by three nonprofit tax law experts, are greater than the total number of churches the federal agency has investigated for intervening in political campaigns over the past decade, according to records obtained by the news organizations.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.6\">In response to questions, an IRS spokesperson said that the agency “cannot comment on, neither confirm nor deny, investigations in progress, completed in the past nor contemplated.” Asked about enforcement efforts over the past decade, the IRS pointed the news organizations to annual reports that do not contain such information.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.7\">Neither Burden nor KingdomLife responded to multiple interview requests or to emailed questions.</p>\n        \n    \n                    \n\n    \n        \n\n    \n                                \n            \n        \n\n    \n\n    \n            (Video editing by Todd Wiseman/Texas Tribune and Justin Dehn/Texas Tribune. Source videos: Shelby Tauber for ProPublica/Texas Tribune, KingdomLife Church.)\n    \n    \n    \n\n\n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.0\">Trump’s opposition to the law banning political activity by nonprofits “has given some politically-minded evangelical leaders a sense that the Johnson Amendment just isn’t really an issue anymore, and that they can go ahead and campaign for or against candidates or positions from the pulpit,” said David Brockman, a scholar in religion and public policy at the Baker Institute for Public Policy at Rice University.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.1\">Among the violations the newsrooms identified: In January, an Alaska pastor told his congregation that he was voting for a GOP candidate who is aiming to unseat <a href=\"https://projects.propublica.org/represent/members/M001153-lisa-murkowski\">Republican U.S. Sen. Lisa Murkowski</a>, saying the challenger was the “only candidate for Senate that can flat-out preach.” During a May 15 sermon, a pastor in Rocklin, California, asked voters to get behind “a Christian conservative candidate” challenging Gov. Gavin Newsom. And in July, a New Mexico pastor called Democratic Gov. Michelle Lujan Grisham “beyond evil” and “demonic” for supporting abortion access. He urged congregants to “vote her behind right out of office” and challenged the media to call him out for violating the Johnson Amendment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.2\">Andrew Whitehead, a sociologist at Indiana University-Purdue University Indianapolis, who studies Christian nationalism, said the ramping up of political activity by churches could further polarize the country. “It creates hurdles for a healthy, functioning, pluralistic democratic society,” he said. “It’s really hard to overcome.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.3\">The Johnson Amendment does not prohibit churches from inviting political speakers or discussing positions that may seem partisan nor does it restrict voters from making faith-based decisions on who should represent them. But because donations to churches are tax-deductible and because churches don’t have to file financial disclosures with the IRS, without such a rule donors seeking to influence elections could go undetected, said Andrew Seidel, vice president of strategic communications for the advocacy group Americans United for Separation of Church and State.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.4\">“If you pair the ability to wade into partisan politics with a total absence of financial oversight and transparency, you’re essentially creating super PACs that are black holes,” Seidel said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.5\">Churches have long balanced the tightrope of political involvement, and blatant violations have previously been rare. In the 1960s, the IRS investigated complaints that some churches abused their tax-exempt status by distributing literature that was hostile to the election of John F. Kennedy, the country’s first Catholic president. And in 2004, the federal agency audited All Saints Episcopal Church in California after a pastor gave an anti-war speech that imagined Jesus talking to presidential candidates George W. Bush and John Kerry. The pastor did not endorse a candidate but criticized the Iraq war.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.6\">Some conservative groups have argued that Black churches are more politically active than their white evangelical counterparts but are not as heavily scrutinized. During the 1984 presidential campaign, Democratic candidate Rev. Jesse L. Jackson was accused of turning Sunday sermons into campaign rallies and using Black churches to raise funds. In response to allegations of illegal campaigning, Jackson said at the time that strict guidelines were followed and denied violating the law.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.7\">While some Black churches have crossed the line into political endorsements, the long legacy of political activism in these churches stands in sharp contrast to white evangelical churches, where some pastors argue devout Christians must take control of government positions, said Robert Wuthnow, the former director of the Princeton University Center for the Study of Religion.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.8\">Wuthnow said long-standing voter outreach efforts inside Black churches, such as Souls to the Polls, which encourages voting on Sundays after church services, largely stay within the boundaries of the law.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.9\">“The Black church has been so keenly aware of its marginalized position,” Wuthnow said. “The Black church, historically, was the one place where Black people could mobilize, could organize, could feel that they had some power at the local level. The white evangelical church has power. It’s in office. It’s always had power.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.10\">At the end of his two-hour sermon that May, Burden asserted that his church had a God-given power to choose lawmakers, and he asked others to join him onstage to “secure the gate over the city.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.11\">Burden and a handful of church members crouched down and held on to a rod, at times speaking in tongues. The pastor said intruders such as the mayor, who was not up for reelection last year but who supported one of the candidates in the race for City Council, would be denied access to the gates of the city.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.12\">“Now this is bold, but I’m going to say it because I felt it from the Lord. I felt the Lord say, ‘Revoke the mayor’s keys to this gate,’” Burden said. “No more do you have the key to the city. We revoke your key this morning, Mr. Mayor.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.13\">“We shut you out of the place of power,” Burden added. “The place of authority and influence.”</p>\n        \n    \n                        \n    \n        Johnson Amendment’s Cold War Roots\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.0\">Questions about the political involvement of tax-exempt organizations were swirling when Congress ordered an investigation in April 1952 to determine if some foundations were using their money “for un-American and subversive activities.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.1\">Leading the probe was Rep. Gene Cox, a Georgia Democrat who had accused the Guggenheim and Rockefeller foundations, among others, of helping alleged Communists or Communist fronts. Cox died during the investigation, and the final report cleared the foundations of wrongdoing.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.2\">But a Republican member of the committee argued for additional scrutiny, and in July 1953, Congress established the House Committee to Investigate Tax-Exempt Foundations. The committee focused heavily on liberal organizations, but it also investigated nonprofits such as the Facts Forum foundation, which was headed by Texas oilman H.L. Hunt, an ardent supporter of then-Sen. Joseph McCarthy of Wisconsin, a Republican who was best known for holding hearings to investigate suspected Communists.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.3\">In July 1954, Johnson, who was then a senator, proposed an amendment to the U.S. tax code that would strip nonprofits of their tax-exempt status for “intervening” in political campaigns. The amendment sailed through Congress with bipartisan support and was signed into law by Republican President Dwight D. Eisenhower.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.4\">Johnson never explained his intent. Opponents of the amendment, <a href=\"https://www.law.ua.edu/pubs/lrarticles/Volume%2061/Issue%205/combest.pdf\">as well as some academics</a>, say Johnson was motivated by a <a href=\"https://scholarlycommons.law.case.edu/cgi/viewcontent.cgi?article=2606&context=caselrev\">desire to undercut conservative foundations</a> such as the National Committee to Uphold Constitutional Government, founded by newspaper magnate Frank Gannett, which painted the Democrat as soft on communism and supported his opponent in the primary election. <a href=\"https://scholarlycommons.law.case.edu/cgi/viewcontent.cgi?article=1265&context=caselrev\">Others have hypothesized</a> that Johnson was hoping to head off a wider crackdown on nonprofit foundations.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.5\">Over the next 40 years, the IRS stripped a handful of religious nonprofits of their tax-exempt status. None were churches.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.6\">Then, just four days before the 1992 presidential election, Branch Ministries in New York ran two full-page ads in USA Today and The Washington Times urging voters to reject then-Arkansas Gov. Bill Clinton, a Democrat, in his challenge to Republican President George H.W. Bush.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.7\">The ads proclaimed: “Christian Beware. Do not put the economy ahead of the Ten Commandments.” They asserted that Clinton violated scripture by supporting “abortion on demand,” homosexuality and the distribution of condoms to teenagers in public schools. Clinton, the ads said, was “openly promoting policies that are in rebellion to God’s laws.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.8\">The IRS revoked the church’s tax-exempt status, leading to a long legal battle that ended with a <a href=\"https://casetext.com/case/branch-ministries-v-rossotti\">U.S. appeals court siding with the federal agency</a>.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.9\">The case remains the only publicly known example of the IRS revoking the tax-exempt status of a church because of its political activity in nearly 70 years. The Congressional Research Service said in 2012 that a <a href=\"https://www.everycrsreport.com/reports/RL34447.html\">second church had </a><a href=\"https://www.everycrsreport.com/reports/RL34447.html\">lost its tax-exempt status, but that its identity “is not clear.”</a></p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.10\">Citing an increase in allegations of church political activity leading up to the 2004 presidential election between incumbent Bush and Kerry, IRS officials created the Political Activities Compliance Initiative to <a href=\"https://www.irs.gov/pub/irs-tege/paci_procedures_feb_22_2006.pdf\">fast-track investigations</a>.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.11\">Over the next four years, the committee investigated <a href=\"https://www.irs.gov/pub/irs-tege/2006paci_report_5-30-07.pdf\">scores of churches</a>, including <a href=\"https://www.irs.gov/pub/irs-tege/fy2011_eo_workplan.pdf\">80 for endorsing candidates</a> from the pulpit, according to IRS reports. But it did not revoke the tax-exempt status of any. Instead, the IRS mostly sent warning letters that agency officials said were effective in dissuading churches from continuing their political activity, asserting that there were no repeat offenders in that period.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.12\">In some cases, the IRS initiated audits of churches that could have led to financial penalties. It’s unclear how many did.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.13\">In January 2009, a <a href=\"https://law.justia.com/cases/federal/district-courts/minnesota/mndce/0:2008mc00037/101893/26/\">federal court dismissed an audit</a><a href=\"https://law.justia.com/cases/federal/district-courts/minnesota/mndce/0:2008mc00037/101893/26/\"> </a>into alleged financial improprieties at a Minnesota church whose pastor had supported the congressional campaign of former U.S. Rep. Michele Bachmann, a Republican from Minnesota.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.14\">The court found that the IRS had not been following its own rules for a decade because it was tasked with notifying churches of their legal rights before any pending audits and was required to have an appropriately high-level official sign off on them. But a 1998 agency reorganization had eliminated the position, leaving lower IRS employees to initiate church investigations.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.15\">Following the ruling, the IRS suspended its investigations into church political activity for five years, according to a <a href=\"https://www.gao.gov/assets/gao-15-514.pdf\">2015 Government Accountability Office report</a>.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.16\">During the hiatus, a conservative Christian initiative called Pulpit Freedom Sunday flourished. Pastors recorded themselves endorsing candidates or giving political sermons that they believed violated the Johnson Amendment and sent them to the IRS. The goal, according to participants, was to trigger <a href=\"https://abcnews.go.com/US/defiant-pastors-irs-pulpit-freedom-sunday/story?id=11726610\">a lawsuit that would lead to the prohibition being ruled unconstitutional</a> by the U.S. Supreme Court.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.17\">The IRS never challenged participating churches, and the effort wound down without achieving its aim.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.18\">In response to a Freedom of Information Act request from ProPublica and the Tribune last year, the IRS produced a severely redacted spreadsheet indicating the agency had launched inquiries into 16 churches since 2011. IRS officials shielded the results of the probes, and they have declined to answer specific questions.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.19\">Despite the agency’s limited enforcement, Trump promised shortly after he took office that he would “totally destroy the Johnson Amendment and allow our representatives of faith to speak freely and without fear of retribution.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.20\">As president, Trump tried unsuccessfully to remove the restrictions on church politicking through a 2017 <a href=\"https://www.politifact.com/factchecks/2017/jul/18/donald-trump/trump-claims-he-got-rid-johnson-amendment-true/\">executive order</a>. The move was largely symbolic because it simply ordered the government not to punish churches differently than it would any other nonprofit, according to a <a href=\"https://www.washingtonpost.com/news/morning-mix/wp/2017/08/25/critics-said-trumps-religious-liberty-order-does-nothing-the-administrations-lawyers-seem-to-agree/\">legal filing</a> by the Justice Department.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.21\">Eliminating the Johnson Amendment would require congressional or judicial action.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.22\">Although the IRS has not discussed its plans, it has taken procedural steps that would enable it to ramp up audits again if it chooses to.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.23\">In 2019, more than two decades after eliminating the high-level position needed to sign off on action against churches, the IRS designated the commissioner of the agency’s tax-exempt and government entities division as the “appropriate high-level Treasury official” with the power to initiate a church audit.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.24\">But Philip Hackney, a former IRS attorney and University of Pittsburgh tax law professor, said he doesn’t read too much into that. “I don’t see any reason to believe that the operation of the IRS has changed significantly.”</p>\n        \n    \n                        \n    \n        The Pulpit and Politics\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.0\">There is no uniform way to monitor church sermons across the country. But with the COVID-19 pandemic, many churches now post their services online, and ProPublica and the Tribune reviewed dozens of them. Many readers shared sermons with us. (You can do so <a href=\"https://propublica.forms.fm/tell-us-how-religious-organizations-in-your-area-involve-themselves-in-elections\">here</a>.)</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.1\">Texas’ large evangelical population and history of activism in Black churches makes the state a focal point for debates over political activity, said Matthew Wilson, a political science professor at Southern Methodist University in Dallas.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.2\">“Combine all of that with the increasing competitiveness of Texas elections, and it’s no surprise that more and more Texas churches are taking on a political role,” he said. “Texas is a perfect arena for widespread, religiously motivated political activism.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.3\">The state also has a long history of politically minded pastors, Wuthnow said. Texas evangelical church leaders joined the fight in support of alcohol prohibition a century ago and spearheaded efforts to defeat Democrat Al Smith, the first Catholic to be nominated for president by a major party, in 1928. In the 1940s, evangelical fundamentalism began to grow in the Dallas-Fort Worth area.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.4\">Today, North Texas remains home to influential pastors such as Robert Jeffress, who leads the First Baptist megachurch in Dallas. Jeffress was one of Trump’s most fervent supporters, appearing at campaign events, defending him on television news shows and stating that <a href=\"https://thehill.com/homenews/administration/534014-jeffress-says-he-absolutely-does-not-regret-supporting-trump-after/\">he “absolutely” did not regret supporting the former president</a> after the deadly Jan. 6, 2021, Capitol insurrection.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.5\">Burden went a step further, urging followers to stock up on food and keep their guns loaded ahead of President Joe Biden’s inauguration. He told parishioners that “prophetic voices” had told him in 2016 that Trump would have eight consecutive years in office.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.6\">The Frisco Conservative Coalition board <a href=\"https://www.dallasnews.com/news/politics/2021/01/29/frisco-pastors-conservative-pac-loses-board-members-in-the-fallout-from-his-comments-about-trump-guns/\">voted to suspend</a> Burden as chair for 30 days after criticism about his remarks.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.7\">Burden called his comments “inartful” but claimed he was unfairly targeted for his views. “The establishment media is coming after me,” he said<a href=\"https://www.youtube.com/watch?v=uKzTHYatYDI\"> </a><a href=\"https://www.youtube.com/watch?v=uKzTHYatYDI\">at the time</a>. “But it is not just about me. People of faith are under attack in this country.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.8\">Since then, Burden has repeatedly preached that the church has been designated by the Lord to decide who should serve in public office and “take dominion” over Frisco.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.9\">As the runoff for the Frisco City Council approached last year, Burden supported Jennifer White, a local veterinarian. White had positioned herself as the conservative candidate in the nonpartisan race against Angelia Pelham, a Black human resources executive who had the backing of the Frisco mayor.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.10\">White said she wasn’t in attendance during the May 2021 sermon in which Burden called her the “candidate that God wants to win.” She said she does not believe pastors should endorse candidates from the pulpit, but she welcomed churches becoming more politically active.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.11\">“I think that the churches over the years have been a big pretty big disappointment to the candidates in that they won't take a political stance,” White said in an interview. “So I would love it if churches would go ahead and come out and actually discuss things like morality. Not a specific party, but at least make sure people know where the candidates stand on those issues. And how to vote based on that.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.12\">Pelham’s husband, local pastor Dono Pelham, also made a statement that violated the Johnson Amendment by “indirectly intervening” in the campaign, said Ellen Aprill, an emerita tax law professor at Loyola Marymount Law School in Los Angeles</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.13\">In May 2021, Pelham told his church that the race for a seat on the City Council had resulted in a runoff. He acknowledged that his church’s tax-exempt status prevented him from supporting candidates from the pulpit. Then, he added, “but you’ll get the message.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.14\">“It’s been declared for the two candidates who received the most votes, one of which is my wife,” Pelham said. “That’s just facts. That’s just facts. That’s just facts. And so a runoff is coming and every vote counts. Be sure to vote.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.15\">Pelham then asked the congregation: “How did I do? I did all right, didn’t I? You know I wanted to go a little further, but I didn’t do it.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.16\">Angelia Pelham, who co-founded Life-Changing Faith Christian Fellowship in 2008 with her husband, said the couple tried to avoid violating the Johnson Amendment. Both disagreed that her husband’s mention of her candidacy was a violation. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.17\">“I think church and state should remain separate,” Angelia Pelham said in an interview, adding: “But I think there’s a lot of folks in the religious setting that just completely didn’t even consider the line. They erased it completely and lost sight of the Johnson Amendment.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.18\">She declined to discuss Burden’s endorsement of her opponent.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.19\">In his sermon the morning after Pelham defeated his chosen candidate, Burden told parishioners that the church’s political involvement would continue.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.20\">“So you’re like, but you lost last night? No, we set the stage for the future,” he said, adding “God is uncovering the demonic structure that is in this region.”</p>\n        \n    \n                        \n    \n        “Demonic” Candidate\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"9.0\">Most Americans don’t want pastors making endorsements from the pulpit, according <a href=\"https://publicconsultation.org/united-states/overwhelming-bi-partisan-majority-opposes-allowing-churches-other-nonprofits-to-engage-in-political-activity/\">to a 2017 survey</a> by the Program for Public Consultation, which is part of the School of Public Policy at the University of Maryland.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"9.1\">Of the nearly 2,500 registered voters who were surveyed, 79% opposed getting rid of the Johnson Amendment. Only among Republican evangelical voters did a slight majority — 52% — favor loosening restrictions on church political activity.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"9.2\">But such endorsements are taking place across the country, with some pastors calling for a debate about the Johnson Amendment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"9.3\">After the U.S. Supreme Court overturned Roe v. Wade in June, New Mexico became an island of abortion access for women in Texas and other neighboring states.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"9.4\">The issue raised the stakes in the upcoming Nov. 8 New Mexico governor’s race between incumbent Lujan Grisham, a supporter of abortion rights, and Republican challenger Mark Ronchetti, who advocates limiting access.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"9.5\">“We’re going to fast become the No. 1 abortion place in all of America,” a pastor, Steve Smothermon, said during a July 10 sermon at Legacy Church in Albuquerque, which has an average weekly attendance of more than 10,000 people. Smotherman said the governor was “wicked and evil” and called her “a narcissist.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"9.6\">“And people think, ‘Why do you say that?’ Because I truly believe it. In fact, she’s beyond evil. It’s demonic,” Smothermon said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"9.7\">He later added: “Folks, when are we going to get appalled? When are we going to say, ‘Enough is enough’? When are we going to stop saying, ‘Well, you know, it’s a woman’s right to choose’? That’s such a lie.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"9.8\">Church attendees had a stark choice in the upcoming election, Smothermon said. “We have the Wicked Witch of the North. Or you have Mark Ronchetti.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"9.9\">The governor’s campaign declined to comment. Neither Legacy Church, Smothermon nor Ronchetti responded to requests for comment.</p>\n        \n    \n                    \n\n    \n        \n\n    \n                                \n            \n        \n\n    \n\n    \n            (Video Editing by Todd Wiseman/Texas Tribune and Justin Dehn/Texas Tribune. Source videos: Adria Malcolm for ProPublica/Texas Tribune, Legacy Church.)\n    \n    \n    \n\n\n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.0\">The sermon was a “clear violation” of the Johnson Amendment, said Sam Brunson, a Loyola University Chicago law professor. But Smothermon showed no fear of IRS enforcement.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.1\">Those who thought he crossed the line were “so stupid,” Smothermon said during the sermon. “You have no idea what you’re talking about.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.2\">In another example, pastors at a Fort Worth church named Mercy Culture have repeatedly endorsed candidates for local and statewide offices since its founding in 2019.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.3\">“Now, obviously, churches don’t endorse candidates, but my name is Landon and I’m a person before I’m a pastor. And as an individual, I endorse Nate Schatzline,” the lead pastor, Landon Schott, said in a February sermon about a church member who was running to fill an open state representative seat.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.4\">Johnson Amendment rules allow pastors to endorse in their individual capacity, as long as they are not at an official church function, which Schott was.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.5\">In other services, Schott challenged critics to complain to the IRS about the church’s support of political candidates and said he wasn’t worried about losing the church’s tax-exempt status.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.6\">“If you want it that bad, come and take it. And if you think that we will stop preaching the gospel, speaking truth over taxes, you got another thing coming for you,” Schott said in May.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.7\">Schatzline, a member of Mercy Culture, received 65% of the vote in a May 24 runoff against the former mayor of the Dallas suburb of Southlake. He works for a separate nonprofit founded by Heather Schott, a pastor at Mercy Culture and the wife of Landon Schott.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.8\">Schatzline said in an interview with ProPublica and the Tribune that Landon Schott, not the church, endorsed him. He added that the church sought legal advice on how to ensure that it was complying with the Johnson Amendment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.9\">“I think prayers can manifest into anything that God wants them to, but I would say that the community rallying behind me as individuals definitely manifested into votes,” Schatzline said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.10\">Mercy Culture also supported Tim O’Hare, a Republican running for Tarrant County judge, this year after he came out against the shutdowns during the COVID-19 pandemic. His opponent in the primary had ordered churches and businesses to temporarily close when she was mayor of Fort Worth.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.11\">O’Hare came to prominence as the mayor of suburban Farmers Branch, where he championed a city ordinance to prohibit landlords from renting to immigrants without legal status. A federal <a href=\"https://www.dallasnews.com/news/2010/03/25/judge-rules-farmers-branch-rental-ban-is-unconstitutional/\">court declared the ordinance unconstitutional</a> in 2010 after a legal battle that cost the city $6.6 million.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.12\">O’Hare has pledged to hire an election integrity officer to oversee voting and “uncover election fraud.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.13\">“The Lord spoke to me and said, ‘Begin to pray for righteous judges in our city,’” Heather Schott said during a Feb. 13 service. “I am believing that Mr. Tim O’Hare is an answered prayer of what we have been petitioning heaven for for the last year and a half.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.14\">Neither Mercy Culture, Landon Schott nor Heather Schott responded to requests for comment. O’Hare also did not respond to a phone call and email seeking comment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.15\">Schott’s comments were a prohibited endorsement, said Aprill, the emerita tax law professor at Loyola Marymount Law School in Los Angeles.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.16\">“It doesn’t say ‘vote for him’ but is still an endorsement,” she said. “There’s no other way to understand the statement that O’Hare has answered prayers for righteous judges.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.17\">Two weeks later, O’Hare won his primary. He faces Deborah Peoples, a Democrat, on Nov. 8.</p>\n        \n    \n                        \n    \n        A New Tactic\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"13.0\">On April 18, 2021, a day before early voting began for city council and school board elections across Texas, pastors at churches just miles apart flashed the names of candidates on overhead screens. They told their congregations that local church leaders had gathered to discuss upcoming city and school elections and realized that their members were among those seeking office.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"13.1\">“We’re not endorsing a candidate. We’re not doing that. But we just thought because they’re a member of the family of God, that you might want to know if someone in the family and this family of churches is running,” said Robert Morris, who leads the Gateway megachurch in Southlake and served as a <a href=\"https://www.politico.com/story/2016/06/trump-evangelical-advisory-board-224612#ixzz4CEyuuiJD\">member of Trump’s evangelical advisory board</a>.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"13.2\">On the same day, Doug Page gave a similar message less than 5 miles away at First Baptist Grapevine.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"13.3\">“And so what we decided to do is look within our church families and say, ‘Who do we know that’s running for office?’ Now, let me clarify with you. This is not an endorsement by us. We are not endorsing anyone. However, if you’re part of a family, you’d like to know if Uncle Bill is running for office, right? And so that’s all we’re going to do is simply inform you.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"13.4\">Saying that you are not endorsing a candidate “isn’t like a magic silver bullet that makes it so that you’re not endorsing them,” Brunson said.</p>\n        \n    \n                    \n\n    \n        \n\n    \n                                \n            \n        \n\n    \n\n    \n            (Video editing by Todd Wiseman/Texas Tribune and Justin Dehn/Texas Tribune. Source videos: Shelby Tauber for ProPublica/Texas Tribune, Gateway Church, First Baptist Grapevine.)\n    \n    \n    \n\n\n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"15.0\">The churches’ coordination on messaging across the area is notable, according to University of Notre Dame tax law professor Lloyd Hitoshi Mayer, who said he hadn’t before seen churches organizing to share lists of candidates.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"15.1\">“I do think this strategy is new,” said Mayer, who has studied the Johnson Amendment for more than a decade. “I hadn’t heard of that before. It’s quite a sophisticated tactic.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"15.2\">Eight of the nine candidates mentioned by the pastors won their races.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"15.3\">Mindy McClure, who ran for reelection to the Grapevine-Colleyville school board, said she thought church involvement contributed to her defeat in a June 5, 2021, runoff by about 4 percentage points. Her opponent <a href=\"https://www.facebook.com/ShannonBraunForGCISD/photos/a.142482884556370/153044090166916/\">campaigned on removing critical race theory</a> from district curriculum, while McClure said students “weren’t being indoctrinated in any way, shape or form.” Critical race theory is a college-level academic theory that racism is embedded in legal systems.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"15.4\">McClure said pastors endorsing from the pulpit creates “divisiveness” in the community.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"15.5\">“Just because you attend a different church doesn’t mean that you’re more connected with God,” she said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"15.6\">Lawrence Swicegood, executive director of Gateway Media, said this month that the church doesn’t endorse candidates but “inform(s) our church family of other church family members who are seeking office to serve our community.” Page told ProPublica and the Tribune that “these candidates were named for information only.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"15.7\">Eleven days after responding to ProPublica and the Tribune in October, Morris once again told his church that he was not endorsing any candidates during the last Sunday sermon before early voting. Then, he again displayed the names of specific candidates on a screen and told parishioners to take screenshots with their cellphones.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"15.8\">“We must vote,” he said. “I think we have figured that out in America, that the Christians sat on the sidelines for too long. And then all of a sudden they started teaching our children some pretty mixed up things in the schools. And we had no one to blame but ourselves. So let’s not let that happen. Especially at midterms.”</p>\n        \n    \n                    \n    \n            Help Us Report: How Do Religious Institutions in Your Area Involve Themselves in Elections?\n                <p>ProPublica and The Texas Tribune want to understand how the Johnson Amendment is enforced — or isn’t. Please send us examples of any political activity you see at churches or other religious institutions, and we’ll look into whether or not it breaks the rules. We want to hear about examples across the political spectrum.</p>\n\n    \n\n        \n                    \n\nwindow.jQuery || document.write('')\n\n\n\n\n\n\nThis form requires JavaScript to complete.\nPowered by <a href='https://thecitybase.com/'>CityBase Screendoor</a>.\n\n\n  // Uncomment this line and set it to the CSS class that your website uses for buttons:\n  // FormRenderer.BUTTON_CLASS = '';\n\n  \n\n  new FormRenderer({\"project_id\":\"rQgK0UYeIC54u1gm\"});\n\n            \n    \n\n            \n                       \n                \n            Correction\n            <p><strong>Oct. 31, 2022:</strong> This story originally misstated the name of the university where Andrew Whitehead, a sociologist, works. It is Indiana University-Purdue University Indianapolis, not University of Indiana-Purdue.</p>\n\n        \n\n                               ",
  "dc:subject": "Politics",
  "dc:date": "2022-10-30T06:00:00-04:00",
  "dc:creator": "by Jeremy Schwartz and Jessica Priest"
}