{
  "title": "How Google’s Ad Business Funds Disinformation Around the World",
  "link": "https://www.propublica.org/article/google-alphabet-ads-fund-disinformation-covid-elections",
  "pubDate": "Sat, 29 Oct 2022 05:00:00 -0400",
  "guid": "https://www.propublica.org/article/google-alphabet-ads-fund-disinformation-covid-elections",
  "description": "\n                <p class=\"byline\">\n                by <a class=\"name\" href=\"https://www.propublica.org/people/craig-silverman\">Craig Silverman</a>, <a class=\"name\" href=\"https://www.propublica.org/people/ruth-talbot\">Ruth Talbot</a>, <a class=\"name\" href=\"https://www.propublica.org/people/jeff-kao\">Jeff Kao</a> and <a class=\"name\" href=\"https://www.propublica.org/people/anna-kluhspies\">Anna Klühspies</a>                </p>\n                                          \n  \n\n\n\n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.0\">Google is funneling revenue to some of the web’s most prolific purveyors of false information in Europe, Latin America and Africa, a ProPublica investigation has found.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.1\">The company has publicly committed to fighting disinformation around the world, but a ProPublica analysis, the first ever conducted at this scale, documented how Google’s sprawling automated digital ad operation placed ads from major brands on global websites that spread false claims on such topics as vaccines, COVID-19, climate change and elections.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.2\">In one instance, Google continued to place ads on a publication in Bosnia and Herzegovina for months after the U.S. government officially imposed sanctions on the site. Google stopped doing business with the site, which the <a href=\"https://home.treasury.gov/news/press-releases/jy0549\">U.S. Treasury Department</a> described as the “personal media station” of a prominent Bosnian Serb separatist politician, only after being contacted by ProPublica.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.3\">Google ads are a major source of revenue for sites that spread election disinformation in Brazil, notably false claims about the integrity of the voting system that have been advanced by the incumbent president, Jair Bolsonaro. Voters in Brazil are going to the polls on Sunday with the outcome in doubt after Bolsonaro’s unexpectedly strong showing in the first round of voting.</p>\n        \n    \n                            \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.0\">The investigation also revealed that Google routinely places ads on sites pushing falsehoods about COVID-19 and climate change in French-, German- and Spanish-speaking countries. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.1\">The resulting ad revenue is potentially worth millions of dollars to the people and groups running these and other unreliable sites — while also making money for Google. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.2\">Platforms such as Facebook have faced stark criticism for failures to crack down on disinformation spread by people and governments on their platforms around the world. But Google hasn’t faced the same scrutiny for how its roughly $200 billion in annual ad sales provides essential funding for non-English-language websites that misinform and harm the public.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.3\">Google’s publicly announced policies bar the placement of ads on content that makes <a href=\"https://support.google.com/publisherpolicies/answer/11188580#zippy=%2Ctips-for-understanding-this-policy\">unreliable or harmful claims</a> on a range of issues, including health, climate, elections and democracy. Yet the investigation found Google regularly places ads, including those from major brands, on articles that appear to violate its own policy.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.4\">ProPublica’s examination showed that ads from Google are more likely to appear on misleading articles and websites that are in languages other than English, and that Google profits from advertising that appears next to false stories on subjects not explicitly addressed in its policy, including crime, politics, and such conspiracy theories as chemtrails.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.5\">A former Google leader who worked on trust and safety issues acknowledged that the company focuses heavily on English-language enforcement and is weaker across other languages and smaller markets. They told ProPublica it’s because Google invests in oversight based on three key concerns.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.6\">“The number one is bad PR — they are very sensitive to that. The second one is trying to avoid regulatory scrutiny or potentially regulatory action that could impact their business. And number three is revenue,” said the former leader, who agreed to speak on the condition that their name not be used in order not to hurt their business and career prospects. “For all these three, English-speaking markets primarily have the biggest impact. And that’s why most of the efforts are going into those.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.7\">ProPublica used data provided by fact-checking newsrooms, researchers and website monitoring organizations to scan more than 13,000 active article pages from thousands of websites in more than half a dozen languages to determine whether they were currently earning ad revenue with Google. (To read a detailed breakdown of how ProPublica obtained and analyzed the data, <a href=\"https://www.propublica.org/article/google-ads-misinformation-methodology\">see this accompanying article</a>.)</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.0\">The analysis found that Google placed ads on 41% of roughly 800 active online articles rated by members of the Poynter Institute’s International Fact-Checking Network as publishing false claims about COVID-19. The company also served ads on 20% of articles about climate change that Science Feedback, an IFCN-accredited fact-checking organization, has rated false.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.1\">A number of Google ads viewed by ProPublica appeared on articles published months or years ago, suggesting that the company’s failure to block ads on content that appears to violate its rules is a long-standing and ongoing problem. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.2\">In one example, Google recently placed ads for clothing brand St. John on a two-year-old <a href=\"https://web.archive.org/web/20220809113216/https://www.blic.rs/vesti/drustvo/doktorka-gligic-prva-je-u-srbiji-potegla-temu-da-niko-ko-ima-macke-nije-oboleo-od/h1y523b\">Serbian article falsely claiming</a> that cat owners don’t catch COVID-19. Google placed an ad for the American Red Cross on a May 2021 <a href=\"https://web.archive.org/web/20220429133139/https://journalistenwatch.com/2021/05/16/hinweise-corona-grippe/\">article from a far-right German site</a> that claimed COVID-19 is comparable in danger to the flu. An ad for luxury retailer Coach was recently attached to an April <a href=\"https://web.archive.org/web/2/https://srbin.info/svet/poznati-epidemiologvakcine-protiv-kovid-a-menjaju-dnk-koji-se-prenosi-na-potomstvo/?lang=lat\">article in Serbian that repeated the false claim</a> that the COVID-19 vaccines change people’s DNA.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.3\">Last August, the Greek edition of the Epoch Times, a far-right U.S. publication connected to the Falun Gong spiritual movement, published <a href=\"https://web.archive.org/web/20220826065651/https://theepochtimes.gr/o-oie-ypo-amfisvitisi-meleti-deichnei-ot/\">an article that falsely claimed</a> the sun, and not increased levels of carbon dioxide, could be responsible for global warming. That story had multiple Google ads when ProPublica viewed it, even though it appears to clearly violate Google’s policy against climate disinformation.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.4\">A spokesperson for the Red Cross said its ad appeared on the far-right German site due to an automated placement it did not directly control.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.5\">“Please note that based upon our Fundamental Principles of impartiality and neutrality, the Red Cross does not take sides in issues of a political, racial, religious or ideological nature, so we would purposefully not advertise on a story or site such as the one you shared with us,” said a statement from the organization.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.6\">Coach and St. John did not respond to requests for comment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.7\">Google’s policy is to remove ads from individual articles that violate its rules, and to take sitewide action if violations reach a specific undisclosed threshold. Google removed ads from at least 14 websites identified in the investigation after being contacted by ProPublica. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.8\">Google spokesperson Michael Aciman said the company has put more money into non-English-language enforcement and oversight, which has led to an increase in the number of ads blocked on pages that violate its rules. He declined to provide figures or to say how many people Google has working on non-English-language content and ad review. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.9\">“We’ve developed extensive measures to tackle misinformation on our platform, including policies that cover elections, COVID-19 and climate change, and work to enforce our policies in over 50 languages,” Aciman said. “In 2021, we removed ads from more than 1.7 billion publisher pages and 63,000 sites globally. We know that our work is not done, and we will continue to invest in our enforcement systems to better detect unreliable claims and protect users around the world.” </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.10\">Google continues to review the sites and pages ProPublica shared with it and is \"taking appropriate action on any content that violates our policies,\" Aciman said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.11\">The data about ad removals comes from <a href=\"https://blog.google/products/ads-commerce/ads-safety-report-2021/\">Google's most recent Ads Safety report</a>, which emphasized the removal of ads from more than half a million pages that violated policies against harmful claims about COVID-19 and false claims that could undermine elections. But Google does not release a list of pages or publishers it took action against, the countries and languages they operate in or other data related to its Ads Safety report.</p>\n        \n    \n                            \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.0\">Google has been vocal about its <a href=\"https://blog.google/outreach-initiatives/google-news-initiative/announcing-google-news-initiative/\">$300 million commitment</a>, announced in 2018, to fight misinformation, support fact-checkers and “help journalism thrive in the digital age.” But the investigation shows that as one arm of Google helps support fact-checkers, its core ad business provides critical revenue that ensures the publication of falsehoods remains profitable.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.1\">Laura Zommer, the general director of the Argentina-based <a href=\"http://www.chequeado.com/\">Chequeado</a>, founded in 2010 as the first fact-checking organization in Latin America, said Google’s failure to invest in oversight of sites in languages other than English causes serious harm in emerging democracies.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.2\">“The problem is that disinformation that takes hold in less developed democracies can cause even more damage than the disinformation circulating in countries with more developed democracies,” said Zommer, who is also the co-founder of <a href=\"http://www.factchequeado.com/\">Factchequeado</a>, an initiative to counter Spanish-language disinformation in the U.S.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.3\">In Serbia, Croatia and Bosnia, three Balkan countries where democracy is fragile, 26 of the 30 most prolific publishers of false and misleading claims in the region earn money from Google, according to data from local fact-checkers.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.4\">“If the world’s largest online advertising platform doesn’t care that it has made false information, hate speech and toxic propaganda profitable in societies like ours, and has no intention to do anything to change because it wouldn’t financially pay off, that is devastating,” said Tijana Cvjetićanin, a member of the editorial board of Bosnian fact-checking site Raskrinkavanje, which shared data with ProPublica.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.5\">A comparison with English-language outlets suggests Google is more rigorous in choosing its publisher partners in that language. ProPublica found Google placed ads on 13% of English-language websites that NewsGuard deemed unreliable for having repeatedly published false content or deceptive headlines and failing to meet transparency standards. In contrast, ProPublica’s analysis found anywhere from 30% to 90% of the sites most often flagged for false claims by fact-checkers in the non-English languages examined were monetizing with Google.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.6\">Along with unequal enforcement across languages, ProPublica found disparity across and within regions.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.7\">Africa Check shared a list of 68 active English-language URLs that had been fact- checked as false by teams in South Africa, Nigeria and Kenya since 2019, as well as 45 French-language articles that had been debunked by its French-language checkers. ProPublica’s analysis found that 57% of debunked English-language articles in Africa had ads from Google, while the percentage was higher, 66%, for French-language articles.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.8\">Alexandre Alaphilippe, executive director of the EU Disinfo Lab, a non-profit organization that researches disinformation, said Google should be required to equally enforce its policies across languages and regions and to be transparent about its oversight decisions.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.9\">“These companies have decided to go global in their services, and that was their own decision for growth and to make revenue,” he said. “It’s not possible to make this choice and not face the accountability needed to be in all of these countries at the same time.”</p>\n\nGoogle’s Global Ad Dominance\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.10\">Google is the world’s biggest digital advertising business. Last year it generated a record $257 billion in revenue. Most of that money comes from <a href=\"https://www.cnbc.com/2021/05/18/how-does-google-make-money-advertising-business-breakdown-.html\">companies paying to place ads on</a><a href=\"https://www.cnbc.com/2021/05/18/how-does-google-make-money-advertising-business-breakdown-.html\"> Google products</a> such as search and YouTube. But <a href=\"https://www.businessinsider.com/google-served-ads-sanctioned-websites-adalytics-report-russia-2022-4\">in 2021 Google earned </a><a href=\"https://www.businessinsider.com/google-served-ads-sanctioned-websites-adalytics-report-russia-2022-4\">$31 billion</a> by placing its customers’ ads on more than 2 million websites around the world. They’re part of what the company calls the Google Display Network.</p>\n        \n    \n                            \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.0\">These publishing partners range from major news outlets such as The New York Times to small sites run by individuals. In order to join the Google Display Network, a publisher must meet requirements that include publishing original content and adhering to policies against <a href=\"https://support.google.com/publisherpolicies/answer/11188580#zippy=%2Ctips-for-understanding-this-policy\">unreliable and harmful claims</a> and <a href=\"https://support.google.com/publisherpolicies/answer/10438119?hl=en&ref_topic=10436798\">sexually explicit content</a>, among <a href=\"https://support.google.com/publisherpolicies/topic/10502221?hl=en&ref_topic=7572538\">others</a>. Once accepted, Google <a href=\"https://support.google.com/adsense/answer/180195?hl=en\">says</a>, publishers in the network receive 68% of the money spent on each ad placed on their site.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.1\">Google’s ad systems are also used to place ads on websites that are not necessarily members of its Display Network. These publishers work with ad technology companies that have partnered with Google, and which use its technology to buy and sell ads. As with ads placed on sites in the Display Network, Google and the publisher both earn money.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.2\">Google places ads on publisher sites using an automated auction system called programmatic advertising. The process starts when a person visits a webpage or opens an app. As the page loads, the site or app owner collects information about the ad space available along with data about the user, which can include location, age range, browsing history and interests.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.3\">The data is sent to an ad exchange like the one operated by Google, where ad buyers — ranging from major brands like Spotify to smaller local businesses — can place a bid to show an ad to the specific user visiting the website or app. Bids are placed, or not, based on the user and publisher data shared with potential advertisers and the price an advertiser is willing to pay to reach that person.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.4\">In the blink of an eye, the top bidder wins the auction and the ad loads on the page. Money flows from the ad buyer to the ad exchange (and any other intermediaries involved in the transaction), eventually making its way to the website or app publisher.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.5\">In 2019, the Global Disinformation Index, a nonprofit that analyzes websites for false and misleading content, estimated that disinformation websites earned $250 million per year in revenue, of which Google was responsible for 40% and the rest came from other ad tech companies. NewsGuard, which employs human reviewers to evaluate and rate websites based on a <a href=\"https://www.newsguardtech.com/ratings/rating-process-criteria/\">set of criteria</a> including accuracy, estimated in 2021 the annual <a href=\"https://www.newsguardtech.com/special-reports/brands-send-billions-to-misinformation-websites-newsguard-comscore-report/\">ad revenue earned by sites spreading false or misleading claims</a> is $2.6 billion. The report did not say how much of that Google might be responsible for.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.6\">How much of Google’s revenue comes from monetizing false and misleading content is difficult to estimate. Each of the billions of digital display ads placed every day by Google has a different price point that fluctuates based on the combination of advertiser, target website and the users the ad will be shown to. It’s all part of a complex, opaque and largely automated digital ad buying and selling process dominated by Google. This means advertisers have to rely in part on the mix of automation and human review Google uses to ensure its publisher partners don’t violate its rules.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.7\">The findings of fact-checkers could be used by Google to enforce its policy against placing ads next to content that makes unreliable and harmful claims. There are <a href=\"https://reporterslab.org/fact-checkers-extend-their-global-reach-with-391-outlets-but-growth-has-slowed/\">more than 350 fact-checking projects around the world</a> that employ journalists, and in some cases scientists, to identify and investigate claims spreading on the web, on social media and in traditional media. Their articles and associated ratings are used by platforms including Meta to help enforce policies around false and harmful content. Google already highlights fact-checks in search and Google News results to direct people to trustworthy information. But the company does not use fact-checks to keep ads off of pages with unreliable or harmful claims. And unlike Meta and TikTok, it does not pay fact-checkers for the results of their research.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.8\">“When it comes to ads, they obviously monetize disinformation. Whether it’s without knowing or knowing, it doesn’t matter,” said Baybars Örsek, director of the International Fact-Checking Network. “There has never been a public announcement from Google’s side that has acknowledged fact-checking as a signal for their ads monetization business.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.9\">Google’s Aciman declined to comment on Google’s relationship with fact-checkers.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n    \n\n        \n    \n                    \nFailed Enforcement in Bosnia, Croatia, Serbia\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.0\">On Sept. 20, as he prepared to mobilize part of the country’s population to fight in Ukraine, Russian President Vladimir Putin met with Milorad Dodik, a member of Bosnia’s three-person presidency and Bosnian Serb separatist leader who has expressed strong support for the invasion.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.1\">The Putin meeting was a propaganda coup for Dodik. Even better for him, Google helped ensure it was lucrative.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.2\">After the meeting, the homepage of the Serbian media site ATV featured <a href=\"https://www.atvbl.rs/vijesti/bih/razgovor-putina-i-dodika-video-20-9-2022\">articles praising the meeting</a> and <a href=\"https://www.atvbl.rs/republika-srpska/dodik-za-atv-nakon-sastanka-sa-putinom-vazno-je-da-rusija-nastavlja-da-uvazava-misljenje-srpske-20-9-2022\">quoting Dodik about plans</a> for greater economic cooperation with Russia, while sowing doubt about genocide committed during the Bosnian war, a <a href=\"https://www.npr.org/2022/01/08/1071537135/how-bosnias-dodik-went-from-a-moderate-reformist-to-genocide-denying-secessionis\">frequent Dodik talking point</a>. A ProPublica reporter viewing those stories was served ads for Saks Fifth Avenue department store, New Balance shoes and eBay that were placed via Google’s ad systems. ProPublica also documented ads from brands such as Guess on false ATV articles claiming that <a href=\"https://web.archive.org/web/20220905154537/https://www.atvbl.rs/vijesti/srbija/srbija-proizvela-lijek-za-virus-korona-od-utorka-u-upotrebi-18-4-2020\">Serbia had found a cure for COVID-19</a> and <a href=\"https://web.archive.org/web/20220325160913/https://www.atvbl.rs/vijesti/svijet/bivsi-premijer-ukrajine-sokirao-rusija-akcijom-sprijecila-treci-svjetski-rat-4-3-2022\">NATO was planning to deploy troops to Ukraine</a>.</p>\n        \n    \n                            \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"13.0\">A Saks spokesperson said its ads were not supposed to have appeared on ATV, and that the company would block the site from future campaigns.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"13.1\">“It was not our intention to advertise on this site as it violates the brand safety guidelines we have in place with our ad partner,” said a statement from the company.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"13.2\">An eBay spokesperson also said its ad was not placed “intentionally” on ATV. Guess and New Balance did not respond to requests for comment.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n            Ads for Guess appeared recently on an ATV article from 2020 that falsely claimed Serbia had a cure for COVID-19.\n    \n            (ProPublica screenshot)\n    \n    \n    \n\n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"15.0\">Google is helping the site earn money by placing ads on false and divisive content in spite of the ATV website and its related TV station being sanctioned in January by the U.S. Treasury Department due to Dodik’s “corrupt activities and continued threats to the stability and territorial integrity” of Bosnia and Herzegovina. Dodik “exerts personal control over ATV,” approves content and corruptly funnels government contracts to the outlet, according to the <a href=\"https://home.treasury.gov/news/press-releases/jy0549\">Treasury Department’s sanctions announcement</a>.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"15.1\">Google removed ads from the ATV website after being contacted by ProPublica, but declined to comment on its relationship with the site. “Google is committed to complying with all applicable sanctions,” Aciman said. ATV and representatives from Dodik’s office did not respond to requests for comment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"15.2\">ATV is one of the 30 most frequent sources of false and misleading content published in the Bosnian-Croatian-Serbian language, according to data provided to ProPublica by Raskrinkavanje. Of the 30 sites most flagged by Raskrinkavanje for false claims, 26 made money with Google. The list included popular sites in the region, such as the websites of tabloid newspapers, as well as smaller operations that in some cases don’t disclose their owners or are run by fringe figures.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"15.3\">ProPublica also scanned close to 10,000 active articles that fact checkers in the three Balkan countries flagged for false claims since 2019. Just over 60% were earning money with Google. The articles included a range of falsehoods about national politics, the pandemic, vaccines, the war in Ukraine and other topics.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"15.4\">“It might just be a financial matter for Google, but for us it’s a corrosive influence on our already very fragile democracies,” Cvjetićanin said.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n            Ads for Amazon Prime Video, Spotify, BetMGM and a women’s clothing site were placed via Google’s systems on a Srbin.info article falsely claiming COVID-19 vaccines can change people’s DNA.\n    \n            (ProPublica screenshot)\n    \n    \n    \n\n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"17.0\">Dejan Petar Zlatanovic operates Srbin.info, a Serbian website that publishes <a href=\"https://web.archive.org/web/20220924091111/https://srbin.info/svet/rusija-konfrontacija-sa-sad-i-nato-nije-u-interesima-moskve/\">pro-Kremlin propaganda copied from Russian state media</a>, <a href=\"https://srbin.info/en/pocetna/aktuelno/srdjan-nogo-srpski-softver-i-izborna-prevara-u-americi/?lang=lat\">election conspiracies about the U.S</a>. and <a href=\"https://web.archive.org/web/2/https://srbin.info/en/pocetna/aktuelno/dr-jovana-stojkovic-za-srbin-info-umesto-vidovdana-pedofil-prostitutka-i-gej/\">anti-LGBTQ content</a>. Its homepage features a prominent hyperlink directly to the official Kremlin website. Google ads abound there and on article pages.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"17.1\">Zlatanovic said in an email that Srbin.info earns between $5,000 and $7,000 per month, with Google ads providing a key portion of the revenue.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"17.2\">\"The editorial policy of Srbin.info from the beginning was to offer relevant alternative news, not to brainwash people or to determine how they should live,” Zlatanovic wrote in Serbian. “All our lives we have lived in a communist and post-communist society based on single-mindedness and we got sick of single-mindedness.”</p>\n        \n    \n                            \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"19.0\">In April, Srbin.info published an article <a href=\"https://web.archive.org/web/20220803201657/https://srbin.info/svet/poznati-epidemiologvakcine-protiv-kovid-a-menjaju-dnk-koji-se-prenosi-na-potomstvo/?lang=lat\">claiming that </a><a href=\"https://web.archive.org/web/20220803201657/https://srbin.info/svet/poznati-epidemiologvakcine-protiv-kovid-a-menjaju-dnk-koji-se-prenosi-na-potomstvo/?lang=lat\">mRNA</a><a href=\"https://web.archive.org/web/20220803201657/https://srbin.info/svet/poznati-epidemiologvakcine-protiv-kovid-a-menjaju-dnk-koji-se-prenosi-na-potomstvo/?lang=lat\"> COVID-19 vaccines could change the genetic makeup of people</a> and alter “human genetics forever.” The story cited debunked claims by an American doctor who falsely claimed children’s DNA could be altered by the vaccines. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"19.1\">Ads from Amazon Prime, BetMGM, Spotify, and StyleWe were shown to a ProPublica reporter who viewed the story. The companies did not respond to requests for comment. Google declined to comment on the Balkan sites and articles identified by ProPublica in the analysis.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"19.2\">Zlatanovic told ProPublica in an email that the vaccines article contained information he felt was “relevant for the public” because it came from a medical professional.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"19.3\">Google also placed ads on an article <a href=\"https://raskrinkavanje.ba/analiza/vakcina-protiv-covid-19-ne-mijenja-gensku-strukturu-covjeka\">making a similar false claim when it spread across a set of sites</a> in the region in late 2020, according to local fact-checkers. The false claim that mRNA vaccines can change “the genetic structure of a person” was reported by B92, which is among the 30 sites in the region most often flagged by fact-checkers. It eventually <a href=\"https://web.archive.org/web/20221005170604/https://www.b92.net/zdravlje/vesti.php?yyyy=2020&mm=12&dd=22&nav_id=1784484\">corrected its story</a>, but has a history of publishing false claims and potentially harmful health content.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"19.4\">B92 has published articles <a href=\"https://raskrinkavanje.ba/medij/b-92\">claiming</a> that <a href=\"https://web.archive.org/web/20160221174522/http://superzena.b92.net/zdravlje-zene.php?yyyy=2016&mm=02&nav_id=1097186\">baking soda can save your life</a>; that <a href=\"https://raskrinkavanje.ba/clanak/lubenica-leci-kancer-ali-moze-biti-i-otrovna-ako-primetite-ovo-lekari-savetuju-odmah-u-kantu\">watermelon can cure cancer</a> but could be poisonous if the fruit is cracked (it later <a href=\"https://web.archive.org/web/20220824042232/https://www.b92.net/zdravlje/ishrana.php?yyyy=2022&mm=08&dd=11&nav_id=2196557\">corrected this story</a>); and that there’s <a href=\"https://raskrinkavanje.ba/analiza/sok-od-kojeg-celije-raka-ne-umiru-za-42-dana\">a juice that can kill cancer cells in 42 days</a>, to name some of the stories local fact-checkers have had to debunk. All had ads from Google when viewed by ProPublica, except for the cancer cure story, which was deleted by the site at some point after publication.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"19.5\">B92 did not respond to a request for comment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"19.6\">The rampant anti-vaccine and COVID-19 disinformation appears to have contributed to <a href=\"https://www.nytimes.com/interactive/2021/world/covid-vaccinations-tracker.html\">low vaccination rates in the region</a>. Just 25% of people are fully vaccinated in Bosnia, while 47% are vaccinated in Serbia and 55% in Croatia, among the lowest rates in Europe. A <a href=\"https://zastone.ba/app/uploads/2022/04/Countering-disinformation-narratives-and-mapping-conspiracy-theories-_-The-case-of-BiH-7.pdf\">survey of unvaccinated Bosnians published in April</a> by Raskrinkavanje’s parent company suggests <a href=\"https://zastone.ba/app/uploads/2022/04/Countering-disinformation-narratives-and-mapping-conspiracy-theories-_-The-case-of-BiH-7.pdf\">conspiracy theories have taken hold among the population</a>. Almost half of respondents agreed with the false claim that vaccines contain “dangerous nanoparticles,” and 38% believe the mRNA vaccines “alter DNA.”</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n    \n\n        \n    \n                    \nBrazil’s Disinfo Boom\n<p data-pp-blocktype=\"copy\" data-pp-id=\"22.0\">For at least four years, Brazilian president <a href=\"https://www.poynter.org/fact-checking/2018/in-brazils-presidential-election-hoaxes-about-voter-fraud-run-rampant/\">Bolsonaro has sowed doubt and spread disinformation</a> about the country’s electoral process and the reliability of the country’s electronic voting system, leading to a 2021 Supreme Court investigation that <a href=\"https://www.reuters.com/world/americas/bolsonaro-directly-spread-disinformation-brazils-voting-system-police-report-2021-12-17/\">documented his false claims</a>.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"22.1\">Aiding his efforts are pro-Bolsonaro websites with big audiences — and a slew of ads courtesy of Google.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"22.2\">One of the largest is Terra Brasil Notícias, a two-year-old site run by a couple based in one of Brazil’s northeastern provinces. This summer, it published a <a href=\"https://web.archive.org/web/20220919193115/https:/terrabrasilnoticias.com/2022/08/video-mostra-imprensa-dos-eua-detonando-urnas-eletronicas-sem-voto-impresso-assista/\">story</a> containing a clip from “Last Week Tonight” where host John Oliver explained the risks of electronic voting machines. The site used this to undermine confidence in Brazil's electronic voting system. Brazil’s electronic voting machines do not use paper audits, but have <a href=\"https://abcnews.go.com/International/wireStory/hired-hackers-fail-invade-brazil-vote-system-84713199\">repeatedly been proven secure</a>, and there is no credible evidence of widespread voter fraud in the country.</p>\n        \n    \n                            \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.0\">On Oct. 2, the day Brazilians voted in the first round of the presidential elections, Terra Brasil Notícias was one of several pro-Bolsonaro websites <a href=\"https://www1.folha.uol.com.br/poder/2022/10/moraes-ordena-remocao-de-conteudo-sabidamente-inveridico-que-indica-voto-de-pcc-a-lula.shtml\">threatened with a fine</a> by the head of the country’s <a href=\"https://international.tse.jus.br/en?set_language=en\">Superior Electoral Court</a> for publishing a falsehood about Bolsonaro’s opponent, Luiz Inácio Lula da Silva. Terra Brasil Notícias and other sites spread the false claim that the leader of a criminal organization had said he’d vote for Lula.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.1\">Marie Santini, director of the Netlab at the Federal University of Rio de Janeiro, said the number of junk news and disinformation sites like Terra Brasil Notícias, as well as their audience, exploded in Brazil in part because Google ads make it easy for people to earn money from this type of content. She likened it to people who might drive for Uber to earn extra cash.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.2\">“You don’t need to make quality content or really work with journalists. You can copy things, you can use bots, you can recycle news, and you do it from your house and you receive some money,” she said. “It’s a way to make money for people that are without opportunity. But who is making money on a large scale? Of course, it’s the platform, Google.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.3\">In response to the court’s finding, Terra Brasil Notícias took down the <a href=\"https://web.archive.org/web/20221002145535/https://terrabrasilnoticias.com/2022/10/flavio-bolsonaro-populacao-vai-votar-igual-neymar-ou-ao-marcola-veja-video/\">story that repeated the false claim</a> about Lula. It also deleted its article about U.S. voting machines after Brazilian fact-checking organization Aos Fatos contacted the site last month. In an email, Aos Fatos listed eight recent articles from the site that it rated as false, and asked Terra Brasil Notícias to comment on its relationship with Google. In response, the site <a href=\"https://terrabrasilnoticias.com/2022/09/aos-fatos-empresa-checadora-que-foi-condenada-a-pagar-indenizacao-por-fake-news-e-que-faz-parte-de-um-grupo-de-veiculos-da-midia-de-esquerda-tenta-criar-narrativa-nefasta-contra-o-terra-brasil-notic/\">published the email</a> from Aos Fatos and defended the articles. It later deleted all of them. As of this writing, it still earns money with Google.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.4\">Terra Brasil Notícias did not respond to requests for comment. Google declined to comment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.5\">Santini’s Netlab team monitors thousands of right-wing and left-wing messaging groups and websites. They shared a list of 262 active Portuguese-language websites in Brazil that circulated in messaging groups and were labeled by researchers as publishing false or misleading information. ProPublica found that 46% of the more than 250 sites flagged for disinformation earn money with Google. When that list was compressed to the 30 most shared sites in WhatsApp and Telegram groups, ProPublica found that 80% of them earn money with ads placed via Google.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.6\">“This ecosystem of sites is very important for politics in Brazil,” said Santini. “They are very powerful because people consume this thinking that it’s journalism, but it’s only propaganda. And it’s paid by Google ads.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.7\">Ads are also funding COVID-19 disinformation in Brazil. Google placed ads on a <a href=\"http://web.archive.org/web/20211025134442/https://www.stylourbano.com.br/relatorios-do-governo-britanico-sugerem-que-os-totalmente-vacinados-estao-desenvolvendo-a-sindrome-da-imunodeficiencia-adquirida/\">false October 2021 story</a> from Stylo Urbano that claimed people could develop AIDS as the result of COVID-19 vaccinations; a <a href=\"https://web.archive.org/web/20220906181309/https://www.stylourbano.com.br/22-cientistas-renomados-concluem-que-os-testes-pcr-produzem-97-de-falsos-positivos-para-covid/\">false December 2020 story</a> on the same site claiming that COVID-19 PCR tests have a 97% false positive rate; and a <a href=\"https://web.archive.org/web/20220906181354/https://www.stylourbano.com.br/novo-estudo-afirma-que-o-cdc-inflou-em-1-600-o-numero-de-mortes-por-coronavirus/\">false February 2021 article</a> on the site that said the Centers for Disease Control and Prevention “deliberately violated several federal laws” by inflating the number of deaths due to COVID-19. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.8\">After being contacted by ProPublica, Google removed its ads from the site. Stylo Urbano did not respond to a request for comment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.9\">Brazil is one of several countries in Latin America where false claims are funded by Google ads. A coalition of fact-checking organizations in Latin America provided ProPublica with a list of websites they said are frequent sources of false and misleading claims. Of the 49 active sites on the list, 19 (or 39%) currently earn money with Google.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.10\">The coalition was led by Chequeado, the Argentinian nonprofit fact-checking organization. Zommer, its founder, said Chequeado has received support from Google over the years in the form of grants and training. But it and other platforms’ ongoing failure to enforce their policies in Spanish and other languages outside of English make their work more difficult, according to her.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.11\">\"The fight against disinformation is unequal, as is the world,” Zommer said.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n    \n\n        \n    \n                    \nAn Anonymous Network in Spain\n</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"28.0\">Google’s enforcement failures in Spanish, a language spoken by roughly 550 million people, extend beyond Latin America.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"28.1\">On Sept. 22, the site Euskal News, based in the autonomous Basque region of Spain, <a href=\"https://web.archive.org/web/20220922145735/https://euskalnews.com/2022/09/holanda-oculta-los-motivos-del-exceso-de-mortalidad-que-ha-aparecido-desde-hace-6-meses/\">published an article</a> that suggested excess deaths in the Netherlands and other countries were the result of COVID-19 vaccines. The article, which was reprinted from another site, said the vaccines are possibly “causing deaths in a figure well above the average. The failure could not be more resounding.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"28.2\">There is <a href=\"https://www.reuters.com/article/factcheck-excess-mortality-idUSL2N2VS1BI\">no evidence</a> to <a href=\"https://fullfact.org/health/heart-attacks-covid/\">support claims</a> that COVID-19 vaccines are causing excess mortality. But the story is standard fare for Euskal News, a Google publishing partner that mixes anti-immigrant content and vaccine disinformation with warnings of an impending globalist and EU takeover.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n            A EuskalNews story with Google ads that falsely linked excess death figures in the Netherlands to vaccines.\n    \n            (ProPublica screenshot)\n    \n    \n    \n\n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.0\">Google placed ads on a <a href=\"https://web.archive.org/web/20220822165723/https://euskalnews.com/2022/05/encuentran-microplasticos-de-las-mascarillas-en-los-pulmones-de-varios-pacientes-britanicos/\">May</a><a href=\"https://web.archive.org/web/20220822165723/https://euskalnews.com/2022/05/encuentran-microplasticos-de-las-mascarillas-en-los-pulmones-de-varios-pacientes-britanicos/\"> 6 article that falsely linked</a> the presence of microplastic fibers in people’s lungs to mask wearing, even though the study in question was conducted pre-pandemic. Google also placed ads on <a href=\"https://web.archive.org/web/20220306151016/https://euskalnews.com/2022/03/efectos-adversos-reportados-de-la-vacuna-de-pfizer/\">a page on the site that falsely says</a> Pfizer’s vaccine resulted in thousands of adverse effects. That claim, and the internal Pfizer documents it’s based on, has <a href=\"https://www.usatoday.com/story/news/factcheck/2022/05/30/fact-check-claim-misinterprets-data-2021-pfizer-report/9898129002/\">repeatedly</a> been <a href=\"https://www.politifact.com/factchecks/2022/mar/23/blog-posting/fact-checking-false-claims-pfizers-covid-19-vaccin/\">debunked</a> by <a href=\"https://healthfeedback.org/claimreview/pfizers-confidential-document-shows-adverse-events-reported-following-vaccination-it-doesnt-demonstrate-vaccine-caused-events-or-is-unsafe/\">fact-checkers</a>. Though it placed ads on that article, Google blocked them from <a href=\"https://web.archive.org/web/20220122052306/http://euskalnews.com/2021/12/la-vacuna-de-pfizer-registra-casi-160-000-tipos-diferentes-de-efectos-adversos/\">another on the same site</a> that falsely claims the Pfizer vaccine had 160,000 adverse effects. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.1\">ProPublica documented additional pages on Euskal News with vaccine disinformation where Google appears to have blocked ads. Google declined to say how many pages it blocks before examining its overall relationship with a site, but it did remove ads from the site after being contacted by ProPublica. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.2\">Euskal News, launched in the spring of 2019, does not list an owner, and its articles do not have bylines. However, <a href=\"https://quantika14.com/2022/01/24/euskalnews-la-web-libertaria-antivacunas-editada-por-un-vendedor-carlista-de-nfts/#page-content\">research by a Spanish digital security and investigations firm</a> identified connections between the site and a far-right Basque politician named David Pasarin-Gegunde. In a 2020 interview, he <a href=\"https://gananzia.com/asi-se-cuelan-los-radicales-vascos-en-las-redes-sociales-locales\">declined to say who runs Euskal News</a> but said it’s a person from his “ideological environment.” The site <a href=\"https://web.archive.org/web/20220531085525/https://euskalnews.com/aviso-legal/\">lists</a> its webmaster as Eneko Eastresana, but he and Pasarin-Gegunde did not respond to requests for comment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.3\">Euskal News was one of 32 active Spanish sites flagged by the Brussels-based EU DisinfoLab as frequent sources of false and misleading claims. ProPublica found that 14 of the sites, or 44%, earn money with Google. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.4\">Alaphilippe, who runs the DisinfoLab, said the sites on the list “regularly publish misleading, deceptive or incorrect information and often lack credible or transparent sources.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.5\">Google declined to comment on the Spanish sites and articles identified in ProPublica’s analysis.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n    \n\n        \n    \n                    \nMedia Capture and False Content in Turkey\n<p data-pp-blocktype=\"copy\" data-pp-id=\"33.0\">Over the past two decades, Turkey’s media environment has transformed dramatically. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"33.1\">National newspapers and TV stations have been taken over by people aligned with President Recep Tayyip Erdoğan, leading Reporters Without Borders to assess that <a href=\"https://rsf.org/en/country/turkey\">90% of Turkey’s national media is under government control</a>. The outlets adhere to “a tight chain of command of government-approved headlines, front pages and topics of TV debate,” according to a <a href=\"https://www.reuters.com/investigates/special-report/turkey-erdogan-media/\">recent Reuters investigation</a>.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"33.2\">One byproduct of Turkey’s increasingly authoritarian information environment — RSF says there are <a href=\"https://rsf.org/en/country/turkey\">currently</a> nine journalists in jail in the country — is that once-reliable publications publish false articles about politics, the pandemic and a range of clickbait meant to attract and earn money from traffic coming via Google search, according to Emre Kızılkaya, chair of the International Press Institute’s National Committee in Turkey. He cited a study he produced for IPI revealing how <a href=\"https://freeturkeyjournalists.ipi.media/turkey-digital-media-report/\">Google search rewards pro-government outlets</a> and the at times false information they publish. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"33.3\">“President Tayyip Erdoğan and his cronies used multiple tactics for media capture in the past two decades, enabling them to control most of the largest news outlets today. These outlets owe most of their digital traffic — and revenue — to Google Search,” Kızılkaya, who also edits <a href=\"http://journo.com.tr/\">a nonprofit news site that reports on Turkish media</a>, told ProPublica.</p>\n        \n    \n                            \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"35.0\">ProPublica analyzed over 1,000 articles rated false by Turkish fact-checking operation Teyit since 2019, and found that 73% are earning money from Google ads. Of the 50 outlets contained in that data that were most frequently flagged by fact-checkers, 45 earn money with Google. That’s the highest of any country analyzed in the investigation.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"35.1\">“In Turkey, disinformation pays and propaganda works. Google is still a part of this problem, despite its promises to help solve it,” Kızılkaya said. “The ProPublica data confirm the findings in our recent studies that demonstrated Google's algorithmic bias towards Turkey's pro-government media outlets at the expense of endangering fragile communities here.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"35.2\">Google declined to comment on its search and ad efforts in Turkey.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n    \n\n        \n    \n                    \nMonetizing the German Far Right\n</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"39.0\">In Germany, the right-wing, anti-immigration website Freie Welt is run by the husband of Beatrix von Storch, the former deputy leader of Germany’s major far-right AfD party.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"39.1\"><a href=\"https://web.archive.org/web/20220812103139/https://www.freiewelt.net/nachricht/us-firmen-kaufen-ein-drittel-der-anbauflaeche-in-der-ukraine-10090173/\">One of the website’s articles</a>, which had Google ads on it, falsely argues that the shortage of wheat in Ukraine was a result of U.S. companies buying one-third of Ukrainian land suitable for cultivation. <a href=\"https://web.archive.org/web/20220823062710/https://www.freiewelt.net/nachricht/pfizer-studie-44-der-schwangeren-frauen-verloren-nach-impfung-ihre-babys-10090380/\">Another article with ads</a> claimed that 44% of pregnant women in Pfizer’s vaccine trial miscarried, a lie that has been <a href=\"https://www.politifact.com/factchecks/2022/aug/29/viral-image/its-not-true-nearly-half-pregnant-women-pfizers-co/\">debunked by fact-checkers</a>. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"39.2\">Freie Welt is one of 30 German-language sites the EU DisinfoLab identified as consistent sources of false and misleading content. A third of them earn money with Google.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n            An ad for the American Red Cross was placed on a Journalistenwatch article that claimed COVID-19 was like the flu. Image has been blurred by ProPublica to conceal other ads on the page.\n    \n            (ProPublica screenshot)\n    \n    \n    \n\n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"41.0\">The list includes Journalistenwatch, a leading platform of the “Neue Rechte,” a far-right political movement in Germany. Google placed an ad from the American Red Cross on <a href=\"https://web.archive.org/web/20220429133139/https://journalistenwatch.com/2021/05/16/hinweise-corona-grippe/\">an article falsely claiming</a> that COVID-19 is like the flu. <a href=\"https://web.archive.org/web/20220806003524/https://journalistenwatch.com/2022/07/28/experten-alarm-massiver/\">Another article falsely linking</a> the decline in the birth rate in Germany to COVID-19 vaccines also earned money from Google. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"41.1\">Journalistenwatch and Freie Welt did not respond to requests for comment.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n            Google placed ads on a Report24 article that falsely claimed the World Health Organization warned against kids getting the COVID-19 vaccines.\n    \n            (ProPublica screenshot)\n    \n    \n    \n\n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"43.0\">Some of the German-language sites identified by the EU DisinfoLab are based in neighboring Austria and Switzerland. One is Report24, an Austrian website that regularly spreads false information about COVID-19 measures and vaccination, according to fact-checkers. A ProPublica reporter was shown an ad for Hydeline, an American furniture retailer, on <a href=\"https://web.archive.org/web/20220805001342/https://report24.news/who-aendert-empfehlung-kinder-und-jugendliche-nicht-impfen/\">an article from June 2021</a> that falsely claims that the World Health Organization advises against children and teenagers getting COVID-19 vaccines.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"43.1\">Hydeline did not respond to a request for comment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"43.2\">In response to questions from ProPublica, a spokesperson from Report24 who did not provide their name said the above articles were “carefully researched and contain all necessary sources — as every article on our website does.” They said ProPublica’s questions and findings are similar to “the biased, fake news producing, pharma industry funded fact-checkers.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"43.3\">The site claimed that no Google ads appeared on the articles in question, and there hadn’t been any “for a long time.” The site did not respond after being sent screenshots showing Google ads on the article pages.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"43.4\">After being contacted by ProPublica, Google removed ads from Report24. The company declined to comment about the German sites and articles identified in the analysis.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n    \n\n        \n    \n                    \nMoney for Falsehoods in French\n</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"47.0\">Last October, just ahead of the United Nations global climate summit, Google announced it <a href=\"https://support.google.com/google-ads/answer/11221321\">would no longer place ads on content</a> that “contradicts authoritative scientific consensus” on climate change.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"47.1\">“Advertisers simply don’t want their ads to appear next to this content,” read <a href=\"https://support.google.com/google-ads/answer/11221321\">a notice attributed to the Google Ads team</a>.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"47.2\">But as with its policy about COVID-19 and vaccine misinformation, Google often fails to enforce <a href=\"https://support.google.com/publisherpolicies/answer/11188580#zippy=%2Ctips-for-understanding-this-policy\">its climate policy</a> across languages. Science Feedback, a French nonprofit fact-checking organization that employs journalists and scientists, provided ProPublica with 427 active URLs of articles about climate change in French and other languages it has rated false since 2021. A fifth of them were earning money with Google, according to the analysis.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n            A story with false claims about climate change had ads for eyewear company Caddis and furniture maker Rove and a health PSA from the Centers for Disease Control and Prevention, the American Medical Association and the Ad Council, an ad industry association.\n    \n            (ProPublica screenshot)\n    \n    \n    \n\n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"49.0\">In just one example, the French site 1 Scandal published <a href=\"https://web.archive.org/web/20220108102532/https://1scandal.com/rechauffement-climatique-statistiquement-insignifiant-lurgence-climatique-est-imaginaire/\">an article in January falsely stating</a> that global warming is “statistically insignificant” and “the climate emergency is imaginary.” Google had placed multiple ads on the page when ProPublica reporters visited it, including for Caddis eyewear and Rove furniture, as well as a public service announcement about diabetes supported by the CDC, the American Medical Association and the Ad Council, an ad industry body.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"49.1\">Kathy Kayse, chief media strategy and partnerships officer for the Ad Council, said in a statement that the organization relies on donated media space to place ads for its public service campaigns. This means the organization did not pay to place its ad on 1 Scandal.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"49.2\">“Because of this model, we cannot always predict or control where our content will be placed,” Kayse said, noting that they were responding on behalf of the Ad Council and the American Media Association.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"49.3\">Caddis, Rove, the CDC and 1 Scandal did not respond to requests for comment. Google appears to have removed ads from the site in response to questions from ProPublica.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"49.4\">ProPublica also analyzed two sets of French-language articles rated false by IFCN-accredited fact-checkers in France and Senegal.</p>\n        \n    \n                            \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"51.0\">Among the recent fact-checked French links earning money with Google is <a href=\"https://web.archive.org/web/20220715203144/https://infodujour.fr/sciences/57831-covid-19-les-vaccins-et-rappels-de-moins-en-moins-efficaces-et-de-plus-en-plus-nocifs\">a May article</a> from InfoDuJour that falsely claimed people vaccinated against COVID-19 were experiencing an “increase in adverse effects.” The story cited other false claims, which have been the subject of <a href=\"https://factuel.afp.com/doc.afp.com.32AK83R\">multiple fact-checks</a>, that warned people against receiving doses of the “harmful” vaccines. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"51.1\">The same site also <a href=\"https://web.archive.org/web/20220820062837/https://infodujour.fr/sante/59261-vaccins-la-mort-subite-dathletes-en-forte-hausse\">recently published an article that claims</a> athletes are dying in greater numbers and that the cause “most likely lies in the introduction of an experimental injection that was supposed to protect against Covid-19 disease, but which, on the contrary, caused untold damage to the immune system and cardiovascular problems.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"51.2\">On Aug. 1, InfoDuJour <a href=\"https://web.archive.org/web/20220825130158/https://infodujour.fr/sante/59176-les-vaccins-anti-covid-enfin-reconnus-dangereux\">published an article</a> headlined “Anti-Covid vaccines finally recognized as dangerous!” The page currently brings up a notice from the site that says Google found the article violated its policy about harmful COVID-19 misinformation. “To meet the digital giant’s conditions and avoid penalty, we have decided to delete the article,” the page says.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"51.3\">Marcel Gay runs InfoDuJour from Nancy, a city in the northeast of France. He told ProPublica that his site’s coverage of the pandemic and vaccines provided it with unprecedented traffic. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"51.4\">“Our media has gained a lot of visibility,” he said in an online message sent via the site’s customer support tool. “Last July we recorded 3.2 million unique visitors. And the advertising earnings from Google, about €3,000!” — roughly $2,979 at current exchange rates.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"51.5\">Gay defended his site’s pandemic content, saying it is “taking care to balance the information and to give divergent opinions.” He complained that traffic has since fallen since Google and Twitter took action against his site, noting that it was removed from Google News and Google Discover, the latter of which highlights news stories in the Google app. He said he deleted some anti-vaccine articles in order to keep earning money with Google.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"51.6\">“This planetary censorship is unique in the history of humanity,” Gay said. “It is reminiscent of the Inquisition that prevailed in the Middle Ages.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"51.7\">Google declined to comment on InfoDuJour and 1 Scandal.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"51.8\">Another French-language site earning money with Google, this time in Africa, is 24Jours.com. Two years ago, it was the subject of separate investigations by the <a href=\"https://www.disinfo.eu/publications/from-health-disinformation-to-copy-pasting-articles-from-sputnik-and-rt-how-an-africa-based-network-built-fake-media-outlets-and-clickbait-websites-for-profit\">EU DisinfoLab</a> and fact-checkers at <a href=\"https://observers.france24.com/fr/20200316-africa24-info-24jours-com-reseau-desinformation-clickbait-afrique\">Les Observateurs</a> that revealed it was part of a network of more than 10 sites publishing false information, reprinting Russian propaganda and stealing content from other outlets.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"51.9\">In the ensuing years the site continued to earn money from Google on articles with false claims that <a href=\"https://web.archive.org/web/20200908100045/http://www.24jours.com/manger-peut-guerir-et-prevenir-le-selon-une-etud/?fbclid=IwAR2LwMMmM6V1u4d-\">cunnilingus can help prevent cancer</a>, <a href=\"https://web.archive.org/web/20210927041355/https://www.24jours.com/un-tueur-a-massacre-et-mange-23-livreurs-de-pizzas-et-6-temoins-de-jehovah/\">a man killed over 20 pizza delivery men</a>, and <a href=\"https://web.archive.org/web/20210927044858/https://www.24jours.com/une-femme-infectee-par-covid-19-donne-naissance-a-des-jumeaux-les-nomme-corona-et-virus/\">a woman named her children Corona and Virus</a>. Ads from Google also appear on content that 24Jours.com copies word-for-word from other sites — even <a href=\"https://web.archive.org/web/20220522140024/https://www.24jours.com/cette-photo-ne-montre-pas-eric-olson-amiral-americain-prisonnier-a-marioupol/\">articles stolen</a> from <a href=\"https://observers.france24.com/fr/europe/20220519-cette-photo-ne-montre-pas-eric-olson-g%C3%A9n%C3%A9ral-am%C3%A9ricain-prisonnier-%C3%A0-marioupol\">fact-checkers</a> such as Les Observateurs.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"51.10\">The operator of 24Jours.com, who on WhatsApp identified himself as Kennedy and said he was in Cameroon, told ProPublica that he stopped posting “fake news” in 2019, and that many sites copy content from sources such as Reuters. After being informed that sites pay to license content from Reuters and other sources, Kennedy said he would remove the infringing content.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"51.11\">“Less than 10% of the content on my website are copied from other websites,” he said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"51.12\">Kennedy estimated Google is currently blocking ads from 26 articles on his site. When told that ProPublica was reaching out to Google to ask about his site, he said he would disable Google ads.</p>\n        \n    \n                    \n\n    <p>\n        <strong><a href=\"https://www.propublica.org/getinvolved/send-propublica-story-tips\">Do You Have a Tip for ProPublica? Help Us Do Journalism.</a></strong>\n    </p>\n\n        \n             \n\n                                    \n        \n                        <p><strong>Update, Oct. 31, 2022:</strong> This story was updated with Google’s comment that it continues to review sites and pages shared with it by ProPublica.</p>\n\n        \n\n    \n          \n                \n            Correction\n            <p><strong>Oct. 29, 2022:</strong> An animation with this story originally misattributed the location of an article on climate change. It is from France, not Africa.</p>\n\n        \n\n                               ",
  "dc:subject": "Technology",
  "dc:date": "2022-10-29T05:00:00-04:00",
  "dc:creator": "by Craig Silverman, Ruth Talbot, Jeff Kao and Anna Klühspies"
}