{
  "title": "Laura Fernández Cordero, \"Feminismos para la revolución. Antología de 14 mujeres que desafiaron los límites de las izquierdas\" (Argentina, Siglo XXI,  2021)",
  "description": "En este episodio conversan Fernanda Espinosa Moreno y Laura Fernández Cordero del libro Feminismos para la revolución. Antología de 14 mujeres que desafiaron los límites de las izquierdas En el libro la autora Laura Fernández Cordero se pregunta por los orígenes del feminismo “¿Qué cosas discutían las mujeres que padecían la injusticia de un mundo que ni las consideraba ciudadanas? ¿Dónde y cómo intervenían?”. Se trata de una antología de biografías cuidadosamente seleccionadas para evidenciar los feminismos desde una mirada interseccional y sus apuestas transformadoras en perspectiva histórica. Aporta a construir una historia de los feminismos problematizando la lectura progresiva de las olas del feminismo. Propone mirar con distintas perspectivas a las mujeres que componen las biografías desde sus apuestas políticas, personales y de vida, con el uso de una amplia gama de fuentes desde manuscritos, correspondencia y fotografías. El libro es por lo tanto una lectura indispensable para comprender los retos actuales del feminismo por el diálogo intergeneracional y por la relectura historiográfica que propone.\nEntrevista realizada por Fernanda Espinosa Moreno, especialista en historia de los derechos humanos, estudios sociales de la memoria, violencias y conflicto armado.",
  "pubDate": "Mon, 22 Nov 2021 09:00:00 -0000",
  "itunes:episodeType": "full",
  "itunes:episode": 34,
  "itunes:author": "New Books Network",
  "itunes:subtitle": "Una entrevista con Laura Fernández Cordero",
  "itunes:summary": "En este episodio conversan Fernanda Espinosa Moreno y Laura Fernández Cordero del libro Feminismos para la revolución. Antología de 14 mujeres que desafiaron los límites de las izquierdas En el libro la autora Laura Fernández Cordero se pregunta por los orígenes del feminismo “¿Qué cosas discutían las mujeres que padecían la injusticia de un mundo que ni las consideraba ciudadanas? ¿Dónde y cómo intervenían?”. Se trata de una antología de biografías cuidadosamente seleccionadas para evidenciar los feminismos desde una mirada interseccional y sus apuestas transformadoras en perspectiva histórica. Aporta a construir una historia de los feminismos problematizando la lectura progresiva de las olas del feminismo. Propone mirar con distintas perspectivas a las mujeres que componen las biografías desde sus apuestas políticas, personales y de vida, con el uso de una amplia gama de fuentes desde manuscritos, correspondencia y fotografías. El libro es por lo tanto una lectura indispensable para comprender los retos actuales del feminismo por el diálogo intergeneracional y por la relectura historiográfica que propone.\nEntrevista realizada por Fernanda Espinosa Moreno, especialista en historia de los derechos humanos, estudios sociales de la memoria, violencias y conflicto armado.",
  "content:encoded": "<p>En este episodio conversan Fernanda Espinosa Moreno y Laura Fernández Cordero del libro <a href=\"https://www.barnesandnoble.com/w/feminismos-para-la-revoluci-n-laura-fern-ndez-cordero/1139765389\"><em>Feminismos para la revolución. Antología de 14 mujeres que desafiaron los límites de las izquierdas</em></a> En el libro la autora Laura Fernández Cordero se pregunta por los orígenes del feminismo “¿Qué cosas discutían las mujeres que padecían la injusticia de un mundo que ni las consideraba ciudadanas? ¿Dónde y cómo intervenían?”. Se trata de una antología de biografías cuidadosamente seleccionadas para evidenciar los feminismos desde una mirada interseccional y sus apuestas transformadoras en perspectiva histórica. Aporta a construir una historia de los feminismos problematizando la lectura progresiva de las olas del feminismo. Propone mirar con distintas perspectivas a las mujeres que componen las biografías desde sus apuestas políticas, personales y de vida, con el uso de una amplia gama de fuentes desde manuscritos, correspondencia y fotografías. El libro es por lo tanto una lectura indispensable para comprender los retos actuales del feminismo por el diálogo intergeneracional y por la relectura historiográfica que propone.</p><p><em>Entrevista realizada por Fernanda Espinosa Moreno, especialista en historia de los derechos humanos, estudios sociales de la memoria, violencias y conflicto armado.</em></p>",
  "itunes:duration": 3743,
  "itunes:explicit": "no",
  "guid": "3e792908-4b9c-11ec-bbb3-4f88d0a9d5ec",
  "enclosure": ""
}