{
  "title": "NYU Biomedical Engineering Speeds Research from Lab Bench to Bedside",
  "link": "https://spectrum.ieee.org/nyu-biomedical-engineering",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/medical-equipment-with-two-rings-each-with-concentric-sensors-and-wires-connected-to-a-computer-nearby.jpg?id=31997012&width=1245&height=700&coordinates=0%2C0%2C0%2C2\"/><br/><br/><p><em>This is a sponsored article brought to you by <a href=\"https://engineering.nyu.edu/?utm_source=ieee&utm_medium=email&utm_campaign=reputation-2022&utm_content=hielscher-bme\" rel=\"noopener noreferrer\" target=\"_blank\">NYU’s Tandon School of Engineering</a>.</em></p><p>When <a href=\"https://engineering.nyu.edu/academics/departments/biomedical-engineering/faculty?utm_source=ieee&utm_medium=email&utm_campaign=reputation-2022&utm_content=hielscher-bme\" rel=\"noopener noreferrer\" target=\"_blank\">Andreas H. Hielscher</a>, the chair of the <a href=\"https://engineering.nyu.edu/academics/departments/biomedical-engineering?utm_source=ieee&utm_medium=email&utm_campaign=reputation-2022&utm_content=hielscher-bme\" rel=\"noopener noreferrer\" target=\"_blank\">biomedical engineering (BME) department at NYU’s Tandon School of Engineering</a>, arrived at his new position, <a href=\"https://engineering.nyu.edu/news/introducing-new-chair-tandons-department-biomedical-engineering?utm_source=ieee&utm_medium=email&utm_campaign=reputation-2022&utm_content=hielscher-bme\" rel=\"noopener noreferrer\" target=\"_blank\">he</a><a href=\"https://engineering.nyu.edu/news/introducing-new-chair-tandons-department-biomedical-engineering?utm_source=ieee&utm_medium=email&utm_campaign=reputation-2022&utm_content=hielscher-bme\" rel=\"noopener noreferrer\" target=\"_blank\"> saw raw </a><a href=\"https://engineering.nyu.edu/news/introducing-new-chair-tandons-department-biomedical-engineering?utm_source=ieee&utm_medium=email&utm_campaign=reputation-2022&utm_content=hielscher-bme\" rel=\"noopener noreferrer\" target=\"_blank\">potential</a>. NYU Tandon had undergone a meteoric rise in its <em>U.S. News & World Report </em>graduate ranking in recent years, skyrocketing 47 spots since 2009. At the same time, the <a href=\"https://med.nyu.edu/our-community/about-us\" rel=\"noopener noreferrer\" target=\"_blank\">NYU Grossman School of Medicine</a> had shot from the thirties to the #2 spot in the country for research. The two scientific powerhouses, sitting on opposite banks of the East River, offered Hielscher a unique opportunity: to work at the intersection of engineering and healthcare research, with the unmet clinical needs and clinician feedback from NYU’s world-renowned medical program directly informing new areas of development, exploration, and testing.</p><hr/><h3></h3><br/><p>“There is now an understanding that technology coming from a biomedical engineering department can play a big role for a top-tier medical school,” said Hielscher. “At some point, everybody needs to have a BME department.”</p><p>In the early days of biomedical engineering departments nationwide, there was some resistance even to the notion of biomedical engineering: either you were an electrical engineer or a mechanical engineer. “That’s no longer the case,” said Hielscher. “The combining of the biology and medical aspects with the engineering aspects has been proven to be the best approach.”</p><h3></h3><br/><span class=\"rm-shortcode\" data-rm-shortcode-id=\"9b55948ce0289b58bf59d0e2b87681eb\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/IukEi7aHndI?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span><p class=\"caption\">Dr. Andreas Hielscher, NYU Tandon Biomedical Engineering Department Chair and head of the Clinical Biophotonics Laboratory, speaks with IEEE Spectrum about his work leveraging optical tomography for early detection and treatment monitoring for breast cancer.</p><h3></h3><br/><p>The proof of this can be seen by the trend that an undergraduate biomedical degree has become one of the most desired engineering degrees, according to Hielscher. He also noted that the current Dean of NYU’s Tandon School of Engineering, <a href=\"https://engineering.nyu.edu/faculty/jelena-kovacevic?utm_source=ieee&utm_medium=email&utm_campaign=reputation-2022&utm_content=hielscher-bme\" rel=\"noopener noreferrer\" target=\"_blank\">Jelena Kovačević</a>, has a biomedical engineering background, having just received the 2022 IEEE Engineering in Medicine and Biology Society <a href=\"https://youtu.be/v_b-ElMEUc8\" rel=\"noopener noreferrer\" target=\"_blank\">career achievement award</a> for her pioneering research related to signal processing applications for biomedical imaging.</p><p>Mary Cowman, a pioneer in joint and cartilage regeneration, began laying the foundations for NYU Tandon’s biomedical engineering department in the 2010s. Since her retirement in 2020, Hielscher has continued to grow the department through innovative collaborations with the medical school and medical center, including the recently-announced <a href=\"https://engineering.nyu.edu/research-innovation/entrepreneurship/nyu-translational-healthcare-initiative?utm_source=ieee&utm_medium=email&utm_campaign=reputation-2022&utm_content=hielscher-bme\" rel=\"noopener noreferrer\" target=\"_blank\">Translational Healthcare Initiative</a>, on which Hielscher worked closely with <a href=\"https://engineering.nyu.edu/faculty/daniel-sodickson?utm_source=ieee&utm_medium=email&utm_campaign=reputation-2022&utm_content=hielscher-bme\" rel=\"noopener noreferrer\" target=\"_blank\">Daniel Sodickson</a>, the co-director of the medical school’s <a href=\"https://med.nyu.edu/departments-institutes/health-technology-engineering/\" rel=\"noopener noreferrer\" target=\"_blank\">Tech4Health</a>.</p><h3></h3><br/><img alt=\"Man with beard and eyeglasses in a suit against a background showing bookshelves.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"d3fcdd5a36712e5fe07365db6d2f0582\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"647ca\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/man-with-beard-and-eyeglasses-in-a-suit-against-a-background-showing-bookshelves.jpg?id=31996999&width=980\"/><h3></h3><br/><p>“The fundamental idea of the Initiative is to have one physician from Langone Medical School, and one engineer at least—you could have multiple—and have them address some unmet clinical needs, some particular problem,” explained Hielscher. “In many cases they have already worked together, or researched this issue. What this initiative is about is to give these groups funding to do some experimentation to either prove that it won’t work, or demonstrate that it can and prioritize it.”<br/></p><p>With this funding of further experimentation, it becomes possible to develop the technology to a point where you could begin to bring investors in, according Hielscher. “This mitigates the risk of the technology and helps attract potential investors,” added Hielscher. “At that point, perhaps a medical device company comes in, or some angel investor, and then you can get to the next level of investment for moving the technology forward.”</p><h2>Biophotonics for Cancer Diagnosis</h2><p>Hielscher himself has been leading research on developing new technologies within the <a href=\"https://wp.nyu.edu/tandonschoolofengineering-cbl/\" target=\"_blank\">Clinical Biophotonics Laboratory</a>. One of the latest areas of research has been investigating the application of optical technologies to breast cancer diagnosis.</p><h3></h3><br><img alt=\"Six images showing tomographic cross sections of a breast with tumor\" class=\"rm-shortcode\" data-rm-shortcode-id=\"3c81468928b06738c7989f37ff4f9b7e\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"95ede\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/six-images-showing-tomographic-cross-sections-of-a-breast-with-tumor.jpg?id=31996967&width=980\"/><h3></h3><br/><p>Hielscher and his colleagues have built a system that shines light through both breasts at the same time. By measuring how much light is reflected back it’s possible to generate maps of locations with high levels of oxygen and total hemoglobin, which may indicate tumors.</p><p>“We look at where there’s blood in the breast,” explained Hielscher. “Because breast tumors recruit new blood vessels, or, once they grow, they generate their own vascular network requiring more oxygen, wherever there is a tumor you will see an increase in total blood volume, and you will see more oxygenated blood.”</p><p>Initially, this diagnostic tool was targeted for early detection, since mammograms can only detect calcification in lower density breast tissue of women over a certain age. But it soon became clear in collaboration with clinical partners that it was also highly effective in monitoring treatment.</p><h3></h3><br/><p>“Technology coming from a biomedical engineering department can play a big role for a top-tier medical school”<br/>—Andreas H. Hielscher, Biomedical Engineering Department Chair, NYU Tandon</p><h3></h3><br><p>This realization came in part because of a recent change in cancer treatment that has moved towards what is known as neoadjuvant chemotherapy, in which chemotherapy drugs are administered before surgical extraction of the tumor. One of the drawbacks of this approach is that only around 60 percent of patients respond favorably to the chemotherapy, resulting in a large percentage of patients suffering through a grueling six-month-long chemotherapy treatment with minimal-to-no impact on the tumor.</p><p>With the optical technique, Hielscher and his colleagues have found that if they can detect a noticeable decrease of blood in targeted areas after two weeks, it’s very likely that the patient will respond to the chemotherapy. On the other hand, if they see that the amount of blood in that area stays the same, then there’s a very high likelihood that the patient will not respond to the therapy.</p><p>This same fundamental technique can also be applied to what is known as peripheral artery disease (PAD), which affects many patients with diabetes and involves the narrowing or blockage of the vessels that carry blood from the heart to the legs. An Israel-based company called <a href=\"https://www.votis.net/\" target=\"_blank\">VOTIS</a> has licensed the technology for diagnosing and treating PAD.</p><h3></h3><br/><img alt=\"Medical equipment image with blue background showing in bright yellow a finger joint affected by lupus arthritis\" class=\"rm-shortcode\" data-rm-shortcode-id=\"d1930edb3000e4edfd4b2acf58f513c1\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"586bc\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/medical-equipment-image-with-blue-background-showing-in-bright-yellow-a-finger-joint-affected-by-lupus-arthritis.jpg?id=31996972&width=980\"/><h3></h3><br/><p>\n\tWhile Hielscher’s work is in biophotonics, he recognized that the department has also quickly been developing a reputation in other emerging areas, including wearables, synthetic biology, and neurorehabilitation and stroke prediction.\n</p><p>\n\tHielscher highlighted the recent work of <a href=\"https://engineering.nyu.edu/faculty/rose-faghih?utm_source=ieee&utm_medium=email&utm_campaign=reputation-2022&utm_content=hielscher-bme\" target=\"_blank\">Rose Faghih</a>, working in smart wearables and data for mental health, <a href=\"https://engineering.nyu.edu/faculty/jef-d-boeke?utm_source=ieee&utm_medium=email&utm_campaign=reputation-2022&utm_content=hielscher-bme\" rel=\"noopener noreferrer\" target=\"_blank\">Jef Boeke</a>, a synthetic biology pioneer, and <a href=\"https://engineering.nyu.edu/faculty/s-farokh-atashzar?utm_source=ieee&utm_medium=email&utm_campaign=reputation-2022&utm_content=hielscher-bme\" rel=\"noopener noreferrer\" target=\"_blank\">S. Farokh Atashzar</a>, doing work in neurorehabilitation and stroke prediction. Atashzar’s work was highlighted last year in the pages of <a href=\"https://spectrum.ieee.org/nyu-tandon-robotics\" target=\"_self\"><em>IEEE Spectrum</em></a>.\n</p><p>\n\t“Rose Faghih is leveraging all kinds of sensors to make inferences about the mental state of patients, to determine if someone is depressed or schizophrenic, and then possibly have a feedback loop where you actually also treat them,” said Hielscher. “Jef Boeke is involved in what I term ‘wet engineering,’ and is currently involved in efforts to take cancer cells outside of the body to find a way to attack them, or reprogram them.”\n</p><h2>Future Collaborations</h2><p>\n\tAs NYU Tandon’s BME department goes forward, Hielscher’s aim is that the department becomes a trusted source for the medical school, and that partnership enables key technologies to go from an unmet clinical need or an idea in a lab to a patient’s bedside in a 3-5 year timeframe.\n</p><p>\n\t“What I really would like, “Hielscher concluded, “is that if somebody in the medical school has a problem, the first thing they would say is, ‘Oh, I’ll call the engineering school. I bet there’s somebody there that can help me.’ We can work together to benefit patients, and we’re starting this already.”<span class=\"ieee-end-mark\"></span>\n</p></br></br>",
  "pubDate": "Mon, 31 Oct 2022 14:46:16 +0000",
  "guid": "https://spectrum.ieee.org/nyu-biomedical-engineering",
  "category": [
    "Biomedical engineering",
    "Nyu tandon",
    "Cancer",
    "Optics",
    "Medical diagnostics",
    "Medical imaging"
  ],
  "dc:creator": "Dexter Johnson",
  "media:content": ""
}