{
  "id": "tag:blogger.com,1999:blog-15418143.post-6921076024767410776",
  "published": "2014-10-26T11:07:00.001-05:00",
  "updated": "2014-10-26T11:25:37.132-05:00",
  "category": [
    "",
    "",
    "",
    "",
    ""
  ],
  "title": "VMX is ready",
  "content": "I haven't posted anything here in the last few months, so let me give you guys a brief update. VMX has matured since the Prototype stage last year and the vision.ai team has already started circulating some beta versions of our software. <br /><div><div><br /></div><div>For those of you who don't remember, last year I decided to leave my super-academic life at MIT and go the startup-route focusing on vision, learning, and automation. &nbsp;Our goal is to make building and deploying vision applications as easy as pie. We want to be the Heroku of computer vision. &nbsp;Personally, I've always wanted to expose the magic of vision to a broader audience. &nbsp;I don't know if the robots of the future are going to have two legs, four arms, or they will forever be airborne -- but I can tell you that these creatures are going to have to perceive the world around them. 2014 is not a bad place to be for a vision company.<br /><div><div><br /></div><div>VMX, the suite of vision and automation tools which we showcased last year in our Kickstarter campaign, <b>is going live very soon</b>. &nbsp;VMX will be vision.ai's first product. &nbsp;While VMX doesn't do everything vision-related (there's OpenCV for that), it makes training visual object detectors really easy. &nbsp;Whether you're just starting out with vision or AI, have a killer vision-app idea, want to automate more things in your home, you're gonna want to experience VMX yourself.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://1.bp.blogspot.com/-cDl8M5YIiLM/VE0gddz1tOI/AAAAAAAANxI/xvhKZs3plLU/s1600/vmx_pkg_image.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"http://1.bp.blogspot.com/-cDl8M5YIiLM/VE0gddz1tOI/AAAAAAAANxI/xvhKZs3plLU/s1600/vmx_pkg_image.png\" /></a></div><br /></div><div><br /></div><div>We will be providing a <b>native installer for Mac OS X</b> as well as single command <b>installer for Linux machines based on Docker</b>. VMX will run on your machine without an internet connection (the download plus all dependencies plus all necessary pre-trained files is approximately 2GB and an activation license will cost between $100 and $1000). &nbsp;The VMX App Builder runs in your browser, is built in AngularJS, and our REST API will allow you to write your own scripts/apps in any language you like. &nbsp;We even have lots of command line examples if you're a curl-y kind of guy/gal. If there's sufficient demand, we'll work on a native Windows installer.&nbsp;</div><div><br /></div><div>We have been letting some of our close friends and colleagues beta-test our software and we're confident you're going to love it. &nbsp;If you would like to beta-test our software, please sign up on the vision.ai mailing list and send us a beta-key request. &nbsp;We have a limited number of beta-testing keys, so I'm sorry if we don't get back to you. &nbsp;If you want a hands-on demo by one of the VMX creators, we are more than happy to take a hacking break and show off some VMX magic. &nbsp;We can be found in Boston, MA and/or Burlington, VT. &nbsp;If you're thinking of competing in a Hackathon near one of our offices, drop us a line, we'll try to send a vision.ai jedi your way.</div><div><br /></div><div>Geoff has been championing Docker for the last year and he's done amazing things Dockerizing our build pipeline while I refactored the vision engine API using some ideas I picked up from Haskell, and made considerable performance tweaks to the underlying learning algorithm. &nbsp;I spent a few months toying with different deep network representations, and modernized the internal representation so I can find another deep learning guru to help us out with R&amp;D in 2015.</div><div><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://3.bp.blogspot.com/-NOj7R9hOfew/VEwhgW1tw0I/AAAAAAAANw0/XZwqWDut6a8/s1600/vmx_server_running.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"http://3.bp.blogspot.com/-NOj7R9hOfew/VEwhgW1tw0I/AAAAAAAANw0/XZwqWDut6a8/s1600/vmx_server_running.png\" height=\"209\" width=\"320\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\">4 VMXserver processes running on Macbok Pro</div><div><br /></div><div>We're going to release plenty of pre-trained models plus all the tools and video tutorials you'll need to create your own models from scratch. &nbsp;</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div><div>We will be offering a $100 personal license and a $1000 professional license of VMX. &nbsp;Beta testers get a personal license in return for helping find installation bugs. Internally, we are at version 0.1.3 of VMX and once we attain 90%+ code coverage we will have VMX 1.0 sometime in early 2015. &nbsp;We typically release stable versions every 1 months and bleeding edge development builds every week.&nbsp;</div><div><br /></div><div><i>The future of vision.ai&nbsp;</i></div><div><br /></div><div>In the upcoming months, we'll be perfecting our cloud-based deployment platform, so if you're interested in building on top of our vision.ai infrastructure or want to have fun running some massively parallel vision computations with us, just shoot us an email.</div><div><br /></div><div><br /><div><br /></div></div></div></div></div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Tomasz Malisiewicz",
    "uri": "http://www.blogger.com/profile/17507234774392358321",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 3
}