{
  "title": "Vietnamese prisoner of conscience denied family visits after hunger strike",
  "description": "Trinh Ba Tu's father was turned back this week after two unsuccessful trips to the prison last month.",
  "link": "https://www.rfa.org/english/news/vietnam/tu-denied-visits-11042022010811.html",
  "guid": "https://www.rfa.org/english/news/vietnam/tu-denied-visits-11042022010811.html",
  "author": "By RFA Vietnamese",
  "media:content": {
    "media:description": "Trinh Ba Tu who claims he was beaten and chained by guards at Prison Camp No. 6.",
    "media:credit": "Facebook Trinh Ba Tu"
  },
  "content:encoded": "\n        <p><span style=\"font-weight: 400;\">Jailed land rights activist Trinh Ba Tu is being denied family visits at Prison Camp No. 6 in Vietnam’s bleak Ngha An province after he started a hunger strike nearly two months ago to protest against prison guards beating him.</span></p>\n<p><span style=\"font-weight: 400;\">He started to refuse food on Sept. 6 and told his father later that month he had been put in solitary confinement, beaten and shackled.</span></p>\n<p><span style=\"font-weight: 400;\">At the end of September, right after Tu’s father Trinh Ba Khiem returned from prison, his family filed a petition to the Ministry of Public Security to investigate the accusations. The ministry replied that the family should send the petition to the People's Procuracy of Nghe An province. So far, his family has not received a response.</span></p>\n<p><span style=\"font-weight: 400;\">Tu was also denied two visits from his father last month and the punishments show no signs of ending, even though it’s unclear whether he is still on hunger strike.</span></p>\n<p><span style=\"font-weight: 400;\">Tu’s father went to the prison on Thursday and asked to see his son but his request was refused. He was told he couldn't make another appointment for more than two weeks.</span></p>\n<p><span style=\"font-weight: 400;\">\"I went in there for about an hour to submit the [appointment] book. Then a prison officer came out and said that Tu was still being disciplined so I couldn't send him things or see my child until November 21.</span></p>\n<p><span style=\"font-weight: 400;\">“I don't know if Tu has stopped his hunger strike yet, and I don't know what the situation is yet. The Prison Camp 6 warden said nothing more.”</span></p>\n<p><span style=\"font-weight: 400;\">Khiem said the warden he spoke with was called Loc who was a captain of the local management team for political prisoners.</span></p>\n<p><span style=\"font-weight: 400;\">RFA Vietnamese called the prison on Thursday to verify Khiem’s claims but no one answered the phone.</span></p>\n<p><span style=\"font-weight: 400;\">Prisoners normally have the right to a one-hour monthly visit from their relatives, to make a 10-minute phone call every month and to receive provisions from their families.</span></p>\n<p><span style=\"font-weight: 400;\">Khiem said he was extremely worried about his son's health, especially since two political prisoners died while serving their sentences in the prison.</span></p>\n<p><span style=\"font-weight: 400;\">In 2019, former teacher Dao Quang Thuc died in the prison while serving a 13-year sentence. This August, citizen journalist Do Cong Duong also died there. Both men were healthy before being transferred to the prison camp.</span></p>\n<p><span style=\"font-weight: 400;\">Trinh Ba Tu, 33, his brother Trinh Ba Phuong, 37, and their mother Can Thi Theu, 60, were arrested in mid-2020 on charges of \"conducting propaganda against the state\" for speaking out strongly on social networks about the Dong Tam land rights dispute.</span></p>\n<p><span style=\"font-weight: 400;\"><span>The dispute centered on construction of a military airport opposed by villagers south of Hanoi. The ensuing January 2020 clash left a popular local leader and three policemen dead. Twenty-nine villagers were arrested, and many were given stiff sentences.</span></span></p>\n<p><span style=\"font-weight: 400;\">At the beginning of May last year, Tu and his mother were sentenced to eight years in prison and three years’ probation each. Phuong was sentenced to 10 years in prison.</span></p>\n<p><span style=\"font-weight: 400;\">Prison No. 6 is located in the region with the harshest climate in the Central region. Many former prisoners have told RFA that the guards are particularly brutal to prisoners of conscience.</span><span style=\"font-weight: 400;\"></span><span style=\"font-weight: 400;\"></span></p>\n        ",
  "pubDate": "Fri, 04 Nov 2022 01:12:00 -0400"
}