{
  "title": "Whole Brain Living, Psychology + Neuroanatomy + Spirit with Dr. Jill Bolte-Taylor (164)",
  "link": "https://therapistuncensored.com/episodes/whole-brain-living-psychology-neuroanatomy-spirit-with-dr-jill-bolte-taylor-164/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=whole-brain-living-psychology-neuroanatomy-spirit-with-dr-jill-bolte-taylor-164",
  "pubDate": "Mon, 06 Dec 2021 01:30:21 +0000",
  "guid": "https://therapistuncensored.com/?p=12062",
  "description": "Join our online community!\n\nUsing neuroanatomy and her experience having a massive stroke that took her self-conscious mind, Dr. Jill Bolte-Taylor and Sue Marriott discuss the 4 skill subsets in the brain that help us relate to ourselves and the world. Her TED Talk was the first one to ever go viral and has been viewed now 27 million times, so her ideas are clearly inspiring. Her new work brings together psychology, neurobiology and spiritual awakening.\n\nNOTE Dec, 2021:  We will be releasing deeper dive episodes of Jill Bolte-Taylor&#039;s work and explore Whole Brain Living together on our private feed (only $5/mo).  In addition, once we get through the book, we will have a live discussion all together in Jan, 2022. Join us by clicking the image to the right or go to www.therapistuncensored.com/join \n\nDr. Jill Bolte Taylor is a Harvard-trained neuroanatomist who suffered a stroke that led her on a path to rediscovering her brain. Her viral TED Talk, “My stroke of insight,” was the inspiration for her first book, My Stroke of Insight: A Brain Scientist&#039;s Personal Journey. Now she&#039;s back to offer a deeper insight into the inner workings of the mind with her latest book, Whole Brain Living: The Anatomy of Choice and the Four Characters That Drive Our Life. In this episode, she dives deep into how the four distinct parts of our brain dictate how we live and be in the world. She gives great insight on how we can create anatomy by truly getting to know these four characters and owning our power. Tune in for this interesting and eye-opening discussion that could change the way you live your life.\n\nShow Notes:\n\n00:00:00 Introduction\n00:03:30 The Beginnings Of Dr. Jill Bolte Taylor\n00:06:18 On her viral TedTalk\n00:08:17 What science can’t explain\n00:10:10 Left hemisphere vs right hemisphere\n00:14:51 From My Stroke of Insight To Whole Brain Living, the individual in the left brain vs the individual in the right brain\n00:19:40 The Four Characters: Character 1(top-left) & 2(left lower limbic)\n00:31:38 How your brain can change the narrative\n00:36:00 Regulation in the limbic system\n00:40:53 The Four Characters: Character 3(right lower limbic) & 4(top-right)\n00:50:08 The BRAIN Huddle and our personal power to choose how we want to be\n01:00:40 What’s next for Dr. Jill\n01:02:27 The harmony of all Characters as the evolution of humanity\n01:04:08 How to contact Dr. Jill\n01:06:41 Psychedelics and connection with the planet\n01:09:50 More on how to contact Dr. Jill\nHear more psychology and neuroscience in previous episodes:\nEpisode 93 Polyvagal Theory with Dr. Stephen Porges\nEpisode 110 Story Follows State (more polyvagal theory) with Deb Dana  \nEpisode 117 Resilience Trauma and the Brain with Dr. Bruce Perry \n--\n\nListen to the podcast here:\n\nWhole Brain Living - Psychology + Neuroanatomy + Spirit with Dr. Jill Bolte-Taylor\nTranscript:\n\nAnn Kelley:\n\nYou are going to be blown away by this episode with Jill Bolte Taylor. We didn&#039;t find out until after the interview that Oprah Winfrey named her as one of her all-time favorite guests and you&#039;re going to see why. This episode is a conversational mix of fascinating life stories, insights about neuroanatomy and psychology and good inspiration. \n\nJill Bolte Taylor is a Harvard-trained neuroanatomist who started her career researching the brain and mental illness but she suffered a stroke on the left hemisphere of her brain. Through her experience of the stroke itself and her recovery, she continues to bring some of the most amazing insights regarding brain function and Whole Brain Living: The Anatomy of Choice and the Four Characters That Drive Our Life.\n\nHer TED Talk was the very first one to go viral, I believe, with almost 28 million views. In this episode, my cohost, Sue Marriott, explores her thoughts on what made her message take off and what she was tapping into that people needed. After her first book called My Stroke of Insight: A Brain Scientist&#039;s Person...",
  "enclosure": "",
  "itunes:subtitle": "The we inside of me - using neuroanatomy to help you regulate and connect",
  "itunes:summary": "Using neuroanatomy and her experience having a massive stroke that took her self-conscious mind, Dr. Jill Bolte-Taylor and Sue Marriott discuss the 4 skill subsets in the brain that help us relate to ourselves and the world. Her TED Talk was the first one to ever go viral and has been viewed now 27 million times, so her ideas are clearly inspiring.  Her new work brings together psychology, neurobiology and spiritual awakening. <br />",
  "itunes:author": "Jill Bolte-Taylor",
  "itunes:image": "",
  "itunes:season": 6,
  "itunes:episode": 164,
  "itunes:title": "Whole Brain Living - Psychology + Neuroanatomy + Spirit with Dr. Jill Bolte-Taylor (164)",
  "itunes:duration": "1:14:29"
}