{
  "title": "S1E21 - Make Each Day Better Than Your Last with Shot Put Gold Medalist Michelle Carter",
  "guid": "https://pinecast.com/guid/ba08e1b2-4c81-4e17-9754-a32fcf1ab778",
  "pubDate": "Tue, 27 Oct 2020 06:30:00 -0000",
  "itunes:duration": "00:57:44",
  "description": "<p>Olympic shot put gold medalist, Michelle Carter, is Laura’s very special guest on the podcast today. Michelle is a three-time Olympian and a World Championship gold medalist who has excelled at the national and international level over the past two decades. In addition to capturing eight Texas State U.I.L. titles in shot put and discus as well as two national girls’ shot put records and the Texas state record in discus, Michelle’s gold medal winning performance in the shot put at the 2016 Olympics made her the first United States female athlete to win the event since the women’s competition began in 1948. Michelle is also an outspoken advocate for females in sport which becomes readily apparent as she shares her remarkable story with Laura here today.</p>\n<p>Michelle details her career in sport from its very beginning through to current day, touching upon her ‘Coach Daddy’s’ role in it, her experiences in high school, college and the Olympics, and how her mindset was developed and impacts her performance, along the way. She also discusses drug use in her sport, being on the pro circuit, dealing with illness and injury, and her tremendous faith, including how God ‘shows up’. She finishes up the conversation with an update on her career these days, how COVID has affected it, and the various initiatives that she has started to help girls in sport. Michelle Carter is undeniably an elite athlete whose achievements are utterly spectacular, and, as you will hear today, she is so much more. In her mindset, her confidence, her faith, her ethics, and her passion, she is a role model not only to other athletes, but to absolutely every one of us.</p>\n<p>Episode Highlights:</p>\n<p>·       Michelle’s start in sports and her journey to shot put\n·       Her dad’s track and football career and his role as ‘Coach Daddy’\n·       Michelle’s high school and college experience\n·       Her Olympic experiences and how they all differed for her\n·       Her mindset and how it was developed\n·       Handling the build up to, and atmosphere at, the Olympics\n·       Dealing with drug use in track and field\n·       The pro circuit\n·       Dealing with an injury in the build up to 2016 Olympics\n·       A throw by throw account of her Olympic gold medal performance\n·       How God ‘shows up’\n·       Her career since the 2016 Olympics\n·       How COVID has impacted her\n·       Michelle’s ‘You Throw Girl Sports Confidence Camp’\n·       Her ‘One Golden Shot’, ‘Fuel Up’, and ‘I’m Supported’ initiatives</p>\n<p>Quotes:</p>\n<p>“I didn’t look at it as if I always had to win. I just knew I had to do better than I did last time.”</p>\n<p>“I wanted to meet the expectations that I had for myself.”</p>\n<p>“It was like I always kind of expect something to go wrong, and to be ready to kind of face that challenge.”</p>\n<p>“I didn’t want my first Olympic…experience to be horrible, and I did truly feel like I was not ready.”</p>\n<p>“That year really proved to myself that I knew that I had what it takes to be successful.”</p>\n<p>“I didn’t see myself as one of the world’s greatest athletes…I was just so in awe.”</p>\n<p>“I didn’t want to put any extra pressure just because it was the Olympics…I just have to go out there and compete to the best of my abilities.”</p>\n<p>“I had pretty much just stayed off social media from the time I got to the Olympic Village until after I competed because I had to protect my energy.”</p>\n<p>“I was actually diagnosed with Hashimoto’s in 2010, so I knew that 2012 wasn’t going to be easy.”</p>\n<p>“All I control is me…I pride myself on being a clean athlete…what’s done in the dark will come to light.”</p>\n<p>“I want to beat the dirtiest person on their best day with my clean self being ready on that day…I’m going to beat you while you’re cheating.”</p>\n<p>“Being a part of one of the world’s greatest teams, Team USA, we have all the medical things you ever need or want. “</p>\n<p>“I’m having these conversations in my head to keep myself balanced.”</p>\n<p>“Lord, listen, this is it. I only have one more throw. If You said that I could win, you better show up right now, because this is it.”</p>\n<p>“What I had worked on showed up.”</p>\n<p>“I know she has the ability to beat me. The question is, like, can she meet the challenge?”</p>\n<p>“Whatever you want to do is possible.”</p>\n<p>“I know now why He did it that way. It was to humble me and to reach so many more people and change their lives…that’s just such a God thing.”</p>\n<p>“He believed in me when I didn’t quite believe in myself.”</p>\n<p>“I know that I can still do better.”</p>\n<p>“You can be me and better.”</p>\n<p>“I feel like once you’re confident in who you are outside of your skills, add your skills on top of your confidence just in who you are, you become so powerful.”</p>\n<p>“You are so passionate about young girls and helping young girls. I love your heart.”</p>\n<p>Links:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a> \nMental Training:   <a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">https://www.laurawilkinson.com/learn</a> \nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a> \nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a></p>\n<p>Connect with Michelle:\nWebsite:   <a href=\"https://www.shotdiva.com/\" rel=\"nofollow\">https://www.shotdiva.com/</a>\n‘You Throw Girl’:   <a href=\"https://www.shotdiva.com/you-throw-girl\" rel=\"nofollow\">https://www.shotdiva.com/you-throw-girl</a>\n‘One Golden Shot’, ‘Fuel Up’, and ‘I’m Supported’:   <a href=\"https://www.shotdiva.com/onegoldenshot\" rel=\"nofollow\">https://www.shotdiva.com/onegoldenshot</a>\nInstagram:   <a href=\"https://www.instagram.com/ShotDiva/\" rel=\"nofollow\">https://www.instagram.com/ShotDiva/</a></p>",
  "itunes:title": "Make Each Day Better Than Your Last with Shot Put Gold Medalist Michelle Carter",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 21
}