{
  "title": "9. تاریخ ایران - زندگی نامه کامل کوروش نوشته محمد هادی احمدی",
  "description": "  <p>9. تاریخ ایران - زندگی نامه کامل کوروش نوشته محمد هادی احمدی</p><p>راوی: امیر اردلان داودی</p><p><br></p><p>بایسته است که هر ایرانی میهندوست نَسکِ (کتابِ) زندگینامهِ کوروش بزرگ را بخواند تا در کنار یادگیریِ آموزش های فرخویی (اخلاقی) از این رادمرد بُزرگ، هُنر مُبارزه در زندگی را نیز در آموزشگاهِ این بُزرگترین نابغهِ رزمی جهان بیاموزد که چگونه از راه بکارگیری شگردهایِ هوشمندانه و وَدایش های (تصمیم هایِ) خَرَدمندانه و بجا با کمترین هزینه بر گرفتاریهای زندگی روزمره اش چیره گردد. باهمهِ ویژگی هایِ فرخوییِ (اخلاقی) ستایش انگیزی که کوروش داشت، او یک پدیدهِ جُدابافته ( استثنایی) از مردم ایران نبود، او بازده و دست پروردهِ یک آیین و فرهنگِ آدمساز بود که به جان مردم، هاگ هایِ آدمی (حقوق بشر) و هاگِ (حق) آزادی شان ارج میگُذاشت، همان آیینی که امروز شوربختانه به فراموشی سپرده شده است. در درونِ هر ایرانی میهندوست یک کوروش با همهِ نیکی ها و آزادگیش نهفته است که میتواند از درون او برخیزد و نمایان شود.</p><p>به امید ساخت اثری فاخر در شان کوروش بزرگ......</p>  ",
  "content:encoded": "  <p>9. تاریخ ایران - زندگی نامه کامل کوروش نوشته محمد هادی احمدی</p><p>راوی: امیر اردلان داودی</p><p><br></p><p>بایسته است که هر ایرانی میهندوست نَسکِ (کتابِ) زندگینامهِ کوروش بزرگ را بخواند تا در کنار یادگیریِ آموزش های فرخویی (اخلاقی) از این رادمرد بُزرگ، هُنر مُبارزه در زندگی را نیز در آموزشگاهِ این بُزرگترین نابغهِ رزمی جهان بیاموزد که چگونه از راه بکارگیری شگردهایِ هوشمندانه و وَدایش های (تصمیم هایِ) خَرَدمندانه و بجا با کمترین هزینه بر گرفتاریهای زندگی روزمره اش چیره گردد. باهمهِ ویژگی هایِ فرخوییِ (اخلاقی) ستایش انگیزی که کوروش داشت، او یک پدیدهِ جُدابافته ( استثنایی) از مردم ایران نبود، او بازده و دست پروردهِ یک آیین و فرهنگِ آدمساز بود که به جان مردم، هاگ هایِ آدمی (حقوق بشر) و هاگِ (حق) آزادی شان ارج میگُذاشت، همان آیینی که امروز شوربختانه به فراموشی سپرده شده است. در درونِ هر ایرانی میهندوست یک کوروش با همهِ نیکی ها و آزادگیش نهفته است که میتواند از درون او برخیزد و نمایان شود.</p><p>به امید ساخت اثری فاخر در شان کوروش بزرگ......</p>  ",
  "itunes:summary": "9. تاریخ ایران - زندگی نامه کامل کوروش نوشته محمد هادی احمدیراوی: امیر اردلان داودیبایسته است که هر ایرانی میهندوست نَسکِ (کتابِ) زندگینامهِ کوروش بزرگ را بخواند تا در کنار یادگیریِ آموزش های فرخویی (اخلاقی) از این رادمرد بُزرگ، هُنر مُبارزه در زندگی را نیز در آموزشگاهِ این بُزرگترین نابغهِ رزمی جهان بیاموزد که چگونه از راه بکارگیری شگردهایِ هوشمندانه و وَدایش های (تصمیم هایِ) خَرَدمندانه و بجا با کمترین هزینه بر گرفتاریهای زندگی روزمره اش چیره گردد. باهمهِ ویژگی هایِ فرخوییِ (اخلاقی) ستایش انگیزی که کوروش داشت، او یک پدیدهِ جُدابافته ( استثنایی) از مردم ایران نبود، او بازده و دست پروردهِ یک آیین و فرهنگِ آدمساز بود که به جان مردم، هاگ هایِ آدمی (حقوق بشر) و هاگِ (حق) آزادی شان ارج میگُذاشت، همان آیینی که امروز شوربختانه به فراموشی سپرده شده است. در درونِ هر ایرانی میهندوست یک کوروش با همهِ نیکی ها و آزادگیش نهفته است که میتواند از درون او برخیزد و نمایان شود.به امید ساخت اثری فاخر در شان کوروش بزرگ......",
  "itunes:image": "",
  "enclosure": "",
  "itunes:duration": "01:09:15",
  "guid": "album-9e007181500d456d9f7d32b0b4c599ee-3444b3dfcb774ed2b4d86efbda1c7c9a",
  "pubDate": "Tue, 26 Jan 2021 09:30:00 +0000",
  "author": "",
  "author_picture": "",
  "castbox:tid": 332424359,
  "castbox:episode_premium": "",
  "itunes:explicit": "no",
  "itunes:season": 18
}