{
  "title": "Operational intelligence and the new frontier of data",
  "link": "https://medriscoll.com/2021/05/01/operational-intelligence-and-the-new-frontier-of-data/",
  "comments": "https://medriscoll.com/2021/05/01/operational-intelligence-and-the-new-frontier-of-data/#respond",
  "dc:creator": "Michael Driscoll",
  "pubDate": "Sat, 01 May 2021 18:11:18 +0000",
  "category": [
    "Uncategorized",
    "businessintelligence"
  ],
  "guid": "https://medriscoll.com/?p=216",
  "description": "<p>Always-on businesses such as global retailers, social media apps, transportation platforms, and financial marketplaces have mission-critical use cases that require real-time decisions on operational event streams. Target’s supply chains must adapt to changes in store inventory, Snap’s new app launches must be debugged, Lyft’s drivers must be predictively routed to riders, and at Paypal, fraudulent<a class=\"more-link\" href=\"https://medriscoll.com/2021/05/01/operational-intelligence-and-the-new-frontier-of-data/\">Continue reading <span class=\"screen-reader-text\">\"Operational intelligence and the new frontier of data\"</span></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://medriscoll.com/2021/05/01/operational-intelligence-and-the-new-frontier-of-data/\">Operational intelligence and the new frontier of data</a> appeared first on <a rel=\"nofollow\" href=\"https://medriscoll.com\">m. e. driscoll</a>.</p>\n",
  "content:encoded": "\n<p><img decoding=\"async\" loading=\"lazy\" width=\"960px;\" height=\"540px;\" src=\"https://lh5.googleusercontent.com/pF9GNQ4AOvFY1U-hC1ySb8wElZYI4iORD_LwjFqdVRnrQTkPYIJZLiRPikEnCjTjK8XbKWkr-T3Bn2nY-17y_RVMJ_9WCHSMf_Rvq2HgmlP5W9HX2R-EtB8txdNPwcMejTmGqEcKEWE\"></p>\n\n\n\n<p>Always-on businesses such as global retailers, social media apps, transportation platforms, and financial marketplaces have mission-critical use cases that require real-time decisions on operational event streams.</p>\n\n\n\n<p>Target’s supply chains must adapt to changes in store inventory, Snap’s new app launches must be debugged, Lyft’s drivers must be predictively routed to riders, and at Paypal, fraudulent payments must be flagged and blocked.</p>\n\n\n\n<p>These use cases for logistics, app monitoring, and fraud detection aren&#8217;t science fiction, they&#8217;re real-world examples powered by an emerging technology stack that combines event stream processing, fast OLAP databases, interactive dashboards and machine-learning applications.&nbsp; Fueled by real-time data coming from instrumented products and services, this technology stack is driving a distinct category of analytics called operational intelligence, which is complementary to traditional business intelligence.</p>\n\n\n\n<span id=\"more-216\"></span>\n\n\n\n<p>I believe the need for operational intelligence will dramatically expand in the coming years.&nbsp; In this post we lay out why operational intelligence matters now, its salient differences with traditional business intelligence, and why it demands new technology architectures.</p>\n\n\n\n<p>&#x200d;</p>\n\n\n\n<h2>Operational intelligence: why now?</h2>\n\n\n\n<h3>A global digital nervous system is emerging</h3>\n\n\n\n<p>One consequence of ubiquitous computing and digital transformation is the promise of visibility into the previously invisible.&nbsp; There are now an estimated 20 billion connected devices on the planet, encompassing everything from smartphones and cars, to lamp posts and&nbsp;<a href=\"https://twitter.com/holman/status/1380342593418977283\" target=\"_blank\" rel=\"noreferrer noopener\">laundry machines</a>.&nbsp; Previously unobservable actions in the analog world &#8212; a package delivery, a store purchase, a taxi ride &#8212; now throw off digital signals in the form of a barcode scan, a payment gateway request, or a stream of GPS heartbeats.</p>\n\n\n\n<p>Collectively, these connected devices are the sensory scaffold for an emerging global digital nervous system, whose potential we are only just beginning to explore.&nbsp; However, some of the near-term opportunities are analogous to the advantages of our own nervous system:&nbsp; faster reaction times and better decision-making with richer sensory data.<br>&#x200d;</p>\n\n\n\n<h3>Event streams are the new frontier of data</h3>\n\n\n\n<p>While smart sensors have been widely deployed and digital services are more finely instrumented than ever, businesses are just now building the software infrastructure to capture and process the event streams from their products and services.</p>\n\n\n\n<p>With this first wave of data plumbing complete, businesses now have an opportunity to build new kinds of workflows. For example, traditionally businesses compile and update a set of KPIs on a weekly or daily basis. What happens when it’s possible to track these metrics up-to-the-minute and down to an individual line item or customer? It means that small issues can be addressed before they become big challenges. Shipped software used to take months to detect and correct issues, but today Netflix&nbsp;<a href=\"https://netflixtechblog.com/how-netflix-uses-druid-for-real-time-insights-to-ensure-a-high-quality-experience-19e1e8568d06\" target=\"_blank\" rel=\"noreferrer noopener\">continuously monitors the performance of new versions of its software</a>&nbsp;and can revert software for specific users when issues are detected. Similarly, Lyft&nbsp;<a href=\"https://www.slideshare.net/arupmalakar/streaming-sql-and-druid\" target=\"_blank\" rel=\"noreferrer noopener\">tracks rider conversion rates at a city block level</a>&nbsp;and redirects drivers to a particular block when those rates drop.<br>&#x200d;</p>\n\n\n\n<h3>Intelligence pushed to the edge: accelerating decision loops</h3>\n\n\n\n<p>Sensor data is generated on the edge by users on their devices, fleets of GPS-instrumented vehicles and servers in a data center. This data is then streamed over the cloud to a central processing system to synthesize KPIs.&nbsp; However, if the insights stopped here, with a downsloping graph on the dashboard of a business analyst, the value of these insights is limited.</p>\n\n\n\n<p>One of the hallmarks of operational intelligence is the speed of feedback to the edge. In the real-life examples above, Netflix and Lyft aren’t waiting hours or days to make adjustments, they are acting within seconds to minutes.&nbsp; As operational intelligence systems mature, human analysts are excised from these decision loops, and these course-corrections are automated, powered by machine-learning algorithms.</p>\n\n\n\n<p>To support the accelerated decision-cycles, businesses need to transform their technology stacks.</p>\n\n\n\n<p>&#x200d;</p>\n\n\n\n<h2>How operational and business intelligence are different</h2>\n\n\n\n<p>&#x200d;</p>\n\n\n\n<h3>Thinking, fast and slow</h3>\n\n\n\n<p>The distinction between operational and business intelligence is analogous to the distinction between fast and slow thinking, as characterized by psychologist Daniel Kahneman in his paper&nbsp;<a href=\"https://www.scientificamerican.com/article/kahneman-excerpt-thinking-fast-and-slow/\" target=\"_blank\" rel=\"noreferrer noopener\">Thinking, Fast and Slow</a>. One system operates quickly and automatically for simple decisions and the other leverages slow and effortful deliberation for complex decisions).&nbsp;Per Kahneman’s own style, we share a few examples below that illustrate different use cases for operational and business intelligence.</p>\n\n\n\n<figure class=\"wp-block-table\"><table><tbody><tr><th>Operational intelligence</th><th>Business intelligence</th></tr><tr><td>As a Lyft marketplace optimization algorithm, should I direct more drivers to Logan airport to increase conversions?</td><td>As Lyft’s head of HR, should we hire more drivers in Boston this month, to match rising demand there?</td></tr><tr><td>As a Netflix DevOps engineer, should I roll back this morning’s software release for tablets running Android version 10.0.0_r52, so we can reduce crash rates?</td><td>As a Netflix product manager, should we delay the Android feature launch a few days for further testing?</td></tr><tr><td>As a Pinterest campaign manager, should I increase our advertising budget by 5% in the next hour on YouTube?</td><td>As a director of marketing, how should we allocate advertising budget across YouTube and Instagram next quarter?</td></tr></tbody></table></figure>\n\n\n\n<p>&#x200d;</p>\n\n\n\n<p>Ultimately, the output of operational and business intelligence are decisions. Operational intelligence fuels fast, frequent decisions on real-time and near-time data by hands-on operators. Business intelligence drives complex decisions that occur daily or weekly, on fairly complete data sets by managers. We further unpack some of the distinguishing features below.</p>\n\n\n\n<p>&#x200d;</p>\n\n\n\n<figure class=\"wp-block-table\"><table><tbody><tr><td></td><th>Operational intelligence</th><th>Business intelligence</th></tr><tr><th>Decision features</th><th></th><th></th></tr><tr><td>Frequency</td><td>Intraday, continuous</td><td>Daily, weekly, quarterly</td></tr><tr><td>Scope</td><td>Narrow, localized</td><td>Broad, macro</td></tr><tr><td>Effort</td><td>Low</td><td>High</td></tr><tr><th>Decision makers</th><th></th><th></th></tr><tr><td>Organization roles</td><td>Operators</td><td>Managers</td></tr><tr><td>Process</td><td>Decentralized</td><td>Centralized</td></tr><tr><td>Algorithmic decisions</td><td>Frequent</td><td>Rare</td></tr><tr><th>Data inputs</th><th></th><th></th></tr><tr><td>Sources</td><td>Raw event streams</td><td>Data lakes</td></tr><tr><td>Freshness</td><td>Up to real-time</td><td>Updated hourly or daily</td></tr><tr><td>History retained</td><td>Weeks to months</td><td>Years to forever</td></tr><tr><th>Tools</th><th></th><th></th></tr><tr><td>Database engine</td><td>OLAP databases</td><td>Cloud warehouses</td></tr><tr><td>Speed of queries</td><td>Sub-second to seconds</td><td>Minutes to hours</td></tr><tr><td>Dashboard type</td><td>Ad hoc, interactive</td><td>Structured, limited interactivity</td></tr></tbody></table></figure>\n\n\n\n<p>&#x200d;</p>\n\n\n\n<p>Managers can be operators too, albeit on a much higher level.&nbsp; Some of the biggest consumers of operational intelligence tools are CEOs, who track and react to intraday global KPIs for their businesses.&nbsp; Operational KPIs often have an organizational hierarchy, and at every level &#8212; from a district manager to field service provider &#8212; there are component KPIs that require continuous monitoring and decision-making.</p>\n\n\n\n<h2>Why operational intelligence requires new technologies&#x200d;</h2>\n\n\n\n<p>Operational intelligence provides a set of decision-making capabilities that are complementary to business intelligence.&nbsp; But its unique performance requirements also demand a novel stack of distinct technologies which are complementary and sit adjacent to existing business intelligence stacks.</p>\n\n\n\n<p>Analytics technology stacks can be thought of as data flowing into a three-layered cake consisting of ETL, databases, and applications.&nbsp; The requirements for an operational intelligence stack is that it supports:</p>\n\n\n\n<ul><li>high speed of data from ETL to application</li><li>high frequency, low-latency queries between the database and application layer</li></ul>\n\n\n\n<p>In the diagram below we illustrate two common examples for technologies used in operational and business intelligence stacks.</p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https://i0.wp.com/uploads-ssl.webflow.com/5e8b906aff28ce208ad1343c/608046717e6788970817c05d_Intelligence.png?w=750&#038;ssl=1\" alt=\"\" data-recalc-dims=\"1\"/></figure>\n\n\n\n<p>&#x200d;</p>\n\n\n\n<p>On the left hand side we see an operational intelligence stack. The high speed requirements of operational intelligence are met by ensuring the data stays in flight and never hits disk. This is made possible with a combination of Kafka, a streaming processing engine like Flink, and Apache Druid. This is not achievable with the data lake architecture shown on the right-hand side of our diagram, where data lands in the cloud data lake (S3), is transformed by Spark batch processing jobs, and finally loaded into a data warehouse.&nbsp;</p>\n\n\n\n<p>Regarding the requirement of high frequency, low latency queries at the application layer, data warehouses are simply not optimized for these access patterns.&nbsp; In the best case scenario, a data warehouse is able to achieve low latency queries, but at significantly higher cost per query.&nbsp; Warehouses like Snowflake optimize for low-cost storage, storing data on disk, while OLAP data stores like Apache Druid optimize for low-cost queries, storing data mostly in memory.</p>\n\n\n\n<p>Retrofitting an existing business intelligence stack for operational intelligence capabilities will deliver lower performance at a higher cost; while these costs may not be apparent at small scale, at large scale they can become unsustainable.</p>\n\n\n\n<h2>Synergies between operational and business intelligence</h2>\n\n\n\n<p>While the illustration above shows operational and business intelligence as parallel, independent technology stacks, the reality is that the most successful data architectures intertwine these.&nbsp; Traditional business intelligence applications such as Looker and Tableau can benefit from the performance gains offered by the data stores favored by operational intelligence stacks.&nbsp; Similarly, operational intelligence stacks can benefit from the cost efficiencies of batch processing, particularly when doing historical restatements.</p>\n\n\n\n<p>As data infrastructure technologies evolve, it’s uncertain whether a single stack will emerge to serve both operational and business intelligence use cases, or whether these stacks will diverge further.&nbsp; In the present, however, the experiences of the world’s leading digital companies indicate that the era of operational intelligence has dawned and will shine for many years to come.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://medriscoll.com/2021/05/01/operational-intelligence-and-the-new-frontier-of-data/\">Operational intelligence and the new frontier of data</a> appeared first on <a rel=\"nofollow\" href=\"https://medriscoll.com\">m. e. driscoll</a>.</p>\n",
  "wfw:commentRss": "https://medriscoll.com/2021/05/01/operational-intelligence-and-the-new-frontier-of-data/feed/",
  "slash:comments": 0,
  "post-id": 216
}