{
  "title": "Engineers develop a new kind of shape-memory material",
  "link": "https://news.mit.edu/2022/shape-memory-material-ceramic-1005",
  "description": "The ceramic-based material could be used for highly efficient actuators for aircraft or other uses, with minimal moving parts.",
  "pubDate": "Wed, 05 Oct 2022 11:00:00 -0400",
  "guid": "https://news.mit.edu/2022/shape-memory-material-ceramic-1005",
  "dc:creator": "David L. Chandler | MIT News Office",
  "content:encoded": "<div>\n<p>Shape-memory metals, which can revert from one shape to a different one simply by being warmed or otherwise triggered, have been useful in a variety of applications, as actuators that can control the movement of various devices. Now, the discovery of a new category of shape-memory materials made of ceramic rather than of metal could open up a new range of applications, especially for high-temperature settings, such as actuators inside a jet engine or a deep borehole.</p>\n\n<p></p>\n\n<p>The new findings were reported today in the journal <em>Nature</em>, in a paper by former doctoral student Edward Pang PhD ’21 and professors Gregory Olson and Christopher Schuh, all in MIT’s Department of Materials Science and Engineering.</p>\n\n<p></p>\n\n<p>Shape-memory materials, Schuh explains, have two distinct shapes, and can switch back and forth between them. They can be easily triggered by temperature, mechanical stress, or electric or magnetic fields, to change shape in a way that exerts force, he says.</p>\n\n<p></p>\n\n<p>“They are interesting materials because they’re sort of like a solid-state piston,” he says — in other words, a device that can push against something. But while a piston is an assembly of many parts, a “shape-memory material is a solid-state material that does all of that. It doesn’t need a system. It doesn’t need many parts. It’s just a material, and it changes its shape spontaneously. It can do work. So, it’s interesting as a ‘smart material,’” he says.</p>\n\n<p></p>\n\n<p>Shape-memory metals have long been used as simple actuators in a variety of devices but are limited by the achievable service temperatures of the metals used, usually a few hundred degrees Celsius at most. Ceramics can withstand much higher temperatures, sometimes up to thousands of degrees, but are known for their brittleness. Now, the MIT team has found a way to overcome that and produce a ceramic material that can actuate without accumulating damage, thus making it possible for it to function reliably as a shape-memory material through many cycles of use.</p>\n\n<p></p>\n\n<p>“The shape-memory materials that are out there in the world, they’re all metal,” says Schuh. “When you change a material’s shape down at the atomic level, there’s a whole lot of damage that can be created. Atoms have to reshuffle and change their structure. And as atoms are moving and reshuffling, it’s sort of easy to get them in the wrong spots and create defects and damage the material, which leads them to fatigue and eventually fall apart.”</p>\n\n<p></p>\n\n<p>He adds that “you end up with materials that can deform a few times, but then eventually they degrade and they can fall apart. And because metals are so ductile, they’re a little more damage resistant, and so the field has really focused on metals because when a metal is damaged on the inside, it can tolerate it.”</p>\n\n<p></p>\n\n<p>Ceramics, by contrast, don’t tolerate damage well at all, and normally don’t bend but fracture. Zirconia is one that is known to have a shape-memory property, but it accumulates damage very easily during a shape memory cycle — a property measured as high hysteresis. “What we wanted to do with this work was design a new ceramic and specifically target that hysteresis. We wanted to design a ceramic where the [shape] transformation is somehow still gigantic: We want to do a lot of work. But internally, at the atomic scale, it’s more gentle.”</p>\n\n<p></p>\n\n<p>Schuh explains that Pang, who led the work, “took all of the modern tools of science, everything you can name — computational thermodynamics, phase transformation physics, crystallographic calculations, machine learning — and he put all these tools together in a totally new way” in order to solve the problem of creating such a material.</p>\n\n<p></p>\n\n<p>The result was a new variation of zirconia. “Basically, it’s zirconia,” Schuh says. “It looks and smells and tastes just like zirconia that people already know and use, including like cubic zirconia in jewelry.” But some atoms of different elements have been introduced into its structure in a way that alters some of its properties. These elements “dissolve into the lattice, and they sculpt it, and they change that transformation, they make it more gentle at the atomic scale.”</p>\n\n<p></p>\n\n<p>The hysteresis changed so dramatically that it now resembles that of metals, Schuh says. “That was a huge, huge change — we’re talking about a factor of 10.” And the deformation that the material can achieve amounts to about 10 percent, meaning that a rod of this material could get 10 percent longer when triggered — enough to do significant work.</p>\n\n<p></p>\n\n<p>One common application of shape-memory materials is relief valves, where if a tank of something exceeds a certain critical temperature, the valve is triggered by that heat, automatically opening to relieve pressure and prevent explosion. The new ceramic material could now extend that capability to far higher-temperature situations than present materials could handle.</p>\n\n<p></p>\n\n<p>For example, actuators that direct airflow inside a jet engine might be a useful application, Pang says. While the overall environment there is hot, there are various channels of airflow being controlled, so those flows could be used to trigger a shape-memory ceramic by directing cooler or hotter air on the device as needed.</p>\n\n<p></p>\n\n<p>Today, shape-memory ceramics that exist “are sort of a laboratory curiosity,” because they fall apart after a few cycles, Schuh says. “This is a step in the direction of making something that can reproducibly and reliably operate many, many times in service.”</p>\n\n<p></p>\n\n<p>The team plans to continue exploring the material, finding ways to produce it in bigger batches and more complex shapes, and testing its ability to withstand many cycles of transformation.</p>\n\n<p></p>\n\n<p>What attracted him to this project in the first place, Schuh says, is its potential for broad applications. “There are things we do with complex mechanical systems that have lots of parts and assemblies, and the idea that you can replace a complicated package of things with a single material that has the functionality built in at the atomic scale — to me, that’s attractive because it makes large, complicated things into small, simple things. In some ways it’s like replacing vacuum tubes with transistors.”</p>\n\n<p></p>\n\n<p>While it’s hard to predict the areas where this material will find its first practical uses, Schuh says that, for example, “it’s very hard to scale down a hydraulic piston. It’s hard to make that on the micro scale.” But now, “the idea that you have a solid-state version of that at very small scales — I’ve always felt there are a lot of applications for microscale motions. Microrobots in small places, lab-on-a-chip valves, lots of small things that need actuation could benefit from smart materials like this.”</p>\n\n<p></p>\n\n<p>These researchers “show how materials science knowledge, sound design principles and creative thinking can be combined to discover materials that would be considered impossible to find otherwise,” says Raymundo Arroyave, a professor of materials science and engineering at Texas A&amp;M University, who was not associated with this work. This work, he says, “is a beautiful demonstration of the power of sound ‘materials science thinking,’ grounded by well-tested materials design principles to demonstrate that shape memory ceramics can have properties that are close to some of the best of their metallic counterparts.”</p>\n\n<p></p>\n\n<p>The work was supported by the U.S. Army Research Office, in part through MIT’s Institute for Soldier Nanotechnologies, and by the U.S. National Science Foundation.</p>\n</div>",
  "media:content": {
    "media:description": "Diagrams show the two different ways that the atomic structure of the shape-memory material, zirconia ceramic, can be configured. An external trigger such as a temperature change can shift the configuration from one shape to the other, changing its dimensions and allowing it to exert pressure or do other work. The background is an electron microscope image of the material, with the two colors indicating the two different configurations.",
    "media:credit": "Image: Edward Pang"
  },
  "category": [
    "Research",
    "Materials science and engineering",
    "Nanoscience and nanotechnology",
    "DMSE",
    "School of Engineering",
    "National Science Foundation (NSF)"
  ]
}