{
  "title": "A Childs Horror! | Best of RGSO",
  "link": "https://audioboom.com/posts/8114231",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1869,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>What do you do when you’re child experiences unexplained sounds in the middle of the night?<br>\nHere is a preview of the story.<br>\n“It started when me and my daughter kept hearing swirling type sounds in the middle of night sometimes in my room, bathroom and sometimes in the living room which was when my daughter would hear it. Neither of us ever had the guts to investigate it. Then one evening I answered a phone call on my cell phone from a co-worker, when I answered the phone there was nobody there. She then called again and said she heard a woman screaming at the top of her lungs in her ear and she thought I was pranking her or something. The next day I saw the same co-worker in a staff meeting and she told me that when the woman screaming on the phone happened, she had a \"flash\" of this really creepy lady with straight black hair and black eyes, and she felt disturbed by it. The same time that I was in this meeting, my daughter was in one of her high school classes and put in her ear buds about to play music on her phone after taking a test, when she says she heard two women screaming in ear. When this happened, she immediately felt feeling of overwhelming dread and sadness. She said it was so overwhelming she started crying and ran out of the classroom.”<br>\n<br>\n\n</div>\n<div>To hear more real ghost stories, become a supporter of our show and get every episode, including our weekly bonus episodes at <a href=\"http://www.ghostpodcast.com\">http://www.ghostpodcast.com</a> or <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>Follow Tony:<br>\nInstagram: <a href=\"http://HTTP://www.instagram.com/tonybrueski\">HTTP://www.instagram.com/tonybrueski</a><br>\nTikToc: <a href=\"https://www.tiktok.com/@tonybrueski\">https://www.tiktok.com/@tonybrueski</a><br>\nFacebook: <a href=\"https://www.facebook.com/tony.brueski\">https://www.facebook.com/tony.brueski</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Sat, 02 Jul 2022 22:27:50 +0000",
  "guid": "tag:audioboom.com,2022-07-02:/posts/8114231",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}