{
  "title": "Exploration of different parameter optimization algorithms within the context of ACTS software framework. (arXiv:2211.00764v2 [hep-ex] UPDATED)",
  "link": "http://arxiv.org/abs/2211.00764",
  "description": "<p>Particle track reconstruction, in which the trajectories of charged particles\nare determined, is a critical and time consuming component of the full event\nreconstruction chain. The underlying software is complex and consists of a\nnumber of mathematically intense algorithms, each dealing with a particular\ntracking sub-process. These algorithms have many input parameters that need to\nbe supplied in advance. However, it is difficult to determine the configuration\nof these parameters that produces the best performance. Currently, the input\nparameter values are decided on the basis of prior experience or by the use of\nbrute force techniques. A parameter optimization approach that is able to\nautomatically tune these parameters for high performance is greatly desirable.\nIn the current work, we explore various machine learning based optimization\nmethods to devise a suitable technique to optimize parameters in the complex\ntrack reconstruction environment. These methods are evaluated on the basis of a\nmetric that targets high efficiency while keeping the duplicate and fake rates\nsmall. We focus on derivative free optimization approaches that can be applied\nto problems involving non-differentiable loss functions. For our studies, we\nconsider the tracking algorithms defined within A Common Tracking Software\n(ACTS) framework. We test our methods using simulated data from ACTS software\ncorresponding to the ACTS Generic detector and the ATLAS ITk detector\ngeometries.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/hep-ex/1/au:+Garg_R/0/1/0/all/0/1\">Rocky Bala Garg</a>, <a href=\"http://arxiv.org/find/hep-ex/1/au:+Hofgard_E/0/1/0/all/0/1\">Elyssa Hofgard</a>, <a href=\"http://arxiv.org/find/hep-ex/1/au:+Tompkins_L/0/1/0/all/0/1\">Lauren Tompkins</a>, <a href=\"http://arxiv.org/find/hep-ex/1/au:+Gray_H/0/1/0/all/0/1\">Heather Gray</a>"
}