{
  "title": "Aluminum Sulfur—Is This How the Future Spells Lithium Ion?",
  "link": "https://spectrum.ieee.org/aluminum-sulfur-batteries-li-ion-s-new-competitor",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/the-three-primary-constituents-of-the-battery-are-aluminum-left-sulfur-center-and-rock-salt.jpg?id=31529084&width=1245&height=700&coordinates=0%2C33%2C0%2C34\"/><br/><br/><p>In a leap toward low-cost batteries for large-scale grid storage, an international team of researchers led by MIT material chemist Donald Sadoway have invented a battery made of aluminum and sulfur, two of the most abundant and low-cost materials in the world. </p><p>The nascent battery already has an energy density comparable to that of today’s lithium-ion batteries at cell level, and should come in at less than a sixth of the cost, the team reported in <em><a href=\"https://www.nature.com/articles/s41586-022-04983-9\" rel=\"noopener noreferrer\" target=\"_blank\">Nature</a> </em>on 24 August. The battery also charges in minutes and is nonflammable thanks to its molten salt electrolyte that does not burn. “You can put a blowtorch to this thing and it won’t catch fire,” says Sadoway.</p><p>Other than storing solar and wind power for the grid, the new battery would be ideal for small-scale residential backup systems and EV charging stations, where they could quickly charge several cars at once. </p><p class=\"pull-quote\">“Lithium as we can see increasingly is the wrong choice. It doesn’t belong in cars and certainly not in grid-level storage. I wanted to make a battery without lithium.”<br/>—Donald Sadoway, MIT</p><p>The need for long-term storage technologies is increasing as the adoption of renewables accelerates around the world. Lithium-ion batteries are much too expensive for that. That’s partly because behind every lithium-ion battery is a convoluted global supply chain fraught with environmental and <a href=\"https://www.business-humanrights.org/en/from-us/briefings/transition-minerals-sector-case-studies/human-rights-in-the-mineral-supply-chains-of-electric-vehicles/\" target=\"_blank\">human rights</a> issues, which has led many to look for the cobalt, lithium, manganese, and nickel needed for lithium batteries on the <a href=\"https://spectrum.ieee.org/the-seabed-solution\" target=\"_self\">ocean floor</a>, which creates its own ecological <a href=\"https://spectrum.ieee.org/mine-ocean-battery-metal-shortage\" target=\"_self\">dilemma</a>.</p><p>“Batteries we use in America should be invented in America, sourced in America, and made in America,” Sadoway says. “Until then you’re going to be beholden to China, the Democratic Republic of Congo, Chile, and others. Lithium as we can see increasingly is the wrong choice. It doesn’t belong in cars and certainly not in grid-level storage. I wanted to make a battery without lithium.”<br/> </p><p>He and his team chose aluminum, the most abundant metal on Earth, as one electrode. As a bookend electrode, they picked sulfur, the cheapest nonmetal. Then came time to search for the right electrolyte. They avoided the flammable organic liquid electrolytes used in lithium-ion batteries and chose a <a href=\"https://link.springer.com/chapter/10.1007/978-94-009-3863-2_16\" target=\"_blank\">chloro-aluminate molten salt</a>, which needs to be a liquid to be activated. In the paper, the researchers report a battery that operates at the salt’s melting point of 110 °C for operation. But he says they have already brought that melting point down to 65 °C and can see ways to get to room-temperature operation. </p><p class=\"pull-quote\">“Lithium ion has had 30 years of industrial optimization. This is brand new. I’m confident that what we have coming out of the starting gate is competitive.”<br/>—Donald Sadoway, MIT</p><p>Besides being nonflammable, the electrolytes prevent the buildup of metal dendrites on the electrode that can cause shorting, and allows for rapid charging. In the laboratory, the battery cells underwent hundreds of charging cycles at very high rates without aluminum dendrite formation.</p><p>The battery already shows an energy density of almost 530 watt-hours per liter, on par with common lithium-ion chemistry. And it’s still early stages, Sadoway says, so improvements are very likely. “I would remind you, when you compare aluminum sulfur today with lithium ion, a fair comparison would be to compare with lithium ion in 1993,” he says. “Lithium ion has had 30 years of industrial optimization. This is brand new. I’m confident that what we have coming out of the starting gate is competitive.”</p><p>For the “opening act,” he says, small-scale storage systems with capacities of tens of kilowatt-hours seems like a perfect fit for the aluminum-sulfur battery. Competitors like <a href=\"https://spectrum.ieee.org/a-liquid-metal-battery-for-grid-storage-nears-production\" target=\"_self\">liquid metal batteries</a> such as the ones <a href=\"https://www.cbsnews.com/boston/news/donald-sadoway-ambri-liquid-metal-battery-mit/\" rel=\"noopener noreferrer\" target=\"_blank\">soon to be delivered</a> by Ambri, a startup Sadoway cofounded in 2010, require much higher temperatures of 500 °C and make sense for large systems with power capacities of tens of megawatt-hours, he says. “Aluminum sulfur is a scale-down problem, not a scale-up problem. It would be ideal for a single-family home. You’d be able to have a 50- to 100-kilowatt-hour pack to get you through the night and a couple days of cloudy skies.”</p><p>Sadoway and Luis Ortiz, a cofounder of Ambri, have already created a new spinoff company called Avanti, which has licensed the patents for the new battery system. They now plan to scale up the technology. </p><p>For now, he says this research paper is a reminder that there are better, cheaper, safer technologies to work on than lithium ion if people are willing to invest the time and money. Big car companies are putting millions into building gigafactories for lithium batteries, but Sadoway compares lithium-ion technology today to vacuum tubes back in the mid-1950s—a technology whose time will soon be over. </p><p>“Imagine you’re in 1954, and you’re about to build a gigafactory for vacuum tubes, and someone lifts a curtain and there’s the transistor,” he says. “Well, you’re going to have an ‘Oh, shit!’ moment.”</p>",
  "pubDate": "Wed, 07 Sep 2022 15:13:09 +0000",
  "guid": "https://spectrum.ieee.org/aluminum-sulfur-batteries-li-ion-s-new-competitor",
  "category": [
    "Batteries",
    "Lithium-ion batteries",
    "Sulfur battery",
    "Energy storage",
    "Grid storage",
    "Aluminum-ion"
  ],
  "dc:creator": "Prachi Patel",
  "media:content": ""
}