{
  "id": "yt:video:Vr_hVW6TLsc",
  "yt:videoId": "Vr_hVW6TLsc",
  "yt:channelId": "UC3WoPalcYf7d_x4DC2BXAfw",
  "title": "Cyberpunk 2077 is back... thanks to anime?",
  "link": "",
  "author": {
    "name": "jayvee",
    "uri": "https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw"
  },
  "published": "2022-09-28T17:00:15+00:00",
  "updated": "2022-10-02T15:24:10+00:00",
  "media:group": {
    "media:title": "Cyberpunk 2077 is back... thanks to anime?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This video is sponsored by Outplayed. Download the app free here: https://www.influencerlink.org/SHDyy #sponsored\n\nSubscribe to jayveeonYT for more videos!\n► ​https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw?sub_confirmation=1\n\nWatch more videos on jayveeonYT! \n► https://youtube.com/playlist?list=PLGdQpBjWmxqVuXKKNVcccm81dpDwsJPvH\n\n- - - - - - - - - - - - - - - -\n\nFollow jayveeonYT!\n► Twitter: https://twitter.com/jayveeonYT​\n► Discord: https://discord.gg/jayveeonyt\n► Instagram: https://www.instagram.com/jayvee.yt/​\n\nWatch More jayveeonYT!\nLatest Uploads:  \n\nSo I ranked ALL the AC games...\n► https://youtu.be/Z9_Tb_TcPYI\n\nSo I played AC Rogue in 2021...\n► https://youtu.be/LUmOm2whuvY\n\nSo I played AC Syndicate in 2021...\n► https://youtu.be/swJN5NO2gJ8\n\nSo I played AC Unity in 2021...\n► https://youtu.be/UjTt4KtAZO8\n\nSo I played AC Odyssey in 2021…\n► https://youtu.be/guMObmtv54s\n\n- - - - - - - - - - - - - - - -\n\nAbout jayveeonYT:\nNews, reactions, and gameplay of all the biggest RPGs, open world, and action-adventure video games! Jayvee covers Assassin's Creed, Cyberpunk, Fallout, and more!\n\n- - - - - - - - - - - - - - - -\n\nCyberpunk 2077 is an action role-playing video game developed and published by CD Projekt. The story takes place in Night City, an open world set in the Cyberpunk universe. Players assume the first-person perspective of a customisable mercenary known as V, who can acquire skills in hacking and machinery with options for melee and ranged combat.\n\nThe game was developed using the REDengine 4 by a team of around 500 people, exceeding the number that worked on the studio's previous game The Witcher 3: Wild Hunt (2015). CD Projekt launched a new division in Wrocław, Poland, and partnered with Digital Scapes, Nvidia, QLOC, and Jali Research to aid the production. Cyberpunk creator Mike Pondsmith was a consultant, and actor Keanu Reeves has a starring role. The original score was led by Marcin Przybyłowicz, featuring the contributions of several licensed artists.\n\nAfter years of anticipation, CD Projekt released Cyberpunk 2077 for PlayStation 4, Stadia, Windows, and Xbox One on 10 December 2020 followed by a next-gen patch for the PlayStation 5 and Xbox Series X/S versions on 15 February 2022. It received praise from critics for its narrative, setting, and graphics, although some of its gameplay elements received mixed responses, while its themes and representation of transgender characters received some criticism. It was also widely criticized for bugs, particularly in the console versions, which suffered from performance problems; Sony removed it from the PlayStation Store from December 2020 to June 2021 while CD Projekt rectified some of the problems. CD Projekt became subject to investigations and class-action lawsuits for their perceived attempts at downplaying the severity of the technical problems before release; these were ultimately cleared with a settlement of US$1.85 million.\n\nCyberpunk 2077 is an action role-playing game[1] played in a first-person perspective as V,[2] a mercenary whose voice,[3] face, hairstyles, body type and modifications, background, and clothing are customisable. Stat categories—Body, Intelligence, Reflexes, Technical, and Cool—are influenced by the character classes that players assume, which are NetRunner (hacking), Techie (machinery), and Solo (combat). V must consult a \"ripperdoc\" to upgrade and purchase cyberware implants; black markets offer military-grade abilities.[4] The rarity of any given equipment is shown by a coloured tier system.[5] V can take cover, aim, run, jump, double jump, and slide.[6][7] Melee strikes can be dealt with close-combat weapons.[8][9] There are three types of ranged weapons, all of which can be customised and modified—Power (standard), Tech (which penetrate walls and enemies), and Smart (with homing bullets).[10][11] Ranged weapons are equipped to ricochet bullets in a target's direction and slow them down in bullet time. Four types of damage can be inflicted and resisted—Physical, Thermal, EMP, and Chemical.[12][13][14] Weapon use increases accuracy and reloading speed, which are manifested in character animations.[15] Gunsmiths repair and upgrade weapons.[8] The game can be completed without killing anyone,[16] with non-lethal options for weapons and cyberware.[17]\n\nThe open world metropolis of Night City consists of six regions; the corporate City Centre, immigrant-inhabited Watson, luxurious Westbrook, suburban Heywood, gang-infested Pacifica, and industrial Santo Domingo. Its surrounding area, the Badlands, can also be explored. V navigates these locations on foot and in vehicles, which are subject to either a third- or first-person view.[4] Pedestrians are vulnerable to vehicular collisions.[11] Depending on the location, law enforcement may be alerted if V commits a crime.[18][19]\n\n#gaming #jayvee #cyberpunk",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}