{
  "title": "Episode 91: The Psychology of Effective Meetings",
  "pubDate": "Tue, 14 Apr 2009 02:52:05 +0000",
  "guid": "episode-91-the-psychology-of-effective-meetings",
  "link": "http://www.thepsychfiles.com/2009/04/13/episode-91-the-psychology-of-effective-meetings/",
  "itunes:image": "",
  "description": "Do you hate meetings as much as I do? How do you make them work?  Business people and students often hate meetings and group projects because it's hard to get everyone to participate and it's hard to just get things done.  In this episode of The Psych Files I show the many connections between a typical Introductory Psychology textbook and the everyday event of a business or group meeting.  In the end I talk with professional project manager April Montana who shares with you some of her secrets to making group members get things done.",
  "content:encoded": "Do you hate meetings as much as I do? How do you make them work?  Business people and students often hate meetings and group projects because it's hard to get everyone to participate and it's hard to just get things done.  In this episode of The Psych Files I show the many connections between a typical Introductory Psychology textbook and the everyday event of a business or group meeting.  In the end I talk with professional project manager April Montana who shares with you some of her secrets to making group members get things done.",
  "enclosure": "",
  "itunes:duration": "33:48",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,lecture,meetings,Effective",
  "itunes:subtitle": "Do you hate meetings as much as I do? How do you make them work? In this episode of The Psych Files I talk with professional project manager April Montana who shares with you some of her secrets to making group members get things done.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Do you hate meetings as much as I do? How do you make them work? Business people and students often hate meetings and group projects because it's hard to get everyone to participate and it's hard to just get things done. In this episode of The Psych Files I show the many connections between a typical Introductory Psychology textbook and the everyday event of a business or group meeting. In the end I talk with professional project manager April Montana who shares with you some of her secrets to making group members get things done."
}