{
  "id": "yt:video:CqLukXm7nAc",
  "yt:videoId": "CqLukXm7nAc",
  "yt:channelId": "UCRRr_xrOm66qaigIbwFLvbQ",
  "title": "Three Arguments to Avert Climate Despair",
  "link": "",
  "author": {
    "name": "Simon Clark",
    "uri": "https://www.youtube.com/channel/UCRRr_xrOm66qaigIbwFLvbQ"
  },
  "published": "2022-06-11T10:01:15+00:00",
  "updated": "2022-08-19T15:36:38+00:00",
  "media:group": {
    "media:title": "Three Arguments to Avert Climate Despair",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "How I keep hope alive for the future in a time of climate change. Watch Dream the Future on CuriosityStream and get access to Nebula: https://www.curiositystream.com/simonclark\n\nAs someone who thinks a lot about climate change, I find it difficult sometimes to stay positive, and it seems I'm not alone. Many people suffer from climate despair, believing that we're just too far gone and that the planet is screwed (insert more forceful expletive if you like). While I can understand why people think this, I don't agree - and in this video I talk about why it's not too late for action, and why there's a lot to be said for not giving up.\n\nAlso, I had an absolutely horrific cold while recording this one, sorry.\n\nMy climate change videos: https://www.youtube.com/playlist?list=PLiZiIJMDh4yld3HJoZVqQoVtEWzv1Epl0\n\nYou can support the channel by becoming a patron at http://www.patreon.com/simonoxfphys\n\nCheck out my website! https://www.simonoxfphys.com/\n\n---------- II ----------\n\nMy twitter - http://www.twitter.com/simonoxfphys\nMy facebook - http://www.facebook.com/youtubesimon\nMy insta - http://www.instagram.com/simonoxfphys\nMy goodreads - http://www.goodreads.com/simonoxfphys\n\n---------- II ----------\n\nMusic by Epidemic Sound: http://epidemicsound.com\nSome stock footage from Getty.\nEdited by Luke Negus.\n\nHow do I not give up in the face of climate change? How to avoid climate despair? What is climate despair? Is there any hope in climate change? In this short video essay I talk about the three things that keep me going and not give in to climate despair: the nature of the problem, the nature of the response, and why it makes economic sense to fight climate change. As I say in the video, this isn't to say that I'm hopeful we'll avoid devastating climate change this century: but I'm not hopeless.\n\nHuge thanks to my supporters on Patreon: InDefenseOfToucans, Savannah, Jimmy Lee, Simon Stelling, Gabriele Siino, Bjorn Bakker, Ieuan Williams, Candace H, Tom Malcolm, Marcus Bosshard, Andrew Knop, Shab Kumar, Brady Johnston, Liat Khitman, Jesper Norsted, Kent & Krista Halloran, Rapssack, Kevin O'Connor, Timo Kerremans, Thines Ganeshamoorthy, Ashley Wilkins, Michael Parmenter, Samuel Baumgartner, Dan Sherman, ST0RMW1NG 1, Adrian Sand, Morten Engsvang, Josh Schiager, Farsight101, K.L, poundedjam, fourthdwarf, Daan Sneep, Felix Freiberger, Chris Field, Robert Connell, ChemMentat, Kolbrandr, , Sebastain Graf, Dan Nelson, Shane O'Brien, Alex, Fujia Li, Will Tolley, Cody VanZandt, Jesper Koed, Jonathan Craske, Albrecht Striffler, Igor Francetic, Jack Troup, SexyCaveman , Sean Richards, Kedar , Omar Miranda, Alastair Fortune, bitreign33 , Mat Allen, Anne Smith, Rafaela Corrêa Pereira, Colin J. Brown, Princess Andromeda, Mach_D, BenDent, Thusto , Andy Hartley, Lachlan Woods, Dan Hanvey, Simon Donkers, Kodzo , James Bridges, Liam , Andrea De Mezzo, Wendover Productions, Kendra Johnson.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}