{
  "title": "253: Sleep Hacks & Tools with Scott Donnell",
  "pubDate": "Mon, 15 Nov 2021 19:52:24 +0000",
  "guid": "8fdb19b3-4340-416b-b1f3-d80749bef720",
  "link": "https://sites.libsyn.com/94610/253-sleep-hacks-tools-with-scott-donnell",
  "itunes:image": "",
  "description": "<p>How do you improve your sleep?<br /> <br /> Sleep is one of the most important things you can do to take care of your brain. It cleans out damaging beta-amyloid plaques, converts short to long-term memories, and boosts your creativity while dreaming. But getting quality sleep can be challenging when you’re stressed, burned out, or overwhelmed.</p> <p>Today, I’m talking to Scott Donnell. He’s the founder of Hapbee, a company that makes a wearable device that lets you choose how to feel. Using state-of-the-art technology, Hapbee helps with everything from focus to sleep.</p> <p>Creating good sleep habits is vital to getting a good night’s sleep. Listen in as Scott share’s his favorite sleep tips and how Hapbee technology can help you achieve deeper, more restful sleep.</p> <p>To learn more about Hapbee, go to hapbee.com/kwik </p>",
  "content:encoded": "<p>How do you improve your sleep?  Sleep is one of the most important things you can do to take care of your brain. It cleans out damaging beta-amyloid plaques, converts short to long-term memories, and boosts your creativity while dreaming. But getting quality sleep can be challenging when you’re stressed, burned out, or overwhelmed.</p> <p>Today, I’m talking to Scott Donnell. He’s the founder of Hapbee, a company that makes a wearable device that lets you choose how to feel. Using state-of-the-art technology, Hapbee helps with everything from focus to sleep.</p> <p>Creating good sleep habits is vital to getting a good night’s sleep. Listen in as Scott share’s his favorite sleep tips and how Hapbee technology can help you achieve deeper, more restful sleep.</p> <p>To learn more about Hapbee, go to hapbee.com/kwik </p>",
  "enclosure": "",
  "itunes:duration": "19:34",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "How do you improve your sleep?  Sleep is one of the most important things you can do to take care of your brain. It cleans out damaging beta-amyloid plaques, converts short to long-term memories, and boosts your creativity while dreaming. But getting...",
  "itunes:episodeType": "full"
}