{
  "title": "TU109: THIS is Resilience in Action With Guest Alphanso Appleton",
  "link": "https://therapistuncensored.com/episodes/tu109-this-is-resilience-in-action-with-guest-alphanso-appleton/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu109-this-is-resilience-in-action-with-guest-alphanso-appleton",
  "pubDate": "Fri, 22 Nov 2019 12:00:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7779",
  "description": "Resilience in real-life from a non-Western perspective. (Cover photo, Appleton took responsibility for feeding kids in his village by diving and spearing food from the sea.)\n\n“And if there’s any other person that is going through mental health problems or a very hard time in their life, or they have been through something really bad… I just want them to know that they’re not alone.” Alphanso Appleton\nIn This Episode of Therapist Uncensored on Trauma and Resilience,\nAlphanso Kwame Appleton, a Liberian native, shares his experiences of growing up in a country devastated by civil war, living through the Ebola epidemic, and tragically losing his young daughter. Despite these repeated experiences of trauma, he is healing and has found purpose in his life. This is an incredible story that absolutely captures what resilience looks like and we are pleased that his recovery did not rely on traditional Western approaches. We have so much to learn.\n\nInterview by Sue Marriott.\nMeeting Alphonso\n\n \tMeeting in Liberia through Strongheart and by happenstance, through the work of Dan Siegel.\n \tMentoring youth\n \tSurfing\n \tPhotography\n\nLife in Liberia\n\n \tThe Liberian Civil War\n \tEscaping to Monrovia\n \tChild Soldiers\n \tLack of education\n\n“Iron Lady”\n\n \tHow the love and faith of Alphanso’s grandmother, whom he describes as an\n \t“Iron Lady”, protected him from rebel recruitment of child soldiers\n\nThe Effects of Lack of Education\n\n \tEffects on Society\n \tEffect on healthcare industry – and him personally regarding the loss of his daughter\n\nThe Ebola Epidemic\n\n \tThe lack of belief and understanding that Ebola was real\n \tThe spread of Ebola\n \tAlphanso’s photo that went viral thanking science for the Ebola vaccine\n \t“…maybe my photo will help young Liberians know science helps the world and become scientists too.” – Photographer Alphanso Appleton\n\nPersonal Tragedy\n\n \tThe loss of Alphanso’s 18 month old daughter, Lisa.\n\nAlphanso’s Healing Journey\n\n \tFaith\n \tStrongheart – learning a meditation practice\n \tSurfing\n\nThe Universal Language of Photography\n\n \tResilience through expression of emotion through photos\n \t“The Liberia Project” by Apartial featuring Alphanso Appleton\n \t“Portraits of Progress” by Alphanso Appleton\n\nMoving Forward\n\n \tCurrent and future endeavors\n \tMisconceptions about Africa\n \tWords of wisdom\n\n“Overall, it’s just finding something you love – something you love doing- something that brings you joy; something that makes you happy. Because that was a really key part of my transformation. That was a really key part of my healing.” Alphanso Appleton\nOther episodes you may enjoy:\nTU91: Curiosity – One of the Most Powerful Tools For Connection\n\nTU33: Adverse Childhood Experiences: A Roadmap To Understanding And Treatment\nResources\n“Alphanso Appleton: A Story of Becoming”\n\nThe Making of Child Surfers, Not Child Soldiers\n\nArticle in Global Citizen – Surfers Paint Liberia\n\nStrongminds.org\n\nAlphanso’s contact information alphanso19@gmail.com\n\n \nWho doesn’t love special offers?\n\nOur advanced course on attachment and neuroscience has been recently released and is now available for a discounted price! While this course is aimed toward clinicians (CE’s available!), all who are interested in deepening security in yourselves and your relationships are welcome to participate. 4 hours of curated content!\nCLICK HERE FOR MORE INFORMATION\nWe’re on Patreon! \nJoin our exclusive community of Therapist Uncensored Neuronerds for as little as $5 a month!\n\nIncrease your access, join our community, get discounts on our courses and get exclusive content.\n\nHelp us create a ripple of security by supporting us in freely sharing the science of relationships around the globe!\n\nWe have pledged 50% of all corporate profits & merch sales (very fun swag!) to organizations that support mental health access to those traditionally left out of mainstream healthcare.",
  "enclosure": "",
  "itunes:subtitle": "Resilience in real-life from a non-Western perspective. (Cover photo, Appleton took responsibility for feeding kids in his village by diving and spearing food from the sea.) - “And if there’s any other person that is going through mental health proble...",
  "itunes:summary": "One man&apos;s incredible story from unthinkable trauma to healing and recovery using non-Western approaches.  Alphanso Appleton&apos;s story of civil war, Ebola and tragic loss will bring trauma are resilience into sharp focus - you will be moved by this young man&apos;s story.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "34:46"
}