{
  "title": "iRobot Crams Mop and Vacuum Into Newest Roomba",
  "link": "https://spectrum.ieee.org/irobot-roomba-combo-j7-vacuum",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-round-black-robot-vacuum-with-a-mopping-pad-that-can-move-from-below-the-robot-to-above-the-robot-and-out-of-the-way.jpg?id=31828592&width=1200&height=800&coordinates=32%2C0%2C32%2C0\"/><br/><br/><p>\n\tRobots tend to do best when you optimize them for a single, specific task. This is especially true for home robots, which need to be low cost(ish) as well as robust enough to be effective in whatever home they find themselves in. iRobot has had this formula pretty well nailed down with its family of vacuuming robots for nearly two decades, but they’ve also had another family of floor care robots that have been somewhat neglected recently: \n\t<a href=\"https://www.irobot.com/en_US/braava.html\" target=\"_blank\">mopping robots</a>.\n</p><p>\n\tToday, \n\t<a href=\"https://www.irobot.com/en_US/roomba-combo-j7plus-robot-vacuum-and-mop/C755020.html\" target=\"_blank\">iRobot is announcing the US $1,100 Roomba Combo j7+</a>, which stuffs both a dry vacuum and a wet mop into the body of a Roomba j7. While very much not the first or only combo floor-cleaning robot on the market, the Combo j7+ uses a unique and very satisfying mechanical system to make sure that your carpets stay clean and dry while giving your hard floors the moist buffing that they so desperately need.\n</p><hr/><p>\n\tWhile iRobot is now best known for its vacuums, a decade ago \n\t<a href=\"https://spectrum.ieee.org/irobot-scooba-450-is-the-most-effective-way-yet-to-avoid-cleaning-your-floors\" target=\"_self\">Scooba floor cleaning robots</a> were right up there with Roombas as a focus for the company, featuring tanks for cleaning solution and dirty water and combining vacuuming and scrubbing for non-carpeted floors. <a href=\"https://www.youtube.com/watch?v=_g-na7d-hEs\" rel=\"noopener noreferrer\" target=\"_blank\">They were impressive robots</a>, but they were quite expensive and relatively labor-intensive for users, since you needed to fill and empty them with every cycle.\n</p><p>\n\tiRobot eventually phased out <a href=\"https://spectrum.ieee.org/review-irobot-scooba-230\" target=\"_self\">the Scooba</a> for the Braava, <a href=\"https://spectrum.ieee.org/irobot-braava-jet-mopping-robot\" target=\"_blank\">which used mopping pads</a> instead of a vacuuming system and was way cheaper. But Braavas aren’t vacuums, meaning that they work best when the floor that they’re supposed to clean is vacuumed first. <a href=\"https://spectrum.ieee.org/irobot-completely-redesigns-its-floor-care-robots-with-new-m6-and-s9\" target=\"_self\">You can coordinate a Braava with a Roomba to do exactly that</a>, but it’s perhaps not the most elegant way of doing things, even if it does allow you to keep your robots well-optimized for single tasks. And the Braava is showing its age, without any of the <a href=\"https://spectrum.ieee.org/irobot-roomba-j7\" target=\"_self\">clever sensing that the newest Roombas use to intelligently navigate around your home and life</a>.\n</p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"92307296c7de4e090d0c73d3baf60985\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/S6V8kGU28Ng?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n</p><p>\n\tThe Combo j7+ essentially combines the mopping capabilities of a Braava with the vacuuming smarts of a Roomba j7. Frankly, I have no idea why iRobot didn’t name this thing something a bit more distinctive, because the regular j7 Roomba still exists, and the “+” simply refers to the fact that it comes with a self-emptying Clean Base. The “Combo j7+”, meanwhile, has completely different hardware taking up the back half of the robot, and isn’t (as the name sort of implies) a regular j7 with an add-on or something like that. Anyway, for brevity, I’m just going to call this new combo Roomba the j7C until iRobot comes up with something better.\n</p><p>\n\tNow, the j7C is absolutely not the first mop/vacuum robot out there, but the way most others tackle the transition from hard floors (mop appropriate) and carpet (not mop appropriate) is to raise the mopping attachment up into the body of the robot a couple of millimeters when on carpet to keep the mop from dragging across the carpet and making it wet and gross. This is certainly better than \n\t<em>not</em> lifting the mop up at all, but iRobot says that it still “paints” wet drippy drops all over the place. Not ideal.\n</p><p class=\"pull-quote\">\n\t“Why would someone sell a carpet-painting robot that applies mud to your carpet in a systematic fashion? It’s a fundamentally flawed concept that doesn’t work. iRobot, being who we are, said “here’s an impossible challenge, let’s go do it because it should be fun.” \n\t<br/>\n\t—Colin Angle, iRobot CEO\n\t<br/>\n</p><p>\n\tiRobot’s solution is, honestly, more complex than I would have thought to be practical for a Roomba—the mop pad is attached to the robot through two actuated metal arms, which can move the entire thing from the bottom of the robot to the top, placing the body of the robot in between any droppy drips and the carpet:\n\t<br/>\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Animated gif showing operation of mopping pad, moving on arms from beneath the robot to above\" class=\"rm-shortcode\" data-rm-shortcode-id=\"b1f206fb135757f566ea9996f54a3320\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"16b04\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/animated-gif-showing-operation-of-mopping-pad-moving-on-arms-from-beneath-the-robot-to-above.gif?id=31828618&width=980\"/>\n</p><p>\n\tCool, right? There are belt drives in there to move the arms, making sure that the motion is both smooth enough and powerful enough to exert adequate pressure on the floor when the pad is under the robot. And if you look closely, you’ll see the skins on the sides of the robot open out slightly to give the arms space to move up and down.\n</p><p>\n\tThe j7C vacuums and mops in one single pass. On hard floors, water (or cleaning solution) is continuously sprayed underneath the robot from ports just behind the vacuuming system, and the mopping pad wipes it right up. When the robot detects carpet (which it does through ultrasonic sensors, not visually like the animation suggests), it pauses to lift the pad up, and then vacuums the carpet just like a regular j7 Roomba. You can remove and clean the pad of course, which is made easier to do since you don’t have to get under the robot to do it.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Underneath view of the robot, showing the cleaning system of rolling rubber brushes and a mopping pad behind them\" class=\"rm-shortcode\" data-rm-shortcode-id=\"ef651ca2caf54f52535fa1a18f98efb1\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"7c69a\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/underneath-view-of-the-robot-showing-the-cleaning-system-of-rolling-rubber-brushes-and-a-mopping-pad-behind-them.jpg?id=31828620&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Just aft of the brushes, three black nozzles dispense water in advance of the mopping pad.</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">iRobot</small>\n</p><p>\n\tSince all of this happens in the same footprint as the original j7, there are some compromises to make room for the mopping system. This mostly happens with the bin, which now accommodates a water reservoir, taking up some of the space where you’d otherwise find dirt. It’s not a huge deal, though, because Roombas with the automatic Clean Base (including the j7C) will empty their own bins when they get full and then resume vacuuming where they left off. So, that may happen an extra time or two during the j7C’s cleaning cycle, but it’s not something the user has to worry about.\n</p><p>\n\tWhat the user does have to worry about, unfortunately, is the water reservoir. You access it by removing the j7C’s bin, and then you can fill the reservoir at a sink. One fill is enough for a thousand square feet of coverage on eco-mode, and there’s also normal mode and a double-pass mode that you can select in the app for dirtier floors.\n</p><p>\n\tThis water-filling process is easy, but it’s a user-dependent step, which sadly breaks the magic of the automatic dirt-emptying Roombas where you basically don’t have to think about them for weeks at a time. Water isn’t required, at least, and if the robot detects an empty reservoir, it’ll just default to vacuuming everything instead of mopping. Other companies have approached this problem with docks that include water reservoirs able to automatically refill a robot multiple times, and I have some faith that iRobot is already working on a way of doing this more elegantly.\n</p><p>\n\tPersonally, I’m hoping for a water shuttle robot: some little bot with a small tank that zips back and forth between the dock and, say, a water dispenser hooked into the toilet fill line in your bathroom to provide refills on demand.\n</p><h3>Q&A With iRobot CEO Colin Angle</h3><br/><p>\n\tWe asked iRobot CEO Colin Angle to explain why the company feels that this is the right approach to a hybrid mopping and vacuuming robot, and how the heck it came up with this system in the first place.\n</p><p>\n<strong>One of the greatest things about the Roomba is that it does one thing very well. Often with robots, trying to make more of a generalist robot results in significant compromises. What made you decide to shift from dedicated vacuuming and mopping robots, to one robot that does both tasks?</strong>\n</p><p>\n<strong>Angle: </strong>The short answer is that we finally figured out how to do it. We’re not the first company with a two-in-one robot on the market. What took us so long? Well, it took us this long to solve the problem.\n</p><p>\n\tThere’s a very interesting history of mopping robots at iRobot, where we had the Scooba that put down water, scrubbed, and vacuumed the water up again. And then we started getting into mopping pads with the Scooba 230 and the Braava. Although we had a lot of skepticism about the idea of capturing the water and dirt in the pad and we didn’t know how to do it at the beginning, it proved to be a very successful strategy. Then the question was, could we figure out a mechanism that would allow edge-to-edge cleaning with a mop on a Roomba platform?\n</p><p>\n\tOur early attempts were not successful, and that purist view of keeping the vacuuming and mopping robots separate held for a long time, but we recognized that the convenience of true on-the-fly switching would be a real and tangible customer benefit and would allow us to save on costs because we wouldn’t be duplicating much of the hardware across two separate robots.”\n</p><p>\n<strong>So how did you end up at the solution of moving the mopping pad all the way from the bottom of the robot to the top?</strong>\n</p><p>\n<strong>Angle: </strong>It’s certainly not where we went at first! In the annals of iRobot history are dozens of flawed ideas around how we could do this, actually dating back to some of the original designs for the original Roomba, because it was always something we’d been thinking about. The idea of having something on the bottom and pulling a plastic screen over the mopping pad got real consideration, but there are some bad failure modes there.\n</p><p>\n\tThe guy who came up with this is one of our principal engineers, who has been with iRobot maybe the longest besides me at this point. I convinced him to join the company from [the Jet Propulsion Laboratory]. He’s the one who said, “Well, why don’t we just use a belt drive and arms?” and everyone looked at him like, “Are you insane?” And so he built it, and proved to us that it could work, which is his normal way of convincing us that he’s right and we’re wrong. And it’s brilliant! It sounds like a crazy approach to solving the problem, but when you see it, it makes sense.\n</p><p>\n\tiRobot is also announcing some hefty software updates in the form of iRobot OS 5.0. The j7 Roombas have front-facing cameras that are able to do all sorts of things, and last we checked, that included identifying and avoiding four different classes of floor-dwelling objects. iRobot OS 5.0 brings that number up to 80 [!], and obstacles now trigger different behaviors besides avoidance.</p><p>Litter boxes and pet bowls, for example, can be given special attention because they tend to be dirtier areas. Same with toilets, dishwashers, and ovens. With a voice assistant, you can now also yell at your robot to skip the room that you’re in, and it’ll come back to it later, which is great for those of us who feel like our robots actively seek us out whenever they have cleaning to do.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"The robot mopping a hardwood floor with scattered cat toys around it and a cat in the background\" class=\"rm-shortcode\" data-rm-shortcode-id=\"96f1dd41525f2cbe4fc289e339aa3bf2\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"2de29\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/the-robot-mopping-a-hardwood-floor-with-scattered-cat-toys-around-it-and-a-cat-in-the-background.jpg?id=31828632&width=980\"/>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">iRobot</small>\n</p><p>\n\tiRobot told us that its j7 vacuums have received the TÜV SÜD Cyber Security Mark, a stringent third-party endorsement of iRobot’s security practices, meaning that iRobot has invested heavily in making sure that the data that it has in its possession is kept safe from external hackers. This is good, for sure, but frankly I don’t get the sense that folks are nearly as worried about their data getting \n\t<em>stolen</em> from iRobot by hackers as they are about their data getting <em>intentionally leveraged</em> by iRobot (or iRobot’s future owner) in a way that is contrary to users’ interests, although iRobot has promised that it will never sell your data to other companies. </p><p>Until we have a better idea of <a href=\"https://spectrum.ieee.org/amazon-irobot-acquisition\" target=\"_blank\">what exactly is happening with the Amazon merger</a>, it’s probably best to remain cautious. We did ask Colin Angle what the options are if you want to keep your data completely private while still using your Roomba, and here’s what he told us:\n</p><blockquote>\n\t“It depends on what your comfort level is. You don’t have to turn on mapping, and you certainly don’t have to ever store or share any image from your home. If you want to clean by room, we need to remember where your rooms are. We’re going to remember them as polygonal objects—we’re not going to have any idea what they look like. We are really trying to make sure that we only store that data that the robot actually needs to do the job. If you don’t want to clean by room or build a map, you can still have the robot operate and switch between modes and benefit from the avoidance technologies and do the right things. But there are different levels that will hopefully satisfy most different levels of concern.”\n</blockquote><p>\n\tWe also learned that \n\t<a href=\"https://spectrum.ieee.org/irobot-completely-redesigns-its-floor-care-robots-with-new-m6-and-s9\" target=\"_self\">iRobot’s top-of-the-line s9, which features a decidedly non-Roomba like square front plus a 3D sensor</a>, is not the direction that iRobot will be moving in. Historically, iRobot has released premium Roombas like the s9, and then the tech in them trickles down into less expensive robots over time. But it sounds like the s9, while still iRobot’s most powerful vacuum, couldn’t justify its fancy and expensive sensor or nonround form factor to the extent that would be necessary to influence future generations of Roombas. </p><p>“This is all a journey,” Angle told us. “With the costs inherent in building the s9 robot, we felt like we could go another way and put more CPU power in and really adopt an architecture around computer vision that would be more flexible than the dense 3D point-cloud sensor in the s9. The technology is moving so fast on the visual understanding and machine learning side, that it’s a better long-term bet to get behind. 3D sensing will come back, but it may come back as depth from vision. And the square front has some advantages—speed of clean is a benefit, but improved mission completion [of round Roombas] is a bigger benefit. I think the architecture of the J series robot is the go-forward architecture.”\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Top down picture of the robot on its clean base in a hallway\" class=\"rm-shortcode\" data-rm-shortcode-id=\"123bdbba02188a2b1e34fa28b7970da4\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"2b17c\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/top-down-picture-of-the-robot-on-its-clean-base-in-a-hallway.jpg?id=31828629&width=980\"/>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">iRobot</small>\n</p><p>\n\tAngle acknowledges that the architecture of the J series, and of the j7C in particular, makes it a high-end robot, and you could buy a Roomba and a Braava together for much less money. But this is how iRobot does things—offering premium robots with new features and capabilities for high prices, and eventually we’ll see the costs come down in the form of more affordable generations of robot. “This is definitely an exciting path forward for us,” says Angle.\n</p><p>\n\tThe iRobot Roomba Combo j7+ is available for preorder now for $1,099 in the United States, and will be available in Canada and Europe in early October.\n</p>",
  "pubDate": "Tue, 27 Sep 2022 04:08:21 +0000",
  "guid": "https://spectrum.ieee.org/irobot-roomba-combo-j7-vacuum",
  "category": [
    "Irobot",
    "Roomba",
    "J7",
    "Cleaning robots",
    "Vacuum robots",
    "Robotics",
    "Irobot"
  ],
  "dc:creator": "Evan Ackerman",
  "media:content": ""
}