{
  "title": "TU110: Story Follows State – Investigating Polyvagal Theory with Guest Deb Dana",
  "link": "https://therapistuncensored.com/episodes/tu110-story-follows-state-investigating-polyvagal-theory-with-guest-deb-dana/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu110-story-follows-state-investigating-polyvagal-theory-with-guest-deb-dana",
  "pubDate": "Thu, 05 Dec 2019 02:49:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=6767",
  "description": "When we have an anchor in ventral, we can then go visit sympathetic and dorsal without being hijacked by it. \nIn this episode of Therapist Uncensored,\nCo-host Sue Marriott explores the intersection of Polyvagal Theory, neuroscience, and attachment with Deb Dana. We will investigate how the mind creates stories from information relayed by the nervous system, and how we can rewrite the script to move toward security.\nMeeting Deb Dana\n\n \tDeb Dana is a clinician and consultant who works with trauma\n \tShe has a training program called the Rhythm of Regulation\n \tGoals of this: understand the nervous system and help people become active operators of their own system\n\nStory Follows State\n\n \tThe mind narrates what the nervous system knows\n \tTherapeutic goal: bringing explicit awareness to implicit processes\n \tNeuroception: our nervous system has a response to what is going on in the world and looks to others for cues of safety and danger\n \tThe brain tries to make sense of what is happening in the body on a physiological level by making up a story\n \tMany of us have nervous systems that are shaped by experiences to be wary of connection; this is something that we work on shifting in therapy\n\nThe Nervous System and Attachment\n\n \tThe nervous system services our survival and sets the stage for attachment\n \tWe have two survival states:\n\n\n \tSympathetic: mobilized, energetic state- we see red folks here!\n \tDorsal vagal collapse: immobilized, disconnected state- we see blue folks here!\n\nThe Hopefulness in Polyvagal Theory\n\n \t“Experience shapes the nervous system and ongoing experience reshapes the nervous system”\n \tWhen shame reduces, curiosity arises\n\nThe Autonomic Ladder\n\n \tIt can be helpful to identify where you currently stand on the ladder, as well as track where you are going on the ladder\n \tLadder orientation from top down- ventral vagal (anchored state), sympathetic (activated state), dorsal (collapsed state)\n\nTake Home Tips\n\n \tUse your voice! Intonation before information. We send cues of safety or danger through our tone of voice.\n \tEach nervous system is different in how it comes back into repair, and it changes over time.\n \tIn a ventral state, there is community.\n \tIf you’re in trouble, go social! (i.e. send a text, make that phone call, reassure yourself)\n\nWho is Deb Dana?\nDeb Dana, LCSW is a clinician and consultant specializing in working with complex trauma and is Coordinator of the Traumatic Stress Research Consortium in the Kinsey Institute. She developed the Rhythm of Regulation Clinical Training Series and lectures internationally on ways Polyvagal Theory informs work with trauma survivors.  Deb is the author of The Polyvagal Theory in Therapy: Engaging the Rhythm of Regulation and co-edited, with Stephen Porges, Clinical Applications of the Polyvagal Theory: The Emergence of Polyvagal-Informed Therapies.\n\n \nResources:\nBeginner’s Guide to Polyvagal Theory\n\nUsing the Autonomic Ladder to Work with Perfectionism\n\nThe Polyvagal Theory in Therapy: Engaging the Rhythm of Regulation\n\nRhythm of Regulation Website\n\nStephen Porges’s and Deb Dana’s Coauthored Book \n\n \n\n \n\n \nWho doesn’t love special offers?\n\nOur advanced course on attachment and neuroscience has been recently released and is now available for a discounted price! While this course is aimed toward clinicians (CE’s available!), all who are interested in deepening security in yourselves and your relationships are welcome to participate. 4 hours of curated content!\nCLICK HERE FOR MORE INFORMATION\n \n\nWe have pledged 50% of all corporate profits & merch sales (very fun swag!) to organizations that support mental health access to those traditionally left out of mainstream healthcare.  We can only do that with the help of our Neuronerd private community.\n\nBy joining as a Neuronerd premium subscriber, you get a dedicated ad-free feed, deeper dives into select content and first shot at very unique study oppo...",
  "enclosure": "",
  "itunes:subtitle": "When we have an anchor in ventral, we can then go visit sympathetic and dorsal without being hijacked by it.  In this episode of Therapist Uncensored, Co-host Sue Marriott explores the intersection of Polyvagal Theory, neuroscience,",
  "itunes:summary": "In this episode of Therapist Uncensored, co-host Sue Marriott explores the intersection of Polyvagal Theory, neuroscience, and attachment with Deb Dana. We will investigate how the mind creates stories from information relayed by the nervous system, and how we can rewrite the script to move toward security.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "56:42"
}