{
  "title": "Episode 130: &#8220;Like a Rolling Stone&#8221; by Bob Dylan",
  "link": "https://500songs.com/podcast/episode-130-like-a-rolling-stone-by-bob-dylan/",
  "pubDate": "Sat, 14 Aug 2021 22:28:29 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=861",
  "description": "<p><strong>NOTE: </strong>This episode went up before the allegations about Dylan, in a lawsuit filed on Friday, were made public on Monday night. Had I been aware of them, I would at least have commented at the beginning of the episode.</p>\n<p>Episode one hundred and thirty of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Like a Rolling Stone\" by Bob Dylan, and the controversy over Dylan going electric, Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/54911013\">on \"Hold What You've Got\" by Joe Tex</a>.</p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Erratum</strong></p>\n<p>A couple of times I refer to “CBS”. Dylan's label in the US was Columbia Records, a subsidiary of CBS Inc, but in the rest of the world the label traded as “CBS Records”. I should probably have used “Columbia” throughout...</p>\n<p><strong>Resources</strong></p>\n<p>No Mixcloud this week, as there are too many songs by Dylan. </p>\n<p>Much of the information in this episode comes from <a href=\"https://amzn.to/3yOz1Na\"><em>Dylan Goes Electric!: Newport, Seeger, Dylan, and the Night That Split the Sixties</em> by Elijah Wald</a>, which is recommended, as all Wald's books are.</p>\n<p>I’ve used these books for all the episodes involving Dylan:</p>\n<p><a href=\"https://amzn.to/2ZovBkl\">Bob Dylan: All The Songs by Phillipe Margotin and Jean-Michel Guesdon</a> is a song-by-song look at every song Dylan ever wrote, as is <a href=\"https://amzn.to/3k7ct2a\">Revolution in the Air,</a> by Clinton Heylin.</p>\n<p>Heylin also wrote the most comprehensive and accurate biography of Dylan, <a href=\"https://amzn.to/35tC1mp\">Behind the Shades</a>.</p>\n<p>I’ve also used <a href=\"https://amzn.to/35iNB3A\">Robert Shelton’s No Direction Home</a>, which is less accurate, but which is written by someone who knew Dylan.</p>\n<p>The <em>New Yorker</em> article by Nat Hentoff I talk about is <a href=\"https://www.newyorker.com/magazine/1964/10/24/the-crackin-shakin-breakin-sounds\">here</a>.</p>\n<p>And for the information about the writing of \"Like a Rolling Stone\", I relied on yet another book by Heylin, <em>All the Madmen</em>.</p>\n<p>Dylan's albums up to 1967 can all be found in their original mono mixes <a href=\"https://amzn.to/2VWairr\">on this box set</a>. And Dylan's performances at Newport from 1963 through 1965 are on <a href=\"https://amzn.to/3iOMQFT\">this DVD</a>.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>There's a story that everyone tells about Bob Dylan in 1965, the story that has entered into legend. It's the story that you'll see in most of the biographies of him, and in all those coffee-table histories of rock music put out by glossy music magazines. Bob Dylan, in this story, was part of the square, boring, folk scene until he plugged in an electric guitar and just blew the minds of all those squares, who immediately ostracised him forever for being a Judas and betraying their traditionalist acoustic music, but he was just too cool and too much of a rebel to be bound by their rules, man. Pete Seeger even got an axe and tried to cut his way through the cables of the amplifiers, he was so offended by the desecration of the Newport Folk Festival.</p>\n<p>And like all these stories, it's an oversimplification but there's an element of truth to it too. So today, we're going to look at what actually happened when Dylan went electric. We're going to look at what led to him going electric, and at the truth behind the legend of Seeger's axe. And we're going to look at the masterpiece at the centre of it all, a record that changed rock songwriting forever. We're going to look at Bob Dylan and \"Like a Rolling Stone\":</p>\n<p>[Excerpt: Bob Dylan, \"Like a Rolling Stone\"]</p>\n<p>While we've seen Dylan turn up in all sorts of episodes -- most recently the episode on \"Mr. Tambourine Man\", the last time we looked at him in detail was in the episode on \"Blowin' in the Wind\", and when we left him there he had just recorded his second album, The Freewheelin' Bob Dylan, but it had not yet been released.</p>\n<p>As we'll see, Dylan was always an artist who moved on very quickly from what he'd been doing before, and that had started as early as that album. While his first album, produced by John Hammond, had been made up almost entirely of traditional songs and songs he'd learned from Dave van Ronk or Eric von Schmidt, with only two originals, The Freewheelin' Bob Dylan had started out being produced by Hammond, but as Hammond and Dylan's manager Albert Grossman had come to find it difficult to work together, the last few tracks had been produced by Tom Wilson.</p>\n<p>We've mentioned Wilson briefly a couple of times already, but to reiterate, Wilson was a Black Harvard graduate and political conservative whose background was in jazz and who had no knowledge of or love for folk music. But Wilson saw two things in Dylan -- the undeniable power of his lyrics, and his vocals, which Wilson compared to Ray Charles.</p>\n<p>Wilson wanted to move Dylan towards working with a backing band, and this was something that Dylan was interested in doing, but his first experiment with that, with John Hammond, hadn't been a particular success. Dylan had recorded a single backed with a band -- \"Mixed-Up Confusion\", backed with \"Corrina, Corrina\", a version of an old song that had been recorded by both Bob Wills and Big Joe Turner, but had recently been brought back to the public mind by a version Phil Spector had produced for Ray Peterson. Dylan's version of that song had a country lope and occasional breaks into Jimmie Rodgers style keening that foreshadow his work of the late sixties:</p>\n<p>[Excerpt: Bob Dylan, \"Corrina, Corrina (single version)\"]</p>\n<p>A different take of that track was included on The Freewheelin' Bob Dylan, an album that was made up almost entirely of originals. Those originals fell into roughly two types -- there were songs like \"Masters of War\", \"Blowin' in the Wind\", and \"A Hard Rain's Gonna Fall\" which dealt in some way with the political events of the time -- the fear of nuclear war, the ongoing conflict in Vietnam, the Civil Rights movement and more -- but did so in an elliptical, poetic way; and there were songs about distance in a relationship -- songs like \"Don't Think Twice, It's Alright\", which do a wonderful job at portraying a young man's conflicted feelings -- the girl has left him, and he wants her back, but he wants to pretend that he doesn't. </p>\n<p>While it's always a bad idea to look for a direct autobiographical interpretation of Dylan's lyrics, it seems fairly safe to say that these songs were inspired by Dylan's feelings for his girlfriend, Suze Rotolo, who had gone travelling in Europe and not seen him for eight months, and who he was worried he would never see again, and he does seem to have actually had several conflicting feelings about this, ranging from desperation for her to come back through to anger and resentment.</p>\n<p>The surprising thing about The Freewheelin' Bob Dylan is that it's a relatively coherent piece of work, despite being recorded with two different producers over a period of more than a year, and that recording being interrupted by Dylan's own travels to the UK, his separation from and reconciliation with Rotolo, and a change of producers. If you listened to it, you would get an impression of exactly who Dylan was -- you'd come away from it thinking that he was an angry, talented, young man who was trying to merge elements of both traditional English folk music and Robert Johnson style Delta blues with poetic lyrics related to what was going on in the young man's life.</p>\n<p>By the next album, that opinion of Dylan would have to be reworked, and it would have to be reworked with every single album that came out. </p>\n<p>But The Freewheelin' Bob Dylan came out at the perfect time for Dylan to step into the role of \"spokesman for a generation\" -- a role which he didn't want, and to which he wasn't particularly suited. Because it came out in May 1963, right at the point at which folk music was both becoming hugely more mainstream, and becoming more politicised. And nothing showed both those things as well as the Hootenanny boycott:</p>\n<p>[Excerpt: The Brothers Four, “Hootenanny Saturday Night”]</p>\n<p>We've talked before about Hootenanny, the folk TV show, but what we haven't mentioned is that there was a quite substantial boycott of that show by some of the top musicians in folk music at the time. The reason for this is that Pete Seeger, the elder statesman of the folk movement, and his old band the Weavers, were both blacklisted from the show because of Seeger's Communist leanings. The Weavers were --- according to some sources -- told that they could go on if they would sign a loyalty oath, but they refused.</p>\n<p>It's hard for those of us who weren't around at the time to really comprehend both just how subversive folk music was considered, and how seriously subversion was taken in the USA of the early 1960s. To give a relevant example -- Suze Rotolo was pictured on the cover of The Freewheelin' Bob Dylan. Because of this, her cousin's husband, who was in the military, lost his security clearance and didn't get a promotion he was in line for. Again,  someone lost his security clearance because his wife's cousin was pictured on the cover of a Bob Dylan album.</p>\n<p>So the blacklisting of Seeger and the Weavers was considered a serious matter by the folk music community, and people reacted very strongly. Joan Baez announced that she wouldn't be going on Hootenanny until they asked Seeger on, and Dylan, the Kingston Trio, Dave van Ronk, Ramblin' Jack Elliott, and Peter, Paul, and Mary, among many others, all refused to go on the show as a result.</p>\n<p>But the odd thing was, whenever anyone *actually asked* Pete Seeger what he thought they should do, he told them they should go on the TV show and use it as an opportunity to promote the music. So while the Kingston Trio and Peter, Paul, and Mary, two of the biggest examples of the commercialisation of folk music that the serious purists sneered at, were refusing to go on the TV in solidarity with a Communist, that Communist's brother, Mike Seeger, happily went on Hootenanny with his band the New Lost City Ramblers, and when the Tarriers were invited on to the show but it clashed with one of their regular bookings, Pete Seeger covered their booking for them so they could appear.</p>\n<p>Dylan was on the side of the boycotters, though he was not too clear on exactly why. When he spoke about  the boycott on stage, this is what he had to say:</p>\n<p>[Excerpt: Dylan talks about the boycott. Transcript: \"Now a friend of mine, a friend of all yours I'm sure, Pete Seeger's been blacklisted [applause]. He and another group called the Weavers who are around New York [applause] I turned down that television show, but I got no right [applause] but . . . I feel bad turning it down, because the Weavers and Pete Seeger can’t be on it. They oughta turn it down. They aren’t even asked to be on it because they are blacklisted. Uh—which is, which is a bad thing. I don’t know why it’s bad, but it’s just bad, it’s bad all around.\"]</p>\n<p>Hootenanny started broadcasting in April 1963, just over a month before The Freewheelin' Bob Dylan came out, and so it would have been a good opportunity for publicity for him -- but turning the show down was also good publicity. Hootenanny wouldn't be the only opportunity to appear on TV that he was offered. It would also not be the only one he turned down. In May, Dylan was given the opportunity to appear on the Ed Sullivan Show, but he agreed on one condition -- that he be allowed to sing \"Talking John Birch Paranoid Blues\".</p>\n<p>For those who don't know, the John Birch Society is a far-right conspiratorial organisation which had a huge influence on the development of the American right-wing in the middle of the twentieth century, and is responsible for perpetuating almost every conspiracy theory that has exerted a malign influence on the country and the world since that time. They were a popular punching bag for the left and centre, and for good reason -- we heard the Chad Mitchell Trio mocking them, for example, in the episode on \"Mr. Tambourine Man\" a couple of weeks ago. </p>\n<p>So Dylan insisted that if he was going to go on the Ed Sullivan Show, it would only be to perform his song about them:</p>\n<p>[Excerpt: Bob Dylan, \"Talking John Birch Paranoid Blues\"]</p>\n<p>Now, the Ed Sullivan Show was not interested in having Dylan sing a song that would upset a substantial proportion of its audience, on what was after all meant to be an entertainment show, and so Dylan didn't appear on the show -- and he got a big publicity boost from his principled refusal to make a TV appearance that would have given him a big publicity boost.</p>\n<p>It's interesting to note in this context that Dylan himself clearly didn't actually think very much of the song -- he never included it on any of his albums, and it remained unreleased for decades.</p>\n<p>By this point, Dylan had started dating Joan Baez, with whom he would have an on-again off-again relationship for the next couple of years, even though at this point he was also still seeing Suze Rotolo. Baez was one of the big stars of the folk movement, and like Rotolo she was extremely politically motivated. She was also a fan of Dylan's writing, and had started recording versions of his songs on her albums:</p>\n<p>[Excerpt: Joan Baez, \"Don't Think Twice, It's All Right\"]</p>\n<p>The relationship between the two of them became much more public when they appeared together at the Newport Folk Festival in 1963.</p>\n<p>The Newport Folk Festival had started in 1959, as a spinoff from the successful Newport Jazz Festival, which had been going for a number of years previously. As there was a large overlap between the jazz and folk music fanbases -- both musics appealed at this point to educated, middle-class, liberals who liked to think of themselves as a little bit Bohemian -- the Jazz Festival had first started putting on an afternoon of folk music during its normal jazz programme, and then spun that off into a whole separate festival, initially with the help of Albert Grossman, who advised on which acts should be booked (and of course included several of the acts he managed on the bill).</p>\n<p>Both Newport festivals had been shut down after rioting at the 1960 Jazz Festival, as three thousand more people had turned up for the show than there was capacity for, and the Marines had had to be called in to clear the streets of angry jazz fans, but the jazz  festival had returned in 1962, and in 1963 the folk festival came back as well. By this time, Albert Grossman was too busy to work for the festival, and so its organisation was taken over by a committee headed by Pete Seeger. </p>\n<p>At that 1963 festival, even though Dylan was at this point still a relative unknown compared to some of the acts on the bill, he was made the headliner of the first night, which finished with his set, and then with him bringing Joan Baez, Peter, Paul and Mary, Pete Seeger and the Freedom Singers out to sing with him on \"Blowin' in the Wind\" and \"We Shall Overcome\". </p>\n<p>To many people, Dylan's appearance in 1963 was what launched him from being \"one of the rising stars of the folk movement\" to being the most important musician in the movement -- still just one of many, but the first among equals. He was now being talked of in the same terms as Joan Baez or Pete Seeger, and was also starting to behave like someone as important as them -- like he was a star.</p>\n<p>And that was partly because Baez was promoting Dylan, having him duet with her on stage on his songs -- though few would now argue that the combination of their voices did either artist any favours, Baez's pure, trained, voice, rubbing up against Dylan's more idiosyncratic phrasing in ways that made both sound less impressive:</p>\n<p>[Excerpt: Joan Baez and Bob Dylan, \"With God On Our Side (live at Newport 1963)\"]</p>\n<p>At the end of 1963, Dylan recorded his third album, which came out in early 1964. The Times They Are A-Changin' seems to be Dylan's least personal album to this point, and seems to have been written as a conscious attempt to write the kind of songs that people wanted and expected from him -- there were songs about particular recent news events, like \"The Lonesome Death of Hattie Carroll\",  the true story of the murder of a Black woman by a white man, and  \"Only a Pawn in Their Game\", about the murder of the Civil Rights activist Medgar Evers. There were fictional dramatisations of the kind of effects that real-world social problems were having on people, like \"North Country Blues\", in which the callous way mining towns were treated by capital leads to a woman losing her parents, brother, husband, and children, or \"The Ballad of Hollis Brown\", about a farmer driven to despair by poverty who ends up killing his whole family and himself.</p>\n<p>As you can imagine, it's not a very cheery album, but it's one that impressed a lot of people, especially its title track, which was very deliberately written as an anthem for the new social movements that were coming up:</p>\n<p>[Excerpt: Bob Dylan, \"The Times They Are A-Changin'\"]</p>\n<p>But it was a bleak album, with none of the humour that had characterised Dylan's first two albums. Soon after recording the album, Dylan had a final split with Rotolo, went travelling for a while, and took LSD for the first time. He also started to distance himself from Baez at this point, though the two would remain together until mid 1965. He seems to have regarded the political material he was doing as a mistake, as something he was doing for other people, rather than because that was what he wanted to do. </p>\n<p>He toured the UK in early 1964, and then returned to the US in time to record his fourth album, Another Side of Bob Dylan. It can be argued that this is the point where Dylan really becomes himself, and starts making music that's the music he wants to make, rather than music that he thinks other people want him to make. </p>\n<p>The entire album was recorded in one session, along with a few tracks that didn't make the cut -- like the early version of \"Mr. Tambourine Man\" with Ramblin' Jack Elliott that we heard in the episode on that song. Elliott was in attendance, as were a number of Dylan's other friends, though the album features only Dylan performing. Also there was the journalist Nat Hentoff, who wrote a full account of the recording session for the New Yorker, which I'll link in the show notes. </p>\n<p>Dylan told Hentoff \"“There aren’t any finger-pointing songs in here, either. Those records I’ve already made, I’ll stand behind them, but some of that was jumping into the scene to be heard and a lot of it was because I didn’t see anybody else doing that kind of thing. Now a lot of people are doing finger-pointing songs. You know—pointing to all the things that are wrong. Me, I don’t want to write for people anymore. You know—be a spokesman. Like I once wrote about Emmett Till in the first person, pretending I was him. From now on, I want to write from inside me, and to do that I’m going to have to get back to writing like I used to when I was ten—having everything come out naturally.\"</p>\n<p>Dylan was right to say that there were no finger-pointing songs. The songs on Another Side of Bob Dylan were entirely personal -- \"Ballad in Plain D\", in particular, is Dylan's take on the night he split up with Suze Rotolo, laying the blame -- unfairly, as he would later admit -- on her older sister. The songs mostly dealt with love and relationships, and as a result were ripe for cover versions. The opening track, in particular, \"All I Really Want to Do\", which in Dylan's version was a Jimmie Rodgers style hillbilly tune, became the subject of duelling cover versions. The Byrds' version came out as the follow-up to their version of \"Mr. Tambourine Man\":</p>\n<p>[Excerpt: The Byrds, \"All I Really Want to Do\"]</p>\n<p>But Cher also released a version -- which the Byrds claimed came about when Cher's husband Sonny Bono secretly taped a Byrds live show where they performed the song before they'd released it, and he then stole their arrangement:</p>\n<p>[Excerpt: Cher, \"All I Really Want to Do\"]</p>\n<p>In America, the Byrds' version only made number forty on the charts, while Cher made number fifteen. In the UK, where both artists were touring at the time to promote the single, Cher made number nine but the Byrds charted higher at number four. </p>\n<p>Both those releases came out after the album came out in late 1964, but even before it was released, Dylan was looking for other artists to cover his new songs. He found one at the 1964 Newport Folk Festival, where he met Johnny Cash for the first time.</p>\n<p>Cash had been a fan of Dylan for some time -- and indeed, he's often credited as being the main reason why CBS persisted with Dylan after his first album was unsuccessful, as Cash had lobbied for him within the company -- and he'd recently started to let that influence show. His most recent hit, \"Understand Your Man\", owed more than a little to Dylan's \"Don't Think Twice, It's All Right\", and Cash had also started recording protest songs.</p>\n<p>At Newport, Cash performed his own version of \"Don't Think Twice\":</p>\n<p>[Excerpt: Johnny Cash, \"Don't Think Twice, It's All Right\"]</p>\n<p>Cash and Dylan met up, with June Carter and Joan Baez, in Baez's hotel room, and according to later descriptions they were both so excited to meet each other they were bouncing with excitement, jumping up and down on the beds. They played music together all night, and Dylan played some of his new songs for Cash. One of them was \"It Ain't Me Babe\", a song that seems at least slightly inspired by \"She Loves You\" -- you can sing the \"yeah, yeah, yeah\" and \"no, no, no\" together -- and which was the closing track of Another Side of Bob Dylan. Cash soon released his own version of the song, which became a top five country hit:</p>\n<p>[Excerpt: Johnny Cash, \"It Ain't Me Babe\"]</p>\n<p>But it wasn't long after meeting Cash that Dylan met the group who may have inspired that song -- and his meeting with the Beatles seems to have confirmed in him his decision that he needed to move away from the folk scene and towards making pop records. This was something that Tom Wilson had been pushing for for a while -- Wilson had told Dylan's manager Albert Grossman that if they could get Dylan backed by a good band, they'd have a white Ray Charles on their hands.</p>\n<p>As an experiment, Wilson took some session musicians into the studio and had them overdub an electric backing on Dylan's acoustic version of \"House of the Rising Sun\", basing the new backing on the Animals' hit version. The result wasn't good enough to release, but it did show that there was a potential for combining Dylan's music with the sound of electric guitars and drums:</p>\n<p>[Excerpt: Bob Dylan, “House of the Rising Sun (electric version)”]</p>\n<p>Dylan was also being influenced by his friend John Hammond Jr, the blues musician son of Dylan's first producer, and a veteran of the Greenwich Village folk scene. Hammond had decided that he wanted to show the British R&B bands what proper American blues sounded like, and so he'd recruited a group of mostly-Canadian musicians to back him on an electric album. His \"So Many Roads\" album featured three members of a group called Levon and the Hawks -- Levon Helm, Garth Hudson, and Robbie Robertson -- who had recently quit working for the Canadian rockabilly singer Ronnie Hawkins -- plus harmonica player Charlie Musselwhite and Mike Bloomfield, who was normally a guitarist but who is credited on piano for the album:</p>\n<p>[Excerpt: John Hammond, Jr. \"Who Do You Love?\"]</p>\n<p>Dylan was inspired by Hammond's sound, and wanted to get the same sound on his next record, though he didn't consider hiring the same musicians. Instead, for his next album he brought in Bruce Langhorne, the tambourine man himself, on guitar, Bobby Gregg -- a drummer who had been the house drummer for Cameo-Parkway and played on hits by Chubby Checker, Bobby Rydell and others; the session guitarists Al Gorgoni and Kenny Rankin, piano players Frank Owens and Paul Griffin, and two bass players, Joseph Macho and William Lee, the father of the film director Spike Lee.</p>\n<p>Not all of these played on all the finished tracks -- and there were other tracks recorded during the sessions, where Dylan was accompanied by Hammond and another guitarist, John Sebastian, that weren't used at all -- but that's the lineup that played on Dylan's first electric album, Bringing it All Back Home.</p>\n<p>The first single, \"Subterranean Homesick Blues\" actually takes more inspiration than one might imagine from the old-school folk singers Dylan was still associating with. Its opening lines seem to be a riff on \"Taking it Easy\", a song that had originally been written in the forties by Woody Guthrie for the Almanac Singers, where it had been a song about air-raid sirens:</p>\n<p>[Excerpt: The Almanac Singers, \"Taking it Easy\"]</p>\n<p>But had then been rewritten by Pete Seeger for the Weavers, whose version had included this verse that wasn't in the original:</p>\n<p>[Excerpt: The Weavers, \"Taking it Easy\"]</p>\n<p>Dylan took that verse, and the basic Guthrie-esque talking blues rhythm, and connected it to Chuck Berry's \"Too Much Monkey Business\" with its rapid-fire joking blues lyrics:</p>\n<p>[Excerpt: Chuck Berry, \"Too Much Monkey Business\"]</p>\n<p>But Dylan's lyrics were a radical departure, a freeform, stream-of-consciousness proto-psychedelic lyric inspired as much by the Beat poets as by any musician -- it's no coincidence that in the promotional film Dylan made for the song, one of the earliest examples of what would become known as the rock video, the Beat poet Allen Ginsberg makes an appearance:</p>\n<p>[Excerpt: Bob Dylan, \"Subterranean Homesick Blues\"]</p>\n<p>\"Subterranean Homesick Blues\" made the top forty in the US -- it only made number thirty-nine, but it was Dylan's first single to chart at all in the US. And it made the top ten in the UK -- but it's notable that even over here, there was still some trepidation about Dylan's new direction. To promote his UK tour, CBS put out a single of \"The Times They Are A-Changin'\", and that too made the top ten, and spent longer on the charts than \"Subterranean Homesick Blues\".</p>\n<p>Indeed, it seems like everyone was hedging their bets. The opening side of Bringing it All Back Home is all electric, but the B-side is made up entirely of acoustic performances, though sometimes with a little added electric guitar countermelody -- it's very much in the same style as Dylan's earlier albums, and seems to be a way of pulling back after testing the waters, of reassuring people who might have been upset by the change in style on the first side that this was still the same Dylan they knew. </p>\n<p>And the old Dylan certainly still had plenty of commercial life in him. Indeed, when Dylan went to the UK for a tour in spring of 1965, he found that British musicians were trying to copy his style -- a young man called Donovan seemed to be doing his best to *be* Dylan, with even the title of his debut hit single seeming to owe something to \"Blowing in the Wind\":</p>\n<p>[Excerpt: Donovan, \"Catch the Wind (original single version)\"]</p>\n<p>On that UK tour, Dylan performed solo as he always had -- though by this point he had taken to bringing along an entourage. Watching the classic documentary of that tour, Dont Look Back, it's quite painful to see Dylan's cruelty to Joan Baez, who had come along on the expectation that she would be duetting with him occasionally, as he had dueted with her, but who is sidelined, tormented, and ignored. It's even worse to see Bob Neuwirth,  a hanger-on who is very obviously desperate to impress Dylan by copying all his mannerisms and affectations, doing the same. It's unsurprising that this was the end of Dylan and Baez's relationship.</p>\n<p>Dylan's solo performances on that tour went down well, but some of his fans questioned him about his choice to make an electric record. But he wasn't going to stop recording with electric musicians. Indeed, Tom Wilson also came along on the tour, and while he was in England he made an attempt to record a track with the members of John Mayall's Bluesbreakers -- Mayall, Hughie Flint, Eric Clapton, and John McVie, though it was unsuccessful and only a low-fidelity fragment of it circulates:</p>\n<p>[Excerpt: Bob Dylan and the Bluesbreakers, \"If You Gotta Go, Go Now\"]</p>\n<p>Also attending that session was a young wannabe singer from Germany who Dylan had taken up with, though their dalliance was very brief. During the session Dylan cut a demo of a song he planned to give her, but Nico didn't end up recording \"I'll Keep it With Mine\" until a couple of years later.</p>\n<p>But one other thing happened in England. After the UK tour, Dylan travelled over to Europe for a short tour, then returned to the UK to do a show for the BBC -- his first full televised concert. Unfortunately, that show never went ahead -- there was a party the night before, and Dylan was hospitalised after it with what was said to be food poisoning. It might even actually have been food poisoning, but take a listen to the episode I did on Vince Taylor, who was also at that party, and draw your own conclusions.</p>\n<p>Anyway, Dylan was laid up in bed for a while, and took the opportunity to write what he's variously described as being ten or twenty pages of stream of consciousness vomit, out of which he eventually took four pages of lyrics, a vicious attack on a woman who was originally the protagonist's social superior, but has since fallen. He's never spoken in any detail about what or who the subject of the song was, but given that it was written just days after his breakup with Baez, it's not hard to guess.</p>\n<p>The first attempt at recording the song was a false start. On June the fifteenth, Dylan and most of the same musicians who'd played on his previous album went into the studio to record it, along with Mike Bloomfield, who had played on that John Hammond album that had inspired Dylan and was now playing in the Paul Butterfield Blues Band. Bloomfield had been surprised when Dylan had told him that he didn't want the kind of string-bending electric blues that Bloomfield usually played, but he managed to come up with something Dylan approved of -- but the song was at this point in waltz time:</p>\n<p>[Excerpt: Bob Dylan, \"Like a Rolling Stone (early version)\"]</p>\n<p>The session ended, but Joe Macho, Al Gorgoni and Bobby Gregg stayed around after the session, when Tom Wilson called in another session guitarist to join them in doing the same trick he'd done on \"House of the Rising Sun\", overdubbing new instruments on a flop acoustic record he'd produced for a Greenwich Village folk duo who'd already split up. But we'll hear more about \"The Sound of Silence\" in a few weeks' time.</p>\n<p>The next day, the same musicians came back, along with one new one. Al Kooper had been invited by Wilson to come along and watch the session, but he was determined that he was going to play on whatever was recorded. He got to the session early, brought his guitar and amp in and got tuned up before Wilson arrived. But then Kooper heard Bloomfield play, realised that he simply couldn't play at anything remotely like the same standard, and decided he'd be best off staying in the control room after all. </p>\n<p>But then, before they started recording \"Like a Rolling Stone\", which by now was in 4/4 time, Frank Owens, who had been playing organ, switched to piano and left his organ on. Kooper saw his chance -- he played a bit of keyboards, too, and the song was in C, which is the easiest key to play in. Kooper asked Wilson if he could go and play, and Wilson didn't exactly say no, so Kooper went into the studio and sat at the organ. </p>\n<p>Kooper improvised the organ line that became the song's most notable instrumental part, but you will notice that it's mixed quite low in the track. This is because Wilson was unimpressed with Kooper's playing, which is technically pretty poor -- indeed, for much of the song, Kooper is a beat behind the rest of the band, waiting for them to change chords and then following the change on the next measure. Luckily, Kooper is also a good enough natural musician that he made this work, and it gave the song a distinctive sound:</p>\n<p>[Excerpt: Bob Dylan, \"Like a Rolling Stone\"]</p>\n<p>The finished record came in at around six minutes -- and here I should just mention that most books on the subject say that the single was six minutes and thirteen seconds long. That's the length of the stereo mix of the song on the stereo version of the album. The mono mix on the mono album, which we just heard, is five minutes fifty-eight, as it has a shorter fade. I haven't been able to track down a copy of the single as released in 1965, but usually the single mix would be the same as the mono album mix.</p>\n<p>Whatever the exact length, it was much, much, longer than the norm for a single -- the Animals' \"House of the Rising Sun\" had been regarded as ridiculously long at four and a half minutes -- and Columbia originally wanted to split the song over two sides of a single. But eventually it was released as one side, in full:</p>\n<p>[Excerpt: Bob Dylan, \"Like a Rolling Stone\"]</p>\n<p>That's Bruce Langhorne there playing that rather sloppy tambourine part, high in the mix.</p>\n<p>The record made the top five in the UK, and reached number two in the US, only being held off from the top spot by \"Help!\" by the Beatles. </p>\n<p>It would, however, be the last track that Tom Wilson produced for Dylan. Nobody knows what caused their split after three and a half albums working together -- and everything suggests that on the UK tour in the Spring, the two were very friendly. But they had some sort of disagreement, about which neither of them would ever speak, other than a comment by Wilson in an interview shortly before his death in which he said that Dylan had told him he was going to get Phil Spector to produce his records. In the event, the rest of the album Dylan was working on would be produced by Bob Johnston, who would be Dylan's regular producer until the mid-seventies.</p>\n<p>So \"Like a Rolling Stone\" was a major break in Dylan's career, and there was another one shortly after its release, when Dylan played the Newport Folk Festival for the third time, in what has become possibly the single most discussed and analysed performance in folk or rock music.</p>\n<p>The most important thing to note here is that there was not a backlash among the folk crowd against electric instruments. The Newport Folk Festival had *always* had electric performers -- John Lee Hooker and Johnny Cash and The Staple Singers had all performed with electric guitars and nobody had cared. What there was, was a backlash against pop music.</p>\n<p>You see, up until the Beatles hit America, the commercial side of folk music had been huge. Acts like the Kingston Trio, Peter, Paul, and Mary, The Chad Mitchell Trio, and so on had been massive. Most of the fans at the Newport Folk Festival actually despised many of these acts as sell-outs, doing watered-down versions of the traditional music they loved. But at the same time, those acts *were* doing watered-down versions of the traditional music they loved, and by doing so they were exposing more people to that traditional music. They were making programmes like Hootenanny possible -- and the folkies didn't like Hootenanny, but Hootenanny existing meant that the New Lost City Ramblers got an audience they would otherwise not have got.</p>\n<p>There was a recognition, then, that the commercialised folk music that many of them despised was nonetheless important in the development of a thriving scene.</p>\n<p>And it was those acts, the Kingston Trios and Peter, Paul, and Marys, who were fast losing their commercial relevance because of the renewed popularity of rock music. If Hootenanny gets cancelled and Shindig put on in its place, that's great for fans of the Righteous Brothers and Sam Cooke, but it's not so great if you want to hear \"Tom Dooley\" or \"If I Had a Hammer\".</p>\n<p>And so many of the old guard in the folk movement weren't wary of electric guitars *as instruments*, but they were wary of anything that looked like someone taking sides with the new pop music rather than the old folk music.</p>\n<p>For Dylan's first performance at the festival in 1965, he played exactly the set that people would expect of him, and there was no problem.</p>\n<p>The faultlines opened up, not with Dylan's first performance, but with the performance by the Paul Butterfield Blues Band, as part of a history of the blues, presented by Alan Lomax.</p>\n<p>Lomax had no objection to rock and roll -- indeed, earlier in the festival the Chambers Brothers, a Black electric group from Mississippi, had performed a set of rock and R&B songs, and Lomax had come on stage afterwards and said “I’m very proud tonight that we finally got onto the Newport Folk Festival our modern American folk music: rock ’n’ roll!”</p>\n<p>But Lomax didn't think that the Butterfield band met his criteria of \"authenticity\". And he had a point. The Paul Butterfield Blues Band were an integrated group -- their rhythm section were Black musicians who had played with Howlin' Wolf -- and they'd gained experience through playing Chicago blues on the South Side of Chicago, but their leader, Butterfield, was a white man, as was Mike Bloomfield, their guitarist, and so they'd quickly moved to playing clubs on the North side, where Black musicians had generally not been able to play.</p>\n<p>Butterfield and Bloomfield were both excellent musicians, but they were closer to the British blues lovers who were making up groups like the Rolling Stones, Animals, and Manfred Mann. There was a difference -- they were from Chicago, not from the Home Counties -- but they were still scholars coming at the music from the outside, rather than people who'd grown up with the music and had it as part of their culture.</p>\n<p>The Butterfield Band were being promoted as a sort of American answer to the Stones, and they had been put on Lomax's bill rather against his will -- he wanted to have some Chicago blues to illustrate that part of the music, but why not Muddy Waters or Howlin' Wolf, rather than this new group who had never really done anything? One he'd never even heard -- but who he knew that Albert Grossman was thinking about managing.</p>\n<p>So his introduction to the Butterfield Blues Band's performance was polite but hardly rapturous. He said \"Us white cats always moved in, a little bit late, but tried to catch up...I understand that this present combination has not only caught up but passed the rest. That’s what I hear—I’m anxious to find out whether it’s true or not.\"</p>\n<p>He then introduced the musicians, and they started to play an old Little Walter song:</p>\n<p>[Excerpt: The Paul Butterfield Blues Band, \"Juke\"]</p>\n<p>But after the set, Grossman was furious at Lomax, asking him what kind of introduction that was meant to be. Lomax responded by asking if Grossman wanted a punch in the mouth, Grossman hurled a homophobic slur at Lomax, and the two men started hitting each other and rolling round in the dirt, to the amusement of pretty much everyone around.</p>\n<p>But Lomax and Grossman were both far from amused. Lomax tried to get the Festival board to kick Grossman out, and almost succeeded, until someone explained that if they did, then that would mean that all Grossman's acts, including huge names like Dylan and Peter, Paul, and Mary, would also be out. </p>\n<p>Nobody's entirely sure whose idea it was, but it seems to have been Grossman who thought that since Bloomfield had played on Dylan's recent single, it might be an idea to get the Butterfield Blues Band to back Dylan on stage, as a snub to Lomax. But the idea seems to have cohered properly when Grossman bumped into Al Kooper, who was attending the festival just as an audience member. Grossman gave Kooper a pair of backstage passes, and told him to meet up with Dylan.</p>\n<p>And so, for Dylan's performance on the Sunday -- scheduled in the middle of the day, rather than as the headliner as most people expected, he appeared with an electric guitar, backed by the Paul Butterfield Blues Band and Al Kooper. He opened with his recent single \"Maggie's Farm\", and followed it with the new one, \"Like a Rolling Stone\":</p>\n<p>[Excerpt: Bob Dylan, \"Like a Rolling Stone (live at Newport)\"]</p>\n<p>After those two songs, the group did one more, a song called \"Phantom Engineer\", which they hadn't rehearsed properly and which was an utter train wreck. And then they left the stage. And there was booing.</p>\n<p>How much booing, and what the cause was, is hard to say, but everyone agrees there was some. Some people claim that the booing was just because the set had been so short, others say that the audience was mostly happy but there were just a few people booing. And others say that the booing mostly came from the front -- that there were sound problems that meant that while the performance sounded great to people further back, there was a tremendous level of distortion near the front.</p>\n<p>That's certainly what Pete Seeger said. Seeger was visibly distraught and angry at the sounds coming from the stage. He later said, and I believe him, that it wasn't annoyance at Dylan playing with an electric band, but at the distorted sound. He said he couldn't hear the words, that the guitar was too loud compared to the vocals, and in particular that his father, who was an old man using a hearing aid, was in actual physical pain at the sound.</p>\n<p>According to Joe Boyd, later a famous record producer but at this time just helping out at the festival, Seeger, the actor Theodore Bikel, and Alan Lomax, all of whom were on the festival board, told Boyd to take a message to Paul Rothchild, who was working the sound, telling him that the festival board ordered him to lower the volume. When Boyd got there, he found Rothchild there with Albert Grossman and Peter Yarrow of Peter, Paul, and Mary, who was also on the board. When Boyd gave his message, Yarrow responded that the board was \"adequately represented at the sound controls\", that the sound was where the musicians wanted it, and gave Boyd a message to take back to the other board members, consisting of a single raised middle finger.</p>\n<p>Whatever the cause of the anger, which was far from universal, Dylan was genuinely baffled and upset at the reaction -- while it's been portrayed since, including by Dylan himself at times, as a deliberate act of provocation on Dylan's part, it seems that at the time he was just going on stage with his new friends, to play his new songs in front of some of his old friends and a crowd that had always been supportive of him.</p>\n<p>Eventually Peter Yarrow, who was MCing, managed to persuade Dylan to go back on stage and do a couple more numbers, alone this time as the band hadn't rehearsed any more songs. He scrounged up an acoustic guitar, went back on, spent a couple of minutes fiddling around with the guitar, got a different guitar because something was wrong with that one, played \"It's All Over Now, Baby Blue\", spent another couple of minutes tuning up, and then finally played \"Mr. Tambourine Man\":</p>\n<p>[Excerpt: Bob Dylan, \"Mr. Tambourine Man (live at Newport)\"]</p>\n<p>But that pause while Dylan was off stage scrounging an acoustic guitar from somewhere led to a rumour that has still got currency fifty-six years later. Because Peter Yarrow, trying to keep the crowd calm, said \"He's gone to get his axe\" -- using musicians' slang for a guitar. But many of the crowd didn't know that slang. But they had seen Pete Seeger furious, and they'd also seen, earlier in the festival, a demonstration of work-songs, sung by people who kept time by chopping wood, and according to some people Seeger had joined in with that demonstration, swinging an axe as he sang.</p>\n<p>So the audience put two and two together, and soon the rumour was going round the festival -- Pete Seeger had been so annoyed by Dylan going electric he'd tried to chop the cables with an axe, and had had to be held back from doing so. Paul Rothchild even later claimed to have seen Seeger brandishing it. The rumour became so pervasive that in later years, even as he denied doing it, Seeger tried to explain it away by saying that he might have said something like \"I wish I had an axe so I could cut those cables\".</p>\n<p>In fact, Seeger wasn't angry at Dylan, as much as he was concerned -- shortly afterwards he wrote a private note to himself trying to sort out his own feelings, which said in part \"I like some rock and roll a great deal. Chuck Berry and Muddy Waters. I confess that, like blues and like flamenco music, I can’t listen to it for a long time at a stretch. I just don’t feel that aggressive, personally. But I have a question. Was the sound at Newport from Bob's aggregation good rock and roll? </p>\n<p>I once had a vision of a beast with hollow fangs. I first saw it when my mother-in-law, who I loved very much, died of cancer... Who knows, but I am one of the fangs that has sucked Bob dry. It is in the hope that I can learn that I write these words, asking questions I need help to answer, using language I never intended. Hoping that perhaps I’m wrong—but if I am right, hoping that it won’t happen again.\"</p>\n<p>Seeger would later make his own electric albums, and he would always continue to be complimentary towards Dylan in public. He even repeatedly said that while he still wished he'd been able to hear the words and that the guitar had been mixed quieter, he knew he'd been on the wrong side, and that if he had the time over he'd have gone on stage and asked the audience to stop booing Dylan.</p>\n<p>But the end result was the same -- Dylan was now no longer part of the Newport Folk Festival crowd. He'd moved on and was now a pop star, and nothing was going to change that. He'd split with Suze, he'd split with Joan Baez, he'd split with Tom Wilson, and now he'd split with his peer group. From now on Dylan wasn't a spokesman for his generation, or the leader of a movement. He was a young man with a leather jacket and a Stratocaster, and he was going to make rock music. And we'll see the results of that in future episodes.</p>",
  "itunes:subtitle": "NOTE: This episode went up before the allegations about Dylan, in a lawsuit filed on Friday, were made public on Monday night. Had I been aware of them, I would at least have commented at the beginning of the episode.\nEpisode one hundred and thirty of A ",
  "itunes:keywords": "Al Kooper,Alan Lomax,Albert Grossman,Bob Dylan,Cher,Donovan,Ed Sullivan,Eric Clapton,Garth Hudson,Hughie Flint,Joan Baez,Joe Boyd,John Hammond Jr.,John Mayall,John McVie,John Sebastian,Johnny Cash,Levon Helm,Mike Bloomfield,Nico,Paul Butterfield,Paul Rothchild,Pete Seeger,Peter Paul and Mary,Robbie Robertson,Suze Rotolo,The Byrds,The Weavers,Tom Wilson,Woody Guthrie",
  "itunes:episodeType": "full",
  "itunes:episode": 130,
  "content:encoded": "<p><strong>NOTE: </strong>This episode went up before the allegations about Dylan, in a lawsuit filed on Friday, were made public on Monday night. Had I been aware of them, I would at least have commented at the beginning of the episode.</p>\n<p>Episode one hundred and thirty of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Like a Rolling Stone\" by Bob Dylan, and the controversy over Dylan going electric, Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/54911013\">on \"Hold What You've Got\" by Joe Tex</a>.</p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Erratum</strong></p>\n<p>A couple of times I refer to “CBS”. Dylan's label in the US was Columbia Records, a subsidiary of CBS Inc, but in the rest of the world the label traded as “CBS Records”. I should probably have used “Columbia” throughout...</p>\n<p><strong>Resources</strong></p>\n<p>No Mixcloud this week, as there are too many songs by Dylan. </p>\n<p>Much of the information in this episode comes from <a href=\"https://amzn.to/3yOz1Na\"><em>Dylan Goes Electric!: Newport, Seeger, Dylan, and the Night That Split the Sixties</em> by Elijah Wald</a>, which is recommended, as all Wald's books are.</p>\n<p>I’ve used these books for all the episodes involving Dylan:</p>\n<p><a href=\"https://amzn.to/2ZovBkl\">Bob Dylan: All The Songs by Phillipe Margotin and Jean-Michel Guesdon</a> is a song-by-song look at every song Dylan ever wrote, as is <a href=\"https://amzn.to/3k7ct2a\">Revolution in the Air,</a> by Clinton Heylin.</p>\n<p>Heylin also wrote the most comprehensive and accurate biography of Dylan, <a href=\"https://amzn.to/35tC1mp\">Behind the Shades</a>.</p>\n<p>I’ve also used <a href=\"https://amzn.to/35iNB3A\">Robert Shelton’s No Direction Home</a>, which is less accurate, but which is written by someone who knew Dylan.</p>\n<p>The <em>New Yorker</em> article by Nat Hentoff I talk about is <a href=\"https://www.newyorker.com/magazine/1964/10/24/the-crackin-shakin-breakin-sounds\">here</a>.</p>\n<p>And for the information about the writing of \"Like a Rolling Stone\", I relied on yet another book by Heylin, <em>All the Madmen</em>.</p>\n<p>Dylan's albums up to 1967 can all be found in their original mono mixes <a href=\"https://amzn.to/2VWairr\">on this box set</a>. And Dylan's performances at Newport from 1963 through 1965 are on <a href=\"https://amzn.to/3iOMQFT\">this DVD</a>.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>There's a story that everyone tells about Bob Dylan in 1965, the story that has entered into legend. It's the story that you'll see in most of the biographies of him, and in all those coffee-table histories of rock music put out by glossy music magazines. Bob Dylan, in this story, was part of the square, boring, folk scene until he plugged in an electric guitar and just blew the minds of all those squares, who immediately ostracised him forever for being a Judas and betraying their traditionalist acoustic music, but he was just too cool and too much of a rebel to be bound by their rules, man. Pete Seeger even got an axe and tried to cut his way through the cables of the amplifiers, he was so offended by the desecration of the Newport Folk Festival.</p>\n<p>And like all these stories, it's an oversimplification but there's an element of truth to it too. So today, we're going to look at what actually happened when Dylan went electric. We're going to look at what led to him going electric, and at the truth behind the legend of Seeger's axe. And we're going to look at the masterpiece at the centre of it all, a record that changed rock songwriting forever. We're going to look at Bob Dylan and \"Like a Rolling Stone\":</p>\n<p>[Excerpt: Bob Dylan, \"Like a Rolling Stone\"]</p>\n<p>While we've seen Dylan turn up in all sorts of episodes -- most recently the episode on \"Mr. Tambourine Man\", the last time we looked at him in detail was in the episode on \"Blowin' in the Wind\", and when we left him there he had just recorded his second album, The Freewheelin' Bob Dylan, but it had not yet been released.</p>\n<p>As we'll see, Dylan was always an artist who moved on very quickly from what he'd been doing before, and that had started as early as that album. While his first album, produced by John Hammond, had been made up almost entirely of traditional songs and songs he'd learned from Dave van Ronk or Eric von Schmidt, with only two originals, The Freewheelin' Bob Dylan had started out being produced by Hammond, but as Hammond and Dylan's manager Albert Grossman had come to find it difficult to work together, the last few tracks had been produced by Tom Wilson.</p>\n<p>We've mentioned Wilson briefly a couple of times already, but to reiterate, Wilson was a Black Harvard graduate and political conservative whose background was in jazz and who had no knowledge of or love for folk music. But Wilson saw two things in Dylan -- the undeniable power of his lyrics, and his vocals, which Wilson compared to Ray Charles.</p>\n<p>Wilson wanted to move Dylan towards working with a backing band, and this was something that Dylan was interested in doing, but his first experiment with that, with John Hammond, hadn't been a particular success. Dylan had recorded a single backed with a band -- \"Mixed-Up Confusion\", backed with \"Corrina, Corrina\", a version of an old song that had been recorded by both Bob Wills and Big Joe Turner, but had recently been brought back to the public mind by a version Phil Spector had produced for Ray Peterson. Dylan's version of that song had a country lope and occasional breaks into Jimmie Rodgers style keening that foreshadow his work of the late sixties:</p>\n<p>[Excerpt: Bob Dylan, \"Corrina, Corrina (single version)\"]</p>\n<p>A different take of that track was included on The Freewheelin' Bob Dylan, an album that was made up almost entirely of originals. Those originals fell into roughly two types -- there were songs like \"Masters of War\", \"Blowin' in the Wind\", and \"A Hard Rain's Gonna Fall\" which dealt in some way with the political events of the time -- the fear of nuclear war, the ongoing conflict in Vietnam, the Civil Rights movement and more -- but did so in an elliptical, poetic way; and there were songs about distance in a relationship -- songs like \"Don't Think Twice, It's Alright\", which do a wonderful job at portraying a young man's conflicted feelings -- the girl has left him, and he wants her back, but he wants to pretend that he doesn't. </p>\n<p>While it's always a bad idea to look for a direct autobiographical interpretation of Dylan's lyrics, it seems fairly safe to say that these songs were inspired by Dylan's feelings for his girlfriend, Suze Rotolo, who had gone travelling in Europe and not seen him for eight months, and who he was worried he would never see again, and he does seem to have actually had several conflicting feelings about this, ranging from desperation for her to come back through to anger and resentment.</p>\n<p>The surprising thing about The Freewheelin' Bob Dylan is that it's a relatively coherent piece of work, despite being recorded with two different producers over a period of more than a year, and that recording being interrupted by Dylan's own travels to the UK, his separation from and reconciliation with Rotolo, and a change of producers. If you listened to it, you would get an impression of exactly who Dylan was -- you'd come away from it thinking that he was an angry, talented, young man who was trying to merge elements of both traditional English folk music and Robert Johnson style Delta blues with poetic lyrics related to what was going on in the young man's life.</p>\n<p>By the next album, that opinion of Dylan would have to be reworked, and it would have to be reworked with every single album that came out. </p>\n<p>But The Freewheelin' Bob Dylan came out at the perfect time for Dylan to step into the role of \"spokesman for a generation\" -- a role which he didn't want, and to which he wasn't particularly suited. Because it came out in May 1963, right at the point at which folk music was both becoming hugely more mainstream, and becoming more politicised. And nothing showed both those things as well as the Hootenanny boycott:</p>\n<p>[Excerpt: The Brothers Four, “Hootenanny Saturday Night”]</p>\n<p>We've talked before about Hootenanny, the folk TV show, but what we haven't mentioned is that there was a quite substantial boycott of that show by some of the top musicians in folk music at the time. The reason for this is that Pete Seeger, the elder statesman of the folk movement, and his old band the Weavers, were both blacklisted from the show because of Seeger's Communist leanings. The Weavers were --- according to some sources -- told that they could go on if they would sign a loyalty oath, but they refused.</p>\n<p>It's hard for those of us who weren't around at the time to really comprehend both just how subversive folk music was considered, and how seriously subversion was taken in the USA of the early 1960s. To give a relevant example -- Suze Rotolo was pictured on the cover of The Freewheelin' Bob Dylan. Because of this, her cousin's husband, who was in the military, lost his security clearance and didn't get a promotion he was in line for. Again,  someone lost his security clearance because his wife's cousin was pictured on the cover of a Bob Dylan album.</p>\n<p>So the blacklisting of Seeger and the Weavers was considered a serious matter by the folk music community, and people reacted very strongly. Joan Baez announced that she wouldn't be going on Hootenanny until they asked Seeger on, and Dylan, the Kingston Trio, Dave van Ronk, Ramblin' Jack Elliott, and Peter, Paul, and Mary, among many others, all refused to go on the show as a result.</p>\n<p>But the odd thing was, whenever anyone *actually asked* Pete Seeger what he thought they should do, he told them they should go on the TV show and use it as an opportunity to promote the music. So while the Kingston Trio and Peter, Paul, and Mary, two of the biggest examples of the commercialisation of folk music that the serious purists sneered at, were refusing to go on the TV in solidarity with a Communist, that Communist's brother, Mike Seeger, happily went on Hootenanny with his band the New Lost City Ramblers, and when the Tarriers were invited on to the show but it clashed with one of their regular bookings, Pete Seeger covered their booking for them so they could appear.</p>\n<p>Dylan was on the side of the boycotters, though he was not too clear on exactly why. When he spoke about  the boycott on stage, this is what he had to say:</p>\n<p>[Excerpt: Dylan talks about the boycott. Transcript: \"Now a friend of mine, a friend of all yours I'm sure, Pete Seeger's been blacklisted [applause]. He and another group called the Weavers who are around New York [applause] I turned down that television show, but I got no right [applause] but . . . I feel bad turning it down, because the Weavers and Pete Seeger can’t be on it. They oughta turn it down. They aren’t even asked to be on it because they are blacklisted. Uh—which is, which is a bad thing. I don’t know why it’s bad, but it’s just bad, it’s bad all around.\"]</p>\n<p>Hootenanny started broadcasting in April 1963, just over a month before The Freewheelin' Bob Dylan came out, and so it would have been a good opportunity for publicity for him -- but turning the show down was also good publicity. Hootenanny wouldn't be the only opportunity to appear on TV that he was offered. It would also not be the only one he turned down. In May, Dylan was given the opportunity to appear on the Ed Sullivan Show, but he agreed on one condition -- that he be allowed to sing \"Talking John Birch Paranoid Blues\".</p>\n<p>For those who don't know, the John Birch Society is a far-right conspiratorial organisation which had a huge influence on the development of the American right-wing in the middle of the twentieth century, and is responsible for perpetuating almost every conspiracy theory that has exerted a malign influence on the country and the world since that time. They were a popular punching bag for the left and centre, and for good reason -- we heard the Chad Mitchell Trio mocking them, for example, in the episode on \"Mr. Tambourine Man\" a couple of weeks ago. </p>\n<p>So Dylan insisted that if he was going to go on the Ed Sullivan Show, it would only be to perform his song about them:</p>\n<p>[Excerpt: Bob Dylan, \"Talking John Birch Paranoid Blues\"]</p>\n<p>Now, the Ed Sullivan Show was not interested in having Dylan sing a song that would upset a substantial proportion of its audience, on what was after all meant to be an entertainment show, and so Dylan didn't appear on the show -- and he got a big publicity boost from his principled refusal to make a TV appearance that would have given him a big publicity boost.</p>\n<p>It's interesting to note in this context that Dylan himself clearly didn't actually think very much of the song -- he never included it on any of his albums, and it remained unreleased for decades.</p>\n<p>By this point, Dylan had started dating Joan Baez, with whom he would have an on-again off-again relationship for the next couple of years, even though at this point he was also still seeing Suze Rotolo. Baez was one of the big stars of the folk movement, and like Rotolo she was extremely politically motivated. She was also a fan of Dylan's writing, and had started recording versions of his songs on her albums:</p>\n<p>[Excerpt: Joan Baez, \"Don't Think Twice, It's All Right\"]</p>\n<p>The relationship between the two of them became much more public when they appeared together at the Newport Folk Festival in 1963.</p>\n<p>The Newport Folk Festival had started in 1959, as a spinoff from the successful Newport Jazz Festival, which had been going for a number of years previously. As there was a large overlap between the jazz and folk music fanbases -- both musics appealed at this point to educated, middle-class, liberals who liked to think of themselves as a little bit Bohemian -- the Jazz Festival had first started putting on an afternoon of folk music during its normal jazz programme, and then spun that off into a whole separate festival, initially with the help of Albert Grossman, who advised on which acts should be booked (and of course included several of the acts he managed on the bill).</p>\n<p>Both Newport festivals had been shut down after rioting at the 1960 Jazz Festival, as three thousand more people had turned up for the show than there was capacity for, and the Marines had had to be called in to clear the streets of angry jazz fans, but the jazz  festival had returned in 1962, and in 1963 the folk festival came back as well. By this time, Albert Grossman was too busy to work for the festival, and so its organisation was taken over by a committee headed by Pete Seeger. </p>\n<p>At that 1963 festival, even though Dylan was at this point still a relative unknown compared to some of the acts on the bill, he was made the headliner of the first night, which finished with his set, and then with him bringing Joan Baez, Peter, Paul and Mary, Pete Seeger and the Freedom Singers out to sing with him on \"Blowin' in the Wind\" and \"We Shall Overcome\". </p>\n<p>To many people, Dylan's appearance in 1963 was what launched him from being \"one of the rising stars of the folk movement\" to being the most important musician in the movement -- still just one of many, but the first among equals. He was now being talked of in the same terms as Joan Baez or Pete Seeger, and was also starting to behave like someone as important as them -- like he was a star.</p>\n<p>And that was partly because Baez was promoting Dylan, having him duet with her on stage on his songs -- though few would now argue that the combination of their voices did either artist any favours, Baez's pure, trained, voice, rubbing up against Dylan's more idiosyncratic phrasing in ways that made both sound less impressive:</p>\n<p>[Excerpt: Joan Baez and Bob Dylan, \"With God On Our Side (live at Newport 1963)\"]</p>\n<p>At the end of 1963, Dylan recorded his third album, which came out in early 1964. The Times They Are A-Changin' seems to be Dylan's least personal album to this point, and seems to have been written as a conscious attempt to write the kind of songs that people wanted and expected from him -- there were songs about particular recent news events, like \"The Lonesome Death of Hattie Carroll\",  the true story of the murder of a Black woman by a white man, and  \"Only a Pawn in Their Game\", about the murder of the Civil Rights activist Medgar Evers. There were fictional dramatisations of the kind of effects that real-world social problems were having on people, like \"North Country Blues\", in which the callous way mining towns were treated by capital leads to a woman losing her parents, brother, husband, and children, or \"The Ballad of Hollis Brown\", about a farmer driven to despair by poverty who ends up killing his whole family and himself.</p>\n<p>As you can imagine, it's not a very cheery album, but it's one that impressed a lot of people, especially its title track, which was very deliberately written as an anthem for the new social movements that were coming up:</p>\n<p>[Excerpt: Bob Dylan, \"The Times They Are A-Changin'\"]</p>\n<p>But it was a bleak album, with none of the humour that had characterised Dylan's first two albums. Soon after recording the album, Dylan had a final split with Rotolo, went travelling for a while, and took LSD for the first time. He also started to distance himself from Baez at this point, though the two would remain together until mid 1965. He seems to have regarded the political material he was doing as a mistake, as something he was doing for other people, rather than because that was what he wanted to do. </p>\n<p>He toured the UK in early 1964, and then returned to the US in time to record his fourth album, Another Side of Bob Dylan. It can be argued that this is the point where Dylan really becomes himself, and starts making music that's the music he wants to make, rather than music that he thinks other people want him to make. </p>\n<p>The entire album was recorded in one session, along with a few tracks that didn't make the cut -- like the early version of \"Mr. Tambourine Man\" with Ramblin' Jack Elliott that we heard in the episode on that song. Elliott was in attendance, as were a number of Dylan's other friends, though the album features only Dylan performing. Also there was the journalist Nat Hentoff, who wrote a full account of the recording session for the New Yorker, which I'll link in the show notes. </p>\n<p>Dylan told Hentoff \"“There aren’t any finger-pointing songs in here, either. Those records I’ve already made, I’ll stand behind them, but some of that was jumping into the scene to be heard and a lot of it was because I didn’t see anybody else doing that kind of thing. Now a lot of people are doing finger-pointing songs. You know—pointing to all the things that are wrong. Me, I don’t want to write for people anymore. You know—be a spokesman. Like I once wrote about Emmett Till in the first person, pretending I was him. From now on, I want to write from inside me, and to do that I’m going to have to get back to writing like I used to when I was ten—having everything come out naturally.\"</p>\n<p>Dylan was right to say that there were no finger-pointing songs. The songs on Another Side of Bob Dylan were entirely personal -- \"Ballad in Plain D\", in particular, is Dylan's take on the night he split up with Suze Rotolo, laying the blame -- unfairly, as he would later admit -- on her older sister. The songs mostly dealt with love and relationships, and as a result were ripe for cover versions. The opening track, in particular, \"All I Really Want to Do\", which in Dylan's version was a Jimmie Rodgers style hillbilly tune, became the subject of duelling cover versions. The Byrds' version came out as the follow-up to their version of \"Mr. Tambourine Man\":</p>\n<p>[Excerpt: The Byrds, \"All I Really Want to Do\"]</p>\n<p>But Cher also released a version -- which the Byrds claimed came about when Cher's husband Sonny Bono secretly taped a Byrds live show where they performed the song before they'd released it, and he then stole their arrangement:</p>\n<p>[Excerpt: Cher, \"All I Really Want to Do\"]</p>\n<p>In America, the Byrds' version only made number forty on the charts, while Cher made number fifteen. In the UK, where both artists were touring at the time to promote the single, Cher made number nine but the Byrds charted higher at number four. </p>\n<p>Both those releases came out after the album came out in late 1964, but even before it was released, Dylan was looking for other artists to cover his new songs. He found one at the 1964 Newport Folk Festival, where he met Johnny Cash for the first time.</p>\n<p>Cash had been a fan of Dylan for some time -- and indeed, he's often credited as being the main reason why CBS persisted with Dylan after his first album was unsuccessful, as Cash had lobbied for him within the company -- and he'd recently started to let that influence show. His most recent hit, \"Understand Your Man\", owed more than a little to Dylan's \"Don't Think Twice, It's All Right\", and Cash had also started recording protest songs.</p>\n<p>At Newport, Cash performed his own version of \"Don't Think Twice\":</p>\n<p>[Excerpt: Johnny Cash, \"Don't Think Twice, It's All Right\"]</p>\n<p>Cash and Dylan met up, with June Carter and Joan Baez, in Baez's hotel room, and according to later descriptions they were both so excited to meet each other they were bouncing with excitement, jumping up and down on the beds. They played music together all night, and Dylan played some of his new songs for Cash. One of them was \"It Ain't Me Babe\", a song that seems at least slightly inspired by \"She Loves You\" -- you can sing the \"yeah, yeah, yeah\" and \"no, no, no\" together -- and which was the closing track of Another Side of Bob Dylan. Cash soon released his own version of the song, which became a top five country hit:</p>\n<p>[Excerpt: Johnny Cash, \"It Ain't Me Babe\"]</p>\n<p>But it wasn't long after meeting Cash that Dylan met the group who may have inspired that song -- and his meeting with the Beatles seems to have confirmed in him his decision that he needed to move away from the folk scene and towards making pop records. This was something that Tom Wilson had been pushing for for a while -- Wilson had told Dylan's manager Albert Grossman that if they could get Dylan backed by a good band, they'd have a white Ray Charles on their hands.</p>\n<p>As an experiment, Wilson took some session musicians into the studio and had them overdub an electric backing on Dylan's acoustic version of \"House of the Rising Sun\", basing the new backing on the Animals' hit version. The result wasn't good enough to release, but it did show that there was a potential for combining Dylan's music with the sound of electric guitars and drums:</p>\n<p>[Excerpt: Bob Dylan, “House of the Rising Sun (electric version)”]</p>\n<p>Dylan was also being influenced by his friend John Hammond Jr, the blues musician son of Dylan's first producer, and a veteran of the Greenwich Village folk scene. Hammond had decided that he wanted to show the British R&B bands what proper American blues sounded like, and so he'd recruited a group of mostly-Canadian musicians to back him on an electric album. His \"So Many Roads\" album featured three members of a group called Levon and the Hawks -- Levon Helm, Garth Hudson, and Robbie Robertson -- who had recently quit working for the Canadian rockabilly singer Ronnie Hawkins -- plus harmonica player Charlie Musselwhite and Mike Bloomfield, who was normally a guitarist but who is credited on piano for the album:</p>\n<p>[Excerpt: John Hammond, Jr. \"Who Do You Love?\"]</p>\n<p>Dylan was inspired by Hammond's sound, and wanted to get the same sound on his next record, though he didn't consider hiring the same musicians. Instead, for his next album he brought in Bruce Langhorne, the tambourine man himself, on guitar, Bobby Gregg -- a drummer who had been the house drummer for Cameo-Parkway and played on hits by Chubby Checker, Bobby Rydell and others; the session guitarists Al Gorgoni and Kenny Rankin, piano players Frank Owens and Paul Griffin, and two bass players, Joseph Macho and William Lee, the father of the film director Spike Lee.</p>\n<p>Not all of these played on all the finished tracks -- and there were other tracks recorded during the sessions, where Dylan was accompanied by Hammond and another guitarist, John Sebastian, that weren't used at all -- but that's the lineup that played on Dylan's first electric album, Bringing it All Back Home.</p>\n<p>The first single, \"Subterranean Homesick Blues\" actually takes more inspiration than one might imagine from the old-school folk singers Dylan was still associating with. Its opening lines seem to be a riff on \"Taking it Easy\", a song that had originally been written in the forties by Woody Guthrie for the Almanac Singers, where it had been a song about air-raid sirens:</p>\n<p>[Excerpt: The Almanac Singers, \"Taking it Easy\"]</p>\n<p>But had then been rewritten by Pete Seeger for the Weavers, whose version had included this verse that wasn't in the original:</p>\n<p>[Excerpt: The Weavers, \"Taking it Easy\"]</p>\n<p>Dylan took that verse, and the basic Guthrie-esque talking blues rhythm, and connected it to Chuck Berry's \"Too Much Monkey Business\" with its rapid-fire joking blues lyrics:</p>\n<p>[Excerpt: Chuck Berry, \"Too Much Monkey Business\"]</p>\n<p>But Dylan's lyrics were a radical departure, a freeform, stream-of-consciousness proto-psychedelic lyric inspired as much by the Beat poets as by any musician -- it's no coincidence that in the promotional film Dylan made for the song, one of the earliest examples of what would become known as the rock video, the Beat poet Allen Ginsberg makes an appearance:</p>\n<p>[Excerpt: Bob Dylan, \"Subterranean Homesick Blues\"]</p>\n<p>\"Subterranean Homesick Blues\" made the top forty in the US -- it only made number thirty-nine, but it was Dylan's first single to chart at all in the US. And it made the top ten in the UK -- but it's notable that even over here, there was still some trepidation about Dylan's new direction. To promote his UK tour, CBS put out a single of \"The Times They Are A-Changin'\", and that too made the top ten, and spent longer on the charts than \"Subterranean Homesick Blues\".</p>\n<p>Indeed, it seems like everyone was hedging their bets. The opening side of Bringing it All Back Home is all electric, but the B-side is made up entirely of acoustic performances, though sometimes with a little added electric guitar countermelody -- it's very much in the same style as Dylan's earlier albums, and seems to be a way of pulling back after testing the waters, of reassuring people who might have been upset by the change in style on the first side that this was still the same Dylan they knew. </p>\n<p>And the old Dylan certainly still had plenty of commercial life in him. Indeed, when Dylan went to the UK for a tour in spring of 1965, he found that British musicians were trying to copy his style -- a young man called Donovan seemed to be doing his best to *be* Dylan, with even the title of his debut hit single seeming to owe something to \"Blowing in the Wind\":</p>\n<p>[Excerpt: Donovan, \"Catch the Wind (original single version)\"]</p>\n<p>On that UK tour, Dylan performed solo as he always had -- though by this point he had taken to bringing along an entourage. Watching the classic documentary of that tour, Dont Look Back, it's quite painful to see Dylan's cruelty to Joan Baez, who had come along on the expectation that she would be duetting with him occasionally, as he had dueted with her, but who is sidelined, tormented, and ignored. It's even worse to see Bob Neuwirth,  a hanger-on who is very obviously desperate to impress Dylan by copying all his mannerisms and affectations, doing the same. It's unsurprising that this was the end of Dylan and Baez's relationship.</p>\n<p>Dylan's solo performances on that tour went down well, but some of his fans questioned him about his choice to make an electric record. But he wasn't going to stop recording with electric musicians. Indeed, Tom Wilson also came along on the tour, and while he was in England he made an attempt to record a track with the members of John Mayall's Bluesbreakers -- Mayall, Hughie Flint, Eric Clapton, and John McVie, though it was unsuccessful and only a low-fidelity fragment of it circulates:</p>\n<p>[Excerpt: Bob Dylan and the Bluesbreakers, \"If You Gotta Go, Go Now\"]</p>\n<p>Also attending that session was a young wannabe singer from Germany who Dylan had taken up with, though their dalliance was very brief. During the session Dylan cut a demo of a song he planned to give her, but Nico didn't end up recording \"I'll Keep it With Mine\" until a couple of years later.</p>\n<p>But one other thing happened in England. After the UK tour, Dylan travelled over to Europe for a short tour, then returned to the UK to do a show for the BBC -- his first full televised concert. Unfortunately, that show never went ahead -- there was a party the night before, and Dylan was hospitalised after it with what was said to be food poisoning. It might even actually have been food poisoning, but take a listen to the episode I did on Vince Taylor, who was also at that party, and draw your own conclusions.</p>\n<p>Anyway, Dylan was laid up in bed for a while, and took the opportunity to write what he's variously described as being ten or twenty pages of stream of consciousness vomit, out of which he eventually took four pages of lyrics, a vicious attack on a woman who was originally the protagonist's social superior, but has since fallen. He's never spoken in any detail about what or who the subject of the song was, but given that it was written just days after his breakup with Baez, it's not hard to guess.</p>\n<p>The first attempt at recording the song was a false start. On June the fifteenth, Dylan and most of the same musicians who'd played on his previous album went into the studio to record it, along with Mike Bloomfield, who had played on that John Hammond album that had inspired Dylan and was now playing in the Paul Butterfield Blues Band. Bloomfield had been surprised when Dylan had told him that he didn't want the kind of string-bending electric blues that Bloomfield usually played, but he managed to come up with something Dylan approved of -- but the song was at this point in waltz time:</p>\n<p>[Excerpt: Bob Dylan, \"Like a Rolling Stone (early version)\"]</p>\n<p>The session ended, but Joe Macho, Al Gorgoni and Bobby Gregg stayed around after the session, when Tom Wilson called in another session guitarist to join them in doing the same trick he'd done on \"House of the Rising Sun\", overdubbing new instruments on a flop acoustic record he'd produced for a Greenwich Village folk duo who'd already split up. But we'll hear more about \"The Sound of Silence\" in a few weeks' time.</p>\n<p>The next day, the same musicians came back, along with one new one. Al Kooper had been invited by Wilson to come along and watch the session, but he was determined that he was going to play on whatever was recorded. He got to the session early, brought his guitar and amp in and got tuned up before Wilson arrived. But then Kooper heard Bloomfield play, realised that he simply couldn't play at anything remotely like the same standard, and decided he'd be best off staying in the control room after all. </p>\n<p>But then, before they started recording \"Like a Rolling Stone\", which by now was in 4/4 time, Frank Owens, who had been playing organ, switched to piano and left his organ on. Kooper saw his chance -- he played a bit of keyboards, too, and the song was in C, which is the easiest key to play in. Kooper asked Wilson if he could go and play, and Wilson didn't exactly say no, so Kooper went into the studio and sat at the organ. </p>\n<p>Kooper improvised the organ line that became the song's most notable instrumental part, but you will notice that it's mixed quite low in the track. This is because Wilson was unimpressed with Kooper's playing, which is technically pretty poor -- indeed, for much of the song, Kooper is a beat behind the rest of the band, waiting for them to change chords and then following the change on the next measure. Luckily, Kooper is also a good enough natural musician that he made this work, and it gave the song a distinctive sound:</p>\n<p>[Excerpt: Bob Dylan, \"Like a Rolling Stone\"]</p>\n<p>The finished record came in at around six minutes -- and here I should just mention that most books on the subject say that the single was six minutes and thirteen seconds long. That's the length of the stereo mix of the song on the stereo version of the album. The mono mix on the mono album, which we just heard, is five minutes fifty-eight, as it has a shorter fade. I haven't been able to track down a copy of the single as released in 1965, but usually the single mix would be the same as the mono album mix.</p>\n<p>Whatever the exact length, it was much, much, longer than the norm for a single -- the Animals' \"House of the Rising Sun\" had been regarded as ridiculously long at four and a half minutes -- and Columbia originally wanted to split the song over two sides of a single. But eventually it was released as one side, in full:</p>\n<p>[Excerpt: Bob Dylan, \"Like a Rolling Stone\"]</p>\n<p>That's Bruce Langhorne there playing that rather sloppy tambourine part, high in the mix.</p>\n<p>The record made the top five in the UK, and reached number two in the US, only being held off from the top spot by \"Help!\" by the Beatles. </p>\n<p>It would, however, be the last track that Tom Wilson produced for Dylan. Nobody knows what caused their split after three and a half albums working together -- and everything suggests that on the UK tour in the Spring, the two were very friendly. But they had some sort of disagreement, about which neither of them would ever speak, other than a comment by Wilson in an interview shortly before his death in which he said that Dylan had told him he was going to get Phil Spector to produce his records. In the event, the rest of the album Dylan was working on would be produced by Bob Johnston, who would be Dylan's regular producer until the mid-seventies.</p>\n<p>So \"Like a Rolling Stone\" was a major break in Dylan's career, and there was another one shortly after its release, when Dylan played the Newport Folk Festival for the third time, in what has become possibly the single most discussed and analysed performance in folk or rock music.</p>\n<p>The most important thing to note here is that there was not a backlash among the folk crowd against electric instruments. The Newport Folk Festival had *always* had electric performers -- John Lee Hooker and Johnny Cash and The Staple Singers had all performed with electric guitars and nobody had cared. What there was, was a backlash against pop music.</p>\n<p>You see, up until the Beatles hit America, the commercial side of folk music had been huge. Acts like the Kingston Trio, Peter, Paul, and Mary, The Chad Mitchell Trio, and so on had been massive. Most of the fans at the Newport Folk Festival actually despised many of these acts as sell-outs, doing watered-down versions of the traditional music they loved. But at the same time, those acts *were* doing watered-down versions of the traditional music they loved, and by doing so they were exposing more people to that traditional music. They were making programmes like Hootenanny possible -- and the folkies didn't like Hootenanny, but Hootenanny existing meant that the New Lost City Ramblers got an audience they would otherwise not have got.</p>\n<p>There was a recognition, then, that the commercialised folk music that many of them despised was nonetheless important in the development of a thriving scene.</p>\n<p>And it was those acts, the Kingston Trios and Peter, Paul, and Marys, who were fast losing their commercial relevance because of the renewed popularity of rock music. If Hootenanny gets cancelled and Shindig put on in its place, that's great for fans of the Righteous Brothers and Sam Cooke, but it's not so great if you want to hear \"Tom Dooley\" or \"If I Had a Hammer\".</p>\n<p>And so many of the old guard in the folk movement weren't wary of electric guitars *as instruments*, but they were wary of anything that looked like someone taking sides with the new pop music rather than the old folk music.</p>\n<p>For Dylan's first performance at the festival in 1965, he played exactly the set that people would expect of him, and there was no problem.</p>\n<p>The faultlines opened up, not with Dylan's first performance, but with the performance by the Paul Butterfield Blues Band, as part of a history of the blues, presented by Alan Lomax.</p>\n<p>Lomax had no objection to rock and roll -- indeed, earlier in the festival the Chambers Brothers, a Black electric group from Mississippi, had performed a set of rock and R&B songs, and Lomax had come on stage afterwards and said “I’m very proud tonight that we finally got onto the Newport Folk Festival our modern American folk music: rock ’n’ roll!”</p>\n<p>But Lomax didn't think that the Butterfield band met his criteria of \"authenticity\". And he had a point. The Paul Butterfield Blues Band were an integrated group -- their rhythm section were Black musicians who had played with Howlin' Wolf -- and they'd gained experience through playing Chicago blues on the South Side of Chicago, but their leader, Butterfield, was a white man, as was Mike Bloomfield, their guitarist, and so they'd quickly moved to playing clubs on the North side, where Black musicians had generally not been able to play.</p>\n<p>Butterfield and Bloomfield were both excellent musicians, but they were closer to the British blues lovers who were making up groups like the Rolling Stones, Animals, and Manfred Mann. There was a difference -- they were from Chicago, not from the Home Counties -- but they were still scholars coming at the music from the outside, rather than people who'd grown up with the music and had it as part of their culture.</p>\n<p>The Butterfield Band were being promoted as a sort of American answer to the Stones, and they had been put on Lomax's bill rather against his will -- he wanted to have some Chicago blues to illustrate that part of the music, but why not Muddy Waters or Howlin' Wolf, rather than this new group who had never really done anything? One he'd never even heard -- but who he knew that Albert Grossman was thinking about managing.</p>\n<p>So his introduction to the Butterfield Blues Band's performance was polite but hardly rapturous. He said \"Us white cats always moved in, a little bit late, but tried to catch up...I understand that this present combination has not only caught up but passed the rest. That’s what I hear—I’m anxious to find out whether it’s true or not.\"</p>\n<p>He then introduced the musicians, and they started to play an old Little Walter song:</p>\n<p>[Excerpt: The Paul Butterfield Blues Band, \"Juke\"]</p>\n<p>But after the set, Grossman was furious at Lomax, asking him what kind of introduction that was meant to be. Lomax responded by asking if Grossman wanted a punch in the mouth, Grossman hurled a homophobic slur at Lomax, and the two men started hitting each other and rolling round in the dirt, to the amusement of pretty much everyone around.</p>\n<p>But Lomax and Grossman were both far from amused. Lomax tried to get the Festival board to kick Grossman out, and almost succeeded, until someone explained that if they did, then that would mean that all Grossman's acts, including huge names like Dylan and Peter, Paul, and Mary, would also be out. </p>\n<p>Nobody's entirely sure whose idea it was, but it seems to have been Grossman who thought that since Bloomfield had played on Dylan's recent single, it might be an idea to get the Butterfield Blues Band to back Dylan on stage, as a snub to Lomax. But the idea seems to have cohered properly when Grossman bumped into Al Kooper, who was attending the festival just as an audience member. Grossman gave Kooper a pair of backstage passes, and told him to meet up with Dylan.</p>\n<p>And so, for Dylan's performance on the Sunday -- scheduled in the middle of the day, rather than as the headliner as most people expected, he appeared with an electric guitar, backed by the Paul Butterfield Blues Band and Al Kooper. He opened with his recent single \"Maggie's Farm\", and followed it with the new one, \"Like a Rolling Stone\":</p>\n<p>[Excerpt: Bob Dylan, \"Like a Rolling Stone (live at Newport)\"]</p>\n<p>After those two songs, the group did one more, a song called \"Phantom Engineer\", which they hadn't rehearsed properly and which was an utter train wreck. And then they left the stage. And there was booing.</p>\n<p>How much booing, and what the cause was, is hard to say, but everyone agrees there was some. Some people claim that the booing was just because the set had been so short, others say that the audience was mostly happy but there were just a few people booing. And others say that the booing mostly came from the front -- that there were sound problems that meant that while the performance sounded great to people further back, there was a tremendous level of distortion near the front.</p>\n<p>That's certainly what Pete Seeger said. Seeger was visibly distraught and angry at the sounds coming from the stage. He later said, and I believe him, that it wasn't annoyance at Dylan playing with an electric band, but at the distorted sound. He said he couldn't hear the words, that the guitar was too loud compared to the vocals, and in particular that his father, who was an old man using a hearing aid, was in actual physical pain at the sound.</p>\n<p>According to Joe Boyd, later a famous record producer but at this time just helping out at the festival, Seeger, the actor Theodore Bikel, and Alan Lomax, all of whom were on the festival board, told Boyd to take a message to Paul Rothchild, who was working the sound, telling him that the festival board ordered him to lower the volume. When Boyd got there, he found Rothchild there with Albert Grossman and Peter Yarrow of Peter, Paul, and Mary, who was also on the board. When Boyd gave his message, Yarrow responded that the board was \"adequately represented at the sound controls\", that the sound was where the musicians wanted it, and gave Boyd a message to take back to the other board members, consisting of a single raised middle finger.</p>\n<p>Whatever the cause of the anger, which was far from universal, Dylan was genuinely baffled and upset at the reaction -- while it's been portrayed since, including by Dylan himself at times, as a deliberate act of provocation on Dylan's part, it seems that at the time he was just going on stage with his new friends, to play his new songs in front of some of his old friends and a crowd that had always been supportive of him.</p>\n<p>Eventually Peter Yarrow, who was MCing, managed to persuade Dylan to go back on stage and do a couple more numbers, alone this time as the band hadn't rehearsed any more songs. He scrounged up an acoustic guitar, went back on, spent a couple of minutes fiddling around with the guitar, got a different guitar because something was wrong with that one, played \"It's All Over Now, Baby Blue\", spent another couple of minutes tuning up, and then finally played \"Mr. Tambourine Man\":</p>\n<p>[Excerpt: Bob Dylan, \"Mr. Tambourine Man (live at Newport)\"]</p>\n<p>But that pause while Dylan was off stage scrounging an acoustic guitar from somewhere led to a rumour that has still got currency fifty-six years later. Because Peter Yarrow, trying to keep the crowd calm, said \"He's gone to get his axe\" -- using musicians' slang for a guitar. But many of the crowd didn't know that slang. But they had seen Pete Seeger furious, and they'd also seen, earlier in the festival, a demonstration of work-songs, sung by people who kept time by chopping wood, and according to some people Seeger had joined in with that demonstration, swinging an axe as he sang.</p>\n<p>So the audience put two and two together, and soon the rumour was going round the festival -- Pete Seeger had been so annoyed by Dylan going electric he'd tried to chop the cables with an axe, and had had to be held back from doing so. Paul Rothchild even later claimed to have seen Seeger brandishing it. The rumour became so pervasive that in later years, even as he denied doing it, Seeger tried to explain it away by saying that he might have said something like \"I wish I had an axe so I could cut those cables\".</p>\n<p>In fact, Seeger wasn't angry at Dylan, as much as he was concerned -- shortly afterwards he wrote a private note to himself trying to sort out his own feelings, which said in part \"I like some rock and roll a great deal. Chuck Berry and Muddy Waters. I confess that, like blues and like flamenco music, I can’t listen to it for a long time at a stretch. I just don’t feel that aggressive, personally. But I have a question. Was the sound at Newport from Bob's aggregation good rock and roll? </p>\n<p>I once had a vision of a beast with hollow fangs. I first saw it when my mother-in-law, who I loved very much, died of cancer... Who knows, but I am one of the fangs that has sucked Bob dry. It is in the hope that I can learn that I write these words, asking questions I need help to answer, using language I never intended. Hoping that perhaps I’m wrong—but if I am right, hoping that it won’t happen again.\"</p>\n<p>Seeger would later make his own electric albums, and he would always continue to be complimentary towards Dylan in public. He even repeatedly said that while he still wished he'd been able to hear the words and that the guitar had been mixed quieter, he knew he'd been on the wrong side, and that if he had the time over he'd have gone on stage and asked the audience to stop booing Dylan.</p>\n<p>But the end result was the same -- Dylan was now no longer part of the Newport Folk Festival crowd. He'd moved on and was now a pop star, and nothing was going to change that. He'd split with Suze, he'd split with Joan Baez, he'd split with Tom Wilson, and now he'd split with his peer group. From now on Dylan wasn't a spokesman for his generation, or the leader of a movement. He was a young man with a leather jacket and a Stratocaster, and he was going to make rock music. And we'll see the results of that in future episodes.</p>",
  "enclosure": "",
  "itunes:summary": "NOTE: This episode went up before the allegations about Dylan, in a lawsuit filed on Friday, were made public on Monday night. Had I been aware of them, I would at least have commented at the beginning of the episode.\nEpisode one hundred and thirty of A History of Rock Music in Five Hundred Songs looks at “Like a Rolling Stone\" by Bob Dylan, and the controversy over Dylan going electric, Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bonus episode available, on \"Hold What You've Got\" by Joe Tex.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nErratum\nA couple of times I refer to “CBS”. Dylan's label in the US was Columbia Records, a subsidiary of CBS Inc, but in the rest of the world the label traded as “CBS Records”. I should probably have used “Columbia” throughout...\nResources\nNo Mixcloud this week, as there are too many songs by Dylan. \nMuch of the information in this episode comes from Dylan Goes Electric!: Newport, Seeger, Dylan, and the Night That Split the Sixties by Elijah Wald, which is recommended, as all Wald's books are.\nI’ve used these books for all the episodes involving Dylan:\nBob Dylan: All The Songs by Phillipe Margotin and Jean-Michel Guesdon is a song-by-song look at every song Dylan ever wrote, as is Revolution in the Air, by Clinton Heylin.\nHeylin also wrote the most comprehensive and accurate biography of Dylan, Behind the Shades.\nI’ve also used Robert Shelton’s No Direction Home, which is less accurate, but which is written by someone who knew Dylan.\nThe New Yorker article by Nat Hentoff I talk about is here.\nAnd for the information about the writing of \"Like a Rolling Stone\", I relied on yet another book by Heylin, All the Madmen.\nDylan's albums up to 1967 can all be found in their original mono mixes on this box set. And Dylan's performances at Newport from 1963 through 1965 are on this DVD.\nPatreon\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\nTranscript\nThere's a story that everyone tells about Bob Dylan in 1965, the story that has entered into legend. It's the story that you'll see in most of the biographies of him, and in all those coffee-table histories of rock music put out by glossy music magazines. Bob Dylan, in this story, was part of the square, boring, folk scene until he plugged in an electric guitar and just blew the minds of all those squares, who immediately ostracised him forever for being a Judas and betraying their traditionalist acoustic music, but he was just too cool and too much of a rebel to be bound by their rules, man. Pete Seeger even got an axe and tried to cut his way through the cables of the amplifiers, he was so offended by the desecration of the Newport Folk Festival.\nAnd like all these stories, it's an oversimplification but there's an element of truth to it too. So today, we're going to look at what actually happened when Dylan went electric. We're going to look at what led to him going electric, and at the truth behind the legend of Seeger's axe. And we're going to look at the masterpiece at the centre of it all, a record that changed rock songwriting forever. We're going to look at Bob Dylan and \"Like a Rolling Stone\":\n[Excerpt: Bob Dylan, \"Like a Rolling Stone\"]\nWhile we've seen Dylan turn up in all sorts of episodes -- most recently the episode on \"Mr. Tambourine Man\", the last time we looked at him in detail was in the episode on \"Blowin' in the Wind\", and when we left him there he had just recorded his second album, The Freewheelin' Bob Dylan, but it had not yet been released.\nAs we'll see, Dylan was always an artist who moved on very quickly from what he'd been doing before, and that had started as early as that album. While his first album, produced b",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "NOTE: This episode went up before the allegations about Dylan, in a lawsuit filed on Friday, were made public on Monday night. Had I been aware of them, I would at least have commented at the beginning of the episode.\nEpisode one hundred and thirty of A History of Rock Music in Five Hundred Songs looks at “Like a Rolling Stone\" by Bob Dylan, and the controversy over Dylan going electric, Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bonus episode available, on \"Hold What You've Got\" by Joe Tex.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nErratum\nA couple of times I refer to “CBS”. Dylan's label in the US was Columbia Records, a subsidiary of CBS Inc, but in the rest of the world the label traded as “CBS Records”. I sho",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}