{
  "id": "yt:video:Jhsj1v7Zi_k",
  "yt:videoId": "Jhsj1v7Zi_k",
  "yt:channelId": "UCbmNph6atAoGfqLoCL_duAg",
  "title": "Sian Harding | The Exquisite Machine: The New Science of the Heart | Talks at Google",
  "link": "",
  "author": {
    "name": "Talks at Google",
    "uri": "https://www.youtube.com/channel/UCbmNph6atAoGfqLoCL_duAg"
  },
  "published": "2022-10-08T16:00:13+00:00",
  "updated": "2022-10-13T21:55:34+00:00",
  "media:group": {
    "media:title": "Sian Harding | The Exquisite Machine: The New Science of the Heart | Talks at Google",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Sian Harding—a world leader in cardiac research—discusses her book The Exquisite Machine: The New Science of the Heart, as she explores the relation between the emotions and heart function, reporting that the heart not only responds to our emotions, but it also creates them. The condition known as Broken Heart Syndrome, for example, is a real disorder that can follow bereavement or stress. \n\nYour heart is a miracle in motion, a marvel of construction unsurpassed by any human-made creation. It beats 100,000 times every day—if you were to live to 100, that would be more than 3 billion beats across your lifespan. Despite decades of effort in labs all over the world, we have not yet been able to replicate the heart's perfect engineering. But, as Sian Harding shows us in \"The Exquisite Machine\", new scientific developments are opening up the mysteries of the heart. And this explosion of new science—ultrafast imaging, gene editing, stem cells, artificial intelligence, and advanced sub-light microscopy—has crucial, real-world consequences for health and well-being.\n\n\"The Exquisite Machine\" describes the evolutionary forces that have shaped the heart's response to damage, the astonishing rejuvenating power of stem cells, how we can avoid heart disease, and why it can be so hard to repair a damaged heart. It tells the stories of patients who have had the devastating experiences of a heart attack, chaotic heart rhythms, or stress-induced acute heart failure, and it describes how cutting-edge technologies are enabling experiments and clinical trials that will lead us to new solutions to the worldwide scourge of heart disease.\n\nGet the book here https://goo.gle/3ROjdmR.\n\nSian Harding is Emeritus Professor at Imperial College London. She has been Head of the Cardiovascular Division there, and Director of the British Heart Foundation Cardiovascular Regenerative Medicine Centre. Her work has focused on the myocardium in heart failure, especially beta-adrenergic mechanisms. She was Scientific PI on the first UK Gene therapy Trial in LVAD patients, aimed at improving cardiac contractility. Professor Harding is former President of the European Section of the International Society for Heart Research and Board member of the British Society of Gene and Cell Therapy. She was Special Advisor to the House of Commons Science and Technology Committee on Regenerative Medicine. Sian has been given a Lifetime Achievement award from the European Society of Cardiology HFA and will receive the Imperial College Medal this year.\n\nModerated by Suzette Bishop.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}