{
  "title": "263: The Perfect Bid: The Contestant Who Knew Too Much",
  "link": "https://audioboom.com/posts/8185785",
  "itunes:episode": 263,
  "itunes:title": "The Perfect Bid: The Contestant Who Knew Too Much",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3602,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>The is one of our funniest episodes in a minute! Fam, get ready to meet Ted Slauson, a math teacher who becomes OBSESSED with the gameshow The Price is Right. He spends weeks and months MEMORIZING THE COST OF THOUSANDS OF ITEMS in order to beat the game--a tactic which is apparently perfectly legal. He goes to the show over and over hoping to make it on and helps so many gameshow hopefuls beat the game along the way. We're taking a walk on the lighter side this week, and you're gonna love it!<br>\n <br>\n<a href=\"https://www.patreon.com/posts/true-crime-live-73308747\">FAM!! THE FULL VIDEO OF OUR LIVE SHOW FILMED AT OBSESSED FEST  IS NOW LIVE ON PATREON!</a> The Broadway Dancers! The Obsessed Fest crowd! The Energy! The laughs!! <a href=\"https://www.patreon.com/posts/true-crime-live-73308747\">You can see it all now by joining here!</a><br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 300 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Bad Vegan\" \"LuLaRich\" \"John Wayne Gacy: Devil in Disguise\" \"Night Stalker\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a> </div>\n",
  "pubDate": "Tue, 01 Nov 2022 10:03:51 +0000",
  "guid": "tag:audioboom.com,2022-11-01:/posts/8185785",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}