{
  "title": "S14 Ep76: Lightning Strikes Twice",
  "link": "https://audioboom.com/posts/8098554",
  "itunes:episode": 76,
  "itunes:title": "Lightning Strikes Twice",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4583,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS introduces you to Victoria Bragg today, Lightening Strikes Twice and the aftermath is unbelievable!<br>\n<br>\nVictoria Bragg is a medium and a psychic, but it wasn't always that way. Victoria has been struck by lightening, TWICE and her world got a whole lot bigger, it opened up abilities that are shocking, terrifying at times and filled with wonder. This is her unique story of Gifts, Demons and a life that changed literally in a flash of light.<br>\n<br>\nVisit her site here: <a href=\"http://psychicvictorialove.com\">psychicvictorialove.com</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nCarnival Row is a one-hour fantasy drama series starring Orlando Bloom and Cara Delevingne . The series is set in a Victorian fantasy world filled with mythological immigrant creatures whose exotic homelands were invaded by the empires of man. Come together on August 30th to watch Carnival Row only on Amazon Prime Video this Labor Day Weekend!<br>\n<br>\nFeals naturally helps reduce stress, anxiety, pain, and sleeplessness.  Place a few drops of Feals under your tongue and feel the difference within minutes. Become a member today by going to <a href=\"http://Feals.com/DARKNESS\">Feals.com/DARKNESS</a> and you'll get 50% off your first order with free shipping<br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.",
  "itunes:summary": "BEYOND the DARKNESS introduces you to Victoria Bragg today, Lightening Strikes Twice and the aftermath is unbelievable!\n\nVictoria Bragg is a medium and a psychic, but it wasn't always that way. Victoria has been struck by lightening,...",
  "pubDate": "Sun, 15 Sep 2019 08:00:00 +0000",
  "guid": "2b5d9bf4-eafd-464d-b73c-0a4a26f56f0a",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}