{
  "title": "Network Engineer to Machine Learning Engineer",
  "link": "https://dimensionless.in/career-transition-data-science-network-engineer/",
  "comments": "https://dimensionless.in/career-transition-data-science-network-engineer/#respond",
  "dc:creator": "Pooja Sahatiya",
  "pubDate": "Mon, 14 Oct 2019 09:46:32 +0000",
  "category": [
    "Career Transitions",
    "Data Science",
    "Career Switch Data Science",
    "Career Transition",
    "data science careers",
    "data science job",
    "data science professional",
    "data science skillset",
    "Data Science Success Story",
    "future ready careers",
    "Hardware Engineer",
    "Learn Data Science and Business Analytics",
    "Machine Learning",
    "Network Engineer",
    "Research Associate"
  ],
  "guid": "https://dimensionless.in/?p=216460",
  "description": "I got shortlisted for multiple companies for Data Science job roles, one of them was through Dimensionless. I joined Affine Analytics with almost 70% hike from my previous job. I am thankful to Dimensionless for all of this.",
  "content:encoded": "\n<h2>Career Transition to Data Science Success Story</h2>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>Hands-on practice is the key to a good start in Data Science! </p>\n<cite><br /><a href=\"https://www.linkedin.com/in/ashish-anand-bb6582bb/\">-Ashish Anand</a></cite></blockquote>\n\n\n\n<h3>Background</h3>\n\n\n\n<p><strong>Education:</strong> BE Electronics & Communications</p>\n\n\n\n<table class=\"wp-block-table is-style-stripes\">\n<tbody>\n<tr>\n<td><strong>Previous Profile >>></strong></td>\n<td><strong>Transition Profile >>></strong></td>\n<td><strong>Current Profile</strong></td>\n</tr>\n<tr>\n<td>Company: Ericsson<br />Profile: <strong>Network Engineer </strong><br />Domain: Telecom</td>\n<td>Company: Ericsson <br />Profile: <strong>Data Science Analyst</strong><br />Domain: Telecom</td>\n<td>Company: Affine Analytics <br />Designation: <strong>Data Science Associate</strong><br />Profile: <strong>Sr. Business Analyst</strong><br />Domain: Retail</td>\n</tr>\n</tbody>\n</table>\n\n\n\n<div class=\"wp-block-spacer\" style=\"height: 32px\" aria-hidden=\"true\"> </div>\n\n\n\n<h3>My journey into Data Science<br /><br /></h3>\n\n\n\n<h4>Why Data Science?</h4>\n\n\n\n<p>In my previous profile, the work was very manual and monotonous, doing the same thing time and again. I was not satisfied with my work. I knew I had to change something. At that time, I was considering Data Science as well as Big Data since these two have the maximum scope and good pay as well. Maths and Stats were always my strong points and I am technically strong too. Considering this, Data Science looked like an exciting journey.</p>\n\n\n\n<h4>Why Dimensionless?</h4>\n\n\n\n<p>I tried to learn by myself through other online learning classes. I also took a course through Udemy. The pre-recorded videos were a drag. It was not interactive and I had a lot of doubts. That is when I came across Dimensionless.</p>\n\n\n\n<p>Compared to other courses, this one had a detailed syllabus with 200 hours Live and Interactive training. I was sure about joining this course as soon as I attended the Demo. I took a lot of other courses but there was something or the other missing in them. With Dimensionless, I found all of it in one place.</p>\n\n\n\n<h4>Experience with Dimensionless?</h4>\n\n\n\n<p>It was exactly as I wanted it, a good mix of theory and practical. The classes were very interactive and teachers were always available for doubt-solving. They also helped me with my additional self-studies. I went to them with topics that were not in the syllabus and still got support. There was ample pre-recorded content as well, that we could refer to after the live classes.</p>\n\n\n\n<h3>Career Transition to Data Science</h3>\n\n\n\n<p>I’ll be honest, I didn’t get through any interviews at first. With mentors at Dimensionless, I got feedback on my performance at the interviews. The career mentoring facility helped me understand what I was interested in and which jobs I should be applying to accordingly. The HR guided me about which companies and jobs I need to apply to, weigh the advantages and disadvantages of the profiles.</p>\n\n\n\n<p>This started giving me confidence. Finally, I got shortlisted for multiple companies, one of them was through Dimensionless. I joined Affine Analytics with almost 70% hike from my previous job. I am thankful to Dimensionless for all of this.</p>\n\n\n\n<figure class=\"wp-block-pullquote\">\n<blockquote>\n<p>I like my work, I can work for 10 hours straight and not feel stressed.</p>\n</blockquote>\n</figure>\n\n\n\n<p>&nbsp;</p>\n",
  "wfw:commentRss": "https://dimensionless.in/career-transition-data-science-network-engineer/feed/",
  "slash:comments": 0
}