{
  "title": "Parliamentary session suspended after ‘racist’ heckling",
  "link": "https://www.rt.com/news/565940-france-parliament-racist-heckling/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565940-france-parliament-racist-heckling/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6364d0e5203027485e05da3e.jpg\" /> A session of the French parliament was suspended after a legislator shouted “They should go back to Africa!” <br/><a href=\"https://www.rt.com/news/565940-france-parliament-racist-heckling/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>France’s National Assembly briefly descended into chaos after an MP shouted “They should go back to Africa!”</strong></p>\n            \n                        \n            <p>A session of the French parliament was suspended on Thursday after a legislator was accused of hurling a &ldquo;racist&rdquo; insult at a fellow MP during a debate on migration.</p>\n<p>The incident took place when Carlos Martens Bilongo, an MP from the left-wing La France Insoumise (France Unbowed) party whose parents are of Congolese and Angolan origin, was delivering a speech on behalf of an NGO that aids migrants arriving in Europe. He asked the government to help find a port for the 234 people recently rescued at sea.</p>\n<p>Gregoire de Fournas, a newly elected legislator from the conservative National Rally (RN) party, interrupted the speech by shouting: <em>&ldquo;They should go back to Africa!&rdquo;</em></p>\n<p>The heckle immediately led to an uproar, with several other MPs angrily yelling at de Fournas, after which the speaker, Yael Braun-Privet, suspended the session.</p>\n<p>According to France 24 news channel, it could be believed that de Fournas was addressing Bilongo directly, because in French, the pronouns &lsquo;he&rsquo; and &lsquo;they&rsquo; are pronounced the same.</p>\n<p>Many politicians condemned the conservative MP, whose party is known for its anti-migrant stance. <em>&ldquo;Racism has no place in our democracy,&rdquo;</em> Prime Minister Elisabeth Borne said.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6364264485f5402cd913ff81.jpg\" alt=\"‘The View’ co-host Sunny Hostin is shown attending a theater event last week in New York City.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565924-view-host-likens-white-women-to-roaches/\">TV host likens white Republican women to roaches</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Bilongo also accused de Fournas of racism. <em>&ldquo;Today in the parliament chamber, he insulted me personally. He insulted millions of French people who look like me,&rdquo;</em> he told France Info radio.</p>\n<p>De Fournas denied that he insulted Bilongo and accused his party of <em>&ldquo;manipulation.&rdquo;</em>&nbsp;</p>\n<p><em>&ldquo;They are trying to distort my words, to make me look as if I was making disgusting comments towards a fellow MP who has the same legitimacy to sit in these benches as I do,&rdquo;</em> he told reporters, adding that he was specifically calling for migrants who cross the Mediterranean Sea by boat to be returned home rather than be allowed to land in France.</p>\n<p>The RN, formerly known as the National Front and led by Marine Le Pen between 2011 and 2021, won 89 seats in the country&rsquo;s 577-seat National Assembly in June, marking the biggest victory in the party&rsquo;s history.</p>\n<p>In April, Le Pen lost to Emmanuel Macron in a presidential runoff election, receiving 41.45% of the votes to 58.55%.</p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 08:46:28 +0000",
  "dc:creator": "RT"
}