{
  "title": "Jail Worden Of The Night | True Crime Today",
  "link": "https://audioboom.com/posts/8150517",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1930,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>\n<strong>14-year-old Colorado girl SHOT while she was making a TikTok video.</strong><br>\n<br>\nA 14-year-old girl was shot and murdered while making a TikTok video; three persons, including two minors, have been arrested in connection with her killing.<br>\n<br>\nThe Monte Vista Police Department reports that at 3:30 p.m. on August 7, officers responded to a shooting call in the 300 block of Monroe Street and located a young female victim suffering from gunshot wounds. When emergency medical services arrived, they pronounced her dead.<br>\n<br>\nThe Monte Vista Police Department stated on August 11 that detectives had arrested two female adolescents for reckless manslaughter and possession of a weapon by juveniles. Another male, 21-year-old Emiliano Vargas, was arrested on charges of providing or allowing a minor to possess a pistol and failing to comply with the law regarding the secure storage of firearms. It has been said that he was the owner of the pistol used in the fatal shot but was not there at the time.<br>\n<br>\nThe affidavit states that the cops discovered the woman on the floor \"with blood and other fluid\" gushing out of her head. The police then reportedly discovered a pistol in a separate bedroom; the house where the shooting took place speculated that one of the two teens had hidden the weapon there after the incident. According to reports, Vargas and another minor shared the Monroe Street residence with his grandmother.<br>\n<br>\nA minor was \"informed that the juveniles were handling the gun and recording movies on 'TikTok,'\" according to one of the two responding cops.<br>\n<br>\nOfficers were told by one of the minors that they removed the clip and \"it simply occurred.\" In the affidavit, it is stated that because no exit wound was discovered, \"the bullet remains in the skull of the victim.\"<br>\n<br>\nThe investigation states that Vargas \"routinely\" allows one of the minors to use his gun, which he leaves \"visible and unlocked on a top shelf,\" because he \"trusts\" them.<br>\n<br>\nTeenager Aaliyah Salazar, 14, was named as the victim by KUSA-TV. She \"had just become a teenager and [was] so excited to attend her freshman year of high school,\" as her obituary puts it.<br>\n<br>\nAaliyah had a number of pets, including three dogs, a cat, a turtle, and a few hamsters, for which she was \"the proud mama.\" She \"knew she was going to be famous one day\" because of her interest in creating TikTok videos<br>\n<br>\nKUSA report.s that some of Aaliyah's relatives think the gunshot \"was on purpose.\"<br>\n<br>\n<br>\nThe Colorado State Attorney's Office is apparently in charge of the investigation.<br>\n<br>\n<br>\n<strong>Wisconsin inmate claims he had sex with a jail supervisor twice<br>\n</strong><br>\n<br>\nA prison administrator, age 37, was arrested and charged with having a sexual relationship with an inmate.<br>\n<br>\n<br>\nThe Racine County Sheriff's Office received information concerning a possible relationship between Racine Correctional Institute supervisor Jacqueline Heidt and an inmate on August 24, according to a press release.<br>\n<br>\n<br>\nIt has been reported that investigators seized Heidt's cellphone and uncovered evidence, including photos and messages, to back up the accusations.<br>\n<br>\n<br>\nAccording to the Sheriff's Office, the claimed romance started in April and lasted until August 4. The detainee allegedly informed investigators that they had sex in Heidt's office several times a week. According to the Sheriff's Office, the two engaged in \"sexual intercourse at least 20 times, but less than 40 times.\"<br>\n<br>\n<br>\nAs well as having sexual relations through intercourse, the two allegedly engaged in other sexual activities.<br>\n<br>\n<br>\nThe Sheriff's Office claims that Heidt was interviewed on August 25 but rejected the allegations. After being shown the phone evidence, the Sheriff's office said she \"changed her manner and stopped responding questions.\"<br>\n<br>\n<br>\nReportedly, Heidt was taken into custody and charged with second-degree sexual assault by correctional employees, misconduct in public service, and delivery of illicit materials to a prisoner. She has a bond set at slightly over $1.1 million and is still being held in the Racine County Jail.<br>\n<br>\n<br>\n<strong>A 49-year-old man was given a 35-year prison term for his persistent sexual assault of two minors.<br>\n</strong><br>\n<br>\nThe Collin County District Attorney's Office alleges that Mark Jones, who had unrestricted access to two children, aged 10 and 14, for a number of years, sexually molested them. Apparently, the victim penned a letter to God describing the abuse, and one of her parents later discovered the letter and informed the authorities.<br>\n<br>\n<br>\nThe District Attorney's Office claims that the note's discovery led to the identification of a second young victim.<br>\n<br>\n<br>\nIt has been stated that both youngsters were interviewed by authorities and disclosed the existence of abuse.<br>\n<br>\n<br>\nThe District Attorney's Office stated on August 29 that Jones was sentenced to 35 years in jail without parole for his long history of child sexual abuse.<br>\n<br>\n<br>\nGreg Willis, the district attorney for Collin County, made the following statement: \"When even one child is victimized by a sexual predator over a long period of time, it is a tragedy for the entire community. It's unthinkable that this pervert sexually harmed not one but two young children.\"<br>\n<br>\n<br>\n<br>\n<strong>A grandpa is believed to have punched his daughter's fiancé after he exposed himself to the child, who was then 5 years old, at their home.<br>\n</strong><br>\n<br>\nAfter reportedly exposing himself to a 5-year-old girl, a 22-year-old man was arrested last week on multiple offenses, including attempted rape.<br>\n<br>\n<br>\nAttempted rape of a child, indecent assault, unlawful contact with a juvenile, corruption of minors, and indecent exposure were among the charges against Aaron Cunagin, who was detained on August 24 by police from the Middletown Borough Police Department at the Pineford Apartments.<br>\n<br>\n<br>\nHis bond was set at $150,000 and he was put into the Dauphin County Prison.<br>\n<br>\n<br>\nPenn Live reports that Cunagin and the girl were in the girl's bedroom/playroom at the time of the alleged incident. There are rumors that the girl's grandfather felt it strange to see his granddaughter sitting on Cunagin's lap, but he nonetheless left the room. When the victim's grandfather returned to check on him and Cunagin, he allegedly found Cunagin with his pants down and his genitalia exposed.<br>\n<br>\n<br>\nIt was also said that the girl was barefoot and pantless.<br>\n<br>\n<br>\nIt has been stated that the grandfather yelled, punched, and phoned the police on Cunagin.<br>\n<br>\n<br>\nPolice say Cunagin told them, \"Simply, the thought occurred to me. I went in and out of arguments with myself. Feelings of numbness pervaded me. I sat there thinking while holding it.\"<br>\n<br>\n<br>\nWhen questioned further about the nature of \"it,\" he allegedly revealed that he was referring to his privates.<br>\n<br>\n<br>\nAccording to the Centre Daily Times, which also relies on court documents, Cunagin is accused of saying that he was \"fighting himself whether or not to have sex with the victim.\"<br>\n<br>\n<br>\nThe Centre Daily Times reports that the girl said this happened four other times, although Cunagin denied it. He reportedly proposed to the granddaughter of his late father.<br>\n<br>\n<strong>If you like TRUE CRIME TODAY - Be sure to search and subscribe wherever you download podcasts!</strong><br>\n<br>\nApple Podcasts <a href=\"https://podcasts.apple.com/us/podcast/dark-side-of-wikipedia-true-crime-dark-history/id1504280230?uo=4\">https://podcasts.apple.com/us/podcast/true-crime-today-a-true-crime-podcast/id1504280230?uo=4</a><br>\n<br>\nSpotify <a href=\"https://open.spotify.com/show/0GYshi6nJCf3O0aKEBTOPs\">https://open.spotify.com/show/0GYshi6nJCf3O0aKEBTOPs</a><br>\n<br>\nStitcher <a href=\"http://www.stitcher.com/podcast/real-ghost-stories-online-2/dark-side-of-wikipedia-true-crime-disturbing-stories\">http://www.stitcher.com/podcast/real-ghost-stories-online-2/dark-side-of-wikipedia-true-crime-disturbing-stories</a><br>\n<br>\niHeart <a href=\"https://www.iheart.com/podcast/270-Dark-Side-of-Wikipedia-Tru-60800715\">https://www.iheart.com/podcast/270-Dark-Side-of-Wikipedia-Tru-60800715</a><br>\n<br>\nAmazon <a href=\"https://music.amazon.com/podcasts/565dc51b-d214-4fab-b38b-ae7c723cb79a/Dark-Side-of-Wikipedia-True-Crime-Dark-History\">https://music.amazon.com/podcasts/565dc51b-d214-4fab-b38b-ae7c723cb79a/Dark-Side-of-Wikipedia-True-Crime-Dark-History</a><br>\n<br>\nGoogle Podcasts <a href=\"https://www.google.com/podcasts?feed=aHR0cHM6Ly9hdWRpb2Jvb20uY29tL2NoYW5uZWxzLzUwMDEyNjAucnNz\">https://www.google.com/podcasts?feed=aHR0cHM6Ly9hdWRpb2Jvb20uY29tL2NoYW5uZWxzLzUwMDEyNjAucnNz</a><br>\n<br>\n<strong>Or Search \"True Crime Today\" for the best in True Crime ANYWHERE you get podcasts!<br>\n</strong><br>\n<strong>Support the show at </strong><a href=\"http://www.patreon.com/truecrimetoday\"><strong><a href=\"http://www.patreon.com/truecrimetoday\">http://www.patreon.com/truecrimetoday</a></strong></a>\n</div>\n",
  "pubDate": "Sun, 04 Sep 2022 16:00:00 +0000",
  "guid": "tag:audioboom.com,2022-09-02:/posts/8150517",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}