{
  "title": "Myths of Economic Inequality",
  "description": "<p>&nbsp;</p>\n<blockquote><p>What would you say if someone told you that many academics, the US government, and the media overstate income inequality, understate the real income growth of US households, overstate poverty, and understate income mobility? If someone had asked me, I would have said I believe it. I’ve followed these issues, and even <a href=\"https://calhoun.nps.edu/bitstream/handle/10945/45710/Henderson_Economic_Inequality_1999.pdf?sequence=1&isAllowed=y\" target=\"_blank\" rel=\"noopener\">written about most of them</a>. But on reading <a href=\"https://www.amazon.com/Myth-American-Inequality-Government-Biases/dp/1538167387\" target=\"_blank\" rel=\"noopener\"><em>The Myth of American Inequality: How Government Biases Policy Debate</em>,</a> even I was blown away by the strength of the evidence for these conclusions.</p>\n<p>The book’s three authors are former US senator and former economics professor Phil Gramm, Auburn University economics professor Robert Ekelund, and former assistant commissioner of the Bureau of Labor Statistics John Early. The authors take a deep dive into the data and use largely government-generated data to make their case. They point out that in computing household incomes, the US Census, part of the Department of Commerce, systematically leaves out two-thirds of the transfer payments that federal, state, and local governments give to people. This dramatically understates income of people in the lowest-income two-fifths (which economists and statisticians call <em>quintiles</em>) because these two quintiles, and especially the lowest, receive a hugely disproportionate share of transfer payments. The Census also leaves out taxes paid to federal, state, and local governments. Because higher-income people pay most of the taxes, failure to subtract these taxes substantially overstates the income of higher-income people. Both factors cause the Census Bureau to systematically overstate income inequality. They also show that the government’s usual measure to adjust for inflation, the Consumer Price Index, systematically overstates inflation and, therefore, understates the growth of real wages and real household incomes. Adjusting the data for both transfer payments and the overstatement of inflation, the authors show that the percentage of US households in poverty, rather than being in the low teens, is actually only about 1.1 percent.</p>\n<p>Along the way, the authors show that US income mobility is high: the vast majority of people, over their lifetimes, move from one quintile to another. They also dispel a number of myths about the rich, the top 1 percent, the top 0.1 percent, and the incredibly wealthy Forbes 400. As a disturbing bonus, they show that in recent years some federal government agencies have encouraged people to be more dependent on government welfare.</p></blockquote>\n<p>This is from David R. Henderson, &#8220;Myths of Economic Inequality,&#8221; Defining Ideas, November 3, 2022.</p>\n<p>The results of correcting for inflation with a measure that adjusts for substitution and for quality improvements:</p>\n<blockquote><p>Gramm et al. note that while using the CPI shows a measly 8.7 percent growth in real wages between 1967 and 2017, using a measure that corrects for substitution bias and for improvements in the quality of goods and services yields the conclusion that real wage rates over those fifty years rose by a whopping 74.0 percent. Over that same period, using the CPI shows that real median household income rose by 33.5 percent, but using a price index that accounts for substitution and quality improvements shows the increase to be 93.3 percent.</p>\n<p>That seems to accord with our observations. Think about what people have now that they didn’t and how those things have contributed to their well-being: houses with two bathrooms and widescreen TVs, mobile phones that can be direction finder, music player, calculator, and more, and medical care that improves our life expectancy and keeps us from having long stays in the hospital. Those are only three of many improvements.</p></blockquote>\n<p>Read the <a href=\"https://www.hoover.org/research/myths-economic-inequality\">whole thing</a>.</p>\n<p>Thanks to one of the co-authors, John Early, for quickly answering a question I had about 2 of the tables in the book.</p>\n(15 COMMENTS)",
  "link": "https://www.econlib.org/myths-of-economic-inequality/",
  "guid": "https://www.econlib.org/myths-of-economic-inequality/",
  "category": [
    "Books: Reviews and Suggested Readings",
    "Economic Methods",
    "Growth: Consequences",
    "Income Distribution",
    "consumer price index",
    "inequality",
    "inflation adjustment",
    "John Early",
    "Phil Gramm",
    "real wages",
    "Robert Ekelund"
  ],
  "pubDate": "Fri, 04 Nov 2022 12:00:27 +0000"
}