{
  "id": "yt:video:ujLjEbCykOQ",
  "yt:videoId": "ujLjEbCykOQ",
  "yt:channelId": "UCMm211NGh4Ls5SAMZJF7E8A",
  "title": "SM64 - Go to The Secret Aquarium - 0x A Presses (VC Only) [OUTDATED]",
  "link": "",
  "author": {
    "name": "pannenkoek2012",
    "uri": "https://www.youtube.com/channel/UCMm211NGh4Ls5SAMZJF7E8A"
  },
  "published": "2015-10-09T03:54:46+00:00",
  "updated": "2022-05-14T19:19:21+00:00",
  "media:group": {
    "media:title": "SM64 - Go to The Secret Aquarium - 0x A Presses (VC Only) [OUTDATED]",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "THIS VIDEO IS OUTDATED - SEE A BETTER VERSION OF THIS VIDEO HERE:\nhttps://youtu.be/7YhJcF9v7QQ\n\nI go to The Secret Aquarium using using 0 A presses. Unfortunately, this method is only possible on emulator and virtual console, and NOT console. This is because if Mario goes to a PU on console without fixing the camera in the main map, the game will freeze. Normally we can get around this by fixing the camera, but this isn't possible in the castle foyer because the foyer has a special camera that automatically follows Mario around. Thus, whether or not this A press save truly counts is up for debate.\n\nThis video is an improvement from my previous video in which I did this using 1 A press. You can find that video here: https://youtu.be/mlHzqJn2SMs?t=5m37s. Since then, Tyler Kehne discovered how to exploit PUs and described to me how one could use them to get into the Secret Aquarium using 0 A presses. Consequently, I planned a route, tested it, and ultimately made a TAS that did just that.\n\nSo what are PUs? Well, Mario's position is a float, but is treated as a short for testing collisions. Since shorts can only hold up to 2^16 values, some information is lost in this conversion. For example, a float of 1 is converted into a short of 1, but a float of (2^16)+1 is also converted into a short of 1. In other words, the modulo 2^16 operation is performed. This means that in some sense, being at position p + k*(2^16) for some integer k is treated the same as being at position p. Following this logic, there isn't just one map, but a grid of near infinite maps spread out by 2^16 intervals. These other maps are invisible, and are called Parallel Universes (PUs). With enough speed, Mario can travel to these PUs. However, 2^16 speed isn't enough, because the game checks if Mario is above land at each quarter step of his movement. Consequently, Mario needs 4 * 2^16 = 2^18 speed, so that each quarter step point is above a different PU. Thus, 2^18 is referred to as a quadruple PU distance, or QPU. Read Tyler's full description of PUs here: http://pastebin.com/uH5GhHbp\n\nHere is a play-by-play of what I do in the video. First, I go into HMC and use hyper speed walking to generate a vast amount of speed. Hyper speed walking occurs when Mario walks uphill on a steep slope in shallow water. After 25 hours, I've accumulated enough speed for the rest of the journey. From there, I navigate through PUs to arrive back in the HMC main map's water. I then exit out, and conserve my speed into the castle by pressing Z+C^ and punch to get out of C^ mode. From there, I navigate through PUs to ascend up the foyer stairs and then up the BitDW stairs. See, I needed to get sufficient elevation in order to grab onto the SA entrance, and the BitDW hallway was the only place high enough to do so. Once there, I simply return to the main map exactly at the SA entrance.\n\nNote that platforms with different slopes require different speed multiples to cross PUs from. Thus, when going from a platform of one slope to a platform of a different slope, I must drop my speed until it syncs up with the next available speed multiple of the new platform. Decreasing speed can be done quite quickly by jumping with A, but since this is the A button challenge, the quickest way to decrease my speed is to continuously punch, which can take quite some time.\n\nFor viewer pleasure and enlightenment, I also show the route a second time with helpful visuals. The 4 screens I show are:\n(1) a Standard View: showing the natural view that the game displays\n(2) a Relative View: showing Mario's relative position within each PU, which normally cannot be discerned because each PU is invisible\n(3) a PU Map: showing which PU Mario is in out the infinite grid of PUs\n(4) a Relative Map: showing an overhead view of Mario's relative position within each PU\n\nPictures of my calculations: http://imgur.com/a/05op7\nScale map of what the PU grid looks like: http://imgur.com/wTHujrX\n\n.m64 stats:\nLength: 27 hours and 55 minutes\nRe-records: 2936\nFrames: 6,030,103 (3,015,000 input)\n\nABC Playlist: https://www.youtube.com/playlist?list=PLmvvhlevqC2d6vis077yFHuLJHYtTtqe_\nABC Routes: https://docs.google.com/document/d/1ypRVVRyf4x-v8GqCSmKYnicrfKSIjao3Y1ZVl52RIyM/edit",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}