{
  "title": "Protostellar collapse simulations in spherical geometry with dust coagulation and fragmentation. (arXiv:2211.01891v1 [astro-ph.GA])",
  "link": "http://arxiv.org/abs/2211.01891",
  "description": "<p>We model the coagulation and fragmentation of dust grains during the\nprotostellar collapse with our newly developed shark code. It solves the\ngas-dust hydrodynamics in a spherical geometry and the\ncoagulation/fragmentation equation. It also computes the ionization state of\nthe cloud and the Ohmic, ambipolar and Hall resistivities. We find that the\ndust size distribution evolves significantly during the collapse, large grain\nformation being controlled by the turbulent differential velocity. When\nturbulence is included, only ambipolar diffusion remains efficient at removing\nthe small grains from the distribution, brownian motion is only efficient as a\nstandalone process. The macroscopic gas-dust drift is negligible for grain\ngrowth and only dynamically significant near the first Larson core. At high\ndensity, we find that the coagulated distribution is unaffected by the initial\nchoice of dust distribution. Strong magnetic fields are found to enhance the\nsmall grains depletion, causing an important increase of the ambipolar\ndiffusion. This hints that the magnetic field strength could be regulated by\nthe small grain population during the protostellar collapse. Fragmentation\ncould be effective for bare silicates, but its modeling relies on the choice of\nill-constrained parameters. It is also found to be negligible for icy grains.\nWhen fragmentation occurs, it strongly affects the magnetic resistivities\nprofiles. Dust coagulation is a critical process that needs to be fully taken\ninto account during the protostellar collapse. The onset and feedback of\nfragmentation remains uncertain and its modeling should be further\ninvestigated.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Lebreuilly_U/0/1/0/all/0/1\">Ugo Lebreuilly</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Vallucci_Goy_V/0/1/0/all/0/1\">Valentin Vallucci-Goy</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Guillet_V/0/1/0/all/0/1\">Vincent Guillet</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Lombart_M/0/1/0/all/0/1\">Maxime Lombart</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Marchand_P/0/1/0/all/0/1\">Pierre Marchand</a>"
}