{
  "title": "NASA’s Artemis I Revives the Moonshot",
  "link": "https://spectrum.ieee.org/artemis-1-revives-moonshot",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/artemis-i-on-launch-pad-39b-at-kennedy-space-center-at-dawn.jpg?id=31246740&width=1200&height=800&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p><br/></p><p><em><strong>Update 5 Sept.</strong>: For now, NASA’s giant Artemis I remains on the ground after two launch attempts scrubbed by a hydrogen leak and a balky engine sensor. Mission managers say Artemis will fly when everything's ready—but haven't yet specified whether that might be in late September or in mid-October.</em></p><p>“When you look at the rocket, it looks almost retro,” said <a href=\"https://www.nasa.gov/feature/nasa-administrator-bill-nelson/\" target=\"_blank\">Bill Nelson</a>, the administrator of NASA. “Looks like we’re looking back toward the Saturn V. But it’s a totally different, new, highly sophisticated—more sophisticated—rocket, and spacecraft.”</p><p><a href=\"https://www.nasa.gov/specials/artemis/\" rel=\"noopener noreferrer\" target=\"_blank\">Artemis</a>, powered by the <a href=\"https://spectrum.ieee.org/nasas-space-launch-system-will-lift-off\" target=\"_self\">Space Launch System</a> rocket, is America’s first attempt to send astronauts to the moon since <a href=\"https://history.nasa.gov/SP-4029/Apollo_17a_Summary.htm\" rel=\"noopener noreferrer\" target=\"_blank\">Apollo 17</a> in 1972, and technology has taken giant leaps since then. On <a href=\"https://www.nasa.gov/artemis-1\" rel=\"noopener noreferrer\" target=\"_blank\">Artemis I</a>, the first test flight, mission managers say they are taking the SLS, with its uncrewed <a href=\"https://www.nasa.gov/exploration/systems/orion/about/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">Orion</a> spacecraft up top, and “stressing it beyond what it is designed for”—the better to ensure safe flights when astronauts make their first landings, currently targeted to begin with <a href=\"https://en.wikipedia.org/wiki/Artemis_3\" target=\"_blank\">Artemis III</a> in 2025.</p><p>But Nelson is right: The rocket <em>is</em> retro in many ways, borrowing heavily from the space shuttles America flew for 30 years, and from the Apollo-Saturn V.</p><p>Much of Artemis’s hardware is refurbished: Its four main engines, and parts of its two strap-on boosters, all flew before on shuttle missions. The rocket’s apricot color comes from spray-on insulation much like the foam on the shuttle’s external tank. And the large maneuvering engine in Orion’s service module is actually 40 years old—used on 19 space shuttle flights between 1984 and 1992.</p><p class=\"pull-quote\">“I have a name for missions that use too much new technology—failures.”<br/>—John Casani, NASA</p><p>Perhaps more important, the project inherits basic engineering from half a century of spaceflight. Just look at Orion’s crew capsule—a truncated cone, somewhat larger than the Apollo Command Module but conceptually very similar.</p><p>Old, of course, does not mean bad. NASA says there is no need to reinvent things engineers got right the first time.</p><p>“There are certain fundamental aspects of deep-space exploration that are really independent of money,” says <a href=\"https://www.linkedin.com/in/jim-geffre-381959225/\" rel=\"noopener noreferrer\" target=\"_blank\">Jim Geffre</a>, Orion vehicle-integration manager at the Johnson Space Center in Houston. “The laws of physics haven’t changed since the 1960s. And capsule shapes happen to be really good for coming back into the atmosphere at Mach 32.”</p><p><a href=\"https://airandspace.si.edu/files/pdf/staff/rlaunius_cv.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Roger Launius</a>, who served as NASA’s chief historian from 1990 to 2002 and as a curator at the Smithsonian Institution from then until 2017, tells of a conversation he had with <a href=\"https://www.nae.edu/55569/John-R-Casani\" rel=\"noopener noreferrer\" target=\"_blank\">John Casani</a>, a veteran NASA engineer who managed the Voyager, Galileo, and Cassini probes to the outer planets.</p><p>“I have a name for missions that use too much new technology,” he recalls Casani saying. “Failures.”</p><p>The Artemis I flight is slated for about six weeks. (<a href=\"https://en.wikipedia.org/wiki/Apollo_11\" target=\"_blank\">Apollo 11</a> lasted eight days.) The ship roughly follows Apollo’s path to the moon’s vicinity, but then puts itself in what NASA calls a distant retrograde orbit. It swoops within 110 kilometers of the lunar surface for a gravity assist, then heads 64,000 km out—taking more than a month but using less fuel than it would in closer orbits. Finally, it comes home, reentering the Earth’s atmosphere at 11 km per second, slowing itself with a heatshield and parachutes, and splashing down in the Pacific not far from San Diego.</p><p class=\"pull-quote\"> If all four, quadruply redundant flight computer modules fail, there is a fifth, entirely separate computer onboard, running different code to get the spacecraft home.</p><p>“That extra time in space,” says Geffre, “allows us to operate the systems, give more time in deep space, and all those things that stress it, like radiation and micrometeoroids, thermal environments.”</p><p>There are, of course, newer technologies on board. Orion is controlled by two vehicle-management computers, each composed of two flight computer modules (FCMs) to handle guidance, navigation, propulsion, communications, and other systems. The flight control system, Geffre points out, is quad-redundant; if at any point one of the four FCMs disagrees with the others, it will take itself offline and, in a 22-second process, reset itself to make sure its outputs are consistent with the others’. If all four FCMs fail, there is a fifth, entirely separate computer running different code to get the spacecraft home.</p><p>Guidance and navigation, too, have advanced since the sextant used on Apollo. Orion uses a star tracker to determine its attitude, imaging stars and comparing them to an onboard database. And an optical navigation camera shoots Earth and the moon so that guidance software can determine their distance and position and keep the spacecraft on course. NASA says it’s there as backup, able to get Orion to a safe splashdown even if all communication with Earth has been lost.</p><p>But even those systems aren’t entirely new. Geffre points out that the guidance system’s architecture is derived from the Boeing 787. Computing power in deep space is limited by cosmic radiation, which can corrupt the output of microprocessors beyond the protection of Earth’s atmosphere and magnetic field.</p><p>Beyond that is the inevitable issue of cost. Artemis is a giant project, years behind schedule, started long before NASA began to buy other launches from companies like <a href=\"https://spectrum.ieee.org/search/?q=spacex\" target=\"_self\">SpaceX</a> and <a href=\"https://spectrum.ieee.org/rocket-booster-rocket-lab\" target=\"_self\">Rocket Lab</a>. NASA’s inspector general, Paul Martin, <a href=\"https://science.house.gov/imo/media/doc/Martin%20Testimony4.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">testified to Congress</a> <a href=\"https://www.youtube.com/watch?v=0IhX8OoekwU&t=2018s\" rel=\"noopener noreferrer\" target=\"_blank\">in March</a> that the first four Artemis missions would cost US $4.1 billion each—“a price tag that strikes us as unsustainable.”</p><p>Launius, for one, rejects the argument that government is inherently wasteful. “Yes, NASA’s had problems in managing programs in the past. Who hasn’t?” he says. He points out that Blue Origin and SpaceX have had plenty of setbacks of their own—they’re just not obliged to be public about them. “I could go on and on. It’s not a government thing per se and it’s not a NASA thing per se.”</p><p>So why return to the moon with—please forgive the pun—such a retro rocket? Partly, say those who watch Artemis closely, because it’s become <a href=\"https://spectrum.ieee.org/gao-warns-of-deteriorating-costs-and-schedules-in-nasas-major-project-portfolio\" target=\"_self\">too big to fail</a>, with so much American money and brainpower invested in it. Partly because it turns NASA’s astronauts outward again, <a href=\"https://spectrum.ieee.org/private-space-stations\" target=\"_self\">exploring</a> instead of maintaining a space station. Partly because new perspectives could come of it. And partly because <a href=\"https://aviationweek.com/defense-space/space/opinion-why-nasas-artemis-matters\" rel=\"noopener noreferrer\" target=\"_blank\">China and Russia</a> have ambitions in space that threaten America’s.</p><p>“Apollo was a demonstration of technological verisimilitude—to the whole world,” says Launius. “And the whole world knew then, as they know today, that the future belongs to the civilization that can master science and technology.”</p><p><em><strong>Update 7 Sept.: </strong>Artemis I has been on launchpad 39B, not 39A as previously reported, at Kennedy Space Center. </em><br/></p>",
  "pubDate": "Sun, 28 Aug 2022 13:00:00 +0000",
  "guid": "https://spectrum.ieee.org/artemis-1-revives-moonshot",
  "category": [
    "Space exploration",
    "Artemis",
    "Nasa",
    "Moon exploration",
    "Moonshot"
  ],
  "dc:creator": "Ned Potter",
  "media:content": ""
}