{
  "title": "Data Bites: 7 TV Shows that Jumped the Shark",
  "description": "<p>There is a fine line between keeping your viewers interested, intrigued, and emotionally invested and crossing the line with a stunt whose main purpose is to spark their waning interest.\n<br/><br/>\nIf a television series has pulled off the latter, it is (at best) fighting an uphill battle and, at worst, on its way off the air.\n<br/><br/>\nThese critical junctures occur frequently in the world of TV entertainment, but the moment when a television show attempts to draw attention to or create publicity for something that is perceived as not warranting the attention it is known as “jumping the shark.”\n<br/><br/>\nFurthermore, the idiom typically refers to something that is past its peak in quality or relevance and popularity.\n<br/><br/>\nIn this post, we sift through seasons’ worth of IMDB ratings for various shows that supposedly “jumped the shark,” including <a href=\"http://www.imdb.com/title/tt0063878/\" target=\"_blank\">The Brady Bunch</a> (1969–1974), <a href=\"http://www.imdb.com/title/tt0411008/\" target=\"_blank\">Lost</a> (2004–2010), <a href=\"http://www.imdb.com/title/tt0455275/\" target=\"_blank\">Prison Break</a> (2005–2009), <a href=\"http://www.imdb.com/title/tt0088571/\" target=\"_blank\">Moonlighting</a> (1985–1989), <a href=\"http://www.imdb.com/title/tt0106179/\" target=\"_blank\">The X Files</a> (1993-present), <a href=\"http://www.imdb.com/title/tt0773262/\" target=\"_blank\">Dexter</a> (2006–2013), and <a href=\"http://www.imdb.com/title/tt0386676/\" target=\"_blank\">The Office</a> (2005–2013).\n<br/><br/>\nMotivation for this post stems from articles on TheRichest, RollingStone, and SCREENRANT about TV shows that may have jumped the shark.\n<!-- more -->\n<br/><br/>\nThe graphs below all feature an image to help identify the TV show. Check out how easy it is to add an image to a graph in Plotly:\n<br/><br/></p><center><img src=\"http://i.imgur.com/JXIhdrv.gif\" alt=\"Image\"/></center>\n<br/><br/>\nLearn how to add images to your charts in <a href=\"https://plot.ly/python/logos/\" target=\"_blank\">Python</a> and <a href=\"https://plot.ly/r/logos/\" target=\"_blank\">R</a>.\n<br/><br/><h1>1. The Brady Bunch</h1>\n<br/><br/><center><a href=\"https://plot.ly/~Dreamshot/8656/\" target=\"_blank\"><img src=\"http://i.imgur.com/aEAWGvT.png\" alt=\"The_Brady_Bunch\"/></a></center>\n<br/><br/>\nHere’s what <a href=\"http://www.therichest.com/expensive-lifestyle/entertainment/10-shocking-examples-of-tv-shows-jumping-the-shark/\" target=\"_blank\">TheRichest</a> had to say about The Brady Bunch and its rating fallout:\n<br/><br/><i>During the fifth season, Cousin Oliver was brought in as a member of the family. It was seen as such a big shark-jumping moment that it even caused a new term to be coined. “Cousin Oliver Syndrome” is known as what happens when a show brings in a new character to re-attract fans, and the gimmick didn’t pay off: after just six episodes, Cousin Oliver was removed from the show.</i>\n<br/><br/><h1>2. Lost</h1>\n<br/><br/><center><a href=\"https://plot.ly/~Dreamshot/8650/\" target=\"_blank\"><img src=\"http://i.imgur.com/7V6jvpp.png\" alt=\"Lost\"/></a></center>\n<br/><br/>\nLost is an interesting case. The rating trend a flat line through the whole series, but still the show is considered a shark jumper by <a href=\"http://www.rollingstone.com/tv/lists/jumping-the-shark-20141002/lost-20141002\" target=\"_blank\">RollingStone</a>:\n<br/><br/><i>No one agrees when exactly Lost lost its mojo, because there is no one JTS moment that stands above the rest. Was it when the survivors met the Others and they didn’t make any sense? Or when the infamously annoying Nikki and Paulo materialized on the scene? Or when Claire got amnesia? Or when the Island traveled back in time? Or when Locke was resurrected? Or when it turned out that all the evil in the world was being held back by a literal cork? Or when… The point is, Lost disappointed us at least as many times as it bowled us over.</i>\n<br/><br/><h1>3. Prison Break</h1>\n<br/><br/><center><a href=\"https://plot.ly/~Dreamshot/8646/\" target=\"_blank\"><img src=\"http://i.imgur.com/IqhhEDQ.png\" alt=\"Prison_Break\"/></a></center>\n<br/><br/>\nPrison Break exhibited a steep decline in show ratings over the course of its 4 season run. <a href=\"http://screenrant.com/best-tv-shows-series-jumped-shark/\" target=\"_blank\">SCREENRANT</a> declared it a shark jumper:\n<br/><br/><i>Another high-concept show of the 2000s, Prison Break was another instant hit. The story of the two brothers, one sentenced to death for a crime he did not commit, and the other who devises an elaborate plan to help his brother escape prison and clear his name drew in big audiences. At the end of the first season, the brothers, along with several others, escape in a tunnel dug beneath the walls of the prison.\n<br/><br/>\nThe second season followed a very different format and met with mixed reactions. Some praised the change in direction, feeling that they couldn’t stay in the prison forever. Others felt that the show had become too different to the original formula and had become a show about fugitives as opposed to prisoners. At the end of season 2, several prisoners were recaptured and imprisoned in Panama.\nDespite running for a further 2 seasons, most viewers agreed that the show declined in quality sometime during season 2.</i>\n<br/><br/><br/><br/><h1>4. Moonlighting</h1>\n<br/><br/><center><a href=\"https://plot.ly/~Dreamshot/8648/\" target=\"_blank\"><img src=\"http://i.imgur.com/u8PGDWS.png\" alt=\"Moonlighting\"/></a></center>\n<br/><br/><i>Moonlighting was the definitive will-they-won’t-they show, with most of the attention being given to the chemistry between co-stars Bruce Willis and Cybill Sheppard. The show was a mixture of drama, comedy, and romance, and was considered to be one of the first successful examples of comedy-drama, or “dramedy.”\n<br/><br/>\nDespite being a massive hit, once the two leads entered into a relationship, the show was in trouble. While the investigations of the private detective agency had been central to the show, along with successful gimmicks such as their “breaking the fourth wall,” the main audience draw was waiting for the couple to give in to the sexual chemistry between them.\n<br/><br/>\nWhen the couple finally got together in season 3, there were behind the scenes complications which added to the shows problems. Cybill Sheppard was off having twins, so they had to shoot her scenes in advance, causing much fewer scenes with her and Bruce Willis. Also, Willis was making Die Hard. When that was a massive success, his interest in making a weekly show waned, due to his blooming movie career.\n<br/><br/>\n-<a href=\"http://screenrant.com/best-tv-shows-series-jumped-shark/\" target=\"_blank\">SCREENRANT</a>\n</i>\n<br/><br/><br/><br/><h1>5. The X Files</h1>\n<br/><br/><center><a href=\"https://plot.ly/~Dreamshot/8654/\" target=\"_blank\"><img src=\"http://i.imgur.com/5NOqheF.png\" alt=\"X_Files\"/></a></center>\n<br/><br/><i>In a way, the fact that this show named one of their episodes “Jump the Shark” says it all. If you have to name an episode of your show that, it’s a pretty big example of self-realization. You could use several episodes as examples as to how The X-Files tried desperately to regain the luster it once had, but the most obvious ones are probably through their first movie in 1998, or the episode where Mulder leaves following the seventh season. To break up one of the most distinctive pairings on TV is a bold move, and one that didn’t exactly pay off the way The X-Files’ producers had hoped.\n<br/><br/>\n-<a href=\"http://www.therichest.com/expensive-lifestyle/entertainment/10-shocking-examples-of-tv-shows-jumping-the-shark/\" target=\"_blank\">TheRichest</a>\n</i>\n<br/><br/><br/><br/><h1>6. Dexter</h1>\n<br/><br/><center><a href=\"https://plot.ly/~Dreamshot/8658/\" target=\"_blank\"><img src=\"http://i.imgur.com/QI3V7lN.png\" alt=\"Dexter\"/></a></center>\n<br/><br/><i><b>Au revoir, unholy Trinity (Season 4, Episode 12)</b>\n<br/><br/>\nFacile argument: Dexter was ruined the moment its second season revealed itself, early on, as a weak re-brew of everything those first 12 episodes had so beautifully concocted. (Kill, cover-up, stalk worse killer, rinse, repeat.) But the true shark-leap was the moment that distinguished gentleman actor John Lithgow was knocked off at the end of Season Four. Many memorable stars came and went in Showtime’s serial-murderer drama, but in his single-season run as the Trinity Killer, Lithgow repeatedly stole the show — and then was forced to vacate it (at the same time as some crucial co-stars), leaving a huge void in his wake. You knew it was coming, yet the series never really recovered from the loss, and only worsened in its damnably formulaic approach as it bled out over four more long seasons.\n<br/><br/>\n-<a href=\"http://www.rollingstone.com/tv/lists/jumping-the-shark-20141002/dexter-20141002\" target=\"_blank\">RollingStone</a>\n</i>\n<br/><br/><h1>7. The Office</h1>\n<br/><br/><center><a href=\"https://plot.ly/~Dreamshot/8662/\" target=\"_blank\"><img src=\"http://i.imgur.com/CzXpPjj.png\" alt=\"The_Office\"/></a></center>\n<br/><br/><i><b>Jim and Pam tie the knot (Season 6, Episode 4)</b>\n<br/><br/>\nIn its heyday, Greg Daniels’s mockumentary sitcom was one of the best comedies on television, balancing cringe comedy and sweet-natured character studies. But that perfect blend began to sour around the same time as those crazy kids Jim and Pam finally got hitched; they consequently morphed into being annoying jerks, and we lost our audience surrogates into this world of socially delayed salesmen and bumbling accountants. The stakes became so low that the show had to start jumping through hoops, and the cringe humor became just plain cringeworthy. By the time the show’s boss Michael Scott (and Steve Carell) departed for greener pastures, The Office was already a shell of its former self.\n<br/><br/>\n-<a href=\"http://www.rollingstone.com/tv/lists/jumping-the-shark-20141002/dexter-20141002\" target=\"_blank\">RollingStone</a>\n</i>\n<br/><br/>\nAn example of a show that never jumped the shark:\n<br/><br/><b>Bates Motel</b>\n<br/><br/>\nA recently completed series, Bates Motel, is a prime example of a show that brought just the right amount of suspense and surprise without doing the shark jump. The ratings below speak for themselves.\n<br/><br/><center><a href=\"https://plot.ly/~Dreamshot/8664/\" target=\"_blank\"><img src=\"http://i.imgur.com/xVDfF77.png\" alt=\"Bates_Motel\"/></a></center>\n<br/><br/>\nPlotly is built by computational scientists with degrees and research expertise from McGill, Harvard, Stanford, and other world-class institutions. Making no-compromise open-source software for scientific visualization is our full-time job and passion. Want to support our work? Consider purchasing a Pro plan. For less than half the cost of a Tableau license, you’ll get support from our engineering staff and time-saving ways to save and share your work with colleagues, advisors, or managers.\n<br/><br/><a href=\"https://plot.ly/education/\" target=\"_blank\">Pro Plans for University students and instructors ($59/year)</a>\n<br/><br/><a href=\"https://plot.ly/products/cloud/\" target=\"_blank\">Pro Plans for industry users ($396/year)</a>",
  "link": "https://blog.plotly.com/post/161089856647",
  "guid": "https://blog.plotly.com/post/161089856647",
  "pubDate": "Fri, 26 May 2017 06:46:08 -0400",
  "category": [
    "television",
    "media",
    "popculture",
    "data",
    "datascience",
    "datavisualization"
  ]
}