{
  "title": "Imaging the decay of quantized vortex rings to decipher quantum dissipation. (arXiv:2211.01560v1 [cond-mat.quant-gas])",
  "link": "http://arxiv.org/abs/2211.01560",
  "description": "<p>Like many quantum fluids, superfluid helium-4 (He II) can be considered as a\nmixture of two miscible fluid components: an inviscid superfluid and a viscous\nnormal fluid consisting of thermal quasiparticles [1]. A mutual friction\nbetween the two fluids can emerge due to quasiparticles scattering off\nquantized vortex lines in the superfluid [2]. This quantum dissipation\nmechanism is the key for understanding various fascinating behaviors of the\ntwo-fluid system [3,4]. However, due to the lack of experimental data for\nguidance, modeling the mutual friction between individual vortices and the\nnormal fluid remains an unsettled topic despite decades of research [5-10].\nHere we report an experiment where we visualize the motion of quantized vortex\nrings in He II by decorating them with solidified deuterium tracer particles.\nBy examining how the rings spontaneously shrink and accelerate, we provide\nunequivocal evidences showing that only a recent theory [9] which accounts for\nthe coupled motion of the two fluids with a self-consistent local friction can\nreproduce the observed ring dynamics. Our work eliminates long-standing\nambiguities in our theoretical description of the vortex dynamics in He II,\nwhich will have a far-reaching impact since similar mutual friction concept has\nbeen adopted for a wide variety of quantum two-fluid systems, including atomic\nBose-Einstein condensates (BECs) [11,12], superfluid neutron stars [13-15], and\ngravity-mapped holographic superfluid [16,17].\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Tang_Y/0/1/0/all/0/1\">Yuan Tang</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Guo_W/0/1/0/all/0/1\">Wei Guo</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Kobayashi_H/0/1/0/all/0/1\">Hiromichi Kobayashi</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Yui_S/0/1/0/all/0/1\">Satoshi Yui</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Tsubota_M/0/1/0/all/0/1\">Makoto Tsubota</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Kanai_T/0/1/0/all/0/1\">Toshiaki Kanai</a>"
}