{
  "title": "Episode 107: &#8220;Surf City&#8221; by Jan and Dean",
  "link": "https://500songs.com/podcast/episode-107-surf-city-by-jan-and-dean/",
  "pubDate": "Tue, 08 Dec 2020 14:21:35 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-107-surf-city-by-jan-and-dean/",
  "description": "Episode 107 of&nbsp;<em>A History of Rock Music in 500 Songs</em> looks at \"Surf City\" and the career of Jan and Dean, including a Pop Symphony, accidental conspiracy to kidnap, and a career that both started and ended with attempts to get out of being drafted. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/44805168\">&nbsp;on \"Hey Little Cobra\" by the Rip Chords</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nNo Mixcloud this week, due to the number of songs by Jan and Dean.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes. <em>The Grand High Potentates of California Rock: Jan and Dean \"In Perspective\" 1958-1968 </em>is the one I used most here, but I referred to several. His books can be found at&nbsp;<a href=\"https://payhip.com/CMusicBooks\">https://payhip.com/CMusicBooks</a>\n\nI also used&nbsp;<a href=\"https://amzn.to/3gthZMi\">Dead Man's Curve and Back: The Jan and Dean Story</a> by Mark Thomas Passmore, and Dean Torrence's autobiography&nbsp;<a href=\"https://amzn.to/3oDCXuJ\"><em>Surf City</em></a>.\n\nThe original mono versions of the Liberty singles are only available on an out-of-print CD that goes for over £400, and many compilations have later rerecordings (often by Dean without Jan) but <a href=\"https://amzn.to/3mVSdmg\">this </a>has the proper recordings, albeit in stereo mixes. <a href=\"https://amzn.to/3n1RJuM\">This </a>compilation contains their pre-Liberty singles, including the Jan & Arnie material.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nA warning about this episode -- it features some discussion of a car crash and resulting disability and recovery, which may be upsetting to some people.\n\nToday we're going to look at one of the most successful duos in rock and roll history, but one who have been relegated to a footnote because of their collaboration with a far more successful band, who had a similar sound to them. We're going to look at Jan and Dean, and at \"Surf City\":\n\n[Excerpt: Jan and Dean, \"Surf City\"]\n\nThe story of Jan and Dean begins with Jan and Arnie, and with the Barons. We discussed the Barons briefly in the episode on \"LSD-25\", a few months ago, but only in passing, so to recap -- the Barons were a singing group that formed at University High School in LA in the late fifties, centred around Jan Berry. Various people involved in the group's formation went on to be important parts of the LA music scene in the sixties, but by 1958 they were down to Berry and his friends Arnie Ginsburg -- not the DJ we talked about last episode, Dean Torrence, and Don Altfeld.\n\nThe group members all had a love for R&B, and hung around with various of the Black groups of the time -- Don Altfeld has talked about him and Berry being present, but not participating, for Richard Berry's recording of \"Louie Louie\", though his memories of the time seem confused in the interviews I've read. And Jan Berry in particular was a real music obsessive, and had what may have been the biggest R&B and rock and roll record collection in LA -- which he obtained by scamming record companies, which seems to be very in character for him. He got a letterhead made up for a fake radio station, KJAN, and wrote to every record company he could find asking for promo copies. He ended up getting six copies of every new release \"to play on the radio\", and would give some of the extra copies to his friends -- and others he would use as frisbees. According to Torrence, Berry would often receive two hundred new records a day, all free.\n\nBerry had a reel-to-reel tape recorder belonging to his father -- his father, William Berry, was important in the Howard Hughes organisation, and had been in charge of the Spruce Goose project, even flying in the famous plane with Hughes, and Hughes had given him the tape recorder, which unlike almost all recording equipment available in the fifties had a primitive reverb function built in.\n\nWith that and a microphone stolen from the school auditorium, Berry started recording himself and his friends, and he'd wanted to play one of the tapes he'd made at a party, so he'd taken it to a studio to be cut as an acetate, where it had been heard by Joe Lubin of Arwin Records, who took the tape and got session musicians to overdub it:\n\n[Excerpt: Jan and Arnie, \"Jennie Lee\"]\n\nThat record was released as by Jan and Arnie, rather than the Barons -- Dean Torrence was off doing six months in the army, to get out of being conscripted later. Torrence has always said that he could hear himself on the recording, and that it was one the Barons had done together, but everyone else involved has claimed that while the Barons did record a version of that song, the finished version only features Jan and Arnie's vocals. Don Altfeld didn't sing on it, because he was never allowed to sing in the Barons -- he was forced to just mouth along, which given that both Jan and Dean were known for regularly singing flat must say something about just how bad a singer he is -- though he did apparently hit a metal chair leg as percussion on the record.\n\n\"Jennie Lee\" went to number three on the Cashbox chart -- number eight on Billboard -- and was a big enough hit that it set a precedent for how all the records Jan Berry would be involved in for the next few years would be made -- he would record vocals and piano in his garage, with a ton of reverb, and then the backing track would be recorded to that, usually by the same group of musicians that played on records by people like Sam Cooke, Ritchie Valens, and other late-fifties LA singers -- a group centred around Ernie Freeman on piano and organ, Rene Hall on guitar, and Earl Palmer on drums. This was a completely backwards way of recording -- normally you'd have the musicians play the backing track first and then overdub the vocals on it -- but it was how they would carry on doing things for several years.\n\nJan and Arnie's follow-up, \"Gas Money\", written by Berry, Ginsburg, and Altfeld, did less well, only making number eighty-one in the charts:\n\n[Excerpt: Jan and Arnie, \"Gas Money\"]\n\nAnd their third single didn't chart at all. By this point, Arnie Ginsburg was getting thoroughly sick of working with Jan Berry -- pretty much without exception everyone who knew Berry in the fifties and early sixties says two things about him -- that he was the single most intelligent person they ever met, and that he was a domineering egomaniac who used anyone he could remorselessly. Jan and Arnie split up, and Arwin Records seems to have decided to stick with Arnie, rather than Jan -- though this might have been because Arnie seemed *less* likely to have hits, as Dean Torrence has later claimed that Arwin was a tax dodge -- it was owned by Marty Melcher, Doris Day's husband, and seems to have been used as much to get out of paying as much tax on the family's vast wealth as it was a real record label.\n\nWhatever the reason, though, Arnie made one more single, as The Rituals, backed by many of the people who had played with The Barons -- Bruce Johnston, Sandy Nelson, and Dave Shostac, plus their regular collaborators Mike Deasy, Richie Polodor and Harper Cosby. It didn't chart:\n\n[Excerpt: The Rituals, \"Girl in Zanzibar\"]\n\nDean Torrence, who had by now left the Army, saw his chance, and soon Jan and Arnie had become Jan and Dean -- after a brief phase in which it looked like they might persuade Dean to change his name in order to avoid losing the group name. They hooked up with a new management and production team, Lou Adler and Herb Alpert, who had both been working at Keen Records with Sam Cooke. Kim Fowley later said that it was him who persuaded Adler to sign the duo, but Kim Fowley said a lot of things, very few of them true.\n\nAdler and Alpert got the new duo signed to Doré Records, a small label based in LA, and their first release on the label was a cover version of a record originally by a group called the Laurels:\n\n[Excerpt: The Laurels, \"Baby Talk\"]\n\nHerb Alpert brought that song to the duo, and their version became a top ten hit, with Jan singing the low parts and Dean singing the lead:\n\n[Excerpt: Jan and Dean, \"Baby Talk\"]\n\nThe hit was big enough that budget labels released soundalike cover versions of it, one of which was by a duo called Tom and Jerry, who had been one hit wonders a year earlier:\n\n[Excerpt: Tom and Jerry, \"Baby Talk\"]\n\nThat cover version was unsuccessful, something Paul Simon and Art Garfunkel were probably very grateful for when they reinvented themselves as sensitive folkies a couple of years later.\n\nAround this time, Jan got his girlfriend pregnant. In order not to spoil their son's promising career -- as well as being a singer, he was also at university and planned to become a doctor -- Jan's parents adopted his son and raised the boy as their own son.\n\nThe duo went on a tour with Little Willie John, Bobby Day, and Little Richard's old backing band The Upsetters, playing to mainly Black audiences -- a tour they were booked on because almost all West Coast doo-wop at that time was from Black singers. Once the mistake was realised, a decision was made to promote the new duo's image more -- lots of photos of the very blonde, very white, duo started to be released, as a way to reassure the white audience.\n\nThe duo's film-star good looks assured them of regular coverage in the teen magazines, but they didn't have any more hits on Doré -- of the seven singles they released in the two years after \"Baby Talk\", none of them got to better than number fifty-three on the charts.\n\nEventually the duo left Doré, and Jan released one solo single, \"Tomorrow's Teardrops\":\n\n[Excerpt: Jan Berry, \"Tomorrow's Teardrops\"]\n\nThat was actually released as by Jan Barry, rather than Jan Berry, at a point when the duo had actually split up -- Dean was getting tired of not having any further hit records, and wanted to concentrate on his college work, while Berry was one of those people who needs to be doing several things simultaneously. Berry's new girlfriend Jill Gibson added backing vocals -- by this time he'd dumped the one he'd got pregnant -- and the song was written by Berry and Altfeld. Jan actually started his own label, Ripple Records -- named after the brand of cheap wine -- to release it, and Dean created the logo for him -- the first of many he would create over the years.\n\nHowever, the duo soon reunited, and came up with a plan which would have them only touring during the summer break, and doing local performances in the LA area on those weekends when neither had any homework. Now they needed to get signed to a major label. The one they wanted was Liberty, the label that Eddie Cochran had been on, and whose owner, Si Waronker, was actually the cousin of the owners of Doré.\n\nAnd they had recorded a track that they were sure would get them signed to Liberty. The Marcels had recently had a hit with their doo-wop revival of the old standard \"Blue Moon\":\n\n[Excerpt: The Marcels, \"Blue Moon\"]\n\nJan had decided to make a soundalike arrangement of another song from the same period, using the same chord changes -- the old Hoagy Carmichael song \"Heart and Soul\":\n\n[Excerpt: Jan and Dean, \"Heart and Soul\"]\n\nThey were sure that would be a hit. But Herb Alpert wasn't -- he thought it was a dreadful record, He hated it so much, in fact, that he broke up his partnership with Lou Adler. The division of the partnership's assets was straightforward -- they owned Jan and Dean's contract, and they owned a tape recorder. Alpert got the tape recorder, and Adler got Jan and Dean.\n\nAlpert went on to have a string of hit records as a trumpet player, starting with \"The Lonely Bull\" in 1962:\n\n[Excerpt: Herb Alpert, \"The Lonely Bull\"]\n\nHe later formed his own record label, A&M, and never seems to have regretted losing Jan & Dean.\n\nJan and Dean took their tape of \"Heart and Soul\" to Liberty Records, who said that they did want to sign Jan and Dean, but they didn't want to release a record like that -- they told them to take it somewhere else, and then when the single was a flop, they could come back to Liberty and make some proper records.\n\nSo the duo got a two-record deal with the small label Challenge Records, on the understanding that after those two singles they would move on to Liberty. And \"Heart and Soul\" turned out to be a big hit, making number twenty-five on the charts:\n\n[Excerpt: Jan and Dean, \"Heart and Soul\"]\n\nTheir second single on Challenge only made number one hundred and four, but by this time they knew the drill -- they'd release their first single on a new label, it would be a big hit, then everything after that would be a flop. But they were going to a new label anyway, and they were sure their first single on Liberty Records would be a huge hit, just like every time they changed labels.\n\nThe first record they put out on Liberty was a cover of another oldie, \"A Sunday Kind of Love\", suggested by Si Waronker's son Lenny, who we'll be hearing a lot more about in future episodes. By this point Lou Adler was working for Aldon Music as their West Coast representative, and so the track was credited as \"produced by Lou Adler for Nevins-Kirshner\", but Jan was given a separate arrangement credit on the record.\n\nBut despite their predictions that the single would be a hit because it was a new label, it only made number ninety-four on the charts. The follow-up, \"Tennessee\", was a song which had been more or less forced on them -- it was originally one of the recordings that Phil Spector produced during his short-lived contract with Liberty, for a group called the Ducanes, but when the Ducanes had made a hash of it, Liberty forced the song on Jan & Dean instead:\n\n[Excerpt: Jan and Dean, \"Tennessee\"]\n\nBy this time, while Ernie Freeman was still the studio leader of the session musicians, Jan was requesting a rather larger group of musicians, and they'd started recording the backing tracks first. The musicians on \"Tennessee\" included Tommy Allsup and Jerry Allison of the Crickets, Earl Palmer on drums, and Glen Campbell on guitar, but even these proven hit-makers couldn't bring the song to more than number sixty-nine on the charts.\n\nAnd even that was better than their next two singles, neither of which even made the Hot One Hundred -- though the fact that by this point they were reduced to recording versions of \"Frosty The Snowman\", and attempting to recapture their first hit with a sequel called \"She's Still Talking Baby Talk\" shows how desperately they were casting around for something, anything that could be a hit.\n\nEventually they found something that worked. A group called the Regents had recently had a hit with \"Barbara Ann\":\n\n[Excerpt: The Regents, \"Barbara Ann\"]\n\nThe duo had cut a cover version of that for their most recent album, and they thought it had worked well, and so they wanted something else that would allow Dean to sing a falsetto lead, over a bass vocal by Jan, with a girl's name in the title. They eventually hit on an old standard from the 1940s, originally written as a favour for the songwriter's lawyer, Lee Eastman, about his then one-year-old daughter Linda (who we'll be hearing more about later in this series).\n\nTheir version of \"Linda\" finally gave them another hit after five flops in a row, reaching number twenty-eight in the charts:\n\n[Excerpt: Jan and Dean, \"Linda\"]\n\nTheir career was on an upswing again, and then everything changed for them when they played a gig with support from a local band who had just started having hits, the Beach Boys. The story goes that the Beach Boys were booked to do their own support slot and then to back Jan and Dean on their set. The show went down well with the audience, and they wanted an encore, but Jan and Dean had run out of rehearsed songs. So they suggested that the Beach Boys play their own two singles again, and Jan and Dean would sing with them. The group were flattered that two big stars like Jan and Dean would want to perform their songs, and eagerly joined in.\n\nSuddenly, Jan and Dean had an idea -- their next album was going to be called Jan & Dean Take Linda Surfin', but as yet they hadn't recorded any surf songs. They invited the Beach Boys to come into the studio and record new versions of their two singles for Jan & Dean's album, with Jan and Dean singing the leads:\n\n[Excerpt: Jan and Dean and the Beach Boys, \"Surfin'\"]\n\nThe Beach Boys weren't credited for that session, as they were signed to another label, but it started a long collaboration between the two groups. In particular, the Beach Boys' leader Brian Wilson became a close collaborator with Berry. And at that same session, Wilson gave Jan and Dean what would become their biggest hit.\n\nAfter the recording, Jan and Dean asked Wilson if he had any new songs they might be able to do. The first one he played them, \"Surfin' USA\", he told them they couldn't do anything with as he wanted that for the Beach Boys themselves. But then he played them two others. The one that Jan and Dean saw most potential in was a song he'd completed, \"Gonna Hustle You\":\n\n[Excerpt: Brian Wilson, \"Gonna Hustle You\"]\n\nThe duo wanted that as their next single, but Liberty Records flat out refused to put out something that sounded so dirty as \"Gonna Hustle You\". They tried rewriting it as \"Get a Chance With You\", but even that was too much. They put the song aside, though they'd return to it later as \"The New Girl In School\", which would become a minor hit for them.\n\nInstead, they worked on a half-completed song that Wilson had started, very much in the same mould as the first two Beach Boys singles, with the provisional title \"Goodie Connie Won't You Please Come Home\". This song would become the first of many Jan and Dean songs for which the songwriting credit is disputed.\n\nNo-one argues with the fact that the basic idea of the song was Brian Wilson's, but Jan Berry's process was to get a lot of people to throw ideas in, sometimes working in a group, sometimes working separately and not even knowing that other people had been involved. The song is officially credited to Wilson and Berry, but Don Altfeld has also claimed he contributed to it, Dean Torrence says that he wrote about a quarter of the lyrics, and it's also been suggested that Roger Christian wrote the lyrics to the first verse.\n\nChristian was an LA-area DJ who was obsessed with cars, and had come to Wilson's attention after he'd said on the air that the Beach Boys' \"409\" was a great song about a bad car. He'd started writing songs with Wilson, and he would also collaborate with both Jan Berry and Wilson's friend Gary Usher (who was a big part of this scene but hardly ever worked with Jan and Dean because he hated Jan). Almost every car song from this period, by the Beach Boys, Jan and Dean, or any number of studio groups, was co-written by Christian, and we'll be hearing more about him in a future episode.\n\nThis group of people -- Jan and Dean, Brian Wilson, Roger Christian, and Don Altfeld -- would write together in various combinations, and write a lot of hits, but a lot of the credits were assigned more or less randomly -- though Jan Berry was almost always credited, and Dean Torrence almost never was.\n\nThe completed song, titled \"Surf City\", was recorded with members of the Wrecking Crew -- the studio musicians who usually worked with Phil Spector -- performing the backing track. In this case, these were Hal Blaine, Glen Campbell, Earl Palmer, Bill Pitman, Ray Pohlman and Billy Strange -- there were two drummers because Berry liked a big drum sound. Brian Wilson was at the session, and soon after this he started using some of those musicians himself.\n\nWhile it was released as a Jan and Dean record, Dean doesn't sing on it at all -- the vocals featured Jan, three singers from another Liberty Records group called the Gents, and Brian Wilson, with Wilson and Tony Minichello of the Gents singing the falsetto parts that Dean would sing live:\n\n[Excerpt: Jan and Dean, \"Surf City\"]\n\nThat went to number one, becoming Jan and Dean's only number one, and Brian Wilson's first -- much to the fury of Wilson's father Murry, who thought that Wilson's hits should only be going to the Beach Boys. Murry Wilson may well have been more bothered by the fact that the publishing for the song went to Columbia/Screen Gems, to whom Jan was signed, rather than to Sea of Tunes, the company that published Wilson's other songs, and which was owned by Murry himself.\n\nMurry started calling Jan a \"pirate\", which prompted Berry to turn up to a Beach Boys session wearing a full pirate costume to taunt Murry.\n\nFrom \"Linda\" on, Jan and Dean had ten top forty hits with ten singles -- one of the B-sides also charted, but they did miss with \"Here They Come From All Over The World\", the theme tune for the TAMI Show, a classic rock concert film on which Jan and Dean appeared both as singers and as the hosts. That was by far their weakest single from this period, being as it is just a list of the musicians in the show, some of them described incorrectly -- the song talks about \"The Rolling Stones from Liverpool\" and James Brown being \"the King of the Blues\".\n\nAll of these hits were made by the same team. The Wrecking Crew would play the instruments, the Gents -- now renamed the Matadors, and sometimes the Blossoms would provide backing vocals on the earlier singles. The later ones would feature the Fantastic Baggies instead of the Matadors -- two young songwriters, Steve Barri and P.F. Sloan, who were also making their own surf records. The lead would be sung by Jan, the falsetto by some combination of Brian Wilson, Dean Torrence, Tony Minichello and P.F. Sloan -- often Dean wouldn't appear at all. The singles would be written by some combination of Wilson, Berry, Altfeld and Christian, and the songs would be about the same subjects as the Beach Boys' records -- surf, cars, girls, or some combination of the three.\n\nSometimes the records would be just repetitions of the formula, like \"Drag City\", which was an attempt at a second \"Surf City\":\n\n[Excerpt: Jan and Dean, \"Drag City\"]\n\nBut often there would be a self-parodic element that wasn't present in the Beach Boys' singles, as in \"The Little Old Lady From Pasadena\", a car song written by Berry, Christian, and Altfeld, based on a series of Dodge commercials featuring a car-racing old lady:\n\n[Excerpt: Jan and Dean, \"The Little Old Lady From Pasadena\"]\n\nAnd the grotesque \"Dead Man's Curve\", equal parts a serious attempt at a teen tragedy song and a parody of the genre, which took on a new meaning a few years after it was a hit:\n\n[Excerpt: Jan and Dean, \"Dead Man's Curve\"]\n\nBut while 1963 and 64 saw the duo rack up an incredible run of hits, they were making enemies. Jan was so unpleasant to people by this point that even the teen mags would call him out, with Teen Scene in March 1964 running an article which read, in part, \"Blast of the month goes to half of a certain group whose initials are J&D. Reason for the blast: his personality, which makes enemies faster than Carter makes pills... (It's the Jan Half)... Acting like Mr. Big Britches gets you nowhere, and your poor partner, who is one of the nicest guys on earth, shouldn't be forced to go around making apologies for your actions.\"\n\nAnd while Torrence may have been \"one of the nicest guys on Earth\", not all of his friends were. In fact, in December 1963, his closest friend, Barry Keenan, was the ringleader in the kidnapping of Frank Sinatra Jr. &nbsp;Keenan told Torrence about the plan in advance, and Torrence had lent Keenan a great deal of money, which Keenan used to finance the kidnapping. Torrence was accused of being a major part of the plot, though he was let off after testifying against the people who were actually involved -- he's always claimed that he thought that his friend's talking about his plan for the perfect crime was just talk, not a serious plan. Torrence had even offered suggestions, jokingly, which Keenan had incorporated -- and Keenan had left a bag containing fifty thousand dollars at Torrence's home, Torrence's share of the ransom money, which Torrence refused to keep.\n\nHowever, Sinatra Sr was annoyed enough at Torrence that a lot of plans for Jan and Dean TV shows and film appearances suddenly dried up.\n\nThe lack of TV and film appearances was a particular problem as the music industry was changing under them, and surf and hot rod records weren't the in thing any more -- and Brian Wilson seems to have been less interested in working with them as well, as the Beach Boys overtook Jan and Dean in popularity. 1965 saw them trying to figure out the new, more serious, music scene, with experiments like Pop Symphony Number 1, an album of orchestral arrangements of the duo's hits by Berry (who minored in music at UCLA) and George Tipton:\n\n[Excerpt: The Bel-Aire Pops Orchestra, \"Surf City\"]\n\nThe duo also tried going folk-rock, releasing an album called Folk 'n' Roll, which featured another variation on the \"Surf City\" and \"Drag City\" theme -- this one \"Folk City\":\n\n[Excerpt: Jan and Dean, \"Folk City\"]\n\nThat album didn't do well at all, not least because the lead-off single was a pro-war protest song, released as a Jan Berry solo single. Berry had become incensed by Buffy Saint-Marie's song \"The Universal Soldier\", and had written a right-wing response, \"The Universal Coward\":\n\n[Excerpt: Jan Berry, \"The Universal Coward\"]\n\nAs you can imagine, that was not popular with the folk-rock crowd, especially coming as it did from someone who was still managing to avoid the draft by studying medicine, even as he was also a pop star.\n\nTorrence became so irritated with Berry, and with the music they were making, during the recording of that album that he ended up going down the hall to another studio, where the Beach Boys were recording their unplugged Party! album, and sitting in with them. He suggested they do a new recording of \"Barbara Ann\", and he sang lead on it, uncredited:\n\n[Excerpt: The Beach Boys, \"Barbara Ann\"]\n\nThat went to number two on the charts, becoming the biggest hit record that Torrence ever sang on.\n\nTorrence was happier with the next project, though, an album spoofing the popular TV show Batman, with several comedy sketches, along with songs about the characters from the TV show:\n\n[Excerpt: Jan and Dean, \"Batman\"]\n\nBut by this point, in 1966, Jan and Dean's singles were doing absolutely nothing in the charts. In March, Liberty Records dropped them. And then on April the twelfth, 1966, something happened that would end their chances of another comeback. Jan Berry had been in numerous accidents over the previous few years -- he was a thrill-seeker, and would often end up crashing cars or breaking bones.\n\nOn April the twelfth, he had an appointment at the draft board, at which he was given bad news -- depending on which account you read, he was either told that his draft deferment was coming to an end and he was going to Vietnam straight away, or that he was going to Vietnam as soon as he graduated from medical school at the end of the school year. He was furious, and he got into his car.\n\nWhat happened next has been the subject of some debate. Some people say that a wheel came off his car -- and some have hinted that this was the result of some of Sinatra's friends getting revenge on Jan and Dean. Others just say he was driving carelessly, which he often did. Some have suggested that he was trying to deliberately get into a minor accident to avoid being drafted. Whatever happened, he was involved in a major accident, in which he, though luckily no-one else, was severely injured. He spent a month in a coma, and came out of it severely brain damaged. He had to relearn to read and speak, and for the rest of his life would have problems with his memory, his physical co-ordination, and his speech.\n\nLiberty kept releasing old Jan and Dean tracks, and even got them a final top twenty hit with \"Popsicle\", a song from a few years earlier. Dean made a Jan and Dean album, Save For a Rainy Day, without Jan, while Jan was still recovering, as a way of trying to keep their career options open if Jan ever got better. Dean put it out on the duo's own new label, J&D, and there were plans for Columbia to pick it up and give it a wider release, but Jan refused to sign the contracts -- he was furious that Dean had made a Jan and Dean record without him, and would have nothing to do with it.\n\nTorrence tried to have a music career anyway -- he put out a cover of the Beach Boys song \"Vegetables\" under the name The Laughing Gravy:\n\n[Excerpt: The Laughing Gravy, \"Vegetables\"]\n\nBut he soon gave up, and became an artist, designing covers and logos for people like Harry Nilsson, Canned Heat, the Turtles, and the Beach Boys.\n\nJan tried making his own Jan and Dean album without Dean, even though he was unable to sing again or write yet. With a lot of help from Roger Christian, he pulled together some old half-finished songs and finished them, got in some soundalike session singers and famous friends like Glen Campbell and Davy Jones of the Monkees and put together Carnival of Sound, an album that didn't get released until 2010:\n\n[Excerpt: Jan and Dean, “Girl You're Blowing My Mind\"]\n\nIn the mid-seventies, Jan and Dean got back together and started touring the nostalgia circuit, spurred by a TV movie, Dead Man's Curve, based on their lives. There seemed to be a love-hate relationship between them in later years -- they would split up and get back together, and their roles had reversed, with Dean now taking most of the leads on the shows -- Dean had to look after Jan a lot of the time, and some reports said that Jan had to relearn the words to the three songs he sang lead on every night. But with the aid of some excellent backing musicians, and with some love and tolerance from the audience for Jan's ongoing problems, they managed to regularly please crowds of thousands until a few weeks before Jan's death in 2004.\n\nSince then, Dean has mostly performed with the Surf City All-Stars, a band that sometimes also features Al Jardine and David Marks of the Beach Boys, playing a few shows a year. He released an autobiography in 2016 -- it came out at the same time as the autobiographies of Brian Wilson and Mike Love of the Beach Boys, ensuring that even at this late date, he would be overshadowed by his more famous colleagues.",
  "itunes:subtitle": "Episode 107 of&nbsp;A History of Rock Music in 500 Songs looks at Surf City and the career of Jan and Dean, including a Pop Symphony, accidental conspiracy to kidnap, and a career that both started and ended with attempts to get out of being drafted. Cli",
  "itunes:keywords": "Aldon Music,Arwin Records,Brian Wilson,Bruce Johnston,conscription,Dave Shostac,Davy Jones,Dean Torrence,Don Altfeld,doo wop,Doris Day,Earl Palmer,folk-rock,Frank Sinatra,Glen Campbell,Herb Alpert,Howard Hughes,Jan and Arnie,Jan and Dean,Jan Berry,Jill Gibson,Kim Fowley,Lee Eastman,Lenny Waronker,Liberty Records,Lou Adler,Mike Deasy,Murry Wilson,P.F. Sloan,Paul Simon,protest songs,Richard Berry,Sandy Nelson,Simon and Garfunkel,Steve Barri,surf music,the Barons,The Beach Boys,the Crickets,the Monkees,The Wrecking Crew,Vietnam War,vocal groups,white cover versions",
  "itunes:episodeType": "full",
  "itunes:episode": 107,
  "content:encoded": "Episode 107 of&nbsp;<em>A History of Rock Music in 500 Songs</em> looks at \"Surf City\" and the career of Jan and Dean, including a Pop Symphony, accidental conspiracy to kidnap, and a career that both started and ended with attempts to get out of being drafted. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/44805168\">&nbsp;on \"Hey Little Cobra\" by the Rip Chords</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nNo Mixcloud this week, due to the number of songs by Jan and Dean.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes. <em>The Grand High Potentates of California Rock: Jan and Dean \"In Perspective\" 1958-1968 </em>is the one I used most here, but I referred to several. His books can be found at&nbsp;<a href=\"https://payhip.com/CMusicBooks\">https://payhip.com/CMusicBooks</a>\n\nI also used&nbsp;<a href=\"https://amzn.to/3gthZMi\">Dead Man's Curve and Back: The Jan and Dean Story</a> by Mark Thomas Passmore, and Dean Torrence's autobiography&nbsp;<a href=\"https://amzn.to/3oDCXuJ\"><em>Surf City</em></a>.\n\nThe original mono versions of the Liberty singles are only available on an out-of-print CD that goes for over £400, and many compilations have later rerecordings (often by Dean without Jan) but <a href=\"https://amzn.to/3mVSdmg\">this </a>has the proper recordings, albeit in stereo mixes. <a href=\"https://amzn.to/3n1RJuM\">This </a>compilation contains their pre-Liberty singles, including the Jan & Arnie material.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nA warning about this episode -- it features some discussion of a car crash and resulting disability and recovery, which may be upsetting to some people.\n\nToday we're going to look at one of the most successful duos in rock and roll history, but one who have been relegated to a footnote because of their collaboration with a far more successful band, who had a similar sound to them. We're going to look at Jan and Dean, and at \"Surf City\":\n\n[Excerpt: Jan and Dean, \"Surf City\"]\n\nThe story of Jan and Dean begins with Jan and Arnie, and with the Barons. We discussed the Barons briefly in the episode on \"LSD-25\", a few months ago, but only in passing, so to recap -- the Barons were a singing group that formed at University High School in LA in the late fifties, centred around Jan Berry. Various people involved in the group's formation went on to be important parts of the LA music scene in the sixties, but by 1958 they were down to Berry and his friends Arnie Ginsburg -- not the DJ we talked about last episode, Dean Torrence, and Don Altfeld.\n\nThe group members all had a love for R&B, and hung around with various of the Black groups of the time -- Don Altfeld has talked about him and Berry being present, but not participating, for Richard Berry's recording of \"Louie Louie\", though his memories of the time seem confused in the interviews I've read. And Jan Berry in particular was a real music obsessive, and had what may have been the biggest R&B and rock and roll record collection in LA -- which he obtained by scamming record companies, which seems to be very in character for him. He got a letterhead made up for a fake radio station, KJAN, and wrote to every record company he could find asking for promo copies. He ended up getting six copies of every new release \"to play on the radio\", and would give some of the extra copies to his friends -- and others he would use as frisbees. According to Torrence, Berry would often receive two hundred new records a day, all free.\n\nBerry had a reel-to-reel tape recorder belonging to his father -- his father, William Berry, was important in the Howard Hughes organisation, and had been in charge of the Spruce Goose project, even flying in the famous plane with Hughes, and Hughes had given him the tape recorder, which unlike almost all recording equipment available in the fifties had a primitive reverb function built in.\n\nWith that and a microphone stolen from the school auditorium, Berry started recording himself and his friends, and he'd wanted to play one of the tapes he'd made at a party, so he'd taken it to a studio to be cut as an acetate, where it had been heard by Joe Lubin of Arwin Records, who took the tape and got session musicians to overdub it:\n\n[Excerpt: Jan and Arnie, \"Jennie Lee\"]\n\nThat record was released as by Jan and Arnie, rather than the Barons -- Dean Torrence was off doing six months in the army, to get out of being conscripted later. Torrence has always said that he could hear himself on the recording, and that it was one the Barons had done together, but everyone else involved has claimed that while the Barons did record a version of that song, the finished version only features Jan and Arnie's vocals. Don Altfeld didn't sing on it, because he was never allowed to sing in the Barons -- he was forced to just mouth along, which given that both Jan and Dean were known for regularly singing flat must say something about just how bad a singer he is -- though he did apparently hit a metal chair leg as percussion on the record.\n\n\"Jennie Lee\" went to number three on the Cashbox chart -- number eight on Billboard -- and was a big enough hit that it set a precedent for how all the records Jan Berry would be involved in for the next few years would be made -- he would record vocals and piano in his garage, with a ton of reverb, and then the backing track would be recorded to that, usually by the same group of musicians that played on records by people like Sam Cooke, Ritchie Valens, and other late-fifties LA singers -- a group centred around Ernie Freeman on piano and organ, Rene Hall on guitar, and Earl Palmer on drums. This was a completely backwards way of recording -- normally you'd have the musicians play the backing track first and then overdub the vocals on it -- but it was how they would carry on doing things for several years.\n\nJan and Arnie's follow-up, \"Gas Money\", written by Berry, Ginsburg, and Altfeld, did less well, only making number eighty-one in the charts:\n\n[Excerpt: Jan and Arnie, \"Gas Money\"]\n\nAnd their third single didn't chart at all. By this point, Arnie Ginsburg was getting thoroughly sick of working with Jan Berry -- pretty much without exception everyone who knew Berry in the fifties and early sixties says two things about him -- that he was the single most intelligent person they ever met, and that he was a domineering egomaniac who used anyone he could remorselessly. Jan and Arnie split up, and Arwin Records seems to have decided to stick with Arnie, rather than Jan -- though this might have been because Arnie seemed *less* likely to have hits, as Dean Torrence has later claimed that Arwin was a tax dodge -- it was owned by Marty Melcher, Doris Day's husband, and seems to have been used as much to get out of paying as much tax on the family's vast wealth as it was a real record label.\n\nWhatever the reason, though, Arnie made one more single, as The Rituals, backed by many of the people who had played with The Barons -- Bruce Johnston, Sandy Nelson, and Dave Shostac, plus their regular collaborators Mike Deasy, Richie Polodor and Harper Cosby. It didn't chart:\n\n[Excerpt: The Rituals, \"Girl in Zanzibar\"]\n\nDean Torrence, who had by now left the Army, saw his chance, and soon Jan and Arnie had become Jan and Dean -- after a brief phase in which it looked like they might persuade Dean to change his name in order to avoid losing the group name. They hooked up with a new management and production team, Lou Adler and Herb Alpert, who had both been working at Keen Records with Sam Cooke. Kim Fowley later said that it was him who persuaded Adler to sign the duo, but Kim Fowley said a lot of things, very few of them true.\n\nAdler and Alpert got the new duo signed to Doré Records, a small label based in LA, and their first release on the label was a cover version of a record originally by a group called the Laurels:\n\n[Excerpt: The Laurels, \"Baby Talk\"]\n\nHerb Alpert brought that song to the duo, and their version became a top ten hit, with Jan singing the low parts and Dean singing the lead:\n\n[Excerpt: Jan and Dean, \"Baby Talk\"]\n\nThe hit was big enough that budget labels released soundalike cover versions of it, one of which was by a duo called Tom and Jerry, who had been one hit wonders a year earlier:\n\n[Excerpt: Tom and Jerry, \"Baby Talk\"]\n\nThat cover version was unsuccessful, something Paul Simon and Art Garfunkel were probably very grateful for when they reinvented themselves as sensitive folkies a couple of years later.\n\nAround this time, Jan got his girlfriend pregnant. In order not to spoil their son's promising career -- as well as being a singer, he was also at university and planned to become a doctor -- Jan's parents adopted his son and raised the boy as their own son.\n\nThe duo went on a tour with Little Willie John, Bobby Day, and Little Richard's old backing band The Upsetters, playing to mainly Black audiences -- a tour they were booked on because almost all West Coast doo-wop at that time was from Black singers. Once the mistake was realised, a decision was made to promote the new duo's image more -- lots of photos of the very blonde, very white, duo started to be released, as a way to reassure the white audience.\n\nThe duo's film-star good looks assured them of regular coverage in the teen magazines, but they didn't have any more hits on Doré -- of the seven singles they released in the two years after \"Baby Talk\", none of them got to better than number fifty-three on the charts.\n\nEventually the duo left Doré, and Jan released one solo single, \"Tomorrow's Teardrops\":\n\n[Excerpt: Jan Berry, \"Tomorrow's Teardrops\"]\n\nThat was actually released as by Jan Barry, rather than Jan Berry, at a point when the duo had actually split up -- Dean was getting tired of not having any further hit records, and wanted to concentrate on his college work, while Berry was one of those people who needs to be doing several things simultaneously. Berry's new girlfriend Jill Gibson added backing vocals -- by this time he'd dumped the one he'd got pregnant -- and the song was written by Berry and Altfeld. Jan actually started his own label, Ripple Records -- named after the brand of cheap wine -- to release it, and Dean created the logo for him -- the first of many he would create over the years.\n\nHowever, the duo soon reunited, and came up with a plan which would have them only touring during the summer break, and doing local performances in the LA area on those weekends when neither had any homework. Now they needed to get signed to a major label. The one they wanted was Liberty, the label that Eddie Cochran had been on, and whose owner, Si Waronker, was actually the cousin of the owners of Doré.\n\nAnd they had recorded a track that they were sure would get them signed to Liberty. The Marcels had recently had a hit with their doo-wop revival of the old standard \"Blue Moon\":\n\n[Excerpt: The Marcels, \"Blue Moon\"]\n\nJan had decided to make a soundalike arrangement of another song from the same period, using the same chord changes -- the old Hoagy Carmichael song \"Heart and Soul\":\n\n[Excerpt: Jan and Dean, \"Heart and Soul\"]\n\nThey were sure that would be a hit. But Herb Alpert wasn't -- he thought it was a dreadful record, He hated it so much, in fact, that he broke up his partnership with Lou Adler. The division of the partnership's assets was straightforward -- they owned Jan and Dean's contract, and they owned a tape recorder. Alpert got the tape recorder, and Adler got Jan and Dean.\n\nAlpert went on to have a string of hit records as a trumpet player, starting with \"The Lonely Bull\" in 1962:\n\n[Excerpt: Herb Alpert, \"The Lonely Bull\"]\n\nHe later formed his own record label, A&M, and never seems to have regretted losing Jan & Dean.\n\nJan and Dean took their tape of \"Heart and Soul\" to Liberty Records, who said that they did want to sign Jan and Dean, but they didn't want to release a record like that -- they told them to take it somewhere else, and then when the single was a flop, they could come back to Liberty and make some proper records.\n\nSo the duo got a two-record deal with the small label Challenge Records, on the understanding that after those two singles they would move on to Liberty. And \"Heart and Soul\" turned out to be a big hit, making number twenty-five on the charts:\n\n[Excerpt: Jan and Dean, \"Heart and Soul\"]\n\nTheir second single on Challenge only made number one hundred and four, but by this time they knew the drill -- they'd release their first single on a new label, it would be a big hit, then everything after that would be a flop. But they were going to a new label anyway, and they were sure their first single on Liberty Records would be a huge hit, just like every time they changed labels.\n\nThe first record they put out on Liberty was a cover of another oldie, \"A Sunday Kind of Love\", suggested by Si Waronker's son Lenny, who we'll be hearing a lot more about in future episodes. By this point Lou Adler was working for Aldon Music as their West Coast representative, and so the track was credited as \"produced by Lou Adler for Nevins-Kirshner\", but Jan was given a separate arrangement credit on the record.\n\nBut despite their predictions that the single would be a hit because it was a new label, it only made number ninety-four on the charts. The follow-up, \"Tennessee\", was a song which had been more or less forced on them -- it was originally one of the recordings that Phil Spector produced during his short-lived contract with Liberty, for a group called the Ducanes, but when the Ducanes had made a hash of it, Liberty forced the song on Jan & Dean instead:\n\n[Excerpt: Jan and Dean, \"Tennessee\"]\n\nBy this time, while Ernie Freeman was still the studio leader of the session musicians, Jan was requesting a rather larger group of musicians, and they'd started recording the backing tracks first. The musicians on \"Tennessee\" included Tommy Allsup and Jerry Allison of the Crickets, Earl Palmer on drums, and Glen Campbell on guitar, but even these proven hit-makers couldn't bring the song to more than number sixty-nine on the charts.\n\nAnd even that was better than their next two singles, neither of which even made the Hot One Hundred -- though the fact that by this point they were reduced to recording versions of \"Frosty The Snowman\", and attempting to recapture their first hit with a sequel called \"She's Still Talking Baby Talk\" shows how desperately they were casting around for something, anything that could be a hit.\n\nEventually they found something that worked. A group called the Regents had recently had a hit with \"Barbara Ann\":\n\n[Excerpt: The Regents, \"Barbara Ann\"]\n\nThe duo had cut a cover version of that for their most recent album, and they thought it had worked well, and so they wanted something else that would allow Dean to sing a falsetto lead, over a bass vocal by Jan, with a girl's name in the title. They eventually hit on an old standard from the 1940s, originally written as a favour for the songwriter's lawyer, Lee Eastman, about his then one-year-old daughter Linda (who we'll be hearing more about later in this series).\n\nTheir version of \"Linda\" finally gave them another hit after five flops in a row, reaching number twenty-eight in the charts:\n\n[Excerpt: Jan and Dean, \"Linda\"]\n\nTheir career was on an upswing again, and then everything changed for them when they played a gig with support from a local band who had just started having hits, the Beach Boys. The story goes that the Beach Boys were booked to do their own support slot and then to back Jan and Dean on their set. The show went down well with the audience, and they wanted an encore, but Jan and Dean had run out of rehearsed songs. So they suggested that the Beach Boys play their own two singles again, and Jan and Dean would sing with them. The group were flattered that two big stars like Jan and Dean would want to perform their songs, and eagerly joined in.\n\nSuddenly, Jan and Dean had an idea -- their next album was going to be called Jan & Dean Take Linda Surfin', but as yet they hadn't recorded any surf songs. They invited the Beach Boys to come into the studio and record new versions of their two singles for Jan & Dean's album, with Jan and Dean singing the leads:\n\n[Excerpt: Jan and Dean and the Beach Boys, \"Surfin'\"]\n\nThe Beach Boys weren't credited for that session, as they were signed to another label, but it started a long collaboration between the two groups. In particular, the Beach Boys' leader Brian Wilson became a close collaborator with Berry. And at that same session, Wilson gave Jan and Dean what would become their biggest hit.\n\nAfter the recording, Jan and Dean asked Wilson if he had any new songs they might be able to do. The first one he played them, \"Surfin' USA\", he told them they couldn't do anything with as he wanted that for the Beach Boys themselves. But then he played them two others. The one that Jan and Dean saw most potential in was a song he'd completed, \"Gonna Hustle You\":\n\n[Excerpt: Brian Wilson, \"Gonna Hustle You\"]\n\nThe duo wanted that as their next single, but Liberty Records flat out refused to put out something that sounded so dirty as \"Gonna Hustle You\". They tried rewriting it as \"Get a Chance With You\", but even that was too much. They put the song aside, though they'd return to it later as \"The New Girl In School\", which would become a minor hit for them.\n\nInstead, they worked on a half-completed song that Wilson had started, very much in the same mould as the first two Beach Boys singles, with the provisional title \"Goodie Connie Won't You Please Come Home\". This song would become the first of many Jan and Dean songs for which the songwriting credit is disputed.\n\nNo-one argues with the fact that the basic idea of the song was Brian Wilson's, but Jan Berry's process was to get a lot of people to throw ideas in, sometimes working in a group, sometimes working separately and not even knowing that other people had been involved. The song is officially credited to Wilson and Berry, but Don Altfeld has also claimed he contributed to it, Dean Torrence says that he wrote about a quarter of the lyrics, and it's also been suggested that Roger Christian wrote the lyrics to the first verse.\n\nChristian was an LA-area DJ who was obsessed with cars, and had come to Wilson's attention after he'd said on the air that the Beach Boys' \"409\" was a great song about a bad car. He'd started writing songs with Wilson, and he would also collaborate with both Jan Berry and Wilson's friend Gary Usher (who was a big part of this scene but hardly ever worked with Jan and Dean because he hated Jan). Almost every car song from this period, by the Beach Boys, Jan and Dean, or any number of studio groups, was co-written by Christian, and we'll be hearing more about him in a future episode.\n\nThis group of people -- Jan and Dean, Brian Wilson, Roger Christian, and Don Altfeld -- would write together in various combinations, and write a lot of hits, but a lot of the credits were assigned more or less randomly -- though Jan Berry was almost always credited, and Dean Torrence almost never was.\n\nThe completed song, titled \"Surf City\", was recorded with members of the Wrecking Crew -- the studio musicians who usually worked with Phil Spector -- performing the backing track. In this case, these were Hal Blaine, Glen Campbell, Earl Palmer, Bill Pitman, Ray Pohlman and Billy Strange -- there were two drummers because Berry liked a big drum sound. Brian Wilson was at the session, and soon after this he started using some of those musicians himself.\n\nWhile it was released as a Jan and Dean record, Dean doesn't sing on it at all -- the vocals featured Jan, three singers from another Liberty Records group called the Gents, and Brian Wilson, with Wilson and Tony Minichello of the Gents singing the falsetto parts that Dean would sing live:\n\n[Excerpt: Jan and Dean, \"Surf City\"]\n\nThat went to number one, becoming Jan and Dean's only number one, and Brian Wilson's first -- much to the fury of Wilson's father Murry, who thought that Wilson's hits should only be going to the Beach Boys. Murry Wilson may well have been more bothered by the fact that the publishing for the song went to Columbia/Screen Gems, to whom Jan was signed, rather than to Sea of Tunes, the company that published Wilson's other songs, and which was owned by Murry himself.\n\nMurry started calling Jan a \"pirate\", which prompted Berry to turn up to a Beach Boys session wearing a full pirate costume to taunt Murry.\n\nFrom \"Linda\" on, Jan and Dean had ten top forty hits with ten singles -- one of the B-sides also charted, but they did miss with \"Here They Come From All Over The World\", the theme tune for the TAMI Show, a classic rock concert film on which Jan and Dean appeared both as singers and as the hosts. That was by far their weakest single from this period, being as it is just a list of the musicians in the show, some of them described incorrectly -- the song talks about \"The Rolling Stones from Liverpool\" and James Brown being \"the King of the Blues\".\n\nAll of these hits were made by the same team. The Wrecking Crew would play the instruments, the Gents -- now renamed the Matadors, and sometimes the Blossoms would provide backing vocals on the earlier singles. The later ones would feature the Fantastic Baggies instead of the Matadors -- two young songwriters, Steve Barri and P.F. Sloan, who were also making their own surf records. The lead would be sung by Jan, the falsetto by some combination of Brian Wilson, Dean Torrence, Tony Minichello and P.F. Sloan -- often Dean wouldn't appear at all. The singles would be written by some combination of Wilson, Berry, Altfeld and Christian, and the songs would be about the same subjects as the Beach Boys' records -- surf, cars, girls, or some combination of the three.\n\nSometimes the records would be just repetitions of the formula, like \"Drag City\", which was an attempt at a second \"Surf City\":\n\n[Excerpt: Jan and Dean, \"Drag City\"]\n\nBut often there would be a self-parodic element that wasn't present in the Beach Boys' singles, as in \"The Little Old Lady From Pasadena\", a car song written by Berry, Christian, and Altfeld, based on a series of Dodge commercials featuring a car-racing old lady:\n\n[Excerpt: Jan and Dean, \"The Little Old Lady From Pasadena\"]\n\nAnd the grotesque \"Dead Man's Curve\", equal parts a serious attempt at a teen tragedy song and a parody of the genre, which took on a new meaning a few years after it was a hit:\n\n[Excerpt: Jan and Dean, \"Dead Man's Curve\"]\n\nBut while 1963 and 64 saw the duo rack up an incredible run of hits, they were making enemies. Jan was so unpleasant to people by this point that even the teen mags would call him out, with Teen Scene in March 1964 running an article which read, in part, \"Blast of the month goes to half of a certain group whose initials are J&D. Reason for the blast: his personality, which makes enemies faster than Carter makes pills... (It's the Jan Half)... Acting like Mr. Big Britches gets you nowhere, and your poor partner, who is one of the nicest guys on earth, shouldn't be forced to go around making apologies for your actions.\"\n\nAnd while Torrence may have been \"one of the nicest guys on Earth\", not all of his friends were. In fact, in December 1963, his closest friend, Barry Keenan, was the ringleader in the kidnapping of Frank Sinatra Jr. &nbsp;Keenan told Torrence about the plan in advance, and Torrence had lent Keenan a great deal of money, which Keenan used to finance the kidnapping. Torrence was accused of being a major part of the plot, though he was let off after testifying against the people who were actually involved -- he's always claimed that he thought that his friend's talking about his plan for the perfect crime was just talk, not a serious plan. Torrence had even offered suggestions, jokingly, which Keenan had incorporated -- and Keenan had left a bag containing fifty thousand dollars at Torrence's home, Torrence's share of the ransom money, which Torrence refused to keep.\n\nHowever, Sinatra Sr was annoyed enough at Torrence that a lot of plans for Jan and Dean TV shows and film appearances suddenly dried up.\n\nThe lack of TV and film appearances was a particular problem as the music industry was changing under them, and surf and hot rod records weren't the in thing any more -- and Brian Wilson seems to have been less interested in working with them as well, as the Beach Boys overtook Jan and Dean in popularity. 1965 saw them trying to figure out the new, more serious, music scene, with experiments like Pop Symphony Number 1, an album of orchestral arrangements of the duo's hits by Berry (who minored in music at UCLA) and George Tipton:\n\n[Excerpt: The Bel-Aire Pops Orchestra, \"Surf City\"]\n\nThe duo also tried going folk-rock, releasing an album called Folk 'n' Roll, which featured another variation on the \"Surf City\" and \"Drag City\" theme -- this one \"Folk City\":\n\n[Excerpt: Jan and Dean, \"Folk City\"]\n\nThat album didn't do well at all, not least because the lead-off single was a pro-war protest song, released as a Jan Berry solo single. Berry had become incensed by Buffy Saint-Marie's song \"The Universal Soldier\", and had written a right-wing response, \"The Universal Coward\":\n\n[Excerpt: Jan Berry, \"The Universal Coward\"]\n\nAs you can imagine, that was not popular with the folk-rock crowd, especially coming as it did from someone who was still managing to avoid the draft by studying medicine, even as he was also a pop star.\n\nTorrence became so irritated with Berry, and with the music they were making, during the recording of that album that he ended up going down the hall to another studio, where the Beach Boys were recording their unplugged Party! album, and sitting in with them. He suggested they do a new recording of \"Barbara Ann\", and he sang lead on it, uncredited:\n\n[Excerpt: The Beach Boys, \"Barbara Ann\"]\n\nThat went to number two on the charts, becoming the biggest hit record that Torrence ever sang on.\n\nTorrence was happier with the next project, though, an album spoofing the popular TV show Batman, with several comedy sketches, along with songs about the characters from the TV show:\n\n[Excerpt: Jan and Dean, \"Batman\"]\n\nBut by this point, in 1966, Jan and Dean's singles were doing absolutely nothing in the charts. In March, Liberty Records dropped them. And then on April the twelfth, 1966, something happened that would end their chances of another comeback. Jan Berry had been in numerous accidents over the previous few years -- he was a thrill-seeker, and would often end up crashing cars or breaking bones.\n\nOn April the twelfth, he had an appointment at the draft board, at which he was given bad news -- depending on which account you read, he was either told that his draft deferment was coming to an end and he was going to Vietnam straight away, or that he was going to Vietnam as soon as he graduated from medical school at the end of the school year. He was furious, and he got into his car.\n\nWhat happened next has been the subject of some debate. Some people say that a wheel came off his car -- and some have hinted that this was the result of some of Sinatra's friends getting revenge on Jan and Dean. Others just say he was driving carelessly, which he often did. Some have suggested that he was trying to deliberately get into a minor accident to avoid being drafted. Whatever happened, he was involved in a major accident, in which he, though luckily no-one else, was severely injured. He spent a month in a coma, and came out of it severely brain damaged. He had to relearn to read and speak, and for the rest of his life would have problems with his memory, his physical co-ordination, and his speech.\n\nLiberty kept releasing old Jan and Dean tracks, and even got them a final top twenty hit with \"Popsicle\", a song from a few years earlier. Dean made a Jan and Dean album, Save For a Rainy Day, without Jan, while Jan was still recovering, as a way of trying to keep their career options open if Jan ever got better. Dean put it out on the duo's own new label, J&D, and there were plans for Columbia to pick it up and give it a wider release, but Jan refused to sign the contracts -- he was furious that Dean had made a Jan and Dean record without him, and would have nothing to do with it.\n\nTorrence tried to have a music career anyway -- he put out a cover of the Beach Boys song \"Vegetables\" under the name The Laughing Gravy:\n\n[Excerpt: The Laughing Gravy, \"Vegetables\"]\n\nBut he soon gave up, and became an artist, designing covers and logos for people like Harry Nilsson, Canned Heat, the Turtles, and the Beach Boys.\n\nJan tried making his own Jan and Dean album without Dean, even though he was unable to sing again or write yet. With a lot of help from Roger Christian, he pulled together some old half-finished songs and finished them, got in some soundalike session singers and famous friends like Glen Campbell and Davy Jones of the Monkees and put together Carnival of Sound, an album that didn't get released until 2010:\n\n[Excerpt: Jan and Dean, “Girl You're Blowing My Mind\"]\n\nIn the mid-seventies, Jan and Dean got back together and started touring the nostalgia circuit, spurred by a TV movie, Dead Man's Curve, based on their lives. There seemed to be a love-hate relationship between them in later years -- they would split up and get back together, and their roles had reversed, with Dean now taking most of the leads on the shows -- Dean had to look after Jan a lot of the time, and some reports said that Jan had to relearn the words to the three songs he sang lead on every night. But with the aid of some excellent backing musicians, and with some love and tolerance from the audience for Jan's ongoing problems, they managed to regularly please crowds of thousands until a few weeks before Jan's death in 2004.\n\nSince then, Dean has mostly performed with the Surf City All-Stars, a band that sometimes also features Al Jardine and David Marks of the Beach Boys, playing a few shows a year. He released an autobiography in 2016 -- it came out at the same time as the autobiographies of Brian Wilson and Mike Love of the Beach Boys, ensuring that even at this late date, he would be overshadowed by his more famous colleagues.",
  "enclosure": "",
  "itunes:summary": "Episode 107 of&nbsp;A History of Rock Music in 500 Songs looks at \"Surf City\" and the career of Jan and Dean, including a Pop Symphony, accidental conspiracy to kidnap, and a career that both started and ended with attempts to get out of being drafted. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,&nbsp;on \"Hey Little Cobra\" by the Rip Chords.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nNo Mixcloud this week, due to the number of songs by Jan and Dean.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes. The Grand High Potentates of California Rock: Jan and Dean \"In Perspective\" 1958-1968 is the one I used most here, but I referred to several. His books can be found at&nbsp;https://payhip.com/CMusicBooks\n\nI also used&nbsp;Dead Man's Curve and Back: The Jan and Dean Story by Mark Thomas Passmore, and Dean Torrence's autobiography&nbsp;Surf City.\n\nThe original mono versions of the Liberty singles are only available on an out-of-print CD that goes for over £400, and many compilations have later rerecordings (often by Dean without Jan) but this has the proper recordings, albeit in stereo mixes. This compilation contains their pre-Liberty singles, including the Jan & Arnie material.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nTranscript\n\nA warning about this episode -- it features some discussion of a car crash and resulting disability and recovery, which may be upsetting to some people.\n\nToday we're going to look at one of the most successful duos in rock and roll history, but one who have been relegated to a footnote because of their collaboration with a far more successful band, who had a similar sound to them. We're going to look at Jan and Dean, and at \"Surf City\":\n\n[Excerpt: Jan and Dean, \"Surf City\"]\n\nThe story of Jan and Dean begins with Jan and Arnie, and with the Barons. We discussed the Barons briefly in the episode on \"LSD-25\", a few months ago, but only in passing, so to recap -- the Barons were a singing group that formed at University High School in LA in the late fifties, centred around Jan Berry. Various people involved in the group's formation went on to be important parts of the LA music scene in the sixties, but by 1958 they were down to Berry and his friends Arnie Ginsburg -- not the DJ we talked about last episode, Dean Torrence, and Don Altfeld.\n\nThe group members all had a love for R&B, and hung around with various of the Black groups of the time -- Don Altfeld has talked about him and Berry being present, but not participating, for Richard Berry's recording of \"Louie Louie\", though his memories of the time seem confused in the interviews I've read. And Jan Berry in particular was a real music obsessive, and had what may have been the biggest R&B and rock and roll record collection in LA -- which he obtained by scamming record companies, which seems to be very in character for him. He got a letterhead made up for a fake radio station, KJAN, and wrote to every record company he could find asking for promo copies. He ended up getting six copies of every new release \"to play on the radio\", and would give some of the extra copies to his friends -- and others he would use as frisbees. According to Torrence, Berry would often receive two hundred new records a day, all free.\n\nBerry had a reel-to-reel tape recorder belonging to his father -- his father, William Berry, was important in the Howard Hughes organisation, and had been in charge of the Spruce Goose project, even flying in the famous plane with Hughes, and Hughes had given him the tape recorder, which unlike almost ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 107 of&nbsp;A History of Rock Music in 500 Songs looks at \"Surf City\" and the career of Jan and Dean, including a Pop Symphony, accidental conspiracy to kidnap, and a career that both started and ended with attempts to get out of being drafted. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,&nbsp;on \"Hey Little Cobra\" by the Rip Chords.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nNo Mixcloud this week, due to the number of songs by Jan and Dean.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes. The Grand High Potentates of California Rock: Jan and Dean \"In Perspective\" 1958-1968 is the one I used most here, but",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}