{
  "title": "S13 Ep117: The Horrific Haunting of the Yates Family",
  "link": "https://audioboom.com/posts/8098658",
  "itunes:episode": 117,
  "itunes:title": "The Horrific Haunting of the Yates Family",
  "itunes:season": 13,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6272,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Jay Yates was haunted as a young child, followed by things he couldn't see or explain.  In 1999, Jay had a near death experience that would change the direction of his life.  Marie was a skeptic (and psychic) who had an autistic child who talked to imaginary playmates, but these playmates had bad intentions.  Jay came along and bonded with Marie's son, and Jay and Marie fell in love, blended their family and unfortunately, combined some of their nightmares!  Jay and Marie Yates join BEYOND the DARKNESS to talk about their  paranormal journey to this point and discuss why sometimes it is better to go through this thing together with the ones you love! </p>\n\n<p></p>\n\n<p>PLUS: A brand new Theater of the Mind!! </p>\n\n<p></p>\n\n<p>Jay and Marie Yates:  <a href=\"https://www.yatesfamilyhaunting.com/\">https://www.yatesfamilyhaunting.com/</a></p>\n\n<p></p>\n\n<p>Thank you today's sponsors!</p>\n\n<p></p>\n\n<p><a href=\"http://Untuckit.com\">Untuckit.com</a>  •\tUSE PROMO CODE DARKNESS  FOR 20% SAVINGS FOR FIRST TIME CUSTOMERS</p>\n\n<p></p>\n\n<p>Hundreds of thousands of women know the secret to gorgeous hair color. Find your perfect shade at:<a href=\"https://na01.safelinks.protection.outlook.com/?url=http%3A%2F%2Fwww.madison-reed.com%2F%3Futm_source%3Dpodcast%26utm_content%3Dcol%26utm_campaign%3Dbeyondthedarkness&data=02%7C01%7Cjodi%40podcastone.com%7Cc9c2e9f817994b56079e08d61cfd4512%7C6a3a735461684ec89d6d32441391d5ba%7C0%7C0%7C636728271462879889&sdata=XQFqy%2BHd4KhgtkbikQdngAhP4ft7bcqyU%2FpiTt4VAhE%3D&reserved=0\"> HERE!</a> </p>\n\n<p></p>\n\n<p>Pluto TV,  ?\tWatch over 100 TV channels and 1000s of movies on demand all completely free.</p>\n\n<p></p>\n\n<p>True Car. When you’re ready to buy a new or used car, check out TrueCar and enjoy a more confident car-buying experience</p>\n\n<p><span>Where do you wear Bombas, the official sock of this podcast?  Dave is wearing his in Romania, and Tim has his on in the podcast studio.  For 20% off your first order go to</span> <a href=\"http://bombas.com/darkness\"><span><a href=\"http://bombas.com/darkness\">bombas.com/darkness</a></span></a></p>\n",
  "itunes:summary": "Jay Yates was haunted as a young child, followed by things he couldn't see or explain.  In 1999, Jay had a near death experience that would change the direction of his life.  Marie was a skeptic (and psychic) who had an autistic child...",
  "pubDate": "Sun, 23 Sep 2018 08:00:00 +0000",
  "guid": "e0b2e89b-fb15-4f54-9202-0026eb85b8bb",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}