{
  "title": "Archie Barry, V Barrat and Frances Barret: Object Oriented Ontology",
  "itunes:author": "Liquid Architecture",
  "itunes:subtitle": "",
  "itunes:summary": "An earhole is an open meatus into the body, through which sonic subjectivities are digested and recomposed. Sound and vibration leak in and out from all orifices, connecting and entangling in the folds of bodies, disturbing those boundaries.\n\nToday on the podcast Archie Barry and V Barratt join Frances Barrett and Debris Facility for a conversation that dissects their performances for  Object Oriented Ontology, a performance program for 'Meatus’ at the Australian Centre for Contemporary Art.\n\nObject Oriented Ontology focuses on fleshy void spaces, rather than materialist objects, moving with queer dis/embodiements; worm as method, digestion and intimacy; and a haptic force of the guttural. The performances respond to the conceptual and spatial prompts in France Barrett’s exhibition Meatus\n\nAn Object Oriented Ontology digital collection – Worm (w)hole:\nOrifice Oriented Ontologies – is published in Liquid Architecture’s online journal Disclaimer with works from the performing artists Sage Pbbt, Allison Gibbs, Archie Barry and V Barrett alongside Ander Rennick, Ivan Cheng, Jared Davis and Frances Barrett: https://disclaimer.org.au/contents/orifice-oriented-ontologies\n\nhttps://liquidarchitecture.org.au/events/orifice-oriented-ontologies\n\nObject Oriented Ontology\n21 May 2022\nAustralian Centre for Contemporary Art, Melbourne, Naarm\nPresented by Liquid Architecture, ACCA and City of Melbourne\n\nImage: Keelan O'Hehir\n\nProduced by Mara Schwerdtfeger. \n\nhttps://www.patreon.com/liquidarchitecture\n\nFor the past 20 years, Liquid Architecture has been Australia’s leading organisation for artists working with sound and listening. LA investigates the sounds themselves, but also the ideas communicated about, and the meaning of, sound and listening.",
  "itunes:image": "",
  "enclosure": "",
  "guid": "https://liquidarchitecture.org.au/podcast/archie-barry-v-barrat-and-frances-barret-object-oriented-ontology",
  "pubDate": "Tue, 28 Jun 2022 08:00:00 +1000",
  "itunes:duration": "45:20",
  "itunes:explicit": "yes"
}