{
  "id": "tag:blogger.com,1999:blog-3211409948956809184.post-4578403786148174091",
  "published": "2021-09-27T09:04:00.004-07:00",
  "updated": "2021-09-27T09:04:58.317-07:00",
  "title": "Colossal - The Future of DNA Editing?",
  "content": "<p>&nbsp;I found some recent news about <a href=\"https://colossal.com/\" target=\"_blank\">Colossal</a>&nbsp;a new startup that wants to revive extinct Mammoth to fight the global warming. Fighting global warming is one of the best things we can do, especially that one of the co-founders is <a href=\"https://www.liebertpub.com/doi/10.1089/crispr.2019.29074.gch\" target=\"_blank\">Prof. George Chruch</a> from Harvard Medical School, a very credible authority on gene editing. Church&nbsp; is one of the inventors of <a href=\"https://en.wikipedia.org/wiki/CRISPR\" target=\"_blank\">Crispr</a>,&nbsp;a gene editing tool that can cut and paste any desired segment of the DNA and thus make whatever changes we like to do.&nbsp;</p><p>Here is my take on it:</p><p></p><ul style=\"text-align: left;\"><li>Their website is amazing, a lot of effort was invented on that front. Backing up the pretty wild idea and thus draws a lot of attention to this work. The raised amount of 15M$ is tiny considering the amount of lab effort, equipment, materials etc.</li><li>Global warming sounds like an awkward excuse to fund the research they really like to do.<br /><i>Ben Lamm, CEO of Colossal, told The Washington Post in an email that the extinction of the woolly mammoth left an ecological void in the Arctic tundra that Colossal aims to fill. The eventual goal is to return the species to the region so that they can reestablish grasslands and protect the permafrost, keeping it from releasing greenhouse gases at such a high rate.</i></li><li>Sending a wild Mammoth to eat grass somewhere frozen, with the hope of reducing gas emissions is likely is the most complicated way to fight global warming I can imagine. But is a sexy way of drawing news attention.</li><li>The difference between Mammoth DNA and a person DNA <a href=\"https://www.amacad.org/publication/unequal-nature-geneticists-perspective-human-differences\" target=\"_blank\">is most likely 90% similar.</a> Thus having the ability to revive and extinct Mammoth will enable also reviving also persons. Recently, <a href=\"https://www.timesofisrael.com/in-major-breakthrough-artificial-israeli-womb-turns-250-cells-into-mouse-fetus/\" target=\"_blank\">Israeli research</a> hash shown the possibility of raising mice embryos outside the womb. So raising Mammoth outside the womb as they like to do is maybe doable.</li><li><span style=\"color: #2a2a2a;\"><span style=\"font-family: inherit;\"><i>Christopher Preston, a professor of environmental ethics and philosophy at the University of Montana, questioned Colossal’s focus on climate change, given that it would take decades to raise a herd of woolly mammoths large enough to have environmental impacts.</i></span></span></li><li>So, the real applications of this technology may be applied to humans. For example, what if I wanted to revive my dead grandfather? What is I wanted a baby with blond hair and blue eyes? My guess there is a huge market for this technology in real life.</li></ul><div>I wonder why all the news and media attention ignores the actual use cases of this tehnology?</div><p></p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Danny Bickson",
    "uri": "http://www.blogger.com/profile/01517237836051035400",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}