{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-4949574077491885106",
  "published": "2019-07-09T11:00:00.000-07:00",
  "updated": "2019-07-09T11:00:04.021-07:00",
  "title": "More information and better tools to resolve manual Content ID claims",
  "content": "As Susan mentioned in her April <a href=\"https://youtube-creators.googleblog.com/2019/04/addressing-creator-feedback-and-update.html\" target=\"_blank\">Creator Letter</a>, we’re making it easier for creators to understand and remove manually claimed content in their videos. We’ve heard from creators that the recent uptick of manual claims, especially for short segments, has led to some confusion, as the claims sometimes lack key information that can help to resolve the issue. While it’s important that creators understand and respect copyright, it’s also important that they have knowledge of who is claiming content in their videos, where it appears, and what they can do about it. Starting today, we will require copyright owners to provide timestamps to indicate exactly where their content appears in videos they manually claim, and we’re improving our video editing tools in Creator Studio to make it easier for creators to remove the content associated with these claims.<br /><br />Manual Claiming is a tool within <a href=\"https://support.google.com/youtube/answer/2797370\" target=\"_blank\">Content ID</a> that allows select copyright owners to manually make claims on videos that were not automatically made by our Content ID matching system. Previously, we did not require copyright owners using the Manual Claiming tool to provide timestamps, so it was sometimes unclear to creators which parts of their videos were being claimed and in addition, unlike edits that removed content identified by automated claims, the claims wouldn’t be automatically released.<br /><br />We’re making the experience better for you in two important ways:<br /><br /><b>1. Copyright owners must now provide timestamps for exactly what part of your video is being manually claimed.</b><br /><br />Just as you would if you receive an automatic claim from our Content ID matching system, you’ll now see timestamps in Creator Studio when you get a manual claim. Check out the Video Copyright Info page in <a href=\"https://studio.youtube.com/\" target=\"_blank\">YouTube Studio</a> that offers a visualization of where the manually-claimed content appears in your video, and also, it provides more info about the content being claimed. We’ll be evaluating the accuracy of these timestamps. Copyright owners who repeatedly fail to provide accurate data will have their access to manual claiming revoked.<br /><br /><b>2. You can use our editing tools to remove the content claimed manually in your video which will now automatically release the claims.</b><br /><br />We’ve updated our editing tools to make it easier to remove manually claimed content from your video. If you choose to remove the content, the claim will now be released automatically. Below are some of the options you have without having to edit and upload a new video:<br /><ul><li><b>Mute all sound when the claimed song plays:</b> If you get a claim for a piece of music in your video, you can now mute the time-stamped segment.</li></ul><ul><li><b>Replace the song:</b> If you don’t want to mute the audio entirely, you can instead swap out the music with one of our free-to-use songs from the <a href=\"https://www.youtube.com/audiolibrary/music\" target=\"_blank\">YouTube Audio Library</a>. We also added new visual indicators below the video player, which show exactly what segment of the video is claimed. This can help you position the audio track in such a way that will remove the claims from your video.</li></ul><ul><li><b>Trim out the content:</b> You also have the option to cut out the time-stamped segment from your video using the Trim feature in the YouTube Editor.</li></ul>We’re still working on several improvements here, like having an explicit Trim option in the Video Copyright Info page that will allow you to trim out the claimed content with just one click. You can learn more about these changes in our <a href=\"https://support.google.com/youtube/answer/9374251\" target=\"_blank\">Help Center.</a><br /><br />Remember, if you <a href=\"https://support.google.com/youtube/answer/6013276?hl=en\" target=\"_blank\">receive a claim</a> that you believe is incorrect, you have the right to dispute it. You know the most about the content in your videos and whether it was used appropriately, so we built the dispute process to empower you to escalate any problems to the copyright owner, and even as far as the courts, if you choose. If both you and the person claiming your video are attempting to monetize it, we will continue to show ads on the video during the dispute process and make sure the appropriate party gets the revenue once the dispute is resolved.<br /><br />Our work won’t stop here. We’re always looking to find ways to improve the creator copyright experience while also balancing the rights of copyright owners. Stay tuned for more to come.<br /><br /><br /><br /><i>Julian Bill, Product Manager</i><br /><br /><br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}