{
  "title": "Episode #378:  A Hero, To The Max",
  "link": "https://www.krpoliticaljunkie.com/episode-378-a-hero-to-the-max/",
  "pubDate": "Sat, 13 Nov 2021 23:34:21 +0000",
  "guid": "https://www.krpoliticaljunkie.com/?p=21316",
  "description": "<p>We remember former Georgia Democratic Sen. Max Cleland, who died last week and who was on the receiving end of one the most controversial attack ads in political history.  And we weigh the decision by New Hampshire GOP Gov. Chris Sununu not to challenge Sen. Maggie Hassan (D) next year, who is thought to be vulnerable.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com/episode-378-a-hero-to-the-max/\">Episode #378:  A Hero, To The Max</a> appeared first on <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com\">Ken Rudin&#039;s Political Junkie</a>.</p>",
  "enclosure": "",
  "itunes:subtitle": "We remember former Georgia Democratic Sen. Max Cleland, who died last week and who was on the receiving end of one the most controversial attack ads in political history.  And we weigh the decision by New Hampshire GOP Gov.",
  "itunes:summary": "Jim Galloway, the retired political columnist for the Atlanta Journal-Constitution, remembers Max Cleland, the former Georgia Democratic senator who died this week and who was on the receiving end of one of the most controversial TV attack ads in political history.<br />\nAnd Paul Steinhauser, a political reporter with Fox News, weighs the decision by New Hampshire GOP Gov. Chris Sununu not to challenge Democratic Sen. Maggie Hassan next year, a race many thought Sununu could win.<br />\nMusic on this podcast:<br />\n<a href=\"https://www.youtube.com/watch?v=ykv-eRjSlQc\">Change Partners by Stephen Stills</a><br />\n<a href=\"https://www.youtube.com/watch?v=tolm-07if3c\">Shut Up and Let Me Go by the Ting Tings</a><br />\n<a href=\"https://www.youtube.com/watch?v=EqWRaAF6_WY\">My Hero by the Foo Fighters</a><br />",
  "itunes:author": "Ken Rudin",
  "itunes:image": "",
  "itunes:episode": 378,
  "itunes:title": "A Hero To The Max",
  "itunes:duration": "36:06"
}