{
  "title": "Government’s Role in Further Developing 5G Technologies and Future Networks",
  "link": "https://event.on24.com/wcc/r/3955427/412CCC2ABF3FDA6A2F3EC0135093DD67",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/image.png?id=26851521&width=980\"/><br/><br/><p>\n\tSimilar to 5G, many key technology developments have been supported by government funding and institutions for years. Federally Funded Research and Development Centers (FFRDC) and University Affiliated Research Centers (UARC) have been foundational elements of this government support.\n</p><p>\n\tThis webinar will examine the impact this research has had on national security and the overall economy. It will also discuss how these institutions have made use of testing to attain these security and economic goals. Finally, it will look at how these resources can continue to be leveraged in the further development of 5G technologies and beyond for future networks.<u></u><u></u>\n</p><p>\n<a href=\"https://event.on24.com/wcc/r/3955427/412CCC2ABF3FDA6A2F3EC0135093DD67\" rel=\"noopener noreferrer\" target=\"_blank\">Register now for this webinar!</a></p><hr/><p><strong>\n\tSpeaker:\n</strong></p><p>\n\t\t\tMURAT TORLAK\n\t\t</p><p>\t\tProgram Director, Computer and Network Systems (CNS)</p><p>\n\t\t\tMurat Torlak received the M.S. and Ph.D. degrees in electrical engineering from The University of Texas at Austin, in 1995 and 1999, respectively. Since August 1999, he has been with the Department of Electrical and Computer Engineering, The University of Texas at Dallas, where he has been promoted to the rank of a Full Professor. He is on leave from UT Dallas to serve as a Rotating Program Director at the U.S. National Science Foundation (NSF) since mid 2020. His current research interests include experimental verification of wireless networking systems, cognitive radios, millimeter-wave automotive radars, millimeter-wave imaging systems, and interference mitigation in radio telescopes. He has served as an Associate Editor for the IEEE Transactions on Wireless Communications, from 2008 to 2013. He was a Guest co-Editor of IEEE JSTSP Special Issue on Recent Advances in Automotive Radar Signal Processing, 2021. He has also served in several IEEE committees and helped to organized IEEE conferences.\n\t\t</p>",
  "pubDate": "Mon, 26 Sep 2022 13:00:00 +0000",
  "guid": "https://event.on24.com/wcc/r/3955427/412CCC2ABF3FDA6A2F3EC0135093DD67",
  "category": [
    "5g",
    "Anritsu",
    "Telecommunications",
    "Type:webinar"
  ],
  "dc:creator": "Anritsu",
  "media:content": ""
}