{
  "title": "Transportation: Untangling the Supply Chain",
  "description": "<p>Global supply chains have been under stress from the pandemic, geopolitical tensions, and inflation, and the outlook for transportation in 2022 is a mixed bag so far. Chief U.S. Economist Ellen Zentner and Equity Analyst for North American Transportation Ravi Shanker discuss.</p><p><br></p><p>-----Transcript-----</p><p><br></p><p><strong>Ellen Zentner:</strong> Welcome to Thoughts on the Market. I'm Ellen Zentner, Chief U.S. Economist for Morgan Stanley Research,&nbsp;</p><p><br></p><p><strong>Ravi Shanker:</strong> and I'm Ravi Shanker, Equity Analyst covering the North American Transportation Industry for Morgan Stanley Research.&nbsp;</p><p><br></p><p><strong>Ellen Zentner:</strong> And today on the podcast, we'll be talking about transportation, specifically the challenges facing freight in light of still tangled supply chains and geopolitics. It's Tuesday, April 26, at 9:00 a.m. in New York.&nbsp;</p><p><br></p><p><strong>Ellen Zentner:</strong> So, Ravi, it's really good to have you back on the show. Back in October of last year we had a great discussion about clogged supply chains and the cascading problems stemming from that. And I hoped that we would have a completely different conversation today, but let's try to pick up where we left off. Could we maybe start today by you giving us an update on where we are in terms of shipping - ocean, ground and air?&nbsp;</p><p><br></p><p><strong>Ravi Shanker:</strong> So yes, things have materially changed since the last time we spoke, some for the better and some for the worse. The good news is that a lot of the congestion that we saw back then, whether it was ocean or air, a lot of that has eased or abated. We used to have, at a peak, about 110 ships off the Port of L.A. Long Beach, that's now down to about 30 to 40. The other thing that has changed is we just went from new peak to new all time peak on every freight transportation data point that we were tracking over the last two years. Now all of those rates are collapsing at a pace that we have not seen, probably ever. It's still unclear whether this legitimately marks the end of the freight transportation cycle or if it's just an air pocket that's related to the Russia Ukraine conflict or China lockdowns or something else. But yes, the freight transportation worlds in a very different place today, compared to the last time I was on in October. Ellen, I know you wanted to dig a little more deeply into the current challenges facing the shipping and overall transportation industry. But before we get to that, can you maybe help us catch up on how the complicated tangle created by supply chain disruptions has affected some of the key economic metrics that you've been watching over the last six months? That is between the time we last spoke in October and now.&nbsp;</p><p><br></p><p><strong>Ellen Zentner:</strong> Sure. So, we created this global supply chain index to try to gauge globally just how clogged supply chains are. And we did that because, what we've uncovered is that it's a good leading indicator for inflation in the U.S. and on the back of creating that index, we could see that the fourth quarter of last year was really the peak tightness in global supply chains, and it has about a six month lead to CPI. Since then, we started to see some areas of goods prices come down. But unfortunately, that supply chain index stalled in February largely on the back of Russia, Ukraine and on the back of China's zero COVID policy, starting to disrupt supply chains again. So the improvement has stalled. There are some encouraging parts of inflation coming down, but it's not yet broad based enough, and we're certainly watching these geopolitical risks closely. So, Ravi, I want to come back to freight here because you talked about how it's been underperforming for a couple of months now and forward expectations have consistently declined as well. You pointed to it as possibly being just an air pocket, but you're pointing, you're watching closely a number of things and anticipate some turbulence in the second half of the year. Can you walk us through all of that?&nbsp;</p><p><br></p><p><strong>Ravi Shanker:</strong> What I can tell you is that it's probably a little too soon to definitively tell if this is just an air pocket or if the cycles over. Again, we are not surprised, and we would not be surprised if the cycle is indeed over because in December of last year, we downgraded the freight transportation sector to cautious because we did start to see some of those data points you just cited with some of the other analysts. So we were expecting the cycle to end in the middle of 22 to begin with, but to see the pace and the slope of the decline and a lot of these data points in the month of March, and how that coincides with the Russia-Ukraine conflict and that the lockdowns in China, I think, is a little too much of a coincidence. So we think it could well be a situation where this is an air pocket and there's like one or two innings left in the cycle. But either way, we do think that the cycle does end in the back half of the year and then we'll see what happens beyond that.&nbsp;</p><p><br></p><p><strong>Ellen Zentner:</strong> OK, so you're less inclined to say that you see it spilling over into 2023 or 2024?&nbsp;</p><p><br></p><p><strong>Ravi Shanker:</strong> I would think so. Like if this is just a normal freight transportation cycle that typically lasts about 9 to 12 months. The interesting thing is that we have seen 9 to 12 months of decline in the last 4 weeks. So there are some investors in my space who think that the downturn is over and we're actually going to start improving from here. I think that's way too optimistic. But if we do see this continuing into 2023 and 2024 I think there's probably a broader macro consumer problem in the U.S. and it's not just a freight transportation inventory destocking type situation.&nbsp;</p><p><br></p><p><strong>Ellen Zentner:</strong> So Ravi, I was hoping that you'd give me a more definitive answer that transportation costs have peaked and will be coming down because of course, it's adding to the broad inflationary pressures that we have in the economy. Companies have been passing on those higher input costs and we've been very focused on the low end consumer here, who have been disproportionately burdened by higher food, by higher energy, by all of these pass through inflation that we're seeing from these higher input costs.&nbsp;</p><p><br></p><p><strong>Ravi Shanker:</strong> I do think that rates in the back half of the year are going to be lower than in the first half of the year and lower than 2021. Now it may not go down in a straight line from here, and there may be another little bit of a peak before it goes down again. But if we are right and there is a freight transportation downturn in the back of the year, rates will be lower. But, and this is a very important but, this is not being driven by supply. It's being driven by demand and its demand that is coming down, right. So if rates are lower in the back half of the year and going into 23, that means at best you are seeing inventory destocking and at worst, a broad consumer recession. So relief on inflation by itself may not be an incredible tailwind, if you are seeing demand destruction that's actually driving that inflation relief.&nbsp;</p><p><br></p><p><strong>Ellen Zentner:</strong> That's a fair point. Another topic I wanted to bring up is the fact that while freight transportation continues to face significant headwinds, airlines seem to be returning to normal levels, with domestic and international travel picking up post-pandemic. Can you talk about this pretty stark disparity?&nbsp;</p><p><br></p><p><strong>Ravi Shanker:</strong> Ellen it's absolutely a stark disparity. It's basically a reversal of the trends that you've seen over the last 2 years where freight transportation, I guess inadvertently, became one of the biggest winners during the pandemic with all the restocking we were seeing and the shift of consumer spend away from services into goods. Now we are seeing the reversion of that. So look, honestly, we were a little bit concerned a month ago with, you know, jet fuel going up as much as it did and with potential concerns around the consumer. But the message we've got from the airlines and what we are seeing very clearly in the data, what they're seeing in the numbers is that demand is unprecedented. Their ability to price for it is unprecedented. And because there are unprecedented constraints in their ability to grow capacity in the form of pilot shortages, obviously very high jet fuel prices and other constraints, I guess there's going to be more of an imbalance between demand and supply for the foreseeable future. As long as the U.S. consumer holds up, we think there's a lot more to come here. So Ellen, let me turn back to you and ask you with freight still facing such big challenges and pressure on both sides on the supply chain. What does that bode for the economy in terms of inflation and GDP growth for the rest of this year and going into next year?&nbsp;</p><p><br></p><p><strong>Ellen Zentner:</strong> So I think because, as I said, you know, our global supply chain index has stalled since February. I think that does mean that even though we've raised our inflation forecasts higher, we can still see upside risk to those inflation forecasts. The Fed is watching that as well because they are singularly focused on inflation. GDP is quite healthy. We have a net neutral trade balance on energy. So it actually limits the impact on GDP, but has a much greater uplift on inflation. So you're going to have the Fed feeling very confident here to raise rates more aggressively. I think there's strong consensus on the committee that they want to frontload rate hikes because they do need to slow demands to slow the economy. They do almost need that demand destruction that you were talking about. That's actually something the Fed would like to achieve in order to take pressure off of inflation in the U.S.. But we think that the economy is strong enough, and especially the labor market is strong enough, to withstand this kind of policy tightening. It takes actually 4 to 6 quarters for the Fed to create enough slack in the economy to start to bring inflation down more meaningfully. But we're still looking for it to come in, for core inflation, around 2.5% by the fourth quarter of next year. So, Ravi, thanks so much for taking the time to talk. There's much more to cover, and I definitely look forward to having you back on the show in the future.&nbsp;</p><p><br></p><p><strong>Ravi Shanker: </strong>Great speaking with you Ellen. Thanks so much for having me and I would love to be back.&nbsp;</p><p><br></p><p><strong>Ellen Zentner:</strong> And thanks for listening. If you enjoy Thoughts on the Market, please leave us a review on Apple Podcasts and share the podcast with a friend or colleague today.&nbsp;</p>",
  "itunes:title": "Transportation: Untangling the Supply Chain",
  "itunes:episodeType": "full",
  "itunes:episode": 603,
  "itunes:summary": "Global supply chains have been under stress from the pandemic, geopolitical tensions, and inflation, and the outlook for transportation in 2022 is a mixed bag so far. Chief U.S. Economist Ellen Zentner and Equity Analyst for North American Transportation Ravi Shanker discuss.",
  "content:encoded": "<p>Global supply chains have been under stress from the pandemic, geopolitical tensions, and inflation, and the outlook for transportation in 2022 is a mixed bag so far. Chief U.S. Economist Ellen Zentner and Equity Analyst for North American Transportation Ravi Shanker discuss.</p><p><br></p><p>-----Transcript-----</p><p><br></p><p><strong>Ellen Zentner:</strong> Welcome to Thoughts on the Market. I'm Ellen Zentner, Chief U.S. Economist for Morgan Stanley Research,&nbsp;</p><p><br></p><p><strong>Ravi Shanker:</strong> and I'm Ravi Shanker, Equity Analyst covering the North American Transportation Industry for Morgan Stanley Research.&nbsp;</p><p><br></p><p><strong>Ellen Zentner:</strong> And today on the podcast, we'll be talking about transportation, specifically the challenges facing freight in light of still tangled supply chains and geopolitics. It's Tuesday, April 26, at 9:00 a.m. in New York.&nbsp;</p><p><br></p><p><strong>Ellen Zentner:</strong> So, Ravi, it's really good to have you back on the show. Back in October of last year we had a great discussion about clogged supply chains and the cascading problems stemming from that. And I hoped that we would have a completely different conversation today, but let's try to pick up where we left off. Could we maybe start today by you giving us an update on where we are in terms of shipping - ocean, ground and air?&nbsp;</p><p><br></p><p><strong>Ravi Shanker:</strong> So yes, things have materially changed since the last time we spoke, some for the better and some for the worse. The good news is that a lot of the congestion that we saw back then, whether it was ocean or air, a lot of that has eased or abated. We used to have, at a peak, about 110 ships off the Port of L.A. Long Beach, that's now down to about 30 to 40. The other thing that has changed is we just went from new peak to new all time peak on every freight transportation data point that we were tracking over the last two years. Now all of those rates are collapsing at a pace that we have not seen, probably ever. It's still unclear whether this legitimately marks the end of the freight transportation cycle or if it's just an air pocket that's related to the Russia Ukraine conflict or China lockdowns or something else. But yes, the freight transportation worlds in a very different place today, compared to the last time I was on in October. Ellen, I know you wanted to dig a little more deeply into the current challenges facing the shipping and overall transportation industry. But before we get to that, can you maybe help us catch up on how the complicated tangle created by supply chain disruptions has affected some of the key economic metrics that you've been watching over the last six months? That is between the time we last spoke in October and now.&nbsp;</p><p><br></p><p><strong>Ellen Zentner:</strong> Sure. So, we created this global supply chain index to try to gauge globally just how clogged supply chains are. And we did that because, what we've uncovered is that it's a good leading indicator for inflation in the U.S. and on the back of creating that index, we could see that the fourth quarter of last year was really the peak tightness in global supply chains, and it has about a six month lead to CPI. Since then, we started to see some areas of goods prices come down. But unfortunately, that supply chain index stalled in February largely on the back of Russia, Ukraine and on the back of China's zero COVID policy, starting to disrupt supply chains again. So the improvement has stalled. There are some encouraging parts of inflation coming down, but it's not yet broad based enough, and we're certainly watching these geopolitical risks closely. So, Ravi, I want to come back to freight here because you talked about how it's been underperforming for a couple of months now and forward expectations have consistently declined as well. You pointed to it as possibly being just an air pocket, but you're pointing, you're watching closely a number of things and anticipate some turbulence in the second half of the year. Can you walk us through all of that?&nbsp;</p><p><br></p><p><strong>Ravi Shanker:</strong> What I can tell you is that it's probably a little too soon to definitively tell if this is just an air pocket or if the cycles over. Again, we are not surprised, and we would not be surprised if the cycle is indeed over because in December of last year, we downgraded the freight transportation sector to cautious because we did start to see some of those data points you just cited with some of the other analysts. So we were expecting the cycle to end in the middle of 22 to begin with, but to see the pace and the slope of the decline and a lot of these data points in the month of March, and how that coincides with the Russia-Ukraine conflict and that the lockdowns in China, I think, is a little too much of a coincidence. So we think it could well be a situation where this is an air pocket and there's like one or two innings left in the cycle. But either way, we do think that the cycle does end in the back half of the year and then we'll see what happens beyond that.&nbsp;</p><p><br></p><p><strong>Ellen Zentner:</strong> OK, so you're less inclined to say that you see it spilling over into 2023 or 2024?&nbsp;</p><p><br></p><p><strong>Ravi Shanker:</strong> I would think so. Like if this is just a normal freight transportation cycle that typically lasts about 9 to 12 months. The interesting thing is that we have seen 9 to 12 months of decline in the last 4 weeks. So there are some investors in my space who think that the downturn is over and we're actually going to start improving from here. I think that's way too optimistic. But if we do see this continuing into 2023 and 2024 I think there's probably a broader macro consumer problem in the U.S. and it's not just a freight transportation inventory destocking type situation.&nbsp;</p><p><br></p><p><strong>Ellen Zentner:</strong> So Ravi, I was hoping that you'd give me a more definitive answer that transportation costs have peaked and will be coming down because of course, it's adding to the broad inflationary pressures that we have in the economy. Companies have been passing on those higher input costs and we've been very focused on the low end consumer here, who have been disproportionately burdened by higher food, by higher energy, by all of these pass through inflation that we're seeing from these higher input costs.&nbsp;</p><p><br></p><p><strong>Ravi Shanker:</strong> I do think that rates in the back half of the year are going to be lower than in the first half of the year and lower than 2021. Now it may not go down in a straight line from here, and there may be another little bit of a peak before it goes down again. But if we are right and there is a freight transportation downturn in the back of the year, rates will be lower. But, and this is a very important but, this is not being driven by supply. It's being driven by demand and its demand that is coming down, right. So if rates are lower in the back half of the year and going into 23, that means at best you are seeing inventory destocking and at worst, a broad consumer recession. So relief on inflation by itself may not be an incredible tailwind, if you are seeing demand destruction that's actually driving that inflation relief.&nbsp;</p><p><br></p><p><strong>Ellen Zentner:</strong> That's a fair point. Another topic I wanted to bring up is the fact that while freight transportation continues to face significant headwinds, airlines seem to be returning to normal levels, with domestic and international travel picking up post-pandemic. Can you talk about this pretty stark disparity?&nbsp;</p><p><br></p><p><strong>Ravi Shanker:</strong> Ellen it's absolutely a stark disparity. It's basically a reversal of the trends that you've seen over the last 2 years where freight transportation, I guess inadvertently, became one of the biggest winners during the pandemic with all the restocking we were seeing and the shift of consumer spend away from services into goods. Now we are seeing the reversion of that. So look, honestly, we were a little bit concerned a month ago with, you know, jet fuel going up as much as it did and with potential concerns around the consumer. But the message we've got from the airlines and what we are seeing very clearly in the data, what they're seeing in the numbers is that demand is unprecedented. Their ability to price for it is unprecedented. And because there are unprecedented constraints in their ability to grow capacity in the form of pilot shortages, obviously very high jet fuel prices and other constraints, I guess there's going to be more of an imbalance between demand and supply for the foreseeable future. As long as the U.S. consumer holds up, we think there's a lot more to come here. So Ellen, let me turn back to you and ask you with freight still facing such big challenges and pressure on both sides on the supply chain. What does that bode for the economy in terms of inflation and GDP growth for the rest of this year and going into next year?&nbsp;</p><p><br></p><p><strong>Ellen Zentner:</strong> So I think because, as I said, you know, our global supply chain index has stalled since February. I think that does mean that even though we've raised our inflation forecasts higher, we can still see upside risk to those inflation forecasts. The Fed is watching that as well because they are singularly focused on inflation. GDP is quite healthy. We have a net neutral trade balance on energy. So it actually limits the impact on GDP, but has a much greater uplift on inflation. So you're going to have the Fed feeling very confident here to raise rates more aggressively. I think there's strong consensus on the committee that they want to frontload rate hikes because they do need to slow demands to slow the economy. They do almost need that demand destruction that you were talking about. That's actually something the Fed would like to achieve in order to take pressure off of inflation in the U.S.. But we think that the economy is strong enough, and especially the labor market is strong enough, to withstand this kind of policy tightening. It takes actually 4 to 6 quarters for the Fed to create enough slack in the economy to start to bring inflation down more meaningfully. But we're still looking for it to come in, for core inflation, around 2.5% by the fourth quarter of next year. So, Ravi, thanks so much for taking the time to talk. There's much more to cover, and I definitely look forward to having you back on the show in the future.&nbsp;</p><p><br></p><p><strong>Ravi Shanker: </strong>Great speaking with you Ellen. Thanks so much for having me and I would love to be back.&nbsp;</p><p><br></p><p><strong>Ellen Zentner:</strong> And thanks for listening. If you enjoy Thoughts on the Market, please leave us a review on Apple Podcasts and share the podcast with a friend or colleague today.&nbsp;</p>",
  "guid": "gid://art19-episode-locator/V0/MfOPXGtdsXaW1LQO0zgY7YMfcdLK63rTYqRk0nYcdAg",
  "pubDate": "Tue, 26 Apr 2022 22:13:23 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:keywords": "market-trends,supply-chain",
  "itunes:duration": "00:09:31",
  "enclosure": ""
}