{
  "title": "Don&#8217;t lock in your &#8216;game of the year&#8217; list yet. 2022 is far from over",
  "link": "https://www.digitaltrends.com/gaming/game-of-the-year-contenders-late-2022/",
  "pubDate": "Sat, 05 Nov 2022 10:45:59 +0000",
  "dc:creator": "Giovanni Colantonio",
  "category": [
    "Features",
    "Gaming",
    "God of War: Ragnarok",
    "Marvel's Midnight Suns",
    "Pentiment",
    "Pokémon Scarlet and Violet",
    "The Callisto Protocol"
  ],
  "guid": "https://www.digitaltrends.com/?p=3220282",
  "description": "Gamers have already decided that it's Elden Ring vs. God of War Ragnarok for 2022's game of the year, but there's still a lot still to come.",
  "content:encoded": "<p>Surprise, surprise: <em>God of War Ragnarok</em> is one of the <a href=\"https://www.digitaltrends.com/gaming/god-of-war-ragnarok-review-ps5/\">best-reviewed video games of 2022</a>. Even before the game’s review embargo, you could probably have predicted that from context clues. The sequel looked like it wasn’t straying too far from the incredibly well-reviewed <em>God of War</em> (2018), so review scores would likely follow closely behind. And with those scores would surely come the inevitable “game of the year” chatter.</p>\n<video src=\"https://content.jwplatform.com/videos/rZ69Xqfy.mp4\" data-player=\"zpykqaab\" data-embed=\"default\" data-application-id class=\"video-js\" controls ></video>\n<p>With little time to digest the game between now and December, recency bias dictates that <em>God of War Ragnarok</em> will likely top year-end lists. That might be a deserved honor for Sony’s impressive epic, but 2022 isn’t over yet. Just as the last minutes of a basketball game can completely reverse a team’s fortune, November and December have a history of delivering bracket-busting hits that can easily get lost once the holiday season’s biggest release drops. Buzzer-beaters like <em><a href=\"https://www.digitaltrends.com/gaming/solar-ash-review/\">Solar Ash</a> </em>and <em><a href=\"https://www.digitaltrends.com/gaming/shovel-knight-pocket-dungeon-impressions/\">Shovel Knight: Pocket Dungeon</a></em> were some of 2021’s finest titles, but their late release dates meant they had trouble breaking into any year-end conversations.</p>\n<p>Looking at the rest of 2022’s game release calendar, it seems like that could happen again. <em>God of War Ragnarok</em> might be the last behemoth launching this year, but there are still plenty of games that could wind up being some of the year’s most memorable experiences. Here are some games you should keep on your radar that show there’s still a whole quarter of the game left before you should lock in your “best of 2022” lists.</p>\n<h2>Pentiment</h2>\n<figure class=\"alignnone\"><img  class=\" wp-image-3165241 size-large\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/08/Pentiment.jpg?fit=720%2C720&p=1\" alt=\"Andreas paints in Pentiment.\"   /></figure>\n<p>It hasn’t been a great year for Xbox (that’s putting it mildly), but that could change in a few weeks thanks to <em>Pentiment</em>. Developed by <em>Fallout: New Vegas</em> studio Obsidian Entertainment, the narrative RPG probably isn’t what you’d expect when you hear the phrase “Xbox exclusive” That’s exactly what makes it so intriguing, though. Pentiment is a 16th-century murder deduction story that chronicles the life of Andreas, a journeyman who finds himself mixed up in a series of crimes and mysteries that span decades. What’s most eye-catching about it, though, is its illustrative art style that beautifully pulls inspiration from medieval art, from woodcuts to manuscripts.</p>\n<p>I got a chance to <a href=\"https://www.digitaltrends.com/gaming/pentiment-preview-gamescom-2022/\">play <em>Pentiment</em> at Gamescom</a> this year and I found myself engrossed instantly. Its gorgeous art direction is immediately noticeable, but the RPG systems are what stuck with me the most. I was able to customize Andreas to my liking, giving him specific skills (like a background in occult studies) that would have a real impact on my story even in a short demo. If that holds true in the entire game, <em>Pentiment</em> could end up being one of 2022’s biggest surprises, giving Xbox a much-needed hit.</p>\n<p><em>Pentiment</em> launches on November 15 for Xbox One, Xbox Series X/S, and PC.</p>\n<h2>Somerville</h2>\n<figure class=\"alignnone\"><img  class=\" wp-image-2958477 size-large\" src=\"https://www.digitaltrends.com/wp-content/uploads/2021/12/somerville-dark-room.jpg?fit=720%2C720&p=1\" alt=\"Characters explore a dark room, full of mysterious figures in Somerville.\"   /></figure>\n<p><a href=\"https://store.steampowered.com/app/1671410/Somerville/\" target=\"_blank\" rel=\"noopener\"><em>Somerville</em></a> is one of those indie critical darlings that seems like it came out of left field, even though it’s been right under our nose the entire time. The atmospheric adventure game is the debut title from Jumpship, a studio co-founded by former Playdead co-founder Dino Patti. Playdead was responsible for creating arguably two of the best indies of all time in both <em>Limbo</em> and <em>Inside</em>, so the expectations for Somerville are a little high.</p>\n<p>Based on the little we’ve seen of it so far, though, it looks like Somerville could live up to Playdead’s greatest hits. Trailers have teased a haunting alien invasion story that seems like a small-scale version of War of the Worlds. If nothing else, Somerville looks like it’ll deliver a striking visual style that should at the very least make for an eerie 2D thriller.</p>\n<p><em>Somerville</em> launches on November 15 for Xbox One, Xbox Series X/S, and PC.</p>\n<h2>Pokémon Scarlet and Violet</h2>\n<figure class=\"alignnone\"><img  class=\" wp-image-3205203 size-large\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/10/Pokemon-scarlet.jpg?fit=720%2C720&p=1\" alt=\"Bellibolt standing by a pond.\"   /></figure>\n<p>The jury’s still out on whether or not <em>Pokémon Violet</em> and <em>Scarlet</em> will be another win for the long-running monster catching franchise, but I’d be remiss not to mention it here. Nintendo’s last big release of the year is a total reinvention of the traditional Pokemon formula, adapting the game to a true open-world format. Not only that, but it brings true co-op multiplayer to the series for the first time ever. That could be enough to make it one of the freshest mainline Pokemon games in a decade.</p>\n<p>I recently <a href=\"https://www.digitaltrends.com/gaming/pokemon-scarlet-violet-hands-on-preview/\">spent a full hour with the game</a> and the change in format certainly seems to work for the series. The traditional Pokémon hooks are there, but the adventure gives players a lot more freedom to roam around and tackle objectives in any order they please. That newfound freedom already has me intrigued, so I can’t count out Nintendo’s big holiday monster just yet.</p>\n<p><em>Pokémon Scarlet</em> and <em>Violet</em> launch on November 18 for Nintendo Switch.</p>\n<h2>Warhammer 40,000: Darktide</h2>\n<figure class=\"alignnone\"><img  class=\" wp-image-3145355 size-large\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/07/Warhammer-40k-Darktide.jpg?fit=720%2C720&p=1\" alt=\"A team of players stands together in Warhammer 40K: Darktide.\"   /></figure>\n<p>If you’ve never gotten into Warhammer games, I can’t say that I blame you. The tabletop franchise pumps out several video games a year, which can make it overwhelming to keep up with. However, <em>Warhammer 40,000: Darktide</em> may be the one game to keep on your radar if you’re looking for an entry point. The co-op multiplayer game is cut from the <a href=\"https://www.digitaltrends.com/gaming/back-4-blood-review/\"><em>Left 4 Dead</em> mold</a>, letting players squad up and blast hordes of monsters together (while collecting some precious loot, of course).</p>\n<p>I jumped into a few missions during the game’s recent beta and walked out impressed. Its tense missions and tight gunplay brought me back to my <em>Destiny</em> glory days when I’d grind strikes with my clan for hours on end. Considering that <em>Darktide</em> is set to have some live service DNA, I imagine it’s the kind of game that might only get bigger, better, and more acclaimed through its lifespan. In a year where multiplayer competition is light, Daktide could stand tall as one of 2022’s best.</p>\n<p><em>Warhammer 40,000: Darktide</em> launches on November 30 for PC.</p>\n<h2>Marvel’s Midnight Suns</h2>\n<figure class=\"alignnone\"><img  class=\" wp-image-3175739 size-large\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/09/Marvels-Midnight-Suns.jpg?fit=720%2C720&p=1\" alt=\"Spider-Man lands in front of other heroes in Marvel's Midnight Suns.\"   /></figure>\n<p><em><a href=\"https://www.digitaltrends.com/gaming/marvel-midnight-suns-release-date/\">Marvel’s Midnight Suns</a></em> is currently 2022’s biggest question mark. The upcoming game from the tactics pros at Firaxis basically looks like XCOM with superheroes, which sounds like a winning elevator pitch on paper. However, there’s a fair reason for skepticism considering that the game has been delayed several times since it was first announced, raising questions about its shape ahead of a December launch.</p>\n<p>Even with those potential red flags, I find myself very optimistic about <em>Marvel’s Midnight Suns</em>. Firaxis generally has a strong track record, with hits like<em> XCOM 2</em> and <em>Civilization VI</em> to its name. Its most recent game, 2020’s<em> XCOM: Chimera Squad</em>, was an especially underrated gem that made the sometimes daunting tactics genre much more approachable. If that energy carries over into Marvel’s Midnight Suns, I imagine it could give the fantastic<em> <a href=\"https://www.digitaltrends.com/gaming/mario-rabbids-sparks-of-hope-review/\">Mario + Rabbids: Sparks of Hope</a></em> a run for its money.</p>\n<p><em>Marvel’s Midnight Suns</em> launches on December 2 for PS4, PS5, Xbox One, Xbox Series X/S, Nintendo Switch, and PC.</p>\n<h2>The Callisto Protocol</h2>\n<figure class=\"alignnone\"><img  class=\" wp-image-3213917 size-large\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/10/callisto-protocol.jpeg?fit=720%2C720&p=1\" alt=\"The Callisto Protocol monster\"   /></figure>\n<p>Whatever you do, don’t lock in your game of the year lists before <em>The Callisto Protocol</em> launches. The debut horror game from Striking Distance Studios is shaping up to be a worthy spiritual successor to <em>Dead Space</em> &#8212; one that might even outdo EA’s <a href=\"https://www.digitaltrends.com/gaming/dead-space-preview-hands-on/\">upcoming remake of <em>Dead Space</em></a> itself. It seems to hit all the right beats with gruesome violence, a pitch-black atmosphere, and the brand of limb-slicing gameplay that made <em>Dead Space</em> such a hit in the first place.</p>\n<p>We recently got a chance to <a href=\"https://www.digitaltrends.com/gaming/the-callisto-protocol-preview-ps5/\">go hands-on with<em> The Callisto Protocol</em></a> and it&#8217;s certainly not holding back. “My adventure through a ruined water purification facility highlighted the strengths of the game’s visuals, sound design, and difficulty that make me fear for the protagonist&#8217;s life in the same way I did for Isaac Clarke in the original<em> Dead Space</em>,” Tomas Franzese recently wrote in a preview for the game. If that sounds like your cup of disgusting tea, don’t let it slip under the radar.</p>\n<p><em>The Callisto Protocol</em> launches on December 2 for PS4, PS5, Xbox One, Xbox Series X/S, and PC.</p>\n<h2><strong>More games to keep an eye on</strong></h2>\n<ul>\n<li><em>A Little to the Left</em> &#8212; November 8</li>\n<li><em>Among Us VR</em> &#8212; November 10</li>\n<li><em>Tactics Ogre: Reborn</em> &#8212; November 11</li>\n<li><em>Call of Duty: Warzone 2.0</em> &#8212; November 16</li>\n<li><em>The Dark Pictures Anthology: The Devil In Me</em> &#8212; November 18</li>\n<li><em>Evil West</em> &#8212; November 22</li>\n<li><em>Gungrave G.O.R.E.</em> &#8212; November 22</li>\n<li><em>The Walking Dead: Saints & Sinners 2 &#8212; Retribution</em> &#8212; December 1</li>\n<li><em>Need for Speed Unbound</em> &#8212; December 2</li>\n<li><em>Sunshine Shuffle</em> &#8212; December 6</li>\n<li><em>Hello Neighbor 2</em> &#8212; December 6</li>\n<li><em>Choo-Choo Charles</em> &#8212; December 9</li>\n<li><em>Dragon Quest Treasures</em> &#8212; December 9</li>\n<li><em>Crisis Core: Final Fantasy Reunion</em> &#8212; December 13</li>\n<li><em>High on Life</em> &#8212; December 13</li>\n</ul>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2022/10/callisto-protocol.jpeg?p=1",
  "enclosure": "",
  "post-id": 3220282
}