{
  "title": "#468: Rubeus Hagrid’s Punch Out! (OOTP 31, O.W.L.S.)",
  "link": "https://audioboom.com/posts/7602230",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4796,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>MuggleCast opens with a listener email addressing current events in America. Also, please note we recorded this episode before JKR's latest hurtful tweets.</li>\n<li>Some suggested recommendations and resources that can help us all learn:<ul>\n<li>Understand racism doesn't \"go away\" - it mutates. Learn from organizations like <a href=\"https://civilrights.org/\">The Leadership Conference on Civil and Human Rights</a>, <a href=\"https://www.vera.org/\">The Vera Institute of Justice</a>, <a href=\"https://www.civilrightsmuseum.org/\">The National Civil Rights Museum</a>, <a href=\"https://www.innocenceproject.org/\">The Innocence Project</a>, and <a href=\"https://www.obama.org/mbka/mentor/\">The MBK Alliance</a>.</li>\n<li>Everyone has biases , many of them unconscious - find ways to confront your <a href=\"https://implicit.harvard.edu/implicit/selectatest.html\">implicit biases</a>\n</li>\n<li>Amplify the voices of people of color, but recognize when to be quiet and listen</li>\n<li>VOTE for candidates and legislation that will hold authorities accountable</li>\n<li>Visit <a href=\"https://twitter.com/ethelsclub/status/1267578405949779969?s=20\">Ethel's Club,</a> which provides free grieving and healing sessions to African Americans around the world, led by licensed black therapists.</li>\n<li>Support black businesses in your area: <a href=\"https://officialblackwallstreet.com/directory/\">Official Black Wall Street, </a><a href=\"https://www.eatokra.com/\">EatOkra</a> (iOS and Android).</li>\n</ul>\n\n</li>\n<li>\n<a href=\"https://www.wizardingworld.com/chapters/reading-the-midnight-duel\">Alison Sudol, Dan Fogler</a> and <a href=\"https://www.wizardingworld.com/chapters/reading-halloween\">Whoopi Goldberg</a> read the latest chapters from Sorcerer's Stone!</li>\n<li>Harry Potter face coverings are now available from <a href=\"https://www.wizardingworld.com/news/wizarding-world-face-coverings-coming-soon\">WizardingWorld.com</a>\n</li>\n<li>MuggleMail covers yet another definition of the word punting!</li>\n<li>\n<a href=\"https://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a> continues with Order of the Phoenix - Chapter 31: O.W.L.S</li>\n<li>7-Word Summary: Exams can cause severe headaches and visions </li>\n<li>Ron has a little bit of James in him!</li>\n<li>Malfoy Career Advice: \"It's not what you know, it's who you know.\"</li>\n<li>Comparing the O.W.L.S to standardized testing here in the United States</li>\n<li>Anxiety, all-nighters, drugs, cheating and more!</li>\n<li>Griselda Marchbanks: Dumbledore can \"do things with a wand she's never seen before!\" Oh, reallllly?</li>\n<li>Patronus Extra Credit</li>\n<li>The Removal of Rubeus Hagrid</li>\n<li>Why does Umbridge choose to sack Hagrid in this manner? Is this even about his job? We discuss the connection to current events.</li>\n<li>A History of Magic exam gone Siriusly bad!</li>\n<li>Why wasn't Harry provided more information about what Voldemort was after?</li>\n<li>The Umbridge Suck Count climbs to 94!</li>\n<li>Quizzitch: Who is the head of the Wizarding Examinations Authority?</li>\n<li>Join our community at <a href=\"http://www.patreon.com/mugglecast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n<li>This week's episode is sponsored by BeachBody On Demand: Work out from the comfort of home and still get super effective workouts, making you feel better! Text 'mugglecast' to 30-30-30 to get a free trial.</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 09 Jun 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-06-08:/posts/7602230",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}