{
  "title": "Ethnic Federalism and Ethiopian politics, with Terje Østebø (PODCAST 8-13-2020)",
  "description": "<p><em>This is the web version of Foreign Exchanges, but did you know you can get it delivered right to your inbox? Sign up today:</em></p><p>I’m very pleased to be joined this week by Terje Østebø of the University of Florida to discuss the roots and nature of Ethiopia’s “ethnic federalist” system and the impact that Prime Minister Abiy Ahmed’s political changes have had on it. If you’ve been following reports of violence in Ethiopia’s Oromo community or of the rise of nationalist movements among some of its smaller ethnic groups and felt like you would appreciate some deeper background into those stories, this is the interview for you.</p><p><em>Abiy during last year’s Russia-Africa Summit in Sochi (Russian government via Wikimedia Commons)</em></p><p>Terje Østebø received his PhD in the History of Religion from Stockholm University, and is currently the chair of the Department of Religion and associate professor at the Center for African Studies and the Department of Religion, University of Florida. He is also the founding director of the UF Center for Global Islamic Studies. His research interests are Islam in contemporary Ethiopia, Islam, politics, and Islamic reformism in Ethiopia and the Horn of Africa, ethnicity and religion, as well as Salafism in Africa. He has lived in Ethiopia for 6 years, and has extensive field-research experience. Major publications include <em>Islam, Ethnicity, and Conflict in Ethiopia: The Bale Insurgency (1963-1970) </em>(<a target=\"_blank\" href=\"https://www.cambridge.org/core/books/islam-ethnicity-and-conflict-in-ethiopia/7A9B8C74C57FD7363C6EB148D39C1FE2\">Cambridge University Press, 2020</a>); “African Salafism: Religious Purity and the Politicization of Purity” in <em>Islamic Africa, </em>6, 1-2, 2015; <em>Muslim Ethiopia: The Christian Legacy, Identity Politics, and Islamic Reformism</em> (co-edited with Patrick Desplat), (Palgrave-Macmillan 2013); <em>Localising Salafism: Religious Change among Oromo Muslims in Bale, Ethiopia </em>(Brill 2012); <em>Islamism in the Horn of Africa: Assessing Ideology, Actors, and Objectives, </em>International Law and Policy Institute (2010).</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://fx.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">fx.substack.com/subscribe</a>",
  "link": "https://fx.substack.com/p/ethnic-federalism-and-ethiopian-politics",
  "guid": "substack:post:846356",
  "dc:creator": "Derek Davison",
  "pubDate": "Thu, 13 Aug 2020 19:55:12 GMT",
  "enclosure": "",
  "itunes:author": "Derek Davison",
  "itunes:explicit": "No",
  "itunes:duration": 3974,
  "itunes:image": ""
}