{
  "title": "Intel Reports Q3 2022 Earnings: Back To Profitability, But Still Painful",
  "dc:creator": "Ryan Smith",
  "description": " <p align=\"center\"><a href=\"https://www.anandtech.com/show/17629/intel-reports-q3-2022-earnings-back-to-profitable-but-still-painful\"><img src=\"https://images.anandtech.com/doci/17629/Intel-Q3-22-Stock_575px.png\" alt=\"\" /></a></p><p><p>While always an interesting topic by default, corporate earnings reports in the tech industry have become especially important in the last few months, as the industry prepares to weather what&rsquo;s expected to be the biggest downturn in demand in the last several years. Intel&rsquo;s brutal Q2&rsquo;22 report, which found the company losing money on a GAAP basis for the first time in 5 years, seems to have been a herald of things to come for the largest industry, with <a href=\"https://www.anandtech.com/show/17603/amd-issues-early-q322-financial-results-misses-guidance-by-1b-as-client-revenue-craters\">AMD</a> and other companies since issuing earnings warnings ahead of their own Q3 reports. So as the first major tech company to publish their complete Q3&rsquo;22 earnings report, Intel is once again likely to be a barometer of the tech industry&rsquo;s performance over the past three months.</p>\n\n<p>For the third quarter of 2022, Intel reported $15.3B in revenue, a $3.9B decline versus the year-ago quarter. Compared to Intel&rsquo;s harsh Q2 report, the company has returned to profitability, booking a cool billion dollars in net income, though this is still well below their historical norms. In fact, the company is still operating at a (GAAP) loss, booking an operating income of -$175M. For Q3 at least, it would appear that it&rsquo;s Intel&rsquo;s tax situation that&rsquo;s pushing them into the black, with the company recording a $1.2B tax benefit.</p>\n</p>",
  "link": "https://www.anandtech.com/show/17629/intel-reports-q3-2022-earnings-back-to-profitable-but-still-painful",
  "pubDate": "Thu, 27 Oct 2022 18:00:00 EDT",
  "guid": "tag:www.anandtech.com,17629:news",
  "category": " CPUs"
}