{
  "id": "yt:video:Pvc8m5Nno7g",
  "yt:videoId": "Pvc8m5Nno7g",
  "yt:channelId": "UCddem5RlB3bQe99wyY49g0g",
  "title": "\" RAT ATTACK \"  BIZARRE RAT & RODENT CONTROL EDUCATIONAL FILM    XD42144",
  "link": "",
  "author": {
    "name": "PeriscopeFilm",
    "uri": "https://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g"
  },
  "published": "2022-10-31T17:30:05+00:00",
  "updated": "2022-10-31T17:30:05+00:00",
  "media:group": {
    "media:title": "\" RAT ATTACK \"  BIZARRE RAT & RODENT CONTROL EDUCATIONAL FILM    XD42144",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g/join\n\nWant to learn more about Periscope Film and get access to exclusive swag? Join us on Patreon. Visit https://www.patreon.com/PeriscopeFilm\nVisit our website www.PeriscopeFilm.com\n\nWARNING: This film has numerous scenes of rats crawling everywhere, which may be triggering for those who have musophobia. \n\nThis bizarre educational film \"Rat Attack\" vividly shows the effects of a rodent infestation, and describes how an infestation is caused, as well as delving into the history of rats and humans. It also offers solutions for how to keep rats out of your home or apartment. The film was made by  Ucom Educational Inc., which specialized in films for schools and industrial and medical training programs.\n\nThe film starts with rats crawling on the floor of a man’s bedroom at 0:50. Then, it jump cuts (our print has damage) to police cars, and the man who says “there’s rats in here!” then, shows a fire in the man’s apartment -- apparently caused by something the man did to try to kill the rats. The man is seen being carted into an ambulance at 1:47. Police investigate the incident and the neighbors are seen talking about it at 2:05. An old man is then shown who appears to be the narrator of the film at 2:03. The man says “rats kill more people than all the wars in history” at 2:41. A man is shown being bitten by a rat and blood drips from his finger at 3:03. This scene may be graphic for viewers. A rat is filmed eating leftovers of a sandwich at 3:42. At 4:09 a rat is shown drinking water. A broken glass window is shown and the narrator says buildings with holes and openings give rats a nice warm place to live and have babies at 4:32. The narrator then says “rats have 12 babies every 8 weeks” at 4:42. Rat droppings are shown at 5:07. Rat teeth inside a live rat are shown at 5:30. Rat tracks are shown at 5:44. A rat eating poison is shown at 6:08. A rat corpse is shown at 6:15. A man setting a rat trap is shown at 7:37. The film shows a rat being snared by the trap at 7:51– graphic. A rat is shown eating another rat at 9:23– extremely graphic. The film ends shortly after. \n\nA UCOM Presentation.\n\nAcknowledgements to Albany County Department of Health, State of New York Department of Health, Bureau of Rodent, Insect and Weed Control, the Board of Education of the City of Albany, New York. Film was made in Albany, NY, in 1970. \n\n\nWe encourage viewers to add comments and, especially, to provide additional information about our videos by adding a comment!  See something interesting?  Tell people what it is and what they can see by writing something for example: \"01:00:12:00 -- President Roosevelt is seen meeting with Winston Churchill at the Quebec Conference.\"\n\nThis film is part of the Periscope Film LLC archive, one of the largest historic military, transportation, and aviation stock footage collections in the USA. Entirely film backed, this material is available for licensing in 24p HD, 2k and 4k. For more information visit http://www.PeriscopeFilm.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}