{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-6024266860067629757",
  "published": "2018-11-29T09:00:00.000-08:00",
  "updated": "2018-11-29T09:00:00.389-08:00",
  "title": "Introducing more ways to share your Stories on YouTube",
  "content": "<br />As a creator, you're always looking to strengthen your relationship with your audience. You bring them along on your travels, give them a backstage pass to one of your videos,  or even a sneak peek at your upcoming video. Through testing the Stories format with a small group of you over the past year, we’ve seen you do just that, from FashionbyAlly giving updates on what’s coming next, to Colin and Samir bringing their fans into the creative process. We applied feedback that we got from you to build a product specifically designed with you, the YouTube creator, in mind. And starting today, we are excited to announce that we are rolling out YouTube Stories to all eligible creators with 10K+ subscribers.<br /><br /><br /><br /><br /><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/qM-dOYiyvCA\" width=\"560\"></iframe><br /><br /><br /><br /><br />Creating with Stories is lightweight, easy, and fun. Stories will have the fun creation tools that you know and love. You can add text, music, filters, YouTubey stickers, and more to make your story uniquely you! To create a story, just open the YouTube mobile app, tap on the video camera icon, and select \"Create Story.\"<br /><br /><br /><br /><br />We’ve also added comments to Stories, so the entire community can be a part of the conversation. Your fans can comment, thumbs up and thumbs down comments, and you can heart comments. And all of the comment moderation tools that are available on video uploads will also be available on Stories. You can now also respond directly to a fan comment with a photo or video for the entire community to see! <br /><br /><br /><br /><br /><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://3.bp.blogspot.com/-hkrt9XKiMjk/W_9AQYANpaI/AAAAAAAACIM/CYSuSVkcgZAsDSrggBXmitStCE5FrnNUACLcBGAs/s1600/two%2Bphones_stories.png\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"1048\" data-original-width=\"1280\" height=\"524\" src=\"https://3.bp.blogspot.com/-hkrt9XKiMjk/W_9AQYANpaI/AAAAAAAACIM/CYSuSVkcgZAsDSrggBXmitStCE5FrnNUACLcBGAs/s640/two%2Bphones_stories.png\" width=\"640\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Images via <a href=\"https://www.youtube.com/channel/UCamLstJyCa-t5gfZegxsFMw\" target=\"_blank\">Colin and Samir</a></td></tr></tbody></table><br /><br /><br /><br />Once posted, Stories are available in the mobile app for 7 days to ensure that your fans have a chance to see it. Stories may show up to both subscribers on the Subscriptions tab and non-subscribers on Home and in the Up Next list below videos. <br /><br /><br /><br /><br />We’re excited to see how you continue to use Stories to reach out to your community. Give it a try today! <br /><br /><br /><br /><i>Todd Sherman, Product Lead for YouTube Stories</i><br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}