{
  "id": "tag:blogger.com,1999:blog-2471378914199150966.post-400816817033971342",
  "published": "2022-03-31T11:19:00.006-07:00",
  "updated": "2022-03-31T11:32:54.528-07:00",
  "category": "",
  "title": "Chrome 101: Federated Credential Management Origin Trial, Media Capabilities for WebRTC, and More",
  "content": "<p>Unless otherwise noted, changes described below apply to the newest Chrome beta channel release for Android, Chrome OS, Linux, macOS, and Windows. Learn more about the features listed here through the provided links or from the list on <a href=\"https://www.chromestatus.com/features#milestone%3D76\">ChromeStatus.com</a>. Chrome 101 is beta as of March 31, 2022. You can <a href=\"https://www.google.com/chrome/beta/\">download the latest on Google.com</a> for desktop or on Google Play Store on Android. </p> <h1>Reduce User Agent String Information</h1><p>Chrome is trying to <a href=\"https://www.chromestatus.com/feature/5704553745874944\">reduce the amount of information the user agent string exposes</a> in HTTP requests as well as in <code>navigator.userAgent</code>, <code>navigator.appVersion</code>, and <code>navigator.platform</code>. We're doing this to prevent the user agent string from being used for passive user fingerprinting. To join the origin trial, see <a href=\"https://developer.chrome.com/origintrials/#/view_trial/-7123568710593282047\">its entry on Chrome Origin Trials</a>. See <a href=\"#depsrems\">the end of this article</a> for additional deprecations and removals.</p> <h1>Origin Trials</h1><p>This version of Chrome introduces the origin trial described below. Origin trials allow you to try new features and give feedback on usability, practicality, and effectiveness to the web standards community. To register for any of the origin trials currently supported in Chrome, including the ones described below, visit the <a href=\"https://developers.chrome.com/origintrials/#/trials/active\">Chrome Origin Trials dashboard</a>. To learn more about origin trials in Chrome, visit the <a href=\"https://web.dev/origin-trials/\">Origin Trials Guide for Web Developers</a>. Microsoft Edge runs its own origin trials separate from Chrome. To learn more, see the <a href=\"https://developer.microsoft.com/en-us/microsoft-edge/origin-trials/\">Microsoft Edge Origin Trials Developer Console</a>. </p> <h2>New Origin Trial</h2> <h3>Federated Credential Management API</h3><p>Federated Credential Management API (FedCM) aims to create privacy-preserving identity federation and is designed to make identity federation continue to allow use cases without the need for cross-site tracking such as third-party cookies. <a href=\"https://developer.chrome.com/origintrials/#/view_trial/3977804370874990593\">This feature starts its origin trial in 101 on Android only</a>. We expect to add desktop support in Chrome 102.</p> <h2>Completed Origin Trials</h2><p>The following feature, previously in a Chrome origin trial, is now enabled by default. </p> <h3>Priority Hints</h3><p>Priority Hints provides a way to <a href=\"https://web.dev/priority-hints/\">indicate a resource's relative importance</a> to the browser, allowing more control over the order resources are loaded.</p> <h1>Other Features in this Release</h1> <h2>AudioContext.outputLatency</h2><p><a href=\"https://www.chromestatus.com/feature/5682265146261504\"><code>AudioContext.outputLatency</code> property</a> is an estimation in seconds of the interval between when the user agent requests a host system to play a buffer and when the first sample in the buffer is processed by the audio output device. For devices such as speakers or headphones that produce an acoustic signal, 'processed by the audio output device' refers to the time when a sample's sound is produced. This property helps developers compensate for the latency between the input and the output. It's also useful for synchronization of video and audio streams.</p> <p>This property is already implemented in Firefox.</p> <h2>font-palette and Custom @font-palette-values Palettes</h2><p>The <code>font-palette</code> CSS property allows<a href=\"https://chromestatus.com/feature/5674031696052224\"> selecting a palette from a color font</a>. In combination with the <code>@font-palette-values</code> <code>at-rule</code>, custom palettes can be defined. This feature is useful in designs where an icon or emoji font is used with dark or light mode, or when using multi-colored icon fonts that use the <code>font-palette</code> to harmonize with the content's color scheme.</p> <h2>hwb() CSS function</h2><p>HWB (short for 'hue whiteness blackness') is another method of specifying sRGB colors, similar to HSL, but often even easier for humans to work with. The <code>hwb()</code> function <a href=\"https://chromestatus.com/feature/5637256860663808\">specifies HWB values in CSS</a>. The function takes three arguments. The first, <code>hue</code>, specifies hue in degrees (not constrained to the range [0, 360]). The next two, <code>whiteness</code> and <code>blackness</code>, are specified as  percentages.</p> <h2>Make Popup Argument for window.open() Evaluate to 'true'</h2><p>This feature follows a recent change to the spec for <a href=\"https://www.chromestatus.com/feature/5669245760307200\">parsing the <code>popup</code> argument for <code>window.open()</code></a>. Previously, when <code>popup</code> was set equal to true, <code>window.open()</code> was interpreted to mean false. This is counterintuitive and confusing. This change makes boolean features easier to use and understand.</p> <h2>MediaCapabilities API for WebRTC</h2><p>The MediaCapabilities API has been extended to support WebRTC streams. The MediaCapabilities API helps websites make informed decisions on what codec, resolution, etc. to use for video playback by indicating whether a configuration is supported and also whether the playback is expected to be smooth. <br />Without this feature, web apps need to guess about suitable configurations. This can result in poor quality such as when an application uses low resolution or frame rates unnecessarily, or stuttering when the frame rate is too high.</p> <h2>Secure Payment Confirmation API V3</h2><p>The following features from version three of the Secure Payment Confirmation API <a href=\"https://www.chromestatus.com/feature/5675682238562304\">are now implemented</a>:</p><ul><li>A relying party ID that is a required input. Because this is required, existing code will need to be updated.</li><li>An optional boolean to allow failed instrument icon download.</li><li>A <code>payeeName</code> property as an optional input.</li></ul> <h2>USBDevice forget()</h2><p>The <a href=\"https://web.dev/usb/#revoke-access\"><code>USBDevice</code> <code>forget()</code> method</a> allows web developers to voluntarily revoke a permission to a USBDevice that was granted by a user.</p> <h2>WebUSB sameObject Behavior</h2><p><code>USBConfiguration</code>, <code>USBInterface</code>, <code>USBAlternateInterface</code>, and <code>USBEndpoint</code> instances are <a href=\"https://www.chromestatus.com/feature/5769668454252544\">now only strictly equal</a> (\"===\") when they are retrieved from accessors on the same <code>USBDevice</code>.</p> <h1><a name=\"depsrems\"></a>Deprecations, and Removals</h1><p>This version of Chrome introduces the deprecations and removals listed below. Visit ChromeStatus.com for lists of <a href=\"https://www.chromestatus.com/features#browsers.chrome.status%3A%22Deprecated%22\">current deprecations</a>  and <a href=\"https://www.chromestatus.com/features#browsers.chrome.status:%22Removed%22\">previous removals</a>.</p> <h2>Remove WebSQL in Third-Party Contexts</h2><p><a href=\"https://www.chromestatus.com/feature/5684870116278272\">WebSQL in third-party contexts is now removed</a>. The Web SQL Database standard was first proposed in April 2009 and abandoned in November 2010. Gecko never implemented this feature and WebKit deprecated it in 2019. The W3C encourages <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Web_Storage_API\">Web Storage</a> and <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/IndexedDB_API\">Indexed Database</a> for those needing alternatives.</p> <p>Developers should expect that WebSQL itself will be deprecated and removed when usage is low enough.</p>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Chromium Blog",
    "uri": "http://www.blogger.com/profile/06394244468194711527",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}