{
  "title": "184: Crime Scene: The Vanishing at the Cecil Hotel",
  "link": "https://audioboom.com/posts/7882391",
  "itunes:episode": 184,
  "itunes:title": "Crime Scene: The Vanishing at the Cecil Hotel",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3199,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>\n<strong>FAM: This is a two-part series. </strong><a href=\"https://www.patreon.com/TrueCrimeObsessed\"><strong>Episode 2 is available right now and ad-free for 1 week only on our Patreon at all levels</strong></a><strong>. Part 2 will be our regular episode next week!</strong><br>\n<br>\nCan a building be evil? (Gillian: “NO, IT’S JUST A BUILDING!”). Can web sleuths solve a truly bizarre death? (Patrick: “NO! GET OFF FACEBOOK AND GO. OUT. SIDE.). And what exactly is a hotel general manager’s job? (Patrick and Gillian: (“UNCLEAR!”)  Welcome to the Cecil Hotel—a once grand hotel which rotted from the inside and became a place where “dreams go to die” and “serial killers let their hair down.” <br>\n<br>\nElisa Lam knew none of that, of course, when she checked in on  January 28, 2013. She went missing a few days later. And two weeks after that, out of desperation to find her, the LAPD released the now infamous “elevator video” of her which set the internet ablaze. Join us and the investigators and internet…sleuths?...as we all try to put together the pieces of her disappearance and death. And I promise, we land on an answer as to what happened to her. <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 200 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 08 Jun 2021 10:00:00 +0000",
  "guid": "tag:audioboom.com,2021-06-07:/posts/7882391",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}