{
  "title": "Bootstrapping Machine Learning is launching today",
  "dc:creator": "Louis Dorard",
  "pubDate": "Wed, 07 May 2014 13:22:15 +0000",
  "link": "https://www.ownml.co/blog/bootstrapping-machine-learning-launching-today",
  "guid": "5206b718e4b0bdc26006bae2:5206b959e4b0bdc26006be4a:536a31b0e4b0e77a57296e48",
  "description": "Today, I am releasing the first edition of Bootstrapping Machine \nLearning. Prediction APIs are making Machine Learning accessible to \neveryone and this book is the first that teaches how to use them.",
  "content:encoded": "<p>Today, I am releasing the <a href=\"http://www.louisdorard.com/machine-learning-book\">first edition of Bootstrapping Machine Learning</a>.</p>\n\n<p>Prediction APIs are making Machine Learning accessible to everyone and this book is the first that teaches how to use them. You will learn the possibilities offered by these APIs, how to formulate your own Machine Learning problem, and what are the key concepts to grasp — not how algorithms work, so it doesn't take a university degree to understand. This all makes for a very different angle from the other books on the market.</p>\n\n<p>Although only 196 pages long, Bootstrapping Machine Learning has been quite long in the making. The book covers the principles that make ML work, its limitations, several business and apps examples, it shows you how to apply ML to your own domain and which Prediction APIs you can use. Finally, there's a case study in which I explain step by step how I would go about reimplementing Gmail's Priority Inbox.</p>\n\n<p>The original table of contents was bigger but I made a few cuts to keep the book concise. I also spent a good chunk of time on making tutorials, screencasts, IPython notebooks, code, a Virtual Machine, and some additional resources. All in all it would take a couple of hours for a first read and if you get one of the packages with the extra resources you could get hacking with Prediction APIs within half a day.</p>\n\n<p>The book is available as of today and with a 20% discount for 24 hours only! <a href=\"http://www.louisdorard.com/machine-learning-book\">Check it out now and download the first chapters for free</a>.</p>\n\n<p>Also, please help me spread the word by sharing some social network love!</p>\n\n<p>Louis</p>\n\n<p><a href=\"http://twitter.com/louisdorard\">@louisdorard</a></p>",
  "media:content": {
    "media:title": "Bootstrapping Machine Learning is launching today"
  }
}