{
  "id": "https://bibleinoneyear.org/en/youth/79",
  "title": "Day 79: God is Good – All the Time",
  "description": "Psalm 35:27b (MSG), Numbers 9:16–17, 10:29,32, Luke 3:2–3,8-16,18, 21-22.  As a result, even though he found himself in the appalling conditions of this prison, he followed Jesus’ example and ‘went around *doing good’* (Acts 10:38) As John Wesley said, ‘*Do all the good you can*, by all the means you can, in all the ways you can, in all the places you can, at all the times you can, to all the people you can, as long as ever you can",
  "pubDate": "Sat, 20 Mar 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/79/?ignore",
  "itunes:duration": "13:13",
  "guid": "enyouth20032021-79",
  "length": 793.7,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 79: God is Good – All the Time",
  "itunes:subtitle": "Psalm 35:27b (MSG), Numbers 9:16–17, 10:29,32, Luke 3:2–3,8-16,18, 21-22.  As a result, even though he found himself in the appalling conditions of this prison, he followed Jesus’ example and ‘went around *doing good’* (Acts 10:38) As John Wesley said, ‘*Do all the good you can*, by all the means you can, in all the ways you can, in all the places you can, at all the times you can, to all the people you can, as long as ever you can",
  "itunes:summary": "Of all the prisons Pippa and I have visited around the world, this was the worst. It is in Lusaka, Zambia. The prison was built in 1950 for 250 men. Today it holds over 1,300. The cells, which were built to hold 50, are now home to over 150 men. They are locked in these cells from eight o’clock at night until eight o’clock in the morning. There isn’t enough room for all of them to lie down at the same time. They have to take it in turns. The stench and the heat in those cells must be almost unbearable. If the prisoners do not have AIDS or tuberculosis when they enter the prison, they are likely to become infected soon after.\nThe cells surround a courtyard, which is at the centre of the prison. We held a service there. Maybe because there was nothing else to do, virtually every one of the inmates attended. The service was led by a man who had been awaiting trial for four years. He was a Christian pastor who was accused of some minor offence (for which the penalty in England would probably have been a small fine, had he been convicted). Though he may well have been innocent, this man had been languishing in a prison for four years, unconvicted, without trial, not knowing when he would be released – if ever.\nI will never forget his opening words as he began to lead the service: ‘God is good – all the time.’ Here was a man who had absolute confidence in the goodness of God, not because of his circumstances but in spite of them. He knew and had experienced the goodness of God in the midst of great suffering. As a result, even though he found himself in the appalling conditions of this prison, he followed Jesus’ example and ‘went around doing good’ (Acts 10:38).\nAs John Wesley said, ‘Do all the good you can, by all the means you can, in all the ways you can, in all the places you can, at all the times you can, to all the people you can, as long as ever you can.’",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 79
}