{
  "title": "Chinese Whispers: black cat or white cat?",
  "link": "https://audioboom.com/posts/7911677",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2487,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>For most people, Mao Zedong and Xi Jinping stand out as <em>the</em> two Communist leaders of the People’s Republic of China. But growing up, it was actually a third man, by the name of Deng Xiaoping, whose legacy I felt the most.</div>\n<br>\n<div>Though less than 5 foot tall, his impact on China’s trajectory was arguably more than Mao’s; and possibly will be more than Xi’s. It was Deng’s vision of reform and opening – which we’ve talked about in passing many times on this podcast – that started a process which transformed China from a Maoist backwater to today’s economic backwater. TIME magazine twice chose him as their Man of the Year.</div>\n<br>\n<div>Yet it was also Deng who gave the final go ahead for the military clampdown of the Tiananmen Square protests. So what sort of leader and politician was he, and how do we reconcile the seeming contradictions between Deng the liberal reformer, and Deng the communist autocrat?<br>\n<br>\nI'm joined by James Carter, Professor of History at Saint Joseph's University in Philadelphia, and author of <em>Champions Day: The End of Old Shanghai.</em><br>\n<br>\nFurther links:<br>\nChinese Whispers: China's long history of student protests <a href=\"https://www.spectator.co.uk/podcast/china-s-long-history-of-student-protests\">https://www.spectator.co.uk/podcast/china-s-long-history-of-student-protests</a><br>\nChinese Whispers: How Hong Kong became what it is today <a href=\"https://www.spectator.co.uk/podcast/how-hong-kong-became-what-it-is-today\">https://www.spectator.co.uk/podcast/how-hong-kong-became-what-it-is-today</a><br>\nYouTube: Zhao Ziyang's speech at Tiananmen Square in 1989 <a href=\"https://www.youtube.com/watch?v=3ZxjV0s2CrA\">https://www.youtube.com/watch?v=3ZxjV0s2CrA</a>\n</div>\n",
  "pubDate": "Mon, 26 Jul 2021 16:58:58 +0000",
  "guid": "tag:audioboom.com,2021-07-26:/posts/7911677",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}