{
  "id": "yt:video:yb-kYt1lpnI",
  "yt:videoId": "yb-kYt1lpnI",
  "yt:channelId": "UCLXo7UDZvByw2ixzpQCufnA",
  "title": "What it’s like to work in the world’s greatest office",
  "link": "",
  "author": {
    "name": "Vox",
    "uri": "https://www.youtube.com/channel/UCLXo7UDZvByw2ixzpQCufnA"
  },
  "published": "2022-09-28T12:00:40+00:00",
  "updated": "2022-10-02T15:40:50+00:00",
  "media:group": {
    "media:title": "What it’s like to work in the world’s greatest office",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The SC Johnson administrative building was Frank Lloyd Wright’s corporate masterpiece. What does it feel like?\n\nSubscribe and turn on notifications 🔔  so you don't miss any videos: http://goo.gl/0bsAjO \n\nSC Johnson’s Administrative Building and Research Tower in Racine, Wisconsin, have become legendary as corporate headquarters buildings. The Administrative Building’s Great Workroom is a stunning example of architect Frank Lloyd Wright’s unique approach to office design.\n\nBut what did it really feel like? Vox’s Phil Edwards visited the HQ to find out — and try actually working there. He also visited the Hardy House, an earlier Wright design that features many of the same Wright signatures found in the SC Johnson building, from custom designed furniture to ideas about compression and expansion.\n\nWatch the video to see what it really feels like to work in such a space.\n\nFurther Reading:\nhttps://www.amazon.com/Frank-Lloyd-Wright-Johnson-Buildings/dp/048642748X\nJonathan Lipman’s book about Sc Johnson is one of the best-sourced and most comprehensive books about the building’s history.\n\nhttps://www.amazon.com/Frank-Lloyd-Wrights-Hardy-House/dp/0764937618\nMark Hertzberg’s exhaustive knowledge of the Hardy House — and his experiencing photographing it — is evident in his book about the building. His blog, Wright in Racine (https://wrightinracine.wordpress.com/) also has great facts and stories about Wright’s work.\n\nhttps://www.scjohnson.com/en/interacting-with-sc-johnson/tours-and-architecture/tours-and-films/youre-always-welcome-for-tours\nSC Johnson provides free tours of the Administrative Building as well as of Wingspread, a nearby home that Wright also designed.\n\nMake sure you never miss behind the scenes content in the Vox Video newsletter, sign up here: http://vox.com/video-newsletter\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com\n\nSupport Vox's reporting with a one-time or recurring contribution: http://vox.com/contribute-now\n\nShop the Vox merch store: http://vox.com/store\n\nWatch our full video catalog: http://goo.gl/IZONyE\n\nFollow Vox on Facebook: http://facebook.com/vox\nFollow Vox on Twitter: http://twitter.com/voxdotcom\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}