{
  "title": "An Efficient Approach with Dynamic Multi-Swarm of UAVs for Forest Firefighting. (arXiv:2211.01958v1 [cs.MA])",
  "link": "http://arxiv.org/abs/2211.01958",
  "description": "<p>In this paper, the Multi-Swarm Cooperative Information-driven search and\nDivide and Conquer mitigation control (MSCIDC) approach is proposed for faster\ndetection and mitigation of forest fire by reducing the loss of biodiversity,\nnutrients, soil moisture, and other intangible benefits. A swarm is a\ncooperative group of Unmanned Aerial Vehicles (UAVs) that fly together to\nsearch and quench the fire effectively. The multi-swarm cooperative\ninformation-driven search uses a multi-level search comprising cooperative\ninformation-driven exploration and exploitation for quick/accurate detection of\nfire location. The search level is selected based on the thermal sensor\ninformation about the potential fire area. The dynamicity of swarms, aided by\nglobal regulative repulsion and merging between swarms, reduces the detection\nand mitigation time compared to the existing methods. The local attraction\namong the members of the swarm helps the non-detector members to reach the fire\nlocation faster, and divide-and-conquer mitigation control ensures a\nnon-overlapping fire sector allocation for all members quenching the fire. The\nperformance of MSCIDC has been compared with different multi-UAV methods using\na simulated environment of pine forest. The performance clearly shows that\nMSCIDC mitigates fire much faster than the multi-UAV methods. The Monte-Carlo\nsimulation results indicate that the proposed method reduces the average forest\narea burnt by $65\\%$ and mission time by $60\\%$ compared to the best result\ncase of the multi-UAV approaches, guaranteeing a faster and successful mission.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+John_J/0/1/0/all/0/1\">Josy John</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Harikumar_K/0/1/0/all/0/1\">K. Harikumar</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Senthilnath_J/0/1/0/all/0/1\">J. Senthilnath</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sundaram_S/0/1/0/all/0/1\">Suresh Sundaram</a>"
}