{
  "title": "On the dielectric response function and phonon self energy of acoustic phonons in 2D Dirac crystals. (arXiv:2211.02026v1 [cond-mat.mes-hall])",
  "link": "http://arxiv.org/abs/2211.02026",
  "description": "<p>The unique structure of two-dimensional (2D) Dirac crystals, with electronic\nbands linear in the proximity of the Brillouin-zone boundary and the Fermi\nenergy, creates anomalous situations where small Fermi-energy perturbations are\nknown to critically affect the electron-related lattice properties of the\nsystem. The Fermi-surface nesting (FSN) conditions determining such effects via\nelectron-phonon interaction, require accurate estimates of the crystal's\nresponse function $(\\chi)$ as a function of the phonon wavevector q for any\nvalues of temperature. Numerous analytical estimates of $\\chi(q)$ for 2D Dirac\ncrystals beyond the Thomas-Fermi approximation have been so far carried out\nonly in terms of dielectric response function $\\chi(q,\\omega)$, for photon and\noptical-phonon perturbations, due to relative ease of incorporating a\nq-independent oscillation frequency in their calculation. However, models\naccounting for Dirac-electron interaction with ever-existing acoustic phonons,\nfor which $\\omega$ does depend on q and is therefore dispersive, are essential\nto understand many critical crystal properties. The lack of such models has\noften led to assume that the dielectric response function $\\chi(q)$ in these\nsystems can be understood from free-electron behavior. Here, we show that,\ndifferent from free-electron systems, $\\chi(q)$ calculated from acoustic\nphonons in 2D Dirac crystals using the Lindhard model, exhibits a cuspidal\npoint at the FSN condition. Strong variability of $\\frac{\\partial\\chi}{\\partial\nq}$ persists also at finite temperatures, while $\\chi(q)$ may tend to infinity\nin the dynamic case even where the speed of sound is small, albeit\nnonnegligible, over the Dirac-electron Fermi velocity. The implications of our\nfindings for electron-acoustic phonon interaction and transport properties such\nas the phonon line width derived from the phonon self energy will also be\ndiscussed.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Kazemian_S/0/1/0/all/0/1\">Sina Kazemian</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Fanchini_G/0/1/0/all/0/1\">Giovanni Fanchini</a>"
}