{
  "title": "A Targeted Search for Main Belt Comets. (arXiv:2211.01435v1 [astro-ph.EP])",
  "link": "http://arxiv.org/abs/2211.01435",
  "description": "<p>Main Belt Comets (MBCs) exhibit sublimation-driven activity while occupying\nasteroid-like orbits in the Main Asteroid Belt. MBCs and candidates show\nstronger clustering of their longitudes of perihelion around 15{\\deg} than\nother objects from the Outer Main Belt (OMB). This potential property of MBCs\ncould facilitate the discovery of new candidates by observing objects in\nsimilar orbits. We acquired deep r-band images of 534 targeted asteroids using\nthe INT/WFC between 2018 and 2020. Our sample is comprised of OMB objects\nobserved near perihelion, with longitudes of perihelion between 0{\\deg} and\n30{\\deg} and orbital parameters similar to knowns MBCs. Our pipeline applied\nactivity detection methods to 319 of these objects to look for tails or comae,\nand we visually inspected the remaining asteroids. Our activity detection\npipeline highlighted a faint anti-solar tail-like feature around 2001 NL19\n(279870) observed on 2018 November 07, six months after perihelion. This is\nconsistent with cometary activity but additional observations of this object\nwill be needed during its next perihelion to investigate its potential MBC\nstatus. If it is active our survey yields a detection rate of $\\sim$1:300,\nwhich is higher than previous similar surveys, supporting the idea of dynamical\nclustering of MBCs. If not, it is consistent with previously estimated\nabundance rates of MBCs in the OMB (&lt;1:500).\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Ferellec_L/0/1/0/all/0/1\">L&#xe9;a Ferellec</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Snodgrass_C/0/1/0/all/0/1\">Colin Snodgrass</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Fitzsimmons_A/0/1/0/all/0/1\">Alan Fitzsimmons</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Rozek_A/0/1/0/all/0/1\">Agata Ro&#x17c;ek</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Gardener_D/0/1/0/all/0/1\">Daniel Gardener</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Smith_R/0/1/0/all/0/1\">Richard Smith</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Medeiros_H/0/1/0/all/0/1\">Hissa Medeiros</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Opitom_C/0/1/0/all/0/1\">Cyrielle Opitom</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Hsieh_H/0/1/0/all/0/1\">Henry H. Hsieh</a>"
}