{
  "id": "https://bibleinoneyear.org/en/youth/353",
  "title": "Day 353: Your King",
  "description": "Psalm 145:1–2a, Ezra 5:5, Revelation 11:3–4,6–10a,11–13,15–19.  It not only refers to kingdom in a political or geographical sense, but it also conveys the notion of activity – the activity of ruling and reigning  The *kingdom of God* means ‘*the rule and reign of God*’",
  "pubDate": "Sun, 19 Dec 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/353/?ignore",
  "itunes:duration": "10:12",
  "guid": "enyouth19122021-353",
  "length": 612.47,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 353: Your King",
  "itunes:subtitle": "Psalm 145:1–2a, Ezra 5:5, Revelation 11:3–4,6–10a,11–13,15–19.  It not only refers to kingdom in a political or geographical sense, but it also conveys the notion of activity – the activity of ruling and reigning  The *kingdom of God* means ‘*the rule and reign of God*’",
  "itunes:summary": "The birth of Prince George of Cambridge in July 2013 brought great joy and celebration. He is the son of a future king of England and is himself third in line of succession to the British throne.\nThe United Kingdom has been ruled by kings and queens for centuries, and our royal family are an important part of our national life. However, most modern monarchs only have limited power. By contrast, in the ancient world, kingship was much more all-encompassing, and the king was the final authority in all aspects of national affairs. In our Old Testament passage, we read of the reigns of the kings of Persia and Israel. But alongside this, each of our passages also points us to an even greater King – God.\nThe central theme in the teaching of Jesus was the kingdom of God. It not only refers to kingdom in a political or geographical sense, but it also conveys the notion of activity – the activity of ruling and reigning. The kingdom of God means ‘the rule and reign of God’.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 353
}