{
  "id": "yt:video:g0mTDYJfCb4",
  "yt:videoId": "g0mTDYJfCb4",
  "yt:channelId": "UC3WoPalcYf7d_x4DC2BXAfw",
  "title": "Sunset Overdrive is one of the open world games ever",
  "link": "",
  "author": {
    "name": "jayvee",
    "uri": "https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw"
  },
  "published": "2022-09-25T15:00:32+00:00",
  "updated": "2022-10-02T21:48:21+00:00",
  "media:group": {
    "media:title": "Sunset Overdrive is one of the open world games ever",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Install Raid for Free ✅ IOS/ANDROID/PC: https://clcr.me/Jayvee_Sep22 and get a special starter pack 💥 Available only for the next 30 days\n\nSubscribe to jayveeonYT for more videos!\n► ​https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw?sub_confirmation=1\n\nWatch more videos on jayveeonYT! \n► https://youtube.com/playlist?list=PLGdQpBjWmxqVuXKKNVcccm81dpDwsJPvH\n\n- - - - - - - - - - - - - - - -\n\nFollow jayveeonYT!\n► Twitter: https://twitter.com/jayveeonYT\n► Discord: https://discord.gg/jayveeonyt\n► Instagram: https://www.instagram.com/jayvee.yt/​\n\nWatch More jayveeonYT!\nLatest Uploads:  \n\nSo I ranked ALL the AC games...\n► https://youtu.be/Z9_Tb_TcPYI\n\nSo I played AC Rogue in 2021...\n► https://youtu.be/LUmOm2whuvY\n\nSo I played AC Syndicate in 2021...\n► https://youtu.be/swJN5NO2gJ8\n\nSo I played AC Unity in 2021...\n► https://youtu.be/UjTt4KtAZO8\n\nSo I played AC Odyssey in 2021…\n► https://youtu.be/guMObmtv54s\n\n- - - - - - - - - - - - - - - -\n\nAbout jayveeonYT:\nNews, reactions, and gameplay of all the biggest RPGs, open world, and action-adventure video games! Jayvee covers Assassin's Creed, Cyberpunk, Fallout, and more!\n\n- - - - - - - - - - - - - - - -\n\nSunset Overdrive is an action-adventure shooter video game developed by Insomniac Games and published by Microsoft Studios. The game is set in 2027, in a fictional metropolis called Sunset City. The player controls an employee of FizzCo, who has to fight off the OD, short for Overcharge Drinkers: humans who have turned into mutants after drinking FizzCo's energy drink beverage. In the dystopian Sunset City, the player character can wall-run, use zip-lines, and grind rails to swiftly navigate through it, with a large arsenal of weapons to use. The game also has a cooperative multiplayer mode called Chaos Squad, which tasks players to complete a series of missions with seven players. As the game puts emphasis on momentum, the game does not feature any cover system.\n\nThe development of the game began in 2011 when Insomniac completed Resistance 3. After the project was green-lit internally, the studio partnered with Microsoft Studios, which helped fund the game and allowed Insomniac to keep the rights to the franchise. Insomniac described the game as a \"celebration of games\", as the team took inspiration from different sources, including Prince of Persia, Jet Set Radio and Tony Hawk's Pro Skater, though at its early stage of development the team took inspirations from DayZ instead. The game is set in a post-apocalyptic future, but the team depicted it as an \"awesomepocalypse\" that turns the game's initial world depiction into a \"playground\" for players. Sunset Overdrive uses Insomniac's internal engine, previously used in Fuse.\n\nIt was announced at E3 2013, and released worldwide for Xbox One in October 2014. A Windows version, developed by Blind Squirrel Games, was released in November 2018. The game received generally positive reviews, with praise for its visuals, traversal system, combat system, and humor. However, the game was criticized for the lack of a compelling story or innovative quest design. It received numerous nominations, including Best Xbox Game of the Year awards from several gaming publications. The game was supported with multiple pieces of downloadable content, including the story-based The Mystery of the Mooil Rig and Dawn of the Rise of the Fallen Machine, after the game's release.\n\n#gaming #sunsetoverdrive #jayvee",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}