{
  "title": "Recovering thermodynamics from spectral profiles observed by IRIS (II): improved calculation of the uncertainties based on Monte Carlo experiments. (arXiv:2211.01563v1 [astro-ph.SR])",
  "link": "http://arxiv.org/abs/2211.01563",
  "description": "<p>Observations by the Interface Region Imaging Spectrograph (IRIS) in the Mg II\nh &amp; k spectral lines have provided a new diagnostic window towards the\nknowledge of the complex physical conditions in the solar chromosphere.\nTheoretical efforts focused on understanding the behavior of these lines have\nallowed us to obtain a better and more accurate vision of the chromosphere.\nThese efforts include forward modeling, numerical simulations, and inversions.\nIn this paper, we focus our attention on the uncertainties associated with the\nthermodynamic model atmosphere obtained after the inversion of the Mg II h &amp; k\nlines. We have used ~ 50;000 synthetic representative profiles of the IRIS2\ndatabase to characterize the most important source of uncertainties in the\ninversion process, viz.: the inherent noise of the observations, the random\ninitialization of process, and the selection criteria in a high-dimensional\nspace. We have applied a Monte Carlo approach to this problem. Thus, for a\ngiven synthetic representative profile, we have created five randomized noise\nrealizations (representative of the most popular exposure times in the IRIS\nobservations), and inverted these profiles five times with different inversion\ninitializations. The resulting 25 inverted profiles, fits to noisy data, and\nmodel atmospheres are then used to determine the uncertainty in the model\natmosphere, based on the standard deviation and empirical selection criteria\nfor the goodness of fit. With this approach, the new uncertainties of the\nmodels available in the IRIS2 database are more reliable at the optical depths\nwhere the Mg II h &amp; k lines are sensitive to changes in the thermodynamics.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Dalda_A/0/1/0/all/0/1\">Alberto Sainz Dalda</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Pontieu_B/0/1/0/all/0/1\">Bart De Pontieu</a>"
}