{
  "title": "Decision Theory and Captain Picard's Leadership",
  "link": "",
  "published": "2020-02-02T00:00:00-05:00",
  "updated": "2020-02-02T00:00:00-05:00",
  "author": {
    "name": "Tommy Blanchard"
  },
  "id": "tag:tommyblanchard.com,2020-02-02:/decision-theory-and-captain-picards-leadership",
  "summary": "<p>With the start of <em>Star Trek: Picard</em> recently, I've been thinking about one of the big impacts Captain Picard has had on my life (as a lifelong geek). There is an episode of <em>Star Trek: The Next Generation</em> called \"<em>Attached</em>\", where Doctor Crusher and Captain Picard become mind-linked while trapped …</p>",
  "content": "<p>With the start of <em>Star Trek: Picard</em> recently, I've been thinking about one of the big impacts Captain Picard has had on my life (as a lifelong geek). There is an episode of <em>Star Trek: The Next Generation</em> called \"<em>Attached</em>\", where Doctor Crusher and Captain Picard become mind-linked while trapped on a strange planet. The pair need to start moving on foot through the wilderness, but Crusher has no idea which direction they should start hiking in. Picard simply says \"This way,\" and starts walking. Crusher, able to read Picard's thoughts (because, mind-link) is shocked to realize that Picard has no better idea than she does and is just arbitrarily choosing a direction, but acting confidently about it.</p>\n<p>Crusher takes this to say something deep about one of Picard's traits that make him an effective leader: his ability to act confident despite uncertainty. But there's a more general principle here that comes from normative decision theory.</p>\n<p>The decision Picard is making is between walking in different directions, without having any reason to prefer one over the other. Time is of the essense, and the morale of his crew (in this case, only Crusher) is important. Given the facts, Picard's real choice isn't what direction to walk in, but whether it's worth it to stop and consider before making a decision. Given that all directions seem the same, and there's no information to be gained, the decision <em>should</em> be as quick and confident as Picard made it. The potential payoffs and risks of each option is the same. There is a cost to stopping to consider: it takes time, and it can lower morale among crew because he is giving an indication of uncertainty. Picard therefore should do what he did: make the decision of which direction to go based on a mental coin flip. He's able to act confidently because he actually has made the best choice he could have: the choice to not waste resources deliberating.</p>\n<p>When is the best course of action to just arbitrarily choose an option and get on with it? The value to be gained from stopping to think about a decision rather than just using a mental coin-flip is proportional to the difference in the value of the options. If choosing between $20 and $15, the value of being deliberate and not just tossing a coin is $2.50 ($5, cut in half since if you flipped a coin half the time you would choose the $20). When put in terms of money, decisions are easy because we just look at what number is larger. In real life, we have options that we might not explicitly put a number on, but we have some subjective valuation of that's useful to think of as a number (e.g. the amount you would pay to take that option). Similarly, you can imagine putting a price on how much you would pay to get rid of the anxiety of the decision and have your time back. Deliberate decisions have a cost.</p>\n<p>If choosing between an obviously good option (one you would pay $100 for) and an obviously bad (one you would pay $20 to <em>avoid</em>), there's quite a bit of value to making a deliberate choice. However, in most cases that choice will be obvious and therefore require little deliberation. High payoff and low cost since the deliberation will be quick, so you should definitely actually consciously choose. It isn't hard and doesn't take much deliberation to decide you would prefer to get a free fancy dinner over having smelly garbage dumped all over your kitchen. If the values are closer together, like choosing between two high-end restaurants, the decision might be harder. Is one worth $105 to you and the other worth only $104? It might be hard to distinguish your true valuations of the two options and which is higher because they are so close. But because they are close, the value of a deliberate choice is diminished -- you'll end up with a good dinner regardless, and the difference in value to you might only be a couple of dollars. Choosing between two very different options, like a new pair of jeans and a high-end meal might also be difficult, but the more difficult it seems, the closer the values of those options must be to you, so the less it matters what you choose. Again, you'll be happy with either.</p>\n<p>If there's low or no value to a deliberate choice, the costs of making a deliberate choice can easily outweigh the value of having made the deliberate choice. Ironically, these are also the situations in which we're most likely to be struck with indecisiveness, simply because it isn't so easy to distinguish the values of the options. We can go back and forth, imagining taking one option and then the other, and being unsure which we value more. If the options are complicated, it might be worth it to give the decision a bit of thought and make sure you're not missing something obvious, but beyond that you're facing the same situation as Picard: two options very close in value, and the real decision is how long you're going to sit and think about it. The longer you think about it, the bigger the cost -- in terms of time, the anxiety of making the decision, the mental effort, etc. Since the options are close in value, it's very easy for these costs to outweigh the benefit of choosing the better option (if there even is one). Even with large life decisions, if a large difference in value doesn't appear after thinking about it for a day, is it worth being anxious and uncertain about it for a week if the value difference between them is so indistinguishable? Likely not.</p>\n<p>When I face a decision where there isn't an obvious right answer, especially when the stakes are low, I often think of Picard and make the decision quick. I'm put at ease knowing that by just arbitrarily picking an option, I'm actually making the right choice -- the choice to not pay the price of being indecisive.</p>",
  "category": [
    "",
    ""
  ]
}