{
  "id": "yt:video:R9_mP48PNwA",
  "yt:videoId": "R9_mP48PNwA",
  "yt:channelId": "UCTUtqcDkzw7bisadh6AOx5w",
  "title": "How To Write A Hardcore Punk Riff",
  "link": "",
  "author": {
    "name": "12tone",
    "uri": "https://www.youtube.com/channel/UCTUtqcDkzw7bisadh6AOx5w"
  },
  "published": "2022-11-04T17:00:18+00:00",
  "updated": "2022-11-04T17:00:18+00:00",
  "media:group": {
    "media:title": "How To Write A Hardcore Punk Riff",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "It's more than just power chords.\nSupport 12tone on Patreon to help us keep making cool videos! https://www.patreon.com/12tonevideos\n\nPunk is an interesting genre for music theorists, because it very much doesn't care what music theorists have to say. This rebellious attitude toward musical norms can make it difficult to study, and most scholarship on punk simply focuses on its politics and culture instead, but there's also a lot of really cool musical ideas happening, so let's talk about how punk riffs actually work.\n\nMerch: http://standard.tv/12tone\nDiscord: https://discord.gg/pq2QBEw\nTwitter: https://twitter.com/12tonevideos\nEmail: 12tonevideos@gmail.com\n\nScript: https://tinyurl.com/33eh974j\n\nHuge thanks to our Elephant Club members:\n\nSusan Jones\nJill Jones\nDuck \nHoward Levine\nLen Lanphar\nWarren Huart\nKevin Wilamowski\nKen Arnold\nGrant Aldonas\nElaine Pratt\nWilliam (Bill) Boston\nChris Prentice\nJack Carlson\nChristopher Lucas\nAndrew Beals\nDov Zazkis\nHendrik P\nThomas Morley\nJacob Helwig\nDavis Sprague\nKelly Christoffersen\nBraum Meakes\nDonal Botkin\nStephen Cook\nHendrik Stüwe\nDan Bonelli\nKevin Boyce\nDarius Rudominer\nLuke\nIan Seymour\nDhruv Monga\nKen Jones\nObadiah Wright\nCarlos Rendon\nDamien Fuller-Sutherland\nKylie McInnes\nJody \nNeil Moore\nPhilRosas \nReiji Kobayashi\nCatherine Berry\nMatt Ivaliotes\nKai\nChris Davis\nLiz Webb\nOrionWolfie \nLaurence T Maloney\nOliver Marchand\nLuke Klima\nFred Kroon\nHardScale\nChris Piro\nMatt Robbins\nRyan Evans\nShanta Kaneshiro\nChris Burgess\n\nAnd thanks as well to Henry Reich, Gabi Ghita, Gene Lushtak, Eugene Bulkin, Logan Jones, Oliver, Anna Work, Adam Neely, Rick Lees, Dave Mayer, CodenaCrow, Arnas, Caroline Simpson, Michael Alan Dorman, Blake Boyd, Charles Gaskell, Trevor Sullivan, Tom Evans, JH, David Conrad, Ducky, Todd Davidson, Chris Borland, Jake Lizzio, Chris Connett, Elliot Burke, Kenneth Kousen, h2g2guy, W. Dennis Sorrell, Tim S., Elias Simon, Jerry D. Brown, Ohad Lutzky, Peter Leventis, Symmetry, Andrew Engel, James A. Thornton, Peter Brinkmann, Stefan Strohmaier, Michael Mol, Adam Wurstmann, Angela Flierman, Richard T. Anderson, naomio, Alex Mole, Kevin Johnson, Joshua La Macchia, Rodrigo \"rrc2soft\" Roman, Jeremy Zolner, Dented Ducklet, Francois LaPlante, Volker Wegert, John Bejarano, Betsy, Tonya Custis, Dave Shapiro, Jacopo Cascioli, Gary Butterfield, Rafael Martinez Salas, Walther, Steve Brand, Rene Miklas, Graeme Lewis, Jake Sand, Doug Nottingham, Nicholas Wolf, Jim Hayes, Robert Beach, Scott Albertine, Jason Nebergall, Mathew Wolak, Evan Satinsky, S, Lincoln Mendell, Conor Stuart Roe, ZagOnEm, Sam Rezek, Destros, Lucas Augusto, Dragix PL, RaptorCat, Jigglypuffer, leftaroundabout ., Mikely Whiplash, Austin Amberg, Kottolett, Dylan Vidas, Francisco Rodrigues, Michael Tsuk, ThoraSTooth, Brandon Legawiec, Brian Miller, Hikaru Katayamma, Rob Hardy, Bryn Davis, Pamela O'Neill, Patrick Chieppe, Eric Stark, David Haughn, Gordon Dell, Thomas Morgan, Ludwick Kennedy, Matty Crocker, anemamata, Lee-orr Orbach, Eric Plume, Caitlin Olsen, Ridley Kemp, Mark James, Jason Peterson, Peggy Youell, EJ Hambleton, Adam Ziegenhals, Jos Mulder, Daryl Banttari, J.T. Vandenbree, Mark, Amelia Lewis, sonicolasj, John Castle, William Merryman, Ryan Mayle, Justin St John-Brooks, AkselA, DialMForManning, Sam Plotkin, Nellie Speirs Baron, Charles R., Joshua Lewis, Joseph Satin, Piush Dahal, Matthew Moore, Sam, Wayne Weil, Andrew Wyld, JD White, David T Peterson, Bryan C. Mills, Joe Johnston, Jordan Friendshuh, XCompWiz, Michael Blaby, Bean, A Devoted Servant of the Holy Water Bottle, Milan Brezovsky, Edmund Horner, NinoDoko, vivi mouse emoji, Claymore Alexander, M. Bock, Daniel Joseph Moynihan, gunnito, Josh Witkowski, Coffee and Antidepressants Is Not Breakfast, Graham Orndorff, Daniel Sim, Joel LaRosa, Jason McPherson, Chris Robson, A.J. Yates, Matt Moulder, Leander Tietjen, Alex Tafur, findRED, Howl’s one-handed egg cracking technique, Jeffrey Mann, Gary Backaus, Drunk Wookiee, Chris Breault, David Wagner, Eugen Lounkine, Fernando Gros, Geoffrey Barnett, OVB_2nd, William, Douglas Anderson, Foreign Man in a Foreign Land, Vigilance Deadname, Boomer Dell, RoxyPop, Paul Tanenholz, Lev, Tom, Adam Poata-Smith, J.R. Hyde, A, William Christie, Taylor Malik, Christopher Beattie, triskadecaepyon, Abie, Charles Jordan, Kelly Walker, Stephen Tolputt, Patterner, Messier42, Bradley Crowley, Mark Mitchell Gloster, Andy Maurer, William Spratley, Samuel Ollesh, Don Jennings, Cormag81, Derek Hiemforth, Bryan, Mikeyxote, Milan Durnell, Dan Whitmer, Thel 'Vadam, Cole McIntyre, Andrew Herald, Mireille C, Justin Carpenter, N Zaph, David Dynes, M3RK Chaos Official Patreon page, Peter Golbus, Marc Testart, Carlfish, Ceri Williams, Peter, Michael Morris, Bill Owens, Stephanie Miller, Martin Romano, George Burgyan, rpenguinboy, Patrick Jillett, Belinda Reid, Kyle Kinkaid, Tim Smith, Scott Fendley, and Matthew Soddy! Your support helps make 12tone even better!\n\nAlso, thanks to Jareth Arnold!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}