{
  "title": "SC EP:895 The Creature On Grandpa's Property",
  "itunes:title": "SC EP:895 The Creature On Grandpa's Property",
  "pubDate": "Fri, 14 Oct 2022 23:02:54 +0000",
  "guid": "dc02b07d-c43f-4c2c-b3a7-ae2ea017d36b",
  "link": "https://sasquatchchronicles.com/sc-ep895-the-reature-on-grandpas-property/",
  "itunes:image": "",
  "description": "<p>I am currently trying to resolve the log in issues with the app. I know there was about 10% of the members that kept getting errors with the app. You might have issues logging into the website till Sunday. I apologize for the inconvenience but I want the app to run like a well oiled machine. This is also why you have not seen any new blogs because of the transfer of servers.</p> <p>Tonight I will be speaking to Kody writes \"I hope that you’re doing well; I had come across your podcast while listening to and researching to find the answer to the phenomenon that we all call Bigfoot… That being said, I had a run in with a creature that has me questioning everything that I’ve ever known in the woods.<br /> <br /> I’m an avid outdoorsman and have fished and hunted my entire life. Although being born and residing in Texas, I grew up in Southeastern Oklahoma, hunting the mountains with my dad, uncle, brother and grandpa. The majority of my extended family still lives in a small area in south east Oklahoma so we normally go up a couple of times a year during the holidays to see them. Which in my case being an avid outdoorsman gives me the opportunity to deer hunt. I love being in the outdoors and had aspirations to be a wildlife biologist, but was turned towards a business degree when I was afforded the opportunity to play football in college. Every waking moment when I was out of class or practice I would be headed off to hunt of fish.</p> <p>2008- Onto my story, I was redshirted due to a football injury in college and had time off between school and football practice in Texas. I called my best friend to go make a trip up to my grandads in Oklahoma just in time for the opening weekend of Turkey season (April/ May timeframe). We had a cold front move in the day before season had opened, which in turn shut down the turkey gobbling and activity. It was early afternoon and we both split up to different sides of the ranch in hopes of roosting a gobbler for the following day. I traveled up a canyon with hopes to travel up to the top of the ridge and get some higher ground to at least be able to roost one before it got dark. I jumped a creature (up out of its bed I’m assuming) at very close range (10ft away from me) that brought on a range of emotions and things that I cannot explain and have not discussed with anyone outside of my family and a couple of my very close friends. After the whirlwind of events during and after this encounter, years of strange things happening while I was hunting in the woods began to add up. I am familiar with every animal big and small native to North America and the creature that I ran into was like none that I’ve ever seen in my entire life or care to see again. I’m 6’7” and this thing dwarfed me and made me lock up like a baby. I’d like to discuss in detail if you have some time in the near future.\"</p>",
  "content:encoded": "<p>I am currently trying to resolve the log in issues with the app. I know there was about 10% of the members that kept getting errors with the app. You might have issues logging into the website till Sunday. I apologize for the inconvenience but I want the app to run like a well oiled machine. This is also why you have not seen any new blogs because of the transfer of servers.</p> <p>Tonight I will be speaking to Kody writes \"I hope that you’re doing well; I had come across your podcast while listening to and researching to find the answer to the phenomenon that we all call Bigfoot… That being said, I had a run in with a creature that has me questioning everything that I’ve ever known in the woods.  I’m an avid outdoorsman and have fished and hunted my entire life. Although being born and residing in Texas, I grew up in Southeastern Oklahoma, hunting the mountains with my dad, uncle, brother and grandpa. The majority of my extended family still lives in a small area in south east Oklahoma so we normally go up a couple of times a year during the holidays to see them. Which in my case being an avid outdoorsman gives me the opportunity to deer hunt. I love being in the outdoors and had aspirations to be a wildlife biologist, but was turned towards a business degree when I was afforded the opportunity to play football in college. Every waking moment when I was out of class or practice I would be headed off to hunt of fish.</p> <p>2008- Onto my story, I was redshirted due to a football injury in college and had time off between school and football practice in Texas. I called my best friend to go make a trip up to my grandads in Oklahoma just in time for the opening weekend of Turkey season (April/ May timeframe). We had a cold front move in the day before season had opened, which in turn shut down the turkey gobbling and activity. It was early afternoon and we both split up to different sides of the ranch in hopes of roosting a gobbler for the following day. I traveled up a canyon with hopes to travel up to the top of the ridge and get some higher ground to at least be able to roost one before it got dark. I jumped a creature (up out of its bed I’m assuming) at very close range (10ft away from me) that brought on a range of emotions and things that I cannot explain and have not discussed with anyone outside of my family and a couple of my very close friends. After the whirlwind of events during and after this encounter, years of strange things happening while I was hunting in the woods began to add up. I am familiar with every animal big and small native to North America and the creature that I ran into was like none that I’ve ever seen in my entire life or care to see again. I’m 6’7” and this thing dwarfed me and made me lock up like a baby. I’d like to discuss in detail if you have some time in the near future.\"</p>",
  "enclosure": "",
  "itunes:duration": "54:20",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Bigfoot Encounter",
  "itunes:episodeType": "full"
}