{
  "id": "tag:blogger.com,1999:blog-10004977.post-4744932324761137127",
  "published": "2022-11-03T12:07:00.002-04:00",
  "updated": "2022-11-03T12:07:35.230-04:00",
  "title": "October Employment Preview",
  "content": "On Friday at 8:30 AM ET, the BLS will release the employment report for October.  The consensus is for 200,000 jobs added, and for the unemployment rate to increase to 3.6%.<div><br /></div>There were 263,000 jobs added in September, and the unemployment rate was at 3.5%.<div><br /></div><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEieEcHipOIM3-Nd79VcK8qsaPiLZc8MiEtWdyw2hbmaoyCsZVnMz9_TN1x5VV3mzKc6ONw3Cs1TjWKtoSsUEnh4a6dCzK3lJHNgBrxazb7xHWvrIAIx7k0Af_wFvtz-IkBO7DXSVGPOB0PDTGuGuC25BvGwC1SJy3OV3IdN1OghFkSh3_WKBA/s1101/EmployRecessionSept2022.PNG\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"Employment Recessions, Scariest Job Chart\" border=\"0\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEieEcHipOIM3-Nd79VcK8qsaPiLZc8MiEtWdyw2hbmaoyCsZVnMz9_TN1x5VV3mzKc6ONw3Cs1TjWKtoSsUEnh4a6dCzK3lJHNgBrxazb7xHWvrIAIx7k0Af_wFvtz-IkBO7DXSVGPOB0PDTGuGuC25BvGwC1SJy3OV3IdN1OghFkSh3_WKBA/s320/EmployRecessionSept2022.PNG\" style=\"border: 1px solid rgb(0, 0, 0); float: right; margin: 10px;\" /></a><i><b><span style=\"font-size: 85%;\">Click on graph for larger image.</span></b></i><br /><br />• First, as of September there are 514 thousand more jobs&nbsp;than in February 2020 (the month before the pandemic).<br /><br />This graph shows the job losses from the start of the employment recession, in percentage terms.&nbsp; <b>As of August 2022, all of the jobs have returned.</b><br /><br />This doesn't include the <a href=\"https://www.calculatedriskblog.com/2022/08/employment-preliminary-annual-benchmark.html\">preliminary benchmark revision </a>that showed there were 462 thousand more jobs than originally reported in March 2022.<br /><br />• <b>ADP Report:</b>&nbsp;The <a href=\"https://adpemploymentreport.com/\">ADP employment repor</a>t showed 239,000 private sector jobs were added in October.&nbsp; This is the third release of ADP's new methodology, and this suggests job gains somewhat above consensus expectations.<br /><br />• <b>ISM Surveys:</b>&nbsp;Note that the ISM services are diffusion indexes <b>based on the number of firms hiring</b> (not the number of hires).&nbsp; The <a href=\"https://www.calculatedriskblog.com/2022/11/ism-manufacturing-index-declined-to-502.html\">ISM® manufacturing employment index</a> increased in October to 50.0%, down from 48.7% last month. &nbsp; This would suggest 20,000 jobs lost in manufacturing.<br /><br />The <a href=\"https://www.calculatedriskblog.com/2022/11/ism-services-index-decreased-to-544-in.html\">ISM® services employment index</a> decreased in October to 49.1%, down from 53.0% last month. &nbsp; This would suggest service employment increased 40,000 in October.<br /><br />Combined, the ISM surveys suggest 20,000 jobs added in October (way below the consensus forecast).<br /><br />• <b>Unemployment Claims:</b> The <a href=\"https://www.calculatedriskblog.com/2022/11/weekly-initial-unemployment-claims-at.html\">weekly claims report</a> showed a slight increase in the number of initial unemployment claims during the reference week (includes the 12th of the month) from 209,000 in September to 214,000 in October.  This would usually suggest above the same number of layoffs in October as in September.&nbsp;<b>In general, weekly claims were lower than expectations in October.</b><br /><div><div><br /></div><div>•&nbsp; <b>COVID:</b> As far as the pandemic, the number of <b>weekly cases during the reference week in October was around 264,000</b>, down from 472,000 in September.&nbsp;&nbsp;</div><div><br /></div>• <b>IMPORTANT:</b> Seasonal retail hiring is important in October.&nbsp; In the last two Octobers, seasonal retail hiring was strong, and retailers hired about 235 thousand seasonal workers.&nbsp; That added about 50 thousand jobs to the seasonally adjusted headline number.&nbsp; This will be a key number to watch (and also provides a <a href=\"https://www.calculatedriskblog.com/2022/10/retail-october-seasonal-hiring-vs.html\">hint about what retailers expect</a> this holiday season).<br /><br /><div>• <b>Conclusion:</b>&nbsp;The consensus is for job growth to slow to 200,000 jobs added in October.&nbsp; The ADP report was slightly above expectations, and weekly claims were positive.&nbsp; However, the ISM employment surveys were disappointing, and seasonal retail hiring will probably be down this year compared to the previous two years.&nbsp; My guess is the report will be close or below consensus.</div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Calculated Risk",
    "uri": "http://www.blogger.com/profile/08664541332908374389",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}