{
  "id": "yt:video:7aXbh9VUB3U",
  "yt:videoId": "7aXbh9VUB3U",
  "yt:channelId": "UCS0N5baNlQWJCUrhCEo8WlA",
  "title": "So how does a PS/2 keyboard interface work?",
  "link": "",
  "author": {
    "name": "Ben Eater",
    "uri": "https://www.youtube.com/channel/UCS0N5baNlQWJCUrhCEo8WlA"
  },
  "published": "2021-03-06T15:58:30+00:00",
  "updated": "2022-06-01T06:43:27+00:00",
  "media:group": {
    "media:title": "So how does a PS/2 keyboard interface work?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Check out https://eater.net for more computer engineering stuff!\nList of scancodes from the video: https://docs.google.com/document/d/1w--ouGvSSf93tFltmBcSRGMN8Rte7ayalQZRDPG0ezk/edit\n\nSupport these videos on Patreon: https://www.patreon.com/beneater or https://eater.net/support for other ways to support.&#13;\n&#13;\n------------------&#13;\n&#13;\nSocial media:&#13;\nWebsite: https://www.eater.net&#13;\nTwitter: https://twitter.com/ben_eater&#13;\nPatreon: https://patreon.com/beneater&#13;\nReddit: https://www.reddit.com/r/beneater&#13;\n&#13;\nSpecial thanks to these supporters for making this video possible:\nAleksey Smolenchuk, Alexander Wendland, Andrew C. Young, Anson VanDoren, Anthanasius, Armin Brauns, Ben Cochran, Ben Dyson, Ben Kamens, Ben Williams, Bill Cooksey, Binh Tran, Bouke Groenescheij, Bradley Pirtle, Bradley Stach, Brent Reusing, Brian T Hoover, Bryan Brickman, Bryan Glezerson, CaffeinatedClockmaker, Carlos Ambrozak, Christopher Blackmon, Dale Andrew Darling, Daniel Jeppsson, Daniel Tang, Dave Burley, Dave Walter, David Brown, David Clark, David Cox, David House, David Sastre Medina, David Turner, David Worsham, Dean Winger, Dissy, dko, Dmitry Guyvoronsky, dstensnes, Dušan Dželebdžić, Dzevad Trumic, Emilio Mendoza, Eric Busalacchi, Eric Dynowski, Erik Broeders, Eugene Bulkin, George Foot, George Miroshnykov, Harry McDow, Ingo Eble, Ivan Sorokin, james schaefer, Jared Dziedzic, Jason DeStefano, Jason Specland, JavaXP, Jay Binks, Jayne Gabriele, Jeffery Springs, Jeremy A., Jim Kelly, Jim Knowler, Jim Van Meggelen, Joe Beda, Joe OConnor, Joe Pregracke, Joel Jakobsson, Joel Miller, John Fenwick, John Meade, Jon Dugan, Joseph Portaro, Joshua King, Kai Wells, Kefen, Kenneth Christensen, Kent Collins, Koreo, Lambda GPU Workstations, Larry, László Bácsi, Lukasz Pacholik, Marcus Classon, Martin Roth, Mats Fredriksson, Matt Krueger, Matthäus Pawelczyk, melvin2001, Michael Garland, Michael Tedder, Michael Timbrook, Michael Weitman, Miguel Ríos, mikebad, Mikel Lindsaar, Miles Macchiaroli, moi n, Nicholas Counts, Nicholas Moresco, Nick, Örn Arnarson, Paul Pluzhnikov, Paul Randal, Pete Dietl, Phil Dennis, Philip Hofstetter, Phillip Glau, PixelSergey, ProgrammerDor, Randal Masutani, Randy True, Raoul van Prooijen, Renaldas Zioma, Ric King, Rob Bruno, Robert Comyn, Robert Diaz, Roland Bobek, sam raza, Sergey Kruk, SonOfSofaman, Stefan Nesinger, Stefanus Du Toit, Stephen, Stephen Riley, Stephen Smithstone, Steve  Jones, Tayler Porter, TheWebMachine, Tom, Tyler Latham, Vincent Bernat, Vladimir Solomatin, Walter Montalvo, Warren Miller, xisente, Yee Lam Wan, דויד אללוף",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}