{
  "title": "PlayStation VR2: release date, launch games, price, and more",
  "link": "https://www.digitaltrends.com/gaming/playstation-vr2-psvr-news-rumors-price/",
  "pubDate": "Fri, 04 Nov 2022 20:00:06 +0000",
  "dc:creator": "Jesse Lennox",
  "category": [
    "Gaming",
    "Guides",
    "News",
    "PlayStation 5",
    "PlayStation VR2",
    "PSVR 2",
    "Sony",
    "virtual reaility"
  ],
  "guid": "https://www.digitaltrends.com/?p=3097074",
  "description": "Some major questions we have are still up in the air, but there is plenty to get excited about. Here's everything we know about the PlayStation VR2 so far.",
  "content:encoded": "<p>Sony was the first of the console manufacturers to really give virtual reality a shot when it made <a href=\"https://www.digitaltrends.com/gaming/playstation-vr-review/\">the first PlayStation VR unit</a> for the PlayStation 4. While impressive for the price, there were a lot of drawbacks: Players didn&#8217;t like having to use controllers from the PS3 generation, the camera tracking wasn&#8217;t great, and the resolution left much to be desired. Despite all of that, PS VR ended up being one of the <a href=\"https://www.digitaltrends.com/computing/best-vr-headsets/\">bestselling headsets on the market</a>.</p>\n<p>Seeming to take all the lessons learned from the PS VR, as well as looking at what advancements other headsets have made, Sony unveiled the new PlayStation VR2. Initially <a href=\"https://blog.playstation.com/2022/02/22/first-look-the-headset-design-for-playstation-vr2/\" target=\"_blank\" rel=\"noopener\">just a blog post</a>, Sony has slowly been trickling out more and more information on the upcoming addition to <a href=\"https://www.digitaltrends.com/gaming/sony-playstation-5-review/\">the PS5</a>. Some of the major questions we have are still up in the air, but there is plenty of information floating around to get excited about. Here&#8217;s everything we know about the PlayStation VR2 so far.</p>\n<h3>See more</h3>\n<ul>\n<li><a href=\"https://www.digitaltrends.com/gaming/psvr-2-mainstream-potential/\">Sony&#8217;s next PS VR helmet is VR&#8217;s best chance at going mainstream</a></li>\n<li><a href=\"https://www.digitaltrends.com/gaming/best-psvr-games/\">The best PS VR games for 2022</a></li>\n<li><a href=\"https://www.digitaltrends.com/gaming/best-ps5-games/\">The best PS5 games for 2022</a></li>\n</ul>\n\n<h2>Release date</h2>\n<figure id=\"attachment_3097389\" aria-describedby=\"caption-attachment-3097389\" class=\"wp-caption alignnone\"><img  class=\" wp-image-3097389 size-large\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/06/playstation-vr-2-psvr2-composite.jpg?fit=720%2C720&p=1\" alt=\"Playstation VR2 hjeadset on a PlayStation-themed wallpaper.\"   /><figcaption id=\"caption-attachment-3097389\" class=\"wp-caption-text\"><span class=\"credit\">Sony</span></figcaption></figure>\n<p>As announced on the official <a href=\"https://blog.playstation.com/2022/11/02/playstation-vr2-launches-in-february-at-549-99/\" target=\"_blank\" rel=\"noopener\">PlayStation Blog</a>, PlayStation VR2 will arrive on February 22, 2023.</p>\n<h2>Launch lineup</h2>\n<figure class=\"alignnone\"><img  class=\" wp-image-3095170 size-large\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/06/Horizon-Call-of-the-Mountain-playstation.jpg?fit=720%2C720&p=1\" alt=\"Horizon Call of the Mountain game still with characters in a boat.\"   /></figure>\n<p>Sony has stated that the PlayStation VR2 will ship with over 20 games at launch. We&#8217;ve seen a handful of VR titles teased by Sony, but there&#8217;s no definite list of which ones will be available on day one.</p>\n<p>We feel that <em><a href=\"https://www.digitaltrends.com/gaming/horizon-call-of-the-mountain/\">Horizon Call of the Mountain</a>, </em>a first-party title and the first game we saw for PS VR2, is a good bet to be one of those launch titles. Other games we know are coming to PS VR2 at launch or after include:</p>\n<ul>\n<li><em><a href=\"https://www.digitaltrends.com/gaming/among-us-vr-release-date-trailer-gameplay-news/\">Among Us VR</a></em></li>\n<li><em>Demeo</em></li>\n<li><em>Firewall Ultra</em></li>\n<li><em>Firmament</em></li>\n<li><em><a href=\"https://www.digitaltrends.com/gaming/horizon-call-of-the-mountain/\">Horizon Call of the Mountain</a></em></li>\n<li>A Jurassic Park game from Coatsink</li>\n<li><em>Low-Fi</em></li>\n<li><em>No Man&#8217;s Sky</em></li>\n<li><em><a href=\"https://www.digitaltrends.com/gaming/resident-evil-4-remake-release-date-trailer-gameplay-news/\">Resident Evil 4 Remake</a></em></li>\n<li><a href=\"https://www.digitaltrends.com/gaming/resident-evil-village-motion-capture/\">Resident Evil Village</a></li>\n<li><em>Runner</em></li>\n<li><em>Samurai Slaughter House</em></li>\n<li><em>Star Wars: Tales From the Galaxy&#8217;s Edge</em></li>\n<li><em>The Walking Dead: Saints and Sinners &#8212; Chapter 2: Retribution</em></li>\n</ul>\n<p>Unfortunately, it was confirmed on the <a href=\"https://blog.playstation.com/2022/09/16/official-playstation-podcast-episode-439-virtual-impressions/\" target=\"_blank\" rel=\"noopener\">official PlayStation Podcast</a> in episode 439 that PS VR2 will not be backward compatible with the original PS VR. This is a major blow to the potential launch lineup for the headset, as well as the potential for those great older games to get a second life.</p>\n<h2>Specs</h2>\n<figure class=\"alignnone\"><img  class=\"size-large wp-image-3143006 \" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/07/playstation-v2-2-boundary.jpg?fit=720%2C405&p=1\" alt=\"The PlayStation VR 2's boundary feature as seen through the headset.\"   /></figure>\n<p>Even for the time, the first PS VR was quite underpowered, as well as cumbersome. The resolution, tracking, and makeshift motion controls with the camera, plus the thick cords and extra box, made it a chore to use. PS VR2 flips the script by appearing to be, at least for the time, one of the most powerful headsets on the market.</p>\n<p>The first major question is always going to be about cords. While we can&#8217;t untether the PS VR2 from the PS5, which is doing the heavy lifting, we at least are down to a single, slim USB Type-C wire running from the headset into your console. It isn&#8217;t ideal, obviously, but it&#8217;s still a big step up from the last iteration.</p>\n<p>PS VR2 will have two OLED eye displays that each display at a 2000 x 2040 resolution, combined equaling 4000 x 2040 at a 110-degree field of view, which is higher than <a href=\"https://www.digitaltrends.com/computing/quest-2-vr-headset-is-dominating-steam/\">the Meta Quest 2</a>. It will also be able to handle foveated rendering and frame rates of 90Hz or 120Hz. What that all means is this headset can do 4K HDR and potentially hit up to 120 frames per second. This will all vary from game to game, however.</p>\n<p>Not only is the PS VR2 impressive in what your eye will see but also in how it will see your eye. PS VR2 will feature eye-tracking technology, which can allow for more immersive experiences but potentially also ease motion sickness. There&#8217;s a lot of potential with eye-tracking and how it can be implemented, but it&#8217;s still so new that we don&#8217;t really know what to expect from it.</p>\n<p>Another great lesson PS VR2 learned was to ditch the external camera and use inside-out tracking. This means the headset itself has four cameras built in that make it track your movements far more accurately, without any blind spots or lighting interference that the PS VR camera had trouble with. It will also have built-in 3D audio, which is essential for VR.</p>\n<p>We also learned that <a href=\"https://www.digitaltrends.com/gaming/playstation-vr2-features-see-through/\">PS VR2 will have a see-through view</a> option that allows users to activate the exterior cameras to see their real surroundings without having to remove the headset. Much like other modern VR units, you will also be able to create your own play boundaries with the controllers and be warned if you&#8217;re approaching them to help keep you safe.</p>\n<p>PS VR 2 will come with two modes: one for VR-specific content and the other for non-VR content. VR Mode gives a full 360-degree view at the previously mentioned resolution of 4000 x 2040 HDR at 90Hz/120Hz frame rates. Cinematic Mode, on the other hand, is for using the headset as a screen for normal games or media. This will run at 1920 x 1080 HRD and 24Hz/60Hz or 120Hz frame rates.</p>\n<p>Finally, let&#8217;s talk about the new controllers. Called the PS VR2 Sense controllers, these look very similar to other top VR controllers in design. Each controller has a thumbstick, two face buttons, a trigger, and a button where your thumb will rest. It has the same adaptive triggers as the PS5&#8217;s DualSense controller, haptic feedback, and full-finger touch detection. This lets the game know whether or not your fingers are resting on the controller or lifted to more accurately represent gestures in-game.</p>\n<p>We even got a full trailer showing how all this technology comes together to create the most immersive VR experience yet.</p>\n<iframe src=\"https://www.youtube.com/embed/u5L9Mvh7tAk\" width=\"640\" height=\"360\"></iframe>\n<p>While nothing new was shown, it did highlight how the display, eye tracking, rendering, FOV, and haptic feedback in the controller and headset itself will combine to fully immerse you in the game.</p>\n<h2>Price</h2>\n<figure id=\"attachment_3097405\" aria-describedby=\"caption-attachment-3097405\" class=\"wp-caption alignnone\"><img  class=\" wp-image-3097405 size-large\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/06/playstation-vr-2-psvr2-behind-composite.jpg?fit=720%2C720&p=1\" alt=\"PlayStation VR2 headset from behind with controllers.\"   /><figcaption id=\"caption-attachment-3097405\" class=\"wp-caption-text\"><span class=\"credit\">Sony</span></figcaption></figure>\n<p>Also confirmed with the release date was the starting price for the headset. For just the unit itself, which includes the two controllers and headphones, it will cost you $550. There is also a bundle that packs in a voucher code for <em>Horizon Callo of the Mountain </em>that brings the price up to an even $600, which would be a slight discount on the game assuming it will cost $70 like a traditional PS5 game.</p>\n<h2>Pre-order</h2>\n<p>Much like the PS5, or any new gaming hardware, really, expect the PS VR2 to sell out very fast upon launch. Sony will begin issuing pre-orders on November 15, however you can <a href=\"https://www.playstation.com/en-us/ps-vr2/register-to-pre-order/?smcid=psvr2-psd:landingpagebanner:register\" target=\"_blank\" rel=\"noopener\">register for your pre-order right now</a> to order directly from PlayStation.</p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2022/06/playstation-vr-2-psvr2-composite.jpg?p=1",
  "enclosure": "",
  "post-id": 3097074
}