{
  "title": "#452: Essence of Goat (OOTP 16, In The Hog’s Head)",
  "link": "https://audioboom.com/posts/7494631",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4846,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>MuggleCast has launched a listener survey so we can hear what you think of the show. <a href=\"https://forms.gle/EyfFrFvovQhHisiE8\">Please take a couple minutes to fill it out</a>\n</li>\n<li>This week's episode is sponsored by ThirdLove, makers of the perfect fitting bra. Visit <a href=\"http://www.thirdlove.com/MuggleCast\">ThirdLove.com/MuggleCast</a> for 15% off!</li>\n<li>J.K. Rowling announces the next Cormoran Strike novel is finished!</li>\n<li>Kobe Bryant: how Harry Potter inspired his Wizenard Series</li>\n<li>Muggle Mail covers some clever questions from a 10-year-old listener!</li>\n<li>Chapter-by-Chapter continues with Order of the Phoenix - Chapter 16: In The Hog's Head</li>\n<li>7-Word Summary: Shady happenings occur within Aberforth's dingy bar</li>\n<li>What in the world is up with the <a href=\"https://www.hp-lexicon.org/?attachment_id=22956\">chapter art</a>?</li>\n<li>Harry's internal struggle: to teach or not to teach Defense Against Dark Arts?</li>\n<li>A mummy, two Yorkshire dementors and a shifty-looking witch walk into a bar...</li>\n<li>Undercover thief! Is it pure coincidence or on Dumbledore's orders that Mundungus is in the Hog's Head?</li>\n<li>Aberforth looks familiar to Harry. Oh, really?</li>\n<li>Is the Hog's Head really that dirty and grimy or is a bit of magic at play?</li>\n<li>The bar smells of goats... what?!? What do goats even smell like?</li>\n<li>How does the Hog's Head stay in business?</li>\n<li>We break down Aberforth's relationship with his goat</li>\n<li>Gryffindor, Ravenclaw, Hufflepuff... The Formation of Dumbledore's Army! Would any of members of Slytherin House worked well?</li>\n<li>Does Hermione not fully consider the consequences of putting Harry in an awkward position?</li>\n<li>From Quirrellmort to the Riddle Graveyard, the hosts rate Harry's accomplishments with O.W.L. grades!</li>\n<li>Zacharias Smith, Luna Lovegood, Ernie MacMillan and more!</li>\n<li>Fudge and Heliopaths? No way! But Luna's observations about Hermione are spot on!</li>\n<li>Would we have signed our names to the Dumbledore's Army parchment?</li>\n<li>Quizzitch: Who visits Harry during History of Magic?</li>\n<li>Join our community at <a href=\"http://www.patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 04 Feb 2020 12:00:00 +0000",
  "guid": "tag:audioboom.com,2020-02-03:/posts/7494631",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}