{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-5695844736625964108",
  "published": "2022-11-03T10:55:00.001-05:00",
  "updated": "2022-11-03T13:22:18.973-05:00",
  "category": [
    "",
    "",
    ""
  ],
  "title": "Academic Freedom Conference",
  "content": "<p>On Friday and Saturday Nov. 4/5, the Stanford GSB Classical Liberalism Initiative will host a two day conference on Academic Freedom. <a href=\"https://cli.stanford.edu/events/conference-symposium/academic-freedom-conference\" target=\"_blank\">Conference website here</a>, and I copy and paste the schedule below. &nbsp;The room is beyond full, so we can't issue more in-person invitations. Because of that and the threat of protests (yes, a loud group at Stanford wants to silence the academic freedom / free speech conference), &nbsp;we will not be able to accommodate walk-ins.&nbsp;</p><p>But the event will be live-streamed. If you want to watch, <a href=\"https://docs.google.com/forms/d/e/1FAIpQLScyQu5pf9LbobfSKtLsNZKNLjgBclFnjwPaJmvgE5WtTB9f3w/viewform\" target=\"_blank\">register here</a> and we'll send you a link.&nbsp;</p><p>This is a separate effort from the <a href=\"https://www.blogger.com/blog/post/edit/582368152716771238/5116837823746666453#\" target=\"_blank\">academic freedom declaration</a> I <a href=\"https://johnhcochrane.blogspot.com/2022/11/academic-freedom-letter.html\" target=\"_blank\">blogged &nbsp;yesterday</a>, though many of the same organizers are involved.&nbsp;</p><p style=\"text-align: center;\"><b>Academic Freedom Conference</b></p><p>Academic freedom, open inquiry, and freedom of speech are under threat as they have not been for decades. Visibly, academics are “canceled,” fired, or subject to lengthy disciplinary proceedings in response to academic writing or public engagement. Less visibly, funding agencies, university bureaucracies, hiring procedures, promotion committees, professional organizations, and journals censor some kinds of research or demand adherence to political causes. Many parts of universities have become politicized or have turned into ideological monocultures, excluding people, ideas, or kinds of work that challenge their orthodoxy. Younger researchers are afraid to speak and write and don’t investigate promising ideas that they fear will endanger their careers.&nbsp;</p><p>The two-day Academic Freedom Conference, arranged by the organizing committee, aims to identify ways to restore academic freedom, open inquiry, and freedom of speech and expression on campus and in the larger culture and restore the open debate required for new knowledge to flourish. The conference will focus on the organizational structures leading to censorship and stifling debate and how to repair them.&nbsp;</p><p><b>Schedule<span></span></b></p><a name='more'></a><p></p><p>Friday, November 4, 2022</p><p>8:20am - 8:30am PDT Opening Remarks: John H. Cochrane</p><p><br /></p><p>8:30am - 9:00am PDT Why it has Gotten Harder to Find the Truth</p><p>Jonathan Haidt Professor, Ethical Leadership at New York University Stern School of Business</p><p><br /></p><p>9:00am - 10:00am PDT Academic Freedom in STEM</p><p>Anna Krylov Professor, Chemistry at University of Southern California</p><p>Luana Maroja Professor, Biology at Williams University</p><p>Mimi St Johns Undergraduate Student, Stanford University=</p><p>Jerry Coyne Professor Emeritus, Biology at University of Chicago</p><p>Moderator: Sergiu Klainerman. Professor of Mathematics, Princeton</p><p><br /></p><p>10:15am - 11:00am PDT Peter Thiel \"The End of the Future\"</p><p>Peter Thiel Partner at Founders Fund</p><p><br /></p><p>11:00am - 12:00pm PDT Academic Freedom: Practical Solutions</p><p>Richard Lowery Associate Professor of Finance · McCombs School of Business</p><p>Dorian Abbot Associate Professor of Geophysical Sciences, University of Chicago</p><p>John Hasnas Professor of Business and Professor of Law (by courtesy) | Executive Director, Georgetown Institute for the Study of Markets and Ethics, Georgetown University</p><p>Peter Arcidiacono William Henry Glasson Professor of Economics, Duke University</p><p>Moderator: Anne Beyer Professor of Accounting, Stanford</p><p><br /></p><p>12:00pm - 2:30pm PDT Lunch: The Radicalization of the Academy</p><p>Lee Jussim Distinguished Professor of Psychology, Rutgers University</p><p><br /></p><p>2:30pm - 3:30pm PDT Are the Humanities Liberal?</p><p>Solveig Gold Thomas W. Smith Postdoctoral Research Associate, Princeton University</p><p>Joseph H. Manson Professor of Anthropology, UCLA</p><p>John Rose Associate Director of The Civil Discourse Project at Duke</p><p>Moderator: Jennifer Burns Professor of History, Stanford</p><p><br /></p><p>3:45pm - 4:45pm PDT The Economics of Academic Freedom</p><p>Niall Ferguson Milbank Family Senior Fellow at the Hoover Institution</p><p>John H. Cochrane Senior Fellow, Hoover Institution, Stanford University</p><p>Tyler Cowen Professor of Economics at George Mason University and at the Center for the Study of Public Choice</p><p>Moderator: Rob Reich Professor of Political Science, Stanford</p><p><br /></p><p>5:00pm - 6:00pm PDT The State of Higher Education: USA, UK, Canada</p><p>John M. Ellis Professor Emeritus of German Literature, University of California, Santa Cruz</p><p>Gad Saad Professor of Marketing, Concordia University (Montreal)</p><p>Eric Kaufmann Professor of Politics, University of London</p><p>Moderator: Ivan Marinovic Professor of Accounting, Stanford</p><p><br /></p><p>Saturday, November 5, 2022</p><p><br /></p><p>8:30am - 9:30am PDT Academic Freedom Applications: Climate Science and Biomedical Sciences</p><p>Noah Diffenbaugh Senior Fellow, Stanford Woods Institute for the Environment</p><p>Bjorn Lomborg Founding Director Copenhagen Consensus</p><p>Jay Bhattacharya Professor of Health Policy, Stanford University</p><p>John Ioannidis Professor of Medicine, Stanford University</p><p>Moderator: John H. Cochrane Senior Fellow, Hoover Institution</p><p><br /></p><p>9:30am - 10:15am PDT The War on the West: a conversation</p><p>Douglas Murray Author and Journalist</p><p>Jordan Peterson Professor of Psychology, University of Toronto (Emeritus)&nbsp;</p><p><br /></p><p>10:45am - 12:00pm PDT Academic Freedom: What Is It and What Is It For?</p><p>Greg Lukianoff President and CEO of the Foundation for Individual Rights and Expression (FIRE)</p><p>Nadine Strossen John Marshall Harlan II Professor of Law, Emerita, New York Law School and Senior Fellow, FIRE (Foundation for Individual Rights and Expression)</p><p>Richard Shweder Harold Higgins Swift Distinguished Service Professor of Human Development, University of Chicago</p><p>Hollis Robbins Dean, College of Humanities, University of Utah</p><p>Moderator: Brandice Cane-Wrone Professor of Political Science and Senior Fellow at the Hoover Institution</p><p><br /></p><p>12:30pm - 2:30pm PDT Lunch: Scott Atlas \"Academia, Science, and Public Health: Will Trust Return?\"</p><p>Scott Atlas Robert Wesson Senior Fellow at the Hoover Institution</p><p><br /></p><p>2:30pm - 3:15pm PDT Rationality and Academic Freedom&nbsp;</p><p>Steven Pinker Johnstone Family Professor in the Department of Psychology at Harvard University</p><p><br /></p><p>3:30pm - 4:30pm PDT Academic Freedom in Law and Legal Education</p><p>Ilya Shapiro Senior Fellow and Director of Constitutional Studies, Manhattan Institute</p><p>Michael McConnell Richard and Frances Mallery Professor and Director of the Constitutional Law Center, Stanford University</p><p>Eugene Volokh Gary T. Schwartz Distinguished Professor of Law, University of California Los Angeles</p><p>Moderator: Jeffrey Zwiebel Professor of Finance, Stanford</p><p><br /></p><p>4:30pm - 5:30pm PDT The Cost of Academic Dissent</p><p>Joshua Katz Senior Fellow American Enterprise Institute</p><p>Frances Widdowson Independent Researcher</p><p>Amy Wax Robert Mundheim Professor of Law, University of Pennsylvania</p><p>Elizabeth Weiss Professor of Anthropology, San Jose State University</p><p>Moderator: Harald Uhlig Professor of Economics, University of Chicago</p><p><br /></p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 8
}