{
  "title": "Episode 136 - Ji Wallace Interview",
  "itunes:episode": 136,
  "itunes:title": "Episode 136 - Ji Wallace Interview",
  "itunes:episodeType": "full",
  "guid": "06bc5dc6-8798-426b-b33e-5f09caa8abb5",
  "link": "https://share.transistor.fm/s/523b4400",
  "description": "<p>Another amazing interview is coming to you today as we speak with our first ever Gymnastics athlete in the legendary Ji Willace to talk about his incredible career! We learn from Ji how the quintessential Aussie activity of jumping on a trampoline in his backyard lead him to becoming one of the most decorated trampoline athletes of the 90s, as well as how watching the 1980 Moscow Olympics harboured an Olympic ambition from him from a very  young age. We also learn about his entire Olympic experience during Sydney, and why qualifying nearly a year out from the games helped him take in more of the unique Olympic atmosphere that was in Australia at the time. Added to this his memories of the night he won silver, why he believes so many people remember his silver win so fondly and just how close he came to becoming an Olympian in another sport, it’s a jumpingly great chat that you won’t want to flippin’ miss! </p>",
  "content:encoded": "<p>Another amazing interview is coming to you today as we speak with our first ever Gymnastics athlete in the legendary Ji Willace to talk about his incredible career! We learn from Ji how the quintessential Aussie activity of jumping on a trampoline in his backyard lead him to becoming one of the most decorated trampoline athletes of the 90s, as well as how watching the 1980 Moscow Olympics harboured an Olympic ambition from him from a very  young age. We also learn about his entire Olympic experience during Sydney, and why qualifying nearly a year out from the games helped him take in more of the unique Olympic atmosphere that was in Australia at the time. Added to this his memories of the night he won silver, why he believes so many people remember his silver win so fondly and just how close he came to becoming an Olympian in another sport, it’s a jumpingly great chat that you won’t want to flippin’ miss! </p>",
  "pubDate": "Fri, 17 Sep 2021 09:00:00 +1000",
  "author": "Ben Waterworth",
  "enclosure": "",
  "itunes:author": "Ben Waterworth",
  "itunes:image": "",
  "itunes:duration": 2436,
  "itunes:summary": "Another amazing interview is coming to you today as we speak with our first ever Gymnastics athlete in the legendary Ji Willace to talk about his incredible career! We learn from Ji how the quintessential Aussie activity of jumping on a trampoline in his backyard lead him to becoming one of the most decorated trampoline athletes of the 90s, as well as how watching the 1980 Moscow Olympics harboured an Olympic ambition from him from a very  young age. We also learn about his entire Olympic experience during Sydney, and why qualifying nearly a year out from the games helped him take in more of the unique Olympic atmosphere that was in Australia at the time. Added to this his memories of the night he won silver, why he believes so many people remember his silver win so fondly and just how close he came to becoming an Olympian in another sport, it’s a jumpingly great chat that you won’t want to flippin’ miss!",
  "itunes:subtitle": "Another amazing interview is coming to you today as we speak with our first ever Gymnastics athlete in the legendary Ji Willace to talk about his incredible career! We learn from Ji how the quintessential Aussie activity of jumping on a trampoline in his",
  "itunes:keywords": "olympics, off the podium, comedy, funny, interview, colin hilding, jarrod loobeek, ben waterworth, olympic games, sport, australia, canada",
  "itunes:explicit": "No"
}