{
  "id": "yt:video:G3ajo2jE1y0",
  "yt:videoId": "G3ajo2jE1y0",
  "yt:channelId": "UCbmNph6atAoGfqLoCL_duAg",
  "title": "Steven Novella, Jay Novella & Bob Novella | The Skeptics' Guide to the Future | Talks at Google",
  "link": "",
  "author": {
    "name": "Talks at Google",
    "uri": "https://www.youtube.com/channel/UCbmNph6atAoGfqLoCL_duAg"
  },
  "published": "2022-10-25T16:00:08+00:00",
  "updated": "2022-11-04T01:12:23+00:00",
  "media:group": {
    "media:title": "Steven Novella, Jay Novella & Bob Novella | The Skeptics' Guide to the Future | Talks at Google",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "From the bestselling authors and hosts of \"The Skeptics' Guide to the Universe\" podcast, Steven Novella, Jay Novella & Bob Novella discuss their book \"The Skeptics' Guide to the Future: What Yesterday's Science and Science Fiction Tell Us About the World of Tomorrow.\" A high-tech roadmap of the future in their beloved voice, cracking open the follies of futurists past and how technology will profoundly change our world, redefining what it means to be human.\n\nGet the book here: https://goo.gle/3xKE1DQ.\n\nOur predictions of the future are a wild fantasy, inextricably linked to our present hopes and fears, biases and ignorance. Whether they be the outlandish leaps predicted in the 1920s, like multi-purpose utility belts with climate control capabilities and planes the size of luxury cruise ships, or the forecasts of the ‘60s, which didn’t anticipate the sexual revolution or women’s liberation, the path to the present is littered with failed predictions and incorrect estimations. The best we can do is try to absorb the lessons from futurism's checkered past, perhaps learning to do a little better.\n\nIn the book, Steven Novella and his co-authors build upon the work of futurists of the past by examining what they got right, what they got wrong, and how they came to those conclusions. By exploring the pitfalls of each era, they give their own speculations about the distant future, transformed by unbelievable technology ranging from genetic manipulation to artificial intelligence and quantum computing. Applying their trademark skepticism, they carefully extrapolate upon each scientific development, leaving no stone unturned as they lay out a vision for the future.\n\nAbout the Panelists\n\nDr. Steven Novella is an academic clinical neurologist at Yale University School of Medicine and is host and producer of \"The Skeptics’ Guide to the Universe\" (SGU). He also co-hosts \"Alpha Quadrant 6,\" a science-fiction review show. He is the author of the bestselling book The Skeptics Guide to the Universe: How to Know What’s Really Real in a World Increasingly Full of Fake. Dr. Novella has made multiple appearances on NPR’s All Things Considered and is a frequent guest on radio talk shows and science podcasts. His television credits include The Dr. Oz Show, 20/20, Inside Edition, The History Channel, The Unexplained on A&E, and Exploring the Unknown among others. When not podcasting, he also authors the popular and award-winning NeuroLogica blog and is senior editor of Science-Based Medicine, an influential medical blog dedicated to issues of science and medicine. Dr. Novella is the founder and president of the New England Skeptical Society, a fellow of the Committee for Skeptical Inquiry (CSI), and founding chairman of the Institute for Science in Medicine.\n\nBob Novella is a co-host of SGU and co-author of The Skeptics Guide to the Universe: How to Know What’s Really Real in a World Increasingly Full of Fake. He also blogs for SGU’s Rogues Gallery. Bob is founder and vice president of the New England Skeptical Society. He has written numerous articles that are widely published in skeptical literature and is a frequent guest on science and technology podcasts.\n\nJay Novella is a co-host of the SGU podcast, Chief Operations Officer at SGU Productions, and co-author of the bestselling book The Skeptics Guide to the Universe: How to Know What’s Really Real in a World Increasingly Full of Fake. Jay serves on the board of directors for the Northeast Conference on Science and Skepticism (NECSS), a yearly conference in its 14th year. He also is a producer and writer for the stage show A Skeptical Extravaganza of Special Significance. In his free time, Jay produces and hosts Alpha Quadrant 6, a science-fiction review show.\n\nModerated by Alan Seales.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}