{
  "title": "WWII history book &#8211; &#8220;Escape from Paris&#8221; (Da Capo, 2019) &#8211; Stephen Harding interview",
  "link": "http://warscholar.org/wwii-history-book-escape-from-paris-da-capo-2019-stephen-harding-interview/",
  "pubDate": "Thu, 17 Oct 2019 01:43:01 +0000",
  "guid": "http://warscholar.org/?p=1012",
  "comments": "http://warscholar.org/wwii-history-book-escape-from-paris-da-capo-2019-stephen-harding-interview/#respond",
  "wfw:commentRss": "http://warscholar.org/wwii-history-book-escape-from-paris-da-capo-2019-stephen-harding-interview/feed/",
  "slash:comments": 0,
  "category": [
    "author",
    "France",
    "Germany",
    "interview",
    "United States",
    "World War II",
    "podcast"
  ],
  "description": "Stephen Harding is currently editor of Military History Magazine. He’s been an Army staff historian, a magazine writer and editor and he’s written numerous popular books on World War II. We talk about his latest book “Escape from Paris” which focuses on three B-17 gunners shot down over France and the young French woman and…",
  "enclosure": "",
  "itunes:subtitle": "Stephen Harding is currently editor of Military History Magazine. He’s been an Army staff historian, a magazine writer and editor and he’s written numerous popular books on World War II. We talk about his latest book “Escape from Paris” which focuses o...",
  "itunes:summary": "Stephen Harding is currently editor of Military History Magazine. He’s been an Army staff historian, a magazine writer and editor and he’s written numerous popular books on World War II. We talk about his latest book “Escape from Paris” which focuses on three B-17 gunners shot down over France and the young French woman and her family who help them evade capture in German-held Paris.<br />\n0:44 &#8211; Stephen talks about how he got into studying and writing on WWII.<br />\n4:47 &#8211; Stephen talks about his book &#8220;Escape from Paris.&#8221;<br />\n10:20 &#8211; Stephen talks about he mixes the big picture and the personal stories in the book.<br />\n11:51 &#8211; Stephen talks about the American aerial gunners he focused on in the book.<br />\n12:54 &#8211; Stephen talks about how this book is similar to his previous books on the real people who fought in WWII.<br />\n14:29 &#8211; Stephen talks about the French Resistance and how many women were involved with it.<br />\n18:34 &#8211; Stephen talks some more about how many women in France were engaged in combat action.<br />\n20:29 &#8211; Stephen talks about what the story of the American gunners involves and how they got shot down.<br />\n24:33 &#8211; Stephen talks about the Hotel Les Invalides.<br />\n25:51 &#8211; Stephen talks about where he went to research the book and what he found.<br />\n30:10 &#8211; Stephen talks about an unusual 11th man on one of the B-17s that was shot down in this story.<br />\n32:34 &#8211; Stephen talks about how the French reacted to his research for this book.<br />\n33:33 &#8211; Stephen talks about some of the interesting documents and photographs he came across in his research.<br />\n39:07 &#8211; Stephen talks about some of the research he did with german documents.<br />\n43:56 &#8211; Stephen can be found at StephenHardingbooks.com and on facebook under Stephen Harding. He&#8217;s also editor of Military History Magazine. Readers can also go to historynet.com.<br />\nLinks of interest<br />\n<a href=\"https://www.dacapopress.com/titles/stephen-harding/escape-from-paris/9780306922145/\">https://www.dacapopress.com/titles/stephen-harding/escape-from-paris/9780306922145/</a><br />\n<a href=\"http://stephenhardingbooks.com/\">http://Stephenhardingbooks.com</a><br />\n<a href=\"https://www.historynet.com/\">https://www.historynet.com/</a><br />\nFor more “Military History Inside Out” please follow me at <a href=\"http://www.warscholar.org/\">www.warscholar.org</a>, on Facebook at <a href=\"https://www.facebook.com/Warscholarorg-Military-History-News-and-Education-115795938127/\">warscholar</a>, on twitter at <a href=\"https://twitter.com/Warscholar\">Warscholar</a>, on youtube at <a href=\"https://www.youtube.com/user/warscholar1945/\">warscholar1945</a> and on Instagram <a href=\"https://www.instagram.com/crisalvarezwarscholar/\">@crisalvarezswarscholar</a><br />\nGuests: Stephen Harding<br />\nHost: Cris Alvarez<br />\nTags: military, history, military history, conflict, war, interview, non-fiction book, infantry, WWII, world war 2, WW2, military journalism, castle itter, paris, france, air force, escape, evasion, england, gunners, French Resistance, abwehr, gestapo, Virginia Hall, OSS, SOE, parachute, napoleon&#8217;s Tomb, aviator, united nations, united states<br />",
  "itunes:author": "Cris Alvarez",
  "itunes:image": "",
  "itunes:explicit": "clean",
  "itunes:duration": "47:03",
  "post-id": 1012
}