{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-3694323826192690902",
  "published": "2020-02-12T09:30:00.000-08:00",
  "updated": "2020-02-12T09:30:07.315-08:00",
  "title": "How black creators are redefining blackness for themselves on YouTube",
  "content": "When the Internet arrived, it brought to the world a buzzy connectivity. People could meet, talk and become friends online. Now, with the majority of young black people spending time in places like YouTube, videos have helped create a digital diaspora. It’s this diaspora that helps us — a people dispersed around the globe — feel like we’re not alone.<br /><br /><br /><br /><br />Here, in this digital space, no one needs to seek another person’s approval for who they are, or what they’re interested in. This has allowed a generation of creators to redefine blackness for themselves. In honor of Black History Month, we’re spotlighting a handful of creators who’ve done just that:<br /><br /><br /><br /><br /><br /><ul><li><a href=\"https://www.youtube.com/watch?v=QhBnZ6NPOY0\" target=\"_blank\">King Vader</a> is a popular black creator known for reinterpreting anime. He uses black actors in a setting that’s more familiar to him and his viewers, such as his neighborhood. His “hood” anime videos (Hood Naruto, Hood Cowboy Bebop) have almost 50 million views. By inserting black actors and cultural indicators into this anime landscape, King Vader creates a black-shared experience within the broader-shared experience of the anime fandom. He’s part of the movement that helped views of videos related to anime more than double in 2019.</li></ul><br /><br /><br /><br /><br /><br /><ul><li>Breakout star, <a href=\"https://www.youtube.com/watch?v=UG8QnjT57UY&amp;t=8s\" target=\"_blank\">Jennelle Eliana</a>, burst onto the YouTube scene last July with her first video from her blue van. Within weeks, she gained over 1.5 million subscribers and became 2019’s sixth, most-subscribed new creator. She’s part of the “van life” trend — a community created by people who have traded in a conventional way of life for life on the road.</li></ul><br /><br /><br /><br /><br /><br /><ul><li>Late last year, two black guys — separated by the Atlantic Ocean — broke all conventions of the type of music a black person is expected to make. Their break-out song, <a href=\"https://www.youtube.com/watch?v=w2Ov5jzm3j8\" target=\"_blank\">“Old Town Road,”</a> went on to become one of the top music videos in the world. (It was #1 in the U.S.) Music is another area where black creators continue to innovate.</li></ul><br /><br /><br /><br /><br />Black creators' interests and experiences put them at the forefront of every trend. The result is a kaleidoscope of blackness, defined by them and for them. They’re telling the world who they are and what they can be. Through their YouTube wins, they helped make 2019 an especially trend-setting and unforgettable one. <br /><br /><br /><br /><br /><i>Earnest Pettie, Trends Insights Lead<br /></i>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}