{
  "itunes:episode": 48,
  "title": "I Am the Camera with Dean Putney",
  "pubDate": "Thu, 7 Nov 2013 15:00:00 +0000",
  "link": "http://newdisrupt.org/blog/2013/11/2/i-am-a-camera-with-dean-putney-episode-48",
  "description": "<p><a href=\"http://deanputney.org/\">Dean Putney</a> has made some of your favorite things on the Internet. He's <a href=\"http://boingboing.net\">Boing Boing</a>'s software developer, as well as filling your mind with <a href=\"http://deansli.st/archives/tag/gif\">the best animated GIFs</a> on the Internet. But what he's working on at the moment takes us over 100 years into the past: <a href=\"http://wwiphotos.tumblr.com/\">a book of photographs</a> his great-grandfather took before World War I, and in the trenches as a German soldier. He recently <a href=\"http://www.kickstarter.com/projects/deanputney/experience-world-war-i-through-a-german-officers-p\">funded the book project on Kickstarter</a>, and shares lessons in publishing and crowdfunding.</p><p> This episode is sponsored by <a href=\"http://www.stackmagazines.com\">Stack</a>. Use coupon code DISRUPT13 for a discount.</p>",
  "guid": "tag:soundcloud,2010:tracks/118942044",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:06:19",
  "itunes:subtitle": "Dean Putney has made some of your favorite things on the Internet.",
  "itunes:summary": "Dean Putney has made some of your favorite things on the Internet. He's Boing Boing's software developer, as well as filling your mind with the best animated GIFs on the Internet. But what he's working on at the moment takes us over 100 years into the past: a book of photographs his great-grandfather took before World War I, and in the trenches as a German soldier. He recently funded the book project on Kickstarter, and shares lessons in publishing and crowdfunding. This episode is sponsored by Stack: www.stackmagazines.com (use coupon code DISRUPT13 for a discount)."
}