{
  "guid": "urn:uuid:ead76501-87ba-4221-8593-ec9c8d17b19b",
  "link": "https://www.who.int/news/item/07-03-2022-eighth-meeting-of-the-multilateral-leaders-task-force-on-covid-19-1-march-2022-third-consultation-with-the-ceos-of-leading-vaccine-manufacturers",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Eighth Meeting of the Multilateral Leaders Task Force on COVID-19, 1 March 2022: \"Third Consultation with the CEOs of leading vaccine manufacturers\"",
  "description": "<p>The heads of the International Monetary Fund, World Bank Group, World Health Organization, and World Trade Organization held high-level consultations with UNICEF, Gavi, the Vaccine Alliance, the Global Lead Coordinator for the COVID-19 Vaccine Country Readiness and Delivery and the CEOs of leading vaccine manufacturers on 1 March 2022 aimed at ensuring the rapid delivery of vaccines to where they are needed the most and putting those vaccines into arms. <br /></p> <p>The Multilateral Leaders Task Force issued the following statement: <br /></p> <p>\"In the past few months, we have seen unprecedented levels of disease transmission across the world due to the Omicron variant. Still, unequal access to COVID-19 vaccines, tests and treatments is rampant, prolonging the pandemic. 23 countries are yet to fully vaccinate 10% of their populations, 73 countries are yet to achieve 40% coverage and many more are projected to miss the 70% target by middle of this year. <br /></p> <p>The biggest challenges are in low-income countries (LICs), which are concentrated in Africa. Only 7% of people in LICs have been fully vaccinated, compared with 73% in high-income countries. Safeguarding the health of people living in the world&rsquo;s poorest countries in the face of a changing pandemic is a key priority. We must and can ensure that these countries have the access, the means, and the capacity to vaccinate their populations, especially those who are most at risk.<br /></p> <p>Despite the challenges, there has been progress. The vaccine supply constraints from last year have eased, and export restrictions are not currently an issue. Our efforts must now focus on supporting countries to increase vaccination rates. There is no \"one-size-fits-all\" approach as each country faces different political, administrative, and capacity challenges. <br /></p> <p>Insufficient health care infrastructure, including warehouses, cold chain capacity; lack of trained vaccinators; complexities associated with the management of multiple vaccines; lack of data systems to support vaccination campaigns; and misinformation and vaccine hesitancy are common hurdles that governments must confront. But we have good lessons to draw on from countries around the world that have managed to overcome obstacles and rollout vaccination campaigns, including from low-income countries. <br /></p> <p>Sustained investment in geographically diversified manufacturing capacity and new technologies for vaccines, therapeutics, and diagnostics is key for ensuring more equitable, affordable, and timely access to tools for developing countries. In this context, we welcome the work of the leading vaccine manufacturers in exploring and undertaking new partnerships and call for them to work closely with international organizations (IOs) and countries to capitalize on practical solutions, sharing licenses, technology and know-how.<br /></p> <p>A top priority to end the pandemic is deploying financing quickly to accelerate the development, production, and equitable access to COVID-19 tests, treatments and vaccines in low- and middle-income countries. Fully funding the Access to COVID-19 Tools (ACT) Accelerator is critical.<br /></p> <p>As vaccine supply increases in 2022, close coordination among all stakeholders will be crucial to aligning supply with demand, reducing supply fragmentation, and deploying vaccines in the most effective way. We must adjust to constantly evolving challenges and keep working together. As the late Dr Paul Farmer said: \"<em>Any</em><em> time there's a new tool developed &ndash; whether they are vaccines or therapeutics &ndash; there must also be a delivery plan.\" </em><br /></p> <p>Let us acknowledge the importance of delivery, as this is where lives are saved, families are kept whole, children continue their education, communities stay strong, and economies grow.\"</p><p>&nbsp;<hr /></p><p><strong>About the Multilateral Leaders Task Force </strong><br /></p> <p>This joint initiative of the International Monetary Fund, World Bank Group, World Health Organization, and World Trade Organization aims to support the roll out of COVID-19 tools by leveraging multilateral finance and trade solutions, particularly for low and middle-income countries. It supports the goals of the ACT-Accelerator and complementary initiatives in the delivery of COVID-19 diagnostics, vaccines, therapeutics, and PPE. </p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
  "pubDate": "Mon, 07 Mar 2022 13:25:00 Z"
}