{
  "id": "yt:video:GlcqYhxNg5Y",
  "yt:videoId": "GlcqYhxNg5Y",
  "yt:channelId": "UCTUtqcDkzw7bisadh6AOx5w",
  "title": "Understanding \"The Middle\"",
  "link": "",
  "author": {
    "name": "12tone",
    "uri": "https://www.youtube.com/channel/UCTUtqcDkzw7bisadh6AOx5w"
  },
  "published": "2022-07-15T17:00:09+00:00",
  "updated": "2022-08-14T09:19:27+00:00",
  "media:group": {
    "media:title": "Understanding \"The Middle\"",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "There's some songs that you never really outgrow, and for me, The Middle is one of those. The relentless optimism of the track feels like a weird match for the dark cynicism of teenagehood in the early 2000s, but the earnest insistence that everything would be alright captured something about that moment in time, and it still resonates with me today. I have no idea how well-known a song it is these days, but for those of us who grew up in that era, it's something we'll probably never forget.\n\nPatreon: https://www.patreon.com/12tonevideos\nMerch: http://standard.tv/12tone\nDiscord: https://discord.gg/pq2QBEw\nFacebook: https://www.facebook.com/12tonevideos\nTwitter: https://twitter.com/12tonevideos\nTwitch: https://www.twitch.tv/12tonevideos\nEmail: 12tonevideos@gmail.com\n\nLast: https://youtu.be/IIqix9CsuUk\n\nScript: https://tinyurl.com/3w7z8z68\n\nHuge thanks to our Elephant Club members:\n\nSusan Jones\nJill Jones\nDuck \nHoward Levine\nBrian Etheredge\nLen Lanphar\nKen Arnold\nElaine Pratt\nWilliam (Bill) Boston\nWarren Huart\nKevin Wilamowski\nGrant Aldonas\nChris Prentice\nJack Carlson\nChristopher Lucas\nAndrew Beals\nDov Zazkis\nHendrik P\nThomas Morley\nJacob Helwig\nDavis Sprague\nBraum Meakes\nKelly Christoffersen\nHendrik Stüwe\nDan Bonelli\nKevin Boyce\nDonal Botkin\nStephen Cook\nLuke\nDavid Bartz\nDhruv Monga\nKen Jones\nObadiah Wright\nCarlos Rendon\nAleksandar Milojković\nKylie McInnes\nJody \nMichael Mol\nPhilRosas \nReiji Kobayashi\nCatherine Berry\nNeil Moore\nKai\n\nAnd thanks as well to Henry Reich, Gabi Ghita, Gene Lushtak, Eugene Bulkin, Owen Campbell-Moore, Logan Jones, Oliver, Anna Work, Adam Neely, Rick Lees, Dave Mayer, CodenaCrow, Arnas, Caroline Simpson, Michael Alan Dorman, Blake Boyd, Charles Gaskell, Ian Seymour, Trevor Sullivan, Tom Evans, JH, David Conrad, Ducky, Todd Davidson, Chris Borland, Jake Lizzio, Elliot Burke, Tim S., Elias Simon, Aaron Epstein, Chris Connett, Jerry D. Brown, Kenneth Kousen, James, h2g2guy, W. Dennis Sorrell, Ohad Lutzky, Peter Leventis, Symmetry, Professor Elliot, James A. Thornton, Andrew Engel, Stefan Strohmaier, Shadow Kat, Adam Wurstmann, Peter Brinkmann, Angela Flierman, Richard T. Anderson, Kevin Johnson, Joshua La Macchia, Rodrigo \"rrc2soft\" Roman, Jeremy Zolner, Patrick Callier, Danny, Francois LaPlante, Volker Wegert, Britt Ratliff, Darzzr, Alex Keeny, John Bejarano, naomio, Alex Mole, Gary Butterfield, Steve Brand, Rene Miklas, Betsy, Tonya Custis, Dave Shapiro, Jacopo Cascioli, Red Uncle, Doug Nottingham, Rafael Martinez Salas, Walther, Nicholas Wolf, Graeme Lewis, Jake Sand, Robert Beach, Jason Nebergall, Mathew Wolak, Jim Hayes, S, Lincoln Mendell, Scott Albertine, Sam Rezek, Destros, Lucas Augusto, ZagOnEm, Evan Satinsky, RaptorCat, רועי סיני, Conor Stuart Roe, Jigglypuffer, leftaroundabout ., Jens Schäfer, Mikely Whiplash, Austin Amberg, Francisco Rodrigues, Dragix PL, Michael Tsuk, Kottolett, Dylan Vidas, ThoraSTooth, Brandon Legawiec, Hikaru Katayamma, Rob Hardy, Patrick Chieppe, Eric Stark, David Haughn, Gordon Dell, Brian Miller, Byron DeLaBarre, Matty Crocker, anemamata, Lee-orr Orbach, Eric Plume, Kevin Pierce, Jon Hancock, Bryn Davis, Pamela O'Neill, Jason Peterson, Peggy Youell, EJ Hambleton, Thomas Morgan, Ludwick Kennedy, Jos Mulder, Daryl Banttari, J.T. Vandenbree, Ridley Kemp, Mark James, John Castle, Adam Ziegenhals, Mark, Amelia Lewis, sonicolasj, Wayne Robinson, Gabriel Totusek, Mnemosyne Music, AkselA, Kristofer Hill, William Merryman, Ryan Mayle, Sam Plotkin, David MacDonald, Nellie Speirs Baron, Charles R., Joshua Lewis, Justin St John-Brooks, type inference, Sam, DialMForManning, Wayne Weil, Joseph Satin, Piush Dahal, Matthew Moore, James, David T Peterson, Bryan C. Mills, Andrew Wyld, XCompWiz, JD White, Michael Blaby, Bean, A Devoted Servant, Milan Brezovsky, Edmund Horner, NinoDoko, M. Bock, Daniel Joseph Moynihan, Joe Johnston, Jordan Friendshuh, Josh Witkowski, Rapid Offensive Unit, Graham Orndorff, Hakim C, Claymore Alexander, Dixon Roberts, Jason McPherson, Chris Robson, A.J. Yates, Matt Moulder, Leander Tietjen, gunnito, Alex Tafur, Chris Davis, findRED, Howl’s one-handed, Gary Backaus, Eugen Lounkine, Fernando Gros, Geoffrey Barnett, OVB_2nd, William, Joe Molloy, Daniel Sim, Chris Breault, RoxyPop, David Wagner, Paul Tanenholz, Lev, Julio D, Douglas Anderson, Foreign Man in a Foreign Land, Vigilance Deadname, Liz Webb, Boomer Dell, Justin Zboyovski, Adam Poata-Smith, J.R. Hyde, A, Christopher Beattie, triskadecaepyon, Abie, Charles Jordan, Kelly Walker, William Christie, and Damien Fuller-Sutherland! Your support helps make 12tone even better!\n\nAlso, thanks to Jareth Arnold!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}