{
  "title": "Pre-election poll shows Democrats failing",
  "link": "https://www.rt.com/news/565909-biden-election-economy-poll/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565909-biden-election-economy-poll/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363f80f20302730c371f458.jpg\" /> Three quarters of US voters believe the economy has entered a recession and a majority are voting Republican in response, a CNN poll found <br/><a href=\"https://www.rt.com/news/565909-biden-election-economy-poll/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>A CNN survey found that voters are pessimistic about the state of the US economy, and don’t trust President Joe Biden’s party to fix it</strong></p>\n            \n                        \n            <p>With the US midterm elections just days away, three quarters of voters are unhappy with the direction the American economy is headed, a new CNN poll found. Economic issues are at the forefront of voters&rsquo; minds, and few trust the Democratic party to lower inflation.</p>\n<p>The survey found that 75% of Americans believe the US economy is in a recession, up from 64% this summer, while 55% are dissatisfied with their own financial situation, and 74% say <em>&ldquo;things in the country are going badly today.&rdquo;</em></p>\n<p>Meanwhile, 51% of likely voters told <a href=\"https://www.cnn.com/2022/11/02/politics/cnn-poll-gop-congressional-election\" target=\"_blank\" rel=\"noopener noreferrer\">CNN</a> that the economy and inflation are the joint top issues as they decide how to cast their ballots on Tuesday. The only other issue to break double figures is abortion, with 15% of voters rating this their number one concern.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/635fb64d85f54079a351479f.jpg\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/news/565657-us-out-of-control-poll/\">Most Americans think US is ‘out of control’ – poll</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>This is bad news for Democrats, as voters who list the economy as their top issue favor Republicans in their House districts by a margin of 71% to 26%. More broadly, 71% of that group favor the GOP to handle inflation, compared to just 18% preferring the Democrats.</p>\n<p>The poll is the latest to paint a dismal pre-election picture for the Democrats, with a Wall Street Journal survey on Tuesday finding that just 19% of voters believe the economy is heading in the right direction. Both polls found Republican candidates leading Democrats in a generic ballot, and Republican voters more enthusiastic than their Democrat counterparts.</p>\n<p>Republican candidates only need to flip five seats to regain control of the House of Representatives, and one seat to retake the Senate. The GOP has focused its messaging on rising gas prices and inflation in recent months, and holds a three-point advantage, according to an average of 17 polls by <a href=\"https://www.realclearpolitics.com/epolls/other/2022-generic-congressional-vote-7361.html\" target=\"_blank\" rel=\"noopener noreferrer\">Real Clear Politics</a>.</p>\n<p>President Biden has not paid attention to the most important problems facing the country, 61% of likely voters told CNN. On Wednesday, in his final major address before the midterms, Biden did not dwell on the economy. Instead, the president claimed that <em>&ldquo;democracy is under threat&rdquo;</em> from Republicans on the ballot, 300 of whom he called <em>&ldquo;election deniers.&rdquo;</em></p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 17:21:18 +0000",
  "dc:creator": "RT"
}