{
  "title": "Here&#8217;s a fun intro lesson on how to read a graph!",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/31/heres-a-fun-intro-lesson-on-how-to-read-a-graph/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/31/heres-a-fun-intro-lesson-on-how-to-read-a-graph/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Mon, 31 Oct 2022 13:11:37 +0000",
  "category": [
    "Statistical graphics",
    "Teaching"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=47210",
  "description": "Paul Alper sent us this fun feature from the New York Times that teaches students how to read a graph. They start with the above scatterplot and then ask a series of questions: What do you notice? What do you &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/31/heres-a-fun-intro-lesson-on-how-to-read-a-graph/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p><img src=\"https://statmodeling.stat.columbia.edu/wp-content/uploads/2022/02/GenerationSurveyGraphLN-jumbo.jpg\" alt=\"\" width=\"450\" /></p>\n<p>Paul Alper sent us <a href=\"https://www.nytimes.com/2022/02/03/learning/whats-going-on-in-this-graph-feb-9-2022.html\">this fun feature</a> from the New York Times that teaches students how to read a graph.</p>\n<p>They start with the above scatterplot and then ask a series of questions:</p>\n<blockquote><p>What do you notice?</p>\n<p>What do you wonder?</p>\n<p>How does this relate to you and your community?</p>\n<p>What’s going on in this graph? Create a catchy headline that captures the graph’s main idea.</p>\n<p>The questions are intended to build on one another, so try to answer them in order.</p></blockquote>\n<p>Then they follow up with some details:</p>\n<blockquote><p>This graph appeared in the Nov. 17, 2021 New York Times Upshot article “<a href=\"https://www.nytimes.com/2021/11/17/upshot/global-survey-optimism.html\">Where Are Young People Most Optimistic? In Poorer Nations</a>.” It displays statistics from an international survey of more than 21,000 people from 21 countries conducted by Gallup for UNICEF. A report entitled “<a href=\"https://www.unicef.org/globalinsight/media/2266/file\">The Changing Childhood Project: A Multigenerational, International Survey of 21st Century Childhood</a>” offers all of the survey’s findings with its 32-question survey and its methodology by country. The survey sample was nationally representative and was conducted by landline and mobile telephone from February to June 2021. The survey’s objective was to find out how childhood is changing in the 21st century, and where divisions are emerging between generations.</p>\n<p>Are the 15- to 24 year olds (youth) more optimistic than 40+ year olds (parents)? Does the difference in optimism vary between the least wealthy and most wealthy countries? How might the degree of political stability, economic opportunity, climate change and the Covid pandemic affect the youths’ and parents’ responses? Which countries’ statistics surprise you? What do you think about the statistics for the United States?</p></blockquote>\n<p>And:</p>\n<blockquote><p>Here are some of the student headlines that capture the stories of these charts: “The Opposing Futures in the Eyes of Different Generations” by Helena of Pewaukee High School and “The Ages of Optimism” by Zoe, both from Wisconsin; “Is Each Generation Making the World Better?” by Maggie of Academy of Saint Elizabeth in Morristown, N.J. and “Generation Battle: Is the World Getting Better or Worse?” by Taim of Gladeville Middle School in Mt. Juliet, Tenn.</p></blockquote>\n<p>Cool!  I really like the idea of teaching statistical ideas using recent news.</p>\n<p>And it seems they do this every week or two.  Here&#8217;s the next one that came up:</p>\n<p><img src=\"https://statmodeling.stat.columbia.edu/wp-content/uploads/2022/02/WeddingsGraphLN-superJumbo-v2-1024x522.png\" alt=\"\" width=\"450\" /></p>\n<p>Since they&#8217;re doing it as a bar graph anyway, I guess they could have the y-axis go all the way down to zero.  Also, hey, let&#8217;s see the time series of divorces too!</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/31/heres-a-fun-intro-lesson-on-how-to-read-a-graph/feed/",
  "slash:comments": 6
}