{
  "title": "Clausewitz, the UN Charter, and a Libertarian View on War",
  "link": "https://mises.org/node/60672",
  "description": "<p>The ongoing war in Ukraine has forced many Westerners to consider the realism of Carl von Clausewitz’s classic <em>On War.</em> The Prussian military theorist famously <a href=\"https://thediplomat.com/2014/11/everything-you-know-about-clausewitz-is-wrong/\">wrote</a> that: “War is nothing but a continuation of politics with the admixture of other means.” Though this observation may seem strange or even shocking to modern Western ears, it is the role war has mostly had throughout history.</p>\n<p>Clausewitz served in the Russian army in 1812 and his influence in Russia is felt to this day. Indeed, Russia’s approach to the war in Ukraine has the <a href=\"https://smallwarsjournal.com/jrnl/art/putin-clausewitz-and-ukraine\">imprint of Clausewitz</a> in the sense that it sees military action <a href=\"https://oll.libertyfund.org/page/clausewitz-war-as-politics-by-other-means\">as a political instrument</a>, along with other such instruments, such as diplomatic and economic ones.</p>\n<p>This helps to explain why Russia has been somewhat misunderstood in Western political and intellectual circles as the current crisis has escalated. Since the end of the Cold War, Western elites have come to equate war with the particular military doctrine of the United States, for which war only starts where politics ends, or even worse: when war of aggression is the <em>preferred</em> means to reach political and commercial ends, often at the exclusion of any good faith diplomacy.</p>\n<p>Washington’s wars in the Middle East are typical examples of this. The official objectives of these wars, such as “spreading democracy,” have never really been achieved. Instead, the Military-industrial complex has profited massively from these wars, which strongly suggests that the real military goals of the US government are not the official ones.</p>\n<p>For Clausewitz, writing in a time when crony capitalism hardly existed, there is a fundamental interest in avoiding war, because war harms all parties directly involved. Thus, in this light, war should always be the last resort employed by states when trying to reach political goals, not only because of the loss of life and the destruction of property that war entails, but also because of the uncertainty of war for all involved. As the old saying goes, it is easy to start a war, but difficult to end it.</p>\n<p>When war does erupt, it is thus often the result of one side’s error of judgment with regard to its own and its opponent’s capabilities and intentions. As the historian Carroll Quigley wrote in his magnum opus, <em>Tragedy and Hope</em>: “This is the chief function of war: to demonstrate as conclusively as possible to mistaken minds that they are mistaken in regard to power relationships.<em>”</em></p>\n<p><strong>The Lack of Relevance of the UN</strong></p>\n<p>Typically for a nineteenth-century thinker, Clausewitz accepted the possibility for war to solve political problems, in a way modern international law does not. However, his view of war seems more respectful of the United Nations Charter than the aggressive military doctrine practiced by some of its Western signatories. Indeed, the United Nation’s Security Council’s past decisions to allow military intervention have often not met even the Clausewitz rationale for war; namely, the exhaustion of all other means of issue resolution.</p>\n<p>UN Security Council (UNSC) authorizations that since 1945 have allowed some member States to use force against other members often have had underlying interests other than the stated one of “restoring international peace.” Predictably, the results of many of these UN sanctioned military interventions have generally been disastrous; often exacerbating conflicts and leading to the dramatic suffering of the civilian populations. In North Korea 1950, in South Vietnam in 1966, in Kuwait in 1990, and in Libya in 2011, the US interventions made a mockery of the UN’s ideal of peace.</p>\n<p>Even worse, the UN Charter and the legal legitimacy of the UNSC have simply been disregarded by the US government in Serbia in 1999 and Iraq in 2003, setting a dangerous precedent. Today, of the permanent five veto-wielding members of the UNSC, three of them are now adversaries of the other two, and this is preventing the UNSC from making any significant contribution toward restoring peace.</p>\n<p>What kept the peace, at least in Europe, between the two geostrategic and ideological Cold War rivals was arguably more the nuclear deterrence than the existence of the UN Charter, even though the USA and the USSR did several times <a href=\"https://en.wikipedia.org/wiki/List_of_nuclear_close_calls\">come close</a> to using nuclear weapons.</p>\n<p>The UN’s role in enforcing international law is therefore today almost nonexistent. The absence of the UN in helping solve the current conflict between Russia and NATO is glaring. The UN Charter is thus simply a legal framework that works—de facto, not de jure—only as long as all of its most powerful members adhere to it in both spirit and letter. In reality, international relations between nation-states are still to a large extent power relationship, as in the days of Clausewitz.</p>\n<p><strong>Realism in War Complemented by Libertarianism</strong></p>\n<p>The view of modern war presented above, however realist in its outlook, does not consider the cause of war in the first place. It seems inevitable that this requires a focus on the role of the modern state as the instigator of all wars. Therefore, however insightful Clausewitz’s commentary on war, it should be complemented by a theory of the modern state.</p>\n<p>Libertarianism is perfectly placed for this task, since it identifies the state as the cause of most of society’s artificially created ills. As a political philosophy based on natural right, libertarianism cannot morally accept a war waged by the state, even if an entirely defensive one (if there is such a thing). The state, by its very definition, violates the nonaggression principle by its monopoly of violence on a given territory.</p>\n<p>In practice, however, even a libertarian would have to prefer the case of a state’s noninterested protection of private property in a defensive war against an external enemy, to the alternative of an externally imposed tyranny. Yet, the real world rarely reoffers such clear choices.</p>\n<p>Free trade, i.e., is trade completely unobstructed by national or supranational states, is the main driver for peace between nations. Open, trading nations have an interest in peaceful relations with other each other and are therefore naturally averse to war. Protectionism and the tendency toward autarky are both causes and consequences of fraught relations between states that can lead to military conflict. This is not surprising, since the stakes of the state in society, through its intervention in the economy, introduces a logic of competition against other nation-states.</p>\n<p>Indeed, peace and prosperity in any society is inversely correlated to the size and strength of the state. In a world composed of nation-states, this leads to the conclusion that is in complete opposition to <a href=\"https://mises.org/wire/difference-between-good-globalism-and-bad-globalism\">political globalism</a>; namely, that there should be as many of states as possible—why not down to the municipal level—so as to render each one as weak and limited as possible.</p>\n<p>The concepts of <a href=\"https://mises.org/wire/secession-and-small-states\">secession</a> and <a href=\"https://mises.org/library/self-determination-and-secession\">self-determination</a> is therefore key for libertarians in order for the number of states to multiply. War becomes less likely the smaller and the less powerful states are, and the more similar to each other they are in size. The current times have shown the danger of states becoming so large as to have geopolitical interests; in the case of the USA, spanning the entire world.</p>\n<p>In conclusion, it should be clear that is no contradiction between having a realist view of the world and at the same time one based on political principles. Having a realist view of international relations, as those presented here, does not preclude also recognizing the importance of the libertarian principles regarding war and the state. Indeed, only when the people start massively rejecting the interventions of their state abroad as well as domestically will the possibility for peace between states appear.</p>\n\n",
  "author": "Finn Andreen",
  "enclosure": "",
  "guid": 60672,
  "pubDate": "Tue, 01 Nov 2022 11:00:00 -0500",
  "source": "Mises Wire"
}