{
  "id": "yt:video:lblK3tdRnew",
  "yt:videoId": "lblK3tdRnew",
  "yt:channelId": "UCddem5RlB3bQe99wyY49g0g",
  "title": "1972 R.A.C. RALLY RACE   WALES RALLY GB  KLEBER RADIAL TIRES PROMO FILM  96134",
  "link": "",
  "author": {
    "name": "PeriscopeFilm",
    "uri": "https://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g"
  },
  "published": "2022-11-03T19:29:47+00:00",
  "updated": "2022-11-03T19:29:48+00:00",
  "media:group": {
    "media:title": "1972 R.A.C. RALLY RACE   WALES RALLY GB  KLEBER RADIAL TIRES PROMO FILM  96134",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g/join\n\nWant to learn more about Periscope Film and get access to exclusive swag? Join us on Patreon. Visit https://www.patreon.com/PeriscopeFilm\nVisit our website www.PeriscopeFilm.com\n\nThis promotional film for Kleber Radial Tires covers the Daily Mirror R.A.C. Rally in 1972 with three different race tracks in Wales, England, and Scotland during three days of rallying. The film is directed and edited by Brian Llewelyn and produced by Barrie Hinchliffe, who also worked cameras with Keith Taylor and Bill Marshall.  This race was initiated in 1932, and later known as the Wales Rally GB, and was the largest and most high-profile motor rally in the United Kingdom. It was a round of the FIA World Rally Championship until 2019 and was also formerly a round of the MSA British Rally Championship. Up until 1997 it was known as the RAC Rally until adopting its current name in 2003 (except in 2009 when it was called the Rally of Great Britain).\n\nThe film begins with branches filmed up-close (00:08), and the camera zooms out to reveal a campsite (00:18). Two people are sitting in a rally car, and they drive (00:19). A man presents the Daily Mirror R.A.C. Rally to the camera (00:29). The rally cars are parked inside an enclosure, while mechanics perform service on the cars (00:50). One rally car drives down a ramp onto the racetrack with onlookers along the sides (02:22). The rally cars are speeding through muddy tracks (02:37). Car nr. 43 is stuck in the mud, and Ncrowd members rush to assist in releasing (03:14). The car is freed and continues rallying (03:43). Mechanics are changing tires and checking engines (05:20). A scoreboard shows the leading positions with Roger Clark and Tony Mason in the first place, driving a Ford Escort RS 1600 MKI (05:52). It is dark early morning at Severn Bridge, and the drivers make payments before driving across (06:07). Mechanics, racers, and bystanders are gathered around the track in preparation for the second race (06:46). Racers are interviewed about the weather conditions and the extremely muddy racetrack (07:38). Shifting scenery-footage of a tall stone beam with a statue and a large castle, interceded by footage from the cars rallying, dramatized with classical music (09:47). A race begins at morning-time at Yorkshire Moors National Park in England (15:30). A car has been dented heavily from the front and is towed away (19:37). A man is interviewed about the conditions of the mud-covered track (19:58). Drivers are getting ready inside their car (21:01), and they drive away in darkness (22:04). An assistant is wiping the soles clean on a driver’s shoes before entering the car (23:54). At Dalbeattie Forest in Scotland (24:37). A scoreboard shows the rankings with Roger Clark and Tony Mason continuously in the lead (24:43). Gas tanks are being filled and car tires are changes in preparation for the final race (24:46). Mechanics are working below the cars to ensure safety and functionality (25:30). Strong winds are blowing through the trees and on  bystanders (27:22). The race has begun, and the cars are rallying in the muddy track (27:36). Roger Clark and Tony Mason has won, and they pop champagne to drink and spray on each other in celebration of their victory (31:00). Stig Blomqvist and Arne Hertz finish in second place, driving a Saab 96 V4 (31:36). Third place goes to Anders Kulläng and Donald Karlsson in an Opel Ascona 1.9 SR (31:56). The checkered flag is waved at the last car cross the finish line, driven by Tony Fall and Wood Mike in a Datsun 240Z (32:39). \n\nThe film is a United Motion Picture production presented by “Kleber Radial Tyres” with assistance from Cibie, Ferodo LTD., W.D., and H.O. Wills, and Ford Motor Company LTD. With sound by John Hayes, Paul Corfield, and Martin Sawyer, Dubbing by Roger Goodall, Aerial camera by Bob Lomas, and Alan Ross as 2nd unit director, the newsreel aired in 1972. Howard Everitt was assistant editor and Roger Edmunds was production assistant. \n\nWe encourage viewers to add comments and, especially, to provide additional information about our videos by adding a comment!  See something interesting?  Tell people what it is and what they can see by writing something for example: \"01:00:12:00 -- President Roosevelt is seen meeting with Winston Churchill at the Quebec Conference.\"\n\nThis film is part of the Periscope Film LLC archive, one of the largest historic military, transportation, and aviation stock footage collections in the USA. Entirely film backed, this material is available for licensing in 24p HD, 2k and 4k. For more information visit http://www.PeriscopeFilm.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}