{
  "id": "yt:video:kBNNFgSLf0E",
  "yt:videoId": "kBNNFgSLf0E",
  "yt:channelId": "UCAsLjyYl9GW66G1mpMzr8IA",
  "title": "I'm Stuck With My Crush For 2 Weeks | Childhood Sweethearts Ep.5",
  "link": "",
  "author": {
    "name": "MinuteVideos",
    "uri": "https://www.youtube.com/channel/UCAsLjyYl9GW66G1mpMzr8IA"
  },
  "published": "2021-06-16T23:45:09+00:00",
  "updated": "2022-06-10T16:17:53+00:00",
  "media:group": {
    "media:title": "I'm Stuck With My Crush For 2 Weeks | Childhood Sweethearts Ep.5",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Hi guys! Thank you for supporting our channel and our series Childhood sweethearts! As you all know, we have had to censor a lot of our content to comply with Youtube's policies. This means that many of the super romantic parts of Childhood Sweethearts have been edited out to make it family-friendly.\n\n However! We are so excited to announce that soon we will be moving our content to REBL, which is a new animation platform where we won’t have to censor our content like Childhood Sweethearts anymore!\n\nREBL as the name implies will be different because there will be full content freedom, no ads, no clickbait, instead you will follow human curators to discover series you’ll love. \n\nREBL is about to launch in the coming week, meaning you'll be able to watch and create uncensored content on a new creative platform. Make sure to check out our REBL Kickstarter page and to reserve one of the limited packages before it's too late!\n--------------------------------------------------------------------------------------------\nChildhood Sweethearts a fictional series based on Lauren Jackson's (LaurenJ22), the award-winning Wattpad author of the book,' Childhood Sweethearts' now as an animation series. We hope you enjoy this series as much as we did! Please let us know what cha think and if you are #TeamAiden or #TeamCarter in the comments! :)\n\nIf you loved it and want to see episode 6, please use the hashtag in the comments: \n\n#ChildhoodSweethearts \n\nFollow The Author: \n\nInstagram: laurenj_22 or https://www.instagram.com/laurenj_22/ \n\nWattpad: https://www.wattpad.com/user/LaurenJ22\n\nTikTok: https://vm.tiktok.com/w3UVhH/\n\nFollow The Artist: chulee.kob 💕",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}