{
  "id": "yt:video:tapgQNcKuFo",
  "yt:videoId": "tapgQNcKuFo",
  "yt:channelId": "UCdZcGRaBV-VRRyU4t6Ur0mw",
  "title": "Interview with Sali Tagliamonte",
  "link": "",
  "author": {
    "name": "The Ling Space",
    "uri": "https://www.youtube.com/channel/UCdZcGRaBV-VRRyU4t6Ur0mw"
  },
  "published": "2017-05-11T15:45:23+00:00",
  "updated": "2022-11-02T18:06:22+00:00",
  "media:group": {
    "media:title": "Interview with Sali Tagliamonte",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "We're really excited to have gotten to interview Sali Tagliamonte at the Linguistic Society of America meeting in January! Dr. Tagliamonte is a full professor at the University of Toronto, and a Fellow of the Royal Society of Canada. She's written a bunch of books and articles about sociolinguistics, and how languages shift and vary over time. You can find out more about her and her work at http://individual.utoronto.ca/tagliamonte/\n\nIn our interview, we discussed the following topics:\n- why it's so important to investigate how teens use language, and what facets of adolescent speech she finds most interesting\n- what differences we can find in spoken vs. online language use\n- the Toronto English Project, and the changes we see in people's language use over the course of their lives\n- how language might look in the future\n- how to better inform people about how language variation works\n- the role of social media in telling people about linguistics, and in language change\n\n... and more! Thanks again to Dr. Tagliamonte for speaking with us.\n\nHer most recent book, Teen Talk: The Language of Adolescents, can be found here: http://www.indiebound.org/book/9781107676176\n\nOur previous interviews:\nAnne Charity Hudley: https://youtu.be/xKjrnrsiKv4\nLisa Pearl: https://youtu.be/EOfGgqPeeC4\nDaniel Dennett: https://youtu.be/30eOI6pL-lU\nSteven Pinker: https://youtu.be/piJBmPh5jFU\n\nA couple of videos related to this interview:\nLinguistic Pride and Prejudice: Sociolinguistics, Languages, and Dialects - https://youtu.be/uEabSWeO02E\nWord Crimes and Misdemeanors: Linguistic Descriptivism vs. Prescriptivism - https://youtu.be/eFlBwBwL_iU\n\nFind us on all the social media worlds:\nTumblr: http://thelingspace.tumblr.com/\nTwitter: http://twitter.com/TheLingSpace\nFacebook: http://www.facebook.com/thelingspace/\n\nAnd at our website, http://www.thelingspace.com/ !\nYou can also find our store at the website, http://thelingspace.storenvy.com/\n\nWe also have forums to discuss this interview, and linguistics more generally.\n\nLooking forward to next time!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}