{
  "id": "yt:video:URie0k2JG5c",
  "yt:videoId": "URie0k2JG5c",
  "yt:channelId": "UC5miyvhPsWWyfTulnJ43koQ",
  "title": "THI Theoretical Bounce to Mainland using 2 Goombas and Koopa",
  "link": "",
  "author": {
    "name": "UncommentatedPannen",
    "uri": "https://www.youtube.com/channel/UC5miyvhPsWWyfTulnJ43koQ"
  },
  "published": "2022-10-16T21:03:55+00:00",
  "updated": "2022-10-16T21:03:55+00:00",
  "media:group": {
    "media:title": "THI Theoretical Bounce to Mainland using 2 Goombas and Koopa",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "I show a theoretical maneuver that would allow for faster 0xA access to the THI mainland. This involves bouncing on 2 tiny goombas and the tiny koopa as they're falling, which lets us get onto the item block. And from there, we can rollout onto the mainland. However, the critical issue is that 2 of the enemies don't naturally walk to these positions, and so it's unclear if we could achieve this setup in practice (I used hacks to set up the initial positions in this video). Though with the discovery of the goomba escort, we can't exactly rule it impossible.\n\nThis is a follow-up to my previous video that also looked into this idea (https://youtu.be/6tebqdCd1kE). In that video, I demonstrated that 2 goomba bounces would let us get onto the item block using a misalignment. However, an issue with that plan was that the misalignment corner of the item block is on the opposite side from the cliff, and so we can't really reach it from bouncing on enemies that fall straight down from the cliff. This newest video solves that problem by adding a third bounce from the koopa, that way we can get onto the item block from any side.\n\nNote that getting all 3 enemies to fall off (and with good timings) was incredibly difficult. It took hours to get, and that's with just hacking them to be at ideal locations. Getting this level of precision without hacks AND factoring in that the enemies don't naturally walk to these positions means getting this in practice would be insanely difficult.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}