{
  "title": "Bull vs. Bear: Best Buy",
  "itunes:title": "Bull vs. Bear: Best Buy",
  "pubDate": "Wed, 06 Apr 2022 20:00:42 +0000",
  "guid": "79b40472-61a5-42a4-b462-eeefb900648c",
  "link": "https://fool.libsyn.com/bull-vs-bear-best-buy",
  "itunes:image": "",
  "description": "<p><em>(00:22)</em> Acquisition battles are heating up as travel season kicks off. Asit Sharma joins Deidre Woollard to discuss:<br /> <br /> - JetBlue’s competition with Spirit to buy Frontier Airlines.</p> <p>- Amazon’s plan to launch 3,000 satellites into orbit for its broadband internet plans.<br /> - Restaurants in the metaverse.<br /> <br /> Jim Gillies and Brian Feroldi take a “Bull vs. Bear” approach to investing in Best Buy, <em>(18:56)</em> the company that was supposed to become Amazon’s showroom. You can decide who made the better argument @MotleyFoolMoney on Twitter.</p> <p> </p> <p>Link: Metaverse Stocks -  <a href= \"https://www.fool.com/investing/stock-market/market-sectors/information-technology/metaverse-stocks/\">https://www.fool.com/investing/stock-market/market-sectors/information-technology/metaverse-stocks/</a></p> <p><br /> Stocks: JBLU, SAVE, ULCC, AMZN, NKE, RBLX, CMG, BBY<br /> <br /> Host: Deidre Woollard<br /> Guests: Asit Sharma, Brian Feroldi, Jim Gillies<br /> Producer: Ricky Mulvey<br /> Engineers: Tim Sparks, Rick Engdahl</p>",
  "content:encoded": "<p><em>(00:22)</em> Acquisition battles are heating up as travel season kicks off. Asit Sharma joins Deidre Woollard to discuss:  - JetBlue’s competition with Spirit to buy Frontier Airlines.</p> <p>- Amazon’s plan to launch 3,000 satellites into orbit for its broadband internet plans. - Restaurants in the metaverse.  Jim Gillies and Brian Feroldi take a “Bull vs. Bear” approach to investing in Best Buy, <em>(18:56)</em> the company that was supposed to become Amazon’s showroom. You can decide who made the better argument @MotleyFoolMoney on Twitter.</p> <p> </p> <p>Link: Metaverse Stocks -  <a href= \"https://www.fool.com/investing/stock-market/market-sectors/information-technology/metaverse-stocks/\">https://www.fool.com/investing/stock-market/market-sectors/information-technology/metaverse-stocks/</a></p> <p> Stocks: JBLU, SAVE, ULCC, AMZN, NKE, RBLX, CMG, BBY  Host: Deidre Woollard Guests: Asit Sharma, Brian Feroldi, Jim Gillies Producer: Ricky Mulvey Engineers: Tim Sparks, Rick Engdahl</p>",
  "enclosure": "",
  "itunes:duration": "29:51",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "(00:22) Acquisition battles are heating up as travel season kicks off. Asit Sharma joins Deidre Woollard to discuss:  - JetBlue’s competition with Spirit to buy Frontier Airlines. - Amazon’s plan to launch 3,000 satellites into orbit for its...",
  "itunes:episodeType": "full"
}