{
  "title": "Phases of Behavior Change",
  "itunes:title": "Phases of Behavior Change",
  "pubDate": "Fri, 23 Sep 2022 07:00:31 +0000",
  "guid": "740d7e85-cf16-4b8c-9f6c-6202907c0d93",
  "link": "http://NoBSFreeCourse.com",
  "itunes:image": "",
  "description": "<p>Do you listen to the podcast but things don't \"click\" 100%?<br /> <br /> That's NORMAL and in today's podcast, I'll tell you why.<br /> <br /> You see, there are 4 phases to behavior change and podcast listeners often get stuck.<br /> <br /> Everything you hear sounds great. Seems so simple. You probably even think this shit makes so much sense.<br /> <br /> And yet when you go to do it, things don't go perfect.<br /> <br /> It feels frustrating to hear something so easy like wait until you're hungry to eat...<br /> <br /> But find yourself in the middle of a cookie realizing you forgot to ask Am I hungry?<br /> <br /> P.S. Join me for a special workshop that I typically only offer to my No BS private members. The Weightloss Jumpstart is a full day taking care of you while learning how to lose weight easily. It's only $19 and I promise, you don't want to miss it.<br /> <br /> Register at <a href= \"http://Losing100Podcast.com/jumpstart\">Losing100Podcast.com/jumpstart</a>. The workshop is September 25, 9am - 3:30pm CST, and in the comfort of your own home.<br /> <br /> P.P.S. Can't attend live? Buy the workshop and you'll get the replay for life.</p>",
  "content:encoded": "<p>Do you listen to the podcast but things don't \"click\" 100%?  That's NORMAL and in today's podcast, I'll tell you why.  You see, there are 4 phases to behavior change and podcast listeners often get stuck.  Everything you hear sounds great. Seems so simple. You probably even think this shit makes so much sense.  And yet when you go to do it, things don't go perfect.  It feels frustrating to hear something so easy like wait until you're hungry to eat...  But find yourself in the middle of a cookie realizing you forgot to ask Am I hungry?  P.S. Join me for a special workshop that I typically only offer to my No BS private members. The Weightloss Jumpstart is a full day taking care of you while learning how to lose weight easily. It's only $19 and I promise, you don't want to miss it.  Register at <a href= \"http://Losing100Podcast.com/jumpstart\">Losing100Podcast.com/jumpstart</a>. The workshop is September 25, 9am - 3:30pm CST, and in the comfort of your own home.  P.P.S. Can't attend live? Buy the workshop and you'll get the replay for life.</p>",
  "enclosure": "",
  "itunes:duration": "01:06:29",
  "itunes:explicit": true,
  "itunes:keywords": "",
  "itunes:subtitle": "Do you listen to the podcast but things don't \"click\" 100%?  That's NORMAL and in today's podcast, I'll tell you why.  You see, there are 4 phases to behavior change and podcast listeners often get stuck.  Everything you hear sounds great. Seems so...",
  "itunes:episode": 286,
  "itunes:episodeType": "full"
}