{
  "title": "140: Talk Show Murder (Trial By Media Ep. 1)",
  "link": "https://audioboom.com/posts/7631802",
  "itunes:episode": 140,
  "itunes:title": "Talk Show Murder (Trial By Media Ep. 1)",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 3281,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Two words: Jenny Jones.<br>\n<br>\nOn March 6, 1995, Scott Amadure and Jonathan Schmitz went on the Jenny Jones show. On the show, Scott revealed to Jonathan that he had a crush on him. Jonathan, seemed to take it in stride. But three days later, he bought a gun, drove to Scott's home, and murdered him in broad daylight. What happened? Who is responsible? Was Johnathan pushed to a breaking point by his friend's crush? And how much responsibility does the Jenny Jones show bear?<br>\n<br>\n<strong>Our next episode, \"The Subway Vigilante\", </strong><a href=\"https://www.patreon.com/TrueCrimeObsessed\"><strong>is available right now and ad-free at the $5 level on Patreon! </strong></a><strong>THE FILM IS DIRECTED BY SKYE BORGMAN, DIRECTOR OF \"ABDUCTED IN PLAIN SIGHT\" and tells the story of a white man in 1984 who shot four black teenagers on the New York City Subway. He claimed self defense, but it quickly became clear that there was much more to the story. </strong><a href=\"https://www.patreon.com/TrueCrimeObsessed\"><strong>GET IT NOW!</strong></a><strong> Next week, this patreon episode will be moved to the $10 ad-free tier.<br>\n</strong><br>\n<a href=\"https://www.disappearedpod.com/\">FAM! WE LAUNCHED A NEW PODCAST</a>! <strong>\"Obsessed With: Disappeared.\"</strong> It's a true crime / comedy podcast hosted by Patrick Hinds and Ellyn Marsh--best friends of 20 years. Going in order, Patrick and Ellyn recap episodes of ID's \"Disappeared.\"  Episodes are live now! Be sure to check out our episode covering <a href=\"https://www.disappearedpod.com/episodes/episode/50959f8d/6-the-disappearance-of-maura-murray-s1-e6\">the disappearance of Maura Murray</a> <a href=\"https://www.disappearedpod.com/episodes/episode/50a1423d/an-interview-with-julie-murray-maura-murrays-sister\"><strong>AND PATRICK'S IN-DEPTH INTERVIEW WITH MAURA'S SISTER, JULIE MURRAY!</strong></a><strong><br>\n<br>\nLOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions</div>\n<div>\n<br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 14 Jul 2020 11:03:40 +0000",
  "guid": "tag:audioboom.com,2020-07-14:/posts/7631802",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}