{
  "title": "Episode 121: &#8220;The Leader of the Pack&#8221; by the Shangri-Las",
  "link": "https://500songs.com/podcast/episode-121-the-leader-of-the-pack-by-the-shangri-las/",
  "pubDate": "Thu, 06 May 2021 00:11:02 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=746",
  "description": "<p>Episode one hundred and twenty-one of <em>A History of Rock Music in Five Hundred Songs</em> looks at “The Leader of the Pack\", the rise and fall of Red Bird Records, and the end of the death disc trend. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/50916475\">on \"California Sun\" by the Rivieras</a>.</p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Resources</strong></p>\n<p>As usual, I’ve created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-121-the-leader-of-the-pack/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.</p>\n<p>I used a different Shangri-Las compilation for this episode, but&nbsp;<a href=\"https://amzn.to/3tpBfPv\"><em>Myrmidons of Melodrama</em></a> is generally considered the best collection of their work, and while it's been out of print for a while it's coincidentally getting reissued tomorrow.</p>\n<p>Two of my major sources for this episode were actually the liner notes for two CDs I used --&nbsp;<a href=\"https://amzn.to/3b3hEhE\"><em>Sophisticated Boom-Boom: The Shadow Morton Story</em></a> contains a good selection of Morton's work (though oddly not \"Leader of the Pack\", his single most famous record), while&nbsp;<a href=\"https://amzn.to/2PQXuA2\"><em>The Red Bird Story&nbsp;</em></a>is an excellent three-CD set of the best work put out on the label and its subsidiaries.</p>\n<p><a href=\"https://amzn.to/2SY9jkw\">Hound Dog: The Leiber and Stoller Autobiography</a> by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller’s side of the story well, while I cross-checked their telling of the story of the meeting that ended Red Bird with&nbsp;<a href=\"https://amzn.to/2PRO6w3\"><em>The Last Sultan: The Life and Times of Ahmet Ertegun</em> by Robert Greenfield.</a></p>\n<p>And most of the biographical information about the group came from <a href=\"https://research-repository.uwa.edu.au/en/publications/dressed-in-black-the-shangri-las-and-their-recorded-legacy\">this thesis</a>.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>Today we're going to look at one of the great death discs of all time -- a record that was the epitome of the genre, and one that rendered it more or less defunct, because nothing was ever going to top that record. We're also going to look at the career of a group that are often called the quintessential girl group, but who despised the term, and at how the Mafia shut down a great record label. We're going to look at \"Leader of the Pack\" by the Shangri-Las:</p>\n<p>[Excerpt: The Shangri-Las, \"Leader of the Pack\"]</p>\n<p>To tell the story of the Shangri-Las, we need to return for the last time to Leiber and Stoller. After their time at Atlantic, working with the Drifters and the Coasters, the duo had had a falling out with the Ertegun brothers and Jerry Wexler over what they considered to be unpaid royalties, and spent a couple of years less successfully working at United Artists, but they'd got the urge to start up their own label again, like the one they'd run in the fifties, Spark Records. Their main reason for doing this was financial -- while they'd produced most of the hit records they'd written, the only actual money they made from any of them came from the songwriting royalties they got, which came to about two cents per record, split between them. As Leiber put it, \"After a while, we got to thinking, why should we settle for two cents when we could have our own record and get twenty-one cents?\"</p>\n<p>They started a label called Tiger Records, and their first release was by Tippie and the Clovers -- one of two groups that had formed around ex-members of the classic doo-wop group the Clovers when they'd split a couple of years earlier. Leiber and Stoller wrote and produced it, but the record went nowhere:</p>\n<p>[Excerpt: Tippie and the Clovers, \"Bossa Nova Baby\"]</p>\n<p>The record wasn't a dead loss though -- a couple of months afterwards, Elvis recorded a soundalike cover version. Elvis wasn't allowed to work directly with Leiber and Stoller any more, because Colonel Parker saw them as a threat to his domination of Elvis, but he still liked their material and would record it. Elvis' version featured in the film Fun In Acapulco, and made the top twenty:</p>\n<p>[Excerpt: Elvis Presley, \"Bossa Nova Baby\"]</p>\n<p>So they were still making hits, but still making only their two cents a record -- less, actually, because Elvis always took a cut of any song he recorded.</p>\n<p>After Tippie and the Clovers' record flopped, Leiber and Stoller put their label on hold. A year later, they started another label, Daisy, and announced it with a blaze of publicity. They signed writing and production deals with Barry and Greenwich, Bacharach and David, Robert Bateman, and more, and were going to write and produce stuff themselves as well. The first record on Daisy Records, \"Big Bad World\" by Cathy Saint, seemed like a likely winner:</p>\n<p>[Excerpt, Cathy Saint, \"Big Bad World\"]</p>\n<p>It might have been a success, except that it came out the week that Kennedy was killed, and the radio stations dropped anything remotely upbeat. Daisy only put out four singles in total, because the Kennedy assassination stalled its momentum completely, and so Leiber and Stoller revived the Tiger Records label instead. They put out several great records, such as \"Go Now\" by Bessie Banks, a song written by Banks' husband, and produced by Leiber and Stoller:</p>\n<p>[Excerpt: Bessie Banks, \"Go Now\"]</p>\n<p>But that wasn't a hit either -- though it was a hit for the Moody Blues a year later. Of course, as Leiber and Stoller hadn't written that one, they didn't even get their two cents a copy for the Moody Blues record.</p>\n<p>Leiber and Stoller came up with yet another label for their company – Red Bird – but had a realisation -- they knew how to make records, but didn't know how to sell them. But they knew someone who did.</p>\n<p>George Goldner is someone who has come into the narrative many times before, of course. He had been the owner of the record labels for whom the Chantels, Frankie Lymon and the Teenagers, and many others had first recorded, and he was someone with taste that was regarded as simultaneously terrible and great by the music industry, for one reason -- the stuff he liked matched uncannily what the average fourteen-year-old girl enjoyed.</p>\n<p>And this is something that needs to be emphasised at this point -- we've looked quite a bit at what are termed \"girl groups\" in recent months, but it's important to note that that wasn't what they were called at the time -- they were just vocal groups, rock and roll singers, just like any other rock and roll singers. The distinction between \"girl groups\" and doo-wop singers -- and the distinction between both of those and rock music more generally -- is something that was imposed in the seventies, mostly by male music journalists, as part of a process of revisionist history which retroactively defined rock and roll as music made by white male singer-instrumentalists.</p>\n<p>But what is very definitely the case is that immediately before the British invasion, the American music industry was in a position it had never really been before, and hasn't been since, in that not only were the audience predominantly teenage girls, but the industry was making money by selling recordings *by* teenage girls, singing about the things that teenage girls cared about. The power was still all with the older men who owned the record companies and produced the records, of course, but this was the high point for the active involvement of the target demographic in making the records they were being sold.</p>\n<p>Once the Beatles hit and were properly assimilated into the industry, the record companies started to concentrate on selling young male performers, but at this time, more than any other, having a feeling for what teenage girls liked was an advantage, and that was something that George Goldner absolutely had.</p>\n<p>Jerry Leiber had gone out for a drink and bumped into Hy Weiss, the owner of a medium-sized record label, who introduced him to Goldner. Goldner was, at the time, short of money, as his gambling habit had once again caught up to him, and he was begging Weiss for a job, and Weiss was using this as a way of making himself look important in front of Leiber, mocking Goldner, blowing smoke in his face, and saying things like \"Would you pay this schmuck $350 a week?\" while Goldner plaintively insisted he was worth at least five hundred.</p>\n<p>When Weiss went off to the toilet, Leiber offered Goldner something better than a job -- he offered him an equal share in what was at that point a failing business, but one that could pay him more than that three hundred and fifty dollars, if he could find a hit. He'd get the share only if the first record he picked out was a hit for the label.</p>\n<p>Goldner went up to Red Bird's offices, and listened through all the acetates overnight, and in the morning he was absolutely certain that he'd found a sure-fire hit. So sure he said he'd bet his life on it.</p>\n<p>This horrified Leiber, as the record was one that he thought was utterly dreadful, and the worst thing that the label had. \"Chapel of Love\" had been a song that Barry and Greenwich had written with Phil Spector, and Spector had cut a version of it with Darlene Love on lead vocal:</p>\n<p>[Excerpt, Darlene Love, \"Chapel of Love\"]</p>\n<p>However, at the time, Spector would record vastly more material than he could actually use, and he didn't release that track. Barry and Greenwich had thought that the song still had some potential, and when they started working at Red Bird they'd brought it in for a new group they were working with, the Mel-Tones. Leiber had hated the song, but Stoller had thought there was something to it, and had worked on the session.</p>\n<p>With most records on Red Bird, there is more than a little disagreement as to who did what. This one is credited as a Leiber and Stoller production, but Leiber freely admitted that he had nothing to do with a record he loathed. The production was by some combination of Stoller, Barry, and Greenwich, while the arrangement was some combination of Stoller, Greenwich, Wardell Quezergue [kaz-air] and Joe Jones, a New Orleans musician whose band had played on Roy Brown's original version of \"Good Rockin' Tonight\", and who was the manager of the Mel-Tones.</p>\n<p>The Mel-Tones were quickly renamed the Dixie Cups, and their version of \"Chapel of Love\" went to number one:</p>\n<p>[Excerpt: The Dixie Cups, \"Chapel of Love\"]</p>\n<p>George Goldner was now a partner in Red Bird Records, and Leiber and Stoller were so disgusted that a record like that was a hit that they basically washed their hands of the creative side of the label. They remained the owners of two thirds of the label, and were a vital part in bringing the people who made the records together, but for the most part they just made little R&B records for the subsidiary label Blue Cat, and left the hit-making to other people. George Goldner and his new young assistant Seymour Stein would do all the promotion, and the records would mostly be produced by Barry, Greenwich, Joe Jones, and a young man named George Morton, who everyone called \"Shadow\".</p>\n<p>Shadow Morton had been around the fringes of the music industry for years, but had never had any success. He'd started out as a teenager in the late fifties with a vocal group called the Markeys (this is not either of the two similarly-named groups we've looked at so far), who'd recorded a handful of tracks:</p>\n<p>[Excerpt: The Markeys, \"Hot Rod\"]</p>\n<p>He'd spent a few years making similarly-unsuccessful records, but his ambition never properly matched up with his ability -- he had ambitious musical ideas, and was seriously into jazz, but he wasn't an instrumentalist or a particularly talented vocalist. He seems to have been trying to model himself on Phil Spector at this time -- someone who got by on personal brand and ideas rather than on any particular abilities -- and he was going for novelty records. The most notable record he made up until this point was a song called \"Only Seventeen\" by the Beattle-ettes, which was rushed out in late February 1964:</p>\n<p>[Excerpt: The Beattle-ettes, \"Only Seventeen\"]</p>\n<p>Even with the credit \"produced by George Morton\" -- accurate, but very similar to the Beatles' production credits -- that didn't have any success, and Morton was fairly desperate when an old friend mentioned that Ellie Greenwich, that girl who'd been at high school with them, had been making hit records. Morton called her up, and out of politeness she invited him to drop in at the Trio Music office -- Trio was the publishing company owned by Leiber and Stoller, and to which Barry and Greenwich were signed as songwriters.</p>\n<p>Morton went to the office and was quite intimidated by the number of gold records on the walls, and also took an instant dislike to Jeff Barry's attitude -- Barry was quite obviously unimpressed by Greenwich's down-on-his-luck old schoolfriend. Barry eventually said to him \"So what *is* it you do for a living?\"</p>\n<p>Morton replied \"Same thing as you. I write songs.\"</p>\n<p>\"What kind of songs?\"</p>\n<p>\"Hit songs.\"</p>\n<p>Barry said that if Morton wrote hit songs, he should bring them one, basically daring him. Morton walked out of the room, then came back and said \"do you want a fast hit or a slow one?\" Barry laughed and told him to bring them a slow hit, and Morton said he'd have one for them by Tuesday.</p>\n<p>To make a demo, he turned to his former bandmates from the Markeys. Two of them, Joe and Marty Monaco, owned a recording studio that Morton often used, while another one, Tony Michaels, had gone into songwriting and management. He was managing a group of teenage girls -- two pairs of sisters, Betty and Mary Weiss and the identical twins Margie and Mary Ann Ganser.&nbsp;</p>\n<p>We don't have as much information as we'd like about how the group came together and got a manager -- neither of the Weisses has given many interviews, and both Gansers are sadly dead -- but they grew up in the same area of Queens, and were singing together from their pre-teen years, particularly influenced by the Everly Brothers and the Ink Spots. Michaels had discovered the group and recorded them singing several of his songs, and they'd come up with the name \"Shangri-Las\" after seeing it as the name of a restaurant on the way to their first session, although when this was eventually released, the name was misspelled as \"Shangra-Las\":</p>\n<p>[Excerpt: The Shangra-Las, \"Simon Says\"]</p>\n<p>That session, and their second session, were intended as just demos, but Michaels had contacts with Kama Sutra, an independent production company run by a former doo-wop singer named Artie Ripp, and Kama Sutra shopped the recordings around. The second session, for more Tony Michaels songs, was interesting because both songs recorded started with a spoken intro, which is something that would happen with almost all their later records, and is often thought of as something that Morton created, but it's clearly something that the group were doing before they met him -- one of the many cases in stories like this of the man who was good at promoting himself as a genius being credited for something that someone else came up with:</p>\n<p>[Excerpt: The Shangri-Las, \"Hate to Say I Told You So\"]</p>\n<p>Morton decided to use these girls that his friend was managing, gave them the address of the studio, and got another friend to book in a few musicians. It was apparently only on the way to the studio that he realised that he also needed an actual song, so he pulled over to the side of the road and quickly worked out something, which he later realised was loosely based on his favourite Modern Jazz Quartet track, \"Sketch\":</p>\n<p>[Excerpt: The Modern Jazz Quartet, \"Sketch\"]</p>\n<p>The piano player on the session was a fourteen-year-old kid playing his first ever session, and he later described Morton's production technique -- “He's a pretty strange guy, Shadow. He's wearing this big cape and dark glasses and he played the producer role to the hilt. I think he had a thing about Phil Spector. He wanted to be the Phil Spector of the East Coast. And he talked in these wild, dramatic, theatrical terms – he wanted more 'thunder' and he wanted more 'purple' in the record. He's waving his arms in the air saying 'give me more PURPLE'. And I'm sitting there kinda nervous – this is my first time ever in a recording studio – and I'm hissing to the other musicians, What does that mean? How do I play \"purple\"? And the guitar player leans over and says, 'Oh, just play louder, kid.'”</p>\n<p>Billy Joel would later claim that Shadow Morton never paid him the sixty-seven dollar fee he was owed for the session, but apparently it's him playing the portentous opening chords on the record:</p>\n<p>[Excerpt: The Shangri-Las, \"Remember (Walkin' in the Sand)\"]</p>\n<p>According to most sources, the original recording of that track was seven minutes long, but even so Barry and Greenwich could hear that Morton had indeed brought them a slow hit like he'd promised. Morton was signed up as a songwriter and producer, and the Shangri-Las as artists.</p>\n<p>Barry, Greenwich, Morton, and Artie Butler went back into the studio with a two-minute edit of the recording -- some sources say they recorded a whole new backing track, but most say it was an edit of the demo -- and put together a shortened version of the song that was suitable for radio play, having the girls resing the vocals, with Mary taking the lead, as she would for most of their recordings. Most notably, they overdubbed a lot of sound effects of waves and seagulls on the chorus, and sound effects would become a regular feature of the Shangri-Las' records from this point on:</p>\n<p>[Excerpt: The Shangri-Las, \"Remember (Walkin' in the Sand)\"]</p>\n<p>The record came out, and was a success -- but then Artie Ripp came calling, claiming that the Shangri-Las were under an exclusive contract to Kama Sutra productions. There had been no contract, but... and I have to be careful exactly what I say here because Ripp is still alive... Ripp had got his start working with George Goldner and Morris Levy, and his business was apparently backed financially by some associates of Goldner's. The end result was that Morton and Greenwich's names were taken off the record as producers, and the production was now credited to Jeff Barry and Artie Ripp, and Kama Sutra would get a percentage of the Shangri-Las' earnings.</p>\n<p>The group were suddenly big. \"Remember (Walkin' in the Sand)\" made the top five, and they got booked on to Murray the K's Brooklyn Fox shows. They were towards the bottom of the bill, but given that the bill also featured The Searchers, Millie, Martha and the Vandellas, Marvin Gaye, the Temptations, Jay and the Americans, the Contours, the Ronettes, the Supremes, Little Anthony and the Imperials, Dusty Springfield, the Miracles and the Dovells, all on the same show, being near the bottom wasn't too much of an insult.&nbsp;</p>\n<p>A few weeks later they also performed at the bottom of the bill at a Beatles concert, and they toured on bills with the Beach Boys and the Rolling Stones. They were going places, and they made an impression on at least some of the other acts. Chris Curtis of the Searchers would later talk about them, saying \"It’s quite a weird presentation they’ve got...the lead singer stands right over on one side of the stage, and the three others stand in the middle, instead of the other way round. It’s because when they sing ‘remember’ and she goes ‘walkin’ in the sand’, she turns her head away and looks down all dispassionately, and they wave their arms about. They do a lot of weird actions, it’s like choreography with arms, if you can have such a thing. One girl’s hand goes down, then the next, then the next. I’ve never seen anything like it before.\"</p>\n<p>But when the group toured the UK a few months later, Curtis was disappointed to find that, in his words, \"the prettiest one\" wasn't there. In late 1964, Betty Weiss became pregnant. At that time, even more than today, there was no way that an unmarried seventeen-year-old pregnant girl could be presented as a member of a big pop group, and so for a few months she was gone from the group in public, with no explanation, which is why you'll see a number of publicity photos of the group with only three members, though she continued recording with them.</p>\n<p>At this point, the group's repertoire, other than \"Remember\", was pretty much all rock and roll standards -- their first album, a mixture of their early singles and live recordings, contains live performances of \"Maybe\", \"Twist and Shout\", \"Shout\", and \"Goodnight My Love\" -- but they obviously needed a follow-up single. The song that they ended up recording had been intended by Morton for another group, the Goodies (not, sadly, the British comedy trio of the seventies), but the song was given to the Shangri-Las, and became another record with a spoken intro, a portentous piano opening, and sound effects:</p>\n<p>[Excerpt: The Shangri-Las, \"The Leader of the Pack\"]</p>\n<p>\"The Leader of the Pack\" brilliantly fused two very different but equally melodramatic pop subgenres. The song starts off as if it's going to be a song much like \"He's a Rebel\", about being in love with someone the world thinks is bad, but who you know has a heart of gold, but with elements of other Spector records -- and while Morton is the principal songwriter, Barry and Greenwich are also credited, and it's easy to hear their musical fingerprints in the bass riff in the verse:</p>\n<p>[Excerpt: The Shangri-Las, \"The Leader of the Pack\"]</p>\n<p>But where a song about being in love with a bad boy would normally end up with everyone seeing how the bad boy wasn't really all that bad, this one instead turned into a death disc, and one with a painful twist -- where normally the boy who dies in a death disc does so knowing that his girlfriend loves him, here the girl is forced by her father to dump him, and he drives off with tears in his eyes, and immediately crashes and dies:</p>\n<p>[Excerpt: The Shangri-Las, \"The Leader of the Pack\" (spoken section)]</p>\n<p>It is in many ways the ultimate death disc, and it's not surprising that the genre largely died after that -- though there would be one final death disc hit in the UK a couple of months afterwards, when a one-hit wonder singer called Twinkle released a song called \"Terry\", which sounds like it took more than a little inspiration from the Shangri-Las' record:</p>\n<p>[Excerpt: Twinkle, \"Terry\"]</p>\n<p>\"Leader of the Pack\" went to number one. The Shangri-Las were now one of the biggest groups in the country, and one of the few new American acts to break through in a year when British bands dominated the American charts.&nbsp;</p>\n<p>Meanwhile, Morton was working with the Goodies on another song, \"Give Him a Great Big Kiss\", intended to be their first single since \"Leader of the Pack\" had been taken from them. But again, it was given to the Shangri-Las -- the first the Goodies knew that the song had been taken from them was when one of them was phoned by a friend and told she'd heard their song on the radio. The song was in a very different style from the Shangri-Las' earlier singles, being far more up-tempo, but continues their tradition of having a spoken intro -- this time Mary starting the song with the immortal line :</p>\n<p>[Excerpt: The Shangri-Las, \"Give Him a Great Big Kiss\" intro]</p>\n<p>and had this wonderful bit of dialogue in the middle:</p>\n<p>[Excerpt, The Shangri-Las, \"Give Him a Great Big Kiss\"]</p>\n<p>You'll be pleased to know that the Goodies did eventually get to record a single with Morton. Both sides of the record were later covered by the Shangri-Las, but the Goodies did at least get to put them out first. The A-side, \"The Dum Dum Ditty\" is a bit of a case of too many cooks -- it's written by Morton with three other songwriters: Steve Venet, Tommy Boyce and Bobby Hart. But the B-side, \"Sophisticated Boom Boom\" is a wonderful piece of fun pop:</p>\n<p>[Excerpt: The Goodies, \"Sophisticated Boom Boom\"]</p>\n<p>Unfortunately, Red Bird didn't put any real effort into promoting that, and the Goodies split up.&nbsp;</p>\n<p>For the Shangri-Las, though, \"Give Him a Great Big Kiss\" was another hit, making number eighteen, but the next few singles didn't do particularly well -- they all made the Hot One Hundred, but only one of their next four singles made the top forty. But they made the top ten again in October 1965 with another song that amped up the melodrama to even higher levels than \"Leader of the Pack\". In \"I Can Never Go Home Any More\", the protagonist again falls in love with a boy her parents don't approve of, but this time she has a row with her mother and runs away from home, only to immediately split up with the boy. But she can't go back home, because her mother has died of loneliness in the meantime:</p>\n<p>[Excerpt: The Shangri-Las, \"I Can Never Go Home Any More\"]</p>\n<p>The Shangri-Las and Morton had hit on a winning formula -- think of the saddest possible thing that could happen, and put it over the most intense music they could, and they were bound to have&nbsp; a hit.</p>\n<p>But Red Bird Records had a problem, and that problem was named George Goldner. Leiber and Stoller had become increasingly concerned about Goldner's debts, and his unsavoury practices. They'd noticed a large number of business associates of Goldner's hanging round the Red Bird offices, and those people didn't seem to be the kind of people they wanted to be associates of. Not only this, but Goldner had apparently taken to getting the pressing plants to press up thousands of extra copies of records, which he was letting his gangster friends sell to pay for his gambling debts.</p>\n<p>Leiber and Stoller came up with a plan. They didn't want to be having to supervise their business partner all the time, but *someone* needed to supervise him. Then, out of the blue, Jerry Leiber got a phone call from Jerry Wexler. While Leiber and Stoller had left Atlantic holding something of a grudge over their business differences, they still basically thought of Wexler and the Ertegun brothers as being their type of people -- they were all East Coast people from marginalised ethnicities who loved Black culture and had got into the music business because of their love for jazz and blues music.&nbsp;</p>\n<p>At this point, Atlantic was in a bit of a commercial slump. Ray Charles and Bobby Darin had left, the Drifters and the Coasters weren't selling like they had been a couple of years earlier, and they hadn't yet signed the acts that would make them the huge success they once again became in the late sixties. Their only real success at this point was as distributors for the records that were coming out of Stax. But they did still have that massive distribution and sales team -- they were *great* at the business side of the music business, but just didn't have the artists, writers, and producers at present.</p>\n<p>Red Bird, on the other hand, was producing more great hit records than they knew what to do with, but had nobody involved who had the first clue about business.</p>\n<p>Wexler wanted to know if Leiber would be interested in talking about a merger between the two labels. Leiber and Stoller thought this sounded like a great idea -- they could be equal partners with their old friends, and Jerry Wexler would be able to supervise George Goldner in a way that they wouldn't. They agreed to a meeting in a restaurant -- Ahmet and Neshui Ertegun, Jerry Wexler, and Atlantic's lawyers, plus Leiber, Stoller, Goldner, and Red Bird's lawyer, Lee Eastman. We've mentioned Eastman a few times before, but as a refresher, he was a longstanding entertainment lawyer who had been in the business for decades -- his one-year-old daughter had been the subject of the 1942 standard \"Linda\", which had been a hit for numerous people, most recently Jan and Dean:</p>\n<p>[Excerpt: Jan and Dean, \"Linda\"]</p>\n<p>Everyone who was at that meeting told the story a different way, and only Mike Stoller is still alive to tell it, so nobody except him knows for sure exactly what happened, but this is the closest I can get to what seems to have happened -- I'm largely following here the account from Leiber and Stoller's autobiography, but also looking at a biography of Ertegun.</p>\n<p>What seems to have happened is that Goldner immediately proceeded to get very drunk.&nbsp;</p>\n<p>Wexler then said something to the effect of \"this could be a good partnership -- you've got what we need, and we've got what you need\". Goldner responded \"who needs a label that's going down the toilet?\"</p>\n<p>Ahmet Ertegun protested that the label weren't going down the toilet, and Goldner responded that \"With the\" -- and here he used an expletive which I can't use if I want to keep my clean rating on the various podcast platforms -- \"that you've been releasing, it won't be long\".</p>\n<p>Lee Eastman then also started saying that he didn't see that it was in Red Bird's interest to merge with Atlantic.</p>\n<p>Wexler responded that Eastman didn't even know what they were going to offer yet. Eastman said that Atlantic had nothing to offer that would be worth Red Bird's while. Wexler said \"Wait til you hear the offer\", and then Ahmet Ertegun said \"I didn't know we were prepared to make a formal offer!\"</p>\n<p>Goldner then said that Wexler and Ertegun each clearly didn't know what the other was doing -- \"they’re just jerking each other off. Aside from a free lunch, this is a goddamn waste of time\". Eastman agreed, and the Erteguns walked out of the meeting.</p>\n<p>Leiber and Stoller later decided that Goldner had been sabotaging the meeting because he didn't want the oversight that might have exposed his corruption, while Eastman had backed Goldner up because he was worried that the post-merger organisation wouldn't need his services and was trying to keep his own job safe -- I hasten to point out that this is their interpretation of those people's motives, and that Eastman in particular may well have had a different take on things.</p>\n<p>Not only did the merger fall through, but it created a huge amount of distrust among everyone involved. Ahmet Ertegun decided, based on Wexler's comments about \"wait til you hear the offer\", that Wexler had been conspiring with Leiber and Stoller behind his back, and that he had been trying to force the Erteguns out. Leiber and Stoller would no longer be welcome to work for Atlantic at all, and Ertegun and Wexler, while they were still both at Atlantic, were not on speaking terms for many years.</p>\n<p>Leiber and Stoller decided they just needed to get out. They went up to Goldner and told him they were giving him the company because they wanted to get back to making records. They had papers drawn up to sell their shares to him for the nominal fee of a dollar. When Goldner didn't have a dollar, Leiber lent him one, which Goldner then handed back to him to pay for Red Bird. Within a year, the label had been sold off to Shelby Singleton at Mercury Records to pay for Goldner's debts.</p>\n<p>And this is where we leave Goldner, Leiber and Stoller. Goldner would start one more label, but it had no success, and he died of a heart attack in 1970. Leiber and Stoller, meanwhile, continued working successfully in the music industry, but we won't be looking at them any further. In later years, they'd write \"Is That All There Is?\" for Peggy Lee, co-write and produce \"Pearl's a Singer\" for Elkie Brooks, and produce \"Stuck in the Middle With You\" for Stealer's Wheel:</p>\n<p>[Excerpt: Stealer's Wheel, \"Stuck in the Middle With You\"]</p>\n<p>But their period of importance in the development of rock music was over. Jerry Leiber died in 2011, aged seventy-eight, and Mike Stoller still occasionally writes songs. They left behind a body of work as songwriters and producers that's unparalleled in rock and roll music history, and there's no way adequately to sum up their contributions except to say that even in the nine episodes that have largely looked at their work, we've barely scratched the surface.</p>\n<p>During the last year that Red Bird struggled along, the Shangri-Las continued to release music, but the turmoil at the company meant that none of it was as successful as their previous recordings. Even the monumental \"Past, Present, and Future\", a dramatic recitation over music based on Beethoven's \"Moonlight Sonata\", only scraped its way to number fifty-nine:</p>\n<p>[Excerpt: The Shangri-Las, \"Past, Present, and Future\"]</p>\n<p>When Red Bird was sold to Mercury, the Shangri-Las moved along with it, although at this point Marge left the group, leaving them as a trio of Mary, Betty, and Mary Ann, but the records they made for Mercury didn't chart, and after two singles they were dropped. Morton, meanwhile, was more interested in the new artists he'd signed to his production company, like the Vanilla Fudge, and Janis Ian, whose first hit he produced:</p>\n<p>[Excerpt: Janis Ian, \"Society's Child\"]</p>\n<p>Morton apparently also served as the uncredited producer on a record by a new group called Iron Butterfly, who he thought were too tight in the studio and needed to play sloppier. He told them the equipment was malfunctioning and just to practice the song and jam a bit, while secretly recording them. The seventeen-minute result made up one side of their album, while the three-minute single edit became their biggest hit:</p>\n<p>[Excerpt: Iron Butterfly, \"In-a-gadda-da-vida\"]</p>\n<p>Morton would go on to work with groups like the New York Dolls, but his career was essentially destroyed by his alcoholism, and he did little of note in the last forty years of his life. He died in 2013.</p>\n<p>After being dropped by Mercury Records, the Shangri-Las were involved in a tangled web of litigation that meant that for ten years none of them could record. The group split up, but remained friendly, but Mary Ann was having problems with drugs and alcohol. She was hospitalised, and for a while she got herself clean, but then one night in 1970 she and her sister went round to visit Betty Weiss. While she was there, she relapsed and overdosed -- Betty didn't have a telephone, and Mary Ann died before medical help could get there. She died one month to the day before George Goldner.</p>\n<p>In 1977, the legal problems that had stopped the group from recording finally resolved themselves, and they decided to take a chance at a comeback. They called Seymour Stein, who they'd known from his days at Red Bird and who now owned Sire records. Stein was enthusiastic about working with them again, as their music had been a huge influence on groups like the Cramps and Blondie, who were now becoming popular as part of the new punk scene around CBGBs. Stein put the group together with a songwriter and producer named Andy Paley, who was part of the punk scene and had worked with people like the Ramones, but who also had a sensibility for the melodic pop styles of the pre-Beatles sixties, as you can hear from his recordings as part of the duo the Paley Brothers:</p>\n<p>[Excerpt: The Paley Brothers, \"Jacques Cousteau\"]</p>\n<p>Paley put together a backing band for the group consisting of himself on guitar with Lenny Kaye and Jay Dee Daugherty of the Patti Smith Group on bass and drums, and they played one show at CBGBs, which was apparently a huge success. But the sessions fizzled out -- it seems that the group weren't really all that interested in making any more records, they just wanted to prove to themselves that they could. There were tentative approaches to other labels for a couple of years, but most of the record companies wanted them to go disco, while Mary wanted to do something more in the style of the New York art punks who were so influenced by the group, and nothing came of it.</p>\n<p>The Shangri-Las would only play one more show together, in 1989, when they became aware of another group performing under their name and so did a show to establish their ownership of the trademark. They eventually settled with the management of the fake group, who were allowed to continue touring as the Shangri-Las so long as they paid a royalty for use of the name.</p>\n<p>Marge died in 1996, and Betty has largely chosen to stay out of the spotlight, to the extent that Mary, who is very protective of her sister, won't answer questions about her. After decades of avoiding the music industry herself, Mary eventually recorded a solo album in 2007:</p>\n<p>[Excerpt: Mary Weiss, \"You're Never Gonna See Me Cry\"]</p>\n<p>Mary now occasionally performs live, and will give the occasional interview, though she never reveals much about herself or the group. She detests them being called a \"girl group\", saying that they were rock and roll singers and shouldn't be defined by their gender -- after spending her whole life since she was fifteen having her public image controlled by other people, and for much of that time not being able to work in her chosen field, and after seeing the damage that was done to her sister and their friends, she will now only do things and talk about her life on her own terms. And who can blame her?</p>",
  "itunes:subtitle": "Episode one hundred and twenty-one of A History of Rock Music in Five Hundred Songs looks at “The Leader of the Pack, the rise and fall of Red Bird Records, and the end of the death disc trend. Click the full post to read liner notes, links to more infor",
  "itunes:keywords": "Ahmet Ertegun,Andy Paley,Artie Ripp,Atlantic Records,Billy Joel,Chris Curtis,death discs,Ellie Greenwich,Elvis Presley,George Goldner,girl groups,Jeff Barry,Jerry Wexler,Joe Jones,Lee Eastman,Leiber and Stoller,Mercury Records,Neshui Ertegun,Red Bird Records,Seymour Stein,Shadow Morton,The Dixie Cups,The Searchers,the shangri-las",
  "itunes:episodeType": "full",
  "itunes:episode": 121,
  "content:encoded": "<p>Episode one hundred and twenty-one of <em>A History of Rock Music in Five Hundred Songs</em> looks at “The Leader of the Pack\", the rise and fall of Red Bird Records, and the end of the death disc trend. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/50916475\">on \"California Sun\" by the Rivieras</a>.</p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Resources</strong></p>\n<p>As usual, I’ve created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-121-the-leader-of-the-pack/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.</p>\n<p>I used a different Shangri-Las compilation for this episode, but&nbsp;<a href=\"https://amzn.to/3tpBfPv\"><em>Myrmidons of Melodrama</em></a> is generally considered the best collection of their work, and while it's been out of print for a while it's coincidentally getting reissued tomorrow.</p>\n<p>Two of my major sources for this episode were actually the liner notes for two CDs I used --&nbsp;<a href=\"https://amzn.to/3b3hEhE\"><em>Sophisticated Boom-Boom: The Shadow Morton Story</em></a> contains a good selection of Morton's work (though oddly not \"Leader of the Pack\", his single most famous record), while&nbsp;<a href=\"https://amzn.to/2PQXuA2\"><em>The Red Bird Story&nbsp;</em></a>is an excellent three-CD set of the best work put out on the label and its subsidiaries.</p>\n<p><a href=\"https://amzn.to/2SY9jkw\">Hound Dog: The Leiber and Stoller Autobiography</a> by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller’s side of the story well, while I cross-checked their telling of the story of the meeting that ended Red Bird with&nbsp;<a href=\"https://amzn.to/2PRO6w3\"><em>The Last Sultan: The Life and Times of Ahmet Ertegun</em> by Robert Greenfield.</a></p>\n<p>And most of the biographical information about the group came from <a href=\"https://research-repository.uwa.edu.au/en/publications/dressed-in-black-the-shangri-las-and-their-recorded-legacy\">this thesis</a>.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>Today we're going to look at one of the great death discs of all time -- a record that was the epitome of the genre, and one that rendered it more or less defunct, because nothing was ever going to top that record. We're also going to look at the career of a group that are often called the quintessential girl group, but who despised the term, and at how the Mafia shut down a great record label. We're going to look at \"Leader of the Pack\" by the Shangri-Las:</p>\n<p>[Excerpt: The Shangri-Las, \"Leader of the Pack\"]</p>\n<p>To tell the story of the Shangri-Las, we need to return for the last time to Leiber and Stoller. After their time at Atlantic, working with the Drifters and the Coasters, the duo had had a falling out with the Ertegun brothers and Jerry Wexler over what they considered to be unpaid royalties, and spent a couple of years less successfully working at United Artists, but they'd got the urge to start up their own label again, like the one they'd run in the fifties, Spark Records. Their main reason for doing this was financial -- while they'd produced most of the hit records they'd written, the only actual money they made from any of them came from the songwriting royalties they got, which came to about two cents per record, split between them. As Leiber put it, \"After a while, we got to thinking, why should we settle for two cents when we could have our own record and get twenty-one cents?\"</p>\n<p>They started a label called Tiger Records, and their first release was by Tippie and the Clovers -- one of two groups that had formed around ex-members of the classic doo-wop group the Clovers when they'd split a couple of years earlier. Leiber and Stoller wrote and produced it, but the record went nowhere:</p>\n<p>[Excerpt: Tippie and the Clovers, \"Bossa Nova Baby\"]</p>\n<p>The record wasn't a dead loss though -- a couple of months afterwards, Elvis recorded a soundalike cover version. Elvis wasn't allowed to work directly with Leiber and Stoller any more, because Colonel Parker saw them as a threat to his domination of Elvis, but he still liked their material and would record it. Elvis' version featured in the film Fun In Acapulco, and made the top twenty:</p>\n<p>[Excerpt: Elvis Presley, \"Bossa Nova Baby\"]</p>\n<p>So they were still making hits, but still making only their two cents a record -- less, actually, because Elvis always took a cut of any song he recorded.</p>\n<p>After Tippie and the Clovers' record flopped, Leiber and Stoller put their label on hold. A year later, they started another label, Daisy, and announced it with a blaze of publicity. They signed writing and production deals with Barry and Greenwich, Bacharach and David, Robert Bateman, and more, and were going to write and produce stuff themselves as well. The first record on Daisy Records, \"Big Bad World\" by Cathy Saint, seemed like a likely winner:</p>\n<p>[Excerpt, Cathy Saint, \"Big Bad World\"]</p>\n<p>It might have been a success, except that it came out the week that Kennedy was killed, and the radio stations dropped anything remotely upbeat. Daisy only put out four singles in total, because the Kennedy assassination stalled its momentum completely, and so Leiber and Stoller revived the Tiger Records label instead. They put out several great records, such as \"Go Now\" by Bessie Banks, a song written by Banks' husband, and produced by Leiber and Stoller:</p>\n<p>[Excerpt: Bessie Banks, \"Go Now\"]</p>\n<p>But that wasn't a hit either -- though it was a hit for the Moody Blues a year later. Of course, as Leiber and Stoller hadn't written that one, they didn't even get their two cents a copy for the Moody Blues record.</p>\n<p>Leiber and Stoller came up with yet another label for their company – Red Bird – but had a realisation -- they knew how to make records, but didn't know how to sell them. But they knew someone who did.</p>\n<p>George Goldner is someone who has come into the narrative many times before, of course. He had been the owner of the record labels for whom the Chantels, Frankie Lymon and the Teenagers, and many others had first recorded, and he was someone with taste that was regarded as simultaneously terrible and great by the music industry, for one reason -- the stuff he liked matched uncannily what the average fourteen-year-old girl enjoyed.</p>\n<p>And this is something that needs to be emphasised at this point -- we've looked quite a bit at what are termed \"girl groups\" in recent months, but it's important to note that that wasn't what they were called at the time -- they were just vocal groups, rock and roll singers, just like any other rock and roll singers. The distinction between \"girl groups\" and doo-wop singers -- and the distinction between both of those and rock music more generally -- is something that was imposed in the seventies, mostly by male music journalists, as part of a process of revisionist history which retroactively defined rock and roll as music made by white male singer-instrumentalists.</p>\n<p>But what is very definitely the case is that immediately before the British invasion, the American music industry was in a position it had never really been before, and hasn't been since, in that not only were the audience predominantly teenage girls, but the industry was making money by selling recordings *by* teenage girls, singing about the things that teenage girls cared about. The power was still all with the older men who owned the record companies and produced the records, of course, but this was the high point for the active involvement of the target demographic in making the records they were being sold.</p>\n<p>Once the Beatles hit and were properly assimilated into the industry, the record companies started to concentrate on selling young male performers, but at this time, more than any other, having a feeling for what teenage girls liked was an advantage, and that was something that George Goldner absolutely had.</p>\n<p>Jerry Leiber had gone out for a drink and bumped into Hy Weiss, the owner of a medium-sized record label, who introduced him to Goldner. Goldner was, at the time, short of money, as his gambling habit had once again caught up to him, and he was begging Weiss for a job, and Weiss was using this as a way of making himself look important in front of Leiber, mocking Goldner, blowing smoke in his face, and saying things like \"Would you pay this schmuck $350 a week?\" while Goldner plaintively insisted he was worth at least five hundred.</p>\n<p>When Weiss went off to the toilet, Leiber offered Goldner something better than a job -- he offered him an equal share in what was at that point a failing business, but one that could pay him more than that three hundred and fifty dollars, if he could find a hit. He'd get the share only if the first record he picked out was a hit for the label.</p>\n<p>Goldner went up to Red Bird's offices, and listened through all the acetates overnight, and in the morning he was absolutely certain that he'd found a sure-fire hit. So sure he said he'd bet his life on it.</p>\n<p>This horrified Leiber, as the record was one that he thought was utterly dreadful, and the worst thing that the label had. \"Chapel of Love\" had been a song that Barry and Greenwich had written with Phil Spector, and Spector had cut a version of it with Darlene Love on lead vocal:</p>\n<p>[Excerpt, Darlene Love, \"Chapel of Love\"]</p>\n<p>However, at the time, Spector would record vastly more material than he could actually use, and he didn't release that track. Barry and Greenwich had thought that the song still had some potential, and when they started working at Red Bird they'd brought it in for a new group they were working with, the Mel-Tones. Leiber had hated the song, but Stoller had thought there was something to it, and had worked on the session.</p>\n<p>With most records on Red Bird, there is more than a little disagreement as to who did what. This one is credited as a Leiber and Stoller production, but Leiber freely admitted that he had nothing to do with a record he loathed. The production was by some combination of Stoller, Barry, and Greenwich, while the arrangement was some combination of Stoller, Greenwich, Wardell Quezergue [kaz-air] and Joe Jones, a New Orleans musician whose band had played on Roy Brown's original version of \"Good Rockin' Tonight\", and who was the manager of the Mel-Tones.</p>\n<p>The Mel-Tones were quickly renamed the Dixie Cups, and their version of \"Chapel of Love\" went to number one:</p>\n<p>[Excerpt: The Dixie Cups, \"Chapel of Love\"]</p>\n<p>George Goldner was now a partner in Red Bird Records, and Leiber and Stoller were so disgusted that a record like that was a hit that they basically washed their hands of the creative side of the label. They remained the owners of two thirds of the label, and were a vital part in bringing the people who made the records together, but for the most part they just made little R&B records for the subsidiary label Blue Cat, and left the hit-making to other people. George Goldner and his new young assistant Seymour Stein would do all the promotion, and the records would mostly be produced by Barry, Greenwich, Joe Jones, and a young man named George Morton, who everyone called \"Shadow\".</p>\n<p>Shadow Morton had been around the fringes of the music industry for years, but had never had any success. He'd started out as a teenager in the late fifties with a vocal group called the Markeys (this is not either of the two similarly-named groups we've looked at so far), who'd recorded a handful of tracks:</p>\n<p>[Excerpt: The Markeys, \"Hot Rod\"]</p>\n<p>He'd spent a few years making similarly-unsuccessful records, but his ambition never properly matched up with his ability -- he had ambitious musical ideas, and was seriously into jazz, but he wasn't an instrumentalist or a particularly talented vocalist. He seems to have been trying to model himself on Phil Spector at this time -- someone who got by on personal brand and ideas rather than on any particular abilities -- and he was going for novelty records. The most notable record he made up until this point was a song called \"Only Seventeen\" by the Beattle-ettes, which was rushed out in late February 1964:</p>\n<p>[Excerpt: The Beattle-ettes, \"Only Seventeen\"]</p>\n<p>Even with the credit \"produced by George Morton\" -- accurate, but very similar to the Beatles' production credits -- that didn't have any success, and Morton was fairly desperate when an old friend mentioned that Ellie Greenwich, that girl who'd been at high school with them, had been making hit records. Morton called her up, and out of politeness she invited him to drop in at the Trio Music office -- Trio was the publishing company owned by Leiber and Stoller, and to which Barry and Greenwich were signed as songwriters.</p>\n<p>Morton went to the office and was quite intimidated by the number of gold records on the walls, and also took an instant dislike to Jeff Barry's attitude -- Barry was quite obviously unimpressed by Greenwich's down-on-his-luck old schoolfriend. Barry eventually said to him \"So what *is* it you do for a living?\"</p>\n<p>Morton replied \"Same thing as you. I write songs.\"</p>\n<p>\"What kind of songs?\"</p>\n<p>\"Hit songs.\"</p>\n<p>Barry said that if Morton wrote hit songs, he should bring them one, basically daring him. Morton walked out of the room, then came back and said \"do you want a fast hit or a slow one?\" Barry laughed and told him to bring them a slow hit, and Morton said he'd have one for them by Tuesday.</p>\n<p>To make a demo, he turned to his former bandmates from the Markeys. Two of them, Joe and Marty Monaco, owned a recording studio that Morton often used, while another one, Tony Michaels, had gone into songwriting and management. He was managing a group of teenage girls -- two pairs of sisters, Betty and Mary Weiss and the identical twins Margie and Mary Ann Ganser.&nbsp;</p>\n<p>We don't have as much information as we'd like about how the group came together and got a manager -- neither of the Weisses has given many interviews, and both Gansers are sadly dead -- but they grew up in the same area of Queens, and were singing together from their pre-teen years, particularly influenced by the Everly Brothers and the Ink Spots. Michaels had discovered the group and recorded them singing several of his songs, and they'd come up with the name \"Shangri-Las\" after seeing it as the name of a restaurant on the way to their first session, although when this was eventually released, the name was misspelled as \"Shangra-Las\":</p>\n<p>[Excerpt: The Shangra-Las, \"Simon Says\"]</p>\n<p>That session, and their second session, were intended as just demos, but Michaels had contacts with Kama Sutra, an independent production company run by a former doo-wop singer named Artie Ripp, and Kama Sutra shopped the recordings around. The second session, for more Tony Michaels songs, was interesting because both songs recorded started with a spoken intro, which is something that would happen with almost all their later records, and is often thought of as something that Morton created, but it's clearly something that the group were doing before they met him -- one of the many cases in stories like this of the man who was good at promoting himself as a genius being credited for something that someone else came up with:</p>\n<p>[Excerpt: The Shangri-Las, \"Hate to Say I Told You So\"]</p>\n<p>Morton decided to use these girls that his friend was managing, gave them the address of the studio, and got another friend to book in a few musicians. It was apparently only on the way to the studio that he realised that he also needed an actual song, so he pulled over to the side of the road and quickly worked out something, which he later realised was loosely based on his favourite Modern Jazz Quartet track, \"Sketch\":</p>\n<p>[Excerpt: The Modern Jazz Quartet, \"Sketch\"]</p>\n<p>The piano player on the session was a fourteen-year-old kid playing his first ever session, and he later described Morton's production technique -- “He's a pretty strange guy, Shadow. He's wearing this big cape and dark glasses and he played the producer role to the hilt. I think he had a thing about Phil Spector. He wanted to be the Phil Spector of the East Coast. And he talked in these wild, dramatic, theatrical terms – he wanted more 'thunder' and he wanted more 'purple' in the record. He's waving his arms in the air saying 'give me more PURPLE'. And I'm sitting there kinda nervous – this is my first time ever in a recording studio – and I'm hissing to the other musicians, What does that mean? How do I play \"purple\"? And the guitar player leans over and says, 'Oh, just play louder, kid.'”</p>\n<p>Billy Joel would later claim that Shadow Morton never paid him the sixty-seven dollar fee he was owed for the session, but apparently it's him playing the portentous opening chords on the record:</p>\n<p>[Excerpt: The Shangri-Las, \"Remember (Walkin' in the Sand)\"]</p>\n<p>According to most sources, the original recording of that track was seven minutes long, but even so Barry and Greenwich could hear that Morton had indeed brought them a slow hit like he'd promised. Morton was signed up as a songwriter and producer, and the Shangri-Las as artists.</p>\n<p>Barry, Greenwich, Morton, and Artie Butler went back into the studio with a two-minute edit of the recording -- some sources say they recorded a whole new backing track, but most say it was an edit of the demo -- and put together a shortened version of the song that was suitable for radio play, having the girls resing the vocals, with Mary taking the lead, as she would for most of their recordings. Most notably, they overdubbed a lot of sound effects of waves and seagulls on the chorus, and sound effects would become a regular feature of the Shangri-Las' records from this point on:</p>\n<p>[Excerpt: The Shangri-Las, \"Remember (Walkin' in the Sand)\"]</p>\n<p>The record came out, and was a success -- but then Artie Ripp came calling, claiming that the Shangri-Las were under an exclusive contract to Kama Sutra productions. There had been no contract, but... and I have to be careful exactly what I say here because Ripp is still alive... Ripp had got his start working with George Goldner and Morris Levy, and his business was apparently backed financially by some associates of Goldner's. The end result was that Morton and Greenwich's names were taken off the record as producers, and the production was now credited to Jeff Barry and Artie Ripp, and Kama Sutra would get a percentage of the Shangri-Las' earnings.</p>\n<p>The group were suddenly big. \"Remember (Walkin' in the Sand)\" made the top five, and they got booked on to Murray the K's Brooklyn Fox shows. They were towards the bottom of the bill, but given that the bill also featured The Searchers, Millie, Martha and the Vandellas, Marvin Gaye, the Temptations, Jay and the Americans, the Contours, the Ronettes, the Supremes, Little Anthony and the Imperials, Dusty Springfield, the Miracles and the Dovells, all on the same show, being near the bottom wasn't too much of an insult.&nbsp;</p>\n<p>A few weeks later they also performed at the bottom of the bill at a Beatles concert, and they toured on bills with the Beach Boys and the Rolling Stones. They were going places, and they made an impression on at least some of the other acts. Chris Curtis of the Searchers would later talk about them, saying \"It’s quite a weird presentation they’ve got...the lead singer stands right over on one side of the stage, and the three others stand in the middle, instead of the other way round. It’s because when they sing ‘remember’ and she goes ‘walkin’ in the sand’, she turns her head away and looks down all dispassionately, and they wave their arms about. They do a lot of weird actions, it’s like choreography with arms, if you can have such a thing. One girl’s hand goes down, then the next, then the next. I’ve never seen anything like it before.\"</p>\n<p>But when the group toured the UK a few months later, Curtis was disappointed to find that, in his words, \"the prettiest one\" wasn't there. In late 1964, Betty Weiss became pregnant. At that time, even more than today, there was no way that an unmarried seventeen-year-old pregnant girl could be presented as a member of a big pop group, and so for a few months she was gone from the group in public, with no explanation, which is why you'll see a number of publicity photos of the group with only three members, though she continued recording with them.</p>\n<p>At this point, the group's repertoire, other than \"Remember\", was pretty much all rock and roll standards -- their first album, a mixture of their early singles and live recordings, contains live performances of \"Maybe\", \"Twist and Shout\", \"Shout\", and \"Goodnight My Love\" -- but they obviously needed a follow-up single. The song that they ended up recording had been intended by Morton for another group, the Goodies (not, sadly, the British comedy trio of the seventies), but the song was given to the Shangri-Las, and became another record with a spoken intro, a portentous piano opening, and sound effects:</p>\n<p>[Excerpt: The Shangri-Las, \"The Leader of the Pack\"]</p>\n<p>\"The Leader of the Pack\" brilliantly fused two very different but equally melodramatic pop subgenres. The song starts off as if it's going to be a song much like \"He's a Rebel\", about being in love with someone the world thinks is bad, but who you know has a heart of gold, but with elements of other Spector records -- and while Morton is the principal songwriter, Barry and Greenwich are also credited, and it's easy to hear their musical fingerprints in the bass riff in the verse:</p>\n<p>[Excerpt: The Shangri-Las, \"The Leader of the Pack\"]</p>\n<p>But where a song about being in love with a bad boy would normally end up with everyone seeing how the bad boy wasn't really all that bad, this one instead turned into a death disc, and one with a painful twist -- where normally the boy who dies in a death disc does so knowing that his girlfriend loves him, here the girl is forced by her father to dump him, and he drives off with tears in his eyes, and immediately crashes and dies:</p>\n<p>[Excerpt: The Shangri-Las, \"The Leader of the Pack\" (spoken section)]</p>\n<p>It is in many ways the ultimate death disc, and it's not surprising that the genre largely died after that -- though there would be one final death disc hit in the UK a couple of months afterwards, when a one-hit wonder singer called Twinkle released a song called \"Terry\", which sounds like it took more than a little inspiration from the Shangri-Las' record:</p>\n<p>[Excerpt: Twinkle, \"Terry\"]</p>\n<p>\"Leader of the Pack\" went to number one. The Shangri-Las were now one of the biggest groups in the country, and one of the few new American acts to break through in a year when British bands dominated the American charts.&nbsp;</p>\n<p>Meanwhile, Morton was working with the Goodies on another song, \"Give Him a Great Big Kiss\", intended to be their first single since \"Leader of the Pack\" had been taken from them. But again, it was given to the Shangri-Las -- the first the Goodies knew that the song had been taken from them was when one of them was phoned by a friend and told she'd heard their song on the radio. The song was in a very different style from the Shangri-Las' earlier singles, being far more up-tempo, but continues their tradition of having a spoken intro -- this time Mary starting the song with the immortal line :</p>\n<p>[Excerpt: The Shangri-Las, \"Give Him a Great Big Kiss\" intro]</p>\n<p>and had this wonderful bit of dialogue in the middle:</p>\n<p>[Excerpt, The Shangri-Las, \"Give Him a Great Big Kiss\"]</p>\n<p>You'll be pleased to know that the Goodies did eventually get to record a single with Morton. Both sides of the record were later covered by the Shangri-Las, but the Goodies did at least get to put them out first. The A-side, \"The Dum Dum Ditty\" is a bit of a case of too many cooks -- it's written by Morton with three other songwriters: Steve Venet, Tommy Boyce and Bobby Hart. But the B-side, \"Sophisticated Boom Boom\" is a wonderful piece of fun pop:</p>\n<p>[Excerpt: The Goodies, \"Sophisticated Boom Boom\"]</p>\n<p>Unfortunately, Red Bird didn't put any real effort into promoting that, and the Goodies split up.&nbsp;</p>\n<p>For the Shangri-Las, though, \"Give Him a Great Big Kiss\" was another hit, making number eighteen, but the next few singles didn't do particularly well -- they all made the Hot One Hundred, but only one of their next four singles made the top forty. But they made the top ten again in October 1965 with another song that amped up the melodrama to even higher levels than \"Leader of the Pack\". In \"I Can Never Go Home Any More\", the protagonist again falls in love with a boy her parents don't approve of, but this time she has a row with her mother and runs away from home, only to immediately split up with the boy. But she can't go back home, because her mother has died of loneliness in the meantime:</p>\n<p>[Excerpt: The Shangri-Las, \"I Can Never Go Home Any More\"]</p>\n<p>The Shangri-Las and Morton had hit on a winning formula -- think of the saddest possible thing that could happen, and put it over the most intense music they could, and they were bound to have&nbsp; a hit.</p>\n<p>But Red Bird Records had a problem, and that problem was named George Goldner. Leiber and Stoller had become increasingly concerned about Goldner's debts, and his unsavoury practices. They'd noticed a large number of business associates of Goldner's hanging round the Red Bird offices, and those people didn't seem to be the kind of people they wanted to be associates of. Not only this, but Goldner had apparently taken to getting the pressing plants to press up thousands of extra copies of records, which he was letting his gangster friends sell to pay for his gambling debts.</p>\n<p>Leiber and Stoller came up with a plan. They didn't want to be having to supervise their business partner all the time, but *someone* needed to supervise him. Then, out of the blue, Jerry Leiber got a phone call from Jerry Wexler. While Leiber and Stoller had left Atlantic holding something of a grudge over their business differences, they still basically thought of Wexler and the Ertegun brothers as being their type of people -- they were all East Coast people from marginalised ethnicities who loved Black culture and had got into the music business because of their love for jazz and blues music.&nbsp;</p>\n<p>At this point, Atlantic was in a bit of a commercial slump. Ray Charles and Bobby Darin had left, the Drifters and the Coasters weren't selling like they had been a couple of years earlier, and they hadn't yet signed the acts that would make them the huge success they once again became in the late sixties. Their only real success at this point was as distributors for the records that were coming out of Stax. But they did still have that massive distribution and sales team -- they were *great* at the business side of the music business, but just didn't have the artists, writers, and producers at present.</p>\n<p>Red Bird, on the other hand, was producing more great hit records than they knew what to do with, but had nobody involved who had the first clue about business.</p>\n<p>Wexler wanted to know if Leiber would be interested in talking about a merger between the two labels. Leiber and Stoller thought this sounded like a great idea -- they could be equal partners with their old friends, and Jerry Wexler would be able to supervise George Goldner in a way that they wouldn't. They agreed to a meeting in a restaurant -- Ahmet and Neshui Ertegun, Jerry Wexler, and Atlantic's lawyers, plus Leiber, Stoller, Goldner, and Red Bird's lawyer, Lee Eastman. We've mentioned Eastman a few times before, but as a refresher, he was a longstanding entertainment lawyer who had been in the business for decades -- his one-year-old daughter had been the subject of the 1942 standard \"Linda\", which had been a hit for numerous people, most recently Jan and Dean:</p>\n<p>[Excerpt: Jan and Dean, \"Linda\"]</p>\n<p>Everyone who was at that meeting told the story a different way, and only Mike Stoller is still alive to tell it, so nobody except him knows for sure exactly what happened, but this is the closest I can get to what seems to have happened -- I'm largely following here the account from Leiber and Stoller's autobiography, but also looking at a biography of Ertegun.</p>\n<p>What seems to have happened is that Goldner immediately proceeded to get very drunk.&nbsp;</p>\n<p>Wexler then said something to the effect of \"this could be a good partnership -- you've got what we need, and we've got what you need\". Goldner responded \"who needs a label that's going down the toilet?\"</p>\n<p>Ahmet Ertegun protested that the label weren't going down the toilet, and Goldner responded that \"With the\" -- and here he used an expletive which I can't use if I want to keep my clean rating on the various podcast platforms -- \"that you've been releasing, it won't be long\".</p>\n<p>Lee Eastman then also started saying that he didn't see that it was in Red Bird's interest to merge with Atlantic.</p>\n<p>Wexler responded that Eastman didn't even know what they were going to offer yet. Eastman said that Atlantic had nothing to offer that would be worth Red Bird's while. Wexler said \"Wait til you hear the offer\", and then Ahmet Ertegun said \"I didn't know we were prepared to make a formal offer!\"</p>\n<p>Goldner then said that Wexler and Ertegun each clearly didn't know what the other was doing -- \"they’re just jerking each other off. Aside from a free lunch, this is a goddamn waste of time\". Eastman agreed, and the Erteguns walked out of the meeting.</p>\n<p>Leiber and Stoller later decided that Goldner had been sabotaging the meeting because he didn't want the oversight that might have exposed his corruption, while Eastman had backed Goldner up because he was worried that the post-merger organisation wouldn't need his services and was trying to keep his own job safe -- I hasten to point out that this is their interpretation of those people's motives, and that Eastman in particular may well have had a different take on things.</p>\n<p>Not only did the merger fall through, but it created a huge amount of distrust among everyone involved. Ahmet Ertegun decided, based on Wexler's comments about \"wait til you hear the offer\", that Wexler had been conspiring with Leiber and Stoller behind his back, and that he had been trying to force the Erteguns out. Leiber and Stoller would no longer be welcome to work for Atlantic at all, and Ertegun and Wexler, while they were still both at Atlantic, were not on speaking terms for many years.</p>\n<p>Leiber and Stoller decided they just needed to get out. They went up to Goldner and told him they were giving him the company because they wanted to get back to making records. They had papers drawn up to sell their shares to him for the nominal fee of a dollar. When Goldner didn't have a dollar, Leiber lent him one, which Goldner then handed back to him to pay for Red Bird. Within a year, the label had been sold off to Shelby Singleton at Mercury Records to pay for Goldner's debts.</p>\n<p>And this is where we leave Goldner, Leiber and Stoller. Goldner would start one more label, but it had no success, and he died of a heart attack in 1970. Leiber and Stoller, meanwhile, continued working successfully in the music industry, but we won't be looking at them any further. In later years, they'd write \"Is That All There Is?\" for Peggy Lee, co-write and produce \"Pearl's a Singer\" for Elkie Brooks, and produce \"Stuck in the Middle With You\" for Stealer's Wheel:</p>\n<p>[Excerpt: Stealer's Wheel, \"Stuck in the Middle With You\"]</p>\n<p>But their period of importance in the development of rock music was over. Jerry Leiber died in 2011, aged seventy-eight, and Mike Stoller still occasionally writes songs. They left behind a body of work as songwriters and producers that's unparalleled in rock and roll music history, and there's no way adequately to sum up their contributions except to say that even in the nine episodes that have largely looked at their work, we've barely scratched the surface.</p>\n<p>During the last year that Red Bird struggled along, the Shangri-Las continued to release music, but the turmoil at the company meant that none of it was as successful as their previous recordings. Even the monumental \"Past, Present, and Future\", a dramatic recitation over music based on Beethoven's \"Moonlight Sonata\", only scraped its way to number fifty-nine:</p>\n<p>[Excerpt: The Shangri-Las, \"Past, Present, and Future\"]</p>\n<p>When Red Bird was sold to Mercury, the Shangri-Las moved along with it, although at this point Marge left the group, leaving them as a trio of Mary, Betty, and Mary Ann, but the records they made for Mercury didn't chart, and after two singles they were dropped. Morton, meanwhile, was more interested in the new artists he'd signed to his production company, like the Vanilla Fudge, and Janis Ian, whose first hit he produced:</p>\n<p>[Excerpt: Janis Ian, \"Society's Child\"]</p>\n<p>Morton apparently also served as the uncredited producer on a record by a new group called Iron Butterfly, who he thought were too tight in the studio and needed to play sloppier. He told them the equipment was malfunctioning and just to practice the song and jam a bit, while secretly recording them. The seventeen-minute result made up one side of their album, while the three-minute single edit became their biggest hit:</p>\n<p>[Excerpt: Iron Butterfly, \"In-a-gadda-da-vida\"]</p>\n<p>Morton would go on to work with groups like the New York Dolls, but his career was essentially destroyed by his alcoholism, and he did little of note in the last forty years of his life. He died in 2013.</p>\n<p>After being dropped by Mercury Records, the Shangri-Las were involved in a tangled web of litigation that meant that for ten years none of them could record. The group split up, but remained friendly, but Mary Ann was having problems with drugs and alcohol. She was hospitalised, and for a while she got herself clean, but then one night in 1970 she and her sister went round to visit Betty Weiss. While she was there, she relapsed and overdosed -- Betty didn't have a telephone, and Mary Ann died before medical help could get there. She died one month to the day before George Goldner.</p>\n<p>In 1977, the legal problems that had stopped the group from recording finally resolved themselves, and they decided to take a chance at a comeback. They called Seymour Stein, who they'd known from his days at Red Bird and who now owned Sire records. Stein was enthusiastic about working with them again, as their music had been a huge influence on groups like the Cramps and Blondie, who were now becoming popular as part of the new punk scene around CBGBs. Stein put the group together with a songwriter and producer named Andy Paley, who was part of the punk scene and had worked with people like the Ramones, but who also had a sensibility for the melodic pop styles of the pre-Beatles sixties, as you can hear from his recordings as part of the duo the Paley Brothers:</p>\n<p>[Excerpt: The Paley Brothers, \"Jacques Cousteau\"]</p>\n<p>Paley put together a backing band for the group consisting of himself on guitar with Lenny Kaye and Jay Dee Daugherty of the Patti Smith Group on bass and drums, and they played one show at CBGBs, which was apparently a huge success. But the sessions fizzled out -- it seems that the group weren't really all that interested in making any more records, they just wanted to prove to themselves that they could. There were tentative approaches to other labels for a couple of years, but most of the record companies wanted them to go disco, while Mary wanted to do something more in the style of the New York art punks who were so influenced by the group, and nothing came of it.</p>\n<p>The Shangri-Las would only play one more show together, in 1989, when they became aware of another group performing under their name and so did a show to establish their ownership of the trademark. They eventually settled with the management of the fake group, who were allowed to continue touring as the Shangri-Las so long as they paid a royalty for use of the name.</p>\n<p>Marge died in 1996, and Betty has largely chosen to stay out of the spotlight, to the extent that Mary, who is very protective of her sister, won't answer questions about her. After decades of avoiding the music industry herself, Mary eventually recorded a solo album in 2007:</p>\n<p>[Excerpt: Mary Weiss, \"You're Never Gonna See Me Cry\"]</p>\n<p>Mary now occasionally performs live, and will give the occasional interview, though she never reveals much about herself or the group. She detests them being called a \"girl group\", saying that they were rock and roll singers and shouldn't be defined by their gender -- after spending her whole life since she was fifteen having her public image controlled by other people, and for much of that time not being able to work in her chosen field, and after seeing the damage that was done to her sister and their friends, she will now only do things and talk about her life on her own terms. And who can blame her?</p>",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and twenty-one of A History of Rock Music in Five Hundred Songs looks at “The Leader of the Pack\", the rise and fall of Red Bird Records, and the end of the death disc trend. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bonus episode available, on \"California Sun\" by the Rivieras.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\nResources\nAs usual, I’ve created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\nI used a different Shangri-Las compilation for this episode, but&nbsp;Myrmidons of Melodrama is generally considered the best collection of their work, and while it's been out of print for a while it's coincidentally getting reissued tomorrow.\nTwo of my major sources for this episode were actually the liner notes for two CDs I used --&nbsp;Sophisticated Boom-Boom: The Shadow Morton Story contains a good selection of Morton's work (though oddly not \"Leader of the Pack\", his single most famous record), while&nbsp;The Red Bird Story&nbsp;is an excellent three-CD set of the best work put out on the label and its subsidiaries.\nHound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller’s side of the story well, while I cross-checked their telling of the story of the meeting that ended Red Bird with&nbsp;The Last Sultan: The Life and Times of Ahmet Ertegun by Robert Greenfield.\nAnd most of the biographical information about the group came from this thesis.\nPatreon\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\nTranscript\nToday we're going to look at one of the great death discs of all time -- a record that was the epitome of the genre, and one that rendered it more or less defunct, because nothing was ever going to top that record. We're also going to look at the career of a group that are often called the quintessential girl group, but who despised the term, and at how the Mafia shut down a great record label. We're going to look at \"Leader of the Pack\" by the Shangri-Las:\n[Excerpt: The Shangri-Las, \"Leader of the Pack\"]\nTo tell the story of the Shangri-Las, we need to return for the last time to Leiber and Stoller. After their time at Atlantic, working with the Drifters and the Coasters, the duo had had a falling out with the Ertegun brothers and Jerry Wexler over what they considered to be unpaid royalties, and spent a couple of years less successfully working at United Artists, but they'd got the urge to start up their own label again, like the one they'd run in the fifties, Spark Records. Their main reason for doing this was financial -- while they'd produced most of the hit records they'd written, the only actual money they made from any of them came from the songwriting royalties they got, which came to about two cents per record, split between them. As Leiber put it, \"After a while, we got to thinking, why should we settle for two cents when we could have our own record and get twenty-one cents?\"\nThey started a label called Tiger Records, and their first release was by Tippie and the Clovers -- one of two groups that had formed around ex-members of the classic doo-wop group the Clovers when they'd split a couple of years earlier. Leiber and Stoller wrote and produced it, but the record went nowhere:\n[Excerpt: Tippie and the Clovers, \"Bossa Nova Baby\"]\nThe record wasn't a dead loss though -- a couple of months afterwards, Elvis recorded a soundalike cover version. Elvis wasn't allowed to work directly with Leiber and Stoller any more, because Colonel Parker saw them as a threat to his domination of Elvis, but he still liked their material and would record it. Elvis' versio",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and twenty-one of A History of Rock Music in Five Hundred Songs looks at “The Leader of the Pack\", the rise and fall of Red Bird Records, and the end of the death disc trend. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bonus episode available, on \"California Sun\" by the Rivieras.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\nResources\nAs usual, I’ve created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\nI used a different Shangri-Las compilation for this episode, but&nbsp;Myrmidons of Melodrama is generally considered the best collection of their work, and while it's been out of print for a while it's coincidentally getting reissued tomorro",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}