{
  "title": "The Birth of Random-Access Memory",
  "link": "https://spectrum.ieee.org/the-birth-of-ram",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/five-gray-towers-with-switch-boards-and-other-tools.jpg?id=30193855&width=1200&height=800&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>Whether you’re streaming a movie on<a href=\"https://about.netflix.com/en\" rel=\"noopener noreferrer\" target=\"_blank\"> Netflix</a>, playing a video game, or just looking at digital photos, your computer is regularly dipping into its memory for instructions. Without random-access memory, a computer today can’t even boot up.</p><p>Over the years, memory has been made up of vacuum tubes, glass tubes filled with mercury and, most recently, semiconductors.</p><hr/><p>But the first computers didn’t have any reprogrammable memory at all. Until the late 1940s, every time a machine needed to change tasks, it had to be physically reprogrammed and rewired, according to the<a href=\"https://www.scienceandindustrymuseum.org.uk/objects-and-stories/baby-and-modern-computing\" rel=\"noopener noreferrer\" target=\"_blank\"> Science and Industry Museum</a> in Manchester, England.</p><p>The first electronic digital computer capable of storing instructions and data in a read/write memory was the Manchester Small Scale Experimental Machine, known as the Manchester “Baby.” It successfully ran a program from memory in June 1948.</p><p>Computing pioneers<a href=\"https://en.wikipedia.org/wiki/Frederic_C._Williams\" rel=\"noopener noreferrer\" target=\"_blank\"> Frederic C. Williams</a>,<a href=\"https://en.wikipedia.org/wiki/Tom_Kilburn\" rel=\"noopener noreferrer\" target=\"_blank\"> Tom Kilburn</a>, and<a href=\"https://en.wikipedia.org/wiki/Geoff_Tootill\" rel=\"noopener noreferrer\" target=\"_blank\"> Geoff Tootill</a> developed and built the machine and its storage system—the Williams-Kilburn tube—at the<a href=\"https://www.manchester.ac.uk/\" rel=\"noopener noreferrer\" target=\"_blank\"> University of Manchester</a>.</p><p>“The Baby was very limited in what it could do, but it was the first-ever real-life demonstration of electronic stored-program computing, the fast and flexible approach used in nearly all computers today,” said <a href=\"https://www.research.manchester.ac.uk/portal/James.Sumner.html\" target=\"_blank\">James Sumner</a>, a lecturer on the history of technology at the University of Manchester, in an interview with the<a href=\"https://www.manchestereveningnews.co.uk/news/greater-manchester-news/bringing-up-baby-how-1948-14819127\" rel=\"noopener noreferrer\" target=\"_blank\"> <em>Manchester Evening News</em></a>.</p><p>The IEEE commemorated Baby as an<a href=\"http://ieeemilestones.ethw.org/Main_Page\" rel=\"noopener noreferrer\" target=\"_blank\"> IEEE Milestone</a> during a ceremony held on 21 June at the university.</p><p><strong>How Baby Came to Remember</strong></p><p>After World War II, research groups around the world began investigating ways to build computers that could perform multiple tasks from memory. One such researcher was British engineer F.C. Williams, a radar pioneer who worked at the<a href=\"https://en.wikipedia.org/wiki/Telecommunications_Research_Establishment\" rel=\"noopener noreferrer\" target=\"_blank\"> Telecommunications Research Establishment</a> (TRE), in Malvern, England.</p><p>Williams had an impressive background in radar systems and electronics research. He helped develop the “identification: friend or foe” system, which used radar pulses to distinguish Allied aircraft during the war.</p><p>Because of his expertise, in 1945 the TRE tasked Williams with editing and contributing content to a series of books on radar techniques. As part of his research, he traveled to<a href=\"https://en.wikipedia.org/wiki/Bell_Labs\" rel=\"noopener noreferrer\" target=\"_blank\"> Bell Labs</a> in Murray Hill, N.J., to learn about work being done to remove ground echoes from the radar traces on CRTs. Williams came up with the idea of using two CRTs, and storing the radar trace by passing it back and forth between the two. Williams returned to the TRE and began to investigate the idea, realizing that the approach also could be used to store digital data, with just one CRT. Kilburn, a scientific officer at the TRE, joined Williams in his research.</p><p class=\"pull-quote\">“The Baby was the first-ever real-life demonstration of electronic stored-program computing, and the fast and flexible approach is used in nearly all computers today.”</p><p><span></span>A CRT uses an electron gun to send a focused beam of electrons toward a phosphor-laden screen. The phosphors glow where the beam strikes; the glow eventually fades until struck again by the electron beam. To store digital data, Williams and Kilburn used a more powerful electron beam. When it hit the screen, it knocked a few electrons aside, briefly creating a positively charged spot surrounded by a negative halo. Reading the data involved writing to each data spot on that plate and decoding the pattern of current generated in a nearby metal plate—which would depend on whether there was something written at that spot previously.</p><p>It turned out that the electron charges leaked away over time (just as phosphors on a TV screen fade) and didn’t allow the tube to keep storing data, according to<a href=\"https://ethw.org/Milestones:Small_Scale_Experimental_Machine,_1948-1951\" target=\"_blank\"> an entry about the Milestone</a> on the<a href=\"https://ethw.org/Main_Page\" target=\"_blank\"> Engineering and Technology History Wiki</a>. To maintain the charge, the electron beam had to repeatedly read the data stored on the phosphor and regenerate the associated charge pattern. Such refreshing is also used in the DRAM present in today’s computers.</p><p>In 1946, the men demonstrated a device that could store 1 bit. It is now called<a href=\"https://en.wikipedia.org/wiki/Williams_tube\" target=\"_blank\"> the <em>Williams-Kilburn tube</em></a>; sometimes just the <em>Williams tube</em>.</p><p> Also in 1946, Williams joined the University of Manchester as chair of its electrotechnology department. The TRE temporarily assigned Kilburn to work with him there, and the two continued their research at the university’s<a href=\"https://en.wikipedia.org/wiki/Computing_Machine_Laboratory\" target=\"_blank\"> Computing Machine Laboratory</a>. A year later Williams recruited computer scientist Tootill to join the team. And in 1947 they successfully stored 2,048 bits using a Williams-Kilburn tube.</p><p><strong>Building the Prototype</strong></p><p>To test the reliability of the Williams-Kilburn tube, in 1948 Tilburn and Tootill, with guidance from Computing Machine Laboratory founder<a href=\"https://en.wikipedia.org/wiki/Max_Newman\" rel=\"noopener noreferrer\" target=\"_blank\"> Max Newman</a> and computer scientist<a href=\"https://spectrum.ieee.org/turing-and-the-test-of-time\" target=\"_self\"> Alan Turing</a>, built a small-scale experimental machine. It took them six months, using surplus parts from WWII-era code-breaking machines. And the Manchester Baby was born.</p><p>The Baby took up an entire room in the laboratory building. It was 5 meters long, 2 meters tall, and weighed almost a tonne. The computer consisted of metal racks, hundreds of valves and vacuum tubes, and a panel of vertically mounted hand-operated switches. Users entered programs into memory, bit by bit, via the switches, and read the output directly off the face of the Williams-Kilburn tube.</p><p>On 21 June 1948, Baby ran its first program. Written by Kilburn to find the highest factor of an integer, it consisted of 17 instructions. The machine ran through 3.5 million calculations in 53 minutes before getting the correct answer.</p><p>By 1953, 17 pioneering computer design groups worldwide had adopted the Williams-Kilburn RAM technology.</p><p>Administered by the<a href=\"http://www.ieee.org/about/history_center/index.html\" rel=\"noopener noreferrer\" target=\"_blank\"> IEEE History Center</a> and<a href=\"https://www.ieeefoundation.org/donate_history\" rel=\"noopener noreferrer\" target=\"_blank\"> supported by donors</a>, the Milestone program recognizes outstanding technical developments around the world. The IEEE U.K. and Ireland Section sponsored the nomination for the Baby. The Baby Milestone plaque, which is to be displayed outside on the Coupland 1 building at the University of Manchester, reads:</p><p> “<em>At this site on 21 June 1948 the ‘Baby’ became the first computer to execute a program stored in addressable read-write electronic memory. ‘Baby’ validated Williams-Kilburn tube random-access memories, later widely used, and led to the 1949 Manchester Mark I which pioneered index registers. In February 1951, Ferranti Ltd.’s commercial derivative became the first electronic computer marketed as a standard product delivered to a customer.”</em></p>",
  "pubDate": "Thu, 21 Jul 2022 16:00:01 +0000",
  "guid": "https://spectrum.ieee.org/the-birth-of-ram",
  "category": [
    "Ieee history",
    "Ieee history center",
    "Manchester baby computer",
    "Computer history",
    "Random access memory",
    "Ieee milestone",
    "Computers",
    "Type:ti"
  ],
  "dc:creator": "Joanna Goodrich",
  "media:content": ""
}