{
  "title": "Twitter starts testing paid account verification on iOS",
  "description": "<p>Twitter has begun rolling out support for the new, more expensive version of its <a href=\"https://www.engadget.com/twitter-blue-price-increasing-8-per-month-180319987.html\">Blue subscription</a>. As of Saturday, the company’s iOS app now reflects the fact users can soon pay $8 per month to obtain a verified account. The changelog notes people who sign up for Twitter Blue will receive a checkmark, “just like the celebrities, companies, and politicians you already follow.”</p><div id=\"c986e302e09a4172b64768964f385229\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The new Blue isn’t live yet — the sprint to our launch continues but some folks may see us making updates because we are testing and pushing changes in real-time. The Twitter team is legendary. 🫡 New Blue… coming soon! <a href=\"https://t.co/ewTSTjx3t7\">https://t.co/ewTSTjx3t7</a></p>— Esther Crawford ✨ (@esthercrawford) <a href=\"https://twitter.com/esthercrawford/status/1588969361976741888?ref_src=twsrc%5Etfw\">November 5, 2022</a></blockquote></div><p>However, Twitter is still rolling out the necessary backend changes to support the change more broadly. Following <a href=\"https://twitter.com/DarrellaaS/status/1588965546263195648?s=20&t=Z7sZvFqpsJiekoz0N8iHUA\">reports</a> of users not seeing a blue checkmark on their account even after signing up for the new subscription, Esther Crawford, a product manager at the company, <a href=\"https://twitter.com/esthercrawford/status/1588969361976741888?s=20&t=Ld7dpny-A4xAimTVFOqtfg\">tweeted</a> the updated service was coming soon. \"The new Blue isn't live yet — the sprint to our launch continues but some folks may see us making updates because we are testing and pushing changes in real-time,\" she said.&nbsp;</p><span id=\"end-legacy-contents\"></span><p>To that point, Twitter has yet to update its Android app, and the other perks Elon Musk promised would be part of the revamped Twitter Blue, such as the ability to post longer videos, are listed as “coming soon” in the changelog of the iOS update Twitter pushed out today. At one point after the release went live, the app briefly had a new notification view that only showed content from verified users.&nbsp;&nbsp;&nbsp;</p><p>It’s unclear when all the elements Musk promised will be in place, but he <a href=\"https://www.engadget.com/elon-musk-considers-making-verification-a-twitter-blue-perk-051906957.html\">reportedly gave</a> employees working on making verification a paid feature until November 7th to complete the work or else lose their jobs. On Friday, the company began laying off about <a href=\"https://www.engadget.com/twitter-layoffs-010148183.html\">50 percent of its workforce</a>, leaving entire teams gutted.</p><p><strong>Update 7:38 PM ET: </strong>Added more context and information about Twitter's rollout of its new Blue subscription service.&nbsp;&nbsp;</p>",
  "link": "https://www.engadget.com/twitter-blue-ios-now-available-202609538.html?src=rss",
  "source_id": "engadget_479",
  "guid": "ff84857d-1ef1-4c55-a09e-c5874c47c1fd",
  "dc:creator": "Igor Bonifacic",
  "source": "Engadget",
  "dc:publisher": "Engadget",
  "dc:rightsHolder": "Engadget",
  "pubDate": "Sat, 05 Nov 2022 20:26:09 +0000",
  "ingested": 1667691868,
  "modified": "2022-11-05T23:44:30+00:00",
  "category": [
    "Technology & Electronics",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Igor Bonifacic"
  ],
  "media:content": [
    {
      "media:keywords": "headline",
      "media:media_html": "",
      "dc:identifier": 1,
      "media:credit": "",
      "media:description": "",
      "media:title": ""
    },
    {
      "media:media_html": "",
      "dc:identifier": 2,
      "media:credit": "SOPA Images via Getty Images",
      "media:description": "UKRAINE - 2021/06/04: In this photo illustration, Twitter logo is seen on a smartphone in a hand in front of a Twitter webpage about launch new subscription service Twitter Blue. Twitter launches its first subscription service Twitter Blue, reportedly by media. (Photo Illustration by Pavlo Gonchar/SOPA Images/LightRocket via Getty Images)",
      "media:title": "In this photo illustration, Twitter logo is seen on a..."
    }
  ]
}