{
  "title": "62: What To Eat For Your Brain with Dr. Mark Hyman",
  "pubDate": "Wed, 23 May 2018 15:14:43 +0000",
  "guid": "78ca0bd4ba694edcbde777f913cc89f4",
  "link": "https://sites.libsyn.com/94610/61-what-to-eat-for-your-brain-with-dr-mark-hyman",
  "itunes:image": "",
  "description": "<p>What the heck should I eat for my brain?<br /> <br /> If you’ve listened to the past podcast episodes, you know the most popular one was “The 10 Keys to Unlocking Your Kwik Brain.” While 1/3 of our brain is pre-determined by genetics and biology, the 2/3 of it is entirely in your control. And the first thing on that list is the food that you eat. But with so many choices (or lack thereof) these days, what should we eat to have an optimal brain?<br /> <br /> To dive deeper into this subject, we have a very special guest today. Dr. Mark Hyman is a director of Cleveland Clinique, a center for functional medicine, 11 times bestselling author, along with his new book, “Food, What The Heck Should I Eat?”.<br /> <br /> Listen in as we go over the top 3 brain foods you should eat AND 3 foods you should avoid.<br /> <br /> This episode is not intended to diagnose or treat any medical condition, and it’s educational only. Please consult your healthcare provider if you have any question or concern.<br /> <br /> *Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access.</p>",
  "content:encoded": "<p>What the heck should I eat for my brain?  If you’ve listened to the past podcast episodes, you know the most popular one was “The 10 Keys to Unlocking Your Kwik Brain.” While 1/3 of our brain is pre-determined by genetics and biology, the 2/3 of it is entirely in your control. And the first thing on that list is the food that you eat. But with so many choices (or lack thereof) these days, what should we eat to have an optimal brain?  To dive deeper into this subject, we have a very special guest today. Dr. Mark Hyman is a director of Cleveland Clinique, a center for functional medicine, 11 times bestselling author, along with his new book, “Food, What The Heck Should I Eat?”.  Listen in as we go over the top 3 brain foods you should eat AND 3 foods you should avoid.  This episode is not intended to diagnose or treat any medical condition, and it’s educational only. Please consult your healthcare provider if you have any question or concern.  *Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access.</p>",
  "enclosure": "",
  "itunes:duration": "17:44",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What the heck should I eat for my brain?  If you’ve listened to the past podcast episodes, you know the most popular one was “The 10 Keys to Unlocking Your Kwik Brain.” While 1/3 of our brain is pre-determined by genetics and biology, the 2/3 of...",
  "itunes:episodeType": "full"
}