{
  "title": "64: Work Smart - Not Hard",
  "pubDate": "Mon, 02 Jul 2018 15:33:38 +0000",
  "guid": "c96302d72c2a4c6ea170b5cda2759baf",
  "link": "https://sites.libsyn.com/94610/64-work-smart-not-hard",
  "itunes:image": "",
  "description": "<p class=\"p1\">“How do you work smart, not just hard?”<br /> <br /> There are times in life where you might find yourself overwhelmed. You might have a long to-do list, insane demand, and not enough time.<br /> <br /> All these action items may appear to be high priority tasks, and you’re carrying the weight of it all. But it can sometimes feel a little bit unbearable. You may feel like you’re being held back or tired of the pressure, so I understand where this question is coming from.<br /> <br /> If you’re just like the rest of us, you want to become more efficient and smart. You want life to feel easier, and not so hard.<br /> <br /> Here’s my “Kwik tip” on how to handle when you feel overwhelmed and unsure of what to do next.<br /> <br /> *Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access.</p>",
  "content:encoded": "<p class=\"p1\">“How do you work smart, not just hard?”  There are times in life where you might find yourself overwhelmed. You might have a long to-do list, insane demand, and not enough time.  All these action items may appear to be high priority tasks, and you’re carrying the weight of it all. But it can sometimes feel a little bit unbearable. You may feel like you’re being held back or tired of the pressure, so I understand where this question is coming from.  If you’re just like the rest of us, you want to become more efficient and smart. You want life to feel easier, and not so hard.  Here’s my “Kwik tip” on how to handle when you feel overwhelmed and unsure of what to do next.  *Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access.</p>",
  "enclosure": "",
  "itunes:duration": "12:10",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "“How do you work smart, not just hard?”  There are times in life where you might find yourself overwhelmed. You might have a long to-do list, insane demand, and not enough time.  All these action items may appear to be high priority tasks, and...",
  "itunes:episodeType": "full"
}