{
  "title": "Episode #379:  In The Middle Of Nowhere",
  "link": "https://www.krpoliticaljunkie.com/episode-379-in-the-middle-of-nowhere/",
  "pubDate": "Fri, 19 Nov 2021 13:55:50 +0000",
  "guid": "https://www.krpoliticaljunkie.com/?p=21359",
  "description": "<p>Former Sen. Joe Lieberman, author of a new book about centrism in politics, says both parties need to compromise if they expect anything to get done.  And we review the career of Sen. Pat Leahy (D-VT), who announced his retirement after nearly 48 years in office.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com/episode-379-in-the-middle-of-nowhere/\">Episode #379:  In The Middle Of Nowhere</a> appeared first on <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com\">Ken Rudin&#039;s Political Junkie</a>.</p>",
  "enclosure": "",
  "itunes:subtitle": "Former Sen. Joe Lieberman, author of a new book about centrism in politics, says both parties need to compromise if they expect anything to get done.  And we review the career of Sen. Pat Leahy (D-VT), who announced his retirement after nearly 48 years...",
  "itunes:summary": "Former Connecticut Sen. Joe Lieberman, author of the new book, &#8220;The Centrist Solution,&#8221; argues that the only way to get things done in this bitterly split Congress is for lawmakers of both parties be willing to eschew the extremes and work across party lines to get things done.<br />\nAnd Bob Kinzel of Vermont Public Radio lists the highlights of the long career of Patrick Leahy, who announced his retirement this week after nearly 48 years in the Senate.  Bob also sizes up the field to replace Leahy in next year&#8217;s election, and says that Democrats are all but assured of keeping the seat.<br />\nMusic heard in this podcast:<br />\n<a href=\"https://www.youtube.com/watch?v=5tZlu4wP4pw\">In the Waiting Line by Zero 7</a><br />\n<a href=\"https://www.youtube.com/watch?v=N1oKWPUlX9E\">Wait by The Beatles</a><br />\n<a href=\"https://www.youtube.com/watch?v=8L1UngfqojI\">Both Sides Now by Judy Collins</a><br />",
  "itunes:author": "Ken Rudin",
  "itunes:image": "",
  "itunes:episode": 379,
  "itunes:title": "In The Middle Of Nowhere",
  "itunes:duration": "58:54"
}