{
  "title": "Jacobians and Gradients for Cartesian Differential Categories. (arXiv:2211.01835v1 [cs.LO])",
  "link": "http://arxiv.org/abs/2211.01835",
  "description": "<p>Cartesian differential categories come equipped with a differential\ncombinator that formalizes the directional derivative from multivariable\ncalculus. Cartesian differential categories provide a categorical semantics of\nthe differential lambda-calculus and have also found applications in causal\ncomputation, incremental computation, game theory, differentiable programming,\nand machine learning. There has recently been a desire to provide a\n(coordinate-free) characterization of Jacobians and gradients in Cartesian\ndifferential categories. One's first attempt might be to consider Cartesian\ndifferential categories which are Cartesian closed, such as models of the\ndifferential lambda-calculus, and then take the curry of the derivative.\nUnfortunately, this approach excludes numerous important examples of Cartesian\ndifferential categories such as the category of real smooth functions. In this\npaper, we introduce linearly closed Cartesian differential categories, which\nare Cartesian differential categories that have an internal hom of linear maps,\na bilinear evaluation map, and the ability to curry maps which are linear in\ntheir second argument. As such, the Jacobian of a map is defined as the curry\nof its derivative. Many well-known examples of Cartesian differential\ncategories are linearly closed, such as, in particular, the category of real\nsmooth functions. We also explain how a Cartesian closed differential category\nis linearly closed if and only if a certain linear idempotent on the internal\nhom splits. To define the gradient of a map, one must be able to define the\ntranspose of the Jacobian, which can be done in a Cartesian reverse\ndifferential category. Thus, we define the gradient of a map to be the curry of\nits reverse derivative and show this equals the transpose of its Jacobian. We\nalso explain how a linearly closed Cartesian reverse differential category is\nprecisely a linearly closed Cartesian differential category with an appropriate\nnotion of transpose.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Lemay_J/0/1/0/all/0/1\">Jean-Simon Pacaud Lemay</a> (Mount Allison University)"
}