{
  "title": "Halcyon Lawrence (Machine Listening)",
  "itunes:author": "Liquid Architecture",
  "itunes:subtitle": "Machine Listening",
  "itunes:summary": "Halcyon Lawrence talks to artist Sean Dockray, legal scholar James Parker, and curator Joel Stern about some of her work on the politics of voice user interfaces: in particular accent bias, ‘Siri discipline’ and the ways in which smart speakers reproduce and hardwire longstanding forms of linguistic imperialism.\n\nOur devices are listening to us. Previous generations of audio-technology transmitted, recorded or manipulated sound. Today our digital voice assistants, smart speakers and a growing range of related technologies are increasingly able to analyse and respond to it as well. Scientists and engineers increasingly refer to this as “machine listening”, though the first widespread use of the term was in computer music. Machine listening is much more than just a new scientific discipline or vein of technical innovation however. It is also an emergent field of knowledge-power, of data extraction and colonialism, of capital accumulation, automation and control. It demands critical and artistic attention.\n\nhttps://machinelistening.exposed/curriculum/\n\nFinancial support from patrons at any level has a resounding impact on our work. You can support Liquid Architecture’s weekly podcast and our online journal Disclaimer, for new thinking and writing on listening and sound through a Patreon subscription, for as little as $5 a month. \n\nhttps://www.patreon.com/liquidarchitecture\n\nFor the past 20 years, Liquid Architecture has been Australia’s leading organisation for artists working with sound and listening. LA investigates the sounds themselves, but also the ideas communicated about, and the meaning of, sound and listening.",
  "itunes:image": "",
  "enclosure": "",
  "guid": "https://liquidarchitecture.org.au/podcast/halcyon-lawrence-machine-listening",
  "pubDate": "Thu, 07 Jan 2021 08:00:00 +1100",
  "itunes:duration": "64:46",
  "itunes:explicit": "no"
}