{
  "id": "https://bibleinoneyear.org/en/youth/279",
  "title": "Day 279: Can a Leopard Change Its Spots?",
  "description": "Psalm 118:5-14, Jeremiah 13:15–23, Colossians 2:6–15. Is it possible for you too to change? One of the most difficult things in the world is to break a bad habit or to give up sin  In one of today’s passages Jeremiah asks, ‘*Can a leopard change its spots*?’ (Jeremiah 13:23)",
  "pubDate": "Wed, 06 Oct 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/279/?ignore",
  "itunes:duration": "14:20",
  "guid": "enyouth06102021-279",
  "length": 860.29,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 279: Can a Leopard Change Its Spots?",
  "itunes:subtitle": "Psalm 118:5-14, Jeremiah 13:15–23, Colossians 2:6–15. Is it possible for you too to change? One of the most difficult things in the world is to break a bad habit or to give up sin  In one of today’s passages Jeremiah asks, ‘*Can a leopard change its spots*?’ (Jeremiah 13:23)",
  "itunes:summary": "Brian Emmett was a career criminal in south London – a drug smuggler and gangster and contemporary of the notorious Kray twins, who he knew well.\nBrian had a son called Michael, who joined ‘the family business’ at a young age. Father and son worked together as international drug smugglers. Their activities were very successful until, one night, they were arrested as part of a massive police operation involving twelve armed officers and sixty regulars in a small Devon fishing port, where a hoard of four metric tonnes of cannabis with a street value of £13 million was being landed.\nAt the time, it was the largest ever known importation of cannabis to the UK and they were each sentenced to twelve and a half years in prison.\nIn 1994, Brian and Michael heard about Alpha while in Exeter Prison and decided to give it a try. They were filled with the Holy Spirit and their lives were completely transformed.\nAs father and son continued to serve their sentences, they were regularly transferred from prison to prison throughout England as is the normal practice. On arrival in each one, they introduced Alpha and more and more prisoners experienced the love of God for the first time.\nFrom those beginnings, Alpha in Prison has grown. Last year, over 50,000 men and women did Alpha in prisons in dozens of countries around the world.\nWhen I interviewed Michael, I asked him what difference Jesus has made. He replied, ‘I was a drug addict for years, entrenched with crime. I looked the part but inside I was very broken. There was a hole inside of me that I tried to fill with things that didn’t work. Jesus is real. He did an inside job on me. The change is dramatic – healing and changing, transforming my mind and heart. The curse has been broken over my family.’\nBrian and Michael’s lives were changed because Jesus set them free from their addictions and the sin that was destroying their lives. After lives of crime and lawlessness, they never went to prison again.\nIs it possible for you too to change? One of the most difficult things in the world is to break a bad habit or to give up sin. In one of today’s passages Jeremiah asks, ‘Can a leopard change its spots?’ (Jeremiah 13:23).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 279
}