{
  "title": "Building with nanoparticles, from the bottom up",
  "link": "https://news.mit.edu/2022/nanoparticles-printing-silicon-1026",
  "description": "Researchers develop a technique for precisely arranging nanoscale particles on a surface, such as a silicon chip, that doesn’t damage the material.",
  "pubDate": "Wed, 26 Oct 2022 14:00:00 -0400",
  "guid": "https://news.mit.edu/2022/nanoparticles-printing-silicon-1026",
  "dc:creator": "Adam Zewe | MIT News Office",
  "content:encoded": "<p>Researchers at MIT have developed a technique for precisely controlling the arrangement and placement of nanoparticles on a material, like the silicon used for computer chips, in a way that does not damage or contaminate the surface of the material.</p>\n\n<p></p>\n\n<p>The technique, which combines chemistry and directed assembly processes with conventional fabrication techniques, enables the efficient formation of high-resolution, nanoscale features integrated with nanoparticles for devices like sensors, lasers, and LEDs, which could boost their performance.</p>\n\n<p></p>\n\n<p>Transistors and other nanoscale devices are typically fabricated from the top down — materials are etched away to reach the desired arrangement of nanostructures. But creating the smallest nanostructures, which can enable the highest performance and new functionalities, requires expensive equipment and remains difficult to do at scale and with the desired resolution.</p>\n\n<p></p>\n\n<p>A more precise way to assemble nanoscale devices is from the bottom up. In one scheme, engineers have used chemistry to “grow” nanoparticles in solution, drop that solution onto a template, arrange the nanoparticles, and then transfer them to a surface. However, this technique also involves steep challenges. First, thousands of nanoparticles must be arranged on the template efficiently. And transferring them to a surface typically requires a chemical glue, large pressure, or high temperatures, which could damage the surfaces and the resulting device. &nbsp;</p>\n\n<p></p>\n\n<p>The MIT researchers developed a new approach to overcome these limitations. They used the powerful forces that exist at the nanoscale to efficiently arrange particles in a desired pattern and then transfer them to a surface without any chemicals or high pressures, and at lower temperatures. Because the surface material remains pristine, these nanoscale structures can be incorporated into components for electronic and optical devices, where even minuscule imperfections can hamper performance.</p>\n\n<p></p>\n\n<p>“This approach allows you, through engineering of forces, to place the nanoparticles, despite their very small size, in deterministic arrangements with single-particle resolution and on diverse surfaces, to create libraries of nanoscale building blocks that can have very unique properties, whether it is their light-matter interactions, electronic properties, mechanical performance, etc.,” says Farnaz Niroui, the EE Landsman Career Development Assistant Professor of Electrical Engineering and Computer Science (EECS) at MIT, a member of the MIT Research Laboratory of Electronics, and senior author on a new paper describing the work. “By integrating these building blocks with other nanostructures and materials we can then achieve devices with unique functionalities that would not be readily feasible to make if we were to use the conventional top-down fabrication strategies alone.”</p>\n\n<p></p>\n\n<p>The research is published today in <em>Science Advances.</em> Niroui’s co-authors are lead author Weikun “Spencer” Zhu, a graduate student in the Department of Chemical Engineering, as well as EECS graduate students Peter F. Satterthwaite, Patricia Jastrzebska-Perfect, and Roberto Brenes.</p>\n\n<p></p>\n\n<p><strong>Use the forces</strong></p>\n\n<p></p>\n\n<p>To begin their fabrication method, known as nanoparticle contact printing, the researchers use chemistry to create nanoparticles with a defined size and shape in a solution. To the naked eye, this looks like a vial of colored liquid, but zooming in with an electron microscope would reveal millions of cubes, each just 50 nanometers in size. (A human hair is about 80,000 nanometers wide.)</p>\n\n<p></p>\n\n<p>The researchers then make a template in the form of a flexible surface covered with nanoparticle-sized guides, or traps, that are arranged in the shape they want the nanoparticles to take. After adding a drop of nanoparticle solution to the template, they use two nanoscale forces to move the particles into the right position. The nanoparticles are then transferred onto arbitrary surfaces.</p>\n\n<p></p>\n\n<p>At the nanoscale, different forces become dominant (just like gravity is a dominant force at the macroscale). Capillary forces are dominant when the nanoparticles are in liquid and van der Waals forces are dominant at the interface between the nanoparticles and the solid surface they are in contact with. When the researchers add a drop of liquid and drag it across the template, capillary forces move the nanoparticles into the desired trap, placing them precisely in the right spot. Once the liquid dries, van der Waals forces hold those nanoparticles in position.</p>\n\n<p></p>\n\n<p>“These forces are ubiquitous and can often be detrimental when it comes to the fabrication of nanoscale objects as they can cause the collapse of the structures. But we are able to come up with ways to control these forces very precisely to use them to control how things are manipulated at the nanoscale,” says Zhu.</p>\n\n<p></p>\n\n<p>They design the template guides to be the right size and shape, and in the precisely proper arrangement so the forces work together to arrange the particles. The nanoparticles are then printed onto surfaces without a need for any solvents, surface treatments, or high temperatures. This keeps the surfaces pristine and properties intact while allowing yields of more than 95 percent. To promote this transfer, the surface forces need to be engineered so that the van der Waals forces are strong enough to consistently promote particles to release from the template and attach to the receiving surface when placed in contact.</p>\n\n<p></p>\n\n<p></p>\n\n<p><strong>Unique shapes, diverse materials, scalable processing</strong></p>\n\n<p></p>\n\n<p>The team used this technique to arrange nanoparticles into arbitrary shapes, such as letters of the alphabet, and then transferred them to silicon with very high position accuracy. The method also works with nanoparticles that have other shapes, such as spheres, and with diverse material types. And it can transfer nanoparticles effectively onto different surfaces, like gold or even flexible substrates for next-generation electrical and optical structures and devices.</p>\n\n<p></p>\n\n<p>Their approach is also scalable, so it can be extended to be used toward fabrication of real-world devices.</p>\n\n<p></p>\n\n<p>Niroui and her colleagues are now working to leverage this approach to create even more complex structures and integrate it with other nanoscale materials to develop new types of electronic and optical devices.</p>\n\n<p></p>\n\n<p>This work was supported, in part, by the National Science Foundation (NSF) and the NSF Graduate Research Fellowship Program.</p>",
  "media:content": {
    "media:description": "Farnaz Niroui (right) and graduate student Spencer Zhu in their lab in a cleanroom at the MIT.nano building.",
    "media:credit": "Image: M. Scott Brauer"
  },
  "category": [
    "Research",
    "Nanoscience and nanotechnology",
    "Electronics",
    "Materials science and engineering",
    "Chemistry",
    "MIT.nano",
    "Research Laboratory of Electronics",
    "Electrical Engineering & Computer Science (eecs)",
    "School of Engineering",
    "MIT Schwarzman College of Computing",
    "National Science Foundation (NSF)"
  ]
}