{
  "title": "Climate Change Is NSF Engineering Alliance’s Top Research Priority",
  "link": "https://spectrum.ieee.org/nsf-engineering-alliance-climate-change",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/earth-with-different-circles-of-climate-change-options-around-it.jpg?id=31788673&width=1200&height=800&coordinates=218%2C0%2C219%2C0\"/><br/><br/><p>Since its <a href=\"https://spectrum.ieee.org/nsf-engineering-alliance-to-help-set-course-for-research\" target=\"_self\">launch in April 2021</a>, the <a href=\"http://www.ervacommunity.org/\" rel=\"noopener noreferrer\" target=\"_blank\">Engineering Research Visioning Alliance</a> has convened a diverse set of experts to explore three areas in which fundamental research could have the most impact: climate change; the nexus of biology and engineering; and securing critical infrastructure against hackers.</p><p>To identify priorities for each theme, ERVA—an initiative funded by the U.S. <a href=\"https://www.nsf.gov/eng/about.jsp\" rel=\"noopener noreferrer\" target=\"_blank\">National Science Foundation</a>—holds what are termed visioning events, wherein IEEE members and hundreds of other experts from academia, industry, and nonprofits can conceptualize bold ideas. The results are distilled into reports that identify actionable priorities for engineering research pursuit. Reports from recent visioning events are slated to be released to the public in the next few months. </p><hr/><p>IEEE is one of more than 20 professional engineering societies that have joined ERVA as <a href=\"https://www.ervacommunity.org/affiliates/\" rel=\"noopener noreferrer\" target=\"_blank\">affiliate partners</a>.</p><h2>Research energy storage and greenhouse gas capture solutions </h2><p>Identifying technologies to address the climate crisis was ERVA’s first theme. The theme was based on results of a survey ERVA conducted last year of the engineering community about what the research priorities should be.</p><p>“The resounding answer from the 500 respondents was climate change,” says <a href=\"https://www.ervacommunity.org/profile/dorota-grejner-brzezinska/\" rel=\"noopener noreferrer\" target=\"_blank\">Dorota Grejner-Brzezinska</a>, EVRA’s principal investigator. She is a vice president for knowledge enterprise at <a href=\"https://www.osu.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Ohio State University</a>, in Columbus.</p><p>During the <a href=\"https://www.ervacommunity.org/event/visioning-event-the-role-of-engineering-in-addressing-climate-change/\" rel=\"noopener noreferrer\" target=\"_blank\">virtual visioning event</a> in December, experts explored solar and renewable energy, carbon sequestration, water management, and geoengineering. The climate change task force released its <a href=\"https://www.ervacommunity.org/visioning-report/visioning-event-report/\" rel=\"noopener noreferrer\" target=\"_blank\">report</a> last month.</p><p>These are some of the research areas ERVA said should be pursued:</p><ul><li>Energy storage, transmission, and critical materials. The materials include those that are nanoengineered, ones that could be used for nontraditional energy storage, and those that can extract additional energy from heat cycles.</li><li>Greenhouse gas capture and elimination. Research priorities included capturing and eliminating methane and nitrous oxide released in agriculture operations.</li><li>Resilient, energy-efficient, and healthful infrastructure. One identified priority was research to develop low-cost coatings for buildings and roads to reduce heat effects and increase self-cooling.</li><li>Water, ecosystem, and geoengineering assessments. The report identifies research in creating sensing, measuring, and AI models to analyze the flow of water to ensure its availability during droughts and other disruptive events caused or worsened by climate change.</li></ul><p>“The groundwork ERVA has laid out in this report creates a blueprint for funders to invest in,” Grejner-Brzezinska says, “and catalyzes engineering research for a more secure and sustainable world. As agencies and research organizations enact legislation to reduce carbon emissions and bolster clean-energy technologies, engineering is poised to lead with research and development.”</p><p> IEEE is developing a <a href=\"https://spectrum.ieee.org/ieee-plan-combat-climate-change\" target=\"_self\">strategy</a> to guide the organization’s response to the global threat.</p><h2>Use biology and engineering to interrupt the transfer of viruses</h2><p>A virtual <a href=\"https://www.ervacommunity.org/event/visioning-event-biology/2022-03-09/\" rel=\"noopener noreferrer\" target=\"_blank\">visioning event</a> on Leveraging Biology to Power Engineering Impact was held in March. The hope, as explained on the event’s <a href=\"https://www.ervacommunity.org/task-force/leveraging-biology-to-power-engineering-impact/\" rel=\"noopener noreferrer\" target=\"_blank\">website</a>, is to transform research where biology and engineering intersect: health care and medicine, agriculture, and high tech.</p><p class=\"pull-quote\">“As agencies and research organizations enact legislation to reduce carbon emissions and bolster clean-energy technologies, engineering is poised to lead with research and development.”</p><p>The experts considered research directions in three areas: Use biology to inspire engineers to develop new components, adapt and adopt biological constructs beyond their original function, and create engineering systems and components that improve on biology. An example would be to interrupt the transfer of viruses from one species to another so as to reduce the spread of diseases.</p><p>The task force’s report on which research areas to pursue is scheduled to be released next month, according to Grejner-Brzezinska.</p><h2>Protect infrastructure from hackers</h2><p>One of today’s main engineering challenges, according to ERVA, is the protection of infrastructure against hackers and other threats. At the in-person <a href=\"https://www.ervacommunity.org/event/engineering-rd-solutions-for-unhackable-infrastructure/\" rel=\"noopener noreferrer\" target=\"_blank\">visioning event</a> held last month at <a href=\"http://mit.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">MIT</a> on the <a href=\"https://www.ervacommunity.org/event/engineering-rd-solutions-for-unhackable-infrastructure/\" rel=\"noopener noreferrer\" target=\"_blank\">Engineering R&D Solutions for Unhackable Infrastructure</a> theme, researchers discussed gaps in security technologies and looked at how to design trustworthy systems and how to build resilience into interdependent infrastructures.</p><p>ERVA describes <em>unhackable</em> as the ability to ensure safety, security, and trust in essential systems and services that society relies on.</p><p>The task force examined research themes related to physical infrastructure such as assets and hardware; software and algorithms; and data and communication networks. It also considered new security methods for users, operators, and security administrators to thwart cyberattacks.</p><p><a href=\"https://www.ervacommunity.org/profile/dorota-grejner-brzezinska/\" rel=\"noopener noreferrer\" target=\"_blank\">Grejner-Brzezinska</a> says the task force’s report will be released in mid-December.</p><h2>Sustainable transportation networks</h2><p>Planning has begun for the next visioning event, <a href=\"https://app.smartsheet.com/b/form/a7e65b3fc2d2486dba29cfd719ffdcdc\" rel=\"noopener noreferrer\" target=\"_blank\">Sustainable Transportation Networks</a>, to be held virtually on 2 and 3 November. The session is to explore innovative and sustainable transportation modes and the infrastructure networks needed to support them. Some of the areas to be discussed are green construction; longitudinal impact studies; interconnected transportation modes such as rail, marine, and air transport; and transportation equity.</p>\n<h2>Become an ERVA supporter</h2><p>ERVA will convene four visioning events each year on broad engineering research themes that have the potential to solve societal challenges, Grejner-Brzezinska says. IEEE members who are experts in the fields can get involved by joining the ERVA Champions, now more than 900 strong. They are among the first to learn about upcoming visioning sessions and about openings to serve on volunteer groups such as thematic task forces, advisory boards, and standing councils. Members can <a href=\"https://www.ervacommunity.org/get-involved/\" rel=\"noopener noreferrer\" target=\"_blank\">sign up on the ERVA website</a>.</p><p>“Becoming a champion is an opportunity to break out of your silos of disciplines and really come together with others in the engineering research community,” Grejner-Brzezinska says. “You can do what engineers do best: solve problems.”</p>",
  "pubDate": "Tue, 20 Sep 2022 20:00:00 +0000",
  "guid": "https://spectrum.ieee.org/nsf-engineering-alliance-climate-change",
  "category": [
    "Ieee member news",
    "Climate change",
    "National science foundation",
    "Engineering research visioning alliance",
    "Biology",
    "Cybersecurity",
    "Type:ti"
  ],
  "dc:creator": "Kathy Pretz",
  "media:content": ""
}