{
  "id": "tag:blogger.com,1999:blog-15418143.post-1271268792821663535",
  "published": "2014-01-12T18:37:00.000-05:00",
  "updated": "2016-06-13T07:47:15.836-05:00",
  "category": [
    "",
    "",
    "",
    ""
  ],
  "title": "Can a person-specific face recognition algorithm be used to determine a person's race?",
  "content": "It's a valid question: can a person-specific face recognition algorithm be used to determine a person's race?<br /><br />I trained <b>two separate person-specific face detectors</b>. &nbsp;For each detector I used videos of the target person's face to generate positive examples and faces from [google image search for \"faces\"] as negative examples. &nbsp;This is a fairly straightforward machine learning problem: find a decision boundary between the positive examples and the negative examples. &nbsp;I used the VMX Project recognition algorithm which learns from videos with minimal human supervision. &nbsp;In both cases, I used the VMX webapp for training (training each detector took about ~20 minutes from scratch). &nbsp;In fact, I didn't even have to touch the command line. &nbsp;Since videos were used an input, what I created are essentially full-blown sliding window detectors, meaning that they scan an entire image and can even find small faces. I then ran this detector on the large average male face image. &nbsp;This average face image has been around the internet for a while now and it was created by averaging people's faces. &nbsp;By running the algorithm on this one image, it analyzed all of the faces contained inside and I was able to see which country returned the highest scoring detection!<br /><br /><br /><b><span style=\"font-size: large;\">Experiment #1</span></b><br />For the first experiment, I used a video of my own face. &nbsp;Because I was using a live video stream, I was able to move my face around so that the algorithm saw lots of different viewing conditions. &nbsp;Here is a the output. &nbsp;<b>Notice the green box around \"Poland.\"</b> &nbsp;Pretty good guess, especially since I moved from Poland to the US when I was 8.<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://2.bp.blogspot.com/-Bf3bMqXuXGQ/UtTar6eFZII/AAAAAAAANXs/FFTDVurB4G8/s1600/tomasz_crop.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"320\" src=\"https://3.bp.blogspot.com/-ENZ-749s86g/UtMhEZWaDSI/AAAAAAAANXM/Fa3kaFB10po/s400/tomasz_top_detection.png\" width=\"276\" /></a></div><br /><div style=\"text-align: left;\">Here is a 5 min video (VMX screencapture) of me running the \"Tomasz\" (that's my name in case you don't know) detector as I fly around the average male image. &nbsp;You can see the scores on lots of different races. &nbsp;High scoring detections are almost always on geographically relevant races.</div><div style=\"text-align: left;\"><br /></div><div style=\"text-align: center;\"><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/2-zmU4rIcJA\" width=\"420\"></iframe></div><br /><b><span style=\"font-size: large;\">Experiment #2</span></b><br />For the second target, I used a few videos of <a href=\"http://cs.stanford.edu/people/ang/\">Andrew Ng</a>&nbsp;to get positives.&nbsp; For those of you who don't know, Andrew Ng is a machine learning researcher, entrepreneur, professor at Stanford, and MOOC visionary. &nbsp;Here is the result. &nbsp;<b>Notice the green box around \"Japan.\"</b> &nbsp;Very reasonable answer -- especially since I didn't give the algorithm an extra Asian faces for negatives.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://2.bp.blogspot.com/-2wijfQGhLvM/UtMhQ-cFRgI/AAAAAAAANXU/F03THL7b3ws/s1600/top_andrewng_detection.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"320\" src=\"https://2.bp.blogspot.com/-2wijfQGhLvM/UtMhQ-cFRgI/AAAAAAAANXU/F03THL7b3ws/s400/top_andrewng_detection.png\" width=\"276\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div style=\"text-align: left;\">Here is a 5 min video (VMX screencapture) of me running the \"Andrew Ng\" detector as I fly around the average male image.</div><div style=\"text-align: left;\"><br /></div><div style=\"text-align: center;\"><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/waTAkSGIbcM\" width=\"420\"></iframe></div><div style=\"text-align: center;\"><br /></div><div style=\"text-align: center;\"><br /></div><div style=\"text-align: left;\">In conclusion, <b>person-specific face detectors from VMX can be used to help determine a person's race</b>. &nbsp;At least the two VMX face detectors I trained behaved as expected. &nbsp;This is far from a full-out study, but I only had the chance to try out on two subjects and wanted to share what I found. &nbsp;The underlying algorithm inside VMX is a non-parametric exemplar-based model. &nbsp;During training the algorithm uses ideas from max-margin learning to create a separator between the positives and negatives. &nbsp;</div><div style=\"text-align: left;\"><br /></div><div style=\"text-align: left;\">If you've been following up on my computer vision research projects, you should have a good idea of how these things work. &nbsp;I want to mention that while I showcase VMX being used for face detection, there is nothing face-specific inside the algorithm. &nbsp;The same representation is used for bottles, cars, hands, mouths, etc. &nbsp;<b>VMX is a general purpose object recognition ecosystem</b> and we're excited to finally be releasing this technology to the world.<br /><br />There are lots of cool applications of VMX detectors. &nbsp;What app will <i>you</i> build?</div><div style=\"text-align: left;\"><br /></div><div style=\"text-align: left;\">To learn more about VMX and get-in on the action, simply checkout the <a href=\"http://www.kickstarter.com/projects/visionai/vmx-project-computer-vision-for-everyone\">VMX Kickstarter project</a>&nbsp;and back our campaign.&nbsp;&nbsp;</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Tomasz Malisiewicz",
    "uri": "http://www.blogger.com/profile/17507234774392358321",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 1
}