{
  "title": "TU97: The Dynamic Maturational Model (DMM) of Attachment With Guest Patricia Crittenden (Part 2)",
  "link": "https://therapistuncensored.com/episodes/tu97-the-dynamic-maturational-model-dmm-of-attachment-with-guest-patricia-crittenden-part-2/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu97-the-dynamic-maturational-model-dmm-of-attachment-with-guest-patricia-crittenden-part-2",
  "pubDate": "Wed, 29 May 2019 22:31:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7153",
  "description": "Note: This episode is Part 2 of 2. It stands alone, but to start at Part 1 click HERE.  \n\n“So which strategy in this model is best? Every behavioral strategy is the right strategy for some problem, but no strategy is the best strategy for every problem. We need them all.” \n\n– Dr Patricia Crittenden, creator of the Dynamic Maturational Model of Attachment & Adaptation (DMM) using culture and context.\nLOOKING FOR THE SLIDES?\nDOWNLOAD THE PDF HERE: Rudiments-of-the-DMM-PDF VERSION \nOR THE POWERPOINT VERSION HERE:  Rudiments of the DMM Powerpoint version \nOr if you have great eyesight :) you can view them here.\n\n          \n\n \nTherapist Uncensored Episode 97 Show Notes:\nBefore we begin:\n\n \tA’s (Red in the DMM)=Historically referred to as Blue on TU\n \tB’s (Blue in the DMM)=Historically referred to as Green on TU\n \tC’s (Green in the DMM)=Historically referred to as Red on TU\n \tAC’s = Historically referred to Tie Dye on TU\n\n**Note: We know the colors may be a bit confusing, but it is important to us that you receive information as Dr Crittenden has published it. It is by happenstance that our colors are the same (with the exception of tie dye), but they represent different thinking and behavioral patterns. When we refer to color in the episodes and in the show notes, we are referring to the colors we have historically used on the TU podcast and the letters and self-protective strategies of the DMM. This is only in order to maintain consistency and make the information more easily understood by our listeners. However, the colors as shown in the slides and as listed above, are the way Dr Crittenden uses them in her fantastic work!\nLet’s Dive In:\nTo understand self-protective strategies, we have to understand the information the brain is using, even in infancy – it’s neurological.\n\nA’s, the B’s and the C’s emphasize different sorts of information.\n\nStrategies by Age Group and Model Representation:\n\n \nInfancy\nDMM                           Ainsworth                ABC+D\n\nA-2: Avoidant                           A1-2                    A1-2\n\nB1-2: Reserved                    B1-4                    B1-4\n\nB3: Comfortable                    C1                       C1-2\n\nB4-5: Reactive                                              D-Controlling\n\nC1-2: Resistant/Passive\n\n \nPreschool\n\n \tPreschoolers utilize false positive affect.\n \tA’s split their own self from the other, and they focus on the parent. They take the perspective of the powerful person.\n \tC’s split their negative affect, showing either the vulnerable or the invulnerable affect. They hide the other from view.\n\nDMM                             Ainsworth               ABC+D\n\nA1-2: Avoidant                                                 A1-2\n\nA3-4: Compulsively Caregiving/Compliant      B1-4\n\nB1-2: Reserved                                               C1-2\n\nB3: Comfortable                                               D-Controlling\n\nB4-5: Reactive\n\nC1-2: Resistant/Passive\n\nC3-4: Aggressive/Feigned Helpless\nSchool Age\nDMM                             Ainsworth               ABC+D\n\nA1-2: Avoidant                                                 A1-2\n\nA3-4: Compulsively Caregiving/Compliant                       B1-4\n\nB1-2: Reserved                                                C1-2\n\nB3: Comfortable                                          D-Controlling\n\nB4-5: Reactive\n\nC1-2: Resistant/Passive\n\nC3-4: Aggressive/Feigned Helpless\n\nC5-6: Punitive/Seductive\n\n \nAdolescence\nDMM                             Ainsworth               ABC+D\n\nA1-2: Avoidant                                                 A1-2\n\nA3-4: Compulsively Caregiving/Compliant                        B1-4\n\nA5-6: Compulsively Promiscuous/Self-Reliant                    C1-2\n\nB1-2: Reserved                                          U/Cannot Classify\n\nB3: Comfortable\n\nB4-5: Reactive\n\nC1-2: Resistant/Passive",
  "enclosure": "",
  "itunes:subtitle": "Note: This episode is Part 2 of 2. It stands alone, but to start at Part 1 click HERE.   - “So which strategy in this model is best? Every behavioral strategy is the right strategy for some problem, but no strategy is the best strategy for every probl...",
  "itunes:summary": "Discover a new voice and unique perspective in the treatment and assessment of attachment injuries.  Dr. Patricia Crittenden shares her model, the Dynamic Maturational Model of Attachment and Adaptation, and uses her rich international background to deepen our understanding of culture and context on self-survival strategies.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "56:28"
}