{
  "title": "Over-communicate no more: Situated RL agents learn concise communication protocols. (arXiv:2211.01480v1 [cs.MA])",
  "link": "http://arxiv.org/abs/2211.01480",
  "description": "<p>While it is known that communication facilitates cooperation in multi-agent\nsettings, it is unclear how to design artificial agents that can learn to\neffectively and efficiently communicate with each other. Much research on\ncommunication emergence uses reinforcement learning (RL) and explores\nunsituated communication in one-step referential tasks -- the tasks are not\ntemporally interactive and lack time pressures typically present in natural\ncommunication. In these settings, agents may successfully learn to communicate,\nbut they do not learn to exchange information concisely -- they tend towards\nover-communication and an inefficient encoding. Here, we explore situated\ncommunication in a multi-step task, where the acting agent has to forgo an\nenvironmental action to communicate. Thus, we impose an opportunity cost on\ncommunication and mimic the real-world pressure of passing time. We compare\ncommunication emergence under this pressure against learning to communicate\nwith a cost on articulation effort, implemented as a per-message penalty (fixed\nand progressively increasing). We find that while all tested pressures can\ndisincentivise over-communication, situated communication does it most\neffectively and, unlike the cost on effort, does not negatively impact\nemergence. Implementing an opportunity cost on communication in a temporally\nextended environment is a step towards embodiment, and might be a pre-condition\nfor incentivising efficient, human-like communication.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Kalinowska_A/0/1/0/all/0/1\">Aleksandra Kalinowska</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Davoodi_E/0/1/0/all/0/1\">Elnaz Davoodi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Strub_F/0/1/0/all/0/1\">Florian Strub</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Mathewson_K/0/1/0/all/0/1\">Kory W Mathewson</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kajic_I/0/1/0/all/0/1\">Ivana Kajic</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Bowling_M/0/1/0/all/0/1\">Michael Bowling</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Murphey_T/0/1/0/all/0/1\">Todd D Murphey</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Pilarski_P/0/1/0/all/0/1\">Patrick M Pilarski</a>"
}