{
  "title": "2: Episode 2",
  "link": "https://audioboom.com/posts/7316358",
  "itunes:episode": 2,
  "itunes:title": "Episode 2",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 2215,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On our August 14, 2005 edition of MuggleCast…<br>\n<br>\n\n</div>\n<div>The Goblet of Fire and American Pie… two movies with something in common? As the fourth HP film receives a verdict on its official rating, the jury is still out on Draco Malfoy. From Ontario to Missouri, the people want to know… just who will the newest Death Eater side with? And as the clock counts down to a South Pacific world premiere, just whose time will be up by the end of Book 7? Two years… too long to conceal our thoughts. Plus, while our favorite wandmaker has gone missing, something huge was discovered about Lily Potter.<br>\n<br>\n\n</div>\n<div>From Dark Marks to Dark Secrets… all that and more ahead with Andrew, Kevin, and a special co-host on this edition of MuggleCast.<br>\n<br>\n\n</div>\n<ul>\n<li>Special co-host: Aris Janetakos</li>\n<li>Special guest announcer: Ben Schoen (after feeling bad he missed out on taping the actual podcast)</li>\n<li>Bear with poor Kevin…he’s got a wisdom tooth coming in</li>\n<li>Main Topic: GOF is rated PG-13</li>\n<li>Andrew says this one will appeal to more teens, less parent/child groups</li>\n<li>Deaths = given PG-13</li>\n<li>We think movies 5, 6, and 7 will also receive this prestigious award</li>\n<li>Whose side is Draco on?</li>\n<li>Aris and Kevin think Draco’s going to end up helping Harry</li>\n<li>What did the Pensieve mean?</li>\n<li>Unbreakable Vows… what are the rules?</li>\n<li>Snape loves Lily</li>\n<li>Poor Ollivander…where could he have gone? (Andrew’s expecting a letter from him soon)</li>\n</ul>\n",
  "pubDate": "Sun, 14 Aug 2005 00:00:00 +0000",
  "guid": "tag:audioboom.com,2019-07-15:/posts/7316358",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}