{
  "title": "DriveFuzz: Discovering Autonomous Driving Bugs through Driving Quality-Guided Fuzzing. (arXiv:2211.01829v1 [cs.RO])",
  "link": "http://arxiv.org/abs/2211.01829",
  "description": "<p>Autonomous driving has become real; semi-autonomous driving vehicles in an\naffordable price range are already on the streets, and major automotive vendors\nare actively developing full self-driving systems to deploy them in this\ndecade. Before rolling the products out to the end-users, it is critical to\ntest and ensure the safety of the autonomous driving systems, consisting of\nmultiple layers intertwined in a complicated way. However, while\nsafety-critical bugs may exist in any layer and even across layers, relatively\nlittle attention has been given to testing the entire driving system across all\nthe layers. Prior work mainly focuses on white-box testing of individual layers\nand preventing attacks on each layer.\n</p>\n<p>In this paper, we aim at holistic testing of autonomous driving systems that\nhave a whole stack of layers integrated in their entirety. Instead of looking\ninto the individual layers, we focus on the vehicle states that the system\ncontinuously changes in the driving environment. This allows us to design\nDriveFuzz, a new systematic fuzzing framework that can uncover potential\nvulnerabilities regardless of their locations. DriveFuzz automatically\ngenerates and mutates driving scenarios based on diverse factors leveraging a\nhigh-fidelity driving simulator. We build novel driving test oracles based on\nthe real-world traffic rules to detect safety-critical misbehaviors, and guide\nthe fuzzer towards such misbehaviors through driving quality metrics referring\nto the physical states of the vehicle.\n</p>\n<p>DriveFuzz has discovered 30 new bugs in various layers of two autonomous\ndriving systems (Autoware and CARLA Behavior Agent) and three additional bugs\nin the CARLA simulator. We further analyze the impact of these bugs and how an\nadversary may exploit them as security vulnerabilities to cause critical\naccidents in the real world.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Kim_S/0/1/0/all/0/1\">Seulbae Kim</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_M/0/1/0/all/0/1\">Major Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Rhee_J/0/1/0/all/0/1\">Junghwan &quot;John&quot; Rhee</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Jeon_Y/0/1/0/all/0/1\">Yuseok Jeon</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kwon_Y/0/1/0/all/0/1\">Yonghwi Kwon</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kim_C/0/1/0/all/0/1\">Chung Hwan Kim</a>"
}