{
  "id": "tag:blogger.com,1999:blog-2499715909956774229.post-2858997004368447661",
  "published": "2019-01-01T12:59:00.000-08:00",
  "updated": "2019-01-01T15:09:04.126-08:00",
  "title": "The Fed and the New Year",
  "content": "Much of the first two years of the Trump administration was unexpectedly good for the Fed. Appointees to the Board of Governors - Quarles, Bowman, Clarida - are actually qualified to do their jobs, in contrast to most of the folks now inhabiting the executive branch. Trump may have been willing to ditch Janet Yellen (for no obvious reason other than that she was appointed by Obama), but he replaced her with a Fed insider, Jay Powell, who has more or less maintained the status quo. On some dimensions, Powell is an improvement on Yellen, particularly in the communications department. The FOMC's post-meeting statements are less wordy and belabored, the press conferences are more fluid, and the pressers will now take place after all 8 FOMC meetings in the coming year, which officially makes all meetings \"live.\" The previous fiction had been that important Fed moves could happen at any meeting, but everyone knew this was not the case. Indeed, of the 9 interest rate hikes that occurred from December 2015 through December 2018, none came after a non-presser FOMC meeting.<br /><br />The quiet central banking life ended for the Fed late last year, when Trump needed a scapegoat for a tanking stock market. The Fed is now a regular Presidential tweet subject, and Powell's job is on the line. Welcome to the club, Fed, you're now on Trump's radar screen. Perhaps Powell can take solace in the belief that, even if Trump could fire him, he won't, as a scapegoat can no longer serve his or her purpose if removed from the scene.<br /><br />But is the Fed doing the right thing? And what's in store for 2019? In terms of achieving its Congressional mandate, as it <a href=\"https://www.federalreserve.gov/monetarypolicy/files/FOMC_LongerRunGoals.pdf\">interprets that mandate,</a> the Fed is doing a great job. Inflation is on target:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-unN8rPWtQHY/XCuTCmPoLhI/AAAAAAAADWE/hdVO17rLXjk1iSbowISHbaeDt3yFZjh1wCLcBGAs/s1600/inflation.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-unN8rPWtQHY/XCuTCmPoLhI/AAAAAAAADWE/hdVO17rLXjk1iSbowISHbaeDt3yFZjh1wCLcBGAs/s640/inflation.png\" width=\"640\" height=\"280\" data-original-width=\"1075\" data-original-height=\"470\" /></a></div>The labor market is tighter than it's been since the BLS began collecting JOLTS data: <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-CK5HN5dmFtc/XCuTYU6DAbI/AAAAAAAADWM/qOsn-HqOS04Z3zCu63az3e_rq3OliOAlgCLcBGAs/s1600/tightness.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://3.bp.blogspot.com/-CK5HN5dmFtc/XCuTYU6DAbI/AAAAAAAADWM/qOsn-HqOS04Z3zCu63az3e_rq3OliOAlgCLcBGAs/s640/tightness.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>And real GDP is growing at a good clip, relative to the post-recession history: <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/--grT6iiBoh4/XCuTwfuorJI/AAAAAAAADWU/0cNQsdtSdJEZnm5etXANx3ziuWtedSFNQCLcBGAs/s1600/rgdpb.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/--grT6iiBoh4/XCuTwfuorJI/AAAAAAAADWU/0cNQsdtSdJEZnm5etXANx3ziuWtedSFNQCLcBGAs/s640/rgdpb.png\" width=\"640\" height=\"521\" data-original-width=\"1031\" data-original-height=\"839\" /></a></div>Of course, we could have said the same thing a year ago, when the Fed was achieving its inflation target, the labor market was very tight, and real GDP was growing at a good clip. Yet, the FOMC raised the target range for the fed funds rate four times during the year, and seems set to do the same thing two more times in 2019 before it stops, providing the economy stays roughly in the same place. What is the Fed trying to fix, exactly?<br /><br />One place we could look for enlightenment is in the public statements of John Williams, President of the New York Fed, and Vice Chair of the FOMC. Williams has been with the Fed for essentially his whole career. He's also an economist, and accustomed to explaining technical stuff to people who don't normally think about it. Two of Williams's recent speeches deal with <a href=\"https://www.newyorkfed.org/newsevents/speeches/2018/wil181130\">low real interest rates</a> and <a href=\"https://www.newyorkfed.org/newsevents/speeches/2018/wil181009\">monetary policy normalization.</a> The bottom line from those is that the Fed is normalizing, normalization is good, and the new normal will feature a long-run nominal interest rate that is lower than in the past, as the real interest rate has fallen, and is expected to stay low. So, Williams's views about the long-run real rate of interest inform how he thinks about \"normal.\" Those views seem to be in line with the \"dot plot\" from the FOMC's <a href=\"https://www.federalreserve.gov/monetarypolicy/files/fomcprojtabl20181219.pdf\">December 2018 projections:</a> <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-B6GUIWXbNXU/XCu53iWtbNI/AAAAAAAADWg/RutLhQOvDA8jXdhF45kLoD36gFbfoH_igCLcBGAs/s1600/dotplotb.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://3.bp.blogspot.com/-B6GUIWXbNXU/XCu53iWtbNI/AAAAAAAADWg/RutLhQOvDA8jXdhF45kLoD36gFbfoH_igCLcBGAs/s640/dotplotb.png\" width=\"640\" height=\"441\" data-original-width=\"1341\" data-original-height=\"924\" /></a></div>Recall that each dot is associated with an FOMC participant (no names attached), and represents that member's projection for the year-end fed funds rate. The median projection for the long run is 2.8% so, given the inflation target of 2%, the committee thinks the long run real interest rate is about 0.8%.<br /><br />Estimates of the long-run real interest rate differ considerably, as coming up with such estimates requires a model, and there are many of those to choose from. Alternatively, a proxy for the overnight real interest rate is the three-month T-bill rate minus the core inflation rate:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-JjLa0dWe1S8/XCvBc2OJcOI/AAAAAAAADWw/TGINwRqx3pYyKGRbgJolo1J-6STiwpaewCLcBGAs/s1600/realrate.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-JjLa0dWe1S8/XCvBc2OJcOI/AAAAAAAADWw/TGINwRqx3pYyKGRbgJolo1J-6STiwpaewCLcBGAs/s640/realrate.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>As well, we could look at TIPS yields:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-BRkF4VqSGo4/XCvB5lBv8eI/AAAAAAAADW8/jRyXoIUKk1MQr-fs58RCFQ0wRJ2k4BO6gCLcBGAs/s1600/yieldreal.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-BRkF4VqSGo4/XCvB5lBv8eI/AAAAAAAADW8/jRyXoIUKk1MQr-fs58RCFQ0wRJ2k4BO6gCLcBGAs/s640/yieldreal.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>So, by those measures real interest rates on safe assets have been increasing. One reason for that is what the Fed has been doing. Conventional macro models tell us that, in response to a nominal interest rate increase, the real rate increases in the short run, and then falls, with inflation ultimately increasing one-for-one with the nominal interest rate as the long-run Fisher effect sets in. This might give the Fed cause for concern, as it tells us that inflation (absent the effects of changes in the relative price of crude oil) could overshoot the 2% inflation target, even if the FOMC does not hike the fed funds target range this year. In other words, 0.8% may be too high an estimate for the long run real rate - maybe zero is more accurate.<br /><br />However, we may have good reasons to think that the real interest rate is rising for reasons independent of the Fed's interest rate policy. As I noted <a href=\"http://newmonetarism.blogspot.com/2018/08/feds-portfolio-manager-says-not-to-worry.html\">in a previous blog post,</a> recent developments in the overnight financial markets suggest that the Fed itself may have been responsible for some downward pressure on the real interest rate. That is, the Fed's large scale asset purchases, typically thought to work by lowering long-term bond yields, may have contributed in an important way to a safe asset shortage, noted by John Williams as an important cause of low real interest rates (though Williams didn't mentioned the Fed's role in contributing to the shortage). Treasury securities and mortgage-backed securities are an important source of collateral in secured overnight credit markets, so by purchasing these securities and replacing them with inferior reserves, the Fed contributed to a collateral shortage. The phasing out of the Fed's reinvestment program, from October 2017 to October 2018, helped to relieve this collateral shortage, moving overnight repo rates and T-bill rates up to the vicinity of the interest rate on reserves. Fed officials typically attribute these developments to an increased supply of Treasury bills, but the timing relative to the phasing out of reinvestment is difficult to ignore. In any case, we could make a case that mitigation of the safe asset shortage is putting upward pressure on the real interest rate.<br /><br />So, maybe a long-run real interest rate of 0.8% isn't far-fetched. The Fed appears to be getting skittish about further interest rate increases, and language about \"accommodation\" has been removed from the FOMC statements. The FOMC appears to be planning at most an increase of 50 basis points in the fed funds rate range over the next year, which is not likely to be a big deal in terms of real effects, and the FOMC is very likely to back off in response to negative data. Given what we know, I'm finding it harder to quarrel with what the Fed's doing.<br /><br />Things to look out for in 2019:<br /><br />1. <i>The Fed's balance sheet:</i> In the <a href=\"https://www.federalreserve.gov/monetarypolicy/files/fomcminutes20181108.pdf\">November 2018 meeting,</a> the FOMC discussed issues concerning the long-run implementation of policy. Will the Fed conduct policy with a small balance sheet in a corridor system, as is done in other countries (Canada, for example), or continue with the current large-balance-sheet floor system? This will involve a decision about when to resume asset purchases. The Fed will be making this decision in consultation with the public - a new approach for them. It will be interesting to see how the public consultation works, but the Fed could look to the Bank of Canada for guidance on that. Every 5 years the Bank of Canada renews its agreement with the federal government (currently an inflation-targeting agreement), and precedes the renewal with extensive consultation with the general public, academics, and think tanks. That works well I think - it's a different institutional environment, but the approach could be adapted.<br /><br />2. <i>Appointments:</i> There are currently two vacancies on the Board of Governors. Marvin Goodfriend was nominated, and approved by the Senate Banking Committee, but his appointment may be dead. Is Trump going to weigh in on the next nominations - Sean Hannity on the Board, or some such? Among the Presidents of the regional Feds, most have not been in office long, and there are no anticipated departures, so far as I know, so probably not much going on there.<br /><br />3. <i>Voting FOMC Members:</i> Presidents of regional Feds who vote this year are: Williams (NY), Evans (Chicago), Rosengren (Boston), Bullard (St. Louis), and George (Kansas City). All of these, except Bullard, are currently hawkish. No reason to expect any changes in policy soon, but Rosengren and Evans will likely turn dovish at the first sign of weakness in the real economy.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Stephen Williamson",
    "uri": "http://www.blogger.com/profile/01434465858419028592",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 4
}