{
  "id": "tag:blogger.com,1999:blog-2499715909956774229.post-3101295186623911765",
  "published": "2019-10-27T17:54:00.002-07:00",
  "updated": "2019-10-27T17:56:23.282-07:00",
  "title": "An Attempt to Sort out the Fed's Overnight Market Issues",
  "content": "First, we'll get up to speed on the state of monetary policy implementation in the United States of America, in case you haven't been paying attention. After the financial crisis, the Fed substantially increased the size of its balance sheet, primarily through the purchase of long-maturity Treasury securities and mortgage-backed securities. On the liabilities side of the balance sheet, the Fed has seen a steady increase over the last 10 years in the quantity of Federal Reserve notes (currency) outstanding, but the primary source of funding for the increase in securities-held-outright by the Fed is an increase in the reserve balances held by financial institutions. This increase in reserves outstanding necessitated a floor-system approach to targeting overnight interest rates. That is, once there is a sufficiently large quantity of reserves outstanding, the interest rate on reserves (IOER) should, in theory, peg all overnight interest rates, through financial arbitrage. Basically, financial institutions should be indifferent in a floor system between lending to the Fed overnight and lending to other financial institutions overnight. Whether this approach to day-to-day overnight credit market intervention is better or worse than the approach taken before the financial crisis was not a matter of concern for the Fed when it embarked on its balance sheet expansion. The floor system simply came with the large-scale asset purchases (QE) that were part of the Fed's post-financial crisis approach. The initial understanding, going back at least to 2011, was that the Fed would eventually revert to \"normal,\" that is the Fed's policy rate would rise, and the quantity of reserves outstanding would revert to the neighborhood of, say, $10-$15 billion, as before the crisis.<br /><br />Well, normalization never happened, either with respect to interest rate policy or balance sheet policy. The Fed backed off its interest rate hikes, reversed direction, and certainly does not seem on the road to pegging short term interest rates in the ballpark of what would be commensurate with sustaining 2% inflation. Remember, sustained low nominal interest rates just creates sustained low inflation. Just ask the Bank of Japan. On balance sheet policy, there was a modest reduction in the Fed's total assets between late 2017 and this August, of about $600 billion:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-MBgpXtdNEIk/XbXaPE4B_fI/AAAAAAAADqc/V2C2-N84JeU1cRyVIDzvCAVD6bDylblawCNcBGAsYHQ/s1600/fedassets.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-MBgpXtdNEIk/XbXaPE4B_fI/AAAAAAAADqc/V2C2-N84JeU1cRyVIDzvCAVD6bDylblawCNcBGAsYHQ/s640/fedassets.png\" width=\"640\" height=\"247\" data-original-width=\"1168\" data-original-height=\"450\" /></a></div>Better still, we can look at Fed assets minus currency outstanding, which is the quantity of non-currency Fed liabilities, along with reserves:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-BEnInV5OwBU/XbXbFKxJ5BI/AAAAAAAADqo/D8zuUHLNeBcc9o38P50AcJXwT7tjRaSNACNcBGAsYHQ/s1600/reservesetc.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-BEnInV5OwBU/XbXbFKxJ5BI/AAAAAAAADqo/D8zuUHLNeBcc9o38P50AcJXwT7tjRaSNACNcBGAsYHQ/s640/reservesetc.png\" width=\"640\" height=\"247\" data-original-width=\"1168\" data-original-height=\"450\" /></a></div>What this shows is that, while reserves outstanding have declined substantially to less than $1.5 trillion, the quantity of Fed liabilities other then currency and reserves has grown substantially. In the last <a href=\"https://www.federalreserve.gov/releases/h41/current/h41.htm\">Fed balance sheet snapshot,</a> those liabilities included $293 billion in the foreign repo pool - that's effectively reserves held at the Fed by foreign central banks and other foreign institutions - and $378 billion in the Treasury's general account held with the Fed. More about that later.<br /><br />How does the FOMC think about overnight interest rate determination in a floor system? Typically, they're relying on this:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-xlbT9VUMx8A/XbXgJnDsq3I/AAAAAAAADq0/gJ4dC7bKwh0eAkHN8t4Qa-8897h4cE8uACNcBGAsYHQ/s1600/figure1.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-xlbT9VUMx8A/XbXgJnDsq3I/AAAAAAAADq0/gJ4dC7bKwh0eAkHN8t4Qa-8897h4cE8uACNcBGAsYHQ/s640/figure1.png\" width=\"640\" height=\"360\" data-original-width=\"1280\" data-original-height=\"720\" /></a></div>In the figure, <i>R</i> is the fed funds rate, and <i>Q*</i> is the quantity of reserves that is the threshold between \"abundant\" reserves and \"scarce\" reserves. So long as the supply of reserves is larger than <i>Q*</i>, according to this story, if the Fed wants to target the fed funds rate at <i>R*</i>, it simply pegs the interest rate on reserves (IOER) at <i>R*</i> and then the market clears at <i>R*</i>.<br /><br />You can see how, if this is your view of how overnight markets work, then the mid-September episode when the overnight repo rate spiked well above IOER would be interpreted as a symptom of reserves being less than <i>Q*</i>. As a reminder of what has happened to overnight interest rates in the US since interest rate hikes began in December 2015:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-4lUW5NpUJMo/XbXklFQT0lI/AAAAAAAADrA/-l6DaND8OooblKfxm4L8EGwDmn8kbLVEgCNcBGAsYHQ/s1600/figure4.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-4lUW5NpUJMo/XbXklFQT0lI/AAAAAAAADrA/-l6DaND8OooblKfxm4L8EGwDmn8kbLVEgCNcBGAsYHQ/s640/figure4.png\" width=\"640\" height=\"476\" data-original-width=\"1075\" data-original-height=\"800\" /></a></div>The chart shows IOER, the effective fed funds rate and, later in the sample (when the Fed started collecting the data for the repo rate series), the secured overnight financing rate (SOFR), i.e. a measure of the overnight repo rate. The data in the chart certainly doesn't conform to the simple model in the figure above. Note in particular that, early in the sample, the fed funds rate was lower than IOER, and exhibited downward spikes at the end of each month. Then, later in the sample, when we can see what is going on in the repo market, as measured by SOFR, the repo rate is for a while close to to IOER and the fed funds rate, then starts to exhibit more volatility, with spikes at month-end occurring even prior to the large spike in mid-September. So, if we judge the performance of an interest-rate-targeting regime by success in pegging all overnight rates to the FOMC's target, then this floor system worked well for only a few months in late 2018. And, recall that, in the pre-2018 period, the floor system had substantial support from the Fed's overnight reverse repo (ON-RRP) facility, under which the Fed was a borrower (and sometimes a large borrower, to the tune of several hundred billion dollars overnight) in the overnight repo market, at a rate 25 basis points below IOER. So I wouldn't call this floor system a well-oiled machine.<br /><br />When the repo market went crazy on September 17, much to everyone's surprise, the Fed intervened by lending in the repo market. That intervention has continued. Here's the Fed's overnight repo activity since then:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-mmEytr5KJc0/XbXxB2np_0I/AAAAAAAADrM/c9wvSIat3R8Adyvnbi04hSLz8xQcaLcEgCNcBGAsYHQ/s1600/figure5.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-mmEytr5KJc0/XbXxB2np_0I/AAAAAAAADrM/c9wvSIat3R8Adyvnbi04hSLz8xQcaLcEgCNcBGAsYHQ/s640/figure5.png\" width=\"640\" height=\"247\" data-original-width=\"1168\" data-original-height=\"450\" /></a></div>As well, the current Fed balance sheet data indicates that there is about $191 billion in repos held by the Fed, which includes term repos of 14 days, in addition to the overnight repos in the chart. So, if you thought that whatever was causing the September 17 repo rate spike was temporary, it wasn't, as the Fed has had to maintain a substantial presence in the repo market in order to hold overnight rates down.<br /><br />The FOMC's model of overnight credit market intervention, in the third figure, is misleading for a number of reasons. First, it's not a good idea to think that there's some stable demand for reserves in the financial system. Reserves are necessary for clearing and settlement of interbank transactions during the day, but intraday velocity is so high, basically, that a small quantity of reserves can support a very large quantity of intraday transactions. For example, before the financial crisis $10 billion in reserve balances could support a volume of intraday transactions on the order of annual U.S. GDP. So, issues related to reserve balances in excess of $1 trillion, as is the case currently, relate to the role reserves play as overnight assets, and we can safely ignore issues to do with the functioning of intraday wholesale payments. How useful banks find overnight reserve balances is determined by regulation, and by the stocks of other assets, particularly Treasury securities, which play an important role as collateral in the repo market, and as a liquid asset in banks' asset portfolios. A possibly superior way to look at the overnight market is to think in terms of the demand and supply of overnight credit. For example:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-Okg9YZdJ9Tk/XbX80XBfF4I/AAAAAAAADrY/ql2RnKnNt84NPMbDajNCetps8-X-flcvACNcBGAsYHQ/s1600/figure2.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-Okg9YZdJ9Tk/XbX80XBfF4I/AAAAAAAADrY/ql2RnKnNt84NPMbDajNCetps8-X-flcvACNcBGAsYHQ/s640/figure2.png\" width=\"640\" height=\"360\" data-original-width=\"1280\" data-original-height=\"720\" /></a></div>In this figure, by setting IOER at <i>R*</i> the Fed is lending perfectly elastically, over the relevant range, in the overnight credit market by supplying reserves. We're still thinking in terms of a frictionless world in which secured and unsecured credit are perfect substitutes (more about that later).<br /><br />We can then think about all systems for pegging overnight interest rates in exactly the same way as in the last figure. The Fed has to intervene in such a way that either overnight credit demand, or overnight credit supply, is perfectly elastic at the target interest rate. For example, in this context, the operating regime for the Fed before the financial crisis looks like this:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-lVr9i_EPGLM/XbX-YExBdlI/AAAAAAAADrk/R4K9HRpLHD093bxYDB-I_PXhJVh4onorwCNcBGAsYHQ/s1600/figure3.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-lVr9i_EPGLM/XbX-YExBdlI/AAAAAAAADrk/R4K9HRpLHD093bxYDB-I_PXhJVh4onorwCNcBGAsYHQ/s640/figure3.png\" width=\"640\" height=\"360\" data-original-width=\"1280\" data-original-height=\"720\" /></a></div>That is, before the financial crisis, the Fed intervened in the repo market, as an indirect way of pegging the fed funds rate, under the theory that secured and unsecured lending are close substitutes. By varying the amount of repo market intervention each day to peg the fed funds rate, the Fed was effectively making the supply of overnight credit perfectly elastic at the targeted rate. If they had wanted to, they could have intervened through reverse repos, which we could represent as in the previous figure - this works just like the floor system, except the variability is in a different Fed liability. Thus, there's nothing special about the floor system - it fits in a class of intervention mechanisms that work through variability in Fed liabilities rather than Fed assets (as in repo market intervention on the lending side).<br /><br />But there's more to it. The Econ 101 approach to the overnight market in the last couple of figures isn't a good way to analyze a market with substantial frictions. For example, if there were no significant frictions in the overnight credit market, then it would make no difference whether the Fed permanently swapped, say, $100 billion in reserves for $100 billion in T-bills, or intervened by lending $100 billion in the repo market every day forever, taking T-bills as collateral. Clearly, the Fed thinks there's a difference, as they're now planning to buy about $60 billion in T-bills every month until the second quarter of next year, which looks like a potential planned purchase of $300 billion or more in T-bills. Somehow the Fed thinks that's better than continuing to intervene in the repo market at the current intensity - note that current repos outstanding, including term repos, amounts to about $191 billion.<br /><br />So what's the Fed up to, and why? For more information, let's go to a <a href=\"https://www.newyorkfed.org/newsevents/speeches/2019/wil191017\">recent speech by John Williams,</a> President of the New York Fed. Williams says: <blockquote>The key benefit of this approach is that it’s a simple, effective way of controlling the federal funds rate and thereby influencing other short-term interest rates.</blockquote>Well, in my book, \"simple\" means easy to explain. It's actually quite complicated to explain features of the current floor system, such as the ON-RRP facility, and why it's there, or why the repo market went phooey on September 17. A lot of people are spending valuable time trying to figure this out. Nothing simple about it. Further, \"effective,\" I think, means it works. The floor system definitely does not work as advertised. Simply setting IOER should peg overnight rates, but that only happened (roughly) for just over a year. Before early 2018, the ON-RRP facility was holding up overnight rates from below, and after mid-September 2019 the Fed was lending in the repo market to hold down overnight rates from above. The floor system does not work, except in some sweet spot. And that sweet spot isn't determined only by reserves outstanding. There is a host of other poorly understood factors that matter for whether the floor can work on its own.<br /><br />Here's something else Williams said in his speech: <blockquote>In light of these events, we have learned that the ample reserves framework has worked smoothly with a level of reserves at least as large as we saw during summer and into early September. Although temporary open market operations are doing the trick for the time being, anticipated increases in non-reserve liabilities would cause reserves to decline in coming months without further actions.</blockquote>The \"events\" he's referring to are all included in the charts above. It's certainly not correct to say that everything worked smoothly prior to September. As I've pointed out, things were creaky before 2018, even given the ON-RRP intervention, and month-end spikes in the repo rate were apparent before the blowup on September 17. But, the key problem with Williams's statement here is that he doesn't tell us why the Fed prefers to buy T-bills rather than to intervene in the repo market every day - as he says, that's \"doing the trick,\" so what's the problem?<br /><br />Conclusions:<br /><br />1. If the answer to the problem of overnight interest rate control is more reserves, that can be achieved by reducing the size of the foreign repo pool and the Treasury's general account, which together currently come to a total of about $672 billion. That's a lot larger than the $300 billion in T-bills the Fed plans on purchasing. The size of the foreign repo pool and the Treasury's general account are purely discretionary, and both were tiny before the financial crisis. None of the communications coming from the Fed have explained what these items are about. Why is it important to the Fed's goals that foreign entities, including central banks, hold what are essentially reserve accounts at the Fed? How does it help monetary policy that the Treasury carries a large and volatile reserve balance with the Fed? Why can't foreign central banks park their overnight US dollars elsewhere? Why can't the Treasury park its accounts with the private sector, as before the financial crisis?<br /><br />2. Experience with a floor system in the U.S. since December 2015 should tell us that it's ineffective for the Fed to attempt to intervene in overnight markets by narrowing their engagement with the financial sector to commercial banks. The fed funds market is a small market, and reserve accounts are held by only a fraction of financial institutions. The repo market is a large market, and intervention by the Fed in that market reaches all the nooks and crannies of the financial sector. A more effective approach, as many other central banks have discovered, is to peg a repo rate - stop worrying about the fed funds market - and intervene in the repo market, either on the lending or borrowing side, depending on circumstances.<br /><br />3. The only advantage reserves have over Treasury securities, as a liquid asset, is that reserve balances can be transferred among financial institutions with reserve accounts, on Fedwire during the day. Otherwise, Treasuries are more widely held, and they're the primary form of collateral in the repo market. In general, if the Fed takes Treasuries out of financial markets and replaces those assets with reserves, that will make the financial sector less efficient. Some people have tried to argue that post-financial crisis banking regulations somehow make banks prefer reserves to Treasuries. I don't buy it. Treasuries and reserves are equivalent as high-quality liquid assets in banking regulation. And I've never seen a bank \"living will\" that articulates a special role for reserve balances. And if regulators are encouraging banks to hold reserves rather than Treasuries as liquid assets, there's no good reason for them to do that, given what seems to be written in the law.<br /><br />So, the Fed seems to be floundering on this issue. Balance sheet policy seems to be more about the FOMC sticking to what they decided in early 2019, than with responding to what they should have learned since then.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Stephen Williamson",
    "uri": "http://www.blogger.com/profile/01434465858419028592",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 1
}