{
  "title": "From hot dog cart to hospitality empire | How Danny Meyer, founder of Union Square Hospitality Group, became the greatest restaurateur NYC has ever seen",
  "pubDate": "Mon, 02 Sep 2019 10:00:00 +0000",
  "guid": "9ba13c5b4d3e42e4859bea8817639c4b",
  "link": "https://tonyrobbins.libsyn.com/from-hot-dog-cart-to-hospitality-empire-how-danny-meyer-founder-of-union-square-hospitality-group-became-the-greatest-restaurateur-nyc-has-ever-seen",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">As founder and CEO of Union Square Hospitality Group and Shake Shack, Danny Meyer has grown his empire to include some of New York’s most beloved and acclaimed restaurants and cafes.</span> <span style= \"font-weight: 400;\">Together, Danny’s restaurants and team have won an unprecedented 28 James Beard Awards – the food industry’s highest honor.</span></p> <p><span style=\"font-weight: 400;\">But it’s not just great food that sets Danny’s restaurants apart from the rest. It’s what people</span> <em><span style= \"font-weight: 400;\">experience</span></em> <span style= \"font-weight: 400;\">and feel when they’re eating there. In fact, Danny Meyer’s story is a remarkable testament to the sheer power of</span> <em><span style= \"font-weight: 400;\">hospitality.</span></em><span style= \"font-weight: 400;\"> </span></p> <p><span style=\"font-weight: 400;\">In this episode, we explore the unique and celebrated culture of hospitality that Danny has created. He shares with Tony how he’s managed to</span> <em><span style=\"font-weight: 400;\">scale</span></em> <span style= \"font-weight: 400;\">that culture across Union Square Hospitality Group, as well as Shake Shack, the fast-casual restaurant Danny founded back in 2001. With Danny at the helm, what started as a single hot dog cart in Madison Square Garden is now a publicly traded company with over 250 locations and 6,000 employees.</span></p> <p><br /> <span style=\"font-weight: 400;\">Listen closely, because Danny</span> <em><span style=\"font-weight: 400;\">also</span></em> <span style=\"font-weight: 400;\">shares the six qualities he looks for when hiring employees – from dishwashers to executive chefs – and what he thinks it takes for entrepreneurs across</span> <em><span style=\"font-weight: 400;\">all</span></em> <span style= \"font-weight: 400;\">industries to succeed in business.</span></p>",
  "content:encoded": "<p>As founder and CEO of Union Square Hospitality Group and Shake Shack, Danny Meyer has grown his empire to include some of New York’s most beloved and acclaimed restaurants and cafes. Together, Danny’s restaurants and team have won an unprecedented 28 James Beard Awards – the food industry’s highest honor.</p> <p>But it’s not just great food that sets Danny’s restaurants apart from the rest. It’s what people <em>experience</em> and feel when they’re eating there. In fact, Danny Meyer’s story is a remarkable testament to the sheer power of <em>hospitality.</em> </p> <p>In this episode, we explore the unique and celebrated culture of hospitality that Danny has created. He shares with Tony how he’s managed to <em>scale</em> that culture across Union Square Hospitality Group, as well as Shake Shack, the fast-casual restaurant Danny founded back in 2001. With Danny at the helm, what started as a single hot dog cart in Madison Square Garden is now a publicly traded company with over 250 locations and 6,000 employees.</p> <p> Listen closely, because Danny <em>also</em> shares the six qualities he looks for when hiring employees – from dishwashers to executive chefs – and what he thinks it takes for entrepreneurs across <em>all</em> industries to succeed in business.</p>",
  "enclosure": "",
  "itunes:duration": "40:48",
  "itunes:explicit": false,
  "itunes:keywords": "union,Meyer,group,restaurant,tony,robbins,square,danny,hospitality,shake,shack",
  "itunes:subtitle": "As founder and CEO of Union Square Hospitality Group and Shake Shack, Danny Meyer has grown his empire to include some of New York’s most beloved and acclaimed restaurants and cafes. Together, Danny’s restaurants and team have won an unprecedented...",
  "itunes:episodeType": "full"
}