{
  "title": "Episode 31: &#8220;Only You&#8221; by the Platters",
  "link": "https://500songs.com/podcast/episode-31-only-you-by-the-platters/",
  "pubDate": "Mon, 06 May 2019 04:11:31 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-31-only-you-by-the-platters/",
  "description": "Welcome to episode thirty-one of <em>A History of Rock Music in Five Hundred Songs</em>. This one looks at \"Only You\" by the Platters. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-31-only-you/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThis episode ties into several others, but in particular you might want to relisten to <a href=\"https://www.500songs.com/e/episode-25-earth-angel-by-the-penguins/\">the episode on Earth Angel,</a> which features several of the same cast of characters.\n\nThere are no books on the Platters, as far as I know, so as I so often do when talking about vocal groups I relied heavily on <a href=\"http://www.uncamarvy.com/Platters/platters.html\">Marv Goldberg's website</a>.\n\nFor details of Buck Ram's life, I relied on <a href=\"https://amzn.to/2GYkSDt\"><em>The Magic Touch of Buck Ram: Songwriter</em>,</a> a self-published book credited to J. Patrick Carr but copyrighted in the name of Gayle Schreiber. Schreiber worked for Buck Ram for many years, and both she and Carr have put out multiple books with similar writing styles and layouts which heap fulsome praise both on Ram and on his assistant Jean Bennett. Those books are low on text and high on pictures from Bennett's personal collection, and they give a version of the story which is very slanted, but they also contain details not available elsewhere.\n\n<a href=\"https://www.youtube.com/watch?v=JHUAkN5yKxM\">This long YouTube interview with Gaynel Hodge</a> was interesting in giving Hodge's side of the story.\n\nSome of the court case documents I read through to try to understand the legal ownership of the Platters name:\n<a href=\"https://casetext.com/case/robi-v-five-platters-inc\">Paul Robi and Tony Williams vs Five Platters Inc</a>\n\n<a href=\"https://law.justia.com/cases/federal/appellate-courts/F2/918/1439/24460/\">Martha Robi v. Five Platters Inc, Jean Bennett, and Buck Ram</a>\n\n<a href=\"https://caselaw.findlaw.com/us-9th-circuit/1068950.html\">Martha Robi v. Herb Reed</a>\n\n<a href=\"https://dockets.justia.com/docket/nevada/nvdce/2:2010cv01981/77482\">Herb Reed Enterprises v. Jean Bennett, Five Platters, Inc. and Personality Productions, Inc.</a>\n\nThere are many cheap compilations of the Platters' hits. There are also many cheap compilations of rerecorded versions of the Platters' hits sung by people who weren't in the Platters. <a href=\"https://amzn.to/2GYM7xz\">This</a> is one of the former.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nThe story of the Platters is intimately tied up with another story we've already talked about -- that of the Penguins and \"Earth Angel\". You might want to relisten to that episode -- or listen to it for the first time, if you're coming to this podcast for the first time -- before listening to this one, as this tells a lot of the same story from an alternative perspective. But in both cases Buck Ram ends up being the villain.\n\nAs I mentioned in that episode, there was a lot of movement between different vocal groups, and the Platters were very far from an exception. It's hard to talk about how they formed in the way I normally would, where you talk about these three people meeting up and then getting a friend to join them, and their personalities, and so on, because none of the five people who sang on their biggest hits were among the six people who formed the original group they came from.\n\nThe Platters started out as The Flamingos -- this isn't the same group as the more well-known Flamingos, but a different group, whose lineup was Cornell Gunter, Gaynel Hodge (who was also in the Hollywood Flames at the same time), Gaynel's brother Alex Hodge, Joe Jefferson, Richard Berry, and Curtis Williams.\n\nBut very quickly, the Flamingos started to lose members to other, more popular, groups. The first to leave was Curtis Williams, who went on to join the Hollywood Flames, and from there joined the Penguins.\n\nRichard Berry, meanwhile formed a band called the Hollywood Bluejays and got Cornell Gunter into the group. They recorded one single for John Dolphin's record label, before renaming themselves the Flairs and moving over to Flare records:\n\n[Excerpt: \"She Wants to Rock\", the Flairs]\n\nCornel Gunter would later go on to join the Coasters, and we've already heard some of what Richard Berry would do later on in the episode on \"The Wallflower\".\n\nSo the Flamingos had produced some great talents, but those talents' departure left some gaping holes in the lineup. Eventually, the Flamingos settled into a new lineup, consisting of Gaynel Hodge, Alex Hodge, David Lynch (not the same one as the film director), and Herb Reed.\n\nThat lineup was not very good, though, and they didn't have a single singer who was strong enough to sing lead. Even so, the demand for vocal groups at the time was so great that they got signed by Ralph Bass, who was currently working for Federal Records, producing among other artists a singer called Linda Hayes.\n\nWe've heard quite a bit about Linda Hayes in this series already, though you might not recognise the name. She was one of the people who had tried to cash in on Johnny Ace's death with a tribute record, \"Why Johnny Why\", and she was also the one who had replaced Eunice in Gene and Eunice when she went on maternity leave. We find her popping up all over the place when there was a bandwagon to jump on, and at the time we're talking about she'd just had an actual hit because of doing this. Willie Mabon had just had a hit with \"I Don't Know\":\n\n[Excerpt: Willie Mabon, \"I Don't Know\"]\n\nThat had reached number one on the R&B chart and had spawned a country cover version by Tennessee Ernie Ford. And so Hayes had put out an answer record, \"Yes, I Know (What You're Putting Down)\":\n\n[Excerpt: Linda Hayes, \"Yes, I Know (What You're Putting Down)\"]\n\nHayes' answer went to number two on the R&B charts, and she was suddenly someone it was worth paying attention to. As it turned out, she would only have one other hit, in 1954. But she introduced Ralph Bass to her brother, Tony Williams, who wanted to be a singer himself.\n\nWilliams joined the Flamingos as their lead singer, and their first recording was as the vocal chorus on \"Nervous Man Nervous\" by Big Jay McNeely, one of the all-time great saxophone honkers, who had previously played with Johnny Otis' band:\n\n[Excerpt: Big Jay McNeely, \"Nervous Man Nervous\"]\n\nShortly after that, the Flamingos were due to have their own first recording session, when a problem hit. There were only so many names of birds that groups could use, and so it wasn't surprising that someone else was using the name \"the Flamingos\", and that group got a hit record out. So they decided that since records were often called \"platters\" by disc jockeys, they might as well call themselves that. The Platters' first single did absolutely nothing:\n\n[excerpt: The Platters: \"Hey Now\"]\n\nThey put out a few more recordings, but nothing clicked, and nobody, Ralph Bass included, thought they were any good. Gaynel Hodge finally got sick of splitting his time between groups, and left the group, to continue with the Hollywood Flames.\n\nThe group seemed like they might be on the way out, and so Tony Williams went to his sister's manager, Buck Ram, and asked him if he'd be Williams' manager as a solo singer. Ram listened to him, and said he was interested, but Williams should get himself a group to sing with. Williams said that, well, he did already have a group. Ram talked to Ralph Bass and took the Platters on as a project for himself.\n\nRam is unusual among the managers of this time, in that he was actually a musician and songwriter of some ability himself. He had obtained a law degree, mostly to please his parents, but Ram was primarily a songwriter.\n\nLong before he went into music management Ram was writing songs, and was getting them performed by musicians that you have heard of. And he seems to have been part of the music scene in New York in the late thirties and early forties in a big way, having met Duke Ellington in a music arranging class both were taking, and having been introduced by Ellington to people like Chick Webb, Cab Calloway, and Ellington's publishers, Mills Music.\n\nRam's first big success as a songwriter was \"I'll Be Home For Christmas\", which had been a hit for Bing Crosby and would later become a standard:\n\n[Excerpt: Bing Crosby, \"I'll Be Home For Christmas\"]\n\nThe story of \"I'll Be Home For Christmas\" was a rather controversial one -- Ram had written, on his own, a song called \"I'll Be Home For Christmas (Tho Just In Memory)\", and had registered the copyright in December 1942, but hadn't had it recorded by anyone. A few months later, he talked to his acquaintances Walter Kent and Kim Gannon about it, and was shocked when Crosby released a single written by them which bore a strong resemblance to Ram's song. His publishers, Mills Music, sued and got Ram credited on future releases. Buck Ram would end up fighting a lot of lawsuits, with a lot of people.\n\nBut while that biggest credit was the result of a lawsuit, Ram was also, as far as I can tell, an actual songwriter of great ability. Where other managers got themselves credited on songs that they didn't write and in some cases had never heard, to the best of my knowledge there has never been any suggestion that Buck Ram wasn't the sole author of the Platters songs he's credited for.\n\nI'm so used to this working the other way, with managers taking credit for work they didn't do, that I still find it difficult to state for certain that there wasn't *some* sort of scam going on, but Ram had songwriting credits long before getting into the business side of things. Here, for example, is a song he wrote with Chick Webb, sung by Ella Fitzgerald:\n\n[Excerpt: \"Chew Chew Chew Your Bubblegum\", Chick Webb and Ella Fitzgerald]\n\nHe spent several years working as a songwriter and arranger in New York, but made the mistake of moving West in order to get into the film music business, only to find that he couldn't break into the market and had to move into management instead. But making music, rather than managing it, was his first love, and he saw the Platters as a means to that end -- raw material he could mould in his own image.\n\nRam signed the Platters, now a four-piece consisting of Williams, Alex Hodge, David Lynch, and Herb Reed, to a seven-year contract, and started trying to mould them into a hit act.\n\nThe first single they released after signing with Ram was one which, rather oddly, featured Herb Reed on lead vocals on both sides, rather than their normal lead Tony Williams:\n\n[Excerpt: The Platters, \"Roses of Picardy\"]\n\nThey still had the problem, though, that they simply weren't very good at singing. At the time, they didn't know how to sing in harmony -- they'd just take turns singing lead, and often not be able to sing in the same key as each other.\n\nThis didn't have much success, but Ram had an idea. In the forties, he'd managed and written for a group called the Quin-Tones. There were several groups of that name over the years, but this one had been a white vocal group with four men and one woman. They weren't very successful, but here's one of their few surviving recordings, \"Midnight Jamboree\", written and arranged by Ram:\n\n[Excerpt: the Quin-Tones, \"Midnight Jamboree\"]\n\nWorking with the Quin-Tones had given Ram a taste for the particular vocal blend that comes from having four men and one woman. This had been a popular group style in the 1940s, thanks to the influence of the Modernaires -- the vocal group who sang with the Glenn Miller Orchestra -- but had largely fallen out of favour in the 50s. Ram decided to reform the Platters along these lines.\n\nThe woman he chose to bring into the group was a singer Gaynel Hodge knew called Zola Taylor. Taylor had been recording as a solo artist, with little success, but she had a good sound on her recordings for RPM Records:\n\n[Excerpt: Zola Taylor, \"Oh! My Dear\"]\n\nWith Zola in the group, Ram's ideal vocal sound was almost complete. But they hadn't quite got themselves together -- after all, there was still an original member left! But Alex Hodge wouldn't last long, as he was arrested for marijuana possession, and he was replaced by Paul Robi. Gaynel Hodge now claims that this wasn't the real reason that Alex Hodge was sacked – he says that Ram and Herb Reed conspired to get rid of Alex, who in Gaynel's telling had been the original founder of the group, because he knew too much about the music business and was getting suspicious that Ram was ripping him off. Either way, the last original member was now gone, and the Platters were Tony Williams, Zola Taylor, Herb Reed, Paul Robi, and David Lynch.\n\nThis would now be the lineup that would stay together for the rest of the 1950s and beyond.\n\nBefore that change though, the Platters had recorded a song that had sounded so bad that Ram had persuaded the label not to release it.\n\n\"Only You\" was a song that Ram had written with the intention of passing it on to the Ink Spots, but for whatever reason he had never got round to it, though he'd written for the Ink Spots before -- they'd released his \"I'll Lose a Friend Tomorrow\" in 1946:\n\n[Excerpt: The Ink Spots: \"I'll Lose A Friend Tomorrow\"]\n\nHe later said that he'd decided against giving \"Only You\" to the Ink Spots because they'd split up before he had a chance. That's not accurate -- the Ink Spots were still around when the earliest recordings of the song by the Platters were made. More likely, he just didn't like the song. After he wrote it, he stuck the sheet music in a box, where it languished until Jean Bennett, his assistant, was moving things around and the box fell apart. Bennett looked at the song, and said she thought it looked interesting. Ram said it was rubbish, but Bennett put the sheet music on top of Ram's piano. When Tony Williams saw it, he insisted on recording it. But that initial recording seemed to confirm Ram's assessment that the song was terrible:\n\n[Excerpt: The Platters, \"Only You\" (original version), including the incredibly bad ending chord]\n\nDuring this period the band were also recording tracks backing Linda Hayes, and indeed there was also a brother-sister duet credited to Linda Hayes and Tony Williams (of the Platters):\n\n[Excerpt, Linda Hayes and Tony Williams, \"Oochi Pachi\"]\n\nAnd again, Hayes was trying to jump on the bandwagons, recording an \"Annie\" song with the Platters on backing vocals, in the hope of getting some of the money that was going to Hank Ballard and Etta James:\n\n[Excerpt: Linda Hayes and the Platters, \"My Name Ain't Annie\"]\n\nBut none of those records sold at all, and despite Ram's best efforts it looked like the Platters were simply not going to be having any recording success any time soon. Federal dropped them, as it looked likely they were going to do nothing.\n\nBut then, the group got very lucky. Buck Ram became the manager of the Penguins, another group that had formed out of the primal soup of singers around LA. The Penguins had just had what turned out to be their only big hit, with \"Earth Angel\", and Mercury Records were eager to sign them. Ram agreed to the deal, but only on the condition that Mercury signed the Platters as well. Once they were signed, Ram largely gave up on the Penguins, who never had any further success. They'd served his purpose, and got the group he really cared about signed to a major label.\n\nThere was a six-month break between the last session the Platters did for Federal and the first they did for Mercury. During that time, there was only one session -- as backing vocalists for Joe Houston:\n\n[Excerpt: Joe Houston, \"Shtiggy Boom\"]\n\nBut they spent that six months practising, and when they got into the studio to record for Mercury, they suddenly sounded *good*:\n\n[Excerpt: The Platters, \"Only You\"]\n\nEverything had fallen into place. They were now a slick, professional group. They'd even got good enough that they could incorporate mistakes when they worked -- on an early take, Williams' voice cracked on the word \"only\", and he apologised to Ram, who said, \"no, it sounded good, use it\".\n\nAnd \"Only You\" became one of those songs that defines an era. More than any of the doo-wop songs we've covered previously, it's the epitome of 1950s smooth balladry. It was a massive hit -- it spent thirty weeks on the R&B charts, seven of them at number one, and twenty-two weeks on the pop charts, peaking at number five.\n\nFederal rush-released the awful original recording to cash in, and Ram and Mercury took them to court, which eventually ruled in favour of Federal being allowed to put out their version, but the judge also said that that decision might well turn out to be more harmful to Federal than to Mercury. The Federal version didn't chart.\n\nThe follow-up to “Only You”, also by Ram, was even bigger:\n\n[Excerpt: The Platters, \"The Great Pretender\"]\n\nAnd this started a whole string of hits -- \"The Magic Touch\", \"Twilight Time\", \"Smoke Gets in Your Eyes\"... most of these weren't quite as long-lasting as their first two massive hits, but they were regulars at the top of the pop charts. The Platters were, in many ways, the 1950s equivalent to the Ink Spots, and while they started off marketed as a rock and roll group, they soon transitioned into the more lucrative adult market, recording albums of standards.\n\nBut having emulated the Ink Spots in their biggest hits, the Platters also, sadly, emulated the Ink Spots in the way they fell apart. Unfortunately, the only book I've been able to find that talks about the Platters in any depth is written by someone working for Buck Ram's organisation, and so it has a very particular biased take on the legal disputes that followed for the next sixty years. I've tried to counter this by at least skimming some of the court documents that are available online, but it's not really possible to get an accurate sense, either from court filings from 2011 or the mid-eighties, or from a self-published and self-defensive book from 2015, what actually happened between the five Platters, Ram, and Ram's assistant Jean Bennett back in the late 1950s.\n\nWhat everyone seems to agree on, though, is that soon after the Platters were signed to Mercury, a corporation was set up, \"Five Platters Inc\", which was controlled by Buck Ram and had all the members of the Platters as shareholders. The Platters, at the time, assigned any rights they had to the band's name to this corporation.\n\nBut then, in 1959, Tony Williams, who had always wanted a solo career, decided he wanted to pursue one more vigorously. He was going to leave the group, and he put out a solo album:\n\n[Excerpt: Tony Williams, \"Charmaine\"]\n\nIndeed, it seems to have been Buck Ram's plan from the very start to get Williams to be a solo artist, while keeping the Platters as a hit group -- he tried to find a replacement for Williams as early as 1956, although that didn't work out.\n\nFor a while, Williams continued in the Platters, while they looked for a replacement, but his solo career didn't go wonderfully at first. He wasn't helped by all four of the male Platters being arrested, allegedly as customers of sex workers, but in fact because they were sharing their hotel room with white women. All charges against everyone involved were later dropped, but this meant that it probably wasn't the best time for Williams to be starting a solo career.\n\nBut by 1961, Williams had managed to extricate himself from the Platters, and had been replaced by a young singer called Sonny Turner, who could sound a little like Williams. The record company were so convinced that Williams was the important one in the Platters, though, that on many of their recordings for the next year or two Mercury would take completed recordings by the new Platters lineup and overdub new lead vocals from Williams.\n\nBut one at a time the band members left, following Williams. And as each member left, they sold their shares in Five Platters Inc. to Buck Ram or to one of Ram's companies. By 1969 Herb Reed was the only member of the classic lineup still in the group, and then he left the group too, and Buck Ram and his companies continued putting out groups with no original members as the Platters.\n\nNow, this doesn't mean that the real members stopped touring as the Platters. After David Lynch left in 1967, for example, he formed a group called \"The Original Platters\", and got both Zola Taylor and Paul Robi into the group. Tony Williams, Herb Reed, and Sonny Turner all also formed their own groups which toured under the Platters name, competing with the \"official\" Buck Ram Platters.\n\nThere followed forty years of litigation between Ram's companies and various Platters members. And the judgements went both ways, to the point that I can't make accurate judgements from the case documents I've been able to find online. As best as I can understand it, there was a court ruling back in 1974 that the whole purpose of Five Platters Inc. had been to illegally deprive the band members of their ownership in the band name, that it was a sham corporation, and that Buck Ram had illegally benefited from an unfair bargaining position. Shortly after that, it was ruled that FPI's trademark in the Platters name was void. But then there were other cases which went the other way, and Five Platters Inc. insisted that the band members had mostly left because they were alcoholics who didn't want to tour any more, and that they'd given up their rights to the band name of their own free will.\n\nMeanwhile, over a hundred fake Platters groups with no original members went out on the road at various points. There have been almost as many fake Platters as there have fake Ink Spots.\n\nThe band name issues were finally resolved in 2011. By that point Buck Ram was long dead, as were all the members of the classic Platters lineup except Herb Reed. A judge finally ruled that Herb Reed had the rights to the name, and that Five Platters Inc. had never owned the name. Just before that ruling, Five Platters Inc., which was now run by Jean Bennett, announced that they were going to retire the name. Herb Reed died in 2012, shortly afterwards, though the company he licensed the name to still licenses a band to tour as the Platters.\n\nGaynel Hodge, however, is still alive, the last surviving member of the original Platters, and he still performs with his own Platters group, performing songs the Platters recorded after he left. His website hasn't been updated since 2005, but at the time its most recent newsflash was that he had co-written this song with Dr. John for Shemekia Copeland:\n\n[Excerpt: Shemekia Copeland, \"Too Close\"]\n\nGaynel Hodge was a major figure in the California music industry. He'll be turning up in all sorts of odd places in future episodes, as he was involved in a lot of very important records. And we'll definitely be seeing more of both Richard Berry and Cornell Gunter later as well. And meanwhile, somewhere out there are multiple groups of people who've never met anyone who sang on \"Only You\", singing that song right now and calling themselves the Platters.",
  "itunes:subtitle": "Welcome to episode thirty-one of A History of Rock Music in Five Hundred Songs. This one looks at Only You by the Platters. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, Ive ",
  "itunes:keywords": "Big Jay McNeely,Buck Ram,Chick Webb,Cornell Gunter,Curtis Williams,doo wop,Federal Records,Gaynel Hodge,Hollywood Flames,Ink Spots,John Dolphin,lawsuits,Linda Hayes,Mercury Records,Ralph Bass,Richard Berry,The Penguins,The Platters,vocal groups",
  "itunes:episodeType": "full",
  "itunes:episode": 31,
  "content:encoded": "Welcome to episode thirty-one of <em>A History of Rock Music in Five Hundred Songs</em>. This one looks at \"Only You\" by the Platters. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-31-only-you/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThis episode ties into several others, but in particular you might want to relisten to <a href=\"https://www.500songs.com/e/episode-25-earth-angel-by-the-penguins/\">the episode on Earth Angel,</a> which features several of the same cast of characters.\n\nThere are no books on the Platters, as far as I know, so as I so often do when talking about vocal groups I relied heavily on <a href=\"http://www.uncamarvy.com/Platters/platters.html\">Marv Goldberg's website</a>.\n\nFor details of Buck Ram's life, I relied on <a href=\"https://amzn.to/2GYkSDt\"><em>The Magic Touch of Buck Ram: Songwriter</em>,</a> a self-published book credited to J. Patrick Carr but copyrighted in the name of Gayle Schreiber. Schreiber worked for Buck Ram for many years, and both she and Carr have put out multiple books with similar writing styles and layouts which heap fulsome praise both on Ram and on his assistant Jean Bennett. Those books are low on text and high on pictures from Bennett's personal collection, and they give a version of the story which is very slanted, but they also contain details not available elsewhere.\n\n<a href=\"https://www.youtube.com/watch?v=JHUAkN5yKxM\">This long YouTube interview with Gaynel Hodge</a> was interesting in giving Hodge's side of the story.\n\nSome of the court case documents I read through to try to understand the legal ownership of the Platters name:\n<a href=\"https://casetext.com/case/robi-v-five-platters-inc\">Paul Robi and Tony Williams vs Five Platters Inc</a>\n\n<a href=\"https://law.justia.com/cases/federal/appellate-courts/F2/918/1439/24460/\">Martha Robi v. Five Platters Inc, Jean Bennett, and Buck Ram</a>\n\n<a href=\"https://caselaw.findlaw.com/us-9th-circuit/1068950.html\">Martha Robi v. Herb Reed</a>\n\n<a href=\"https://dockets.justia.com/docket/nevada/nvdce/2:2010cv01981/77482\">Herb Reed Enterprises v. Jean Bennett, Five Platters, Inc. and Personality Productions, Inc.</a>\n\nThere are many cheap compilations of the Platters' hits. There are also many cheap compilations of rerecorded versions of the Platters' hits sung by people who weren't in the Platters. <a href=\"https://amzn.to/2GYM7xz\">This</a> is one of the former.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nThe story of the Platters is intimately tied up with another story we've already talked about -- that of the Penguins and \"Earth Angel\". You might want to relisten to that episode -- or listen to it for the first time, if you're coming to this podcast for the first time -- before listening to this one, as this tells a lot of the same story from an alternative perspective. But in both cases Buck Ram ends up being the villain.\n\nAs I mentioned in that episode, there was a lot of movement between different vocal groups, and the Platters were very far from an exception. It's hard to talk about how they formed in the way I normally would, where you talk about these three people meeting up and then getting a friend to join them, and their personalities, and so on, because none of the five people who sang on their biggest hits were among the six people who formed the original group they came from.\n\nThe Platters started out as The Flamingos -- this isn't the same group as the more well-known Flamingos, but a different group, whose lineup was Cornell Gunter, Gaynel Hodge (who was also in the Hollywood Flames at the same time), Gaynel's brother Alex Hodge, Joe Jefferson, Richard Berry, and Curtis Williams.\n\nBut very quickly, the Flamingos started to lose members to other, more popular, groups. The first to leave was Curtis Williams, who went on to join the Hollywood Flames, and from there joined the Penguins.\n\nRichard Berry, meanwhile formed a band called the Hollywood Bluejays and got Cornell Gunter into the group. They recorded one single for John Dolphin's record label, before renaming themselves the Flairs and moving over to Flare records:\n\n[Excerpt: \"She Wants to Rock\", the Flairs]\n\nCornel Gunter would later go on to join the Coasters, and we've already heard some of what Richard Berry would do later on in the episode on \"The Wallflower\".\n\nSo the Flamingos had produced some great talents, but those talents' departure left some gaping holes in the lineup. Eventually, the Flamingos settled into a new lineup, consisting of Gaynel Hodge, Alex Hodge, David Lynch (not the same one as the film director), and Herb Reed.\n\nThat lineup was not very good, though, and they didn't have a single singer who was strong enough to sing lead. Even so, the demand for vocal groups at the time was so great that they got signed by Ralph Bass, who was currently working for Federal Records, producing among other artists a singer called Linda Hayes.\n\nWe've heard quite a bit about Linda Hayes in this series already, though you might not recognise the name. She was one of the people who had tried to cash in on Johnny Ace's death with a tribute record, \"Why Johnny Why\", and she was also the one who had replaced Eunice in Gene and Eunice when she went on maternity leave. We find her popping up all over the place when there was a bandwagon to jump on, and at the time we're talking about she'd just had an actual hit because of doing this. Willie Mabon had just had a hit with \"I Don't Know\":\n\n[Excerpt: Willie Mabon, \"I Don't Know\"]\n\nThat had reached number one on the R&B chart and had spawned a country cover version by Tennessee Ernie Ford. And so Hayes had put out an answer record, \"Yes, I Know (What You're Putting Down)\":\n\n[Excerpt: Linda Hayes, \"Yes, I Know (What You're Putting Down)\"]\n\nHayes' answer went to number two on the R&B charts, and she was suddenly someone it was worth paying attention to. As it turned out, she would only have one other hit, in 1954. But she introduced Ralph Bass to her brother, Tony Williams, who wanted to be a singer himself.\n\nWilliams joined the Flamingos as their lead singer, and their first recording was as the vocal chorus on \"Nervous Man Nervous\" by Big Jay McNeely, one of the all-time great saxophone honkers, who had previously played with Johnny Otis' band:\n\n[Excerpt: Big Jay McNeely, \"Nervous Man Nervous\"]\n\nShortly after that, the Flamingos were due to have their own first recording session, when a problem hit. There were only so many names of birds that groups could use, and so it wasn't surprising that someone else was using the name \"the Flamingos\", and that group got a hit record out. So they decided that since records were often called \"platters\" by disc jockeys, they might as well call themselves that. The Platters' first single did absolutely nothing:\n\n[excerpt: The Platters: \"Hey Now\"]\n\nThey put out a few more recordings, but nothing clicked, and nobody, Ralph Bass included, thought they were any good. Gaynel Hodge finally got sick of splitting his time between groups, and left the group, to continue with the Hollywood Flames.\n\nThe group seemed like they might be on the way out, and so Tony Williams went to his sister's manager, Buck Ram, and asked him if he'd be Williams' manager as a solo singer. Ram listened to him, and said he was interested, but Williams should get himself a group to sing with. Williams said that, well, he did already have a group. Ram talked to Ralph Bass and took the Platters on as a project for himself.\n\nRam is unusual among the managers of this time, in that he was actually a musician and songwriter of some ability himself. He had obtained a law degree, mostly to please his parents, but Ram was primarily a songwriter.\n\nLong before he went into music management Ram was writing songs, and was getting them performed by musicians that you have heard of. And he seems to have been part of the music scene in New York in the late thirties and early forties in a big way, having met Duke Ellington in a music arranging class both were taking, and having been introduced by Ellington to people like Chick Webb, Cab Calloway, and Ellington's publishers, Mills Music.\n\nRam's first big success as a songwriter was \"I'll Be Home For Christmas\", which had been a hit for Bing Crosby and would later become a standard:\n\n[Excerpt: Bing Crosby, \"I'll Be Home For Christmas\"]\n\nThe story of \"I'll Be Home For Christmas\" was a rather controversial one -- Ram had written, on his own, a song called \"I'll Be Home For Christmas (Tho Just In Memory)\", and had registered the copyright in December 1942, but hadn't had it recorded by anyone. A few months later, he talked to his acquaintances Walter Kent and Kim Gannon about it, and was shocked when Crosby released a single written by them which bore a strong resemblance to Ram's song. His publishers, Mills Music, sued and got Ram credited on future releases. Buck Ram would end up fighting a lot of lawsuits, with a lot of people.\n\nBut while that biggest credit was the result of a lawsuit, Ram was also, as far as I can tell, an actual songwriter of great ability. Where other managers got themselves credited on songs that they didn't write and in some cases had never heard, to the best of my knowledge there has never been any suggestion that Buck Ram wasn't the sole author of the Platters songs he's credited for.\n\nI'm so used to this working the other way, with managers taking credit for work they didn't do, that I still find it difficult to state for certain that there wasn't *some* sort of scam going on, but Ram had songwriting credits long before getting into the business side of things. Here, for example, is a song he wrote with Chick Webb, sung by Ella Fitzgerald:\n\n[Excerpt: \"Chew Chew Chew Your Bubblegum\", Chick Webb and Ella Fitzgerald]\n\nHe spent several years working as a songwriter and arranger in New York, but made the mistake of moving West in order to get into the film music business, only to find that he couldn't break into the market and had to move into management instead. But making music, rather than managing it, was his first love, and he saw the Platters as a means to that end -- raw material he could mould in his own image.\n\nRam signed the Platters, now a four-piece consisting of Williams, Alex Hodge, David Lynch, and Herb Reed, to a seven-year contract, and started trying to mould them into a hit act.\n\nThe first single they released after signing with Ram was one which, rather oddly, featured Herb Reed on lead vocals on both sides, rather than their normal lead Tony Williams:\n\n[Excerpt: The Platters, \"Roses of Picardy\"]\n\nThey still had the problem, though, that they simply weren't very good at singing. At the time, they didn't know how to sing in harmony -- they'd just take turns singing lead, and often not be able to sing in the same key as each other.\n\nThis didn't have much success, but Ram had an idea. In the forties, he'd managed and written for a group called the Quin-Tones. There were several groups of that name over the years, but this one had been a white vocal group with four men and one woman. They weren't very successful, but here's one of their few surviving recordings, \"Midnight Jamboree\", written and arranged by Ram:\n\n[Excerpt: the Quin-Tones, \"Midnight Jamboree\"]\n\nWorking with the Quin-Tones had given Ram a taste for the particular vocal blend that comes from having four men and one woman. This had been a popular group style in the 1940s, thanks to the influence of the Modernaires -- the vocal group who sang with the Glenn Miller Orchestra -- but had largely fallen out of favour in the 50s. Ram decided to reform the Platters along these lines.\n\nThe woman he chose to bring into the group was a singer Gaynel Hodge knew called Zola Taylor. Taylor had been recording as a solo artist, with little success, but she had a good sound on her recordings for RPM Records:\n\n[Excerpt: Zola Taylor, \"Oh! My Dear\"]\n\nWith Zola in the group, Ram's ideal vocal sound was almost complete. But they hadn't quite got themselves together -- after all, there was still an original member left! But Alex Hodge wouldn't last long, as he was arrested for marijuana possession, and he was replaced by Paul Robi. Gaynel Hodge now claims that this wasn't the real reason that Alex Hodge was sacked – he says that Ram and Herb Reed conspired to get rid of Alex, who in Gaynel's telling had been the original founder of the group, because he knew too much about the music business and was getting suspicious that Ram was ripping him off. Either way, the last original member was now gone, and the Platters were Tony Williams, Zola Taylor, Herb Reed, Paul Robi, and David Lynch.\n\nThis would now be the lineup that would stay together for the rest of the 1950s and beyond.\n\nBefore that change though, the Platters had recorded a song that had sounded so bad that Ram had persuaded the label not to release it.\n\n\"Only You\" was a song that Ram had written with the intention of passing it on to the Ink Spots, but for whatever reason he had never got round to it, though he'd written for the Ink Spots before -- they'd released his \"I'll Lose a Friend Tomorrow\" in 1946:\n\n[Excerpt: The Ink Spots: \"I'll Lose A Friend Tomorrow\"]\n\nHe later said that he'd decided against giving \"Only You\" to the Ink Spots because they'd split up before he had a chance. That's not accurate -- the Ink Spots were still around when the earliest recordings of the song by the Platters were made. More likely, he just didn't like the song. After he wrote it, he stuck the sheet music in a box, where it languished until Jean Bennett, his assistant, was moving things around and the box fell apart. Bennett looked at the song, and said she thought it looked interesting. Ram said it was rubbish, but Bennett put the sheet music on top of Ram's piano. When Tony Williams saw it, he insisted on recording it. But that initial recording seemed to confirm Ram's assessment that the song was terrible:\n\n[Excerpt: The Platters, \"Only You\" (original version), including the incredibly bad ending chord]\n\nDuring this period the band were also recording tracks backing Linda Hayes, and indeed there was also a brother-sister duet credited to Linda Hayes and Tony Williams (of the Platters):\n\n[Excerpt, Linda Hayes and Tony Williams, \"Oochi Pachi\"]\n\nAnd again, Hayes was trying to jump on the bandwagons, recording an \"Annie\" song with the Platters on backing vocals, in the hope of getting some of the money that was going to Hank Ballard and Etta James:\n\n[Excerpt: Linda Hayes and the Platters, \"My Name Ain't Annie\"]\n\nBut none of those records sold at all, and despite Ram's best efforts it looked like the Platters were simply not going to be having any recording success any time soon. Federal dropped them, as it looked likely they were going to do nothing.\n\nBut then, the group got very lucky. Buck Ram became the manager of the Penguins, another group that had formed out of the primal soup of singers around LA. The Penguins had just had what turned out to be their only big hit, with \"Earth Angel\", and Mercury Records were eager to sign them. Ram agreed to the deal, but only on the condition that Mercury signed the Platters as well. Once they were signed, Ram largely gave up on the Penguins, who never had any further success. They'd served his purpose, and got the group he really cared about signed to a major label.\n\nThere was a six-month break between the last session the Platters did for Federal and the first they did for Mercury. During that time, there was only one session -- as backing vocalists for Joe Houston:\n\n[Excerpt: Joe Houston, \"Shtiggy Boom\"]\n\nBut they spent that six months practising, and when they got into the studio to record for Mercury, they suddenly sounded *good*:\n\n[Excerpt: The Platters, \"Only You\"]\n\nEverything had fallen into place. They were now a slick, professional group. They'd even got good enough that they could incorporate mistakes when they worked -- on an early take, Williams' voice cracked on the word \"only\", and he apologised to Ram, who said, \"no, it sounded good, use it\".\n\nAnd \"Only You\" became one of those songs that defines an era. More than any of the doo-wop songs we've covered previously, it's the epitome of 1950s smooth balladry. It was a massive hit -- it spent thirty weeks on the R&B charts, seven of them at number one, and twenty-two weeks on the pop charts, peaking at number five.\n\nFederal rush-released the awful original recording to cash in, and Ram and Mercury took them to court, which eventually ruled in favour of Federal being allowed to put out their version, but the judge also said that that decision might well turn out to be more harmful to Federal than to Mercury. The Federal version didn't chart.\n\nThe follow-up to “Only You”, also by Ram, was even bigger:\n\n[Excerpt: The Platters, \"The Great Pretender\"]\n\nAnd this started a whole string of hits -- \"The Magic Touch\", \"Twilight Time\", \"Smoke Gets in Your Eyes\"... most of these weren't quite as long-lasting as their first two massive hits, but they were regulars at the top of the pop charts. The Platters were, in many ways, the 1950s equivalent to the Ink Spots, and while they started off marketed as a rock and roll group, they soon transitioned into the more lucrative adult market, recording albums of standards.\n\nBut having emulated the Ink Spots in their biggest hits, the Platters also, sadly, emulated the Ink Spots in the way they fell apart. Unfortunately, the only book I've been able to find that talks about the Platters in any depth is written by someone working for Buck Ram's organisation, and so it has a very particular biased take on the legal disputes that followed for the next sixty years. I've tried to counter this by at least skimming some of the court documents that are available online, but it's not really possible to get an accurate sense, either from court filings from 2011 or the mid-eighties, or from a self-published and self-defensive book from 2015, what actually happened between the five Platters, Ram, and Ram's assistant Jean Bennett back in the late 1950s.\n\nWhat everyone seems to agree on, though, is that soon after the Platters were signed to Mercury, a corporation was set up, \"Five Platters Inc\", which was controlled by Buck Ram and had all the members of the Platters as shareholders. The Platters, at the time, assigned any rights they had to the band's name to this corporation.\n\nBut then, in 1959, Tony Williams, who had always wanted a solo career, decided he wanted to pursue one more vigorously. He was going to leave the group, and he put out a solo album:\n\n[Excerpt: Tony Williams, \"Charmaine\"]\n\nIndeed, it seems to have been Buck Ram's plan from the very start to get Williams to be a solo artist, while keeping the Platters as a hit group -- he tried to find a replacement for Williams as early as 1956, although that didn't work out.\n\nFor a while, Williams continued in the Platters, while they looked for a replacement, but his solo career didn't go wonderfully at first. He wasn't helped by all four of the male Platters being arrested, allegedly as customers of sex workers, but in fact because they were sharing their hotel room with white women. All charges against everyone involved were later dropped, but this meant that it probably wasn't the best time for Williams to be starting a solo career.\n\nBut by 1961, Williams had managed to extricate himself from the Platters, and had been replaced by a young singer called Sonny Turner, who could sound a little like Williams. The record company were so convinced that Williams was the important one in the Platters, though, that on many of their recordings for the next year or two Mercury would take completed recordings by the new Platters lineup and overdub new lead vocals from Williams.\n\nBut one at a time the band members left, following Williams. And as each member left, they sold their shares in Five Platters Inc. to Buck Ram or to one of Ram's companies. By 1969 Herb Reed was the only member of the classic lineup still in the group, and then he left the group too, and Buck Ram and his companies continued putting out groups with no original members as the Platters.\n\nNow, this doesn't mean that the real members stopped touring as the Platters. After David Lynch left in 1967, for example, he formed a group called \"The Original Platters\", and got both Zola Taylor and Paul Robi into the group. Tony Williams, Herb Reed, and Sonny Turner all also formed their own groups which toured under the Platters name, competing with the \"official\" Buck Ram Platters.\n\nThere followed forty years of litigation between Ram's companies and various Platters members. And the judgements went both ways, to the point that I can't make accurate judgements from the case documents I've been able to find online. As best as I can understand it, there was a court ruling back in 1974 that the whole purpose of Five Platters Inc. had been to illegally deprive the band members of their ownership in the band name, that it was a sham corporation, and that Buck Ram had illegally benefited from an unfair bargaining position. Shortly after that, it was ruled that FPI's trademark in the Platters name was void. But then there were other cases which went the other way, and Five Platters Inc. insisted that the band members had mostly left because they were alcoholics who didn't want to tour any more, and that they'd given up their rights to the band name of their own free will.\n\nMeanwhile, over a hundred fake Platters groups with no original members went out on the road at various points. There have been almost as many fake Platters as there have fake Ink Spots.\n\nThe band name issues were finally resolved in 2011. By that point Buck Ram was long dead, as were all the members of the classic Platters lineup except Herb Reed. A judge finally ruled that Herb Reed had the rights to the name, and that Five Platters Inc. had never owned the name. Just before that ruling, Five Platters Inc., which was now run by Jean Bennett, announced that they were going to retire the name. Herb Reed died in 2012, shortly afterwards, though the company he licensed the name to still licenses a band to tour as the Platters.\n\nGaynel Hodge, however, is still alive, the last surviving member of the original Platters, and he still performs with his own Platters group, performing songs the Platters recorded after he left. His website hasn't been updated since 2005, but at the time its most recent newsflash was that he had co-written this song with Dr. John for Shemekia Copeland:\n\n[Excerpt: Shemekia Copeland, \"Too Close\"]\n\nGaynel Hodge was a major figure in the California music industry. He'll be turning up in all sorts of odd places in future episodes, as he was involved in a lot of very important records. And we'll definitely be seeing more of both Richard Berry and Cornell Gunter later as well. And meanwhile, somewhere out there are multiple groups of people who've never met anyone who sang on \"Only You\", singing that song right now and calling themselves the Platters.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode thirty-one of A History of Rock Music in Five Hundred Songs. This one looks at \"Only You\" by the Platters. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThis episode ties into several others, but in particular you might want to relisten to the episode on Earth Angel, which features several of the same cast of characters.\n\nThere are no books on the Platters, as far as I know, so as I so often do when talking about vocal groups I relied heavily on Marv Goldberg's website.\n\nFor details of Buck Ram's life, I relied on The Magic Touch of Buck Ram: Songwriter, a self-published book credited to J. Patrick Carr but copyrighted in the name of Gayle Schreiber. Schreiber worked for Buck Ram for many years, and both she and Carr have put out multiple books with similar writing styles and layouts which heap fulsome praise both on Ram and on his assistant Jean Bennett. Those books are low on text and high on pictures from Bennett's personal collection, and they give a version of the story which is very slanted, but they also contain details not available elsewhere.\n\nThis long YouTube interview with Gaynel Hodge was interesting in giving Hodge's side of the story.\n\nSome of the court case documents I read through to try to understand the legal ownership of the Platters name:\nPaul Robi and Tony Williams vs Five Platters Inc\n\nMartha Robi v. Five Platters Inc, Jean Bennett, and Buck Ram\n\nMartha Robi v. Herb Reed\n\nHerb Reed Enterprises v. Jean Bennett, Five Platters, Inc. and Personality Productions, Inc.\n\nThere are many cheap compilations of the Platters' hits. There are also many cheap compilations of rerecorded versions of the Platters' hits sung by people who weren't in the Platters. This is one of the former.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nThe story of the Platters is intimately tied up with another story we've already talked about -- that of the Penguins and \"Earth Angel\". You might want to relisten to that episode -- or listen to it for the first time, if you're coming to this podcast for the first time -- before listening to this one, as this tells a lot of the same story from an alternative perspective. But in both cases Buck Ram ends up being the villain.\n\nAs I mentioned in that episode, there was a lot of movement between different vocal groups, and the Platters were very far from an exception. It's hard to talk about how they formed in the way I normally would, where you talk about these three people meeting up and then getting a friend to join them, and their personalities, and so on, because none of the five people who sang on their biggest hits were among the six people who formed the original group they came from.\n\nThe Platters started out as The Flamingos -- this isn't the same group as the more well-known Flamingos, but a different group, whose lineup was Cornell Gunter, Gaynel Hodge (who was also in the Hollywood Flames at the same time), Gaynel's brother Alex Hodge, Joe Jefferson, Richard Berry, and Curtis Williams.\n\nBut very quickly, the Flamingos started to lose members to other, more popular, groups. The first to leave was Curtis Williams, who went on to join the Hollywood Flames, and from there joined the Penguins.\n\nRichard Berry, meanwhile formed a band called the Hollywood Bluejays and got Cornell Gunter into the group. They recorded one single for John Dolphin's record label, before renaming themselves the Flairs and moving over to Flare records:\n\n[Excerpt: \"She Wants to Rock\", the Flairs]\n\nCornel Gunter would later go on to join the Coasters, and we've already heard some of what Richard Berry would do later on in the episode on \"The Wallflower\".\n\nSo the Flamingos had produced some great talents, but those talents' departure left some gaping h",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode thirty-one of A History of Rock Music in Five Hundred Songs. This one looks at \"Only You\" by the Platters. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThis episode ties into several others, but in particular you might want to relisten to the episode on Earth Angel, which features several of the same cast of characters.\n\nThere are no books on the Platters, as far as I know, so as I so often do when talking about vocal groups I relied heavily on Marv Goldberg's website.\n\nFor details of Buck Ram's life, I relied on The Magic Touch of Buck Ram: Songwriter, a self-published book credited to J. Patrick Carr but copyrighted in the name of Gayle Schreiber. Schreiber worked for Buck Ram for many years, and both she and Carr have put out multiple books with similar writing styles and layouts which hea",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}