{
  "id": "yt:video:YmVpwXH4jhA",
  "yt:videoId": "YmVpwXH4jhA",
  "yt:channelId": "UCsooa4yRKGN_zEE8iknghZA",
  "title": "How friendship affects your brain - Shannon Odell",
  "link": "",
  "author": {
    "name": "TED-Ed",
    "uri": "https://www.youtube.com/channel/UCsooa4yRKGN_zEE8iknghZA"
  },
  "published": "2022-09-15T15:01:08+00:00",
  "updated": "2022-10-21T11:55:55+00:00",
  "media:group": {
    "media:title": "How friendship affects your brain - Shannon Odell",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Dig into what happens to your brain during adolescence that changes how you value, understand, and connect to friends.\n\n--\n\nIf it seems like friendships formed in adolescence are particularly special, that's because they are. Childhood, adolescent, and adult friendships all manifest differently in part because the brain works in different ways at those stages of life. During adolescence, there are changes in the way you value, understand, and connect to friends. Shannon Odell explores the neuroscience of friendship.\n\nLesson by Shannon Odell, directed by Biljana Labović.\n\nThis video made possible in collaboration with Bezos Family Foundation\nLearn more about how TED-Ed partnerships work: https://bit.ly/TEDEdPartners\n\nA special thanks to Ilanit Gordon who provided information and insights for the development of this video.\n\nSupport Our Non-Profit Mission\n----------------------------------------------\nSupport us on Patreon: http://bit.ly/TEDEdPatreon\nCheck out our merch: http://bit.ly/TEDEDShop\n----------------------------------------------\n\nConnect With Us\n----------------------------------------------\nSign up for our newsletter: http://bit.ly/TEDEdNewsletter\nFollow us on Facebook: http://bit.ly/TEDEdFacebook\nFind us on Twitter: http://bit.ly/TEDEdTwitter\nPeep us on Instagram: http://bit.ly/TEDEdInstagram\n----------------------------------------------\n\nKeep Learning\n----------------------------------------------\nView full lesson: https://ed.ted.com/lessons/how-friendship-affects-your-brain-shannon-odell\nDig deeper with additional resources: https://ed.ted.com/lessons/how-friendship-affects-your-brain-shannon-odell#digdeeper\n----------------------------------------------\n\nThank you so much to our patrons for your support! Without you this video would not be possible! Clarence E. Harper Jr., Vignan Velivela, Ana Maria, Exal Enrique Cisneros Tuch, Tejas Dc, Khalifa Alhulail, Martin Stephen, Jose Henrique Leopoldo e Silva, Mandeep Singh, Abhijit Kiran Valluri, Morgan Williams, Devin Harris, Pavel Zalevskiy, Karen Goepen-Wee, Filip Dabrowski, Barbara Smalley, Megan Douglas, Tim Leistikow, Ka-Hei Law, Hiroshi Uchiyama, Mark Morris, Misaki Sato, EdoKun, SookKwan Loong, Bev Millar, Lex Azevedo, Michael Aquilina, Jason A Saslow, Yansong Li, Cristóbal Moenne, Dawn Jordan, Prasanth Mathialagan, Samuel Doerle, David Rosario, Dominik Kugelmann - they-them, Siamak Hajizadeh, Ryohky Araya, Mayank Kaul, Christophe Dessalles, Heather Slater, Sandra Tersluisen, Zhexi Shan, Bárbara Nazaré, Andrea Feliz, Victor E Karhel, Sydney Evans, Latora, Noel Situ, emily lam and Sid.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}