{
  "title": "Episode 105: &#8220;Green Onions&#8221; by Booker T. and the MGs",
  "link": "https://500songs.com/podcast/episode-105-green-onions-by-booker-t-and-the-mgs/",
  "pubDate": "Tue, 24 Nov 2020 20:53:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=344",
  "description": "Episode 105 of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Green Onions\", and how a company started by a Western Swing fiddle player ended up making the most important soul records of the sixties. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/44266315\">\"He's So Fine\" by the Chiffons.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nI used three main books when creating this episode. Two were histories of Stax --&nbsp;<a href=\"https://amzn.to/3nPGLZp\"><em>Soulsville USA: The Story of Stax</em> by Rob Bowman</a>, and&nbsp;<a href=\"https://amzn.to/3ftoePF\"><em>Respect Yourself: Stax Records and the Soul Explosion</em> by Robert Gordon</a>.\n\n<a href=\"https://amzn.to/3lul5BR\"><em>Country Soul</em> by Charles L Hughes</a> is a more general overview of soul music made in Tennessee and Alabama in the sixties, but is useful as it's less likely to take statements about racial attitudes entirely at face value.\n\n<a href=\"https://amzn.to/33f0utB\">This</a> is a good cheap compilation of Booker T and the MGs' music.\n\nIf the Erwin Records tracks here interest you, they're all available on t<a href=\"https://amzn.to/3748Rcx\">his compilation</a>.\n\n<a href=\"https://amzn.to/2UVsGx9\"><em>The Complete Stax-Volt Singles vol. 1: 1959-1968</em> </a>is a nine-CD box set containing much of the rest of the music in this episode. It's out of print physically, but the MP3 edition, while pricey, is worth it.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nAnd now we come to the end of the backfilling portion of the story. Since \"Telstar\" we've been looking at records from 1962 that came out just before \"Love Me Do\" -- we've essentially been in an extended flashback. This is the last of those flashback episodes, and from next week on we're moving forward into 1963.\n\nToday we're going to look at a record by a group of musicians who would be as important to the development of music in the 1960s as any, and at the early years of Stax Records, a label that would become as important as Chess, Motown, or Sun. Today, we're looking at \"Green Onions\" by Booker T. and the MGs, and how a white country fiddle player accidentally kickstarted the most important label in soul music:\n\n[Excerpt: Booker T. and the MGs, \"Green Onions\"]\n\nOur story starts in Memphis, with Jim Stewart, a part-time fiddle player. Stewart was in a Western Swing band, and was hugely influenced by Bob Wills, but he wasn't making any real money from music. Instead, he was working a day job at a bank.\n\nBut he was still interested in music, and wanted to be involved in the industry. One of the gigs he'd had was in the house band at a venue where Elvis sometimes played in his early years, and he'd seen how Elvis had gone from an obscure local boy all the way to the biggest star in the world. He knew he couldn't do that himself, but he was irresistibly attracted to any field where that was *possible*.\n\nHe found his way into the industry, and into music history as a result of a tip from his barber.\n\nThe barber in question, Erwin Ellis, was another country fiddle player, but he owned his own record label, Erwin Records. Erwin Records was a tiny label -- it was so tiny that its first release, by Ellis himself, seems not to exist anywhere. Even on compilations of Erwin Records material, it's not present, which is a shame, as it would be interesting from a historical perspective to hear Ellis' own playing.\n\nBut while Ellis was unsuccessful both as a fiddle player and as a record company owner, he did manage to release a handful of rockabilly classics on Erwin Records, like Hoyt Jackson's \"Enie Meanie Minie Moe\":\n\n[Excerpt: Hoyt Jackson, \"Enie Meanie Minie Moe\"]\n\nand \"Boppin' Wig Wam Willie\" by Ray Scott, who had written \"Flyin' Saucers Rock & Roll\" for Billy Lee Riley, and who was backed by Riley's Little Green Men on this single:\n\n[Excerpt: Ray Scott, \"Boppin' Wig Wam WIllie\"]\n\nEllis' label wasn't hugely successful, but he made some decent money from it, and he explained the realities of the music industry to Stewart as Stewart was sat in his barber's chair. He told Stewart that you didn't make money from the records themselves -- small labels didn't sell much -- but that he was making some good money from the songs.\n\nThe formula for success in the music business, Ellis explained, was that when you got a new artist through the door, you told them they could only record originals, not cover versions -- and then you made sure they signed the publishing over to you. If you sold a record, you were just selling a bit of plastic, and you'd already paid to make the bit of plastic. There was no real money in that. But if you owned the song, every time that record was played on the radio, you got a bit of money with no extra outlay -- and if you owned enough songs, then some of them might get covered by a big star, and then you'd get some real money. Hoyt Jackson, Ellis' biggest act, hadn't had any hits himself, but he'd written \"It's A Little More Like Heaven (Where You Are)\":\n\n[Excerpt: Hoyt Jackson, \"It's A Little More Like Heaven (Where You Are)\"]\n\nHank Locklin had recorded a cover version of it, which had gone to number three on the country charts:\n\n[Excerpt: Hank Locklin \"It's a Little More Like Heaven\"]\n\nAnd Johnny Cash had rewritten it a bit, as \"You're the Nearest Thing to Heaven\", and had also had a top five country hit with it:\n\n[Excerpt: Johnny Cash, \"You're the Nearest Thing to Heaven\"]\n\nEllis explained to Stewart that he was still getting cheques every few months because he owned the publishing for this song that someone else had written and brought to him. If you owned the publishing for a song that became a hit, then you had a steady source of income without having to lift a finger. And people would just give you the publishing on their songs if you agreed to put a record of them out.\n\nFor someone like Stewart, who worked in a bank and knew a little bit about finance, that sounded just about perfect. He pulled together a singing DJ, a piano player, and a rhythm guitarist he knew, and they pooled their savings and raised a thousand dollars to put out a record. Stewart wrote a song -- the only song he'd ever write -- Fred Byler, the DJ, sang it, and they hired Ellis and his tape recorder to record it in Jim's wife's uncle's garage. They came up with the name Satellite Records for their label -- nobody liked it, but they couldn't think of anything better, and satellites were in the news with the recent launch of Sputnik. \"Blue Roses\" by Fred Byler, came out to pretty much no sales or airplay:\n\n[Excerpt: Fred Byler, \"Blue Roses\"]\n\nThe next record was more interesting -- \"Boppin' High School Baby\" by Don Willis is a prime slice of Memphis rockabilly, though one with so much slapback echo that even Joe Meek might have said \"hang on, isn't that a bit much?\":\n\n[Excerpt: Don Willis, \"Boppin' High School Baby\"]\n\nThat also didn't sell -- Stewart and his partners knew nothing about the music business. They didn't know how to get the records distributed to shops, and they had no money left. And then Erwin Ellis moved away and took his tape recorder with him, and Stewart's wife's uncle wanted to use his garage again and so wouldn't let them record there any more. It looked like that would be the end of Satellite Records. But then three things changed everything for Jim Stewart, and for music history.\n\nThe first of these was that Stewart's new barber was also interested in music -- he had a daughter who he thought could sing, and he had a large storage space he wasn't using, in Brunswick on the outskirts of the city. If they'd record his daughter, they could use the storage space as a studio.\n\nThe second was Chips Moman. Chips was a teenage guitarist who had been playing a friend's guitar at a drugstore in Memphis, just hanging around after work, when Warren Smith walked in. Smith was a Sun Records rockabilly artist, who'd had a minor hit with \"Rock and Roll Ruby\":\n\n[Excerpt: Warren Smith, \"Rock and Roll Ruby\"]\n\nSmith liked Moman's playing, and offered him a job -- Moman's initial response was \"doing what?\"\n\nMoman had joined Smith's band on guitar, then played with Johnny and Dorsey Burnette. He went with the Burnettes to California, where he was a session player for a time -- though I've never been able to find a list of any of the records he played on, just people saying he played at Gold Star Studios. He'd then joined Gene Vincent's Blue Caps, before being in an accident which had led him to come back to Memphis. He'd played guitar on the Don Willis session, and he'd essentially produced it, applying some of the techniques he'd learned in Californian studios. He was young, he was eager to make records, and he knew what he was doing.\n\nAnd the third event was that Stewart managed to persuade his sister, Estelle Axton, to buy out his business partners. Estelle was a naturally business-minded person who also had a yearning to do something involving music, and had been doing things in little ways. For example, the people where she worked all liked music but found they were too busy to go to the record shop -- so Estelle would make a list of records they liked, go to one of the wholesalers that distributed music to record shops, buy records there for seventy-six cents, and sell them to her colleagues for a dollar.\n\nEstelle persuaded her husband, against his better judgement, to remortgage their house, and she used the money to buy recording equipment. Moman helped them set it up in the barber's storage space, and Satellite Records started up again, restarting their numbering as if from scratch with what they were now considering their first real release -- a song that Moman had co-written, sung by a black vocal group, the Vel-Tones:\n\n[Excerpt: The Vel-Tones, \"Fool in Love\"]\n\nThe record was pretty much in the style of the white pop semi-doo-wop that was charting at the time, but the singers were black, and so it had to be promoted as R&B, and Jim Stewart made visits to Black DJs like Al Bell and Rufus Thomas, and managed to get the record some airplay. It was popular enough that the record got picked up for distribution by Mercury, and actually brought Satellite a small profit.\n\nBut the label still wasn't doing well, and they were finding it difficult to persuade musicians to trek all the way out to Brunswick. And the studio space was bad in other ways -- it was right near a train track, and the noise of the trains would disrupt the sessions. And while it was free, at some point they would actually have to make a record featuring Stewart's barber's daughter, which nobody actually fancied doing.\n\nSo they decided to move studios again, and in doing so they were inspired by another Memphis record label. Hi Records had started around the same time as Satellite, and it had had a few big hits, most notably \"Smokie (Part 2)\" by the Bill Black Combo, the group that Elvis' former bass player had formed when Elvis had joined the army:\n\n[Excerpt: Bill Black Combo: \"Smokie (Part 2)\"]\n\nFor their studio, Hi used an old cinema -- a lot of cinemas were closing down in the late fifties, due to the combination of television and the drive-in making indoor cinemas less appealing, and because white flight to the suburbs meant that people with money no longer lived in walking distance of cinemas the way they used to.\n\nThe Satellite team found an old cinema on East McLemore Avenue, much closer to the centre of Memphis and easier for musicians to get to. That cinema had stopped showing films a year or two earlier, and there'd been a brief period where it had been used for country music performances, but the area was becoming increasingly Black, as white people moved away, and while plenty of Black people liked country music, they weren't exactly welcomed to the performances in segregated 1950s Memphis, and so the building was abandoned, and available cheap.\n\nMeanwhile, Estelle's son Charles was trying to get into the music business, too. Before I go any further in talking about him, I should say that I've had to depart from my normal policy when talking about him. Normally, I refer to people by the name they chose to go by, but in his case he was known by a nickname which was harmless in that time and place, but later became an extremely offensive racist slur in the UK, used against people of Pakistani descent. The word didn't have those connotations in the US at the time, and he died before its use as a slur became widely known over there, but I'm just going to call him Charles.\n\nAnd speaking of words which might be considered racial slurs, the band that Charles joined -- an all-white group who loved to play R&B -- was called the Royal Spades. This was supposedly because of their love of playing cards, but there's more than a suspicion that the racial connotations of the term were used deliberately, and that these white teenage boys were giggling at their naughty racial transgressiveness.\n\nThe group had originally just been a guitar/bass/drum band, but Charles Axton had approached them and suggested they should get a horn section, offering his services as a tenor player. They'd laughed when he told them he'd only been playing a couple of weeks, but once he explained that his mother and uncle owned a record label, he was in the group, and they'd expanded to have a full horn section. The group was led by guitarist Steve Cropper and also included his friend, the bass player Duck Dunn, and Cropper and Charles Axton helped with the refurbishing of the cinema into a recording studio.\n\nThe cinema had another advantage, too -- as well as the auditorium, which became the studio, it had a lobby and concession stand. Estelle Axton turned that into a record shop, which she ran herself -- with Cropper often helping out behind the counter. She instituted a policy that, unlike other record shops, people could hang around all day listening to music, without necessarily buying anything. She also brought in a loyalty card scheme -- buy nine records and get a tenth record for free -- which allowed her to track what individual customers were buying. She soon became so knowledgeable about what was selling to the Black teenagers of the area that she boasted that if you came into the shop with twenty dollars, she'd have sold you nineteen dollars' worth of records before you left -- she'd leave you with a dollar so you could pay for your transport home, to make sure you could come back with more money.\n\nBy having a record shop in the record studio itself, they knew what was selling and could make more music that sounded like that. By having a crowd around all day listening to music, they could put the new recordings on and gauge the response before pressing a single copy. Satellite Records suddenly had a market research department.\n\nAnd they soon had an ally in getting them airplay. Rufus Thomas was the most important man in Black entertainment in Memphis. He was a popular DJ and comedian, he was the compere at almost every chitlin' circuit show in the area, and he was also a popular singer. He'd been the one to record the first hit on Sun Records, \"Bear Cat\", the answer record to \"Hound Dog\" we talked about way back in episode fifteen:\n\n[Excerpt: Rufus Thomas, \"Bear Cat\"]\n\nRufus Thomas knew Jim Stewart from when Stewart had been promoting the Vel-Tones single, and so he came into the newly opened studio and suggested he cut a few tracks. If you've got a record label, and a DJ wants to make a record with you, that's a godsend -- you're guaranteed airplay, not only for that record, but for a few of your others. And if that DJ also happens to be a genuine talent who'd made hit records before, you jump at the chance.\n\nThomas also brought in his daughter, Carla, who happened to have an astonishing voice.\n\nFor the first session in the new studio, they recorded a song Rufus had written, \"'Cause I Love You\", with a few musicians that he knew, including a bass player called Wilbur Steinberg, and with Steve Cropper sitting in on guitar and Chips Moman producing. Also in the studio was David Porter, a teenager who sang in a band with Bob Tally, the trumpet player on the session -- Porter was skipping school so he could be in a real recording studio, even though he wasn't going to be singing on the session.\n\nWhen they started playing the song, Tally decided that it would sound good with a baritone sax on it. Nobody in the studio played saxophone, but then Porter remembered one of his classmates at Booker T Washington High School. This classmate was also called Booker T. -- Booker T. Jones -- and he could play everything. He played oboe, sax, trombone, double bass, guitar, and keyboards, and played them all to a professional standard.\n\nPorter popped over to the school, walked into the classroom Jones was in, told the teacher that another teacher wanted to see Jones, pulled him out of the class, and told him he was going to make a record. They borrowed a baritone sax from the school's music room, went back to the studio, and Jones played on \"'Cause I Love You\" by Rufus and Carla Thomas:\n\n[Excerpt: Rufus and Carla Thomas, \"'Cause I Love You\"]\n\n\"'Cause I Love You\" became a local hit, and soon Jim Stewart got a call from Jerry Wexler at Atlantic, offering to start distributing it, and any future records by Rufus and Carla Thomas. Stewart didn't really know anything about the business, but when Wexler explained to Stewart that he was the producer of \"What'd I Say\" by Ray Charles, Stewart knew that was someone he needed to work with -- he'd recently had a sort of Damascene conversion after hearing that record, and was now fully committed to his company's new R&B style. For a five thousand dollar advance, Atlantic ended up with the rights to press and distribute all future masters from Satellite.\n\nThe next single from the label was a Carla Thomas solo record, \"Gee Whizz, Look at His Eyes\". For that session, they booked in some string players, and Bob Tally was meant to write an arrangement for them. However, he didn't turn up to the session, and when Stewart went round to his house to find him, he discovered that Tally hadn't written the arrangement, and had been up all night playing at a gig and was in no fit state to write one. Stewart had to make the string players play from a head arrangement -- something string players normally never do -- and ended up giving them directions like \"just play donuts!\", meaning semibreves or whole notes, which are drawn as ovals with a hole in the middle, like a donut.\n\nDespite this, \"Gee Whizz\" went to number five on the R&B charts and ten on the pop charts. Satellite Records had a real hit:\n\n[Excerpt: Carla Thomas, \"Gee Whizz, Look at His Eyes\"]\n\nSatellite were starting to build up a whole team of people they could call on. Steve Cropper was working in the record shop, so he was available whenever they needed a guitar part playing or a second keyboard adding. David Porter was working at Big Star, the grocery store across the road, and he turned out to be a talented songwriter and backing vocalist. And of course there was the band that Cropper and Charles Axton were in, which had now been renamed to the Mar-Keys, a pun on \"marquis\" as in the noble title, and \"keys\" as in keyboards, as Estelle Axton thought -- entirely correctly -- that their original name was inappropriate. They also had a pool of Black session players they could call on, mostly older people who'd been brought to them by Rufus Thomas, and there were always eager teenagers turning up wanting to do anything they could in order to make a record.\n\nIt was the Mar-Keys who finally gave Satellite the distinctive sound they were looking for. Or, at least, it was under the Mar-Keys' name that the record was released.\n\nAn instrumental, \"Last Night\", was recorded at several sessions run by Moman, often with different lineups of musicians. The Mar-Keys at this point consisted of Steve Cropper, Duck Dunn, Charles Axton, Wayne Jackson, Terry Johnson, Smoochy Smith, and Don Nix, but the lineup on the finished recording had Smith on keyboards, Axton on sax and Jackson on trumpet, with some sources saying that Cropper provided the second keyboard part while others say he only played on outtakes, not on the final version. The other four musicians were Black session players -- Lewie Steinberg, Wilbur's brother, on bass, Gilbert Caples and Floyd Newman on saxes, and Curtis Green on drums. Floyd Newman also did the spoken \"Ooh, last night!\" that punctuated the record:\n\n[Excerpt: The Mar-Keys, \"Last Night\"]\n\nJim Stewart and Chips Moman were both convinced that would be a flop, as was Jerry Wexler when he heard it. But Estelle Axton believed in its potential -- and also believed in her son, who Stewart had little time for. Jim Stewart didn't want his useless nephew's band on his label at all if he could help it, but Estelle Axton wanted her son to have a hit. She got a test pressing to a DJ, who started playing it, and people started coming into the shop asking for the record.\n\nEventually, Stewart gave in to his sister's pressure, and agreed to release the record. There was only one problem -- when they pulled the tape out, they found that the first section of the track had somehow been erased. They had to hunt through the rubbish, looking through discarded bits of tape, until they found another take of the song that had a usable beginning they could splice in. They did a very good job -- I *think* I can hear the splice, but if it's where I think it is, it's about the cleanest editing job on analogue tape I've ever heard. If I'm right, the edit comes right in the middle of this passage:\n\n[Excerpt: The Mar-Keys, \"Last Night\"]\n\nDid you hear it?\n\nThe song's authorship has been debated over the years, because the horn part and the keyboard part were written separately. Caples and Newman, the session sax players, had come up with the horn part, and so always said they should get solo composition credit. Smoochy Smith had separately written the keyboard part, which came from something he'd been working on on his own, so he got credit too. Chips Moman had suggested combining the keyboard and horn lines, and so he got songwriting credit as well. And Charles Axton didn't contribute anything to the song other than playing on the record, but because his family owned the record label, he got credit as well.\n\nThe record became a big hit, and there are a couple of hypotheses as to why. Steve Cropper always argued that it was because you could dance the Twist to it, and so it rode the Twist craze, while others have pointed out that at one point in the record they leave a gap instead of saying \"Ooh last night\" as they do the rest of the way through. That gap allowed DJs to do the interjection themselves, which encouraged them to play it a lot.\n\nIt made number three on the pop charts and number two on the R&B charts, and it led to Satellite Records coming to the attention of another label, also called Satellite, in California, who offered to sell the Memphis label the rights to use the name. Jim Stewart had never liked Satellite as a name anyway, and so they quickly reissued the record with a new label, named after the first letters of Jim Stewart and Estelle Axton's surnames. Stax Records was born.\n\nThe Mar-Keys immediately hit the road to promote the single -- which brought resentment from the Black session players, some of whom claim that during the session it hadn't even been intended as a Mar-Keys record, and who were annoyed that even though the record was primarily their work they weren't getting the recognition and a bunch of white boys were.\n\nCropper soon got tired of the tour, quit the group and came back to Memphis -- he was annoyed partly because the other band members, being teenage boys, many of them away from home for the first time, acted like wild animals, and partly because Cropper and Charles Axton both believed themselves to be the band's leader and that the other should obey them. Cropper went back to working in the record shop, and playing on sessions at Stax.\n\nThe second Mar-Keys single was recorded by the studio musicians while the group were out on tour -- the first they even knew about it was when they saw it in the shop:\n\n[Excerpt: The Mar-Keys, \"The Morning After\"]\n\nThat was much less successful, but the label was still interested in making instrumentals. They started a subsidiary label, Volt -- if you put records out with two different label names, it was more likely that radio stations would play more of your records, because it wouldn't seem like they were playing one label too much -- and the first single on it was an instrumental that Chips Moman wrote, \"Burnt Biscuits\", by a group consisting of Moman, Rufus Thomas' son Mavell, Lewie Steinberg, and Howard Grimes:\n\n[Excerpt: The Triumphs, \"Burnt Biscuits\"]\n\nThat wasn't a hit, though Moman thought it had the potential to become as big as \"Last Night\". It was released under the name \"the Triumphs\", after the sports car Moman drove.\n\nShortly after that, Moman produced what would be the last classic record he'd make for Stax, when he produced \"You Don't Miss Your Water\" by a new singer, William Bell, who had previously been one of the backing vocalists on \"Gee Whiz\". That track had Mavell Thomas on piano, Lewie Steinberg on bass, Ron Capone on drums, and Booker T. Jones on organ -- by this point Booker T. was being called on a lot to play keyboards, as Floyd Newman recommended him as a reliable piano player in the hopes that if Jones was on keyboards, he wouldn't be playing baritone sax, so Newman would get more of those gigs:\n\n[Excerpt: William Bell, \"You Don't Miss Your Water\"]\n\nThat was a great record, one of the defining records of the new country-soul genre along with Arthur Alexander's records, but it would be the last thing Moman would do at Stax. He'd not been getting on with Estelle Axton, and he also claims that he had been promised a third of the company, but Jim Stewart changed his mind and refused to cut him in. Everyone has a different story about what happened, but the upshot was that Moman left the company, went to Nashville for a while, and then founded his own studio, American, in another part of Memphis. Moman would become responsible for writing and producing a whole string of soul, country, and rock classics, and I'm sure we'll be hearing more from him in the next couple of years.\n\nAfter Moman left, the label floundered a little bit for a few months. Jim Stewart and Steve Cropper split the production duties that Moman had had between them. Stewart had already produced several records for Carla Thomas, and Cropper was a great musician who had been spending every second he could learning how to make records, so they could cope, but they released a mixture of really good soul records that failed to hit the charts, and truly dire novelty country songs like \"The Three Dogwoods\" by Nick Charles, a song from the perspective of the tree that became the cross on which Jesus was crucified:\n\n[Excerpt: Nick Charles, \"The Three Dogwoods\"]\n\nThat was co-written by Cropper, which shows that even the man who co-wrote \"In the Midnight Hour\", \"Dock of the Bay\" and \"Knock on Wood\" had his off days.\n\nThe record that would prove Stax to be capable of doing great things without Chips Moman came about by accident. Stax was still not exclusively a soul label, and it was cutting the odd country and rockabilly record, and one of the people who was going to use the studio was Billy Lee Riley. You might remember Riley from a year ago, when we looked at his \"Flyin' Saucers Rock 'n' Roll\":\n\n[Excerpt: Billy Lee Riley and the Little Green Men, \"Flyin' Saucers Rock 'n' Roll\"]\n\nRiley was running his own label at the time, and doing various bits of session work and singing for other people. No-one's quite sure what he was using the studio for in early 1962 -- some say he was cutting a jingle, some say he cut a few actual tracks but that they were awful, and others that he turned up too drunk to record. Either way, the session ended early, and the musicians were at a loose end.\n\nThe musicians on this session were three of the regular Stax musicians -- Steve Cropper, who had just turned twenty, on guitar, Booker T. Jones, who was still a teenager, on organ, and Lewie Steinberg, a decade older than either, on bass. The fourth musician was Al Jackson, who like Steinberg was an older Black man who had cut his teeth playing jazz and R&B throughout the fifties. Booker had played with Jackson in Willie Mitchell's band, and had insisted to everyone at Stax that they needed to get this man in, as he was the best drummer Jones had ever heard.\n\nJackson was making money from gigging, and didn't want to waste his time playing sessions, which he thought would not be as lucrative as his regular gigs with Willie Mitchell. Eventually, Stax agreed to take him on on a salary, rather than just paying him one-off session fees, and so he became the first musician employed by Stax as a full-time player -- Cropper was already on salary, but that was for his production work and his work at the record shop.\n\nAs the session had ended rather disappointingly, the four were noodling on some blues as they had nothing better to do. Jim Stewart clicked on the talkback from the control room to tell them to go home, but then heard what they were playing, and told them to start it again so he could get it down on tape:\n\n[Excerpt: Booker T and the MGs, \"Behave Yourself\"]\n\nStewart was happy with that track, but singles needed two sides, and so they needed to come up with something else. Cropper remembered a little musical lick he'd heard on the radio one day when he'd been driving with Booker -- they'd both been fascinated by that lick, but neither could remember anything else about the song (and to this day no-one's figured out what the song they'd heard was). They started noodling around with that lick, and shaped it into a twelve-bar instrumental:\n\n[Excerpt: Booker T. and the MGs, \"Green Onions\"]\n\nThat was even better than the other track, and they needed a funky name to go with such a funky track. Lewie Steinberg thought that onions were the funkiest thing he could think of, and so the track became \"Green Onions\". As the last instrumental they'd released with food as a title, \"Burnt Biscuits\", had been by the Triumphs, they thought the group name should be another sports car name, and so it came out as by Booker T and the MGs.\n\n(They later said that MG stood either for Memphis Group or for Mixed Group, because they had both Black and white members, but the original idea was definitely the car – they just didn't want to have a trademark lawsuit on their hands).\n\n\"Green Onions\" went to number one on the R&B charts and number three on the pop charts, and became the biggest thing Stax had ever recorded.\n\nThat core group became the Stax house band, playing on every session from that point on. If they recorded an instrumental on their own, it went out as by Booker T and the MGs. If they recorded an instrumental with horn players, it went out as by the Mar-Keys, and they also played backing all the singers who came through the door of Stax, and there would be a lot of them over the next few years.\n\nThere were a couple of changes -- Booker T actually went off to university soon after recording \"Green Onions\", so for a couple of years he could only play on weekends and during holidays -- on weekdays, the studio used another keyboard player, again suggested by Floyd Newman, who had hired a young man for his bar band when the young man could only play piano with one hand, just because he seemed to have a feel for the music. Luckily, Isaac Hayes had soon learned to play with both hands, and he fit right in while Booker was away at university.\n\nThe other change came a couple of years later, when after the MGs had had a few hits, Lewie Steinberg was replaced by Duck Dunn. Steinberg always claimed that the main reason he was dropped from the MGs was because he was Black and Steve Cropper wanted another white man. Cropper has always said it was because Duck Dunn had a harder-edged style that fit their music better than Steinberg's looser feel, but also that Dunn had been his best friend for years and he wanted to play more with him. The two Black members of the MGs have never commented publicly, as far as I can tell, on the change.\n\nBut whether with Jones or Hayes, Steinberg or Dunn, the MGs would be the foundation of Stax's records for the rest of the sixties, as well as producing a string of instrumental hits. And it was those instrumental hits that led to the arrival of the person who would make Stax a legendary label.\n\nJoe Galkin, a record promoter to whom Jim Stewart owed a favour, was managing a local guitarist, Johnny Jenkins, and brought him into the studio to see if Stax could get him an instrumental hit, since they'd had a few of those. Jenkins did eventually release a single on Stax, but it wasn't particularly special, and didn't have any success:\n\n[Excerpt: Johnny Jenkins, \"Spunky\"]\n\nThe day of Jenkins' first session was a flop, they'd not been able to get anything decent recorded, and the musicians started to pack up. But Galkin had made a deal with the singer in Jenkins' band -- if he'd drive Jenkins to the studio, since Jenkins couldn't drive, he'd try to get a record cut with him as well. Nobody was interested, but Galkin wore Jim Stewart down and he agreed to listen to this person who he just thought of as Johnny Jenkins' driver. After hearing him, Steve Cropper ran out to get Lewie Steinberg, who was packing his bass away, and tell him to bring it back into the studio. Cropper played piano, Jenkins stayed on guitar, and Booker, Al, and Lewie played their normal instruments.\n\nJim Stewart wasn't particularly impressed with the results, but he owed Galkin a favour, so he released the record, a fun but unoriginal Little Richard soundalike:\n\n[Excerpt: Otis Redding, \"Hey Hey Baby\"]\n\nBut soon DJs flipped the record, and it was the B-side that became the hit:\n\n[Excerpt: Otis Redding, \"These Arms of Mine\"]\n\nOtis Redding would never again be thought of as just Johnny Jenkins' driver, and Stax Records was about to hit the big time.",
  "itunes:subtitle": "Episode 105 of A History of Rock Music in Five Hundred Songs looks at Green Onions, and how a company started by a Western Swing fiddle player ended up making the most important soul records of the sixties. Click the full post to read liner notes, links ",
  "itunes:keywords": "Al Jackson,Atlantic Records,Bill Black,Billy Lee Riley,Booker T. and the MGs,Booker T. Jones,Carla Thomas,Chips Moman,Donald \"Duck\" Dunn,Dorsey Burnette,Gene Vincent,Hi Records,Jerry Wexler,Johnny Burnette,Johnny Cash,Otis Redding,racism,rockabilly,Rufus Thomas,satellites,soul,Stax Records,Steve Cropper,The Mar-Keys,the Twist,Warren Smith,western swing",
  "itunes:episodeType": "full",
  "itunes:episode": 105,
  "content:encoded": "Episode 105 of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Green Onions\", and how a company started by a Western Swing fiddle player ended up making the most important soul records of the sixties. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/44266315\">\"He's So Fine\" by the Chiffons.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nI used three main books when creating this episode. Two were histories of Stax --&nbsp;<a href=\"https://amzn.to/3nPGLZp\"><em>Soulsville USA: The Story of Stax</em> by Rob Bowman</a>, and&nbsp;<a href=\"https://amzn.to/3ftoePF\"><em>Respect Yourself: Stax Records and the Soul Explosion</em> by Robert Gordon</a>.\n\n<a href=\"https://amzn.to/3lul5BR\"><em>Country Soul</em> by Charles L Hughes</a> is a more general overview of soul music made in Tennessee and Alabama in the sixties, but is useful as it's less likely to take statements about racial attitudes entirely at face value.\n\n<a href=\"https://amzn.to/33f0utB\">This</a> is a good cheap compilation of Booker T and the MGs' music.\n\nIf the Erwin Records tracks here interest you, they're all available on t<a href=\"https://amzn.to/3748Rcx\">his compilation</a>.\n\n<a href=\"https://amzn.to/2UVsGx9\"><em>The Complete Stax-Volt Singles vol. 1: 1959-1968</em> </a>is a nine-CD box set containing much of the rest of the music in this episode. It's out of print physically, but the MP3 edition, while pricey, is worth it.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nAnd now we come to the end of the backfilling portion of the story. Since \"Telstar\" we've been looking at records from 1962 that came out just before \"Love Me Do\" -- we've essentially been in an extended flashback. This is the last of those flashback episodes, and from next week on we're moving forward into 1963.\n\nToday we're going to look at a record by a group of musicians who would be as important to the development of music in the 1960s as any, and at the early years of Stax Records, a label that would become as important as Chess, Motown, or Sun. Today, we're looking at \"Green Onions\" by Booker T. and the MGs, and how a white country fiddle player accidentally kickstarted the most important label in soul music:\n\n[Excerpt: Booker T. and the MGs, \"Green Onions\"]\n\nOur story starts in Memphis, with Jim Stewart, a part-time fiddle player. Stewart was in a Western Swing band, and was hugely influenced by Bob Wills, but he wasn't making any real money from music. Instead, he was working a day job at a bank.\n\nBut he was still interested in music, and wanted to be involved in the industry. One of the gigs he'd had was in the house band at a venue where Elvis sometimes played in his early years, and he'd seen how Elvis had gone from an obscure local boy all the way to the biggest star in the world. He knew he couldn't do that himself, but he was irresistibly attracted to any field where that was *possible*.\n\nHe found his way into the industry, and into music history as a result of a tip from his barber.\n\nThe barber in question, Erwin Ellis, was another country fiddle player, but he owned his own record label, Erwin Records. Erwin Records was a tiny label -- it was so tiny that its first release, by Ellis himself, seems not to exist anywhere. Even on compilations of Erwin Records material, it's not present, which is a shame, as it would be interesting from a historical perspective to hear Ellis' own playing.\n\nBut while Ellis was unsuccessful both as a fiddle player and as a record company owner, he did manage to release a handful of rockabilly classics on Erwin Records, like Hoyt Jackson's \"Enie Meanie Minie Moe\":\n\n[Excerpt: Hoyt Jackson, \"Enie Meanie Minie Moe\"]\n\nand \"Boppin' Wig Wam Willie\" by Ray Scott, who had written \"Flyin' Saucers Rock & Roll\" for Billy Lee Riley, and who was backed by Riley's Little Green Men on this single:\n\n[Excerpt: Ray Scott, \"Boppin' Wig Wam WIllie\"]\n\nEllis' label wasn't hugely successful, but he made some decent money from it, and he explained the realities of the music industry to Stewart as Stewart was sat in his barber's chair. He told Stewart that you didn't make money from the records themselves -- small labels didn't sell much -- but that he was making some good money from the songs.\n\nThe formula for success in the music business, Ellis explained, was that when you got a new artist through the door, you told them they could only record originals, not cover versions -- and then you made sure they signed the publishing over to you. If you sold a record, you were just selling a bit of plastic, and you'd already paid to make the bit of plastic. There was no real money in that. But if you owned the song, every time that record was played on the radio, you got a bit of money with no extra outlay -- and if you owned enough songs, then some of them might get covered by a big star, and then you'd get some real money. Hoyt Jackson, Ellis' biggest act, hadn't had any hits himself, but he'd written \"It's A Little More Like Heaven (Where You Are)\":\n\n[Excerpt: Hoyt Jackson, \"It's A Little More Like Heaven (Where You Are)\"]\n\nHank Locklin had recorded a cover version of it, which had gone to number three on the country charts:\n\n[Excerpt: Hank Locklin \"It's a Little More Like Heaven\"]\n\nAnd Johnny Cash had rewritten it a bit, as \"You're the Nearest Thing to Heaven\", and had also had a top five country hit with it:\n\n[Excerpt: Johnny Cash, \"You're the Nearest Thing to Heaven\"]\n\nEllis explained to Stewart that he was still getting cheques every few months because he owned the publishing for this song that someone else had written and brought to him. If you owned the publishing for a song that became a hit, then you had a steady source of income without having to lift a finger. And people would just give you the publishing on their songs if you agreed to put a record of them out.\n\nFor someone like Stewart, who worked in a bank and knew a little bit about finance, that sounded just about perfect. He pulled together a singing DJ, a piano player, and a rhythm guitarist he knew, and they pooled their savings and raised a thousand dollars to put out a record. Stewart wrote a song -- the only song he'd ever write -- Fred Byler, the DJ, sang it, and they hired Ellis and his tape recorder to record it in Jim's wife's uncle's garage. They came up with the name Satellite Records for their label -- nobody liked it, but they couldn't think of anything better, and satellites were in the news with the recent launch of Sputnik. \"Blue Roses\" by Fred Byler, came out to pretty much no sales or airplay:\n\n[Excerpt: Fred Byler, \"Blue Roses\"]\n\nThe next record was more interesting -- \"Boppin' High School Baby\" by Don Willis is a prime slice of Memphis rockabilly, though one with so much slapback echo that even Joe Meek might have said \"hang on, isn't that a bit much?\":\n\n[Excerpt: Don Willis, \"Boppin' High School Baby\"]\n\nThat also didn't sell -- Stewart and his partners knew nothing about the music business. They didn't know how to get the records distributed to shops, and they had no money left. And then Erwin Ellis moved away and took his tape recorder with him, and Stewart's wife's uncle wanted to use his garage again and so wouldn't let them record there any more. It looked like that would be the end of Satellite Records. But then three things changed everything for Jim Stewart, and for music history.\n\nThe first of these was that Stewart's new barber was also interested in music -- he had a daughter who he thought could sing, and he had a large storage space he wasn't using, in Brunswick on the outskirts of the city. If they'd record his daughter, they could use the storage space as a studio.\n\nThe second was Chips Moman. Chips was a teenage guitarist who had been playing a friend's guitar at a drugstore in Memphis, just hanging around after work, when Warren Smith walked in. Smith was a Sun Records rockabilly artist, who'd had a minor hit with \"Rock and Roll Ruby\":\n\n[Excerpt: Warren Smith, \"Rock and Roll Ruby\"]\n\nSmith liked Moman's playing, and offered him a job -- Moman's initial response was \"doing what?\"\n\nMoman had joined Smith's band on guitar, then played with Johnny and Dorsey Burnette. He went with the Burnettes to California, where he was a session player for a time -- though I've never been able to find a list of any of the records he played on, just people saying he played at Gold Star Studios. He'd then joined Gene Vincent's Blue Caps, before being in an accident which had led him to come back to Memphis. He'd played guitar on the Don Willis session, and he'd essentially produced it, applying some of the techniques he'd learned in Californian studios. He was young, he was eager to make records, and he knew what he was doing.\n\nAnd the third event was that Stewart managed to persuade his sister, Estelle Axton, to buy out his business partners. Estelle was a naturally business-minded person who also had a yearning to do something involving music, and had been doing things in little ways. For example, the people where she worked all liked music but found they were too busy to go to the record shop -- so Estelle would make a list of records they liked, go to one of the wholesalers that distributed music to record shops, buy records there for seventy-six cents, and sell them to her colleagues for a dollar.\n\nEstelle persuaded her husband, against his better judgement, to remortgage their house, and she used the money to buy recording equipment. Moman helped them set it up in the barber's storage space, and Satellite Records started up again, restarting their numbering as if from scratch with what they were now considering their first real release -- a song that Moman had co-written, sung by a black vocal group, the Vel-Tones:\n\n[Excerpt: The Vel-Tones, \"Fool in Love\"]\n\nThe record was pretty much in the style of the white pop semi-doo-wop that was charting at the time, but the singers were black, and so it had to be promoted as R&B, and Jim Stewart made visits to Black DJs like Al Bell and Rufus Thomas, and managed to get the record some airplay. It was popular enough that the record got picked up for distribution by Mercury, and actually brought Satellite a small profit.\n\nBut the label still wasn't doing well, and they were finding it difficult to persuade musicians to trek all the way out to Brunswick. And the studio space was bad in other ways -- it was right near a train track, and the noise of the trains would disrupt the sessions. And while it was free, at some point they would actually have to make a record featuring Stewart's barber's daughter, which nobody actually fancied doing.\n\nSo they decided to move studios again, and in doing so they were inspired by another Memphis record label. Hi Records had started around the same time as Satellite, and it had had a few big hits, most notably \"Smokie (Part 2)\" by the Bill Black Combo, the group that Elvis' former bass player had formed when Elvis had joined the army:\n\n[Excerpt: Bill Black Combo: \"Smokie (Part 2)\"]\n\nFor their studio, Hi used an old cinema -- a lot of cinemas were closing down in the late fifties, due to the combination of television and the drive-in making indoor cinemas less appealing, and because white flight to the suburbs meant that people with money no longer lived in walking distance of cinemas the way they used to.\n\nThe Satellite team found an old cinema on East McLemore Avenue, much closer to the centre of Memphis and easier for musicians to get to. That cinema had stopped showing films a year or two earlier, and there'd been a brief period where it had been used for country music performances, but the area was becoming increasingly Black, as white people moved away, and while plenty of Black people liked country music, they weren't exactly welcomed to the performances in segregated 1950s Memphis, and so the building was abandoned, and available cheap.\n\nMeanwhile, Estelle's son Charles was trying to get into the music business, too. Before I go any further in talking about him, I should say that I've had to depart from my normal policy when talking about him. Normally, I refer to people by the name they chose to go by, but in his case he was known by a nickname which was harmless in that time and place, but later became an extremely offensive racist slur in the UK, used against people of Pakistani descent. The word didn't have those connotations in the US at the time, and he died before its use as a slur became widely known over there, but I'm just going to call him Charles.\n\nAnd speaking of words which might be considered racial slurs, the band that Charles joined -- an all-white group who loved to play R&B -- was called the Royal Spades. This was supposedly because of their love of playing cards, but there's more than a suspicion that the racial connotations of the term were used deliberately, and that these white teenage boys were giggling at their naughty racial transgressiveness.\n\nThe group had originally just been a guitar/bass/drum band, but Charles Axton had approached them and suggested they should get a horn section, offering his services as a tenor player. They'd laughed when he told them he'd only been playing a couple of weeks, but once he explained that his mother and uncle owned a record label, he was in the group, and they'd expanded to have a full horn section. The group was led by guitarist Steve Cropper and also included his friend, the bass player Duck Dunn, and Cropper and Charles Axton helped with the refurbishing of the cinema into a recording studio.\n\nThe cinema had another advantage, too -- as well as the auditorium, which became the studio, it had a lobby and concession stand. Estelle Axton turned that into a record shop, which she ran herself -- with Cropper often helping out behind the counter. She instituted a policy that, unlike other record shops, people could hang around all day listening to music, without necessarily buying anything. She also brought in a loyalty card scheme -- buy nine records and get a tenth record for free -- which allowed her to track what individual customers were buying. She soon became so knowledgeable about what was selling to the Black teenagers of the area that she boasted that if you came into the shop with twenty dollars, she'd have sold you nineteen dollars' worth of records before you left -- she'd leave you with a dollar so you could pay for your transport home, to make sure you could come back with more money.\n\nBy having a record shop in the record studio itself, they knew what was selling and could make more music that sounded like that. By having a crowd around all day listening to music, they could put the new recordings on and gauge the response before pressing a single copy. Satellite Records suddenly had a market research department.\n\nAnd they soon had an ally in getting them airplay. Rufus Thomas was the most important man in Black entertainment in Memphis. He was a popular DJ and comedian, he was the compere at almost every chitlin' circuit show in the area, and he was also a popular singer. He'd been the one to record the first hit on Sun Records, \"Bear Cat\", the answer record to \"Hound Dog\" we talked about way back in episode fifteen:\n\n[Excerpt: Rufus Thomas, \"Bear Cat\"]\n\nRufus Thomas knew Jim Stewart from when Stewart had been promoting the Vel-Tones single, and so he came into the newly opened studio and suggested he cut a few tracks. If you've got a record label, and a DJ wants to make a record with you, that's a godsend -- you're guaranteed airplay, not only for that record, but for a few of your others. And if that DJ also happens to be a genuine talent who'd made hit records before, you jump at the chance.\n\nThomas also brought in his daughter, Carla, who happened to have an astonishing voice.\n\nFor the first session in the new studio, they recorded a song Rufus had written, \"'Cause I Love You\", with a few musicians that he knew, including a bass player called Wilbur Steinberg, and with Steve Cropper sitting in on guitar and Chips Moman producing. Also in the studio was David Porter, a teenager who sang in a band with Bob Tally, the trumpet player on the session -- Porter was skipping school so he could be in a real recording studio, even though he wasn't going to be singing on the session.\n\nWhen they started playing the song, Tally decided that it would sound good with a baritone sax on it. Nobody in the studio played saxophone, but then Porter remembered one of his classmates at Booker T Washington High School. This classmate was also called Booker T. -- Booker T. Jones -- and he could play everything. He played oboe, sax, trombone, double bass, guitar, and keyboards, and played them all to a professional standard.\n\nPorter popped over to the school, walked into the classroom Jones was in, told the teacher that another teacher wanted to see Jones, pulled him out of the class, and told him he was going to make a record. They borrowed a baritone sax from the school's music room, went back to the studio, and Jones played on \"'Cause I Love You\" by Rufus and Carla Thomas:\n\n[Excerpt: Rufus and Carla Thomas, \"'Cause I Love You\"]\n\n\"'Cause I Love You\" became a local hit, and soon Jim Stewart got a call from Jerry Wexler at Atlantic, offering to start distributing it, and any future records by Rufus and Carla Thomas. Stewart didn't really know anything about the business, but when Wexler explained to Stewart that he was the producer of \"What'd I Say\" by Ray Charles, Stewart knew that was someone he needed to work with -- he'd recently had a sort of Damascene conversion after hearing that record, and was now fully committed to his company's new R&B style. For a five thousand dollar advance, Atlantic ended up with the rights to press and distribute all future masters from Satellite.\n\nThe next single from the label was a Carla Thomas solo record, \"Gee Whizz, Look at His Eyes\". For that session, they booked in some string players, and Bob Tally was meant to write an arrangement for them. However, he didn't turn up to the session, and when Stewart went round to his house to find him, he discovered that Tally hadn't written the arrangement, and had been up all night playing at a gig and was in no fit state to write one. Stewart had to make the string players play from a head arrangement -- something string players normally never do -- and ended up giving them directions like \"just play donuts!\", meaning semibreves or whole notes, which are drawn as ovals with a hole in the middle, like a donut.\n\nDespite this, \"Gee Whizz\" went to number five on the R&B charts and ten on the pop charts. Satellite Records had a real hit:\n\n[Excerpt: Carla Thomas, \"Gee Whizz, Look at His Eyes\"]\n\nSatellite were starting to build up a whole team of people they could call on. Steve Cropper was working in the record shop, so he was available whenever they needed a guitar part playing or a second keyboard adding. David Porter was working at Big Star, the grocery store across the road, and he turned out to be a talented songwriter and backing vocalist. And of course there was the band that Cropper and Charles Axton were in, which had now been renamed to the Mar-Keys, a pun on \"marquis\" as in the noble title, and \"keys\" as in keyboards, as Estelle Axton thought -- entirely correctly -- that their original name was inappropriate. They also had a pool of Black session players they could call on, mostly older people who'd been brought to them by Rufus Thomas, and there were always eager teenagers turning up wanting to do anything they could in order to make a record.\n\nIt was the Mar-Keys who finally gave Satellite the distinctive sound they were looking for. Or, at least, it was under the Mar-Keys' name that the record was released.\n\nAn instrumental, \"Last Night\", was recorded at several sessions run by Moman, often with different lineups of musicians. The Mar-Keys at this point consisted of Steve Cropper, Duck Dunn, Charles Axton, Wayne Jackson, Terry Johnson, Smoochy Smith, and Don Nix, but the lineup on the finished recording had Smith on keyboards, Axton on sax and Jackson on trumpet, with some sources saying that Cropper provided the second keyboard part while others say he only played on outtakes, not on the final version. The other four musicians were Black session players -- Lewie Steinberg, Wilbur's brother, on bass, Gilbert Caples and Floyd Newman on saxes, and Curtis Green on drums. Floyd Newman also did the spoken \"Ooh, last night!\" that punctuated the record:\n\n[Excerpt: The Mar-Keys, \"Last Night\"]\n\nJim Stewart and Chips Moman were both convinced that would be a flop, as was Jerry Wexler when he heard it. But Estelle Axton believed in its potential -- and also believed in her son, who Stewart had little time for. Jim Stewart didn't want his useless nephew's band on his label at all if he could help it, but Estelle Axton wanted her son to have a hit. She got a test pressing to a DJ, who started playing it, and people started coming into the shop asking for the record.\n\nEventually, Stewart gave in to his sister's pressure, and agreed to release the record. There was only one problem -- when they pulled the tape out, they found that the first section of the track had somehow been erased. They had to hunt through the rubbish, looking through discarded bits of tape, until they found another take of the song that had a usable beginning they could splice in. They did a very good job -- I *think* I can hear the splice, but if it's where I think it is, it's about the cleanest editing job on analogue tape I've ever heard. If I'm right, the edit comes right in the middle of this passage:\n\n[Excerpt: The Mar-Keys, \"Last Night\"]\n\nDid you hear it?\n\nThe song's authorship has been debated over the years, because the horn part and the keyboard part were written separately. Caples and Newman, the session sax players, had come up with the horn part, and so always said they should get solo composition credit. Smoochy Smith had separately written the keyboard part, which came from something he'd been working on on his own, so he got credit too. Chips Moman had suggested combining the keyboard and horn lines, and so he got songwriting credit as well. And Charles Axton didn't contribute anything to the song other than playing on the record, but because his family owned the record label, he got credit as well.\n\nThe record became a big hit, and there are a couple of hypotheses as to why. Steve Cropper always argued that it was because you could dance the Twist to it, and so it rode the Twist craze, while others have pointed out that at one point in the record they leave a gap instead of saying \"Ooh last night\" as they do the rest of the way through. That gap allowed DJs to do the interjection themselves, which encouraged them to play it a lot.\n\nIt made number three on the pop charts and number two on the R&B charts, and it led to Satellite Records coming to the attention of another label, also called Satellite, in California, who offered to sell the Memphis label the rights to use the name. Jim Stewart had never liked Satellite as a name anyway, and so they quickly reissued the record with a new label, named after the first letters of Jim Stewart and Estelle Axton's surnames. Stax Records was born.\n\nThe Mar-Keys immediately hit the road to promote the single -- which brought resentment from the Black session players, some of whom claim that during the session it hadn't even been intended as a Mar-Keys record, and who were annoyed that even though the record was primarily their work they weren't getting the recognition and a bunch of white boys were.\n\nCropper soon got tired of the tour, quit the group and came back to Memphis -- he was annoyed partly because the other band members, being teenage boys, many of them away from home for the first time, acted like wild animals, and partly because Cropper and Charles Axton both believed themselves to be the band's leader and that the other should obey them. Cropper went back to working in the record shop, and playing on sessions at Stax.\n\nThe second Mar-Keys single was recorded by the studio musicians while the group were out on tour -- the first they even knew about it was when they saw it in the shop:\n\n[Excerpt: The Mar-Keys, \"The Morning After\"]\n\nThat was much less successful, but the label was still interested in making instrumentals. They started a subsidiary label, Volt -- if you put records out with two different label names, it was more likely that radio stations would play more of your records, because it wouldn't seem like they were playing one label too much -- and the first single on it was an instrumental that Chips Moman wrote, \"Burnt Biscuits\", by a group consisting of Moman, Rufus Thomas' son Mavell, Lewie Steinberg, and Howard Grimes:\n\n[Excerpt: The Triumphs, \"Burnt Biscuits\"]\n\nThat wasn't a hit, though Moman thought it had the potential to become as big as \"Last Night\". It was released under the name \"the Triumphs\", after the sports car Moman drove.\n\nShortly after that, Moman produced what would be the last classic record he'd make for Stax, when he produced \"You Don't Miss Your Water\" by a new singer, William Bell, who had previously been one of the backing vocalists on \"Gee Whiz\". That track had Mavell Thomas on piano, Lewie Steinberg on bass, Ron Capone on drums, and Booker T. Jones on organ -- by this point Booker T. was being called on a lot to play keyboards, as Floyd Newman recommended him as a reliable piano player in the hopes that if Jones was on keyboards, he wouldn't be playing baritone sax, so Newman would get more of those gigs:\n\n[Excerpt: William Bell, \"You Don't Miss Your Water\"]\n\nThat was a great record, one of the defining records of the new country-soul genre along with Arthur Alexander's records, but it would be the last thing Moman would do at Stax. He'd not been getting on with Estelle Axton, and he also claims that he had been promised a third of the company, but Jim Stewart changed his mind and refused to cut him in. Everyone has a different story about what happened, but the upshot was that Moman left the company, went to Nashville for a while, and then founded his own studio, American, in another part of Memphis. Moman would become responsible for writing and producing a whole string of soul, country, and rock classics, and I'm sure we'll be hearing more from him in the next couple of years.\n\nAfter Moman left, the label floundered a little bit for a few months. Jim Stewart and Steve Cropper split the production duties that Moman had had between them. Stewart had already produced several records for Carla Thomas, and Cropper was a great musician who had been spending every second he could learning how to make records, so they could cope, but they released a mixture of really good soul records that failed to hit the charts, and truly dire novelty country songs like \"The Three Dogwoods\" by Nick Charles, a song from the perspective of the tree that became the cross on which Jesus was crucified:\n\n[Excerpt: Nick Charles, \"The Three Dogwoods\"]\n\nThat was co-written by Cropper, which shows that even the man who co-wrote \"In the Midnight Hour\", \"Dock of the Bay\" and \"Knock on Wood\" had his off days.\n\nThe record that would prove Stax to be capable of doing great things without Chips Moman came about by accident. Stax was still not exclusively a soul label, and it was cutting the odd country and rockabilly record, and one of the people who was going to use the studio was Billy Lee Riley. You might remember Riley from a year ago, when we looked at his \"Flyin' Saucers Rock 'n' Roll\":\n\n[Excerpt: Billy Lee Riley and the Little Green Men, \"Flyin' Saucers Rock 'n' Roll\"]\n\nRiley was running his own label at the time, and doing various bits of session work and singing for other people. No-one's quite sure what he was using the studio for in early 1962 -- some say he was cutting a jingle, some say he cut a few actual tracks but that they were awful, and others that he turned up too drunk to record. Either way, the session ended early, and the musicians were at a loose end.\n\nThe musicians on this session were three of the regular Stax musicians -- Steve Cropper, who had just turned twenty, on guitar, Booker T. Jones, who was still a teenager, on organ, and Lewie Steinberg, a decade older than either, on bass. The fourth musician was Al Jackson, who like Steinberg was an older Black man who had cut his teeth playing jazz and R&B throughout the fifties. Booker had played with Jackson in Willie Mitchell's band, and had insisted to everyone at Stax that they needed to get this man in, as he was the best drummer Jones had ever heard.\n\nJackson was making money from gigging, and didn't want to waste his time playing sessions, which he thought would not be as lucrative as his regular gigs with Willie Mitchell. Eventually, Stax agreed to take him on on a salary, rather than just paying him one-off session fees, and so he became the first musician employed by Stax as a full-time player -- Cropper was already on salary, but that was for his production work and his work at the record shop.\n\nAs the session had ended rather disappointingly, the four were noodling on some blues as they had nothing better to do. Jim Stewart clicked on the talkback from the control room to tell them to go home, but then heard what they were playing, and told them to start it again so he could get it down on tape:\n\n[Excerpt: Booker T and the MGs, \"Behave Yourself\"]\n\nStewart was happy with that track, but singles needed two sides, and so they needed to come up with something else. Cropper remembered a little musical lick he'd heard on the radio one day when he'd been driving with Booker -- they'd both been fascinated by that lick, but neither could remember anything else about the song (and to this day no-one's figured out what the song they'd heard was). They started noodling around with that lick, and shaped it into a twelve-bar instrumental:\n\n[Excerpt: Booker T. and the MGs, \"Green Onions\"]\n\nThat was even better than the other track, and they needed a funky name to go with such a funky track. Lewie Steinberg thought that onions were the funkiest thing he could think of, and so the track became \"Green Onions\". As the last instrumental they'd released with food as a title, \"Burnt Biscuits\", had been by the Triumphs, they thought the group name should be another sports car name, and so it came out as by Booker T and the MGs.\n\n(They later said that MG stood either for Memphis Group or for Mixed Group, because they had both Black and white members, but the original idea was definitely the car – they just didn't want to have a trademark lawsuit on their hands).\n\n\"Green Onions\" went to number one on the R&B charts and number three on the pop charts, and became the biggest thing Stax had ever recorded.\n\nThat core group became the Stax house band, playing on every session from that point on. If they recorded an instrumental on their own, it went out as by Booker T and the MGs. If they recorded an instrumental with horn players, it went out as by the Mar-Keys, and they also played backing all the singers who came through the door of Stax, and there would be a lot of them over the next few years.\n\nThere were a couple of changes -- Booker T actually went off to university soon after recording \"Green Onions\", so for a couple of years he could only play on weekends and during holidays -- on weekdays, the studio used another keyboard player, again suggested by Floyd Newman, who had hired a young man for his bar band when the young man could only play piano with one hand, just because he seemed to have a feel for the music. Luckily, Isaac Hayes had soon learned to play with both hands, and he fit right in while Booker was away at university.\n\nThe other change came a couple of years later, when after the MGs had had a few hits, Lewie Steinberg was replaced by Duck Dunn. Steinberg always claimed that the main reason he was dropped from the MGs was because he was Black and Steve Cropper wanted another white man. Cropper has always said it was because Duck Dunn had a harder-edged style that fit their music better than Steinberg's looser feel, but also that Dunn had been his best friend for years and he wanted to play more with him. The two Black members of the MGs have never commented publicly, as far as I can tell, on the change.\n\nBut whether with Jones or Hayes, Steinberg or Dunn, the MGs would be the foundation of Stax's records for the rest of the sixties, as well as producing a string of instrumental hits. And it was those instrumental hits that led to the arrival of the person who would make Stax a legendary label.\n\nJoe Galkin, a record promoter to whom Jim Stewart owed a favour, was managing a local guitarist, Johnny Jenkins, and brought him into the studio to see if Stax could get him an instrumental hit, since they'd had a few of those. Jenkins did eventually release a single on Stax, but it wasn't particularly special, and didn't have any success:\n\n[Excerpt: Johnny Jenkins, \"Spunky\"]\n\nThe day of Jenkins' first session was a flop, they'd not been able to get anything decent recorded, and the musicians started to pack up. But Galkin had made a deal with the singer in Jenkins' band -- if he'd drive Jenkins to the studio, since Jenkins couldn't drive, he'd try to get a record cut with him as well. Nobody was interested, but Galkin wore Jim Stewart down and he agreed to listen to this person who he just thought of as Johnny Jenkins' driver. After hearing him, Steve Cropper ran out to get Lewie Steinberg, who was packing his bass away, and tell him to bring it back into the studio. Cropper played piano, Jenkins stayed on guitar, and Booker, Al, and Lewie played their normal instruments.\n\nJim Stewart wasn't particularly impressed with the results, but he owed Galkin a favour, so he released the record, a fun but unoriginal Little Richard soundalike:\n\n[Excerpt: Otis Redding, \"Hey Hey Baby\"]\n\nBut soon DJs flipped the record, and it was the B-side that became the hit:\n\n[Excerpt: Otis Redding, \"These Arms of Mine\"]\n\nOtis Redding would never again be thought of as just Johnny Jenkins' driver, and Stax Records was about to hit the big time.",
  "enclosure": "",
  "itunes:summary": "Episode 105 of A History of Rock Music in Five Hundred Songs looks at \"Green Onions\", and how a company started by a Western Swing fiddle player ended up making the most important soul records of the sixties. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"He's So Fine\" by the Chiffons.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nI used three main books when creating this episode. Two were histories of Stax --&nbsp;Soulsville USA: The Story of Stax by Rob Bowman, and&nbsp;Respect Yourself: Stax Records and the Soul Explosion by Robert Gordon.\n\nCountry Soul by Charles L Hughes is a more general overview of soul music made in Tennessee and Alabama in the sixties, but is useful as it's less likely to take statements about racial attitudes entirely at face value.\n\nThis is a good cheap compilation of Booker T and the MGs' music.\n\nIf the Erwin Records tracks here interest you, they're all available on this compilation.\n\nThe Complete Stax-Volt Singles vol. 1: 1959-1968 is a nine-CD box set containing much of the rest of the music in this episode. It's out of print physically, but the MP3 edition, while pricey, is worth it.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nTranscript\n\nAnd now we come to the end of the backfilling portion of the story. Since \"Telstar\" we've been looking at records from 1962 that came out just before \"Love Me Do\" -- we've essentially been in an extended flashback. This is the last of those flashback episodes, and from next week on we're moving forward into 1963.\n\nToday we're going to look at a record by a group of musicians who would be as important to the development of music in the 1960s as any, and at the early years of Stax Records, a label that would become as important as Chess, Motown, or Sun. Today, we're looking at \"Green Onions\" by Booker T. and the MGs, and how a white country fiddle player accidentally kickstarted the most important label in soul music:\n\n[Excerpt: Booker T. and the MGs, \"Green Onions\"]\n\nOur story starts in Memphis, with Jim Stewart, a part-time fiddle player. Stewart was in a Western Swing band, and was hugely influenced by Bob Wills, but he wasn't making any real money from music. Instead, he was working a day job at a bank.\n\nBut he was still interested in music, and wanted to be involved in the industry. One of the gigs he'd had was in the house band at a venue where Elvis sometimes played in his early years, and he'd seen how Elvis had gone from an obscure local boy all the way to the biggest star in the world. He knew he couldn't do that himself, but he was irresistibly attracted to any field where that was *possible*.\n\nHe found his way into the industry, and into music history as a result of a tip from his barber.\n\nThe barber in question, Erwin Ellis, was another country fiddle player, but he owned his own record label, Erwin Records. Erwin Records was a tiny label -- it was so tiny that its first release, by Ellis himself, seems not to exist anywhere. Even on compilations of Erwin Records material, it's not present, which is a shame, as it would be interesting from a historical perspective to hear Ellis' own playing.\n\nBut while Ellis was unsuccessful both as a fiddle player and as a record company owner, he did manage to release a handful of rockabilly classics on Erwin Records, like Hoyt Jackson's \"Enie Meanie Minie Moe\":\n\n[Excerpt: Hoyt Jackson, \"Enie Meanie Minie Moe\"]\n\nand \"Boppin' Wig Wam Willie\" by Ray Scott, who had written \"Flyin' Saucers Rock & Roll\" for Billy Lee Riley, and who was backed by Riley's Little Green Men on this single:\n\n[Excerpt: Ray Scott, \"Boppin' Wig Wam WIl",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 105 of A History of Rock Music in Five Hundred Songs looks at \"Green Onions\", and how a company started by a Western Swing fiddle player ended up making the most important soul records of the sixties. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"He's So Fine\" by the Chiffons.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nI used three main books when creating this episode. Two were histories of Stax --&nbsp;Soulsville USA: The Story of Stax by Rob Bowman, and&nbsp;Respect Yourself: Stax Records and the Soul Explosion by Robert Gordon.\n\nCountry Soul by Charles L Hughes is a more general overview of soul music made in Tennessee and Alabama in the sixties, b",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}