{
  "guid": "fec397cdfb4a41db9353ada715fa8c69",
  "title": "Ep. 31 The Unexpected Family",
  "pubDate": "Thu, 27 Jun 2019 17:34:25 -0000",
  "link": "https://beta.prx.org/stories/364978",
  "description": "<p>It's our season finale and we're getting into issues of the fam; the things that our families say and do that have helped us or hurt us. We get into what it's like to gain a family unexpectedly and hear from a family whose cultural differences and jealousy nearly divided them. In this special episode we also stoop it with author, therapist, Netflix’ Fab 5 member, and unexpected father Karamo Brown. Keep it in the fam. We'll be back with a brand new season soon! </p>",
  "enclosure": "",
  "itunes:title": "The Unexpected Family",
  "itunes:subtitle": "It's our season finale and we're getting into issues of the fam; the things that our families say and do that have helped us or hurt us. We get into what it's like to gain a family unexpectedly and hear from a family whose cultural differences and...",
  "itunes:explicit": false,
  "itunes:episodeType": "full",
  "itunes:season": 3,
  "itunes:episode": 31,
  "itunes:duration": "42:20",
  "author": "hangout@thestoop.org (Hana Baba and Leila Day)",
  "itunes:author": "Hana Baba and Leila Day",
  "itunes:summary": "It's our season finale and we're getting into issues of the fam; the things that our families say and do that have helped us or hurt us. We get into what it's like to gain a family unexpectedly and hear from a family whose cultural differences and jealousy nearly divided them. In this special episode we also stoop it with author, therapist, Netflix’ Fab 5 member, and unexpected father Karamo Brown. Keep it in the fam! We'll be back with more episodes soon",
  "itunes:image": "",
  "itunes:keywords": "american,cuban,parenting,brown,african,jamaican,haitian,karamo",
  "media:content": "",
  "content:encoded": "<p>It's our season finale and we're getting into issues of the fam; the things that our families say and do that have helped us or hurt us. We get into what it's like to gain a family unexpectedly and hear from a family whose cultural differences and jealousy nearly divided them. In this special episode we also stoop it with author, therapist, Netflix’ Fab 5 member, and unexpected father Karamo Brown. Keep it in the fam. We'll be back with a brand new season soon! </p>"
}