{
  "title": "Why cameras are soon going to be everywhere",
  "link": "https://petewarden.com/2022/06/15/why-cameras-are-soon-going-to-be-everywhere/",
  "comments": "https://petewarden.com/2022/06/15/why-cameras-are-soon-going-to-be-everywhere/#comments",
  "dc:creator": "Pete Warden",
  "pubDate": "Wed, 15 Jun 2022 23:17:57 +0000",
  "category": "Uncategorized",
  "guid": "http://petewarden.com/?p=7680",
  "description": "I&#8217;ve finally had the chance to play Cyberpunk 2077 over the last few weekends, and it&#8217;s an amazing feat of graphics programming, especially with ray-tracing enabled. I&#8217;ve had fun, but I have been struck by how the cyberpunk vision of the future is rooted in the &#8217;80s. Even though William Gibson was incredibly prescient in [&#8230;]",
  "content:encoded": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe class=\"youtube-player\" width=\"550\" height=\"310\" src=\"https://www.youtube.com/embed/-bRBCVfF-q0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"></iframe>\n</div><figcaption><em>i-FlatCam demo</em></figcaption></figure>\n\n\n\n<p>I&#8217;ve finally had the chance to play Cyberpunk 2077 over the last few weekends, and it&#8217;s an amazing feat of graphics programming, especially with ray-tracing enabled. I&#8217;ve had fun, but I have been struck by how the cyberpunk vision of the future is rooted in the &#8217;80s. Even though William Gibson was incredibly prescient in so many ways, the actual future we&#8217;re living in is increasingly diverging from the one he painted. One of the differences that struck me most was how cameras exist in the game&#8217;s world, compared to what I can see happening as an engineer working in the imaging field. They still primarily show up as security cameras, brick-sized devices that are attached to walls and would look familiar to someone from forty years ago.</p>\n\n\n\n<p>A lot of people still share the expectation that cameras will be obvious, standalone components of a system. Even though phone cameras and webcams are smaller, they still have a noticeable physical presence, and often come with indicators like red lights that show when they&#8217;re recording. What is clear to me from my work is that these assumptions aren&#8217;t going to hold much longer. Soon imaging sensors will be so small, cheap, and energy efficient that they&#8217;ll be added to many more devices in our daily lives, and because they&#8217;re so tiny they won&#8217;t even be noticeable!</p>\n\n\n\n<p>What am I basing this prediction on? The clearest indicator for me is that you can already buy devices like the <a href=\"https://www.himax.com.tw/products/cmos-image-sensor/always-on-vision-sensors/hm01b0/\">Himax HM01B0</a> with an imaging sensor that&#8217;s less than 2mm by 2mm in size, low single-digit dollars in cost, and 2 milliwatts or less in power usage. Even more striking are the cameras that are emerging from research labs. At the TinyML Summit the University of Michigan presented <a href=\"https://arxiv.org/pdf/2203.04496.pdf\">a complete system that fits on the tip of a finger</a>.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://petewarden.files.wordpress.com/2022/06/tiny_camera_umich.png\"><img data-attachment-id=\"7683\" data-permalink=\"https://petewarden.com/2022/06/15/why-cameras-are-soon-going-to-be-everywhere/tiny_camera_umich/\" data-orig-file=\"https://petewarden.files.wordpress.com/2022/06/tiny_camera_umich.png\" data-orig-size=\"187,157\" data-comments-opened=\"1\" data-image-meta=\"{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}\" data-image-title=\"tiny_camera_umich\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://petewarden.files.wordpress.com/2022/06/tiny_camera_umich.png?w=187\" data-large-file=\"https://petewarden.files.wordpress.com/2022/06/tiny_camera_umich.png?w=187\" src=\"https://petewarden.files.wordpress.com/2022/06/tiny_camera_umich.png?w=187\" alt=\"\" class=\"wp-image-7683\" srcset=\"https://petewarden.files.wordpress.com/2022/06/tiny_camera_umich.png 187w, https://petewarden.files.wordpress.com/2022/06/tiny_camera_umich.png?w=150 150w\" sizes=\"(max-width: 187px) 100vw, 187px\" /></a></figure>\n\n\n\n<p>The <a href=\"https://youtu.be/-bRBCVfF-q0\">video</a> at the top of this post shows another project from Rice that is able to perform state of the art eye tracking at 253 FPS, using 23 milliwatts, in a lens-less system that lets it achieve a much smaller size than other solutions.</p>\n\n\n\n<p>Hopefully this makes it clear that there&#8217;s a growing supply of these kinds of devices. Why do I think there will be enough demand to include them in appliances and other items around homes and offices? This is tricky to show as clearly because the applications aren&#8217;t deployed yet, but cameras can replace or augment lots of existing sensors, and enable entirely new features. Here are a few examples:</p>\n\n\n\n<ul><li>Voice interfaces that <a href=\"https://ai.googleblog.com/2018/04/looking-to-listen-audio-visual-speech.html\">use lip reading to improve accuracy in noisy situations</a>.</li><li>Stovetops that turn themselves off if they don&#8217;t see anyone nearby for a while.</li><li><a href=\"https://petewarden.com/2021/02/28/how-screen-scraping-and-tinyml-can-turn-any-dial-into-an-api/\">Water and other meters that share their data digitally with the cloud</a>, without expensive replacements.</li><li>A toaster that pops out the toast when smoke starts billowing.</li><li>TVs that recognize when someone sits down, and who they are, to provide parental controls and personalized content.</li><li>Shades that automatically close when nobody&#8217;s around, to conserve energy.</li><li>Gesture recognition for controlling a lamp.</li></ul>\n\n\n\n<p>Each one of these may or may not turn out to be useful, but there are so many potential applications (including many I&#8217;m sure nobody&#8217;s thought of yet) that I can&#8217;t imagine some of them won&#8217;t take off once the technology is widely available. Many scientists believe that the Cambrian Explosion occurred <a href=\"https://www.nhm.ac.uk/discover/eyes-on-the-prize-evolution-of-vision.html\">because of the evolution of eyes</a> opened up so many new possibilities and functions. I&#8217;m hoping we&#8217;ll see a similarly massive expansion in the technology space once all our devices can truly see and understand.</p>\n\n\n\n<p>So, that&#8217;s why I believe we&#8217;re going to end up in a world where we&#8217;re each surrounded by thousands of cameras. What does that mean? As an engineer I&#8217;m excited, because we have the chance to make a positive impact on peoples&#8217; lives. As a human being, I&#8217;m terrified because the potential for harm is so large, through unwanted tracking, recording of private moments, and the sharing of massive amounts of data with technology suppliers.</p>\n\n\n\n<p>If you accept my argument about why we&#8217;re headed for a world full of tiny cameras watching us at all times, then I think we all have a responsibility to plan ahead now to mitigate the potential harms. This is my motivation behind <a href=\"https://petewarden.com/2022/06/09/what-are-ml-sensors/\">the ML sensors proposal</a> to wall off sensitive data in a secure component, but I see this as just a starting point in the discussion. Do we need regulation? Even if we don&#8217;t get it in the US, will Europe take the lead? Should there be voluntary standards around labeling products that contain cameras or microphones? I don&#8217;t know the answers, but I don&#8217;t think we have the luxury of waiting too long to figure them out, because if we don&#8217;t make any changes we&#8217;ll be deploying billions of poorly-secured devices into everybody&#8217;s lives as a giant uncontrolled experiment.</p>\n",
  "wfw:commentRss": "https://petewarden.com/2022/06/15/why-cameras-are-soon-going-to-be-everywhere/feed/",
  "slash:comments": 1,
  "media:content": [
    {
      "media:title": "petewarden"
    },
    ""
  ]
}