{
  "title": "474 - What We Know—and Don’t Yet Know—About the Leaked Supreme Court Draft Opinion That Could Overturn Roe v. Wade",
  "itunes:title": "474 - What We Know—and Don’t Yet Know—About the Leaked Supreme Court Draft Opinion That Could Overturn Roe v. Wade",
  "pubDate": "Fri, 27 May 2022 10:00:00 +0000",
  "guid": "859d6d21-38df-4fcd-a11a-c3cce0123dda",
  "link": "https://johnshopkinssph.libsyn.com/474-what-we-knowand-dont-yet-knowabout-the-leaked-supreme-court-draft-opinion-that-could-overturn-roe-v-wade",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">For the first time in history, a working draft of an opinion by justices</span> <span style= \"font-weight: 400;\">of the Supreme Court was leaked to the media and the public. Legal and public health expert</span> <strong>Joanne Rosen</strong> <span style=\"font-weight: 400;\">talks with</span> <strong>Dr. Josh Sharfstein</strong> <span style= \"font-weight: 400;\">about what the opinion expressly says, why it would upend precedent, and what may happen at the state level. They also discuss the immediate and long-term consequences if it’s passed, including for public health.</span></p>",
  "content:encoded": "<p>For the first time in history, a working draft of an opinion by justices of the Supreme Court was leaked to the media and the public. Legal and public health expert Joanne Rosen talks with Dr. Josh Sharfstein about what the opinion expressly says, why it would upend precedent, and what may happen at the state level. They also discuss the immediate and long-term consequences if it’s passed, including for public health.</p>",
  "enclosure": "",
  "itunes:duration": "14:19",
  "itunes:explicit": false,
  "itunes:keywords": "women,health,birth,rights,wade,Abortion,roe,SCOTUS",
  "itunes:subtitle": "For the first time in history, a working draft of an opinion by justices of the Supreme Court was leaked to the media and the public. Legal and public health expert Joanne Rosen talks with Dr. Josh Sharfstein about what the opinion expressly says, why...",
  "itunes:season": 5,
  "itunes:episode": 474,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}