{
  "title": "Introducing the next wave of AI at Scale innovations in Bing",
  "link": "https://blogs.bing.com/search-quality-insights/september-2020/Introducing-the-next-wave-of-AI-at-Scale-innovations-in-Bing",
  "pubDate": "Wed, 23 Sep 2020 08:05:03 -0700",
  "dc:creator": "Bing Team",
  "category": [
    "AI",
    "artificial intelligence",
    "Bing",
    "language",
    "Natural",
    "NLG",
    "NLR",
    "Turing"
  ],
  "guid": "4a93bc35-58fb-4596-8275-d7da8dcdc4b4",
  "description": "Bing users around the globe perform hundreds of millions of search queries every day. These queries are diverse in many ways, from the intent the users are seeking to fulfill, to the languages and regions where these queries are issued. To handle such a dynamic range of usage, AI models in Bing must continuously evolve and therefore Bing is the prime example of <a href=\"https://innovation.microsoft.com/en-us/ai-at-scale\">Microsoft AI at Scale</a>.<br />\n<br />\nThis blog post introduces recent updates to Bing that are making use of the Microsoft Turing Natural Language Generation (T-NLG) model, as well as expanding the use of the Microsoft Turing Natural Language Representation (T-NLR) model in production. If you are interested in trying out the Turing NLR model for your own business scenarios you can <a href=\"https://blogs.microsoft.com/ai-for-business/ai-at-scale-ignite/\">sign up for our preview.</a>",
  "content:encoded": "Bing users around the globe perform hundreds of millions of search queries every day. These queries are diverse in many ways, from the intent the users are seeking to fulfill, to the languages and regions where these queries are issued. To handle such a dynamic range of usage, AI models in Bing must continuously evolve and therefore Bing is the prime example of <a href=\"https://innovation.microsoft.com/en-us/ai-at-scale\">Microsoft AI at Scale</a>.<br />\n<br />\nThis blog post introduces recent updates to Bing that are making use of the Microsoft Turing Natural Language Generation (T-NLG) model, as well as expanding the use of the Microsoft Turing Natural Language Representation (T-NLR) model in production. If you are interested in trying out the Turing NLR model for your own business scenarios you can <a href=\"https://blogs.microsoft.com/ai-for-business/ai-at-scale-ignite/\">sign up for our preview.</a><br />\n&nbsp;\n<h3>Bringing Natural Language Generation into Bing</h3>\n<br />\nIn May, we&nbsp;<a href=\"https://blogs.bing.com/search/2020_05/AI-at-Scale-in-Bing/\">outlined the use of AI models</a><a href=\"https://blogs.bing.com/search/2020_05/AI-at-Scale-in-Bing\">&nbsp;</a>fine-tuned from the Turing Natural Language <strong>Representation </strong>model in different parts of Bing&rsquo;s question answering and ranking systems. In the last year, there has been very exciting progress on Natural Language <strong>Generation</strong>, including training our very own <a href=\"https://www.microsoft.com/en-us/research/blog/turing-nlg-a-17-billion-parameter-language-model-by-microsoft/\">T-NLG model</a>, and the introduction of OpenAI&rsquo;s GPT-3, trained with Microsoft Azure. Today we are excited to share how these advancements are enabling us to build better search experiences.\n\n<h4><br />\nImproving Autosuggest using Turing-NLG Next Phrase Prediction</h4>\n<br />\nAutosuggest (AS) improves the search experience by suggesting the most relevant completed queries matching the partial query entered by the user. The key objective of AS is to save users time and keystrokes by offering better and faster query completion. The most frequent search prefixes are usually handled by suggestions that leverage previous queries issued by Bing users. However, as the user types more specific search terms (longer queries), the ability to generate suggestions on the fly becomes essential to overcome limitations of approaches based on previous queries.<br />\n<br />\nNext Phrase Prediction is an AS feature that provides full phrase suggestions in real time for long queries. Before the introduction of Next Phrase Prediction, the approach for handling query suggestions for longer queries was limited to completing the current word being typed by the user. With Next Phrase Prediction, full phrase suggestions can be presented. Furthermore, because these suggestions are generated in real time, they are not limited to previously seen data or just the current word being typed. As a result, the coverage of AS completions increases considerably, improving the overall user experience significantly. The generative models are particularly challenging from an inferencing perspective due to &ndash; size of models and number of inferences required per query (one has to ideally run model inference per keystroke as the user is typing the query). We have introduced several innovations with respect to model compression, state caching, and hardware acceleration of these models to help delight our users cost efficiently.<br />\n<br />\nHere are some examples that have suggestions that didn't before:<br />\n<br />\n<img alt=\"\" src=\"https://blogs.bing.com/BingBlogs/media/SearchQualityInsights/2020/image10.PNG\" /><br />\n&nbsp;\n<h4>Better SERP exploration via Generative Questions in People Also Ask</h4>\n<br />\nPeople Also Ask (PAA) is an extremely useful feature that allows users to expand the scope of their search by exploring answers to questions related to their original query. This saves users time and effort by not having to reformulate their questions to better fit their intent, while also enabling the exploration of adjacent intents. Since Bing has answers to a lot of user questions, it is natural and easy to find existing questions that are like the one that the user typed originally.<br />\n<br />\nHowever, sometimes users ask questions for which we do not have previously asked questions and answers for similar intents. In cases like these, we need the ability to generate useful question-answer pairs from scratch in order to populate the PAA block.<br />\n<br />\nWe use a high-quality generative model on billions of documents to generate question-answer pairs that are present within those documents. Later, when the same documents appear on the Search Engine Result Page (SERP), we use the previously generated question-answer pairs to help populate the PAA block, in addition to existing similar questions that have previously been asked. This feature allows users to explore the entire SERP by asking more questions rather than simply browsing documents.<br />\nHere are a few examples of how this shows up on Bing (questions in green boxes are powered by question generation model):<br />\n<br />\n<img alt=\"\" src=\"https://blogs.bing.com/BingBlogs/media/SearchQualityInsights/2020/image2.PNG\" /><br />\n<br />\n<img alt=\"\" src=\"https://blogs.bing.com/BingBlogs/media/SearchQualityInsights/2020/image3.PNG\" />\n<h3>&nbsp;</h3>\n\n<h3>Improving search quality globally with Natural Language Representation</h3>\n<br />\nBing is available in over 100 languages and 200 regions. Although much of the latest AI research has been focused on English languages, we believe it is incredibly important to build AI technology that is inclusive of everyone. That is why we released our XGLUE dataset, which covers 19 languages over real production tasks, so that the research community could participate in our journey. We also shared our latest cross-lingual innovation InfoXLM, which is incorporated into the Turing Universal Language Representation (T-ULR) model. We&rsquo;re excited to share how building on top of this technology has improved search experience for all users, speaking any language and located in any region of the world.\n<h4><br />\nExpanding our intelligent answers to 100 languages and 200+ regions</h4>\n<br />\nIn our May blog post, we talked about how we took a zero-shot approach with our T-ULR (Turing Universal Language Representation) model to expand intelligent answers beyond English-speaking markets. We initially shipped those answers to 13 markets using a single model without any training data in those markets.<br />\n<br />\nWe are very happy to announce that since then, we have expanded our intelligent answers to over 100 languages and 200 regions. Here are a few translated examples of foreign language queries that are generating answers from a web search result, using the same model that does so in English markets.<br />\n<br />\nQuery: {meaning of the name Holland}<br />\n<br />\nOriginal:<br />\n<br />\n<img alt=\"\" src=\"https://blogs.bing.com/BingBlogs/media/SearchQualityInsights/2020/image4.PNG\" /><br />\n<br />\nTranslated:&nbsp;<br />\n<br />\n<img alt=\"\" src=\"https://blogs.bing.com/BingBlogs/media/SearchQualityInsights/2020/image5.PNG\" /><br />\n<br />\nQuery: {<em>What is ransomware</em>}<br />\n<br />\nOriginal:<br />\n<br />\n<img alt=\"\" src=\"https://blogs.bing.com/BingBlogs/media/SearchQualityInsights/2020/image6.PNG\" /><br />\n<br />\nTranslated:&nbsp;<br />\n&nbsp;\n<h4><img alt=\"\" src=\"https://blogs.bing.com/BingBlogs/media/SearchQualityInsights/2020/image7.PNG\" /><br />\n<br />\nUniversal Semantic Highlighting in Captions</h4>\n<br />\nWe are able to reuse the same models, pre-trained on 100+ languages and fine-tuned in a zero-shot fashion, to improve captions in all markets. These powerful models are enabling semantic highlighting, a new feature that expands highlighting in captions beyond simple keyword matching, helping users find information faster, without having to read through the entire snippet to look for an answer.<br />\n<br />\nPreviously, captions highlighting was highly dependent on matching the keywords present in the search query. However, keyword highlighting doesn&rsquo;t maximize the experience when the query is a question, in which case it is much better to highlight the actual answer.<br />\n<br />\nHighlighting the answer in a caption is similar to <a href=\"https://arxiv.org/pdf/1606.05250.pdf\">Stanford&rsquo;s Machine Reading Comprehension</a> test in which <a href=\"https://blogs.microsoft.com/ai/microsoft-creates-ai-can-read-document-answer-questions-well-person/\">Microsoft was the first to reach human parity</a> on the benchmark. With Universal Semantic Highlighting, we can identify and highlight answers within captions, and do it not just for English but for all languages.<br />\n<br />\nBelow are a couple of examples that show how it works. The first query is {Germany population} and as you can see that instead of highlighting the words &ldquo;Germany&rdquo; and &ldquo;population&rdquo;, we highlight the actual figure of 81,453,631 as the population of Germany in 2019.<br />\n<br />\n<img alt=\"\" src=\"https://blogs.bing.com/BingBlogs/media/SearchQualityInsights/2020/image8.PNG\" /><br />\n<br />\nHere is another example for the query {what temperature is a fever for coronavirus}. We show multiple documents where the captions clearly highlight the actual answer of 100.4 <sup>o</sup>F as the definition of a fever.<br />\n<br />\n<img alt=\"\" src=\"https://blogs.bing.com/BingBlogs/media/SearchQualityInsights/2020/image9.PNG\" /><br />\n&nbsp;\n<h3>Conclusion</h3>\n<br />\nAdvancements in NLP continue to happen at a very rapid pace and Microsoft Turing models, both for language representation and generation, are at the cutting edge bringing the very best of deep learning capabilities and Microsoft&rsquo;s innovation into its product family. But nothing makes our entire team prouder than bringing this innovation to our Bing users worldwide, helping them find the trustworthy answers they need, whatever language they speak and wherever they are on the planet.<br />\n<br />\nWe would love to hear your feedback or suggestions! You can submit them using the Feedback button in the bottom right corner of the search results page, or directly to our new Twitter alias <a href=\"https://twitter.com/MSBing_Dev\">@MSBing_Dev</a>."
}