{
  "title": "iGniter: Interference-Aware GPU Resource Provisioning for Predictable DNN Inference in the Cloud. (arXiv:2211.01713v1 [cs.DC])",
  "link": "http://arxiv.org/abs/2211.01713",
  "description": "<p>GPUs are essential to accelerating the latency-sensitive deep neural network\n(DNN) inference workloads in cloud datacenters. To fully utilize GPU resources,\nspatial sharing of GPUs among co-located DNN inference workloads becomes\nincreasingly compelling. However, GPU sharing inevitably brings severe\nperformance interference among co-located inference workloads, as motivated by\nan empirical measurement study of DNN inference on EC2 GPU instances. While\nexisting works on guaranteeing inference performance service level objectives\n(SLOs) focus on either temporal sharing of GPUs or reactive GPU resource\nscaling and inference migration techniques, how to proactively mitigate such\nsevere performance interference has received comparatively little attention. In\nthis paper, we propose iGniter, an interference-aware GPU resource provisioning\nframework for cost-efficiently achieving predictable DNN inference in the\ncloud. iGniter is comprised of two key components: (1) a lightweight DNN\ninference performance model, which leverages the system and workload metrics\nthat are practically accessible to capture the performance interference; (2) A\ncost-efficient GPU resource provisioning strategy that jointly optimizes the\nGPU resource allocation and adaptive batching based on our inference\nperformance model, with the aim of achieving predictable performance of DNN\ninference workloads. We implement a prototype of iGniter based on the NVIDIA\nTriton inference server hosted on EC2 GPU instances. Extensive prototype\nexperiments on four representative DNN models and datasets demonstrate that\niGniter can guarantee the performance SLOs of DNN inference workloads with\npractically acceptable runtime overhead, while saving the monetary cost by up\nto 25% in comparison to the state-of-the-art GPU resource provisioning\nstrategies.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Xu_F/0/1/0/all/0/1\">Fei Xu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xu_J/0/1/0/all/0/1\">Jianian Xu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chen_J/0/1/0/all/0/1\">Jiabin Chen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chen_L/0/1/0/all/0/1\">Li Chen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Shang_R/0/1/0/all/0/1\">Ruitao Shang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhou_Z/0/1/0/all/0/1\">Zhi Zhou</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_F/0/1/0/all/0/1\">Fangming Liu</a>"
}