{
  "title": "TU108: Judgment and Self-Criticism Unchecked – a Great Interpersonal Defense",
  "link": "https://therapistuncensored.com/episodes/judgement-and-self-criticism-unchecked-a-great-interpersonal-defense/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=judgement-and-self-criticism-unchecked-a-great-interpersonal-defense",
  "pubDate": "Fri, 15 Nov 2019 05:20:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7711",
  "description": "Judgment says more about the judg-er than the judg-ee. It’s not Judgement – Bad. It’s Judgment-Interesting.\n\nEverybody judges and in truth, we unconsciously evaluate good/bad all the time – both positively and negatively. It’s our brains appraisal system. However unchecked it’s also a very handy interpersonal defense. Today we explore one aspect of insecure functioning, unchecked judgment and harsh self-criticism.\n\n It is just one common insecure pattern to think in absolutes and moral righteousness, and before you judge judgers, those of us who’s favorite flavor is self-criticism and self-judgement please be warned that harsh scale extends quickly to those close to us.  Fun times to grow and learn we tell ya!!\nIn This Episode of Therapist Uncensored,\nCo-hosts Ann Kelley and Sue Marriott break down the big picture of attachment and take a deep dive into just one of the habits of insecure attachment – how we use judgment! Turn on your curiosity and notice your judgments as we go – it’s kinda fun, actually.\nThe Pleasure of Judgement\n\n \tDescription of what self-righteous judgment looks like presented in an anecdotal but accurate way.\n\nQuick Review\n\n \tEvery human being has a system to manage threat.\n \tBlue – you down-regulate\n \tRed – you up-regulate\n\nThe Role of Judgment\n\n \tMethod of self-protection\n \tResponse to a feeling of threat\n \t2 types: self-righteous or self-critical\n\nSelf-Righteous Judgment\n\n \tIt’s a great feeling.\n \tWhat’s really going on underneath?\n \tDisconnection from threat in our own body\n \tSlowing down to experience what we are judging\n \tFortified defense\n \tNot pathological, it’s protective\n \tExample of Blue Judgment\n \tFear of Vulnerability\n \tJudging to keep at a distance\n \tExample of Red Judgment\n \tTelling others what they are doing wrong\n \tJudging to prevent expressing fear of abandonment underneath\n\nNon-Judgment\n\n \tInability to create a judgment can be an indication that we can’t have a sense of self and an essence of threat, and that clearly defining ourselves is too vulnerable. (red-side of insecure spectrum, usually)\n\nJudgment Can Be A Healthy Protection\n\n \tNot all judgment is bad\n \tExplore it.\n\nRighteousness to Relationality\n\n \tExploring the movie about Harriet Tubman\n \tThe moral high road\n \tRighteousness as the lazy man’s way\n \tMaking the move\n \tEffecting change while staying in the relationship\n\nSelf-Judgment\n\n \tAlso the lazy man’s road\n \tSame old negative thoughts\n \tNo movement and no new neural pathways being built\n \tKeeps us stuck\n \tMoving from self-loathing to connection\n \tPutting our feet to the fire\n\nIt’s not that it’s pathological – it’s information. We think it’s information about the other person, but really it can be a window into something more interesting if we open up to exploring it.  Why do you judge THAT in particular? What parts of others make your skin crawl? Check if it’s disowned parts of yourself that you are attempting to distance from or stamp out in others. You see…. now it gets interesting and the door opens rather than slams close on the object of our scrutiny.\nPractice Noticing With Compassion\n\n \tFind your version of what it is that you’re judging.\n \tHave a little smile of humor when you catch yourself being judgmental\n \tExplore what’s underneath\n\n \nResources\nHealing Your Attachment Wounds by Diane Pool Heller\n\nHealing Developmental Trauma Lawrence Heller\n\nSelf-Compassion, the Hidden Power of Being Kind to Yourself by Kristin Neff\n\nAlso check out TU73: Building Grit Through Self-Compassion with Kristin Neff\n \nWho doesn’t love special offers?\n\nOur course is now available for a deeply discounted early release price! While this course is aimed toward clinicians (CE’s available!), all who are highly interested in deepening the security in yourselves and your relationships are welcome to participate. Price increases on October 22, 2019 when it is released to the wider public.",
  "enclosure": "",
  "itunes:subtitle": "Judgment says more about the judg-er than the judg-ee. It’s not Judgement – Bad. It’s Judgment-Interesting. - Everybody judges and in truth, we unconsciously evaluate good/bad all the time – both positively and negatively.",
  "itunes:summary": "Judgement says more about the judg-er than the judg-ee.  It&apos;s not Judgement = Bad.  It&apos;s Judgement = Interesting!!<br />\nEverybody judges and in truth, we unconsciously evaluate good/bad all the time - both positively and negatively.  It&apos;s our brains appraisal system.  However unchecked it&apos;s also a very handy interpersonal defense.  Today we explore one aspect of insecure functioning, unchecked judgement and harsh self-criticism.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "21:03"
}