{
  "title": "Disentangling the Facts From the Hype of Quantum Computing",
  "link": "https://spectrum.ieee.org/ieee-quantum-week",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/two-men-hold-a-large-gold-cylinder-that-is-suspended-by-several-narrow-gold-pipes.jpg?id=31720293&width=1200&height=400&coordinates=0%2C63%2C0%2C302\"/><br/><br/><div></div><p><em>This is a guest post in recognition of <a href=\"https://qce.quantum.ieee.org/2022/\" target=\"_blank\">IEEE Quantum Week 2022</a>. The views expressed here are solely those of the author and do not represent positions of </em>IEEE Spectrum<em> or the IEEE.</em></p><p>Few fields invite as much unbridled hype as quantum computing. Most people’s understanding of quantum physics extends to the fact that it is unpredictable, powerful, and almost existentially strange. A few years ago, I provided <em>IEEE Spectrum </em>an update on the <a href=\"https://spectrum.ieee.org/an-optimists-view-of-the-4-challenges-to-quantum-computing\" target=\"_self\">state of quantum computing</a> and looked at both the positive and negative claims across the industry. And just as back in 2019, I remain enthusiastically optimistic today. Even though the hype is real and has outpaced the actual results, much has been accomplished over the past few years.<br/></p><p>First, let’s address the hype. </p><p>Over the past five years, there has been undeniable hype around quantum computing—hype around approaches, timelines, applications, and more. As far back as 2017, vendors were claiming the commercialization of the technology was just a couple of years away. There was even what I’d call <a href=\"https://spectrum.ieee.org/the-case-against-quantum-computing\" target=\"_self\">antihype</a>, with some questioning if quantum computers would materialize at all. I hope they end up being wrong.</p><p>More recently, companies have shifted their timelines from a few years to a decade, but they continue to release road maps showing <a href=\"https://www.theverge.com/2021/5/19/22443453/google-quantum-computer-2029-decade-commercial-useful-qubits-quantum-transistor\" rel=\"noopener noreferrer\" target=\"_blank\">commercially viable systems as early as 2029</a>. And these hype-fueled expectations are becoming institutionalized: The <a href=\"https://www.dhs.gov/\" target=\"_blank\">Department of Homeland Security</a> even <a href=\"https://www.nextgov.com/emerging-tech/2021/10/dhs-issues-roadmap-help-organizations-prepare-quantum-computing-threat/185844/\" target=\"_blank\">released a road map</a> to protect against the threats of quantum computing, in an effort to help institutions transition to new security systems. This creates an “adopt or you’ll fall behind” mentality for both quantum-computing applications and postquantum cryptography security.</p><p>Market research firm <a href=\"https://www.gartner.com/en\" target=\"_blank\">Gartner</a> (of the <a href=\"https://www.gartner.com/en/research/methodologies/gartner-hype-cycle\" target=\"_blank\">“Hype Cycle”</a> fame) believes quantum computing may have already reached peak hype, or phase two of its five-phase growth model. This means the industry is about to enter a phase called “the trough of disillusionment.\" According to <a href=\"https://www.mckinsey.com/\" target=\"_blank\">McKinsey & Company</a>, “fault tolerant quantum computing <a href=\"https://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/quantum-computing-use-cases-are-getting-real-what-you-need-to-know\" target=\"_blank\">is expected between 2025 and 2030</a> based on announced hardware roadmaps for gate-based quantum computing players.” I believe this is not entirely realistic, as we still have a long journey to achieve quantum practicality—the point at which quantum computers can do something unique to change our lives. </p><p>In my opinion, quantum practicality is likely still 10 to 15 years away. However, progress toward that goal is not just steady; it’s accelerating. That’s the same thing we saw with Moore’s Law and semiconductor evolution: The more we discover, the faster we go. Semiconductor technology has taken decades to progress to its current state, accelerating at each turn. We expect similar advancement with quantum computing.</p><p>In fact, we are discovering that what we have learned while engineering transistors at <a href=\"https://www.intel.com/content/www/us/en/homepage.html\" target=\"_blank\">Intel</a> is also helping to speed our quantum-computing development work today. For example, when developing <a href=\"https://spectrum.ieee.org/intels-quantum-computing-plans-hot-qubits-cold-control-chips-and-rapid-testing\" target=\"_self\">silicon spin qubits</a>, we’re able to leverage existing transistor-manufacturing infrastructure to ensure quality and to speed up fabrication. We’ve started the mass production of qubits on a 300-millimeter silicon wafer in a high-volume fab facility, which allows us to fit an array of more than 10,000 quantum dots on a single wafer. We’re also leveraging our experience with semiconductors to create a cryogenic quantum control chip, called <a href=\"https://www.intel.com/content/www/us/en/research/quantum-computing.html\" rel=\"noopener noreferrer\" target=\"_blank\">Horse Ridge</a>, which is helping to solve the interconnect challenges associated with quantum computing by eliminating much of the cabling that today crowds the dilution refrigerator. And our experience with testing semiconductors has led to the development of the <a href=\"https://www.intel.com/content/www/us/en/newsroom/news/intels-cryoprober-quantum-research.html\" rel=\"noopener noreferrer\" target=\"_blank\">cryoprober</a>, which enables our team to get testing results from quantum devices in hours instead of the days or weeks it used to take.</p><p>Others are likely benefiting from their own prior research and experience, as well. For example, <a href=\"https://www.quantinuum.com/\" target=\"_blank\">Quantinuum’s</a> recent research <a href=\"https://www.quantinuum.com/pressrelease/logical-qubits-start-outperforming-physical-qubits\" target=\"_blank\">showed the entanglement of logical qubits</a> in a fault-tolerant circuit using real-time quantum error correction. While still primitive, it’s an example of the type of progress needed in this critical field. For its part, Google has a new open-source library called <a href=\"https://quantumai.google/cirq\" rel=\"noopener noreferrer\" target=\"_blank\">Cirq</a> for programming quantum computers. Along with similar libraries from IBM, Intel, and others, Cirq is helping drive development of improved quantum algorithms. And, as a final example, IBM’s 127-qubit processor, called <a href=\"https://research.ibm.com/blog/127-qubit-quantum-processor-eagle\" rel=\"noopener noreferrer\" target=\"_blank\">Quantum Eagle</a>, shows steady progress toward upping the qubit count.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-right\" data-rm-resized-container=\"25%\" style=\"float: right;\">\n<img alt=\"A man holds a bumpy gold rectangle in front of a spindly machine.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"2e57de474e52ab8607c49a0a860eeadf\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"50104\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-man-holds-a-bumpy-gold-rectangle-in-front-of-a-spindly-machine.jpg?id=31720324&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The author shows Intel quantum-computing prototypes.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Intel</small></p><p>There are also some key challenges that remain.</p><ul><li>First, we still need better devices and high-quality qubits. While the very best one- and two-qubit gates meet the needed threshold for fault tolerance, the community has yet to accomplish that on a much larger system.</li><li>Second, we’ve yet to see anyone propose an interconnect technology for quantum computers that is as elegant as how we wire up microprocessors today. Right now, each qubit requires multiple control wires. This approach is untenable as we strive to create a large-scale quantum computer.</li><li>Third, we need fast qubit control and feedback loops. Horse Ridge is a precursor for this, because we would expect latency to improve by having the control chip in the fridge and therefore closer to the qubit chip.</li><li>And finally, error correction. While there have been some recent indications of progress to correction and mitigation, no one has yet run an error-correction algorithm on a large group of qubits.</li></ul><p>With new research regularly showing novel approaches and advances, these are challenges we will overcome. For example, many in the industry are looking at how to integrate qubits and the controller on the same die to create quantum system-on-chips (SoCs).</p><p>But we’re still quite a way off from having a fault tolerant quantum computer. Over the next 10 years, Intel expects to be competitive (or pull ahead) of others in terms of qubit count and performance, but as I stated before, a system large enough to deliver compelling value won’t be realized for 10 to 15 years, by anyone. The industry needs to continue its evolution of qubit counts and quality improvement. After that, the next milestone should be the production of thousands of quality qubits (still several years away), and then scaling that to millions.</p><p>Let’s remember that it took Google 53 qubits to create an application that could accomplish a supercomputer function. If we want to explore new applications that go beyond today’s supercomputers, we’ll need to see system sizes that are orders of magnitude larger.</p><p>Quantum computing has come a long way in the past five years, but we still have a long way to go, and investors will need to fund it for the long term. Significant developments are happening in the lab, and they show immense promise for what could be possible in the future. For now, it’s important that we don’t get caught up in the hype but focus on real outcomes.</p><p><br/></p><p><em><strong>Correction 21 Sept. 2022: </strong>A previous version of this post stated incorrectly that the release of an announced 5,000-qubit quantum computer in 2020 did not happen. <a href=\"https://en.wikipedia.org/wiki/D-Wave_Systems#Pegasus\" target=\"_blank\">It did</a>. </em>Spectrum<em> regrets the error. </em><br/></p>",
  "pubDate": "Mon, 19 Sep 2022 14:00:00 +0000",
  "guid": "https://spectrum.ieee.org/ieee-quantum-week",
  "category": [
    "Quantum computers",
    "Quantum processors",
    "Quantum programming",
    "Cryogenic ic",
    "Qubits",
    "Intel",
    "Quantum computing"
  ],
  "dc:creator": "James S. Clarke",
  "media:content": ""
}