{
  "title": "Analytics Insights and Careers at the Speed of Data",
  "link": "http://rocketdatascience.org/?p=1574",
  "comments": "http://rocketdatascience.org/?p=1574#respond",
  "dc:creator": "Kirk Borne",
  "pubDate": "Fri, 19 Mar 2021 21:54:07 +0000",
  "category": [
    "Analytics",
    "Big Data",
    "Data Science",
    "Internet of Things",
    "Machine Learning",
    "Strategy"
  ],
  "guid": "http://rocketdatascience.org/?p=1574",
  "description": "The determination of winners and losers in the data analytics space is a much more dynamic proposition than it ever has been. One CIO said it this way, “If CIOs invested in machine learning three years ago, they would have wasted their money. But if they wait another three years, they will never catch up.” [&#8230;]",
  "content:encoded": "\n<figure class=\"wp-block-image\"><img loading=\"lazy\" width=\"744\" height=\"400\" src=\"http://rocketdatascience.org/wp-content/uploads/2021/03/LinkedIn-Article-Graphic.jpg\" alt=\"\" class=\"wp-image-1575\" srcset=\"http://rocketdatascience.org/wp-content/uploads/2021/03/LinkedIn-Article-Graphic.jpg 744w, http://rocketdatascience.org/wp-content/uploads/2021/03/LinkedIn-Article-Graphic-300x161.jpg 300w, http://rocketdatascience.org/wp-content/uploads/2021/03/LinkedIn-Article-Graphic-624x335.jpg 624w\" sizes=\"(max-width: 744px) 100vw, 744px\" /><figcaption> <em>How to make smarter data-driven decisions at scale</em>: <a href=\"http://bit.ly/3rS3ZQW\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">http://bit.ly/3rS3ZQW</a> </figcaption></figure>\n\n\n\n<p>The determination of winners and losers in the data analytics space is a much more dynamic proposition than it ever has been. One<a> </a><a rel=\"noreferrer noopener\" aria-label=\"CIO said it this way (opens in a new tab)\" href=\"https://www.cio.com/article/3061713/why-its-time-for-cios-to-invest-in-machine-learning.html\" target=\"_blank\">CIO said it this way</a>, <em>“If CIOs invested in machine learning three years ago, they would have wasted their money. But if they wait another three years, they will never catch up.” </em>&nbsp;Well, that statement was made five years ago! A lot has changed in those five years, and so has the data landscape. </p>\n\n\n\n<p>The dynamic changes of the business requirements and\nvalue propositions around data analytics have been increasingly intense in\ndepth (in the number of applications in each business unit) and in breadth (in\nthe enterprise-wide scope of applications in all business units in all\nsectors). But more significant has been the acceleration in the number of dynamic,\nreal-time data sources and corresponding dynamic, real-time analytics\napplications. </p>\n\n\n\n<p>We no longer should worry about “managing data at the\nspeed of business,” but worry more about “managing business at the speed of\ndata.”</p>\n\n\n\n<p>One of the primary drivers for the phenomenal growth in dynamic real-time data analytics today and in the coming decade is the&nbsp;Internet of Things (IoT) and its sibling the Industrial IoT (IIoT). With its vast assortment of sensors and streams of data that yield digital insights in situ in almost any situation, the IoT / IIoT market has a <a href=\"https://www.iot-now.com/2020/05/20/102937-global-iot-market-to-grow-to-1-5trn-annual-revenue-by-2030/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"projected market valuation of $1.5 trillion by 2030 (opens in a new tab)\">projected market valuation of $1.5 trillion by 2030</a>. The accompanying technology Edge Computing, through which those streaming digital insights are extracted and then served to end-users, has a <a rel=\"noreferrer noopener\" aria-label=\"projected valuation of $800 billion by 2028 (opens in a new tab)\" href=\"https://venturebeat.com/2021/03/11/state-of-the-edge-report-projects-edge-computing-will-reach-800b-by-2028/\" target=\"_blank\">projected valuation of $800 billion by 2028</a>. </p>\n\n\n\n<p>With dynamic real-time insights, this “Internet\nof Everything” can then become the “Internet of Intelligent Things”, or as I\nlike to say, <em>“The Internet used to be a thing. Now things are the Internet.”</em>\nThe vast scope of this digital transformation in dynamic business insights\ndiscovery from entities, events, and behaviors is on a scale that is almost\nincomprehensible. Traditional business analytics approaches (on laptops, in the\ncloud, or with static datasets) will not keep up with this growing tidal wave\nof dynamic data.</p>\n\n\n\n<p>Another dimension to this story, of course, is the Future of Work discussion, including creation of new job titles and roles, and the demise of older job titles and roles. <a href=\"https://www.androidauthority.com/internet-of-things-companies-1023404/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"One group has declared (opens in a new tab)\">One group has declared</a>, <em>“IoT companies will dominate the 2020s: Prepare your resume!”</em> This article quotes an older <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https://www.crn.com/slide-shows/internet-of-things/10-hot-iot-companies-to-watch-in-2019\" target=\"_blank\">market projection (from 2019)</a>, which estimated <em>“the global industrial IoT market could reach $14.2 trillion by 2030.”</em></p>\n\n\n\n<p>In\ndynamic data-driven applications, automation of the essential processes (in\nthis case, data triage, insights discovery, and analytics delivery) can give a\npower boost to ride that tidal wave of fast-moving data streams. One can\nprepare for and improve skill readiness for these new business and career\nopportunities in several ways:</p>\n\n\n\n<ul><li>Focus on the automation of business processes: <em>e.g.,</em> artificial intelligence, robotics, robotic process automation, intelligent process automation, chatbots. </li><li>Focus on the technologies and engineering components: <em>e.g.,</em> sensors, monitoring, cloud-to-edge, microservices, serverless, insights-as-a-service APIs, IFTTT (IF-This-Then-That) architectures. </li><li>Focus on the data science: <em>e.g.,</em> machine learning, statistics, computer vision, natural language understanding, coding, forecasting, predictive analytics, prescriptive analytics, anomaly detection, emergent behavior discovery, model explainability, trust, ethics, model monitoring (for data drift and concept drift) in dynamic environments (MLOps, ModelOps, AIOps).</li><li>Focus on specific data types: <em>e.g.,</em> time series, video, audio, images, streaming text (such as social media or online chat channels), network logs, supply chain tracking (e.g., RFID), inventory monitoring (SKU / UPC tracking).</li><li>Focus on the strategies that aim these tools, talents, and technologies at reaching business mission and goals: <em>e.g.,</em> data strategy, analytics strategy, observability strategy (<em>i.e.,</em> why and where are we deploying the data-streaming sensors, and what outcomes should they achieve?).</li></ul>\n\n\n\n<p>Insights\ndiscovery from ubiquitous data collection (via the tens of billions of\nconnected devices that will be measuring, monitoring, and tracking nearly\neverything internally in our business environment and contextually in the\nbroader market and global community) is ultimately about value creation and business\noutcomes. Embedding real-time dynamic analytics at the edge, at the point of\ndata collection, or at the moment of need will dynamically (and positively) change\nthe slope of your business or career trajectory. Dynamic sense-making, insights\ndiscovery, next-best-action response, and value creation is essential when data\nis being acquired at an enormous rate. Only then can one hope to realize the\npromised trillion-dollar market value of the Internet of Everything.</p>\n\n\n\n<p>For more advice, check out this upcoming webinar panel discussion, sponsored by <a rel=\"noreferrer noopener\" aria-label=\"AtScale (opens in a new tab)\" href=\"https://www.linkedin.com/company/atscale-inc-/\" target=\"_blank\">AtScale</a>,  with data and analytics leaders from Wayfair, Cardinal Health, <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"http://bol.com/\" target=\"_blank\">bol.com</a>, and Slickdeals: <em>“How to make smarter data-driven decisions at scale.”</em> Each panelist will share an overview of their data & analytics journey, and how they are building a self-service, data-driven culture that scales. Join us on Wednesday, March 31, 2021 (11:00am PT | 2:00pm ET). Save your spot here: <a rel=\"noreferrer noopener\" href=\"http://bit.ly/3rS3ZQW\" target=\"_blank\">http://bit.ly/3rS3ZQW</a>. I hope that you find this event useful. And I hope to see you there! </p>\n\n\n\n<p> Please follow me on <a href=\"https://www.linkedin.com/in/kirkdborne/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"LinkedIn (opens in a new tab)\">LinkedIn</a>&nbsp;and follow me on Twitter at&nbsp;<a rel=\"noreferrer noopener\" aria-label=\"@KirkDBorne.  (opens in a new tab)\" href=\"https://twitter.com/KirkDBorne\" target=\"_blank\">@KirkDBorne. </a></p>\n",
  "wfw:commentRss": "http://rocketdatascience.org/?feed=rss2&#038;p=1574",
  "slash:comments": 0
}