{
  "title": "TU46: Redefining Infidelity &#8211; Guest Esther Perel on Love and Desire in Modern Relationships",
  "link": "https://therapistuncensored.com/episodes/tu46-redefining-infidelity-guest-esther-perel-on-love-and-desire-in-modern-relationships/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu46-redefining-infidelity-guest-esther-perel-on-love-and-desire-in-modern-relationships",
  "pubDate": "Tue, 24 Oct 2017 12:00:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=5458",
  "description": "Let&#039;s talk infidelity with Guest Esther Perel\nUpdate your model of healthy relationships in the digital age and widen your perspective on the erotic, which is the difference between a relationship that just survives, and one that thrives! Guest Esther Perel shares her research on love, desire and infidelity in modern relationships.\n\nPatty Olwell, former co-host of Therapist Uncensored, returns for a meaningful conversation with Esther Perel, author of Mating in Captivity and The State of Affairs: Rethinking Infidelity. In this episode they discuss concepts such as infidelity, consent and betrayal in the modern digital era.  In addition, learn how sexual education differs in the United States versus Europe.  Find out what the best way to handle the “crisis mode” of a betrayal in a relationship and how can we avert it by openly communicating early on. Also discover how we can cope with trauma within a relationship and how to make sense of the connection between love and desire.\n\nThank you to Patty Olwell for this incredible interview!\n\n0:00-15:00\n\nIntroduction, Esther’s study of love & desire, research in infidelity, definition of infidelity today\n\nDefining Infidelity: 1) Secret 2) Emotional Involvement to some degree 3) Sexual Aura\n\nDefining “cheating” traditionally and in the modern era of smart phones and social media: where do we draw the line?\n\nContradictory feelings in crisis mode of relationship\n\nImportant issues with betrayal trauma –\n\n1) Ability of person who crossed the agreed upon relational lines to recognize the injury\n\n2) Questions will keep returning and getting deeper and the inflictor will need to continue to manage and help the other person heal\n\n3) Help decide if you really want details because you can’t unknow them once shared\n\n15:00 – 30:00\n\nDifferent types of couples -t hose with ability to empathize with the others through buffers, those who can understand accountability, those who can reconnect sexually, etc.\n\nEsther’s background growing up in community of Holocaust survivors. Idea of having survived versus being alive in couples and how that relates to eroticism.\n\nCuriosity and eroticism – engaging in trust into unknown. Must find balance of security and adventure.\n\nEsther’s research findings. Existential problem of love and desire relating but conflicting. Data-driven.\n\nSex addiction as the “medicalization of affairs”\n\nDoug Braun-Harvey and out of control sexual behavior\n\n30:00 – 45:00\n\nWhile there are people with out of control sexual behavior, not everyone who has strayed from their relationship repeatedly has an “addiction.”\n\nImplications of 12-step program for those diagnosed with sex addiction. Just because a person has a problem doesn’t mean they have an addiction. When it becomes an excuse, it’s a problem.\n\nPornography (or the use of sexually explicit imagery) as primary form of sexual education for those in the US versus starting education that emphasizes health and pleasure in Belgium starting at age 4.\n\nEducating for online adult images, relationships and responsibility at an early age.\n\nEmotional intelligence and empathy in the digital age.\n\nIn the US: sex is risk factor. In Europe: irresponsibility is risk factor.\n\nMessages from Esther as a non-US citizen: treat issues globally; troubles are not that different. Don’t be afraid to collaborate with fellow therapists. Psychotherapists shouldn’t be recluse in their offices but should feel welcome to bring psychotherapy to the public sphere.\n\n45:00 – 60:00\n\nExclusivity.\n\nMaking couples have difficult conversations for the overall improvement of the relationship.\n\nDefining monogamy over the decades. New ground of defining monogamy. Monogamy needs to be defined in relationships BEFORE a crisis occurs.\n\nOutro\n\nIf you liked this episode you’ll love these: Related episodes mentioned in today’s podcast- Doug Braun-Harvey interviews Part 1 and Part 2 start here for Part 1!",
  "enclosure": "",
  "itunes:subtitle": "Let&#039;s talk infidelity with Guest Esther Perel Update your model of healthy relationships in the digital age and widen your perspective on the erotic, which is the difference between a relationship that just survives, and one that thrives!",
  "itunes:summary": "Guest Esther Perel shares her research on love, desire and infidelity in modern relationships.  Update your model of relational and sexual health, and widen your perspective on the erotic, which is the difference between a relationship that just survives, and one that thrives!",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "50:36"
}