{
  "id": "https://bibleinoneyear.org/en/youth/187",
  "title": "Day 187: How to Cope with the Challenges of Life",
  "description": "Psalm 81:6–7, 2 Kings 13:1–5a,14–19,22–23, Acts 25:1–4,7,13–22. Our world is facing major challenges with the pandemic of COVID-19 and the scourge of racism, modern slavery, climate change, mass starvation, wars and terrorism As I read the passages for today, I am reminded that the relatively minor challenges, problems and hassles that I face are nothing compared to what the people of God have faced in the past, and still face around the world today",
  "pubDate": "Wed, 06 Jul 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/187/",
  "itunes:duration": "16:07",
  "guid": "enyouth06072022-187",
  "length": 967.71,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 187: How to Cope with the Challenges of Life",
  "itunes:subtitle": "Psalm 81:6–7, 2 Kings 13:1–5a,14–19,22–23, Acts 25:1–4,7,13–22. Our world is facing major challenges with the pandemic of COVID-19 and the scourge of racism, modern slavery, climate change, mass starvation, wars and terrorism As I read the passages for today, I am reminded that the relatively minor challenges, problems and hassles that I face are nothing compared to what the people of God have faced in the past, and still face around the world today",
  "itunes:summary": "President John F. Kennedy said, ‘We stand today on the edge of a new frontier… but the new frontier of which I speak is not a set of promises – it is a set of challenges. It sums up not what I intend to offer the American people, but what I intend to ask of them.’\nLife is a set of challenges, problems and hassles. We sometimes imagine that if we could just deal with the immediate challenge that we are facing, all our problems would be over. But life is not like that. If we resolve one problem, others are just around the corner.\nThe temptation is to see these challenges as preventing us from carrying out the ministry God has given us. In actual fact, dealing with the problems is the ministry. As one former Bishop of Kensington put it: ‘These are not the problems associated with the ministry, they are the ministry.’\nThe Bible is true to life. The psalmist faced pain and distress. Paul faced false accusation and the frustration of being kept in prison on trumped up charges. The kings in the Old Testament faced battles and a massive building project challenge.\nOur world is facing major challenges with the pandemic of COVID-19 and the scourge of racism, modern slavery, climate change, mass starvation, wars and terrorism.\nAs I read the passages for today, I am reminded that the relatively minor challenges, problems and hassles that I face are nothing compared to what the people of God have faced in the past, and still face around the world today.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 552
}