{
  "title": "Le goût",
  "description": "<p>food [delights]</p>\n\n<p>experience (so) special</p>\n\n<p>artful bouquets balanced, with care</p>\n\n<p>unexpected, combinatorial</p>\n\n<p>sichuanese cuisine. my favorite chinese restaurant. the nuanced sichuan pepper. its numbing aspect, bouquet of flowers, ground potpourri. vegetal</p>\n\n<p>pepper segway: the fresh flesh of the habanero, seductive, fruity, aromatic. Tantalizing yet deadly heat. Yearning for the burn 🔥</p>\n\n<p>gyro (euro, not GYRO[scope]): savory lamb souvlaki, tarty-salty feta, the crunch of lettuce, acidity of tomato, bitterness of onion. bite. pita is merely a conveyance, i have no allegiance (je suis fou)</p>\n\n<p><em>je aime le pâté</em>. intense and exciting. layers of <em>goût</em>. weird body parts (livers &amp;tc). langue de boeuf: excellent as charcuturie goes, bien sûr, but perhaps not a pâté… mais ouai, c’est… c’est vraiment delicieux</p>\n\n<p>PETRICHOR. earthy. smoky. umami. leather, (smoked, cold or hot, it doesn’t matter!) salmon, a fire crackling in the room, a wood burning stove (at home or encountered on a walk, blocks away at twilight in a sleepy neighborhood), a good cigar, pipe tobacco, even a decent cigarette for the right occasion (the drink before and the smoke after)</p>\n\n<p>hunkering down. inside in autumn, or en hiver, storms approaching, under the warm (scritchy-scratchy) blanket (with a loved one? kisses, magical taste &lt;3). it gets cold. add a mug of something warm. like tea (smoky, grassy, vegetal), or a hot toddy (sweet). or a hot body. eggplant emoji.</p>\n\n<p>baba ganoush. baba-que, barbeque, brisket, ribs. albiet slightly carcinogenic (i often dream of it)</p>\n\n<p>aroma of lapsang souchong. unparalleled – stronger varieties of russian caravan <em>notwithstanding</em></p>\n\n<p>the scotches of islay – dried over peat fires, said peat dug up from the very ground upon which it is burnt</p>\n\n<p>the texture(smoked salmon): savory, sweet, tangy, smoke gently flirting with its edges –&gt; <em>brain zinger!</em>. the way the salmon can go so oh well, just like so, with the <em>right</em> company {perhaps a well-paired cheese} PINKY UP</p>\n\n<p>smoked bleu from a rogue creamerie, as it were</p>\n\n<p>smoked salt on a chocolate caramel from a local confectionery</p>\n\n<p>a proper connection between flavor(s) and smell(s) on a single manifold of olfactory phenomenae. an equivalency relation ~ between scotch, leather, and good dirt, satisfying reflexivity, symmetry, and transitivity</p>\n\n<p>o(m(g))</p>\n\n<hr />\n\n<p><img src=\"http://www.napowrimo.net/wp-content/uploads/2020/03/napo2020button1-1.png\" alt=\"NaPoWriMo\" /></p>\n\n<h1 id=\"national-poetry-writing-month\">National Poetry (Writing) Month</h1>\n\n<p>This is a poem in a series of poems during April, 2020, for #NationalPoetryMonth and #NaPoWriMo #NaPoWriMo2020</p>\n\n<p>My <a href=\"/2020/03/31/national-poetry-writing-month.html\">NationalPoetryWritingMonth post</a>.</p>",
  "pubDate": "Thu, 02 Apr 2020 00:00:00 +0000",
  "link": "http://korbonits.github.io/2020/04/02/go%C3%BBt.html",
  "guid": "http://korbonits.github.io/2020/04/02/go%C3%BBt.html"
}