{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-648202177752490084",
  "published": "2022-09-29T18:57:00.001-05:00",
  "updated": "2022-09-30T09:51:02.113-05:00",
  "category": [
    "",
    "",
    "",
    ""
  ],
  "title": "Supply and inflation",
  "content": "<p>&nbsp;<a href=\"https://www.aei.org/carpe-diem/chart-of-the-day-or-century-8/\" target=\"_blank\">Mark Perry recently updated</a> a fabulous chart:&nbsp;</p><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://www.aei.org/wp-content/uploads/2022/07/cpi2022junea-3.png?x91208\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"800\" data-original-width=\"742\" height=\"800\" src=\"https://www.aei.org/wp-content/uploads/2022/07/cpi2022junea-3.png?x91208\" width=\"742\" /></a></td></tr></tbody></table>Not all inflation is the same.&nbsp;<div><br /></div><div>Some interpretations, from Mark. Tradeable (international competition) / non tradeable; government intervention / free market; durable goods / services:&nbsp;<blockquote><p>a. The greater (lower) the degree of government involvement in the provision of a good or service the greater (lower) the price increases (decreases) over time, e.g., hospital and medical costs, college tuition, childcare with both large degrees of government funding/regulation and large price increases vs. software, electronics, toys, cars and clothing with both relatively less government funding/regulation and falling prices. As somebody on Twitter commented:</p></blockquote><blockquote><p><b>Blue lines</b> = prices subject to free-market forces. <b>Red lines</b> = prices subject to regulatory capture by government. Food and beverages are debatable either way. <b>Conclusion:</b> remind me why socialism is so great again.</p></blockquote><blockquote><p>b. Prices for manufactured goods (cars, clothing, appliances, furniture, electronic goods, toys) have experienced large price declines over time relative to overall inflation, wages, and prices for services (education, medical care, and childcare).</p></blockquote><blockquote><p>c. The greater the degree of international competition for tradeable goods, the greater the decline in prices over time, e.g., toys, clothing, TVs, appliances, furniture, footwear, etc.</p></blockquote><blockquote><p>d. From Twitter comments this week (2022).</p></blockquote><p></p><blockquote><p>*Thank goodness the government doesn’t subsidize TVs or toys, or toy TVs.</p><p>*Almost every line that went up, has had some type of government involvement, while the lines going down have more to do with capitalism.</p><p>*And as always, the more regulated, the more expensive things become.</p></blockquote><p>There is a big distributional impact here. Less well off people buy more blue stuff, rich people more red stuff.&nbsp;</p><p>The implications for greater protection, less immigration, industrial policy, and subsidies are pretty clear.&nbsp;</p><p><i>Update:</i></p><p>I have been sloppy, about one of my own pet peeves. This graph is about relative prices, not about inflation. &nbsp;</p><p>&nbsp;</p><blockquote><p></p><p>&nbsp;</p></blockquote><p></p></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 31
}