{
  "title": "Murray Rothbard versus the Progressives",
  "link": "https://mises.org/node/60823",
  "description": "<p><em>There has been a radical change in the social and political landscape in this country, and any person who desires the victory of liberty and the defeat of Leviathan must adjust his strategy accordingly. New times require a rethinking of old and possibly obsolete strategies. </em>—Murray N. Rothbard<a class=\"see-footnote\" id=\"footnoteref1_2ry4kgn\" title=\"Murray N. Rothbard, “A New Strategy for Liberty,” October 1994, in The Irrepressible Rothbard: The Rothbard-Rockwell Report Essays of Murray N Rothbard, ed. Llewellyn H. Rockwell, Jr. (Burlingame, CA: Center for Libertarian Studies, 2000), p. 35.\" href=\"#footnote1_2ry4kgn\">1</a></p>\n<p>Murray Rothbard wrote the above words in 1994, shortly before his untimely passing. They sum up the main theme of a series of brilliant articles that he published in the 1990s calling for a radical readjustment of libertarian strategy to the new political and social realities that had emerged in the aftermath of the collapse of communism in Eastern Europe and the Soviet Union. In these articles, Rothbard identified both the abstract social philosophy and the concrete political movement that then had emerged as the greatest menace to liberty and society. He also proposed a radical reformulation of the political spectrum and a revised political vocabulary to express the new strategy called for in the altered ideological and political context. </p>\n<p>Before proceeding further, I want to point out that Rothbard’s articles, despite their deep insight and radical implications for libertarian strategy, have been largely overlooked by friend and foe alike for a couple of reasons. First, when he wrote the articles, Rothbard was hard at work on his monumental two-volume treatise on economic thought. Understandably, he wrote the articles quickly as one-off responses to particular events, ideas, and political developments during a period of rapid change, from 1991 to 1994. Rothbard’s new views on strategy were therefore presented as fragments in different articles containing inevitable repetition and overlapping. This obscured the fact that taken together these articles presented a systematic and comprehensive strategy for radical social and political change. Second, the articles appeared in the <em>Rothbard-Rockwell Report</em> a journal of social, political, and cultural commentary. Unfortunately, <em>Triple R</em>’s scintillating polemics and its coverage of an incredibly broad range of topics sometimes diverted the reader from the deep theorizing that informed many of its articles. I confess that I did not appreciate the significance of Rothbard’s articles, and their unity and breadth of vision, until very recently. </p>\n<h4><strong>Social Democracy: Identifying the Enemy</strong></h4>\n<p>After the collapse of communism, and with Nazism and fascism “long dead and buried,”<a class=\"see-footnote\" id=\"footnoteref2_ms6wzdi\" title=\"Murray N. Rothbard, “Frank Meyer and Sidney Hook,” January 1991, in The Irrepressible Rothbard, p. 23.\" href=\"#footnote2_ms6wzdi\">2</a> Rothbard argued that social democracy was the only remaining statist program, and its advocates were hell bent on making the most of their ideological monopoly. In the “new post-communist world,” Rothbard wrote:</p>\n<p>The Enemy of liberty and tradition is now revealed full-blown: social democracy. For social democracy in all of its guises is not only still with us ... but now that Stalin and his heirs are out of the way, social democrats are trying to reach for total power.<a class=\"see-footnote\" id=\"footnoteref3_8ateqm1\" title=\"Ibid., p. 23.\" href=\"#footnote3_8ateqm1\">3</a></p>\n<p>Not only is social democracy still with us in its many variations, but it has managed to define “our entire respectable political spectrum, from advanced victimology and feminism on the left over to neoconservatism on the right.”<a class=\"see-footnote\" id=\"footnoteref4_2rakf1m\" title=\"Murray N. Rothbard, “A Strategy for the Right,” January 1992, in The Irrepressible Rothbard, p. 19.\" href=\"#footnote4_2rakf1m\">4</a> Make no mistake about it, Rothbard warned, “on all crucial issues, social democrats however they label themselves, stand against liberty and tradition and in favor of statism and Big Government.” Furthermore, social democracy is far more insidious than other forms of statism because it claims “to combine socialism with the appealing virtues of ‘democracy’ and freedom of inquiry.”<a class=\"see-footnote\" id=\"footnoteref5_m0xrmo3\" title=\"Rothbard, “Frank Meyer and Sidney Hook,” p. 23.\" href=\"#footnote5_m0xrmo3\">5</a> As shrewd observers of the political scene for a century and a half, social democrats—or left liberals in the American political lexicon—are indeed seriously committed to democracy. As Rothbard explained:</p>\n<blockquote><p>The maintenance of some democratic choice, however illusory, is vital for all varieties of social democrats. They have long realized that a one-party dictatorship can and probably will become cordially hated … and will eventually be overthrown, possibly along with its entire power structure.<a class=\"see-footnote\" id=\"footnoteref6_qe8r3zs\" title=\"Murray N. Rothbard, “The November Revolution … and What to Do about It,” November 1994, in Murray N. Rothbard, Making Economic Sense (Auburn AL: Ludwig von Mises Institute, 1995), p. 398.\" href=\"#footnote6_qe8r3zs\">6</a></p></blockquote>\n<p>Picking up on the insight of the contemporary political theorist Paul Gottfried, Rothbard noted that the social democrats’ devotion to democracy also serves as a pretext for an attack on those who assert the “absolute” inviolability of the right to free speech and a free press. This assault on free speech, Rothbard presciently pointed out in 1991, </p>\n<blockquote><p>constitutes an agenda for eventually using the power of the State to restrict or prohibit speech or expression that [neocons and social democrats] hold to be “undemocratic.” This category could and would be indefinitely expanded to include: real or alleged communists, leftists, fascists, neo-Nazis, secessionists, “hate thought” criminals, and eventually … paleo-conservatives and paleo and left-libertarians.<a class=\"see-footnote\" id=\"footnoteref7_netowng\" title=\"Rothbard, “Frank Meyer and Sidney Hook,” p. 25.\" href=\"#footnote7_netowng\">7</a></p></blockquote>\n<h4><strong>Progressivism: The Social Philosophy of Social Democracy</strong></h4>\n<p>Rothbard probed deeper to expose the peculiar social philosophy that is at the root of all strains and variants of social democracy as well as communism. He identified this philosophy as progressivism, which is far more than a social and economic program for the here and now. It is a Utopian social philosophy that looks toward the establishment of a future heaven on earth. The core belief of progressives is based on the Enlightenment myth that history is an inexorable and ever upward march toward the perfection of mankind. In the case of social democrats, perfection is defined as a society ruled and engineered by a righteous, efficient, and egalitarian socialist state. Moreover, unlike traditional Marxists, social democratic progressives believe that history unfolds not through class struggle and bloody revolution but through the relentless forward march of democracy. In Rothbard’s words:</p>\n<blockquote><p>The left are in their bones, “progressives,” that is, they believe in Whig or Marxoid fashion, that history consists of an inevitable March Upward into the light, toward and into the Socialist Utopia. They believe in the myth of inevitable progress: that History is on their side.<a class=\"see-footnote\" id=\"footnoteref8_scs883j\" title=\"Murray N. Rothbard, “Liberal Hysteria: The Mystery Explained,” October 1992, in The Irrepressible Rothbard, p. 338.\" href=\"#footnote8_scs883j\">8</a></p></blockquote>\n<p>The ultimate goal of this progressive and inevitable transformation of society is not, as it is with traditional Marxists, the eradication of all class distinctions and the collective ownership of the means of production under the dictatorship of the proletariat. Rather it is, in Rothbard’s words, “a socialist, egalitarian State run by bureaucrats, intellectuals, technocrats, ‘therapists,’ and the New Class in general in collaboration with accredited victim pressure groups striving for equality.” The capitalist and entrepreneur class will not be liquidated, nor will their means of production be expropriated. Instead, the market economy will be kept but heavily taxed, regulated, and restricted. According to Rothbard:</p>\n<blockquote><p>The Social Democrats realize that it is far better for the socialist State to retain the capitalists and a truncated market economy to be regulated, confined, controlled, and subject to the commands of the State. The Social Democrat goal is not “class war,” but a kind of “class harmony,” in which capitalists and the market work for the good of society and of the parasitic State apparatus.<a class=\"see-footnote\" id=\"footnoteref9_7zwjiob\" title=\"Ibid.\" href=\"#footnote9_7zwjiob\">9</a></p></blockquote>\n<h4><strong>Revising the Political Spectrum </strong></h4>\n<p>With “neoconservative” progressives having hijacked the conservative movement and the so-called New Democrat Bill Clinton revealing his hard-left progressive inclinations, Rothbard realized that the urgent first step in combating progressivism was to completely revamp the prevailing conception of the US political spectrum and its vocabulary. On the left of his reconstructed spectrum, Rothbard arrayed all political factions inspired by the progressive-Marxist vision of social change. These groups were also fanatically devoted to democracy not merely as the surest means for instituting the progressive political and economic agenda but, in Rothbard’s words, “as a shibboleth, as an ultimate moral absolute, virtually replacing all other moral principles including the Ten Commandments and the Sermon on the Mount.”<a class=\"see-footnote\" id=\"footnoteref10_0351xgy\" title=\"Rothbard, “The November Revolution,” p. 411.\" href=\"#footnote10_0351xgy\">10</a> In Rothbard’s view the Left ranged from official conservatives and neoconservatives to left liberals and included their allied intellectual and media elites and official victim groups. </p>\n<p>On the right, Rothbard grouped all those who cherished traditional American liberties and social institutions and who aimed to stop, rollback, and undo progressive encroachments on them. Rothbard initially puzzled over the label that best suited his proposed grand coalition or “fusion” of right-wing opposition groups, which included many (but not all) libertarians, and various paleo- and traditional conservative groups. He summarily rejected the name “conservative,” tentatively proposing the terms “radical reactionaries,” “radical rightists,” or “the Hard Right.”<a class=\"see-footnote\" id=\"footnoteref11_x27elma\" title=\"Rothbard, “A Strategy for the Right,” 12.\" href=\"#footnote11_x27elma\">11</a> He finally settled on the name “politico-economic reactionaries,” or simply “reactionaries.”<a class=\"see-footnote\" id=\"footnoteref12_2hpd2sy\" title=\"Rothbard, “A New Strategy for Liberty,” p. 32; Rothbard, Rothbard, “Liberal Hysteria,” pp. 339–40.\" href=\"#footnote12_2hpd2sy\">12</a></p>\n<p>The term “reactionary” is particularly fitting for opponents of the progressive agenda. It is true that the word was coined during the French Revolution to designate those who sought a restoration of the ancien régime. But its modern usage can be traced to Marx, who used the term as a pejorative to describe many of his predecessors and opponents in the nineteenth-century socialist movement whose Utopian economic schemes involved “turning back the clock” to the precapitalist and preindustrial era of feudalism and medieval guilds. Taking a cue from their master, later communists and social democrats used “reactionary” as a smear word against the defenders of capitalism for opposing the allegedly inevitable march of history towards socialism. As Rothbard pointed out:</p>\n<blockquote><p>They become hysterical at setbacks, at regressions in that march, regressions which have, of course, been dubbed “reactions.” In both the Communist and the Social Democratic worldview, the highest, if not the only morality, is to be “progressive,” to be ... on the side of the inevitable next phase of history. In the same way, the deepest, if not the only, immorality, is to be “reactionary,” to be devoted to opposing inevitable progress, or even and at its worst, working to roll back the tide, and restore the past, “to turn back the clock.”<a class=\"see-footnote\" id=\"footnoteref13_3bjkbdh\" title=\"Rothbard, “Liberal Hysteria,” p. 339.\" href=\"#footnote13_3bjkbdh\">13</a></p></blockquote>\n<p>The odium that attaches to the term “reaction” or “reactionary” today is, therefore, strictly due to its polemical use by Marxist ideologues. Outside of politics, the term has a positive connotation in many uses. In particular, the antigen-antibody reaction “is the fundamental reaction in the body by which the body is protected from complex foreign molecules, such as pathogens and their chemical toxins.”<a class=\"see-footnote\" id=\"footnoteref14_bgf2rxg\" title=\"Wikipedia, s.v. “Antigen-Antibody Interaction,\" last mdified March 14, 2022, 15:33, https://en.wikipedia.org/wiki/Antigen-antibody_interaction#:~:text=Antigen%2Dantibody%20interaction%2C%20or%20antigen,by%20a%20process%20called%20agglutination. Also see J.A. Spiers, “\"Goldberg's Theory of Antigen-Antibody Reactions in Vitro,” Immunology 1, no. 2 (April 1958): 89–102.\" href=\"#footnote14_bgf2rxg\">14</a> In other words, the human immune system is reactionary. It <em>reacts </em>against and annihilates invaders and restores the human body to it healthy <em>status quo ante</em>. To be a politico-economic reactionary, then, is to seek to undo the ravages of our economic, social, and cultural institutions perpetrated by progressive policies; to turn back the clock by ousting the invaders from their positions of power and restoring the social body back to health.</p>\n<p>Rothbard perceptively applied his analysis of progressivism to explain the mystery of the bitter and hysterical leftist hatred of Francisco Franco and Augusto Pinochet, of Spain and Chile, respectively. The loathing of left liberals for these men was even greater than it was for Hitler. For Franco and Pinochet had thwarted the march of history, had actually turned back the clock by leading successful counterrevolutions against <em>democratically elected</em> leftist governments. Today we witness the same frenzied and unhinged vituperation by progressives heaped upon Donald Trump, Viktor Orban of Hungary, Jair Bolsonaro of Brazil, and Giorgia Meloni of Italy because these men and this woman have committed an even graver sin against the progressive creed than Franco and Pinochet did. They have actually taken power in democratic elections while using explicitly antiprogressive, reactionary rhetoric. thereby exposing the myth that democracy is the guarantor of inevitable social progress toward an egalitarian socialist state. How deeply these elections shook up and disoriented progressives is demonstrated in the crazed tweet by Swedish economist Anders Åslund well in advance of the Hungarian election: “If Hungary really <em>votes overwhelmingly against democracy</em> and for corruption I cannot see why it should be accepted in the EU”<a class=\"see-footnote\" id=\"footnoteref15_no6kep7\" title=\"Anders Åslund (@anders_aslund), “If Hungary really votes overwhelmingly against democracy and for corruption I cannot see why it should be accepted in the EU. Kick it out!,” Twitter, April 3, 2022, 4:25 p.m. https://twitter.com/anders_aslund/status/1510730232273195009.\" href=\"#footnote15_no6kep7\">15</a> (emphasis added). Slightly less idiotic but more revealing is the resolution passed recently by the august European Parliament asserting that Hungary is no longer a full democracy but “a hybrid regime of electoral autocracy.”<a class=\"see-footnote\" id=\"footnoteref16_641olxt\" title=\"Jorge Liboreiro and Sandor Zsiros, “Hungary Is No Longer A Full Democracy but an ‘Electoral Autocracy,’ MEPs Declare In New Report,” euronews, September 16, 2022, https://www.euronews.com/my-europe/2022/09/15/hungary-is-no-longer-a-full-democracy-but-an-electoral-autocracy-meps-declare-in-new-repor.\" href=\"#footnote16_641olxt\">16</a> Rothbard was thus right on the money in his evaluation of the progressives response to the successful political reactions led by Franco and Pinochet: “Let reaction occur, let the phases be rolled back, and these people flip out, go into orbit, for then maybe their religion is a false one after all.”<a class=\"see-footnote\" id=\"footnoteref17_pr6t101\" title=\"Rothbard, “Liberal Hysteria,” p. 339.\" href=\"#footnote17_pr6t101\">17</a></p>\n<p>Whether or not the current populist politicians in the US and Europe believe their own rhetoric and are genuine reactionaries is beside the point. Their ascension to power in democratic elections despite the endless stream of ridicule, hatred, and contempt spewed at them by the Western political, media, and academic elites demonstrates that a genuine reaction would be possible with the right leader. As Rothbard recognized, a reactionary movement requires “a charismatic leader who has the ability to short-circuit the media elites, and to reach and rouse the masses directly.”<a class=\"see-footnote\" id=\"footnoteref18_phyzwwu\" title=\"Rothbard, “A Strategy for the Right,” p. 11.\" href=\"#footnote18_phyzwwu\">18</a></p>\n<p>In a piece written in 1954 but published posthumously in 2002, Rothbard explained that to be effective., the leader of a dissident political movement must be a “demagogue.” He or she must</p>\n<blockquote><p>appeal to the masses over the heads of the State and its intellectual bodyguard. And this appeal can be made most effectively by the demagogue—the rough, unpolished man of the people, who can present the truth in simple, effective, yet emotional, language. The intellectuals see this clearly, and this is why they constantly attack every indication of libertarian demagoguery as part of a “rising tide of anti-intellectualism.”<a class=\"see-footnote\" id=\"footnoteref19_h3uciwp\" title=\"Murray N. Rothbard, “In Defense of Demagogues,” Mises Daily, April 23, 2002, https://mises.org/library/defense-demagogues.\" href=\"#footnote19_h3uciwp\">19</a></p></blockquote>\n<p>In defending demagogy as a political method, Rothbard, of course, understood that it could be used by the Left or the Right. Nevertheless, as he foretold in 1954, since socialism has become the “fashionable and respectable ideology … [any] demagogy, any disruption of the apple cart, would almost certainly come from the individualist opposition.” The Left instinctively know this, which is why “The respectable statist Left … fears and hates the demagogue, and more than ever before, he is the object of attack.”<a class=\"see-footnote\" id=\"footnoteref20_t8olrqn\" title=\"Ibid.\" href=\"#footnote20_t8olrqn\">20</a></p>\n<h4><strong>Redefining Politics as Warfare</strong></h4>\n<p>After reconstructing the political spectrum to reflect the realities of the post-Communist world, Rothbard laid out the political strategy that reactionaries need to employ to roll back progressivism. He pointed out that reactionaries and progressives are both minorities and in polar opposition to one another. Between them are the majority of Americans who are confused and “torn between conflicting worldviews.” They constitute what Rothbard, following Vladimir Lenin, called “the Swamp,” the terrain over which ideological battles are fought. </p>\n<p>Rothbard pithily sums up the problem facing the rightist opposition to the progressive power grab:</p>\n<blockquote><p>The problem is that the bad guys, the ruling classes, have gathered unto themselves the intellectual and media elites, who are able to bamboozle the masses into consenting to their rule, to indoctrinate them, as the Marxists would say, with “false consciousness.”<a class=\"see-footnote\" id=\"footnoteref21_mloplu5\" title=\"Rothbard, “A Strategy for the Right,” p. 9\" href=\"#footnote21_mloplu5\">21</a></p></blockquote>\n<p> This state of affairs exists because, since the beginning of the twentieth century progressive and corporate liberal politicians and their business and financial cronies have induced increasing numbers of intellectuals to apologize for and legitimize their rule in exchange for subsidies from the Federal government or lucrative positions in its ever expanding regulatory, welfare, and warfare agencies and bureaus. What Rothbard calls a “monopoly of the opinion molding function” in society has thus been granted to a privileged and coddled class that today consists of “a swarm of intellectuals, academics, social scientists, technocrats, policy scientists, social workers, journalists and the media generally.”<a class=\"see-footnote\" id=\"footnoteref22_gg16nkq\" title=\"Ibid.\" href=\"#footnote22_gg16nkq\">22</a></p>\n<p>So, what is to be done to break this formidable monopoly and destroy the “unholy alliance” of the political establishment and its privileged intellectual apologists? Rothbard recommended “a strategy of boldness and confrontation, of dynamism and excitement, a strategy, in short, of rousing the masses from their slumber, and exposing the arrogant elites that are ruling them, controlling them, taxing them and ripping them off.”<a class=\"see-footnote\" id=\"footnoteref23_n0f6kll\" title=\"Ibid., p. 10.\" href=\"#footnote23_n0f6kll\">23</a> For a rousing right-wing populism of this sort is precisely what the ruling elites fear. They prefer a judicious, bipartisan discussion of the “issues,” in measured and solemn tones and without acrimony. Progressive politicians especially fear and warn against the so-called politics of resentment—precisely because the resentment would be aimed at them by those whom they exploit. In contrast, Rothbard counsels rightists to return to the fiercely ideological, and highly partisan politics of nineteenth-century America which was marked by bitter and personal resentment of the opposition party and its members.</p>\n<p> Not only must the strategy of the right be confrontational according to Rothbard, it also “must fuse the abstract and the concrete: must not only attack the elites in the abstract, but must focus on the existing statist system, on those who right now constitute the ruling classes.” This means, above all, that the rightist strategy must be personal, must aim at exposing the lies, corruption and scandals of specific members of the ruling coalition. Thus, Rothbard wrote of the anti-Clinton movement that rapidly coalesced during Clinton’s first term as president:</p>\n<blockquote><p>The movement erupted in reaction to all the objectively loathsome attributes of the Clintons and their associates—the stream of lies, evasions, crookery, sex scandals, and frantic attempts to run all of our lives. But quickly the hatred of the personal attributes of Clinton spilled over to his program, to his ideology. Thus we had the most powerful “nuclear fusion” in all of politics: the intense blending of the personal and ideological. The growing realization of the socialist tyranny involved in all of Clinton’s programs … joined with and greatly multiplied by the loathing for Clinton the man.<a class=\"see-footnote\" id=\"footnoteref24_58n64q0\" title=\"Rothbard, “A New Strategy for Liberty,” p. 36.\" href=\"#footnote24_58n64q0\">24</a></p></blockquote>\n<p>The final part of the Rothbardian strategy is, thus, to get those on the right to grasp a simple insight—long ago assimilated by the left—that politics is war. That is, in domestic politics no less than in interstate military conflict, in the words of the great German political theorist Carl Schmitt, “the adversary intends to negate his opponent’s way of life and therefore must be repulsed or fought in order to preserve one’s own form of existence.”<a class=\"see-footnote\" id=\"footnoteref25_470q27g\" title=\"Carl Schmitt, The Concept of the Political, trans. George Schwab (Chicago: University of Chicago Press, 2007), p. 27.\" href=\"#footnote25_470q27g\">25</a> Furthermore, politics inherently involves what Schmitt calls “enmity” or the distinction between “friend and enemy,” concepts “to be understood in their concrete and existential sense, not as metaphors or symbols.”<a class=\"see-footnote\" id=\"footnoteref26_afdm9sw\" title=\"Ibid., pp. 27, 33.\" href=\"#footnote26_afdm9sw\">26</a> For, to quote Schmitt again: “War follows from enmity. War is the existential negation of the enemy.”<a class=\"see-footnote\" id=\"footnoteref27_cy8i80i\" title=\"Ibid., p. 33.\" href=\"#footnote27_cy8i80i\">27</a> Although Schmitt focuses almost exclusively on interstate conflict, he emphasizes the “ever present possibility of conflict … of combat … the real possibility of physical killing” as an essential attribute of the political, whether in the context of “domestic [or] foreign friend-and-enemy groupings.”<a class=\"see-footnote\" id=\"footnoteref28_jddezks\" title=\"Ibid., pp. 32–33.\" href=\"#footnote28_jddezks\">28</a> From the Rothbardian perspective, the conflict in domestic politics is certainly war in the existential sense. The ruling elites by virtue of their control of the State apparatus not only threaten physical violence and even death against the ruled for failure to submit to their taxes and edicts, they also actually practice violence and killing against dissenters or “insurrectionists” among the ruled.</p>\n<h4><strong>Conclusion</strong></h4>\n<p>Rothbard recognized that any serious political challenge to progressives by a united and self-conscious fusionist-rightist movement would be a war—and a religious war at that. I will conclude by quoting at some length a rousing clarion call to arms to the Right by Rothbard:</p>\n<blockquote><p>We are engaged, in the deepest sense … in a “religious war” and not just a cultural one, religious because left-liberalism/social democracy is a passionately held worldview, religion in the deepest sense, held on faith: the view that the inevitable goal of history is a perfect world, an egalitarian socialist world, a Kingdom of God on Earth…. It is a religious worldview toward which there must be no quarter; it must be opposed and combated with every fiber of our being…. And the metaphor is properly military. The looming struggle is far wider and deeper than over indexing capital gains. It is a life-and-death struggle for our very souls, and for the future of America…. The war for reaction will require above all courage, the guts not to buckle at the all-to-predictable smear response of the media, the pollsters, and all the rest…. And above all we need what the left fears above all: An adherence to the military metaphor, to the concept of us vs. them, good guys vs. bad guys, to Taking America Back. We must aim, not only for rolling it all back, not only for saving us from the Leviathan State and nihilist culture, and not only for restoring the Old Republic. For eventually we must drive the wooden stake through the heart of the Enemy, to kill once and for all the monstrous dream of the Perfect Socialized World.<a class=\"see-footnote\" id=\"footnoteref29_u2n4af2\" title=\"Rothbard, “Liberal Hysteria,” pp. 340–41.\" href=\"#footnote29_u2n4af2\">29</a></p></blockquote>\n<p>The lesson for libertarians is that there are only two sides in the current political struggle. There is no middle ground. You are either a progressive or a reactionary. You either join, or acquiesce in, the forced march into socialism or you join the reaction—the fight to turn back the progressive clock or, better yet, to smash it to smithereens.</p>\n\n<ul class=\"footnotes\"><li class=\"footnote\" id=\"footnote1_2ry4kgn\"><a class=\"footnote-label\" href=\"#footnoteref1_2ry4kgn\">1.</a> Murray N. Rothbard, “A New Strategy for Liberty,” October 1994, in <em>The Irrepressible Rothbard</em>: The Rothbard-Rockwell Report Essays of Murray N Rothbard, ed. Llewellyn H. Rockwell, Jr. (Burlingame, CA: Center for Libertarian Studies, 2000), p. 35.</li>\n<li class=\"footnote\" id=\"footnote2_ms6wzdi\"><a class=\"footnote-label\" href=\"#footnoteref2_ms6wzdi\">2.</a> Murray N. Rothbard, “Frank Meyer and Sidney Hook,” January 1991, in <em>The Irrepressible Rothbard</em>, p. 23.</li>\n<li class=\"footnote\" id=\"footnote3_8ateqm1\"><a class=\"footnote-label\" href=\"#footnoteref3_8ateqm1\">3.</a> Ibid., p. 23.</li>\n<li class=\"footnote\" id=\"footnote4_2rakf1m\"><a class=\"footnote-label\" href=\"#footnoteref4_2rakf1m\">4.</a> Murray N. Rothbard, “A Strategy for the Right,” January 1992, in <em>The Irrepressible Rothbard</em>, p. 19.</li>\n<li class=\"footnote\" id=\"footnote5_m0xrmo3\"><a class=\"footnote-label\" href=\"#footnoteref5_m0xrmo3\">5.</a> Rothbard, “Frank Meyer and Sidney Hook,” p. 23.</li>\n<li class=\"footnote\" id=\"footnote6_qe8r3zs\"><a class=\"footnote-label\" href=\"#footnoteref6_qe8r3zs\">6.</a> Murray N. Rothbard, “The November Revolution … and What to Do about It,” November 1994, in Murray N. Rothbard, <em>Making Economic Sense</em> (Auburn AL: Ludwig von Mises Institute, 1995), p. 398.</li>\n<li class=\"footnote\" id=\"footnote7_netowng\"><a class=\"footnote-label\" href=\"#footnoteref7_netowng\">7.</a> Rothbard, “Frank Meyer and Sidney Hook,” p. 25.</li>\n<li class=\"footnote\" id=\"footnote8_scs883j\"><a class=\"footnote-label\" href=\"#footnoteref8_scs883j\">8.</a> Murray N. Rothbard, “Liberal Hysteria: The Mystery Explained,” October 1992, in <em>The Irrepressible Rothbard</em>, p. 338.</li>\n<li class=\"footnote\" id=\"footnote9_7zwjiob\"><a class=\"footnote-label\" href=\"#footnoteref9_7zwjiob\">9.</a> Ibid.</li>\n<li class=\"footnote\" id=\"footnote10_0351xgy\"><a class=\"footnote-label\" href=\"#footnoteref10_0351xgy\">10.</a> Rothbard, “The November Revolution,” p. 411.</li>\n<li class=\"footnote\" id=\"footnote11_x27elma\"><a class=\"footnote-label\" href=\"#footnoteref11_x27elma\">11.</a> Rothbard, “A Strategy for the Right,” 12.</li>\n<li class=\"footnote\" id=\"footnote12_2hpd2sy\"><a class=\"footnote-label\" href=\"#footnoteref12_2hpd2sy\">12.</a> Rothbard, “A New Strategy for Liberty,” p. 32; Rothbard, Rothbard, “Liberal Hysteria,” pp. 339–40.</li>\n<li class=\"footnote\" id=\"footnote13_3bjkbdh\"><a class=\"footnote-label\" href=\"#footnoteref13_3bjkbdh\">13.</a> Rothbard, “Liberal Hysteria,” p. 339.</li>\n<li class=\"footnote\" id=\"footnote14_bgf2rxg\"><a class=\"footnote-label\" href=\"#footnoteref14_bgf2rxg\">14.</a> Wikipedia, s.v. “Antigen-Antibody Interaction,\" last mdified March 14, 2022, 15:33, <a href=\"https://en.wikipedia.org/wiki/Antigen-antibody_interaction#:~:text=Antigen%2Dantibody%20interaction%2C%20or%20antigen,by%20a%20process%20called%20agglutination\">https://en.wikipedia.org/wiki/Antigen-antibody_interaction#:~:text=Antigen%2Dantibody%20interaction%2C%20or%20antigen,by%20a%20process%20called%20agglutination</a>. Also see J.A. Spiers, “<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1423897\">\"Goldberg's Theory of Antigen-Antibody Reactions <em>in Vitro</em>,</a>” <em>Immunology</em> 1, no. 2 (April 1958): 89–102.</li>\n<li class=\"footnote\" id=\"footnote15_no6kep7\"><a class=\"footnote-label\" href=\"#footnoteref15_no6kep7\">15.</a> Anders Åslund (@anders_aslund), “If Hungary really votes overwhelmingly against democracy and for corruption I cannot see why it should be accepted in the EU. Kick it out!,” <em>Twitter</em>, April 3, 2022, 4:25 p.m. <a href=\"https://twitter.com/anders_aslund/status/1510730232273195009\">https://twitter.com/anders_aslund/status/1510730232273195009</a>.</li>\n<li class=\"footnote\" id=\"footnote16_641olxt\"><a class=\"footnote-label\" href=\"#footnoteref16_641olxt\">16.</a> Jorge Liboreiro and Sandor Zsiros, “Hungary Is No Longer A Full Democracy but an ‘Electoral Autocracy,’ MEPs Declare In New Report,” <em>euronews</em>, September 16, 2022, <a href=\"https://www.euronews.com/my-europe/2022/09/15/hungary-is-no-longer-a-full-democracy-but-an-electoral-autocracy-meps-declare-in-new-repor\">https://www.euronews.com/my-europe/2022/09/15/hungary-is-no-longer-a-full-democracy-but-an-electoral-autocracy-meps-declare-in-new-repor</a>.</li>\n<li class=\"footnote\" id=\"footnote17_pr6t101\"><a class=\"footnote-label\" href=\"#footnoteref17_pr6t101\">17.</a> Rothbard, “Liberal Hysteria,” p. 339.</li>\n<li class=\"footnote\" id=\"footnote18_phyzwwu\"><a class=\"footnote-label\" href=\"#footnoteref18_phyzwwu\">18.</a> Rothbard, “A Strategy for the Right,” p. 11.</li>\n<li class=\"footnote\" id=\"footnote19_h3uciwp\"><a class=\"footnote-label\" href=\"#footnoteref19_h3uciwp\">19.</a> Murray N. Rothbard, “In Defense of Demagogues,” <em>Mises Daily</em>, April 23, 2002, <a href=\"https://mises.org/library/defense-demagogues\">https://mises.org/library/defense-demagogues</a>.</li>\n<li class=\"footnote\" id=\"footnote20_t8olrqn\"><a class=\"footnote-label\" href=\"#footnoteref20_t8olrqn\">20.</a> Ibid.</li>\n<li class=\"footnote\" id=\"footnote21_mloplu5\"><a class=\"footnote-label\" href=\"#footnoteref21_mloplu5\">21.</a> Rothbard, “A Strategy for the Right,” p. 9</li>\n<li class=\"footnote\" id=\"footnote22_gg16nkq\"><a class=\"footnote-label\" href=\"#footnoteref22_gg16nkq\">22.</a> Ibid.</li>\n<li class=\"footnote\" id=\"footnote23_n0f6kll\"><a class=\"footnote-label\" href=\"#footnoteref23_n0f6kll\">23.</a> Ibid., p. 10.</li>\n<li class=\"footnote\" id=\"footnote24_58n64q0\"><a class=\"footnote-label\" href=\"#footnoteref24_58n64q0\">24.</a> Rothbard, “A New Strategy for Liberty,” p. 36.</li>\n<li class=\"footnote\" id=\"footnote25_470q27g\"><a class=\"footnote-label\" href=\"#footnoteref25_470q27g\">25.</a> Carl Schmitt, <em>The Concept of the Political</em>, trans. George Schwab (Chicago: University of Chicago Press, 2007), p. 27.</li>\n<li class=\"footnote\" id=\"footnote26_afdm9sw\"><a class=\"footnote-label\" href=\"#footnoteref26_afdm9sw\">26.</a> Ibid., pp. 27, 33.</li>\n<li class=\"footnote\" id=\"footnote27_cy8i80i\"><a class=\"footnote-label\" href=\"#footnoteref27_cy8i80i\">27.</a> Ibid., p. 33.</li>\n<li class=\"footnote\" id=\"footnote28_jddezks\"><a class=\"footnote-label\" href=\"#footnoteref28_jddezks\">28.</a> Ibid., pp. 32–33.</li>\n<li class=\"footnote\" id=\"footnote29_u2n4af2\"><a class=\"footnote-label\" href=\"#footnoteref29_u2n4af2\">29.</a> Rothbard, “Liberal Hysteria,” pp. 340–41.</li>\n</ul>\n",
  "author": "Joseph T. Salerno",
  "enclosure": "",
  "guid": 60823,
  "pubDate": "Thu, 03 Nov 2022 09:00:00 -0500",
  "source": "Mises Wire"
}