{
  "author": {
    "name": "Thomas Eisenbach and Gregory Phelan"
  },
  "title": "How Can Safe Asset Markets Be Fragile?",
  "link": "",
  "id": "https://libertystreeteconomics.newyorkfed.org/?p=17958",
  "updated": "2022-09-08T11:27:56Z",
  "published": "2022-09-08T11:00:00Z",
  "category": [
    "",
    "",
    "",
    ""
  ],
  "summary": "The market for U.S. Treasury securities experienced extreme stress in March 2020, when prices dropped precipitously (yields spiked) over a period of about two weeks. This was highly unusual, as Treasury prices typically increase during times of stress. Using a theoretical model, we show that markets for safe assets can be fragile due to strategic interactions among investors who hold Treasury securities for their liquidity characteristics. Worried about having to sell at potentially worse prices in the future, such investors may sell preemptively, leading to self-fulfilling “market runs” that are similar to traditional bank runs in some respects.",
  "content": "<p class=\"ts-blog-article-author\">Thomas Eisenbach and Gregory Phelan</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"920\" height=\"576\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_safe-asset_eisenbach_460-1.jpg?w=460\" alt=\"\" class=\"wp-image-17989\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_safe-asset_eisenbach_460-1.jpg 920w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_safe-asset_eisenbach_460-1.jpg?resize=460,288 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_safe-asset_eisenbach_460-1.jpg?resize=768,481 768w\" sizes=\"(max-width: 920px) 100vw, 920px\" /></figure>\n\n\n<p>The market for U.S. Treasury securities experienced extreme stress in March 2020, when prices dropped precipitously (yields spiked) over a period of about two weeks. This was highly unusual, as Treasury prices typically increase during times of stress. Using a theoretical model, we show that markets for safe assets can be fragile due to strategic interactions among investors who hold Treasury securities for their liquidity characteristics. Worried about having to sell at potentially worse prices in the future, such investors may sell preemptively, leading to self-fulfilling “market runs” that are similar to traditional bank runs in some respects.</p>\n\n\n\n<h4><strong>Price Crash with Constrained Dealer Balance Sheets and Unprecedented Sales</strong></h4>\n\n\n\n<p>The unusual events in Treasury markets in March 2020 have been discussed extensively in <a href=\"https://libertystreeteconomics.newyorkfed.org/2020/04/treasury-market-liquidity-during-the-covid-19-crisis/\">previous</a> <a href=\"https://libertystreeteconomics.newyorkfed.org/2020/05/treasury-market-liquidity-and-the-federal-reserve-during-the-covid-19-pandemic/\">posts</a>. We want to draw attention to a confluence of two elements: First, the dealer banks that provide Treasury market liquidity faced mounting challenges to their intermediation capacity. The chart below shows that dealer balance sheet space allocated to Treasury securities increased both during the run-up in Treasury prices and their subsequent crash. The recovery in Treasury prices after March 18 coincided with dealer balance sheet pressure receding as the Federal Reserve&#8217;s Treasury purchases ramped up.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Dealers Were Constrained through the Run-up and Crash of Treasury Prices</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_safe-asset_eisenbach_ch1.jpg?w=446\" alt=\"Line chart showing the market yield on U.S. Treasury securities at 10-year constant maturity (reverse scale), Federal Reserve outright holdings of Treasury notes and bonds (nominal and TIPS), and Primary Dealers’ net position and reverse repo in Treasuries (nominal and TIPS) between February 1 and May 1, 2020, in trillions of dollars. \" class=\"wp-image-17964\" width=\"458\" height=\"296\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_safe-asset_eisenbach_ch1.jpg 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_safe-asset_eisenbach_ch1.jpg?resize=460,297 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_safe-asset_eisenbach_ch1.jpg?resize=768,496 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_safe-asset_eisenbach_ch1.jpg?resize=446,288 446w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_safe-asset_eisenbach_ch1.jpg?resize=1536,992 1536w\" sizes=\"(max-width: 458px) 100vw, 458px\" /><figcaption>Sources: FRED, Federal Reserve Bank of St. Louis; New York Fed Primary Dealer Survey.<br>Notes: The chart shows the market yield on U.S. Treasury securities at 10-year constant maturity (reverse scale), Federal Reserve outright holdings of Treasury notes and bonds (nominal and TIPS), and Primary Dealers’ net position and reverse repo in Treasury securities (nominal and TIPS).</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p>Second, the behavior of foreign investors and mutual funds, the main sellers of Treasury securities in March 2020, was very unusual. The next chart shows the net purchases of the two groups over time and highlights that their sales in the first quarter of 2020 were unprecedented—much larger than ever before.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Unprecedented Sales that Appear Precautionary</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_safe-asset_eisenbach_ch2.jpg?w=460\" alt=\"A two-panel bar chart showing net purchases of all types of Treasuries in billions of dollars by foreign investors (left chart) and mutual funds (right chart) over time. Both sectors saw unprecedented Treasury sales in Q1 2020—much larger than ever before.\" class=\"wp-image-17966\" width=\"459\" height=\"244\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_safe-asset_eisenbach_ch2.jpg 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_safe-asset_eisenbach_ch2.jpg?resize=460,246 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_safe-asset_eisenbach_ch2.jpg?resize=768,410 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_safe-asset_eisenbach_ch2.jpg?resize=1536,821 1536w\" sizes=\"(max-width: 459px) 100vw, 459px\" /><figcaption>Source: Board of Governors of the Federal Reserve System, Financial Accounts of the United States, Table FU.210.<br>Note: The chart shows net purchases of Treasury securities (all types) for the two sectors with the largest sales in 2020:Q1. “Foreign investors” refers to the “rest of the world” sector in the original table.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p><a href=\"https://doi.org/10.1016/j.jmoneco.2021.10.007\">Vissing-Jorgensen (2021)</a> shows evidence that both groups’ sales of Treasury securities exceeded their actual liquidity needs. The unprecedented magnitude of the sales, and the fact that a considerable fraction of them were precautionary, makes this behavior appear very similar to a run—reminiscent of depositors rushing to withdraw funds from a bank. Consistent with this evidence, the <a href=\"https://home.treasury.gov/system/files/136/IAWG-Treasury-Report.pdf\">Inter-Agency Working Group for Treasury Market Surveillance (2021)</a> reports that “some Treasury holders appeared to react to the decline in market liquidity by selling securities for precautionary reasons lest conditions worsen further, and these sales only added to the stress on the market.”</p>\n\n\n\n<h4><strong>Strategic Interaction among Treasury Investors Can Lead to Fragility</strong></h4>\n\n\n\n<p>In a recent <a href=\"https://ssrn.com/abstract=4164189\">Staff Report</a>, we study theoretically how strategic interaction among investors can make markets fragile and lead to “market runs.” We explicitly consider the possibility that different investors value safe assets such as Treasury securities for <a href=\"https://libertystreeteconomics.newyorkfed.org/2017/11/what-makes-a-safe-asset-safe.html\">different reasons</a>. First and foremost, safe assets are safe, meaning they are expected to pay their full par value at maturity with near total certainty. As a result, we typically observe “flight to safety” during times of stress, in which demand for safe assets increases, pushing up their price. Second, safe assets are liquid, and so some investors hold safe assets to sell them when faced with sudden liquidity needs. During times of stress, investors&#8217; liquidity needs can increase, competing with the usual “flight to safety” and exerting downward pressure on the price of safe assets when they make a “dash for cash.”</p>\n\n\n\n<p>Our model, which builds on <a href=\"https://doi.org/10.1162/003355304772839542\">Bernardo and Welch (2004)</a>, shows that a safe asset market is stable and well-functioning as long as the market is sufficiently deep. In this case, flight to safety and dash for cash are complementary phenomena, with investors who buy the assets for safety absorbing sales from investors who sell the assets for liquidity. However, in our model, the market can break down if trade involves dealers that are subject to balance sheet constraints. The risk of market break-down can be self-fulfilling, as it leads investors without pressing liquidity needs to sell preemptively in order to avoid the possibility of having to sell at lower prices in the future.</p>\n\n\n\n<p>Individual investors may prefer selling preemptively today if they expect conditions to deteriorate sufficiently tomorrow. Aggregate sales today have a direct effect on the price today, but they also have an indirect effect on the price tomorrow, through their effects on dealer balance sheets. If this balance sheet effect is sufficiently strong, an individual investor&#8217;s incentive to sell preemptively can be higher if many other investors also sell preemptively. When others are selling today, an investor would rather sell today than wait and risk having to sell tomorrow, by which time dealers may be over-loaded with inventory, resulting in much lower prices.</p>\n\n\n\n<h4><strong>Flight to Safety Can Trigger a Dash for Cash</strong></h4>\n\n\n\n<p>Surprisingly, we show that flight to safety episodes can exacerbate the dash for cash when markets are fragile. Demand by flight-to-safety investors early on in a stress episode increases prices both contemporaneously and, by relaxing dealer balance sheets, in the future. If the strategic concerns of liquidity investors are sufficiently strong, then additional demand from safety-first investors today can induce liquidity investors to sell today, precisely because the market today has a relatively higher capacity to absorb sales. Then, a flight to safety actually triggers a dash for cash, amplifying existing market fragility.</p>\n\n\n\n<h4><strong>How Was March 2020 Different from September 2008?</strong></h4>\n\n\n\n<p>The events of March 2020 make a striking contrast to the nadir of the great financial crisis in September 2008, when Treasury markets did not suffer from dysfunction and illiquidity. Our model helps to understand the differences between these two episodes. First, our model highlights the central role of dealer balance sheet constraints that may in part be a result of post-crisis regulations. Second, the liquidity needs during the COVID-19 crisis appear to have been much larger—for example, because of the disruptions from lockdowns globally. Our model therefore suggests that in March 2020, the combination of unprecedented liquidity needs and considerably more constrained dealers tilted the Treasury market into a fragile region where investors sell strategically, and flight to safety precipitates a dash for cash.</p>\n\n\n\n<h4><strong>Lessons for the Future</strong></h4>\n\n\n\n<p>Fragility in our model hinges on the intertemporal considerations of strategic liquidity investors who compare prices today to prices tomorrow. In general, there is scope for policy interventions that increase prices both in the present and in the future. However, the timing of policy interventions is important, and announcements can have large effects well before the interventions are executed. We show that an asset purchase facility can have a large effect upon announcement by shifting strategic investors from the “run” equilibrium to the “hold” equilibrium, even if the facility does not become active until a future date. Similarly, policy interventions that relax dealer balance sheet constraints can be stabilizing so long as they relax balance sheet constraints in the future as well.</p>\n\n\n\n<p>Finally, our model shows that markets where trading occurs in a decentralized, sequential way and where dealers play a large role in intermediating flows are inherently fragile. Changes to market structure whereby trades are pooled to reduce the role of dealers can therefore reduce the fragility of safe asset markets. <a href=\"https://www.brookings.edu/research/still-the-worlds-safe-haven/\">Duffie (2020)</a> argues that the growth of the Treasury market since 2008 has greatly outpaced the capacity of dealer balance sheets to absorb the additional supply and that this trend is expected to continue. The strategic mechanism in our model is therefore likely to become increasingly relevant, suggesting that—absent policy interventions—episodes such as March 2020 may become more frequent.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<div class=\"wp-block-media-text alignwide\" style=\"grid-template-columns:15% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"90\" height=\"90\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2021/10/eisenbach_thomas-1.jpg?w=90\" alt=\"Photo of Thomas Eisenbach\" class=\"wp-image-12504 size-full\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2021/10/eisenbach_thomas-1.jpg 90w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2021/10/eisenbach_thomas-1.jpg?resize=45,45 45w\" sizes=\"(max-width: 90px) 100vw, 90px\" /></figure><div class=\"wp-block-media-text__content\">\n<p class=\"is-style-bio-contact has-large-font-size\"><a rel=\"noreferrer noopener\" href=\"https://www.newyorkfed.org/research/economists/eisenbach\" target=\"_blank\">Thomas M. Eisenbach</a> is a financial research advisor in Money and Payments Studies in the Federal Reserve Bank of New York’s Research and Statistics Group.</p>\n</div></div>\n\n\n\n<div style=\"height:12px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-bio-contact\">Gregory Phelan is an associate professor of economics at&nbsp;Williams College, currently working as a senior researcher in the&nbsp;U.S. Treasury&#8217;s Office of Financial Research.&nbsp;</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-disclaimer\">\n    <strong>How to cite this post:</strong><br/>\n    Thomas Eisenbach and Gregory Phelan, &#8220;How Can Safe Asset Markets Be Fragile?,&#8221; Federal Reserve Bank of New York <em>Liberty Street Economics</em>, September 8, 2022, https://libertystreeteconomics.newyorkfed.org/2022/09/how-can-safe-asset-markets-be-fragile/.</p>\n</p>\n\n\n\n<p class=\"is-style-related-reading\"><strong>Related reading:</strong><br><a href=\"https://libertystreeteconomics.newyorkfed.org/2022/07/the-bond-market-selloff-in-historical-perspective/\">The Bond Market Selloff in Historical Perspective</a> (July 2022)<br><a href=\"https://libertystreeteconomics.newyorkfed.org/2022/07/the-global-dash-for-cash-in-march-2020/\">The Global Dash for Cash in March 2020</a> (July 2022)<br><a href=\"https://libertystreeteconomics.newyorkfed.org/2022/06/what-is-corporate-bond-market-distress/\">What Is Corporate Bond Market Distress?</a> (June 2022)</p>\n\n\n\n<div>\n<div style=\"height:24px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<hr class=\"wp-block-separator has-css-opacity\"/>\n\n\n\n<p class=\"is-style-disclaimer\"><strong>Disclaimer</strong><br>The views expressed in this post are those of the author(s) and do not necessarily reflect the position of the Federal Reserve Bank of New York or the Federal Reserve System. Any errors or omissions are the responsibility of the author(s).</p>\n</div>\n"
}