{
  "title": "4: Episode 4",
  "link": "https://audioboom.com/posts/7316360",
  "itunes:episode": 4,
  "itunes:title": "Episode 4",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3081,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On our August 28, 2005 edition of MuggleCast…<br>\n<br>\n\n</div>\n<div>While there is debate on whether Ralph Fiennes will make a convincing Lord Voldemort, there is no doubt that the special effects in Goblet of Fire are up to par. Just check out the film’s recently released official trailer. And why did Snape’s Killing Curse send Dumbledore sailing through the sky? It’s because he had Air Jordans on, of course. Plus, we’ve got Horcruxed hats, Inheritance interviews, a crazy contest, and a brand-new news segment. Even Yoda stops by. This was one wild show.<br>\n<br>\n\n</div>\n<div>From a Brit attempting an American accent to an American attempting a British accent…all that and more ahead with Andrew, Eric, Ben, Eric, Jamie, and Eric on this edition of MuggleCast.<br>\n<br>\n\n</div>\n<ul>\n<li>We announce our Voldemort 101 contest</li>\n<li>Is Ralph Fiennes a good choice for GOF?</li>\n<li>How will all the visual effects effect the film?</li>\n<li>Jamie tries on an American accent</li>\n<li>Yoda makes a surprise appearance on the show and asks, “RAB is who? Clever you are!”</li>\n<li>Does Snape perform an authentic Killing Curse in HBP?</li>\n<li>Possible Horcrux: the Sorting Hat?</li>\n<li>Snape must’ve put quite a mighty spell on Dumbledore…what happened?</li>\n<li>Andrew talks with Mike from <a href=\"http://www.shurtugal.com/\">Shurtugal.com</a> about the new <em>Eldest</em> book</li>\n<li>Ben puts in yet another shameful promotion for Galadriel Water’s <a href=\"http://www.mugglenet.com/newclues.shtml\">HP Super Sleuth books</a>\n</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Sun, 28 Aug 2005 00:00:00 +0000",
  "guid": "tag:audioboom.com,2019-07-15:/posts/7316360",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}