{
  "title": "17: Writer Jeff Goins on the Art of Work- a Proven Path to Discovering What You Were Meant to Do",
  "pubDate": "Thu, 09 Apr 2015 22:12:25 +0000",
  "guid": "b03474076be787335574439eaf005e19",
  "link": "https://traffic.libsyn.com/secure/lifeonpurpose/LifeOnPurposeJeff.mp3",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #17</strong>, I'm joined by writer, speaker, and entrepreneur <strong>Jeff Goins </strong>for a great conversation about purpose, legacy, creativity, finding your true calling, and his new book<strong> <em>Art of Work- a Proven Path to Discovering What You Were Meant to Do</em></strong>.</p>\n<p>About: <strong>Jeff Goins</strong> is a full-time writer who has authored four books, including: The In-Between, Wrecked, and You Are a Writer plus he's written and guest-blogged for more than 100 magazines, publications, and blogs including Copyblogger, Problogger, and Michael Hyatt's Blog. He's also a speaker, online writing teacher, and consultant. His website, <a href=\"http://goinswriter.com\" target=\"_blank\">Goinswriter.com</a>, has been visited by more than four million people from all over the world. He lives just outside of Nashville, Tennessee, with his wife, son, and border collie. and he humbly considers himself the world's foremost expert on guacamole.</p>\n<p>His brand new book is the <em><strong>Art of Work- a Proven Path to Discovering What You Were Meant to Do</strong></em>. Steven Pressfield, the best-selling author of the War of Wart says, \"It will make you think differently about what you do and how you do it. The author is a fresh young voice in a field full of copycats. He challenges us to approach our work the way we would a canvas—both delicately and with furious discipline.\"</p>\n<p>About the <em><strong>Art of Work</strong>: \"Abandon the status quo and live a life that matters.\" </em>The path to your life's work is both difficult and mysterious, which is why few finish the journey.<em> <strong>The Art of Work</strong></em> is about discovering your true calling—that thing you were born to do. As <strong>Jeff Goins</strong> explains, the search begins with passion but does not end there. Only when our interests connect with the needs of the world do we begin living for a larger purpose.</p>\n<p>Those who experience this intersection experience something exceptional and enviable. Though it is rare, such a life is attainable by anyone brave enough to try. Through personal experience, compelling stories, and current research on the mysteries of motivation and talent, <strong>Jeff</strong> shows readers how to find their vocation and what to expect along the way.</p>\n<p>To learn more about <strong>Jeff</strong> and his work, visit: <a href=\"http://goinswriter.com\" target=\"_blank\">http://goinswriter.com</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #17, I'm joined by writer, speaker, and entrepreneur Jeff Goins for a great conversation about purpose, legacy, creativity, finding your true calling, and his new book <em>Art of Work- a Proven Path to Discovering What You Were Meant to Do</em>.</p>\n<p>About: Jeff Goins is a full-time writer who has authored four books, including: The In-Between, Wrecked, and You Are a Writer plus he's written and guest-blogged for more than 100 magazines, publications, and blogs including Copyblogger, Problogger, and Michael Hyatt's Blog. He's also a speaker, online writing teacher, and consultant. His website, <a href=\"http://goinswriter.com\" target=\"_blank\">Goinswriter.com</a>, has been visited by more than four million people from all over the world. He lives just outside of Nashville, Tennessee, with his wife, son, and border collie. and he humbly considers himself the world's foremost expert on guacamole.</p>\n<p>His brand new book is the <em>Art of Work- a Proven Path to Discovering What You Were Meant to Do</em>. Steven Pressfield, the best-selling author of the War of Wart says, \"It will make you think differently about what you do and how you do it. The author is a fresh young voice in a field full of copycats. He challenges us to approach our work the way we would a canvas—both delicately and with furious discipline.\"</p>\n<p>About the <em>Art of Work: \"Abandon the status quo and live a life that matters.\" </em>The path to your life's work is both difficult and mysterious, which is why few finish the journey.<em> The Art of Work</em> is about discovering your true calling—that thing you were born to do. As Jeff Goins explains, the search begins with passion but does not end there. Only when our interests connect with the needs of the world do we begin living for a larger purpose.</p>\n<p>Those who experience this intersection experience something exceptional and enviable. Though it is rare, such a life is attainable by anyone brave enough to try. Through personal experience, compelling stories, and current research on the mysteries of motivation and talent, Jeff shows readers how to find their vocation and what to expect along the way.</p>\n<p>To learn more about Jeff and his work, visit: <a href=\"http://goinswriter.com\" target=\"_blank\">http://goinswriter.com</a>.</p>",
  "enclosure": "",
  "itunes:duration": "53:19",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #17, I'm joined by writer, speaker, and entrepreneur Jeff Goins for a great conversation about purpose, legacy, creativity, finding your true calling, and his new book Art of Work- a Proven Path to Discovering What You Were..."
}