{
  "title": "The Existential Terror of Battle Royale",
  "description": "<!--kg-card-begin: markdown--><p>It's been a while since I wrote a blog post, I guess in general, but also a blog post about video games. Video games are probably <a href=\"https://www.google.com/search?q=site%3Ablog.codinghorror.com+%22video+games%22\">the single thing most attributable to my career as a programmer</a>, and everything else I've done professionally after that. I</p>",
  "link": "https://blog.codinghorror.com/the-existential-terror-of-battle-royale/",
  "guid": "59fc20474dd8920022728f05",
  "dc:creator": "Jeff Atwood",
  "pubDate": "Sun, 05 Nov 2017 10:02:53 GMT",
  "content:encoded": "<!--kg-card-begin: markdown--><p>It's been a while since I wrote a blog post, I guess in general, but also a blog post about video games. Video games are probably <a href=\"https://www.google.com/search?q=site%3Ablog.codinghorror.com+%22video+games%22\">the single thing most attributable to my career as a programmer</a>, and everything else I've done professionally after that. I still feel video games are one of the best ways to learn and teach programming, <a href=\"https://blog.codinghorror.com/heres-the-programming-game-you-never-asked-for/\">if properly scoped</a>, and furthermore I take <a href=\"https://blog.codinghorror.com/level-one-the-intro-stage/\">many cues from video games in building software</a>.</p>\n<p>I would characterize my state of mind for the last six to eight months as &#x2026; <em>poor</em>. Not only because of <a href=\"https://blog.codinghorror.com/im-loyal-to-nothing-except-the-dream/\">current events in the United States</a>, though the neverending barrage of bad news weighs heavily on me, and I continue to be profoundly disturbed by the erosion of core values that I thought most of us stood for as Americans. Didn't we used to look out for each other, care about each other, and fight to protect those that can't protect themselves?</p>\n<p>In times like these, I sometimes turn to video games for escapist entertainment. One game in particular caught my attention because of its meteoric rise in player count over the last year.</p>\n<p><a href=\"http://steamcharts.com/app/578080\"><img src=\"https://blog.codinghorror.com/content/images/2017/11/pubg-steam-stats-nov-2017.png\" alt=\"pubg-steam-stats-nov-2017\" loading=\"lazy\"></a></p>\n<p>That game is <a href=\"http://store.steampowered.com/app/578080/PLAYERUNKNOWNS_BATTLEGROUNDS/\">Player Unknown's Battlegrounds</a>. I was increasingly curious why it was so popular, and kept getting more popular every month. Calling it a mere phenomenon seems like underselling it; something truly unprecedented is happening here. I finally broke down and bought a copy for $30 in September.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/11/player-unknown-battleground.jpg\" alt=\"player-unknown-battleground\" loading=\"lazy\"></p>\n<p>After a few hours in, I had major flashbacks to <a href=\"https://blog.codinghorror.com/the-gamification/\">the first time I played Counter-Strike in 1998</a>. I realized that <strong>we are witnessing the birth of an entirely new genre of game: the Battle Royale</strong>. I absolutely believe that huge numbers of people will still be playing some form of this game 20 years from now, too.</p>\n<p><a href=\"http://store.steampowered.com/stats/\"><img src=\"https://blog.codinghorror.com/content/images/2017/11/steam-top-games-by-player-count-nov-2017.png\" alt=\"steam-top-games-by-player-count-nov-2017\" loading=\"lazy\"></a></p>\n<p>I've seen <a href=\"https://en.wikipedia.org/wiki/Battle_Royale_(film)\">the Japanese movie</a>, and it's true that there were <a href=\"https://en.wikipedia.org/wiki/Battle_royale_game\">a few Battle Royale games</a> before PUBG, but this is clearly the defining moment and game for the genre, the one that sets a precedent for everyone else to follow.</p>\n<p>It's hard to explain why Battlegrounds is so compelling, but let's start with the loneliness.</p>\n<p>Although you can play in squads (and I recommend it), the purest original form of the game is 100 players, last man standing. You begin with nothing but the clothes on your back, in a cargo aircraft, flying over an unknown island in a random trajectory.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/11/battlegrounds-cargo-plane.jpg\" alt=\"battlegrounds-cargo-plane\" loading=\"lazy\"></p>\n<p>It's up to you to decide when to drop, and where to land on this huge island, full of incredibly detailed cities, buildings and houses &#x2013; but strangely devoid of all life.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/11/playerunknown-battleground-drop.jpg\" alt=\"playerunknown-battleground-drop\" loading=\"lazy\"></p>\n<p>What happened to everyone? Where did they go? The sense of apocalypse is overwhelming. It's you versus the world, but where did the rest of the world go? You'll wander this vast deserted island, scavenging for weapons and armor in near complete silence. You'll hear nothing but the wind blowing and the occasional buzzing of flies. But then, suddenly the jarring pak-pak-pak of gunfire off in the distance, reminding you that other people are here. And they aren't your friends.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/11/battle-royale-vista.jpg\" alt=\"battle-royale-vista\" loading=\"lazy\"></p>\n<p>the dread of never knowing when another of the 100 players on this enormous island is going to suddenly appear around a corner or over a hill is <em>intense</em>. You'll find yourself wearing headphones, cranking the volume, constantly on edge listening for the implied threat of footfalls. Wait, did I hear someone just now, or was that me? You clench, and wait. I've had so many visceral panic moments playing this game, to the point that I had to stop playing just to calm down.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/11/pubg-combat.jpg\" alt=\"pubg-combat\" loading=\"lazy\"></p>\n<p>PUBG is, in its way, the scariest zombie movie I've ever seen, though it lacks a single zombie. It dispenses with the pretense of a story, so you can realize much sooner that the zombies, as terrible as they may be, are nowhere as dangerous to you as your fellow man.</p>\n<p>Meanwile, that huge cargo airplane still roars overhead every so often, impassive, indifferent, occasionally dropping supply crates with high powered items to fight over. Airstrikes randomly target areas circled in red on the map, masking footfalls, and forcing movement while raining arbitrary death and terror.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/11/pubg-map.jpg\" alt=\"pubg-map\" loading=\"lazy\"></p>\n<p>Although the island is huge and you can land anywhere, after a few minutes a random circle is overlaid on the map, and a slowly moving wall of deadly energy starts closing in on that circle. Stay outside that circle at your peril; if you find yourself far on the opposite side of the map from a circle, you better start hunting for a vehicle or boat (they're present, but rare) quickly. These terrordome areas are always shrinking, always impending, in an ever narrowing cone, forcing the remaining survivors closer and closer together. The circles get tighter and deadlier and quicker as the game progresses, ratcheting up the tension and conflict.</p>\n<p>Eventually the circle becomes so small that it's impossible for the handful of remaining survivors to avoid contact, and one person, <em>one</em> out of the hundred that originally dropped out of the cargo plane, emerges as the winner. I've never won solo, but I have won squad, and even finishing first out of 25 squads is an unreal, euphoric experience. The odds are so incredibly against you from the outset, plus you quickly discover that 85% of the game is straight up chance: someone happens to roll up behind you, a sniper gets the drop on you, or you get caught in the open with few options. Wrong place, wrong time, game over. Sucks to be you.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/11/pubg-vehicle-shooting.jpg\" alt=\"pubg-vehicle-shooting\" loading=\"lazy\"></p>\n<p>You definitely learn to be careful, but there's only so careful you can be. Death comes quickly, without warning, and often at random. What else can you expect from a game mode where there are 100 players but only 1 eventual winner?</p>\n<p>There haven't been many Battle Royale games, so this game mode is a relatively new phenomenon. If you'd like to give it a try for free, <strong>I highly recommend <a href=\"https://www.epicgames.com/fortnite/\">Fortnite's Battle Royale mode</a> which is 100% free, a near-clone of PUBG, and quite good in its own right.</strong> They added their Battle Royale mode well after the fact; the core single player \"save the world\" gameplay of building stuff and fighting zombie hordes is quite fun too, though a bit shallow. It also has what is, in my opinion, some of the most outstanding visual style I've ever seen in a game &#x2013; a cool, hyperbolic cartoon mix of Chuck Jones, Sam & Max, and Cloudy with a Chance of Meatballs. It's also delightfully diverse in its character models.</p>\n<p><a href=\"https://www.epicgames.com/fortnite/\"><img src=\"https://blog.codinghorror.com/content/images/2017/11/fortnite-battle-royale.jpg\" alt=\"fortnite-battle-royale\" loading=\"lazy\"></a></p>\n<p>(The only things you'll give up over PUBG are the realistic art style, vehicles, and going prone. But the superb structure building system in Fortnite <em>almost</em> makes up for that. If nothing else it is a demonstration of how incredibly compelling the Battle Royale game mode is, because that part of the game is <a href=\"https://www.pcgamesn.com/fortnite/fortnite-battle-royale-player-numbers\">wildly successful</a> in a a way that the core game, uh, wasn't. Also it's free!)</p>\n<p>I didn't intend for this to happen, but to me, <strong>the Battle Royale game mode perfectly captures the zeitgeist of the current moment</strong>, and matches my current state of mind to a disturbing degree. It's an absolutely terrifying experience of every human for themselves, winner takes all, with impossible odds. There are moments it can be thrilling, even inspiring, but mostly it's brutal and unforgiving. To succeed you need to be exceedingly cautious, highly skilled, and just plain <em>lucky</em>. Roll the dice again, but know that everyone will run towards the sound of gunfire in hopes of picking off survivors and looting their corpses. Including you.</p>\n<p>Battle Royale is not the game mode we wanted, it's not the game mode we needed, it's the game mode we all <em>deserve</em>. And the best part is, when we're done playing, we can turn it off.</p>\n<!--kg-card-end: markdown-->"
}