{
  "title": "Serrapilheira Postdoctoral Fellowship at Universidade Federal do Ceará (Brazil)",
  "link": "https://matheuscmss.wordpress.com/2019/11/19/serrapilheira-postdoctoral-fellowship-at-universidade-federal-do-ceara-brazil/",
  "comments": "https://matheuscmss.wordpress.com/2019/11/19/serrapilheira-postdoctoral-fellowship-at-universidade-federal-do-ceara-brazil/#respond",
  "dc:creator": "matheuscmss",
  "pubDate": "Tue, 19 Nov 2019 06:45:02 +0000",
  "category": "Uncategorized",
  "guid": "http://matheuscmss.wordpress.com/?p=3814",
  "description": "Yuri Lima asked me to announce in this blog the following opportunity for a post-doctoral position in Dynamical Systems and Ergodic Theory at Universidade Federal do Ceará (located in Fortaleza, Brazil): Serrapilheira Postdoctoral Fellowship &#8211; UFC The Department of Mathematics at Universidade Federal do Ceará (UFC) invites applications for a Serrapilheira Postdoctoral Fellowship in dynamical [&#8230;]",
  "content:encoded": "<p><a href=\"http://www.mat.ufc.br/~yuri/\">Yuri Lima</a> asked me to announce in this blog the following opportunity for a post-doctoral position in Dynamical Systems and Ergodic Theory at Universidade Federal do Ceará (located in <a href=\"https://en.wikipedia.org/wiki/Fortaleza\">Fortaleza</a>, Brazil):</p>\n<hr />\n<p><b>Serrapilheira Postdoctoral Fellowship &#8211; UFC</b></p>\n<p>The Department of Mathematics at Universidade Federal do Ceará (UFC) invites applications for a Serrapilheira Postdoctoral Fellowship in dynamical systems and ergodic theory. The position is for one year with start date at any moment between March 2020 and September 2020, with possibility of extension for another year.</p>\n<p><b>Qualifications and expectations</b></p>\n<p>The position is part of the project &#8220;Jangada Dinâmica &#8211; boosting dynamical systems in Brazil&#8217;s Northeastern region&#8221;, which is funded by <a href=\"https://serrapilheira.org/en/\">Instituto Serrapilheira</a> and aims to boost dynamical systems and ergodic theory in the mathematical community of universities located in the Northeastern region of Brazil. The applicant must have completed a PhD and be qualified for conducting research in either dynamical systems and/or ergodic theory. There are NO teaching duties. As part of the program, and to foster interaction, the fellow shall visit another department of Mathematics in the Northeast for one month each semester or two months per year. Applications from underrepresented groups in Mathematics are highly encouraged.</p>\n<p><b>Salary</b></p>\n<p>The salary will range from 5000&#8211;6000 Brazilian Reais monthly, tax free, in a twelve month-base calendar, according to the applicant&#8217;s qualifications. There will be an extra 5000 Brazilian Reais for each of the two months of visits to another institution in the Northeast. The salary is more attractive than those offered by regular Brazilian funding agencies.</p>\n<p><b>Department of Mathematics at UFC</b></p>\n<p>The Department of Mathematics at UFC currently holds the highest rank among Brazilian Mathematics departments. Having a strong history in the field of differential geometry, during the last 15 years it has developed new research groups in analysis, graph optimization and, more recently, in dynamical systems. Currently, the group of dynamical systems has two members, with expertise on nonuniform hyperbolicity, partial hyperbolicity, and symbolic dynamics.</p>\n<p><b>Location</b></p>\n<p>UFC is located in the city of Fortaleza, which has approximately 2.5 million inhabitants and is the fifth largest city of Brazil. Located in the Northeastern region of Brazil, Fortaleza is becoming a common port of entry to the country, with many direct flights to the US and Europe. Historically known for touristic reasons, it is nearby beaches with warm water and white sand dunes, and its cost of living is cheaper than bigger cities like Rio de Janeiro and São Paulo, thus making the monthly stipend affordable.</p>\n<p><b>Documentation required</b></p>\n<p>&#8211; CV with publication list</p>\n<p>&#8211; Research statement</p>\n<p>&#8211; Two (or more) letters of recommendation.</p>\n<p>All documents must be sent to <a href=\"mailto:jangadadinamica@gmail.com\" target=\"_blank\" rel=\"noopener\">jangadadinamica@gmail.com</a>. The applicant must send the first two documents, and ask two (or more) professors to directly send their letters of recommendation.</p>\n<p><b>Deadline:</b> December 31, 2019.</p>\n<p><b>More information:</b> <a href=\"mailto:jangadadinamica@gmail.com\" target=\"_blank\" rel=\"noopener\">jangadadinamica@gmail.com</a>.</p>\n",
  "wfw:commentRss": "https://matheuscmss.wordpress.com/2019/11/19/serrapilheira-postdoctoral-fellowship-at-universidade-federal-do-ceara-brazil/feed/",
  "slash:comments": 0,
  "media:content": {
    "media:title": "matheuscmss"
  }
}