{
  "title": "Topological Robust Corner States of a Two-Dimensional Square Lattice with $\\mathbf C_{\\mathbf 4}$ Symmetry in Fully Coupled Dipolar Arrays. (arXiv:2210.13844v2 [physics.optics] UPDATED)",
  "link": "http://arxiv.org/abs/2210.13844",
  "description": "<p>Higher-order topological insulators(HOTIs) is an exciting topic. We\nconstructed a square lattice dipole arrays, it supports out-of-plane and\nin-plane modes by going beyond conventional scalar coupling. In-plane modes\nnaturally break $\\mathrm C_{4}$ symmetry, we only studied the out-of-plane\nmodes that maintain $\\mathrm C_{4}$ symmetry. Due to the slowly decaying\nlong-range coupling, we consider its fully coupled interactions by using the\nlattice sums technique and combined with the coupled dipole method (CDM) to\nstudy its topological properties in detail. Interestingly, even when the full\ncoupling is considered, the topological properties of the system remain similar\nto those of the 2D Su-Schrieffer-Heeger(SSH) model, but very differently, it\nsupports robust zero-energy corner states (ZECSs) with $\\mathrm C_{4}$\nsymmetry, we calculate the bulk polarization and discuss in detail the\ntopological origin of the ZECSs. The lattice sums technique in the article can\nbe applied to arbitrary fully coupled 2D dipole arrays. The materials we used\ncan be able to confine light into the deep subwavelength scale, it has a great\npotential in enhancing light-matter interactions in the terahertz (THz) range.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Luo_C/0/1/0/all/0/1\">Chen Luo</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Zhou_X/0/1/0/all/0/1\">Xiang Zhou</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Li_H/0/1/0/all/0/1\">Hui-Chang Li</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Zhang_T/0/1/0/all/0/1\">Tai-Lin Zhang</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Shen_Y/0/1/0/all/0/1\">Yun Shen</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Deng_X/0/1/0/all/0/1\">Xiao-Hua Deng</a>"
}