{
  "title": "S14 Ep72: Transmissions From the Solar Council with Marc Brinkerhoff",
  "link": "https://audioboom.com/posts/8098558",
  "itunes:episode": 72,
  "itunes:title": "Transmissions From the Solar Council with Marc Brinkerhoff",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6806,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS goes WAY BEYOND today as we decipher Transmissions From the Solar Council with Marc Brinkerhoff.<br>\n<br>\nA true \"UFO Repeater\" who has established contact with humanoid-like entities from other spheres and dimensions. He has the ability to aim his camera at the sky where they \"tell him\" and<br>\nunexplained images  will appear (including the shadow of an alien in one case).  <br>\n<br>\nMarc is in touch with the Ashtar Command who have promised to assist in a global evacuation if there is any sort of widespread disaster. He is the principal individual who tells his experience in \"Ashtar's Space Brothers Speak -- Transmissions From The Solar Council.\" And his on going experiences are related in \"UFO Repeaters -- The Camera Doesn't Lie!\"<br>\n<br>\nGet the books here: <a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\n<a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nVisit his site here: <a href=\"http://intergalacticmission.com/\">http://intergalacticmission.com/</a><br>\n<br>\nPLUS:  There is an all new Darkness Radio app for IOS and IPhone!  Check the app store by searching \"Darkness Radio\" and looking for the picture of \"Skully\"! Best of all, it's free!<br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nCarnival Row is a one-hour fantasy drama series starring Orlando Bloom and Cara Delevingne . The series is set in a Victorian fantasy world filled with mythological immigrant creatures whose exotic homelands were invaded by the empires of man. Come together on August 30th to watch Carnival Row only on Amazon Prime Video this Labor Day Weekend!<br>\n<br>\nFeals naturally helps reduce stress, anxiety, pain, and sleeplessness.  Place a few drops of Feals under your tongue and feel the difference within minutes. Become a member today by going to <a href=\"http://Feals.com/DARKNESS\">Feals.com/DARKNESS</a> and you'll get 50% off your first order with free shipping",
  "itunes:summary": "BEYOND the DARKNESS goes WAY BEYOND today as we decipher Transmissions From the Solar Council with Marc Brinkerhoff.\n\nA true \"UFO Repeater\" who has established contact with humanoid-like entities from other spheres and dimensions....",
  "pubDate": "Sun, 01 Sep 2019 05:00:00 +0000",
  "guid": "c7cbfcde-1446-4fc4-9d56-ab716d0786c5",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}