{
  "id": "yt:video:9I7NSMMhFmU",
  "yt:videoId": "9I7NSMMhFmU",
  "yt:channelId": "UCkLHy_jxeaHTZCfGalg6QaA",
  "title": "Wage & Hour Best Practices",
  "link": "",
  "author": {
    "name": "Conn Maciel Carey LLP",
    "uri": "https://www.youtube.com/channel/UCkLHy_jxeaHTZCfGalg6QaA"
  },
  "published": "2022-08-18T12:23:10+00:00",
  "updated": "2022-09-08T06:49:19+00:00",
  "media:group": {
    "media:title": "Wage & Hour Best Practices",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Presented by Ashley D. Mitchell, Megan S. Shaked, and Samuel S. Rose\n\nEmployers are subject to numerous federal and state laws governing employee wages, the hours of work for which an employee must be paid, and the frequency and duration of breaks an employee is entitled to during the workday. Wage and hour issues are further complicated by a shift to remote work during the pandemic. Even the best-intentioned employers could face a multimillion-dollar wage and hour class action. This webinar will give you a blueprint for best practices and common pitfalls to avoid and mitigate the risk of future wage and hour litigation.\n\nParticipants in this webinar will learn about:\n\n• Independent contractor status, and the implications of misclassifying an employee as an independent contractor.\n• Exempt vs. non-exempt employees including discussion of the “White Collar” exemptions\n• State meal and rest period requirements\n• Other wage and hour considerations such as the regular rate of pay for overtime purposes, off-the-clock work, and time and wage statement requirements\n• Top legal considerations for employees working remotely\n• Collective action trends including a discussion of California’s Private Attorneys General Act (PAGA), known as the “Bounty Hunter” statute, and why employers with a presence outside of California should take notice\n\nA webinar from Conn Maciel Carey LLP.\n\nUse of this video does not in any manner constitute or establish an attorney-client relationship between Conn Maciel Carey and the viewer. This video may be deemed \"attorney advertising\" in jurisdictions from which it is accessed. The decision to hire a lawyer is a serious one and should be undertaken after consideration of all relevant information, not only information on this video.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}