{
  "title": "#449: Torturous Toad (OOTP 13, Detention With Dolores)",
  "link": "https://audioboom.com/posts/7477179",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4082,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Reminder: MuggleCast is moving to Tuesdays! Each week we'll have a new episode available bright and early.</li>\n<li>A 'flagship' Harry Potter store has been announced, where we'll be able to grab coffee, Butterbeer, and... 'House Wands'?!</li>\n<li>Chapter by Chapter: Order of the Phoenix Chapter 13, Detention with Dolores</li>\n<li>This chapter is very unlucky for Harry. Are all Chapter 13's in the Harry Potter series the same way?</li>\n<li>Theory: Every chapter ever is unlucky for Harry.</li>\n<li>Fred and George are getting away with their testing -- until Hermione steps in. Why this moment was truly 'below the belt' for the twins.</li>\n<li>What's going on with Hermione and her crusade to free the elves? We don't see her doing any work that the elves do.</li>\n<li>We learn that Bowtruckles can actually be quite evil. How could Newt keep one so close to his eye balls? It's Security Nightmare: Pickett Edition!</li>\n<li>Then again, they have leafy hands. How peaceful! What an enigma.</li>\n<li>Malfoy drops some information that's of interest to Harry, while Luna sticks up for The Chosen One in a big way.</li>\n<li>Detention with Dolores: It's in this scene where Umbridge goes from being an annoying teacher to a truly evil one.</li>\n<li>Did Dumbledore or McGonagall know that this type of thing was going on? Should Harry have ratted Umbridge out? And did this ever happen again?</li>\n<li>Quizzitch: What does Cho refer to Ron as? Answer on Twitter by tweeting @MuggleCast!</li>\n<li>This week's episode is sponsored by Care/Of! Get 50% off your first order of personalized vitamins by visiting <a href=\"http://TakeCareOf.com\">TakeCareOf.com</a> and using promo code 'mugglecast50' at checkout. Support MuggleCast by supporting our sponsors!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 14 Jan 2020 12:00:00 +0000",
  "guid": "tag:audioboom.com,2020-01-13:/posts/7477179",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}