{
  "title": "Georgia, Lithuania Call for Permanent US Troop Presences",
  "link": "https://jamestown.org/georgia-lithuania-call-for-permanent-us-troop-presences/",
  "dc:creator": "web1983",
  "pubDate": "Wed, 02 Dec 2020 22:31:48 +0000",
  "category": "Uncategorised",
  "guid": "https://jamestown.org/?p=87960",
  "description": "<p>The foreign and security policy expert communities in Georgia (Neweurope.eu, November 17) as well as both the outgoing and candidate Lithuanian defense ministers (LRT, November 16, 19) have called for a permanent presence of United States military forces in their respective countries. These calls indicate a hope that the incoming administration of President-elect Joseph Biden will bring greater attention to &#8230; <a href=\"https://jamestown.org/georgia-lithuania-call-for-permanent-us-troop-presences/\" class=\"more\"></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/georgia-lithuania-call-for-permanent-us-troop-presences/\">Georgia, Lithuania Call for Permanent US Troop Presences</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n",
  "content:encoded": "<p>The foreign and security policy expert communities in Georgia (<a href=\"https://www.neweurope.eu/article/open-letter-to-u-s-secretary-of-state-mike-pompeo/\">Neweurope.eu</a>, November 17) as well as both the outgoing and candidate Lithuanian defense ministers (LRT, <a href=\"https://www.lrt.lt/en/news-in-english/19/1277418/lithuanian-defence-minister-calls-for-permanent-us-troop-presence\">November 16</a>, <a href=\"https://www.lrt.lt/en/news-in-english/19/1280057/we-can-have-us-troops-deployed-in-lithuania-within-years-candidate-defence-minister\">19</a>) have called for a permanent presence of United States military forces in their respective countries. These calls indicate a hope that the incoming administration of President-elect Joseph Biden will bring greater attention to security on the North Atlantic Treaty Organization’s (NATO) eastern flank.</p>\n<p>In addition to the results of the US presidential election, this summer’s announcement that thousands of US troops would be moved out of Germany, with some being re-stationed elsewhere, led to a small bidding war for some of those military units. Poland, as the result of signing the Joint Declaration on Defense Cooperation ratified in August, will receive an additional 1,000 US troops to the current 4,500 rotational forces, plus a further 200 soldiers as part of the newly established V Corps Forward Command Center (see <a href=\"https://jamestown.org/program/us-announces-it-will-withdraw-its-troops-from-germany-the-view-from-warsaw/\">EDM</a>, June 29). Moreover, rotational presences will be deployed to other countries along NATO’s eastern and southeastern flanks (<a href=\"https://crsreports.congress.gov/product/pdf/IF/IF11280\">Crsreports.congress.gov</a>, August 4). Latvian Defense Minister Artis Pabriks expressed Latvia’s wish—and willingness to pay—for a US troop presence in his country, either on a rotational or permanent basis (<a href=\"https://www.leta.lv/eng/home/important/B710E681-8411-4009-8488-26881E9ED7CC/\">Leta.lv</a>, July 11; <a href=\"https://eng.lsm.lv/article/society/defense/defense-minister-asks-us-to-station-troops-in-latvia.a373687/\">Lsm.lv</a>, September 9). Pabriks had previously expressed excitement at the prospect of US troops more frequently operating in Latvia if they are stationed in Poland (<a href=\"https://www.leta.lv/eng/home/important/DB68BB29-73BB-42C0-8BDB-1DCA4C746396/\">Lsm.lv</a>, June 26). Estonia, on the other hand, has only emphasized the role US troops play as “a cornerstone of European security” since the troop withdrawal and re-stationing from Germany was announced (ERR, <a href=\"https://news.err.ee/1103480/ratas-and-reinsalu-reduction-of-us-forces-in-germany-is-worrying\">June 18</a>, <a href=\"https://news.err.ee/1118283/defense-minister-estonia-highly-values-us-nato-contribution\">July 30</a>, <a href=\"https://news.err.ee/1179208/interview-defense-minister-on-estonia-s-nato-experience-now-and-in-future\">November 29</a>). Georgia and Lithuania are just the most recent states trying to capitalize on a potential shift in the US’s defense posture in Europe.</p>\n<p>Prospects for a more robust US military presence are much stronger in the case of Lithuania than Georgia. Lithuania, a NATO member, is currently home to a NATO Enhanced Forward Presence (eFP) multinational battalion in Rukla, between Kaunas and Vilnius, plus a six-month deployment of 500 US troops, starting this past October (<a href=\"https://www.nato.int/nato-on-the-map/#lat=55.052382&lon=24.378632&zoom=2&layer-5&lang=en&viewer=gmaps\">Nato.int</a>, accessed November 27; <a href=\"https://www.reuters.com/article/usa-russia-lithuania/u-s-to-deploy-500-troops-to-lithuania-in-fresh-signal-to-russia-idUSL5N26G2VC\">Reuters</a>, September 25). On the other hand, Georgia, a NATO Partner for Peace since 1994—which was promised eventual membership at the 2008 Bucharest Summit but has yet to even receive a Membership Action Plan (MAP)—only benefits from a training center and troops during exercises, despite 77 percent of Georgians supporting European Union accession and 74 percent supporting NATO accession. Moreover, Georgia has long contributed to NATO’s Resolute Support Mission in Afghanistan and Operation Sea Guardian in the Mediterranean (<a href=\"https://mod.gov.ge/en/news/read/7973/noble-partner-2020-accomplished\">Mod.gov.ge</a>, September 18; Nato.int, <a href=\"https://www.act.nato.int/articles/georgian-defence-forces-lead-nato-georgia-exercise-2019\">March 18, 2019</a> and <a href=\"https://www.nato.int/cps/en/natohq/topics_38988.htm\">October 21, 2020</a>; <a href=\"https://www.ndi.org/publications/ndi-poll-eu-and-nato-support-remains-strong-threatened-russia-and-perception-harm\">Ndi.org</a>, May 28, 2019).</p>\n<p>Russian aggression is also a contributing factor, and both Georgia and the Baltics have been particularly concerned about their level of security since the 2014 invasion of Ukraine. With the Karabakh peace deal further increasing Russia’s military presence in the South Caucasus, Georgia is wary of more “peacekeepers” arriving to the region. Georgia knows better than most that Russian peacekeepers can eventually transform into invading forces.</p>\n<p>In the Baltics, Lithuania holds a special status in terms of strategic importance. Lithuania’s border with Poland forms the so-called Suwałki Corridor, which runs between the Russian exclave of Kaliningrad and Belarus. Security expert Jacek Bartosiak, in his interview on The Jamestown Foundation’s first episode of the <em>Eastern Approaches</em> webinar series, highlighted three main security issues for Lithuania and the Suwałki Corridor. First, this 65-kilometer strip of land contains the only two main roads on which NATO forces (other than the Baltic eFPs) could reach the Baltic States from Poland (only one of these roadways is sufficiently developed for troop mobility). Both routes, which go to Vilnius and Kaunas respectively, are vulnerable to rapid projections of military power from Grodno in Belarus and from Kaliningrad. The situation in Belarus has brought about greater Russian military activity, with a more permanent Russian presence potentially on the horizon (see EDM, <a href=\"https://jamestown.org/program/russia-reasserts-control-via-nonstop-military-exercises-in-belarus/\">September 17</a>, <a href=\"https://jamestown.org/program/russias-interests-in-belarus-ends-and-means-part-three/\">October 20</a>, <a href=\"https://jamestown.org/program/russias-interests-in-belarus-ends-and-means-part-four/\">22</a>). Kaliningrad, which is surrounded by NATO members, has undergone rapid military modernization over the past few years, including the development of a layered Anti-Access/Area Denial (A2/AD) system and unmanned aerial vehicle (UAV) capabilities (see EDM, <a href=\"https://jamestown.org/program/end-hide-seek-russian-iskanders-permanently-kaliningrad/\">February 23, 2018</a>, <a href=\"https://jamestown.org/program/moscow-deploys-latest-electronic-warfare-systems-in-kaliningrad/\">December 11, 2018</a>, <a href=\"https://jamestown.org/program/russia-boosts-kaliningrads-military-capabilities-by-emphasizing-the-uav-component/\">January 17, 2019</a>, <a href=\"https://jamestown.org/program/moscow-enhances-artillery-firepower-in-kaliningrad/\">April 1, 2020</a>). Second, the Baltic States have vulnerable eastern and western flanks: the east is sparsely populated with Russian speakers, leaving it more vulnerable to information warfare and slow mobilization, while the west is open to naval and amphibious attacks through the many ports and beaches. Third, the geography of Lithuania is ideal for tank warfare but not for the use of Javelin anti-tank missiles; this issue is compounded by the inadequacy of armored NATO forces as part of the eFP battalions and the positioning of the NATO base at Rukla, which leaves the entire countryside vulnerable in the event of a Russian invasion (see <a href=\"https://jamestown.org/event/eastern-approaches-reconnoitering-the-suwalki-corridor/\">Eastern Approaches</a>, July 17).</p>\n<p>The geographic compactness of the Baltics heightens the risk each vulnerability poses. Other than Lithuania and the Suwałki Corridor, Riga, which some consider the center of gravity for Baltic security (see <a href=\"https://jamestown.org/event/eastern-approaches-reconnoitering-the-suwalki-corridor/\">Eastern Approaches</a>, July 17), and the Estonian island of Saaremaa, whose location allows for control of this sector of the Baltic Sea, are the most exposed in the event of invasion (see <a href=\"https://jamestown.org/event/eastern-approaches-total-defense-a-view-from-finland/\">Eastern Approaches</a>, September 25).</p>\n<p>Georgia’s location on the eastern coast of the Black Sea proves the country’s strategic importance twofold. First, Georgia helps limit Russia’s presence on the Black Sea, working in tandem with NATO members Bulgaria, Romania and Turkey and NATO partner Ukraine (see <a href=\"https://jamestown.org/program/russias-unilateral-black-sea-aggression-elicits-protests-from-ukraine-georgia/\">EDM</a>, February 4). The Black Sea is becoming increasingly important due to energy and goods transit, in addition to bordering Russian-occupied Abkhazia and Crimea. Second, Georgia plays a key role in the Caspian–Black Sea transit corridor as the central stop of the Baku–Tbilisi–Kars railway and the Baku–Tbilisi–Ceyhan and South Caucasus pipelines (see <a href=\"https://jamestown.org/program/clashes-on-azerbaijan-armenia-border-threaten-regional-transport-and-energy-routes/\">EDM</a>, July 30). As a defense partner, Georgia has consistently stood by the West in Afghanistan, providing 20,000 troops to Resolute Support Mission since 2010, the most of any non-NATO country and more than many Alliance members (<a href=\"https://www.nato.int/nato_static_fl2014/assets/pdf/2020/2/pdf/2020-02-RSM-Placemat.pdf\">Nato.int</a>, February 2020; <a href=\"https://www.state.gov/u-s-security-cooperation-with-georgia/\">State.gov</a>, June 16). Georgian troops also participate in the annual Joint Noble and Agile Spirit exercises with the US.</p>\n<p>Georgia, Lithuania and the other countries that have asked for a permanent US presence have clearly been motivated to speak up by the controversial decision to move troops out of Germany. And yet even opponents of the new basing decisions admit that Germany is a logistics and command hub, not the frontline (see <a href=\"https://jamestown.org/event/webinar-making-sense-of-new-us-basing-decisions-in-europe-a-conversation-with-philip-m-breedlove-and-ben-hodges/\">Jamestown.org</a>, August 18).</p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/georgia-lithuania-call-for-permanent-us-troop-presences/\">Georgia, Lithuania Call for Permanent US Troop Presences</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n"
}