{
  "title": "Argentina seeks talks over old conflict with UK",
  "link": "https://www.rt.com/news/565962-argentina-falklands-malvinas-negotiations/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565962-argentina-falklands-malvinas-negotiations/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636540b685f54038525f5ccd.jpg\" /> The Argentine Foreign Ministry has requested that the UK re-enter negotiations on the status of the Malvinas (Falkland) Islands <br/><a href=\"https://www.rt.com/news/565962-argentina-falklands-malvinas-negotiations/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>With Britain entering negotiations to hand over its other imperial vestiges, Buenos Aires wants the Falklands back</strong></p>\n            \n                        \n            <p>The Argentine Foreign Ministry requested on Thursday that Britain comply with a UN resolution and resume talks on the sovereignty of the Malvinas (Falkland) Islands. The request came after London agreed to negotiate with Mauritius over the future of the Chagos Islands.</p>\n<p>British Foreign Secretary James Cleverly said on Thursday that the UK wants to <em>&ldquo;resolve all outstanding issues&rdquo;</em> with Mauritius over the Chagos Archipelago, a British territory in the Indian Ocean since 1814 that remained under British control after Mauritius won its independence from the UK in 1968. Ignored by London for decades, a UN resolution compels Britain to reach a settlement with Mauritius over the islands.</p>\n<p>Guillermo Carmona, an official at the Argentine Foreign Ministry, said that Britain&rsquo;s decision to enter talks with Mauritius marks <em>&ldquo;a transcendental day for all the peoples who fight to put an end to colonialism.&rdquo;</em></p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/634eb05085f5403b7635d53a.jpg\" alt=\"FILE PHOTO. Avro Vulcan XH558 flies in formation with Gnat display team in 2014.\" />\n            <figcaption><a href=\"https://www.rt.com/news/564913-uk-plan-bombing-argentina/\">Secret UK plan for Falklands War revealed</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Carmona said that just as it is honoring the UN resolution on the Chagos Islands, Britain <em>&ldquo;must comply with resolution 2065 on the Malvinas Question.&rdquo;</em> The resolution in question calls on London and Buenos Aires to negotiate sovereignty over the islands, which are called the Malvinas by Argentina and the Falklands by the UK.</p>\n<p>Britain has administered the islands since 1833, and won a war with Argentina over them in 1982. Argentina still claims sovereignty over the archipelago, however, arguing that it acquired them from Spain when it won its independence in 1816.</p>\n<p>While Argentina issues regular calls to Britain to honor resolution 2065, the UK refuses. Britain insists that a 2013 referendum &ndash; in which nearly 100% of the islands&rsquo; 3,400 residents voted to remain a British overseas territory &ndash; renders negotiations pointless.</p>\n<p>Friday marks the 40th anniversary of UN General Assembly resolution 37/9, which stated that <em>\"the maintenance of colonial situations is incompatible with the ideal of universal peace of the United Nations,&rdquo;</em> and called on the UK and Argentina to <em>&ldquo;find a peaceful solution&rdquo;</em> to the Malvinas/Falklands dispute.</p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 17:15:17 +0000",
  "dc:creator": "RT"
}