{
  "id": "tag:blogger.com,1999:blog-2499715909956774229.post-5252801361630344941",
  "published": "2018-07-08T15:46:00.002-07:00",
  "updated": "2018-07-08T18:42:12.788-07:00",
  "title": "Don't Fear the Inversion - It's the Short Rate That Kills You",
  "content": "<a href=\"https://www.wsj.com/articles/fed-officials-debate-signal-from-flattening-yield-curve-is-this-time-different-1531051200\">Nick Tamaraos</a> has a nice summary of issues to do with the flattening US Treasury yield curve, and the implications for monetary policy. Some people, including <a href=\"https://www.bloomberg.com/view/articles/2018-06-08/fed-could-get-more-aggressive\">Tim Duy</a>, and some regional Fed Presidents, are alarmed by the flattening yield curve, and the issue entered the policy discussion at the <a href=\"https://www.federalreserve.gov/monetarypolicy/fomcminutes20180613.htm\">last FOMC meeting.</a><br /><br />What's going on? While it's typical to focus on the margin between 10-year Treasuries and 2-years, I think it's useful to capture the very short end of the yield curve as well. I would use the fed funds rate for the short end, but that's sometimes contaminated by risk, so the 3-month t-bill rate, which most of the time seems to be driven primarily by monetary policy, seems like a good choice. Here's the time series of the 3-month T-bill, the 2-year Treasury yield, and the 10-year:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-bVLS9g5awQ8/W0JtMB1KGOI/AAAAAAAADIA/kLpZrZscq2IAbQzEUbnK0FeQsGHaO_dJACLcBGAs/s1600/yield%2Bcurve.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://3.bp.blogspot.com/-bVLS9g5awQ8/W0JtMB1KGOI/AAAAAAAADIA/kLpZrZscq2IAbQzEUbnK0FeQsGHaO_dJACLcBGAs/s640/yield%2Bcurve.png\" width=\"640\" height=\"445\" data-original-width=\"898\" data-original-height=\"624\" /></a></div>What people have pointed out is a regularity in the data. A flat or inverted yield curve tends to lead a recession. In the chart above, we're looking for compression in the 3 time series I've plotted. You can certainly see that compressions tend to lead the NBER-dated recessions (the shaded areas). To get a closer look at this, plot the difference between the ten-year yield and the 2-year yield, and the difference between the 2-year yield and the 3-month T-bill rate: <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-xF6dEK4GbEw/W0JvEc6kySI/AAAAAAAADIM/pkAexHxZX-0mLZWvdRyGFFZnRrDqxZRKgCLcBGAs/s1600/slope%2Byield%2Bcurve.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-xF6dEK4GbEw/W0JvEc6kySI/AAAAAAAADIM/pkAexHxZX-0mLZWvdRyGFFZnRrDqxZRKgCLcBGAs/s640/slope%2Byield%2Bcurve.png\" width=\"640\" height=\"451\" data-original-width=\"875\" data-original-height=\"617\" /></a></div>In this second chart, you can see that those two interest rate differentials go negative before recessions. But there are a couple of episodes in the sample, in 1996 and 1998, when the yield curve is pretty flat, but there's no ensuing recession. What's different about those two episodes is that (see the first Chart) the compression is caused more by long bond yields moving down, rather than the short rate moving up, as we observe in the cases where compression precedes a recession. If you were worried about an oncoming recession right now, based only on yield curve observations, you shouldn't be. All the recent flattening in the yield curve is in the long end. The margin between the two-year yield and the three-month T-bill rate hasn't been falling, as it did prior to previous recessions.<br /><br />I think it's fair to conclude that what's going on in the data isn't a phenomenon related to the slope of the yield curve at the long end (2 years to 10 years), but at the short end. Recessions tend to happen when the short rate goes up a lot, and that's driven by monetary policy. As an alternative recession indicator, let's look at the real interest rate, measured by the difference between the three-month T-bill rate and year-over-year core inflation:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-9M3FhwyGR94/W0JzAXHcVxI/AAAAAAAADIY/_wWuKA4M9KAvE7UpqjguS1e0CoqjBOX6ACLcBGAs/s1600/real%2Brate.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-9M3FhwyGR94/W0JzAXHcVxI/AAAAAAAADIY/_wWuKA4M9KAvE7UpqjguS1e0CoqjBOX6ACLcBGAs/s640/real%2Brate.png\" width=\"640\" height=\"441\" data-original-width=\"893\" data-original-height=\"615\" /></a></div>Typically, when the real interest rate moves from trough to peak by a large amount, a recession happens. That seems to work pretty well, except during the 1980s disinflation. So, for example, from trough to peak, the real rate moves about 420 basis points before the 2001 recession, and about 400 basis points before the 2008-09 recession. Recently, the movement from the trough to where we are now is about 200 basis points, so by that criterion, it's not time to worry yet.<br /><br />What's the policy issue here? Well, apparently some members of the FOMC are starting to question whether continued rate hikes are a good idea, and are looking for arguments that will convince their colleagues to hold off. For example, in <a href=\"https://www.stlouisfed.org/~/media/Files/PDFs/Bullard/remarks/2018/Bullard_JCIF_Tokyo_29_May_2018.pdf?la=en\">a talk at the end of May,</a> Jim Bullard gave three reasons for holding off on interest rate increases: (i) inflation expectations are about where they should be; (ii) the Fed is achieving its goals; (iii) the yield curve is flattening. One measure of anticipated inflation is the breakeven rate - the margin between a nominal bond yield and the TIPS yield for the same maturity. Here are the five-year and 10-year breakeven rates:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-wo1cHo4FGRU/W0J3ktuC-7I/AAAAAAAADIk/139kX83w6swB8H9fw-phphV9ut9y9sgOwCLcBGAs/s1600/breakeven.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-wo1cHo4FGRU/W0J3ktuC-7I/AAAAAAAADIk/139kX83w6swB8H9fw-phphV9ut9y9sgOwCLcBGAs/s640/breakeven.png\" width=\"640\" height=\"447\" data-original-width=\"891\" data-original-height=\"622\" /></a></div>Both of those have moved up above 2%, and the increase in the five-year breakeven is particularly important, as that's telling you more about near-term inflation expectations. As well, for good measure, the Philadelphia Fed's survey of forecasters gives a measure of anticipated CPI inflation for the next year:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-v5QP1eoO6R8/W0J4NDk8tSI/AAAAAAAADIs/zcRHJEmmALQkIZE5opO08INjzrQkDuDzACLcBGAs/s1600/forecast.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-v5QP1eoO6R8/W0J4NDk8tSI/AAAAAAAADIs/zcRHJEmmALQkIZE5opO08INjzrQkDuDzACLcBGAs/s640/forecast.png\" width=\"640\" height=\"524\" data-original-width=\"1025\" data-original-height=\"839\" /></a></div>That measure has also moved well above 2%, in line with 2% inflation - more or less - in terms of the Fed's inflation target measure, the PCE deflator. In terms of achieving its goals, the Fed is essentially nailing its inflation target, and the labor market is tighter than anyone would have imagined possible a few years ago. But what about the flattening yield curve, the third item on Jim Bullard's list?<br /><br />There was a discussion about the flattening yield curve at the last FOMC meeting, as documented in the <a href=\"https://www.federalreserve.gov/monetarypolicy/fomcminutes20180613.htm\">most recent FOMC minutes.</a> Here's the relevant paragraph:<blockquote>Meeting participants also discussed the term structure of interest rates and what a flattening of the yield curve might signal about economic activity going forward. Participants pointed to a number of factors, other than the gradual rise of the federal funds rate, that could contribute to a reduction in the spread between long-term and short-term Treasury yields, including a reduction in investors' estimates of the longer-run neutral real interest rate; lower longer-term inflation expectations; or a lower level of term premiums in recent years relative to historical experience reflecting, in part, central bank asset purchases. Some participants noted that such factors might temper the reliability of the slope of the yield curve as an indicator of future economic activity; however, several others expressed doubt about whether such factors were distorting the information content of the yield curve. A number of participants thought it would be important to continue to monitor the slope of the yield curve, given the historical regularity that an inverted yield curve has indicated an increased risk of recession in the United States. Participants also discussed a staff presentation of an indicator of the likelihood of recession based on the spread between the current level of the federal funds rate and the expected federal funds rate several quarters ahead derived from futures market prices. The staff noted that this measure may be less affected by many of the factors that have contributed to the flattening of the yield curve, such as depressed term premiums at longer horizons. Several participants cautioned that yield curve movements should be interpreted within the broader context of financial conditions and the outlook, and would be only one among many considerations in forming an assessment of appropriate policy.</blockquote><br />What's going on here? The flattening yield curve is being used as an argument for a pause in interest rate hikes, so the people in favor of more interest rate hikes are looking for reasons why things are different now, and the drop in the margin between the 10-year yield and the 2-year yield doesn't mean what it used to. People may be able to come up with explanations about what's going on with respect to the 10-year vs. the 2-year Treasury bonds, but as I discussed above, that's not really important - it's what's going on at the short end of the yield curve that matters. The key question is: What are the benefits and costs of further rate hikes, given the current state of the economy? In evaluating the costs, we need to be concerned about the effects of these hikes on real economic activity. What's it take for the Fed to kick off a recession, and does the Fed really want to do the experiment to find out, if everything looks OK? As a side note, I thought the part of the FOMC discussion where the staff gives a presentation relating to an alternative indicator - the difference between the current fed funds rate and what the market thinks the future fed funds rate will be - was good for a chuckle. If the FOMC thinks the market knows more about what it's going to do than what it knows about what it's going to do, we're all in trouble.<br /><br />What's the bottom line here? The case for continued rate hikes the FOMC has made is based on a faulty theory of inflation. The Fed thinks that tightness in the labor market will inevitably cause inflation to explode, and it thinks that increasing unemployment will keep inflation on target. But: (i) Phillips curve theory is not a theory; (ii) the central bank does not control inflation by controlling the unemployment rate; (iii) there is no such thing as an overheating economy. There is some question about what real interest rate we would see when the US economy settles down - supposing monetary and non-monetary factors don't change from what they are currently. Possibly that real interest rate - r* if you like - has increased somewhat from where it was earlier this year <a href=\"http://newmonetarism.blogspot.com/2018/07/fed-balance-sheet-news.html\">due to the phasing out of the Fed's QE program.</a> But, given the current state of the economy, I think the onus should be on members of the FOMC who want further hikes to justify them, not the other way around.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Stephen Williamson",
    "uri": "http://www.blogger.com/profile/01434465858419028592",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 7
}