{
  "title": "Masters of Business | An introduction to the new business season from Tony Robbins",
  "pubDate": "Thu, 29 Aug 2019 19:30:00 +0000",
  "guid": "25aa49961c644a9e8cdf9c80103106b3",
  "link": "https://tonyrobbins.libsyn.com/masters-of-business-an-introduction-to-the-new-business-season-from-tony-robbins",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Next up on the Tony Robbins Podcast is the</span> <strong>Masters of Business</strong> <span style=\"font-weight: 400;\">series, where we’re bringing you a collection of interviews and stories from today’s most respected entrepreneurs in hospitality, technology, retail, and marketing. You’ll also get an inside look into the strategy and mindset that Tony has used to grow his</span> <em><span style= \"font-weight: 400;\">own</span></em> <span style= \"font-weight: 400;\">businesses – which together, have</span> <span style=\"font-weight: 400;\">combined sales of more than 5 billion dollars a year.</span><span style= \"font-weight: 400;\"> </span></p> <p><span style=\"font-weight: 400;\">Stay tuned in for the first episode of the series, where Tony talks to Danny Meyer, the founder of Union Square Hospitality Group, which is the parent company of Shake Shack and many well-known New York City restaurants.</span></p>",
  "content:encoded": "<p>Next up on the Tony Robbins Podcast is the Masters of Business series, where we’re bringing you a collection of interviews and stories from today’s most respected entrepreneurs in hospitality, technology, retail, and marketing. You’ll also get an inside look into the strategy and mindset that Tony has used to grow his <em>own</em> businesses – which together, have combined sales of more than 5 billion dollars a year. </p> <p>Stay tuned in for the first episode of the series, where Tony talks to Danny Meyer, the founder of Union Square Hospitality Group, which is the parent company of Shake Shack and many well-known New York City restaurants.</p>",
  "enclosure": "",
  "itunes:duration": "06:11",
  "itunes:explicit": false,
  "itunes:keywords": "of,business,tony,masters,robbins",
  "itunes:subtitle": "Next up on the Tony Robbins Podcast is the Masters of Business series, where we’re bringing you a collection of interviews and stories from today’s most respected entrepreneurs in hospitality, technology, retail, and marketing. You’ll also get...",
  "itunes:episodeType": "full"
}