{
  "title": "The Day Business Suits Became In-App Purchases",
  "link": "https://spectrum.ieee.org/metaverse-fashion-roblox-meta",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/meta-avatars-wearing-fashion-from-the-avatars-store.jpg?id=30041643&width=1200&height=600&coordinates=0%2C0%2C0%2C120\"/><br/><br/><p>Odds are you’ve added a piece to your wardrobe for a job interview or an important meeting. But what if that meeting happened in the metaverse? Would you spend money to upgrade your avatar? </p><p>Meta is hoping you’ll answer “yes.” CEO Mark Zuckerberg announced the company’s new Avatars Store, slated to go live within weeks, <a href=\"https://www.facebook.com/zuck/posts/10114529132448901\" rel=\"noopener noreferrer\" target=\"_blank\"><u>in an “avatar fashion show” with Instagram’s Eva Chen</u></a>. </p><p class=\"pull-quote\">“The metaverse feels so far off. I have such a hard time imagining anyone going to design school, then doing their first collection in the metaverse, and having that resonate.”<br/>—Amy Odell, Substack fashion journalist</p><p>“Basically, it’s a clothing store for your avatar, [...] but we also want to create this marketplace, so all sorts of creators over time are going to be able to design clothing, and sell it,” <a href=\"https://www.instagram.com/p/Ce6yFgbptyM/\" rel=\"noopener noreferrer\" target=\"_blank\"><u>Zuckerberg said on Instagram</u></a>. </p><h2>Digital suits are a deal, but will designers find value?</h2><p><a href=\"https://about.fb.com/news/2022/06/introducing-the-meta-avatars-store/\" target=\"_blank\">Meta’s launch of the Avatars Store </a>will feature styles from Balenciaga, Prada, and Thom Browne that emulate the look of real-world counterparts. This luxury attire could cost thousands in the real world but will prove more affordable in the metaverse, with prices ranging from US $2.99 to $8.99. </p><p>“I was really surprised, completely shocked by the price point, that it was that little,” <a href=\"https://amyodell.substack.com/\" rel=\"noopener noreferrer\" target=\"_blank\"><u>Amy Odell</u></a>, fashion journalist and author of <a href=\"https://www.simonandschuster.com/books/Anna/Amy-Odell/9781982122638\" target=\"_blank\"><em>Anna: The Biography</em></a>, said in an interview.</p><p>This is the latest in a long and sometimes awkward alliance between fashion and Meta’s social media platforms, which include Facebook and Instagram. </p><p>“Even runway shows used to be closed off,” said Odell. “Fashion labels didn’t want to do that, for a variety of reasons.” </p><p>Social media’s vast reach has eroded the industry’s resistance, however, as Meta has put substantial effort into the relationship. Eva Chen, formerly editor in chief of <em>Lucky</em> magazine, was hired as head of fashion partnerships at Instagram in 2015 and has served in that role since. Zuckerberg also made efforts to build bridges,<a href=\"https://www.instagram.com/p/CdIm4dbAw6T/\" rel=\"noopener noreferrer\" target=\"_blank\"><u> sharing photos of himself and the late Leonardo Del Vecchio</u></a> prior to the launch of the <a href=\"https://about.fb.com/news/2021/09/introducing-ray-ban-stories-smart-glasses/\" rel=\"noopener noreferrer\" target=\"_blank\"><u>Ray-Ban Stories</u></a>.</p><p>Meta is not without competition. Roblox, an online game platform that lets players create their own experiences, has courted Tommy Hilfiger, Ralph Lauren, and Gucci, among others. Hilfiger decided to collaborate with Roblox <a href=\"https://wwd.com/fashion-news/sportswear/tommy-hilfiger-reveals-tommy-x-roblox-creators-virtual-collection-1235019532/\" rel=\"noopener noreferrer\" target=\"_blank\"><u>after learning users were already creating unofficial Tommy Hilfiger fashion</u></a> on the platform.</p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"164eab410e2823867e769386dc6afb78\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/lj3f2kffTes?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Introducing: Tommy X Roblox Creators</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">\n<a href=\"https://www.youtube.com/watch?v=lj3f2kffTes\" target=\"_blank\">www.youtube.com</a>\n</small>\n</p><p>While not as well known as Meta, Roblox, which claims over 200 million monthly active users (MAUs), is significantly ahead of Meta’s Horizon Worlds, which claimed 300,000 MAUs in February of 2022. Those users are spending, too: The company’s Q2 2022 report states <a href=\"https://ir.roblox.com/news/news-details/2022/Roblox-Reports-First-Quarter-2022-Financial-Results/default.aspx\" target=\"_blank\"><u>an average Roblox user spends about four dollars</u></a> every day they’re on the platform.<br/></p><p>Clearly, there’s a demand for fashion on metaverse platforms. And there may be another source of interest: young fashion designers.</p><p>“Starting a fashion label is expensive. It’s really, really hard, like starting any business,” said Odell. “You have to make a whole collection, and then show it, and it’s expensive. The metaverse solves for that.” </p><p>However, Odell is skeptical about Meta’s execution. Its rollout of features on other platforms, <a href=\"https://www.vox.com/the-goods/2020/8/18/21372510/instagram-reels-bad\" target=\"_blank\"><u>such as Instagram Reels</u></a>, have earned it a reputation for sudden pivots that can harm partners. She’s also unsure most designers will care until Meta’s metaverse is better established.</p><p>“The metaverse feels so far off,” says Odell. “I have such a hard time imagining anyone going to design school, then doing their first collection in the metaverse, and having that resonate.” </p><h2>Meta’s fashion may wear out more quickly than you think.</h2><p>Meta’s announcement of the Avatars Store was followed by <a href=\"https://www.facebook.com/zuck/posts/10114535743330641\" rel=\"noopener noreferrer\" target=\"_blank\"><u>a rebrand of Facebook Pay to Meta Pay</u></a> that positions it as “the wallet for the metaverse.” </p><p>Though the rebranding announcement was separate from the one for the Avatars Store, it’s possible to read between the lines. Meta wants to nail down the fundamentals of how user accounts, avatars, and monetization will work in the metaverse. </p><p>But <a href=\"https://www.linkedin.com/in/rafaelbrown/\" rel=\"noopener noreferrer\" target=\"_blank\"><u>Rafael Brown</u></a>, CEO of metaverse event company <a href=\"https://www.symbolzero.com/team\" target=\"_blank\">SymbolZero</a>, thinks Meta is too eager to move forward with a simple avatar solution that may not age well. “Oculus has shown more complex avatar systems than what they have now,” said Brown. “I think they dumbed it down a little bit.” </p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A crowd of Xbox avatars.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"d0704e8e9dd6b1880b8835a4aceb6b48\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"ecd72\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-crowd-of-xbox-avatars.png?id=30040244&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Game companies like Nintendo and Microsoft have found avatars difficult to maintain.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Microsoft</small></p><p>Brown points out that game companies have tried similar systems in the past. Nintendo, Xbox, and PlayStation all have avatars that can be personalized with a variety of clothing and accessories purchased or earned in-game. All three companies have had to change their avatar systems over time.</p><p>“This is something the metaverse standards are going to go into, because interoperability is a myth,” said Brown. “Anyone who thinks what they’re going to buy now on Quest 2 avatars is going to last, [...] that’s not going to happen. If [Meta is] telling people that everything they’ve bought is going to be maintained, well, nobody does that.”</p><p>Interoperability, in this context, means the ability to clothe your avatar 5, 10, or 20 years from now in the Thom Browne suit you purchase today, and possibly between different platforms. </p><p class=\"pull-quote\">“Anyone who thinks what they’re going to buy now on Quest 2 avatars is going to last, [...] that’s not going to happen.”<br/>—Rafael Brown, SymbolZero</p><p>That promise seems easy to make at first glance, but even a simple avatar can include hundreds of variables ranging from facial expression to skin color or hair style. More complex avatars, such as those that allow real-time tracking of a user’s facial expression, can include tens of thousands of variables.</p><p>Brown also thinks Meta has a more fundamental problem, one that touches on Odell’s concerns: a lack of community. </p><p>“The thing that a lot of Web3 folks don’t get is that it’s not that the clothing has inherent value,” said Brown. “It has value in relation to the community.” </p><p>A lack of community may be why Meta seems focused on the launch of the Avatars Store on Facebook and Instagram, which are far more popular than <a href=\"https://en.wikipedia.org/wiki/Horizon_Worlds\" target=\"_blank\">Horizon Worlds</a>—Meta’s online virtual-reality game created to promote their Oculus VR gear. Meta has yet to prove its vision of the metaverse can snag a critical mass of users. And without users, well—who will appreciate your virtual designer suit? </p>",
  "pubDate": "Fri, 01 Jul 2022 13:21:08 +0000",
  "guid": "https://spectrum.ieee.org/metaverse-fashion-roblox-meta",
  "category": [
    "Roblox",
    "Roblox creators",
    "Virtual reality",
    "Meta",
    "Fashion tech",
    "Metaverse"
  ],
  "dc:creator": "Matthew S. Smith",
  "media:content": ""
}