{
  "title": "549: Female Friendships and Male Vulnerability in Harry Potter",
  "link": "https://audioboom.com/posts/8027095",
  "itunes:episode": 549,
  "itunes:title": "Female Friendships and Male Vulnerability in Harry Potter",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4760,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>It's our annual Valentine's Day episode and this year we're switching things up to talk about the female friendships in the Harry Potter series!  So... Happy GALENTINE's Day! Hermione & Ginny, Ginny & Luna, and Lavender & Parvati are just a few of the pairings we dive deep into! Also, don't miss our Top 7 Moments Male Characters Were Emotionally Vulnerable! Next week, we're opening up our Muggle Mail bag, <a href=\"https://mugglecast.com/contact/\">so don't forget to send us your owls</a>!<br>\n<br>\n\n</div>\n<ul>\n<li>Don't forget to follow us on our new <a href=\"http://www.tiktok.com/@mugglecast\">TikTok</a>!</li>\n<li>It's Galentine's Day and we talk about the importance of female friendships in the Harry Potter series!</li>\n<li>Hermione and Ginny: are they best friends?</li>\n<li>Why are the two so mean towards Fleur?</li>\n<li>Sisterhood in Friendship: Ginny and Luna</li>\n<li>Why did these two characters bond so closely with each other?</li>\n<li>Support and Compassion: Lavender and Parvati & Tonks and Molly</li>\n<li>The Top 7 Moments Male Characters Were Emotionally Vulnerable in Harry Potter</li>\n<li>Harry, Ron, Draco, Hagrid, Dumbledore, Sirius and Dudley all make the list!</li>\n<li>Quizzitch: In Deathly Hallows, where are the trio camping while Ron leaves?  <a href=\"https://mugglecast.com/quizzitch/\">Submit your answer</a>!</li>\n<li>Eric and Micah appeared on the most recent episode of SpeakBeasty, talking about the character pairings in the latest Secrets of Dumbledore trailer - check it out!</li>\n<li>This week's episode is sponsored by BetterHelp (Go to <a href=\"http://www.betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a> for 10% off your first month) and MeUndies (get 25% off Matching Pairs for Valentine's Day, 15% off your first order, and free shipping at <a href=\"http://www.meundies.com/mugglecast\">MeUndies.com/MuggleCast </a>).</li>\n</ul>\n",
  "pubDate": "Tue, 08 Feb 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-02-07:/posts/8027095",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}