{
  "title": "TU89: Neurofluency – with Dr. Lou Cozolino, Applied Neuroscience Made Understandable",
  "link": "https://therapistuncensored.com/episodes/tu89-neurofluency-with-dr-lou-cozolino-applied-neuroscience-made-understandable/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu89-neurofluency-with-dr-lou-cozolino-applied-neuroscience-made-understandable",
  "pubDate": "Thu, 31 Jan 2019 03:48:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=6791",
  "description": "This episode breaks down neurofluency – the basics of neuroscience as it relates to being human in a relational world. This skill will help you with your boss, your teacher, your student, your child, you client or your spouse.\n\nRenowned author and therapist Lou Cozolino returns to Therapist Uncensored with co-host Sue Marriott for a breakdown of a concept he calls neurofluency. They describe what the key ingredients are for growth and why integration of different treatment forms can be crucial to healing.\n\nThis one is for true neuronerds, therapists and advanced “normals” – technical but also truly applied theory!\n\nIn this episode, TU89, we discuss:\n\n \tThe concept of neurofluency\n \tCortical integration – The importance of having a safe relationship and a capacity to regulate . You need to feel safe in order to have affect regulation, which you need to not have your cortical systems inhibited, and then you can add new information. Or when safe you can learn, when threatened you shut down any new updates to your old model, new learning, adaptation.\n \tCozolino offers his thoughts on EMDR treatment and the orienting response. This is different and interesting – check it out!\n \tNews:\n \tWe have three executive systems, not just cortical, like previously imagined. Now it’s recognized that we have the amygdal response system (most primitive, fight-or-flight), frontal parietal networks in the brain (organizes our experiences of space-time and how to navigate), and the default mode network (self awareness, empathy).\n \tLearn the one most associated w/ the attachment system\n \tHistorical background on Freud, who may have inhibited his own interest in the brain (despite being a neuroscientist) until a publication came out after his death.\n \tTherapist Uncensored has a page that says, “Neuroplasticity, Get Some.” We discuss what “neuroplasticity” is and what are the conditions that promote it?’\n \tThe psychology of distrusting leaders.\n \tIn relation to face to face therapy, touch therapy, somatic therapy, Cozolino believes that the main key is safety, in whatever capacity it comes. Learning how to think through the basic principles of plasticity to achieve change is the goal, and there’s no one right way to do that. Emotion has to be part of new learning.\n \tMain points:There are no set answers and don’t believe anyone who is telling you they have them.\n \tDon’t trust narcissistic leaders that insist on following their brand, or say their view is the right and only way to do treatment. That is not science, it is not integrated in history and the balance of science and practice, and we should be skeptical especially of those profiting from alleged “new ideas” in therapy. We should also be wary of those that follow such gurus.\n \tThe brain is a social organism so you have to have a broad view or conceptualization.\n \tYou have to get in touch with your own flexibility and tolerate the anxiety of your own ignorance. (We LOVE that!!!)\n \tPrevious and early Therapist Uncensored Episode #36, this with Patty Olwell and Lou Cozolino –\n\n \n\nLou Cozolino’s Biography:\n\nLouis Cozolino, PhD, is a professor of psychology at Pepperdine University and a private practitioner. He is the author of The Healthy Aging Brain: Sustaining Attachment, Attaining Wisdom (2008), The Neuroscience of Human Relationships: Attachment and the Developing Social Brain (2014), The Neuroscience of Psychotherapy: Healing the Social Brain (2010), and Why Therapy Works: Using Our Minds to Change Our Brains (2015), Timeless: Nature’s Formula for Health and Longevity (2018). He has several books and articles in press at this publication. His new\n\nDr. Cozolino has diverse clinical and research interests and hold degrees in philosophy, theology, and clinical psychology. His current interests are in the areas of the synthesis of neuroscience with psychotherapy, education, management, and leadership. In addition to multiple books,",
  "enclosure": "",
  "itunes:subtitle": "This episode breaks down neurofluency – the basics of neuroscience as it relates to being human in a relational world. This skill will help you with your boss, your teacher, your student, your child, you client or your spouse. -",
  "itunes:summary": "This episode breaks down and enhances your neurofluency - the basics of neuroscience as it relates to human beings in relationship.  This skill will help you with your boss, your teacher, your student, your child, you client or you spouse.  Learn to use the solid findings from interpersonal neuroscience in therapy on either side of the couch, as clinician or patient, and across varied life experiences.  Co-host Sue Marriott interviews Dr. Lou Cozolino, a master psychologist, researcher, and world renown author of a boat load of books and original articles on the subject.  Please hit play and enjoy!",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "50:34"
}