{
  "title": "Simulating Chutes & Ladders in Python",
  "link": "",
  "published": "2017-12-18T10:00:00-08:00",
  "updated": "2017-12-18T10:00:00-08:00",
  "author": {
    "name": "Jake VanderPlas"
  },
  "id": "tag:jakevdp.github.io,2017-12-18:blog/2017/12/18/simulating-chutes-and-ladders/",
  "summary": "<p><img src=\"http://jakevdp.github.io/images/ChutesAndLadders-sim.gif\" alt='[img: Chutes and Ladders animated simulation]'></p>\n<p>This weekend I found myself in a particularly drawn-out game of Chutes and Ladders with my four-year-old. If you've not had the pleasure of playing it, Chutes and Ladders (also sometimes known as <a href=\"https://en.wikipedia.org/wiki/Snakes_and_Ladders\">Snakes and Ladders</a>) is a classic kids board game wherein players roll a six-sided die to advance forward through 100 squares, using \"ladders\" to jump ahead, and avoiding \"chutes\" that send you backward. It's basically a glorified random walk with visual aids to help you build a narrative. Thrilling. But she's having fun practicing counting, learning to win and lose gracefully, and developing the requisite skills to be a <a href=\"https://xkcd.com/904/\">passionate sports fan</a>, so I play along.</p>\n<p>On the approximately twenty third game of the morning, as we found ourselves in a near endless cycle of climbing ladders and sliding down chutes, never quite reaching that final square to end the game, I started wondering how much longer the game could last: what is the expected length of a game? How heavy are the tails of the game length distribution? How succinctly could I answer those questions in Python? And then, at some point, it <a href=\"https://twitter.com/jakevdp/status/942456865580924928\">clicked</a>: Chutes and Ladders is memoryless — the effect of a roll depends only on where you are, not where you've been — and so it can be modeled as a Markov process! By the time we (finally) hit square 100, I basically had this blog post written, at least in my head.</p>\n<p>When I <a href=\"https://twitter.com/jakevdp/status/942456865580924928\">tweeted about this</a>, people pointed me to a <a href=\"http://www.datagenetics.com/blog/november12011/\">number</a> of <a href=\"https://gist.github.com/CamDavidsonPilon/1639d06c448904afaf7b7449910f3b72\">similar</a> <a href=\"https://math.byu.edu/~jeffh/mathematics/games/chutes/chutes.html\">treatments</a> of <a href=\"https://roycoding.github.io/chutes-ladders-d3/\">Chutes</a> &amp; <a href=\"https://scipython.com/book/chapter-6-numpy/additional-problems/analysing-snakes-and-ladders-as-a-markov-chain/\">Ladders</a>, so I'm under no illusion that this idea is original.\nThink of this as a blog post version of a dad joke: my primary goal is not originality, but self-entertainment, and if anyone else finds it entertaining that's just an added bonus.</p>",
  "category": [
    "",
    ""
  ]
}