{
  "guid": "urn:uuid:e287b6d7-945f-454c-bd31-cc04c565c7e8",
  "link": "https://www.who.int/news/item/28-03-2022-the-netherlands-and-who-partners-for-health-and-human-rights-around-the-world",
  "a10:author": {
    "a10:name": ""
  },
  "title": "The Netherlands and WHO: Partners for health and human rights around the world",
  "description": "<p>Minister of Foreign Trade and Development Cooperation of the Netherlands, Ms Liesje Schreinemacher, met for the first time with Dr Tedros Adhanom Ghebreyesus, WHO Director-General in WHO headquarters. The discussions focused on the strategic partnership\n    between WHO and the Netherlands in support of global health security and a healthier world for all.</p><p>&ldquo;It was an honor to welcome Minister Schreinemacher, and I express my deep gratitude to the Netherlands for its longstanding partnership with WHO. The Netherlands is a leading voice for health and human rights around the world, defending global\n    access to the full breadth of sexual and reproductive health services, including for vulnerable populations and people living in humanitarian crises,&rdquo; said Dr Tedros. &ldquo;The support of the Netherlands for WHO through flexible and catalytic\n    funding enables us to respond quickly and efficiently to global health challenges and health emergencies, including COVID-19, to save lives and prevent suffering.\"</p><p>The Netherlands is a key supporter and strategic partner of WHO. It funds crucial activities in the areas of sexual and reproductive health, water and sanitation, mental health in emergencies, emergency preparedness, tuberculosis, One Health, primary\n    health care, antimicrobial resistance, while facilitating cooperation with top Dutch institutions. Between 2020 &ndash; 2021, the Netherlands provided over US$ 94 million to WHO, including US$ 16 million in fully flexible Core Voluntary Contributions\n    making it the 4th largest flexible contributor to the Organization. Such support allows WHO to be both agile and strategic in its efforts to achieve the <a href=\"https://www.who.int/data/stories/the-triple-billion-targets-a-visual-summary-of-methods-to-deliver-impact\">Triple Billion targets</a> and support countries in improving the health and well-being of their populations.</p><p>The Netherlands is also the fourth largest contributor to WHO&rsquo;s <a href=\"https://www.who.int/emergencies/funding/contingency-fund-for-emergencies\">Contingency Fund for Emergencies</a>, which plays a critical role in helping WHO respond rapidly to disease outbreaks and other health emergencies around the world.</p><p>Learn more about the<a href=\"https://www.who.int/about/funding/contributors/nld\"> partnership between WHO and the Netherlands</a>.</p><div><br /><br /></div>",
  "pubDate": "Mon, 28 Mar 2022 11:32:36 Z"
}