{
  "title": "How Land Use Restrictions Make Housing Unaffordable with Emily Hamilton",
  "pubDate": "Fri, 21 Oct 2016 18:02:54 +0000",
  "guid": "6509cbbcdf423e6208592c2d3f1c6d8e",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EPHamilton_EDR.mp3",
  "itunes:image": "",
  "description": "<p>What follows is an edited transcript of my conversation with Emily Hamilton about land use regulations' effects on affordable housing.</p> <hr /> <p><strong>Petersen:</strong> My guest today is <a href= \"https://www.mercatus.org/emily-hamilton\" target=\"_blank\">Emily Hamilton</a>. She is a researcher at <a href= \"https://www.mercatus.org/\" target=\"_blank\">the Mercatus Center</a> at George Mason University. Emily, thanks for being on Economics Detective Radio.</p> <p><strong>Hamilton:</strong> Thanks a lot for having me.</p> <p><strong>Petersen:</strong> So, Emily recently wrote a paper titled <a href= \"https://www.mercatus.org/publication/how-land-use-regulation-undermines-affordable-housing\" target=\"_blank\">\"How Land Use Regulation Undermines Affordable Housing\"</a> along with her co-author Sanford Ikeda. The paper is a review of many studies looking at land use restrictions and it identifies four of the most common types of land use restrictions. Those are: minimum lots sizes, minimum parking requirements, inclusionary zoning, and urban growth boundaries. So Emily, could you tell us what each of those restrictions entail?</p> <p><strong>Hamilton:</strong> Sure. So, starting off with the first, minimum lots sizes. This is probably what people most commonly associate with zoning. It's the type of Euclidian zoning that separates residential areas from businesses and then within residential areas limits the number of units that can be on any certain size of land. And this is the most common tool that makes up what is sometimes referred to as Snob Zoning, where residents lobby for larger minimum lots sizes and larger house sizes to ensure that their neighbors are people who can afford only that minimum size of housing.</p> <p><strong>Petersen:</strong> So it keeps the poor away, effectively.</p> <p><strong>Hamilton:</strong> Exactly. And then parking requirements are often used as a tool to ensure that street parking doesn't get too congested. So when cars first became common, parking was really crazy where people would just leave their car on the street, maybe double parked, or in an inconvenient situation near their destination. And obviously as driving became more and more common and that was just an untenable situation and there had to be some sort of order to where people were allowed to park. But street parking remained typically free or underpriced relative to demand. So, people began lobbying for a parking requirement that would require business owners and residential developers to provide parking that was off streets so that this underpriced street parking remained available. But that brought us to today where we often have just mass seas of parking in retail areas and residential areas, which are paper focuses on. Parking substantially contributes to the cost of housing, making it inaccessible in some neighborhoods for low income people and driving up the cost of housing for everyone who has been using the amount of parking that their developer was required to provide.</p> <p><strong>Petersen:</strong> So that's one where you can really see the original justification. And it makes sense, if you have a business and a lot of people are parking and it spills over onto the street then maybe that's an externality. And it seems reasonable for you to have to provide parking for the people who come to your business, especially if a lot of them are driving there. But we push that too far, is what I'm hearing.</p> <div style=\"float: right; margin-left: 10px;\"><a href= \"https://www.amazon.com/High-Cost-Free-Parking-Updated/dp/193236496X/ref=as_li_ss_il?ie=UTF8&qid=1477071673&sr=8-1&keywords=donald+shoup&linkCode=li3&tag=economicsde0f-20&linkId=594b55910e2e25dfe8b33f7a4aa0a0e7\" target=\"_blank\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=193236496X&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20\" alt=\"\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&l=li3&o=1&a=193236496X\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p><strong>Hamilton:</strong> Exactly. Yeah, it does seem reasonable but the argument in favor of parking requirements tends to ignore that business owners have every incentive to make it easy to get to their business. So, in many cases there's not necessarily an externality because the business owner providing the parking has the right incentive to provide enough to make it easy for their customers to get there. The externality really comes up when we think about street parking and <a href=\"http://amzn.to/2ee7q1B\" target=\"_blank\">Donald Shoup</a>---probably the world's foremost expert on parking---has made the argument that pricing street parking according to demand is a real key in getting parking rules right.</p> <p><strong>Petersen:</strong> So, on to the next one. What is inclusionary zoning?</p> <p><strong>Hamilton:</strong> Inclusionary zoning is a rule that requires developers to make a certain number of units in a new development accessible to people at various income levels. Often inclusionary zoning is tied with density bonuses. So, a developer will have the choice to make a non-inclusionary project that is only allowed to have the regular amount of density that that lot is zoned for. Or, he can choose to take the inclusionary zoning density bonus which will allow him to build more units overall including the inclusionary unit and additional market-rate units. Typically, units are affordable to people who are making a certain percentage of the area median income, so people who might not have low income but who are making not enough to afford a market rate unit in their current neighborhood.</p> <p><strong>Petersen:</strong> Okay, so that's sort of forcing developers to build affordable units that they then will probably lose money on, so that they can build the market rate units that they can make money on.</p> <p><strong>Hamilton:</strong> Exactly. That's how cities make inclusionary zoning attractive to developers is by giving them that bonus that can allow them to build more market rate housing. In other cities, however, inclusionary zoning is required for all new developments so it really varies from jurisdiction to jurisdiction how it's implemented.</p> <p><strong>Petersen:</strong> So the fourth land use restriction you mention is urban growth boundaries. What are those?</p> <p><strong>Hamilton:</strong> So Oregon is the most famous example in the US of implementing an urban growth boundary. And what it is, is basically a state law that requires each city to set up a boundary around its edges, where for a certain amount of time no housing can be built outside of that boundary. And the idea is to gradually expand the city's footprint over time to allow the suburbs to expand a little further, but to restrict that suburban development using the boundary for some time period. Other examples like London's urban growth boundary I believe are permanent, so there are certain areas that can never be developed.</p> <p><strong>Petersen:</strong> So I believe we have something like this in Vancouver. We have farmland in the metro Vancouver area which---for context this area is one of the most overheated high-priced housing markets in the world---and we have this land that's just zoned for farms. And a lot of the time people don't even bother to plant crops, they're just holding the land for the day when eventually it can be rezoned into housing. So I looked it up before we went on and some of these plots are <a href= \"https://www.vancity.com/AboutVancity/News/MediaReleases/AgriculturalLandPricesIncrease-Apr6-2016/Vancity-Agricultural-Land-Report.pdf\" target=\"_blank\">$350,000 an acre</a>, which of course is not reflective of just how productive they are as farmland but of how productive they would be when they are eventually rezoned.</p> <p><strong>Hamilton:</strong> Exactly. Yes, very similar to Oregon's program. And a lot of empirical studies have been done on Portland's growth boundary because researchers can easily look at the block that are selling on either side of the boundary to see whether or not it's affecting land prices and several studies have found a very clear effect of the boundary in driving up the price of the land.</p> <p><strong>Petersen:</strong> And in Vancouver, the city is very reluctant to rezone. So, people are constantly applying and being denied but you know it's like winning the lottery having your bit of useless farmland rezoned to super high value housing. And people are just holding on to those dead lands in the hopes of winning that lottery which is kind of---it's a bizarre outcome.</p> <p><strong>Hamilton:</strong> It is. And urban growth boundary supporters often frame it as environmental regulation that's going to protect this open space. While encouraging people to live in more dense and transit and walkable friendly neighborhoods, but it's not as if Portland is free of other types of zoning rules. So at the same time it has this urban growth boundary it also has a lot of traditional zoning rules that limit the potential to build up while the growth boundary is limiting the potential to grow out. So it's coming from both directions.</p> <p><strong>Petersen:</strong> So, just how costly do economists think these regulations are? What kind of estimates do they have?</p> <p><strong>Hamilton:</strong> So, I think some of the most compelling estimates look at the macroeconomic effect of these rules. Because typically the most binding zoning rules are also in the most productive cities, where there's the highest level of demand for people to live. Because these are where the best jobs are as well as the best urban amenities, a lot of people want to live here. <a href=\"http://eml.berkeley.edu//~moretti/growth.pdf\" target=\"_blank\">One study</a> looking at this macroeconomic effect found that the three most productive cities which are New York, San Francisco, and San Jose---I should clarify; this is just looking at the effective growth within US---if those three cities lowered the burden of their land use regulation to that of the median American city it could result in a 9% increase in the level of US GDP. So, these rules are having just an enormous effect on economic growth. Not to mention the very substantial effect they have for individuals and making it difficult or impossible for people to afford to live in their desired location.</p> <p><strong>Petersen:</strong> So, you know, San Francisco that's where Silicon Valley is. And so we think of it as a place with super high productivity---tech workers working at Google---and yet with their housing market being one of the most restricted. So not only is there the loss from the housing market itself, that you could sell a lot of housing there and that would increase GDP by itself, but also there are people living in less productive areas doing less productive jobs, who could come and work for Google. But they can't because they've been priced out of the market. Is that where most of the effect comes from?</p> <p><strong>Hamilton:</strong> That's right. Yeah, I think the effect is also certainly at that top-end of the market where we're seeing all kinds of blog posts and articles about <a href= \"http://www.vox.com/2016/9/14/12892994/facebook-silicon-valley-expensive\" target=\"_blank\">a person making six figures at Facebook who can't afford the Bay area</a>. So those people might choose to go live in say Denver, or Austin, or a city that still has plenty of great jobs but isn't as productive as San Francisco or San Jose. But then we also see this down the income spectrum, where people who are in the service industry, say waiting tables, could make much more in San Francisco then they can in Houston, or wherever they happen to live. But their quality of life is much better in some of less productive cities because of the cost of housing and other areas of consumption that higher real estate costs drive up.</p> <p><strong>Petersen:</strong> One thing I've heard about a lot of these Californian coastal cities---I think it was Palo Alto---where not a single member of the Palo Alto Police Department lives in Palo Alto because you just can't live there on a policeman's salary, so they all have to commute in every day and then commute out every night.</p> <p><strong>Hamilton:</strong> Yeah, and for some of these hugely important needed services it just makes the quality of life of the people in those industries so much worse than it would be if they could afford to live closer to their job.</p> <p><strong>Petersen:</strong> Right. So, to summarize the labor market mobility of the United States in general has been greatly restricted by these land use restrictions. Even though the land use restrictions are local, this has an effect on the national economy.</p> <p><strong>Hamilton:</strong> Exactly right. And we can see this in the data where income convergence across areas of the country has greatly slowed down since the 1970's when these rules really started taking off.</p> <p><strong>Petersen:</strong> You argue that the costs of these restrictions fall primarily on low-income households so can you talk through how that happens?</p> <p><strong>Hamilton:</strong> Sure. It happens in two ways. First off, you have the low income people who are living in very expensive cities and these people might have to endure very long commutes---you talked about the police officer in Palo Alto who can't live anywhere near his job. Not that police officers are low income, but just as an example that illustrates the point. Or they have to live in very substandard housing, perhaps a group house that's just crammed with people maybe even illegally, in order to afford to live anywhere near where they're working.</p> <p><strong>Petersen:</strong> Yeah, I was going to say I thought those group houses were illegal from these very same land use regulations, but I guess people get around it.</p> <p><strong>Hamilton:</strong> Yeah, a lot of US cities have rules about the number of unrelated people who can live in a house. And certainly those rules are sometimes broken. That, I think, is clear to anyone who's spent time in an expensive city. You know, people have to live in these less than ideal conditions and waste too much of their time commuting in order to make that work. But the unseen version of it is the person who lives in a low-income part of the country and would like to improve their job opportunity and quality of life by moving to somewhere more productive, but they simply can't make it work so they stay in that low-income area without meeting their working potential.</p> <p><strong>Petersen:</strong> There was <a href= \"http://www.nber.org/papers/w21906\" target=\"_blank\">a study by David Autor</a>---I think I cited it in a previous episode and got the author name wrong but it's definitely David Autor---and it was looking at the shock, the trade shock that hit United States when it opened up trade with China in the early 2000's. And it basically showed that a lot of parts of the country just never recovered. So, if you worked in particular industries---I think the furniture industry was one that was basically wiped out---and if you worked in a town next to a furniture factory and that was your job, not only did you lose your job, you lost all the value in your home because the one industry in the town is gone. And you can't afford to move to one of the booming industries like Silicon Valley or in another part of the country because they've so greatly restricted the elasticity of their housing supply. And that's not all, Autor's paper basically just shows that it took a very long time to recover from the shock and a lot of places didn't recover at all. But I really think that housing is part of that picture if you're trying to figure out why the US economy can't respond to shocks like it used to in the 20th century. That has to be a big part of the picture.</p> <p><strong>Hamilton:</strong> Definitely. And that trend, as far as people being able to leave these depressed or economically stagnant areas, this also comes out in the income's convergence as we talked about earlier.</p> <p><strong>Petersen:</strong> So, the other part of that, I saw in your paper, was not only are poor people hurt but rich people who already own homes have seen those home prices rise. So it's affecting inequality at both ends of the spectrum, correct?</p> <div style=\"float: right; margin-left: 10px;\"><a href= \"https://www.amazon.com/Homevoter-Hypothesis-Influence-Government-Taxation-ebook/dp/B005INYLRC/ref=as_li_ss_il?ie=UTF8&qid=1477072180&sr=8-1&keywords=homevoter&linkCode=li3&tag=economicsde0f-20&linkId=0dfa64e7a199a7e102f08346c8feacba\" target=\"_blank\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B005INYLRC&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20\" alt=\"\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&l=li3&o=1&a=B005INYLRC\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p><strong>Hamilton:</strong> Right, Bill Fischel at Dartmouth has done a lot of work on why it is that people lobby so hard in favor of rules that restrict development. And he terms it as the <a href= \"http://amzn.to/2dtVYzJ\" target=\"_blank\">Homevoter Hypothesis</a>, where people who own homes have a huge amount of their wealth tied up in their home and so they are in favor of rules that protect that asset and prevent any shocks such as a huge amount of new development that could result in a decline in their homes value. I think you talked about that in your <a href= \"http://economicsdetective.com/2016/09/trailer-parks-zoning-market-urbanism-nolan-gray/\" target=\"_blank\">episode with Nolan Gray on trailer parks</a>.</p> <p><strong>Petersen:</strong> Yeah, we talked about William Fischel's Homevoter Hypothesis. So the essence of that is that people vote in local elections, and they lobby to restrict the supply of housing in their neighborhood, and that increases their wealth by, you know, increasing the land values in that area. How do you deal with that when there's such an entrenched special interest everywhere to push up land prices?</p> <p><strong>Hamilton:</strong> I think that's the hugely difficult problem. And at the same time as we have the challenges with the Homevoter system that Fischel plays out, we have a lot of federal policies that encourage homeownership as not just a good community-building tool but also as an investment. So people are programmed by the federal government to see their house as an investment in spite of economic challenges that it presents. David [Schleicher]---a law professor at Yale---has done some really interesting work on ways that institutional changes could limit the activity of homeowners and lobbying against new development. One of his proposals is called a <a href= \"http://object.cato.org/sites/cato.org/files/serials/files/regulation/2011/9/regv34n3-6.pdf\" target=\"_blank\">Zoning Budget</a>. And under a zoning budget, municipalities would have to allow a certain amount of population growth each year. So, they could designate areas of a city that are going to only be home to single family homes, but within some parts of the city, they would have to allow building growth to accommodate a growing population.</p> <p><strong>Petersen:</strong> How would that be enforced, though?</p> <p><strong>Hamilton:</strong> It would have to be a state law, or perhaps a federal law, but I think much more likely a state law that would mandate that localities do that. Massachusetts recently passed a law that requires all jurisdictions within the state to allow at least some multifamily housing. So it's kind of a similar idea. The state government can set a floor on how much local government can restrict development.</p> <p><strong>Petersen:</strong> So, what I'm hearing is that different levels of government have different incentives with respect to restrictions. So, at the lowest level if I'm just in a small district or municipal area and I can restrict what my neighbors build on their property, that really affects my home price and that's the main thing that I'm going to lobby for at that level of government. But if I had to go all the way to the state government to try to push up house prices in my neighborhood, it wouldn't go so well. The state government has incentives to allow more people to live within their boundaries. Is that the gist of it?</p> <p><strong>Hamilton:</strong> Yeah, that's right. It's easy to imagine a mayor of a fancy suburban community who simply represents his constituents' views that the community already has enough people, you know, life there is good and so nothing needs to change. But, I don't think that you'd find a Governor that would say \"Our state doesn't need any more people or economic growth.\" So the incentives are less in favor of homeowners, local homeowners, the further up you go from the local to state jurisdiction.</p> <p><strong>Petersen:</strong> Right. I guess a big issue is that the people who would like to move somewhere but live somewhere else don't get to vote in that place's elections or in their ballot measures. And so there's this group that has an interest in lower housing costs because they might move to your city or your town, if they could afford it, but they're not represented politically in that city or town and so they can't vote for more housing and lower prices. But then when you go to the whole state level and people are mobile within a state, those people do have a say or they are represented and pricing them out of the places they'd like to live really is bad for politics, bad for getting their votes.</p> <p><strong>Hamilton:</strong> Right. So the Palo Alto police officer can't vote to change Palo Alto's policies but he can vote to change California policy.</p> <p><strong>Petersen:</strong> Right, because he still lives within California. So one of the other policy recommendations I saw in your paper is tax increment local transfers or TILTs. What are they and how can they impact land use restrictions?</p> <p><strong>Hamilton:</strong> That's another idea that comes from David Schleicher and I think it's another really interesting concept. The idea behind TILT is that a new development increases the property tax base within a jurisdiction. So, if you have a neighborhood, say a block full of single family homes that is allowed to be sold to a developer in order to build a couple of large apartment buildings, each apartment is going to be less expensive than the previous single family homes, but overall the apartment buildings will contribute more to property tax. And the idea behind a TILT is that part of this tax increment---which is the difference between the new tax base and the previous smaller tax base---could be shared with neighbors to the new development to kind of buy off their support for the development. So, those people who are in some sense harmed by the new buildings, whether in terms of more traffic or a change in their neighborhood's character, also benefit from the new building financially. So they're more likely to support it.</p> <p><strong>Petersen:</strong> So economists talk about Potential Pareto Improvements, where you have a situation where some people are made better off while other people are worse off, but you could have a transfer to make everyone better off. And what I'm hearing with TILTs is you actually do that transfer, you actually pay off the losers with some of the surplus you get from the winners. So everyone can be better off when you make this overall beneficial change.</p> <p><strong>Hamilton:</strong> Exactly. And sometimes communities do use community benefit as a tool to try to get developers to share their windfall and build a new project with the neighborhood. So they might say, \"you can build an apartment building here, but you also have to build a swimming pool that the whole neighborhood can use at this other location,\" and in a way that achieves the end goal of buying off community support for new development. But it also drives up the cost of the new housing that the developer can provide. So TILTs have the advantage of keeping the cost of building the same for the developer, but still sharing that financial windfall of the new development with a broader group of people.</p> <p><strong>Petersen:</strong> Yeah, I really like these policy recommendations. It would be so easy to just say \"land use restrictions are bad, let's not have those anymore.\" But these really have an eye to the political structures that we currently have and towards making progress within the structure we have. So I like that approach to policy or to policy recommendations. I think economists should maybe do that more often.</p> <p><strong>Hamilton:</strong> Yeah, looking for a win-win outcome.</p> <p><strong>Petersen:</strong> The one other one that I don't think we've talked about is home equity insurance, which sounds like a business plan more than a policy proposal. But how can home equity insurance help to reduce the costs of land use restrictions?</p> <p><strong>Hamilton:</strong> That proposal also came from Bill Fischel a couple of decades ago following on his work of the Homevoters theory. He proposed the idea that the reason home owners are so opposed to new development is often because they have so much of their financial wealth tied up in this house that they're not just opposed to a loss in their investment, but even more so, opposed to risk. So they want the policies that they see will limit the variance in their home equity and he proposed home equity insurance as a financial goal that could lower this threat and provide homeowners with a minimum amount of equity that they would have regardless to the new development. I think it's a really interesting concept but it's unclear, would this be a private financial product? Obviously the market isn't currently providing it, or would it be some kind of government policy? And while I do think it's very interesting, I think that we should be somewhat leery of new government policies that promote homeownership as a financial wealth building tool.</p> <p><strong>Petersen:</strong> Well, the funny thing is that usually with insurance, if you have fire insurance you want to minimize the moral hazard of that, you don't want people to say: \"Well I've got fire insurance so I don't have to worry about fires anymore.\" But with this, you sort of want that, you have insurance on the value of your home and then actually your goal is to make people less worried about the value of their home so that they will be okay with policies that reduce it. It's almost the opposite of what you want with insurance most of the time. In this case you want to maximize moral hazard.</p> <p><strong>Hamilton:</strong> Yeah that's a great point and I think that's why it could only be a government product.</p> <p><strong>Petersen:</strong> Right. Because if the private sector was providing home price insurance to homeowners then the company that provided the insurance would now have an incentive to lobby against upzoning the neighborhood.</p> <p><strong>Hamilton:</strong> Exactly. Yeah it would create a new a new group of NIMBYs.</p> <p><strong>Petersen:</strong> Yeah, at first I thought 'Oh great!', well this is something that we can just do, without the government. You can just get a bunch of people together, who have an interest in making cities more livable and they can provide this financial asset. But that seems like there are problems with it that are hard to overcome within the private sector. So overall do you think the tide might be turning on the NIMBYs? Are people becoming more aware of this issue and of land use restrictions and their effects on housing prices?</p> <p><strong>Hamilton:</strong> I do think awareness is growing. There's a group popping up called YIMBY which stands for \"Yes In My Backyard\" as opposed to the suburban NIMBY to say \"Not In My Backyard\" to any sort of new development. And these YIMBY groups are gaining some traction in cities like San Francisco and lobbying in favor of new development to counter the voices that oppose new development. I am somewhat pessimistic, I have to say, just because from a public choice standpoint the forces in favor of land use regulations that limit housing are so powerful. But in spite of my pessimism, I'm seeing since the time that I started working on this issue several years ago, much more coverage of the issue from all kinds of media outlets, as well as much more interest in on-the-ground politics from people who aren't in the typical homeowner category.</p> <p><strong>Petersen:</strong> Yeah, and I am hopeful too. But I often see people blame other factors for high home prices. They blame the speculators. The speculators are always the ones that are pushing up home prices. And rarely, I think, do people blame restrictions, although the YIMBY movement is a happy exception to that.</p> <p><strong>Hamilton:</strong> Yeah, I think way too often real estate developers are framed as the enemy in these debates because they're the ones who make money off building new housing. But it's really the regulations that are to blame both for the inordinate profits that developers can make in expensive cities, and for the high costs of housing.</p> <p><strong>Petersen:</strong> Do you have any closing thoughts about land use restrictions?</p> <p><strong>Hamilton:</strong> I think that it's just really important to try to spread the message about the costs that these regulations have. Not just for low-income people but for the whole country and world economic growth. That's obviously a cause that I would think everyone would be behind: creating opportunity for people to live in the most productive cities where they can contribute the most to society and to the economy.</p> <p><strong>Petersen:</strong> My guest today has been Emily Hamilton. Emily, thanks for being part of Economics Detective Radio.</p> <p><strong>Hamilton:</strong> Thanks a lot for having me.</p> <hr /> <p> </p>",
  "content:encoded": "<p>What follows is an edited transcript of my conversation with Emily Hamilton about land use regulations' effects on affordable housing.</p>  <p>Petersen: My guest today is <a href= \"https://www.mercatus.org/emily-hamilton\" target=\"_blank\">Emily Hamilton</a>. She is a researcher at <a href= \"https://www.mercatus.org/\" target=\"_blank\">the Mercatus Center</a> at George Mason University. Emily, thanks for being on Economics Detective Radio.</p> <p>Hamilton: Thanks a lot for having me.</p> <p>Petersen: So, Emily recently wrote a paper titled <a href= \"https://www.mercatus.org/publication/how-land-use-regulation-undermines-affordable-housing\" target=\"_blank\">\"How Land Use Regulation Undermines Affordable Housing\"</a> along with her co-author Sanford Ikeda. The paper is a review of many studies looking at land use restrictions and it identifies four of the most common types of land use restrictions. Those are: minimum lots sizes, minimum parking requirements, inclusionary zoning, and urban growth boundaries. So Emily, could you tell us what each of those restrictions entail?</p> <p>Hamilton: Sure. So, starting off with the first, minimum lots sizes. This is probably what people most commonly associate with zoning. It's the type of Euclidian zoning that separates residential areas from businesses and then within residential areas limits the number of units that can be on any certain size of land. And this is the most common tool that makes up what is sometimes referred to as Snob Zoning, where residents lobby for larger minimum lots sizes and larger house sizes to ensure that their neighbors are people who can afford only that minimum size of housing.</p> <p>Petersen: So it keeps the poor away, effectively.</p> <p>Hamilton: Exactly. And then parking requirements are often used as a tool to ensure that street parking doesn't get too congested. So when cars first became common, parking was really crazy where people would just leave their car on the street, maybe double parked, or in an inconvenient situation near their destination. And obviously as driving became more and more common and that was just an untenable situation and there had to be some sort of order to where people were allowed to park. But street parking remained typically free or underpriced relative to demand. So, people began lobbying for a parking requirement that would require business owners and residential developers to provide parking that was off streets so that this underpriced street parking remained available. But that brought us to today where we often have just mass seas of parking in retail areas and residential areas, which are paper focuses on. Parking substantially contributes to the cost of housing, making it inaccessible in some neighborhoods for low income people and driving up the cost of housing for everyone who has been using the amount of parking that their developer was required to provide.</p> <p>Petersen: So that's one where you can really see the original justification. And it makes sense, if you have a business and a lot of people are parking and it spills over onto the street then maybe that's an externality. And it seems reasonable for you to have to provide parking for the people who come to your business, especially if a lot of them are driving there. But we push that too far, is what I'm hearing.</p> <a href= \"https://www.amazon.com/High-Cost-Free-Parking-Updated/dp/193236496X/ref=as_li_ss_il?ie=UTF8&qid=1477071673&sr=8-1&keywords=donald+shoup&linkCode=li3&tag=economicsde0f-20&linkId=594b55910e2e25dfe8b33f7a4aa0a0e7\" target=\"_blank\"></a> <p>Hamilton: Exactly. Yeah, it does seem reasonable but the argument in favor of parking requirements tends to ignore that business owners have every incentive to make it easy to get to their business. So, in many cases there's not necessarily an externality because the business owner providing the parking has the right incentive to provide enough to make it easy for their customers to get there. The externality really comes up when we think about street parking and <a href=\"http://amzn.to/2ee7q1B\" target=\"_blank\">Donald Shoup</a>---probably the world's foremost expert on parking---has made the argument that pricing street parking according to demand is a real key in getting parking rules right.</p> <p>Petersen: So, on to the next one. What is inclusionary zoning?</p> <p>Hamilton: Inclusionary zoning is a rule that requires developers to make a certain number of units in a new development accessible to people at various income levels. Often inclusionary zoning is tied with density bonuses. So, a developer will have the choice to make a non-inclusionary project that is only allowed to have the regular amount of density that that lot is zoned for. Or, he can choose to take the inclusionary zoning density bonus which will allow him to build more units overall including the inclusionary unit and additional market-rate units. Typically, units are affordable to people who are making a certain percentage of the area median income, so people who might not have low income but who are making not enough to afford a market rate unit in their current neighborhood.</p> <p>Petersen: Okay, so that's sort of forcing developers to build affordable units that they then will probably lose money on, so that they can build the market rate units that they can make money on.</p> <p>Hamilton: Exactly. That's how cities make inclusionary zoning attractive to developers is by giving them that bonus that can allow them to build more market rate housing. In other cities, however, inclusionary zoning is required for all new developments so it really varies from jurisdiction to jurisdiction how it's implemented.</p> <p>Petersen: So the fourth land use restriction you mention is urban growth boundaries. What are those?</p> <p>Hamilton: So Oregon is the most famous example in the US of implementing an urban growth boundary. And what it is, is basically a state law that requires each city to set up a boundary around its edges, where for a certain amount of time no housing can be built outside of that boundary. And the idea is to gradually expand the city's footprint over time to allow the suburbs to expand a little further, but to restrict that suburban development using the boundary for some time period. Other examples like London's urban growth boundary I believe are permanent, so there are certain areas that can never be developed.</p> <p>Petersen: So I believe we have something like this in Vancouver. We have farmland in the metro Vancouver area which---for context this area is one of the most overheated high-priced housing markets in the world---and we have this land that's just zoned for farms. And a lot of the time people don't even bother to plant crops, they're just holding the land for the day when eventually it can be rezoned into housing. So I looked it up before we went on and some of these plots are <a href= \"https://www.vancity.com/AboutVancity/News/MediaReleases/AgriculturalLandPricesIncrease-Apr6-2016/Vancity-Agricultural-Land-Report.pdf\" target=\"_blank\">$350,000 an acre</a>, which of course is not reflective of just how productive they are as farmland but of how productive they would be when they are eventually rezoned.</p> <p>Hamilton: Exactly. Yes, very similar to Oregon's program. And a lot of empirical studies have been done on Portland's growth boundary because researchers can easily look at the block that are selling on either side of the boundary to see whether or not it's affecting land prices and several studies have found a very clear effect of the boundary in driving up the price of the land.</p> <p>Petersen: And in Vancouver, the city is very reluctant to rezone. So, people are constantly applying and being denied but you know it's like winning the lottery having your bit of useless farmland rezoned to super high value housing. And people are just holding on to those dead lands in the hopes of winning that lottery which is kind of---it's a bizarre outcome.</p> <p>Hamilton: It is. And urban growth boundary supporters often frame it as environmental regulation that's going to protect this open space. While encouraging people to live in more dense and transit and walkable friendly neighborhoods, but it's not as if Portland is free of other types of zoning rules. So at the same time it has this urban growth boundary it also has a lot of traditional zoning rules that limit the potential to build up while the growth boundary is limiting the potential to grow out. So it's coming from both directions.</p> <p>Petersen: So, just how costly do economists think these regulations are? What kind of estimates do they have?</p> <p>Hamilton: So, I think some of the most compelling estimates look at the macroeconomic effect of these rules. Because typically the most binding zoning rules are also in the most productive cities, where there's the highest level of demand for people to live. Because these are where the best jobs are as well as the best urban amenities, a lot of people want to live here. <a href=\"http://eml.berkeley.edu//~moretti/growth.pdf\" target=\"_blank\">One study</a> looking at this macroeconomic effect found that the three most productive cities which are New York, San Francisco, and San Jose---I should clarify; this is just looking at the effective growth within US---if those three cities lowered the burden of their land use regulation to that of the median American city it could result in a 9% increase in the level of US GDP. So, these rules are having just an enormous effect on economic growth. Not to mention the very substantial effect they have for individuals and making it difficult or impossible for people to afford to live in their desired location.</p> <p>Petersen: So, you know, San Francisco that's where Silicon Valley is. And so we think of it as a place with super high productivity---tech workers working at Google---and yet with their housing market being one of the most restricted. So not only is there the loss from the housing market itself, that you could sell a lot of housing there and that would increase GDP by itself, but also there are people living in less productive areas doing less productive jobs, who could come and work for Google. But they can't because they've been priced out of the market. Is that where most of the effect comes from?</p> <p>Hamilton: That's right. Yeah, I think the effect is also certainly at that top-end of the market where we're seeing all kinds of blog posts and articles about <a href= \"http://www.vox.com/2016/9/14/12892994/facebook-silicon-valley-expensive\" target=\"_blank\">a person making six figures at Facebook who can't afford the Bay area</a>. So those people might choose to go live in say Denver, or Austin, or a city that still has plenty of great jobs but isn't as productive as San Francisco or San Jose. But then we also see this down the income spectrum, where people who are in the service industry, say waiting tables, could make much more in San Francisco then they can in Houston, or wherever they happen to live. But their quality of life is much better in some of less productive cities because of the cost of housing and other areas of consumption that higher real estate costs drive up.</p> <p>Petersen: One thing I've heard about a lot of these Californian coastal cities---I think it was Palo Alto---where not a single member of the Palo Alto Police Department lives in Palo Alto because you just can't live there on a policeman's salary, so they all have to commute in every day and then commute out every night.</p> <p>Hamilton: Yeah, and for some of these hugely important needed services it just makes the quality of life of the people in those industries so much worse than it would be if they could afford to live closer to their job.</p> <p>Petersen: Right. So, to summarize the labor market mobility of the United States in general has been greatly restricted by these land use restrictions. Even though the land use restrictions are local, this has an effect on the national economy.</p> <p>Hamilton: Exactly right. And we can see this in the data where income convergence across areas of the country has greatly slowed down since the 1970's when these rules really started taking off.</p> <p>Petersen: You argue that the costs of these restrictions fall primarily on low-income households so can you talk through how that happens?</p> <p>Hamilton: Sure. It happens in two ways. First off, you have the low income people who are living in very expensive cities and these people might have to endure very long commutes---you talked about the police officer in Palo Alto who can't live anywhere near his job. Not that police officers are low income, but just as an example that illustrates the point. Or they have to live in very substandard housing, perhaps a group house that's just crammed with people maybe even illegally, in order to afford to live anywhere near where they're working.</p> <p>Petersen: Yeah, I was going to say I thought those group houses were illegal from these very same land use regulations, but I guess people get around it.</p> <p>Hamilton: Yeah, a lot of US cities have rules about the number of unrelated people who can live in a house. And certainly those rules are sometimes broken. That, I think, is clear to anyone who's spent time in an expensive city. You know, people have to live in these less than ideal conditions and waste too much of their time commuting in order to make that work. But the unseen version of it is the person who lives in a low-income part of the country and would like to improve their job opportunity and quality of life by moving to somewhere more productive, but they simply can't make it work so they stay in that low-income area without meeting their working potential.</p> <p>Petersen: There was <a href= \"http://www.nber.org/papers/w21906\" target=\"_blank\">a study by David Autor</a>---I think I cited it in a previous episode and got the author name wrong but it's definitely David Autor---and it was looking at the shock, the trade shock that hit United States when it opened up trade with China in the early 2000's. And it basically showed that a lot of parts of the country just never recovered. So, if you worked in particular industries---I think the furniture industry was one that was basically wiped out---and if you worked in a town next to a furniture factory and that was your job, not only did you lose your job, you lost all the value in your home because the one industry in the town is gone. And you can't afford to move to one of the booming industries like Silicon Valley or in another part of the country because they've so greatly restricted the elasticity of their housing supply. And that's not all, Autor's paper basically just shows that it took a very long time to recover from the shock and a lot of places didn't recover at all. But I really think that housing is part of that picture if you're trying to figure out why the US economy can't respond to shocks like it used to in the 20th century. That has to be a big part of the picture.</p> <p>Hamilton: Definitely. And that trend, as far as people being able to leave these depressed or economically stagnant areas, this also comes out in the income's convergence as we talked about earlier.</p> <p>Petersen: So, the other part of that, I saw in your paper, was not only are poor people hurt but rich people who already own homes have seen those home prices rise. So it's affecting inequality at both ends of the spectrum, correct?</p> <a href= \"https://www.amazon.com/Homevoter-Hypothesis-Influence-Government-Taxation-ebook/dp/B005INYLRC/ref=as_li_ss_il?ie=UTF8&qid=1477072180&sr=8-1&keywords=homevoter&linkCode=li3&tag=economicsde0f-20&linkId=0dfa64e7a199a7e102f08346c8feacba\" target=\"_blank\"></a> <p>Hamilton: Right, Bill Fischel at Dartmouth has done a lot of work on why it is that people lobby so hard in favor of rules that restrict development. And he terms it as the <a href= \"http://amzn.to/2dtVYzJ\" target=\"_blank\">Homevoter Hypothesis</a>, where people who own homes have a huge amount of their wealth tied up in their home and so they are in favor of rules that protect that asset and prevent any shocks such as a huge amount of new development that could result in a decline in their homes value. I think you talked about that in your <a href= \"http://economicsdetective.com/2016/09/trailer-parks-zoning-market-urbanism-nolan-gray/\" target=\"_blank\">episode with Nolan Gray on trailer parks</a>.</p> <p>Petersen: Yeah, we talked about William Fischel's Homevoter Hypothesis. So the essence of that is that people vote in local elections, and they lobby to restrict the supply of housing in their neighborhood, and that increases their wealth by, you know, increasing the land values in that area. How do you deal with that when there's such an entrenched special interest everywhere to push up land prices?</p> <p>Hamilton: I think that's the hugely difficult problem. And at the same time as we have the challenges with the Homevoter system that Fischel plays out, we have a lot of federal policies that encourage homeownership as not just a good community-building tool but also as an investment. So people are programmed by the federal government to see their house as an investment in spite of economic challenges that it presents. David [Schleicher]---a law professor at Yale---has done some really interesting work on ways that institutional changes could limit the activity of homeowners and lobbying against new development. One of his proposals is called a <a href= \"http://object.cato.org/sites/cato.org/files/serials/files/regulation/2011/9/regv34n3-6.pdf\" target=\"_blank\">Zoning Budget</a>. And under a zoning budget, municipalities would have to allow a certain amount of population growth each year. So, they could designate areas of a city that are going to only be home to single family homes, but within some parts of the city, they would have to allow building growth to accommodate a growing population.</p> <p>Petersen: How would that be enforced, though?</p> <p>Hamilton: It would have to be a state law, or perhaps a federal law, but I think much more likely a state law that would mandate that localities do that. Massachusetts recently passed a law that requires all jurisdictions within the state to allow at least some multifamily housing. So it's kind of a similar idea. The state government can set a floor on how much local government can restrict development.</p> <p>Petersen: So, what I'm hearing is that different levels of government have different incentives with respect to restrictions. So, at the lowest level if I'm just in a small district or municipal area and I can restrict what my neighbors build on their property, that really affects my home price and that's the main thing that I'm going to lobby for at that level of government. But if I had to go all the way to the state government to try to push up house prices in my neighborhood, it wouldn't go so well. The state government has incentives to allow more people to live within their boundaries. Is that the gist of it?</p> <p>Hamilton: Yeah, that's right. It's easy to imagine a mayor of a fancy suburban community who simply represents his constituents' views that the community already has enough people, you know, life there is good and so nothing needs to change. But, I don't think that you'd find a Governor that would say \"Our state doesn't need any more people or economic growth.\" So the incentives are less in favor of homeowners, local homeowners, the further up you go from the local to state jurisdiction.</p> <p>Petersen: Right. I guess a big issue is that the people who would like to move somewhere but live somewhere else don't get to vote in that place's elections or in their ballot measures. And so there's this group that has an interest in lower housing costs because they might move to your city or your town, if they could afford it, but they're not represented politically in that city or town and so they can't vote for more housing and lower prices. But then when you go to the whole state level and people are mobile within a state, those people do have a say or they are represented and pricing them out of the places they'd like to live really is bad for politics, bad for getting their votes.</p> <p>Hamilton: Right. So the Palo Alto police officer can't vote to change Palo Alto's policies but he can vote to change California policy.</p> <p>Petersen: Right, because he still lives within California. So one of the other policy recommendations I saw in your paper is tax increment local transfers or TILTs. What are they and how can they impact land use restrictions?</p> <p>Hamilton: That's another idea that comes from David Schleicher and I think it's another really interesting concept. The idea behind TILT is that a new development increases the property tax base within a jurisdiction. So, if you have a neighborhood, say a block full of single family homes that is allowed to be sold to a developer in order to build a couple of large apartment buildings, each apartment is going to be less expensive than the previous single family homes, but overall the apartment buildings will contribute more to property tax. And the idea behind a TILT is that part of this tax increment---which is the difference between the new tax base and the previous smaller tax base---could be shared with neighbors to the new development to kind of buy off their support for the development. So, those people who are in some sense harmed by the new buildings, whether in terms of more traffic or a change in their neighborhood's character, also benefit from the new building financially. So they're more likely to support it.</p> <p>Petersen: So economists talk about Potential Pareto Improvements, where you have a situation where some people are made better off while other people are worse off, but you could have a transfer to make everyone better off. And what I'm hearing with TILTs is you actually do that transfer, you actually pay off the losers with some of the surplus you get from the winners. So everyone can be better off when you make this overall beneficial change.</p> <p>Hamilton: Exactly. And sometimes communities do use community benefit as a tool to try to get developers to share their windfall and build a new project with the neighborhood. So they might say, \"you can build an apartment building here, but you also have to build a swimming pool that the whole neighborhood can use at this other location,\" and in a way that achieves the end goal of buying off community support for new development. But it also drives up the cost of the new housing that the developer can provide. So TILTs have the advantage of keeping the cost of building the same for the developer, but still sharing that financial windfall of the new development with a broader group of people.</p> <p>Petersen: Yeah, I really like these policy recommendations. It would be so easy to just say \"land use restrictions are bad, let's not have those anymore.\" But these really have an eye to the political structures that we currently have and towards making progress within the structure we have. So I like that approach to policy or to policy recommendations. I think economists should maybe do that more often.</p> <p>Hamilton: Yeah, looking for a win-win outcome.</p> <p>Petersen: The one other one that I don't think we've talked about is home equity insurance, which sounds like a business plan more than a policy proposal. But how can home equity insurance help to reduce the costs of land use restrictions?</p> <p>Hamilton: That proposal also came from Bill Fischel a couple of decades ago following on his work of the Homevoters theory. He proposed the idea that the reason home owners are so opposed to new development is often because they have so much of their financial wealth tied up in this house that they're not just opposed to a loss in their investment, but even more so, opposed to risk. So they want the policies that they see will limit the variance in their home equity and he proposed home equity insurance as a financial goal that could lower this threat and provide homeowners with a minimum amount of equity that they would have regardless to the new development. I think it's a really interesting concept but it's unclear, would this be a private financial product? Obviously the market isn't currently providing it, or would it be some kind of government policy? And while I do think it's very interesting, I think that we should be somewhat leery of new government policies that promote homeownership as a financial wealth building tool.</p> <p>Petersen: Well, the funny thing is that usually with insurance, if you have fire insurance you want to minimize the moral hazard of that, you don't want people to say: \"Well I've got fire insurance so I don't have to worry about fires anymore.\" But with this, you sort of want that, you have insurance on the value of your home and then actually your goal is to make people less worried about the value of their home so that they will be okay with policies that reduce it. It's almost the opposite of what you want with insurance most of the time. In this case you want to maximize moral hazard.</p> <p>Hamilton: Yeah that's a great point and I think that's why it could only be a government product.</p> <p>Petersen: Right. Because if the private sector was providing home price insurance to homeowners then the company that provided the insurance would now have an incentive to lobby against upzoning the neighborhood.</p> <p>Hamilton: Exactly. Yeah it would create a new a new group of NIMBYs.</p> <p>Petersen: Yeah, at first I thought 'Oh great!', well this is something that we can just do, without the government. You can just get a bunch of people together, who have an interest in making cities more livable and they can provide this financial asset. But that seems like there are problems with it that are hard to overcome within the private sector. So overall do you think the tide might be turning on the NIMBYs? Are people becoming more aware of this issue and of land use restrictions and their effects on housing prices?</p> <p>Hamilton: I do think awareness is growing. There's a group popping up called YIMBY which stands for \"Yes In My Backyard\" as opposed to the suburban NIMBY to say \"Not In My Backyard\" to any sort of new development. And these YIMBY groups are gaining some traction in cities like San Francisco and lobbying in favor of new development to counter the voices that oppose new development. I am somewhat pessimistic, I have to say, just because from a public choice standpoint the forces in favor of land use regulations that limit housing are so powerful. But in spite of my pessimism, I'm seeing since the time that I started working on this issue several years ago, much more coverage of the issue from all kinds of media outlets, as well as much more interest in on-the-ground politics from people who aren't in the typical homeowner category.</p> <p>Petersen: Yeah, and I am hopeful too. But I often see people blame other factors for high home prices. They blame the speculators. The speculators are always the ones that are pushing up home prices. And rarely, I think, do people blame restrictions, although the YIMBY movement is a happy exception to that.</p> <p>Hamilton: Yeah, I think way too often real estate developers are framed as the enemy in these debates because they're the ones who make money off building new housing. But it's really the regulations that are to blame both for the inordinate profits that developers can make in expensive cities, and for the high costs of housing.</p> <p>Petersen: Do you have any closing thoughts about land use restrictions?</p> <p>Hamilton: I think that it's just really important to try to spread the message about the costs that these regulations have. Not just for low-income people but for the whole country and world economic growth. That's obviously a cause that I would think everyone would be behind: creating opportunity for people to live in the most productive cities where they can contribute the most to society and to the economy.</p> <p>Petersen: My guest today has been Emily Hamilton. Emily, thanks for being part of Economics Detective Radio.</p> <p>Hamilton: Thanks a lot for having me.</p>  <p> </p>",
  "enclosure": "",
  "itunes:duration": "32:36",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What follows is an edited transcript of my conversation with Emily Hamilton about land use regulations' effects on affordable housing.  Petersen: My guest today is . She is a researcher at  at George Mason University. Emily, thanks for being on..."
}