{
  "title": "Geothermal May Beat Batteries for Energy Storage",
  "link": "https://spectrum.ieee.org/geothermal-energy",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/illustration-of-a-mountain-scene-with-different-types-of-energy-sources.jpg?id=31887415&width=1245&height=700&coordinates=0%2C121%2C0%2C122\"/><br/><br/><p>Geothermal systems carry warmth from Earth’s interior up to the surface for heating or electricity. But geothermal power plants are expensive to build, and will get even less economically viable as wind and solar power get cheaper and more plentiful. However, even as wind and solar grow, so does the need to store electricity from those temperamental sources.</p><p>A new proposal could solve those issues and bolster all three renewable technologies. The idea is simple—use advanced geothermal reservoirs to store excess wind and solar power in the form of hot water or steam, and <a href=\"https://spectrum.ieee.org/oil-wells-as-solar-thermal-wellsprings\" target=\"_self\">bring up that heat</a> when wind and solar aren’t available, to turn turbines for electricity.</p><hr/><p>“It would allow next-generation geothermal plants to break from the traditional baseload operating paradigm and earn much greater value as suppliers of wind and solar,” says <a href=\"https://mae.princeton.edu/about-mae/spotlight/wilson-ricks-sustaining-energy-our-future\" target=\"_blank\">Wilson Ricks</a>, a graduate student in mechanical and aerospace engineering at Princeton University. </p><p>Ricks, his Ph.D. advisor <a href=\"https://mae.princeton.edu/people/faculty/jenkins\" target=\"_blank\">Jesse Jenkins</a>, and <a href=\"https://www.linkedin.com/in/jack-norbeck\" target=\"_blank\">Jack Norbeck</a>, cofounder and chief technology officer of Houston-based advanced geothermal developer <a href=\"https://www.fervoenergy.com/\" target=\"_blank\">Fervo Energy</a>, ran extensive simulations of such geothermal reservoir energy storage to see if the technical components of the system as well as the economics actually work out. They found that the systems could indeed store <a href=\"https://spectrum.ieee.org/long-term-energy-storage-molten-salt\" target=\"_blank\">electricity over a range of time scales</a>, from a few hours up to many days, as efficiently as lithium-ion batteries. Plus, says Ricks, “the storage capacity effectively comes free of charge with construction of a geothermal reservoir.” </p><p>Their results apply only to enhanced geothermal plants, like the ones Fervo and other companies such as Cambridge, Mass.–based <a href=\"https://www.quaise.energy/\" rel=\"noopener noreferrer\" target=\"_blank\">Quaise Energy</a> and Seattle-based <a href=\"http://altarockenergy.com/\" rel=\"noopener noreferrer\" target=\"_blank\">AltaRock Energy</a> are developing.</p><p>Conventional geothermal systems drill wells into naturally occurring hydrothermal reservoirs. But these pockets of hot water deep underground do not exist everywhere. In the United States, for instance, they are mostly located in the west.</p><p>Enhanced geothermal systems (EGS) get around this geographical limitation by creating artificial reservoirs. Developers create fractures in hot, dry rock formations by drilling into or <a href=\"https://spectrum.ieee.org/altarock-energy-melts-rock-with-millimeter-waves-for-geothermal-wells\" target=\"_self\">melting the rock</a>, and then injecting water into the fissures. Production wells bring the heated water up for producing electricity. “For scales necessary to contribute to national or global electricity decarbonization, we need to be able to extract geothermal heat outside of conventional formations,” Ricks says.</p><p>Fervo Energy raised <a href=\"https://www.businesswire.com/news/home/20220822005182/en/Fervo-Energy-Raises-138-Million-for-247-Carbon-Free-Next-Generation-Geothermal-Energy\" rel=\"noopener noreferrer\" target=\"_blank\">US $138 million</a> in venture capital funding in August to advance its technology. The company uses innovations from the oil and gas industry, such as horizontal drilling and distributed fiber-optic sensing, to create underground reservoirs. The company plans to use the new funds to complete two pilot projects, including <a href=\"https://cloud.google.com/blog/products/infrastructure/google-fervo-geothermal-project-creates-carbon-free-energy\" rel=\"noopener noreferrer\" target=\"_blank\">one with Google</a> in Nevada.</p><p>Once these EGS systems are in place, they would be ideal for storing energy as well as producing electricity. Excess wind or solar energy could be used to inject water into the artificial reservoirs, where it would accumulate and build up pressure. The production wells could then be opened up when electricity is needed. </p><p>“EGS reservoirs are created in rock formations that are naturally impermeable; everything outside the artificial reservoir is sealed off,” says Ricks. “It’s very similar to a hydropower reservoir, where you choose when to have water go through the dam and generate electricity.”</p><p>Depending on the geology and traits of the rocks, Ricks and his colleagues’ simulations found that the systems could store energy with up to 90 percent efficiency over one cycle. That’s comparable with lithium-ion and pumped hydro storage, he says. The cost, meanwhile, would be minimal compared to other energy storage technologies. It would require larger facilities on the surface, but the storage space would be effectively free, since the EGS reservoirs are being built for electricity anyway. </p><p>In January, the team received $4.5 million in funding from the <a href=\"https://arpa-e.energy.gov/\" target=\"_blank\">Advanced Research Projects Agency–Energy</a> (ARPA-E) to demonstrate a full-scale test of geothermal reservoir energy storage in the field. The detailed findings of their modeling study appear in a paper published recently in the journal <em><a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0306261922002537#!\" rel=\"noopener noreferrer\" target=\"_blank\">Applied Energy</a></em>.</p>",
  "pubDate": "Mon, 10 Oct 2022 18:14:22 +0000",
  "guid": "https://spectrum.ieee.org/geothermal-energy",
  "category": [
    "Geothermal energy",
    "Energy storage",
    "Enhanced geothermal system",
    "Grid-scale energy storage"
  ],
  "dc:creator": "Prachi Patel",
  "media:content": ""
}