{
  "title": "Episode 152: &#8220;For What It&#8217;s Worth&#8221; by Buffalo Springfield",
  "link": "https://500songs.com/podcast/episode-152-for-what-its-worth-by-buffalo-springfield/",
  "pubDate": "Tue, 30 Aug 2022 02:30:38 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1298",
  "description": "Episode 152 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “For What It's Worth”, and the short but eventful career of Buffalo Springfield. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a twenty-five-minute bonus episode available, <a href=\"https://www.patreon.com/posts/71228480\">on \"By the Time I Get to Phoenix\" by Glen Campbell</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n<strong>Erratum: </strong>I say Moby Grape never recorded the song \"On the Other Side\", but someone in the comments has pointed me to a demo of it which was released under the name \"Stop\"\n\n\n\n\n<strong>Resources</strong>\n\n\nAs usual, there's a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-152-for-what-its-worth/\">Mixcloud mix</a> containing all the songs excerpted in the episode.\n\n<a href=\"https://amzn.to/3KxxoKc\">This four-CD box set</a> is the definitive collection of Buffalo Springfield's work, while if you want the mono version of the second album, the stereo version of the first, and the final album as released, but no demos or outtakes, you want <a href=\"https://amzn.to/3R0f13j\">this more recent box set</a>.\n\n<a href=\"https://amzn.to/3wECy1B\"><em>For What It's Worth: The Story of Buffalo Springfield</em></a> by Richey Furay and John Einarson is obviously Furay's version of the story, but all the more interesting for that.\n\nFor information on Steve Stills' early life I used <a href=\"https://amzn.to/3CHmnV4\"><em>Stephen Stills: Change Partners </em>by David Roberts. </a>\n\nInformation on both Stills and Young comes from <a href=\"https://amzn.to/3pWqpkA\"><em>Crosby, Stills, Nash, and Young</em> by David Browne. </a>\n\n<a href=\"https://amzn.to/3R0LmH8\">Jimmy McDonough's <em>Shakey</em></a> is the definitive biography of Neil Young, while <a href=\"https://amzn.to/3wERYCS\">Young's <em>Waging Heavy Peace</em> is his autobiography.</a>\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nA quick note before we begin -- this episode deals with various disabilities. In particular, there are descriptions of epileptic seizures that come from non-medically-trained witnesses, many of whom took ableist attitudes towards the seizures. I don't know enough about epilepsy to know how accurate their descriptions and perceptions are, and I apologise if that means that by repeating some of their statements, I am inadvertently passing on myths about the condition. When I talk about this, I am talking about the after-the-fact recollections of musicians, none of them medically trained and many of them in altered states of consciousness, about events that had happened decades earlier. Please do not take anything said in a podcast about music history as being the last word on the causes or effects of epileptic seizures, rather than how those musicians remember them.\n\nAnyway, on with the show.\n\nOne of the things you notice if you write about protest songs is that a lot of the time, the songs that people talk about as being important or impactful have aged very poorly. Even great songwriters like Bob Dylan or John Lennon, when writing material about the political events of the time, would write material they would later acknowledge was far from their best. Too often a song will be about a truly important event, and be powered by a real sense of outrage at injustice, but it will be overly specific, and then as soon as the immediate issue is no longer topical, the song is at best a curio.\n\nFor example, the sentencing of the poet and rock band manager John Sinclair to ten years in prison for giving two joints to an undercover police officer was hugely controversial in the early seventies, but by the time John Lennon's song about it was released, Sinclair had been freed by the Supreme Court, and very, very few people would use the song as an example of why Lennon's songwriting still has lasting value:\n\n[Excerpt: John Lennon, \"John Sinclair\"]\n\nBut there are exceptions, and those tend to be songs where rather than talking about specific headlines, the song is about the emotion that current events have caused. Ninety years on from its first success, for example, \"Brother, Can You Spare a Dime?\" still has resonance, because there are still people who are put out of work through no fault of their own, and even those of us who are lucky enough to be financially comfortable have the fear that all too soon it may end, and we may end up like Al begging on the streets:\n\n[Excerpt: Rudy Vallee, \"Brother Can You Spare a Dime?\"]\n\nAnd because of that emotional connection, sometimes the very best protest songs can take on new lives and new meanings, and connect with the way people feel about totally unrelated subjects. Take Buffalo Springfield's one hit. The actual subject of the song couldn't be any more trivial in the grand scheme of things -- a change in zoning regulations around the Sunset Strip that meant people under twenty-one couldn't go to the clubs after 10PM, and the subsequent reaction to that -- but because rather than talking about the specific incident, Steve Stills instead talked about the emotions that it called up, and just noted the fleeting images that he was left with, the song became adopted as an anthem by soldiers in Vietnam. Sometimes what a song says is nowhere near as important as how it says it.\n\n[Excerpt: Buffalo Springfield, \"For What It's Worth\"]\n\nSteve Stills seems almost to have been destined to be a musician, although the instrument he started on, the drums, was not the one for which he would become best known. According to Stills, though, he always had an aptitude for rhythm, to the extent that he learned to tapdance almost as soon as he had learned to walk.\n\nHe started on drums aged eight or nine, after somebody gave him a set of drumsticks. After his parents got sick of him damaging the furniture by playing on every available surface, an actual drum kit followed, and that became his principal instrument, even after he learned to play the guitar at military school, as his roommate owned one.\n\nAs a teenager, Stills developed an idiosyncratic taste in music, helped by the record collection of his friend Michael Garcia. He didn't particularly like most of the pop music of the time, but he was a big fan of pre-war country music, Motown, girl-group music -- he especially liked the Shirelles -- and Chess blues. He was also especially enamoured of the music of Jimmy Reed, a passion he would later share with his future bandmate Neil Young:\n\n[Excerpt: Jimmy Reed, \"Baby, What You Want Me To Do?\"]\n\nIn his early teens, he became the drummer for a band called the Radars, and while he was drumming he studied their lead guitarist, Chuck Schwin.  He said later \"There was a whole little bunch of us who were into kind of a combination of all the blues guys and others including Chet Atkins, Dick Dale, and Hank Marvin: a very weird cross-section of far-out guitar players.\"\n\nStills taught himself to play like those guitarists, and in particular he taught himself how to emulate Atkins' Travis-picking style, and became remarkably proficient at it. There exists a recording of him, aged sixteen, singing one of his own songs and playing finger-picked guitar, and while the song is not exactly the strongest thing I've ever heard lyrically, it's clearly the work of someone who is already a confident performer:\n\n[Excerpt: Stephen Stills, \"Travellin'\"]\n\nBut the main reason he switched to becoming a guitarist wasn't because of his admiration for Chet Atkins or Hank Marvin, but because he started driving and discovered that if you have to load a drum kit into your car and then drive it to rehearsals and gigs you either end up bashing up your car or bashing up the drum kit. As this is not a problem with guitars, Stills decided that he'd move on from the Radars, and join a band named the Continentals as their rhythm guitarist, playing with lead guitarist Don Felder.\n\nStills was only in the Continentals for a few months though, before being replaced by another guitarist, Bernie Leadon, and in general Stills' whole early life is one of being uprooted and moved around. His father had jobs in several different countries, and while for the majority of his time Stills was in the southern US, he also ended up spending time in Costa Rica -- and staying there as a teenager even as the rest of his family moved to El Salvador.\n\nEventually, aged eighteen, he moved to New Orleans, where he formed a folk duo with a friend, Chris Sarns. The two had very different tastes in folk music -- Stills preferred Dylan-style singer-songwriters, while Sarns liked the clean sound of the Kingston Trio -- but they played together for several months before moving to Greenwich Village, where they performed together and separately.\n\nThey were latecomers to the scene, which had already mostly ended, and many of the folk stars had already gone on to do bigger things. But Stills still saw plenty of great performers there -- Miles Davis and Dizzy Gillespie and Thelonius Monk in the jazz clubs, Woody Allen, Lenny Bruce, and Richard Pryor in the comedy ones, and Simon and Garfunkel, Richie Havens, Fred Neil and Tim Hardin in the folk ones -- Stills said that other than Chet Atkins, Havens, Neil, and Hardin were the people most responsible for his guitar style.\n\nStills was also, at this time, obsessed with Judy Collins' third album -- the album which had featured Roger McGuinn on banjo and arrangements, and which would soon provide several songs for the Byrds to cover:\n\n[Excerpt: Judy Collins, \"Turn, Turn, Turn\"]\n\nJudy Collins would soon become a very important figure in Stills' life, but for now she was just the singer on his favourite record.\n\nWhile the Greenwich Village folk scene was no longer quite what it had been a year or two earlier, it was still a great place for a young talented musician to perform. As well as working with Chris Sarns, Stills also formed a trio with his friend John Hopkins and a banjo player called Peter Tork who everyone said looked just like Stills.\n\nTork soon headed out west to seek his fortune, and then Stills got headhunted to join the Au Go Go Singers. This was a group that was being set up in the same style as the New Christy Minstrels -- a nine-piece vocal and instrumental group that would do clean-sounding versions of currently-popular folk songs. The group were signed to Roulette Records, and recorded one album, They Call Us Au-Go-Go Singers, produced by Hugo and Luigi, the production duo we've previously seen working with everyone from the Tokens to the Isley Brothers.\n\nMuch of the album is exactly the same kind of thing that a million New Christy Minstrels soundalikes were putting out -- and Stills, with his raspy voice, was clearly intended to be the Barry McGuire of this group -- but there was one exception -- a song called \"High Flyin' Bird\", on which Stills was able to show off the sound that would later make him famous, and which became so associated with him that even though it was written by Billy Edd Wheeler, the writer of \"Jackson\", even the biography of Stills I used in researching this episode credits \"High Flyin' Bird\" as being a Stills original:\n\n[Excerpt: The Au-Go-Go Singers, \"High Flyin' Bird\"]\n\nOne of the other members of the Au-Go-Go Singers, Richie Furay, also got to sing a lead vocal on the album, on the Tom Paxton song \"Where I'm Bound\":\n\n[Excerpt: The Au-Go-Go Singers, \"Where I'm Bound\"]\n\nThe Au-Go-Go Singers got a handful of dates around the folk scene, and Stills and Furay became friendly with another singer playing the same circuit, Gram Parsons. Parsons was one of the few people they knew who could see the value in current country music, and convinced both Stills and Furay to start paying more attention to what was coming out of Nashville and Bakersfield.\n\nBut soon the Au-Go-Go Singers split up. Several venues where they might otherwise have been booked were apparently scared to book an act that was associated with Morris Levy, and also the market for big folk ensembles dried up more or less overnight when the Beatles hit the music scene.\n\nBut several of the group -- including Stills but not Furay -- decided they were going to continue anyway, and formed a group called The Company, and they went on a tour of Canada. And one of the venues they played was the Fourth Dimension coffee house in Fort William, Ontario, and there their support act was a rock band called The Squires:\n\n[Excerpt: The Squires, \"(I'm a Man And) I Can't Cry\"]\n\nThe lead guitarist of the Squires, Neil Young, had a lot in common with Stills, and they bonded instantly. Both men had parents who had split up when they were in their teens, and had a successful but rather absent father and an overbearing mother. And both had shown an interest in music even as babies. According to Young's mother, when he was still in nappies, he would pull himself up by the bars  of his playpen and try to dance every time he heard \"Pinetop's Boogie Woogie\":\n\n[Excerpt: Pinetop Smith, \"Pinetop's Boogie Woogie\"]\n\nYoung, though, had had one crucial experience which Stills had not had. At the age of six, he'd come down with polio, and become partially paralysed. He'd spent months in hospital before he regained his ability to walk, and the experience had also affected him in other ways. While he was recovering, he would draw pictures of trains -- other than music, his big interest, almost an obsession, was with electric train sets, and that obsession would remain with him throughout his life -- but for the first time he was drawing with his right hand rather than his left.\n\nHe later said \"The left-hand side got a little screwed. Feels different from the right. If I close my eyes, my left side, I really don’t know where it is—but over the years I’ve discovered that almost one hundred percent for sure it’s gonna be very close to my right side … probably to the left.\n\nThat’s why I started appearing to be ambidextrous, I think. Because polio affected my left side, and I think I was left-handed when I was born. What I have done is use the weak side as the dominant one because the strong side was injured.\"\n\nBoth Young's father Scott Young -- a very famous Canadian writer and sports broadcaster, who was by all accounts as well known in Canada during his lifetime as his son -- and Scott's brother played ukulele, and they taught Neil how to play, and his first attempt at forming a group had been to get his friend Comrie Smith to get a pair of bongos and play along with him to Preston Epps' \"Bongo Rock\":\n\n[Excerpt: Preston Epps, \"Bongo Rock\"]\n\nNeil Young had liked all the usual rock and roll stars of the fifties  -- though in his personal rankings, Elvis came a distant third behind Little Richard and Jerry Lee Lewis -- but his tastes ran more to the more darkly emotional. He loved \"Maybe\" by the Chantels, saying \"Raw soul—you cannot miss it. That’s the real thing. She was believin’ every word she was singin’.\"\n\n[Excerpt: The Chantels, \"Maybe\"]\n\nWhat he liked more than anything was music that had a mainstream surface but seemed slightly off-kilter. He was a major fan of Roy Orbison, saying, \"it’s almost impossible to comprehend the depth of that soul. It’s so deep and dark it just keeps on goin’ down—but it’s not black. It’s blue, deep blue. He’s just got it. The drama. There’s something sad but proud about Roy’s music\", and he would say similar things about Del Shannon, saying \"He struck me as the ultimate dark figure—behind some Bobby Rydell exterior, y’know? “Hats Off to Larry,” “Runaway,” “Swiss Maid”—very, very inventive. The stuff was weird. Totally unaffected.\"\n\nMore surprisingly, perhaps, he was a particular fan of Bobby Darin, who he admired so much because Darin could change styles at the drop of a hat, going from novelty rock and roll like \"Splish Splash\" to crooning \"Mack The Knife\" to singing Tim Hardin songs like \"If I Were a Carpenter\", without any of them seeming any less authentic. As he put it later \"He just changed. He’s completely different. And he’s really into it. Doesn’t sound like he’s not there. “Dream Lover,” “Mack the Knife,” “If I Were a Carpenter,” “Queen of the Hop,” “Splish Splash”—tell me about those records, Mr. Darin. Did you write those all the same day, or what happened? He just changed so much. Just kinda went from one place to another. So it’s hard to tell who Bobby Darin really was.\"\n\nAnd one record which Young was hugely influenced by was Floyd Cramer's country instrumental, \"Last Date\":\n\n[Excerpt: Floyd Cramer, \"Last Date\"]\n\nNow, that was a very important record in country music, and if you want to know more about it I strongly recommend listening to the episode of Cocaine and Rhinestones on the Nashville A-Team, which has a long section on the track, but the crucial thing to know about that track is that it's one of the earliest examples of what is known as slip-note playing, where the piano player, before hitting the correct note, briefly hits the note a tone below it, creating a brief discord. Young absolutely loved that sound, and wanted to make a sound like that on the guitar. And then, when he and his mother moved to Winnipeg after his parents' divorce, he found someone who was doing just that.\n\nIt was the guitarist in a group variously known as Chad Allan and the Reflections and Chad Allan and the Expressions. That group had relatives in the UK who would send them records, and so where most Canadian bands would do covers of American hits, Chad Allan and the Reflections would do covers of British hits, like their version of Geoff Goddard's \"Tribute to Buddy Holly\", a song that had originally been produced by Joe Meek:\n\n[Excerpt: Chad Allan and the Reflections, \"Tribute to Buddy Holly\"]\n\nThat would later pay off for them in a big way, when they recorded a version of Johnny Kidd and the Pirates' \"Shakin' All Over\", for which their record label tried to create an air of mystery by releasing it with no artist name, just \"Guess Who?\" on the label. It became a hit, the name stuck, and they became The Guess Who:\n\n[Excerpt: The Guess Who, \"Shakin' All Over\"]\n\nBut at this point they, and their guitarist Randy Bachman, were just another group playing around Winnipeg. Bachman, though, was hugely impressive to Neil Young for a few reasons. The first was that he really did have a playing style that was a lot like the piano style of Floyd Cramer -- Young would later say \"it was Randy Bachman who did it first. Randy was the first one I ever heard do things on the guitar that reminded me of Floyd. He’d do these pulls—“darrr darrrr,” this two-note thing goin’ together—harmony, with one note pulling and the other note stayin’ the same.\"\n\nBachman also had built the first echo unit that Young heard a guitarist play in person. He'd discovered that by playing with the recording heads on a tape recorder owned by his mother, he could replicate the tape echo that Sam Phillips had used at Sun Studios -- and once he'd attached that to his amplifier, he realised how much the resulting sound sounded like his favourite guitarist, Hank Marvin of the Shadows, another favourite of Neil Young's:\n\n[Excerpt: The Shadows, \"Man of Mystery\"]\n\nYoung soon started looking to Bachman as something of a mentor figure, and he would learn a lot of guitar techniques second hand from Bachman -- every time a famous musician came to the area, Bachman would go along and stand right at the front and watch the guitarist, and make note of the positions their fingers were in. Then Bachman would replicate those guitar parts with the Reflections, and Neil Young would stand in front of him and make notes of where *his* fingers were.\n\nYoung joined a band on the local circuit called the Esquires, but soon either quit or was fired, depending on which version of the story you choose to believe. He then formed his own rival band, the Squires, with no \"e\", much to the disgust of his ex-bandmates. In July 1963, five months after they formed, the  Squires released their first record, \"Aurora\" backed with \"The Sultan\", on a tiny local label. Both tracks were very obviously influenced by the Shadows:\n\n[Excerpt: The Squires, \"Aurora\"]\n\nThe Squires were a mostly-instrumental band for the first year or so they were together, and then the Beatles hit North America, and suddenly people didn't want to hear surf instrumentals and Shadows covers any more, they only wanted to hear songs that sounded a bit like the Beatles. The Squires started to work up the appropriate repertoire -- two songs that have been mentioned as in their set at this point are the Beatles album track \"It Won't Be Long\", and \"Money\" which the Beatles had also covered -- but they didn't have a singer, being an instrumental group.\n\nThey could get in a singer, of course, but that would mean splitting the money with another person. So instead, the guitarist, who had never had any intention of becoming a singer, was more or less volunteered for the role. Over the next eighteen months or so the group's repertoire moved from being largely instrumental to largely vocal, and the group also seem to have shuttled around a bit between two different cities -- Winnipeg and Fort William, staying in one for a while and then moving back to the other. They travelled between the two in Young's car, a Buick Roadmaster hearse.\n\nIn Winnipeg, Young first met up with a singer named Joni Anderson, who was soon to get married to Chuck Mitchell and would become better known by her married name. The two struck up a friendship, though by all accounts never a particularly close one -- they were too similar in too many ways; as Mitchell later said “Neil and I have a lot in common: Canadian; Scorpios; polio in the same epidemic, struck the same parts of our body; and we both have a black sense of humor\". They were both also idiosyncratic artists who never fit very well into boxes.\n\nIn Fort William the Squires made a few more records, this time vocal tracks like \"I'll Love You Forever\":\n\n[Excerpt: The Squires, \"I'll Love You Forever\"]\n\nIt was also in Fort William that Young first encountered two acts that would make a huge impression on him. One was a group called The Thorns, consisting of Tim Rose, Jake Holmes, and Rich Husson. The Thorns showed Young that there was interesting stuff being done on the fringes of the folk music scene. He later said \"One of my favourites was “Oh Susannah”—they did this arrangement that was bizarre. It was in a minor key, which completely changed everything—and it was rock and roll. So that idea spawned arrangements of all these other songs for me. I did minor versions of them all. We got into it. That was a certain Squires stage that never got recorded. Wish there were tapes of those shows. We used to do all this stuff, a whole kinda music—folk-rock. We took famous old folk songs like “Clementine,” “She’ll Be Comin’ ’Round the Mountain,” “Tom Dooley,” and we did them all in minor keys based on the Tim Rose arrangement of “Oh Susannah.”\n\nThere are no recordings of the Thorns in existence that I know of, but presumably that arrangement that Young is talking about is the version that Rose also later did with the Big 3, which we've heard in a few other episodes:\n\n[Excerpt: The Big 3, \"The Banjo Song\"]\n\nThe other big influence was, of course, Steve Stills, and the two men quickly found themselves influencing each other deeply. Stills realised that he could bring more rock and roll to his folk-music sound, saying that what amazed him was the way the Squires could go from \"Cottonfields\" (the Lead Belly song) to \"Farmer John\", the R&B song by Don and Dewey that was becoming a garage-rock staple.\n\nYoung in turn was inspired to start thinking about maybe going more in the direction of folk music. The Squires even renamed themselves the High-Flying Birds, after the song that Stills had recorded with the Au Go Go Singers.\n\nAfter The Company's tour of Canada, Stills moved back to New York for a while. He now wanted to move in a folk-rock direction, and for a while he tried to persuade his friend John Sebastian to let him play bass in his new band, but when the Lovin' Spoonful decided against having him in the band, he decided to move West to San Francisco, where he'd heard there was a new music scene forming.\n\nHe enjoyed a lot of the bands he saw there, and in particular he was impressed by the singer of a band called the Great Society:\n\n[Excerpt: The Great Society, \"Somebody to Love\"]\n\nHe was much less impressed with the rest of her band, and seriously considered going up to her and asking if she wanted to work with some *real* musicians instead of the unimpressive ones she was working with, but didn't get his nerve up. We will, though, be hearing more about Grace Slick in future episodes.\n\nInstead, Stills decided to move south to LA, where many of the people he'd known in Greenwich Village were now based. Soon after he got there, he hooked up with two other musicians, a guitarist named Steve Young and a singer, guitarist, and pianist named Van Dyke Parks. Parks had a record contract at MGM -- he'd been signed by Tom Wilson, the same man who had turned Dylan electric, signed Simon and Garfunkel, and produced the first albums by the Mothers of Invention. With Wilson, Parks put out a couple of singles in 1966, \"Come to the Sunshine\":\n\n[Excerpt: The Van Dyke Parks, \"Come to the Sunshine\"]\n\nAnd \"Number Nine\", a reworking of the Ode to Joy from Beethoven's Ninth Symphony:\n\n[Excerpt: The Van Dyke Parks, \"Number Nine\"]Parks, Stills, and Steve Young became The Van Dyke Parks Band, though they didn't play together for very long, with their most successful performance being as the support act for the Lovin' Spoonful for a show in Arizona. But they did have a lasting resonance -- when Van Dyke Parks finally got the chance to record his first solo album, he opened it with Steve Young singing the old folk song \"Black Jack Davy\", filtered to sound like an old tape:\n\n[Excerpt: Steve Young, \"Black Jack Davy\"]\n\nAnd then it goes into a song written for Parks by Randy Newman, but consisting of Newman's ideas about Parks' life and what he knew about him, including that he had been third guitar in the Van Dyke Parks Band:\n\n[Excerpt: Van Dyke Parks, \"Vine Street\"]\n\nParks and Stills also wrote a few songs together, with one of their collaborations, \"Hello, I've Returned\", later being demoed by Stills for Buffalo Springfield:\n\n[Excerpt: Steve Stills, \"Hello, I've Returned\"]\n\nAfter the Van Dyke Parks Band fell apart, Parks went on to many things, including a brief stint on keyboards in the Mothers of Invention, and we'll be talking more about him next episode.\n\nStills formed a duo called the Buffalo Fish, with his friend Ron Long. That soon became an occasional trio when Stills met up again with his old Greenwich Village friend Peter Tork, who joined the group on the piano. But then Stills auditioned for the Monkees and was turned down because he had bad teeth -- or at least that's how most people told the story. Stills has later claimed that while he turned up for the Monkees auditions, it wasn't to audition, it was to try to pitch them songs, which seems implausible on the face of it. According to Stills, he was offered the job and turned it down because he'd never wanted it. But whatever happened, Stills suggested they might want his friend Peter, who looked just like him apart from having better teeth, and Peter Tork got the job.\n\nBut what Stills really wanted to do was to form a proper band. He'd had the itch to do it ever since seeing the Squires, and he decided he should ask Neil Young to join. There was only one problem -- when he phoned Young, the phone was answered by Young's mother, who told Stills that Neil had moved out to become a folk singer, and she didn't know where he was.\n\nBut then Stills heard from his old friend Richie Furay. Furay was still in Greenwich Village, and had decided to write to Stills. He didn't know where Stills was, other than that he was in California somewhere, so he'd written to Stills' father in El Salvador. The letter had been returned, because the postage had been short by one cent, so Furay had resent it with the correct postage. Stills' father had then forwarded the letter to the place Stills had been staying in San Francisco, which had in turn forwarded it on to Stills in LA. Furay's letter mentioned this new folk singer who had been on the scene for a while and then disappeared again, Neil Young, who had said he knew Stills, and had been writing some great songs, one of which Furay had added to his own set.\n\nStills got in touch with Furay and told him about this great band he was forming in LA, which he wanted Furay to join. Furay was in, and travelled from New York to LA, only to be told that at this point there were no other members of this great band, but they'd definitely find some soon. They got a publishing deal with Columbia/Screen Gems, which gave them enough money to not starve, but what they really needed was to find some other musicians.\n\nThey did, when driving down Hollywood Boulevard on April the sixth, 1966. There, stuck in traffic going the other way, they saw a hearse...\n\nAfter Steve Stills had left Fort William, so had Neil Young. He hadn't initially intended to -- the High-Flying Birds still had a regular gig, but Young and some of his friends had gone away for a few days on a road trip in his hearse. But unfortunately the transmission on the hearse had died, and Young and his friends had been stranded. Many years later, he would write a eulogy to the hearse, which he and Stills would record together:\n\n[Excerpt: The Stills-Young Band, \"Long May You Run\"]\n\nYoung and his friends had all hitch-hiked in different directions -- Young had ended up in Toronto, where his dad lived, and had stayed with his dad for a while. The rest of his band had eventually followed him there, but Young found the Toronto music scene not to his taste -- the folk and rock scenes there were very insular and didn't mingle with each other, and the group eventually split up. Young even took on a day job for a while, for the only time in his life, though he soon quit.\n\nYoung started basically commuting between Toronto and New York, a distance of several hundred miles, going to Greenwich Village for a while before ending up back in Toronto, and ping-ponging between the two. In New York, he met up with Richie Furay, and also had a disastrous audition for Elektra Records as a solo artist.\n\nOne of the songs he sang in the audition was \"Nowadays Clancy Can't Even Sing\", the song which Furay liked so much he started performing it himself. Young doesn't normally explain his songs, but as this was one of the first he ever wrote, he talked about it in interviews in the early years, before he decided to be less voluble about his art. The song was apparently about the sense of youthful hope being crushed. The instigation for it was Young seeing his girlfriend with another man, but the central image, of Clancy not singing, came from Young's schooldays. The Clancy in question was someone Young liked as one of the other weird kids at school. He was disabled, like Young, though with MS rather than polio, and he would sing to himself in the hallways at school.\n\nSadly, of course, the other kids would mock and bully him for that, and eventually he ended up stopping. Young said about it \"After awhile, he got so self-conscious he couldn’t do his thing any more. When someone who is as beautiful as that and as different as that is actually killed by his fellow man—you know what I mean—like taken and sorta chopped down—all the other things are nothing compared to this.\"\n\n[Excerpt: Neil Young, \"Nowadays Clancy Can't Even Sing (Elektra demo)\"]\n\nOne thing I should say for anyone who listens to the Mixcloud for this episode, that song, which will be appearing in a couple of different versions, has one use of a term for Romani people that some (though not all) consider a slur. It's not in the excerpts I'll be using in this episode, but will be in the full versions on the Mixcloud. Sadly that word turns up time and again in songs of this era...\n\nWhen he wasn't in New York, Young was living in Toronto in a communal apartment owned by a folk singer named Vicki Taylor, where many of the Toronto folk scene would stay. Young started listening a lot to Taylor's Bert Jansch albums, which were his first real exposure to the British folk-baroque style of guitar fingerpicking, as opposed to the American Travis-picking style, and Young would soon start to incorporate that style into his own playing:\n\n[Excerpt: Bert Jansch, \"Angie\"]\n\nAnother guitar influence on Young at this point was another of the temporary tenants of Taylor's flat, John Kay, who would later go on to be one of the founding members of Steppenwolf. Young credited Kay with having a funky rhythm guitar style that Young incorporated into his own.\n\nWhile he was in Toronto, he started getting occasional gigs in Detroit, which is \"only\" a couple of hundred miles away, set up by Joni and Chuck Mitchell, both of whom also sometimes stayed at Taylor's. And it was in Detroit that Neil Young became, albeit very briefly, a Motown artist.\n\nThe Mynah Birds were a band in Toronto that had at one point included various future members of Steppenwolf, and they were unusual for the time in that they were a white band with a Black lead singer, Ricky Matthews. They also had a rich manager, John Craig Eaton, the heir to the Eaton's department store fortune, who basically gave them whatever money they wanted -- they used to go to his office and tell him they needed seven hundred dollars for lunch, and he'd hand it to them. They were looking for a new guitarist when Bruce Palmer, their bass player, bumped into Neil Young carrying an amp and asked if he was interested in joining. He was.\n\nThe Mynah Birds quickly became one of the best bands in Toronto, and Young and Matthews became close, both as friends and as a performance team. People who saw them live would talk about things like a song called “Hideaway”, written by Young and Matthews, which had a spot in the middle where Young would start playing a harmonica solo, throw the harmonica up in the air mid-solo, Matthews would catch it, and he would then finish the solo.\n\nThey got signed to Motown, who were at this point looking to branch out into the white guitar-group market, and they were put through the Motown star-making machine. They recorded an entire album, which remains unreleased, but they did release a single, \"It's My Time\":\n\n[Excerpt: The Mynah Birds, \"It's My Time\"]\n\nOr at least, they released a handful of promo copies. The single was pulled from release after Ricky Matthews got arrested. It turned out his birth name wasn't Ricky Matthews, but James Johnson, and that he wasn't from Toronto as he'd told everyone, but from Buffalo, New York. He'd fled to Canada after going AWOL from the Navy, not wanting to be sent to Vietnam, and he was arrested and jailed for desertion.\n\nAfter getting out of jail, he would start performing under yet another name, and as Rick James would have a string of hits in the seventies and eighties:\n\n[Excerpt: Rick James, \"Super Freak\"]\n\nMost of the rest of the group continued gigging as The Mynah Birds, but Young and Palmer had other plans. They sold the expensive equipment Eaton had bought the group, and Young bought a new hearse, which he named Mort 2 – Mort had been his first hearse.\n\nAnd according to one of the band's friends in Toronto, the crucial change in their lives came when Neil Young heard a song on a jukebox:\n\n[Excerpt: The Mamas and the Papas, \"California Dreamin'\"]\n\nYoung apparently heard \"California Dreamin'\" and immediately said \"Let's go to California and become rock stars\".\n\nNow, Young later said of this anecdote that \"That sounds like a Canadian story to me. That sounds too real to be true\", and he may well be right. Certainly the actual wording of the story is likely incorrect -- people weren't talking about \"rock stars\" in 1966. Google's Ngram viewer has the first use of the phrase in print being in 1969, and the phrase didn't come into widespread usage until surprisingly late -- even granting that phrases enter slang before they make it to print, it still seems implausible.\n\nBut even though the precise wording might not be correct, something along those lines definitely seems to have happened, albeit possibly less dramatically. Young's friend Comrie Smith independently said that Young told him “Well, Comrie, I can hear the Mamas and the Papas singing ‘All the leaves are brown, and the skies are gray …’ I’m gonna go down to the States and really make it. I’m on my way. Today North Toronto, tomorrow the world!”\n\nYoung and Palmer loaded up Mort 2 with a bunch of their friends and headed towards California. On the way, they fell out with most of the friends, who parted from them, and Young had an episode which in retrospect may have been his first epileptic seizure. They decided when they got to California that they were going to look for Steve Stills, as they'd heard he was in LA and neither of them knew anyone else in the state. But after several days of going round the Sunset Strip clubs asking if anyone knew Steve Stills, and sleeping in the hearse as they couldn't afford anywhere else, they were getting fed up and about to head off to San Francisco, as they'd heard there was a good music scene there, too. They were going to leave that day, and they were stuck in traffic on Sunset Boulevard, about to head off, when Stills and Furay came driving in the other direction.\n\nFuray happened to turn his head, to brush away a fly, and saw a hearse with Ontario license plates. He and Stills both remembered that Young drove a hearse, and so they assumed it must be him. They started honking at the hearse, then did a U-turn. They got Young's attention, and they all pulled into the parking lot at Ben Frank's, the Sunset Strip restaurant that attracted such a hip crowd the Monkees' producers had asked for \"Ben Frank's types\" in their audition advert.\n\nYoung introduced Stills and Furay to Palmer, and now there *was* a group -- three singing, songwriting, guitarists and a bass player. Now all they needed was a drummer.\n\nThere were two drummers seriously considered for the role. One of them, Billy Mundi, was technically the better player, but Young didn't like playing with him as much -- and Mundi also had a better offer, to join the Mothers of Invention as their second drummer -- before they'd recorded their first album, they'd had two drummers for a few months, but Denny Bruce, their second drummer, had become ill with glandular fever and they'd reverted to having Jimmy Carl Black play solo. Now they were looking for someone else, and Mundi took that role.\n\nThe other drummer, who Young preferred anyway, was another Canadian, Dewey Martin. Martin was a couple of years older than the rest of the group, and by far the most experienced. He'd moved from Canada to Nashville in his teens, and according to Martin he had been taken under the wing of Hank Garland, the great session guitarist most famous for \"Sugarfoot Rag\":\n\n[Excerpt: Hank Garland, \"Sugarfoot Rag\"]\n\nWe heard Garland playing with Elvis and others in some of the episodes around 1960, and by many reckonings he was the best session guitarist in Nashville, but in 1961 he had a car accident that left him comatose, and even though he recovered from the coma and lived another thirty-three years, he never returned to recording.\n\nAccording to Martin, though, Garland would still sometimes play jazz clubs around Nashville after the accident, and one day Martin walked into a club and saw him playing. The drummer he was playing with got up and took a break, taking his sticks with him, so Martin got up on stage and started playing, using two combs instead of sticks. Garland was impressed, and told Martin that Faron Young needed a drummer, and he could get him the gig.\n\nAt the time Young was one of the biggest stars in country music. That year, 1961, he had three country top ten hits, including a number one with his version of Willie Nelson's \"Hello Walls\", produced by Ken Nelson:\n\n[Excerpt: Faron Young, \"Hello Walls\"]\n\nMartin joined Faron Young's band for a while, and also ended up playing short stints in the touring bands of various other Nashville-based country and rock stars, including Patsy Cline, Roy Orbison, and the Everly Brothers, before heading to LA for a while. Then Mel Taylor of the Ventures hooked him up with some musicians in the Pacific Northwest scene, and Martin started playing there under the name Sir Raleigh and the Coupons with various musicians. After a while he travelled back to LA where he got some members of the LA group Sons of Adam to become a permanent lineup of Coupons, and they recorded several singles with Martin singing lead, including the Tommy Boyce and Steve Venet song \"Tomorrow's Gonna Be Another Day\", later recorded by the Monkees:\n\n[Excerpt: Sir Raleigh and the Coupons, \"Tomorrow's Gonna Be Another Day\"]\n\nHe then played with the Standells, before joining the Modern Folk Quartet for a short while, as they were transitioning from their folk sound to a folk-rock style. He was only with them for a short while, and it's difficult to get precise details -- almost everyone involved with Buffalo Springfield has conflicting stories about their own careers with timelines that don't make sense, which is understandable given that people were talking about events decades later and memory plays tricks. \"Fast\" Eddie Hoh had joined the Modern Folk Quartet on drums in late 1965, at which point they became the Modern Folk Quintet, and nothing I've read about that group talks about Hoh ever actually leaving, but apparently Martin joined them in February 1966, which might mean he's on their single \"Night-Time Girl\", co-written by Al Kooper and produced and arranged by Jack Nitzsche:\n\n[Excerpt: The Modern Folk Quintet, \"Night-Time Girl\"]\n\nAfter that, Martin was taken on by the Dillards, a bluegrass band who are now possibly most famous for having popularised the Arthur \"Guitar Boogie\" Smith song \"Duellin' Banjos\", which they recorded on their first album and played on the Andy Griffith Show a few years before it was used in Deliverance:\n\n[Excerpt: The Dillards, \"Duellin' Banjos\"]\n\nThe Dillards had decided to go in a country-rock direction -- and Doug Dillard would later join the Byrds and make records with Gene Clark -- but they were hesitant about it, and after a brief period with Martin in the band they decided to go back to their drummerless lineup. To soften the blow, they told him about another band that was looking for a drummer -- their manager, Jim Dickson, who was also the Byrds' manager, knew Stills and his bandmates. Dewey Martin was in the group.\n\nThe group still needed a name though. They eventually took their name from a brand of steam roller, after seeing one on the streets when some roadwork was being done. Everyone involved disagrees as to who came up with the name. Steve Stills at one point said it was a group decision after Neil Young and the group's manager Frazier Mohawk stole the nameplate off the steamroller, and later Stills said that Richey Furay had suggested the name while they were walking down the street, Dewey Martin said it was his idea, Neil Young said that he, Steve Sills, and Van Dyke Parks had been walking down the street and either Young or Stills had seen the nameplate and suggested the name, and Van Dyke Parks says that *he* saw the nameplate and suggested it to Dewey Martin:\n\n[Excerpt: Steve Stills and Van Dyke Parks on the name]\n\nFor what it's worth, I tend to believe Van Dyke Parks in most instances -- he's an honest man, and he seems to have a better memory of the sixties than many of his friends who led more chemically interesting lives.\n\nWhoever came up with it, the name worked -- as Stills later put it \"We thought it was pretty apt, because Neil Young is from Manitoba which is buffalo country, and  Richie Furay was from Springfield, Ohio -- and I'm the field!\"\n\nIt almost certainly also helped that the word \"buffalo\" had been in the name of Stills' previous group, Buffalo Fish.\n\nOn the eleventh of April, 1966, Buffalo Springfield played their first gig, at the Troubadour, using equipment borrowed from the Dillards. Chris Hillman of the Byrds was in the audience and was impressed. He got the group a support slot on a show the Byrds and the Dillards were doing a few days later in San Bernardino. That show was compered by a Merseyside-born British DJ, John Ravenscroft, who had managed to become moderately successful in US radio by playing up his regional accent so he sounded more like the Beatles. He would soon return to the UK, and start broadcasting under the name John Peel.\n\nHillman also got them a week-long slot at the Whisky A-Go-Go, and a bidding war started between record labels to sign the band. Dunhill offered five thousand dollars, Warners counted with ten thousand, and then Atlantic offered twelve thousand. Atlantic were *just* starting to get interested in signing white guitar groups -- Jerry Wexler never liked that kind of music, always preferring to stick with soul and R&B, but Ahmet Ertegun could see which way things were going.\n\nAtlantic had only ever signed two other white acts before -- Neil Young's old favourite Bobby Darin, who had since left the label, and Sonny and Cher. And Sonny and Cher's management and production team, Brian Stone and Charlie Greene, were also very interested in the group, who even before they had made a record had quickly become the hottest band on the circuit, even playing the Hollywood Bowl as the Rolling Stones' support act. Buffalo Springfield already had managers -- Frazier Mohawk and Richard Davis, the lighting man at the Troubadour (who was sometimes also referred to as Dickie Davis, but I'll use his full name so as not to cause unnecessary confusion in British people who remember the sports TV presenter of the same name), who Mohawk had enlisted to help him. But Stone and Greene weren't going to let a thing like that stop them.\n\nAccording to anonymous reports quoted without attribution in David Roberts' biography of Stills -- so take this with as many grains of salt as you want -- Stone and Greene took Mohawk for a ride around LA in a limo, just the three of them, a gun, and a used hotdog napkin. At the end of the ride, the hotdog napkin had Mohawk's scrawled signature, signing the group over to Stone and Greene. Davis stayed on, but was demoted to just doing their lights.\n\nThe way things ended up, the group signed to Stone and Greene's production company, who then leased their masters to Atlantic's Atco subsidiary. A publishing company was also set up for the group's songs -- owned thirty-seven point five percent by Atlantic, thirty-seven point five percent by Stone and Greene, and the other twenty-five percent split six ways between the group and Davis, who they considered their sixth member.\n\nAlmost immediately, Charlie Greene started playing Stills and Young off against each other, trying a divide-and-conquer strategy on the group. This was quite easy, as both men saw themselves as natural leaders, though Stills was regarded by everyone as the senior partner -- the back cover of their first album would contain the line \"Steve is the leader but we all are\".\n\nStills and Young were the two stars of the group as far as the audience were concerned -- though most musicians who heard them play live say that the band's real strength was in its rhythm section, with people comparing Palmer's playing to that of James Jamerson. But Stills and Young would get into guitar battles on stage, one-upping each other, in ways that turned the tension between them in creative directions. Other clashes, though were more petty -- both men had very domineering mothers, who would actually call the group's management to complain about press coverage if their son was given less space than the other one.\n\nThe group were also not sure about Young's voice -- to the extent that Stills was known to jokingly apologise to the audience before Young took a lead vocal -- and so while the song chosen as the group's first A-side was Young's \"Nowadays Clancy Can't Even Sing\", Furay was chosen to sing it, rather than Young:\n\n[Excerpt: Buffalo Springfield, \"Nowadays Clancy Can't Even Sing\"]\n\nOn the group's first session, though, both Stills and Young realised that their producers didn't really have a clue -- the group had built up arrangements that had a complex interplay of instruments and vocals, but the producers insisted on cutting things very straightforwardly, with a basic backing track and then the vocals. They also thought that the song was too long so the group should play faster. Stills and Young quickly decided that they were going to have to start producing their own material, though Stone and Greene would remain the producers for the first album.\n\nThere was another bone of contention though, because in the session the initial plan had been for Stills' song \"Go and Say Goodbye\" to be the A-side with Young's song as the B-side. It was flipped, and nobody seems quite sure why -- it's certainly the case that, whatever the merits of the two tracks as songs, Stills' song was the one that would have been more likely to become a hit.\n\n\"Nowadays Clancy Can't Even Sing\" was a flop, but it did get some local airplay. The next single, \"Burned\", was a Young song as well, and this time did have Young taking the lead, though in a song dominated by harmonies:\n\n[Excerpt: Buffalo Springfield, \"Burned\"]\n\nOver the summer, though, something had happened that would affect everything for the group -- Neil Young had started to have epileptic seizures. At first these were undiagnosed episodes, but soon they became almost routine events, and they would often happen on stage, particularly at moments of great stress or excitement. Several other members of the group became convinced -- entirely wrongly -- that Young was faking these seizures in order to get women to pay attention to him. They thought that what he wanted was for women to comfort him and mop his brow, and that collapsing would get him that.\n\nThe seizures became so common that Richard Davis, the group's lighting tech, learned to recognise the signs of a seizure before it happened. As soon as it looked like Young was about to collapse the lights would turn on, someone would get ready to carry him off stage, and Richie Furay would know to grab Young's guitar before he fell so that the guitar wouldn't get damaged. Because they weren't properly grounded and Furay had an electric guitar of his own, he'd get a shock every time.\n\nYoung would later claim that during some of the seizures, he would hallucinate that he was another person, in another world, living another life that seemed to have its own continuity -- people in the other world would recognise him and talk to him as if he'd been away for a while -- and then when he recovered he would have to quickly rebuild his identity, as if temporarily amnesiac, and during those times he would find things like the concept of lying painful.\n\nThe group's first album came out in December, and they were very, very, unhappy with it. They thought the material was great, but they also thought that the production was terrible. Stone and Greene's insistence that they record the backing tracks first and then overdub vocals, rather than singing live with the instruments, meant that the recordings, according to Stills and Young in particular, didn't capture the sound of the group's live performance, and sounded sterile. Stills and Young thought they'd fixed some of that in the mono mix, which they spent ten days on, but then Stone and Greene did the stereo mix without consulting the band, in less than two days, and the album was released at precisely the time that stereo was starting to overtake mono in the album market. I'm using the mono mixes in this podcast, but for decades the only versions available were the stereo ones, which Stills and Young both loathed. Ahmet Ertegun also apparently thought that the demo versions of the songs -- some of which were eventually released on a box set in 2001 -- were much better than the finished studio recordings.\n\nThe album was not a success on release, but it did contain the first song any of the group had written to chart. Soon after its release, Van Dyke Parks' friend Lenny Waronker was producing a single by a group who had originally been led by Sly Stone and had been called Sly and the Mojo Men. By this time Stone was no longer involved in the group, and they were making music in a very different style from the music their former leader would later become known for. Parks was brought in to arrange a baroque-pop version of Stills' album track \"Sit Down I Think I Love You\" for the group, and it became their only top forty hit, reaching number thirty-six:\n\n[Excerpt: The Mojo Men, \"Sit Down I Think I Love You\"]\n\nIt was shortly after the first Buffalo Springfield album was released, though, that Steve Stills wrote what would turn out to be *his* group's only top forty single.\n\nThe song had its roots in both LA and San Francisco. The LA roots were more obvious -- the song was written about a specific experience Stills had had. He had been driving to Sunset Strip from Laurel Canyon on November the twelfth 1966, and he had seen a mass of young people and police in riot gear, and he had immediately turned round, partly because he didn't want to get involved in what looked to be a riot, and partly because he'd been inspired -- he had the idea for a lyric, which he pretty much finished in the car even before he got home:\n\n[Excerpt: The Buffalo Springfield, \"For What it's Worth\"]\n\nThe riots he saw were what became known later as the Riot on Sunset Strip. This was a minor skirmish between the police and young people of LA -- there had been complaints that young people had been spilling out of the nightclubs on Sunset Strip into the street, causing traffic problems, and as a result the city council had introduced various heavy-handed restrictions, including a ten PM curfew for all young people in the area, removing the permits that many clubs had which allowed people under twenty-one to be present, forcing the Whisky A-Go-Go to change its name just to \"the Whisk\", and forcing a club named Pandora's Box, which was considered the epicentre of the problem, to close altogether.\n\nFlyers had been passed around calling for a \"funeral\" for Pandora's Box -- a peaceful gathering at which people could say goodbye to a favourite nightspot, and a thousand people had turned up. The police also turned up, and in the heavy-handed way common among law enforcement, they managed to provoke a peaceful party and turn it into a riot.\n\nThis would not normally be an event that would be remembered even a year later, let alone nearly sixty years later, but Sunset Strip was the centre of the American rock music world in the period, and of the broader youth entertainment field. Among those arrested at the riot, for example, were Jack Nicholson and Peter Fonda, neither of whom were huge stars at the time, but who were making cheap B-movies with Roger Corman for American International Pictures.\n\nAmong the cheap exploitation films that American International Pictures made around this time was one based on the riots, though neither Nicholson, Fonda, or Corman were involved. Riot on Sunset Strip was released in cinemas only four months after the riots, and it had a theme song by Dewey Martin's old colleagues The Standells, which is now regarded as a classic of garage rock:\n\n[Excerpt: The Standells, \"Riot on Sunset Strip\"]\n\nThe riots got referenced in a lot of other songs, as well. The Mothers of Invention's second album, Absolutely Free, contains the song \"Plastic People\" which includes this section:\n\n[Excerpt: The Mothers of Invention, \"Plastic People\"]\n\nAnd the Monkees track \"Daily Nightly\", written by Michael Nesmith, was always claimed by Nesmith to be an impressionistic portrait of the riots, though the psychedelic lyrics sound to me more like they're talking about drug use and street-walking sex workers than anything to do with the riots:\n\n[Excerpt: The Monkees, \"Daily Nightly\"]\n\nBut the song about the riots that would have the most lasting effect on popular culture was the one that Steve Stills wrote that night. Although how much he actually wrote, at least of the music, is somewhat open to question. Earlier that month, Buffalo Springfield had spent some time in San Francisco. They hadn't enjoyed the experience -- as an LA band, they were thought of as a bunch of Hollywood posers by most of the San Francisco scene, with the exception of one band, Moby Grape -- a band who, like them had three guitarist/singer/songwriters, and with whom they got on very well.\n\nIndeed, they got on rather better with Moby Grape than they were getting on with each other at this point, because Young and Stills would regularly get into arguments, and every time their argument seemed to be settling down, Dewey Martin would manage to say the wrong thing and get Stills riled up again -- Martin was doing a lot of speed at this point and unable to stop talking, even when it would have been politic to do so. There was even some talk while they were in San Francisco of the bands doing a trade -- Young and Pete Lewis of Moby Grape swapping places -- though that came to nothing.\n\nBut Stills, according to both Richard Davis and Pete Lewis, had been truly impressed by two Moby Grape songs. One of them was a song called \"On the Other Side\", which Moby Grape never recorded, but which apparently had a chorus that went \"Stop, can’t you hear the music ringing in your ear, right before you go, telling you the way is clear,\" with the group all pausing after the word \"Stop\". The other was a song called \"Murder in my Heart for the Judge\":\n\n[Excerpt: Moby Grape, \"Murder in my Heart for the Judge\"]\n\nThe song Stills wrote had a huge amount of melodic influence from that song, and quite a bit from “On the Other Side”, though he apparently didn't notice until after the record came out, at which point he apologised to Moby Grape.\n\nStills wasn't massively impressed with the song he'd written, and went to Stone and Greene's office to play it for them, saying \"I'll play it, for what it's worth\". They liked the song and booked a studio to get the song recorded and rush-released, though according to Neil Young neither Stone nor Greene were actually present at the session, and the song was recorded on December the fifth, while some outbursts of rioting were still happening, and released on December the twenty-third.\n\n[Excerpt: Buffalo Springfield, \"For What it's Worth\"]\n\nThe song didn't have a title when they recorded it, or so Stills thought, but when he mentioned this to Greene and Stone afterwards, they said \"Of course it does. You said, 'I'm going to play the song, 'For What It's Worth'\"\n\nSo that became the title, although Ahmet Ertegun didn't like the idea of releasing a single with a title that wasn't in the lyric, so the early pressings of the single had \"Stop, Hey, What's That Sound?\" in brackets after the title.\n\nThe song became a big hit, and there's a story told by David Crosby that doesn't line up correctly, but which might shed some light on why. According to Crosby, \"Nowadays Clancy Can't Even Sing\" got its first airplay because Crosby had played members of Buffalo Springfield a tape he'd been given of the unreleased Beatles track \"A Day in the Life\", and they'd told their gangster manager-producers about it. Those manager-producers had then hired a sex worker to have sex with Crosby and steal the tape, which they'd then traded to a radio station in return for airplay.\n\nThat timeline doesn't work, unless the sex worker involved was also a time traveller,  because \"A Day in the Life\" wasn't even recorded until January 1967 while \"Clancy\" came out in August 1966, and there'd been two other singles released between then and January 1967. But it *might* be the case that that's what happened with \"For What It's Worth\", which was released in the last week of December 1966, and didn't really start to do well on the charts for a couple of months.\n\nRight after recording the song, the group went to play a residency in New York, of which Ahmet Ertegun said “When they performed there, man, there was no band I ever heard that had the electricity of that group. That was the most exciting group I’ve ever seen, bar none. It was just mind-boggling.”\n\nDuring that residency they were joined on stage at various points by Mitch Ryder, Odetta, and Otis Redding.\n\nWhile in New York, the group also recorded \"Mr. Soul\", a song that Young had originally written as a folk song about his experiences with epilepsy, the nature of the soul, and dealing with fame. However, he'd noticed a similarity to \"Satisfaction\" and decided to lean into it. The track as finally released was heavily overdubbed by Young a few months later, but after it was released he decided he preferred the original take, which by then only existed as a scratchy acetate, which got released on a box set in 2001:\n\n[Excerpt: Buffalo Springfield, \"Mr. Soul (original version)\"]\n\nEveryone has a different story of how the session for that track went -- at least one version of the story has Otis Redding turning up for the session and saying he wanted to record the song himself, as his follow-up to his version of \"Satisfaction\", but Young being angry at the idea. According to other versions of the story, Greene and Stills got into a physical fight, with Greene having to be given some of the valium Young was taking for his epilepsy to calm him down.\n\n\"For What it's Worth\" was doing well enough on the charts that the album was recalled, and reissued with \"For What It's Worth\" replacing Stills' song \"Baby Don't Scold\", but soon disaster struck the band. Bruce Palmer was arrested on drugs charges, and was deported back to Canada just as the song started to rise through the charts. The group needed a new bass player, fast. For a lipsynch appearance on local TV they got Richard Davis to mime the part, and then they got in Ken Forssi, the bass player from Love, for a couple of gigs. They next brought in Ken Koblun, the bass player from the Squires, but he didn't fit in with the rest of the group.\n\nThe next replacement was Jim Fielder. Fielder was a friend of the group, and knew the material -- he'd subbed for Palmer a few times in 1966 when Palmer had been locked up after less serious busts. And to give some idea of how small a scene the LA scene was, when Buffalo Springfield asked him to become their bass player, he was playing rhythm guitar for the Mothers of Invention, while Billy Mundi was on drums, and had played on their second, as yet unreleased, album, Absolutely Free:\n\n[Excerpt: The Mothers of Invention, \"Call any Vegetable\"]\n\nAnd before joining the Mothers, Fielder and Mundi had also played together with Van Dyke Parks, who had served his own short stint as a Mother of Invention already, backing Tim Buckley on Buckley's first album:\n\n[Excerpt: Tim Buckley, \"Aren't You the Girl?\"]\n\nAnd the arrangements on that album were by Jack Nitzsche, who would soon become a very close collaborator with Young.\n\n\"For What it's Worth\" kept rising up the charts. Even though it had been inspired by a very local issue, the lyrics were vague enough that people in other situations could apply it to themselves, and it soon became regarded as an anti-war protest anthem -- something Stills did nothing to discourage, as the band were all opposed to the war.\n\nThe band were also starting to collaborate with other people. When Stills bought a new house, he couldn't move in to it for a while, and so Peter Tork invited him to stay at his house. The two got on so well that Tork invited Stills to produce the next Monkees album -- only to find that Michael Nesmith had already asked Chip Douglas to do it.\n\nThe group started work on a new album, provisionally titled \"Stampede\", but sessions didn't get much further than Stills' song \"Bluebird\" before trouble arose between Young and Stills. The root of the argument seems to have been around the number of songs each got on the album. With Richie Furay also writing, Young was worried that given the others' attitudes to his songwriting, he might get as few as two songs on the album. And Young and Stills were arguing over which song should be the next single, with Young wanting \"Mr. Soul\" to be the A-side, while Stills wanted \"Bluebird\" -- Stills making the reasonable case that they'd released two Neil Young songs as singles and gone nowhere, and then they'd released one of Stills', and it had become a massive hit. \"Bluebird\" was eventually chosen as the A-side, with \"Mr. Soul\" as the B-side:\n\n[Excerpt: Buffalo Springfield, \"Bluebird\"]\n\nThe \"Bluebird\" session was another fraught one. Fielder had not yet joined the band, and session player Bobby West subbed on bass.\n\nNeil Young had recently started hanging out with Jack Nitzsche, and the two were getting very close and working on music together. Young had impressed Nitzsche not just with his songwriting but with his arrogance -- he'd played Nitzsche his latest song, \"Expecting to Fly\", and Nitzsche had said halfway through \"That's a great song\", and Young had shushed him and told him to listen, not interrupt. Nitzsche, who had a monstrous ego himself and was also used to working with people like Phil Spector, the Rolling Stones and Sonny Bono, none of them known for a lack of faith in their own abilities, was impressed.\n\nShortly after that, Stills had asked Nitzsche to produce \"Bluebird\", but Nitzsche had refused, saying he only worked with Neil. Ahmet Ertegun ended up producing, but Nitzsche still came along to the session, where he saw Stills pressuring Young to play on the track, saying \"You're the lead guitarist, play it!\", while Young insisted that it was Stills' song, Stills should play lead guitar, until the stress got so bad Young had a seizure. After he recovered from the seizure, he played on the track, trading licks with Stills:\n\n[Excerpt: Buffalo Springfield, \"Bluebird\"]\n\nErtegun tried to give the group a dose of reality at the session, trying to show them that they didn't yet have the status to act like this, saying \"You will have to stop this. This is ridiculous. You see, this is Jack Nitzsche over here, and if he picks up that guitar over there and hits me in the head with it, that goes in Cashbox magazine—front page. If you two guys beat each other bloody, no one cares. No Cashbox magazine.  Understand?”\n\nThe message supposedly sank in, but as Young started working with Nitzsche, he would still get infuriated when told by Nitzsche's associates that Nitzsche couldn't just drop everything any time Young wanted to record, telling them \"I'm not just anybody, I'm *Neil Young*\"\n\nYoung and Nitzsche worked together on \"Expecting to Fly\", with Nitzsche cutting the backing track with Wrecking Crew players, and a backing vocal group consisting of Gloria Jones, Merry Clayton, Gracia Nitzsche, and Brenda and Patrice Holloway, while Young was touring with the group, and Young coming back to add vocals.\n\nThere was one last-minute change to the song after it was recorded. They had recorded the song in May 1967, and then the Beatles released Sgt Pepper's Lonely Hearts Club Band, with its famous ending chord of \"A Day in the Life\":\n\n[Excerpt: The Beatles, \"A Day in the Life\"]\n\nYoung and Nitzsche had planned a similarly impressive last chord for \"Expecting to Fly\", but when they heard that, they quickly snipped the end of the track and stuck it on at the beginning instead, reversing the tape for the opening chord so it faded in rather than out:\n\n[Excerpt: Buffalo Springfield, \"Expecting to Fly\"]\n\nThe song itself shows the clear influence that the Beach Boys' Pet Sounds was having on Young at this time:\n\n[Excerpt: Buffalo Springfield, \"Expecting to Fly\"]\n\nYoung was becoming more and more convinced that he should leave the group and just work with Nitzsche. He started actually hiding from the other band members -- one time Nitzsche came home and found Young hiding in Nitzsche's son's bedroom, and Young told him that if Steve Stills came looking for him, Nitzsche should say that Young wasn't there and that Stills couldn't search the room because his kid was sleeping -- apparently Young had said he was quitting the group, Stills had stolen Young's guitar in an effort to force Young back, and Young was now afraid that Stills was going to beat him over the head with the guitar.\n\nMeanwhile, Bruce Palmer had sneaked across the border -- he'd cut his hair, got a pair of glasses and a suit, and disguised himself as a respectable businessman -- so he was back in the band and Jim Fielder was out, dumped from the group with no warning. He would soon go on to join Al Kooper in a new group, Blood, Sweat, & Tears.\n\nBut even though Palmer, Young's old friend, was back, Young himself left the group. The group were booked on the Tonight Show with Johnny Carson, one of the most prestigious national TV spots imaginable, but Young didn't think it was the right show for the group, and said he wouldn't be doing it. The rest of the band tried to persuade him and thought they had, but then he just didn't show up for the show. Dewey Martin called his friend Otis Redding and asked if Redding would sub for Young on the show, singing \"Mr. Soul\", the song he'd wanted to do when he heard it, but Redding was booked to play five shows that day at the Apollo and couldn't make the live time-slot, so the group ended up cancelling their appearance.\n\nTo replace Young, the group got in guitarist Doug Hastings, of the band The Daily Flash:\n\n[Excerpt: The Daily Flash, \"Jack of Diamonds\"]\n\nThe new lineup played a couple of low-profile gigs, before playing Monterey, where David Crosby guested with the group, and they did their first performance of a song that Crosby had helped Stills write, though he was never given credit for it, \"Rock and Roll Woman\", inspired by Grace Slick:\n\n[Excerpt: Buffalo Springfield, \"Rock and Roll Woman (live at Monterey)\"]\n\nThe group's performance at Monterey was legendarily bad, but it did introduce Stills to several new musicians -- soon he would regularly be jamming with Buddy Miles, Jimi Hendrix, Crosby, and Noel Redding, as well as occasionally with Peter Tork and Micky Dolenz, and starting to imitate Hendrix's guitar style. He's said since that Hendrix taught him how to properly play lead guitar, and that Hendrix was his guitar mentor.\n\nMeanwhile, Young had convinced Jack Nitzsche, and Nitzsche's new production and management partner Denny Bruce, the former second drummer for the Mothers of Invention, that the three of them should move to England and start a new solo career for Young there. Young collected together things he had heard that people didn't have in the UK, to take over and shock British people with, like Road Runner cartoons and a waterpik -- a machine that sprays water on your teeth to act like dental floss -- which he decided he was going to squirt Mick Jagger with. Nitzsche and Bruce got passports, and Nitzsche even sold his house to finance the trip.\n\nAnd then the three of them went to IHOP for breakfast, and on the way back they were listening to the radio when they heard \"Mr. Soul\" come on, with the DJ afterward saying \"When Neil was with ’em, baby.” Young immediately decided he wasn't going to England any more -- he was going to rejoin Buffalo Springfield.\n\nNeil was with them again, baby, and the group's second album, Buffalo Springfield Again, would be its best, with three songs each for Young and Furay and four for Stills. Young's songs were \"Expecting to Fly\", \"Mr. Soul\", and a long psychedelic epic, \"Broken Arrow\", which started with a fake-live performance of \"Mr. Soul\" sung by Dewey Martin (with screams flown in from a Beatles live recording the group somehow had access to):\n\n[Excerpt: Buffalo Springfield, \"Broken Arrow\"]\n\nBefore going into a folk-rock verse:\n\n[Excerpt: Buffalo Springfield, \"Broken Arrow\"]\n\nAn orchestral chorus influenced by Nitzsche:\n\n[Excerpt: Buffalo Springfield, \"Broken Arrow\"]\n\nA rendition of \"Take Me Out to the Ball Game\":\n\n[Excerpt: Buffalo Springfield, \"Broken Arrow\"]\n\nAnd a clarinet-led jazz band:\n\n[Excerpt: Buffalo Springfield, \"Broken Arrow\"]\n\nAs well as \"Bluebird\", Stills also contributed \"Rock and Roll Woman\", on which it's claimed Crosby guested, while Richie Furay showed the country-rock direction the group was starting to go in with his song \"A Child's Claim to Fame\", written about his frustration with Young, on which James Burton guested on dobro:\n\n[Excerpt: Buffalo Springfield, \"A Child's Claim to Fame\"]\n\nBuffalo Springfield Again is a genuinely great album, but it didn't make the top forty, and nor did any of the three singles from it, and increasingly the band members were starting to go in their own directions. Stills at this point desperately wanted to be Jimi Hendrix, and would jam with him every chance he got and imitate Hendrix's moves on stage, and Young thought this was pathetic -- he thought Stills didn't need to be Hendrix, that he should be himself. Stills was also guesting on records by his friends. He played lead guitar on \"Lady's Baby\", a song Peter Tork was working on with the Monkees, though the song wouldn't be released for thirty years:\n\n[Excerpt: The Monkees, \"Lady's Baby\"]\n\nAnd played bass on \"Night in the City\" from Joni Mitchell's first album, which was being produced by David Crosby:\n\n[Excerpt: Joni Mitchell, \"Night in the City\"]\n\nIn November 1967 the group went on a tour with the Beach Boys, and the Strawberry Alarm Clock, the first of two legs, the second of which was scheduled for the Spring of 1968. Bruce Palmer was friends with Owsley, the main supplier of LSD on the West Coast, and thus had an almost limitless supply, which he used pretty much every day, leading to erratic behaviour. At one show on the Beach Boys tour, Palmer wore a monk's robe and a beret, spent the first part of the show screaming at the other band members to get their guitars tuned faster, then threw his bass on the stage and stormed off, spending the rest of the set stood at the side of the stage sucking his finger, while Stills covered for him by playing bass instead.\n\nAfter the tour, on January the twenty-sixth, 1968, Stills and Young got into a physical fight before a show, which Dewey Martin had to break up. After the gig, Bruce Palmer was stopped by the police while driving without a license, carrying an open container of alcohol, in a car with an underage girl who was carrying cannabis. Unsurprisingly, he was deported again, and this time he was replaced by Jim Messina, who had been engineering some of the recordings the group were making.\n\nJust before the spring leg of the Beach Boys tour, there was a drug bust at a jam session with some of the group and Eric Clapton, which Stills escaped by crawling out of the window while the police were coming in. For a time it looked like both Young and Clapton might be deported, but Stills had managed to contact good lawyers while the rest of the group were arrested, so the charges were negotiated down to a single fine of three hundred dollars plus three years probation for Stills' old friend Chris Sarns.\n\nThen the first few dates of the tour, which was planned for the southern US, were cancelled after the murder of Martin Luther King. And then when they played Jacksonville, Young's mother and brother came to see the show, Dewey Martin took his top off and jumped into the audience, and the police overreacted, dragging him out and stopping the show, telling the band that they needed to get off stage immediately or be arrested. They all did, except for Young, who was having another seizure. “I saw Neil laying there,” said Messina. “I went over to make sure he was still alive and I noticed this one tear in his eye. He was totally silent. And I thought to myself at the time, ‘I think we’ve embarrassed him. His family was there to see him and this happens.’ I felt bad. I bet that night was a deciding factor in Neil’s life to get away from the Springfield.”\n\nStills has also consistently said that on that tour, Young and Mike Love were up to something, and that Love is ultimately responsible for Young eventually leaving the group again. He's said \"The inside story on that tour was Mike Love turning into this svengali influence on Neil. It was weird. They were always off in a corner, whispering. And Mike Love is just a spooky character.\"\n\nNo-one has ever said what Young and Love were whispering about, but the Beach Boys were going through some minor personnel disruptions of their own at that time -- Bruce Johnston had left the band for a couple of months and then returned -- and they were just about to start touring with additional musicians for the first time, so Love may have been sounding Young out to join the Beach Boys as a touring guitarist or similar. It's also notable that on one live recording of a Young solo show from 1968, he's introduced as \"Brother recording artist Neil Young\" -- Brother Records was the label the Beach Boys set up around this time, though Young never recorded for it. Perhaps there were plans for him to do so at one point?\n\nEither way, the group split up. Furay and Messina pieced together a final contractual obligation album from old sessions and some new songs the two of them worked on, one of which would be Furay's most notable songwriting contribution to the group:\n\n[Excerpt: Buffalo Springfield, \"Kind Woman\"]\n\nBut that album, Last Time Around, wasn't a success either artistically or commercially. Furay and Messina went on to form a country-rock band, Poco, and Messina later famously formed a duo with Kenny Loggins. We won't be having any future episodes on either of them, but they're likely to pop up in episodes on other artists.\n\nDewey Martin and Bruce Palmer, sadly, won't. Palmer had mental health problems for much of the rest of his life, and only released one solo album, in 1971, a jazz-funk-psychedelic album called The Cycle is Complete, which had four tracks, all of them extended jams called things like \"Alpha-Omega-Apocalypse\":\n\n[Excerpt: Bruce Palmer, \"Alpha-Omega-Apocalypse\"]\n\nDewey Martin, meanwhile, was not ready to give up. He formed New Buffalo Springfield, with Gary Rowles, who would later be the lead guitarist in the 1969-1971 lineup of Love, Jim Price, who would later be a respected session horn player, and Dave Price, who was one of Davy Jones' standins for the Monkees TV series. The rest of his former bandmates sued him, and he eventually settled for being allowed to call his band New Buffalo (though it would often perform as New Buffalo Springfield anyway) in return for all his future royalties for the original group's music.\n\nThat group fell apart, but Martin and Dave Price formed a second lineup of the group, which toured as New Buffalo Springfield, New Buffalo, and Blue Buffalo, and which featured Randy Fuller, Bobby Fuller's brother. Blue Buffalo then sacked Martin and changed their name to Blue Mountain Eagle, who recorded one album, plus a non-album single -- a version of Steve Stills' song \"Marianne\":\n\n[Excerpt: Blue Mountain Eagle, \"Marianne\"]\n\nRandy Fuller left Blue Mountain Eagle and joined Dewey Martin's new band, Dewey Martin and Medicine Ball, who also recorded one album, only one track of which, \"Indian Child\", seems to have made it into any kind of digital release, and I'm not going to excerpt that here because it's a string of offensive cliches about native Americans.\n\nBruce Palmer also guested on that album, and Palmer would later play bass on Neil Young's album Trans and the resulting tour, which saw them making music that was very different from their Buffalo Springfield years, even on the one remake of a Buffalo Springfield song included on the album and tour:\n\n[Excerpt: Neil Young, \"Mr. Soul (Live in Berlin)\"]\n\nBut for the most part, both Palmer and Martin spent the next several decades touring, together and separately, in bands called things like The Springfield Band, Buffalo Springfield Revisited, White Buffalo, and Buffalo Springfield Again. Sadly, when there was an actual reunion of Buffalo Springfield in 2011, both had already died -- Palmer in 2004 and Martin in 2009.\n\nAs for the group's two leaders, they felt uncomfortable being even on the same record label, so Ahmet Ertegun chose to keep Stills on Atlantic and to drop Young, who moved on to Warners and made an album with Jack Nitzsche arranging, which was very much in the style of \"Expecting to Fly\" and \"Broken Arrow\":\n\n[Excerpt: Neil Young, \"The Old Laughing Lady\"]\n\nI don't think it's too much of a spoiler to say we'll probably be hearing more from Neil Young in future episodes.\n\nAs for Steve Stills, his next major contribution to a record was also his next major success. Al Kooper had recorded half an album with Mike Bloomfield, Fast Eddie Hoh, and a couple of members of the Electric Flag, but Bloomfield couldn't make the second session, so Kooper called in Stills to replace him. The resulting album was released as \"Super Session\", credited to Bloomfield, Kooper, and Stills:\n\n[Excerpt: Steve Stills and Al Kooper, \"Season of the Witch\"]\n\nSuper Session went to number twelve and became a gold-selling album, and was the first hugely successful album in a new trend, the \"supergroup\", in which former members of several successful bands would get together and record as a new group. We'll see a few of those in 1968 and 69.\n\nKooper apparently enjoyed working with Stills enough that he asked him to join Blood Sweat and Tears as their new vocalist -- though by all accounts Kooper himself had apparently already been kicked out of the band by that point, and it's hard to see Stills and Jim Fielder working well together in a band after Stills had sacked Fielder with no warning. Stills declined, but the idea of doing something like the Super Session again did appeal to him. All he needed was a couple more musicians.\n\nBut that, of course, is a story for another time...",
  "itunes:subtitle": "Episode 152 of A History of Rock Music in Five Hundred Songs looks at “For What Its Worth”, and the short but eventful career of Buffalo Springfield. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPa",
  "itunes:keywords": "\"Fast\" Eddie Hoh,Ahmet Ertegun,Al Kooper,Buffalo Springfield,Chris Hillman,David Crosby,Grace Slick,Hank Garland,Jack Nicholson,Jack Nitzsche,Jake Holmes,Jimi Hendrix,John Kay,John Peel,Joni Mitchell,Mike Love,Moby Grape,Modern Folk Quartet,Mothers of Invention,Neil Young,Otis Redding,Peter Tork,Randy Bachman,Richey Furay,Rick James,Steppenwolf,Steve Stills,The Beach Boys,The Byrds,The Dillards,The Guess Who,the Monkees,Tim Buckley,Tim Rose,Tom Wilson,Van Dyke Parks",
  "itunes:episodeType": "full",
  "itunes:episode": 152,
  "content:encoded": "Episode 152 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “For What It's Worth”, and the short but eventful career of Buffalo Springfield. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a twenty-five-minute bonus episode available, <a href=\"https://www.patreon.com/posts/71228480\">on \"By the Time I Get to Phoenix\" by Glen Campbell</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n<strong>Erratum: </strong>I say Moby Grape never recorded the song \"On the Other Side\", but someone in the comments has pointed me to a demo of it which was released under the name \"Stop\"\n\n\n\n\n<strong>Resources</strong>\n\n\nAs usual, there's a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-152-for-what-its-worth/\">Mixcloud mix</a> containing all the songs excerpted in the episode.\n\n<a href=\"https://amzn.to/3KxxoKc\">This four-CD box set</a> is the definitive collection of Buffalo Springfield's work, while if you want the mono version of the second album, the stereo version of the first, and the final album as released, but no demos or outtakes, you want <a href=\"https://amzn.to/3R0f13j\">this more recent box set</a>.\n\n<a href=\"https://amzn.to/3wECy1B\"><em>For What It's Worth: The Story of Buffalo Springfield</em></a> by Richey Furay and John Einarson is obviously Furay's version of the story, but all the more interesting for that.\n\nFor information on Steve Stills' early life I used <a href=\"https://amzn.to/3CHmnV4\"><em>Stephen Stills: Change Partners </em>by David Roberts. </a>\n\nInformation on both Stills and Young comes from <a href=\"https://amzn.to/3pWqpkA\"><em>Crosby, Stills, Nash, and Young</em> by David Browne. </a>\n\n<a href=\"https://amzn.to/3R0LmH8\">Jimmy McDonough's <em>Shakey</em></a> is the definitive biography of Neil Young, while <a href=\"https://amzn.to/3wERYCS\">Young's <em>Waging Heavy Peace</em> is his autobiography.</a>\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nA quick note before we begin -- this episode deals with various disabilities. In particular, there are descriptions of epileptic seizures that come from non-medically-trained witnesses, many of whom took ableist attitudes towards the seizures. I don't know enough about epilepsy to know how accurate their descriptions and perceptions are, and I apologise if that means that by repeating some of their statements, I am inadvertently passing on myths about the condition. When I talk about this, I am talking about the after-the-fact recollections of musicians, none of them medically trained and many of them in altered states of consciousness, about events that had happened decades earlier. Please do not take anything said in a podcast about music history as being the last word on the causes or effects of epileptic seizures, rather than how those musicians remember them.\n\nAnyway, on with the show.\n\nOne of the things you notice if you write about protest songs is that a lot of the time, the songs that people talk about as being important or impactful have aged very poorly. Even great songwriters like Bob Dylan or John Lennon, when writing material about the political events of the time, would write material they would later acknowledge was far from their best. Too often a song will be about a truly important event, and be powered by a real sense of outrage at injustice, but it will be overly specific, and then as soon as the immediate issue is no longer topical, the song is at best a curio.\n\nFor example, the sentencing of the poet and rock band manager John Sinclair to ten years in prison for giving two joints to an undercover police officer was hugely controversial in the early seventies, but by the time John Lennon's song about it was released, Sinclair had been freed by the Supreme Court, and very, very few people would use the song as an example of why Lennon's songwriting still has lasting value:\n\n[Excerpt: John Lennon, \"John Sinclair\"]\n\nBut there are exceptions, and those tend to be songs where rather than talking about specific headlines, the song is about the emotion that current events have caused. Ninety years on from its first success, for example, \"Brother, Can You Spare a Dime?\" still has resonance, because there are still people who are put out of work through no fault of their own, and even those of us who are lucky enough to be financially comfortable have the fear that all too soon it may end, and we may end up like Al begging on the streets:\n\n[Excerpt: Rudy Vallee, \"Brother Can You Spare a Dime?\"]\n\nAnd because of that emotional connection, sometimes the very best protest songs can take on new lives and new meanings, and connect with the way people feel about totally unrelated subjects. Take Buffalo Springfield's one hit. The actual subject of the song couldn't be any more trivial in the grand scheme of things -- a change in zoning regulations around the Sunset Strip that meant people under twenty-one couldn't go to the clubs after 10PM, and the subsequent reaction to that -- but because rather than talking about the specific incident, Steve Stills instead talked about the emotions that it called up, and just noted the fleeting images that he was left with, the song became adopted as an anthem by soldiers in Vietnam. Sometimes what a song says is nowhere near as important as how it says it.\n\n[Excerpt: Buffalo Springfield, \"For What It's Worth\"]\n\nSteve Stills seems almost to have been destined to be a musician, although the instrument he started on, the drums, was not the one for which he would become best known. According to Stills, though, he always had an aptitude for rhythm, to the extent that he learned to tapdance almost as soon as he had learned to walk.\n\nHe started on drums aged eight or nine, after somebody gave him a set of drumsticks. After his parents got sick of him damaging the furniture by playing on every available surface, an actual drum kit followed, and that became his principal instrument, even after he learned to play the guitar at military school, as his roommate owned one.\n\nAs a teenager, Stills developed an idiosyncratic taste in music, helped by the record collection of his friend Michael Garcia. He didn't particularly like most of the pop music of the time, but he was a big fan of pre-war country music, Motown, girl-group music -- he especially liked the Shirelles -- and Chess blues. He was also especially enamoured of the music of Jimmy Reed, a passion he would later share with his future bandmate Neil Young:\n\n[Excerpt: Jimmy Reed, \"Baby, What You Want Me To Do?\"]\n\nIn his early teens, he became the drummer for a band called the Radars, and while he was drumming he studied their lead guitarist, Chuck Schwin.  He said later \"There was a whole little bunch of us who were into kind of a combination of all the blues guys and others including Chet Atkins, Dick Dale, and Hank Marvin: a very weird cross-section of far-out guitar players.\"\n\nStills taught himself to play like those guitarists, and in particular he taught himself how to emulate Atkins' Travis-picking style, and became remarkably proficient at it. There exists a recording of him, aged sixteen, singing one of his own songs and playing finger-picked guitar, and while the song is not exactly the strongest thing I've ever heard lyrically, it's clearly the work of someone who is already a confident performer:\n\n[Excerpt: Stephen Stills, \"Travellin'\"]\n\nBut the main reason he switched to becoming a guitarist wasn't because of his admiration for Chet Atkins or Hank Marvin, but because he started driving and discovered that if you have to load a drum kit into your car and then drive it to rehearsals and gigs you either end up bashing up your car or bashing up the drum kit. As this is not a problem with guitars, Stills decided that he'd move on from the Radars, and join a band named the Continentals as their rhythm guitarist, playing with lead guitarist Don Felder.\n\nStills was only in the Continentals for a few months though, before being replaced by another guitarist, Bernie Leadon, and in general Stills' whole early life is one of being uprooted and moved around. His father had jobs in several different countries, and while for the majority of his time Stills was in the southern US, he also ended up spending time in Costa Rica -- and staying there as a teenager even as the rest of his family moved to El Salvador.\n\nEventually, aged eighteen, he moved to New Orleans, where he formed a folk duo with a friend, Chris Sarns. The two had very different tastes in folk music -- Stills preferred Dylan-style singer-songwriters, while Sarns liked the clean sound of the Kingston Trio -- but they played together for several months before moving to Greenwich Village, where they performed together and separately.\n\nThey were latecomers to the scene, which had already mostly ended, and many of the folk stars had already gone on to do bigger things. But Stills still saw plenty of great performers there -- Miles Davis and Dizzy Gillespie and Thelonius Monk in the jazz clubs, Woody Allen, Lenny Bruce, and Richard Pryor in the comedy ones, and Simon and Garfunkel, Richie Havens, Fred Neil and Tim Hardin in the folk ones -- Stills said that other than Chet Atkins, Havens, Neil, and Hardin were the people most responsible for his guitar style.\n\nStills was also, at this time, obsessed with Judy Collins' third album -- the album which had featured Roger McGuinn on banjo and arrangements, and which would soon provide several songs for the Byrds to cover:\n\n[Excerpt: Judy Collins, \"Turn, Turn, Turn\"]\n\nJudy Collins would soon become a very important figure in Stills' life, but for now she was just the singer on his favourite record.\n\nWhile the Greenwich Village folk scene was no longer quite what it had been a year or two earlier, it was still a great place for a young talented musician to perform. As well as working with Chris Sarns, Stills also formed a trio with his friend John Hopkins and a banjo player called Peter Tork who everyone said looked just like Stills.\n\nTork soon headed out west to seek his fortune, and then Stills got headhunted to join the Au Go Go Singers. This was a group that was being set up in the same style as the New Christy Minstrels -- a nine-piece vocal and instrumental group that would do clean-sounding versions of currently-popular folk songs. The group were signed to Roulette Records, and recorded one album, They Call Us Au-Go-Go Singers, produced by Hugo and Luigi, the production duo we've previously seen working with everyone from the Tokens to the Isley Brothers.\n\nMuch of the album is exactly the same kind of thing that a million New Christy Minstrels soundalikes were putting out -- and Stills, with his raspy voice, was clearly intended to be the Barry McGuire of this group -- but there was one exception -- a song called \"High Flyin' Bird\", on which Stills was able to show off the sound that would later make him famous, and which became so associated with him that even though it was written by Billy Edd Wheeler, the writer of \"Jackson\", even the biography of Stills I used in researching this episode credits \"High Flyin' Bird\" as being a Stills original:\n\n[Excerpt: The Au-Go-Go Singers, \"High Flyin' Bird\"]\n\nOne of the other members of the Au-Go-Go Singers, Richie Furay, also got to sing a lead vocal on the album, on the Tom Paxton song \"Where I'm Bound\":\n\n[Excerpt: The Au-Go-Go Singers, \"Where I'm Bound\"]\n\nThe Au-Go-Go Singers got a handful of dates around the folk scene, and Stills and Furay became friendly with another singer playing the same circuit, Gram Parsons. Parsons was one of the few people they knew who could see the value in current country music, and convinced both Stills and Furay to start paying more attention to what was coming out of Nashville and Bakersfield.\n\nBut soon the Au-Go-Go Singers split up. Several venues where they might otherwise have been booked were apparently scared to book an act that was associated with Morris Levy, and also the market for big folk ensembles dried up more or less overnight when the Beatles hit the music scene.\n\nBut several of the group -- including Stills but not Furay -- decided they were going to continue anyway, and formed a group called The Company, and they went on a tour of Canada. And one of the venues they played was the Fourth Dimension coffee house in Fort William, Ontario, and there their support act was a rock band called The Squires:\n\n[Excerpt: The Squires, \"(I'm a Man And) I Can't Cry\"]\n\nThe lead guitarist of the Squires, Neil Young, had a lot in common with Stills, and they bonded instantly. Both men had parents who had split up when they were in their teens, and had a successful but rather absent father and an overbearing mother. And both had shown an interest in music even as babies. According to Young's mother, when he was still in nappies, he would pull himself up by the bars  of his playpen and try to dance every time he heard \"Pinetop's Boogie Woogie\":\n\n[Excerpt: Pinetop Smith, \"Pinetop's Boogie Woogie\"]\n\nYoung, though, had had one crucial experience which Stills had not had. At the age of six, he'd come down with polio, and become partially paralysed. He'd spent months in hospital before he regained his ability to walk, and the experience had also affected him in other ways. While he was recovering, he would draw pictures of trains -- other than music, his big interest, almost an obsession, was with electric train sets, and that obsession would remain with him throughout his life -- but for the first time he was drawing with his right hand rather than his left.\n\nHe later said \"The left-hand side got a little screwed. Feels different from the right. If I close my eyes, my left side, I really don’t know where it is—but over the years I’ve discovered that almost one hundred percent for sure it’s gonna be very close to my right side … probably to the left.\n\nThat’s why I started appearing to be ambidextrous, I think. Because polio affected my left side, and I think I was left-handed when I was born. What I have done is use the weak side as the dominant one because the strong side was injured.\"\n\nBoth Young's father Scott Young -- a very famous Canadian writer and sports broadcaster, who was by all accounts as well known in Canada during his lifetime as his son -- and Scott's brother played ukulele, and they taught Neil how to play, and his first attempt at forming a group had been to get his friend Comrie Smith to get a pair of bongos and play along with him to Preston Epps' \"Bongo Rock\":\n\n[Excerpt: Preston Epps, \"Bongo Rock\"]\n\nNeil Young had liked all the usual rock and roll stars of the fifties  -- though in his personal rankings, Elvis came a distant third behind Little Richard and Jerry Lee Lewis -- but his tastes ran more to the more darkly emotional. He loved \"Maybe\" by the Chantels, saying \"Raw soul—you cannot miss it. That’s the real thing. She was believin’ every word she was singin’.\"\n\n[Excerpt: The Chantels, \"Maybe\"]\n\nWhat he liked more than anything was music that had a mainstream surface but seemed slightly off-kilter. He was a major fan of Roy Orbison, saying, \"it’s almost impossible to comprehend the depth of that soul. It’s so deep and dark it just keeps on goin’ down—but it’s not black. It’s blue, deep blue. He’s just got it. The drama. There’s something sad but proud about Roy’s music\", and he would say similar things about Del Shannon, saying \"He struck me as the ultimate dark figure—behind some Bobby Rydell exterior, y’know? “Hats Off to Larry,” “Runaway,” “Swiss Maid”—very, very inventive. The stuff was weird. Totally unaffected.\"\n\nMore surprisingly, perhaps, he was a particular fan of Bobby Darin, who he admired so much because Darin could change styles at the drop of a hat, going from novelty rock and roll like \"Splish Splash\" to crooning \"Mack The Knife\" to singing Tim Hardin songs like \"If I Were a Carpenter\", without any of them seeming any less authentic. As he put it later \"He just changed. He’s completely different. And he’s really into it. Doesn’t sound like he’s not there. “Dream Lover,” “Mack the Knife,” “If I Were a Carpenter,” “Queen of the Hop,” “Splish Splash”—tell me about those records, Mr. Darin. Did you write those all the same day, or what happened? He just changed so much. Just kinda went from one place to another. So it’s hard to tell who Bobby Darin really was.\"\n\nAnd one record which Young was hugely influenced by was Floyd Cramer's country instrumental, \"Last Date\":\n\n[Excerpt: Floyd Cramer, \"Last Date\"]\n\nNow, that was a very important record in country music, and if you want to know more about it I strongly recommend listening to the episode of Cocaine and Rhinestones on the Nashville A-Team, which has a long section on the track, but the crucial thing to know about that track is that it's one of the earliest examples of what is known as slip-note playing, where the piano player, before hitting the correct note, briefly hits the note a tone below it, creating a brief discord. Young absolutely loved that sound, and wanted to make a sound like that on the guitar. And then, when he and his mother moved to Winnipeg after his parents' divorce, he found someone who was doing just that.\n\nIt was the guitarist in a group variously known as Chad Allan and the Reflections and Chad Allan and the Expressions. That group had relatives in the UK who would send them records, and so where most Canadian bands would do covers of American hits, Chad Allan and the Reflections would do covers of British hits, like their version of Geoff Goddard's \"Tribute to Buddy Holly\", a song that had originally been produced by Joe Meek:\n\n[Excerpt: Chad Allan and the Reflections, \"Tribute to Buddy Holly\"]\n\nThat would later pay off for them in a big way, when they recorded a version of Johnny Kidd and the Pirates' \"Shakin' All Over\", for which their record label tried to create an air of mystery by releasing it with no artist name, just \"Guess Who?\" on the label. It became a hit, the name stuck, and they became The Guess Who:\n\n[Excerpt: The Guess Who, \"Shakin' All Over\"]\n\nBut at this point they, and their guitarist Randy Bachman, were just another group playing around Winnipeg. Bachman, though, was hugely impressive to Neil Young for a few reasons. The first was that he really did have a playing style that was a lot like the piano style of Floyd Cramer -- Young would later say \"it was Randy Bachman who did it first. Randy was the first one I ever heard do things on the guitar that reminded me of Floyd. He’d do these pulls—“darrr darrrr,” this two-note thing goin’ together—harmony, with one note pulling and the other note stayin’ the same.\"\n\nBachman also had built the first echo unit that Young heard a guitarist play in person. He'd discovered that by playing with the recording heads on a tape recorder owned by his mother, he could replicate the tape echo that Sam Phillips had used at Sun Studios -- and once he'd attached that to his amplifier, he realised how much the resulting sound sounded like his favourite guitarist, Hank Marvin of the Shadows, another favourite of Neil Young's:\n\n[Excerpt: The Shadows, \"Man of Mystery\"]\n\nYoung soon started looking to Bachman as something of a mentor figure, and he would learn a lot of guitar techniques second hand from Bachman -- every time a famous musician came to the area, Bachman would go along and stand right at the front and watch the guitarist, and make note of the positions their fingers were in. Then Bachman would replicate those guitar parts with the Reflections, and Neil Young would stand in front of him and make notes of where *his* fingers were.\n\nYoung joined a band on the local circuit called the Esquires, but soon either quit or was fired, depending on which version of the story you choose to believe. He then formed his own rival band, the Squires, with no \"e\", much to the disgust of his ex-bandmates. In July 1963, five months after they formed, the  Squires released their first record, \"Aurora\" backed with \"The Sultan\", on a tiny local label. Both tracks were very obviously influenced by the Shadows:\n\n[Excerpt: The Squires, \"Aurora\"]\n\nThe Squires were a mostly-instrumental band for the first year or so they were together, and then the Beatles hit North America, and suddenly people didn't want to hear surf instrumentals and Shadows covers any more, they only wanted to hear songs that sounded a bit like the Beatles. The Squires started to work up the appropriate repertoire -- two songs that have been mentioned as in their set at this point are the Beatles album track \"It Won't Be Long\", and \"Money\" which the Beatles had also covered -- but they didn't have a singer, being an instrumental group.\n\nThey could get in a singer, of course, but that would mean splitting the money with another person. So instead, the guitarist, who had never had any intention of becoming a singer, was more or less volunteered for the role. Over the next eighteen months or so the group's repertoire moved from being largely instrumental to largely vocal, and the group also seem to have shuttled around a bit between two different cities -- Winnipeg and Fort William, staying in one for a while and then moving back to the other. They travelled between the two in Young's car, a Buick Roadmaster hearse.\n\nIn Winnipeg, Young first met up with a singer named Joni Anderson, who was soon to get married to Chuck Mitchell and would become better known by her married name. The two struck up a friendship, though by all accounts never a particularly close one -- they were too similar in too many ways; as Mitchell later said “Neil and I have a lot in common: Canadian; Scorpios; polio in the same epidemic, struck the same parts of our body; and we both have a black sense of humor\". They were both also idiosyncratic artists who never fit very well into boxes.\n\nIn Fort William the Squires made a few more records, this time vocal tracks like \"I'll Love You Forever\":\n\n[Excerpt: The Squires, \"I'll Love You Forever\"]\n\nIt was also in Fort William that Young first encountered two acts that would make a huge impression on him. One was a group called The Thorns, consisting of Tim Rose, Jake Holmes, and Rich Husson. The Thorns showed Young that there was interesting stuff being done on the fringes of the folk music scene. He later said \"One of my favourites was “Oh Susannah”—they did this arrangement that was bizarre. It was in a minor key, which completely changed everything—and it was rock and roll. So that idea spawned arrangements of all these other songs for me. I did minor versions of them all. We got into it. That was a certain Squires stage that never got recorded. Wish there were tapes of those shows. We used to do all this stuff, a whole kinda music—folk-rock. We took famous old folk songs like “Clementine,” “She’ll Be Comin’ ’Round the Mountain,” “Tom Dooley,” and we did them all in minor keys based on the Tim Rose arrangement of “Oh Susannah.”\n\nThere are no recordings of the Thorns in existence that I know of, but presumably that arrangement that Young is talking about is the version that Rose also later did with the Big 3, which we've heard in a few other episodes:\n\n[Excerpt: The Big 3, \"The Banjo Song\"]\n\nThe other big influence was, of course, Steve Stills, and the two men quickly found themselves influencing each other deeply. Stills realised that he could bring more rock and roll to his folk-music sound, saying that what amazed him was the way the Squires could go from \"Cottonfields\" (the Lead Belly song) to \"Farmer John\", the R&B song by Don and Dewey that was becoming a garage-rock staple.\n\nYoung in turn was inspired to start thinking about maybe going more in the direction of folk music. The Squires even renamed themselves the High-Flying Birds, after the song that Stills had recorded with the Au Go Go Singers.\n\nAfter The Company's tour of Canada, Stills moved back to New York for a while. He now wanted to move in a folk-rock direction, and for a while he tried to persuade his friend John Sebastian to let him play bass in his new band, but when the Lovin' Spoonful decided against having him in the band, he decided to move West to San Francisco, where he'd heard there was a new music scene forming.\n\nHe enjoyed a lot of the bands he saw there, and in particular he was impressed by the singer of a band called the Great Society:\n\n[Excerpt: The Great Society, \"Somebody to Love\"]\n\nHe was much less impressed with the rest of her band, and seriously considered going up to her and asking if she wanted to work with some *real* musicians instead of the unimpressive ones she was working with, but didn't get his nerve up. We will, though, be hearing more about Grace Slick in future episodes.\n\nInstead, Stills decided to move south to LA, where many of the people he'd known in Greenwich Village were now based. Soon after he got there, he hooked up with two other musicians, a guitarist named Steve Young and a singer, guitarist, and pianist named Van Dyke Parks. Parks had a record contract at MGM -- he'd been signed by Tom Wilson, the same man who had turned Dylan electric, signed Simon and Garfunkel, and produced the first albums by the Mothers of Invention. With Wilson, Parks put out a couple of singles in 1966, \"Come to the Sunshine\":\n\n[Excerpt: The Van Dyke Parks, \"Come to the Sunshine\"]\n\nAnd \"Number Nine\", a reworking of the Ode to Joy from Beethoven's Ninth Symphony:\n\n[Excerpt: The Van Dyke Parks, \"Number Nine\"]Parks, Stills, and Steve Young became The Van Dyke Parks Band, though they didn't play together for very long, with their most successful performance being as the support act for the Lovin' Spoonful for a show in Arizona. But they did have a lasting resonance -- when Van Dyke Parks finally got the chance to record his first solo album, he opened it with Steve Young singing the old folk song \"Black Jack Davy\", filtered to sound like an old tape:\n\n[Excerpt: Steve Young, \"Black Jack Davy\"]\n\nAnd then it goes into a song written for Parks by Randy Newman, but consisting of Newman's ideas about Parks' life and what he knew about him, including that he had been third guitar in the Van Dyke Parks Band:\n\n[Excerpt: Van Dyke Parks, \"Vine Street\"]\n\nParks and Stills also wrote a few songs together, with one of their collaborations, \"Hello, I've Returned\", later being demoed by Stills for Buffalo Springfield:\n\n[Excerpt: Steve Stills, \"Hello, I've Returned\"]\n\nAfter the Van Dyke Parks Band fell apart, Parks went on to many things, including a brief stint on keyboards in the Mothers of Invention, and we'll be talking more about him next episode.\n\nStills formed a duo called the Buffalo Fish, with his friend Ron Long. That soon became an occasional trio when Stills met up again with his old Greenwich Village friend Peter Tork, who joined the group on the piano. But then Stills auditioned for the Monkees and was turned down because he had bad teeth -- or at least that's how most people told the story. Stills has later claimed that while he turned up for the Monkees auditions, it wasn't to audition, it was to try to pitch them songs, which seems implausible on the face of it. According to Stills, he was offered the job and turned it down because he'd never wanted it. But whatever happened, Stills suggested they might want his friend Peter, who looked just like him apart from having better teeth, and Peter Tork got the job.\n\nBut what Stills really wanted to do was to form a proper band. He'd had the itch to do it ever since seeing the Squires, and he decided he should ask Neil Young to join. There was only one problem -- when he phoned Young, the phone was answered by Young's mother, who told Stills that Neil had moved out to become a folk singer, and she didn't know where he was.\n\nBut then Stills heard from his old friend Richie Furay. Furay was still in Greenwich Village, and had decided to write to Stills. He didn't know where Stills was, other than that he was in California somewhere, so he'd written to Stills' father in El Salvador. The letter had been returned, because the postage had been short by one cent, so Furay had resent it with the correct postage. Stills' father had then forwarded the letter to the place Stills had been staying in San Francisco, which had in turn forwarded it on to Stills in LA. Furay's letter mentioned this new folk singer who had been on the scene for a while and then disappeared again, Neil Young, who had said he knew Stills, and had been writing some great songs, one of which Furay had added to his own set.\n\nStills got in touch with Furay and told him about this great band he was forming in LA, which he wanted Furay to join. Furay was in, and travelled from New York to LA, only to be told that at this point there were no other members of this great band, but they'd definitely find some soon. They got a publishing deal with Columbia/Screen Gems, which gave them enough money to not starve, but what they really needed was to find some other musicians.\n\nThey did, when driving down Hollywood Boulevard on April the sixth, 1966. There, stuck in traffic going the other way, they saw a hearse...\n\nAfter Steve Stills had left Fort William, so had Neil Young. He hadn't initially intended to -- the High-Flying Birds still had a regular gig, but Young and some of his friends had gone away for a few days on a road trip in his hearse. But unfortunately the transmission on the hearse had died, and Young and his friends had been stranded. Many years later, he would write a eulogy to the hearse, which he and Stills would record together:\n\n[Excerpt: The Stills-Young Band, \"Long May You Run\"]\n\nYoung and his friends had all hitch-hiked in different directions -- Young had ended up in Toronto, where his dad lived, and had stayed with his dad for a while. The rest of his band had eventually followed him there, but Young found the Toronto music scene not to his taste -- the folk and rock scenes there were very insular and didn't mingle with each other, and the group eventually split up. Young even took on a day job for a while, for the only time in his life, though he soon quit.\n\nYoung started basically commuting between Toronto and New York, a distance of several hundred miles, going to Greenwich Village for a while before ending up back in Toronto, and ping-ponging between the two. In New York, he met up with Richie Furay, and also had a disastrous audition for Elektra Records as a solo artist.\n\nOne of the songs he sang in the audition was \"Nowadays Clancy Can't Even Sing\", the song which Furay liked so much he started performing it himself. Young doesn't normally explain his songs, but as this was one of the first he ever wrote, he talked about it in interviews in the early years, before he decided to be less voluble about his art. The song was apparently about the sense of youthful hope being crushed. The instigation for it was Young seeing his girlfriend with another man, but the central image, of Clancy not singing, came from Young's schooldays. The Clancy in question was someone Young liked as one of the other weird kids at school. He was disabled, like Young, though with MS rather than polio, and he would sing to himself in the hallways at school.\n\nSadly, of course, the other kids would mock and bully him for that, and eventually he ended up stopping. Young said about it \"After awhile, he got so self-conscious he couldn’t do his thing any more. When someone who is as beautiful as that and as different as that is actually killed by his fellow man—you know what I mean—like taken and sorta chopped down—all the other things are nothing compared to this.\"\n\n[Excerpt: Neil Young, \"Nowadays Clancy Can't Even Sing (Elektra demo)\"]\n\nOne thing I should say for anyone who listens to the Mixcloud for this episode, that song, which will be appearing in a couple of different versions, has one use of a term for Romani people that some (though not all) consider a slur. It's not in the excerpts I'll be using in this episode, but will be in the full versions on the Mixcloud. Sadly that word turns up time and again in songs of this era...\n\nWhen he wasn't in New York, Young was living in Toronto in a communal apartment owned by a folk singer named Vicki Taylor, where many of the Toronto folk scene would stay. Young started listening a lot to Taylor's Bert Jansch albums, which were his first real exposure to the British folk-baroque style of guitar fingerpicking, as opposed to the American Travis-picking style, and Young would soon start to incorporate that style into his own playing:\n\n[Excerpt: Bert Jansch, \"Angie\"]\n\nAnother guitar influence on Young at this point was another of the temporary tenants of Taylor's flat, John Kay, who would later go on to be one of the founding members of Steppenwolf. Young credited Kay with having a funky rhythm guitar style that Young incorporated into his own.\n\nWhile he was in Toronto, he started getting occasional gigs in Detroit, which is \"only\" a couple of hundred miles away, set up by Joni and Chuck Mitchell, both of whom also sometimes stayed at Taylor's. And it was in Detroit that Neil Young became, albeit very briefly, a Motown artist.\n\nThe Mynah Birds were a band in Toronto that had at one point included various future members of Steppenwolf, and they were unusual for the time in that they were a white band with a Black lead singer, Ricky Matthews. They also had a rich manager, John Craig Eaton, the heir to the Eaton's department store fortune, who basically gave them whatever money they wanted -- they used to go to his office and tell him they needed seven hundred dollars for lunch, and he'd hand it to them. They were looking for a new guitarist when Bruce Palmer, their bass player, bumped into Neil Young carrying an amp and asked if he was interested in joining. He was.\n\nThe Mynah Birds quickly became one of the best bands in Toronto, and Young and Matthews became close, both as friends and as a performance team. People who saw them live would talk about things like a song called “Hideaway”, written by Young and Matthews, which had a spot in the middle where Young would start playing a harmonica solo, throw the harmonica up in the air mid-solo, Matthews would catch it, and he would then finish the solo.\n\nThey got signed to Motown, who were at this point looking to branch out into the white guitar-group market, and they were put through the Motown star-making machine. They recorded an entire album, which remains unreleased, but they did release a single, \"It's My Time\":\n\n[Excerpt: The Mynah Birds, \"It's My Time\"]\n\nOr at least, they released a handful of promo copies. The single was pulled from release after Ricky Matthews got arrested. It turned out his birth name wasn't Ricky Matthews, but James Johnson, and that he wasn't from Toronto as he'd told everyone, but from Buffalo, New York. He'd fled to Canada after going AWOL from the Navy, not wanting to be sent to Vietnam, and he was arrested and jailed for desertion.\n\nAfter getting out of jail, he would start performing under yet another name, and as Rick James would have a string of hits in the seventies and eighties:\n\n[Excerpt: Rick James, \"Super Freak\"]\n\nMost of the rest of the group continued gigging as The Mynah Birds, but Young and Palmer had other plans. They sold the expensive equipment Eaton had bought the group, and Young bought a new hearse, which he named Mort 2 – Mort had been his first hearse.\n\nAnd according to one of the band's friends in Toronto, the crucial change in their lives came when Neil Young heard a song on a jukebox:\n\n[Excerpt: The Mamas and the Papas, \"California Dreamin'\"]\n\nYoung apparently heard \"California Dreamin'\" and immediately said \"Let's go to California and become rock stars\".\n\nNow, Young later said of this anecdote that \"That sounds like a Canadian story to me. That sounds too real to be true\", and he may well be right. Certainly the actual wording of the story is likely incorrect -- people weren't talking about \"rock stars\" in 1966. Google's Ngram viewer has the first use of the phrase in print being in 1969, and the phrase didn't come into widespread usage until surprisingly late -- even granting that phrases enter slang before they make it to print, it still seems implausible.\n\nBut even though the precise wording might not be correct, something along those lines definitely seems to have happened, albeit possibly less dramatically. Young's friend Comrie Smith independently said that Young told him “Well, Comrie, I can hear the Mamas and the Papas singing ‘All the leaves are brown, and the skies are gray …’ I’m gonna go down to the States and really make it. I’m on my way. Today North Toronto, tomorrow the world!”\n\nYoung and Palmer loaded up Mort 2 with a bunch of their friends and headed towards California. On the way, they fell out with most of the friends, who parted from them, and Young had an episode which in retrospect may have been his first epileptic seizure. They decided when they got to California that they were going to look for Steve Stills, as they'd heard he was in LA and neither of them knew anyone else in the state. But after several days of going round the Sunset Strip clubs asking if anyone knew Steve Stills, and sleeping in the hearse as they couldn't afford anywhere else, they were getting fed up and about to head off to San Francisco, as they'd heard there was a good music scene there, too. They were going to leave that day, and they were stuck in traffic on Sunset Boulevard, about to head off, when Stills and Furay came driving in the other direction.\n\nFuray happened to turn his head, to brush away a fly, and saw a hearse with Ontario license plates. He and Stills both remembered that Young drove a hearse, and so they assumed it must be him. They started honking at the hearse, then did a U-turn. They got Young's attention, and they all pulled into the parking lot at Ben Frank's, the Sunset Strip restaurant that attracted such a hip crowd the Monkees' producers had asked for \"Ben Frank's types\" in their audition advert.\n\nYoung introduced Stills and Furay to Palmer, and now there *was* a group -- three singing, songwriting, guitarists and a bass player. Now all they needed was a drummer.\n\nThere were two drummers seriously considered for the role. One of them, Billy Mundi, was technically the better player, but Young didn't like playing with him as much -- and Mundi also had a better offer, to join the Mothers of Invention as their second drummer -- before they'd recorded their first album, they'd had two drummers for a few months, but Denny Bruce, their second drummer, had become ill with glandular fever and they'd reverted to having Jimmy Carl Black play solo. Now they were looking for someone else, and Mundi took that role.\n\nThe other drummer, who Young preferred anyway, was another Canadian, Dewey Martin. Martin was a couple of years older than the rest of the group, and by far the most experienced. He'd moved from Canada to Nashville in his teens, and according to Martin he had been taken under the wing of Hank Garland, the great session guitarist most famous for \"Sugarfoot Rag\":\n\n[Excerpt: Hank Garland, \"Sugarfoot Rag\"]\n\nWe heard Garland playing with Elvis and others in some of the episodes around 1960, and by many reckonings he was the best session guitarist in Nashville, but in 1961 he had a car accident that left him comatose, and even though he recovered from the coma and lived another thirty-three years, he never returned to recording.\n\nAccording to Martin, though, Garland would still sometimes play jazz clubs around Nashville after the accident, and one day Martin walked into a club and saw him playing. The drummer he was playing with got up and took a break, taking his sticks with him, so Martin got up on stage and started playing, using two combs instead of sticks. Garland was impressed, and told Martin that Faron Young needed a drummer, and he could get him the gig.\n\nAt the time Young was one of the biggest stars in country music. That year, 1961, he had three country top ten hits, including a number one with his version of Willie Nelson's \"Hello Walls\", produced by Ken Nelson:\n\n[Excerpt: Faron Young, \"Hello Walls\"]\n\nMartin joined Faron Young's band for a while, and also ended up playing short stints in the touring bands of various other Nashville-based country and rock stars, including Patsy Cline, Roy Orbison, and the Everly Brothers, before heading to LA for a while. Then Mel Taylor of the Ventures hooked him up with some musicians in the Pacific Northwest scene, and Martin started playing there under the name Sir Raleigh and the Coupons with various musicians. After a while he travelled back to LA where he got some members of the LA group Sons of Adam to become a permanent lineup of Coupons, and they recorded several singles with Martin singing lead, including the Tommy Boyce and Steve Venet song \"Tomorrow's Gonna Be Another Day\", later recorded by the Monkees:\n\n[Excerpt: Sir Raleigh and the Coupons, \"Tomorrow's Gonna Be Another Day\"]\n\nHe then played with the Standells, before joining the Modern Folk Quartet for a short while, as they were transitioning from their folk sound to a folk-rock style. He was only with them for a short while, and it's difficult to get precise details -- almost everyone involved with Buffalo Springfield has conflicting stories about their own careers with timelines that don't make sense, which is understandable given that people were talking about events decades later and memory plays tricks. \"Fast\" Eddie Hoh had joined the Modern Folk Quartet on drums in late 1965, at which point they became the Modern Folk Quintet, and nothing I've read about that group talks about Hoh ever actually leaving, but apparently Martin joined them in February 1966, which might mean he's on their single \"Night-Time Girl\", co-written by Al Kooper and produced and arranged by Jack Nitzsche:\n\n[Excerpt: The Modern Folk Quintet, \"Night-Time Girl\"]\n\nAfter that, Martin was taken on by the Dillards, a bluegrass band who are now possibly most famous for having popularised the Arthur \"Guitar Boogie\" Smith song \"Duellin' Banjos\", which they recorded on their first album and played on the Andy Griffith Show a few years before it was used in Deliverance:\n\n[Excerpt: The Dillards, \"Duellin' Banjos\"]\n\nThe Dillards had decided to go in a country-rock direction -- and Doug Dillard would later join the Byrds and make records with Gene Clark -- but they were hesitant about it, and after a brief period with Martin in the band they decided to go back to their drummerless lineup. To soften the blow, they told him about another band that was looking for a drummer -- their manager, Jim Dickson, who was also the Byrds' manager, knew Stills and his bandmates. Dewey Martin was in the group.\n\nThe group still needed a name though. They eventually took their name from a brand of steam roller, after seeing one on the streets when some roadwork was being done. Everyone involved disagrees as to who came up with the name. Steve Stills at one point said it was a group decision after Neil Young and the group's manager Frazier Mohawk stole the nameplate off the steamroller, and later Stills said that Richey Furay had suggested the name while they were walking down the street, Dewey Martin said it was his idea, Neil Young said that he, Steve Sills, and Van Dyke Parks had been walking down the street and either Young or Stills had seen the nameplate and suggested the name, and Van Dyke Parks says that *he* saw the nameplate and suggested it to Dewey Martin:\n\n[Excerpt: Steve Stills and Van Dyke Parks on the name]\n\nFor what it's worth, I tend to believe Van Dyke Parks in most instances -- he's an honest man, and he seems to have a better memory of the sixties than many of his friends who led more chemically interesting lives.\n\nWhoever came up with it, the name worked -- as Stills later put it \"We thought it was pretty apt, because Neil Young is from Manitoba which is buffalo country, and  Richie Furay was from Springfield, Ohio -- and I'm the field!\"\n\nIt almost certainly also helped that the word \"buffalo\" had been in the name of Stills' previous group, Buffalo Fish.\n\nOn the eleventh of April, 1966, Buffalo Springfield played their first gig, at the Troubadour, using equipment borrowed from the Dillards. Chris Hillman of the Byrds was in the audience and was impressed. He got the group a support slot on a show the Byrds and the Dillards were doing a few days later in San Bernardino. That show was compered by a Merseyside-born British DJ, John Ravenscroft, who had managed to become moderately successful in US radio by playing up his regional accent so he sounded more like the Beatles. He would soon return to the UK, and start broadcasting under the name John Peel.\n\nHillman also got them a week-long slot at the Whisky A-Go-Go, and a bidding war started between record labels to sign the band. Dunhill offered five thousand dollars, Warners counted with ten thousand, and then Atlantic offered twelve thousand. Atlantic were *just* starting to get interested in signing white guitar groups -- Jerry Wexler never liked that kind of music, always preferring to stick with soul and R&B, but Ahmet Ertegun could see which way things were going.\n\nAtlantic had only ever signed two other white acts before -- Neil Young's old favourite Bobby Darin, who had since left the label, and Sonny and Cher. And Sonny and Cher's management and production team, Brian Stone and Charlie Greene, were also very interested in the group, who even before they had made a record had quickly become the hottest band on the circuit, even playing the Hollywood Bowl as the Rolling Stones' support act. Buffalo Springfield already had managers -- Frazier Mohawk and Richard Davis, the lighting man at the Troubadour (who was sometimes also referred to as Dickie Davis, but I'll use his full name so as not to cause unnecessary confusion in British people who remember the sports TV presenter of the same name), who Mohawk had enlisted to help him. But Stone and Greene weren't going to let a thing like that stop them.\n\nAccording to anonymous reports quoted without attribution in David Roberts' biography of Stills -- so take this with as many grains of salt as you want -- Stone and Greene took Mohawk for a ride around LA in a limo, just the three of them, a gun, and a used hotdog napkin. At the end of the ride, the hotdog napkin had Mohawk's scrawled signature, signing the group over to Stone and Greene. Davis stayed on, but was demoted to just doing their lights.\n\nThe way things ended up, the group signed to Stone and Greene's production company, who then leased their masters to Atlantic's Atco subsidiary. A publishing company was also set up for the group's songs -- owned thirty-seven point five percent by Atlantic, thirty-seven point five percent by Stone and Greene, and the other twenty-five percent split six ways between the group and Davis, who they considered their sixth member.\n\nAlmost immediately, Charlie Greene started playing Stills and Young off against each other, trying a divide-and-conquer strategy on the group. This was quite easy, as both men saw themselves as natural leaders, though Stills was regarded by everyone as the senior partner -- the back cover of their first album would contain the line \"Steve is the leader but we all are\".\n\nStills and Young were the two stars of the group as far as the audience were concerned -- though most musicians who heard them play live say that the band's real strength was in its rhythm section, with people comparing Palmer's playing to that of James Jamerson. But Stills and Young would get into guitar battles on stage, one-upping each other, in ways that turned the tension between them in creative directions. Other clashes, though were more petty -- both men had very domineering mothers, who would actually call the group's management to complain about press coverage if their son was given less space than the other one.\n\nThe group were also not sure about Young's voice -- to the extent that Stills was known to jokingly apologise to the audience before Young took a lead vocal -- and so while the song chosen as the group's first A-side was Young's \"Nowadays Clancy Can't Even Sing\", Furay was chosen to sing it, rather than Young:\n\n[Excerpt: Buffalo Springfield, \"Nowadays Clancy Can't Even Sing\"]\n\nOn the group's first session, though, both Stills and Young realised that their producers didn't really have a clue -- the group had built up arrangements that had a complex interplay of instruments and vocals, but the producers insisted on cutting things very straightforwardly, with a basic backing track and then the vocals. They also thought that the song was too long so the group should play faster. Stills and Young quickly decided that they were going to have to start producing their own material, though Stone and Greene would remain the producers for the first album.\n\nThere was another bone of contention though, because in the session the initial plan had been for Stills' song \"Go and Say Goodbye\" to be the A-side with Young's song as the B-side. It was flipped, and nobody seems quite sure why -- it's certainly the case that, whatever the merits of the two tracks as songs, Stills' song was the one that would have been more likely to become a hit.\n\n\"Nowadays Clancy Can't Even Sing\" was a flop, but it did get some local airplay. The next single, \"Burned\", was a Young song as well, and this time did have Young taking the lead, though in a song dominated by harmonies:\n\n[Excerpt: Buffalo Springfield, \"Burned\"]\n\nOver the summer, though, something had happened that would affect everything for the group -- Neil Young had started to have epileptic seizures. At first these were undiagnosed episodes, but soon they became almost routine events, and they would often happen on stage, particularly at moments of great stress or excitement. Several other members of the group became convinced -- entirely wrongly -- that Young was faking these seizures in order to get women to pay attention to him. They thought that what he wanted was for women to comfort him and mop his brow, and that collapsing would get him that.\n\nThe seizures became so common that Richard Davis, the group's lighting tech, learned to recognise the signs of a seizure before it happened. As soon as it looked like Young was about to collapse the lights would turn on, someone would get ready to carry him off stage, and Richie Furay would know to grab Young's guitar before he fell so that the guitar wouldn't get damaged. Because they weren't properly grounded and Furay had an electric guitar of his own, he'd get a shock every time.\n\nYoung would later claim that during some of the seizures, he would hallucinate that he was another person, in another world, living another life that seemed to have its own continuity -- people in the other world would recognise him and talk to him as if he'd been away for a while -- and then when he recovered he would have to quickly rebuild his identity, as if temporarily amnesiac, and during those times he would find things like the concept of lying painful.\n\nThe group's first album came out in December, and they were very, very, unhappy with it. They thought the material was great, but they also thought that the production was terrible. Stone and Greene's insistence that they record the backing tracks first and then overdub vocals, rather than singing live with the instruments, meant that the recordings, according to Stills and Young in particular, didn't capture the sound of the group's live performance, and sounded sterile. Stills and Young thought they'd fixed some of that in the mono mix, which they spent ten days on, but then Stone and Greene did the stereo mix without consulting the band, in less than two days, and the album was released at precisely the time that stereo was starting to overtake mono in the album market. I'm using the mono mixes in this podcast, but for decades the only versions available were the stereo ones, which Stills and Young both loathed. Ahmet Ertegun also apparently thought that the demo versions of the songs -- some of which were eventually released on a box set in 2001 -- were much better than the finished studio recordings.\n\nThe album was not a success on release, but it did contain the first song any of the group had written to chart. Soon after its release, Van Dyke Parks' friend Lenny Waronker was producing a single by a group who had originally been led by Sly Stone and had been called Sly and the Mojo Men. By this time Stone was no longer involved in the group, and they were making music in a very different style from the music their former leader would later become known for. Parks was brought in to arrange a baroque-pop version of Stills' album track \"Sit Down I Think I Love You\" for the group, and it became their only top forty hit, reaching number thirty-six:\n\n[Excerpt: The Mojo Men, \"Sit Down I Think I Love You\"]\n\nIt was shortly after the first Buffalo Springfield album was released, though, that Steve Stills wrote what would turn out to be *his* group's only top forty single.\n\nThe song had its roots in both LA and San Francisco. The LA roots were more obvious -- the song was written about a specific experience Stills had had. He had been driving to Sunset Strip from Laurel Canyon on November the twelfth 1966, and he had seen a mass of young people and police in riot gear, and he had immediately turned round, partly because he didn't want to get involved in what looked to be a riot, and partly because he'd been inspired -- he had the idea for a lyric, which he pretty much finished in the car even before he got home:\n\n[Excerpt: The Buffalo Springfield, \"For What it's Worth\"]\n\nThe riots he saw were what became known later as the Riot on Sunset Strip. This was a minor skirmish between the police and young people of LA -- there had been complaints that young people had been spilling out of the nightclubs on Sunset Strip into the street, causing traffic problems, and as a result the city council had introduced various heavy-handed restrictions, including a ten PM curfew for all young people in the area, removing the permits that many clubs had which allowed people under twenty-one to be present, forcing the Whisky A-Go-Go to change its name just to \"the Whisk\", and forcing a club named Pandora's Box, which was considered the epicentre of the problem, to close altogether.\n\nFlyers had been passed around calling for a \"funeral\" for Pandora's Box -- a peaceful gathering at which people could say goodbye to a favourite nightspot, and a thousand people had turned up. The police also turned up, and in the heavy-handed way common among law enforcement, they managed to provoke a peaceful party and turn it into a riot.\n\nThis would not normally be an event that would be remembered even a year later, let alone nearly sixty years later, but Sunset Strip was the centre of the American rock music world in the period, and of the broader youth entertainment field. Among those arrested at the riot, for example, were Jack Nicholson and Peter Fonda, neither of whom were huge stars at the time, but who were making cheap B-movies with Roger Corman for American International Pictures.\n\nAmong the cheap exploitation films that American International Pictures made around this time was one based on the riots, though neither Nicholson, Fonda, or Corman were involved. Riot on Sunset Strip was released in cinemas only four months after the riots, and it had a theme song by Dewey Martin's old colleagues The Standells, which is now regarded as a classic of garage rock:\n\n[Excerpt: The Standells, \"Riot on Sunset Strip\"]\n\nThe riots got referenced in a lot of other songs, as well. The Mothers of Invention's second album, Absolutely Free, contains the song \"Plastic People\" which includes this section:\n\n[Excerpt: The Mothers of Invention, \"Plastic People\"]\n\nAnd the Monkees track \"Daily Nightly\", written by Michael Nesmith, was always claimed by Nesmith to be an impressionistic portrait of the riots, though the psychedelic lyrics sound to me more like they're talking about drug use and street-walking sex workers than anything to do with the riots:\n\n[Excerpt: The Monkees, \"Daily Nightly\"]\n\nBut the song about the riots that would have the most lasting effect on popular culture was the one that Steve Stills wrote that night. Although how much he actually wrote, at least of the music, is somewhat open to question. Earlier that month, Buffalo Springfield had spent some time in San Francisco. They hadn't enjoyed the experience -- as an LA band, they were thought of as a bunch of Hollywood posers by most of the San Francisco scene, with the exception of one band, Moby Grape -- a band who, like them had three guitarist/singer/songwriters, and with whom they got on very well.\n\nIndeed, they got on rather better with Moby Grape than they were getting on with each other at this point, because Young and Stills would regularly get into arguments, and every time their argument seemed to be settling down, Dewey Martin would manage to say the wrong thing and get Stills riled up again -- Martin was doing a lot of speed at this point and unable to stop talking, even when it would have been politic to do so. There was even some talk while they were in San Francisco of the bands doing a trade -- Young and Pete Lewis of Moby Grape swapping places -- though that came to nothing.\n\nBut Stills, according to both Richard Davis and Pete Lewis, had been truly impressed by two Moby Grape songs. One of them was a song called \"On the Other Side\", which Moby Grape never recorded, but which apparently had a chorus that went \"Stop, can’t you hear the music ringing in your ear, right before you go, telling you the way is clear,\" with the group all pausing after the word \"Stop\". The other was a song called \"Murder in my Heart for the Judge\":\n\n[Excerpt: Moby Grape, \"Murder in my Heart for the Judge\"]\n\nThe song Stills wrote had a huge amount of melodic influence from that song, and quite a bit from “On the Other Side”, though he apparently didn't notice until after the record came out, at which point he apologised to Moby Grape.\n\nStills wasn't massively impressed with the song he'd written, and went to Stone and Greene's office to play it for them, saying \"I'll play it, for what it's worth\". They liked the song and booked a studio to get the song recorded and rush-released, though according to Neil Young neither Stone nor Greene were actually present at the session, and the song was recorded on December the fifth, while some outbursts of rioting were still happening, and released on December the twenty-third.\n\n[Excerpt: Buffalo Springfield, \"For What it's Worth\"]\n\nThe song didn't have a title when they recorded it, or so Stills thought, but when he mentioned this to Greene and Stone afterwards, they said \"Of course it does. You said, 'I'm going to play the song, 'For What It's Worth'\"\n\nSo that became the title, although Ahmet Ertegun didn't like the idea of releasing a single with a title that wasn't in the lyric, so the early pressings of the single had \"Stop, Hey, What's That Sound?\" in brackets after the title.\n\nThe song became a big hit, and there's a story told by David Crosby that doesn't line up correctly, but which might shed some light on why. According to Crosby, \"Nowadays Clancy Can't Even Sing\" got its first airplay because Crosby had played members of Buffalo Springfield a tape he'd been given of the unreleased Beatles track \"A Day in the Life\", and they'd told their gangster manager-producers about it. Those manager-producers had then hired a sex worker to have sex with Crosby and steal the tape, which they'd then traded to a radio station in return for airplay.\n\nThat timeline doesn't work, unless the sex worker involved was also a time traveller,  because \"A Day in the Life\" wasn't even recorded until January 1967 while \"Clancy\" came out in August 1966, and there'd been two other singles released between then and January 1967. But it *might* be the case that that's what happened with \"For What It's Worth\", which was released in the last week of December 1966, and didn't really start to do well on the charts for a couple of months.\n\nRight after recording the song, the group went to play a residency in New York, of which Ahmet Ertegun said “When they performed there, man, there was no band I ever heard that had the electricity of that group. That was the most exciting group I’ve ever seen, bar none. It was just mind-boggling.”\n\nDuring that residency they were joined on stage at various points by Mitch Ryder, Odetta, and Otis Redding.\n\nWhile in New York, the group also recorded \"Mr. Soul\", a song that Young had originally written as a folk song about his experiences with epilepsy, the nature of the soul, and dealing with fame. However, he'd noticed a similarity to \"Satisfaction\" and decided to lean into it. The track as finally released was heavily overdubbed by Young a few months later, but after it was released he decided he preferred the original take, which by then only existed as a scratchy acetate, which got released on a box set in 2001:\n\n[Excerpt: Buffalo Springfield, \"Mr. Soul (original version)\"]\n\nEveryone has a different story of how the session for that track went -- at least one version of the story has Otis Redding turning up for the session and saying he wanted to record the song himself, as his follow-up to his version of \"Satisfaction\", but Young being angry at the idea. According to other versions of the story, Greene and Stills got into a physical fight, with Greene having to be given some of the valium Young was taking for his epilepsy to calm him down.\n\n\"For What it's Worth\" was doing well enough on the charts that the album was recalled, and reissued with \"For What It's Worth\" replacing Stills' song \"Baby Don't Scold\", but soon disaster struck the band. Bruce Palmer was arrested on drugs charges, and was deported back to Canada just as the song started to rise through the charts. The group needed a new bass player, fast. For a lipsynch appearance on local TV they got Richard Davis to mime the part, and then they got in Ken Forssi, the bass player from Love, for a couple of gigs. They next brought in Ken Koblun, the bass player from the Squires, but he didn't fit in with the rest of the group.\n\nThe next replacement was Jim Fielder. Fielder was a friend of the group, and knew the material -- he'd subbed for Palmer a few times in 1966 when Palmer had been locked up after less serious busts. And to give some idea of how small a scene the LA scene was, when Buffalo Springfield asked him to become their bass player, he was playing rhythm guitar for the Mothers of Invention, while Billy Mundi was on drums, and had played on their second, as yet unreleased, album, Absolutely Free:\n\n[Excerpt: The Mothers of Invention, \"Call any Vegetable\"]\n\nAnd before joining the Mothers, Fielder and Mundi had also played together with Van Dyke Parks, who had served his own short stint as a Mother of Invention already, backing Tim Buckley on Buckley's first album:\n\n[Excerpt: Tim Buckley, \"Aren't You the Girl?\"]\n\nAnd the arrangements on that album were by Jack Nitzsche, who would soon become a very close collaborator with Young.\n\n\"For What it's Worth\" kept rising up the charts. Even though it had been inspired by a very local issue, the lyrics were vague enough that people in other situations could apply it to themselves, and it soon became regarded as an anti-war protest anthem -- something Stills did nothing to discourage, as the band were all opposed to the war.\n\nThe band were also starting to collaborate with other people. When Stills bought a new house, he couldn't move in to it for a while, and so Peter Tork invited him to stay at his house. The two got on so well that Tork invited Stills to produce the next Monkees album -- only to find that Michael Nesmith had already asked Chip Douglas to do it.\n\nThe group started work on a new album, provisionally titled \"Stampede\", but sessions didn't get much further than Stills' song \"Bluebird\" before trouble arose between Young and Stills. The root of the argument seems to have been around the number of songs each got on the album. With Richie Furay also writing, Young was worried that given the others' attitudes to his songwriting, he might get as few as two songs on the album. And Young and Stills were arguing over which song should be the next single, with Young wanting \"Mr. Soul\" to be the A-side, while Stills wanted \"Bluebird\" -- Stills making the reasonable case that they'd released two Neil Young songs as singles and gone nowhere, and then they'd released one of Stills', and it had become a massive hit. \"Bluebird\" was eventually chosen as the A-side, with \"Mr. Soul\" as the B-side:\n\n[Excerpt: Buffalo Springfield, \"Bluebird\"]\n\nThe \"Bluebird\" session was another fraught one. Fielder had not yet joined the band, and session player Bobby West subbed on bass.\n\nNeil Young had recently started hanging out with Jack Nitzsche, and the two were getting very close and working on music together. Young had impressed Nitzsche not just with his songwriting but with his arrogance -- he'd played Nitzsche his latest song, \"Expecting to Fly\", and Nitzsche had said halfway through \"That's a great song\", and Young had shushed him and told him to listen, not interrupt. Nitzsche, who had a monstrous ego himself and was also used to working with people like Phil Spector, the Rolling Stones and Sonny Bono, none of them known for a lack of faith in their own abilities, was impressed.\n\nShortly after that, Stills had asked Nitzsche to produce \"Bluebird\", but Nitzsche had refused, saying he only worked with Neil. Ahmet Ertegun ended up producing, but Nitzsche still came along to the session, where he saw Stills pressuring Young to play on the track, saying \"You're the lead guitarist, play it!\", while Young insisted that it was Stills' song, Stills should play lead guitar, until the stress got so bad Young had a seizure. After he recovered from the seizure, he played on the track, trading licks with Stills:\n\n[Excerpt: Buffalo Springfield, \"Bluebird\"]\n\nErtegun tried to give the group a dose of reality at the session, trying to show them that they didn't yet have the status to act like this, saying \"You will have to stop this. This is ridiculous. You see, this is Jack Nitzsche over here, and if he picks up that guitar over there and hits me in the head with it, that goes in Cashbox magazine—front page. If you two guys beat each other bloody, no one cares. No Cashbox magazine.  Understand?”\n\nThe message supposedly sank in, but as Young started working with Nitzsche, he would still get infuriated when told by Nitzsche's associates that Nitzsche couldn't just drop everything any time Young wanted to record, telling them \"I'm not just anybody, I'm *Neil Young*\"\n\nYoung and Nitzsche worked together on \"Expecting to Fly\", with Nitzsche cutting the backing track with Wrecking Crew players, and a backing vocal group consisting of Gloria Jones, Merry Clayton, Gracia Nitzsche, and Brenda and Patrice Holloway, while Young was touring with the group, and Young coming back to add vocals.\n\nThere was one last-minute change to the song after it was recorded. They had recorded the song in May 1967, and then the Beatles released Sgt Pepper's Lonely Hearts Club Band, with its famous ending chord of \"A Day in the Life\":\n\n[Excerpt: The Beatles, \"A Day in the Life\"]\n\nYoung and Nitzsche had planned a similarly impressive last chord for \"Expecting to Fly\", but when they heard that, they quickly snipped the end of the track and stuck it on at the beginning instead, reversing the tape for the opening chord so it faded in rather than out:\n\n[Excerpt: Buffalo Springfield, \"Expecting to Fly\"]\n\nThe song itself shows the clear influence that the Beach Boys' Pet Sounds was having on Young at this time:\n\n[Excerpt: Buffalo Springfield, \"Expecting to Fly\"]\n\nYoung was becoming more and more convinced that he should leave the group and just work with Nitzsche. He started actually hiding from the other band members -- one time Nitzsche came home and found Young hiding in Nitzsche's son's bedroom, and Young told him that if Steve Stills came looking for him, Nitzsche should say that Young wasn't there and that Stills couldn't search the room because his kid was sleeping -- apparently Young had said he was quitting the group, Stills had stolen Young's guitar in an effort to force Young back, and Young was now afraid that Stills was going to beat him over the head with the guitar.\n\nMeanwhile, Bruce Palmer had sneaked across the border -- he'd cut his hair, got a pair of glasses and a suit, and disguised himself as a respectable businessman -- so he was back in the band and Jim Fielder was out, dumped from the group with no warning. He would soon go on to join Al Kooper in a new group, Blood, Sweat, & Tears.\n\nBut even though Palmer, Young's old friend, was back, Young himself left the group. The group were booked on the Tonight Show with Johnny Carson, one of the most prestigious national TV spots imaginable, but Young didn't think it was the right show for the group, and said he wouldn't be doing it. The rest of the band tried to persuade him and thought they had, but then he just didn't show up for the show. Dewey Martin called his friend Otis Redding and asked if Redding would sub for Young on the show, singing \"Mr. Soul\", the song he'd wanted to do when he heard it, but Redding was booked to play five shows that day at the Apollo and couldn't make the live time-slot, so the group ended up cancelling their appearance.\n\nTo replace Young, the group got in guitarist Doug Hastings, of the band The Daily Flash:\n\n[Excerpt: The Daily Flash, \"Jack of Diamonds\"]\n\nThe new lineup played a couple of low-profile gigs, before playing Monterey, where David Crosby guested with the group, and they did their first performance of a song that Crosby had helped Stills write, though he was never given credit for it, \"Rock and Roll Woman\", inspired by Grace Slick:\n\n[Excerpt: Buffalo Springfield, \"Rock and Roll Woman (live at Monterey)\"]\n\nThe group's performance at Monterey was legendarily bad, but it did introduce Stills to several new musicians -- soon he would regularly be jamming with Buddy Miles, Jimi Hendrix, Crosby, and Noel Redding, as well as occasionally with Peter Tork and Micky Dolenz, and starting to imitate Hendrix's guitar style. He's said since that Hendrix taught him how to properly play lead guitar, and that Hendrix was his guitar mentor.\n\nMeanwhile, Young had convinced Jack Nitzsche, and Nitzsche's new production and management partner Denny Bruce, the former second drummer for the Mothers of Invention, that the three of them should move to England and start a new solo career for Young there. Young collected together things he had heard that people didn't have in the UK, to take over and shock British people with, like Road Runner cartoons and a waterpik -- a machine that sprays water on your teeth to act like dental floss -- which he decided he was going to squirt Mick Jagger with. Nitzsche and Bruce got passports, and Nitzsche even sold his house to finance the trip.\n\nAnd then the three of them went to IHOP for breakfast, and on the way back they were listening to the radio when they heard \"Mr. Soul\" come on, with the DJ afterward saying \"When Neil was with ’em, baby.” Young immediately decided he wasn't going to England any more -- he was going to rejoin Buffalo Springfield.\n\nNeil was with them again, baby, and the group's second album, Buffalo Springfield Again, would be its best, with three songs each for Young and Furay and four for Stills. Young's songs were \"Expecting to Fly\", \"Mr. Soul\", and a long psychedelic epic, \"Broken Arrow\", which started with a fake-live performance of \"Mr. Soul\" sung by Dewey Martin (with screams flown in from a Beatles live recording the group somehow had access to):\n\n[Excerpt: Buffalo Springfield, \"Broken Arrow\"]\n\nBefore going into a folk-rock verse:\n\n[Excerpt: Buffalo Springfield, \"Broken Arrow\"]\n\nAn orchestral chorus influenced by Nitzsche:\n\n[Excerpt: Buffalo Springfield, \"Broken Arrow\"]\n\nA rendition of \"Take Me Out to the Ball Game\":\n\n[Excerpt: Buffalo Springfield, \"Broken Arrow\"]\n\nAnd a clarinet-led jazz band:\n\n[Excerpt: Buffalo Springfield, \"Broken Arrow\"]\n\nAs well as \"Bluebird\", Stills also contributed \"Rock and Roll Woman\", on which it's claimed Crosby guested, while Richie Furay showed the country-rock direction the group was starting to go in with his song \"A Child's Claim to Fame\", written about his frustration with Young, on which James Burton guested on dobro:\n\n[Excerpt: Buffalo Springfield, \"A Child's Claim to Fame\"]\n\nBuffalo Springfield Again is a genuinely great album, but it didn't make the top forty, and nor did any of the three singles from it, and increasingly the band members were starting to go in their own directions. Stills at this point desperately wanted to be Jimi Hendrix, and would jam with him every chance he got and imitate Hendrix's moves on stage, and Young thought this was pathetic -- he thought Stills didn't need to be Hendrix, that he should be himself. Stills was also guesting on records by his friends. He played lead guitar on \"Lady's Baby\", a song Peter Tork was working on with the Monkees, though the song wouldn't be released for thirty years:\n\n[Excerpt: The Monkees, \"Lady's Baby\"]\n\nAnd played bass on \"Night in the City\" from Joni Mitchell's first album, which was being produced by David Crosby:\n\n[Excerpt: Joni Mitchell, \"Night in the City\"]\n\nIn November 1967 the group went on a tour with the Beach Boys, and the Strawberry Alarm Clock, the first of two legs, the second of which was scheduled for the Spring of 1968. Bruce Palmer was friends with Owsley, the main supplier of LSD on the West Coast, and thus had an almost limitless supply, which he used pretty much every day, leading to erratic behaviour. At one show on the Beach Boys tour, Palmer wore a monk's robe and a beret, spent the first part of the show screaming at the other band members to get their guitars tuned faster, then threw his bass on the stage and stormed off, spending the rest of the set stood at the side of the stage sucking his finger, while Stills covered for him by playing bass instead.\n\nAfter the tour, on January the twenty-sixth, 1968, Stills and Young got into a physical fight before a show, which Dewey Martin had to break up. After the gig, Bruce Palmer was stopped by the police while driving without a license, carrying an open container of alcohol, in a car with an underage girl who was carrying cannabis. Unsurprisingly, he was deported again, and this time he was replaced by Jim Messina, who had been engineering some of the recordings the group were making.\n\nJust before the spring leg of the Beach Boys tour, there was a drug bust at a jam session with some of the group and Eric Clapton, which Stills escaped by crawling out of the window while the police were coming in. For a time it looked like both Young and Clapton might be deported, but Stills had managed to contact good lawyers while the rest of the group were arrested, so the charges were negotiated down to a single fine of three hundred dollars plus three years probation for Stills' old friend Chris Sarns.\n\nThen the first few dates of the tour, which was planned for the southern US, were cancelled after the murder of Martin Luther King. And then when they played Jacksonville, Young's mother and brother came to see the show, Dewey Martin took his top off and jumped into the audience, and the police overreacted, dragging him out and stopping the show, telling the band that they needed to get off stage immediately or be arrested. They all did, except for Young, who was having another seizure. “I saw Neil laying there,” said Messina. “I went over to make sure he was still alive and I noticed this one tear in his eye. He was totally silent. And I thought to myself at the time, ‘I think we’ve embarrassed him. His family was there to see him and this happens.’ I felt bad. I bet that night was a deciding factor in Neil’s life to get away from the Springfield.”\n\nStills has also consistently said that on that tour, Young and Mike Love were up to something, and that Love is ultimately responsible for Young eventually leaving the group again. He's said \"The inside story on that tour was Mike Love turning into this svengali influence on Neil. It was weird. They were always off in a corner, whispering. And Mike Love is just a spooky character.\"\n\nNo-one has ever said what Young and Love were whispering about, but the Beach Boys were going through some minor personnel disruptions of their own at that time -- Bruce Johnston had left the band for a couple of months and then returned -- and they were just about to start touring with additional musicians for the first time, so Love may have been sounding Young out to join the Beach Boys as a touring guitarist or similar. It's also notable that on one live recording of a Young solo show from 1968, he's introduced as \"Brother recording artist Neil Young\" -- Brother Records was the label the Beach Boys set up around this time, though Young never recorded for it. Perhaps there were plans for him to do so at one point?\n\nEither way, the group split up. Furay and Messina pieced together a final contractual obligation album from old sessions and some new songs the two of them worked on, one of which would be Furay's most notable songwriting contribution to the group:\n\n[Excerpt: Buffalo Springfield, \"Kind Woman\"]\n\nBut that album, Last Time Around, wasn't a success either artistically or commercially. Furay and Messina went on to form a country-rock band, Poco, and Messina later famously formed a duo with Kenny Loggins. We won't be having any future episodes on either of them, but they're likely to pop up in episodes on other artists.\n\nDewey Martin and Bruce Palmer, sadly, won't. Palmer had mental health problems for much of the rest of his life, and only released one solo album, in 1971, a jazz-funk-psychedelic album called The Cycle is Complete, which had four tracks, all of them extended jams called things like \"Alpha-Omega-Apocalypse\":\n\n[Excerpt: Bruce Palmer, \"Alpha-Omega-Apocalypse\"]\n\nDewey Martin, meanwhile, was not ready to give up. He formed New Buffalo Springfield, with Gary Rowles, who would later be the lead guitarist in the 1969-1971 lineup of Love, Jim Price, who would later be a respected session horn player, and Dave Price, who was one of Davy Jones' standins for the Monkees TV series. The rest of his former bandmates sued him, and he eventually settled for being allowed to call his band New Buffalo (though it would often perform as New Buffalo Springfield anyway) in return for all his future royalties for the original group's music.\n\nThat group fell apart, but Martin and Dave Price formed a second lineup of the group, which toured as New Buffalo Springfield, New Buffalo, and Blue Buffalo, and which featured Randy Fuller, Bobby Fuller's brother. Blue Buffalo then sacked Martin and changed their name to Blue Mountain Eagle, who recorded one album, plus a non-album single -- a version of Steve Stills' song \"Marianne\":\n\n[Excerpt: Blue Mountain Eagle, \"Marianne\"]\n\nRandy Fuller left Blue Mountain Eagle and joined Dewey Martin's new band, Dewey Martin and Medicine Ball, who also recorded one album, only one track of which, \"Indian Child\", seems to have made it into any kind of digital release, and I'm not going to excerpt that here because it's a string of offensive cliches about native Americans.\n\nBruce Palmer also guested on that album, and Palmer would later play bass on Neil Young's album Trans and the resulting tour, which saw them making music that was very different from their Buffalo Springfield years, even on the one remake of a Buffalo Springfield song included on the album and tour:\n\n[Excerpt: Neil Young, \"Mr. Soul (Live in Berlin)\"]\n\nBut for the most part, both Palmer and Martin spent the next several decades touring, together and separately, in bands called things like The Springfield Band, Buffalo Springfield Revisited, White Buffalo, and Buffalo Springfield Again. Sadly, when there was an actual reunion of Buffalo Springfield in 2011, both had already died -- Palmer in 2004 and Martin in 2009.\n\nAs for the group's two leaders, they felt uncomfortable being even on the same record label, so Ahmet Ertegun chose to keep Stills on Atlantic and to drop Young, who moved on to Warners and made an album with Jack Nitzsche arranging, which was very much in the style of \"Expecting to Fly\" and \"Broken Arrow\":\n\n[Excerpt: Neil Young, \"The Old Laughing Lady\"]\n\nI don't think it's too much of a spoiler to say we'll probably be hearing more from Neil Young in future episodes.\n\nAs for Steve Stills, his next major contribution to a record was also his next major success. Al Kooper had recorded half an album with Mike Bloomfield, Fast Eddie Hoh, and a couple of members of the Electric Flag, but Bloomfield couldn't make the second session, so Kooper called in Stills to replace him. The resulting album was released as \"Super Session\", credited to Bloomfield, Kooper, and Stills:\n\n[Excerpt: Steve Stills and Al Kooper, \"Season of the Witch\"]\n\nSuper Session went to number twelve and became a gold-selling album, and was the first hugely successful album in a new trend, the \"supergroup\", in which former members of several successful bands would get together and record as a new group. We'll see a few of those in 1968 and 69.\n\nKooper apparently enjoyed working with Stills enough that he asked him to join Blood Sweat and Tears as their new vocalist -- though by all accounts Kooper himself had apparently already been kicked out of the band by that point, and it's hard to see Stills and Jim Fielder working well together in a band after Stills had sacked Fielder with no warning. Stills declined, but the idea of doing something like the Super Session again did appeal to him. All he needed was a couple more musicians.\n\nBut that, of course, is a story for another time...",
  "enclosure": "",
  "itunes:summary": "Episode 152 of A History of Rock Music in Five Hundred Songs looks at “For What It's Worth”, and the short but eventful career of Buffalo Springfield. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a twenty-five-minute bonus episode available, on \"By the Time I Get to Phoenix\" by Glen Campbell.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nErratum: I say Moby Grape never recorded the song \"On the Other Side\", but someone in the comments has pointed me to a demo of it which was released under the name \"Stop\"\n\n\n\n\nResources\n\n\nAs usual, there's a Mixcloud mix containing all the songs excerpted in the episode.\n\nThis four-CD box set is the definitive collection of Buffalo Springfield's work, while if you want the mono version of the second album, the stereo version of the first, and the final album as released, but no demos or outtakes, you want this more recent box set.\n\nFor What It's Worth: The Story of Buffalo Springfield by Richey Furay and John Einarson is obviously Furay's version of the story, but all the more interesting for that.\n\nFor information on Steve Stills' early life I used Stephen Stills: Change Partners by David Roberts. \n\nInformation on both Stills and Young comes from Crosby, Stills, Nash, and Young by David Browne. \n\nJimmy McDonough's Shakey is the definitive biography of Neil Young, while Young's Waging Heavy Peace is his autobiography.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nA quick note before we begin -- this episode deals with various disabilities. In particular, there are descriptions of epileptic seizures that come from non-medically-trained witnesses, many of whom took ableist attitudes towards the seizures. I don't know enough about epilepsy to know how accurate their descriptions and perceptions are, and I apologise if that means that by repeating some of their statements, I am inadvertently passing on myths about the condition. When I talk about this, I am talking about the after-the-fact recollections of musicians, none of them medically trained and many of them in altered states of consciousness, about events that had happened decades earlier. Please do not take anything said in a podcast about music history as being the last word on the causes or effects of epileptic seizures, rather than how those musicians remember them.\n\nAnyway, on with the show.\n\nOne of the things you notice if you write about protest songs is that a lot of the time, the songs that people talk about as being important or impactful have aged very poorly. Even great songwriters like Bob Dylan or John Lennon, when writing material about the political events of the time, would write material they would later acknowledge was far from their best. Too often a song will be about a truly important event, and be powered by a real sense of outrage at injustice, but it will be overly specific, and then as soon as the immediate issue is no longer topical, the song is at best a curio.\n\nFor example, the sentencing of the poet and rock band manager John Sinclair to ten years in prison for giving two joints to an undercover police officer was hugely controversial in the early seventies, but by the time John Lennon's song about it was released, Sinclair had been freed by the Supreme Court, and very, very few people would use the song as an example of why Lennon's songwriting still has lasting value:\n\n[Excerpt: John Lennon, \"John Sinclair\"]\n\nBut there are exceptions, and those tend to be songs where rather than talking about specific headlines, the song is about the emotion that current events have caused. Ninety years on from its first success, for example, \"Brother, Can You Spare a Dime?\" still has resonance, becaus",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 152 of A History of Rock Music in Five Hundred Songs looks at “For What It's Worth”, and the short but eventful career of Buffalo Springfield. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a twenty-five-minute bonus episode available, on \"By the Time I Get to Phoenix\" by Glen Campbell.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nErratum: I say Moby Grape never recorded the song \"On the Other Side\", but someone in the comments has pointed me to a demo of it which was released under the name \"Stop\"\n\n\n\n\nResources\n\n\nAs usual, there's a Mixcloud mix containing all the songs excerpted in the episode.\n\nThis four-CD box set is the definitive collection of Buffalo Springfield's work, while if you want the mono version of the secon",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}