{
  "title": "557: Let's Lock-In Our Final 'Secrets of Dumbledore' Theories!",
  "link": "https://audioboom.com/posts/8060381",
  "itunes:episode": 557,
  "itunes:title": "Let's Lock-In Our Final 'Secrets of Dumbledore' Theories!",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4580,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>With this being our final episode before The Secrets of Dumbledore hits theaters (in the U.K., at least), we set our predictions and theories for the third Fantastic Beasts movie in stone. Plus, one of us has already seen the movie and offers a positive spoiler-free review!<br>\n<br>\n\n</div>\n<ul>\n<li>Are you new to MuggleCast? Be sure to subscribe to us on your favorite podcast app, and check out our <a href=\"https://www.patreon.com/mugglecast\">Patreon</a> for additional benefits!</li>\n<li>Our next Quizzitch Live is Saturday, April 9th, at 11 AM ET! Winners will receive $40 to a charity of their choice and tickets to see the next Beasts film.</li>\n<li>Main Discussion: The hosts make their final predictions and theories about The Secrets of Dumbledore</li>\n<li>...but Eric has just come back from an early screening! He gives a quick, spoiler-free review of the movie.</li>\n<li>What will the film's Tomatometer score end up being? How much money will it gross on opening weekend in the U.S.?</li>\n<li>Andrew, Micah and Laura guess  how gay the Dumbledore and Grindelwald relationship will be?</li>\n<li>On the subject of relationships, will Queenie and Jacob get back together in this movie? Will Newt and Tina finally start dating by its end?</li>\n<li>Will we hear about other characters from <em>Potter</em> history? Will the Order of the Phoenix get a shout-out?</li>\n<li>How many times will <em>Harry Potter</em> soundtrack music play during the movie?</li>\n<li>About Ariana, will we get a full flashback to the day she died? And does she share an Obscurus with Credence?</li>\n<li>Will this be the last movie for \"the Scamander Six\"? How about for Credence? Who will be the MVP of the movie, and what's the deal with Jacob's wand?</li>\n<li>Finally, the hosts share their thoughts on the blood pact, Credence's origins and any additional crackpot theories.</li>\n<li>Patrons weigh in with their predictions, as we close the box of guesses with a lock and key.</li>\n<li>Quizzitch: James Newton Howard, composer of the Fantastic Beasts series, also composed the music for the film adaptations of THIS, young-adult post-apocalyptic fiction book series, once marketed as \"The Next Harry Potter.\"  <a href=\"https://mugglecast.com/quizzitch/\">Submit your answer</a>!</li>\n<li>This week's episode is sponsored by BetterHelp (Get 10% off your first month at <a href=\"http://www.betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a>) and Framebridge (Get 15% off your first order by going to <a href=\"http://www.framebridge.com\">Framebridge.com</a> and using promo code MUGGLE)</li>\n</ul>\n",
  "pubDate": "Tue, 05 Apr 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-04-04:/posts/8060381",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}