{
  "title": "Great Books: Ava Chin on Kingston's \"The Woman Warrior\"",
  "description": "What stories should we remember, and which ones are we forced to forget? What if we discover a truth from the past that shaped us even though we didn't know it? Maxine Hong Kingston's 1975 masterpiece, The Woman Warrior: Memoirs of a Girlhood Among Ghosts, transformed American literature by adding a voice that had been with us all along yet insufficiently recognized. The book gives expression to the experience of Chinese Americans, which Kingston splices, multiplies and amplifies in five powerful sections of a book that delve into Chinese mythology, the experience of immigrants, and the difficult and tenuous ways of passing stories from generation to generation. In my conversation with professor Ava Chin, author of Eating Wildly: Foraging for Life, Love and the Perfect Meal, who has been teaching The Woman Warrior for many years, we examine how this gripping book of one girl's coming of age teaches us to figure out which parts of us are true to ourselves, and which ones have been imposed on us by others.\nUli Baer is a professor at New York University. He is also the host of the excellent podcast \"Think About It\"\nLearn more about your ad choices. Visit megaphone.fm/adchoices\nSupport our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/literary-studies",
  "pubDate": "Tue, 31 Dec 2019 09:00:00 -0000",
  "itunes:episodeType": "full",
  "itunes:episode": 61,
  "itunes:author": "New Books Network",
  "itunes:subtitle": "What stories should we remember, and which ones are we forced to forget?",
  "itunes:summary": "What stories should we remember, and which ones are we forced to forget? What if we discover a truth from the past that shaped us even though we didn't know it? Maxine Hong Kingston's 1975 masterpiece, The Woman Warrior: Memoirs of a Girlhood Among Ghosts, transformed American literature by adding a voice that had been with us all along yet insufficiently recognized. The book gives expression to the experience of Chinese Americans, which Kingston splices, multiplies and amplifies in five powerful sections of a book that delve into Chinese mythology, the experience of immigrants, and the difficult and tenuous ways of passing stories from generation to generation. In my conversation with professor Ava Chin, author of Eating Wildly: Foraging for Life, Love and the Perfect Meal, who has been teaching The Woman Warrior for many years, we examine how this gripping book of one girl's coming of age teaches us to figure out which parts of us are true to ourselves, and which ones have been imposed on us by others.\nUli Baer is a professor at New York University. He is also the host of the excellent podcast \"Think About It\"\nLearn more about your ad choices. Visit megaphone.fm/adchoices\nSupport our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/literary-studies",
  "content:encoded": "<p>What stories should we remember, and which ones are we forced to forget? What if we discover a truth from the past that shaped us even though we didn't know it? Maxine Hong Kingston's 1975 masterpiece, <a href=\"http://www.amazon.com/dp/0679721886/?tag=newbooinhis-20\"><em>The Woman Warrior: Memoirs of a Girlhood Among Ghosts</em></a>, transformed American literature by adding a voice that had been with us all along yet insufficiently recognized. The book gives expression to the experience of Chinese Americans, which Kingston splices, multiplies and amplifies in five powerful sections of a book that delve into Chinese mythology, the experience of immigrants, and the difficult and tenuous ways of passing stories from generation to generation. In my conversation with professor <a href=\"http://nyihumanities.org/ava-chin\">Ava Chin</a>, author of <em>Eating Wildly: Foraging for Life, Love and the Perfect Meal</em>, who has been teaching <em>The Woman Warrior</em> for many years, we examine how this gripping book of one girl's coming of age teaches us to figure out which parts of us are true to ourselves, and which ones have been imposed on us by others.</p><p><a href=\"https://as.nyu.edu/content/nyu-as/as/faculty/ulrich-c-baer.html\"><em>Uli Baer</em></a><em> is a professor at New York University. He is also the host of the excellent podcast \"</em><a href=\"https://www.ulrichbaer.com/\"><strong><em>Think About It</em></strong></a><em>\"</em></p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p><p>Support our show by becoming a premium member! <a href=\"https://newbooksnetwork.supportingcast.fm/literary-studies\">https://newbooksnetwork.supportingcast.fm/literary-studies</a></p>",
  "itunes:duration": 2748,
  "itunes:explicit": "no",
  "guid": "f3cef71a-03f0-11ea-af28-739d76c21dd7",
  "enclosure": ""
}