{
  "title": "Ana Flores: Power Through Community",
  "description": "<p>Carla speaks with media entrepreneur Ana Flores, founder and CEO of #WeAllGrow Latina Network, a community that has elevated the voices and stories of Latinas for the past 10 years.</p><p>Ana Flores is the creator of the first and largest community of Latina digital influencers, and is among the only 1% of Latina owned companies to ever hit the $1 million revenue mark. In this episode, Ana walks us through her upbringing between El Salvador and Houston, her early career in television, and embracing an entrepreneurial spirit that led her to start her first company. Today, she continues to elevate Latina voices through the power of her community, as she celebrates #WeAllGrow Latina Network’s 10-year anniversary. Come on and join us for the ride.</p><p><a href=\"https://www.morganstanley.com/what-we-do/inclusive-innovation-and-opportunity\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.morganstanley.com/what-we-do/inclusive-innovation-and-opportunity</a></p><p><em>Disclaimer text</em></p><p><em>The guest speakers are neither employees nor affiliated with Morgan Stanley & Co. LLC. (“Morgan Stanley”). The views and opinions expressed herein do not necessarily reflect those of Morgan Stanley. The information and figures contained herein has been obtained from sources outside of Morgan Stanley and Morgan Stanley makes no representations or guarantees as to the accuracy or completeness of information or data from sources outside of Morgan Stanley. Morgan Stanley is not responsible for the information or data contained in this podcast.</em></p><p><em>This podcast does not provide individually tailored investment advice and is not a solicitation of any offer to buy or sell any security or other financial instrument or to participate in any trading strategy. It has been prepared without regard to the individual financial circumstances and objectives of persons who receive it.</em></p><p><em>© 2021 Morgan Stanley & Co. LLC, Members SIPC.</em></p><p><br></p><p><br></p><p>----- Transcript -----</p><p><br></p><p><strong>Ana Flores:&nbsp;</strong>In 2010, really the conversations that we have now of VC funding for women, and especially for Latinas, were just not being had. Because what I created was something so new. People didn't see the value. And I knew that.</p><p><strong>Carla Harris:&nbsp;</strong>On this episode of Access and Opportunity, we welcome Entrepreneur Ana Flores, Founder and CEO of #WeAllGrow Latina Network. Ana is the creator of the first and largest network of Latina digital influencers and is among the 1% of Latina-owned companies to ever hit the $1 million revenue mark. With no outside investment, she continues to elevate Latina voices through the power of her community as she celebrates #WeAllGrow Latina Network’s 10-year anniversary.</p><p><strong>Carla Harris:&nbsp;</strong>In this episode, Ana takes us through her upbringing between El Salvador and Houston, her early career in television, and her embrace of an entrepreneurial spirit that led her to start her first company, SpanglishBaby and then ultimately #WeAllGrow. Come on and join me for the ride!</p><p><strong>Carla Harris:&nbsp;</strong>Ana, thank you so much for being here with me today. It's a pleasure to have you on the show. Let's jump right in. Are you ready?</p><p><strong>Ana Flores:&nbsp;</strong>I'm ready. Carla, thank you so much for the invitation. Let's do this.</p><p><strong>Carla Harris:</strong>&nbsp;All right. First, congratulations on your tremendous success, especially as you come up on your 10th anniversary with #weallgrowlatinanetwork. You have been committed to raising Latina voices and scaled and monetize outstanding brands to advance that cause. So now let's go back to the beginning and talk about your path.</p><p><strong>Ana Flores:</strong>&nbsp;Yes. I was born in Texas. I was born in Houston. My dad still lives there. Both my parents are from El Salvador. And thankfully, they decided to get divorced when I was six years old because that really defined everything and who I am. My mom moved back with myself and my younger sister. Grabbed us, you know, in a pickup van, I think it was, and moved us back to El Salvador — where really I grew up, where I had my formative years. But my formative years weren't only there. They were also in Houston. I grew up between both countries, between two different cultures. I grew up speaking both languages. I don't remember how I learned Spanish or how I learned English. My mom doesn't seem to remember either. I was in an American school in El Salvador, but that really defined this wholehearted 200 percent Latina American person that I am, that it has defined my career as well. And when I was 18, I moved back to Texas. To go to college. I ended up following a boy to Florida. That's the honest truth.</p><p><strong>Carla Harris:&nbsp;</strong>I was about to ask how you got to Florida.</p><p><strong>Ana Flores:&nbsp;</strong>He was going to Embry-Riddle, he was a pilot. And I had a lot of friends, actually. There's a really big community of Latinos in Gainesville and a lot of Salvadorians where there also. So, I ended up just finding there. But the thing is that I knew I wanted to end up working in Univision in Miami in the network. I was studying TV production, and I really didn't have role models. I really didn't have a mentor. I really didn't have anybody that I knew that was a producer. But somehow, I knew that that was my path. And so being in Florida got me closer to that. And I did go to University of Florida, again, always surrounded by this huge community of Latinos. And we have to really understand that Latinidad wasn’t really what it is now and what it has been growing to. Even, you know, this was like mid 90s, early 90s. And I got my first job, my internship at Univision in Miami and internships back then for TV, I would have to sit and watch the scrolling credits, right? And like,&nbsp;Oh, that's executive producer, write a letter right and try to get in the door. And they didn't even have an internship program. But I got myself in there and I just started learning everything that I could. And within a year I graduated and a job opened up. And I started my career there. And it was a very exciting time to be in Univision in like 96, 97. It was a youth revolution back then. Latinidad was among us. This was when Shakira had just moved from Colombia. I was learning English. You know, we were the ones listening to, like bootleg copies of the CDs coming from Colombia, Mexico, whatever. This was when Ricky Iglesias was getting started. Ricky Martin did La Vida Loca in the Grammys, which really changed, that was the first time we felt seen. That was the first time we felt our culture really, really in this main stage. I remember where I was and the moment that I was. So it was a very exciting moment to be in Miami, to be part of the Latino culture and creating content by and for us. But then I fell in love with Mexico City. I used to have to go to work to Mexico a lot. And I think I connected with that deep with that part of it. Obviously, my Latinidad my my Latin roots and that love for the culture that I didn't really have. El Salvador is is not as strong culturally as Mexico is. Not many places are. And and this huge city where I saw that I could do my career, I could work in what I love, and do it from there. So I decided to quit. And that was, I guess, my first journey into entrepreneurship, right. We didn't really also have the word entrepreneurship as much back then. I was a freelancer and and I grabbed all the executive producers from Univision, and I told them, “I will be a freelance producer in Mexico.” And I cashed in my 401K. Not that I recommend people do that when they're 28. But I cashed in my 401K and moved and I, you know, it was actually a really good move in the sense of I was making money as a freelancer, which was much more than the $20,000 I was making a year working as an assistant producer. So that really led me on on a path. But then I ended up years later ended up moving to MTV, Latin America. And also continued working with this more Pan-American Latino — because what Univision is U.S. Hispanics, and learning how to talk to U.S. Hispanics and program and create content for U.S. Hispanics is different from creating content for Pan Latin America, where you are broadcasting to everybody from Argentina to the Caribbean through Central America, South America, which can be very different. Like one word can make a huge difference in Spanish or what it means in Mexico, what it means in Argentina. So I learned how to speak to a more global community of Latinos, right? — which, in Latin America we each identify as the country we're from, not as Latinos. And then that ended up moving to L.A. to…I was the the the team that was in charge of opening up the offices here for Mun2, which was a project of NBC and Universal to create content by and for Latino youth. So back over here doing that.</p><p><strong>Carla Harris:&nbsp;</strong>And what year was this Ana?</p><p><strong>Ana Flores:</strong>&nbsp;That was 2005, 2006 that we launched it.</p><p><strong>Carla Harris:&nbsp;</strong>So, 15 years ago. So now these folks are in their 30s or late 20s.</p><p><strong>Ana Flores:&nbsp;</strong>Yes.</p><p><strong>Carla Harris:&nbsp;</strong>And you were understanding how to speak to them and how to create content that they would consume.</p><p><strong>Ana Flores:&nbsp;</strong>Exactly. So, and it's tricky, right? Because I think music is a very universal language, right. But also, how do we speak to Latino youth, which is constantly changing, which navigate into two worlds. They can navigate watching MTV as they can navigate watching Univision with their parents or their grandparents, to wanting to watch sports and then also wanting to connect to their soccer teams locally, but also keep up to date. And that they enjoy everything from rancheras to, again, pop like Shakira, et cetera, and trying to bring us together via that content, via that culture that really speaks to us.</p><p><strong>Carla Harris:&nbsp;</strong>Had the Eureka moment happen for corporate yet that all things Latino were going to be big? Had it happened yet or had it even happened in your own consciousness yet?</p><p><strong>Ana Flores:&nbsp;</strong>That's a really good question. It had happened, but the investment wasn't there yet. And it's still slowly trickling in. Right? It's is very much like,&nbsp;Oh, yeah. No, we get it.&nbsp;They're big in numbers.&nbsp;Oh, yeah. We get it.&nbsp;They're growing.&nbsp;Oh yeah.&nbsp;2010 we see the numbers and the census we need to start reallocating budgets, but we're not ready to allocate the budgets at the real importance that it needs to have to reflect the audience that they're speaking to and the social and economic and cultural power that we have.</p><p><strong>Carla Harris:&nbsp;</strong>When did you get the ‘Aha!’ moment that this could be more than a niche market? Had you yet had the awakening or that didn't hit you until you started your first baby, SpanglishBaby?</p><p><strong>Ana Flores:&nbsp;</strong>It started with SpanglishBaby.</p><p><strong>Carla Harris:&nbsp;</strong>Ok let's talk about that.</p><p><strong>Ana Flores:&nbsp;</strong>So I actually quit my job because I quit all my jobs because I've always been an entrepreneur at a heart. I did the thing that stereotypes. Moms, women. Right. That you're gonna quit your job once you have a kid. And I actually did do that because I really wanted to be a full-time mom for a while. What I didn't know was that my daughter was born in 2007, so the Recession hit the next year. And since we had both my my husband from is from Mexico. So, all of our families, we were just here alone just with friends. So, it really was hard once I had quit my job and within eight months a recession hit, meaning that he lost his job. It hit really particularly hard in L.A. because there was also a writers' strike. So, at the same time, in 2008, the industry shut down. I then also fell into the realization of how hard or almost impossible it is to want to have a job, even if I was willing to like, get, you know, minimum wage. But that wouldn't pay for daycare. So we were stuck. And what I started discovering then was the world of blogs and mom blogs. That's where I was finding out how to be a mom. I was consuming this content, but also finding a community of women that were like me, that were ambitious, that were driven, that knew how to create content, that knew how to build community. And we're doing it through this fabulous medium that I didn't need money for that. I just needed nap times, my daughter's nap times to be able to get it done at home. So I decided to launch Spanglish Baby because I wasn't seeing content for women like me and my partner who Roxana, whom I launched it with. She was an Emmy-winning producer, was going through the same exact things that I was going through, and we both decided to launch Spanglish Baby as a resource for parents raising bilingual and bi-cultural kids. I needed that. I wasn't seeing that in that community of bloggers. And then just in general, right, if I would Google, if I would search for it. So, I decided that I would launch it, that we would create it. And it hit a nerve right away. It was content that was needed. And we were speaking directly from my mom to other moms. We were bringing in experts, et cetera. But to your question, once I, I started getting deep in that, I first of all, I didn't realize how revolutionary it would be to talk about kids learning a second language, about kids learning Spanish. For me, it was, it's like,&nbsp;Isn’t that what we want?&nbsp;I mean, we have the brain capacity as soon as we're born, even in uterus, to learn this language. Yet we're not teaching it until high school. So that became just the awakening of, OK. Why are people giving us these negative comments about us wanting our children to speak Spanish, about us wanting to keep the culture alive, about us wanting them to really couldn't have a connection with their root and their heritage. And then I started getting into the research of it. And then in 2010, the census came out. And that last census really set the mark that the Hispanic Latino community was growing and was the fastest growing minority. Though I don't like using that word, but that's the term still used in marketing, and that resources would be allocated. So, the more I started seeing and realized that one in four children being born at that time, 10 years ago, and now in some places like California, it's one in three are Latinos. I was like, that is our audience. And who is speaking to these moms and who is understanding the resources that these moms need? And if I was looking at Disney, and I had many conversations with many people in Disney about: How can we make accessible the content in Spanish? How can we make more content that speaks to our children? Where are the Latina Disney princesses? How can it be that such a huge, you know, vast, rich indigenous culture and beautiful culture cannot be represented by a beautiful princess? Can you imagine a beautiful Inca or Mayan princess? So just really realizing that and seeing that,&nbsp;OK, there's a lot of work to be done here.&nbsp;And the beauty of the blogging space of the digital media space was that it democratized our voices, was that it allowed a mom in the middle of the recession almost having to go into food stamps to be able to build something. To build something that spoke to me, and that created content and visibility for a community that was completely not only ignored, but being erased.</p><p><strong>Carla Harris:&nbsp;</strong>So talk to me about how you were defining success? I'm sure when you started it was like, well if anybody responds that's got to be a success. But as you started realizing so you had a confluence of events. You had a 2010 census that said, you know, this is a big and growing community, the fastest growing community. There is real disposable income there. Your own realization that nobody else was out here having this conversation. You couldn't find any. And you clearly knew there was a big audience. So, somebody needed to provide the content and the information. So, again, never having started a business, you kind of having a little bit of an entrepreneurial itch. How did you define success?</p><p><strong>Ana Flores:&nbsp;</strong>Listen. It was really hard to define success when nobody was doing that. It was hard when I would talk to the people around me, from family members to people I admired and trusted. And I would say, you know, I'm watching this blog, but I have a really big vision behind it. And it was like, \"Ay que cute!\" How cute, right? It was like,&nbsp;oh, she's a mommy blogger. That's really cute.&nbsp;It's like no there's so much more to it than this. And we're talking again, 2009, when I launched the blog, 2010 when we had been blogging for a year and a half and really seeing success because the community was responding. That was success to us. If I would receive a comment from somebody saying, you know what, there has been so many myths about raising bilingual children and how we're going to damage them because they're not going to be able to speak any language. You're going to confuse them. And they were like thanks to the information and the resources that you're providing, I understand that I can now raise my child bilingual and I know how to do it now. That was success to us. And it was one mom at a time, one day at a time, one child at a time. And then it transitioned into: we need to monetize. So we had been blogging for about a year. And we had been really building a community of other Latina mom bloggers that were coming. Twitter really helped. Twitter was one where we were put, you know, we would connect, we would find each other. There wasn't Facebook groups. There wasn't Instagram. It was just really that and and email groups and comments on blogs. And that's where we were starting to meet each other. But it was the same thing. Nobody, none of us were monetizing yet at that moment. What we now know as influencer marketing was at its infancy and it was mostly mom bloggers, a handful of them, that were creating these networks where they would work with the brands to try to help them understand this fascinating world of blogging and digital media and in how they could speak to the…reach moms through mom bloggers and the authentic content that they were creating. And they would connect the bloggers with brands. So actually, it was going to conferences like BlogHer and different kinds of conferences that I was able to go to that I started meeting a lot of these women and I did become the token Latina and I understood it. And I knew exactly what I was gonna do with that, because that would allow me to open doors and to learn and to bring opportunities. And they were more than willing to teach me and to push me forward to be why aren't you doing what we are doing. Right? Because they didn't know how to speak to the Latina mom, or they didn't know how to talk to these brands that were not the multicultural agencies to help them understand the importance of reaching this audience. But I could. So, I decided to launch what is now #WeAllGrow Latina. Back then, in 2010, again with a laptop, Google Drive and a Wordpress site. And a logo that a friend did…and I launched Latina Bloggers Connect. And and I basically said, if you want to join this network and I will do my work to work with the brands to bring opportunities to all of us, because unless we start monetizing, we weren't going to be able to have our story shared.</p><p><strong>Carla Harris:&nbsp;</strong>And you learned how to monetize from going to these conferences and talking to these other moms, or did you just watch what was happening and look at all the different ways that people were monetizing? And I'd love you to speak to that, because an entrepreneur that's out there that has a community that they can talk to that can write, I want them to understand the playbook of how you need to think about monetizing, if this is your journey.</p><p><strong>Ana Flores:&nbsp;</strong>So I definitely learned by going to the conferences, and that's why eventually I ended up creating my own conference because I knew the benefit that it had bringing all these groups together in one place. So going to those conferences and speaking and meeting the brand representatives, meeting the agencies, et cetera, and then learning how to make the deals. Again, influencer marketing, the term didn't exist. So we were all blogger networks. Budgets were all over the place. We were all trying to figure out. And I did make the mistake, because you need to understand and I know you know this, that about 10 percent of overall marketing dollars are allocated to multicultural marketing. That means multicultural marketing is Hispanic, is African-American, is LGBTQ, it's Asian-American, Native American. I mean, it's all lumped into this group of multicultural. So, and if 10 percent is going to us, it means you start, you know, slicing the pie and what is there for Latinas is less than one percent. So even though I was meeting all these brands, I needed to connect with, it was always the multicultural teams. If it wasn't the multicultural teams, we really probably wouldn't get the door open. So that meant that even though the bloggers that we were working with and the work that we were doing had the same value of the dollar, we were only getting pennies to the dollar. So, as it was, my budgets were much smaller, but I had to learn that along the way. So I could learn from them the techniques and tactics and we were all always sharing with each other what worked and what type of campaigns worked. But the budgets themselves were kind of like the Wild, Wild West.</p><p><strong>Carla Harris:&nbsp;</strong>So talk to me about the data. Did you have to collect a whole bunch of data to try to convince people that this was indeed a big market? And, you know, look at how much money Latina mom’s spend. And here are the things that they spend their money on. So talk to me a little bit about that.</p><p><strong>Ana Flores:&nbsp;</strong>Oh, absolutely. There was a lot of convincing. All across the board everywhere. And there was a lot of curiosity because blogging itself was so new and was in its infancies and PR world’s and media and advertising were trying to figure out where it fit in and how to invest in it, right? And what to do. So it was our job to convince them to invest in Latinas and not only Latina moms, because by then there was much more lifestyle bloggers, millennials, et cetera. So basically there wasn't a lot of data and we weren't a research firm. And so it wasn't even whatever we could bring back, which was the data that we had from the audiences that our bloggers were reaching wasn't really that meaningful to them. It had to come from a more authoritative source. And there wasn't a lot, like I said, there was the census. The Pew Research had been doing some research on and some fascinating studies on Latinos. But what really changed the game for us, specifically for Latinas, was the Nielsen Latina report, which came out around 2016, led by Monica Gil, who's now V.P. in Telemundo. And she really, really, really brought forward the force of the Latina consuming power. But in general, we already know that the Hispanic purchasing power is over $1.7 trillion. Actually, if we were a nation, we would be number seven in the world based on our GDP power, that's right behind India. So we definitely have the financial force. But really, we need the data to really showcase how Latinas are overarching and over indexing in consumers, especially when it comes to beauty products, to electronics, moviegoers. Right? We buy the tickets at the box office. And all of that really helped to start to inform that narrative and to understand that this was a valuable proposition, to actually reach the Latino community via people, via these voices that they already looked up to and trusted.</p><p><strong>Carla Harris:&nbsp;</strong>Yeah. I wanted to bring up that point because especially entrepreneurs that are serving an ethnic demographic for those, as I said, that don't understand that market and haven't played in that market before. They don't realize A.) how big it is and B.) how fast it's growing. So part of what I'm trying to put out there is the playbook that you might, in fact, have to have collaborations and partnerships with people who are doing that research, who can bring it to the market and shed a spotlight on it so that you can have these opportunities, if you will, to serve that market. And it sounds like to me you connected with the right sources that were producing the data. You were able to talk and speak to some of it, but you also connected and collaborated with those who could help bring that that data to the marketplace.</p><p><strong>Ana Flores:&nbsp;</strong>We were practically just as soon as we would see that data, we would grab it and figure out how to how to be able to put that in our deck and be able to switch the conversation. But a lot of it had to come from really, you know, the impact that our own campaigns were having and really start to build upon that and the data that was meaningful. And the thing is that it's very difficult in social media as well, because we know that the impact that something like a conference can create and these in real life connections can have to continue building our economic and social and cultural power is really hard to translate into hardcore data. Right? It's that qualitative data. So, it’s, we definitely have now in our 10th year, just is growing a lot more and figuring out how we can also become that place to be able to serve those different partners and understanding really where Latinos are going, what we're thinking, where we put our dollars, because that continues to shift. And the Latina 2.0 report and many others since then have now really showcased that. And not only do we have the consumer power, but we're really conscious and we're becoming much more and where we invest our dollars and we want to invest our dollars on those brands and organizations that are actually speaking to us, that we really have taken the credo and the mantra of representation matters very seriously, especially the last five years when the erasure has become so clear and we want to invest in those that are seeing us and those that are investing in us. It became so important because we created a safe space for us to come together. But it was also that space for the brands to authentically show up in a place that mattered to us.</p><p><strong>Carla Harris:&nbsp;</strong>So let let's talk about five years. You were now making a million dollars a year and there are very few women owned businesses that and even that short period of time are producing that kind of revenue. Now, help me understand, you did all of that without any outside investment, correct?</p><p><strong>Ana Flores:&nbsp;</strong>Zero.</p><p><strong>Carla Harris:&nbsp;</strong>Wow. Okay, so that was just really being of the mind to reinvest whatever profits you were making back into the business to drive it to growth?</p><p><strong>Ana Flores:&nbsp;</strong>Exactly. Yes. It was all brand campaigns. Absolutely brand campaigns. Again, we were able, since we were the first ones in the space, in the Latino space. We quickly had competition within a year. And it came from men. And trying to reach this audience who saw the potential — right? — saw the potential enough not to want to invest, but to want to create it themselves. And that was good. Competition was really healthy, and it was great. But it definitely came from the brand partnerships and reinvesting into the company. See, the thing is that we didn't sell a product. We sold a service. So, I didn't have collateral. So even if I wanted to go to the banks and to get a line of credit, I was denied completely because I didn't have any collateral.</p><p><strong>Carla Harris:&nbsp;</strong>Let's talk about what the brand campaigns look like. The economics around that. So, can you describe for someone who doesn't understand how the influencer market works, what you were doing with those brands and how the conversation worked?</p><p><strong>Ana Flores:&nbsp;</strong>So those brand campaigns and specifically what became influencer marketing is actually very transactional. So basically, it's knowing what their budget is, what their goals are and profile of the influencer they want. And then we would be able to go back with that budget and the type of deliverables. So a blog post isn't the same as an Instagram post. An Instagram post isn't the same as a tweet. They all have a different value. So we would actually assign a dollar value to each post. And it also depends on the level of reach and engagement. And those metrics continue to shift. But usually, it will be impressions that they're looking for per influencer that we're working on. So, it's either a hashtag impression, if it's a hashtag heavy campaign, or it is per deliverable per influencer and then the formulas to add up, and then our profit margins, we would try to have them around 50 percent. So it's 50/40 percent profit margin for each campaign.</p><p><strong>Carla Harris:&nbsp;</strong>Wow. Outstanding. So we went from television producer to blogger to someone who had a business blog into monetizing that, who now has a business full of connectors that can influence very, very large markets. You've done over a million dollars. Now, do you need outside capital? Or have you ever raised outside capital for the business?</p><p><strong>Ana Flores:&nbsp;</strong>&nbsp;You know. So again, in 2010, really the conversations that we have now of VC funding for women and especially for Latinas, were just not being had. Because what I created was something so new. And in a market that was still considered in a way like an emerging market or, again, multicultural market. People didn't see the value. And I knew that. So I had to make a decision. Am I going to spend my very precious time as a mom and as an entrepreneur — I had a team of 12 by then — creating and meeting the needs of my community and of my clients? Or am I going to spend my time trying to get. I was already about 40 years old trying to get into accelerators and having to spend six months there? Or am I going to just keep doing what we're doing so well and count on that money and count on that growth. And I decided the latter, that we would keep going. I have had several offers for acquisitions, again, from men, who saw the impact of what we were doing but needed to check it off as their Latina initiative. And we became so community driven. We became so mission driven. And once we truly understood the impact of what we were doing at-large for the community and our overall visibility and representation, that I wasn't willing to give that up.</p><p><strong>Carla Harris:&nbsp;</strong>So you pivoted, you evolved from connections and influencing to the conference, as you said earlier, because you saw the real value in bringing everybody together and, you know, being able to make these connections. Right? So that's what the business looks like today, the influencing and the event driven businesses. Is that right? With the real focus around Latinos and the size of that market.</p><p><strong>Ana Flores:&nbsp;</strong>Yes, completely. So, it is creating safe spaces for us to connect in person and in real life and online. And we've always been able to manage both. And we still do the campaigns and the influencer. But as part, not as one-off campaigns, and not the 20 that we used to do per month, because we went to have more integrated marketing campaigns where we can really move the needle for the community and do it with the help of the brands. Right? And that was a slow move. So I knew, and this is this is interesting. So, part of the story was that when we launched the conference in 2015, I did it to meet a need not only because I knew that that's where I had learned, but also because every time I would go to to these conferences, I was still just a handful of Latinas there. And I was like,&nbsp;I am learning so much here. I need more women to get the benefit.&nbsp;But then more and more Latinas would ask me, like, “When are you going to do the conference?” And then I would get brands around Q3, Q4 were there. You know, our clients were they were working on their budgets for the next year, asked me: “Are you going to do a conference? Should we allocate something there?” And I was like,&nbsp;OK. Obviously there's a need and obviously I have the resources to make it happen.&nbsp;By then, we had built a solid reputation in the industry. And I launched the conference. I announced it. Neutrogena was our title sponsor. And I actually I talked to them, to the agency. I explained what I wanted to do. And they were like,&nbsp;well, if you build, it will be there, but you have to build it.&nbsp;So they didn't sign on the dotted line. They just told me, “We'll stand by you.” But I had to announce it. I had to make it happen. I had to show because when you're creating a conference for the first time, you don't have proof, right? You don't have a product that you're selling a product that I can go pitch and Shark Tank somewhere. It's an idea. It's a concept. It's a deck. So you have to have credibility and you have to have already earned that confidence within the brands who are going to be the ones monetizing that and the community who's going to buy tickets. So I announced it. I set a date. I didn't even have a venue. Don't do this. That's how I did it. But that's not how I recommend people do it. And within a week, we had sold over 100 tickets. Neutrogena signed on the dotted line and we had the first conference for 250 people sold out within the next ten months. And then by the next year, it grew to five hundred. We changed venue, location, and it just continued growing where we would sell out within hours, ten months in advance. So the community was helping us monetize as well because it was that, them buying the tickets, et cetera, that would help us say, like,&nbsp;OK, we're ready to, you know, dedicate the next 10 months to build this conference. We wouldn't even announce speakers. The conference would just sell on its own because of the reputation it already had and the magnitude of the ripple effects that would come out of what people would learn and who they would connect with while there.</p><p><strong>Carla Harris:&nbsp;</strong>Right, and your validation that people needed a place to meet, to be able to ideate, to be able to learn from each other. So, it had almost nothing to do with the speakers and everything to do with the fact that you created the space and you were smart enough to also know what content was going to be of value, which added value on top.</p><p><strong>Ana Flores:&nbsp;</strong>Well, listen, it was crazy how people didn't expect it. People already had, you know, the stereotypes within the Hispanic community. They knew that if it was a Latina conference, the bar was set really low. So my job was to set the bar really freaking high and to create something. And that's something that's a mode that our communities function in, not only at work, but as entrepreneurs and everything. We're always expected to underperform. Not only are we at the bottom of the totem pole when it comes to equal pay, but those women that are making 46 cents to the dollar that a white, non-Latino man makes, are expected to over perform. Us as, you know, creating a conference, we were expected to deliver something really big. And we did with half the dollars then, you know, a community or a company or a conference similar to ours that would be in the general market would be able to do with five times the funds.</p><p><strong>Carla Harris:&nbsp;</strong>So what's next? Ana, we are post COVID. So assume that we're sitting in August of 2021 now and you're thinking about what the future looks like. What’s next for #WeAllGrow Latina network?</p><p><strong>Ana Flores:&nbsp;</strong>You know, it's the community. We want to be&nbsp;the&nbsp;go to community for Latinas to really feel seen, to really feel heard. But from there be able to grow our power and our generational wealth. We really want to focus on our finances because there is this big disconnect between our consumer power, our GDP, our purchasing power and where it's going back, right? We're not building wealth yet. And we're not keeping that wealth within our communities. And we're not securing the generational wealth. So all the work that we're doing right now and that we're putting forward cannot be lost with this generation. We need to create a better future for our children and their children, and their children, because we know that that is how wealth is built in this country. So that is what we see. We see a place where we can continue building our confidence. We never say that we want to empower Latinas because we have the power. We just want to help you unleash it, and see it, and feel the confidence to use it and to put it forward. And we really want to be that place where you will learn not only from finances but doing it from that lifestyle place. And hopefully we'll be back in person really soon. But we want this to become a global movement.</p><p><strong>Carla Harris:</strong>&nbsp;So there’s two pieces: you want to help them figure out how to get more money. So how to make sure that you get your worth. That's one piece. The other piece is, how to invest it and grow it.</p><p><strong>Carla Harris:&nbsp;</strong>All right. So, we have a tradition on Access and Opportunity, Ana, where we have a lightning round of questions, where we hopefully will have our listeners have an opportunity to know you, Ana, the woman. So, are you ready? I'm going to give you some questions and then you give me the first thing that comes to your mind.</p><p><strong>Ana Flores:&nbsp;</strong>Let's do it.</p><p><strong>Carla Harris:&nbsp;</strong>Twitter or Instagram?</p><p><strong>Ana Flores:&nbsp;</strong>Instagram.</p><p><strong>Carla Harris:&nbsp;</strong>What's your personal mantra?</p><p><strong>Ana Flores:&nbsp;</strong>I can do this.</p><p><strong>Carla Harris:&nbsp;</strong>What's your favorite Salvadorian dish?</p><p><strong>Ana Flores:&nbsp;</strong>Ay pupusas of course!</p><p><strong>Carla Harris:&nbsp;</strong>City or countryside.</p><p><strong>Ana Flores:&nbsp;</strong>Countryside these days.</p><p><strong>Carla Harris:&nbsp;</strong>Winter or summer?</p><p><strong>Ana Flores:&nbsp;</strong>Summer.</p><p><strong>Carla Harris:&nbsp;</strong>Coffee or tea?</p><p><strong>Ana Flores:</strong>&nbsp;Coffee in the morning. Tea in the afternoon.</p><p><strong>Carla Harris:&nbsp;</strong>In the office building. Or working from home?</p><p><strong>Ana Flores:</strong>&nbsp;Working from home.</p><p><strong>Carla Harris:&nbsp;</strong>If you had a talk show, who would be your first guest?</p><p><strong>Ana Flores:&nbsp;</strong>&nbsp;My daughter.</p><p><strong>Carla Harris:&nbsp;</strong>One word that you want to describe your legacy.</p><p><strong>Ana Flores:&nbsp;</strong>Love.</p><p><strong>Carla Harris:&nbsp;</strong>Oh wow. Ana Flores, thank you so much. It has been my pleasure, privilege..</p><p><br></p><p><strong>Ana Flores:&nbsp;</strong>Oh no thank you so much for having me. I'm really excited and I've been loving your podcast.</p><p><strong>Carla Harris:&nbsp;</strong>Thank you. Well, listen. On a different note, as you continue to evolve and you want the partnerships to help educate the women and to help them understand how to grow wealth, then, you know, consider us as you think about partners.</p><p><strong>Ana Flores:&nbsp;</strong>I will. Thank you. Thank you so much. Very important to have allies.</p><p><strong>Carla Harris:&nbsp;</strong>Thank you.</p><p><strong>Carla Harris:&nbsp;</strong>Thank you all for joining us on this episode of Access & Opportunity. Be sure to stay tuned this season as we speak to more influencers in the sports, media and&nbsp;entertainment fields who've committed to reframing the narrative for women and people of color. You won’t want to miss it.&nbsp;&nbsp;</p><p>What did you learn today from Ana Flores? Send us your thoughts at&nbsp;<u>carlapod@morganstanley.com</u>. We would love to hear from you. Subscribe to Access & Opportunity on Apple Podcasts or wherever you listen. Thanks for coming along!</p><p><br></p>",
  "itunes:title": "Ana Flores: Power Through Community",
  "itunes:episodeType": "full",
  "itunes:episode": 3,
  "itunes:summary": "Carla speaks with media entrepreneur Ana Flores, founder and CEO of #WeAllGrow Latina Network, a community that has elevated the voices and stories of Latinas for the past 10 years.",
  "content:encoded": "<p>Carla speaks with media entrepreneur Ana Flores, founder and CEO of #WeAllGrow Latina Network, a community that has elevated the voices and stories of Latinas for the past 10 years.</p><p>Ana Flores is the creator of the first and largest community of Latina digital influencers, and is among the only 1% of Latina owned companies to ever hit the $1 million revenue mark. In this episode, Ana walks us through her upbringing between El Salvador and Houston, her early career in television, and embracing an entrepreneurial spirit that led her to start her first company. Today, she continues to elevate Latina voices through the power of her community, as she celebrates #WeAllGrow Latina Network’s 10-year anniversary. Come on and join us for the ride.</p><p><a href=\"https://www.morganstanley.com/what-we-do/inclusive-innovation-and-opportunity\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.morganstanley.com/what-we-do/inclusive-innovation-and-opportunity</a></p><p><em>Disclaimer text</em></p><p><em>The guest speakers are neither employees nor affiliated with Morgan Stanley & Co. LLC. (“Morgan Stanley”). The views and opinions expressed herein do not necessarily reflect those of Morgan Stanley. The information and figures contained herein has been obtained from sources outside of Morgan Stanley and Morgan Stanley makes no representations or guarantees as to the accuracy or completeness of information or data from sources outside of Morgan Stanley. Morgan Stanley is not responsible for the information or data contained in this podcast.</em></p><p><em>This podcast does not provide individually tailored investment advice and is not a solicitation of any offer to buy or sell any security or other financial instrument or to participate in any trading strategy. It has been prepared without regard to the individual financial circumstances and objectives of persons who receive it.</em></p><p><em>© 2021 Morgan Stanley & Co. LLC, Members SIPC.</em></p><p><br></p><p><br></p><p>----- Transcript -----</p><p><br></p><p><strong>Ana Flores:&nbsp;</strong>In 2010, really the conversations that we have now of VC funding for women, and especially for Latinas, were just not being had. Because what I created was something so new. People didn't see the value. And I knew that.</p><p><strong>Carla Harris:&nbsp;</strong>On this episode of Access and Opportunity, we welcome Entrepreneur Ana Flores, Founder and CEO of #WeAllGrow Latina Network. Ana is the creator of the first and largest network of Latina digital influencers and is among the 1% of Latina-owned companies to ever hit the $1 million revenue mark. With no outside investment, she continues to elevate Latina voices through the power of her community as she celebrates #WeAllGrow Latina Network’s 10-year anniversary.</p><p><strong>Carla Harris:&nbsp;</strong>In this episode, Ana takes us through her upbringing between El Salvador and Houston, her early career in television, and her embrace of an entrepreneurial spirit that led her to start her first company, SpanglishBaby and then ultimately #WeAllGrow. Come on and join me for the ride!</p><p><strong>Carla Harris:&nbsp;</strong>Ana, thank you so much for being here with me today. It's a pleasure to have you on the show. Let's jump right in. Are you ready?</p><p><strong>Ana Flores:&nbsp;</strong>I'm ready. Carla, thank you so much for the invitation. Let's do this.</p><p><strong>Carla Harris:</strong>&nbsp;All right. First, congratulations on your tremendous success, especially as you come up on your 10th anniversary with #weallgrowlatinanetwork. You have been committed to raising Latina voices and scaled and monetize outstanding brands to advance that cause. So now let's go back to the beginning and talk about your path.</p><p><strong>Ana Flores:</strong>&nbsp;Yes. I was born in Texas. I was born in Houston. My dad still lives there. Both my parents are from El Salvador. And thankfully, they decided to get divorced when I was six years old because that really defined everything and who I am. My mom moved back with myself and my younger sister. Grabbed us, you know, in a pickup van, I think it was, and moved us back to El Salvador — where really I grew up, where I had my formative years. But my formative years weren't only there. They were also in Houston. I grew up between both countries, between two different cultures. I grew up speaking both languages. I don't remember how I learned Spanish or how I learned English. My mom doesn't seem to remember either. I was in an American school in El Salvador, but that really defined this wholehearted 200 percent Latina American person that I am, that it has defined my career as well. And when I was 18, I moved back to Texas. To go to college. I ended up following a boy to Florida. That's the honest truth.</p><p><strong>Carla Harris:&nbsp;</strong>I was about to ask how you got to Florida.</p><p><strong>Ana Flores:&nbsp;</strong>He was going to Embry-Riddle, he was a pilot. And I had a lot of friends, actually. There's a really big community of Latinos in Gainesville and a lot of Salvadorians where there also. So, I ended up just finding there. But the thing is that I knew I wanted to end up working in Univision in Miami in the network. I was studying TV production, and I really didn't have role models. I really didn't have a mentor. I really didn't have anybody that I knew that was a producer. But somehow, I knew that that was my path. And so being in Florida got me closer to that. And I did go to University of Florida, again, always surrounded by this huge community of Latinos. And we have to really understand that Latinidad wasn’t really what it is now and what it has been growing to. Even, you know, this was like mid 90s, early 90s. And I got my first job, my internship at Univision in Miami and internships back then for TV, I would have to sit and watch the scrolling credits, right? And like,&nbsp;Oh, that's executive producer, write a letter right and try to get in the door. And they didn't even have an internship program. But I got myself in there and I just started learning everything that I could. And within a year I graduated and a job opened up. And I started my career there. And it was a very exciting time to be in Univision in like 96, 97. It was a youth revolution back then. Latinidad was among us. This was when Shakira had just moved from Colombia. I was learning English. You know, we were the ones listening to, like bootleg copies of the CDs coming from Colombia, Mexico, whatever. This was when Ricky Iglesias was getting started. Ricky Martin did La Vida Loca in the Grammys, which really changed, that was the first time we felt seen. That was the first time we felt our culture really, really in this main stage. I remember where I was and the moment that I was. So it was a very exciting moment to be in Miami, to be part of the Latino culture and creating content by and for us. But then I fell in love with Mexico City. I used to have to go to work to Mexico a lot. And I think I connected with that deep with that part of it. Obviously, my Latinidad my my Latin roots and that love for the culture that I didn't really have. El Salvador is is not as strong culturally as Mexico is. Not many places are. And and this huge city where I saw that I could do my career, I could work in what I love, and do it from there. So I decided to quit. And that was, I guess, my first journey into entrepreneurship, right. We didn't really also have the word entrepreneurship as much back then. I was a freelancer and and I grabbed all the executive producers from Univision, and I told them, “I will be a freelance producer in Mexico.” And I cashed in my 401K. Not that I recommend people do that when they're 28. But I cashed in my 401K and moved and I, you know, it was actually a really good move in the sense of I was making money as a freelancer, which was much more than the $20,000 I was making a year working as an assistant producer. So that really led me on on a path. But then I ended up years later ended up moving to MTV, Latin America. And also continued working with this more Pan-American Latino — because what Univision is U.S. Hispanics, and learning how to talk to U.S. Hispanics and program and create content for U.S. Hispanics is different from creating content for Pan Latin America, where you are broadcasting to everybody from Argentina to the Caribbean through Central America, South America, which can be very different. Like one word can make a huge difference in Spanish or what it means in Mexico, what it means in Argentina. So I learned how to speak to a more global community of Latinos, right? — which, in Latin America we each identify as the country we're from, not as Latinos. And then that ended up moving to L.A. to…I was the the the team that was in charge of opening up the offices here for Mun2, which was a project of NBC and Universal to create content by and for Latino youth. So back over here doing that.</p><p><strong>Carla Harris:&nbsp;</strong>And what year was this Ana?</p><p><strong>Ana Flores:</strong>&nbsp;That was 2005, 2006 that we launched it.</p><p><strong>Carla Harris:&nbsp;</strong>So, 15 years ago. So now these folks are in their 30s or late 20s.</p><p><strong>Ana Flores:&nbsp;</strong>Yes.</p><p><strong>Carla Harris:&nbsp;</strong>And you were understanding how to speak to them and how to create content that they would consume.</p><p><strong>Ana Flores:&nbsp;</strong>Exactly. So, and it's tricky, right? Because I think music is a very universal language, right. But also, how do we speak to Latino youth, which is constantly changing, which navigate into two worlds. They can navigate watching MTV as they can navigate watching Univision with their parents or their grandparents, to wanting to watch sports and then also wanting to connect to their soccer teams locally, but also keep up to date. And that they enjoy everything from rancheras to, again, pop like Shakira, et cetera, and trying to bring us together via that content, via that culture that really speaks to us.</p><p><strong>Carla Harris:&nbsp;</strong>Had the Eureka moment happen for corporate yet that all things Latino were going to be big? Had it happened yet or had it even happened in your own consciousness yet?</p><p><strong>Ana Flores:&nbsp;</strong>That's a really good question. It had happened, but the investment wasn't there yet. And it's still slowly trickling in. Right? It's is very much like,&nbsp;Oh, yeah. No, we get it.&nbsp;They're big in numbers.&nbsp;Oh, yeah. We get it.&nbsp;They're growing.&nbsp;Oh yeah.&nbsp;2010 we see the numbers and the census we need to start reallocating budgets, but we're not ready to allocate the budgets at the real importance that it needs to have to reflect the audience that they're speaking to and the social and economic and cultural power that we have.</p><p><strong>Carla Harris:&nbsp;</strong>When did you get the ‘Aha!’ moment that this could be more than a niche market? Had you yet had the awakening or that didn't hit you until you started your first baby, SpanglishBaby?</p><p><strong>Ana Flores:&nbsp;</strong>It started with SpanglishBaby.</p><p><strong>Carla Harris:&nbsp;</strong>Ok let's talk about that.</p><p><strong>Ana Flores:&nbsp;</strong>So I actually quit my job because I quit all my jobs because I've always been an entrepreneur at a heart. I did the thing that stereotypes. Moms, women. Right. That you're gonna quit your job once you have a kid. And I actually did do that because I really wanted to be a full-time mom for a while. What I didn't know was that my daughter was born in 2007, so the Recession hit the next year. And since we had both my my husband from is from Mexico. So, all of our families, we were just here alone just with friends. So, it really was hard once I had quit my job and within eight months a recession hit, meaning that he lost his job. It hit really particularly hard in L.A. because there was also a writers' strike. So, at the same time, in 2008, the industry shut down. I then also fell into the realization of how hard or almost impossible it is to want to have a job, even if I was willing to like, get, you know, minimum wage. But that wouldn't pay for daycare. So we were stuck. And what I started discovering then was the world of blogs and mom blogs. That's where I was finding out how to be a mom. I was consuming this content, but also finding a community of women that were like me, that were ambitious, that were driven, that knew how to create content, that knew how to build community. And we're doing it through this fabulous medium that I didn't need money for that. I just needed nap times, my daughter's nap times to be able to get it done at home. So I decided to launch Spanglish Baby because I wasn't seeing content for women like me and my partner who Roxana, whom I launched it with. She was an Emmy-winning producer, was going through the same exact things that I was going through, and we both decided to launch Spanglish Baby as a resource for parents raising bilingual and bi-cultural kids. I needed that. I wasn't seeing that in that community of bloggers. And then just in general, right, if I would Google, if I would search for it. So, I decided that I would launch it, that we would create it. And it hit a nerve right away. It was content that was needed. And we were speaking directly from my mom to other moms. We were bringing in experts, et cetera. But to your question, once I, I started getting deep in that, I first of all, I didn't realize how revolutionary it would be to talk about kids learning a second language, about kids learning Spanish. For me, it was, it's like,&nbsp;Isn’t that what we want?&nbsp;I mean, we have the brain capacity as soon as we're born, even in uterus, to learn this language. Yet we're not teaching it until high school. So that became just the awakening of, OK. Why are people giving us these negative comments about us wanting our children to speak Spanish, about us wanting to keep the culture alive, about us wanting them to really couldn't have a connection with their root and their heritage. And then I started getting into the research of it. And then in 2010, the census came out. And that last census really set the mark that the Hispanic Latino community was growing and was the fastest growing minority. Though I don't like using that word, but that's the term still used in marketing, and that resources would be allocated. So, the more I started seeing and realized that one in four children being born at that time, 10 years ago, and now in some places like California, it's one in three are Latinos. I was like, that is our audience. And who is speaking to these moms and who is understanding the resources that these moms need? And if I was looking at Disney, and I had many conversations with many people in Disney about: How can we make accessible the content in Spanish? How can we make more content that speaks to our children? Where are the Latina Disney princesses? How can it be that such a huge, you know, vast, rich indigenous culture and beautiful culture cannot be represented by a beautiful princess? Can you imagine a beautiful Inca or Mayan princess? So just really realizing that and seeing that,&nbsp;OK, there's a lot of work to be done here.&nbsp;And the beauty of the blogging space of the digital media space was that it democratized our voices, was that it allowed a mom in the middle of the recession almost having to go into food stamps to be able to build something. To build something that spoke to me, and that created content and visibility for a community that was completely not only ignored, but being erased.</p><p><strong>Carla Harris:&nbsp;</strong>So talk to me about how you were defining success? I'm sure when you started it was like, well if anybody responds that's got to be a success. But as you started realizing so you had a confluence of events. You had a 2010 census that said, you know, this is a big and growing community, the fastest growing community. There is real disposable income there. Your own realization that nobody else was out here having this conversation. You couldn't find any. And you clearly knew there was a big audience. So, somebody needed to provide the content and the information. So, again, never having started a business, you kind of having a little bit of an entrepreneurial itch. How did you define success?</p><p><strong>Ana Flores:&nbsp;</strong>Listen. It was really hard to define success when nobody was doing that. It was hard when I would talk to the people around me, from family members to people I admired and trusted. And I would say, you know, I'm watching this blog, but I have a really big vision behind it. And it was like, \"Ay que cute!\" How cute, right? It was like,&nbsp;oh, she's a mommy blogger. That's really cute.&nbsp;It's like no there's so much more to it than this. And we're talking again, 2009, when I launched the blog, 2010 when we had been blogging for a year and a half and really seeing success because the community was responding. That was success to us. If I would receive a comment from somebody saying, you know what, there has been so many myths about raising bilingual children and how we're going to damage them because they're not going to be able to speak any language. You're going to confuse them. And they were like thanks to the information and the resources that you're providing, I understand that I can now raise my child bilingual and I know how to do it now. That was success to us. And it was one mom at a time, one day at a time, one child at a time. And then it transitioned into: we need to monetize. So we had been blogging for about a year. And we had been really building a community of other Latina mom bloggers that were coming. Twitter really helped. Twitter was one where we were put, you know, we would connect, we would find each other. There wasn't Facebook groups. There wasn't Instagram. It was just really that and and email groups and comments on blogs. And that's where we were starting to meet each other. But it was the same thing. Nobody, none of us were monetizing yet at that moment. What we now know as influencer marketing was at its infancy and it was mostly mom bloggers, a handful of them, that were creating these networks where they would work with the brands to try to help them understand this fascinating world of blogging and digital media and in how they could speak to the…reach moms through mom bloggers and the authentic content that they were creating. And they would connect the bloggers with brands. So actually, it was going to conferences like BlogHer and different kinds of conferences that I was able to go to that I started meeting a lot of these women and I did become the token Latina and I understood it. And I knew exactly what I was gonna do with that, because that would allow me to open doors and to learn and to bring opportunities. And they were more than willing to teach me and to push me forward to be why aren't you doing what we are doing. Right? Because they didn't know how to speak to the Latina mom, or they didn't know how to talk to these brands that were not the multicultural agencies to help them understand the importance of reaching this audience. But I could. So, I decided to launch what is now #WeAllGrow Latina. Back then, in 2010, again with a laptop, Google Drive and a Wordpress site. And a logo that a friend did…and I launched Latina Bloggers Connect. And and I basically said, if you want to join this network and I will do my work to work with the brands to bring opportunities to all of us, because unless we start monetizing, we weren't going to be able to have our story shared.</p><p><strong>Carla Harris:&nbsp;</strong>And you learned how to monetize from going to these conferences and talking to these other moms, or did you just watch what was happening and look at all the different ways that people were monetizing? And I'd love you to speak to that, because an entrepreneur that's out there that has a community that they can talk to that can write, I want them to understand the playbook of how you need to think about monetizing, if this is your journey.</p><p><strong>Ana Flores:&nbsp;</strong>So I definitely learned by going to the conferences, and that's why eventually I ended up creating my own conference because I knew the benefit that it had bringing all these groups together in one place. So going to those conferences and speaking and meeting the brand representatives, meeting the agencies, et cetera, and then learning how to make the deals. Again, influencer marketing, the term didn't exist. So we were all blogger networks. Budgets were all over the place. We were all trying to figure out. And I did make the mistake, because you need to understand and I know you know this, that about 10 percent of overall marketing dollars are allocated to multicultural marketing. That means multicultural marketing is Hispanic, is African-American, is LGBTQ, it's Asian-American, Native American. I mean, it's all lumped into this group of multicultural. So, and if 10 percent is going to us, it means you start, you know, slicing the pie and what is there for Latinas is less than one percent. So even though I was meeting all these brands, I needed to connect with, it was always the multicultural teams. If it wasn't the multicultural teams, we really probably wouldn't get the door open. So that meant that even though the bloggers that we were working with and the work that we were doing had the same value of the dollar, we were only getting pennies to the dollar. So, as it was, my budgets were much smaller, but I had to learn that along the way. So I could learn from them the techniques and tactics and we were all always sharing with each other what worked and what type of campaigns worked. But the budgets themselves were kind of like the Wild, Wild West.</p><p><strong>Carla Harris:&nbsp;</strong>So talk to me about the data. Did you have to collect a whole bunch of data to try to convince people that this was indeed a big market? And, you know, look at how much money Latina mom’s spend. And here are the things that they spend their money on. So talk to me a little bit about that.</p><p><strong>Ana Flores:&nbsp;</strong>Oh, absolutely. There was a lot of convincing. All across the board everywhere. And there was a lot of curiosity because blogging itself was so new and was in its infancies and PR world’s and media and advertising were trying to figure out where it fit in and how to invest in it, right? And what to do. So it was our job to convince them to invest in Latinas and not only Latina moms, because by then there was much more lifestyle bloggers, millennials, et cetera. So basically there wasn't a lot of data and we weren't a research firm. And so it wasn't even whatever we could bring back, which was the data that we had from the audiences that our bloggers were reaching wasn't really that meaningful to them. It had to come from a more authoritative source. And there wasn't a lot, like I said, there was the census. The Pew Research had been doing some research on and some fascinating studies on Latinos. But what really changed the game for us, specifically for Latinas, was the Nielsen Latina report, which came out around 2016, led by Monica Gil, who's now V.P. in Telemundo. And she really, really, really brought forward the force of the Latina consuming power. But in general, we already know that the Hispanic purchasing power is over $1.7 trillion. Actually, if we were a nation, we would be number seven in the world based on our GDP power, that's right behind India. So we definitely have the financial force. But really, we need the data to really showcase how Latinas are overarching and over indexing in consumers, especially when it comes to beauty products, to electronics, moviegoers. Right? We buy the tickets at the box office. And all of that really helped to start to inform that narrative and to understand that this was a valuable proposition, to actually reach the Latino community via people, via these voices that they already looked up to and trusted.</p><p><strong>Carla Harris:&nbsp;</strong>Yeah. I wanted to bring up that point because especially entrepreneurs that are serving an ethnic demographic for those, as I said, that don't understand that market and haven't played in that market before. They don't realize A.) how big it is and B.) how fast it's growing. So part of what I'm trying to put out there is the playbook that you might, in fact, have to have collaborations and partnerships with people who are doing that research, who can bring it to the market and shed a spotlight on it so that you can have these opportunities, if you will, to serve that market. And it sounds like to me you connected with the right sources that were producing the data. You were able to talk and speak to some of it, but you also connected and collaborated with those who could help bring that that data to the marketplace.</p><p><strong>Ana Flores:&nbsp;</strong>We were practically just as soon as we would see that data, we would grab it and figure out how to how to be able to put that in our deck and be able to switch the conversation. But a lot of it had to come from really, you know, the impact that our own campaigns were having and really start to build upon that and the data that was meaningful. And the thing is that it's very difficult in social media as well, because we know that the impact that something like a conference can create and these in real life connections can have to continue building our economic and social and cultural power is really hard to translate into hardcore data. Right? It's that qualitative data. So, it’s, we definitely have now in our 10th year, just is growing a lot more and figuring out how we can also become that place to be able to serve those different partners and understanding really where Latinos are going, what we're thinking, where we put our dollars, because that continues to shift. And the Latina 2.0 report and many others since then have now really showcased that. And not only do we have the consumer power, but we're really conscious and we're becoming much more and where we invest our dollars and we want to invest our dollars on those brands and organizations that are actually speaking to us, that we really have taken the credo and the mantra of representation matters very seriously, especially the last five years when the erasure has become so clear and we want to invest in those that are seeing us and those that are investing in us. It became so important because we created a safe space for us to come together. But it was also that space for the brands to authentically show up in a place that mattered to us.</p><p><strong>Carla Harris:&nbsp;</strong>So let let's talk about five years. You were now making a million dollars a year and there are very few women owned businesses that and even that short period of time are producing that kind of revenue. Now, help me understand, you did all of that without any outside investment, correct?</p><p><strong>Ana Flores:&nbsp;</strong>Zero.</p><p><strong>Carla Harris:&nbsp;</strong>Wow. Okay, so that was just really being of the mind to reinvest whatever profits you were making back into the business to drive it to growth?</p><p><strong>Ana Flores:&nbsp;</strong>Exactly. Yes. It was all brand campaigns. Absolutely brand campaigns. Again, we were able, since we were the first ones in the space, in the Latino space. We quickly had competition within a year. And it came from men. And trying to reach this audience who saw the potential — right? — saw the potential enough not to want to invest, but to want to create it themselves. And that was good. Competition was really healthy, and it was great. But it definitely came from the brand partnerships and reinvesting into the company. See, the thing is that we didn't sell a product. We sold a service. So, I didn't have collateral. So even if I wanted to go to the banks and to get a line of credit, I was denied completely because I didn't have any collateral.</p><p><strong>Carla Harris:&nbsp;</strong>Let's talk about what the brand campaigns look like. The economics around that. So, can you describe for someone who doesn't understand how the influencer market works, what you were doing with those brands and how the conversation worked?</p><p><strong>Ana Flores:&nbsp;</strong>So those brand campaigns and specifically what became influencer marketing is actually very transactional. So basically, it's knowing what their budget is, what their goals are and profile of the influencer they want. And then we would be able to go back with that budget and the type of deliverables. So a blog post isn't the same as an Instagram post. An Instagram post isn't the same as a tweet. They all have a different value. So we would actually assign a dollar value to each post. And it also depends on the level of reach and engagement. And those metrics continue to shift. But usually, it will be impressions that they're looking for per influencer that we're working on. So, it's either a hashtag impression, if it's a hashtag heavy campaign, or it is per deliverable per influencer and then the formulas to add up, and then our profit margins, we would try to have them around 50 percent. So it's 50/40 percent profit margin for each campaign.</p><p><strong>Carla Harris:&nbsp;</strong>Wow. Outstanding. So we went from television producer to blogger to someone who had a business blog into monetizing that, who now has a business full of connectors that can influence very, very large markets. You've done over a million dollars. Now, do you need outside capital? Or have you ever raised outside capital for the business?</p><p><strong>Ana Flores:&nbsp;</strong>&nbsp;You know. So again, in 2010, really the conversations that we have now of VC funding for women and especially for Latinas, were just not being had. Because what I created was something so new. And in a market that was still considered in a way like an emerging market or, again, multicultural market. People didn't see the value. And I knew that. So I had to make a decision. Am I going to spend my very precious time as a mom and as an entrepreneur — I had a team of 12 by then — creating and meeting the needs of my community and of my clients? Or am I going to spend my time trying to get. I was already about 40 years old trying to get into accelerators and having to spend six months there? Or am I going to just keep doing what we're doing so well and count on that money and count on that growth. And I decided the latter, that we would keep going. I have had several offers for acquisitions, again, from men, who saw the impact of what we were doing but needed to check it off as their Latina initiative. And we became so community driven. We became so mission driven. And once we truly understood the impact of what we were doing at-large for the community and our overall visibility and representation, that I wasn't willing to give that up.</p><p><strong>Carla Harris:&nbsp;</strong>So you pivoted, you evolved from connections and influencing to the conference, as you said earlier, because you saw the real value in bringing everybody together and, you know, being able to make these connections. Right? So that's what the business looks like today, the influencing and the event driven businesses. Is that right? With the real focus around Latinos and the size of that market.</p><p><strong>Ana Flores:&nbsp;</strong>Yes, completely. So, it is creating safe spaces for us to connect in person and in real life and online. And we've always been able to manage both. And we still do the campaigns and the influencer. But as part, not as one-off campaigns, and not the 20 that we used to do per month, because we went to have more integrated marketing campaigns where we can really move the needle for the community and do it with the help of the brands. Right? And that was a slow move. So I knew, and this is this is interesting. So, part of the story was that when we launched the conference in 2015, I did it to meet a need not only because I knew that that's where I had learned, but also because every time I would go to to these conferences, I was still just a handful of Latinas there. And I was like,&nbsp;I am learning so much here. I need more women to get the benefit.&nbsp;But then more and more Latinas would ask me, like, “When are you going to do the conference?” And then I would get brands around Q3, Q4 were there. You know, our clients were they were working on their budgets for the next year, asked me: “Are you going to do a conference? Should we allocate something there?” And I was like,&nbsp;OK. Obviously there's a need and obviously I have the resources to make it happen.&nbsp;By then, we had built a solid reputation in the industry. And I launched the conference. I announced it. Neutrogena was our title sponsor. And I actually I talked to them, to the agency. I explained what I wanted to do. And they were like,&nbsp;well, if you build, it will be there, but you have to build it.&nbsp;So they didn't sign on the dotted line. They just told me, “We'll stand by you.” But I had to announce it. I had to make it happen. I had to show because when you're creating a conference for the first time, you don't have proof, right? You don't have a product that you're selling a product that I can go pitch and Shark Tank somewhere. It's an idea. It's a concept. It's a deck. So you have to have credibility and you have to have already earned that confidence within the brands who are going to be the ones monetizing that and the community who's going to buy tickets. So I announced it. I set a date. I didn't even have a venue. Don't do this. That's how I did it. But that's not how I recommend people do it. And within a week, we had sold over 100 tickets. Neutrogena signed on the dotted line and we had the first conference for 250 people sold out within the next ten months. And then by the next year, it grew to five hundred. We changed venue, location, and it just continued growing where we would sell out within hours, ten months in advance. So the community was helping us monetize as well because it was that, them buying the tickets, et cetera, that would help us say, like,&nbsp;OK, we're ready to, you know, dedicate the next 10 months to build this conference. We wouldn't even announce speakers. The conference would just sell on its own because of the reputation it already had and the magnitude of the ripple effects that would come out of what people would learn and who they would connect with while there.</p><p><strong>Carla Harris:&nbsp;</strong>Right, and your validation that people needed a place to meet, to be able to ideate, to be able to learn from each other. So, it had almost nothing to do with the speakers and everything to do with the fact that you created the space and you were smart enough to also know what content was going to be of value, which added value on top.</p><p><strong>Ana Flores:&nbsp;</strong>Well, listen, it was crazy how people didn't expect it. People already had, you know, the stereotypes within the Hispanic community. They knew that if it was a Latina conference, the bar was set really low. So my job was to set the bar really freaking high and to create something. And that's something that's a mode that our communities function in, not only at work, but as entrepreneurs and everything. We're always expected to underperform. Not only are we at the bottom of the totem pole when it comes to equal pay, but those women that are making 46 cents to the dollar that a white, non-Latino man makes, are expected to over perform. Us as, you know, creating a conference, we were expected to deliver something really big. And we did with half the dollars then, you know, a community or a company or a conference similar to ours that would be in the general market would be able to do with five times the funds.</p><p><strong>Carla Harris:&nbsp;</strong>So what's next? Ana, we are post COVID. So assume that we're sitting in August of 2021 now and you're thinking about what the future looks like. What’s next for #WeAllGrow Latina network?</p><p><strong>Ana Flores:&nbsp;</strong>You know, it's the community. We want to be&nbsp;the&nbsp;go to community for Latinas to really feel seen, to really feel heard. But from there be able to grow our power and our generational wealth. We really want to focus on our finances because there is this big disconnect between our consumer power, our GDP, our purchasing power and where it's going back, right? We're not building wealth yet. And we're not keeping that wealth within our communities. And we're not securing the generational wealth. So all the work that we're doing right now and that we're putting forward cannot be lost with this generation. We need to create a better future for our children and their children, and their children, because we know that that is how wealth is built in this country. So that is what we see. We see a place where we can continue building our confidence. We never say that we want to empower Latinas because we have the power. We just want to help you unleash it, and see it, and feel the confidence to use it and to put it forward. And we really want to be that place where you will learn not only from finances but doing it from that lifestyle place. And hopefully we'll be back in person really soon. But we want this to become a global movement.</p><p><strong>Carla Harris:</strong>&nbsp;So there’s two pieces: you want to help them figure out how to get more money. So how to make sure that you get your worth. That's one piece. The other piece is, how to invest it and grow it.</p><p><strong>Carla Harris:&nbsp;</strong>All right. So, we have a tradition on Access and Opportunity, Ana, where we have a lightning round of questions, where we hopefully will have our listeners have an opportunity to know you, Ana, the woman. So, are you ready? I'm going to give you some questions and then you give me the first thing that comes to your mind.</p><p><strong>Ana Flores:&nbsp;</strong>Let's do it.</p><p><strong>Carla Harris:&nbsp;</strong>Twitter or Instagram?</p><p><strong>Ana Flores:&nbsp;</strong>Instagram.</p><p><strong>Carla Harris:&nbsp;</strong>What's your personal mantra?</p><p><strong>Ana Flores:&nbsp;</strong>I can do this.</p><p><strong>Carla Harris:&nbsp;</strong>What's your favorite Salvadorian dish?</p><p><strong>Ana Flores:&nbsp;</strong>Ay pupusas of course!</p><p><strong>Carla Harris:&nbsp;</strong>City or countryside.</p><p><strong>Ana Flores:&nbsp;</strong>Countryside these days.</p><p><strong>Carla Harris:&nbsp;</strong>Winter or summer?</p><p><strong>Ana Flores:&nbsp;</strong>Summer.</p><p><strong>Carla Harris:&nbsp;</strong>Coffee or tea?</p><p><strong>Ana Flores:</strong>&nbsp;Coffee in the morning. Tea in the afternoon.</p><p><strong>Carla Harris:&nbsp;</strong>In the office building. Or working from home?</p><p><strong>Ana Flores:</strong>&nbsp;Working from home.</p><p><strong>Carla Harris:&nbsp;</strong>If you had a talk show, who would be your first guest?</p><p><strong>Ana Flores:&nbsp;</strong>&nbsp;My daughter.</p><p><strong>Carla Harris:&nbsp;</strong>One word that you want to describe your legacy.</p><p><strong>Ana Flores:&nbsp;</strong>Love.</p><p><strong>Carla Harris:&nbsp;</strong>Oh wow. Ana Flores, thank you so much. It has been my pleasure, privilege..</p><p><br></p><p><strong>Ana Flores:&nbsp;</strong>Oh no thank you so much for having me. I'm really excited and I've been loving your podcast.</p><p><strong>Carla Harris:&nbsp;</strong>Thank you. Well, listen. On a different note, as you continue to evolve and you want the partnerships to help educate the women and to help them understand how to grow wealth, then, you know, consider us as you think about partners.</p><p><strong>Ana Flores:&nbsp;</strong>I will. Thank you. Thank you so much. Very important to have allies.</p><p><strong>Carla Harris:&nbsp;</strong>Thank you.</p><p><strong>Carla Harris:&nbsp;</strong>Thank you all for joining us on this episode of Access & Opportunity. Be sure to stay tuned this season as we speak to more influencers in the sports, media and&nbsp;entertainment fields who've committed to reframing the narrative for women and people of color. You won’t want to miss it.&nbsp;&nbsp;</p><p>What did you learn today from Ana Flores? Send us your thoughts at&nbsp;<u>carlapod@morganstanley.com</u>. We would love to hear from you. Subscribe to Access & Opportunity on Apple Podcasts or wherever you listen. Thanks for coming along!</p><p><br></p>",
  "itunes:season": 7,
  "guid": "gid://art19-episode-locator/V0/oTphznX3DyzvKttcnzs1fvNGowkDNtGuy6LS89N2HHE",
  "pubDate": "Fri, 08 Jan 2021 11:00:00 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:keywords": "Entrepreneur,finance,Morgan Stanley",
  "itunes:duration": "00:34:46",
  "enclosure": ""
}