{
  "title": "139: 13th",
  "link": "https://audioboom.com/posts/7625130",
  "itunes:episode": 139,
  "itunes:title": "13th",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2991,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>The title of Ava DuVernay's extraordinary and galvanizing documentary refers to the 13th Amendment to the Constitution, which granted freedom to enslaved people. Except, it didn’t really. The drafters of the amendment included a loophole that allowed for the re-enslavement of any person convicted of a crime. 13th explores The progression from that loophole to the horrors of mass criminalization and the sprawling American prison industry. With a potent mixture of archival footage and testimony from a dazzling array of activists, politicians, historians, and formerly incarcerated women and men, DuVernay creates a work of grand historical synthesis.<br>\n<br>\n<a href=\"https://www.disappearedpod.com/\">FAM! WE LAUNCHED A NEW PODCAST</a>! <strong>\"Obsessed With: Disappeared.\"</strong> It's a true crime / comedy podcast hosted by Patrick Hinds and Ellyn Marsh--best friends of 20 years. Going in order, Patrick and Ellyn recap episodes of ID's \"Disappeared.\"  Episodes are live now! Be sure to check out our episode covering <a href=\"https://www.disappearedpod.com/episodes/episode/50959f8d/6-the-disappearance-of-maura-murray-s1-e6\">the disappearance of Maura Murray</a> <a href=\"https://www.disappearedpod.com/episodes/episode/50a1423d/an-interview-with-julie-murray-maura-murrays-sister\"><strong>AND PATRICK'S IN-DEPTH INTERVIEW WITH MAURA'S SISTER, JULIE MURRAY!</strong></a><strong><br>\n<br>\nLOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions</div>\n",
  "pubDate": "Tue, 07 Jul 2020 12:13:26 +0000",
  "guid": "tag:audioboom.com,2020-07-07:/posts/7625130",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}