{
  "title": "Fired Anti-Mandate Professor Now VINDICATED!",
  "itunes:title": "Fired Anti-Mandate Professor Now VINDICATED!",
  "pubDate": "Fri, 28 Oct 2022 05:30:00 +0000",
  "guid": "bb0ba6ab-a5cd-438c-871d-80379039cb7d",
  "link": "https://thejimmydoreshow.libsyn.com/fired-anti-mandate-professor-now-vindicated",
  "itunes:image": "",
  "description": "<p>University of California-Irvine professor and physician Dr. Aaron Kheriaty (http://aaronkheriaty.substack.com) was fired earlier this year after refusing to get the COVID vaccine since he’d already had COVID and developed natural immunity. Since then he’s become an outspoken advocate against vaccine mandates and the torrent of disinformation and misinformation spread by very powerful interests pushing vaccines and mandates while downplaying natural immunity and possible preventive measures.</p> <p>Jimmy speaks with Dr. Kheriaty about his experience opposing COVID protocols and the lawsuit underway that will force government officials like Anthony Fauci to defend the strictures imposed on the public during the pandemic.<br /> <br /> <span style= \"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Open Sans', 'Helvetica Neue', sans-serif;\"> Plus a segment on an international democracy forum silencing Dr. Jeffrey Sachs for sharing the truth about U.S. imperialism and violence across the globe since 1950.</span></p> <p>Also featuring Stef Zamorano, Aaron Maté and Mike MacRae! And phone calls from Joe Biden and Vince Vaughn!</p>",
  "content:encoded": "<p>University of California-Irvine professor and physician Dr. Aaron Kheriaty (http://aaronkheriaty.substack.com) was fired earlier this year after refusing to get the COVID vaccine since he’d already had COVID and developed natural immunity. Since then he’s become an outspoken advocate against vaccine mandates and the torrent of disinformation and misinformation spread by very powerful interests pushing vaccines and mandates while downplaying natural immunity and possible preventive measures.</p> <p>Jimmy speaks with Dr. Kheriaty about his experience opposing COVID protocols and the lawsuit underway that will force government officials like Anthony Fauci to defend the strictures imposed on the public during the pandemic.   Plus a segment on an international democracy forum silencing Dr. Jeffrey Sachs for sharing the truth about U.S. imperialism and violence across the globe since 1950.</p> <p>Also featuring Stef Zamorano, Aaron Maté and Mike MacRae! And phone calls from Joe Biden and Vince Vaughn!</p>",
  "enclosure": "",
  "itunes:duration": "01:04:32",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "University of California-Irvine professor and physician Dr. Aaron Kheriaty (http://aaronkheriaty.substack.com) was fired earlier this year after refusing to get the COVID vaccine since he’d already had COVID and developed natural immunity. Since...",
  "itunes:episodeType": "full",
  "itunes:summary": "University of California-Irvine professor and physician Dr. Aaron Kheriaty (http://aaronkheriaty.substack.com) was fired earlier this year after refusing to get the COVID vaccine since he’d already had COVID and developed natural immunity. Since then he’s become an outspoken advocate against vaccine mandates and the torrent of disinformation and misinformation spread by very powerful interests pushing vaccines and mandates while downplaying natural immunity and possible preventive measures. Jimmy speaks with Dr. Kheriaty about his experience opposing COVID protocols and the lawsuit underway that will force government officials like Anthony Fauci to defend the strictures imposed on the public during the pandemic. Plus a segment on an international democracy forum silencing Dr. Jeffrey Sachs for sharing the truth about U.S. imperialism and violence across the globe since 1950. Also featuring Stef Zamorano, Aaron Maté and Mike MacRae! And phone calls from Joe Biden and Vince Vaughn!"
}