{
  "title": "513: Why is Hufflepuff's Professor Sprout So Absent From the Harry Potter Series?",
  "link": "https://audioboom.com/posts/7862440",
  "itunes:episode": 513,
  "itunes:title": "Why is Hufflepuff's Professor Sprout So Absent From the Harry Potter Series?",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4196,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Welcome Slug Club member, Franzi!</li>\n<li>Main Discussion: Professor Sprout & Herbology’s Role in the Harry Potter Series</li>\n<li>To start off, the hosts test their skills in a new game: Potter Plant or... Pokemon?</li>\n<li>What’s the first word that comes to mind when you think of Professor Sprout?</li>\n<li>What does Sprout's name origin tell us about her character?</li>\n<li>Miriam Margoyles shined in her limited screen time in the Potter films</li>\n<li>The Chronicles of Sprout and McGonagall are canon - should it be a spin-off series?</li>\n<li>Laura dishes on some good Sprout fan fictions as we revisit the Splitwick publishing controversy!</li>\n<li>Does Professor Sprout's character suffer from lack of representation? How would we rank her in comparison to other heads of house? </li>\n<li>Does the connection between Professor Sprout and Hufflepuff house get lost on the reader? Is she not that memorable for the average reader? </li>\n<li>Do Sprout (Hufflepuff) and Flitwick (Ravenclaw) suffer from not being focal points of Harry’s story and attention? </li>\n<li>Top Sprout Moments in the Potter series include devil's snare, mandrakes, keeping Hogwarts open and more</li>\n<li>Sprout, Snape, and Neville:  we discuss Herbology's role in the series and its relationship to Potions</li>\n<li>Quizzitch: What is the common name of the family of flowering plants, solenacaeae, which include tomatoes, potatoes, eggplant, bell and chili peppers? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week’s episode is sponsored by ThirdLove (Visit <a href=\"http://www.thirdlove.com/MuggleCast\">ThirdLove.com/MuggleCast</a> for 20% off your perfect fitting bra) and Quip (visit <a href=\"http://www.getquip.com/muggle\">GetQuip.com/muggle</a> to get a free plastic gum dispenser with any refill plan).</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like access to our recording studio, Bonus MuggleCast, a personalized thank you video from one of the hosts and more!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 11 May 2021 09:00:00 +0000",
  "guid": "tag:audioboom.com,2021-05-10:/posts/7862440",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}