{
  "title": "Take a Trip Through Switzerland’s Museum of Consumer Electronics",
  "link": "https://spectrum.ieee.org/switzerlands-museum-of-consumer-electronics",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/an-old-computer-in-a-display-box-surrounded-by-other-old-computers.jpg?id=31728837&width=1200&height=800&coordinates=0%2C59%2C0%2C60\"/><br/><br/><p>\n\tFor more than a decade <a href=\"https://enter.ch/home/visit/?lang=en\" rel=\"noopener noreferrer\" target=\"_blank\">Museum ENTER</a>, in Solothurn, Switzerland, has been a place where history buffs can explore and learn about the development and growth of computer and consumer electronics in Switzerland and the rest of the world. On display are computers, calculators, floppy disks, phonographs, radios, video game consoles, and related objects.\n</p><p>\n\tThanks to a new four-year partnership between the museum and the <a href=\"https://ieee.ch/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Switzerland Section</a>, IEEE members may visit the facility for free. They also can donate their time to help create exhibits; translate pamphlets, display cards, and other written media; and present science, technology, engineering, and math workshops.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"room full of historical audio radios\" class=\"rm-shortcode\" data-rm-shortcode-id=\"d7d959df925b5fdc0d2ff30436a34ce2\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"87029\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/room-full-of-historical-audio-radios.jpg?id=31728919&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The technology on display includes televisions and radios from the 1950s.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">ENTER Museum</small></p><h2>Collections of calculators, radios, telephones, and televisions</h2><p>\n\tENTER started as the private collection of Swiss entrepreneur Felix Kunz, who had been amassing computers and other electronics since the mid-1970s. Kunz and Peter Regenass—a collector of calculators—opened the museum in 2011 near the Solothurn train station.\n</p><p>\n\tThe museum’s collection focuses on the history of technology made in Switzerland by companies including <a href=\"https://en.wikipedia.org/wiki/Bolex\" rel=\"noopener noreferrer\" target=\"_blank\">Bolex</a>, <a href=\"https://en.wikipedia.org/wiki/Crypto_AG\" rel=\"noopener noreferrer\" target=\"_blank\">Crypto AG</a>, and <a href=\"https://www.cryptomuseum.com/manuf/gretag/index.htm\" rel=\"noopener noreferrer\" target=\"_blank\">Gretag</a>. The technology on display includes early telegraphs, telephones, televisions, and radios.\n</p><p>\n\tThere are 300 mechanical calculators from Regenass’s collection. One of the mechanical calculators, Curta, looks like a pepper mill and has more than 700 parts.\n</p><p>\n\tThe museum also has several <em>Volksempfängers</em>, the early radio models used by the Nazis to spread propaganda.\n</p><p>\n\tVisitors can check out the collection of working <a href=\"https://www.apple.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Apple</a> computers, which the museum claims is the largest in Europe.\n</p><h2>Free admission, discounts, and STEM education courses </h2><p>\n\tThe IEEE Switzerland Section began its partnership with the museum last year, when the <a href=\"https://www.facebook.com/EPFLieeeSB\" rel=\"noopener noreferrer\" target=\"_blank\">student branch</a> at the IEEE <a href=\"https://www.epfl.ch/en/\" rel=\"noopener noreferrer\" target=\"_blank\">EPFL</a> hosted a <a href=\"https://www.youtube.com/watch?v=C9FnbAatUhA\" rel=\"noopener noreferrer\" target=\"_blank\">presentation</a> there, says IEEE Senior Member <a href=\"https://www.linkedin.com/in/mathieu-c-303b1920/\" rel=\"noopener noreferrer\" target=\"_blank\">Mathieu Coustans</a>, the Switzerland Section’s treasurer.\n</p><p>\n\tIn May, the section and the museum organized a <a href=\"https://enter.ch/wp-content/uploads/2022/06/Leserbeitrag_100JahreRadio.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">workshop celebrating 100 years of radio broadcasting in Switzerland</a>. IEEE members presented on the topic in French, Coustans says, and then translated the presentations to English.\n</p><p>\n\tBased on the success of both events, he says, the section and the museum began to discuss how else they could collaborate.\n</p><p>\n\tThe two organizations discovered they have “many of the same goals,” says IEEE Member <a href=\"https://www.linkedin.com/in/violettavitacca/\" rel=\"noopener noreferrer\" target=\"_blank\">Violetta Vitacca</a>, chief executive of the museum. They both aim to inspire the next generation of engineers, promote the history of technology, and bring together engineers from academia and industry to collaborate. The section and museum decided to create a long-term partnership to help each other succeed.\n</p><p>\n\tIn addition to the free visits, IEEE members receive a 10 percent discount on services offered by the museum, including digitizing books and other materials and repairing broken equipment such as radios and vintage record players. Members can donate historical artifacts too. In addition, IEEE groups are welcome to host conferences and section meetings at the facility.\n</p><p>\n\tThe IEEE Switzerland Section as well as members of student branches and the local <a href=\"https://www.ieee.org/communities/life-members/groups.html\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Life Members Affinity Group</a> have agreed to speak at events held at the museum and teach STEM classes there.\n</p><p>\n\t“The museum is a space where both professional engineers and young people can network and learn from each other,” Vitacca says. “I think this partnership is a win-win for both IEEE and the museum.”\n</p><p>\n\tShe says she hopes that “collaborating with IEEE will help Museum ENTER gain an international reputation.”\n</p><p>\n\tThe perks of the collaboration will become “especially attractive with the opening of the brand-new Museum ENTER building” next year, says IEEE Senior Member Hugo Wyss, chair of the Switzerland Section, who led the partnership effort.\n</p><h2>Exhibits on gaming, inventors, and startups</h2><p>\n\tThe museum is set to move in May to a larger building in the village of Derendingen. When it reopens there in November, these are some new additions visitors can look forward to:\n</p><ul>\n<li>Audio guides, display cards, and pamphlets in German, English, and French.</li>\n<li>“The Academy,” which aims to inspire the next generation of engineers, offering workshops, lectures, and other events, as well as access to a technical library.</li>\n<li>A data digitization laboratory where collectors and electronics enthusiasts can convert vintage media carriers, records, and film.</li>\n<li>A public-gathering piazza with an attached café and meeting rooms.</li>\n</ul><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Electronic in foreground with a group of children watching adult use something in his hands in background\" class=\"rm-shortcode\" data-rm-shortcode-id=\"28cd54c8d9fc95e0a3c25ff98504f5f7\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"3d02b\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/electronic-in-foreground-with-a-group-of-children-watching-adult-use-something-in-his-hands-in-background.jpg?id=31728924&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The museum offers STEM workshops.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\"> ENTER Museum</small></p><p>\n\tIn addition, these eight permanent exhibits will be available, the museum says:\n</p><ul>\n<li><strong>Game Area.</strong> A display featuring innovations that have driven the rise of gaming and high-performance computing.</li>\n<li><strong>Hall of Brands.</strong> A showcase of technologies from well-known companies.</li>\n<li><strong>Now.</strong> Current technology highlighted in the news.</li>\n<li><strong>Show of Pioneers.</strong> A look at the inventors of popular consumer and computer electronics.</li>\n<li><strong>Switzerland Connected. </strong>A showcase for the country’s former and current accelerators, startups, and schools.</li>\n<li><strong>Time Travel. </strong>A retrospective look at 150 years of technology.</li>\n<li><strong>Typology of Technology. </strong>Applications such as optical and magnetic recording used for music and film.</li>\n</ul><p>\n\tThe museum also plans to curate special exhibitions.\n</p><p>\n\t“We are going from being simply a museum with an extensive collection to being a center for networking, education, and innovation,” Vitacca says. “That’s why it’s important for the museum to collaborate with IEEE. Our offerings are not only unique in Switzerland but also across Europe. IEEE is a great partner for us to help get the word out about what we do.”\n</p>",
  "pubDate": "Fri, 16 Sep 2022 18:00:00 +0000",
  "guid": "https://spectrum.ieee.org/switzerlands-museum-of-consumer-electronics",
  "category": [
    "Ieee news",
    "Ieee member news",
    "Ieee history",
    "Museum",
    "Consumer electronics",
    "History of technology",
    "Type:ti"
  ],
  "dc:creator": "Joanna Goodrich",
  "media:content": ""
}