{
  "title": "Number of Germans who agree with Russia&#039;s position on Ukraine increasing – study",
  "link": "https://www.rt.com/news/565941-study-more-germans-agree-russian-narratives/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565941-study-more-germans-agree-russian-narratives/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6364da3785f5402cd913ffa9.jpg\" /> A growing number of Germans agree with Russia’s position on the root causes of the Ukraine conflict, a recent study indicates <br/><a href=\"https://www.rt.com/news/565941-study-more-germans-agree-russian-narratives/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The report's authors urged the authorities to do more to counter what they see as disinformation from Moscow</strong></p>\n            \n                        \n            <p>The number of Germans who agree with Russia&rsquo;s position on the root causes of the Ukraine conflict has risen over the past several months, a recently published study reveals. The researchers categorically dismissed Moscow&rsquo;s version of events as &ldquo;<em>propaganda</em>&rdquo; and called on the German government to take action to counter it.</p>\n<p>Published on Wednesday and titled &lsquo;Endurance test for democracy: Pro-Russian conspiracy narratives and belief in disinformation in society&rsquo;, the paper is based on opinion polls conducted at intervals of several months.</p>\n<p>According to the report, 19% of respondents agreed with the statement that Russia had no choice but to attack Ukraine in response to NATO provocations; 21% partly supported this notion. In April, the figures stood at 12% and 17% respectively, the study says.</p>\n<p></p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.08/thumbnail/62fce72c203027026d729960.jpg\" alt=\"The Kremlin in Russia&#039;s capital, Moscow. © Sputnik / Alexey Maishev\" />\n            <figcaption><a href=\"https://www.rt.com/news/561021-kremlin-eu-ukraine-gas/\">‘Kremlin-friendly’ politicians may grab power in West – The Spectator</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>People living in eastern regions which comprised the former German Democratic Republic tend to show more understanding toward Moscow, the report indicates. The number of people who believe that NATO provoked Russia into the conflict is said to be nearly twice as high there compared to western Germany.</p>\n<p>The researchers noted that supporters of the right-wing Alternative for Germany (AFD) party are far more likely to espouse such views than the general population. Similarly, those at the opposite end of the political spectrum from the Left party also display more acceptance of Russia&rsquo;s positions.</p>\n<p>NATO&rsquo;s expansion and its attempts to drag Ukraine into its sphere of control were cited by Russian President Vladimir Putin as one of the reasons for launching the military operation. The Kremlin argued that it had repeatedly tried to convey its national security concerns to the West, but they invariably fell on deaf ears.</p>\n<p>Senior Ukrainian officials have acknowledged that Kiev has not given up on the idea of joining the alliance, and that NATO has played a key role in strengthening the Ukrainian military.</p>\n<p>The authors of the study dismissed any narratives that are in line with Moscow&rsquo;s views as &ldquo;<em>disinformation</em>&rdquo; and &ldquo;<em>propaganda.</em>&rdquo; They claimed, however, that these ideas are &ldquo;<em>gaining ground among the German population in horrifying proportions.</em>&rdquo;</p>\n<p>They concluded by calling on the government to do more to counter the spread of what they consider to be &lsquo;disinformation&rsquo;, which the paper described as an &ldquo;<em>attack on democracy as such.</em>&rdquo;</p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 11:18:18 +0000",
  "dc:creator": "RT"
}