{
  "title": "AI Can Offer Insight Into Who Responds to Antidepressants",
  "link": "https://spectrum.ieee.org/at-last-insight-into-who-responds-to-anti-depressants",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/monitor-with-brain-scan-in-foreground-woman-with-electrodes-on-head-in-background.jpg?id=31886616&width=1200&height=600&coordinates=0%2C504%2C0%2C121\"/><br/><br/><p><em>This article is part of our exclusive <a href=\"https://spectrum.ieee.org/collections/journal-watch/\" rel=\"noopener noreferrer\" target=\"_self\">IEEE Journal Watch series</a> in partnership with IEEE Xplore.</em></p><p>Depression is an all-too-common psychiatric condition that can profoundly affect a person’s well-being. While there is a huge range of medications available to treat depression, many people don’t respond to the first or even second medications they are prescribed. As a result, doctors must often take a trial-and-error approach, meaning it could take months or even years to find an effective medication. </p><p>In the search for better approach, some researchers are exploring the use of machine learning to predict which patients will respond to a specific antidepressant medication. In a <a href=\"https://ieeexplore.ieee.org/document/9887881\" rel=\"noopener noreferrer\" target=\"_blank\">study</a> published 12 September in <a href=\"https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=10\" rel=\"noopener noreferrer\" target=\"_blank\"><em>IEEE Transactions on Biomedical Engineering</em></a>, one team describes a machine-learning algorithm that analyzes the electrical activity of people’s brains and could predict response to the antidepressant Sertraline with 83.7 percent accuracy. </p><hr/><p><a href=\"https://www.nyit.edu/bio/mravan\" target=\"_blank\">Maryam Ravan</a>, an assistant professor at the New York Institute of Technology’s <a href=\"https://www.nyit.edu/departments/electrical_and_computer_engineering\" target=\"_blank\">department of electrical and computer engineering</a>, was involved in the study. She notes that the current method for prescribing medication to people with depression is highly inefficient. </p><p>“The absence of biomarkers renders this branch of medicine completely dependent on personal interviews and patient reports,” says Ravan, citing one study showing that 33 to 37 percent of patients will remit after the first antidepressant chosen using the current trial-and-error method. </p><p>“Frustration with these inefficiencies led our group to determine if quantitative methods based on machine-learning analysis of brain electrical-activity patterns could offer more accurate clinical guidance,” she says. “Our data and that of others suggest that this is indeed the case.”</p><p>In their study, Ravan and her colleagues analyzed electroencephalogram (EEG) data from patients with depression before they received treatment. EEG is a relatively simple test in which electrodes placed on the scalp can record the electrical patterns of the brain. In total, the researchers analyzed pretreatment EEG data from 228 participants with <a href=\"https://www.mayoclinic.org/diseases-conditions/depression/symptoms-causes/syc-20356007\" target=\"_blank\">major depressive disorder</a>, who were randomly assigned to a placebo or treatment with Sertraline, a common <a href=\"https://www.mayoclinic.org/diseases-conditions/depression/in-depth/ssris/art-20044825\" target=\"_blank\">serotonin reuptake inhibitor</a> used to treat depression. </p><p>The researchers then applied machine-learning algorithms to determine who responded to treatment with Sertraline—and also the placebo. It has been widely documented across many studies that some patients’ health conditions can improve when they are given a fake treatment. </p><p>“[The placebo effect] may be based on patient belief, trust in the treatment team, simple passage of time, or may in fact have biological underpinnings reflective in brain-activity patterns which might be measurable,” explains Ravan. </p><p>She notes that a better understanding of the placebo effect could potentially lead to clinical treatments for those who would benefit from it. Indeed, the study results show that the machine-learning algorithms—along with predicting response to Sertraline with 83.7 percent accuracy—could similarly detect response to the placebo with 83 percent accuracy. </p><p>Ravan cautions that machine-learning approaches require massive data sets to ensure that results translate to the real world, and this study was based on a relatively small sample size. “[But], if our algorithms are truly as accurate as we think they are, application in the real world would lead to a great improvement in the efficiency and effectiveness of psychiatric treatment,” she says, noting that portable EEG devices are currently widely available and could be deployed in underserviced areas. </p><p><a href=\"https://www.eng.mcmaster.ca/msbe/people/faculty/gary-hasey\" target=\"_blank\">Gary Hasey</a>, an associate professor at <a href=\"https://www.mcmaster.ca/\" target=\"_blank\">McMaster University</a>’s department of psychiatry and behavioural neurosciences, who was also involved in the study, says the team is now working toward commercialization and broader implementation of their approach, through a startup company called Digital Medical Experts (DME). </p><p>“DME has patented psychiatric machine-learning technologies in the United States, Canada, and Australia,” he says. “We have created the infrastructure necessary for the remote collection of EEG data and are actively pursuing further investment.”</p><p>The team has also been exploring the use of machine learning to identify individuals with suicidal ideation. Notably, many people who die by suicide deny having suicidal ideation when asked.</p><p>“Our group has conducted a study in 68 subjects diagnosed with major depressive disorder, where we were able to identify the presence of suicidal ideation with accuracy of 70 percent using machine-learning analysis of the EEG signal,” says Ravan. “We are currently further testing and training these algorithms using a much larger data set.”</p>",
  "pubDate": "Mon, 10 Oct 2022 13:42:52 +0000",
  "guid": "https://spectrum.ieee.org/at-last-insight-into-who-responds-to-anti-depressants",
  "category": [
    "Journal watch",
    "Depression",
    "Machine learning",
    "Medications"
  ],
  "dc:creator": "Michelle Hampson",
  "media:content": ""
}