{
  "id": "yt:video:_JHN3kRfEUY",
  "yt:videoId": "_JHN3kRfEUY",
  "yt:channelId": "UC-JWw2juO3Ikj5C9VsNoGIw",
  "title": "M. Laser History 100k QnA",
  "link": "",
  "author": {
    "name": "M. Laser History",
    "uri": "https://www.youtube.com/channel/UC-JWw2juO3Ikj5C9VsNoGIw"
  },
  "published": "2021-08-25T11:06:50+00:00",
  "updated": "2022-09-02T16:30:32+00:00",
  "media:group": {
    "media:title": "M. Laser History 100k QnA",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "My Patreon- https://www.patreon.com/mlaser\n\nMy second channel M. Laser Random- https://www.youtube.com/c/MLaser2 \nwhere I just upload random videos from game-plays to vlogs and more.\n\nMy Twitter- https://twitter.com/MnLaser\n\n0:00 Intro\n0:43 Vodka or Rakija?\n0:47 UNIVERSITY?\n0:55 What events do you think were the biggest game changers for Eastern Europe throughout history?\n1:38 What is your favourite area of history to look into? What's your favourite time period of history and why?\n3:01 Would you consider doing any alternate history videos?\n3:10 How did you get interested into history? What started your love for history?\n4:10 Explain historical relativism. Why should/shouldn’t we apply it when evaluating historical figures? In your opinion, what are some pros and cons to historical relativism?\n9:39 Lost historical works you'd love the most to get your hands on?  I'd love to read the memoirs of Sulla, such an interesting guy!\n11:02 Is hot dog a sandwich?\n11:05 OMG would you defeat a horse size duck?\n11:17 What is your favorite song?\n11:48 What books would you recommend about History? (It can be any period/topic)\n13:07 Why'd you start, and what helps you keep going?\n15:03 What are the books you have used frequently in your videos as reference and/or research? What are some positives and negatives you would personally say about each of them?\n17:17 What is one area of history that you would like to learn more about?\n17:40 Has your general view of history or worldview changed since you've started doing history youtube? If so, are there any videos you found especially influential, or did these changes come about gradually and in the background?\n18:41 Favourite type of cheese?\n19:10 What YouTube channels do you watch the most?\n19:22 What was your most challenging video to make?\n20:12 What type of videos would you like to make but can’t because of lack of views/YouTube disliking it?\n22:45 What type of videos would you like to make but can’t because of lack of views/YouTube disliking it?\n_________________________________________________________________\nDuke tier Patreons\n-Sahni\n_________________________________________________________________\n#History #QnA #MLaser",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}