{
  "title": "S03.2: Summer Reads Interstitial: the \"Sarah was Right\" edition",
  "category": [
    "S03 - Interstitials",
    "full-length episode",
    "interstitial"
  ],
  "dc:creator": "Jennifer Prokop",
  "pubDate": "Wed, 26 Aug 2020 04:05:00 +0000",
  "link": "https://fatedmates.net/episodes/2020/8/25/s032-summer-reads-interstitial-the-sarah-was-right-edition",
  "guid": "5bc7409ec46f6d369ce5f644:5bcf6773419202388fdccb10:5f457da70d7adb41661bf414",
  "description": "<p class=\"\">We’ve been gone for many weeks, as you know, and during that time we read a whole lot of books. In this, our first interstitial of Season Three, we’ll talk about some of those books…and also Jen will spend some really important time confirming that Sarah is, in fact, right. About everything. That’s canon now.</p><p class=\"\">Next week, we’ll read Fifty Shades of Grey. We'll talk fan fiction, Christian Grey, 1st person POV, billionaires, the early 2010s, why the book mobilized so many readers, why it made so many others angry, and what we talk about when we talk about Fifty Shades of Grey. It’s Season Three. We’re back on our bullsh*t. Find Fifty Shades of Grey at Amazon, Barnes & Noble, Apple Books, Kobo, or at your local indie.</p><p class=\"\">Show Notes</p><p class=\"\">Cats like boxes! Dogs like to chew things! Speaking of Rube Goldberg machines, if you're ever in Chicago, you should really see the one at the Museum of Science and Industry.</p><p class=\"\">Who is the CJ Craig of \"Bless her cotton socks\" fame, you ask?</p><p class=\"\">Speaking of Vivian Stephens...We mentioned our episode with Steve Ammidown on the books she aquired was one of our favorite episodes, but you should really read this terrific interview with her that was published in the September 2020 issue of Texas Monthly magazine.</p><p class=\"\">The iHeartRadio podcast awards are a thing, and Jen just wants to be recognized.</p><p class=\"\">Milla Vane also writes as Meljean Brook, check out The Iron Duke if you like steampunk. But all of us recommend against using blood as lube.</p><p class=\"\">John Cusack's starring role as a hit man was in the 1997 movie Grosse Point Blank.</p><p class=\"\">Laquette left a perfect review on Goodreads of Like Lovers Do in case you need more convincing.</p><p class=\"\">Subscribe to Linda's calendar of virtual romance events.</p><p class=\"\">Did we mention there are Fated Mates t-shirts now? Check out the shop at JenReadsRomance for Kelly's romancelandia buttons, stickers, and cards, and her Resistance Buttons shop for Biden Harris 2020 buttons.</p><p class=\"\">Next week, Fifty Shades of Grey. Our next read along book is going to be A Heart of Blood and Ashes. That's the way we want it.</p><p class=\"\">Oh, and this hadn't been announced when we recorded, but Sarah wrote a contemporary novella during a pandemic, and it's coming out September 15th! Preorder Naughty Brits (an anthology with Sophie Jordan, Sierra Simone, Louisa Edwards and Tessa Gratton), wherever you get your ebooks: Amazon, Nook, Kobo, Apple or Google.</p>",
  "itunes:author": "Fated Mates",
  "itunes:subtitle": "Jen and Sarah recap their summer reading",
  "itunes:summary": "We’ve been gone for many weeks, as you know, and during that time we read a whole lot of books. In this, our first interstitial of Season Three, we’ll talk about some of those books…and also Jen will spend some really important time confirming that Sarah is, in fact, right. About everything. That’s canon now.",
  "itunes:explicit": "yes",
  "itunes:duration": "00:59:24",
  "itunes:image": "",
  "itunes:season": 3,
  "itunes:episode": 2,
  "itunes:title": "S03.2: Summer Reads Interstitial: the \"Sarah was Right\" edition",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "S03.2: Summer Reads Interstitial: the \"Sarah was Right\" edition"
  }
}