{
  "title": "Managing Intense Feelings for Kids and Grownups with Lindsey Kealey (165)",
  "link": "https://therapistuncensored.com/episodes/managing-intense-feelings-for-kids-and-grownups-with-lindsey-kealey-165-social-emotional-learning/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=managing-intense-feelings-for-kids-and-grownups-with-lindsey-kealey-165-social-emotional-learning",
  "pubDate": "Wed, 22 Dec 2021 11:52:16 +0000",
  "guid": "https://therapistuncensored.com/?p=12376",
  "description": "Learn the 3 C&#039;s of connection and social emotional learning. \nCo-host Dr. Ann Kelley and child specialist, Lindsey Kealey dive into strategies for teaching kids how to regulate their emotions and promote positive connection with others. Linsey Kealey has developed a trauma-based, neuroscience-informed program that uses social emotional learning and problem-solving strategies to help all of us make positive decisions and thrive in our relationships. She utilizes the Three C&#039;s method, connect, calm and collaborate, to help transform the way we interact with ourselves and others. They discuss the three C method of connection to help cultivate healthy relationships and positive development in our children. MORE www.therapistuncensored.com/episodes",
  "enclosure": "",
  "itunes:subtitle": "Brain breaks and the 3 C&#039;s for connecting - social emotional learning updated",
  "itunes:summary": "Brain breaks and the 3 C&#039;s for connection with social emotional learning, updated.<br />\nCo-host Dr. Ann Kelley and child specialist, Lindsey Kealy dive into strategies for teaching kids how to regulate their emotions and promote postiive conecitons with others. Lindsey Kealey has developed a trauma and neuroscience-informed program that uses social emotional learning and problem-solving strategies  to help us make positive decisions and thrive in our relationships. Find more at www.therapistuncensored.com/episodes and join our online community at www.therapistuncensored.com/join.",
  "itunes:author": "Ann Kelley, Lindsey Kealey",
  "itunes:image": "",
  "itunes:season": 6,
  "itunes:episode": 165,
  "itunes:title": "Managing Intense Feelings for Kids and Grownups with Lindsey Kealey (165)",
  "itunes:duration": "58:01"
}