{
  "title": "The Edition: Cop out",
  "link": "https://audioboom.com/posts/7969079",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1930,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: Can Cop26 deliver on its grand promises? <br>\nIn our cover story this week, Fraser Nelson assesses the state of the upcoming Cop26 summit in Glasgow and questions their very effectiveness in dealing with climate change in a world of global players with very different priorities. He is joined on the podcast by reporter Jess Shankleman, who is covering Cop26 for Bloomberg. (00:48)<br>\n<br>\n<em>‘This one’s in Glasgow, but you’d best think of it as the Edinburgh Festival for environmentalism. Lots of fun, lots of debates, lots of protests, lots of street action, but not really any much of concrete substance.’ </em>– Fraser Nelson<br>\n <br>\n<br>\nAlso this week: Is it moral to bribe your child to go to church?<br>\nTheo Hobson is paying his daughter to go to church and get confirmed. But how holy is this practice? Theo's idea is judged on the podcast by a holy trinity of priests: Steve Morris, Daniel French, and Nicholas Cranfield. (13:28)<br>\n<br>\n<em> ‘I’d be very worried if there was a suggestion that they as younger people are being prevailed upon to answer the right questions and say ‘actually Dad I do now believe!’ Simply for the exchange of some filthy lucre.’</em> – Rev. Nicholas Cranfield<br>\n<br>\n  <br>\nAnd finally: What are the ups and downs of book clubs?<br>\nAuthor Elisa Segrave was cancelled from a book club event after an email of hers apparently ‘hurt’ some members. This inspired her analysis of the book club concept for this week’s Spectator. Along with Simon Savidge the founder of Savidge Reads, she talks about her and her friends' bumpy relationship with book clubs. (25:10)<br>\n<br>\n<em>‘I was always really excited for what that next choice would be because it was like a mystery until that final moment or final glass of wine.’</em> – Simon Savidge<br>\n<br>\n<br>\nHosted by Lara Prendergast<br>\n<br>\nProduced by Sam Holmes</div>\n",
  "pubDate": "Thu, 28 Oct 2021 13:17:00 +0000",
  "guid": "tag:audioboom.com,2021-10-28:/posts/7969079",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}