{
  "title": "New program to support translational research in AI, data science, and machine learning",
  "link": "https://news.mit.edu/2022/new-program-support-translational-research-ai-data-science-machine-learning-0927",
  "description": "The MIT-Pillar AI Collective will cultivate prospective entrepreneurs and drive innovation.",
  "pubDate": "Tue, 27 Sep 2022 15:30:00 -0400",
  "guid": "https://news.mit.edu/2022/new-program-support-translational-research-ai-data-science-machine-learning-0927",
  "dc:creator": "School of Engineering",
  "content:encoded": "<p>The MIT School of Engineering and <a href=\"https://www.pillar.vc/\">Pillar VC</a> today announced the <a href=\"https://ai-collective.mit.edu/\">MIT-Pillar AI Collective</a>, a one-year pilot program funded by a gift from Pillar VC that will provide seed grants for projects in artificial intelligence, machine learning, and data science with the goal of supporting translational research. The program will support graduate students and postdocs through access to funding, mentorship, and customer discovery.</p>\n\n<p>Administered by the <a href=\"https://deshpande.mit.edu/\">MIT Deshpande Center for Technological Innovation</a><a href=\"https://deshpande.mit.edu/\">,</a> the MIT-Pillar AI Collective will center on the market discovery process, advancing projects through market research, customer discovery, and prototyping. Graduate students and postdocs will aim to emerge from the program having built minimum viable products, with support from Pillar VC and experienced industry leaders.</p>\n\n<p>“We are grateful for this support from Pillar VC and to join forces to converge the commercialization of translational research in AI, data science, and machine learning, with an emphasis on identifying and cultivating prospective entrepreneurs,” says Anantha Chandrakasan, dean of the MIT School of Engineering and Vannevar Bush Professor of Electrical Engineering and Computer Science. “Pillar’s focus on mentorship for our graduate students and postdoctoral researchers, and centering the program within the Deshpande Center, will undoubtedly foster big ideas in AI and create an environment for prospective companies to launch and thrive.”&nbsp;</p>\n\n<p>Founded by Jamie Goldstein ’89, Pillar VC is committed to growing companies and investing in personal and professional development, coaching, and community.</p>\n\n<p>“Many of the most promising companies of the future are living at MIT in the form of transformational research in the fields of data science, AI, and machine learning,” says Goldstein. “We’re honored by the chance to help unlock this potential and catalyze a new generation of founders by surrounding students and postdoctoral researchers with the resources and mentorship they need to move from the lab to industry.”</p>\n\n<p>The program will launch with the 2022-23 academic year. Grants will be open only to MIT faculty and students, with an emphasis on funding for graduate students in their final year, as well as postdocs. Applications must be submitted by MIT employees with principal investigator status. A selection committee composed of three MIT representatives will include Devavrat Shah, faculty director of the Deshpande Center, the Andrew (1956) and Erna Viterbi Professor in the Department of Electrical Engineering and Computer Science and the Institute for Data, Systems, and Society; the chair of the selection committee; and a representative from the MIT Schwarzman College of Computing. The committee will also include representation from Pillar VC. Funding will be provided for up to nine research teams.</p>\n\n<p>“The&nbsp;Deshpande Center will serve as the perfect home for the new collective, given its focus on moving innovative technologies from the lab to the marketplace in the form of breakthrough products and new companies,” adds Chandrakasan.&nbsp;</p>\n\n<p>“The&nbsp;Deshpande Center has a 20-year history of guiding new technologies toward commercialization, where they can have a greater impact,” says Shah. “This new collective will help the center expand its own impact by helping more projects realize their market potential and providing more support to researchers in the fast-growing fields of AI, machine learning, and data science.”</p>",
  "media:content": {
    "media:description": "The MIT-Pillar AI Collective will center on the market discovery process, advancing projects through market research, customer discovery, and prototyping."
  },
  "category": [
    "Deshpande Center",
    "IDSS",
    "Funding",
    "Alumni/ae",
    "Venture capital",
    "Computer science and technology",
    "Artificial intelligence",
    "Machine learning",
    "Design",
    "Data",
    "Research",
    "Innovation and Entrepreneurship (I&E)",
    "Industry",
    "Graduate, postdoctoral",
    "School of Engineering",
    "Electrical Engineering & Computer Science (eecs)",
    "MIT Schwarzman College of Computing"
  ]
}