{
  "title": "Omaha Police Cancel Deal With Far Right-Linked Gun Shop",
  "link": "https://www.splcenter.org/hatewatch/2022/11/04/omaha-police-cancel-deal-far-right-linked-gun-shop",
  "description": "<div class=\"field field-name-field-story-type field-type-list-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Hatewatch</div>\n      </div>\n</div>\n<div class=\"field field-name-field-long-text field-type-text-long field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><p>The Omaha Police Department (OPD) in Nebraska confirmed to Hatewatch it has permanently scrapped a proposed equipment swap with a far right-linked gun shop.</p>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-image field-type-image field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"></div>\n      </div>\n</div>\n<div class=\"field field-name-title-field field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><h1>Omaha Police Cancel Deal With Far Right-Linked Gun Shop</h1>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><p>88 Tactical is a large gun range and store on the outskirts of Omaha where “civilians as well as law enforcement and military personnel” train, according to its website. In 2017, <a href=\"https://www.splcenter.org/hatewatch/2017/09/12/disgraced-ex-fbi-agent-john-guandolo-visit-iowa-and-nebraska-week\"> Hatewatch reported</a> that 88 Tactical and the anti-Muslim Global Faith Institute invited anti-Muslim ex-FBI agent and author John Guandolo to Nebraska. In August, <a href=\"https://www.splcenter.org/hatewatch/2022/08/22/emails-show-omaha-police-planned-deal-far-right-linked-gun-shop\"> Hatewatch reported</a> on the emails surrounding the exchange and local Nebraska activists’ concerns over the deal. They called attention to what they say is the business’s use of far-right imagery. Activists further voiced concerns over an 88 Tactical instructor Devin Crinklaw, who also works as an OPD officer and has espoused anti-Muslim views on social media. Hatewatch reported on those posts in the August article.</p>\n<p>OPD public information officer Lt. Neal Bonacci told Hatewatch OPD has “no plans in entertaining that deal any further.”</p>\n<p>Bonacci also told Hatewatch that Crinklaw is still on the force but was relieved of his position as an instructor for his SWAT team. Crinklaw was previously the primary firearms and tactics trainer for the team. Bonacci said OPD conducted a review of Crinklaw’s social media because of Hatewatch’s reporting. The review contributed to the decision to remove him as an instructor. 88 Tactical did not respond to Hatewatch’s request for comment.</p>\n<p>The swap would have seen OPD give 88 Tactical 28 expired ballistic helmets and 28 expired rifle plates for 120 Coyote AR magazines, 60 Glock 17 magazines and 30 orange Glock magazine base plates. If purchased new, the equipment OPD agreed to give would be valued at around $45,000, while 88 Tactical’s part of the deal was worth around $3,100. The Omaha City Council removed the deal from its agenda in July, but its fate was uncertain, Bonacci told the <em>Omaha World-Herald</em>.</p>\n<p>“It’s great that this particular exchange got canceled,” Melody Vaccaro, executive director of Grassroots nonprofit Nebraskans Against Gun Violence (NAGV), told Hatewatch. NAGV opposed the deal since it appeared on the Omaha City Council’s agenda. Vaccaro said in a July press release the “private market is absolutely the wrong place for military and law enforcement gear” and the gear should be “retired.”</p>\n<p>Though she welcomed the cancellation, the fact that authorities considered the deal “leaves lingering questions about the cozy relationship between radicalized private companies and Omaha police,” Vaccaro said.</p>\n<p>Activists decry the business’s use of “88,” which neo-Nazis use as a code for “Heil Hitler,” the Nazi salute. 88 Tactical also features elevation maps throughout the store with the highest point at 1488 feet. Peak Bagger, a website that tracks elevations, states Omaha’s highest point is around 1,270 feet. “1488” combines “Heil Hitler” and the white nationalist “14 Words,” a saying about securing a future for white children. White nationalist extremist <a href=\"https://www.splcenter.org/fighting-hate/extremist-files/individual/david-lane\"> David Lane</a> coined the saying.</p>\n<p>88 Tactical CEO Shea Degan has repeatedly denied any affiliations with white supremacy and claims the name refers to <a href=\"https://88tactical.com/the-truth-behind-our-name/\"> Nebraska police code</a>. 88 Tactical also <a href=\"https://88tactical.com/88-tactical-city-ventures-announce-future-locations-in-16-cities/\"> said it removed</a> the maps displaying “1488” after it learned its meaning. 88 Tactical has not responded to Hatewatch’s requests about its past collaboration with the Global Faith Institute to invite John Guandolo to Nebraska.</p>\n<p>88 Tactical has plans to expand. The company partnered with City+Ventures, an Omaha-based real estate and investment firm, in 2017. In 2020, The companies announced plans to expand to 16 cities across the United States, from Nevada to Virginia.</p>\n<p>The plan frames the expansion, which will include locations that feature gun ranges, training classes and 24-hour fitness facilities, as a “one-of-a-kind Guntry Club.”</p>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-byline field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Creede Newton</div>\n      </div>\n</div>\n<div class=\"field field-name-field-addthis field-type-addthis field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><div class=\"addthis_toolbox addthis_default_style  \" addthis:title=\"Omaha Police Cancel Deal With Far Right-Linked Gun Shop - Southern Poverty Law Center\" addthis:url=\"https://www.splcenter.org/hatewatch/2022/11/04/omaha-police-cancel-deal-far-right-linked-gun-shop\"><a href=\" \" class=\"addthis_button_facebook\" aria-label=\"Facebook: Share this page\"></a>\n<a href=\" \" class=\"addthis_button_twitter\" aria-label=\"Twitter: Share this page\"></a>\n</div>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-publish-date field-type-date field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><span class=\"date-display-single\">November 04, 2022</span></div>\n      </div>\n</div>",
  "pubDate": "Fri, 04 Nov 2022 14:00:02 +0000",
  "dc:creator": "chris.heller_1541",
  "guid": "17212 at https://www.splcenter.org"
}