{
  "id": "yt:video:pFP5oO-GcBw",
  "yt:videoId": "pFP5oO-GcBw",
  "yt:channelId": "UCs8o1mdWAfefJkdBg632_tg",
  "title": "How To Boost Confidence - Michael Laskin",
  "link": "",
  "author": {
    "name": "Film Courage",
    "uri": "https://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg"
  },
  "published": "2022-10-27T00:00:29+00:00",
  "updated": "2022-10-27T00:00:31+00:00",
  "media:group": {
    "media:title": "How To Boost Confidence - Michael Laskin",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "BUY THE BOOK - THE AUTHENTIC ACTOR: The Art and Business of Being Yourself\nhttps://amzn.to/3ECXbjk\n\nMichael Laskin has been a working professional actor for over 40 years in film, television, and the theatre – from SEINFELD to BIG LITTLE LIES and a great deal in between. He has worked extensively off-Broadway, and at some of America’s leading regional theatres, including The Guthrie Theatre, The Actors Theatre of Louisville, The Geffen Playhouse, The Seattle Repertory Theatre, and The Mixed Blood Theatre Company.\n\nAdditionally, he was awarded a Fringe First Award at The Edinburgh Festival for playing “Richard Nixon” in TEA WITH DICK AND GERRY, which went on to a successful run at London’s Roundhouse Theatre. Michael also starred in the Canadian premier of the Pulitzer Prize winning drama “Talley’s Folly” and his most recent stage work was the American premiere of the one-person play, ALTMAN’S LAST STAND in Los Angeles. A recipient of a Bush Fellowship with The Guthrie Theatre, he was also awarded a Distinguished Alumnus Award from The University of Minnesota’s College of Liberal Arts.\n\nA graduate of Northwestern University’s theatre department where he received his bachelor’s degree, Michael also has a masters degree in theatre management from The University of Minnesota. Additionally he’s taught acting at USC, UCLA, Queen’s College-Cambridge (UK), The Actors Centre (London), Art Center College of Design, Kennesaw University, the University of Minnesota, the Hawaii International Film Festival, and South Coast Repertory Co.\n\nHe’s had the privilege of working with some of the great artists in film and theatre, including Barry Levinson, Stephen Frears, Walter Matthau, John Sayles, Paul Mazursky, Bob Rafelson, Michael Langham, Robert Duvall, Roy Dotrice, and many others.\n\nMORE VIDEOS WITH MICHAEL LASKIN\nhttps://bit.ly/3TF5v73\n\nCONNECT WITH MICHAEL LASKIN\nhttps://www.michaellaskinstudio.com\nhttps://www.imdb.com/name/nm0489644\nhttps://www.instagram.com/michaellaskinstudio\nhttps://twitter.com/michaellaskin\n\nMORE MICHAEL WIESE PRODUCTIONS AUTHORS\nhttps://mwp.com\n\nRELATED VIDEOS\nTalent Cannot Be Taught - https://youtu.be/Gul7DxhOyHk\nLack Of Confidence Stopped Me From Writing A Novel - https://youtu.be/-VolWim5764\nConfidence To Be A Hollywood Screenwriter - https://youtu.be/7dqUviTHlW0\nHow A Filmmaker Can Overcome Fear And Build Confidence - https://youtu.be/D2uyO42c_cg\nConfidence To Write The First Screenplay - https://youtu.be/s288qsRosBA\n\n(Affiliates)\n►WE USE THIS CAMERA (B&H) – https://buff.ly/3rWqrra\n►WE USE THIS EDITING PROGRAM (ADOBE) – https://goo.gl/56LnpM\n►WE USE THIS SOUND RECORDER (AMAZON) – http://amzn.to/2tbFlM9\n►WRITERS, TRY FINAL DRAFT FREE FOR 30-DAYS! (FINAL DRAFT) - http://ow.ly/Gz4w30rDSKt\n\nBOOKS WE RECOMMEND\nhttps://buff.ly/3o0oE5o\n\nSUPPORT FILM COURAGE BY BECOMING A MEMBER\nhttps://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg/join\n\nCONNECT WITH FILM COURAGE\nhttp://www.FilmCourage.com\nhttp://twitter.com/#!/FilmCourage\nhttps://www.facebook.com/filmcourage\nhttps://www.instagram.com/filmcourage\nhttp://filmcourage.tumblr.com\nhttp://pinterest.com/filmcourage\n\nSUBSCRIBE TO THE FILM COURAGE YOUTUBE CHANNEL\nhttp://bit.ly/18DPN37\n\nLISTEN TO THE FILM COURAGE PODCAST\nhttps://soundcloud.com/filmcourage-com\n\nStuff we use:\n\nLENS - Most people ask us what camera we use, no one ever asks about the lens which filmmakers always tell us is more important.  This lens was a big investment for us and one we wish we could have made sooner.  Started using this lens at the end of 2013 - http://amzn.to/2tbtmOq\n\nAUDIO \n\nRode VideoMic Pro  - The Rode mic helps us capture our backup audio.  It also helps us sync up our audio in post http://amzn.to/2t1n2hx\n\nAudio Recorder - If we had to do it all over again, this is probably the first item we would have bought - http://amzn.to/2tbFlM9\n\nLIGHTS - Although we like to use as much natural light as we can, we often enhance the lighting with this small portable light.  We have two of them and they have saved us a number of times - http://amzn.to/2u5UnHv\n\nCOMPUTER - Our favorite computer, we each have one and have used various models since 2010 - http://amzn.to/2t1M67Z\n\nEDITING - We upgraded our editing suite this year and we’re glad we did!  This has improved our workflow and the quality of our work.  Having new software also helps when we have a problem, it’s easy to search and find a solution - https://goo.gl/56LnpM\n\n*These are affiliate links, by using them you can help support this channel.\n\n#acting #actor #talent",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}