{
  "title": "DataRobot Announces Launch of Dedicated Managed AI Cloud",
  "link": "https://www.datarobot.com/newsroom/press/datarobot-announces-launch-of-dedicated-managed-ai-cloud/",
  "dc:creator": "Stephanie Rogers",
  "pubDate": "Wed, 28 Sep 2022 13:00:00 +0000",
  "category": "Press Releases",
  "guid": "https://www.datarobot.com/?p=40489",
  "description": "<p>New offering accelerates the delivery of AI to production with a dedicated deployment of DataRobot AI Cloud managed by DataRobot experts September 28, 2022 — BOSTON — Today, DataRobot announced the public availability of DataRobot Dedicated Managed AI Cloud, a dedicated hosted version of AI Cloud managed by DataRobot experts. Dedicated Managed AI Cloud provides...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.datarobot.com/newsroom/press/datarobot-announces-launch-of-dedicated-managed-ai-cloud/\"><strong>DataRobot Announces Launch of Dedicated Managed AI Cloud</strong></a> appeared first on <a rel=\"nofollow\" href=\"https://www.datarobot.com\">DataRobot AI Cloud</a>.</p>\n",
  "content:encoded": "\n<p><em>New offering accelerates the delivery of AI to production with a dedicated deployment of DataRobot AI Cloud managed by DataRobot experts</em></p>\n\n\n\n<p><strong>September 28, 2022 — BOSTON </strong>— Today, <a href=\"https://www.datarobot.com\">DataRobot</a> announced the public availability of <a href=\"https://www.datarobot.com/platform/dedicated-managed-cloud\">DataRobot Dedicated Managed AI Cloud</a>, a dedicated hosted version of AI Cloud managed by DataRobot experts. Dedicated Managed AI Cloud provides the latest DataRobot capabilities to support critical AI and machine learning projects with the advantage of public cloud services, reducing cost and time-to-value in deploying, upgrading and managing the AI infrastructure.&nbsp;</p>\n\n\n\n<p>Today’s organizations rely on enterprise AI/ML platforms to deliver critical business initiatives. Organizations may prefer to outsource software platform deployment, configuration as well as ongoing management and maintenance to accommodate staffing constraints.</p>\n\n\n\n<p>“According to a recent <a href=\"https://omdia.tech.informa.com/OM021040/IT-Drivers-and-Technology-Priorities--IT-Enterprise-Insights-2022\" rel=\"noindex nofollow noopener\"  target=\"_blank\">Omdia study</a> of more than 400 global AI practitioners, the AI marketplace has reached a critical point of acceleration with more than 25% of companies now looking to scale AI across multiple business units. This represents a dramatic rise from earlier research favoring departmental deployments,” said Bradley Shimmin, Chief Analyst for AI platforms, analytics, and data management, Omdia. “It also foreshadows a substantial uptick in management costs, maintenance complexities, and exposure to risk for many companies electing to continue managing their own infrastructure.”</p>\n\n\n\n<p>DataRobot Dedicated Managed AI Cloud builds on a decade of experience driving business-critical AI/ML projects for hundreds of customers across on-premises, virtual private cloud, public cloud, and in DataRobot multi-tenant SaaS deployments. This new offering extends the full functionality of the AI Cloud to provide a dedicated managed instance of the DataRobot platform running for each customer in the cloud.&nbsp;</p>\n\n\n\n<p>The newly announced offering saves time and resources by freeing team members from managing or maintaining platform updates, while providing the security, isolation and data residency requirements for each customer. Dedicated Managed AI Cloud is deployed for each customer in a dedicated and separate VPC and operated, monitored, and maintained by DataRobot experts.&nbsp;</p>\n\n\n\n<p>“We’re excited for business leaders to realize the value of DataRobot with this managed offering, which brings together two distinct and significant advantages,” says Venky Veeraraghavan, SVP, Product, DataRobot. “Customers can focus on driving business results with DataRobot managing the operational elements, while still maintaining their specific security requirements and taking advantage of the cloud&#8217;s evergreen deployment and new features.”</p>\n\n\n\n<p>Contact your DataRobot Sales representative to get started with DataRobot Dedicated Managed AI Cloud or get in touch via <a href=\"https://www.datarobot.com/contact-us/\">www.datarobot.com</a>.</p>\n\n\n\n<p><strong>About DataRobot </strong></p>\n\n\n\n<p>DataRobot AI Cloud is the next generation of AI. DataRobot’s AI Cloud vision is to bring together all data types, all users, and all environments to deliver critical business insights for every organization. DataRobot is trusted by global customers across industries and verticals, including a third of the Fortune 50. For more information, visit <a href=\"https://www.datarobot.com/\">https://www.datarobot.com/</a>.&nbsp;&nbsp;</p>\n\n\n\n<p class=\"has-text-align-center\">###</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.datarobot.com/newsroom/press/datarobot-announces-launch-of-dedicated-managed-ai-cloud/\"><strong>DataRobot Announces Launch of Dedicated Managed AI Cloud</strong></a> appeared first on <a rel=\"nofollow\" href=\"https://www.datarobot.com\">DataRobot AI Cloud</a>.</p>\n",
  "media:content": ""
}