{
  "title": "Tunisia Tramples Gender Parity Ahead of Parliamentary Elections",
  "link": "https://www.hrw.org/news/2022/11/02/tunisia-tramples-gender-parity-ahead-parliamentary-elections",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        A Tunisian woman holds up a placard that reads in Arabic: “We are full citizens, not a decoration for sponsorships,” during a demonstration in Tunis, Tunisia on October 7, 2022.\n                    © 2022 Chedly Ben Ibrahim/AP Photo\n          \n\n  \n<p>A new electoral law introduced by Tunisian President Kais Saied on September 15 eliminated the principle of gender parity in elected assemblies, and could, in turn, result in Tunisia’s parliament being led almost exclusively by men. The country’s next parliamentary elections are set to take place on December 17.</p>\n\n<p>The new law strips gender parity provisions from a previous electoral law that strove to ensure equal representation between men and women in Tunisia’s elected assemblies, although Tunisia’s new constitution explicitly upholds this principle.</p>\n\n<p>Ensuring gender parity in elected assemblies was one of the major accomplishments for women’s rights following Tunisia’s 2011 revolution. After the principle was first enshrined in the 2014 Constitution, the country’s 2014 electoral law required candidate lists to alternate their members between men and women. This led to the election of 68 female parliamentarians in 2014, representing 31 percent of the Assembly of Representatives of the People (ARP). That year, Tunisia had the highest female representation in parliament compared to other countries in the Middle East and North Africa region.</p>\n\n<p>In 2017, an amendment to the electoral law further required political parties and coalitions to ensure half of their candidate lists were led by women in local elections. This led to 47 percent of city councils being made up of women after the 2018 elections. The new electoral law, however, replaces the previous proportional representation system by a single-member constituency system without providing provisions aimed at equal gender representation.</p>\n\n<p>Under the new electoral law, potential candidates need to submit 400 signatures of registered voters from their constituencies to run for office. Candidates also cannot finance their campaigns through public funding and must rely instead on their own means or private funding.</p>\n\n<p>These requirements especially disempower women who are less likely to have the same powerful local networks to sponsor their candidacy as men and the same financial means as their male counterparts. Together this is likely to contribute to their political exclusion. Ahead of the December elections, Tunisia’s electoral commission received 1,427 applications from individuals wishing to run for a parliamentary seat, only 214 of which were from female candidates. </p>\n\n<p>The Tunisian parliament was once the exemplar of gender equity in the region. With these new changes to the law, that could soon be history.</p>",
  "pubDate": "Wed, 02 Nov 2022 12:03:37 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/02/tunisia-tramples-gender-parity-ahead-parliamentary-elections"
}