{
  "id": "https://bibleinoneyear.org/en/youth/39",
  "title": "Day 39: How to Live in a Hostile Environment",
  "description": "Psalm 19:1-2, Exodus 3:10–14, Matthew 26:1–28. Perhaps you are facing hostility in your workplace or even in your family because of your faith  The passages today not only highlight the reality of living in a hostile environment, but they also point out how you can survive and thrive in the midst of such hostility",
  "pubDate": "Mon, 08 Feb 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/39/?ignore",
  "itunes:duration": "14:10",
  "guid": "enyouth08022021-39",
  "length": 850.44,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 39: How to Live in a Hostile Environment",
  "itunes:subtitle": "Psalm 19:1-2, Exodus 3:10–14, Matthew 26:1–28. Perhaps you are facing hostility in your workplace or even in your family because of your faith  The passages today not only highlight the reality of living in a hostile environment, but they also point out how you can survive and thrive in the midst of such hostility",
  "itunes:summary": "Hundreds of thousands of Christians are among those who have fled Iraq and Syria in the midst of Islamic extremism and conflict. Christians face the threat of systematic torture and mass executions. Isis has declared Christianity as the number one enemy.\nMillions of Christians live in countries where they are persecuted for their faith. Many governments try to control the growth of the church. Even in traditionally Christian countries, sometimes there is hostility towards vibrant Christianity. Hostility to the people of God is not something new. People are often threatened by success, growth and large numbers.\nPerhaps you are facing hostility in your workplace or even in your family because of your faith. The passages today not only highlight the reality of living in a hostile environment, but they also point out how you can survive and thrive in the midst of such hostility.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 39
}