{
  "id": "tag:blogger.com,1999:blog-2957813557601703695.post-6621177847233759683",
  "published": "2022-10-14T16:16:00.003+05:00",
  "updated": "2022-10-14T16:16:49.375+05:00",
  "category": [
    "",
    ""
  ],
  "title": "PTCL Group’s Strong Financial Performance: 8% YoY Revenue Growth in 2022",
  "content": "<p>PTCL Group, the country’s leading telecom and ICT services provider, has announced its financial results for the nine months ended September 30, 2022, at its Board of Directors’ meeting held in UAE on October 13, 2022.&nbsp;&nbsp;</p><p>PTCL Group remained on the growth trajectory during the third quarter as its fixed and wireless streams continued to perform positively.&nbsp;&nbsp;</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhowY2i6IfSbEopjfOvO2MPC6Rhi0MXEiC87Dh2nmmO98x9Aka0zWwSZ8muHsCYyPIcwi3deyVpIZidgIKOXsPneSoHaCYj6Cf2EAPlUa7HtU1iOeXVaMssW3N-Pizy_2JigPLi3Wv0BxhAe7QQNJck5knHOMejO1xP2rFkBN27NQ9WGhMuQBAOpFVwhQ/s1005/PTCL%20Logo.jpeg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" data-original-height=\"1005\" data-original-width=\"1005\" height=\"320\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhowY2i6IfSbEopjfOvO2MPC6Rhi0MXEiC87Dh2nmmO98x9Aka0zWwSZ8muHsCYyPIcwi3deyVpIZidgIKOXsPneSoHaCYj6Cf2EAPlUa7HtU1iOeXVaMssW3N-Pizy_2JigPLi3Wv0BxhAe7QQNJck5knHOMejO1xP2rFkBN27NQ9WGhMuQBAOpFVwhQ/s320/PTCL%20Logo.jpeg\" width=\"320\" /></a></div><p>PTCL Group Financial Performance&nbsp;</p><p>•<span style=\"white-space: pre;\">\t</span>Revenue has increased by 8% to PKR 110.5 billion YoY, mainly driven by strong performance in the consumer segment led by fixed broadband, mobile data, and wholesale &amp; business solutions, along with microfinance services.&nbsp;</p><p>•<span style=\"white-space: pre;\">\t</span>The Group’s profitability remained under pressure due to significant hike in power and fuel tariffs, devaluation of the Pak Rupee against USD, higher interest rates, and other costs associated with the acquisition of 4G spectrum and related network rollout. The Group has posted a net loss of Rs 5.6 billion.</p><p>•<span style=\"white-space: pre;\">\t</span>PTCL continued its growth momentum by posting 6.7% YoY revenue growth.</p><p>•<span style=\"white-space: pre;\">\t</span>PTML’s (Ufone) revenue grew by 5.4% as compared to the same period of last year.&nbsp;</p><p>•<span style=\"white-space: pre;\">\t</span>U Bank has achieved a 29.8% growth in its revenue over the same period of last year.&nbsp;&nbsp;</p><p><br /></p><p>PTCL Financial Performance&nbsp;&nbsp;</p><p>•<span style=\"white-space: pre;\">\t</span>PTCL’s revenue of Rs 61.1 billion for the period is 6.7% higher than 2021, mainly driven by growth in broadband and wholesale &amp; business solutions segments.</p><p>•<span style=\"white-space: pre;\">\t</span>The company has posted an operating profit of Rs 3.2 billion, which remained under pressure compared to last year mainly due to increase in operating costs on account of significant hike in power and fuel tariffs.&nbsp;</p><p>•<span style=\"white-space: pre;\">\t</span>Net Profit of Rs 8.2 billion for the period is 45.2% higher as compared to the same period of last year. Increase in non-operating income, due to translation gain on the Company’s forex denominated assets, dividend income from a subsidiary and gain on disposal of obsolete assets due to upgrade and fiberization of network, has helped turn the 12.4% decrease at operating profit level to a 45.2% increase at the net profit level.&nbsp;</p><p><br /></p><p>PTCL Consumer Business&nbsp;</p><p><br /></p><p>During the first 3 quarters, the company’s fixed broadband business grew by 11.7% YoY. Within the broadband business, revenues from Flash Fiber, the company's premium FTTH service, showed significant growth of 98.7%. IPTV also showed 8.6% growth YoY. Voice revenue stream has seen a decline due to lower voice traffic and continued conversion of customers to OTT services.</p><p><br /></p><p>PTCL continues to perform consistently with enhanced customer experience through the company’s seamless fixed broadband, including the fastest internet service in Pakistan through the Flash Fiber brand. PTCL has expanded its FTTH services in 35 cities, and the subscriber base has doubled on a YoY basis as the company continues to tap into the demand for growing internet and data services.&nbsp;</p><p>PTCL Business Solutions</p><p>While continuing momentum with overall YoY revenue growth of 8.8%, the business solutions segment sustained its market leadership in IP bandwidth, Cloud, Data Center, and other ICT services. PTCL’s corporate business grew by 13.0% as compared to last year. Within the wholesale business segment, carrier revenue grew by 16.2% but the overall wholesale segment revenue has declined as a result of closure of certain international IP leased circuits. International revenue, helped by the favorable impact of currency devaluation, has increased by 13.9% over last year.&nbsp;</p><p><br /></p><p>PTML (Ufone) Financial Performance&nbsp;</p><p>•<span style=\"white-space: pre;\">\t</span>PTML’s (Ufone) revenue grew by 5.4% as compared to the same period of last year.&nbsp;</p><p>•<span style=\"white-space: pre;\">\t</span>Data remains the main driver of growth for Ufone through continued investment to expand 4G coverage and conversion of customer base to 4G. As a result, Ufone achieved 3.5 million 4G net adds this year.</p><p>•<span style=\"white-space: pre;\">\t</span>Ufone has posted topline growth despite the challenges of increase in Advance Income Tax (AIT) and reduction in Mobile Termination Rates (MTR) and recent floods in the country.&nbsp;</p><p>•<span style=\"white-space: pre;\">\t</span>External factors like the devaluation of Pak Rupee, rising interest rates and hike in power / fuel tariffs have adversely impacted Ufone’s bottom-line.</p><p>•<span style=\"white-space: pre;\">\t</span>During the second quarter, VIS Credit Rating Company has assigned initial entity ratings of ‘AA-/A-1’ (Double A Minus/A-One) to Ufone with outlook on the assigned ratings as ‘Stable’. This acknowledges the financial strength of Ufone through an independent rating exercise which also denotes high credit quality and good fundamental protection factors and is a testimony of stakeholders’ confidence in Ufone.</p><p><br /></p><p>U Bank Highlights&nbsp;</p><p>UBank, the microfinance and branchless banking subsidiary of PTCL, continued its growth trajectory and achieved 29.8% growth in its revenue over last year by deepening its advances and investment portfolio, despite the challenging macro-economic situation, further exacerbated by the recent flood. The balance sheet footing of the bank reached Rs 122 billion as the bank continued to diversify its asset classes and funding streams while ensuring positive bottom-line impact. As the six business canvases of the bank, namely: Rural Retail Banking, Corporate Finance &amp; Investment Banking, Islamic Banking, Urban Retail Banking, Corporate Banking and Digital Banking take their distinct forms and structures, this year will witness Ubank emerging as a Retail Challenger Bank aiming to extend banking services in accordance with the unique needs of its diverse and heterogenous clientele. With the core mission of microfinance at its heart, the business model of the bank is evolving to capture new segments and customer classes to include more of Pakistan into the banking net and further its ambition of financial and social inclusion.</p><p><br /></p><p>Corporate Social Responsibility</p><p>Being a national carrier and a Pakistani company, PTCL Group during the recent floods has contributed significantly towards the relief and rehabilitation of flood-affected communities across Pakistan. PTCL Group has taken multiple initiatives including donation to PM’s Flood Relief Fund, collaboration with NGOs, PTCL opening the doors of its medical centers nationwide to provide emergency health and care to the affected communities and Ufone 4G offering free calls to help people stay in touch with their friends and family. Ends&nbsp;</p><div><br /></div><div class=\"blogger-post-footer\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js\"></script>\n<!-- MobileAds -->\n<ins class=\"adsbygoogle\"\n     style=\"display:inline-block;width:320px;height:50px\"\n     data-ad-client=\"ca-pub-2762820915666464\"\n     data-ad-slot=\"9814557735\"></ins>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Admin",
    "uri": "https://www.blogger.com/profile/00179371387546033311",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}