{
  "title": "Some Other Explanations for Why Public Bathrooms Are the Way They Are",
  "link": "https://freakonomics.com/2014/12/some-other-explanations-for-why-public-bathrooms-are-the-way-they-are/",
  "dc:creator": "Stephen J. Dubner",
  "pubDate": "Tue, 30 Dec 2014 17:57:51 +0000",
  "category": "Freakonomics Blog",
  "guid": "http://freakonomics.com/?p=109449",
  "description": "<p>From a podcast listener named Katie McGreer, some really interesting comment on our recent episode &#8220;Time to Take Back the Toilet&#8220;: I am an avid listener of the Freakonomics podcast and I just wanted to respond to the recent episode on noise in public washrooms (or the lack of buffers).  I was having a discussion about the history of cottaging . . .</p>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2014/12/some-other-explanations-for-why-public-bathrooms-are-the-way-they-are/\">Some Other Explanations for Why Public Bathrooms Are the Way They Are</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n",
  "content:encoded": "<p>From a podcast listener named <strong>Katie McGreer</strong>, some really interesting comment on our recent episode &#8220;<a href=\"https://freakonomics.com/2014/12/18/time-to-take-back-the-toilet-a-new-freakonomics-radio-podcast/\">Time to Take Back the Toilet</a>&#8220;:</p>\n<blockquote><p>I am an avid listener of the Freakonomics podcast and I just wanted to respond to the recent episode on noise in public washrooms (or the lack of buffers).  I was having a discussion about the history of cottaging in the UK (and of cruising in America).  I learned that the UK had really harsh penalties against homosexuality for most of the 20th century and so for gay people, toilets were chosen as a meeting place. Still today, sex in public restrooms is not uncommon between strangers (or friends or whatever).  I also learned about the way police forces have cracked down on homosexuality by targeting activity in public washrooms. My brother suggested that modern bathroom design has evolved, in part, to allow police to enter washrooms quietly and sneak up on people who are using public toilet spaces for different (sometimes elicit) purposes. I started to think of other ways public toilets are used.  People commonly go into stalls to do drugs. And the use of toilets is not just for illegal activity but also for activities that are frowned upon in public. In Korea, for instance, there are ashtrays in the bathroom stalls and women frequently sneak off for a smoke &#8212; away from public view &#8212; since it is taboo for &#8220;ladies&#8221; to be seen smoking. In this way, public toilets are a bit of a refuge, a private place in a public space. But, clearly, they can also be dangerous.  It is interesting to think that the design of bathroom stalls and of doorways could be part and parcel of a larger safety or crackdown agenda. In Edmonton, my hometown, some public washrooms on busy streets are made of glass walls (the stalls are still made of metal but you can see people&#8217;s feet). This kind of transparency, they say, is a measure taken to prevent rape.  In a way, I can see the strategic value of keeping public washrooms quiet as well: you can hear more, and even if you do not deter certain behaviours, you can more easily &#8220;catch them.&#8221;</p></blockquote>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2014/12/some-other-explanations-for-why-public-bathrooms-are-the-way-they-are/\">Some Other Explanations for Why Public Bathrooms Are the Way They Are</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n"
}