{
  "title": "Fitful Ukrainian Nuclear Plant Stokes Powerful Fears",
  "link": "https://spectrum.ieee.org/ukraine-nuclear-power-plant-fears",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-power-plant-seen-in-the-distance-with-road-signs-in-the-foreground.jpg?id=31252865&width=1200&height=800&coordinates=0%2C162%2C0%2C162\"/><br/><br/><p>For several weeks now shelling from, on, and around the Zaporizhzhia nuclear power station has emboldened nuclear safety experts in Ukraine to openly advocate for a controlled shutdown of the beleaguered plant. <a href=\"https://spectrum.ieee.org/nuclear-energy-brinkmanship-in-ukraine\" target=\"_self\">As <em>IEEE Spectrum</em> reported last week</a>, they argue that proactively stopping power generation at the two units still operating, and cooling their reactors, would reduce the likelihood of a nuclear disaster—one that Ukrainian state experts say could be more devastating than the Chernobyl and Fukushima accidents.</p><p>Yesterday disruption of a crucial transmission line forced a total shutdown in a dangerous series of events that once again spotlighted Zaporizhzhia’s precarious situation.</p><p>For the second time this month, backup diesel generators and other automatic emergency systems had to kick in. This time they completely disconnected Europe’s largest nuclear power plant from Ukraine’s grid for the first time since it began operating in 1985.</p><p class=\"pull-quote\">Radioactive coal ash piles near the nuclear power plant were shelled on Tuesday. Monitors picked up rising radiation levels as the ash spread. By Thursday morning, the ash piles were also on fire.  </p><p>In <a href=\"https://apnews.com/article/russia-ukraine-kyiv-united-nations-climate-and-environment-c4b57d9b04e43d35747148b230eed187\" target=\"_blank\">his nightly address yesterday</a> Ukrainian president Volodymir Zelenskyy credited Zaporizhzhia’s diesel generators and its Ukrainian staff for avoiding a “radiation” incident. “Russia has put Ukraine and all Europeans one step away from a radiation disaster,” said Zelenskyy.</p><p>International Atomic Energy Agency director general Rafael Grossi pressed for an IAEA mission to Zaporizhzhia “in the next few days” to bring stability to the situation. “Almost every day there is a new incident at or near the Zaporizhzhia Nuclear Power Plant. We can’t afford to lose any more time,” said Grossi in <a href=\"https://www.iaea.org/newscenter/pressreleases/update-94-iaea-director-general-statement-on-situation-in-ukraine\" target=\"_blank\">an IAEA statement issued yesterday</a>.</p><p>Today, rather than leave the plant off-line, however, Ukrainian staff at the Russian-occupied plant <a href=\"https://t.me/energoatom_ua/9208\" target=\"_blank\">restarted one of the plant’s six units</a> after transmission repairs strengthened the plant’s external power supply.</p><p>Energoatom, Ukraine’s nuclear power utility, celebrated the restart in patriotic terms: “Zaporizhzhia NPP nuclear power professionals are real heroes! They tirelessly and tightly hold the nuclear and radiation safety of Ukraine and the whole of Europe on their shoulders, and they’re working selflessly to get their home country to have life-giving electricity.”</p><p>The roots of yesterday’s near-miss go back to the shelling on Tuesday of coal ash piles near the Zaporizhzhia nuclear plant, which Russia seized in March and sits just across the Dnipro River from Ukrainian-held territory. Ukrainian military intelligence reported that <a href=\"https://gordonua.com/news/war/okkupanty-obstrelivayut-sklady-s-zoloy-zaporozhskoy-tes-chtoby-podnyat-oblaka-radioaktivnoy-pyli-gur-1622832.html\" target=\"_blank\">Russia was shelling the piles to incite fear</a> because the ash is “at least 2.5 times” more radioactive than background levels, and laced with heavy metals and other toxins.</p><p>Russian occupation authorities <a href=\"https://apnews.com/article/russia-ukraine-kyiv-united-nations-climate-and-environment-c4b57d9b04e43d35747148b230eed187\" target=\"_blank\">blamed Ukraine</a> for the shelling.</p><p>Regardless, monitors picked up rising radiation levels in the area on Tuesday as the ash spread. By Thursday morning the ash piles were also on fire, including underneath the giant transmission line to Dniprovska that was delivering Zaporizhzhia’s generation to Ukraine’s grid—the last of four such 750-kilovolt lines from the station still operating after six months of war.</p><p>A forest fire was also burning nearby in Energodar, the city where most Zaporizhzhia plant workers live.</p><blockquote class=\"rm-embed twitter-tweet\" data-partner=\"rebelmouse\" data-twitter-tweet-id=\"1560370933566771201\">\n<div style=\"margin:1em 0\">\\u201cthis is how a map of radiation spread will look like if there is an accident on Zaporizhzhia Nuclear Power Plant. \\n\\nsource: Ukrainian Hydrometeorological Institute\\n\\nPS Zaporizzhia NPP is the biggest in Europe. Now occupied by Russians who are using it as a military facility\\u201d</div> — UkraineWorld (@UkraineWorld)\n        <a href=\"https://twitter.com/ukraine_world/statuses/1560370933566771201\">1660856395</a>\n</blockquote>\n<script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script><p>At 12:12 pm Kyiv time yesterday, <a href=\"https://t.me/snriugovua/486\" target=\"_blank\">according to Ukraine’s nuclear regulator</a>, the 750-kV transmission line went offline due to the fire below. An emergency protection scheme, triggered by a sudden voltage drop at Zaporizhzhia’s unit 5, prompted its backup generators and coolant pumps to start up. Unit 6, in contrast, revved down to a reduced generating mode that enabled it to power its own safety systems.</p><p>But both units—and the rest of the plant—still had a backup source of grid power on standby via a 330-kV transmission line to an adjacent 330-kV substation. That means diesel generators were not the plant’s only means of cooling Zaporizhzhia’s reactor cores and spent fuel pools.</p><p>After the 750-kV line to Dniprovska returned to operation at 12:29 pm, unit 6 returned to generating power for Ukraine’s grid for almost 2 hours until fire once again shut off the line. This time the diesel generators activated at unit 6.</p><p>The 750-kV line was restored later in the day. But the plant continued to draw power from its 330-kV grid connection overnight.</p><p><br/></p><div class=\"rm-embed embed-media\"><script async=\"\" data-telegram-post=\"energoatom_ua/9204\" data-width=\"100%\" src=\"https://telegram.org/js/telegram-widget.js?19\"></script></div><p class=\"caption\"><strong>The above Telegram post from the Ukrainian Energoatom agency shows fires that prompted a complete shutdown of the Zaporizhzhia nuclear plant.</strong> </p><p>When one reactor restarted at 2:04 pm Kyiv time today, it did so via two power lines according to <a href=\"https://t.me/Ukrenergo/1383\" target=\"_blank\">a Telegram post by Ukrainian grid operator Ukrenergo</a>: “The operation of two trunk lines damaged by [Russian forces] was restored….Thanks to this, stable energy supply and safe functioning of spent nuclear fuel storage facilities and other important facilities located at the ZNPP site are currently ensured.”</p><p>Later in the day Energoatom <a href=\"https://t.me/energoatom_ua/9214\" target=\"_blank\">announced</a> the restart of the second unit that had been shut down the day before. </p><p>Experts in the United States continue to back a total shutdown. “I would put a priority on reducing the temperature of the fuel rods [to reduce risk],” said Thomas Cochran, the longtime former nuclear energy safety and nuclear proliferation expert for the Natural Resources Defense Council. “There is more safety margin against power failures after the reactors have cooled down for a while,” agreed Ed Lyman, director of nuclear power safety at the Union of Concerned Scientists.</p><p>Nuclear experts in Ukraine advocating shutdown, such as Viktor Shenderovych, formerly chief of nuclear plant design at Ukraine’s National Research and Development Center for Nuclear Power and Energy, did score one win for their position recently. On August 19, Ukraine’s nuclear regulator amended Zaporizhzhia’s license to operate, ordering Energoatom to <a href=\"https://ua.interfax.com.ua/news/general/853200.html\" target=\"_blank\">maintain the ‘cold stop’ status of Zaporizhzhia units 1 and 2</a>, where Russian military vehicles <a href=\"https://www.dailymail.co.uk/news/article-11126467/Russia-tells-staff-Zaporizhzhia-nuclear-power-plant-not-come-work.html\" target=\"_blank\">appear to be parked in the turbine halls</a>.</p><p>Zelenskyy stated yesterday that the IAEA and “other international organizations” need to act faster. However, hurdles still complicate Grossi’s plans to lead a mission to Zaporizhzhia. One is Ukraine’s concern about the many Russian experts within the IAEA. In <a href=\"https://www.ft.com/content/a99752be-c959-47a5-9b35-b10f576094f4\" target=\"_blank\">an interview with the <em>Financial Times</em> published on Wednesday</a>, Ukrainian energy minister and former Energoatom vice president German Galushchenko expressed his hope that IAEA nuclear experts “from any country [but] not Russians” could soon be dispatched to the embattled plant. </p>",
  "pubDate": "Fri, 26 Aug 2022 18:34:34 +0000",
  "guid": "https://spectrum.ieee.org/ukraine-nuclear-power-plant-fears",
  "category": [
    "Ukraine conflict",
    "Ukraine",
    "Russia",
    "Nuclear power",
    "Nuclear safety"
  ],
  "dc:creator": "Peter Fairley",
  "media:content": ""
}