{
  "title": "Skinny Pandas Riding on a Rocket at PyDataGlobal 2020",
  "link": "https://ianozsvald.com/2020/11/30/skinny-pandas-riding-on-a-rocket-at-pydataglobal-2020/",
  "dc:creator": "Ian",
  "pubDate": "Mon, 30 Nov 2020 19:25:02 +0000",
  "category": [
    "Data science",
    "pydata",
    "Python"
  ],
  "guid": "https://ianozsvald.com/?p=3904",
  "description": "On November 11th we saw the most ambitious ever PyData conference &#8211; PyData Global 2020 was a combination of world-wide PyData groups putting on a huge event to both build our international community and to leverage the on-line only conferences that we need to run during Covid 19. The conference brought together almost 2,000 attendees [&#8230;]",
  "content:encoded": "<p>On November 11th we saw the most ambitious ever PyData conference &#8211; <a href=\"https://global.pydata.org/\">PyData Global 2020</a> was a combination of world-wide PyData groups putting on a huge event to both build our international community and to leverage the on-line only conferences that we need to run during Covid 19.</p>\n<p>The conference brought together almost 2,000 attendees from <a href=\"https://twitter.com/John_Sandall/status/1328890209048662023\">65 countries</a> with 165 speakers over 5 days on a <a href=\"https://global.pydata.org/pages/schedule\">5-track schedule</a>. All speaker videos had to be uploaded in advance so they could be checked and then provided ahead-of-time to attendees. You can see the <a href=\"https://global.pydata.org/pages/program\">full program</a> here, the topic list was very solid since the selection committee had the best of the international community uploading their proposals.</p>\n<p>The volunteer organising committee felt that giving attendees a chance to watch all the speakers at their leisure took away constraints of time zones &#8211; but we wanted to avoid the common end result of &#8220;watching a webinar&#8221; that has plagued many other conferences this year. Our solution included timed (and repeated) &#8220;watch parties&#8221; so you could gather to watch the video simultaneously with others, and then share discussion in chat rooms. The volunteer organising committee also worked hard to build a &#8220;virtual 2D world&#8221; with <a href=\"https://www.gather.town/\">Gather.town</a> &#8211; you walk around a virtual conference space (including the speakers&#8217; rooms, an expo hall, parks, a bar, a helpdesk and more). Volunteer Jesper Dramsch made a <a href=\"https://www.youtube.com/watch?v=vbmqFuZLxTM&t=3s\">very cool virtual tour</a> of &#8220;how you can attend PyData Global&#8221; which has a great demo of how Gather works &#8211; it is worth a quick watch. Other conferences should take note.</p>\n<p>Through Gather you could &#8220;attend&#8221; the keynote and speaker rooms during a watch-party and actually <em>see other attendees</em> around you, you could talk to them and you could watch the video being played. You genuinely got a sense that you were attending an event with others, that&#8217;s the first time I&#8217;ve really felt that in 2020 and I&#8217;ve presented at 7 events this year prior to PyDataGlobal (and frankly some of those other events felt pretty lonely &#8211; presenting to a blank screen and getting no feedback&#8230;that&#8217;s not very fulfilling!).</p>\n<p>I spoke on &#8220;<a href=\"https://speakerdeck.com/ianozsvald/skinny-pandas-riding-on-a-rocket-pydataglobal-2020\">Skinny Pandas Riding on a Rocket</a>&#8221; &#8211; a culmination of ideas covered in earlier talks with a focus on <em>getting more into Pandas</em> so you don&#8217;t have to learn new technologies and <em>see Vaex, Dask and SQLite in action</em> if you do need to scale up your Pythonic data science.</p>\n<p>I also organised another &#8220;Executives at PyData&#8221; session aimed at getting decision makers and team leaders into a (virtual) room for an hour to discuss pressing issues. Given 6 iterations of my &#8220;Successful Data Science Projects&#8221; training course in London over the last 1.5 years I know of many issues that repeatedly come up that plague decision makers on data science teams. We got to cover a set of issues and talk on solutions that are known to work. I have a fuller write-up to follow.</p>\n<p>The conference also enabled a &#8220;pay what you can&#8221; model for those attending outside of a corporate ticket, this brought in a much wider audience that could normally attend a PyData conference. The goal of the non-profit NumFOCUS (who back the PyData global events) is to fund open source so the goal is always to raise more money and to provide a high quality educational and networking experience. For this on-line global event we figured it made sense to open out the community to even more folk &#8211; the &#8220;pay what you can&#8221; model is regarded as a success (this is the first time we&#8217;ve done it!) and has given us some interesting attendee insights to think on.</p>\n<p>There are definitely some lessons to learn, notably the on-boarding process was complex (3 systems had to be activated) &#8211; the volunteer crew wrote very clear instructions but nonetheless it was a more involved process than we wanted. This will be improved in the future.</p>\n<p>I extend my thanks to the <a href=\"https://twitter.com/MSanKeys963/status/1328666692629655554\">wider volunteer organising committee</a> and to NumFOCUS for making this happen!</p>\n<hr>\nIan is a Chief Interim Data Scientist via his <a href=http://morconsulting.com>Mor Consulting</a>. Sign-up for <a href=http://eepurl.com/Z44HT>Data Science tutorials in London</a> and to hear about his <a href=https://ianozsvald.com/data-science-jobs/>data science thoughts and jobs</a>. He lives in London, is walked by his high energy Springer Spaniel and is a consumer of fine coffees."
}