{
  "title": "Episode 50: &#8220;Honky Tonk&#8221; by Bill Doggett",
  "link": "https://500songs.com/podcast/episode-50-honky-tonk-by-bill-doggett/",
  "pubDate": "Mon, 16 Sep 2019 18:57:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=596",
  "description": "Episode fifty of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Honky Tonk\" by Bill Doggett, and uses his career to provide a brief summary of the earlier episodes of the podcast as we're now moving forward into the next stage of the story. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/30001381\">on \"Sixteen Tons\" by Tennessee Ernie Ford</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-50-honky-tonk/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are many best-of collections of Doggett's work available. <a href=\"https://amzn.to/2UWOmbe\">This one</a> seems to have the best sound quality and is a decent overview of his work.\n\nInformation for this one comes from all over the place, including <a href=\"https://amzn.to/2TpNpa8\"><em>Shout, Sister, Shout!: The Untold Story of Rock-and-roll Trailblazer Sister Rosetta Tharpe</em></a> by Gayle F Wald, <a href=\"https://amzn.to/2B30b6c\"><em>Honkers & Shouters: The Golden Years of Rhythm and Blues</em> by Arnold Shaw</a>, and <a href=\"http://inkspots.ca/\">Inkspots.ca </a>\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWelcome to the fiftieth episode of A History of Rock Music in Five Hundred Songs. We're now ten percent of the way through our story, and also most of the way through 1956.\n\nI'm told that when history podcasts hit a big round number, it's customary for them to do a jumping-on episode, perhaps a \"story so far\" which covers everything that's been discussed up to that point, but in brief, so that new listeners can get up to speed.\n\nThat's sort of what I'm about to do here. This week, we're going to look at a hit song from 1956, but by someone whose career interacted with almost everyone in the first twenty or so episodes of the podcast.\n\nWe're going to look again at some of that old music, not as isolated records by different artists, but as stages in the career of a single individual. We're going to look at someone who was a jobbing musician, who'd take any job that was on offer, but who by virtue of just being a hard-working competent jobbing player and arranger managed to have an astonishing influence on the development of music.\n\nWhile rock and roll was primarily a vocal music, it wasn't a completely clean break with the past, and for most of the decades from the 1920s through to the early 50s, if you wanted music for dancing you would want instrumental groups. The big bands did employ vocalists, of course, but you can tell who the focus was on from looking at the names of the bands -- the Benny Goodman Orchestra, the Glenn Miller Orchestra, the Duke Ellington Orchestra, the Count Basie orchestra -- all of the leaders of the big bands were instrumentalists. They played clarinet or trombone or piano, they didn't sing.\n\nIt was only with the musicians union strikes of the 1940s, which we've talked about before, that more through necessity than anything else the music industry moved from being dominated by instrumental music to being dominated by singers. But well into the 1960s we'll still be seeing rock and roll hits that were purely instrumental. Indeed, we probably wouldn't have rock and roll guitar bands at all without instrumental groups like the Ventures in the US or the Shadows in the UK who had hits with pure instrumental records.\n\nAnd one of the greatest of the early rock and roll instrumentals was by someone who didn't actually consider himself a rock and roll musician. It's a record that influenced everyone from James Brown to the Beach Boys, and it's called \"Honky Tonk\":\n\n[Excerpt: Bill Doggett, \"Honky Tonk\"]\n\nThere is surprisingly little information out there about Bill Doggett, for someone who had such an impact on the fields of rock and roll, blues, jazz, and soul. There are no books about his life, and the only website devoted to him is one designed by his nephew, which... has all the flaws one might expect from a website put together about someone's uncle.\n\nDoggett was born in 1916 in Philadelphia, and he moved to New York in his late teens and formed his own band, for which he was the piano player. But in 1938, Lucky Millinder was looking for a new band -- the way Millinder worked was that he bought out, and took over the leadership, of existing bands, which then became \"the Lucky Millinder Orchestra\".\n\nThis incarnation of the Lucky Millinder Orchestra, the one that was put together by Doggett before Millinder took the band over, is the one that got a residency at the Savoy after Chick Webb's band stopped playing there, and like Webb's band this group was managed by Moe Gale. Doggett stayed on with Millinder as his pianist, and while with the group he appeared with Millinder in the 1938 all-black film Paradise in Harlem, playing on this song:\n\n[Excerpt: Lucky Millinder, \"I've Got To Put You Down\"]\n\nDoggett was, from what I can tell, the de facto musical director for Millinder's band in this period -- Millinder was a frontman and occasional singer, but he couldn't play an instrument and was reliant on the musicians in his band to work the arrangements out for him.\n\nDoggett was in the band when Moe Gale suggested that Sister Rosetta Tharpe would work well paired up with Millinder's main singer, Trevor Bacon, in the same way that Louis Jordan and Ella Fitzgerald had worked well together in the Chick Webb band. Doggett was the pianist during the whole of Tharpe's time with the Millinder band, and he co-composed, with Millinder, the song that later gave its title to a biography of Tharpe, \"Shout! Sister, Shout!\":\n\n[Excerpt: Rosetta Tharpe, \"Shout! Sister, Shout!\"]\n\nIf you listen to any of Tharpe's big band recordings from her time with Millinder, it's Doggett on the piano, and I strongly suspect it was Doggett who came up with the arrangements. Listen for example to his playing on \"Lonesome Road\", another song that the MIllinder band performed on film:\n\n[Excerpt: Rosetta Tharpe, \"Lonesome Road\"]\n\nThe Millinder band were pivotal in the move from swing music to R&B, and Doggett was an important part in that move. While he'd left the band before they took on later singers like Wynonie Harris and Ruth Brown, he had helped set the band up to be the kind of band that those singers would feel comfortable in.\n\nDoggett was also in the band when they had their biggest hit, a song called \"When the Lights Go on Again (All Over the World)\":\n\n[Excerpt: Lucky Millinder, \"When the Lights Go on Again (All Over the World)\"]\n\nThat's most notable now for being one of the first recordings of a young trumpeter who was just starting out, by the name of Dizzy Gillespie. Gillespie was quickly sacked by Millinder, who had a habit of getting rid of musicians before they reached their full potential.\n\nI've not been able to find out why Doggett left Millinder -- whether he was one of those musicians who was sacked, or whether he just wanted to move on to other things -- but whatever the reason, it can't have been anything that put a stain on his reputation, because Doggett remained with Millinder's manager, Moe Gale.\n\nWe've mentioned Gale before several times, but he was the manager of almost every important black act based in New York in the late thirties and early forties, as well as running the Savoy Club, which we talked about in several of the earliest episodes of the podcast. Gale managed Millinder and Rosetta Tharpe, and also managed the Ink Spots, Ella Fitzgerald, Chick Webb, and Louis Jordan, and so whenever one of his acts needed a musician, he would tend to find them from his existing pool of talent.\n\nAnd so this is how, straight after leaving Lucky Millinder's band, Doggett found himself working for another Gale act, the Ink Spots. He joined them as their pianist and arranger, and stayed with them for several years:\n\n[Excerpt: The Ink Spots, \"I'll Get By\"]\n\nThe Ink Spots, if you don't remember, were a vocal quartet who became the most popular black act of the forties, and who stuck to a unique formula based around Bill Kenny's high tenor and Hoppy Jones' low spoken bass. They had hit after hit during the forties with songs that all sound remarkably similar, and in the mid forties those songs were arranged by Bill Doggett.\n\nHe was with the group for two years -- starting with the classic line-up of the group, and staying with them through Charlie Fuqua being drafted and Deek Watson being fired. While he was a sideman rather than a full member of the group, he was important enough to them that he now gets counted in lists of proper members put together by historians of the band. He ended up leaving them less than two weeks before Hoppy Jones died, and during that time he played on fourteen of their hit singles, almost all of them sticking to the same formula they'd used previously, the \"top and bottom\":\n\n[Excerpt: The Ink Spots, \"Ev'ry Night About This Time\"]\n\nThe different acts managed by Moe Gale all sat in with each other when needed, so for example Trevor Bacon, the male vocalist with Millinder's band, temporarily joined the Ink Spots when Deke Watson got sick for a few weeks. And so during the times when the Ink Spots weren't touring, Doggett would also perform with Ella Fitzgerald, who was also managed by Gale.\n\n[Excerpt: Ella Fitzgerald, \"Time Alone Will Tell\"]\n\nAnd indeed, during the end of Doggett's time with the Ink Spots, Fitzgerald recorded a number of hit singles with the group, which of course featured Doggett on the piano. That included this one, which later went on to be the basis of \"Train Kept A-Rollin'\", which we looked at a few episodes back:\n\n[Excerpt: Ella Fitzgerald and the Ink Spots, \"Cow Cow Boogie\"]\n\nDoggett moved over full time to become Ella's arranger and pianist at some point during the couple of weeks between Deek Watson leaving the Ink Spots and Hoppy Jones dying, in early October 1944, and stayed with her for a couple of years, before moving on to Illinois Jacquet's band, taking the same role again, in the band that introduced the honking tenor saxophone into R&B, and thus into rock and roll:\n\n[Excerpt: Illinois Jacquet, \"Doggin' With Doggett\"]\n\nHe also played on one of the most important records in forties R&B -- Johnny Otis' \"Harlem Nocturne\", the first hit for the man who would go on to produce most of the great R&B artists of the fifties:\n\n[Excerpt: Johnny Otis, \"Harlem Nocturne\"]\n\nAnd he also led his own band for a while, the Bill Doggett Octet. They were the ones who recorded \"Be-Baba-Leba\" with Helen Humes on vocals -- the song that probably inspired Gene Vincent to write a very similarly named song a few years later:\n\n[Excerpt: Helen Humes, \"Be-Baba-Leba\"]\n\nHe then moved on to Louis Jordan's band full time, and this is where his career really starts.\n\nJordan was another act in Moe Gale's stable, and indeed just like the Ink Spots he'd had hits duetting with Ella Fitzgerald, who he'd first worked with back in the 1930s in Chick Webb's band. He was also, as you may remember from earlier episodes, the leader of the most popular R&B group in the late forties and early fifties -- the one that inspired everyone from Chuck Berry to Bill Haley. And as with his tenure with the Ink Spots, Doggett was in Jordan's band during its period of peak commercial success.\n\nThe timeline for who Doggett played with when, as you can probably tell, is all over the place, because he seemed to be playing with two or three acts at any given time. And so officially, if you look at the timelines, so far as they exist, you see that it's generally claimed that Bill Doggett joined Louis Jordan in 1949. But I've seen interviews with members of Jordan's organisation that suggest he joined much earlier, but he would alternate with Jordan's other piano player, Wild Bill Davis.\n\nThe way they worked, according to Berle Adams, who was involved in Jordan's management, was that Davis would spend a week on the road as Jordan's piano player, while Doggett would spend the same week writing arrangements for the group, and then they would swap over, and Doggett would go out on the road while Davis would write arrangements.\n\nEither way, after a while, Doggett became the sole pianist for the group, as Davis struck out on his own, and Doggett once again basically became the musical director for one of the biggest bands in the R&B business. Doggett is often credited as the person who rewrote \"Saturday Night Fish Fry\" into one of Jordan's biggest hits from its inauspicious original version, though Jordan is credited on the record:\n\n[Excerpt: Louis Jordan, \"Saturday Night Fish Fry\"]\n\nDuring his time with Jordan, Doggett continued playing on records for Ella Fitzgerald, Bill Kenny of the Ink Spots, and other artists, but he was paying close attention to Wild Bill Davis, who he had replaced in Jordan's group. Davis had discovered the possibilities in a new musical instrument, the Hammond organ, and had formed a trio consisting of himself, a guitarist, and a drummer to exploit these possibilities in jazz music:\n\n[Excerpt: Wild Bill Davis, \"Things Ain't What They Used To Be\"]\n\nDoggett was also fascinated by this instrument, especially when hearing it up close, as when Davis rejoined Jordan's band to record \"Tamburitza Boogie\", which had Doggett on piano and Davis on the Hammond organ:\n\n[Excerpt: Louis Jordan, \"Tamburitza Boogie\"]\n\nWhen Doggett left Jordan's band, he decided to form an organ trio just like Davis'. The only problem was that it was just like Davis'. His group had the same instrumentation, and Doggett and Davis had very similar playing styles. Still, Henry Glover got him a contract with King Records, and he started recording Hammond organ blues tracks in the Davis style:\n\n[Excerpt: Bill Doggett Trio, \"Big Dog\"]\n\nDavis and Doggett between them gave the Hammond organ its prominence in the world of jazz, R&B, and soul music. The Hammond organ has an odd image, as most people associate it with the cheesiest sort of light entertainment -- certainly for anyone in Britain of the generation older than mine, for example, the name it conjures up is Reggie Dixon, possibly the least funky man ever. But in that part of music which is the intersection of jazz and R&B -- the part of music inhabited by Jimmy Smith, Booker T Jones, Ray Charles, Georgie Fame, Billy Preston and others -- the Hammond organ has become an essential instrument, used so differently that one might almost compare it to the violin, where the instrument is referred to as a fiddle when it's played on folk or country songs.\n\nAnd that comes from Davis and Doggett and their almost simultaneous invention of a new style of keyboards for the new style of music that was coming up in the late forties and early fifties.\n\nBut after a year or two of playing in an organ trio, Doggett decided that he didn't want to keep making records that sounded so much like the ones Wild Bill Davis was making -- he didn't want to be seen as a copy. And so to vary the style, he decided to take on a honking saxophone player to be the group's lead instrumentalist, while Doggett would concentrate on providing a rhythmic pad. This lineup of his group would go on to make the record that would make Doggett's name.\n\n\"Honky Tonk, Parts 1 and 2\" came about almost by accident. As Doggett told the story, his biggest hit started out at a dance in Lima, Ohio on a Sunday night. The group were playing their normal set and people were dancing as normal, but then in between songs Billy Butler, Doggett's guitarist, just started noodling an instrumental line on his bass strings:\n\n[Excerpt: Bill Doggett, \"Honky Tonk\" intro]\n\nThis hadn't been planned -- he was just noodling around, as all guitarists will do when given five seconds silence. But the audience started dancing to it, and if you're in a bar band and the audience is dancing, you keep doing what you're doing. As Butler was just playing a simple twelve-bar blues pattern, the rest of the group fell in with the riff he was playing, and he started soloing over them:\n\n[Excerpt: Bill Doggett, \"Honky Tonk\" guitar soloing]\n\nAfter three choruses of this, Butler nodded to Clifford Scott, the group's saxophone player, to take over, and Scott started playing a honking saxophone version of what Butler had been playing:\n\n[Excerpt: Bill Doggett, \"Honky Tonk\", sax]\n\nAfter Scott played through it a few times, he looked over to Doggett to see if Doggett wanted to take a solo too. Doggett shook his head. The song had already been going about five minutes and what Butler and Scott had been playing was enough. The group quickly brought the song to a close using a standard blues outro:\n\n[Excerpt: Bill Doggett, \"Honky Tonk\", outro]\n\nAnd that would have been the end of that. It's the kind of thing that bar bands have jammed a million times, the sort of thing that if you're a musician you think nothing of. They laughed at the end of the song, happy that they'd pulled off something that spontaneous and the audience had been OK with it, and carried on with the rest of their planned set.\n\nBut then, a couple of songs later, someone in the audience came up and asked them if they could play that hot new song they'd been playing before again, not realising it had just been a spur-of-the-moment jam. OK, you give the audience what they want, the band members could remember more or less what they'd been playing, so they played it again. And the crowd went wild.\n\nAnd they played it again. And the crowd went wild again.\n\nBy the end of the night they'd played that new song, the one they'd improvised based on Billy Butler's guitar noodling, ten times.\n\nDoggett immediately phoned Syd Nathan at King Records, his label, and told him that they had a hit on their hands and needed to get it out straight away. But there was one problem -- the song was over five minutes long, and a shellac 78RPM disc, which was still the most popular format for R&B music, could only hold three minutes per side. It would have to be a double-sided record.\n\nNathan hated putting out records where the song continued onto the other side, because the jukebox operators who were his main customers didn't like them. But he eventually agreed, and Doggett and his band got together in the studio and recorded their new instrumental in a single take. It was released as \"Honky Tonk Part One\" and part two, and they pressed up five thousand copies in the first week. Those sold out straight away, so the next week they pressed up twelve thousand five hundred copies. Those also sold straight away, and so for the next few weeks they started pressing up a hundred thousand copies a week.\n\nThe song went to number one on the R&B charts, and became the biggest selling R&B song of 1956, spending thirteen weeks in total at number one -- dropping down the charts and then back up again. It also reached number two on the pop charts, an astonishing feat for an R&B instrumental. It became a staple for cover bands, and it was recorded by the obvious instrumental acts like the Ventures and Duane Eddy -- and indeed Duane Eddy's whole style seems to have come from \"Honky Tonk\" -- but by other people you might not expect, like Buddy Holly:\n\n[Excerpt: Buddy Holly, \"Honky Tonk\"]\n\nThe Beach Boys:\n\n[Excerpt: The Beach Boys, \"Honky Tonk\"]\n\nAnd even James Brown:\n\n[Excerpt: James Brown, Honky Tonk\"]\n\nDoggett never had another hit quite as big as \"Honky Tonk\", though his next few records, based on the \"Honky Tonk\" pattern, also made the top five on the R&B chart:\n\n[Excerpt: Bill Doggett, \"Slow Walk\"]\n\nHe had ten more R&B top thirty hits over the course of the 1950s.\n\nBut Doggett was being promoted as a rock and roll act, and playing bills with other rock and roll stars, and he didn't really feel comfortable in the rock and roll world. When \"Honky Tonk\" came out, he was forty years old -- by far the oldest of the people who had rock and roll hits in the mid fifties -- and he was a jazz organ player, not a Little Richard type. He was also stuck repeating a formula -- over the decade after \"Honky Tonk\" parts one and two he recorded tracks like \"Honky Tonk (vocal version)\", \"Hippy Dippy\", \"Blip Blop\", \"Yocky Dock\", and \"Honky Tonk Bossa Nova\".\n\nHis career as a charting artist more or less stopped after 1960, when he made the mistake of asking Syd Nathan if he could have a higher royalty rate, given the millions of dollars his recordings had brought in to King Records, and King dropped him. But it didn't stop his career as a working musician. In 1962 he teamed up again with Ella Fitzgerald, who wanted to go back to making music with a bit more rhythm than her recent albums of ballads. The resulting album, \"Rhythm is my Business\", featured Doggett's arrangements and Hammond organ very prominently:\n\n[Excerpt: Ella Fitzgerald, \"Hallelujah I Love Him So\"]\n\nHe also teamed up in 1969 with James Brown, who around that time was trying to pay back his dues to others who'd been artists on King Records when Brown had started with them in the fifties. As well as recording his album \"Thinking About Little Willie John and Other Nice Things\", Brown had also been producing records for Hank Ballard, and now it was Bill Doggett's turn. For Doggett, Brown produced and wrote \"Honky Tonk Popcorn\":\n\n[Excerpt: Bill Doggett, \"Honky Tonk Popcorn\"]\n\nDoggett spent most of the rest of his life touring the oldies circuit, a respected organist who would play hundreds of shows a year, until his death in 1996 aged eighty. He played \"Honky Tonk\" at every show, saying \"I just wouldn't be Bill Doggett if I didn't play 'Honky Tonk'. That's what the people pay to hear, so that's what they get.\"",
  "itunes:subtitle": "Episode fifty of A History of Rock Music in Five Hundred Songs looks at Honky Tonk by Bill Doggett, and uses his career to provide a brief summary of the earlier episodes of the podcast as were now moving forward into the next stage of the story. Click t",
  "itunes:keywords": "Bill Doggett,Dizzy Gillespie,Ella Fitzgerald,Henry Glover,Illinois Jacquet,Ink Spots,James Brown,Johnny Otis,King Records,Louis Jordan,Lucky Millinder,Mo Gale,Savoy Ballroom,Sister Rosetta Tharpe,Syd Nathan",
  "itunes:episodeType": "full",
  "itunes:episode": 50,
  "content:encoded": "Episode fifty of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Honky Tonk\" by Bill Doggett, and uses his career to provide a brief summary of the earlier episodes of the podcast as we're now moving forward into the next stage of the story. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/30001381\">on \"Sixteen Tons\" by Tennessee Ernie Ford</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-50-honky-tonk/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are many best-of collections of Doggett's work available. <a href=\"https://amzn.to/2UWOmbe\">This one</a> seems to have the best sound quality and is a decent overview of his work.\n\nInformation for this one comes from all over the place, including <a href=\"https://amzn.to/2TpNpa8\"><em>Shout, Sister, Shout!: The Untold Story of Rock-and-roll Trailblazer Sister Rosetta Tharpe</em></a> by Gayle F Wald, <a href=\"https://amzn.to/2B30b6c\"><em>Honkers & Shouters: The Golden Years of Rhythm and Blues</em> by Arnold Shaw</a>, and <a href=\"http://inkspots.ca/\">Inkspots.ca </a>\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWelcome to the fiftieth episode of A History of Rock Music in Five Hundred Songs. We're now ten percent of the way through our story, and also most of the way through 1956.\n\nI'm told that when history podcasts hit a big round number, it's customary for them to do a jumping-on episode, perhaps a \"story so far\" which covers everything that's been discussed up to that point, but in brief, so that new listeners can get up to speed.\n\nThat's sort of what I'm about to do here. This week, we're going to look at a hit song from 1956, but by someone whose career interacted with almost everyone in the first twenty or so episodes of the podcast.\n\nWe're going to look again at some of that old music, not as isolated records by different artists, but as stages in the career of a single individual. We're going to look at someone who was a jobbing musician, who'd take any job that was on offer, but who by virtue of just being a hard-working competent jobbing player and arranger managed to have an astonishing influence on the development of music.\n\nWhile rock and roll was primarily a vocal music, it wasn't a completely clean break with the past, and for most of the decades from the 1920s through to the early 50s, if you wanted music for dancing you would want instrumental groups. The big bands did employ vocalists, of course, but you can tell who the focus was on from looking at the names of the bands -- the Benny Goodman Orchestra, the Glenn Miller Orchestra, the Duke Ellington Orchestra, the Count Basie orchestra -- all of the leaders of the big bands were instrumentalists. They played clarinet or trombone or piano, they didn't sing.\n\nIt was only with the musicians union strikes of the 1940s, which we've talked about before, that more through necessity than anything else the music industry moved from being dominated by instrumental music to being dominated by singers. But well into the 1960s we'll still be seeing rock and roll hits that were purely instrumental. Indeed, we probably wouldn't have rock and roll guitar bands at all without instrumental groups like the Ventures in the US or the Shadows in the UK who had hits with pure instrumental records.\n\nAnd one of the greatest of the early rock and roll instrumentals was by someone who didn't actually consider himself a rock and roll musician. It's a record that influenced everyone from James Brown to the Beach Boys, and it's called \"Honky Tonk\":\n\n[Excerpt: Bill Doggett, \"Honky Tonk\"]\n\nThere is surprisingly little information out there about Bill Doggett, for someone who had such an impact on the fields of rock and roll, blues, jazz, and soul. There are no books about his life, and the only website devoted to him is one designed by his nephew, which... has all the flaws one might expect from a website put together about someone's uncle.\n\nDoggett was born in 1916 in Philadelphia, and he moved to New York in his late teens and formed his own band, for which he was the piano player. But in 1938, Lucky Millinder was looking for a new band -- the way Millinder worked was that he bought out, and took over the leadership, of existing bands, which then became \"the Lucky Millinder Orchestra\".\n\nThis incarnation of the Lucky Millinder Orchestra, the one that was put together by Doggett before Millinder took the band over, is the one that got a residency at the Savoy after Chick Webb's band stopped playing there, and like Webb's band this group was managed by Moe Gale. Doggett stayed on with Millinder as his pianist, and while with the group he appeared with Millinder in the 1938 all-black film Paradise in Harlem, playing on this song:\n\n[Excerpt: Lucky Millinder, \"I've Got To Put You Down\"]\n\nDoggett was, from what I can tell, the de facto musical director for Millinder's band in this period -- Millinder was a frontman and occasional singer, but he couldn't play an instrument and was reliant on the musicians in his band to work the arrangements out for him.\n\nDoggett was in the band when Moe Gale suggested that Sister Rosetta Tharpe would work well paired up with Millinder's main singer, Trevor Bacon, in the same way that Louis Jordan and Ella Fitzgerald had worked well together in the Chick Webb band. Doggett was the pianist during the whole of Tharpe's time with the Millinder band, and he co-composed, with Millinder, the song that later gave its title to a biography of Tharpe, \"Shout! Sister, Shout!\":\n\n[Excerpt: Rosetta Tharpe, \"Shout! Sister, Shout!\"]\n\nIf you listen to any of Tharpe's big band recordings from her time with Millinder, it's Doggett on the piano, and I strongly suspect it was Doggett who came up with the arrangements. Listen for example to his playing on \"Lonesome Road\", another song that the MIllinder band performed on film:\n\n[Excerpt: Rosetta Tharpe, \"Lonesome Road\"]\n\nThe Millinder band were pivotal in the move from swing music to R&B, and Doggett was an important part in that move. While he'd left the band before they took on later singers like Wynonie Harris and Ruth Brown, he had helped set the band up to be the kind of band that those singers would feel comfortable in.\n\nDoggett was also in the band when they had their biggest hit, a song called \"When the Lights Go on Again (All Over the World)\":\n\n[Excerpt: Lucky Millinder, \"When the Lights Go on Again (All Over the World)\"]\n\nThat's most notable now for being one of the first recordings of a young trumpeter who was just starting out, by the name of Dizzy Gillespie. Gillespie was quickly sacked by Millinder, who had a habit of getting rid of musicians before they reached their full potential.\n\nI've not been able to find out why Doggett left Millinder -- whether he was one of those musicians who was sacked, or whether he just wanted to move on to other things -- but whatever the reason, it can't have been anything that put a stain on his reputation, because Doggett remained with Millinder's manager, Moe Gale.\n\nWe've mentioned Gale before several times, but he was the manager of almost every important black act based in New York in the late thirties and early forties, as well as running the Savoy Club, which we talked about in several of the earliest episodes of the podcast. Gale managed Millinder and Rosetta Tharpe, and also managed the Ink Spots, Ella Fitzgerald, Chick Webb, and Louis Jordan, and so whenever one of his acts needed a musician, he would tend to find them from his existing pool of talent.\n\nAnd so this is how, straight after leaving Lucky Millinder's band, Doggett found himself working for another Gale act, the Ink Spots. He joined them as their pianist and arranger, and stayed with them for several years:\n\n[Excerpt: The Ink Spots, \"I'll Get By\"]\n\nThe Ink Spots, if you don't remember, were a vocal quartet who became the most popular black act of the forties, and who stuck to a unique formula based around Bill Kenny's high tenor and Hoppy Jones' low spoken bass. They had hit after hit during the forties with songs that all sound remarkably similar, and in the mid forties those songs were arranged by Bill Doggett.\n\nHe was with the group for two years -- starting with the classic line-up of the group, and staying with them through Charlie Fuqua being drafted and Deek Watson being fired. While he was a sideman rather than a full member of the group, he was important enough to them that he now gets counted in lists of proper members put together by historians of the band. He ended up leaving them less than two weeks before Hoppy Jones died, and during that time he played on fourteen of their hit singles, almost all of them sticking to the same formula they'd used previously, the \"top and bottom\":\n\n[Excerpt: The Ink Spots, \"Ev'ry Night About This Time\"]\n\nThe different acts managed by Moe Gale all sat in with each other when needed, so for example Trevor Bacon, the male vocalist with Millinder's band, temporarily joined the Ink Spots when Deke Watson got sick for a few weeks. And so during the times when the Ink Spots weren't touring, Doggett would also perform with Ella Fitzgerald, who was also managed by Gale.\n\n[Excerpt: Ella Fitzgerald, \"Time Alone Will Tell\"]\n\nAnd indeed, during the end of Doggett's time with the Ink Spots, Fitzgerald recorded a number of hit singles with the group, which of course featured Doggett on the piano. That included this one, which later went on to be the basis of \"Train Kept A-Rollin'\", which we looked at a few episodes back:\n\n[Excerpt: Ella Fitzgerald and the Ink Spots, \"Cow Cow Boogie\"]\n\nDoggett moved over full time to become Ella's arranger and pianist at some point during the couple of weeks between Deek Watson leaving the Ink Spots and Hoppy Jones dying, in early October 1944, and stayed with her for a couple of years, before moving on to Illinois Jacquet's band, taking the same role again, in the band that introduced the honking tenor saxophone into R&B, and thus into rock and roll:\n\n[Excerpt: Illinois Jacquet, \"Doggin' With Doggett\"]\n\nHe also played on one of the most important records in forties R&B -- Johnny Otis' \"Harlem Nocturne\", the first hit for the man who would go on to produce most of the great R&B artists of the fifties:\n\n[Excerpt: Johnny Otis, \"Harlem Nocturne\"]\n\nAnd he also led his own band for a while, the Bill Doggett Octet. They were the ones who recorded \"Be-Baba-Leba\" with Helen Humes on vocals -- the song that probably inspired Gene Vincent to write a very similarly named song a few years later:\n\n[Excerpt: Helen Humes, \"Be-Baba-Leba\"]\n\nHe then moved on to Louis Jordan's band full time, and this is where his career really starts.\n\nJordan was another act in Moe Gale's stable, and indeed just like the Ink Spots he'd had hits duetting with Ella Fitzgerald, who he'd first worked with back in the 1930s in Chick Webb's band. He was also, as you may remember from earlier episodes, the leader of the most popular R&B group in the late forties and early fifties -- the one that inspired everyone from Chuck Berry to Bill Haley. And as with his tenure with the Ink Spots, Doggett was in Jordan's band during its period of peak commercial success.\n\nThe timeline for who Doggett played with when, as you can probably tell, is all over the place, because he seemed to be playing with two or three acts at any given time. And so officially, if you look at the timelines, so far as they exist, you see that it's generally claimed that Bill Doggett joined Louis Jordan in 1949. But I've seen interviews with members of Jordan's organisation that suggest he joined much earlier, but he would alternate with Jordan's other piano player, Wild Bill Davis.\n\nThe way they worked, according to Berle Adams, who was involved in Jordan's management, was that Davis would spend a week on the road as Jordan's piano player, while Doggett would spend the same week writing arrangements for the group, and then they would swap over, and Doggett would go out on the road while Davis would write arrangements.\n\nEither way, after a while, Doggett became the sole pianist for the group, as Davis struck out on his own, and Doggett once again basically became the musical director for one of the biggest bands in the R&B business. Doggett is often credited as the person who rewrote \"Saturday Night Fish Fry\" into one of Jordan's biggest hits from its inauspicious original version, though Jordan is credited on the record:\n\n[Excerpt: Louis Jordan, \"Saturday Night Fish Fry\"]\n\nDuring his time with Jordan, Doggett continued playing on records for Ella Fitzgerald, Bill Kenny of the Ink Spots, and other artists, but he was paying close attention to Wild Bill Davis, who he had replaced in Jordan's group. Davis had discovered the possibilities in a new musical instrument, the Hammond organ, and had formed a trio consisting of himself, a guitarist, and a drummer to exploit these possibilities in jazz music:\n\n[Excerpt: Wild Bill Davis, \"Things Ain't What They Used To Be\"]\n\nDoggett was also fascinated by this instrument, especially when hearing it up close, as when Davis rejoined Jordan's band to record \"Tamburitza Boogie\", which had Doggett on piano and Davis on the Hammond organ:\n\n[Excerpt: Louis Jordan, \"Tamburitza Boogie\"]\n\nWhen Doggett left Jordan's band, he decided to form an organ trio just like Davis'. The only problem was that it was just like Davis'. His group had the same instrumentation, and Doggett and Davis had very similar playing styles. Still, Henry Glover got him a contract with King Records, and he started recording Hammond organ blues tracks in the Davis style:\n\n[Excerpt: Bill Doggett Trio, \"Big Dog\"]\n\nDavis and Doggett between them gave the Hammond organ its prominence in the world of jazz, R&B, and soul music. The Hammond organ has an odd image, as most people associate it with the cheesiest sort of light entertainment -- certainly for anyone in Britain of the generation older than mine, for example, the name it conjures up is Reggie Dixon, possibly the least funky man ever. But in that part of music which is the intersection of jazz and R&B -- the part of music inhabited by Jimmy Smith, Booker T Jones, Ray Charles, Georgie Fame, Billy Preston and others -- the Hammond organ has become an essential instrument, used so differently that one might almost compare it to the violin, where the instrument is referred to as a fiddle when it's played on folk or country songs.\n\nAnd that comes from Davis and Doggett and their almost simultaneous invention of a new style of keyboards for the new style of music that was coming up in the late forties and early fifties.\n\nBut after a year or two of playing in an organ trio, Doggett decided that he didn't want to keep making records that sounded so much like the ones Wild Bill Davis was making -- he didn't want to be seen as a copy. And so to vary the style, he decided to take on a honking saxophone player to be the group's lead instrumentalist, while Doggett would concentrate on providing a rhythmic pad. This lineup of his group would go on to make the record that would make Doggett's name.\n\n\"Honky Tonk, Parts 1 and 2\" came about almost by accident. As Doggett told the story, his biggest hit started out at a dance in Lima, Ohio on a Sunday night. The group were playing their normal set and people were dancing as normal, but then in between songs Billy Butler, Doggett's guitarist, just started noodling an instrumental line on his bass strings:\n\n[Excerpt: Bill Doggett, \"Honky Tonk\" intro]\n\nThis hadn't been planned -- he was just noodling around, as all guitarists will do when given five seconds silence. But the audience started dancing to it, and if you're in a bar band and the audience is dancing, you keep doing what you're doing. As Butler was just playing a simple twelve-bar blues pattern, the rest of the group fell in with the riff he was playing, and he started soloing over them:\n\n[Excerpt: Bill Doggett, \"Honky Tonk\" guitar soloing]\n\nAfter three choruses of this, Butler nodded to Clifford Scott, the group's saxophone player, to take over, and Scott started playing a honking saxophone version of what Butler had been playing:\n\n[Excerpt: Bill Doggett, \"Honky Tonk\", sax]\n\nAfter Scott played through it a few times, he looked over to Doggett to see if Doggett wanted to take a solo too. Doggett shook his head. The song had already been going about five minutes and what Butler and Scott had been playing was enough. The group quickly brought the song to a close using a standard blues outro:\n\n[Excerpt: Bill Doggett, \"Honky Tonk\", outro]\n\nAnd that would have been the end of that. It's the kind of thing that bar bands have jammed a million times, the sort of thing that if you're a musician you think nothing of. They laughed at the end of the song, happy that they'd pulled off something that spontaneous and the audience had been OK with it, and carried on with the rest of their planned set.\n\nBut then, a couple of songs later, someone in the audience came up and asked them if they could play that hot new song they'd been playing before again, not realising it had just been a spur-of-the-moment jam. OK, you give the audience what they want, the band members could remember more or less what they'd been playing, so they played it again. And the crowd went wild.\n\nAnd they played it again. And the crowd went wild again.\n\nBy the end of the night they'd played that new song, the one they'd improvised based on Billy Butler's guitar noodling, ten times.\n\nDoggett immediately phoned Syd Nathan at King Records, his label, and told him that they had a hit on their hands and needed to get it out straight away. But there was one problem -- the song was over five minutes long, and a shellac 78RPM disc, which was still the most popular format for R&B music, could only hold three minutes per side. It would have to be a double-sided record.\n\nNathan hated putting out records where the song continued onto the other side, because the jukebox operators who were his main customers didn't like them. But he eventually agreed, and Doggett and his band got together in the studio and recorded their new instrumental in a single take. It was released as \"Honky Tonk Part One\" and part two, and they pressed up five thousand copies in the first week. Those sold out straight away, so the next week they pressed up twelve thousand five hundred copies. Those also sold straight away, and so for the next few weeks they started pressing up a hundred thousand copies a week.\n\nThe song went to number one on the R&B charts, and became the biggest selling R&B song of 1956, spending thirteen weeks in total at number one -- dropping down the charts and then back up again. It also reached number two on the pop charts, an astonishing feat for an R&B instrumental. It became a staple for cover bands, and it was recorded by the obvious instrumental acts like the Ventures and Duane Eddy -- and indeed Duane Eddy's whole style seems to have come from \"Honky Tonk\" -- but by other people you might not expect, like Buddy Holly:\n\n[Excerpt: Buddy Holly, \"Honky Tonk\"]\n\nThe Beach Boys:\n\n[Excerpt: The Beach Boys, \"Honky Tonk\"]\n\nAnd even James Brown:\n\n[Excerpt: James Brown, Honky Tonk\"]\n\nDoggett never had another hit quite as big as \"Honky Tonk\", though his next few records, based on the \"Honky Tonk\" pattern, also made the top five on the R&B chart:\n\n[Excerpt: Bill Doggett, \"Slow Walk\"]\n\nHe had ten more R&B top thirty hits over the course of the 1950s.\n\nBut Doggett was being promoted as a rock and roll act, and playing bills with other rock and roll stars, and he didn't really feel comfortable in the rock and roll world. When \"Honky Tonk\" came out, he was forty years old -- by far the oldest of the people who had rock and roll hits in the mid fifties -- and he was a jazz organ player, not a Little Richard type. He was also stuck repeating a formula -- over the decade after \"Honky Tonk\" parts one and two he recorded tracks like \"Honky Tonk (vocal version)\", \"Hippy Dippy\", \"Blip Blop\", \"Yocky Dock\", and \"Honky Tonk Bossa Nova\".\n\nHis career as a charting artist more or less stopped after 1960, when he made the mistake of asking Syd Nathan if he could have a higher royalty rate, given the millions of dollars his recordings had brought in to King Records, and King dropped him. But it didn't stop his career as a working musician. In 1962 he teamed up again with Ella Fitzgerald, who wanted to go back to making music with a bit more rhythm than her recent albums of ballads. The resulting album, \"Rhythm is my Business\", featured Doggett's arrangements and Hammond organ very prominently:\n\n[Excerpt: Ella Fitzgerald, \"Hallelujah I Love Him So\"]\n\nHe also teamed up in 1969 with James Brown, who around that time was trying to pay back his dues to others who'd been artists on King Records when Brown had started with them in the fifties. As well as recording his album \"Thinking About Little Willie John and Other Nice Things\", Brown had also been producing records for Hank Ballard, and now it was Bill Doggett's turn. For Doggett, Brown produced and wrote \"Honky Tonk Popcorn\":\n\n[Excerpt: Bill Doggett, \"Honky Tonk Popcorn\"]\n\nDoggett spent most of the rest of his life touring the oldies circuit, a respected organist who would play hundreds of shows a year, until his death in 1996 aged eighty. He played \"Honky Tonk\" at every show, saying \"I just wouldn't be Bill Doggett if I didn't play 'Honky Tonk'. That's what the people pay to hear, so that's what they get.\"",
  "enclosure": "",
  "itunes:summary": "Episode fifty of A History of Rock Music in Five Hundred Songs looks at \"Honky Tonk\" by Bill Doggett, and uses his career to provide a brief summary of the earlier episodes of the podcast as we're now moving forward into the next stage of the story. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Sixteen Tons\" by Tennessee Ernie Ford.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are many best-of collections of Doggett's work available. This one seems to have the best sound quality and is a decent overview of his work.\n\nInformation for this one comes from all over the place, including Shout, Sister, Shout!: The Untold Story of Rock-and-roll Trailblazer Sister Rosetta Tharpe by Gayle F Wald, Honkers & Shouters: The Golden Years of Rhythm and Blues by Arnold Shaw, and Inkspots.ca \n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWelcome to the fiftieth episode of A History of Rock Music in Five Hundred Songs. We're now ten percent of the way through our story, and also most of the way through 1956.\n\nI'm told that when history podcasts hit a big round number, it's customary for them to do a jumping-on episode, perhaps a \"story so far\" which covers everything that's been discussed up to that point, but in brief, so that new listeners can get up to speed.\n\nThat's sort of what I'm about to do here. This week, we're going to look at a hit song from 1956, but by someone whose career interacted with almost everyone in the first twenty or so episodes of the podcast.\n\nWe're going to look again at some of that old music, not as isolated records by different artists, but as stages in the career of a single individual. We're going to look at someone who was a jobbing musician, who'd take any job that was on offer, but who by virtue of just being a hard-working competent jobbing player and arranger managed to have an astonishing influence on the development of music.\n\nWhile rock and roll was primarily a vocal music, it wasn't a completely clean break with the past, and for most of the decades from the 1920s through to the early 50s, if you wanted music for dancing you would want instrumental groups. The big bands did employ vocalists, of course, but you can tell who the focus was on from looking at the names of the bands -- the Benny Goodman Orchestra, the Glenn Miller Orchestra, the Duke Ellington Orchestra, the Count Basie orchestra -- all of the leaders of the big bands were instrumentalists. They played clarinet or trombone or piano, they didn't sing.\n\nIt was only with the musicians union strikes of the 1940s, which we've talked about before, that more through necessity than anything else the music industry moved from being dominated by instrumental music to being dominated by singers. But well into the 1960s we'll still be seeing rock and roll hits that were purely instrumental. Indeed, we probably wouldn't have rock and roll guitar bands at all without instrumental groups like the Ventures in the US or the Shadows in the UK who had hits with pure instrumental records.\n\nAnd one of the greatest of the early rock and roll instrumentals was by someone who didn't actually consider himself a rock and roll musician. It's a record that influenced everyone from James Brown to the Beach Boys, and it's called \"Honky Tonk\":\n\n[Excerpt: Bill Doggett, \"Honky Tonk\"]\n\nThere is surprisingly little information out there about Bill Doggett, for someone who had such an impact on the fields of rock and roll, blues, jazz, and soul. There are no books about his life, and the only website devoted to him is one designed by his nephew, which... has all the flaws one might expect from a website put together about someone's uncle.\n\nDoggett was born in 1916 in Philadelphia, and he moved to New ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode fifty of A History of Rock Music in Five Hundred Songs looks at \"Honky Tonk\" by Bill Doggett, and uses his career to provide a brief summary of the earlier episodes of the podcast as we're now moving forward into the next stage of the story. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Sixteen Tons\" by Tennessee Ernie Ford.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are many best-of collections of Doggett's work available. This one seems to have the best sound quality and is a decent overview of his work.\n\nInformation for this one comes from all over the place, including Shout, Sister, Shout!: The Untold Story of Rock-and-roll Trailblazer Sister Rosetta Tharpe by Gayle F Wald, Honkers & Shouters: The Golden Years of Rhythm and Blues by Arnold Shaw, and Inkspots.ca \n\nP",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}