{
  "title": "Designing the Office of the Future: Building Serendipity",
  "description": "The pandemic has changed the way we work and where we work. Now, as companies try to coax their employees back to the office, they are encountering new demands and shifting expectations. In this episode, we bring you a conversation from WSJ’s CEO Council Summit between world-renowned designer Thomas Heatherwick, who has spearheaded huge office complexes including Google’s new Charleston East headquarters in California, and London Business School professor Lynda Gratton, who studies how people and organizations interact. They detail why office spaces must be flexible, but also encourage “serendipity” to facilitate vibrant and productive work. 2022 WSJ CEO Council \n\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "pubDate": "Fri, 13 May 2022 16:00:00 -0000",
  "itunes:episodeType": "full",
  "itunes:author": "The Wall Street Journal",
  "itunes:subtitle": "",
  "itunes:summary": "The pandemic has changed the way we work and where we work. Now, as companies try to coax their employees back to the office, they are encountering new demands and shifting expectations. In this episode, we bring you a conversation from WSJ’s CEO Council Summit between world-renowned designer Thomas Heatherwick, who has spearheaded huge office complexes including Google’s new Charleston East headquarters in California, and London Business School professor Lynda Gratton, who studies how people and organizations interact. They detail why office spaces must be flexible, but also encourage “serendipity” to facilitate vibrant and productive work. 2022 WSJ CEO Council \n\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "content:encoded": "<p>The pandemic has changed the way we work and <em>where</em> we work. Now, as companies try to coax their employees back to the office, they are encountering new demands and shifting expectations. In this episode, we bring you a conversation from WSJ’s CEO Council Summit between world-renowned designer Thomas Heatherwick, who has spearheaded huge office complexes including Google’s new Charleston East headquarters in California, and London Business School professor Lynda Gratton, who studies how people and organizations interact. They detail why office spaces must be flexible, but also encourage “serendipity” to facilitate vibrant and productive work. <br><a href=\"https://ceocouncil.wsj.com/\">2022 WSJ CEO Council</a><br> </p>\n<p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p>",
  "itunes:duration": 1125,
  "guid": "c3862eaa-d2d5-11ec-905e-bbfd3b089194",
  "enclosure": ""
}