{
  "id": "yt:video:tXTr4BTWj6E",
  "yt:videoId": "tXTr4BTWj6E",
  "yt:channelId": "UCS3wWlfGUijnRIf745lRl2A",
  "title": "How Does Our Ocean Affect Our Climate?",
  "link": "",
  "author": {
    "name": "FuseSchool - Global Education",
    "uri": "https://www.youtube.com/channel/UCS3wWlfGUijnRIf745lRl2A"
  },
  "published": "2021-06-09T04:00:03+00:00",
  "updated": "2022-09-03T03:32:09+00:00",
  "media:group": {
    "media:title": "How Does Our Ocean Affect Our Climate?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This World Ocean Day, FuseSchool & Incredible Oceans will be exploring the link between our ocean and climate in this month's livestream. Join oceanographer Russell Arnott and earth scientist Sophia Bolton as we explore our ocean, our climate and what you can do to get involved with climate activism. The session will end with a live Question and Answer session so get those questions ready!\n\nFuseSchool is an education charity that empowers learners around the globe by giving them access to free education. With almost half a million subscribers to their YouTube channel, FuseSchool produces stylish and impactful animated videos for every science topic.\n\nIncredible Oceans is an educational non-profit organisation that combines robust science with impactful creativity to engage audiences of all ages and demographics about our ocean and the creatures within.\n\nWatch FuseSchool videos about Climate Change\nClimate change and the natural greenhouse effect: https://youtu.be/aNWgDJxn1KE\nClimate change and the enhanced greenhouse effect: https://youtu.be/MLDSG7yR1sI\n\nAnd don't forget to SUBSCRIBE:\nFollow us: http://www.youtube.com/fuseschool\n\nJOIN us on:\nInstagram: https://www.instagram.com/fuseschool/\nFacebook: https://www.facebook.com/fuseschool/\nTwitter: https://twitter.com/fuseSchool\n\nSUPPORT US on Patreon: \nhttps://www.patreon.com/fuseschool\n\nFollow INCREDIBLE OCEANS on Twitter, Instagram, Facebook and TikTok!\nhttps://linktr.ee/incredoceans",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}