{
  "title": "Fair Data Representation for Machine Learning at the Pareto Frontier. (arXiv:2201.00292v2 [stat.ML] UPDATED)",
  "link": "http://arxiv.org/abs/2201.00292",
  "description": "<p>As machine learning powered decision making is playing an increasingly\nimportant role in our daily lives, it is imperative to strive for fairness of\nthe underlying data processing and algorithms. We propose a pre-processing\nalgorithm for fair data representation via which L2- objective supervised\nlearning algorithms result in an estimation of the Pareto frontier between\nprediction error and statistical disparity. In particular, the present work\napplies the optimal positive definite affine transport maps to approach the\npost-processing Wasserstein barycenter characterization of the optimal fair\nL2-objective supervised learning via a pre-processing data deformation. We call\nthe resulting data Wasserstein pseudo-barycenter. Furthermore, we show that the\nWasserstein geodesics from the learning outcome marginals to the barycenter\ncharacterizes the Pareto frontier between L2-loss and total Wasserstein\ndistance among learning outcome marginals. Thereby, an application of McCann\ninterpolation generalizes the pseudo-barycenter to a family of data\nrepresentations via which L2-objective supervised learning algorithms result in\nthe Pareto frontier. Numerical simulations underscore the advantages of the\nproposed data representation: (1) the pre-processing step is compositive with\narbitrary L2-objective supervised learning methods and unseen data; (2) the\nfair representation protects data privacy by preventing the training machine\nfrom direct or indirect access to the sensitive information of the data; (3)\nthe optimal affine map results in efficient computation of fair supervised\nlearning on high-dimensional data; (4) experimental results shed light on the\nfairness of L2-objective unsupervised learning via the proposed fair data\nrepresentation.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/stat/1/au:+Xu_S/0/1/0/all/0/1\">Shizhou Xu</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Strohmer_T/0/1/0/all/0/1\">Thomas Strohmer</a>"
}