{
  "title": "COP27: Ensure Climate Action is Rights-Based",
  "link": "https://www.hrw.org/news/2022/11/02/cop27-ensure-climate-action-rights-based",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        Egypt's President Abdel Fattah al-Sisi speaks during the opening ceremony of the UN Climate Change Conference COP26 in Glasgow, Scotland, November 1, 2021. \n                    © 2021 Yves Herman/Pool via AP\n          \n\n  \n<p>(Beirut) – Countries and advocates attending the 27th annual United Nations Climate Change Conference (COP27) in Egypt beginning on November 6, 2022 should take rights-based and ambitious climate action necessary to keep the global temperature increase to 1.5 degrees Celsius, Human Rights Watch said today.</p>\n\n<p>Egypt is hosting COP27 following years of intensifying restrictions on human rights and environmental groups in the country, amounting to one of the harshest government clampdowns in decades. The result has been diminished space for independent organization and assembly. The restrictions have curtailed environmental groups’ ability to carry out independent policy, advocacy, and field work essential to protecting the country’s natural environment.</p>\n\n<p>“In the days ahead, countries should make good on longstanding promises to prevent the most devastating impacts of climate change,” said Richard Pearshouse, environment director at Human Rights Watch. “At the same time, they should reaffirm to Egypt’s government and other authoritarian administrations that independent environmental activism is indispensable for the robust climate policies the world so urgently needs.”</p>\n\n<p>Governments have a human rights obligation to address climate change, including by rapidly cutting greenhouse gas emissions and helping people adapt to the impact of the climate crisis, Human Rights Watch said. At this year’s COP, governments should adopt a specific recommendation to rapidly phase out all fossil fuel use and production.</p>\n\n<p>There is growing consensus, including from the International Energy Agency and the Intergovernmental Panel on Climate Change, that for governments to meet global climate targets there cannot be new oil, gas, or coal development. Governments at COP27 should commit to ending authorization for all new fossil fuel projects. In addition, they should end all forms of support, including subsidies and international finance, for oil, gas, and coal developments to rapidly reduce emissions and to limit the human rights impacts of fossil fuels and climate change.</p>\n\n<p>Robust and rights-respecting climate action requires the full and meaningful participation of civil society. But international and Egyptian civil society groups fear that the severe restrictions imposed by the Egyptian authorities in recent years will hinder participation of journalists, activists, human rights defenders, and civil society at the COP negotiations. This includes those on the front lines of the climate crisis and populations most at risk for the harm of climate change, including Indigenous peoples, people with disabilities, older people, children and young people, women, LGBT people, minorities, and people living in poverty.</p>\n\n<p>Local Egyptian media reported on October 29 that Egyptian authorities had in previous days arrested dozens of people for calling for anti-government protests on November 11, during the conference.</p>\n\n<p>“Before delegations have set foot in Egypt, authorities have already shown their true colors by clamping down on any Egyptian who dares to call attention to the dire human rights situation in the country,” Pearshouse said. “Governments attending COP27 have a responsibility to call out Egypt’s rhetoric around tolerance and openness as what it is, empty and meaningless, and to urge Egyptian authorities to end rights restrictions.”</p>",
  "pubDate": "Wed, 02 Nov 2022 00:00:01 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/02/cop27-ensure-climate-action-rights-based"
}