{
  "title": "Inflation in Pakistan: Follow the Money",
  "link": "https://mises.org/node/60632",
  "description": "<p><em>Every theory must ultimately meet two tests: one, that of internal consistency, the other that of consistency with reality</em>.—Frank A. Fetter</p>\n<p>The great economist Ludwig von Mises played a seminal role in bringing about a paradigm shift in monetary economics resulting in a revolutionary change in our understanding of what causes inflation over the long run. In his book <em><a href=\"https://cdn.mises.org/Theory%20of%20Money%20and%20Credit.pdf\">The Theory of Money and Credit</a></em> published in 1912, he <a href=\"https://www.goodreads.com/work/quotes/148870-theorie-des-geldes-und-der-umlaufsmittel\">wrote</a>:</p>\n<blockquote><p>For hundreds, even thousands, of years, people completely failed to see that variations in the objective exchange-value of money could be induced by monetary factors. They tried to explain all variations of prices exclusively from the commodity side.</p></blockquote>\n<p>Today, once again, the specter of high inflation is haunting the world. Yet, despite its prevalence, most ordinary people, and even central bankers and economists are utterly confused about its underlying cause.</p>\n<p>Among central bankers and financial institutions this was seen when inflation first became visible in 2021 when the<a href=\"https://www.reuters.com/article/usa-fed-instant-idUSKBN2IF1S0\"> Federal Reserve</a>, the<a href=\"https://www.reuters.com/world/europe/ecb-sticks-with-transitory-description-inflation-2021-12-02/\"> European Central Bank</a>, and the <a href=\"https://www.reuters.com/article/us-usa-economy-imf-inflation-idUSKBN2BB1XR\">International Monetary Fund</a> (IMF) declared inflation to be transitory. Even the world’s leading economists misjudged inflation as Nobel Prize Economist Paul Krugman <a href=\"https://www.nytimes.com/2022/07/21/opinion/paul-krugman-inflation.html\">wrote </a>in a recent article:</p>\n<blockquote><p>Just about all the prominent players, from Larry Summers to Dean Baker, were Keynesian economists, with more or less center-left political leanings. And we all had similar views, at least in a qualitative sense, about how economic policy works.</p></blockquote>\n<p>Trying to understand major economic events by looking only at data on changes in economic aggregates, such as gross domestic product, wage rates, interest rates, and tax rates, runs the risk of missing the underlying motivations for change. Doing so is like trying to understand a religious awakening by looking at the cost of printing religious tracts.</p>\n<p>In Pakistan, it may indeed have been the cost of printing new money and increasing credit growth which have possibly contributed to a rise in monetary induced inflation today. Firstly, it is important to clarify what exactly is meant by the term inflation.</p>\n<p>Originally, inflation referred to an increase in the amount of money and credit in the economy. In other words, inflation meant that the money stock had been inflated by the government or central bank through a policy of credit expansion, viz. Money printing. Moreover, rising prices were understood as a potential symptom of inflation, but not as inflation itself.</p>\n<p>However, this traditional conceptualization of inflation fell out of fashion during the twentieth century and economists began to talk about inflation in terms of rising prices, not money creation. Thus, to avoid confusion and to be as precise as possible, I shall refer to inflation proper as monetary inflation and a general rise in prices as price inflation.</p>\n<p>It is important to understand that this distinction is not mere semantics, it is vital to bear this distinction in mind if the true causes of generally rising prices are to be fully understood. Understanding the factors that drive inflation is fundamental to designing monetary policy.</p>\n<p>For instance, in their review February 2022 for Pakistan, the IMF ignored the potential impact of monetary inflation despite acknowledging in the <a href=\"https://www.imf.org/en/Publications/CR/Issues/2022/02/04/Pakistan-2021-Article-IV-Consultation-Sixth-Review-Under-the-Extended-Arrangement-Under-the-512715\">report </a>broad money supply and increase to private sector credit had risen by 16.2 percent and 11.5 percent respectively over during the last financial year 2020–21 as well as a further 15.8 percent increase in broad money supply and 16 percent private sector credit during the currency financial year 2021–22.</p>\n<p>Opting for the definition of inflation as merely price inflation, the IMF <a href=\"https://www.imf.org/en/Publications/CR/Issues/2022/02/04/Pakistan-2021-Article-IV-Consultation-Sixth-Review-Under-the-Extended-Arrangement-Under-the-512715\">predicted </a>the economy of Pakistan to witness a</p>\n<blockquote><p>temporar[y] increase in the coming months and average 9.4 percent in FY 2022 due to the recent terms of trade shock, continued energy price adjustments, and GST reforms. It is expected to be within the SBP’s 9–11 percent inflation range forecast in the next 12 months, before slowing to 6.5 percent over the medium term.</p></blockquote>\n<p>Yet today inflation in Pakistan was recorded at <a href=\"https://tribune.com.pk/story/2369084/inflation-rate-highest-since-great-recession\">25 percent in July 2022</a>, which was the highest level since the Great Financial Crisis of 2008 almost 14 years ago (see below).</p>\n<p class=\"text-center\"><strong>Figure 1: Consumer Price Index Inflation in Pakistan</strong></p>\n<div class=\"media media-element-container media-default media-wysiwyg-align-center\"><div id=\"file-136422\" class=\"file file-image file-image-png\">\n\n        <h2 class=\"element-invisible\"><a href=\"/files/picture1png-22\">picture1.png</a></h2>\n    \n  \n  <div class=\"content\">\n              <img alt=\"Sikander1\" class=\"media-element file-default\" data-delta=\"1\" typeof=\"foaf:Image\" src=\"https://cdn.mises.org/styles/max_full/s3/picture1_22.png?itok=ja-Kie8k\" width=\"624\" height=\"271\" />      </div>\n\n  \n</div>\n</div>\n<h6 class=\"text-center\"><strong>Source: Pakistan Bureau of Statistics.</strong></h6>\n<p>What can explain this divergence? Certainly in the long run, inflation is considered to be—as <a href=\"https://harris.uchicago.edu/files/monetaryhistory_1.pdf\">Milton Friedman (1963)</a> stated—always and everywhere a monetary phenomenon (monetary inflation). However, the State Bank of Pakistan has pointed to supply-side developments in explaining inflation. This structuralist school of thought holds that supply constraints that drive up prices of specific goods can have wider repercussions on the overall price level.</p>\n<p>In Pakistan, former State Bank of Pakistan governor Reza Baqir <a href=\"https://profit.pakistantoday.com.pk/2021/11/28/what-is-reza-baqir-thinking/\">stated </a>that the “driver of inflation is a surge in domestic and international commodity prices such as food and oil and monetary policy does not have control to bring international commodity prices down..”</p>\n<p>As such, the question of whether money or commodity prices drives inflation is not merely academic but has profound implications for economic policy. If inflation is a monetary phenomenon, it is the responsibility of the central bank and the fiscal authorities to achieve price stability.</p>\n<h4>What Drives Inflation in Pakistan: Money or Commodity Prices?</h4>\n<p>The argument I present is that the high rate of inflation Pakistan currently faces is as much a result of an increase in commodity prices as monetary policies followed by the State Bank of Pakistan since 2020. To show how this higher-than-expected rate of inflation that the Pakistan experiences today was indeed the result of monetary inflation—i.e., an increase in the broad money supply and increase in the supply of private sector credit, we turn to a paper authored by IMF economist Axel Schimmelpfennig and Mohsin Khan in 2006 titled “<a href=\"https://www.jstor.org/stable/41260752\">Inflation in Pakistan</a>.”</p>\n<p>This paper <a href=\"https://www.imf.org/en/Publications/WP/Issues/2016/12/31/Inflation-in-Pakistan-Money-or-Wheat-18793\">examined </a>the relative importance of monetary factors and structuralist supply-side factors for inflation in Pakistan. A stylized inflation model was specified that includes standard monetary variables (money supply, credit to the private sector), exchange rate, as well as wheat support price as a supply-side factor. The model is estimated for the period January 1998 to June 2005 monthly.</p>\n<p>The results indicated that monetary factors played a dominant role in inflation, affecting inflation with a lag of about one year. Changes in the wheat support price influence inflation in the short run, but not in the long run. The results of the analysis are visible in the diagram below.</p>\n<p class=\"text-center\"><strong>Figure 2: Average Annual Inflation and Monetary Growth, January 1999–January 2005 (as a percent)</strong></p>\n<div class=\"media media-element-container media-default media-wysiwyg-align-center\"><div id=\"file-136423\" class=\"file file-image file-image-png\">\n\n        <h2 class=\"element-invisible\"><a href=\"/files/picture2png-18\">picture2.png</a></h2>\n    \n  \n  <div class=\"content\">\n              <img alt=\"Sikander2\" class=\"media-element file-default\" data-delta=\"2\" typeof=\"foaf:Image\" src=\"https://cdn.mises.org/styles/max_full/s3/picture2_18.png?itok=pOsY7c2Y\" width=\"624\" height=\"365\" />      </div>\n\n  \n</div>\n</div>\n<h6 class=\"text-center\"><strong>Source: </strong>Mohsin S. Khan, and Axel Schimmelpfennig. “<a href=\"http://www.jstor.org/stable/41260752\">Inflation in Pakistan</a>,” <em>Pakistan Development Review</em> 45, no. 2 (Summer 2006): 185–202<strong>.</strong></h6>\n<p>Looking at inflation in Pakistan today we see a similar trend today. First, there is a rapid increase in the broad money supply of the country visible in the diagram below. We note that the total money supply in the country printed since January 2020 increased 44 percent, the largest such increase in history.</p>\n<p class=\"text-center\"><strong>Figure 3: Pakistan Broad Money Supply (M2)</strong></p>\n<div class=\"media media-element-container media-default media-wysiwyg-align-center\"><div id=\"file-136424\" class=\"file file-image file-image-png\">\n\n        <h2 class=\"element-invisible\"><a href=\"/files/picture3png-12\">picture3.png</a></h2>\n    \n  \n  <div class=\"content\">\n              <img alt=\"Sikander3\" class=\"media-element file-default\" data-delta=\"3\" typeof=\"foaf:Image\" src=\"https://cdn.mises.org/styles/max_full/s3/picture3_12.png?itok=BZb4kuL7\" width=\"624\" height=\"273\" />      </div>\n\n  \n</div>\n</div>\n<h6 class=\"text-center\"><strong>Source: State Bank of Pakistan.</strong></h6>\n<p>It must be noted that printing new money is not inflationary by itself. However, as I wrote in a <a href=\"https://blogs.lse.ac.uk/businessreview/2021/11/25/printing-money-can-be-a-hidden-form-of-taxation/\">previous article</a>, when governments run massive fiscal deficits, policies of quantitative easing when combined with printing money can be highly inflationary if the funds go out into the broad money supply and further out into commercial bank deposits from the public—i.e., growth in private sector credit. We see this trend in Pakistan in the diagram below.</p>\n<p class=\"text-center\"><strong>Figure 4: Inflation and Monetary Growth, Fiscal Year 2019-2022</strong></p>\n<div class=\"media media-element-container media-default media-wysiwyg-align-center\"><div id=\"file-136425\" class=\"file file-image file-image-png\">\n\n        <h2 class=\"element-invisible\"><a href=\"/files/picture4png-9\">picture4.png</a></h2>\n    \n  \n  <div class=\"content\">\n              <img alt=\"Sikander4\" class=\"media-element file-default\" data-delta=\"4\" typeof=\"foaf:Image\" src=\"https://cdn.mises.org/styles/max_full/s3/picture4_9.png?itok=VrFugUal\" width=\"624\" height=\"268\" />      </div>\n\n  \n</div>\n</div>\n<h6 class=\"text-center\"><strong>Source: Author's calculations based on IMF, Pakistan Bureau of Statistics, and State Bank of Pakistan data.</strong></h6>\n<p>The empirical results presented in this blog show that monetary factors determine inflation in Pakistan. Broad money growth and private sector credit growth are the key variables that explain inflation developments with a lag of around twelve months. A long-run relationship exists between the Consumer Price Index and private sector credit. Commodity prices of oil and food prices affect inflation in the short run, but not in the long run. The answer to the question “money or commodity prices?” Is “money!”</p>\n<h4>Summary and Conclusions</h4>\n<p>Pakistan’s growth record since the 1970s underscores that high and persistent inflation is harmful to growth (see figure below). Periods of high inflation have coincided with low growth spells, while high growth episodes tend to be associated with a low inflation environment. Considering the empirical thresholds beyond which inflation harms growth and financial development, the State Bank of Pakistan’s overarching objective should first and foremost focus its attention on price stability.</p>\n<p class=\"text-center\"><strong>Figure 5: Pakistan Real per Capita Growth and CPI Inflation since 1975</strong> </p>\n<div class=\"media media-element-container media-default media-wysiwyg-align-center\"><div id=\"file-136426\" class=\"file file-image file-image-png\">\n\n        <h2 class=\"element-invisible\"><a href=\"/files/picture5png-6\">picture5.png</a></h2>\n    \n  \n  <div class=\"content\">\n              <img alt=\"Sikander5\" class=\"media-element file-default\" data-delta=\"5\" typeof=\"foaf:Image\" src=\"https://cdn.mises.org/styles/max_full/s3/picture5_6.png?itok=AadR6gW7\" width=\"624\" height=\"288\" />      </div>\n\n  \n</div>\n</div>\n<h6 class=\"text-center\"><strong style=\"text-align: center;\">Source: Author's calculations based on IMF, Pakistan Bureau of Statistics and State Bank of Pakistan data.</strong></h6>\n\n",
  "author": "Muneeb Sikander",
  "enclosure": "",
  "guid": 60632,
  "pubDate": "Thu, 03 Nov 2022 11:00:00 -0500",
  "source": "Mises Wire"
}