{
  "id": "yt:video:oHSDDHLDGaQ",
  "yt:videoId": "oHSDDHLDGaQ",
  "yt:channelId": "UCW39zufHfsuGgpLviKh297Q",
  "title": "Environmentalists in danger | DW Documentary",
  "link": "",
  "author": {
    "name": "DW Documentary",
    "uri": "https://www.youtube.com/channel/UCW39zufHfsuGgpLviKh297Q"
  },
  "published": "2022-10-29T16:00:25+00:00",
  "updated": "2022-11-02T18:45:29+00:00",
  "media:group": {
    "media:title": "Environmentalists in danger | DW Documentary",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The fight against the destruction of nature is a dangerous one. Around the globe, people are risking their lives to protect the environment and climate. When environmentalists’ activities disrupt organized crime and other illegal profiteers, they are sued, threatened and even murdered.\n\nAccording to the organization Global Witness, 227 environmental activists were killed in 2020 alone, and the number of unreported cases is probably much higher. In addition to environmentalists, indigenous people who fight illegal land grabs and journalists who report on environmental crimes are often also in grave danger. This documentary accompanies those for whom fighting for the environment is dangerous work.\n\nThe filmmakers travel to Nigeria, a country known for its oil wealth. But in parts of the Niger Delta, people suffer due to leaking oil pipelines. Huge areas are contaminated with oil, leading to empty fishing nets, polluted water, contaminated fields and a high mortality rate. Many people are starving. And they are as good as defenseless, because anyone who resists the oil mafia is threatened or even killed.\n\nIn Peru, non-governmental organizations and indigenous people are up against international corporate interests that exploit the rainforest. Illegal palm oil, cocoa and coffee plantations are tearing huge holes in the jungle. Added to this is the overexploitation of tropical timber and, more recently, the production of cocaine. For those who want to protect the Amazon rainforest, the work is extremely dangerous.\n\nIn Europe, too, the pressure on environmentalists is growing. Due to an increase in timber and energy prices, illegal logging in Romania's forests is becoming more and more profitable for criminals. And those who work to uncover the illegal business live in fear of retribution. \n\n#documentary #dwdocumentary #activism #environment #mafia \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: \n⮞ DW Documentary (English): https://www.youtube.com/dwdocumentary\n⮞ DW Documental (Spanish): https://www.youtube.com/dwdocumental\n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/dwdocarabia\n⮞ DW Doku (German): https://www.youtube.com/dwdoku\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/dwdochindi\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}