{
  "title": "TU68: Separation at the Border – Compounding Trauma and Insecurity",
  "link": "https://therapistuncensored.com/episodes/tu68-separation-at-the-border-compounding-trauma-and-insecurity/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu68-separation-at-the-border-compounding-trauma-and-insecurity",
  "pubDate": "Mon, 02 Jul 2018 15:09:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=6184",
  "description": "Separation at the Border – Compounding Trauma and Insecurity\n“Security” at the border? Relational science professionals have a lot to offer to understand the human rights event that is unfolding on the US-Mexico border. This podcast has been all about promoting security in ourselves and our loved ones, and a primary component to this is access to your caregiver when you are young. It effects our biology, or persistent sense of ourselves and our view of the world. But it works both ways… Stress and fear that is ongoing also has the same persistent thumbprint as well.\n\nThe consequences of forced separation on top of the stressors many of these immigrant children have already endured may well have lifelong impact on their body and minds, and we will talk about why and how this occurs. Regardless of your political leanings, the separation of immigrant children from their parents from any international border is a distressing situation. We’ll discuss the specifics and its impact on human development, particularly toxic stress, broken trust and the epigenetics of these biological imprints.\n\nWe will also provide things you can do to manage stress yourself, and to help at the border if you are moved to do so.\n\n0:00-5:00\n\nIntroduction\n\nOverview of situation on the United States-Mexico border and its impact on human development\n\n5:00-10:00\n\nBiology of your body wanting to return to a “safe haven” when threatened\n\nAttachment, separation and child development\n\n10:00-15:00\n\nSeparation of children from attachment figure and its mental strain, toxic stress and its impact on the bodies\n\nBiological impact of trust and lack thereof\n\n15:00-20:00\n\nThe epigenetics of broken trust and toxic stress\n\nDysregulation of parents who’ve lost their children\n\n20:00-25:00\n\nSecondary stress, unregulated cortisol in any situation can be harmful eventually.\n\nCall to mindfulness, and action as a thoughtful response. It’s ok to down regulate by filtering news and social media, take care of yourself until you can act. It’s a privilege but when you keep your heart on-line and stay mindful you can be more effective.\n\nWrap up and outro\n\n\n\nWe appreciate our sponsor TheraNest! If you are a mental health professional, you will too! Most of us do not want to spend our time on the business aspect of our practice.\n\nTheraNest is a practice management software that will help you streamline and manage your entire practice with ease. They provide HIPPA compliant documentation, full-featured calendar (even with text reminders!), insurance and client billing, credit card processing and live customer service. Our listeners receiving 20% discount on first three months if you sign up with TheraNest.com/Therapistuncensored. You can click above and check it out.\n\nResources:\n\nSeparation is Never Ending Attachment is a Human Right, Psychology Today Jesse Borelli Blog and\n\nCo-authored by Alicia Lieberman, Anna Maria Speranza, Anne Rifkin-Graboi, Carlo Schuengel, Charles Zeanah, Daniel Siegel, Dante Cicchetti, David Pederson, Debby Jacobvitz, Elizabeth Carlson, Erik Hesse, Frances Nkara, Gottfried Spangler, Howard Steele, Jean-François Bureau, Jessie Borelli. Jody Todd Manly, Jude Cassidy. Judith Solomon, Karlen Lyons-Ruth, Kazuko Behrens, Kristin Bernard, L. Alan Sroufe, Marian Bakermans-Kranenburg, Marinus van IJzendoorn, Mary Dozier, Mary Main, Mary True, Miriam Steele, Naomi Bahm, Pasco Fearon, Pehr Granqvist, Peter Fonagy, Robbie Duschinsky, Robert Weigand, Ruth Goldwyn, Samantha Reisz, Sheree Toth, Sheri Madigan, Sophie Reijman & Susan Spieker\n\nhttps://www.npr.org/2018/06/29/624789871/president-trumps-new-plan-isnt-to-separate-migrant-families-but-to-lock-them-up\n\nWhat to do?\n\nMany of us have the undeserved privilege of being able to modulate intake of news and social media to reduce our sense of overwhelm. We aren’t against this, we are just acknowledging that some people cannot tune out the traumas occurring in their lives...",
  "enclosure": "",
  "itunes:subtitle": "Separation at the Border – Compounding Trauma and Insecurity “Security” at the border? Relational science professionals have a lot to offer to understand the human rights event that is unfolding on the US-Mexico border.",
  "itunes:summary": "\"Security\" at the border?  Relational science professionals have a lot to offer to understand the human rights event that is unfolding on the US-Mexico border.  This podcast has been all about promoting security in ourselves and our loved ones, and a primary component to this is access to your caregiver when you are young.  It effects our biology, or persistent sense of ourselves and our view of the world.  But it works both ways... Stress and fear that is ongoing also has the same persistent thumbprint as well.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "22:46"
}