{
  "id": "https://bibleinoneyear.org/en/youth/276",
  "title": "Day 276: The Key to Contentment",
  "description": "Proverbs 24:5-14, Jeremiah 6:16, Philippians 4:6–19. The apostle Paul found the key to a life of peace and contentment in times of trouble  He tells the Philippians how to find peace and shares *the secret of being content* (Philippians 4:12)",
  "pubDate": "Sun, 03 Oct 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/276/?ignore",
  "itunes:duration": "15:15",
  "guid": "enyouth03102021-276",
  "length": 915.54,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 276: The Key to Contentment",
  "itunes:subtitle": "Proverbs 24:5-14, Jeremiah 6:16, Philippians 4:6–19. The apostle Paul found the key to a life of peace and contentment in times of trouble  He tells the Philippians how to find peace and shares *the secret of being content* (Philippians 4:12)",
  "itunes:summary": "I was speaking with a friend who is not a Christian. He is a charming and delightful person. He is a successful businessman and has made a great deal of money. He has a wonderful wife, a good marriage and a great family. Yet he spoke to me of the deep emptiness in his life, and the lack of peace and contentment he experiences.\n‘Content makes poor men rich; discontent makes rich men poor,’ said the American Statesman, Benjamin Franklin. Few people seem to be genuinely content. As Martin Luther once said, ‘Contentment is a rare bird, but it sings sweetly in the breast.’\nThe Bible never promises that we will not face hard times or difficult situations. But it does promise us God’s strength and grace in these times.\nThe apostle Paul found the key to a life of peace and contentment in times of trouble. He tells the Philippians how to find peace and shares the secret of being content (Philippians 4:12).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 276
}