{
  "title": "120: Without Charity",
  "link": "https://audioboom.com/posts/7501160",
  "itunes:episode": 120,
  "itunes:title": "Without Charity",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 2957,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In the fall of 2000, three construction workers were brutally murdered on a job site in rural Indiana. A police investigation leads to three men. But digging a little deeper, investigators discover a young woman named Charity Payne. The police come to believe that 18-year-old Charity was the mastermind behind the murders. Charity claims she had nothing to do with it. Charity's friends seem to know that the truth is somewhere in between.<br>\n<br>\n<strong>WE'RE LAUNCHING A NEW PODCAST!</strong> <a href=\"https://www.obsessedwithpod.com/\">(Take a listen to the preview here!) </a>\"Obsessed With: Abducted In Plain Sight\" is a 4-part podcast series hosted by Patrick Hinds and Skye Borgman, the director of <em>Abducted in Plain Sight. </em>The podcast takes you behind the scenes of the smash hit documentary by sharing new interview with Jan and her parents, deleted scenes, AN INSANE PLOT LINE THAT LEFT OUT OF THE FILM THAT YOU WON'T BELIEVE, and audio journal recorded by the kidnapper himself and later recovered by the FBI. <a href=\"https://www.obsessedwithpod.com/\">LISTEN AND SUBSCRIBE! </a><br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 100 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 11 Feb 2020 05:00:00 +0000",
  "guid": "tag:audioboom.com,2020-02-11:/posts/7501160",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}