{
  "title": "S1 E4: Spirituality: The Exploration of Consciousness",
  "link": "https://live-sounds-true-podcast.pantheonsite.io/podcast/episode-4-spirituality-the-exploration-of-consciousness/",
  "pubDate": "Wed, 21 Jul 2021 15:00:37 +0000",
  "guid": "https://resources.soundstrue.com/?post_type=podcast&#038;p=9229",
  "description": "What do psychology and spirituality have in common? In this podcast, Michael Singer discusses how both psychology and spirituality help us illuminate the nature of the human mind and the mystery of consciousness. When we resist experiences we find uncomfortable, he explains, we begin to \"make a mess\" of our inner lives. Through the teachings and practices made available in spirituality and psychology, we can do the work of cleaning things up, purifying the flow of our life-force energy and returning to the ecstatic states we were meant to live in.",
  "content:encoded": "<p><span style=\"font-weight: 400;\">What do psychology and spirituality have in common? In this podcast, Michael Singer discusses how both psychology and spirituality help us illuminate the nature of the human mind and the mystery of consciousness. When we resist experiences we find uncomfortable, he explains, we begin to &#8220;make a mess&#8221; of our inner lives. Through the teachings and practices made available in spirituality and psychology, we can do the work of cleaning things up, purifying the flow of our life-force energy and returning to the ecstatic states we were meant to live in. </span></p>\n",
  "enclosure": "",
  "itunes:subtitle": "What do psychology and spirituality have in common? In this podcast, Michael Singer discusses how both psychology and spirituality help us illuminate the nature of the human mind and the mystery of consciousness.",
  "itunes:summary": "What do psychology and spirituality have in common? In this podcast, Michael Singer discusses how both psychology and spirituality help us illuminate the nature of the human mind and the mystery of consciousness. When we resist experiences we find uncomfortable, he explains, we begin to \"make a mess\" of our inner lives. Through the teachings and practices made available in spirituality and psychology, we can do the work of cleaning things up, purifying the flow of our life-force energy and returning to the ecstatic states we were meant to live in.",
  "itunes:author": "Michael Singer",
  "itunes:image": "",
  "itunes:duration": "1:08:51"
}