{
  "title": "S14 Ep2: Under the Control of MK Ultra",
  "link": "https://audioboom.com/posts/8098628",
  "itunes:episode": 2,
  "itunes:title": "Under the Control of MK Ultra",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4592,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS dives head first into the deep state and visits with a man named Randy, who was recruited by MK Ultra at a young age and exploited.<br>\n<br>\nRandy's life was then infused with everything from illicit sex parties, to government assassinations, to encounters with aliens, and he has come to us to bravely share his stories!<br>\n<br>\nCheck out Randy's Facebook page with pictures and evidence of his time in MK Ultra here:  <a href=\"https://www.facebook.com/profile.php?id=100009933761469\">https://www.facebook.com/profile.php?id=100009933761469</a><br>\n<br>\nCreate a free account on <a href=\"http://BetOnline.AG\">BetOnline.AG</a> and use the promocode “PodcastOne” to receive a 50% SIGN UP bonus. •\tGo online or use your Mobile phone to sign up today.   And try in-game live betting where you can participate with all the action with every play.    Use the promocode: PodcastOne for a 50% signup bonus and get your holiday shopping done early with their Refer a Friend Promotion! <a href=\"http://Betonline.AG\">Betonline.AG</a>.<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nRobinhood is an investing app that lets you buy and sell stocks, ETFS, options, and cryptos- all commission-free.  Robinhood is giving listeners a FREE stock like Apple, Ford, or Sprint to help build your portfolio! Sign up at <a href=\"http://darkness.robinhood.com\">darkness.robinhood.com</a>.",
  "itunes:summary": "BEYOND the DARKNESS dives head first into the deep state and visits with a man named Randy, who was recruited by MK Ultra at a young age and exploited.\n\nRandy's life was then infused with everything from illicit sex parties, to government...",
  "pubDate": "Sun, 06 Jan 2019 10:00:00 +0000",
  "guid": "344ae066-1f2c-4a9e-80f4-1f9626b07354",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}