{
  "title": "S1E17 - When the Competitive Spark Is Reignited with Gymnast Chellsie Memmel",
  "guid": "https://pinecast.com/guid/cf0512c1-1a9e-4c5e-b105-83f5fc3fc4c1",
  "pubDate": "Tue, 29 Sep 2020 06:30:00 -0000",
  "itunes:duration": "01:01:10",
  "description": "<p>The gymnast in Laura is geeking out more than a little bit this week as she welcomes six-time World medalist and Olympic Silver medalist, Chellsie Memmel, to the podcast today. In addition to being only the third U.S. woman to achieve World all-around gold, Chellsie led Team USA to its first-ever World team gold medal in 2003, earned the all-around silver medal at the 2011 CoverGirl Classic, and has served as an official at the 2016 P&G Gymnastics Championship and the 2016 U.S. Olympic Trials for women's gymnastics. Currently, she is preparing for her comeback with an eye to the 2021 Olympics, and she talks about that and so much more in her conversation with Laura here today.</p>\n<p>Chellsie and Laura cover her entire gymnastics career all the way from her beginnings in the sport up to her recent comeback attempt, and explore the very high moments of her many successes, as well as the many times that injuries impacted not only her ability to perform, but also her mindset. Throughout this review of her career, they also discuss the role her father played in coaching her, the role that both parents played in helping her during her times of recovery, the importance of acknowledging, grieving and moving past injuries, and how different her training, mindset, and confidence are now during her comeback. They conclude with a description of Chellsie’s current YoutTube channel videos, and just how much Laura loves them. Chellsie Memmel’s tale of success and perseverance through injuries is a truly inspirational one not only for athletes but for all who experience setbacks in pursuing their goals. There is so much that she has learned from these experiences, and she shares it all in this week’s thoroughly intriguing episode.</p>\n<p>Episode Highlights:</p>\n<p>·       How Chellsie got started in gymnastics\n·       The highs and lows of her competitive career\n·       Having her father coach her\n·       Her many accomplishments in 2005\n·       Chellsie’s shoulder injury and her parents’ help during recovery\n·       Acknowledging, grieving, and moving past the impact of an injury\n·       Her story of qualifying for Beijing and her experience at those Games\n·       Olympic processing\n·       Maintaining her mindset\n·       What she did after Beijing\n·       Celebrating her career\n·       The story of her current comeback\n·       The pandemic’s impact for Chellsie\n·       The hardest part and most surprising part of coming back\n·       Her mindset and confidence now\n·       A typical day for Chellsie now\n·       The current gymnastics qualifying process\n·       Her weekly videos</p>\n<p>Quotes:</p>\n<p>“You’re kind of coaching him on how to coach you.”</p>\n<p>“What are you learning from this situation so you can get better?”</p>\n<p>“It was just, like, sheer mental strength at that time of just being able to pull that out…so that part of it was not great.”</p>\n<p>“Looking back now, I can be super proud of what we did, but just in that moment, it was tough and it was bittersweet.”</p>\n<p>“You’re like the Bionic Woman!”</p>\n<p>“It is so amazing like, how competitive I truly am, like, when it’s something…that I care about.”</p>\n<p>“I always tried to use gymnastics as a way to get in shape, and this is the exact opposite.”</p>\n<p>“The gym just is empty – it needs gymnastics, so I started doing more.”</p>\n<p>“I want to be able to give something my all.”</p>\n<p>“Don’t stand in your own way of doing something just because you know how hard it’s going to be.”</p>\n<p>“It’s keeping me healthy, it’s keeping me sane…but I’m still making progress.”</p>\n<p>“To be doing better than I ever was before…I just attribute that to the kind of conditioning that I’m doing and the different appreciation I have for my body and how I am treating it and conditioning it.”</p>\n<p>“I just obviously know from experience that a positive attitude is always much better to have.”</p>\n<p>“I already feel like I’ve won.”</p>\n<p>“It’s been really cool to share this process…I feel like it’s really neat to have people be a part of the journey…to also see the struggle and to see me getting nervous when I’m trying something new.”</p>\n<p>“Take a little bit of time for yourself…I think it will make everybody happier.”</p>\n<p>Links:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a> \nMental Training:   <a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">https://www.laurawilkinson.com/learn</a> \nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a> \nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a></p>\n<p>Connect with Chellsie:</p>\n<p>Instagram: <a href=\"https://www.instagram.com/cmemmel23/\" rel=\"nofollow\">https://www.instagram.com/cmemmel23/</a> </p>\n<p>YouTube: <a href=\"https://www.youtube.com/c/ChellsieMemmel23\" rel=\"nofollow\">https://www.youtube.com/c/ChellsieMemmel23</a> </p>\n<p>Twitter: <a href=\"https://twitter.com/CMemmel\" rel=\"nofollow\">https://twitter.com/CMemmel</a> </p>\n<p>Website: <a href=\"https://chellsie-memmel.com/\" rel=\"nofollow\">https://chellsie-memmel.com/</a></p>",
  "itunes:title": "When the Competitive Spark Is Reignited with Gymnast Chellsie Memmel",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 17
}