{
  "guid": "urn:uuid:875e2103-4ad8-4c37-a3b1-535f890c1e20",
  "link": "https://www.who.int/news/item/02-03-2022-world-leaders-and-experts-call-for-action-to-protect-the-environment-from-antimicrobial-pollution",
  "a10:author": {
    "a10:name": ""
  },
  "title": "World leaders and experts call for action to protect the environment from antimicrobial pollution",
  "description": "<p><em>World leaders and experts today called for global action to reduce antimicrobial pollution recognising this as critical to combatting rising levels of drug resistance and protecting the environment. </em></p><p>The&nbsp;<a href=\"http://amrleaders.org/\">Global Leaders Group on Antimicrobial Resistance</a><span style=\"text-decoration:underline;\"> </span>today called on all countries to reduce the amount of antimicrobial waste entering the\n    environment. This includes researching and implementing measures to safely dispose of antimicrobial waste from food, human health and animal health systems, and manufacturing facilities.</p><p>The call comes ahead of the <a href=\"https://www.unep.org/environmentassembly/\">UN Environment Assembly</a> which takes place in Nairobi and online from 28 February to 2 March 2022 where countries will discuss the world&rsquo;s\n    most pressing environmental challenges.</p><p>The Global Leaders Group on Antimicrobial Resistance includes heads of state, government ministers, and leaders from private sector and civil society. The group was established in November 2020 to accelerate global political momentum, leadership and action\n    on antimicrobial resistance (AMR) and is co-chaired by Their Excellencies Mia Amor Mottley, Prime Minister of Barbados, and Sheikh Hasina, Prime Minister of Bangladesh.</p><p><strong>Antimicrobial drug waste is polluting the environment</strong></p><p>The Global Leaders Group&rsquo;s <a href=\"https://www.amrleaders.org/resources/m/item/reducing-antimicrobial-discharges-from-food-systems-manufacturing-facilities-and-human-health-systems-into-the-environment\">call to action</a> calls for all countries to improve measures&nbsp; for the management and disposal of antimicrobial-containing waste and runoff from manufacturing sites, farms, hospitals and other sources.</p><p>Antimicrobials given to humans, animals and plants are entering the environment and water sources (including drinking water sources) via wastewater, waste, run-off and sewage and through this spreading drug-resistant organisms and antimicrobial resistance.</p><p>This could fuel a rise in the emergence and spread of &lsquo;superbugs&rsquo; that are resistant to several types of antimicrobial drugs [1]. It could also harm organisms in the environment.</p><p><strong>Reducing the amount of antimicrobial pollution entering the environment is crucial to conserving the effectiveness of antimicrobial medicines&nbsp; </strong></p><p>The Global Leaders Group calls for all countries to develop and implement regulations and standards to better monitor and control the distribution and release of antimicrobials and drug-resistant organisms into the environment.</p><p>Other key actions include:</p><ol><li>In the manufacturing sector, developing national antimicrobial manufacturing pollution standards to better control and monitor antimicrobial pollution.</li><li>In the human and animal health sector, enforcing laws and policies to reduce or eliminate antimicrobial use that is not under the guidance of a trained healthcare provider.</li><li>In food systems, implementing standards to treat and manage discharge from food-animal farms, aquaculture farms and crop fields.</li></ol><p><strong>Inaction will have dire consequences for human, animal, plant and environmental health </strong></p><p>Antimicrobial drugs, including antibiotics, antifungals and antiparasitics, are used in human and veterinary medicine all over the world. They are used to treat and prevent diseases in humans and animals, and sometimes in food production to promote growth\n    in healthy animals. Antimicrobial pesticides are also used in agriculture to treat and prevent diseases in plants.</p><p>Current antimicrobial drug usage in humans, animals and plants is leading to a concerning rise in drug-resistance and making infections harder to treat.</p><p>Drug-resistant microbes and disease-causing pathogens can pass between humans, animals, plants and food, and in the environment. </p><p>The climate crisis may also be contributing to a rise in antimicrobial resistance. [2]</p><p>Drug-resistant diseases contribute to nearly <a href=\"https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)02724-0/fulltext\">5 million deaths every year</a>. Urgent action is needed to curb the rise and spread of\n    antimicrobial resistance across all countries. Without action, the world is rapidly approaching a tipping point where the antimicrobials needed to treat infections in humans, animals and plants will no longer be effective.</p><p>The impact on local and global health systems, economies, food security and food systems will be devastating.</p><div><p>&ldquo;<em>The connections between antimicrobial resistance, environmental health and the climate crisis are becoming increasingly stark.</em>&rdquo;<em> </em>says co-chair of the Global Leader Group on Antimicrobial Resistance, Her Excellency Mia\n        Amor Mottley, Prime Minister of Barbados<em>. </em>&ldquo;<em>We must act now to protect the environment, and people everywhere, from the damaging effects of antimicrobial pollution.</em>&rsquo;&rsquo;</p><p><strong>Understanding and managing global antimicrobial pollution should be a priority for all countries </strong></p><p>While the exact scale of global antimicrobial pollution is unknown, evidence indicates that it could have significant impacts on antimicrobial resistance. For example, multi-drug resistant bacteria are already prevalent in marine waters and sediments\n        close to aquaculture, industrial and municipal discharges. [3]</p><p>People in all countries can play a role by ensuring they dispose of expired and unused medicines correctly.</p><p>Investors can also contribute by investing in the research and development of cost-effective and greener waste management technologies.</p><p>_____________________________________________________</p></div><p>[1] UNEP (2017). &lsquo;<em>Frontiers 2017 Emerging Issues of Environmental Concern&rsquo;</em>. Available <a href=\"https://www.unep.org/resources/frontiers-2017-emerging-issues-environmental-concern\">here</a>.</p><p>[2] Global Leaders Group on Antimicrobial Resistance. (2021) <em>&rsquo;Antimicrobial Resistance and the Climate Crisis&rsquo;</em>. Available <a href=\"https://www.amrleaders.org/resources/m/item/antimicrobial-resistance-and-the-climate-crisis\">here.</a>\n <span style=\"text-decoration:underline;\"></span></p><p>[3] UNEP (2017). &lsquo;<em>Frontiers 2017 Emerging Issues of Environmental Concern&rsquo;</em>. Available <a href=\"https://www.unep.org/resources/frontiers-2017-emerging-issues-environmental-concern\">here</a>.</p><p><strong>&nbsp;</strong></p><h2>Notes to Editors:<br /></h2><p align=\"center\" style=\"text-align:center;\"><strong>Reducing Antimicrobial Discharges from Food Systems, Manufacturing Facilities and Human Health Systems into the Environment</strong>&nbsp;<strong></strong></p><p align=\"center\" style=\"text-align:center;\"><strong>Call to Action by the Global Leaders Group on Antimicrobial Resistance</strong>&nbsp;<br /></p><p>March 2022<strong></strong></p><p>Disposal of untreated or inappropriately managed waste and runoff from various sources including food systems, manufacturing facilities and human health systems can contain biologically active antimicrobials, antimicrobial resistant organisms, unmetabolized\n    antimicrobials and antimicrobial resistance determinants (e.g. resistance-conferring genes) that are released into the environment. These discharges can contaminate the environment and contribute to the spread of antimicrobial resistance (AMR). The\n    most important approach to controlling AMR spread from food systems and human health systems is responsible and sustainable use of antimicrobials in humans, terrestrial and aquatic animals and plants/crops.&nbsp; In addition, adequate measures to\n    treat and safely dispose of waste are required, including human, animal and manufacturing waste.&nbsp;&nbsp;</p><p>The GLG commends ongoing efforts - particularly by the G7 countries - to address antimicrobial discharges into the environment and encourages countries to implement the Codex Code of practice to minimize and contain foodborne AMR and Guidelines on Integrated\n    Monitoring and Surveillance of Foodborne Antimicrobial Resistance approved in November 2021.&nbsp;</p><p>To improve the management of discharges into the environment that may contribute to the emergence and spread of antimicrobial resistance, the Global Leaders Group calls for the following:&nbsp;&nbsp;</p><p><strong>1. STRENGTHENED GOVERNANCE AND OVERSIGHT&nbsp;</strong></p><p><strong>In general, countries</strong> should:&nbsp;</p><ul><li><span style=\"background-color:transparent;font-family:inherit;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;font-size:inherit;\">Develop or build on and implement regulatory frameworks, guidelines, standard operating procedures (SOPs) and standards to establish safe levels, better control and monitor the distribution and release of antimicrobials, antimicrobial resistant bacteria and antimicrobial resistance determinants from food systems, manufacturing facilities and human health systems into the environment; and&nbsp;</span></li><li>Include prevention and management measures in national action plans on AMR to minimize the impacts of environmental discharges.&nbsp;</li></ul><p><strong>In the manufacturing sector </strong>specifically<strong>, </strong>countries should:&nbsp;</p><ul><li><span style=\"background-color:transparent;font-family:inherit;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;font-size:inherit;\">Develop and implement legal and policy frameworks with a lifecycle approach for antimicrobials manufacturing. Such an approach considers the entire timespan that a pharmaceutical is active and can impact the surrounding systems, would help to effectively address AMR environmental risks and ensure resilient antibiotic supply chains and stimulate the design, development, manufacture, and commercialization of needed new antibiotics and alternatives to antimicrobials;&nbsp;</span></li><li>Promote and develop balanced and staged environmental policies and approaches to manage and regulate manufacturing facilities and support environmental inspections, recognizing the current fragility of supply chains and significant access gaps;&nbsp;&nbsp;</li><li>Incentivize industry for compliance and excellence, including highlighting their contribution to the achievement of the Sustainable Development Goals; and&nbsp;</li><li>Develop national antimicrobial manufacturing pollution standards based on best available evidence, treatment technology and situational analysis, and strengthen the capacity of environmental authorities to conduct audits and monitor compliance.&nbsp;&nbsp;</li></ul><p><strong>In the human health sector </strong>specifically, countries should:&nbsp;</p><ul><li>Develop and implement antimicrobial stewardship policies and protocols in human health systems that include responsible and sustainable use and procurement of antimicrobials, and effective waste management approaches; and&nbsp;</li><li>Implement and enforce laws and policies to reduce or eliminate antimicrobial use that is not under the guidance of a trained health care provider, while ensuring equitable access to quality antimicrobials.&nbsp;</li></ul><p><strong>In food systems</strong> specifically, countries should:&nbsp;&nbsp;</p><ul><li>Develop or build on and implement regulatory frameworks, guidelines, SOPs and standards to effectively treat and/or manage waste discharge from food-producing animal farms, aquaculture farms and crop fields, as well as waste used to irrigate crops\n        and run-off from crop fields; and&nbsp;</li><li>Develop and implement antimicrobial stewardship policies and protocols in fixed and mobile animal health facilities that include responsible and sustainable use of antimicrobials and effective waste management approaches.&nbsp;</li></ul><p><strong>2. IMPROVED SURVEILLANCE AND DATA AVAILABILITY</strong></p><p>Countries should:&nbsp;</p><ul><li>Strengthen One Health surveillance of antimicrobial use in, and discharges of antimicrobials and AMR determinants from, food systems, human health systems and manufacturing facilities, as well as in sewage systems.&nbsp; This should be done taking\n        into account factors such as the need to build on existing systems, cost-effectiveness, data comparability and key knowledge gaps relating to the fate, concentration and impact of discharges on the environment and organisms in the environment\n        (e.g. soil microbes, aquatic organisms). Priority should be given to collecting data that can support targeted action, such as enhanced understanding of risks to human and animal health and the environment and release pathways into the environment,\n        and supporting the development of guidance on waste management approaches and antimicrobial discharge limits; and&nbsp;&nbsp;&nbsp;</li><li>Promote industry data disclosure, transparency and public access to waste and wastewater management data and mitigation practices in order to build credibility and public confidence. Data disclosure could initially be made to regulators and independent\n        third parties (for example as part of certification schemes), followed by efforts to enable wider public access to increase awareness and understanding, contribute to ongoing studies and reflect environmental standards in procurement practices.&nbsp;&nbsp;&nbsp;</li></ul><p><strong>3. IMPROVED DISCHARGE MANAGEMENT</strong></p><p><strong>In general, all countries </strong>should<strong>:</strong>&nbsp;</p><ul><li>Reduce the need for antimicrobial use through implementation of effective infection prevention and control measures in all sectors, including water, sanitation and hygiene (WASH), vaccination, biosecurity and animal husbandry and welfare measures;&nbsp;&nbsp;</li><li>Develop, implement and monitor systems for proper segregation, treatment and/or disposal of antimicrobials and antimicrobial-containing substances in all sectors (including antimicrobial feed and human and animal waste);&nbsp;</li><li>Develop mechanisms for collection and proper disposal of unused and expired antimicrobials from individuals and organizations; and&nbsp;&nbsp;</li><li>Ensure availability of affordable and environmentally safe incinerators and innovative technologies for destruction and degradation of unused or expired antimicrobials.&nbsp;</li></ul><p>In general, relevant <strong>international technical organizations and their partners </strong>should develop guidance and showcase best practices on proper waste management practices across sectors.&nbsp;</p><p><strong>In food systems:</strong>&nbsp;</p><p><strong>All countries</strong> should:&nbsp;</p><ul><li><span style=\"background-color:transparent;font-family:inherit;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;font-size:inherit;\">Create and implement manure, wastewater, runoff and farm waste management plans, SOPs, guidance, standards and measures such as composting for manure and its application into agriculture fields;&nbsp;and</span></li><li>Implement evidence-based manure management approaches so that manure can continue to be safely used as a natural fertilizer in agriculture fields and support agro-ecological farming practices while minimizing the risks of transfer of antimicrobial\n        resistant bacteria or antimicrobial resistance determinants.&nbsp;</li></ul><p><strong>International technical organizations</strong> should:&nbsp;</p><ul><li><span style=\"background-color:transparent;font-family:inherit;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;font-size:inherit;\">Expedite the development of tools and guidance to support the implementation of the Codex Code of practice to minimize and contain foodborne AMR and Guidelines on Integrated Monitoring and Surveillance of Foodborne Antimicrobial Resistance along the food chain (e.g. food processing and production facilities, wet markets, slaughterhouses)&nbsp; to minimize the impacts of antimicrobial discharge into the environment.&nbsp; &nbsp;</span></li></ul><p><strong>Companies involved in the slaughter and processing of food animals</strong> should:&nbsp;&nbsp;</p><ul><li><span style=\"background-color:transparent;font-family:inherit;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;font-size:inherit;\">Assess current food production practices to implement measures to reduce discharges of by-products, including biocides, into the environment and comply with legal standards and requirements.&nbsp;</span></li></ul><p><strong>In the manufacturing sector:</strong>&nbsp;</p><p><strong>Manufacturing companies</strong> should:&nbsp;</p><ul><li><span style=\"background-color:transparent;font-family:inherit;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;font-size:inherit;\">Commit to prevention and management measures to minimize the impacts of manufacturing discharges into the environment. This can be done through effective waste management technologies and practices, adoption and implementation of the </span>common\n antibiotic manufacturing framework<span style=\"background-color:transparent;font-family:inherit;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;font-size:inherit;\"> and the proposed independent certification schemes of the AMR Industry Alliance.&nbsp;&nbsp;</span></li></ul><p><strong>All stakeholders</strong> should:&nbsp;</p><ul><li><span style=\"background-color:transparent;font-family:inherit;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;font-size:inherit;\">Evaluate options and support efforts to create an enabling environment that influences and supports investment through incentives and efforts in pharmaceutical waste management without jeopardizing access to antimicrobials. Such evaluations may include an assessment of sustainable procurement policies, inclusion of environmental considerations in good manufacturing practices, environmental risk assessment before antimicrobial authorization and an independent product-certification scheme.&nbsp;&nbsp;</span></li></ul><p><strong>4. RESEARCH AND DEVELOPMENT</strong>&nbsp;</p><p><strong>International technical, financing and research and development organizations and partners</strong> should:&nbsp;</p><ul><li><span style=\"background-color:transparent;font-family:inherit;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;font-size:inherit;\">Enhance and coordinate research for a comprehensive understanding of risks to human and animal health from the environmental presence of antimicrobials, resistance microbes and mobile genetic elements in discharges, as well as potential hot spots, environmental impacts and antimicrobial resistance pathways, and mitigation measures;&nbsp;&nbsp;</span></li><li>Promote research and development across public and private sectors into cost-effective and greener waste management technologies including methods to remove antimicrobial residues, resistance genes and resistant organisms and other tools (e.g., climate-sensitive\n        incinerators and measurement technologies) and standardized monitoring methods, and support mainstreaming of best practices in process and waste management across sectors; and&nbsp;&nbsp;</li><li>Develop policy briefs on antimicrobial resistance and organize policy dialogues among policymakers to support evidence-based policymaking.&nbsp;</li></ul><p align=\"center\" style=\"text-align:center;\"><strong>Global Leaders Group on Antimicrobial Resistance background</strong></p><p>The <a href=\"https://www.amrleaders.org/\">Global Leaders Group on Antimicrobial Resistance</a> was established in November 2020 and performs an independent global advisory and advocacy role with the primary objective of maintaining\n    urgency, public support, political momentum and visibility of the AMR challenge on the global agenda. The mission of the group is to collaborate globally with governments, agencies, civil society and the private sector through a One Health approach\n    to advise on and advocate for political action for the mitigation of drug-resistant infections through responsible and sustainable access to and use of antimicrobials.</p><p>The group is co-chaired by Their Excellencies Sheikh Hasina, Prime Minister of Bangladesh and Mia Amor Mottley, Prime Minister of Barbados and is composed of heads of state, serving or former ministers and/or senior government officials acting in their\n    individual capacities, together with senior representatives of foundations, civil society organizations and the private sector. It also includes principals of the Tripartite organizations - the Food and Agriculture Organization of the United Nations\n    (FAO), the World Organisation for Animal Health (OIE) and the World Health Organization (WHO), and the UN Environment Programme (UNEP) - in an ex-officio capacity.</p><p>The Tripartite Joint Secretariat (TJS), a joint effort by FAO, OIE and WHO, and UNEP, provides Secretariat support for the Group.<strong></strong></p><p align=\"center\" style=\"text-align:center;\"><strong>Background on the UN Environment Assembly</strong></p><p>The <a href=\"https://www.unep.org/environmentassembly/\">UN Environment Assembly</a> is the world&rsquo;s highest environmental decision-making body. Through its resolutions and calls to action, the Assembly provides leadership\n    and catalyzes intergovernmental action on the environment. Its resumed fifth session (UNEA5.2) will held in Nairobi, Kenya, and online from 28 February to 2 March 2022.</p><p>&nbsp;</p>",
  "pubDate": "Wed, 02 Mar 2022 11:53:35 Z"
}