{
  "title": "The Petrodollar-Saudi Axis Is Why Washington Hates Iran",
  "link": "https://mises.org/node/60662",
  "description": "<p>Kish, since you are wondering, is an Iranian island in the Persian Gulf famed for its tourist and shopping attractions. It is becoming a serious rival to other nearby vacation hubs in Doha and Dubai.</p>\n<p>Along with pristine beaches and extensive malls, Kish is—or rather ought to be—known more widely for another feature and institution which the Iranian mullahs established there way back in 2003; namely, the Kish Bourse (i.e., Kish Stock Exchange). بورس کیش if you prefer the Farsi.</p>\n<p>Think of it as the Chicago Mercantile Exchange of Iran, a country stacked with natural resources, a relatively well-educated and sophisticated population (the literacy rate is 97 percent among young adults, which, if you consider the deplorable state of secondary education in the United States, means that Iranian youth are most assuredly smarter than your average young American adult), and an economy burdened by mismanagement of their own Islamic theocracy and crippling, long-duration sanctions from the American secular theocracy.</p>\n<p>That American secular theocracy has considered it a dogmatic rite of passage into the state and corporate media (their temples) that one must, at the very least, excuse the economic, cultural, and political warfare against Iran as necessary for a variety of spurious reasons. Who really has enough free time to investigate and then suggest otherwise? After all, Iran is plagued by terroristic Islamic fundamentalists who have pledged—like their former president, Mahmoud Ahmadinejad—“to wipe Israel off the face of the earth.”</p>\n<p>That hero of American warfare and empire and regime change and nation building, George W. Bush, declared Iran to be one of the hinges of the “axis of evil”; so, since George W. Bush is so much better than Donald J. Trump, well, all Iranians must be malevolent thugs. Iran deserved to have the United States aid Saddam Hussein in the 1980s, to have the United States provide Hussein chemical weapons (mostly made in Germany and the United Kingdom), and then have those chemical weapons unleashed on them.</p>\n<p>Never mind that Ahmadinejad never said that. Look away from the facts that one of the rare times in which Trump garnered any support from the deep state cathedral and corporate media cabal was when he tore up the Iran nuclear deal and when he assassinated Iranian general Qasem Soleimani. <a href=\"https://www.militarytimes.com/news/pentagon-congress/2020/01/03/killing-of-top-iranian-leader-elicits-praise-worry-from-congress/\">Orange man good when he’s killing brown peoples in distant lands—so conclude the <em>powers that have been</em> for way too long.</a></p>\n<p>Why has Iran, then, incurred such wrath from the American military-industrial complex establishment? The regime’s Sturm und Drang regarding Iran—and, for that matter, any state that even intimates that it will conduct trade in oil without the dollar, cf. Russia—is all about the petrodollar system.</p>\n<p>Let’s define it with some historical context: When Richard Nixon removed the dollar from its peg to gold in 1971, chaos followed. It was not just the Yom Kippur War (1973) and resultant OPEC embargo that led oil prices to skyrocket in the United States. The dollar, as the new, floating, purely fiat global reserve currency had lost its allure when compared to other sovereign currencies and precious metals.</p>\n<p>In order to stave off runaway, hyperinflation, Nixon empowered then secretary of the Treasury, William Simon, to go hat in hand to the Saudi monarchy, with a proposal. <a href=\"https://www.bloomberg.com/news/features/2016-05-30/the-untold-story-behind-saudi-arabia-s-41-year-u-s-debt-secret\">According to Andrea Wong in a Bloomberg article from 2016(!), Simon landed in Jeddah, Saudi Arabia to get King Faisal to agree “to finance America’s widening deficit with it’s newfound [oil] wealth.”</a></p>\n<p>Said another way, the Americans promised to buy oil from Saudi Arabia, and in return, the Saudis would promise to denominate global purchases only in dollars. Washington would also go so far as to provide military aid and materiel to the Kingdom, which made Raytheon, McDonnell Douglas, and Rand Corporation types happy. <a href=\"https://www.bloomberg.com/news/features/2016-05-30/the-untold-story-behind-saudi-arabia-s-41-year-u-s-debt-secret\">The tit for that tat came in the form of guarantees that the Saudis would “plow billions of their <em>petrodollar</em> revenue back into Treasuries and finance [the inordinate, warfare-welfare] spending” of every US regime since.</a></p>\n<p>It—incredibly—gets worse. King Faisal accepted the arrangement (one that was sure to make his desert-oil kleptocracy a major regional power and global player) on one condition: The rest of the world could not know the extent of the agreement. That is to say that Faisal knew that in the rest of the Islamic world, underwriting America’s drunken-sailor imperial spending, well, that would not play in Cairo, Damascus, and Kuala Lumpur.</p>\n<p>Therefore, <a href=\"https://www.bloomberg.com/news/features/2016-05-30/the-untold-story-behind-saudi-arabia-s-41-year-u-s-debt-secret\">Simon allowed for the Saudis to “bypass the normal competitive bidding process for buying Treasuries by creating ‘add-ons.’ Those sales, which were excluded from the official auction totals, hid all traces of Saudi Arabia’s presence in the U.S. government debt market.”</a></p>\n<p>Within just four years of the agreement, Saudi Arabia held about one-fifth of all Treasuries held abroad. It is further asserted that that number represents the bare minimum of the Saudi share of US debt. <a href=\"https://www.bloomberg.com/news/features/2016-05-30/the-untold-story-behind-saudi-arabia-s-41-year-u-s-debt-secret\">The Saudi regime launders and recycles its petrodollars though hedge funds and secretive arrangements with perhaps hundreds of quasi-private institutions, all done with the approval and oversight of the US regime.</a></p>\n<p>Different parties. Different men. Different pronouncements. Different promises. But, the one thing they all have in common: They <em>all</em> bow low before the Saudis—one of them, literally!</p>\n<p>The truth is that both American foreign policy and to a very large extent, American domestic policy, are both wrapped up in the petrodollar arrangement. For the past fifty years, the national government has attempted to do what a president not pictured above—Lyndon Baines Johnson—wanted to do in Vietnam; namely, apply the New Deal to Southeast Asia.</p>\n<p>The subsequent regimes have doubled down on the insanity—they aspire to maintain American economic, imperial hegemony <em>over the rest of the world</em> while simultaneously engaging in domestic spending to infinity and beyond. Thus, the petrodollar system is the most grandiose of all monetary and money laundering schemes. The Fed and US Treasury create fiat out of thin air, the Saudis provide a semblance of supportive valuation for it, and then the Saudis conceal their ill-begotten gains by buying Treasuries and cleaning their dollars through ostensibly legitimate concerns.</p>\n<p><a href=\"https://web.archive.org/web/20080202025907/http:/www.energybulletin.net/7707.html\">As economist William Clark pointed out in 2005, nations that even appear to not be on board with this sinister arrangement are the ones that incur the most wrath from the State Department, Pentagon, NATO, presidential administrations, and all of the other aligned interests.</a> In September 2000, Saddam Hussein announced that his Baathist government would no longer participate in the “Oil-for-Food” Program, and that, furthermore, oil deals would be denominated in euros.</p>\n<p>From that point on, the writing (about Babylon this time) was on the walls of the state in DC Just months after US forces invaded Iraq, in June 2003, Iraqi oil sales were converted back to petrodollars, which, owing to the euro’s strength against the dollar at the time, cost Iraqis a net 13 percent on their oil revenues and invalidated previously approved contracts with other nations.</p>\n<p>Kish is a much greater offense to Washington than anything Saddam Hussein was able to accomplish. There, Iranian oil is bought and sold using euros, yuan, and (get ready for it) rubles. The Iranians have their own oil “marker” or means of certifying the purity and quality of the oil. Turns out, while the Biden administration and greater “liberal” Europe have expressed their collective outrage by spending other citizens’ money to support an oligarchy in Ukraine and have concurrently cut off those evil, boorish Russians with sanctions; business is brisk in Kish and Tehran. Volumes have increased on the export and import side.</p>\n<p>Over just a four-month period, they went up 4 percent and a whopping 32 percent respectively. The Iranian consumer is holding up in spite of those onerous sanctions. Meanwhile, China has increased its purchase of Iranian oil. At present, 13 percent of China’s oil originates in Iran.</p>\n<p><a href=\"https://books.google.com/books?id=I3vWgRS_itIC&printsec=frontcover&source=gbs_ge_summary_r&cad=0#v=onepage&q&f=false\">All of this is to say that, just like the Federal Reserve system, the petrodollar cabal has to reign at or near the top of operative institutions that the vast majority of Americans have “kinda, sorta heard about” and yet possess no idea of the extent to which said things suppress American prosperity and prospects for the future.</a> Most have no idea why or how the Saudis can fund everything from genocidal proxy wars against Iran to upstart professional golf tours.</p>\n<p>Must be all of that oil money. Factual, but not exactly true.</p>\n<p>End the petrodollar.</p>\n<p> </p>\n\n",
  "author": "Gary Richied",
  "enclosure": "",
  "guid": 60662,
  "pubDate": "Tue, 01 Nov 2022 06:00:00 -0500",
  "source": "Mises Wire"
}