{
  "title": "I Spy with my Graphing Eye 📊 👁️",
  "description": "<p><i>&ldquo;No one is dumb who is curious. The people who don&rsquo;t ask questions remain clueless throughout their lives.&rdquo;</i>\n<br/>\n-Neil deGrasse Tyson\n<br/><br/><figure class=\"tmblr-full\" data-orig-height=\"423\" data-orig-width=\"750\" data-orig-src=\"https://i.imgur.com/CKM6fqP.png\"><img src=\"https://64.media.tumblr.com/45b72bbd944d64a552149fa53344f4ac/tumblr_inline_pjmculmRzm1srua81_540.png\" data-orig-height=\"423\" data-orig-width=\"750\" data-orig-src=\"https://i.imgur.com/CKM6fqP.png\"/></figure><br/><a href=\"https://www.insightsintoimpact.com/evaluative-thinking-the-heart-of-meaningful-useful-evaluation/thinking-and-awareness/\" target=\"_blank\">Image Source</a>\n<br/><br/>\nNowadays, plots, graphs, stats, and facts are everywhere - as you scroll through your Twitter feed, down your Facebook wall, and in the news article you are reading.\n<br/><br/>\nBeing able to <b>read</b>, <b>interpret</b>, and <b>question</b> these diagrams is a key 21st century skill that is easy to overlook in our fast-paced digital world.\n<br/><br/>\n<!-- more -->\nRecently, the New York Times partnered with the American Statistical Association for a new monthly feature, &ldquo;What&rsquo;s Going On in This Graph?&rdquo; (WGOITG)\n<br/><br/>\nOnce a month, The Times publishes a graph, map, or chart that is stripped of some key information. Students are invited to visit the site and and discuss what they see, answering these three questions from a mathematical standpoint:\n<br/><br/>\n1.What do you notice?\n<br/>\n2. What do you wonder?\n<br/>\n3. What&rsquo;s going on in this graph?\n<br/><br/><i>The process of sense-making truly begins when we create questioning, curious classrooms full of students&rsquo; own thoughts and ideas. By asking: <b>What do you notice? What do you wonder?</b> we give students opportunities to see problems in big-picture ways and discover multiple strategies for tackling a problem.</i>\n<br/><br/>\nWe&rsquo;re big fans of WGOITG, so we decided to try it ourselves - with the Plotly team.\n<br/><br/>\nDesigners, engineers, and data scientists chimed in on their thoughts about the three original charts below.\n<br/><br/>\nAs you read through the post, challenge yourself to answer the three questions listed above.\n<br/><br/>\nFor more thought-provoking plots, check out the <a href=\"https://plot.ly/feed/\" target=\"_blank\">Plotly feed</a> or our recent blog post on <a href=\"https://medium.com/@plotlygraphs/leading-the-charge-10-charts-on-electric-vehicles-in-plotly-d951acdc49c1\" target=\"_blank\">going electric</a> ⚡\n<br/><br/></p><h2>1. College majors, post-graduate employment, and earnings</h2>\n<br/><br/><iframe width=\"1200\" height=\"600\" frameborder=\"0\" scrolling=\"no\" src=\"//plot.ly/~Dreamshot/9342.embed\"></iframe>\n<br/><br/><i>&ldquo;I notice a strong correlation. It looks like the total number of graduates/popularity of a major is strongly correlated with employment rate and not the median annual salary. I wonder how the shaded area (most/least popular majors) was determined. Is it sized to represent the data?&rdquo;</i>\n<br/>\n-Chelsea D.\n<br/><br/><i>&ldquo;I wonder about what we can infer about supply and demand for these jobs based on the color. Hard to tease apart: are blue jobs overpaid due to lack of supply? Or are red ones underpaid due to oversupply? School student counseling is at the low end of both, so the low pay is likely not due to oversupply.&rdquo;</i>\n<br/>\n-Nicolas K.\n<br/><br/><i>&ldquo;I notice that the line is fairly straight, which means that all of the majors have a roughly proportionate amount of graduates who are employed. I wonder why there aren&rsquo;t more green and blue (higher incomes, I think?) for popular majors.&rdquo;</i>\n<br/>\n-Shammamah H.\n<br/><br/><h2>2. Labor-Force Participation Rate</h2>\n<br/><br/><iframe width=\"900\" height=\"800\" frameborder=\"0\" scrolling=\"no\" src=\"//plot.ly/~Dreamshot/9324.embed\"></iframe>\n<br/><br/><i>&ldquo; I wonder why Germany is gaining ground so fast? And why is the U.S. losing ground? And who else is in the OECD that&rsquo;s dragging down the average? Are we seeing only the OECD countries above the average at the end of the period? How are the other countries doing?&rdquo;</i>\n<br/>\n-Nicolas K.\n<br/><br/><i>&ldquo;I notice that Germany experienced two dramatic increases in labour force participation over short periods of time. I wonder why in Japan and Germany, labour force participation increased during the Great Recession while in all the other countries, participation was generally declining.&rdquo;</i>\n<br/>\n-Ashley P.\n<br/><br/><h2>3. Sea Surface Temperature Anomaly</h2>\n<br/><br/><iframe width=\"900\" height=\"800\" frameborder=\"0\" scrolling=\"no\" src=\"//plot.ly/~Dreamshot/9335.embed\"></iframe>\n<br/><br/><i>&ldquo;I notice this chart doesn&rsquo;t have an indicator of time. The meaning it communicates will be vastly different if these changes in sea surface temperature have happened over a day, a year, or several years. I wonder how variable these temperatures are generally. Do they ever rise or fall by more than three degrees?&rdquo;</i>\n<br/>\n-Ashley P.\n<br/><br/><i>&ldquo;I notice that the lines at the top become more rare. I wonder if the projection that was chosen is not optimal.&rdquo;</i>\n<br/>\n-Dmitry S.\n<br/><br/><i>&ldquo;I wonder when the data were collected, and what the graph might look like around hurricane season. I notice that the Pacific ocean tends to have warmer water than the Atlantic.&rdquo;</i>\n<br/>\n-Shammamah H.",
  "link": "https://blog.plotly.com/post/181043057242",
  "guid": "https://blog.plotly.com/post/181043057242",
  "pubDate": "Wed, 12 Dec 2018 05:09:19 -0500",
  "category": [
    "datascience",
    "datavisualization",
    "data",
    "python"
  ]
}