{
  "title": "In 2018, people are more open to love that crosses borders than ever before",
  "link": "https://theblog.okcupid.com/in-2018-people-are-more-open-to-love-that-crosses-borders-than-ever-before-77f40d90840a?source=rss----2cd59e7d4ed1--data",
  "guid": "https://medium.com/p/77f40d90840a",
  "category": [
    "relationships",
    "data",
    "love",
    "romance",
    "language"
  ],
  "dc:creator": "OkCupid",
  "pubDate": "Mon, 12 Feb 2018 15:20:13 GMT",
  "atom:updated": "2021-08-09T23:43:14.705Z",
  "content:encoded": "<h4>Together with Rosetta Stone, we’re releasing our first Language of Love Report — just in time for Valentine’s Day</h4><p>Contrary to what many of us predicted, the world did not implode in 2017. There’s always this year for a worldwide shutdown — but, despite everything that’s going on, we’re feeling pretty hopeful that 2018 may be the year of unity, versus division. We’re not just going out on a limb, here. We worked with <a href=\"http://www.rosettastone.com/lp/sbsr/rmsitewide/?cid=af-pa-ok-rmsitewidebof& utm_source=okcupid&utm_medium=partner&utm_content=febvday&utm_campaign=textlink\">Rosetta Stone</a> to collect nearly 700,000 responses to questions on love and language, and how they intersect, and we found that most people don’t see differing languages as true barriers when it comes to love. It’s quite the opposite: our Language of Love Report proves that folks are increasingly open to relationships with people who speak different languages and come from different countries.</p><p>Today we find that people are turning away from an insular mindset, instead embracing the idea that interacting with people from other backgrounds is a good thing — in life in general, and in their love lives. In fact, nearly two-thirds of participants said they could date someone who doesn’t speak their language well. Ninety-two percent of singles surveyed said they’re interested in learning another language, and 94% said they’re more open-minded after they’ve visited somewhere new.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*iHrFpeFD7gcAI1wKOApAew.jpeg\" /><figcaption>Most people could date someone who doesn’t speak their language well, and the vast majority find their more open-minded after visiting somewhere new.</figcaption></figure><p>Clearly, the vast majority of the singles we polled are interested in language, and people who speak those different from their own. But the numbers show that it’s millennials (18–36) who are the most invested in love that crosses borders. While over half of both age groups 37 to 53, and 54 and above, believe that it is very important for a couple to come from the same country, less than one third of millennials do.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*3kPK9sYZ0iTh5Q53ckxfHw.jpeg\" /><figcaption>Millennials are the least likely to think that dating someone who comes from the same country is very important.</figcaption></figure><p>Millennials are nearly 10% more likely to be open to dating someone who doesn’t speak their language well compared to non-millennials. And they’re actually the generation that responds most positively to <em>all</em> questions on language and love — from being interested in learning another language, to be more open-minded after traveling somewhere new. In response to if they find someone who speaks another language more attractive than someone who does not, 73% of millennials responded “yes,” compared to 65% of those 37 to 53 and 53% of those 54 and above.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*Ep7Dljp7po1K4EKFFO-XiA.png\" /><figcaption>Millennials are the most likely to find someone who speaks another language more attractive than someone who does not.</figcaption></figure><p>So what do we make of all of this? Well, we take it as good news — singles are increasingly open to dating people who speak different languages, and millennials are leading the way. We also see our Language of Love Report as offering some useful information for your dating game, just in time for Valentine’s Day: learn a new language (or at least start to), and you’ll quickly become one of the most attractive options out there. So download Rosetta Stone (click <a href=\"http://www.rosettastone.com/lp/sbsr/rmsitewide/?cid=af-pa-ok-rmsitewidebof& utm_source=okcupid&utm_medium=partner&utm_content=febvday&utm_campaign=textlink\">here</a> for a special discount), learn some phrases, connect with someone on <a href=\"http://www.okcupid.com\">OkCupid</a> — and have a great date!</p><p><em>Speak the language of love with someone new on </em><a href=\"https://okcupid.onelink.me/godV/44c7b6b0\"><em>OkCupid</em></a><em> right now.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=77f40d90840a\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://theblog.okcupid.com/in-2018-people-are-more-open-to-love-that-crosses-borders-than-ever-before-77f40d90840a\">In 2018, people are more open to love that crosses borders than ever before</a> was originally published in <a href=\"https://theblog.okcupid.com\">OkCupid Dating Blog</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}