{
  "id": "yt:video:yucjFSm1ERQ",
  "yt:videoId": "yucjFSm1ERQ",
  "yt:channelId": "UC0uTPqBCFIpZxlz_Lv1tk_g",
  "title": "Philosophy: meaning and purpose of life",
  "link": "",
  "author": {
    "name": "Protesilaos Stavrou",
    "uri": "https://www.youtube.com/channel/UC0uTPqBCFIpZxlz_Lv1tk_g"
  },
  "published": "2022-11-02T12:35:38+00:00",
  "updated": "2022-11-04T23:54:56+00:00",
  "media:group": {
    "media:title": "Philosophy: meaning and purpose of life",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Find all my publications on my website: https://protesilaos.com\n\n* * *\n\nI traversed the mountains and talked for about 1 hour and 10 minutes on matters of philosophy.  Outline:\n\n* An explanation of what I mean when I claim that no-one is special: our shared humanity and co-existence with all forms of life.\n* Why not being special makes life simpler.  We accept that not everything is a function of our volition.\n* Explain how this affects the binary of reward and punishment and why our life becomes easier.\n* Start with the point of what is purpose and what is meaning.  The former is the ulterior end for which something happens.  The latter is our evaluation of a state of affairs: how we feel about it.\n* Discuss how I proceed from the little things.  How, for example, the colours I see and the warmth of the Sun engender certain emotions---I add meaning to those experiences.\n* Elaborate why the purpose does not need to exist.  We then develop a transactional outlook of not actually caring about the experiences.  We only cater to them to the extend that they bring us closer the end goal.  We are not genuine.  Also see my talk about \"Forgiveness and hubris\": https://protesilaos.com/books/2022-10-25-forgiveness-hubris/.\n* The purpose denies us our presence.\n* Comment on how the absence of purpose pertains to reward and punishment.  We do not need to ground reward and punishment in some greater authority for them to work.\n* Remark how mere knowledge of ultimate reward/punishment (heaven and hell) does not instil in us a sense of doing what is right.\n* Continue with the argument of not needing a purpose by using more examples of applied rules.\n* Expound on the same argument, but in theistic terms.  Explain how omniscience precludes experimentation and that a perfect God does not need to test anything, for that contradicts omniscience.\n* Propound the view that in the absence of consensus regarding theist matters, our only takeaways is that we are not sure.  So we should not project our perceived need for purpose as God's need for purpose.\n* Connect those points to social matters: beauty, fame, power.  Also watch my presentation \"About 'sorry for being a burden'\": https://protesilaos.com/books/2022-10-31-sorry-for-being-burden/.\n* Talk about the experience of meeting a \"fabulous\" person at a restaurant and how their purpose was detracting from the meaning in their life.\n* Tie it all together.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}