{
  "id": "https://bibleinoneyear.org/en/youth/254",
  "title": "Day 254: His Grace Is Enough for You",
  "description": "Psalm 106:43–45, Isaiah 28:16, 2 Corinthians 12:1–10. This is one of my favourite verses in the entire Bible  I often quote this verse to God and remind him of his promise that his power is made perfect in my weakness",
  "pubDate": "Sat, 11 Sep 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/254/?ignore",
  "itunes:duration": "15:16",
  "guid": "enyouth11092021-254",
  "length": 916.19,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 254: His Grace Is Enough for You",
  "itunes:subtitle": "Psalm 106:43–45, Isaiah 28:16, 2 Corinthians 12:1–10. This is one of my favourite verses in the entire Bible  I often quote this verse to God and remind him of his promise that his power is made perfect in my weakness",
  "itunes:summary": "I first met Nick Vujicic when he came to speak at Focus, our church holiday. Nick is a remarkable man. I think that all of us who met him were inspired and challenged by his life.\nNick was born without arms or legs, yet he can say, ‘I am truly blessed. I am ridiculously happy.’ Many times as a child he prayed for arms and legs. He would have settled for getting one arm or leg.\nGod did not answer his prayer in the way that he had hoped. Yet he writes, ‘God used me to reach people in countless schools, churches, prisons, orphanages, hospitals, stadiums and meeting halls. Even better, I’ve hugged thousands of people in face-to-face encounters that allow me to tell them how very precious they are... God took my unusual body and invested me with the ability to uplift hearts and encourage spirits.’\nThe people of God depend on the grace of God. Mother Teresa wrote, ‘I don’t think there is anyone who needs God’s help and grace as much as I do. Sometimes I feel so helpless and weak. I think that is why God uses me. Because I cannot depend on my own strength, I rely on Him twenty-four hours a day. If the day had even more hours, then I would need His help and grace during those as well.’\nPaul expresses this dependence when he writes about the ‘thorn in his flesh’. Three times he pleaded with the Lord to take it away. But God said to him, ‘My grace is sufficient for you, for my power is made perfect in weakness’ (2 Corinthians 12:9). His grace is not only amazing; it is ‘sufficient’. It is enough.\nThis is one of my favourite verses in the entire Bible. I often quote this verse to God and remind him of his promise that his power is made perfect in my weakness.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 254
}