{
  "id": "https://bibleinoneyear.org/en/youth/241",
  "title": "Day 241: When the Holy Spirit Comes",
  "description": "Psalm 104:1,2–4,14–15, 2 Chronicles 34:31, 2 Corinthians 2:14–17, 3:1–6.  John Wimber defined this kind of ministry as ‘meeting the needs of others with the resources of God’  Wonderfully, this type of ministry is now available to you and me",
  "pubDate": "Sun, 29 Aug 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/241/?ignore",
  "itunes:duration": "13:38",
  "guid": "enyouth29082021-241",
  "length": 818.16,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 241: When the Holy Spirit Comes",
  "itunes:subtitle": "Psalm 104:1,2–4,14–15, 2 Chronicles 34:31, 2 Corinthians 2:14–17, 3:1–6.  John Wimber defined this kind of ministry as ‘meeting the needs of others with the resources of God’  Wonderfully, this type of ministry is now available to you and me",
  "itunes:summary": "I remember the first time I prayed ‘Come, Holy Spirit’ on an Alpha Weekend. I knew that the Holy Spirit had ‘come’ every time those who had led the Alpha Weekends before me had asked him to come. Even so, I did not think he would come in answer to my prayers – as I prayed ‘Come, Holy Spirit’ I shut my eyes, because I did not want to see the Holy Spirit ‘not coming’!\nWhen I opened my eyes, there was an amazing sight. The Holy Spirit had come in a powerful way – people were being filled. He was changing people’s lives. This was the ministry of the Holy Spirit. That is why at some point in virtually every one of our services we pray ‘Come, Holy Spirit.’ We always try to leave time for ‘ministry’ – for the Holy Spirit to minister to us.\nWe often associate the word ‘minister’ with leadership, whether by government ministers or by church ministers. In fact, the word really means ‘to serve’. Politicians are called to serve their countries. Pastors are called to serve the church. Doctors, who administer treatment to their patients, are called to serve the sick and the dying.\nThe Holy Spirit ministers to you. He brings authority greater than any politician, comfort deeper than any pastor, and healing more wonderful than any doctor. God ministers to you in the deepest part of your life by the Holy Spirit.\nThe apostle Paul speaks of ‘the ministry of the Spirit’ (2 Corinthians 3:8). John Wimber defined this kind of ministry as ‘meeting the needs of others with the resources of God’. Wonderfully, this type of ministry is now available to you and me.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 241
}