{
  "id": "yt:video:BDGVbiaiJ2M",
  "yt:videoId": "BDGVbiaiJ2M",
  "yt:channelId": "UCMTk_R_Y49jvq-HQXDmKI0Q",
  "title": "The Dramatic Decay Of DanPlan - End Of An Animated Era | TRO",
  "link": "",
  "author": {
    "name": "The Right Opinion",
    "uri": "https://www.youtube.com/channel/UCMTk_R_Y49jvq-HQXDmKI0Q"
  },
  "published": "2020-05-31T21:00:07+00:00",
  "updated": "2022-02-08T00:31:37+00:00",
  "media:group": {
    "media:title": "The Dramatic Decay Of DanPlan - End Of An Animated Era | TRO",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The Right Opinion: The Dramatic Decay Of DanPlan - End Of An Animated Era | TRO\n\n0:00 - Intro\n7:32 - Actually\n15:31 - Sharing Is Caring\n25:33 - Ownership\n37:07 - The Response\n48:14 - Dissonance\n1:00:20 - Small Change\n1:11:47 - The Animators\n1:28:05 - Unanswered Questions\n1:36:05 - The Answers\n\nIntro:\n\nNow, when someone reached out to me about this situation, I will admit, I was not familiar with DanPlan, and in spite of their approximately 2 million strong fanbase, many of my friends were not familiar with their content either, so I sat down and watched a lot of DanPlan. Now I think I have a decent grasp, I will briefly summarise their origins and content, just so people have a grip on how they created such a significant following. \n\nDanPlan as a channel was established in July 2014 by their titular creators: Daniel, and his friend Hosuh, with the first upload coming soon after.\n\nThis was the first instalment of their “By the way” series, the video consisted of a slightly crudely drawn character discussing a story told by his youth pastor. Now, the audio could be better, and this video only appears to include Dan himself, but you can definitely see the origins of a great channel in the making, a lot of Hosuh’s creative illustrations enhance Dan’s stories on a comedic basis, and Dan’s outgoing nature makes him an effective storyteller, there was definitely potential here.\n\nHowever, this series didn’t receive much attention following its initial upload. Animation was in a bit of a lull at that point, and thus it was probably not worth putting too many eggs in that basket. After this DanPlan spent just under a couple years dedicated to gaming content, which was much more popular at the time. These gaming videos weren’t the most unique, though they were often presented more like highlight reels, and used character heads to represent different people talking. Dan was the consistent host of these videos, gaming with a varying roster of guests, such as Anna, Billy, Jay, and of course, Hosuh. However, there was one more character to introduce to this story, that person goes by the name of Stephen.\n\nStephen was introduced on the 5th of September, 2015, in the upload “Yamete, Titan Senpai”, in which he, and of course, Dan, and Hosuh, played the Attack On Titan tribute game. Like Hosuh, and many of their other friends, they were acquainted through school and college, and for these comrades, this was just a regular gaming session which happened to be uploaded onto YouTube. Stephen was not one of the original members, but he quickly became a recurring guest on the channel as other individuals began to appear less. However, these gaming videos, although enjoyable for those who participated, didn’t set the channel on fire, gaining DanPlan only 50 subscribers. So come May 2016, the “By The Way” series was resumed, but this time, with a slightly different format. ..\n\nWatch the rest of the video for more.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}