{
  "title": "A Data Science Landscape, One Year After",
  "link": "https://medium.com/@chris_bour/a-data-science-landscape-one-year-after-d888c3115c10?source=rss-90ca8bc640f4------2",
  "guid": "https://medium.com/p/d888c3115c10",
  "category": [
    "machine-learning",
    "data-science",
    "big-data"
  ],
  "dc:creator": "Christophe Bourguignat",
  "pubDate": "Sun, 18 Oct 2015 20:47:46 GMT",
  "atom:updated": "2015-10-19T02:50:50.805Z",
  "content:encoded": "<p><em>This is the transcript of the “Data Scientist 2015” Paris conference opening keynote.</em></p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*x68X3v0nHDPIgN8LuJNTXQ.jpeg\" /><figcaption>A Kudu</figcaption></figure><p>Hi everyone,</p><p>I prepared this keynote by asking myself a question : <strong>what topic would I have mentioned, if I had to do the introduction talk of the last year edition ?</strong> Would it have been still relevant today ? Or already totally outdated ?</p><p>Last year, for instance, I definitely would have tried — yes, I say <em>tried</em> — to describe what is a data scientist. You know, this fictional role, half math nerd, half software geek, and half communication skilled. Three halves showing that it doesn’t really exists. Today, I’m still even more confused. <a href=\"http://businessoverbroadway.com/investigating-data-scientists-their-skills-and-team-makeup\">A recent survey</a> depicted a data scientist as <strong>a spider with …. 25 feets</strong> ! Maybe after this conference day, we will know a bit more about this new role. And understand how broad it is.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*SaqaUqPADs9chgxSMjyzhQ.png\" /><figcaption><a href=\"http://businessoverbroadway.com/investigating-data-scientists-their-skills-and-team-makeup\">Data Scientist, a spider with … 25 feets</a></figcaption></figure><p>However, compared to last year, we start having data about data scientists. After the quantified self, it’s time for <strong>the quantified data scientis</strong>t — data science on data scientists. Two weeks ago, <a href=\"https://www.oreilly.com/ideas/2015-data-science-salary-survey\">a linear model predicting the salary of data scientists was published</a>.</p><p>What is noticeable ? If you are a girl, unfortunately, you lose points. It won’t surprise anybody. Too bad, but even the data scientist job, like lot of technical positions, cannot escape this rule.</p><p>More funny, <strong>the more time spent in meetings, the more a data scientist (/analyst/engineer) earns</strong>. And if he spends too much time exploring data (4+ hours / day), he earns less ! That beats everything !</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*CwDBcPij6TEEiylw2ufM1Q.png\" /><figcaption>Data science on data scientists : <a href=\"https://www.oreilly.com/ideas/2015-data-science-salary-survey\">a linear model to predict how much they earn</a></figcaption></figure><p>Some months ago, I would have been criticizing the lack of awareness of France, on what represents the data revolution. Let’s recognize that the landscape has changed. A new role has been created — the France’s Chief Data Officer, who recently also became the France’s Chief Information Officer, showing that <strong>public IT moves to a more data-centric approach</strong>. France now also has its own data science team, and <a href=\"http://www.legifrance.gouv.fr/affichTexte.do?cidTexte=JORFTEXT000029388087&dateTexte=&categorieLien=id\">a new word is born</a> : “mégadonnées” — “Big Data” in french.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/435/1*rwIkj_oG3xtPGczqM1S7jg.jpeg\" /><figcaption>Henri Verdier, France’s CDO / CIO</figcaption></figure><p>Last year, I would have talked about pioneering companies, experimenting with data — doomed to a bright future. Today, I would be more nuanced. Data maturity of companies is very disparate, and the most advanced of them start doubting. <strong>75 % have invested in Big Data, but only 10% have projects in production</strong>. For the first time “machine learning”, one of the key component of data projects, is falling down in the last Gartner “Hype Cycle”.</p><p>Companies face disillusions. And ask themselves questions : I know how much it costs, but how much do I earn ? What is the ROI ?</p><p>Even projects with small data surface new problems — how do I use my data scientists discoveries ? This implies <strong>change management</strong>, modifying established business processes. One retailer, for example, learned that it could increase profits substantially by extending the time items were on the floor before and after discounting. But implementing that change would have required a complete redesign of the supply chain, which the retailer was reluctant to undertake</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/600/1*CZ1MayYRfYLMSiyWI2ULWA.png\" /><figcaption>For the first time “machine learning” is falling down in the last Gartner “Hype Cycle”</figcaption></figure><p>On an other level, technological this time — and because data science is about a lot of technologies — I would probably have mentioned Map Reduce. An algorithm designed by Google about 10 years ago, to allow distributed processing of large volumes of data. A short time ago, it was a star. Today, it is <strong>outdated by a tsunami called : Spark</strong>.</p><h3>Chris. Bourguignat on Twitter</h3><p>Today I explained Map Reduce to my parents #BigData pic.twitter.com/uzPoN5dQxG</p><p>Lets’s take an other example. Two weeks ago, <a href=\"http://blog.cloudera.com/blog/2015/09/kudu-new-apache-hadoop-storage-for-fast-analytics-on-fast-data/\">Cloudera announced Kudu</a>, a new columnstore bypassing entirely HDFS, the de-facto current big data storage technology. Aside from the fact that it helps data scientists improve their zoological knowledge (the Kudu is woodland antelope found throughout eastern and southern Africa), Kudu makes analysts wonder if <a href=\"http://blogs.gartner.com/merv-adrian/2015/10/04/strata-standards-stories-different-stores-for-different-chores/\"><strong>HDFS joined MapReduce in the emerging “legacy Hadoop project” category</strong></a>…</p><p>On the other hand, I would undoubtedly not have talked about Deep Learning. A branch of Artificial Intelligence (AI). Neural networks, incredibly powerful, that learn from data like — and sometimes better than — humans. This domain made recently decisive advances. These algorithms showed how <strong>they were able to </strong><a href=\"http://www.boredpanda.com/computer-deep-learning-algorithm-painting-masters/\"><strong>paint</strong></a><strong>, </strong><a href=\"http://karpathy.github.io/2015/05/21/rnn-effectiveness/\"><strong>write</strong></a><strong>, or </strong><a href=\"http://theinquisitivists.com/2015/09/16/using-autoharp-and-a-character-based-rnn-to-create-midi-drum-loops\"><strong>compose music</strong></a>. What’s next ?</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/880/1*mVYWE1EPmnH7bLoNoLFw8w.jpeg\" /><figcaption>Depp Learning Paintings</figcaption></figure><p>Neither would I have talked about ethics. <strong>Yes, ethics — who would have thought it comes to the debate</strong> ? A society where every single decision regarding citizens is driven by predictive models, <a href=\"https://medium.com/@chris_bour/ai-will-predictive-models-outliers-be-the-new-socially-excluded-bbcb6a7b16b1\">raises concerns</a>.</p><p>That’s why data for good, <a href=\"http://nerds.airbnb.com/aerosolve/\">transparency in predictive algorithms</a>, and education about AI are currently growing topics.</p><h3>Elon Musk on Twitter</h3><p>Hope we're not just the biological boot loader for digital superintelligence. Unfortunately, that is increasingly probable</p><p>To conclude : don’t try to remember too much what I just exposed, <strong>it will be partially obsolete next year ! </strong>At least, it’s my prediction.</p><p>One thing, however, will remain. D.J. Patil, named recently by Barak Obama “US Chief Data Scientist”, wrote in 2012 in a famous and visionary Harvard Business Review article, that Data Scientist would become the <strong>“</strong><a href=\"https://hbr.org/2012/10/data-scientist-the-sexiest-job-of-the-21st-century/\"><strong>Sexiest Job of the 21st Century</strong></a><strong>”</strong>. I’m also deeply convinced about that. Data Scientist is one of the most thrilling job of the world, and this will remain unchanged for a long time. We are a just at the beginning of the story.</p><p>I wish you an amazing day.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=d888c3115c10\" width=\"1\" height=\"1\" alt=\"\">"
}