{
  "title": "Sensor Control for Information Gain in Dynamic, Sparse and Partially Observed Environments. (arXiv:2211.01527v1 [cs.AI])",
  "link": "http://arxiv.org/abs/2211.01527",
  "description": "<p>We present an approach for autonomous sensor control for information\ngathering under partially observable, dynamic and sparsely sampled\nenvironments. We consider the problem of controlling a sensor that makes\npartial observations in some space of interest such that it maximizes\ninformation about entities present in that space. We describe our approach for\nthe task of Radio-Frequency (RF) spectrum monitoring, where the goal is to\nsearch for and track unknown, dynamic signals in the environment. To this end,\nwe develop and demonstrate enhancements of the Deep Anticipatory Network (DAN)\nReinforcement Learning (RL) framework that uses prediction and information-gain\nrewards to learn information-maximization policies in reward-sparse\nenvironments. We also extend this problem to situations in which taking samples\nfrom the actual RF spectrum/field is limited and expensive, and propose a\nmodel-based version of the original RL algorithm that fine-tunes the controller\nusing a model of the environment that is iteratively improved from limited\nsamples taken from the RF field. Our approach was thoroughly validated by\ntesting against baseline expert-designed controllers in simulated RF\nenvironments of different complexity, using different rewards schemes and\nevaluation metrics. The results show that our system outperforms the standard\nDAN architecture and is more flexible and robust than several hand-coded\nagents. We also show that our approach is adaptable to non-stationary\nenvironments where the agent has to learn to adapt to changes from the emitting\nsources.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Burns_J/0/1/0/all/0/1\">J. Brian Burns</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sundaresan_A/0/1/0/all/0/1\">Aravind Sundaresan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sequeira_P/0/1/0/all/0/1\">Pedro Sequeira</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sadhu_V/0/1/0/all/0/1\">Vidyasagar Sadhu</a>"
}