{
  "title": "Lockdowns Actually Saved SHOCKINGLY Few Lives – Fake Fact Checkers DEBUNKED",
  "itunes:title": "Lockdowns Actually Saved SHOCKINGLY Few Lives – Fake Fact Checkers DEBUNKED",
  "pubDate": "Fri, 24 Jun 2022 05:30:32 +0000",
  "guid": "2e147352-3404-4151-b81d-63adc6aed6db",
  "link": "https://thejimmydoreshow.libsyn.com/lockdowns-actually-saved-shockingly-few-lives-fake-fact-checkers-debunked",
  "itunes:image": "",
  "description": "<p>When Johns Hopkins Economics Professor Steve Hanke released a metastudy indicating that COVID lockdowns had only saved a small number of lives compared to the astronomical figure that had been reported by an Imperial College study, the backlash was quick and fevered. The Imperial College researchers, along with \"fact checkers\" like Snopes sought to refute the claims Hanke and his co-authors made. Jimmy interviews Professor Hanke about the failure of lockdowns and the backlash his study received.<br /> <br /> Plus a segment on Krystal Ball's dismantling of Bill Maher over widespread misinformation about the causes of runaway inflation.<br /> <br /> Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Joe Biden and Vince Vaughn!</p>",
  "content:encoded": "<p>When Johns Hopkins Economics Professor Steve Hanke released a metastudy indicating that COVID lockdowns had only saved a small number of lives compared to the astronomical figure that had been reported by an Imperial College study, the backlash was quick and fevered. The Imperial College researchers, along with \"fact checkers\" like Snopes sought to refute the claims Hanke and his co-authors made. Jimmy interviews Professor Hanke about the failure of lockdowns and the backlash his study received.  Plus a segment on Krystal Ball's dismantling of Bill Maher over widespread misinformation about the causes of runaway inflation.  Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Joe Biden and Vince Vaughn!</p>",
  "enclosure": "",
  "itunes:duration": "01:06:59",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "When Johns Hopkins Economics Professor Steve Hanke released a metastudy indicating that COVID lockdowns had only saved a small number of lives compared to the astronomical figure that had been reported by an Imperial College study, the backlash was...",
  "itunes:episodeType": "full",
  "itunes:summary": "When Johns Hopkins Economics Professor Steve Hanke released a metastudy indicating that COVID lockdowns had only saved a small number of lives compared to the astronomical figure that had been reported by an Imperial College study, the backlash was quick and fevered. The Imperial College researchers, along with \"fact checkers\" like Snopes sought to refute the claims Hanke and his co-authors made. Jimmy interviews Professor Hanke about the failure of lockdowns and the backlash his study received. Plus a segment on Krystal Ball's dismantling of Bill Maher over widespread misinformation about the causes of runaway inflation. Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Joe Biden and Vince Vaughn!"
}