{
  "title": "164: The Disappearance of Phoenix Coldon",
  "link": "https://audioboom.com/posts/7769577",
  "itunes:episode": 164,
  "itunes:title": "The Disappearance of Phoenix Coldon",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3431,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>\n<strong>FAM! This is a two part series! </strong><a href=\"https://www.patreon.com/TrueCrimeObsessed\"><strong>Episode 2 is available ad-free right now at the $5 tier on our Patreon.</strong></a><strong> Part 2 will be our regular episode next week.<br>\n</strong><br>\n\n</div>\n<div>At 3pm on December 18, 2011, 23-year-old Phoenix Coldon got in her card and left her family home. Her parents thought she was going to a convenience store and then to a friend’s house. She was expected home later that night, but has never been seen again. <strong>But there are lots of clues to suggest that Phoenix is alive and is out there somewhere. </strong>This two-part series investigates what happened to Phoenix: did she get fed up with her life and leave on purpose? Was she kidnapped and forced into the sex trade? Or did she die the day she vanished? <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>The Vow</strong>\" \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n<div>\n<br>\n<strong>YOU GUYS WE LAUNCHED A NEW PODCAST!!</strong> Each week on <a href=\"https://www.centuriespod.com/\">\"Crimes of the Centuries\"</a> host Amber Hunt (of the Accused podcast) takes us on a deep investigative dive into a crime that was huge when it happened, but has been lost to time--and one you've likely never heard of. From the 220 year old murder that brought Alexander Hamilton and Aaron Burr together to fight for the defense, to Jazz Age thrill killers, Lady mob bosses, murdering grandmothers, and serial killers you've never heard of. <strong>Check out \"Crimes of the Centuries wherever you get your podcasts. </strong>\n</div>\n<div><br>\n</div>\n<div>\n<br>\n<br>\n\n</div>\n<div>\n<br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 12 Jan 2021 11:00:00 +0000",
  "guid": "tag:audioboom.com,2021-01-11:/posts/7769577",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}