{
  "title": "Episode 93: &#8220;Please Mr. Postman&#8221; by the Marvelettes",
  "link": "https://500songs.com/podcast/episode-93-please-mr-postman-by-the-marvelettes/",
  "pubDate": "Mon, 10 Aug 2020 10:49:40 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-93-please-mr-postman-by-the-marvelettes/",
  "description": "Episode ninety-three of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Please Mr. Postman\" by the Marvelettes, and the career of the first group to have a number one on a Motown label. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"<a href=\"https://www.patreon.com/posts/40299430\">Take Good Care of My Baby\" by Bobby Vee</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Erratum</strong>\n\nAfter recording this, I happened to discover that in 2017 Katherine actually came out of retirement and formed a new “Marvelettes”, who recorded in the UK in 2017 with someone called “Hitsville Chalky”.\n\n<strong>Resources</strong>\n\nThis week's Mixcloud playlist is split into two parts, because of the number of Marvelettes songs. <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-93a-please-mr-postman/\">Part one</a>, and <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-93b-please-mr-postman/\">part two</a>.\n\n<a href=\"https://amzn.to/3aanGvr\"><em>The Original Marvelettes: Motown's Mystery Girl Group</em> by Marc Taylor </a>is the only biography of the group. Sadly it currently goes for silly money.\n\n<a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em>&nbsp;by Nelson George</a>&nbsp;is an excellent popular history of the various companies that became Motown.\n\n<a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em>&nbsp;by Berry Gordy</a>&nbsp;is Gordy's own, understandably one-sided, but relatively well-written, autobiography.\n\n<a href=\"https://amzn.to/2VIpXII\"><em>Women of Motown: An Oral History</em>&nbsp;by Susan Whitall</a> is a collection of interviews with women involved in Motown, including Katherine Anderson Schaffner.\n\n<a href=\"https://amzn.to/2xVdvfD\"><em>I Hear a Symphony: Motown and Crossover R&B&nbsp;</em>by J. Andrew Flory</a>&nbsp;is an academic look at Motown.\n\n<a href=\"https://amzn.to/2VLquJX\"><em>The Motown Encyclopaedia</em>&nbsp;by Graham Betts</a>&nbsp;is an exhaustive look at the people and records involved in Motown's thirty-year history.\n\nAnd&nbsp;<a href=\"https://motownjunkies.co.uk/\">Motown Junkies</a>&nbsp;is an infrequently-updated blog looking at (so far) the first 693 tracks released on Motown singles.\n\nThere is a Complete Motown Singles 1959-62 box available from Hip-O-Select with comprehensive liner notes, but if you just want the music, I recommend instead&nbsp;<a href=\"https://amzn.to/2YbX0qa\">this much cheaper bare-bones box</a>&nbsp;from Real Gone Music.\n\nAnd <a href=\"https://amzn.to/3itRqpI\">this three-CD set</a> contains the group's complete discography up to mid-1966 -- the Gladys Horton years.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;<a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nWhen we left the Tamla Motown family of labels, a couple of months back, they'd finally had their first big hit with Barrett Strong's \"Money\", and the label was starting to pull together the full creative team that would be responsible for its later successes. But while \"Money\" is a great record, it's not a record with what would later become known as the \"Motown Sound\" -- it sounds far more like a Ray Charles record than the records that would later make Motown's name.\n\nSo today, we're going to look at the first number one to come out of Motown -- a record that definitely did have the Motown sound, and which established the label as the sound of young America. Today, we're going to look at \"Please Mr. Postman\":\n\n[Excerpt: The Marvelettes, \"Please Mr. Postman\"]\n\nThe story of the Marvelettes starts with Gladys Horton, who lived in the small town of Inkster in Michigan. When Horton was only fourteen, she had formed a group called the Del-Rhythmettes, who made one single, \"Chic-A-Boomer\":\n\n[Excerpt: The Del-Rhythmettes, \"Chic-A-Boomer\"]\n\nThat had got a little bit of airplay on local radio, but had otherwise been unsuccessful, and the Del-Rhythmettes had split up. But Gladys still wanted to make music, and she started looking around for other people to sing with. One who caught her eye was a young girl who would appear in the High School talent contests, named Georgia Dobbins. By the time Gladys got to high school herself, Georgia had graduated, but Gladys persuaded her to join a group she put together for her own talent contest entry. The group she formed originally jokingly named themselves the Casinyettes -- because they \"can't sing yet\" -- and that was the name under which they performed at the talent contest.\n\nThere was a reason that Gladys wanted Georgia for this talent contest -- this one had, as its first prize, the chance of an audition at Motown. Motown was still a small label, but it had started to have hits, and everyone in Michigan with an interest in music knew about Berry Gordy. In particular, Motown had just released \"Shop Around\" by the Miracles.\n\nSmokey Robinson had written that song, and it had been released to no real effect. The record had been pulled, and another version released. THAT had had no success either, and then at three o'clock in the morning Berry Gordy had suddenly realised that the record needed a new, faster, arrangement. He'd phoned up Smokey and told him to get the group together and into the studio, before he lost the inspiration, even though it was the middle of the night. They did, and the second version of \"Shop Around\" was pulled and replaced with the new third version, which went to number two on the pop charts and sold a million copies:\n\n[Excerpt: The Miracles, \"Shop Around\"]\n\nSo Motown were now in the big leagues, and the chance of recording for them was an exciting one, and one that the girls, and Gladys in particular, wanted.\n\nThe Casinyettes at this point consisted of Gladys, Georgia, Georgeanna Tillman, Katherine Anderson, and Juanita Cowart -- I've also seen Juanita's name reported as Wyanetta, and can't find anything which definitively says which it was. At the talent show, they sang \"Maybe\" by the Chantels:\n\n[Excerpt: The Chantels, \"Maybe\"]\n\nThe group came fourth -- but one of their teachers, Shirley Sharpley, knew the person from Motown who was arranging the auditions, and persuaded them to offer auditions to the top five, rather than just to the winners. The Cansinyettes went to their audition, and Motown were interested, but told them they had to come up with something original before they'd be signed. They went back to Inkster and got to work. A friend of Georgia, William Garrett, had started a blues song about a postman, and Georgia worked on his idea, writing most of the lyrics and recasting it as something less bluesy.\n\nBut then Georgia had to quit the group. Her father hadn't known she was singing until she brought the record contract home for him to countersign -- as she was under twenty-one, she needed a parent to sign it, and her mother was too ill. Her father believed the entertainment industry to be sinful, and wouldn't sign. She was so depressed that she gave up singing altogether, and by her own account didn't sing a note until 1978. By the time they came back to Motown with the beginnings of a song, Georgia had been replaced by Wanda Young, though the remaining group members were still singing her song.\n\nThe song was decent, but it needed work. The group were assigned to Brian Holland, who had a listen to the song and had a brainwave. Holland and his brother Eddie were both on Motown staff at the time, but before joining Motown Holland had been in a group called the Fidelitones. The Fidelitones had recorded some tracks for Aladdin, produced by Gordy, in the late fifties but they'd never been released:\n\n[Excerpt: The Fidelitones, \"Is It Too Late?\"]\n\nHolland had stayed in touch with Freddie Gorman, another member of the group. Gorman still had musical ambitions, and he would pop into Motown every day after he finished work -- as a postman.\n\nSo when Gorman popped in that day, Holland asked him to chip in ideas for the song and use his experience to make it more realistic -- though there's nothing much in the finished song that would seem to require expertise. Gorman became one of five credited writers on the song, along with Holland, Georgia Dobbins, William Garrett, and Holland's normal songwriting partner Robert Bateman, who worked with Holland as a songwriting and production team called \"Brianbert\". Before moving into production, Bateman had been a member of the Satintones, who had made several unsuccessful records for Motown, including this one that was a knock-off of \"There Goes My Baby\":\n\n[Excerpt: The Satintones, \"My Beloved\"]\n\nThe Casinyettes weren't the first girl group to be signed to the label -- Motown had already signed one girl group, a group called the Primettes, who had been renamed and who had so far released two singles:\n\n[Excerpt: The Supremes, \"I Want a Guy\"]\n\nBut the Supremes, as they were renamed, wouldn't become successful for several years, and were generally regarded as a joke among the Motown staff, who thought -- not entirely without reason -- that they had been signed more because Berry Gordy was attracted to Diane Ross, one of the members of the group, than because of any talent they had.\n\nOne of the girls, though, Florence Ballard, was very popular at Motown, and was generally regarded as being helpful and friendly. She worked with Gladys on her lead vocal part, and helped her craft her performance.\n\nThe production that Brian Holland crafted for the song was very heavy on the percussion -- along with piano player Popcorn Wylie, guitarist Eddie Willis, and bass player James Jamerson, the backing musicians included a percussion player, Eddie \"Bongo\" Brown, and two drummers -- the normal session drummer on most of the Motown recordings, Benny Benjamin, and a young man who had been a member of the last lineup of the Moonglows before Harvey Fuqua had moved over to working for the Gordy family labels, and who was now doing whatever he could around the studio, named Marvin Gaye.\n\nThere was one final change that needed to be made -- The Casinyettes was obviously a joke name, and they needed a better one. The name they were eventually given supposedly came after Berry Gordy heard them sing and said \"those girls are marvels\". The Marvelettes were born, and their first single was the catchiest thing Motown had put out to that point:\n\n[Excerpt: The Marvelettes, \"Please Mr. Postman\"]\n\n\"Please Mr. Postman\" became the second million seller from Motown, and its first number one on the pop charts. It only stayed there for one week, but that one week was all that was needed -- Motown was now a label that everyone in the industry had to notice.\n\nAnd \"Please Mr. Postman\" was the record that saved Motown. I've talked before about how a hit record could put a small label out of business -- they had to pay for the records to be pressed up and distributed, but it would be many months before the distributors would actually pay them the money they were owed. And many distributors would not pay at all -- they reasoned that a small label wasn't going to be able to do anything about it if they didn't pay, so why bother?\n\nThe only leverage a small label with a big hit had was a second big hit. If they had another record the distributors wanted from them, then they could tell the distributors they wouldn't get it until they paid up. And after \"Shop Around\" sold a million copies, Motown's follow-ups had all sold poorly. They were running out of money, and they needed another hit quickly before they went bankrupt altogether.\n\nBerry Gordy had, early on, given the label a slogan -- Create, Make, and Sell -- because he wanted to make great records and then have them sell a lot of copies -- but around this time he realised that there was no point in selling the records if they didn't get paid for them. So reasoning that \"create\" and \"make\" were near-synonyms, he changed that slogan to Create, Sell, and Collect.\n\nBy being a second million-seller for Motown, \"Please Mr. Postman\" ensured that they got paid for the first one. If it hadn't come along, it's possible that Motown would just be a footnote in histories of Chess Records -- \"Chess also distributed a handful of records from a small Detroit label owned by Harvey Fuqua's brother-in-law, who co-wrote several hits for Jackie Wilson, before that label went bankrupt.\"\n\nBut as it is, the Marvelettes were now big stars. For the followup, Berry Gordy wanted to do something that was as close to the hit as possible . This would be the policy from this point on with Motown -- if someone had a hit, the same producers and songwriters would be assigned to come up with something that sounded like the hit, and the artist would only go in a different direction once they stopped having hits with their original formula. In this case, the Marvelettes' second single was designed not only to capitalise on their original hit, but on the popularity of the Twist craze, and so they released \"Twistin' Postman\":\n\n[Excerpt: The Marvelettes, \"Twistin' Postman\"]\n\n\"Twistin' Postman\" went top forty, but it didn't do anything like as well as \"Please Mr. Postman\". But just as with their first single, one of the group brought in a new song which brought them back to the top ten, if not number one. This time it was Gladys, who came up with a song called \"Playboy\", which Brian Holland, Robert Bateman, and Mickey Stevenson rewrote, and which made number seven on the pop charts and number four on the R&B charts.\n\n[Excerpt: The Marvelettes, \"Playboy\"]\n\nMeanwhile, Freddie Gorman had continued working with Brian Holland as well, and had put out a single under his own name, \"The Day Will Come\":\n\n[Excerpt: Freddie Gorman, \"The Day Will Come\"]\n\nUnfortunately, that wasn't a success, and Freddie had to continue on his post rounds. That also meant that his songwriting partnership with Holland came to an end -- Freddie kept finding that when he came round to Hitsville after work, if Brian Holland had had an idea for a song, he'd already finished it -- usually with the help of his brother Eddie and their new writing partner Lamont Dozier.\n\nAnd there were problems brewing for the Marvelettes, too. They'd felt all along that they were looked down on a bit by the people from Detroit, who thought of them as hicks from the sticks because they came from Inkster. They were so self-conscious about this that it led to the first member leaving the group. They appeared on American Bandstand, and Juanita said that Detroit was a suburb of Inkster, when she'd meant to say that Inkster was a suburb of Detroit. She felt so bad about this slipup and the way she was mocked for it that she had a breakdown, and ended up leaving the group.\n\nThat didn't bother Motown too much -- when \"Please Mr. Postman\" had been a hit but the girls had been at school, it had been suggested that they could just send any five girls out on the road as the Marvelettes, until the girls put their foot down about that. Not only that, but at one point when Wanda had been pregnant, Motown had replaced her on the road with Florence Ballard from the Supremes -- the contracts for that tour had specified five Marvelettes, the Supremes were the least successful group on Motown at the time, and the girls got on well with Florence. If Motown were willing to do that, they were definitely willing to have the group just carry on with one member gone, and just make sure the contracts said there would be four Marvelettes.\n\nThey carried on as a four-piece group, and had a few more records, mostly written and produced by Smokey Robinson but with others like Mickey Stevenson and Marvin Gaye sometimes contributing, but while those records did okay on the R&B charts, they didn't have much success on the pop charts, mostly getting to around number fifty. At one point, Motown started to wonder if they needed to change things up a little -- they put out a single by the group with Gladys and Wanda singing a dual lead, and with the group joined by Motown's in-house backing vocal group The Andantes. The record was put out under the name The Darnells, but was unsuccessful:\n\n[Excerpt: The Darnells, \"Too Hurt Too Cry, Too Much In Love To Say Goodbye”]\n\nUnfortunately for them, they missed the chance at a really big hit. Holland, Dozier, and Holland had written a song for them, but Gladys didn't like it, she thought it was too simplistic, and so they took it to the group who were still known within Motown as the no-hit Supremes. We'll be looking at \"Where Did Our Love Go?\" in more detail next year.\n\nEddie Holland did cowrite a hit for them with Norman Whitfield, though -- though it wasn't a monster hit like \"Where Did Our Love Go?\", it did give all the girls a chance to have a solo spot, a rarity for them:\n\n[Excerpt: The Marvelettes, \"Too Many Fish in the Sea\"]\n\nThat took them back into the top thirty, and made the top five on the R&B chart. It would be the last hit that they would have with Georgeanna in the group, though -- she'd been diagnosed with sickle-cell anaemia as a child, and the constant strain of touring made her more ill.\n\nThe tours had been a shock for all of them, to be honest. Their first major national tour was the first Motor Town Revue in 1962 -- a tour with a lineup that seems preposterously good these days. All of Motown's major acts, and several acts that weren't yet major but soon would be, were on the same bill -- the Miracles, Mary Wells, the Marvelettes, the Temptations, Marv Johnson, Stevie Wonder, the Contours, Marvin Gaye, Martha and the Vandellas, the Supremes, and Singing Sammy Ward.\n\nThe girls had grown up in Michigan, and while they had an intellectual understanding that the South was different, they were unprepared for the realities of segregation, of not being able to use public toilets or eat in the same restaurants that white people did. That was awful enough, but there was also the fact that all those acts were on the same bus. And starting the year before, there had been the phenomenon of Freedom Riders -- black people from the North who had been coming down to the south to sit in whites-only seats on Greyhound buses, to protest segregation.\n\nIn several places in the South, the sight of a lot of black people on a bus brought the Freedom Riders to mind, and people actually took pot-shots at the bus. A couple of years living like that took an immense toll on Georgeanna's health, and she started suffering from unexplained fatigue. Eventually it was realised that she had lupus, an autoimmune disease which is now largely treatable if not curable, but at the time was often a death sentence. She retired from music, going to work for Motown as a secretary instead. She died in 1980, aged only thirty-six.\n\nThe remaining three carried on as a trio, and they were about to have a second commercial wind. After a couple of flop follow-ups to \"Too Many Fish in the Sea\", Smokey Robinson took over their production, and decided to start using Wanda as the lead vocalist, rather than Gladys, who had sung lead on their hits up to that point. \"Don't Mess With Bill\", their first single of 1966, became their first top ten pop hit since \"Playboy\" in early 1962:\n\n[Excerpt: The Marvelettes, \"Don't Mess With Bill\"]\n\nRobinson also wrote the marvellous \"The Hunter Gets Captured by the Game\" for the group:\n\n[Excerpt: The Marvelettes, \"The Hunter Gets Captured by the Game\"]\n\nOr, at least, he wrote it for Wanda. By this point, while the records were getting released as by \"the Marvelettes\", Robinson was only using Wanda for lead vocals, and having the Andantes sing all the backing vocals. The explanation for this was generally that the group were on tour all the time, and it was easier to make the records without them and then get Wanda just to sing the lead, and the other members reluctantly accepted that, but it rankled.\n\nThere were other problems, too. Juanita and Georgeanna had been the glue holding the group together -- they'd been the ones who had been friends with all the others. Katherine, Gladys, and Wanda, hadn't known each other before forming the group, and they started to discover that they weren't hugely fond of each other now.\n\nAt first, they still worked well together, each having their assigned area of responsibility -- Gladys was a combination musical director and choreographer, working out the group's setlists and dance moves, Katherine was the spokesperson in interviews, and looked after the group's money, and Wanda was the lead singer. This worked for a while, but as Katherine would later put it, when there had been five of them, they'd been friends. Now they were somewhere between acquaintances and co-workers.\n\nAnd then in 1967, Gladys decided to leave the group. This made the group an even lower priority for Motown -- while Wanda was by now the undisputed lead singer, within Motown they were thought of as Gladys' group, as she'd been the leader in the beginning.\n\nMotown did decide to get someone else in to replace her. They could cope with the group going from five members to four, and from four to three -- three women, after all, was still a girl group. But once they'd got down to two members, they needed a third. Harvey Fuqua suggested Ann Bogan, who he'd discovered a while before and recorded a few duets with:\n\n[Excerpt: Harvey and Ann, \"What Can You Do Now?\"]\n\nAnn was a sort of general utility singer around Motown -- she'd sung with the Andantes and the Challengers Three, and she'd also gone out on the road with Marvin Gaye, subbing for his duet partner Tammi Terrell, when the latter had become sick with the brain tumour that eventually killed her.\n\nAnn replaced Gladys, and the group made two further albums, and Ann was at least allowed to sing on album tracks. The group continued having R&B hits, but while they kept releasing great records like \"Destination: Anywhere\", they were by now barely scraping the hot one hundred on the pop charts:\n\n[Excerpt: The Marvelettes, \"Destination: Anywhere\"]\n\nAnd Wanda was having problems. She'd been doing too much cocaine and drinking too much, and was starting to act strangely. Then in 1969 her younger sister was shot dead, by her other sister's estranged husband (who seems to have thought he was shooting the other sister), and to compound matters while the group were on tour in Europe someone spiked Wanda's drink. She was never the same again, and has had mental health problems for the last fifty years. The group split up, though nothing was announced -- they just didn't get booked on any more tours, and went their separate ways.\n\nBogan went on to join a group called Love, Peace, and Happiness, who had a minor hit with a song that had been, coincidentally, co-written by Katherine, who wrote it for Gladys Knight:\n\n[Excerpt: Love, Peace, and Happiness, \"I Don't Want to Do Wrong\"]\n\nThat group then joined with Harvey Fuqua in a seventeen-piece funk band called New Birth, with Bogan singing on their hit \"I Can Understand It\":\n\n[Excerpt: New Birth, \"I Can Understand It\"]\n\nMotown decided to give the Marvelettes one more try, and in 1970 they got Wanda in to record an album titled The Return of the Marvelettes. This was essentially a solo album, produced by Smokey Robinson, but they did try to get Katherine to appear on the cover photograph. She told the label that if she wasn't good enough to sing on the record, she wasn't good enough to appear on the cover, either, and so the cover, like the record, only featured Wanda of the original Marvelettes.\n\nOver the next few decades, various groups toured under the Marvelettes name, none featuring any of the original members -- Motown, rather than the women, had owned the group name, and had sold it off. Gladys, Katherine, and Juanita were busy being homemakers, and Wanda and Georgeanna were too ill to consider a music career.\n\nThen in the late 1980s, Ian Levine entered the picture. Levine is a British DJ who at the time owned and ran Motor City Records, which put out new recordings by people who had released records on Motown in the sixties.\n\nHe got over a hundred former Motown artists to record for him, and one album he put out was a Marvelettes reunion of sorts -- he managed to persuade Gladys and Wanda out of retirement to make a new Marvelettes album with two new backing vocalists, Echo Johnson and Jean Maclean. The new record was a mixture of remakes of their old hits and new songs by Levine, like \"Secret Love Affair\":\n\n[Excerpt: The Marvelettes, \"Secret Love Affair\"]\n\nWanda was still too ill to perform regularly, but Gladys went out on tour on the oldies circuit, singing her old hits as \"Gladys Horton of the Marvelettes\", as none of the group owned the original name. She and Katherine were in the process of suing to regain the name under the Truth in Music Act, when she died of a stroke in 2011.\n\nOf the other Marvelettes, Katherine and Juanita are retired, though Katherine still gives regular interviews about her time with the group, and Wanda's mental health has apparently improved enough in the last few years that she can perform again. They're all apparently happy with their situations now, and don't miss the old life.\n\nThey do miss the recognition, though. For the twenty-fifth, fortieth, fiftieth, and sixtieth anniversary celebrations of Motown, TV specials were produced featuring many of the label's acts, and honouring the label's history. None of the members of the first group to hit number one on the label were invited to be part of any of them.",
  "itunes:subtitle": "Episode ninety-three of A History of Rock Music in Five Hundred Songs looks at Please Mr. Postman by the Marvelettes, and the career of the first group to have a number one on a Motown label. Click the full post to read liner notes, links to more informa",
  "itunes:keywords": "Berry Gordy,Freddie Gorman,girl groups,Holland-Dozier-Holland,lawsuits,Marvin Gaye,Motown,Robert Bateman,Smokey Robinson,The Funk Brothers,The Marvelettes,vocal groups",
  "itunes:episodeType": "full",
  "itunes:episode": 93,
  "content:encoded": "Episode ninety-three of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Please Mr. Postman\" by the Marvelettes, and the career of the first group to have a number one on a Motown label. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"<a href=\"https://www.patreon.com/posts/40299430\">Take Good Care of My Baby\" by Bobby Vee</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Erratum</strong>\n\nAfter recording this, I happened to discover that in 2017 Katherine actually came out of retirement and formed a new “Marvelettes”, who recorded in the UK in 2017 with someone called “Hitsville Chalky”.\n\n<strong>Resources</strong>\n\nThis week's Mixcloud playlist is split into two parts, because of the number of Marvelettes songs. <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-93a-please-mr-postman/\">Part one</a>, and <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-93b-please-mr-postman/\">part two</a>.\n\n<a href=\"https://amzn.to/3aanGvr\"><em>The Original Marvelettes: Motown's Mystery Girl Group</em> by Marc Taylor </a>is the only biography of the group. Sadly it currently goes for silly money.\n\n<a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em>&nbsp;by Nelson George</a>&nbsp;is an excellent popular history of the various companies that became Motown.\n\n<a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em>&nbsp;by Berry Gordy</a>&nbsp;is Gordy's own, understandably one-sided, but relatively well-written, autobiography.\n\n<a href=\"https://amzn.to/2VIpXII\"><em>Women of Motown: An Oral History</em>&nbsp;by Susan Whitall</a> is a collection of interviews with women involved in Motown, including Katherine Anderson Schaffner.\n\n<a href=\"https://amzn.to/2xVdvfD\"><em>I Hear a Symphony: Motown and Crossover R&B&nbsp;</em>by J. Andrew Flory</a>&nbsp;is an academic look at Motown.\n\n<a href=\"https://amzn.to/2VLquJX\"><em>The Motown Encyclopaedia</em>&nbsp;by Graham Betts</a>&nbsp;is an exhaustive look at the people and records involved in Motown's thirty-year history.\n\nAnd&nbsp;<a href=\"https://motownjunkies.co.uk/\">Motown Junkies</a>&nbsp;is an infrequently-updated blog looking at (so far) the first 693 tracks released on Motown singles.\n\nThere is a Complete Motown Singles 1959-62 box available from Hip-O-Select with comprehensive liner notes, but if you just want the music, I recommend instead&nbsp;<a href=\"https://amzn.to/2YbX0qa\">this much cheaper bare-bones box</a>&nbsp;from Real Gone Music.\n\nAnd <a href=\"https://amzn.to/3itRqpI\">this three-CD set</a> contains the group's complete discography up to mid-1966 -- the Gladys Horton years.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;<a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nWhen we left the Tamla Motown family of labels, a couple of months back, they'd finally had their first big hit with Barrett Strong's \"Money\", and the label was starting to pull together the full creative team that would be responsible for its later successes. But while \"Money\" is a great record, it's not a record with what would later become known as the \"Motown Sound\" -- it sounds far more like a Ray Charles record than the records that would later make Motown's name.\n\nSo today, we're going to look at the first number one to come out of Motown -- a record that definitely did have the Motown sound, and which established the label as the sound of young America. Today, we're going to look at \"Please Mr. Postman\":\n\n[Excerpt: The Marvelettes, \"Please Mr. Postman\"]\n\nThe story of the Marvelettes starts with Gladys Horton, who lived in the small town of Inkster in Michigan. When Horton was only fourteen, she had formed a group called the Del-Rhythmettes, who made one single, \"Chic-A-Boomer\":\n\n[Excerpt: The Del-Rhythmettes, \"Chic-A-Boomer\"]\n\nThat had got a little bit of airplay on local radio, but had otherwise been unsuccessful, and the Del-Rhythmettes had split up. But Gladys still wanted to make music, and she started looking around for other people to sing with. One who caught her eye was a young girl who would appear in the High School talent contests, named Georgia Dobbins. By the time Gladys got to high school herself, Georgia had graduated, but Gladys persuaded her to join a group she put together for her own talent contest entry. The group she formed originally jokingly named themselves the Casinyettes -- because they \"can't sing yet\" -- and that was the name under which they performed at the talent contest.\n\nThere was a reason that Gladys wanted Georgia for this talent contest -- this one had, as its first prize, the chance of an audition at Motown. Motown was still a small label, but it had started to have hits, and everyone in Michigan with an interest in music knew about Berry Gordy. In particular, Motown had just released \"Shop Around\" by the Miracles.\n\nSmokey Robinson had written that song, and it had been released to no real effect. The record had been pulled, and another version released. THAT had had no success either, and then at three o'clock in the morning Berry Gordy had suddenly realised that the record needed a new, faster, arrangement. He'd phoned up Smokey and told him to get the group together and into the studio, before he lost the inspiration, even though it was the middle of the night. They did, and the second version of \"Shop Around\" was pulled and replaced with the new third version, which went to number two on the pop charts and sold a million copies:\n\n[Excerpt: The Miracles, \"Shop Around\"]\n\nSo Motown were now in the big leagues, and the chance of recording for them was an exciting one, and one that the girls, and Gladys in particular, wanted.\n\nThe Casinyettes at this point consisted of Gladys, Georgia, Georgeanna Tillman, Katherine Anderson, and Juanita Cowart -- I've also seen Juanita's name reported as Wyanetta, and can't find anything which definitively says which it was. At the talent show, they sang \"Maybe\" by the Chantels:\n\n[Excerpt: The Chantels, \"Maybe\"]\n\nThe group came fourth -- but one of their teachers, Shirley Sharpley, knew the person from Motown who was arranging the auditions, and persuaded them to offer auditions to the top five, rather than just to the winners. The Cansinyettes went to their audition, and Motown were interested, but told them they had to come up with something original before they'd be signed. They went back to Inkster and got to work. A friend of Georgia, William Garrett, had started a blues song about a postman, and Georgia worked on his idea, writing most of the lyrics and recasting it as something less bluesy.\n\nBut then Georgia had to quit the group. Her father hadn't known she was singing until she brought the record contract home for him to countersign -- as she was under twenty-one, she needed a parent to sign it, and her mother was too ill. Her father believed the entertainment industry to be sinful, and wouldn't sign. She was so depressed that she gave up singing altogether, and by her own account didn't sing a note until 1978. By the time they came back to Motown with the beginnings of a song, Georgia had been replaced by Wanda Young, though the remaining group members were still singing her song.\n\nThe song was decent, but it needed work. The group were assigned to Brian Holland, who had a listen to the song and had a brainwave. Holland and his brother Eddie were both on Motown staff at the time, but before joining Motown Holland had been in a group called the Fidelitones. The Fidelitones had recorded some tracks for Aladdin, produced by Gordy, in the late fifties but they'd never been released:\n\n[Excerpt: The Fidelitones, \"Is It Too Late?\"]\n\nHolland had stayed in touch with Freddie Gorman, another member of the group. Gorman still had musical ambitions, and he would pop into Motown every day after he finished work -- as a postman.\n\nSo when Gorman popped in that day, Holland asked him to chip in ideas for the song and use his experience to make it more realistic -- though there's nothing much in the finished song that would seem to require expertise. Gorman became one of five credited writers on the song, along with Holland, Georgia Dobbins, William Garrett, and Holland's normal songwriting partner Robert Bateman, who worked with Holland as a songwriting and production team called \"Brianbert\". Before moving into production, Bateman had been a member of the Satintones, who had made several unsuccessful records for Motown, including this one that was a knock-off of \"There Goes My Baby\":\n\n[Excerpt: The Satintones, \"My Beloved\"]\n\nThe Casinyettes weren't the first girl group to be signed to the label -- Motown had already signed one girl group, a group called the Primettes, who had been renamed and who had so far released two singles:\n\n[Excerpt: The Supremes, \"I Want a Guy\"]\n\nBut the Supremes, as they were renamed, wouldn't become successful for several years, and were generally regarded as a joke among the Motown staff, who thought -- not entirely without reason -- that they had been signed more because Berry Gordy was attracted to Diane Ross, one of the members of the group, than because of any talent they had.\n\nOne of the girls, though, Florence Ballard, was very popular at Motown, and was generally regarded as being helpful and friendly. She worked with Gladys on her lead vocal part, and helped her craft her performance.\n\nThe production that Brian Holland crafted for the song was very heavy on the percussion -- along with piano player Popcorn Wylie, guitarist Eddie Willis, and bass player James Jamerson, the backing musicians included a percussion player, Eddie \"Bongo\" Brown, and two drummers -- the normal session drummer on most of the Motown recordings, Benny Benjamin, and a young man who had been a member of the last lineup of the Moonglows before Harvey Fuqua had moved over to working for the Gordy family labels, and who was now doing whatever he could around the studio, named Marvin Gaye.\n\nThere was one final change that needed to be made -- The Casinyettes was obviously a joke name, and they needed a better one. The name they were eventually given supposedly came after Berry Gordy heard them sing and said \"those girls are marvels\". The Marvelettes were born, and their first single was the catchiest thing Motown had put out to that point:\n\n[Excerpt: The Marvelettes, \"Please Mr. Postman\"]\n\n\"Please Mr. Postman\" became the second million seller from Motown, and its first number one on the pop charts. It only stayed there for one week, but that one week was all that was needed -- Motown was now a label that everyone in the industry had to notice.\n\nAnd \"Please Mr. Postman\" was the record that saved Motown. I've talked before about how a hit record could put a small label out of business -- they had to pay for the records to be pressed up and distributed, but it would be many months before the distributors would actually pay them the money they were owed. And many distributors would not pay at all -- they reasoned that a small label wasn't going to be able to do anything about it if they didn't pay, so why bother?\n\nThe only leverage a small label with a big hit had was a second big hit. If they had another record the distributors wanted from them, then they could tell the distributors they wouldn't get it until they paid up. And after \"Shop Around\" sold a million copies, Motown's follow-ups had all sold poorly. They were running out of money, and they needed another hit quickly before they went bankrupt altogether.\n\nBerry Gordy had, early on, given the label a slogan -- Create, Make, and Sell -- because he wanted to make great records and then have them sell a lot of copies -- but around this time he realised that there was no point in selling the records if they didn't get paid for them. So reasoning that \"create\" and \"make\" were near-synonyms, he changed that slogan to Create, Sell, and Collect.\n\nBy being a second million-seller for Motown, \"Please Mr. Postman\" ensured that they got paid for the first one. If it hadn't come along, it's possible that Motown would just be a footnote in histories of Chess Records -- \"Chess also distributed a handful of records from a small Detroit label owned by Harvey Fuqua's brother-in-law, who co-wrote several hits for Jackie Wilson, before that label went bankrupt.\"\n\nBut as it is, the Marvelettes were now big stars. For the followup, Berry Gordy wanted to do something that was as close to the hit as possible . This would be the policy from this point on with Motown -- if someone had a hit, the same producers and songwriters would be assigned to come up with something that sounded like the hit, and the artist would only go in a different direction once they stopped having hits with their original formula. In this case, the Marvelettes' second single was designed not only to capitalise on their original hit, but on the popularity of the Twist craze, and so they released \"Twistin' Postman\":\n\n[Excerpt: The Marvelettes, \"Twistin' Postman\"]\n\n\"Twistin' Postman\" went top forty, but it didn't do anything like as well as \"Please Mr. Postman\". But just as with their first single, one of the group brought in a new song which brought them back to the top ten, if not number one. This time it was Gladys, who came up with a song called \"Playboy\", which Brian Holland, Robert Bateman, and Mickey Stevenson rewrote, and which made number seven on the pop charts and number four on the R&B charts.\n\n[Excerpt: The Marvelettes, \"Playboy\"]\n\nMeanwhile, Freddie Gorman had continued working with Brian Holland as well, and had put out a single under his own name, \"The Day Will Come\":\n\n[Excerpt: Freddie Gorman, \"The Day Will Come\"]\n\nUnfortunately, that wasn't a success, and Freddie had to continue on his post rounds. That also meant that his songwriting partnership with Holland came to an end -- Freddie kept finding that when he came round to Hitsville after work, if Brian Holland had had an idea for a song, he'd already finished it -- usually with the help of his brother Eddie and their new writing partner Lamont Dozier.\n\nAnd there were problems brewing for the Marvelettes, too. They'd felt all along that they were looked down on a bit by the people from Detroit, who thought of them as hicks from the sticks because they came from Inkster. They were so self-conscious about this that it led to the first member leaving the group. They appeared on American Bandstand, and Juanita said that Detroit was a suburb of Inkster, when she'd meant to say that Inkster was a suburb of Detroit. She felt so bad about this slipup and the way she was mocked for it that she had a breakdown, and ended up leaving the group.\n\nThat didn't bother Motown too much -- when \"Please Mr. Postman\" had been a hit but the girls had been at school, it had been suggested that they could just send any five girls out on the road as the Marvelettes, until the girls put their foot down about that. Not only that, but at one point when Wanda had been pregnant, Motown had replaced her on the road with Florence Ballard from the Supremes -- the contracts for that tour had specified five Marvelettes, the Supremes were the least successful group on Motown at the time, and the girls got on well with Florence. If Motown were willing to do that, they were definitely willing to have the group just carry on with one member gone, and just make sure the contracts said there would be four Marvelettes.\n\nThey carried on as a four-piece group, and had a few more records, mostly written and produced by Smokey Robinson but with others like Mickey Stevenson and Marvin Gaye sometimes contributing, but while those records did okay on the R&B charts, they didn't have much success on the pop charts, mostly getting to around number fifty. At one point, Motown started to wonder if they needed to change things up a little -- they put out a single by the group with Gladys and Wanda singing a dual lead, and with the group joined by Motown's in-house backing vocal group The Andantes. The record was put out under the name The Darnells, but was unsuccessful:\n\n[Excerpt: The Darnells, \"Too Hurt Too Cry, Too Much In Love To Say Goodbye”]\n\nUnfortunately for them, they missed the chance at a really big hit. Holland, Dozier, and Holland had written a song for them, but Gladys didn't like it, she thought it was too simplistic, and so they took it to the group who were still known within Motown as the no-hit Supremes. We'll be looking at \"Where Did Our Love Go?\" in more detail next year.\n\nEddie Holland did cowrite a hit for them with Norman Whitfield, though -- though it wasn't a monster hit like \"Where Did Our Love Go?\", it did give all the girls a chance to have a solo spot, a rarity for them:\n\n[Excerpt: The Marvelettes, \"Too Many Fish in the Sea\"]\n\nThat took them back into the top thirty, and made the top five on the R&B chart. It would be the last hit that they would have with Georgeanna in the group, though -- she'd been diagnosed with sickle-cell anaemia as a child, and the constant strain of touring made her more ill.\n\nThe tours had been a shock for all of them, to be honest. Their first major national tour was the first Motor Town Revue in 1962 -- a tour with a lineup that seems preposterously good these days. All of Motown's major acts, and several acts that weren't yet major but soon would be, were on the same bill -- the Miracles, Mary Wells, the Marvelettes, the Temptations, Marv Johnson, Stevie Wonder, the Contours, Marvin Gaye, Martha and the Vandellas, the Supremes, and Singing Sammy Ward.\n\nThe girls had grown up in Michigan, and while they had an intellectual understanding that the South was different, they were unprepared for the realities of segregation, of not being able to use public toilets or eat in the same restaurants that white people did. That was awful enough, but there was also the fact that all those acts were on the same bus. And starting the year before, there had been the phenomenon of Freedom Riders -- black people from the North who had been coming down to the south to sit in whites-only seats on Greyhound buses, to protest segregation.\n\nIn several places in the South, the sight of a lot of black people on a bus brought the Freedom Riders to mind, and people actually took pot-shots at the bus. A couple of years living like that took an immense toll on Georgeanna's health, and she started suffering from unexplained fatigue. Eventually it was realised that she had lupus, an autoimmune disease which is now largely treatable if not curable, but at the time was often a death sentence. She retired from music, going to work for Motown as a secretary instead. She died in 1980, aged only thirty-six.\n\nThe remaining three carried on as a trio, and they were about to have a second commercial wind. After a couple of flop follow-ups to \"Too Many Fish in the Sea\", Smokey Robinson took over their production, and decided to start using Wanda as the lead vocalist, rather than Gladys, who had sung lead on their hits up to that point. \"Don't Mess With Bill\", their first single of 1966, became their first top ten pop hit since \"Playboy\" in early 1962:\n\n[Excerpt: The Marvelettes, \"Don't Mess With Bill\"]\n\nRobinson also wrote the marvellous \"The Hunter Gets Captured by the Game\" for the group:\n\n[Excerpt: The Marvelettes, \"The Hunter Gets Captured by the Game\"]\n\nOr, at least, he wrote it for Wanda. By this point, while the records were getting released as by \"the Marvelettes\", Robinson was only using Wanda for lead vocals, and having the Andantes sing all the backing vocals. The explanation for this was generally that the group were on tour all the time, and it was easier to make the records without them and then get Wanda just to sing the lead, and the other members reluctantly accepted that, but it rankled.\n\nThere were other problems, too. Juanita and Georgeanna had been the glue holding the group together -- they'd been the ones who had been friends with all the others. Katherine, Gladys, and Wanda, hadn't known each other before forming the group, and they started to discover that they weren't hugely fond of each other now.\n\nAt first, they still worked well together, each having their assigned area of responsibility -- Gladys was a combination musical director and choreographer, working out the group's setlists and dance moves, Katherine was the spokesperson in interviews, and looked after the group's money, and Wanda was the lead singer. This worked for a while, but as Katherine would later put it, when there had been five of them, they'd been friends. Now they were somewhere between acquaintances and co-workers.\n\nAnd then in 1967, Gladys decided to leave the group. This made the group an even lower priority for Motown -- while Wanda was by now the undisputed lead singer, within Motown they were thought of as Gladys' group, as she'd been the leader in the beginning.\n\nMotown did decide to get someone else in to replace her. They could cope with the group going from five members to four, and from four to three -- three women, after all, was still a girl group. But once they'd got down to two members, they needed a third. Harvey Fuqua suggested Ann Bogan, who he'd discovered a while before and recorded a few duets with:\n\n[Excerpt: Harvey and Ann, \"What Can You Do Now?\"]\n\nAnn was a sort of general utility singer around Motown -- she'd sung with the Andantes and the Challengers Three, and she'd also gone out on the road with Marvin Gaye, subbing for his duet partner Tammi Terrell, when the latter had become sick with the brain tumour that eventually killed her.\n\nAnn replaced Gladys, and the group made two further albums, and Ann was at least allowed to sing on album tracks. The group continued having R&B hits, but while they kept releasing great records like \"Destination: Anywhere\", they were by now barely scraping the hot one hundred on the pop charts:\n\n[Excerpt: The Marvelettes, \"Destination: Anywhere\"]\n\nAnd Wanda was having problems. She'd been doing too much cocaine and drinking too much, and was starting to act strangely. Then in 1969 her younger sister was shot dead, by her other sister's estranged husband (who seems to have thought he was shooting the other sister), and to compound matters while the group were on tour in Europe someone spiked Wanda's drink. She was never the same again, and has had mental health problems for the last fifty years. The group split up, though nothing was announced -- they just didn't get booked on any more tours, and went their separate ways.\n\nBogan went on to join a group called Love, Peace, and Happiness, who had a minor hit with a song that had been, coincidentally, co-written by Katherine, who wrote it for Gladys Knight:\n\n[Excerpt: Love, Peace, and Happiness, \"I Don't Want to Do Wrong\"]\n\nThat group then joined with Harvey Fuqua in a seventeen-piece funk band called New Birth, with Bogan singing on their hit \"I Can Understand It\":\n\n[Excerpt: New Birth, \"I Can Understand It\"]\n\nMotown decided to give the Marvelettes one more try, and in 1970 they got Wanda in to record an album titled The Return of the Marvelettes. This was essentially a solo album, produced by Smokey Robinson, but they did try to get Katherine to appear on the cover photograph. She told the label that if she wasn't good enough to sing on the record, she wasn't good enough to appear on the cover, either, and so the cover, like the record, only featured Wanda of the original Marvelettes.\n\nOver the next few decades, various groups toured under the Marvelettes name, none featuring any of the original members -- Motown, rather than the women, had owned the group name, and had sold it off. Gladys, Katherine, and Juanita were busy being homemakers, and Wanda and Georgeanna were too ill to consider a music career.\n\nThen in the late 1980s, Ian Levine entered the picture. Levine is a British DJ who at the time owned and ran Motor City Records, which put out new recordings by people who had released records on Motown in the sixties.\n\nHe got over a hundred former Motown artists to record for him, and one album he put out was a Marvelettes reunion of sorts -- he managed to persuade Gladys and Wanda out of retirement to make a new Marvelettes album with two new backing vocalists, Echo Johnson and Jean Maclean. The new record was a mixture of remakes of their old hits and new songs by Levine, like \"Secret Love Affair\":\n\n[Excerpt: The Marvelettes, \"Secret Love Affair\"]\n\nWanda was still too ill to perform regularly, but Gladys went out on tour on the oldies circuit, singing her old hits as \"Gladys Horton of the Marvelettes\", as none of the group owned the original name. She and Katherine were in the process of suing to regain the name under the Truth in Music Act, when she died of a stroke in 2011.\n\nOf the other Marvelettes, Katherine and Juanita are retired, though Katherine still gives regular interviews about her time with the group, and Wanda's mental health has apparently improved enough in the last few years that she can perform again. They're all apparently happy with their situations now, and don't miss the old life.\n\nThey do miss the recognition, though. For the twenty-fifth, fortieth, fiftieth, and sixtieth anniversary celebrations of Motown, TV specials were produced featuring many of the label's acts, and honouring the label's history. None of the members of the first group to hit number one on the label were invited to be part of any of them.",
  "enclosure": "",
  "itunes:summary": "Episode ninety-three of A History of Rock Music in Five Hundred Songs looks at \"Please Mr. Postman\" by the Marvelettes, and the career of the first group to have a number one on a Motown label. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Take Good Care of My Baby\" by Bobby Vee.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nErratum\n\nAfter recording this, I happened to discover that in 2017 Katherine actually came out of retirement and formed a new “Marvelettes”, who recorded in the UK in 2017 with someone called “Hitsville Chalky”.\n\nResources\n\nThis week's Mixcloud playlist is split into two parts, because of the number of Marvelettes songs. Part one, and part two.\n\nThe Original Marvelettes: Motown's Mystery Girl Group by Marc Taylor is the only biography of the group. Sadly it currently goes for silly money.\n\nWhere Did Our Love Go? The Rise and Fall of the Motown Sound&nbsp;by Nelson George&nbsp;is an excellent popular history of the various companies that became Motown.\n\nTo Be Loved&nbsp;by Berry Gordy&nbsp;is Gordy's own, understandably one-sided, but relatively well-written, autobiography.\n\nWomen of Motown: An Oral History&nbsp;by Susan Whitall is a collection of interviews with women involved in Motown, including Katherine Anderson Schaffner.\n\nI Hear a Symphony: Motown and Crossover R&B&nbsp;by J. Andrew Flory&nbsp;is an academic look at Motown.\n\nThe Motown Encyclopaedia&nbsp;by Graham Betts&nbsp;is an exhaustive look at the people and records involved in Motown's thirty-year history.\n\nAnd&nbsp;Motown Junkies&nbsp;is an infrequently-updated blog looking at (so far) the first 693 tracks released on Motown singles.\n\nThere is a Complete Motown Singles 1959-62 box available from Hip-O-Select with comprehensive liner notes, but if you just want the music, I recommend instead&nbsp;this much cheaper bare-bones box&nbsp;from Real Gone Music.\n\nAnd this three-CD set contains the group's complete discography up to mid-1966 -- the Gladys Horton years.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;Why not join them?\n\nTranscript\n\nWhen we left the Tamla Motown family of labels, a couple of months back, they'd finally had their first big hit with Barrett Strong's \"Money\", and the label was starting to pull together the full creative team that would be responsible for its later successes. But while \"Money\" is a great record, it's not a record with what would later become known as the \"Motown Sound\" -- it sounds far more like a Ray Charles record than the records that would later make Motown's name.\n\nSo today, we're going to look at the first number one to come out of Motown -- a record that definitely did have the Motown sound, and which established the label as the sound of young America. Today, we're going to look at \"Please Mr. Postman\":\n\n[Excerpt: The Marvelettes, \"Please Mr. Postman\"]\n\nThe story of the Marvelettes starts with Gladys Horton, who lived in the small town of Inkster in Michigan. When Horton was only fourteen, she had formed a group called the Del-Rhythmettes, who made one single, \"Chic-A-Boomer\":\n\n[Excerpt: The Del-Rhythmettes, \"Chic-A-Boomer\"]\n\nThat had got a little bit of airplay on local radio, but had otherwise been unsuccessful, and the Del-Rhythmettes had split up. But Gladys still wanted to make music, and she started looking around for other people to sing with. One who caught her eye was a young girl who would appear in the High School talent contests, named Georgia Dobbins. By the time Gladys got to high school herself, Georgia had graduated, but Gladys persuaded her to join a group she put together for her own talent contest entry. The group she forme",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode ninety-three of A History of Rock Music in Five Hundred Songs looks at \"Please Mr. Postman\" by the Marvelettes, and the career of the first group to have a number one on a Motown label. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Take Good Care of My Baby\" by Bobby Vee.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nErratum\n\nAfter recording this, I happened to discover that in 2017 Katherine actually came out of retirement and formed a new “Marvelettes”, who recorded in the UK in 2017 with someone called “Hitsville Chalky”.\n\nResources\n\nThis week's Mixcloud playlist is split into two parts, because of the number of Marvelettes songs. Part one, and part two.\n\nThe Ori",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}