{
  "title": "Pesticide innovation takes top prize at Collegiate Inventors Competition",
  "link": "https://news.mit.edu/2022/pesticide-innovation-takes-top-prize-collegiate-inventors-competition-1027",
  "description": "Vishnu Jayaprakash SM '19, PhD '22 won for the AgZen-Cloak, an invention that makes pesticides stick to crops, minimizing pollution and water waste.",
  "pubDate": "Thu, 27 Oct 2022 16:35:00 -0400",
  "guid": "https://news.mit.edu/2022/pesticide-innovation-takes-top-prize-collegiate-inventors-competition-1027",
  "dc:creator": "Mary Beth Gallagher | Department of Mechanical Engineering",
  "content:encoded": "<p>On Oct. 12, MIT mechanical engineering alumnus Vishnu Jayaprakash SM '19, PhD '22 was named the first-place winner in the graduate category of the Collegiate Inventors Competition. The annual competition, which is organized by the National Inventors Hall of Fame, celebrates college and university student inventors. Jayaprakash won for his pesticide innovation AgZen-Cloak, which he developed while he was a student in the lab of Kripa Varanasi, a professor of mechanical engineering.</p>\n\n<p>Currently, only 2 percent of pesticide spray is retained by crops. Many crops are naturally water-repellent, causing pesticide-laden water to bounce off of them. Farmers are forced to over-spray significantly to ensure proper spray coverage on their crops. Not only does this waste expensive pesticides, but it also comes at an environmental cost.</p>\n\n<p>Runoff from pesticide treatment pollutes soil and nearby streams. Droplets can travel in the air, leading to illness and death in nearby populations. It is estimated that each year, pesticide pollution causes between 20,000 and 200,000 deaths, and up to 385 million acute illnesses like cancer, birth defects, and neurological conditions.&nbsp; &nbsp;</p>\n\n<p>With his invention AgZen-Cloak, Jayaprakash has found a way to keep droplets of water containing pesticide from bouncing off crops by “cloaking” the droplets in a small amount of plant-derived oil. As a result, farmers could use just one-fifth the amount of spray, minimizing water waste and cost for farmers and eliminating airborne pollution and toxic runoff. It also improves pesticide retention, which can lead to higher crop yield.</p>\n\n<p>“By cloaking each droplet with a minute quantity of a plant-based oil, we promote water retention on even the most water-repellent plant surfaces,” says Jayaprakash. “AgZen-Cloak presents a universal, inexpensive, and environmentally sustainable way to prevent pesticide overuse and waste.”</p>\n\n<p>Farming is in Jayaprakash’s DNA. His family operates a 10-acre farm near Chennai, India, where they grow rice and mangoes. Upon joining the Varanasi Research Group as a graduate student, Jayaprakash was instantly drawn to Varanasi’s work on pesticides in agriculture.</p>\n\n<p>“Growing up, I would spray crops on my family farm wearing a backpack sprayer. So, I’ve always wanted to work on research that made farmer’s lives easier,” says Jayaprakash, who serves as CEO of the startup AgZen.</p>\n<p><strong>Helping droplets stick</strong></p>\n\n<p>Varanasi and his lab at MIT work on what is known as interfacial phenomena — or the study of what happens when different phases come into contact and interact with one another. Understanding how a liquid interacts with a solid or how a liquid reacts to a certain gas has endless applications, which explains the diversity of the research Varanasi has conducted over the years. He and his team have developed solutions for everything from consumer product packaging to power plant emissions.</p>\n\n<p>In 2009, Varanasi gave a talk at the U.S. Department of Agriculture (USDA). There, he learned from the USDA just how big of a problem runoff from pesticide spray was for farmers around the world.</p>\n<img alt=\"A leaf is sprayed with a clear liquid and small droplets form on the surface\" data-caption=\"A green cabbage leaf is treated with pesticide-laden water using AgZen's technology. By cloaking droplets in a tiny amount of plant-derived oil, the droplets stick to the leaf, minimizing over-spraying, waste, and pollution. Image courtesy of AgZen.\" data-entity-type=\"file\" data-entity-uuid=\"5feddc9d-a481-4350-819c-f0602a9e61f7\" src=\"/sites/default/files/images/inline/MIT_News_CIC_Award_3-2.gif\" /><img alt=\"A leaf is sprayed with a clear liquid and large droplets form on the surface\" data-caption=\"A green cabbage leaf is treated with pesticide-laden water using conventional spraying. Image courtesy of AgZen.\" data-entity-type=\"file\" data-entity-uuid=\"05777797-22c4-4d73-b89d-7e56ceddfbd6\" src=\"/sites/default/files/images/inline/MIT_News_CIC_Award_3-1_0.gif\" />\n<p>He enlisted the help of then-graduate student Maher Damak SM ’15, PhD ’18 to apply their work in interfacial phenomena to pesticide sprays. Over the next several years, the Varanasi Research Group developed a technology that utilized electrically charged polymers to keep droplets from bouncing off hydrophobic surfaces. When droplets containing positively and negatively charged additives meet, their surface chemistry allows them to stick to a plant’s surface.</p>\n\n<p>Using polyelectrolytes, the researchers could reduce the amount of spray needed to cover a crop by tenfold in the lab. This motivated the Varanasi Research Group to pursue three years of field trials with various commercial growers around the world, where they were able to demonstrate significant savings for farmers.</p>\n\n<p>“We got fantastic feedback on our technology from farmers. We are really excited to change the paradigm for agriculture. Not only is it good for the environment, but we’ve heard from farmers that they love it. If we can put money back into farms, it helps society as a whole,” adds Varanasi.</p>\n\n<p>In response to the positive feedback, Varanasi and Jayaprakash co-founded startup AgZen in 2020.&nbsp;</p>\n\n<p>When field testing their polyelectrolyte technology, Varanasi and Jayaprakash came up with the idea to explore the use of a fully plant-based material to help farmers achieve the same savings.&nbsp;</p>\n\n<p><strong>Cloaking droplets and engineering nozzles</strong></p>\n\n<p>Jayaprakash found that by cloaking a small amount of plant-derived oil around a water droplet, droplets stick to plant surfaces that would typically repel water. After conducting many studies in the lab, he found that the oil only needs to make up 0.1 percent of a droplet’s total volume to stick to crops and provide total, uniform coverage.</p>\n\n<p>While his cloaking solution worked in the lab, Jayaprakash knew that to have a tangible impact in the real world he needed to find an easy, low-cost way for farmers to coat pesticide spray droplets in oil.</p>\n\n<p>Jayaprakash focused on spray nozzles. He developed a proprietary nozzle that coats each droplet with a small amount of oil as they are being formed. The nozzles can easily be added to any hose or farming equipment.</p>\n\n<p>“What we’ve done is figured out a smart way to cloak these droplets by using a very small quantity of oil on the outside of each drop. Because of that, we get this drastic improvement in performance that can really be a game-changer for farmers,” says Jayaprakash.</p>\n\n<p>In addition to improving pesticide retention in crops, the AgZen-Cloak solves a second problem. Since large droplets are prone to break apart and bounce off crops, historically, farmers have sprayed pesticide in tiny, mist-like droplets. These fine droplets are often carried by the wind, increasing pesticide pollution in nearby areas.&nbsp;</p>\n\n<p>When AgZen-Cloak is used, the pesticide-laden droplets can be larger and still stick to crops. These larger droplets aren’t carried by the wind, decreasing the risk of pollution and minimizing the health impacts on local populations. &nbsp;</p>\n\n<p>“We’re actually solving two problems with one solution. With the cloaking technology, we can spray much larger droplets that aren’t prone to wind drift and they can stick to the plant,” Jayaprakash adds.</p>\n\n<p><strong>Bringing AgZen-Cloaks to farmers around the world</strong></p>\n\n<p>This spring, Varanasi encouraged Jayaprakash to submit AgZen-Cloak to the Collegiate Inventors Competition. Out of hundreds of applications, Jayaprakash was one of 25 student inventors to be chosen as a finalist.</p>\n\n<p>On Oct. 12, Jayaprakash presented his technology to a panel of judges composed of National Inventors Hall of Fame inductees and U.S. Patent and Trademark Office officials. Meeting with such an illustrious group of inventors and officials left an impression on Jayaprakash.</p>\n\n<p>“These are people who have invented things that have changed the world. So, to get their feedback on what we’re doing was incredibly valuable,” he says. Jayaprakash received a $10,000 prize for being named the first-place graduate winner.</p>\n\n<p>As full-time CEO of AgZen, Jayaprakash is shifting focus to field testing and commercialization. He and the AgZen team have already conducted field testing across the world at locations including a Prosecco vineyard outside of Venice, a ranch in California, and Ward’s Berry Farm in Sharon, Massachusetts. The University of Massachusetts at Amherst’s vegetable extension program, led by their program director Susan Scheufele, recently concluded a field test that validated AgZen’s on-field performance.</p>\n\n<p>Two days after his win at the Collegiate Inventors Competition, Jayaprakash was named the first prize winner of the MIT Abdul Latif Jamel Water and Food Systems Lab World Food Day student video competition. Hours later, he flew across the country to attend an agricultural tech conference in California, eager to meet with farmers and discuss plans for rolling out AgZen’s innovations to farms everywhere.</p>",
  "media:content": {
    "media:description": "Vishnu Jayaprakash SM '19, PhD '22 was named the first-place winner in the graduate category of the Collegiate Inventors Competition, hosted by the National Inventors Hall of Fame. He won for his invention AgZen-Cloak, which allows pesticide to stick to crops.",
    "media:credit": "Photo courtesy of the National Inventors Hall of Fame."
  },
  "category": [
    "Alumni/ae",
    "Awards, honors and fellowships",
    "Contests and academic competitions",
    "Invention",
    "Pollution",
    "Food",
    "Agriculture",
    "Water",
    "Mechanical engineering",
    "Abdul Latif Jameel Water and Food Systems Lab (J-WAFS)",
    "Innovation and Entrepreneurship (I&E)",
    "School of Engineering"
  ]
}