{
  "title": "Lightships and Public Goods with Vincent Geloso",
  "pubDate": "Sun, 15 Apr 2018 02:33:39 +0000",
  "guid": "6f2fd0a3dc4880decb511266c6e93719",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP91Geloso_EDR.mp3",
  "itunes:image": "",
  "description": "<p>The assiduous Vincent Geloso returns to the podcast to discuss <a href= \"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3157100\" target=\"_blank\" rel=\"noopener\">his work with Rosolino Candela on lightships</a> and their importance in economics. The abstract of their paper reads as follows:</p> <blockquote>What role does government play in the provision of public goods? Economists have used the lighthouse as an empirical example to illustrate the extent to which the private provision of public goods is possible. This inquiry, however, has neglected the private provision of lightships. We investigate the private operation of the world’s first modern lightship, established in 1731 on the banks of the Thames estuary going in and out of London. First, we show that the Nore lightship was able to operate profitably and without government enforcement in the collection of payment for lighting services. Second, we show how private efforts to build lightships were crowded out by Trinity House, the public authority responsible for the maintaining and establishing lighthouses in England and Wales. By including lightships into the broader lighthouse market, we argue that the provision of lighting services exemplifies not a market failure, but a government failure.</blockquote> <p>Economists have been using lighthouses as examples of pure public goods since at least John Stuart Mill. This modern debate on whether lighthouses really deserve their status as the archetypical example goes back to <a href= \"https://www.journals.uchicago.edu/doi/abs/10.1086/466796?journalCode=jle\" target=\"_blank\" rel=\"noopener\">Coase (1974)</a>, who pointed out that many lighthouses in Great Britain had been privately funded through harbour fees. According to the theory of pure public goods, free riding should have destroyed this market, but it didn't. This has sparked a spirited debate about just how private those \"private\" lighthouses were, and whether the level of government intervention in the lighthouse market was necessary to solve the free rider problem.</p> <p>Candela and Geloso's work on lightships shows that a pure private solution to the lighthouse problem actually existed historically. They detail the launching of the first lightship by the entrepreneurs David Avery and Robert Hamblin at the mouth of the Thames River in 1731, and the ways they were able to finance this apparently \"public\" good.</p>",
  "content:encoded": "<p>The assiduous Vincent Geloso returns to the podcast to discuss <a href= \"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3157100\" target=\"_blank\" rel=\"noopener\">his work with Rosolino Candela on lightships</a> and their importance in economics. The abstract of their paper reads as follows:</p> What role does government play in the provision of public goods? Economists have used the lighthouse as an empirical example to illustrate the extent to which the private provision of public goods is possible. This inquiry, however, has neglected the private provision of lightships. We investigate the private operation of the world’s first modern lightship, established in 1731 on the banks of the Thames estuary going in and out of London. First, we show that the Nore lightship was able to operate profitably and without government enforcement in the collection of payment for lighting services. Second, we show how private efforts to build lightships were crowded out by Trinity House, the public authority responsible for the maintaining and establishing lighthouses in England and Wales. By including lightships into the broader lighthouse market, we argue that the provision of lighting services exemplifies not a market failure, but a government failure. <p>Economists have been using lighthouses as examples of pure public goods since at least John Stuart Mill. This modern debate on whether lighthouses really deserve their status as the archetypical example goes back to <a href= \"https://www.journals.uchicago.edu/doi/abs/10.1086/466796?journalCode=jle\" target=\"_blank\" rel=\"noopener\">Coase (1974)</a>, who pointed out that many lighthouses in Great Britain had been privately funded through harbour fees. According to the theory of pure public goods, free riding should have destroyed this market, but it didn't. This has sparked a spirited debate about just how private those \"private\" lighthouses were, and whether the level of government intervention in the lighthouse market was necessary to solve the free rider problem.</p> <p>Candela and Geloso's work on lightships shows that a pure private solution to the lighthouse problem actually existed historically. They detail the launching of the first lightship by the entrepreneurs David Avery and Robert Hamblin at the mouth of the Thames River in 1731, and the ways they were able to finance this apparently \"public\" good.</p>",
  "enclosure": "",
  "itunes:duration": "55:38",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "The assiduous Vincent Geloso returns to the podcast to discuss  and their importance in economics. The abstract of their paper reads as follows: What role does government play in the provision of public goods? Economists have used the lighthouse as an...",
  "itunes:episode": 91,
  "itunes:episodeType": "full"
}