{
  "title": "S13 Ep137: Bob Lazar: Area 51 & Flying Saucers",
  "link": "https://audioboom.com/posts/8098638",
  "itunes:episode": 137,
  "itunes:title": "Bob Lazar: Area 51 & Flying Saucers",
  "itunes:season": 13,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4345,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS has Bob Lazar: Area 51 & Flying Saucers with documentarian Jeremy Corbell!<br>\n<br>\nFormer Government physicist Bob Lazar made headlines world-wide in 1989 when he came forward with his account of reverse-engineering an alien spacecraft for the US Military. The reason the public even knows the name Area 51 is because Lazar talked about the work he did at the formerly secret military base. Burdened with a revolutionary secret, he had to choose between his oath to his country or his conscience. His testimony remains the most controversial and important UFO story of all time. <br>\n<br>\nTo see the documentary or purchase visit <a href=\"http://www.ExtraordinaryBeliefs.com\">www.ExtraordinaryBeliefs.com</a><br>\n<br>\nSupport our sponsors for great deals! <br>\n<br>\nCheck out Adam and Eve dot com today for this special offer.  Get 50% off one item when you type DARKNESS for the offer code upon checkout.  When you do, you’ll get 3 FREE DVDs, a FREE extra gift and FREE shipping.  Just use offer code DARKNESS at Adam and Eve dot com. That's DARKNESS at Adam and Eve dot com<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nFor a total of $60 off, that's $20 off your 1st 3 boxes, visit <a href=\"http://HelloFresh.com/darkness60\">HelloFresh.com/darkness60</a> <br>\nUse Code: Darkness60 at checkout",
  "itunes:summary": "BEYOND the DARKNESS has Bob Lazar: Area 51 & Flying Saucers with documentarian Jeremy Corbell!\n\nFormer Government physicist Bob Lazar made headlines world-wide in 1989 when he came forward with his account of reverse-engineering an...",
  "pubDate": "Sun, 02 Dec 2018 10:00:00 +0000",
  "guid": "626220db-4084-4dc7-b69b-130d78f6626f",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}