{
  "title": "Only one country backs US in UN Cuba vote",
  "link": "https://www.rt.com/news/565928-unga-condemns-cuba-embargo-israel/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565928-unga-condemns-cuba-embargo-israel/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63643bee85f5403a0204b632.jpeg\" /> The UN General Assembly voted almost unanimously to condemn the US’ embargo on Cuba <br/><a href=\"https://www.rt.com/news/565928-unga-condemns-cuba-embargo-israel/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Israel was Washington's only supporter in 30th vote in 30 years denouncing the blockade of Cuba</strong></p>\n            \n                        \n            <p>The United Nations General Assembly has overwhelmingly voted in favor of a resolution condemning the US embargo on Cuba for the 30th year in a row. Only the US and Israel voted against the measure on Thursday, while Ukraine and Brazil abstained.</p>\n<p><strong></strong>Since 2019, the US has &ldquo;<em>escalated the siege around our country, taking it to an even crueler and more humane [sic] dimension, with the purpose of deliberately inflicting the biggest possible damage on Cuban families</em>,&rdquo; Cuban Foreign Minister Bruno Rodriguez told the assembled representatives.</p>\n<p>The diplomat slammed US President Joe Biden for continuing the &ldquo;<em>maximum pressure</em>&rdquo; policy of his predecessor Donald Trump rather than resuming the trend toward warming relations Barack Obama set in motion during his last year in office.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.09/thumbnail/632bcf3585f5406a2266316f.jpg\" alt=\"FILE PHOTO: The US embassy building is seen in Havana, Cuba.\" />\n            <figcaption><a href=\"https://www.rt.com/news/563288-us-embassy-cuba-immigration/\">US to ease restrictions on Cuban migrants</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>While acknowledging the Biden administration had made some extremely limited moves to open up flights, remittances, and consular services with Cuba, Rodriguez argued that &ldquo;<em>the blockade, which has been tightened to the extreme, continues to be the central element that defines the US-Cuba policy</em>.&rdquo;</p>\n<p>Since Biden has been in office, the embargo has cost the Cuban economy an estimated $6.35 billion, Rodriguez said &ndash; a figure that translates to more than $15 million per day. While he stressed he did not blame the US for all of Cuba&rsquo;s problems, denying its influence as &ldquo;<em>the main cause of the deprivations, scarcities and hardships suffered by Cuban families would be failing to tell the truth</em>,&rdquo; he explained.</p>\n<p>The US abstained from a vote condemning the embargo for the first time in 2016, shortly after Obama restored official relations with the island. However, Trump resumed previous presidents&rsquo; efforts to isolate the socialist nation. Washington imposed the embargo in 1960 after Fidel Castro&rsquo;s revolution overthrew the US-friendly Batista government and nationalized properties belonging to American citizens.</p>\n<p>Both the Trump and Biden administrations have held up &ldquo;<em>human rights</em>&rdquo; to justify decades of economic strangulation, an argument Cuba&rsquo;s deputy UN ambassador, Yuri Gala, dismissed as illogical.</p>\n<p>&ldquo;<em>If the United States government really did care for the well-being, human rights and self-determination of the Cuban people, it could lift the embargo</em>,&rdquo; he said, adding that Washington could lift the economic restrictions currently choking off economic opportunities for would-be capitalists.</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/529506-cuba-president-protests-us/\">\n            <span>READ MORE: </span>Cuban president denounces US-backed ‘media terrorism’ while addressing massive supporters’ rally\n        </a>\n    </p>\n\n    \n\n<p>Instead, Rodriguez argued, the US was weaponizing Big Tech and media &ldquo;<em>in a virulent disinformation and disparagement campaign against Cuba &hellip; using our children, youths and artists as the targets of this political and media bombardment.</em>&rdquo;</p>\n<p>Washington imposed further sanctions on Cuba last year, condemning the police response to an outbreak of protests that began with outcry over food and drug shortages and morphed &ndash; with the US&rsquo; help, according to Havana &ndash; into violent anti-government demonstrations.</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 22:16:01 +0000",
  "dc:creator": "RT"
}