{
  "id": "tag:blogger.com,1999:blog-8878620400258430757.post-8211758121759733678",
  "published": "2019-10-15T09:27:00.000-07:00",
  "updated": "2019-11-21T11:54:06.016-08:00",
  "title": "Hispanic Heritage Month Pay It Forward Challenge 2019: Recognizing students making a difference (Part 1 of 3)",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">In honor of Hispanic Heritage Month, Google hosted a&nbsp;<a href=\"https://events.withgoogle.com/2019-pay-it-forward-challenge-hispanic-heritage-month/\">Pay It Forward Challenge</a>&nbsp;to recognize Hispanic and Latinx student leaders who are advancing opportunities for their local communities. After receiving many submissions we’re excited to share the work of the students below and hope you’ll be inspired by their stories. Stay tuned for more features over the next few weeks!<br /><br /><b>Angelica Deleon</b><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><b><a href=\"https://1.bp.blogspot.com/-hIsWDBgIMgE/XaXvddBDQpI/AAAAAAAAAsI/9YxkDTZJMaURsoPahbRL1EwtcK17xDnFACEwYBhgL/s1600/Angelica.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"325\" data-original-width=\"512\" src=\"https://1.bp.blogspot.com/-hIsWDBgIMgE/XaXvddBDQpI/AAAAAAAAAsI/9YxkDTZJMaURsoPahbRL1EwtcK17xDnFACEwYBhgL/s1600/Angelica.jpg\" /></a></b></div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><br /><br />Angelica is studying Public Relations, Advertising, and Applied Communications at Seton Hall University. As a volunteer for the <a href=\"https://www.unausannj.org/\">United Nations Northern New Jersey chapter</a>, she leads meetings with in-government officials and discuss the importance of strong US-UN relations. She advocates for issues relevant to all, such as eradicating extreme poverty, advancing women's rights, combating climate change, and more. She also manages her own company, <a href=\"https://usaleon.com/\">Leon</a>, an eCommerce clothing brand founded to give petite women more consumer options.<br /><br /><u>Angelica’s advice to others</u>:<br />“To anyone who wants to make an impact – discover a cause that you are passionate about and collaborate with individuals who mobilize you to effect change in our society. You can serve as a volunteer towards a cause you are passionate about or serve as a mentor to the upcoming generation of leaders.”<br /><br /><u>On Angelica’s mind during Hispanic Heritage Month</u>:<br />“Gratitude. As a first-generation American, I am appreciative of the experiences I have lived through while growing up in a Hispanic household. My culture has molded the person I am today; passionate, hard-working, and resilient. As a young professional, my culture has granted me a unique advantage and perspective when contributing to the teams I have worked on. Our heritage is rich in every way. It is embedded in strength and grit. This Hispanic Heritage Month is special as we continue to thrive as a community and demonstrate relentless courage in the face of adversity.”<br /><br /><b>Oscar Lopez&nbsp;</b><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-hT8HAwku7WQ/XaXvdtFc4CI/AAAAAAAAAsI/YIf60ntn-loT3wE4UAEU9otd6W4zbmY9wCEwYBhgL/s1600/Oscar.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"512\" data-original-width=\"384\" src=\"https://1.bp.blogspot.com/-hT8HAwku7WQ/XaXvdtFc4CI/AAAAAAAAAsI/YIf60ntn-loT3wE4UAEU9otd6W4zbmY9wCEwYBhgL/s1600/Oscar.jpg\" /></a></div><br />Oscar is a student at the University of Texas at Austin. This summer, he worked as a <a href=\"https://www.google.com/policyfellowship/\">Google Public Policy Fellow</a> where he advocated for increasing broadband access in predominantly Hispanic/Latinx communities.<br /><br />“My hometown of Laredo, Texas is a border city where more than 95% of its population identifies as Hispanic or Latino. In 2017, Laredo was designated as having the worst access to broadband of any U.S. city. One third of the population lacks access to the necessary resources to have meaningful social mobility. As a fellow, I authored a filing submitted to the Federal Communications Commission detailing the situation in Laredo and the need to improve access. Now, I am continuing to advocate for improved broadband access in my hometown, and plan to work with my city and state government to bring my city out of the digital divide.”<br /><br /><u>Oscar’s advice to others</u>:<br />“Many of us may have a great idea on how to improve our communities, but we end up getting stuck on the thought of whether or not it will actually go anywhere. This mental roadblock hinders us from ever putting a community initiative into motion. It is certainly difficult at first, but by pushing through these mental barriers, not only will you learn more and improve your initiative, but you will begin to gain the support necessary to expand what you are trying to do.”<br /><br /><u>On Oscar’s mind during Hispanic Heritage Month</u>:<br />“My Abuela. She immigrated from Mexico to the US having not finished her middle school education. She worked her whole life as a domestic worker, and spent her weekends with my grandfather contributing back to the community through a church they ran together. She taught me that we are all capable of having an impact on the lives of others and that if we hope to make the world a better place, we must take action and start with our own community.”<br /><br /><b>Elvin Galarza</b><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-yEN9cpCSFMk/XaXyZtHcZsI/AAAAAAAAAsc/FPDsVquNf2Ug4ox9hucoQrqSzunU4uuuwCLcBGAsYHQ/s1600/0.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1600\" data-original-width=\"1067\" height=\"400\" src=\"https://1.bp.blogspot.com/-yEN9cpCSFMk/XaXyZtHcZsI/AAAAAAAAAsc/FPDsVquNf2Ug4ox9hucoQrqSzunU4uuuwCLcBGAsYHQ/s400/0.jpg\" width=\"266\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><br />Elvin is an engineering student at The University of Texas at Austin. Currently he works with <a href=\"https://movementgeneration.org/wp-content/uploads/2016/11/JT_booklet_English_SPREADs_web.pdf\">Just Transition</a> (<a href=\"https://movementgeneration.org/wp-content/uploads/2016/11/JT_booklet_Spanish_Spreads_web.pdf\">Spanish version</a>), a framework for a fair shift to an economy that is ecologically sustainable, equitable and just for all its members. He also worked with <a href=\"http://latinitasmagazine.org/\">Latinitas</a>, a nonprofit dedicated to empowering women through technology, to create the Code Chica Certification program – a free curriculum that seeks to further close the digital divide by introducing high school students to web development, women and allies in tech, and college and career resources. Elvin was also recognized as a Climate Justice activist by <a href=\"https://www.uprose.org/\">UPROSE</a> – Brooklyn's oldest Latino community-based organization.<br /><br /><u>Elvin’s advice to others</u>:<br />“Embrace open-mindedness and look at life through an intersectional lens. This not only assists us in realizing that there is injustice in everything we eat, drink, wear, use, and breathe but also encourages us to recognize that impact is remarkable no matter how trivial it seems. It's noble to want to be the grain of rice that tips the scale but there first needs to be a pile of rice before anything can tip! Let's fill it together. Let's build everywhere.”<br /><br /><u>On Elvin’s mind during Hispanic Heritage Month</u>:<br />“Walls. Whether it be the physical brown bricks that are the Queensbridge Houses, the US-Mexico border wall, or the metaphysical barriers and intergenerational trauma that plague me as a Puerto Rican, I've experienced many walls in my life. Two thousand years ago, the proudest boast was, ‘civis Romanus sum.’ Fifty-six years ago, it was, ‘Ich bin ein Berliner.’ Now, in the words of my people, and to all Hispanics everywhere, the proudest boast is, ‘Pa'lante, Siempre Pa'lante!’ to the walls both abroad and at home.”<br /><br /><br /><b>Victoria Fernandez&nbsp;</b><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-Cf3582wzpxs/XaXveehKKlI/AAAAAAAAAsM/12usoWhzYUUG45M1P3YQLv1TgwHG4_67QCEwYBhgL/s1600/Victoria.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"285\" data-original-width=\"512\" src=\"https://1.bp.blogspot.com/-Cf3582wzpxs/XaXveehKKlI/AAAAAAAAAsM/12usoWhzYUUG45M1P3YQLv1TgwHG4_67QCEwYBhgL/s1600/Victoria.jpg\" /></a></div><br />Victoria is studying Marketing at Texas A&amp;M University. Victoria manages a <a href=\"https://www.youtube.com/channel/UCPWof38Tgpmt885UJTJWGmg\">YouTube channel – I Live to Inspire Mental Health</a>,&nbsp;&nbsp;publishing videos in both Spanish and English.<br /><br />“I talk about my life with Bipolar Disorder and how to manage mental health. I make content in Spanish because mental illnesses are stigmatized in my culture. Through my YouTube videos, I convey the message of hope to those who have a mental illness while also fostering understanding and compassion amongst people who have a hard time accepting that someone they love (or even themselves) has a mental illness. I dream of saving lives by advocating for a shift in the mindset of the Hispanic community.”<br /><br /><u>Victoria’s advice to others</u>:<br />“If you believe in a dream that can impact your community for the better, do not hesitate and go for it! If you send a message with passion, compassion, and vision out into the world, the possibilities of making a difference are endless. Let every single person you help humble your heart because it is a life that you have touched positively.”<br /><br /><u>On Victoria’s mind during Hispanic Heritage Month</u>:<br />“Hispanic Heritage Month is a month that gives the Hispanic community a moment of reflection to see how far we have come and how far we can still go. All over Latin America, you see a variety of foods, customs, and talents. The beautiful thing about it is that we all come together and mix our different traditions. This month is a reminder how we have impacted the world throughout history, and how we will continue to do so.”<br /><br /><b>Richard Quinde</b><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-b6E9sMhuZ6U/XaXvdpG73oI/AAAAAAAAAsE/5yhv8kZxBoMxoy9aYFnfnE21JVdAdOw7gCEwYBhgL/s1600/Richard.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"512\" data-original-width=\"417\" src=\"https://1.bp.blogspot.com/-b6E9sMhuZ6U/XaXvdpG73oI/AAAAAAAAAsE/5yhv8kZxBoMxoy9aYFnfnE21JVdAdOw7gCEwYBhgL/s1600/Richard.jpg\" /></a></div><br />Richard is currently a senior at Rutgers University Newark double majoring in Finance and Economics.&nbsp; Through the Educational Opportunity Program, Richard supports and guides students through dilemmas they may encounter as they begin a new step in their life – attending college. Richard has also started numerous organizations on campus such as <a href=\"https://www.instagram.com/eofpride_run/\">EOF P.R.I.D.E</a> (Pursuing Rewards in Diversity and Education), “which gives underserved students additional support by exposing them to teamwork, leadership, and the development of professional skills that will further enhance their performance in the real world.”<br /><br /><u>Richard’s advice to others</u>:<br />“It’s never too late to start. No one puts a timeline on when you are going to impact the world. A true leader aims to empower their community, give rise to more leaders, and spread positive energy in the efforts for a better tomorrow. Make sure you put your heart into what you believe in and be the change you always wanted to see.”<br /><br /><u>On Richard’s mind during Hispanic Heritage Month</u>:<br />“Something that’s on my mind is the countless hurdles and obstacles my parents overcame and pushed through at the efforts of giving me and my little brother the opportunity for better futures. The Hispanic community has made great strides towards empowering one another and aiming to raise and create successful leaders. My family left Ecuador to allow me the opportunity to pursue my dream and have my voice heard and I will aim to complete my dream not just for me but for them too.”<br /><br /><br />Keep up with us on social (<a href=\"https://twitter.com/googlestudents\">Twitter</a>,&nbsp;<a href=\"https://www.instagram.com/googlestudents/\">Instagram</a>,&nbsp;<a href=\"https://www.facebook.com/GoogleStudents/\">Facebook</a>, and&nbsp;<a href=\"https://www.youtube.com/GoogleStudents\">YouTube</a>) to hear more about our initiatives.<br /><div><br /></div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google Students",
    "uri": "http://www.blogger.com/profile/15517669815238556768",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 33
}