{
  "title": "TU76: Behind the Scenes with Ann and Sue, Reflections and a Look Ahead",
  "link": "https://therapistuncensored.com/episodes/tu76-behind-the-scenes-with-ann-and-sue-reflections-and-a-look-ahead/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu76-behind-the-scenes-with-ann-and-sue-reflections-and-a-look-ahead",
  "pubDate": "Thu, 30 Aug 2018 04:46:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=6377",
  "description": "In this candid and more personal conversation than usual, Therapist Uncensored co-hosts Ann Kelley PhD and Sue Marriott LCSW CGP open up about the last year of podcasting and a few painful life events. Since they are therapists first, they typically keep themselves somewhat out and keep content forward. This is to protect patients that may be listening but also to keep the focus on the material the audience is tuning into to hear, the content.\n\nHowever during this break between seasons, they’ve had time to both prepare for next season and really get candid about where they are, which has been in some tough spots. They decided to share some of that in order to walk the walk and be candid and open with their audience about their own journey in this process. The show is about risk and transparency and vulnerability so if they are going to ask you to do that, then how in the world can they not do the same in kind?\n\nThey also then go on to share their thoughts and excitement about things to come. They specify a few ideas, including how to make the podcast totally ad-free but still be able find a way to sustainably produce it (funding and time – family, work, kids etc.). One idea was to have an advanced track that was paid content where listeners who wanted more can pay per month for extra content to go in-depth, have direct access to Ann and Sue for questions in a time managed format like Vox, and create a community to have direct access to one another. Another idea was to do webinars and create classes, Ann especially wants to do one for couples. Regardless they have to find a way to support the production of the show and go more in-depth with material, since each podcast needs to be able to stand alone. It’s a dilema.\n\nFinally they practically beg you to give them feedback so your input is included in planning for Season 3. 🙂 Coregulation you know. PLEASE go to Therapist Uncensored and push the blue button to the right and leave a message. Or if you prefer, email info@therapistuncensored.com.\n\nThey are already recording for next season and will begin Season 3 soon. Not sure when, no pressure on them please, but when it happens they’ll be in ship shape and ready to roll. In the meantime enjoy the replays! Remember everything so far is FREE and totally accessible to everyone!\n\nLike us on Facebook!\n\n \nGet Your Therapist Uncensored Swag\n \n\nTweet",
  "enclosure": "",
  "itunes:subtitle": "In this candid and more personal conversation than usual, Therapist Uncensored co-hosts Ann Kelley PhD and Sue Marriott LCSW CGP open up about the last year of podcasting and a few painful life events. Since they are therapists first,",
  "itunes:summary": "Sue and Ann walk the walk by bringing authenticity and vulnerability to their listeners and seeking connection, engagement and feedback.  They also request listener feedback and input to help them co-create an exciting and high quality Season 3 of Therapist Uncensored.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "10:01"
}