{
  "title": "Principal Balances of Compositional Data for Regression and Classification using Partial Least Squares. (arXiv:2211.01686v1 [stat.ME])",
  "link": "http://arxiv.org/abs/2211.01686",
  "description": "<p>High-dimensional compositional data are commonplace in the modern omics\nsciences amongst others. Analysis of compositional data requires a proper\nchoice of orthonormal coordinate representation as their relative nature is not\ncompatible with the direct use of standard statistical methods. Principal\nbalances, a specific class of log-ratio coordinates, are well suited to this\ncontext since they are constructed in such a way that the first few coordinates\ncapture most of the variability in the original data. Focusing on regression\nand classification problems in high dimensions, we propose a novel Partial\nLeast Squares (PLS) based procedure to construct principal balances that\nmaximize explained variability of the response variable and notably facilitates\ninterpretability when compared to the ordinary PLS formulation. The proposed\nPLS principal balance approach can be understood as a generalized version of\ncommon logcontrast models, since multiple orthonormal (instead of one)\nlogcontrasts are estimated simultaneously. We demonstrate the performance of\nthe method using both simulated and real data sets.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/stat/1/au:+Nesrstova_V/0/1/0/all/0/1\">V. Nesrstov&#xe1;</a> (1), <a href=\"http://arxiv.org/find/stat/1/au:+Wilms_I/0/1/0/all/0/1\">I. Wilms</a> (2), <a href=\"http://arxiv.org/find/stat/1/au:+Palarea_Albaladejo_J/0/1/0/all/0/1\">J. Palarea-Albaladejo</a> (3), <a href=\"http://arxiv.org/find/stat/1/au:+Filzmoser_P/0/1/0/all/0/1\">P. Filzmoser</a> (4), <a href=\"http://arxiv.org/find/stat/1/au:+Martin_Fernandez_J/0/1/0/all/0/1\">J. A. Mart&#xed;n-Fern&#xe1;ndez</a> (3), <a href=\"http://arxiv.org/find/stat/1/au:+Friedecky_D/0/1/0/all/0/1\">D. Friedeck&#xfd;</a> (5), <a href=\"http://arxiv.org/find/stat/1/au:+Hron_K/0/1/0/all/0/1\">K. Hron</a> (1) ((1) Department of Mathematical Analysis and Applications of Mathematics, Palack&#xfd; University Olomouc, Faculty of Science, the Czech Republic (2) Department of Quantitative Economics, Maastricht University, Maastricht, the Netherlands (3) Department of Computer Science, Applied Mathematics and Statistics, University of Girona, Girona, Spain (4) Department of Statistics and Probability Theory, Vienna University of Technology, Vienna, Austria (5) Laboratory for Inherited Metabolic Disorders, Department of Clinical Biochemistry, University Hospital Olomouc and Faculty of Medicine and Dentistry, Palack&#xfd; University Olomouc, Olomouc, the Czech Republic)"
}