{
  "title": "Glut of Fake LinkedIn Profiles Pits HR Against the Bots",
  "link": "https://krebsonsecurity.com/2022/10/glut-of-fake-linkedin-profiles-pits-hr-against-the-bots/",
  "comments": "https://krebsonsecurity.com/2022/10/glut-of-fake-linkedin-profiles-pits-hr-against-the-bots/#comments",
  "dc:creator": "BrianKrebs",
  "pubDate": "Wed, 05 Oct 2022 21:20:53 +0000",
  "category": [
    "A Little Sunshine",
    "The Coming Storm",
    "Web Fraud 2.0",
    "Hamish Taylor",
    "ISOutsource",
    "Jason Lathrop",
    "Linkedin bots",
    "Mark Miller"
  ],
  "guid": "https://krebsonsecurity.com/?p=61434",
  "description": "A recent proliferation of phony executive profiles on LinkedIn is creating something of an identity crisis for the business networking site, and for companies that rely on it to hire and screen prospective employees. The fabricated LinkedIn identities — which pair AI-generated profile photos with text lifted from legitimate accounts — are creating major headaches for corporate HR departments and for those managing invite-only LinkedIn groups.",
  "content:encoded": "<p>A recent proliferation of phony executive profiles on <strong>LinkedIn</strong> is creating something of an identity crisis for the business networking site, and for companies that rely on it to hire and screen prospective employees. The fabricated LinkedIn identities &#8212; which pair AI-generated profile photos with text lifted from legitimate accounts &#8212; are creating major headaches for corporate HR departments and for those managing invite-only LinkedIn groups.</p>\n<div id=\"attachment_61445\" style=\"width: 759px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-61445\" loading=\"lazy\" class=\" wp-image-61445\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/botsgroup.png\" alt=\"\" width=\"749\" height=\"415\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/botsgroup.png 1797w, https://krebsonsecurity.com/wp-content/uploads/2022/10/botsgroup-768x425.png 768w, https://krebsonsecurity.com/wp-content/uploads/2022/10/botsgroup-1536x850.png 1536w, https://krebsonsecurity.com/wp-content/uploads/2022/10/botsgroup-782x433.png 782w\" sizes=\"(max-width: 749px) 100vw, 749px\" /><p id=\"caption-attachment-61445\" class=\"wp-caption-text\">Some of the fake profiles flagged by the co-administrator of a popular sustainability group on LinkedIn.</p></div>\n<p>Last week, KrebsOnSecurity examined <a href=\"https://krebsonsecurity.com/2022/09/fake-ciso-profiles-on-linkedin-target-fortune-500s/\" rel=\"noopener\" target=\"_blank\">a flood of inauthentic LinkedIn profiles</a> all claiming Chief Information Security Officer (CISO) roles at various Fortune 500 companies, including <strong>Biogen</strong>, <strong>Chevron</strong>, <strong>ExxonMobil</strong>, and <strong>Hewlett Packard</strong>.</p>\n<p>Since then, the response from LinkedIn users and readers has made clear that these phony profiles are showing up en masse for virtually all executive roles &#8212; but particularly for jobs and industries that are adjacent to recent global events and news trends.</p>\n<p><a href=\"https://www.linkedin.com/in/hamishtaylor/\" target=\"_blank\" rel=\"noopener\">Hamish Taylor</a> runs the <strong>Sustainability Professionals</strong> group on LinkedIn, which has more than 300,000 members. Together with the group&#8217;s co-owner, Taylor said they&#8217;ve blocked <em>more than 12,700 suspected fake profiles so far this year</em>, including dozens of recent accounts that Taylor describes as &#8220;cynical attempts to exploit Humanitarian Relief and Crisis Relief experts.&#8221;</p>\n<p>&#8220;We receive over 500 fake profile requests to join on a weekly basis,&#8221; Taylor said. &#8220;It&#8217;s hit like hell since about January of this year. Prior to that we did not get the swarms of fakes that we now experience.&#8221;</p>\n<div id=\"attachment_61447\" style=\"width: 761px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-61447\" loading=\"lazy\" class=\" wp-image-61447\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/linkedinhelp.png\" alt=\"\" width=\"751\" height=\"421\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/linkedinhelp.png 1890w, https://krebsonsecurity.com/wp-content/uploads/2022/10/linkedinhelp-768x430.png 768w, https://krebsonsecurity.com/wp-content/uploads/2022/10/linkedinhelp-1536x861.png 1536w, https://krebsonsecurity.com/wp-content/uploads/2022/10/linkedinhelp-782x438.png 782w\" sizes=\"(max-width: 751px) 100vw, 751px\" /><p id=\"caption-attachment-61447\" class=\"wp-caption-text\">The opening slide for a plea by Taylor&#8217;s group to LinkedIn.</p></div>\n<p>Taylor recently posted an entry on LinkedIn titled, &#8220;<strong>The Fake ID Crisis on LinkedIn</strong>,&#8221; which lampooned the &#8220;60 Least Wanted &#8216;Crisis Relief Experts&#8217; &#8212; fake profiles that claimed to be experts in disaster recovery efforts in the wake of recent hurricanes. The images above and below show just one such swarm of profiles the group flagged as inauthentic. Virtually all of these profiles were removed from LinkedIn after KrebsOnSecurity tweeted about them last week.</p>\n<div id=\"attachment_61460\" style=\"width: 761px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-61460\" loading=\"lazy\" class=\" wp-image-61460\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/botgroup2.png\" alt=\"\" width=\"751\" height=\"416\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/botgroup2.png 1797w, https://krebsonsecurity.com/wp-content/uploads/2022/10/botgroup2-768x425.png 768w, https://krebsonsecurity.com/wp-content/uploads/2022/10/botgroup2-1536x850.png 1536w, https://krebsonsecurity.com/wp-content/uploads/2022/10/botgroup2-782x433.png 782w\" sizes=\"(max-width: 751px) 100vw, 751px\" /><p id=\"caption-attachment-61460\" class=\"wp-caption-text\">Another &#8220;swarm&#8221; of LinkedIn bot accounts flagged by Taylor&#8217;s group.</p></div>\n<p><a href=\"https://www.linkedin.com/in/seniorstoryteller/\" target=\"_blank\" rel=\"noopener\">Mark Miller</a> is the owner of the <a href=\"https://www.linkedin.com/company/devopsgroup/\" target=\"_blank\" rel=\"noopener\">DevOps group</a> on LinkedIn, and says he deals with fake profiles on a daily basis &#8212; often hundreds per day. What Taylor called &#8220;swarms&#8221; of fake accounts Miller described instead as &#8220;waves&#8221; of incoming requests from phony accounts.</p>\n<p>&#8220;When a bot tries to infiltrate the group, it does so in waves,&#8221; Miller said. &#8220;We&#8217;ll see 20-30 requests come in with the same type of information in the profiles.&#8221;</p>\n<p>After screenshotting the waves of suspected fake profile requests, Miller started sending the images to LinkedIn&#8217;s abuse teams, which told him they would review his request but that he may never be notified of any action taken.</p>\n<div id=\"attachment_61448\" style=\"width: 758px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-61448\" loading=\"lazy\" class=\" wp-image-61448\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/devopsbots.png\" alt=\"\" width=\"748\" height=\"789\" /><p id=\"caption-attachment-61448\" class=\"wp-caption-text\">Some of the bot profiles identified by Mark Miller that were seeking access to his DevOps LinkedIn group. Miller said these profiles are all listed in the order they appeared.</p></div>\n<p>Miller said that after months of complaining and sharing fake profile information with LinkedIn, the social media network appeared to do something which caused the volume of group membership requests from phony accounts to drop precipitously.</p>\n<p>&#8220;I wrote our LinkedIn rep and said we were considering closing the group down the bots were so bad,&#8221; Miller said. &#8220;I said, &#8216;You guys should be doing something on the backend to block this.&#8221;</p>\n<p><a href=\"https://www.linkedin.com/in/jdlathrop/\" rel=\"noopener\" target=\"_blank\">Jason Lathrop</a> is vice president of technology and operations at <strong>ISOutsource</strong>, a Seattle-based consulting firm with roughly 100 employees. Like Miller, Lathrop&#8217;s experience in fighting bot profiles on LinkedIn suggests the social networking giant will eventually respond to complaints about inauthentic accounts. That is, if affected users complain loudly enough (posting about it publicly on LinkedIn seems to help).</p>\n<p>Lathrop said that about two months ago his employer noticed waves of new followers, and identified more than 3,000 followers that all shared various elements, such as profile photos or text descriptions.</p>\n<p>&#8220;Then I noticed that they all claim to work for us at some random title within the organization,&#8221; Lathrop said in an interview with KrebsOnSecurity. &#8220;When we complained to LinkedIn, they&#8217;d tell us these profiles didn&#8217;t violate their community guidelines. But like heck they don&#8217;t! These people don&#8217;t exist, and they&#8217;re claiming they work for us!&#8221;</p>\n<p>Lathrop said that after his company&#8217;s third complaint, a LinkedIn representative responded by asking ISOutsource to send a spreadsheet listing every legitimate employee in the company, and their corresponding profile links. </p>\n<p>Not long after that, the phony profiles that were not on the company&#8217;s list were deleted from LinkedIn. Lathrop said he&#8217;s still not sure how they&#8217;re going to handle getting new employees allowed into their company on LinkedIn going forward.<span id=\"more-61434\"></span></p>\n<p>It remains unclear why LinkedIn has been <a href=\"https://blog.linkedin.com/2022/june/16/working-together-to-keep-linkedin-safe\" rel=\"noopener\" target=\"_blank\">flooded with so many fake profiles lately</a>, or how the phony profile photos are sourced. Random testing of the profile photos shows they resemble but do not match other photos posted online. Several readers pointed out one likely source &#8212; the website thispersondoesnotexist.com, which makes using artificial intelligence to create unique headshots a point-and-click exercise.</p>\n<p>Cybersecurity firm <strong>Mandiant</strong> (recently acquired by <strong>Google</strong>) <a href=\"https://www.yahoo.com/video/north-korean-fraudsters-suspected-copying-153907880.html\" target=\"_blank\" rel=\"noopener\">told Bloomberg</a> that hackers working for the North Korean government have been copying resumes and profiles from leading job listing platforms LinkedIn and Indeed, as part of an elaborate scheme to land jobs at cryptocurrency firms.</p>\n<p>Fake profiles also may be tied to so-called <a href=\"https://krebsonsecurity.com/2022/07/massive-losses-define-epidemic-of-pig-butchering/\" target=\"_blank\" rel=\"noopener\">&#8220;pig butchering&#8221; scams</a>, wherein people are lured by flirtatious strangers online into investing in cryptocurrency trading platforms that eventually seize any funds when victims try to cash out.</p>\n<p>In addition, identity thieves have been known <a href=\"https://krebsonsecurity.com/2021/05/how-to-tell-a-job-offer-from-an-id-theft-trap/\" rel=\"noopener\" target=\"_blank\">to masquerade on LinkedIn as job recruiters</a>, collecting personal and financial information from people who fall for employment scams.</p>\n<p>But the Sustainability Group administrator Taylor said the bots he&#8217;s tracked strangely don&#8217;t respond to messages, nor do they appear to try to post content.</p>\n<p>&#8220;Clearly they are not monitored,&#8221; Taylor assessed. &#8220;Or they&#8217;re just created and then left to fester.&#8221;</p>\n<p>This experience was shared by the DevOp group admin Miller, who said he&#8217;s also tried baiting the phony profiles with messages referencing their fakeness. Miller says he&#8217;s worried someone is creating a massive social network of bots for some future attack in which the automated accounts may be used to amplify false information online, or at least muddle the truth.</p>\n<p><span class=\"pullquote pqright\">&#8220;It&#8217;s almost like someone is setting up a huge bot network so that when there&#8217;s a big message that needs to go out they can just mass post with all these fake profiles,&#8221; Miller said.</span></p>\n<p>In last week&#8217;s story on this topic, I suggested LinkedIn could take one simple step that would make it far easier for people to make informed decisions about whether to trust a given profile: Add a “created on” date for every profile. Twitter does this, and it’s enormously helpful for filtering out a great deal of noise and unwanted communications.</p>\n<p>Many of our readers on Twitter said LinkedIn needs to give employers more tools &#8212; perhaps some kind of application programming interface (API) &#8212; that would allow them to quickly remove profiles that falsely claim to be employed at their organizations.</p>\n<p>Another reader suggested LinkedIn also could experiment with offering something akin to Twitter’s verified mark to users who chose to validate that they can respond to email at the domain associated with their stated current employer. </p>\n<p>In response to questions from KrebsOnSecurity, LinkedIn said it was considering the domain verification idea.</p>\n<p>&#8220;This is an ongoing challenge and we&#8217;re constantly improving our systems to stop fakes before they come online,&#8221; LinkedIn said in a written statement. &#8220;We do stop the vast majority of fraudulent activity we detect in our community &#8211; around 96% of fake accounts and around 99.1% of spam and scams. We&#8217;re also exploring new ways to protect our members such as expanding email domain verification. Our community is all about authentic people having meaningful conversations and to always increase the legitimacy and quality of our community.&#8221;</p>\n<p>In <a href=\"https://www.bloomberg.com/opinion/articles/2022-10-04/fake-linkedin-profiles-threaten-the-professional-social-media-platform\" target=\"_blank\" rel=\"noopener\">a story published Wednesday</a>, Bloomberg noted that LinkedIn has largely so far avoided the scandals about bots that have plagued networks like Facebook and Twitter. But that shine is starting to come off, as more users are forced to waste more of their time fighting off inauthentic accounts.</p>\n<p>&#8220;What&#8217;s clear is that LinkedIn&#8217;s cachet as being the social network for serious professionals makes it the perfect platform for lulling members into a false sense of security,&#8221; Bloomberg&#8217;s <strong>Tim Cuplan</strong> wrote. &#8220;Exacerbating the security risk is the vast amount of data that LinkedIn collates and publishes, and which underpins its whole business model but which lacks any robust verification mechanisms.&#8221;</p>\n",
  "wfw:commentRss": "https://krebsonsecurity.com/2022/10/glut-of-fake-linkedin-profiles-pits-hr-against-the-bots/feed/",
  "slash:comments": 35
}