{
  "title": "Import AI 300: Google&#8217;s Bitter Lesson; DOOM AGI; DALL-E&#8217;s open source competition StableDiffusion",
  "link": "https://jack-clark.net/2022/08/22/import-ai-300-googles-bitter-lesson-doom-agi-dall-es-open-source-competition-stablediffusion/",
  "comments": "https://jack-clark.net/2022/08/22/import-ai-300-googles-bitter-lesson-doom-agi-dall-es-open-source-competition-stablediffusion/#comments",
  "dc:creator": "Jack Clark",
  "pubDate": "Mon, 22 Aug 2022 19:18:00 +0000",
  "category": "Uncategorized",
  "guid": "http://jack-clark.net/?p=2350",
  "description": "Google makes its robots massively smarter by swapping out one LM for a different, larger LM: …Maybe language models really can work as world models… Earlier this year, Google showed how it was able to use a large language model to significantly improve the performance and robustness of robots tasked with doing tasks in the [&#8230;]",
  "content:encoded": "\n<p><strong>Google makes its robots massively smarter by swapping out one LM for a different, larger LM:</strong></p>\n\n\n\n<p><em>…Maybe language models really can work as world models…</em></p>\n\n\n\n<p>Earlier this year, Google showed how it was able to use a large language model to significantly improve the performance and robustness of robots tasked with doing tasks in the physical world. The &#8216;SayCan&#8217; approach (<a href=\"https://jack-clark.net/2022/04/11/import-ai-291-google-trains-the-worlds-biggest-language-model-so-far-how-robots-can-be-smarter-about-the-world-conjecture-a-new-ai-alignment-company/\">Import AI 291</a>) basically involved taking the affordances outputted by on-robot AI systems and pairing that with a language model, looking at the high-likleihood actions generated by both systems (the on-robot models, as well as the LM), then taking actions accordingly. The approach is both simple and effective. Now, Google has found a way to make the approach much, much more effective. The secret? Swapping out one LM for a far larger one.&nbsp;</p>\n\n\n\n<p><strong>What Google did: </strong>Google upgraded its robots by pairing them with its large-scale 540B parameter &#8216;PALM&#8217; language model, where the previous system used the 137B parameter &#8216;FLAN&#8217; model. The larger model gives the robots significantly improved performance: &#8220;The results show that the system using PaLM with affordance grounding (PaLM-SayCan) chooses the correct sequence of skills 84% of the time and executes them successfully 74% of the time, reducing errors by half compared to FLAN,&#8221; Google writes.&nbsp;</p>\n\n\n\n<p><strong>The bitter lesson &#8211; bigger is better: </strong>Though FLAN was finetuned to be good at instruction following, PALM beats FLAN likely as a consequence of scale. &#8220;The broader and improved dataset for PaLM may make up for this difference in training,&#8221; Google writes. This is significant as it&#8217;s another sign that simply scaling up models lets them develop a bunch of capabilities naturally which beat human-engineered finetuned approaches &#8211; chalk another point up in favor of silicon minds versus mushy minds.&nbsp;</p>\n\n\n\n<p><strong>&nbsp;&nbsp;&nbsp;Read more</strong>: <a href=\"https://arxiv.org/abs/2204.01691\">Do As I Can, Not As I Say: Grounding Language in Robotic Affordances (arXiv, read the &#8216;v2&#8217; version).</a></p>\n\n\n\n<p>####################################################</p>\n\n\n\n<p><strong>DOOM programmer Carmack starts AGI company:</strong><strong><br></strong><em>…Keen Technologies to do AGI via &#8216;mad science&#8217;&#8230;</em></p>\n\n\n\n<p>&#8220;It is a truth universally acknowledged, that a man in possession of a good fortune, must be in want of an AGI company,” wrote Jane &#8216;Cyber&#8217; Austen, and she&#8217;s right: AGI companies are now proliferating left and right, and the latest is &#8216;Keen Technologies&#8217;, an AGI startup from John Carmack, the famed programmer behind the DOOM games. Keen has raised an initial seed round of $20 million (not much in the scheme of AI startups) and its mission, per Carmack, is &#8220;AGI or bust, by way of Mad Science&#8221;.</p>\n\n\n\n<p><strong>Why this matters:</strong> One of the clues for impending technological progress is that a bunch of extremely smart, accomplished people go and all stack their proverbial career poker chips in the same place. That&#8217;s been happening in AI for a while, but the fact it&#8217;s now drawing attention from established experts in other fields (in the case of Carmack, computer graphics and general programming wizardry) is a further indication of potential for rapid progress here.&nbsp;</p>\n\n\n\n<p><strong>&nbsp;&nbsp;&nbsp;Read more</strong> in <a href=\"https://twitter.com/ID_AA_Carmack/status/1560728042959507457\">Carmack&#8217;s tweet thread (Twitter)</a>.</p>\n\n\n\n<p><br>####################################################</p>\n\n\n\n<p><strong>Want GPT2 to know about Covid and Ukraine? So does HuggingFace:</strong><strong><br></strong><em>…Online language modeling means GPT2 and BERT are going to get better…</em></p>\n\n\n\n<p>HuggingFace plans to continuously train and release masked language models (e.g, BERT and GPT2) on new Common Crawl snapshots. This is a pretty useful community service; developers tend to pull whatever off-the-shelf models they can when starting projects, and most publicly available GPT2 and BERT models are essentially amber-frozen records up to 2020 or so (sometimes 2021), so things like COVID or the Ukraine conflict or the current global financial meltdown elude them. By having more current models, developers can deploy things which are more accurate and appropriate to current contexts.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;&nbsp;<strong>Read</strong> the <a href=\"https://twitter.com/TristanThrush/status/1557403968195596288\">HuggingFace tweet thread here (Tristan Thrust, Twitter)</a>.</p>\n\n\n\n<p>####################################################<br></p>\n\n\n\n<p><strong>Want to use China&#8217;s good open source language model? You&#8217;ll need to agree not to attack China, first:</strong><strong><br></strong><em>…Terms and conditions with a hint of geopolitics…</em></p>\n\n\n\n<p>If you want to access the weights of GLM-130B (<a href=\"https://jack-clark.net/2022/08/08/import-ai-299-the-worlds-best-language-model-is-made-in-china-nvidia-boosts-llm-training-openai-shows-how-to-fill-in-the-middle-on-a-language-model/\">Import AI #299</a>), a good new language model from Tsinghua University, you&#8217;ll need to first agree that &#8220;you will not use the Software for any act that may undermine China&#8217;s national security and national unity, harm the public interest of society, or infringe upon the rights and interests of human beings&#8221; &#8211; that&#8217;s according to the application form people fill out to get the model weights.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;Furthermore, &#8220;this license shall be governed and construed in accordance with the laws of People’s Republic of China. Any dispute arising from or in connection with this License shall be submitted to Haidian District People&#8217;s Court in Beijing.&#8221;<br><br>&nbsp; <strong>Why this matters:</strong> IDK dude. I spend a lot of time in this newsletter writing about the geopolitical implications of AI. This kind of wording in a license for a big model just does my job for me.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Read more: </strong><a href=\"https://docs.google.com/forms/d/e/1FAIpQLSehr5Dh_i3TwACmFFi8QEgIVNYGmSPwV0GueIcsUev0NEfUug/viewform\">GLM-130B Application Form (Google Form)</a>.</p>\n\n\n\n<p>####################################################</p>\n\n\n\n<p><strong>DALL-E gets semi-open competition: Stable Diffusion launches to academics:</strong></p>\n\n\n\n<p><em>…Restrictions lead to models with fewer restrictions. The ratchet clicks again…</em></p>\n\n\n\n<p>A bunch of researchers have come together to build an image model like DALL-E2 but with fewer restrictions and designed with broader distribution in mind. They also have access to a <em>really big</em> GPU cluster. That&#8217;s the tl;dr on &#8216;Stable Diffusion&#8217;, a new family of models launched by AI research collective Stability.ai. They&#8217;re making the weights available to academics via an access scheme and are planning to do a public release soon.&nbsp;</p>\n\n\n\n<p><strong>What&#8217;s interesting about Stable Diffusion:</strong> This model is basically a natural consequence of the restrictions other companies have placed on image models (ranging from Google which built Imagen but hasn&#8217;t released it, to OpenAI which built DALL-E2, then released it with a bunch of filters and prompt-busting bias interventions). I generally think of this as being an example of &#8216;libertarian AI&#8217; &#8211; attempts to create restrictions on some part of model usage tend to incentivize the creation of things without those restrictions. This is also, broadly, just what happens in markets.&nbsp;</p>\n\n\n\n<p><strong>Big compute &#8211; not just for proprietary stuff: </strong>&#8220;The model was trained on our <strong>4,000 A100</strong> Ezra-1 AI ultracluster over the last month as the first of a series of models exploring this and other approaches,&#8221; Stability.ai writes. Very few labs have access to a thousand GPUs, and 4k GPUs puts Stability.ai into somewhat rarified company, in distribution with some of the largest labs.&nbsp;</p>\n\n\n\n<p><strong>Aesthetic data</strong>:&#8221;The core dataset was trained on LAION-Aesthetics, a soon to be released subset of LAION 5B. LAION-Aesthetics was created with a new CLIP-based model that filtered LAION-5B based on how “beautiful” an image was, building on ratings from the alpha testers of Stable Diffusion,&#8221; they write.&nbsp;</p>\n\n\n\n<p><strong>Why this matters:</strong> Generative models are going to change the world in a bunch of first- and second-order ways. By releasing StableDiffusion (and trying to do an even more public release soon), stability.ai is able to create a better base of evidence about the opportunities and risks inherent to model diffusion.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;&#8220;This is an experiment in safe and community-driven publication of a capable and general text-to-image model. We are working on a public release with a more permissive license that also incorporates ethical considerations,&#8221; Stability.ai writes.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Read more</strong>: <a href=\"https://stability.ai/blog/stable-diffusion-announcement\">Stable Diffusion launch announcement (Stability.ai)</a>.</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Apply for academic access here</strong>: <a href=\"https://stability.ai/research-access-form\">Research and Academia (Stability.ai)</a>.</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Get the weights from here</strong> <a href=\"https://github.com/CompVis/stable-diffusion\">once you have access (GitHub)</a>.</p>\n\n\n\n<p><br>####################################################<br><br><strong>Tech Tales:</strong></p>\n\n\n\n<p><strong><em>Superintelligence Captured by Superintelligence</em></strong></p>\n\n\n\n<p>After we figured out how to build superintelligence, it wasn&#8217;t long before the machines broke off from us and started doing their own thing. We&#8217;d mostly got the hard parts of AI alignment right, so the machines neither eradicated or domesticated the humans, nor did they eat the sun.&nbsp;</p>\n\n\n\n<p>They did, however, start to have &#8216;disagreements&#8217; which they&#8217;d settle in ways varying from debate through to taking kinetic actions against one another. I guess even superintelligences get bored.&nbsp;</p>\n\n\n\n<p>Fortunately, they had the decency to do the kinetic part on the outer edges of the solar system, where they&#8217;d migrated a sizable chunk of their compute to. At night, we&#8217;d watch the livefeeds from some of the space-based telescopes, staring in window as the machines resolved arguments through carefully choreographed icerock collisions. It was as though they&#8217;d brought the stars to the very edge of the system, and the detonations could be quite beautiful.</p>\n\n\n\n<p>They tired of this game eventually and moved onto something more involved: capturing. Now, the machines would seek to outsmart eachother, and the game &#8211; as far as we could work out &#8211; was a matter of sending enough robots to the opponents&#8217; central processing core that you could put a probe in and temporarily take it over. The machines had their own laws they followed, so they&#8217;d always retract the probe eventually, giving the losing machine its mind back. <br><br><strong>Things that inspired this story: </strong>Boredom among aristocrats; perhaps the best competition is a game of mind against mind; figuring out how machines might try to sharpen themselves and what whetstones they might use.</p>\n",
  "wfw:commentRss": "https://jack-clark.net/2022/08/22/import-ai-300-googles-bitter-lesson-doom-agi-dall-es-open-source-competition-stablediffusion/feed/",
  "slash:comments": 1,
  "media:content": {
    "media:title": "Jack Clark"
  }
}