{
  "title": "Episode 88: &#8220;Cathy&#8217;s Clown&#8221; by the Everly Brothers",
  "link": "https://500songs.com/podcast/episode-88-cathys-clown-by-the-everly-brothers/",
  "pubDate": "Thu, 02 Jul 2020 12:05:48 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-88-cathys-clown-by-the-everly-brothers/",
  "description": "Episode eighty-eight of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Cathy's Clown\" by The Everly Brothers, and at how after signing the biggest contract in music business history their career was sabotaged by their manager. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/38878865\">\"Poetry in Motion\" by Johnny Tillotson</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-88-cathys-clown/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are no first-rate biographies of the Everly Brothers in print, at least in English (apparently there's a decent one in French, but I don't speak French well enough for that). <a href=\"https://amzn.to/2CvoMSj\"><em>Ike's Boys</em> by Phyllis Karp</a> is the only full-length bio,  and I relied on that in the absence of anything else, but it's been out of print for nearly thirty years, and is not worth the exorbitant price it goes for second-hand.\n\n<a href=\"http://www.hillmanweb.com/everly/refs/\">The Everlypedia</a> is a series of PDFs containing articles on anything related to the Everly Brothers, in alphabetical order.\n\n<a href=\"https://amzn.to/2YPxG9g\">This collection</a> has all the Everlys' recordings up to the end of 1962.  I would also recommend <a href=\"https://amzn.to/3dSjVem\">this recently-released box set</a> containing expanded versions of their three last studio albums for Warners, including <em>Roots</em>, which I discuss in the episode.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nThis week we're going to look at the Everly Brothers' first and biggest hit of the sixties, a song that established them as hit songwriters in their own right, which was more personal than anything they'd released earlier, and which was a big enough hit that it saved what was to become a major record label. We're going to look at \"Cathy's Clown\":\n\n[Excerpt: The Everly Brothers, \"Cathy's Clown\"]\n\nWhen we left the Everly Brothers, six months ago, we had seen them have their first chart hits and record the classic album Songs Our Daddy Taught Us, an album that prefigured by several years the later sixties folk music revival, and which is better than much of the music that came out of that later scene. Both artistically and commercially, they were as successful as any artists of the early rock era. But Don Everly, in particular, wanted them to have more artistic control themselves -- and if they could move to a bigger label as well, that was all the better.\n\nBut as it happens, they didn't move to a bigger label, just a richer one.\n\nWarner Brothers Records had started in 1958, and had largely started because of changes in the film industry. In the late 1940s and early fifties, the film industry was being hit on all sides. Anti-trust legislation meant that the film studios had to get rid of the cinema chains they owned, losing a massive revenue stream (and also losing the opportunity to ensure that their films got shown no matter how poor their reputation). A series of lawsuits from actors had largely destroyed the star system on which the major studios relied, and then television became a huge factor in the entertainment industry, cutting further into the film studios' profits.\n\nAn aside about that -- one of the big reasons for the growth of television as America's dominant entertainment medium is racism. In the thirties and forties, there had been huge waves of black people moving from rural areas to the cities in search of work, and we've looked at that and the way that led to the creation of rhythm and blues in many of the previous episodes. After World War II there was a corresponding period of white flight, where white people moved en masse away from the big cities and into small towns and suburbs, to get away from black people. This is largely what led to America's car culture and general lack of public transport, because low-population-density areas aren't as easy to serve with reliable public transport. And in the same way it's also uneconomical to run mass entertainment venues like theatres and cinemas in low-population-density areas, and going to the cinema becomes much less enticing if you have to drive twenty miles to get to one, rather than walking down the street.\n\nSo white flight had essentially meant the start of a process by which entertainment in America moved from the public sphere to the private one. This is also a big reason for the boom in record sales in the middle decades of last century -- records are private entertainment, as opposed to going out to a dance or a show.\n\nAnd this left the big film studios in dire straits. But while they were down on their luck when it came to films, Warners were doing very well in the music publishing business, where unlike their ownership of cinemas they didn't have to get rid of their properties. Warners had always owned the songs used in their films, and indeed one of the reasons that Looney Tunes and Merrie Melodies existed in the first place was so that they could plug songs that Warners owned. When Tex Avery has Owl Jolson singing \"I Love to Singa\":\n\n[Excerpt: “Owl Jolson”, \"I Love to Singa\"]\n\nThat's a song that had originally appeared in a Warners feature film a few months earlier, sung by Al Jolson and Cab Calloway:\n\n[Excerpt: Al Jolson and Cab Calloway, \"I Love to Singa\"]\n\nSo Warners were making money from the music industry. But then they realised something. Tab Hunter, one of their film stars under contract to them, had started to have hit records. His record \"Young Love\" spent six weeks at number one:\n\n[Excerpt: Tab Hunter, \"Young Love\"]\n\nAnd whenever he was interviewed to promote a film, all the interviewers would ask about was his music career. That was bad enough -- after all, he wasn't signed to Warners as a singer, he was meant to be a film star -- but what was worse was that the label Hunter was on, Dot Records, was owned by a rival film studio, Paramount. Warners would go to all the trouble of getting an interview set up for their star, and then all it would do was put money into Paramount's pocket!\n\nThey needed to get into the record business themselves, as a way to exploit their song catalogue if nothing else. At first they thought about just buying Imperial Records, but when that deal fell through they started their own label, and signed Hunter to it right at the point that his career nosedived.\n\nIn the first two years that Warner Brothers Records existed, they only had two hit singles -- \"Kookie Kookie Lend Me Your Comb\", a record based on the Warner-owned TV series 77 Sunset Strip and co-performed by one of that series' stars, Edd Byrnes:\n\n[Excerpt: Edd Byrnes and Connie Stevens, \"Kookie Kookie Lend Me Your Comb\"]\n\nAnd another record by Connie Stevens, who also sang on \"Kookie Kookie Lend Me Your Comb\", and was the star of a different Warners TV series, Hawaiian Eye:\n\n[Excerpt: Connie Stevens, \"Sixteen Reasons\"]\n\nEverything else they released flopped badly. After two years they had lost three million dollars, and would have closed down the label altogether, except the label was owed another two million, and they didn't want to write that off.\n\nThe main reason for these losses was that the label was mostly releasing stuff aimed at the easy listening adult album market, records by people like Henry Mancini, and at the time the singles market was where the money was, and the singles market was dominated by young people. They needed some records that would appeal to young people.\n\nThey decided that they needed the Everly Brothers. At the beginning of 1960, the duo had released ten singles since May 1957, of which nine had charted, as had four of the B-sides. They'd topped the pop charts twice, the R&B charts twice, and the country charts four times. At a time when even the biggest stars would occasionally release the odd flop, they were as close to a guaranteed hit-making machine as existed in the music industry. And they were looking to get away from Cadence Records, for reasons that have never been made completely clear. It's usually said that they had artistic differences with Cadence, but at the same time they always credited Archie Bleyer from Cadence with being the perfect arranger for them -- he arranged their final Cadence single, \"Let it Be Me\":\n\n[Excerpt: The Everly Brothers, \"Let it Be Me\"]\n\nBut for whatever reason, the Everlys *were* looking to find a new label, and Warner Brothers were desperate enough that they signed them up to the biggest contract ever signed in music business history up to that point. Remember that four years earlier, when Elvis had signed with RCA records, they'd paid a one-off fee of forty thousand dollars and *that* was reportedly the largest advance ever paid in the industry up until that point. Now, the Everlys were signing to Warners on a ten-year contract, with a guaranteed advance of one hundred thousand dollars a year for those ten years -- the first million-dollar contract in music history. They were set up until 1970, and were sure to provide Warners with a string of hits that would last out the decade -- or so it seemed at first.\n\nTheir first recording for the label had an unusual melodic inspiration. Ferde Grofé was an arranger and orchestrator for Paul Whiteman's jazz band in the 1920s and thirties. He's particularly known these days for having been the original arranger of Gershwin's \"Rhapsody in Blue\" -- Gershwin had written it for two pianos, and it was Grofé who had come up with the instrumental colouring that these days we think of as being so important to that piece:\n\n[Excerpt: Paul Whiteman \"Rhapsody in Blue (original 1924 recording)\"]\n\nGrofé had written a piece in 1931 called the \"Grand Canyon Suite\", and its third movement, \"On the Trail\" had become the most popular piece of music he ever wrote. Disney made an Oscar-winning short with the suite as its soundtrack in 1958, and you can still hear \"On the Trail\" to this day in the Grand Canyon section of the Disneyland Railroad. But \"On the Trail\" was best known as the music that Phillip Morris used in their radio and TV commercials from the thirties through to the sixties. Here's a bit from the original Whiteman recording of the piece:\n\n[Excerpt: Paul Whiteman, \"Grand Canyon Suite: On the Trail\"]\n\nDon took that melodic inspiration, and combined it with two sources of lyrical inspiration -- when his dad had been a child, he'd had a crush on a girl named Mary, who hadn't been interested, and his schoolfriends had taunted him by singing \"Mary had a little Ike\" at him. The other key to the song came when Don started thinking about an old crush of his own, a girl from his school called Catherine Coe -- though in later years he was at pains to point out that the song wasn't actually about her.\n\nThey took the resulting song into the studio with the normal members of the Nashville A-Team, and it became only their second hit single with an A-side written by one of the brothers, reaching number one on both the pop and R&B charts:\n\n[Excerpt: The Everly Brothers, \"Cathy's Clown\"]\n\nI say it's written by Don -- the original issue of the record credited the songwriting to both Don and Phil, but Phil signed an agreement in 1980 relinquishing his claim to the song, and his name was taken off all future copies. It sounds to me like Don's writing style, and all the anecdotes about its writing talk about him without mentioning any input from Phil, so I'm assuming for these purposes that it's a Don solo composition.\n\nListening to the record, which was the first that the duo produced for themselves, as well as being their first for Warners, you can hear why Don was at times dissatisfied with the songs that Felice and Boudleaux Bryant had written for the brothers. It's a sophisticated piece of work in a number of different ways. For a start, there's the way the music mirrors the lyric on the first line. That line is about separation -- \"Don't want your love any more\" -- and the brothers start the line in unison, but Don's voice slowly drops relative to Phil's, so by the end of the line they're a third apart. It's like he's stepping away:\n\n[Excerpt: The Everly Brothers, \"Cathy's Clown\"]\n\nThe song's structure also seems unusual. Wikipedia says it has a chorus and a bridge but no verse, while the Library of Congress disagrees and says it has a verse and a bridge but no chorus.\n\nPersonally, I'd say that it definitely does have a chorus -- the repeated section with the same words and melody each time it's repeated, with both brothers singing, and with the title of the song at the end, seems as definitively a chorus as one could possibly ask for:\n\n[Excerpt: The Everly Brothers, \"Cathy's Clown\"]\n\nIf that's not a chorus, I'm honestly not sure what is.\n\nThe reason this comes into question is the other section. I would call that section a verse, and I think most people would, and the song's structure is a straightforward A-B-A-B repetition which one would normally call verse/chorus. But it's such a change of pace that it feels like the contrasting section that normally comes with a bridge or middle eight. Indeed the first time I properly learned what a middle eight was -- in a column in Mojo magazine in the mid-nineties called Doctor Rock which explained some basic musicology -- it was specifically cited as an example of one:\n\n[Excerpt: The Everly Brothers, \"Cathy's Clown\"]\n\nPart of the reason that seems so different is that Don's singing it solo, while the brothers are duetting on the choruses, and normally Don's solo lines would be on a bridge or middle eight. Not always, but often enough that that's what you expect if you've listened to a few of their records. But there's also a change in rhythm.\n\nOne of the things you'll notice as we go further into the sixties is that, for a while in the early sixties, the groove in rock and roll -- and also in soul -- moved away from the swinging, shuffling rhythm you get in most of the fifties music we've looked at into a far more straightforward four-four rhythm. In roughly 1961 through 64 or so, you have things like the bam-bam-bam-bam four-on-the-floor beat of early Motown or Four Seasons records, or the chugga-chugga-chugga rhythm of surf guitar, rather than the looser, triplet-based grooves that you'd get in the fifties. And you can hear in \"Cathy's Clown\" the shift in those rhythms happening in the song itself. The verses have an almost Latin feel, with lots of loose cymbal work from Buddy Harman:\n\n[Excerpt: The Everly Brothers, \"Cathy's Clown\"]\n\nWhile the choruses have an almost martial feel to them, a boom-BAP rhythm, and sound like they have two drummers on them:\n\n[Excerpt: The Everly Brothers, \"Cathy's Clown\"]\n\nWhile I say that sounds like there are two drummers, it's still just Harman playing. The difference is that here the engineer, Bill Porter, who was the engineer on a lot of the Nashville recordings we've looked at, notably the Roy Orbison ones, had just obtained a new device -- a tape loop. Now, I've seen some people misunderstand what it was that Porter did with this -- thinking he looped the drums in the way one would loop things today, just playing the same recording over and over. It wasn't that. Rather it was a way of doing what Sam Phillips had been doing with tape echo in Sun a few years earlier -- there would be an endlessly circulating loop of tape, which had both record and playback heads. The drums would be recorded normally, but would also be recorded onto that tape loop, and then when it played back a few milliseconds later it would sound like a second drummer playing along with the first. It's an almost inaudible delay, but it's enough to give a totally different sound to the drums.\n\nPorter would physically switch this loop on and off while recording the track live -- all the vocals and instruments were recorded live together, onto a three-track tape, and he would turn it on for the choruses and off for the verses. This is an early example of the kind of studio experimentation that would define the way records were made in the sixties.\n\nThe rhythm that Harman played was also very influential -- you can hear that it strongly influenced Paul McCartney if you listen to Beatles records like \"What You're Doing\", \"Ticket to Ride\", and \"Tomorrow Never Knows\", all of which have drum patterns which were suggested by McCartney, and all of which are strongly reminiscent of the \"Cathy's Clown\" chorus.\n\n\"Cathy's Clown\" topped the charts for five weeks, and sold two million copies. It was an immense success, and the Everlys seemed to be on top of the world. But it was precisely then that problems started for the duo.\n\nFirst, they moved from Nashville to LA. The main reason for that was that as well as being a record contract, their new contract with Warners would give them the opportunity to appear in films, too. So they spent six months taking acting lessons and doing screen tests, before concluding that neither of them could actually act or remember their lines, and wisely decided that they were going to stick to music.\n\nThe one good thing they took from that six month period was that they rekindled their friendship with the Crickets, and Sonny Curtis wrote them a song called \"Walk Right Back\", which made the top ten (and number one in the UK and New Zealand):\n\n[Excerpt: The Everly Brothers, \"Walk Right Back\"]\n\nCurtis wrote that song while he was in basic training for the military, and when he got a pass for a few days he'd only written the first verse. He played the song to the brothers while he was out on his pass, and they said they liked it. He told them he'd write a second verse and send it to them, but by the time they received his letter with the lyrics for the second verse, they'd already recorded the song, just repeating the first verse.\n\nCurtis wasn't the only one who had to go into basic military training. The brothers, too, knew they would be drafted sooner rather than later, and so they decided to do as several other acts we've discussed did, and sign up voluntarily for six months rather than be drafted for two years. Before they did so, they recorded another song, \"Temptation\", an old standard from the thirties:\n\n[Excerpt: The Everly Brothers, \"Temptation\"]\n\nAnd that track marked the beginning of the end of the Everlys as a chart act. Because it was an old standard, the publishing was not owned by Acuff-Rose, and Wesley Rose was furious. He was both their manager and the owner of Acuff-Rose, the biggest publishing company in country music, and things between them had already become strained when the Everlys had moved to California while Rose had stayed in Nashville. Rose insisted that they only release Acuff-Rose songs as singles, and they refused, saying they wanted to put the single out.\n\nRose retaliated in the most staggeringly petty manner imaginable. He stopped managing them, and he blocked them from being sent any new songs by Felice and Boudleaux Bryant. Because he knew they'd already recorded \"Love Hurts\", a song written by the Bryants, as an album track, he got Roy Orbison, who he also managed, to record a version and put it out as a B-side, as a spoiler in case the Everlys tried to release their version as a single:\n\n[Excerpt: Roy Orbison, \"Love Hurts\"]\n\nWorse than that, even, the Everlys were also signed to Acuff-Rose as songwriters, which meant that they were no longer allowed to record their own songs. For a while they tried writing under pseudonyms, but then Acuff-Rose found out about that and stopped them.\n\nFor a while, even after basically taking a year away from music and being banned from recording their own songs, the brothers continued having hits. They also started another project -- their own record label, Calliope, which would put out their outside projects. For Don, this was a mostly-instrumental adaptation of Elgar's \"Pomp and Circumstance\", which he recorded with an arrangement by Neal Hefti, under the name \"Adrian Kimberly\":\n\n[Excerpt: Adrian Kimberly, \"Pomp and Circumstance\"]\n\nThat made the lower reaches of the US charts, but was banned by the BBC in Britain, because it would offend British patriotic sentiment (for those who don't know, \"Pomp and Circumstance\", under the name \"Land of Hope and Glory\", is something of a second national anthem over here).\n\nPhil's side project was a comedy folk group, the Keestone Family Singers, who recorded a parody of the Kingston Trio's \"Raspberries, Strawberries\", written by Glen Hardin of the Crickets:\n\n[Excerpt: The Keestone Family Singers, \"Cornbread and Chitlings\"]\n\nThe other two singers on that track were people we're going to hear a lot from in later episodes -- a songwriter called Carole King, who a few months later would co-write the Everlys hit \"Crying in the Rain\", and a session guitarist named Glen Campbell.\n\nBut neither of these ventures were particularly successful, and they concentrated on their own records. For a while, they continued having hits. But having no access to the Bryants' songs, and being unable to record the songs they were writing themselves, they relied more and more on cover versions, right at the point the market was starting to change to being based entirely around artists who wrote their own material.\n\nAnd on top of that, there were personal problems -- Don was going through a divorce, and before they were inducted into the Marines, both Don and Phil had started seeing a doctor who gave them what they were told were \"vitamin shots\" to help them keep their energy up, but were actually amphetamines. Both became addicted, and while Phil managed to kick his addiction quickly, Don became incapacitated by his, collapsing on a UK tour and being hospitalised with what was reported as \"food poisoning\", as most overdoses by rock musicians were in the early sixties, leaving Phil to perform on his own while Don recuperated.\n\nTheir fall in popularity after \"Temptation\" was precipitous. Between 1957 and early 1961 they had consistently had massive hits. After \"Temptation\" they had three more top thirty hits, \"Don't Blame Me\", \"Crying in the Rain\", and \"That's Old Fashioned\". They continued having regular hits in the UK through 1965, but after \"That's Old Fashioned\" in early 1962 their US chart positions went seventy-six, forty-eight, a hundred and seven, a hundred and one, didn't chart at all, a hundred and thirty-three... you get the idea. They only had two more top forty hits in the US in the rest of their career -- \"Gone Gone Gone\" in 1964, which made number thirty-one, and \"Bowling Green\" in 1967 which made number forty.\n\nEventually they got the ability to record their own material again, and also to record songs by the Bryants, but the enforced period of several years of relying on cover versions and old standards had left them dead as a commercial act.\n\nBut surprisingly, they weren't artistically dead. They did have a slump around the time of Don's troubles, with a series of weak albums, but by 1965 they'd started making some very strong tracks, covering a stylistic range from soul to country to baroque pop to an entire album, Two Yanks in England, of covers of British songs, backed by the Hollies (who wrote eight of the twelve songs) and a young keyboard player named Reg Dwight, who would later change his name to Elton John:\n\n[Excerpt: The Everly Brothers, \"Somebody Help Me\"]\n\nIn the middle of this commercial slump came their second album-length masterpiece, \"Roots\", an album that, like their earlier \"Songs Our Daddy Taught Us\", looked back to the music they'd grown up on., while also looking forward to the future, mixing new songs by contemporary writers like Merle Haggard and Randy Newman with older folk and country songs:\n\n[Excerpt: The Everly Brothers, \"Illinois\"]\n\nIt stands with the great marriages of Americana, orchestral pop, and psychedelia from around that time, like Randy Newman's first album and Van Dyke Parks' Song Cycle, and has many of the same people involved, including producer Lenny Waronker and keyboard player Van Dyke Parks. It's conceived as a complete piece, with songs fading in and out to excerpts of the Everlys' performances on the radio with their parents as children, and it's quite, quite, lovely. And, like those other albums, it was a complete commercial flop.\n\nThe brothers continued working together for several more years, recording a live album to finish off their ten-year Warners contract, and then switching to RCA, where they recorded a couple of albums of rootsy country-rock in the style of artists they had influenced like Crosby, Stills, Nash and Young. But nothing happened for them commercially, and they were getting less and less happy with working together.\n\nThe two men argued about literally everything, from who was their father's real favourite to politics -- Phil was an intensely conservative Republican while Don is a liberal Democrat. They ended up travelling separately on tour and staying in separate hotels. It all came to a head in early 1973, when Don announced that their shows at Knotts Berry Farm would be their last, as he was tired of being an Everly brother. For the first of the two shows they were booked for, Don turned up drunk. After a few songs, Phil walked off stage, smashing his guitar. For the second show, Don turned up alone, and when someone in the crowd shouted \"Where's Phil?\" He replied \"The Everly Brothers died ten years ago\".\n\nBoth of them had attempts at solo careers for a decade, during which time the only time they saw each other was reportedly at their father's funeral. They both had minor points of success -- an appearance on a film soundtrack here, a backing vocal on a hit record there -- but no chart success, until in 1983 Phil had a UK top ten hit with a duet with Cliff Richard, \"She Means Nothing to Me\":\n\n[Excerpt: Phil Everly and Cliff Richard, \"She Means Nothing to Me\"]\n\nBut by this point, the brothers had reconciled, at least to an extent. They would never be close, but they'd regained enough of a relationship to work together, and they came together for a reunion show at the Royal Albert Hall, with a great band led by the country guitarist Albert Lee. That show was followed by a new album, produced by Dave Edmunds and featuring a lead-off single written for the brothers by Paul McCartney, \"On the Wings of a Nightingale\":\n\n[Excerpt: The Everly Brothers, \"On the Wings of a Nightingale\"]\n\nOver the next twenty-two years, the brothers would record a couple more studio albums, and would frequently guest on records by other people, including performing backing vocals on Paul Simon's \"Graceland\", from his massively successful album of the same name:\n\n[Excerpt: Paul Simon, \"Graceland\"]\n\nIt was also Simon who enticed them into what turned out to be their final reunion, in 2004, after a period of a few years where once again the brothers hadn't worked together. Simon had a similarly rocky relationship with his own duet partner Art Garfunkel, and when Simon and Garfunkel did their first tour together in over twenty years, they invited the Everly Brothers to tour with them as guests, doing a short slot by themselves and joining Simon and Garfunkel to perform \"Bye Bye Love\" together:\n\n[Excerpt: The Everly Brothers and Simon & Garfunkel, \"Bye Bye Love\"]\n\nThe year after that, they did what was to be their final tour, and I was lucky enough to see one of those shows myself. More than fifty years after they started performing together, they still sounded astonishing, and while they were apparently once again not on speaking terms offstage, you would never have known it from their effortless blend on stage, the kind of close harmony that you can only get when you know someone else's voice as well as your own.\n\nAfter that tour, Phil Everly's health put an end to the Everly Brothers -- he died in 2014 from COPD, a lung disease brought on by his smoking, and for many years before that he had to use an oxygen tank at all times. That wasn't an end to Everly infighting though -- the most recent court date in the ongoing lawsuit between Phil's estate and Don over the credit for \"Cathy's Clown\" was only last month.\n\nBut even though their relationship was fraught, they were still brothers, and Don has talked movingly of how he speaks every day to the portion of Phil's ashes that he has in his house. The bonds that held them together were the same things that drove them apart, but Don knows that no matter how much longer he lives, he will always be one of the Everly Brothers.",
  "itunes:subtitle": "Episode eighty-eight of A History of Rock Music in Five Hundred Songs looks at Cathys Clown by The Everly Brothers, and at how after signing the biggest contract in music business history their career was sabotaged by their manager. Click the full post t",
  "itunes:keywords": "Acuff-Rose publishing,Bill Porter,Cadence Records,Carole King,Cliff Richard,country and western,Disney,Don Everly,Elton John,Felice and Boudleaux Bryant,Ferde Grofe,Glen Campbell,Ike Everly,lawsuits,Lenny Waronker,Nashville,Paul McCartney,Paul Simon,Paul Whiteman,Phil Everly,Roy Orbison,Simon and Garfunkel,Sonny Curtis,the Crickets,The Everly Brothers,The Hollies,Van Dyke Parks,Warner Brothers,Wesley Rose",
  "itunes:episodeType": "full",
  "itunes:episode": 88,
  "content:encoded": "Episode eighty-eight of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Cathy's Clown\" by The Everly Brothers, and at how after signing the biggest contract in music business history their career was sabotaged by their manager. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/38878865\">\"Poetry in Motion\" by Johnny Tillotson</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-88-cathys-clown/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are no first-rate biographies of the Everly Brothers in print, at least in English (apparently there's a decent one in French, but I don't speak French well enough for that). <a href=\"https://amzn.to/2CvoMSj\"><em>Ike's Boys</em> by Phyllis Karp</a> is the only full-length bio,  and I relied on that in the absence of anything else, but it's been out of print for nearly thirty years, and is not worth the exorbitant price it goes for second-hand.\n\n<a href=\"http://www.hillmanweb.com/everly/refs/\">The Everlypedia</a> is a series of PDFs containing articles on anything related to the Everly Brothers, in alphabetical order.\n\n<a href=\"https://amzn.to/2YPxG9g\">This collection</a> has all the Everlys' recordings up to the end of 1962.  I would also recommend <a href=\"https://amzn.to/3dSjVem\">this recently-released box set</a> containing expanded versions of their three last studio albums for Warners, including <em>Roots</em>, which I discuss in the episode.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nThis week we're going to look at the Everly Brothers' first and biggest hit of the sixties, a song that established them as hit songwriters in their own right, which was more personal than anything they'd released earlier, and which was a big enough hit that it saved what was to become a major record label. We're going to look at \"Cathy's Clown\":\n\n[Excerpt: The Everly Brothers, \"Cathy's Clown\"]\n\nWhen we left the Everly Brothers, six months ago, we had seen them have their first chart hits and record the classic album Songs Our Daddy Taught Us, an album that prefigured by several years the later sixties folk music revival, and which is better than much of the music that came out of that later scene. Both artistically and commercially, they were as successful as any artists of the early rock era. But Don Everly, in particular, wanted them to have more artistic control themselves -- and if they could move to a bigger label as well, that was all the better.\n\nBut as it happens, they didn't move to a bigger label, just a richer one.\n\nWarner Brothers Records had started in 1958, and had largely started because of changes in the film industry. In the late 1940s and early fifties, the film industry was being hit on all sides. Anti-trust legislation meant that the film studios had to get rid of the cinema chains they owned, losing a massive revenue stream (and also losing the opportunity to ensure that their films got shown no matter how poor their reputation). A series of lawsuits from actors had largely destroyed the star system on which the major studios relied, and then television became a huge factor in the entertainment industry, cutting further into the film studios' profits.\n\nAn aside about that -- one of the big reasons for the growth of television as America's dominant entertainment medium is racism. In the thirties and forties, there had been huge waves of black people moving from rural areas to the cities in search of work, and we've looked at that and the way that led to the creation of rhythm and blues in many of the previous episodes. After World War II there was a corresponding period of white flight, where white people moved en masse away from the big cities and into small towns and suburbs, to get away from black people. This is largely what led to America's car culture and general lack of public transport, because low-population-density areas aren't as easy to serve with reliable public transport. And in the same way it's also uneconomical to run mass entertainment venues like theatres and cinemas in low-population-density areas, and going to the cinema becomes much less enticing if you have to drive twenty miles to get to one, rather than walking down the street.\n\nSo white flight had essentially meant the start of a process by which entertainment in America moved from the public sphere to the private one. This is also a big reason for the boom in record sales in the middle decades of last century -- records are private entertainment, as opposed to going out to a dance or a show.\n\nAnd this left the big film studios in dire straits. But while they were down on their luck when it came to films, Warners were doing very well in the music publishing business, where unlike their ownership of cinemas they didn't have to get rid of their properties. Warners had always owned the songs used in their films, and indeed one of the reasons that Looney Tunes and Merrie Melodies existed in the first place was so that they could plug songs that Warners owned. When Tex Avery has Owl Jolson singing \"I Love to Singa\":\n\n[Excerpt: “Owl Jolson”, \"I Love to Singa\"]\n\nThat's a song that had originally appeared in a Warners feature film a few months earlier, sung by Al Jolson and Cab Calloway:\n\n[Excerpt: Al Jolson and Cab Calloway, \"I Love to Singa\"]\n\nSo Warners were making money from the music industry. But then they realised something. Tab Hunter, one of their film stars under contract to them, had started to have hit records. His record \"Young Love\" spent six weeks at number one:\n\n[Excerpt: Tab Hunter, \"Young Love\"]\n\nAnd whenever he was interviewed to promote a film, all the interviewers would ask about was his music career. That was bad enough -- after all, he wasn't signed to Warners as a singer, he was meant to be a film star -- but what was worse was that the label Hunter was on, Dot Records, was owned by a rival film studio, Paramount. Warners would go to all the trouble of getting an interview set up for their star, and then all it would do was put money into Paramount's pocket!\n\nThey needed to get into the record business themselves, as a way to exploit their song catalogue if nothing else. At first they thought about just buying Imperial Records, but when that deal fell through they started their own label, and signed Hunter to it right at the point that his career nosedived.\n\nIn the first two years that Warner Brothers Records existed, they only had two hit singles -- \"Kookie Kookie Lend Me Your Comb\", a record based on the Warner-owned TV series 77 Sunset Strip and co-performed by one of that series' stars, Edd Byrnes:\n\n[Excerpt: Edd Byrnes and Connie Stevens, \"Kookie Kookie Lend Me Your Comb\"]\n\nAnd another record by Connie Stevens, who also sang on \"Kookie Kookie Lend Me Your Comb\", and was the star of a different Warners TV series, Hawaiian Eye:\n\n[Excerpt: Connie Stevens, \"Sixteen Reasons\"]\n\nEverything else they released flopped badly. After two years they had lost three million dollars, and would have closed down the label altogether, except the label was owed another two million, and they didn't want to write that off.\n\nThe main reason for these losses was that the label was mostly releasing stuff aimed at the easy listening adult album market, records by people like Henry Mancini, and at the time the singles market was where the money was, and the singles market was dominated by young people. They needed some records that would appeal to young people.\n\nThey decided that they needed the Everly Brothers. At the beginning of 1960, the duo had released ten singles since May 1957, of which nine had charted, as had four of the B-sides. They'd topped the pop charts twice, the R&B charts twice, and the country charts four times. At a time when even the biggest stars would occasionally release the odd flop, they were as close to a guaranteed hit-making machine as existed in the music industry. And they were looking to get away from Cadence Records, for reasons that have never been made completely clear. It's usually said that they had artistic differences with Cadence, but at the same time they always credited Archie Bleyer from Cadence with being the perfect arranger for them -- he arranged their final Cadence single, \"Let it Be Me\":\n\n[Excerpt: The Everly Brothers, \"Let it Be Me\"]\n\nBut for whatever reason, the Everlys *were* looking to find a new label, and Warner Brothers were desperate enough that they signed them up to the biggest contract ever signed in music business history up to that point. Remember that four years earlier, when Elvis had signed with RCA records, they'd paid a one-off fee of forty thousand dollars and *that* was reportedly the largest advance ever paid in the industry up until that point. Now, the Everlys were signing to Warners on a ten-year contract, with a guaranteed advance of one hundred thousand dollars a year for those ten years -- the first million-dollar contract in music history. They were set up until 1970, and were sure to provide Warners with a string of hits that would last out the decade -- or so it seemed at first.\n\nTheir first recording for the label had an unusual melodic inspiration. Ferde Grofé was an arranger and orchestrator for Paul Whiteman's jazz band in the 1920s and thirties. He's particularly known these days for having been the original arranger of Gershwin's \"Rhapsody in Blue\" -- Gershwin had written it for two pianos, and it was Grofé who had come up with the instrumental colouring that these days we think of as being so important to that piece:\n\n[Excerpt: Paul Whiteman \"Rhapsody in Blue (original 1924 recording)\"]\n\nGrofé had written a piece in 1931 called the \"Grand Canyon Suite\", and its third movement, \"On the Trail\" had become the most popular piece of music he ever wrote. Disney made an Oscar-winning short with the suite as its soundtrack in 1958, and you can still hear \"On the Trail\" to this day in the Grand Canyon section of the Disneyland Railroad. But \"On the Trail\" was best known as the music that Phillip Morris used in their radio and TV commercials from the thirties through to the sixties. Here's a bit from the original Whiteman recording of the piece:\n\n[Excerpt: Paul Whiteman, \"Grand Canyon Suite: On the Trail\"]\n\nDon took that melodic inspiration, and combined it with two sources of lyrical inspiration -- when his dad had been a child, he'd had a crush on a girl named Mary, who hadn't been interested, and his schoolfriends had taunted him by singing \"Mary had a little Ike\" at him. The other key to the song came when Don started thinking about an old crush of his own, a girl from his school called Catherine Coe -- though in later years he was at pains to point out that the song wasn't actually about her.\n\nThey took the resulting song into the studio with the normal members of the Nashville A-Team, and it became only their second hit single with an A-side written by one of the brothers, reaching number one on both the pop and R&B charts:\n\n[Excerpt: The Everly Brothers, \"Cathy's Clown\"]\n\nI say it's written by Don -- the original issue of the record credited the songwriting to both Don and Phil, but Phil signed an agreement in 1980 relinquishing his claim to the song, and his name was taken off all future copies. It sounds to me like Don's writing style, and all the anecdotes about its writing talk about him without mentioning any input from Phil, so I'm assuming for these purposes that it's a Don solo composition.\n\nListening to the record, which was the first that the duo produced for themselves, as well as being their first for Warners, you can hear why Don was at times dissatisfied with the songs that Felice and Boudleaux Bryant had written for the brothers. It's a sophisticated piece of work in a number of different ways. For a start, there's the way the music mirrors the lyric on the first line. That line is about separation -- \"Don't want your love any more\" -- and the brothers start the line in unison, but Don's voice slowly drops relative to Phil's, so by the end of the line they're a third apart. It's like he's stepping away:\n\n[Excerpt: The Everly Brothers, \"Cathy's Clown\"]\n\nThe song's structure also seems unusual. Wikipedia says it has a chorus and a bridge but no verse, while the Library of Congress disagrees and says it has a verse and a bridge but no chorus.\n\nPersonally, I'd say that it definitely does have a chorus -- the repeated section with the same words and melody each time it's repeated, with both brothers singing, and with the title of the song at the end, seems as definitively a chorus as one could possibly ask for:\n\n[Excerpt: The Everly Brothers, \"Cathy's Clown\"]\n\nIf that's not a chorus, I'm honestly not sure what is.\n\nThe reason this comes into question is the other section. I would call that section a verse, and I think most people would, and the song's structure is a straightforward A-B-A-B repetition which one would normally call verse/chorus. But it's such a change of pace that it feels like the contrasting section that normally comes with a bridge or middle eight. Indeed the first time I properly learned what a middle eight was -- in a column in Mojo magazine in the mid-nineties called Doctor Rock which explained some basic musicology -- it was specifically cited as an example of one:\n\n[Excerpt: The Everly Brothers, \"Cathy's Clown\"]\n\nPart of the reason that seems so different is that Don's singing it solo, while the brothers are duetting on the choruses, and normally Don's solo lines would be on a bridge or middle eight. Not always, but often enough that that's what you expect if you've listened to a few of their records. But there's also a change in rhythm.\n\nOne of the things you'll notice as we go further into the sixties is that, for a while in the early sixties, the groove in rock and roll -- and also in soul -- moved away from the swinging, shuffling rhythm you get in most of the fifties music we've looked at into a far more straightforward four-four rhythm. In roughly 1961 through 64 or so, you have things like the bam-bam-bam-bam four-on-the-floor beat of early Motown or Four Seasons records, or the chugga-chugga-chugga rhythm of surf guitar, rather than the looser, triplet-based grooves that you'd get in the fifties. And you can hear in \"Cathy's Clown\" the shift in those rhythms happening in the song itself. The verses have an almost Latin feel, with lots of loose cymbal work from Buddy Harman:\n\n[Excerpt: The Everly Brothers, \"Cathy's Clown\"]\n\nWhile the choruses have an almost martial feel to them, a boom-BAP rhythm, and sound like they have two drummers on them:\n\n[Excerpt: The Everly Brothers, \"Cathy's Clown\"]\n\nWhile I say that sounds like there are two drummers, it's still just Harman playing. The difference is that here the engineer, Bill Porter, who was the engineer on a lot of the Nashville recordings we've looked at, notably the Roy Orbison ones, had just obtained a new device -- a tape loop. Now, I've seen some people misunderstand what it was that Porter did with this -- thinking he looped the drums in the way one would loop things today, just playing the same recording over and over. It wasn't that. Rather it was a way of doing what Sam Phillips had been doing with tape echo in Sun a few years earlier -- there would be an endlessly circulating loop of tape, which had both record and playback heads. The drums would be recorded normally, but would also be recorded onto that tape loop, and then when it played back a few milliseconds later it would sound like a second drummer playing along with the first. It's an almost inaudible delay, but it's enough to give a totally different sound to the drums.\n\nPorter would physically switch this loop on and off while recording the track live -- all the vocals and instruments were recorded live together, onto a three-track tape, and he would turn it on for the choruses and off for the verses. This is an early example of the kind of studio experimentation that would define the way records were made in the sixties.\n\nThe rhythm that Harman played was also very influential -- you can hear that it strongly influenced Paul McCartney if you listen to Beatles records like \"What You're Doing\", \"Ticket to Ride\", and \"Tomorrow Never Knows\", all of which have drum patterns which were suggested by McCartney, and all of which are strongly reminiscent of the \"Cathy's Clown\" chorus.\n\n\"Cathy's Clown\" topped the charts for five weeks, and sold two million copies. It was an immense success, and the Everlys seemed to be on top of the world. But it was precisely then that problems started for the duo.\n\nFirst, they moved from Nashville to LA. The main reason for that was that as well as being a record contract, their new contract with Warners would give them the opportunity to appear in films, too. So they spent six months taking acting lessons and doing screen tests, before concluding that neither of them could actually act or remember their lines, and wisely decided that they were going to stick to music.\n\nThe one good thing they took from that six month period was that they rekindled their friendship with the Crickets, and Sonny Curtis wrote them a song called \"Walk Right Back\", which made the top ten (and number one in the UK and New Zealand):\n\n[Excerpt: The Everly Brothers, \"Walk Right Back\"]\n\nCurtis wrote that song while he was in basic training for the military, and when he got a pass for a few days he'd only written the first verse. He played the song to the brothers while he was out on his pass, and they said they liked it. He told them he'd write a second verse and send it to them, but by the time they received his letter with the lyrics for the second verse, they'd already recorded the song, just repeating the first verse.\n\nCurtis wasn't the only one who had to go into basic military training. The brothers, too, knew they would be drafted sooner rather than later, and so they decided to do as several other acts we've discussed did, and sign up voluntarily for six months rather than be drafted for two years. Before they did so, they recorded another song, \"Temptation\", an old standard from the thirties:\n\n[Excerpt: The Everly Brothers, \"Temptation\"]\n\nAnd that track marked the beginning of the end of the Everlys as a chart act. Because it was an old standard, the publishing was not owned by Acuff-Rose, and Wesley Rose was furious. He was both their manager and the owner of Acuff-Rose, the biggest publishing company in country music, and things between them had already become strained when the Everlys had moved to California while Rose had stayed in Nashville. Rose insisted that they only release Acuff-Rose songs as singles, and they refused, saying they wanted to put the single out.\n\nRose retaliated in the most staggeringly petty manner imaginable. He stopped managing them, and he blocked them from being sent any new songs by Felice and Boudleaux Bryant. Because he knew they'd already recorded \"Love Hurts\", a song written by the Bryants, as an album track, he got Roy Orbison, who he also managed, to record a version and put it out as a B-side, as a spoiler in case the Everlys tried to release their version as a single:\n\n[Excerpt: Roy Orbison, \"Love Hurts\"]\n\nWorse than that, even, the Everlys were also signed to Acuff-Rose as songwriters, which meant that they were no longer allowed to record their own songs. For a while they tried writing under pseudonyms, but then Acuff-Rose found out about that and stopped them.\n\nFor a while, even after basically taking a year away from music and being banned from recording their own songs, the brothers continued having hits. They also started another project -- their own record label, Calliope, which would put out their outside projects. For Don, this was a mostly-instrumental adaptation of Elgar's \"Pomp and Circumstance\", which he recorded with an arrangement by Neal Hefti, under the name \"Adrian Kimberly\":\n\n[Excerpt: Adrian Kimberly, \"Pomp and Circumstance\"]\n\nThat made the lower reaches of the US charts, but was banned by the BBC in Britain, because it would offend British patriotic sentiment (for those who don't know, \"Pomp and Circumstance\", under the name \"Land of Hope and Glory\", is something of a second national anthem over here).\n\nPhil's side project was a comedy folk group, the Keestone Family Singers, who recorded a parody of the Kingston Trio's \"Raspberries, Strawberries\", written by Glen Hardin of the Crickets:\n\n[Excerpt: The Keestone Family Singers, \"Cornbread and Chitlings\"]\n\nThe other two singers on that track were people we're going to hear a lot from in later episodes -- a songwriter called Carole King, who a few months later would co-write the Everlys hit \"Crying in the Rain\", and a session guitarist named Glen Campbell.\n\nBut neither of these ventures were particularly successful, and they concentrated on their own records. For a while, they continued having hits. But having no access to the Bryants' songs, and being unable to record the songs they were writing themselves, they relied more and more on cover versions, right at the point the market was starting to change to being based entirely around artists who wrote their own material.\n\nAnd on top of that, there were personal problems -- Don was going through a divorce, and before they were inducted into the Marines, both Don and Phil had started seeing a doctor who gave them what they were told were \"vitamin shots\" to help them keep their energy up, but were actually amphetamines. Both became addicted, and while Phil managed to kick his addiction quickly, Don became incapacitated by his, collapsing on a UK tour and being hospitalised with what was reported as \"food poisoning\", as most overdoses by rock musicians were in the early sixties, leaving Phil to perform on his own while Don recuperated.\n\nTheir fall in popularity after \"Temptation\" was precipitous. Between 1957 and early 1961 they had consistently had massive hits. After \"Temptation\" they had three more top thirty hits, \"Don't Blame Me\", \"Crying in the Rain\", and \"That's Old Fashioned\". They continued having regular hits in the UK through 1965, but after \"That's Old Fashioned\" in early 1962 their US chart positions went seventy-six, forty-eight, a hundred and seven, a hundred and one, didn't chart at all, a hundred and thirty-three... you get the idea. They only had two more top forty hits in the US in the rest of their career -- \"Gone Gone Gone\" in 1964, which made number thirty-one, and \"Bowling Green\" in 1967 which made number forty.\n\nEventually they got the ability to record their own material again, and also to record songs by the Bryants, but the enforced period of several years of relying on cover versions and old standards had left them dead as a commercial act.\n\nBut surprisingly, they weren't artistically dead. They did have a slump around the time of Don's troubles, with a series of weak albums, but by 1965 they'd started making some very strong tracks, covering a stylistic range from soul to country to baroque pop to an entire album, Two Yanks in England, of covers of British songs, backed by the Hollies (who wrote eight of the twelve songs) and a young keyboard player named Reg Dwight, who would later change his name to Elton John:\n\n[Excerpt: The Everly Brothers, \"Somebody Help Me\"]\n\nIn the middle of this commercial slump came their second album-length masterpiece, \"Roots\", an album that, like their earlier \"Songs Our Daddy Taught Us\", looked back to the music they'd grown up on., while also looking forward to the future, mixing new songs by contemporary writers like Merle Haggard and Randy Newman with older folk and country songs:\n\n[Excerpt: The Everly Brothers, \"Illinois\"]\n\nIt stands with the great marriages of Americana, orchestral pop, and psychedelia from around that time, like Randy Newman's first album and Van Dyke Parks' Song Cycle, and has many of the same people involved, including producer Lenny Waronker and keyboard player Van Dyke Parks. It's conceived as a complete piece, with songs fading in and out to excerpts of the Everlys' performances on the radio with their parents as children, and it's quite, quite, lovely. And, like those other albums, it was a complete commercial flop.\n\nThe brothers continued working together for several more years, recording a live album to finish off their ten-year Warners contract, and then switching to RCA, where they recorded a couple of albums of rootsy country-rock in the style of artists they had influenced like Crosby, Stills, Nash and Young. But nothing happened for them commercially, and they were getting less and less happy with working together.\n\nThe two men argued about literally everything, from who was their father's real favourite to politics -- Phil was an intensely conservative Republican while Don is a liberal Democrat. They ended up travelling separately on tour and staying in separate hotels. It all came to a head in early 1973, when Don announced that their shows at Knotts Berry Farm would be their last, as he was tired of being an Everly brother. For the first of the two shows they were booked for, Don turned up drunk. After a few songs, Phil walked off stage, smashing his guitar. For the second show, Don turned up alone, and when someone in the crowd shouted \"Where's Phil?\" He replied \"The Everly Brothers died ten years ago\".\n\nBoth of them had attempts at solo careers for a decade, during which time the only time they saw each other was reportedly at their father's funeral. They both had minor points of success -- an appearance on a film soundtrack here, a backing vocal on a hit record there -- but no chart success, until in 1983 Phil had a UK top ten hit with a duet with Cliff Richard, \"She Means Nothing to Me\":\n\n[Excerpt: Phil Everly and Cliff Richard, \"She Means Nothing to Me\"]\n\nBut by this point, the brothers had reconciled, at least to an extent. They would never be close, but they'd regained enough of a relationship to work together, and they came together for a reunion show at the Royal Albert Hall, with a great band led by the country guitarist Albert Lee. That show was followed by a new album, produced by Dave Edmunds and featuring a lead-off single written for the brothers by Paul McCartney, \"On the Wings of a Nightingale\":\n\n[Excerpt: The Everly Brothers, \"On the Wings of a Nightingale\"]\n\nOver the next twenty-two years, the brothers would record a couple more studio albums, and would frequently guest on records by other people, including performing backing vocals on Paul Simon's \"Graceland\", from his massively successful album of the same name:\n\n[Excerpt: Paul Simon, \"Graceland\"]\n\nIt was also Simon who enticed them into what turned out to be their final reunion, in 2004, after a period of a few years where once again the brothers hadn't worked together. Simon had a similarly rocky relationship with his own duet partner Art Garfunkel, and when Simon and Garfunkel did their first tour together in over twenty years, they invited the Everly Brothers to tour with them as guests, doing a short slot by themselves and joining Simon and Garfunkel to perform \"Bye Bye Love\" together:\n\n[Excerpt: The Everly Brothers and Simon & Garfunkel, \"Bye Bye Love\"]\n\nThe year after that, they did what was to be their final tour, and I was lucky enough to see one of those shows myself. More than fifty years after they started performing together, they still sounded astonishing, and while they were apparently once again not on speaking terms offstage, you would never have known it from their effortless blend on stage, the kind of close harmony that you can only get when you know someone else's voice as well as your own.\n\nAfter that tour, Phil Everly's health put an end to the Everly Brothers -- he died in 2014 from COPD, a lung disease brought on by his smoking, and for many years before that he had to use an oxygen tank at all times. That wasn't an end to Everly infighting though -- the most recent court date in the ongoing lawsuit between Phil's estate and Don over the credit for \"Cathy's Clown\" was only last month.\n\nBut even though their relationship was fraught, they were still brothers, and Don has talked movingly of how he speaks every day to the portion of Phil's ashes that he has in his house. The bonds that held them together were the same things that drove them apart, but Don knows that no matter how much longer he lives, he will always be one of the Everly Brothers.",
  "enclosure": "",
  "itunes:summary": "Episode eighty-eight of A History of Rock Music in Five Hundred Songs looks at \"Cathy's Clown\" by The Everly Brothers, and at how after signing the biggest contract in music business history their career was sabotaged by their manager. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Poetry in Motion\" by Johnny Tillotson.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are no first-rate biographies of the Everly Brothers in print, at least in English (apparently there's a decent one in French, but I don't speak French well enough for that). Ike's Boys by Phyllis Karp is the only full-length bio,  and I relied on that in the absence of anything else, but it's been out of print for nearly thirty years, and is not worth the exorbitant price it goes for second-hand.\n\nThe Everlypedia is a series of PDFs containing articles on anything related to the Everly Brothers, in alphabetical order.\n\nThis collection has all the Everlys' recordings up to the end of 1962.  I would also recommend this recently-released box set containing expanded versions of their three last studio albums for Warners, including Roots, which I discuss in the episode.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nThis week we're going to look at the Everly Brothers' first and biggest hit of the sixties, a song that established them as hit songwriters in their own right, which was more personal than anything they'd released earlier, and which was a big enough hit that it saved what was to become a major record label. We're going to look at \"Cathy's Clown\":\n\n[Excerpt: The Everly Brothers, \"Cathy's Clown\"]\n\nWhen we left the Everly Brothers, six months ago, we had seen them have their first chart hits and record the classic album Songs Our Daddy Taught Us, an album that prefigured by several years the later sixties folk music revival, and which is better than much of the music that came out of that later scene. Both artistically and commercially, they were as successful as any artists of the early rock era. But Don Everly, in particular, wanted them to have more artistic control themselves -- and if they could move to a bigger label as well, that was all the better.\n\nBut as it happens, they didn't move to a bigger label, just a richer one.\n\nWarner Brothers Records had started in 1958, and had largely started because of changes in the film industry. In the late 1940s and early fifties, the film industry was being hit on all sides. Anti-trust legislation meant that the film studios had to get rid of the cinema chains they owned, losing a massive revenue stream (and also losing the opportunity to ensure that their films got shown no matter how poor their reputation). A series of lawsuits from actors had largely destroyed the star system on which the major studios relied, and then television became a huge factor in the entertainment industry, cutting further into the film studios' profits.\n\nAn aside about that -- one of the big reasons for the growth of television as America's dominant entertainment medium is racism. In the thirties and forties, there had been huge waves of black people moving from rural areas to the cities in search of work, and we've looked at that and the way that led to the creation of rhythm and blues in many of the previous episodes. After World War II there was a corresponding period of white flight, where white people moved en masse away from the big cities and into small towns and suburbs, to get away from black people. This is largely what led to America's car culture and general lack of public transport, because low-population-density areas aren't as easy to serve with reliable public transport. And in the same way it's also uneconomical to run mass entertainment venues like th",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode eighty-eight of A History of Rock Music in Five Hundred Songs looks at \"Cathy's Clown\" by The Everly Brothers, and at how after signing the biggest contract in music business history their career was sabotaged by their manager. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Poetry in Motion\" by Johnny Tillotson.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are no first-rate biographies of the Everly Brothers in print, at least in English (apparently there's a decent one in French, but I don't speak French well enough for that). Ike's Boys by Phyllis Karp is the only full-length bio,  and I relied on that in the absence of anything else, but it's been out of print for nearly thirty years, and is not worth the exorbitant price it goes for second-hand.\n\nThe Everlypedia is a seri",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}