{
  "id": "tag:blogger.com,1999:blog-2957813557601703695.post-7356074779639930806",
  "published": "2022-10-19T13:42:00.001+05:00",
  "updated": "2022-10-19T13:42:17.643+05:00",
  "category": [
    "",
    "",
    ""
  ],
  "title": "Mobilink Microfinance Bank Limited (MMBL) partners with TPS to boost its Business Agility and Digital Readiness",
  "content": "<p>Mobilink Microfinance Bank Limited (MMBL) partners with TPS to boost its Business Agility and Digital Readiness</p><p>&nbsp;</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgg4RV75Ug5uUMtfzXO9ZiXdF1ft_2qmJx5BxLkRi02Tq1oQAsqz8pAMvIKYMQfJoXYJc7eaVjgJzvUQ9_WVprmIQ4xpi4eCEnZ-4XZAeuKD5tKec3zmf9Uin9SntG4PU0xAADudzI_qxkQRMyBp3elSswjxsAH1zWmwAcrzE2vr1ze2cyp45BYQ0K-Vw/s2918/MMBL%20&amp;%20TPS%20Partnership%20_%20Photo.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"Mobilink Microfinance Bank Limited (MMBL) partners with TPS to boost its Business Agility and Digital Readiness\" border=\"0\" data-original-height=\"1509\" data-original-width=\"2918\" height=\"330\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgg4RV75Ug5uUMtfzXO9ZiXdF1ft_2qmJx5BxLkRi02Tq1oQAsqz8pAMvIKYMQfJoXYJc7eaVjgJzvUQ9_WVprmIQ4xpi4eCEnZ-4XZAeuKD5tKec3zmf9Uin9SntG4PU0xAADudzI_qxkQRMyBp3elSswjxsAH1zWmwAcrzE2vr1ze2cyp45BYQ0K-Vw/w640-h330/MMBL%20&amp;%20TPS%20Partnership%20_%20Photo.jpg\" width=\"640\" /></a></div><br /><p></p><p>Islamabad : Pakistan’s largest digital bank, Mobilink Microfinance Bank Limited (MMBL) has signed a strategic partnership with renowned global banking solution provider, TPS for the induction of its ground-breaking and all-encompassing digital banking suite to boost business agility and digital readiness. Through this partnership, MMBL is dedicated to transforming its digital payments infrastructure while increasing its efforts toward bringing the unbanked and underbanked into the fold of financial inclusion.</p><p>&nbsp;</p><p>Mobilink Microfinance Bank is part of the VEON group, a global digital operator that provides converged connectivity and online services across seven countries. As part of its digital operator strategy, VEON is transforming people’s lives, creating opportunities for greater digital inclusion, and driving economic growth across countries that are home to more than 8% of the world’s population.</p><p>&nbsp;</p><p>President and CEO MMBL, Ghazanfar Azzam, and Group CEO TPS, Shahzad Shahid signed the partnership agreement at MMBL Headquarters in Islamabad in the presence of senior management from both organizations. The partnership will further MMBL’s ambition to enhance its digital infrastructure to meet the evolving banking and financial needs of its individual as well as enterprise customers by offering them an array of digital banking solutions including real-time fund transfers, fast and secure login, contactless payments, bulk disbursements, service requests, ATM/branch locator and many more.</p><p>&nbsp;</p><p>Under the agreement, TPS, a leading banking solutions provider across 30+ countries in Asia and Africa, will provide MMBL with a state-of-the-art digital banking suite to enable the integration of multiple channels on a single platform. The suite will work as an open Application Programming Interface (API) gateway that will host various banking and payment platforms and serve as a high-speed channel and transaction processing engine to provide an integrated and seamless customer experience.</p><p>&nbsp;</p><p>Speaking on the occasion, President and CEO, MMBL, Ghazanfar Azzam said: “Digital technology is transforming to foster greater ease and convenience for its users. Given the centrality of technology to growth and progress, MMBL is keen to stay abreast with this fast-paced transformation to be able to deliver a top-notch user experience to our customers. Our partnership with TPS is an extension of the same commitment where we are looking to integrate the industry's best solutions into our system to further improve our customers’ banking experience with us, besides accelerating our drive to promote financial inclusion in the country.”</p><p>&nbsp;</p><p>Also sharing his thoughts, Group CEO, TPS, Shahzad Shahid said: MMBL is amongst a few microfinance banks who are using both traditional and digital approaches for faster and sustainable growth. We feel privileged to be the technology partners of the Bank in many of its successful digital payment initiatives and this project of IRIS Digital Banking Platform will surely accelerate the bank’s progress towards more agility and digital responsiveness.\"&nbsp;</p><p>&nbsp;</p><p>MMBL is one of the country's leading proponents of digital banking and financial inclusion. Banking the unbanked people, especially women, is one of the foremost strategic priorities for the bank that has come to fruition in the form of several women-owned and led businesses nationwide. The Bank is dedicated to revolutionizing the digital banking ecosystem by creating an inclusive environment that offers fast, safe, and secure services for all its customers.</p><div><br /></div><div class=\"blogger-post-footer\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js\"></script>\n<!-- MobileAds -->\n<ins class=\"adsbygoogle\"\n     style=\"display:inline-block;width:320px;height:50px\"\n     data-ad-client=\"ca-pub-2762820915666464\"\n     data-ad-slot=\"9814557735\"></ins>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Admin",
    "uri": "https://www.blogger.com/profile/00179371387546033311",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}