{
  "title": "Interpretable Personalization via Policy Learning with Linear Decision Boundaries. (arXiv:2003.07545v4 [cs.LG] UPDATED)",
  "link": "http://arxiv.org/abs/2003.07545",
  "description": "<p>With the rise of the digital economy and an explosion of available\ninformation about consumers, effective personalization of goods and services\nhas become a core business focus for companies to improve revenues and maintain\na competitive edge. This paper studies the personalization problem through the\nlens of policy learning, where the goal is to learn a decision-making rule (a\npolicy) that maps from consumer and product characteristics (features) to\nrecommendations (actions) in order to optimize outcomes (rewards). We focus on\nusing available historical data for offline learning with unknown data\ncollection procedures, where a key challenge is the non-random assignment of\nrecommendations. Moreover, in many business and medical applications,\ninterpretability of a policy is essential. We study the class of policies with\nlinear decision boundaries to ensure interpretability, and propose learning\nalgorithms using tools from causal inference to address unbalanced treatments.\nWe study several optimization schemes to solve the associated non-convex,\nnon-smooth optimization problem, and find that a Bayesian optimization\nalgorithm is effective. We test our algorithm with extensive simulation studies\nand apply it to an anonymized online marketplace customer purchase dataset,\nwhere the learned policy outputs a personalized discount recommendation based\non customer and product features in order to maximize gross merchandise value\n(GMV) for sellers. Our learned policy improves upon the platform's baseline by\n88.2\\% in net sales revenue, while also providing informative insights on which\nfeatures are important for the decision-making process. Our findings suggest\nthat our proposed policy learning framework using tools from causal inference\nand Bayesian optimization provides a promising practical approach to\ninterpretable personalization across a wide range of applications.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Qu_Z/0/1/0/all/0/1\">Zhaonan Qu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Qian_I/0/1/0/all/0/1\">Isabella Qian</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhou_Z/0/1/0/all/0/1\">Zhengyuan Zhou</a>"
}