{
  "id": "tag:blogger.com,1999:blog-19803222.post-6643707234921867605",
  "published": "2017-03-08T08:34:00.001-07:00",
  "updated": "2017-03-08T08:47:01.249-07:00",
  "title": "Awesome people: Bonnie Dorr (IWD++)",
  "content": "To honor women this <a href=\"https://www.internationalwomensday.com/\">International Women's Day</a>, I have a several posts, broadly around the topic of women in STEM.<br /><br />This is the first, and the topic is \"who has been influential in my career and helped me get where I am?\" There are many such people, and any list will be woefully incomplete, but today I'm going to highlight <a href=\"https://www.ihmc.us/groups/bdorr/\">Bonnie Dorr</a> (who founded the <a href=\"https://wiki.umiacs.umd.edu/clip/index.php/Main_Page\">CLIP lab</a> together with <a href=\"http://www.umiacs.umd.edu/~weinberg/\">Amy Weinberg</a> and <a href=\"http://www.umiacs.umd.edu/users/louiqa/\">Louiqa Raschid</a>, and who also is a <a href=\"https://www.cs.umd.edu/article/2016/11/emerita-professor-bonnie-dorr-named-acl-fellow-2016\">recent fellow of the ACL</a>!).<br /><br /><a href=\"https://www.umiacs.umd.edu/people/bonnie\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"https://www.umiacs.umd.edu/sites/default/files/styles/medium/public/dorr.png?itok=BLPUBgrD\" /></a>For those who haven't had the chance to work with Bonnie, you're missing out. I don't know how she does it, but the depth and speed at which she interacts, works, produces ideas and gets things done is stunning. Before leaving for a program manager position at DARPA and then later to IHMC, Bonnie was full professor (and then associate dean) here at UMD. At DARPA she managed basically two PM's worth of projects, and was always excited about everything. During her time as a professor here at UMD (after earning her Ph.D. from MIT), Bonnie was an NSF Presidential Faculty Fellow, a Sloan Recipient, a recipient of the NSF Young Investigator Award, and a AAAI Fellow.<br /><br />I learned a lot from Bonnie. I first met her back when I was a graduate student and Daniel and I had a paper in the Document Understanding Conference (basically the summarization workshop of the day) on evaluation. It was closely related to something Bonnie had worked on previously, and I was really thrilled to get feedback from her. Fast forward six years and then I'm writing proposals with Bonnie, advising postdocs and students together, and otherwise trying to learn as much as possible by osmosis and direct instruction.<br /><br /><a href=\"http://www.cs.umd.edu/local-cgi-bin/csphotohistory/description.php?lname=Dorr&amp;fname=Bonnie%20J.&amp;Mainpic=bonniedorr.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" height=\"217\" src=\"https://www.cs.umd.edu/projects/photohistory/facultypictures_full/bonniedorr.jpg\" width=\"320\" /></a>One of the most important things I learned from Bonnie was: if you want it done, just do it. Bonnie is a do-er. This is reflected in her incredibly broad scientific contributions (summarization, machine translation, evaluation, etc.) as well as the impact she had on the department. It was clear almost immediately that the faculty here really respected Bonnie's opinion; her ability to move mountains was evident.<br /><br />On a more personal note, although she was not my official senior-faculty-mentor when I came to UMD, Bonnie was one of two senior faculty members here who really did everything she could to help me---both professionally and personally. Whenever I was on the fence about how to handle something, I knew that I could go to Bonnie and get her opinion and that her opinion would be well reasoned. I wouldn't always take it (sometimes to my own chagrin), but she was always ready with concrete advice about specific steps to take about almost any topic. I've also been on two very-large grant proposals with her (one successful and one not) which have both been incredible learning experiences. Getting a dozen faculty to work on a 30 page document is no easy task, and Bonnie's combination of just-do-it and lead-by-example is something I still try to mimic when I'm in a similar (if smaller) position. Even when she was at DARPA, as well as now, as professor emerita at UMD, she's still actively supporting both me and other faculty here, and clearly really cares that people at UMD are successful.<br /><br /><a href=\"http://www.cs.umd.edu/local-cgi-bin/csphotohistory/description.php?lname=Dorr&amp;fname=Bonnie%20J.&amp;Mainpic=bonniedorr.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"240\" src=\"https://www.umiacs.umd.edu/~bonnie/CLIP_In_Waikiki_2008-Take2.jpg\" width=\"320\" /></a>In addition to Bonnie's seriousness and excellence in research and professional life, I also really appreciated her more laid back side. When I visited UMD back before accepting a job here, she hosted a visit day dinner for prospective grad students at her house, which overlapped with one of her student's Ph.D. defense: hence, a combined party. To honor the student, Bonnie had written a rap, which she then performed with her son beatboxing. It was in that moment that I realized truly how amazing Bonnie is not just as a researcher but as a person. (Of course, she attacked this task with exactly the same high intensity that she attacks every other problem!)<br /><br />Overall, Bonnie is both one of the most amazing researchers I know, one of the strongest go-getters I know, and someone I've been extremely luck to have not just as a collaborator, but also a colleague and mentor.<br /><br />Thanks Bonnie! <br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "hal",
    "uri": "http://www.blogger.com/profile/02162908373916390369",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 1
}