{
  "title": "MSNBC Freaks Out About Elon Musk Buying Twitter",
  "itunes:title": "MSNBC Freaks Out About Elon Musk Buying Twitter",
  "pubDate": "Fri, 29 Apr 2022 04:49:43 +0000",
  "guid": "103c07e0-488d-4f26-9f5a-5116237b787a",
  "link": "https://thejimmydoreshow.libsyn.com/msnbc-freaks-out-about-elon-musk-buying-twitter",
  "itunes:image": "",
  "description": "<p>On a recent episode of her MSNBC show \"The ReidOut\" Joy-Ann Reid and guest Anand Giridiharadis expressed dismay at the prospect of an Elon Musk-owned Twitter and the thought that unsavories might be welcomed back on the platform just to make trouble for the \"regular\" people who typically interact there. Jimmy and guest Max Blumenthal discuss the freakout over Musk underway at a number of MSNBC shows.<br /> <br /> Plus a segment on candidate Nina Turner's excessive response to a critical tweet from Jimmy. <br /> <br /> Also featuring Stef Zamorano, Sabby Sabs and Mike MacRae! And phone calls from Chuck Schumer and Joe Biden!</p>",
  "content:encoded": "<p>On a recent episode of her MSNBC show \"The ReidOut\" Joy-Ann Reid and guest Anand Giridiharadis expressed dismay at the prospect of an Elon Musk-owned Twitter and the thought that unsavories might be welcomed back on the platform just to make trouble for the \"regular\" people who typically interact there. Jimmy and guest Max Blumenthal discuss the freakout over Musk underway at a number of MSNBC shows.  Plus a segment on candidate Nina Turner's excessive response to a critical tweet from Jimmy.   Also featuring Stef Zamorano, Sabby Sabs and Mike MacRae! And phone calls from Chuck Schumer and Joe Biden!</p>",
  "enclosure": "",
  "itunes:duration": "59:24",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "On a recent episode of her MSNBC show \"The ReidOut\" Joy-Ann Reid and guest Anand Giridiharadis expressed dismay at the prospect of an Elon Musk-owned Twitter and the thought that unsavories might be welcomed back on the platform just to make trouble...",
  "itunes:episodeType": "full",
  "itunes:summary": "On a recent episode of her MSNBC show \"The ReidOut\" Joy-Ann Reid and guest Anand Giridiharadis expressed dismay at the prospect of an Elon Musk-owned Twitter and the thought that unsavories might be welcomed back on the platform just to make trouble for the \"regular\" people who typically interact there. Jimmy and guest Max Blumenthal discuss the freakout over Musk underway at a number of MSNBC shows. Plus a segment on candidate Nina Turner's excessive response to a critical tweet from Jimmy.  Also featuring Stef Zamorano, Sabby Sabs and Mike MacRae! And phone calls from Chuck Schumer and Joe Biden!"
}