{
  "id": "yt:video:D46FzVyL9I8",
  "yt:videoId": "D46FzVyL9I8",
  "yt:channelId": "UCp3Q1Xhsu-TRljsDqp0Kj_A",
  "title": "Towards Robust Monocular Depth Estimation: Mixing Datasets for Zero-shot Cross-dataset Transfer",
  "link": "",
  "author": {
    "name": "ISL and Collaborators",
    "uri": "https://www.youtube.com/channel/UCp3Q1Xhsu-TRljsDqp0Kj_A"
  },
  "published": "2019-12-05T03:23:29+00:00",
  "updated": "2022-07-28T05:35:25+00:00",
  "media:group": {
    "media:title": "Towards Robust Monocular Depth Estimation: Mixing Datasets for Zero-shot Cross-dataset Transfer",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Towards Robust Monocular Depth Estimation: Mixing Datasets for Zero-shot Cross-dataset Transfer\nRené Ranftl, Katrin Lasinger, David Hafner, Konrad Schindler, and Vladlen Koltun\n\nPaper: https://arxiv.org/abs/1907.01341\nCode: https://github.com/intel-isl/MiDaS\n\nThe success of monocular depth estimation relies on large and diverse training sets. Due to the challenges associated with acquiring dense ground-truth depth across different environments at scale, a number of datasets with distinct characteristics and biases have emerged. We develop tools that enable mixing multiple datasets during training, even if their annotations are incompatible. In particular, we propose a robust training objective that is invariant to changes in depth range and scale, advocate the use of principled multi-objective learning to combine data from different sources, and highlight the importance of pretraining encoders on auxiliary tasks. Armed with these tools, we experiment with five diverse training datasets, including a new, massive data source: 3D films. To demonstrate the generalization power of our approach we use zero-shot cross-dataset transfer, i.e. we evaluate on datasets that were not seen during training. The experiments confirm that mixing data from complementary sources greatly improves monocular depth estimation. Our approach clearly outperforms competing methods across diverse datasets, setting a new state of the art for monocular depth estimation.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}