{
  "title": "546: How Will Jacob Remain a Vital Part of 'Fantastic Beasts'?",
  "link": "https://audioboom.com/posts/8014402",
  "itunes:episode": 546,
  "itunes:title": "How Will Jacob Remain a Vital Part of 'Fantastic Beasts'?",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4868,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>With just three months to go until the release of<em> Secrets of Dumbledore</em>, we continue our Fantastic Beasts character discussions with Jacob Kowalski!  The heart of the Fantastic Beasts series is a true, loyal friend and partner. But what does the future hold for him? Slipping on a strudel? Getting lost in Newt's suitcase? Don't miss our Top 10 Ways in Which Jacob Kowalski WILL DIE! And next week we explore the loving/semi-toxic relationship between Lily Potter and Severus Snape, so <a href=\"https://mugglecast.com/contact/\">send us your feedback</a>!<br>\n<br>\n\n</div>\n<ul>\n<li>Welcome Slug Club member, Roshni!</li>\n<li>Coming this October... the Illustrated Edition of Order of the Phoenix by Jim Kay!</li>\n<li>Did you buy your Harry Potter eBooks from Pottermore back in the day? Make sure you have your digital copies downloaded! <a href=\"https://www.theverge.com/2022/1/11/22877914/harry-potter-ebooks-pottermore-psa-january-31st\">Here's why</a>\n</li>\n<li>Fantastic Beasts Character Discussion: Jacob Kowalski</li>\n<li>If you missed our first deep dive on Jacob, <a href=\"https://mugglecast.com/episode-319-jacob/\">check out Episode 319</a>!</li>\n<li>How does Jacob humanize his fellow wizards?</li>\n<li>Why introduce a Muggle as one of the core four?</li>\n<li>Is Jacob the stereotypical fat, funny guy who is the comic relief of the series?</li>\n<li>What happened to Jacob between the first two films?</li>\n<li>Did Jacob's memory return too quickly?</li>\n<li>If Queenie and Jacob had gotten legitimately married in England and then moved back to America, would she have been put in jail? </li>\n<li>How does Newt's character and attitude change when Jacob is around?</li>\n<li>EVERYTHING is WRONG with Nicolas Flamel</li>\n<li>What do the hosts make of Jacob's reaction to Grindelwald's rally, especially his \"another war\" line?</li>\n<li>What does the future look like for Jacob? Will he be a sacrificial lamb? What does he bring to the table that the rest of the team will need in <em>Secrets of Dumbledore</em>?</li>\n<li>Top 10 Ways in Which Jacob Kowalski WILL DIE</li>\n<li>Quizzitch: What was the name of Jacob Kowalski’s former fiancee? <a href=\"https://mugglecast.com/quizzitch/\">Submit your answer</a>! </li>\n<li>This week's episode is brought to you by <a href=\"http://www.indeed.com/mugglecast\">Indeed</a> (get a $75 credit) and <a href=\"http://www.betterhelp.com/mugglecast\">BetterHelp</a> (get 10% off your first month)!</li>\n</ul>\n",
  "pubDate": "Tue, 18 Jan 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-01-17:/posts/8014402",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}