{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-866093949355095566",
  "published": "2020-05-12T08:00:00.000-07:00",
  "updated": "2020-05-12T08:04:59.179-07:00",
  "title": "YouTube Music is making it simple to transfer over your Google Play Music library",
  "content": "Over the past few years, we have enhanced YouTube Music to deliver a comprehensive listening experience, and have also added features to make Google Play Music users feel right at home. Starting today, we’re excited to officially begin inviting Google Play Music listeners to effortlessly transfer their music libraries, personal taste preferences and playlists to YouTube Music, their new home for music listening and discovery.   <br /><br />For now, users will continue to have access to both services. We want to ensure everyone has time to transfer their content and get used to YouTube Music, so we’ll provide plenty of notice ahead of users no longer having access to Google Play Music later this year. <br /><br /><h3>Easy transfer and transition  </h3><br />We know many listeners have spent a lot of time creating their perfect music and podcast libraries in Google Play Music, so we’ve made it simple to move both to their new homes. All Google Play Music users will soon receive an email with detailed instructions on how to begin transferring your full Google Play Music history and content, as well as podcasts, to their new homes.  <br /><br />Music fans will be able to start the transfer process of their music library to YouTube Music by following these simple steps: <br /><br /><br /><ul><li>Download the YouTube Music app (<a href=\"https://apps.apple.com/app/youtube-music/id1017492454\" target=\"_blank\">iOS</a>/<a href=\"https://play.google.com/store/apps/details?id=com.google.android.apps.youtube.music\" target=\"_blank\">Android</a>).</li></ul><ul><li>Click on the transfer button in YouTube Music, and your uploads, purchases, added songs and albums, personal and subscribed playlists, likes and dislikes, curated stations and personal taste preferences will move right over.</li></ul><ul><li>Your updated recommendations will appear immediately on the YouTube Music home screen, and we’ll notify you via email and notifications when your music library transfer is complete and your music is in the “Library” tab. </li></ul><br /><br />You can also check out the video with transfer details <a href=\"https://www.youtube.com/watch?v=IWIDd7WK_cU\" target=\"_blank\">HERE</a>. <br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-HCccPdlnvas/XroOJDfjHOI/AAAAAAAAAys/F-yXOU0zAC4vaUCqru4g8GoAPKS-IKVWQCLcBGAsYHQ/s1600/GPM_PhoneComposite_StepByStep_2560x1440_alt.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"900\" data-original-width=\"1600\" src=\"https://1.bp.blogspot.com/-HCccPdlnvas/XroOJDfjHOI/AAAAAAAAAys/F-yXOU0zAC4vaUCqru4g8GoAPKS-IKVWQCLcBGAsYHQ/s1600/GPM_PhoneComposite_StepByStep_2560x1440_alt.jpg\" /></a></div><br /><br />And if you’re a podcast listener, you can visit this <a href=\"https://podcasts.google.com/transfer\" target=\"_blank\">web page</a> and transfer your subscriptions and episode progress to Google Podcasts with a single click. Google Podcasts is our dedicated podcast player available for free on Android and iOS, and accessible from Google Assistant, Google Search, Google Home and more.  <br /><br />We’re looking forward to Google Play Music users transferring their libraries, so they can begin listening and exploring on YouTube Music and Google Podcasts.   <br /><br /><h3>Your New Home For Music: YouTube Music </h3><br />For listeners new to <a href=\"https://www.youtube.com/musicpremium\" target=\"_blank\">YouTube Music</a>, the streaming service is your personal guide to the world of music, simply organized in an app and web player. A bit more on what YouTube Music has to offer: <br /><br /><br /><ul><li><b>Catalog:</b> YouTube Music offers over 50 million official tracks, albums and high quality audio, as well as deep cuts, B-sides, live performances, and remixes you can’t find anywhere else.</li></ul><ul><li><b>Listen everywhere:</b> Explore YouTube Music’s audio-first music app, desktop and smart speaker experience. Recommendations: Discover new music through YouTube Music’s home screen recommendations and personalized mixes  - <a href=\"https://youtube.googleblog.com/2019/12/youtube-music-makes-discovery-more.html\" target=\"_blank\">My Mix</a>, <a href=\"https://youtube.googleblog.com/2019/12/youtube-music-makes-discovery-more.html\" target=\"_blank\">Discovery Mix</a>, and <a href=\"https://youtube.googleblog.com/2019/12/youtube-music-makes-discovery-more.html\" target=\"_blank\">New Release Mix</a> - based on taste, location, time of day and Play Music preferences after transferring.</li></ul><ul><li><b>Official Playlists:</b> Listen to thousands of official playlists from both YouTube Music and Google Play Music. </li></ul><br /><br />We’ve listened to Google Play Music user feedback and recently introduced additional new features to YouTube Music for fans to enjoy. Some of the YouTube Music features we’re most excited to share include the following (with more updates on the way!): <br /><br /><br /><ul><li><b>Playlist Creation:</b> We’ve increased playlist length from 1,000 to 5,000 songs to make room for even more of your favorites songs.</li></ul><ul><li><b>Uploads:</b> You can listen to your uploaded and purchased music from Google Play Music after your transfer, or add up to 100,000 personal tracks to your library in YouTube Music (an increase of more than 50,000 compared to Google Play Music).</li></ul><ul><li><b>Offline listening:</b> Paying members can download any song, playlist, music video or let smart downloads (Android only for now) do it for you so you always have something to listen to, even when you don’t have service.</li></ul><ul><li><b>Lyrics:</b> Lyrics offer highly visible access to follow along to tracks.</li></ul><ul><li><b>Explore Tab:</b> An all-new Explore tab offering one go-to place to discover new music and YouTube Music’s vast catalog of playlists through New Releases and Moods &amp; Genres sections. </li></ul><br /><br /><h3>Pricing </h3><br />Existing pricing is the same between Google Play Music and YouTube Music. Fans can enjoy the ad-supported version of YouTube Music for free, or enjoy YouTube Music Premium, a paid membership that gives listeners background listening, downloads and an ad-free experience for $9.99 a month. Or you can try YouTube Premium to extend ad-free, background listening and offline playback across all of YouTube for $11.99 (USD). <br /><br />Google Play Music Unlimited members will be automatically granted the equivalent tier of YouTube Music Premium or YouTube Premium based on the level of benefits with their current subscription, at the same price*. <br /><br />We can’t wait for you to start exploring YouTube Music features and discovering new music favorites along the way. Have more questions or need help? Check out all of our support resources <a href=\"https://support.google.com/youtubemusic/answer/9698084\" target=\"_blank\">here</a>. <br /><br /><i>*Some users may see a price difference upon transfer. Learn more <a href=\"https://support.google.com/youtubemusic/answer/9698084\" target=\"_blank\">here</a>. </i>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}