{
  "title": "495 - The Science of Mindfulness",
  "itunes:title": "495 - The Science of Mindfulness",
  "pubDate": "Fri, 22 Jul 2022 10:00:00 +0000",
  "guid": "566b6254-c58f-4de4-aed0-8ed7ecb1c7ad",
  "link": "https://johnshopkinssph.libsyn.com/495-the-science-of-mindfulness",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Mindfulness is sometimes seen as a buzzword, but it’s an evidence-based facet key to our physical and emotional well-being. Mindfulness researcher</span> <strong>Dr. Christina Bethell</strong> <span style=\"font-weight: 400;\">talks with</span> <strong>Lindsay Smith Rogers</strong> <span style= \"font-weight: 400;\">about the science behind the practice, the connection to resilience, and how mindfulness can help people recover from trauma and adverse childhood experiences. They also discuss some basic practices you can do yourself and Dr. Bethell leads a short breathing exercise. Learn more about her work</span> <a href= \"https://magazine.jhsph.edu/2016/spring/forum/rethinking-the-new-science-of-thriving/\"> <span style=\"font-weight: 400;\">here</span></a><span style= \"font-weight: 400;\">.</span></p>",
  "content:encoded": "<p>Mindfulness is sometimes seen as a buzzword, but it’s an evidence-based facet key to our physical and emotional well-being. Mindfulness researcher Dr. Christina Bethell talks with Lindsay Smith Rogers about the science behind the practice, the connection to resilience, and how mindfulness can help people recover from trauma and adverse childhood experiences. They also discuss some basic practices you can do yourself and Dr. Bethell leads a short breathing exercise. Learn more about her work <a href= \"https://magazine.jhsph.edu/2016/spring/forum/rethinking-the-new-science-of-thriving/\"> here</a>.</p>",
  "enclosure": "",
  "itunes:duration": "22:52",
  "itunes:explicit": false,
  "itunes:keywords": "health,research,mindfulness,emotional,trauma,Childhood,wellbeing,resilience",
  "itunes:subtitle": "Mindfulness is sometimes seen as a buzzword, but it’s an evidence-based facet key to our physical and emotional well-being. Mindfulness researcher Dr. Christina Bethell talks with Lindsay Smith Rogers about the science behind the practice, the...",
  "itunes:season": 6,
  "itunes:episode": 495,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}