{
  "title": "A new control system for synthetic genes",
  "link": "https://news.mit.edu/2022/synthetic-gene-expression-control-1101",
  "description": "Researchers have developed a technique that could help fine-tune the production of monoclonal antibodies and other useful proteins.",
  "pubDate": "Tue, 01 Nov 2022 09:00:00 -0400",
  "guid": "https://news.mit.edu/2022/synthetic-gene-expression-control-1101",
  "dc:creator": "Anne Trafton | MIT News Office",
  "content:encoded": "<p>Using an approach based on CRISPR proteins, MIT researchers have developed a new way to precisely control the amount of a particular protein that is produced in mammalian cells.</p>\n\n<p></p>\n\n<p>This technique could be used to finely tune the production of useful proteins, such as the monoclonal antibodies used to treat cancer and other diseases, or other aspects of cellular behavior. In their new study, which appears in <em>Nature Communications</em>, the researchers showed that this system can work in a variety of mammalian cells, with very consistent results.</p>\n\n<p></p>\n\n<p>“It’s a highly predictable system that we can design up front and then get the expected outcome,” says William C.W. Chen, a former MIT research scientist. “It’s a very tunable system and suitable for many different biomedical applications in different cell types.”</p>\n\n<p></p>\n\n<p>Chen, who is now an assistant professor of biomedical sciences at the University of South Dakota, is one of the lead authors of the <a href=\"https://www.nature.com/articles/s41467-022-33287-9\" target=\"_blank\">new study</a>, along with former MIT Research Scientist Leonid Gaidukov and postdoc Yong Lai. Senior author Timothy Lu led the research as an MIT associate professor of biological engineering and of electrical engineering and computer science.</p>\n\n<p></p>\n\n<p><strong>Gene control</strong></p>\n\n<p></p>\n\n<p>Many therapeutic proteins, including monoclonal antibodies, are produced in large bioreactors containing mammalian cells that are engineered to generate the desired protein. Several years ago, researchers in MIT’s Synthetic Biology Center, including Lu’s lab, began working with Pfizer Inc. on a project to develop synthetic biology tools that could be used to boost the production of these useful proteins.</p>\n\n<p></p>\n\n<p>To do so, the researchers targeted the promoters of the genes they wanted to upregulate. In all mammalian cells, genes have a promoter region that binds to transcription factors — proteins that initiate the transcription of the gene into messenger RNA.</p>\n\n<p></p>\n\n<p>In previous work, scientists have designed synthetic transcription factors, including proteins called zinc fingers, to help activate target genes. However, zinc fingers and most other types of synthetic transcription factors have to be redesigned for each gene that they target, making them challenging and time-consuming to develop.</p>\n\n<p></p>\n\n<p>In 2013, researchers in Lu’s lab developed a CRISPR-based transcription factor that allowed them to more easily <a href=\"https://news.mit.edu/2013/an-easier-way-to-control-genes-0903\" target=\"_blank\">control transcription</a> of naturally occurring genes in mammalian and yeast cells. In the new study, the researchers set out to build on that work to create a library of synthetic biological parts that would allow them to deliver a transgene — a gene not normally expressed by the cell — and precisely control its expression.</p>\n\n<p></p>\n\n<p>“The idea is to have a full-spectrum synthetic promoter system that can go from very low to very high, to accommodate different cellular applications,” Chen says.</p>\n\n<p></p>\n\n<p>The system that the researchers designed includes several components. One is the gene to be transcribed, along with an “operator” sequence, which consists of a series of artificial transcription factor binding sites. Another component is a guide RNA that binds to those operator sequences. Lastly, the system also includes a transcription activation domain attached to a deactivated Cas9 protein. When this deactivated Cas9 protein binds to the guide RNA at the synthetic promoter site, the CRISPR-based transcription factor can turn on gene expression.</p>\n\n<p></p>\n\n<p>The promoter sites used for this synthetic system were designed to be distinct from naturally occurring promoter sites, so that the system won’t affect genes in the cells’ own genomes. Each operator includes between two and 16 copies of the guide RNA binding site, and the researchers found that their system could initiate gene transcription at rates that linearly correspond to the number of binding sites, allowing them to precisely control the amount of the protein produced.</p>\n\n<p></p>\n\n<p><strong>High consistency</strong></p>\n\n<p></p>\n\n<p>The researchers tested their system in several types of mammalian cells, including Chinese hamster ovary (CHO) cells, which are commonly used to produce therapeutic proteins in industrial bioreactors. They found very similar results in CHO cells and the other cells they tested, including mouse and rat myoblasts (precursors to muscle cells), human embryonic kidney cells, and human induced pluripotent stem cells.</p>\n\n<p></p>\n\n<p>“The system has very high consistency over different cell types and different target genes,” Chen says. “This is a good starting point for thinking about regulating gene expression and cell behavior with a highly tunable, predictable artificial system.”</p>\n\n<p></p>\n\n<p>After first demonstrating that they could use the new system to induce cells to produce expected amounts of fluorescent proteins, the researchers showed they could also use it to program the production of the two major segments of a monoclonal antibody known as JUG444.</p>\n\n<p></p>\n\n<p>The researchers also programmed CHO cells to produce different quantities of a human antibody called anti-PD1. When human T cells were exposed to these cells, they became more potent tumor cell killers if there was a larger amount of the antibody produced.</p>\n\n<p></p>\n\n<p>Although the researchers were able to obtain a high yield of the desired antibodies, further work would be needed to incorporate this system into industrial processes, they say. Unlike the cells used in industrial bioreactors, the cells used in this study were grown on a flat surface, rather than in a liquid suspension.</p>\n\n<p></p>\n\n<p>“This is a system that is promising to be used in industrial applications, but first we have to adapt this into suspended cells, to see if they make the proteins the same way. I suspect it should be the same, because there’s no reason that it shouldn’t, but we still need to test it,” Chen says.</p>\n\n<p></p>\n\n<p>The research was funded by the Pfizer-MIT RCA Synthetic Biology Program, the National Science Foundation, the National Institutes of Health, the University of South Dakota Sanford School of Medicine, an NIH Ruth L. Kirschstein NRSA postdoctoral fellowship, and the U.S. Department of Defense.</p>",
  "media:content": {
    "media:description": "Using an approach based on the CRISPR gene-editing system, MIT researchers have developed a new way to precisely control the amount of a particular protein that is produced in mammalian cells.",
    "media:credit": "Cell image: Matthew Daniels, edited by MIT News"
  },
  "category": [
    "Research",
    "Biological engineering",
    "CRISPR",
    "Cancer",
    "School of Engineering",
    "National Science Foundation (NSF)",
    "National Institutes of Health (NIH)"
  ]
}