{
  "id": "yt:video:E8j8MeN7kXk",
  "yt:videoId": "E8j8MeN7kXk",
  "yt:channelId": "UCF12zIL-CqStBeQtB6MTr8A",
  "title": "Visualizing Difficult Historical Realities: The Uncle Sam Plantation Project",
  "link": "",
  "author": {
    "name": "The German Professor",
    "uri": "https://www.youtube.com/channel/UCF12zIL-CqStBeQtB6MTr8A"
  },
  "published": "2017-10-02T01:14:23+00:00",
  "updated": "2022-05-29T18:27:36+00:00",
  "media:group": {
    "media:title": "Visualizing Difficult Historical Realities: The Uncle Sam Plantation Project",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Contact:\nGrinnell College Immersive Experiences Lab (GCIEL):\nhttp://gciel.sites.grinnell.edu\n\nUncle Sam Plantation Research Blog:\nhttp://unclesam.sites.grinnell.edu\n\nDr. David Neville:\nhttps://doktorfrag.com\n@doktorfrag\n\nDr. Sarah Purcell:\nhttps://www.grinnell.edu/users/purcelsj\n@SarahJPurcell\n\nDescription:\nThis poster will spark conversations about the emerging Uncle Sam Plantation Project, that is part of the Grinnell College Immersive Experiences Lab (GCIEL). The GCIEL is an interdisciplinary community of inquiry exploring new ways to approach the liberal arts and make them more widely accessible through immersive 3D, VR, and MR experiences. A GCIEL project development team consisting of Dr. Sarah Purcell (History), Dr. David Neville (Digital Liberal Arts Collaborative), and three students (3D artist, software developer, and subject-matter expert) are working on creating a 3D model of the Uncle Sam Plantation, a 19th-century sugar plantation that was located near the town of Convent in St. James Parish, Louisiana. Constructed between 1829 and 1843, the Uncle Sam plantation was once one of the most intact and architecturally-unified plantation complexes in the Southeastern United States and a prime example of Greek Revival-style architecture. Before the plantation complex was razed in 1940 to make room for a river levee, floor plans and elevations of the buildings were produced by the Historic American Buildings Survey.\n\nThe poster will present both technological and historical/philosophical issues that are important to this kind of digital project. The team is grappling with ethical and technological issues simultaneously as we seek to represent the physical plantation that was part of a system of racialized hegemony in the United States. The project lies, therefore, at the intersection of race, visualization, and the spatial humanities. Questions to be explored in the poster include: What are the ethics of creating an immersive digital experience that relates to enslaved labor and white supremacy? How can immersive environments act as tools of historical recreation and preservation? What was the significance of the Uncle Sam plantation in the history of slavery and of Louisiana? Is there a connection between digitally created immersive environments and the abolitionist technique of moral suasion (for example, can technology enhance the anti-slavery impulse or fight racism)? Finally, how can an interdisciplinary team best answer these questions while also implementing an excellent technical project? We hope the poster can spark deep and interesting conversations.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}