{
  "id": "yt:video:B4YvZXVTsCo",
  "yt:videoId": "B4YvZXVTsCo",
  "yt:channelId": "UCUk0AvSMU5CJ0wUqJf9TX8g",
  "title": "The Art Of Storytelling with Christopher Paolini",
  "link": "",
  "author": {
    "name": "Coleman Hughes",
    "uri": "https://www.youtube.com/channel/UCUk0AvSMU5CJ0wUqJf9TX8g"
  },
  "published": "2022-10-28T20:00:06+00:00",
  "updated": "2022-10-28T21:46:11+00:00",
  "media:group": {
    "media:title": "The Art Of Storytelling with Christopher Paolini",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Today I have a different kind of guest than I usually do. He's a fantasy and sci-fi author by the name of Christopher Paolini. You may be aware of his best-selling young adult fantasy book Eragon, which he wrote at the age of 15 and was also made into a major-budget film. The rest of the books in that series are Eldest, Brisingr, and Inheritance. You may also be aware of his more recent sci-fi novel called \"To Sleep in a Sea of Stars\". I've been a huge fan of Christopher for a very long time, and it was an honor to pick his brain.\n\nIn this episode, we talk about Christopher's writing process, the art of storytelling, the difference between young adult fiction and adult fiction, his strange path to becoming an author, the shortening of our collective attention spans, and much more. This was really one of my favorite recent interviews, and I hope you enjoy it as much as I did.\n\nCheck out Christopher's Books - https://www.paolini.net/works\n\n#Indeed \nIndeed is the hiring platform where you can Attract, Interview, and Hire all in one place. Finding great talent doesn’t have to be a second job. You can reclaim your time and find top talent fast with Indeed. Find top talent fast with Indeed’s suite of powerful hiring tools like Indeed Instant Match, Assessments, and Virtual Interviews. Indeed’s Virtual Interview tool means there’s nothing to download–just click and talk. With Virtual Interviews, Indeed saves you time. You can message, schedule, and interview top talent all in one place. \nJoin over three million businesses worldwide using INDEED to hire great talent fast.\nVisit https://www.indeed.com/Conversations to start hiring now\n\n#ColemanUnfiltered\nColeman Unfiltered addresses topics that have been on mute through the ages with silent shifts into polarities, by relentless questioning and observations in coordination with some of the brightest intellectuals of our generation.\nThe Unfiltered Community is an ode to the fans; an environment promoting sound tolerance of ideas to solidify the meaning of liberalism in a changing world.\nIt’s a concrete effort to have open, honest conversations on the most difficult social and political issues we’re surrounded with.\nFor in-depth discussions, unaired/unseen episodes, and bonus content on Conversations With Coleman, participate via a membership and gain access to raw, powerful human ideology. \nWelcome to the new age’s most original intellectual revolution; let’s change the world, one conversation at a time.\nSign up Today  - https://bit.ly/3B1GAlS\n\n\nFOLLOW COLEMAN \n\nYouTube - http://bit.ly/38kzium \nTwitter - http://bit.ly/2rbAJue \nFacebook - http://bit.ly/2LiAXH3 \nInstagram - http://bit.ly/2SDGo6o \nPodcast -https://bit.ly/3oQvNUL \nWebsite - https://colemanhughes.org/ \nLimited Edition Merch - https://bit.ly/CWCMerch",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}