{
  "title": "Virgin Galactic delays development of ship capable of higher flight rate",
  "link": "https://arstechnica.com/?p=1895146",
  "dc:creator": "Eric Berger",
  "pubDate": "Fri, 04 Nov 2022 13:59:42 +0000",
  "category": [
    "Science",
    "space",
    "Virgin Galactic",
    "vss unity"
  ],
  "guid": "https://arstechnica.com/?p=1895146",
  "description": "\"The economic momentum of the company is around the Delta ships.\"",
  "content:encoded": "<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\">\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/Ex0tg1qXEAYhLcQ-800x450.jpg\" alt=\"Photos of VSS Imagine.\">\n      <p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/Ex0tg1qXEAYhLcQ.jpg\" class=\"enlarge-link\" data-height=\"1406\" data-width=\"2500\">Enlarge</a> <span class=\"sep\">/</span> Virgin Galactic's new vehicle, VSS <em>Imagine</em>, is lighter than its predecessor, VSS<em> Unity</em>. Will it ever fly? (credit: Virgin Galactic)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Space tourism company Virgin Galactic released its <a href=\"https://s29.q4cdn.com/417755062/files/doc_financials/Quarterly/2022/q3/SPCE-3Q22-Earnings-Press-Release-FINAL.pdf\">third-quarter financial results</a> on Thursday. As one might imagine of a spaceflight company that has not flown since June 2021, the financials are pretty disastrous. The company reported revenue of less than $1 million against losses of more than $146 million.</p>\n<p>After a long period of downtime, Virgin Galactic officials said the company is close to completing \"modifications\" of its VMS<em> Eve</em> carrier aircraft and VSS<em> Unity</em> spacecraft. The company expects to complete a glide flight of <em>Unity</em>, which is released from <em>Eve</em> at altitude, in early 2023. After that point, the company will conduct a powered test flight, likely with its own employees on board, before a research flight for the Italian Air Force.</p>\n\n<p>And after that, Virgin Galactic CEO Michael Colglazier said, the company remains on track to begin flying commercial passengers—people who bought their seats, some more than a decade ago—in the second quarter of 2023. As with most schedules in spaceflight, that timeline seems pretty optimistic.</p></div><p><a href=\"https://arstechnica.com/?p=1895146#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1895146&comments=1\">Comments</a></p>"
}