{
  "title": "S1E47 - An Unstoppable Drive with Our Host, Laura Wilkinson, on the Jedburgh Podcast",
  "guid": "https://pinecast.com/guid/f0dbd9dc-5aac-43ed-8857-96ffe8688d75",
  "pubDate": "Tue, 08 Jun 2021 06:30:00 -0000",
  "itunes:duration": "01:20:20",
  "description": "<p>Once again this week, things are a little bit different as today’s episode features Laura being interviewed by former Special Forces Green Beret, Fran Racioppi, on ‘The Jedburgh Podcast’. Touted as ‘a conversation with prominent visionaries, drivers of change, and those dedicated to winning’, this podcast is a natural and timely fit for Laura, as she participates in the Olympic Trials this week and next in her bid to compete in her fourth Olympic Games. Be sure to tune into the Olympic Channel and NBC and join Fran in cheering her on in her attempt, and enjoy this interview here today which outlines precisely just what it takes to reach similar success in your own life.\n \nLaura and Fran begin by looking at what it takes to reach elite levels, and then discuss Laura’s career from her start in high school to present day. Along the way, they explore her perspective on failure and fear, the need to take ownership of your performance, her Sydney Olympics experience, and her Dream Chaser philosophy. They also delve into Laura’s neck surgery and recovery, her preparation for the Tokyo Olympics, and her take on finding balance in life and achieving longevity in sports. The interview concludes with her thoughts on channeling the pressure of the moment, ‘The Pursuit of Gold’, the 3 things she does every day, and the elite performance characteristic that Laura most exemplifies – drive. As Laura heads into the Trials which will determine her immediate Olympic future, today’s sweeping examination of the many components which have brought her to this moment could not be more relevant – listen in and prepare to be inspired.</p>\n<p>Episode Highlights:    \n </p>\n<ul>\n<li>What it takes to reach elite levels</li>\n<li>Laura’s high school diving experience and her ‘call to action’</li>\n<li>Her perspective on failure</li>\n<li>Taking ownership of your performance</li>\n<li>Laura’s performance at the Sydney Olympics, the events leading up to it, and the pep talk she gave herself</li>\n<li>Dream Chaser</li>\n<li>Her neck surgery and recovery</li>\n<li>Laura’s thoughts on fear and moving past it</li>\n<li>Preparing to qualify for Tokyo</li>\n<li>Dealing with the ‘uncontrollables’</li>\n<li>Her thought on finding balance in her life</li>\n<li>Achieving longevity in sports</li>\n<li>Channeling the pressure of the moment</li>\n<li>Her ‘Pursuit of Gold’ podcast</li>\n<li>Laura’s next couple months</li>\n<li>The 3 things Laura does every day to be successful</li>\n<li>The elite performance characteristic that Laura most exemplifies</li>\n</ul>\n<p>Quotes: \n </p>\n<ul>\n<li>“Faith and determination separate the good from the great.”</li>\n<li>“Just because somebody tells you you can't, doesn't mean it's true.”</li>\n<li>“Failure is part of success. And the concrete actions that you take from the moment you accept that you failed are what defines you as a leader and as an elite performer.”</li>\n<li>“I'm not afraid to look like a fool.”</li>\n<li>“When we talk about the development of elite talent, there's a requirement to be humble and show humility.”</li>\n<li>“How can I become better? How can I fix that? How can I move forward?”</li>\n<li>“It doesn't matter how old you are, doesn't matter what station you have in life, you can really make a difference for somebody just by being there for them.”</li>\n<li>“This pressure that you felt became a power.”</li>\n<li>“I realized that there were so many people that probably would never have the opportunity that I was in at that moment.”</li>\n<li>“The task ahead of you is never greater than the power behind you.”</li>\n<li>“I absolutely loved it, because it wasn't about me in that moment...it was about something so much bigger.”</li>\n<li>“So it's about the pursuit, it's about the hunt. It's about who you become. And I think that's what I really mean by Dream Chaser.”</li>\n<li>“You have to have this done just to be a mom because if you trip down the stairs, if you have a small car accident, like, that could lead to a quadriplegic.”</li>\n<li>“A lot of times we're scared of the unknown…fear is a lot of times a liar.”</li>\n<li>“To wholly stay in the moment is really the biggest key…and you have to practice that in practice.”</li>\n<li>“I think really breaking my foot back then was such a gift because it gave me that opportunity to focus on visualization, to go through so many competition scenarios in my mind with so many different athletes.”</li>\n<li>“Adversity makes you stronger.”</li>\n<li>“The challenge in front of you sometimes becomes the blessing that you needed.”</li>\n<li>“I have learned this last year is that I can just tear my plans up, throw them out the window, because I’ve got to roll with it. And I'm not good at that.”</li>\n<li>“I think one of the best things COVID taught me was that I need to have my kids be part of what I'm doing.”</li>\n<li>“They saw the sweat, they saw the tears, they saw the frustration, they saw how many times a day I was having to do this stuff and how hard I was working, all just hoping to get back in the pool. So it provided a lot of really good conversations for us.”</li>\n<li>“The best people you see doing this are beginners at some point, like, you have to start somewhere.”</li>\n<li>“I've had a lot of times where I'm like, you know, God, I'd be okay, if He closed the door, and we're done with this. But He's made it very clear, this is where I need to be, and He's made a way, and then that fire is back, and that fuel is back.”</li>\n<li>“I've learned not to be scared of my emotions. I've learned how to use them and how to direct them.”</li>\n<li>“And it's not about the pressure, or the expectations, or all these other things, just let that go. And it's just about me enjoying the moment.”</li>\n<li>“This is actually my way of finding the resources and giving them to other athletes.”</li>\n<li>“Learning those lessons from people and taking that with me, I think makes me not just stronger mentally, but emotionally and spiritually.”</li>\n<li>“There's this need for achievement and growth mindset - be better today than you were yesterday, continuous self improvement - that you display that has set you apart from all of your competition.”</li>\n<li>“For all the people who maybe think they're too old to do something they love to do, don't let society or culture decide that for you. If you love something, do it.”</li>\n</ul>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold Homepage</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>                \n \nLaura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura's Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura's Facebook page</a>\n The Jedburgh Podcast:\n<a href=\"https://talentwargroup.com/the-jedburgh-podcast/\" rel=\"nofollow\">The Jedburgh Podcast Website</a>\n<a href=\"https://podcasts.apple.com/us/podcast/the-jedburgh-podcast/id1558608802\" rel=\"nofollow\">The Jedburgh Podcast on iTunes</a>\n<a href=\"https://www.instagram.com/jedburghpodcast/\" rel=\"nofollow\">The Jedburgh Podcast Instagram</a>\n<a href=\"https://www.linkedin.com/company/the-jedburgh-podcast/\" rel=\"nofollow\">The Jedburgh Podcast LinkedIn</a></p>",
  "itunes:title": "An Unstoppable Drive with Our Host, Laura Wilkinson, on the Jedburgh Podcast",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 47
}