{
  "title": "Episode 5: Rosetta Tharpe and &#8220;This Train&#8221;",
  "link": "https://500songs.com/podcast/rosetta-tharpe-and-this-train/",
  "pubDate": "Mon, 05 Nov 2018 02:28:05 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/rosetta-tharpe-and-this-train/",
  "description": "Welcome to episode five of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at Sister Rosetta Tharpe and \"This Train\"\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-5-this-train/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nMost of Rosetta Tharpe's music is now in the public domain, so there are a lot of compilations available. <a href=\"https://amzn.to/2yQvill\">This one</a>, at three CDs for four pounds, is probably the one to get.\n\nAlmost all the information about Rosetta Tharpe's life in this episode comes from&nbsp;<a href=\"https://amzn.to/2D1F2ff\"><em>Shout, Sister, Shout!: The Untold Story of Rock-and-roll Trailblazer Sister Rosetta Tharpe</em> by Gayle F Wald,</a>\n\nFor more on Thomas Dorsey, check out&nbsp;<a href=\"https://amzn.to/2F48xj9\">The Rise of Gospel Blues: The Music of Thomas Andrew Dorsey in the Urban Church by Michael W. Harris</a>.\n\nThe Spirituals to Swing concerts are currently out of print, and the recording quality is poor enough it's&nbsp;<em>really</em> not worth paying the silly money the CDs go for second hand. But if you want to do that, you can find them <a href=\"https://amzn.to/2yPyYU7\">here</a>.\n\nAnd Rosetta Tharpe's performance at Wilbraham Road Railway Station can be found on<a href=\"https://amzn.to/2DmcJt8\"><em>&nbsp;The American Folk Blues Festival: The British Tours 1963-1966</em></a>\n\n<strong>Transcript</strong>\n\nOne of the problems when dealing with the history of rock and roll, as we touched upon the other week in the brief disclaimer episode, is the way it's dominated by men. Indeed, the story of rock and roll is the story of men crowding out women, and white men crowding out black men, and finally of rich white men crowding out poorer white men, until it eventually becomes a dull, conservative genre. Sorry if that's a spoiler, but don't say I didn't warn you when I get to the nineties.\n\nBut one black woman is as responsible as anyone for the style of rock and roll, and in particular, for its focus on the guitar.\n\nTo find out why, we're going to be making our final trip back to 1938 and Carnegie Hall.\n\nWe've talked in earlier episodes about John Hammond's legendary Spirituals to Swing concerts, and at the time I said that I'd talk some more about the ways in which they were important, but also about how they were problematic. (I know that's a word that gets overused these days, but I mean it literally -- they had problems, but weren't all bad. Far from it).\n\nOne of the most problematic aspects of them, indeed, is encoded in the name. \"From Spirituals to Swing\". It gives you a nice, simple, linear narrative -- one that was still being pushed in books I read in the 1980s. You start with the spirituals and you end with swing. It's like those diagrams of the evolution of man, with the crawling monkey on one side and the tall, oddly hairless, white man with his genitals carefully concealed on the other.\n\nThe fact is, most of the narrative about \"primitive\" music -- a narrative that was put forward by very progressive white men like John Hammond or the Lomaxes -- is deeply mistaken. The forms of music made largely by black people could sound less sophisticated in the 1930s, but that wasn't because they were atavistic survivals of more primitive forms, musical coelacanths dredged up from the depths to parade. It was because the people making the music often couldn't afford expensive instruments, and were recorded on cheaper equipment, and all the other myriad ways society makes the lives of black people, and underprivileged people in other ways, just that bit more difficult.\n\nBut this was, nonetheless, the narrative that was current in the 1930s. And so the Spirituals to Swing concerts featured a bisexual black woman who basically invented much of what would become rock guitar, an innovator if ever there was one, but portrayed her as somehow less sophisticated than the big band music on the same bill. And they did that because that innovative black woman was playing religious music.\n\nIn fact, black gospel music had grown up around the same time as the big bands. Black people had, of course, been singing in churches since their ancestors were forcibly converted to Christianity, but gospel music as we talk about it now was largely the creation of one man -- Thomas Dorsey.\n\n(This is not the same man as the white bandleader Tommy Dorsey who we've mentioned a couple of times earlier).\n\nDorsey was a blues and jazz musician, who had led the band for Ma Rainey, one of the great early blues singers, and under the name \"Georgia Tom\" he'd collaborated with Tampa Red on a series of singles. Their song \"It's Tight Like That\", from 1928, is one of the earliest hokum records, and is largely responsible for a lot of the cliches of the form -- and it sold seven million copies.\n\n[excerpt of \"It's Tight Like That\"]\n\nThat record, in itself, is one of the most important records that has ever been made -- you can trace from that song, through hokum blues, through R&B, and find its influence in basically every record made by a black American, or by anyone who's ever listened to a record made by a black American, since then. If Dorsey had only made that one record, he would have been one of the most important figures in music history.\n\nBut some time around 1930, he also started writing a whole new style of music. It combined the themes, and some of the melody, of traditional Christian hymns, with the feel of the blues and jazz music he'd been playing. It's rare that you can talk about a single person inventing a whole field of music, but gospel music as we know it basically *was* invented by Thomas Dorsey.\n\nOther people had performed gospel music before, of course, but the style was very different from anything we now think of as gospel. Dorsey was the one who pulled all the popular music idioms into it and made it into something that powered and inspired all the popular music since.\n\nHe did this because he was so torn between his faith and his work as a blues musician that he had multiple breakdowns -- at one point finding himself on stage with Ma Rainey and completely unable to move his fingers to play the piano. While he continued parallel careers for a while, eventually he settled on making religious music.&nbsp;And the songs he wrote include some of the most well-known songs of all time, like \"Peace in the Valley\" and \"Take My Hand, Precious Lord\".\n\nThat's a song he wrote in 1932, after his wife died in childbirth and his newborn son died a couple of days later. He was feeling a grief that most of us could never imagine, a pain that must have been more unbearable than anything anyone should have to suffer, and the pain came out in beauty like this:\n\n[excerpt of Rosetta Tharpe singing \"Take My Hand, Precious Lord\"]\n\nThat's not \"primitive\" music. That's not music that is unsophisticated. That's not some form of folk art. That's one man, a man who personally revolutionised music multiple times over, writing about his own personal grief and creating something that stands as great art without having to be patronised or given special consideration.\n\nAnd the person singing on that recording is Sister Rosetta Tharpe, who, like Dorsey, is someone who doesn't need to be given special treatment or be thought of as good considering her disadvantages or any of that patronising nonsense. Sister Rosetta Tharpe was one of the great singers of her generation, and one of the great guitar players of all time. And she was making music that was as modern and cutting-edge as anything else made in the 1930s and 40s. She wasn't making music that was a remnant of something that would evolve into swing, no matter what John Hammond thought, she was making important music, and music that would in the long run be seen as far more important than most of the swing bands.\n\nObviously, one should not judge Hammond too harshly. He was from another time. A primitive.\n\nSister Rosetta was brought up in, and spent her life singing for, the Church of God in Christ. As many of my listeners are in Europe, as I am myself, it's probably worth explaining what this church is, because while it does have branches outside the US, that's where it's based, and that's where most of its membership is.\n\nThe Church of God in Christ is a Pentecostal church, and it's the largest Pentecostal church in the US, and the fifth-largest church full stop. I mention that it's a Pentecostal church, because that's something you need to understand to understand Rosetta Tharpe. Pentecostals believe in something slightly different to what most other Christian denominations believe.\n\nBefore I go any further, I should point out that I am *not* an expert in theology by any means, and that what I'm going to say may well be a mischaracterisation. If you're a Pentecostal and disagree with my characterisation of your religion here, I apologise, and if you let me know I'll at least update the show notes. No disrespect is intended.\n\nWhile most Christians believe that humanity is always tainted by original sin, Pentecostals believe that it is possible for some people, if they truly believe -- if they're \"born again\" to use a term that's a little more widespread than just Pentecostalism -- to become truly holy. Those people will have all their past sins forgiven, and will then be sinless on Earth. To do this, you have to be \"baptised in the Holy Ghost\". This is different from normal baptism, what Pentecostal call \"water baptism\" -- though most Pentecostal think you should be water baptised anyway, as a precursor to the main event. Rather, this is the Holy Spirit descending from Heaven and entering you, filling you with joy and a sense of sanctity. This can often cause speaking in tongues and other strange behaviours, as people are enthused (a word which, in the original Greek, actually meant a god entering into you), and once this has happened you have the tendency to sin removed from you altogether.\n\nThis is all based on the Acts of the Apostles, specifically Acts 2:4, which describes how at the Pentecost (which is the seventh Sunday after Easter),&nbsp;\"All were filled with the Holy Spirit. They began to express themselves in foreign tongues and make bold proclamation as the Spirit prompted them\".\n\nUnlike many Protestant denominations, which adhere to Calvinist beliefs that nobody can know if they're going to Heaven or Hell, and that only God can ever know this, and that nothing you do can make a difference to your chances, most Pentecostals believe that you can definitely tell whether you're going to Heaven. You're going to Heaven once you're sanctified by the Holy Spirit, and that's an end of it.\n\nAt least, it's an end of it so long as you continue with what's called \"outward holiness\", and so you have to dress conservatively, to avoid swearing, to avoid drinking or gambling or smoking, or dancing suggestively, or wearing makeup. If you do that, once the spirit's entered into you, you're going to remain holy and free from temptation. If you don't do that, well, then the Devil might get you after all.\n\nThis is a very real fear for many Pentecostals, who have a belief in a literal heaven and hell. And it's a fear that has inspired a *lot* of the most important musicians in rock and roll. But Pentecostalism isn't just about fear and living right, it's also about that feeling of elation and exhilaration when the holy spirit enters you. And music helps bring that feeling about.\n\nIt's no surprise that a lot of the early rock and rollers went to Pentecostal churches -- at many of them, especially in the South of the US, there's a culture of absolutely wild, unrestrained, passionate music and dancing, to get people into the mood to have the spirit enter them. And Sister Rosetta Tharpe is probably the greatest performer to come out of those churches.\n\nBut while most of the performers we'll be looking at started playing secular music, Sister Rosetta never did, or at least very rarely.&nbsp;But she was, nonetheless, an example of something that we'll see a lot in the history of rock -- the pull between the spiritual and the worldly.\n\nFrom the very start of her career, Sister Rosetta was slightly different from the other gospel performers. While she lived in Chicago at the same time as Thomas Dorsey and Mahalia Jackson, she isn't generally considered part of the gospel scene that they were at the centre of -- because she was travelling round the country playing at revival meetings, rather than staying in one place. When her first marriage -- to a fellow evangelist, who apparently abused her -- broke up, she moved on to New York, and there she started playing to audiences that were very different from the churches she was used to.\n\nWhere people like Mahalia were playing church music for church people, Rosetta Tharpe was taking the gospel to the sinners. Throughout her career, she played in nightclubs and theatres, playing for any audience that would have her, and playing music that got them excited and dancing, even as she was singing about holiness.\n\nShe started playing the Cotton Club in 1938. The Cotton Club was the most famous club in New York, though in 1938 it was on its last days of relevance. It had been located in Harlem until 1936, but after riots in Harlem, it had moved to a more respectable area, and was now on Broadway.\n\nIn the twenties and early thirties, the Cotton Club had been responsible for the success of both Duke Ellington and Cab Calloway, though only Calloway was still playing there regularly by the time Rosetta Tharpe started performing there. It was still, though, the place to be seen -- at least if you were white. The Cotton Club was strictly segregated -- only black people on stage, but only white people in the audience. The black performers were there to be leered at, in the case of the showgirls, or to play up to black stereotypes. Even Duke Ellington, possibly the most sophisticated musician ever to come out of the United States, had been presented as a \"jungle musician\". The name itself -- the Cotton Club -- was trading on associations with slavery and cotton picking, and the feel of the new venue could probably be summed up by the fact that it had, on its walls, pictures of famous white bandleaders in blackface.\n\nSo it's not surprising that the performances that Sister Rosetta did at the Cotton Club were very different from the ones she'd been doing when she was travelling the country with her mother performing to church crowds. She was still playing the same music, of course -- in fact, over her career, she mostly stuck to the same quite small repertoire, rerecording the same material in new arrangements and with new emphases as she grew as an artist -- but now she was doing it as part of a parody of the very kind of church service she had grown up in and devoted her life to, with dancers pretending to be \"Holy Rollers\", mocking her religion even as her music itself was still devoted to it.\n\nOriginally, she was only taken on at the Cotton Club as a sort of trial, on a two-week engagement -- and apparently she thought the manager was joking when she was offered five hundred dollars a week, not believing she could be making that much money -- and her role was simply to be one of many acts who'd come on and do a song or two between the bigger acts who were given star billing. But she soon became a hit, and she soon got signed to Decca to make records.\n\nHer first record was, of course, a song by Thomas Dorsey, originally titled \"Hide Me in Thy Bosom\" but given the newer title \"Rock Me\" by Tharpe. Her arrangement largely stuck to Dorsey's original, with one important exception -- where he had written \"singing\", Tharpe sang \"swinging\".\n\n[excerpt of \"Rock Me\"]\n\nMany people also claimed to hear a double entendre in the lyrics to \"Rock Me\", and to think the song was about more worldly matters than Dorsey had intended. Whether Tharpe thought that or not, it almost certainly factored into the decision to make it her first single.\n\nWhen she was booked to perform at the Spirituals to Swing concerts, she performed both that song and \"That's All\", backed by Albert Ammons, one of the boogie woogie players who also appeared on the bill, and in the recording of that we can hear, rather better than in the studio recording, the raw power of Tharpe's performance.\n\n[excerpt of \"That's All\" from Carnegie Hall]\n\nThe sound quality of these recordings isn't great, of course, but you can clearly hear the enthusiasm in that performance.\n\nTharpe's performances at the Cotton Club drew a great deal of attention, and Time magazine even did a feature on her, and how she&nbsp;“Swings Same Songs in Church and Night Club.” When the Cotton Club shut down she moved on to the Cafe Society, a venue booked by John Hammond, which was an integrated club and which fit her rather better.\n\nWhile she was working there, she came to the attention of Lucky Millinder, the big band leader. Different people have different ideas as to how the two started working together -- Mo Gale, Millinder's manager, was also Chick Webb's manager, and claimed that it was his idea and that he'd seen Tharpe as being an Ella Fitzgerald to Millinder's Chick Webb, but Bill Doggett, the piano player with Millinder's band, said that it was Millinder's idea, not Gale's, to get Tharpe on board.\n\nEither way, the combination worked well enough at first, as Tharpe got to sing the same songs she'd been performing earlier -- her gospel repertoire -- but with a big band backing her. She'd also switched to playing an electric guitar rather than an acoustic, and the effect on her guitar playing was extraordinary -- where before she'd had to be a busy accompanist, constantly playing new notes due to the lack of sustain from an acoustic guitar, now she was able to play single-note lead lines and rely on the orchestra to provide the chordal pad.\n\nHer remake of \"Rock Me\" with Millinder's band, from 1941, shows just how much her artistry had improved in just three years:\n\n[excerpt of 1941 \"Rock Me\"]\n\nWith that record, she more or less invented the guitar style that T-Bone Walker, B.B. King, and others would adapt for themselves. That's just how you play electric blues now, but it wasn't how anyone played before Rosetta Tharpe.\n\nSoon after she joined Millinder's band they moved to a residency at the Savoy Ballroom, and became one of the most popular bands for dancers in New York -- regulars there included a young man known as Detroit Red, who later changed his name to Malcolm X.&nbsp; The Savoy Ballroom was closed down not long after -- allegedly for prostitution, but more likely because it allowed white women to dance with black men, and the city of New York wouldn't allow that -- although as Malcolm X said, it wasn't as if they were dragging the white women in there.\n\nHowever, Millinder's band was an odd fit for Rosetta Tharpe, and she was increasingly forced to sing secular numbers along with the gospel music she loved. There were plenty of good things about the band, of course -- she became lifelong friends with its young trumpet player, Dizzy Gillespie, for example, and she enjoyed a tour where they were on the same bill as a young vocal group, The Four Ink Spots, but she was a little bit uncomfortable singing songs like \"Tall Skinny Papa\", which wasn't particularly gospel-like\n\n[excerpt \"Tall Skinny Papa\"]\n\nAnd it's not particularly likely that she was keen on the follow-up, although she didn't sing on that one.\n\n[excerpt \"Big Fat Mama\"]\n\nSo eventually, she quit the Millinder band, without giving notice, and went back to performing entirely solo, at least at first.\n\nThis was in the middle of the musicians' union strike, but when that ended, Tharpe was back in the studio, and in September 1944 she began one of the two most important musical collaborations of her career, when she recorded \"Strange Things Happening Every Day\", with Sam Price on piano.\n\nSam Price did *not* get along with Tharpe. He insisted on her playing with a capo, because she was playing in an open tuning and wasn't playing in a normal jazz key. He didn't like the idea of combining gospel music with his boogie woogie style (eventually he was persuaded by Tharpe's mother, a gospel star in her own right who was by all accounts a fearsome and intimidating presence, that this was OK), and when the result became a massive hit, he resented that he got a flat fee.\n\nBut nonetheless, \"Strange Things Happening Every Day\" marks out the start of yet another new style for Tharpe -- and it's yet another song often credited as \"the first rock and roll record\".\n\n[Excerpt \"Strange Things Happening Every Day\"]\n\nShortly after this, Tharpe started working with another gospel singer, Marie Knight.&nbsp;Her partnership with Marie Knight may have been a partnership in more than one sense. Knight denied the relationship to the end of her days -- and it's entirely understandable that she would, given that she was a gospel singer who was devoted to a particularly conservative church, and whose career also depended on that church -- but their relationship was regarded as an open secret within the gospel music community, which had a rather more relaxed attitude to homosexuality and bisexuality than the rest of the church. Some of Tharpe's friends have described her as a secret lesbian, but given her multiple marriages to men it seems more likely that she was bi -- although of course we will never know for sure.\n\nEither way, Tharpe and Knight were a successful double act for many years, with their voices combining perfectly to provide a gospel vocal sound that was unlike anything ever recorded. They stopped working together in 1950, but remained close enough that Knight was in charge of Tharpe's funeral in 1973,\n\nThe two of them toured together -- and Tharpe toured later on her own -- in their own bus, which was driven by a white man. This gave them a number of advantages in a deeply segregated and racist country. It was considered acceptable for them to go into some public places where they otherwise wouldn't have been allowed, because they were with a white man -- if a black woman was with a white man, it was just assumed that she was sleeping with him, and unlike a white woman sleeping with a black man, this was considered absolutely acceptable, a sexual double-standard that dated back to slavery. If they needed food and the restaurant in a town was whites-only, they could send the white driver in to get them takeout. And if it came to it, if there was no hotel in town that would take black people, they could sleep on the bus.\n\nAnd segregation was so accepted at the time by so many people that even when Tharpe toured with a white vocal group, the Jordanaires (who would later find more fame backing up some country singer named Elvis something) they just thought her having her own bus was cool, and didn't even make the connection to how necessary it was for her.\n\nWhile Tharpe and Knight made many great records together, probably Tharpe's most important recording was a solo B-side to one of their singles, a 1947 remake of a song she'd first recorded in 1938, \"This Train\", again featuring Sam Price on piano:\n\n[excerpt \"This Train\"]\n\nThat's a song that sets out the theology of the Pentecostal church as well as you'll ever hear it. This train is a *clean* train. You want to ride it you better get redeemed. No tobacco chewers or cigar smokers. No crap shooters. If you want to be bound for glory, you need to act holy.\n\nThere was no-one bigger than Tharpe in her genre. She is probably the first person to ever play rock and roll guitar in stadiums -- and not only that, she played rock and roll guitar in a stadium *at her wedding* -- her third wedding, to be precise, which took place at Griffith Stadium, the home of the Washington Senators and the Homestead Grays. Twenty thousand people came to see her get married and perform a gospel show afterwards, concluding with fireworks that first exploded in the shape of Tharpe playing her guitar before taking on other shapes like two hearts pierced with Cupid's arrow. Even Tharpe's half-sister had to pay for her ticket to the show. Apparently Tharpe signed the contract for her wedding seven months earlier, and then went out to find herself a husband.\n\nRosetta Tharpe's popularity started to wane in the 1950s, at least in her home country, but she retained a following in Europe. There's fascinating footage of her in 1964 filmed by Granada TV, playing at the abandoned Wilbraham Road railway station in Manchester. If you live in Manchester, as I do, that piece of track, which is now part of the Fallowfield cycle loop was the place where some of the greats of black American music were filmed for what may have been the greatest blues TV programme of all time -- along with Tharpe, there was Muddy Waters, Otis Span, Reverend Gary Davis, and Sonny Terry and Brownie McGhee, all performing in the open air in Manchester in front of an extremely earnest audience of young white British people. Fittingly for an open-air show in Manchester, Tharpe opened her short set with \"Didn't It Rain\"\n\n[Didn't It Rain TV performance excerpt]\n\nBy that time, Tharpe had become primarily known as a blues musician, even though she was still doing the same thing she'd always been doing, simply because music had moved on and recategorised her. But she'd had an influence on blues, R&B, and rock and roll music that most people didn't even realise. \"This Train\" was not written by Tharpe, exactly -- it dates back to the 1920s -- but it was definitely her version, and her rewrite, that inspired one of the most important blues records of all time:\n\n[Excerpt of \"My Babe\"]\n\nIndeed, only a few months after Rosetta Tharpe's UK performances, Gerry and the Pacemakers, one of the biggest bands of the new Merseybeat sound, who'd had three number one records that year in the UK, were recording their own version of \"My Babe\". Gerry and the Pacemakers were, in most respects, as far as you could imagine from gospel music, and yet the connection is there, closer than you'd think.\n\nRosetta Tharpe died in 1973, and never really got the recognition she deserved. She was only inducted into the Rock Hall of Fame last year. But if you've ever liked rock guitar, you've got her to thank. Shout, Sister, Shout!\n\nPatreon\nAs always, this podcast only exists because of the donations of my backers on Patreon. If you enjoy it, <a href=\"http://patreon.com/andrewhickey\">why not join them</a>?",
  "itunes:subtitle": "Welcome to episode five of A History of Rock Music in Five Hundred Songs. Today were looking at Sister Rosetta Tharpe and This Train\n\n\n\nResources\n\nAs always, Ive created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nM",
  "itunes:keywords": "Alan Lomax,Bill Doggett,boogie woogie,Carnegie Hall,Cotton Club,gospel,Ink Spots,John Hammond,LGBT+ people,Lucky Millinder,Ma Rainey,Mahalia Jackson,Malcolm X,Marie Knight,Mo Gale,Pentecostalism,racism,Sam Price,Savoy Ballroom,Sister Rosetta Tharpe,Spirituals,swing,The Jordanaires,Thomas Dorsey",
  "itunes:episodeType": "full",
  "itunes:episode": 5,
  "content:encoded": "Welcome to episode five of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at Sister Rosetta Tharpe and \"This Train\"\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-5-this-train/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nMost of Rosetta Tharpe's music is now in the public domain, so there are a lot of compilations available. <a href=\"https://amzn.to/2yQvill\">This one</a>, at three CDs for four pounds, is probably the one to get.\n\nAlmost all the information about Rosetta Tharpe's life in this episode comes from&nbsp;<a href=\"https://amzn.to/2D1F2ff\"><em>Shout, Sister, Shout!: The Untold Story of Rock-and-roll Trailblazer Sister Rosetta Tharpe</em> by Gayle F Wald,</a>\n\nFor more on Thomas Dorsey, check out&nbsp;<a href=\"https://amzn.to/2F48xj9\">The Rise of Gospel Blues: The Music of Thomas Andrew Dorsey in the Urban Church by Michael W. Harris</a>.\n\nThe Spirituals to Swing concerts are currently out of print, and the recording quality is poor enough it's&nbsp;<em>really</em> not worth paying the silly money the CDs go for second hand. But if you want to do that, you can find them <a href=\"https://amzn.to/2yPyYU7\">here</a>.\n\nAnd Rosetta Tharpe's performance at Wilbraham Road Railway Station can be found on<a href=\"https://amzn.to/2DmcJt8\"><em>&nbsp;The American Folk Blues Festival: The British Tours 1963-1966</em></a>\n\n<strong>Transcript</strong>\n\nOne of the problems when dealing with the history of rock and roll, as we touched upon the other week in the brief disclaimer episode, is the way it's dominated by men. Indeed, the story of rock and roll is the story of men crowding out women, and white men crowding out black men, and finally of rich white men crowding out poorer white men, until it eventually becomes a dull, conservative genre. Sorry if that's a spoiler, but don't say I didn't warn you when I get to the nineties.\n\nBut one black woman is as responsible as anyone for the style of rock and roll, and in particular, for its focus on the guitar.\n\nTo find out why, we're going to be making our final trip back to 1938 and Carnegie Hall.\n\nWe've talked in earlier episodes about John Hammond's legendary Spirituals to Swing concerts, and at the time I said that I'd talk some more about the ways in which they were important, but also about how they were problematic. (I know that's a word that gets overused these days, but I mean it literally -- they had problems, but weren't all bad. Far from it).\n\nOne of the most problematic aspects of them, indeed, is encoded in the name. \"From Spirituals to Swing\". It gives you a nice, simple, linear narrative -- one that was still being pushed in books I read in the 1980s. You start with the spirituals and you end with swing. It's like those diagrams of the evolution of man, with the crawling monkey on one side and the tall, oddly hairless, white man with his genitals carefully concealed on the other.\n\nThe fact is, most of the narrative about \"primitive\" music -- a narrative that was put forward by very progressive white men like John Hammond or the Lomaxes -- is deeply mistaken. The forms of music made largely by black people could sound less sophisticated in the 1930s, but that wasn't because they were atavistic survivals of more primitive forms, musical coelacanths dredged up from the depths to parade. It was because the people making the music often couldn't afford expensive instruments, and were recorded on cheaper equipment, and all the other myriad ways society makes the lives of black people, and underprivileged people in other ways, just that bit more difficult.\n\nBut this was, nonetheless, the narrative that was current in the 1930s. And so the Spirituals to Swing concerts featured a bisexual black woman who basically invented much of what would become rock guitar, an innovator if ever there was one, but portrayed her as somehow less sophisticated than the big band music on the same bill. And they did that because that innovative black woman was playing religious music.\n\nIn fact, black gospel music had grown up around the same time as the big bands. Black people had, of course, been singing in churches since their ancestors were forcibly converted to Christianity, but gospel music as we talk about it now was largely the creation of one man -- Thomas Dorsey.\n\n(This is not the same man as the white bandleader Tommy Dorsey who we've mentioned a couple of times earlier).\n\nDorsey was a blues and jazz musician, who had led the band for Ma Rainey, one of the great early blues singers, and under the name \"Georgia Tom\" he'd collaborated with Tampa Red on a series of singles. Their song \"It's Tight Like That\", from 1928, is one of the earliest hokum records, and is largely responsible for a lot of the cliches of the form -- and it sold seven million copies.\n\n[excerpt of \"It's Tight Like That\"]\n\nThat record, in itself, is one of the most important records that has ever been made -- you can trace from that song, through hokum blues, through R&B, and find its influence in basically every record made by a black American, or by anyone who's ever listened to a record made by a black American, since then. If Dorsey had only made that one record, he would have been one of the most important figures in music history.\n\nBut some time around 1930, he also started writing a whole new style of music. It combined the themes, and some of the melody, of traditional Christian hymns, with the feel of the blues and jazz music he'd been playing. It's rare that you can talk about a single person inventing a whole field of music, but gospel music as we know it basically *was* invented by Thomas Dorsey.\n\nOther people had performed gospel music before, of course, but the style was very different from anything we now think of as gospel. Dorsey was the one who pulled all the popular music idioms into it and made it into something that powered and inspired all the popular music since.\n\nHe did this because he was so torn between his faith and his work as a blues musician that he had multiple breakdowns -- at one point finding himself on stage with Ma Rainey and completely unable to move his fingers to play the piano. While he continued parallel careers for a while, eventually he settled on making religious music.&nbsp;And the songs he wrote include some of the most well-known songs of all time, like \"Peace in the Valley\" and \"Take My Hand, Precious Lord\".\n\nThat's a song he wrote in 1932, after his wife died in childbirth and his newborn son died a couple of days later. He was feeling a grief that most of us could never imagine, a pain that must have been more unbearable than anything anyone should have to suffer, and the pain came out in beauty like this:\n\n[excerpt of Rosetta Tharpe singing \"Take My Hand, Precious Lord\"]\n\nThat's not \"primitive\" music. That's not music that is unsophisticated. That's not some form of folk art. That's one man, a man who personally revolutionised music multiple times over, writing about his own personal grief and creating something that stands as great art without having to be patronised or given special consideration.\n\nAnd the person singing on that recording is Sister Rosetta Tharpe, who, like Dorsey, is someone who doesn't need to be given special treatment or be thought of as good considering her disadvantages or any of that patronising nonsense. Sister Rosetta Tharpe was one of the great singers of her generation, and one of the great guitar players of all time. And she was making music that was as modern and cutting-edge as anything else made in the 1930s and 40s. She wasn't making music that was a remnant of something that would evolve into swing, no matter what John Hammond thought, she was making important music, and music that would in the long run be seen as far more important than most of the swing bands.\n\nObviously, one should not judge Hammond too harshly. He was from another time. A primitive.\n\nSister Rosetta was brought up in, and spent her life singing for, the Church of God in Christ. As many of my listeners are in Europe, as I am myself, it's probably worth explaining what this church is, because while it does have branches outside the US, that's where it's based, and that's where most of its membership is.\n\nThe Church of God in Christ is a Pentecostal church, and it's the largest Pentecostal church in the US, and the fifth-largest church full stop. I mention that it's a Pentecostal church, because that's something you need to understand to understand Rosetta Tharpe. Pentecostals believe in something slightly different to what most other Christian denominations believe.\n\nBefore I go any further, I should point out that I am *not* an expert in theology by any means, and that what I'm going to say may well be a mischaracterisation. If you're a Pentecostal and disagree with my characterisation of your religion here, I apologise, and if you let me know I'll at least update the show notes. No disrespect is intended.\n\nWhile most Christians believe that humanity is always tainted by original sin, Pentecostals believe that it is possible for some people, if they truly believe -- if they're \"born again\" to use a term that's a little more widespread than just Pentecostalism -- to become truly holy. Those people will have all their past sins forgiven, and will then be sinless on Earth. To do this, you have to be \"baptised in the Holy Ghost\". This is different from normal baptism, what Pentecostal call \"water baptism\" -- though most Pentecostal think you should be water baptised anyway, as a precursor to the main event. Rather, this is the Holy Spirit descending from Heaven and entering you, filling you with joy and a sense of sanctity. This can often cause speaking in tongues and other strange behaviours, as people are enthused (a word which, in the original Greek, actually meant a god entering into you), and once this has happened you have the tendency to sin removed from you altogether.\n\nThis is all based on the Acts of the Apostles, specifically Acts 2:4, which describes how at the Pentecost (which is the seventh Sunday after Easter),&nbsp;\"All were filled with the Holy Spirit. They began to express themselves in foreign tongues and make bold proclamation as the Spirit prompted them\".\n\nUnlike many Protestant denominations, which adhere to Calvinist beliefs that nobody can know if they're going to Heaven or Hell, and that only God can ever know this, and that nothing you do can make a difference to your chances, most Pentecostals believe that you can definitely tell whether you're going to Heaven. You're going to Heaven once you're sanctified by the Holy Spirit, and that's an end of it.\n\nAt least, it's an end of it so long as you continue with what's called \"outward holiness\", and so you have to dress conservatively, to avoid swearing, to avoid drinking or gambling or smoking, or dancing suggestively, or wearing makeup. If you do that, once the spirit's entered into you, you're going to remain holy and free from temptation. If you don't do that, well, then the Devil might get you after all.\n\nThis is a very real fear for many Pentecostals, who have a belief in a literal heaven and hell. And it's a fear that has inspired a *lot* of the most important musicians in rock and roll. But Pentecostalism isn't just about fear and living right, it's also about that feeling of elation and exhilaration when the holy spirit enters you. And music helps bring that feeling about.\n\nIt's no surprise that a lot of the early rock and rollers went to Pentecostal churches -- at many of them, especially in the South of the US, there's a culture of absolutely wild, unrestrained, passionate music and dancing, to get people into the mood to have the spirit enter them. And Sister Rosetta Tharpe is probably the greatest performer to come out of those churches.\n\nBut while most of the performers we'll be looking at started playing secular music, Sister Rosetta never did, or at least very rarely.&nbsp;But she was, nonetheless, an example of something that we'll see a lot in the history of rock -- the pull between the spiritual and the worldly.\n\nFrom the very start of her career, Sister Rosetta was slightly different from the other gospel performers. While she lived in Chicago at the same time as Thomas Dorsey and Mahalia Jackson, she isn't generally considered part of the gospel scene that they were at the centre of -- because she was travelling round the country playing at revival meetings, rather than staying in one place. When her first marriage -- to a fellow evangelist, who apparently abused her -- broke up, she moved on to New York, and there she started playing to audiences that were very different from the churches she was used to.\n\nWhere people like Mahalia were playing church music for church people, Rosetta Tharpe was taking the gospel to the sinners. Throughout her career, she played in nightclubs and theatres, playing for any audience that would have her, and playing music that got them excited and dancing, even as she was singing about holiness.\n\nShe started playing the Cotton Club in 1938. The Cotton Club was the most famous club in New York, though in 1938 it was on its last days of relevance. It had been located in Harlem until 1936, but after riots in Harlem, it had moved to a more respectable area, and was now on Broadway.\n\nIn the twenties and early thirties, the Cotton Club had been responsible for the success of both Duke Ellington and Cab Calloway, though only Calloway was still playing there regularly by the time Rosetta Tharpe started performing there. It was still, though, the place to be seen -- at least if you were white. The Cotton Club was strictly segregated -- only black people on stage, but only white people in the audience. The black performers were there to be leered at, in the case of the showgirls, or to play up to black stereotypes. Even Duke Ellington, possibly the most sophisticated musician ever to come out of the United States, had been presented as a \"jungle musician\". The name itself -- the Cotton Club -- was trading on associations with slavery and cotton picking, and the feel of the new venue could probably be summed up by the fact that it had, on its walls, pictures of famous white bandleaders in blackface.\n\nSo it's not surprising that the performances that Sister Rosetta did at the Cotton Club were very different from the ones she'd been doing when she was travelling the country with her mother performing to church crowds. She was still playing the same music, of course -- in fact, over her career, she mostly stuck to the same quite small repertoire, rerecording the same material in new arrangements and with new emphases as she grew as an artist -- but now she was doing it as part of a parody of the very kind of church service she had grown up in and devoted her life to, with dancers pretending to be \"Holy Rollers\", mocking her religion even as her music itself was still devoted to it.\n\nOriginally, she was only taken on at the Cotton Club as a sort of trial, on a two-week engagement -- and apparently she thought the manager was joking when she was offered five hundred dollars a week, not believing she could be making that much money -- and her role was simply to be one of many acts who'd come on and do a song or two between the bigger acts who were given star billing. But she soon became a hit, and she soon got signed to Decca to make records.\n\nHer first record was, of course, a song by Thomas Dorsey, originally titled \"Hide Me in Thy Bosom\" but given the newer title \"Rock Me\" by Tharpe. Her arrangement largely stuck to Dorsey's original, with one important exception -- where he had written \"singing\", Tharpe sang \"swinging\".\n\n[excerpt of \"Rock Me\"]\n\nMany people also claimed to hear a double entendre in the lyrics to \"Rock Me\", and to think the song was about more worldly matters than Dorsey had intended. Whether Tharpe thought that or not, it almost certainly factored into the decision to make it her first single.\n\nWhen she was booked to perform at the Spirituals to Swing concerts, she performed both that song and \"That's All\", backed by Albert Ammons, one of the boogie woogie players who also appeared on the bill, and in the recording of that we can hear, rather better than in the studio recording, the raw power of Tharpe's performance.\n\n[excerpt of \"That's All\" from Carnegie Hall]\n\nThe sound quality of these recordings isn't great, of course, but you can clearly hear the enthusiasm in that performance.\n\nTharpe's performances at the Cotton Club drew a great deal of attention, and Time magazine even did a feature on her, and how she&nbsp;“Swings Same Songs in Church and Night Club.” When the Cotton Club shut down she moved on to the Cafe Society, a venue booked by John Hammond, which was an integrated club and which fit her rather better.\n\nWhile she was working there, she came to the attention of Lucky Millinder, the big band leader. Different people have different ideas as to how the two started working together -- Mo Gale, Millinder's manager, was also Chick Webb's manager, and claimed that it was his idea and that he'd seen Tharpe as being an Ella Fitzgerald to Millinder's Chick Webb, but Bill Doggett, the piano player with Millinder's band, said that it was Millinder's idea, not Gale's, to get Tharpe on board.\n\nEither way, the combination worked well enough at first, as Tharpe got to sing the same songs she'd been performing earlier -- her gospel repertoire -- but with a big band backing her. She'd also switched to playing an electric guitar rather than an acoustic, and the effect on her guitar playing was extraordinary -- where before she'd had to be a busy accompanist, constantly playing new notes due to the lack of sustain from an acoustic guitar, now she was able to play single-note lead lines and rely on the orchestra to provide the chordal pad.\n\nHer remake of \"Rock Me\" with Millinder's band, from 1941, shows just how much her artistry had improved in just three years:\n\n[excerpt of 1941 \"Rock Me\"]\n\nWith that record, she more or less invented the guitar style that T-Bone Walker, B.B. King, and others would adapt for themselves. That's just how you play electric blues now, but it wasn't how anyone played before Rosetta Tharpe.\n\nSoon after she joined Millinder's band they moved to a residency at the Savoy Ballroom, and became one of the most popular bands for dancers in New York -- regulars there included a young man known as Detroit Red, who later changed his name to Malcolm X.&nbsp; The Savoy Ballroom was closed down not long after -- allegedly for prostitution, but more likely because it allowed white women to dance with black men, and the city of New York wouldn't allow that -- although as Malcolm X said, it wasn't as if they were dragging the white women in there.\n\nHowever, Millinder's band was an odd fit for Rosetta Tharpe, and she was increasingly forced to sing secular numbers along with the gospel music she loved. There were plenty of good things about the band, of course -- she became lifelong friends with its young trumpet player, Dizzy Gillespie, for example, and she enjoyed a tour where they were on the same bill as a young vocal group, The Four Ink Spots, but she was a little bit uncomfortable singing songs like \"Tall Skinny Papa\", which wasn't particularly gospel-like\n\n[excerpt \"Tall Skinny Papa\"]\n\nAnd it's not particularly likely that she was keen on the follow-up, although she didn't sing on that one.\n\n[excerpt \"Big Fat Mama\"]\n\nSo eventually, she quit the Millinder band, without giving notice, and went back to performing entirely solo, at least at first.\n\nThis was in the middle of the musicians' union strike, but when that ended, Tharpe was back in the studio, and in September 1944 she began one of the two most important musical collaborations of her career, when she recorded \"Strange Things Happening Every Day\", with Sam Price on piano.\n\nSam Price did *not* get along with Tharpe. He insisted on her playing with a capo, because she was playing in an open tuning and wasn't playing in a normal jazz key. He didn't like the idea of combining gospel music with his boogie woogie style (eventually he was persuaded by Tharpe's mother, a gospel star in her own right who was by all accounts a fearsome and intimidating presence, that this was OK), and when the result became a massive hit, he resented that he got a flat fee.\n\nBut nonetheless, \"Strange Things Happening Every Day\" marks out the start of yet another new style for Tharpe -- and it's yet another song often credited as \"the first rock and roll record\".\n\n[Excerpt \"Strange Things Happening Every Day\"]\n\nShortly after this, Tharpe started working with another gospel singer, Marie Knight.&nbsp;Her partnership with Marie Knight may have been a partnership in more than one sense. Knight denied the relationship to the end of her days -- and it's entirely understandable that she would, given that she was a gospel singer who was devoted to a particularly conservative church, and whose career also depended on that church -- but their relationship was regarded as an open secret within the gospel music community, which had a rather more relaxed attitude to homosexuality and bisexuality than the rest of the church. Some of Tharpe's friends have described her as a secret lesbian, but given her multiple marriages to men it seems more likely that she was bi -- although of course we will never know for sure.\n\nEither way, Tharpe and Knight were a successful double act for many years, with their voices combining perfectly to provide a gospel vocal sound that was unlike anything ever recorded. They stopped working together in 1950, but remained close enough that Knight was in charge of Tharpe's funeral in 1973,\n\nThe two of them toured together -- and Tharpe toured later on her own -- in their own bus, which was driven by a white man. This gave them a number of advantages in a deeply segregated and racist country. It was considered acceptable for them to go into some public places where they otherwise wouldn't have been allowed, because they were with a white man -- if a black woman was with a white man, it was just assumed that she was sleeping with him, and unlike a white woman sleeping with a black man, this was considered absolutely acceptable, a sexual double-standard that dated back to slavery. If they needed food and the restaurant in a town was whites-only, they could send the white driver in to get them takeout. And if it came to it, if there was no hotel in town that would take black people, they could sleep on the bus.\n\nAnd segregation was so accepted at the time by so many people that even when Tharpe toured with a white vocal group, the Jordanaires (who would later find more fame backing up some country singer named Elvis something) they just thought her having her own bus was cool, and didn't even make the connection to how necessary it was for her.\n\nWhile Tharpe and Knight made many great records together, probably Tharpe's most important recording was a solo B-side to one of their singles, a 1947 remake of a song she'd first recorded in 1938, \"This Train\", again featuring Sam Price on piano:\n\n[excerpt \"This Train\"]\n\nThat's a song that sets out the theology of the Pentecostal church as well as you'll ever hear it. This train is a *clean* train. You want to ride it you better get redeemed. No tobacco chewers or cigar smokers. No crap shooters. If you want to be bound for glory, you need to act holy.\n\nThere was no-one bigger than Tharpe in her genre. She is probably the first person to ever play rock and roll guitar in stadiums -- and not only that, she played rock and roll guitar in a stadium *at her wedding* -- her third wedding, to be precise, which took place at Griffith Stadium, the home of the Washington Senators and the Homestead Grays. Twenty thousand people came to see her get married and perform a gospel show afterwards, concluding with fireworks that first exploded in the shape of Tharpe playing her guitar before taking on other shapes like two hearts pierced with Cupid's arrow. Even Tharpe's half-sister had to pay for her ticket to the show. Apparently Tharpe signed the contract for her wedding seven months earlier, and then went out to find herself a husband.\n\nRosetta Tharpe's popularity started to wane in the 1950s, at least in her home country, but she retained a following in Europe. There's fascinating footage of her in 1964 filmed by Granada TV, playing at the abandoned Wilbraham Road railway station in Manchester. If you live in Manchester, as I do, that piece of track, which is now part of the Fallowfield cycle loop was the place where some of the greats of black American music were filmed for what may have been the greatest blues TV programme of all time -- along with Tharpe, there was Muddy Waters, Otis Span, Reverend Gary Davis, and Sonny Terry and Brownie McGhee, all performing in the open air in Manchester in front of an extremely earnest audience of young white British people. Fittingly for an open-air show in Manchester, Tharpe opened her short set with \"Didn't It Rain\"\n\n[Didn't It Rain TV performance excerpt]\n\nBy that time, Tharpe had become primarily known as a blues musician, even though she was still doing the same thing she'd always been doing, simply because music had moved on and recategorised her. But she'd had an influence on blues, R&B, and rock and roll music that most people didn't even realise. \"This Train\" was not written by Tharpe, exactly -- it dates back to the 1920s -- but it was definitely her version, and her rewrite, that inspired one of the most important blues records of all time:\n\n[Excerpt of \"My Babe\"]\n\nIndeed, only a few months after Rosetta Tharpe's UK performances, Gerry and the Pacemakers, one of the biggest bands of the new Merseybeat sound, who'd had three number one records that year in the UK, were recording their own version of \"My Babe\". Gerry and the Pacemakers were, in most respects, as far as you could imagine from gospel music, and yet the connection is there, closer than you'd think.\n\nRosetta Tharpe died in 1973, and never really got the recognition she deserved. She was only inducted into the Rock Hall of Fame last year. But if you've ever liked rock guitar, you've got her to thank. Shout, Sister, Shout!\n\nPatreon\nAs always, this podcast only exists because of the donations of my backers on Patreon. If you enjoy it, <a href=\"http://patreon.com/andrewhickey\">why not join them</a>?",
  "enclosure": "",
  "itunes:summary": "Welcome to episode five of A History of Rock Music in Five Hundred Songs. Today we're looking at Sister Rosetta Tharpe and \"This Train\"\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nMost of Rosetta Tharpe's music is now in the public domain, so there are a lot of compilations available. This one, at three CDs for four pounds, is probably the one to get.\n\nAlmost all the information about Rosetta Tharpe's life in this episode comes from&nbsp;Shout, Sister, Shout!: The Untold Story of Rock-and-roll Trailblazer Sister Rosetta Tharpe by Gayle F Wald,\n\nFor more on Thomas Dorsey, check out&nbsp;The Rise of Gospel Blues: The Music of Thomas Andrew Dorsey in the Urban Church by Michael W. Harris.\n\nThe Spirituals to Swing concerts are currently out of print, and the recording quality is poor enough it's&nbsp;really not worth paying the silly money the CDs go for second hand. But if you want to do that, you can find them here.\n\nAnd Rosetta Tharpe's performance at Wilbraham Road Railway Station can be found on&nbsp;The American Folk Blues Festival: The British Tours 1963-1966\n\nTranscript\n\nOne of the problems when dealing with the history of rock and roll, as we touched upon the other week in the brief disclaimer episode, is the way it's dominated by men. Indeed, the story of rock and roll is the story of men crowding out women, and white men crowding out black men, and finally of rich white men crowding out poorer white men, until it eventually becomes a dull, conservative genre. Sorry if that's a spoiler, but don't say I didn't warn you when I get to the nineties.\n\nBut one black woman is as responsible as anyone for the style of rock and roll, and in particular, for its focus on the guitar.\n\nTo find out why, we're going to be making our final trip back to 1938 and Carnegie Hall.\n\nWe've talked in earlier episodes about John Hammond's legendary Spirituals to Swing concerts, and at the time I said that I'd talk some more about the ways in which they were important, but also about how they were problematic. (I know that's a word that gets overused these days, but I mean it literally -- they had problems, but weren't all bad. Far from it).\n\nOne of the most problematic aspects of them, indeed, is encoded in the name. \"From Spirituals to Swing\". It gives you a nice, simple, linear narrative -- one that was still being pushed in books I read in the 1980s. You start with the spirituals and you end with swing. It's like those diagrams of the evolution of man, with the crawling monkey on one side and the tall, oddly hairless, white man with his genitals carefully concealed on the other.\n\nThe fact is, most of the narrative about \"primitive\" music -- a narrative that was put forward by very progressive white men like John Hammond or the Lomaxes -- is deeply mistaken. The forms of music made largely by black people could sound less sophisticated in the 1930s, but that wasn't because they were atavistic survivals of more primitive forms, musical coelacanths dredged up from the depths to parade. It was because the people making the music often couldn't afford expensive instruments, and were recorded on cheaper equipment, and all the other myriad ways society makes the lives of black people, and underprivileged people in other ways, just that bit more difficult.\n\nBut this was, nonetheless, the narrative that was current in the 1930s. And so the Spirituals to Swing concerts featured a bisexual black woman who basically invented much of what would become rock guitar, an innovator if ever there was one, but portrayed her as somehow less sophisticated than the big band music on the same bill. And they did that because that innovative black woman was playing religious music.\n\nIn fact, black gospel music had grown up around the same time as the big bands. Black people had, of course, been singing in churches since their ancestors were forcibly converted to Christianity, but gospel musi",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode five of A History of Rock Music in Five Hundred Songs. Today we're looking at Sister Rosetta Tharpe and \"This Train\"\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nMost of Rosetta Tharpe's music is now in the public domain, so there are a lot of compilations available. This one, at three CDs for four pounds, is probably the one to get.\n\nAlmost all the information about Rosetta Tharpe's life in this episode comes from&nbsp;Shout, Sister, Shout!: The Untold Story of Rock-and-roll Trailblazer Sister Rosetta Tharpe by Gayle F Wald,\n\nFor more on Thomas Dorsey, check out&nbsp;The Rise of Gospel Blues: The Music of Thomas Andrew Dorsey in the Urban Church by Michael W. Harris.\n\nThe Spirituals to Swing concerts are currently out of print, and the recording quality is poor enough it's&nbsp;really not worth paying the silly money the CDs go for second hand. But if you want to do that, you can find them ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}