{
  "title": "The Problem With Passwords",
  "link": "https://malicious.life/the-problem-with-passwords/",
  "pubDate": "Fri, 08 May 2020 05:13:36 +0000",
  "guid": "https://malicious.life/?p=1022",
  "comments": "https://malicious.life/the-problem-with-passwords/#respond",
  "wfw:commentRss": "https://malicious.life/the-problem-with-passwords/feed/",
  "slash:comments": 0,
  "category": "Uncategorized",
  "description": "At the end of our last episode, it kind of seemed like Huawei--the Chinese telecommunications company accused of aiding in state cyberspying--was completely innocent. They were being accused of crimes they may not have committed, based on evidence that largely did not exist. The conspiracies around them seemed unfair at best, malicious at worst. But there’s another side to this story, of course. Huawei didn’t end up on people’s radars for no reason. They’ve earned their notoriety.",
  "content:encoded": "\n<p>At the end of our last episode, it kind of seemed like Huawei&#8211;the Chinese telecommunications company accused of aiding in state cyber spying&#8211;was completely innocent. They were being accused of crimes they may not have committed, based on evidence that largely did not exist. The conspiracies around them seemed unfair at best, malicious at worst. But there’s another side to this story, of course. Huawei didn’t end up on people’s radars for no reason. They’ve earned their notoriety.</p>\n\n\n\n<p></p>\n",
  "enclosure": "",
  "itunes:subtitle": "At the end of our last episode, it kind of seemed like Huawei--the Chinese telecommunications company accused of aiding in state cyberspying--was completely innocent. They were being accused of crimes they may not have committed,",
  "itunes:summary": "At the end of our last episode, it kind of seemed like Huawei--the Chinese telecommunications company accused of aiding in state cyberspying--was completely innocent. They were being accused of crimes they may not have committed, based on evidence that largely did not exist. The conspiracies around them seemed unfair at best, malicious at worst. But there’s another side to this story, of course. Huawei didn’t end up on people’s radars for no reason. They’ve earned their notoriety.",
  "itunes:author": "Cybereason",
  "itunes:image": "",
  "itunes:duration": "44:24"
}