{
  "title": "Floating Artificial Leaf Turns CO2 Into Fuel",
  "link": "https://spectrum.ieee.org/artificial-leaf-hydrogen-syngas",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-green-square-floats-on-the-water-in-front-of-buildings-and-blue-sky.jpg?id=31173420&width=1245&height=700&coordinates=0%2C306%2C0%2C307\"/><br/><br/><p>A new artificial leaf is light enough to float on water, where it can soak up sunlight and carbon dioxide from air, and use the water below to produce fuels.</p><p>Researchers at Cambridge University tested their 100-square-centimeter artificial-leaf device outdoors on a river. Depending on the catalyst used, the device either splits water to <a href=\"https://spectrum.ieee.org/researchers-tweak-artificial-photosynthesis-for-more-efficient-hydrogen-production\" target=\"_self\">produce hydrogen</a> fuel, or <a href=\"https://spectrum.ieee.org/artificial-photosynthesis-moves-on-from-water-splitting-to-co2-reduction\" target=\"_self\">converts carbon dioxide </a>into syngas, a mix of carbon monoxide and hydrogen that is used to make other fuels like methanol. Fleets of such devices could be deployed on brackish water ponds, canals, and on seas, so as not to compete with land use, they say.</p><p>“We are trying to mimic nature with an integrated, simple device that can utilize water,” says Virgil Andrei, a chemistry research fellow at the University of Cambridge who led the work, which was reported in the journal <em><a href=\"https://www.nature.com/articles/s41586-022-04978-6\" rel=\"noopener noreferrer\" target=\"_blank\">Nature</a></em>. “We have a device that not only works like a natural leaf, it also has the flexible, lightweight properties of a leaf.”</p><p>Scientists have been trying to copy the photosynthetic energy-producing ability of plants for years. The ultimate goal is an artificial leaf: a passive device that uses a photovoltaic material to harvest sunlight and then with the help of catalysts turns carbon dioxide into fuel. Since Harvard researchers reported the <a href=\"https://www.science.org/doi/pdf/10.1126/science.1209816\" target=\"_blank\">first water-splitting artificial leaf</a> in 2011, many teams have been working on similar technologies to also <a href=\"https://spectrum.ieee.org/maximum-potential-for-turning-co2-into-fuel-using-solar-energy\" target=\"_blank\">reduce carbon dioxide to make fuels</a>, fertilizers, and other chemicals. Carbon dioxide reduction is much more complicated than splitting water, and it requires the right combination of catalysts and reaction parameters. </p><p>In 2019 Andrei, chemistry professor Erwin Reisner, and their colleagues reported the <a href=\"https://www.nature.com/articles/s41563-019-0501-6\" rel=\"noopener noreferrer\" target=\"_blank\">first artificial leaf</a> that could make syngas. They used perovskite light absorbers and either platinum or cobalt catalysts for the reaction. The platinum catalyst splits water into oxygen and hydrogen in the presence of sunlight, while cobalt triggers the reduction of carbon dioxide and water into syngas. But their devices, and most others reported so far, tend to be small-scale prototypes tested only in laboratory settings.</p><p>The Cambridge team had upscaling and commercialization in mind for their new work. “We thought if we want to push this technology towards commercialization, we really need to redesign the device structure,” Andrei says. “One idea would be to shrink the device.”</p><p>So the team replaced the thick glass substrates they had used before with thin conductive plastic substrates. They coated these with layers, each a few micrometers thick, of perovskites, conductive metal-oxide and polymer, and cobalt or platinum catalyst. They used a mixture of standard epoxy glue and graphite powder to coat the layers to protect them from moisture.</p><p>The lightweight device floated in water, and under sunlight it quickly produced syngas bubbles, which further helped keep the device afloat. The artificial leaf worked well for a 24-hour test period. It produced hydrogen and carbon monoxide with efficiencies of about 0.6 percent and 0.05 percent, respectively, for each gram. That is low but comparable to natural photosynthesis, which has a typical efficiency of 0.5 to 1 percent, Andrei says. </p><p>The upside, he adds, is that you can make this device much cheaper in principle compared with other solar fuel technologies, which rely on separate photovoltaic cells and electrochemical cells to conduct the reactions and take up space on land. “You can have something very simple and light that can be deployed on water anywhere.”</p><p>Andrei says the team has not done a techno-economic analysis yet, but that they plan to do that soon. They are also working on making the device even lighter, and figuring out the best way to deploy it—be it a large plastic dome or simply a sealed plastic bag—and continuously collect the syngas or hydrogen for use.</p>",
  "pubDate": "Thu, 25 Aug 2022 12:00:00 +0000",
  "guid": "https://spectrum.ieee.org/artificial-leaf-hydrogen-syngas",
  "category": [
    "Syngas",
    "Hydrogen economy",
    "Artificial photosynthesis",
    "Solar power",
    "Artificial leaf"
  ],
  "dc:creator": "Prachi Patel",
  "media:content": ""
}