{
  "title": "Understanding the teenage brain, with Eva Telzer, PhD",
  "itunes:title": "Understanding the teenage brain, with Eva Telzer, PhD",
  "pubDate": "Wed, 24 Aug 2022 10:30:00 +0000",
  "guid": "5b4b0ee9-3350-47db-865b-8ed03bf08662",
  "link": "http://sopapa.libsyn.com/understanding-the-teenage-brain-with-eva-telzer-phd",
  "itunes:image": "",
  "description": "<div class=\"elementToProof\">There’s a common stereotype is that teenagers’ brains are immature and underdeveloped, and that teens are “hard-wired” to take unwise risks and cave to peer pressure. But psychologists’ research suggests these negative stereotypes are unfounded and that the teen years are a time opportunity and growth as well as risk. Eva Telzer, PhD, explains why teens take more risks and why that risk-taking is sometimes beneficial, why parents have more influence than they think, and how social media and other technology use may be affecting teens’ behavior and development.</div> <div class=\"elementToProof\"><br /> <br /></div> <div class=\"elementToProof\"><strong>Links</strong></div> <div class=\"elementToProof\"> </div> <div class=\"elementToProof\"> </div> <div class=\"elementToProof\"><a title=\"https://dsnlab.web.unc.edu\" href=\"https://dsnlab.web.unc.edu/\">Eva Telzer, PhD</a><br /> <a href=\"https://www.speakingofpsychology.org\">Speaking of Psychology Home Page</a></div>",
  "content:encoded": "There’s a common stereotype is that teenagers’ brains are immature and underdeveloped, and that teens are “hard-wired” to take unwise risks and cave to peer pressure. But psychologists’ research suggests these negative stereotypes are unfounded and that the teen years are a time opportunity and growth as well as risk. Eva Telzer, PhD, explains why teens take more risks and why that risk-taking is sometimes beneficial, why parents have more influence than they think, and how social media and other technology use may be affecting teens’ behavior and development.   Links     <a title=\"https://dsnlab.web.unc.edu\" href=\"https://dsnlab.web.unc.edu/\">Eva Telzer, PhD</a> <a href=\"https://www.speakingofpsychology.org\">Speaking of Psychology Home Page</a>",
  "enclosure": "",
  "itunes:duration": "30:46",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "There’s a common stereotype is that teenagers’ brains are immature and underdeveloped, and that teens are “hard-wired” to take unwise risks and cave to peer pressure. But psychologists’ research suggests these negative stereotypes are...",
  "itunes:episode": 203,
  "itunes:episodeType": "full",
  "itunes:author": "American Psychological Association"
}