{
  "title": "48: Brad Warner- Don’t Be a Jerk and Dōgen, Japan’s Greatest Zen Master",
  "pubDate": "Fri, 18 Mar 2016 19:23:20 +0000",
  "guid": "9f9bde0088302e91bbebe1fde9d2fd63",
  "link": "https://lifeonpurpose.libsyn.com/48-brad-warner-dont-be-a-jerk-and-dgen-japans-greatest-zen-master",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #48</strong>, my guest is Zen teacher and author <strong>Brad Warner</strong>, who is also a punk bassist, filmmaker, Japanese-monster-movie marketer, and popular blogger. <br /><br /><strong>Brad</strong> joined me for a great conversation about his new book <strong><em>Don’t Be a Jerk: And Other Practical Advice from Dōgen, Japan’s Greatest Zen Master</em></strong> <em>(New World Library)</em>, in which he paraphrases Dōgen’s work for modern times in his trademark style that readers have come to know and love, bringing his wisdom on topics like feminism, reincarnation, and the debate between science and religion to the forefront. <br /><br />We also discuss Dōgen's great work The Shōbōgenzō, <strong>Brad's</strong> life story, a brief history of Zen, and philosophical topics such as the notions of \"no self\", \"not knowing\", and the question of why we need to practice, if as the Buddha says, \"We are all perfect just as we are.\"<br /><br />About: <strong>Brad Warner</strong> is an ordained Zen teacher and author of the books <em>There Is No God And He Is Always With You</em> (2013), <em>Sex Sin and Zen</em> (2010), <em>Zen Wrapped in Karma Dipped in Chocolate</em> (2009), <em>Sit Down and Shut Up</em> (2007) and <em>Hardcore Zen</em> (2004).</p>\n<p>He’s also a writer for the Suicide Girls website, bass player for the hardcore punk rock group 0DFx (aka Zero Defex), star of the movies “Shoplifting From American Apparel” and “Zombie Bounty Hunter M.D.,” director of the film “Cleveland’s Screaming!” and former vice president of the US branch of the company founded by the man who created Godzilla.<br /><br />Born in Hamilton, Ohio in 1964, in 1972, <strong>Brad’s</strong> family relocated to Nairobi, Kenya. When he returned three years later, nothing about rural Ohio seemed quite the same anymore. In 1982, Brad joined 0DFx (Zero Defex), famous for an eighteen-second burst of noise titled “Drop the A-Bomb On Me.” 0DFx recently reunited and has a new CD out.<br /><br />While still playing hardcore punk, <strong>Brad</strong> became involved in Zen Buddhism. The realistic, no BS philosophy reminded him of the attitude the punks took towards music. He made it to Japan in 1993 where he began studying the philosophy with an iconoclastic rebel Zen Master named Gudo Nishijima. After a few years, Nishijima decided to make Brad his successor as a teacher of Zen.<br /><br />To learn more about <strong>Brad</strong> and his work, visit: <a href=\"http://hardcorezen.info/\" target=\"_blank\">http://hardcorezen.info/</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #48, my guest is Zen teacher and author Brad Warner, who is also a punk bassist, filmmaker, Japanese-monster-movie marketer, and popular blogger. Brad joined me for a great conversation about his new book <em>Don’t Be a Jerk: And Other Practical Advice from Dōgen, Japan’s Greatest Zen Master</em> <em>(New World Library)</em>, in which he paraphrases Dōgen’s work for modern times in his trademark style that readers have come to know and love, bringing his wisdom on topics like feminism, reincarnation, and the debate between science and religion to the forefront. We also discuss Dōgen's great work The Shōbōgenzō, Brad's life story, a brief history of Zen, and philosophical topics such as the notions of \"no self\", \"not knowing\", and the question of why we need to practice, if as the Buddha says, \"We are all perfect just as we are.\"About: Brad Warner is an ordained Zen teacher and author of the books <em>There Is No God And He Is Always With You</em> (2013), <em>Sex Sin and Zen</em> (2010), <em>Zen Wrapped in Karma Dipped in Chocolate</em> (2009), <em>Sit Down and Shut Up</em> (2007) and <em>Hardcore Zen</em> (2004).</p>\n<p>He’s also a writer for the Suicide Girls website, bass player for the hardcore punk rock group 0DFx (aka Zero Defex), star of the movies “Shoplifting From American Apparel” and “Zombie Bounty Hunter M.D.,” director of the film “Cleveland’s Screaming!” and former vice president of the US branch of the company founded by the man who created Godzilla.Born in Hamilton, Ohio in 1964, in 1972, Brad’s family relocated to Nairobi, Kenya. When he returned three years later, nothing about rural Ohio seemed quite the same anymore. In 1982, Brad joined 0DFx (Zero Defex), famous for an eighteen-second burst of noise titled “Drop the A-Bomb On Me.” 0DFx recently reunited and has a new CD out.While still playing hardcore punk, Brad became involved in Zen Buddhism. The realistic, no BS philosophy reminded him of the attitude the punks took towards music. He made it to Japan in 1993 where he began studying the philosophy with an iconoclastic rebel Zen Master named Gudo Nishijima. After a few years, Nishijima decided to make Brad his successor as a teacher of Zen.To learn more about Brad and his work, visit: <a href=\"http://hardcorezen.info/\" target=\"_blank\">http://hardcorezen.info/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "01:02:15",
  "itunes:explicit": false,
  "itunes:keywords": "philosophy",
  "itunes:subtitle": "For Life on Purpose Episode #48, my guest is Zen teacher and author Brad Warner, who is also a punk bassist, filmmaker, Japanese-monster-movie marketer, and popular blogger. Brad joined me for a great conversation about his new book Don’t Be a..."
}