{
  "title": "55. طوطی نامه - چهار دوست بلخی",
  "description": "  <p>نام کتاب: #طوطی_نامه</p><p>نویسنده : #ضیاالدین_نخشبی</p><p>&nbsp;(عارف و نویسنده قرن هشتم)</p><p>به تصحیح و تعلیقات: دکتر فتح الله مجتبایی و دکتر غلامعلی آریا</p><p>به کوشش و گویش : #ح_پرهام&nbsp;</p><p>&nbsp;ادیت فنی: گ. جاسمی و ح. عزت نژاد&nbsp;</p><p>موضوع : حکایات پند آمیز</p><p><br></p><p>ضیاالدین نخشبی از عرفا و نویسندگان قرن هشتم هجری است که جزئیات زندگانی وی به درستی آشکار نبوده و جز اشاراتی کوتاه به تاریخ و محل وفات وعناوین آثار او اطلاعی در دست نمی باشد. ضیاالدین که در اواخر سده هفتم هجری در نخشب یا نسف از شهرهای کهن ماوراءالنهر چشم به جهان گشود؛ در جوانی و مصادف با دوران تیموری رهسپار هند گردید و در حلقه پیروان سلسله چشتیه جای گرفت. نخشبی که نویسنده ای توانا، اما شاعری درجه دوم محسوب می شود، علاوه بر فارسی با زبان های عربی و سنسکریت نیز آشنایی داشت. تالیفات او آثار ادبی و عرفانی هستند که از لحاظ ارزش ادبی مشابه می باشند. \"سلک السلوک\" مهمترین و \"طوطی نامه\" از مشهورترین آثار اوست. کتاب طوطی نامه یکی از مجموعه های معروف داستان های مختلف به زبان فارسی است که ریشه هندی دارد و نام سنسکریت آن به معنای هفتاد داستان طوطی است. نویسنده اصلی این داستان نامشخص است و نخشبی تلاش نموده تا اثر را برای گروه بیشتری از عامه مردم قابل استفاده نماید. چارچوب اصلی داستان روایتی از یکی از جاتکه های بودائی است که در سندبادنامه و در کارنامه رومیان نیز مشاهده می شود. از ترجمه نخشبی چندین تلخیص فارسی در دست است که مهمترین آنها چهل طوطی می باشد.&nbsp;</p><p><br></p><p>لطفا کتاب کست را با دیگران به اشتراک بگذارید.</p><p><br></p>  ",
  "content:encoded": "  <p>نام کتاب: #طوطی_نامه</p><p>نویسنده : #ضیاالدین_نخشبی</p><p>&nbsp;(عارف و نویسنده قرن هشتم)</p><p>به تصحیح و تعلیقات: دکتر فتح الله مجتبایی و دکتر غلامعلی آریا</p><p>به کوشش و گویش : #ح_پرهام&nbsp;</p><p>&nbsp;ادیت فنی: گ. جاسمی و ح. عزت نژاد&nbsp;</p><p>موضوع : حکایات پند آمیز</p><p><br></p><p>ضیاالدین نخشبی از عرفا و نویسندگان قرن هشتم هجری است که جزئیات زندگانی وی به درستی آشکار نبوده و جز اشاراتی کوتاه به تاریخ و محل وفات وعناوین آثار او اطلاعی در دست نمی باشد. ضیاالدین که در اواخر سده هفتم هجری در نخشب یا نسف از شهرهای کهن ماوراءالنهر چشم به جهان گشود؛ در جوانی و مصادف با دوران تیموری رهسپار هند گردید و در حلقه پیروان سلسله چشتیه جای گرفت. نخشبی که نویسنده ای توانا، اما شاعری درجه دوم محسوب می شود، علاوه بر فارسی با زبان های عربی و سنسکریت نیز آشنایی داشت. تالیفات او آثار ادبی و عرفانی هستند که از لحاظ ارزش ادبی مشابه می باشند. \"سلک السلوک\" مهمترین و \"طوطی نامه\" از مشهورترین آثار اوست. کتاب طوطی نامه یکی از مجموعه های معروف داستان های مختلف به زبان فارسی است که ریشه هندی دارد و نام سنسکریت آن به معنای هفتاد داستان طوطی است. نویسنده اصلی این داستان نامشخص است و نخشبی تلاش نموده تا اثر را برای گروه بیشتری از عامه مردم قابل استفاده نماید. چارچوب اصلی داستان روایتی از یکی از جاتکه های بودائی است که در سندبادنامه و در کارنامه رومیان نیز مشاهده می شود. از ترجمه نخشبی چندین تلخیص فارسی در دست است که مهمترین آنها چهل طوطی می باشد.&nbsp;</p><p><br></p><p>لطفا کتاب کست را با دیگران به اشتراک بگذارید.</p><p><br></p>  ",
  "itunes:summary": "نام کتاب: #طوطی_نامهنویسنده : #ضیاالدین_نخشبی (عارف و نویسنده قرن هشتم)به تصحیح و تعلیقات: دکتر فتح الله مجتبایی و دکتر غلامعلی آریابه کوشش و گویش : #ح_پرهام  ادیت فنی: گ. جاسمی و ح. عزت نژاد موضوع : حکایات پند آمیزضیاالدین نخشبی از عرفا و نویسندگان قرن هشتم هجری است که جزئیات زندگانی وی به درستی آشکار نبوده و جز اشاراتی کوتاه به تاریخ و محل وفات وعناوین آثار او اطلاعی در دست نمی باشد. ضیاالدین که در اواخر سده هفتم هجری در نخشب یا نسف از شهرهای کهن ماوراءالنهر چشم به جهان گشود؛ در جوانی و مصادف با دوران تیموری رهسپار هند گردید و در حلقه پیروان سلسله چشتیه جای گرفت. نخشبی که نویسنده ای توانا، اما شاعری درجه دوم محسوب می شود، علاوه بر فارسی با زبان های عربی و سنسکریت نیز آشنایی داشت. تالیفات او آثار ادبی و عرفانی هستند که از لحاظ ارزش ادبی مشابه می باشند. \"سلک السلوک\" مهمترین و \"طوطی نامه\" از مشهورترین آثار اوست. کتاب طوطی نامه یکی از مجموعه های معروف داستان های مختلف به زبان فارسی است که ریشه هندی دارد و نام سنسکریت آن به معنای هفتاد داستان طوطی است. نویسنده اصلی این داستان نامشخص است و نخشبی تلاش نموده تا اثر را برای گروه بیشتری از عامه مردم قابل استفاده نماید. چارچوب اصلی داستان روایتی از یکی از جاتکه های بودائی است که در سندبادنامه و در کارنامه رومیان نیز مشاهده می شود. از ترجمه نخشبی چندین تلخیص فارسی در دست است که مهمترین آنها چهل طوطی می باشد. لطفا کتاب کست را با دیگران به اشتراک بگذارید.",
  "itunes:image": "",
  "enclosure": "",
  "itunes:duration": "00:21:20",
  "guid": "album-9e007181500d456d9f7d32b0b4c599ee-a5fd9ecd79054599a37245f7014c56ee",
  "pubDate": "Sat, 28 May 2022 08:30:00 +0000",
  "author": "",
  "author_picture": "",
  "castbox:tid": 476169752,
  "castbox:episode_premium": "",
  "itunes:explicit": "no",
  "itunes:season": 50
}