{
  "title": "Machine Learning Will Tackle Quantum Problems, Too",
  "link": "https://spectrum.ieee.org/machine-learning-quantum",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/vector-art-of-a-head-with-circuits-examining-a-quantum-symbol.jpg?id=31830945&width=1200&height=800&coordinates=0%2C150%2C0%2C150\"/><br/><br/><p>Quantum computers may prove far more powerful than any conventional supercomputer when it comes to performing the kinds of complex physics and chemistry simulations that could lead to <a href=\"https://spectrum.ieee.org/lithium-air-battery-quantum-computing\" target=\"_self\">next-generation batteries</a> or <a href=\"https://spectrum.ieee.org/quantum-drug\" target=\"_self\">new drugs</a>. However, it may take many years before practical and widespread quantum computing becomes reality.</p><p>Now a new study finds that <a href=\"https://spectrum.ieee.org/trustworthy-ai\" target=\"_self\">machine learning</a>, which now powers computer vision, speech recognition, and more, can also prove significantly better than regular computers at the kinds of tasks at which quantum computers excel. These findings suggest that machine learning may help tackle key quantum problems in the era before quantum computers finally arrive.</p><p>Quantum computers can theoretically achieve a “<a href=\"https://spectrum.ieee.org/quantum-computing\" target=\"_self\">quantum advantage</a>” where they can find the answers to problems no classical computers could ever solve. The more components known as qubits that a quantum computer has, the greater its computational power can grow, in an exponential fashion.</p><p class=\"pull-quote\">“If quantum computers were mature right now, it would definitely be better to use quantum computers.”<br/>—Robert Hsin-Yuan Huang, Caltech</p><p>A major application for quantum computers may be modeling complex molecules and other systems where strange quantum effects play key roles. These odd phenomena include <a href=\"https://spectrum.ieee.org/longlasting-qubits\" target=\"_self\">superposition</a>, where an object may exist in two or more places or states at the same time, and <a href=\"https://spectrum.ieee.org/what-is-quantum-entanglement\" target=\"_self\">entanglement</a>, wherein multiple bodies can influence each other instantaneously regardless of how far apart they are.</p><p>Classical computers often struggle to model quantum systems, especially ones involving many bodies. In contrast, quantum computers are themselves quantum systems, and so can theoretically solve these kinds of quantum many-body problems far more quickly.</p><p>However, quantum computers are currently <a href=\"https://spectrum.ieee.org/quantum-computing\" target=\"_self\">noisy intermediate-scale quantum</a> (NISQ) platforms, meaning their qubits number up to a few hundred at most. To prove useful for practical applications, future quantum computers will likely need thousands of qubits to help compensate for <a href=\"https://spectrum.ieee.org/fault-tolerant-quantum-computing\" target=\"_self\">errors</a>, a goal that may take many years.</p><p>In the new study, researchers investigated machine-learning algorithms, ones that improve automatically through experience, running on classical computers. They found these classical machine-learning algorithms may solve challenging quantum problems better than any other algorithm on classical computers. They detailed <u><a href=\"http://dx.doi.org/10.1126/science.abk3333\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a></u> online 22 September in the journal <em>Science</em>.</p><p>One set of applications the scientists analyzed involved finding the ground state of a molecule, the one in which it has the least amount of energy. Superposition and entanglement can make predicting a molecule’s ground state very difficult, especially when it possesses many atoms, says study lead author <a href=\"https://spectrum.ieee.org/quantum-computing\" target=\"_self\">Robert Hsin-Yuan Huan</a><a href=\"https://spectrum.ieee.org/quantum-computing\" target=\"_self\">g</a>, a quantum-information theorist at the California Institute of Technology, in Pasadena, Calif.</p><p>The researchers investigated what happened when classical machine-learning algorithms were given data on the ground states of molecules—for example, information supplied by experiments that collected quantum data from molecules. They found that such classical machine-learning algorithms could efficiently and accurately go on to predict the ground states of other molecules significantly better than other kinds of classical algorithms.</p><p>This advantage comes from how “nature operates quantum mechanically,” so data gathered from quantum experiments “contains fragments of the quantum computational power in nature,” Huang says. This means classical machine-learning algorithms that learn from this data “can predict more accurately and more efficiently than any non-machine-learning algorithm,” he adds.</p><p>All in all, when it comes to predicting ground states, a classical machine-learning algorithm “can predict more accurately than classical non-machine-learning algorithms with the same amount of computational time,” Huang says. “If we instead aim at achieving the same prediction accuracy, then classical machine learning can run <a href=\"https://en.wikipedia.org/wiki/Time_complexity#Superpolynomial_time\" rel=\"noopener noreferrer\" target=\"_blank\">super-polynomially</a> faster than classical non-machine-learning algorithms.”</p><p>Another set of applications the researchers explored was classifying a wide range of quantum phases of matter. Familiar phases of matter include the many crystal structures that ice may adopt, whereas more exotic quantum phases of matter include the kinds seen in <a href=\"https://spectrum.ieee.org/photonic-topological-insulators-2658324693\" target=\"_self\">topological insulators</a>, where electricity or light can flow without scattering or losses.</p><p>The scientists found that when classical machine-learning algorithms were trained on classical data on quantum phases, they could efficiently learn how to accurately classify quantum phases they did not encounter during training.</p><p>“It is exciting to have formal proof that classical machine-learning algorithms trained with data from physical experiments could outperform any classical non-machine-learning algorithms in an important problem in quantum physics,” Huang says. “It really shows the power of classical machine learning in addressing challenging problems in physics, chemistry, and material sciences.”</p><p>Future research can explore what other important quantum problems for which classical machine learning could do well, Huang says. Further work can also explore how to optimizing the way in which classical machine-learning algorithms can solve quantum problems, in terms of how much training data and computational time they require, he notes.</p><p>Ultimately, one day <a href=\"https://spectrum.ieee.org/quantum-computing\" target=\"_self\">quantum computers will outperform even classical machine learning when it comes to simulating chemistry and physics experiments</a>. “If quantum computers were mature right now, it would definitely be better to use quantum computers,” Huang says.</p><p>Still, until quantum computers arrive, “classical machine-learning models trained on experimental data can solve practical problems in chemistry and materials science that would be too hard to solve using classical processing alone,” Huang says.</p>",
  "pubDate": "Wed, 28 Sep 2022 13:57:08 +0000",
  "guid": "https://spectrum.ieee.org/machine-learning-quantum",
  "category": [
    "Quantum computing",
    "Chemistry",
    "Physics",
    "Quantum advantage",
    "Superposition",
    "Entanglement",
    "Nisq",
    "Topological insulators",
    "Machine learning"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}