{
  "id": "https://bibleinoneyear.org/en/youth/31",
  "title": "Day 31: How to Lead Like Jesus",
  "description": "Psalm 18:1–2, 6, Job 19:25–26, Matthew 21:1–14. Jesus is the greatest leader of all time  In the passages for today, we see some of the characteristics of Jesus’ leadership together with those of two other great influencers in the Bible – David and Job",
  "pubDate": "Mon, 31 Jan 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/31/",
  "itunes:duration": "13:01",
  "guid": "enyouth31012022-31",
  "length": 781.58,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 31: How to Lead Like Jesus",
  "itunes:subtitle": "Psalm 18:1–2, 6, Job 19:25–26, Matthew 21:1–14. Jesus is the greatest leader of all time  In the passages for today, we see some of the characteristics of Jesus’ leadership together with those of two other great influencers in the Bible – David and Job",
  "itunes:summary": "Few people have shaped the day-to-day management of people and companies more than Ken Blanchard, author of The One Minute Manager, which has sold more than 13 million copies. The book was so successful that he had trouble taking credit for its success. He began to think about God. He started to read the Bible. He went straight to the Gospels. He wanted to know what Jesus did.\nHe became fascinated with how Jesus transformed twelve ordinary, and unlikely, people into the first generation of leaders of a movement that continues to affect the course of world history 2,000 years later. He became aware that everything he had ever taught or written about effective leadership, Jesus had done to perfection way beyond Ken’s ability to portray or describe.\nJesus is more than just a spiritual leader. He gives a practical and effective leadership model for all organisations, for all people, for all situations. You may not think of yourself as a leader, but leadership is about influence. You do have influence, therefore, in a sense, all of us are leaders.\nJesus is the greatest leader of all time. In the passages for today, we see some of the characteristics of Jesus’ leadership together with those of two other great influencers in the Bible – David and Job.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 396
}