{
  "id": "yt:video:6tu0mIpX8nU",
  "yt:videoId": "6tu0mIpX8nU",
  "yt:channelId": "UCUHW94eEFW7hkUMVaZz4eDg",
  "title": "You're Technically HOTTER Than The Sun (with XKCD!)",
  "link": "",
  "author": {
    "name": "minutephysics",
    "uri": "https://www.youtube.com/channel/UCUHW94eEFW7hkUMVaZz4eDg"
  },
  "published": "2022-09-08T18:34:09+00:00",
  "updated": "2022-09-12T15:35:38+00:00",
  "media:group": {
    "media:title": "You're Technically HOTTER Than The Sun (with XKCD!)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Where to buy WHAT IF? 2 by Randall Munroe – Amazon: https://bit.ly/3Rk5Vy2 \n    Barnes and Noble: https://bit.ly/3AKwXIl  \n    Penguin Random House: https://bit.ly/3HgfucP\n    Books-A-Million: https://bit.ly/3Q4bEH3\n    Bookshop: https://bit.ly/3q26vVk\n    IndieBound: https://bit.ly/3TyhX8W\n    Apple Books: https://bit.ly/3wNNBp9\n\nFOR INTERNATIONAL EDITIONS, Including the UK and Germany, click here: https://xkcd.com/what-if-2/\n\nThe #1 New York Times bestselling author of What If? and How To answers more of the weirdest questions you never thought to ask\n \nThe millions of people around the world who read and loved What If? still have questions, and those questions are getting stranger. Thank goodness xkcd creator Randall Munroe is here to help. Planning to ride a fire pole from the Moon back to Earth? The hardest part is sticking the landing. Hoping to cool the atmosphere by opening everyone’s freezer door at the same time? Maybe it’s time for a brief introduction to thermodynamics. Want to know what would happen if you rode a helicopter blade, built a billion-story building, made a lava lamp out of lava, or jumped on a geyser as it erupted? Okay, if you insist.\n\nBefore you go on a cosmic road trip, feed the residents of New York City to a T. rex, or fill every church with bananas, be sure to consult this practical guide for impractical ideas. Unfazed by absurdity, Munroe consults the latest research on everything from swing-set physics to airliner catapult–design to answer his readers’ questions, clearly and concisely, with illuminating and occasionally terrifying illustrations. As he consistently demonstrates, you can learn a lot from examining how the world might work in very specific extreme circumstances.\n\n\nSupport MinutePhysics on Patreon! http://www.patreon.com/minutephysics&#13;\nLink to Patreon Supporters: http://www.minutephysics.com/supporters/&#13;\n&#13;\nWhat if Pluto were plutonium? And Uranus uranium? And Mercury mercury? This video is based off of a chapter of the new xkcd book \"What If? 2\"\n\nMinutePhysics is on twitter - @minutephysics&#13;\nAnd facebook - http://facebook.com/minutephysics&#13;\n\nMinute Physics provides an energetic and entertaining view of old and new problems in physics -- all in a minute!&#13;\n&#13;\nCreated by Henry Reich",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}