{
  "title": "Grokking Deep Learning",
  "description": "<p>If you passed <u>high school math</u> and can hack around in Python, <u>I want to teach you Deep Learning</u>.</p>\n\n<p><b>Edit: 50% Coupon Code:</b> \"mltrask\" (expires August 26)</p>\n\n<p>I've decided to write a <a href=\"https://manning.com/books/grokking-deep-learning?a_aid=grokkingdl&amp;a_bid=32715258\">Deep Learning book</a> in the same style as my blog, teaching Deep Learning from an <i>intuitive</i> perspective, all in Python, using only numpy. I wanted to make the <b>lowest possible barrier to entry</b> to learn Deep Learning.</p>\n\n<p>Here's what you need to know:\n<div style=\"padding-left:50px\">• High School Math (basic algebra)<br />\n• Python... the basics</div></p>\n\n<p><b>The Problem</b> with most <i>entry level</i> Deep Learning resources these days is that they either assume advanced knowledge of Calculus, Linear Algebra, Differential Equations, and perhaps even Convex Optimization, or they just teach a \"black box\" framework like Torch, Keras, or TensorFlow (where you just hit \"train\" but you don't actually know what's going on under the hood). Both have their appropriate audience, but I don't believe that either are appropriate for your average python hacker looking for a 101 on the fundamentals.</p>\n\n<p><b>My Solution</b> is to teach Deep Learning from an <i>intuitive standpoint</i>, just like I've done in the other posts on this blog. Everything you need to know to understand Deep Learning will be explained like you would to a <u>5 year old</u>, including the bits and pieces of Linear Algebra and Calculus that are necessary. You'll learn how neural networks work, and how to use them to classify images, understand language (including machine translation), and even play games.</p>\n\n<p>At the time of writing, I think that this is the only Deep Learning resource that is taught this way. I hope you enjoy it.</p>\n\n<p><b>Who This Book Is NOT For:</b> people who would rather be taught using formulas. Individuals with advanced mathematical backgrounds should choose another resource. This book is for an introduction to Deep Learning. It's about lowering the barrier to entry.</p>\n\n<p><a href=\"https://manning.com/books/grokking-deep-learning?a_aid=grokkingdl&amp;a_bid=32715258\">Click To See the Early Release Page (where the first three chapters are)</a></p>\n\n<link rel=\"stylesheet\" type=\"text/css\" href=\"/css/shCore.css\" />\n\n<link rel=\"stylesheet\" type=\"text/css\" href=\"/css/shThemeDefault.css\" />\n\n<script src=\"/js/shCore.js\"></script>\n\n<script src=\"/js/shLegacy.js\"></script>\n\n<script src=\"/js/shBrushPython.js\"></script>\n\n<script type=\"text/javascript\">\n\t// SyntaxHighlighter.config.bloggerMode = true;\n\tSyntaxHighlighter.config.toolbar = true;\n    SyntaxHighlighter.all();\n</script>",
  "pubDate": "Wed, 17 Aug 2016 12:00:00 +0000",
  "link": "https://iamtrask.github.io/2016/08/17/grokking-deep-learning/",
  "guid": "https://iamtrask.github.io/2016/08/17/grokking-deep-learning/"
}