{
  "title": "Private versus Government Health Insurance: They Are Not the Same",
  "link": "https://mises.org/node/60717",
  "description": "<p>Insurance is a market institution—i.e., it emerged through voluntary exchange aiming at satisfying the needs of the parties involved. Private health insurance should not be mistaken for public health insurance, which constitutes an element of a state’s social policy. They differ to such a great extent that one can even claim that the latter is a contradiction of the former. This essay will show the most notable differences between them.</p>\n<h4><strong>The Main Differences</strong></h4>\n<p>Firstly, insurance companies make use of advanced economic calculation which uses the calculus of probability to estimate the risk and establish appropriate premiums for particular at-risk groups. People of a lower health risk will pay lower premiums as opposed to the ones of a higher health risk. Moreover, not everybody can be insured. Differentiation of contributions and insurance coverage, as well as exclusions and limitations are to ensure that the costs incurred by the insurance companies are in an adequate relation to the premiums gained and invested. The cooperation between the actuarial<a class=\"see-footnote\" id=\"footnoteref1_u5o7epy\" title=\"Dealing with calculating the insured party’s health risk.\" href=\"#footnote1_u5o7epy\">1</a> and underwriting<a class=\"see-footnote\" id=\"footnoteref2_52haj8u\" title=\"Responsible for assessing the insured party’s risk—e.g., based on an analysis of the applications for insurance filed by potential customers.\" href=\"#footnote2_52haj8u\">2</a> departments enables such risk management, which in turn enables obtaining profits.</p>\n<p>Meanwhile, in the case of the so-called public insurance there is no risk calculation, selection, or classification. All the insured pay an obligatory contribution which is not related to a real insurance risk. It can be uniform or dependent on one’s income. Public institutions responsible for financing access to the health system do not have to fear that the insured party might leave the company. As a result, the problem of moral hazard is much more visible in public health programs, especially if the authorities plead the so-called citizen’s right to healthcare.</p>\n<p>Moral hazard is a situation in which an entity does not incur the costs of their activities despite obtaining additional benefits. In the case of public health insurance, it is a charging of a relatively lower contribution or the nonexistence of the possibility of refusal. Thus, the entity can get preferential conditions, and the additional costs are incurred by all the other people insured, which sooner or later leads to problems with medical services accessibility.</p>\n<p>Secondly, in the case of private health insurance it is usually not known who is going to need medical services. The insurance company can establish that, e.g., out of one million people, 0.5 percent will contract a particular disease, but not who it will be. In turn, in the case of public insurance next to such cases there is also a known number of people who are already ill. Therefore, there is no risk but certainty.</p>\n<p>Some believe that private insurance is only good for the young and the healthy. However, insurance companies are about adequate risk assessment for particular groups (classes). Thus, it is possible to calculate premiums corresponding to lower and higher health risk. It does not mean, though, that insurance companies will automatically accept everybody’s applications, but it should not be assumed that a person with health issues will not be insured at all. Accepting all applications might destabilize a given insurance program and lead to problems with financing access to medical services for other customers. Hence the importance of risk assessment for insurance companies.</p>\n<p>Thirdly, apart from financing access to a range of medical services, insurance companies invest a part of the contributions. Thus, the supply of savings available in the market increases, making it easier for entrepreneurs to obtain capital indispensable for creating more effective production. Meanwhile, the contributions to public insurance are consumed by the insured immediately. Thus, the insurance market contributes to the increase of savings supply and their adequate allocation in the economy, while public insurance constitutes income redistribution. Mandatory transfer of funds between particular groups of the insured is not a source of investment and does not lead to the increase of the production efficiency.</p>\n<p>Fourthly, the limitations imposed in the agreement enable a more rational consumption of medical services. They concern, among others, the time span or range of such insurance. Also, the insurance does not cover all possible occurrences due to lack of a possibility to assess the risk. It can result from a lack of sufficient data or medical knowledge. For instance, lack of sufficient information and knowledge on the development of a given illness makes it impossible to assess the costs of treatment, which translates into significant difficulties in assessing the contribution because it is now known whether it is adequate to the given risk.</p>\n<p>It is also worth mentioning that a rational consumption of such services should not be associated with their rationing, which is characteristic of public programs. Rationality of consumption means that before deciding to buy insurance a customer analyses its limitations, price, etc. They also compare it with competitive offers of other insurance companies or alternative solutions such as, e.g., medical subscription prices or the cost of direct medical services. Insurance companies also care about having conscious customers who do understand both the advantages and limitations of their products. It contributes to the development of appropriate customer attitudes. Lack of such limitations would quickly result in an increased demand for medical services available thanks to private insurance, which would result in different forms of their rationing by insurance companies wanting to avoid, e.g., an increase of contributions (prices).</p>\n<p>Additionally, apart from the insurance, if the market is not subject to any strong regulations, there are many other alternative forms of financing access to medical services and the institutions which offer them (e.g., medical chains, charities, or direct payments). Therefore, lack of insurance does not mean a complete lack of possibilities to use medical services. Public insurance or state (nonmarket) solutions do not grant a person who needs medical services any choice between competing public providers. The person’s situation worsens significantly when they cannot use those services within public insurance. For such people, private insurance or other private financial institutions offering medical services are the only option.</p>\n<p>Fifthly, private risk assessment in market insurance translates into a higher motivation to take care of one’s health. A potential insured party may be encouraged to lose weight or quit smoking by the prospect of paying lower contributions. People leading a healthy lifestyle may, in turn, be offered more favorable conditions, which can encourage others to change their diets as well. The insurance companies may also employ a range of incentives aimed at their customers, offering, e.g., a premium decrease if they score a sufficient number of points in a medical survey.</p>\n<p>Meanwhile, the motivation to take care of one’s health is lowered when it comes to public health insurance due to the lack of risk assessment. The assumption is that everybody should have equal access to the health system and that failure to lead a healthy lifestyle should not exclude or limit anybody.</p>\n<p>Sixthly, in the market conditions there are mechanisms which contribute to cost reduction and increasing the quality of medical services, which in the case of public insurance does not have to be certain and often leads to the cost/expenditure increase and a decrease in the quality of service.</p>\n<p>Insurance companies are interested in the best risk assessment possible, thanks to which they can offer premiums which would best correspond to the risk posed by a potential insured party. What is also significant is the quality of the services, which prompts insurance companies to search for appropriate providers of such services or create their own chains. Competitive processes effectively maintain costs on a low level, ensuring the profits assumed. In turn, in the case of public insurance the competitive processes are replaced with mandatory contributions and a range of regulations conditioning the operating rules of the public health system.</p>\n<h4><strong>Conclusion</strong></h4>\n<p>The differences described above show that the so-called public (state) insurance functions are based on extremely different assumptions than private insurances and besides the name they have no common characteristics. The former is inherently related to interventionism. The latter results from the bottom-up market processes. Because of those differences, it is not possible to connect those two types of insurance. Any additional interference in the health insurance market brings insurance firms closer and closer to fulfilling the redistributive function regarding financing the access to medical services. The so-called public (state) health insurances, being an element of the state’s policy, are not insurances in the word’s real meaning. They have never been and never will be. Insurance, just like money, is a market institution and only in market conditions may duly fulfil its function.</p>\n<p><em>Translated by Agnieszka Jarosz</em>.</p>\n\n<ul class=\"footnotes\"><li class=\"footnote\" id=\"footnote1_u5o7epy\"><a class=\"footnote-label\" href=\"#footnoteref1_u5o7epy\">1.</a> Dealing with calculating the insured party’s health risk.</li>\n<li class=\"footnote\" id=\"footnote2_52haj8u\"><a class=\"footnote-label\" href=\"#footnoteref2_52haj8u\">2.</a> Responsible for assessing the insured party’s risk—e.g., based on an analysis of the applications for insurance filed by potential customers.</li>\n</ul>\n",
  "author": "Łukasz Jasiński",
  "enclosure": "",
  "guid": 60717,
  "pubDate": "Wed, 02 Nov 2022 11:00:00 -0500",
  "source": "Mises Wire"
}