{
  "title": "DataQuo.net, a Narrative Way To Share And Discover Awesome Data Science Contents",
  "link": "https://medium.com/@chris_bour/dataquo-net-a-narrative-way-to-share-and-discover-awesome-data-science-contents-b3c49289cd3d?source=rss-90ca8bc640f4------2",
  "guid": "https://medium.com/p/b3c49289cd3d",
  "category": [
    "data-science",
    "machine-learning",
    "books"
  ],
  "dc:creator": "Christophe Bourguignat",
  "pubDate": "Wed, 23 Mar 2016 21:45:42 GMT",
  "atom:updated": "2016-03-23T21:45:42.613Z",
  "content:encoded": "<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/890/1*5pLnflbPZPKeXDwjIZpJJg.jpeg\" /></figure><p>We live in a data world. Data science is beautiful, but complicated, fragmented and changing fast. It’s a mess, and it’s going to be worse in the future.</p><p>As a data scientist, I was looking for a way to understand our data-centric era, both <em>simply </em>and <em>quickly</em>. I realized that the quote was the perfect solution for that.</p><h4>The unsuspected power of quotes</h4><p>As often in innovation, the idea of <a href=\"http://dataquo.net/\">DataQuo.net</a> came from a personal experience. I’m an active user of Twitter, and I like to share readings about Data in general. Through successive observations over time, I noticed that when I quoted carefully chosen article excerpts, it had<strong> much more impact</strong> than just quoting the paper headline itself.</p><p>The reason is simple : by selecting a quote, you <strong>add value</strong>. It’s a proof that you have read, understood and analyzed the paper (8 out of 10 people read only the headline). It’s not an easy exercice to ask yourself : “what would be the best quote in this article (excluded it’s title), and why ?” If you find the answer, you allow the target audience to (<em>re)</em>-discover the reading, by offering a new understanding angle.</p><p>And the magic is that <strong>people love quotes</strong>, because they are short, intense, and self-explanatory. They are the beginning of a story, and the perfect entry point for a deeper dive into a subject.</p><h4>An exchange platform for the most surprising data quotes</h4><p>On DataQuo.net, data lovers meet each other. Everyday.</p><p>For the quote producer, the site is an opportunity to share its vision, to make the world discover its exciting findings, or to surface thoughts, that otherwise would have remained unnoticed.</p><p>For the quote consumer, it’s a chance to stimulate its reflexion, to discover good readings, or simply to find original material to illustrate a PowerPoint presentation.</p><p>In a nutshell, I want people to share the best data quotes on DataQuo.net, coming from all sorts of sources : academic papers, blog posts, talks, or presentations.</p><h4>A sober platform</h4><p>DataQuo.net uses a Hacker News-style interface. I discovered it from <a href=\"http://www.datatau.com\">DataTau.com</a>, a data science forum. OK, its look and feel is a bit rude, but I like the sobriety of it’s design. It allows to focus on essence. And it has a cool usability, both on desktop and mobile devices.</p><p>What’s more, the integrated voting system allows to always have the best contents on the first page, and fresh material regularly.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/890/1*ZYYo3hcqO0fbk2PLZdHU5g.jpeg\" /></figure><h4>The bottom line : my favorite quotes of the moment</h4><p>At the moment on the platform, I’m attracted by several quotes. I like the <strong>mind-blowing</strong> ones, like</p><blockquote>If people could see in high dimensions, machine learning would not be necessary.</blockquote><p>Or :</p><blockquote>The cost of a top, world-class deep learning expert is about the same as a top NFL quarterback prospect.</blockquote><p>I also like <strong>humoristic and sarcastic quotes</strong>, like</p><blockquote>A Data Scientist is a device for turning coffee and data into better decisions.</blockquote><p>Or :</p><blockquote>The ultimate insult in Data Science : “it explains everything, but predicts nothing”.</blockquote><p>and :</p><blockquote>Statisticians, like artists, have the bad habit of falling in love with their models</blockquote><p>And finally, I’m impressed by those quotes that are so ubiquitous and perpetual :</p><blockquote>Torture the data long enough, and it will confess to anything</blockquote><p>an finally,</p><blockquote>Essentially, all models are wrong, but some are useful</blockquote><p>I hope to see you soon on <a href=\"http://dataquo.net\">DataQuo.net</a>. Discover and submit awesome data thoughts there !</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=b3c49289cd3d\" width=\"1\" height=\"1\" alt=\"\">"
}