{
  "title": "S1E22 - Training and Competing with No Regrets with World's Greatest Athlete Trey Hardee",
  "guid": "https://pinecast.com/guid/fd08bf8c-2cec-4c80-87eb-48615dd7fdc4",
  "pubDate": "Tue, 03 Nov 2020 07:30:00 -0000",
  "itunes:duration": "00:56:43",
  "description": "<p>The world’s greatest athlete, Trey Hardee, is Laura’s special guest on the podcast today.\nTrey’s many accomplishments as a decathlete include being the 2005 NCAA Outdoor champion, the 2006 NCAA Division I Men's Indoor Field Athlete of the Year, and the 2010 World Indoor heptathlon silver medalist. He is also a two-time Olympian, winning silver in London, and is only the third decathlete to ever win back-to-back World Championships.</p>\n<p>Today, Trey shares his journey all the way from his beginnings in sport to what he is busy with these days in retirement, detailing the many highs and lows along the way. In addition to discussing mentors, injuries, and coming up short in competition, he offers his thoughts on encouraging children in sports, his Olympic competitions, adopting a professional mindset, and being a commentator at the Rio Olympics. Woven throughout is his strongly held belief in having no regrets in sport or in life. If you are in need of a ‘kick in the butt’ to pursue your dreams, Trey’s inspirational story and sage advice, combined with the humility and humor with which he shares them, are precisely what you need to listen to here today.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Trey’s start in sports and athletics</li>\n<li>His motivation to start pole vaulting</li>\n<li>Children and sports</li>\n<li>A walk through of a jump and what it feels like</li>\n<li>His college experience and his start in the decathlon</li>\n<li>Trey’s transition from college to pro</li>\n<li>His first Olympic experience and its impact on him</li>\n<li>The power of a professional mindset</li>\n<li>Training for the decathlon</li>\n<li>His second Olympics</li>\n<li>The injuries he suffered in the years after the London Olympics</li>\n<li>Being a commentator at the Rio Games</li>\n<li>Having no regrets and being personally accountable</li>\n<li>His comeback in 2017</li>\n<li>Trey’s retirement and what he’s up to these days</li>\n</ul>\n<p>Quotes:</p>\n<p>“Sports became this after school daycare for me…it just became this way of life.”</p>\n<p>“Basketball was the thing that I loved.”</p>\n<p>“I’m going to show this idiot coach, like, how good of a pole vaulter I can be, and be the best doggone pole vaulter that’s ever been at this school.”</p>\n<p>“It is a hard hurdle to get over to transition into internal motivation, the real ‘why’ of why you’re out there.”</p>\n<p>“Do you want your kid to be good at sports, or do you want them to be happy and full of joy and contentment.”</p>\n<p>“Genuinely, it’s one of the most deadly sports in the world in terms of participation and catastrophic incidents…people do pass away, have permanent brain injury.”</p>\n<p>“There’s no feeling quite like it really in any other sport that I’ve tried or done.”</p>\n<p>“Really good in a lot of things, but not great at anything, that’s kind of where decathletes fall.”</p>\n<p>“The moment and everything that went along with it, I was, mentally, so unprepared for, that it just swallowed me up.”</p>\n<p>“If I really wanted to be good, and take the next step, kind of, stand on the medal stand, I needed to professionalize this, both from the preparation side, but the mental side as well.”</p>\n<p>“Coming up short when you’re giving your best can make you feel terrible.”</p>\n<p>“It is far worse to live with regret than it is to put yourself out there and fail.”</p>\n<p>“It became a beautiful thing for me to fail, and fail gloriously, because you learn so much from it.”</p>\n<p>“Regret nothing, let’s go for it.”</p>\n<p>“It was time to start being a dad and being, you know, a real family.”</p>\n<p>“I’m still…trying as many hats on as I can to find that next thing that I’m passionate about.”</p>\n<p>“It’s really important to me that I’m around and I’m available and, kind of, flexible to be a dad, all day, 24/7, and not out of commission too much.”</p>\n<p>“Don’t be afraid to put it all out there. There’s worse things in the world but non more difficult to deal with than living with regret.”</p>\n<p>Links:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a>\nMental Training:   <a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">https://www.laurawilkinson.com/learn</a>\nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a>\nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a></p>\n<p>Connect with Trey:\nHomepage:   <a href=\"http://www.treyhardee.com/\" rel=\"nofollow\">http://www.treyhardee.com/</a>\nYouTube:   <a href=\"https://www.youtube.com/user/hardeetrey\" rel=\"nofollow\">https://www.youtube.com/user/hardeetrey</a>\nInstagram:   <a href=\"https://www.instagram.com/treyhardee/\" rel=\"nofollow\">https://www.instagram.com/treyhardee/</a>\nTwitter:   <a href=\"https://twitter.com/treyhardee\" rel=\"nofollow\">https://twitter.com/treyhardee</a>\nFacebook:   <a href=\"https://www.facebook.com/treyhardee\" rel=\"nofollow\">https://www.facebook.com/treyhardee</a></p>",
  "itunes:title": "Training and Competing with No Regrets with World's Greatest Athlete Trey Hardee",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 22
}