{
  "title": "I Work in Crypto",
  "link": "",
  "published": "2022-06-11T08:30:00-04:00",
  "updated": "2022-06-11T08:30:00-04:00",
  "author": {
    "name": "Will Wolf"
  },
  "id": "tag:willwolf.io,2022-06-11:/2022/06/11/work-in-crypto/",
  "summary": "<p>I now work in crypto—building credit scoring models at <a href=\"https://www.credprotocol.com/\">Cred Protocol</a> and simulations of complex systems at <a href=\"https://block.science/\">Block Science</a>.</p>",
  "content": "<p>I <a href=\"https://willwolf.io/2021/12/04/leaving-asapp/\">left</a> ASAPP in December 2021 to \"explore\": Rust, complex systems, crypto. After ~4 months of study, podcasts, conversations, toy <a href=\"https://willwolf.io/2021/12/21/crypto-projects/\">projects</a>, Twitter, meetups, conferences, and general experimentation, I've now re-entered the workforce; I now work in crypto!</p>\n<p>Per our brave new remote world and the breadth of my technical interests, I recently started <em>two</em> new jobs in this zany new space: building credit scoring models at <a href=\"https://www.credprotocol.com/\">Cred Protocol</a> and simulations of complex systems at <a href=\"https://block.science/\">Block Science</a>. The former is my primary gig.</p>\n<h1>Cred Protocol</h1>\n<p>Cred aims to enable under-collateralized, capital efficient borrowing of cryptocurrencies by quantifying wallet risk. In other words, much like FICO's \"300-850,\" we're building a credit score. From a technical stance, credit scoring implies systems and algorithms to quantify risk—of tens of millions of crypto wallets—in near real-time. Per my longstanding interests in building systems and statistical products, my current energy to build from the ground up, and the chance to explore a world of new data, new players, new algorithms, new rules—I jumped at the opportunity to join Cred as one of its first few hires. We're currently about ~10 people.</p>\n<h1>Block Science</h1>\n<p>Ten years ago, I wrote an undergraduate <a href=\"https://honors.libraries.psu.edu/catalog/1947\">thesis</a> about the simulation of iterated Prisoner's Dilemma games on the surface of a geodesic dome. This work has remained of abiding fascination ever since. Last year, I realized that crypto offers a perfect \"arena\" for the simulation of similar \"complex systems\": a blockchain gives a graph data structure indexed by time—with copious amounts of structured, <em>public</em> data to boot! In other words, simulating the behavior of systems built on blockchains, e.g. a lending-and-borrowing protocol like <a href=\"https://aave.com/\">Aave</a>, then aligning simulated results with empirical results, is a highly tractable, useful, and interesting line of work.</p>\n<p>Block Science is a leader in doing exactly this. As a visiting contributor, I build, analyze, and communicate simulations of \"cryptoeconomic\" systems for a variety of partners. Block Science is comprised of ~30 talented and diverse members—with backgrounds spanning economics, social science, natural science, behavioral science, multi-agent systems, and more.</p>\n<h1>Join us</h1>\n<p>Both companies are hiring. If you're interested in what we do, do reach out!</p>\n<p>Will</p>\n<div class=\"footnote\">\n<hr/>\n<ol>\n<li id=\"fn:1\">\n<p>Thumbnail image credit goes <a href=\"https://jingculturecommerce.com/museum-cryptocurrency-donations/\">here</a>. <a class=\"footnote-backref\" href=\"#fnref:1\" title=\"Jump back to footnote 1 in the text\">↩</a></p>\n</li>\n</ol>\n</div>",
  "category": ""
}