{
  "id": "https://bibleinoneyear.org/en/youth/53",
  "title": "Day 53: How to Spend Time with Jesus",
  "description": "Psalm 25:1–5, Exodus 31:12–15, 32:7–12, Mark 6:30–56. Nearly always, I start by reading the Bible, as I believe it’s more important that Jesus speaks to me than I speak to him  My thoughts from each day are now the basis of these notes that accompany the *Bible in One Year*",
  "pubDate": "Tue, 22 Feb 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/53/",
  "itunes:duration": "13:11",
  "guid": "enyouth22022022-53",
  "length": 791.67,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 53: How to Spend Time with Jesus",
  "itunes:subtitle": "Psalm 25:1–5, Exodus 31:12–15, 32:7–12, Mark 6:30–56. Nearly always, I start by reading the Bible, as I believe it’s more important that Jesus speaks to me than I speak to him  My thoughts from each day are now the basis of these notes that accompany the *Bible in One Year*",
  "itunes:summary": "I first encountered Jesus in February 1974. I am so grateful to those who taught me, right from the start, the importance of what they called ‘the quiet time’.\nThe old-fashioned expression ‘the quiet time’ (meaning time set aside to read the Bible and pray) probably has its origin in the words of Jesus in today’s New Testament passage, ‘Come with me by yourselves to a quiet place’ (Mark 6:31). Practically every morning since I was eighteen years of age, I have begun the day in this way. I try to spend time with Jesus, by myself, in a quiet place. Sometimes it is very brief, sometimes it is longer. But just as I do not like beginning the day without breakfast, I cannot imagine beginning the day without spiritual food.\nNearly always, I start by reading the Bible, as I believe it’s more important that Jesus speaks to me than I speak to him. My thoughts from each day are now the basis of these notes that accompany the Bible in One Year.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 418
}