{
  "title": "S15 Ep61: Darkness Radio vs. The Unidentified: Mythical Monsters, Alien Encounters, and the Unexplained with guest Colin Dickey",
  "link": "https://audioboom.com/posts/8098462",
  "itunes:episode": 61,
  "itunes:title": "Darkness Radio vs. The Unidentified: Mythical Monsters, Alien Encounters, and the Unexplained with guest Colin Dickey",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5665,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio vs. The Unidentified: Mythical Monsters, Alien Encounters, and the Unexplained with guest Colin Dickey<br>\n<br>\nIn a world where rational, scientific explanations are more available than ever, belief in the unprovable and irrational--in fringe--is on the rise: from Atlantis to aliens, from Flat Earth to the Loch Ness monster, the list goes on. It seems the more our maps of the known world get filled in, the more we crave mysterious locations full of strange creatures.<br>\n<br>\nGet Colin's book here: <a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nGet fresh, pre-measured ingredients and mouthwatering seasonal recipes delivered right to your door with HelloFresh, America’s #1 meal kit. Go to <a href=\"http://HelloFresh.com/80darkness\">HelloFresh.com/80darkness</a> and use code 80darkness to get a total of $80 off, including free shipping on your first box. Additional restrictions apply, please visit <a href=\"http://HelloFresh.com\">HelloFresh.com</a> for more details",
  "itunes:summary": "Darkness Radio vs. The Unidentified: Mythical Monsters, Alien Encounters, and the Unexplained with guest Colin Dickey\n\nIn a world where rational, scientific explanations are more available than ever, belief in the unprovable and irrational--in...",
  "pubDate": "Sun, 26 Jul 2020 08:00:00 +0000",
  "guid": "9c2ef032-48b7-44b2-ab1f-e41404108c52",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}