{
  "title": "Federated Optimization Algorithms with Random Reshuffling and Gradient Compression. (arXiv:2206.07021v2 [cs.LG] UPDATED)",
  "link": "http://arxiv.org/abs/2206.07021",
  "description": "<p>Gradient compression is a popular technique for improving communication\ncomplexity of stochastic first-order methods in distributed training of machine\nlearning models. However, the existing works consider only with-replacement\nsampling of stochastic gradients. In contrast, it is well-known in practice and\nrecently confirmed in theory that stochastic methods based on\nwithout-replacement sampling, e.g., Random Reshuffling (RR) method, perform\nbetter than ones that sample the gradients with-replacement. In this work, we\nclose this gap in the literature and provide the first analysis of methods with\ngradient compression and without-replacement sampling. We first develop a\nna\\\"ive combination of random reshuffling with gradient compression (Q-RR).\nPerhaps surprisingly, but the theoretical analysis of Q-RR does not show any\nbenefits of using RR. Our extensive numerical experiments confirm this\nphenomenon. This happens due to the additional compression variance. To reveal\nthe true advantages of RR in the distributed learning with compression, we\npropose a new method called DIANA-RR that reduces the compression variance and\nhas provably better convergence rates than existing counterparts with\nwith-replacement sampling of stochastic gradients. Next, to have a better fit\nto Federated Learning applications, we incorporate local computation, i.e., we\npropose and analyze the variants of Q-RR and DIANA-RR -- Q-NASTYA and\nDIANA-NASTYA that use local gradient steps and different local and global\nstepsizes. Finally, we conducted several numerical experiments to illustrate\nour theoretical results.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Sadiev_A/0/1/0/all/0/1\">Abdurakhmon Sadiev</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Malinovsky_G/0/1/0/all/0/1\">Grigory Malinovsky</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Gorbunov_E/0/1/0/all/0/1\">Eduard Gorbunov</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sokolov_I/0/1/0/all/0/1\">Igor Sokolov</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Khaled_A/0/1/0/all/0/1\">Ahmed Khaled</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Burlachenko_K/0/1/0/all/0/1\">Konstantin Burlachenko</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Richtarik_P/0/1/0/all/0/1\">Peter Richt&#xe1;rik</a>"
}