{
  "title": "The Importance of Corporate Political Responsibility",
  "link": "https://sloanreview.mit.edu/article/the-importance-of-corporate-political-responsibility/",
  "comments": "https://sloanreview.mit.edu/article/the-importance-of-corporate-political-responsibility/#respond",
  "pubDate": "Mon, 24 Oct 2022 11:00:15 +0000",
  "dc:creator": "Andrew Winston, Elizabeth Doty, and Thomas Lyon. <p>Andrew Winston (<a href=\"https://twitter.com/andrewwinston\">@andrewwinston</a>) is a globally recognized expert on how to build resilient, profitable companies that help people and planet thrive. He is coauthor of <cite>Net Positive: How Courageous Companies Thrive by Giving More Than They Take</cite> (Harvard Business Review Press, 2021). Elizabeth Doty (<a href=\"https://twitter.com/elizdo\">@elizdo</a>) is the director of the Corporate Political Responsibility Taskforce at the Erb Institute at the University of Michigan and founder of Leadership Momentum, a strategy consultancy. Thomas Lyon is the Dow Professor of Sustainable Science, Technology, and Commerce at the Erb Institute.</p>\n",
  "category": [
    "Business and the Environment",
    "Environmental Sustainability",
    "Investor Relations",
    "Politics",
    "Public Policy",
    "Sustainability Strategy",
    "U.S. Public Policy",
    "Corporate Social Responsibility",
    "Financial Management & Risk",
    "Leadership",
    "Leading Change",
    "Social Responsibility"
  ],
  "description": "The business world is increasingly and genuinely inspired by the idea of building more sustainable businesses. Organizations are motivated by pressure from their employees, their customers, their investors, other stakeholders, and their own values — as well as growing clarity about the opportunities (and requirements) of the big economic and tech transitions already underway (like, [&#8230;]",
  "content:encoded": "<p></p>\n<figure class=\"article-inline\">\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/2022_1024_Winston-Doty-Lyon-1290x860-1.jpg\" alt=\"\" /><br />\n</figure>\n<p>The business world is increasingly and genuinely inspired by the idea of building more sustainable businesses. Organizations are motivated by pressure from their employees, their customers, their investors, other stakeholders, and their own values — as well as growing clarity about the opportunities (and requirements) of the big economic and tech transitions already underway (like, say, decarbonizing the whole world). </p>\n<p>The true leaders are looking beyond the reactive exercise of checking off the boxes of an environmental, social, and governance (ESG) initiative and looking to build something better — a business that thrives by serving the world. These businesses will have a net positive impact on the planet and its people by, among other things, taking responsibility for their full impacts, intended or not; serving all stakeholders, <a href=\"https://sloanreview.mit.edu/article/how-to-reconcile-your-shareholders-with-other-stakeholders/\">not just shareholders</a>; helping to solve society’s biggest challenges; and enabling the shift to a thriving, regenerative economy. Yet often these same leaders miss something critical to building a better, more positive business: the question of what they stand for and act on when they step into the public sphere. </p>\n<p></p>\n<p>Most companies rely on a dated model of engagement on policy with governments and civil society, compartmentalizing their political influence activities into an organizational silo, just as they used to do with their supply chains. (By “political influence,” we mean actions intended to influence the electoral, governing, or civic affairs processes of a nation, state, or municipality, directly or via third parties, including political spending, lobbying and advocacy, employee communication, and external communication and other influence on civic discourse.) Their trade associations — and often their own government relations departments — default to fighting all regulations, including those that would realign private interests with the public good. </p>\n<p>That can put them on the wrong side of policy changes needed to bring about the more sustainable world they often have <em>publicly</em> committed to building. This inconsistency leaves them in the crosshairs of many stakeholders and vulnerable to attack, either for failure to back up their social and environmental commitments with political action or, at the other end of the spectrum, for daring to make those societal commitments at all. Companies are managing conflicting views about <a href=\"https://sloanreview.mit.edu/article/leadership-in-an-era-of-context-collapse/\">when and how they should use their voices</a> and their political influence. </p>\n<p>A recent example is BP’s roller-coaster ride of engagement on climate policy in the state of Washington. A couple of years ago, the company spent nearly $13 million to defeat a state ballot measure to impose a carbon price. It’s easy to interpret the action as prioritizing BP’s narrow, short-term interests. But more recently, <a href=\"https://www.seattletimes.com/seattle-news/politics/new-bp-ad-campaign-calls-on-washington-legislature-to-put-a-price-on-carbon-pollution-from-fossil-fuels/\">BP supported a Washington state bill</a> that would place an overall cap on state carbon emissions. We can debate the merits of a cap or a tax, but at least BP supported new rules of the game to align market incentives with the broader public good of doing something about climate change, thus better aligning the company with its own sustainability commitments that aim to help the world get to net zero.</p>\n<p>Acting with responsibility in engaging on policy can require courage if it goes against industry dogma or if it wades into important social issues, where companies face the rising threat of political retaliation. The experience of Disney in its efforts in Florida to support LGBTQ employees and customers — and the subsequent <a href=\"https://www.cbsnews.com/losangeles/news/florida-legislature-votes-to-strip-disney-of-special-tax-status-in-a-win-for-governor-ron-desantis/\">attacks from Florida’s governor</a> — offers a cautionary tale of the challenges of doing the right thing.</p>\n<p></p>\n<p>In today’s contentious political environment, any company’s political spending can put it in tough spots, where its values or stated priorities (and <a href=\"https://sloanreview.mit.edu/article/leading-in-an-age-of-employee-activism/\">what its vocal employees may want</a>) are <a href=\"https://www.bloomberg.com/graphics/2020-election-company-campaign-finance-climate-change/\">at odds with the people it has donated to</a>. In the aggregate, these spending practices can also contribute to a political environment in which government retaliation against critics — a hallmark of authoritarianism — becomes routine. This is precisely why executives must recognize what is at stake and weigh their responsibilities thoughtfully.</p>\n<p></p>\n<h3>Navigating to a New Normal of Political Engagement</h3>\n<p>Understandably, corporate leaders worry about political gridlock and whether their countries will align on the stable policy and regulatory frameworks they need in order to thrive and follow through on their sustainability commitments. But it’s disingenuous for companies to pretend they are passive observers of regulations, laws, or the political climate. Many have purposely contributed to the gridlock they bemoan, through conflicting messages, donations, and third-party affiliations. Political spending helps companies elect leaders who represent their interests and gain access when they need it. Social media, advertising, philanthropy, and public relations can shape civic discourse and cultural beliefs, influencing voting and behavior. And with direct lobbying, companies are not just playing by the rules of the game, they are <em>shaping</em> those rules and how they are enforced.</p>\n<p>Clearly, companies need broad principles and guidelines to navigate these tricky political waters and exercise more consistency and responsibility in their influence. At a minimum, organizations should recognize the need for more principled, proactive, and integrated governance and frameworks to guide their decisions about when and how to engage in political affairs. Much of this discussion falls into the seemingly least sexy part of ESG — the governance component, which can shape how well a company manages the rest. </p>\n<p></p>\n<p>Most of the limited attention to corporate political action thus far has been about <em>transparency</em>. In the U.S., the vast majority of citizens (including most executives and investors) support political spending disclosure, and two-thirds of the S&P 500 voluntarily <a href=\"https://www.politicalaccountability.net/wp-content/uploads/2021/11/2021-CPA-Zicklin-Index.pdf\">disclose their election-related spending</a>. More recently, we have seen a gradual expansion of attention from transparency to <em>accountability</em>. Employees, investors, customers, and third-party watchdogs now regularly scrutinize whether a company’s political influences align with its stated commitments to purpose, values, sustainability, stakeholders, and business goals. </p>\n<p>Companies that strive for accountability are struggling with increasingly complex trade-offs as they confront the realities of the current U.S. political system and the <a href=\"https://hbr.org/2022/01/corporate-political-spending-is-bad-business\">hypocrisy traps</a> it creates. They wonder, “How do I align our spending with our company values? Which values do I prioritize? How do I promote policies to enable our net zero commitments while navigating the risk of lawmakers damaging our businesses with the stroke of a pen?”</p>\n<p>Happily, recognizing these challenges begins to suggest a way out. Companies need to take a broader view of their interests and shift from constantly chasing individual issues to focusing on the health of the larger systems on which business and humanity depend. This still means reacting to and addressing crises as they occur, but also taking a proactive stance and helping to strengthen the foundational systems that generate civic trust, social cohesion, and broad-based prosperity. It also means addressing the breakdowns that are generating <em>dis</em>trust. As we have engaged with decision makers on these challenges over the past year, we have found more and more leaders who are convinced of the need go beyond transparency and accountability to explore <em>corporate political responsibility</em>, or CPR. This is an idea developed by Tom and expanded by Elizabeth in her work at the University of Michigan Corporate Political Responsibility Taskforce. </p>\n<h3>Working Toward Corporate Political Responsibility</h3>\n<p>CPR is a broader take on old-school corporate social responsibility, or CSR. CPR focuses on how business influences four key systems: the rules of the game (markets, laws, and regulations), civic institutions and representation (for instance, protecting democracy), civil society and public discourse, and natural systems and societal shared resources. (See “Putting Corporate Political Responsibility Into Action.”) These four systems can help leaders think about their impacts and how they can defend and build capacity in these critical societal foundations.</p>\n<div class=\"callout-highlight callout--expand\">\n<aside class=\"l-content-wrap\">\n<article>\n<h4>Putting Corporate Political Responsibility Into Action</h4>\n<p class=\"caption\">Corporate political responsibility is a new variation of corporate social responsibility, describing the ideal ways in which businesses should engage with the key systems of society.</p>\n<table id=\"Chart#\" class=\"chart-grouped-rows no-mobile\" style=\"width: 100%\">\n<thead>\n<tr>\n<th style=\"line-height:1.5;vertical-align:bottom;width:20%\"> Foundational Systems </th>\n<th style=\"line-height:1.5;vertical-align:bottom;width:20%\"> What It Means </th>\n<th style=\"line-height:1.5;vertical-align:bottom;width:20%\"> Political Influence Channels </th>\n<th style=\"line-height:1.5;vertical-align:bottom;width:20%\"> CPR Reflection Questions </th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>\n<p>Healthy Market Rules of the Game</p>\n</td>\n<td>\n<p>The policies, regulations, tax codes, and government investments that foster a playing field for business and align private interests with the broader public good</p>\n</td>\n<td>\n<p>Lobbying and advocacy </p>\n</td>\n<td>\n<p>Do we champion rules of the game that provide long-term benefit for business and the broader society, or just lobby for short-run, narrow advantages for the company or industry?</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Healthy Civic Institutions</p>\n</td>\n<td>\n<p>Processes for electing representatives, passing legislation, establishing regulations, enforcing laws, and governing society in representative democracies</p>\n</td>\n<td>\n<p>Political spending</p>\n</td>\n<td>\n<p>Do our political influences support and protect the country’s representative democracy, the rule of law, civic freedoms, and effective, accountable civic institutions? How can we foster greater trust and a level playing field for political access?</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Healthy Civil Discourse</p>\n</td>\n<td>\n<p>How citizens participate in civic life, by gathering information, forming opinions, deliberating, and making decisions — as influenced by media, social media, civil society organizations, advertising, philanthropy, research, cultural beliefs, values, and norms</p>\n</td>\n<td>\n<p>Internal and external communication and marketing, charitable giving, and research funding</p>\n</td>\n<td>\n<p>Are we contributing to civic discourse and policy making in good faith, providing accurate information, and respecting independent, peer-reviewed science? Do our contributions help citizens make accurate, informed choices?</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Healthy Natural Systems and Societal Resources</p>\n</td>\n<td>\n<p>Society’s natural systems and other resources — including human and financial capital, and physical and technological infrastructure — which determine quality of life and the success or failure of business and society</p>\n</td>\n<td>\n<p>Indirectly driven by the other influences above</p>\n</td>\n<td>\n<p>Are our political influences contributing to adverse impacts on the biophysical and social pillars of a thriving economy and world?</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p><!--IMAGE FALLBACK FOR MOBILE BELOW --></p>\n<p>\t\t<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/Winston-Doty-Lyon_Table.png\" alt=\"Putting Corporate Political Responsibility Into Action\" class=\"no-desktop\" /> </p>\n<p class=\"attribution\">Source: The Erb Institute at the University of Michigan, and Leadership Momentum</p>\n</article>\n</aside>\n</div>\n<p>We believe that by committing to CPR and focusing on these four levels, companies can improve their own <a href=\"https://sloanreview.mit.edu/article/how-research-can-mislead-marketers-on-brand-activism/\">brand reputations</a>, make sustainable and net positive strategies achievable and more profitable, and have solid ground to stand on, with support from a range of stakeholders in the face of political blowback. </p>\n<p></p>\n<p>As a start, company leaders can engage with peers and internal and external stakeholders to consider their responsibilities at each level, exploring the CPR reflection questions included in the table here or their own inquiries. Based on these reflections, companies can prioritize actions that focus on a kind of Hippocratic oath of CPR — at the very least, to do no harm. Such a procedure also helps ensure that companies respect civil society and self-government, by prompting leaders to identify a legitimate basis for any political engagement.</p>\n<p>Beyond the benefits for companies that adopt CPR on their own, the full benefits of this approach will come from helping to establish or reinforce CPR as the norm. A more systems-oriented approach is what one of us (Andrew, along with his coauthor of the book <cite>Net Positive</cite>, Paul Polman) calls <em>net positive advocacy</em>. This entails a more systemic view of the policies and investments society needs to solve large, shared challenges. It means approaching government not as an adversary or a stakeholder to be contained and minimized but as a true partner because companies cannot be net positive businesses (or most effectively embrace CPR) solely on their own. </p>\n<p></p>\n<p>If a broad cross-section of businesses adopts a set of principles for CPR, and if they are widely accepted as meaningful and legitimate, this could represent a tipping point that would lead companies out of today’s morass. Companies can mobilize partnerships within their supply chains or industry to adopt new principles for CPR. Doing so can offer the hope of a new and level playing field — one where businesses have credibly sworn off using political contributions and backdoor lobbying to gain a narrow advantage at the expense of larger public well-being (and thus their <em>own</em> thriving over time). </p>\n<p>Critics and watchdogs can recognize companies advancing CPR in good faith, and investors can call on companies to use their political influence constructively to enable broad, long-term goals. Cross-sector partners can support and challenge lawmakers to abide by similar practices, approaching them jointly for rules that make sense and holding the line on fundamental support for representative democracy. In such a world, business leaders will be seen as partners in good faith, building a world that works for everyone. </p>\n<p></p>\n",
  "wfw:commentRss": "https://sloanreview.mit.edu/article/the-importance-of-corporate-political-responsibility/feed/",
  "slash:comments": 0
}