{
  "title": "America’s School Choice Moment Can’t Be Missed at Midterm Elections",
  "link": "https://www.heritage.org/education/commentary/americas-school-choice-moment-cant-be-missed-midterm-elections",
  "description": "<p>The politics of education have changed so much, so quickly in the COVID-19 era that universal school choice—an unattainable ideal for generations of reformers—has suddenly become a middle-of-the-road position for most Americans. </p>\n\n<p>Universal education choice should be a ripe campaign issue for state candidates this fall and the top policy priority for newly elected state legislatures in the new year. The watchword is very simple: trust parents, not bureaucracies; and fund students, not systems. </p>\n\n<p>It’s not just a slogan. In Arizona, it’s now policy. Thanks to legislation signed by Gov. Doug Ducey this summer, from now on, instead of sending dollars to school districts, every student in the state will receive $7,000 in an Education Savings Account to use at any school or for any educational approach, every year, from kindergarten through high school.  </p>\n\n<p>There is no reason other states—Texas, in particular—should not follow suit. The Lone Star State is surrounded by neighbors that have embraced education choice: Oklahoma, Arkansas, and Louisiana. And let’s be frank: because of its size and influence, Texas achieving universal school choice would create even greater momentum for passing similar legislation in other states.</p>\n\n<p><strong>>>> <a href=\"https://www.heritage.org/education/commentary/parents-lead-the-nation-school-choice\">Parents Lead the Nation on School Choice</a></strong></p>\n\n<p>Gov. Greg Abbott and the 88th Texas legislature are perfectly positioned to earn a mandate for enacting universal statewide education choice, and then to lead a state-by-state movement to make parental empowerment and ESAs the new standard of reform nationwide. </p>\n\n<p>And not far away in Florida, Gov. Ron DeSantis continues to support expansions of the state’s education savings account, voucher, and tax credit scholarship programs, which are enabling nearly 200,000 students to select a learning environment that fits their needs.</p>\n\n<p>A February poll by RealClear Opinion Research found that 72 percent of Americans (including 68 percent of Democrats) support school choice, while only 18 percent oppose. A majority of Americans now rate public schools as unsatisfactory, and some 1.2 million schoolchildren have transferred out of them since the beginning of the pandemic. Arizona, a purple state with two Democrat senators and a blue congressional delegation—just created the nation’s first universal school choice program: an education savings account option open for every single Arizona family.</p>\n\n<p>These trends may surprise political insiders who accept the media’s framing of school choice as a controversial idea. But they shouldn’t. It’s not just that most Americans support school choice; between private and magnet schools, charters, homeschooling, and parents who chose their residence for the school district, most American families already exercise some kind of school choice.</p>\n\n<p>This School Choice Moment is the silver lining of the left’s disastrous mismanagement of American schools since the COVID-19 pandemic began. The teachers' unions, elected progressives, and media elites who long styled themselves as defenders of public education now brazenly debase it: closing schools, masking and indoctrinating students in defiance of scientific and historical fact, conspiring against parental authority, even covering up crimes and siccing the FBI on moms and dads who objected. </p>\n\n<p>And lest anyone forget, America’s K-12 schools were in crisis before COVID-19. The vast majority of students perform below grade-level proficiency in reading, writing, civics, history, and math. That was the case pre-pandemic, and it continues today. Boys, in particular, have fallen so far behind that U.S. classrooms are no longer equal opportunity environments. </p>\n\n<p>The \"Great Awokening\" and COVID-theater school closures only slathered racist, homophobic, anti-family sociopathy, and anti-scientific superstition onto an already dysfunctional system desperate for reform. </p>\n\n<p>The good news is that however far Left the education establishment has lurched since 2020—\"Math is racist! Kindergartners are trans! Parents are idiots! America is evil! And oh by the way, we’re still going remote, suckers!\"—the Overton Window has shifted just as far in the opposite direction.  </p>\n\n<p>In education today, it’s the status quo that is harmful and divisive; school choice is the non-partisan compromise. </p>\n\n<p><strong>>>> <a href=\"https://www.heritage.org/education/commentary/arizona-parents-show-how-beat-the-teachers-unions\">Arizona Parents Show How To Beat the Teachers’ Unions</a></strong></p>\n\n<p>Conservatives have never had an opportunity like this on the education issue before. Come to think of it, conservatives haven’t had an opportunity like this on any issue, ever.</p>\n\n<p>We have to seize it.</p>\n\n<p>Nor is there any reason for conservative reformers to aim lower. We both support measures to protect students from the racist ideas of critical race theory in classrooms, protect girls’ sports, and the like. But conservatives should not miss the forest for the trees. </p>\n\n<p>Universal education choice would do more to combat woke indoctrination and student endangerment than all those targeted reforms put together.  </p>\n\n<p>It is not often that politics and policy line up so neatly, especially for conservatives. But right now, the question Americans are asking is not whether parental choice in education is a good idea, but instead how it should be implemented.</p>\n\n<p>Answering that question is how the right can craft a successful and popular governing agenda for years to come. </p>",
  "pubDate": "Fri, 04 Nov 2022 15:26:02 -0400",
  "dc:creator": "Kevin Roberts, Ph.D., Brooke Rollins, Greg Sindelar",
  "guid": "https://www.heritage.org/education/commentary/americas-school-choice-moment-cant-be-missed-midterm-elections"
}