{
  "title": "Statistics for Monitoring: Correlation and Clustering",
  "description": "<p><em>Finding metrics with similar behavior and analyzing internal system dependencies.</em></p>\n\n<p>There are a lot of situations when you see an unexpected change in one metric (e.g. increased latency or error rate) and need to find the cause. It could be solved by applying prior knowledge about dependencies in the system but there are still a lot of unknowns especially in case of poorly documented legacy applications. It would be great to have a tool that given a metric produces a list of other metrics it depends on based on time series data.</p>\n\n<p>There are some papers (e.g. <a href=\"http://galton.uchicago.edu/~eichler/hsss.pdf\">“Causality and graphical models in time series analysis”</a>) suggesting that it’s possible to infer dependencies from time series data but I haven’t done any experiments with it yet (R package <a href=\"http://cran.r-project.org/web/packages/vars/vignettes/vars.pdf\"><code class=\"language-plaintext highlighter-rouge\">vars</code></a> might be useful).</p>\n\n<p>For practical purposes it’s often enough to find metrics that have similarly shaped graphs. Changes in computer systems are quite fast (seconds or milliseconds) to propagate between components making it impossible to find out what changed first with typical polling intervals (10s, 60s) so it looks like dependent metrics are moving at the same time.</p>\n\n<p>There are several methods for finding similar time series:</p>\n\n<ul>\n  <li>correlation (<a href=\"http://en.wikipedia.org/wiki/Pearson_product-moment_correlation_coefficient\">Pearson</a>, <a href=\"http://en.wikipedia.org/wiki/Spearman%27s_rank_correlation_coefficient\">Spearman</a>)</li>\n  <li><a href=\"http://en.wikipedia.org/wiki/Euclidean_distance\">Euclidean distance</a></li>\n  <li><a href=\"http://en.wikipedia.org/wiki/Dynamic_time_warping\">dynamic time warping (DTW)</a></li>\n  <li><a href=\"http://en.wikipedia.org/wiki/Discrete_Fourier_transform\">discrete Fourier transform (DFT)</a></li>\n  <li><a href=\"http://en.wikipedia.org/wiki/Discrete_wavelet_transform\">discrete wavelet transform (DWT)</a></li>\n</ul>\n\n<p>Actually there are much more targeted at different use cases and the list above contains only most popular ones. The good news is that performance monitoring data is quite small in comparison with ECG and EEG data. It gives a hope that more effective methods from medical field will be used for performance monitoring too.</p>\n\n<p>First two are quite simple to understand and fast in runtime. <a href=\"http://en.wikipedia.org/wiki/Pearson_product-moment_correlation_coefficient\">Pearson correlation coefficient</a> has a simple <a href=\"http://www.analytictech.com/mb876/handouts/distance_and_correlation.htm\">relation</a> to <a href=\"http://en.wikipedia.org/wiki/Euclidean_distance\">Euclidean distance</a> for normalized data. Absolute value of correlation coefficient allows to find mirrored graphs (like disk used vs. disk free space).</p>\n\n<p><a href=\"http://en.wikipedia.org/wiki/Dynamic_time_warping\">Dynamic time warping</a> has a nice property to find slightly misaligned in time graphs but its R implementation was too slow to be useful when I tried it.</p>\n\n<p>My experiments with DFT failed because computer-generated metrics rarely have sparse representation in frequency domain. Their spectra are wide and contain a lot of frequencies. There is not so many periodical things (maybe cron jobs) going on in online request processing. There are seasonal daily/weekly/yearly changes but the typical need to compare graphs is limited by short ranges (hours or even minutes).</p>\n\n<p>DWT looks promising because <a href=\"http://en.wikipedia.org/wiki/Haar_wavelet\">Haar wavelet’s</a> shape is very similar to step-like changes usually found in performance metrics but I haven’t tried it yet.</p>\n\n<p>Sometimes production system misbehaves but you have no idea where to start from because known dependencies and similar graphs for usual suspects (metrics like error rate) lead nowhere. Going through all metrics and watching all graphs works for small systems (up to several hundreds metrics) but doesn’t work when there are thousands metrics. While trying to do that I noticed that many graphs are almost the same making it unnecessary to get through all of them.</p>\n\n<p><a href=\"http://en.wikipedia.org/wiki/Cluster_analysis\">Clustering</a> allows to group similar metrics and reduce amount of data to analyze. It makes possible to take only single representative from each group of similar metrics. I used <a href=\"http://en.wikipedia.org/wiki/Partitioning_Around_Medoids\">Partitioning Around Medoids</a> clustering algorithm and absolute value of correlation coefficient as a distance function.</p>\n\n<p><img src=\"https://mabrek.github.io/img/aspm/medoids.png\" alt=\"cluster centers (medoids)\" /></p>\n\n<p>These 4 graphs were taken from a set of cluster representatives.</p>\n\n<p>Contents of a cluster represented by the top right one:</p>\n\n<p><img src=\"https://mabrek.github.io/img/aspm/cluster19.png\" alt=\"sample cluster contents\" /></p>\n\n<p>There are 2 quite similar graphs on top (actually there were more omitted from illustration) but it contains some noisy graphs (bottom) which don’t look really similar to others. Clustering algorithm used requires exact number of clusters to be set upfront which leads to the result above because it has to assign graphs which are not similar to anything to some clusters.</p>\n\n<p><img src=\"https://mabrek.github.io/img/aspm/cluster17.png\" alt=\"sample cluster contents\" /></p>\n\n<p>This is another cluster with different contents. Top right graph looks like periodical <a href=\"http://hades.mech.northwestern.edu/index.php/RC_and_RL_Exponential_Responses\">exponential charge</a> while others are more like  <a href=\"http://en.wikipedia.org/wiki/Sawtooth_wave\">sawtooth wave</a> or <a href=\"http://en.wikipedia.org/wiki/Triangle_wave\">triangle wave</a>. Relation between those graphs is clealy non-linear.</p>\n\n<p><a href=\"http://en.wikipedia.org/wiki/Spearman%27s_rank_correlation_coefficient\">Spearman’s rank correlation coefficient</a> was used to create these clusters because it allows to catch non-linear relationships between metrics. It’s more computationally difficult than Pearson but produces better results because there are a lot of non-linear dependencies in computer-generated data. It allowed me to find misconfigured cache expiration which wiped too much data from the cache and periodically overloaded service behind the cache (note to self: don’t forget to monitor cache-miss ratio next time).</p>\n\n<p>Problems with clustering monitoring data:</p>\n\n<ul>\n  <li>\n    <p>Non-euclidean (<a href=\"http://en.wikipedia.org/wiki/Ultrametric_space\">ultrametric</a>) space. Many clustering algorithms require distance function to be <a href=\"http://en.wikipedia.org/wiki/Euclidean_metric\">Euclidean metric</a> while useful time series comparison functions (like correlation coefficient) are not. It limits set of available algorithms.</p>\n  </li>\n  <li>\n    <p>Many small clusters. There a lot of almost independent metrics which produce large number of small clusters. It makes harder to set number of clusters for algorithms that require it. If you set number of clusters too low there will be a lot of unrelated noise in each cluster but if you set the number too high the original purpose (to reduce amount of graphs to watch) will be missed.</p>\n  </li>\n  <li>\n    <p>Local clusters around events. Each event like service restart tend to gather a lot of metrics into single big cluster. It might be good for investigating outages but it’s bad for finding dependencies in a steady state. It’s better to choose quiet time range without any significant events for the latter use case.</p>\n  </li>\n  <li>\n    <p>Correlations which are not dependencies. If two metrics rise and fall at the same time their correlation coefficient will be close to 1 (or -1 for mirrored graphs) but in general <a href=\"http://en.wikipedia.org/wiki/Correlation_does_not_imply_causation\">correlation doesn’t imply causation</a>. There are a lot of cases where independent events happen at the same time like:</p>\n    <ul>\n      <li>cron jobs (e.g. log rotation)</li>\n      <li>human actions (cluster restarts, reconfigurations)</li>\n      <li>timed cache expirations</li>\n    </ul>\n  </li>\n</ul>\n\n<p>Cluster structure often tells obvious things like grouping all metrics related to a single service into one cluster. But sometimes it uncovers something new like dependency between latency of one application and disk IO of another unrelated one which turned out to be using the same storage array.</p>",
  "pubDate": "Mon, 12 May 2014 00:00:00 +0000",
  "link": "https://mabrek.github.io/blog/statistics-for-monitoring-correlation/",
  "guid": "https://mabrek.github.io/blog/statistics-for-monitoring-correlation/"
}