{
  "title": "How to Plan Your Best Garden & Harvest for a Years Worth of Food",
  "pubDate": "Sat, 06 Jan 2018 02:51:44 +0000",
  "guid": "d49180a440a83fd82cea07a395ef08f8",
  "link": "http://sites.libsyn.com/45911/how-to-plan-your-best-garden-harvest-for-a-years-worth-of-food",
  "itunes:image": "",
  "description": "<p>How we determine which crops we plant each year and how to make sure we plant enough to provide us with a full year of that food. I take you step by step through our process, even if you've never grown your garden before and don't have an inventory of home preserved food to guide you.</p> <p>Get my FREE harvest and garden planning inventory sheet to help you create your best garden and harvest ever with a full years worth of food.</p>",
  "content:encoded": "<p>How we determine which crops we plant each year and how to make sure we plant enough to provide us with a full year of that food. I take you step by step through our process, even if you've never grown your garden before and don't have an inventory of home preserved food to guide you.</p> <p>Get my FREE harvest and garden planning inventory sheet to help you create your best garden and harvest ever with a full years worth of food.</p>",
  "enclosure": "",
  "itunes:duration": "33:11",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "How we determine which crops we plant each year and how to make sure we plant enough to provide us with a full year of that food. I take you step by step through our process, even if you've never grown your garden before and don't have an inventory of...",
  "itunes:episodeType": "full",
  "author": "melissa@melissaknorris.com (Melissa K. Norris 5th Generation Homesteader)",
  "itunes:author": "Melissa K. Norris 5th Generation Homesteader",
  "itunes:summary": "How we determine which crops we plant each year and how to make sure we plant enough to provide us with a full year of that food. I take you step by step through our process, even if you've never grown your garden before and don't have an inventory of home preserved food to guide you. Get my FREE harvest and garden planning inventory sheet to help you create your best garden and harvest ever with a full years worth of food."
}