{
  "title": "Special Episode: Planes, Trains and Supply Chains",
  "description": "<p>With supply chain delays in air, ocean and trucking on the minds of investors worldwide, what could it mean for the labor market and consumers headed into the holiday season?</p><p><br></p><p>----- Transcript -----</p><p><strong>Ellen Zentner </strong>Welcome to Thoughts on the Market. I'm Ellen Zentner, Chief U.S. Economist for Morgan Stanley Research.</p><p>&nbsp;</p><p><strong>Ravi Shanker </strong>And I'm Ravi Shanker, Equity Analyst covering the North American transportation industry.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>And on this episode of the podcast, we'll be talking transportation - specifically the role of freight in tangled supply chains. It's Wednesday, October 13th at 10:00 a.m. in New York.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>So, Ravi, many listeners have likely heard recent news stories about cargo ships stuck off the California coast waiting to unload cargo into clogged ports or overworked truck drivers struggling to keep up. And there's a very human labor story here, a business story and an economic story all rolled together, and you and your team are at the center of it. So, I really wanted to talk with you to give listeners some clarity on this. Maybe we can start first with the shipping. You know, talk to us about ocean and air. You know, where are we now?</p><p>&nbsp;</p><p><strong>Ravi Shanker</strong> So, this is a very complicated problem. And like most complicated problems, there isn't an easy explanation for exactly what's going on and also not an easy solution. What's happening in ocean is a combination of many issues. You obviously have a surge in demand coming out of Asia to the rest of the world because of catch up following the pandemic and low inventory levels. In addition to that, you've had some structural problems. For instance, the giant Panamax container ships that they started using in recent years have created a bit of a boom-and-bust situations at the ports - dropping off far too many containers that can be processed, and then there's like a lull and then many more containers show up. So that's a bit of an issue. Third, there's obviously issues with labor availability of the ports themselves, given the pandemic and other reasons.</p><p>&nbsp;</p><p><strong>Ravi Shanker </strong>And lastly, as we’ll touch on in a second, there is a shortage of rail and truck capacity to evacuate these containers out of the ports. And it's a combination of all of these, plus the air freight situation. Keep in mind that kind of one of the statistics that has come out post the pandemic is that roughly 65% of global air freight moves in the in the belly of a passenger plane rather than a dedicated air freighter. And a lot of these passenger planes obviously have been grounded because of the pandemic over the last 18 months. This has eliminated a lot of the airfreight capacity. Some of that has spilled over into ocean. And so, all of this has kind of created a cascading problem, and that's kind of where we are right now.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>So let me ask a follow up there. You know, in terms of<s> </s>international air flights, it looks like international travel is picking up. But when would you expect it to be back to normal levels?</p><p>&nbsp;</p><p><strong>Ravi Shanker </strong>So I think that actually happens at some point in 2022. So, we also cover the airlines and we saw a significant amount of pent-up demand in U.S. domestic air traffic when people started getting vaccinated and when mobility restrictions were dropped. We think something very similar will happen on the international side when international restrictions are dropped, and we're already starting to see some of that take place. Whether that fixes the ocean problem completely or not is something we need to wait and watch for.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>So, you know, once we get goods here, we have to move them around. And I know I've heard you say before just how much of it has to move on the back of a truck. So, let's talk about the trucking industry. You know, there's been some structural and labor issues there, but that's even before the pandemic, right?</p><p>&nbsp;</p><p><strong>Ravi Shanker </strong>That is even before the pandemic. Kind of, you and I collaborated to write a pretty in-depth piece as early as December 2019. We revisited that last year. There are a bunch of new regulations that have gone into place in the trucking industry over the last few years. It's no coincidence that we've had two of the tightest truck markets in history in the last three years. And these factors, whether it's the ELD mandate in 2018, the Driver Drug and Alcohol Clearinghouse in 2020, some of the insurance issues that the industry has seen over the last year; those have really created a structural tightness in the trucking industry. The pandemic made things a lot worse. Obviously, it pushed some driver capacity temporarily, maybe even permanently out of the marketplace. The driving schools were largely closed for the last 18 months, and so that limited the influx of new drivers into the space. And so, some of this pressure will ease, but we think a lot of the driver and the insurance issues that we're seeing in the trucking side the last 18 months are structural and not cyclical.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>So, Ravi, it certainly does seem like the labor supply issues could stretch on for longer. If we think about demographic trends in the U.S., it does appear that generations Y and Z are really leaning away from trucking jobs and toward gig economy like jobs. Some call them new generation jobs. When you think something like driverless trucks would be in place in a way that could alleviate some of those issues, or is that so far off on the horizon?</p><p>&nbsp;</p><p><strong>Ravi Shanker </strong>We've been writing about driverless trucks since 2015, even longer than that, and we are now getting to a point where we think this can be quite real on somewhat of an investable time horizon. We think the first level for autonomous trucks will be ready for commercial use by the end of 2023 or early 2024. And we actually expect to see some very clear demonstrations of the viability of the technology and the commercial deployment of the technology within the next few months, actually. So, we think autonomous trucks can be a solution to fill that gap for the driver shortage if the demographics kind of are going to be against us for a while, and that could start happening pretty soon.</p><p>&nbsp;</p><p><strong>Ravi Shanker </strong>With the outlook in mind on the supply chain disruptions you've seen so far and what's currently taking place, Ellen, how does that inform how you look at the inventory cycle and your forecast for inflation for the overall economy?</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>It's been very complicated as, you know, about as complicated as you having to cover freight. You know, I think about the relationship that we have with our equity analysts across the firm, you know, these conversations I have with you are extremely important because it gives me a view of when can we get goods to where they need to go.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>So the inventory cycle has been delayed. There are many sectors that are running below normal inventory to sales ratios. And so, we do need production to pick up globally and we can see that exports globally are picking up. So, if I think of building a composite view of, you know, you saying air could be normalized first half of the year, but say certainly by the middle of the year. Trucking is probably going to continue to be a drag for a bit, but when I think about what you say about ocean, it sounds like all together by the middle of the year, things should start to look and move more normally. So, you're going to have a lot of inventory building that happens next year, that should have happened this year. And ironically, that's going to really add to growth, to GDP growth next year.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>Now all of this taking longer to normalize means that inflation pressures due to supply chain bottlenecks and COVID related pressures are going to remain higher for longer. All that's going to start to get alleviated around the middle of the year, but it means that we have to wait longer. And so that's how I'm thinking about it in terms of the inventory cycle and inflation. You know, it's going to support inventory building next year, but it's going to keep inflation elevated for longer.</p><p>&nbsp;</p><p><strong>Ravi Shanker </strong>Right. So, looks like light at the end of the tunnel by middle of next year, but a tricky few months still to navigate. Obviously, the biggest thing to look forward to in the next couple of months, I think, is its holiday season. And I know that in the transportation and supply chain world, everyone is working overtime to make sure that Christmas isn't canceled. What do you think Christmas season means for retailers and the broader economy?</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>Yes, I think our retail team is pretty constructive on the consumer, as are we. Buying power from consumers is very strong. That's helped by labor income, continued government support, as well as some of the savings, excess savings that we have available to pull from. But the goods have to be there as well. We know that shelves are going to be lighter. Let's put it this way, this season than normal. You know, I've heard media reports crying out, you know, do your holiday shopping now. I've heard reports of big retailers using their own ships to transport goods here, although you would sit there and tell them “Yeah, but who's going to unload it for you when it gets here?\"</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>But all in all, it doesn't sound like from our retail analysts, it's a bad set up for retail. I mean, one thing that I would think about as an economist is if you've got fewer goods through the holiday season with strong consumer demand, which we expect, well then you certainly don't have to go through a big markdown season on the other side of the holiday, which is going to support prices for longer after that. So, I think that's all an interesting combination.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>Well, I think this was a really interesting conversation, Ravi, and I think it starts to tie in some of the themes and what everyone's really focused on. It certainly has far-reaching effects across the broad economy and the global economy. So, thank you so much for taking time to talk today, Ravi.</p><p>&nbsp;</p><p><strong>Ravi Shanker </strong>Well, thanks for having me on. It's great talking with you as well, Ellen. And I think if there was one major takeaway for our listeners from this podcast, it is please shop early this holiday season.</p><p>&nbsp;</p><p><strong>Ellen Zentner</strong> Shop early, shop often. That's what I do.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>Thanks for listening. If you enjoy the show, please leave us a review on Apple Podcasts and share Thoughts on the Market with a friend or colleague today.</p>",
  "itunes:title": "Special Episode: Planes, Trains and Supply Chains",
  "itunes:episodeType": "full",
  "itunes:episode": 471,
  "itunes:summary": "With supply chain delays in air, ocean and trucking on the minds of investors worldwide, what could it mean for the labor market and consumers headed into the holiday season?",
  "content:encoded": "<p>With supply chain delays in air, ocean and trucking on the minds of investors worldwide, what could it mean for the labor market and consumers headed into the holiday season?</p><p><br></p><p>----- Transcript -----</p><p><strong>Ellen Zentner </strong>Welcome to Thoughts on the Market. I'm Ellen Zentner, Chief U.S. Economist for Morgan Stanley Research.</p><p>&nbsp;</p><p><strong>Ravi Shanker </strong>And I'm Ravi Shanker, Equity Analyst covering the North American transportation industry.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>And on this episode of the podcast, we'll be talking transportation - specifically the role of freight in tangled supply chains. It's Wednesday, October 13th at 10:00 a.m. in New York.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>So, Ravi, many listeners have likely heard recent news stories about cargo ships stuck off the California coast waiting to unload cargo into clogged ports or overworked truck drivers struggling to keep up. And there's a very human labor story here, a business story and an economic story all rolled together, and you and your team are at the center of it. So, I really wanted to talk with you to give listeners some clarity on this. Maybe we can start first with the shipping. You know, talk to us about ocean and air. You know, where are we now?</p><p>&nbsp;</p><p><strong>Ravi Shanker</strong> So, this is a very complicated problem. And like most complicated problems, there isn't an easy explanation for exactly what's going on and also not an easy solution. What's happening in ocean is a combination of many issues. You obviously have a surge in demand coming out of Asia to the rest of the world because of catch up following the pandemic and low inventory levels. In addition to that, you've had some structural problems. For instance, the giant Panamax container ships that they started using in recent years have created a bit of a boom-and-bust situations at the ports - dropping off far too many containers that can be processed, and then there's like a lull and then many more containers show up. So that's a bit of an issue. Third, there's obviously issues with labor availability of the ports themselves, given the pandemic and other reasons.</p><p>&nbsp;</p><p><strong>Ravi Shanker </strong>And lastly, as we’ll touch on in a second, there is a shortage of rail and truck capacity to evacuate these containers out of the ports. And it's a combination of all of these, plus the air freight situation. Keep in mind that kind of one of the statistics that has come out post the pandemic is that roughly 65% of global air freight moves in the in the belly of a passenger plane rather than a dedicated air freighter. And a lot of these passenger planes obviously have been grounded because of the pandemic over the last 18 months. This has eliminated a lot of the airfreight capacity. Some of that has spilled over into ocean. And so, all of this has kind of created a cascading problem, and that's kind of where we are right now.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>So let me ask a follow up there. You know, in terms of<s> </s>international air flights, it looks like international travel is picking up. But when would you expect it to be back to normal levels?</p><p>&nbsp;</p><p><strong>Ravi Shanker </strong>So I think that actually happens at some point in 2022. So, we also cover the airlines and we saw a significant amount of pent-up demand in U.S. domestic air traffic when people started getting vaccinated and when mobility restrictions were dropped. We think something very similar will happen on the international side when international restrictions are dropped, and we're already starting to see some of that take place. Whether that fixes the ocean problem completely or not is something we need to wait and watch for.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>So, you know, once we get goods here, we have to move them around. And I know I've heard you say before just how much of it has to move on the back of a truck. So, let's talk about the trucking industry. You know, there's been some structural and labor issues there, but that's even before the pandemic, right?</p><p>&nbsp;</p><p><strong>Ravi Shanker </strong>That is even before the pandemic. Kind of, you and I collaborated to write a pretty in-depth piece as early as December 2019. We revisited that last year. There are a bunch of new regulations that have gone into place in the trucking industry over the last few years. It's no coincidence that we've had two of the tightest truck markets in history in the last three years. And these factors, whether it's the ELD mandate in 2018, the Driver Drug and Alcohol Clearinghouse in 2020, some of the insurance issues that the industry has seen over the last year; those have really created a structural tightness in the trucking industry. The pandemic made things a lot worse. Obviously, it pushed some driver capacity temporarily, maybe even permanently out of the marketplace. The driving schools were largely closed for the last 18 months, and so that limited the influx of new drivers into the space. And so, some of this pressure will ease, but we think a lot of the driver and the insurance issues that we're seeing in the trucking side the last 18 months are structural and not cyclical.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>So, Ravi, it certainly does seem like the labor supply issues could stretch on for longer. If we think about demographic trends in the U.S., it does appear that generations Y and Z are really leaning away from trucking jobs and toward gig economy like jobs. Some call them new generation jobs. When you think something like driverless trucks would be in place in a way that could alleviate some of those issues, or is that so far off on the horizon?</p><p>&nbsp;</p><p><strong>Ravi Shanker </strong>We've been writing about driverless trucks since 2015, even longer than that, and we are now getting to a point where we think this can be quite real on somewhat of an investable time horizon. We think the first level for autonomous trucks will be ready for commercial use by the end of 2023 or early 2024. And we actually expect to see some very clear demonstrations of the viability of the technology and the commercial deployment of the technology within the next few months, actually. So, we think autonomous trucks can be a solution to fill that gap for the driver shortage if the demographics kind of are going to be against us for a while, and that could start happening pretty soon.</p><p>&nbsp;</p><p><strong>Ravi Shanker </strong>With the outlook in mind on the supply chain disruptions you've seen so far and what's currently taking place, Ellen, how does that inform how you look at the inventory cycle and your forecast for inflation for the overall economy?</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>It's been very complicated as, you know, about as complicated as you having to cover freight. You know, I think about the relationship that we have with our equity analysts across the firm, you know, these conversations I have with you are extremely important because it gives me a view of when can we get goods to where they need to go.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>So the inventory cycle has been delayed. There are many sectors that are running below normal inventory to sales ratios. And so, we do need production to pick up globally and we can see that exports globally are picking up. So, if I think of building a composite view of, you know, you saying air could be normalized first half of the year, but say certainly by the middle of the year. Trucking is probably going to continue to be a drag for a bit, but when I think about what you say about ocean, it sounds like all together by the middle of the year, things should start to look and move more normally. So, you're going to have a lot of inventory building that happens next year, that should have happened this year. And ironically, that's going to really add to growth, to GDP growth next year.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>Now all of this taking longer to normalize means that inflation pressures due to supply chain bottlenecks and COVID related pressures are going to remain higher for longer. All that's going to start to get alleviated around the middle of the year, but it means that we have to wait longer. And so that's how I'm thinking about it in terms of the inventory cycle and inflation. You know, it's going to support inventory building next year, but it's going to keep inflation elevated for longer.</p><p>&nbsp;</p><p><strong>Ravi Shanker </strong>Right. So, looks like light at the end of the tunnel by middle of next year, but a tricky few months still to navigate. Obviously, the biggest thing to look forward to in the next couple of months, I think, is its holiday season. And I know that in the transportation and supply chain world, everyone is working overtime to make sure that Christmas isn't canceled. What do you think Christmas season means for retailers and the broader economy?</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>Yes, I think our retail team is pretty constructive on the consumer, as are we. Buying power from consumers is very strong. That's helped by labor income, continued government support, as well as some of the savings, excess savings that we have available to pull from. But the goods have to be there as well. We know that shelves are going to be lighter. Let's put it this way, this season than normal. You know, I've heard media reports crying out, you know, do your holiday shopping now. I've heard reports of big retailers using their own ships to transport goods here, although you would sit there and tell them “Yeah, but who's going to unload it for you when it gets here?\"</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>But all in all, it doesn't sound like from our retail analysts, it's a bad set up for retail. I mean, one thing that I would think about as an economist is if you've got fewer goods through the holiday season with strong consumer demand, which we expect, well then you certainly don't have to go through a big markdown season on the other side of the holiday, which is going to support prices for longer after that. So, I think that's all an interesting combination.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>Well, I think this was a really interesting conversation, Ravi, and I think it starts to tie in some of the themes and what everyone's really focused on. It certainly has far-reaching effects across the broad economy and the global economy. So, thank you so much for taking time to talk today, Ravi.</p><p>&nbsp;</p><p><strong>Ravi Shanker </strong>Well, thanks for having me on. It's great talking with you as well, Ellen. And I think if there was one major takeaway for our listeners from this podcast, it is please shop early this holiday season.</p><p>&nbsp;</p><p><strong>Ellen Zentner</strong> Shop early, shop often. That's what I do.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>Thanks for listening. If you enjoy the show, please leave us a review on Apple Podcasts and share Thoughts on the Market with a friend or colleague today.</p>",
  "guid": "gid://art19-episode-locator/V0/cGLTkDPrn0PVJH5QeGslzsxAedTsNbXaWZJhTT8Dd6o",
  "pubDate": "Wed, 13 Oct 2021 23:12:18 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:duration": "00:09:26",
  "enclosure": ""
}