{
  "id": "yt:video:o4ELd69ZgcI",
  "yt:videoId": "o4ELd69ZgcI",
  "yt:channelId": "UCrlZs71h3mTR45FgQNINfrg",
  "title": "From miller to entering Cambridge at age 40 - George Green",
  "link": "",
  "author": {
    "name": "Mathemaniac",
    "uri": "https://www.youtube.com/channel/UCrlZs71h3mTR45FgQNINfrg"
  },
  "published": "2021-06-30T15:00:12+00:00",
  "updated": "2022-09-26T17:08:57+00:00",
  "media:group": {
    "media:title": "From miller to entering Cambridge at age 40 - George Green",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This is the legend of George Green (1793 - 1841), a mathematician / physicist, \"son of a miller\". First time going outside to film, and I only have my phone, so I'm really sorry that the video quality is not very good.\n\nGreen's theorem, identities, and functions are immensely useful in 19th century physics, and even in the 20th century for quantum electrodynamics, but not a lot of people know who this person is, unless you have been to college or uni. When Albert Einstein, Julian Schwinger, Lord Kelvin, Sturm and Liouville all speak very highly of Green, yet not everyone knows who he is, is a little bit sad... This is really an injustice, so I hope to bring this mathematician to more attention so that people recognise his efforts in mathematical physics. \n\nThis video was made because I remember my lecturer talked about George Green only being a miller while he discovered Green's theorem, so I decided to look more into the story and continued to be amazed. Hopefully you are as well!\n\n(Please don't tell the Cambridge University Library about this, because I don't think posting stuff about the library on the internet is allowed. Shhhhh...)\n\nThis is hopefully a new side of Mathemaniac you haven't seen before, but the next video is going to be a more typical one. There are loads of stuff that I came across in the research, primarily by reading Cannell's biography, that I haven't put into the video, just because I don't feel like this is too relevant to the whole story, but this is just to tell you that there is a lot more history going on behind the scenes, e.g. why did Green use Leibniz notation throughout the paper, while the majority of the UK was still using Newton's notation? If you want to know, refer to the biography!\n\nCorrection: 9:25 The German journal name should be Klassiker der Exacten Wissenschaf*t*en instead.\n\nSOURCES:\n1) Cannell, D. M., and Society for Industrial Applied Mathematics, George Green, Mathematician & Physicist, 1793-1841 : the Background to His Life and Work, 2nd ed. (Philadelphia: Society for Industrial and Applied Mathematics, 2001)\n\n2) \"The Green of Green's functions\" from the University of Nottingham: https://www.nottingham.ac.uk/physics/documents/historical/greenphystoday1203.pdf\n\n3) \"An Essay on the Application of Mathematical Analysis to the Theories of Electricity and Magnetism\" by George Green, online here: https://arxiv.org/pdf/0807.0088.pdf\n\nWHAT'S USED IN THIS VIDEO:\n1) Einstein in Nottingham (on YouTube): https://www.youtube.com/watch?v=161UNSza_qk\nNote: This is not really the instance where he said \"Green was 20 years ahead of his time\", but the only footage I could find that sort of represents Einstein's visit to Nottingham back then.\n\n2) Music used: \nNine Lives - Unicorn Heads\nNight Run Away -  An Jone\nWolf Moon - Unicorn Heads\n(All from YouTube Audio Library)\n\nFURTHER READING:\n1) George Green: An Enigmatic Mathematician, by D.M. Cannell: https://www.jstor.org/stable/2589050?seq=13#metadata_info_tab_contents\n\n2) Einstein's Blackboard (Periodic Videos): https://www.youtube.com/watch?v=KIwpGEvmgvs\nOther than commenting on the video, you are very welcome to fill in a Google form linked below, which helps me make better videos by catering for your math levels:\nhttps://forms.gle/QJ29hocF9uQAyZyH6\n\n3) Math/Maths History Tour of Nottingham - George Green: Miller, Mathematician, and Physicist: https://www.youtube.com/watch?v=vK9NQ6e6rng\n\n4) Green's Functions (Sixty Symbols): https://www.youtube.com/watch?v=ji-i6XCkgC0\nNote: Yes, I know this is similar to what I did in this video, but hopefully slightly more researched, and a completely different style.\n\nIf you want to know more interesting Mathematics, stay tuned for the next video!\n\nSUBSCRIBE and see you in the next video!\n\nIf you are wondering how I made all these videos, even though it is stylistically similar to 3Blue1Brown, I don't use his animation engine Manim, but I will probably reveal how I did it in a potential subscriber milestone, so do subscribe!\n\nSocial media:\n\nFacebook: https://www.facebook.com/mathemaniacyt\nInstagram: https://www.instagram.com/_mathemaniac_/\nTwitter: https://twitter.com/mathemaniacyt\nPatreon: https://www.patreon.com/mathemaniac (support if you want to and can afford to!)\n\nFor my contact email, check my About page on a PC.\n\nSee you next time!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}