{
  "id": "yt:video:yOoxQT0m5LQ",
  "yt:videoId": "yOoxQT0m5LQ",
  "yt:channelId": "UCW39zufHfsuGgpLviKh297Q",
  "title": "Morocco: Sights set on progress - Mediterranean journey | DW Documentary",
  "link": "",
  "author": {
    "name": "DW Documentary",
    "uri": "https://www.youtube.com/channel/UCW39zufHfsuGgpLviKh297Q"
  },
  "published": "2022-10-30T17:00:42+00:00",
  "updated": "2022-10-30T17:00:43+00:00",
  "media:group": {
    "media:title": "Morocco: Sights set on progress - Mediterranean journey | DW Documentary",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "At the end of their Mediterranean journey, Sineb El Masrar shows Jaafar Abdul Karim her parents’ country. In Morocco, the two visit Tangier’s souk and its old city, with its view across the strait of Gibraltar to Europe.\n\nSineb then travels on alone. She meets an animal rights activist, helps out in a women's cooperative and hears the famous female \"Hadra\" singers in Chefchaouen, known as \"The Blue City\". After securing the right to sing in public, they have made female Sufi chanting famous far beyond Morocco’s borders.\n\nAgain and again, Sineb finds evidence that Morocco has its sights set on progress. The kingdom is undertaking an energy revolution, aiming to generate more than 50 percent of its electricity from renewable sources by 2030. For now, the Moroccan-made electric car is still a test project. But engineer Kawtar Benabdelaziz sees e-mobility as the future -- and not just in her own country.\nBack in Tangier, Sineb and Jaafar look back on their travels around the Mediterranean. One thing is clear: its coastline contains multitudes. With its distinctive mix of European, Arabic and African communities, the Mediterranean’s richness lies in its diversity. \n\n#documentary #dwdocumentary #morocco #mediterranean \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: \n⮞ DW Documentary (English): https://www.youtube.com/dwdocumentary\n⮞ DW Documental (Spanish): https://www.youtube.com/dwdocumental\n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/dwdocarabia\n⮞ DW Doku (German): https://www.youtube.com/dwdoku\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/dwdochindi\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}