{
  "title": "TU01: Brain Science &#038; Communication",
  "link": "https://therapistuncensored.com/episodes/tu01-brain-science-communication/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu01-brain-science-communication",
  "pubDate": "Sun, 07 Aug 2016 19:36:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=4100",
  "description": "IN THIS EPISODE:\n\n \tThis episode is the first of a series of foundational pieces we will provide on relational science and building secure relationships.\n \tThank you for checking out the show!!\n \tIt has a longer than usual monologue at the beginning but then rolls into the normal 3-way conversation. Hey we are just figuring this stuff out. 🙂\n \tMain concept – no matter what your history everyone has the capacity to grow secure relationships and improve their sense of security in themselves\n \tThere are three specific structures that affect our sense of well-being\n \tThe prefrontal cortex – functions described in detail\n \tThe hippocampus\n \tThe amygdala\n\nSuggestion: Two-sided walk if your amygdala is activated.\n\n \tWalk as far as you want and feel angry and self-righteous. When you get ready and turn around, though, you have to spend the walk back considering the opposing perspective. This engages the PFC.\n \tBrain plasticity – this is awesome news!\n \tOur brain structure is formed by patterns in behavior, but those patterns can be changed.\n \tKnowing that your threat system is activated and seeing our own warning signs allows us to work against responding automatically. It gives us choice, responsiveness.\n \tPracticing can physically alter the structure of our brain in a way that permanently helps us.\n \tStay tunes for more episodes on attachment and how to build secure relationships\n\n \nAdditional resources for this episode:\n\n \tJohn Gottman\n \tThe Seven Principals to Making a Marriage Work… this is one of the basic foundational works from a researcher who is scientifically explaining misery and happiness. for everyone.\n \tHow to Make Love Last – Gottman. A more recent work by this research team.\n \tThis is another Gottman work, but this time on parenting. Raising an Emotionally Intelligent Child… for parents.\n \tThese and other resources have been collected for you on our Resources page!",
  "enclosure": "",
  "itunes:summary": "Podcast about patterns impeding couples communication. We educate you about your brain and strategies for avoiding or moving out of conflict.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "32:41"
}