{
  "title": "Puzzling Out the Drone War Over Ukraine",
  "link": "https://spectrum.ieee.org/ukraine-drone-war",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-man-in-combat-fatigues-pushes-a-military-drone-across-an-airport-tarmac-while-another-man-in-fatigues-walks-away.jpg?id=29590718&width=1200&height=800&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>In 2014, Ukrainian soldiers fighting in Crimea knew that the sight of Russian drones would soon be followed by a heavy barrage of Russian artillery. During that war, the Russian military <a href=\"https://www.defenseone.com/ideas/2022/03/where-are-russias-drones/362612/\" rel=\"noopener noreferrer\" target=\"_blank\">integrated drones into tactical missions</a>, using them to hunt for Ukrainian forces, whom they <a href=\"https://breakingdefense.com/2015/10/russian-drone-threat-army-seeks-ukraine-lessons/\" rel=\"noopener noreferrer\" target=\"_blank\">then pounded with artillery and cannon fire</a>. Russian drones weren’t as advanced as those of their Western counterparts, but the Russian military’s integration of drones into its battlefield tactics was second to none.</p><p>Eight years later, the Russians are again invading Ukraine. And since the earlier incursion, the Russian military has spent approximately US $9 billion to domestically produce an armada of <a href=\"http://drones.cnas.org/wp-content/uploads/2016/05/A-Perspective-on-Russia-Proliferated-Drones.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">some 500 drones</a> (a.k.a. unmanned aerial vehicles, or UAVs). But, astonishingly, three weeks into this invasion, the Russians have not had anywhere near their previous level of success with their drones. There are even signs that in the drone war, the Ukrainians have an edge over the Russians.</p><p>How could the drone capabilities of these two militaries have experienced such differing fortunes over the same period? The answer lies in a combination of trade embargoes, tech development, and the rising importance of countermeasures.</p><p class=\"pull-quote\">Since 2014’s invasion of Crimea, Russia’s drone-development efforts have lagged—during a time of dynamic evolution and development across the UAV industry. </p><p>First, some background. Military drones come in a wide variety of sizes, purposes, and capabilities, but they can be grouped into a few categories. On one end of the spectrum are relatively tiny flying bombs, small enough to be carried in a rucksack. On the other end are high-altitude drones, with wingspans up to 25 meters and capable of staying aloft for 30 or 40 hours, of being operated from consoles thousands of kilometers from the battlefield, and of firing air-to-surface missiles with deadly precision. In between are a range of intermediate-size drones used primarily for surveillance and reconnaissance.</p><p>Russia’s fleet of drones includes models in each of these categories. However, sanctions imposed after the 2014 invasion of Crimea blocked the Russian military from procuring some key technologies necessary to stay on the cutting edge of drone development, particularly in <a href=\"https://www.rand.org/pubs/research_reports/RRA113-1.html\" rel=\"noopener noreferrer\" target=\"_blank\">optics, lightweight composites, and electronics</a>. With relatively limited capabilities of its own in these areas, Russia’s drone development efforts became somewhat sluggish during a time of dynamic evolution and development elsewhere. </p><p>Current stalwarts in the Russian arsenal include the Zala Kyb, which is a “loitering munition” that can <a href=\"https://zala-aero.com/en/production/bvs/kyb-uav/\" rel=\"noopener noreferrer\" target=\"_blank\">dive into a target and explode</a>. The most common Russian drones are midsize ones used for surveillance and reconnaissance. These include the Eleron-3SV and the Orlan-10 drones, both of which have been used extensively in Syria and Ukraine. In fact, just last week, an Orlan-10 operator <a href=\"https://www.forbes.com/sites/davidhambling/2022/03/16/russian-military-awards-reveal-covert-drone-tactics/?sh=5dac22b76fb8\" rel=\"noopener noreferrer\" target=\"_blank\">was awarded a military medal</a> for locating a site from which Ukrainian soldiers were ambushing Russian tanks, and also a Ukrainian basing area outside Kyiv containing ten artillery pieces, which were subsequently destroyed. Russia’s only large, missile-firing drone is the Kronshtadt Orion, which is similar to the American MQ-1 Predator and can be used for precision strikes as well as reconnaissance. An Orion was credited with an <a href=\"https://www.youtube.com/watch?v=iK4DBQOxfZo\" rel=\"noopener noreferrer\" target=\"_blank\">air strike on a command center</a> in Ukraine in early March 2022. </p><p>Meanwhile, since the 2014 Crimea war, when they had no drones at all, the Ukrainians have methodically assembled a modest but highly capable set of drones. The backbone of the fleet, with <a href=\"https://www.overtdefense.com/2021/05/25/leleka-100-model-uavs-added-to-the-ukrainian-armys-inventory/\" rel=\"noopener noreferrer\" target=\"_blank\">some 300 units fielded</a>, are the A1-SM Fury and the <a href=\"https://www.overtdefense.com/2021/05/25/leleka-100-model-uavs-added-to-the-ukrainian-armys-inventory/\" rel=\"noopener noreferrer\" target=\"_blank\">Leleka-100 reconnaissance drones</a>, both designed and manufactured in Ukraine. The A1-SM Fury entered service in April 2020, and the Leleka-100, in May, 2021.</p><p class=\"pull-quote\">On offense, the Ukrainian and Russian militaries are closely matched in the drone war. The difference is on defense.</p><p>The heavy hitter for Ukraine in this war, though, is the Bayraktar TB2 drone, a combat aerial flyer with a wingspan of 12 meters and an armament of four laser-guided bombs. As of the beginning of March, and after losing two TB2s to Russian-backed separatist forces in Lugansk, Ukraine had a complement of 30 of the drones, which were designed and developed in Turkey. These drones are specifically aimed at destroying tanks and as of 24 March <a href=\"https://www.oryxspioenkop.com/2022/02/defending-ukraine-listing-russian-army.html\" target=\"_blank\">had been credited</a> with destroying 26 vehicles, 10 surface-to-air missile systems, and 3 command posts. Various reports have put the <a href=\"https://www.ft.com/content/7529a862-7928-4b4e-a4c5-b2f50747d1f6\" target=\"_blank\">cost of a TB2</a> at anywhere from $1 million to $10 million. It’s much cheaper than the tens of millions fetched for better-known combat drones, such as the MQ-9 Reaper, the backbone of the U.S. Air Force’s fleet of combat drones.</p><p>The Ukrainian arsenal also includes the Tu-141 reconnaissance drones, which are large, high-altitude Soviet-era drones that <a href=\"https://www.oryxspioenkop.com/2022/02/attack-on-europe-documenting-equipment.html\" target=\"_blank\">have had little success</a> in the war. At the small end of the Ukraine drone complement are 100 Switchblade drones, which were donated by the United States as part of the <a href=\"https://www.politico.com/news/2022/03/16/us-sends-switchblade-drones-to-ukraine-00017836\" target=\"_blank\">$800 million weapons package</a> announced on 16 March. The Switchblades are loitering munitions similar in size and functionality to the Russian Zala Kyb.<br/></p><p> The upshot is that on offense, the Ukrainian and Russian militaries are closely matched in the drone war. The difference is on defense: Ukraine has the advantage when it comes to counter-drone technology. A decade ago, counter-drone technology mostly meant using radar to detect drones and surface-to-air missiles to shoot them down. It quickly proved far too costly and ineffective. Drone technology advanced at a brisk pace over the past decade, so counter-drone technology had to move rapidly to keep up. In Russia, it didn’t. Here, again, the Russian military was hampered by technology embargoes and a domestic industrial base that has been somewhat stagnant and lacking in critical capabilities. For contrast, the combined industrial base of the countries supporting Ukraine in this war is massive and has invested heavily in counter-drone technology.</p><p>Russia has deployed electronic warfare systems to counter enemy drones and have likely been using the <a href=\"https://www.janes.com/defence-news/news-detail/russia-trials-new-ew-tactics\" target=\"_blank\">Borisoglebsk 2 MT-LB and R-330Zh Zhitel</a> systems, which use a combination of jamming and spoofing. These systems fill the air with radio-frequency energy, increasing the noise threshold to such a level that the drone cannot distinguish control signals from the remote pilot. Another standard counterdrone technique is sending false signals to the drone, with the most common being fake (“spoofed”) GPS signals, which disorient the flyer. Jamming and spoofing systems are easy to target because they emit radio-frequency waves at fairly high intensities. In fact, open-source images show that Ukrainian forces have already <a href=\"https://www.oryxspioenkop.com/2022/02/attack-on-europe-documenting-equipment.html\" rel=\"noopener noreferrer\" target=\"_blank\">destroyed three of these Russian counterdrone systems</a>.</p><p class=\"pull-quote\">The exact systems that have been provided to the Ukrainians is not publicly known, but it’s possible to make an educated guess from among the many systems available.</p><p>Additionally, some of the newer drones being used by the Ukrainians include features to withstand such electronic attacks. For example, when one of these drones detects a jamming signal, it switches to frequencies that are not being jammed; if it is still unable to reestablish a connection, the drone operates autonomously with a series of preset maneuvers until a connection can be reestablished.</p><p>Meanwhile, Ukraine has access to the wide array of NATO counterdrone technologies. The exact systems that have been provided to the Ukrainians is not publicly known, but it’s possible to make an educated guess from among the many systems available. <a href=\"https://news.lockheedmartin.com/2019-11-07-ATHENA-Successfully-Defends-Drone-Threat\" rel=\"noopener noreferrer\" target=\"_blank\">One of the more powerful ones</a>, from Lockheed Martin, repurposes a solid-state, phased-array radar system developed to spot incoming munitions, to detect and identify a drone. The system then tracks the drone and <a href=\"https://www.lockheedmartin.com/en-us/news/features/2016/webt-laser-swarms-drones.html\" rel=\"noopener noreferrer\" target=\"_blank\">uses high-energy lasers</a> to shoot it down. Raytheon’s <a href=\"https://www.raytheonmissilesanddefense.com/what-we-do/counter-uas\" rel=\"noopener noreferrer\" target=\"_blank\">counterdrone portfolio</a> includes similar capabilities along with drone-killing drones and systems capable of beaming high-power microwaves that disrupt the drone’s electronics.</p><p>While most major Western defense contractors have some sort of counterdrone system, there has also been significant innovation in the commercial sector, given the mass proliferation of commercial drones. While many of these technologies are aimed at smaller drones, some of the technologies, including acoustic sensing and radio-frequency localization, are effective against larger drones as well. Also, a dozen small companies have developed jamming and spoofing systems specifically aimed at <a href=\"https://www.robinradar.com/press/blog/10-counter-drone-technologies-to-detect-and-stop-drones-today\" rel=\"noopener noreferrer\" target=\"_blank\">countering modern drones</a>.</p><p>Although we don’t know specifically which counterdrone systems are being deployed by the Ukrainians, the images of the destroyed drones tell a compelling story. In the drone war, many of the flyers on both sides have been captured or destroyed on the ground, but more than half were disabled while in flight. The destroyed Ukrainian drones often show tremendous damage, including burn marks and other signs that they were shot down by a Russian surface-to-air missile. A logical conclusion is that the Russians’ electronic counterdrone systems were not effective. Meanwhile, the downed Russian drones are typically much more intact, showing relatively minor damage consistent with a precision strike from a laser or electromagnetic pulse. This is exactly what you would expect if the drones had been dispatched by one of the newer Western counterdrone systems.</p>In the first three weeks of this conflict, Russian drones have failed to achieve the level of success that they did in 2014. The Ukrainians, on the other hand, have logged multiple victories with drone and counterdrone forces assembled in just 8 years. The Russian drones, primarily domestically sourced, have been foiled repeatedly by NATO counterdrone technology. Meanwhile, the Ukrainian drones, such as the TB2s procured from NATO-member Turkey, have had multiple successes against the Russian counterdrone systems.",
  "pubDate": "Fri, 25 Mar 2022 12:26:23 +0000",
  "guid": "https://spectrum.ieee.org/ukraine-drone-war",
  "category": [
    "Uavs",
    "Ukraine",
    "Ukraine conflict",
    "Russia",
    "Drones"
  ],
  "dc:creator": "Vikram Mittal",
  "media:content": ""
}