{
  "title": "Minkorrekt Folge 24 „Mathematisch Physikalischer Salon“",
  "itunes:title": "Minkorrekt Folge 24 „Mathematisch Physikalischer Salon“",
  "description": "Heute mit den Streifen der Zebras, Roboter Fussball-WM, flüssigem Wasser auf einem Saturn Mond und den Lichtwellenreitern 2.0. Experiment der Woche: \"Das Geheimnis des Guiness-Bierschaums\".\n\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/methodischinkorrekt",
  "pubDate": "Tue, 08 Apr 2014 12:12:23 +0000",
  "link": "https://minkorrekt.podigee.io/26-minkorrekt-folge-24-mathematisch-physikalischer-salon",
  "guid": "http://methodischinkorrekt.wordpress.com/?p=303",
  "content:encoded": "„Mathematisch Physikalischer Salon“ direkt von der Frühjahrstagung der Deutschen Physikalischen Gesellschaft in Dresden.\n<p>&nbsp;</p>\n<p>Man merkt uns an, dass wir gerade von einer Tagung kommen. Lethargisch und unterkoeffiniert machen wir uns trotzdem an die Wissenschaftsnews der Woche.</p>\n<p>Zunächst blicken wir zurück auf die DPG-Frühjahrstagung in Dresden von der wir gerade kommen. Anstrengend war es aber auch schön. Vor allem exzellent organisiert.</p>\n<p>Ein Blick geht zurück zur letzten Sendung. Nicolas war inkorrekt bei der Beschreibung des Gravitationswellen-Experimentes. Zum Glück haben wir Adrian. Er hat sich auch die <a href=\"http://adsabs.harvard.edu/abs/1982ApJ...253..908T\">Mühe</a> gemacht <a href=\"http://adsabs.harvard.edu/abs/2009AIPC.1103..285M\">etwas</a> Literatur <a href=\"http://www.gravity.uwa.edu.au/docs/review.pdf\">herauszusuchen</a>.</p>\n<p>„Previously on stem cell research&#8230;“ – Unsere Stammzellen-Soap mit einer Erfolgsmeldung aus China und einer dramatischen Wendung. Es nimmt kein Ende und wird immer absurder. Wie peinlich das alles „Nature“ sein muss!</p>\n<p><span id=\"more-933\"></span></p>\n<p>Thema 1: „Warum haben Zebra(s) Streifen?“ – Ja, warum eigentlich? Forscher haben genau das jetzt untersucht und eine überraschende Erklärung gefunden. Ist es Tarnung? Ein Vorteil bei der Partnerwahl? Oder was <a href=\"http://www.nature.com/ncomms/2014/140401/ncomms4535/full/ncomms4535.html\">ganz anderes</a>? Nebenbei erzählt Reinhard noch von seiner Zebraverkleidung. Echt jetzt!</p>\n<p>Thema 2: „Schwitzen für den Titel!“ – Es geht um die Fußball WM in Brasilien. Aber nicht die von Schweini, Poldi und Co sondern um die Roboter-Fußball-WM. Dort tritt die Hochschule Offenburg mit <a href=\"http://sweaty.hs-offenburg.de\">Sweaty</a> an. Ein selbstgedruckter Roboter mit Schwitzmotoren. Klingt merkwürdig? Dann <a href=\"http://sweaty.hs-offenburg.de/videos/\">schaut</a> Euch das mal an&#8230;</p>\n<p>Experiment der Woche: „Das Geheimnis des Guinness Bierschaums“ – Der Guinness Bierschaum birgt so manche Überraschung. Schaum der im Glas nach <a href=\"http://phys.org/news/2012-05-irish-mathematicians-guinness-video.html\">unten</a> <a href=\"http://arxiv.org/abs/1205.5233\">sinkt</a>. Feine Perlage. Ungewöhnlich stabiler <a href=\"http://en.wikipedia.org/wiki/Widget_(beer)\">Schaum durch Stickstoff</a>. All das erklären wir, damit ihr zur nächsten Party wieder unnützes Wissen mitbringen könnt.</p>\n<p>Musikvideo: „<a href=\"https://www.youtube.com/watch?v=6aQlbqHZuYk\">Neil Armstrong on being a nerd</a>“</p>\n<p>Thema 3: „Der nächste Saturn-Ozean“ – Schon wieder<a href=\"http://www.sciencemag.org/content/344/6179/78\"> flüssiges Wasser</a> in der Nähe von Saturn. Es reicht! Fliegt da endlich hin! Wir wollen jetzt sofort Außerirdisches Leben entdecken!</p>\n<p>Thema 4: „Mehr Licht!“ – <a href=\"http://www.opticsinfobase.org/oe/abstract.cfm?uri=oe-22-4-4168\">Lichtwellenleiter 2.0</a>. Besonders geeignet für mechanische Belastungen. Der 6 Millionen Dollar Mann braucht das, glaubt uns!</p>\n<p>Zeit zum spielen. Auf der Tagung haben wir noch einen Vortrag über eine interessante Simulation gehört. Die können wir Euch nicht <a href=\"http://www.dpg-verhandlungen.de/year/2014/conference/dresden/part/soe/session/18/contribution/2\">vorenthalten</a>. Spieltheorie um die Welt zu beschreiben.</p>\n<p>„True facts about: The Owl!“ – Eine ganze <a href=\"https://www.youtube.com/playlist?list=PL5vtqDuUM1DlU-WZhp4g-7VnQW_eTnjmA\">Videoreihe</a> die ganz lustig ist. Wir spielen mal die Eule an.</p>\n<p>Die nächste reguläre Folge fällt aus, weil wir in den Osterurlaub gehen. Dafür wird es danach quasi ein Triple-Feature mit uns geben:</p>\n<p>&#8211; Der Omega Tau Podcast wird uns besuchen und produziert einen Podcast über uns und (auf vielfachen Wunsch) über unsere Forschung.</p>\n<p>&#8211; Wir nehmen mit unserem Schwesterpodcast <a href=\"http://www.konscience.de\">KonScience</a> (oder <a href=\"http://www.konscience.de\">KonScience</a>) eine gemeinsame Geburtstagsfolge auf. Das Thema wird dort verraten, reinhören lohnt also gleich doppelt&#8230;</p>\n<p>&#8211; Wir senden eine Folge von der re:publica auf der wir Anfang Mai sind. Das wird ein methodisch inkorrekter Blick auf die naturwissenschaftlichen Themen der re:publica.</p>\n<p>Rausschmeißer: „Duck and Cover“ – Der 50er <a href=\"https://www.youtube.com/watch?v=IKqXu-5jw60\">Propagandafilm</a>. Ein Klassiker. Vergesst nicht, die Bombe kann uns jederzeit treffen. Aber zum Glück gibt es ja ein Mittel dagegen: Macht er wie Bert die Schildkröte! Ducken und Abdecken&#8230; Da kann der Russe ruhig kommen!</p>\n<p>&nbsp;</p>\n<p>Du möchtest mehr über unsere Werbepartner erfahren? <a href=\"https://linktr.ee/methodischinkorrekt\"><strong>Hier findest du alle Infos & Rabatte</strong></a></p>",
  "itunes:image": "",
  "itunes:episode": 26,
  "itunes:episodeType": "full",
  "itunes:subtitle": "„Mathematisch Physikalischer Salon“ direkt von der Frühjahrstagung der Deutschen Physikalischen Gesellschaft in Dresden.",
  "itunes:summary": "Heute mit den Streifen der Zebras, Roboter Fussball-WM, flüssigem Wasser auf einem Saturn Mond und den Lichtwellenreitern 2.0. Experiment der Woche: \"Das Geheimnis des Guiness-Bierschaums\".\n\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/methodischinkorrekt",
  "itunes:explicit": "no",
  "itunes:keywords": "",
  "itunes:author": "Methodisch inkorrekt!",
  "enclosure": "",
  "itunes:duration": 9429
}