{
  "id": "tag:blogger.com,1999:blog-6747621709757476971.post-4389950416388060555",
  "published": "2022-05-16T11:31:00.002-07:00",
  "updated": "2022-05-18T13:21:28.291-07:00",
  "category": "",
  "title": "Guaranteed reliability for your Business 2 Gig Service",
  "content": "When it comes to internet, speed and bandwidth are important, but without reliability, just having fast internet doesn’t mean much. Reliability has always been core to Google Fiber. We take that commitment to our customers very seriously, which is why we work around the clock to prevent outages and to quickly restore service and credit our customer accounts if there ever is an outage.&nbsp; <br /><br />People depend on their internet connection for almost everything these days, and that’s even more true for our Google Fiber Business customers.  <a href=\"https://fiber.google.com/blog/2022/your-business-now-even-faster/\">We launched Google Fiber Business 2 Gig</a> service back in March to meet the growing bandwidth needs of our business customers.&nbsp; <br /><br />Along with increased speed, we also want them to have the confidence that their internet is going to be there when they need it. So today we’re sharing our <a href=\"https://fiber.google.com/legal/terms/business/sla/\">Google Fiber Business 2 Gig Service Level Guarantee</a>, which includes an monthly uptime report, advance notification of planned network maintenance and an automatic credit of 25% of business customers’ monthly bill if their average monthly uptime drops below 99.9% (that’s 2.5 minutes down over a 40 hour work week). All current Business 2 Gig customers will be automatically enrolled into the Service Level Guarantee. <br /><br />We have a lot of confidence in our network reliability. In fact, our network availability is already over 99.9%. By putting it in writing, we’re making sure that our customers can have that same confidence. Speed and reliability combined makes for internet that can power your business to the next level, and we’re continuing to work to improve every day for both our business and residential customers. <br /><br />Posted by Nick Saporito, Head of Commercial Strategy <br /><br /><img src=\"https://lh4.googleusercontent.com/y5jP2d0rG4kZAXYBYa8P7y6UcV6w6AuiAVZZgH_hVr8m0zIgKzcohg16nD_PSdZuuCa4ZNwr4xruo7vyikPQF0seS9TxfEzFVKHFq_G0Qn3Y59i_BmI32-HcNNNzhF5DAgMaYahLCWXZmrsGh8PK3k7yFcz8wI0oGTWqGgNIaTo6ugOELxKRtiIUD6iLHQ=w160\" title=\"Nick Saporito, Head of Commercial Strategy\" /><br /><br />",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google Fiber",
    "uri": "http://www.blogger.com/profile/08137833201549488546",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}