{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-8155873527082916597",
  "published": "2020-07-08T07:30:00.000-07:00",
  "updated": "2020-07-08T10:03:29.310-07:00",
  "title": "You’re invited to participate in “Life In A Day 2020” on July 25",
  "content": "On July 25, executive producers Ridley Scott (“The Martian,” “Gladiator”) and Kai Hsuing (“Lords of Chaos”), along with director Kevin Macdonald (“Whitney,” “One Day in September,” “The Last King of Scotland”), invite you and the YouTube global community to pick up your cameras to create <a href=\"https://lifeinaday.youtube/\" target=\"_blank\">“Life In A Day 2020.”  </a><br /><br />Exactly 10 years after the original <a href=\"https://www.youtube.com/watch?v=JaFVr_cJJIY\" target=\"_blank\">“Life In A Day,”</a> the world will once again come together to create a YouTube Original feature-length documentary that tells the story of a single day on Earth. Selected footage sourced from participants like you will be woven together in this documentary to tell the story of an ordinary day during these extraordinary times. “Life In A Day 2020” will premiere at the Sundance Film Festival and on YouTube in 2021. <br /><br /><h3>How the project works </h3><br />On a single day, Saturday, July 25, people around the world are invited to film their day. <br /><br />Maybe you'll be filming from home as you continue to navigate the coronavirus pandemic, or maybe you're in a part of the world where you're figuring out how to move forward in a transformed world. Maybe you're connecting with friends, reuniting with family, or going to work. Maybe it's a special day - you’re getting married, moving out, sharing important news. Or maybe it’s just a normal day. We want to weave together these unique experiences and perspectives to create a time capsule of this moment. <br /><br />The final feature film will be edited over the course of five months, crafted entirely through what is found in the submitted footage. Once the submission window closes, a 30-person team of multilingual reviewers stationed around the world will begin reviewing and translating submitted videos. Three principal feature editors - Nse Asuquo (House of My Fathers, The Jazz Ambassadors), Mdhamiri Á Nkemi (The Pale Horse, Blue Story), and Sam Rice-Edwards (Whitney) - will then undertake an enormous post-production effort, working alongside director Kevin Macdonald, to shape the film's final narrative out of the submitted footage. br /><br /><h3>Who can take part </h3><br />The filmmakers are encouraging people from all over the world to take part, and they hope to capture a wide perspective on life. Submissions are open from July 25 to August 2, which means you will only have one week to submit your footage at <a href=\"http://lifeinaday.youtube/\">lifeinaday.youtube</a>.<br /><br />While only a small number of the submitted clips will make it into the movie, YouTube and the filmmakers hope the filming day itself becomes a significant day of global participation. The “Life In A Day 2020” project celebrates the importance of everyone coming together in a moment of equal, worldwide collaboration. <br /><br /><h3>About the original film </h3><br />In 2010, “Life In A Day” brought the YouTube community together for a massive participatory feature film project that attracted 80,00 submissions. The final film premiered at Sundance in 2011, was released globally in theatres, and has been watched on YouTube over 16 million times.",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}