{
  "title": "A stronger euro comes with more responsibility",
  "link": "https://audioboom.com/posts/7869512",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1767,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>European strategic autonomy is probably the single most used watchword in European circles, if only because of lack of consensus about what it entails. US bashing for some, a more confident and independent EU for others, the concept has well and truly moved out of the security and defence area into every area of EU policy. This is most apparent in the debate around the international role of the euro, where institutional thinking has shifted fast in the past couple of years. Is it inevitable?<br>\n<br>\n\n</div>\n<div>In this episode of The Sound of Economics, Bruegel Director <a href=\"https://www.bruegel.org/author/guntram-b-wolff/\">Guntram Wolff</a> is joined by <a href=\"https://www.bruegel.org/author/franziska-brantner/\">Franziska Brantner</a>, Member of the Bundestag and Europe spokesperson for Alliance 90/The Greens’ parliamentary group, to talk about sovereignty, the international role of the euro and the geopolitical repercussions of the EU’s green deal.<br>\n<br>\n\n</div>\n<div><strong>Relevant publications:</strong></div>\n<div>Claeys, G. and G. Wolff (2020) ‘<a href=\"https://www.bruegel.org/2020/10/for-the-euro-there-is-no-shortcut-to-becoming-a-dominant-currency/\">For the euro, there is no shortcut to becoming a dominant currency</a>’, Bruegel Blog, 13 October</div>\n<div>Claeys, G. and G.B. Wolff (2020) ‘<a href=\"https://www.bruegel.org/2020/06/is-the-covid-19-crisis-an-opportunity-to-boost-the-euro-as-a-global-currency/\">Is the COVID-19 crisis an opportunity to boost the euro as a global currency?</a>’ Policy Contribution 11/2020, Bruegel</div>\n<div>Or maybe you’d like to watch our event with President of the European Council ‘<a href=\"https://www.bruegel.org/events/from-playing-field-to-player-europes-strategic-autonomy-the-number-one-goal/\">From playing field to player: Europe’s strategic autonomy as our generation’s goal</a>’ on the importance of Europe’s strategic autonomy<br>\n<br>\n\n</div>\n",
  "itunes:summary": "What does strategic sovereignty mean to and for Europe?",
  "pubDate": "Wed, 19 May 2021 09:29:07 +0000",
  "guid": "tag:audioboom.com,2021-05-19:/posts/7869512",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}