{
  "title": "How Effective Is the Government’s Campaign Against Hospital Mergers?",
  "link": "https://www.propublica.org/article/ftc-campaign-against-hospital-mergers",
  "pubDate": "Fri, 28 Oct 2022 05:00:00 -0400",
  "guid": "https://www.propublica.org/article/ftc-campaign-against-hospital-mergers",
  "description": "\n                <p class=\"byline\">\n                by <a class=\"name\" href=\"https://www.propublica.org/people/allan-sloan\">Allan Sloan</a> and <a class=\"name\" href=\"https://www.propublica.org/people/carson-kessler\">Carson Kessler</a>                </p>\n                                             \n\n                                                                    \n            \n                <p>ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive <a href=\"https://www.propublica.org/newsletters/the-big-story?source=54G&placement=top-note&region=national\">our biggest stories</a> as soon as they’re published.</p>\n\n            \n\n                \n\n      \n  \n\n\n\n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.0\">In recent months, federal antitrust regulators have notched some notable achievements, blocking four hospital mergers. Those actions follow the announcement of a major change in antitrust philosophy, embodied by President Joe Biden’s <a href=\"https://www.whitehouse.gov/briefing-room/presidential-actions/2021/07/09/executive-order-on-promoting-competition-in-the-american-economy/\">executive order last year</a> aimed at promoting competition. That order criticized hospital consolidation for the ways in which it has left “many areas, particularly rural communities, with inadequate or more expensive healthcare options.” </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.1\">Suddenly, antitrust regulators seem to have swagger. News articles have described the Federal Trade Commission, whose job is to stop anti-competitive behavior, as being <a href=\"https://www.washingtonpost.com/technology/2022/06/08/ftc-lina-khan-deadlock-broken/\">“unleashed”</a> under its aggressive new chief, Lina Khan. Republicans have responded with <a href=\"https://www.washingtonpost.com/politics/2022/09/21/senate-republicans-turn-up-heat-ftcs-khan/\">complaints of “radical” policies</a>. An <a href=\"https://khn.org/news/article/biden-ftc-block-hospital-mergers-antitrust/\">FTC official told Kaiser Health News</a>, “We are feeling invigorated and looking to fulfill the executive order’s call to be aggressive on antitrust enforcement.” </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.2\">What can be gleaned about hospital consolidation 15 months after Biden’s executive order? An examination of the cases the FTC has taken on — and those it hasn’t — suggests that so far the rhetoric has been more muscular than the reality. The agency initiated three challenges of hospital mergers during this period (the fourth example noted above was initiated during the Trump administration) and allowed 54 to proceed without taking public action. By contrast, the FTC challenged a total of three hospital mergers over the four years of the Trump administration, while permitting 375 to go through unchallenged.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.3\">One reason the numbers haven’t risen further is an impediment that is rarely mentioned outside of antitrust circles: The FTC’s guidelines focus exclusively on challenging mergers of hospitals within a single geographic region, not when a major player in one region buys up a hospital in a different one. And those so-called cross-market deals make up an increasing portion of hospital mergers.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.4\">Not only does the FTC face that obstacle, it’s short on the money and staffing it would take to duke it out over big-time cross-market mergers. “Our resource constraints overhang every enforcement decision,” Holly Vedova, director of the FTC’s Bureau of Competition, told us in a statement. “It’s not possible to quantify the number of additional mergers that we could challenge, but there’s little doubt that being able to invest more resources in our investigations would bolster our enforcement.” </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.5\">Let’s start with a quick review of the quarter century of hospital consolidation that brought us to today. There were 1,887 hospital mergers announced from 1998 through the end of last year, according to the American Hospital Association and health care consultants Kaufman Hall. Absent those mergers, we’d have about 8,000 hospitals in the U.S. rather than the 6,093 that the AHA says we had at the end of last year.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.6\">Over the years, the FTC has generally attempted to block about 1% of those mergers, which made it a very small sandbag in the path of a fast-moving flood of deals. (Those sympathetic to the FTC point out that, due to its limited resources, the agency attempts to select winnable cases whose prominence or importance will send a message to the hospital industry and discourage similar transactions.) The agency isn’t notified about all hospital mergers, only those with a value of more than $101 million, a number that gets adjusted every year for the size of the economy. These days the number of mergers is slowing down, Kaufman Hall said, but the size of deals is increasing. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.7\">Fewer hospitals means less competition for patients. And as they teach you in Market Economics 101, fewer competitors generally results in higher prices. Lots and lots of studies have been conducted of mergers and pricing, which aren’t published until years after mergers are completed because it takes so long to do the analyses. They show that, in general, <a href=\"https://pubmed.ncbi.nlm.nih.gov/32981974/\">having fewer hospitals</a> competing for business <a href=\"https://www.tandfonline.com/doi/abs/10.1080/13571516.2011.542952\">makes prices higher</a> than they would otherwise be. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.8\">Health care consolidation is the “No. 1 driver of health care spending inflation,” according to professor David Dranove of Northwestern University’s Kellogg School of Management, co-author of “Big Med: Megaproviders and the High Cost of Health Care in America.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.9\">Unlike things like higher gasoline prices or rising food costs, the cost of hospital consolidations isn’t obvious, and usually isn’t paid by people directly. Rather, employers who pick up some or most of the cost of their workers’ medical insurance, either directly or through payments they make to health insurance companies, pass on those costs indirectly by giving workers less in salary and benefits than they might otherwise get. (Similarly, when it comes to government health insurance plans such as Medicare, Medicaid and various state and local programs, the cost of hospital mergers is paid indirectly, through higher taxes or bigger government deficits.)</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.10\">“The more money that is going into benefits, the less money is going to employees,” said Bill Kramer, senior adviser for health policy at Purchaser Business Group on Health, which represents some 40 private employers and public entities that collectively purchase health care for more than 15 million Americans. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.11\">Employees’ health care costs are also rising rapidly, a <a href=\"https://www.fiercehealthcare.com/payers/employer-health-costs-set-rise-65-2023-aon\">trend expected to continue in 2023</a>. “Workers’ contribution to family health insurance premiums grew 259 percent from 1998 to 2018, while nominal average hourly earnings for production and nonsupervisory workers grew by only 68 percent,” according to a <a href=\"https://www.brookings.edu/wp-content/uploads/2020/03/Gaynor_PP_FINAL.pdf\">2020 paper by economist Martin Gaynor</a>, a professor at Carnegie Mellon University and a founder of the Health Care Cost Institute.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.12\">This brings us to today’s FTC. Over the past year or so, the agency blocked two mergers involving the two biggest hospital companies in New Jersey, both of which had been vacuuming up hospitals in the state since they were created by mergers in 2016. One involved a deal for Hackensack Meridian Health to buy Englewood Health, which was announced in 2019 and prompted an <a href=\"https://www.ftc.gov/news-events/news/press-releases/2020/12/ftc-challenges-hackensack-meridian-health-incs-proposed-acquisition-competitor-englewood-healthcare\">FTC suit in late 2020</a>, in the waning days of the Trump administration. The FTC prevailed in both U.S. District Court and the U.S. Court of Appeals, leading the hospitals to officially raise the white flag in June.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.13\">The second deal was for the state’s other Big Two hospital chain, RWJBarnabas Health, to acquire St. Peter’s University Hospital of New Brunswick. In that case, <a href=\"https://www.ftc.gov/news-events/news/press-releases/2022/06/ftc-sues-block-merger-between-new-jersey-healthcare-rivals-rwjbarnabas-health-saint-peters\">the filing of an administrative complaint by the FTC</a> in June was enough to get the hospitals to drop their merger plans.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.14\">The FTC prevailed in the Hackensack Meridian case by proving to the courts’ satisfaction that a merger with Englewood would raise costs for patients in New Jersey’s Bergen County. However, some key numbers — such as projections by an outside expert hired by the FTC — were blacked out in the publicly available documents, and remain so even after the proposed merger was dropped, because they’re still considered proprietary. (The FTC’s other prominent victories in 2022 include <a href=\"https://www.ftc.gov/news-events/news/press-releases/2022/03/statement-regarding-termination-attempted-merger-rhode-islands-two-largest-healthcare-providers\">blocking the merger</a> of the two largest hospital systems in Rhode Island and getting <a href=\"https://www.fiercehealthcare.com/providers/ftc-notches-another-antitrust-win-hca-healthcare-steward-health-care-call-5-hospital-sale\">HCA Healthcare to abandon</a> its plans to take over Utah’s Steward Health Care System after the <a href=\"https://www.ftc.gov/news-events/news/press-releases/2022/06/ftc-sues-block-merger-between-utah-healthcare-rivals-hca-healthcare-steward-health-care-system\">FTC went to court</a>.)</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.15\">The FTC’s successes in the Hackensack Meridian and Barnabas cases are examples of a strategic change in the FTC’s approach to hospital deals. After losing every anti-hospital merger case that it brought in the 1990s, the FTC improved the quality of its market analysis and has since run up an excellent record — six wins against just one loss since 2020 — in the relative handful of cases that it brings. The analysis concentrates on competition within what are defined as geographic markets, such as Bergen County (where Englewood is located and where Hackensack Meridian has significant market share) and Middlesex County (where St. Peter’s is based and Barnabas is a big player).</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.16\">While the FTC appears to have gotten better at winning local antitrust cases like those two in New Jersey, its reach is severely limited when it comes to so-called cross-market mergers, marriages between entities that do not directly compete in the same geographic or product market.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.17\">The number of cross-market mergers has been increasing. Over the past decade, more than half of all hospital mergers have occurred across geographic markets, according to University of California Hastings College of the Law professor Jaime King, who specializes in health care and competition issues. None have been challenged in federal court. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.18\">Despite the rise in cross-market mergers and <a href=\"https://www.kellogg.northwestern.edu/docs/faculty/dafny/price-effects-of-cross-market-hospital-mergers.pdf\">emerging data</a> that suggests that they contribute to rising prices, the <a href=\"https://www.ftc.gov/system/files/documents/public_statements/804291/100819hmg.pdf\">FTC’s formal guidelines on hospital mergers</a> haven’t been updated since 2010. The <a href=\"https://www.ftc.gov/system/files/documents/public_statements/804291/100819hmg.pdf\">FTC guidelines</a> include 34 detailed pages on how to evaluate and challenge an intramarket merger and zero pages on how to evaluate or challenge a cross-market merger. That’s largely because courts tend to support the FTC if it can demonstrate that one local competitor is merging with another local competitor, reducing the number of hospital options and increasing the chances that the acquirer can raise prices. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.19\">Consider one merger this year that the FTC allowed to proceed without a word of public objection. In February, two Michigan systems, Beaumont Health and Spectrum Health, <a href=\"https://www.fiercehealthcare.com/hospitals/beaumont-health-spectrum-health-complete-22-hospital-merger-form-michigans-largest-health\">combined to create the largest health system</a> and private employer in the state, with 22 hospitals and more than 300 outpatient locations. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.20\">“I believe the FTC decided to not intervene in this case because both the Beaumont system and Spectrum system are geographically dispersed from each other,” said Bret Jackson, president of the nonprofit Economic Alliance for Michigan, who said he spoke to the FTC regarding the deal. Jackson sees elevated prices as an inevitable result. “It is still too soon to see the price effects of the merger on health care costs, since both systems are under existing contracts with insurers,” he said. “But never in the history of hospital mergers in the country has a hospital come down in pricing after a merger.” (A spokesperson for Corewell Health, the newly merged entity, said, “We remain focused on quality, affordable care for the communities we serve.”)</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.21\">Experts like King argue that courts and the FTC should recognize that if one chain buys multiple hospitals in different markets, that chain can also wield significant power to raise prices.  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.22\">The FTC and its fellow antitrust enforcer, the Department of Justice, have taken some preliminary steps toward retooling their approach. In January, the two agencies <a href=\"https://www.ftc.gov/news-events/news/press-releases/2022/01/federal-trade-commission-justice-department-seek-strengthen-enforcement-against-illegal-mergers\">began soliciting public input</a> on ways to modernize merger guidelines, specifically for markets that “may fall outside the frameworks under the current approach.” More than 1,900 comments have been submitted to the agencies.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.23\">King applauds the FTC for that step and for its recent aggressiveness. But she thinks the agency still has a ways to go before it can effectively combat hospital consolidation. “There’s a need to reevaluate old assumptions about how health care markets are working,” King said. “It’s almost like they’re two decades behind.”</p>\n        \n    \n                    \n\n    <p>\n        <strong><a href=\"https://www.propublica.org/getinvolved/send-propublica-story-tips\">Do You Have a Tip for ProPublica? Help Us Do Journalism.</a></strong>\n    </p>\n\n        \n                                   ",
  "dc:subject": "Health Care, A Closer Look",
  "dc:date": "2022-10-28T05:00:00-04:00",
  "dc:creator": "by Allan Sloan and Carson Kessler"
}