{
  "itunes:episode": 54,
  "title": "Wait a Cotton-Picking Minute With Jay Fanelli And Nathan Peretic",
  "pubDate": "Thu, 19 Dec 2013 15:04:24 +0000",
  "link": "http://newdisrupt.org/blog/2013/12/19/54-wait-a-cotton-picking-minute-with-jay-fanelli-and-nathan-peretic",
  "description": "<p>Jay Fanelli and Nathan Peretic know how to go it on their own. They've done it not just once, not just twice, but now three times. They formed the interactive-services company <a href=\"http://fullstopinteractive.com\">Full Stop Interactive</a>, out of which <a href=\"http://fullstopinteractive.com\">United Pixelworkers</a> was formed, a company that produces fine wearable merchandise. And United Pixelworkers gave birth to <a href=\"http://cottonbureau.com\">Cotton Bureau</a>, a site that uses crowdfunding to pick which shirts should get printed. Now they're doubling down and focusing entirely on the T-shirt and merchandise businesses.</p><p><em><strong>Support The New Disruptors <a href=\"http://www.patreon.com/glennf\">directly as a patron at Patreon</a> starting at $1 for each podcast episode, with on-air thanks, premiums, and more at higher levels of support. We do this show with your help.</strong></em></p>",
  "guid": "tag:soundcloud,2010:tracks/125541687",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:11:37",
  "itunes:subtitle": "Jay Fanelli and Nathan Peretic of the Cotton Bureau and United Pixelworkers know how to go it on their own.",
  "itunes:summary": "Jay Fanelli and Nathan Peretic know how to go it on their own. They've done it not just once, not just twice, but now three times. They formed the interactive-services company Full Stop Interactive, out of which United Pixelworkers was formed, a company that produces fine wearable merchandise. And United Pixelworkers gave birth to Cotton Bureau, a site that uses crowdfunding to pick which shirts should get printed. Now they're doubling down and focusing entirely on the T-shirt and merchandise businesses. (Support The New Disruptors at http://www.patreon.com/glennf directly as a patron.)"
}