{
  "title": "159: Missing 411",
  "link": "https://audioboom.com/posts/7741177",
  "itunes:episode": 159,
  "itunes:title": "Missing 411",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3724,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On July 10, 2015, two-year-old DeOrr Kunz vanished while on a camping trip with his young parents. The circumstances were...bizarre to say the least. The family was in the middle of the woods, miles from the nearest road. Little DeOrr had been walking with his parents, then turned to walk the 100 or so feet back to his grandfather. It was broad daylight. And in the split second that nobody was looking at the boy, he vanished, No trace of him was ever found. The case sounds odd until you discover that there are hundreds of cases just like this one, with many of the same circumstances. <strong>That's right, over the last 50 years, hundreds of people--many of them children--have vanished in broad daylight from campsites and national forests all over the country. </strong>Missing 411 tries to figure out what the hell is happening. <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>The Vow</strong>\" \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n<div><a href=\"https://audioboom.com/posts/7703675-death-at-the-mansion-rebecca-zahau-part-1/edit\">Update Description</a></div>\n<div>\n<br>\n<strong>YOU GUYS WE LAUNCHED A NEW PODCAST!!</strong> Each week on <a href=\"https://www.centuriespod.com/\">\"Crimes of the Centuries\"</a> host Amber Hunt (of the Accused podcast) takes us on a deep investigative dive into a crime that was huge when it happened, but has been lost to time--and one you've likely never heard of. From the 220 year old murder that brought Alexander Hamilton and Aaron Burr together to fight for the defense, to Jazz Age thrill killers, Lady mob bosses, murdering grandmothers, and serial killers you've never heard of. <strong>Check out \"Crimes of the Centuries wherever you get your podcasts. </strong>\n</div>\n",
  "pubDate": "Tue, 01 Dec 2020 11:00:00 +0000",
  "guid": "tag:audioboom.com,2020-12-01:/posts/7741177",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}