{
  "title": "What’s that you say? Present with captions in Google Slides",
  "link": "https://blog.google/outreach-initiatives/accessibility/whats-you-say-present-captions-google-slides/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Years ago in a Long Island doctor’s office, four-year-old Laura was fitted with her first pair of hearing aids, customized to compensate for her specific hearing loss. However, they didn’t work very well, particularly in noisy backgrounds, so she eventually stopped wearing them.</p><br/><p>A few years later on a school bus in Bethesda, MD, nine-year-old Abigail sat next to a classmate who taught her how to communicate using <a href=\"https://en.wikipedia.org/wiki/American_Sign_Language\">American Sign Language</a>. In high school, she worked in a biology lab at the <a href=\"https://nei.nih.gov/\">National Eye Institute</a>where she researched retinitis pigmentosa, a genetic disorder that causes loss of vision.</p><br/><p>Flash forward to today where we, Laura and Abigail, work at Google, building products with accessibility features that help billions of users across the globe. We met earlier, through the accessibility community at MIT, where we studied computer science with the hopes of using our technical skills to make a difference in people’s lives.</p><br/><p>During our time at university, Abigail built a solution that helped a blind man use his touch-screen oven, led a team that enabled blind individuals to sign legal documents independently, and co-founded an <a href=\"http://assistivetech.mit.edu/athack/\">assistive technology hackathon</a>. Laura researched a <a href=\"http://journals.sagepub.com/doi/pdf/10.1177/2331216517710354\">new signal processing algorithm</a> for hearing aids in noisy environments, built an app for residents in a neurological disease care facility to <a href=\"https://www.bostonglobe.com/metro/2015/08/08/mit-students-patient-collaborate-app/bW0DDqu7fGz55fmuz27ZKO/story.html\">call for help in a more accessible way</a>, and worked on a hands-free page turner for individuals unable to use their arms. This work not only made us see what an impact technology can make on people with accessibility needs, but also motivated us to focus our careers in this area when we graduated.</p><br/><p>When we landed at Google, we both independently joined the G Suite accessibility team. As part of this team, we've improved <a href=\"https://support.google.com/docs/answer/6282736\">screen reader</a>, <a href=\"https://support.google.com/docs/answer/6057417\">Braille</a> and <a href=\"https://support.google.com/docs/answer/6282736#magnification\">screen magnifier</a> support on Google Docs, Sheets and Slides, and we have represented the Google Accessibility team at external conferences. We’re also involved with the American Sign Language community at Google, which promotes inclusivity among all Googlers through shared language.</p><br/><p>Recently, an internal hackathon led us to work on a project that is deeply personal. Upon observing that presentations can be challenging for individuals who are deaf or hard of hearing to follow along, we both teamed up with the idea to add automated closed captions to G Suite’s presentation tool, Google Slides.</p><br/><p>This work has moved from a passion project to our full-time job, and today we’re officially launching automated closed captions in Google Slides. The feature will gradually roll out to all Slides users starting this week.</p></div></div><div class=\"block-video\"><div class=\"h-c-page h-c-page--mobile-full-bleed\"><div class=\"h-c-grid\"><div class=\"h-c-grid__col h-c-grid__col-l--10 h-c-grid__col-l--offset-1\"><div class=\"article-module uni-article-video uni-article-video--body\" data-component=\"uni-article-yt-player\" data-page-title=\"\" data-video-id=\"GbBtW-vlXmY\"><div class=\"uni-article-video__embed-container hidden\"><div id=\"uni-article-yt-player-GbBtW-vlXmY\"></div></div><figure><a class=\"h-c-video h-c-video--marquee uni-article-video__custom-wrapper\" role=\"link\" tabindex=\"0\"><div class=\"uni-article-video__aspect-image\"><img alt=\"Google Slides Closed Captions\" data-loading='{\n                        \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Screen_Shot_2018-10-08_at_8.58.09_AM.max-500x500.png\",\n                        \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Screen_Shot_2018-10-08_at_8.58.09_AM.max-1000x1000.png\"\n                      }' loading=\"lazy\" src=\"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Screen_Shot_2018-10-08_at_8.58.09_AM.max-100x100.png\"/><div class=\"uni-article-video__dimmer\"></div><svg class=\"uni-article-video__play-button--active\" role=\"img\"><use xlink:href=\"#yt_video_play_button_no_hole\"></use></svg><svg class=\"uni-article-video__play-button\" role=\"img\"><use xlink:href=\"#yt_video_play_button\"></use></svg><div class=\"uni-article-video__duration loading\"><svg class=\"uni-article-video__duration-icon\" role=\"img\"><use xlink:href=\"#yt_video_duration\"></use></svg><span class=\"uni-article-video__duration-time\">10:25</span></div></div></a><figcaption class=\"uni-article-video__caption h-c-page\"><p aria-hidden=\"true\">An example of closed captions in Google Slides</p></figcaption></figure></div></div></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h2>How it works</h2><p>The closed captions feature is available when presenting in Google Slides. It uses your computer’s microphone to detect your spoken presentation, then transcribes—in real time—what you say as captions on the slides you’re presenting.  When you begin presenting, click the “CC” button in the navigation box (or use the shortcut Ctrl + Shift + c in Chrome OS / Windows or ⌘ + Shift + c in Mac).</p><br/><p>As you start speaking into your device’s microphone, automated captions will appear in real time at the bottom of your screen for your audience to see. The feature works for a single user presenting in U.S. English on a laptop or desktop computer, using the Chrome browser. We’re looking to expand the feature to more countries and languages over time. The captions are powered by machine learning and heavily influenced by the speaker's accent, voice modulation, and intonation. We’re continuing to work on improving caption quality.</p><br/><p>Closed captioning in Slides can help audience members like Laura who are deaf or hard of hearing, but it can also be useful for audience members without hearing loss who are listening in noisy auditoriums or rooms with poor sound settings. Closed captioning can also be a benefit when the presenter is speaking a non-native language or is not projecting their voice. The fact that the feature was built primarily for accessibility purposes but is also helpful to all users shows the overall value for everyone of incorporating accessibility into product design.</p><br/><p>You might think that the experiences we had growing up are the reasons we were inspired to work on accessibility at Google. That’s partly true. But we really got into this work for its potential to improve the lives of people with disabilities, for the interesting technologies and design constraints, and because of our desire to use our skills to make the world a better place. We’re excited to contribute to that effort with closed captions in Google Slides, and we’re eager to share it with you. Visit our <a href=\"https://support.google.com/docs?p=slides_captions\">help center</a> to learn more.</p></div></div></body></html>",
  "pubDate": "Mon, 08 Oct 2018 16:00:00 +0000",
  "guid": "https://blog.google/outreach-initiatives/accessibility/whats-you-say-present-captions-google-slides/",
  "category": [
    "Accessibility",
    "Slides",
    "Diversity and Inclusion",
    "Googlers"
  ],
  "og": {
    "type": "article",
    "title": "What’s that you say? Present with captions in Google Slides",
    "description": "To help your audience get more out of your presentation, you can now turn on automatic captions in Google Slides.",
    "site_name": "Google",
    "url": "https://blog.google/outreach-initiatives/accessibility/whats-you-say-present-captions-google-slides/"
  },
  "author": [
    {
      "name": "Laura D’Aquila",
      "title": "Software Engineer",
      "department": "G Suite Accessibility",
      "company": ""
    },
    {
      "name": "Abigail Klein",
      "title": "Software Engineer",
      "department": "G Suite Accessibility",
      "company": ""
    }
  ]
}