{
  "id": "yt:video:4_OzoinTmw0",
  "yt:videoId": "4_OzoinTmw0",
  "yt:channelId": "UCPD_bxCRGpmmeQcbe2kpPaA",
  "title": "Cate Blanchett Pretends No One's Watching While Eating Spicy Wings | Hot Ones",
  "link": "",
  "author": {
    "name": "First We Feast",
    "uri": "https://www.youtube.com/channel/UCPD_bxCRGpmmeQcbe2kpPaA"
  },
  "published": "2022-10-27T15:00:06+00:00",
  "updated": "2022-10-29T19:04:46+00:00",
  "media:group": {
    "media:title": "Cate Blanchett Pretends No One's Watching While Eating Spicy Wings | Hot Ones",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Cate Blanchett is one of the most decorated and accomplished actors of our generation, with a resume that includes more than 70 films and 20-plus theater productions, along with multiple Golden Globe and Academy Awards. Her latest project is the Todd Field-written and -directed psychological drama, TÁR, in select theaters now, with a wider release scheduled for October 28th. But how is she with spicy food? Find out as the Hollywood icon takes on the wing of death and discusses Lord of the Rings, scary movies to watch on Halloween, and her problem with magicians.\n\nBUY HOT ONES BONELESS CHICKEN BITES NOW: https://hotoneschallenge.com/\n\nMAKE A DIFFERENCE BY DONATING TO COMMON THREADS, THE BRAND-NEW CHARITY PARTNER OF HOT ONES: https://www.commonthreads.org/firstwefeast/\n\nBUY HOT ONES TRUTH OR DAB THE GAME NOW: http://truthordabgame.com\n\nBUY HOT ONES HOT SAUCE NOW: https://fwfea.st/hotsauces\n\nHOT ONES MERCH AVAILABLE NOW: https://bit.ly/2AIS271\n\nSIGN UP FOR THE HOT ONES MONTHLY HOT SAUCE SUB BOX: https://bit.ly/2veY50P\n\nSIGN UP FOR THE FIRST WE FEAST NEWSLETTER: http://firstwefeast.com/signup\n\nSubscribe to First We Feast on YouTube: http://goo.gl/UxFzhK\n\nCheck out more of First We Feast here:\n\nhttp://firstwefeast.com/\n\nhttps://twitter.com/firstwefeast\n\nhttps://www.facebook.com/FirstWeFeast\n\nhttp://instagram.com/firstwefeast\n\nFirst We Feast videos offer an iconoclastic view into the culinary world, taking you behind-the-scenes with some of the country’s best chefs and finding the unexpected places where food and pop culture intersect. #hotones #cateblanchett #seanevans",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}