{
  "title": "Episode #351:  Biden Wins (Don&#8217;t Tell Trump); GOP Wins Too.",
  "link": "https://www.krpoliticaljunkie.com/episode-351-biden-wins-dont-tell-trump-gop-wins-too/",
  "pubDate": "Thu, 12 Nov 2020 00:11:06 +0000",
  "guid": "https://www.krpoliticaljunkie.com/?p=18523",
  "description": "<p>Joe Biden may have won the presidency, but he&#039;ll serve without the expected Democratic Senate victory, and with a smaller House majority as well.  And California Gov. Gavin Newsom will have a tough decision to make in naming a successor to Sen. Kamala Harris.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com/episode-351-biden-wins-dont-tell-trump-gop-wins-too/\">Episode #351:  Biden Wins (Don’t Tell Trump); GOP Wins Too.</a> appeared first on <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com\">Ken Rudin&#039;s Political Junkie</a>.</p>",
  "enclosure": "",
  "itunes:subtitle": "Joe Biden may have won the presidency, but he&#039;ll serve without the expected Democratic Senate victory, and with a smaller House majority as well.  And California Gov. Gavin Newsom will have a tough decision to make in naming a successor to Sen.",
  "itunes:summary": "Joe Biden is the president-elect and would be on his way to a smooth transition, except for one thing:  Donald Trump is not about to concede. But underneath Biden&#8217;s victory is the fact that not only did the GOP keep its Senate losses to a minimum, it picked up seats in the House &#8212; both contrary to predictions.  Carl Hulse of the New York Times explains the split-result of the 2020 elections.<br />\nAnd with Kamala Harris the vice president-elect, California Gov. Gavin Newsom will have the unenviable task of naming a successor to her Senate seat.  And as John Myers of the Los Angeles Times points out, there is no shortage of senator wannabes in the Golden State.  No matter who Newsom picks, there are bound to be sore feelings.<br />",
  "itunes:author": "Ken Rudin",
  "itunes:image": "",
  "itunes:episode": 351,
  "itunes:title": "Biden Wins (Don&#039;t Tell Trump); GOP Wins Too",
  "itunes:duration": "46:03"
}