{
  "title": "New system designs nanomaterials that conduct heat in specific ways",
  "link": "https://news.mit.edu/2022/nanomaterials-conduct-heat-chips-1007",
  "description": "The technique could be used to fabricate computer chips that won’t get too hot while operating, or materials that can convert waste heat to energy.",
  "pubDate": "Fri, 07 Oct 2022 00:00:00 -0400",
  "guid": "https://news.mit.edu/2022/nanomaterials-conduct-heat-chips-1007",
  "dc:creator": "Adam Zewe | MIT News Office",
  "content:encoded": "<p>Computer chips are packed with billions of microscopic transistors that enable powerful computation, but also generate a great deal of heat. A buildup of heat can slow a computer processor and make it less efficient and reliable. Engineers employ heat sinks to keep chips cool, sometimes along with fans or liquid cooling systems; however, these methods often require a lot of energy to operate.</p>\n\n<p></p>\n\n<p>Researchers at MIT have taken a different approach. They developed an algorithm and software system that can automatically design a nanoscale material that can conduct heat in a specific manner, such as channeling heat in only one direction.</p>\n\n<p></p>\n\n<p>Because these materials are measured in nanometers (a human hair is about 80,000 nanometers wide) they could be used in computer chips that can dissipate heat on their own due to the material’s geometry.</p>\n\n<p></p>\n\n<p>The researchers developed their system by taking computational techniques that have been traditionally used to develop large structures, and adapting them to create nanoscale materials with defined thermal properties.</p>\n\n<p></p>\n\n<p>They designed a material that can conduct heat along a preferred direction (an effect known as thermal anisotropy) and a material that can efficiently convert heat into electricity. They are using the latter design to fabricate a nanostructured silicon device for waste heat recovery at <a href=\"https://mitnano.mit.edu/\" target=\"_blank\">MIT.nano</a>.</p>\n\n<p></p>\n\n<p>Scientists typically use a combination of guesswork and trial-and-error to optimize a nanomaterial’s ability to conduct heat. Instead, someone could input the desired thermal properties into their software system and receive a design that can achieve those properties, and that can realistically be fabricated.</p>\n\n<p></p>\n\n<p>In addition to creating computer chips that can dissipate heat, the technique could be used to develop materials that can efficiently convert heat into electricity, known as thermoelectric materials. These materials could capture waste heat from a rocket’s engines, for instance, and use it to help power the spacecraft, explains lead author Giuseppe Romano, a research scientist at MIT’s Institute for Soldier Nanotechnology and a member of the MIT-IBM Watson AI Lab.</p>\n\n<p></p>\n\n<p>“The goal here to design these nanostructured materials that transport heat very differently than any natural materials,” says senior author Steven Johnson, professor of applied mathematics and physics who heads the Nanostructures and Computation Group within the MIT Research Laboratory for Electronics. “But the question is, how do you do this as efficiently as possible, rather than just trying a bunch of different things based on intuition? Giuseppe applied computational design to let the computer explore over many possible shapes and come up the one that has the best possible thermal properties.”</p>\n\n<p></p>\n\n<p>Their <a href=\"https://link.springer.com/article/10.1007/s00158-022-03392-w\" target=\"_blank\">research paper</a> is published today in <em>Structural and Multidisciplinary Optimization</em>.</p>\n\n<p></p>\n\n<p><strong>Controlling vibrations</strong></p>\n\n<p></p>\n\n<p>Heat in semiconductors travels through vibrations. Molecules vibrate faster as they heat up, causing nearby groups of molecules to start vibrating, and so on, moving heat through a material like a crowd of fans doing “the wave” at a baseball game. At the atomic scale, these waves of vibrations are captured into discrete packets of energy, known as phonons.</p>\n\n<p></p>\n\n<p>The researchers want to create nanoscale materials that control heat transfer in very specific ways, such as a material that conducts more heat in a horizontal direction and less heat in a vertical direction. To do this, they need to control how phonons move through the material.</p>\n\n<p></p>\n\n<p>The materials they focused on are known as periodic nanostructures, which are made by a lattice of structures with an arbitrary shape. Changing the sizes or the arrangement of these structures may dramatically alter the thermal properties of the entire system.</p>\n\n<p></p>\n\n<p>In principle, the researchers could have made some parts of these structures too narrow for phonons to pass through, controlling how heat can travel through the material. But there are virtually infinite configurations, so figuring out how to arrange them for some specific thermal properties using only intuition would have been extremely difficult.</p>\n\n<p></p>\n\n<p>“Instead, we borrowed a computational technique that was traditionally developed for structures like bridges. Imagine that we transform a material into a picture, and then we find the best pixel distribution that gives us the prescribed property,” says Romano.</p>\n\n<p></p>\n\n<p>Using this computational technique, an algorithm needs to figure out whether or not to place a hole at each pixel in the image.</p>\n\n<p></p>\n\n<p>“Because there are millions of pixels, if you just try each one, there are just too many possibilities to simulate. The way you have to optimize this is to start with some guess and then evolve it in a way of continuously deforming the structure to make it better and better,” Johnson explains.</p>\n\n<p></p>\n\n<p>But this kind of optimization is very difficult to achieve with nanomaterials.</p>\n\n<p></p>\n\n<p>For one, the physics of thermal transport behaves differently at the nanoscale, so the usual equations don’t work. Plus, modeling the movement of phonons is especially complex. One must know where they are in three-dimensional space as well as how fast they are moving and in what direction.</p>\n\n<p></p>\n\n<p><strong>Taming complex equations</strong></p>\n\n<p></p>\n\n<p>The researchers devised a new technique, known as the transmission interpolation method, that enables these very complex equations to behave in a way that the algorithm can handle. With this method, the computer can smoothly and continuously deform the material distribution until it achieves the desired thermal properties, rather than trying each pixel one at a time.</p>\n\n<p></p>\n\n<p>The team also created an <a href=\"https://github.com/romanodev/OpenBTE\" target=\"_blank\">open-source software system</a> and a <a href=\"https://www.mit.edu/~romanog/heatopt.html\" target=\"_blank\">web app</a> that enables a user to input desired thermal properties and receive a manufacturable nanoscale material structure. By making the system open source, the researchers hope to inspire other scientists to contribute to this area of research.</p>\n\n<p></p>\n\n<p>With this new tool in hand, the researchers are exploring other materials that can be optimized using this system, such as metal alloys, which could open the door to new applications. They are also studying methods to optimize thermal conductivity in three dimensions, rather than only horizontally and vertically.</p>\n\n<p></p>\n\n<p>“As far as I know, the paper by Romano and Johnson is among the first ones in performing topological optimal material design for nanoscale heat transfer with the phonon Boltzmann transport model. The technical novelty of their method is mainly in a clever integration of a transmission interpolation method with the Boltzmann transport model so that the gradient of the design objective function with respect to the structure of the material can be calculated,” says Kui Ren, a professor of applied mathematics at Columbia University, who was not involved with this work. “The idea is quite novel and general, and I can imagine that this idea will soon be adopted for topological design objectives with more complicated heat transport models, and in many other regimes of heat transfer applications.”</p>\n\n<p></p>\n\n<p>This research was partially supported by the MIT-IBM Watson AI Laboratory.</p>",
  "media:content": {
    "media:description": "This image shows a nanomaterial that has been digitized so its structure can be optimized using the researchers' computational technique, which designs nanomaterials that conduct heat in specific ways.",
    "media:credit": "Image: Courtesy of the researchers, edited by MIT News"
  },
  "category": [
    "Research",
    "Materials science and engineering",
    "Nanoscience and nanotechnology",
    "Electronics",
    "Algorithms",
    "Mathematics",
    "School of Science",
    "MIT.nano"
  ]
}