{
  "title": "Can a dentist become a data scientist?",
  "description": "You don't need a programming background or a PhD in order to become a data scientist. But what do you need?",
  "link": "https://www.dataschool.io/from-dentist-to-data-scientist/",
  "guid": "60ec80d964b9e0003beaac27",
  "dc:creator": "Kevin Markham",
  "pubDate": "Tue, 13 Jul 2021 15:57:37 GMT",
  "media:content": "",
  "content:encoded": "<!--kg-card-begin: markdown--><img src=\"https://www.dataschool.io/content/images/2021/07/wide_background-squashed.jpg\" alt=\"Can a dentist become a data scientist?\"><p>I recently received the following question from a reader:</p>\n<blockquote>\n<p>Dear Kevin, I'm a dentist!! I already made a career shift to quality improvement, and one of the interesting topics for me is data aggregation and analysis. <strong>I have no background in programming or engineering.</strong> In your opinion, is it suitable for me to become a data scientist?</p>\n</blockquote>\n<p>Here's what I think:</p>\n<p><strong>Data science involves writing code...</strong> there's really no way around it. There are point-and-click tools that can help with some tasks, but ultimately you will be severely limited as a data scientist if you only know how to point and click.</p>\n<p>That being said, <strong>I believe that anyone can learn how to write code</strong>, regardless of your educational background, as long as you are sufficiently motivated and dedicated. So that is my first question to the reader: Do you want to learn how to code?</p>\n<p>But of course, there is MUCH more to data science than just writing code. Because data science is ultimately about <strong>answering questions and solving problems using data.</strong></p>\n<p>Do you have an interest in data? Do you ask good questions? Do you think critically? Do you understand basic mathematics and logic? Those are all <strong>key qualities of a data scientist</strong>, and answering those questions will help the reader determine whether they're a good fit for this field.</p>\n<p><strong>But what about educational background?</strong> Don't you need to have a PhD and be fluent in advanced mathematics, visualization, computer science, databases, experimental design, and more?</p>\n<p>Not at all.</p>\n<p>To be clear, <strong>all of those things are useful</strong>, and would enable you to take your data science career in many different directions. They would help you to learn certain data science skills and technologies more quickly, avoid common data science mistakes, and open up many more doors.</p>\n<p>But you can still become a data scientist without that background, because <strong>being a data scientist is not about convincing someone else to hire you and give you that title.</strong> It's about answering questions and solving problems using data, and for many simple questions, you can do that without years of training and experience (assuming that you possess the necessary domain knowledge).</p>\n<p>There are so many methodologies under the umbrella of \"data science.\" Some methodologies are more useful than others for certain types of problems, but <strong>you don't need to learn every methodology in order to start solving problems.</strong></p>\n<p>Too many people have an exclusionary mindset, in which you aren't a data scientist unless you use their preferred methodology and their preferred tool to solve a problem. I have an inclusionary mindset, in which <strong>you're a data scientist once you can properly use the data science workflow to solve problems that interest you.</strong></p>\n<p>Learning data science is indeed a long journey, but even a dentist can <a href=\"https://www.dataschool.io/launch-your-data-science-career-with-python/\">get started today!</a></p>\n<p><strong>What do you think?</strong> Agree/disagree? Let me know in the comments!</p>\n<script async data-uid=\"d6d0f53c0f\" src=\"https://dataschool.ck.page/d6d0f53c0f/index.js\"></script><!--kg-card-end: markdown-->"
}