{
  "title": "Episode 16: &#8220;Crazy Man Crazy&#8221; by Bill Haley and the Comets",
  "link": "https://500songs.com/podcast/crazy-man-crazy-by-bill-haley-and-the-comets/",
  "pubDate": "Mon, 21 Jan 2019 06:11:18 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/crazy-man-crazy-by-bill-haley-and-the-comets/",
  "description": "Welcome to episode sixteen of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Crazy Man Crazy\" by Bill Haley and the Comets. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-16-crazy-man-crazy/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nUnfortunately, there aren't many good books about Bill Haley available. There are two biographies which are long out of print -- one by John Swenson which I read as a very small child, and one from the nineties by one of Haley's sons. Another of Haley's sons has a biography due out in April, which might be worthwhile, but until then the only book available is a self-published biography by Otto Fuchs. I relied on <a href=\"https://amzn.to/2T4cIhF\">volume one of Fuchs' book</a> for this post -- it's very good on the facts -- but it suffers from being written by someone whose first language is not English, and it also *badly* needs an editor, so I can't wholly recommend it.\n\n<a href=\"https://amzn.to/2R0zgOn\">This box set</a>, which is ridiculously cheap, contains almost every track anyone could want by Haley and the Comets, and it also includes the early country music sides I've excerpted here, as well as tracks by the Jodimars (a band consisting of ex-Comets). Unfortunately it doesn't contain his great late-fifties singles \"Lean Jean\" and \"Skinny Minnie\", but it has everything else.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nWe've talked before about how there were multiple different musics that got lumped together in the mid-fifties under the name \"rock and roll\". There's rockabilly, Chicago rhythm and blues, doo-wop, New Orleans R&B, the coastal jump bands, and Northern band rock and roll. We've looked at most of these – and the ones we haven't we'll be looking at over the next few weeks – but what we haven't looked at so far is Northern band rock and roll.\n\nAnd in many ways that's the most interesting of all the rock and roll musics, because it's the one that at first glance has had almost no obvious impact on anything that followed, but it's also the one that first came to the attention of the white American public as rock and roll – the one that made the newspapers and got the headlines. And it's the one that had only one real example. While the other styles of music had dozens of people making them, Northern band rock and roll really only had Bill Haley and the Comets. A whole pillar of rock and roll – a whole massive strand of the contemporary view of this music – was down to the work of one band who had no peers and left no real legacy.\n\nOr at least, they <em>seem</em> to have left no legacy, until you look a bit closer. But before we look at where the Comets' music led, we should look at where they were coming from.\n\nBill Haley didn't set out to be a rock and roll star, because when he started there was no such thing. He set out to be a country and western singer.\n\nHe played with various country bands over the years – bands with names like The Down Homers and the Texas Range Riders – before he decided to become a band leader himself, and started his own band, the Four Aces of Western Swing. Obviously this wasn't a full Western Swing band in the style of Bob Wills' band, but they played a stripped-down version which captured much of the appeal of the music – and which had a secret weapon in Haley himself, the Indiana State Yodelling Champion. Yes, yodelling. Let me explain. Jimmie Rodgers was a huge, huge, star, and his gimmick was his yodelling:\n\n[excerpt \"Blue Yodel (T For Texas)\": Jimmie Rodgers]\n\nEvery country singer in the 1940s wanted to sound like Jimmie Rodgers – at least until Ernest Tubb and Hank Williams came along and everyone wanted to sound like them instead. And that's the sound that Bill Haley was going for when he started the Four Aces of Western Swing.\n\n[excerpt of \"Yodel Your Blues Away\" by the Four Aces of Western Swing]\n\nThat's how Bill Haley started out – as a Jimmie Rodgers imitator whose greatest strength was his yodelling. It definitely doesn't sound like the work of someone who would change music forever. You'd expect, without knowing the rest of his history, that the Four Aces of Western Swing would become a footnote to a footnote; a band who, if they were remembered at all, would be remembered for one or two singles included on some big box set compilation of vintage country music. Much of their music was derivative in the extreme, but there were a handful of more interesting tracks, some of which would still be of interest to aficionados, like \"Foolish Questions\".\n\n[Excerpt of \"Foolish Questions\" by the Four Aces of Western Swing]\n\nBut without Bill Haley's future career, it's unlikely there'd be any more attention paid to the Four Aces than that. They don't really make a dent in country music history, and didn't have the kind of career that suggested they would ever do so. Most of their records didn't even get a proper release – Haley was signed to a label called Cowboy Records, which was a Mafia-run organisation. The first five thousand copies of every Cowboy release went to Mafia-owned jukeboxes, for free, and artists would only get royalties on any records sold after that. Since jukeboxes accounted for the majority of the money in the record business at this point, that didn't leave much for the artists – especially as Haley had to pay his own recording and production costs, and he had to do any promotion himself – buying boxes of records at $62.50 for two hundred and fifty copies, and sending them out to DJs through the post at his own expense. It was basically a glorified vanity label, and the only reason Haley got any airplay at all was because he was himself a DJ. And after a few unsuccessful singles, he decided to give up on performance and become just a DJ.\n\nBut soon Haley had a new band, which would become far more successful – Bill Haley and his... Saddlemen.\n\nYes, the Saddlemen.\n\nBy all accounts, the Saddlemen weren't Haley's idea. One day two musicians turned up at the radio station, saying they wanted to join his band. Billy Williamson and Johnny Grande were unhappy with the band they were performing in, and had heard Haley performing with his band on the radio. They had decided that Haley's band would be a perfect showcase for their talents on steel guitar and accordion, and had travelled from Newark New Jersey to Chester Pennsylvania to see him. But they'd showed up to discover that he didn't have a band any more. They eventually persuaded him that it would be worth his while going back into music, and Haley arranged for the band to get a show once a week on the station he was DJing on.\n\nWhile Haley was the leader on stage, they were an equal partnership – the Saddlemen, and later the Comets, split money four ways between Haley, Williamson, Grande, and the band's manager, with any other band members who were later hired, such as drummers and bass players, being on a fixed salary paid out by the partnership.\n\nThe band didn't make much money at first -- they all had other jobs, with Williamson and Grande working all sorts of odd jobs, while Haley was doing so much work at the radio station that he often ended up sleeping there. Haley worked so hard that his marriage disintegrated, but the Saddlemen had one big advantage – they had the radio station's recording studio to use for their rehearsals, and they were able to use the studio's recording equipment to play back their rehearsals and learn, something that very few bands had at the time. They spent two whole years rehearsing every day, and taking whatever gigs they could, and that eventually started to pay off.\n\nThe Saddlemen started out making the same kind of music that the Four Aces had made. They put out decent, but not massively impressive, records on all sorts of tiny labels. Most of these recordings were called things like \"Ten Gallon Stetson\", and in one case the single wasn't even released as the Saddlemen but as Reno Browne and Her Buckaroos. This was about as generic as country and western music could get.\n\n[excerpt: “My Sweet Little Gal From Nevada” – Reno Browne and Her Buckaroos]\n\nBut Bill Haley had bigger plans, inspired by the show that was on right before his.\n\nThe radio had changed enormously in a very short period of time. Before the Second World War, playing records on the radio had been almost unknown, until in 1935 the first recognised DJ, Martin Block, started his radio show \"Make Believe Ballroom\", in which he would pretend to be introducing all sorts of different bands. The record labels spent much of the next few years fighting the same kind of copyright actions they would later fight against the Internet -- in this case aided by the Musicians' Union, but harmed by the fact that there was no federal copyright protection for sound recordings until the 1970s.\n\nIndeed a lot of the musicians' strikes of the 1940s were, in part, about the issue of playing records on the radio. But eventually, the record labels -- especially the ones, like RCA and Columbia, which were also radio network owners -- realised that being played on the radio was great advertising for their records, and stopped fighting it.\n\nAnd at the same time, there was a massive expansion in radio stations -- and a drop in advertising money. After the war, restrictions on broadcasting were lifted, and within four years there were more than twice as many radio stations as there had been in 1946. But at the same time, the networks were no longer making as much money from advertising, which started going to TV instead. The solution was to go for cheap, local, programming -- and there was little programming that was cheaper than getting a man to sit in the studio and play records.\n\nAnd in 1948 and 49, Columbia and RCA introduced \"high fidelity\" records -- the 33RPM album from Columbia, and the 45RPM single from RCA. These didn't have the problems that 78s had, of poor sound quality and quick degradation, and so the final barrier to radio stations becoming devoted to recorded music was lifted.\n\nThis is, incidentally, why the earlier musicians we've talked about in this series are largely forgotten compared to musicians from even a few years later -- their records came out on 78s. Radio stations threw out all their old 78s when they could start playing 45s, and so you'd never hear a Wynonie Harris or Louis Jordan played even as a golden oldie, because the radio stations didn't have those records any more. They disappeared from the cultural memory, in a way the fifties acts didn't.\n\nAnd the time we're talking about now is right when that growth in the radio was at its height, and all the new radio stations were turning to recorded music.\n\nBut in the early fifties, only a handful of stations were playing black music, only for an hour or two a day at most. And when they did, the DJ was always a white man -- but usually a white man who could sound black, and thought himself part of black culture. Zenas Sears in Atlanta, Dewey Phillips in Memphis, Alan Freed in Cleveland, Johnny Otis in LA -- all of these were people who even many of their black listeners presumed were black, playing black records, speaking in black slang. All of them, of course, used their privilege as white men to get jobs that black people simply weren't given. But that was the closest that black people came to representation on the radio at the time, and those radio shows were precious to many of them. People would tune in from hundreds of miles away to hear those few DJs who for one hour a day were playing their music.\n\nAnd the show that was on before Bill Haley's country and western show was one of those handful of R&B shows. \"Judge Rhythm's Court\" was presented by a white man in his forties named Jim Reeves (not the singer of the same name) under the name of \"Shorty the Bailiff\". Reeves' theme was \"Rock the Joint\" by Jimmy Preston and the Prestonians:\n\n[excerpt \"Rock the Joint\", Jimmy Preston and the Prestonians]\n\nHaley liked the music that Reeves was playing -- in particular, he became a big fan of Big Joe Turner and Ruth Brown -- and he started adding some of the R&B songs to the Saddlemen's setlists, and noticed they went down especially well with the younger audiences. But they didn't record those songs in their rare recording sessions for small labels.\n\nUntil, that is, the Saddlemen signed up to Holiday Records. As soon as they started with Holiday, their style changed completely.\n\nHoliday, and its sister label Essex which also released Saddlemen records, were owned by Dave Miller, who also owned the pressing plant that had pressed Haley's earlier records for the Cowboy label, and Miller had similar mob connections. Haley would later claim that while Miller always said the money to start the record labels had come from a government subsidy, in fact it had been paid by the Mafia. His labels had started up during the musicians' union strikes of the 1940s, to put out records by non-union musicians, and Miller wasn't too concerned about bothering to pay royalties or other such niceties.\n\nHaley also later claimed that Miller invented payola – the practice of paying DJs to play records. This was something that a lot of independent labels did in the early fifties, and was one of the ways they managed to get heard, even as many of the big labels were still cautious about the radio.\n\nMiller wanted to have big hits, and in particular he wanted to find ways to get both the white and black markets with the same records, and here he had an ally in Haley, who took a scientific approach to maximising his band's success. Haley would try things like turning up the band's amplifiers, on the theory that if customers couldn't hear themselves talking, they'd be more likely to dance – and then turning the amps back down when the bar owners would complain that if the customers danced too much they wouldn't buy as many drinks.\n\nHaley was willing to work hard and try literally anything in order to make his band a success, and wasn't afraid to try new ideas and then throw them away if they didn't work. This makes his discography frustrating for listeners now – it's a long record of failed experiments, dead ends, and stylistic aberrations unlike almost any other successful artist's. This is someone not blessed with a huge abundance of natural talent, but willing to work much harder in order to make a success of things anyway.\n\nMiller was a natural ally in this, and they hit on a formula which would be independently reinvented a couple of years later by Sam Phillips for Elvis' records – putting out singles with a country song on one side and an R&B song on the other, to try to appeal to both white and black markets.\n\nAnd one song that Dave Miller heard and thought that might suit Haley's band was \"Rocket 88\"\n\nThis might have seemed an odd decision – after all, \"Rocket 88\" was a horn-driven rhythm and blues song, while the Saddlemen at this point consisted of Haley on acoustic guitar, double-bass player Al Rex, Billy Williamson on steel guitar, and Johnny Grande, an accordion player who could double on piano.\n\nThis doesn't sound the most propitious lineup for an R&B song, but along with ace session guitarist Danny Cedrone they actually managed to come up with something rather impressive:\n\n[excerpt of \"Rocket 88\"]\n\nObviously it's not a patch on the original, but translating that R&B song into a western swing style had ended up with something a little different to the hillbilly boogie one might expect. In particular, there's the drum sound....\n\nOh wait, there's no drumming there.\n\nWhat do you mean, you heard it?\n\nLet's listen again...\n\n[excerpt of \"Rocket 88\"]\n\nThere are no drums there. It's what's called slapback bass.\n\nNow, before we go any further, I'd better explain that there's some terminological confusion, because \"slap bass\" is a similar but not identical electric bass technique, while the word \"slapback\" is also used for the echo used on some rockabilly records, so talking about \"rockabilly slapback bass\" can end up a bit like \"Who's on first?\"\n\nBut what I mean when I talk about slapback bass is a style of bass playing used on many rockabilly records. It's used in other genres, too, but it basically came to rockabilly because of Bill Haley's band, and because of the playing style Haley's bass players Al Rex and Marshall Lytle used.\n\nWith slapback bass, you're playing a double bass, and you play it pizzicato, plucking the strings. But you don't just pluck them, you pull them forward and let them slap right back onto the bridge of the instrument, which makes a sort of clicking sound. At the same time, you might also hit the strings to mute them – which also makes a clicking sound as well. And you might also hit the body of the instrument, making a loud thumping noise.\n\nGiven the recording techniques in use at the time, slapback bass could often sound a lot like drums on a recording, though you'd never mistake one for the other in a live performance.\n\nAnd at a time when country music wasn't particularly keen on the whole idea of a drum kit – which was seen as a dangerous innovation from the jazz world, not something that country and western musicians should be playing, though by this time Bob Wills had been using one in his band for a decade – having something else that could keep the beat and act as a percussion instrument was vital, and slapback bass was one of the big innovations that Haley's band popularised.\n\nSo yes, Bill Haley and the Saddlemen's version of \"Rocket 88\" had no drum kit on it. Despite this, some people still cite this, rather than Jackie Brenston's original, as \"the first rock and roll record\". As we've said many times, though, there is no such thing. But Haley's recording makes an attractive candidate – it's the mythical \"merging of black R&B with white country music\", which of course was something that had been happening since the very start, but which people seem to regard as something that marked out rock and roll, and it's the first recording in this style by the person who went on to have the first really massive rock and roll hit to cross over into the pop charts.\n\n\"Rocket 88\" wasn't that big hit. But Haley and Miller felt like they were on to something, and they kept trying to come up with something that would work in that style. They put out quite a few singles that were almost, but not quite, what they were after, things like a remake of \"Wabash Cannonball\" retitled \"Jukebox Cannonball\", and then they finally hit on the perfect formula with \"Rock the Joint\", which had been in Haley's setlist off and on since he heard it on Jim Reeves' programme.\n\nThe original \"Rock the Joint\" had been one of the many, many, records that attempted to cash in on the rock craze ignited by Wynonie Harris' version of \"Good Rockin' Tonight\", but it hadn't done much outside of the Philadelphia area. Haley and the band went into the studio to record their own version, which had a very different arrangement – and listen in particular to the solo...\n\n[excerpt \"Rock the Joint\" – Bill Haley and the Saddlemen]\n\nThat solo is played by the session musician, Danny Cedrone, who played the lead guitar on almost all of Haley's early records. He wasn't a member of the band – Haley kept costs low in these early years by having as small a band as possible, but hiring extra musicians for the recordings to beef up the sound -- but he was someone that Haley trusted to always play the right parts on his records.\n\nHaley and Cedrone were close enough that in 1952 – after \"Rocket 88\" but before \"Rock the Joint\" – Haley gave Cedrone a song for his own band, The Esquire Boys. That song, \"Rock-A-Beatin' Boogie\", would probably have been a hit for Haley, had he recorded it at the time -- instead, he didn't record it for another three years. But that song, too, shows that he was on the right track. He was searching for something, and finding it occasionally, but not always recognising it when he had it.\n\n(Excerpt: \"Rock-A-Beatin' Boogie\" by The Esquire Boys)\n\n\"Rock the Joint\" was a massive success, by the standards of a small indie country label, reportedly selling as much as four hundred thousand copies. But even after \"Rock the Joint\", the problems continued. Haley's next two records were \"Dance With a Dolly (With a Hole in Her Stockin')\" – which was to the tune of \"Buffalo Gals Won't You Come Out Tonight?\" – and \"Stop Beatin' Around the Mulberry Bush\", which was a rewrite of \"Here We Go Round the Mulberry Bush\" as a hillbilly boogie.\n\nBut \"Stop Beatin' Around the Mulberry Bush\" was notable for one reason – it was the first record by \"Bill Haley and Haley's Comets\", rather than by the Saddlemen. The pun on Halley's comet was obvious, but the real importance of the name change is that it marked a definitive moment when the band stopped thinking of themselves as a country and western band and started thinking of themselves as something else – Haley didn't pick up on the term \"rock and roll\" til fairly late, but it was clear that that was what he thought he should be doing now. They now had a drummer, too – Dick Richards – and a sax player. Al Rex was temporarily gone, replaced by Marshall Lytle, but Rex would be back in 1955.\n\nThey were still veering wildly between rhythm and blues covers, country songs, and outright novelty records, but they were slowly narrowing down what they were trying to do, and hitting a target more and more often – they were making records about rhythm, using slang catchphrases and trying to appeal to a younger audience.\n\nAnd there was a genuine excitement in some of their stage performances. Haley would never be the most exciting vocalist when working in this new rock and roll idiom – he was someone who was a natural country singer and wasn't familiar with the idioms he was incorporating into his new music, so there was a sense of distance there – but the band would make up for that on stage, with the bass player riding his bass (a common technique for getting an audience going at this point) and the saxophone player lying on his back to play solos.\n\nAnd that excitement shone through in \"Crazy Man Crazy\", which became the Comets' first real big hit.\n\nThis was another example of the way that Haley would take a scientific approach to his band's success. He and his band members had realised that the key to success in the record business was going to be appealing to teenagers, who were a fast-growing demographic and who, for the first time in American history, had some real buying power. But teenagers couldn't go to the bars where country musicians played, and at the time there were very few entertainment venues of any type that catered to teenagers.\n\nSo Bill Haley and the Comets played, by Johnny Grande's count, one hundred and eighty-three school assemblies, for free. And at every show they would make note of what songs the kids liked, which ones got them dancing, which ones they were less impressed by, and they would hone their act to appeal to these kids.\n\nAnd one thing Haley noted was that the teenagers' favourite slang expression was \"crazy\", and so he wrote...\n\n[excerpt: Crazy Man Crazy, Bill Haley and the Comets]\n\nThat went to number fifteen on the pop charts, a truly massive success for a country and western band.\n\nMarshall Lytle, the Comets' bass player, later claimed that he had co-written the song and not got the credit, but the other Comets disputed his claims.\n\nThis is another of those records that is cited as the first rock and roll record, or the first rock and roll hit, and certainly it's the first example of a <em>white</em> band playing this kind of music to make the charts. And, more fairly to Haley, it's the first example of a band using guitars as their primary instruments to get onto the charts playing something that resembles jump band music. \"Crazy Man Crazy\" is very clearly patterned after Louis Jordan, but those guitar fills would be played by a horn section on Jordan's records.\n\nWith Danny Cedrone's solos, Bill Haley and the Comets were responsible for making the guitar the standard lead instrument for rock and roll, although it took a while for that to *become* the standard and we will see plenty of piano and saxophone, including on later records by Haley himself.\n\nSo why was Haley doing something so different from what everyone else did? In part, I think that can be linked to the reason he didn't stay successful very long – he wasn't part of a scene at all.\n\nWhen we look at almost all the other musicians we're talking about in this series, you'll see that they're all connected to other musicians. The myth of the lone genius is just that – a myth. What actually tends to happen is that the \"lone genius\" is someone who uses the abilities of others and then pretends it was all himself – and it almost always is a him. There's a whole peer group there, who get conveniently erased.\n\nBut the fact remains that Haley and the Comets, as a group, didn't have any kind of peer group or community. They weren't part of a scene, and really had no peers doing what they were doing. There was no-one to tell them what to do, or what not to do.\n\nSo Bill Haley and the Comets had started something unique. But it was that very uniqueness that was to cause them problems, as we'll see when we return to them in a few weeks...",
  "itunes:subtitle": "Welcome to episode sixteen of A History of Rock Music in Five Hundred Songs. Today were looking at Crazy Man Crazy by Bill Haley and the Comets. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResou",
  "itunes:keywords": "1940s music strikes,Bill Haley,country and western,Dave Miller,hillbilly boogie,Jackie Brenston,Jimmie Rodgers,payola,rockabilly,western swing",
  "itunes:episodeType": "full",
  "itunes:episode": 16,
  "content:encoded": "Welcome to episode sixteen of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Crazy Man Crazy\" by Bill Haley and the Comets. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-16-crazy-man-crazy/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nUnfortunately, there aren't many good books about Bill Haley available. There are two biographies which are long out of print -- one by John Swenson which I read as a very small child, and one from the nineties by one of Haley's sons. Another of Haley's sons has a biography due out in April, which might be worthwhile, but until then the only book available is a self-published biography by Otto Fuchs. I relied on <a href=\"https://amzn.to/2T4cIhF\">volume one of Fuchs' book</a> for this post -- it's very good on the facts -- but it suffers from being written by someone whose first language is not English, and it also *badly* needs an editor, so I can't wholly recommend it.\n\n<a href=\"https://amzn.to/2R0zgOn\">This box set</a>, which is ridiculously cheap, contains almost every track anyone could want by Haley and the Comets, and it also includes the early country music sides I've excerpted here, as well as tracks by the Jodimars (a band consisting of ex-Comets). Unfortunately it doesn't contain his great late-fifties singles \"Lean Jean\" and \"Skinny Minnie\", but it has everything else.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nWe've talked before about how there were multiple different musics that got lumped together in the mid-fifties under the name \"rock and roll\". There's rockabilly, Chicago rhythm and blues, doo-wop, New Orleans R&B, the coastal jump bands, and Northern band rock and roll. We've looked at most of these – and the ones we haven't we'll be looking at over the next few weeks – but what we haven't looked at so far is Northern band rock and roll.\n\nAnd in many ways that's the most interesting of all the rock and roll musics, because it's the one that at first glance has had almost no obvious impact on anything that followed, but it's also the one that first came to the attention of the white American public as rock and roll – the one that made the newspapers and got the headlines. And it's the one that had only one real example. While the other styles of music had dozens of people making them, Northern band rock and roll really only had Bill Haley and the Comets. A whole pillar of rock and roll – a whole massive strand of the contemporary view of this music – was down to the work of one band who had no peers and left no real legacy.\n\nOr at least, they <em>seem</em> to have left no legacy, until you look a bit closer. But before we look at where the Comets' music led, we should look at where they were coming from.\n\nBill Haley didn't set out to be a rock and roll star, because when he started there was no such thing. He set out to be a country and western singer.\n\nHe played with various country bands over the years – bands with names like The Down Homers and the Texas Range Riders – before he decided to become a band leader himself, and started his own band, the Four Aces of Western Swing. Obviously this wasn't a full Western Swing band in the style of Bob Wills' band, but they played a stripped-down version which captured much of the appeal of the music – and which had a secret weapon in Haley himself, the Indiana State Yodelling Champion. Yes, yodelling. Let me explain. Jimmie Rodgers was a huge, huge, star, and his gimmick was his yodelling:\n\n[excerpt \"Blue Yodel (T For Texas)\": Jimmie Rodgers]\n\nEvery country singer in the 1940s wanted to sound like Jimmie Rodgers – at least until Ernest Tubb and Hank Williams came along and everyone wanted to sound like them instead. And that's the sound that Bill Haley was going for when he started the Four Aces of Western Swing.\n\n[excerpt of \"Yodel Your Blues Away\" by the Four Aces of Western Swing]\n\nThat's how Bill Haley started out – as a Jimmie Rodgers imitator whose greatest strength was his yodelling. It definitely doesn't sound like the work of someone who would change music forever. You'd expect, without knowing the rest of his history, that the Four Aces of Western Swing would become a footnote to a footnote; a band who, if they were remembered at all, would be remembered for one or two singles included on some big box set compilation of vintage country music. Much of their music was derivative in the extreme, but there were a handful of more interesting tracks, some of which would still be of interest to aficionados, like \"Foolish Questions\".\n\n[Excerpt of \"Foolish Questions\" by the Four Aces of Western Swing]\n\nBut without Bill Haley's future career, it's unlikely there'd be any more attention paid to the Four Aces than that. They don't really make a dent in country music history, and didn't have the kind of career that suggested they would ever do so. Most of their records didn't even get a proper release – Haley was signed to a label called Cowboy Records, which was a Mafia-run organisation. The first five thousand copies of every Cowboy release went to Mafia-owned jukeboxes, for free, and artists would only get royalties on any records sold after that. Since jukeboxes accounted for the majority of the money in the record business at this point, that didn't leave much for the artists – especially as Haley had to pay his own recording and production costs, and he had to do any promotion himself – buying boxes of records at $62.50 for two hundred and fifty copies, and sending them out to DJs through the post at his own expense. It was basically a glorified vanity label, and the only reason Haley got any airplay at all was because he was himself a DJ. And after a few unsuccessful singles, he decided to give up on performance and become just a DJ.\n\nBut soon Haley had a new band, which would become far more successful – Bill Haley and his... Saddlemen.\n\nYes, the Saddlemen.\n\nBy all accounts, the Saddlemen weren't Haley's idea. One day two musicians turned up at the radio station, saying they wanted to join his band. Billy Williamson and Johnny Grande were unhappy with the band they were performing in, and had heard Haley performing with his band on the radio. They had decided that Haley's band would be a perfect showcase for their talents on steel guitar and accordion, and had travelled from Newark New Jersey to Chester Pennsylvania to see him. But they'd showed up to discover that he didn't have a band any more. They eventually persuaded him that it would be worth his while going back into music, and Haley arranged for the band to get a show once a week on the station he was DJing on.\n\nWhile Haley was the leader on stage, they were an equal partnership – the Saddlemen, and later the Comets, split money four ways between Haley, Williamson, Grande, and the band's manager, with any other band members who were later hired, such as drummers and bass players, being on a fixed salary paid out by the partnership.\n\nThe band didn't make much money at first -- they all had other jobs, with Williamson and Grande working all sorts of odd jobs, while Haley was doing so much work at the radio station that he often ended up sleeping there. Haley worked so hard that his marriage disintegrated, but the Saddlemen had one big advantage – they had the radio station's recording studio to use for their rehearsals, and they were able to use the studio's recording equipment to play back their rehearsals and learn, something that very few bands had at the time. They spent two whole years rehearsing every day, and taking whatever gigs they could, and that eventually started to pay off.\n\nThe Saddlemen started out making the same kind of music that the Four Aces had made. They put out decent, but not massively impressive, records on all sorts of tiny labels. Most of these recordings were called things like \"Ten Gallon Stetson\", and in one case the single wasn't even released as the Saddlemen but as Reno Browne and Her Buckaroos. This was about as generic as country and western music could get.\n\n[excerpt: “My Sweet Little Gal From Nevada” – Reno Browne and Her Buckaroos]\n\nBut Bill Haley had bigger plans, inspired by the show that was on right before his.\n\nThe radio had changed enormously in a very short period of time. Before the Second World War, playing records on the radio had been almost unknown, until in 1935 the first recognised DJ, Martin Block, started his radio show \"Make Believe Ballroom\", in which he would pretend to be introducing all sorts of different bands. The record labels spent much of the next few years fighting the same kind of copyright actions they would later fight against the Internet -- in this case aided by the Musicians' Union, but harmed by the fact that there was no federal copyright protection for sound recordings until the 1970s.\n\nIndeed a lot of the musicians' strikes of the 1940s were, in part, about the issue of playing records on the radio. But eventually, the record labels -- especially the ones, like RCA and Columbia, which were also radio network owners -- realised that being played on the radio was great advertising for their records, and stopped fighting it.\n\nAnd at the same time, there was a massive expansion in radio stations -- and a drop in advertising money. After the war, restrictions on broadcasting were lifted, and within four years there were more than twice as many radio stations as there had been in 1946. But at the same time, the networks were no longer making as much money from advertising, which started going to TV instead. The solution was to go for cheap, local, programming -- and there was little programming that was cheaper than getting a man to sit in the studio and play records.\n\nAnd in 1948 and 49, Columbia and RCA introduced \"high fidelity\" records -- the 33RPM album from Columbia, and the 45RPM single from RCA. These didn't have the problems that 78s had, of poor sound quality and quick degradation, and so the final barrier to radio stations becoming devoted to recorded music was lifted.\n\nThis is, incidentally, why the earlier musicians we've talked about in this series are largely forgotten compared to musicians from even a few years later -- their records came out on 78s. Radio stations threw out all their old 78s when they could start playing 45s, and so you'd never hear a Wynonie Harris or Louis Jordan played even as a golden oldie, because the radio stations didn't have those records any more. They disappeared from the cultural memory, in a way the fifties acts didn't.\n\nAnd the time we're talking about now is right when that growth in the radio was at its height, and all the new radio stations were turning to recorded music.\n\nBut in the early fifties, only a handful of stations were playing black music, only for an hour or two a day at most. And when they did, the DJ was always a white man -- but usually a white man who could sound black, and thought himself part of black culture. Zenas Sears in Atlanta, Dewey Phillips in Memphis, Alan Freed in Cleveland, Johnny Otis in LA -- all of these were people who even many of their black listeners presumed were black, playing black records, speaking in black slang. All of them, of course, used their privilege as white men to get jobs that black people simply weren't given. But that was the closest that black people came to representation on the radio at the time, and those radio shows were precious to many of them. People would tune in from hundreds of miles away to hear those few DJs who for one hour a day were playing their music.\n\nAnd the show that was on before Bill Haley's country and western show was one of those handful of R&B shows. \"Judge Rhythm's Court\" was presented by a white man in his forties named Jim Reeves (not the singer of the same name) under the name of \"Shorty the Bailiff\". Reeves' theme was \"Rock the Joint\" by Jimmy Preston and the Prestonians:\n\n[excerpt \"Rock the Joint\", Jimmy Preston and the Prestonians]\n\nHaley liked the music that Reeves was playing -- in particular, he became a big fan of Big Joe Turner and Ruth Brown -- and he started adding some of the R&B songs to the Saddlemen's setlists, and noticed they went down especially well with the younger audiences. But they didn't record those songs in their rare recording sessions for small labels.\n\nUntil, that is, the Saddlemen signed up to Holiday Records. As soon as they started with Holiday, their style changed completely.\n\nHoliday, and its sister label Essex which also released Saddlemen records, were owned by Dave Miller, who also owned the pressing plant that had pressed Haley's earlier records for the Cowboy label, and Miller had similar mob connections. Haley would later claim that while Miller always said the money to start the record labels had come from a government subsidy, in fact it had been paid by the Mafia. His labels had started up during the musicians' union strikes of the 1940s, to put out records by non-union musicians, and Miller wasn't too concerned about bothering to pay royalties or other such niceties.\n\nHaley also later claimed that Miller invented payola – the practice of paying DJs to play records. This was something that a lot of independent labels did in the early fifties, and was one of the ways they managed to get heard, even as many of the big labels were still cautious about the radio.\n\nMiller wanted to have big hits, and in particular he wanted to find ways to get both the white and black markets with the same records, and here he had an ally in Haley, who took a scientific approach to maximising his band's success. Haley would try things like turning up the band's amplifiers, on the theory that if customers couldn't hear themselves talking, they'd be more likely to dance – and then turning the amps back down when the bar owners would complain that if the customers danced too much they wouldn't buy as many drinks.\n\nHaley was willing to work hard and try literally anything in order to make his band a success, and wasn't afraid to try new ideas and then throw them away if they didn't work. This makes his discography frustrating for listeners now – it's a long record of failed experiments, dead ends, and stylistic aberrations unlike almost any other successful artist's. This is someone not blessed with a huge abundance of natural talent, but willing to work much harder in order to make a success of things anyway.\n\nMiller was a natural ally in this, and they hit on a formula which would be independently reinvented a couple of years later by Sam Phillips for Elvis' records – putting out singles with a country song on one side and an R&B song on the other, to try to appeal to both white and black markets.\n\nAnd one song that Dave Miller heard and thought that might suit Haley's band was \"Rocket 88\"\n\nThis might have seemed an odd decision – after all, \"Rocket 88\" was a horn-driven rhythm and blues song, while the Saddlemen at this point consisted of Haley on acoustic guitar, double-bass player Al Rex, Billy Williamson on steel guitar, and Johnny Grande, an accordion player who could double on piano.\n\nThis doesn't sound the most propitious lineup for an R&B song, but along with ace session guitarist Danny Cedrone they actually managed to come up with something rather impressive:\n\n[excerpt of \"Rocket 88\"]\n\nObviously it's not a patch on the original, but translating that R&B song into a western swing style had ended up with something a little different to the hillbilly boogie one might expect. In particular, there's the drum sound....\n\nOh wait, there's no drumming there.\n\nWhat do you mean, you heard it?\n\nLet's listen again...\n\n[excerpt of \"Rocket 88\"]\n\nThere are no drums there. It's what's called slapback bass.\n\nNow, before we go any further, I'd better explain that there's some terminological confusion, because \"slap bass\" is a similar but not identical electric bass technique, while the word \"slapback\" is also used for the echo used on some rockabilly records, so talking about \"rockabilly slapback bass\" can end up a bit like \"Who's on first?\"\n\nBut what I mean when I talk about slapback bass is a style of bass playing used on many rockabilly records. It's used in other genres, too, but it basically came to rockabilly because of Bill Haley's band, and because of the playing style Haley's bass players Al Rex and Marshall Lytle used.\n\nWith slapback bass, you're playing a double bass, and you play it pizzicato, plucking the strings. But you don't just pluck them, you pull them forward and let them slap right back onto the bridge of the instrument, which makes a sort of clicking sound. At the same time, you might also hit the strings to mute them – which also makes a clicking sound as well. And you might also hit the body of the instrument, making a loud thumping noise.\n\nGiven the recording techniques in use at the time, slapback bass could often sound a lot like drums on a recording, though you'd never mistake one for the other in a live performance.\n\nAnd at a time when country music wasn't particularly keen on the whole idea of a drum kit – which was seen as a dangerous innovation from the jazz world, not something that country and western musicians should be playing, though by this time Bob Wills had been using one in his band for a decade – having something else that could keep the beat and act as a percussion instrument was vital, and slapback bass was one of the big innovations that Haley's band popularised.\n\nSo yes, Bill Haley and the Saddlemen's version of \"Rocket 88\" had no drum kit on it. Despite this, some people still cite this, rather than Jackie Brenston's original, as \"the first rock and roll record\". As we've said many times, though, there is no such thing. But Haley's recording makes an attractive candidate – it's the mythical \"merging of black R&B with white country music\", which of course was something that had been happening since the very start, but which people seem to regard as something that marked out rock and roll, and it's the first recording in this style by the person who went on to have the first really massive rock and roll hit to cross over into the pop charts.\n\n\"Rocket 88\" wasn't that big hit. But Haley and Miller felt like they were on to something, and they kept trying to come up with something that would work in that style. They put out quite a few singles that were almost, but not quite, what they were after, things like a remake of \"Wabash Cannonball\" retitled \"Jukebox Cannonball\", and then they finally hit on the perfect formula with \"Rock the Joint\", which had been in Haley's setlist off and on since he heard it on Jim Reeves' programme.\n\nThe original \"Rock the Joint\" had been one of the many, many, records that attempted to cash in on the rock craze ignited by Wynonie Harris' version of \"Good Rockin' Tonight\", but it hadn't done much outside of the Philadelphia area. Haley and the band went into the studio to record their own version, which had a very different arrangement – and listen in particular to the solo...\n\n[excerpt \"Rock the Joint\" – Bill Haley and the Saddlemen]\n\nThat solo is played by the session musician, Danny Cedrone, who played the lead guitar on almost all of Haley's early records. He wasn't a member of the band – Haley kept costs low in these early years by having as small a band as possible, but hiring extra musicians for the recordings to beef up the sound -- but he was someone that Haley trusted to always play the right parts on his records.\n\nHaley and Cedrone were close enough that in 1952 – after \"Rocket 88\" but before \"Rock the Joint\" – Haley gave Cedrone a song for his own band, The Esquire Boys. That song, \"Rock-A-Beatin' Boogie\", would probably have been a hit for Haley, had he recorded it at the time -- instead, he didn't record it for another three years. But that song, too, shows that he was on the right track. He was searching for something, and finding it occasionally, but not always recognising it when he had it.\n\n(Excerpt: \"Rock-A-Beatin' Boogie\" by The Esquire Boys)\n\n\"Rock the Joint\" was a massive success, by the standards of a small indie country label, reportedly selling as much as four hundred thousand copies. But even after \"Rock the Joint\", the problems continued. Haley's next two records were \"Dance With a Dolly (With a Hole in Her Stockin')\" – which was to the tune of \"Buffalo Gals Won't You Come Out Tonight?\" – and \"Stop Beatin' Around the Mulberry Bush\", which was a rewrite of \"Here We Go Round the Mulberry Bush\" as a hillbilly boogie.\n\nBut \"Stop Beatin' Around the Mulberry Bush\" was notable for one reason – it was the first record by \"Bill Haley and Haley's Comets\", rather than by the Saddlemen. The pun on Halley's comet was obvious, but the real importance of the name change is that it marked a definitive moment when the band stopped thinking of themselves as a country and western band and started thinking of themselves as something else – Haley didn't pick up on the term \"rock and roll\" til fairly late, but it was clear that that was what he thought he should be doing now. They now had a drummer, too – Dick Richards – and a sax player. Al Rex was temporarily gone, replaced by Marshall Lytle, but Rex would be back in 1955.\n\nThey were still veering wildly between rhythm and blues covers, country songs, and outright novelty records, but they were slowly narrowing down what they were trying to do, and hitting a target more and more often – they were making records about rhythm, using slang catchphrases and trying to appeal to a younger audience.\n\nAnd there was a genuine excitement in some of their stage performances. Haley would never be the most exciting vocalist when working in this new rock and roll idiom – he was someone who was a natural country singer and wasn't familiar with the idioms he was incorporating into his new music, so there was a sense of distance there – but the band would make up for that on stage, with the bass player riding his bass (a common technique for getting an audience going at this point) and the saxophone player lying on his back to play solos.\n\nAnd that excitement shone through in \"Crazy Man Crazy\", which became the Comets' first real big hit.\n\nThis was another example of the way that Haley would take a scientific approach to his band's success. He and his band members had realised that the key to success in the record business was going to be appealing to teenagers, who were a fast-growing demographic and who, for the first time in American history, had some real buying power. But teenagers couldn't go to the bars where country musicians played, and at the time there were very few entertainment venues of any type that catered to teenagers.\n\nSo Bill Haley and the Comets played, by Johnny Grande's count, one hundred and eighty-three school assemblies, for free. And at every show they would make note of what songs the kids liked, which ones got them dancing, which ones they were less impressed by, and they would hone their act to appeal to these kids.\n\nAnd one thing Haley noted was that the teenagers' favourite slang expression was \"crazy\", and so he wrote...\n\n[excerpt: Crazy Man Crazy, Bill Haley and the Comets]\n\nThat went to number fifteen on the pop charts, a truly massive success for a country and western band.\n\nMarshall Lytle, the Comets' bass player, later claimed that he had co-written the song and not got the credit, but the other Comets disputed his claims.\n\nThis is another of those records that is cited as the first rock and roll record, or the first rock and roll hit, and certainly it's the first example of a <em>white</em> band playing this kind of music to make the charts. And, more fairly to Haley, it's the first example of a band using guitars as their primary instruments to get onto the charts playing something that resembles jump band music. \"Crazy Man Crazy\" is very clearly patterned after Louis Jordan, but those guitar fills would be played by a horn section on Jordan's records.\n\nWith Danny Cedrone's solos, Bill Haley and the Comets were responsible for making the guitar the standard lead instrument for rock and roll, although it took a while for that to *become* the standard and we will see plenty of piano and saxophone, including on later records by Haley himself.\n\nSo why was Haley doing something so different from what everyone else did? In part, I think that can be linked to the reason he didn't stay successful very long – he wasn't part of a scene at all.\n\nWhen we look at almost all the other musicians we're talking about in this series, you'll see that they're all connected to other musicians. The myth of the lone genius is just that – a myth. What actually tends to happen is that the \"lone genius\" is someone who uses the abilities of others and then pretends it was all himself – and it almost always is a him. There's a whole peer group there, who get conveniently erased.\n\nBut the fact remains that Haley and the Comets, as a group, didn't have any kind of peer group or community. They weren't part of a scene, and really had no peers doing what they were doing. There was no-one to tell them what to do, or what not to do.\n\nSo Bill Haley and the Comets had started something unique. But it was that very uniqueness that was to cause them problems, as we'll see when we return to them in a few weeks...",
  "enclosure": "",
  "itunes:summary": "Welcome to episode sixteen of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Crazy Man Crazy\" by Bill Haley and the Comets. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nUnfortunately, there aren't many good books about Bill Haley available. There are two biographies which are long out of print -- one by John Swenson which I read as a very small child, and one from the nineties by one of Haley's sons. Another of Haley's sons has a biography due out in April, which might be worthwhile, but until then the only book available is a self-published biography by Otto Fuchs. I relied on volume one of Fuchs' book for this post -- it's very good on the facts -- but it suffers from being written by someone whose first language is not English, and it also *badly* needs an editor, so I can't wholly recommend it.\n\nThis box set, which is ridiculously cheap, contains almost every track anyone could want by Haley and the Comets, and it also includes the early country music sides I've excerpted here, as well as tracks by the Jodimars (a band consisting of ex-Comets). Unfortunately it doesn't contain his great late-fifties singles \"Lean Jean\" and \"Skinny Minnie\", but it has everything else.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWe've talked before about how there were multiple different musics that got lumped together in the mid-fifties under the name \"rock and roll\". There's rockabilly, Chicago rhythm and blues, doo-wop, New Orleans R&B, the coastal jump bands, and Northern band rock and roll. We've looked at most of these – and the ones we haven't we'll be looking at over the next few weeks – but what we haven't looked at so far is Northern band rock and roll.\n\nAnd in many ways that's the most interesting of all the rock and roll musics, because it's the one that at first glance has had almost no obvious impact on anything that followed, but it's also the one that first came to the attention of the white American public as rock and roll – the one that made the newspapers and got the headlines. And it's the one that had only one real example. While the other styles of music had dozens of people making them, Northern band rock and roll really only had Bill Haley and the Comets. A whole pillar of rock and roll – a whole massive strand of the contemporary view of this music – was down to the work of one band who had no peers and left no real legacy.\n\nOr at least, they seem to have left no legacy, until you look a bit closer. But before we look at where the Comets' music led, we should look at where they were coming from.\n\nBill Haley didn't set out to be a rock and roll star, because when he started there was no such thing. He set out to be a country and western singer.\n\nHe played with various country bands over the years – bands with names like The Down Homers and the Texas Range Riders – before he decided to become a band leader himself, and started his own band, the Four Aces of Western Swing. Obviously this wasn't a full Western Swing band in the style of Bob Wills' band, but they played a stripped-down version which captured much of the appeal of the music – and which had a secret weapon in Haley himself, the Indiana State Yodelling Champion. Yes, yodelling. Let me explain. Jimmie Rodgers was a huge, huge, star, and his gimmick was his yodelling:\n\n[excerpt \"Blue Yodel (T For Texas)\": Jimmie Rodgers]\n\nEvery country singer in the 1940s wanted to sound like Jimmie Rodgers – at least until Ernest Tubb and Hank Williams came along and everyone wanted to sound like them instead. And that's the sound that Bill Haley was going for when he started the Four Aces of Western Swing.\n\n[excerpt of \"Yodel Your Blues Away\" by the Four Aces of Western Swing]\n\nThat's how Bill Haley s",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode sixteen of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Crazy Man Crazy\" by Bill Haley and the Comets. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nUnfortunately, there aren't many good books about Bill Haley available. There are two biographies which are long out of print -- one by John Swenson which I read as a very small child, and one from the nineties by one of Haley's sons. Another of Haley's sons has a biography due out in April, which might be worthwhile, but until then the only book available is a self-published biography by Otto Fuchs. I relied on volume one of Fuchs' book for this post -- it's very good on the facts -- but it suffers from being written by someone whose first language is not English, and it also *badly* needs an editor, so I can't wholly re",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}