{
  "title": "S14 Ep38: Supernatural News/Parashare: Episode 211",
  "link": "https://audioboom.com/posts/8098592",
  "itunes:episode": 38,
  "itunes:title": "Supernatural News/Parashare: Episode 211",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5337,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "SUPERNATURAL NEWS runs away from home this week on BEYOND the DARKNESS!<br>\nWith Miraculous Rescues, A Serial Killer's Victims' Ghosts, A Paranormal Circus and More!<br>\n<br>\nThe world seems to have turned on it's ear this past week. Nick Pope says he might be willing to work with the MoD again , a former president details his UFO encounter, & a Presidential candidate admits that aliens exist and more await you in today's journey into the weird.<br>\n<br>\nRemember to call and share your stories for future episodes 651-300-4977<br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.<br>\n<br>\nDigestive troubles? \tWeight gain?\tLow energy?\tAchy Joints?<br>\nIf you’ve been struggling with any of these, Dr. Steven Gundry says you’re not alone<br>\nAnd he knows the real cause! Watch the free video at <a href=\"http://totalrestore2.com\">totalrestore2.com</a> to find out more! <br>\n<br>\nGet a low, fixed rate credit card consolidation loan from Lightstream and pay off those credit card balances. You can get a loan from five thousand to a hundred thousand dollars and you could get your money as soon as the day you apply.  Visit <a href=\"http://lightstream.com/Darkness\">lightstream.com/Darkness</a> and get an additional interest rate discount and more information.",
  "itunes:summary": "SUPERNATURAL NEWS runs away from home this week on BEYOND the DARKNESS!\nWith Miraculous Rescues, A Serial Killer's Victims' Ghosts, A Paranormal Circus and More!\n\nThe world seems to have turned on it's ear this past week. Nick...",
  "pubDate": "Sat, 11 May 2019 08:00:00 +0000",
  "guid": "7dc16a4f-dcb7-41eb-a863-e027410f4121",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}