{
  "guid": "urn:uuid:c25de31a-a4be-42ea-8103-4cd1e4a89c13",
  "link": "https://www.who.int/news/item/30-03-2022-who-urges-quality-care-for-women-and-newborns-in-critical-first-weeks-after-childbirth",
  "a10:author": {
    "a10:name": ""
  },
  "title": "WHO urges quality care for women and newborns in critical first weeks after childbirth",
  "description": "Worldwide, more than 3 in 10 women and babies do not currently receive postnatal care in the first days after birth - the  period  when most maternal and infant deaths occur. Meanwhile the physical and emotional consequences of childbirth – from injuries to recurring pain and trauma - can be debilitating if unmanaged, but are often highly treatable when the right care is given at the right time.",
  "pubDate": "Mon, 28 Mar 2022 10:08:01 Z",
  "a10:content": "<p>The World Health Organization (WHO) today launched its first ever <a href=\"https://www.who.int/publications-detail-redirect/9789240045989\">global guidelines to support women and newborns in the postnatal period</a> &ndash; the first six weeks after birth. This is a critical time for ensuring newborn and maternal survival and for\n    supporting healthy development of the baby as well as&nbsp; the mother&rsquo;s overall mental and physical recovery and wellbeing.</p><p>Worldwide, more than 3 in 10 women and babies do not currently receive postnatal care in the first days after birth - the&nbsp; period&nbsp; when most maternal and infant deaths occur. Meanwhile the physical and emotional consequences of childbirth &ndash;\n    from injuries to recurring pain and trauma - can be debilitating if unmanaged, but are often highly treatable when the right care is given at the right time.</p><p>&ldquo;<strong>The need for quality maternity and newborn care does not stop once a baby is born</strong>,&rdquo; said <strong>Dr Anshu Banerjee, Director of Maternal, Newborn, Child and Adolescent Health and Ageing </strong>at WHO<strong>.</strong> &ldquo;<strong>Indeed, the\n    birth of a baby is a life-changing moment, one that is bound by love, hope and excitement, but it can also cause unprecedented stress and anxiety. Parents need strong health care and support systems, especially women, whose needs are too often neglected\n    when the baby comes</strong>.&rdquo;</p><p>In addition to addressing immediate health concerns, these first weeks after birth are crucial for building relationships and establishing behaviours that affect long-term infant development and health. The guidelines include recommendations for breastfeeding\n    counselling - to aid attachment and positioning as breastfeeding is established - and to support parents in providing responsive care for their newborns.</p><h2>Over 60 recommendations that help shape a positive postnatal experience for women, babies and families.</h2><p><strong></strong>These include:</p><ul><li>High quality care in health facilities for all women and babies for at least 24 hours after birth, with a minimum of three additional postnatal checkups in the first six weeks. These additional contacts should include home visits if feasible, so that\n        the health worker can support the transition&nbsp;to care in the home. In the case of a home birth, the first postnatal contact should occur as early as possible, and no later than 24 hours after birth;</li><li>Steps to identify and respond to danger signs needing urgent medical attention in either the woman or the baby;</li><li>Treatment, support and advice to aid recovery and manage common problems that women can experience after childbirth, such as perineal pain and breast engorgement ;</li><li>Screening of all newborns for eye abnormalities and hearing impairment, as well as vaccination at birth;</li><li>Support to help families interact and respond to babies&rsquo; signals, providing them with close contact, warmth and comfort;</li><li>Exclusive breastfeeding counselling, access to postnatal contraception and health promotion, including for physical activity;</li><li>Encouragement of partner involvement, by being part of checkups, for instance, as well as providing support to the woman and attending to the newborn;</li><li>Screening for postnatal maternal depression and anxiety, with referral and management services where needed.</li></ul><p>The recommendations detail the minimum length of hospital stay after birth and provide guidance on discharge criteria, but note that the time needed will depend on individual women and babies, social context, birth experience, and any health concerns.\n    Additional postnatal contacts are recommended for healthy women and newborns between 48 and 72 hours, between seven and 14 days, and during week six after birth. If health risks are identified, more contacts will likely be required, with treatment\n    needed potentially well beyond the first six weeks.</p><p><a href=\"https://www.who.int/teams/sexual-and-reproductive-health-and-research-(srh)/human-reproduction-programme\"><img src=\"https://www.who.int/images/default-source/departments/reproductive-health/logos/hrp-at-50.jpg?Status=Master&amp;sfvrsn=3a3cae50_11\" style=\"float:right;margin:0px 0px 15px 15px;\" class=\"-align-right\" alt=\"HRP at 50 logo\" sf-size=\"17513\" /></a><strong>Evidence shows that women and their families want and need a positive</strong>&nbsp;<strong>p</strong><strong>ostnatal experience that helps them navigate the immense physical and emotional challenges that occur after their babies are born, while building their confidence as parents</strong>,&rdquo;\n said <strong>Dr Mercedes Bonet, Medical Officer </strong>with WHO&rsquo;s Department of Sexual and Reproductive Health and Research and the UN Special Programme, HRP. &ldquo;<strong>Dedicated postnatal services should provide vital physical and mental health\n    support, while helping caregivers thrive in providing the right care for their newborns</strong>.&rdquo;</p><p>These recommendations complete a trilogy of guidelines from WHO for quality maternity care through pregnancy and during and after childbirth, centred on meeting the needs of all those who give birth and their babies. These uphold the rights to a positive\n    healthcare experience, where people are treated with dignity and respect and can participate actively in healthcare decisions. </p><p><strong>Notes</strong><strong></strong></p><p><a href=\"https://www.who.int/publications-detail-redirect/9789240045989\">The guidelines</a> include 63 recommendations, combining relevant existing recommendations with 31 that are new or updated. These are now the official WHO reference point for all aspects of postnatal care.</p><p><strong>WHO&rsquo;s antenatal care and intrapartum care guidelines can be accessed at the below links</strong>:</p><p><a href=\"https://www.who.int/publications-detail-redirect/9789241549912\">WHO recommendations on <strong>antenatal care</strong> for a positive pregnancy experience</a></p><p><a href=\"https://www.who.int/publications-detail-redirect/9789241550215\">WHO recommendations: <strong>intrapartum </strong><strong>care</strong> for a positive childbirth experience</a></p>"
}