{
  "guid": "urn:uuid:dc3d57f4-9d7f-4947-9c34-c57b28fe3d0a",
  "link": "https://www.who.int/news/item/25-03-2022-who-establishes-the-global-centre-for-traditional-medicine-in-india",
  "a10:author": {
    "a10:name": ""
  },
  "title": "WHO establishes the Global Centre for Traditional Medicine in India",
  "description": "<p>The World Health Organization (WHO) and the Government of India today signed an agreement to establish the WHO Global Centre for Traditional Medicine. This global knowledge centre for traditional medicine, supported by an investment of USD 250 million from the Government of India, aims to harness the potential of traditional medicine from across the world through modern science and technology to improve the health of people and the planet.<o:p></o:p></p><p>Around 80% of the world&rsquo;s population is estimated to use traditional medicine. To date, 170 of the 194 WHO Member States have reported the use of traditional medicine, and their governments have asked for WHO&rsquo;s support in creating a body of reliable evidence and data on traditional medicine practices and products.<o:p></o:p></p><p>&ldquo;For many millions of people around the world, traditional medicine is the first port of call to treat many diseases,&rdquo; said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. &ldquo;Ensuring all people have access to safe and effective treatment is an essential part of WHO&rsquo;s mission, and this new center will help to harness the power of science to strengthen the evidence base for traditional medicine. I&rsquo;m grateful to the Government of India for its support, and we look forward to making it a success.&rdquo;<o:p></o:p><br /></p><p>The term traditional medicine describes the total sum of the knowledge, skills and practices indigenous and different cultures have used over time to maintain health and prevent, diagnose and treat physical and mental illness. Its reach encompasses ancient practices such as acupuncture, ayurvedic medicine and herbal mixtures as well as modern medicines.<o:p></o:p></p><p>But today, national health systems and strategies do not yet fully integrate the millions of traditional medicine workers, accredited courses, health facilities, and health expenditures.<o:p></o:p></p><p>&ldquo;It is heartening to learn about the signing of the Host Country Agreement for the establishment of Global Centre for Traditional Medicine (GCTM). The agreement between Ministry of Ayush and World Health Organization (WHO) to establish the WHO-GCTM at Jamnagar, Gujarat, is a commendable initiative,&rdquo; said HE (Mr) Narendra Modi, Prime Minister of India.<o:p></o:p></p><p>&ldquo;Through various initiatives, our government has been tireless in its endeavour to make preventive and curative healthcare, affordable and accessible to all. May the global centre at Jamnagar help in providing the best healthcare solutions to the world.&rdquo;<o:p></o:p></p><p>Traditional medicine is also increasingly prominent in the world of modern science.<o:p></o:p></p><p>Some 40% of approved pharmaceutical products in use today derive from natural substances, highlighting the vital importance of conserving biodiversity and sustainability. For example, the discovery of aspirin drew on traditional medicine formulations using the bark of the willow tree, the contraceptive pill was developed from the roots of wild yam plants and child cancer treatments have been based on the rosy periwinkle. Nobel-prize winning research on artemisinin for malaria control started with a review of ancient Chinese medicine texts.<o:p></o:p></p><p>There has been a rapid modernization of the ways traditional medicine is being studied. Artificial intelligence is now used to map evidence and trends in traditional medicine and to screen natural products for pharmacokinetic properties. Functional magnetic resonance imaging is used to study brain activity and the relaxation response that is part of some traditional medicine therapies such as meditation and yoga, which are increasingly drawn on for mental health and wellbeing in stressful times.<o:p></o:p></p><p>In addition, traditional medicine use has also been updated by mobile phone apps, online classes, and other technologies.<o:p></o:p></p><p>The new WHO centre will be established in Jamnagar, Gujarat, India. While Jamnagar will serve as the hub, the new centre is being designed to engage and benefit all regions of the world.<o:p></o:p></p><p>It will concentrate on building a solid evidence base for policies and standards on traditional medicine practices and products and help countries integrate it as appropriate into their health systems and regulate its quality and safety for optimal and sustainable impact.<o:p></o:p></p><p>The new centre focuses on four main strategic areas: evidence and learning; data and analytics; sustainability and equity; and innovation and technology to optimize the contribution of traditional medicine to global health and sustainable development.<o:p></o:p></p><p>The onsite launch of the new WHO global centre for traditional medicine in Jamnagar, Gujarat, India will take place on April 21, 2022.<o:p></o:p></p>For more information, see: <a href=\"https://www.who.int/initiatives/who-global-centre-for-traditional-medicine\">who.int/initiatives/who-global-centre-for-traditional-medicine/&nbsp;</a>&nbsp;<p>&nbsp;</p><p>&nbsp;</p>",
  "pubDate": "Fri, 25 Mar 2022 11:35:37 Z"
}