{
  "title": "My startup failed, now what?",
  "link": "",
  "published": "2020-10-10T00:00:00+01:00",
  "updated": "2020-10-10T00:00:00+01:00",
  "id": "https://danielhomola.com/startups/learning/my-startup-failed",
  "content": "<h2 id=\"the-1-minute-version\">The 1 minute version</h2>\n\n<p>I was part of the EF12 London cohort in 2019, where I met my co-founder. Together, we pursued an idea that I had for a while:</p>\n\n<blockquote>\n  <p>A privacy-preserving medical-data marketplace and AI platform built around federated deep learning.</p>\n</blockquote>\n\n<p>The purpose of the platform would have been to allow data scientists to train deep learning models on highly sensitive healthcare data without that data ever leaving the hospitals. At the same time, thanks to a novel data monetization strategy and marketplace component, hospitals would have been empowered to make money from the data they are generating.</p>\n\n<p>We received pre-seed funding, valued at $1M. Then the race for demo day began with frantic product building and non-stop business development. Unfortunately, my co-founder fell out of love with the idea after enduring months of business development hardship. Then we failed to pivot to something we both liked, so we split up and I went on my own way.</p>\n\n<p>The whole ordeal was an amazing mixture of fun, challenging learning opportunities and uninhibited misery (but mostly fun). Make sure to check out the <a href=\"/federeated_learning_platform\">demo of the MVP</a> I built.</p>\n\n<p>If you are curious about the details of the story then read on. If you’re in a rush, feel free to skip ahead to the <a href=\"#takeaways\">list of things I learned</a> from the experience.</p>\n\n<h2 id=\"how-to-find-a-co-founder\">How to find a co-founder?</h2>\n\n<p>Back in early 2019, I left my job at IQVIA to join the London cohort of <a href=\"https://joinef.com\">Entrepreneur First</a>. EF is an amazing incubator / accelerator programme that has given the world the likes of <a href=\"https://techcrunch.com/2016/06/20/twitter-is-buying-magic-pony-technology-which-uses-neural-networks-to-improve-images/\">Magic Pony</a> and <a href=\"https://www.joinef.com/companies/\">hundreds of other exciting companies</a>.</p>\n\n<h3 id=\"entrepreneur-what\">Entrepreneur what?</h3>\n\n<p>The main thing that sets EF apart from the dozens of similar programmes is that they focus on the earliest possible stage of companies: sole founders. They take in a hundred talented and ambitious individuals in each cohort (actually almost 200 when you count the other European EF sites: Berlin and Paris).</p>\n\n<p>Then the good people of EF will</p>\n\n<blockquote>\n  <p>make everyone go through a weird, speed-dating meets Love Island type of co-founder finding process.</p>\n</blockquote>\n\n<p>In this phase, for weeks on end, you are simultaneously reading the CVs of super interesting cohort members and having ludicrously blue-sky chats with them, about potentially world changing companies the two of you could build. By the end of this process, you should end up with a co-founder.</p>\n\n<p>EF also gives you a stipend, a place to work and a ton of high quality material on the basics of entrepreneurship and startup building. But I think the real USP of EF, is the access to this pool of pre-screened, highly talented and motivated people,  who all left their (sometimes lucrative) day jobs to become members of the cohort and build companies.</p>\n\n<h3 id=\"from-beers-to-business\">From beers to business</h3>\n\n<p>As a naturally sceptical person, I wasn’t sure what to think about this process. I did what was expected of me (reading CVs, talking to people, coming up with outlandish ideas) but I didn’t really click with anyone.</p>\n\n<p>Finally however, after many beers and chats, I found my co-founder, with whom we just had enough in common (interest in healthcare and machine learning) to make our discussions fruitful, but with whom our skills were complimentary enough that we could take advantage of having two people on the team.</p>\n\n<p>This latter point is in fact quite crucial: too often, we are naturally attracted to people with similar interests, skills and thinking to our own. This is great for friendships, but can be devastating in a startup where</p>\n<blockquote>\n  <p>you want the co-founders to cover each other’s blind spots.</p>\n</blockquote>\n\n<p>Both my co-founder and I are “techies” in broad terms. But it was quite clear from the beginning that I am more of a CTO type who loves to build, whereas he liked the process of selling and pitching, which is quite important because that’s pretty much <strong>all you do</strong> as an early stage startup CEO.</p>\n\n<p>Fortunately (as this is quite rare AFAIK), we both had a good share of the skills of the other’s role too. This really helped with both the technical and business discussions between the two of us.</p>\n\n<h2 id=\"do-you-have-a-1b-idea\">Do you have a $1B idea?</h2>\n\n<p>Something we all learned fairly quickly in EF was the economics of venture capital. It’s really quite simple and goes something like this:</p>\n\n<h3 id=\"venture-capitalism-101\">Venture capitalism 101</h3>\n\n<ul>\n  <li>There’s a huge amount of excess money slushing around in the global financial system.</li>\n  <li>Most investors stratify their investment portfolios according to some risk profile. This usually means that they are happy to put 1-2% of their capital in high-risk ventures. Funding highly risky tech startups is one of these high-risk venture types. Another would be to buy crypto for instance.</li>\n  <li>VC firms utilise this and go out every $latex x$ years to <em>raise a round</em>, i.e. pool together capital from wealthy individuals and investment funds.</li>\n  <li>Whatever they raise is the fund that can be allocated by the partners of the VC firm, as they see fit.</li>\n  <li>Most VCs work on a 2/20 rule: they will take 2% management fee each year, plus 20% of any profit they make.\n    <ul>\n      <li>It’s worth noting here, that 2% of a billion-dollar fund is still a few million for each partner each year, even if none of their funded companies exit or do particularly well. Yeah, being a VC is quite lucrative.</li>\n    </ul>\n  </li>\n  <li>VCs promise extraordinary returns to the investors. Certainly well above anything that’s attainable with reasonable risk profile on the market. How can they deliver?\n    <ol>\n      <li>To achieve this they can either fund companies where they expect that most of them will grow 100%.</li>\n      <li>Or fund companies where none of them will grow a 100%, because most will grow 0%, and potentially one or two will grow 1,000% or 10,000%.</li>\n    </ol>\n  </li>\n</ul>\n\n<p>Companies from the first group are called successful medium sized business. The latter ones are called unicorns: startups in hyper-growth mode, overtaking and disrupting a whole industry like AirBnB or Uber did for example.</p>\n\n<h3 id=\"not-all-ideas-are-created-equal\">Not all ideas are created equal</h3>\n\n<p>Even though probably both investment models could be equally successful, <strong>VCs want to invest in high impact firms</strong> that will change the world. Think Google, Facebook, Twitter.</p>\n\n<p>I leave it to your judgement whether this is a healthy and sustainable business model. I will certainly write more about this in the future, but I will say this: VCs serve a super important function in the global innovation market and without them, the world would be different in countless ways.</p>\n\n<p>The corollary of all the above is that if you go down the VC backed startup building path, you need an idea that can become a 1 billion-dollar company. <strong>Yes, that’s a billion with a B.</strong></p>\n\n<h2 id=\"start-me-up\">Start me up!</h2>\n\n<p>We spent weeks ideating with my co-founder, but after dozens of discussions we came back to the idea I arrived to EF with. It was the only one that seemed simultaneously ambitious and high impact enough that a VC might take a liking to it, while also having the potential to grow into a multi billion-dollar company. Also, neither of us hated it, which is quite important, I heard.</p>\n\n<h3 id=\"the-idea\">The idea</h3>\n\n<p>I had this idea for a company for months before applying to EF:</p>\n\n<blockquote>\n  <p>The world’s first, privacy-centered medical-data marketplace and machine learning platform, powered by federated deep learning.</p>\n</blockquote>\n\n<p>I couldn’t wait to tell all the people at the cohort about it, so I did. And they all made the exact same face you just did when you read the sentence above.</p>\n\n<p>The problem with deep tech ideas (besides not fitting on a napkin) is that for the most of us not well-versed in the particular field, they are often indistinguishable from vaporware and snake-oil.</p>\n\n<p>You really have to know a lot about healthcare informatics, medical machine learning, federated deep learning and also the financial incentive structure of the US healthcare industry to properly evaluate that one sentence above.</p>\n\n<p>If you do that, it will not only make a lot of sense but you’ll find that it’s offering one of the very few viable long-term solutions to the impossible trade-off healthcare faces in the 21st century:</p>\n\n<blockquote>\n  <p>The patients’ natural right to data privacy is in direct conflict with data pooling and with how much we can learn from this data with current AI algorithms.</p>\n</blockquote>\n\n<p>This is bad news, because without the deployment and proliferation of AI, <a href=\"https://www.goodreads.com/book/show/40915762-deep-medicine\">healthcare is doomed</a>. Another indication that the above idea might not be the worst ever is that Google Ventures already backed an <a href=\"https://owkin.com/federated-learning/\">amazing team</a> to do exactly this. Yeah, finding that out wasn’t fun…</p>\n\n<h3 id=\"the-idea-explained\">The idea explained</h3>\n\n<p>Probably it’s easiest to explain the idea for our startup by enumerating some of the relevant problems that plague healthcare currently:</p>\n\n<ul>\n  <li>Hospitals and outpatient clinics generate vast amounts of incredibly rich and detailed data about patients.  We’ll call these institutions providers.</li>\n  <li>This generated patient data is extremely sensitive, and people are rightly concerned about who gets to use or analyse it.</li>\n  <li>Pharmaceutical companies, biotech and medtech AI startups are all hungry for this data and could develop amazing new drugs, therapies, diagnostic tools, algorithms by leveraging it. We’ll call these companies vendors.</li>\n  <li>Providers are often cash-stripped and as a consequence struggling to provide the highest quality of care for their patients.</li>\n  <li>Vendors have ample resources (money) and a clear need to access this data. Furthermore, by providing this data to them securely, the world could undoubtedly become a better and healthier place through their innovation.</li>\n  <li>Even if vendors had access to this data, deploying AI models at scale, in a live hospital setting is still one of the biggest unsolved challenges of digital healthcare.</li>\n</ul>\n\n<p>Once you write down these six simple facts about today’s healthcare systems, it really doesn’t take long for the light bulb to start flashing.</p>\n\n<p>We need to build a marketplace where providers can sell access to their data without compromising patient privacy and where vendors can get access to this data to learn from it and train models on it. Furthermore, once vendors have a model trained, they need to be able to easily deploy it to network of hospitals, where those models could start to generate useful (and potentially life-saving) predictions.</p>\n\n<blockquote>\n  <p>But how could anyone use sensitive data without actually having a look at it, thereby immediately compromising patient privacy?</p>\n</blockquote>\n\n<p>The answer is quite remarkably simple, and it’s been powering all sorts of technologies (like predictive texting on your phone) for years. It’s called <strong>federated learning</strong> and it’s first real-world, large scale application came from Google (as far as I know) following <a href=\"https://arxiv.org/abs/1511.03575\">this paper</a>. Then, <a href=\"https://arxiv.org/abs/1610.05492\">many</a> - <a href=\"https://arxiv.org/abs/1806.00582\">more</a> - <a href=\"https://arxiv.org/abs/1902.01046\">followed</a> and amazing open source libraries were released like <a href=\"https://github.com/OpenMined/PySyft\">PySyft</a> by <a href=\"https://www.openmined.org/\">OpenMined</a>, or <a href=\"https://github.com/FederatedAI/FATE\">FATE</a> by <a href=\"https://www.wikiwand.com/en/WeBank_(China)\">WeBank</a>.</p>\n\n<p>Federated learning’s simplest explanation can be boiled down to a single sentence:</p>\n\n<blockquote>\n  <p>Instead of moving the data to the model, <strong>let’s move the model to data.</strong></p>\n</blockquote>\n\n<p>Suffice to say that this idea has found applications in several security and privacy conscious industries, but its impact on healthcare will truly be transformational. Have a look at these two recently published Nature articles to see what federated learning holds for the future of <a href=\"https://www.nature.com/articles/s41598-020-69250-1\">multi-institutional medical studies</a>  and <a href=\"https://www.nature.com/articles/s41746-020-00323-1\">digital health applications</a>.</p>\n\n<p>If you’re curious about the technical details and implementation of our idea, <strong>make sure to check out</strong> <a href=\"/federeated_learning_platform\"><strong>this page</strong></a> about the MVP I built, or watch my demo of it below.</p>\n\n<!-- Courtesy of embedresponsively.com //-->\n\n<div class=\"responsive-video-container\">\n    <iframe src=\"https://www.youtube-nocookie.com/embed/KZBNBdD1yVI\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"></iframe>\n  </div>\n\n<h3 id=\"to-recap\">To recap</h3>\n\n<ul>\n  <li>We wanted to build a platform to enable researchers and data scientists of pharma and biotech companies to access highly granular and information rich patient data from US hospitals to train models on it,</li>\n  <li>without the data ever leaving the four walls of those hospitals and without the researchers ever being able to actually look at the data.</li>\n  <li>We wanted to leverage federated deep learning and a federated data query engine to achieve this.</li>\n  <li>The best part? The hospitals would have made money out of the mountains of data they are sitting on, without ever compromising patient privacy, while simultaneously enabling vendors to innovate, research and develop therapies.</li>\n  <li>Furthermore the learned algorithms could have been deployed back to the federated hospital network and put to good use.</li>\n  <li>We wanted to charge vendors according to the well-known <a href=\"https://stripe.com/en-gb/atlas/guides/business-of-saas#the-fundamental-equation-of-saas\">SaaS business model</a> and share a sizeable fraction of our revenue with the hospitals so they become financially incentivised to partner with us.</li>\n  <li>How? Every time a hospital’s data would have been used to train a model, they would have got compensated based on the number of patients and data granularity they provided for the study.</li>\n</ul>\n\n<p>Here’s a flowchart of the smallest possible incarnation of our platform with just two hospitals connected to the federated data network.</p>\n\n<p><a href=\"/assets/images/fedml_overview.png\"><img src=\"/assets/images/fedml_overview.png\" /></a></p>\n\n<h2 id=\"the-rollercoaster-of-founder-life\">The rollercoaster of founder life</h2>\n\n<p>The EF programme is structured according to a fairly well thought out schedule that gives a nice framework for working on your idea.</p>\n\n<ul>\n  <li>In the first few weeks you should get data about the market’s reaction to your idea. This means you’re constantly on the phone (sometimes for 6-8 hours straight), talking to people, who are often not that interested, but you begged your way in or forced them some other way.</li>\n  <li>You’re doing all of this to basically <a href=\"http://momtestbook.com/\">“Mom test” your idea</a>.\n    <ul>\n      <li>This is a neat little trick to get around the problem of people being too nice. Yes, that’s actually a problem, as they’ll outright lie in your face and say that they like your idea and would even pay for it. Only then to completely disappear after the call.</li>\n      <li>The reason for this is quite simple: no one likes to be the a-hole who breaks the soul of budding entrepreneurs. Contrary to popular belief, people on average are fairly nice that way, so they’ll naturally try to say something good about your idea, even if it’s objectively terrible and they knew from the second minute, they’ll never ever use it.</li>\n    </ul>\n  </li>\n  <li>In this early phase, it’s not a big deal if people are hanging up on you. You should just have as many calls as possible, be resilient and accept that no one cares about your idea besides you. Keep your head down, collect data and try to find out if there’s anyone out there even remotely interested in buying what you have to offer.</li>\n  <li>In the next phase of your VC fuelled company building, you are trying to produce some form of <em>“traction”</em> to prove to your future investors (the EF Investment Committee (IC) in our case), that in fact, your idea is a viable business.</li>\n  <li>Traction can be many things, depending on the complexity of your product. Here are a few types of traction in decreasing order of impressiveness:\n    <ul>\n      <li>Signed up users / companies with their card details already taken, ready for doing business with you.</li>\n      <li>Signed contract with another business for a (hopefully) paid trial. Contract for an unpaid trial is the next best thing here.</li>\n      <li>Letter of intent from another company or institution. This is usually a document with purposefully vague and legally non-binding language in which your future client (you wish) says that they don’t think your idea is totally crazy and (if the stars align and the director wakes up in the right good mood) they might even consider using it one day. Maybe…</li>\n    </ul>\n  </li>\n  <li>Then you take all this evidence that you’ve gathered through hundreds of interviews and thousands of emails and present it to the EF Investment Committee. If they like your idea, you get £80k for a 10% stake in your company. You get to work on it more till you reach the maturity to pitch your company at demo day to dozens and dozens of great VCs with the intention of raising a seed round (~£1-2M) with one of them.</li>\n  <li>If you get seed funded (usually 4-6 months after demo day) then hurray, your VC fuelled company building journey can finally begin. Unfortunately, the odds are still <a href=\"https://medium.com/journal-of-empirical-entrepreneurship/dissecting-startup-failure-by-stage-34bb70354a36\">heavily stacked against you</a>:\n    <ul>\n      <li>There’s only about a 20% chance you’ll make it to the next funding round. Quite annoyingly, you’ll need several of those in the coming years to keep your unicorn alive - they are hungry beasts.</li>\n      <li>There’s a 97% chance that you’ll fail to exit, i.e. fail to turn your years and years of gruelling work into hard earned millions.</li>\n    </ul>\n  </li>\n</ul>\n\n<p>Hm… That was depressing to learn, but don’t worry, it’ll get worse.</p>\n\n<h3 id=\"the-up\">The up</h3>\n\n<p>As anyone who’s ever tried will tell you, building a company is like being on a rollercoaster ride. Sometimes you have days that feel like none of the days in your previous office jobs. You feel amazing, fulfilled and working on something truly meaningful (at least to you).</p>\n\n<p>Even better, sometimes things just work out. Like when we started to ask huge and well-known US research hospitals if they would partner with us (two random unfunded guys from London) to build the world’s first federated machine learning platform for healthcare and they just said “yeah sure”.</p>\n\n<p>Or when the second and third meetings started to occur with these teams, and the term “letter of intent” started to fly around a lot. We felt invincible. Even if it took more than a hundred Zoom calls and thousands of emails sent out, we thought we are clearly making progress with business development here.</p>\n\n<h3 id=\"the-top\">The top</h3>\n\n<p>Then the rollercoaster continued and took us to this amazing top. Armed with our letters of intent and signed project proposals with these hospitals, EF’s IC said they’d invest in us and just like that, we got the pre-seed funding.</p>\n\n<p>Roughly 30% of the initial EF cohort make it this far so we felt great. Even though we knew the work is just about to get a whole lot more challenging and crazy, there’s a moment when you have your first little success and you start quietly wondering to yourself:</p>\n\n<blockquote>\n  <p>Maybe we’ll be among the 1% of startups that actually make it… I know it’s  unlikely, but maybe this will all just work out fine!</p>\n</blockquote>\n\n<p>I was also super excited that I get to finally build again after months of not coding. Don’t get me wrong, conducting BD calls, writing marketing materials, technical documents, grants, drafting SOWs and LOIs was extremely educational too and they are necessary and unavoidable parts of every company formation. Nonetheless, I was itching to actually get back to the thing I love doing and I’m reasonably good at.</p>\n\n<h3 id=\"the-down\">The down</h3>\n\n<p>After the pre-seed investment, I was 100% on building and my co-founder was 100% on business development. We only had 2.5 months till demo day to:</p>\n\n<ul>\n  <li>Build an MVP of the highly complex product we envisioned.</li>\n  <li>Get extremely conservative and risk averse pharma companies and hospitals to sign up with our marketplace.</li>\n</ul>\n\n<p>Our plan seemed straightforward. I am going to take care of the first one and my co-founder is doing the second. Even though we knew the second is probably dependent on the first being ready, we agreed to work as hard as we can and try to have our first customers by demo day in late September 2019.</p>\n\n<p>However, the cracks started to show quite early on… The business development process went from painfully hard (pre-IC) to near impossibly hard (post-IC). Many people told us that letters of intent are worth the same as toilet paper, and we should try to convert those into signed contracts for paid or unpaid trials ASAP, so that’s what we tried to do.</p>\n\n<p>Despite my co-founder’s heroic efforts however, after months of negotiations, meetings, project proposals and more meetings with US hospitals, <strong>every single lead of ours simply dried up</strong>. Emails went unanswered. Crucial final meetings with the key stakeholders did not happen.</p>\n\n<p>When the discussions turned real, and when hospitals realised that for this fancy-sounding research project they’d need to actually provision resources for us so we can integrate our software into their IT systems, they went cold turkey on us.</p>\n\n<h3 id=\"the-small-up-before\">The small up before..</h3>\n\n<p>We realised that we made our own lives impossible by trying to aggressively innovate on two fronts at once:</p>\n\n<ul>\n  <li>We wanted to build a federated ML platform for deep learning models in a notoriously conservative industry, leveraging highly sensitive data with tons of regulations around it.</li>\n  <li>We wanted to create a marketplace, therefore we had to find not just one customer type but two: providers and vendors too.</li>\n</ul>\n\n<p>Even just one of these goals would have been insanely hard for a two-person team to pull off in 6 months, but doing them together was clearly way too much. So we pivoted and said:</p>\n\n<blockquote>\n  <p>Let’s sell our federated ML platform to pharma companies. Let them use it with their existing hospital relationships however they see fit.</p>\n</blockquote>\n\n<p>This wasn’t the worst idea to be honest. Pharma companies already have longstanding relationships with hospitals and outpatient clinics, as these connections are essential for recruiting patients for new clinical trials.</p>\n\n<p><strong>Healthcare</strong> - as we found out to our own detriment - <strong>is built on trust and slowly evolving long-term partnerships</strong>. There’s very little place for disruptive technologies, especially pushed by small companies. Due to the heavily regulated and risk averse nature of healthcare, you can have the best tech product and it’ll still be extremely hard to sell (this was confirmed to us by numerous companies on the market).</p>\n\n<p>So we thought, let’s sell the technology to the innovation leads and heads of data science of large pharma companies. Then they will take care of getting the tech to the data, i.e. inside the hospitals.</p>\n\n<h3 id=\"the-crash\">The crash</h3>\n\n<p>This hasn’t really changed the MVP I had to build, only the way we’d demo it to users potentially, so I proceeded further with full steam.</p>\n\n<p>My co-founder in the meanwhile was trying to line up as many demo opportunities as he could, so we would have a good chance of converting at least one or two of those into an unpaid trial by demo day. Then we’d have our hard-won <em>“traction”</em> in our hands for our discussions with VCs.</p>\n\n<p>I finished <a href=\"/federeated_learning_platform\">the MVP</a> and we started to demo it to large pharma companies. Quite miraculously, none of them thought it was terrible. In fact, some of them even murmured something positive about it during the call.</p>\n\n<p>But crucially, <strong>none of them jumped out of their chair singing Hail Mary</strong>, thanking us for finally solving their long standing hair-on-fire problem. Instead, they all said, they’ll get back to us after they had some internal discussions.</p>\n\n<p>Although sales cycles in healthcare are notoriously long, and selling to pharma as a tiny startup is near impossible, we knew we missed the mark. We could simply feel after these calls that we aren’t solving any of these teams’ top 3 problems. What we offered was definitely in the top 10 or 15, but not even close to top 3.</p>\n\n<p>And then, to make things worse (or better?)</p>\n\n<blockquote>\n  <p>through a series of honest chats with my co-founder, I found out that his heart isn’t really in federated learning anymore.</p>\n</blockquote>\n\n<p>Turns out, it’s a pretty big problem when the CEO of a company is not emotionally invested in and hyped up about the very thing the company is selling. It’s especially bad if this happens literally weeks before he’s supposed to stand in front of a hundred VCs and convince them that our business is the one that’s going to change the world and which is worth their £1M investment.</p>\n\n<h3 id=\"operation-salvage\">Operation Salvage</h3>\n\n<p>I totally empathised with the frustration of my co-founder after he struggled for months to sell without much to show for it… However it felt rather bad to give up on the idea at the very last minute.</p>\n\n<p>Granted, our traction was practically non-existent at that point, but I suspected from the beginning that selling this product will be incredible hard and might potentially take years. We also knew for a fact that selling our product isn’t impossible, as we have found <a href=\"https://trinetx.com/\">companies that managed to get into US hospitals</a> and others that <a href=\"https://owkin.com/\">worked successfully on something similar to our idea</a> (although both with incredible funding behind their backs). So personally I wasn’t disappointed, and I wasn’t that surprised with our lack of progress. But clearly my co-founder was and it was him who had to muster the energy day after day to try and sell this thing.</p>\n\n<p>It was pretty clear to me that just like you cannot make someone love another human being, you cannot make someone feel passion for something for which they simply don’t. So reluctantly, I agreed to move on and use the rest of our pre-seed funding to build something else for the next demo day (which was scheduled for 6 months later).</p>\n\n<p>We told our plans to EF (who were really nice and supportive about it), then proceeded to conduct one of the most painful 4 weeks of my life. We brainstormed in the Google Startup Campus, the British Library and countless pubs and cafes of London for days on end. We were desperately trying to come up with an idea which we both felt good about, meaning we would be willing to dedicate a couple years of our lives to it.</p>\n\n<p>Whiteboard sessions came and went, beers and many more coffees were had. We tried for hours each day, but one of the two following scenarios kept happening:</p>\n\n<ul>\n  <li>Either founder A hated the idea founder B just pitched or,</li>\n  <li>we both quickly realised that founder B’s idea was genuinely terrible, so we just laughed (or cried).</li>\n</ul>\n\n<h3 id=\"the-end\">The end</h3>\n\n<p>After weeks of this, I proposed to leave the company and sell my shares to my co-founder. Again, EF was incredibly nice about this and signed all the necessary contract modifications that allowed me a clean exit. Then, on a rainy October day, six months after joining EF,</p>\n\n<blockquote>\n  <p>my co-founder and I said goodbye in a typical London pub and that was the end of my first startup.</p>\n</blockquote>\n\n<p>As I walked towards the tube, lots of thoughts and feelings were rushing through my head… None of them particularly positive or pleasant, but I knew I made the right decision.</p>\n\n<h2 id=\"takeaways\">Takeaways</h2>\n\n<p>I probably learned more about myself and the world in those six months than in the preceding 2.5 years in my typical 9 to 5 corporate data-science job. I couldn’t possibly summarise all of it here and some (or most) of it might be completely trivial to some readers. So here’s a list of my top learnings.</p>\n\n<h3 id=\"what-did-i-learn\">What did I learn?</h3>\n\n<ul>\n  <li><strong>Product market fit is (almost) everything</strong>. It’s a simple sounding but pretty complex idea. Here’s a <a href=\"https://a16z.com/2017/02/18/12-things-about-product-market-fit/\">good intro</a> to it, and here’s the <a href=\"https://defmacro.substack.com/p/go-to-market-strategy-for-engineers\">best step by step guide</a> I’ve found so far about how to achieve it.</li>\n  <li><strong>Ideas are cheap.</strong> Execution is all that matters. It’s been repeated ad-nauseam in startup circles but I think it’s mostly true so worth noting. Although, some successful people <a href=\"https://www.indiehackers.com/podcast/170-vincent-woo-of-coderpad\">challenge this</a> and advocate the exact opposite. The truth (as usual) is probably somewhere in the middle, but definitely closer to the “ideas are cheap” side.\n    <ul>\n      <li>Related tip: never be afraid to talk about your idea. It’s the only way to find funding and co-founders (and most likely you’ll need at least one of those).</li>\n    </ul>\n  </li>\n  <li><strong>The tale of two ideas:</strong> imagine you have two ideas, X and Y. Let’s say, idea X solves a problem, which for a 100 people is so serious, they’d sell their kidneys (both in fact) to get it fixed. Idea Y solves a problem for a 10,000 people and they’d be willing to pay (they say) $20 for it. Which one you should pursue? Before EF, I would have chosen idea Y in a heartbeat. Today, I’d kill to have an idea that is like X. Always choose idea X.</li>\n  <li><strong>Finding a great co-founder is exceptionally hard</strong>, although I definitely lucked out with mine on many fronts. In general, and contrary to popular startup wisdom, I’d prioritize the following qualities above charisma, genius-level IQ, qualifications or anything else:\n    <ul>\n      <li>integrity &amp; honesty</li>\n      <li>intellectual rigour &amp; logical consistency</li>\n      <li>good (<a href=\"https://basecamp.com/books/calm\">but not crazy</a>) work ethic &amp; resilience &amp; patience</li>\n      <li>sense of humour &amp; being able to laugh at oneself</li>\n    </ul>\n  </li>\n  <li><strong>Creating a great team</strong> of first 10 employees is even harder than finding a co-founder (from what I heard) and it’s probably the most important thing any founder will do after securing funding, as it will most likely determine the culture of the entire company for many years to come.</li>\n  <li><strong>Sales, marketing and UX are super important</strong>. Probably more so than your code (especially at the beginning).\n    <ul>\n      <li>Related tip: don’t be the dumb tech guy that builds it, expecting the users to just show up and start using and loving it.</li>\n    </ul>\n  </li>\n  <li><a href=\"http://momtestbook.com/\"><strong>Mom test</strong></a> <strong>everything</strong>.</li>\n  <li>Being able to evaluate business ideas critically is a fundamental skill for founders. The good news, that it can be learned. Also, a <a href=\"https://www.defmacro.org/2019/03/26/startup-checklist.html\">good checklist</a> helps.</li>\n  <li>Spending time on finding out what is it that you’d work on even if you didn’t get paid for it, is an amazingly useful way of focusing your life and career.</li>\n  <li>Some <strong>healthcare related takeaways</strong> I wish I knew before starting:\n    <ul>\n      <li>Healthcare is conservative, built on trust and slowly evolving but longstanding relationships and partnerships.</li>\n      <li>As a not surprising consequence of this, the average age of founders of unicorn healthcare startups is <a href=\"https://medium.com/@alitamaseb/land-of-the-super-founders-a-data-driven-approach-to-uncover-the-secrets-of-billion-dollar-a69ebe3f0f45\">significantly higher</a> than of tech unicorns.</li>\n      <li>Also, healthcare seems to be the only industry where having a PhD and many years of relevant experience is a prerequisite of being successful. In most other industries a BSc and/or an MBA seems to be enough.</li>\n      <li>If you are planning to build and sell any tech related product in healthcare, be prepared for extremely long sales cycles, business partners who proceed with extreme caution and who care a lot about the optics of your company.</li>\n      <li>Therefore, all in all, healthcare is not best suited for tiny startups, created by starry eyed 20-30 something founders with tiny professional networks and little work experience in the field.</li>\n    </ul>\n  </li>\n</ul>\n\n<h3 id=\"what-do-i-miss\">What do I miss?</h3>\n\n<p>Being a founder of your own deep tech company feels amazing on most days. Here are some of the things I miss:</p>\n\n<ul>\n  <li>The autonomy, responsibility and fast pace is infectious and invigorating. Especially coming from a traditional healthcare behemoth like IQVIA.</li>\n  <li>Living in a “Come on, we can do this!” mindset and being surrounded by people who think that way.</li>\n  <li>Being surrounded by motivated, ambitious, highly educated and driven people who chose to veer off the traditional corporate track is amazing. Again, in my opinion this is definitely the USP of EF.</li>\n  <li>Being able to determine the work schedule and culture of your team.</li>\n  <li>Being able to just spend a whole day on learning about something, because that’s what the business calls for.</li>\n  <li>Talking to other founders and potential customers teaches you that the world is so much more complex, interesting and nuanced than it seems as an employee in a small vertical of a single industry. There are hundreds of industries, all with their own inefficiencies, suboptimal solutions, knowledge gaps, tech hurdles. Learning about these is fascinating and broadens you as a person and as a professional.</li>\n</ul>\n\n<h3 id=\"will-i-do-it-again\">Will I do it again?</h3>\n\n<p><strong>Absolutely!</strong> Although I might take a different funding route.</p>\n\n<p>But that’s a topic for another post…</p>",
  "author": {
    "name": "danielhomola"
  },
  "category": [
    "",
    "",
    "",
    ""
  ],
  "summary": "The story of our healthcare AI startup and how I didn't become a millionaire"
}