{
  "title": "Changing Income Risk across the US Skill Distribution: Evidence from a Generalized Kalman Filter",
  "link": "https://fedinprint.org/item/fedmoi/93489/original",
  "description": "For whom has earnings risk changed, and why? To answer these questions, we develop a filtering method that estimates parameters of an income process and recovers persistent and temporary earnings for every individual at every point in time. Our estimation flexibly allows for first and second moments of shocks to depend upon observables as well as spells of zero earnings (i.e., unemployment) and easily integrates into theoretical models. We apply our filter to a unique linkage of 23.5m SSA-CPS records. We first demonstrate that our earnings-based filter successfully captures observable shocks in the SSA-CPS data, such as job switching and layoffs. We then show that despite a decline in overall earnings risk since the 1980s, persistent earnings risk has risen for both employed and unemployed workers, while temporary earnings risk declined. Furthermore, the size of persistent earnings losses associated with full year unemployment has increased by 50%. Using geography, education, and occupation information in the SSA-CPS records, we refute hypotheses related to declining employment prospects among routine and low-skill workers as well as spatial theories related to the decline of the Rust-Belt. We show that rising persistent earnings risk is concentrated among high-skill workers and related to technology adoption. Lastly, we find that rising persistent earnings risk while employed (unemployed) leads to welfare losses equivalent to 1.8% (0.7%) of lifetime consumption, and larger persistent earnings losses while unemployed lead to a 3.3% welfare loss.",
  "guid": "https://fedinprint.org/item/fedmoi/93489/original",
  "dc:creator": "Braxton, John Carter; Herkenhoff, Kyle F.; Rothbaum, Jonathan; Schmidt, Lawrence",
  "dc:date": "2021-12-15",
  "dc:subject": "Earnings risk; Transitory risk; Persistent risk; Technology adoption; Unemployment",
  "swpo:hasNumber": 55,
  "identifiers:doi": "10.21034/iwp.55",
  "bibo:series": "Opportunity and Inclusive Growth Institute Working Papers"
}