{
  "title": "Who Is The Visiting Ghost Boy? | Best of RGSO",
  "link": "https://audioboom.com/posts/8080503",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2181,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Was there a spirit that made it nearly impossible to sleep night after night?<br>\n<br>\n\n</div>\n<div>Here is a preview of the story.<br>\n“When I was finally able to claw myself awake and be able to move, I heard that damn alarm go off. I looked across the room and I saw a white figure in the corner next to my clock. I got the impression it was a woman but there were not really any distinct features. I felt a sense of terror go through me and I froze. The figure disappeared and the alarm stopped. After that I took the clock and threw it away even though it was a high school graduation present from my boyfriend who is now my husband. I lived there the whole summer and the insomnia continued. I was never comfortable sleeping there and only went to sleep when exhaustion forced me to sleep. My dreams were horrible all summer also. I had my Sheltie Zippy living with me after a while and she would sometimes growl and stare at that corner, but the figure never materialized again. After summer was over and the new semester was about to start my boyfriend moved into his own apartment.”<br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Sat, 04 Jun 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-05-09:/posts/8080503",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}