{
  "title": "How the Tech Media Keeps Artificial Intelligence at a Distance",
  "link": "https://datamining.typepad.com/data_mining/2015/05/how-the-tech-media-keeps-artificial-intelligence-at-a-distance.html",
  "description": "In sympathy with yesterday's post about AI as presented in films, consider this recent article from the Wall Street Journal: Artificial Intelligence Experts are in High Demand. A list of mostly machine learning experts is produced as evidence for the...",
  "content:encoded": "<p>In sympathy with yesterday&#39;s post about AI as presented in films, consider this recent article from the Wall Street Journal: <a href=\"http://www.wsj.com/article_email/artificial-intelligence-experts-are-in-high-demand-1430472782-lMyQjAxMTA1MzA2MTMwNTEyWj\" target=\"_self\">Artificial Intelligence Experts are in High Demand</a>. A list of mostly machine learning experts is produced as evidence for the topic of the article. There is an unfortunate trend being presented to the public in this space in which the term &#39;artificial intelligence&#39; is being used to draw readers with stories of real technical achievements in the space of machine learning and machine perception (recognizing a cat in a image is not an act of artificial intelligence), movies are being produced that <a href=\"http://datamining.typepad.com/data_mining/2015/05/how-hollywood-keeps-artificial-intelligence-at-a-distance.html\" target=\"_self\">romanticize a form of unobtainable AI</a>, and the two are being tied together with stories of impending doom (<a href=\"http://www.huffingtonpost.com/2014/10/27/elon-musk-artificial-intelligence_n_6053804.html\" target=\"_self\">Musk</a>, <a href=\"http://www.bbc.com/news/technology-30290540\" target=\"_self\">Hawking</a>).</p>\n<p>All this is done with little or no investment in helping us establish what we really mean - and need - in an artificial intelligence.</p>\n<p>If artificial intelligence experts were in high demand, then linguistics, philosophers, sociologists, etc. should be very happy - not just ML peeps.</p>",
  "dc:subject": "AI",
  "dc:creator": "Matthew Hurst",
  "dc:date": "2015-05-04T16:30:13-04:00"
}