{
  "title": "TU62: The Luv Doc – Dating and Relationship Advice from the Trenches with Dan Hardick",
  "link": "https://therapistuncensored.com/episodes/tu62-the-luv-doc-dating-and-relationship-advice-from-the-trenches-with-dan-hardick/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu62-the-luv-doc-dating-and-relationship-advice-from-the-trenches-with-dan-hardick",
  "pubDate": "Tue, 01 May 2018 19:30:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=5996",
  "description": "Get Dan Hardick’s irreverent and bitingly honest insights on the dating scene and relationships that survive. Also known as the Luv Doc, he provides a unique view with his decades of experience editing Personal Ads and giving cringe-worthy dating advice with his column in the Austin Chronicle. Great insights and rowdy fun.\n\nToday’s episode may shock, offend or entertain (we are uncensored, remember?), but we are excited to keep it real by bringing in a real-guy from the trenches of the dating world. Columnist Dan Hardick, the beloved “Luv Doc” from the Austin Chronicle has seen it all. He sheds light – I guess thats what he’d call it – on the dating scene and relationships from the unique position of having decades of experience editing the Personal Ads and eventually morphing into the Luv Doc, a humorist dating advice columnist.\n\nCohosts Dr. Ann Kelley and Sue Marriott interview the Doc about his unique experience listening to the lives and troubles and fantasies of Austin’s singles. They tie in attachment sciences but it’s even stronger to hear insights from this life expert.\n\nWith wit and vulgarity, Dan shares some things that haven’t changed from the old style personal ads. Find out how people make assumptions about others and tend to overestimate themselves when finding a partner.\n\nBottom line: based on your dating profile, would you date yourself? Have fun with this one and check out his column below!\n\nEpisode notes from TU63:\n\n0:00-15:00 personal ads in the 1980s and transitioning to dating apps and hook up lifestyle of today\n\nexcerpts from some of his columns followed by frank discussion.\n\n15:00-30:00 the difficulty in listing who you are and what you want in a succinct profile – the disconnect between who people are and who they see themselves to be.\n\ndown to earth advice including entering environments where you may find the type of partner you’re seeking, be the kind of person you would like to date. Therapist spin plays off the real world of dating, lot’s of insightful suggestions and insights\n\n30:00-45:00 complex idea of respect within self, sexual partner, self esteem, giving and earning respect, valuing what is available in the varied relationships. Importance of honesty in providing support/advice/feedback, even with difficult opinions\n\n45:00-60:00 Increasing authenticity to avoid threat in intimacy and honesty in a relationship Wrap up and outro\n\nResources:\n\nLuv Doc – Truth Telling’ : Being diplomatic isn’t being deceptive…\n\nOK the above link is a recent article by Luv Doc – be sure and let yourself (lose valuable time to a vortex of clicking) peruse the hyperlinks. Caution those w/ ADD! It’s as entertaining and informative as it is plain weird, but you’ll really get the feel of Hardick only by truly perusing. And don’t miss that the advice is actually valuable you just have to unwrap it from it’s irreverence.\n\nThe Luv Doc Austin Chronicle archives\n\nFingerpistol’s Dan’s hot and happening band\n\nCheck out this video Still in Texas to get a feel for the real thing!\n\nSingle but Dating – A Field Guide to Dating in the Digital Age  \n\nby Dr. Nikki Goldstein\n\nRECENTLY RELEASED – See our free Modern Adult Attachment 101 video here!!!\n\n \n\n \n\nTweet",
  "enclosure": "",
  "itunes:subtitle": "Get Dan Hardick’s irreverent and bitingly honest insights on the dating scene and relationships that survive. Also known as the Luv Doc, he provides a unique view with his decades of experience editing Personal Ads and giving cringe-worthy dating advic...",
  "itunes:summary": "Get the Luv Doc&apos;s irreverent and bitingly honest insights on the dating scene and relationships that survive. Also known as Dan Hardick, the Doc provides a unique perspective with his decades of experience editing Personal Ads and giving cringe-worthy dating advice with his column in the Austin Chronicle. Great insights and rowdy fun.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "51:44"
}