{
  "title": "Should I Work for an &#8220;Evil&#8221; Company?",
  "link": "https://freakonomics.com/2015/03/should-i-work-for-an-evil-company/",
  "dc:creator": "Stephen J. Dubner",
  "pubDate": "Tue, 31 Mar 2015 14:31:39 +0000",
  "category": [
    "Freakonomics Blog",
    "Evil",
    "Reader Question"
  ],
  "guid": "http://freakonomics.com/?p=109803",
  "description": "<p>A reader writes in with a question that is hard to answer. I thought it'd be best to put the question to you, our readers; hopefully you can help him find his way to a good decision.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/03/should-i-work-for-an-evil-company/\">Should I Work for an &#8220;Evil&#8221; Company?</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n",
  "content:encoded": "<p>A reader writes in with a question that is hard to answer. I thought it&#8217;d be best to put the question to you, our readers; hopefully you can help him find his way to a good decision.</p>\n<blockquote><p>Hello:</p>\n<p>I am an academic plant geneticists, who has worked at [a renowned academic institution] for the last five years. I&#8217;ve pretty much decided I want to leave academia but remain in science. The obvious direction to then go into is biotech and I think I could be a good fit for it. There are many options for me in biotech and I&#8217;ve applied for many jobs. The company that has been the most responsive to me is Monsanto.</p>\n<p>I&#8217;m sure Monsanto would be a great employer for the reasons I would like to work in biotech (stability, good pay/benefits and collaboration). However it is seen by most as perhaps the most &#8220;evil&#8221; company. I&#8217;m confident I would lose a lot of friends if I did work for them. Also, I doubt I would dare tell strangers that I worked for them.</p>\n<p>I&#8217;m not decided on how I feel about the company myself. I think they have done some messed-up things in the past but so have most large corporations. I&#8217;m more pro-GMO than most but also have my reservations. I understand the need for a company to patent seeds. I doubt I would be doing evil work for them and would not do it if I knew I was.</p>\n<p>I wonder if you would find it of interest to look into the ways people decide to work for companies that most people hate. I doubt all those people are dead inside. Maybe most people can easily make the decision to work for famously &#8220;evil&#8221; companies or not but I can&#8217;t see it as obviously black or white.</p></blockquote>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/03/should-i-work-for-an-evil-company/\">Should I Work for an &#8220;Evil&#8221; Company?</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n"
}