{
  "title": "U.S. Economy: Tracking Rate Hike Implications",
  "description": "<p>The new Fed hiking cycle has begun and with it comes expectations for faster rate hikes and quantitative tightening to address inflation, as well as questions around how and when the U.S. economy will be affected. Chief U.S. Economist Ellen Zentner and Senior U.S. Economist Robert Rosener discuss.</p><p><br></p><p>-----Transcript-----</p><p><br></p><p><strong>Ellen Zentner: </strong>Welcome to Thoughts on the Market. I'm Ellen Zentner, Chief U.S. Economist for Morgan Stanley Research.&nbsp;</p><p><br></p><p><strong>Robert Rosener: </strong>And I'm Robert Rosner, Morgan Stanley's Senior U.S. Economist.&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>On this episode of the podcast, we'll be talking about the outlook for the U.S. economy as the Fed begins a new rate hike cycle. It's Friday, March 25th at 9:00 a.m. in New York.&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>So Robert, last week the U.S. Federal Reserve raised the federal funds rate a quarter of a percentage point, which is notable because it's the first interest rate hike in more than two years, and it's likely to be the first of many. Chair Powell has told us that it's unlikely to be like any prior hiking cycle, so maybe you could share our view on the pace of hikes and where and when it might peak for the cycle.&nbsp;</p><p><br></p><p><strong>Robert Rosener</strong>: Well, it certainly is starting off unlike any recent policy tightening cycle, and recent remarks from Fed policymakers have really doubled down on the message that policy tightening is likely to be front loaded. And we're now forecasting that we're likely to see an even steeper path for Fed policy tightening this year, and we think that as soon as the May meeting, we could see the Fed pick up the pace and hike interest rates by 50 basis points and follow that in June with yet another 50 basis point increase. We're expecting they'll revert back to a 25 basis point per meeting pace after that, but still that marks 225 basis points of policy tightening that we're expecting this year in our baseline outlook.&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>So how does Jay Powell, the chair of the FOMC, fit into this? Do you think he's about in line with this view as well?&nbsp;</p><p><br></p><p><strong>Robert Rosener: </strong>He does seem to be generally in line with this view, but he is negotiating the outlook among a committee that has a diversity of views, and we've been hearing from policy makers, a wide range of policy makers, over the last week. What's been notable is that more and more policymakers are starting to get on board the train that a faster pace of policy tightening is likely to be warranted. And that may very well include rate hikes that come in larger increments, such as 50 basis point increments, over the course of the year as policymakers seek to get monetary policy into more of a neutral setting.&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>So this is all because of inflation. Inflation's broad based, it's rising. I think it felt like there was a very big shift on the FOMC January/February, when the inflation data was really rocketing to new heights. So in order to bring inflation down when the Fed is hiking, how long does it take for those hikes to flow through into the economy to bring inflation down?&nbsp;</p><p><br></p><p><strong>Robert Rosener: </strong>Well, that's a really good question, and certainly that broadening that you mentioned is key. We saw a run up in inflation in the later part of last year that was driven by a few segments, particularly on the goods side. But as we moved into the end of 2021 and early 2022, what we really started to see was a broadening out of inflationary pressures and particularly a broadening into the service sectors of the economy where price pressures began to pick up more notably and began to lead the inflation data higher. Now, as we think about how monetary policy interacts with that, tighter monetary policy needs to slow growth in order to slow inflation. And typically, you would look at monetary policy and not expect it to be really materially affecting the economy for, say, a year out. Something that Chair Powell has stressed is that monetary policy transmits through financial conditions, and financial markets moved to price in a more hawkish Fed outlook as soon as the latter part of last year. Now, as those rate hikes got priced into the market, that acted to tighten financial conditions. So as Chair Powell noted in his press conference, the clock for when rate hikes start to impact the economy doesn't necessarily start on the delivery of those rate hikes. It starts when they affect financial conditions. And so we may start to see that a backdrop of tighter financial conditions begins to reduce some of the steam in the economy and reduce some of the steam in inflation as we move through the course of the year. But with headline CPI currently at around 8%, likely to march higher in the upcoming data, there's a lot of room to bring that down. So we might have to wait some time before we see material relief on inflation.&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>So let's talk about the balance sheet because they're not just hiking rates, right? They're going to reduce the size of their balance sheet, what we call quantitative tightening or Q.T. And so run us through our view and how the Fed's thinking about that quantitative tightening process when they're unwinding much of that four and a half trillion in asset purchases that they made during the pandemic.&nbsp;</p><p><br></p><p><strong>Robert Rosener: </strong>So the Fed has made it clear they're on track to begin winding down the size of their balance sheet, and that's a decision that we're expecting will come at the May meeting, that in very short order the Fed would begin to reduce the size of its balance sheet with caps on reinvestment and total at about $80 billion per month. And that would set roughly the monthly pace by which the balance sheet would decline, and Chair Powell has indicated that that process may take around three years to bring the balance sheet down to a size that would be consistent with a neutral balance sheet. It's going to act to tighten financial conditions in the same way or similar ways that rate hikes do, but it's a little bit less clear how those effects happen, over what time horizons they happen. So there's some uncertainty there, but it's something that the Fed wants to have running in the background, while they pursue rate hikes.&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>So in terms of, you know, if the balance sheet is going to be doing additional tightening, what do we think the Fed funds equivalent of that is, has Chair Powell discussed that?</p><p><br></p><p><strong>Robert Rosener: </strong>So when we looked at this, we looked at the effects through financial conditions. And in our estimates, the tightening of financial conditions that we would see on the back of the balance sheet reduction that we're expecting, was about the equivalent this year of one additional 25 basis point hike. Now, perhaps coincidentally, Chair Powell in his most recent remarks, also noted that the tightening of the balance sheet or the shrinking of the balance sheet this year would be about the equivalent of one rate hike. So there's some consolidation of views there that it does act to tighten. Again, there's uncertainty bands around that, but it's about the equivalent of one additional hike this year.&nbsp;</p><p><br></p><p><strong>Robert Rosener: </strong>So Ellen, we can't really talk about the Fed raising rates without thinking about the broader implications for the yield curve, and more recently the applications for yield curve inversion. For listeners who might not be familiar, that's when shorter term investments in U.S. treasuries, such as the 2-year yield, pay more than longer term treasuries, such as the 10-year yield. Historically, when we've seen that spread inverting, it's been a signal that a recession might be coming. What are you thinking about the risks that the yield curve is telling us now? And does that tell us anything about the risk of a future recession?&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>Well, Robert, I think it is clear that the yield curve, if we're talking about just the spread between 2-year treasuries and 10-year treasuries, is going to continue to flatten and invert. And policymakers have made it clear that because of special factors, they shouldn't be concerned this time. And when I look at factors in the economy that are typically what you would look at for signals of recession, you know, jobs, we are still creating jobs, it’s been a very steady run of about 500,000 jobs a month. We are expecting another strong print in the upcoming payroll report, that does not speak to approaching recession. When I look at retail and wholesale sales still growing, industrial production still growing, real disposable income of households still growing. Even though we're dealing with the fading of fiscal stimulus, that labor income has been very strong. So all of those traditional measures would tell you that an inverted yield curve today is not providing you a signal of approaching recession, and I think overall inversion of the yield curve has become less of a recession indicator since we have been trapped so near the zero lower bound over the last cycle and this cycle.&nbsp;</p><p><br></p><p><strong>Robert Rosener: </strong>So we talked about the Fed, we talked about the yield curve and financial conditions, but of course, there's a lot of things that the Fed has to take into account as it thinks about the outlook. And of course, we're all watching the terrible events unfolding in Ukraine. And as we think about the ripple effects on the world economy, particularly in Europe, as well as more broadly on energy security and supply and so much more. Clearly, this is an impact that's going to be affecting regions differently. But how should we think about how that's going to be felt here in the U.S. economy? And what does that mean for the Fed?&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>So I think first and foremost, it plays back into the inflation story. I think what we've heard from the chair is that typically they do look through food and energy price fluctuations. But in this case, where inflation is already broad based and high, they do have to act and it just puts more fuel behind the need to have a more aggressive tightening cycle. When we look at our own analysis and impact analysis that you've done for us on the team, the impact on inflation from increases in energy prices is four times that of the impact on GDP growth. In the U.S. we're just about energy independent. And so it's become more ambiguous as whether higher energy prices are really a negative for the U.S. economy. But the way I would look at this is, it will slow activity in parts of the economy, we've taken our own growth forecasts down to reflect that forecast for GDP, and it will disproportionately affect lower income households. Where food prices, energy prices and just general inflation impacts them to a much greater degree than upper income households. So overall, aggregate spending will look quite strong in the U.S. economy, but for the lower income groups, I think it's going to be lagging behind. But certainly you mentioned Europe, you know, Europe is facing possible recession if gas supplies are cut off, which is a very real risk. But it's just not going to be as big of an impact to the U.S. economy, where we'll feel it is if other parts of the globe are deteriorating it can hamper financial conditions here, and that's something that the Fed will be watching closely. And so, Robert, you and I will be watching these developments closely as well. We've made it clear and the Fed has made it clear that it's on the path higher for interest rates, but the outlook always comes with risks and we'll be reporting back on those risks in future podcasts. So, thanks for taking the time to talk, Robert.&nbsp;</p><p><br></p><p><strong>Robert Rosener: </strong>Great talking with you, Ellen.&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>And thanks for listening. If you enjoy the show, please leave us a review on Apple Podcasts and share Thoughts on the Market with a friend or colleague today.</p>",
  "itunes:title": "U.S. Economy: Tracking Rate Hike Implications",
  "itunes:episodeType": "full",
  "itunes:episode": 582,
  "itunes:summary": "The new Fed hiking cycle has begun and with it comes expectations for faster rate hikes and quantitative tightening to address inflation, as well as questions around how and when the U.S. economy will be affected. Chief U.S. Economist Ellen Zentner and Senior U.S. Economist Robert Rosener discuss.",
  "content:encoded": "<p>The new Fed hiking cycle has begun and with it comes expectations for faster rate hikes and quantitative tightening to address inflation, as well as questions around how and when the U.S. economy will be affected. Chief U.S. Economist Ellen Zentner and Senior U.S. Economist Robert Rosener discuss.</p><p><br></p><p>-----Transcript-----</p><p><br></p><p><strong>Ellen Zentner: </strong>Welcome to Thoughts on the Market. I'm Ellen Zentner, Chief U.S. Economist for Morgan Stanley Research.&nbsp;</p><p><br></p><p><strong>Robert Rosener: </strong>And I'm Robert Rosner, Morgan Stanley's Senior U.S. Economist.&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>On this episode of the podcast, we'll be talking about the outlook for the U.S. economy as the Fed begins a new rate hike cycle. It's Friday, March 25th at 9:00 a.m. in New York.&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>So Robert, last week the U.S. Federal Reserve raised the federal funds rate a quarter of a percentage point, which is notable because it's the first interest rate hike in more than two years, and it's likely to be the first of many. Chair Powell has told us that it's unlikely to be like any prior hiking cycle, so maybe you could share our view on the pace of hikes and where and when it might peak for the cycle.&nbsp;</p><p><br></p><p><strong>Robert Rosener</strong>: Well, it certainly is starting off unlike any recent policy tightening cycle, and recent remarks from Fed policymakers have really doubled down on the message that policy tightening is likely to be front loaded. And we're now forecasting that we're likely to see an even steeper path for Fed policy tightening this year, and we think that as soon as the May meeting, we could see the Fed pick up the pace and hike interest rates by 50 basis points and follow that in June with yet another 50 basis point increase. We're expecting they'll revert back to a 25 basis point per meeting pace after that, but still that marks 225 basis points of policy tightening that we're expecting this year in our baseline outlook.&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>So how does Jay Powell, the chair of the FOMC, fit into this? Do you think he's about in line with this view as well?&nbsp;</p><p><br></p><p><strong>Robert Rosener: </strong>He does seem to be generally in line with this view, but he is negotiating the outlook among a committee that has a diversity of views, and we've been hearing from policy makers, a wide range of policy makers, over the last week. What's been notable is that more and more policymakers are starting to get on board the train that a faster pace of policy tightening is likely to be warranted. And that may very well include rate hikes that come in larger increments, such as 50 basis point increments, over the course of the year as policymakers seek to get monetary policy into more of a neutral setting.&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>So this is all because of inflation. Inflation's broad based, it's rising. I think it felt like there was a very big shift on the FOMC January/February, when the inflation data was really rocketing to new heights. So in order to bring inflation down when the Fed is hiking, how long does it take for those hikes to flow through into the economy to bring inflation down?&nbsp;</p><p><br></p><p><strong>Robert Rosener: </strong>Well, that's a really good question, and certainly that broadening that you mentioned is key. We saw a run up in inflation in the later part of last year that was driven by a few segments, particularly on the goods side. But as we moved into the end of 2021 and early 2022, what we really started to see was a broadening out of inflationary pressures and particularly a broadening into the service sectors of the economy where price pressures began to pick up more notably and began to lead the inflation data higher. Now, as we think about how monetary policy interacts with that, tighter monetary policy needs to slow growth in order to slow inflation. And typically, you would look at monetary policy and not expect it to be really materially affecting the economy for, say, a year out. Something that Chair Powell has stressed is that monetary policy transmits through financial conditions, and financial markets moved to price in a more hawkish Fed outlook as soon as the latter part of last year. Now, as those rate hikes got priced into the market, that acted to tighten financial conditions. So as Chair Powell noted in his press conference, the clock for when rate hikes start to impact the economy doesn't necessarily start on the delivery of those rate hikes. It starts when they affect financial conditions. And so we may start to see that a backdrop of tighter financial conditions begins to reduce some of the steam in the economy and reduce some of the steam in inflation as we move through the course of the year. But with headline CPI currently at around 8%, likely to march higher in the upcoming data, there's a lot of room to bring that down. So we might have to wait some time before we see material relief on inflation.&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>So let's talk about the balance sheet because they're not just hiking rates, right? They're going to reduce the size of their balance sheet, what we call quantitative tightening or Q.T. And so run us through our view and how the Fed's thinking about that quantitative tightening process when they're unwinding much of that four and a half trillion in asset purchases that they made during the pandemic.&nbsp;</p><p><br></p><p><strong>Robert Rosener: </strong>So the Fed has made it clear they're on track to begin winding down the size of their balance sheet, and that's a decision that we're expecting will come at the May meeting, that in very short order the Fed would begin to reduce the size of its balance sheet with caps on reinvestment and total at about $80 billion per month. And that would set roughly the monthly pace by which the balance sheet would decline, and Chair Powell has indicated that that process may take around three years to bring the balance sheet down to a size that would be consistent with a neutral balance sheet. It's going to act to tighten financial conditions in the same way or similar ways that rate hikes do, but it's a little bit less clear how those effects happen, over what time horizons they happen. So there's some uncertainty there, but it's something that the Fed wants to have running in the background, while they pursue rate hikes.&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>So in terms of, you know, if the balance sheet is going to be doing additional tightening, what do we think the Fed funds equivalent of that is, has Chair Powell discussed that?</p><p><br></p><p><strong>Robert Rosener: </strong>So when we looked at this, we looked at the effects through financial conditions. And in our estimates, the tightening of financial conditions that we would see on the back of the balance sheet reduction that we're expecting, was about the equivalent this year of one additional 25 basis point hike. Now, perhaps coincidentally, Chair Powell in his most recent remarks, also noted that the tightening of the balance sheet or the shrinking of the balance sheet this year would be about the equivalent of one rate hike. So there's some consolidation of views there that it does act to tighten. Again, there's uncertainty bands around that, but it's about the equivalent of one additional hike this year.&nbsp;</p><p><br></p><p><strong>Robert Rosener: </strong>So Ellen, we can't really talk about the Fed raising rates without thinking about the broader implications for the yield curve, and more recently the applications for yield curve inversion. For listeners who might not be familiar, that's when shorter term investments in U.S. treasuries, such as the 2-year yield, pay more than longer term treasuries, such as the 10-year yield. Historically, when we've seen that spread inverting, it's been a signal that a recession might be coming. What are you thinking about the risks that the yield curve is telling us now? And does that tell us anything about the risk of a future recession?&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>Well, Robert, I think it is clear that the yield curve, if we're talking about just the spread between 2-year treasuries and 10-year treasuries, is going to continue to flatten and invert. And policymakers have made it clear that because of special factors, they shouldn't be concerned this time. And when I look at factors in the economy that are typically what you would look at for signals of recession, you know, jobs, we are still creating jobs, it’s been a very steady run of about 500,000 jobs a month. We are expecting another strong print in the upcoming payroll report, that does not speak to approaching recession. When I look at retail and wholesale sales still growing, industrial production still growing, real disposable income of households still growing. Even though we're dealing with the fading of fiscal stimulus, that labor income has been very strong. So all of those traditional measures would tell you that an inverted yield curve today is not providing you a signal of approaching recession, and I think overall inversion of the yield curve has become less of a recession indicator since we have been trapped so near the zero lower bound over the last cycle and this cycle.&nbsp;</p><p><br></p><p><strong>Robert Rosener: </strong>So we talked about the Fed, we talked about the yield curve and financial conditions, but of course, there's a lot of things that the Fed has to take into account as it thinks about the outlook. And of course, we're all watching the terrible events unfolding in Ukraine. And as we think about the ripple effects on the world economy, particularly in Europe, as well as more broadly on energy security and supply and so much more. Clearly, this is an impact that's going to be affecting regions differently. But how should we think about how that's going to be felt here in the U.S. economy? And what does that mean for the Fed?&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>So I think first and foremost, it plays back into the inflation story. I think what we've heard from the chair is that typically they do look through food and energy price fluctuations. But in this case, where inflation is already broad based and high, they do have to act and it just puts more fuel behind the need to have a more aggressive tightening cycle. When we look at our own analysis and impact analysis that you've done for us on the team, the impact on inflation from increases in energy prices is four times that of the impact on GDP growth. In the U.S. we're just about energy independent. And so it's become more ambiguous as whether higher energy prices are really a negative for the U.S. economy. But the way I would look at this is, it will slow activity in parts of the economy, we've taken our own growth forecasts down to reflect that forecast for GDP, and it will disproportionately affect lower income households. Where food prices, energy prices and just general inflation impacts them to a much greater degree than upper income households. So overall, aggregate spending will look quite strong in the U.S. economy, but for the lower income groups, I think it's going to be lagging behind. But certainly you mentioned Europe, you know, Europe is facing possible recession if gas supplies are cut off, which is a very real risk. But it's just not going to be as big of an impact to the U.S. economy, where we'll feel it is if other parts of the globe are deteriorating it can hamper financial conditions here, and that's something that the Fed will be watching closely. And so, Robert, you and I will be watching these developments closely as well. We've made it clear and the Fed has made it clear that it's on the path higher for interest rates, but the outlook always comes with risks and we'll be reporting back on those risks in future podcasts. So, thanks for taking the time to talk, Robert.&nbsp;</p><p><br></p><p><strong>Robert Rosener: </strong>Great talking with you, Ellen.&nbsp;</p><p><br></p><p><strong>Ellen Zentner: </strong>And thanks for listening. If you enjoy the show, please leave us a review on Apple Podcasts and share Thoughts on the Market with a friend or colleague today.</p>",
  "guid": "gid://art19-episode-locator/V0/88GwdnXEJK-BgkI_zXwmGlZ8yqzcwd-ZSwrHjcHKSU4",
  "pubDate": "Fri, 25 Mar 2022 22:17:02 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:keywords": "Investing,Lead With Exceptional Ideas,Market Trends,Macroeconomics,Our People,U.S.",
  "itunes:duration": "00:10:34",
  "enclosure": ""
}