{
  "id": "tag:blogger.com,1999:blog-19803222.post-1811419271905748733",
  "published": "2017-04-12T08:07:00.000-06:00",
  "updated": "2017-04-12T08:58:32.820-06:00",
  "title": "Humans can still extort more money from me than machines can",
  "content": "Like lots of folks, I wonder sometimes about AI and jobs. I'm neither a believer that there's a catastrophe coming up, nor am I a believer that everything will magically work out and we're not entering a world with new forms of inequities.<br /><br />I did have an experience recently that made me think somewhat differently about what sorts of jobs are at risk.<br /><br />I was visiting family in LA, and renting a car (because LA). I can't remember what company it was, but they didn't have \"live people\" at the booth. Instead they had a row of kiosks, each with a monitor and camera and old school phone that---I kid you not---looked like:<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-42wLw2Bg74c/WOF3lQG8alI/AAAAAAAAAgM/IEpKLYwxXSMY0S0RwEFfnrosTdawX2qMQCLcB/s1600/s0020949_sc7.jpeg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-42wLw2Bg74c/WOF3lQG8alI/AAAAAAAAAgM/IEpKLYwxXSMY0S0RwEFfnrosTdawX2qMQCLcB/s1600/s0020949_sc7.jpeg\" /></a></div>Complete with curly cord.<br /><br />So how does this work? You go up to the device, and it auto-dials a real person. This person lives who knows were, though in my case he had a nice painted backdrop of some nature scene.<br /><br />They ask about your reservation, look it up, etc., and while looking it up, he asks what I'm doing in LA. Oh I'm visiting my mom. Blah blah blah.<br /><br />I then have to hold my drivers license up to the camera, we chat some more about how LA traffic is horrible. Blah blah blah.<br /><br />Throughout this whole conversation, I'm thinking: this would be so much easier if this thing were automated. I don't mean automated like \"chatbot\", I mean automated like the kiosks at airports, where I just push a bunch of buttons and then get a ticket (or in this case, car).<br /><br />And then, as you're all expecting, he asks me if I want to buy insurance.<br /><br />No machine would ever under any circumstances be able to sell me insurance. It would show a screen, ask me to click if I wanted it or not, and I would immediately press the \"No\" button.<br /><br />Now, I'm kind of a pushover, and so, especially since this guy was nice, had asked about my mom, shared complaints about traffic together, etc., when he asked me if I wanted insurance, it was <i>much harder</i> to say no. I did say no, though I'm pretty sure that me-five-years-ago might not have.<br /><br />Whatever company this is, I'm sure they did a study. They looked at how much they'd save by having automated systems rather that some folks in presumably a part of the country/world with much lower cost of living than LA. And the main trade-off was almost certainly that a machine isn't going to be nearly as successful at upselling insurance or car model or whatever as a person. And clearly at the end of the day, they decided that automation wasn't worth it here.<br /><br />(Insert all sorts of analogies to other jobs/areas of life.)<br /><br />EDIT 11am Eastern 12 Apr 2018: It occurred to me after I hit \"post\" that it's worth highlighting a major implicit caveat: the fact that the alleged study showed that it was worth putting money into human interaction is probably largely due to whatever the car rental company knew about, for instance, the economic status of their average customer. Where this needle falls---for instance if no few customers will choose to or can afford to be upsold---will have a significant impact on what the results of such a study will be, and will therefore vary across industries.<br /><br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "hal",
    "uri": "http://www.blogger.com/profile/02162908373916390369",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 1
}