{
  "id": "https://bibleinoneyear.org/en/youth/269",
  "title": "Day 269: Six Keys to Good Relationships",
  "description": "and live a life of love, just as Christ loved us and gave himself up for us as a fragrant offering and sacrifice to God., Isaiah 63:7–16, Ephesians 4:22–32, 5:1–2. Love is practical  Chiara said, ‘Love the other person as yourself… Imagine how the world would be if the golden rule were put into practice not only between individuals, but also between ethnic groups, peoples and nations, if everyone *loved* the other country as their own",
  "pubDate": "Mon, 26 Sep 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/269/",
  "itunes:duration": "15:05",
  "guid": "enyouth26092022-269",
  "length": 905.64,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 269: Six Keys to Good Relationships",
  "itunes:subtitle": "and live a life of love, just as Christ loved us and gave himself up for us as a fragrant offering and sacrifice to God., Isaiah 63:7–16, Ephesians 4:22–32, 5:1–2. Love is practical  Chiara said, ‘Love the other person as yourself… Imagine how the world would be if the golden rule were put into practice not only between individuals, but also between ethnic groups, peoples and nations, if everyone *loved* the other country as their own",
  "itunes:summary": "When she was nineteen years of age, Chiara Lubich gathered with a few friends in northern Italy. It was 1939 and, as bombs fell, they asked this question: ‘Was there an ideal that bombs could not destroy?’ Their answer was, ‘Yes, the love of God’.\nThey had experienced God’s overwhelming love and they wanted to share it with others. They imitated God by living a life of love (Ephesians 5:1–2). They helped those in need. They shared what little food they had. They found clothing for those who had none. They comforted the bereaved.\nSuch a warmth emanated from Chiara and her friends that people gave them the name ‘Focolare’, which means ‘hearth’ or ‘fireplace’. Focolare now has 2 million members in 182 countries. Members of the Focolare community make it their rule of life, 24 hours a day, to live by the golden rule of Jesus: ‘Do to others what you would have them do to you’ (Matthew 7:12).\nLove is practical. Chiara said, ‘Love the other person as yourself… Imagine how the world would be if the golden rule were put into practice not only between individuals, but also between ethnic groups, peoples and nations, if everyone loved the other country as their own.’\nHow can we imitate God and live a life of love?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 634
}