{
  "title": "The Edition: Assetocracy, the inversion of the welfare state",
  "link": "https://audioboom.com/posts/7938838",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1984,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode: why is the Prime Minister so desperate to support the assetocracy? In <em>The Spectator</em>’s cover story this week, after Boris Johnson revealed his plan to pay for social care with a National Insurance increase, Fraser Nelson says there has been an inversion of the welfare state. It is right to ask the working poor to pay more taxes to help cover the social care of people who could easily fund it themselves? Kate Andrews, The Spectator’s economics editor, joins Fraser to discuss. (00:47)<br>\n<br>\n\n</div>\n<div>Plus, why is our knowledge of Soviet atrocities so poor? Attempting to fix this, James Bartholomew has been interviewing and recording the stories of survivors of Soviet oppression and torture. In the magazine this week, he tells a few of these stories, but also asks the question: why is it acceptable, or even trendy, to declare yourself a communist? James discusses his project with Konstantin Kisin, a Russian born comic and host of the Triggernometry podcast whose family lived under a Soviet regime. (16:18)</div>\n<br>\n<div>And finally, why does London have so many American sweet shops? Some of London’s busiest streets are host to them, taking up prime real estate in the capital. Hannah Moore writes about her confusion with this phenomenon in this week’s <em>Spectator</em>. She joins Lara along with food trend expert Shokofeh Hejazi. (26:46)</div>\n<br>\n<div>Hosted by Lara Prendergast</div>\n<br>\n<div>Produced by Sam Holmes</div>\n<br>\n<br>\n",
  "pubDate": "Thu, 09 Sep 2021 14:11:00 +0000",
  "guid": "tag:audioboom.com,2021-09-09:/posts/7938838",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}