{
  "title": "Joel McHale, Taylor Tomlinson, We Get an Inside Scoop on Call Her Daddy's Suitman, and MGK & Megan Fox",
  "description": "<p>Don't forget to subscribe, rate, and review!  Let us know what you want us to do for Top 5 Tuesday!\n\nWe kick off the show talking about the developments in the Call Her Daddy drama and we get some info from an inside source regarding Suitman. We talk about Joe Rogan's upcoming move to Spotify and what that means for the podcast industry. MGK finally dropped his Bloody Valentine music video starring Megan Fox and as a surprise to no one it's awesome. We answer a DM asking how a guy can tell his wife she's getting fat in quarantine. Let us know what you think he could say. AITA Thursday includes a dedication to OJ Simpson, role play, and sex life over family. Voicemails include life as a movie genre, price to be on a tattoo show, and being nice to strangers.\n\n(01:15:00) Joel McHale returns to the show. He tells us about trying to teach his kids in quarantine, why he pushed to be busier now than he's ever been in his career, he calls back to Feits' trying to date a princess, and much more. Check out his podcast The Darkest Timeline, the CW show Stargirl, his upcoming movie Becky, an animated Mortal Kombat and more from him. \n\n(01:45:13) Taylor Tomlinson joins the show. We discuss how quarantine pushed her and her boyfriend to create content together, whether or not she would ever do a zoom comedy show, growing up catholic, and we create possibly our best show idea with her. Check out Taylor's stand up special on Netflix Quarter Life Crisis, her podcasts Self-Helpless and This is Important to Me with Sam Morrill. \n\nAs always, let us know what you think of the podcast and follow along on twitter.\n@KFCRadio @KFCBarstool @Feitsbarstool @TaylorTomlinson @JoelMcHale\n\nSubscribe to our Youtube Channel here:\nhttps://www.youtube.com/user/KFCradio\n\nFollow Us on Instagram Here:\nhttps://www.instagram.com/kfcradio/</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/kfcr\">barstool.link/kfcr</a></p>",
  "guid": "268d5998-c4a0-4b71-a286-367db5c57045",
  "pubDate": "Thu, 21 May 2020 08:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/kfc-radio",
  "itunes:explicit": "yes",
  "itunes:duration": "02:12:44",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}