{
  "id": "https://bibleinoneyear.org/en/youth/286",
  "title": "Day 286: God’s Good Plans for Your Future",
  "description": "Psalm 119:25–32, Jeremiah 29:1–14, 2 Thessalonians 1:3–12.  Much of it is hidden from us  However, there are certain things about your future that God tells you",
  "pubDate": "Wed, 13 Oct 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/286/?ignore",
  "itunes:duration": "14:31",
  "guid": "enyouth13102021-286",
  "length": 871.03,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 286: God’s Good Plans for Your Future",
  "itunes:subtitle": "Psalm 119:25–32, Jeremiah 29:1–14, 2 Thessalonians 1:3–12.  Much of it is hidden from us  However, there are certain things about your future that God tells you",
  "itunes:summary": "Futurologists make predictions about the future. One prediction is that some babies born now are likely to live to the ripe old age of 150. Wired magazine not long ago predicted that meal replacement patches (taking nicotine replacement patches a step further) would be in existence by 2018, and that by 2020 there would be a new financial currency introduced for purchases in space!\nSome look to futurologists to know what is coming. Others go further. Some people read their horoscopes because they want to know what their future holds. However, Jeremiah warns in the passage for today, ‘Don’t for a minute listen to… spiritualists and fortunetellers, who claim to know the future’ (Jeremiah 27:9, MSG).\nThe study of history helps us to predict the future. As Winston Churchill once said, ‘To understand the future we need to understand the past.’\nBut as the one who holds the past, present and future in his hands, only God truly knows the future. Much of it is hidden from us. However, there are certain things about your future that God tells you.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 286
}