{
  "title": "The Edition: Theatre of war",
  "link": "https://audioboom.com/posts/8033418",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2030,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: What is the next act in Putin’s theatre of war?</div>\n<div><br>\n</div>\n<div>For this week’s cover story, James Forsyth writes about Putin’s dangerous dramatics on the Russian-Ukrainian border and where they might lead. James joins the podcast along with Paul Wood, who writes in this week’s magazine that Putin’s bluff may be backfiring. (00:49)</div>\n<div><br>\n</div>\n<div>Also this week: How important is gallows humour?</div>\n<div><br>\n</div>\n<div>The BBC’s new comedy-drama, This Is Going To Hurt, based on the best-selling book of the same title by trainee doctor turned comedian Adam Kay depicts some truly gut-wrenching scenes with a touch of gallows humour. This week in The Spectator, Andrew Watts writes a defence of making dark jokes in serious situations as not only a stress relief exercise, but a genuine necessity for getting through the day. He joins the podcast along with Ed Patrick, a comedian and NHS anaesthetist whose new book <a href=\"https://www.amazon.co.uk/dp/1914240200\">Catch Your Breath</a> about working in the NHS during the pandemic is out now. (16:05)</div>\n<div><br>\n</div>\n<div>And finally: why have we stopped whistling?</div>\n<div><br>\n</div>\n<div>Whistling can be seen as a bit annoying at best and rude at worst. But in this week’s Spectator, Steve Morris laments the loss of everyday whistling. He considers it a way of bringing music into one’s life for those who don’t own a piano. He joins the podcast along with whistling world champion <a href=\"https://davidmorris-whistler.com/contact/\">David Morris</a>, who has released six albums of his whistling. (25:50)</div>\n<div><br>\n</div>\n<div>Hosted by Lara Prendergast and William Moore</div>\n<div><br>\n</div>\n<div>Produced by Sam Holmes</div>\n<div><br>\n</div>\n<div>Subscribe to The Spectator today and get a £20 Amazon gift voucher:<a href=\"http://www.spectator.co.uk/voucher\">www.spectator.co.uk/voucher</a>\n</div>\n<div><br>\n</div>\n<div>Listen to Lara's food podcast Table Talk: <a href=\"https://www.spectator.co.uk/podcasts/table-talk\">https://www.spectator.co.uk/podcasts/table-talk</a>\n</div>\n",
  "pubDate": "Thu, 17 Feb 2022 16:45:45 +0000",
  "guid": "tag:audioboom.com,2022-02-17:/posts/8033418",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}