{
  "id": "tag:blogger.com,1999:blog-19803222.post-118570103044139587",
  "published": "2018-07-16T14:26:00.003-06:00",
  "updated": "2018-07-16T14:26:54.921-06:00",
  "title": "Yet another list of things we can do to have more diverse sets of invited speakers",
  "content": "I am super reticent to write this because <i>so many people</i> have written similar things. Yet despite that, we still have things like an initial workshop program with 17 invited speakers of whom 16 are men (at ICML 2018) and a panel where 3 of the 5 panelists are or were previously in the same group at Stanford (at NAACL 2018). And I (and others) still hear things like \"tell me what to do.\" So, here it is, I'm saying what we should do. (And I'm saying this mostly so that the others, who are usually women, don't have to keep dealing with this and can hopefully point here.)<br /><br />Like any such list, this is incomplete. I'd love suggestions for improvements. I'm also taking for granted that you <i>want</i> a diverse set of invited speakers. If you don't, go read up on that first.<br /><br />I think it's also important to recognize that we all mess up. I (Hal) have messed up many times. The important thing is to learn. In order to learn, we need a signal, and so if someone points out that your event did not live up to what-should-be-expectations, accept that. Don't get defensive. Realize that this learning signal is super rare, and so apply some <a href=\"https://en.wikipedia.org/wiki/Inverse_probability_weighting\">inverse propensity weighting</a> and do a big learning update.<br /><br />This list was created by my first brainstorming ideas (largely based on my own failures), then going to some excellent sources and adding/modifying. You should also read these sources (which mostly focus on panels, not invited speakers, and also mostly focus on gender):<br /><ul><li> <a href=\"https://www.theguardian.com/commentisfree/2013/nov/06/four-steps-to-put-an-end-to-all-male-panels-at-conferences\">Four steps to put an end to all-male panels at conferences</a>, Bronwen Clune, The Guardian, 2013 </li><li> <a href=\"https://www.huffingtonpost.com/entry/all-male-panel-pledge_us_56e848f9e4b065e2e3d77148\">Stop Agreeing To Be On All-Male Panels  Just Stop</a>, Emily Peck, Huffington Post, 2016 </li><li> <a href=\"https://onthinktanks.org/articles/there-is-no-excuse-for-an-all-male-panel-how-to-avoid-them/\">How to avoid an all-male panel? Just try harder</a>, Enrique Mendizabal, On Think Tanks, 2016 </li><li> <a href=\"http://foreignpolicy.com/2016/03/08/7-rules-for-avoiding-all-male-panels/\">7 Rules for Avoiding All-Male Panels</a>, Jacqueline O'Neill, Foreign Policy, 2016 </li><li> <a href=\"http://www.slate.com/blogs/better_life_lab/2017/10/06/there_is_no_excuse_for_all_male_panels_here_s_how_to_fix_them.html\">There’s No Excuse for All-Male Panels. Here’s How to Fix Them</a>, Brigid Schulte, Slate, 2017 </li><li> <a href=\"https://www.replyall.me/jofas-cast/preventing-all-male-panels/\">Preventing All Male Panels</a>, Sharon Weiss-Greenberg and Panelists, ReplyAll&nbsp;</li></ul>&nbsp;Okay, so here's my list, broken down into \"phases\" of the workshop organization process.<br /><ul><li> <b> Before you begin inviting folks </b>      <ul><li> <span style=\"color: #38761d;\"><b>Have an goal</b></span>, write it down, and routinely evaluate yourself against that goal. If you succeed, great. If you fail, learn (also great!). </li><li><span style=\"color: #38761d;\"><b>Have co-organizers with different social networks</b></span> than you have, or you'll all only think of the same people. </li><li><span style=\"color: #38761d;\"><b> Start with an initial diverse list</b></span> of potential speakers that's <i>mostly</i> (well more than half) women and/or minorities, covering different geographic regions, different universities, and different levels of \"seniority\". You need to start with well more than half because (a) you should expect many to say no, and because (b) many of your contributed papers are highly likely presented by abled white guys from privileged institutions in the US, so if the event is to be even remotely balanced you need to compensate early. </li><li> <span style=\"color: #38761d;\"><b>Scan through the proceedings </b></span>of recent conferences for people that aren't immediately on your radar. </li><li> If you can't come up with a long enough list that's also diverse, then maybe <span style=\"color: #38761d;\"><b>consider whether your topic is just \"you and your buddies,\"</b></span> and perhaps think about if you can expand your topic in an interesting direction to cast a broader net. </li><li> If you can't come up with such a list, <span style=\"color: #38761d;\"><b>maybe your criteria for who to invite is unrealistic</b></span> already very white male-biased. For instance, having a criteria like \"I only want full profs from US universities\" comes with a lot of historical/social baggage. </li><li><span style=\"color: #38761d;\"><b> Ask everyone you know for suggested names</b></span>. Check out existing resources like the <a href=\"http://wimlworkshop.org/directory-of-women-in-machine-learning/\">WiML</a> and <a href=\"http://www.winlp.org/big-directory/\">Widening NLP</a> directories, but also realize that there are many forms of diversity that may not be well covered in these. </li><li> Once you have long list of potential speakers with many women or minorities on it, <span style=\"color: #38761d;\"><b>ensure that you're not just inviting women to talk about \"soft\" topics</b></span> and men about \"technical\" topics. </li></ul></li><li> <b> In the invitation process </b>      <ul><li> In the invitation letter to speakers, <span style=\"color: #38761d;\"><b>offer to cover childcare</b></span> for the speaker (regardless of who it is) either at the workshop or at their home city. Women in particular often take the majority of child rearing responsibilities; this may help tip the scales, but will also help everyone who has kids. </li><li> In each invitation that you send out to men, or people who are not under-represented, <span style=\"color: #38761d;\"><b>ask them <i>explicitly</i> for suggestions of additional speakers</b></span> (who are not white men) you could invite in the initial invitation (i.e., not just when they decline). </li><li> <span style=\"color: #38761d;\"><b>Invite speakers from under-represented or historically excluded groups <i>very early</i> </b></span>before they become even more overcommitted. But also give them an easy out to say no. </li><li> When you start sending invitations out, <span style=\"color: #38761d;\"><b>invite the abled white guys at </b></span><span style=\"color: #38761d;\"><b><span style=\"color: #38761d;\"><b>privileged institutions </b></span>slowly</b></span> and later. That way, if you have trouble getting a diverse set of speakers, you’re not already overcommitted. </li></ul></li><li> <b> Dealing with challenges </b>      <ul><li> If the diversity of your event is being hurt by the fact that potential speakers cannot travel, <span style=\"color: #38761d;\"><b>consider allowing one or two people speak remotely</b></span>. </li><li> If you do find yourself overcommitted to a non-diverse speaker group, <span style=\"color: #38761d;\"><b>it may be time to eat crow, apologize</b></span> to a few of them, and say directly that you were aiming for a diverse slate of speakers, but you messed up, and you would like to know if they would be willing to step down to allow room for someone else to speak in their stead. </li><li> <span style=\"color: #38761d;\"><b>Go back to your goals.</b></span> How are you doing? What can you do better next time?</li></ul></li></ul><br />Finally, if you're a guy, or otherwise hold significant privilege, even if you're not organizing a workshop try to help people  who are. You should have a go-to list of alternate speakers that you can  provide when colleagues ask you for ideas of who to invite or when you get invited yourself. You can have  an <a href=\"https://en.wikipedia.org/wiki/Inclusion_rider\">inclusion</a> <a href=\"http://hal3.name/faq.html\">rider</a> for giving talks and being on panels, and perhaps also for putting your name on workshops as a co-organizer. I promise, people will appreciate the help!<br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "hal",
    "uri": "http://www.blogger.com/profile/02162908373916390369",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 11
}