{
  "title": "58: Burnout To Balance",
  "pubDate": "Wed, 25 Apr 2018 14:00:32 +0000",
  "guid": "a8da283f2eeafad4747a82194a98780d",
  "link": "https://sites.libsyn.com/94610/58-burnout-to-balance",
  "itunes:image": "",
  "description": "<p class=\"p1\">How do you go from burnout to balance?<br /> <br /> Most of us have days where we feel depleted, helpless, overloaded, where you don’t want to get out of bed, and much less pursue your dreams.<br /> <br /> But what if you’re feeling like this on most days? Then you might be suffering from a burnout.<br /> <br /> Our bodies and brains are equipped to handle stress in short bursts, but not over long extended periods of time.<br /> <br /> The impact of burnout is very real. Lack of motivation, decrease in confidence and performance, increased moodiness, negative thinking, all of which lower the quality of life you desire and deserve.<br /> <br /> But this burnout is a signal, not a sentence.<br /> <br /> So in this episode, I would like to talk about the signs of burnout AND the solutions you can apply to negate them.<br /> <br /> *Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to <a href= \"http://www.KwikBrain.com/podcast\">www.KwikBrain.com/podcast</a> to get instant access. </p>",
  "content:encoded": "<p class=\"p1\">How do you go from burnout to balance?  Most of us have days where we feel depleted, helpless, overloaded, where you don’t want to get out of bed, and much less pursue your dreams.  But what if you’re feeling like this on most days? Then you might be suffering from a burnout.  Our bodies and brains are equipped to handle stress in short bursts, but not over long extended periods of time.  The impact of burnout is very real. Lack of motivation, decrease in confidence and performance, increased moodiness, negative thinking, all of which lower the quality of life you desire and deserve.  But this burnout is a signal, not a sentence.  So in this episode, I would like to talk about the signs of burnout AND the solutions you can apply to negate them.  *Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to <a href= \"http://www.KwikBrain.com/podcast\">www.KwikBrain.com/podcast</a> to get instant access. </p>",
  "enclosure": "",
  "itunes:duration": "15:37",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "How do you go from burnout to balance?  Most of us have days where we feel depleted, helpless, overloaded, where you don’t want to get out of bed, and much less pursue your dreams.  But what if you’re feeling like this on most days? Then you might...",
  "itunes:episodeType": "full"
}