{
  "title": "Welcome to UFYB: Start Here!",
  "pubDate": "Thu, 25 Feb 2021 15:05:00 +0000",
  "guid": "297e1e5d-08e7-489b-9a03-24da49162dca",
  "link": "http://unfuckyourbrain.com/",
  "itunes:image": "",
  "description": "<p>Welcome to UnF*ck Your Brain! This podcast teaches you concrete, effective, mind-blowing tools that you can use to reduce anxiety, improve your productivity, dial-up your self-confidence, and dial down your insecurity and people-pleasing.<br /> <br /> I’m Kara Loewentheil, a master certified life coach with degrees from Harvard and Yale – and a former high-powered career working for women’s rights. I’ve taken all the best neuroscience, evolutionary psychology, and coaching tools I know and combined them with feminist theory to create a set of powerful practices and life-changing ideas that will teach you how to liberate yourself from the inside out.<br /> <br /> You can be the strong, empowered, confident woman you’ve always wanted to be – you just have to learn how to clear away all the negative self-talk and messages from the patriarchy that are keeping you small.<br /> <br /> So let’s not sit here just talking about it – because I’m all about teaching you how to take smart action! You can start anywhere you like, every episode stands alone – just scroll and find a topic that calls you, and hit play. Join the feminist mindset revolution - your life will never be the same.</p>",
  "content:encoded": "<p>Welcome to UnF*ck Your Brain! This podcast teaches you concrete, effective, mind-blowing tools that you can use to reduce anxiety, improve your productivity, dial-up your self-confidence, and dial down your insecurity and people-pleasing.  I’m Kara Loewentheil, a master certified life coach with degrees from Harvard and Yale – and a former high-powered career working for women’s rights. I’ve taken all the best neuroscience, evolutionary psychology, and coaching tools I know and combined them with feminist theory to create a set of powerful practices and life-changing ideas that will teach you how to liberate yourself from the inside out.  You can be the strong, empowered, confident woman you’ve always wanted to be – you just have to learn how to clear away all the negative self-talk and messages from the patriarchy that are keeping you small.  So let’s not sit here just talking about it – because I’m all about teaching you how to take smart action! You can start anywhere you like, every episode stands alone – just scroll and find a topic that calls you, and hit play. Join the feminist mindset revolution - your life will never be the same.</p>",
  "enclosure": "",
  "itunes:duration": "03:03",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Welcome to UnF*ck Your Brain! This podcast teaches you concrete, effective, mind-blowing tools that you can use to reduce anxiety, improve your productivity, dial-up your self-confidence, and dial down your insecurity and people-pleasing.  I’m Kara...",
  "itunes:episodeType": "trailer",
  "itunes:author": "Kara Loewentheil"
}