{
  "title": "Insight Fall Updates: How Insight is adapting in 2020",
  "link": "https://blog.insightdatascience.com/insight-fall-updates-how-insight-is-adapting-in-2020-dee47d01e8d1?source=rss----d02e65779d7b---4",
  "guid": "https://medium.com/p/dee47d01e8d1",
  "dc:creator": "Jake Klamka",
  "pubDate": "Thu, 25 Jun 2020 15:28:45 GMT",
  "atom:updated": "2020-06-25T15:28:45.500Z",
  "content:encoded": "<p>In order for Insight to deliver on our mission, we’re making the following changes in response to the global COVID pandemic and resulting challenges in the job market:</p><ul><li>Many companies are continuing to hire, but have slashed their recruiting budgets. As a result, we are <strong>waiving the Insight sponsorship fee</strong> for companies to maximize job opportunities for Insight Fellows.</li><li>We are increasing our membership dues for Insight Fellows to $24,000 or an Income Share Agreement (ISA) of <strong>12% for 2 years</strong> <strong>with no upfront cost</strong>, to cover the shortfall.</li><li>We are <strong>maintaining our strong job guarantee </strong>for all Insight Fellows: you don’t pay anything unless you accept a relevant offer making <strong>at least $100,000 per year, and receive that offer within 6 months</strong> of finishing the Insight Fellows Program.</li><li>We are working to improve access to Insight by offering <strong>loans </strong>and<strong> expanding scholarships</strong>.</li><li>The Insight Fellows <strong>Fall session that starts on September 14, 2020 will run remotely</strong>, continuing the success we’re seeing in our current remote summer session.</li></ul><p>Delivering on our mission of helping Insight Fellows transition to thriving careers in cutting edge, high impact fields is more important than ever. COVID has accelerated the pace of technology adoption — including data, machine learning, cloud infrastructure, security and various other fields we work in — with medium and long term opportunity in these fields being larger than ever. With that said, the short term environment during this pandemic is challenging, but we are continuing to deliver on our mission of accelerating career transitions by leveraging the Insight network.</p><p>We’re excited to work with a new group of Insight Fellows starting in September, and help you transition careers. You can click here to <a href=\"https://insightfellows.com\">learn more about the Insight network</a> or <a href=\"https://apply.insightfellows.com/\"><strong>apply here</strong></a>.</p><p>More details on each of these points is below.</p><h3>Fellows First: Waiving Hiring Fees</h3><p>While the COVID-19 pandemic — and the repercussions it’s having on the hiring market — is impacting Insight and our community, we remain committed to our mission of helping Insight Fellows find thriving careers. And we are doubly committed to our core value: Fellows First.</p><p>Since 2012, the Insight core value has been to put Fellows First, and we have helped over 3,000 members of our professional network transition to new, cutting-edge fields. We have maintained a business model that tightly aligns the success of our members with the success of Insight, ensuring that the strength of our community is possible only if individual members are benefitting and can pay it forward.</p><p>Insight will continue to put our Fellows First by optimizing for their long-term career success. For example, we’ve always encouraged our Fellows to accept the best offer for their careers, even if it’s not from one of our formal hiring partners. We’re taking this even further now. Given the significant reduction in recruiting budgets (money that is used to promote and source candidates for roles), <strong>we are waiving the sponsorship fee to hire Insight Fellows for all companies</strong> for the time being. By waiving this fee, we’re removing every possible barrier to get hiring teams involved. Members of our network have stepped up over the past month and surfaced several dozens of great roles at top companies. We will continue this fee waiver into the Fall if it allows us to continue getting more opportunities for Insight Fellows.</p><h3>Membership Dues and Guarantee</h3><p>While these core principles are foundational to Insight, we need to adapt to the new reality we’re all facing. Since we can’t rely on the sponsorship fees from companies in the current economic environment, we need to raise our membership dues to $24,000 for Insight Fellows<strong> </strong>who join our community starting this September<strong>. </strong>Alternatively<strong>, </strong>for those who choose to pay via an<strong> </strong>Income Share Agreement (with no upfront costs), we will now ask Insight Fellows to <strong>share 12% of their income for 2 years</strong>.</p><p>We are also partnering with a third-party loan provider to allow Insight Fellows to take out a loan for the membership dues. In particular, those with strong US credit scores can expect interest rates between 8–9%, making this another affordable payment option without upfront costs. <em>Note: details on membership dues for Insight in Toronto, Canada to follow shortly.</em></p><p>The membership dues will continue to fund an extensive post-program experience which includes 1-on-1 coaching through the job search and numerous on-going alumni member benefits.</p><p>Regardless of the payment option, you continue to get our strong career results <strong>guarantee</strong>: you only pay if you accept a <strong>relevant job offer earning at least $100,000 per year, and receive that offer within 6 months</strong> of program completion. If you do not, we refund your membership dues (or cancel your ISA or loan), and you continue to receive all the benefits of being a member of the Insight network.</p><p>By maintaining our guarantee for each membership payment option, we are continuing to stay aligned with Insight Fellows. As always, Insight only succeeds if Insight Fellows succeed in transitioning to their new career.</p><h3>Scholarships</h3><p>One of the most difficult aspects of increasing the commitment for new members of our community is the potential impact on the access to the Insight network. Our network exists to help people from all backgrounds and economic situations advance their careers. We strive to ensure that every member of Insight has the same opportunity to be financially successful, regardless of their background when they start Insight. While these problems aren’t new, we feel that it’s important to take concrete steps given the increased membership dues.</p><p>To address this, we’re increasing the amount we offer through our need-based scholarships to new members of our community. We’re also introducing a diversity-based scholarship of up to $5,000 to help Fellows from backgrounds that have been historically underrepresented at Insight and in the tech community. We’re also organizing ways for our network of experienced members, industry partners, and team members to provide mentorship to new and potential members from underrepresented backgrounds.</p><h3>Insight Fellow Outcomes</h3><p>Insight Fellows are extremely successful in their career, both in their first role and over years of growth in their new specialization. 88% of Insight Fellows receive a relevant offer within 6 months (the median is only 8 weeks), with an average total cash compensation of over $140,000 per year. Furthermore, when you compare starting salaries by location and specialization, <strong>Insight Fellows earn </strong><a href=\"https://insightfellows.com/outcomes\"><strong>24% more than the industry average</strong></a> (as reported by Glassdoor). Beyond the immediate outcomes following the program, the long term benefits of Insight come from the network, where strong connections lead to a career of technical growth and new opportunities. That said, earning 24% more than industry peers means joining Insight is a strong financial decision based on initial salary data alone.</p><figure><a href=\"https://insightfellows.com/outcomes\"><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*v_pN5WJU_gdJCz-Ta7X4Rg.png\" /></a><figcaption>Source: Data reported from Fellows that joined Insight since 2017, compared to corresponding market data reported on Glassdoor in May 2020</figcaption></figure><h3>Investing in our remote experience</h3><p>Since it’s unclear when it will be safe to return to Fellows collaborating closely in offices, we are investing more in our remote experience. We launched our remote program in 2015 and that experience has allowed us to successfully transition our summer session, currently in progress, to all-remote for all our locations.</p><p>The remote program has the same level of structured collaboration, mentoring, participation from advisors, and coaching as our in-person programs. As a result, the Fellows in the remote program speak highly of the social and collaborative component, building deep and life-long connections. Finally, our hiring partners are offering remote interviews and are continuing to make job offers to the current Fellows for in-person and remote roles.</p><p>Given this success, <strong>the </strong><a href=\"https://apply.insightfellows.com/\"><strong>next session</strong></a><strong> of Insight, starting on September 14th, will run fully remotely</strong> across all our locations and programs.<strong> </strong>We’re happy that this change allows us to maintain the health and safety of our community, while maintaining the highly collaborative, network-driven experience that the Insight Fellows Programs are known for.</p><h3>Looking Ahead</h3><p>Delivering on our mission of helping Insight Fellows transition to thriving careers in cutting edge, high-impact fields is more important than ever. The strength and support of the Insight community has been nothing short of incredible and on full display in the past months as the COVID pandemic has unfolded. We are leveraging the strength of our community to deliver a phenomenal remote experience and help more Insight Fellows transition to thriving, positive, impactful careers. We’re excited to work with a new group of Insight Fellows starting in September — <a href=\"https://insightfellows.com\">learn more about the Insight network</a> or <a href=\"https://apply.insightfellows.com/\"><strong>apply here</strong></a>.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=dee47d01e8d1\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://blog.insightdatascience.com/insight-fall-updates-how-insight-is-adapting-in-2020-dee47d01e8d1\">Insight Fall Updates: How Insight is adapting in 2020</a> was originally published in <a href=\"https://blog.insightdatascience.com\">Insight</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}