{
  "title": "You can read for free but comments cost money . . . or is it the other way around?",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/27/you-can-read-for-free-but-comments-cost-money-or-is-it-the-other-way-around/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/27/you-can-read-for-free-but-comments-cost-money-or-is-it-the-other-way-around/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Thu, 27 Oct 2022 13:26:46 +0000",
  "category": "Economics",
  "guid": "https://statmodeling.stat.columbia.edu/?p=47955",
  "description": "A correspondent who might want to remain anonymous (if not, he can reply in comments) writes: You really do need to have the courage of my convictions and you might make some profit on the way. I am writing about &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/27/you-can-read-for-free-but-comments-cost-money-or-is-it-the-other-way-around/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>A correspondent who might want to remain anonymous (if not, he can reply in comments) writes:</p>\n<blockquote><p>You really do need to have the courage of my convictions and you might make some profit on the way.  I am writing about the latest business model whereby one not only has to subscribe, i.e., pay for what was once free, but that only gets one in the door and not into the inner sanctums.  The NYT has features that once were available&#8212;in the distant past of a few months ago&#8212;as part of the user&#8217;s subscription but now require an additional ponying up.</p>\n<p>Consequently, you ought to do the same with your blog and offer some sort of tiered entitlement.  An ordinary contributor will be allowed to comment on Wansink or David Brooks but would need to pay a nominal/exorbitant fee to post anything about novelists or the Hoover Institution; in between might be Harvard or the misuse of priors.  Perhaps I have the hierarchy upside down, but you get the idea.</p></blockquote>\n<p>If scientific citations are worth $100,000 <a href=\"https://statmodeling.stat.columbia.edu/2021/09/21/more-on-that-claim-that-scientific-citations-are-worth-100000-each/\">each</a>, how much should I be charging for blog comments?  Or how much should I be paying for them?  It&#8217;s never clear which direction the payment should be going.</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/27/you-can-read-for-free-but-comments-cost-money-or-is-it-the-other-way-around/feed/",
  "slash:comments": 16
}