{
  "title": "Data Science Book Review: Superforecasting",
  "link": "http://www.dataminingblog.com/2437-2/",
  "pubDate": "Sun, 18 Jun 2017 20:00:58 +0000",
  "dc:creator": "Sandro Saitta",
  "category": "data mining",
  "guid": "http://www.dataminingblog.com/?p=2437",
  "description": "Superforecasting &#8211; by Tetlock and Gartner &#8211; explains the huge study performed by Tetlock about the ability of people to predict future events (mainly geo-political). The closed questions (i.e. choose between yes/no) are far from real numbers you will predict in business forecasting. Tetlock discusses skills that have been identified as driving accurate forecasts. The [&#8230;]",
  "content:encoded": "<p><img class=\"alignleft size-medium wp-image-2438\" src=\"http://www.dataminingblog.com/wp-content/uploads/Superforecasting-1-197x300.jpg\" alt=\"\" width=\"197\" height=\"300\" srcset=\"http://www.dataminingblog.com/wp-content/uploads/Superforecasting-1-197x300.jpg 197w, http://www.dataminingblog.com/wp-content/uploads/Superforecasting-1.jpg 400w\" sizes=\"(max-width: 197px) 100vw, 197px\" />Superforecasting &#8211; by Tetlock and Gartner &#8211; explains the huge study performed by Tetlock about the ability of people to predict future events (mainly geo-political). The closed questions (i.e. choose between yes/no) are far from real numbers you will predict in business forecasting. Tetlock discusses skills that have been identified as driving accurate forecasts. The point of the authors is that forecasting is a skill which can be improved. Superforecasters are accurate thanks to various good practices: they split the problem, update their forecast frequently, are objective, learn from their past errors, etc.</p>\n<p>To be fair, the book title should be &#8220;Superforecasters&#8221;. Indeed, the book is about these common people that have the ability to forecast more accurately than the rest of the crowd, and even experts. This also means that the book is not about forecasting. It doesn&#8217;t cover any topic related to forecasting, in the sense of time series analysis. (ESM, ARIMA, etc.) nor business forecasting (forecast horizon, update frequency, etc.)</p>\n<p>Tetlock and Gardner cover a wide range of topics in their book. They discuss the imprecision in language when discussing forecasts, which make them ambiguous to verify. Even when using precise numbers, forecasts are often misinterpreted. An excellent example is the &#8220;70% chance of rain tomorrow&#8221;. When it is not raining the day after, people believe the forecast was wrong. Such conclusions are not valid when looking at only one event.</p>\n<p>I wasn&#8217;t a big fan of Chapter 10 which was too historical. Beside this chapter, the book is a real pleasure to read. In conclusions, Tetlock and Gartner book is an excellent summary of Tetlock&#8217;s comprehensive research on the people ability to forecast. Not related to business forecasting, the book explains the skills you need to have to correctly answer geo-political questions. Superforecasting is a must have to understand psychological aspects behind (good) decision making and issues related to sharing and understanding forecasts.</p>\n<p>&nbsp;</p>\n<p><a class=\"a2a_dd addtoany_share_save addtoany_share\" href=\"https://www.addtoany.com/share#url=http%3A%2F%2Fwww.dataminingblog.com%2F2437-2%2F&title=Data%20Science%20Book%20Review%3A%20Superforecasting\" data-a2a-url=\"http://www.dataminingblog.com/2437-2/\" data-a2a-title=\"Data Science Book Review: Superforecasting\"><img src=\"https://static.addtoany.com/buttons/share_save_171_16.png\" alt=\"Share\"></a></p>"
}