{
  "title": "Web Scraping 201: finding the API",
  "link": "",
  "published": "2015-02-15T00:00:00-08:00",
  "updated": "2022-11-03T04:16:07-07:00",
  "author": {
    "name": "Greg Reda"
  },
  "id": "tag:www.gregreda.com,2015-02-15:/2015/02/15/web-scraping-finding-the-api/",
  "summary": "<p><em>This is part of a series of posts I have written about web scraping with Python.</em></p>\n<ol>\n<li><a href=\"http://www.gregreda.com/2013/03/03/web-scraping-101-with-python/\">Web Scraping 101 with Python</a>, which covers the basics of using Python for web scraping.</li>\n<li><a href=\"http://www.gregreda.com/2015/02/15/web-scraping-finding-the-api/\">Web Scraping 201: Finding the API</a>, which covers when sites load data client-side with Javascript.</li>\n<li><a href=\"http://www.gregreda.com/2016/10/16/asynchronous-scraping-with-python/\">Asynchronous Scraping with Python …</a></li></ol>",
  "content": "<p><em>This is part of a series of posts I have written about web scraping with Python.</em></p>\n<ol>\n<li><a href=\"http://www.gregreda.com/2013/03/03/web-scraping-101-with-python/\">Web Scraping 101 with Python</a>, which covers the basics of using Python for web scraping.</li>\n<li><a href=\"http://www.gregreda.com/2015/02/15/web-scraping-finding-the-api/\">Web Scraping 201: Finding the API</a>, which covers when sites load data client-side with Javascript.</li>\n<li><a href=\"http://www.gregreda.com/2016/10/16/asynchronous-scraping-with-python/\">Asynchronous Scraping with Python</a>, showing how to use multithreading to speed things up.</li>\n<li><a href=\"http://www.gregreda.com/2020/11/17/scraping-pages-behind-login-forms/\">Scraping Pages Behind Login Forms</a>, which shows how to log into sites using Python.</li>\n</ol>\n<hr>\n\n<p><strong>Update</strong>: Sorry folks, it looks like the NBA doesn't make shot log data accessible anymore. The same principles of this post still apply, but the particular example used is no longer functional. I do not intend to rewrite this post.</p>\n<hr>\n\n<p>Previously, I explained <a href=\"http://www.gregreda.com/2013/03/03/web-scraping-101-with-python/\">how to scrape a page</a> where the data is rendered <em>server-side</em>. However, the increasing popularity of Javascript frameworks such as <a href=\"https://angularjs.org\">AngularJS</a> coupled with <a href=\"http://en.wikipedia.org/wiki/Representational_state_transfer#Applied_to_web_services\">RESTful APIs</a> means that fewer sites are generated server-side and are instead being rendered <em>client-side</em>.</p>\n<p>In this post, I’ll give a brief overview of the differences between the two and show how to find the underlying API, allowing you to get the data you’re looking for.</p>\n<h2>Server-side vs client-side</h2>\n<p>Imagine we have a database of sports statistics and would like to build a web application on top of it (e.g. something like <a href=\"http://www.basketball-reference.com/\">Basketball Reference</a>).</p>\n<p>If we build our web app using a server-side framework like <a href=\"https://www.djangoproject.com/\">Django</a> [1], something akin to the following happens each time a user visits a page.</p>\n<ol>\n<li>User’s browser sends a request to the server hosting our application.</li>\n<li>Our server processes the request, checking to make sure the URL requested exists (amongst other things).</li>\n<li>If the requested URL does not exist, send an error back to the user’s browser and direct them to a <a href=\"http://en.wikipedia.org/wiki/HTTP_404#Custom_error_pages\">404 page</a>.</li>\n<li>If the requested URL does exist, execute some code <em>on the server</em> which gets data from our database. Let’s say the user wants to see <a href=\"http://www.basketball-reference.com/players/w/walljo01/gamelog/2015/\">John Wall’s game-by-game stats</a> for the 2014-15 NBA season. In this case, our Django/Python code queries the database and receives the data.</li>\n<li>Our Django/Python code injects the data into our application’s <a href=\"http://en.wikipedia.org/wiki/Web_template_system\">templates</a> to complete the HTML for the page.</li>\n<li>Finally, the server sends the HTML to the user’s browser (a <em>response</em> to their <em>request</em>) and the page is displayed.</li>\n</ol>\n<p>To illustrate the last step, go to <a href=\"http://www.basketball-reference.com/players/w/walljo01/gamelog/2015/\">John Wall’s game log</a> and <a href=\"view-source:http://www.basketball-reference.com/players/w/walljo01/gamelog/2015/\">view the page source</a>. Ctrl+f or Cmd+f and search for “2014-10-29”. This is the first row of the game-by-game stats table. We know the page was created server-side because the data is present in the page source.</p>\n<p>However, if the web application is built with a client-side framework like Angular, the process is slightly different. In this case, the server still sends the static content (the HTML, CSS, and Javascript), but the HTML is only a template - it doesn’t hold any data. Separately, the Javascript in the server response fetches the data from an API and uses it to create the page <em>client-side</em>.</p>\n<p>To illustrate, view the source of <a href=\"http://stats.nba.com/player/#!/202322/tracking/shotslogs/\">John Wall’s shot log</a> page on NBA.com - there’s no data to scrape! <a href=\"view-source:http://stats.nba.com/player/#!/202322/tracking/shotslogs/\">See for yourself</a>. Ctrl+f or Cmd+f for “Was @“. Despite there being many instances of it in the shot log table, none found in the page source.</p>\n<p>If you’re thinking “Oh crap, I can’t scrape this data,” well, you’re in luck! Applications using an API are often <em>easier</em> to scrape - you just need to know how to find the API. Which means I should probably tell you how to do that.</p>\n<h2>Finding the API</h2>\n<p>With a client-side app, your browser is doing much of the work. And because your browser is what’s rendering the HTML, we can use it to see where the data is coming from using its built-in developer tools.</p>\n<p>To illustrate, I’ll be using Chrome, but Firefox should be more or less the same (Internet Explorer users … you should switch to Chrome or Firefox and not look back).</p>\n<p>To open Chrome’s Developer Tools, go to View -&gt; Developer -&gt; Developer Tools. In Firefox, it’s Tools -&gt; Web Developer -&gt; Toggle Tools. We’ll be using the Network tab, so click on that one. It should be empty.</p>\n<p>Now, go to the page that has your data. In this case, it’s <a href=\"http://stats.nba.com/player/#!/202322/tracking/shotslogs/\">John Wall’s shot logs</a>. If you’re already on the page, hit refresh. Your Network tab should look similar to this:</p>\n<p><img alt=\"network tab example\" src=\"/images/scraping-network-tab.png\"></p>\n<p>Next, click on the XHR filter. XHR is short for <a href=\"http://en.wikipedia.org/wiki/XMLHttpRequest\">XMLHttpRequest</a> - this is the type of request used to fetch XML or JSON data. You should see a couple entries in this table (screenshot below). One of them is the API request that returns the data you’re looking for (in this case, John Wall’s shots).</p>\n<p><img alt=\"XHR requests example\" src=\"/images/scraping-xhr-tab.png\"></p>\n<p>At this point, you’ll need to explore a bit to determine which  request is the one you want. For our example, the one starting with “playerdashptshotlog” sounds promising. Let’s click on it and view it in the Preview tab. Things should now look like this:</p>\n<p><img alt=\"API response preview\" src=\"/images/scraping-api-preview.png\"></p>\n<p>Bingo! That’s the API endpoint. We can use the Preview tab to explore the response.</p>\n<p><img alt=\"API results preview\" src=\"/images/scraping-api-results-preview.png\"></p>\n<p>You should see a couple of objects:</p>\n<ol>\n<li>The resource name - <em>playerdashptshotlog</em>.</li>\n<li>The parameters (you might need to expand the resource section). These are the request parameters that were passed to the API. You can think of them like the <code>WHERE</code> clause of a SQL query. This request has parameters of <code>Season=2014-15</code> and <code>PlayerID=202322</code> (amongst others). Change the parameters in the URL and you’ll get different data (more on that in a bit).</li>\n<li>The result sets. This is self-explanatory.</li>\n<li>Within the result sets, you’ll find the headers and row set. Each object in the row set is essentially the result of a database query, while the headers tell you the column order. We can see that the first item in each row corresponds to the Game_ID, while the second is the Matchup.</li>\n</ol>\n<p>Now, go to the Headers tab, grab the request URL, and open it in a new browser tab, we’ll see the data we’re looking for (example below). Note that I'm using <a href=\"https://chrome.google.com/webstore/detail/jsonview/chklaanhfefbnpoihckbnefhakgolnmc?hl=en\">JSONView</a>, which nicely formats JSON in your browser.</p>\n<p><img alt=\"API response\" src=\"/images/scraping-api-response.png\"></p>\n<p>To grab this data, we can use something like Python’s <a href=\"http://docs.python-requests.org/en/latest/\">requests</a>. Here’s an example:</p>\n<div class=\"highlight\"><pre><span></span><code><span class=\"kn\">import</span> <span class=\"nn\">requests</span>\n\n<span class=\"n\">shots_url</span> <span class=\"o\">=</span> <span class=\"s1\">&#39;http://stats.nba.com/stats/playerdashptshotlog?&#39;</span><span class=\"o\">+</span> \\\n    <span class=\"s1\">&#39;DateFrom=&amp;DateTo=&amp;GameSegment=&amp;LastNGames=0&amp;LeagueID=00&amp;&#39;</span> <span class=\"o\">+</span> \\\n    <span class=\"s1\">&#39;Location=&amp;Month=0&amp;OpponentTeamID=0&amp;Outcome=&amp;Period=0&amp;&#39;</span> <span class=\"o\">+</span> \\\n    <span class=\"s1\">&#39;PlayerID=202322&amp;Season=2014-15&amp;SeasonSegment=&amp;&#39;</span> <span class=\"o\">+</span> \\\n    <span class=\"s1\">&#39;SeasonType=Regular+Season&amp;TeamID=0&amp;VsConference=&amp;VsDivision=&#39;</span>\n\n<span class=\"c1\"># request the URL and parse the JSON</span>\n<span class=\"n\">response</span> <span class=\"o\">=</span> <span class=\"n\">requests</span><span class=\"o\">.</span><span class=\"n\">get</span><span class=\"p\">(</span><span class=\"n\">shots_url</span><span class=\"p\">)</span>\n<span class=\"n\">response</span><span class=\"o\">.</span><span class=\"n\">raise_for_status</span><span class=\"p\">()</span> <span class=\"c1\"># raise exception if invalid response</span>\n<span class=\"n\">shots</span> <span class=\"o\">=</span> <span class=\"n\">response</span><span class=\"o\">.</span><span class=\"n\">json</span><span class=\"p\">()[</span><span class=\"s1\">&#39;resultSets&#39;</span><span class=\"p\">][</span><span class=\"mi\">0</span><span class=\"p\">][</span><span class=\"s1\">&#39;rowSet&#39;</span><span class=\"p\">]</span>\n\n<span class=\"c1\"># do whatever we want with the shots data</span>\n<span class=\"n\">do_things</span><span class=\"p\">(</span><span class=\"n\">shots</span><span class=\"p\">)</span>\n</code></pre></div>\n\n<p>That’s it. Now you have the data and can get to work.</p>\n<p>Note that passing different parameter values to the API yields different results. For instance, change the Season parameter to 2013-14 - now you have John Wall’s shots for the 2013-14 season. Change the PlayerID to 201935 - now you have James Harden’s shots.</p>\n<p>Additionally, different APIs return different types of data. Some might send XML; others, JSON. Some might store the results in an array of arrays; others, an array of maps or dictionaries. Some might not return the column headers at all. Things are vary between sites.</p>\n<p>Had a situation where you haven't been able to find the data you're looking for in the page source? Well, now you know how to find it.</p>\n<p><em>Was there something I missed? Have questions? <a href=\"https://twitter.com/gjreda\">Let me know</a>.</em></p>\n<hr class=“small”>\n<p>[1] Really this can be any server-side framework - Ruby on Rails, PHP’s Drupal or CodeIgniter, etc.</p>",
  "category": [
    "",
    "",
    "",
    "",
    ""
  ]
}