{
  "title": "S1E12 - US Navy EOD Officer to Gold Medal Paralympian with Brad Snyder",
  "guid": "https://pinecast.com/guid/8e785e62-3449-49e9-9802-4f3e98e9065a",
  "pubDate": "Tue, 25 Aug 2020 06:30:01 -0000",
  "itunes:duration": "00:58:39",
  "description": "<p>This week marks one year out from the 2021 Paralympic Games in Tokyo, and Laura is deeply honored to welcome Gold Medal Paralympian, Brad Snyder, to the podcast today. A highly experienced competitive swimmer, Brad graduated from the US Naval Academy and was deployed to Iraq and later to Afghanistan as an Explosive Ordnance Disposal (EOD) Officer. After six months in Afghanistan, Brad sustained complete vision loss as a result of the explosion of an improvised explosive device (IED).  What’s incredible about Brad is not what happened to him that fateful day, but as you will hear, how he responded to it.</p>\n<p>Brad begins by detailing his start in swimming, the impact that becoming the swim team captain in college had upon him, and how he found himself in the role of an EOD Officer. \nBrad then recounts the stories of his deployments, including the day of his injury, the effects of losing his sight, and his eventual return to swimming and rebuilding his identity. He and Laura discuss the power of celebrating the process as well as the outcomes in athletics, and Brad shares his Paralympic experiences, the reasons for writing his memoir, what he is up to these days, and just how the pandemic shutdown has affected him and his training. Brad concludes by recommending Ryan Holiday’s The Obstacle is the Way, a book for which he has the greatest respect. As Laura notes, Paralympians ‘have a unique strength of character that combines mental toughness, physical ability, and outstanding agility’ whose performances ‘often redefine the boundaries of possibility’. Brad Snyder embodies all of these qualities and more, as you will find out in this inspired and inspiring episode today.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Brad’s start in swimming</li>\n<li>The impact of becoming his team’s leader</li>\n<li>His road to becoming an Explosive Ordnance Disposal Officer and his experiences in that role</li>\n<li>Brad’s deployments</li>\n<li>The day of his injury</li>\n<li>Existential depression vs. momentary frustration</li>\n<li>Brad’s return to the pool</li>\n<li>Losing his ability to serve and its impact on his sense of identity</li>\n<li>Rebuilding his identity</li>\n<li>Process and outcomes</li>\n<li>Brad’s Paralympic experiences and how they compare with each other</li>\n<li>His memoir Fire in My Eyes and his reasons for writing it</li>\n<li>What Brad is up to these days</li>\n<li>How the COVID-19 shutdown has affected him</li>\n<li>Ryan Holiday’s The Obstacle is the Way</li>\n</ul>\n<p>Quotes:</p>\n<p>“We’ve been water people my whole life.”</p>\n<p>“It was so humbling to go to the pool for the first time and watch what competitive swimming was all about.”</p>\n<p>“My bailiwick is leadership.”</p>\n<p>“In the modern era, what we do predominantly is the mitigation of explosive hazards in support of military operations worldwide.”</p>\n<p>“They were able to save my face, but they weren’t able to save my eyes, unfortunately…the good news is I walked away with my life.”</p>\n<p>“I’m never going to be who I was, and that shouldn’t prevent me from being who I am.”</p>\n<p>“So much of our frustration in our daily lives comes from a mismatch of expectation.”</p>\n<p>“It felt nice to go back to doing something I was good at.”</p>\n<p>“Statistically, I actually think my blind times may be as or faster than my able-bodied times.”</p>\n<p>“I felt like I belonged…I felt fulfilled.”</p>\n<p>“You have to be vulnerable. You have to learn how to make a mistake, but then vow not to do it again, and to learn something from it.”</p>\n<p>“I love how you just keep challenging yourself.”</p>\n<p>“We’re on the road to Tokyo full force.”</p>\n<p>Links:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a> \nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a>\nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a>\nConnect with Brad:\nWebsite:   <a href=\"https://www.bradsnyder.us/\" rel=\"nofollow\">https://www.bradsnyder.us/</a></p>\n<p>Instagram:   <a href=\"https://www.instagram.com/bradsnyderusa/\" rel=\"nofollow\">https://www.instagram.com/bradsnyderusa/</a></p>\n<p>Twitter:   <a href=\"https://twitter.com/BradSnyderUSA\" rel=\"nofollow\">https://twitter.com/BradSnyderUSA</a></p>\n<p>Brad’s book:<br>\n<a href=\"https://www.amazon.com/Fire-My-Eyes-Warrior-s-Battlefield/dp/0306825147/ref=sr_1_1?ie=UTF8&qid=1480371142&sr=8-1&keywords=fire+in+my+eyes\" rel=\"nofollow\">https://www.amazon.com/Fire-My-Eyes-Warrior-s-Battlefield/dp/0306825147/ref=sr_1_1?ie=UTF8&qid=1480371142&sr=8-1&keywords=fire+in+my+eyes</a></p>\n<p>Ryan Holiday’s The Obstacle is the Way: \n<a href=\"https://www.amazon.com/Obstacle-Way-Ancient-Adversity-Advantage/dp/1781251495/ref=sr_1_2?dchild=1&keywords=the+obstacle+is+the+way&qid=1598055918&sr=8-2\" rel=\"nofollow\">https://www.amazon.com/Obstacle-Way-Ancient-Adversity-Advantage/dp/1781251495/ref=sr_1_2?dchild=1&keywords=the+obstacle+is+the+way&qid=1598055918&sr=8-2</a></p>",
  "itunes:title": "US Navy EOD Officer to Gold Medal Paralympian with Brad Snyder",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 12
}