{
  "title": "Episode 129: &#8220;(I Can&#8217;t Get No) Satisfaction&#8221; by the Rolling Stones",
  "link": "https://500songs.com/podcast/episode-129-i-cant-get-no-satisfaction-by-the-rolling-stones/",
  "pubDate": "Fri, 30 Jul 2021 23:37:10 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=851",
  "description": "<p>Episode 129 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “(I Can't Get No) Satisfaction” by the Rolling Stones, and how they went from being a moderately successful beat group to being the only serious rivals to the Beatles. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have an eleven-minute bonus episode available, <a href=\"https://www.patreon.com/posts/54319071\">on \"I'll Never Find Another You\" by the Seekers</a>.</p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Resources</strong></p>\n<p>As usual I’ve created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-129-satisfaction/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.</p>\n<p>i used a lot of resources for this episode. Two resources that I’ve used for this and all future Stones episodes — <a style=\"font-size: revert;\" href=\"https://amzn.to/3oQAsFs\"><em>The Rolling Stones: All The Songs</em> by Phillipe Margotin and Jean-Michel Guesden</a> is an invaluable reference book, while <a style=\"font-size: revert;\" href=\"https://amzn.to/3p0VBwS\"><em>Old Gods Almost Dead </em>by Stephen Davis</a> is the least inaccurate biography. When in doubt, the version of the narrative I've chosen to use is the one from Davis' book.</p>\n<p>I’ve also used Andrew Loog Oldham’s autobiography <a href=\"https://amzn.to/3mpoukC\"><em>Stoned</em></a>, and Keith Richards’<a href=\"https://amzn.to/34iRBzO\"> <em>Life</em>,</a> though be warned that both casually use slurs.</p>\n<p><a href=\"https://amzn.to/2UYt95p\"><em>Sympathy for the Devil: The Birth of the Rolling Stones and the Death of Brian Jones</em> by Paul Trynka</a> is, as the title might suggest, essentially special pleading for Jones. It's as well-researched and well-written as a pro-Jones book can be, and is worth reading for balance, though I find it unconvincing.</p>\n<p><a href=\"https://www.nzentgraf.de/books/tcw/works1.htm\">This web page</a> seems to have the most accurate details of the precise dates of sessions and gigs.</p>\n<p>And <a href=\"https://amzn.to/3ms7Ssl\">this three-CD set</a> contains the A and B sides of all the Stones’ singles up to 1971, including every Stones track I excerpt in this episode.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>Today, we're going to look at one of the most important riffs in rock and roll history -- the record that turned the distorted guitar riff into the defining feature of the genre, even though the man who played that riff never liked it. We're going to look at a record that took the social protest of the folk-rock movement, aligned it with the misogyny its singer had found in many blues songs, and turned it into the most powerful expression of male adolescent frustration ever recorded to that point. We're going to look at \"Satisfaction\" by the Rolling Stones:</p>\n<p>[Excerpt: The Rolling Stones, \"Satisfaction\"]</p>\n<p>A note before we start this -- this episode deals with violence against women, and with rape. If you're likely to be upset hearing about those things, you might want to either skip this episode, or read the transcript on the website first. The relevant section comes right at the end of the episode, so you can also listen through to the point where I give another warning, without missing any of the rest of the episode.</p>\n<p>Another point I should make here -- most of the great sixties groups have very accurate biographies written about them. The Stones, even more than the Beatles, have kept a surprising amount of control over their public image, with the result that the only sources about them are either rather sanitised things made with their co-operation, or rather tabloidy things whose information mostly comes from people who are holding a grudge or have a particular agenda. I believe that everything in this episode is the most likely of the various competing narratives, but if you check out the books I used, which are listed on the blog post associated with this episode, you'll see that there are several different tellings of almost every bit of this story. So bear that in mind as you're listening. I've done my best. Anyway, on with the episode. </p>\n<p>When we left the Rolling Stones, they were at the very start of their recording career, having just released their first big hit single, a version of \"I Wanna Be Your Man\", which had been written for them by Lennon and McCartney. </p>\n<p>The day after they first appeared on Top of the Pops, they were back in the recording studio, but not to record for themselves. The five Stones, plus Ian Stewart, were being paid two pounds a head by their manager/producer Andrew Oldham to be someone else's backing group. Oldham was producing a version of \"To Know Him is to Love Him\", the first hit by his idol Phil Spector, for a new singer he was managing named Cleo Sylvester:</p>\n<p>[Excerpt: Cleo, \"To Know Him is to Love Him\"]</p>\n<p>In a further emulation of Spector, the B-side was a throwaway instrumental. Credited to \"the Andrew Oldham Orchestra\", and with Mike Leander supervising, the song's title, \"There Are But Five Rolling Stones\", gave away who the performers actually were:</p>\n<p>[Excerpt: The Andrew Oldham Orchestra, \"There Are But Five Rolling Stones\"]</p>\n<p>At this point, the Stones were still not writing their own material, but Oldham had already seen the writing on the wall -- there was going to be no place in the new world opened up by the Beatles for bands that couldn't generate their own hits, and he had already decided who was going to be doing that for his group. </p>\n<p>It would have been natural for him to turn to Brian Jones, still at this point the undisputed leader of the group, and someone who had a marvellous musical mind. But possibly in order to strengthen the group's identity as a group rather than a leader and his followers -- Oldham has made different statements about this at different points -- or possibly just because they were living in the same flat as him at the time, while Jones was living elsewhere, he decided that the Rolling Stones' equivalent of Lennon and McCartney was going to be Jagger and Richards.</p>\n<p>There are several inconsistencies in the stories of how Jagger and Richards started writing together -- and things like what the actual first song they wrote together was, or when they wrote it, will probably always be lost to the combination of self-aggrandisement and drug-fuelled memory loss that makes it difficult to say anything definitive about much of their career. But we do know that one of the earliest songs they wrote together was \"As Tears Go By\", a song that wasn't considered suitable for the group -- though they did later record a version of it -- and was given instead to Marianne Faithfull, a young singer with whom Jagger was about to enter into a relationship:</p>\n<p>[Excerpt: Marianne Faithfull, \"As Tears Go By\"]</p>\n<p>It's not entirely clear who wrote what on that song -- it's usually referred to as a Jagger/Richards collaboration, but it's credited to Jagger, Richards, and Oldham, and at least one source claims it was actually written by Jagger and the session guitarist Big Jim Sullivan -- and if so, this would be the first time of many that a song written by Jagger or Richards in collaboration with someone else would be credited to Jagger and Richards without any credit going to their co-writer.</p>\n<p>But the consensus story, as far as there is a consensus, seems to be that Oldham locked Jagger and Richards into a kitchen, and told them they weren't coming out until they had a song written. And it had to be a proper song, not a pastiche of something else, and it had to be the kind of song you could release as a single, not a blues song. After spending all night in the kitchen, Richards eventually got bored of being stuck in there, and started strumming his guitar and singing \"it is the evening of the day\", and the two of them quickly came up with the rest of the song.</p>\n<p>After \"As Tears Go By\", they wrote a lot of songs that they didn't feel were right for the group, but gave them away to other people, like Gene Pitney, who recorded \"That Girl Belongs to Yesterday\":</p>\n<p>[Excerpt: Gene Pitney, \"That Girl Belongs to Yesterday\"]</p>\n<p>Pitney, and his former record producer Phil Spector, had visited the Stones during the sessions for their first album, which started the day after that Cleo session, and had added a little piano and percussion to a blues jam called \"Little by Little\", which also featured Allan Clarke and Graham Nash of the Hollies on backing vocals. The songwriting on that track was credited to Spector and Nanker Phelge, a group pseudonym that was used for jam sessions and instrumentals. It was one of two Nanker Phelge songs on the album, and there was also an early Jagger and Richards song, \"Tell Me\", an unoriginal Merseybeat pastiche:</p>\n<p>[Excerpt: The Rolling Stones, \"Tell Me\"]</p>\n<p>But the bulk of the album was made up of cover versions of songs by Bo Diddley, Chuck Berry, Rufus Thomas, Marvin Gaye, and other Black American musicians.</p>\n<p>The album went to number one in the UK album charts, which is a much more impressive achievement than it might sound. At this point, albums sold primarily to adults with spending money, and the album charts changed very slowly. Between May 1963 and February 1968, the *only* artists to have number one albums in the UK were the Beatles, the Stones, Dylan, the Monkees, the cast of The Sound of Music, and Val Doonican. And between May 63 and April 65 it was *only* the Beatles and the Stones.</p>\n<p>But while they'd had a number one album, they'd still not had a number one single, or even a top ten one. \"I Wanna Be Your Man\" had been written for them and had hit number twelve, but they were still not writing songs that they thought were suited for release as singles, and they couldn't keep asking the Beatles to help them out, so while Jagger and Richards kept improving as songwriters, for their next single they chose a Buddy Holly B-side:</p>\n<p>[Excerpt: Buddy Holly, \"Not Fade Away\"]</p>\n<p>The group had latched on to the Bo Diddley rhythm in that song, along with its machismo -- many of the cover versions they chose in this period seem to have not just a sexual subtext but to be overtly bragging, and if Little Richard is to be believed on the subject, Holly's line \"My love is bigger than a Cadillac\" isn't that much of an exaggeration. It's often claimed that the Stones exaggerated and emphasised the Bo Diddley sound, and made their version more of an R&B number than Holly's, but if anything their version owes more to someone else. </p>\n<p>The Stones' first real UK tour had been on a bill with Mickie Most, Bo Diddley, Little Richard, and the Everly Brothers, and Keith Richards in particular had been amazed by the Everlys. He said later \"The best rhythm guitar playing I ever heard was from Don Everly. Nobody ever thinks about that, but their rhythm guitar playing is perfect\". Don Everly, of course, was himself very influenced by Bo Diddley, and learned to play in open-G tuning from Diddley -- and several years later, Keith Richards would make that tuning his own, after being inspired by Everly and Ry Cooder. </p>\n<p>The Stones' version of \"Not Fade Away\" owes at least as much to Don Everly's rhythm guitar style as to that of Holly or Diddley. Compare, say, the opening of \"Wake Up Little Suzie\":</p>\n<p>[Excerpt: The Everly Brothers, \"Wake Up Little Suzie\"]</p>\n<p>The rhythm guitar on the Stones version of \"Not Fade Away\" is definitely Keith Richards doing Don Everly doing Bo Diddley:</p>\n<p>[Excerpt: The Rolling Stones, \"Not Fade Away\"]</p>\n<p>That was recorded during the sessions for their first album, and was, depending on whose story you believe, another track that featured Phil Spector and Gene Pitney on percussion, recorded at the same session as \"Little by Little\", which became its B-side. Bill Wyman, who kept copious notes of the group's activities, has always said that the idea that it was recorded at that session was nonsense, and that it was recorded weeks later, and Oldham merely claimed Spector was on the record for publicity purposes. On the other hand, Gene Pitney had a very strong memory of being at that session.</p>\n<p>Spector had been in the country because the Ronettes had been touring the UK with the Stones as one of their support acts, along with the Swinging Blue Jeans and Marty Wilde, and Spector was worried that Ronnie might end up with one of the British musicians. He wasn't wrong to worry -- according to Ronnie's autobiography, there were several occasions when she came very close to sleeping with John Lennon, though they never ended up doing anything and remained just friends, while according to Keith Richards' autobiography he and Ronnie had a chaste affair on that tour which became less chaste when the Stones later hit America. But Spector had flown over to the UK to make sure that he remained in control of the young woman who he considered his property.</p>\n<p>Pitney, meanwhile, according to his recollection, turned up to the session at the request of Oldham, as the group were fighting in the studio and not getting the track recorded. Pitney arrived with cognac, telling the group that it was his birthday and that they all needed to get drunk with him. They did, they stopped fighting, and they recorded the track:</p>\n<p>[Excerpt: The Rolling Stones, \"Not Fade Away\"]</p>\n<p>\"Not Fade Away\" made number three on the UK charts, and also became the first Stones record to chart in the US at all, though it only scraped its way to number forty-eight, not any higher. But in itself that was a lot -- it meant that the Stones had a record doing well enough to justify them going to the US for their first American tour. </p>\n<p>But before that, they had to go through yet another UK tour -- though this isn't counted as an official tour in the listings of their tours, it's just a bunch of shows, in different places, that happened to be almost every night for a couple of months. By this time, the audience response was getting overwhelming, and shows often had to be cut short to keep the group safe. At one show, in Birkenhead, the show had to be stopped after the band played *three bars*, with the group running off stage after that as the audience invaded the stage.</p>\n<p>And then it was off to the US, where they were nowhere near as big, though while they were over there, \"Tell Me\" was also released as a single to tie in with the tour, and that did surprisingly well, making number twenty-four.</p>\n<p>The group's first experience of the US wasn't an entirely positive one -- there was a disastrous appearance on the Dean Martin Show on TV, with Martin mocking the group both before and after their performance, to the extent that Bob Dylan felt moved to write in the liner notes to his next album “Dean Martin should apologise t'the Rolling Stones”.</p>\n<p>But on the other hand, there were some good experiences. They got to see James Brown at the Apollo, and Jagger started taking notes -- though Richards also noted *what* Jagger was noting, saying \"James wanted to show off to these English folk. He’s got the Famous Flames, and he’s sending one out for a hamburger, he’s ordering another to polish his shoes and he’s humiliating his own band. To me, it was the Famous Flames, and James Brown happened to be the lead singer. But the way he lorded it over his minions, his minders and the actual band, to Mick was fascinating\"</p>\n<p>They also met up with Murray the K, the DJ who had started the career of the Ronettes among others. Murray had unilaterally declared himself \"the fifth Beatle\", and was making much of his supposed connections with British pop stars, most of whom either had no idea who he was or actively disliked him (Richards, when talking about him, would often replace the K with a four-letter word usually spelled with a \"c\"). The Stones didn't like him any more than any of the other groups did, but Murray played them a record he thought they'd be interested in -- \"It's All Over Now\" by the Valentinos, the song that Bobby Womack had written and which was on Sam Cooke's record label:</p>\n<p>[Excerpt: The Valentinos, \"It's All Over Now\"]</p>\n<p>They decided that they were going to record that, and handily Oldham had already arranged some studio time for them. As Giorgio Gomelsky would soon find with the Yardbirds, Oldham was convinced that British studios were simply unsuitable for recording loud blues-based rock and roll music, and Phil Spector had suggested to him that if the Stones loved Chess records so much, they might as well record at Chess studios. </p>\n<p>So while the group were in Chicago, they were booked in for a couple of days in the studio at Chess, where they were horrified to discover that their musical idol Muddy Waters was earning a little extra cash painting the studio ceiling and acting as a roadie, helping them in with their equipment. </p>\n<p>(It should be noted here that Marshall Chess, Leonard Chess' son who worked with the Stones in the seventies, has denied this happened. Keith Richards insists it did.)</p>\n<p>But after that shock, they found working at Chess a great experience. Not only did various of their musical idols, like Willie Dixon and Chuck Berry, as well as Waters, pop in to encourage them, and not only were they working with the same engineer who had recorded many of those people's records, but they were working in a recording studio with an actual multi-track system rather than a shoddy two-track tape recorder. From this point on, while they would still record in the UK on occasion, they increasingly chose to use American studios. </p>\n<p>The version of \"It's All Over Now\" they recorded there was released as their next single. It only made the top thirty in the US -- they had still not properly broken through there -- but it became their first British number one:</p>\n<p>[Excerpt: The Rolling Stones, \"It's All Over Now\"]</p>\n<p>Bobby Womack was furious that the Stones had recorded his song while his version was still new, but Sam Cooke talked him down, explaining that if Womack played his cards right he could have a lot of success through his connection with these British musicians. Once the first royalty cheques came in, Womack wasn't too upset any more.</p>\n<p>When they returned to the UK, they had another busy schedule of touring and recording -- and not all of it just for Rolling Stones work. There was, for example, an Andrew Oldham Orchestra session, featuring many people from the British session world who we've noted before -- Joe Moretti from Vince Taylor's band, John Paul Jones, Jimmy Page, Andy White, Mike Leander, and more. Mick Jagger added vocals to their version of \"I Get Around\":</p>\n<p>[Excerpt: The Andrew Oldham Orchestra, \"I Get Around\"]</p>\n<p>It's possible that Oldham had multiple motives for recording that -- Oldham was always a fan of Beach Boys style pop music more than he was of R&B, but he also was in the process of setting up his own publishing company, and knew that the Beach Boys' publishers didn't operate in the UK. In 1965, Oldham's company would become the Beach Boys' UK publishers, and he would get a chunk of every cover version of their songs, including his own.</p>\n<p>There were also a lot of demo sessions for Jagger/Richards songs intended for other artists, with Mick and Keith working with those same session musicians -- like this song that they wrote for the comedian Jimmy Tarbuck, demoed by Jagger and Richards with Moretti, Page, Jones, John McLaughlin, Big Jim Sullivan, and Andy White:</p>\n<p>[Excerpt: Mick Jagger and Keith Richards, \"We're Wastin' Time\"]</p>\n<p>But of course there were also sessions for Rolling Stones records, like their next UK number one single, \"Little Red Rooster\":</p>\n<p>[Excerpt: The Rolling Stones, \"Little Red Rooster\"]</p>\n<p>\"Little Red Rooster\" is a song that is credited to Willie Dixon, but which actually combines several elements from earlier blues songs, including a riff inspired by the one from Son House's \"Death Letter Blues\":</p>\n<p>[Excerpt: Son House, \"Death Letter Blues\"]</p>\n<p>A melody line and some lines of lyric from Memphis Minnie's \"If You See My Rooster\":</p>\n<p>[Excerpt: Memphis Minnie, \"If You See My Rooster\"]</p>\n<p>And some lines from Charley Patton's \"Banty Rooster Blues\":</p>\n<p>[Excerpt: Charley Patton, \"Banty Rooster Blues\"]</p>\n<p>Dixon's resulting song had been recorded by Howlin' Wolf in 1961:</p>\n<p>[Excerpt: Howlin' Wolf, \"Little Red Rooster\"]</p>\n<p>That hadn't been a hit, but Sam Cooke had recorded a cover version, in a very different style, that made the US top twenty and proved the song had chart potential:</p>\n<p>[Excerpt: Sam Cooke, \"Little Red Rooster\"]</p>\n<p>The Rolling Stones version followed Howlin' Wolf's version very closely, except that Jagger states that he *is* a cock -- I'm sorry, a rooster -- rather than that he merely has one. And this would normally be something that would please Brian Jones immensely -- that the group he had formed to promote Delta and Chicago blues had managed to get a song like that to number one in the UK charts, especially as it was dominated by his slide playing.</p>\n<p>But in fact the record just symbolised the growing estrangement between Jones and the rest of his band. When he turned up at the session to record \"Little Red Rooster\", he was dismayed to find out that the rest of the group had deliberately told him the wrong date. They'd recorded the track the day before, without him, and just left a note from Jagger to tell him where to put his slide fills.</p>\n<p>They spent the next few months ping-ponging between the UK and the US. In late 1964 they made another US tour, during which at one point Brian Jones collapsed with what has been variously reported as stress and alcohol poisoning, and had to miss several shows, leaving the group to carry on without him. There was much discussion at this point of just kicking him out of the band, but they decided against it -- he was still perceived as the group's leader and most popular member.</p>\n<p>They also appeared on the TAMI show, which we've mentioned before, and which we'll look at in more detail when we next look at James Brown, but which is notable here for two things. The first is that they once again saw how good James Brown was, and at this point Jagger decided that he was going to do his best to emulate Brown's performance -- to the extent that he asked a choreographer to figure out what Brown was doing and teach it to him, but the choreographer told Jagger that Brown moved too fast to figure out all his steps.</p>\n<p>The other is that the musical director for the TAMI Show was Jack Nitzsche, and this would be the start of a professional relationship that would last for many years. We've seen Nitzsche before in various roles -- he was the co-writer of \"Needles and Pins\", and he was also the arranger on almost all of Phil Spector's hits. He was so important to Spector's sound that Keith Richards has said “Jack was the Genius, not Phil. Rather, Phil took on Jack’s eccentric persona and sucked his insides out.”</p>\n<p>Nitzsche guested on piano when the Stones went into the studio in LA to record a chunk of their next album, including the ballad \"Heart of Stone\", which would become a single in the US. From that point on, whenever the Stones recorded in LA, Nitzsche would be there, adding keyboards and percussion and acting as an uncredited co-producer and arranger. He was apparently unpaid for this work, which he did just because he enjoyed being around the band.</p>\n<p>Nitzsche would also play on the group's next UK single, recorded a couple of months later. This would be their third UK number one, and the first one credited to Jagger and Richards as songwriters, though the credit is a rather misleading one in this case, as the chorus is taken directly from a gospel song by Pops Staples, recorded by the Staple Singers:</p>\n<p>[Excerpt: The Staple Singers, \"This May Be The Last Time\"]</p>\n<p>Jagger and Richards took that chorus and reworked it into a snarling song whose lyrics were based around Jagger's then favourite theme -- how annoying it is when women want to do things other than whatever their man wants them to do:</p>\n<p>[Excerpt: The Rolling Stones, \"The Last Time\"]</p>\n<p>There is a deep, deep misogyny in the Stones' lyrics in the mid sixties, partly inspired by the personas taken on by some blues men (though there are very few blues singers who stuck so unrelentingly to a single theme), and partly inspired by Jagger's own relationship with Chrissie Shrimpton, who he regarded as his inferior, even though she was his superior in terms of the British class system.</p>\n<p>That's even more noticeable on \"Play With Fire\", the B-side to \"The Last Time\". \"The Last Time\" had been recorded in such a long session that Jones, Watts, and Wyman went off to bed, exhausted. But Jagger and Richards wanted to record a demo of another song, which definitely seems to have been inspired by Shrimpton, so they got Jack Nitzsche to play harpsichord and Phil Spector to play (depending on which source you believe) either a bass or a detuned electric guitar:</p>\n<p>[Excerpt: The Rolling Stones, \"Play With Fire\"]</p>\n<p>The demo was considered good enough to release, and put out as the B-side without any contribution from the other three Stones.</p>\n<p>Other songs Chrissie Shrimpton would inspire over the next couple of years would include \"Under My Thumb\", \"19th Nervous Breakdown\", and \"Stupid Girl\". It's safe to say that Mick Jagger wasn't going to win any boyfriend of the year awards.</p>\n<p>\"The Last Time\" was a big hit, but the follow-up was the song that turned the Stones from being one of several British bands who were very successful to being the only real challengers to the Beatles for commercial success. And it was a song whose main riff came to Keith Richards in a dream:</p>\n<p>[Excerpt: The Rolling Stones, \"(I Can't Get No) Satisfaction)\"]</p>\n<p>Richards apparently had a tape recorder by the side of his bed, and when the riff came to him he woke up enough to quickly record it before falling back to sleep with the tape running. When he woke up, he'd forgotten the riff, but found it at the beginning of a recording that was otherwise just snoring.</p>\n<p>For a while Richards was worried he'd ripped the riff off from something else, and he's later said that he thinks that it was inspired by \"Dancing in the Street\". In fact, it's much closer to the horn line from another Vandellas record, \"Nowhere to Run\", which also has a similar stomping rhythm:</p>\n<p>[Excerpt: Martha and the Vandellas, \"Nowhere to Run\"]</p>\n<p>You can see how similar the two songs are by overlaying the riff from “Satisfaction” on the chorus to “Nowhere to Run”:</p>\n<p>[Excerpt “Nowhere to Run”/”Satisfaction”]</p>\n<p>\"Nowhere to Run\" also has a similar breakdown. Compare the Vandellas:</p>\n<p>[Excerpt: Martha and the Vandellas, \"Nowhere to Run\"]</p>\n<p>to the Stones:</p>\n<p>[Excerpt: The Rolling Stones, \"(I Can't Get No) Satisfaction\"]</p>\n<p>So it's fairly clear where the song's inspiration came from, but it's also clear that unlike a song like \"The Last Time\" this *was* just inspiration, rather than plagiarism. </p>\n<p>The recorded version of \"Satisfaction\" was never one that its main composer was happy with. The group, apart from Brian Jones, who may have added a harmonica part that was later wiped, depending on what sources you read, but is otherwise absent from the track, recorded the basic track at Chess studios, and at this point it was mostly acoustic. Richards thought it had come out sounding too folk-rock, and didn't work at all.</p>\n<p>At this point Richards was still thinking of the track as a demo -- though by this point he was already aware of Andrew Oldham's tendency to take things that Richards thought were demos and release them. When Richards had come up with the riff, he had imagined it as a horn line, something like the version that Otis Redding eventually recorded:</p>\n<p>[Excerpt: Otis Redding, \"(I Can't Get No) Satisfaction\"]</p>\n<p>So when they went into the studio in LA with Jack Nitzsche to work on some tracks there including some more work on the demo for “Satisfaction”, as well as Nitzsche adding some piano, Richards also wanted to do something to sketch out what the horn part would be. He tried playing it on his guitar, and it didn't sound right, and so Ian Stewart had an idea, went to a music shop, and got one of the first ever fuzz pedals, to see if Richards' guitar could sound like a horn.</p>\n<p>Now, people have, over the years, said that \"Satisfaction\" was the first record ever to use a fuzz tone. This is nonsense. We saw *way* back in the episode on “Rocket '88” a use of a damaged amp as an inspired accident, getting a fuzzy tone, though nobody picked up on that and it was just a one-off thing.</p>\n<p>Paul Burlison, the guitarist with the Rock 'n' Roll Trio, had a similar accident a few years later, as we also saw, and went with it, deliberately loosening tubes in his amp to get the sound audible on their version of \"Train Kept A-Rollin'\":</p>\n<p>[Excerpt: Johnny Burnette and the Rock 'n' Roll Trio, \"Train Kept A-Rollin'\"]</p>\n<p>A few years later, Grady Martin, the Nashville session player who was the other guitarist on that track, got a similar effect on his six-string bass solo on Marty Robbins' \"Don't Worry\", possibly partly inspired by Burlison's sound:</p>\n<p>[Excerpt: Marty Robbins, \"Don't Worry\"]</p>\n<p>That tends to be considered the real birth of fuzz, because that time it was picked up by the whole industry. Martin recorded an instrumental showing off the technique:</p>\n<p>[Excerpt: Grady Martin, \"The Fuzz\"]</p>\n<p>And more or less simultaneously, Wrecking Crew guitarist Al Casey used an early fuzz tone on a country record by Sanford Clark:</p>\n<p>[Excerpt: Sanford Clark, \"Go On Home\"]</p>\n<p>And the pedal steel player Red Rhodes had invented his own fuzz box, which he gave to another Wrecking Crew player, Billy Strange, who used it on records like Ann-Margret's \"I Just Don't Understand\":</p>\n<p>[Excerpt: Ann-Margret, \"I Just Don't Understand\"]</p>\n<p>All those last four tracks, and many more, were from 1960 or 1961. So far from being something unprecedented in recording history, as all too many rock histories will tell you, fuzz guitar was somewhat passe by 1965 -- it had been the big thing on records made by the Nashville A-Team and the Wrecking Crew four or five years earlier, and everyone had moved on to the next gimmick long ago.</p>\n<p>But it was good enough to use to impersonate a horn to sketch out a line for a demo. Except, of course, that while Jagger and Richards disliked the track as recorded, the other members of the band, and Ian Stewart (who still had a vote even though he was no longer a full member) and Andrew Oldham all thought it was a hit single as it was. They overruled Jagger and Richards and released it complete with fuzz guitar riff, which became one of the most well-known examples of the sound in rock history. To this day, though, when Richards plays the song live, he plays it without the fuzztone effect.</p>\n<p>Lyrically, the song sees Mick Jagger reaching for the influence of Bob Dylan and trying to write a piece of social commentary. The title line seems, appropriately for a song partly recorded at Chess studios, to have come from a line in a Chuck Berry record, \"Thirty Days\":</p>\n<p>[Excerpt: Chuck Berry, \"Thirty Days\"]</p>\n<p>But the sentiment also owes more than a little to another record by a Chess star, one recorded so early that it was originally released when Chess was still called Aristocrat Records -- Muddy Waters'  \"I Can't Be Satisfied\":</p>\n<p>[Excerpt: Muddy Waters, \"I Can't Be Satisfied\"]</p>\n<p>“Satisfaction” is the ultimate exercise in adolescent male frustration. I once read something, and I can't for the life of me remember where or who the author was, that struck me as the most insightful critique of the sixties British blues bands I've ever heard. That person said that by taking the blues out of the context in which the music had been created, they fundamentally changed the meaning of it -- that when Bo Diddley sang \"I'm a Man\", the subtext was \"so don't call me 'boy', cracker\". Meanwhile, when some British white teenagers from Essex sang the same words, in complete ignorance of the world in which Diddley lived, what they were singing was \"I'm a man now, mummy, so you can't make me tidy my room if I don't want to\".</p>\n<p>But the thing is, there are a lot of teenagers out there who don't want to tidy their rooms, and that kind of message does resonate. And here, Jagger is expressing the kind of aggressive sulk that pretty much every teenager, especially every frustrated male teenager will relate to. The protagonist is dissatisfied with everything in his life, so criticism of the vapidity of advertising is mixed in with sexual frustration because women won't sleep with the protagonist when they're menstruating:</p>\n<p>[Excerpt: The Rolling Stones, \"(I Can't Get No) Satisfaction\"]</p>\n<p>It is the most adolescent lyric imaginable, but pop music is an adolescent medium.</p>\n<p>The song went to number one in the UK, and also became the group's first American number one. But Brian Jones resented it, so much so that when they performed the song live, he'd often start playing “I'm Popeye the Sailor Man”. This was partly because it wasn't the blues he loved, but also because it was the first Stones single he wasn't on (again, at least according to most sources. Some say he played acoustic rhythm guitar, but most say he's not on it and that Richards plays all the guitar parts). And to explain why, I have to get into the unpleasant details I talked about at the start. If you're likely to be upset by discussion of rape or domestic violence, stop the episode now.</p>\n<p>Now, there are a number of different versions of this story. This is the one that seems most plausible to me, based on what else I know about the Stones, and the different accounts, but some of the details might be wrong, so I don't want anyone to think that I'm saying that this is absolutely exactly what happened. But if it isn't, it's the *kind* of thing that happened many times, and something very like it definitely happened.</p>\n<p>You see, Brian Jones was a sadist, and not in a good way. There are people who engage in consensual BDSM, in which everyone involved is having a good time, and those people include some of my closest friends. This will never be a podcast that engages in kink-shaming of consensual kinks, and I want to make clear that what I have to say about Jones has nothing to do with that.</p>\n<p>Because Jones was not into consent. He was into physically injuring non-consenting young women, and he got his sexual kicks from things like beating them with chains. Again, if everyone is involved is consenting, this is perfectly fine, but Jones didn't care about anyone other than himself.</p>\n<p>At a hotel in Clearwater, Florida, on the sixth of May 1965, the same day that Jagger and Richards finished writing \"Satisfaction\", a girl that Bill Wyman had slept with the night before came to him in tears. She'd been with a friend the day before, and the friend had gone off with Jones while she'd gone off with Wyman. Jones had raped her friend, and had beaten her up -- he'd blackened both her eyes and done other damage.</p>\n<p>Jones had hurt this girl so badly that even the other Stones, who as we have seen were very far from winning any awards for being feminists of the year, were horrified. There was some discussion of calling the police on him, but eventually they decided to take matters into their own hands, or at least into one of their employees' hands. They got their roadie Mike Dorsey to teach him a lesson, though Oldham was insistent that Dorsey not mess up Jones' face. Dorsey dangled Jones by his collar and belt out of an upstairs window and told Jones that if he ever did anything like that again, he'd drop him. He also beat him up, cracking two of Jones' ribs.</p>\n<p>And so Jones was not in any state to play on the group's first US number one, or to play much at all at the session, because of the painkillers he was on for the cracked ribs. </p>\n<p>Jones would remain in the band for the next few years, but he had gone from being the group's leader to someone they disliked and were disgusted by. And as we'll see the next couple of times we look at the Stones, he would only get worse.</p>",
  "itunes:subtitle": "Episode 129 of A History of Rock Music in Five Hundred Songs looks at “(I Cant Get No) Satisfaction” by the Rolling Stones, and how they went from being a moderately successful beat group to being the only serious rivals to the Beatles. Click the full po",
  "itunes:keywords": "Allan Clarke,Andrew Loog Oldham,Andrew Oldham,Andy White,Big Jim Sullivan,Bill Wyman,Bob Dylan,Bobby Womack,Brian Jones,Charlie Watts,Chess Records,Chrissie Shrimpton,Dean Martin,Don Everly,Gene Pitney,Grady Martin,Graham Nash,Ian Stewart,Jack Nitzsche,James Brown,Jimmy Page,Jimmy Tarbuck,Joe Moretti,John McLaughlin,John Paul Jones,Keith Richards,Mariane Faithfull,Mick Jagger,Mike Leander,Muddy Waters,Phil Spector,Ronnie Spector,Sam Cooke,Staple Singers,The Rolling Stones,Willie Dixon",
  "itunes:episodeType": "full",
  "itunes:episode": 129,
  "content:encoded": "<p>Episode 129 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “(I Can't Get No) Satisfaction” by the Rolling Stones, and how they went from being a moderately successful beat group to being the only serious rivals to the Beatles. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have an eleven-minute bonus episode available, <a href=\"https://www.patreon.com/posts/54319071\">on \"I'll Never Find Another You\" by the Seekers</a>.</p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Resources</strong></p>\n<p>As usual I’ve created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-129-satisfaction/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.</p>\n<p>i used a lot of resources for this episode. Two resources that I’ve used for this and all future Stones episodes — <a style=\"font-size: revert;\" href=\"https://amzn.to/3oQAsFs\"><em>The Rolling Stones: All The Songs</em> by Phillipe Margotin and Jean-Michel Guesden</a> is an invaluable reference book, while <a style=\"font-size: revert;\" href=\"https://amzn.to/3p0VBwS\"><em>Old Gods Almost Dead </em>by Stephen Davis</a> is the least inaccurate biography. When in doubt, the version of the narrative I've chosen to use is the one from Davis' book.</p>\n<p>I’ve also used Andrew Loog Oldham’s autobiography <a href=\"https://amzn.to/3mpoukC\"><em>Stoned</em></a>, and Keith Richards’<a href=\"https://amzn.to/34iRBzO\"> <em>Life</em>,</a> though be warned that both casually use slurs.</p>\n<p><a href=\"https://amzn.to/2UYt95p\"><em>Sympathy for the Devil: The Birth of the Rolling Stones and the Death of Brian Jones</em> by Paul Trynka</a> is, as the title might suggest, essentially special pleading for Jones. It's as well-researched and well-written as a pro-Jones book can be, and is worth reading for balance, though I find it unconvincing.</p>\n<p><a href=\"https://www.nzentgraf.de/books/tcw/works1.htm\">This web page</a> seems to have the most accurate details of the precise dates of sessions and gigs.</p>\n<p>And <a href=\"https://amzn.to/3ms7Ssl\">this three-CD set</a> contains the A and B sides of all the Stones’ singles up to 1971, including every Stones track I excerpt in this episode.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>Today, we're going to look at one of the most important riffs in rock and roll history -- the record that turned the distorted guitar riff into the defining feature of the genre, even though the man who played that riff never liked it. We're going to look at a record that took the social protest of the folk-rock movement, aligned it with the misogyny its singer had found in many blues songs, and turned it into the most powerful expression of male adolescent frustration ever recorded to that point. We're going to look at \"Satisfaction\" by the Rolling Stones:</p>\n<p>[Excerpt: The Rolling Stones, \"Satisfaction\"]</p>\n<p>A note before we start this -- this episode deals with violence against women, and with rape. If you're likely to be upset hearing about those things, you might want to either skip this episode, or read the transcript on the website first. The relevant section comes right at the end of the episode, so you can also listen through to the point where I give another warning, without missing any of the rest of the episode.</p>\n<p>Another point I should make here -- most of the great sixties groups have very accurate biographies written about them. The Stones, even more than the Beatles, have kept a surprising amount of control over their public image, with the result that the only sources about them are either rather sanitised things made with their co-operation, or rather tabloidy things whose information mostly comes from people who are holding a grudge or have a particular agenda. I believe that everything in this episode is the most likely of the various competing narratives, but if you check out the books I used, which are listed on the blog post associated with this episode, you'll see that there are several different tellings of almost every bit of this story. So bear that in mind as you're listening. I've done my best. Anyway, on with the episode. </p>\n<p>When we left the Rolling Stones, they were at the very start of their recording career, having just released their first big hit single, a version of \"I Wanna Be Your Man\", which had been written for them by Lennon and McCartney. </p>\n<p>The day after they first appeared on Top of the Pops, they were back in the recording studio, but not to record for themselves. The five Stones, plus Ian Stewart, were being paid two pounds a head by their manager/producer Andrew Oldham to be someone else's backing group. Oldham was producing a version of \"To Know Him is to Love Him\", the first hit by his idol Phil Spector, for a new singer he was managing named Cleo Sylvester:</p>\n<p>[Excerpt: Cleo, \"To Know Him is to Love Him\"]</p>\n<p>In a further emulation of Spector, the B-side was a throwaway instrumental. Credited to \"the Andrew Oldham Orchestra\", and with Mike Leander supervising, the song's title, \"There Are But Five Rolling Stones\", gave away who the performers actually were:</p>\n<p>[Excerpt: The Andrew Oldham Orchestra, \"There Are But Five Rolling Stones\"]</p>\n<p>At this point, the Stones were still not writing their own material, but Oldham had already seen the writing on the wall -- there was going to be no place in the new world opened up by the Beatles for bands that couldn't generate their own hits, and he had already decided who was going to be doing that for his group. </p>\n<p>It would have been natural for him to turn to Brian Jones, still at this point the undisputed leader of the group, and someone who had a marvellous musical mind. But possibly in order to strengthen the group's identity as a group rather than a leader and his followers -- Oldham has made different statements about this at different points -- or possibly just because they were living in the same flat as him at the time, while Jones was living elsewhere, he decided that the Rolling Stones' equivalent of Lennon and McCartney was going to be Jagger and Richards.</p>\n<p>There are several inconsistencies in the stories of how Jagger and Richards started writing together -- and things like what the actual first song they wrote together was, or when they wrote it, will probably always be lost to the combination of self-aggrandisement and drug-fuelled memory loss that makes it difficult to say anything definitive about much of their career. But we do know that one of the earliest songs they wrote together was \"As Tears Go By\", a song that wasn't considered suitable for the group -- though they did later record a version of it -- and was given instead to Marianne Faithfull, a young singer with whom Jagger was about to enter into a relationship:</p>\n<p>[Excerpt: Marianne Faithfull, \"As Tears Go By\"]</p>\n<p>It's not entirely clear who wrote what on that song -- it's usually referred to as a Jagger/Richards collaboration, but it's credited to Jagger, Richards, and Oldham, and at least one source claims it was actually written by Jagger and the session guitarist Big Jim Sullivan -- and if so, this would be the first time of many that a song written by Jagger or Richards in collaboration with someone else would be credited to Jagger and Richards without any credit going to their co-writer.</p>\n<p>But the consensus story, as far as there is a consensus, seems to be that Oldham locked Jagger and Richards into a kitchen, and told them they weren't coming out until they had a song written. And it had to be a proper song, not a pastiche of something else, and it had to be the kind of song you could release as a single, not a blues song. After spending all night in the kitchen, Richards eventually got bored of being stuck in there, and started strumming his guitar and singing \"it is the evening of the day\", and the two of them quickly came up with the rest of the song.</p>\n<p>After \"As Tears Go By\", they wrote a lot of songs that they didn't feel were right for the group, but gave them away to other people, like Gene Pitney, who recorded \"That Girl Belongs to Yesterday\":</p>\n<p>[Excerpt: Gene Pitney, \"That Girl Belongs to Yesterday\"]</p>\n<p>Pitney, and his former record producer Phil Spector, had visited the Stones during the sessions for their first album, which started the day after that Cleo session, and had added a little piano and percussion to a blues jam called \"Little by Little\", which also featured Allan Clarke and Graham Nash of the Hollies on backing vocals. The songwriting on that track was credited to Spector and Nanker Phelge, a group pseudonym that was used for jam sessions and instrumentals. It was one of two Nanker Phelge songs on the album, and there was also an early Jagger and Richards song, \"Tell Me\", an unoriginal Merseybeat pastiche:</p>\n<p>[Excerpt: The Rolling Stones, \"Tell Me\"]</p>\n<p>But the bulk of the album was made up of cover versions of songs by Bo Diddley, Chuck Berry, Rufus Thomas, Marvin Gaye, and other Black American musicians.</p>\n<p>The album went to number one in the UK album charts, which is a much more impressive achievement than it might sound. At this point, albums sold primarily to adults with spending money, and the album charts changed very slowly. Between May 1963 and February 1968, the *only* artists to have number one albums in the UK were the Beatles, the Stones, Dylan, the Monkees, the cast of The Sound of Music, and Val Doonican. And between May 63 and April 65 it was *only* the Beatles and the Stones.</p>\n<p>But while they'd had a number one album, they'd still not had a number one single, or even a top ten one. \"I Wanna Be Your Man\" had been written for them and had hit number twelve, but they were still not writing songs that they thought were suited for release as singles, and they couldn't keep asking the Beatles to help them out, so while Jagger and Richards kept improving as songwriters, for their next single they chose a Buddy Holly B-side:</p>\n<p>[Excerpt: Buddy Holly, \"Not Fade Away\"]</p>\n<p>The group had latched on to the Bo Diddley rhythm in that song, along with its machismo -- many of the cover versions they chose in this period seem to have not just a sexual subtext but to be overtly bragging, and if Little Richard is to be believed on the subject, Holly's line \"My love is bigger than a Cadillac\" isn't that much of an exaggeration. It's often claimed that the Stones exaggerated and emphasised the Bo Diddley sound, and made their version more of an R&B number than Holly's, but if anything their version owes more to someone else. </p>\n<p>The Stones' first real UK tour had been on a bill with Mickie Most, Bo Diddley, Little Richard, and the Everly Brothers, and Keith Richards in particular had been amazed by the Everlys. He said later \"The best rhythm guitar playing I ever heard was from Don Everly. Nobody ever thinks about that, but their rhythm guitar playing is perfect\". Don Everly, of course, was himself very influenced by Bo Diddley, and learned to play in open-G tuning from Diddley -- and several years later, Keith Richards would make that tuning his own, after being inspired by Everly and Ry Cooder. </p>\n<p>The Stones' version of \"Not Fade Away\" owes at least as much to Don Everly's rhythm guitar style as to that of Holly or Diddley. Compare, say, the opening of \"Wake Up Little Suzie\":</p>\n<p>[Excerpt: The Everly Brothers, \"Wake Up Little Suzie\"]</p>\n<p>The rhythm guitar on the Stones version of \"Not Fade Away\" is definitely Keith Richards doing Don Everly doing Bo Diddley:</p>\n<p>[Excerpt: The Rolling Stones, \"Not Fade Away\"]</p>\n<p>That was recorded during the sessions for their first album, and was, depending on whose story you believe, another track that featured Phil Spector and Gene Pitney on percussion, recorded at the same session as \"Little by Little\", which became its B-side. Bill Wyman, who kept copious notes of the group's activities, has always said that the idea that it was recorded at that session was nonsense, and that it was recorded weeks later, and Oldham merely claimed Spector was on the record for publicity purposes. On the other hand, Gene Pitney had a very strong memory of being at that session.</p>\n<p>Spector had been in the country because the Ronettes had been touring the UK with the Stones as one of their support acts, along with the Swinging Blue Jeans and Marty Wilde, and Spector was worried that Ronnie might end up with one of the British musicians. He wasn't wrong to worry -- according to Ronnie's autobiography, there were several occasions when she came very close to sleeping with John Lennon, though they never ended up doing anything and remained just friends, while according to Keith Richards' autobiography he and Ronnie had a chaste affair on that tour which became less chaste when the Stones later hit America. But Spector had flown over to the UK to make sure that he remained in control of the young woman who he considered his property.</p>\n<p>Pitney, meanwhile, according to his recollection, turned up to the session at the request of Oldham, as the group were fighting in the studio and not getting the track recorded. Pitney arrived with cognac, telling the group that it was his birthday and that they all needed to get drunk with him. They did, they stopped fighting, and they recorded the track:</p>\n<p>[Excerpt: The Rolling Stones, \"Not Fade Away\"]</p>\n<p>\"Not Fade Away\" made number three on the UK charts, and also became the first Stones record to chart in the US at all, though it only scraped its way to number forty-eight, not any higher. But in itself that was a lot -- it meant that the Stones had a record doing well enough to justify them going to the US for their first American tour. </p>\n<p>But before that, they had to go through yet another UK tour -- though this isn't counted as an official tour in the listings of their tours, it's just a bunch of shows, in different places, that happened to be almost every night for a couple of months. By this time, the audience response was getting overwhelming, and shows often had to be cut short to keep the group safe. At one show, in Birkenhead, the show had to be stopped after the band played *three bars*, with the group running off stage after that as the audience invaded the stage.</p>\n<p>And then it was off to the US, where they were nowhere near as big, though while they were over there, \"Tell Me\" was also released as a single to tie in with the tour, and that did surprisingly well, making number twenty-four.</p>\n<p>The group's first experience of the US wasn't an entirely positive one -- there was a disastrous appearance on the Dean Martin Show on TV, with Martin mocking the group both before and after their performance, to the extent that Bob Dylan felt moved to write in the liner notes to his next album “Dean Martin should apologise t'the Rolling Stones”.</p>\n<p>But on the other hand, there were some good experiences. They got to see James Brown at the Apollo, and Jagger started taking notes -- though Richards also noted *what* Jagger was noting, saying \"James wanted to show off to these English folk. He’s got the Famous Flames, and he’s sending one out for a hamburger, he’s ordering another to polish his shoes and he’s humiliating his own band. To me, it was the Famous Flames, and James Brown happened to be the lead singer. But the way he lorded it over his minions, his minders and the actual band, to Mick was fascinating\"</p>\n<p>They also met up with Murray the K, the DJ who had started the career of the Ronettes among others. Murray had unilaterally declared himself \"the fifth Beatle\", and was making much of his supposed connections with British pop stars, most of whom either had no idea who he was or actively disliked him (Richards, when talking about him, would often replace the K with a four-letter word usually spelled with a \"c\"). The Stones didn't like him any more than any of the other groups did, but Murray played them a record he thought they'd be interested in -- \"It's All Over Now\" by the Valentinos, the song that Bobby Womack had written and which was on Sam Cooke's record label:</p>\n<p>[Excerpt: The Valentinos, \"It's All Over Now\"]</p>\n<p>They decided that they were going to record that, and handily Oldham had already arranged some studio time for them. As Giorgio Gomelsky would soon find with the Yardbirds, Oldham was convinced that British studios were simply unsuitable for recording loud blues-based rock and roll music, and Phil Spector had suggested to him that if the Stones loved Chess records so much, they might as well record at Chess studios. </p>\n<p>So while the group were in Chicago, they were booked in for a couple of days in the studio at Chess, where they were horrified to discover that their musical idol Muddy Waters was earning a little extra cash painting the studio ceiling and acting as a roadie, helping them in with their equipment. </p>\n<p>(It should be noted here that Marshall Chess, Leonard Chess' son who worked with the Stones in the seventies, has denied this happened. Keith Richards insists it did.)</p>\n<p>But after that shock, they found working at Chess a great experience. Not only did various of their musical idols, like Willie Dixon and Chuck Berry, as well as Waters, pop in to encourage them, and not only were they working with the same engineer who had recorded many of those people's records, but they were working in a recording studio with an actual multi-track system rather than a shoddy two-track tape recorder. From this point on, while they would still record in the UK on occasion, they increasingly chose to use American studios. </p>\n<p>The version of \"It's All Over Now\" they recorded there was released as their next single. It only made the top thirty in the US -- they had still not properly broken through there -- but it became their first British number one:</p>\n<p>[Excerpt: The Rolling Stones, \"It's All Over Now\"]</p>\n<p>Bobby Womack was furious that the Stones had recorded his song while his version was still new, but Sam Cooke talked him down, explaining that if Womack played his cards right he could have a lot of success through his connection with these British musicians. Once the first royalty cheques came in, Womack wasn't too upset any more.</p>\n<p>When they returned to the UK, they had another busy schedule of touring and recording -- and not all of it just for Rolling Stones work. There was, for example, an Andrew Oldham Orchestra session, featuring many people from the British session world who we've noted before -- Joe Moretti from Vince Taylor's band, John Paul Jones, Jimmy Page, Andy White, Mike Leander, and more. Mick Jagger added vocals to their version of \"I Get Around\":</p>\n<p>[Excerpt: The Andrew Oldham Orchestra, \"I Get Around\"]</p>\n<p>It's possible that Oldham had multiple motives for recording that -- Oldham was always a fan of Beach Boys style pop music more than he was of R&B, but he also was in the process of setting up his own publishing company, and knew that the Beach Boys' publishers didn't operate in the UK. In 1965, Oldham's company would become the Beach Boys' UK publishers, and he would get a chunk of every cover version of their songs, including his own.</p>\n<p>There were also a lot of demo sessions for Jagger/Richards songs intended for other artists, with Mick and Keith working with those same session musicians -- like this song that they wrote for the comedian Jimmy Tarbuck, demoed by Jagger and Richards with Moretti, Page, Jones, John McLaughlin, Big Jim Sullivan, and Andy White:</p>\n<p>[Excerpt: Mick Jagger and Keith Richards, \"We're Wastin' Time\"]</p>\n<p>But of course there were also sessions for Rolling Stones records, like their next UK number one single, \"Little Red Rooster\":</p>\n<p>[Excerpt: The Rolling Stones, \"Little Red Rooster\"]</p>\n<p>\"Little Red Rooster\" is a song that is credited to Willie Dixon, but which actually combines several elements from earlier blues songs, including a riff inspired by the one from Son House's \"Death Letter Blues\":</p>\n<p>[Excerpt: Son House, \"Death Letter Blues\"]</p>\n<p>A melody line and some lines of lyric from Memphis Minnie's \"If You See My Rooster\":</p>\n<p>[Excerpt: Memphis Minnie, \"If You See My Rooster\"]</p>\n<p>And some lines from Charley Patton's \"Banty Rooster Blues\":</p>\n<p>[Excerpt: Charley Patton, \"Banty Rooster Blues\"]</p>\n<p>Dixon's resulting song had been recorded by Howlin' Wolf in 1961:</p>\n<p>[Excerpt: Howlin' Wolf, \"Little Red Rooster\"]</p>\n<p>That hadn't been a hit, but Sam Cooke had recorded a cover version, in a very different style, that made the US top twenty and proved the song had chart potential:</p>\n<p>[Excerpt: Sam Cooke, \"Little Red Rooster\"]</p>\n<p>The Rolling Stones version followed Howlin' Wolf's version very closely, except that Jagger states that he *is* a cock -- I'm sorry, a rooster -- rather than that he merely has one. And this would normally be something that would please Brian Jones immensely -- that the group he had formed to promote Delta and Chicago blues had managed to get a song like that to number one in the UK charts, especially as it was dominated by his slide playing.</p>\n<p>But in fact the record just symbolised the growing estrangement between Jones and the rest of his band. When he turned up at the session to record \"Little Red Rooster\", he was dismayed to find out that the rest of the group had deliberately told him the wrong date. They'd recorded the track the day before, without him, and just left a note from Jagger to tell him where to put his slide fills.</p>\n<p>They spent the next few months ping-ponging between the UK and the US. In late 1964 they made another US tour, during which at one point Brian Jones collapsed with what has been variously reported as stress and alcohol poisoning, and had to miss several shows, leaving the group to carry on without him. There was much discussion at this point of just kicking him out of the band, but they decided against it -- he was still perceived as the group's leader and most popular member.</p>\n<p>They also appeared on the TAMI show, which we've mentioned before, and which we'll look at in more detail when we next look at James Brown, but which is notable here for two things. The first is that they once again saw how good James Brown was, and at this point Jagger decided that he was going to do his best to emulate Brown's performance -- to the extent that he asked a choreographer to figure out what Brown was doing and teach it to him, but the choreographer told Jagger that Brown moved too fast to figure out all his steps.</p>\n<p>The other is that the musical director for the TAMI Show was Jack Nitzsche, and this would be the start of a professional relationship that would last for many years. We've seen Nitzsche before in various roles -- he was the co-writer of \"Needles and Pins\", and he was also the arranger on almost all of Phil Spector's hits. He was so important to Spector's sound that Keith Richards has said “Jack was the Genius, not Phil. Rather, Phil took on Jack’s eccentric persona and sucked his insides out.”</p>\n<p>Nitzsche guested on piano when the Stones went into the studio in LA to record a chunk of their next album, including the ballad \"Heart of Stone\", which would become a single in the US. From that point on, whenever the Stones recorded in LA, Nitzsche would be there, adding keyboards and percussion and acting as an uncredited co-producer and arranger. He was apparently unpaid for this work, which he did just because he enjoyed being around the band.</p>\n<p>Nitzsche would also play on the group's next UK single, recorded a couple of months later. This would be their third UK number one, and the first one credited to Jagger and Richards as songwriters, though the credit is a rather misleading one in this case, as the chorus is taken directly from a gospel song by Pops Staples, recorded by the Staple Singers:</p>\n<p>[Excerpt: The Staple Singers, \"This May Be The Last Time\"]</p>\n<p>Jagger and Richards took that chorus and reworked it into a snarling song whose lyrics were based around Jagger's then favourite theme -- how annoying it is when women want to do things other than whatever their man wants them to do:</p>\n<p>[Excerpt: The Rolling Stones, \"The Last Time\"]</p>\n<p>There is a deep, deep misogyny in the Stones' lyrics in the mid sixties, partly inspired by the personas taken on by some blues men (though there are very few blues singers who stuck so unrelentingly to a single theme), and partly inspired by Jagger's own relationship with Chrissie Shrimpton, who he regarded as his inferior, even though she was his superior in terms of the British class system.</p>\n<p>That's even more noticeable on \"Play With Fire\", the B-side to \"The Last Time\". \"The Last Time\" had been recorded in such a long session that Jones, Watts, and Wyman went off to bed, exhausted. But Jagger and Richards wanted to record a demo of another song, which definitely seems to have been inspired by Shrimpton, so they got Jack Nitzsche to play harpsichord and Phil Spector to play (depending on which source you believe) either a bass or a detuned electric guitar:</p>\n<p>[Excerpt: The Rolling Stones, \"Play With Fire\"]</p>\n<p>The demo was considered good enough to release, and put out as the B-side without any contribution from the other three Stones.</p>\n<p>Other songs Chrissie Shrimpton would inspire over the next couple of years would include \"Under My Thumb\", \"19th Nervous Breakdown\", and \"Stupid Girl\". It's safe to say that Mick Jagger wasn't going to win any boyfriend of the year awards.</p>\n<p>\"The Last Time\" was a big hit, but the follow-up was the song that turned the Stones from being one of several British bands who were very successful to being the only real challengers to the Beatles for commercial success. And it was a song whose main riff came to Keith Richards in a dream:</p>\n<p>[Excerpt: The Rolling Stones, \"(I Can't Get No) Satisfaction)\"]</p>\n<p>Richards apparently had a tape recorder by the side of his bed, and when the riff came to him he woke up enough to quickly record it before falling back to sleep with the tape running. When he woke up, he'd forgotten the riff, but found it at the beginning of a recording that was otherwise just snoring.</p>\n<p>For a while Richards was worried he'd ripped the riff off from something else, and he's later said that he thinks that it was inspired by \"Dancing in the Street\". In fact, it's much closer to the horn line from another Vandellas record, \"Nowhere to Run\", which also has a similar stomping rhythm:</p>\n<p>[Excerpt: Martha and the Vandellas, \"Nowhere to Run\"]</p>\n<p>You can see how similar the two songs are by overlaying the riff from “Satisfaction” on the chorus to “Nowhere to Run”:</p>\n<p>[Excerpt “Nowhere to Run”/”Satisfaction”]</p>\n<p>\"Nowhere to Run\" also has a similar breakdown. Compare the Vandellas:</p>\n<p>[Excerpt: Martha and the Vandellas, \"Nowhere to Run\"]</p>\n<p>to the Stones:</p>\n<p>[Excerpt: The Rolling Stones, \"(I Can't Get No) Satisfaction\"]</p>\n<p>So it's fairly clear where the song's inspiration came from, but it's also clear that unlike a song like \"The Last Time\" this *was* just inspiration, rather than plagiarism. </p>\n<p>The recorded version of \"Satisfaction\" was never one that its main composer was happy with. The group, apart from Brian Jones, who may have added a harmonica part that was later wiped, depending on what sources you read, but is otherwise absent from the track, recorded the basic track at Chess studios, and at this point it was mostly acoustic. Richards thought it had come out sounding too folk-rock, and didn't work at all.</p>\n<p>At this point Richards was still thinking of the track as a demo -- though by this point he was already aware of Andrew Oldham's tendency to take things that Richards thought were demos and release them. When Richards had come up with the riff, he had imagined it as a horn line, something like the version that Otis Redding eventually recorded:</p>\n<p>[Excerpt: Otis Redding, \"(I Can't Get No) Satisfaction\"]</p>\n<p>So when they went into the studio in LA with Jack Nitzsche to work on some tracks there including some more work on the demo for “Satisfaction”, as well as Nitzsche adding some piano, Richards also wanted to do something to sketch out what the horn part would be. He tried playing it on his guitar, and it didn't sound right, and so Ian Stewart had an idea, went to a music shop, and got one of the first ever fuzz pedals, to see if Richards' guitar could sound like a horn.</p>\n<p>Now, people have, over the years, said that \"Satisfaction\" was the first record ever to use a fuzz tone. This is nonsense. We saw *way* back in the episode on “Rocket '88” a use of a damaged amp as an inspired accident, getting a fuzzy tone, though nobody picked up on that and it was just a one-off thing.</p>\n<p>Paul Burlison, the guitarist with the Rock 'n' Roll Trio, had a similar accident a few years later, as we also saw, and went with it, deliberately loosening tubes in his amp to get the sound audible on their version of \"Train Kept A-Rollin'\":</p>\n<p>[Excerpt: Johnny Burnette and the Rock 'n' Roll Trio, \"Train Kept A-Rollin'\"]</p>\n<p>A few years later, Grady Martin, the Nashville session player who was the other guitarist on that track, got a similar effect on his six-string bass solo on Marty Robbins' \"Don't Worry\", possibly partly inspired by Burlison's sound:</p>\n<p>[Excerpt: Marty Robbins, \"Don't Worry\"]</p>\n<p>That tends to be considered the real birth of fuzz, because that time it was picked up by the whole industry. Martin recorded an instrumental showing off the technique:</p>\n<p>[Excerpt: Grady Martin, \"The Fuzz\"]</p>\n<p>And more or less simultaneously, Wrecking Crew guitarist Al Casey used an early fuzz tone on a country record by Sanford Clark:</p>\n<p>[Excerpt: Sanford Clark, \"Go On Home\"]</p>\n<p>And the pedal steel player Red Rhodes had invented his own fuzz box, which he gave to another Wrecking Crew player, Billy Strange, who used it on records like Ann-Margret's \"I Just Don't Understand\":</p>\n<p>[Excerpt: Ann-Margret, \"I Just Don't Understand\"]</p>\n<p>All those last four tracks, and many more, were from 1960 or 1961. So far from being something unprecedented in recording history, as all too many rock histories will tell you, fuzz guitar was somewhat passe by 1965 -- it had been the big thing on records made by the Nashville A-Team and the Wrecking Crew four or five years earlier, and everyone had moved on to the next gimmick long ago.</p>\n<p>But it was good enough to use to impersonate a horn to sketch out a line for a demo. Except, of course, that while Jagger and Richards disliked the track as recorded, the other members of the band, and Ian Stewart (who still had a vote even though he was no longer a full member) and Andrew Oldham all thought it was a hit single as it was. They overruled Jagger and Richards and released it complete with fuzz guitar riff, which became one of the most well-known examples of the sound in rock history. To this day, though, when Richards plays the song live, he plays it without the fuzztone effect.</p>\n<p>Lyrically, the song sees Mick Jagger reaching for the influence of Bob Dylan and trying to write a piece of social commentary. The title line seems, appropriately for a song partly recorded at Chess studios, to have come from a line in a Chuck Berry record, \"Thirty Days\":</p>\n<p>[Excerpt: Chuck Berry, \"Thirty Days\"]</p>\n<p>But the sentiment also owes more than a little to another record by a Chess star, one recorded so early that it was originally released when Chess was still called Aristocrat Records -- Muddy Waters'  \"I Can't Be Satisfied\":</p>\n<p>[Excerpt: Muddy Waters, \"I Can't Be Satisfied\"]</p>\n<p>“Satisfaction” is the ultimate exercise in adolescent male frustration. I once read something, and I can't for the life of me remember where or who the author was, that struck me as the most insightful critique of the sixties British blues bands I've ever heard. That person said that by taking the blues out of the context in which the music had been created, they fundamentally changed the meaning of it -- that when Bo Diddley sang \"I'm a Man\", the subtext was \"so don't call me 'boy', cracker\". Meanwhile, when some British white teenagers from Essex sang the same words, in complete ignorance of the world in which Diddley lived, what they were singing was \"I'm a man now, mummy, so you can't make me tidy my room if I don't want to\".</p>\n<p>But the thing is, there are a lot of teenagers out there who don't want to tidy their rooms, and that kind of message does resonate. And here, Jagger is expressing the kind of aggressive sulk that pretty much every teenager, especially every frustrated male teenager will relate to. The protagonist is dissatisfied with everything in his life, so criticism of the vapidity of advertising is mixed in with sexual frustration because women won't sleep with the protagonist when they're menstruating:</p>\n<p>[Excerpt: The Rolling Stones, \"(I Can't Get No) Satisfaction\"]</p>\n<p>It is the most adolescent lyric imaginable, but pop music is an adolescent medium.</p>\n<p>The song went to number one in the UK, and also became the group's first American number one. But Brian Jones resented it, so much so that when they performed the song live, he'd often start playing “I'm Popeye the Sailor Man”. This was partly because it wasn't the blues he loved, but also because it was the first Stones single he wasn't on (again, at least according to most sources. Some say he played acoustic rhythm guitar, but most say he's not on it and that Richards plays all the guitar parts). And to explain why, I have to get into the unpleasant details I talked about at the start. If you're likely to be upset by discussion of rape or domestic violence, stop the episode now.</p>\n<p>Now, there are a number of different versions of this story. This is the one that seems most plausible to me, based on what else I know about the Stones, and the different accounts, but some of the details might be wrong, so I don't want anyone to think that I'm saying that this is absolutely exactly what happened. But if it isn't, it's the *kind* of thing that happened many times, and something very like it definitely happened.</p>\n<p>You see, Brian Jones was a sadist, and not in a good way. There are people who engage in consensual BDSM, in which everyone involved is having a good time, and those people include some of my closest friends. This will never be a podcast that engages in kink-shaming of consensual kinks, and I want to make clear that what I have to say about Jones has nothing to do with that.</p>\n<p>Because Jones was not into consent. He was into physically injuring non-consenting young women, and he got his sexual kicks from things like beating them with chains. Again, if everyone is involved is consenting, this is perfectly fine, but Jones didn't care about anyone other than himself.</p>\n<p>At a hotel in Clearwater, Florida, on the sixth of May 1965, the same day that Jagger and Richards finished writing \"Satisfaction\", a girl that Bill Wyman had slept with the night before came to him in tears. She'd been with a friend the day before, and the friend had gone off with Jones while she'd gone off with Wyman. Jones had raped her friend, and had beaten her up -- he'd blackened both her eyes and done other damage.</p>\n<p>Jones had hurt this girl so badly that even the other Stones, who as we have seen were very far from winning any awards for being feminists of the year, were horrified. There was some discussion of calling the police on him, but eventually they decided to take matters into their own hands, or at least into one of their employees' hands. They got their roadie Mike Dorsey to teach him a lesson, though Oldham was insistent that Dorsey not mess up Jones' face. Dorsey dangled Jones by his collar and belt out of an upstairs window and told Jones that if he ever did anything like that again, he'd drop him. He also beat him up, cracking two of Jones' ribs.</p>\n<p>And so Jones was not in any state to play on the group's first US number one, or to play much at all at the session, because of the painkillers he was on for the cracked ribs. </p>\n<p>Jones would remain in the band for the next few years, but he had gone from being the group's leader to someone they disliked and were disgusted by. And as we'll see the next couple of times we look at the Stones, he would only get worse.</p>",
  "enclosure": "",
  "itunes:summary": "Episode 129 of A History of Rock Music in Five Hundred Songs looks at “(I Can't Get No) Satisfaction” by the Rolling Stones, and how they went from being a moderately successful beat group to being the only serious rivals to the Beatles. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have an eleven-minute bonus episode available, on \"I'll Never Find Another You\" by the Seekers.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nResources\nAs usual I’ve created a Mixcloud streaming playlist with full versions of all the songs in the episode.\ni used a lot of resources for this episode. Two resources that I’ve used for this and all future Stones episodes — The Rolling Stones: All The Songs by Phillipe Margotin and Jean-Michel Guesden is an invaluable reference book, while Old Gods Almost Dead by Stephen Davis is the least inaccurate biography. When in doubt, the version of the narrative I've chosen to use is the one from Davis' book.\nI’ve also used Andrew Loog Oldham’s autobiography Stoned, and Keith Richards’ Life, though be warned that both casually use slurs.\nSympathy for the Devil: The Birth of the Rolling Stones and the Death of Brian Jones by Paul Trynka is, as the title might suggest, essentially special pleading for Jones. It's as well-researched and well-written as a pro-Jones book can be, and is worth reading for balance, though I find it unconvincing.\nThis web page seems to have the most accurate details of the precise dates of sessions and gigs.\nAnd this three-CD set contains the A and B sides of all the Stones’ singles up to 1971, including every Stones track I excerpt in this episode.\nPatreon\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\nTranscript\nToday, we're going to look at one of the most important riffs in rock and roll history -- the record that turned the distorted guitar riff into the defining feature of the genre, even though the man who played that riff never liked it. We're going to look at a record that took the social protest of the folk-rock movement, aligned it with the misogyny its singer had found in many blues songs, and turned it into the most powerful expression of male adolescent frustration ever recorded to that point. We're going to look at \"Satisfaction\" by the Rolling Stones:\n[Excerpt: The Rolling Stones, \"Satisfaction\"]\nA note before we start this -- this episode deals with violence against women, and with rape. If you're likely to be upset hearing about those things, you might want to either skip this episode, or read the transcript on the website first. The relevant section comes right at the end of the episode, so you can also listen through to the point where I give another warning, without missing any of the rest of the episode.\nAnother point I should make here -- most of the great sixties groups have very accurate biographies written about them. The Stones, even more than the Beatles, have kept a surprising amount of control over their public image, with the result that the only sources about them are either rather sanitised things made with their co-operation, or rather tabloidy things whose information mostly comes from people who are holding a grudge or have a particular agenda. I believe that everything in this episode is the most likely of the various competing narratives, but if you check out the books I used, which are listed on the blog post associated with this episode, you'll see that there are several different tellings of almost every bit of this story. So bear that in mind as you're listening. I've done my best. Anyway, on with the episode. \nWhen we left the Rolling Stones, they were at the very start of their recording career, having just released their first big hit single, a versi",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 129 of A History of Rock Music in Five Hundred Songs looks at “(I Can't Get No) Satisfaction” by the Rolling Stones, and how they went from being a moderately successful beat group to being the only serious rivals to the Beatles. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have an eleven-minute bonus episode available, on \"I'll Never Find Another You\" by the Seekers.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nResources\nAs usual I’ve created a Mixcloud streaming playlist with full versions of all the songs in the episode.\ni used a lot of resources for this episode. Two resources that I’ve used for this and all future Stones episodes — The Rolling Stones: All The Songs by Phillipe Margotin and Jean-Michel Guesden is an invaluab",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}