{
  "id": "yt:video:4LFQd4uvtM0",
  "yt:videoId": "4LFQd4uvtM0",
  "yt:channelId": "UC5miyvhPsWWyfTulnJ43koQ",
  "title": "THI Theoretical Bounce to Mainland using 2 Goombas without Misalignment",
  "link": "",
  "author": {
    "name": "UncommentatedPannen",
    "uri": "https://www.youtube.com/channel/UC5miyvhPsWWyfTulnJ43koQ"
  },
  "published": "2022-11-05T15:02:56+00:00",
  "updated": "2022-11-05T15:02:56+00:00",
  "media:group": {
    "media:title": "THI Theoretical Bounce to Mainland using 2 Goombas without Misalignment",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "I show that we can use 2 goomba bounces to get onto the item block on a corner of it towards the cliffside, which doesn't have a misalignment. And from there, we can get onto the mainland. Note that I used hacks to place the goombas, because it's currently questionable whether we could naturally get them to fall into these positions.\n\nOriginally, I had showed that we could get onto the item block using 2 goomba bounces and a misalignment (https://youtu.be/6tebqdCd1kE). However, an issue with that plan was that the misalignment corner of the item block is on the opposite side from the cliff, and so we can't really reach it from bouncing on enemies that fall straight down from the cliff. Later, I showed that we could get onto the item block without using the misalignment if we used 3 bounces (https://youtu.be/URie0k2JG5c). After that, Marbler (https://www.youtube.com/user/supermarble94) pointed out to me that item block walls are so vertically thin that the floor hitbox is available to access just under the upper wall hitbox. Thus, I re-examined the situation, and as it turns out, 2 bounces are sufficient for getting onto the item block from the side nearer the cliff. In relative terms, setting up 2 bounces should be much easier than setting up 3 bounces, but in absolute terms, it's still questionable whether this is possible to set up, given that one of the goombas won't naturally walk this far away from its home. So the next question is whether we can use a goomba escort to make it possible.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}