{
  "guid": "urn:uuid:f7c21679-98d4-4464-96cd-0994556ceab5",
  "link": "https://www.who.int/news/item/03-11-2022-act-now--migrant-inclusion-in-climate-action-is-an-obligation--not-an-option",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Act now: migrant inclusion in climate action is an obligation, not an option",
  "description": "On the occasion of the 27th Conference of the Parties of the UNFCCC (COP27), the United Nations Network on Migration calls on Member States to recognize the opportunities to work towards sustainable, rights-based mitigation and adaptation to climate change in order to address human mobility(1) in this context in line with the recommendations of the UNFCCC Taskforce on Displacement.",
  "pubDate": "Thu, 03 Nov 2022 11:44:05 Z",
  "a10:content": "<p>The adverse effects of climate change and environmental degradation are increasingly driving human mobility the world over, particularly in countries with high exposure and low adaptive capacity. While most climate-related mobility currently occurs within\n    countries, desperation and deteriorating environments can also compel people to seek a livelihood elsewhere through irregular migration. While climate change negatively impacts everyone, everywhere, those already in vulnerable situations due to geography,\n    poverty, gender, age, disability, origin or other status, including migrant women who depend on climate-sensitive livelihoods, and children who are less able to survive extreme weather events, are at the greatest risk of suffering harm. It is imperative\n    to recognize this reality and take meaningful action to protect the human rights of those most affected by climate change, including migrants.&nbsp;</p><p>On the occasion of the 27th Conference of the Parties of the UNFCCC (COP27), the United Nations Network on Migration calls on Member States to recognize the opportunities to work towards sustainable, rights-based mitigation and adaptation to climate change\n    in order to address human mobility(1) in this context in line with the recommendations of the UNFCCC Taskforce on Displacement.&nbsp;<em></em><em></em></p><p>The Network urges States, working in cooperation with relevant UN entities and all partners, to address and seek inclusive solutions for the most affected people, including those staying in place, moving internally, and migrating internationally, while\n    fully recognizing the adaptation role that migration plays in this context. While progress has already been achieved in mainstreaming migration into adaptation strategies and policies for climate action, much more needs to be done. As acknowledged\n    at COP26, inadequacies in anticipating and planning for situations that could induce climate-related mobility remain and efforts to mitigate and adapt to the adverse effects of climate change, including through resource mobilization, are insufficient.&nbsp;</p><p>The Network encourages States to include pathways for regular migration in their climate change mitigation and adaptation strategies, which enable labour mobility and decent work, human rights and humanitarian admission and stay, family reunification,\n    education, private sponsorships, and visa waivers, to support communities in building resilience to climate change and adapting through mobility. In this regard, improvements have been made in the conclusion of bilateral and regional labour migration\n    agreements or the creation of special visa categories to enable people affected by climate change to move regularly or to remain in countries of destination.&nbsp;</p><p>Pursuant to the commitments made in the Global Compact for Safe, Orderly and Regular Migration (GCM) and renewed in the Progress Declaration of the first International Migration Review Forum in New York in May 2022, the Network reiterates its call for\n    States to develop inclusive climate change and migration policies and action plans that ensure migrants&rsquo; full and effective participation as rights holders. The Network also reminds States that any policy measure or legislation that governs\n    or directly impacts human mobility in the context of climate change should uphold human rights obligations.&nbsp;</p><p>States can ensure that this objective is effectively achieved through recognizing that the Paris Agreement, the Sendai Framework for Disaster Risk Reduction 2015-2030, the 2030 Agenda for Sustainable Development, and the Global Compacts for Migration\n    and Refugees are interlinked and should be implemented simultaneously and in a mutually reinforcing manner.&nbsp;</p><p>To uphold human rights, strengthen the adaptive capacities of migrants and harness the potential of climate mobility the Network calls on governments, in collaboration with one another and all relevant stakeholders, to:&nbsp;</p><ul><li>Strengthen support to countries and people affected by effectively mobilizing adequate finance to support climate action, including through investing in early warning systems and preparedness, and addressing the impacts of both economic and non-economic\n        loss and damage, including for migrants;&nbsp;</li><li>Facilitate a just transition to environmentally sustainable, green economies and societies, including by building climate-resilient health systems, promoting resilience and equitable development and advancing social justice and decent work creation,\n        tapping into the skills and experiences of migrants, with the support of business, employers, trade unions and workers organizations, and harnessing their contributions towards sustainable development;&nbsp;</li><li>Enhance and diversify the availability of climate-sensitive pathways for regular migration, including by creating regular pathways for labour mobility, ensuring they are accessible to all, including women and children as an adaptation option and a\n        way to prevent and address situations of vulnerability;&nbsp;</li><li>Enhance regional and international action and cooperation to effectively address climate-related migration at local, national, regional and global levels through dedicated and coordinated climate change and migration policies and action plans, including\n        by working coherently across all relevant multilateral fora; and,&nbsp;</li><li>Foster evidence-based decisions and disaggregated data which inform cooperation and scaled up climate action.&nbsp;</li></ul><p>Our shared future depends on realizing the human right to a clean, healthy and sustainable environment for all. The interlinkages between climate change, human rights and migration are clear and the international community can no longer delay taking action\n    to protect the environment, for present and future generations.&nbsp;</p><p>Every step taken towards safe, orderly and regular migration would make a step forwards in the context of our changing climate.&nbsp;</p><p><em>(1)&nbsp;</em><em>Climate change-related human mobility is understood as encompassing migration, displacement and planned relocation as reflected in GCM Objectives 2 (18 j) and 5 (21 h) and agreed under relevant UNFCCC processes such as the Executive Committee of the Warsaw International Mechanism for Loss and Damage and the Task Force on Displacement recommendations. </em>&nbsp;</p><p><hr />The United Nations Network on Migration was established to ensure effective, timely and coordinated system-wide support to Member States in their implementation, follow-up and review of the Global Compact for Safe, Orderly and Regular Migration. While the Network&rsquo;s mandate is focused on migration, States are called to also implement these recommendations to displaced persons, refugees and asylum-seekers as well and to protect the human rights of everyone equally, regardless of status.&nbsp;</p><p>&nbsp;</p><p></p>"
}