{
  "title": "Alternative assets marketplace Fundnel buys Hg Exchange, rebrands as Alta",
  "link": "https://e27.co/alternative-assets-marketplace-fundnel-rebrands-as-alta-acquires-hg-exchange-20221101/",
  "dc:creator": "Sainul",
  "pubDate": "Tue, 01 Nov 2022 05:30:34 +0000",
  "category": [
    "Blockchain",
    "Investments",
    "Singapore",
    "Alta",
    "Fundnel",
    "Hg Exchange",
    "Integra Partners",
    "Nomura Holdings",
    "Phillip Securities",
    "Prime Partners"
  ],
  "guid": "https://e27.co/?p=475400",
  "description": "<p>Singapore-based Fundnel, a leading digital marketplace for alternative investments, has acquired the blockchain-powered private digital securities exchange Hg Exchange (HGX). The transaction details remain undisclosed. Fundnel has also announced its rebranding into Alta. According to a press release, the acquisition will enable Alta to support the tokenisation and digital custody of alternative assets. This will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/alternative-assets-marketplace-fundnel-rebrands-as-alta-acquires-hg-exchange-20221101/\">Alternative assets marketplace Fundnel buys Hg Exchange, rebrands as Alta</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<div id=\"attachment_475401\" style=\"width: 700px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-475401\" loading=\"lazy\" class=\"size-full wp-image-475401\" src=\"https://e27.co/wp-content/uploads/2022/11/Alta_buys_hg_exchange_news.png\" alt=\"\" width=\"690\" height=\"388\" /><p id=\"caption-attachment-475401\" class=\"wp-caption-text\">Alta Co-Founder and CEO Kelvin Lee</p></div>\n<p>Singapore-based Fundnel, a leading digital marketplace for alternative investments, has acquired the blockchain-powered private digital securities exchange Hg Exchange (HGX).</p>\n<p>The transaction details remain undisclosed.</p>\n<p>Fundnel has also announced its rebranding into Alta.</p>\n<p>According to a press release, the acquisition will enable Alta to support the tokenisation and digital custody of alternative assets. This will create an end-to-end solution that makes it cheaper and faster to trade private securities, funds, and asset-backed securities like real estate and luxury assets.</p>\n<p>The deal will see HGX become a wholly-owned subsidiary of Alta. Alta will also list Phillip Securities, Nomura Holdings, Integra Partners, and Prime Partners as shareholders.</p>\n<p>Following the acquisition, Hg Exchange will be renamed Alta Exchange. It will continue to be led by CEO Willie Chang and the existing Hg Exchange team, which will merge and augment Alta&#8217;s team.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/fundnel-group-bri-ventures-to-launch-new-growth-stage-fund-20220510/\">Fundnel, BRI Ventures to launch new US$50M+ fund for Indonesia’s growth-stage startups</a></strong></p>\n<p>The deal will enhance Alta&#8217;s service offering by bringing three core parts of its business under one roof &#8212; private market investment, trading of tokenised asset-backed securities, and direct access to funds managed by Alta.</p>\n<p>Kelvin Lee, CEO and Co-Founder of Alta, said: &#8220;The Hg Exchange acquisition marks a new chapter in our journey to revolutionise private markets with a blockchain-powered digital exchange, bringing enhanced access and liquidity to alternative investments for all investors.&#8221;</p>\n<p>&#8220;Our goal is to connect promising new opportunities with capital. Today, by standardising processes around our tokenised listings, we make investing in alternative cost-effective and transparent for investors,&#8221; he added.</p>\n<p>Started in 2016, Alta gives investors direct access to invest and trade in a wide range of curated alternative assets, from direct investment into early to late-stage private companies, PE/VC funds, asset-backed securities of luxury assets, and real estate.</p>\n<p>To date, Alta claims to have facilitated more than 600 transactions for opportunities like SpaceX, Grab, Gojek, rare whiskeys, and other alternative assets. It has generated over US$600 million in transactions and allowed access to over US$22 billion worth of mandated deals for its global investor community.</p>\n<p>In 2021, blockchain and cryptocurrency giant Binance <a rel=\"follow\" href=\"https://e27.co/binance-asia-services-hg-exchange-20211208/\">acquired</a> an 18 per cent stake in Hg Exchange.</p>\n<p>&#8212;</p>\n<p>Fundraising or preparing your startup for fundraising? Build your investor network, search from 400+ SEA investors on e27, and get connected or get insights regarding fundraising. <a class=\"ProsemirrorEditor-link\" rel=\"follow\" href=\"https://e27.co/membership/?utm_source=Boilerplate&utm_medium=Articles&utm_campaign=300TRIAL&utm_id=300TRIAL\" rel=\"follow\">Try e27 Pro for free today</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/alternative-assets-marketplace-fundnel-rebrands-as-alta-acquires-hg-exchange-20221101/\">Alternative assets marketplace Fundnel buys Hg Exchange, rebrands as Alta</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}