{
  "id": "yt:video:FzVXmhRTRzk",
  "yt:videoId": "FzVXmhRTRzk",
  "yt:channelId": "UCBH5VZE_Y4F3CMcPIzPEB5A",
  "title": "Can Unemployment Help the Fed? | The Big Conversation | Refinitiv",
  "link": "",
  "author": {
    "name": "Real Vision Finance",
    "uri": "https://www.youtube.com/channel/UCBH5VZE_Y4F3CMcPIzPEB5A"
  },
  "published": "2022-11-03T13:00:17+00:00",
  "updated": "2022-11-03T13:00:17+00:00",
  "media:group": {
    "media:title": "Can Unemployment Help the Fed? | The Big Conversation | Refinitiv",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This week Real Vision’s Roger Hirst uses best in class data to look at the outlook for employment and its implications for both recessions and equity markets. Equity markets usually make a major bottom during recessions and recessions go hand in hand with higher unemployment. Currently, unemployment is close to record lows. That could change, but will it be swift enough to allow the Fed to reverse course on rates? In the Chatter, Real Vision’s Roger Hirst talks to Kelvin Tay, Regional Chief Investment Officer at UBS Wealth Management in Singapore, about the likelihood of a recession in the US.\n\nSee the full series and access expert data-driven insights and news from Refinitiv: https://refini.tv/2Tq42o2  \n\n\nSubscribe now for more videos like this one: https://rvtv.io/2OW3mqu   \n\nBecome a member of Real Vision -- get started for 7 days for only $1: https://rvtv.io/membership  \n\n \n\nAbout Refinitiv: For new insights on artificial intelligence (AI), digitalization, big data, risk management, compliance, fighting financial crime and the future of trading and investing, visit our insights hub - http://refinitiv.com/perspectives. Refinitiv is one of the world’s largest providers of financial markets data and infrastructure, serving over 40,000 institutions in approximately 190 countries. It provides leading data and insights, trading platforms, and open data and technology platforms that connect a thriving global financial markets community – driving performance in trading, investment, wealth management, regulatory compliance, market data management, enterprise risk and fighting financial crime. https://www.refinitiv.com We invite you to join Refinitiv's social media communities: http://linkedin.com/company/refinitiv http://twitter.com/refinitiv http://www.instagram.com/refinitiv http://www.facebook.com/refinitiv   \n\n \n\n \n\nAbout Real Vision™:  \n\nReal Vision™ is the destination for the world’s most successful investors to share their thoughts about what’s happening in today’s markets. (Think of it like TED Talks for Finance.). Understand the complex world of finance, business and the global economy with real in-depth analysis from real experts. \n\n \n\nDisclaimer:  \n\nThe content and information (“Content”) in the video programs (“Video Programs”) is provided for informational purposes only and not investment advice. You should not construe any such Content, information or other material as legal, tax, investment, financial, or other professional advice nor does any such information constitute a comprehensive or complete statement of the matters discussed. None of the Content constitutes a solicitation, recommendation, endorsement, or offer by Refinitiv or any third party service provider to buy or sell any securities or other financial instruments in this or in in any other jurisdiction in which such solicitation or offer would be unlawful under the securities laws of such jurisdiction. All Content is information of a general nature, is illustrative only and does not address the circumstances of any particular individual or entity. Refinitiv is not a fiduciary by virtue of any person’s use of or access to the Video Programs or Content. You alone assume the sole responsibility of evaluating the merits and risks associated with the use of any information or other Content in the Video Programs before making any decisions based on such information or other Content. In exchange for accessing and viewing the Video Programs and Content, you agree not to hold Refinitiv, its affiliates or any third party service provider liable for any possible claim for damages arising from any decision you make based on information or other Content made available to you through the Video Programs. The Content and information in the Video Programs has been obtained from sources believed to be reliable, but Refinitiv makes no representation or warranty as to the accuracy, timeliness or completeness of the Content. Any opinion or recommendation expressed in the Video Programs is subject to change without notice. Refinitiv does not recommend, explicitly nor implicitly, nor suggest or recommend any investment strategy. Refinitiv disclaims all liability for any loss that may arise (whether direct, indirect, consequential, incidental, punitive or otherwise) from any use of the information in Video Programs. Refinitiv does not have regard to any individual’s, group of individuals’ or entity’s specific investment objectives, financial situation or circumstances. Refinitiv does not express any opinion on the future value of any security, currency or other investment instrument. You should seek expert financial and other advice regarding the appropriateness of the material discussed or recommended in the Video Programs and should note that investment values may fall, you may receive back less than originally invested and past performance is not necessarily reflective of future performance.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}