{
  "title": "S3 EP1: The End of Fashion feat. Teri Agins",
  "itunes:title": "The End of Fashion feat. Teri Agins",
  "pubDate": "Fri, 01 Jan 2021 06:39:05 +0000",
  "guid": "434d368a-cab7-4699-9127-c2d6a64557cc",
  "link": "https://traffic.libsyn.com/secure/rechoomondi/TERI_V5.mp3",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Teri Agins covered fashion at The Wall Street Journal for 20 years. In 1999, she published her first book,</span> <em><span style=\"font-weight: 400;\">The End of Fashion; How Marketing Changed the Clothing Business Forever.</span></em> <span style=\"font-weight: 400;\">A friend lent me the book and it collected dust on my desk for months before I decided to pick it up; at which point I couldn’t put it down. This book is fashion reporting unlike I’ve ever seen of the industry. As</span> <em><span style=\"font-weight: 400;\">Vanity Fair</span></em> <span style=\"font-weight: 400;\">declared, “The End of Fashion rips into the underbelly of a world where marketing is king and often the emperor has no clothes.”</span></p>",
  "content:encoded": "<p>Teri Agins covered fashion at The Wall Street Journal for 20 years. In 1999, she published her first book, <em>The End of Fashion; How Marketing Changed the Clothing Business Forever.</em> A friend lent me the book and it collected dust on my desk for months before I decided to pick it up; at which point I couldn’t put it down. This book is fashion reporting unlike I’ve ever seen of the industry. As <em>Vanity Fair</em> declared, “The End of Fashion rips into the underbelly of a world where marketing is king and often the emperor has no clothes.”</p>",
  "enclosure": "",
  "itunes:duration": "50:48",
  "itunes:explicit": false,
  "itunes:keywords": "fashion,NYFW,marcjacobs,barneysnewyork,giorgioarmani,silaschou,teriagins,isetan,lawrencestroll,ninocerutti,christianlacroix,blainetrump",
  "itunes:subtitle": "Teri Agins covered fashion at The Wall Street Journal for 20 years. In 1999, she published her first book, The End of Fashion; How Marketing Changed the Clothing Business Forever. A friend lent me the book and it collected dust on my desk for months...",
  "itunes:season": 3,
  "itunes:episode": 1,
  "itunes:episodeType": "full"
}