{
  "title": "Episode 104: &#8220;He&#8217;s a Rebel&#8221; by &#8220;The Crystals&#8221;",
  "link": "https://500songs.com/podcast/episode-104-hes-a-rebel-by-the-crystals/",
  "pubDate": "Mon, 16 Nov 2020 15:17:09 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-104-hes-a-rebel-by-the-crystals/",
  "description": "Episode 104 of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"He's a Rebel\", and how a song recorded by the Blossoms was released under the name of the Crystals.&nbsp; Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/43960582\">on \"Sukiyaki\" by Kyu Sakamoto.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-104-hes-a-rebel/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\nA lot of resources were used for this episode.\n\nThe material on Gene Pitney mostly comes from his page on <a href=\"http://tims.blackcat.nl/\">This is My Story</a>.\n\n<a href=\"https://amzn.to/325o24w\">Always Magic in the Air: The Bomp and Brilliance of the Brill Building Era</a> by Ken Emerson is a good overview of the Brill Building scene.\n\n<a href=\"https://amzn.to/3iOneXx\">Girl Groups</a> by John Clemente contains potted biographies of many groups of the era, including articles on both The Crystals and the Blossoms.\n\nI've referred to two biographies of Spector in this episode,&nbsp;<a href=\"https://amzn.to/35C05CU\"><em>Phil Spector: Out of His Head</em> by Richard Williams</a> and&nbsp;<a href=\"https://amzn.to/32OKWMK\"><em>He's a Rebel</em> by Mark Ribkowsky</a>.\n\nAnd information on the Wrecking Crew largely comes from&nbsp;<a href=\"https://amzn.to/35FhkUh\"><em>The Wrecking Crew&nbsp;</em>by Kent Hartman</a>.\n\nThere are many compilations available with some of the hits Spector produced, but I recommend getting<a href=\"https://amzn.to/3lOXT0V\">&nbsp;<em>Back to Mono</em></a>, a four-CD overview of his career containing all the major singles put out by Philles.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nA brief note -- there are some very brief mentions of domestic abuse here. Nothing I think will upset anyone, but you might want to check the transcript if you're at all unsure.\n\nUp to this point, whenever we've looked at a girl group, it's been at one that had, to a greater or lesser extent, some control over their own career. Groups like the Marvelettes, the Chantels, and the Bobbettes all wrote their own material, at least at first, and had distinctive personalities before they ever made a record.\n\nBut today, we're going to look at a group whose identity was so subsumed in that of their producer that the record we're looking at was released under the name of a different group from the one that recorded it. We're going to look at \"He's a Rebel\", which was recorded by the Blossoms and released by the Crystals.\n\n[Excerpt: “The Crystals” (The Blossoms), \"He's a Rebel\"]\n\nThe Crystals, from their very beginnings, were intended as a vehicle for the dreams of men, rather than for their own ambitions. Whereas the girl groups we've looked at so far all formed as groups of friends at school before they moved into professional singing, the Crystals were put together by a man named Benny Wells. Wells had a niece, Barbara Alston, who sang with a couple of her schoolfriends, Mary Thomas and Myrna Giraud. Wells put those three together with two other girls, Dee Dee Kenniebrew and Patsy Wright, to form a five-piece vocal group. Wells seems not to have had much concept of what was in the charts at the time -- the descriptions of the music he had the girls singing talk about him wanting them to sound like the Modernaires, the vocal group who sang with Glenn Miller's band in the early 1940s.\n\nBut the girls went along with Wells, and Wells had good enough ears to recognise a hit when one was brought to him -- and one was brought to him by Patsy Wright's brother-in-law, Leroy Bates. Bates had written a song called \"There's No Other Like My Baby\", and Wells could tell it had potential. Incidentally, some books say that the song was based on a gospel song called \"There's No Other Like My Jesus\", and that claim is repeated on Wikipedia, but I can't find any evidence of a song of that name other than people talking about \"There's No Other Like My Baby\". There is a gospel song called \"There's No Other Name Like Jesus\", but that has no obvious resemblance to Bates' song, and so I'm going to assume that the song was totally original.\n\nAs well as bringing the song, Bates also brought the fledgling group a name -- he had a daughter, Crystal Bates, after whom the group named themselves.\n\nThe newly-named Crystals took their song to the offices of Hill and Range Music, which as well as being a publishing company also owned Big Top Records, the label that had put out the original version of \"Twist and Shout\", which had so annoyed Bert Berns. And it was there that they ended up meeting up with Phil Spector.\n\nAfter leaving his role at Atlantic, Spector had started working as a freelance producer, including working for Big Top. According to Spector -- a notorious liar, it's important to remember -- he worked during this time on dozens of hits for which he didn't get any credit, just to earn money. But we do know about some of the records he produced during this time. For example, there was one by a new singer called Gene Pitney. Pitney had been knocking around for years, recording for Decca as part of a duo called Jamie and Jane:\n\n[Excerpt: Jamie and Jane, \"Faithful Our Love\"]\n\nAnd for Blaze Records as Billy Bryan:\n\n[Excerpt: Billy Bryan, \"Going Back to My Love\"]\n\nBut he'd recently signed to Musicor, a label owned by Aaron Schroeder, and had recorded a hit under his own name. Pitney had written \"(I Wanna) Love My Life Away\", and had taken advantage of the new multitracking technology to record his vocals six times over, creating a unique sound that took the record into the top forty:\n\n[Excerpt: Gene Pitney, \"(I Wanna) Love My Life Away\"]\n\nBut while that had been a hit, his second single for Musicor was a flop, and so for the third single, Musicor decided to pull out the big guns. They ran a session at which basically the whole of the Brill Building turned up. Leiber and Stoller were to produce a song they'd written for Pitney, the new hot husband-and-wife songwriting team of Barry Mann and Cynthia Weil were there, as was Burt Bacharach, and so were Goffin and King, who wrote the song that *Spector* was to produce for Pitney. All of them were in the control booth, and all of them were chipping in ideas. As you might expect with that many cooks, the session did not go smoothly, and to make matters worse, Pitney was suffering from a terrible cold. The session ended up costing thirteen thousand dollars, at a time when an average recording session cost five hundred dollars.\n\nOn the song Spector was producing on that session, Goffin and King's \"Every Breath I Take\", Pitney knew that with the cold he would be completely unable to hit the last note in full voice, and went into falsetto. Luckily, everyone thought it sounded good, and he could pretend it was deliberate, rather than the result of necessity:\n\n[Excerpt: Gene Pitney, \"Every Breath I Take\"]\n\nThe record only went to number forty-two, but it resuscitated Pitney's singing career, and forged a working relationship between the two men. But soon after that, Spector had flown back to LA to work with his old friend Lester Sill. Sill and producer/songwriter, Lee Hazelwood, had been making records with the guitarist Duane Eddy, producing a string of hits like “Rebel Rouser”:\n\n[Excerpt: Duane Eddy, \"Rebel Rouser\"]\n\nBut Eddy had recently signed directly to a label, rather than going through Sill and Hazelwood's company as before, and so Sill and Hazelwood had been looking for new artists, and they'd recently signed a group called the Paris Sisters to their production company. Sill had decided to get Spector in to produce the group, and Spector came up with a production that Sill was sure would be a hit, on a song called \"I Love How You Love Me\", written by Barry Mann with another writer called Jack Keller:\n\n[Excerpt: The Paris Sisters, \"I Love How You Love Me\"]\n\nSpector was becoming a perfectionist -- he insisted on recording the rhythm track for that record at one studio, and the string part at another, and apparently spent fifty hours on the mix -- and Sill was spending more and more time in the studio with Spector, fascinated at his attitude to the work he was doing. This led to a breakup between Sill and Hazelwood -- their business relationship was already strained, but Hazelwood got jealous of all the time that Sill was spending with Spector, and decided to split their partnership and go and produce Duane Eddy, without Sill, at Eddy's new label.\n\nSo Sill was suddenly in the market for a new business partner, and he and Spector decided that they were going to start up their own label, Philles, although by this point everyone who had ever worked with Spector was warning Sill that it was a bad idea to go into business with him.\n\nBut Spector and Sill kept their intentions secret for a while, and so when Spector met the Crystals at Hill and Range's offices, everyone at Hill and Range just assumed that he was still working for them as a freelance producer, and that the Crystals were going to be recording for Big Top.\n\nFreddie Bienstock of Hill & Range later said, \"We were very angry because we felt they were Big Top artists. He was merely supposed to produce them for us. There was no question about the fact that he was just rehearsing them for Big Top—hell, he rehearsed them for weeks in our offices. And then he just stole them right out of here. That precipitated a breach of contract with us. We were just incensed because that was a terrific group, and for him to do that shows the type of character he was. We felt he was less than ethical, and, obviously, he was then shown the door.”\n\nBienstock had further words for Spector too, ones I can't repeat here because of content rules about adult language, but they weren't flattering. Spector had been dating Bienstock's daughter, with Bienstock's approval, but that didn't last once Spector betrayed Bienstock.\n\nBut Spector didn't care. He had his own New York girl group, one that could compete with the Bobbettes or the Chantels or the Shirelles, and he was going to make the Crystals as big as any of them, and he wasn't going to cut Big Top in. He slowed down \"There's No Other Like My Baby\" and it became the first release on Philles Records, with Barbara Alston singing lead:\n\n[Excerpt: The Crystals, \"There's No Other Like My Baby\"]\n\nThat record was cut late at night in June 1961. In fact it was cut on Prom Night -- three of the girls came straight to the session from their High School prom, still wearing their prom dresses. Spector wrote the B-side, a song that was originally intended to be the A-side called \"Oh Yeah, Maybe Baby\", but everyone quickly realised that \"There's No Other Like My Baby\" was the hit, and it made the top twenty.\n\nWhile Spector was waiting for the money to come in on the first Philles record, he took another job, with Liberty Records, working for his friend Snuff Garrett. He got a thirty thousand dollar advance, made a single flop record with them with an unknown singer named Obrey Wilson, and then quit, keeping his thirty thousand dollars.\n\nOnce \"There's No Other\" made the charts, Spector took the Crystals into the studio again, to record a song by Barry Mann and Cynthia Weil that he'd got from Aldon Music. Spector was becoming increasingly convinced that he'd made a mistake in partnering with Lester Sill, and he should really have been working with Don Kirshner, and he was in discussions with Kirshner which came to nothing about them having some sort of joint project.\n\nWhile those discussions fell through, almost all the songs that Spector would use for the next few years would come from Aldon songwriters, and \"Uptown\" was a perfect example of the new kind of socially-relevant pop songwriting that had been pioneered by Goffin and King, but which Mann and Weil were now making their own. Before becoming a professional songwriter, Weil had been part of the Greenwich Village folk scene, and while she wasn't going to write anything as explicitly political as the work of Pete Seeger, she thought that songs should at least try to be about the real world.\n\n\"Uptown\" was the first example of a theme which would become a major motif for the Crystals' records -- a song about a man who is looked down upon by society, but who the singer believes is better than his reputation. Mann and Weil's song combined that potent teen emotion with an inspiration Weil had had, seeing a handsome Black man pushing a hand truck in the Garment District, and realising that even though he was oppressed by his job, and \"a nobody\" when he was working downtown, he was still somebody when he was at home. They originally wrote the song for Tony Orlando to sing, but Spector insisted, rightly, that the song worked better with female voices, and that the Crystals should do it.\n\nSpector took Mann and Weil's song and gave it a production that evoked the Latin feel of Leiber and Stoller's records for the Drifters:\n\n[Excerpt: The Crystals, \"Uptown\"]\n\nBy the time of this second record, the Crystals had already been through one lineup change. As soon as she left school, Myrna Giraud got married, and she didn't want to perform on stage any more. She would still sing with the girls in the studio for a little while -- she's on every track of their first album, though she left altogether soon after this recording -- but she was a married woman now and didn't want to be in a group.\n\nThe girls needed a replacement, and they also needed something else -- a lead singer. All the girls loved singing, but none of them wanted to be out in front singing lead. Luckily, Dee Dee Kenniebrew's mother was a secretary at the school attended by a fourteen-year-old gospel singer named La La Brooks, and she heard Brooks singing and invited her to join the group. Brooks soon became the group's lead vocalist on stage.\n\nBut in the studio, Spector didn't want to use her as the lead vocalist. He insisted on Barbara singing the lead on \"Uptown\", but in a sign of things to come, Mann and Weil weren't happy with her performance -- Spector had to change parts of the melody to accommodate her range -- and they begged Spector to rerecord the lead vocal with Little Eva singing. However, Eva became irritated with Spector's incessant demands for more takes and his micromanagement, cursed him out, and walked out of the studio.\n\nThe record was released with Barbara's original lead vocal, and while Mann and Weil weren't happy with that, listeners were, as it went to number thirteen on the charts:\n\n[Excerpt: The Crystals, \"Uptown\"]\n\nLittle Eva later released her own version of the song, on the Dimension Dolls compilation we talked about in the episode on \"The Loco-Motion\":\n\n[Excerpt: Little Eva, \"Uptown\"]\n\nIt was Little Eva who inspired the next Crystals single, as well -- as we talked about in the episode on her, she inspired a truly tasteless Goffin and King song called \"He Hit Me And It Felt Like A Kiss\", which I will not be excerpting, but which was briefly released as the Crystals' third single, before being withdrawn after people objected to hearing teenage girls sing about how romantic and loving domestic abuse is.\n\nThere seems to be some suggestion that the record was released partly as a way for Spector to annoy Lester Sill, who by all accounts was furious at the release. Spector was angry at Sill over the amount of money he'd made from the Paris Sisters recordings, and decided that he was being treated unfairly and wanted to force Sill out of their partnership. Certainly the next recording by the Crystals was meant to get rid of some other business associates. Two of Philles' distributors had a contract which said they were entitled to the royalties on two Crystals singles. So the second one was a ten-minute song called \"The Screw\", split over two sides of a disc, which sounded like this:\n\n[Excerpt: The Crystals, \"The Screw\"]\n\nOnly a handful of promotional copies of that were ever produced. One went to Lester Sill, who by this point had been bought out of his share of the company for a small fraction of what it was worth.\n\nThe last single Spector recorded for Philles while Sill was still involved with the label was another Crystals record, one that had the involvement of many people Sill had brought into Spector's orbit, and who would continue working with him long after the two men stopped working together. Spector had decided he was going to start recording in California again, and two of Sill's assistants would become regular parts of Spector's new hit-making machine.\n\nThe first of these was a composer and arranger called Jack Nitzsche, who we'll be seeing a lot more of in this podcast over the next couple of years, in some unexpected places. Nitzsche was a young songwriter, whose biggest credit up to this point was a very minor hit for Preston Epps, \"Bongo, Bongo, Bongo\":\n\n[Excerpt: Preston Epps, \"Bongo Bongo Bongo\"]\n\nNitzsche would become Spector's most important collaborator, and his arrangements, as much as Spector's production, are what characterise the \"Wall of Sound\" for which Spector would become famous.\n\nThe other assistant of Sill's who became important to Spector's future was a saxophone player named Steve Douglas. We've seen Douglas before, briefly, in the episode on \"LSD-25\" -- he played in the original lineup of Kip and the Flips, one of the groups we talked about in that episode. He'd left Kip and the Flips to join Duane Eddy's band, and it was through Eddy that he had started working with Sill, when he played on many of Eddy's hits, most famously \"Peter Gunn\":\n\n[Excerpt: Duane Eddy, \"Peter Gunn\"]\n\nDouglas was the union contractor for the session, and for most of the rest of Spector's sixties sessions. This is something we've not talked about previously, but when we look at records produced in LA for the next few years, in particular, it's something that will come up a lot. When a producer wanted to make records at the time, he (for they were all men) would not contact all the musicians himself. Instead, he'd get in touch with a trusted musician and say \"I have a session at three o'clock. I need two guitars, bass, drums, a clarinet and a cello\" (or whatever combination of instruments), and sometimes might say, \"If you can get this particular player, that would be good\". The musician would then find out which other musicians were available, get them into the studio, and file the forms which made sure they got paid according to union rules. The contractor, not the producer, decided who was going to play on the session.\n\nIn the case of this Crystals session, Spector already had a couple of musicians in mind -- a bass player named Ray Pohlman, and his old guitar teacher Howard Roberts, a jazz guitarist who had played on \"To Know Him is to Love Him\" and \"I Love How You Love Me\" for Spector already. But Spector wanted a *big* sound -- he wanted the rhythm instruments doubled, so there was a second bass player, Jimmy Bond, and a second guitarist, Tommy Tedesco. Along with them and Douglas were piano player Al de Lory and drummer Hal Blaine. This was the first session on which Spector used any of these musicians, and with the exception of Roberts, who hated working on Spector's sessions and soon stopped, this group put together by Douglas would become the core of what became known as \"The Wrecking Crew\", a loose group of musicians who would play on a large number of the hit records that would come out of LA in the sixties.\n\nSpector also had a guaranteed hit song -- one by Gene Pitney.\n\nWhile Pitney wrote few of his own records, he'd established himself a parallel career as a writer for other people. He'd written \"Today's Teardrops\", the B-side of Roy Orbison's hit \"Blue Angel\":\n\n[Excerpt: Roy Orbison, \"Today's Teardrops\"]\n\nAnd had followed that up with a couple of the biggest hits of the early sixties, Bobby Vee's \"Rubber Ball\":\n\n[Excerpt: Bobby Vee, \"Rubber Ball\"]\n\nAnd Ricky Nelson's \"Hello Mary Lou\":\n\n[Excerpt: Ricky Nelson, \"Hello, Mary Lou\"]\n\nPitney had written a song, \"He's a Rebel\", that was very strongly inspired by \"Uptown\", and Aaron Schroeder, Pitney's publisher, had given the song to Spector. But Spector knew Schroeder, and knew that when he gave you a song, he was going to give it to every other producer who came knocking as well. \"He's a Rebel\" was definitely going to be a massive hit for someone, and he wanted it to be for the Crystals. He phoned them up and told them to come out to LA to record the song. And they said no.\n\nThe Crystals had become sick of Spector. He'd made them record songs like \"He Hit Me and it Felt Like a Kiss\", he'd refused to let their lead singer sing lead, and they'd not seen any money from their two big hits. They weren't going to fly from New York to LA just because he said so.\n\nSpector needed a new group, in LA, that he could record doing the song before someone else did it. He could use the Crystals' name -- Philles had the right to put out records by whoever they liked and call it the Crystals -- he just needed a group.\n\nHe found one in the Blossoms, a group who had connections to many of the people Spector was working with. Jack Nitzsche's wife sometimes sang with them on sessions, and they'd also sung on a Duane Eddy record that Lester Sill had worked on, \"Dance With the Guitar Man\", where they'd been credited as the Rebelettes:\n\n[Excerpt: Duane Eddy, \"Dance With the Guitar Man\"]\n\nThe Blossoms had actually been making records in LA for nearly eight years at this point. They'd started out as the Dreamers, one of the many groups who'd been discovered by Johnny Otis, back in the early fifties, and had also been part of the scene around the Penguins, one of whom went to school with some of the girls. They started out as a six-piece group, but slimmed down to a quartet after their first record, on which they were the backing group for Richard Berry:\n\n[Excerpt: Richard Berry, \"At Last\"]\n\nThe first stable lineup of the Dreamers consisted of Fanita James, Gloria Jones (not the one who would later record \"Tainted Love\"), and the twin sisters Annette and Nanette Williams. They worked primarily with Berry, backing him on five singles in the mid fifties, and also recording songs he wrote for them under their own name, like \"Do Not Forget\", which actually featured another singer, Jennell Hawkins, on lead:\n\n[Excerpt: The Dreamers, \"Do Not Forget\"]\n\nThey also sang backing vocals on plenty of other R&B records from people in the LA R&B scene -- for example it's them singing backing vocals, with Jesse Belvin, on Etta James' \"Good Rocking Daddy\":\n\n[Excerpt: Etta James, \"Good Rocking Daddy\"]\n\nThe group signed to Capitol Records in 1957, but not under the name The Dreamers -- an executive there said that they all had different skin tones and it made them look like flowers, so they became the Blossoms. They were only at Capitol for a year, but during that time an important lineup change happened -- Nanette quit the group and was replaced by a singer called Darlene Wright.\n\nFrom that point on The Blossoms was the main name the group went under, though they also recorded under other names, for example using the name The Playgirls to record \"Gee But I'm Lonesome\", a song written by Bruce Johnston, who was briefly dating Annette Williams at the time:\n\n[Excerpt: The Playgirls, \"Gee But I'm Lonesome\"]\n\nBy 1961 Annette had left the group, and they were down to a trio of Fanita, Gloria, and Darlene. Their records, under whatever name, didn't do very well, but they became the first-call session singers in LA, working on records by everyone from Sam Cooke to Gene Autry.\n\nSo it was the Blossoms who were called on in late 1962 to record \"He's a Rebel\", and it was Darlene Wright who earned her session fee, and no royalties, for singing the lead on a number one record:\n\n[Excerpt: The \"Crystals\" (The Blossoms), \"He's a Rebel\"]\n\nFrom that point on, the Blossoms would sing on almost every Spector session for the next three years, and Darlene, who he renamed Darlene Love, would become Spector's go-to lead vocalist for records under her own name, the Blossoms, Bob B. Soxx and the Blue Jeans, and the Crystals.\n\nIt was lucky for Spector that he decided to go this route rather than wait for the Crystals, not only because it introduced him to the Blossoms, but because &nbsp;he'd been right about Aaron Schroeder. As Spector and Sill sat together in the studio where they were mastering the record, some musicians on a break from the studio next door wandered in, and said, \"Hey man. we were just playing the same goddam song!\"\n\nLiterally in the next room as Spector mastered the record, his friend Snuff Garrett was producing Vicki Carr singing \"He's a Rebel\":\n\n[Excerpt: Vicki Carr, \"He's a Rebel\"]\n\nPhilles got their version out first, and Carr's record sank without trace, while \"The Crystals\" went to number one, keeping the song's writer off the top spot, as Gene Pitney sat at number two with a Bacharach and David song, \"Only Love Can Break a Heart\":\n\n[Excerpt: Gene Pitney, \"Only Love Can Break a Heart\"]\n\nThe Crystals were shocked that Spector released a Crystals record without any of them on it, but La La Brooks had a similar enough voice to Darlene Love's that they were able to pull the song off live. They had a bit more of a problem with the follow-up, also by the Blossoms but released as the Crystals:\n\n[Excerpt: \"The Crystals\"/The Blossoms, \"He's Sure the Boy I Love\"]\n\nLa La could sing that fine, but she had to work on the spoken part -- Darlene was from California and La La had a thick Brooklyn accent. She managed it, just about.\n\nAs La La was doing such a good job of singing Darlene Love's parts live -- and, more importantly, as she was only fifteen and so didn't complain about things like royalties -- the Crystals finally did get their way and have La La start singing the leads on their singles, starting with \"Da Doo Ron Ron\". The problem is, none of the other Crystals were on those records -- it was La La singing with the Blossoms, plus other session singers. Listen out for the low harmony in \"Da Doo Ron Ron\" and see if you recognise the voice:\n\n[Excerpt: The Crystals, \"Da Doo Ron Ron\"]\n\nCher would later move on to bigger things than being a fill-in Crystal.\n\n\"Da Doo Ron Ron\" became another big hit, making number three in the charts, and the follow-up, \"Then He Kissed Me\", with La La once again on lead vocals, also made the top ten, but the group were falling apart -- Spector was playing La La off against the rest of the group, just to cause trouble, and he'd also lost interest in them once he discovered another group, The Ronettes, who we'll be hearing more about in future episodes. The singles following \"Then He Kissed Me\" barely scraped the bottom of the Hot One Hundred, and the group left Philles in 1964. They got a payoff of five thousand dollars, in lieu of all future royalties on any of their recordings.\n\nThey had no luck having hits without Spector, and one by one the group members left, and the group split up by 1966. Mary, Barbara, and Dee Dee briefly reunited as the Crystals in 1971, and La La and Dee Dee made an album together in the eighties of remakes of the group's hits, but nothing came of any of these. Dee Dee continues to tour under the Crystals name in North America, while La La performs solo in America and under the Crystals name in Europe. Barbara, the lead singer on the group's first hits, died in 2018. Darlene Love continues to perform, but we'll hear more about her and the Blossoms in future episodes, I'm sure.\n\nThe Crystals were treated appallingly by Spector, and are not often treated much better by the fans, who see them as just interchangeable parts in a machine created by a genius. But it should be remembered that they were the ones who brought Spector the song that became the first Philles hit, that both Barbara and La La were fine singers who sang lead on classic hit records, and that Spector taking all the credit for a team effort doesn't mean he deserved it. Both the Crystals and the Blossoms deserved better than to have their identities erased in return for a flat session fee, in order to service the ego of one man.",
  "itunes:subtitle": "Episode 104 of A History of Rock Music in Five Hundred Songs looks at Hes a Rebel, and how a song recorded by the Blossoms was released under the name of the Crystals.&nbsp; Click the full post to read liner notes, links to more information, and a transc",
  "itunes:keywords": "Aaron Schroeder,Aldon Music,Barry Mann,Big Top Records,Brill Building,Carole King,Cher,Cynthia Weil,Darlene Love,Don Kirshner,Duane Eddy,Freddy Bienstock,Gene Pitney,Gerry Goffin,girl groups,Hill and Range publishing,Jack Nitzsche,Lee Hazlewood,Lester Sill,Liberty Records,Little Eva,Phil Spector,Philles Records,Richard Berry,Snuff Garrett,Steve Douglas,The Blossoms,The Crystals,The Wrecking Crew,vocal groups",
  "itunes:episodeType": "full",
  "itunes:episode": 104,
  "content:encoded": "Episode 104 of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"He's a Rebel\", and how a song recorded by the Blossoms was released under the name of the Crystals.&nbsp; Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/43960582\">on \"Sukiyaki\" by Kyu Sakamoto.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-104-hes-a-rebel/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\nA lot of resources were used for this episode.\n\nThe material on Gene Pitney mostly comes from his page on <a href=\"http://tims.blackcat.nl/\">This is My Story</a>.\n\n<a href=\"https://amzn.to/325o24w\">Always Magic in the Air: The Bomp and Brilliance of the Brill Building Era</a> by Ken Emerson is a good overview of the Brill Building scene.\n\n<a href=\"https://amzn.to/3iOneXx\">Girl Groups</a> by John Clemente contains potted biographies of many groups of the era, including articles on both The Crystals and the Blossoms.\n\nI've referred to two biographies of Spector in this episode,&nbsp;<a href=\"https://amzn.to/35C05CU\"><em>Phil Spector: Out of His Head</em> by Richard Williams</a> and&nbsp;<a href=\"https://amzn.to/32OKWMK\"><em>He's a Rebel</em> by Mark Ribkowsky</a>.\n\nAnd information on the Wrecking Crew largely comes from&nbsp;<a href=\"https://amzn.to/35FhkUh\"><em>The Wrecking Crew&nbsp;</em>by Kent Hartman</a>.\n\nThere are many compilations available with some of the hits Spector produced, but I recommend getting<a href=\"https://amzn.to/3lOXT0V\">&nbsp;<em>Back to Mono</em></a>, a four-CD overview of his career containing all the major singles put out by Philles.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nA brief note -- there are some very brief mentions of domestic abuse here. Nothing I think will upset anyone, but you might want to check the transcript if you're at all unsure.\n\nUp to this point, whenever we've looked at a girl group, it's been at one that had, to a greater or lesser extent, some control over their own career. Groups like the Marvelettes, the Chantels, and the Bobbettes all wrote their own material, at least at first, and had distinctive personalities before they ever made a record.\n\nBut today, we're going to look at a group whose identity was so subsumed in that of their producer that the record we're looking at was released under the name of a different group from the one that recorded it. We're going to look at \"He's a Rebel\", which was recorded by the Blossoms and released by the Crystals.\n\n[Excerpt: “The Crystals” (The Blossoms), \"He's a Rebel\"]\n\nThe Crystals, from their very beginnings, were intended as a vehicle for the dreams of men, rather than for their own ambitions. Whereas the girl groups we've looked at so far all formed as groups of friends at school before they moved into professional singing, the Crystals were put together by a man named Benny Wells. Wells had a niece, Barbara Alston, who sang with a couple of her schoolfriends, Mary Thomas and Myrna Giraud. Wells put those three together with two other girls, Dee Dee Kenniebrew and Patsy Wright, to form a five-piece vocal group. Wells seems not to have had much concept of what was in the charts at the time -- the descriptions of the music he had the girls singing talk about him wanting them to sound like the Modernaires, the vocal group who sang with Glenn Miller's band in the early 1940s.\n\nBut the girls went along with Wells, and Wells had good enough ears to recognise a hit when one was brought to him -- and one was brought to him by Patsy Wright's brother-in-law, Leroy Bates. Bates had written a song called \"There's No Other Like My Baby\", and Wells could tell it had potential. Incidentally, some books say that the song was based on a gospel song called \"There's No Other Like My Jesus\", and that claim is repeated on Wikipedia, but I can't find any evidence of a song of that name other than people talking about \"There's No Other Like My Baby\". There is a gospel song called \"There's No Other Name Like Jesus\", but that has no obvious resemblance to Bates' song, and so I'm going to assume that the song was totally original.\n\nAs well as bringing the song, Bates also brought the fledgling group a name -- he had a daughter, Crystal Bates, after whom the group named themselves.\n\nThe newly-named Crystals took their song to the offices of Hill and Range Music, which as well as being a publishing company also owned Big Top Records, the label that had put out the original version of \"Twist and Shout\", which had so annoyed Bert Berns. And it was there that they ended up meeting up with Phil Spector.\n\nAfter leaving his role at Atlantic, Spector had started working as a freelance producer, including working for Big Top. According to Spector -- a notorious liar, it's important to remember -- he worked during this time on dozens of hits for which he didn't get any credit, just to earn money. But we do know about some of the records he produced during this time. For example, there was one by a new singer called Gene Pitney. Pitney had been knocking around for years, recording for Decca as part of a duo called Jamie and Jane:\n\n[Excerpt: Jamie and Jane, \"Faithful Our Love\"]\n\nAnd for Blaze Records as Billy Bryan:\n\n[Excerpt: Billy Bryan, \"Going Back to My Love\"]\n\nBut he'd recently signed to Musicor, a label owned by Aaron Schroeder, and had recorded a hit under his own name. Pitney had written \"(I Wanna) Love My Life Away\", and had taken advantage of the new multitracking technology to record his vocals six times over, creating a unique sound that took the record into the top forty:\n\n[Excerpt: Gene Pitney, \"(I Wanna) Love My Life Away\"]\n\nBut while that had been a hit, his second single for Musicor was a flop, and so for the third single, Musicor decided to pull out the big guns. They ran a session at which basically the whole of the Brill Building turned up. Leiber and Stoller were to produce a song they'd written for Pitney, the new hot husband-and-wife songwriting team of Barry Mann and Cynthia Weil were there, as was Burt Bacharach, and so were Goffin and King, who wrote the song that *Spector* was to produce for Pitney. All of them were in the control booth, and all of them were chipping in ideas. As you might expect with that many cooks, the session did not go smoothly, and to make matters worse, Pitney was suffering from a terrible cold. The session ended up costing thirteen thousand dollars, at a time when an average recording session cost five hundred dollars.\n\nOn the song Spector was producing on that session, Goffin and King's \"Every Breath I Take\", Pitney knew that with the cold he would be completely unable to hit the last note in full voice, and went into falsetto. Luckily, everyone thought it sounded good, and he could pretend it was deliberate, rather than the result of necessity:\n\n[Excerpt: Gene Pitney, \"Every Breath I Take\"]\n\nThe record only went to number forty-two, but it resuscitated Pitney's singing career, and forged a working relationship between the two men. But soon after that, Spector had flown back to LA to work with his old friend Lester Sill. Sill and producer/songwriter, Lee Hazelwood, had been making records with the guitarist Duane Eddy, producing a string of hits like “Rebel Rouser”:\n\n[Excerpt: Duane Eddy, \"Rebel Rouser\"]\n\nBut Eddy had recently signed directly to a label, rather than going through Sill and Hazelwood's company as before, and so Sill and Hazelwood had been looking for new artists, and they'd recently signed a group called the Paris Sisters to their production company. Sill had decided to get Spector in to produce the group, and Spector came up with a production that Sill was sure would be a hit, on a song called \"I Love How You Love Me\", written by Barry Mann with another writer called Jack Keller:\n\n[Excerpt: The Paris Sisters, \"I Love How You Love Me\"]\n\nSpector was becoming a perfectionist -- he insisted on recording the rhythm track for that record at one studio, and the string part at another, and apparently spent fifty hours on the mix -- and Sill was spending more and more time in the studio with Spector, fascinated at his attitude to the work he was doing. This led to a breakup between Sill and Hazelwood -- their business relationship was already strained, but Hazelwood got jealous of all the time that Sill was spending with Spector, and decided to split their partnership and go and produce Duane Eddy, without Sill, at Eddy's new label.\n\nSo Sill was suddenly in the market for a new business partner, and he and Spector decided that they were going to start up their own label, Philles, although by this point everyone who had ever worked with Spector was warning Sill that it was a bad idea to go into business with him.\n\nBut Spector and Sill kept their intentions secret for a while, and so when Spector met the Crystals at Hill and Range's offices, everyone at Hill and Range just assumed that he was still working for them as a freelance producer, and that the Crystals were going to be recording for Big Top.\n\nFreddie Bienstock of Hill & Range later said, \"We were very angry because we felt they were Big Top artists. He was merely supposed to produce them for us. There was no question about the fact that he was just rehearsing them for Big Top—hell, he rehearsed them for weeks in our offices. And then he just stole them right out of here. That precipitated a breach of contract with us. We were just incensed because that was a terrific group, and for him to do that shows the type of character he was. We felt he was less than ethical, and, obviously, he was then shown the door.”\n\nBienstock had further words for Spector too, ones I can't repeat here because of content rules about adult language, but they weren't flattering. Spector had been dating Bienstock's daughter, with Bienstock's approval, but that didn't last once Spector betrayed Bienstock.\n\nBut Spector didn't care. He had his own New York girl group, one that could compete with the Bobbettes or the Chantels or the Shirelles, and he was going to make the Crystals as big as any of them, and he wasn't going to cut Big Top in. He slowed down \"There's No Other Like My Baby\" and it became the first release on Philles Records, with Barbara Alston singing lead:\n\n[Excerpt: The Crystals, \"There's No Other Like My Baby\"]\n\nThat record was cut late at night in June 1961. In fact it was cut on Prom Night -- three of the girls came straight to the session from their High School prom, still wearing their prom dresses. Spector wrote the B-side, a song that was originally intended to be the A-side called \"Oh Yeah, Maybe Baby\", but everyone quickly realised that \"There's No Other Like My Baby\" was the hit, and it made the top twenty.\n\nWhile Spector was waiting for the money to come in on the first Philles record, he took another job, with Liberty Records, working for his friend Snuff Garrett. He got a thirty thousand dollar advance, made a single flop record with them with an unknown singer named Obrey Wilson, and then quit, keeping his thirty thousand dollars.\n\nOnce \"There's No Other\" made the charts, Spector took the Crystals into the studio again, to record a song by Barry Mann and Cynthia Weil that he'd got from Aldon Music. Spector was becoming increasingly convinced that he'd made a mistake in partnering with Lester Sill, and he should really have been working with Don Kirshner, and he was in discussions with Kirshner which came to nothing about them having some sort of joint project.\n\nWhile those discussions fell through, almost all the songs that Spector would use for the next few years would come from Aldon songwriters, and \"Uptown\" was a perfect example of the new kind of socially-relevant pop songwriting that had been pioneered by Goffin and King, but which Mann and Weil were now making their own. Before becoming a professional songwriter, Weil had been part of the Greenwich Village folk scene, and while she wasn't going to write anything as explicitly political as the work of Pete Seeger, she thought that songs should at least try to be about the real world.\n\n\"Uptown\" was the first example of a theme which would become a major motif for the Crystals' records -- a song about a man who is looked down upon by society, but who the singer believes is better than his reputation. Mann and Weil's song combined that potent teen emotion with an inspiration Weil had had, seeing a handsome Black man pushing a hand truck in the Garment District, and realising that even though he was oppressed by his job, and \"a nobody\" when he was working downtown, he was still somebody when he was at home. They originally wrote the song for Tony Orlando to sing, but Spector insisted, rightly, that the song worked better with female voices, and that the Crystals should do it.\n\nSpector took Mann and Weil's song and gave it a production that evoked the Latin feel of Leiber and Stoller's records for the Drifters:\n\n[Excerpt: The Crystals, \"Uptown\"]\n\nBy the time of this second record, the Crystals had already been through one lineup change. As soon as she left school, Myrna Giraud got married, and she didn't want to perform on stage any more. She would still sing with the girls in the studio for a little while -- she's on every track of their first album, though she left altogether soon after this recording -- but she was a married woman now and didn't want to be in a group.\n\nThe girls needed a replacement, and they also needed something else -- a lead singer. All the girls loved singing, but none of them wanted to be out in front singing lead. Luckily, Dee Dee Kenniebrew's mother was a secretary at the school attended by a fourteen-year-old gospel singer named La La Brooks, and she heard Brooks singing and invited her to join the group. Brooks soon became the group's lead vocalist on stage.\n\nBut in the studio, Spector didn't want to use her as the lead vocalist. He insisted on Barbara singing the lead on \"Uptown\", but in a sign of things to come, Mann and Weil weren't happy with her performance -- Spector had to change parts of the melody to accommodate her range -- and they begged Spector to rerecord the lead vocal with Little Eva singing. However, Eva became irritated with Spector's incessant demands for more takes and his micromanagement, cursed him out, and walked out of the studio.\n\nThe record was released with Barbara's original lead vocal, and while Mann and Weil weren't happy with that, listeners were, as it went to number thirteen on the charts:\n\n[Excerpt: The Crystals, \"Uptown\"]\n\nLittle Eva later released her own version of the song, on the Dimension Dolls compilation we talked about in the episode on \"The Loco-Motion\":\n\n[Excerpt: Little Eva, \"Uptown\"]\n\nIt was Little Eva who inspired the next Crystals single, as well -- as we talked about in the episode on her, she inspired a truly tasteless Goffin and King song called \"He Hit Me And It Felt Like A Kiss\", which I will not be excerpting, but which was briefly released as the Crystals' third single, before being withdrawn after people objected to hearing teenage girls sing about how romantic and loving domestic abuse is.\n\nThere seems to be some suggestion that the record was released partly as a way for Spector to annoy Lester Sill, who by all accounts was furious at the release. Spector was angry at Sill over the amount of money he'd made from the Paris Sisters recordings, and decided that he was being treated unfairly and wanted to force Sill out of their partnership. Certainly the next recording by the Crystals was meant to get rid of some other business associates. Two of Philles' distributors had a contract which said they were entitled to the royalties on two Crystals singles. So the second one was a ten-minute song called \"The Screw\", split over two sides of a disc, which sounded like this:\n\n[Excerpt: The Crystals, \"The Screw\"]\n\nOnly a handful of promotional copies of that were ever produced. One went to Lester Sill, who by this point had been bought out of his share of the company for a small fraction of what it was worth.\n\nThe last single Spector recorded for Philles while Sill was still involved with the label was another Crystals record, one that had the involvement of many people Sill had brought into Spector's orbit, and who would continue working with him long after the two men stopped working together. Spector had decided he was going to start recording in California again, and two of Sill's assistants would become regular parts of Spector's new hit-making machine.\n\nThe first of these was a composer and arranger called Jack Nitzsche, who we'll be seeing a lot more of in this podcast over the next couple of years, in some unexpected places. Nitzsche was a young songwriter, whose biggest credit up to this point was a very minor hit for Preston Epps, \"Bongo, Bongo, Bongo\":\n\n[Excerpt: Preston Epps, \"Bongo Bongo Bongo\"]\n\nNitzsche would become Spector's most important collaborator, and his arrangements, as much as Spector's production, are what characterise the \"Wall of Sound\" for which Spector would become famous.\n\nThe other assistant of Sill's who became important to Spector's future was a saxophone player named Steve Douglas. We've seen Douglas before, briefly, in the episode on \"LSD-25\" -- he played in the original lineup of Kip and the Flips, one of the groups we talked about in that episode. He'd left Kip and the Flips to join Duane Eddy's band, and it was through Eddy that he had started working with Sill, when he played on many of Eddy's hits, most famously \"Peter Gunn\":\n\n[Excerpt: Duane Eddy, \"Peter Gunn\"]\n\nDouglas was the union contractor for the session, and for most of the rest of Spector's sixties sessions. This is something we've not talked about previously, but when we look at records produced in LA for the next few years, in particular, it's something that will come up a lot. When a producer wanted to make records at the time, he (for they were all men) would not contact all the musicians himself. Instead, he'd get in touch with a trusted musician and say \"I have a session at three o'clock. I need two guitars, bass, drums, a clarinet and a cello\" (or whatever combination of instruments), and sometimes might say, \"If you can get this particular player, that would be good\". The musician would then find out which other musicians were available, get them into the studio, and file the forms which made sure they got paid according to union rules. The contractor, not the producer, decided who was going to play on the session.\n\nIn the case of this Crystals session, Spector already had a couple of musicians in mind -- a bass player named Ray Pohlman, and his old guitar teacher Howard Roberts, a jazz guitarist who had played on \"To Know Him is to Love Him\" and \"I Love How You Love Me\" for Spector already. But Spector wanted a *big* sound -- he wanted the rhythm instruments doubled, so there was a second bass player, Jimmy Bond, and a second guitarist, Tommy Tedesco. Along with them and Douglas were piano player Al de Lory and drummer Hal Blaine. This was the first session on which Spector used any of these musicians, and with the exception of Roberts, who hated working on Spector's sessions and soon stopped, this group put together by Douglas would become the core of what became known as \"The Wrecking Crew\", a loose group of musicians who would play on a large number of the hit records that would come out of LA in the sixties.\n\nSpector also had a guaranteed hit song -- one by Gene Pitney.\n\nWhile Pitney wrote few of his own records, he'd established himself a parallel career as a writer for other people. He'd written \"Today's Teardrops\", the B-side of Roy Orbison's hit \"Blue Angel\":\n\n[Excerpt: Roy Orbison, \"Today's Teardrops\"]\n\nAnd had followed that up with a couple of the biggest hits of the early sixties, Bobby Vee's \"Rubber Ball\":\n\n[Excerpt: Bobby Vee, \"Rubber Ball\"]\n\nAnd Ricky Nelson's \"Hello Mary Lou\":\n\n[Excerpt: Ricky Nelson, \"Hello, Mary Lou\"]\n\nPitney had written a song, \"He's a Rebel\", that was very strongly inspired by \"Uptown\", and Aaron Schroeder, Pitney's publisher, had given the song to Spector. But Spector knew Schroeder, and knew that when he gave you a song, he was going to give it to every other producer who came knocking as well. \"He's a Rebel\" was definitely going to be a massive hit for someone, and he wanted it to be for the Crystals. He phoned them up and told them to come out to LA to record the song. And they said no.\n\nThe Crystals had become sick of Spector. He'd made them record songs like \"He Hit Me and it Felt Like a Kiss\", he'd refused to let their lead singer sing lead, and they'd not seen any money from their two big hits. They weren't going to fly from New York to LA just because he said so.\n\nSpector needed a new group, in LA, that he could record doing the song before someone else did it. He could use the Crystals' name -- Philles had the right to put out records by whoever they liked and call it the Crystals -- he just needed a group.\n\nHe found one in the Blossoms, a group who had connections to many of the people Spector was working with. Jack Nitzsche's wife sometimes sang with them on sessions, and they'd also sung on a Duane Eddy record that Lester Sill had worked on, \"Dance With the Guitar Man\", where they'd been credited as the Rebelettes:\n\n[Excerpt: Duane Eddy, \"Dance With the Guitar Man\"]\n\nThe Blossoms had actually been making records in LA for nearly eight years at this point. They'd started out as the Dreamers, one of the many groups who'd been discovered by Johnny Otis, back in the early fifties, and had also been part of the scene around the Penguins, one of whom went to school with some of the girls. They started out as a six-piece group, but slimmed down to a quartet after their first record, on which they were the backing group for Richard Berry:\n\n[Excerpt: Richard Berry, \"At Last\"]\n\nThe first stable lineup of the Dreamers consisted of Fanita James, Gloria Jones (not the one who would later record \"Tainted Love\"), and the twin sisters Annette and Nanette Williams. They worked primarily with Berry, backing him on five singles in the mid fifties, and also recording songs he wrote for them under their own name, like \"Do Not Forget\", which actually featured another singer, Jennell Hawkins, on lead:\n\n[Excerpt: The Dreamers, \"Do Not Forget\"]\n\nThey also sang backing vocals on plenty of other R&B records from people in the LA R&B scene -- for example it's them singing backing vocals, with Jesse Belvin, on Etta James' \"Good Rocking Daddy\":\n\n[Excerpt: Etta James, \"Good Rocking Daddy\"]\n\nThe group signed to Capitol Records in 1957, but not under the name The Dreamers -- an executive there said that they all had different skin tones and it made them look like flowers, so they became the Blossoms. They were only at Capitol for a year, but during that time an important lineup change happened -- Nanette quit the group and was replaced by a singer called Darlene Wright.\n\nFrom that point on The Blossoms was the main name the group went under, though they also recorded under other names, for example using the name The Playgirls to record \"Gee But I'm Lonesome\", a song written by Bruce Johnston, who was briefly dating Annette Williams at the time:\n\n[Excerpt: The Playgirls, \"Gee But I'm Lonesome\"]\n\nBy 1961 Annette had left the group, and they were down to a trio of Fanita, Gloria, and Darlene. Their records, under whatever name, didn't do very well, but they became the first-call session singers in LA, working on records by everyone from Sam Cooke to Gene Autry.\n\nSo it was the Blossoms who were called on in late 1962 to record \"He's a Rebel\", and it was Darlene Wright who earned her session fee, and no royalties, for singing the lead on a number one record:\n\n[Excerpt: The \"Crystals\" (The Blossoms), \"He's a Rebel\"]\n\nFrom that point on, the Blossoms would sing on almost every Spector session for the next three years, and Darlene, who he renamed Darlene Love, would become Spector's go-to lead vocalist for records under her own name, the Blossoms, Bob B. Soxx and the Blue Jeans, and the Crystals.\n\nIt was lucky for Spector that he decided to go this route rather than wait for the Crystals, not only because it introduced him to the Blossoms, but because &nbsp;he'd been right about Aaron Schroeder. As Spector and Sill sat together in the studio where they were mastering the record, some musicians on a break from the studio next door wandered in, and said, \"Hey man. we were just playing the same goddam song!\"\n\nLiterally in the next room as Spector mastered the record, his friend Snuff Garrett was producing Vicki Carr singing \"He's a Rebel\":\n\n[Excerpt: Vicki Carr, \"He's a Rebel\"]\n\nPhilles got their version out first, and Carr's record sank without trace, while \"The Crystals\" went to number one, keeping the song's writer off the top spot, as Gene Pitney sat at number two with a Bacharach and David song, \"Only Love Can Break a Heart\":\n\n[Excerpt: Gene Pitney, \"Only Love Can Break a Heart\"]\n\nThe Crystals were shocked that Spector released a Crystals record without any of them on it, but La La Brooks had a similar enough voice to Darlene Love's that they were able to pull the song off live. They had a bit more of a problem with the follow-up, also by the Blossoms but released as the Crystals:\n\n[Excerpt: \"The Crystals\"/The Blossoms, \"He's Sure the Boy I Love\"]\n\nLa La could sing that fine, but she had to work on the spoken part -- Darlene was from California and La La had a thick Brooklyn accent. She managed it, just about.\n\nAs La La was doing such a good job of singing Darlene Love's parts live -- and, more importantly, as she was only fifteen and so didn't complain about things like royalties -- the Crystals finally did get their way and have La La start singing the leads on their singles, starting with \"Da Doo Ron Ron\". The problem is, none of the other Crystals were on those records -- it was La La singing with the Blossoms, plus other session singers. Listen out for the low harmony in \"Da Doo Ron Ron\" and see if you recognise the voice:\n\n[Excerpt: The Crystals, \"Da Doo Ron Ron\"]\n\nCher would later move on to bigger things than being a fill-in Crystal.\n\n\"Da Doo Ron Ron\" became another big hit, making number three in the charts, and the follow-up, \"Then He Kissed Me\", with La La once again on lead vocals, also made the top ten, but the group were falling apart -- Spector was playing La La off against the rest of the group, just to cause trouble, and he'd also lost interest in them once he discovered another group, The Ronettes, who we'll be hearing more about in future episodes. The singles following \"Then He Kissed Me\" barely scraped the bottom of the Hot One Hundred, and the group left Philles in 1964. They got a payoff of five thousand dollars, in lieu of all future royalties on any of their recordings.\n\nThey had no luck having hits without Spector, and one by one the group members left, and the group split up by 1966. Mary, Barbara, and Dee Dee briefly reunited as the Crystals in 1971, and La La and Dee Dee made an album together in the eighties of remakes of the group's hits, but nothing came of any of these. Dee Dee continues to tour under the Crystals name in North America, while La La performs solo in America and under the Crystals name in Europe. Barbara, the lead singer on the group's first hits, died in 2018. Darlene Love continues to perform, but we'll hear more about her and the Blossoms in future episodes, I'm sure.\n\nThe Crystals were treated appallingly by Spector, and are not often treated much better by the fans, who see them as just interchangeable parts in a machine created by a genius. But it should be remembered that they were the ones who brought Spector the song that became the first Philles hit, that both Barbara and La La were fine singers who sang lead on classic hit records, and that Spector taking all the credit for a team effort doesn't mean he deserved it. Both the Crystals and the Blossoms deserved better than to have their identities erased in return for a flat session fee, in order to service the ego of one man.",
  "enclosure": "",
  "itunes:summary": "Episode 104 of A History of Rock Music in Five Hundred Songs looks at \"He's a Rebel\", and how a song recorded by the Blossoms was released under the name of the Crystals.&nbsp; Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Sukiyaki\" by Kyu Sakamoto.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nA lot of resources were used for this episode.\n\nThe material on Gene Pitney mostly comes from his page on This is My Story.\n\nAlways Magic in the Air: The Bomp and Brilliance of the Brill Building Era by Ken Emerson is a good overview of the Brill Building scene.\n\nGirl Groups by John Clemente contains potted biographies of many groups of the era, including articles on both The Crystals and the Blossoms.\n\nI've referred to two biographies of Spector in this episode,&nbsp;Phil Spector: Out of His Head by Richard Williams and&nbsp;He's a Rebel by Mark Ribkowsky.\n\nAnd information on the Wrecking Crew largely comes from&nbsp;The Wrecking Crew&nbsp;by Kent Hartman.\n\nThere are many compilations available with some of the hits Spector produced, but I recommend getting&nbsp;Back to Mono, a four-CD overview of his career containing all the major singles put out by Philles.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nTranscript\n\nA brief note -- there are some very brief mentions of domestic abuse here. Nothing I think will upset anyone, but you might want to check the transcript if you're at all unsure.\n\nUp to this point, whenever we've looked at a girl group, it's been at one that had, to a greater or lesser extent, some control over their own career. Groups like the Marvelettes, the Chantels, and the Bobbettes all wrote their own material, at least at first, and had distinctive personalities before they ever made a record.\n\nBut today, we're going to look at a group whose identity was so subsumed in that of their producer that the record we're looking at was released under the name of a different group from the one that recorded it. We're going to look at \"He's a Rebel\", which was recorded by the Blossoms and released by the Crystals.\n\n[Excerpt: “The Crystals” (The Blossoms), \"He's a Rebel\"]\n\nThe Crystals, from their very beginnings, were intended as a vehicle for the dreams of men, rather than for their own ambitions. Whereas the girl groups we've looked at so far all formed as groups of friends at school before they moved into professional singing, the Crystals were put together by a man named Benny Wells. Wells had a niece, Barbara Alston, who sang with a couple of her schoolfriends, Mary Thomas and Myrna Giraud. Wells put those three together with two other girls, Dee Dee Kenniebrew and Patsy Wright, to form a five-piece vocal group. Wells seems not to have had much concept of what was in the charts at the time -- the descriptions of the music he had the girls singing talk about him wanting them to sound like the Modernaires, the vocal group who sang with Glenn Miller's band in the early 1940s.\n\nBut the girls went along with Wells, and Wells had good enough ears to recognise a hit when one was brought to him -- and one was brought to him by Patsy Wright's brother-in-law, Leroy Bates. Bates had written a song called \"There's No Other Like My Baby\", and Wells could tell it had potential. Incidentally, some books say that the song was based on a gospel song called \"There's No Other Like My Jesus\", and that claim is repeated on Wikipedia, but I can't find any evidence of a song of that name other than people talking about \"There's No Other Like M",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 104 of A History of Rock Music in Five Hundred Songs looks at \"He's a Rebel\", and how a song recorded by the Blossoms was released under the name of the Crystals.&nbsp; Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Sukiyaki\" by Kyu Sakamoto.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nA lot of resources were used for this episode.\n\nThe material on Gene Pitney mostly comes from his page on This is My Story.\n\nAlways Magic in the Air: The Bomp and Brilliance of the Brill Building Era by Ken Emerson is a good overview of the Brill Building sc",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}