{
  "title": "Data Scientists at Work",
  "link": "http://www.erinshellman.com/data-scientists-at-work/",
  "comments": "http://www.erinshellman.com/data-scientists-at-work/#comments",
  "dc:creator": "erinshellman",
  "pubDate": "Fri, 02 Jan 2015 23:22:01 +0000",
  "category": [
    "data science",
    "press",
    "writing"
  ],
  "guid": "http://www.erinshellman.com/?p=145",
  "description": " <a class=\"read-more\" href=\"http://www.erinshellman.com/data-scientists-at-work/\"></a>",
  "content:encoded": "<section class=\"stag-section stag-intro-text\"><p>Data entrepreneur <a href=\"https://www.dashingd3js.com/\">Sebastian Gutierrez</a> recently published <a href=\"http://www.amazon.com/Data-Scientists-Work-Sebastian-Gutierrez/dp/1430265981/\" target=\"_blank\">Data Scientists at Work</a>, which features 16 interviews with data scientists from a variety of industries. I&#8217;m thrilled to be featured in the book and it&#8217;s been amazing to see the final product.  Here are some highlights from my chapter (Excerpted by courtesy of the publisher from <a href=\"http://www.apress.com/9781430265986\"><i>Data Scientists at Work</i></a> by Sebastian Gutierrez.  Apress, 2015).</p>\n</section>\n<hr class=\"stag-section stag-divider stag-divider--dashed\">\n<div class=\"page\" title=\"Page 4\">\n<div class=\"section\">\n<div class=\"layoutArea\">\n<div class=\"column\">\n<p>Gutierrez: Tell me about where you work.</p>\n<p>Shellman: I work at Nordstrom in the Nordstrom Data Lab. It’s an exciting job because in retail, specifically fashion retail, I have the opportunity to work on data applications and problems in lots of areas, including transactional, business operations, clickstream, and seasonal trends in garment colors. Retailers the size and age of Nordstrom have access to unique data that many online retailers don’t, because they don’t have brick-and-mortar stores. The heterogeneity of the data we work with makes the job really fun and challenging.</p>\n<div class=\"page\" title=\"Page 13\">\n<div class=\"section\">\n<div class=\"layoutArea\">\n<div class=\"column\">\n<p>Gutierrez: What specific tools are you using?</p>\n<p>Shellman: I’m writing a lot of Python these days, it’s what all our recommendation algorithms are written in. The Recommendo API is written in node and hosted on AWS. We use a lot of open source libraries in Python, like scikit-learn and pandas. As someone who used to work almost exclusively in R, pandas is great because it’s cheating in a way. It makes Python a lot like R, so you get to code in Python but get a lot of the conveniences that we’ve all come to expect from R. Of course, you’ll also make yourself insane trying to remember whether it’s “len” or “length,” and 0 or 1 indexed.</p>\n</div>\n</div>\n</div>\n</div>\n<div class=\"page\" title=\"Page 6\">\n<div class=\"section\">\n<div class=\"layoutArea\">\n<div class=\"column\">\n<p>Gutierrez: What advice do you have for current undergrads?</p>\n<p>Shellman: My advice to undergrads is to study computer science, math, or statistics, and a combination of the three. It doesn’t matter what else you study alongside them, if you have those three skills, you can do whatever you want, literally. I think the opportunities are endless, which means you don’t actually have to commit to any industry. I can’t advocate enough for the study of math in general and the maths more broadly because it’s where you learn to reason and think critically. The really exciting industries that are experiencing a lot of growth all involve math, computer science, and statistics in some way.</p>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<div class=\"page\" title=\"Page 7\">\n<div class=\"section\">\n<div class=\"layoutArea\">\n<div class=\"column\">\n<p>Gutierrez: Do you see yourself working in data science in your 40s?</p>\n<p>Shellman: Well, the thing about data science is that it’s almost a catchall to the point that it’s meaningless. The reason that almost everybody starts a data science talk with a slide discussing “What does it even mean?” is that it almost means nothing. A data scientist to me is a person with a certain set of quantitative and computational skills that are applicable across different domains. So as a data scientist, even if I don’t have the domain expertise I can learn it, and can work on any problem that can be quantitatively described. I can almost guarantee that I won’t be in fashion retail in my forties, but I’m sure I’ll be working on something that relies on data and using similar techniques and methodologies.</p>\n<div class=\"page\" title=\"Page 17\">\n<div class=\"section\">\n<div class=\"layoutArea\">\n<div class=\"column\">\n<p>Gutierrez: What advice would you give to data scientists looking for work?</p>\n<p>Shellman: Postings for data scientists can be pretty intimidating because most of them read like a data science glossary. The truth is that the technology changes so quickly that no one possesses experience of everything liable to be written on a posting. When you look at that, it can be overwhelming, and you might feel like, “This isn’t for me. I don’t have any of these skills and I have nothing to contribute.” I would encourage against that mindset as long as you’re okay with change and learning new things all the time.  Ultimately, what companies want is a person who can rigorously define problems and design paths to a solution. They also want people who are good at learning. I think those are the core skills.</p>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n",
  "wfw:commentRss": "http://www.erinshellman.com/data-scientists-at-work/feed/",
  "slash:comments": 1
}