{
  "title": "Weekly Review: 10/28/2017",
  "link": "https://codesachin.wordpress.com/2017/10/29/weekly-review-10282017/",
  "comments": "https://codesachin.wordpress.com/2017/10/29/weekly-review-10282017/#respond",
  "dc:creator": "srjoglekar246",
  "pubDate": "Sat, 28 Oct 2017 18:59:57 +0000",
  "category": [
    "Machine Learning/AI",
    "Programming",
    "alphago",
    "concurrency",
    "deepmind",
    "generalization",
    "go",
    "google",
    "robotics"
  ],
  "guid": "http://codesachin.wordpress.com/?p=737",
  "description": "This was a pretty busy week with a lot going on, but I finally seem to be settling into my new role! The study for Aerial Robotics is almost over with a week to go. There hasn&#8217;t been much coding in this course, but that was to be expected since it was more about PID-Control &#8230; <a href=\"https://codesachin.wordpress.com/2017/10/29/weekly-review-10282017/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Weekly Review: 10/28/2017</span> <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>This was a pretty busy week with a lot going on, but I finally seem to be settling into my new role!</p>\n<p>The study for <a href=\"https://www.coursera.org/learn/robotics-flight/home/welcome\">Aerial Robotics</a> is almost over with a week to go. There hasn&#8217;t been much coding in this course, but that was to be expected since it was more about PID-Control Theory and quadrotor dynamics. I am particularly interested in the Capstone/&#8217;final&#8217; project for this course, which would involve building an autonomous robot in Pi.</p>\n<p>Anyway, on to the interesting tidbits from this week:</p>\n<p><strong>AlphaGo Zero</strong></p>\n<p>Google&#8217;s Deepmind recently announced a new version of their AI-based Go player, the AlphaGo Zero. What makes this one so special, is that it breaks the common notion of intelligent systems requiring a LOT of data to produce decent results. AlphaGo Zero was only provided the basic rules of Go, and it performed the rest of the learning all by playing against itself. Oh and BTW, AlphaGo Zero beats AlphaGo, the previous champion in the game. This is indeed a landmark in demonstrating the power of good-old RL.</p>\n<p>Read <a href=\"https://www.theverge.com/2017/10/18/16495548/deepmind-ai-go-alphago-zero-self-taught\">this article</a> for a basic overview, and their <a href=\"https://www.nature.com/nature/journal/v550/n7676/full/nature24270.html\">paper in Nature</a> for a detailed explanation. Brushing up on <a href=\"https://www.youtube.com/watch?v=onBYsen2_eA\">Monte Carlo Tree Search</a> would certainly help.</p>\n<p><strong>Word Mover&#8217;s Distance</strong></p>\n<p>Given an excellent embedding of words such as Word2Vec, it is not very difficult to compute the semantic distance between individual terms. However, when it comes to big blocks of text, a simple &#8216;average&#8217; over term-embeddings isn&#8217;t good enough for computing their relative distances.</p>\n<p>In such cases, the <a href=\"http://jxieeducation.com/2016-06-13/Document-Similarity-With-Word-Movers-Distance/\">Word Mover&#8217;s Distance</a>, inspired from <a href=\"https://en.wikipedia.org/wiki/Earth_mover%27s_distance\">Earth Mover&#8217;s Distance</a>, provides a better solution. It figures out the semantically closest term(s) from one document to each term in another, and then the average effort required to &#8216;rephrase&#8217; one text in words of another. Click on the article link for a detailed explanation.</p>\n<p><strong>Robots generalizing from simulations</strong></p>\n<p><a href=\"https://openai.com/\">OpenAI</a> posted a <a href=\"https://blog.openai.com/generalizing-from-simulation/\">blog article</a> about how they trained a robot only through simulations. This means that the robot received no data from sensors during the training phase, but was able to perform basic tasks in deployment after some calibration.</p>\n<p>During the simulations, they used <a href=\"https://arxiv.org/abs/1710.06537\">dynamics randomization</a> to alter basic traits of the environment. This data was then fed to an <a href=\"http://colah.github.io/posts/2015-08-Understanding-LSTMs/\">LSTM</a> to understand the settings and goals. A key insight from this work is <a href=\"https://arxiv.org/pdf/1707.01495.pdf\">Hindsight Experience Replay</a>. Quoting the article, &#8220;<em><a href=\"https://arxiv.org/pdf/1707.01495.pdf\">Hindsight Experience Replay</a> (HER), allows agents to learn from a binary reward by pretending that a failure was what they wanted to do all along and learning from it accordingly. (By analogy, imagine looking for a gas station but ending up at a pizza shop. You still don’t know where to get gas, but you’ve now learned where to get pizza.)</em>&#8221;</p>\n<p><strong>Concurrency in Go</strong></p>\n<p>If you are a Go Programmer, take a look at <a href=\"https://www.youtube.com/watch?v=SmoM1InWXr0\">this old (but good) talk </a>on concurrency patterns and constructs in the language.</p>\n<p><strong>Generalization Bounds in Machine Learning</strong></p>\n<p>The Generalization Gap for an ML system is defined as the difference between the training error and the generalization error. The Generalization Bound tries to put a bound on this value, based on probability theory. Read <a href=\"https://mostafa-samir.github.io/ml-theory-pt2/\">this article</a> for a detailed mathematical explanation.</p>\n",
  "wfw:commentRss": "https://codesachin.wordpress.com/2017/10/29/weekly-review-10282017/feed/",
  "slash:comments": 0,
  "media:content": {
    "media:title": "srjoglekar246"
  }
}