{
  "id": "yt:video:lyM10dc9C3c",
  "yt:videoId": "lyM10dc9C3c",
  "yt:channelId": "UCy5H0uunC2qMk0iOF4SHKUw",
  "title": "Police Confirm: NO RECORD of Uthman ibn Farroq STABBING",
  "link": "",
  "author": {
    "name": "Hatun Tash DCCI Ministries",
    "uri": "https://www.youtube.com/channel/UCy5H0uunC2qMk0iOF4SHKUw"
  },
  "published": "2022-10-19T11:15:02+00:00",
  "updated": "2022-10-20T05:45:54+00:00",
  "media:group": {
    "media:title": "Police Confirm: NO RECORD of Uthman ibn Farroq STABBING",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Uthman ibn Farroq  told us all he got stabbed and then reported it to the police and they took his report, the weapon and even got the fingerprints of the person. This all turned out to be a huge lie! Watch this video to see the truth about what really happened. The police confirmed that he never filed a report, there were no police called to the scene of the crime, no detectives assigned and no arrest made (as he claimed)! \nto read the full artical https://islamism.news/2022/10/16/did-a-muslim-preacher-in-san-diego-stage-a-hate-crime-against-himself/\n\nEmail us: info@dcciministries.com\nContact us via Skype: DCCI Ministries \nCheck out DCCI Ministries https://www.youtube.com/c/DCCIMinistries\nFollow us on Twitter: https://twitter.com/dcciministries?lang=en\nFollow us on our blog: https://www.dcciministries.com\nTo support the work of DCCI Ministries https://paypal.me/dcciministries2019 \nIf you would like to invite us to speak in your church or university, with training and debating help kindly email info@dcciministries.com \n\n* Copyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for fair use for purposes such as criticism, comment, news reporting, teaching, scholarship, and research.\n\nPlease do not post weblinks in the comments as they will be marked as spam and your comments will not be published.\n\nDisclaimer- Speakers Corner, London UK, is a unique place in the world for freedom of Speech.  Debates and dialogues on this channel is the expression of freedom of speech by all parties in their debates and discussions. Therefore all that has been said in the videos is not necessarily the opinion of DCCI but the expression of Freedom of Speech.\n\nActs17Apologetics David Wood",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}