{
  "title": "Seamless Phase 2-3 Design: A Useful Strategy to Reduce the Sample Size for Dose Optimization. (arXiv:2211.02046v1 [stat.ME])",
  "link": "http://arxiv.org/abs/2211.02046",
  "description": "<p>The traditional more-is-better dose selection paradigm, developed based on\ncytotoxic chemotherapeutics, is often problematic When applied to the\ndevelopment of novel molecularly targeted agents (e.g., kinase inhibitors,\nmonoclonal antibodies, and antibody-drug conjugates). The US Food and Drug\nAdministration (FDA) initiated Project Optimus to reform the dose optimization\nand dose selection paradigm in oncology drug development and call for more\nattention to benefit-risk consideration.\n</p>\n<p>We systematically investigated the operating characteristics of the seamless\nphase 2-3 design as a strategy for dose optimization, where in stage 1\n(corresponding to phase 2) patients are randomized to multiple doses, with or\nwithout a control; and in stage 2 (corresponding to phase 3) the efficacy of\nthe selected optimal dose is evaluated with a randomized concurrent control or\nhistorical control. Depending on whether the concurrent control is included and\nthe type of endpoints used in stages 1 and 2, we describe four types of\nseamless phase 2-3 dose-optimization designs, which are suitable for different\nclinical settings. The statistical and design considerations that pertain to\ndose optimization are discussed. Simulation shows that dose optimization phase\n2-3 designs are able to control the familywise type I error rates and yield\nappropriate statistical power with substantially smaller sample size than the\nconventional approach. The sample size savings range from 16.6% to 27.3%,\ndepending on the design and scenario, with a mean savings of 22.1%. Due to the\ninterim dose selection, the phase 2-3 dose-optimization design is logistically\nand operationally more challenging, and should be carefully planned and\nimplemented to ensure trial integrity.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/stat/1/au:+Jiang_L/0/1/0/all/0/1\">Liyun Jiang</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Yuan_Y/0/1/0/all/0/1\">Ying Yuan</a>"
}