{
  "title": "116: Oxygen's \"Dirty John: The Dirty Truth\"",
  "link": "https://audioboom.com/posts/7477176",
  "itunes:episode": 116,
  "itunes:title": "Oxygen's \"Dirty John: The Dirty Truth\"",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 2952,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>We are covering this documentary in two episodes. <strong>Episode 2 is available right now and ad-free at the $5 level on Patreon. </strong><a href=\"https://www.patreon.com/TrueCrimeObsessed\"><strong>You can get it here</strong></a><strong>. </strong>It will be our regular episode (with ads)  next week. <br>\n<br>\nWhen Debra Newell met John Meehan on dating site for the 50+ crowd, he seemed too good to be true. A handsome, fit, successful doctor? She was interested. But, beginning with their first date, there were warning signs...something wasn't quite right here. But she ignored her instincts and allowed him to move quickly. He moved in with her after a few weeks and convince her to marry him after just two months. All the while, her adult children begged her to pay attention to the red flags, lies, and abusive behavior.<br>\n<br>\nIn Part 1, we learn about Debra and John's whirlwind romance, see how he groomed her, and meet several other women he victimized and terrorized over the years. <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 100 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<strong>COME SEE US LIVE ON TOUR!</strong> We're coming to a city near you! <a href=\"https://www.truecrimeobsessed.com/see-us-live\">CHECK OUT ALL THE DETAILS AND GET TICKETS HERE!</a>\n</div>\n",
  "pubDate": "Tue, 14 Jan 2020 05:01:00 +0000",
  "guid": "tag:audioboom.com,2020-01-13:/posts/7477176",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}