{
  "title": "Episode 126: &#8220;For Your Love&#8221; by the Yardbirds",
  "link": "https://500songs.com/podcast/episode-126-for-your-love-by-the-yardbirds/",
  "pubDate": "Thu, 01 Jul 2021 00:03:29 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=821",
  "description": "Episode 126 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “For Your Love\", the Yardbirds, and the beginnings of heavy rock and the guitar hero.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a twenty-minute bonus episode available, <a href=\"https://www.patreon.com/posts/53141908\">on \"A Lover's Concerto\" by the Toys.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I’ve created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-126-for-your-love-by-the-yardbirds/\">a Mixcloud playlist</a>, with full versions of all the songs excerpted in this episode.\n\nThe Yardbirds have one of the most mishandled catalogues of all the sixties groups, possibly <em>the </em>most mishandled. Their recordings with Giorgio Gomelsky, Simon Napier-Bell and Mickie Most are all owned by different people, and all get compiled separately, usually with poor-quality live recordings, demos, and other odds and sods to fill up a CD's running time. The only actual authoritative compilation is the long out-of-print <a href=\"https://amzn.to/3h8fXTD\"><em>Ultimate! .</em></a>\n\nInformation came from a variety of sources. Most of the general Yardbirds information came from <a href=\"https://amzn.to/3hqyYiY\"><em>The Yardbirds</em> by Alan Clayson</a> and <em><a href=\"https://amzn.to/3hnCRVZ\">Heart Full of Soul: Keith Relf of the Yardbirds</a> </em>by David French.\n\n<a href=\"https://amzn.to/3xbkD0q\">Simon Napier-Bell's <em>You Don't Have to Say You Love Me</em></a> is one of the most entertaining books about the sixties music scene, and contains several anecdotes about his time working with the Yardbirds, some of which may even be true.\n\nSome information about Immediate Records came from <a href=\"https://amzn.to/3AfYQqx\"><em>Immediate Records</em> by Simon Spence</a>, which I'll be using more in future episodes.\n\nInformation about Clapton came from <a href=\"https://amzn.to/3h4OlyL\"><em>Motherless Child</em> by Paul Scott</a>, while information on Jeff Beck came from <a href=\"https://amzn.to/3xlyWzy\"><em>Hot Wired Guitar: The Life of Jeff Beck</em> by Martin Power</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday, we're going to take a look at the early career of the band that, more than any other band, was responsible for the position of lead guitarist becoming as prestigious as that of lead singer. We're going to look at how a blues band launched the careers of several of the most successful guitarists of all time, and also one of the most successful pop songwriters of the sixties and seventies. We're going to look at \"For Your Love\" by the Yardbirds:\n\n[Excerpt: The Yardbirds, \"For Your Love\"]\n\nThe roots of the Yardbirds lie in a group of schoolfriends in Richmond, a leafy suburb of London. Keith Relf, Laurie Gane, Paul Samwell-Smith and Jim McCarty were art-school kids who were obsessed with Sonny Terry and Jimmy Reed, and who would hang around the burgeoning London R&B scene, going to see the Rolling Stones and Alexis Korner in Twickenham and at Eel Pie Island, and starting up their own blues band, the Metropolis Blues Quartet.\n\nHowever, Gane soon left the group to go off to university, and he was replaced by two younger guitarists, Top Topham and Chris Dreja, with Samwell-Smith moving from guitar to bass. As they were no longer a quartet, they renamed themselves the Yardbirds, after a term Relf had found on the back of an album cover, meaning a tramp or hobo.\n\nThe newly-named Yardbirds quickly developed their own unique style -- their repertoire was the same mix of Howlin' Wolf, Bo Diddley, Jimmy Reed and Chuck Berry as every other band on the London scene, but they included long extended improvisatory  instrumental sequences with Relf's harmonica playing off Topham's lead guitar. The group developed a way of extending songs, which they described as a “rave-up” and would become the signature of their live act – in the middle of a song they would go into a long instrumental solo in double-time, taking the song twice as fast and improvising heavily, before dropping back to the original tempo to finish the song off. These “rave-up” sections would often be much longer than the main song, and were a chance for everyone to show off their instrumental skills, with Topham and Relf trading phrases on guitar and harmonica.\n\nThey were mentored by Cyril Davies, who gave them the interval spots at some of his shows -- and then one day asked them to fill in for him in a gig he couldn't make -- a residency at a club in Harrow, where the Yardbirds went down so well that they were asked to permanently take over the residency from Davies, much to his disgust.\n\nBut the group's big break came when the Rolling Stones signed with Andrew Oldham, leaving Giorgio Gomelsky with no band to play the Crawdaddy Club every Sunday. Gomelsky was out of the country at his father's funeral when the Stones quit on him, and so it was up to Gomelsky's assistant Hamish Grimes to find a replacement. Grimes looked at the R&B scene and the choice came down to two bands -- the Yardbirds and Them. Grimes said it was a toss-up, but he eventually went for the Yardbirds, who eagerly agreed.\n\nWhen Gomelsky got back, the group were packing audiences in at the Crawdaddy and doing even better than the Stones had been. Soon Gomelsky wanted to become the Yardbirds' manager and turn the group into full-time musicians, but there was a problem -- the new school term was starting, Top Topham was only fifteen, and his parents didn't want him to quit school. Topham had to leave the group.\n\nLuckily, there was someone waiting in the wings. Eric Clapton was well known on the local scene as someone who was quite good on guitar, and he and Topham had played together for a long time as an informal duo, so he knew the parts -- and he was also acquainted with Dreja. Everyone on the London blues scene knew everyone else, although the thing that stuck in most of the Yardbirds' minds about Clapton was the time he'd seen the Metropolis Blues Quartet play and gone up to Samwell-Smith and said \"Could you do me a favour?\"\n\nWhen Samwell-Smith had nodded his assent, Clapton had said \"Don't play any more guitar solos\".\n\nClapton was someone who worshipped the romantic image of the Delta bluesman, solitary and rootless, without friends or companions, surviving only on his wits and weighed down by troubles, and he would imagine himself that way as he took guitar lessons from Dave Brock, later of Hawkwind, or as he hung out with Top Topham and Chris Dreja in Richmond on weekends, complaining about the burdens he had to bear, such as the expensive electric guitar his grandmother had bought him not being as good as he'd hoped.\n\nClapton had hung around with Topham and Dreja, but they'd never been really close, and he hadn't been considered for a spot in the Yardbirds when the group had formed. Instead he had joined the Roosters with Tom McGuinness, who had introduced Clapton to the music of Freddie King, especially a B-side called \"I Love the Woman\", which showed Clapton for the first time how the guitar could be more than just an accompaniment to vocals, but a featured instrument in its own right:\n\n[Excerpt: Freddie King, \"I Love the Woman\"]\n\nThe Roosters had been blues purists, dedicated to a scholarly attitude to American Black music and contemptuous of pop music -- when Clapton met the Beatles for the first time, when they came along to an early Rolling Stones gig Clapton was also at, he had thought of them as \"a bunch of wankers\" and despised them as sellouts.\n\nAfter the Roosters had broken up, Clapton and McGuinness had joined the gimmicky Merseybeat group Casey Jones and his Engineers, who had a band uniform of black suits and cardboard Confederate army caps, before leaving that as well. McGuinness had gone on to join Manfred Mann, and Clapton was left without a group, until the Yardbirds called on him.\n\nThe new lineup quickly gelled as musicians -- though the band did become frustrated with one quirk of Clapton's. He liked to bend strings, and so he used very light gauge strings on his guitar, which often broke, meaning that a big chunk of time would be taken up each show with Clapton restringing his guitar, while the audience gave a slow hand clap -- leading to his nickname, \"Slowhand\" Clap-ton.\n\nTwo months after Clapton joined the group, Gomelsky got them to back Sonny Boy Williamson II on a UK tour, recording a show at the Crawdaddy Club which was released as a live album three years later:\n\n[Excerpt: The Yardbirds and Sonny Boy Williamson II, \"Twenty-three Hours Too Long\"]\n\nWilliamson and the Yardbirds didn't get along though, either as people or as musicians. Williamson's birth name was Rice Miller, and he'd originally taken the name \"Sonny Boy Williamson\" to cash in on the fame of another musician who used that name, though he'd gone on to much greater success than the original, who'd died not long after the former Miller started using the name. Clapton, wanting to show off, had gone up to Williamson when they were introduced and said \"Isn't your real name Rice Miller?\"\n\nWilliamson had pulled a knife on Clapton, and his relationship with the group didn't get much better from that point on. The group were annoyed that Williamson was drunk on stage and would call out songs they hadn't rehearsed, while Williamson later summed up his view of the Yardbirds to Robbie Robertson, saying \"Those English boys want to play the blues so bad -- and they play the blues *so bad*!\"\n\nShortly after this, the group cut some demos on their own, which were used to get them a deal with Columbia, a subsidiary of EMI. Their first single was a version of Billy Boy Arnold's \"I Wish You Would\":\n\n[Excerpt: The Yardbirds, \"I Wish You Would\"]\n\nThis was as pure R&B as a British group would get at this point, but Clapton was unhappy with the record -- partly because hearing the group in the studio made him realise how comparatively thin they sounded as players, and partly just because he was worried that even going into a recording studio at all was selling out and not something that any of the Delta bluesmen whose records he loved would do.\n\nHe was happier with the group's first album, a live recording called Five Live Yardbirds that captured the sound of the group at the Marquee Club. The repertoire on that album was precisely the same as any of the other British R&B bands of the time -- songs by Howlin' Wolf, Bo Diddley, Chuck Berry, John Lee Hooker, Slim Harpo, Sonny Boy Williamson and the Isley Brothers -- but they were often heavily extended versions, with a lot of interplay between Samwell-Smith's bass, Clapton's guitar, and Relf's harmonica, like their five-and-a-half-minute version of Howlin' Wolf's \"Smokestack Lightning\":\n\n[Excerpt: The Yardbirds, \"Smokestack Lightning\"]\n\n\"I Wish You Would\" made number twenty-six on the NME chart, but it didn't make the Record Retailer chart which is the basis of modern chart compilations. The group were just about to go into the studio to cut their second single, a version of \"Good Morning Little Schoolgirl\", when Keith Relf collapsed. Relf had severe asthma and was also a heavy smoker, and his lung collapsed and he had to be hospitalised for several weeks, and it looked for a while as if he might never be able to sing or play harmonica again. In his absence, various friends and hangers-on from the R&B scene deputised for him -- Ronnie Wood has recalled being at a gig and the audience being asked \"Can anyone play harmonica?\", leading to Wood getting on stage with them, and other people who played a gig or two, or sometimes just a song or two, with them include Mick Jagger, Brian Jones, and Rod Stewart. Stewart was apparently a big fan, and would keep trying to get on stage with them -- according to Keith Relf's wife, \"Rod Stewart would be sitting in the backroom begging to go on—‘Oh give us a turn, give us a turn.’”\n\nLuckily, Relf's lung was successfully reinflated, and he returned to singing, harmonica playing... and smoking. In the early months back with the group, he would sometimes have to pull out his inhaler in the middle of a word to be able to continue singing, and he would start seeing stars on stage. Relf's health would never be good, but he was able to carry on performing, and the future of the group was secured.\n\nWhat wasn't secure was the group's relationship with their guitarist. While Relf and Dreja had for a time shared a flat with Eric Clapton, he was becoming increasingly distant from the other members. Partly this was because Relf felt somewhat jealous of the fact that the audiences seemed more impressed with the group's guitarist than with him, the lead singer; partly it was because Giorgio Gomelsky had made Paul Samwell-Smith the group's musical director, and Clapton had never got on with Samwell-Smith and distrusted his musical instincts; but mostly it was just that the rest of the group found Clapton rather petty, cold, and humourless, and never felt any real connection to him.\n\nTheir records still weren't selling, but they were popular enough on the local scene that they were invited to be one of the support acts for the Beatles' run of Christmas shows at the end of 1964, and hung out with the group backstage. Paul McCartney played them a new song he was working on, which didn't have lyrics yet, but which would soon become \"Yesterday\", but it was another song they heard that would change the group's career.\n\nA music publisher named Ronnie Beck turned up backstage with a demo he wanted the Beatles to hear. Obviously, the Beatles weren't interested in hearing any demos -- they were writing so many hits they were giving half of them away to other artists, why would they need someone else's song? But the Yardbirds were looking for a hit, and after listening to the demo, Samwell-Smith was convinced that a hit was what this demo was.\n\nThe demo was by a Manchester-based songwriter named Graham Gouldman. Gouldman had started his career in a group called the Whirlwinds, who had released one single -- a version of Buddy Holly's \"Look at Me\" backed with a song called \"Baby Not Like You\", written by Gouldman's friend Lol Creme:\n\n[Excerpt: The Whirlwinds, \"Baby Not Like You\"]\n\nThe Whirlwinds had split up by this point, and Gouldman was in the process of forming a new band, the Mockingbirds, which included drummer Kevin Godley. The song on the demo had been intended as the Mockingbirds' first single, but their label had decided instead to go with \"That's How (It's Gonna Stay)\":\n\n[Excerpt: The Mockingbirds, \"That's How (It's Gonna Stay)\"]\n\nSo the song, \"For Your Love\", was free, and Samwell-Smith was insistent -- this was going to be the group's first big hit. The record was a total departure from their blues sound. Gouldman's version had been backed by bongos and acoustic guitar, and Samwell-Smith decided that he would keep the bongo part, and add, not the normal rock band instruments, but harpsichord and bowed double bass:\n\n[Excerpt: The Yardbirds, \"For Your Love\"]\n\nThe only part of the song where the group's normal electric instrumentation is used is the brief middle-eight, which feels nothing like the rest of the record:\n\n[Excerpt: The Yardbirds, \"For Your Love\"]\n\nBut on the rest of the record, none of the Yardbirds other than Jim McCarty play -- the verses have Relf on vocals, McCarty on drums, Brian Auger on harpsichord, Ron Prentice on double bass and Denny Piercy on bongos, with Samwell-Smith in the control room producing. Clapton and Dreja only played on the middle eight.\n\nThe record went to number three, and became the group's first real hit, and it led to an odd experience for Gouldman, as the Mockingbirds were by this time employed as the warm-up act on the BBC's Top of the Pops, which was recorded in Manchester, so Gouldman got to see mobs of excited fans applauding the Yardbirds for performing a song he'd written, while he was completely ignored.\n\nMost of the group were excited about their newfound success, but Clapton was not happy. He hadn't signed up to be a member of a pop group -- he wanted to be in a blues band. He made his displeasure about playing on material like \"For Your Love\"  very clear, and right after the recording session he resigned from the group. He was convinced that they would be nothing without him -- after all, wasn't he the undisputed star of the group? -- and he immediately found work with a group that was more suited to his talents, John Mayall's Bluesbreakers.\n\nThe Bluesbreakers at this point consisted of Mayall on keyboards and vocals, Clapton on guitar, John McVie on bass, and Hughie Flint on drums. For their first single with this lineup, they signed a one-record deal with Immediate Records, a new independent label started by the Rolling Stones' manager Andrew Oldham. That single was produced by Immediate's young staff producer, the session guitarist Jimmy Page:\n\n[Excerpt: John Mayall and the Bluesbreakers, \"I'm Your Witch Doctor\"]\n\nThe Bluesbreakers had something of a fluid lineup -- shortly after that recording, Clapton left the group to join another group, and was replaced by a guitarist named Peter Green. Then Clapton came back, for the recording of what became known as the \"Beano album\", because Clapton was in a mood when they took the cover photo, and so read the children's comic the Beano rather than looking at the camera:\n\n[Excerpt: John Mayall's Bluesbreakers, \"Bernard Jenkins\"]\n\nShortly after that, Mayall fired John McVie, who was replaced by Jack Bruce, formerly of the Graham Bond Organisation, but then Bruce left to join Manfred Mann and McVie was rehired.\n\nWhile Clapton was in the Bluesbreakers, he gained a reputation for being the best guitarist in London -- a popular graffito at the time was \"Clapton is God\" -- and he was at first convinced that without him the Yardbirds would soon collapse. But Clapton had enough self-awareness to know that even though he was very good, there were a handful of guitarists in London who were better than him. One he always acknowledged was Albert Lee, who at the time was playing in Chris Farlowe's backing band but would later become known as arguably the greatest country guitarist of his generation. But another was the man that the Yardbirds got in to replace him.\n\nThe Yardbirds had originally asked Jimmy Page if he wanted to join the group, and he'd briefly been tempted, but he'd decided that his talents were better used in the studio, especially since he'd just been given the staff job at Immediate. Instead he recommended his friend Jeff Beck. The two had known each other since their teens, and had grown up playing guitar together, and sharing influences as they delved deeper into music. While both men admired the same blues musicians that Clapton did, people like Hubert Sumlin and Buddy Guy, they both had much more eclectic tastes than Clapton -- both loved rockabilly, and admired Scotty Moore and James Burton, and Beck was a huge devotee of Cliff Gallup, the original guitarist from Gene Vincent's Blue Caps. Beck also loved Les Paul and the jazz guitarist Barney Kessel, while Page was trying to incorporate some of the musical ideas of the sitar player Ravi Shankar into his playing.\n\nWhile Page was primarily a session player, Beck was a gigging musician, playing with a group called the Tridents, but as Page rapidly became one of the two first-call session guitarists along with Big Jim Sullivan, he would often recommend his friend for sessions he couldn't make, leading to Beck playing on records like \"Dracula's Daughter\", which Joe Meek produced for Screaming Lord Sutch and the Savages:\n\n[Excerpt: Screaming Lord Sutch and the Savages, \"Dracula's Daughter\"]\n\nWhile Clapton had a very straightforward tone, Beck was already experimenting with the few effects that were available at the time, like echoes and fuzztone. While there would always be arguments about who was the first to use feedback as a controlled musical sound, Beck is one of those who often gets the credit, and Keith Relf would describe Beck's guitar playing as being almost musique concrete.\n\nYou can hear the difference on the group's next single. \"Heart Full of Soul\" was again written by Gouldman, and was originally recorded with a sitar, which would have made it one of the first pop singles to use the instrument. However, they decided to replace the sitar part with Beck playing the same Indian-sounding riff on a heavily-distorted guitar:\n\n[Excerpt: The Yardbirds, \"Heart Full of Soul\"]\n\nThat made number two in the UK and the top ten in the US, and suddenly the world had a new guitar god, one who was doing things on records that nobody else had been doing. The group's next single was a double A-side, a third song written by Gouldman, \"Evil Hearted You\", coupled with an original by the group, \"Still I'm Sad\". Neither track was quite up to the standard of their previous couple of singles, but it still went to number three on the charts. From this point on, the group stopped using Gouldman's songs as singles, preferring to write their own material, but Gouldman had already started providing hits for other groups like the Hollies, for whom he wrote songs like “Bus Stop”:\n\n[Excerpt: The Hollies, “Bus Stop”]\n\nHis group The Mockingbirds had also signed to Immediate Records, who put out their classic pop-psych single “You Stole My Love”:\n\n[Excerpt: The Mockingbirds, “You Stole My Love”]\n\nWe will hear more of Gouldman later.\n\nIn the Yardbirds, meanwhile, the pressure was starting to tell on Keith. He was a deeply introverted person who didn't have the temperament for stardom, and he was uncomfortable with being recognised on the street. It also didn't help that his dad was also the band's driver and tour manager, which meant he always ended up feeling somewhat inhibited, and he started drinking heavily to try to lose some of those inhibitions.\n\nShortly after the recording of \"Evil Hearted You\", the group went on their first American tour, though on some dates they were unable to play as Gomelsky had messed up their work permits -- one of several things about Gomelsky's management of the group that irritated them. But they were surprised to find that they were much bigger in the US than in the UK. While the group had only released singles, EPs, and the one live album in the UK, and would only ever put out one UK studio album, they'd recorded enough that they'd already had an album out in the US, a compilation of singles, B-sides, and even a couple of demos, and that had been picked up on by almost every garage band in the country. On one of the US gigs, their opening act, a teenage group called the Spiders, were in trouble. They'd learned every song on that Yardbirds album, and their entire set was made up of covers of that material.\n\nThey'd gone down well supporting every other major band that came to town, but they had a problem when it came to the Yardbirds. Their singer described what happened next: \"We thought about it and we said, 'Look, we’re paying tribute to them—let’s just do our set.' And so, we opened for the Yardbirds and did all of their songs. We could see them in the back and they were smiling and giving us the thumbs up. And then they got up and just blew us off the stage—because they were the Yardbirds! And we just stood there going, 'Oh…. That’s how it’s done.' The Yardbirds were one of the best live bands I ever heard and we learned a lot that night.\"\n\nThat band, and later that lead singer, both later changed their name to Alice Cooper.\n\nThe trip to the US also saw a couple of recording sessions. Gomelsky had been annoyed at the bad drum sound the group had got in UK studios, and had loved Sam Phillips' drum sound on the old Sun records, so had decided to get in touch with Phillips and ask him to produce the group. He hadn't had a reply, but the group turned up at Phillips' new studio anyway, knowing that he lived in a flat above the studio.\n\nPhillips wasn't in, but eventually turned up at midnight, after a fishing trip, drunk. He wasn't interested in producing some group of British kids, but Gomelsky waved six hundred dollars at him, and he agreed. He produced two tracks for the group. One of those, \"Mr. You're a Better Man Than I\", was written by Mike Hugg of Manfred Mann and his brother:\n\n[Excerpt: The Yardbirds, \"Mister, You're a Better Man Than I\"]\n\nThe backing track there was produced by Phillips, but the lead vocal was redone in New York, as Relf was also drunk and wasn't singing well -- something Phillips pointed out, and which devastated Relf, who had grown up on records Phillips produced. Phillips' dismissal of Relf also grated on Beck -- even though Beck wasn't close to Relf, as the two competed for prominence on stage while the rest of the band kept to the backline, Beck had enormous respect for Relf's talents as a frontman, and thought Phillips horribly unprofessional for his dismissive attitude, though the other Yardbirds had happier memories of the session, not least because Phillips caught their live sound better than anyone had.\n\nYou can hear Relf's drunken incompetence on the other track they recorded at the session, their version of \"Train Kept A-Rollin'\", the song we covered way back in episode forty-four. Rearranged by Samwell-Smith and Beck, the Yardbirds' version built on the Johnny Burnette recording and turned it into one of the hardest rock tracks ever recorded to that point -- but Relf's drunk, sloppy, vocal was caught on the backing track. He later recut the vocal more competently, with Roy Halee engineering in New York, but the combination of the two vocals gives the track an unusual feel which inspired many future garage bands:\n\n[Excerpt: The Yardbirds, \"Train Kept A-Rollin'\"]\n\nOn that first US tour, they also recorded a version of Bo Diddley's \"I'm a Man\" at Chess Studios, where Diddley had recorded his original. Only a few weeks after the end of that tour they were back for a second tour, in support of their second US album, and they returned to Chess to record what many consider their finest original.\n\n\"Shapes of Things\" had been inspired by the bass part on Dave Brubeck's \"Pick Up Sticks\":\n\n[Excerpt: Dave Brubeck Quartet, \"Pick Up Sticks\"]\n\nSamwell-Smith and McCarty had written the music for the song, Relf and Samwell-Smith added lyrics, and Beck experimented with feedback, leading to one of the first psychedelic records to become a big hit, making number three in the UK and number eleven in the US:\n\n[Excerpt: The Yardbirds, \"Shapes of Things\"]\n\nThat would be the group's last record with Giorgio Gomelsky as credited producer -- although Samwell-Smith had been doing all the actual production work -- as the group were becoming increasingly annoyed at Gomelsky's ideas for promoting them, which included things like making them record songs in Italian so they could take part in an Italian song contest. Gomelsky was also working them so hard that Beck ended up being hospitalised with what has been variously described as meningitis and exhaustion. By the time he was out of the hospital, Gomelsky was fired.\n\nHis replacement as manager and co-producer was Simon Napier-Bell, a young dilettante and scenester who was best known for co-writing the English language lyrics for Dusty Springfield's \"You Don't Have to Say You Love Me\":\n\n[Excerpt: Dusty Springfield, \"You Don't Have to Say You Love Me\"]\n\nThe way Napier-Bell tells the story -- and Napier-Bell is an amusing raconteur, and his volumes of autobiography are enjoyable reads, but one gets the feeling that he will not tell the truth if a lie seems more entertaining -- is that the group chose him because of his promotion of a record he'd produced for a duo called Diane Ferraz and Nicky Scott:\n\n[Excerpt: Diane Ferraz and Nicky Scott, \"Me and You\"]\n\nAccording to Napier-Bell, both Ferraz and Scott were lovers of his, who were causing him problems, and he decided to get rid of the problem by making them both pop stars. As Ferraz was Black and Scott white, Napier-Bell sent photos of them to every DJ and producer in the country, and then when they weren't booked on TV shows or playlisted on the radio, he would accuse the DJs and producers of racism and threaten to go to the newspapers about it. As a result, they ended up on almost every TV show and getting regular radio exposure, though it wasn't enough to make the record a hit.\n\nThe Yardbirds had been impressed by how much publicity Ferraz and Scott had got, and asked Napier-Bell to manage them. He immediately set about renegotiating their record contract and getting them a twenty-thousand-pound advance -- a fortune in the sixties. He also moved forward with a plan Gomelsky had had of the group putting out solo records, though only Relf ended up doing so. Relf's first solo single was a baroque pop song, \"Mr. Zero\", written by Bob Lind, who had been a one-hit wonder with \"Elusive Butterfly\", and produced by Samwell-Smith:\n\n[Excerpt: Keith Relf, \"Mr. Zero\"]\n\nBeck, meanwhile, recorded a solo instrumental, intended for his first solo single but not released until nearly a year later.  \"Beck's Bolero\" has Jimmy Page as its credited writer, though Beck claims to be a co-writer, and features Beck and Page on guitars, session pianist Nicky Hopkins, and Keith Moon of the Who on drums. John Entwistle of the Who was meant to play bass, but when he didn't show to the session, Page's friend, session bass player John Paul Jones, was called up:\n\n[Excerpt: Jeff Beck, \"Beck's Bolero\"]\n\nThe five players were so happy with that recording that they briefly discussed forming a group together, with Moon saying of the idea \"That will go down like a lead zeppelin\". They all agreed that it wouldn't work and carried on with their respective careers.\n\nThe group's next single was their first to come from a studio album -- their only UK studio album, variously known as Yardbirds or Roger the Engineer. \"Over Under Sideways Down\" was largely written in the studio and is credited to all five group members, though Napier-Bell has suggested he came up with the chorus lyrics:\n\n[Excerpt: The Yardbirds, \"Over Under Sideways Down\"]\n\nThat became the group's fifth top ten single in a row, but it would be their last, because they were about to lose the man who, more than anyone else, had been responsible for their musical direction.\n\nThe group had been booked to play an upper-class black-tie event, and Relf had turned up drunk. They played three sets, and for the first, Relf started to get freaked out by the fact that the audience were just standing there, not dancing, and started blowing raspberries at them. He got more drunk in the interval, and in the second set he spent an entire song just screaming at the audience that they could copulate with themselves, using a word I'm not allowed to use without this podcast losing its clean rating. They got him offstage and played the rest of the set just doing instrumentals. For the third set, Relf was even more drunk. He came onstage and immediately fell backwards into the drum kit.\n\nOnly one person in the audience was at all impressed -- Beck's friend Jimmy Page had come along to see the show, and had thought it great anarchic fun. He went backstage to tell them so, and found Samwell-Smith in the middle of quitting the group, having finally had enough. Page, who had turned down the offer to join the group two years earlier, was getting bored of just being a session player and decided that being a pop star seemed more fun. He immediately volunteered himself as the group's new bass player, and we'll see how that played out in a future episode...",
  "itunes:subtitle": "Episode 126 of A History of Rock Music in Five Hundred Songs looks at “For Your Love, the Yardbirds, and the beginnings of heavy rock and the guitar hero.  Click the full post to read liner notes, links to more information, and a transcript of the episod",
  "itunes:keywords": "Alice Cooper,Andrew Oldham,Brian Auger,Chris Dreja,Cyril Davies,Dave Brock,Eric Clapton,Giorgio Gomelsky,Graham Gouldman,Immediate Records,Jack Bruce,Jeff Beck,Jim McCarty,Jimmy Page,Joe Meek,John Entwistle,John Mayall,John McVie,John Paul Jones,Keith Moon,Keith Relf,Kevin Godley,Led Zeppelin,Lol Creme,Manfred Mann,Mike Hugg,Nicky Hopkins,Paul McCartney,Paul Samwell-Smith,Peter Green,Rod Stewart,Sam Phillips,Simon Napier-Bell,Sonny Boy Williamson II,The Hollies,The Rolling Stones,The Yardbirds,Tom McGuinness",
  "itunes:episodeType": "full",
  "itunes:episode": 126,
  "content:encoded": "Episode 126 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “For Your Love\", the Yardbirds, and the beginnings of heavy rock and the guitar hero.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a twenty-minute bonus episode available, <a href=\"https://www.patreon.com/posts/53141908\">on \"A Lover's Concerto\" by the Toys.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I’ve created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-126-for-your-love-by-the-yardbirds/\">a Mixcloud playlist</a>, with full versions of all the songs excerpted in this episode.\n\nThe Yardbirds have one of the most mishandled catalogues of all the sixties groups, possibly <em>the </em>most mishandled. Their recordings with Giorgio Gomelsky, Simon Napier-Bell and Mickie Most are all owned by different people, and all get compiled separately, usually with poor-quality live recordings, demos, and other odds and sods to fill up a CD's running time. The only actual authoritative compilation is the long out-of-print <a href=\"https://amzn.to/3h8fXTD\"><em>Ultimate! .</em></a>\n\nInformation came from a variety of sources. Most of the general Yardbirds information came from <a href=\"https://amzn.to/3hqyYiY\"><em>The Yardbirds</em> by Alan Clayson</a> and <em><a href=\"https://amzn.to/3hnCRVZ\">Heart Full of Soul: Keith Relf of the Yardbirds</a> </em>by David French.\n\n<a href=\"https://amzn.to/3xbkD0q\">Simon Napier-Bell's <em>You Don't Have to Say You Love Me</em></a> is one of the most entertaining books about the sixties music scene, and contains several anecdotes about his time working with the Yardbirds, some of which may even be true.\n\nSome information about Immediate Records came from <a href=\"https://amzn.to/3AfYQqx\"><em>Immediate Records</em> by Simon Spence</a>, which I'll be using more in future episodes.\n\nInformation about Clapton came from <a href=\"https://amzn.to/3h4OlyL\"><em>Motherless Child</em> by Paul Scott</a>, while information on Jeff Beck came from <a href=\"https://amzn.to/3xlyWzy\"><em>Hot Wired Guitar: The Life of Jeff Beck</em> by Martin Power</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday, we're going to take a look at the early career of the band that, more than any other band, was responsible for the position of lead guitarist becoming as prestigious as that of lead singer. We're going to look at how a blues band launched the careers of several of the most successful guitarists of all time, and also one of the most successful pop songwriters of the sixties and seventies. We're going to look at \"For Your Love\" by the Yardbirds:\n\n[Excerpt: The Yardbirds, \"For Your Love\"]\n\nThe roots of the Yardbirds lie in a group of schoolfriends in Richmond, a leafy suburb of London. Keith Relf, Laurie Gane, Paul Samwell-Smith and Jim McCarty were art-school kids who were obsessed with Sonny Terry and Jimmy Reed, and who would hang around the burgeoning London R&B scene, going to see the Rolling Stones and Alexis Korner in Twickenham and at Eel Pie Island, and starting up their own blues band, the Metropolis Blues Quartet.\n\nHowever, Gane soon left the group to go off to university, and he was replaced by two younger guitarists, Top Topham and Chris Dreja, with Samwell-Smith moving from guitar to bass. As they were no longer a quartet, they renamed themselves the Yardbirds, after a term Relf had found on the back of an album cover, meaning a tramp or hobo.\n\nThe newly-named Yardbirds quickly developed their own unique style -- their repertoire was the same mix of Howlin' Wolf, Bo Diddley, Jimmy Reed and Chuck Berry as every other band on the London scene, but they included long extended improvisatory  instrumental sequences with Relf's harmonica playing off Topham's lead guitar. The group developed a way of extending songs, which they described as a “rave-up” and would become the signature of their live act – in the middle of a song they would go into a long instrumental solo in double-time, taking the song twice as fast and improvising heavily, before dropping back to the original tempo to finish the song off. These “rave-up” sections would often be much longer than the main song, and were a chance for everyone to show off their instrumental skills, with Topham and Relf trading phrases on guitar and harmonica.\n\nThey were mentored by Cyril Davies, who gave them the interval spots at some of his shows -- and then one day asked them to fill in for him in a gig he couldn't make -- a residency at a club in Harrow, where the Yardbirds went down so well that they were asked to permanently take over the residency from Davies, much to his disgust.\n\nBut the group's big break came when the Rolling Stones signed with Andrew Oldham, leaving Giorgio Gomelsky with no band to play the Crawdaddy Club every Sunday. Gomelsky was out of the country at his father's funeral when the Stones quit on him, and so it was up to Gomelsky's assistant Hamish Grimes to find a replacement. Grimes looked at the R&B scene and the choice came down to two bands -- the Yardbirds and Them. Grimes said it was a toss-up, but he eventually went for the Yardbirds, who eagerly agreed.\n\nWhen Gomelsky got back, the group were packing audiences in at the Crawdaddy and doing even better than the Stones had been. Soon Gomelsky wanted to become the Yardbirds' manager and turn the group into full-time musicians, but there was a problem -- the new school term was starting, Top Topham was only fifteen, and his parents didn't want him to quit school. Topham had to leave the group.\n\nLuckily, there was someone waiting in the wings. Eric Clapton was well known on the local scene as someone who was quite good on guitar, and he and Topham had played together for a long time as an informal duo, so he knew the parts -- and he was also acquainted with Dreja. Everyone on the London blues scene knew everyone else, although the thing that stuck in most of the Yardbirds' minds about Clapton was the time he'd seen the Metropolis Blues Quartet play and gone up to Samwell-Smith and said \"Could you do me a favour?\"\n\nWhen Samwell-Smith had nodded his assent, Clapton had said \"Don't play any more guitar solos\".\n\nClapton was someone who worshipped the romantic image of the Delta bluesman, solitary and rootless, without friends or companions, surviving only on his wits and weighed down by troubles, and he would imagine himself that way as he took guitar lessons from Dave Brock, later of Hawkwind, or as he hung out with Top Topham and Chris Dreja in Richmond on weekends, complaining about the burdens he had to bear, such as the expensive electric guitar his grandmother had bought him not being as good as he'd hoped.\n\nClapton had hung around with Topham and Dreja, but they'd never been really close, and he hadn't been considered for a spot in the Yardbirds when the group had formed. Instead he had joined the Roosters with Tom McGuinness, who had introduced Clapton to the music of Freddie King, especially a B-side called \"I Love the Woman\", which showed Clapton for the first time how the guitar could be more than just an accompaniment to vocals, but a featured instrument in its own right:\n\n[Excerpt: Freddie King, \"I Love the Woman\"]\n\nThe Roosters had been blues purists, dedicated to a scholarly attitude to American Black music and contemptuous of pop music -- when Clapton met the Beatles for the first time, when they came along to an early Rolling Stones gig Clapton was also at, he had thought of them as \"a bunch of wankers\" and despised them as sellouts.\n\nAfter the Roosters had broken up, Clapton and McGuinness had joined the gimmicky Merseybeat group Casey Jones and his Engineers, who had a band uniform of black suits and cardboard Confederate army caps, before leaving that as well. McGuinness had gone on to join Manfred Mann, and Clapton was left without a group, until the Yardbirds called on him.\n\nThe new lineup quickly gelled as musicians -- though the band did become frustrated with one quirk of Clapton's. He liked to bend strings, and so he used very light gauge strings on his guitar, which often broke, meaning that a big chunk of time would be taken up each show with Clapton restringing his guitar, while the audience gave a slow hand clap -- leading to his nickname, \"Slowhand\" Clap-ton.\n\nTwo months after Clapton joined the group, Gomelsky got them to back Sonny Boy Williamson II on a UK tour, recording a show at the Crawdaddy Club which was released as a live album three years later:\n\n[Excerpt: The Yardbirds and Sonny Boy Williamson II, \"Twenty-three Hours Too Long\"]\n\nWilliamson and the Yardbirds didn't get along though, either as people or as musicians. Williamson's birth name was Rice Miller, and he'd originally taken the name \"Sonny Boy Williamson\" to cash in on the fame of another musician who used that name, though he'd gone on to much greater success than the original, who'd died not long after the former Miller started using the name. Clapton, wanting to show off, had gone up to Williamson when they were introduced and said \"Isn't your real name Rice Miller?\"\n\nWilliamson had pulled a knife on Clapton, and his relationship with the group didn't get much better from that point on. The group were annoyed that Williamson was drunk on stage and would call out songs they hadn't rehearsed, while Williamson later summed up his view of the Yardbirds to Robbie Robertson, saying \"Those English boys want to play the blues so bad -- and they play the blues *so bad*!\"\n\nShortly after this, the group cut some demos on their own, which were used to get them a deal with Columbia, a subsidiary of EMI. Their first single was a version of Billy Boy Arnold's \"I Wish You Would\":\n\n[Excerpt: The Yardbirds, \"I Wish You Would\"]\n\nThis was as pure R&B as a British group would get at this point, but Clapton was unhappy with the record -- partly because hearing the group in the studio made him realise how comparatively thin they sounded as players, and partly just because he was worried that even going into a recording studio at all was selling out and not something that any of the Delta bluesmen whose records he loved would do.\n\nHe was happier with the group's first album, a live recording called Five Live Yardbirds that captured the sound of the group at the Marquee Club. The repertoire on that album was precisely the same as any of the other British R&B bands of the time -- songs by Howlin' Wolf, Bo Diddley, Chuck Berry, John Lee Hooker, Slim Harpo, Sonny Boy Williamson and the Isley Brothers -- but they were often heavily extended versions, with a lot of interplay between Samwell-Smith's bass, Clapton's guitar, and Relf's harmonica, like their five-and-a-half-minute version of Howlin' Wolf's \"Smokestack Lightning\":\n\n[Excerpt: The Yardbirds, \"Smokestack Lightning\"]\n\n\"I Wish You Would\" made number twenty-six on the NME chart, but it didn't make the Record Retailer chart which is the basis of modern chart compilations. The group were just about to go into the studio to cut their second single, a version of \"Good Morning Little Schoolgirl\", when Keith Relf collapsed. Relf had severe asthma and was also a heavy smoker, and his lung collapsed and he had to be hospitalised for several weeks, and it looked for a while as if he might never be able to sing or play harmonica again. In his absence, various friends and hangers-on from the R&B scene deputised for him -- Ronnie Wood has recalled being at a gig and the audience being asked \"Can anyone play harmonica?\", leading to Wood getting on stage with them, and other people who played a gig or two, or sometimes just a song or two, with them include Mick Jagger, Brian Jones, and Rod Stewart. Stewart was apparently a big fan, and would keep trying to get on stage with them -- according to Keith Relf's wife, \"Rod Stewart would be sitting in the backroom begging to go on—‘Oh give us a turn, give us a turn.’”\n\nLuckily, Relf's lung was successfully reinflated, and he returned to singing, harmonica playing... and smoking. In the early months back with the group, he would sometimes have to pull out his inhaler in the middle of a word to be able to continue singing, and he would start seeing stars on stage. Relf's health would never be good, but he was able to carry on performing, and the future of the group was secured.\n\nWhat wasn't secure was the group's relationship with their guitarist. While Relf and Dreja had for a time shared a flat with Eric Clapton, he was becoming increasingly distant from the other members. Partly this was because Relf felt somewhat jealous of the fact that the audiences seemed more impressed with the group's guitarist than with him, the lead singer; partly it was because Giorgio Gomelsky had made Paul Samwell-Smith the group's musical director, and Clapton had never got on with Samwell-Smith and distrusted his musical instincts; but mostly it was just that the rest of the group found Clapton rather petty, cold, and humourless, and never felt any real connection to him.\n\nTheir records still weren't selling, but they were popular enough on the local scene that they were invited to be one of the support acts for the Beatles' run of Christmas shows at the end of 1964, and hung out with the group backstage. Paul McCartney played them a new song he was working on, which didn't have lyrics yet, but which would soon become \"Yesterday\", but it was another song they heard that would change the group's career.\n\nA music publisher named Ronnie Beck turned up backstage with a demo he wanted the Beatles to hear. Obviously, the Beatles weren't interested in hearing any demos -- they were writing so many hits they were giving half of them away to other artists, why would they need someone else's song? But the Yardbirds were looking for a hit, and after listening to the demo, Samwell-Smith was convinced that a hit was what this demo was.\n\nThe demo was by a Manchester-based songwriter named Graham Gouldman. Gouldman had started his career in a group called the Whirlwinds, who had released one single -- a version of Buddy Holly's \"Look at Me\" backed with a song called \"Baby Not Like You\", written by Gouldman's friend Lol Creme:\n\n[Excerpt: The Whirlwinds, \"Baby Not Like You\"]\n\nThe Whirlwinds had split up by this point, and Gouldman was in the process of forming a new band, the Mockingbirds, which included drummer Kevin Godley. The song on the demo had been intended as the Mockingbirds' first single, but their label had decided instead to go with \"That's How (It's Gonna Stay)\":\n\n[Excerpt: The Mockingbirds, \"That's How (It's Gonna Stay)\"]\n\nSo the song, \"For Your Love\", was free, and Samwell-Smith was insistent -- this was going to be the group's first big hit. The record was a total departure from their blues sound. Gouldman's version had been backed by bongos and acoustic guitar, and Samwell-Smith decided that he would keep the bongo part, and add, not the normal rock band instruments, but harpsichord and bowed double bass:\n\n[Excerpt: The Yardbirds, \"For Your Love\"]\n\nThe only part of the song where the group's normal electric instrumentation is used is the brief middle-eight, which feels nothing like the rest of the record:\n\n[Excerpt: The Yardbirds, \"For Your Love\"]\n\nBut on the rest of the record, none of the Yardbirds other than Jim McCarty play -- the verses have Relf on vocals, McCarty on drums, Brian Auger on harpsichord, Ron Prentice on double bass and Denny Piercy on bongos, with Samwell-Smith in the control room producing. Clapton and Dreja only played on the middle eight.\n\nThe record went to number three, and became the group's first real hit, and it led to an odd experience for Gouldman, as the Mockingbirds were by this time employed as the warm-up act on the BBC's Top of the Pops, which was recorded in Manchester, so Gouldman got to see mobs of excited fans applauding the Yardbirds for performing a song he'd written, while he was completely ignored.\n\nMost of the group were excited about their newfound success, but Clapton was not happy. He hadn't signed up to be a member of a pop group -- he wanted to be in a blues band. He made his displeasure about playing on material like \"For Your Love\"  very clear, and right after the recording session he resigned from the group. He was convinced that they would be nothing without him -- after all, wasn't he the undisputed star of the group? -- and he immediately found work with a group that was more suited to his talents, John Mayall's Bluesbreakers.\n\nThe Bluesbreakers at this point consisted of Mayall on keyboards and vocals, Clapton on guitar, John McVie on bass, and Hughie Flint on drums. For their first single with this lineup, they signed a one-record deal with Immediate Records, a new independent label started by the Rolling Stones' manager Andrew Oldham. That single was produced by Immediate's young staff producer, the session guitarist Jimmy Page:\n\n[Excerpt: John Mayall and the Bluesbreakers, \"I'm Your Witch Doctor\"]\n\nThe Bluesbreakers had something of a fluid lineup -- shortly after that recording, Clapton left the group to join another group, and was replaced by a guitarist named Peter Green. Then Clapton came back, for the recording of what became known as the \"Beano album\", because Clapton was in a mood when they took the cover photo, and so read the children's comic the Beano rather than looking at the camera:\n\n[Excerpt: John Mayall's Bluesbreakers, \"Bernard Jenkins\"]\n\nShortly after that, Mayall fired John McVie, who was replaced by Jack Bruce, formerly of the Graham Bond Organisation, but then Bruce left to join Manfred Mann and McVie was rehired.\n\nWhile Clapton was in the Bluesbreakers, he gained a reputation for being the best guitarist in London -- a popular graffito at the time was \"Clapton is God\" -- and he was at first convinced that without him the Yardbirds would soon collapse. But Clapton had enough self-awareness to know that even though he was very good, there were a handful of guitarists in London who were better than him. One he always acknowledged was Albert Lee, who at the time was playing in Chris Farlowe's backing band but would later become known as arguably the greatest country guitarist of his generation. But another was the man that the Yardbirds got in to replace him.\n\nThe Yardbirds had originally asked Jimmy Page if he wanted to join the group, and he'd briefly been tempted, but he'd decided that his talents were better used in the studio, especially since he'd just been given the staff job at Immediate. Instead he recommended his friend Jeff Beck. The two had known each other since their teens, and had grown up playing guitar together, and sharing influences as they delved deeper into music. While both men admired the same blues musicians that Clapton did, people like Hubert Sumlin and Buddy Guy, they both had much more eclectic tastes than Clapton -- both loved rockabilly, and admired Scotty Moore and James Burton, and Beck was a huge devotee of Cliff Gallup, the original guitarist from Gene Vincent's Blue Caps. Beck also loved Les Paul and the jazz guitarist Barney Kessel, while Page was trying to incorporate some of the musical ideas of the sitar player Ravi Shankar into his playing.\n\nWhile Page was primarily a session player, Beck was a gigging musician, playing with a group called the Tridents, but as Page rapidly became one of the two first-call session guitarists along with Big Jim Sullivan, he would often recommend his friend for sessions he couldn't make, leading to Beck playing on records like \"Dracula's Daughter\", which Joe Meek produced for Screaming Lord Sutch and the Savages:\n\n[Excerpt: Screaming Lord Sutch and the Savages, \"Dracula's Daughter\"]\n\nWhile Clapton had a very straightforward tone, Beck was already experimenting with the few effects that were available at the time, like echoes and fuzztone. While there would always be arguments about who was the first to use feedback as a controlled musical sound, Beck is one of those who often gets the credit, and Keith Relf would describe Beck's guitar playing as being almost musique concrete.\n\nYou can hear the difference on the group's next single. \"Heart Full of Soul\" was again written by Gouldman, and was originally recorded with a sitar, which would have made it one of the first pop singles to use the instrument. However, they decided to replace the sitar part with Beck playing the same Indian-sounding riff on a heavily-distorted guitar:\n\n[Excerpt: The Yardbirds, \"Heart Full of Soul\"]\n\nThat made number two in the UK and the top ten in the US, and suddenly the world had a new guitar god, one who was doing things on records that nobody else had been doing. The group's next single was a double A-side, a third song written by Gouldman, \"Evil Hearted You\", coupled with an original by the group, \"Still I'm Sad\". Neither track was quite up to the standard of their previous couple of singles, but it still went to number three on the charts. From this point on, the group stopped using Gouldman's songs as singles, preferring to write their own material, but Gouldman had already started providing hits for other groups like the Hollies, for whom he wrote songs like “Bus Stop”:\n\n[Excerpt: The Hollies, “Bus Stop”]\n\nHis group The Mockingbirds had also signed to Immediate Records, who put out their classic pop-psych single “You Stole My Love”:\n\n[Excerpt: The Mockingbirds, “You Stole My Love”]\n\nWe will hear more of Gouldman later.\n\nIn the Yardbirds, meanwhile, the pressure was starting to tell on Keith. He was a deeply introverted person who didn't have the temperament for stardom, and he was uncomfortable with being recognised on the street. It also didn't help that his dad was also the band's driver and tour manager, which meant he always ended up feeling somewhat inhibited, and he started drinking heavily to try to lose some of those inhibitions.\n\nShortly after the recording of \"Evil Hearted You\", the group went on their first American tour, though on some dates they were unable to play as Gomelsky had messed up their work permits -- one of several things about Gomelsky's management of the group that irritated them. But they were surprised to find that they were much bigger in the US than in the UK. While the group had only released singles, EPs, and the one live album in the UK, and would only ever put out one UK studio album, they'd recorded enough that they'd already had an album out in the US, a compilation of singles, B-sides, and even a couple of demos, and that had been picked up on by almost every garage band in the country. On one of the US gigs, their opening act, a teenage group called the Spiders, were in trouble. They'd learned every song on that Yardbirds album, and their entire set was made up of covers of that material.\n\nThey'd gone down well supporting every other major band that came to town, but they had a problem when it came to the Yardbirds. Their singer described what happened next: \"We thought about it and we said, 'Look, we’re paying tribute to them—let’s just do our set.' And so, we opened for the Yardbirds and did all of their songs. We could see them in the back and they were smiling and giving us the thumbs up. And then they got up and just blew us off the stage—because they were the Yardbirds! And we just stood there going, 'Oh…. That’s how it’s done.' The Yardbirds were one of the best live bands I ever heard and we learned a lot that night.\"\n\nThat band, and later that lead singer, both later changed their name to Alice Cooper.\n\nThe trip to the US also saw a couple of recording sessions. Gomelsky had been annoyed at the bad drum sound the group had got in UK studios, and had loved Sam Phillips' drum sound on the old Sun records, so had decided to get in touch with Phillips and ask him to produce the group. He hadn't had a reply, but the group turned up at Phillips' new studio anyway, knowing that he lived in a flat above the studio.\n\nPhillips wasn't in, but eventually turned up at midnight, after a fishing trip, drunk. He wasn't interested in producing some group of British kids, but Gomelsky waved six hundred dollars at him, and he agreed. He produced two tracks for the group. One of those, \"Mr. You're a Better Man Than I\", was written by Mike Hugg of Manfred Mann and his brother:\n\n[Excerpt: The Yardbirds, \"Mister, You're a Better Man Than I\"]\n\nThe backing track there was produced by Phillips, but the lead vocal was redone in New York, as Relf was also drunk and wasn't singing well -- something Phillips pointed out, and which devastated Relf, who had grown up on records Phillips produced. Phillips' dismissal of Relf also grated on Beck -- even though Beck wasn't close to Relf, as the two competed for prominence on stage while the rest of the band kept to the backline, Beck had enormous respect for Relf's talents as a frontman, and thought Phillips horribly unprofessional for his dismissive attitude, though the other Yardbirds had happier memories of the session, not least because Phillips caught their live sound better than anyone had.\n\nYou can hear Relf's drunken incompetence on the other track they recorded at the session, their version of \"Train Kept A-Rollin'\", the song we covered way back in episode forty-four. Rearranged by Samwell-Smith and Beck, the Yardbirds' version built on the Johnny Burnette recording and turned it into one of the hardest rock tracks ever recorded to that point -- but Relf's drunk, sloppy, vocal was caught on the backing track. He later recut the vocal more competently, with Roy Halee engineering in New York, but the combination of the two vocals gives the track an unusual feel which inspired many future garage bands:\n\n[Excerpt: The Yardbirds, \"Train Kept A-Rollin'\"]\n\nOn that first US tour, they also recorded a version of Bo Diddley's \"I'm a Man\" at Chess Studios, where Diddley had recorded his original. Only a few weeks after the end of that tour they were back for a second tour, in support of their second US album, and they returned to Chess to record what many consider their finest original.\n\n\"Shapes of Things\" had been inspired by the bass part on Dave Brubeck's \"Pick Up Sticks\":\n\n[Excerpt: Dave Brubeck Quartet, \"Pick Up Sticks\"]\n\nSamwell-Smith and McCarty had written the music for the song, Relf and Samwell-Smith added lyrics, and Beck experimented with feedback, leading to one of the first psychedelic records to become a big hit, making number three in the UK and number eleven in the US:\n\n[Excerpt: The Yardbirds, \"Shapes of Things\"]\n\nThat would be the group's last record with Giorgio Gomelsky as credited producer -- although Samwell-Smith had been doing all the actual production work -- as the group were becoming increasingly annoyed at Gomelsky's ideas for promoting them, which included things like making them record songs in Italian so they could take part in an Italian song contest. Gomelsky was also working them so hard that Beck ended up being hospitalised with what has been variously described as meningitis and exhaustion. By the time he was out of the hospital, Gomelsky was fired.\n\nHis replacement as manager and co-producer was Simon Napier-Bell, a young dilettante and scenester who was best known for co-writing the English language lyrics for Dusty Springfield's \"You Don't Have to Say You Love Me\":\n\n[Excerpt: Dusty Springfield, \"You Don't Have to Say You Love Me\"]\n\nThe way Napier-Bell tells the story -- and Napier-Bell is an amusing raconteur, and his volumes of autobiography are enjoyable reads, but one gets the feeling that he will not tell the truth if a lie seems more entertaining -- is that the group chose him because of his promotion of a record he'd produced for a duo called Diane Ferraz and Nicky Scott:\n\n[Excerpt: Diane Ferraz and Nicky Scott, \"Me and You\"]\n\nAccording to Napier-Bell, both Ferraz and Scott were lovers of his, who were causing him problems, and he decided to get rid of the problem by making them both pop stars. As Ferraz was Black and Scott white, Napier-Bell sent photos of them to every DJ and producer in the country, and then when they weren't booked on TV shows or playlisted on the radio, he would accuse the DJs and producers of racism and threaten to go to the newspapers about it. As a result, they ended up on almost every TV show and getting regular radio exposure, though it wasn't enough to make the record a hit.\n\nThe Yardbirds had been impressed by how much publicity Ferraz and Scott had got, and asked Napier-Bell to manage them. He immediately set about renegotiating their record contract and getting them a twenty-thousand-pound advance -- a fortune in the sixties. He also moved forward with a plan Gomelsky had had of the group putting out solo records, though only Relf ended up doing so. Relf's first solo single was a baroque pop song, \"Mr. Zero\", written by Bob Lind, who had been a one-hit wonder with \"Elusive Butterfly\", and produced by Samwell-Smith:\n\n[Excerpt: Keith Relf, \"Mr. Zero\"]\n\nBeck, meanwhile, recorded a solo instrumental, intended for his first solo single but not released until nearly a year later.  \"Beck's Bolero\" has Jimmy Page as its credited writer, though Beck claims to be a co-writer, and features Beck and Page on guitars, session pianist Nicky Hopkins, and Keith Moon of the Who on drums. John Entwistle of the Who was meant to play bass, but when he didn't show to the session, Page's friend, session bass player John Paul Jones, was called up:\n\n[Excerpt: Jeff Beck, \"Beck's Bolero\"]\n\nThe five players were so happy with that recording that they briefly discussed forming a group together, with Moon saying of the idea \"That will go down like a lead zeppelin\". They all agreed that it wouldn't work and carried on with their respective careers.\n\nThe group's next single was their first to come from a studio album -- their only UK studio album, variously known as Yardbirds or Roger the Engineer. \"Over Under Sideways Down\" was largely written in the studio and is credited to all five group members, though Napier-Bell has suggested he came up with the chorus lyrics:\n\n[Excerpt: The Yardbirds, \"Over Under Sideways Down\"]\n\nThat became the group's fifth top ten single in a row, but it would be their last, because they were about to lose the man who, more than anyone else, had been responsible for their musical direction.\n\nThe group had been booked to play an upper-class black-tie event, and Relf had turned up drunk. They played three sets, and for the first, Relf started to get freaked out by the fact that the audience were just standing there, not dancing, and started blowing raspberries at them. He got more drunk in the interval, and in the second set he spent an entire song just screaming at the audience that they could copulate with themselves, using a word I'm not allowed to use without this podcast losing its clean rating. They got him offstage and played the rest of the set just doing instrumentals. For the third set, Relf was even more drunk. He came onstage and immediately fell backwards into the drum kit.\n\nOnly one person in the audience was at all impressed -- Beck's friend Jimmy Page had come along to see the show, and had thought it great anarchic fun. He went backstage to tell them so, and found Samwell-Smith in the middle of quitting the group, having finally had enough. Page, who had turned down the offer to join the group two years earlier, was getting bored of just being a session player and decided that being a pop star seemed more fun. He immediately volunteered himself as the group's new bass player, and we'll see how that played out in a future episode...",
  "enclosure": "",
  "itunes:summary": "Episode 126 of A History of Rock Music in Five Hundred Songs looks at “For Your Love\", the Yardbirds, and the beginnings of heavy rock and the guitar hero.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a twenty-minute bonus episode available, on \"A Lover's Concerto\" by the Toys.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I’ve created a Mixcloud playlist, with full versions of all the songs excerpted in this episode.\n\nThe Yardbirds have one of the most mishandled catalogues of all the sixties groups, possibly the most mishandled. Their recordings with Giorgio Gomelsky, Simon Napier-Bell and Mickie Most are all owned by different people, and all get compiled separately, usually with poor-quality live recordings, demos, and other odds and sods to fill up a CD's running time. The only actual authoritative compilation is the long out-of-print Ultimate! .\n\nInformation came from a variety of sources. Most of the general Yardbirds information came from The Yardbirds by Alan Clayson and Heart Full of Soul: Keith Relf of the Yardbirds by David French.\n\nSimon Napier-Bell's You Don't Have to Say You Love Me is one of the most entertaining books about the sixties music scene, and contains several anecdotes about his time working with the Yardbirds, some of which may even be true.\n\nSome information about Immediate Records came from Immediate Records by Simon Spence, which I'll be using more in future episodes.\n\nInformation about Clapton came from Motherless Child by Paul Scott, while information on Jeff Beck came from Hot Wired Guitar: The Life of Jeff Beck by Martin Power.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nToday, we're going to take a look at the early career of the band that, more than any other band, was responsible for the position of lead guitarist becoming as prestigious as that of lead singer. We're going to look at how a blues band launched the careers of several of the most successful guitarists of all time, and also one of the most successful pop songwriters of the sixties and seventies. We're going to look at \"For Your Love\" by the Yardbirds:\n\n[Excerpt: The Yardbirds, \"For Your Love\"]\n\nThe roots of the Yardbirds lie in a group of schoolfriends in Richmond, a leafy suburb of London. Keith Relf, Laurie Gane, Paul Samwell-Smith and Jim McCarty were art-school kids who were obsessed with Sonny Terry and Jimmy Reed, and who would hang around the burgeoning London R&B scene, going to see the Rolling Stones and Alexis Korner in Twickenham and at Eel Pie Island, and starting up their own blues band, the Metropolis Blues Quartet.\n\nHowever, Gane soon left the group to go off to university, and he was replaced by two younger guitarists, Top Topham and Chris Dreja, with Samwell-Smith moving from guitar to bass. As they were no longer a quartet, they renamed themselves the Yardbirds, after a term Relf had found on the back of an album cover, meaning a tramp or hobo.\n\nThe newly-named Yardbirds quickly developed their own unique style -- their repertoire was the same mix of Howlin' Wolf, Bo Diddley, Jimmy Reed and Chuck Berry as every other band on the London scene, but they included long extended improvisatory  instrumental sequences with Relf's harmonica playing off Topham's lead guitar. The group developed a way of extending songs, which they described as a “rave-up” and would become the signature of their live act – in the middle of a song they would go into a long instrumental solo in double-time, taking the song twice as fast and improvising heavily, before dropping back to the original tempo to finish the song off. These “rave-up” sections would often be much longer than ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 126 of A History of Rock Music in Five Hundred Songs looks at “For Your Love\", the Yardbirds, and the beginnings of heavy rock and the guitar hero.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a twenty-minute bonus episode available, on \"A Lover's Concerto\" by the Toys.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I’ve created a Mixcloud playlist, with full versions of all the songs excerpted in this episode.\n\nThe Yardbirds have one of the most mishandled catalogues of all the sixties groups, possibly the most mishandled. Their recordings with Giorgio Gomelsky, Simon Napier-Bell and Mickie Most are all owned by different people, and all get compiled separately, usually with poor-quality live record",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}