{
  "author": {
    "name": "Hunter L. Clark and Matthew Higgins"
  },
  "title": "What Is the Outlook for China’s External Surplus?",
  "link": [
    "",
    "",
    ""
  ],
  "id": "https://libertystreeteconomics.newyorkfed.org/?p=18631",
  "updated": "2022-10-14T21:42:34Z",
  "published": "2022-10-17T11:00:00Z",
  "category": [
    "",
    "",
    ""
  ],
  "summary": "The sharp slowdown in China’s property sector has reignited debate over the country’s future role as a net provider of savings to the global economy. The debate revolves around whether a sustained decline in property investment will spur a long-term increase in China’s current account surplus, given  the country’s high savings rate. However, China’s rapidly aging population presents opposing forces that complicate this story. The shift of a large share of its population from working life to retirement will reduce savings supply even as a shrinking labor force will reduce investment demand. In this post, we focus on the demographic part of the story and find that this force will exert considerable downward pressure on China’s current account surplus in coming years.",
  "content": "<p class=\"ts-blog-article-author\">Hunter L. Clark and Matthew Higgins</p>\n\n\n\n<figure class=\"lse-featured-image\">\n\t<img width=\"460\" height=\"288\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_460-1.jpg?w=460\" class=\"cover-image asset-image img-responsive wp-post-image\" alt=\"Photo: decorative: Concept of pension payments in China, savings at retirement, pensioner with money\" loading=\"lazy\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_460-1.jpg 920w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_460-1.jpg?resize=460,288 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_460-1.jpg?resize=768,481 768w\" sizes=\"(max-width: 460px) 100vw, 460px\" /></figure>\n\n\n\n<p>The sharp slowdown in China’s property sector has reignited debate over the country’s future role as a net provider of savings to the global economy. The debate revolves around whether a sustained decline in property investment will spur a long-term increase in China’s current account surplus, given  the country’s high savings rate. However, China’s rapidly aging population presents opposing forces that complicate this story. The shift of a large share of its population from working life to retirement will reduce savings supply even as a shrinking labor force will reduce investment demand. In this post, we focus on the demographic part of the story and find that this force will exert considerable downward pressure on China’s current account surplus in coming years.</p>\n\n\n\n<h4>Secular Decline in China’s External Balance Upended by the Pandemic</h4>\n\n\n\n<p>The current account balance (CAB) is the broadest measure of a country’s trade balance, encompassing the balance on goods and services, net income from overseas investments, and net transfers. As an accounting identity, the CAB is also equal to the gap between domestic savings and domestic investment. A country with a CAB surplus, such as China, places its extra savings in foreign financial markets, making it a net lender to the rest of the world. A country with a CAB deficit, such as the U.S., relies on foreign savings to finance part of its investment spending, making it a net borrower from the rest of the world.</p>\n\n\n\n<p>Before the pandemic China’s CAB had been in pronounced secular decline. The chart below shows the CAB and a close proxy as shares of GDP. The blue line is the CAB itself. The red line is the goods and services balance—the&nbsp;CAB excluding net income on overseas investments and net transfers—as this variable is available over a longer period.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">China&#8217;s External Surplus Shrank Before Pandemic </p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch1.png?w=363\" alt=\" Liberty Street Economics chart showing China’s current account balance and the goods and services balance as a percent of GDP from 1952 to 2017. \" class=\"wp-image-18686\" width=\"465\" height=\"368\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch1.png 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch1.png?resize=460,365 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch1.png?resize=768,609 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch1.png?resize=363,288 363w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch1.png?resize=1536,1218 1536w\" sizes=\"(max-width: 465px) 100vw, 465px\" /><figcaption>Sources: NBS and SAFE via CEIC.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p>China’s CAB remained close to balance prior to the early 1980s, due to the country being largely closed to foreign capital and goods markets. It became far more volatile when economic reforms were initiated during that decade. The picture changed still more dramatically after 1990 when China&#8217;s modern reform period began, and the country became more integrated into global capital and goods markets—a development exemplified by China&#8217;s admission into the WTO in 2001. China’s surplus peaked at 10 percent of GDP in 2007. It then began a precipitous decline, falling to below 1 percent of GDP by 2018, and leading many analysts to conclude that China was on the verge of flipping to becoming a <a href=\"https://www.economist.com/leaders/2019/03/16/china-may-soon-run-its-first-annual-current-account-deficit-in-decades\">deficit country</a>. &nbsp;</p>\n\n\n\n<p>The pandemic disrupted this trend. Domestic restrictions that suppressed household consumption, booming exports given China&#8217;s relatively early reopening, and plummeting outbound travel caused the CAB to swell to nearly 2 percent of GDP. The question we want to address is whether the pre-pandemic downward trend will resume once the dust settles. A strong argument can be made that China’s investment rate remains too high, and that falling investment will lead to larger surpluses. (Recall that the CAB is the difference between saving and investment.)&nbsp; At the same time, other forces could lead to lower household, corporate, and government savings.</p>\n\n\n\n<h4>Demographics Play an Important Role in the Balance Between Saving and Investment</h4>\n\n\n\n<p>Although a country&#8217;s savings-investment balance is influenced by a myriad of cyclical and policy factors, demographic factors can play a powerful role. The reason lies in the differential impact of population age structure on savings supply and investment demand. The intuition is as follows. Saving supply should be positively tied to the share of mature adults, through its connection with retirement needs. (Conversely, higher child or elderly population shares should be tied to lower savings, since these populations consume while generating little income.)&nbsp; Investment demand should be positively tied to the share of young adults, through its connection with labor force growth. (Conversely, negative demographic pressure on investment should emerge as the labor force ages and employment growth slows or even turns negative.) So long as a country is not closed to international capital flows—thus forcing the current account to remain balanced—differences in the timing of these saving and investment effects should lead to demographically-induced changes in the current account.</p>\n\n\n\n<p>China’s demographic profile is undergoing profound change, with population aging occurring at a pace never before seen for a country at its income level. As shown in the chart below, China is now well past its peak “demographic dividend”—the ratio of its working-age population to its population of young and old dependents. Moreover, this is occurring at a much lower income level than observed in other countries. (In fact, China’s working-age population is declining not only as a percent of the total but also in absolute terms.) China&#8217;s outlier status is starkest at the upper tail of the age distribution. The share of China&#8217;s population over 65&nbsp;years old is currently about 12 percent, even though China&#8217;s per capita income is only about one-half of Japan’s when it reached this milestone in 1989.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">China&#8217;s Demographic Dividend Is Falling Despite Relatively Low Income Level</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch2-1.png?w=391\" alt=\"Liberty Street Economics chart showing China’s falling demographic dividend compared to South Korea, Taiwan, and Japan. China is now well past its peak demographic dividend. Moreover, this is occurring at a much lower income level than observed in other countries.\" class=\"wp-image-18732\" width=\"466\" height=\"343\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch2-1.png 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch2-1.png?resize=460,339 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch2-1.png?resize=768,566 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch2-1.png?resize=391,288 391w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch2-1.png?resize=1536,1133 1536w\" sizes=\"(max-width: 466px) 100vw, 466px\" /><figcaption>Sources: United Nations, Penn World Tables, and authors&#8217; calculations.<br>Notes: Demographic dividend is calculated as ratio of working population to young (0-14) and old population (65+). Per capita income shows income at purchasing power parity calculated from PWT. Years shown are 1950 &#8211; 2019 depending on availability.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<h4><strong>Empirical Work Points to Downward Pressure on China’s External Balance</strong></h4>\n\n\n\n<p>To check how the intuition holds up empirically, we follow the methodology of <a href=\"https://econpapers.repec.org/article/ieriecrev/v_3a39_3ay_3a1998_3ai_3a2_3ap_3a343-69.htm\">Higgins</a> (1998).&nbsp; In particular, we estimate statistical models that treat savings, investment, and the CAB (measured as shares of GDP) as functions of the following explanatory variables: population age shares, productivity growth, the relative price of investment goods, and fixed country-specific characteristics. (Our data set is comprised of 142 countries and covers 1950 to 2019.)&nbsp; Our interest in this post is on the role played by the age structure variables.</p>\n\n\n\n<p>The three panels in the chart below show the results of this analysis. Each panel shows the amount that saving, investment, and the CAB change, as a percent of GDP, per a 1 percentage point change in the share of the age cohort shown on the horizontal axis (holding other variables constant). Saving coefficients lift into positive territory around the early-30s, peak at around age 50, and then turn negative starting around 65. Those for investment turn positive and peak at a much earlier age, and then turn down and eventually becomes negative again. The net result of these shifts in saving and investment is demographic &#8220;pressure&#8221; on a country’s CAB, shown in the third panel. This pressure is initially negative for young populations, positive from around the mid- to late-30s, peaks in the mid-50s, and then turns down and is negative again in the older age cohorts.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Demographic Age Structure Has Differential Effects on Saving, Investment, and the Current Account</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1840\" height=\"680\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch3.png?w=460\" alt=\"A three-panel chart showing how China’s demographic age structure has differential effects on saving, investment, and the current account. \" class=\"wp-image-18689\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch3.png 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch3.png?resize=460,170 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch3.png?resize=768,284 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch3.png?resize=1536,568 1536w\" sizes=\"(max-width: 1840px) 100vw, 1840px\" /><figcaption>Sources: Penn World Tables, United Nations World Population Prospects, International Monetary Fund, World Bank, and authors&#8217; calculations.<br>Note: Vertical lines show 1 standard deviation bootstrapped confidence intervals.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p>With these coefficients in hand, one can use historical data and projections of China’s population age distribution to get an idea of how this demographic pressure has influenced its CAB in the past, and how the CAB may evolve in coming decades. The chart below shows the current account balance alongside the pressure coming from demographics, both historically and in prospect using population projections from the United Nations. This pressure is calculated as a cumulative change since 1950.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Demographic Forces Will Reduce Surpluses</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch4.png?w=391\" alt=\"Liberty Street Economics chart showing China’s current account balance alongside the pressure coming from demographics since 1952, both historically and in prospect using population projections from the United Nations. \" class=\"wp-image-18691\" width=\"461\" height=\"339\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch4.png 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch4.png?resize=460,339 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch4.png?resize=768,566 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch4.png?resize=391,288 391w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_china-external_clark_ch4.png?resize=1536,1132 1536w\" sizes=\"(max-width: 461px) 100vw, 461px\" /><figcaption>Sources: NBS and SAFE via CEIC.<br>Note: The current account splices the goods and services balance from the national accounts prior to 1982 to the current account balance from the balance of payments from 1982 onward.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p>The chart shows that during the first thirty years demographic pressure on the CAB was increasingly negative. This suggests that China’s demographic profile would have been contributing to a CAB deficit during this period—and that the country could have benefited from a higher level of investment if it had been financially open and able to borrow from abroad. These demographic pressures hit an inflection point just as the reform period began in the early 1980s, and then went into overdrive beginning in the 1990s, contributing to the boom in CAB surpluses. Finally, demographic pressure hit a downward inflection point just before the pandemic. The downward weight on China&#8217;s external balance is projected to grow steadily more heavy over the next two decades. In fact, holding other influences constant and starting from its pre-pandemic level, changes in age structure could be enough to drag China&#8217;s CAB into deficit only a few years from now. If demography is destiny, the country&#8217;s days as a net lender to the rest of the world appear numbered.</p>\n\n\n\n<h4>Conclusion</h4>\n\n\n\n<p>Our analysis of the potential impact of demographic change on China&#8217;s current account should not be taken as a prediction. While the demographic coefficients in our statistical model appear estimated fairly precisely, they come with a margin of error that is transmitted into the projections.</p>\n\n\n\n<p>More important, by design, our projections only consider the impact of demographic variables, abstracting from other cyclical and policy factors that can influence the CAB. Indeed, we began this post by referring to popular speculation that a real estate crash in China might cause a collapse in investment, swelling the CAB. A risk in the opposite direction comes from the country&#8217;s low ratio of household consumption to GDP. Measures to liberalize consumers&#8217; access to credit markets could unlock suppressed household consumption, leading to a decline in savings and additional downward weight on the CAB. Equally, new restrictions on capital outflows could put a lid on the magnitude of future current account deficits. </p>\n\n\n\n<p>The most we can say is that a continued role for China as net lender to the rest of the world would involve a long march up a steep demographic hill. Even if the authorities were to succeed in boosting birthrates—through relaxation of the one-child policy and <a href=\"https://www.bloomberg.com/news/articles/2021-07-20/china-aims-to-lower-child-expenses-in-effort-to-boost-birth-rate?sref=rb4Y35xE\">other incentives</a>, so far with little success—the resultant increase in children and young workers would put further downward pressure on the CAB relative to the estimates presented in this post.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<div class=\"wp-block-media-text alignwide\" style=\"grid-template-columns:15% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"90\" height=\"90\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/05/clark_hunter.jpg?w=90\" alt=\"Photo: portrait of Hunter Clark\" class=\"wp-image-16357 size-full\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/05/clark_hunter.jpg 90w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/05/clark_hunter.jpg?resize=45,45 45w\" sizes=\"(max-width: 90px) 100vw, 90px\" /></figure><div class=\"wp-block-media-text__content\">\n<p class=\"is-style-bio-contact has-large-font-size\"><a rel=\"noreferrer noopener\" href=\"https://www.newyorkfed.org/research/economists/clark\" target=\"_blank\">Hunter L. Clark</a> is an international policy advisor in International Studies in the Federal Reserve Bank of New York’s Research and Statistics Group. </p>\n</div></div>\n\n\n\n<div style=\"height:12px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<div class=\"wp-block-media-text alignwide\" style=\"grid-template-columns:15% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"90\" height=\"90\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2021/10/higgins_matthew.jpg?w=90\" alt=\"Photo: portrait of Matthew Higgins\" class=\"wp-image-12353 size-full\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2021/10/higgins_matthew.jpg 90w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2021/10/higgins_matthew.jpg?resize=45,45 45w\" sizes=\"(max-width: 90px) 100vw, 90px\" /></figure><div class=\"wp-block-media-text__content\">\n<p class=\"is-style-bio-contact has-large-font-size\"><a rel=\"noreferrer noopener\" href=\"https://www.newyorkfed.org/research/economists/higgins\" target=\"_blank\">Matthew Higgins</a> is an economic research advisor in International Studies in the Federal Reserve Bank of New York’s Research and Statistics Group.</p>\n</div></div>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-disclaimer\">\n    <strong>How to cite this post:</strong><br/>\n    Hunter L. Clark and Matthew Higgins, &#8220;What Is the Outlook for China’s External Surplus?,&#8221; Federal Reserve Bank of New York <em>Liberty Street Economics</em>, October 17, 2022, https://libertystreeteconomics.newyorkfed.org/2022/10/what-is-the-outlook-for-chinas-external-surplus/.</p>\n</p>\n\n\n\n<p class=\"is-style-related-reading\"><strong>Related reading:</strong><br><a href=\"https://libertystreeteconomics.newyorkfed.org/2022/09/is-china-running-out-of-policy-space-to-navigate-future-economic-challenges/\">Is China Running Out of Policy Space to Navigate Future Economic Challenges?</a><br><a href=\"https://libertystreeteconomics.newyorkfed.org/2022/06/does-chinas-zero-covid-strategy-mean-zero-economic-growth/\">Does China’s Zero COVID Strategy Mean Zero Economic Growth?</a></p>\n\n\n\n<p class=\"is-style-related-reading\"><br></p>\n\n\n\n<div>\n<div style=\"height:24px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<p class=\"is-style-disclaimer\"><strong>Disclaimer</strong><br>The views expressed in this post are those of the author(s) and do not necessarily reflect the position of the Federal Reserve Bank of New York or the Federal Reserve System. Any errors or omissions are the responsibility of the author(s).</p>\n</div>\n",
  "thr:total": 0
}