{
  "title": "Accused &#8216;Raccoon&#8217; Malware Developer Fled Ukraine After Russian Invasion",
  "link": "https://krebsonsecurity.com/2022/10/accused-raccoon-malware-developer-fled-ukraine-after-russian-invasion/",
  "comments": "https://krebsonsecurity.com/2022/10/accused-raccoon-malware-developer-fled-ukraine-after-russian-invasion/#comments",
  "dc:creator": "BrianKrebs",
  "pubDate": "Mon, 31 Oct 2022 20:53:27 +0000",
  "category": [
    "A Little Sunshine",
    "Ne'er-Do-Well News",
    "Alex Jones",
    "F. Andino Reynal",
    "Mark Sokolovsky",
    "Raccoon Infostealer",
    "Raccoon Stealer"
  ],
  "guid": "https://krebsonsecurity.com/?p=61714",
  "description": "A 26-year-old Ukrainian man is awaiting extradition to the United States on charges that he acted as a core developer for Raccoon, a \"malware-as-a-service\" offering that helped paying customers steal passwords and financial data from millions of cybercrime victims. KrebsOnSecurity has learned that the defendant was busted in March 2022, after fleeing mandatory military service in Ukraine in the weeks following the Russian invasion.",
  "content:encoded": "<p>A 26-year-old Ukrainian man is awaiting extradition from The Netherlands to the United States on charges that he acted as a core developer for <strong>Raccoon</strong>, a popular &#8220;malware-as-a-service&#8221; offering that helped paying customers steal passwords and financial data from millions of cybercrime victims. KrebsOnSecurity has learned that the defendant was busted in March 2022, after fleeing mandatory military service in Ukraine in the weeks following the Russian invasion.</p>\n<div id=\"attachment_61715\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-61715\" loading=\"lazy\" class=\" wp-image-61715\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/sokolovskyborder.png\" alt=\"\" width=\"750\" height=\"423\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/sokolovskyborder.png 1130w, https://krebsonsecurity.com/wp-content/uploads/2022/10/sokolovskyborder-768x433.png 768w, https://krebsonsecurity.com/wp-content/uploads/2022/10/sokolovskyborder-782x441.png 782w\" sizes=\"(max-width: 750px) 100vw, 750px\" /><p id=\"caption-attachment-61715\" class=\"wp-caption-text\">Ukrainian national Mark Sokolovsky, seen here in a Porsche Cayenne on Mar. 18 fleeing mandatory military service in Ukraine. This image was taken by Polish border authorities as Sokolovsky&#8217;s vehicle entered Germany. Image: KrebsOnSecurity.com.</p></div>\n<p>The <strong>U.S. Attorney for the Western District of Texas</strong> unsealed an indictment last week that named Ukrainian national <strong>Mark Sokolovsky</strong> as the core developer for the Raccoon Infostealer business, which was marketed on several Russian-language cybercrime forums beginning in 2019.</p>\n<p>Raccoon was essentially a Web-based control panel, where &#8212; for $200 a month &#8212; customers could get the latest version of the Raccoon Infostealer malware, and interact with infected systems in real time. Security experts say the passwords and other data stolen by Raccoon malware were often resold to groups engaged in deploying ransomware.</p>\n<p>Working with investigators in Italy and The Netherlands, U.S. authorities seized a copy of the server used by Raccoon to help customers manage their botnets. According to the <strong>U.S. Justice Department</strong>, FBI agents have identified more than 50 million unique credentials and forms of identification (email addresses, bank accounts, cryptocurrency addresses, credit card numbers, etc.) stolen with the help of Raccoon.</p>\n<div id=\"attachment_61733\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><a href=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/raccoonpanel.png\" target=\"_blank\" rel=\"noopener\"><img aria-describedby=\"caption-attachment-61733\" loading=\"lazy\" class=\"wp-image-61733\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/raccoonpanel.png\" alt=\"\" width=\"750\" height=\"470\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/raccoonpanel.png 945w, https://krebsonsecurity.com/wp-content/uploads/2022/10/raccoonpanel-768x481.png 768w, https://krebsonsecurity.com/wp-content/uploads/2022/10/raccoonpanel-782x490.png 782w\" sizes=\"(max-width: 750px) 100vw, 750px\" /></a><p id=\"caption-attachment-61733\" class=\"wp-caption-text\">The Raccoon v. 1 web panel, where customers could search by infected IP, and stolen cookies, wallets, domains and passwords.</p></div>\n<p>The unsealed <a href=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/SokolovskyIndictment.pdf\" target=\"_blank\" rel=\"noopener\">indictment</a> (PDF) doesn&#8217;t delve much into how investigators tied Sokolovsky to Raccoon, but two sources close to the investigation shared more information about that process on condition of anonymity because they were not authorized to discuss the case publicly.</p>\n<p>According to those sources, U.S. authorities zeroed in on an operational security mistake that the Raccoon developer made early on in his posts to the crime forums, connecting a Gmail account for a cybercrime forum identity used by the Raccoon developer (&#8220;Photix&#8221;) to an Apple iCloud account belonging to Sokolovsky. For example, the indictment includes a photo that investigators subpoenaed from Sokolovsky&#8217;s iCloud account that shows him posing with several stacks of bundled cash.</p>\n<div id=\"attachment_61717\" style=\"width: 559px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-61717\" loading=\"lazy\" class=\"size-full wp-image-61717\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/marks-stacks.png\" alt=\"\" width=\"549\" height=\"776\" /><p id=\"caption-attachment-61717\" class=\"wp-caption-text\">A selfie pulled from Mark Sokolovsky&#8217;s iCloud account. Image: USDOJ.</p></div>\n<p>When Russia invaded Ukraine in late February 2022, Sokolovsky was living in Kharkiv, a city in northeast Ukraine that would soon come under heavy artillery bombardment from Russian forces. Authorities monitoring Sokolovsky&#8217;s iCloud account had spent weeks watching him shuttle between Kharkiv and the Ukrainian capital Kyiv, but on Mar. 18, 2022, his phone suddenly showed up in Poland.</p>\n<p>Investigators learned from Polish border guards that Sokolovsky had fled Ukraine in a Porsche Cayenne along with a young blond woman, leaving his mother and other family behind. The image at the top of this post was shared with U.S. investigators by Polish border security officials, and it shows Sokolovsky leaving Poland for Germany on Mar. 18.</p>\n<p>At the time, all able-bodied men of military age were required to report for service to help repel the Russian invasion, and it would have been illegal for Sokolovsky to leave Ukraine without permission. But both sources said investigators believe Sokolovsky bribed border guards to let them pass.</p>\n<p>Authorities soon tracked Sokolovsky&#8217;s phone through Germany and eventually to The Netherlands, with his female companion helpfully documenting every step of the trip on her Instagram account. Here is a picture she posted of the two embracing upon their arrival in Amsterdam&#8217;s Dam Square:</p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-61718\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/marks-damsquare.png\" alt=\"\" width=\"739\" height=\"681\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/marks-damsquare.png 777w, https://krebsonsecurity.com/wp-content/uploads/2022/10/marks-damsquare-768x708.png 768w\" sizes=\"(max-width: 739px) 100vw, 739px\" /></p>\n<p>Authorities in The Netherlands arrested Sokolovsky on Mar. 20, and quickly seized control over the Raccoon Infostealer infrastructure. Meanwhile, on March 25 the accounts that had previously advertised the Raccoon Stealer malware on cybercrime forums announced the service was closing down. The parting message to customers said nothing of an arrest, and instead insinuated that the core members in charge of the malware-as-a-service project had perished in the Russian invasion.<span id=\"more-61714\"></span></p>\n<p>&#8220;Unfortunately, due to the &#8216;special operation,&#8217; we will have to close our Raccoon Stealer project,&#8221; the team announced Mar. 25. &#8220;Our team members who were responsible for critical components of the product are no longer with us. Thank you for this experience and time, for every day, unfortunately everything, sooner or later, the end of the WORLD comes to everyone.&#8221;</p>\n<p>Sokolovsky&#8217;s extradition to the United States has been granted, but he is appealing that decision. He faces one count of conspiracy to commit computer fraud; one count of conspiracy to commit wire fraud; one count of conspiracy to commit money laundering, and one count of aggravated identity theft.</p>\n<p>Sources tell KrebsOnSecurity that Sokolovsky has been consulting with Houston, Tx.-based attorney <strong>F. Andino Reynal</strong>, the same lawyer who represented <strong>Alex Jones</strong> in the recent defamation lawsuit against Jones and his conspiracy theory website <strong>Infowars</strong>. Reynal was responsible for what Jones himself referred to as <a href=\"https://www.reuters.com/legal/government/alex-jones-lawyer-terrible-horrible-no-good-very-bad-week-2022-08-08/\" target=\"_blank\" rel=\"noopener\">the &#8220;Perry Mason&#8221; moment of the trial</a>, wherein the plaintiff&#8217;s lawyer revealed that Reynal had inadvertently given them an entire digital copy of Jones&#8217;s cell phone. Mr. Reynal did not respond to requests for comment.</p>\n<p>If convicted, Sokolovsky faces a maximum penalty of 20 years in prison for the wire fraud and money laundering offenses, five years for the conspiracy to commit computer fraud charge, and a mandatory consecutive two-year term for the aggravated identity theft offense.</p>\n<p>The Justice Department has set up a website &#8212; <a href=\"https://raccoon.ic3.gov/home\" target=\"_blank\" rel=\"noopener\">raccoon.ic3.gov</a> &#8212; that allows visitors to check whether their email address shows up in the data collected by the Raccoon Stealer service.</p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-61723\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/raccoon-ic3.png\" alt=\"\" width=\"751\" height=\"491\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/raccoon-ic3.png 1117w, https://krebsonsecurity.com/wp-content/uploads/2022/10/raccoon-ic3-768x502.png 768w, https://krebsonsecurity.com/wp-content/uploads/2022/10/raccoon-ic3-782x511.png 782w\" sizes=\"(max-width: 751px) 100vw, 751px\" /></p>\n",
  "wfw:commentRss": "https://krebsonsecurity.com/2022/10/accused-raccoon-malware-developer-fled-ukraine-after-russian-invasion/feed/",
  "slash:comments": 32
}