{
  "title": "MIT engineers develop a low-cost terahertz camera",
  "link": "https://news.mit.edu/2022/terahertz-camera-low-cost-1104",
  "description": "The device provides greater sensitivity and speed than previous versions, and could be used for industrial inspection, airport security, and communications.",
  "pubDate": "Fri, 04 Nov 2022 12:00:00 -0400",
  "guid": "https://news.mit.edu/2022/terahertz-camera-low-cost-1104",
  "dc:creator": "David L. Chandler | MIT News Office",
  "content:encoded": "<div>\n<p>Terahertz radiation, whose wavelengths lie between those of microwaves and visible light, can penetrate many nonmetallic materials and detect signatures of certain molecules. These handy qualities could lend themselves to a wide array of applications, including airport security scanning, industrial quality control, astrophysical observations, nondestructive characterization of materials, and wireless communications with higher bandwidth than current cellphone bands.</p>\n\n<p></p>\n\n<p>However, designing devices to detect and make images from terahertz waves has been challenging, and most existing terahertz devices are expensive, slow, bulky, and require vacuum systems and extremely low temperatures.</p>\n\n<p></p>\n\n<p>Now, researchers at MIT, the University of Minnesota, and Samsung have developed a new kind of camera that can detect terahertz pulses rapidly, with high sensitivity, and at room temperature and pressure. What’s more, it can simultaneously capture information about the orientation, or “polarization,” of the waves in real-time, which existing devices cannot. This information can be used to characterize materials that have asymmetrical molecules or to determine the surface topography of materials.</p>\n\n<p></p>\n\n<p>The new system uses particles called quantum dots, which, it has recently been found, can emit visible light when stimulated by terahertz waves. The visible light can then be recorded by a device that is similar to a standard electronic camera’s detector and can even be seen with the naked eye. The device is described in <a href=\"https://www.nature.com/articles/s41565-022-01243-9\" target=\"_blank\">a paper</a> published today in the journal <em>Nature Nanotechnology</em>, by MIT doctoral student Jiaojian Shi, professor of chemistry Keith Nelson, and 12 others.</p>\n\n<p></p>\n\n<p>The team produced two different devices that can operate at room temperature: One uses the quantum dot’s ability to convert terahertz pulses to visible light, enabling the device to produce images of materials; the other produces images showing the polarization state of the terahertz waves.</p>\n\n<p></p>\n\n<p>The new “camera” consists of several layers, made with standard manufacturing techniques like those used for microchips. An array of nanoscale parallel lines of gold, separated by narrow slits, lies on the substrate; above that is a layer of the light-emitting quantum dot material; and above that is a CMOS chip used to form an image. The polarization detector, called a polarimeter, uses a similar structure, but with nanoscale ring-shaped slits, which allows it to detect the polarization of the incoming beams.</p>\n\n<p></p>\n\n<p>The photons of terahertz radiation have extremely low energy, Nelson explains, which makes them hard to detect. “So, what this device is doing is converting that little tiny photon energy into something visible that’s easy to detect with a regular camera,” he says. In the team’s experiments, the device was able to detect terahertz pulses at low intensity levels that surpassed the capability of today’s large and expensive systems.</p>\n\n<p></p>\n\n<p>The researchers demonstrated the capabilities of the detector by taking terahertz-illuminated pictures of some of the structures used in their devices, such as the nano-spaced gold lines and the ring-shaped slits used for the polarized detector, proving the sensitivity and resolution of the system.</p>\n<img alt=\"Gif is mainly black. At the corner, a ruler measures 50 μms. As if tracing a circle’s outline, white and purple flares appear and disappear. \" data-align=\"center\" data-caption=\"A CMOS camera was used to capture the rotation of a terahertz beam.&amp;nbsp;Courtesy of the researchers\" data-entity-type=\"file\" data-entity-uuid=\"85a1c683-7b9e-44e0-8b73-5c1b41b0296d\" src=\"/sites/default/files/images/inline/terahertz-camera.gif\" />\n<p>Developing a practical terahertz camera requires a component that produces terahertz waves to illuminate a subject, and another that detects them. On the latter point, current terahertz detectors are either very slow, because they rely on detecting heat generated by the waves striking a material, and heat propagates slowly, or they use photodetectors that are relatively fast, but have very low sensitivity. In addition, until now, most approaches have required a whole array of terahertz detectors, each producing one pixel of the image. “Each one is quite expensive,” Shi says, so “once they start to make a camera, the cost of the detectors starts to scale up really, really quickly.”</p>\n\n<p></p>\n\n<p>While the researchers say they have cracked the terahertz pulse detection problem with their new work, the lack of good sources remains — and is being worked on by many research groups around the world. The terahertz source used in the new study is a large and cumbersome array of lasers and optical devices that cannot easily be scaled to practical applications, Nelson says, but new sources based microelectronic techniques are well under development.</p>\n\n<p></p>\n\n<p>“I think that’s really the rate-limiting step: Can you make the [terahertz] signals in a facile way that isn’t expensive?” he says. “But there’s no question that’s coming.”</p>\n\n<p></p>\n\n<p>Sang-Hyun Oh, a co-author of the paper and a McKnight Professor of Electrical and Computer Engineering at the University of Minnesota, adds that while present versions of terahertz cameras cost tens of thousands of dollars, the inexpensive nature of CMOS cameras used for this system makes it “a big step forward toward building a practical terahertz camera.” The potential for commercialization led Samsung, which makes CMOS camera chips and quantum dot devices, to collaborate on this research.</p>\n\n<p></p>\n\n<p>Traditional detectors for such wavelengths operate at liquid helium temperatures (-452 degrees Fahrenheit), Nelson says, which is necessary to pick out the extremely low energy of the terahertz photons from background noise. The fact that this new device can detect and produce images of these wavelengths with a conventional visible-light camera at room temperature has been unexpected to those working in the terahertz field. “People are like, ‘What?’ It’s kind of unheard of, and people get very surprised,” says Oh.</p>\n\n<p></p>\n\n<p>There are many avenues for further improving the sensitivity of the new camera, the researchers say, including further miniaturization of the components and ways of protecting the quantum dots. Even at the present detection levels, the device could have some potential applications, they say.</p>\n\n<p></p>\n\n<p>In terms of commercialization potential for the new device, Nelson says that quantum dots are now inexpensive and readily available, currently being used in consumer products such as television screens. The actual fabrication of the camera devices is more complex, he says, but is also based on existing microelectronics technology. In fact, unlike existing terahertz detectors, the entire terahertz camera chip can be manufactured using today’s standard microchip production systems, meaning that ultimately mass production of the devices should be possible and relatively inexpensive.</p>\n\n<p></p>\n\n<p></p>\n\n<p>Already, even though the camera system is still far from commercialization, researchers at MIT have been using the new lab device when they need a quick way to detect terahertz radiation. “We don’t own one of those expensive cameras,” Nelson says, “but we have lots of these little devices. People will just stick one of these in the beam and look by eye at the visible light emission so they know when the terahertz beam is on. … People found it really handy.”</p>\n\n<p></p>\n\n<p>While terahertz waves could in principle be used to detect some astrophysical phenomena, those sources would be extremely weak and the new device is not able to capture such weak signals, Nelson says, although the team is working on improving its sensitivity. “The next generation lies in making everything smaller, so it will be much more sensitive,” he says.</p>\n\n<p></p>\n\n<p>The research team included Daehan Yoo at the University of Minnesota; Ferran Vidal-Codina, Ngoc-Cuong Nguyen, Hendrik Utzat, Jinchi Han, Vladimir Bulović, Moungi Bawendi, and Jaime Peraire at MIT; Chan-Wook Baik and Kyung-Sang Cho at Samsung Advanced Institute of Technology; and Aaron Lindenberg at Stanford University. The work was supported by the U.S. Army Research Office through the MIT Institute for Soldier Nanotechnologies, the Samsung Global Research Outreach Program, and the Center for Energy Efficient Research Science.</p>\n</div>",
  "media:content": {
    "media:description": "Illustration shows terahertz illumination (yellow curves at top right) entering the new camera system, where it stimulates quantum dots inside nanoscale holes (shown as illuminated rings) to emit visible light, which is then detected using a CMOS-based chip (bottom left) like those in digital cameras.",
    "media:credit": "Courtesy of the researchers"
  },
  "category": [
    "Chemistry",
    "Research",
    "Nanoscience and nanotechnology",
    "Electrical Engineering & Computer Science (eecs)",
    "School of Science",
    "School of Engineering"
  ]
}