{
  "title": "Twitter sued by employees amid mass layoffs",
  "description": "<p>Twitter is facing a class action lawsuit over its <a href=\"https://www.engadget.com/twitter-layoffs-010148183.html\">ongoing mass layoffs</a>, which could potentially cut its workforce in half. According to <a href=\"https://www.bloomberg.com/news/articles/2022-11-04/twitter-sued-for-mass-layoffs-by-musk-without-enough-notice?sref=10lNAhZ9\"><em>Bloomberg</em></a>, employees filed a class action lawsuit against the company in San Francisco federal court, arguing that Twitter's actions run afoul of the US Worker Adjustment and Retraining Notification (WARN) Act. Under the labor law, companies with 100 or more employees are required to notify them of mass layoffs 60 days in advance.</p><p><a href=\"https://www.nytimes.com/2022/11/03/technology/twitter-layoffs-elon-musk.html\"><em>The New York Times</em></a> reported earlier that Twitter would begin layoffs and that around half of the company's staff members would be affected. In an email seen by <a href=\"https://www.washingtonpost.com/technology/2022/11/03/elon-musk-twitter-layoffs/\"><em>The Washington Post</em></a>, Twitter said that the layoffs are \"unfortunately necessary to ensure the company's success moving forward.\" The company also told employees to stay at home today and to wait for an email. If they get one in their Twitter-owned email inbox, their job is safe. But if they receive the email in their personal account, that means they're being let go. Some people are reporting on the social network that they have already been <a href=\"https://twitter.com/ruchowdh/status/1588365045158727681\">locked out</a> of their work emails and had been <a href=\"https://twitter.com/SBkcrn/status/1588357614211158018\">removed</a> from the company's central Slack account.&nbsp;</p><span id=\"end-legacy-contents\"></span><p>The plaintiffs are asking the court to issue an order forcing Twitter to obey the WARN Act. They also want the court to prohibit the company from soliciting employees to sign away their right to litigate. Shannon Liss-Riordan, the lawyer representing the plaintiffs, said they filed the complaint \"in an attempt to make sure that employees are aware that they should not sign away their rights and that they have an avenue for pursuing their rights.\"</p><p>Liss-Riordan was also the lawyer who handled the <a href=\"https://www.engadget.com/tesla-sued-by-ex-employees-who-claim-that-mass-layoffs-violated-federal-law-084508720.html\">lawsuit against Tesla</a> in June over layoffs that cut 10 percent of the automaker's workforce. Similar to this complaint, the plaintiffs back then argued that Tesla violated the WARN Act. Company chief Elon Musk, who <a href=\"https://www.engadget.com/elon-musk-takes-over-twitter-011047797.html\">took over Twitter</a> a week ago, called the lawsuit \"trivial\" in a talk with <em>Bloomberg</em> Editor-In-Chief John Micklethwait. The court had also sided with the company and ruled that employees should negotiate with Tesla in a closed-door arbitration instead.</p>",
  "link": "https://www.engadget.com/twitter-sued-over-mass-layoffs-102354009.html?src=rss",
  "source_id": "engadget_479",
  "guid": "daff2c29-f3ca-4e67-9a0b-d8cd6389c4a6",
  "dc:creator": "Mariella Moon",
  "source": "Engadget",
  "dc:publisher": "Engadget",
  "dc:rightsHolder": "Engadget",
  "pubDate": "Fri, 04 Nov 2022 10:23:54 +0000",
  "ingested": 1667558460,
  "modified": "2022-11-04T10:41:03+00:00",
  "category": [
    "Company Legal & Law Matters",
    "Business",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Mariella Moon"
  ],
  "media:content": [
    {
      "media:keywords": "headline",
      "media:media_html": "",
      "dc:identifier": 1,
      "media:credit": "",
      "media:description": "",
      "media:title": ""
    },
    {
      "media:media_html": "",
      "dc:identifier": 2,
      "media:credit": "Anadolu Agency via Getty Images",
      "media:description": "SAN FRANCISCO, CA - OCTOBER 28: Twitter headquarters is seen in San Francisco, California, United States on October 28, 2022. Tayfun Coskun / Anadolu Agency",
      "media:title": "Twitter in San Francisco"
    }
  ]
}