{
  "title": "Episode 154: &#8220;Happy Together&#8221; by the Turtles",
  "link": "https://500songs.com/podcast/episode-154-happy-together-by-the-turtles/",
  "pubDate": "Wed, 21 Sep 2022 03:02:19 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1343",
  "description": "Episode one hundred and fifty-four of <em>A History of Rock Music in Five Hundred Songs </em>is the last of our four-part mini-series on LA sunshine pop and folk-rock in summer 1967. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, <a href=\"https://www.patreon.com/posts/72267563\">on \"Baby, Now That I've Found You\" by the Foundations.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nThere is no Mixcloud this week, because there were too many Turtles songs in the episode.\n\nThere's relatively little information available about the Turtles compared to other bands of their era, and so apart from the sources on the general LA scene referenced in all these podcasts, the information here comes from a small number of sources.\n\n<a href=\"https://amzn.to/3DI40jc\">This DVD</a> is a decent short documentary on the band's career.\n\nHoward Kaylan's autobiography, <a href=\"https://amzn.to/3facEwR\"><em>Shell Shocked: My Life with the Turtles, Flo and Eddie, and Frank Zappa, Etc.</em></a>,  is a fun read, if inevitably biased towards his own viewpoint. Jim Pons' <a href=\"https://amzn.to/3f937WM\"><em>Hard Core Love: Sex, Football, and Rock and Roll in the Kingdom of God</em></a> is much less fun, being as it is largely organised around how his life led up to his latter-day religious beliefs, but is the only other book I'm aware of with a substantial amount of coverage of the Turtles.\n\nThere are many compilations of the Turtles' material available, of which <a href=\"https://amzn.to/3dw5VN6\"><em>All The Singles</em></a> is by far and away the best. The box set of all their albums with bonus tracks is now out of print on CD, but can still be bought <a href=\"https://amzn.to/3qW3CpO\">as MP3s</a>.\n\n<strong>Errata</strong>\n\nI say that the clarinet and saxophone have the same fingerings. This is not strictly true -- they have very, very, similar fingerings, and the same when you're just starting out on both instruments, but the clarinet has a wider range and overblows at a perfect twelfth rather than an octave. For a beginner, as Volman and Kaylan were, they're the same though.\n\nAlso, for the first day or so it was uploaded, this episode included an excerpt of the studio version of \"Everyone's Gone to the Movies\" by Steely Dan rather than the demo version on which Volman and Kaylan sang. That has been fixed.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWe've spent a lot of time recently in the LA of summer 1967, at the point where the sunshine pop sound that was created when the surf harmonies of the Beach Boys collided with folk rock was at its apex, right before fashions changed and tight sunny pop songs with harmonies from LA became yesterday's news, and extended blues-rock improvisations from San Francisco became the latest in thing.\n\nThis episode is the last part of this four-episode sequence, and is going to be shorter than those others. In many ways this one is a bridge between this sequence and next episode, where we travel back to London, because we're saying goodbye for a while to the LA scene, and when we do return to LA it will be, for the most part, to look at music that's a lot less sunshine and a lot more shadow. So this is a brief fade-out while we sing ba-ba-ba, a three-minute pop-song of an episode, a last bit of sunshine pop before we return to longer, more complicated, stories  in two weeks' time, at which point the sun will firmly set.\n\nLike many musicians associated with LA, Howard Kaylan was born elsewhere and migrated there as a child, and he seems to have regarded his move from upstate New York to LA as essentially a move to Disneyland itself. That impression can only have been made stronger by the fact that soon after his family moved there he got his first childhood girlfriend -- who happened to be a Mouseketeer on the TV.\n\nAnd TV was how young Howard filtered most of his perceptions -- particularly TV comedy. By the age of fourteen he was the president of the Soupy Sales Fan Club, and he was also obsessed with the works of Ernie Kovacs, Sid Caesar, and the great satirist and parodist Stan Freberg:\n\n[Excerpt: Stan Freberg, \"St. George and the Dragonet\"]\n\nSecond only to his love of comedy, though, was his love of music, and it was on the trip from New York to LA that he saw a show that would eventually change his life. Along the way, his family had gone to Las Vegas, and while there they had seen Louis Prima and Keeley Smith do their nightclub act.\n\nPrima is someone I would have liked to do a full podcast episode on when I was covering the fifties, and who I did do a Patreon bonus episode on. He's now probably best known for doing the voice of King Louis in the Jungle Book:\n\n[Excerpt: Louis Prima, \"I Wanna Be Like You (the Monkey Song)\"]\n\nBut he was also a jump blues musician who made some very good records in a similar style to Louis Jordan, like \"Jump, Jive, an' Wail\"\n\n[Excerpt: Louis Prima, \"Jump, Jive, an' Wail\"]\n\nBut like Jordan, Prima dealt at least as much in comedy as in music -- usually comedy involving stereotypes about his Italian-American ethnic origins. At the time young Howard Kaylan saw him, he was working a double act with his then-wife Keeley Smith. The act would consist of Smith trying to sing a song straight, while Prima would clown around, interject, and act like a fool, as Smith grew more and more exasperated, and would eventually start contemptuously mocking Prima.\n\n[Excerpt: Louis Prima and Keeley Smith, \"Embraceable You/I've Got It Bad and That Ain't Good\"]\n\nThis is of course a fairly standard double-act format, as anyone who has suffered through an episode of The Little and Large Show will be all too painfully aware, but Prima and Smith did it better than most, and to young Howard Kaylan, this was the greatest entertainment imaginable.\n\nBut while comedy was the closest thing to Kaylan's heart, music was a close second. He was a regular listener to Art Laboe's radio show, and in a brief period as a teenage shoplifter he obtained records like Ray Charles' album Genius + Soul = Jazz:\n\n[Excerpt: Ray Charles, \"One Mint Julep\"]\n\nand the single \"Tossin' and Turnin'\" by Bobby Lewis:\n\n[Excerpt: Bobby Lewis, \"Tossin' and Turnin'\"]\n\n\"Tossin' and Turnin'\" made a deep impression on Kaylan, because of the saxophone solo, which was actually a saxophone duet. On the record, baritone sax player Frank Henry played a solo, and it was doubled by the great tenor sax player King Curtis, who was just playing a mouthpiece rather than a full instrument, making a high-pitched squeaking sound:\n\n[Excerpt: Bobby Lewis, \"Tossin' and Turnin'\"]\n\nCurtis was of course also responsible for another great saxophone part a couple of years earlier, on a record that Kaylan loved because it combined comedy and rock and roll, \"Yakety Yak\":\n\n[Excerpt: The Coasters, \"Yakety Yak\"]\n\nThose two saxophone parts inspired Kaylan to become a rock and roller. He was already learning the clarinet and playing part time in an amateur Dixieland band, and it was easy enough to switch to saxophone, which has the same fingering. Within a matter of weeks of starting to play sax, he was invited to join a band called the Nightriders, who consisted of Chuck Portz on bass, Al Nichol on guitar, and Glen Wilson on drums. The Nightriders became locally popular, and would perform sets largely made up of Johnny and the Hurricanes and Ventures material.\n\nWhile he was becoming a budding King Curtis, Kaylan was still a schoolkid, and one of the classes he found most enjoyable was choir class. There was another kid in choir who Kaylan got on with, and one day that kid, Mark Volman came up to him, and had a conversation that Kaylan would recollect decades later in his autobiography:\n\n“So I hear you’re in a rock ’n’ roll band.”\n\n“Yep.”\n\n“Um, do you think I could join it?”\n\n“Well, what do you do?”\n\n“Nothing.”\n\n“Nothing?”\n\n“Nope.”\n\n“Sounds good to me. I’ll ask Al.”\n\nVolman initially became the group's roadie and occasional tambourine player, and would also get on stage to sing a bit during their very occasional vocal numbers, but was mostly \"in the band\" in name only at first -- he didn't get a share of the group's money, but he was allowed to say he was in the group because that meant that his friends would come to the Nightriders' shows, and he was popular among the surfing crowd.\n\nEventually, Volman's father started to complain that his son wasn't getting any money from being in the band, while the rest of the group were, and they explained to him that Volman was just carrying the instruments while they were all playing them. Volman's father said \"if Mark plays an instrument, will you give him equal shares?\" and they said that that was fair, so Volman got an alto sax to play along with Kaylan's tenor. Volman had also been taking clarinet lessons, and the two soon became a tight horn section for the group, which went through a few lineup changes and soon settled on a lineup of Volman and Kaylan on saxes, Nichol on lead guitar, Jim Tucker on rhythm guitar, Portz on bass, and Don Murray on drums.\n\nThat new lineup became known as the Crossfires, presumably after the Johnny and the Hurricanes song of the same name:\n\n[Excerpt: Johnny and the Hurricanes, \"Crossfire\"]\n\nVolman and Kaylan worked out choreographed dance steps to do while playing their saxes, and the group even developed a group of obsessive fans who called themselves the Chunky Club, named after one of the group's originals:\n\n[Excerpt: The Crossfires, \"Chunky\"]\n\nAt this point the group were pretty much only playing instrumentals, though they would do occasional vocals on R&B songs like \"Money\" or their version of Don and Dewey's \"Justine\", songs which required more enthusiasm than vocal ability. But their first single, released on a tiny label, was another surf instrumental, a song called \"Dr. Jekyll and Mr. Hyde\":\n\n[Excerpt: The Crossfires, \"Dr. Jekyll and Mr Hyde\"]\n\nThe group became popular enough locally that they became the house band at the Revelaire Club in Redondo Beach. There as well as playing their own sets, they would also be the backing band for any touring acts that came through without their own band, quickly gaining the kind of performing ability that comes from having to learn a new artist's entire repertoire in a few days and be able to perform it with them live with little or no rehearsal. They backed artists like the Coasters, the Drifters, Bobby Vee, the Rivingtons, and dozens of other major acts, and as part of that Volman and Kaylan would, on songs that required backing vocals, sing harmonies rather than playing saxophone.\n\nAnd that harmony-singing ability became important when the British Invasion happened, and suddenly people didn't want to hear surf instrumentals, but vocals along the lines of the new British groups. The Crossfires' next attempt at a single was another original, this one an attempt at sounding like one of their favourite new British groups, the Kinks:\n\n[Excerpt: The Crossfires, \"One Potato, Two Potato\"]\n\nThis change to vocals necessitated a change in the group dynamic. Volman and Kaylan ditched the saxophones, and discovered that between them they made one great frontman. The two have never been excessively close on a personal level, but both have always known that the other has qualities they needed. Frank Zappa would later rather dismissively say \"I regard Howard as a fine singer, and Mark as a great tambourine player and fat person\", and it's definitely true that Kaylan is one of the truly great vocalists to come out of the LA scene in this period, while Volman is merely a good harmony singer, not anything particularly special -- though he *is* a good harmony singer -- but it undersells Volman's contribution. There's a reason the two men performed together for nearly sixty years.\n\nKaylan is a great singer, but also by nature rather reserved, and he always looked uncomfortable on stage, as well as, frankly, not exactly looking like a rock star (Kaylan describes himself not inaccurately as looking like a potato several times in his autobiography). Volman, on the other hand, is a merely good singer, but he has a naturally outgoing personality, and while he's also not the most conventionally good-looking of people he has a *memorable* appearance in a way that Kaylan doesn't. Volman could do all the normal frontman stuff, the stuff that makes a show an actual show -- the jokes, the dancing, the between-song patter, the getting the crowd going, while Kaylan could concentrate on the singing.\n\nThey started doing a variation on the routine that had so enthralled Howard Kaylan when he'd seen Louis Prima and Keeley Smith do it as a child. Kaylan would stand more or less stock still, looking rather awkward, but singing like an angel, while Volman would dance around, clown, act the fool, and generally do everything he could to disrupt the performance -- short of actually disrupting it in reality. It worked, and Volman became one of that small but illustrious group of people -- the band member who makes the least contribution to the sound of the music but the biggest contribution to the feel of the band itself, and without whom they wouldn't be the same.\n\nAfter \"One Potato, Two Potato\" was a flop, the Crossfires were signed to their third label. This label, White Whale, was just starting out, and the Crossfires were to become their only real hit act. Or rather, the Turtles were.\n\nThe owners of White Whale knew that they didn't have much promotional budget and that their label was not a known quantity -- it was a tiny label with no track record. But they thought of a way they could turn that to their advantage. Everyone knew that the Beatles, before Capitol had picked up their contracts, had had their records released on a bunch of obscure labels like Swan and Tollie. People *might* look for records on tiny independent labels if they thought it might be another British act who were unknown in the US but could be as good as the Beatles. So they chose a name for the group that they thought sounded as English as possible -- an animal name that started with \"the\", and ended in \"les\", just like the Beatles.\n\nThe group, all teenagers at the time, were desperate enough that they agreed to change their name, and from that point on they became the Turtles.\n\nIn order to try and jump on as many bandwagons as possible, the label wanted to position them as a folk-rock band, so their first single under the Turtles name was a cover of a Bob Dylan song, from Another Side of Bob Dylan:\n\n[Excerpt: Bob Dylan, \"It Ain't Me Babe\"]\n\nThat song's hit potential had already been seen by Johnny Cash, who'd had a country hit with it a few months before. But the Turtles took the song in a different direction, inspired by Kaylan's *other* great influence, along with Prima and Smith. Kaylan was a big fan of the Zombies, one of the more interesting of the British Invasion groups, and particularly of their singer Colin Blunstone. Kaylan imitated Blunstone on the group's hit single, \"She's Not There\", on which Blunstone sang in a breathy, hushed, voice on the verses:\n\n[Excerpt: The Zombies, \"She's Not There\"]\n\nbefore the song went into a more stomping chorus on which Blunstone sang in a fuller voice:\n\n[Excerpt: The Zombies, \"She's Not There\"]\n\nKaylan did this on the Turtles' version of \"It Ain't Me Babe\", starting off with a quiet verse:\n\n[Excerpt: The Turtles, \"It Ain't Me Babe\"]\n\nBefore, like the Zombies, going into a foursquare, more uptempo, louder chorus:\n\n[Excerpt: The Turtles, \"It Ain't Me Babe\"]\n\nThe single became a national top ten hit, and even sort of got the approval of Bob Dylan. On the group's first national tour, Dylan was at one club show, which they ended with \"It Ain't Me Babe\", and after the show the group were introduced to the great songwriter, who was somewhat the worse for wear. Dylan said “Hey, that was a great song you just played, man. That should be your single\", and then passed out into his food.\n\nWith the group's first single becoming a top ten hit, Volman and Kaylan got themselves a house in Laurel Canyon, which was not yet the rock star Mecca it was soon to become, but which was starting to get a few interesting residents. They would soon count Henry Diltz of the Modern Folk Quartet, Danny Hutton, and Frank Zappa among their neighbours.\n\nSoon Richie Furay would move in with them, and the house would be used by the future members of the Buffalo Springfield as their rehearsal space. The Turtles were rapidly becoming part of the in crowd.\n\nBut they needed a follow-up single, and so Bones Howe, who was producing their records, brought in P.F. Sloan to play them a few of his new songs. They liked \"Eve of Destruction\" enough to earmark it as a possible album track, but they didn't think they would do it justice, and so it was passed on to Barry McGuire. But Sloan did have something for them -- a pseudo-protest song called \"Let Me Be\" that was very clearly patterned after their version of \"It Ain't Me Babe\", and which was just rebellious enough to make them seem a little bit daring, but which was far more teenage angst than political manifesto:\n\n[Excerpt: The Turtles, \"Let Me Be\"]\n\nThat did relatively well, making the top thirty -- well enough for the group to rush out an album which was padded out with some sloppy cover versions of other Dylan songs, a version of \"Eve of Destruction\", and a few originals written by Kaylan.\n\nBut the group weren't happy with the idea of being protest singers. They were a bunch of young men who were more motivated by having a good time than by politics, and they didn't think that it made sense for them to be posing as angry politicised rebels. Not only that, but there was a significant drop-off between \"It Ain't Me Babe\" and \"Let Me Be\". They needed to do better.\n\nThey got the clue for their new direction while they were in New York. There they saw their friends in the Mothers of Invention playing their legendary residency at the Garrick Theatre, but they also saw a new band, the Lovin' Spoonful, who were playing music that was clearly related to the music the Turtles were doing -- full of harmonies and melody, and inspired by folk music -- but with no sense of rebelliousness at all. They called it \"Good Time Music\":\n\n[Excerpt: The Lovin' Spoonful, \"Good Time Music\"]\n\nAs soon as they got back to LA, they told Bones Howe and the executives at White Whale that they weren't going to be a folk-rock group any more, they were going to be \"good time music\", just like the Lovin' Spoonful.\n\nThey were expecting some resistance, but they were told that that was fine, and that PF Sloan had some good time music songs too. \"You Baby\" made the top twenty:\n\n[Excerpt: The Turtles, \"You Baby\"]\n\nThe Turtles were important enough in the hierarchy of LA stars that Kaylan and Tucker were even invited by David Crosby to meet the Beatles at Derek Taylor's house when they were in LA on their last tour -- this may be the same day that the Beatles met Brian and Carl Wilson, as I talked about in the episode on \"All You Need is Love\", though Howard Kaylan describes this as being a party and that sounded like more of an intimate gathering.\n\nIf it was that day, there was nearly a third Beach Boy there. The Turtles knew David Marks, the Beach Boys' former rhythm guitarist, because they'd played a lot in Inglewood where he'd grown up, and Marks asked if he could tag along with Kaylan and Tucker to meet the Beatles. They agreed, and drove up to the house, and actually saw George Harrison through the window, but that was as close as they got to the Beatles that day. There was a heavy police presence around the house because it was known that the Beatles were there, and one of the police officers asked them to drive back and park somewhere else and walk up, because there had been complaints from neighbours about the number of cars around. They were about to do just that, when Marks started yelling obscenities and making pig noises at the police, so they were all arrested, and the police claimed to find a single cannabis seed in the car.\n\nCharges were dropped, but now Kaylan was on the police's radar, and so he moved out of the Laurel Canyon home to avoid bringing police attention to Buffalo Springfield, so that Neil Young and Bruce Palmer wouldn't get deported.\n\nBut generally the group were doing well. But there was a problem. And that problem was their record label. They rushed out another album to cash in on the success of \"You Baby\", one that was done so quickly that it had \"Let Me Be\" on it again, just as the previous album had, and which included a version of the old standard \"All My Trials\", with the songwriting credited to the two owners of White Whale records. And they pumped out a lot of singles. A LOT of singles, ranging from a song written for them by new songwriter Warren Zevon, to cover versions of Frank Sinatra's \"It Was a Very Good Year\" and the old standard \"We'll Meet Again\".\n\nOf the five singles after \"You Baby\", the one that charted highest was a song actually written by a couple of the band members. But for some reason a song with verses in 5/4 time and choruses in 6/4 with lyrics like \"killing the living and living to kill, the grim reaper of love thrives on pain\" didn't appeal to the group's good-time music pop audience and only reached number eighty-one:\n\n[Excerpt: The Turtles, \"Grim Reaper of Love\"]\n\nThe group started falling apart. Don Murray became convinced that  the rest of the band were conspiring against him and wanted him out, so he walked out of the group in the middle of a rehearsal for a TV show. They got Joel Larson of the Grass Roots -- the group who had a number of hits with Sloan and Barri songs -- to sub for a few gigs before getting in a permanent replacement, Johnny Barbata, who came to them on the recommendation of Gene Clark, and who was one of the best drummers on the scene -- someone who was not only a great drummer but a great showman, who would twirl his drumsticks between his fingers with every beat, and who would regularly engage in drum battles with Buddy Rich.\n\nBy the time they hit their fifth flop single in a row, they lost their bass player as well -- Chuck Portz decided he was going to quit music and become a fisherman instead. They replaced him with Chip Douglas of the Modern Folk Quartet.\n\nThen they very nearly lost their singers. Volman and Kaylan both got their draft notices at the same time, and it seemed likely they would end up having to go and fight in the Vietnam war. Kaylan was distraught, but his mother told him \"Speak to your cousin Herb\".\n\nCousin Herb was Herb Cohen, the manager of the Mothers of Invention and numerous other LA acts, including the Modern Folk Quartet, and Kaylan only vaguely knew him at this time, but he agreed to meet up with them, and told them “Stop worrying! I got Zappa out, I got Tim Buckley out, and I’ll get you out.”\n\nCohen told Volman and Kaylan to not wash for a week before their induction, to take every drug of every different kind they could find right before going in, to deliberately disobey every order, to fail the logic tests, and to sexually proposition the male officers dealing with the induction. They followed his orders to the letter, and got marked as 4-F, unfit for service.\n\nThey still needed a hit though, and eventually they found something by going back to their good-time music idea. It was a song from the Koppelman-Rubin publishing company -- the same company that did the Lovin Spoonful's management and production.\n\nThe song in question was by Alan Gordon and Gary Bonner, two former members of a group called the Magicians, who had had a minor success with a single called \"An Invitation to Cry\":\n\n[Excerpt: The Magicians, \"An Invitation to Cry\"]\n\nThe Magicians had split up, and Bonner and Gordon were trying to make a go of things as professional songwriters, but had had little success to this point. The song on the demo had been passed over by everyone, and the demo was not at all impressive, just a scratchy acetate with Bonner singing off-key and playing acoustic rhythm guitar and Gordon slapping his knees to provide rhythm, but the group heard something in it.\n\nThey played the song live for months, refining the arrangement, before taking it into the studio. There are arguments to this day as to who deserves the credit for the sound on \"Happy Together\" -- Chip Douglas apparently did the bulk of the arrangement work while they were on tour, but the group's new producer, Joe Wissert, a former staff engineer for Cameo-Parkway, also claimed credit for much of it. Either way, \"Happy Together\" is a small masterpiece of dynamics.\n\nThe song is structured much like the songs that had made the Turtles' name, with the old Zombies idea of the soft verse and much louder chorus:\n\n[Excerpt: The Turtles, \"Happy Together\"]\n\nBut the track is really made by the tiny details of the arrangement, the way instruments and vocal parts come in and out as the track builds up, dies down, and builds again. If you listen to the isolated tracks, there are fantastic touches like the juxtaposition of the bassoon and oboe (which I think is played on a mellotron):\n\n[Excerpt: The Turtles, \"Happy Together\", isolated tracks]\n\nAnd a similar level of care and attention was put into the vocal arrangement by Douglas, with some parts just Kaylan singing solo, other parts having Volman double him, and of course the famous \"bah bah bah\" massed vocals:\n\n[Excerpt: The Turtles, \"Happy Together\", isolated vocals]\n\nAt the end of the track, thinking he was probably going to do another take, Kaylan decided to fool around and sing \"How is the weather?\", which Bonner and Gordon had jokingly done on the demo. But the group loved it, and insisted that was the take they were going to use:\n\n[Excerpt: The Turtles, \"Happy Together\"]\n\n\"Happy Together\" knocked \"Penny Lane\" by the Beatles off the number one spot in the US, but by that point the group had already had another lineup change. The Monkees had decided they wanted to make records without the hit factory that had been overseeing them, and had asked Chip Douglas if he wanted to produce their first recordings as a self-contained band. Given that the Monkees were the biggest thing in the American music industry at the time, Douglas had agreed, and so the group needed their third bass player in a year.\n\nThe one they went for was Jim Pons. Pons had seen the Beatles play at the Hollywood Bowl in 1964, and decided he wanted to become a pop star. The next day he'd been in a car crash, which had paid out enough insurance money that he was able to buy two guitars, a bass, drums, and amps, and use them to start his own band.\n\nThat band was originally called The Rockwells, but quickly changed their name to the Leaves, and became a regular fixture at Ciro's on Sunset Strip, first as customers, then after beating Love in the auditions, as the new resident band when the Byrds left.\n\nFor a while the Leaves had occasionally had guest vocals from a singer called Richard Marin, but Pons eventually decided to get rid of him, because, as he put it \"I wanted us to look like The Beatles. There were no Mexicans in The Beatles\". He is at pains in his autobiography to assure us that he's not a bigot, and that Marin understood. I'm sure he did. Marin went on to be better known as Cheech Marin of Cheech and Chong.\n\nThe Leaves were signed by Pat Boone to his production company, and through that company they got signed to Mira Records. Their first single, produced by Nik Venet, had been a version of \"Love Minus Zero (No Limit)\", a song by Bob Dylan:\n\n[Excerpt: The Leaves, \"Love Minus Zero (No Limit)\"]\n\nThat had become a local hit, though not a national one, and the Leaves had become one of the biggest bands on the Sunset Strip scene, hanging out with all the other bands. They had become friendly with the Doors before the Doors got a record deal, and Pat Boone had even asked for an introduction, as he was thinking of signing them, but unfortunately when he met Jim Morrison, Morrison had drunk a lot of vodka, and given that Morrison was an obnoxious drunk Boone had second thoughts, and so the world missed out on the chance of a collaboration between the Doors and Pat Boone.\n\nTheir second single was \"Hey Joe\" -- as was their third and fourth, as we discussed in that episode:\n\n[Excerpt: The Leaves, \"Hey Joe\"]\n\nTheir third version of \"Hey Joe\" had become a top forty hit, but they didn't have a follow-up, and their second album, All The Good That's Happening, while it's a good album, sold poorly. Various band members quit or fell out, and when Johnny Barbata knocked on Jim Pons' door it was an easy decision to quit and join a band that had a current number one hit.\n\nWhen Pons joined, the group had already recorded the Happy Together album. That album included the follow-up to \"Happy Together\", another Bonner and Gordon song, \"She'd Rather Be With Me\":\n\n[Excerpt: The Turtles, \"She'd Rather Be With Me\"]\n\nNone of the group were tremendously impressed with that song, but it did very well, becoming the group's second-biggest hit in the US, reaching number three, and actually becoming a bigger hit than \"Happy Together\" in parts of Europe.\n\nBefore \"Happy Together\" the group hadn't really made much impact outside the US. In the UK, their early singles had been released by Pye, the smallish label that had the Kinks and Donovan, but which didn't have much promotional budget, and they'd sunk without trace. For \"You Baby\" they'd switched to Immediate, the indie label that Andrew Oldham had set up, and it had done a little better but still not charted.\n\nBut from \"Happy Together\" they were on Decca, a much bigger label, and \"Happy Together\" had made number twelve in the charts in the UK, and \"She'd Rather Be With Me\" reached number four. So the new lineup of the group went on a UK tour.\n\nAs soon as they got to the hotel, they found they had a message from Graham Nash of the Hollies, saying he would like to meet up with them. They all went round to Nash's house, and found Donovan was also there, and Nash played them a tape he'd just been given of Sgt Pepper, which wouldn't come out for a few more days. At this point they were living every dream a bunch of Anglophile American musicians could possibly have.\n\nJim Tucker mentioned that he would love to meet the Beatles, and Nash suggested they do just that. On their way out the door, Donovan said to them, \"beware of Lennon\".\n\nIt was when they got to the Speakeasy club that the first faux-pas of the evening happened. Nash introduced them to Justin Hayward and John Lodge of the Moody Blues, and Volman said how much he loved their record \"Go Now\":\n\n[Excerpt: The Moody Blues, \"Go Now\"]\n\nThe problem was that Hayward and Lodge had joined the group after that record had come out, to replace its lead singer Denny Laine. Oh well, they were still going to meet the Beatles, right? They got to the table where John, Paul, and Ringo were sat, at a tense moment -- Paul was having a row with Jane Asher, who stormed out just as the Turtles were getting there. But at first, everything seemed to go well. The Beatles all expressed their admiration for \"Happy Together\" and sang the \"ba ba ba\" parts at them, and Paul and Kaylan bonded over their shared love for \"Justine\" by Don and Dewey, a song which the Crossfires had performed in their club sets, and started singing it together:\n\n[Excerpt: Don and Dewey, \"Justine\"]\n\nBut John Lennon was often a mean drunk, and he noticed that Jim Tucker seemed to be the weak link in the group, and soon started bullying him, mocking his clothes, his name, and everything he said. This devastated Tucker, who had idolised Lennon up to that point, and blurted out \"I'm sorry I ever met you\", to which Lennon just responded \"You never did, son, you never did\".\n\nThe group walked out, hurt and confused -- and according to Kaylan in his autobiography, Tucker was so demoralised by Lennon's abuse that he quit music forever shortly afterwards, though Tucker says that this wasn't the reason he quit. From their return to LA on, the Turtles would be down to just a five-piece band.\n\nAfter leaving the club, the group went off in different directions, but then Kaylan (and this is according to Kaylan's autobiography, there are no other sources for this) was approached by Brian Jones, asking for his autograph because he loved the Turtles so much.\n\nJones introduced Kaylan to the friend he was with, Jimi Hendrix, and they went out for dinner, but Jones soon disappeared with a girl he'd met. and left Kaylan and Hendrix alone. They were drinking a lot -- more than Kaylan was used to -- and he was tired, and the omelette that Hendrix had ordered for Kaylan was creamier than he was expecting... and Kaylan capped what had been a night full of unimaginable highs and lows by vomiting all over Jimi Hendrix's expensive red velvet suit.\n\nRather amazingly after all this, the Moody Blues, the Beatles, and Hendrix, all showed up to the Turtles' London gig and apparently enjoyed it.\n\nAfter \"She'd Rather Be With Me\", the next single to be released wasn't really a proper single, it was a theme song they'd been asked to record for a dire sex comedy titled \"Guide for the Married Man\", and is mostly notable for being composed by John Williams, the man who would later go on to compose the music for Star Wars.\n\nThat didn't chart, but the group followed it with two more top twenty hits written by Bonner and Gordon, \"You Know What I Mean\" and \"She's My Girl\".\n\nBut then the group decided that Bonner and Gordon weren't giving them their best material, and started turning down their submissions, like a song called \"Celebrity Ball\" which they thought had no commercial potential, at least until the song was picked up by their friends Three Dog Night, retitled \"Celebrate\", and made the top twenty:\n\n[Excerpt: Three Dog Night, \"Celebrate\"]\n\nInstead, the group decided to start recording more of their own material. They were worried that in the fast-changing rock world bands that did other songwriters' material were losing credibility. But \"Sound Asleep\", their first effort in this new plan, only made number forty-seven on the charts.\n\nClearly they needed a different plan. They called in their old bass player Chip Douglas, who was now an experienced hitmaker as a producer. He called in *his* friend Harry Nilsson, who wrote \"The Story of Rock & Roll\" for the group, but that didn't do much better, only making number forty-eight.\n\nBut the group persevered, starting work on a new album produced by Douglas, The Turtles Present The Battle of the Bands, the conceit of which was that every track would be presented as being by a different band. So there were tracks by  Chief Kamanawanalea and his Royal Macadamia Nuts,  Fats Mallard and the Bluegrass Fireball, The Atomic Enchilada, and so on, all done in the styles suggested by those band names. There was even a track by \"The Cross Fires\":\n\n[Excerpt: The Cross Fires, \"Surfer Dan\"]\n\nIt was the first time the group had conceived of an album as a piece, and nine of the twelve tracks were originals by the band -- there was a track written by their friend Bill Martin, and the opening track, by \"The US Teens Featuring Raoul\", was co-written by Chip Douglas and Harry Nilsson. But for the most part the songs were written by the band members themselves, and jointly credited to all of them.\n\nThis was the democratic decision, but one that Howard Kaylan would later regret, because of the song for which the band name was just \"Howie, Mark, Johnny, Jim & Al\". Where all the other songs were parodies of other types of music, that one was, as the name suggests, a parody of the Turtles themselves. It was written by Kaylan in disgust at the record label, who kept pestering the group to \"give us another 'Happy Together'\". Kaylan got more and more angry at this badgering, and eventually thought \"OK, you want another 'Happy Together'? I'll give you another 'Happy Together'\" and in a few minutes wrote a song that was intended as an utterly vicious parody of that kind of song, with lyrics that nobody could possibly take seriously, and with music that was just mocking the whole structure of \"Happy Together\" specifically.\n\nHe played it to the rest of the group, expecting them to fall about laughing, but instead they all insisted it was the group's next single. \"Elenore\" went to number six on the charts, becoming their biggest hit since \"She'd Rather Be With Me\":\n\n[Excerpt: The Turtles, \"Elenore\"]\n\nAnd because everything was credited to the group, Kaylan's songwriting royalties were split five ways.\n\nFor the follow-up, they chose the one actual cover version on the album. \"You Showed Me\" is a song that Roger McGuinn and Gene Clark had written together in the very early days of the Byrds, and they'd recorded it as a jangly folk-rock tune in 1964:\n\n[Excerpt: The Byrds, \"You Showed Me\"]\n\nThey'd never released that track, but Gene Clark had performed it solo after leaving the Byrds, and Douglas had been in Clark's band at the time, and liked the song. He played it for the Turtles, but when he played it for them the only instrument he had to hand was a pump organ with one of its bellows broken. Because of this, he had to play it slowly, and while he kept insisting that the song needed to be faster, the group were equally insistent that what he was playing them was the big ballad hit they wanted, and they recorded it at that tempo. \"You Showed Me\" became the Turtles' final top ten hit:\n\n[Excerpt: The Turtles, \"You Showed Me\"]\n\nBut once again there were problems in the group. Johnny Barbata was the greatest drummer any of them had ever played with, but he didn't fit as a personality -- he didn't like hanging round with the rest of them when not on stage, and while there were no hard feelings, it was clear he could get a gig with pretty much anyone and didn't need to play with a group he wasn't entirely happy in. By mutual agreement, he left to go and play with Crosby, Stills, Nash, and Young, and was replaced by John Seiter from Spanky and Our Gang -- a good drummer, but not the best of the best like Barbata had been.\n\nOn top of this, there were a whole host of legal problems to deal with. The Turtles were the only big act on White Whale records, though White Whale did put out some other records. For example, they'd released the single \"Desdemona\" by John's Children in the US:\n\n[Excerpt: John's Children, \"Desdemona\"]\n\nThe group, being the Anglophiles they were, had loved that record, and were also among the very small number of Americans to like the music made by John's Children's guitarist's new folk duo, Tyrannosaurus Rex:\n\n[Excerpt: Tyrannosaurus Rex, \"Debora\"]\n\nWhen Tyrannosaurus Rex supported the Turtles, indeed, Volman and Kaylan became very close to Marc Bolan, and told him that the next time they were in England they'd have to get together, maybe even record together.\n\nThat would happen not that many years later, with results we'll be getting to in... episode 201, by my current calculations. But John's Children hadn't had a hit, and indeed nobody on White Whale other than the Turtles had. So White Whale desperately wanted to stop the Turtles having any independence, and to make sure they continued to be their hit factory.\n\nThey worked with the group's roadie, Dave Krambeck, to undermine the group's faith in their manager, Bill Utley, who supported the group in their desire for independence. Soon, Krambeck and White Whale had ousted Utley, and Krambeck had paid Utley fifty thousand dollars for their management contract, with the promise of another two hundred thousand later. That fifty thousand dollars had been taken by Krambeck as an advance against the Turtles' royalties, so they were really buying themselves out.\n\nExcept that Krambeck then sold the management contract on to a New York management firm, without telling the group. He then embezzled as much of the group's ready cash as he could and ran off to Mexico, without paying Utley his two hundred thousand dollars.\n\nThe Turtles were out of money, and they were being sued by Utley because he hadn't had the money he should have had, and by the big New York firm, because  since the Turtles hadn't known they were now legally their managers they were in breach of contract. They needed money quickly, and so they signed with another big management company, this one co-owned by Bill Cosby, in the belief that Cosby's star power might be able to get them some better bookings.\n\nIt did -- one of the group's first gigs after signing with the new company was at the White House. It turned out they were Tricia Nixon's favourite group, and so they and the Temptations were booked at her request for a White House party. The group at first refused to play for a President they rightly thought of as a monster, but their managers insisted.\n\nThat destroyed their reputation among the cool antiestablishment youth, of course, but it did start getting them well-paid corporate gigs. Right up until the point where Kaylan became sick at his own hypocrisy at playing these events, drank too much of the complimentary champagne at an event for the president of US Steel, went into a drunken rant about how sick the audience made him, and then about how his bandmates were a bunch of sellouts, threw his mic into a swimming pool, and quit while still on stage.\n\nHe was out of the band for two months, during which time they worked on new material without him, before they made up and decided to work on a new album. This new album, though, was going to be more democratic. As well as being all original material, they weren't having any of this nonsense about the lead singer singing lead. This time, whoever wrote the song was going to sing lead, so Kaylan only ended up singing lead on six of the twelve songs on what turned out to be their final album, Turtle Soup.\n\nThey wanted a truly great producer for the new album, and they all made lists of who they might call. The lists included a few big names like George Martin and Phil Spector, but one name kept turning up -- Ray Davies. As we'll hear in the next episode, the Kinks had been making some astonishing music since \"You Really Got Me\", but most of it had not been heard in the US. But the Turtles all loved the Kinks' 1968 album The Kinks Are The Village Green Preservation Society, which they considered the best album ever made:\n\n[Excerpt: The Kinks, \"Animal Farm\"]\n\nThey got in touch with Davies, and he agreed to produce the album -- the first time he did any serious outside production work -- and eventually they were able to persuade White Whale, who had no idea who he was, to allow him to produce it. The resulting album is by far the group's strongest album-length work, though there were problems -- Davies' original mix of the album was dominated by the orchestral parts written by Wrecking Crew musician Ray Pohlman, while the group thought that their own instruments should be more audible, since they were trying to prove that they were a proper band. They remixed it themselves, annoying Davies, though reissues since the eighties have reverted to a mix closer to Davies' intentions.\n\nSome of the music, like Pons' \"Dance This Dance With Me\", perhaps has the group trying a little *too* hard to sound like the Kinks:\n\n[Excerpt: The Turtles, \"Dance This Dance With Me\"]\n\nBut on the other hand, Kaylan's \"You Don't Have to Walk in the Rain\" is the group's last great pop single, and has one of the best lines of any single from the sixties -- \"I look at your face, I love you anyway\":\n\n[Excerpt: The Turtles, \"You Don't Have to Walk in the Rain\"]\n\nBut the album produced no hits, and the group were getting more and more problems from their label. White Whale tried to get Volman and Kaylan to go to Memphis without the other band members to record with Chips Moman, but they refused -- the Turtles were a band, and they were proud of not having session players play their parts on the records. Instead, they started work with Jerry Yester producing on a new album, to be called Shell Shock.\n\nThey did, though bow to pressure and record a terrible country track called \"Who Would Ever Think That I Would Marry Margaret\" backed by session players, at White Whale's insistence, but managed to persuade the label not to release it.\n\nThey audited White Whale and discovered that in the first six months of 1969 alone -- a period where they hadn't sold that many records -- they'd been underpaid by a staggering six hundred and fifty thousand dollars.\n\nThey sued the label for several million, and in retaliation, the label locked them out of the recording studio, locking their equipment in there. They basically begged White Whale to let them record one last great single, one last throw of the dice.\n\nJim Pons had, for years, known a keyboard player named Bob Harris, and had recently got to know Harris' wife, Judee Sill. Sill had a troubled life -- she was a heroin addict, and had at times turned to streetwalking to earn money, and had spent time in prison for armed robbery -- but she was also an astonishing songwriter, whose music was as inspired by Bach as by any pop or folk composer.\n\nSill had been signed to Blimp, the Turtles' new production and publishing company, and Pons was co-producing some tracks on her first album, with Graham Nash producing others. Pons thought one song from that album, \"Lady-O\", would be perfect for the Turtles:\n\n[Excerpt: Judee Sill, \"Lady-O\"]\n\n(music continues under) The Turtles stuck closely to Sill's vision of the song. So closely that you haven't noticed that before I started talking, we'd already switched from Sill's record to the Turtles' version.\n\n[Excerpt: The Turtles, \"Lady-O\"]\n\nThat track, with Sill on guitar backing Kaylan, Volman, and Nichol's vocals, was the last Turtles single to be released while the band were together. Despite “Lady O” being as gorgeous a melody as has ever been produced in the rock world, it sank without trace, as did a single from the Shell Shock sessions released under a pseudonym, The Dedications.\n\nWhite Whale followed that up, to the group's disgust, with \"Who Would Ever Think That I Would Marry Margaret?\", and then started putting out whatever they had in the vaults, trying to get the last few pennies, even releasing their 1965 album track version of \"Eve of Destruction\" as if it were a new single.\n\nThe band were even more disgusted when they discovered that, thanks to the flurry of suits and countersuits, they not only could no longer perform as the Turtles, but White Whale were laying legal claim to their own names. They couldn't perform under those names -- Howard Kaylan, Mark Volman, and the rest were the intellectual property of White Whale, according to the lawyers.\n\nThe group split up, and Kaylan and Volman did some session work, including singing on a demo for a couple of new songwriters:\n\n[Excerpt: Steely Dan, \"Everyone's Gone to the Movies\"]\n\nWhen that demo got the songwriters a contract, one of them actually phoned up to see if Kaylan wanted a permanent job in their new band, but they didn't want Volman as well, so Kaylan refused, and Steely Dan had to do without him.\n\nVolman and Kaylan were despondent, washed-up, has-been ex-rock stars. But when they went to see a gig by their old friend Frank Zappa, it turned out that he was looking for exactly that. Of course, they couldn't use their own names, but the story of the Phlorescent Leech and Eddie is a story for another time...",
  "itunes:subtitle": "Episode one hundred and fifty-four of A History of Rock Music in Five Hundred Songs is the last of our four-part mini-series on LA sunshine pop and folk-rock in summer 1967. Click the full post to read liner notes, links to more information, and a transc",
  "itunes:keywords": "Bob Dylan,Bones Howe,Brian Jones,Buffalo Springfield,Cheech Marin,Chip Douglas,Danny Hutton,David Crosby,Donovan,Flo and Eddie,Frank Zappa,Gene Clark,Graham Nash,Harry Nilsson,Howard Kaylan,Jim Pons,Jimi Hendrix,John&#039;s Children,Judee Sill,Marc Bolan,Mark Volman,Nik Venet,P.F. Sloan,Pat Boone,Ray Davies,Steely Dan,T. Rex,The Beach Boys,The Beatles,The Leaves,The Lovin&#039; Spoonful,The Turtles,The Zombies",
  "itunes:episodeType": "full",
  "itunes:episode": 154,
  "content:encoded": "Episode one hundred and fifty-four of <em>A History of Rock Music in Five Hundred Songs </em>is the last of our four-part mini-series on LA sunshine pop and folk-rock in summer 1967. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, <a href=\"https://www.patreon.com/posts/72267563\">on \"Baby, Now That I've Found You\" by the Foundations.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nThere is no Mixcloud this week, because there were too many Turtles songs in the episode.\n\nThere's relatively little information available about the Turtles compared to other bands of their era, and so apart from the sources on the general LA scene referenced in all these podcasts, the information here comes from a small number of sources.\n\n<a href=\"https://amzn.to/3DI40jc\">This DVD</a> is a decent short documentary on the band's career.\n\nHoward Kaylan's autobiography, <a href=\"https://amzn.to/3facEwR\"><em>Shell Shocked: My Life with the Turtles, Flo and Eddie, and Frank Zappa, Etc.</em></a>,  is a fun read, if inevitably biased towards his own viewpoint. Jim Pons' <a href=\"https://amzn.to/3f937WM\"><em>Hard Core Love: Sex, Football, and Rock and Roll in the Kingdom of God</em></a> is much less fun, being as it is largely organised around how his life led up to his latter-day religious beliefs, but is the only other book I'm aware of with a substantial amount of coverage of the Turtles.\n\nThere are many compilations of the Turtles' material available, of which <a href=\"https://amzn.to/3dw5VN6\"><em>All The Singles</em></a> is by far and away the best. The box set of all their albums with bonus tracks is now out of print on CD, but can still be bought <a href=\"https://amzn.to/3qW3CpO\">as MP3s</a>.\n\n<strong>Errata</strong>\n\nI say that the clarinet and saxophone have the same fingerings. This is not strictly true -- they have very, very, similar fingerings, and the same when you're just starting out on both instruments, but the clarinet has a wider range and overblows at a perfect twelfth rather than an octave. For a beginner, as Volman and Kaylan were, they're the same though.\n\nAlso, for the first day or so it was uploaded, this episode included an excerpt of the studio version of \"Everyone's Gone to the Movies\" by Steely Dan rather than the demo version on which Volman and Kaylan sang. That has been fixed.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWe've spent a lot of time recently in the LA of summer 1967, at the point where the sunshine pop sound that was created when the surf harmonies of the Beach Boys collided with folk rock was at its apex, right before fashions changed and tight sunny pop songs with harmonies from LA became yesterday's news, and extended blues-rock improvisations from San Francisco became the latest in thing.\n\nThis episode is the last part of this four-episode sequence, and is going to be shorter than those others. In many ways this one is a bridge between this sequence and next episode, where we travel back to London, because we're saying goodbye for a while to the LA scene, and when we do return to LA it will be, for the most part, to look at music that's a lot less sunshine and a lot more shadow. So this is a brief fade-out while we sing ba-ba-ba, a three-minute pop-song of an episode, a last bit of sunshine pop before we return to longer, more complicated, stories  in two weeks' time, at which point the sun will firmly set.\n\nLike many musicians associated with LA, Howard Kaylan was born elsewhere and migrated there as a child, and he seems to have regarded his move from upstate New York to LA as essentially a move to Disneyland itself. That impression can only have been made stronger by the fact that soon after his family moved there he got his first childhood girlfriend -- who happened to be a Mouseketeer on the TV.\n\nAnd TV was how young Howard filtered most of his perceptions -- particularly TV comedy. By the age of fourteen he was the president of the Soupy Sales Fan Club, and he was also obsessed with the works of Ernie Kovacs, Sid Caesar, and the great satirist and parodist Stan Freberg:\n\n[Excerpt: Stan Freberg, \"St. George and the Dragonet\"]\n\nSecond only to his love of comedy, though, was his love of music, and it was on the trip from New York to LA that he saw a show that would eventually change his life. Along the way, his family had gone to Las Vegas, and while there they had seen Louis Prima and Keeley Smith do their nightclub act.\n\nPrima is someone I would have liked to do a full podcast episode on when I was covering the fifties, and who I did do a Patreon bonus episode on. He's now probably best known for doing the voice of King Louis in the Jungle Book:\n\n[Excerpt: Louis Prima, \"I Wanna Be Like You (the Monkey Song)\"]\n\nBut he was also a jump blues musician who made some very good records in a similar style to Louis Jordan, like \"Jump, Jive, an' Wail\"\n\n[Excerpt: Louis Prima, \"Jump, Jive, an' Wail\"]\n\nBut like Jordan, Prima dealt at least as much in comedy as in music -- usually comedy involving stereotypes about his Italian-American ethnic origins. At the time young Howard Kaylan saw him, he was working a double act with his then-wife Keeley Smith. The act would consist of Smith trying to sing a song straight, while Prima would clown around, interject, and act like a fool, as Smith grew more and more exasperated, and would eventually start contemptuously mocking Prima.\n\n[Excerpt: Louis Prima and Keeley Smith, \"Embraceable You/I've Got It Bad and That Ain't Good\"]\n\nThis is of course a fairly standard double-act format, as anyone who has suffered through an episode of The Little and Large Show will be all too painfully aware, but Prima and Smith did it better than most, and to young Howard Kaylan, this was the greatest entertainment imaginable.\n\nBut while comedy was the closest thing to Kaylan's heart, music was a close second. He was a regular listener to Art Laboe's radio show, and in a brief period as a teenage shoplifter he obtained records like Ray Charles' album Genius + Soul = Jazz:\n\n[Excerpt: Ray Charles, \"One Mint Julep\"]\n\nand the single \"Tossin' and Turnin'\" by Bobby Lewis:\n\n[Excerpt: Bobby Lewis, \"Tossin' and Turnin'\"]\n\n\"Tossin' and Turnin'\" made a deep impression on Kaylan, because of the saxophone solo, which was actually a saxophone duet. On the record, baritone sax player Frank Henry played a solo, and it was doubled by the great tenor sax player King Curtis, who was just playing a mouthpiece rather than a full instrument, making a high-pitched squeaking sound:\n\n[Excerpt: Bobby Lewis, \"Tossin' and Turnin'\"]\n\nCurtis was of course also responsible for another great saxophone part a couple of years earlier, on a record that Kaylan loved because it combined comedy and rock and roll, \"Yakety Yak\":\n\n[Excerpt: The Coasters, \"Yakety Yak\"]\n\nThose two saxophone parts inspired Kaylan to become a rock and roller. He was already learning the clarinet and playing part time in an amateur Dixieland band, and it was easy enough to switch to saxophone, which has the same fingering. Within a matter of weeks of starting to play sax, he was invited to join a band called the Nightriders, who consisted of Chuck Portz on bass, Al Nichol on guitar, and Glen Wilson on drums. The Nightriders became locally popular, and would perform sets largely made up of Johnny and the Hurricanes and Ventures material.\n\nWhile he was becoming a budding King Curtis, Kaylan was still a schoolkid, and one of the classes he found most enjoyable was choir class. There was another kid in choir who Kaylan got on with, and one day that kid, Mark Volman came up to him, and had a conversation that Kaylan would recollect decades later in his autobiography:\n\n“So I hear you’re in a rock ’n’ roll band.”\n\n“Yep.”\n\n“Um, do you think I could join it?”\n\n“Well, what do you do?”\n\n“Nothing.”\n\n“Nothing?”\n\n“Nope.”\n\n“Sounds good to me. I’ll ask Al.”\n\nVolman initially became the group's roadie and occasional tambourine player, and would also get on stage to sing a bit during their very occasional vocal numbers, but was mostly \"in the band\" in name only at first -- he didn't get a share of the group's money, but he was allowed to say he was in the group because that meant that his friends would come to the Nightriders' shows, and he was popular among the surfing crowd.\n\nEventually, Volman's father started to complain that his son wasn't getting any money from being in the band, while the rest of the group were, and they explained to him that Volman was just carrying the instruments while they were all playing them. Volman's father said \"if Mark plays an instrument, will you give him equal shares?\" and they said that that was fair, so Volman got an alto sax to play along with Kaylan's tenor. Volman had also been taking clarinet lessons, and the two soon became a tight horn section for the group, which went through a few lineup changes and soon settled on a lineup of Volman and Kaylan on saxes, Nichol on lead guitar, Jim Tucker on rhythm guitar, Portz on bass, and Don Murray on drums.\n\nThat new lineup became known as the Crossfires, presumably after the Johnny and the Hurricanes song of the same name:\n\n[Excerpt: Johnny and the Hurricanes, \"Crossfire\"]\n\nVolman and Kaylan worked out choreographed dance steps to do while playing their saxes, and the group even developed a group of obsessive fans who called themselves the Chunky Club, named after one of the group's originals:\n\n[Excerpt: The Crossfires, \"Chunky\"]\n\nAt this point the group were pretty much only playing instrumentals, though they would do occasional vocals on R&B songs like \"Money\" or their version of Don and Dewey's \"Justine\", songs which required more enthusiasm than vocal ability. But their first single, released on a tiny label, was another surf instrumental, a song called \"Dr. Jekyll and Mr. Hyde\":\n\n[Excerpt: The Crossfires, \"Dr. Jekyll and Mr Hyde\"]\n\nThe group became popular enough locally that they became the house band at the Revelaire Club in Redondo Beach. There as well as playing their own sets, they would also be the backing band for any touring acts that came through without their own band, quickly gaining the kind of performing ability that comes from having to learn a new artist's entire repertoire in a few days and be able to perform it with them live with little or no rehearsal. They backed artists like the Coasters, the Drifters, Bobby Vee, the Rivingtons, and dozens of other major acts, and as part of that Volman and Kaylan would, on songs that required backing vocals, sing harmonies rather than playing saxophone.\n\nAnd that harmony-singing ability became important when the British Invasion happened, and suddenly people didn't want to hear surf instrumentals, but vocals along the lines of the new British groups. The Crossfires' next attempt at a single was another original, this one an attempt at sounding like one of their favourite new British groups, the Kinks:\n\n[Excerpt: The Crossfires, \"One Potato, Two Potato\"]\n\nThis change to vocals necessitated a change in the group dynamic. Volman and Kaylan ditched the saxophones, and discovered that between them they made one great frontman. The two have never been excessively close on a personal level, but both have always known that the other has qualities they needed. Frank Zappa would later rather dismissively say \"I regard Howard as a fine singer, and Mark as a great tambourine player and fat person\", and it's definitely true that Kaylan is one of the truly great vocalists to come out of the LA scene in this period, while Volman is merely a good harmony singer, not anything particularly special -- though he *is* a good harmony singer -- but it undersells Volman's contribution. There's a reason the two men performed together for nearly sixty years.\n\nKaylan is a great singer, but also by nature rather reserved, and he always looked uncomfortable on stage, as well as, frankly, not exactly looking like a rock star (Kaylan describes himself not inaccurately as looking like a potato several times in his autobiography). Volman, on the other hand, is a merely good singer, but he has a naturally outgoing personality, and while he's also not the most conventionally good-looking of people he has a *memorable* appearance in a way that Kaylan doesn't. Volman could do all the normal frontman stuff, the stuff that makes a show an actual show -- the jokes, the dancing, the between-song patter, the getting the crowd going, while Kaylan could concentrate on the singing.\n\nThey started doing a variation on the routine that had so enthralled Howard Kaylan when he'd seen Louis Prima and Keeley Smith do it as a child. Kaylan would stand more or less stock still, looking rather awkward, but singing like an angel, while Volman would dance around, clown, act the fool, and generally do everything he could to disrupt the performance -- short of actually disrupting it in reality. It worked, and Volman became one of that small but illustrious group of people -- the band member who makes the least contribution to the sound of the music but the biggest contribution to the feel of the band itself, and without whom they wouldn't be the same.\n\nAfter \"One Potato, Two Potato\" was a flop, the Crossfires were signed to their third label. This label, White Whale, was just starting out, and the Crossfires were to become their only real hit act. Or rather, the Turtles were.\n\nThe owners of White Whale knew that they didn't have much promotional budget and that their label was not a known quantity -- it was a tiny label with no track record. But they thought of a way they could turn that to their advantage. Everyone knew that the Beatles, before Capitol had picked up their contracts, had had their records released on a bunch of obscure labels like Swan and Tollie. People *might* look for records on tiny independent labels if they thought it might be another British act who were unknown in the US but could be as good as the Beatles. So they chose a name for the group that they thought sounded as English as possible -- an animal name that started with \"the\", and ended in \"les\", just like the Beatles.\n\nThe group, all teenagers at the time, were desperate enough that they agreed to change their name, and from that point on they became the Turtles.\n\nIn order to try and jump on as many bandwagons as possible, the label wanted to position them as a folk-rock band, so their first single under the Turtles name was a cover of a Bob Dylan song, from Another Side of Bob Dylan:\n\n[Excerpt: Bob Dylan, \"It Ain't Me Babe\"]\n\nThat song's hit potential had already been seen by Johnny Cash, who'd had a country hit with it a few months before. But the Turtles took the song in a different direction, inspired by Kaylan's *other* great influence, along with Prima and Smith. Kaylan was a big fan of the Zombies, one of the more interesting of the British Invasion groups, and particularly of their singer Colin Blunstone. Kaylan imitated Blunstone on the group's hit single, \"She's Not There\", on which Blunstone sang in a breathy, hushed, voice on the verses:\n\n[Excerpt: The Zombies, \"She's Not There\"]\n\nbefore the song went into a more stomping chorus on which Blunstone sang in a fuller voice:\n\n[Excerpt: The Zombies, \"She's Not There\"]\n\nKaylan did this on the Turtles' version of \"It Ain't Me Babe\", starting off with a quiet verse:\n\n[Excerpt: The Turtles, \"It Ain't Me Babe\"]\n\nBefore, like the Zombies, going into a foursquare, more uptempo, louder chorus:\n\n[Excerpt: The Turtles, \"It Ain't Me Babe\"]\n\nThe single became a national top ten hit, and even sort of got the approval of Bob Dylan. On the group's first national tour, Dylan was at one club show, which they ended with \"It Ain't Me Babe\", and after the show the group were introduced to the great songwriter, who was somewhat the worse for wear. Dylan said “Hey, that was a great song you just played, man. That should be your single\", and then passed out into his food.\n\nWith the group's first single becoming a top ten hit, Volman and Kaylan got themselves a house in Laurel Canyon, which was not yet the rock star Mecca it was soon to become, but which was starting to get a few interesting residents. They would soon count Henry Diltz of the Modern Folk Quartet, Danny Hutton, and Frank Zappa among their neighbours.\n\nSoon Richie Furay would move in with them, and the house would be used by the future members of the Buffalo Springfield as their rehearsal space. The Turtles were rapidly becoming part of the in crowd.\n\nBut they needed a follow-up single, and so Bones Howe, who was producing their records, brought in P.F. Sloan to play them a few of his new songs. They liked \"Eve of Destruction\" enough to earmark it as a possible album track, but they didn't think they would do it justice, and so it was passed on to Barry McGuire. But Sloan did have something for them -- a pseudo-protest song called \"Let Me Be\" that was very clearly patterned after their version of \"It Ain't Me Babe\", and which was just rebellious enough to make them seem a little bit daring, but which was far more teenage angst than political manifesto:\n\n[Excerpt: The Turtles, \"Let Me Be\"]\n\nThat did relatively well, making the top thirty -- well enough for the group to rush out an album which was padded out with some sloppy cover versions of other Dylan songs, a version of \"Eve of Destruction\", and a few originals written by Kaylan.\n\nBut the group weren't happy with the idea of being protest singers. They were a bunch of young men who were more motivated by having a good time than by politics, and they didn't think that it made sense for them to be posing as angry politicised rebels. Not only that, but there was a significant drop-off between \"It Ain't Me Babe\" and \"Let Me Be\". They needed to do better.\n\nThey got the clue for their new direction while they were in New York. There they saw their friends in the Mothers of Invention playing their legendary residency at the Garrick Theatre, but they also saw a new band, the Lovin' Spoonful, who were playing music that was clearly related to the music the Turtles were doing -- full of harmonies and melody, and inspired by folk music -- but with no sense of rebelliousness at all. They called it \"Good Time Music\":\n\n[Excerpt: The Lovin' Spoonful, \"Good Time Music\"]\n\nAs soon as they got back to LA, they told Bones Howe and the executives at White Whale that they weren't going to be a folk-rock group any more, they were going to be \"good time music\", just like the Lovin' Spoonful.\n\nThey were expecting some resistance, but they were told that that was fine, and that PF Sloan had some good time music songs too. \"You Baby\" made the top twenty:\n\n[Excerpt: The Turtles, \"You Baby\"]\n\nThe Turtles were important enough in the hierarchy of LA stars that Kaylan and Tucker were even invited by David Crosby to meet the Beatles at Derek Taylor's house when they were in LA on their last tour -- this may be the same day that the Beatles met Brian and Carl Wilson, as I talked about in the episode on \"All You Need is Love\", though Howard Kaylan describes this as being a party and that sounded like more of an intimate gathering.\n\nIf it was that day, there was nearly a third Beach Boy there. The Turtles knew David Marks, the Beach Boys' former rhythm guitarist, because they'd played a lot in Inglewood where he'd grown up, and Marks asked if he could tag along with Kaylan and Tucker to meet the Beatles. They agreed, and drove up to the house, and actually saw George Harrison through the window, but that was as close as they got to the Beatles that day. There was a heavy police presence around the house because it was known that the Beatles were there, and one of the police officers asked them to drive back and park somewhere else and walk up, because there had been complaints from neighbours about the number of cars around. They were about to do just that, when Marks started yelling obscenities and making pig noises at the police, so they were all arrested, and the police claimed to find a single cannabis seed in the car.\n\nCharges were dropped, but now Kaylan was on the police's radar, and so he moved out of the Laurel Canyon home to avoid bringing police attention to Buffalo Springfield, so that Neil Young and Bruce Palmer wouldn't get deported.\n\nBut generally the group were doing well. But there was a problem. And that problem was their record label. They rushed out another album to cash in on the success of \"You Baby\", one that was done so quickly that it had \"Let Me Be\" on it again, just as the previous album had, and which included a version of the old standard \"All My Trials\", with the songwriting credited to the two owners of White Whale records. And they pumped out a lot of singles. A LOT of singles, ranging from a song written for them by new songwriter Warren Zevon, to cover versions of Frank Sinatra's \"It Was a Very Good Year\" and the old standard \"We'll Meet Again\".\n\nOf the five singles after \"You Baby\", the one that charted highest was a song actually written by a couple of the band members. But for some reason a song with verses in 5/4 time and choruses in 6/4 with lyrics like \"killing the living and living to kill, the grim reaper of love thrives on pain\" didn't appeal to the group's good-time music pop audience and only reached number eighty-one:\n\n[Excerpt: The Turtles, \"Grim Reaper of Love\"]\n\nThe group started falling apart. Don Murray became convinced that  the rest of the band were conspiring against him and wanted him out, so he walked out of the group in the middle of a rehearsal for a TV show. They got Joel Larson of the Grass Roots -- the group who had a number of hits with Sloan and Barri songs -- to sub for a few gigs before getting in a permanent replacement, Johnny Barbata, who came to them on the recommendation of Gene Clark, and who was one of the best drummers on the scene -- someone who was not only a great drummer but a great showman, who would twirl his drumsticks between his fingers with every beat, and who would regularly engage in drum battles with Buddy Rich.\n\nBy the time they hit their fifth flop single in a row, they lost their bass player as well -- Chuck Portz decided he was going to quit music and become a fisherman instead. They replaced him with Chip Douglas of the Modern Folk Quartet.\n\nThen they very nearly lost their singers. Volman and Kaylan both got their draft notices at the same time, and it seemed likely they would end up having to go and fight in the Vietnam war. Kaylan was distraught, but his mother told him \"Speak to your cousin Herb\".\n\nCousin Herb was Herb Cohen, the manager of the Mothers of Invention and numerous other LA acts, including the Modern Folk Quartet, and Kaylan only vaguely knew him at this time, but he agreed to meet up with them, and told them “Stop worrying! I got Zappa out, I got Tim Buckley out, and I’ll get you out.”\n\nCohen told Volman and Kaylan to not wash for a week before their induction, to take every drug of every different kind they could find right before going in, to deliberately disobey every order, to fail the logic tests, and to sexually proposition the male officers dealing with the induction. They followed his orders to the letter, and got marked as 4-F, unfit for service.\n\nThey still needed a hit though, and eventually they found something by going back to their good-time music idea. It was a song from the Koppelman-Rubin publishing company -- the same company that did the Lovin Spoonful's management and production.\n\nThe song in question was by Alan Gordon and Gary Bonner, two former members of a group called the Magicians, who had had a minor success with a single called \"An Invitation to Cry\":\n\n[Excerpt: The Magicians, \"An Invitation to Cry\"]\n\nThe Magicians had split up, and Bonner and Gordon were trying to make a go of things as professional songwriters, but had had little success to this point. The song on the demo had been passed over by everyone, and the demo was not at all impressive, just a scratchy acetate with Bonner singing off-key and playing acoustic rhythm guitar and Gordon slapping his knees to provide rhythm, but the group heard something in it.\n\nThey played the song live for months, refining the arrangement, before taking it into the studio. There are arguments to this day as to who deserves the credit for the sound on \"Happy Together\" -- Chip Douglas apparently did the bulk of the arrangement work while they were on tour, but the group's new producer, Joe Wissert, a former staff engineer for Cameo-Parkway, also claimed credit for much of it. Either way, \"Happy Together\" is a small masterpiece of dynamics.\n\nThe song is structured much like the songs that had made the Turtles' name, with the old Zombies idea of the soft verse and much louder chorus:\n\n[Excerpt: The Turtles, \"Happy Together\"]\n\nBut the track is really made by the tiny details of the arrangement, the way instruments and vocal parts come in and out as the track builds up, dies down, and builds again. If you listen to the isolated tracks, there are fantastic touches like the juxtaposition of the bassoon and oboe (which I think is played on a mellotron):\n\n[Excerpt: The Turtles, \"Happy Together\", isolated tracks]\n\nAnd a similar level of care and attention was put into the vocal arrangement by Douglas, with some parts just Kaylan singing solo, other parts having Volman double him, and of course the famous \"bah bah bah\" massed vocals:\n\n[Excerpt: The Turtles, \"Happy Together\", isolated vocals]\n\nAt the end of the track, thinking he was probably going to do another take, Kaylan decided to fool around and sing \"How is the weather?\", which Bonner and Gordon had jokingly done on the demo. But the group loved it, and insisted that was the take they were going to use:\n\n[Excerpt: The Turtles, \"Happy Together\"]\n\n\"Happy Together\" knocked \"Penny Lane\" by the Beatles off the number one spot in the US, but by that point the group had already had another lineup change. The Monkees had decided they wanted to make records without the hit factory that had been overseeing them, and had asked Chip Douglas if he wanted to produce their first recordings as a self-contained band. Given that the Monkees were the biggest thing in the American music industry at the time, Douglas had agreed, and so the group needed their third bass player in a year.\n\nThe one they went for was Jim Pons. Pons had seen the Beatles play at the Hollywood Bowl in 1964, and decided he wanted to become a pop star. The next day he'd been in a car crash, which had paid out enough insurance money that he was able to buy two guitars, a bass, drums, and amps, and use them to start his own band.\n\nThat band was originally called The Rockwells, but quickly changed their name to the Leaves, and became a regular fixture at Ciro's on Sunset Strip, first as customers, then after beating Love in the auditions, as the new resident band when the Byrds left.\n\nFor a while the Leaves had occasionally had guest vocals from a singer called Richard Marin, but Pons eventually decided to get rid of him, because, as he put it \"I wanted us to look like The Beatles. There were no Mexicans in The Beatles\". He is at pains in his autobiography to assure us that he's not a bigot, and that Marin understood. I'm sure he did. Marin went on to be better known as Cheech Marin of Cheech and Chong.\n\nThe Leaves were signed by Pat Boone to his production company, and through that company they got signed to Mira Records. Their first single, produced by Nik Venet, had been a version of \"Love Minus Zero (No Limit)\", a song by Bob Dylan:\n\n[Excerpt: The Leaves, \"Love Minus Zero (No Limit)\"]\n\nThat had become a local hit, though not a national one, and the Leaves had become one of the biggest bands on the Sunset Strip scene, hanging out with all the other bands. They had become friendly with the Doors before the Doors got a record deal, and Pat Boone had even asked for an introduction, as he was thinking of signing them, but unfortunately when he met Jim Morrison, Morrison had drunk a lot of vodka, and given that Morrison was an obnoxious drunk Boone had second thoughts, and so the world missed out on the chance of a collaboration between the Doors and Pat Boone.\n\nTheir second single was \"Hey Joe\" -- as was their third and fourth, as we discussed in that episode:\n\n[Excerpt: The Leaves, \"Hey Joe\"]\n\nTheir third version of \"Hey Joe\" had become a top forty hit, but they didn't have a follow-up, and their second album, All The Good That's Happening, while it's a good album, sold poorly. Various band members quit or fell out, and when Johnny Barbata knocked on Jim Pons' door it was an easy decision to quit and join a band that had a current number one hit.\n\nWhen Pons joined, the group had already recorded the Happy Together album. That album included the follow-up to \"Happy Together\", another Bonner and Gordon song, \"She'd Rather Be With Me\":\n\n[Excerpt: The Turtles, \"She'd Rather Be With Me\"]\n\nNone of the group were tremendously impressed with that song, but it did very well, becoming the group's second-biggest hit in the US, reaching number three, and actually becoming a bigger hit than \"Happy Together\" in parts of Europe.\n\nBefore \"Happy Together\" the group hadn't really made much impact outside the US. In the UK, their early singles had been released by Pye, the smallish label that had the Kinks and Donovan, but which didn't have much promotional budget, and they'd sunk without trace. For \"You Baby\" they'd switched to Immediate, the indie label that Andrew Oldham had set up, and it had done a little better but still not charted.\n\nBut from \"Happy Together\" they were on Decca, a much bigger label, and \"Happy Together\" had made number twelve in the charts in the UK, and \"She'd Rather Be With Me\" reached number four. So the new lineup of the group went on a UK tour.\n\nAs soon as they got to the hotel, they found they had a message from Graham Nash of the Hollies, saying he would like to meet up with them. They all went round to Nash's house, and found Donovan was also there, and Nash played them a tape he'd just been given of Sgt Pepper, which wouldn't come out for a few more days. At this point they were living every dream a bunch of Anglophile American musicians could possibly have.\n\nJim Tucker mentioned that he would love to meet the Beatles, and Nash suggested they do just that. On their way out the door, Donovan said to them, \"beware of Lennon\".\n\nIt was when they got to the Speakeasy club that the first faux-pas of the evening happened. Nash introduced them to Justin Hayward and John Lodge of the Moody Blues, and Volman said how much he loved their record \"Go Now\":\n\n[Excerpt: The Moody Blues, \"Go Now\"]\n\nThe problem was that Hayward and Lodge had joined the group after that record had come out, to replace its lead singer Denny Laine. Oh well, they were still going to meet the Beatles, right? They got to the table where John, Paul, and Ringo were sat, at a tense moment -- Paul was having a row with Jane Asher, who stormed out just as the Turtles were getting there. But at first, everything seemed to go well. The Beatles all expressed their admiration for \"Happy Together\" and sang the \"ba ba ba\" parts at them, and Paul and Kaylan bonded over their shared love for \"Justine\" by Don and Dewey, a song which the Crossfires had performed in their club sets, and started singing it together:\n\n[Excerpt: Don and Dewey, \"Justine\"]\n\nBut John Lennon was often a mean drunk, and he noticed that Jim Tucker seemed to be the weak link in the group, and soon started bullying him, mocking his clothes, his name, and everything he said. This devastated Tucker, who had idolised Lennon up to that point, and blurted out \"I'm sorry I ever met you\", to which Lennon just responded \"You never did, son, you never did\".\n\nThe group walked out, hurt and confused -- and according to Kaylan in his autobiography, Tucker was so demoralised by Lennon's abuse that he quit music forever shortly afterwards, though Tucker says that this wasn't the reason he quit. From their return to LA on, the Turtles would be down to just a five-piece band.\n\nAfter leaving the club, the group went off in different directions, but then Kaylan (and this is according to Kaylan's autobiography, there are no other sources for this) was approached by Brian Jones, asking for his autograph because he loved the Turtles so much.\n\nJones introduced Kaylan to the friend he was with, Jimi Hendrix, and they went out for dinner, but Jones soon disappeared with a girl he'd met. and left Kaylan and Hendrix alone. They were drinking a lot -- more than Kaylan was used to -- and he was tired, and the omelette that Hendrix had ordered for Kaylan was creamier than he was expecting... and Kaylan capped what had been a night full of unimaginable highs and lows by vomiting all over Jimi Hendrix's expensive red velvet suit.\n\nRather amazingly after all this, the Moody Blues, the Beatles, and Hendrix, all showed up to the Turtles' London gig and apparently enjoyed it.\n\nAfter \"She'd Rather Be With Me\", the next single to be released wasn't really a proper single, it was a theme song they'd been asked to record for a dire sex comedy titled \"Guide for the Married Man\", and is mostly notable for being composed by John Williams, the man who would later go on to compose the music for Star Wars.\n\nThat didn't chart, but the group followed it with two more top twenty hits written by Bonner and Gordon, \"You Know What I Mean\" and \"She's My Girl\".\n\nBut then the group decided that Bonner and Gordon weren't giving them their best material, and started turning down their submissions, like a song called \"Celebrity Ball\" which they thought had no commercial potential, at least until the song was picked up by their friends Three Dog Night, retitled \"Celebrate\", and made the top twenty:\n\n[Excerpt: Three Dog Night, \"Celebrate\"]\n\nInstead, the group decided to start recording more of their own material. They were worried that in the fast-changing rock world bands that did other songwriters' material were losing credibility. But \"Sound Asleep\", their first effort in this new plan, only made number forty-seven on the charts.\n\nClearly they needed a different plan. They called in their old bass player Chip Douglas, who was now an experienced hitmaker as a producer. He called in *his* friend Harry Nilsson, who wrote \"The Story of Rock & Roll\" for the group, but that didn't do much better, only making number forty-eight.\n\nBut the group persevered, starting work on a new album produced by Douglas, The Turtles Present The Battle of the Bands, the conceit of which was that every track would be presented as being by a different band. So there were tracks by  Chief Kamanawanalea and his Royal Macadamia Nuts,  Fats Mallard and the Bluegrass Fireball, The Atomic Enchilada, and so on, all done in the styles suggested by those band names. There was even a track by \"The Cross Fires\":\n\n[Excerpt: The Cross Fires, \"Surfer Dan\"]\n\nIt was the first time the group had conceived of an album as a piece, and nine of the twelve tracks were originals by the band -- there was a track written by their friend Bill Martin, and the opening track, by \"The US Teens Featuring Raoul\", was co-written by Chip Douglas and Harry Nilsson. But for the most part the songs were written by the band members themselves, and jointly credited to all of them.\n\nThis was the democratic decision, but one that Howard Kaylan would later regret, because of the song for which the band name was just \"Howie, Mark, Johnny, Jim & Al\". Where all the other songs were parodies of other types of music, that one was, as the name suggests, a parody of the Turtles themselves. It was written by Kaylan in disgust at the record label, who kept pestering the group to \"give us another 'Happy Together'\". Kaylan got more and more angry at this badgering, and eventually thought \"OK, you want another 'Happy Together'? I'll give you another 'Happy Together'\" and in a few minutes wrote a song that was intended as an utterly vicious parody of that kind of song, with lyrics that nobody could possibly take seriously, and with music that was just mocking the whole structure of \"Happy Together\" specifically.\n\nHe played it to the rest of the group, expecting them to fall about laughing, but instead they all insisted it was the group's next single. \"Elenore\" went to number six on the charts, becoming their biggest hit since \"She'd Rather Be With Me\":\n\n[Excerpt: The Turtles, \"Elenore\"]\n\nAnd because everything was credited to the group, Kaylan's songwriting royalties were split five ways.\n\nFor the follow-up, they chose the one actual cover version on the album. \"You Showed Me\" is a song that Roger McGuinn and Gene Clark had written together in the very early days of the Byrds, and they'd recorded it as a jangly folk-rock tune in 1964:\n\n[Excerpt: The Byrds, \"You Showed Me\"]\n\nThey'd never released that track, but Gene Clark had performed it solo after leaving the Byrds, and Douglas had been in Clark's band at the time, and liked the song. He played it for the Turtles, but when he played it for them the only instrument he had to hand was a pump organ with one of its bellows broken. Because of this, he had to play it slowly, and while he kept insisting that the song needed to be faster, the group were equally insistent that what he was playing them was the big ballad hit they wanted, and they recorded it at that tempo. \"You Showed Me\" became the Turtles' final top ten hit:\n\n[Excerpt: The Turtles, \"You Showed Me\"]\n\nBut once again there were problems in the group. Johnny Barbata was the greatest drummer any of them had ever played with, but he didn't fit as a personality -- he didn't like hanging round with the rest of them when not on stage, and while there were no hard feelings, it was clear he could get a gig with pretty much anyone and didn't need to play with a group he wasn't entirely happy in. By mutual agreement, he left to go and play with Crosby, Stills, Nash, and Young, and was replaced by John Seiter from Spanky and Our Gang -- a good drummer, but not the best of the best like Barbata had been.\n\nOn top of this, there were a whole host of legal problems to deal with. The Turtles were the only big act on White Whale records, though White Whale did put out some other records. For example, they'd released the single \"Desdemona\" by John's Children in the US:\n\n[Excerpt: John's Children, \"Desdemona\"]\n\nThe group, being the Anglophiles they were, had loved that record, and were also among the very small number of Americans to like the music made by John's Children's guitarist's new folk duo, Tyrannosaurus Rex:\n\n[Excerpt: Tyrannosaurus Rex, \"Debora\"]\n\nWhen Tyrannosaurus Rex supported the Turtles, indeed, Volman and Kaylan became very close to Marc Bolan, and told him that the next time they were in England they'd have to get together, maybe even record together.\n\nThat would happen not that many years later, with results we'll be getting to in... episode 201, by my current calculations. But John's Children hadn't had a hit, and indeed nobody on White Whale other than the Turtles had. So White Whale desperately wanted to stop the Turtles having any independence, and to make sure they continued to be their hit factory.\n\nThey worked with the group's roadie, Dave Krambeck, to undermine the group's faith in their manager, Bill Utley, who supported the group in their desire for independence. Soon, Krambeck and White Whale had ousted Utley, and Krambeck had paid Utley fifty thousand dollars for their management contract, with the promise of another two hundred thousand later. That fifty thousand dollars had been taken by Krambeck as an advance against the Turtles' royalties, so they were really buying themselves out.\n\nExcept that Krambeck then sold the management contract on to a New York management firm, without telling the group. He then embezzled as much of the group's ready cash as he could and ran off to Mexico, without paying Utley his two hundred thousand dollars.\n\nThe Turtles were out of money, and they were being sued by Utley because he hadn't had the money he should have had, and by the big New York firm, because  since the Turtles hadn't known they were now legally their managers they were in breach of contract. They needed money quickly, and so they signed with another big management company, this one co-owned by Bill Cosby, in the belief that Cosby's star power might be able to get them some better bookings.\n\nIt did -- one of the group's first gigs after signing with the new company was at the White House. It turned out they were Tricia Nixon's favourite group, and so they and the Temptations were booked at her request for a White House party. The group at first refused to play for a President they rightly thought of as a monster, but their managers insisted.\n\nThat destroyed their reputation among the cool antiestablishment youth, of course, but it did start getting them well-paid corporate gigs. Right up until the point where Kaylan became sick at his own hypocrisy at playing these events, drank too much of the complimentary champagne at an event for the president of US Steel, went into a drunken rant about how sick the audience made him, and then about how his bandmates were a bunch of sellouts, threw his mic into a swimming pool, and quit while still on stage.\n\nHe was out of the band for two months, during which time they worked on new material without him, before they made up and decided to work on a new album. This new album, though, was going to be more democratic. As well as being all original material, they weren't having any of this nonsense about the lead singer singing lead. This time, whoever wrote the song was going to sing lead, so Kaylan only ended up singing lead on six of the twelve songs on what turned out to be their final album, Turtle Soup.\n\nThey wanted a truly great producer for the new album, and they all made lists of who they might call. The lists included a few big names like George Martin and Phil Spector, but one name kept turning up -- Ray Davies. As we'll hear in the next episode, the Kinks had been making some astonishing music since \"You Really Got Me\", but most of it had not been heard in the US. But the Turtles all loved the Kinks' 1968 album The Kinks Are The Village Green Preservation Society, which they considered the best album ever made:\n\n[Excerpt: The Kinks, \"Animal Farm\"]\n\nThey got in touch with Davies, and he agreed to produce the album -- the first time he did any serious outside production work -- and eventually they were able to persuade White Whale, who had no idea who he was, to allow him to produce it. The resulting album is by far the group's strongest album-length work, though there were problems -- Davies' original mix of the album was dominated by the orchestral parts written by Wrecking Crew musician Ray Pohlman, while the group thought that their own instruments should be more audible, since they were trying to prove that they were a proper band. They remixed it themselves, annoying Davies, though reissues since the eighties have reverted to a mix closer to Davies' intentions.\n\nSome of the music, like Pons' \"Dance This Dance With Me\", perhaps has the group trying a little *too* hard to sound like the Kinks:\n\n[Excerpt: The Turtles, \"Dance This Dance With Me\"]\n\nBut on the other hand, Kaylan's \"You Don't Have to Walk in the Rain\" is the group's last great pop single, and has one of the best lines of any single from the sixties -- \"I look at your face, I love you anyway\":\n\n[Excerpt: The Turtles, \"You Don't Have to Walk in the Rain\"]\n\nBut the album produced no hits, and the group were getting more and more problems from their label. White Whale tried to get Volman and Kaylan to go to Memphis without the other band members to record with Chips Moman, but they refused -- the Turtles were a band, and they were proud of not having session players play their parts on the records. Instead, they started work with Jerry Yester producing on a new album, to be called Shell Shock.\n\nThey did, though bow to pressure and record a terrible country track called \"Who Would Ever Think That I Would Marry Margaret\" backed by session players, at White Whale's insistence, but managed to persuade the label not to release it.\n\nThey audited White Whale and discovered that in the first six months of 1969 alone -- a period where they hadn't sold that many records -- they'd been underpaid by a staggering six hundred and fifty thousand dollars.\n\nThey sued the label for several million, and in retaliation, the label locked them out of the recording studio, locking their equipment in there. They basically begged White Whale to let them record one last great single, one last throw of the dice.\n\nJim Pons had, for years, known a keyboard player named Bob Harris, and had recently got to know Harris' wife, Judee Sill. Sill had a troubled life -- she was a heroin addict, and had at times turned to streetwalking to earn money, and had spent time in prison for armed robbery -- but she was also an astonishing songwriter, whose music was as inspired by Bach as by any pop or folk composer.\n\nSill had been signed to Blimp, the Turtles' new production and publishing company, and Pons was co-producing some tracks on her first album, with Graham Nash producing others. Pons thought one song from that album, \"Lady-O\", would be perfect for the Turtles:\n\n[Excerpt: Judee Sill, \"Lady-O\"]\n\n(music continues under) The Turtles stuck closely to Sill's vision of the song. So closely that you haven't noticed that before I started talking, we'd already switched from Sill's record to the Turtles' version.\n\n[Excerpt: The Turtles, \"Lady-O\"]\n\nThat track, with Sill on guitar backing Kaylan, Volman, and Nichol's vocals, was the last Turtles single to be released while the band were together. Despite “Lady O” being as gorgeous a melody as has ever been produced in the rock world, it sank without trace, as did a single from the Shell Shock sessions released under a pseudonym, The Dedications.\n\nWhite Whale followed that up, to the group's disgust, with \"Who Would Ever Think That I Would Marry Margaret?\", and then started putting out whatever they had in the vaults, trying to get the last few pennies, even releasing their 1965 album track version of \"Eve of Destruction\" as if it were a new single.\n\nThe band were even more disgusted when they discovered that, thanks to the flurry of suits and countersuits, they not only could no longer perform as the Turtles, but White Whale were laying legal claim to their own names. They couldn't perform under those names -- Howard Kaylan, Mark Volman, and the rest were the intellectual property of White Whale, according to the lawyers.\n\nThe group split up, and Kaylan and Volman did some session work, including singing on a demo for a couple of new songwriters:\n\n[Excerpt: Steely Dan, \"Everyone's Gone to the Movies\"]\n\nWhen that demo got the songwriters a contract, one of them actually phoned up to see if Kaylan wanted a permanent job in their new band, but they didn't want Volman as well, so Kaylan refused, and Steely Dan had to do without him.\n\nVolman and Kaylan were despondent, washed-up, has-been ex-rock stars. But when they went to see a gig by their old friend Frank Zappa, it turned out that he was looking for exactly that. Of course, they couldn't use their own names, but the story of the Phlorescent Leech and Eddie is a story for another time...",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and fifty-four of A History of Rock Music in Five Hundred Songs is the last of our four-part mini-series on LA sunshine pop and folk-rock in summer 1967. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, on \"Baby, Now That I've Found You\" by the Foundations.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nThere is no Mixcloud this week, because there were too many Turtles songs in the episode.\n\nThere's relatively little information available about the Turtles compared to other bands of their era, and so apart from the sources on the general LA scene referenced in all these podcasts, the information here comes from a small number of sources.\n\nThis DVD is a decent short documentary on the band's career.\n\nHoward Kaylan's autobiography, Shell Shocked: My Life with the Turtles, Flo and Eddie, and Frank Zappa, Etc.,  is a fun read, if inevitably biased towards his own viewpoint. Jim Pons' Hard Core Love: Sex, Football, and Rock and Roll in the Kingdom of God is much less fun, being as it is largely organised around how his life led up to his latter-day religious beliefs, but is the only other book I'm aware of with a substantial amount of coverage of the Turtles.\n\nThere are many compilations of the Turtles' material available, of which All The Singles is by far and away the best. The box set of all their albums with bonus tracks is now out of print on CD, but can still be bought as MP3s.\n\nErrata\n\nI say that the clarinet and saxophone have the same fingerings. This is not strictly true -- they have very, very, similar fingerings, and the same when you're just starting out on both instruments, but the clarinet has a wider range and overblows at a perfect twelfth rather than an octave. For a beginner, as Volman and Kaylan were, they're the same though.\n\nAlso, for the first day or so it was uploaded, this episode included an excerpt of the studio version of \"Everyone's Gone to the Movies\" by Steely Dan rather than the demo version on which Volman and Kaylan sang. That has been fixed.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWe've spent a lot of time recently in the LA of summer 1967, at the point where the sunshine pop sound that was created when the surf harmonies of the Beach Boys collided with folk rock was at its apex, right before fashions changed and tight sunny pop songs with harmonies from LA became yesterday's news, and extended blues-rock improvisations from San Francisco became the latest in thing.\n\nThis episode is the last part of this four-episode sequence, and is going to be shorter than those others. In many ways this one is a bridge between this sequence and next episode, where we travel back to London, because we're saying goodbye for a while to the LA scene, and when we do return to LA it will be, for the most part, to look at music that's a lot less sunshine and a lot more shadow. So this is a brief fade-out while we sing ba-ba-ba, a three-minute pop-song of an episode, a last bit of sunshine pop before we return to longer, more complicated, stories  in two weeks' time, at which point the sun will firmly set.\n\nLike many musicians associated with LA, Howard Kaylan was born elsewhere and migrated there as a child, and he seems to have regarded his move from upstate New York to LA as essentially a move to Disneyland itself. That impression can only have been made stronger by the fact that soon after his family moved there he got his first childhood girlfriend -- who happened to be a Mouseketeer on the TV.\n\nAnd TV was how young Howard filtered most of his perceptions -- particularly TV comedy. By the age of fourteen he was th",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and fifty-four of A History of Rock Music in Five Hundred Songs is the last of our four-part mini-series on LA sunshine pop and folk-rock in summer 1967. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, on \"Baby, Now That I've Found You\" by the Foundations.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nThere is no Mixcloud this week, because there were too many Turtles songs in the episode.\n\nThere's relatively little information available about the Turtles compared to other bands of their era, and so apart from the sources on the general LA scene referenced in all these podcasts, the information here comes from a small number of sources.\n\nThis DVD is a decent s",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}