{
  "feedburner:origLink": "https://www.brookings.edu/blog/fixgov/2022/11/04/last-minute-messaging-for-the-midterms/",
  "title": "Last minute messaging for the midterms",
  "link": "http://webfeeds.brookings.edu/~/718540630/0/brookingsrss/topfeeds/latestfrombrookings~Last-minute-messaging-for-the-midterms/",
  "dc:creator": "Elaine Kamarck, John Hudak",
  "pubDate": "Fri, 04 Nov 2022 19:53:31 +0000",
  "guid": "https://www.brookings.edu/?p=1646615",
  "description": "As we come to the end of 2022 midterm election cycle, candidates are scrambling to engage in last minute messaging and message changes that can push them over the finish line. In some cases, candidates try to change or at least soften positions which served them well in the primaries in hopes of attracting just&hellip;<div class=\"fbz_enclosure\" style=\"clear:left\"><a href=\"https://www.brookings.edu/wp-content/uploads/2022/11/2022-11-03T202941Z_822582896_RC2KEX96X55A_RTRMADP_3_USA-ELECTION-GEORGIA.jpg?w=270\" title=\"View image\"><img border=\"0\" style=\"max-width:100%\" src=\"https://www.brookings.edu/wp-content/uploads/2022/11/2022-11-03T202941Z_822582896_RC2KEX96X55A_RTRMADP_3_USA-ELECTION-GEORGIA.jpg?w=270\"/></a></div>\n<div style=\"clear:both;padding-top:0.2em;\"><a title=\"Like on Facebook\" href=\"http://webfeeds.brookings.edu/_/28/718540630/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Pin it!\" href=\"http://webfeeds.brookings.edu/_/29/718540630/BrookingsRSS/topfeeds/LatestFromBrookings,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Tweet This\" href=\"http://webfeeds.brookings.edu/_/24/718540630/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/twitter20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Subscribe by email\" href=\"http://webfeeds.brookings.edu/_/19/718540630/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Subscribe by RSS\" href=\"http://webfeeds.brookings.edu/_/20/718540630/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" style=\"border:0;margin:0;padding:0;\"></a>&nbsp;&#160;</div>",
  "content:encoded": "<p>By Elaine Kamarck, John Hudak</p><p>As we come to the end of 2022 midterm election cycle, candidates are scrambling to engage in last minute messaging and message changes that can push them over the finish line. In some cases, candidates try to change or at least soften positions which served them well in the primaries in hopes of attracting just enough voters to put them over the top. This was especially so for two hot-button issues that emerged in the Republican primaries—abortion and denying the results of the 2020 election. In other cases, candidates work to ‘flip the script’ on their opponent. Here a candidate seizes on an issue typically used against their party and uses that issue against their opponent. We have seen several examples of this playing out in the 2022 midterms.</p>\n<p>During the primaries, Republican candidates almost always included anti-abortion positions on their websites, and once the Supreme Court decided the Dobbs case, some candidates went so far as to adopt a “no exceptions” stance in an effort to woo Republican primary voters. Since then, however, at least more than a dozen—13—have backed off from their earlier abortion statements or had given ambiguous answers once the general election had begun and it became clear that most voters preferred some legal abortions. Candidates, such as the Arizona Republican Senate candidate Blake Masters and North Carolina candidate for Congress Cristian Castelli, <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.politico.com/news/2022/08/30/republican-abortion-positions-midterm-elections-00054128\">either changed what their website said or erased the abortion issue from their website altogether</a>.</p>\n<p>In the spring of this year, in an interview with the Catholic station ETN, Masters compared abortion to child sacrifice. But lately he said that the Democrats were lying about his abortion stance <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.theguardian.com/us-news/2022/sep/12/republicans-soften-staunch-anti-abortion-stance\">saying</a>— “Look I support a ban on very late-term and partial birth abortion. And most Americans agree with that.”</p>\n<p>Of course, after the now-overturned <em>Roe v. Wade, </em>most states barred third-trimester abortions, and current precedent, <em>Dobbs</em>, empowers states to pass even harsher restrictions.</p>\n<p>In the post-<em>Dobbs</em> general election, many candidates have been confronted with the medical reality that abortion is sometimes necessary to save the life of the mother. They’ve also been faced with the possibility of pregnancy as a result of rape and/or incest. Not surprisingly, candidates began “clarifying” their primary election positions. The Republican gubernatorial candidate in Minnesota, Scott Jensen, has <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.cnn.com/2022/08/29/politics/republicans-shift-abortion-positions-general-election\">tried to make it clear</a> that he would support abortion in the case of rape, incest or if the life of the woman is in danger.</p>\n<p>In Iowa, Republican House candidate Zach Nunn <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.theguardian.com/us-news/2022/sep/12/republicans-soften-staunch-anti-abortion-stance\">repeats</a> the rape, incest, and life of the mother exceptions and adds “fetal abnormalities” to the list of situations where abortion should be legal. In Colorado, the Republican Senate candidate Joe O’Dea once supported a ballot measure to ban abortion that did not include exceptions for rape or incest. <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.pbs.org/newshour/politics/after-roes-demise-democrats-hit-republicans-who-profess-to-back-abortion-rights\">He now says</a> that those exceptions are essential and that he “didn’t look at all the nuances.”</p>\n<p>To the extent that Republicans are drawn into discussing abortion—they are lashing out at Democrats, <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.nytimes.com/2022/10/12/us/politics/abortion-republicans.html\">accusing them</a>, as Republican gubernatorial candidate Kari Lake of Arizona did, of advocating “abortion right up until birth.”</p>\n<p>A similar dynamic is at work among the Republican candidates who ran on a platform denying that Biden was legitimately elected. From what we can tell fewer Republican candidates have backed off their position on the 2020 election than have softened their position on abortion—an indication that Republicans feel the abortion issue could hurt them more. But of those who did, some are running in blue states like Maryland where they need to find some independent and/or Democratic votes to have even a chance. Hence Dan Cox, the Republican nominee for Governor of Maryland <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.foxnews.com/video/6314410746112\">recently affirmed</a>, on Fox News, that “Joe Biden is the president of the United States.”</p>\n<p>But others in more hotly contested states have disavowed the election deniers’ positions as well. Herschel Walker, the Republican nominee for Senate in Georgia, <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.foxnews.com/video/6314410746112\">told the public in a debate</a> “President Biden won, and Senator Warnock won and that’s why I decided to run.”</p>\n<p>Beyond softening or changing positions on hot-button issues, another tactic employed by a handful of candidates involves using a potentially vulnerable position against an opponent. For example, in this election cycle, Republicans are slamming Democrats on issues like inflation, immigration, and crime rates/’defund the police’. Democrats are hitting Republicans on issues like abortion, the differences in job creation between President Trump and President Biden, and election denialism. In these midterms, these have become standard, widespread, and entrenched attack lines.</p>\n<p>However, not every Democrat or Republican are equally vulnerable to these attacks, and in some cases, candidates are vulnerable to attack on the issues their party generally looks “strong” on. It takes some creative messaging and advertising, but a number of candidates have cut some effective ads that ‘flip the script.’</p>\n<p>Take the incumbent Democratic governor of Nevada, Steve Sisolak. In another setting he might have been attacked for crime rates in the state’s most populated county Clark, which houses Las Vegas, and for cuts that happened to some divisions of law enforcement in that county. However, Sisolak’s Republican opponent is the Clark County Sheriff, Joe Lombardo, who serves as the head of law enforcement for Clark County as well as the head of the Las Vegas Metropolitan Police Department. As a result, Sisolak has <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.facebook.com/watch/?v=318434987095537\">run ads arguing that crime rose under Lombardo’s watch and that he supports ‘defunding the police.’</a> While fact checks have noted that the positions that were eliminated under Lombardo’s watch were civilian and that reductions in officers have come because of difficulties in recruiting, the ad uses a traditional Democratic vulnerability and works to make the Republican vulnerable on the issue.</p>\n<p>Those efforts do not stop with Nevada’s gubernatorial race. Democrats have painted their Republican opponents as wanting to defund the police in the New Mexico governor’s race and the Ohio Senate race. Democrats have attacked their GOP rivals on being soft on crime in the Ohio governor’s race and the congressional race for Ohio’s 9<sup>th</sup> district.</p>\n<p>In the race for Congress in California’s 39<sup>th</sup> district, incumbent Republican Young Kim’s anti-abortion stance is being used by her Democratic opponent, Asif Mahmood, to <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.youtube.com/watch?v=VgWpwHwNqKk\">claim she supports government overreach</a>. That argument flips the script, as Republicans usually market themselves as the party that supports individual freedoms and small government.</p>\n<p>However, script flipping is not simply the domain of Democrats this cycle. Also, in the race for Congress in OH-09, Republican challenger J.R. Majewski is attacking Democratic incumbent Marcy Kaptur over inflation, which fits nicely into the traditional 2022 Republican attack line. However, Majewski’s framing flips the script, <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.facebook.com/watch/?v=601253908298707\">highlighting his own role as a union representative</a> who has negotiated pay raises for union members, suggesting that Kaptur’s record on the economy specifically hurts unions. As the historically, pro-union party, Democrats are typically buffered from such attacks, and Majewski’s effort to cut into Kaptur’s northern Ohio/Toledo union member base is strategic.</p>\n<p>Ultimately, many elections are unpredictable affairs, and the 2022 midterms are no different. As candidates scramble for an advantage, changes in messaging can serve as real advantages for some candidates. In other circumstances, message changes can be viewed as insincere politicking (‘flip-flopping’ c. 2004) and can be used as the basis for a political attack by one’s opponent. The 2022 election cycle offers multiple examples of candidates from across the country trying to turn their opponents’ words against them, and next Tuesday, we will have a better idea who among them will be successful.</p>\n<Img align=\"left\" border=\"0\" height=\"1\" width=\"1\" alt=\"\" style=\"border:0;float:left;margin:0;padding:0;width:1px!important;height:1px!important;\" hspace=\"0\" src=\"http://webfeeds.brookings.edu/~/i/718540630/0/brookingsrss/topfeeds/latestfrombrookings\">\n<div class=\"fbz_enclosure\" style=\"clear:left\"><a href=\"https://www.brookings.edu/wp-content/uploads/2022/11/2022-11-03T202941Z_822582896_RC2KEX96X55A_RTRMADP_3_USA-ELECTION-GEORGIA.jpg?w=270\" title=\"View image\"><img border=\"0\" style=\"max-width:100%\" src=\"https://www.brookings.edu/wp-content/uploads/2022/11/2022-11-03T202941Z_822582896_RC2KEX96X55A_RTRMADP_3_USA-ELECTION-GEORGIA.jpg?w=270\"/></a></div>\n<div style=\"clear:both;padding-top:0.2em;\"><a title=\"Like on Facebook\" href=\"http://webfeeds.brookings.edu/_/28/718540630/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Pin it!\" href=\"http://webfeeds.brookings.edu/_/29/718540630/BrookingsRSS/topfeeds/LatestFromBrookings,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Tweet This\" href=\"http://webfeeds.brookings.edu/_/24/718540630/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/twitter20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Subscribe by email\" href=\"http://webfeeds.brookings.edu/_/19/718540630/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Subscribe by RSS\" href=\"http://webfeeds.brookings.edu/_/20/718540630/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" style=\"border:0;margin:0;padding:0;\"></a>&nbsp;&#160;</div>",
  "enclosure": "",
  "atom:category": ""
}