{
  "itunes:episode": 91,
  "title": "Plug Me In with Mara Zepeda",
  "pubDate": "Thu, 18 Sep 2014 15:04:24 +0000",
  "link": "http://newdisrupt.org/blog/2014/9/18/plug-me-in-with-mara-zepeda-episode-91",
  "guid": "tag:soundcloud,2010:tracks/168247244",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:01:02",
  "description": "<p><a href=\"http://www.marazepeda.com/\">Mara Zepeda</a> is the co-founder and CEO of <a href=\"https://www.switchboardhq.com/\">Switchboard</a>, a site that lets you ask for what you need and offer what you have within a trusted community. It's a way to more efficiently interconnect generosity, and is sometimes described as Craigslist without the creeps. I'm used to reading personal histories that have windy roads, but Mara's can't be summarized. Suffice it to say that she's a writer, calligrapher, entrepreneur, and student of knowledge who has worked as a reporter and teacher. We recorded at her offices in Portland, at Wieden+Kennedy's <a href=\"http://www.piepdx.com\">Portland Incubator Experiment</a> (PIE).</p>\n\n<h2>Sponsors and patrons</h2>\n\n<p>This podcast is made possible through the support of sponsors and patrons.</p>\n\n<p><a href=\"http://www.99designs.com/disruptors\">99designs</a>: Have dozens of designers from the over 310,000 that are part of 99designs's network submit ideas for your logo, Web site, T-shirt, car wrap, or other design project, then pick the best and have a finished, professional result in a week or less for a flat price. Our listeners can visit <a href=\"http://www.99designs.com/disruptors\">this special destination page</a> to get a $99 Power Pack of services for free!</p>\n\n<p>Thanks also to our Patreon backers Ben Werdmuller, Bryan Clark, and GravityFish for supporting us directly.</p>\n\n<h2>Show notes</h2>\n\n<ul>\n<li><a href=\"http://www.baybucks.com/\">Bay Bucks</a>: business-to-business barter</li>\n<li><a href=\"http://www.economist.com/news/technology-quarterly/21572914-collaborative-consumption-technology-makes-it-easier-people-rent-items\">The Sharing Economy cover story</a> at <em>The Economist</em></li>\n<li>Lloyd Reynolds and then Robert Palladino <a href=\"http://www.reed.edu/calligraphy/history.html\">used calligraphy as a teaching tool</a> at Reed for the human condition</li>\n<li>Linda Stone coined the terms <a href=\"http://lindastone.net/category/email-apnea/\">email apnea</a> and <a href=\"http://lindastone.net/qa/continuous-partial-attention/\">continuous partial attention</a>.</li>\n<li><em><a href=\"http://isbn.nu/9780195019193\">A Pattern Language</a></em></li>\n<li><em><a href=\"http://isbn.nu/9781435207769\">The Long Winter</a></em> by Laura Ingalls Wilder</li>\n</ul>\n",
  "itunes:subtitle": "Mara Zepeda is the co-founder and CEO of Switchboard, a site that lets you ask for what you need and offer what you have within a trusted community.",
  "itunes:summary": "Mara Zepeda is the co-founder and CEO of Switchboard, a site that lets you ask for what you need and offer what you have within a trusted community. It's a way to more efficiently interconnect generosity, and is sometimes described as Craigslist without the creeps. I'm used to reading personal histories that have windy roads, but Mara's can't be summarized. Suffice it to say that she's a writer, calligrapher, entrepreneur, and student of knowledge who has worked as a reporter and teacher. We're at her offices in Portland, at Wieden+Kennedy's Portland Incubator Experiment.\n\nSponsors and patrons\n\nThis podcast is made possible through the support of sponsors and patrons.\n\n99designs: Have dozens of designers from the over 310,000 that are part of 99designs's network submit ideas for your logo, Web site, T-shirt, car wrap, or other design project, then pick the best and have a finished, professional result in a week or less for a flat price. Our listeners can visit 99designs.com/disruptors to get a $99 Power Pack of services for free!\n\nThanks also to our Patreon backers Ben Werdmuller, Bryan Clark, and GravityFish for supporting us directly.\n\nShow notes\n\nBay Bucks: business-to-business barter\nThe Sharing Economy cover story at The Economist\nLloyd Reynolds and then Robert Palladino used calligraphy as a teaching tool at Reed for the human condition\nLinda Stone's email apnea and partial continuous attention\nA Pattern Language\nThe Long Winter by Laura Ingalls Wilder"
}