{
  "title": "S14 Ep39: The Gray Ghost: Creepy California",
  "link": "https://audioboom.com/posts/8098591",
  "itunes:episode": 39,
  "itunes:title": "The Gray Ghost: Creepy California",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 7305,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS and The Gray Ghost: Creepy California with Nicole Strickland.<br>\n<br>\nGo aboard The Gray Ghost and face the phantoms of California with real Ghost tales.<br>\n<br>\nVisit out guests site:<br>\n<a href=\"http://www.authornicolestrickland.com/\">http://www.authornicolestrickland.com/</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.<br>\n<br>\nDigestive troubles? \tWeight gain?\tLow energy?\tAchy Joints?<br>\nIf you’ve been struggling with any of these, Dr. Steven Gundry says you’re not alone<br>\nAnd he knows the real cause! Watch the free video at <a href=\"http://totalrestore2.com\">totalrestore2.com</a> to find out more! <br>\n<br>\nGet a low, fixed rate credit card consolidation loan from Lightstream and pay off those credit card balances. You can get a loan from five thousand to a hundred thousand dollars and you could get your money as soon as the day you apply.  Visit <a href=\"http://lightstream.com/Darkness\">lightstream.com/Darkness</a> and get an additional interest rate discount and more information.",
  "itunes:summary": "BEYOND the DARKNESS and The Gray Ghost: Creepy California with Nicole Strickland.\n\nGo aboard The Gray Ghost and face the phantoms of California with real Ghost tales.\n\nVisit out guests site:\nhttp://www.authornicolestrickland.com/\n\nSupport...",
  "pubDate": "Sun, 12 May 2019 08:00:00 +0000",
  "guid": "481a9c6b-bcea-479b-b0f5-c40bc8863a9d",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}