{
  "title": "Episode 65: God and Self Help, Synchronicity, and Listener Feedback",
  "pubDate": "Wed, 30 Jul 2008 21:14:18 +0000",
  "guid": "episode-65-odds-and-ends-and-listener-feedback",
  "link": "http://www.thepsychfiles.com/2008/07/30/episode-65-god-and-self-help-synchronicity-and-listener-feedback/",
  "itunes:image": "",
  "description": "Some of the most popular self help books such as the Power of Positive Thinking and A Course in Miracles rely on references to god and religion. In this episode I add a few thoughts to the previous episode on how scientists view self help books which rely on references to god.  I also share emails listeners send to me and I let you know how I will be adjusting The Psych Files podcast in response to your feedback.",
  "content:encoded": "Some of the most popular self help books such as the Power of Positive Thinking and A Course in Miracles rely on references to god and religion. In this episode I add a few thoughts to the previous episode on how scientists view self help books which rely on references to god.  I also share emails listeners send to me and I let you know how I will be adjusting The Psych Files podcast in response to your feedback.",
  "enclosure": "",
  "itunes:duration": "29:45",
  "itunes:explicit": false,
  "itunes:keywords": "help,self,selfhelp,movement,Esteem",
  "itunes:subtitle": "Some of the most popular self help books rely on references to god and religion. In this episode I add a few thoughts on how scientists view self help books which rely on references to god. I also share listener email.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Some of the most popular self help books such as the Power of Positive Thinking and A Course in Miracles rely on references to god and religion. In this episode I add a few thoughts to the previous episode on how scientists view self help books which rely on references to god. I also share emails listeners send to me and I let you know how I will be adjusting The Psych Files podcast in response to your feedback."
}