{
  "title": "Classical Economics and the New Poor Law with Gregory Clark",
  "pubDate": "Fri, 18 Jan 2019 19:00:07 +0000",
  "guid": "e4f20da6153a42a998bfdcd49caee005",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP114Clark_EDR.mp3",
  "itunes:image": "",
  "description": "<p>Today's guest is economic historian Gregory Clark, and our topic is England's New Poor Law of 1834. Gregory and his co-author, Marianne E. Page, wrote a paper on the topic entitled <a href= \"https://link.springer.com/article/10.1007%2Fs11698-018-0174-4\" target=\"_blank\" rel=\"noopener\">\"Welfare reform, 1834: Did the New Poor Law in England produce significant economic gains?\"</a> Spoiler alert: It didn't.</p> <blockquote>The English Old Poor Law, which before 1834 provided welfare to the elderly, children, the improvident, and the unfortunate, was a <em>bête noire</em> of the new discipline of Political Economy. Smith, Bentham, Malthus, and Ricardo all claimed it created significant social costs and increased rather than reduced poverty. The <em>Poor Law Amendment Act</em> of 1834, drafted by Political Economists, cuts payments sharply. Because local rules on eligibility and provision varied greatly before the 1834 reform, we can estimate the social costs of the extensive welfare provision of the Old Poor Law. Surprisingly there is no evidence of any of the alleged social costs that prompted the harsh treatment of the poor after 1834. Political economy, it seems, was born in sin.</blockquote> <hr /> <p> </p>",
  "content:encoded": "<p>Today's guest is economic historian Gregory Clark, and our topic is England's New Poor Law of 1834. Gregory and his co-author, Marianne E. Page, wrote a paper on the topic entitled <a href= \"https://link.springer.com/article/10.1007%2Fs11698-018-0174-4\" target=\"_blank\" rel=\"noopener\">\"Welfare reform, 1834: Did the New Poor Law in England produce significant economic gains?\"</a> Spoiler alert: It didn't.</p> The English Old Poor Law, which before 1834 provided welfare to the elderly, children, the improvident, and the unfortunate, was a <em>bête noire</em> of the new discipline of Political Economy. Smith, Bentham, Malthus, and Ricardo all claimed it created significant social costs and increased rather than reduced poverty. The <em>Poor Law Amendment Act</em> of 1834, drafted by Political Economists, cuts payments sharply. Because local rules on eligibility and provision varied greatly before the 1834 reform, we can estimate the social costs of the extensive welfare provision of the Old Poor Law. Surprisingly there is no evidence of any of the alleged social costs that prompted the harsh treatment of the poor after 1834. Political economy, it seems, was born in sin.  <p> </p>",
  "enclosure": "",
  "itunes:duration": "54:19",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's guest is economic historian Gregory Clark, and our topic is England's New Poor Law of 1834. Gregory and his co-author, Marianne E. Page, wrote a paper on the topic entitled  Spoiler alert: It didn't. The English Old Poor Law, which before 1834...",
  "itunes:episode": 114,
  "itunes:episodeType": "full"
}