{
  "title": "Brandt v. Rutledge: What to Know About the Arkansas Trial on Gender-Affirming Care",
  "link": "https://www.aclu.org/news/lgbtq-rights/brandt-v-rutledge-what-to-know-about-the-arkansas-trial",
  "pubDate": "Fri, 21 Oct 2022 16:53:53 +0000",
  "dc:creator": "Gillian Branstetter",
  "category": [
    "LGBTQ Rights",
    "LGBTQ Parenting",
    "LGBTQ Youth",
    "Discriminatory Treatment of Transgender Parents",
    "Trans and Gender-Nonconforming Youth",
    "Transgender People and Discrimination",
    "Transgender People and Health Care",
    "Transgender Rights"
  ],
  "guid": "https://www.aclu.org/news/lgbtq-rights/brandt-v-rutledge-what-to-know-about-the-arkansas-trial",
  "description": "<p>Among the many responsibilities that come with raising a child, standing in a federal courtroom and defending your child’s constitutional rights isn’t likely what most parents plan for. But in a federal courthouse in Little Rock this week, a historic trial against Arkansas’ ban on gender-affirming care brought four families together to defend the rights and well-being of their transgender adolescent children.</p>\n<p>The first in a two-part trial, the week-long hearing in <a href=\"https://www.aclu.org/cases/brandt-et-al-v-rutledge-et-al\"><em>Brandt v. Rutledge</em></a> focused first on the safety and efficacy of gender-affirming health care: an individualized, evidence-based approach to reducing gender dysphoria that can include counseling, hormone therapy, and, in some more exceptional cases for adolescents, top surgery. Experts with decades of research and practice told the court about widely accepted treatment protocols that are supported across the medical community — including by endocrinologists, pediatricians, general practitioners, and bioethicists, among others.</p>\n<div class=\"wp-donate mb-md wp-link\">  <a href=\"https://www.aclu.org/cases/brandt-et-al-v-rutledge-et-al\" class=\"wp-link mb-md\">\n          <div class=\"mb-md\">\n        <img width=\"1221\" height=\"1232\" src=\"https://www.aclu.org/wp-content/uploads/2021/07/fd7579c06d01ee38a06fc851730b89db.jpg\" class=\"attachment-original size-original\" alt=\"\" loading=\"lazy\" srcset=\"https://www.aclu.org/wp-content/uploads/2021/07/fd7579c06d01ee38a06fc851730b89db.jpg 1221w, https://www.aclu.org/wp-content/uploads/2021/07/fd7579c06d01ee38a06fc851730b89db-150x150.jpg 150w, https://www.aclu.org/wp-content/uploads/2021/07/fd7579c06d01ee38a06fc851730b89db-768x775.jpg 768w, https://www.aclu.org/wp-content/uploads/2021/07/fd7579c06d01ee38a06fc851730b89db-400x404.jpg 400w, https://www.aclu.org/wp-content/uploads/2021/07/fd7579c06d01ee38a06fc851730b89db-600x605.jpg 600w, https://www.aclu.org/wp-content/uploads/2021/07/fd7579c06d01ee38a06fc851730b89db-800x807.jpg 800w, https://www.aclu.org/wp-content/uploads/2021/07/fd7579c06d01ee38a06fc851730b89db-1000x1009.jpg 1000w, https://www.aclu.org/wp-content/uploads/2021/07/fd7579c06d01ee38a06fc851730b89db-1200x1211.jpg 1200w\" sizes=\"(max-width: 1221px) 100vw, 1221px\" />      </div>\n    \n    <div class=\"wp-link__site-name\">\n              American Civil Liberties Union        \n    </div>\n\n    <div class=\"wp-link__title\">\n              Brandt et al v. Rutledge et al          </div>\n          <div class=\"wp-link__description mt-xs\">Doctors and families of transgender youth are fighting an Arkansas law that would prevent them from getting medically necessary care. </div>\n      </a>\n</div><p>The court also heard from two providers who’ve worked with transgender youth in Arkansas: Dr. Michele Hutchison and Dr. Kathleen Stambough, the former and current medical directors of the Gender Spectrum Clinic at Arkansas Children’s Hospital. In the language of professionals quite used to describing complex medical concepts to children, the doctors explained to the court the careful balance they and families strike when making decisions about a child’s medical needs related to gender dysphoria, weighing carefully the risks and benefits of treatment for each individual child’s current and future well-being.</p>\n<p>They also spoke about the impact of the law banning this widely accepted treatment. Dr. Hutchison — who testified against the bill in the Arkansas General Assembly — noted four of her own patients were hospitalized for suicide attempts shortly after the bill was introduced, and anxiety scores of patients being seen at the clinic climbed from 40 percent to 60 percent in the wake of the bill’s introduction. Even after the law was blocked by a preliminary injunction, Dr. Stambough explained that the clinic was forced to decline medically-necessary care like puberty blockers and hormone replacement therapy (HRT) in anticipation of the law potentially going into effect at some point in the future.</p>\n<p>Fundamentally, however, this trial was about the constitutional and <a href=\"https://www.aclu.org/news/lgbtq-rights/transgender-and-non-binary-leaders-tell-federal-court-trans-people-deserve-joy-at-any-age\">civil rights of the parents and transgender youth</a> impacted by Act 626, an Arkansas law banning this evidence-based medicine passed in 2021 and currently blocked by a federal injunction. Four parents — Donnie Ray Saxton, Aaron Jennen, Amanda Dennis, and Joanna Brandt — took the stand to share their experience of watching their children suffer from dysphoria, come out as transgender, and flourish with the help of medical providers who prescribed treatment the state they are proud to call home now seeks to ban.</p>\n<p>Donnie Ray Saxton, who operates a plumbing business while raising his five children, spoke about the confidence his 17-year-old transgender son Parker gained after starting testosterone treatment.</p>\n<p>“We&#8217;re a family, and we&#8217;re not a family without Parker,” Donnie told the court. “We&#8217;d have to pick up and leave if this took effect. This is home. Our small town transitioned with us.” Asked what would happen if Parker could no longer access this care, Donnie replied tersely, “I&#8217;m not going to think about that.”</p>\n<p>Aaron Jennen, a government attorney and father of 17-year-old Sabrina, described his transgender daughter as “smart, gifted, beautiful.. [she] easily has the most envied hair in the courtroom.” Sabrina, who has struggled with depression, anxiety, and a noted lack of confidence, now proudly shares selfies and “even put her name in the hat to be homecoming queen.”</p>\n<p>Denying Sabrina this care is simply not an option, said Aaron. Through tears, he stared across the courtroom at his daughter sitting in the gallery. “I promise you,” he said emphatically, “that will not happen.”</p>\n\n  <div class=\"wp-sizing-container sizing--wide\">\n      <figure class=\"wp-image mb-md\">\n\t\t  <img width=\"2000\" height=\"1217\" src=\"https://www.aclu.org/wp-content/uploads/2022/10/20221018_155138.jpg\" class=\"attachment-original size-original\" alt=\"The Brandt, Jennen, and Saxton families.\" loading=\"lazy\" srcset=\"https://www.aclu.org/wp-content/uploads/2022/10/20221018_155138.jpg 2000w, https://www.aclu.org/wp-content/uploads/2022/10/20221018_155138-768x467.jpg 768w, https://www.aclu.org/wp-content/uploads/2022/10/20221018_155138-1536x935.jpg 1536w, https://www.aclu.org/wp-content/uploads/2022/10/20221018_155138-400x243.jpg 400w, https://www.aclu.org/wp-content/uploads/2022/10/20221018_155138-600x365.jpg 600w, https://www.aclu.org/wp-content/uploads/2022/10/20221018_155138-800x487.jpg 800w, https://www.aclu.org/wp-content/uploads/2022/10/20221018_155138-1000x609.jpg 1000w, https://www.aclu.org/wp-content/uploads/2022/10/20221018_155138-1200x730.jpg 1200w, https://www.aclu.org/wp-content/uploads/2022/10/20221018_155138-1400x852.jpg 1400w, https://www.aclu.org/wp-content/uploads/2022/10/20221018_155138-1600x974.jpg 1600w\" sizes=\"(max-width: 2000px) 100vw, 2000px\" />\t\n\t\t  <figcaption class=\"wp-image__caption is-caption mt-xs\"><p>Left to right: the Brandt, Jennen, and Saxton families.</p>\n</figcaption>\n\t\n\t\t  <span class=\"wp-image__credit is-credit\"><p>Credit: Gillian Brandstetter</p>\n</span>\n\t  </figure>\n  </div>\n<p>Amanda Dennis, an advertising technology specialist and mother of <a href=\"https://www.aclu.org/bio/brooke-dennis\">10-year-old Brooke</a>, said her young transgender daughter “was one of the most incredible humans I know.” While Brooke is too young for any endocrine treatments for her gender dysphoria, she is already wary of the coming effects of puberty; she sees her older brother growing taller and his Adam’s apple becoming more prominent, and is growing more and more anxious, leaving Amanda gravely distressed her daughter may be forced to undergo her endogenous puberty with the potential irreversible changes that come with it.</p>\n<p>“I&#8217;ve always promised all of my children that we will care for you,” said Amanda. “It fills me with so much sorrow that this would happen where I live.”</p>\n<p>Joanna Brandt took the stand and spoke of her 17-year-old transgender son Dylan, who began testosterone in 2020.</p>\n<p>“His capacity for empathy for others — but more importantly for himself — has been remarkable,” said Joanna. “Dylan is the most emotionally intelligent person I know. The kid that Dylan was [before transitioning] would not be in this courtroom today. It is because of this care he is able to fight for himself.”</p>\n<p>And fight he did. Dylan Brandt <a href=\"https://twitter.com/chasestrangio/status/1583097402663133188\">took the stand</a> as the lone transgender person to testify in any of the hearings. Calmly and stoically, he told the court of his experiences with dysphoria, his family’s “right off the bat” acceptance when he came out, and the relief gender-affirming care has brought him.</p>\n<p>“The thought of going back is just not an option,” said Dylan. &#8220;We&#8217;d probably have to leave the state. I have a job, my mom has a business. I still have a year and a half of high school left. Being pushed out of the place I&#8217;ve lived my entire life is hard.”</p>\n<p>The last person called to the stand by the plaintiffs challenging this ban, Dylan was asked by ACLU attorney Chase Strangio how he would sum up the way his treatment made him feel. Leaning into the mic, he said “hopeful.”</p>\n\t\t<div class=\"rss-cta\"><div class=\"rss-cta__subtitle\">What you can do:</div><div class=\"rss-cta__title\">Take the Pledge: Support Trans Youth Now</div><a href=\"https://action.aclu.org/petition/take-pledge-support-trans-youth-now\" class=\"rss-cta__button\">Take the pledge</a></div>",
  "source": "American Civil Liberties Union"
}