{
  "title": "#440: Return To Sender (WW Gold Review, OOTP Chapter 7, 'The Ministry of Magic')",
  "link": "https://audioboom.com/posts/7407981",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4544,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>News covers Cursed Child in San Francisco and Germany</li>\n<li>Andrew and Micah are drawn to the dark side... they're Wizarding World Gold baby!</li>\n<li>We discuss the benefits and pricing of <a href=\"https://www.hypable.com/wizarding-world-gold-membership-details/\">Wizarding World Gold</a>. What would we like to see them offer in the future?</li>\n<li>Chapter-by-Chapter continues with Chapter 7 of Harry Potter and the Order of the Phoenix, The Ministry of Magic</li>\n<li>Seven World Summary: Today will be the day Perkins alerts </li>\n<li>Harry's restless night: can we sympathize?</li>\n<li>Name drop! Rufus Scrimgeour is suspicious of Kingsley and Tonks!</li>\n<li>Mr. Weasley can't contain his excitement in the Muggle world! What technology would fascinate Arthur in 2019?</li>\n<li>The secret behind the Ministry's Muggle visitor entrance</li>\n<li>Micah calls BS on the Fountain of Magical Brethren!</li>\n<li>Eric works at the Ministry! What other host names have appeared in the Potter series?</li>\n<li>Which Ministry department which would like to know more about?</li>\n<li>What's up with these underground windows?</li>\n<li>Ha! Kingsley is in charge of the hunt for Sirius Black!</li>\n<li>Regurgitating toilets, The Quibbler, Broderick Bode and more</li>\n<li>The Umbridge suck count grows! The Ministry has changed the time and location of Harry's hearing!</li>\n<li>Connecting The Threads, MVP of the Week, Rename the Chapter</li>\n<li>Quizzitch: What is Cornelius Fudge's middle name?</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Become a member of our community</a> today on Patreon and receive awesome, magical benefits!</li>\n<li>This week's episode is sponsored by <a href=\"http://www.thirdlove.com/mugglecast\">ThirdLove</a> (Get 15% off your first perfect bra today!), <a href=\"http://www.bombas.com/mugglecast\">Bombas</a> (Save 20% on your first pair) and <a href=\"http://www.hellofresh.com/mugglecast80\">Hello Fresh</a> (Get your first 8 meals free)!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Mon, 28 Oct 2019 13:50:52 +0000",
  "guid": "tag:audioboom.com,2019-10-28:/posts/7407981",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}