{
  "title": "BONUS - Responding to Gun Violence With Effective and Fair Solutions",
  "itunes:title": "BONUS - Responding to Gun Violence With Effective and Fair Solutions",
  "pubDate": "Thu, 23 Jun 2022 10:00:00 +0000",
  "guid": "fd696655-54df-4d88-a1c1-005064b1ba94",
  "link": "https://johnshopkinssph.libsyn.com/bonus-responding-to-gun-violence-with-effective-and-fair-solutions",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Johns Hopkins University hosted a live, virtual briefing earlier this month on responses to the crisis of gun violence featuring a panel of experts, including</span> <strong>Cass Crifasi, Shannon Fratteroli, Josh Horwitz, Odis Johnson, and Daniel Webster</strong><span style= \"font-weight: 400;\">. Moderated by</span> <strong>Lainie Rutkow</strong><span style=\"font-weight: 400;\">, the discussion focuses on the challenges gun violence poses for American democracy, which gun laws are effective, how Extreme Risk Protection Orders can help to prevent gun violence, research on public opinions about solutions, and measures to promote student safety and health in a time of rising gun violence.</span></p>",
  "content:encoded": "<p>Johns Hopkins University hosted a live, virtual briefing earlier this month on responses to the crisis of gun violence featuring a panel of experts, including Cass Crifasi, Shannon Fratteroli, Josh Horwitz, Odis Johnson, and Daniel Webster. Moderated by Lainie Rutkow, the discussion focuses on the challenges gun violence poses for American democracy, which gun laws are effective, how Extreme Risk Protection Orders can help to prevent gun violence, research on public opinions about solutions, and measures to promote student safety and health in a time of rising gun violence.</p>",
  "enclosure": "",
  "itunes:duration": "58:00",
  "itunes:explicit": false,
  "itunes:keywords": "guns,law,Safety,violence,Crisis,weapon",
  "itunes:subtitle": "Johns Hopkins University hosted a live, virtual briefing earlier this month on responses to the crisis of gun violence featuring a panel of experts, including Cass Crifasi, Shannon Fratteroli, Josh Horwitz, Odis Johnson, and Daniel Webster. Moderated...",
  "itunes:season": 6,
  "itunes:episodeType": "bonus",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}