{
  "title": "Defining Kevin Hart | The standup comic turned media mogul on the power of authenticity and the missteps that made him a better man",
  "pubDate": "Sun, 30 Jun 2019 15:36:40 +0000",
  "guid": "39eaf0f5e4ed4367b7def7c48a4d1e25",
  "link": "https://tonyrobbins.libsyn.com/defining-kevin-hart-the-standup-comic-turned-media-mogul-on-the-power-of-authenticity-and-the-missteps-that-made-him-a-better-man",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Comedian. Actor. Writer. Author. Producer. Network owner. Those are just a few titles that Kevin Hart has on his resume, but his aspirations don’t stop there. By the time he’s 45, Kevin plans to add</span> <em><span style= \"font-weight: 400;\">business mogul</span></em> <span style= \"font-weight: 400;\">to his growing list of accomplishments, joining other entertainers like Oprah Winfrey and Lebron James. </span></p> <p><span style=\"font-weight: 400;\">Perhaps what sets Kevin apart from other comedians and actors is that he is more than just an entertainer for hire. He’s gone from being a cog in the Hollywood machine – to</span> <em><span style= \"font-weight: 400;\">being</span></em> <span style= \"font-weight: 400;\">the machine, by strategically building a media empire, inking production deals with major TV networks and film companies. </span></p> <p><span style=\"font-weight: 400;\">In this episode, Kevin shares his story of how he went from being a shoe salesman in Philadelphia, to breaking through the competitive world of show business and becoming one of the highest paid entertainers in the world. He also opens up about his own human flaws, and how he’s leveraged them to become a better man.</span></p>",
  "content:encoded": "<p>Comedian. Actor. Writer. Author. Producer. Network owner. Those are just a few titles that Kevin Hart has on his resume, but his aspirations don’t stop there. By the time he’s 45, Kevin plans to add <em>business mogul</em> to his growing list of accomplishments, joining other entertainers like Oprah Winfrey and Lebron James. </p> <p>Perhaps what sets Kevin apart from other comedians and actors is that he is more than just an entertainer for hire. He’s gone from being a cog in the Hollywood machine – to <em>being</em> the machine, by strategically building a media empire, inking production deals with major TV networks and film companies. </p> <p>In this episode, Kevin shares his story of how he went from being a shoe salesman in Philadelphia, to breaking through the competitive world of show business and becoming one of the highest paid entertainers in the world. He also opens up about his own human flaws, and how he’s leveraged them to become a better man.</p>",
  "enclosure": "",
  "itunes:duration": "55:33",
  "itunes:explicit": true,
  "itunes:keywords": "entertainment,kevin,comedy,standup,tony,Hart,robbins",
  "itunes:subtitle": "Comedian. Actor. Writer. Author. Producer. Network owner. Those are just a few titles that Kevin Hart has on his resume, but his aspirations don’t stop there. By the time he’s 45, Kevin plans to add business mogul to his growing list of...",
  "itunes:episodeType": "full"
}