{
  "id": "yt:video:Krg-8ZJZfe0",
  "yt:videoId": "Krg-8ZJZfe0",
  "yt:channelId": "UCkLHy_jxeaHTZCfGalg6QaA",
  "title": "Religious and Disability Accommodations",
  "link": "",
  "author": {
    "name": "Conn Maciel Carey LLP",
    "uri": "https://www.youtube.com/channel/UCkLHy_jxeaHTZCfGalg6QaA"
  },
  "published": "2022-04-08T16:58:02+00:00",
  "updated": "2022-07-22T10:33:47+00:00",
  "media:group": {
    "media:title": "Religious and Disability Accommodations",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Employee requests for medical and/or religious accommodations in the workplace are not new. However, never before have these accommodation requests been such a hot-button topic, nor have these accommodation requests been used so frequently (and in particular, religious accommodation requests). The imposition of COVID-19 vaccine mandates has changed that, particularly with regard to religious accommodation requests, which has become the ultimate “gray area,” as both employers and employees alike have learned that sincerely held religious belief can include an employee's religious-based objection to vaccinations. As a result, the Equal Employment Opportunity Commission (“EEOC”) has issued guidance regarding the obligations of employers under Title VII when an employee presents with a religious objection to a mandatory COVID-19 vaccination policy, which actually builds upon prior EEOC guidance regarding COVID-19 vaccinations in the employment context. Thus, there are multiple issues that employers need to keep in mind and juggle when addressing these vaccination accommodation requests.\n\nParticipants in this webinar learned how to best deal with such requests by their employees, including:\n\n• Tips for determining whether an employee has a sincerely held religious belief under Title VII or a disability under the ADA;\n• How to legitimately assess whether the proposed accommodation poses a direct threat to your organization;\n• Factors to understand as to whether the accommodation would be considered an “undue hardship;”\n• Reminders on how to initiate and participate in the interactive process;\n• Analysis of most recent EEOC guidance on this topic.\n\nA webinar from Conn Maciel Carey LLP.\n\nUse of this video does not in any manner constitute or establish an attorney-client relationship between Conn Maciel Carey and the viewer. This video may be deemed \"attorney advertising\" in jurisdictions from which it is accessed. The decision to hire a lawyer is a serious one and should be undertaken after consideration of all relevant information, not only information on this video.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}