{
  "title": "Episode 109: &#8220;Blowin&#8217; in the Wind&#8221; by Peter, Paul, and Mary",
  "link": "https://500songs.com/podcast/episode-109-blowin-in-the-wind-by-peter-paul-and-mary-2/",
  "pubDate": "Wed, 23 Dec 2020 19:17:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=327",
  "description": "Episode one hundred and nine of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Blowin' in the Wind\", Peter, Paul and Mary, Bob Dylan, the UK folk scene and the civil rights movement. Those of you who get angry at me whenever I say anything that acknowledges the existence of racism may want to skip this one. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"<a href=\"https://www.patreon.com/posts/45363861\">Santa Claus is Coming to Town\" by the Crystals</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-blowin-in-the-wind/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\n<a href=\"https://amzn.to/3piMasz\">This compilation </a>contains all Peter, Paul and Mary's hits.\n\nI have used *many* books for this episode, most of which I will also be using for future episodes on Dylan:\n\n<a href=\"https://amzn.to/3bMlkDu\">The Mayor of MacDougal Street by Dave Van Ronk and Elijah Wald</a> is the fascinating and funny autobiography of Dylan's mentor in his Greenwich Village period, including his interactions with Albert Grossman.\n\n<a href=\"https://amzn.to/3bHUnRs\">Chronicles Volume 1 by Bob Dylan</a>&nbsp;is a partial, highly inaccurate, but thoroughly readable autobiography.\n\n<a href=\"https://amzn.to/2ZovBkl\">Bob Dylan: All The Songs by Phillipe Margotin and Jean-Michel Guesdon</a>&nbsp;is a song-by-song look at every song Dylan ever wrote, as is&nbsp;<a href=\"https://amzn.to/3k7ct2a\">Revolution in the Air,</a>&nbsp;by Clinton Heylin.\n\nHeylin also wrote the most comprehensive and accurate biography of Dylan,&nbsp;<a href=\"https://amzn.to/35tC1mp\">Behind the Shades</a>.\n\nI've also used&nbsp;<a href=\"https://amzn.to/35iNB3A\">Robert Shelton's No Direction Home</a>, which is less accurate, but which is written by someone who knew Dylan.\n\n<a href=\"https://amzn.to/2Kpzv8C\">Only one book </a>exists on Peter, Paul, and Mary themselves, and it is a hideously overpriced coffee table book consisting mostly of photos, so I wouldn't bother with it.\n\n<a href=\"https://amzn.to/2GNAM63\"><em>Roots, Radicals, and Rockers: How Skiffle Changed the World</em> by Billy Bragg</a> has some great information on the British folk scene of the fifties and sixties.\n\nAnd&nbsp;<a href=\"https://amzn.to/3rnFJq3\"><em>Singing From the Floor</em> </a>is an oral history of British folk clubs, including a chapter on Dylan's 1962 visit to London.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're going to look at the first manufactured pop band we will see in this story, but not the last -- a group cynically put together by a manager to try and cash in on a fad, but one who were important enough that in a small way they helped to change history. We're going to look at the March on Washington and the civil rights movement, at Bob Dylan blossoming into a songwriter and the English folk revival, and at \"Blowin' in the Wind\" by Peter, Paul, and Mary:\n\n[Excerpt: Peter, Paul and Mary, \"Blowin' in the Wind\"]\n\nAlbert Grossman was an unusual figure in the world of folk music. The folk revival had started out as an idealistic movement, mostly centred on Pete Seeger, and outside a few ultra-commercial acts like the Kingston Trio, most of the people involved were either doing it for the love of the music, or as a means of advancing their political goals. No doubt many of the performers on the burgeoning folk circuit were also quite keen to make money -- there are very few musicians who don't like being able to eat and have a home to live in -- but very few of the people involved were primarily motivated by increasing their income.\n\nGrossman was a different matter. He was a businessman, and he was interested in money more than anything else -- and for that he was despised by many of the people in the Greenwich Village folk scene. But he was, nonetheless, someone who was interested in making money *from folk music* specifically. And in the late fifties and early sixties this was less of a strange idea than it might have seemed.\n\nWe talked back in the episode on \"Drugstore Rock and Roll\" about how rock and roll music was starting to be seen as the music of the teenager, and how \"teenager\" was, for the first time, becoming a marketing category into which people could be segmented.\n\nBut the thing about music that's aimed at a particular age group is that once you're out of that age group you are no longer the target audience for that music. Someone who was sixteen in 1956 was twenty in 1960, and people in their twenties don't necessarily want to be listening to music aimed at teenagers. But at the same time, those people didn't want to listen to the music that their parents were listening to. &nbsp;There's no switch that gets flipped on your twentieth birthday that means that you suddenly no longer like Little Richard but instead like Rosemary Clooney.\n\nSo there was a gap in the market, for music that was more adult than rock and roll was perceived as being, but which still set itself apart from the pop music that was listened to by people in their thirties and forties.\n\nAnd in the late fifties and early sixties, that gap seemed to be filled by a commercialised version of the folk revival.\n\nIn particular, Harry Belafonte had a huge run of massive hit albums with collections of folk, calypso, and blues songs, presented in a way that was acceptable to an older, more settled audience while still preserving some of the rawness of the originals, like his version of Lead Belly's \"Midnight Special\", recorded in 1962 with a young Bob Dylan on harmonica:\n\n[Excerpt: Harry Belafonte, \"Midnight Special\"]\n\nMeanwhile, the Kingston Trio had been having huge hits with cleaned-up versions of old folk ballads like \"Tom Dooley\":\n\n[Excerpt: The Kingston Trio, \"Tom Dooley\"]\n\nSo Grossman believed that there was a real market out there for something that was as clean and bright and friendly as the Kingston Trio, but with just a tiny hint of the bohemian Greenwich Village atmosphere to go with it. Something that wouldn't scare TV people and DJs, but which might seem just the tiniest bit more radical than the Kingston Trio did. Something mass-produced, but which seemed more authentic.\n\nSo Grossman decided to put together what we would now call a manufactured pop group. It would be a bit like the Kingston Trio, but ever so slightly more political, and rather than being three men, it would be two men and a woman.\n\nGrossman had very particular ideas about what he wanted -- he wanted a waifish, beautiful woman at the centre of the group, he wanted a man who brought a sense of folk authenticity, and he wanted someone who could add a comedy element to the performances, to lighten them.\n\nFor the woman, he chose Mary Travers, who had been around the folk scene for several years at this point, starting out with a group called the Song Swappers, who had recorded an album of union songs with Pete Seeger back in 1955:\n\n[Excerpt: Pete Seeger and the Song Swappers, \"Solidarity Forever\"]\n\nTravers was chosen in part because of her relative shyness -- she had never wanted to be a professional singer, and her introverted nature made her perfect for the image Grossman wanted -- an image that was carefully cultivated, to the point that when the group were rehearsing in Florida, Grossman insisted Travers stay inside so she wouldn't get a tan and spoil her image.\n\nAs the authentic male folk singer, Grossman chose Peter Yarrow, who was the highest profile of the three, as he had performed as a solo artist for a number of years and had appeared on TV and at the Newport Folk Festival, though he had not yet recorded. And for the comedy element, he chose Noel Stookey, who regularly performed as a comedian around Greenwich Village -- in the group's very slim autobiography, Stookey compares himself to two other comedians on that circuit, Bill Cosby and Woody Allen, comparisons that were a much better look in 2009 when the book was published than they are today.\n\nGrossman had originally wanted Dave Van Ronk to be the low harmony singer, rather than Stookey, but Van Ronk turned him down flat, wanting no part of a Greenwich Village Kingston Trio, though he later said he sometimes looked at his bank account rather wistfully.\n\nThe group's name was, apparently, inspired by a line in the old folk song \"I Was Born About 10,000 Years Ago\", which was recorded by many people, but most famously by Elvis Presley in the 1970s:\n\n[Excerpt: Elvis Presley, \"I Was Born About 10,000 Years Ago\"]\n\nThe \"Peter, Paul, and Moses\" from that song became Peter, Paul and Mary -- Stookey started going by his middle name, Paul, on stage, in order to fit the group name, though he still uses Noel in his daily life.\n\nWhile Peter, Paul, and Mary were the front people of the group, there were several other people who were involved in the creative process -- the group used a regular bass player, Bill Lee, the father of the filmmaker Spike Lee, who played on all their recordings, as well as many other recordings from Greenwich Village folk musicians. They also had, as their musical director, a man named Milt Okun who came up with their arrangements and helped them choose and shape the material.\n\nGrossman shaped this team into a formidable commercial force. Almost everyone who talks about Grossman compares him to Colonel Tom Parker, and the comparison is a reasonable one. Grossman was extremely good at making money for his acts, so long as a big chunk of the money came to him. There's a story about him signing Odetta, one of the great folk artists of the period, and telling her \"you can stay with your current manager, and make a hundred thousand dollars this year, and he'll take twenty percent, or you can come with me, and make a quarter of a million dollars, but I'll take fifty percent\".\n\nThat was the attitude that Grossman took to everyone. He cut himself in to every contract, salami-slicing his artists' royalties at each stage. But it can't be denied that his commercial instincts were sound. Peter, Paul, and Mary's first album was a huge success. The second single from the album, their version of the old Weavers song \"If I Had a Hammer\", written by Pete Seeger and Lee Hays, went to number ten on the pop charts:\n\n[Excerpt: Peter, Paul and Mary, \"If I Had a Hammer\"]\n\nAnd the album itself went to number one and eventually went double-platinum -- a remarkable feat for a collection of songs that, however prettily arranged, contained a fairly uncompromising selection of music from the folk scene, with songs by Seeger, Dave van Ronk, and Rev. Gary Davis mixing with traditional songs like \"This Train\" and originals by Stookey and Yarrow.\n\nTheir second album was less successful at first, with its first two singles flopping. But the third, a pretty children's song by Yarrow and his friend Leonard Lipton, went to number two on the pop charts and number one on the Adult Contemporary charts:\n\n[Excerpt: Peter, Paul, and Mary, \"Puff the Magic Dragon\"]\n\nIncidentally, Leonard Lipton, who wrote that lyric, became independently wealthy from the royalties from the song, and used the leisure that gave him to pursue his passion of inventing 3D projection systems, which eventually made him an even wealthier man -- if you've seen a 3D film in the cinema in the last couple of decades, it's almost certainly been using the systems Lipton invented.\n\nSo Peter, Paul, and Mary were big stars, and having big hits. And Albert Grossman was constantly on the lookout for more material for them. And eventually he found it, and the song that was to make both him, his group, and its writer, very, very rich, in the pages of Broadside magazine.\n\nWhen we left Bob Dylan, he was still primarily a performer, and not really known for his songwriting, but he had already written a handful of songs, and he was being drawn into the more political side of the folk scene. In large part this was because of his girlfriend, Suze Rotolo, with whom Dylan was very deeply in love, and who was a very political person indeed. Dylan had political views, but wasn't particularly driven by them -- Rotolo very much was, and encouraged him to write songs about politics.\n\nFor much of early 1962, Dylan was being pulled in two directions at once -- he was writing songs inspired by Robert Johnson, and trying to adapt Johnson's style to fit himself, but at the same time he was writing songs like \"The Death of Emmett Till\", about the 1955 murder of a Black teenager which had galvanised the civil rights movement, and \"The Ballad of Donald White\", about a Black man on death row.\n\nDylan would later be very dismissive of these attempts at topicality, saying \"I realize now that my reasons and motives behind it were phony, I didn’t have to write it; I was bothered by many other things that I pretended I wasn’t bothered by, in order to write this song about Emmett Till, a person I never even knew\". But at the time they got him a great deal of attention in the small US folk-music scene, when they were published in magazines like Broadside and Sing Out, which collected political songs.\n\nMost of these early songs are juvenilia, with a couple of exceptions like the rather marvellous anti-bomb song \"Let Me Die in My Footsteps\", but the song that changed everything for Dylan was a different matter.\n\n\"Blowin' in the Wind\" was inspired by the melody of the old nineteenth century song \"No More Auction Block\", a song that is often described as a \"spiritual\", though in fact it's a purely secular song about slavery:\n\n[Excerpt: Odetta, \"No More Auction Block\"]\n\nThat song had seen something of a revival in folk circles in the late fifties, especially because part of its melody had been incorporated into another song, \"We Shall Overcome\", which had become an anthem of the civil rights movement when it was revived and adapted by Pete Seeger:\n\n[Excerpt: Pete Seeger, \"We Shall Overcome\"]\n\nDylan took this melody, with its associations with the fight for the rights of Black people, and came up with new lyrics, starting with the line \"How many roads must a man walk down, before you call him a man?\" He wrote two verses of the song -- the first and last verses -- in a short burst of inspiration, and a few weeks later came back to it and added another verse, the second, which incorporated allusions to the Biblical prophet Ezekiel, and which is notably less inspired than those earlier verses.\n\nIn later decades, many people have looked at the lyrics to the song and seen it as the first of what would become a whole subgenre of non-protest protest songs -- they've seen the abstraction of \"How many roads must a man walk down before you call him a man?\" as being nice-sounding rhetoric that doesn't actually mean anything, in much the same way as something like, say, \"Another Day in Paradise\" or \"Eve of Destruction\", songs that make nonspecific complaints about nonspecific bad things.\n\nBut while \"Blowin' in the Wind\" is a song that has multiple meanings and can be applied to multiple situations, as most good songs can, that line was, at the time in which it was written, a very concrete question. The civil rights movement was asking for many things -- for the right to vote, for an end to segregation, for an end to police brutality, but also for basic respect and acknowledgment of Black people's shared humanity. We've already heard in a couple of past episodes Big Bill Broonzy singing \"When Do I Get to Be Called a Man?\":\n\n[Excerpt: Big Bill Broonzy, \"When Do I Get to Be Called a Man?\"]\n\nBecause at the time, it was normal for white people to refer to Black men as \"boy\". As Dr. Martin Luther King said in his \"Letter From Birmingham Jail\", one of the greatest pieces of writing of the twentieth century, a letter in large part about how white moderates were holding Black people back with demands to be \"reasonable\" and let things take their time:\n\n\"when you have seen hate-filled policemen curse, kick, brutalize, and even kill your black brothers and sisters with impunity; when you see the vast majority of your twenty million Negro brothers smothering in an airtight cage of poverty in the midst of an affluent society... when your first name becomes“ and here Dr. King uses a racial slur which I, as a white man, will not say, \"and your middle name becomes “boy” (however old you are) and your last name becomes “John,” and when your wife and mother are never given the respected title “Mrs.”; when you are harried by day and haunted by night by the fact that you are a Negro, living constantly at tiptoe stance, never knowing what to expect next, and plagued with inner fears and outer resentments; when you are forever fighting a degenerating sense of “nobodyness”—then you will understand why we find it difficult to wait. There comes a time when the cup of endurance runs over and men are no longer willing to be plunged into an abyss of injustice where they experience the bleakness of corroding despair.\"\n\nKing's great letter was written in 1963, less than a year after Dylan was writing his song but before it became widely known. In the context of 1962, the demand to call a man a man was a very real political issue, not an aphorism that could go in a Hallmark card.\n\nDylan recorded the song in June 1962, during the sessions for his second album, which at the time was going under the working title \"Bob Dylan's Blues\":\n\n[Excerpt: Bob Dylan, \"Blowin' in the Wind\"]\n\nBy the time he recorded it, two major changes had happened to him. The first was that Suze Rotolo had travelled to Spain for several months, leaving him bereft -- for the next few months, his songwriting took a turn towards songs about either longing for the return of a lost love, like \"Tomorrow is a Long Time\", one of his most romantic songs, or about how the protagonist doesn't even need his girlfriend anyway and she can leave if she likes, see if he cares, like \"Don't Think Twice It's Alright\".\n\nThe other change was that Albert Grossman had become his manager, largely on the strength of \"Blowin' in the Wind\", which Grossman thought had huge potential. Grossman signed Dylan up, taking twenty percent of all his earnings -- including on the contract with Columbia Records Dylan already had -- and got him signed to a new publisher, Witmark Publishing, where the aptly-named Artie Mogull thought that \"Blowin' in the Wind\" could be marketed. Grossman took his twenty percent of Dylan's share of the songwriting money as his commission from Dylan -- and fifty percent of Witmark's share of the money as his commission from Witmark, meaning that Dylan was getting forty percent of the money for writing the songs, while Grossman was getting thirty-five percent.\n\nGrossman immediately got involved in the recording of Dylan's second album, and started having personality clashes with John Hammond. It was apparently Grossman who suggested that Dylan \"go electric\" for the first time, with the late-1962 single \"Mixed-Up Confusion\":\n\n[Excerpt: Bob Dylan, \"Mixed-Up Confusion\"]\n\nNeither Hammond nor Dylan liked that record, and it seemed clear for the moment that the way forward for Dylan was to continue in an acoustic folk vein.\n\nDylan was also starting to get inspired more by English folk music, and incorporate borrowings from English music into his songwriting. That's most apparent in \"A Hard Rain's A-Gonna Fall\", written in September 1962. Dylan took the structure of that song from the old English ballad, \"Lord Randall\":\n\n[Excerpt: Ewan MacColl, \"Lord Randall\"]\n\nHe reworked that structure into a song of apocalypse, again full of the Biblical imagery he'd tried in the second verse of &nbsp;\"Blowin' in the Wind\", but this time more successfully incorporating it:\n\n[Excerpt: Bob Dylan, \"A Hard Rain's A-Gonna Fall\"]\n\nHis interest in English folk music was to become more important in his songwriting in the following months, as Dylan was about to travel to the UK and encounter the British folk music scene. A TV director called Philip Saville had seen Dylan performing in New York, and had decided he would be perfect for the role of a poet in a TV play he was putting on, Madhouse in Castle Street, and got Dylan flown over to perform in it.\n\nUnfortunately, no-one seems to have told Dylan what would be involved in this, and he proved incapable of learning his lines or acting, so the show was rethought -- the role of the poet was given to David Warner, later to become one of Britain's most famous screen actors, and Dylan was cast in a new role as a singer called \"Bobby\", who had few or no lines but did get to sing a few songs, including \"Blowin' in the Wind\", which was the first time the song was heard by anyone outside of the New York folk scene.\n\nDylan was in London for about a month, and while he was there he immersed himself in the British folk scene.\n\nThis scene was in some ways modelled on the American scene, and had some of the same people involved, but it was very different. The initial spark for the British folk revival had come in the late 1940s, when A.L. Lloyd, a member of the Communist Party, had published a book of folk songs he'd collected, along with some Marxist analysis of how folk songs evolved.\n\nIn the early fifties, Alan Lomax, then in the UK to escape McCarthyism, put Lloyd in touch with Ewan MacColl, a songwriter and performer from Manchester, who we heard earlier singing \"Lord Randall\". MacColl, like Lloyd, was a Communist, but the two also shared a passion for older folk songs, and they began recording and performing together, recording traditional songs like \"The Handsome Cabin Boy\":\n\n[Excerpt: Ewan MacColl and A.L. Lloyd, \"The Handsome Cabin Boy\"]\n\nMacColl and Lloyd latched on to the skiffle movement, and MacColl started his own club night, Ballads and Blues, which tried to push the skifflers in the direction of performing more music based in English traditional music. This had already been happening to an extent with things like the Vipers performing \"Maggie May\", a song about a sex worker in Liverpool:\n\n[Excerpt: The Vipers Skiffle Group, \"Maggie May\"]\n\nBut this started to happen a lot more with MacColl's encouragement. At one point in 1956, there was even a TV show hosted by Lomax and featuring a band that included Lomax, MacColl, Jim Bray, the bass player from Chris Barber's band, Shirley Collins -- a folk singer who was also Lomax's partner -- and Peggy Seeger, who was Pete Seeger's sister and who had also entered into a romantic relationship with MacColl, whose most famous song, \"The First Time Ever I Saw Your Face\", was written both about and for her:\n\n[Excerpt: Peggy Seeger, \"The First Time Ever I Saw Your Face\"]\n\nIt was Seeger who instigated what became the most notable feature at the Ballads and Blues club and its successor the Singer's Club. She'd burst out laughing when she saw Long John Baldry sing \"Rock Island Line\", because he was attempting to sing in an American accent. As someone who had actually known Lead Belly, she found British imitations of his singing ludicrous, and soon there was a policy at the clubs that people would only sing songs that were originally sung with their normal vowel sounds. So Seeger could only sing songs from the East Coast of the US, because she didn't have the Western vowels of a Woody Guthrie, while MacColl could sing English and Scottish songs, but nothing from Wales or Ireland.\n\nAs the skiffle craze died down, it splintered into several linked scenes. We've already seen how in Liverpool and London it spawned guitar groups like the Shadows and the Beatles, while in London it also led to the electric blues scene. It also led to a folk scene that was very linked to the blues scene at first, but was separate from it, and which was far more political, centred around MacColl. That scene, like the US one, combined topical songs about political events from a far-left viewpoint with performances of traditional songs, but in the case of the British one these were mostly old sea shanties and sailors' songs, and the ancient Child Ballads, rather than Appalachian country music -- though a lot of the songs have similar roots.\n\nAnd unlike the blues scene, the folk scene spread all over the country. There were clubs in Manchester, in Liverpool (run by the group the Spinners), in Bradford, in Hull (run by the Waterson family) and most other major British cities. The musicians who played these venues were often inspired by MacColl and Lloyd, but the younger generation of musicians often looked askance at what they saw as MacColl's dogmatic approach, preferring to just make good music rather than submit it to what they saw as MacColl's ideological purity test, even as they admired his musicianship and largely agreed with his politics.\n\nAnd one of these younger musicians was a guitarist named Martin Carthy, who was playing a club called the King and Queen on Goodge Street when he saw Bob Dylan walk in. He recognised Dylan from the cover of Sing Out! magazine, and invited him to get up on stage and do a few numbers. For the next few weeks, Carthy showed Dylan round the folk scene -- Dylan went down great at the venues where Carthy normally played, and at the Roundhouse, but flopped around the venues that were dominated by MacColl, as the people there seemed to think of Dylan as a sort of cut-rate Ramblin' Jack Elliot, as Elliot had been such a big part of the skiffle and folk scenes.\n\nCarthy also taught Dylan a number of English folk songs, including \"Lord Franklin\":\n\n[Excerpt: Martin Carthy, \"Lord Franklin\"]\n\nand \"Scarborough Fair\":\n\n[Excerpt: Martin Carthy, \"Scarborough Fair\"]\n\nDylan immediately incorporated the music he'd learned from Carthy into his songwriting, basing \"Bob Dylan's Dream\" on \"Lord Franklin\", and even more closely basing \"GIrl From the North Country\" on \"Scarborough Fair\":\n\n[Excerpt: Bob Dylan, \"Girl From The North Country\"]\n\nAfter his trip to London, Dylan went over to Europe to see if he could catch up with Suze, but she had already gone back to New York -- their letters to each other crossed in the post. On his return, they reunited at least for a while, and she posed with him for the photo for the cover of what was to be his second album.\n\nDylan had thought that album completed when he left for England, but he soon discovered that there were problems with the album -- the record label didn't want to release the comedy talking blues \"Talking John Birch Society Paranoid Blues\", because they thought it might upset the fascists in the John Birch Society. The same thing would later make sure that Dylan never played the Ed Sullivan Show, because when he was booked onto the show he insisted on playing that song, and so they cancelled the booking.\n\nIn this case, though, it gave him an excuse to remove what he saw as the weaker songs on the album, including \"Tomorrow is a Long Time\", and replace them with four new songs, three of them inspired by traditional English folk songs -- \"Bob Dylan's Dream\", &nbsp;\"Girl From the North Country\", and \"Masters of War\" which took its melody from the old folk song \"Nottamun Town\" popularised on the British folk circuit by an American singer, Jean Ritchie:\n\n[Excerpt: Jean Ritchie, \"Nottamun Town\"]\n\nThese new recordings weren't produced by John Hammond, as the rest of the album was. Albert Grossman had been trying from the start to get total control over Dylan, and didn't want Hammond, who had been around before Grossman, involved in Dylan's career. Instead, a new producer named Tom Wilson was in charge.\n\nWilson was a remarkable man, but seemed an odd fit for a left-wing folk album. He was one of the few Black producers working for a major label, though he'd started out as an indie producer. He was a Harvard economics graduate, and had been president of the Young Republicans during his time there -- he remained a conservative all his life -- but he was far from conservative in his musical tastes. When he'd left university, he'd borrowed nine hundred dollars and started his own record label, Transition, which had put out some of the best experimental jazz of the fifties, produced by Wilson, including the debut albums by Sun Ra:\n\n[Excerpt: Sun Ra, \"Brainville\"]\n\nand Cecil Taylor:\n\n[Excerpt: Cecil Taylor, \"Bemsha Swing\"]\n\nWilson later described his first impressions of Dylan: \"I didn’t even particularly like folk music. I’d been recording Sun Ra and Coltrane … I thought folk music was for the dumb guys. This guy played like the dumb guys, but then these words came out. I was flabbergasted.\"\n\nWilson would soon play a big part in Dylan's career, but for now his job was just to get those last few tracks for the album recorded.\n\nIn the end, the final recording session for Dylan's second album was more than a year after the first one, and it came out into a very different context from when he'd started recording it.\n\nBecause while Dylan was putting the finishing touches on his second album, Peter Paul and Mary were working on their third, and they were encouraged by Grossman to record three Bob Dylan songs, since that way Grossman would make more money from them. Their version of \"Blowin' in the Wind\" came out as a single a few weeks after The Freewheelin' Bob Dylan came out, and sold 300,000 copies in the first week:\n\n[Excerpt: Peter, Paul, and Mary, \"Blowin' in the Wind\"]\n\nThe record went to number two on the charts, and their followup, \"Don't Think Twice it's Alright\", another Dylan song, went top ten as well.\n\n\"Blowin' in the Wind\" became an instant standard, and was especially picked up by Black performers, as it became a civil rights anthem. Mavis Staples of the Staple Singers said later that she was astonished that a white man could write a line like \"How many roads must a man walk down before you call him a man?\", saying \"That's what my father experienced\" -- and the Staple Singers recorded it, of course:\n\n[Excerpt: The Staple Singers, \"Blowin' in the Wind\"]\n\nas did Sam Cooke:\n\n[Excerpt: Sam Cooke, \"Blowin' in the Wind\"]\n\nAnd Stevie Wonder:\n\n[Excerpt: Stevie Wonder, \"Blowin' in the Wind\"]\n\nBut the song's most important performance came from Peter, Paul and Mary, performing it on a bill with Dylan, Odetta, Joan Baez, and Mahalia Jackson in August 1963, just as the song had started to descend the charts. Because those artists were the entertainment for the March on Washington, in which more than a quarter of a million people descended on Washington both to support President Kennedy's civil rights bill and to speak out and say that it wasn't going far enough. That was one of the great moments in American political history, full of incendiary speeches like the one by John Lewis:\n\n[Excerpt: John Lewis, March on Washington speech]\n\nBut the most memorable moment at that march &nbsp;came when Dr. King was giving his speech. Mahalia Jackson shouted out \"Tell them about the dream, Martin\", and King departed from his prepared words and instead improvised based on themes he'd used in other speeches previously, coming out with some of the most famous words ever spoken:\n\n[Excerpt: Martin Luther King, \"I Have a Dream\"]\n\nThe civil rights movement was more than one moment, however inspiring, and white people like myself have a tendency to reduce it just to Dr. King, and to reduce Dr. King just to those words -- which is one reason why I quoted from Letter From Birmingham Jail earlier, as that is a much less safe and canonised piece of writing. But it's still true to say that if there is a single most important moment in the history of the post-war struggle for Black rights, it was that moment, and because of \"Blowin' in the Wind\", both Dylan and Peter, Paul and Mary were minor parts of that event.\n\nAfter 1963, Peter, Paul and Mary quickly became passe with the British Invasion, only having two more top ten hits, one with a novelty song in 1967 and one with \"Leaving on a Jet Plane\" in 1969. They split up in 1970, and around that time Yarrow was arrested and convicted for a sexual offence involving a fourteen-year-old girl, though he was later pardoned by President Carter. The group reformed in 1978 and toured the nostalgia circuit until Mary's death in 2009. The other two still occasionally perform together, as Peter and Noel Paul.\n\nBob Dylan, of course, went on to bigger things after \"Blowin' in the Wind\" suddenly made him into the voice of a generation -- a position he didn't ask for and didn't seem to want. We'll be hearing much more from him. And we'll also be hearing more about the struggle for Black civil rights, as that's a story, much like Dylan's, that continues to this day.",
  "itunes:subtitle": "Episode one hundred and nine of A History of Rock Music in Five Hundred Songs looks at Blowin in the Wind, Peter, Paul and Mary, Bob Dylan, the UK folk scene and the civil rights movement. Those of you who get angry at me whenever I say anything that ack",
  "itunes:keywords": "Alan Lomax,Albert Grossman,Big Bill Broonzy,Bob Dylan,civil rights,Ewan MacColl,folk music,jazz,John Hammond,Martin Carthy,Martin Luther King,Peggy Seeger,Pete Seeger,Peter Paul and Mary,protest songs,racism,skiffle,Suze Rotolo,The Weavers,Tom Wilson",
  "itunes:episodeType": "full",
  "itunes:episode": 109,
  "content:encoded": "Episode one hundred and nine of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Blowin' in the Wind\", Peter, Paul and Mary, Bob Dylan, the UK folk scene and the civil rights movement. Those of you who get angry at me whenever I say anything that acknowledges the existence of racism may want to skip this one. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"<a href=\"https://www.patreon.com/posts/45363861\">Santa Claus is Coming to Town\" by the Crystals</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-blowin-in-the-wind/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\n<a href=\"https://amzn.to/3piMasz\">This compilation </a>contains all Peter, Paul and Mary's hits.\n\nI have used *many* books for this episode, most of which I will also be using for future episodes on Dylan:\n\n<a href=\"https://amzn.to/3bMlkDu\">The Mayor of MacDougal Street by Dave Van Ronk and Elijah Wald</a> is the fascinating and funny autobiography of Dylan's mentor in his Greenwich Village period, including his interactions with Albert Grossman.\n\n<a href=\"https://amzn.to/3bHUnRs\">Chronicles Volume 1 by Bob Dylan</a>&nbsp;is a partial, highly inaccurate, but thoroughly readable autobiography.\n\n<a href=\"https://amzn.to/2ZovBkl\">Bob Dylan: All The Songs by Phillipe Margotin and Jean-Michel Guesdon</a>&nbsp;is a song-by-song look at every song Dylan ever wrote, as is&nbsp;<a href=\"https://amzn.to/3k7ct2a\">Revolution in the Air,</a>&nbsp;by Clinton Heylin.\n\nHeylin also wrote the most comprehensive and accurate biography of Dylan,&nbsp;<a href=\"https://amzn.to/35tC1mp\">Behind the Shades</a>.\n\nI've also used&nbsp;<a href=\"https://amzn.to/35iNB3A\">Robert Shelton's No Direction Home</a>, which is less accurate, but which is written by someone who knew Dylan.\n\n<a href=\"https://amzn.to/2Kpzv8C\">Only one book </a>exists on Peter, Paul, and Mary themselves, and it is a hideously overpriced coffee table book consisting mostly of photos, so I wouldn't bother with it.\n\n<a href=\"https://amzn.to/2GNAM63\"><em>Roots, Radicals, and Rockers: How Skiffle Changed the World</em> by Billy Bragg</a> has some great information on the British folk scene of the fifties and sixties.\n\nAnd&nbsp;<a href=\"https://amzn.to/3rnFJq3\"><em>Singing From the Floor</em> </a>is an oral history of British folk clubs, including a chapter on Dylan's 1962 visit to London.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're going to look at the first manufactured pop band we will see in this story, but not the last -- a group cynically put together by a manager to try and cash in on a fad, but one who were important enough that in a small way they helped to change history. We're going to look at the March on Washington and the civil rights movement, at Bob Dylan blossoming into a songwriter and the English folk revival, and at \"Blowin' in the Wind\" by Peter, Paul, and Mary:\n\n[Excerpt: Peter, Paul and Mary, \"Blowin' in the Wind\"]\n\nAlbert Grossman was an unusual figure in the world of folk music. The folk revival had started out as an idealistic movement, mostly centred on Pete Seeger, and outside a few ultra-commercial acts like the Kingston Trio, most of the people involved were either doing it for the love of the music, or as a means of advancing their political goals. No doubt many of the performers on the burgeoning folk circuit were also quite keen to make money -- there are very few musicians who don't like being able to eat and have a home to live in -- but very few of the people involved were primarily motivated by increasing their income.\n\nGrossman was a different matter. He was a businessman, and he was interested in money more than anything else -- and for that he was despised by many of the people in the Greenwich Village folk scene. But he was, nonetheless, someone who was interested in making money *from folk music* specifically. And in the late fifties and early sixties this was less of a strange idea than it might have seemed.\n\nWe talked back in the episode on \"Drugstore Rock and Roll\" about how rock and roll music was starting to be seen as the music of the teenager, and how \"teenager\" was, for the first time, becoming a marketing category into which people could be segmented.\n\nBut the thing about music that's aimed at a particular age group is that once you're out of that age group you are no longer the target audience for that music. Someone who was sixteen in 1956 was twenty in 1960, and people in their twenties don't necessarily want to be listening to music aimed at teenagers. But at the same time, those people didn't want to listen to the music that their parents were listening to. &nbsp;There's no switch that gets flipped on your twentieth birthday that means that you suddenly no longer like Little Richard but instead like Rosemary Clooney.\n\nSo there was a gap in the market, for music that was more adult than rock and roll was perceived as being, but which still set itself apart from the pop music that was listened to by people in their thirties and forties.\n\nAnd in the late fifties and early sixties, that gap seemed to be filled by a commercialised version of the folk revival.\n\nIn particular, Harry Belafonte had a huge run of massive hit albums with collections of folk, calypso, and blues songs, presented in a way that was acceptable to an older, more settled audience while still preserving some of the rawness of the originals, like his version of Lead Belly's \"Midnight Special\", recorded in 1962 with a young Bob Dylan on harmonica:\n\n[Excerpt: Harry Belafonte, \"Midnight Special\"]\n\nMeanwhile, the Kingston Trio had been having huge hits with cleaned-up versions of old folk ballads like \"Tom Dooley\":\n\n[Excerpt: The Kingston Trio, \"Tom Dooley\"]\n\nSo Grossman believed that there was a real market out there for something that was as clean and bright and friendly as the Kingston Trio, but with just a tiny hint of the bohemian Greenwich Village atmosphere to go with it. Something that wouldn't scare TV people and DJs, but which might seem just the tiniest bit more radical than the Kingston Trio did. Something mass-produced, but which seemed more authentic.\n\nSo Grossman decided to put together what we would now call a manufactured pop group. It would be a bit like the Kingston Trio, but ever so slightly more political, and rather than being three men, it would be two men and a woman.\n\nGrossman had very particular ideas about what he wanted -- he wanted a waifish, beautiful woman at the centre of the group, he wanted a man who brought a sense of folk authenticity, and he wanted someone who could add a comedy element to the performances, to lighten them.\n\nFor the woman, he chose Mary Travers, who had been around the folk scene for several years at this point, starting out with a group called the Song Swappers, who had recorded an album of union songs with Pete Seeger back in 1955:\n\n[Excerpt: Pete Seeger and the Song Swappers, \"Solidarity Forever\"]\n\nTravers was chosen in part because of her relative shyness -- she had never wanted to be a professional singer, and her introverted nature made her perfect for the image Grossman wanted -- an image that was carefully cultivated, to the point that when the group were rehearsing in Florida, Grossman insisted Travers stay inside so she wouldn't get a tan and spoil her image.\n\nAs the authentic male folk singer, Grossman chose Peter Yarrow, who was the highest profile of the three, as he had performed as a solo artist for a number of years and had appeared on TV and at the Newport Folk Festival, though he had not yet recorded. And for the comedy element, he chose Noel Stookey, who regularly performed as a comedian around Greenwich Village -- in the group's very slim autobiography, Stookey compares himself to two other comedians on that circuit, Bill Cosby and Woody Allen, comparisons that were a much better look in 2009 when the book was published than they are today.\n\nGrossman had originally wanted Dave Van Ronk to be the low harmony singer, rather than Stookey, but Van Ronk turned him down flat, wanting no part of a Greenwich Village Kingston Trio, though he later said he sometimes looked at his bank account rather wistfully.\n\nThe group's name was, apparently, inspired by a line in the old folk song \"I Was Born About 10,000 Years Ago\", which was recorded by many people, but most famously by Elvis Presley in the 1970s:\n\n[Excerpt: Elvis Presley, \"I Was Born About 10,000 Years Ago\"]\n\nThe \"Peter, Paul, and Moses\" from that song became Peter, Paul and Mary -- Stookey started going by his middle name, Paul, on stage, in order to fit the group name, though he still uses Noel in his daily life.\n\nWhile Peter, Paul, and Mary were the front people of the group, there were several other people who were involved in the creative process -- the group used a regular bass player, Bill Lee, the father of the filmmaker Spike Lee, who played on all their recordings, as well as many other recordings from Greenwich Village folk musicians. They also had, as their musical director, a man named Milt Okun who came up with their arrangements and helped them choose and shape the material.\n\nGrossman shaped this team into a formidable commercial force. Almost everyone who talks about Grossman compares him to Colonel Tom Parker, and the comparison is a reasonable one. Grossman was extremely good at making money for his acts, so long as a big chunk of the money came to him. There's a story about him signing Odetta, one of the great folk artists of the period, and telling her \"you can stay with your current manager, and make a hundred thousand dollars this year, and he'll take twenty percent, or you can come with me, and make a quarter of a million dollars, but I'll take fifty percent\".\n\nThat was the attitude that Grossman took to everyone. He cut himself in to every contract, salami-slicing his artists' royalties at each stage. But it can't be denied that his commercial instincts were sound. Peter, Paul, and Mary's first album was a huge success. The second single from the album, their version of the old Weavers song \"If I Had a Hammer\", written by Pete Seeger and Lee Hays, went to number ten on the pop charts:\n\n[Excerpt: Peter, Paul and Mary, \"If I Had a Hammer\"]\n\nAnd the album itself went to number one and eventually went double-platinum -- a remarkable feat for a collection of songs that, however prettily arranged, contained a fairly uncompromising selection of music from the folk scene, with songs by Seeger, Dave van Ronk, and Rev. Gary Davis mixing with traditional songs like \"This Train\" and originals by Stookey and Yarrow.\n\nTheir second album was less successful at first, with its first two singles flopping. But the third, a pretty children's song by Yarrow and his friend Leonard Lipton, went to number two on the pop charts and number one on the Adult Contemporary charts:\n\n[Excerpt: Peter, Paul, and Mary, \"Puff the Magic Dragon\"]\n\nIncidentally, Leonard Lipton, who wrote that lyric, became independently wealthy from the royalties from the song, and used the leisure that gave him to pursue his passion of inventing 3D projection systems, which eventually made him an even wealthier man -- if you've seen a 3D film in the cinema in the last couple of decades, it's almost certainly been using the systems Lipton invented.\n\nSo Peter, Paul, and Mary were big stars, and having big hits. And Albert Grossman was constantly on the lookout for more material for them. And eventually he found it, and the song that was to make both him, his group, and its writer, very, very rich, in the pages of Broadside magazine.\n\nWhen we left Bob Dylan, he was still primarily a performer, and not really known for his songwriting, but he had already written a handful of songs, and he was being drawn into the more political side of the folk scene. In large part this was because of his girlfriend, Suze Rotolo, with whom Dylan was very deeply in love, and who was a very political person indeed. Dylan had political views, but wasn't particularly driven by them -- Rotolo very much was, and encouraged him to write songs about politics.\n\nFor much of early 1962, Dylan was being pulled in two directions at once -- he was writing songs inspired by Robert Johnson, and trying to adapt Johnson's style to fit himself, but at the same time he was writing songs like \"The Death of Emmett Till\", about the 1955 murder of a Black teenager which had galvanised the civil rights movement, and \"The Ballad of Donald White\", about a Black man on death row.\n\nDylan would later be very dismissive of these attempts at topicality, saying \"I realize now that my reasons and motives behind it were phony, I didn’t have to write it; I was bothered by many other things that I pretended I wasn’t bothered by, in order to write this song about Emmett Till, a person I never even knew\". But at the time they got him a great deal of attention in the small US folk-music scene, when they were published in magazines like Broadside and Sing Out, which collected political songs.\n\nMost of these early songs are juvenilia, with a couple of exceptions like the rather marvellous anti-bomb song \"Let Me Die in My Footsteps\", but the song that changed everything for Dylan was a different matter.\n\n\"Blowin' in the Wind\" was inspired by the melody of the old nineteenth century song \"No More Auction Block\", a song that is often described as a \"spiritual\", though in fact it's a purely secular song about slavery:\n\n[Excerpt: Odetta, \"No More Auction Block\"]\n\nThat song had seen something of a revival in folk circles in the late fifties, especially because part of its melody had been incorporated into another song, \"We Shall Overcome\", which had become an anthem of the civil rights movement when it was revived and adapted by Pete Seeger:\n\n[Excerpt: Pete Seeger, \"We Shall Overcome\"]\n\nDylan took this melody, with its associations with the fight for the rights of Black people, and came up with new lyrics, starting with the line \"How many roads must a man walk down, before you call him a man?\" He wrote two verses of the song -- the first and last verses -- in a short burst of inspiration, and a few weeks later came back to it and added another verse, the second, which incorporated allusions to the Biblical prophet Ezekiel, and which is notably less inspired than those earlier verses.\n\nIn later decades, many people have looked at the lyrics to the song and seen it as the first of what would become a whole subgenre of non-protest protest songs -- they've seen the abstraction of \"How many roads must a man walk down before you call him a man?\" as being nice-sounding rhetoric that doesn't actually mean anything, in much the same way as something like, say, \"Another Day in Paradise\" or \"Eve of Destruction\", songs that make nonspecific complaints about nonspecific bad things.\n\nBut while \"Blowin' in the Wind\" is a song that has multiple meanings and can be applied to multiple situations, as most good songs can, that line was, at the time in which it was written, a very concrete question. The civil rights movement was asking for many things -- for the right to vote, for an end to segregation, for an end to police brutality, but also for basic respect and acknowledgment of Black people's shared humanity. We've already heard in a couple of past episodes Big Bill Broonzy singing \"When Do I Get to Be Called a Man?\":\n\n[Excerpt: Big Bill Broonzy, \"When Do I Get to Be Called a Man?\"]\n\nBecause at the time, it was normal for white people to refer to Black men as \"boy\". As Dr. Martin Luther King said in his \"Letter From Birmingham Jail\", one of the greatest pieces of writing of the twentieth century, a letter in large part about how white moderates were holding Black people back with demands to be \"reasonable\" and let things take their time:\n\n\"when you have seen hate-filled policemen curse, kick, brutalize, and even kill your black brothers and sisters with impunity; when you see the vast majority of your twenty million Negro brothers smothering in an airtight cage of poverty in the midst of an affluent society... when your first name becomes“ and here Dr. King uses a racial slur which I, as a white man, will not say, \"and your middle name becomes “boy” (however old you are) and your last name becomes “John,” and when your wife and mother are never given the respected title “Mrs.”; when you are harried by day and haunted by night by the fact that you are a Negro, living constantly at tiptoe stance, never knowing what to expect next, and plagued with inner fears and outer resentments; when you are forever fighting a degenerating sense of “nobodyness”—then you will understand why we find it difficult to wait. There comes a time when the cup of endurance runs over and men are no longer willing to be plunged into an abyss of injustice where they experience the bleakness of corroding despair.\"\n\nKing's great letter was written in 1963, less than a year after Dylan was writing his song but before it became widely known. In the context of 1962, the demand to call a man a man was a very real political issue, not an aphorism that could go in a Hallmark card.\n\nDylan recorded the song in June 1962, during the sessions for his second album, which at the time was going under the working title \"Bob Dylan's Blues\":\n\n[Excerpt: Bob Dylan, \"Blowin' in the Wind\"]\n\nBy the time he recorded it, two major changes had happened to him. The first was that Suze Rotolo had travelled to Spain for several months, leaving him bereft -- for the next few months, his songwriting took a turn towards songs about either longing for the return of a lost love, like \"Tomorrow is a Long Time\", one of his most romantic songs, or about how the protagonist doesn't even need his girlfriend anyway and she can leave if she likes, see if he cares, like \"Don't Think Twice It's Alright\".\n\nThe other change was that Albert Grossman had become his manager, largely on the strength of \"Blowin' in the Wind\", which Grossman thought had huge potential. Grossman signed Dylan up, taking twenty percent of all his earnings -- including on the contract with Columbia Records Dylan already had -- and got him signed to a new publisher, Witmark Publishing, where the aptly-named Artie Mogull thought that \"Blowin' in the Wind\" could be marketed. Grossman took his twenty percent of Dylan's share of the songwriting money as his commission from Dylan -- and fifty percent of Witmark's share of the money as his commission from Witmark, meaning that Dylan was getting forty percent of the money for writing the songs, while Grossman was getting thirty-five percent.\n\nGrossman immediately got involved in the recording of Dylan's second album, and started having personality clashes with John Hammond. It was apparently Grossman who suggested that Dylan \"go electric\" for the first time, with the late-1962 single \"Mixed-Up Confusion\":\n\n[Excerpt: Bob Dylan, \"Mixed-Up Confusion\"]\n\nNeither Hammond nor Dylan liked that record, and it seemed clear for the moment that the way forward for Dylan was to continue in an acoustic folk vein.\n\nDylan was also starting to get inspired more by English folk music, and incorporate borrowings from English music into his songwriting. That's most apparent in \"A Hard Rain's A-Gonna Fall\", written in September 1962. Dylan took the structure of that song from the old English ballad, \"Lord Randall\":\n\n[Excerpt: Ewan MacColl, \"Lord Randall\"]\n\nHe reworked that structure into a song of apocalypse, again full of the Biblical imagery he'd tried in the second verse of &nbsp;\"Blowin' in the Wind\", but this time more successfully incorporating it:\n\n[Excerpt: Bob Dylan, \"A Hard Rain's A-Gonna Fall\"]\n\nHis interest in English folk music was to become more important in his songwriting in the following months, as Dylan was about to travel to the UK and encounter the British folk music scene. A TV director called Philip Saville had seen Dylan performing in New York, and had decided he would be perfect for the role of a poet in a TV play he was putting on, Madhouse in Castle Street, and got Dylan flown over to perform in it.\n\nUnfortunately, no-one seems to have told Dylan what would be involved in this, and he proved incapable of learning his lines or acting, so the show was rethought -- the role of the poet was given to David Warner, later to become one of Britain's most famous screen actors, and Dylan was cast in a new role as a singer called \"Bobby\", who had few or no lines but did get to sing a few songs, including \"Blowin' in the Wind\", which was the first time the song was heard by anyone outside of the New York folk scene.\n\nDylan was in London for about a month, and while he was there he immersed himself in the British folk scene.\n\nThis scene was in some ways modelled on the American scene, and had some of the same people involved, but it was very different. The initial spark for the British folk revival had come in the late 1940s, when A.L. Lloyd, a member of the Communist Party, had published a book of folk songs he'd collected, along with some Marxist analysis of how folk songs evolved.\n\nIn the early fifties, Alan Lomax, then in the UK to escape McCarthyism, put Lloyd in touch with Ewan MacColl, a songwriter and performer from Manchester, who we heard earlier singing \"Lord Randall\". MacColl, like Lloyd, was a Communist, but the two also shared a passion for older folk songs, and they began recording and performing together, recording traditional songs like \"The Handsome Cabin Boy\":\n\n[Excerpt: Ewan MacColl and A.L. Lloyd, \"The Handsome Cabin Boy\"]\n\nMacColl and Lloyd latched on to the skiffle movement, and MacColl started his own club night, Ballads and Blues, which tried to push the skifflers in the direction of performing more music based in English traditional music. This had already been happening to an extent with things like the Vipers performing \"Maggie May\", a song about a sex worker in Liverpool:\n\n[Excerpt: The Vipers Skiffle Group, \"Maggie May\"]\n\nBut this started to happen a lot more with MacColl's encouragement. At one point in 1956, there was even a TV show hosted by Lomax and featuring a band that included Lomax, MacColl, Jim Bray, the bass player from Chris Barber's band, Shirley Collins -- a folk singer who was also Lomax's partner -- and Peggy Seeger, who was Pete Seeger's sister and who had also entered into a romantic relationship with MacColl, whose most famous song, \"The First Time Ever I Saw Your Face\", was written both about and for her:\n\n[Excerpt: Peggy Seeger, \"The First Time Ever I Saw Your Face\"]\n\nIt was Seeger who instigated what became the most notable feature at the Ballads and Blues club and its successor the Singer's Club. She'd burst out laughing when she saw Long John Baldry sing \"Rock Island Line\", because he was attempting to sing in an American accent. As someone who had actually known Lead Belly, she found British imitations of his singing ludicrous, and soon there was a policy at the clubs that people would only sing songs that were originally sung with their normal vowel sounds. So Seeger could only sing songs from the East Coast of the US, because she didn't have the Western vowels of a Woody Guthrie, while MacColl could sing English and Scottish songs, but nothing from Wales or Ireland.\n\nAs the skiffle craze died down, it splintered into several linked scenes. We've already seen how in Liverpool and London it spawned guitar groups like the Shadows and the Beatles, while in London it also led to the electric blues scene. It also led to a folk scene that was very linked to the blues scene at first, but was separate from it, and which was far more political, centred around MacColl. That scene, like the US one, combined topical songs about political events from a far-left viewpoint with performances of traditional songs, but in the case of the British one these were mostly old sea shanties and sailors' songs, and the ancient Child Ballads, rather than Appalachian country music -- though a lot of the songs have similar roots.\n\nAnd unlike the blues scene, the folk scene spread all over the country. There were clubs in Manchester, in Liverpool (run by the group the Spinners), in Bradford, in Hull (run by the Waterson family) and most other major British cities. The musicians who played these venues were often inspired by MacColl and Lloyd, but the younger generation of musicians often looked askance at what they saw as MacColl's dogmatic approach, preferring to just make good music rather than submit it to what they saw as MacColl's ideological purity test, even as they admired his musicianship and largely agreed with his politics.\n\nAnd one of these younger musicians was a guitarist named Martin Carthy, who was playing a club called the King and Queen on Goodge Street when he saw Bob Dylan walk in. He recognised Dylan from the cover of Sing Out! magazine, and invited him to get up on stage and do a few numbers. For the next few weeks, Carthy showed Dylan round the folk scene -- Dylan went down great at the venues where Carthy normally played, and at the Roundhouse, but flopped around the venues that were dominated by MacColl, as the people there seemed to think of Dylan as a sort of cut-rate Ramblin' Jack Elliot, as Elliot had been such a big part of the skiffle and folk scenes.\n\nCarthy also taught Dylan a number of English folk songs, including \"Lord Franklin\":\n\n[Excerpt: Martin Carthy, \"Lord Franklin\"]\n\nand \"Scarborough Fair\":\n\n[Excerpt: Martin Carthy, \"Scarborough Fair\"]\n\nDylan immediately incorporated the music he'd learned from Carthy into his songwriting, basing \"Bob Dylan's Dream\" on \"Lord Franklin\", and even more closely basing \"GIrl From the North Country\" on \"Scarborough Fair\":\n\n[Excerpt: Bob Dylan, \"Girl From The North Country\"]\n\nAfter his trip to London, Dylan went over to Europe to see if he could catch up with Suze, but she had already gone back to New York -- their letters to each other crossed in the post. On his return, they reunited at least for a while, and she posed with him for the photo for the cover of what was to be his second album.\n\nDylan had thought that album completed when he left for England, but he soon discovered that there were problems with the album -- the record label didn't want to release the comedy talking blues \"Talking John Birch Society Paranoid Blues\", because they thought it might upset the fascists in the John Birch Society. The same thing would later make sure that Dylan never played the Ed Sullivan Show, because when he was booked onto the show he insisted on playing that song, and so they cancelled the booking.\n\nIn this case, though, it gave him an excuse to remove what he saw as the weaker songs on the album, including \"Tomorrow is a Long Time\", and replace them with four new songs, three of them inspired by traditional English folk songs -- \"Bob Dylan's Dream\", &nbsp;\"Girl From the North Country\", and \"Masters of War\" which took its melody from the old folk song \"Nottamun Town\" popularised on the British folk circuit by an American singer, Jean Ritchie:\n\n[Excerpt: Jean Ritchie, \"Nottamun Town\"]\n\nThese new recordings weren't produced by John Hammond, as the rest of the album was. Albert Grossman had been trying from the start to get total control over Dylan, and didn't want Hammond, who had been around before Grossman, involved in Dylan's career. Instead, a new producer named Tom Wilson was in charge.\n\nWilson was a remarkable man, but seemed an odd fit for a left-wing folk album. He was one of the few Black producers working for a major label, though he'd started out as an indie producer. He was a Harvard economics graduate, and had been president of the Young Republicans during his time there -- he remained a conservative all his life -- but he was far from conservative in his musical tastes. When he'd left university, he'd borrowed nine hundred dollars and started his own record label, Transition, which had put out some of the best experimental jazz of the fifties, produced by Wilson, including the debut albums by Sun Ra:\n\n[Excerpt: Sun Ra, \"Brainville\"]\n\nand Cecil Taylor:\n\n[Excerpt: Cecil Taylor, \"Bemsha Swing\"]\n\nWilson later described his first impressions of Dylan: \"I didn’t even particularly like folk music. I’d been recording Sun Ra and Coltrane … I thought folk music was for the dumb guys. This guy played like the dumb guys, but then these words came out. I was flabbergasted.\"\n\nWilson would soon play a big part in Dylan's career, but for now his job was just to get those last few tracks for the album recorded.\n\nIn the end, the final recording session for Dylan's second album was more than a year after the first one, and it came out into a very different context from when he'd started recording it.\n\nBecause while Dylan was putting the finishing touches on his second album, Peter Paul and Mary were working on their third, and they were encouraged by Grossman to record three Bob Dylan songs, since that way Grossman would make more money from them. Their version of \"Blowin' in the Wind\" came out as a single a few weeks after The Freewheelin' Bob Dylan came out, and sold 300,000 copies in the first week:\n\n[Excerpt: Peter, Paul, and Mary, \"Blowin' in the Wind\"]\n\nThe record went to number two on the charts, and their followup, \"Don't Think Twice it's Alright\", another Dylan song, went top ten as well.\n\n\"Blowin' in the Wind\" became an instant standard, and was especially picked up by Black performers, as it became a civil rights anthem. Mavis Staples of the Staple Singers said later that she was astonished that a white man could write a line like \"How many roads must a man walk down before you call him a man?\", saying \"That's what my father experienced\" -- and the Staple Singers recorded it, of course:\n\n[Excerpt: The Staple Singers, \"Blowin' in the Wind\"]\n\nas did Sam Cooke:\n\n[Excerpt: Sam Cooke, \"Blowin' in the Wind\"]\n\nAnd Stevie Wonder:\n\n[Excerpt: Stevie Wonder, \"Blowin' in the Wind\"]\n\nBut the song's most important performance came from Peter, Paul and Mary, performing it on a bill with Dylan, Odetta, Joan Baez, and Mahalia Jackson in August 1963, just as the song had started to descend the charts. Because those artists were the entertainment for the March on Washington, in which more than a quarter of a million people descended on Washington both to support President Kennedy's civil rights bill and to speak out and say that it wasn't going far enough. That was one of the great moments in American political history, full of incendiary speeches like the one by John Lewis:\n\n[Excerpt: John Lewis, March on Washington speech]\n\nBut the most memorable moment at that march &nbsp;came when Dr. King was giving his speech. Mahalia Jackson shouted out \"Tell them about the dream, Martin\", and King departed from his prepared words and instead improvised based on themes he'd used in other speeches previously, coming out with some of the most famous words ever spoken:\n\n[Excerpt: Martin Luther King, \"I Have a Dream\"]\n\nThe civil rights movement was more than one moment, however inspiring, and white people like myself have a tendency to reduce it just to Dr. King, and to reduce Dr. King just to those words -- which is one reason why I quoted from Letter From Birmingham Jail earlier, as that is a much less safe and canonised piece of writing. But it's still true to say that if there is a single most important moment in the history of the post-war struggle for Black rights, it was that moment, and because of \"Blowin' in the Wind\", both Dylan and Peter, Paul and Mary were minor parts of that event.\n\nAfter 1963, Peter, Paul and Mary quickly became passe with the British Invasion, only having two more top ten hits, one with a novelty song in 1967 and one with \"Leaving on a Jet Plane\" in 1969. They split up in 1970, and around that time Yarrow was arrested and convicted for a sexual offence involving a fourteen-year-old girl, though he was later pardoned by President Carter. The group reformed in 1978 and toured the nostalgia circuit until Mary's death in 2009. The other two still occasionally perform together, as Peter and Noel Paul.\n\nBob Dylan, of course, went on to bigger things after \"Blowin' in the Wind\" suddenly made him into the voice of a generation -- a position he didn't ask for and didn't seem to want. We'll be hearing much more from him. And we'll also be hearing more about the struggle for Black civil rights, as that's a story, much like Dylan's, that continues to this day.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and nine of A History of Rock Music in Five Hundred Songs looks at \"Blowin' in the Wind\", Peter, Paul and Mary, Bob Dylan, the UK folk scene and the civil rights movement. Those of you who get angry at me whenever I say anything that acknowledges the existence of racism may want to skip this one. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Santa Claus is Coming to Town\" by the Crystals.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nThis compilation contains all Peter, Paul and Mary's hits.\n\nI have used *many* books for this episode, most of which I will also be using for future episodes on Dylan:\n\nThe Mayor of MacDougal Street by Dave Van Ronk and Elijah Wald is the fascinating and funny autobiography of Dylan's mentor in his Greenwich Village period, including his interactions with Albert Grossman.\n\nChronicles Volume 1 by Bob Dylan&nbsp;is a partial, highly inaccurate, but thoroughly readable autobiography.\n\nBob Dylan: All The Songs by Phillipe Margotin and Jean-Michel Guesdon&nbsp;is a song-by-song look at every song Dylan ever wrote, as is&nbsp;Revolution in the Air,&nbsp;by Clinton Heylin.\n\nHeylin also wrote the most comprehensive and accurate biography of Dylan,&nbsp;Behind the Shades.\n\nI've also used&nbsp;Robert Shelton's No Direction Home, which is less accurate, but which is written by someone who knew Dylan.\n\nOnly one book exists on Peter, Paul, and Mary themselves, and it is a hideously overpriced coffee table book consisting mostly of photos, so I wouldn't bother with it.\n\nRoots, Radicals, and Rockers: How Skiffle Changed the World by Billy Bragg has some great information on the British folk scene of the fifties and sixties.\n\nAnd&nbsp;Singing From the Floor is an oral history of British folk clubs, including a chapter on Dylan's 1962 visit to London.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nTranscript\n\nToday we're going to look at the first manufactured pop band we will see in this story, but not the last -- a group cynically put together by a manager to try and cash in on a fad, but one who were important enough that in a small way they helped to change history. We're going to look at the March on Washington and the civil rights movement, at Bob Dylan blossoming into a songwriter and the English folk revival, and at \"Blowin' in the Wind\" by Peter, Paul, and Mary:\n\n[Excerpt: Peter, Paul and Mary, \"Blowin' in the Wind\"]\n\nAlbert Grossman was an unusual figure in the world of folk music. The folk revival had started out as an idealistic movement, mostly centred on Pete Seeger, and outside a few ultra-commercial acts like the Kingston Trio, most of the people involved were either doing it for the love of the music, or as a means of advancing their political goals. No doubt many of the performers on the burgeoning folk circuit were also quite keen to make money -- there are very few musicians who don't like being able to eat and have a home to live in -- but very few of the people involved were primarily motivated by increasing their income.\n\nGrossman was a different matter. He was a businessman, and he was interested in money more than anything else -- and for that he was despised by many of the people in the Greenwich Village folk scene. But he was, nonetheless, someone who was interested in making money *from folk music* specifically. And in the late fifties and early sixties this was less of a strange idea than it might have seemed.\n\nWe talked back in the episode on \"Drugstore Rock and Rol",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and nine of A History of Rock Music in Five Hundred Songs looks at \"Blowin' in the Wind\", Peter, Paul and Mary, Bob Dylan, the UK folk scene and the civil rights movement. Those of you who get angry at me whenever I say anything that acknowledges the existence of racism may want to skip this one. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Santa Claus is Coming to Town\" by the Crystals.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nThis compilation contains all Peter, Paul and Mary's hits.\n\nI have used *many* books for this ep",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}