{
  "title": "The Magnet That Made the Modern World",
  "link": "https://spectrum.ieee.org/the-men-who-made-the-magnet-that-made-the-modern-world",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-cube-made-up-of-silver-spheres.jpg?id=30007520&width=1200&height=800&coordinates=0%2C106%2C0%2C107\"/><br/><br/><p>\n\tFor sheer drama and resonance, few tech breakthroughs can match the invention of the neodymium-iron-boron permanent magnet in the early 1980s. It’s one of the great stories of corporate intrigue: General Motors in the United States and Sumitomo in Japan independently conceived the technology and then worked in secret, racing to commercialize the technology, and without even being aware of the other’s efforts. The two project leaders—<a href=\"https://en.wikipedia.org/wiki/Masato_Sagawa\" target=\"_blank\">Masato Sagawa</a> of Sumitomo and <a href=\"https://ethw.org/John_J._Croat\" target=\"_blank\">John Croat</a> of GM—surprised each other by announcing their results at the same conference in Pittsburgh in 1983.\n</p><p>\n\tUp for grabs was a market potentially worth billions of dollars. The best permanent magnets at the time, samarium-cobalt, were strong and reliable but expensive. They were used in electric motors, generators, audio speakers, hard-disk drives, and other high-volume products. Today, some \n\t<a href=\"https://link.springer.com/article/10.1007/s40831-018-0162-8\" rel=\"noopener noreferrer\" target=\"_blank\">95 percent</a> of permanent magnets are neodymium-iron-boron. The global market for these magnets is expected to reach <a href=\"https://borates.today/boron-magnets-prize/\" rel=\"noopener noreferrer\" target=\"_blank\">US $20 billion a year</a> within a couple of years, as the automobile industry shifts toward electric vehicles and as utilities turn increasingly to wind turbines to meet growing demand.\n</p><p>\n<a href=\"https://ieeetv.ieee.org/channels/ieee_awards/masato-sagawa-john-j-croat-ieee-medal-for-environmental-and-safety-technologies#:~:text=IEEE%20Awards-,John%20J.,generators%2C%20and%20other%20devices.%22\" target=\"_blank\">IEEE recently honored</a> Sagawa and Croat by awarding them its <a href=\"https://ethw.org/IEEE_Medal_for_Environmental_and_Safety_Technologies\" target=\"_blank\">Medal for Environmental and Safety Technologies</a> at the 2022 Vision, Innovation, and Challenges Summit. <em>IEEE Spectrum</em> spoke with the two inventors, including an hourlong interview with both of them (only the second time the two have been interviewed together). They revealed their reasons for zeroing in on the rare-earth element neodymium, the major challenges they faced in making a commercial magnet out of it, the extraordinary intellectual-property deal that allowed both GM and Sumitomo to market their magnets worldwide, and their opinions on whether there will ever be a successful permanent magnet that does not use rare-earth elements.<a name=\"top\"></a>\n</p><p><em>Editor's note: a video of the interview is available <a href=\"https://ieeetv.ieee.org/channels/ieee_awards/masato-sagawa-john-croat-interview-with-glenn-zorpette-ieee-vic-summit\" target=\"_blank\">here</a>.</em></p><p>\n\tJohn Croat and Masato Sagawa on…\n</p><ul>\n<li><a href=\"#metals\">How they settled on neodymium, iron, and boron</a>\n</li>\n<li><a href=\"#magnet\">The major hurdles to producing a commercially viable magnet</a>\n</li>\n<li><a href=\"#market\">The low-key deal struck between GM and Sumitomo to allow global marketing of their magnets</a>\n</li>\n<li><a href=\"#permanent\">Why there will never be a successful permanent magnet that does not use rare-earth elements</a></li>\n</ul><p>\n<strong>You were trying to make a cheaper magnet, as I understand it. You weren’t even necessarily trying to make a stronger one, although that turned out to be the case. What made you think you could make a cheaper magnet?</strong>\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A white-haired man in a red tie appears mildly bemused\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"79958f73a7f0091651c237e3866c766d\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"70407\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-white-haired-man-in-a-red-tie-appears-mildly-bemused.jpg?id=30007525&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">John Croat</small>\n</p><p>\n<strong>John Croat:</strong> Well, the problem with samarium-cobalt…they were an excellent magnet. They had good temperature properties. You’ve probably heard the phrase that rare earths aren’t really that rare, but samarium is one of the more rare ones. It constitutes only about 0.8 percent of the composition of the ores that are typically exploited today for rare earths. So it was a fairly expensive rare earth. And, of course, cobalt was very expensive. During my early years at <a href=\"https://en.wikipedia.org/wiki/General_Motors_Research_Laboratories\" target=\"_blank\">General Motors Research Labs</a>, there was a war in Central African Zaire [now known as the Democratic Republic of the Congo], which is a big cobalt supplier. And the price of cobalt went up to something like $45 a kilogram. Remember, this was in the 1970s, so it basically stopped our research on samarium-cobalt magnets.\n</p><p>\n<strong>Masato, what do you remember? What do you recall of the state of the permanent-magnet market and technology in the 1970s in Japan?</strong>\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A white-haired man smiles at the camera\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"473beb7df9bbfad4c705d88ea6d17366\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"d9132\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-white-haired-man-smiles-at-the-camera.jpg?id=30007549&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Masato Sagawa</small>\n</p><p>\n<strong>Masato Sagawa:</strong> I joined Fujitsu in 1972, so that’s in the same age as with John. And I was given from the company to improve the <a href=\"https://idealmagnetsolutions.com/knowledge-base/samarium-cobalt-vs-neodymium-magnets/\" target=\"_blank\">samarium-cobalt magnet</a>, to improve the mechanical strength. But I wondered why there is no iron compound. Iron is much cheaper and much more [available] than cobalt, and iron has higher magnetic moment than cobalt. So if I can produce rare-earth iron magnets, I thought I will have higher magnetic strengths and much lower cost. So I started to research the samarium-cobalt—or rare-earth iron compound. But it’s an official subject in Fujitsu. And I worked hard on the samarium-cobalt. And I succeeded in the development of samarium-cobalt magnet with high strength. And I asked the company to work on a rare-earth iron compound permanent magnet. But I was not allowed. But I had an idea. Rare-earth, iron and, I think, a small amount of additive elements like some carbon or boron, which are known to have a very small atomic diameter. I studied the rare-earth, iron, boron or rare-earth, iron, carbon. So underground, I did this research for several years. And I reached this neodymium-boron several years later. It was in 1982.\n</p><p>\n<a href=\"#top\">Back to top</a>\n</p><p>\n<a name=\"metals\"></a><strong>What was it that made you focus on neodymium, iron, and boron? Why those?</strong>\n</p><p>\n<strong>Croat:</strong> Well, of course, when samarium-cobalt magnets were developed, everyone in this field thought about developing a rare-earth-iron magnet because iron is virtually free compared to cobalt. Now, in terms of the rare earths, as I said, rare earths are not really that rare. The light rare earths, lanthanum, cerium, praseodymium, and neodymium, constitute about 90 percent of the composition of a typical rare-earth deposit…. So we knew at the start that if we wanted to make an economically viable magnet, both Dr. Sagawa and I realized that we had to make the permanent magnet from one of these four rare earths: lanthanum, cerium, neodymium, or praseodymium. The problem with lanthanum and cerium, as you know, the lanthanides are formed by filling the <a href=\"https://en.wikibooks.org/wiki/High_School_Chemistry/Lanthanides_and_Actinides\" target=\"_blank\">4F electrons</a> in the 4F series. However, lanthanum and cerium, the two most abundant rare-earths, had no 4F electrons. And we knew by this time, based on the work with samarium-cobalt magnets, that one of the things that you had to have was these 4F electrons to give you the coercivity for the material.\n</p><p>\n<a href=\"#top\">Back to top</a>\n</p><p>\n<a name=\"magnet\"></a><strong><a href=\"https://spectrum.ieee.org/r/entryeditor/2657538742#top\" target=\"_self\"></a>Can you give us a quick definition of coercivity?</strong>\n</p><p>\n<strong>Croat:</strong> <a href=\"https://idealmagnetsolutions.com/knowledge-base/understanding-coercivity/\" target=\"_blank\">Coercivity</a> is the resistance to demagnetization. In a permanent magnet, as you say, the moments are all aligned parallel. If you put a magnetic field in the reverse direction, the coercivity will resist the magnet flipping into the opposite direction.\n</p><p>\n\tWe knew that we wanted iron instead of cobalt…. And both of us set out with the intention of making a rare-earth iron permanent magnet from neodymium or praseodymium. The problem was that there was no intermetallic compounds available. Unlike in this rare-earth cobalt phase diagram—there was lots of interesting intermetallic compounds—the rare-earth-iron phase diagrams do not contain suitable usable intermetallic compounds.\n</p><p>\n<strong>In plain language, what is an intermetallic phase, and why is it important?</strong>\n</p><p>\n<strong>Croat:</strong> An intermetallic compound or an <a href=\"https://www.giessereilexikon.com/en/foundry-lexicon/Encyclopedia/show/intermetallic-phase-4565/?cHash=fc50d9a4ec7a9ad5757902d9d229d24f\" target=\"_blank\">intermetallic phase</a> is a phase with a fixed ratio of the components. Like, terbium-iron two has one terbium and two irons. And it sits on a crystal lattice in very specific sites on the lattice. You have to have that. That’s one of the quintessential requirements for any rare-earth transition-metal permanent magnet.\n</p><p>\n<strong>It provides the structure and stability you need or the reproducibility?</strong>\n</p><p>\n<strong>Croat:</strong> All of that. In other words, it’s the thing that holds the magnetic moment in place in the structure. You have to have this crystal structure.\n</p><p>\n<strong>So what was the solution?</strong>\n</p><p>\n<strong>Croat:</strong> The fact that there was no intermetallic compound was a baffling problem for some time. But then, in 1976, I and a couple of colleagues saw <a href=\"https://apps.dtic.mil/sti/pdfs/ADA035484.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">a paper by Art Clark</a>. He was working at the Naval Surface Weapons Laboratory. He had taken a sputtered sample of terbium iron two [TbFe<sub>2</sub>] and annealed it at increasingly higher temperatures. And at about 350 °C, the coercivity shot up to about 3.5 kilo oersted. And we surmised, and I think correctly at the time, that what had happened was that during the crystallization process, a metastable phase had formed. This was exciting because this is the first time anyone had ever developed a coercivity in a rare-earth iron material. It was also exciting because of the fact that TbFe<sub>2</sub> is a cubic material. And a cubic material should not develop coercivity. You have to have a crystal structure with a <a href=\"https://www.britannica.com/science/uniaxial-crystal\" target=\"_blank\">uniaxial crystal</a> lattice, like hexagonal, rhombohedral, or tetragonal.\n</p><p>\n\tAnd so I started out with that thesis: to create magnetically hard metastable phases that are practical for permanent magnets. And by using rapid solidification, I started making melt-spun materials and crystallizing them. And it worked very well. I had developed very high coercivities right away. The problem with these materials were that they were all unstable. I started to heat them up at about 450 °C, and they would decompose into their equilibrium structure, and the coercivity would go away. So I began to add things to see if I could make them more stable. And one of the things I added was boron. And one day I found that when I heated my sample up containing boron, it did not decompose into its equilibrium structure. And so I knew that I had discovered a ternary neodymium-iron-boron intermetallic phase, a very interesting, technically important intermetallic phase. And it turns out that Masato discovered the same one [laughter].\n</p><p>\n<strong>Sagawa-san, you mentioned that you were interested in a sintering process, which was similar to the process that was then being used to manufacture samarium-cobalt magnets.... When you were working on a way to make neodymium-iron-boron magnets using sintering, did you encounter specific challenges that were difficult, that took a lot of effort to solve?</strong>\n</p><p>\n<strong>Sagawa:</strong> I was not able to give coercivity to the neodymium-iron-boron alloy. And I tried many processes. But the cost of sintering is good because to give coercivity to the alloy, you have to make a cellular structure in the alloy. So to produce cellular structure, the sintering is a very good way because first, you make single crystal or powder and you align the powder and then sintering. And during sintering, you form automatically cellular structure.\n</p><p>\n\tSo I tried to form cellular structure. I tested many, many kinds of elements starting from copper. Copper is used in the case of samarium-cobalt magnets. And starting from copper, I tested many, many additive elements almost throughout the periodic table. But I was not able to give coercivity by making additional elements. And at last, I found a good additive element. It’s not another element—it’s neodymium itself. Additional neodymium gives home to cellular structure forming a grain boundary area around the neodymium-iron-boron particles. So I succeeded in giving coercivity to the neodymium-iron-boron by sintering and a neodymium-rich composition. And I succeeded in developing a neodymium-boron sintered magnet with record-high BH maximum [a measure of the maximum magnetic energy that can be stored in a magnet] in the world. It was in 1982.\n</p><p>\n<strong>This work is mostly happening in the late 1970s, early 1980s. You’re both working on almost the same problem on different sides of the world. Sagawa-san, when did you first find out that General Motors was also working on the same challenge that you were working on?</strong>\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Two men stand in a conference room behind a podium.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"c772ee8ce43d91ee877da47053232af0\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"0d8c7\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/two-men-stand-in-a-conference-room-behind-a-podium.jpg?id=30007554&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Masato Sagawa  of Sumitomo [left] announced the invention of a revolutionary neodymium-iron-boron permanent magnet at a conference in Pittsburgh, in November 1983. At the same meeting, John Croat of General Motors announced the invention of a magnet using the exact same elements.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Masato Sagawa</small>\n</p><p>\n<strong>Sagawa:</strong> It was when I made the first presentation at the MMM Conference, Magnetism and Magnetic Material Conference, held in Pittsburgh in 1983.\n</p><p>\n<strong>Croat:</strong> November 1983.\n</p><p>\n<strong>Sagawa:</strong> November 1983. At the same conference, John Croat and his group presented a paper on the same neodymium-boron alloy magnets.\n</p><p>\n<strong>So for years, you both had been working on this problem, attacking the same problem. And you both found out about the other effort at the same conference in Pittsburgh in 1983?</strong>\n</p><p>\n<strong>Croat:</strong> Yes.\n</p><p>\n<strong>That’s astounding. Did you talk to each other at that conference? Did you get together and say anything to each other?</strong>\n</p><p>\n<strong>Croat:</strong> I think we introduced ourselves to each other, but I don’t remember much more than that.\n</p><p>\n<strong>What do you recall, Sagawa-san? Do you recall any conversation with John at that meeting?</strong>\n</p><p>\n<strong>Sagawa:</strong> I remember that I saw John, but I don’t remember if we talked together or not.\n</p><p>\n<strong>Croat:</strong> I think it would have been logical if we did, but I cannot remember it. We probably considered ourselves competitors [laughter].\n</p><p>\n<strong>You both came up with independent means of manufacturing. General Motors came up with a technique called melt-spinning, and Sumitomo’s was a sintering process. They had different characteristics. The sintered magnets seem to have more structural strength or resilience. The GM magnets can be produced more inexpensively. They both found large market applications, somewhat different but still large uses. John, why don’t you take a crack in just explaining what their market niches became and still are to this day?</strong>\n</p><p>\n<strong>Croat:</strong> Yes. The rapidly solidified materials are isotropic. And during the rapid solidification process, you form a magnetic powder. That powder is blended with an epoxy and made into a magnet. But it turned out that these magnets were ideal for making small ring magnets that go into micromotors like spindle motors for <a href=\"https://www.stanfordmagnets.com/what-are-the-uses-of-neodymium-magnets-in-computers.html\" target=\"_blank\">hard-disk drives</a> or CD-ROMs or for stepper motors. So that has—\n</p><p>\n<strong>For robots.</strong>\n</p><p>\n<strong>Croat:</strong> For robots and things of that nature, servo motors for robots, but also spindle and stepper motors for various applications. And that has been the primary market for these bonded magnets because making a thin-wall ring magnet by the sintering process is very difficult. They tend to crack and break apart. But in contrast, the sintered-magnet market, which is much bigger actually than the bonded-magnet market, has been used primarily for bigger motors, wind-turbine generators, MRIs. Most of the electric-vehicle motors are sintered magnets. So again, most of the market is motors. But the market is bigger for the sintered-magnet market than it is for the bonded-magnet market. But there are two distinctly different markets in general.\n</p><p>\n<strong>Sagawa:</strong> I think one of the most important applications of the neodymium-iron-boron magnet is the hard-disk drive. If the neodymium-boron was not found, it would have been difficult to miniaturize the hard-disk drive. Before the appearance of the neodymium-boron magnet, the hard-disk drive was very big. It was difficult to lift by one person, 10 kilo or 20 kilogram or so. Now it becomes very small. And this is because of the invention of neodymium-boron sintered magnet which is used in the actuator motor. And also, the bonded-magnet neodymium is used in the spindle motor to rotate the hard disk. This was a very important invention for the start of our IT society.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"An open hard drive\" class=\"rm-shortcode\" data-rm-shortcode-id=\"af71c0dd5f6c106b07b8f32ef9d2f5b1\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"7747e\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/an-open-hard-drive.jpg?id=30007556&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Hard-disk drives contain several neodymium permanent magnets. There’s one in the spindle motor that rotates the disk, and typically two others in the read-write arm, also known as the actuator arm (the triangular shaped structure in the photo) that detects and writes data on the disk.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Getty Images</small>\n</p><p>\n<a href=\"#top\">Back to top</a>\n</p><p>\n<a name=\"market\"></a><strong>You had little or no contact with each other until this meeting in Pittsburgh in 1983, by which time you’d already established all your intellectual property. And yet there was a long-running—well, not that long-running, but a patent case between General Motors and Sumitomo. John, can you start off and tell us a little bit about what happened there?</strong>\n</p><p>\n<strong>Croat:</strong> Yes. I guess we didn’t mention it, but both Sumitomo and General Motors filed patents shortly after the invention of this material, which turned out to be early 1982, apparently within weeks of each other. But it turns out, because of patent law, the way patent law is written, General Motors ended up with the patents in North America, and Sumitomo ended up with the patents for the composition neodymium-iron-boron in Japan and Europe. General Motors had the neodymium-iron-boron composition in North America. This meant that neither company could market worldwide, and they <em>had</em> to market worldwide to be economically viable. So they actually had a dispute, of course. I don’t know if they actually sued each other. But anyway, they had a negotiation. And I remember being part of these negotiations where we ended up with an agreement where we cross-licensed each other, which allowed both companies to <a href=\"https://macropolo.org/analysis/permanent-magnets-case-study-industry-chinese-production-supply/\" target=\"_blank\">market the material worldwide</a>—manufacture and market the material worldwide.\n</p><p>\n<strong>But you could only manufacture and market your type of material, which, in your case, was this melt-spun, rapid—</strong>\n</p><p>\n<strong>Croat:</strong> Solidification, melt-spinning.\n</p><p>\n<strong>Solidification. And Sumitomo had the sintering worldwide, North America, Asia, Europe, everywhere.</strong>\n</p><p>\n<strong>Croat:</strong> It turned out it was based on the particle size of the material. Sumitomo had the rights to manufacture magnets with a particle size greater than one micron, General Motors less than one micron.\n</p><p>\n<strong>Sagawa:</strong> Oh, you remember!\n</p><p>\n<strong>Croat:</strong> Yes. [Both laugh]\n</p><p>\n<a href=\"#top\">Back to top</a>\n</p><p>\n<a name=\"permanent\"></a><strong>Right now, of course, there’s a lot of controversy over the fact that an enormous amount of the world’s market for rare-earth elements is controlled by China, the mining, the production, and so on. So many countries, particularly in Europe and North America, are looking to broaden their base of suppliers for rare earths. But at the same time, there’s this existing market for these magnets. So is this having an effect of any kind on the future directions of R&D in permanent magnets?</strong>\n</p><p>\n<strong>Croat:</strong> I am no longer close enough to the R&D to know what’s going on, but I think there has been no change. People are still interested in making permanent magnets primarily containing a rare earth.\n</p><p>\n\tI don’t see how they’re ever going to get the rare earth out of a rare-earth transition metal magnet and make a good high-performance magnet. So the rare-earth supply problem is going to continue and will maybe even grow in the future as the market for these magnets grows. And I think the only way that they can overcome that is that Japan and Korea and Western Europe and North America will have to have some kind of government help to establish a rare-earth market outside of [China]. There are a lot of countries that have rare earths. India, for example, has rare earths. Australia, Canada have rare earths. United States, of course, has several big deposits. But what happened was, of course, the Chinese reduced the price to the point back in the 1990s and drove everybody else out of business. So somehow, some political will has to be put forth to change the dynamics of the rare-earth market today.\n</p><p>\n<strong>Sagawa:</strong> I think it’s impossible to produce high-grade magnet without rare earths. It’s concluded recently. There are very active research on an iron-nickel compound; it was promising. It has high-saturation magnetization and a very high anisotropy field. But I think, in recent research in Japan, it was concluded [that] it’s impossible to produce high-performance permanent magnet from this iron-nickel compound. And this is the last research subject on the rare-earth-free compound consisting of only 3D [orbital] -electron elements, iron-cobalt-nickel.\n</p>",
  "pubDate": "Tue, 21 Jun 2022 22:14:58 +0000",
  "guid": "https://spectrum.ieee.org/the-men-who-made-the-magnet-that-made-the-modern-world",
  "category": [
    "Magnets",
    "Magnetism",
    "Permanent magnets",
    "Neodymium permanent magnets",
    "History of technology"
  ],
  "dc:creator": "Glenn Zorpette",
  "media:content": ""
}