{
  "title": "Episode 77: &#8220;Brand New Cadillac&#8221; by Vince Taylor and the Playboys",
  "link": "https://500songs.com/podcast/episode-77-brand-new-cadillac-by-vince-taylor-and-the-playboys/",
  "pubDate": "Tue, 07 Apr 2020 14:36:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=487",
  "description": "Episode seventy-seven of&nbsp;<em>A History of Rock Music in Five Hundred Songs</em>&nbsp;looks at \"Brand New Cadillac\" by Vince Taylor and the Playboys, and the sad career of rock music's first acid casualty. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers have two bonus podcasts this week. There's a&nbsp;<a href=\"https://www.patreon.com/posts/35731669\">half-hour Q&A episode</a>, where I answer backers' questions, and a ten-minute bonus episode on&nbsp;<a href=\"https://www.patreon.com/posts/35731784\">\"The Hippy Hippy Shake\" by Chan Romero</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-77-brand-new-cadillac/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\nThere are several books available on Vince Taylor, including an autobiography, but sadly these are all in French, a language I don't speak past schoolboy level, so I can't say if they're any good.\n\nThe main resources I used for this episode were the liner notes for<a href=\"https://amzn.to/2xR7MXE\">&nbsp;this compilation CD of Taylor's best material</a>,&nbsp;&nbsp;<a href=\"https://web.archive.org/web/20070829195907/http://vince-taylor.ifrance.com/1aenglishv/e_summ.htm\">this archived copy of a twenty-year-old homepage by a friend of Taylor's</a>,&nbsp;<a href=\"http://vincetaylortheplayboys.blogspot.com/\">this blogged history of Taylor and the Playboys</a>, and&nbsp;<a href=\"https://www.bbc.co.uk/mediacentre/proginfo/2016/14/ziggy-stardust-came-from-isleworth\">this Radio 4 documentary on Taylor</a>. But *all* of these were riddled with errors, and I used dozens of other resources to try to straighten out the facts -- everything from a genealogy website to interviews with Tony Sheridan to the out-of-print autobiography of Joe Barbera. No doubt this episode still has errors in it, but I am fairly confident that it has fewer errors than anything else in English about Taylor on the Internet.\n\n<strong>Errata</strong>\n\nI say that Gene Vincent also appeared on&nbsp;<em>Oh Boy!</em>&nbsp;-- in fact he didn't appear on UK TV until Parnes' next show,&nbsp;<em>Boy Meets Girls</em>, which would mean Taylor was definitely the originator of that style.\n\nA major clanger -- I say that Sheridan recorded \"Why\" while he was working on \"Oh Boy!\" -- in fact this wasn't recorded until later -- *with the Beatles* as his backing band. I should have known that one, but it slipped my mind and I trusted my source, wrongly.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nOn the twenty-first of May 1965, at the Savoy Hotel in London, there was a party which would have two major effects on the history of rock and roll music, one which would be felt almost immediately, and one whose full ramifications wouldn't be seen for almost a decade. Bob Dylan was on the European tour which is chronicled in the film \"Don't Look Back\", and he'd just spent a week in Portugal. He'd come back to the UK, and the next day he was planning to film his first ever televised concert.\n\nThat plan was put on hold. Dylan was rushed to hospital the day after the party, with what was claimed to be food poisoning but has often been rumoured to be something else. He spent the next week in bed, back at the Savoy, attended by a private nurse, and during that time he wrote what he called \"a long piece of vomit around twenty pages long\". From that \"long piece of vomit\" he later extracted the lyrics to what became \"Like a Rolling Stone\".\n\nBut Dylan wasn't the only one who came out of that party feeling funny. Vince Taylor, a minor British rock and roller who'd never had much success over here but was big in France, was also there. There are no euphemisms about what it was that happened to him. He had dropped acid at the party, for the first time, and had liked it so much he'd immediately spent two hundred pounds on buying all the acid he could from the person who'd given it to him.\n\nThe next day, Taylor was meant to be playing a showcase gig. His brother-in-law, Joe Barbera of Hanna Barbera, owned a record label, and was considering signing Taylor. It could be the start of a comeback for him.\n\nInstead, it was the end of his career, and the start of a legend:\n\n[Excerpt: Vince Taylor and the Playboys, \"Brand New Cadillac\"]\n\nThere are two problems with telling the story of Vince Taylor. One is that he was a compulsive liar, who would make up claims like that he was related to Tenzing Norgay, the Nepalese mountaineer who was one of the two men who first climbed Everest, or that he was an airline pilot as a teenager. The other is that nobody who has written about Taylor has bothered to do even the most cursory fact-checking\n\nFor example, if you read any online articles about Vince Taylor at all, you see the same story about his upbringing -- he was born Brian Holden in the UK, he emigrated to New Jersey with his family in the forties, and then his sister Sheila met Joe Barbera, the co-creator of the Tom and Jerry cartoons. Sheila married him in 1955 and moved with him to Los Angeles -- and so the rest of the family also moved there, and Brian went to Hollywood High School. Barbera decided to manage his brother-in-law, bring him over to London to check out the British music scene, and get him a record deal.\n\nThere's just... a bit of a problem with this story. Sheila did marry Joe Barbera, but not until the mid 1960s. Her first marriage, in 1947, was to Joe Singer, and it was Singer, not Barbera, who was Taylor's first manager. That kind of inaccuracy appears all over the story of Vince Taylor\n\nSo, what we actually know is that Brian Maurice Holden -- or Maurice Brian Holden, even his birth name seems to be disputed -- was born in Isleworth Middlesex, and moved to New Jersey when he was seven, with his family, emigrating on the Mauretania, and that he came back to London in his late teens. While there was a real Hollywood High School, which Ricky Nelson among others had attended, I suspect it's as likely that Holden decided to just tell people that was where he'd been to school, because \"Hollywood High School\" would sound impressive to British people.\n\nAnd sounding impressive to British people was what Brian Holden had decided to base his career on. He claimed to an acquaintance, shortly after he returned to the UK, that he'd heard a Tommy Steele record while he was in the US, and had thought \"If this is rock and roll in England, we'll take them by storm!\"\n\n[Excerpt: Tommy Steele, \"Rock With the Caveman\"]\n\nHolden had been playing American Legion shows and similar small venues in the US, and when his brother-in-law Joe Singer came over to Britain on a business trip, Holden decided to tag along, and Singer became Holden's manager.\n\nHolden had three great advantages over British stars like Steele. He had spent long enough in America that he could tell people that he was American and they would believe him. In Britain in the 1950s, there were so few Americans that just being from that country was enough to make you a novelty, and Holden milked that for all it was worth, even though his accent, from the few bits of interviews I've heard with him, was pure London. He was also much, much better looking than almost all the British rock and roll stars. Because of rationing and general poverty in the UK in the forties and fifties as a result of the war, the British fifties teenage generation were on the whole rather scrawny, pasty-looking, and undernourished, with bad complexions, bad teeth, and a general haggardness that meant that even teen idols like Dickie Pride, Tommy Steele, or Marty Wilde were not, by modern standards, at all good looking.\n\nBrian Holden, on the other hand, had film-star good looks. He had a chiselled jaw, thick black hair combed into a quiff, and a dazzling smile showing Hollywood-perfect teeth. I am the farthest thing there is from a judge of male beauty, but of all the fifties rock and roll stars, the only one who was better looking than him was Elvis, and even Elvis had to grow into his good looks, while Holden, even when he came to the UK aged eighteen, looked like a cross between James Dean and Rock Hudson.\n\nAnd finally, he had a real sense of what rock and roll was, in a way that almost none of the British musicians did. He knew, in particular, what a rockabilly record should sound like.\n\nHe did have one tiny drawback, though -- he couldn't sing in tune, or keep time. But nobody except the unfortunate musicians who ended up backing him saw that as a particular problem.\n\nBeing unable to sing was a minor matter. He had presence, and he was going to be a star. Everyone knew it. He started performing at the 2Is, and he put together a band which had a rather fluid membership that to start with featured Tony Meehan, a drummer who had been in the Vipers Skiffle Group and would later join the Shadows, but by the time he got a record deal consisted of four of the regular musicians from the 2is -- Tony Sheridan on lead guitar, Tony Harvey on rhythm, Licorice Locking on bass and Brian Bennett on drums.\n\nHe also got himself a new name, and once again there seems to be some doubt as to how the name was chosen. Everyone seems agreed that \"Taylor\" was suggested by his sister Sheila, after the actor Robert Taylor. But there are three different plausible stories for how he became Vince. The first is that he named himself after Vince Everett, Elvis' character in Jailhouse Rock. The second is that he was named after Gene Vincent. And the third is that he took the name from a pack of Pall Mall cigarettes, which had a logo with the Latin motto \"in hoc signo vinces\" -- that last word spelled the same way as \"Vinces\".\n\nAnd while I've never seen this suggestion made anywhere else, there is also the coincidence that both Licorice Locking and Tony Sheridan had been playing, with Jimmy Nicol, in the Vagabonds, the backing band for one of Larry Parnes' teen idol acts, Vince Eager, who had made one EP before the Vagabonds had split from him:\n\n[Excerpt: Vince Eager, \"Yea Yea\"]\n\nSo it may be that the similarity of names was in someone's mind as well.\n\nTaylor and his band, named the Playboys, made a huge impression at the 2is, and they were soon signed to Parlophone Records, and in November 1958 they released their first single. Both sides of the single were cover versions of relatively obscure releases on Sun records. The B-side was a cover version of \"I Like Love\", which had been written by Jack Clement for Roy Orbison, while the A-side, \"Right Behind You Baby\" was written by Charlie Rich and originally recorded by Ray Smith:\n\n[Excerpt: Ray Smith, \"Right Behind You Baby\"]\n\nTaylor's version was the closest thing to an American rockabilly record that had been made in Britain to that point. While the vocal was still nothing special, and the recording techniques in British studios created a more polite sound than their American equivalents, the performance is bursting with energy:\n\n[Excerpt: Vince Taylor, \"Right Behind You Baby\"]\n\nIt's Sheridan, though, who really makes the record -- he plays a twenty-four bar guitar solo that is absolute light years ahead of anything else that was being done in Britain. Here, for example, is \"Guitar Boogie Shuffle\", an instrumental hit from Britain's top rock and roll guitarist of the time, Bert Weedon:\n\n[Excerpt: Bert Weedon, \"Guitar Boogie Shuffle\"]\n\nAs you can hear, that's a perfectly good guitar instrumental, very pleasant, very well played. Now listen to Tony Sheridan's guitar solo on \"Right Behind You Baby\":\n\n[Excerpt: Vince Taylor, \"Right Behind You Baby\"]\n\nThat's clearly not as technically skilled as Weedon, but it's also infinitely more exciting, and it's more exciting than anything that was being made by any other British musicians at the time.\n\nJack Good certainly thought so. While \"Right Behind You Baby\" wasn't a hit, it was enough to get Vince on to Oh Boy!, and it was because of his Oh Boy! performances that Vince switched to the look he would keep for the rest of his career -- black leather trousers, a black leather jacket, a black shirt with the top few buttons undone, showing his chest and the medallion he always wore, and black leather gloves. It was a look very similar to that which Gene Vincent also adopted for his performances on Oh Boy! -- before that, Vincent had been dressing in a distinctly less memorable style -- and I've seen differing accounts as to which act took on the style first, though both made it their own.\n\nTaylor was memorable enough in this getup that when, in the early seventies, another faded rocker who had been known as Shane Fenton made a comeback as a glam-rocker under the name Alvin Stardust, he copied Taylor's dress exactly.\n\nBut Good was unimpressed with Taylor's performance -- and very impressed with Sheridan's. Sheridan was asked to join the Oh Boy! house band, as well as performing under his own name as Tony Sheridan and the Wreckers. He found himself playing on such less-than-classics as \"Happy Organ\" by Cherry Wainer:\n\n[Excerpt: Cherry Wainer, \"The Happy Organ\"]\n\nHe also released his own solo record, \"Why\":\n\n[Excerpt: Tony Sheridan, \"Why\"]\n\nBut Sheridan's biggest impact on popular music wouldn't come along for another few years...\n\nLosing the most innovative guitarist in the British music industry should have been a death-blow to Taylor's career, but he managed to find the only other guitarist in Britain at that time who might be considered up to Sheridan's standard, Joe Moretti -- who Taylor nicknamed Scotty Moretti, partly because Moretti was Scottish, but mostly because it would make his name similar to that of Scotty Moore, Elvis' guitarist, and Taylor could shout out \"take it, Scotty!\" on the solos.\n\nWhile Sheridan's style was to play frantic Chuck Berry-style licks, Moretti was a more controlled guitarist, but just as inventive, and he had a particular knack for coming up with riffs. And he showed that knack on Taylor's next single, the first to be credited to Vince Taylor and the Playboys, rather than just to Vince Taylor.\n\nThe A-side of that single was rather poor -- a cover version of Johnny Ace's \"Pledging My Love\", which was done no favours by Taylor's vocal:\n\n[Excerpt: Vince Taylor and the Playboys, \"Pledging My Love\"]\n\nBut it was the B-side that was to become a classic. From the stories told by the band members, it seems that everyone knew that that song -- one written by Taylor, who otherwise barely ever wrote songs, preferring to perform cover versions -- was something special. But the song mentioned two different brand names, Cadillac and Ford, and the BBC at that time had a ban on playing any music which mentioned a brand name at all.\n\nSo \"Brand New Cadillac\" became a B-side, but it's undoubtedly the most thrilling B-side by a British performer of the fifties, and arguably the only true fifties rock and roll classic by a British artist. \"Move It\" by Cliff Richard had been a good record by British standards -- \"Brand New Cadillac\" was a great record by any standards:\n\n[Excerpt: Vince Taylor and the Playboys, \"Brand New Cadillac\"]\n\nUnfortunately, because \"Pledging My Love\" was the A-side, the record sold almost nothing, and didn't make the charts. After two flops in a row, Parlophone dropped Vince Taylor and the Playboys, and Taylor went back to performing at the 2Is with whatever random collection of musicians he could get together. Brian Bennett and Licorice Locking, meanwhile, went on to join Marty Wilde's band the Wildcats, and scored an immediate hit with Wilde's rather decent cover version of Dion and the Belmonts' \"Teenager in Love\":\n\n[Excerpt: Marty Wilde and the Wildcats, \"Teenager in Love\"]\n\nMoretti, Locking, and Bennett will all turn up in our story in future episodes.\n\nTaylor's career seemed to be over before it had really begun, but then he got a second chance. Palette Records was a small label, based in Belgium, which was starting operations in Britain. They didn't have any big stars, but they had signed Janis Martin, who we talked about back in episode forty, and in August 1960 they put out her single \"Here Today and Gone Tomorrow Love\":\n\n[Excerpt: Janis Martin, \"Here Today and Gone Tomorrow Love\"]\n\nAnd at the same time, they put out a new single by Vince Taylor, with a new lineup of Playboys. The A-side was a fairly uninspired ballad called \"I'll Be Your Hero\", very much in the style of Elvis' film songs, but they soon switched to promoting the flip side, \"Jet Black Machine\", which was much more in Taylor's style. It wasn't up to the standards of \"Brand New Cadillac\", but it was still far more exciting than most of the records that were being made in the UK at the time:\n\n[Excerpt: Vince Taylor and the Playboys, \"Jet Black Machine\"]\n\nThat seemed like it would be a turning point in Taylor's career -- according to one source I've read, it made the top twenty on the NME charts, though I haven't been able to check those charts myself, and given how unreliable literally everything I've read about Taylor is, I don't entirely trust that. But it was definitely more successful than his two previous singles, and the new lineup of Playboys were booked on a package tour of acts from the 2Is. Things seemed like they were about to start going Taylor's way.\n\nBut Taylor had always been a little erratic, and he started to get almost pathologically jealous. He would phone his girlfriend up every night before going on stage, and if she didn't answer he'd skip the show, to drive to her house and find out what she was doing. And in November 1960, just before the start of the tour, he skipped out on the tour altogether and headed back to visit his family in the States.\n\nThe band carried on without him, and became the backing group for Duffy Power, one of the many acts managed by Larry Parnes. Power desperately wanted to be a blues singer, but he was pushed into recording cover versions of American hits, like this one, which came out shortly after the Playboys joined him:\n\n[Excerpt: Duffy Power, \"Whole Lotta Shakin' Goin' On\"]\n\nThe Playboys continued to back Power until June 1960, when they had a gig in Guildford, and a remarkable coincidence happened. They were unloading their equipment at the 2Is, to drive to Guildford with it, when Taylor walked round the corner. He'd just got back from the USA and happened to be passing, and they invited him along for the drive to the show. He came with them, and then Duffy Power, who was almost as unreliable as Taylor, didn't turn up for the show. They invited Taylor to perform in his place, and he did, and blew the audience away.\n\nPower eventually turned up half-way through the show, got angry, punched the drummer in the face during the interval, and drove off again. The drummer got two stitches, and then they finished the show.\n\nTaylor was back with the Playboys, and Duffy Power was out, and so the next month when Power was booked for some shows in Paris, on a bill with Vince Eager and Wee Willie Harris, Taylor took his place there, too. France was about as far behind Britain in rock and roll terms as Britain was behind America, and no-one had ever seen anything like Vince Taylor. Taylor and the Playboys got signed to a French label, Barclay Records, and they became huge stars -- Taylor did indeed get himself a brand new Cadillac, a pink one just like Elvis had. Taylor got nicknamed \"le diable noir\" -- the black Devil -- for his demonic stage presence, and he inspired riots regularly with his shows.\n\nA review of one of his performances at that time may be of interest to some listeners:\n\n\"The atmosphere is like many a night club, but the teenagers stand round the dancing floor which you use as a stage. They jump on a woman with gold trousers and a hand microphone and then hit a man when he says \"go away.\" A group follows, and so do others, playing 'Apache' worse than many other bands. When the singer joins the band, the leather jacket fiends who are the audience, join in dancing and banging tables with chairs.\n\nThe singers have to go one better than the audience, so they lie on the floor, or jump on a passing drummer, or kiss a guitar, and then hit the man playing it. The crowd enjoy this and many stand on chairs to see the fun, and soon the audience are all singing and shouting like one man, but he didn't mind.\n\nVince (Ron, Ron) Taylor finally appeared and joined the fun, and in the end he had so much fun that he had to rest. But in spite of this it had been a wonderful show, lovely show...lovely.\"\n\nThat was written by a young man from Liverpool named Paul McCartney, who was visiting Paris with his friend John Lennon for Lennon's twenty-first birthday. The two attended one of Taylor's shows there, and McCartney sent that review back to run in Mersey Beat, a local music paper. Lennon and McCartney also met Taylor, with whom they had a mutual friend, Tony Sheridan, and tried to blag their way onto the show themselves, but got turned down. While they were in Paris, they also got their hair cut in a new style, to copy the style that was fashionable among Parisian bohemians. When they got back to Liverpool everyone laughed at their new mop-top hairdos...\n\nTaylor kept making records while he was in Paris, mostly cover versions of American hits. Probably the best is his version of Chuck Willis' \"Whatcha Gonna Do?\":\n\n[Excerpt: Vince Taylor et ses Play-Boys, \"Watcha Gonna Do (When Your Baby Leaves You)?\"]\n\nBut while Taylor was now a big star, his behaviour was becoming ever more erratic, not helped by the amphetamines he was taking to keep himself going during shows. The group quit en masse in November 1962, but he persuaded them back so they could play a two-week residency at the Star Club in Hamburg, before a group from Liverpool called the Beatles took over for Christmas.\n\nBut Taylor only lasted four days of that two-week residency. Just before midnight on the fifth night, just before they were about to go on, he phoned his girlfriend in Paris, got no answer, decided she was out cheating on him, and flew off to Paris instead of playing the show. He phoned the club's manager the next day to apologise and say he'd be back for that night's show, but Horst Fascher, the manager, wasn't as forgiving of Taylor as most promoters had been, and said that he'd shoot Taylor dead if he ever saw him again. The residency was cancelled, and the Playboys had to sell their mohair suits to Cliff Bennett and the Rebel Rousers to pay for their fare back to Paris.\n\nFor the next few years, Taylor put out a series of fairly poor records with different backing groups, often singing sickly French-language ballads with orchestral backings. He tried gimmicks like changing from his black leather costume into a white leather one, but nothing seemed to work. His money was running out, but then he had one more opportunity to hit the big time again.\n\nBobby Woodman, the drummer from the second lineup of the Playboys, had been playing with Johnny Hallyday, France's biggest rock and roll star, under the stage name Bobbie Clarke, but then Hallyday was drafted and his band needed work. They got together with Taylor, and as Vince Taylor and the Bobbie Clarke Noise they recorded an EP of blues and rock covers that included a version of the Arthur Crudup song made famous by Elvis, \"My Baby Left Me\". It was a quite extraordinary record, his best since \"Brand New Cadillac\" seven years earlier:\n\n[Excerpt: Vince Taylor and the Bobbie Clarke Noise, \"My Baby Left Me\"]\n\nThey played the Paris Olympia again, this time supporting the Rolling Stones. Vince Taylor was on his way to the top again. And they had the prospect of an American record deal -- Taylor's sister Sheila had married Joe Barbera, and he'd started up a new label and was interested in signing Taylor. They arranged a showcase gig for him, and everyone thought this could be the big time.\n\nBut before that, he had to make a quick trip to the UK. The group were owed money by a business associate there, and so Taylor went over to collect the money, and while he was there he went to Bob Dylan's party, and dropped acid for the first time. And that was the end of Vince Taylor's career.\n\nOne of the things that goes completely unreported about the British teen idols of the fifties is that for whatever reason, and I can't know for sure, there was a very high incidence of severe mental illness among them -- an astonishingly high incidence given how few of them there were. Terry Dene was invalided out of the Army with mental health problems shortly after he was drafted. Duffy Power attempted suicide in the early sixties, and had recurrent mental health problems for many years. And Dickie Pride, who his peers thought was the most talented of the lot, ended up dead aged twenty-seven, after having spent time in a psychiatric hospital and suffering so badly he was lobotomised.\n\nVince Taylor was the one whose mental problems have had the most publicity, but much of that has made his illness seem somehow glamorous or entertaining, so I want to emphasise that it was anything but. I spent several years working on a psychiatric ward, and have seen enough people with the same condition that Taylor had that I have no sense of humour about this subject at all. The rest of this podcast is about a man who was suffering horribly.\n\nTaylor had always been unstable -- he had been paranoid and controlling, he had a tendency to make up lies about himself and act as if he believed them, and he led a chaotic lifestyle. And while normally LSD is safe even if taken relatively often, Taylor's first acid trip was the last straw for his fragile mental health.\n\nHe turned up at the showcase gig unshaven, clutching a bottle of Mateus wine, and announced to everyone that he was Mateus, the new Jesus, the son of God. When asked if he had the band's money, he pulled out a hundred and fifty francs and set fire to it, ranting about how Jesus had turfed the money-lenders out of the temple. An ambulance was called, and the band did the show without him.\n\nThey had a gig the next day, and Taylor turned up clean-shaven, smartly dressed, and seemingly normal. He apologised for his behaviour the night before, saying he'd \"felt a bit strange\" but was better now. But when they got to the club and he saw the sign saying \"Vince Taylor and the Bobbie Clarke Noise\", he crossed \"Vince Taylor\" out, and wrote \"Mateus\" in a felt pen. During the show, instead of singing, he walked through the crowd, anointing them with water.\n\nHe spent the next decade in and out of hospital, occasionally touring and recording, but often unable to work. But while he was unwell, \"Brand New Cadillac\" found a new audience. Indeed, it found several audiences. The Hep Stars, a band from Sweden who featured a pre-ABBA Benny Andersson, had a number one hit in Sweden with their reworking of it, just titled \"Cadillac\", in 1965, just a month before Taylor's breakdown:\n\n[Excerpt: Hep Stars, \"Cadillac\"]\n\nIn 1971, Mungo Jerry reworked the song as \"Baby Jump\", which went to number one in the UK, though they didn't credit Taylor:\n\n[Excerpt: Mungo Jerry, \"Baby Jump\"]\n\nAnd in 1979, the Clash recorded a version of it for their classic double-album London Calling:\n\n[Excerpt: The Clash, \"Brand New Cadillac\"]\n\nShortly after recording that, Joe Strummer of the Clash met up with Taylor, who spent five hours explaining to Strummer how the Duke and Duchess of Windsor were trying to kill him with poisoned chocolate cake.\n\nTaylor at that time was still making music, and trying to latch on to whatever the latest trend was, as in his 1982 single \"Space Invaders\", inspired by the arcade game:\n\n[Excerpt: Vince Taylor, \"Space Invaders\"]\n\nBut the new music he was making was almost an irrelevance -- by this point he had become a legend in the British music industry, not for who he was in 1982, but for who he was in 1958, and he has had songs written about him by people as diverse as Adam Ant and Van Morrison. But his biggest influence came in the years immediately after his breakdown.\n\nBetween 1966 and 1972, Taylor spent much of his time in London, severely mentally ill, but trying to have some kind of social life based on his past glories, reminding people that he had once been a star. One of the people he got to know in London in the mid-sixties was a young musician named David Jones. Jones was fascinated by Taylor, even though he'd never liked his music -- Jones' brother was schizophrenic, and he was worried that he would end up like his brother. Jones also wanted to be a rock and roll star, and had some mildly messianic ideas of his own. So a rock and roll star who thought he was Jesus -- although he sometimes thought he was an alien, rather than Jesus, and sometimes claimed that Jesus *was* an alien -- and who was clearly severely mentally ill, had a fascination for him. He talked later about not having been able to decide whether he was seeing Taylor as an example to follow or a cautionary tale, and about how he'd sat with Taylor outside Charing Cross Station while Taylor had used a magnifying glass and a map of Europe to show him all the sites where aliens were going to land.\n\nSeveral years later, after changing his name to David Bowie, Jones remembered the story of Vince Taylor, the rock and roll star who thought he was an alien messiah, and turned it into the story of Ziggy Stardust:\n\n[Excerpt: David Bowie, \"Ziggy Stardust\"]\n\nIn 1983, Taylor retired to Switzerland with his new wife Nathalie. He changed his name back to Brian Holden, and while he would play the occasional gig, he tried as best he could to forget his past, and seems to have recovered somewhat from his mental illness. In 1991 he was diagnosed with cancer, and died of it three months later. Shortly before he died, he told a friend \"If I die, you can tell them that the only period in my life where I was really happy was my life in Switzerland\".",
  "itunes:subtitle": "Episode seventy-seven of&nbsp;A History of Rock Music in Five Hundred Songs&nbsp;looks at Brand New Cadillac by Vince Taylor and the Playboys, and the sad career of rock musics first acid casualty. Click the full post to read liner notes, links to more i",
  "itunes:keywords": "2is,Alvin Stardust,Benny Andersson,Bert Weedon,Bob Dylan,Brian Bennett,British rock,Cherry Wainer,David Bowie,Duffy Power,Hamburg,Hanna Barbera,Jack Good,Jimmy Nicol,Joe Moretti,Joe Strummer,John Lennon,Larry Parnes,Licorice Locking,Marty Wilde,Mungo Jerry,Oh Boy,Parlophone,Paul McCartney,Terry Dene,The Clash,The Hep Stars,The Vipers Skiffle Group,Tommy Steele,Tony Meehan,Tony Sheridan,Vince Eager,Vince Taylor",
  "itunes:episodeType": "full",
  "itunes:episode": 77,
  "content:encoded": "Episode seventy-seven of&nbsp;<em>A History of Rock Music in Five Hundred Songs</em>&nbsp;looks at \"Brand New Cadillac\" by Vince Taylor and the Playboys, and the sad career of rock music's first acid casualty. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers have two bonus podcasts this week. There's a&nbsp;<a href=\"https://www.patreon.com/posts/35731669\">half-hour Q&A episode</a>, where I answer backers' questions, and a ten-minute bonus episode on&nbsp;<a href=\"https://www.patreon.com/posts/35731784\">\"The Hippy Hippy Shake\" by Chan Romero</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-77-brand-new-cadillac/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\nThere are several books available on Vince Taylor, including an autobiography, but sadly these are all in French, a language I don't speak past schoolboy level, so I can't say if they're any good.\n\nThe main resources I used for this episode were the liner notes for<a href=\"https://amzn.to/2xR7MXE\">&nbsp;this compilation CD of Taylor's best material</a>,&nbsp;&nbsp;<a href=\"https://web.archive.org/web/20070829195907/http://vince-taylor.ifrance.com/1aenglishv/e_summ.htm\">this archived copy of a twenty-year-old homepage by a friend of Taylor's</a>,&nbsp;<a href=\"http://vincetaylortheplayboys.blogspot.com/\">this blogged history of Taylor and the Playboys</a>, and&nbsp;<a href=\"https://www.bbc.co.uk/mediacentre/proginfo/2016/14/ziggy-stardust-came-from-isleworth\">this Radio 4 documentary on Taylor</a>. But *all* of these were riddled with errors, and I used dozens of other resources to try to straighten out the facts -- everything from a genealogy website to interviews with Tony Sheridan to the out-of-print autobiography of Joe Barbera. No doubt this episode still has errors in it, but I am fairly confident that it has fewer errors than anything else in English about Taylor on the Internet.\n\n<strong>Errata</strong>\n\nI say that Gene Vincent also appeared on&nbsp;<em>Oh Boy!</em>&nbsp;-- in fact he didn't appear on UK TV until Parnes' next show,&nbsp;<em>Boy Meets Girls</em>, which would mean Taylor was definitely the originator of that style.\n\nA major clanger -- I say that Sheridan recorded \"Why\" while he was working on \"Oh Boy!\" -- in fact this wasn't recorded until later -- *with the Beatles* as his backing band. I should have known that one, but it slipped my mind and I trusted my source, wrongly.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nOn the twenty-first of May 1965, at the Savoy Hotel in London, there was a party which would have two major effects on the history of rock and roll music, one which would be felt almost immediately, and one whose full ramifications wouldn't be seen for almost a decade. Bob Dylan was on the European tour which is chronicled in the film \"Don't Look Back\", and he'd just spent a week in Portugal. He'd come back to the UK, and the next day he was planning to film his first ever televised concert.\n\nThat plan was put on hold. Dylan was rushed to hospital the day after the party, with what was claimed to be food poisoning but has often been rumoured to be something else. He spent the next week in bed, back at the Savoy, attended by a private nurse, and during that time he wrote what he called \"a long piece of vomit around twenty pages long\". From that \"long piece of vomit\" he later extracted the lyrics to what became \"Like a Rolling Stone\".\n\nBut Dylan wasn't the only one who came out of that party feeling funny. Vince Taylor, a minor British rock and roller who'd never had much success over here but was big in France, was also there. There are no euphemisms about what it was that happened to him. He had dropped acid at the party, for the first time, and had liked it so much he'd immediately spent two hundred pounds on buying all the acid he could from the person who'd given it to him.\n\nThe next day, Taylor was meant to be playing a showcase gig. His brother-in-law, Joe Barbera of Hanna Barbera, owned a record label, and was considering signing Taylor. It could be the start of a comeback for him.\n\nInstead, it was the end of his career, and the start of a legend:\n\n[Excerpt: Vince Taylor and the Playboys, \"Brand New Cadillac\"]\n\nThere are two problems with telling the story of Vince Taylor. One is that he was a compulsive liar, who would make up claims like that he was related to Tenzing Norgay, the Nepalese mountaineer who was one of the two men who first climbed Everest, or that he was an airline pilot as a teenager. The other is that nobody who has written about Taylor has bothered to do even the most cursory fact-checking\n\nFor example, if you read any online articles about Vince Taylor at all, you see the same story about his upbringing -- he was born Brian Holden in the UK, he emigrated to New Jersey with his family in the forties, and then his sister Sheila met Joe Barbera, the co-creator of the Tom and Jerry cartoons. Sheila married him in 1955 and moved with him to Los Angeles -- and so the rest of the family also moved there, and Brian went to Hollywood High School. Barbera decided to manage his brother-in-law, bring him over to London to check out the British music scene, and get him a record deal.\n\nThere's just... a bit of a problem with this story. Sheila did marry Joe Barbera, but not until the mid 1960s. Her first marriage, in 1947, was to Joe Singer, and it was Singer, not Barbera, who was Taylor's first manager. That kind of inaccuracy appears all over the story of Vince Taylor\n\nSo, what we actually know is that Brian Maurice Holden -- or Maurice Brian Holden, even his birth name seems to be disputed -- was born in Isleworth Middlesex, and moved to New Jersey when he was seven, with his family, emigrating on the Mauretania, and that he came back to London in his late teens. While there was a real Hollywood High School, which Ricky Nelson among others had attended, I suspect it's as likely that Holden decided to just tell people that was where he'd been to school, because \"Hollywood High School\" would sound impressive to British people.\n\nAnd sounding impressive to British people was what Brian Holden had decided to base his career on. He claimed to an acquaintance, shortly after he returned to the UK, that he'd heard a Tommy Steele record while he was in the US, and had thought \"If this is rock and roll in England, we'll take them by storm!\"\n\n[Excerpt: Tommy Steele, \"Rock With the Caveman\"]\n\nHolden had been playing American Legion shows and similar small venues in the US, and when his brother-in-law Joe Singer came over to Britain on a business trip, Holden decided to tag along, and Singer became Holden's manager.\n\nHolden had three great advantages over British stars like Steele. He had spent long enough in America that he could tell people that he was American and they would believe him. In Britain in the 1950s, there were so few Americans that just being from that country was enough to make you a novelty, and Holden milked that for all it was worth, even though his accent, from the few bits of interviews I've heard with him, was pure London. He was also much, much better looking than almost all the British rock and roll stars. Because of rationing and general poverty in the UK in the forties and fifties as a result of the war, the British fifties teenage generation were on the whole rather scrawny, pasty-looking, and undernourished, with bad complexions, bad teeth, and a general haggardness that meant that even teen idols like Dickie Pride, Tommy Steele, or Marty Wilde were not, by modern standards, at all good looking.\n\nBrian Holden, on the other hand, had film-star good looks. He had a chiselled jaw, thick black hair combed into a quiff, and a dazzling smile showing Hollywood-perfect teeth. I am the farthest thing there is from a judge of male beauty, but of all the fifties rock and roll stars, the only one who was better looking than him was Elvis, and even Elvis had to grow into his good looks, while Holden, even when he came to the UK aged eighteen, looked like a cross between James Dean and Rock Hudson.\n\nAnd finally, he had a real sense of what rock and roll was, in a way that almost none of the British musicians did. He knew, in particular, what a rockabilly record should sound like.\n\nHe did have one tiny drawback, though -- he couldn't sing in tune, or keep time. But nobody except the unfortunate musicians who ended up backing him saw that as a particular problem.\n\nBeing unable to sing was a minor matter. He had presence, and he was going to be a star. Everyone knew it. He started performing at the 2Is, and he put together a band which had a rather fluid membership that to start with featured Tony Meehan, a drummer who had been in the Vipers Skiffle Group and would later join the Shadows, but by the time he got a record deal consisted of four of the regular musicians from the 2is -- Tony Sheridan on lead guitar, Tony Harvey on rhythm, Licorice Locking on bass and Brian Bennett on drums.\n\nHe also got himself a new name, and once again there seems to be some doubt as to how the name was chosen. Everyone seems agreed that \"Taylor\" was suggested by his sister Sheila, after the actor Robert Taylor. But there are three different plausible stories for how he became Vince. The first is that he named himself after Vince Everett, Elvis' character in Jailhouse Rock. The second is that he was named after Gene Vincent. And the third is that he took the name from a pack of Pall Mall cigarettes, which had a logo with the Latin motto \"in hoc signo vinces\" -- that last word spelled the same way as \"Vinces\".\n\nAnd while I've never seen this suggestion made anywhere else, there is also the coincidence that both Licorice Locking and Tony Sheridan had been playing, with Jimmy Nicol, in the Vagabonds, the backing band for one of Larry Parnes' teen idol acts, Vince Eager, who had made one EP before the Vagabonds had split from him:\n\n[Excerpt: Vince Eager, \"Yea Yea\"]\n\nSo it may be that the similarity of names was in someone's mind as well.\n\nTaylor and his band, named the Playboys, made a huge impression at the 2is, and they were soon signed to Parlophone Records, and in November 1958 they released their first single. Both sides of the single were cover versions of relatively obscure releases on Sun records. The B-side was a cover version of \"I Like Love\", which had been written by Jack Clement for Roy Orbison, while the A-side, \"Right Behind You Baby\" was written by Charlie Rich and originally recorded by Ray Smith:\n\n[Excerpt: Ray Smith, \"Right Behind You Baby\"]\n\nTaylor's version was the closest thing to an American rockabilly record that had been made in Britain to that point. While the vocal was still nothing special, and the recording techniques in British studios created a more polite sound than their American equivalents, the performance is bursting with energy:\n\n[Excerpt: Vince Taylor, \"Right Behind You Baby\"]\n\nIt's Sheridan, though, who really makes the record -- he plays a twenty-four bar guitar solo that is absolute light years ahead of anything else that was being done in Britain. Here, for example, is \"Guitar Boogie Shuffle\", an instrumental hit from Britain's top rock and roll guitarist of the time, Bert Weedon:\n\n[Excerpt: Bert Weedon, \"Guitar Boogie Shuffle\"]\n\nAs you can hear, that's a perfectly good guitar instrumental, very pleasant, very well played. Now listen to Tony Sheridan's guitar solo on \"Right Behind You Baby\":\n\n[Excerpt: Vince Taylor, \"Right Behind You Baby\"]\n\nThat's clearly not as technically skilled as Weedon, but it's also infinitely more exciting, and it's more exciting than anything that was being made by any other British musicians at the time.\n\nJack Good certainly thought so. While \"Right Behind You Baby\" wasn't a hit, it was enough to get Vince on to Oh Boy!, and it was because of his Oh Boy! performances that Vince switched to the look he would keep for the rest of his career -- black leather trousers, a black leather jacket, a black shirt with the top few buttons undone, showing his chest and the medallion he always wore, and black leather gloves. It was a look very similar to that which Gene Vincent also adopted for his performances on Oh Boy! -- before that, Vincent had been dressing in a distinctly less memorable style -- and I've seen differing accounts as to which act took on the style first, though both made it their own.\n\nTaylor was memorable enough in this getup that when, in the early seventies, another faded rocker who had been known as Shane Fenton made a comeback as a glam-rocker under the name Alvin Stardust, he copied Taylor's dress exactly.\n\nBut Good was unimpressed with Taylor's performance -- and very impressed with Sheridan's. Sheridan was asked to join the Oh Boy! house band, as well as performing under his own name as Tony Sheridan and the Wreckers. He found himself playing on such less-than-classics as \"Happy Organ\" by Cherry Wainer:\n\n[Excerpt: Cherry Wainer, \"The Happy Organ\"]\n\nHe also released his own solo record, \"Why\":\n\n[Excerpt: Tony Sheridan, \"Why\"]\n\nBut Sheridan's biggest impact on popular music wouldn't come along for another few years...\n\nLosing the most innovative guitarist in the British music industry should have been a death-blow to Taylor's career, but he managed to find the only other guitarist in Britain at that time who might be considered up to Sheridan's standard, Joe Moretti -- who Taylor nicknamed Scotty Moretti, partly because Moretti was Scottish, but mostly because it would make his name similar to that of Scotty Moore, Elvis' guitarist, and Taylor could shout out \"take it, Scotty!\" on the solos.\n\nWhile Sheridan's style was to play frantic Chuck Berry-style licks, Moretti was a more controlled guitarist, but just as inventive, and he had a particular knack for coming up with riffs. And he showed that knack on Taylor's next single, the first to be credited to Vince Taylor and the Playboys, rather than just to Vince Taylor.\n\nThe A-side of that single was rather poor -- a cover version of Johnny Ace's \"Pledging My Love\", which was done no favours by Taylor's vocal:\n\n[Excerpt: Vince Taylor and the Playboys, \"Pledging My Love\"]\n\nBut it was the B-side that was to become a classic. From the stories told by the band members, it seems that everyone knew that that song -- one written by Taylor, who otherwise barely ever wrote songs, preferring to perform cover versions -- was something special. But the song mentioned two different brand names, Cadillac and Ford, and the BBC at that time had a ban on playing any music which mentioned a brand name at all.\n\nSo \"Brand New Cadillac\" became a B-side, but it's undoubtedly the most thrilling B-side by a British performer of the fifties, and arguably the only true fifties rock and roll classic by a British artist. \"Move It\" by Cliff Richard had been a good record by British standards -- \"Brand New Cadillac\" was a great record by any standards:\n\n[Excerpt: Vince Taylor and the Playboys, \"Brand New Cadillac\"]\n\nUnfortunately, because \"Pledging My Love\" was the A-side, the record sold almost nothing, and didn't make the charts. After two flops in a row, Parlophone dropped Vince Taylor and the Playboys, and Taylor went back to performing at the 2Is with whatever random collection of musicians he could get together. Brian Bennett and Licorice Locking, meanwhile, went on to join Marty Wilde's band the Wildcats, and scored an immediate hit with Wilde's rather decent cover version of Dion and the Belmonts' \"Teenager in Love\":\n\n[Excerpt: Marty Wilde and the Wildcats, \"Teenager in Love\"]\n\nMoretti, Locking, and Bennett will all turn up in our story in future episodes.\n\nTaylor's career seemed to be over before it had really begun, but then he got a second chance. Palette Records was a small label, based in Belgium, which was starting operations in Britain. They didn't have any big stars, but they had signed Janis Martin, who we talked about back in episode forty, and in August 1960 they put out her single \"Here Today and Gone Tomorrow Love\":\n\n[Excerpt: Janis Martin, \"Here Today and Gone Tomorrow Love\"]\n\nAnd at the same time, they put out a new single by Vince Taylor, with a new lineup of Playboys. The A-side was a fairly uninspired ballad called \"I'll Be Your Hero\", very much in the style of Elvis' film songs, but they soon switched to promoting the flip side, \"Jet Black Machine\", which was much more in Taylor's style. It wasn't up to the standards of \"Brand New Cadillac\", but it was still far more exciting than most of the records that were being made in the UK at the time:\n\n[Excerpt: Vince Taylor and the Playboys, \"Jet Black Machine\"]\n\nThat seemed like it would be a turning point in Taylor's career -- according to one source I've read, it made the top twenty on the NME charts, though I haven't been able to check those charts myself, and given how unreliable literally everything I've read about Taylor is, I don't entirely trust that. But it was definitely more successful than his two previous singles, and the new lineup of Playboys were booked on a package tour of acts from the 2Is. Things seemed like they were about to start going Taylor's way.\n\nBut Taylor had always been a little erratic, and he started to get almost pathologically jealous. He would phone his girlfriend up every night before going on stage, and if she didn't answer he'd skip the show, to drive to her house and find out what she was doing. And in November 1960, just before the start of the tour, he skipped out on the tour altogether and headed back to visit his family in the States.\n\nThe band carried on without him, and became the backing group for Duffy Power, one of the many acts managed by Larry Parnes. Power desperately wanted to be a blues singer, but he was pushed into recording cover versions of American hits, like this one, which came out shortly after the Playboys joined him:\n\n[Excerpt: Duffy Power, \"Whole Lotta Shakin' Goin' On\"]\n\nThe Playboys continued to back Power until June 1960, when they had a gig in Guildford, and a remarkable coincidence happened. They were unloading their equipment at the 2Is, to drive to Guildford with it, when Taylor walked round the corner. He'd just got back from the USA and happened to be passing, and they invited him along for the drive to the show. He came with them, and then Duffy Power, who was almost as unreliable as Taylor, didn't turn up for the show. They invited Taylor to perform in his place, and he did, and blew the audience away.\n\nPower eventually turned up half-way through the show, got angry, punched the drummer in the face during the interval, and drove off again. The drummer got two stitches, and then they finished the show.\n\nTaylor was back with the Playboys, and Duffy Power was out, and so the next month when Power was booked for some shows in Paris, on a bill with Vince Eager and Wee Willie Harris, Taylor took his place there, too. France was about as far behind Britain in rock and roll terms as Britain was behind America, and no-one had ever seen anything like Vince Taylor. Taylor and the Playboys got signed to a French label, Barclay Records, and they became huge stars -- Taylor did indeed get himself a brand new Cadillac, a pink one just like Elvis had. Taylor got nicknamed \"le diable noir\" -- the black Devil -- for his demonic stage presence, and he inspired riots regularly with his shows.\n\nA review of one of his performances at that time may be of interest to some listeners:\n\n\"The atmosphere is like many a night club, but the teenagers stand round the dancing floor which you use as a stage. They jump on a woman with gold trousers and a hand microphone and then hit a man when he says \"go away.\" A group follows, and so do others, playing 'Apache' worse than many other bands. When the singer joins the band, the leather jacket fiends who are the audience, join in dancing and banging tables with chairs.\n\nThe singers have to go one better than the audience, so they lie on the floor, or jump on a passing drummer, or kiss a guitar, and then hit the man playing it. The crowd enjoy this and many stand on chairs to see the fun, and soon the audience are all singing and shouting like one man, but he didn't mind.\n\nVince (Ron, Ron) Taylor finally appeared and joined the fun, and in the end he had so much fun that he had to rest. But in spite of this it had been a wonderful show, lovely show...lovely.\"\n\nThat was written by a young man from Liverpool named Paul McCartney, who was visiting Paris with his friend John Lennon for Lennon's twenty-first birthday. The two attended one of Taylor's shows there, and McCartney sent that review back to run in Mersey Beat, a local music paper. Lennon and McCartney also met Taylor, with whom they had a mutual friend, Tony Sheridan, and tried to blag their way onto the show themselves, but got turned down. While they were in Paris, they also got their hair cut in a new style, to copy the style that was fashionable among Parisian bohemians. When they got back to Liverpool everyone laughed at their new mop-top hairdos...\n\nTaylor kept making records while he was in Paris, mostly cover versions of American hits. Probably the best is his version of Chuck Willis' \"Whatcha Gonna Do?\":\n\n[Excerpt: Vince Taylor et ses Play-Boys, \"Watcha Gonna Do (When Your Baby Leaves You)?\"]\n\nBut while Taylor was now a big star, his behaviour was becoming ever more erratic, not helped by the amphetamines he was taking to keep himself going during shows. The group quit en masse in November 1962, but he persuaded them back so they could play a two-week residency at the Star Club in Hamburg, before a group from Liverpool called the Beatles took over for Christmas.\n\nBut Taylor only lasted four days of that two-week residency. Just before midnight on the fifth night, just before they were about to go on, he phoned his girlfriend in Paris, got no answer, decided she was out cheating on him, and flew off to Paris instead of playing the show. He phoned the club's manager the next day to apologise and say he'd be back for that night's show, but Horst Fascher, the manager, wasn't as forgiving of Taylor as most promoters had been, and said that he'd shoot Taylor dead if he ever saw him again. The residency was cancelled, and the Playboys had to sell their mohair suits to Cliff Bennett and the Rebel Rousers to pay for their fare back to Paris.\n\nFor the next few years, Taylor put out a series of fairly poor records with different backing groups, often singing sickly French-language ballads with orchestral backings. He tried gimmicks like changing from his black leather costume into a white leather one, but nothing seemed to work. His money was running out, but then he had one more opportunity to hit the big time again.\n\nBobby Woodman, the drummer from the second lineup of the Playboys, had been playing with Johnny Hallyday, France's biggest rock and roll star, under the stage name Bobbie Clarke, but then Hallyday was drafted and his band needed work. They got together with Taylor, and as Vince Taylor and the Bobbie Clarke Noise they recorded an EP of blues and rock covers that included a version of the Arthur Crudup song made famous by Elvis, \"My Baby Left Me\". It was a quite extraordinary record, his best since \"Brand New Cadillac\" seven years earlier:\n\n[Excerpt: Vince Taylor and the Bobbie Clarke Noise, \"My Baby Left Me\"]\n\nThey played the Paris Olympia again, this time supporting the Rolling Stones. Vince Taylor was on his way to the top again. And they had the prospect of an American record deal -- Taylor's sister Sheila had married Joe Barbera, and he'd started up a new label and was interested in signing Taylor. They arranged a showcase gig for him, and everyone thought this could be the big time.\n\nBut before that, he had to make a quick trip to the UK. The group were owed money by a business associate there, and so Taylor went over to collect the money, and while he was there he went to Bob Dylan's party, and dropped acid for the first time. And that was the end of Vince Taylor's career.\n\nOne of the things that goes completely unreported about the British teen idols of the fifties is that for whatever reason, and I can't know for sure, there was a very high incidence of severe mental illness among them -- an astonishingly high incidence given how few of them there were. Terry Dene was invalided out of the Army with mental health problems shortly after he was drafted. Duffy Power attempted suicide in the early sixties, and had recurrent mental health problems for many years. And Dickie Pride, who his peers thought was the most talented of the lot, ended up dead aged twenty-seven, after having spent time in a psychiatric hospital and suffering so badly he was lobotomised.\n\nVince Taylor was the one whose mental problems have had the most publicity, but much of that has made his illness seem somehow glamorous or entertaining, so I want to emphasise that it was anything but. I spent several years working on a psychiatric ward, and have seen enough people with the same condition that Taylor had that I have no sense of humour about this subject at all. The rest of this podcast is about a man who was suffering horribly.\n\nTaylor had always been unstable -- he had been paranoid and controlling, he had a tendency to make up lies about himself and act as if he believed them, and he led a chaotic lifestyle. And while normally LSD is safe even if taken relatively often, Taylor's first acid trip was the last straw for his fragile mental health.\n\nHe turned up at the showcase gig unshaven, clutching a bottle of Mateus wine, and announced to everyone that he was Mateus, the new Jesus, the son of God. When asked if he had the band's money, he pulled out a hundred and fifty francs and set fire to it, ranting about how Jesus had turfed the money-lenders out of the temple. An ambulance was called, and the band did the show without him.\n\nThey had a gig the next day, and Taylor turned up clean-shaven, smartly dressed, and seemingly normal. He apologised for his behaviour the night before, saying he'd \"felt a bit strange\" but was better now. But when they got to the club and he saw the sign saying \"Vince Taylor and the Bobbie Clarke Noise\", he crossed \"Vince Taylor\" out, and wrote \"Mateus\" in a felt pen. During the show, instead of singing, he walked through the crowd, anointing them with water.\n\nHe spent the next decade in and out of hospital, occasionally touring and recording, but often unable to work. But while he was unwell, \"Brand New Cadillac\" found a new audience. Indeed, it found several audiences. The Hep Stars, a band from Sweden who featured a pre-ABBA Benny Andersson, had a number one hit in Sweden with their reworking of it, just titled \"Cadillac\", in 1965, just a month before Taylor's breakdown:\n\n[Excerpt: Hep Stars, \"Cadillac\"]\n\nIn 1971, Mungo Jerry reworked the song as \"Baby Jump\", which went to number one in the UK, though they didn't credit Taylor:\n\n[Excerpt: Mungo Jerry, \"Baby Jump\"]\n\nAnd in 1979, the Clash recorded a version of it for their classic double-album London Calling:\n\n[Excerpt: The Clash, \"Brand New Cadillac\"]\n\nShortly after recording that, Joe Strummer of the Clash met up with Taylor, who spent five hours explaining to Strummer how the Duke and Duchess of Windsor were trying to kill him with poisoned chocolate cake.\n\nTaylor at that time was still making music, and trying to latch on to whatever the latest trend was, as in his 1982 single \"Space Invaders\", inspired by the arcade game:\n\n[Excerpt: Vince Taylor, \"Space Invaders\"]\n\nBut the new music he was making was almost an irrelevance -- by this point he had become a legend in the British music industry, not for who he was in 1982, but for who he was in 1958, and he has had songs written about him by people as diverse as Adam Ant and Van Morrison. But his biggest influence came in the years immediately after his breakdown.\n\nBetween 1966 and 1972, Taylor spent much of his time in London, severely mentally ill, but trying to have some kind of social life based on his past glories, reminding people that he had once been a star. One of the people he got to know in London in the mid-sixties was a young musician named David Jones. Jones was fascinated by Taylor, even though he'd never liked his music -- Jones' brother was schizophrenic, and he was worried that he would end up like his brother. Jones also wanted to be a rock and roll star, and had some mildly messianic ideas of his own. So a rock and roll star who thought he was Jesus -- although he sometimes thought he was an alien, rather than Jesus, and sometimes claimed that Jesus *was* an alien -- and who was clearly severely mentally ill, had a fascination for him. He talked later about not having been able to decide whether he was seeing Taylor as an example to follow or a cautionary tale, and about how he'd sat with Taylor outside Charing Cross Station while Taylor had used a magnifying glass and a map of Europe to show him all the sites where aliens were going to land.\n\nSeveral years later, after changing his name to David Bowie, Jones remembered the story of Vince Taylor, the rock and roll star who thought he was an alien messiah, and turned it into the story of Ziggy Stardust:\n\n[Excerpt: David Bowie, \"Ziggy Stardust\"]\n\nIn 1983, Taylor retired to Switzerland with his new wife Nathalie. He changed his name back to Brian Holden, and while he would play the occasional gig, he tried as best he could to forget his past, and seems to have recovered somewhat from his mental illness. In 1991 he was diagnosed with cancer, and died of it three months later. Shortly before he died, he told a friend \"If I die, you can tell them that the only period in my life where I was really happy was my life in Switzerland\".",
  "enclosure": "",
  "itunes:summary": "Episode seventy-seven of&nbsp;A History of Rock Music in Five Hundred Songs&nbsp;looks at \"Brand New Cadillac\" by Vince Taylor and the Playboys, and the sad career of rock music's first acid casualty. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers have two bonus podcasts this week. There's a&nbsp;half-hour Q&A episode, where I answer backers' questions, and a ten-minute bonus episode on&nbsp;\"The Hippy Hippy Shake\" by Chan Romero.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nThere are several books available on Vince Taylor, including an autobiography, but sadly these are all in French, a language I don't speak past schoolboy level, so I can't say if they're any good.\n\nThe main resources I used for this episode were the liner notes for&nbsp;this compilation CD of Taylor's best material,&nbsp;&nbsp;this archived copy of a twenty-year-old homepage by a friend of Taylor's,&nbsp;this blogged history of Taylor and the Playboys, and&nbsp;this Radio 4 documentary on Taylor. But *all* of these were riddled with errors, and I used dozens of other resources to try to straighten out the facts -- everything from a genealogy website to interviews with Tony Sheridan to the out-of-print autobiography of Joe Barbera. No doubt this episode still has errors in it, but I am fairly confident that it has fewer errors than anything else in English about Taylor on the Internet.\n\nErrata\n\nI say that Gene Vincent also appeared on&nbsp;Oh Boy!&nbsp;-- in fact he didn't appear on UK TV until Parnes' next show,&nbsp;Boy Meets Girls, which would mean Taylor was definitely the originator of that style.\n\nA major clanger -- I say that Sheridan recorded \"Why\" while he was working on \"Oh Boy!\" -- in fact this wasn't recorded until later -- *with the Beatles* as his backing band. I should have known that one, but it slipped my mind and I trusted my source, wrongly.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nTranscript\n\nOn the twenty-first of May 1965, at the Savoy Hotel in London, there was a party which would have two major effects on the history of rock and roll music, one which would be felt almost immediately, and one whose full ramifications wouldn't be seen for almost a decade. Bob Dylan was on the European tour which is chronicled in the film \"Don't Look Back\", and he'd just spent a week in Portugal. He'd come back to the UK, and the next day he was planning to film his first ever televised concert.\n\nThat plan was put on hold. Dylan was rushed to hospital the day after the party, with what was claimed to be food poisoning but has often been rumoured to be something else. He spent the next week in bed, back at the Savoy, attended by a private nurse, and during that time he wrote what he called \"a long piece of vomit around twenty pages long\". From that \"long piece of vomit\" he later extracted the lyrics to what became \"Like a Rolling Stone\".\n\nBut Dylan wasn't the only one who came out of that party feeling funny. Vince Taylor, a minor British rock and roller who'd never had much success over here but was big in France, was also there. There are no euphemisms about what it was that happened to him. He had dropped acid at the party, for the first time, and had liked it so much he'd immediately spent two hundred pounds on buying all the acid he could from the person who'd given it to him.\n\nThe next day, Taylor was meant to be playing a showcase gig. His brother-in-law, Joe Barbera of Hanna Barbera, owned a record label, and was considering signing Taylor. It could be the start of a comeback for him.\n\nIn",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode seventy-seven of&nbsp;A History of Rock Music in Five Hundred Songs&nbsp;looks at \"Brand New Cadillac\" by Vince Taylor and the Playboys, and the sad career of rock music's first acid casualty. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers have two bonus podcasts this week. There's a&nbsp;half-hour Q&A episode, where I answer backers' questions, and a ten-minute bonus episode on&nbsp;\"The Hippy Hippy Shake\" by Chan Romero.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nThere are several books available on Vince Taylor, including an autobiography, but sadly these are all in French, a langua",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}