{
  "id": "tag:blogger.com,1999:blog-8698702854482141883.post-1938992139594465138",
  "published": "2022-10-14T09:00:00.005-07:00",
  "updated": "2022-10-18T08:54:52.017-07:00",
  "category": [
    "",
    "",
    "",
    ""
  ],
  "title": "Announcing KataOS and Sparrow",
  "content": "As we find ourselves increasingly surrounded by smart devices that collect and process information from their environment, it's more important now than ever that we have a simple solution to build verifiably secure systems for embedded hardware. If the devices around us can't be mathematically proven to keep data secure, then the personally-identifiable data they collect—such as images of people and recordings of their voices—could be accessible to malicious software.<div><br /></div><div>Unfortunately, system security is often treated as a software feature that can be added to existing systems or solved with an extra piece of ASIC hardware— this generally is not good enough. Our team in Google Research has set out to solve this problem by building a provably secure platform that's optimized for embedded devices that run ML applications. This is an ongoing project with plenty left to do, but we're excited to share some early details and invite others to collaborate on the platform so we can all build intelligent ambient systems that have security built-in by default.<br /><br />To begin collaborating with others, we've open sourced several components for our secure operating system, called KataOS, <a href=\"https://github.com/AmbiML/sparrow-manifest\" target=\"_blank\">on GitHub</a>, as well as partnered with Antmicro on their <a href=\"https://antmicro.com/blog/2022/08/running-rust-programs-in-sel4/\" target=\"_blank\">Renode simulator and related frameworks</a>. As the foundation for this new operating system, we chose <a href=\"https://sel4.systems/\" target=\"_blank\">seL4</a> as the microkernel because it puts security front and center; it is mathematically proven secure, with guaranteed confidentiality, integrity, and availability. Through the seL4 CAmkES framework, we're also able to provide statically-defined and analyzable system components. KataOS provides a verifiably-secure platform that protects the user's privacy because it is logically impossible for applications to breach the kernel's hardware security protections and the system components are verifiably secure. KataOS is also implemented almost entirely in <a href=\"https://www.rust-lang.org/\" target=\"_blank\">Rust</a>, which provides a strong starting point for software security, since  it eliminates entire classes of bugs, such as off-by-one errors and buffer overflows. <br /><br />The current GitHub release includes most of the KataOS core pieces, including the frameworks we use for Rust (such as the sel4-sys crate, which provides seL4 syscall APIs), an alternate rootserver written in Rust (needed for dynamic system-wide memory management), and the kernel modifications to seL4 that can reclaim the memory used by the rootserver. And we've collaborated with Antmicro to enable GDB debugging and simulation for our target hardware with <a href=\"https://antmicro.com/platforms/renode/\" target=\"_blank\">Renode</a>.<br /><br />Internally, KataOS also is able to dynamically load and run third-party applications built outside of the CAmkES framework.  At the moment, the code on Github does not include the required components to run these applications, but we hope to publish these features in the near future.<br /><br />To prove-out a secure ambient system in its entirety, we're also building a reference implementation for KataOS called Sparrow, which combines KataOS with a secured hardware platform. So in addition to the logically-secure operating system kernel, Sparrow includes a logically-secure root of trust built with <a href=\"https://opentitan.org/\" target=\"_blank\">OpenTitan</a> on a RISC-V architecture. However, for our initial release, we're targeting a more standard 64-bit ARM platform running in simulation with QEMU. <br /><br />Our goal is to open source all of Sparrow, including all hardware and software designs. For now, we're just getting started with an early release of <a href=\"https://github.com/AmbiML/sparrow-manifest\" target=\"_blank\">KataOS on GitHub</a>. So this is just the beginning, and we hope you will join us in building a future where intelligent ambient ML systems are always trustworthy.<br /><br /><i>By Sam, Scott, and June – AmbiML Developers</i><span id=\"docs-internal-guid-8ec291b3-7fff-2608-3955-c801e5608b7d\"><div><span face=\"&quot;Google Sans&quot;, sans-serif\" style=\"font-size: 11pt; font-style: italic; font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\"><br /></span></div></span></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Open Source Programs Office",
    "uri": "http://www.blogger.com/profile/11192158996903493674",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}