{
  "id": "tag:blogger.com,1999:blog-37798047.post-6145801374507785535",
  "published": "2022-07-03T19:02:00.002-04:00",
  "updated": "2022-07-03T19:02:22.982-04:00",
  "title": "DS620slim tiny home server",
  "content": "<div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-fSM27sRXOVc/YeH_7vhh1-I/AAAAAAAAG20/YuMoyxLfa60Ac_GUa5vkHZQ845O9NTNJQCNcBGAsYHQ/image.png\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img alt=\"\" data-original-height=\"400\" data-original-width=\"668\" height=\"192\" src=\"https://lh3.googleusercontent.com/-fSM27sRXOVc/YeH_7vhh1-I/AAAAAAAAG20/YuMoyxLfa60Ac_GUa5vkHZQ845O9NTNJQCNcBGAsYHQ/image.png\" width=\"320\" /></a></div>In this blogpost, I describe the Synology <a href=\"https://www.synology.com/en-us/products/DS620slim\">DS620slim</a>. Mostly these are notes for myself, so when I need to replace something in the future, I can remember how I built the system. It's a \"NAS\" (network attached storage) server that has six hot-swappable bays for 2.5 inch laptop drives.</div><div><br /></div><div>That's right, <b>laptop 2.5 inch drives</b>. It makes this a tiny server that you can hold in your hand.</div><div><br /></div><div>The purpose of a NAS is <b>reliable</b>&nbsp;storage. All disk drives eventually fail. If you stick a USB external drive on your desktop for backups, it'll eventually crash, losing any data on it. A failure is unlikely tomorrow, but a spinning disk will almost certainly fail some time in the next 10 years. If you want to keep things, like photos, for the rest of your life, you need to do something different.</div><div><br /></div><div>The solution is RAID, an array of&nbsp;<b>redundant disks</b>&nbsp;such that when one fails (or even two), you don't lose any data. You simply buy a new disk to replace the failed one and keep going. With occasional replacements (as failures happen) it can last decades. My <a href=\"https://blog.erratasec.com/2017/09/5-years-with-home-nasraid.html\">older NAS is 10 years old</a> and I've replaced all the disks, one slot replaced twice.</div><span><a name='more'></a></span><div><br /></div><div>This can be <b>expensive.</b>&nbsp;A NAS requires a separate box in addition to lots of drives. In my case, I'm spending $1500 for a 18-terabytes of disk space that would cost only $400 as an external USB drive. But amortized for the expected 10+ year lifespan, I'm paying $15/month for this home system.</div><div><br /></div><div>This unit is not just disk drives but also a <b>server</b>. Spending $500 just for a box to hold the drives is a bit expensive, but the advantage is that it's also a server that's powered on all the time. I can setup tasks to run on regular basis that would break if I tried to regularly run them on a laptop or desktop computer.</div><div><br /></div><div>There are lots of <b>do-it-yourself</b> solutions (like the Radaxa Taco carrier board for a Raspberry Pi 4 CM running Linux), but I'm choosing this solution because I want something that just works without any hassle, that's configured for exactly what I need. For example, eventually a disk will fail and I'll have to replace it, and I know now that this is something that will be effortless when it happens in the future, without having to relearn some arcane Linux commands that I've forgotten years ago.</div><div><br /></div><div>Despite this, I'm a geek who obsesses about things, so I'm still going to do possibly unnecessary things, like upgrading hardware: memory, network, and fan for an optimized system. Here are all the components of my system:</div><div><ul style=\"text-align: left;\"><li>$500 - <a href=\"https://www.newegg.com/synology-ds620slim/p/N82E16822108621?Item=9SIA2F89SD8662\">DS620slim </a>unit</li><li>$1000 - 6x Seagate Barracuda 5TB 2.5 inch laptop drive (<a href=\"https://www.amazon.com/dp/B01M0AADIX\">ST5000LM000</a>)</li><li>$100 - 2x Crucial 8GB DDR3 SODIMMs (<a href=\"https://www.amazon.com/dp/B00JCRZ6XS\">CT2K102464BF186D</a>)</li><li>$30 - 2.5gbps Ethernet USB (<a href=\"https://amazon.com/dp/B07VNFLTLD\">CableCreation B07VNFLTLD</a>)</li><li>$15 - <a href=\"https://amazon.com/dp/B00NEMGCRQ\">Noctua NF-A8 ULN</a> ultra silent fan</li><li>$360 - WD Elements 18TB USB drive (<a href=\"https://www.amazon.com/dp/B08KTRBHP1\">WDBWLG0180HBK-NESN</a>)</li></ul></div><div>You can save a bunch of money by going down to 4TB drives (and a 14TB backup USB drive), but I chose the larger 5TB drives.</div><h2 style=\"text-align: left;\">Disk Drives</h2><div>The most important reason for choosing this product is the smaller <b>2.5-inch disk drives </b>(sized for laptops). Otherwise, you should buy one of the larger (<i>much larger</i>) system that'll holder standard sized drives.</div><div><br /></div><div>The drives will be largest cost. A 5TB spinning disk costs ~$150, or an 8TB SSD flash costs ~$700. Buying 6 of them is your largest investment. You don't have to fill up the system, or buy the largest drives, but if you put in the time and effort, you might as well go all the way. On a cost-per-gigabyte, the larger drives seem to be best price.</div><div><br /></div><div>As you know, there are only three manufacturers remaining for spinning rust drives: Seagate, Western Digital (WD), and Toshiba. Also as you know, laptops have moved away from rotating disks, adopting SSDs instead. Thus, the 2.5 inch form factor for spinning disks is likely dead. For right now, they are a lot cheaper than SSDs, a fifth of the price. In the future, when a drive dies on the array, I'll likely have to replace it with an SSD, because a replacement spinning disk is no longer available. The SATA SSD itself is eventually going to disappear (to be replaced by NVMe SSDs), but they should still be around a decade from now when I need replacement drives. (I plan on the NAS lasting a decade before I have to upgrade and move the data).</div><div><br /></div><div>The <b>internal</b> 5TB drives are a bit expensive. One strategy would be to instead buy <b>external </b>USB drives and \"shuck\" them, removing the USB enclosure to get at the drives themselves. It's a common strategy when under certain market conditions, external drives are cheaper than internal drives. I tried buying a <a href=\"https://www.amazon.com/dp/B07X41PWTY\">$100 5TB Western Digital external drive</a>. It didn't work -- it wasn't a SATA drive in a USB enclosure, but was natively USB on the circuit board. I'm using it as a Raspberry Pi 4 drive instead for storing blockchain info.</div><div><br /></div><div>Inserting the drive into the 620slim is easy: just pop out the carrier, add the drive, and pop it back in. The carrier comes with little posts on one side that fit the screw holes, meaning you only need to screw in the other side with 2 screws -- or you can forgo the screws altogether.</div><div><br /></div><div>The carriers have locks, to prevent people from accidentally pulling out a drive, but I don't use them. In 5 years when a drive fails and I need to replace it, I don't want to go hunting for these keys. The entire strategy I'm using here is that when failure happens, I'll fix it right away rather than finding reasons to procrastinate. I've had to replace 3 failed drives in my previous NAS, and this worked well.</div><div><br /></div><h2 style=\"text-align: left;\">Memory</h2><div>The DS620slim comes with 2-gigabytes of memory, in a single SO-DIMM slot. There's a second empty SO-DIMM slot. (SO-DIMMs are the smaller form factor for memory that's intended for notebook computers and tiny servers).</div><div><br /></div><div>Synology will <b>officially </b>sell you a 4-gig SO-DIMM to put in the empty slot, bringing total memory to 6-gigs.</div><div><br /></div><div><b>Unofficially</b>, you can get two of these, using the second to replace the existing 2-gigs, brining it to 8-gigs total.</div><div><br /></div><div>Even <b>more unofficially</b>, you can go to 16gigs. According to Intel's official spec sheet for the <a href=\"https://ark.intel.com/content/www/us/en/ark/products/95597/intel-celeron-processor-j3355-2m-cache-up-to-2-50-ghz.html\">J3355 CPU</a>, it only supports 8-gigs. Such numbers are usually conservative, reflecting the memory available at the time. When larger capacities appear later, they usually work. Such is the case here, where I put in 16-gigs total using <a href=\"https://www.amazon.com/dp/B00JCRZ6XS\">Crucial SO-DIMMs</a>&nbsp;(two 8-gig DIMMs).</div><div><br /></div><div>I recommend expanding memory here, if only an extra 2gig DIMM to fill that free space. It's a quick and easy replacement, just unscrew the bottom plate and insert the memory.</div><div><br /></div><h2 style=\"text-align: left;\">Ethernet</h2><div>The unit only comes with gigabit Ethernet. This can be a bottleneck, so we want to speed that up.</div><div><br /></div><div>It comes with two Ethernet ports, which support <b>aggregation</b>, but I couldn't get a speed increase. It seems they'll speed things up if there are at least two devices talking to the NAS, but won't speed up when there's only one client. But then, if you have two clients, then things will slow down anyway, because accesses are no longer sequential.</div><div><br /></div><div>The solution is to use a faster Ethernet adapter, like 2.5gig, 5gig, or 10gig. There's no PCIe slot in the device, but it does have USB 3. I can therefore use a 2.5gbps or 5gbps dongle.</div><div><br /></div><div>I benchmarked the three options, and found the following performance, in mbps (mega-bits per second). This was measured with large sequential transfers, small or random transfers are roughly the same speed, around 350mbps, for all three adapters.</div><div><br /></div><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-AqkwzIPLPXk/YeZhPiV6W0I/AAAAAAAAG3Y/dIsWuKMVdY4GO5CoWzftLXtz2DDaGIRJwCNcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"127\" data-original-width=\"305\" height=\"133\" src=\"https://lh3.googleusercontent.com/-AqkwzIPLPXk/YeZhPiV6W0I/AAAAAAAAG3Y/dIsWuKMVdY4GO5CoWzftLXtz2DDaGIRJwCNcBGAsYHQ/image.png\" width=\"320\" /></a></div></div><br />There's a big jump in performance using the 2.5gbps adapter, but only a marginal increase using the 5gbps adapter.</div><div><br /></div><div>Synology doesn't support the adapters directly. To install them, I used the following steps with the following project:</div><div><ol style=\"text-align: left;\"><li>Enable SSH, using (Control Panel -&gt; Terminal). If you are a geek, you've already done this.</li><li>Go to&nbsp;<a href=\"https://github.com/bb-qq/r8152\">this GitHub project</a>&nbsp;and download the&nbsp;the&nbsp;<span style=\"font-family: courier;\"><a href=\"https://github.com/bb-qq/r8152/releases/download/2.15.0-5/r8152-apollolake-2.15.0-5.spk\">r8152-apollolake-2.15.0-5.spk</a></span>&nbsp;file (from the Releases section) to your local computer. Your DS620slim has an Apollo Lake CPU, so that's the package we are using.</li><li>Use the \"Package Center\" to do a \"Manual\" install, and upload this SPK file. If you get an error saying you don't have permissions, log out and back in. Otherwise, you'll first get a warning saying the driver isn't supported by Synology, and eventually you'll get the error \"Failed to install package\". This is supposed to happen.</li><li>From the SSH command-line, run the command:</li><li><span style=\"font-family: courier;\">sudo install -m 4755 -o root -D /var/packages/r8152/target/r8152/spk_su /opt/sbin/spk_su</span></li><li>Now repeat the step using \"Packet Center\" to do a \"Manual\" install. If you didn't close the window that you had open, you can just click on the \"Done\" button a second time and it'll work.</li><li>Now reboot, and plug in the USB adapter.</li></ol></div><div>For 5-gbps, you can use go through the same process to install <a href=\"https://github.com/bb-qq/aqc111\">Aquantia aqc111 drivers</a>. I did this to get a <a href=\"https://amazon.com/dp/B08977K9D2\">Sabrent NT-SS5G</a> adapter to work.</div><div><br /></div><div>In practice, when transferring large files, you still aren't going to be able to exceed 2.5gbps much, so I just use the slower adapter. It's cheaper and uses a lot less electrical power (a 2.5gbps Ethernet adapter is noticeably cooler than a 5gbps, which is in turn noticeably cooler than 10gbps).</div><div><br /></div><h2 style=\"text-align: left;\">Fan</h2><div>The unit comes with a small fan that by default will run in \"quiet\" mode, but under load, the noise becomes noticeable. A cheap $15 gets a fan that runs a lot quieter, like a <a href=\"https://amazon.com/dp/B00NEMGCRQ\">Noctua</a> fan famous for this. Replacing the fan doesn't require any tools, as it's held in by rubber thingies.</div><div><br /></div><div>This allows me to run the fan at a higher speed, with less noise, which keeps everything even cooler. Since I plan on a 10 year lifespan with rotating disks, I figure lower temperatures will be better for longevity.</div><div><br /></div><h2 style=\"text-align: left;\">USB drive backups</h2><div>RAID6 gives pretty good safety, allowing two drives to fail with no data loss. The term \"RAID5\" means one redundant disk, the term \"RAID6\" means two redundant disks.</div><div><br /></div><div>But you should still do backups. The NAS itself can fail. Or, ransomware can delete all the files. There's lots of possible failures.</div><div><br /></div><div>One of the neat things with Synology is that it's easy to schedule regular backups to an external USB drive.</div><div><br /></div><div>In my case, I'm using an 18 terabyte USB drive costing $400 for backups. I just schedule it and forget it, backups always happen, and ransomware on Windows machines can delete everything on the NAS but can't touch the backup.</div><div><br /></div><h2 style=\"text-align: left;\">UPS (Uninterruptable Power Supply)</h2><div>For a small NAS, I bought a <a href=\"https://amazon.com/dp/B013JHYQNC\">small UPS</a>. This is some weird APC unit that I got on close-out for $100. It's such a weird little product that I don't think it was very popular.</div><div><br /></div><div>It's a lithium ion UPS. The price for lithium batters, especially&nbsp;LiFePO4, is approaching the point where they are price competitive with traditional lead acid batteries. This is especially true considering that they last longer in UPS applications than lead acid.</div><div><br /></div><h2 style=\"text-align: left;\">File system</h2><div>Now with hardware out of the way, let's talk software. Once you insert the drives, plug in the Ethernet, and turn on the power, you access the device with a web browser and configure from there.</div><div><br /></div><div>There are several choices for how you want to configure RAID and the filesystem.</div><div><br /></div><div>I chose <a href=\"https://en.wikipedia.org/wiki/Btrfs\">BTRFS</a> on top of RAID6.</div><div><br /></div><div>BTRFS is a new Linux filesystem that's increasingly becoming the default. It's major feature is that it includes checksums for files as part of their metadata (along with filenames and timestamps). This allows the filesystem to detect when a file has become corrupted, so that the file can be repaired. Bits will rot on hard disk, so files can become corrupted over time even if the files are never written to or read. Scrubbing prevents this from happening. With Synology, I simply configure it to scrub the entire filesystem every month.</div><div><br /></div><div>This is not \"btrfs-raid\", but \"btrfs-on-raid6\". BTRFS has some experimental RAID built-in, but it's buggy and doesn't really work. Instead, I first create a RAID6 array combining multiple drives into a single virtual drive, then put BTRFS on top of that.</div><div><br /></div><div>These boxes are designed to allow multiple filesystems to be created, but I create simply the one. I do have multiple \"shares\", though, such as for videos and music, but these are still just directories on the same filesystem.</div><div><br /></div><div>I also occasionally take \"snapshots\". I'm not sure how that works since I've never restored a snapshot, but in principle it'll be quicker restoring from backups.</div><div><br /></div><h2 style=\"text-align: left;\">Summary</h2><div>If you are looking for between 16TB and 20TB, for more personal use than a large office, it's rather perfect. Yea, it'll be 4 times more expensive than just getting an external USB drive, but it's RAID and it's own server.</div><div><br /></div><div>It's so cute I got a second one and filled it with 2TB SSDs, for database accesses that spend a lot of time searching through large database of poorly indexed data (like password dumps).</div><div><br /></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Robert Graham",
    "uri": "http://www.blogger.com/profile/09879238874208877740",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}