{
  "guid": "urn:uuid:e4bae304-fa2c-4c53-bea8-724598b73dd6",
  "link": "https://www.who.int/news/item/18-10-2022-staggering-backsliding-across-women-s--children-s-and-adolescents--health-revealed-in-new-un-analysis",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Staggering backsliding across women’s, children’s and adolescents’ health revealed in new UN analysis",
  "description": "<p>A new UN report shows that women&rsquo;s and children&rsquo;s health has suffered globally, as the impacts of conflict, the COVID-19 pandemic and climate change converge with devastating effects on prospects for children, young people and women. <br /></p><p>Data presented in the report show a critical regression across virtually every major measure of childhood well-being, and many key indicators of the Sustainable Development Goals (SDGs). Since the last Every Woman Every Child Progress Report published in 2020, food insecurity, hunger, child marriage, risks from intimate partner violence, and adolescent depression and anxiety have all increased. <br /></p><p>An estimated 25 million children were un- or under-vaccinated in 2021 &ndash; 6 million more than in 2019 - increasing their risk of contracting deadly and debilitating diseases. Millions of children missed out on school during the pandemic, many for more than a year, while approximately 80% of children in 104 countries and territories experienced learning-loss because of school closures. Since the start of the global pandemic, 10.5 million children lost a parent or caregiver to COVID-19.<br /></p><p>&ldquo;At the core of our unkept promise is the failure to address the gaping inequities at the root of global crises, from the COVID-19 pandemic to conflicts and the climate emergency. The report describes the impacts of these crises on women, children and adolescents, from maternal mortality to education losses to severe malnutrition,&rdquo; said Antonio Guterres, United Nations Secretary-General. <strong></strong><br /></p><p>The report provides wide-ranging evidence that children and adolescents face wildly divergent chances of leading a healthy life simply based on where they are born, their exposure to conflict, and the economic circumstances of their families. For example:<br /></p><ul><li>A child born in a low-income country has an average life expectancy at birth of around 63 years, compared to 80 in a high-income country. This devastating 17-year survival gap has changed little over recent years. In 2020, 5 million children died even before the age of 5, mostly from preventable or treatable causes. Meanwhile, most maternal, child, and adolescent deaths and stillbirths are concentrated in just two regions &ndash; sub-Saharan Africa and South Asia.<br /></li><li>More than 45 million children had acute malnutrition in 2020, a life-threatening condition which leaves them vulnerable to death,&nbsp;developmental delays and disease. Nearly three-quarters of these children live in lower-middle-income countries. A staggering 149 million children were stunted in 2020. Africa is the only region where the numbers of children affected by stunting increased over the past 20 years, from 54.4 million in 2000 to 61.4 million in 2020. <br /></li><li>The six countries with the highest numbers of internally displaced persons &ndash; Afghanistan, the Democratic Republic of the Congo, Ethiopia, Sudan, the Syrian Arab Republic and Yemen &ndash; are also among the top 10 food insecure countries.<br /></li><li>A woman in sub-Saharan Africa has around a 130 times higher risk of dying from causes relating to pregnancy or childbirth than a woman in Europe or North America. Coverage of antenatal care, skilled birth attendance, and postnatal care is far from reaching all women in low- and middle- income countries, leaving them at elevated risk of death and disability.</li><li>Millions of children and their families are experiencing poor physical and mental health from recent humanitarian disasters in Afghanistan, Ethiopia, Pakistan, Somalia, Ukraine and Yemen. In 2021, a record 89.3 million people worldwide were driven from their homes by war, violence, persecution, and human rights abuse.<br /></li></ul><p>The report calls upon the global community to address this damaging trajectory and protect the promises made to women, children, and adolescents in the Sustainable Development Goals. In particular, it advocates for countries to continue investing in health services, to address all crises and food insecurity, and empower women and young people around the world.<br /></p><p>The report, titled <em><a href=\"https://www.who.int/publications-detail-redirect/9789240060104\">Protect the Promise</a></em><em>, </em>is published by global partners, including WHO, UNICEF, UNFPA, Partnership for Maternal, Newborn &amp; Child Health (PMNCH) and Countdown to 2030, as a bi-annual summary of progress in response to the UN Secretary General's Every Woman Every Child Global Strategy for Women, Children's and Adolescents' Health. The most comprehensive synthesis of evidence on the current state of maternal, newborn, child and adolescent health, it updates the last Every Woman Every Child Global Strategy Progress Report published in 2020.<br /></p><p><strong>Quote sheet:</strong><br /></p><p>&ldquo;Almost three years on from the onset of COVID-19, the pandemic&rsquo;s long-term impact on the health and well-being of women, children and adolescents is becoming evident: their chances for healthy and productive lives have declined sharply,&rdquo; said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. &ldquo;As the world emerges from the pandemic, protecting and promoting the health of women, children and young people is essential for supporting and sustaining the global recovery.&rdquo;<br /></p><p>&ldquo;The impacts of COVID-19, conflicts, and climate crises have raised the stakes for vulnerable communities, revealing the weaknesses and inequities in health care systems and reversing hard-won progress for women, children, and adolescents &ndash; but we are not powerless to change this,&rdquo; said UNICEF Executive Catherine Russell. &ldquo;By investing in resilient, inclusive primary health care systems, jumpstarting routine immunization programmes, and strengthening the health workforce, we can make sure that every woman and every child can access the care they need to survive and thrive.&rdquo;<br /></p><p>&ldquo;There is a crisis of inequity that is piling on already increasing and compounding threats. In a world where too many children, adolescents and women are dying, equity, empowerment and access are what needs urgent focus,&rdquo; said H.E. Ms. Kersti Kaljulaid, Global Advocate for Every Woman Every Child and President of the Republic of Estonia, 2016-2021. &ldquo;We are calling on all to think and act broadly and profoundly to protect the promise. This promise refers not only to the commitments made in the Sustainable Development Goals, and all of the campaigns that followed, but also to the larger promise of potential that everyone is born with. Too often this promise remains unclaimed, or even denied.&rdquo;<br /></p><p>&ldquo;In the face of increasing political pushback against sexual and reproductive health and rights in many countries, women, children and adolescents today are left without many of the protections of just a decade ago, and many others still have not seen the progress they need,&rdquo; said Dr. Natalia Kanem, UNFPA Executive Director. &ldquo;Access to sexual and reproductive health services, including contraception, is a fundamental right that directly and acutely affects the ability of women and adolescent girls to thrive. We need to expand these rights and services to the most marginalized, leaving no one behind.&rdquo;<br /></p><p>&ldquo;The report advocates for countries to continue investing in health services, in all crises, and to re-imagine health systems that can truly reach every woman, child, and adolescent, no matter who they are or where they live,&rdquo; said the Rt. Hon Helen Clark, Board Chair of PMNCH (The Partnership for Maternal, Newborn &amp; Child Health) and former Prime Minister of New Zealand. &ldquo;Experts and world leaders are calling for more women in policy- and decision-making at every level, meaningful engagement with young people, and primary health care systems which deliver what people need when and where they need it most.&rdquo; <br /></p><p>###</p><p><strong>Notes to editor:</strong><br /></p><p>Download multimedia content <a href=\"https://weshare.unicef.org/Package/2AMZIF7A6BD6\">here</a></p><p>Access infographics and data <a href=\"https://drive.google.com/drive/folders/1qi1Q5WjV8FZJ2Nh_DTQHd9y5v1J277wq?usp=sharing\">here</a> </p><p>The report will be launched at the World Health Summit in Berlin on 18 October 2022 at 9 AM GMT+2 at a session where the findings will be discussed by world leaders and young people. The session can be joined in person or <a href=\"https://www.conference.worldhealthsummit.org/Program/Session/WHS2022/WS-22\">virtually</a>.</p><h3>Speakers include:</h3><ul><li>Rt. Hon. Helen Clark, Former Prime Minister of New Zealand and Board Chair of PMNCH (<a href=\"https://twitter.com/HelenClarkNZ\">@HelenClarkNZ</a>) </li><li>H.E. Kersti Kaljulaid, Former President of Estonia and UN SG&rsquo;s Global Advocate for Every Woman Every Child (<a href=\"https://twitter.com/KerstiKaljulaid\">@KerstiKaljulaid</a>)</li><li>Dr. Austin Demby, Minister of Health and Sanitation, Sierra Leone <a href=\"https://twitter.com/mohs_sl\">(@mohs_sl</a>)</li><li>Tedros Adhanom Ghebreyesus, Director General, WHO (<a href=\"https://twitter.com/DrTedros\">@DrTedros</a>)</li><li>Aboubacar Kampo, Director of Health, UNICEF (<a href=\"https://twitter.com/AbouKampo\">@AbouKampo</a>)</li><li>Natalia Kanem, Executive Director, UNFPA (<a href=\"https://twitter.com/Atayeshe\">@Atayeshe</a>)</li><li>Anshu Banerjee, Director, Department of Maternal, Newborn, Child and Adolescent Health &amp; Ageing, WHO (<a href=\"https://twitter.com/ABanerjeeWHO\">@ABanerjeeWHO</a>)</li><li>Yana Panfilova, Founder of Teenergizer, Activist and Ukrainian refugee (<a href=\"https://twitter.com/YPanfilova\">@YPanfilova</a>)</li><li>Elhadj As Sy, Board Chair, Kofi Annan Foundation (<a href=\"https://twitter.com/Elhadj_As_Sy\">@Elhadj_As_Sy</a>)</li><li>Inger Ashing, CEO, Save the Children International (<a href=\"https://twitter.com/SaveCEO_Intl\">@SaveCEO_Intl</a>)</li><li>Maziko Matemvu, President and Founder, Uwale (<a href=\"https://twitter.com/mazikospeaks\">@mazikospeaks</a>)</li><li>Loyce Pace, Assistant Secretary for Global Affairs, Department of Health and Human Services, USA&nbsp;(<a href=\"https://twitter.com/HHS_ASGA\" target=\"_blank\">@HHS_ASGA</a>)&nbsp;</li></ul><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p>",
  "pubDate": "Tue, 18 Oct 2022 07:14:46 Z"
}