{
  "title": "TU:80 Nervous Systems in the News: Dr. Blasey Ford, Sexual Trauma Stories and the Power of Patriarchy",
  "link": "https://therapistuncensored.com/episodes/tu80-nervous-systems-in-the-news-dr-blasey-ford-sexual-trauma-stories-and-the-power-of-patriarchy/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu80-nervous-systems-in-the-news-dr-blasey-ford-sexual-trauma-stories-and-the-power-of-patriarchy",
  "pubDate": "Thu, 04 Oct 2018 00:57:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=6477",
  "description": "Nervous Systems in the News\nLet&#039;s talk nervous systems in the context of the news. We joke around a lot on this show, but when it hits the fan we are serious therapists devoted to treating real people and all kinds of survivors. As women, as privileged humans lucky enough and wildly empowered enough to have a mic and thus a voice with an audience, and as survivors ourselves, we could not let the treatment of Dr. Christine Blasey Ford in the Kavanaugh hearing for his nomination for the Supreme Court pass without sharing our thoughts on what is happening from an attachment perspective.\n\nWe give our best guess on what exactly people were responding to when they overwhelmingly called national and local hotlines in unprecedented numbers, told their stories, and overall agreed on Dr. Ford’s credibility from both sides of the political aisle. We speak in this moment not from a political perspective, but from a somatic, nervous system perspective. Something has stirred in the American public even different than the #MeToo movement, and we speak to it on this episode.\n\nWe also touch on the science of memory, implicit and explicit, mirror neurons, stress hormones and threat responses and most importantly the power of patriarchy to harm both women and men.\n\nWe also speak about what to do if you are triggered by these events and encourage you to reach out and get support.\n\nWe send each of you man, woman, all political persuasions, all ages a message of connection and care.\n\nThere is no place for power-over, dominance, sadism, silencing others, humiliation and condescension. But if we band together and protect anyone, of any party or gender that has a healthy enough nervous system and attachment organization to be able to connect, dialog, listen, debate respectfully, repair and have the COURAGE to share feelings in a way that is vulnerable and relatable, then we can turn this insecure selfcenteredness around. (Hint — blasting entire groups of people is not vulnerably sharing feelings, it is a power-over move. Use your mirror neurons to tell the difference, vulnerability begets empathy, rage begets fear or intimidation or a joining-with, get the pitchfork sort of group rage!). Learn to spot dominance and call it out as inscecurity – because it is. Instead support connection and relatedness ESPECIALLY in your leaders because those in power will try to squash them. Think of the nervous system. Health is integration of the left and right, not dominance of the left over the right. It’s not all LEFT, we can’t do anything without both working together.\nHope you enjoy the bonus episode. Please please leave us a voicemail on our website www.therapistuncensored.com to let us know how we are doing. We play some of them on our show.\n \n\nFor discussion –\n\nhttps://www.theguardian.com/world/2017/mar/08/women-challenging-patriarchy-one-podcast-at-time\n\nhttps://news.virginia.edu/content/your-brain-politics-neuroscience-shapes-our-views\n\nhttps://www.huffingtonpost.com/entry/politics-and-the-neuroscience-of-fear_us_5940e51de4b03e17eee08810\nA Woman Called Into C-SPAN During the Kavanaugh Hearing. What She Said Is Absolutely Heartbreaking.\nhttps://neurosciencenews.com/blasey-ford-testimony-sexual-assault-9928/\n\nhttps://www.inverse.com/article/49435-christine-blasey-ford-trauma-science\n\nhttps://www.scientificamerican.com/podcast/episode/blasey-ford-spells-out-trauma-memory-formation/\n\n \n\nTweet",
  "enclosure": "",
  "itunes:subtitle": "Nervous Systems in the News Let&#039;s talk nervous systems in the context of the news. We joke around a lot on this show, but when it hits the fan we are serious therapists devoted to treating real people and all kinds of survivors. As women,",
  "itunes:summary": "We joke around a lot on this show, but when it hits the fan we are serious therapists devoted to treating real people and all kinds of survivors.  Today we give our best guess on they science behind why people are responding overwhelmingly to Dr. Ford&apos;s testimony - calling national and local crisis hotlines in unprecedented numbers.  We speak in this moment not from a political perspective, but from a somatic, nervous system perspective.  Something has stirred in the American public even different than the #MeToo movement, and we speak to it on this episode.<br />\nWe also touch on the science of memory, implicit and explicit, mirror neurons, stress hormones and threat responses and most importantly the power of patriarchy to harm both women and men, both political parties and our democracy as we know it.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "24:17"
}