{
  "title": "S5 Ep62: Director's Cut: The Green New Deal",
  "link": "https://audioboom.com/posts/7365401",
  "itunes:episode": 62,
  "itunes:title": "Director's Cut: The Green New Deal",
  "itunes:season": 5,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1427,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>The layout of the commission has largely changed this year. A key part being that there are now three executive Vice Presidents, driving three main economic issues. Frans Timmermans, responsible for the implementation of the Green Deal; Margrethe Vestager, responsible for the digital age and competition policy and Valdis Dombrovskis, responsible for economy and financial services. The major change being that, in this commission, the Vice Presidents also have their own portfolio and Directorate-Generals to oversee, suggesting these three will be instrumental in driving the political priorities of commission.<br>\n<br>\n\n</div>\n<div>In this episode of 'The Sound of Economics' Bruegel director Guntram Wolff discusses with Simone Tagliapietra the new commission setup and Ursula von der Leyen's European Green Deal.<br>\n<br>\n\n</div>\n<div>In his <a href=\"https://bruegel.org/2019/07/von-der-leyens-green-deal-isnt-just-a-plan-for-the-environment/\">previous blog post on the Green Deal</a>, Simone argues not only does it aim to reduce the continent's emissions, but it also has the potential to grow the EU's economy and transform the bloc's politics. He also states the green deal has the motivation to achieve very high climate targets in quicker time than foreseen.<br>\n<br>\n\n</div>\n<div>For further reading on this topic, we recommend another recent blog post by Simone Tagliapietra on <a href=\"https://bruegel.org/2019/08/the-democrats-need-to-have-a-climate-only-tv-debate-for-americans-and-for-the-rest-of-us/\">the global summits between now and November 2020 that are crucial to the future of climate change.</a>\n</div>\n",
  "itunes:summary": "In this Director's Cut of 'The Sound of Economics', Guntram Wolff and Simone Tagliapietra discuss the division of tasks for the new EU commissioners, following Ursua Von der Leyen's announcement of roles on 10th September. They specifically zoom in on the role of the Green Deal, one of the flagship projects of this commission.",
  "pubDate": "Wed, 11 Sep 2019 15:14:10 +0000",
  "guid": "tag:audioboom.com,2019-09-11:/posts/7365401",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}