{
  "title": "Episode 131: &#8220;I Hear a Symphony&#8221; by the Supremes",
  "link": "https://500songs.com/podcast/episode-131-i-hear-a-symphony-by-the-supremes/",
  "pubDate": "Wed, 25 Aug 2021 22:50:07 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=870",
  "description": "Episode one hundred and thirty-one of <em>A History of Rock Music in Five Hundred Songs</em> looks at “I Hear a Symphony” by the Supremes, and is the start of a three-episode look at Motown in 1965. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/55344229\">on \"Rescue Me\" by Fontella Bass</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nNo Mixcloud this week, as too many of the songs were by the Supremes.\n\nFor Motown-related information in this and other Motown episodes, I’ve used the following resources:\n\n<a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em> by Nelson George</a> is an excellent popular history of the various companies that became Motown.\n\n<a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em> by Berry Gordy</a> is Gordy’s own, understandably one-sided, but relatively well-written, autobiography.\n\n<a href=\"https://amzn.to/2VIpXII\"><em>Women of Motown: An Oral History</em> by Susan Whitall</a> is a collection of interviews with women involved in Motown.\n\n<a href=\"https://amzn.to/2xVdvfD\"><em>I Hear a Symphony: Motown and Crossover R&B </em>by J. Andrew Flory</a> is an academic look at Motown.\n\n<a href=\"https://amzn.to/2VLquJX\"><em>The Motown Encyclopaedia</em> by Graham Betts</a> is an exhaustive look at the people and records involved in Motown’s thirty-year history.\n\n<a href=\"https://amzn.to/3bZd5q6\"><em>How Sweet It Is</em> by Lamont Dozier and Scott B. Bomar </a>is Dozier’s autobiography, while <a href=\"https://amzn.to/3903ey8\"><em>Come and Get These Memories </em>by Brian and Eddie Holland and Dave Thompson</a> is the Holland brothers’.\n\nAnd <a href=\"https://motownjunkies.co.uk/\">Motown Junkies</a> is an infrequently-updated blog looking at (so far) the first 694 tracks released on Motown singles.\n\n<a href=\"https://amzn.to/3iOneXx\">Girl Groups</a> by John Clemente contains potted biographies of many groups of the era.\n\nThe Supremes biography I relied on most is <a href=\"https://amzn.to/30teiyS\"><em>The Supremes</em> by Mark Ribowsky</a>, which seems factually accurate but questionable in its judgments of people.\n\nI also used <a href=\"https://amzn.to/3bwBwKH\">this omnibus edition</a> of Mary Wilson’s two volumes of autobiography.\n\n<a href=\"https://amzn.to/3t3Cwfl\">This box set</a> contains everything you could want by the Supremes, but is extraordinarily expensive in physical form at the moment, though cheap as MP3s. <a href=\"https://amzn.to/3l1FfD5\">This</a> is a good budget substitute, though oddly doesn’t contain “Stop in the Name of Love”.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\nHi, this is Andrew. Between recording this episode and it going live, three great musicians, two of whom have been the subject of episodes of this podcast, sadly died. We lost Don Everly, Charlie Watts, and Tom T. Hall, and I just wanted to acknowledge them and their contributions to music before the episode starts. They'll all be missed.\n\n[theme music]\n\nJust a brief note before we start to say that this episode contains brief mentions of eating disorders, so if that might be a problem for you, check the transcript to make sure it's safe. Thanks.\n\nWe've spent much of the last few months looking at the intersections of three different movements, each of which was important -- the influence of the Beatles and to a lesser extent the other Merseybeat bands, the influence of Bob Dylan and the folk and protest movement, and the British R&B guitar bands who were taking their interpretation of the sound of Chess Records back to the USA.\n\nBut of course, while these guitar bands were all influencing everyone, they were also being influenced by the growth of soul, and in particular by Motown, and Motown's groups were among the few American acts who managed to keep having hits during the British Invasion. Indeed, 1965 was as much of a creative and commercial peak for the label as for the white guitar bands we've been looking at. So for the next few weeks we're going to move over to Detroit, and we're going to look at Motown. And this week and next week we're going to continue our look at the Holland-Dozier-Holland collaboration, and at the groups they were writing for.\n\nSo today, we're going to look at the Supremes, at the career of the only Black act to seriously challenge the Beatles for chart dominance in the sixties and at the start of the inter-group rivalries that eventually took them down. We're going to look at \"I Hear a Symphony” by the Supremes:\n\n[Excerpt: The Supremes, \"I Hear a Symphony\"]\n\nWhen we last looked at the Supremes, they had just had their second number one single. After having spent years being called \"the no-hit Supremes\" and recording third-rate material like \"The Man With the Rock and Roll Banjo Band\", they'd been taken on by Holland, Dozier, and Holland, Motown's new star songwriting team, and had recorded two songs written and produced by the team -- \"Where Did Our Love Go?\" and \"Baby Love\" -- both of which had reached number one.\n\nBut there were already tensions in the group. Most notably, there was the tension between Florence Ballard and Diana Ross. Ballard had always considered herself the lead singer of the group, and almost everyone who knew the group at the time agreed that Ballard was the better singer. But Berry Gordy, the owner of Motown, thought that Ross was the member of the group who had actual star potential, and insisted that she be the lead vocalist on everything the Supremes cut.\n\nAt first, this didn't matter too much -- after all, no matter who the lead singer on the records was, they were having the huge hits they'd always dreamed of -- but it inevitably led to friction within the group.\n\nBut in late 1964, at least, everyone was on the same page. Berry Gordy, in particular, was delighted by the group's continued success -- they had been the *only* act other than the Beatles or Bobby Vinton to have more than one number one on the pop charts in 1964 -- and by the end of the year, they had released their third, \"Come See About Me\".\n\"Come See About Me\" actually got released only a month after \"Baby Love\", before the latter had even reached the top of the charts, and it seems like a ridiculous idea to release another single so close to that one. But it came out so early to make sure the Supremes had the hit with it. Because a soundalike had come out on Wand Records even before the Supremes' single came out.\n\nA fourteen-year-old girl called Nella Dodds had decided that she could sing quite a bit like Diana Ross, and since the Supremes were the biggest female group in the country at this point, she had a chance at being a star, too.\nShe'd auditioned for Wand by singing along with the whole of the first Supremes album, and Wand Records had decided that she sounded enough like Ross that it was worth a shot putting out a single by her. They chose \"Come See About Me\", which had been released as an album track on that album, and put out this:\n\n[Excerpt: Nella Dodds, \"Come See About Me\"]\n\nDodds' version of the track was cut to be a soundalike, and was so similar to the Supremes version that it's actually quite easy to cut between the two records. You can hear the joins, but they're *spookily* similar:\n\n[Excerpt: The Supremes and Nella Dodds, \"Come See About Me\", alternating phrases]\n\nThat wasn't the only time a Holland-Dozier-Holland production would be copied wholesale -- we'll hear another, slightly less blatant, example later this episode.\n\nAs Dodds' single started to rise up the charts, Berry Gordy got furious. If the record sounded good enough to be a hit single, his label was going to have the hit with it, and so the Supremes' version of \"Come See About Me\" was rush-released. It went to number one, and Nella Dodds vanished into obscurity.\n\nThe group having three number one hits in a row focused everyone's minds, and Gordy held a meeting with Holland, Dozier, and Holland, and told them that from that point on the Supremes had to be their number one priority. They should drop everything they were doing and concentrate on making Supremes hits while the Supremes were having their moment of success.\n\nAnd so of course they did just that -- and in January 1965 they recorded the album which would contain the Supremes' fourth number one in a row:\n\n[Excerpt: The Supremes, \"Stop! In the Name of Love\"]\n\nThe story of how \"Stop! In the Name of Love\" was conceived tells us a lot about the kind of life that the people at Motown were living, now they were all successful and making a great deal of money. The way Lamont Dozier tells the story, his marriage had fallen apart, and he was sleeping with multiple women, some of whom thought they were the only one. Dozier would regularly head to a motel near Hitsville for some of these assignations, and one day while he was there with one of his women, another one tracked him down. The woman he was with made her escape, and Dozier tried to make excuses, claiming he had just got very tired at work and booked a motel room to have a rest so he wouldn't have to go all the way home. His girlfriend didn't believe this rather transparent lie, and started throwing things at him. Dozier started yelling at her to stop it, and eventually mangled the phrase \"Stop in the name of the law\", shouting instead \"Stop in the name of love!\"\n\nDozier immediately saw this line as the basis of a song, and his burst of inspiration amused the woman, who started laughing. It defused the situation, and led to a hit record.\n\n[Excerpt: The Supremes, \"Stop! In the Name of Love\"]\n\nIndeed, Dozier wasn't the only one whose experiences made up part of the lyrics for the song. All three of Holland, Dozier, and Holland were having complex love lives and going through the breakup of their first marriages. Eddie Holland has said that he used his own experiences in that regard in writing the lyrics to that song.\n\nAll three men were having affairs with multiple women, but two of those affairs were important in their working lives -- Brian Holland was dating Diana Ross, while Lamont Dozier was seeing Mary Wilson. According to Eddie Holland, Florence seemed to think that this meant that the  remaining members of their respective trios should also pair up, but Holland didn't think that he should get involved, given Florence's mental fragility and his own promiscuous nature. Both Lamont and Brian later split up with their respective Supremes partners, but luckily everyone was professional enough that they were all able to continue working together.\n\nAfter \"Stop! In the Name of Love\" came \"Back in Your Arms Again\", making five number ones in a row for the combination of the Supremes and Holland-Dozier-Holland. On top of this, Holland-Dozier-Holland were busily making hits for the Four Tops, who we'll hear more about next week, and for the Isley Brothers, as well as writing odd songs for other artists like Marvin Gaye.\n\nTo put this into perspective, at this point the *only* act ever to have had five number ones in a row on the US charts was Elvis, who had done it twice. The Beatles were about to hit their fifth, and would eventually get to six number ones in a row -- they had eleven in the UK, but many more Beatles singles were released in the US than in the UK, so there were more opportunities to break the streak. That was the company the Supremes were in.\n\nIt's important to stress how big the Supremes, Motown, and Holland-Dozier-Holland were in 1965. There were twenty-seven Billboard number one singles that year, and six of them were from Motown -- compared to five from the Beatles and two from the Rolling Stones. Of those six number one Motown singles, five of them were Holland-Dozier-Holland productions, and four were by the Supremes. Of course, number one records are not the only measure of success in the music industry, but they are definitely a measure.\n\nBy that measure, the Supremes were bigger than anyone except the Beatles, but this led to a certain amount of dissatisfaction among the rest of the Motown acts. They were being told that a rising tide would lift all boats, but the way they saw it, everyone who wasn't a Supreme was being ignored, unless they were named Smokey Robinson or Marvin Gaye. The Vandellas, for example, thought that records like \"Dancing in the Street\", which made number two in the charts, could have easily made number one had they been given the same kind of promotion as the Supremes.\nThis was, to them, particularly evident when it came to the first British tour of the Motortown Revue, in March 1965. While the various Motown acts were on tour in the UK, the opportunity came up to do a TV special for Granada TV, presented by Dusty Springfield, who was the driving force behind the special. Springfield was particularly an admirer of Martha and the Vandellas, and got Martha to duet with her on her own hit \"Wishin' and Hopin'\":\n\n[Excerpt: Dusty Springfield and Martha Reeves, \"Wishin' and Hopin'\"]\n\nYet while all the acts on the tour -- the Vandellas, Stevie Wonder, the Miracles, and the Temptations -- got their moments in the spotlight on the show, the Supremes did seem to dominate it, with more songs than any of the other acts.\n\nThis was partly just good sense -- Motown was only just starting to have a presence in the UK, and to the extent it did the Supremes were almost the only Motown artists that had made any impression on the public consciousness at all at this point -- but it was also because Berry Gordy was becoming increasingly infatuated with Diana Ross, and they finally consummated their relationship in Paris at the end of the tour.\n\nNow, it is important to note here that this is always portrayed in every book about the group or Motown as \"scheming Diana Ross used her feminine wiles to seduce hapless Berry Gordy, who was helplessly under her spell.” That's certainly one way to look at it. Another way to look at it is that Berry Gordy was a thirty-five-year-old married man sleeping with an employee of his who had only just turned twenty-one, and who had been his employee for several years.\n\nI wouldn't mention any of this at all -- I despise the gossiping nature of much music writing -- except that it is impossible to read anything at all about the Supremes without getting a take on the group's career from this point on that has Ross using her sexuality to manipulate Gordy in order to fulfil her own scheming ambition. I think there's no question at all that Ross was ambitious, but I think most of the narrative about her is rooted in misogyny, and a very deep misunderstanding of the power dynamics in her relationship with Gordy.\n\nBut there is absolutely no question that Gordy saw the Supremes as the most important act on Motown -- and that he saw Diana Ross as the most important part of the Supremes. And decisions made for the benefit of Ross were not always decisions that would benefit her colleagues. For example, at this point in time, the fashion was for women to be very curvy, rather than thin. Ross was extremely thin, and so the group's outfits were padded. This wasn't such a problem for Mary, who had her own issues about a lack of curves, but for Florence, who was bigger than the other two, it was humiliating, because it made her look bigger than she was, and there was no question of the padding being removed from her clothes -- the decisions were being made on the basis of what made Diana look good.\n\nOf course, fashions change, and with the rise of the supermodel Twiggy, suddenly a more emaciated look became popular, so the group were able to drop the padding -- but that still left Florence as the unfashionable-looking one. She became deeply insecure about this, though she would hide it with humour -- after Twiggy became popular, there was a scripted bit of the show where Ross would say \"thin is in\", and Florence ad libbed \"but fat is where it's at!\", and her ad lib became part of the routine.\n\nAfter the Supremes' run of five number one singles, it might have seemed that they were invulnerable, but in September 1965, \"Nothing But Heartaches\" came out, and it only made number eleven:\n\n[Excerpt: The Supremes, “Nothing But Heartaches”]\n\nFor any other act, this would be a major hit, but for an act that had had five number one hits in a row, it was a failure, and it was treated as such, even though it sold over a million copies. Berry Gordy actually sent out a memo to all Motown creative staff, saying \"We will release nothing less than top ten product on any artist: and because the Supremes' world-wide acceptance is greater than the other artists, on them we will only release number-one records\".\nOf course, that was easier said than done -- every songwriter and producer wanted only to be making number one records, after all, but it's a symptom of the attitudes that were showing up at Motown by this point -- a number eleven hit for a group that two years earlier had been laughed at for being the \"no hit Supremes\" was now regarded as a failure to be punished, while major successes were just to be considered the norm.\n\nBut it's also a tribute to how successful Holland, Dozier, and Holland were by this point that the next Supremes single was, once again, another number one hit.\n\nThe inspiration for \"I Hear a Symphony\" came from Dozier thinking about how characters in films often had musical motifs on the soundtrack, and how ridiculous it would be if people in real life walked around with their own musical accompaniments. But it might also be that the writing trio had something else in mind. In August, just over a month before the recording of \"I Hear a Symphony\", a girl group called The Toys had released a single called \"A Lover's Concerto\":\n\n[Excerpt: The Toys, \"A Lover's Concerto\"]\n\nThat song had been based on a piece of music usually incorrectly attributed to Bach, but actually by the Baroque composer Christian Petzold, and had been written by Sandy Linzer and Denny Randell, two writers who usually wrote for the Four Seasons, whose four-on-the-floor style was very similar to that of Holland, Dozier, and Holland. Linzer and Randell had even put in a little nod to the Supremes in the song. Compare the intro of the Toys record:\n\n[Excerpt: The Toys, \"A Lover's Concerto\"]\n\nWith the intro from \"Stop! In the Name of Love!\":\n\n[Excerpt: The Supremes, \"Stop! In the Name of Love!\"]\n\nThe section from eight through sixteen seconds on the Toys record is so close to the section from eleven through nineteen seconds on the Supremes one that you can play them almost together -- I had to do a tiny splice five seconds in here because the musicians on the Toys record don't have the perfect timing of the Funk Brothers and drifted by 0.1 seconds, but I hope you can see just how close those two sections are:\n\n[Excerpt: The Supremes and The Toys together]\n\nSee what I mean?\n\nThe Toys' record reached number two on the charts -- not a number one, but better than the most recent Supremes record. So it might well be that Holland, Dozier, and Holland were also thinking about the Toys' record when they came to make their new one -- especially since it had contained a little nod to their own work. And the odd thing about that section is it's not integral to the Toys record at all -- it's just there, I think, as a nod and a wink to anyone listening for it.\nCertainly, Holland, Dozier, and Holland were aware of the Toys record -- they had the Supremes cut a cover version of it for the I Hear a Symphony album. That album also contained the Supremes' version of the Beatles' \"Yesterday\" -- another hit which had, of course, referenced classical music, with its string quartet backing.\n\nOne hit record referencing classical music might be a fluke, but two was a pattern, and so whatever the writers' later claims about the inspiration, it's reasonable to suspect that at the very least they were paying close attention to this pattern.\n\nThe lyrics to \"I Hear a Symphony\" were written in a rush. The original plan had been for the group to release a song called \"Mother Dear\" as their next single, but then Brian Holland and Lamont Dozier came up with the track and title for \"I Hear a Symphony\", and knew it would be a winner.\n\nThere was one problem, though -- the single needed to be out relatively quickly, and the Supremes were travelling to the UK in two days' time. When the instrumental track had been cut, Brian Holland phoned his brother, waking him up, and telling him they needed a set of lyrics for the very next day.\n\nHolland was actually already a little burned out that day -- he'd just been working on \"Road Runner\" by Junior Walker and the All-Stars, which was intended as the follow-up to their big hit \"Shotgun\":\n\n[Excerpt: Junior Walker and the All-Stars, \"(I'm a) Road Runner\"]\n\nAt least, Holland says that was what he was working on, though it came out five months later – but Motown often delayed releases by minor acts.\n\n\"Road Runner\" was not normal Holland-Dozier-Holland material, it had been difficult to write, and not only that they'd discovered that Walker couldn't play the saxophone part in the same keys that he could sing the song, so they'd had to varispeed the track in order to get both parts down.\n\nHolland had had a tiring day, and had just gone to sleep when the phone had rung. Brian Holland had a copy of the backing track couriered over to Eddie in the middle of the night, and Eddie stayed up all night writing the lyrics, eventually finishing them in the studio while he was teaching Diana Ross the song:\n\n[Excerpt: The Supremes, \"I Hear a Symphony\"]\n\nBecause it had to be recorded in such a hurry, the Supremes were in London when the mixing was finalised -- as was Berry Gordy, who normally ran Motown's quality control meetings, the meetings in which the executives and producers all checked all the work that was going out to make sure it met the company's standards.\n\nNormally, if Gordy was out of town, Brian Holland would take over the meeting, but a new Supremes single was important enough to Gordy that he made an international phone call to the meeting and listened to the record over the phone. Gordy insisted that the vocal was too high in the mix, but Brian Holland pushed back, and Gordy eventually agreed to let the record go out as it was, despite his reservations. He agreed that he had been wrong when the record went to number one.\n\nIt wouldn't start another streak of number ones, but the next eight singles would all go top ten, and the group would have another six number ones, including a streak of four in late 1966 and early 1967.\n\nThere were other records, as well -- Christmas singles (which don't tend to get counted as \"real singles\", because Christmas records got put on their own special charts), and promotional efforts, like \"Things Are Changing For The Better\". That was a song that Brian Wilson and Mike Love of the Beach Boys had originally written for the Ronettes, under the title \"Don't Hurt My Little Sister\", but while Spector had cut a backing track, the song hadn't been considered worth the Ronettes adding their vocals, and the Beach Boys had cut their own version as an album track:\n\n[Excerpt: The Beach Boys, \"Don't Hurt My Little Sister\"]\n\nBut a year later, the Advertising Council wanted a public information song, to promote the Civil Rights Act of 1964 and the subsequent Voting Rights Act of 1965, two landmark acts that between them meant that for the first time discrimination against Black people wasn't legal. They turned to Spector to come up with something, and Spector, not wanting to waste a hit on them, came up with some new lyrics for the unused backing track, using the various slogans the Advertising Council wanted. Spector got his assistant Jerry Riopelle to finish the track off, and three versions were cut with different vocals over the same backing track. Riopelle produced a version with the Blossoms on vocals, another version was performed by the white pop group Jay and the Americans, and finally Motown put out a version with the Supremes singing over Spector's track.\n\nIt's not the greatest track ever recorded or anything, but it is the only collaboration between the three biggest American hit-makers of the early sixties -- the Beach Boys, Spector, and the Supremes -- even if they didn't actually work together on it, and so \"Things Are Changing For The Better\" is interesting as a capsule of American pop music in 1965:\n\n[Excerpt: The Supremes, \"Things Are Changing For The Better\"]\n\nBut Gordy had plans for the Supremes that involved them moving away from being merely pop stars, and the title of “I Hear a Symphony” worked well for Gordy's plans. Like Sam Cooke before them, he wanted them to move into the more lucrative middle-class white market, and like Sam Cooke that meant playing the Copacabana.\n\nWe talked a little about the Copacabana -- or the Copa as it was universally known -- in the episode on \"A Change is Gonna Come\", but it's hard to get across now what an important venue it was. It was a mob-controlled nightclub in New York, and while it was only a nightclub, not a huge-capacity venue, headlining there was considered a sign that an act had made it and become part of the elite. If you could headline at the Copacabana in the early sixties, you were no longer a transitory pop act who might be gone tomorrow, you were up there with Tony Bennett and Sammy Davis Jr and Martin and Lewis.\n\nOf course, that whole showbusiness world has largely gone now, and the entertainment industry was going through massive changes in the early sixties that would soon make whether an act had headlined at the Copa as irrelevant to their future prospects as where they had gone to school, but nobody at the time knew that the changes that were happening -- thanks in large part to labels like Motown -- were going to be lasting ones, rather than just fads.\n\nSo Gordy decided that his flagship group were going to headline at the Copa -- even though he had to agree to a deal which meant that for their initial three-week residency  the group members only made sixty dollars a show each before expenses.\n\nAnd they were going to do a \"classy\" show. Yes, they would include a few of the hits, but most of the songs would be things like \"Somewhere\" from West Side Story, the Barbra Streisand song \"People\" -- which would be Florence's one lead vocal in the show -- the Guy Lombardo song \"Enjoy Yourself, It's Later Than You Think\", and of all things \"Rock-a-bye Your Baby With a Dixie Melody\":\n\n[Excerpt: The Supremes, \"Rock-A-Bye Your Baby With a Dixie Melody\"]\n\nThe rest of the repertoire was show tunes, a gender-swapped version of \"The Girl From Ipanema\" retitled \"The Boy From Ipanema\", a parody of Roger Miller's \"King of the Road\" titled \"Queen of the House\", and a medley of Sam Cooke's hits. Other than the Cooke material and the brief run-throughs of their own number ones, the setlist was tailored entirely for the Copa's clientele, which barely overlapped at all with the Motown audience.\n\nThe Copa residency was a triumph, and led to the Supremes making regular appearances at the venue for seven years, but it came at a great cost to the group members. Ross was so stressed she lost a stone of her already low weight, the first sign of the anorexia which she would deal with for many years to come. Meanwhile, Florence had to miss a chunk of the rehearsals as she became seriously ill with the flu, though she got herself well enough to make the opening night.\n\nAnd while it was what Berry Gordy had been working towards for years, it couldn't have come at a worse time for him personally -- his elder sister Loucye died suddenly of a brain haemorrhage shortly before the residency, and her funeral was actually the morning of the opening night.\n\nThe opening night went exactly as Gordy had planned, except for one ad-lib -- during the song \"You're Nobody 'Til Somebody Loves You\", after Ross sang the line “But gold won’t bring you happiness,” Florence interjected a joking line -- \"Now wait a minute, honey. I don’t know about all that.\"\n\nThe audience loved her ad-lib -- Sammy Davis Jr., who was in the audience, yelled out \"All right, girl! You tell it like it is!\" -- and the line got added as a regular part of the performance:\n\n[Excerpt: The Supremes, “You're Nobody 'Til Somebody Loves You”]\n\nalong with a rather less fun bit where Florence would mention \"little old me\", and Ross would snarkily respond \"Little?\"\nBut even though it worked, Gordy was furious, partly just because he was understandably in a bad mood after his sister's funeral, partly because it was a deviation from the carefully-scripted performance, and partly because it was a moment in the spotlight for someone other than Diana Ross. As retaliation, a couple of days later he had Harvey Fuqua tell the group that they were dropping \"People\" -- Florence's only lead vocal -- from the set because there were too many show tunes. Then, a week or so later, \"People\" was added back to the set, but with Ross singing lead.\n\n(Mary Wilson had also asked to have her own lead vocal in the set, but Gordy had just looked at her sadly and said \"Mary, you know you can't sing\".)\n\nFlorence was devastated. She was already drinking too much, but that escalated after the Copa engagement. Even though the group had never been as close as many groups are, they had all genuinely attempted to create a bond with each other, even all moving on to the same street. But now, that physical closeness just became an opportunity for the women to note the comings and goings at each other's houses and pass snarky comment on it.\n\nBallard was fast becoming considered a liability by the powers that be at Motown, and even the existence of the Supremes was starting to be seen as something that was merely a hindrance for Diana Ross' career, rather than them being seen for what they were -- a massively successful group, not just a lead singer and her backing vocalists.\n\nFlorence wasn't very long for the group, and when we next look at them, we'll no longer be looking at the Supremes, but at Diana Ross and the Supremes...",
  "itunes:subtitle": "Episode one hundred and thirty-one of A History of Rock Music in Five Hundred Songs looks at “I Hear a Symphony” by the Supremes, and is the start of a three-episode look at Motown in 1965. Click the full post to read liner notes, links to more informati",
  "itunes:keywords": "Berry Gordy,Brian Wilson,Diana Ross,Dusty Springfield,Harvey Fuqua,Holland-Dozier-Holland,Junior Walker,Martha and the Vandellas,Motown,Phil Spector,The Beach Boys,The Blossoms,The Ronettes,The Supremes,The Toys",
  "itunes:episodeType": "full",
  "itunes:episode": 131,
  "content:encoded": "Episode one hundred and thirty-one of <em>A History of Rock Music in Five Hundred Songs</em> looks at “I Hear a Symphony” by the Supremes, and is the start of a three-episode look at Motown in 1965. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/55344229\">on \"Rescue Me\" by Fontella Bass</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nNo Mixcloud this week, as too many of the songs were by the Supremes.\n\nFor Motown-related information in this and other Motown episodes, I’ve used the following resources:\n\n<a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em> by Nelson George</a> is an excellent popular history of the various companies that became Motown.\n\n<a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em> by Berry Gordy</a> is Gordy’s own, understandably one-sided, but relatively well-written, autobiography.\n\n<a href=\"https://amzn.to/2VIpXII\"><em>Women of Motown: An Oral History</em> by Susan Whitall</a> is a collection of interviews with women involved in Motown.\n\n<a href=\"https://amzn.to/2xVdvfD\"><em>I Hear a Symphony: Motown and Crossover R&B </em>by J. Andrew Flory</a> is an academic look at Motown.\n\n<a href=\"https://amzn.to/2VLquJX\"><em>The Motown Encyclopaedia</em> by Graham Betts</a> is an exhaustive look at the people and records involved in Motown’s thirty-year history.\n\n<a href=\"https://amzn.to/3bZd5q6\"><em>How Sweet It Is</em> by Lamont Dozier and Scott B. Bomar </a>is Dozier’s autobiography, while <a href=\"https://amzn.to/3903ey8\"><em>Come and Get These Memories </em>by Brian and Eddie Holland and Dave Thompson</a> is the Holland brothers’.\n\nAnd <a href=\"https://motownjunkies.co.uk/\">Motown Junkies</a> is an infrequently-updated blog looking at (so far) the first 694 tracks released on Motown singles.\n\n<a href=\"https://amzn.to/3iOneXx\">Girl Groups</a> by John Clemente contains potted biographies of many groups of the era.\n\nThe Supremes biography I relied on most is <a href=\"https://amzn.to/30teiyS\"><em>The Supremes</em> by Mark Ribowsky</a>, which seems factually accurate but questionable in its judgments of people.\n\nI also used <a href=\"https://amzn.to/3bwBwKH\">this omnibus edition</a> of Mary Wilson’s two volumes of autobiography.\n\n<a href=\"https://amzn.to/3t3Cwfl\">This box set</a> contains everything you could want by the Supremes, but is extraordinarily expensive in physical form at the moment, though cheap as MP3s. <a href=\"https://amzn.to/3l1FfD5\">This</a> is a good budget substitute, though oddly doesn’t contain “Stop in the Name of Love”.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\nHi, this is Andrew. Between recording this episode and it going live, three great musicians, two of whom have been the subject of episodes of this podcast, sadly died. We lost Don Everly, Charlie Watts, and Tom T. Hall, and I just wanted to acknowledge them and their contributions to music before the episode starts. They'll all be missed.\n\n[theme music]\n\nJust a brief note before we start to say that this episode contains brief mentions of eating disorders, so if that might be a problem for you, check the transcript to make sure it's safe. Thanks.\n\nWe've spent much of the last few months looking at the intersections of three different movements, each of which was important -- the influence of the Beatles and to a lesser extent the other Merseybeat bands, the influence of Bob Dylan and the folk and protest movement, and the British R&B guitar bands who were taking their interpretation of the sound of Chess Records back to the USA.\n\nBut of course, while these guitar bands were all influencing everyone, they were also being influenced by the growth of soul, and in particular by Motown, and Motown's groups were among the few American acts who managed to keep having hits during the British Invasion. Indeed, 1965 was as much of a creative and commercial peak for the label as for the white guitar bands we've been looking at. So for the next few weeks we're going to move over to Detroit, and we're going to look at Motown. And this week and next week we're going to continue our look at the Holland-Dozier-Holland collaboration, and at the groups they were writing for.\n\nSo today, we're going to look at the Supremes, at the career of the only Black act to seriously challenge the Beatles for chart dominance in the sixties and at the start of the inter-group rivalries that eventually took them down. We're going to look at \"I Hear a Symphony” by the Supremes:\n\n[Excerpt: The Supremes, \"I Hear a Symphony\"]\n\nWhen we last looked at the Supremes, they had just had their second number one single. After having spent years being called \"the no-hit Supremes\" and recording third-rate material like \"The Man With the Rock and Roll Banjo Band\", they'd been taken on by Holland, Dozier, and Holland, Motown's new star songwriting team, and had recorded two songs written and produced by the team -- \"Where Did Our Love Go?\" and \"Baby Love\" -- both of which had reached number one.\n\nBut there were already tensions in the group. Most notably, there was the tension between Florence Ballard and Diana Ross. Ballard had always considered herself the lead singer of the group, and almost everyone who knew the group at the time agreed that Ballard was the better singer. But Berry Gordy, the owner of Motown, thought that Ross was the member of the group who had actual star potential, and insisted that she be the lead vocalist on everything the Supremes cut.\n\nAt first, this didn't matter too much -- after all, no matter who the lead singer on the records was, they were having the huge hits they'd always dreamed of -- but it inevitably led to friction within the group.\n\nBut in late 1964, at least, everyone was on the same page. Berry Gordy, in particular, was delighted by the group's continued success -- they had been the *only* act other than the Beatles or Bobby Vinton to have more than one number one on the pop charts in 1964 -- and by the end of the year, they had released their third, \"Come See About Me\".\n\"Come See About Me\" actually got released only a month after \"Baby Love\", before the latter had even reached the top of the charts, and it seems like a ridiculous idea to release another single so close to that one. But it came out so early to make sure the Supremes had the hit with it. Because a soundalike had come out on Wand Records even before the Supremes' single came out.\n\nA fourteen-year-old girl called Nella Dodds had decided that she could sing quite a bit like Diana Ross, and since the Supremes were the biggest female group in the country at this point, she had a chance at being a star, too.\nShe'd auditioned for Wand by singing along with the whole of the first Supremes album, and Wand Records had decided that she sounded enough like Ross that it was worth a shot putting out a single by her. They chose \"Come See About Me\", which had been released as an album track on that album, and put out this:\n\n[Excerpt: Nella Dodds, \"Come See About Me\"]\n\nDodds' version of the track was cut to be a soundalike, and was so similar to the Supremes version that it's actually quite easy to cut between the two records. You can hear the joins, but they're *spookily* similar:\n\n[Excerpt: The Supremes and Nella Dodds, \"Come See About Me\", alternating phrases]\n\nThat wasn't the only time a Holland-Dozier-Holland production would be copied wholesale -- we'll hear another, slightly less blatant, example later this episode.\n\nAs Dodds' single started to rise up the charts, Berry Gordy got furious. If the record sounded good enough to be a hit single, his label was going to have the hit with it, and so the Supremes' version of \"Come See About Me\" was rush-released. It went to number one, and Nella Dodds vanished into obscurity.\n\nThe group having three number one hits in a row focused everyone's minds, and Gordy held a meeting with Holland, Dozier, and Holland, and told them that from that point on the Supremes had to be their number one priority. They should drop everything they were doing and concentrate on making Supremes hits while the Supremes were having their moment of success.\n\nAnd so of course they did just that -- and in January 1965 they recorded the album which would contain the Supremes' fourth number one in a row:\n\n[Excerpt: The Supremes, \"Stop! In the Name of Love\"]\n\nThe story of how \"Stop! In the Name of Love\" was conceived tells us a lot about the kind of life that the people at Motown were living, now they were all successful and making a great deal of money. The way Lamont Dozier tells the story, his marriage had fallen apart, and he was sleeping with multiple women, some of whom thought they were the only one. Dozier would regularly head to a motel near Hitsville for some of these assignations, and one day while he was there with one of his women, another one tracked him down. The woman he was with made her escape, and Dozier tried to make excuses, claiming he had just got very tired at work and booked a motel room to have a rest so he wouldn't have to go all the way home. His girlfriend didn't believe this rather transparent lie, and started throwing things at him. Dozier started yelling at her to stop it, and eventually mangled the phrase \"Stop in the name of the law\", shouting instead \"Stop in the name of love!\"\n\nDozier immediately saw this line as the basis of a song, and his burst of inspiration amused the woman, who started laughing. It defused the situation, and led to a hit record.\n\n[Excerpt: The Supremes, \"Stop! In the Name of Love\"]\n\nIndeed, Dozier wasn't the only one whose experiences made up part of the lyrics for the song. All three of Holland, Dozier, and Holland were having complex love lives and going through the breakup of their first marriages. Eddie Holland has said that he used his own experiences in that regard in writing the lyrics to that song.\n\nAll three men were having affairs with multiple women, but two of those affairs were important in their working lives -- Brian Holland was dating Diana Ross, while Lamont Dozier was seeing Mary Wilson. According to Eddie Holland, Florence seemed to think that this meant that the  remaining members of their respective trios should also pair up, but Holland didn't think that he should get involved, given Florence's mental fragility and his own promiscuous nature. Both Lamont and Brian later split up with their respective Supremes partners, but luckily everyone was professional enough that they were all able to continue working together.\n\nAfter \"Stop! In the Name of Love\" came \"Back in Your Arms Again\", making five number ones in a row for the combination of the Supremes and Holland-Dozier-Holland. On top of this, Holland-Dozier-Holland were busily making hits for the Four Tops, who we'll hear more about next week, and for the Isley Brothers, as well as writing odd songs for other artists like Marvin Gaye.\n\nTo put this into perspective, at this point the *only* act ever to have had five number ones in a row on the US charts was Elvis, who had done it twice. The Beatles were about to hit their fifth, and would eventually get to six number ones in a row -- they had eleven in the UK, but many more Beatles singles were released in the US than in the UK, so there were more opportunities to break the streak. That was the company the Supremes were in.\n\nIt's important to stress how big the Supremes, Motown, and Holland-Dozier-Holland were in 1965. There were twenty-seven Billboard number one singles that year, and six of them were from Motown -- compared to five from the Beatles and two from the Rolling Stones. Of those six number one Motown singles, five of them were Holland-Dozier-Holland productions, and four were by the Supremes. Of course, number one records are not the only measure of success in the music industry, but they are definitely a measure.\n\nBy that measure, the Supremes were bigger than anyone except the Beatles, but this led to a certain amount of dissatisfaction among the rest of the Motown acts. They were being told that a rising tide would lift all boats, but the way they saw it, everyone who wasn't a Supreme was being ignored, unless they were named Smokey Robinson or Marvin Gaye. The Vandellas, for example, thought that records like \"Dancing in the Street\", which made number two in the charts, could have easily made number one had they been given the same kind of promotion as the Supremes.\nThis was, to them, particularly evident when it came to the first British tour of the Motortown Revue, in March 1965. While the various Motown acts were on tour in the UK, the opportunity came up to do a TV special for Granada TV, presented by Dusty Springfield, who was the driving force behind the special. Springfield was particularly an admirer of Martha and the Vandellas, and got Martha to duet with her on her own hit \"Wishin' and Hopin'\":\n\n[Excerpt: Dusty Springfield and Martha Reeves, \"Wishin' and Hopin'\"]\n\nYet while all the acts on the tour -- the Vandellas, Stevie Wonder, the Miracles, and the Temptations -- got their moments in the spotlight on the show, the Supremes did seem to dominate it, with more songs than any of the other acts.\n\nThis was partly just good sense -- Motown was only just starting to have a presence in the UK, and to the extent it did the Supremes were almost the only Motown artists that had made any impression on the public consciousness at all at this point -- but it was also because Berry Gordy was becoming increasingly infatuated with Diana Ross, and they finally consummated their relationship in Paris at the end of the tour.\n\nNow, it is important to note here that this is always portrayed in every book about the group or Motown as \"scheming Diana Ross used her feminine wiles to seduce hapless Berry Gordy, who was helplessly under her spell.” That's certainly one way to look at it. Another way to look at it is that Berry Gordy was a thirty-five-year-old married man sleeping with an employee of his who had only just turned twenty-one, and who had been his employee for several years.\n\nI wouldn't mention any of this at all -- I despise the gossiping nature of much music writing -- except that it is impossible to read anything at all about the Supremes without getting a take on the group's career from this point on that has Ross using her sexuality to manipulate Gordy in order to fulfil her own scheming ambition. I think there's no question at all that Ross was ambitious, but I think most of the narrative about her is rooted in misogyny, and a very deep misunderstanding of the power dynamics in her relationship with Gordy.\n\nBut there is absolutely no question that Gordy saw the Supremes as the most important act on Motown -- and that he saw Diana Ross as the most important part of the Supremes. And decisions made for the benefit of Ross were not always decisions that would benefit her colleagues. For example, at this point in time, the fashion was for women to be very curvy, rather than thin. Ross was extremely thin, and so the group's outfits were padded. This wasn't such a problem for Mary, who had her own issues about a lack of curves, but for Florence, who was bigger than the other two, it was humiliating, because it made her look bigger than she was, and there was no question of the padding being removed from her clothes -- the decisions were being made on the basis of what made Diana look good.\n\nOf course, fashions change, and with the rise of the supermodel Twiggy, suddenly a more emaciated look became popular, so the group were able to drop the padding -- but that still left Florence as the unfashionable-looking one. She became deeply insecure about this, though she would hide it with humour -- after Twiggy became popular, there was a scripted bit of the show where Ross would say \"thin is in\", and Florence ad libbed \"but fat is where it's at!\", and her ad lib became part of the routine.\n\nAfter the Supremes' run of five number one singles, it might have seemed that they were invulnerable, but in September 1965, \"Nothing But Heartaches\" came out, and it only made number eleven:\n\n[Excerpt: The Supremes, “Nothing But Heartaches”]\n\nFor any other act, this would be a major hit, but for an act that had had five number one hits in a row, it was a failure, and it was treated as such, even though it sold over a million copies. Berry Gordy actually sent out a memo to all Motown creative staff, saying \"We will release nothing less than top ten product on any artist: and because the Supremes' world-wide acceptance is greater than the other artists, on them we will only release number-one records\".\nOf course, that was easier said than done -- every songwriter and producer wanted only to be making number one records, after all, but it's a symptom of the attitudes that were showing up at Motown by this point -- a number eleven hit for a group that two years earlier had been laughed at for being the \"no hit Supremes\" was now regarded as a failure to be punished, while major successes were just to be considered the norm.\n\nBut it's also a tribute to how successful Holland, Dozier, and Holland were by this point that the next Supremes single was, once again, another number one hit.\n\nThe inspiration for \"I Hear a Symphony\" came from Dozier thinking about how characters in films often had musical motifs on the soundtrack, and how ridiculous it would be if people in real life walked around with their own musical accompaniments. But it might also be that the writing trio had something else in mind. In August, just over a month before the recording of \"I Hear a Symphony\", a girl group called The Toys had released a single called \"A Lover's Concerto\":\n\n[Excerpt: The Toys, \"A Lover's Concerto\"]\n\nThat song had been based on a piece of music usually incorrectly attributed to Bach, but actually by the Baroque composer Christian Petzold, and had been written by Sandy Linzer and Denny Randell, two writers who usually wrote for the Four Seasons, whose four-on-the-floor style was very similar to that of Holland, Dozier, and Holland. Linzer and Randell had even put in a little nod to the Supremes in the song. Compare the intro of the Toys record:\n\n[Excerpt: The Toys, \"A Lover's Concerto\"]\n\nWith the intro from \"Stop! In the Name of Love!\":\n\n[Excerpt: The Supremes, \"Stop! In the Name of Love!\"]\n\nThe section from eight through sixteen seconds on the Toys record is so close to the section from eleven through nineteen seconds on the Supremes one that you can play them almost together -- I had to do a tiny splice five seconds in here because the musicians on the Toys record don't have the perfect timing of the Funk Brothers and drifted by 0.1 seconds, but I hope you can see just how close those two sections are:\n\n[Excerpt: The Supremes and The Toys together]\n\nSee what I mean?\n\nThe Toys' record reached number two on the charts -- not a number one, but better than the most recent Supremes record. So it might well be that Holland, Dozier, and Holland were also thinking about the Toys' record when they came to make their new one -- especially since it had contained a little nod to their own work. And the odd thing about that section is it's not integral to the Toys record at all -- it's just there, I think, as a nod and a wink to anyone listening for it.\nCertainly, Holland, Dozier, and Holland were aware of the Toys record -- they had the Supremes cut a cover version of it for the I Hear a Symphony album. That album also contained the Supremes' version of the Beatles' \"Yesterday\" -- another hit which had, of course, referenced classical music, with its string quartet backing.\n\nOne hit record referencing classical music might be a fluke, but two was a pattern, and so whatever the writers' later claims about the inspiration, it's reasonable to suspect that at the very least they were paying close attention to this pattern.\n\nThe lyrics to \"I Hear a Symphony\" were written in a rush. The original plan had been for the group to release a song called \"Mother Dear\" as their next single, but then Brian Holland and Lamont Dozier came up with the track and title for \"I Hear a Symphony\", and knew it would be a winner.\n\nThere was one problem, though -- the single needed to be out relatively quickly, and the Supremes were travelling to the UK in two days' time. When the instrumental track had been cut, Brian Holland phoned his brother, waking him up, and telling him they needed a set of lyrics for the very next day.\n\nHolland was actually already a little burned out that day -- he'd just been working on \"Road Runner\" by Junior Walker and the All-Stars, which was intended as the follow-up to their big hit \"Shotgun\":\n\n[Excerpt: Junior Walker and the All-Stars, \"(I'm a) Road Runner\"]\n\nAt least, Holland says that was what he was working on, though it came out five months later – but Motown often delayed releases by minor acts.\n\n\"Road Runner\" was not normal Holland-Dozier-Holland material, it had been difficult to write, and not only that they'd discovered that Walker couldn't play the saxophone part in the same keys that he could sing the song, so they'd had to varispeed the track in order to get both parts down.\n\nHolland had had a tiring day, and had just gone to sleep when the phone had rung. Brian Holland had a copy of the backing track couriered over to Eddie in the middle of the night, and Eddie stayed up all night writing the lyrics, eventually finishing them in the studio while he was teaching Diana Ross the song:\n\n[Excerpt: The Supremes, \"I Hear a Symphony\"]\n\nBecause it had to be recorded in such a hurry, the Supremes were in London when the mixing was finalised -- as was Berry Gordy, who normally ran Motown's quality control meetings, the meetings in which the executives and producers all checked all the work that was going out to make sure it met the company's standards.\n\nNormally, if Gordy was out of town, Brian Holland would take over the meeting, but a new Supremes single was important enough to Gordy that he made an international phone call to the meeting and listened to the record over the phone. Gordy insisted that the vocal was too high in the mix, but Brian Holland pushed back, and Gordy eventually agreed to let the record go out as it was, despite his reservations. He agreed that he had been wrong when the record went to number one.\n\nIt wouldn't start another streak of number ones, but the next eight singles would all go top ten, and the group would have another six number ones, including a streak of four in late 1966 and early 1967.\n\nThere were other records, as well -- Christmas singles (which don't tend to get counted as \"real singles\", because Christmas records got put on their own special charts), and promotional efforts, like \"Things Are Changing For The Better\". That was a song that Brian Wilson and Mike Love of the Beach Boys had originally written for the Ronettes, under the title \"Don't Hurt My Little Sister\", but while Spector had cut a backing track, the song hadn't been considered worth the Ronettes adding their vocals, and the Beach Boys had cut their own version as an album track:\n\n[Excerpt: The Beach Boys, \"Don't Hurt My Little Sister\"]\n\nBut a year later, the Advertising Council wanted a public information song, to promote the Civil Rights Act of 1964 and the subsequent Voting Rights Act of 1965, two landmark acts that between them meant that for the first time discrimination against Black people wasn't legal. They turned to Spector to come up with something, and Spector, not wanting to waste a hit on them, came up with some new lyrics for the unused backing track, using the various slogans the Advertising Council wanted. Spector got his assistant Jerry Riopelle to finish the track off, and three versions were cut with different vocals over the same backing track. Riopelle produced a version with the Blossoms on vocals, another version was performed by the white pop group Jay and the Americans, and finally Motown put out a version with the Supremes singing over Spector's track.\n\nIt's not the greatest track ever recorded or anything, but it is the only collaboration between the three biggest American hit-makers of the early sixties -- the Beach Boys, Spector, and the Supremes -- even if they didn't actually work together on it, and so \"Things Are Changing For The Better\" is interesting as a capsule of American pop music in 1965:\n\n[Excerpt: The Supremes, \"Things Are Changing For The Better\"]\n\nBut Gordy had plans for the Supremes that involved them moving away from being merely pop stars, and the title of “I Hear a Symphony” worked well for Gordy's plans. Like Sam Cooke before them, he wanted them to move into the more lucrative middle-class white market, and like Sam Cooke that meant playing the Copacabana.\n\nWe talked a little about the Copacabana -- or the Copa as it was universally known -- in the episode on \"A Change is Gonna Come\", but it's hard to get across now what an important venue it was. It was a mob-controlled nightclub in New York, and while it was only a nightclub, not a huge-capacity venue, headlining there was considered a sign that an act had made it and become part of the elite. If you could headline at the Copacabana in the early sixties, you were no longer a transitory pop act who might be gone tomorrow, you were up there with Tony Bennett and Sammy Davis Jr and Martin and Lewis.\n\nOf course, that whole showbusiness world has largely gone now, and the entertainment industry was going through massive changes in the early sixties that would soon make whether an act had headlined at the Copa as irrelevant to their future prospects as where they had gone to school, but nobody at the time knew that the changes that were happening -- thanks in large part to labels like Motown -- were going to be lasting ones, rather than just fads.\n\nSo Gordy decided that his flagship group were going to headline at the Copa -- even though he had to agree to a deal which meant that for their initial three-week residency  the group members only made sixty dollars a show each before expenses.\n\nAnd they were going to do a \"classy\" show. Yes, they would include a few of the hits, but most of the songs would be things like \"Somewhere\" from West Side Story, the Barbra Streisand song \"People\" -- which would be Florence's one lead vocal in the show -- the Guy Lombardo song \"Enjoy Yourself, It's Later Than You Think\", and of all things \"Rock-a-bye Your Baby With a Dixie Melody\":\n\n[Excerpt: The Supremes, \"Rock-A-Bye Your Baby With a Dixie Melody\"]\n\nThe rest of the repertoire was show tunes, a gender-swapped version of \"The Girl From Ipanema\" retitled \"The Boy From Ipanema\", a parody of Roger Miller's \"King of the Road\" titled \"Queen of the House\", and a medley of Sam Cooke's hits. Other than the Cooke material and the brief run-throughs of their own number ones, the setlist was tailored entirely for the Copa's clientele, which barely overlapped at all with the Motown audience.\n\nThe Copa residency was a triumph, and led to the Supremes making regular appearances at the venue for seven years, but it came at a great cost to the group members. Ross was so stressed she lost a stone of her already low weight, the first sign of the anorexia which she would deal with for many years to come. Meanwhile, Florence had to miss a chunk of the rehearsals as she became seriously ill with the flu, though she got herself well enough to make the opening night.\n\nAnd while it was what Berry Gordy had been working towards for years, it couldn't have come at a worse time for him personally -- his elder sister Loucye died suddenly of a brain haemorrhage shortly before the residency, and her funeral was actually the morning of the opening night.\n\nThe opening night went exactly as Gordy had planned, except for one ad-lib -- during the song \"You're Nobody 'Til Somebody Loves You\", after Ross sang the line “But gold won’t bring you happiness,” Florence interjected a joking line -- \"Now wait a minute, honey. I don’t know about all that.\"\n\nThe audience loved her ad-lib -- Sammy Davis Jr., who was in the audience, yelled out \"All right, girl! You tell it like it is!\" -- and the line got added as a regular part of the performance:\n\n[Excerpt: The Supremes, “You're Nobody 'Til Somebody Loves You”]\n\nalong with a rather less fun bit where Florence would mention \"little old me\", and Ross would snarkily respond \"Little?\"\nBut even though it worked, Gordy was furious, partly just because he was understandably in a bad mood after his sister's funeral, partly because it was a deviation from the carefully-scripted performance, and partly because it was a moment in the spotlight for someone other than Diana Ross. As retaliation, a couple of days later he had Harvey Fuqua tell the group that they were dropping \"People\" -- Florence's only lead vocal -- from the set because there were too many show tunes. Then, a week or so later, \"People\" was added back to the set, but with Ross singing lead.\n\n(Mary Wilson had also asked to have her own lead vocal in the set, but Gordy had just looked at her sadly and said \"Mary, you know you can't sing\".)\n\nFlorence was devastated. She was already drinking too much, but that escalated after the Copa engagement. Even though the group had never been as close as many groups are, they had all genuinely attempted to create a bond with each other, even all moving on to the same street. But now, that physical closeness just became an opportunity for the women to note the comings and goings at each other's houses and pass snarky comment on it.\n\nBallard was fast becoming considered a liability by the powers that be at Motown, and even the existence of the Supremes was starting to be seen as something that was merely a hindrance for Diana Ross' career, rather than them being seen for what they were -- a massively successful group, not just a lead singer and her backing vocalists.\n\nFlorence wasn't very long for the group, and when we next look at them, we'll no longer be looking at the Supremes, but at Diana Ross and the Supremes...",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and thirty-one of A History of Rock Music in Five Hundred Songs looks at “I Hear a Symphony” by the Supremes, and is the start of a three-episode look at Motown in 1965. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Rescue Me\" by Fontella Bass.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nNo Mixcloud this week, as too many of the songs were by the Supremes.\n\nFor Motown-related information in this and other Motown episodes, I’ve used the following resources:\n\nWhere Did Our Love Go? The Rise and Fall of the Motown Sound by Nelson George is an excellent popular history of the various companies that became Motown.\n\nTo Be Loved by Berry Gordy is Gordy’s own, understandably one-sided, but relatively well-written, autobiography.\n\nWomen of Motown: An Oral History by Susan Whitall is a collection of interviews with women involved in Motown.\n\nI Hear a Symphony: Motown and Crossover R&B by J. Andrew Flory is an academic look at Motown.\n\nThe Motown Encyclopaedia by Graham Betts is an exhaustive look at the people and records involved in Motown’s thirty-year history.\n\nHow Sweet It Is by Lamont Dozier and Scott B. Bomar is Dozier’s autobiography, while Come and Get These Memories by Brian and Eddie Holland and Dave Thompson is the Holland brothers’.\n\nAnd Motown Junkies is an infrequently-updated blog looking at (so far) the first 694 tracks released on Motown singles.\n\nGirl Groups by John Clemente contains potted biographies of many groups of the era.\n\nThe Supremes biography I relied on most is The Supremes by Mark Ribowsky, which seems factually accurate but questionable in its judgments of people.\n\nI also used this omnibus edition of Mary Wilson’s two volumes of autobiography.\n\nThis box set contains everything you could want by the Supremes, but is extraordinarily expensive in physical form at the moment, though cheap as MP3s. This is a good budget substitute, though oddly doesn’t contain “Stop in the Name of Love”.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\nHi, this is Andrew. Between recording this episode and it going live, three great musicians, two of whom have been the subject of episodes of this podcast, sadly died. We lost Don Everly, Charlie Watts, and Tom T. Hall, and I just wanted to acknowledge them and their contributions to music before the episode starts. They'll all be missed.\n\n[theme music]\n\nJust a brief note before we start to say that this episode contains brief mentions of eating disorders, so if that might be a problem for you, check the transcript to make sure it's safe. Thanks.\n\nWe've spent much of the last few months looking at the intersections of three different movements, each of which was important -- the influence of the Beatles and to a lesser extent the other Merseybeat bands, the influence of Bob Dylan and the folk and protest movement, and the British R&B guitar bands who were taking their interpretation of the sound of Chess Records back to the USA.\n\nBut of course, while these guitar bands were all influencing everyone, they were also being influenced by the growth of soul, and in particular by Motown, and Motown's groups were among the few American acts who managed to keep having hits during the British Invasion. Indeed, 1965 was as much of a creative and commercial peak for the label as for the white guitar bands we've been looking at. So for the next few weeks we're going to move over to Detroit, and we're going to look at Motown. And this week and next week we're going to continue our look at the Holland-Dozier-Holland collaboration, and at the groups they were writing for.\n\nSo today, we're go",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and thirty-one of A History of Rock Music in Five Hundred Songs looks at “I Hear a Symphony” by the Supremes, and is the start of a three-episode look at Motown in 1965. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Rescue Me\" by Fontella Bass.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nNo Mixcloud this week, as too many of the songs were by the Supremes.\n\nFor Motown-related information in this and other Motown episodes, I’ve used the following resources:\n\nWhere Did Our Love Go? The Rise and Fall of the Motown Sound by Nelson George is an excellent popular history of the various companies that became Motown.\n\nTo Be Loved by Berry Gordy is Gordy’s own, und",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}