{
  "id": "yt:video:Zi88i4CpHe4",
  "yt:videoId": "Zi88i4CpHe4",
  "yt:channelId": "UCjmJDM5pRKbUlVIzDYYWb6g",
  "title": "SHAZAM! FURY OF THE GODS - Official Trailer 1",
  "link": "",
  "author": {
    "name": "Warner Bros. Pictures",
    "uri": "https://www.youtube.com/channel/UCjmJDM5pRKbUlVIzDYYWb6g"
  },
  "published": "2022-07-23T17:25:08+00:00",
  "updated": "2022-10-28T13:46:45+00:00",
  "media:group": {
    "media:title": "SHAZAM! FURY OF THE GODS - Official Trailer 1",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Check out the official trailer for Shazam! Fury of the Gods – in theaters March 2023. #ShazamMovie \n\nFrom New Line Cinema comes “Shazam! Fury of the Gods,” which continues the story of teenage Billy Batson who, upon reciting the magic word “SHAZAM!,” is transformed into his adult Super Hero alter ego, Shazam. \n\n“Shazam! Fury of the Gods” stars returning cast members Zachary Levi (“Thor: Ragnarok”) as Shazam; Asher Angel (“Andi Mack”) as Billy Batson; Jack Dylan Grazer (“It Chapter Two”) as Freddy Freeman; Adam Brody (“Promising Young Woman”) as Super Hero Freddy; Ross  Butler (“Raya and the Last Dragon”) as Super Hero Eugene; Meagan Good (“Day Shift”) as Super Hero Darla;  D.J.  Cotrona  (“G.I.  Joe:  Retaliation”)  as  Super  Hero  Pedro;  Grace  Caroline  Currey (“Annabelle: Creation”) as Mary Bromfield / Super Hero Mary; Faithe Herman (“This Is Us”) as Darla Dudley; Ian Chen (“A Dog’s Journey”) as Eugene Choi; Jovan Armand (“Second Chances”) as Pedro Pena; Marta Milans (“White Lines”) as Rosa Vasquez; Cooper Andrews (“The Walking Dead”) as Victor Vasquez; with Djimon Hounsou (“A Quiet Place Part II”) as Wizard. Joining the cast are Rachel Zegler (“West Side Story”), with Lucy Liu (“Kung Fu Panda” franchise) and Helen Mirren (“F9: The Fast Saga”). \n\nThe film is directed by David F. Sandberg (“Shazam!,” “Annabelle: Creation”) and produced by Peter Safran (“Aquaman,” “The Suicide Squad”). It is written by Henry Gayden (“Shazam!,” “There’s Someone Inside Your House”) and Chris Morgan (“Fast & Furious Presents: Hobbs & Shaw,” “The Fate of the Furious”), based on characters from DC; Shazam! was created by Bill Parker and C.C. Beck. \n\nExecutive producers are Walter Hamada, Adam Schlagman, Richard Brener, Dave Neustadter, Victoria Palmeri, Marcus Viscidi and Geoff Johns. Joining  director  Sandberg  behind-the-camera  are  director  of  photography  Gyula  Pados (the “Jumanji” franchise), production designer Paul Kirby (“The Old Guard,” “Jason Bourne”) and editor Michel Aller (“Shazam!,” “The Nun”). The music supervisor is Season Kent (“DC League of Super-Pets,” “The Addams Family 2”) and the music is by Christophe Beck (“Free Guy,” “Frozen II”). Visual effects supervisors are Bruce Jones (“Aquaman,” “It”) and Raymond Chen (“Alita: Battle Angel,” “The Meg”). The costume designer is Louise Mingenbach (“Jumanji: The Next Level,” “Godzilla: King of the Monsters”). \n\nNew  Line  Cinema  presents  A  Peter  Safran  Production  of  A  David  F.  Sandberg  Film, “Shazam! Fury of the Gods,” which is set to open in theaters internationally  beginning  15 December 2022 and in North America on December 21, 2022.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}