{
  "id": "https://bibleinoneyear.org/en/youth/15",
  "title": "Day 15: God is Just and God is Merciful",
  "description": "Psalm 9:16,18, Genesis 31:6–7, Matthew 12:7–21.  Then in his *mercy* and love he comes down in the person of his Son, Jesus Christ, and pays the penalty for us  Through the sacrifice of Jesus on the cross, God is both just and merciful",
  "pubDate": "Sat, 15 Jan 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/15/",
  "itunes:duration": "12:51",
  "guid": "enyouth15012022-15",
  "length": 771.55,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 15: God is Just and God is Merciful",
  "itunes:subtitle": "Psalm 9:16,18, Genesis 31:6–7, Matthew 12:7–21.  Then in his *mercy* and love he comes down in the person of his Son, Jesus Christ, and pays the penalty for us  Through the sacrifice of Jesus on the cross, God is both just and merciful",
  "itunes:summary": "Media headlines frequently express outrage at judges who are ‘soft on crime’ and fail to impose the appropriate penalty for the offence committed.\nWhen I worked as a barrister, I noticed that the legal profession did not respect judges who were regarded as too lenient. We expect judges to execute justice. We do not expect them simply to be merciful.\nOn the other hand, we do expect mercy in our personal relationships. A loving parent will be merciful to their child. We expect friends to be merciful to one another. Justice and mercy do not normally go together. We tend to see them as alternatives. We expect either justice or mercy, but not both at the same time.\nYet God is both a God who judges with justice, and also a God of mercy. How can he combine these two apparently contradictory characteristics? The answer is that the sacrifice of Jesus has made it possible for God to combine both justice and mercy.\nWhen I first encountered Jesus, the following illustration helped me to understand what Jesus achieved for you and me on the cross: Two people went through school and university together and developed a close friendship. Life went on and they went their separate ways and lost contact. One went on to become a judge, while the other’s life spiralled downwards and he ended up as a criminal. One day the criminal appeared before the judge. He had committed a crime to which he pleaded guilty. The judge recognised his old friend and faced the dilemma, which, in effect, God faces.\nHe was a judge so he had to be just; he couldn’t simply let the man off. On the other hand, he wanted to be merciful, because he loved his friend. So he fined him the correct penalty for the offence. That was justice. Then he came down from his position as judge and wrote a cheque for the amount of the fine. He gave it to his friend, saying that he would pay the penalty for him. That was an act of mercy, love and sacrifice.\nThe illustration is not an exact one. Our plight is worse – the penalty we face is death. The relationship is closer – your Father in heaven loves you more than any earthly parent loves their child. And the cost is greater. It cost God far more than money – he came himself, in the person of Jesus, and paid the penalty of sin.\nGod is not soft on crime. In his justice, God judges us because we are guilty. Then in his mercy and love he comes down in the person of his Son, Jesus Christ, and pays the penalty for us. Through the sacrifice of Jesus on the cross, God is both just and merciful.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 380
}