{
  "title": "Free to Move with Ilya Somin",
  "pubDate": "Thu, 04 Jun 2020 22:39:36 +0000",
  "guid": "b28f92fc-25a0-41b1-b4e5-9f4482dd7570",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/145_Somin.mp3",
  "itunes:image": "",
  "description": "<div style=\"float: right; padding-left: 10px;\"><a href= \"https://www.amazon.com/Free-Move-Migration-Political-Freedom-ebook/dp/B0876CHH3M/ref=as_li_ss_il?dchild=1&keywords=free+to+move&qid=1591310135&sr=8-3&linkCode=li3&tag=economicsde0f-20&linkId=c2693dda9ee9a4cb0616adffcb314949&language=en_US\" target=\"_blank\" rel=\"noopener\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B0876CHH3M&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20&language=en_US\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&language=en_US&l=li3&o=1&a=B0876CHH3M\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p>Ilya Somin of George Mason University joins the podcast to discuss his book <a href=\"https://amzn.to/3eVjJvt\" target=\"_blank\" rel=\"noopener\">Free to Move: Foot Voting, Migration, and Political Freedom</a>.</p> <blockquote>Ballot box voting is often considered the essence of political freedom. But, it has two major shortcomings: individual voters have little chance of making a difference, and they also face strong incentives to remain ignorant about the issues at stake. \"Voting with your feet,\" however, avoids both of these pitfalls and offers a wider range of choices. In Free to Move, Ilya Somin explains how broadening opportunities for foot voting can greatly enhance political liberty for millions of people around the world.<br /> <br /> People can vote with their feet by making decisions about whether to immigrate, where to live within a federal system, and what to purchase or support in the private sector. These three areas are rarely considered together, but Somin explains how they have major common virtues and can be mutually reinforcing. He contends that all forms of foot voting should be expanded and shows how both domestic constitutions and international law can be structured to increase opportunities for foot voting while mitigating possible downsides.<br /> <br /> Somin addresses a variety of common objections to expanded migration rights, including claims that the \"self-determination\" of natives requires giving them the power to exclude migrants, and arguments that migration is likely to have harmful side effects, such as undermining political institutions, overburdening the welfare state, increasing crime and terrorism, and spreading undesirable cultural values. While these objections are usually directed at international migration, Somin shows how a consistent commitment to such theories would also justify severe restrictions on domestic freedom of movement. That implication is an additional reason to be skeptical of these rationales for exclusion. By making a systematic case for a more open world, Free to Move challenges conventional wisdom on both the left and the right.</blockquote> <hr />",
  "content:encoded": "<a href= \"https://www.amazon.com/Free-Move-Migration-Political-Freedom-ebook/dp/B0876CHH3M/ref=as_li_ss_il?dchild=1&keywords=free+to+move&qid=1591310135&sr=8-3&linkCode=li3&tag=economicsde0f-20&linkId=c2693dda9ee9a4cb0616adffcb314949&language=en_US\" target=\"_blank\" rel=\"noopener\"></a> <p>Ilya Somin of George Mason University joins the podcast to discuss his book <a href=\"https://amzn.to/3eVjJvt\" target=\"_blank\" rel=\"noopener\">Free to Move: Foot Voting, Migration, and Political Freedom</a>.</p> Ballot box voting is often considered the essence of political freedom. But, it has two major shortcomings: individual voters have little chance of making a difference, and they also face strong incentives to remain ignorant about the issues at stake. \"Voting with your feet,\" however, avoids both of these pitfalls and offers a wider range of choices. In Free to Move, Ilya Somin explains how broadening opportunities for foot voting can greatly enhance political liberty for millions of people around the world.  People can vote with their feet by making decisions about whether to immigrate, where to live within a federal system, and what to purchase or support in the private sector. These three areas are rarely considered together, but Somin explains how they have major common virtues and can be mutually reinforcing. He contends that all forms of foot voting should be expanded and shows how both domestic constitutions and international law can be structured to increase opportunities for foot voting while mitigating possible downsides.  Somin addresses a variety of common objections to expanded migration rights, including claims that the \"self-determination\" of natives requires giving them the power to exclude migrants, and arguments that migration is likely to have harmful side effects, such as undermining political institutions, overburdening the welfare state, increasing crime and terrorism, and spreading undesirable cultural values. While these objections are usually directed at international migration, Somin shows how a consistent commitment to such theories would also justify severe restrictions on domestic freedom of movement. That implication is an additional reason to be skeptical of these rationales for exclusion. By making a systematic case for a more open world, Free to Move challenges conventional wisdom on both the left and the right. ",
  "enclosure": "",
  "itunes:duration": "01:00:11",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Ilya Somin of George Mason University joins the podcast to discuss his book . Ballot box voting is often considered the essence of political freedom. But, it has two major shortcomings: individual voters have little chance of making a difference, and...",
  "itunes:episode": 145,
  "itunes:episodeType": "full"
}