{
  "id": "yt:video:rhL2i-AnmIM",
  "yt:videoId": "rhL2i-AnmIM",
  "yt:channelId": "UC2iUwfYi_1FCGGqhOUNx-iA",
  "title": "Rings of Power: Everything They Changed (& Got Wrong)",
  "link": "",
  "author": {
    "name": "Screen Rant",
    "uri": "https://www.youtube.com/channel/UC2iUwfYi_1FCGGqhOUNx-iA"
  },
  "published": "2022-10-30T16:15:02+00:00",
  "updated": "2022-11-02T20:40:05+00:00",
  "media:group": {
    "media:title": "Rings of Power: Everything They Changed (& Got Wrong)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "In 8 episodes, The Lord of The Rings the Rings of Power managed to make an already vast world that much more expansive and rich with lore. Some mysteries were uncovered, some previously known events occurred right before our very eyes, but as with many adaptations, some of it just didn’t make sense. The Rings of Power definitely took liberties with Tolkien’s lore and stories that had already been set in place. Between timeline shifts, new characters, and later in the video there’s a whole big thing about Mithril, let’s take a look at all the changes and some mistakes in The Rings of Power.\n\nThe Lord of the Rings was not the only live action look into the vast world of Middle Earth. The Hobbit Trilogy showed us what happened some time before Frodo’s fateful journey to Mount Doom. In the Hobbit Trilogy, later expanded on by Tolkien himself, we got an in depth look at a corner of Middle Earth we had not really seen before. Perhaps one of the most well respected beings in all of Middle Earth is the elf Galadriel. She is often depicted as the wisest and most graceful elf whom all beings have a level of respect towards. JRR Tolkien even revealed in the Silmarillion that the lady Galadriel was one of the only beings in all of Middle Earth that Sauron actually feared. However, that was rather vague don’t you think? The Rings of Power is likely not done with its stretching of lore and liberty taking for the sake of story telling. I just hope if this trend keeps up in season two they at least give Gandalf the power to fly or something. What do you think was the biggest change to Middle Earth Lore made by the Rings of Power? Be sure to like, subscribe and comment your answer!\n\nSubscribe: http://bit.ly/Subscribe-to-Screenrant\n\nChapters:\n0:00 - Intro \n0:24 - The Wizards\n2:02 - Multiple Durins\n3:12  Hands Off Approach\n4:04 - Celeborn Missing\n4:42 - Warrior Galadriel\n5:43 - Finrod’s Oath\n6:29 - Gil-galad’s Influence\n7:03 - The Palantiri\n7:37 - Elendil and Numenor\n8:30 - The Elvish Rings\n9:50 - Outro\n\nCheck out Screen Rant’s official TikTok! \nhttps://www.tiktok.com/@screenrant \n\nOur Social Media:\nhttps://twitter.com/screenrant \nhttps://www.facebook.com/ScreenRant  \nhttps://www.linkedin.com/company/screen-rant/ \n\nOur Website:\nhttp://screenrant.com/\n\nWritten by: Nick Twohig\nNarrated by: Max Lichtig\nEdited by: Gullivar Du Katt\n\nFor copyright matters please contact us at: legal@valnetinc.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}