{
  "title": "Italy freezes arms supplies to Ukraine – Il Messaggero",
  "link": "https://www.rt.com/news/565815-italy-ukraine-military-aid/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565815-italy-ukraine-military-aid/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63627a1385f5407f307f3957.jpg\" /> Italy has temporarily paused arms shipments to Ukraine to assess its own defense supplies, Il Messaggero suggests <br/><a href=\"https://www.rt.com/news/565815-italy-ukraine-military-aid/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>“Support remains” for Kiev, but Rome’s new government is concerned about the country’s own defenses, according to a new report</strong></p>\n            \n                        \n            <p>Rome is easing up on its arms supplies to Ukraine amid Kiev&rsquo;s ongoing military conflict with Russia, Il Messaggero reported on Tuesday, citing sources within the Italian government that claim no new weapons packages are under consideration at the moment.</p>\n<p><strong></strong></p>\n<p>Although new Italian Prime Minister Giorgia Meloni has pledged to honor Kiev&rsquo;s request for more military assistance and advanced air defense systems, the outlet says all arms shipments to Ukraine are currently on stand-by.</p>\n<p><em>&ldquo;Only and only because it is first necessary to coordinate with NATO and go into detail on Ukraine&rsquo;s military requests. Only then will we understand what Kiev needs and what armaments we will be able to supply,&rdquo;</em> government officials reportedly told Il Messaggero.</p>\n<p>NATO Secretary General Jens Stoltenberg is expected to visit Italy in the coming days to meet with Meloni and Italian Defense Minister Giulio Crosetto. Together, they are expected to discuss what weapons are essential to defend Kiev and work to solve three key issues before military shipments can resume.</p>\n<p>The first one being Kiev&rsquo;s request for the very expensive SAMP-T surface-to-air anti-aircraft missile systems. According to Italy&rsquo;s Defense Ministry, the country only has a few of these systems at its disposal and if it were to deliver some of them to Kiev, it would risk weakening its own air defense capabilities. Il Messaggero notes that this issue could result in Rome sending other weapon systems to Kiev instead.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/635ee56385f5402fe07f44c5.jpg\" alt=\"Forza Italia leader Silvio Berlusconi leaves the Quirinale Presidential Palace, Friday, Oct. 21, 2022.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565628-berlusconi-way-end-ukraine-conflict/\">Berlusconi suggests how to end Ukraine conflict</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Italy has also yet to completely fulfill delivery of five arms packages already pledged to Ukraine. <em>&ldquo;We have to complete the job, before facing a new one,&rdquo;</em> sources told the outlet.</p>\n<p>Finally, in order for any new weapons packages to be approved for Kiev, the minister of defense must discuss the issue with the Parliamentary Committee on Services, which is still not operational following the recent elections in Italy.</p>\n<p>Despite this temporary delay in approving a sixth weapons package for Ukraine, Italy&rsquo;s new government insists that military support for Kiev is <em>&ldquo;not in question.&rdquo;</em> Meloni, who recently became the country&rsquo;s first female prime minister, told parliament last week that the only way to facilitate a peace deal between Russia and Ukraine is by helping Kiev defend itself militarily.</p>\n<p>Russia, meanwhile, has repeatedly warned the West against pumping Ukraine with weapons, insisting that it would only prolong the conflict and lead to more bloodshed.</p>",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 14:24:19 +0000",
  "dc:creator": "RT"
}