{
  "itunes:episode": 73,
  "title": "Sailing in Brackish Waters with Maggie Vail and Jesse von Doom",
  "pubDate": "Thu, 01 May 2014 15:04:24 +0000",
  "link": "http://newdisrupt.org/blog/2014/5/1/maggie-vail-and-jesse-von-doom-episode-73",
  "description": "<p><a href=\"https://twitter.com/magicbeans\">Maggie Vail</a> and <a href=\"https://twitter.com/jessevondoom\">Jesse von Doom</a> are the co-executive directors of <a href=\"http://cashmusic.org/\">CASH Music</a> (Coalition of Artists and Stakeholders) a non-profit organization that brings an open-source approach to music distribution and production. CASH focuses on educating around those ideas through online resources, stakeholder events, and face-to-face workshops, as well as offering a software platform.</p>\n\n<h2>Sponsors and patrons</h2>\n\n<p>This podcast is made possible through the support of sponsors and patrons.</p>\n\n<p><a href=\"http://mailroute.net/disrupt\">MailRoute</a> filters your mail, quarantines any suspicious mail offsite, and delivers only clean mail to your mailboxes. With one simple click, your domain, mail server and other precious resources are protected. For 10% off the lifetime of your account, and a free 15-day trial, visit <a href=\"http://mailroute.net/disrupt\">mailroute.net/disrupt</a>!</p>\n\n<p>Thanks to patrons George O'Toole, Jonathan Mann, and Sean Wickett for supporting us directly through Patreon! You can <a href=\"http://www.patreon.com/newdisruptors\">back this podcast</a> for as little as $1 per month. At higher levels, we'll thank you on the air and send you mugs and T-shirts.</p>\n\n<h2>Show notes</h2>\n\n<p>Maggie mentioned two early groups that helped independent artists and labels handle digital distribution: the for-profit <a href=\"http://www.merlinnetwork.org/\">Merlin</a> and the trade group <a href=\"http://a2im.org/\">A2im</a>. Maggie worked with bands at <a href=\"http://www.killrockstars.com/\">Kill Rock Stars</a> for 17 years before becoming the co-head of CASH.</p>\n\n<p><a href=\"http://www.jonathancoulton.com/\">Jonathan Coulton</a> is on CASH's board, and I spoke to him about his career in \"<a href=\"http://newdisrupt.org/blog/2013/3/27/episode-16\">Baby Got Back Catalog</a>,\" March 2013. Back in 2000, <a href=\"http://www.salon.com/2000/06/14/love_7/\">Courtney Love explained</a> how the sausage of music-industry accounting in big labels is designed to rip off artists.</p>\n\n<p>I visited the Library of Congress Packard Campus for Audio-Visual Conservation in 2012, and wrote \"<a href=\"http://the-magazine.org/4/the-sound-of-silence\">The Sound of Silence</a>\" for <em>The Magazine</em> about the issues of preservation and rights. Pandora has a good explanation of <a href=\"http://www.dmx.com/pandora/licensing/\">how music rights have to be licensed</a> in America.</p>\n\n<p>Jesse <a href=\"http://www.shuttleworthfoundation.org/fellowship/fellows/current-fellows/\">received a fellowship</a> from the Shuttleworth Foundation, which has freed them a bit from the endlessly cycle of fundraising to move forward and grow the staff. <a href=\"http://dansinker.com/\">Dan Sinker</a> is in charge of the Knight-Mozilla OpenNews project for the Mozilla Foundation, and the founder of <em>Punk Planet</em>, an underground culture magazine.</p>\n",
  "guid": "tag:soundcloud,2010:tracks/147179288",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "00:58:29",
  "itunes:subtitle": "Maggie Vail and Jesse von Doom are the co-excutive directors of CASH Music (Coalition of Artists and Stakeholders) a non-profit organization that brings an open-source approach to music distribution and production.",
  "itunes:summary": "Maggie Vail and Jesse von Doom are the co-excutive directors of CASH Music (Coalition of Artists and Stakeholders) a non-profit organization that brings an open-source approach to music distribution and production. CASH focuses on educating around those ideas through online resources, stakeholder events, and face-to-face workshops, as well as offering a software platform. (Photo courtesy of Martin Wong.) Sponsored by New Relic http://newrelic.com/disruptors and Mailroute http://mailroute.net/disrupt"
}