{
  "title": "TU60: Preoccupation in Relationships – Signs and Solutions to Anxious Attachment",
  "link": "https://therapistuncensored.com/episodes/tu60-preoccupation-in-relationships-signs-and-solutions-to-anxious-attachment/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu60-preoccupation-in-relationships-signs-and-solutions-to-anxious-attachment",
  "pubDate": "Mon, 16 Apr 2018 11:00:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=5973",
  "description": "Improve your sense of security and communicate more effectively inside yourself, and with those you love by understand preoccupied/anxious attachment.  Begin to learn to manage your body’s reactivity in relationships by learning about preoccupied/anxious attachment and how it relates to unconscious regulation of the brain.\n\nDr. Ann Kelley and Sue Marriott LCSW, CGP discuss the Insecure Preoccupied, or Anxious/Ambivalent side of the attachment spectrum. This discussion can stand alone, but it also continues as a soft Part 2 from last episode TU59: Are You Cool or Just Cut Off – Dismissing Attachment. The hosts begin to really go into how to use the attachment spectrum to identify where you might fall and how to move towards a more secure place.\n\nFind out how anxious attachment is formed and passed on, as well as how starting anxious affects relationships later in our adult life. You’ll learn how to manage relationships better by turning inwards and regulating yourself rather than focusing on others to calm you down. Therapist Uncensored co-hosts Kelley and Marriott will also provide basic tips towards identifying where you are on the attachment spectrum and how to move from anxious attachment towards security.\n\nWatch our new video introduction to attachment here, and support us on Patreon below:\n\nTU60: Podcast episode show notes-\n\n0:00-10:00\n\nIntroduction and recap on attachment, organized & disorganized categories of attachment\n\nRed side of the attachment spectrum – preoccupied attachment\n\nTransferring preoccupied attachment from parent to child (sometimes out of fear of mis-parenting), children reacting to parents’ state of mind. Body can’t relax if caretaker is harboring unsettling feelings.\n\nAnxiously attached parents are better at attuning to fear in their child\n\nAnxiously attached parents can’t tolerate their own anxiety when child gets too far away. Find the balance between letting children go of and have fun and being there when they need it.\n\n10:00-20:00\n\nVery young secure children calm down when parents return after being separated. \"Angry ambivalent” children will go to the parent but won’t let them soothe them, won’t trust that parent will remain there.\n\nIdentifying your attachment type and handling it in your adulthood. We’re already attuned to other people and we’re used to the sense of rejection but it’s hard to attune to your own body and figure out what YOU want.\n\nHyperactivation is an exaggeration of a normal healthy response (e.g. looking for closeness), being perceived as “clingy” or receiving disproportionate “blame”. Over-activation occurs in the red zone (as opposed to under-activation in the blue zone).\n\n \n\n20:00-30:00\n\nUnderlying assumption that if you’re rejected or abandoned, you’re not OK\n\nYou can’t always look to the other person to soothe you; this might be your own history at play.\n\nIf you fall on red side of spectrum, try to scan externally less and instead check on how you’re doing. Identify your own body cues for triggers (separation, defining yourself and feeling separate, etc.), focus inwards.\n\nBe selfish (at least in your body scan)! Have your “personal policy”. Learning to hold off on talking about things until you calm down.\n\n \n\n30:00-40:00\n\nLearning how to use “soft tosses” in communication with preoccupied individuals. Figuring what you really want out of a conversation (it might not just being proved right). Understanding your own state of mind and the other person’s simultaneously. Giving your partner a “credibility statement”.\n\nRed side should move towards self. Blue side should move towards others.\n\nWrap up, tips, and outro.\n\nResources for this episode:\n\nAttached The New Science of Adult Attachment by Amir Levine\n\nA Secure Base by John Bowlby, The father of attachment! Mary Main, Mary Ainsworth both primary researchers with Bowlby.\n\nMary Main and the Adult Attachment Interview  Good summary, check it out!!",
  "enclosure": "",
  "itunes:subtitle": "Improve your sense of security and communicate more effectively inside yourself, and with those you love by understand preoccupied/anxious attachment.  Begin to learn to manage your body’s reactivity in relationships by learning about preoccupied/anxio...",
  "itunes:summary": "Dr. Ann Kelley and Sue Marriott LCSW, CGP discuss the Insecure Preoccupied, or Anxious/Ambivalent side of the attachment spectrum.  This discussion can stand alone, but it also continues as a soft Part 2 from last episode TU59: Are You Cool or Just Cut Off – Dismissing Attachment.  The hosts begin to really go into how to use the attachment spectrum and use it to identify where you might fall and how to move towards a more secure place.  <br />\n<br />\nFind out how preoccupied attachment is formed and passed on, as well as how starting anxious effects relationships later in our adult life. You’ll learn  how to manage relationships better by turning inwards and regulating yourself rather than focusing on others to calm you down. Ann Kelley & Sue Marriott, co-hosts, will also provide basic tips towards identifying where you are on the attachment spectrum and moving from preoccupation towards security.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "34:32"
}