{
  "title": "What's the Story Behind Japan's COVID \"Miracle?\"",
  "itunes:title": "What's the Story Behind Japan's COVID \"Miracle?\"",
  "pubDate": "Fri, 24 Dec 2021 05:58:43 +0000",
  "guid": "4f0960af-fe33-47c3-b5ba-7e11b656437c",
  "link": "https://traffic.libsyn.com/secure/thejimmydoreshow/TJDS_20211224_Podcast_-_122321_7.19_PM.mp3",
  "itunes:image": "",
  "description": "<p>Japan has recently seen coronavirus cases plummet, yet no one seems entirely sure why (although Jimmy has a theory). Jimmy and comedian Kurt Metzger discuss the story, as well as recent news suggesting that burgers made of bugs are right around the corner, and the unsettling reality of corporate capture of the FDA.<br /> <br /> Also featuring Stef Zamorano and Mike MacRae! Phone call from Noam Chomsky and holiday voicemail messages to Jimmy from a range of celebrities!</p>",
  "content:encoded": "<p>Japan has recently seen coronavirus cases plummet, yet no one seems entirely sure why (although Jimmy has a theory). Jimmy and comedian Kurt Metzger discuss the story, as well as recent news suggesting that burgers made of bugs are right around the corner, and the unsettling reality of corporate capture of the FDA.  Also featuring Stef Zamorano and Mike MacRae! Phone call from Noam Chomsky and holiday voicemail messages to Jimmy from a range of celebrities!</p>",
  "enclosure": "",
  "itunes:duration": "01:13:19",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Japan has recently seen coronavirus cases plummet, yet no one seems entirely sure why (although Jimmy has a theory). Jimmy and comedian Kurt Metzger discuss the story, as well as recent news suggesting that burgers made of bugs are right around the...",
  "itunes:episodeType": "full",
  "itunes:summary": "Japan has recently seen coronavirus cases plummet, yet no one seems entirely sure why (although Jimmy has a theory). Jimmy and comedian Kurt Metzger discuss the story, as well as recent news suggesting that burgers made of bugs are right around the corner, and the unsettling reality of corporate capture of the FDA. Also featuring Stef Zamorano and Mike MacRae! Phone call from Noam Chomsky and holiday voicemail messages to Jimmy from a range of celebrities!"
}