{
  "title": "Are you part of the Captain Class? | The WSJ’s Sam Walker on the 7 core qualities of true leaders",
  "pubDate": "Thu, 22 Mar 2018 00:04:48 +0000",
  "guid": "72efba744f5b83e51890b250419eca40",
  "link": "https://tonyrobbins.libsyn.com/are-you-part-of-the-captain-class-the-wsjs-sam-walker-on-the-7-core-qualities-of-true-leaders",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">What do the greatest leaders of all time have in common? You may think it comes down to a certain sense of charisma or some inhuman level of talent - because that’s what we’ve all been conditioned to think defines a leader. But</span> <em><span style= \"font-weight: 400;\">superstars</span></em> <span style= \"font-weight: 400;\">aren’t the same thing as</span> <em><span style=\"font-weight: 400;\">super leaders</span></em><span style=\"font-weight: 400;\">. In fact, the greatest leaders often fly under the radar and are actually easy to miss.</span></p> <p><span style=\"font-weight: 400;\">In this episode of the Tony Robbins Podcast, you’ll be hearing from renowned leadership expert and bestselling author,</span> <a href= \"http://bysamwalker.com\"><span style=\"font-weight: 400;\">Sam Walker</span></a><span style=\"font-weight: 400;\">.</span></p> <p><span style=\"font-weight: 400;\">A former reporter, sports columnist and sports editor, Sam founded</span> <em><span style= \"font-weight: 400;\">The Wall Street Journal’s</span></em> <span style=\"font-weight: 400;\">prizewinning daily sports coverage. And most recently, helped launch the</span> <em><span style= \"font-weight: 400;\">Journal’s</span></em> <span style= \"font-weight: 400;\">leadership column. He is the author of Fantasyland, a bestselling account of his time in Tout Wars, America’s top fantasy-baseball expert competition (of which he is a two-time champion). And in his latest book – The Captain Class – Sam profiles the greatest teams in history and identifies the secret sauce that drove these unconventional men and women to achieve massive success.  </span></p> <p><span style=\"font-weight: 400;\">Sam and our host, Ana Yoerg, do a deep dive into the behavioral and psychological traits of these individuals and how they have been the driving force behind some of the most legendary teams in history. They discuss the myths about leadership – and how to really identify and cultivate the leaders you see in your own organization. Because it isn’t always obvious. In fact, it rarely is. And as Sam reveals, once you do find these individuals, you need to understand how to effectively partner with them so that they assume a more autonomous role that can ultimately lead the entire team to success.</span></p>",
  "content:encoded": "<p>What do the greatest leaders of all time have in common? You may think it comes down to a certain sense of charisma or some inhuman level of talent - because that’s what we’ve all been conditioned to think defines a leader. But <em>superstars</em> aren’t the same thing as <em>super leaders</em>. In fact, the greatest leaders often fly under the radar and are actually easy to miss.</p> <p>In this episode of the Tony Robbins Podcast, you’ll be hearing from renowned leadership expert and bestselling author, <a href= \"http://bysamwalker.com\">Sam Walker</a>.</p> <p>A former reporter, sports columnist and sports editor, Sam founded <em>The Wall Street Journal’s</em> prizewinning daily sports coverage. And most recently, helped launch the <em>Journal’s</em> leadership column. He is the author of Fantasyland, a bestselling account of his time in Tout Wars, America’s top fantasy-baseball expert competition (of which he is a two-time champion). And in his latest book – The Captain Class – Sam profiles the greatest teams in history and identifies the secret sauce that drove these unconventional men and women to achieve massive success.  </p> <p>Sam and our host, Ana Yoerg, do a deep dive into the behavioral and psychological traits of these individuals and how they have been the driving force behind some of the most legendary teams in history. They discuss the myths about leadership – and how to really identify and cultivate the leaders you see in your own organization. Because it isn’t always obvious. In fact, it rarely is. And as Sam reveals, once you do find these individuals, you need to understand how to effectively partner with them so that they assume a more autonomous role that can ultimately lead the entire team to success.</p>",
  "enclosure": "",
  "itunes:duration": "01:28:22",
  "itunes:explicit": false,
  "itunes:keywords": "leadership,sam,walker,tony,robbins,captains",
  "itunes:subtitle": "What do the greatest leaders of all time have in common? You may think it comes down to a certain sense of charisma or some inhuman level of talent - because that’s what we’ve all been conditioned to think defines a leader. But superstars aren’t...",
  "itunes:episodeType": "full"
}