{
  "id": "https://bibleinoneyear.org/en/youth/136",
  "title": "Day 136: Your Story Has Power",
  "description": "Proverbs 12:17, Ruth 1:3–16, Ruth 2:1–13, John 9:1-25.  Your story may not be as dramatic as Mark’s, but *everyone* has a story  Whether you were brought up as a Christian or whether you have only been a Christian for a few hours, your story has power",
  "pubDate": "Sun, 16 May 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/136/?ignore",
  "itunes:duration": "14:20",
  "guid": "enyouth16052021-136",
  "length": 860.32,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 136: Your Story Has Power",
  "itunes:subtitle": "Proverbs 12:17, Ruth 1:3–16, Ruth 2:1–13, John 9:1-25.  Your story may not be as dramatic as Mark’s, but *everyone* has a story  Whether you were brought up as a Christian or whether you have only been a Christian for a few hours, your story has power",
  "itunes:summary": "Mark Heather’s parents split up when he was a child and he was brought up by his alcoholic mother who beat him. When he was fourteen years old, he stood up to her and said he would not accept the beatings any more. The next day she took her own life.\nFrom that moment, he was placed in care and became, in his words, ‘pretty nuts really’ – getting into trouble with the police, involved in drugs, and spiralling into an increasingly self-destructive lifestyle.\nMark (now in his 30s) was invited by his girlfriend to Alpha at HTB. On the weekend away, he had a powerful encounter with God. He said, ‘My group leader, Toby, prayed for me, for the Holy Spirit to come – and I knew that it was happening. The experience resulted in me crying uncontrollably.\n‘I ran to the pub down the road, grabbed a beer, wandered back and sat in the darkest corner outside that I could find. After sitting quietly, a total comfort enveloped me. I felt total love. I felt part of a family, which is something that I had no way of knowing until then.\n‘Crying, I prayed for one more sign. I asked for Toby to come out the door. As I asked, Toby walked through that very door to look for me.\n‘God is real and he loves me unconditionally and he is gentle. The Holy Spirit saved me. The Alpha Weekend helped me find him. He knew where I was so when I got to the right place, he was waiting.’\nMark’s personal story has had a powerful impact on many people’s lives. Your story may not be as dramatic as Mark’s, but everyone has a story. Whether you were brought up as a Christian or whether you have only been a Christian for a few hours, your story has power.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 136
}