{
  "title": "Supply Chain Leaders, Prioritize These Three Talent Strategy Essentials",
  "link": "https://sloanreview.mit.edu/article/supply-chain-leaders-prioritize-these-three-talent-strategy-essentials/",
  "comments": "https://sloanreview.mit.edu/article/supply-chain-leaders-prioritize-these-three-talent-strategy-essentials/#respond",
  "pubDate": "Mon, 03 Oct 2022 11:00:32 +0000",
  "dc:creator": "Inge Oosterhuis and Kristine Renker. <p>Inge Oosterhuis is a managing director, Talent &#038; Organization for Supply Chain &#038; Operations, at Accenture. Kristine Renker is a managing director, Strategy &#038; Consulting, Supply Chain &#038; Operations, at Accenture.</p>\n",
  "category": [
    "Problem-Solving",
    "Resilience",
    "Supply Chain Management",
    "Developing Strategy",
    "Operations",
    "Skills & Learning",
    "Strategy",
    "Supply Chains & Logistics"
  ],
  "description": "Leaders are hyper-focused on developing overall supply chain resiliency to better prepare for and quickly respond to an ever-growing number of unpredictable challenges — from sudden global shocks to inflationary pressure to new ESG (environmental, social, and governance) requirements. A critical task for success on this front: building flexibility into the talent base. Chief supply [&#8230;]",
  "content:encoded": "<p></p>\n<figure class=\"article-inline\">\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/09/2022_1005_Oosterhuis-Supply-Chain-1290x860-1.jpg\" alt=\"\" /><br />\n</figure>\n<p>Leaders are hyper-focused on developing overall supply chain resiliency to better prepare for and quickly respond to an ever-growing number of unpredictable challenges — from sudden global shocks to inflationary pressure to new ESG (environmental, social, and governance) requirements. A critical task for success on this front: building flexibility into the talent base. </p>\n<p>Chief supply chain officers (CSCOs) know this; <a href=\"https://www.accenture.com/_acnmedia/PDF-175/Accenture-Resilient-Supply-Chain.pdf\">Accenture research</a> shows that 82% of CSCOs believe their organization needs to develop employees with broad-ranging skills, rather than narrow technical competence, so that they can solve complex, cross-industry problems. At the same time, only 38% of surveyed CSCOs say their workforce is mostly or completely ready to leverage their technology tools, and under half (44%) have enough specialists (such as data scientists) in their talent pool. </p>\n<p></p>\n<p>Staffing the supply chain workforce is a big challenge — in fact, it’s one of the biggest challenges businesses have ever faced. Yet CSCOs may be overlooking or underestimating three essential elements of their talent strategy. This might be because they’re too slammed managing day-to-day crises to think even a few months ahead or because, given the ever-quicker pace of technology evolution, it’s difficult to pinpoint the particular skills they need most.</p>\n<p><strong>The rise of cross-supply-chain thinkers.</strong> While deep, specialized skill sets in procurement, operations, manufacturing, and logistics will always be important, companies also need individuals attuned to driving important bigger-picture outcomes like greater resiliency, innovation, enhanced business responsibility, and sustainable cost reduction. Those high-priority areas aren’t easily addressed with siloed functional teams executing a series of transactional activities that rarely ultimately connect. </p>\n<p></p>\n<p>Meaningful ideas and insightful answers don’t come from an inventory specialist, demand planner, or warehouse manager working in isolation. Rather, they require a setting that recognizes and values creativity and, critically, those individuals who can understand dependencies and influences. Solving problems requires working beyond silos and divisions, including beyond the bounds of the company itself — perhaps even driving strategic ecosystem partnerships to address bigger issues.</p>\n<p>One way to build your team’s skills in cross-supply-chain thinking is to implement a <a href=\"https://sloanreview.mit.edu/article/assignments-are-critical-tools-to-achieve-workplace-gender-equity\">system of rotating assignments</a> among the various supply chain departments. Everyone involved will see the bigger picture firsthand; for example, demand planners will have a new perspective on their own role after a three-month stint in logistics, manufacturing, and procurement. This deeper knowledge of connections and interdependencies will not only improve demand planners’ performance in their current role but also help prepare them for the move toward a future network planner role. However, as a lot of companies are wrestling with filling their vacancies, job rotation or shadowing might be a luxury that is not affordable. Another way to stimulate more integrated thinking and enhance end-to-end understanding is to create autonomous teams (pods) with representatives from different departments to tackle topics like innovation or sustainability.    </p>\n<p><strong>The use of AI and machine learning to uncover and develop new skills.</strong> Companies across the globe are already using <a href=\"https://sloanreview.mit.edu/article/unlocking-the-potential-of-digital-twins-in-supply-chains\">new digital technologies in the supply chain</a> to increase resilience and make faster, better business decisions. But they may not realize how effectively these tools can also help ensure that their human workforce has the right skills. An application called <a href=\"https://www.accenture.com/_acnmedia/PDF-159/Accenture-SolutionsAI-Talent-Skilling-2.pdf\">Skills.AI</a> uses AI and machine learning to see how the skills currently associated with a particular role might themselves evolve as the role evolves. Our <a href=\"https://www.accenture.com/_acnmedia/PDF-165/Accenture-Supply-Chain-Workforce-of-the-Future-2021.pdf\">research</a> shows a far bigger overlap in core skills critical to multiple roles than is immediately apparent. Employees may <em>already</em> have the skills they need for future roles, or similar ones to build on — skills they and their managers may see value in developing. </p>\n<p>When people self-report their skills, they tend to have a narrow frame of reference. They typically identify, on average, 11 skills for a particular role. AI and machine learning can help identify hidden skills people don’t readily identify as theirs. Those 11 skills, for example, could more than triple with an assist from AI. Skills-matching data can reveal that people in very different roles actually have more similar skills than they realize; consider, for instance, a 63% skills match between the roles of inventory replenishment manager and e-commerce manager.</p>\n<p>Today, individuals are selling themselves short — and their companies are overlooking valuable skills that could quickly translate to new roles. By harnessing AI tools to better identify all the skills a person has, and exactly what they need to move to a new role, a company can quickly create more tailored interventions to close the gap. Targeting reskilling for completely different roles can be accomplished far more quickly and effectively this way than through traditional training approaches. </p>\n<p></p>\n<p><strong>The need to embrace all types of workers.</strong> As companies broaden their vision of a cross-skilled supply chain workforce, they must engage with every type of talent that contributes to their work. Beyond traditional employees, today’s workforces encompass a larger ecosystem of contractors, gig workers, and more. Companies are also gaining flexibility to adjust how people work — for example, tapping aging front-line workers to share their hard-earned knowledge so that their skills and perspectives carry forward to a new generation. </p>\n<p>To engage talent and ensure that your entire workforce shares a deep understanding of the job changes on the horizon, surface and broadcast the new learning opportunities that digitization continues to create. Offering upskilling options and the opportunities to learn on the job, communicating early and often, and supporting your workforce’s ongoing development are three key ways to keep employees — as well as any unions that represent them — informed and engaged.</p>\n<p>It may not be possible to solve all of tomorrow’s workforce issues today, but thinking big and acting boldly will take you far. Embracing more advanced technology in the supply chain can position your workforce to set your company apart from the competition. </p>\n<p></p>\n",
  "wfw:commentRss": "https://sloanreview.mit.edu/article/supply-chain-leaders-prioritize-these-three-talent-strategy-essentials/feed/",
  "slash:comments": 0
}