{
  "title": "Mozambican Journalist Feared Forcibly Disappeared in Cabo Delgado",
  "link": "https://www.hrw.org/news/2022/11/02/mozambican-journalist-feared-forcibly-disappeared-cabo-delgado",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        Arlindo Chissale, pictured on the right, in a photo uploaded to Facebook on October 19, 2022.\n                    © 2022 Arlindo Chisalle\n          \n\n  \n<p>Another journalist has gone missing in Mozambique’s embattled northern province of Cabo Delgado after police took him into custody on October 29 while he was working in the mining town of Balama. Arlindo Chissale is a freelancer and editor of Pinnacle News, an online publication that has covered the ongoing violence in northern Mozambique.</p>\n\n<p>Chissale has been held incommunicado and without access to lawyers since being detained on Saturday, a family member and friends told Human Rights Watch. According to the Mozambican media rights group Misa, a local official confirmed that police took Chissale to the local police station but provided no further details.</p>\n\n<p>Chissale’s forced disappearance follows many other documented cases in which Mozambican security forces harassed, threatened, and arbitrarily detained journalists covering fighting between government forces and the Islamist armed group al-Shabab, known locally as Mashababos.</p>\n\n<p>The last journalist known to have disappeared in Cabo Delgado was Ibrahimo Mbaruco, in April 2020. He went missing after meeting a group of government soldiers in Palma town and has not been heard from since. The Mozambican government has not publicly disclosed the status of the investigations, if any, into his disappearance.</p>\n\n<p>Under international law, the arrest or detention of a person by state officials or their agents followed by a refusal to acknowledge the deprivation of liberty, or to reveal the person’s fate or whereabouts, is an enforced disappearance. People who have been forcibly disappeared are outside the protection of the law and are often at risk of torture and extrajudicial execution.</p>\n\n<p>The Mozambican government should immediately take steps to locate Chissale, inform his family of his whereabouts, and ensure his safe return home. The authorities should also stop security force members from harassing and threatening journalists and take action against those who continue to do so.</p>",
  "pubDate": "Wed, 02 Nov 2022 13:24:43 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/02/mozambican-journalist-feared-forcibly-disappeared-cabo-delgado"
}