{
  "title": "S1E27 - How to Be Resilient Through Adversity & Improve Performance with Dr. Ben Houltberg",
  "guid": "https://pinecast.com/guid/bf8845ee-d5f1-4f66-9703-72126dce5888",
  "pubDate": "Tue, 08 Dec 2020 07:30:00 -0000",
  "itunes:duration": "00:57:55",
  "description": "<p>Dr. Benjamin Houltberg, VP of Research and Practice at Search Institute, is Laura’s very special guest on today’s episode. Ben is a developmental scientist, and an experienced licensed marriage and family therapist, as well as a former elite athlete. He is widely published in topics such as the socialization of adolescent emotion regulation, promoting resilience through adversity, character, and identity development in sports. As you will discover, he is also well versed in the practice of Mindfulness, and he is here to share his vast amount of experience, knowledge, and advice with you today.</p>\n<p>Ben begins by sharing his journey from his first interest in sports and his running career, through to his current position, and then offers a thorough analysis of both performance based and purpose based identity, as well as the continuum between them. From this analysis, he expands upon performing out of fear and coping with it, mental health, his perspective on overcoming the challenges that this past year has provided, and the importance of gratitude and positive emotions. While examining the foundation for dealing with adversity, Ben explains the concept of Mindfulness, and actually leads Laura and our listeners through an exercise. He finishes the conversation discussing virtue development and high performance and sharing his advice for young athletes. Ben’s overriding belief that we are all of value, not because of our performance, but because of who we are, is evident throughout this inspiring episode. His is an impactful and important message for absolutely everyone to hear and to heed.</p>\n<p><strong>Episode Highlights:</strong></p>\n<ul>\n<li>Ben’s journey from his start in sports to his current position</li>\n<li>Performance based identity, purpose based identity and the continuum between the two</li>\n<li>The impact of ‘performing out of fear’ and recognizing when you are struggling with it</li>\n<li>Steps to follow for coping with the fear</li>\n<li>Emotional regulation and co-regulation</li>\n<li>Mental health in the world of sport and society in general</li>\n<li>Michael Phelps’ ‘Weight of Gold’ documentary</li>\n<li>Ben’s observations and guidance regarding 2020 and moving forward from it</li>\n<li>The importance of feeling gratitude and expressing it to others</li>\n<li>The impact of positive and negative emotions</li>\n<li>3 foundational aspects to preparing for adversity</li>\n<li>Mindfulness and its importance</li>\n<li>A mindfulness activity</li>\n<li>Virtue development and high performance</li>\n<li>A study regarding the impact of negative emotions and connection</li>\n<li>Ben’s advice to young athletes</li>\n</ul>\n<p><strong>Quotes:</strong></p>\n<ul>\n<li>“My same exhilaration for sports began to transfer over to my desire to want to understand how the mind works and how relationships work.”</li>\n<li>“In the process of trying to study this, I experienced my own kind of healing in some of the wounds that I experienced as an athlete.”</li>\n<li>“When results start to get wrapped up as the main definer of your self-worth, then it has devastating consequences.”</li>\n<li>“I really firmly believe that there’s a lot of athletes who ‘choke’ or ‘bonk’, or whatever you want to call it, that really comes from an overstimulated sympathetic nervous system.”</li>\n<li>“Often, our body responds even before we are able to process it cognitively.”</li>\n<li>“Our external lives and relationships and stressors all can have positive or negative consequences physiologically on us.”</li>\n<li>“We deal with stress and pain better when we have a purpose that’s bigger than ourselves.”</li>\n<li>“These athletes that have this more purpose based identity, they achieve at really high levels as well, but they don’t have the consequences of high levels of depression or anxiety or shame.”</li>\n<li>“Throughout history and throughout research, we just do better when we’re connected to others and we have this connection to some type of transcendent purpose.”</li>\n<li>“What do I value? What is most important to me?”</li>\n<li>“Relationships are so powerful for our emotional health.”</li>\n<li>“How can I serve the people around me right now?”</li>\n<li>“The foundation of the self becomes really important…the mindset skills are also really important.”</li>\n<li>“Invest in your relationships – in healthy ones.”</li>\n<li>“Being mindful in your day-to-day is really just…a non-judgmental awareness of being in the present moment.”</li>\n<li>“For me, breath also represents a connection to God or even for some people to everybody around them, the source of life.”</li>\n<li>“You are valued. You are loved. You are known. You are free. And your worth does not depend on your performance. And you have something to offer this world that nobody else can take away…there’s a purpose in what you can contribute to those around you.”</li>\n<li>“When we do have that solid foundation, we are able to also give our best, and I think that’s where virtue development and high performance come together.”</li>\n</ul>\n<p><strong>Links:</strong></p>\n<p>The Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a>\nMental Training:   <a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">https://www.laurawilkinson.com/learn </a>\nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a><br>\nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a></p>\n<p><strong>Connect with Ben:</strong></p>\n<p>Search Institute:   <a href=\"https://www.search-institute.org/\" rel=\"nofollow\">https://www.search-institute.org/ </a>\nFacebook:   <a href=\"https://www.facebook.com/drbenhoultberg/\" rel=\"nofollow\">https://www.facebook.com/drbenhoultberg/</a>\nTwitter:   <a href=\"https://twitter.com/benhoultberg\" rel=\"nofollow\">https://twitter.com/benhoultberg</a></p>",
  "itunes:title": "How to Be Resilient Through Adversity & Improve Performance with Dr. Ben Houltberg",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 27
}