{
  "title": "Multi-photon polymerization using upconversion nanoparticles for tunable feature-size printing. (arXiv:2211.01437v1 [physics.optics])",
  "link": "http://arxiv.org/abs/2211.01437",
  "description": "<p>The recent development of light-based 3D printing technologies has marked a\nturning point in additive manufacturing. Through photopolymerization, liquid\nresins can be solidified into complex objects. Usually, the polymerization is\ntriggered by exciting a photoinitiator with ultraviolet (UV) or blue light. In\ntwo-photon printing (TPP), the excitation is done through the non-linear\nabsorption of two photons; it enables printing 100-nm voxels but requires\nexpensive femtosecond lasers which strongly limits their broad dissemination.\nUpconversion nanoparticles (UCNPs) have recently been proposed as an\nalternative to TPP for photopolymerization but using continuous-wave lasers.\nUCNPs convert near-infrared (NIR) into visible/UV light to initiate the\npolymerization locally as in TPP. Here we provide a study of this multi-photon\nmechanism and demonstrate how the non-linearity impacts the printing process.\nIn particular, we report on the possibility of fine-tuning the size of the\nprinted voxel by adjusting the NIR excitation intensity. Using gelatin-based\nhydrogel, we are able to vary the transverse voxel size from 1.3 to 2.8 {\\mu}m\nand the axial size from 7.7 to 59 {\\mu}m by adjusting the NIR power without\nchanging the degree of polymerization. This work opens up new opportunities for\nspeeding up the fabrication while preserving the minimum feature size with\ncheap light sources.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Zhang_Q/0/1/0/all/0/1\">Qianyi Zhang</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Boniface_A/0/1/0/all/0/1\">Antoine Boniface</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Parashar_V/0/1/0/all/0/1\">Virendra K. Parashar</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Gijs_M/0/1/0/all/0/1\">Martin A. M. Gijs</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Moser_C/0/1/0/all/0/1\">Christophe Moser</a>"
}