{
  "id": "https://bibleinoneyear.org/en/youth/41",
  "title": "Day 41: Life-Changing Words",
  "description": "Psalm 19:7–12, Exodus 6:13, 7:10–13, 8:30–32, Matthew 26:47–63.  God is continually communicating with us  He does so, primarily, through the life-changing words of the Bible",
  "pubDate": "Wed, 10 Feb 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/41/?ignore",
  "itunes:duration": "13:31",
  "guid": "enyouth10022021-41",
  "length": 811.68,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 41: Life-Changing Words",
  "itunes:subtitle": "Psalm 19:7–12, Exodus 6:13, 7:10–13, 8:30–32, Matthew 26:47–63.  God is continually communicating with us  He does so, primarily, through the life-changing words of the Bible",
  "itunes:summary": "My father wanted to go to Russia before he died. We went there on holiday as a family. At that time Bibles were strictly illegal in the Soviet Union. I took with me some Russian Bibles. While I was there I went to churches and looked for people who seemed to be genuine Christians. (Church meetings were often infiltrated by the KGB.)\nOn one occasion, I followed a man down the street after a service. I went up to him and tapped him on the shoulder. There was nobody about. I took out one of my Bibles and handed it to him. For a moment, he had an expression of utmost disbelief. Then he took from his pocket a New Testament, which was probably 100 years old. The pages were so threadbare they were virtually transparent. When he realised that he had received a whole Bible, he was elated. He didn’t speak any English and I didn’t speak any Russian. But we hugged each other and he started to run up and down the street jumping for joy.\nThe words of God are ‘more precious than gold, than much pure gold; they are sweeter than honey, than honey from the comb’ (Psalm 19:10).\nWhy are the words of God so precious? Jesus said: ‘People do not live on bread alone, but on every word that comes from the mouth of God’ (Matthew 4:4). The original expression means ‘is continually coming out of the mouth of God’; it is like a stream pouring forth and, like the stream of a fountain, it is never static. God is continually communicating with us. He does so, primarily, through the life-changing words of the Bible.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 41
}