{
  "id": "tag:blogger.com,1999:blog-15418143.post-7872786804655838317",
  "published": "2018-05-16T14:22:00.001-05:00",
  "updated": "2018-05-16T14:22:45.975-05:00",
  "category": [
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  "title": "DeepFakes: AI-powered deception machines",
  "content": "Driven by computer vision and deep learning techniques, a new wave of imaging attacks has recently emerged which allows anyone to easily create highly realistic \"fake\" videos. These false videos are known as <b>Deep Fakes. </b>While highly entertaining at times, DeepFakes can be used to perturb society and some would argue that the pre-shock has already begun. A rogue DeepFake which goes viral can spread misinformation across the internet like wildfire.<br /><br /><blockquote class=\"tr_bq\">\"<i>The ability to effortlessly create visually plausible editing of faces in videos has the potential to severely undermine trust in any form of digital communication. </i>\"</blockquote><blockquote class=\"tr_bq\" style=\"text-align: right;\">--Rössler et al. FaceForensics [3]</blockquote><br />Because DeepFakes contain a unique combination of realism and novelty, they are more difficult to detect on social networks as compared to traditional \"bad\" content like pornography and copyrighted movies. Video hashing might work for finding duplicates or copyright-infringing content, but not good enough for DeepFakes. To fight face-manipulating DeepFake AI, one needs an even stronger AI.<br /><br />As today's DeepFakes are based on Deep Learning, and Deep Learning tools like TensorFlow and PyTorch are accessible to anybody with a modern GPU, such face manipulation tools are particularly disruptive. The democratization of Artificial Intelligence has brought us near infinite use-cases. <b>From the DeepDream phenomenon of 2015 to the Deep Style Transfer Art apps of 2016, 2018 is the year of the DeepFake. </b>Today's computer vision technology allows a hobbyist to create a Deep Fake video of just about any person they want performing any action they want, in a matter of hours, using commodity computer hardware.<br /><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://2.bp.blogspot.com/-HYA207hkaf4/WvvXnzXXTyI/AAAAAAAAP1o/O1MGUy4EOtARBrocGmsu2-r_7UtE5vtzQCLcBGAs/s1600/mind.png\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"350\" data-original-width=\"730\" height=\"190\" src=\"https://2.bp.blogspot.com/-HYA207hkaf4/WvvXnzXXTyI/AAAAAAAAP1o/O1MGUy4EOtARBrocGmsu2-r_7UtE5vtzQCLcBGAs/s400/mind.png\" width=\"400\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\"><span style=\"font-size: small;\">Fig 1. DeepFakes generate \"false impressions\" which are attacks on the human mind.</span></td></tr></tbody></table><b><br />What is a Deep Fake?</b><br />A deep fake is a video generated from a modern computer vision puppeteering face-swap algorithm which can be used to generate a video of target person X performing target action A, usually given a video of another person Y performing action A. The underlying system learns two face models, one of target person X, and of for person Y, the person in the original video. It then learns a mapping between the two faces, which can be used to create the resulting \"fake\" video. Techniques for facial reenactment have been pioneered by movie studios for driving character animations from real actors' faces, but these techniques are now emerging as deep learning-based software packages, letting the deep convolutional neural networks do most of the work during model training.<br /><br />Consider the following collage of faces. Can you guess which ones are real and which ones are DeepFakes?<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-yOv9HEZSkZo/Wvvd_o8kCsI/AAAAAAAAP2A/8pliA-DpPdgmz6Ncgp-GhSojmZG-cP12wCLcBGAs/s1600/faceforensics.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"652\" data-original-width=\"1600\" height=\"162\" src=\"https://1.bp.blogspot.com/-yOv9HEZSkZo/Wvvd_o8kCsI/AAAAAAAAP2A/8pliA-DpPdgmz6Ncgp-GhSojmZG-cP12wCLcBGAs/s400/faceforensics.png\" width=\"400\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\">Fig 2. Can you tell which faces are real and which ones are fake?&nbsp;</div><div class=\"separator\" style=\"clear: both; text-align: center;\">Figure from Face Forensics[3]</div><br />It is not so easy to tell which image is modified and which one is unadulterated. And if you do a little bit of searching for DeepFakes (warning, unless you are careful, you will encounter lots of pornographic content) you notice that the faces in those videos look very realistic.<br /><br /><b>How are Deep Fakes made?</b><br />While there are conceptually many different ways to make Deep Fakes, today we'll focus on two key underlying techniques: face detection from videos, and deep learning for creating frame alignments between source face X and target face Y.<br /><br /><div style=\"text-align: left;\">A lot of this research started with the Face2face work [1] presented at CVPR 2016. This paper was a modernization of the group's earlier SIGGRAPH paper and focused a lot more on the computer vision details. At this time the tools were good enough to create SIGGRAPH-quality videos, but it took a lot of work to put together a facial reenactment rig. In addition, the underlying algorithms did not use any deep learning, so a lot of domain-knowledge (i.e., face modeling expertise) went into making these algorithms work robustly.&nbsp;<span style=\"text-align: center;\">The TUM/Stanford guys filed their Real-time facial reenactment patent in 2016 [4], and have more recently worked on FaceForensics[3] to detect such manipulated imagery.</span></div><div style=\"text-align: left;\"><br /></div><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/ohmajJTcpNk\" width=\"460\"></iframe></div><div style=\"text-align: center;\">Fig3. <b>Face2Face technique from 2016</b>. It is 2018 now, so just imagine how much better this works now!</div><b><br /></b> In addition to the Face2face guys (who have now a handful of similarly themed papers), it is interesting to note that a lot of key early ideas in face puppeteering were pioneered by <a href=\"https://homes.cs.washington.edu/~kemelmi/\">Ira Kemelmacher-Shlizerman</a> who is now a computer vision and graphics assistant professor at University of Washington. She worked on early face puppeteering technology for the 2010 paper Being John Malkovich, continued with the Photobios work, and later founded Dreambit (based on a SIGGRAPH 2016 paper), which was acquired by Facebook. :-)<br /><b><br /></b><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-ZSwRTGeWHj8/WvvbI_W2lNI/AAAAAAAAP10/a_sptQou7asj7oG3Q-zVcsfLelyDm326wCLcBGAs/s1600/ira_early_deep_fake.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"475\" data-original-width=\"1600\" height=\"118\" src=\"https://4.bp.blogspot.com/-ZSwRTGeWHj8/WvvbI_W2lNI/AAAAAAAAP10/a_sptQou7asj7oG3Q-zVcsfLelyDm326wCLcBGAs/s400/ira_early_deep_fake.png\" width=\"400\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\">Fig 4. <b>Ira's early work on face swapping in 2010.</b>&nbsp;See the Being John Malkovich paper[2].</div><b><br /></b>Take a look at Ira's Dreambit video, which shows some high-quality \"entertainment\" value out of rapidly produced non-malicious DeepFakes!<br /><br /><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/mILLFK1Rwhk\" width=\"460\"></iframe></div><div style=\"text-align: center;\">Fig 5. <b>Ira's Dreambit system</b>. Lets her imagine herself in different eras, with different hairstyles, etc.</div><div style=\"font-weight: bold;\"><b><br /></b></div>The origin of Ira's&nbsp;Dreambit system is the&nbsp;Transfiguring Portraits SIGGRAPH 2016 paper[6]. What's important to note is that this is 2016 and we're starting to see some use of Deep Learning. The transfiguring portraits work used a big mix of features, using some CNN features computed from early Caffe networks. It is not an entirely easy-to-use system at this point, but good enough to make SIGGRAPH videos, take a one minute to generate other cool outputs, and definitely cool enough for Facebook to acquire.<br /><div class=\"separator\" style=\"clear: both; font-weight: bold; text-align: center;\"><br /></div><div style=\"font-weight: bold;\"><br /></div><div class=\"separator\" style=\"clear: both; font-weight: bold; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-pljf2NHUUWs/WvvuOynn5YI/AAAAAAAAP20/d0m63YDr0ZgT1YNVZadRft8YIjFl23J0gCLcBGAs/s1600/transfiguring_portraits_deepfake.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"514\" data-original-width=\"1384\" height=\"147\" src=\"https://2.bp.blogspot.com/-pljf2NHUUWs/WvvuOynn5YI/AAAAAAAAP20/d0m63YDr0ZgT1YNVZadRft8YIjFl23J0gCLcBGAs/s400/transfiguring_portraits_deepfake.png\" width=\"400\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\">Fig 6. <b>Transfiguring Portraits</b>. The system used lots of features, but Deep Learning-based CNN features are starting to show up.</div><div style=\"font-weight: bold;\"><b><br /></b></div><b>Fighting against DeepFakes</b><br />There are now published algorithms which try to battle DeepFakes by determining if faces/videos are fake or not. FaceForensics[3] introduces a large DeepFake dataset based on their earlier Face2face work. This dataset contains both real and \"fake\" Face2face output videos. More importantly, the new dataset is big enough to train a deep learning system to determine if an image is counterfeit. In addition, they are able to both 1.) determine which pixels have likely been manipulated, and 2.) perform a deep cleanup stage to make even better DeepFakes.<br /><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-uZCHrqaOI5A/WvwaGqmurPI/AAAAAAAAP3U/1WXHG6gBZSUbrSuvCLngsdJ6RkqGdSW5ACLcBGAs/s1600/deepmask_deepfake_detection.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"613\" data-original-width=\"1387\" height=\"176\" src=\"https://4.bp.blogspot.com/-uZCHrqaOI5A/WvwaGqmurPI/AAAAAAAAP3U/1WXHG6gBZSUbrSuvCLngsdJ6RkqGdSW5ACLcBGAs/s400/deepmask_deepfake_detection.png\" width=\"400\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\">Fig 7. <b>The \"fakeness\" masks in FaceForensics[3] are based on XceptionNet</b></div><br /></div><div>Another fake detection approach, this time from a Berkeley AI Research group called Image Splice Detection, focuses on detecting where an image was spliced to create a fake composite image. This allows them to determine which part of the image was likely \"photoshopped\" and the technique is not specific to faces. And because this is a 2018 paper, it should not be a surprise that this kind of work is all based on deep learning techniques.<b><br /></b><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/--5baWKzAjDQ/WvviZIa5XdI/AAAAAAAAP2Y/4O2IbDtKtfgAjH3UD76YYRyJNMaBzku1QCLcBGAs/s1600/efros_fake_news.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"649\" data-original-width=\"1388\" height=\"186\" src=\"https://2.bp.blogspot.com/--5baWKzAjDQ/WvviZIa5XdI/AAAAAAAAP2Y/4O2IbDtKtfgAjH3UD76YYRyJNMaBzku1QCLcBGAs/s400/efros_fake_news.png\" width=\"400\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\">Fig 8. <b>Fighting Fake News: Image Splice Detection</b>[5]<b>. </b>Response maps are aggregated to determine the combined probability mask.[5]</div><br />From the Fighting Fake News paper,<br /><blockquote class=\"tr_bq\">\"<i>As new advances in computer vision and image-editing emerge, there is an increasingly urgent need for effective visual forensics methods. We see our approach, which successfully detects manipulations without seeing examples of manipulated images, as being an initial step toward building general-purpose forensics tools</i>.\"</blockquote><br /><b>Concluding Remarks</b><br />The early DeepFake tools were pioneered in the early 2010s and were producing SIGGRAPH-quality results by 2015. It was only a matter of years until DeepFake generators became publicly available. 2018's DeepFake generators, being written on top of open-source Deep Learning libraries, are much easier to use than the researchy systems from only a few years back. Today, just about any hobbyist with minimal computer programming knowledge and a GPU can build their own DeepFakes.<br /><br />Just as Deep Fakes are getting better, Generative Adversarial Networks are showing more promise for photorealistic image generation. It is likely that we will soon see lots of exciting new work on both the generative side (deep fake generation) and the discriminative side (deep fake detection and image forensics) which incorporate more and more ideas from the machine learning community.<br /><b><br /></b> <b><br /></b> <b>References</b><br /><br />[1] Justus Thies, Michael Zollhöfer, Marc Stamminger, Christian Theobalt, and Matthias Nießner. \"<a href=\"https://web.stanford.edu/~zollhoef/papers/CVPR2016_Face2Face/paper.pdf\">Face2face: Real-time face capture and reenactment of rgb videos</a>.\" In Computer Vision and Pattern Recognition (CVPR), 2016 IEEE Conference on, pp. 2387-2395. IEEE, 2016.<br /><br />[2] Ira Kemelmacher-Shlizerman, Aditya Sankar, Eli Shechtman, and Steven M. Seitz. \"<a href=\"http://grail.cs.washington.edu/projects/malkovich/\">Being john malkovich</a>.\" In European Conference on Computer Vision, pp. 341-353. Springer, 2010.<br /><br />[3] Andreas Rössler, Davide Cozzolino, Luisa Verdoliva, Christian Riess, Justus Thies, and Matthias Nießner. \"<a href=\"https://arxiv.org/abs/1803.09179\">FaceForensics: A Large-scale Video Dataset for Forgery Detection in Human Faces</a>.\" arXiv preprint arXiv:1803.09179, 2018.<br /><br />[4] Christian Theobalt, Michael Zollhöfer, Marc Stamminger, Justus Thies, Matthias Nießner. Real-time Expression Transfer for Facial Reenactment Invention. 2018/3/8. Application Number&nbsp;15256710<br /><br />[5]&nbsp;Minyoung Huh, Andrew Liu, Andrew Owens, Alexei A. Efros, \"<a href=\"https://arxiv.org/abs/1805.04096\">Fighting Fake News: Image Splice Detection via Learned Self-Consistency.</a>\" arXiv preprint arXiv:1805.04096, 2018<br /><br />[6] Ira Kemelmacher-Shlizerman, \"<a href=\"https://homes.cs.washington.edu/~kemelmi/Transfiguring_Portraits_Kemelmacher_SIGGRAPH2016.pdf\">Transfiguring portraits</a>.\" ACM Transactions on Graphics (TOG), 35(4), p.94. 2016<br /><br /><br /><br /><br /></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Tomasz Malisiewicz",
    "uri": "http://www.blogger.com/profile/17507234774392358321",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}