{
  "title": "Electric Geek Transportation Systems",
  "description": "<!--kg-card-begin: markdown--><p>I've never thought of myself as a \"car person\". The last new car I bought (and in fact, now that I think about it, the <em>first</em> new car I ever bought) was the <a href=\"https://www.hagerty.com/articles-videos/articles/2018/04/12/cult-of-the-ford-svt-contour\">quirky 1998 Ford Contour SVT</a>. Since then we bought a VW station wagon</p>",
  "link": "https://blog.codinghorror.com/electric-geek-transportation-systems/",
  "guid": "5d5ba9f979b255003874fb4a",
  "dc:creator": "Jeff Atwood",
  "pubDate": "Tue, 20 Aug 2019 11:35:16 GMT",
  "content:encoded": "<!--kg-card-begin: markdown--><p>I've never thought of myself as a \"car person\". The last new car I bought (and in fact, now that I think about it, the <em>first</em> new car I ever bought) was the <a href=\"https://www.hagerty.com/articles-videos/articles/2018/04/12/cult-of-the-ford-svt-contour\">quirky 1998 Ford Contour SVT</a>. Since then we bought a VW station wagon in 2011 and a Honda minivan in 2012 for family transportation duties. That's it. Not exactly the stuff <a href=\"https://en.wikipedia.org/wiki/The_Stig\">The Stig's</a> dreams are made of.</p>\n<p>The station wagon made sense for a family of three, but became something of a disappointment because it was purchased before &#x2014; surprise! &#x2014; <a href=\"https://blog.codinghorror.com/on-parenthood/\">we had twins</a>. As <a href=\"http://www.online-literature.com/twain/3274/\">Mark Twain once said</a>:</p>\n<blockquote>\n<p>Sufficient unto the day is one baby. As long as you are in your right mind don't you ever pray for twins. Twins amount to a permanent riot. And there ain't any real difference between triplets and an insurrection.</p>\n</blockquote>\n<p>I'm here to tell you that a station wagon doesn't <em>quite</em> cut it as a permanent riot abatement tool. For that you need a full sized minivan.</p>\n<p>I'm <a href=\"https://philip.greenspun.com/materialism/cars/sienna\">with Philip Greenspun</a>. Like black socks and sandals, minivans are actually &#x2026; <em>kind of awesome?</em> Don't believe all the SUV propaganda. Minivans are flat out superior vehicle command centers. <a href=\"https://www.youtube.com/watch?v=pUG3Z8Hxa5I\">Swagger wagons</a>, really.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/08/a-team-van.jpg\" alt=\"a-team-van\" loading=\"lazy\"></p>\n<p>The A-Team <a href=\"https://starcars.fandom.com/wiki/The_A-Team_Van\">drove a <em>van</em></a>, not a freakin' SUV. I rest my case.</p>\n<p>After 7 years, the station wagon had to go. We initially looked at hybrids because, well, <a href=\"https://www.sfgate.com/opinion/article/Oh-so-pious-Prius-drivers-Smugness-drifts-2581016.php\">isn't that required in California at this point?</a> But if you know me at all, you know I'm a boil the sea kinda guy at heart. I figure if you're going to flirt with partially electric cars, why not put aside these half measures and go all the way?</p>\n<p>Do you remember that <a href=\"https://theoatmeal.com/comics/tesla_model_s\">rapturous 2014 Oatmeal comic about the Tesla Model S</a>? Even for a person who has basically zero interest in automobiles, it did sound <em>really cool</em>.</p>\n<p><a href=\"https://theoatmeal.com/comics/tesla_model_s\"><img src=\"https://blog.codinghorror.com/content/images/2019/08/oatmeal-tesla-s-spaceboat.jpg\" alt=\"oatmeal-tesla-s-spaceboat\" loading=\"lazy\"></a></p>\n<p>It's been 5 years, but from time to time I'd see some electric vehicle on the road and I'd think about that <strong>Intergalactic SpaceBoat of Light and Wonder</strong>. Maybe it's time for our family to jump on the electric car trend, too, and just late enough that we can avoid the bleeding edge and end up merely on the &#x2026; <em>leading</em> edge?</p>\n<p>That's why we're now the proud owners of a <a href=\"https://www.caranddriver.com/reviews/a26144426/2019-kia-niro-ev-driven/\">fully electric 2019 Kia Niro</a>.</p>\n<p><a href=\"https://www.caranddriver.com/reviews/a26144426/2019-kia-niro-ev-driven/\"><img src=\"https://blog.codinghorror.com/content/images/2019/08/kia-niro-2019.jpg\" alt=\"kia-niro-2019\" loading=\"lazy\"></a></p>\n<p>I've somehow gone from being a person who basically doesn't care about cars at all &#x2026; to being <strong>one of those insufferable electric car people who won't shut up about them</strong>.  I apologize in advance. If you suddenly feel an overwhelming urge to close this browser tab, I don't blame you.</p>\n<p>I was expecting another car, like the three we bought before. What I got, instead, was a transformation:</p>\n<ul>\n<li>\n<p>Yes, yes, electric cars are clean, but it's a revelation how clean <em>everything</em> is in an electric. You take for granted how dirty and noisy gas based cars are in daily operation &#x2013; the engine noise, the exhaust fumes, the brake dust on the rims, the oily residues and thin black film that descends on everything, the way you have to wash your hands every time you use the gas station pumps. You don't fully appreciate how oppressive those little dirty details were until they're gone.</p>\n</li>\n<li>\n<p>Electric cars are (almost) completely silent. I guess technically in 2019 electric cars require artificial soundmakers at low speed for safety, and this car has one. But The Oatmeal was right. Electric cars <em>feel</em> like spacecraft because they move so effortlessly. There's virtually no delay from action to reaction, near immediate acceleration and deceleration &#x2026; with almost no sound or vibration at all, like you're in freakin' space! It's so immensely satisfying!</p>\n</li>\n<li>\n<p>Electric cars aren't just <em>electric</em>, they're utterly digital to their very core. Gas cars always felt like the classic 1950s Pixar Cars world of grease monkeys and machine shop guys, maybe with a few digital bobbins added here and there as an afterthought. This electric car, on the other hand, is squarely in the post-iPhone world of everyday digital gadgets. It feels more like a giant smartphone than a car. I am a programmer, I'm a digital guy, I love digital stuff. And electric cars are part of <em>my</em> world, rather than the other way around. It feels good.</p>\n</li>\n<li>\n<p>Electric cars are mechanically much simpler than gasoline cars, which means they are inherently more reliable and cheaper to maintain. An internal combustion engine has hundreds of moving parts, many of which require regular maintenance, fluids, filters, and tune ups. It also has a complex transmission to translate the narrow power band of a gas powered engine. None of this is necessary on an electric vehicle, whose electric motor is basically one moving part with simple 100% direct drive from the motor to the wheels. This newfound simplicity is deeply appealing to a guy who always saw cars as incredibly complicated (but computers, not so much).</p>\n</li>\n<li>\n<p>Being able to charge at home overnight is perhaps the most radical transformation of all. Your house is now a \"gas station\". Our Kia Niro has a range of about <strong>250 miles</strong> on a full battery. With any modern electric car, provided you drive less than 200 miles a day round trip (who even drives this much?), it's very unlikely you'll ever need to \"fill the tank\" anywhere but at home. Ever. It's so strange to think that in 50 years, gas stations <a href=\"https://www.houstonchronicle.com/business/energy/article/As-EVs-threaten-gas-stations-owners-turn-to-14291843.php\">may eventually be as odd to see in public as telephone booths now are</a>. Our charger is, conveniently enough, right next to the driveway since that's where the power breaker box was. With the level 2 charger installed, it literally <em>looks</em> like a gas pump on the side of the house, except this one \"pumps\" &#x2026; electrons.</p>\n</li>\n</ul>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/08/level-2-ev-charger.jpg\" alt=\"level-2-ev-charger\" loading=\"lazy\"></p>\n<p>This electric car is such a great experience. It's so much better than our gas powered station wagon that I swear, if there was a fully electric minivan (there isn't) I would literally sell our Honda minivan <em>tomorrow</em> and switch over. Without question. And believe me, I had no plans to sell that vehicle two months ago. The electric car is <em>that much better</em>.</p>\n<p>I was expecting \"yet another car\", but what I got instead was a new, radical worldview. Driving a car powered by barely controlled liquid fuel detonations used to be normal. But in an world of more and more viable electric vehicles this status quo increasingly starts to feel &#x2026; deeply unnatural. Electric is so much better of an overall experience that you begin to wonder: why did we <em>ever</em> do it that way?</p>\n<p>Gas cars seem, for lack of a better word, <a href=\"https://www.bloomberg.com/features/2016-ev-oil-crisis/\"><em>obsolete</em>.</a></p>\n<p><a href=\"https://www.bloomberg.com/features/2016-ev-oil-crisis/\"><img src=\"https://blog.codinghorror.com/content/images/2019/08/ev-sales.jpg\" alt=\"ev-sales\" loading=\"lazy\"></a></p>\n<p>How did this transformation happen, from my perspective, so suddenly? When exactly did electric cars go from \"expensive, experimental thing for crazy people\" to \"By God, I'll never buy another old fashioned gasoline based car if I can help it\"?</p>\n<p>I was vaguely aware of the early electric cars. I even remember one coworker circa 2001 who owned a bright neon green Honda Insight. I ignored it all because, like I said, <em>I'm not a car guy</em>. I needed to do the research to understand the history, and I started with the often recommended documentary <a href=\"https://en.wikipedia.org/wiki/Who_Killed_the_Electric_Car%3F\">Who Killed the Electric Car?</a></p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/-sc-NxP6mmI\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<p>This is mostly about the original highly experimental <a href=\"https://en.wikipedia.org/wiki/General_Motors_EV1\">General Motors EV1</a> from 1996 to 1999. It's so early the first models had lead-acid batteries! &#x1F631; There's a number of conspiracy theories floated in the video, but I think the simple answer to the implied question in the title is straight up <em>price</em>. The battery tech was nowhere near ready, and per the Wikipedia article the estimated actual cost of the car was somewhere between $100,000 and $250,000 though I suspect it was much closer to the latter. It is interesting to note how much the owners (well, leasers) loved their EV1s. Having gone through that same conversion myself, I empathize!</p>\n<p>I then watched the sequel, <a href=\"https://en.wikipedia.org/wiki/Revenge_of_the_Electric_Car\">Revenge of the Electric Car</a>. This one is essential, because it covers the dawn of the modern electric car we have today.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/jkRIu5a6Sb0\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<p>This chronicles the creation of three very influential early electric cars &#x2014; the <a href=\"https://en.wikipedia.org/wiki/Nissan_Leaf\">Nissan Leaf</a>, the <a href=\"https://en.wikipedia.org/wiki/Chevrolet_Volt\">Chevy Volt</a>, and of course the <a href=\"https://en.wikipedia.org/wiki/Tesla_Roadster_(2008)\">Tesla Roadster</a> from 2005 - 2008. The precise moment that Lithium-Ion batteries were in play &#x2013; that's when electric cars started to become viable. Every one of these three electric cars was well conceived and made it to market in volume, though not without significant challenges, both internal and external. None of them were perfect electric vehicles by any means: the Roadster was $100k, the Leaf had limited range, and the Volt was still technically a hybrid, albeit only using the gasoline engine to charge the battery.</p>\n<p>Ten years later, Tesla has the model 3 at $38,000 and we bought our Kia Niro for about the same price. After national and state tax incentives and rebates, that puts the price at around $30,000. It's not as cheap as it needs to be &#x2026; yet. But it's getting there. And it's <a href=\"https://www.corporateknights.com/channels/clean-technology/faceoff-electric-vs-gas-cars-on-cost-15555966/\">already competitive with gasoline vehicles in 2019</a>.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/08/2019-civic-vs-leaf-1.jpg\" alt=\"2019-civic-vs-leaf-1\" loading=\"lazy\"></p>\n<p>It's still early, but the trend lines are clear. And I'm here to tell you that right now, today, I'd buy <em>any</em> modern electric car over a gasoline powered car.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/kk7ZTn9g7bY\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<p>If you too are intrigued by the idea of owning an electric car, <em>you should be</em>. It's freaking awesome! Bring your skepticism, as always; I highly recommend the above Matt Ferrell explainer video on electric vehicle myths.</p>\n<p>As for me, I have seen the future, and it is absolutely, inexorably, and unavoidably &#x2026; electric. &#x26A1;</p>\n<!--kg-card-end: markdown-->"
}