{
  "title": "GRAIMATTER Green Paper: Recommendations for disclosure control of trained Machine Learning (ML) models from Trusted Research Environments (TREs). (arXiv:2211.01656v1 [cs.LG])",
  "link": "http://arxiv.org/abs/2211.01656",
  "description": "<p>TREs are widely, and increasingly used to support statistical analysis of\nsensitive data across a range of sectors (e.g., health, police, tax and\neducation) as they enable secure and transparent research whilst protecting\ndata confidentiality. There is an increasing desire from academia and industry\nto train AI models in TREs. The field of AI is developing quickly with\napplications including spotting human errors, streamlining processes, task\nautomation and decision support. These complex AI models require more\ninformation to describe and reproduce, increasing the possibility that\nsensitive personal data can be inferred from such descriptions. TREs do not\nhave mature processes and controls against these risks. This is a complex\ntopic, and it is unreasonable to expect all TREs to be aware of all risks or\nthat TRE researchers have addressed these risks in AI-specific training.\nGRAIMATTER has developed a draft set of usable recommendations for TREs to\nguard against the additional risks when disclosing trained AI models from TREs.\nThe development of these recommendations has been funded by the GRAIMATTER UKRI\nDARE UK sprint research project. This version of our recommendations was\npublished at the end of the project in September 2022. During the course of the\nproject, we have identified many areas for future investigations to expand and\ntest these recommendations in practice. Therefore, we expect that this document\nwill evolve over time.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Jefferson_E/0/1/0/all/0/1\">Emily Jefferson</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liley_J/0/1/0/all/0/1\">James Liley</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Malone_M/0/1/0/all/0/1\">Maeve Malone</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Reel_S/0/1/0/all/0/1\">Smarti Reel</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Crespi_Boixader_A/0/1/0/all/0/1\">Alba Crespi-Boixader</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kerasidou_X/0/1/0/all/0/1\">Xaroula Kerasidou</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Tava_F/0/1/0/all/0/1\">Francesco Tava</a>, <a href=\"http://arxiv.org/find/cs/1/au:+McCarthy_A/0/1/0/all/0/1\">Andrew McCarthy</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Preen_R/0/1/0/all/0/1\">Richard Preen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Blanco_Justicia_A/0/1/0/all/0/1\">Alberto Blanco-Justicia</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Mansouri_Benssassi_E/0/1/0/all/0/1\">Esma Mansouri-Benssassi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Domingo_Ferrer_J/0/1/0/all/0/1\">Josep Domingo-Ferrer</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Beggs_J/0/1/0/all/0/1\">Jillian Beggs</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chuter_A/0/1/0/all/0/1\">Antony Chuter</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cole_C/0/1/0/all/0/1\">Christian Cole</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ritchie_F/0/1/0/all/0/1\">Felix Ritchie</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Daly_A/0/1/0/all/0/1\">Angela Daly</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Rogers_S/0/1/0/all/0/1\">Simon Rogers</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Smith_J/0/1/0/all/0/1\">Jim Smith</a>"
}