{
  "title": "Episode 97: &#8220;Song to Woody&#8221; by Bob Dylan",
  "link": "https://500songs.com/podcast/episode-97-song-to-woody-by-bob-dylan/",
  "pubDate": "Thu, 10 Sep 2020 10:41:07 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-97-song-to-woody-by-bob-dylan/",
  "description": "Episode ninety-seven of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Song To Woody\" by Bob Dylan, and at the Greenwich Village folk scene of the early sixties. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"<a href=\"https://www.patreon.com/posts/41450820\">Sherry\" by the Four Seasons.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-97-song-to-woody/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode. This might not be available in the US, due to the number of Woody Guthrie songs in a row.\n\nDylan's first album is in the public domain in Europe, so a variety of reissues of it exist. An interesting and cheap one is <a href=\"https://amzn.to/32dQTDb\">this</a>, which pairs it (and a non-album single by Dylan) with two Carolyn Hester albums which give a snapshot of the Greenwich Village scene, on one of which Dylan plays harmonica.\n\nThe Harry Smith Anthology is also now public domain, and can be freely downloaded <a href=\"https://archive.org/details/anthology_american_folk_music\">from archive.org</a>.\n\nI have used *many* books for this episode, most of which I will also be using for future episodes on Dylan:\n\n<a href=\"https://amzn.to/3bMlkDu\">The Mayor of MacDougal Street by Dave Van Ronk and Elijah Wald</a> is the fascinating and funny autobiography of Dylan's mentor in his Greenwich Village period.\n\n<a href=\"https://amzn.to/3haPEJi\">Escaping the Delta by Elijah Wald</a> is the definitive book on Robert Johnson.\n\nInformation on Woody Guthrie comes from <a href=\"https://amzn.to/2R98t4W\">Ramblin' Man: The Life and Times of Woody Guthrie </a>by Ed Cray.\n\n<a href=\"https://amzn.to/3bHUnRs\">Chronicles Volume 1 by Bob Dylan</a> is a partial, highly inaccurate, but thoroughly readable autobiography.\n\n<a href=\"https://amzn.to/2ZovBkl\">Bob Dylan: All The Songs by Phillipe Margotin and Jean-Michel Guesdon</a> is a song-by-song look at every song Dylan ever wrote, as is <a href=\"https://amzn.to/3k7ct2a\">Revolution in the Air,</a> by Clinton Heylin.\n\nHeylin also wrote the most comprehensive and accurate biography of Dylan, <a href=\"https://amzn.to/35tC1mp\">Behind the Shades</a>.\n\nI've also used <a href=\"https://amzn.to/35iNB3A\">Robert Shelton's No Direction Home</a>, which is less accurate, but which is written by someone who knew Dylan.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\n1962 is the year when the sixties really started, and in the next few episodes we will see the first proper appearances of several of the musicians who would go on to make the decade what it was. By two weeks from now, when we get to episode one hundred and the end of the second year of the podcast, the stage will be set for us to look at that most mythologised of decades.\n\nAnd so today, we're going to take our first look at one of the most important of the sixties musicians, the only songwriter ever to win the Nobel Prize for Literature, a man who influenced every single performer and songwriter for at least the next decade, and whose work inspired a whole subgenre, albeit one he had little but contempt for. We're going to look at his first album, and at a song he wrote to his greatest influence. And we're also going to look at how his career intersected with someone we talked about way back in the very first episode of this podcast.\n\nToday we're going to look at Bob Dylan, and at \"Song to Woody\":\n\n[Excerpt: Bob Dylan, \"Song to Woody\"]\n\nThis episode is going to be a little different from several of the other episodes we've had recently. At the time he made his first album, Dylan was not the accomplished artist he quickly became, but a minor performer whose first record only contained two original songs. But he was from a tradition that we've looked at only in passing before. We've barely looked at the American folk music tradition, and largely ignored the musicians who were major figures in it, because those figures only really enter into rock and roll in a real way starting with Dylan. So as part of this episode, we're going to have very brief, capsule, looks at a number of other musicians we've not touched on before. I'll only be giving enough background for these people so you can get a flavour of them -- in future episodes when we look at the folk and folk-rock scenes, we'll also fill in some more of the background of these artists. That also means this episode is going to run a little long, just because there's a lot to get through.\n\nBob Dylan was born Robert Zimmerman in the Minnesota Iron Range, an area of the US that was just beginning a slow descent into poverty, as the country suddenly needed a lot less metal after the end of World War II. He was born in Duluth, but moved to Hibbing, a much smaller town, when he was very young.\n\nAs a kid, he was fascinated with music that sounded a little odd. He was first captivated by Johnnie Ray -- and incidentally, Clinton Heylin, in his biography of Dylan, thinks that this must be wrong, and \"Dylan has surely mixed up his names\" and must be thinking of Johnny Ace, because \"Ray’s main period of chart success\" was 1956-58. Heylin's books are usually very, very well researched, but here he's showing his parochialism. Johnnie Ray's biggest *UK* hits were in 1956-8, but in the US his biggest hits came in 1951, and he had a string of hits in the very early fifties.\n\nRay's hits, like \"Cry\", were produced by Mitch Miller, and were on Columbia records:\n\n[Excerpt: Johnnie Ray, \"Cry\"]\n\nShortly after his infatuation with Ray's music, he fell for the music of Hank Williams in a big way, and became obsessed with Williams' songwriting:\n\n[Excerpt: Hank Williams, \"I'm So Lonesome I Could Cry\"]\n\nHe also became a fan of another Hank, Hank Snow, the country singer who had been managed by Colonel Tom Parker, and through Snow he became aware of the songs of Jimmie Rodgers, who Snow frequently covered, and who Snow admired enough that Snow's son was named Jimmie Rodgers Snow.\n\nBut he soon also became a big fan of rhythm and blues and rock and roll. He taught himself to play rudimentary piano in a Little Richard style, and his ambition, as quoted in his high school yearbook, was to join Little Richard's band. He was enough of a fan of rock and roll music that he went to see Buddy Holly, Ritchie Valens and the Big Bopper on the penultimate date of their ill-fated tour. He later claimed to have seen a halo over Holly's head during the performance.\n\nHis first brush with fame came indirectly as a result of that tour. A singer from Fargo, North Dakota, named Bobby Vee, was drafted in to cover for Holly at the show that Holly had been travelling to when he died. Vee sounded a little like Holly, if you didn't listen too closely, and he had a minor local hit with a song called \"Suzy Baby\":\n\n[Excerpt: Bobby Vee, \"Suzy Baby\"]\n\nDylan joined Vee's band for a short while under the stage name Elston Gunn, playing the piano, though he was apparently not very good (he could only play in C, according to some sources I've read), and he didn't stay in Vee's band very long. But while he was in Vee's band, he would tell friends and relatives that he *was* Bobby Vee, and at least some people believed him.\n\nVee would go on to have a career as one of the wave of Bobbies that swarmed all over American Bandstand in the late fifties and early sixties, with records like \"Rubber Ball\":\n\n[Excerpt: Bobby Vee, \"Rubber Ball\"]\n\nWhile Dylan made his name with a very different kind of music, he would always argue that Vee deserved rather more respect than he usually got, and that there was some merit to his music.\n\nBut it wasn't until he went to university in Minneapolis that Robert Zimmerman became Bob Dylan, and changed everything about his life. As many people do when they go to university, he reinvented himself -- he took on a new name, which has variously been quoted as having been inspired by Marshall Dillon from the TV series Gunsmoke and by the Welsh poet Dylan Thomas. He stopped studying, and devoted his time to music and chasing women. And he also took on a new musical style.\n\nThe way he tells it, he had an epiphany in a record shop listening booth, listening to an album by the folk singer Odetta. Odetta was an astonishing singer who combined elements of folk, country, and blues with an opera-trained voice, and Dylan was probably listening to her first album, which was largely traditional folk songs, plus one song each by Lead Belly and Jimmie Rodgers:\n\n[Excerpt: Odetta, \"Muleskinner Blues\"]\n\nDylan had soon sold his electric guitar and bought an acoustic, and he immediately learned all of Odetta's repertoire and started performing her songs, and Lead Belly's, with a friend, \"Spider\" John Koerner, who would later become a fairly well-known folk blues musician in his own right:\n\n[Excerpt: Ray, Koerner, and Glover, \"Hangman\"]\n\nAnd then, at a coffee-shop, he got talking with a friend of his, Flo Castner, and she invited him to come round to her brother's apartment, which was nearby, because she thought he might be interested in some of the music her brother had.\n\nDylan discovered two albums at Lyn Castner's house that day that would change his life. The first, and the less important to him in the short term, is one we've talked about before -- he heard the Spirituals to Swing album, the record of the 1938 Carnegie Hall concerts that we talked about back in the first few episodes of the podcast:\n\n[Excerpt: Big Joe Turner & Pete Johnson, \"It's Alright, Baby\"]\n\nThat album impressed him, but it was the other record he heard that day that changed everything for him immediately. It was a collection of recordings by Woody Guthrie.\n\nGuthrie is someone we've only mentioned in passing so far, but he was pivotal in the development of American folk music in the 1940s, and in particular he was important in the politicisation of that music.\n\nIn the 1930s, there wasn't really a distinction made between country music and folk -- that distinction is one that only really came later -- and Guthrie had started out as a country singer, singing songs inspired by the Carter Family, Jimmie Rodgers, and other 1920s greats. For most of his early twenties he'd bummed around Oklahoma and Texas doing odd jobs as a sign painter, psychic, faith healer, and whatever else he could pick up a little money for. But then in 1936 he'd travelled out to California in search of work. When there, he'd hooked up with a cousin, Jack Guthrie, who was a Western singer, performing the kind of Western Swing that would later become rockabilly. We don't have any recordings of Jack from this early, but when you listen to him in the forties, you can hear the kind of hard-edged California Western Swing that would influence most of the white artists we looked at in the first year or so of the podcast:\n\n[Excerpt: Jack Guthrie, \"Oakie Boogie\"]\n\nWoody and Jack weren't musically compatible -- this was when country and western were seen as very, very different genres, rather than being lumped into one -- but they worked together for a while. Jack was the lead singer and guitarist, and Woody was his comedy sidekick, backing vocalist, and harmonica player. They performed with a group called the Beverly Hillbillies and got their own radio show, The Oakie and Woody Show, but it wasn't successful, and Jack decided to give up the show. Woody continued with a friend, Maxine Crissman, who performed as \"Lefty Lou From Old Mizzou\". The Woody and Lefty act became hugely popular, but Lefty eventually also quit, due to her health failing, and while at the time she seems to have been regarded as the major talent in the duo, her leaving the act was indirectly the best thing that ever happened to Guthrie.\n\nThe radio station they were performing on was owned by a fairly left-wing businessman who had connections with the radical left faction of the Democratic Party (and in California in the thirties that could be quite radical, somewhere close to today's Democratic Socialists of America), and when Lefty quit the act, the owner of the station gave Guthrie another job -- the owner also ran a left-wing newspaper, and since Guthrie was from Oklahoma, maybe he would be interested in writing some columns about the plight of the Okie migrants?\n\nGuthrie went and spent time with those people, and his shock at the poverty they were living in and the discrimination they were suffering seems to have radicalised him. He started hanging round with members of the Communist Party, though he apparently never joined -- he wasn't all that interested in Marxist theory or the party line, he just wanted to take the side of the victims against the bullies, and he saw the Communists as doing that. He was, though, enough of a fellow traveller that when World War II started he took the initial Communist line of it being a capitalist's fight that socialists should have no part of (a line which was held until Russia joined the war, at which point it became a crusade against the evils of fascism). His employer was a more resolute anti-fascist, and so Guthrie lost his newspaper job, and he decided to move across the country to New York, where he hooked up with a group of left-wing intellectuals and folk singers, centring on Alan Lomax, Pete Seeger, and Lead Belly.\n\nIt was this environment, centred in Almanac House in Greenwich Village, that spawned the Almanac Singers and later the Weavers, who we talked about a few episodes back. And Guthrie had been the most important of all of them.\n\nGuthrie was a folk performer -- a big chunk of his repertoire was old songs like \"Ida Red\", \"Stackolee\", and \"Who's Going to Shoe Your Pretty Little Feet?\" – but he also wrote songs himself, taking the forms of old folk and country songs, and reworking the lyrics -- and sometimes, but not always, the music -- creating songs that dealt with events that were happening at the time. There were songs about famous outlaws, recast as Robin Hood type figures:\n\n[Excerpt: Woody Guthrie, \"Pretty Boy Floyd\"]\n\nThere were talking blues with comedy lyrics:\n\n[Excerpt: Woody Guthrie, \"Talking Fishing Blues\"]\n\nThere were the famous Dust Bowl Ballads, about the dust storms that had caused so much destruction and hardship in the west:\n\n[Excerpt: Woody Guthrie, \"The Great Dust Storm\"]\n\nAnd of course, there was \"This Land is Your Land\", a radical song about how private property is immoral and unnatural, which has been taken up as an anthem by people who would despise everything that Guthrie stood for:\n\n[Excerpt: Woody Guthrie, \"This Land is Your Land\"]\n\nIt's not certain which records by Guthrie Dylan heard that day -- he talks about it in his autobiography, but the songs he talks about weren't ones that were on the same album, and he seems to just be naming a handful of Guthrie's songs. What is certain is that Dylan reacted to this music in a visceral way. He decided that he had to *become* Woody Guthrie, and took on Guthrie's playing and singing style, even his accent.\n\nHowever, he soon modulated that slightly, when a friend told him that he might as well give up -- Ramblin' Jack Elliot was already doing the Guthrie-imitation thing. Elliot, like Dylan, was a middle-class Jewish man who had reinvented himself as a Woody Guthrie copy -- in this case, Elliot Adnopoz, the son of a surgeon, had become Ramblin' Jack the singing cowboy, and had been an apprentice of Guthrie, living with him and learning everything from him, before going over to Britain, where his status as an actual authentic American had meant he was one of the major figures in the British folk scene and the related skiffle scene. Alan Lomax, who had moved to the UK temporarily to escape the anti-Communist witch hunts, had got Elliot a contract with Topic Records, a folk label that had started out as part of the Workers' Music Association, which as you can probably tell from the name was affiliated with the Communist Party of Great Britain. There he'd recorded an album of Guthrie songs, which Dylan's acquaintance played for him:\n\n[Excerpt: Ramblin' Jack Elliot, \"1913 Massacre\"]\n\nDylan was shocked that there was someone out there doing the same thing, but then he just took on aspects of Elliot's persona as well as Guthrie's. He was going to be the next Woody Guthrie, and that meant inhabiting his persona utterly, and giving his whole repertoire over to Guthrie songs.\n\nHe was also, though, making tentative efforts at writing his own songs, too. One which we only have as a lyric was written to a girlfriend, and was set to the same tune we just heard -- Guthrie's \"1913 Massacre\". The lyrics were things like \"Hey, hey Bonny, I’m singing to you now/The song I’m singing is the best I know how\"\n\nIncidentally, the woman that was written for is yet another person in the story who now has a different name -- she became a moderately successful actor, appearing in episodes of Star Trek and Gunsmoke, and changed her name to Jahanara Romney shortly after her marriage to the hippie peace activist Wavy Gravy (which isn't Mr. Gravy's birth name either). Their son, whose birth name was Howdy Do-Good Gravy Tomahawk Truckstop Romney, also changed his name later on, you'll be unsurprised to hear.\n\nDylan by this point was feeling as constrained by the twin cities of Minneapolis and St. Paul as he had earlier by the small town Hibbing. In January 1961, he decided he was going to go to New York, and while he was there he was going to go and meet Woody Guthrie in person.\n\nGuthrie was, by this time, severely ill -- he had Huntington's disease, a truly awful genetic disorder that had also killed his mother. Huntington's causes dementia, spasmodic movements, a loss of control of the body, and a ton of other mental and physical symptoms. Guthrie had been in a psychiatric hospital since 1956, and was only let out every Sunday to see family at a friend's house.\n\nBob Dylan quickly became friendly with Guthrie, visiting him regularly in the hospital to play Guthrie's own songs for him, and occasionally joining him on the family visits on Sundays. He only spent a few months doing this -- Dylan has always been someone who moved on quickly, and Guthrie also moved towards the end of 1961, to a new hospital closer to his family, but these visits had a profound effect on the young man.\n\nWhen not visiting Guthrie, Dylan was spending his time in Greenwich Village, the Bohemian centre of New York. The Village at that time was a hotbed of artists and radicals, with people like the poet Allen Ginsberg, the street musician Moondog, and Tiny Tim, a ukulele player who sang Rudy Vallee songs in falsetto, all part of the scene. It was also the centre of what was becoming the second great folk revival.\n\nThat revival had been started in 1952, when the most important bootleg ever was released, Harry Smith's Anthology of American Folk Music:\n\n[Excerpt: Blind Lemon Jefferson, \"See That My Grave Is Kept Clean\"]\n\nHarry Smith was a record collector, experimental filmmaker, and follower of the occultist Aleister Crowley. His greatest work seems at least in part to have been created as a magickal work, with album covers designed by himself full of esoteric symbolism. Smith had a huge collection of old 78 records -- all of them things that had been issued commercially in the late 1920s and early thirties, when the record industry had been in a temporary boom before the depression. Many of these records had been very popular in the twenties, but by 1952 even the most popular acts, like Blind Lemon Jefferson or the Carter Family, were largely forgotten.\n\nSo Smith and Moe Asch, the owner of Folkways Records, took advantage of the new medium, the long-playing album, and put together a six-album set of these recordings, not bothering with trivialities like copyright even though, again, most of these had been recorded for major labels only twenty or so years earlier -- but at this time there was not really such a thing as a market for back catalogue, and none of the record labels involved seem to have protested.\n\nSmith's collection was an idiosyncratic one, based around his own tastes. It ran the gamut from hard blues:\n\n[Excerpt: Joe Williams' Washboard Blues Singers, \"Baby Please Don't Go\"]\n\nTo the Carter Family's country recordings of old ballads that date back centuries:\n\n[Excerpt: The Carter Family, \"Black Jack Davey\"]\n\nTo gospel:\n\n[Excerpt: Sister Clara Hudmon, \"Stand By Me\"]\n\nBut put together in one place, these records suggested the existence of a uniquely American roots music tradition, one that encompassed all these genres, and Smith's Anthology became the favourite music of the same type of people who in the UK around the same time were becoming skifflers -- many of them radical leftists who had been part of the US equivalent of the trad jazz movement (who were known as “mouldy figs”) and were attracted by the idea of an authentic music of the working man. The Harry Smith Anthology became the core repertoire for every American folk musician of the fifties, the seed around which the whole movement crystallised. Every folkie knew every single song on those records.\n\nThose folkies had started playing at coffee shops in Greenwich Village, places that were known as basket houses, because they didn't charge for entry or pay the artists, but the performers could pass a basket and split whatever the audience decided to donate.\n\nOriginally, the folk musicians were not especially popular, and in fact they were booked for that reason. The main entertainment for those coffee shops was poetry, and the audience for poetry would mostly buy a single coffee and make it last all night. The folkies were booked to come on between the poets and play a few songs to make the audience clear out to make room for a new audience to come and buy new coffees. However, some of the people got good enough that they actually started to get their own audiences, and within a short time the roles were reversed, with the poets coming on to clear out the folk audience.\n\nDylan's first gigs were on this circuit, playing on bills put together by Fred Neil, a musician who was at this point mostly playing blues songs but who within a few years would write some of the great classics of the sixties singer-songwriter genre:\n\n[Excerpt: Fred Neil, \"Everybody's Talkin'\"]\n\nBy the time Dylan hit the scene, there were quite a few very good musicians in the Village, and the folk scene had grown to the point that there were multiple factions. There were the Stalinists, who had coalesced around Pete Seeger, the elder statesman of the scene, and who played a mixture of summer-camp singalong music and topical songs about news events. There were the Zionists, who were singing things like \"Hava Nagilah\". There were bluegrass players, and there were the two groups that most attracted Dylan -- those who sang old folk ballads, and those who sang the blues.\n\nThose latter two groups tended to cluster together, because they were smaller than the other groups, and also because of their own political views -- while all of the scene were leftists, the blues and ballad singers tended either to be vaguely apolitical, or to be anarchists and Trotskyites rather than Stalinists. But they had a deeper philosophical disagreement with the Stalinists -- Seeger's camp thought that the quality of a song was secondary to the social good it could do, while the blues and ballad singers held that the important thing was the music, and any political or social good was a nice byproduct.\n\nThere was a huge amount of infighting between these small groups -- the narcissism of small differences -- but there was one place they would all hang out. The Folklore Centre was a record and bookshop owned by a man named Izzy Young, and it was where you would go to buy every new book, to buy and sell copies of the zines that were published, and to hang out and find out who the new musicians on the scene were.\n\nAnd it was at the Folklore Centre that Dylan met Dave Van Ronk:\n\n[Excerpt: Dave Van Ronk, \"Cocaine Blues\"]\n\nVan Ronk was the most important musician in the blues and ballads group of folkies, and was politically an anarchist who, through his connection with the Schachtmanites (a fringe-left group who were more Trotskyite than the Trotskyites, and whose views sometimes shaded into anarchism) was becoming converted to Marxism. A physically massive man, he'd started out as a traditional jazz guitarist and banjo player, but had slowly moved on into the folk side of things through his love of blues singers like Bessie Smith and folk-blues artists like Lead Belly. Van Ronk had learned a great deal from Rev. Gary Davis, a blind gospel-blues singer whose technique Van Ronk had studied:\n\n[Excerpt: Rev. Gary Davis, \"Death Don't Have No Mercy\"]\n\nVan Ronk was one of the few people on the Village scene who was a native New Yorker, though he was from Queens rather than the Village, and he was someone who had already made a few records that Dylan had heard, mostly of the standard repertoire:\n\n[Excerpt: Dave Van Ronk, \"See That My Grave is Kept Clean\"]\n\nDylan consciously sought him out as the person to imitate on the scene, and he was soon regularly sleeping on Van Ronk's couch and being managed for a brief time by Van Ronk's wife. Once again, Dylan was learning everything he could from the people he was around -- but he had a much bigger ambition than anyone else on the scene.\n\nA lot of the people on that scene have been very bitter over the years about Dylan, but Van Ronk, who did more for Dylan than anyone else on the scene, never really was -- the two stopped being close once he was no more use to Dylan, as so often happened, but they remained friendly, because Van Ronk was secure enough in himself and his own abilities that he didn't need the validation of being important to the big star. Van Ronk was an important mentor to him for a crucial period of six months or so, and Dylan always acknowledged that, just as Van Ronk always acknowledged Dylan's talent.\n\nAnd that talent, at least at first, was a performing talent rather than a songwriting one. Dylan was writing songs by now, but hardly any, and when he did perform them, he was not acknowledging them. His first truly successful song, a song about nuclear war, \"Let Me Die in my Footsteps\", he would introduce as a Weavers song:\n\n[Excerpt: Bob Dylan, \"Let Me Die in my Footsteps\"]\n\nFor the most part, his repertoire was still only Woody Guthrie songs, but people were amazed by his personal charisma, his humour -- one comparison you see time and again when people talk about his early performances is Charlie Chaplin -- and his singing. There are so many jokes about Dylan's vocals that this sounds like a joke, but among the folk crowd, his phrasing in particular -- as influenced by the R&B records he grew up listening to as by Guthrie -- was considered utterly astonishing.\n\nDylan started publishing some of his song lyrics in Broadside, a magazine for new topical songs, and in other magazines like Sing Out! These were associated with the Communist side of the folk movement, and Dylan had a foot in both camps through his association with Guthrie and Guthrie's friends. Through these people he got to know Suze Rotolo, a volunteer with the Congress of Racial Equality, who became his girlfriend, and her sister Carla, who was the assistant to Alan Lomax, who was now back from the UK, and the Rotolos played a part in Dylan's big breakthrough.\n\nThe timeline that follows is a bit confused, but Carla Rotolo recorded some of the best Village folk singers, and wrote to John Hammond about the tape, mentioning Dylan in particular. At the same time, Hammond's son John Hammond Jr, another musician on the circuit and a friend of Dylan's, apparently mentioned Dylan to his father. Dylan was also working on Robert Shelton, the folk critic of the New York Times, who eventually gave Dylan a massive rave review for a support slot he'd played at Gerde's Folk City. And the same day that review came out, eight days after Carla Rotolo's letter, Dylan was in the recording studio with the folk singer Carolyn Hester, playing harmonica on a few of her tracks, and Hammond was the producer:\n\n[Excerpt: Carolyn Hester, \"I'll Fly Away\"]\n\nHammond had, of course, organised the Spirituals to Swing concerts which had influenced Dylan. And not only that, he'd been the person to discover Billie Holiday, and Count Basie. And Charlie Christian. He was now working for Columbia Records, where he'd just produced the first secular records for a promising new gospel singer who had decided to turn pop, named Aretha Franklin:\n\n[Excerpt: Aretha Franklin, \"Today I Sing the Blues\"]\n\nSo Hammond was an important figure in many ways, and he had a lot of latitude at Columbia Records. He decided to sign Dylan, and even though Mitch Miller, Columbia's head of A&R at the time, had no clue what Hammond saw in Dylan, Hammond's track record was good enough that he was allowed to get on with it and put out an album.\n\nHammond also gave Dylan an album to take home and listen to, a record which hadn't come out yet, a reissue of some old blues records called \"King of the Delta Blues Singers\" by Robert Johnson:\n\n[Excerpt: Robert Johnson, \"Crossroads Blues\"]\n\nThere has been a hell of a lot of mythology about Johnson over the years, so much so that it's almost impossible to give anyone who's heard of him at all an accurate impression of Johnson's place in music history. One question I have been asked repeatedly since I started this podcast is \"How come you didn't start with Robert Johnson?\", and if you don't know about him, you'll get an idea of his general perception among music fans from the fact that I recently watched an episode of a science fiction TV series where our heroes had to go back in time to stop the villains from preventing Johnson from making his recordings, because by doing that they could stop rock and roll from ever existing.\n\nThere's a popular perception that Johnson was the most important blues musician of his generation, and that he was hugely influential on the development of blues and R&B, and it's simply false.\n\nHe *was* a truly great musician, and he *was* hugely influential -- but he was influential on white musicians in the sixties, not black musicians in the thirties, forties, and fifties. In his lifetime, his best selling records sold around five thousand copies, which to put it in perspective is about the same number of people who've listened to some of my more popular podcast episodes. Johnson's biographer Elijah Wald -- a man who, like I do, has a huge respect for Johnson's musicianship, has said \"knowing about Johnson and Muddy Waters but not about Leroy Carr or Dinah Washington [is] like knowing about, say, the Sir Douglas Quintet but not knowing about the Beatles.\" I'd agree, except that the Sir Douglas Quintet were much, much, bigger in the sixties than Robert Johnson was in the thirties.\n\nJohnson's reputation comes entirely from that album that Hammond had handed Dylan. Hammond had been one of the tiny number of people who had actually listened to Johnson at the time he was performing. Indeed, Hammond had wanted to get Johnson to perform at the Spirituals to Swing concerts, only to find that Johnson had died only a short time earlier -- they'd got Big Bill Broonzy to play in his place, and played a couple of Johnson's records from the stage. That had, in fact, kickstarted Broonzy's later second career as a folk-blues musician playing for largely white audiences, rather than as a proto-Chicago-blues performer playing for Black ones.\n\nHammond's friend Alan Lomax had also been a fan of Johnson -- he'd gone to Mississippi later, to try to record Johnson, also without having realised that Johnson had died. But far from Johnson being the single most important blues musician of the thirties, as he is now portrayed in popular culture, if you'd asked most blues musicians or listeners about Robert Johnson in the twenty-three years between his death and the King of the Delta Blues Singers album coming out, most of them would have looked at you blankly, or maybe asked if you meant Lonnie Johnson, the much more famous musician who was a big inspiration for Robert.\n\nWhen King of the Delta Blues Singers came out, it changed all that, and made Robert Johnson into a totemic figure among white blues fans, and we'll see over the next year or two a large number of very important musicians who took inspiration from him -- and deservedly so. While the myth of Robert Johnson has almost no connection to the real man, his music demonstrated a remarkable musical mind -- he was a versatile, skilled guitarist and arranger, and someone whose musical palette was far wider than his recorded legacy suggests -- Ramblin' Johnny Shines, who travelled with Johnson for a time, describes him as particularly enjoying playing songs like \"Yes, Sir, That's My Baby\" and Jimmie Rodgers songs, and polkas, calling Johnson \"a polka hound, man\". And even though in his handful of recording sessions he was asked only to play blues, you can still hear elements of that:\n\n[Excerpt: Robert Johnson, \"They're Red Hot\"]\n\nBut the music wasn't the main thing that grabbed Dylan. Dylan played the album for Dave Van Ronk, who was unimpressed -- musically, Johnson just didn't seem very original to Van Ronk, who played Dylan records by Skip James, Leroy Carr, and others, showing Dylan where Johnson had picked up most of his musical ideas. And Dylan had to agree with him that Johnson didn't sound particularly original in that context -- but he also didn't care, reasoning that many of the Woody Guthrie songs he loved were rewrites of old Carter Family songs, so if Johnson was rewriting Leroy Carr songs that was fair enough.\n\nWhat got to Dylan was Johnson's performance style, but also his ability with words. Johnson had a very sparse, economical, lyrical style which connected with Dylan on a primordial level. Most of those who became fans of Johnson following the release of King of the Delta Blues Singers saw Johnson as an exotic and scary figure -- the myth commonly told about him is that he sold his soul at a crossroads to the Devil in return for the ability to play the guitar, though that's a myth that was originally told about a different Mississippi blues man called Tommy Johnson, and there's no evidence that anyone thought that of him at the time -- and so these later fans see his music as being haunted. Dylan instead seems to see Johnson as someone very like himself -- in his autobiography, Chronicles, Dylan talks about Johnson being a bothersome kid who played harmonica, who was later taught a bit of guitar and then learned the rest of his music from records, rather than from live performers. Dylan's version of Johnson is closer to the reality, as far as we know it, than the Johnson of legend is, and Dylan seems to have been delighted when he found out much later that the name of the musician who taught Johnson to play guitar was Ike Zimmerman.\n\nDylan immediately tried to incorporate Johnson's style into his own songwriting, and we'll see the effects of that in future episodes. But that songwriting wouldn't be seen much on his debut album. And nor would his Woody Guthrie repertoire. Instead, Dylan performed a set of traditional ballads and blues numbers, most of which he never performed live normally, and at least half of which were arrangements that Dylan copied wholesale from Dave Van Ronk.\n\n[Excerpt: Bob Dylan, “See That My Grave is Kept Clean”]\n\nThe album was recorded quickly, in a couple of days. Hammond found Dylan incredibly difficult to work with, saying he had appalling mic technique, and for many of the songs Dylan refused to do a second take.\n\nThere were only two originals on the album. One, \"Talkin' New York\", was a comedy talking blues about his early time in New York, very much in the style of Woody Guthrie's talking blues songs. The other, \"Song To Woody\", was a rewrite of his earlier \"Song For Bonny\", which was itself a rewrite of Guthrie's \"1913 Massacre\". The song is a touching one, Dylan paying tribute to his single biggest influence:\n\n[Excerpt: Bob Dylan, \"Song to Woody\"]\n\nDylan was moving on, and he knew he was moving on, but he had to say goodbye.\n\nDylan's first album was not a success, and he became known within Columbia Records as \"Hammond's Folly\", but nor did it lose money, since it was recorded so quickly. It's a record that Dylan and Hammond both later spoke poorly of, but it's one I rather like, and one of the best things to come out of the Greenwich Village folk scene.\n\nBut by the time it came out, Dylan's artistic heart was already elsewhere, and when we come back to him in a couple of months, we'll be seeing someone who had completely reinvented himself.",
  "itunes:subtitle": "Episode ninety-seven of A History of Rock Music in Five Hundred Songs looks at Song To Woody by Bob Dylan, and at the Greenwich Village folk scene of the early sixties. Click the full post to read liner notes, links to more information, and a transcript ",
  "itunes:keywords": "Alan Lomax,Aretha Franklin,Big Bill Broonzy,Bob Dylan,Bobby Vee,Carnegie Hall,Columbia Records,Communist Party,Dave van Ronk,folk music,Fred Neil,gospel,John Hammond,Johnnie Ray,Lead Belly,Mitch Miller,Pete Seeger,Robert Johnson,skiffle,Suze Rotolo,the blues,Woody Guthrie",
  "itunes:episodeType": "full",
  "itunes:episode": 97,
  "content:encoded": "Episode ninety-seven of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Song To Woody\" by Bob Dylan, and at the Greenwich Village folk scene of the early sixties. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"<a href=\"https://www.patreon.com/posts/41450820\">Sherry\" by the Four Seasons.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-97-song-to-woody/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode. This might not be available in the US, due to the number of Woody Guthrie songs in a row.\n\nDylan's first album is in the public domain in Europe, so a variety of reissues of it exist. An interesting and cheap one is <a href=\"https://amzn.to/32dQTDb\">this</a>, which pairs it (and a non-album single by Dylan) with two Carolyn Hester albums which give a snapshot of the Greenwich Village scene, on one of which Dylan plays harmonica.\n\nThe Harry Smith Anthology is also now public domain, and can be freely downloaded <a href=\"https://archive.org/details/anthology_american_folk_music\">from archive.org</a>.\n\nI have used *many* books for this episode, most of which I will also be using for future episodes on Dylan:\n\n<a href=\"https://amzn.to/3bMlkDu\">The Mayor of MacDougal Street by Dave Van Ronk and Elijah Wald</a> is the fascinating and funny autobiography of Dylan's mentor in his Greenwich Village period.\n\n<a href=\"https://amzn.to/3haPEJi\">Escaping the Delta by Elijah Wald</a> is the definitive book on Robert Johnson.\n\nInformation on Woody Guthrie comes from <a href=\"https://amzn.to/2R98t4W\">Ramblin' Man: The Life and Times of Woody Guthrie </a>by Ed Cray.\n\n<a href=\"https://amzn.to/3bHUnRs\">Chronicles Volume 1 by Bob Dylan</a> is a partial, highly inaccurate, but thoroughly readable autobiography.\n\n<a href=\"https://amzn.to/2ZovBkl\">Bob Dylan: All The Songs by Phillipe Margotin and Jean-Michel Guesdon</a> is a song-by-song look at every song Dylan ever wrote, as is <a href=\"https://amzn.to/3k7ct2a\">Revolution in the Air,</a> by Clinton Heylin.\n\nHeylin also wrote the most comprehensive and accurate biography of Dylan, <a href=\"https://amzn.to/35tC1mp\">Behind the Shades</a>.\n\nI've also used <a href=\"https://amzn.to/35iNB3A\">Robert Shelton's No Direction Home</a>, which is less accurate, but which is written by someone who knew Dylan.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\n1962 is the year when the sixties really started, and in the next few episodes we will see the first proper appearances of several of the musicians who would go on to make the decade what it was. By two weeks from now, when we get to episode one hundred and the end of the second year of the podcast, the stage will be set for us to look at that most mythologised of decades.\n\nAnd so today, we're going to take our first look at one of the most important of the sixties musicians, the only songwriter ever to win the Nobel Prize for Literature, a man who influenced every single performer and songwriter for at least the next decade, and whose work inspired a whole subgenre, albeit one he had little but contempt for. We're going to look at his first album, and at a song he wrote to his greatest influence. And we're also going to look at how his career intersected with someone we talked about way back in the very first episode of this podcast.\n\nToday we're going to look at Bob Dylan, and at \"Song to Woody\":\n\n[Excerpt: Bob Dylan, \"Song to Woody\"]\n\nThis episode is going to be a little different from several of the other episodes we've had recently. At the time he made his first album, Dylan was not the accomplished artist he quickly became, but a minor performer whose first record only contained two original songs. But he was from a tradition that we've looked at only in passing before. We've barely looked at the American folk music tradition, and largely ignored the musicians who were major figures in it, because those figures only really enter into rock and roll in a real way starting with Dylan. So as part of this episode, we're going to have very brief, capsule, looks at a number of other musicians we've not touched on before. I'll only be giving enough background for these people so you can get a flavour of them -- in future episodes when we look at the folk and folk-rock scenes, we'll also fill in some more of the background of these artists. That also means this episode is going to run a little long, just because there's a lot to get through.\n\nBob Dylan was born Robert Zimmerman in the Minnesota Iron Range, an area of the US that was just beginning a slow descent into poverty, as the country suddenly needed a lot less metal after the end of World War II. He was born in Duluth, but moved to Hibbing, a much smaller town, when he was very young.\n\nAs a kid, he was fascinated with music that sounded a little odd. He was first captivated by Johnnie Ray -- and incidentally, Clinton Heylin, in his biography of Dylan, thinks that this must be wrong, and \"Dylan has surely mixed up his names\" and must be thinking of Johnny Ace, because \"Ray’s main period of chart success\" was 1956-58. Heylin's books are usually very, very well researched, but here he's showing his parochialism. Johnnie Ray's biggest *UK* hits were in 1956-8, but in the US his biggest hits came in 1951, and he had a string of hits in the very early fifties.\n\nRay's hits, like \"Cry\", were produced by Mitch Miller, and were on Columbia records:\n\n[Excerpt: Johnnie Ray, \"Cry\"]\n\nShortly after his infatuation with Ray's music, he fell for the music of Hank Williams in a big way, and became obsessed with Williams' songwriting:\n\n[Excerpt: Hank Williams, \"I'm So Lonesome I Could Cry\"]\n\nHe also became a fan of another Hank, Hank Snow, the country singer who had been managed by Colonel Tom Parker, and through Snow he became aware of the songs of Jimmie Rodgers, who Snow frequently covered, and who Snow admired enough that Snow's son was named Jimmie Rodgers Snow.\n\nBut he soon also became a big fan of rhythm and blues and rock and roll. He taught himself to play rudimentary piano in a Little Richard style, and his ambition, as quoted in his high school yearbook, was to join Little Richard's band. He was enough of a fan of rock and roll music that he went to see Buddy Holly, Ritchie Valens and the Big Bopper on the penultimate date of their ill-fated tour. He later claimed to have seen a halo over Holly's head during the performance.\n\nHis first brush with fame came indirectly as a result of that tour. A singer from Fargo, North Dakota, named Bobby Vee, was drafted in to cover for Holly at the show that Holly had been travelling to when he died. Vee sounded a little like Holly, if you didn't listen too closely, and he had a minor local hit with a song called \"Suzy Baby\":\n\n[Excerpt: Bobby Vee, \"Suzy Baby\"]\n\nDylan joined Vee's band for a short while under the stage name Elston Gunn, playing the piano, though he was apparently not very good (he could only play in C, according to some sources I've read), and he didn't stay in Vee's band very long. But while he was in Vee's band, he would tell friends and relatives that he *was* Bobby Vee, and at least some people believed him.\n\nVee would go on to have a career as one of the wave of Bobbies that swarmed all over American Bandstand in the late fifties and early sixties, with records like \"Rubber Ball\":\n\n[Excerpt: Bobby Vee, \"Rubber Ball\"]\n\nWhile Dylan made his name with a very different kind of music, he would always argue that Vee deserved rather more respect than he usually got, and that there was some merit to his music.\n\nBut it wasn't until he went to university in Minneapolis that Robert Zimmerman became Bob Dylan, and changed everything about his life. As many people do when they go to university, he reinvented himself -- he took on a new name, which has variously been quoted as having been inspired by Marshall Dillon from the TV series Gunsmoke and by the Welsh poet Dylan Thomas. He stopped studying, and devoted his time to music and chasing women. And he also took on a new musical style.\n\nThe way he tells it, he had an epiphany in a record shop listening booth, listening to an album by the folk singer Odetta. Odetta was an astonishing singer who combined elements of folk, country, and blues with an opera-trained voice, and Dylan was probably listening to her first album, which was largely traditional folk songs, plus one song each by Lead Belly and Jimmie Rodgers:\n\n[Excerpt: Odetta, \"Muleskinner Blues\"]\n\nDylan had soon sold his electric guitar and bought an acoustic, and he immediately learned all of Odetta's repertoire and started performing her songs, and Lead Belly's, with a friend, \"Spider\" John Koerner, who would later become a fairly well-known folk blues musician in his own right:\n\n[Excerpt: Ray, Koerner, and Glover, \"Hangman\"]\n\nAnd then, at a coffee-shop, he got talking with a friend of his, Flo Castner, and she invited him to come round to her brother's apartment, which was nearby, because she thought he might be interested in some of the music her brother had.\n\nDylan discovered two albums at Lyn Castner's house that day that would change his life. The first, and the less important to him in the short term, is one we've talked about before -- he heard the Spirituals to Swing album, the record of the 1938 Carnegie Hall concerts that we talked about back in the first few episodes of the podcast:\n\n[Excerpt: Big Joe Turner & Pete Johnson, \"It's Alright, Baby\"]\n\nThat album impressed him, but it was the other record he heard that day that changed everything for him immediately. It was a collection of recordings by Woody Guthrie.\n\nGuthrie is someone we've only mentioned in passing so far, but he was pivotal in the development of American folk music in the 1940s, and in particular he was important in the politicisation of that music.\n\nIn the 1930s, there wasn't really a distinction made between country music and folk -- that distinction is one that only really came later -- and Guthrie had started out as a country singer, singing songs inspired by the Carter Family, Jimmie Rodgers, and other 1920s greats. For most of his early twenties he'd bummed around Oklahoma and Texas doing odd jobs as a sign painter, psychic, faith healer, and whatever else he could pick up a little money for. But then in 1936 he'd travelled out to California in search of work. When there, he'd hooked up with a cousin, Jack Guthrie, who was a Western singer, performing the kind of Western Swing that would later become rockabilly. We don't have any recordings of Jack from this early, but when you listen to him in the forties, you can hear the kind of hard-edged California Western Swing that would influence most of the white artists we looked at in the first year or so of the podcast:\n\n[Excerpt: Jack Guthrie, \"Oakie Boogie\"]\n\nWoody and Jack weren't musically compatible -- this was when country and western were seen as very, very different genres, rather than being lumped into one -- but they worked together for a while. Jack was the lead singer and guitarist, and Woody was his comedy sidekick, backing vocalist, and harmonica player. They performed with a group called the Beverly Hillbillies and got their own radio show, The Oakie and Woody Show, but it wasn't successful, and Jack decided to give up the show. Woody continued with a friend, Maxine Crissman, who performed as \"Lefty Lou From Old Mizzou\". The Woody and Lefty act became hugely popular, but Lefty eventually also quit, due to her health failing, and while at the time she seems to have been regarded as the major talent in the duo, her leaving the act was indirectly the best thing that ever happened to Guthrie.\n\nThe radio station they were performing on was owned by a fairly left-wing businessman who had connections with the radical left faction of the Democratic Party (and in California in the thirties that could be quite radical, somewhere close to today's Democratic Socialists of America), and when Lefty quit the act, the owner of the station gave Guthrie another job -- the owner also ran a left-wing newspaper, and since Guthrie was from Oklahoma, maybe he would be interested in writing some columns about the plight of the Okie migrants?\n\nGuthrie went and spent time with those people, and his shock at the poverty they were living in and the discrimination they were suffering seems to have radicalised him. He started hanging round with members of the Communist Party, though he apparently never joined -- he wasn't all that interested in Marxist theory or the party line, he just wanted to take the side of the victims against the bullies, and he saw the Communists as doing that. He was, though, enough of a fellow traveller that when World War II started he took the initial Communist line of it being a capitalist's fight that socialists should have no part of (a line which was held until Russia joined the war, at which point it became a crusade against the evils of fascism). His employer was a more resolute anti-fascist, and so Guthrie lost his newspaper job, and he decided to move across the country to New York, where he hooked up with a group of left-wing intellectuals and folk singers, centring on Alan Lomax, Pete Seeger, and Lead Belly.\n\nIt was this environment, centred in Almanac House in Greenwich Village, that spawned the Almanac Singers and later the Weavers, who we talked about a few episodes back. And Guthrie had been the most important of all of them.\n\nGuthrie was a folk performer -- a big chunk of his repertoire was old songs like \"Ida Red\", \"Stackolee\", and \"Who's Going to Shoe Your Pretty Little Feet?\" – but he also wrote songs himself, taking the forms of old folk and country songs, and reworking the lyrics -- and sometimes, but not always, the music -- creating songs that dealt with events that were happening at the time. There were songs about famous outlaws, recast as Robin Hood type figures:\n\n[Excerpt: Woody Guthrie, \"Pretty Boy Floyd\"]\n\nThere were talking blues with comedy lyrics:\n\n[Excerpt: Woody Guthrie, \"Talking Fishing Blues\"]\n\nThere were the famous Dust Bowl Ballads, about the dust storms that had caused so much destruction and hardship in the west:\n\n[Excerpt: Woody Guthrie, \"The Great Dust Storm\"]\n\nAnd of course, there was \"This Land is Your Land\", a radical song about how private property is immoral and unnatural, which has been taken up as an anthem by people who would despise everything that Guthrie stood for:\n\n[Excerpt: Woody Guthrie, \"This Land is Your Land\"]\n\nIt's not certain which records by Guthrie Dylan heard that day -- he talks about it in his autobiography, but the songs he talks about weren't ones that were on the same album, and he seems to just be naming a handful of Guthrie's songs. What is certain is that Dylan reacted to this music in a visceral way. He decided that he had to *become* Woody Guthrie, and took on Guthrie's playing and singing style, even his accent.\n\nHowever, he soon modulated that slightly, when a friend told him that he might as well give up -- Ramblin' Jack Elliot was already doing the Guthrie-imitation thing. Elliot, like Dylan, was a middle-class Jewish man who had reinvented himself as a Woody Guthrie copy -- in this case, Elliot Adnopoz, the son of a surgeon, had become Ramblin' Jack the singing cowboy, and had been an apprentice of Guthrie, living with him and learning everything from him, before going over to Britain, where his status as an actual authentic American had meant he was one of the major figures in the British folk scene and the related skiffle scene. Alan Lomax, who had moved to the UK temporarily to escape the anti-Communist witch hunts, had got Elliot a contract with Topic Records, a folk label that had started out as part of the Workers' Music Association, which as you can probably tell from the name was affiliated with the Communist Party of Great Britain. There he'd recorded an album of Guthrie songs, which Dylan's acquaintance played for him:\n\n[Excerpt: Ramblin' Jack Elliot, \"1913 Massacre\"]\n\nDylan was shocked that there was someone out there doing the same thing, but then he just took on aspects of Elliot's persona as well as Guthrie's. He was going to be the next Woody Guthrie, and that meant inhabiting his persona utterly, and giving his whole repertoire over to Guthrie songs.\n\nHe was also, though, making tentative efforts at writing his own songs, too. One which we only have as a lyric was written to a girlfriend, and was set to the same tune we just heard -- Guthrie's \"1913 Massacre\". The lyrics were things like \"Hey, hey Bonny, I’m singing to you now/The song I’m singing is the best I know how\"\n\nIncidentally, the woman that was written for is yet another person in the story who now has a different name -- she became a moderately successful actor, appearing in episodes of Star Trek and Gunsmoke, and changed her name to Jahanara Romney shortly after her marriage to the hippie peace activist Wavy Gravy (which isn't Mr. Gravy's birth name either). Their son, whose birth name was Howdy Do-Good Gravy Tomahawk Truckstop Romney, also changed his name later on, you'll be unsurprised to hear.\n\nDylan by this point was feeling as constrained by the twin cities of Minneapolis and St. Paul as he had earlier by the small town Hibbing. In January 1961, he decided he was going to go to New York, and while he was there he was going to go and meet Woody Guthrie in person.\n\nGuthrie was, by this time, severely ill -- he had Huntington's disease, a truly awful genetic disorder that had also killed his mother. Huntington's causes dementia, spasmodic movements, a loss of control of the body, and a ton of other mental and physical symptoms. Guthrie had been in a psychiatric hospital since 1956, and was only let out every Sunday to see family at a friend's house.\n\nBob Dylan quickly became friendly with Guthrie, visiting him regularly in the hospital to play Guthrie's own songs for him, and occasionally joining him on the family visits on Sundays. He only spent a few months doing this -- Dylan has always been someone who moved on quickly, and Guthrie also moved towards the end of 1961, to a new hospital closer to his family, but these visits had a profound effect on the young man.\n\nWhen not visiting Guthrie, Dylan was spending his time in Greenwich Village, the Bohemian centre of New York. The Village at that time was a hotbed of artists and radicals, with people like the poet Allen Ginsberg, the street musician Moondog, and Tiny Tim, a ukulele player who sang Rudy Vallee songs in falsetto, all part of the scene. It was also the centre of what was becoming the second great folk revival.\n\nThat revival had been started in 1952, when the most important bootleg ever was released, Harry Smith's Anthology of American Folk Music:\n\n[Excerpt: Blind Lemon Jefferson, \"See That My Grave Is Kept Clean\"]\n\nHarry Smith was a record collector, experimental filmmaker, and follower of the occultist Aleister Crowley. His greatest work seems at least in part to have been created as a magickal work, with album covers designed by himself full of esoteric symbolism. Smith had a huge collection of old 78 records -- all of them things that had been issued commercially in the late 1920s and early thirties, when the record industry had been in a temporary boom before the depression. Many of these records had been very popular in the twenties, but by 1952 even the most popular acts, like Blind Lemon Jefferson or the Carter Family, were largely forgotten.\n\nSo Smith and Moe Asch, the owner of Folkways Records, took advantage of the new medium, the long-playing album, and put together a six-album set of these recordings, not bothering with trivialities like copyright even though, again, most of these had been recorded for major labels only twenty or so years earlier -- but at this time there was not really such a thing as a market for back catalogue, and none of the record labels involved seem to have protested.\n\nSmith's collection was an idiosyncratic one, based around his own tastes. It ran the gamut from hard blues:\n\n[Excerpt: Joe Williams' Washboard Blues Singers, \"Baby Please Don't Go\"]\n\nTo the Carter Family's country recordings of old ballads that date back centuries:\n\n[Excerpt: The Carter Family, \"Black Jack Davey\"]\n\nTo gospel:\n\n[Excerpt: Sister Clara Hudmon, \"Stand By Me\"]\n\nBut put together in one place, these records suggested the existence of a uniquely American roots music tradition, one that encompassed all these genres, and Smith's Anthology became the favourite music of the same type of people who in the UK around the same time were becoming skifflers -- many of them radical leftists who had been part of the US equivalent of the trad jazz movement (who were known as “mouldy figs”) and were attracted by the idea of an authentic music of the working man. The Harry Smith Anthology became the core repertoire for every American folk musician of the fifties, the seed around which the whole movement crystallised. Every folkie knew every single song on those records.\n\nThose folkies had started playing at coffee shops in Greenwich Village, places that were known as basket houses, because they didn't charge for entry or pay the artists, but the performers could pass a basket and split whatever the audience decided to donate.\n\nOriginally, the folk musicians were not especially popular, and in fact they were booked for that reason. The main entertainment for those coffee shops was poetry, and the audience for poetry would mostly buy a single coffee and make it last all night. The folkies were booked to come on between the poets and play a few songs to make the audience clear out to make room for a new audience to come and buy new coffees. However, some of the people got good enough that they actually started to get their own audiences, and within a short time the roles were reversed, with the poets coming on to clear out the folk audience.\n\nDylan's first gigs were on this circuit, playing on bills put together by Fred Neil, a musician who was at this point mostly playing blues songs but who within a few years would write some of the great classics of the sixties singer-songwriter genre:\n\n[Excerpt: Fred Neil, \"Everybody's Talkin'\"]\n\nBy the time Dylan hit the scene, there were quite a few very good musicians in the Village, and the folk scene had grown to the point that there were multiple factions. There were the Stalinists, who had coalesced around Pete Seeger, the elder statesman of the scene, and who played a mixture of summer-camp singalong music and topical songs about news events. There were the Zionists, who were singing things like \"Hava Nagilah\". There were bluegrass players, and there were the two groups that most attracted Dylan -- those who sang old folk ballads, and those who sang the blues.\n\nThose latter two groups tended to cluster together, because they were smaller than the other groups, and also because of their own political views -- while all of the scene were leftists, the blues and ballad singers tended either to be vaguely apolitical, or to be anarchists and Trotskyites rather than Stalinists. But they had a deeper philosophical disagreement with the Stalinists -- Seeger's camp thought that the quality of a song was secondary to the social good it could do, while the blues and ballad singers held that the important thing was the music, and any political or social good was a nice byproduct.\n\nThere was a huge amount of infighting between these small groups -- the narcissism of small differences -- but there was one place they would all hang out. The Folklore Centre was a record and bookshop owned by a man named Izzy Young, and it was where you would go to buy every new book, to buy and sell copies of the zines that were published, and to hang out and find out who the new musicians on the scene were.\n\nAnd it was at the Folklore Centre that Dylan met Dave Van Ronk:\n\n[Excerpt: Dave Van Ronk, \"Cocaine Blues\"]\n\nVan Ronk was the most important musician in the blues and ballads group of folkies, and was politically an anarchist who, through his connection with the Schachtmanites (a fringe-left group who were more Trotskyite than the Trotskyites, and whose views sometimes shaded into anarchism) was becoming converted to Marxism. A physically massive man, he'd started out as a traditional jazz guitarist and banjo player, but had slowly moved on into the folk side of things through his love of blues singers like Bessie Smith and folk-blues artists like Lead Belly. Van Ronk had learned a great deal from Rev. Gary Davis, a blind gospel-blues singer whose technique Van Ronk had studied:\n\n[Excerpt: Rev. Gary Davis, \"Death Don't Have No Mercy\"]\n\nVan Ronk was one of the few people on the Village scene who was a native New Yorker, though he was from Queens rather than the Village, and he was someone who had already made a few records that Dylan had heard, mostly of the standard repertoire:\n\n[Excerpt: Dave Van Ronk, \"See That My Grave is Kept Clean\"]\n\nDylan consciously sought him out as the person to imitate on the scene, and he was soon regularly sleeping on Van Ronk's couch and being managed for a brief time by Van Ronk's wife. Once again, Dylan was learning everything he could from the people he was around -- but he had a much bigger ambition than anyone else on the scene.\n\nA lot of the people on that scene have been very bitter over the years about Dylan, but Van Ronk, who did more for Dylan than anyone else on the scene, never really was -- the two stopped being close once he was no more use to Dylan, as so often happened, but they remained friendly, because Van Ronk was secure enough in himself and his own abilities that he didn't need the validation of being important to the big star. Van Ronk was an important mentor to him for a crucial period of six months or so, and Dylan always acknowledged that, just as Van Ronk always acknowledged Dylan's talent.\n\nAnd that talent, at least at first, was a performing talent rather than a songwriting one. Dylan was writing songs by now, but hardly any, and when he did perform them, he was not acknowledging them. His first truly successful song, a song about nuclear war, \"Let Me Die in my Footsteps\", he would introduce as a Weavers song:\n\n[Excerpt: Bob Dylan, \"Let Me Die in my Footsteps\"]\n\nFor the most part, his repertoire was still only Woody Guthrie songs, but people were amazed by his personal charisma, his humour -- one comparison you see time and again when people talk about his early performances is Charlie Chaplin -- and his singing. There are so many jokes about Dylan's vocals that this sounds like a joke, but among the folk crowd, his phrasing in particular -- as influenced by the R&B records he grew up listening to as by Guthrie -- was considered utterly astonishing.\n\nDylan started publishing some of his song lyrics in Broadside, a magazine for new topical songs, and in other magazines like Sing Out! These were associated with the Communist side of the folk movement, and Dylan had a foot in both camps through his association with Guthrie and Guthrie's friends. Through these people he got to know Suze Rotolo, a volunteer with the Congress of Racial Equality, who became his girlfriend, and her sister Carla, who was the assistant to Alan Lomax, who was now back from the UK, and the Rotolos played a part in Dylan's big breakthrough.\n\nThe timeline that follows is a bit confused, but Carla Rotolo recorded some of the best Village folk singers, and wrote to John Hammond about the tape, mentioning Dylan in particular. At the same time, Hammond's son John Hammond Jr, another musician on the circuit and a friend of Dylan's, apparently mentioned Dylan to his father. Dylan was also working on Robert Shelton, the folk critic of the New York Times, who eventually gave Dylan a massive rave review for a support slot he'd played at Gerde's Folk City. And the same day that review came out, eight days after Carla Rotolo's letter, Dylan was in the recording studio with the folk singer Carolyn Hester, playing harmonica on a few of her tracks, and Hammond was the producer:\n\n[Excerpt: Carolyn Hester, \"I'll Fly Away\"]\n\nHammond had, of course, organised the Spirituals to Swing concerts which had influenced Dylan. And not only that, he'd been the person to discover Billie Holiday, and Count Basie. And Charlie Christian. He was now working for Columbia Records, where he'd just produced the first secular records for a promising new gospel singer who had decided to turn pop, named Aretha Franklin:\n\n[Excerpt: Aretha Franklin, \"Today I Sing the Blues\"]\n\nSo Hammond was an important figure in many ways, and he had a lot of latitude at Columbia Records. He decided to sign Dylan, and even though Mitch Miller, Columbia's head of A&R at the time, had no clue what Hammond saw in Dylan, Hammond's track record was good enough that he was allowed to get on with it and put out an album.\n\nHammond also gave Dylan an album to take home and listen to, a record which hadn't come out yet, a reissue of some old blues records called \"King of the Delta Blues Singers\" by Robert Johnson:\n\n[Excerpt: Robert Johnson, \"Crossroads Blues\"]\n\nThere has been a hell of a lot of mythology about Johnson over the years, so much so that it's almost impossible to give anyone who's heard of him at all an accurate impression of Johnson's place in music history. One question I have been asked repeatedly since I started this podcast is \"How come you didn't start with Robert Johnson?\", and if you don't know about him, you'll get an idea of his general perception among music fans from the fact that I recently watched an episode of a science fiction TV series where our heroes had to go back in time to stop the villains from preventing Johnson from making his recordings, because by doing that they could stop rock and roll from ever existing.\n\nThere's a popular perception that Johnson was the most important blues musician of his generation, and that he was hugely influential on the development of blues and R&B, and it's simply false.\n\nHe *was* a truly great musician, and he *was* hugely influential -- but he was influential on white musicians in the sixties, not black musicians in the thirties, forties, and fifties. In his lifetime, his best selling records sold around five thousand copies, which to put it in perspective is about the same number of people who've listened to some of my more popular podcast episodes. Johnson's biographer Elijah Wald -- a man who, like I do, has a huge respect for Johnson's musicianship, has said \"knowing about Johnson and Muddy Waters but not about Leroy Carr or Dinah Washington [is] like knowing about, say, the Sir Douglas Quintet but not knowing about the Beatles.\" I'd agree, except that the Sir Douglas Quintet were much, much, bigger in the sixties than Robert Johnson was in the thirties.\n\nJohnson's reputation comes entirely from that album that Hammond had handed Dylan. Hammond had been one of the tiny number of people who had actually listened to Johnson at the time he was performing. Indeed, Hammond had wanted to get Johnson to perform at the Spirituals to Swing concerts, only to find that Johnson had died only a short time earlier -- they'd got Big Bill Broonzy to play in his place, and played a couple of Johnson's records from the stage. That had, in fact, kickstarted Broonzy's later second career as a folk-blues musician playing for largely white audiences, rather than as a proto-Chicago-blues performer playing for Black ones.\n\nHammond's friend Alan Lomax had also been a fan of Johnson -- he'd gone to Mississippi later, to try to record Johnson, also without having realised that Johnson had died. But far from Johnson being the single most important blues musician of the thirties, as he is now portrayed in popular culture, if you'd asked most blues musicians or listeners about Robert Johnson in the twenty-three years between his death and the King of the Delta Blues Singers album coming out, most of them would have looked at you blankly, or maybe asked if you meant Lonnie Johnson, the much more famous musician who was a big inspiration for Robert.\n\nWhen King of the Delta Blues Singers came out, it changed all that, and made Robert Johnson into a totemic figure among white blues fans, and we'll see over the next year or two a large number of very important musicians who took inspiration from him -- and deservedly so. While the myth of Robert Johnson has almost no connection to the real man, his music demonstrated a remarkable musical mind -- he was a versatile, skilled guitarist and arranger, and someone whose musical palette was far wider than his recorded legacy suggests -- Ramblin' Johnny Shines, who travelled with Johnson for a time, describes him as particularly enjoying playing songs like \"Yes, Sir, That's My Baby\" and Jimmie Rodgers songs, and polkas, calling Johnson \"a polka hound, man\". And even though in his handful of recording sessions he was asked only to play blues, you can still hear elements of that:\n\n[Excerpt: Robert Johnson, \"They're Red Hot\"]\n\nBut the music wasn't the main thing that grabbed Dylan. Dylan played the album for Dave Van Ronk, who was unimpressed -- musically, Johnson just didn't seem very original to Van Ronk, who played Dylan records by Skip James, Leroy Carr, and others, showing Dylan where Johnson had picked up most of his musical ideas. And Dylan had to agree with him that Johnson didn't sound particularly original in that context -- but he also didn't care, reasoning that many of the Woody Guthrie songs he loved were rewrites of old Carter Family songs, so if Johnson was rewriting Leroy Carr songs that was fair enough.\n\nWhat got to Dylan was Johnson's performance style, but also his ability with words. Johnson had a very sparse, economical, lyrical style which connected with Dylan on a primordial level. Most of those who became fans of Johnson following the release of King of the Delta Blues Singers saw Johnson as an exotic and scary figure -- the myth commonly told about him is that he sold his soul at a crossroads to the Devil in return for the ability to play the guitar, though that's a myth that was originally told about a different Mississippi blues man called Tommy Johnson, and there's no evidence that anyone thought that of him at the time -- and so these later fans see his music as being haunted. Dylan instead seems to see Johnson as someone very like himself -- in his autobiography, Chronicles, Dylan talks about Johnson being a bothersome kid who played harmonica, who was later taught a bit of guitar and then learned the rest of his music from records, rather than from live performers. Dylan's version of Johnson is closer to the reality, as far as we know it, than the Johnson of legend is, and Dylan seems to have been delighted when he found out much later that the name of the musician who taught Johnson to play guitar was Ike Zimmerman.\n\nDylan immediately tried to incorporate Johnson's style into his own songwriting, and we'll see the effects of that in future episodes. But that songwriting wouldn't be seen much on his debut album. And nor would his Woody Guthrie repertoire. Instead, Dylan performed a set of traditional ballads and blues numbers, most of which he never performed live normally, and at least half of which were arrangements that Dylan copied wholesale from Dave Van Ronk.\n\n[Excerpt: Bob Dylan, “See That My Grave is Kept Clean”]\n\nThe album was recorded quickly, in a couple of days. Hammond found Dylan incredibly difficult to work with, saying he had appalling mic technique, and for many of the songs Dylan refused to do a second take.\n\nThere were only two originals on the album. One, \"Talkin' New York\", was a comedy talking blues about his early time in New York, very much in the style of Woody Guthrie's talking blues songs. The other, \"Song To Woody\", was a rewrite of his earlier \"Song For Bonny\", which was itself a rewrite of Guthrie's \"1913 Massacre\". The song is a touching one, Dylan paying tribute to his single biggest influence:\n\n[Excerpt: Bob Dylan, \"Song to Woody\"]\n\nDylan was moving on, and he knew he was moving on, but he had to say goodbye.\n\nDylan's first album was not a success, and he became known within Columbia Records as \"Hammond's Folly\", but nor did it lose money, since it was recorded so quickly. It's a record that Dylan and Hammond both later spoke poorly of, but it's one I rather like, and one of the best things to come out of the Greenwich Village folk scene.\n\nBut by the time it came out, Dylan's artistic heart was already elsewhere, and when we come back to him in a couple of months, we'll be seeing someone who had completely reinvented himself.",
  "enclosure": "",
  "itunes:summary": "Episode ninety-seven of A History of Rock Music in Five Hundred Songs looks at \"Song To Woody\" by Bob Dylan, and at the Greenwich Village folk scene of the early sixties. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Sherry\" by the Four Seasons.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist with full versions of all the songs in the episode. This might not be available in the US, due to the number of Woody Guthrie songs in a row.\n\nDylan's first album is in the public domain in Europe, so a variety of reissues of it exist. An interesting and cheap one is this, which pairs it (and a non-album single by Dylan) with two Carolyn Hester albums which give a snapshot of the Greenwich Village scene, on one of which Dylan plays harmonica.\n\nThe Harry Smith Anthology is also now public domain, and can be freely downloaded from archive.org.\n\nI have used *many* books for this episode, most of which I will also be using for future episodes on Dylan:\n\nThe Mayor of MacDougal Street by Dave Van Ronk and Elijah Wald is the fascinating and funny autobiography of Dylan's mentor in his Greenwich Village period.\n\nEscaping the Delta by Elijah Wald is the definitive book on Robert Johnson.\n\nInformation on Woody Guthrie comes from Ramblin' Man: The Life and Times of Woody Guthrie by Ed Cray.\n\nChronicles Volume 1 by Bob Dylan is a partial, highly inaccurate, but thoroughly readable autobiography.\n\nBob Dylan: All The Songs by Phillipe Margotin and Jean-Michel Guesdon is a song-by-song look at every song Dylan ever wrote, as is Revolution in the Air, by Clinton Heylin.\n\nHeylin also wrote the most comprehensive and accurate biography of Dylan, Behind the Shades.\n\nI've also used Robert Shelton's No Direction Home, which is less accurate, but which is written by someone who knew Dylan.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nTranscript\n\n1962 is the year when the sixties really started, and in the next few episodes we will see the first proper appearances of several of the musicians who would go on to make the decade what it was. By two weeks from now, when we get to episode one hundred and the end of the second year of the podcast, the stage will be set for us to look at that most mythologised of decades.\n\nAnd so today, we're going to take our first look at one of the most important of the sixties musicians, the only songwriter ever to win the Nobel Prize for Literature, a man who influenced every single performer and songwriter for at least the next decade, and whose work inspired a whole subgenre, albeit one he had little but contempt for. We're going to look at his first album, and at a song he wrote to his greatest influence. And we're also going to look at how his career intersected with someone we talked about way back in the very first episode of this podcast.\n\nToday we're going to look at Bob Dylan, and at \"Song to Woody\":\n\n[Excerpt: Bob Dylan, \"Song to Woody\"]\n\nThis episode is going to be a little different from several of the other episodes we've had recently. At the time he made his first album, Dylan was not the accomplished artist he quickly became, but a minor performer whose first record only contained two original songs. But he was from a tradition that we've looked at only in passing before. We've barely looked at the American folk music tradition, and largely ignored the musicians who were major figures in it, because those figures only really enter into rock and roll in a real way starting with Dylan. So as part of this episode, we're going to have very brief, capsule, looks at a number of ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode ninety-seven of A History of Rock Music in Five Hundred Songs looks at \"Song To Woody\" by Bob Dylan, and at the Greenwich Village folk scene of the early sixties. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Sherry\" by the Four Seasons.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist with full versions of all the songs in the episode. This might not be available in the US, due to the number of Woody Guthrie songs in a row.\n\nDylan's first album is in the public domain in Europe, so a variety of reissues of it exist. An interesting and cheap one is this, which pairs it (and a non-album single by Dyla",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}