{
  "title": "Apple TV 4K (2022) review: overpowered in all the right ways",
  "link": "https://www.digitaltrends.com/home-theater/apple-tv-4k-2022-review/",
  "pubDate": "Fri, 04 Nov 2022 18:25:50 +0000",
  "dc:creator": "Caleb Denison",
  "category": [
    "Home Theater",
    "Reviews",
    "Apple",
    "apple tv",
    "Apple TV 4K",
    "Apple TV 4K 2022",
    "TV"
  ],
  "guid": "https://www.digitaltrends.com/?p=3217042",
  "description": "Apple has released two new Apple TV 4K boxes for 2022, and while they may not look radically different on paper, they are made for the future. ",
  "content:encoded": "<p>The latest generation of Apple TV 4K is here. There are two versions, separated by several features and a mere $20, with a few key upgrades here and there. It would be easy to kind of glaze over what’s new and different, but I have a different take for this Apple TV 4K 2022 review.</p>\n<p>I think the fact that not a lot has changed is among some of the best news I can deliver, but some new features, including a super-powerful processor, push the new Apple TV 4K 2022 over the top.</p>\n<p>Still, if you&#8217;re considering saving even more money by buying the older 2nd-Generation version, you can learn more about the differences between the two in our <a href=\"https://www.digitaltrends.com/home-theater/apple-tv-4k-2021-vs-apple-tv-4k-2022/\">Apple TV 4K (2021) vs. Apple TV 4K (2022) comparison</a>.</p>\n<h2><b>Video review</b></h2>\n<video src=\"https://content.jwplatform.com/videos/OLSpBqT9.mp4\" data-player=\"zpykqaab\" data-embed=\"default\" data-application-id class=\"video-js\" controls ></video>\n<h2>What&#8217;s new</h2>\n<p>To begin, let’s run down the two new Apple TV 4K products we have. First off, prices are down a bit, which I think we can all agree is a big step in the right direction. There’s now a $130 version and a $150 version &#8212; about $50 less expensive than what the last refresh cost at launch. Both have the same Siri remote, now with a <a href=\"https://www.digitaltrends.com/mobile/iphone-usb-c-legislation-passed-2024-european-union/\">USB-C connector.</a> Both get an A15 Bionic chip, and both now support HDR 10+ in addition to Dolby Vision HDR and several other HDR formats.</p>\n<p>Stepping up to the premium version gets you double the onboard storage, 128GB up from 64GB in the lesser model. It also keeps Gigabit Ethernet support (the lesser model loses it), and it has Thread networking support, which we will discuss more below.</p>\n<p>I’m going to focus on the premium version in this review, because that’s the one I received for evaluation, but also because I think that if you’re going to buy a new Apple TV 4K, this is the one you should buy.</p>\n<p>First off, it’s only $20 more than the lesser model. Second, as I’ll discuss shortly, there’s a good chance you might need the extra storage in the future, even if you don’t need the Ethernet port and Thread support.</p>\n<h2>Powerful potential</h2>\n<p>As pleased as I am that there’s a USB-C Siri remote (even though it&#8217;s <a href=\"https://www.digitaltrends.com/home-theater/apple-tv-4k-2022-least-interesting-features/\">a bit of a boring upgrade</a>) and that Gigabit Ethernet has been added along with the <a href=\"https://www.digitaltrends.com/home/guide-to-thread-in-the-smart-home/\">support for Thread</a>, the most notable improvement to the new Apple TV 4K is the upgrade to Apple&#8217;s A15 Bionic chip.</p>\n<p>One of the chief reasons I recommend folks get an Apple TV is that the device has always offered a significant amount of processing headroom, and the A15 bionic &#8212; up from the A12 in the second-generation model &#8212; continues that trend. Unlike so many other tech devices that suffer from planned obsolescence, the Apple TV 4K is built to last. For many years to come, it’s going to be able to handle the latest apps, as well asoffer quick load times and fast scrolling. It’s going to be able to handle increasingly fancy on-screen graphics. It’s going to be able to handle updates Apple may have on its roadmap or even stuff Apple hasn’t even conceived of yet.</p>\n<p>Or, to look at it another way, a first-generation Apple TV 4K released in 2017 likely still works just fine, and it&#8217;s still supported by Apple.</p>\n<figure id=\"attachment_3217980\" aria-describedby=\"caption-attachment-3217980\" class=\"wp-caption alignnone\"><img  class=\" size-large wp-image-3217980\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-10.jpg?fit=720%2C404&p=1\" alt=\"Controlling Apple TV 4K using an Apple Watch.\"   /><figcaption id=\"caption-attachment-3217980\" class=\"wp-caption-text\"><span class=\"credit\">Zeke Jones/Digital Trends</span></figcaption></figure>\n<p>I have a smart TV at home that’s only a couple of years old, and it is now slow as molasses just opening apps, nevermind delays in getting a stream started. It routinely stalls on me, which I find very frustrating. You’re not going to run into that kind of issue with Apple TV 4K, because the processor is kind of a monster. I love how quick the experience of using this device is. Apps seem to launch a bit faster than the 2021 model, and they clearly launch far faster than they did with the old HD version.</p>\n<h3><b>Apple&#8217;s gaming future? </b></h3>\n<p>I suspect that horsepower is there for at least one more reason beyond future-proofing. Apple sent me a PlayStation 5 controller along with the review unit without really saying anything more about it. Apple hasn’t announced anything specific about any developments in its gaming aspirations, but it stands to reason the more powerful chip could deliver smoother and more responsive gameplay for games available now, as well as more graphics-intensive games in the future.</p>\n<p>I don’t know what’s in store for the future of Apple Arcade or if Apple&#8217;s gaming ambitions range beyond Apple Arcade, or at least Apple Arcade as we know it today. But something tells me gaming isn&#8217;t going to be an add-on feature that just sort of disappears into the background like it did on, say, Roku (or <a href=\"https://www.digitaltrends.com/gaming/google-stadia-shutting-down-in-january-2023/\">killed off entirely like Google Stadia</a>.)</p>\n<p>It’s entirely possible the new Apple TV 4K is a gateway into Apple&#8217;s bigger, better gaming plans &#8212; or maybe even <a href=\"https://www.digitaltrends.com/gaming/everything-we-know-about-netflix-gaming/\">Netflix’s gaming</a> plans. I can see the Apple TV 4K making it to Netflix’s list of supported devices soon, and if it does, the Apple TV 4K will be ready to take on those games.</p>\n\n<a class=\" size-large-wrap h-lightbox is-zoomable\"  href='https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-4.jpg?fit=3840%2C2160&p=1' rel=\"wp-att-3217972\"><img    src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-4.jpg?fit=720%2C720&p=1\" class=\"attachment-large size-large wp-image-3217972\" alt=\"Playing a mobile car racing game on Apple TV 4K using a Sony PlayStation 5 controller.\" /></a>\n<a class=\" size-large-wrap h-lightbox is-zoomable\"  href='https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-5.jpg?fit=3840%2C2160&p=1' rel=\"wp-att-3217973\"><img    src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-5.jpg?fit=720%2C720&p=1\" class=\"attachment-large size-large wp-image-3217973\" alt=\"The PlayStation 5 Controller being used to play mobile games on an Apple TV 4K.\" /></a>\n<a class=\" size-large-wrap h-lightbox is-zoomable\"  href='https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-12.jpg?fit=3840%2C2160&p=1' rel=\"wp-att-3217982\"><img    src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-12.jpg?fit=720%2C720&p=1\" class=\"attachment-large size-large wp-image-3217982\" alt=\"Apple Arcade splash screen on a Samsung S95B OLED TV.\" /></a>\n\n<p>That’s where I think the need for more onboard storage comes in. If Apple gets more aggressive with making the Apple TV 4K a real gaming device, having enough storage to handle bigger games is going to be absolutely necessary.</p>\n<p>Of course, I’m also hopeful &#8212; perhaps foolishly so &#8212; that Apple TV 4K could one day support cloud-based gaming, even if the biggest cloud-gaming players right now are big Apple competitors.</p>\n<h2><b>Stitching up the smart home</b></h2>\n<p>Beyond gaming, I also think this new Apple TV 4K is a sort of Trojan horse or gateway to a better smart home experience. I know that the second-gen Apple TV 4K already has a Thread radio in it, but something feels different with this new version.</p>\n<p>Thread, if you’re not familiar, is part of a standard that aims to make smart home device use far easier than it’s been for the past several years. Think of it as a low-power wireless communications system that’s independent of your home wireless network. Let’s say you get a new <a href=\"https://www.digitaltrends.com/home/best-video-doorbells/\">video doorbell</a> that’s Thread-enabled. Instead of having to connect it to your network using an app, it would just connect to the local Thread network. It’s the “thread” that stitches all your smart home stuff together. Only one Thread device needs to be connected to the internet, and then they all have access.</p>\n<p>I think the new Apple TV 4K here is going to end up being a big part of that transition as it takes place. Again, this is tech that&#8217;s been built into the second-gen Apple TV 4K for a while now, but something about Apple highlighting its inclusion in the $150 Apple TV Wi-Fi/Ethernet model makes it feel like it&#8217;s poised to take off. The Apple TV 4K as a home hub is looking more and more promising.</p>\n<p>Again, to repeat, you have to buy the $150 Apple TV 4K for all this Thread stuff. The less-expensive model doesn&#8217;t have it.</p>\n<h2>For the AV enthusiasts</h2>\n<p>And, finally, there’s the addition of <a href=\"https://www.digitaltrends.com/home-theater/what-is-hdr10-plus-hdr-formats/\">HDR 10+</a> support, which is interesting because this basically just helps out Samsung TV owners. Samsung is the last hold-out on <a href=\"https://www.digitaltrends.com/home-theater/what-is-dolby-vision-hdr-for-tvs/\">Dolby Vision</a>, refusing to pay the licensing fees to add it to their TVs and, instead, pushing forward the open and free standard of HDR 10+. Considering Samsung is the number-one TV brand in terms of sales, it makes sense Apple would want to serve that audience.</p>\n<p>That means that shows and movies on, say, Amazon Prime Video and Apple TV + that would have been in plain-jane HDR on a Samsung TV while everyone else was getting Dolby Vision will now be in HDR 10+, offering a better overall HDR experience that&#8217;s much closer to that experience by Dolby Vision users.</p>\n\n<a class=\" size-large-wrap h-lightbox is-zoomable\"  href='https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-13.jpg?fit=3840%2C2160&p=1' rel=\"wp-att-3217983\"><img    src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-13.jpg?fit=720%2C720&p=1\" class=\"attachment-large size-large wp-image-3217983\" alt=\"The HDR 10+ logo appears on the Samsung S95B OLED\" /></a>\n<a class=\" size-large-wrap h-lightbox is-zoomable\"  href='https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-11.jpg?fit=3840%2C2160&p=1' rel=\"wp-att-3217981\"><img    src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-11.jpg?fit=720%2C720&p=1\" class=\"attachment-large size-large wp-image-3217981\" alt=\"A viewer uses AirPods Max headphones to experience Spatial Audio on the new Apple TV 4K\" /></a>\n\n<p>So long as I&#8217;m on the topic of A/V features that appeal to enthusiasts, I feel like I need to revisit Spatial Audio on the Apple TV 4K. This is one thing the Apple TV 4K does that no other streaming box is doing nearly as well right now. The <a href=\"https://www.digitaltrends.com/home-theater/apple-airpods-pro-2-review/\">AirPods Pro 2</a> or the <a href=\"https://www.digitaltrends.com/home-theater/apple-airpods-max-review/\">AirPods Max</a> connected to the Apple TV 4K, with head tracking turned on, is, in my opinion, the best personal audio experience there is for watching movies. And I say this having heard some incredibly convincing DTS Headphone:X demos. Spatial Audio on Apple products, though, is an end-to-end solution that just works and is so much fun. This is the closest I’ve heard to big-theater Dolby Atmos in the home, and I say this as someone who has tested numerous <a href=\"https://www.digitaltrends.com/home-theater/best-dolby-atmos-soundbars/\">Dolby Atmos Soundbars</a> and Dolby Atmos surround speaker systems.</p>\n<h2>An end to that annoying black screen</h2>\n<p>Folks who have experienced an annoying picture dropout when switching from one type of media to another will be pleased to know that a future TVOS update will allow the new Apple TV 4K (2022) to support quick media switching, better known in A/V circles as QMS. As one of many promised <a href=\"https://www.digitaltrends.com/home-theater/hdmi-explained-everything-you-need-to-know-news-specs/\">HDMI 2.1 features</a>, QMS will work in coordination with <a href=\"https://www.digitaltrends.com/computing/what-is-variable-refresh-rate-vrr/\">variable refresh rate (VRR)</a> to ensure there&#8217;s no &#8220;adjustment period&#8221; &#8212; manifesting as a black screen &#8212; when switching from, say, a 24 FPS movie to a 60 FPS video. Presently, no TVs support QMS, but they soon will, and when they do, the forward-looking Apple TV 4K (2022) will be ready.</p>\n<h2>A powerhouse streamer, not just for Apple fans</h2>\n<p>To recap what&#8217;s new: The A15 Bionic Chip keeps the Apple TV 4K seriously overpowered, and that’s a very good thing. It looks like Gaming is about to get even bigger on the Apple TV 4K, though, admittedly, that remains to be proven. HDR 10+ support brings a better experience to Samsung TV owners. The built-in Thread radio keeps the box ready to be at the heart of a smart home, and we’re one step closer to not needing Lightning cables anymore as Apple continues its transition toward USB-C.</p>\n<p>That’s the case for the new Apple TV 4K, but a lot about what has endeared me to this streaming set-top box hasn’t changed and isn&#8217;t new. So, do I still love it?</p>\n\n<a class=\" size-large-wrap h-lightbox is-zoomable\"  href='https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-8.jpg?fit=3840%2C2160&p=1' rel=\"wp-att-3217976\"><img    src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-8.jpg?fit=720%2C720&p=1\" class=\"attachment-large size-large wp-image-3217976\" alt=\"The Apple TV 4K standing vertically with the Apple logo showing from the front\" /></a>\n<a class=\" size-large-wrap h-lightbox is-zoomable\"  href='https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-6.jpg?fit=3840%2C2160&p=1' rel=\"wp-att-3217974\"><img    src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-6.jpg?fit=720%2C720&p=1\" class=\"attachment-large size-large wp-image-3217974\" alt=\"The new Apple TV 4K Siri remote featuring a USB-C connector\" /></a>\n<a class=\" size-large-wrap h-lightbox is-zoomable\"  href='https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-9.jpg?fit=3840%2C2160&p=1' rel=\"wp-att-3217978\"><img    src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-9.jpg?fit=720%2C720&p=1\" class=\"attachment-large size-large wp-image-3217978\" alt=\"The rear view of an Apple TV 4K showing gigabit ethernet port, HDMI port, and power port, with the Siri remote alongside in the background\" /></a>\n\n<p>I do. It wasn&#8217;t always that way, though. For many years, I was <i>not </i>in love with the Apple TV 4K. It seemed overpriced, comically overpowered, and too much of an Apple fan device. But over time, <a href=\"https://www.digitaltrends.com/home-theater/why-the-apple-tv-is-the-best-streaming-box-you-can-buy-right-now/\">I’ve changed my tune</a>.</p>\n<p>I’ve come to appreciate the Apple TV, because it is reliably fast, it has the least ad-riddled interface available, it’s got top-notch cross-platform search to help you find and start watching whatever it is you want to watch, and it consistently supports the best video and audio quality available across a broad variety of apps.</p>\n<p>And, yes, there is also a long list of reasons that Apple device users will especially like it, like SharePlay, Siri control with AirPods, Audio Sharing, Picture Calibration, and the ability to use your iPhone, iPad, or Apple Watch as a remote. AirPlay, <a href=\"https://www.digitaltrends.com/home/best-apple-homekit-enabled-devices/\">HomeKit</a>, Apple Photos, <a href=\"https://www.digitaltrends.com/home-theater/what-is-apple-music/\">Apple Music</a>, and Apple Fitness are integrated with the <a href=\"https://www.digitaltrends.com/mobile/apple-watch-series-8-review/\">Apple Watch </a>so you can see your rings progress on-screen as you work out. The list goes on.</p>\n<p>Is it the most versatile streamer out there? Well, <a href=\"https://www.digitaltrends.com/home-theater/nvidia-shield-update-android-11/\">Nvidia Shield</a> can do a few things the Apple TV 4K can’t. And for portability, I’m way more likely to toss a new <a href=\"https://www.digitaltrends.com/home-theater/chromecast-google-tv-update-android-12/\">Chromecast</a> into my bag than an Apple TV 4K. But on the whole, the Apple TV 4K is probably the smartest, most advanced, most future-proof streamer available that will suit most people’s needs. It doesn’t try to be all things to all people, but what it does, it does better than anything else.</p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2022/11/Apple-TV-4K-2022-Gen-3-10.jpg?p=1",
  "enclosure": "",
  "post-id": 3217042
}