{
  "title": "Episode 89: &#8220;Will You Love Me Tomorrow?&#8221; by the Shirelles",
  "link": "https://500songs.com/podcast/episode-89-will-you-love-me-tomorrow-by-the-shirelles/",
  "pubDate": "Fri, 10 Jul 2020 12:47:52 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-89-will-you-love-me-tomorrow-by-the-shirelles/",
  "description": "Episode eighty-nine of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Will You Love Me Tomorrow?\" by the Shirelles, and at the beginnings of the Brill Building sound. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/39174499\">\"Tom Dooley\" by the Kingston Trio</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-89-will-you-love-me-tomorrow/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are no biographies of the Shirelles in print, so I've used a variety of sources, including the articles on the Shirelles and Luther Dixon at <a href=\"http://tims.blackcat.nl\">This Is My Story</a>. The following books were also of some use:\n\n<a href=\"https://amzn.to/3275Sz8\">A Natural Woman</a> is Carole King's autobiography.\n\n<a href=\"https://amzn.to/325o24w\">Always Magic in the Air: The Bomp and Brilliance of the Brill Building Era</a> by Ken Emerson is a good overview of the whole scene.\n\n<a href=\"https://amzn.to/3iOneXx\">Girl Groups</a> by John Clemente contains potted biographies of many groups of the era.\n\nAnd <a href=\"https://amzn.to/38GqEHg\">Here Comes The Night: The Dark Soul of Bert Berns and the Dirty Business of Rhythm and Blues</a> by Joel Selvin goes into some detail about Scepter Records.\n\nI also referred to the liner notes of<a href=\"https://amzn.to/323APUN\"> this CD</a>, which contains most of the Shirelles tracks worth owning.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWe're currently in a patch of rock and roll history that is ludicrously undocumented. There is book after book about the major stars of the early rock and roll era -- while you won't find much out there on a lot of truly important artists, you can find out enough about Elvis and Ray Charles and Johnny Cash and Little Richard and Chuck Berry and the rest -- these are all romantic figures of legend, the Titans who were defeated in the Titanomachy that was the mid-sixties Beat boom. And of course, there are many many, books on almost every band of the mid to late sixties to even have a minor hit.\n\nBut the period from 1958 through 1964 is generally summed up by \"and there were some whitebread nonentities like Fabian and Frankie Avalon\". Occasionally, in some of the books, there is a slightly more subtle approach taken, and the summary is \"there were some whitebread nonentities like Fabian and Frankie Avalon, and also Roy Orbison and one or two others made a decent record\".\n\nBut there were many other people making great records -- people who made hits that are still staples of oldies radio in a way that a lot of records from a few years later aren't; records that still sound like they're fresh new records made by people who have ideas.\n\nToday we're going to talk about a few of those people, and about one of those great records. We're going to look at the Brill Building, and some of the songwriters who worked there, and at the great record producer Luther Dixon, and at the Shirelles, and their record \"Will You Love Me Tomorrow?\":\n\n[Excerpt: The Shirelles, \"Will You Love Me Tomorrow?\"]\n\nIt's been a little while since we looked at any of the early girl groups, but if you remember the episodes on the Bobettes and the Chantels, girl groups in the early years were largely a phenomenon based in New York, and that's more or less the case with the Shirelles, who didn't come from New York itself, but from Passaic New Jersey, about sixteen miles away. Shirley Owens, Doris Coley, Addie Harris and Beverly Lee met at school, and formed a group called the Poquellos, which is apparently Spanish for \"little birds\". As we've discussed previously, most of the early doo-wop groups were named after birds, and these girls were forming their group before girl groups became regarded as something separate from male vocal groups.\n\nOddly, the group that became the most successful of the early girl groups, and the one that more than any other set the template for all those that would follow, never wanted to become professional singers, and almost had to be forced against their will at every stage. Their first public performance, in fact, was as a punishment. They had been singing with each other in gym class, and not paying attention to the teacher, and so the teacher told them that, as a punishment, they would have to perform in the school talent contest, which they didn't want to do. They performed at the show, singing a song they'd made up themselves, \"I Met Him on a Sunday\", and went down a storm with the kids at the school. In particular, one of the girls there, Mary Jane Greenberg, insisted that the girls come and meet her mother, Florence.\n\nFlorence Greenberg was a bored suburban housewife, who until her mid-forties had concentrated on being a homemaker for her husband, who was an executive at a potato chip firm, and for her two children. In her spare time she mostly did things like run fundraisers for the local Republican party. But her son was interested in getting into the music business in some way, and her husband was friends with Freddy Bienstock, who worked for Hill and Range at the Brill Building, and whose job was choosing the songs that Elvis Presley would record. Bienstock invited Greenberg to come and visit him at Hill and Range's offices, and after spending a little time around the Brill Building, Greenberg became convinced that she should start her own record label, despite having no experience in the field whatsoever. She would often just go and hang around at a restaurant near the Brill Building to soak in the atmosphere.\n\nThe Poquellos were actually not at all interested in making a record, but Mary Jane kept insisting that they should meet with her mother anyway. It got to the point that the girls used to try to avoid her at school and hide from her, but she was insistent and eventually they relented, and went to see Mrs Greenberg. They auditioned for her in her front room, singing the same song they'd performed at the school talent contest. Mrs Greenberg decided that they were going to be the first group signed to her new label, Tiara Records, and they recorded the song they'd written, with Greenberg's musical son Stan producing and arranging, under the name Stan Green:\n\n[Excerpt: The Shirelles, \"I Met Him On A Sunday (Ronde Ronde)\"]\n\nStan wasn't the only person with a new name. The Poquellos were also renamed, to the Shirelles -- after Shirley Owens, but with the \"el\" ending to be reminiscent of the Chantels, and that was the name they would be known by from that point on. \"I Met Him On A Sunday\" was a minor local success, and was picked up by Decca Records, who bought the girls' contract out from Greenberg. They managed to get it to number fifty on the charts, but the two singles they recorded for Decca after that didn't have any success, and the label dropped them.\n\nThat might have been the end of the Shirelles, but Greenberg had remained their manager, and she had started up a new record label, Scepter Records, and signed them up to that instead of Tiara. Their first few singles for Scepter did nothing, but then a change in Scepter's staffing changed everything, not just for the Shirelles, but for the world of music.\n\nGreenberg was not a particularly musical person -- and indeed several of the people who worked for her would later mock some decisions she'd made when she'd used her own judgment about songs. But she surrounded herself with people who were musical. The director of A&R for Scepter was Wally Roker, who had originally been the bass singer in the Heartbeats, who'd had a top five hit with \"A Thousand Miles Away\" in 1956:\n\n[Excerpt: The Heartbeats, \"A Thousand Miles Away\"]\n\nRoker in turn introduced Greenberg to a friend of his, Luther Dixon. Greenberg and Dixon's initial meeting was just the length of one elevator ride, but that was long enough for them to exchange numbers and arrange to meet again. Soon Dixon was working for Greenberg at Scepter, and was also her lover.\n\nDixon had started out as a singer, joining a minor group called The Buddies, who had recorded singles like \"I Stole Your Heart\":\n\n[Excerpt: The Buddies, \"I Stole Your Heart\"]\n\nBut he had soon moved into songwriting. Dixon was a collaborator by nature, and his first big hit was written with a writing partner called Larry Harrison. \"Why Baby Why\" went to number five for Pat Boone in 1957:\n\n[Excerpt: Pat Boone, \"Why Baby Why\"]\n\nHe spent some time writing with Otis Blackwell, with whom he wrote \"All the Way Home\" for Bobby Darin:\n\n[Excerpt: Bobby Darin, \"All the Way Home\"]\n\nAnd at the time he met Greenberg, he had just written \"Sixteen Candles\" with Allyson Khent, a number two hit for the Crests:\n\n[Excerpt: The Crests, \"Sixteen Candles\"]\n\nGreenberg took him on as a staff writer and producer, and gave him a cut of the publishing rights for his songs -- almost unheard of at that time.\n\nThe first record he worked on for the Shirelles was also the group's first top forty hit. With Shirley Owens, Dixon wrote \"Tonight's the Night\". It was intended as a B-side to a song with a lead by Doris, but \"Tonight's the Night\" was an unexpected success and established Shirley firmly in the role of the group's lead singer:\n\n[Excerpt: The Shirelles, \"Tonight's the Night\"]\n\nThat went to number thirty-nine, and a competing version by the Chiffons also made the Hot One Hundred:\n\n[Excerpt: The Chiffons, \"Tonight's the Night\"]\n\nThe Shirelles were a hit group, and they needed a follow-up. And that's where Goffin and King enter our story...\n\nCarole King had, from a very early age, been a child prodigy with a particular talent for music. In her autobiography she talks about how when she was a child, her dad would have her, as a party trick, turn to the wall while he played notes on the piano and she called out which one he was playing. Apparently her father would claim she had perfect pitch, and this was not quite true -- she had relative pitch, which meant that once she heard one note she knew, she could tell all the rest of the notes from that, so her father would always start with middle C. But that sense of relative pitch is in itself an amazing talent for a tiny child -- I still can't do that with any great accuracy in my forties, and I've spent most of my life studying and playing music.\n\nBy the age of eight she had appeared in a couple of shows, including Ted Mack's Amateur Hour, which was a nationally broadcast show, performing in a duo with a friend, but she didn't know exactly what it was she wanted to do until she was thirteen, when she went on a date with Joel Zwick, who would later become known as the director of My Big Fat Greek Wedding among others -- one thing that seems to happen a lot in King's early life is getting to know people who would go on to become very successful. Zwick took her to an Alan Freed show at the Paramount in Brooklyn, where she saw LaVern Baker, BB King, Mickey Baker, the Moonglows, and several other R&B stars of the period.\n\nIt wasn't, though, seeing the musicians themselves that made Carol Klein, as she then was, want to go into rock and roll music, though that was certainly an inspiration, and she talks a lot about how that Freed show was her introduction to a whole world of music that was far from the whitebread pop on which she had grown up. Rather, it was almost a chance event. She and her date hung around the stage door to see if they could see any of the performers and get autographs. The group they were in accidentally got drawn in through the stage door when some people who were meant to be there were let in, and she got to see the performers hanging around backstage. She knew then, not that she wanted to be a performer herself, but that she wanted to be part of that world, someone that those performers knew and respected.\n\nShe started attending a stage school, where one of her classmates was Al Pacino, but after a short while she left, deciding that she wasn't cut out for the non-musical aspects of the school, and went back to a normal high school, where she formed her first group, the Cosines. along with Zwick.\n\nShe started writing songs when she heard a group from a rival local high school, Neil Sedaka and the Linc-Tones, singing a song called \"While I Dream\":\n\n[Excerpt: The Tokens \"While I Dream\"]\n\nSedaka had briefly dated her, and had co-written that song himself, with Howard Greenfield, and his group got a record deal under the name The Tokens. King figured that if he could do that, so could she. She started writing songs, and found she was good at melodies but not particularly great at lyrics. But she still thought she was good enough to do something. She decided that she was going to go and see Alan Freed, and play him some of her songs.\n\nFreed listened to her politely, and explained to her how, at the time, one went about becoming a professional songwriter for the R&B market. He told her to get the addresses of record labels from the phone book, go and try to play her songs to them, and explained how a publishing contract would work. The record label he mentioned to her specifically was Atlantic Records, so she tried that one first. Jerry Wexler and Ahmet Ertegun listened to her, and told her she had talent and to come back when she had more songs. It wasn't a rejection, but it wasn't the instant acceptance she'd hoped for.\n\nThe second label she went to was ABC-Paramount, where she saw Don Costa. Costa was head of A&R at the label, but also a musician himself. Around this time he had released a cover version of Bill Justis' \"Raunchy\", under the name Muvva Guitar Hubbard:\n\n[Excerpt: Muvva \"Guitar\" Hubbard, \"Raunchy\"]\n\nCosta would later go on to arrange and conduct for Frank Sinatra, and he also had a respectable career as a session guitarist, but Carol didn't know any of this when she went into his office and played through her songs for him. She was flabbergasted to find that, rather than just sign her to a publishing contract, he asked her to sign a recording contract as well. She was disappointed that he wasn't interested in signing the rest of her group -- he thought she was good enough by herself, without needing to hear the other three -- but not so disappointed that she didn't sign with him straight away.\n\nHer first few singles were solo compositions, and didn't do very much in terms of sales, partly because she still didn't consider herself especially good as a lyricist:\n\n[Excerpt: Carole King, \"The Right Girl\"]\n\nSo while she was trying to have a music career, she also went off to college, aged sixteen -- she had skipped multiple years in school -- where she met someone else who had had a minor hit. The boy who performed under the name Jerry Landis had released \"Hey! Schoolgirl\", an Everly Brothers knockoff, with a friend, as Tom and Jerry:\n\n[Excerpt: Tom and Jerry, \"Hey! Schoolgirl\"]\n\nLandis and King started working together, recording demos for other writers, though never writing together. For some of those demos, they re-used the Cosines name, like on this one for a song by Marty Kalfin:\n\n[Excerpt: The Cosines, \"Just to Be With You\"]\n\nThey were quite proud when the arrangement they came up with for that demo was copied exactly for the finished record, which made the lower regions of the Hot One Hundred:\n\n[Excerpt: The Passions, \"Just to Be With You\"]\n\nThey didn't work together for very long, and Jerry Landis went on to record under other names like \"True Taylor\" and \"Paul Kane\", before getting back together with Tom, and deciding to work together under their real names. We'll be hearing more of Paul Simon and his partner Art Garfunkel in future episodes.\n\nSomeone else she met while at college was the man who was to become her first husband, another Gerry -- Gerry Goffin. Goffin impressed her with his looks the first time she saw him -- he looked exactly like a drawing she had clipped out of a magazine, which looked to her like the perfect boyfriend.\n\nGoffin impressed her less, though, with his studied dislike of rock and roll music, but was suddenly keen to write a song with her when she mentioned that she'd been selling songs. He'd been trying to write a musical, but he was primarily a lyricist, and couldn't do much with music.\n\nKing mentioned that she knew that Atlantic were looking for a new song for Mickey and Sylvia, and the two of them worked on a song based on the style of \"Love is Strange\", which they completed very quickly, and took to Atlantic. Unfortunately, when they got there, they were told that Mickey and Sylvia had split up, but that their song would be suitable for the new duo they'd put together to continue the act -- Mickey and Kitty:\n\n[Excerpt: Mickey and Kitty, \"The Kid Brother\"]\n\nThat was released as a B-side. The A-side, \"Ooh Sha La La\" was written by Neil Sedaka and Howie Greenfield:\n\n[Excerpt: MIckey and Kitty, \"Ooh Sha La La\"]\n\nSedaka and Greenfield had become hot songwriters, and around this time Sedaka was also becoming a successful performer. His first hit as a performer, \"Oh Carol\", was in fact written about Carole King:\n\n[Excerpt: Neil Sedaka, \"Oh Carol\"]\n\nAnd King herself recorded an answer record to that, with new lyrics by Goffin:\n\n[Excerpt: Carole King, \"Oh Neil\"]\n\nBy the time she was seventeen, King was married to Goffin, and pregnant with his child. Goffin was working a day job, and they were treating the occasional twenty-five dollar advance they got from writing songs as windfalls. But then, when she was on one of her visits to 1650 Broadway to sell songs, King bumped into Sedaka, who told her she should come and meet Al Nevins and Don Kirshner, the owners of Aldon Music.\n\nAldon is the publisher who, more than any single other company, was responsible for what became known as the Brill Building sound. Even though they weren't based in the actual Brill Building, which was at 1619 Broadway, but in 1650 Broadway, the companies in that second building were so associated with the Brill Building sound that you'll find almost every history of music misattributes them and places them there, and in most interviews, when you see people talking about the Brill Building, even people who worked in one or other building, they're as likely to be talking about 1650 as 1619.\n\nKirshner is someone we've met briefly before. He'd started out as a songwriter, working with his friend Bobby Darin on songs like \"I Want Elvis For Christmas\", which had been recorded by the Holly Twins with Eddie Cochran impersonating Elvis:\n\n[Excerpt: The Holly Twins and Eddie Cochran, \"I Want Elvis For Christmas\"]\n\nHowever, as Darin had moved into performance, Kirshner had gone into music publishing. He'd scored early success when working for Vanderbilt Music by bringing Al Lewis out of retirement. Lewis had been a hit songwriter in the thirties and forties, but hadn't done much for a while. But then Fats Domino had had a hit with \"Blueberry Hill\", a song Lewis had cowritten decades earlier, and Kirshner decided to pair Lewis with a black musician, Sylvester Bradford, and the two started writing hits together, notably \"Tears on My Pillow\" for Little Anthony and the Imperials:\n\n[Excerpt: Little Anthony and the Imperials, \"Tears on My Pillow\"]\n\nKirshner had then formed his own publishing company. He'd first approached Pomus and Shuman, and then Leiber and Stoller, to go into business with him, but he ended up with Al Nevins, who had been a musician and had also co-written \"Twilight Time\" with Buck Ram, which had been a hit in the forties and then later revived by the Platters:\n\n[Excerpt: The Platters, \"Twilight Time\"]\n\nKirshner and Nevins were looking for talented new songwriters, and they had signed up Sedaka and Greenfield, and also signed Paul Simon around this time, as well as another couple, Barry Mann and Cynthia Weill. When Carole King played them a few of the songs she'd co-written with Goffin, they signed Goffin and King to a three-year contract, with advances of one thousand dollars for the first year, two thousand for the second, and three thousand for the third, to be offset against their royalties.\n\nThis was a fortune for the young couple, and so they went from soul-crushing day jobs to... a day job, working in a cubicle.\n\nAldon had a very regimented system. Every writing team had a tiny cubicle, containing a piano and a couple of chairs, in which they would work during normal office hours. Kirshner's system was simple -- any time any new act had a hit, he would get all the songwriters in his office to try to write a follow-up to the hit, in the same style. Of the efforts to find a follow-up to \"Tonight's the Night\", Kirshner decided on one that Goffin and King had written.\n\n\"Will You Love Me Tomorrow?\" had lyrics that had rather more depth than most of the songs that were charting at the time. Goffin's initial dislike of rock and roll music had been because of what he perceived as its lyrical vacuity, and in \"Will You Love Me Tomorrow?\" he found a lyrical formula that would define girl groups from that point on -- a look at a kind of female adolescent emotion that had previously not been discussed in pop music. In this case the lyrics were from the point of view of a woman worrying that she's just a one-night stand, not someone the man cares about, and struck a chord with millions.\n\nBut King's music is at least as impressive. She modelled the song on \"There Goes My Baby\", and when Luther Dixon accepted the song for the Shirelles, she decided she would write a string arrangement for it like the one the Drifters had used. She'd never written for an orchestra before, so she got a book on arrangement out of the library, and looked through it quickly before writing the string arrangement overnight.\n\nThe group didn't like the song, thinking it sounded like a country song, but Luther Dixon insisted, and the result went to number one:\n\n[Excerpt: The Shirelles, \"Will You Love Me Tomorrow?\"]\n\nThe B-side to that single, a Luther Dixon song called \"Boys\", would also become a well-known track itself:\n\n[Excerpt: The Shirelles, \"Boys\"]\n\nTwo more top ten hits followed, and then the group's singles started doing less well again. To reverse the downward trend, Dixon brought in a song by another new writer, Burt Bacharach. Bacharach had written a song with Mack David -- the brother of his usual lyricist Hal David -- called \"I'll Cherish You\". Dixon liked the song, but thought the lyrics were a bit too sickly. He changed the lyrics around, making them instead about someone who still loves her boyfriend despite her friends telling her how bad he is, and retitling it \"Baby It's You\". For the record itself, he just used Bacharach's original demo and stuck Shirley's voice on top -- Shirley was the only member of the group to sing on the record, though it was still released as by the Shirelles. You can still hear Bacharach singing on the \"sha la la\"s:\n\n[Excerpt: The Shirelles, \"Baby It's You\"]\n\nThat returned them to the top ten, and the follow-up, \"Soldier Boy\", written by Dixon and Greenberg, became their second number one. Unfortunately, it would be their last. Dixon and Greenberg ended their relationship, and Dixon went on to a new job at Capitol Records. Various other people produced recordings for the Shirelles at Scepter, but none had the same success with them that Dixon did.\n\nIt didn't help that the girls were starting families, and at various times one or other member had to be replaced on the road while they were on maternity leave. The singer who replaced them for those shows was a session singer who Bacharach was producing for Scepter, named Dionne Warwick.\n\nTo make matters worse, the Shirelles discovered that Greenberg had been lying to them. They'd been told that their royalties were being put into a trust for them, for when they turned twenty-one, but they discovered that no such trust existed, and Greenberg had just been keeping their money. They entered into lawsuits against Scepter, but remained signed to the label, and so couldn't record for anyone else. Their career was destroyed.\n\nThey remained together in one lineup or another, with members coming and going, until the early eighties, when they all went their separate ways, though they all started their own lineups of Shirelles. These days Shirley tours under her married name as Shirley Alston Reeves and Her Shirelles, while Beverly Lee owns the rights to tour as The Shirelles with no modifiers. Addie Harris died in 1982, and Doris Coley in 2000.\n\nThe Shirelles were badly treated by their record company, and by history. They made some of the most important records of the sixties, and it was their success that led to the great boom in girl groups of the next few years -- the Supremes, the Marvelettes, the Crystals, the Ronettes, and the rest, all were following in the Shirelles' footsteps. Because they had their greatest success in that period between 1958 and 1964 which most rock historians treat as having nothing of interest in, they're almost ignored despite their huge influence on the musicians who followed them. But without them, the sound of sixties pop would have been vastly different, and to this day their greatest records sound as fresh and inspiring as the day they were recorded.",
  "itunes:subtitle": "Episode eighty-nine of A History of Rock Music in Five Hundred Songs looks at Will You Love Me Tomorrow? by the Shirelles, and at the beginnings of the Brill Building sound. Click the full post to read liner notes, links to more information, and a transc",
  "itunes:keywords": "ABC-Paramount Records,Ahmet Ertegun,Al Lewis,Al Nevins,Alan Freed,Aldon Music,Brill Building,Burt Bacharach,Carole King,Don Costa,Don Kirshner,Florence Greenberg,Freddy Bienstock,Gerry Goffin,girl groups,Hill and Range publishing,Jerry Wexler,Luther Dixon,Mickey and Sylvia,Neil Sedaka,Paul Simon,Simon and Garfunkel,The Shirelles,The Tokens,vocal groups",
  "itunes:episodeType": "full",
  "itunes:episode": 89,
  "content:encoded": "Episode eighty-nine of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Will You Love Me Tomorrow?\" by the Shirelles, and at the beginnings of the Brill Building sound. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/39174499\">\"Tom Dooley\" by the Kingston Trio</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-89-will-you-love-me-tomorrow/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are no biographies of the Shirelles in print, so I've used a variety of sources, including the articles on the Shirelles and Luther Dixon at <a href=\"http://tims.blackcat.nl\">This Is My Story</a>. The following books were also of some use:\n\n<a href=\"https://amzn.to/3275Sz8\">A Natural Woman</a> is Carole King's autobiography.\n\n<a href=\"https://amzn.to/325o24w\">Always Magic in the Air: The Bomp and Brilliance of the Brill Building Era</a> by Ken Emerson is a good overview of the whole scene.\n\n<a href=\"https://amzn.to/3iOneXx\">Girl Groups</a> by John Clemente contains potted biographies of many groups of the era.\n\nAnd <a href=\"https://amzn.to/38GqEHg\">Here Comes The Night: The Dark Soul of Bert Berns and the Dirty Business of Rhythm and Blues</a> by Joel Selvin goes into some detail about Scepter Records.\n\nI also referred to the liner notes of<a href=\"https://amzn.to/323APUN\"> this CD</a>, which contains most of the Shirelles tracks worth owning.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWe're currently in a patch of rock and roll history that is ludicrously undocumented. There is book after book about the major stars of the early rock and roll era -- while you won't find much out there on a lot of truly important artists, you can find out enough about Elvis and Ray Charles and Johnny Cash and Little Richard and Chuck Berry and the rest -- these are all romantic figures of legend, the Titans who were defeated in the Titanomachy that was the mid-sixties Beat boom. And of course, there are many many, books on almost every band of the mid to late sixties to even have a minor hit.\n\nBut the period from 1958 through 1964 is generally summed up by \"and there were some whitebread nonentities like Fabian and Frankie Avalon\". Occasionally, in some of the books, there is a slightly more subtle approach taken, and the summary is \"there were some whitebread nonentities like Fabian and Frankie Avalon, and also Roy Orbison and one or two others made a decent record\".\n\nBut there were many other people making great records -- people who made hits that are still staples of oldies radio in a way that a lot of records from a few years later aren't; records that still sound like they're fresh new records made by people who have ideas.\n\nToday we're going to talk about a few of those people, and about one of those great records. We're going to look at the Brill Building, and some of the songwriters who worked there, and at the great record producer Luther Dixon, and at the Shirelles, and their record \"Will You Love Me Tomorrow?\":\n\n[Excerpt: The Shirelles, \"Will You Love Me Tomorrow?\"]\n\nIt's been a little while since we looked at any of the early girl groups, but if you remember the episodes on the Bobettes and the Chantels, girl groups in the early years were largely a phenomenon based in New York, and that's more or less the case with the Shirelles, who didn't come from New York itself, but from Passaic New Jersey, about sixteen miles away. Shirley Owens, Doris Coley, Addie Harris and Beverly Lee met at school, and formed a group called the Poquellos, which is apparently Spanish for \"little birds\". As we've discussed previously, most of the early doo-wop groups were named after birds, and these girls were forming their group before girl groups became regarded as something separate from male vocal groups.\n\nOddly, the group that became the most successful of the early girl groups, and the one that more than any other set the template for all those that would follow, never wanted to become professional singers, and almost had to be forced against their will at every stage. Their first public performance, in fact, was as a punishment. They had been singing with each other in gym class, and not paying attention to the teacher, and so the teacher told them that, as a punishment, they would have to perform in the school talent contest, which they didn't want to do. They performed at the show, singing a song they'd made up themselves, \"I Met Him on a Sunday\", and went down a storm with the kids at the school. In particular, one of the girls there, Mary Jane Greenberg, insisted that the girls come and meet her mother, Florence.\n\nFlorence Greenberg was a bored suburban housewife, who until her mid-forties had concentrated on being a homemaker for her husband, who was an executive at a potato chip firm, and for her two children. In her spare time she mostly did things like run fundraisers for the local Republican party. But her son was interested in getting into the music business in some way, and her husband was friends with Freddy Bienstock, who worked for Hill and Range at the Brill Building, and whose job was choosing the songs that Elvis Presley would record. Bienstock invited Greenberg to come and visit him at Hill and Range's offices, and after spending a little time around the Brill Building, Greenberg became convinced that she should start her own record label, despite having no experience in the field whatsoever. She would often just go and hang around at a restaurant near the Brill Building to soak in the atmosphere.\n\nThe Poquellos were actually not at all interested in making a record, but Mary Jane kept insisting that they should meet with her mother anyway. It got to the point that the girls used to try to avoid her at school and hide from her, but she was insistent and eventually they relented, and went to see Mrs Greenberg. They auditioned for her in her front room, singing the same song they'd performed at the school talent contest. Mrs Greenberg decided that they were going to be the first group signed to her new label, Tiara Records, and they recorded the song they'd written, with Greenberg's musical son Stan producing and arranging, under the name Stan Green:\n\n[Excerpt: The Shirelles, \"I Met Him On A Sunday (Ronde Ronde)\"]\n\nStan wasn't the only person with a new name. The Poquellos were also renamed, to the Shirelles -- after Shirley Owens, but with the \"el\" ending to be reminiscent of the Chantels, and that was the name they would be known by from that point on. \"I Met Him On A Sunday\" was a minor local success, and was picked up by Decca Records, who bought the girls' contract out from Greenberg. They managed to get it to number fifty on the charts, but the two singles they recorded for Decca after that didn't have any success, and the label dropped them.\n\nThat might have been the end of the Shirelles, but Greenberg had remained their manager, and she had started up a new record label, Scepter Records, and signed them up to that instead of Tiara. Their first few singles for Scepter did nothing, but then a change in Scepter's staffing changed everything, not just for the Shirelles, but for the world of music.\n\nGreenberg was not a particularly musical person -- and indeed several of the people who worked for her would later mock some decisions she'd made when she'd used her own judgment about songs. But she surrounded herself with people who were musical. The director of A&R for Scepter was Wally Roker, who had originally been the bass singer in the Heartbeats, who'd had a top five hit with \"A Thousand Miles Away\" in 1956:\n\n[Excerpt: The Heartbeats, \"A Thousand Miles Away\"]\n\nRoker in turn introduced Greenberg to a friend of his, Luther Dixon. Greenberg and Dixon's initial meeting was just the length of one elevator ride, but that was long enough for them to exchange numbers and arrange to meet again. Soon Dixon was working for Greenberg at Scepter, and was also her lover.\n\nDixon had started out as a singer, joining a minor group called The Buddies, who had recorded singles like \"I Stole Your Heart\":\n\n[Excerpt: The Buddies, \"I Stole Your Heart\"]\n\nBut he had soon moved into songwriting. Dixon was a collaborator by nature, and his first big hit was written with a writing partner called Larry Harrison. \"Why Baby Why\" went to number five for Pat Boone in 1957:\n\n[Excerpt: Pat Boone, \"Why Baby Why\"]\n\nHe spent some time writing with Otis Blackwell, with whom he wrote \"All the Way Home\" for Bobby Darin:\n\n[Excerpt: Bobby Darin, \"All the Way Home\"]\n\nAnd at the time he met Greenberg, he had just written \"Sixteen Candles\" with Allyson Khent, a number two hit for the Crests:\n\n[Excerpt: The Crests, \"Sixteen Candles\"]\n\nGreenberg took him on as a staff writer and producer, and gave him a cut of the publishing rights for his songs -- almost unheard of at that time.\n\nThe first record he worked on for the Shirelles was also the group's first top forty hit. With Shirley Owens, Dixon wrote \"Tonight's the Night\". It was intended as a B-side to a song with a lead by Doris, but \"Tonight's the Night\" was an unexpected success and established Shirley firmly in the role of the group's lead singer:\n\n[Excerpt: The Shirelles, \"Tonight's the Night\"]\n\nThat went to number thirty-nine, and a competing version by the Chiffons also made the Hot One Hundred:\n\n[Excerpt: The Chiffons, \"Tonight's the Night\"]\n\nThe Shirelles were a hit group, and they needed a follow-up. And that's where Goffin and King enter our story...\n\nCarole King had, from a very early age, been a child prodigy with a particular talent for music. In her autobiography she talks about how when she was a child, her dad would have her, as a party trick, turn to the wall while he played notes on the piano and she called out which one he was playing. Apparently her father would claim she had perfect pitch, and this was not quite true -- she had relative pitch, which meant that once she heard one note she knew, she could tell all the rest of the notes from that, so her father would always start with middle C. But that sense of relative pitch is in itself an amazing talent for a tiny child -- I still can't do that with any great accuracy in my forties, and I've spent most of my life studying and playing music.\n\nBy the age of eight she had appeared in a couple of shows, including Ted Mack's Amateur Hour, which was a nationally broadcast show, performing in a duo with a friend, but she didn't know exactly what it was she wanted to do until she was thirteen, when she went on a date with Joel Zwick, who would later become known as the director of My Big Fat Greek Wedding among others -- one thing that seems to happen a lot in King's early life is getting to know people who would go on to become very successful. Zwick took her to an Alan Freed show at the Paramount in Brooklyn, where she saw LaVern Baker, BB King, Mickey Baker, the Moonglows, and several other R&B stars of the period.\n\nIt wasn't, though, seeing the musicians themselves that made Carol Klein, as she then was, want to go into rock and roll music, though that was certainly an inspiration, and she talks a lot about how that Freed show was her introduction to a whole world of music that was far from the whitebread pop on which she had grown up. Rather, it was almost a chance event. She and her date hung around the stage door to see if they could see any of the performers and get autographs. The group they were in accidentally got drawn in through the stage door when some people who were meant to be there were let in, and she got to see the performers hanging around backstage. She knew then, not that she wanted to be a performer herself, but that she wanted to be part of that world, someone that those performers knew and respected.\n\nShe started attending a stage school, where one of her classmates was Al Pacino, but after a short while she left, deciding that she wasn't cut out for the non-musical aspects of the school, and went back to a normal high school, where she formed her first group, the Cosines. along with Zwick.\n\nShe started writing songs when she heard a group from a rival local high school, Neil Sedaka and the Linc-Tones, singing a song called \"While I Dream\":\n\n[Excerpt: The Tokens \"While I Dream\"]\n\nSedaka had briefly dated her, and had co-written that song himself, with Howard Greenfield, and his group got a record deal under the name The Tokens. King figured that if he could do that, so could she. She started writing songs, and found she was good at melodies but not particularly great at lyrics. But she still thought she was good enough to do something. She decided that she was going to go and see Alan Freed, and play him some of her songs.\n\nFreed listened to her politely, and explained to her how, at the time, one went about becoming a professional songwriter for the R&B market. He told her to get the addresses of record labels from the phone book, go and try to play her songs to them, and explained how a publishing contract would work. The record label he mentioned to her specifically was Atlantic Records, so she tried that one first. Jerry Wexler and Ahmet Ertegun listened to her, and told her she had talent and to come back when she had more songs. It wasn't a rejection, but it wasn't the instant acceptance she'd hoped for.\n\nThe second label she went to was ABC-Paramount, where she saw Don Costa. Costa was head of A&R at the label, but also a musician himself. Around this time he had released a cover version of Bill Justis' \"Raunchy\", under the name Muvva Guitar Hubbard:\n\n[Excerpt: Muvva \"Guitar\" Hubbard, \"Raunchy\"]\n\nCosta would later go on to arrange and conduct for Frank Sinatra, and he also had a respectable career as a session guitarist, but Carol didn't know any of this when she went into his office and played through her songs for him. She was flabbergasted to find that, rather than just sign her to a publishing contract, he asked her to sign a recording contract as well. She was disappointed that he wasn't interested in signing the rest of her group -- he thought she was good enough by herself, without needing to hear the other three -- but not so disappointed that she didn't sign with him straight away.\n\nHer first few singles were solo compositions, and didn't do very much in terms of sales, partly because she still didn't consider herself especially good as a lyricist:\n\n[Excerpt: Carole King, \"The Right Girl\"]\n\nSo while she was trying to have a music career, she also went off to college, aged sixteen -- she had skipped multiple years in school -- where she met someone else who had had a minor hit. The boy who performed under the name Jerry Landis had released \"Hey! Schoolgirl\", an Everly Brothers knockoff, with a friend, as Tom and Jerry:\n\n[Excerpt: Tom and Jerry, \"Hey! Schoolgirl\"]\n\nLandis and King started working together, recording demos for other writers, though never writing together. For some of those demos, they re-used the Cosines name, like on this one for a song by Marty Kalfin:\n\n[Excerpt: The Cosines, \"Just to Be With You\"]\n\nThey were quite proud when the arrangement they came up with for that demo was copied exactly for the finished record, which made the lower regions of the Hot One Hundred:\n\n[Excerpt: The Passions, \"Just to Be With You\"]\n\nThey didn't work together for very long, and Jerry Landis went on to record under other names like \"True Taylor\" and \"Paul Kane\", before getting back together with Tom, and deciding to work together under their real names. We'll be hearing more of Paul Simon and his partner Art Garfunkel in future episodes.\n\nSomeone else she met while at college was the man who was to become her first husband, another Gerry -- Gerry Goffin. Goffin impressed her with his looks the first time she saw him -- he looked exactly like a drawing she had clipped out of a magazine, which looked to her like the perfect boyfriend.\n\nGoffin impressed her less, though, with his studied dislike of rock and roll music, but was suddenly keen to write a song with her when she mentioned that she'd been selling songs. He'd been trying to write a musical, but he was primarily a lyricist, and couldn't do much with music.\n\nKing mentioned that she knew that Atlantic were looking for a new song for Mickey and Sylvia, and the two of them worked on a song based on the style of \"Love is Strange\", which they completed very quickly, and took to Atlantic. Unfortunately, when they got there, they were told that Mickey and Sylvia had split up, but that their song would be suitable for the new duo they'd put together to continue the act -- Mickey and Kitty:\n\n[Excerpt: Mickey and Kitty, \"The Kid Brother\"]\n\nThat was released as a B-side. The A-side, \"Ooh Sha La La\" was written by Neil Sedaka and Howie Greenfield:\n\n[Excerpt: MIckey and Kitty, \"Ooh Sha La La\"]\n\nSedaka and Greenfield had become hot songwriters, and around this time Sedaka was also becoming a successful performer. His first hit as a performer, \"Oh Carol\", was in fact written about Carole King:\n\n[Excerpt: Neil Sedaka, \"Oh Carol\"]\n\nAnd King herself recorded an answer record to that, with new lyrics by Goffin:\n\n[Excerpt: Carole King, \"Oh Neil\"]\n\nBy the time she was seventeen, King was married to Goffin, and pregnant with his child. Goffin was working a day job, and they were treating the occasional twenty-five dollar advance they got from writing songs as windfalls. But then, when she was on one of her visits to 1650 Broadway to sell songs, King bumped into Sedaka, who told her she should come and meet Al Nevins and Don Kirshner, the owners of Aldon Music.\n\nAldon is the publisher who, more than any single other company, was responsible for what became known as the Brill Building sound. Even though they weren't based in the actual Brill Building, which was at 1619 Broadway, but in 1650 Broadway, the companies in that second building were so associated with the Brill Building sound that you'll find almost every history of music misattributes them and places them there, and in most interviews, when you see people talking about the Brill Building, even people who worked in one or other building, they're as likely to be talking about 1650 as 1619.\n\nKirshner is someone we've met briefly before. He'd started out as a songwriter, working with his friend Bobby Darin on songs like \"I Want Elvis For Christmas\", which had been recorded by the Holly Twins with Eddie Cochran impersonating Elvis:\n\n[Excerpt: The Holly Twins and Eddie Cochran, \"I Want Elvis For Christmas\"]\n\nHowever, as Darin had moved into performance, Kirshner had gone into music publishing. He'd scored early success when working for Vanderbilt Music by bringing Al Lewis out of retirement. Lewis had been a hit songwriter in the thirties and forties, but hadn't done much for a while. But then Fats Domino had had a hit with \"Blueberry Hill\", a song Lewis had cowritten decades earlier, and Kirshner decided to pair Lewis with a black musician, Sylvester Bradford, and the two started writing hits together, notably \"Tears on My Pillow\" for Little Anthony and the Imperials:\n\n[Excerpt: Little Anthony and the Imperials, \"Tears on My Pillow\"]\n\nKirshner had then formed his own publishing company. He'd first approached Pomus and Shuman, and then Leiber and Stoller, to go into business with him, but he ended up with Al Nevins, who had been a musician and had also co-written \"Twilight Time\" with Buck Ram, which had been a hit in the forties and then later revived by the Platters:\n\n[Excerpt: The Platters, \"Twilight Time\"]\n\nKirshner and Nevins were looking for talented new songwriters, and they had signed up Sedaka and Greenfield, and also signed Paul Simon around this time, as well as another couple, Barry Mann and Cynthia Weill. When Carole King played them a few of the songs she'd co-written with Goffin, they signed Goffin and King to a three-year contract, with advances of one thousand dollars for the first year, two thousand for the second, and three thousand for the third, to be offset against their royalties.\n\nThis was a fortune for the young couple, and so they went from soul-crushing day jobs to... a day job, working in a cubicle.\n\nAldon had a very regimented system. Every writing team had a tiny cubicle, containing a piano and a couple of chairs, in which they would work during normal office hours. Kirshner's system was simple -- any time any new act had a hit, he would get all the songwriters in his office to try to write a follow-up to the hit, in the same style. Of the efforts to find a follow-up to \"Tonight's the Night\", Kirshner decided on one that Goffin and King had written.\n\n\"Will You Love Me Tomorrow?\" had lyrics that had rather more depth than most of the songs that were charting at the time. Goffin's initial dislike of rock and roll music had been because of what he perceived as its lyrical vacuity, and in \"Will You Love Me Tomorrow?\" he found a lyrical formula that would define girl groups from that point on -- a look at a kind of female adolescent emotion that had previously not been discussed in pop music. In this case the lyrics were from the point of view of a woman worrying that she's just a one-night stand, not someone the man cares about, and struck a chord with millions.\n\nBut King's music is at least as impressive. She modelled the song on \"There Goes My Baby\", and when Luther Dixon accepted the song for the Shirelles, she decided she would write a string arrangement for it like the one the Drifters had used. She'd never written for an orchestra before, so she got a book on arrangement out of the library, and looked through it quickly before writing the string arrangement overnight.\n\nThe group didn't like the song, thinking it sounded like a country song, but Luther Dixon insisted, and the result went to number one:\n\n[Excerpt: The Shirelles, \"Will You Love Me Tomorrow?\"]\n\nThe B-side to that single, a Luther Dixon song called \"Boys\", would also become a well-known track itself:\n\n[Excerpt: The Shirelles, \"Boys\"]\n\nTwo more top ten hits followed, and then the group's singles started doing less well again. To reverse the downward trend, Dixon brought in a song by another new writer, Burt Bacharach. Bacharach had written a song with Mack David -- the brother of his usual lyricist Hal David -- called \"I'll Cherish You\". Dixon liked the song, but thought the lyrics were a bit too sickly. He changed the lyrics around, making them instead about someone who still loves her boyfriend despite her friends telling her how bad he is, and retitling it \"Baby It's You\". For the record itself, he just used Bacharach's original demo and stuck Shirley's voice on top -- Shirley was the only member of the group to sing on the record, though it was still released as by the Shirelles. You can still hear Bacharach singing on the \"sha la la\"s:\n\n[Excerpt: The Shirelles, \"Baby It's You\"]\n\nThat returned them to the top ten, and the follow-up, \"Soldier Boy\", written by Dixon and Greenberg, became their second number one. Unfortunately, it would be their last. Dixon and Greenberg ended their relationship, and Dixon went on to a new job at Capitol Records. Various other people produced recordings for the Shirelles at Scepter, but none had the same success with them that Dixon did.\n\nIt didn't help that the girls were starting families, and at various times one or other member had to be replaced on the road while they were on maternity leave. The singer who replaced them for those shows was a session singer who Bacharach was producing for Scepter, named Dionne Warwick.\n\nTo make matters worse, the Shirelles discovered that Greenberg had been lying to them. They'd been told that their royalties were being put into a trust for them, for when they turned twenty-one, but they discovered that no such trust existed, and Greenberg had just been keeping their money. They entered into lawsuits against Scepter, but remained signed to the label, and so couldn't record for anyone else. Their career was destroyed.\n\nThey remained together in one lineup or another, with members coming and going, until the early eighties, when they all went their separate ways, though they all started their own lineups of Shirelles. These days Shirley tours under her married name as Shirley Alston Reeves and Her Shirelles, while Beverly Lee owns the rights to tour as The Shirelles with no modifiers. Addie Harris died in 1982, and Doris Coley in 2000.\n\nThe Shirelles were badly treated by their record company, and by history. They made some of the most important records of the sixties, and it was their success that led to the great boom in girl groups of the next few years -- the Supremes, the Marvelettes, the Crystals, the Ronettes, and the rest, all were following in the Shirelles' footsteps. Because they had their greatest success in that period between 1958 and 1964 which most rock historians treat as having nothing of interest in, they're almost ignored despite their huge influence on the musicians who followed them. But without them, the sound of sixties pop would have been vastly different, and to this day their greatest records sound as fresh and inspiring as the day they were recorded.",
  "enclosure": "",
  "itunes:summary": "Episode eighty-nine of A History of Rock Music in Five Hundred Songs looks at \"Will You Love Me Tomorrow?\" by the Shirelles, and at the beginnings of the Brill Building sound. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Tom Dooley\" by the Kingston Trio.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are no biographies of the Shirelles in print, so I've used a variety of sources, including the articles on the Shirelles and Luther Dixon at This Is My Story. The following books were also of some use:\n\nA Natural Woman is Carole King's autobiography.\n\nAlways Magic in the Air: The Bomp and Brilliance of the Brill Building Era by Ken Emerson is a good overview of the whole scene.\n\nGirl Groups by John Clemente contains potted biographies of many groups of the era.\n\nAnd Here Comes The Night: The Dark Soul of Bert Berns and the Dirty Business of Rhythm and Blues by Joel Selvin goes into some detail about Scepter Records.\n\nI also referred to the liner notes of this CD, which contains most of the Shirelles tracks worth owning.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWe're currently in a patch of rock and roll history that is ludicrously undocumented. There is book after book about the major stars of the early rock and roll era -- while you won't find much out there on a lot of truly important artists, you can find out enough about Elvis and Ray Charles and Johnny Cash and Little Richard and Chuck Berry and the rest -- these are all romantic figures of legend, the Titans who were defeated in the Titanomachy that was the mid-sixties Beat boom. And of course, there are many many, books on almost every band of the mid to late sixties to even have a minor hit.\n\nBut the period from 1958 through 1964 is generally summed up by \"and there were some whitebread nonentities like Fabian and Frankie Avalon\". Occasionally, in some of the books, there is a slightly more subtle approach taken, and the summary is \"there were some whitebread nonentities like Fabian and Frankie Avalon, and also Roy Orbison and one or two others made a decent record\".\n\nBut there were many other people making great records -- people who made hits that are still staples of oldies radio in a way that a lot of records from a few years later aren't; records that still sound like they're fresh new records made by people who have ideas.\n\nToday we're going to talk about a few of those people, and about one of those great records. We're going to look at the Brill Building, and some of the songwriters who worked there, and at the great record producer Luther Dixon, and at the Shirelles, and their record \"Will You Love Me Tomorrow?\":\n\n[Excerpt: The Shirelles, \"Will You Love Me Tomorrow?\"]\n\nIt's been a little while since we looked at any of the early girl groups, but if you remember the episodes on the Bobettes and the Chantels, girl groups in the early years were largely a phenomenon based in New York, and that's more or less the case with the Shirelles, who didn't come from New York itself, but from Passaic New Jersey, about sixteen miles away. Shirley Owens, Doris Coley, Addie Harris and Beverly Lee met at school, and formed a group called the Poquellos, which is apparently Spanish for \"little birds\". As we've discussed previously, most of the early doo-wop groups were named after birds, and these girls were forming their group before girl groups became regarded as something separate from male vocal groups.\n\nOddly, the group that became the most successful of the early girl groups, and the",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode eighty-nine of A History of Rock Music in Five Hundred Songs looks at \"Will You Love Me Tomorrow?\" by the Shirelles, and at the beginnings of the Brill Building sound. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Tom Dooley\" by the Kingston Trio.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are no biographies of the Shirelles in print, so I've used a variety of sources, including the articles on the Shirelles and Luther Dixon at This Is My Story. The following books were also of some use:\n\nA Natural Woman is Carole King's autobiography.\n\nAlways Magic in the",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}