{
  "title": "SciPy Mission -- What's next?",
  "link": "",
  "updated": "2022-07-19T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2022/07/19/scipy-mission",
  "content": "<p>We just returned from the annual SciPy conference full of energy as usual.\nThis conference is unique because it includes core maintainers from most of the\ncore Python data projects (Jupyter, Pandas, Numpy, Scikit-Learn, Dask, Xarray,\nNumba, Matplotlib and many more).  It’s an accident of history that we all\ntransitioned into software development from scientific careers.  It’s a\nwonderful community of science nerds that unexpectedly changed the world.</p>\n\n<p>This community is also wonderful because everyone opted in to it.  While today\nthese developers can take home $500k+ salaries, ten or twenty years ago this\nwas a thankless labor of trying to make the world better in our spare time.\nThe folks who showed up at that time are, invariably, wonderful.\nThey were all <em>mission driven</em>.  That mission evolved over time:</p>\n\n<h3 id=\"mission-1--write-software-to-accelerate-science\">Mission 1:  Write software to accelerate science</h3>\n\n<p>At first, we were all just trying to cobble together software that would\naccelerate our own research or the research of our colleagues.</p>\n\n<p>We succeeded.</p>\n\n<h3 id=\"mission-2-write-software-to-enable-society-to-understand-data\">Mission 2: Write software to enable society to understand data</h3>\n\n<p>Then projects like Pandas and Scikit-Learn came about, and the data science and\nmachine learning revolutions arose.  Suddenly this code was useful not just in\nscientific labs, but in banks and hedge funds and insurance companies and\nbig agriculture and everywhere else.  We then tried to shift the stack to be\nmore useful for these domains.</p>\n\n<p>We succeeded. We weren’t just accelerating science, we were the de-facto platform on\nwhich the worlds data science ran.</p>\n\n<h3 id=\"mission-3-get-paid\">Mission 3: Get paid</h3>\n\n<p>Cool.  We had accomplished our original mission, and then some.\nMost hallway conversation at this point shifted to funding models.</p>\n\n<ul>\n  <li>Could we find a postdoc that would pay us to write just software?</li>\n  <li>Are professorships off the table?</li>\n  <li>Did you hear about company X that just pays for a person to write OSS?</li>\n</ul>\n\n<p>We succeeded and we did get jobs.  These were new jobs and career paths often created just\nfor us.  It was great.</p>\n\n<h3 id=\"mission-4-sustainable-open-source\">Mission 4: Sustainable open source</h3>\n\n<p>After working 60 hour weeks on things that we loved, many of us grew tired, and\nstarted wondering how to get even more people paid to do this.  We shifted to\nthinking about larger funding models?</p>\n\n<ul>\n  <li>Could we get government grants to sustain OSS?</li>\n  <li>How about philanthropic agencies?</li>\n  <li>Maybe consulting companies are the answer?</li>\n  <li>Should we be making our own product companies?</li>\n</ul>\n\n<p>And so many of us did this as well.  My sense is that we’re succeeding today.</p>\n\n<h3 id=\"success\">Success</h3>\n\n<p>Due either to effort and genius or to a sequence of fortunate historical\naccidents, the SciPy community has been wildly successful at these missions.\nThis software stack is among the most widespread and most impactful in the\nworld.  The original developers of the stack are financially secure and well\nrespected (sometimes wildly so) and we have money pouring into the ecosystem\nfrom a diverse array of funding sources.</p>\n\n<p>To make this explicit, I’m going to list a few folks from my generation here:</p>\n\n<ol>\n  <li>Chelle Gentemann (Panegeo) runs TOPS, an open source initiative at NASA with\n$10,000,000 annual budget to transform NASA to open science</li>\n  <li>Gael Varoquaux (Scikit-Learn) runs a research lab at INRIA, and does\nthings like brief the French president</li>\n  <li>Andy Mueller (Scikit-Learn) works at Microsoft and says things like “I can\npretty much work on whatever I want”</li>\n  <li>Brian Grainger (Jupyter) works at Amazon, helping them to productize\nJupyter in Sagemaker</li>\n  <li>Ralf Gommers (Numpy) leads Quansight labs, supporting OSS projects through\nindustry collaboration</li>\n  <li>Katy Huff (Nuclear) is the assistant secretary of energy for the US\ngovernment, literally the ranking nuclear engineer in the country</li>\n  <li>Joe Hamman (Xarray) co-started CarbonPlan, a non-profit to help the world\nunderstand carbon sequestration technologies</li>\n  <li>… I could go on for quite a while</li>\n</ol>\n\n<p><em>We’re well paid.</em>\n<em>We have budget.</em>\n<em>We have headcount.</em>\n<em>We have the attention of the world.</em></p>\n\n<p>What do we do next?</p>\n\n<p>I asked the question of what our next mission should be of a variety of folks\nat SciPy and heard several answers.  I’d like to share them below.</p>\n\n<h3 id=\"relax\">Relax</h3>\n\n<p><em>By Matthew Rocklin</em></p>\n\n<p>First, just to set expectations, it’s totally ok for us to all just go and buy\nhouses along some lake and drink beer together.  It’s ok to be done if we think\nthat we’ve accomplished our mission and retire off to some comfortable and\nwell-earned normal career.</p>\n\n<p>What are some other possibilities though?</p>\n\n<h3 id=\"scipy-the-next-generation\">SciPy: The Next Generation</h3>\n\n<p><em>By Jason Grout, Jupyter / Databricks</em></p>\n\n<p>We’re just one generation in a sequence of generations.\nJust as our generation was enabled by earlier folks (Travis, Peter, Brian,\nFernando) we should make space and opportunities for the next generation coming\ninto their own now.</p>\n\n<h3 id=\"universal-data-access\">Universal Data Access</h3>\n\n<p><em>By Andy Mueller, Scikit-Learn / Microsoft</em></p>\n\n<p>Public data and metadata should be universally accessible, and a project of the\nsize and scope of the space program or US interstate highway system.</p>\n\n<p>Today we have lots of data, yes, but it’s not universally accessible or\nunderstandable.  We should invest in data access technologies and metadata\nstandards to allow the world to ask questions without munging.</p>\n\n<h3 id=\"universal-education\">Universal Education</h3>\n\n<p><em>By Paige Bailey, Tensorflow/Jax / Google AI</em></p>\n\n<p>Data/ML/AI may no longer require a PhD, but it does require substantial\neducation and resources.  We need to continue pushing on both increased\naccessibility and also increased education so that data driven thinking and\ninsights are available to the entire populace from a young age.</p>\n\n<p>The Data-8 program at UC Berkeley is a wonderful case study of this.  We should\ngo further.</p>\n\n<h3 id=\"science-in-production\">Science in Production</h3>\n\n<p><em>By Joe Hamman, Xarray / Carbon Plan</em></p>\n\n<p>We need to move beyond writing papers.</p>\n\n<p>We have excellent tools, let’s use them to change the world.</p>\n\n<h3 id=\"opt-in-value-driven-communities-are-fun\">Opt-in value driven communities are fun</h3>\n\n<p>I’ve loved working with these folks over the last decade.\nWe all came together not because it paid well or because it furthered our\ncareers.  We came together because we believed in something, and we worked\ntogether to achieve it.  This was both fulfilling and fun.  Thank you all for\nthe experience.</p>\n\n<p>I’d love to work with you all again in something that we all believe in.  We\nall have more agency.  I look forward to seeing the emergence of future\nmissions, like those mentioned above.</p>"
}