{
  "title": "Week 3: Three Ways of Creating Value",
  "link": "",
  "updated": "2014-06-22T00:00:00-07:00",
  "id": "http://carlshan.com/2014/06/22/dssg-week3",
  "content": "<h1 id=\"week-3-three-ways-of-creating-value\">Week 3: Three Ways of Creating Value</h1>\n\n<p class=\"meta\">22 June 2014 - Chicago</p>\n\n<p><em>This is the third in a series of posts chronicling my reflections on participating in the 2014 Data Science for Social Good Fellowship at the University of Chicago.</em>\n<em>You can read the first two posts here:</em></p>\n\n<ul>\n  <li><a href=\"http://www.carlshan.com/2014/06/08/dssg-week1.html\"><em>Week 1: It’s not about the data, it’s about the problems you’re solving.</em></a></li>\n  <li><a href=\"http://www.carlshan.com/2014/06/15/dssg-week2.html\"><em>Week 2: Why Doing Data Science in Non Profits is Different from Industry</em></a></li>\n</ul>\n\n<p><em>To get automatically notified about new posts, you can subscribe by clicking <a href=\"https://carlshan.wufoo.com/forms/join-other-readers/\">here</a>. You can also subscribe via RSS to this blog to get updates.</em></p>\n\n<hr />\n\n<p>Non profits and cutting edge.</p>\n\n<p>Two ideas that are almost never associated with one another.</p>\n\n<p>A few days ago, a friend and I were discussing exactly this issue: working in the non-profit sector typically means that you will not be working at the cutting edge of technology.</p>\n<h2 id=\"non-profits-and-innovation\">Non Profits and Innovation</h2>\n\n<p>Most non-profits do not consider themselves technology organizations, and as a result they do not align their resources towards focusing on expanding the technical frontier. And even if a non-profit did set its sights on inventing the newest technological gadget, they would likely lack the bank account balance and technical talent to actualize this goal.[1]</p>\n\n<p>However, while it may be true that working in the non-profit space is unlikely to yield a return for those looking to work on The Next Big Invention, I believe that there is another compelling opportunity to create immense social value that is unique to the non-profit space.</p>\n\n<p>But in order to properly explain my idea, I will first need to elucidate two other ways that I see of creating value.</p>\n\n<h2 id=\"value-through-new-organizational-models\">Value Through New Organizational Models</h2>\n\n<p>In 1996, when Rebecca Onie was a sophomore at Harvard College, she came across a brilliant strategy to improve the health conditions for underserved populations. While volunteering at an organization that provided legal counsel to the poor, Rebecca found herself speaking with many clients who had serious health issues stemming from their poverty. Sick children with terrible asthma were living in moldy homes. Impoverished families suffered from onsets of various diseases, all caused by a lack of adequate nutrition.</p>\n\n<p>Rebecca saw that modern medicine would be largely ineffective against these issues. Asthma medication, no matter how good, will not be able to counter the effects of a dusty and dilapidated apartment on a child’s lungs. Doctors were trained to treat medical ills, not social ones.</p>\n\n<p>This experience helped her crystallize an idea that would turn into an organization called Health Leads.[2]</p>\n\n<p>Nowadays, in clinics where Health Leads operates, doctors can “prescribe” patients to visit a Health Leads Advocate who will work one-on-one with each individual to ensure that they receive the basic resources (food, clean water, housing improvements) required to live a healthy life. In 2013, Health Leads worked with <a href=\"https://healthleadsusa.org/what-we-do/strategy-impact/\">over 11,000 patients</a> to help them acquire the resources they need. This is preventative health care at its finest.</p>\n\n<p>I believe this story clearly illuminates the first way of creating social value: creating organizations that, through a novel operational model, more accurately allocates resources towards solving a problem.</p>\n\n<h2 id=\"value-through-new-technologies\">Value Through New Technologies</h2>\n\n<p>On the West Coast, another method of delivering value is being championed: creating technologies that serve human needs and wants in more efficient and effective ways.</p>\n\n<p>But first, a clarification. Up until this point I’ve been using the terms ‘technology’ and ‘value’ rather loosely.</p>\n\n<p>To be more explicit, by technology I mean tools and machinery created through scientific research. This is to be distinguished from new organizational or social structures, which unlike technology, arise from novel arrangements of human relationships rather than novel arrangements of atoms and bits. Thus, while democracy was certainly an innovative idea when conceptualized in 6th century Athens, it was not a new technology.</p>\n\n<p>And by value, I mean the successful fulfillment of human needs and wants, moderated by considerations ethics and morality. Therefore social value is simply the fulfillment of society’s needs and wants, under the same constraints.[3]</p>\n\n<p>Going back to the value that technology is producing, there are obvious cases to observe: Uber’s success has come from an app that enables users to quickly snag a ride with the driver closest to them. The Khan Academy leverages the power of the Internet to serve up thousands of bite-sized videos, tutoring students on topics ranging from trigonometry to art history. Google is developing a cadre of revolutionary technologies, from self-driving cars that will reduce traffic-related accidents <a href=\"http://www.computerworld.com/s/article/9243518/Self_driving_cars_could_save_more_than_21_700_lives_450B_a_year\">by over 90%</a> to <a href=\"http://www.google.com/loon/\">hot air balloons that provide internet access</a> in developing countries.</p>\n\n<p>Simply put: new technologies can improve quality of life through creating better products and services that serve social needs and wants.</p>\n\n<p>It is through the combination of these two ways of creating value that I’ve identified and will discuss a third.</p>\n\n<h2 id=\"value-through-arbitrage\">Value Through Arbitrage</h2>\n\n<p>The writer William Gibson once observed, “The future is already here – it’s just not evenly distributed.”</p>\n\n<p>Most students who graduate from the best engineering or mathematics programs don’t think of going into the non profit space as their default job choice. The pay is lousy compared to for-profits, the field is generally regarded as slow-moving and it doesn’t seem to be a great way to kickstart a career.</p>\n\n<p>As a result, important public sectors such as education, government, health care and non profits see a <a href=\"http://www.fordfoundation.org/pdfs/news/afutureoffailure.pdf\">dearth of technical talent</a>.</p>\n\n<p>Simultaneously, the field of data science has grown to becoming a relatively mainstream division of numerous technology companies. Yet incredibly, few non profits have even adopted the idea of establishing clear organizational metrics, let alone employing data scientists!</p>\n\n<p>This is precisely where an organization like the Data Science for Social Good Fellowship comes into the picture.</p>\n\n<p>Through recruiting individuals who have both a high degree of technical competence as well as a desire to address a social cause, the Fellowship finds a third way of creating value: through human arbitrage. By human arbitrage, I mean the transferring of individuals with valuable skills from one field where it might be common to possess these skills to another where it is rare.</p>\n\n<p>Thus the innovation DSSG discovered is a relatively simple one: create a human capital pipeline that funnels people with valuable skills and abilities into important domains, where their backgrounds and skills are incredibly rare. Machine learning and computer science aren’t novel things in themselves, but applying them to the non profit space certainly is.</p>\n\n<p>Rather than creating new operational models, or inventing new technologies, DSSG melds the two together to form a potent third force.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>The sheer simplicity of this idea belies its powerful punch. Through this third path, data scientists working in the non-profit space can create social value that few others in the field can – rather than optimizing ad retargeting models, they can focus on solving problems that truly matter.</p>\n\n<p>I may not be working at the cutting edge of technology, but I do feel like I’m working at the cutting edge of defining a new way of creating value in the world.</p>\n\n<h2 id=\"footnotes\">Footnotes</h2>\n<p>[1] To be fair, most for-profit companies would also fail for the same reasons.</p>\n\n<p>[2] This summer, my team and I will be working with Health Leads to improve engagement levels with the patients that come to the organization. You can read a more <a href=\"http://dssg.io/projects/\">detailed description of my projects here</a>.</p>\n\n<p>[3] I recognize that the terms ‘ethics’ and ‘morality’ are themselves rather nebulous. However, rather than chasing down a rabbit hole of formally defining abstract terms until I reinvent the entire field of metaphysics, I would like to simply appeal to common understandings of these ideas.</p>\n\n<hr />\n\n<p><em>I write posts about data science applied to social causes. If you want to be notified when my next reflection is published, subscribe by <a href=\"https://carlshan.wufoo.com/forms/join-other-readers/\">clicking here</a>.</em></p>"
}