{
  "title": "Irish priest refuses to back down over LGBT &#039;hell&#039; stance",
  "link": "https://www.rt.com/news/565925-irish-priest-gay-sin-hell/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565925-irish-priest-gay-sin-hell/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6364293985f5404c79089de7.jpg\" /> An Irish Catholic priest has claimed that the country’s deputy prime minister will go to hell for being gay <br/><a href=\"https://www.rt.com/news/565925-irish-priest-gay-sin-hell/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Father Sean Sheehy has been condemned by his own bishop for giving a homily against abortion, homosexuality, and transgenderism</strong></p>\n            \n                        \n            <p>An Irish Catholic priest has refused to back down after he was censured by his own bishop for condemning the <em>&ldquo;mortal sins&rdquo;</em> of abortion and homosexuality. The priest maintains that his views are in line with the Church&rsquo;s teachings, and that Ireland&rsquo;s deputy prime minister, Leo Varadkar, will burn in hell for being gay.</p>\n<p>Father Sean Sheehy, a resident of Listowel in County Kerry, came out of retirement on Sunday to fill in for a local priest currently on a pilgrimage to the Holy Land. Churchgoers were shocked, with several dozen walking out of mass, when Sheehy took to the pulpit to denounce the <em>&ldquo;rampant&rdquo;</em> sin in Irish society.</p>\n<p><em>&ldquo;What is so sad today is you rarely hear about sin, but it&rsquo;s rampant,&rdquo;</em> he declared.</p>\n<p><em>&ldquo;We see it, for example, in the legislation of our governments,&rdquo;</em> Sheehy continued. <em>&ldquo;We see it in the promotion of abortion. We see it in the example of this lunatic approach of transgenderism. We see it, for example, in the promotion of sex between two men and two women.&rdquo;</em></p>\n<p><em>&ldquo;That is sinful, that is mortal sin,&rdquo;</em> he continued, adding that <em>&ldquo;sin leads to hell.&rdquo;</em></p>\n\n            <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">'Sin leads to hell' <br><br>This sermon led to an apology from the Bishop of Kerry <br><br>What are your thoughts? <a href=\"https://t.co/pBXVtjb5PG\">pic.twitter.com/pBXVtjb5PG</a></p>&mdash; Catholic Arena (@CatholicArena) <a href=\"https://twitter.com/CatholicArena/status/1587451912676413440?ref_src=twsrc%5Etfw\">November 1, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n    \n\n<p>Once a staunchly Catholic society, Ireland legalized gay marriage in 2015 and lifted its constitutional ban on abortion in 2018. Both decisions were made following popular referendums.</p>\n<p>Bishop Ray Browne of Kerry later apologized <em>&ldquo;to all who were offended&rdquo;</em> by Sheehy&rsquo;s fiery homily. In a statement published on the diocesan website, Browne said that Sheehy&rsquo;s views <em>&ldquo;do not represent the Christian position.&rdquo;</em> Browne later told Radio Kerry that Sheehy had been banned from giving mass in the diocese.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636277e220302724a45af1e6.jpg\" alt=\"Vladimir Legoyda\" />\n            <figcaption><a href=\"https://www.rt.com/russia/565816-russian-orthodox-church-lgbt/\">Russian Orthodox Church explains its attitude toward LGBT community</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>In an interview with the same radio station on Tuesday, Sheehy insisted that he did nothing wrong, and that his views on sin were in line with the Catechism of the Catholic Church. Speaking to RTE Radio on Wednesday, Sheehy said that gay politicians like Varadkar would <em>&ldquo;absolutely&rdquo;</em> go to hell if they didn&rsquo;t repent.</p>\n<p>Irish Foreign Minister Simon Coveney called on Sheehy to retract his remarks, while a spokesperson for Varadkar said that although the deputy PM <em>&ldquo;profoundly disagrees with Father Sheehy's views&rdquo;</em> he <em>&ldquo;respects his right to express his religious beliefs freely.&rdquo;&nbsp;</em></p>\n<p>The Catechism of the Catholic Church, which summarizes the Church&rsquo;s main beliefs, describes homosexual acts as <em>&ldquo;acts of grave depravity&rdquo;</em> that run <em>&ldquo;contrary to the natural law.&rdquo;</em> The book states that gay people <em>&ldquo;must be accepted with respect, compassion, and sensitivity,&rdquo;</em> but urged to suppress their desires.&nbsp;</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 21:14:22 +0000",
  "dc:creator": "RT"
}