{
  "title": "Episode 91: &#8220;The Twist&#8221; by Chubby Checker",
  "link": "https://500songs.com/podcast/episode-91-the-twist-by-chubby-checker/",
  "pubDate": "Sat, 25 Jul 2020 16:04:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=398",
  "description": "Episode ninety-one of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"The Twist\" by Chubby Checker, and how the biggest hit single ever had its roots in hard R&B. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/39694325\">\"Viens Danser le Twist\" by Johnny Hallyday</a>, a cover of a Chubby Checker record that became the first number one for France's biggest rock star.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\nAlso, people have asked me to start selling podcast merchandise, so you can now buy T-shirts from <a href=\"https://500-songs.teemill.com/\">https://500-songs.teemill.com/</a>. That store will be updated semi-regularly.\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-91-the-twist/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nMuch of the information in this episode comes from&nbsp;<a href=\"https://amzn.to/3eZTDYb\"><em>The Twist: The Story of the Song and Dance That Changed the World</em> </a>by Jim Dawson.\n\n<a href=\"https://amzn.to/3jDYa61\">This collection of Hank Ballard's fifties singles</a> is absolutely essential for any lover of R&B.\n\n<a href=\"https://amzn.to/3hAO0B8\">And this four-CD box set</a> contains all Chubby Checker's pre-1962 recordings, plus a selection of other Twist hits from 1961 and 62, including recordings by Johnny Hallyday, Bill Haley, Vince Taylor, and others.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nToday we're going to look at a record that achieved a feat that's unique in American history. It is the only non-Christmas-themed record -- ever -- to go to number one on the Billboard pop charts, drop off, and go back to number one again later. It's a record that, a year after it went to number one for the first time, started a craze that would encompass everyone from teenagers in Philadelphia to the first lady of the United States.\n\nWe're going to look at Chubby Checker, and at \"the Twist\", and how a B-side by a washed-up R&B group became the most successful record in chart history:\n\n[Excerpt: Chubby Checker, \"The Twist\"]\n\nOne of the groups that have been a perennial background player in our story so far has been Hank Ballard and the Midnighters. We talked about them most in the episode on \"The Wallflower\", which was based on their hit \"Work With Me Annie\", and they've cropped up in passing in a number of other places, most recently in the episode on Jackie Wilson. By 1958, though they were largely a forgotten group. Their style had been rooted in the LA R&B sound that had been pioneered by Johnny Otis, and which we talked so much about in the first year or so of this podcast. That style had been repeatedly swept away by the newer sounds that had come out of Memphis, Chicago, and New York, and they were yesterday's news. They hadn't had a hit in three years, and they were worried they were going to be dropped by their record label.\n\nBut they were still a popular live act, and they were touring regularly, and in Florida (some sources say they were in Tampa, others Miami) they happened to play on the same bill as a gospel group called the Sensational Nightingales, who were one of the best gospel acts on the circuit:\n\n[Excerpt: The Sensational Nightingales, \"Morning Train\"]\n\nThe Sensational Nightingales had a song, and they were looking for a group to sing it. They couldn't sing it themselves -- it was a secular song, and they were a gospel group -- but they knew that it could be a success if someone did. The song was called \"The Twist\", and it was based around a common expression from R&B songs that was usually used to mean a generic dance, though it would sometimes be used as a euphemism for sexual activity. There was, though, a specific dance move that was known as the twist, which was a sort of thrusting, grinding move. (It's difficult to get details of exactly what that move involved these days, as it wasn't a formalised thing at all). Twisting wasn't a whole dance itself, it was a movement that people included in other dances.\n\nTwisting in this sense had been mentioned in several songs. For example, in one of Etta James' sequels to \"The Wallflower\", she had sung:\n\n[Excerpt: Etta James, \"Good Rockin' Daddy\"]\n\nThere had been a lot of songs with lines like that, over the years, and the Sensational Nightingales had written a whole song along those lines. They'd first taken it to Joe Cook, of Little Joe and the Thrillers, who had had a recent pop hit with \"Peanuts\":\n\n[Excerpt: Little Joe and the Thrillers, \"Peanuts\"]\n\nBut the Sensational Nightingales were remembering an older song, \"Let's Do the Slop\", that had been an R&B hit for the group in 1954:\n\n[Excerpt: Little Joe and the Thrillers, \"Let's Do the Slop\"]\n\nThat song was very similar to the one by the Nightingales', which suggested that Little Joe might be the right person to do their song, but when Little Joe demoed it, he was dissuaded from releasing it by his record label, Okeh, because they thought it sounded too dirty. So instead the Nightingales decided to offer the song to the Midnighters.\n\nHank Ballard listened to the song and liked it, but he thought the melody needed tightening up. The song as the Sensational Nightingales sang it was a fifteen-bar blues, and fifteen bars is an awkward, uncommercial, number. So he and the Midnighters' guitarist Cal Green took the song that the Nightingales sang, and fit the lyrics to a pre-existing twelve-bar melody.\n\nThe melody they used was one they'd used previously -- on a song called \"Is Your Love For Real?\":\n\n[Excerpt: Hank Ballard and the Midnighters, \"Is Your Love For Real?\"]\n\nBut this was one of those songs whose melody had a long ancestry. \"Is Your Love For Real?\" had been inspired by a track by Clyde McPhatter and the Drifters, \"Whatcha Gonna Do?\":\n\n[Excerpt, Clyde McPhatter and the Drifters, \"Whatcha Gonna Do?\"]\n\nThat song is credited as having been written by Ahmet Ertegun, but listening to the gospel song \"Whatcha Gonna Do?\" by the Radio Four, from a year or so earlier, shows a certain amount of influence, shall we say, on the later song:\n\n[Excerpt: The Radio Four, \"Whatcha Gonna Do?\"]\n\nIncidentally, it took more work than it should to track down that song, simply because it's impossible to persuade search engines that a search for The Radio Four, the almost-unknown fifties gospel group, is not a search for Radio Four, the popular BBC radio station.\n\nInitially Ballard and Green took that melody and the twist lyrics, and set them to a Jimmy Reed style blues beat, but by the time they took the song into the studio, in November 1958, they'd changed it for a more straightforward beat, and added the intro they'd previously used on the song \"Tore Up Over You\":\n\n[Excerpt: Hank Ballard and the Midnighters, \"Tore Up Over You\"]\n\nThey apparently also changed the lyrics significantly -- there exists an earlier demo of the song, recorded as a demo for VeeJay when Ballard wasn't sure that Syd Nathan would renew his contract, with very different, more sexually suggestive, lyrics, which are apparently those that were used in the Sensational Nightingales' version.\n\nEither way, the finished song didn't credit the Nightingales, or Green – who ended up in prison for two years for marijuana possession around this time, and missed out on almost all of this story – or any of the writers of the songs that Ballard lifted from. It was released, with Ballard as the sole credited writer, as the B-side of a ballad called \"Teardrops on Your Letter\", but DJs flipped the single, and this went to number sixteen on the R&B chart:\n\n[Excerpt: Hank Ballard and the Midnighters, \"The Twist\"]\n\nAnd that should have been the end of the matter, and seemed like it would be, for a whole year. \"The Twist\" was recorded in late 1958, came out in very early 1959, and was just one of many minor R&B hits the Midnighters had. But then a confluence of events made that minor R&B hit into a major craze. The first of these events was that Ballard and the Midnighters released another dance-themed song, \"Finger-Poppin' Time\", which became a much bigger hit for them, thanks in part to an appearance on Dick Clark's TV show American Bandstand:\n\n[Excerpt: Hank Ballard and the Midnighters, \"Finger-Poppin' Time\"]\n\nThe success of that saw \"The Twist\" start to become a minor hit again, and it made the lower reaches of the chart.\n\nThe second event was also to do with Dick Clark. American Bandstand was at the time the biggest music show on TV -- at the time it ran for ninety minutes every weekday afternoon, and it was shown live, with a studio audience consisting almost entirely of white teenagers. Clark was very aware of what had happened to Alan Freed when Freed had shown Frankie Lymon dancing with a white girl on his show, and wasn't going to repeat Freed's mistakes.\n\nBut Clark knew that most of the things that would become cool were coming from black kids, and so there were several regulars in the audience who Clark knew went to black clubs and learned the latest dance moves. Clark would then get those teenagers to demonstrate those moves, while pretending they'd invented them themselves. Several minor dance crazes had started this way, and in 1960 Clark noticed what he thought might become another one.\n\nTo understand the dance that became the Twist, we have to go back to the late thirties, and to episode four of this podcast, the one on \"Choo Choo Ch'Boogie\". If you can remember that episode, we talked there about a dance that was performed in the Savoy Ballroom in New York in the late thirties, called the Lindy Hop.\n\nThere were two parts of the Lindy Hop. One of those was a relatively formalised dance, with the partners holding each other, swinging each other around, and so on. That part of the dance was later adopted by white people, and renamed the jitterbug. But there was another part of the dance, known as the breakaway, where the two dancers would separate and show off their own individual moves before coming back together. That would often involve twisting in the old sense, along with a lot of other movements. The breakaway part of the Lindy Hop was never really taken up by white culture, but it continued in black clubs.\n\nAnd these teenagers had copied the breakaway, as performed by black dancers, and they showed it to Clark, but they called the whole dance \"the Twist\", possibly because of Ballard's record. Clark thought it had the potential to become something he could promote through his TV shows, at least if they toned down the more overtly sexual aspects. But he needed a record to go with it.\n\nNow, there are several stories about why Clark didn't ask Hank Ballard and the Midnighters on to the show. Some say that they were simply busy elsewhere on tour and couldn't make the trip back, others that Clark wanted someone less threatening -- by which it's generally considered he meant less obviously black, though the artist he settled on is himself black, and that argument gets into a lot of things about colourism about which it's not my place to speak as a white British man. Others say that he wanted someone younger, others that he was worried about the adult nature of Ballard's act, and yet others that he just wanted a performer with whom he had a financial link -- Clark was one of the more obviously corrupt people in the music industry, and would regularly promote records with which he had some sort of financial interest. Possibly all of these were involved.\n\nEither way, rather than getting Hank Ballard and the Midnighters onto his shows to perform \"The Twist\", even as it had entered the Hot One Hundred at the lower reaches, Clark decided to get someone to remake the record. He asked Cameo-Parkway, a label based in Philadelphia, the city from which Clark's show was broadcast, and which was often willing to do \"favours\" for Clark, if they could do a remake of the record. This was pretty much a guaranteed hit for the label -- Clark was the single most powerful person in the music industry at this point, and if he plugged an artist they were going to be a success -- and so of course they said yes, despite the label normally being a novelty label, rather than dealing in rock and roll or R&B. They even had the perfect singer for the job.\n\nErnest Evans was eighteen years old, and had repeatedly tried and failed to get Cameo-Parkway interested in him as a singer, but things had recently changed for him. Clark had wanted to do an audio Christmas card for his friends -- a single with \"Jingle Bells\" sung in the style of various different singers. Evans had told the people at Cameo-Parkway he could do impressions of different singers, and so they'd asked him to record it. That recording was a private one, but Evans later did a rerecording of the song as a duet with Bobby Rydell, including the same impressions of Fats Domino, Elvis Presley, and the Chipmunks that he'd done on Clark's private copy, so you can hear what it sounded like:\n\n[Excerpt: Chubby Checker and Bobby Rydell, \"Jingle Bell Imitations\"]\n\nIt was that Fats Domino imitation, in particular, that gave Evans his stage name. Dick Clark's wife Barbara was there when he was doing the recording, and she called him \"Chubby Checker\", as a play on \"Fats Domino\".\n\nClark was impressed enough with the record that Cameo-Parkway decided to have the newly-named Chubby Checker make a record in the same style for the public, and his version of \"Mary Had a Little Lamb\" in that style, renamed \"The Class\" made number thirty-eight on the charts thanks to promotion from Clark:\n\n[Excerpt: Chubby Checker, \"The Class\"]\n\nTwo more singles in that vein followed, \"Whole Lotta Laughin'\" and \"Dancing Dinosaur\", but neither was a success. But Checker was someone known to Clark, someone unthreatening, someone on a label with financial connections to Clark, and someone who could do decent impressions. So when Clark wanted a record that sounded exactly like Hank Ballard and the Midnighters singing \"The Twist\", it was easy enough for Checker to do a Ballard impression:\n\n[Excerpt: Chubby Checker, \"The Twist\"]\n\nClark got Checker to perform that on The Dick Clark Show -- a different show from Bandstand, but one with a similar audience size -- and to demonstrate the toned-down version of the dance that would be just about acceptable to the television audience. This version of the dance basically consisted of miming towelling your buttocks while stubbing out a cigarette with your foot, and was simple enough that anyone could do it.\n\nChecker's version of \"The Twist\" went to number one, as a result of Clark constantly plugging it on his TV shows. It was so close to Ballard's version that when Ballard first heard it on the radio, he was convinced it was his own record. The only differences were that Checker's drummer plays more on the cymbals, and that Checker's saxophone player plays all the way through the song, rather than just playing a solo -- and King Records quickly got a saxophone player in to the studio to overdub an identical part on Ballard's track and reissue it, to make it sound more like the soundalike. Ballard's version of the song ended up going to number twenty-eight on the pop charts on Checker's coattails.\n\nAnd that should, by all rights, have been the end of the Twist. Checker recorded a series of follow-up hits over the next few months, all of them covers of older R&B songs about dances -- a version of \"The Hucklebuck\", a quick cover of Don Covay's \"Pony Time\", released only a few months before, which became Checker's second number one, and \"Dance the Mess Around\". All of these were hits, and it seemed like Chubby Checker would be associated with dances in general, rather than with the Twist in particular. In summer 1961 he did have a second Twist hit, with \"Let's Twist Again\" -- singing \"let's twist again, like we did last summer\", a year on from \"The Twist\":\n\n[Excerpt: Chubby Checker, \"Let's Twist Again\"]\n\nThat was written by the two owners of Cameo-Parkway, who had parallel careers as writers of novelty songs -- their first big hit had been Elvis' \"Teddy Bear\". But over the few months after \"Let's Twist Again\", Checker was back to non-Twist dance songs. But then the Twist craze proper started, and it started because of Joey Dee and the Starliters.\n\nJoey DiNicola was a classmate of the Shirelles, and when the Shirelles had their first hits, they'd told DiNicola that he should meet up with Florence Greenberg. His group had a rotating lineup, at one point including guitarist Joe Pesci, who would later become famous as an actor rather than as a musician, but the core membership was a trio of vocalists -- Joey Dee, David Brigati, and Larry Vernieri, all of whom would take lead vocals. They were one of the few interracial bands of the time, and the music they performed was a stripped-down version of R&B, with an organ as the dominant instrument -- the kind of thing that would later get known as garage rock or frat rock.\n\nGreenberg signed the Starliters to Scepter Records, and they released a couple of singles on Scepter, produced and written like much of the material on Scepter by Luther Dixon:\n\n[Excerpt: Joey Dee and the Starliters, \"Shimmy Baby\"]\n\nNeither of their singles on Scepter was particularly successful, but they became a popular live act around New Jersey, and got occasional gigs at venues in New York. They played a three-day weekend at a seedy working-class Mafia-owned bar called the Peppermint Lounge, in Manhattan. Their shows there were so successful that they got a residency there, and became the house band. Soon the tiny venue -- which had a capacity of about two hundred people -- was packed, largely with the band's fans from New Jersey -- the legal drinking age in New Jersey was twenty-one, while in New York it was eighteen, so a lot of eighteen- and nineteen-year-olds from New Jersey would make the journey.\n\nAs Joey Dee and the Starliters were just playing covers of chart hits for dancing, of course they played \"The Twist\" and \"Let's Twist Again\", and of course these audiences would dance the Twist to them. But that was happening in a million dingy bars and clubs up and down the country, with nobody caring. The idea that anyone would care about a tiny, dingy, bad-smelling bar and the cover band that played it was a nonsense.\n\nUntil it wasn't.\n\nBecause the owners of the Peppermint Lounge decided that they wanted a little publicity for their club, and they hired a publicist, who in turn got in touch with a company called Celebrity Services. What Celebrity Services did was, for a fee, they would get some minor celebrity or other to go to a venue and have a drink or a meal, and they would let the gossip columnists know about it, so the venue would then get a mention in the newspapers. Normally this would be one or two passing mentions, and nothing further would happen.\n\nBut this time it did. A couple of mentions in the society columns somehow intrigued enough people that some more celebrities started dropping in. The club was quite close to Broadway, and so a few of the stars of Broadway started popping in to see what the fuss was about. And then more stars started popping in to see what the other stars had been popping in for. Noel Coward started cruising the venue looking for rough trade, Judy Garland, Marilyn Monroe, and Tallulah Bankhead were regulars, Norman Mailer danced the Twist with the granddaughter of Lord Beaverbrook, and Tennessee Williams and even Greta Garbo turned up, all to either dance to Joey Dee and the Starliters or to watch the younger people dancing to them. There were even rumours, which turned out to be false, that Jackie Kennedy had gone to the Peppermint Lounge – though she did apparently enjoy dancing the Twist herself.\n\nThe Peppermint Lounge became a sensation, and the stories all focussed on the dance these people were doing.\n\n\"The Twist\" reentered the charts, eighteen months after it had first come out, and Morris Levy sprang into action. Levy wanted a piece of this new Twist thing, and since he didn't have Chubby Checker, he was going to get the next best thing. He signed Joey Dee and the Starliters to Roulette Records, and got Henry Glover in to produce them.\n\nHenry Glover is a figure who we really didn't mention as much as we should have in the first fifty or so episodes of the podcast. He'd played trumpet with Lucky Millinder, and he'd produced most of the artists on King Records in the late forties and fifties, including Wynonie Harris, Bill Doggett, and James Brown. He'd produced Little Willie John's version of \"Fever\", and wrote \"Drown in My Own Tears\", which had become a hit for Ray Charles.\n\nGlover had also produced Hank Ballard's original version of \"The Twist\", and now he was assigned to write a Twist song for Joey Dee and the Starliters. His song, \"Peppermint Twist\", became their first single on Roulette:\n\n[Excerpt: Joey Dee and the Starliters, \"Peppermint Twist\"]\n\n\"Peppermint Twist\" went to number one, and Chubby Checker's version of \"The Twist\" went back to number one, becoming the only record ever to do so during the rock and roll era. In fact, Checker's record, on its reentry, became so popular that as recently as 2018 Billboard listed it as the *all-time* number one record on the Hot One Hundred.\n\nThe Twist was a massive sensation, but it had moved first from working-class black adults, to working-class white teenagers, to young middle-class white adults, and now to middle-aged and elderly rich white people who thought it was the latest \"in\" thing. And so, of course, it stopped being the cool in thing with the teenagers, almost straight away. If you're young and rebellious, you don't want to be doing the same thing that your grandmother's favourite film star from when she was a girl is doing.\n\nBut it took a while for that disinterest on the part of the teenagers to filter through to the media, and in the meantime there were thousands of Twist cash-in records. There was a version of \"Waltzin' Matilda\" remade as \"Twistin' Matilda\", the Chipmunks recorded \"The Alvin Twist\". The Dovells, a group on Cameo Parkway who had had a hit with \"The Bristol Stomp\", recorded \"Bristol Twistin' Annie\", which managed to be a sequel not only to \"The Twist\", but to their own \"The Bristol Stomp\" and to Hank Ballard's earlier \"Annie\" recordings:\n\n[Excerpt: The Dovells, \"Bristol Twistin' Annie\"]\n\nThere were Twist records by Bill Haley, Neil Sedaka, Duane Eddy... almost all of these were terrible records, although we will, in a future episode, look at one actually good Twist single.\n\nThe Twist craze proper started in November 1961, and by December there were already two films out in the cinemas. Hey! Let's Twist! starred Joey Dee and the Starliters in a film which portrayed the Peppermint Lounge as a family-run Italian restaurant rather than a Mafia-run bar, and featured Joe Pesci in a cameo that was his first film role. Twist Around the Clock starred Chubby Checker and took a whole week to make. As well as Checker, it featured Dion, and the Marcels, trying desperately to have another hit after \"Blue Moon\":\n\n[Excerpt: The Marcels, \"Merry Twistmas”]\n\nTwist Around The Clock was an easy film to make because Sam Kurtzman, who produced it, had produced several rock films in the fifties, including Rock Around the Clock. He got the writer of that film to retype his script over a weekend, so it talked about twisting instead of rocking, and starred Chubby Checker instead of Bill Haley. As Kurtzman had also made Bill Haley's second film, Don't Knock The Rock, so Checker's second film became Don't Knock the Twist.\n\nChecker also appeared in a British film, It's Trad, Dad!, which we talked about last week. That was a cheap trad jazz cash-in, but at the last minute they decided to rework it so it included Twist music as well as trad, so the director, Richard Lester, flew to the USA for a couple of days to film Checker and a couple of other artists miming to their records, which was then intercut with footage of British teenagers dancing, to make it look like they were dancing to Checker.\n\nOf course, the Twist craze couldn't last forever, but Chubby Checker managed a good few years of making dance-craze singles, and he married Catharina Lodders, who had been Miss World 1962, in 1964. Rather amazingly for a marriage between a rock star and a beauty queen, they remain married to this day, nearly sixty years later.\n\nChecker's last big hit came in 1965, by which point the British Invasion had taken over the American charts so comprehensively that Checker was recording \"Do the Freddie\", a song about the dance that Freddie Garrity of Freddie and the Dreamers did on stage:\n\n[Excerpt: Chubby Checker, \"Do the Freddie\"]\n\nIn recent decades, Checker has been very bitter about his status. He's continued a career of sorts, even scoring a novelty hit in the late eighties with a hip-hop remake of \"The Twist\" with The Fat Boys, but for a long time his most successful records were unavailable. Cameo-Parkway was bought in the late sixties by Allen Klein, a music industry executive we'll be hearing more of, more or less as a tax writeoff, and between 1975 and 2005 there was no legal way to get any of the recordings on that label, as they went out of print and weren't issued on CD, so Checker didn't get the royalties he could have been getting from thirty years of nostalgia compilation albums. Recent interviews show that Checker is convinced he is the victim of an attempt to erase him from rock and roll history, and believes he deserves equal prominence with Elvis and the Beatles. He believes his lack of recognition is down to racism, as he married a white woman, and has protested outside the Rock and Roll Hall of Fame at his lack of induction. Whatever one's view of the artistic merits of his work, it's sad that someone so successful now feels so overlooked.\n\nBut the Twist fad, once it died, left three real legacies. One was a song we'll be looking at in a few months, and the other two came from Joey Dee and the Starliters. The Young Rascals, a group who had a series of hits from 1965 to 1970, started out as the instrumentalists in the 1964 lineup of Joey Dee and the Starliters before breaking out to become their own band, and a trio called Ronnie and the Relatives made their first appearances at the Peppermint Lounge, singing backing vocals and dancing behind the Starliters. They later changed their name to The Ronettes, and we'll be hearing more from them later.\n\nThe Twist was the last great fad of the pre-Beatles sixties. That it left so little of a cultural mark says a lot about the changes that were to come, and which would sweep away all memory of the previous few years...",
  "itunes:subtitle": "Episode ninety-one of A History of Rock Music in Five Hundred Songs looks at The Twist by Chubby Checker, and how the biggest hit single ever had its roots in hard R&B. Click the full post to read liner notes, links to more information, and a transcr",
  "itunes:keywords": "Cameo-Parkway Records,Chubby Checker,dance crazes,Dick Clark,Florence Greenberg,gospel,Hank Ballard,Henry Glover,It&#039;s Trad Dad,Joey Dee and the Starliters,King Records,Lindy hop,Luther Dixon,Morris Levy,Richard Lester,Roulette Records,Scepter Records,the Twist American Bandstand",
  "itunes:episodeType": "full",
  "itunes:episode": 91,
  "content:encoded": "Episode ninety-one of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"The Twist\" by Chubby Checker, and how the biggest hit single ever had its roots in hard R&B. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/39694325\">\"Viens Danser le Twist\" by Johnny Hallyday</a>, a cover of a Chubby Checker record that became the first number one for France's biggest rock star.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\nAlso, people have asked me to start selling podcast merchandise, so you can now buy T-shirts from <a href=\"https://500-songs.teemill.com/\">https://500-songs.teemill.com/</a>. That store will be updated semi-regularly.\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-91-the-twist/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nMuch of the information in this episode comes from&nbsp;<a href=\"https://amzn.to/3eZTDYb\"><em>The Twist: The Story of the Song and Dance That Changed the World</em> </a>by Jim Dawson.\n\n<a href=\"https://amzn.to/3jDYa61\">This collection of Hank Ballard's fifties singles</a> is absolutely essential for any lover of R&B.\n\n<a href=\"https://amzn.to/3hAO0B8\">And this four-CD box set</a> contains all Chubby Checker's pre-1962 recordings, plus a selection of other Twist hits from 1961 and 62, including recordings by Johnny Hallyday, Bill Haley, Vince Taylor, and others.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nToday we're going to look at a record that achieved a feat that's unique in American history. It is the only non-Christmas-themed record -- ever -- to go to number one on the Billboard pop charts, drop off, and go back to number one again later. It's a record that, a year after it went to number one for the first time, started a craze that would encompass everyone from teenagers in Philadelphia to the first lady of the United States.\n\nWe're going to look at Chubby Checker, and at \"the Twist\", and how a B-side by a washed-up R&B group became the most successful record in chart history:\n\n[Excerpt: Chubby Checker, \"The Twist\"]\n\nOne of the groups that have been a perennial background player in our story so far has been Hank Ballard and the Midnighters. We talked about them most in the episode on \"The Wallflower\", which was based on their hit \"Work With Me Annie\", and they've cropped up in passing in a number of other places, most recently in the episode on Jackie Wilson. By 1958, though they were largely a forgotten group. Their style had been rooted in the LA R&B sound that had been pioneered by Johnny Otis, and which we talked so much about in the first year or so of this podcast. That style had been repeatedly swept away by the newer sounds that had come out of Memphis, Chicago, and New York, and they were yesterday's news. They hadn't had a hit in three years, and they were worried they were going to be dropped by their record label.\n\nBut they were still a popular live act, and they were touring regularly, and in Florida (some sources say they were in Tampa, others Miami) they happened to play on the same bill as a gospel group called the Sensational Nightingales, who were one of the best gospel acts on the circuit:\n\n[Excerpt: The Sensational Nightingales, \"Morning Train\"]\n\nThe Sensational Nightingales had a song, and they were looking for a group to sing it. They couldn't sing it themselves -- it was a secular song, and they were a gospel group -- but they knew that it could be a success if someone did. The song was called \"The Twist\", and it was based around a common expression from R&B songs that was usually used to mean a generic dance, though it would sometimes be used as a euphemism for sexual activity. There was, though, a specific dance move that was known as the twist, which was a sort of thrusting, grinding move. (It's difficult to get details of exactly what that move involved these days, as it wasn't a formalised thing at all). Twisting wasn't a whole dance itself, it was a movement that people included in other dances.\n\nTwisting in this sense had been mentioned in several songs. For example, in one of Etta James' sequels to \"The Wallflower\", she had sung:\n\n[Excerpt: Etta James, \"Good Rockin' Daddy\"]\n\nThere had been a lot of songs with lines like that, over the years, and the Sensational Nightingales had written a whole song along those lines. They'd first taken it to Joe Cook, of Little Joe and the Thrillers, who had had a recent pop hit with \"Peanuts\":\n\n[Excerpt: Little Joe and the Thrillers, \"Peanuts\"]\n\nBut the Sensational Nightingales were remembering an older song, \"Let's Do the Slop\", that had been an R&B hit for the group in 1954:\n\n[Excerpt: Little Joe and the Thrillers, \"Let's Do the Slop\"]\n\nThat song was very similar to the one by the Nightingales', which suggested that Little Joe might be the right person to do their song, but when Little Joe demoed it, he was dissuaded from releasing it by his record label, Okeh, because they thought it sounded too dirty. So instead the Nightingales decided to offer the song to the Midnighters.\n\nHank Ballard listened to the song and liked it, but he thought the melody needed tightening up. The song as the Sensational Nightingales sang it was a fifteen-bar blues, and fifteen bars is an awkward, uncommercial, number. So he and the Midnighters' guitarist Cal Green took the song that the Nightingales sang, and fit the lyrics to a pre-existing twelve-bar melody.\n\nThe melody they used was one they'd used previously -- on a song called \"Is Your Love For Real?\":\n\n[Excerpt: Hank Ballard and the Midnighters, \"Is Your Love For Real?\"]\n\nBut this was one of those songs whose melody had a long ancestry. \"Is Your Love For Real?\" had been inspired by a track by Clyde McPhatter and the Drifters, \"Whatcha Gonna Do?\":\n\n[Excerpt, Clyde McPhatter and the Drifters, \"Whatcha Gonna Do?\"]\n\nThat song is credited as having been written by Ahmet Ertegun, but listening to the gospel song \"Whatcha Gonna Do?\" by the Radio Four, from a year or so earlier, shows a certain amount of influence, shall we say, on the later song:\n\n[Excerpt: The Radio Four, \"Whatcha Gonna Do?\"]\n\nIncidentally, it took more work than it should to track down that song, simply because it's impossible to persuade search engines that a search for The Radio Four, the almost-unknown fifties gospel group, is not a search for Radio Four, the popular BBC radio station.\n\nInitially Ballard and Green took that melody and the twist lyrics, and set them to a Jimmy Reed style blues beat, but by the time they took the song into the studio, in November 1958, they'd changed it for a more straightforward beat, and added the intro they'd previously used on the song \"Tore Up Over You\":\n\n[Excerpt: Hank Ballard and the Midnighters, \"Tore Up Over You\"]\n\nThey apparently also changed the lyrics significantly -- there exists an earlier demo of the song, recorded as a demo for VeeJay when Ballard wasn't sure that Syd Nathan would renew his contract, with very different, more sexually suggestive, lyrics, which are apparently those that were used in the Sensational Nightingales' version.\n\nEither way, the finished song didn't credit the Nightingales, or Green – who ended up in prison for two years for marijuana possession around this time, and missed out on almost all of this story – or any of the writers of the songs that Ballard lifted from. It was released, with Ballard as the sole credited writer, as the B-side of a ballad called \"Teardrops on Your Letter\", but DJs flipped the single, and this went to number sixteen on the R&B chart:\n\n[Excerpt: Hank Ballard and the Midnighters, \"The Twist\"]\n\nAnd that should have been the end of the matter, and seemed like it would be, for a whole year. \"The Twist\" was recorded in late 1958, came out in very early 1959, and was just one of many minor R&B hits the Midnighters had. But then a confluence of events made that minor R&B hit into a major craze. The first of these events was that Ballard and the Midnighters released another dance-themed song, \"Finger-Poppin' Time\", which became a much bigger hit for them, thanks in part to an appearance on Dick Clark's TV show American Bandstand:\n\n[Excerpt: Hank Ballard and the Midnighters, \"Finger-Poppin' Time\"]\n\nThe success of that saw \"The Twist\" start to become a minor hit again, and it made the lower reaches of the chart.\n\nThe second event was also to do with Dick Clark. American Bandstand was at the time the biggest music show on TV -- at the time it ran for ninety minutes every weekday afternoon, and it was shown live, with a studio audience consisting almost entirely of white teenagers. Clark was very aware of what had happened to Alan Freed when Freed had shown Frankie Lymon dancing with a white girl on his show, and wasn't going to repeat Freed's mistakes.\n\nBut Clark knew that most of the things that would become cool were coming from black kids, and so there were several regulars in the audience who Clark knew went to black clubs and learned the latest dance moves. Clark would then get those teenagers to demonstrate those moves, while pretending they'd invented them themselves. Several minor dance crazes had started this way, and in 1960 Clark noticed what he thought might become another one.\n\nTo understand the dance that became the Twist, we have to go back to the late thirties, and to episode four of this podcast, the one on \"Choo Choo Ch'Boogie\". If you can remember that episode, we talked there about a dance that was performed in the Savoy Ballroom in New York in the late thirties, called the Lindy Hop.\n\nThere were two parts of the Lindy Hop. One of those was a relatively formalised dance, with the partners holding each other, swinging each other around, and so on. That part of the dance was later adopted by white people, and renamed the jitterbug. But there was another part of the dance, known as the breakaway, where the two dancers would separate and show off their own individual moves before coming back together. That would often involve twisting in the old sense, along with a lot of other movements. The breakaway part of the Lindy Hop was never really taken up by white culture, but it continued in black clubs.\n\nAnd these teenagers had copied the breakaway, as performed by black dancers, and they showed it to Clark, but they called the whole dance \"the Twist\", possibly because of Ballard's record. Clark thought it had the potential to become something he could promote through his TV shows, at least if they toned down the more overtly sexual aspects. But he needed a record to go with it.\n\nNow, there are several stories about why Clark didn't ask Hank Ballard and the Midnighters on to the show. Some say that they were simply busy elsewhere on tour and couldn't make the trip back, others that Clark wanted someone less threatening -- by which it's generally considered he meant less obviously black, though the artist he settled on is himself black, and that argument gets into a lot of things about colourism about which it's not my place to speak as a white British man. Others say that he wanted someone younger, others that he was worried about the adult nature of Ballard's act, and yet others that he just wanted a performer with whom he had a financial link -- Clark was one of the more obviously corrupt people in the music industry, and would regularly promote records with which he had some sort of financial interest. Possibly all of these were involved.\n\nEither way, rather than getting Hank Ballard and the Midnighters onto his shows to perform \"The Twist\", even as it had entered the Hot One Hundred at the lower reaches, Clark decided to get someone to remake the record. He asked Cameo-Parkway, a label based in Philadelphia, the city from which Clark's show was broadcast, and which was often willing to do \"favours\" for Clark, if they could do a remake of the record. This was pretty much a guaranteed hit for the label -- Clark was the single most powerful person in the music industry at this point, and if he plugged an artist they were going to be a success -- and so of course they said yes, despite the label normally being a novelty label, rather than dealing in rock and roll or R&B. They even had the perfect singer for the job.\n\nErnest Evans was eighteen years old, and had repeatedly tried and failed to get Cameo-Parkway interested in him as a singer, but things had recently changed for him. Clark had wanted to do an audio Christmas card for his friends -- a single with \"Jingle Bells\" sung in the style of various different singers. Evans had told the people at Cameo-Parkway he could do impressions of different singers, and so they'd asked him to record it. That recording was a private one, but Evans later did a rerecording of the song as a duet with Bobby Rydell, including the same impressions of Fats Domino, Elvis Presley, and the Chipmunks that he'd done on Clark's private copy, so you can hear what it sounded like:\n\n[Excerpt: Chubby Checker and Bobby Rydell, \"Jingle Bell Imitations\"]\n\nIt was that Fats Domino imitation, in particular, that gave Evans his stage name. Dick Clark's wife Barbara was there when he was doing the recording, and she called him \"Chubby Checker\", as a play on \"Fats Domino\".\n\nClark was impressed enough with the record that Cameo-Parkway decided to have the newly-named Chubby Checker make a record in the same style for the public, and his version of \"Mary Had a Little Lamb\" in that style, renamed \"The Class\" made number thirty-eight on the charts thanks to promotion from Clark:\n\n[Excerpt: Chubby Checker, \"The Class\"]\n\nTwo more singles in that vein followed, \"Whole Lotta Laughin'\" and \"Dancing Dinosaur\", but neither was a success. But Checker was someone known to Clark, someone unthreatening, someone on a label with financial connections to Clark, and someone who could do decent impressions. So when Clark wanted a record that sounded exactly like Hank Ballard and the Midnighters singing \"The Twist\", it was easy enough for Checker to do a Ballard impression:\n\n[Excerpt: Chubby Checker, \"The Twist\"]\n\nClark got Checker to perform that on The Dick Clark Show -- a different show from Bandstand, but one with a similar audience size -- and to demonstrate the toned-down version of the dance that would be just about acceptable to the television audience. This version of the dance basically consisted of miming towelling your buttocks while stubbing out a cigarette with your foot, and was simple enough that anyone could do it.\n\nChecker's version of \"The Twist\" went to number one, as a result of Clark constantly plugging it on his TV shows. It was so close to Ballard's version that when Ballard first heard it on the radio, he was convinced it was his own record. The only differences were that Checker's drummer plays more on the cymbals, and that Checker's saxophone player plays all the way through the song, rather than just playing a solo -- and King Records quickly got a saxophone player in to the studio to overdub an identical part on Ballard's track and reissue it, to make it sound more like the soundalike. Ballard's version of the song ended up going to number twenty-eight on the pop charts on Checker's coattails.\n\nAnd that should, by all rights, have been the end of the Twist. Checker recorded a series of follow-up hits over the next few months, all of them covers of older R&B songs about dances -- a version of \"The Hucklebuck\", a quick cover of Don Covay's \"Pony Time\", released only a few months before, which became Checker's second number one, and \"Dance the Mess Around\". All of these were hits, and it seemed like Chubby Checker would be associated with dances in general, rather than with the Twist in particular. In summer 1961 he did have a second Twist hit, with \"Let's Twist Again\" -- singing \"let's twist again, like we did last summer\", a year on from \"The Twist\":\n\n[Excerpt: Chubby Checker, \"Let's Twist Again\"]\n\nThat was written by the two owners of Cameo-Parkway, who had parallel careers as writers of novelty songs -- their first big hit had been Elvis' \"Teddy Bear\". But over the few months after \"Let's Twist Again\", Checker was back to non-Twist dance songs. But then the Twist craze proper started, and it started because of Joey Dee and the Starliters.\n\nJoey DiNicola was a classmate of the Shirelles, and when the Shirelles had their first hits, they'd told DiNicola that he should meet up with Florence Greenberg. His group had a rotating lineup, at one point including guitarist Joe Pesci, who would later become famous as an actor rather than as a musician, but the core membership was a trio of vocalists -- Joey Dee, David Brigati, and Larry Vernieri, all of whom would take lead vocals. They were one of the few interracial bands of the time, and the music they performed was a stripped-down version of R&B, with an organ as the dominant instrument -- the kind of thing that would later get known as garage rock or frat rock.\n\nGreenberg signed the Starliters to Scepter Records, and they released a couple of singles on Scepter, produced and written like much of the material on Scepter by Luther Dixon:\n\n[Excerpt: Joey Dee and the Starliters, \"Shimmy Baby\"]\n\nNeither of their singles on Scepter was particularly successful, but they became a popular live act around New Jersey, and got occasional gigs at venues in New York. They played a three-day weekend at a seedy working-class Mafia-owned bar called the Peppermint Lounge, in Manhattan. Their shows there were so successful that they got a residency there, and became the house band. Soon the tiny venue -- which had a capacity of about two hundred people -- was packed, largely with the band's fans from New Jersey -- the legal drinking age in New Jersey was twenty-one, while in New York it was eighteen, so a lot of eighteen- and nineteen-year-olds from New Jersey would make the journey.\n\nAs Joey Dee and the Starliters were just playing covers of chart hits for dancing, of course they played \"The Twist\" and \"Let's Twist Again\", and of course these audiences would dance the Twist to them. But that was happening in a million dingy bars and clubs up and down the country, with nobody caring. The idea that anyone would care about a tiny, dingy, bad-smelling bar and the cover band that played it was a nonsense.\n\nUntil it wasn't.\n\nBecause the owners of the Peppermint Lounge decided that they wanted a little publicity for their club, and they hired a publicist, who in turn got in touch with a company called Celebrity Services. What Celebrity Services did was, for a fee, they would get some minor celebrity or other to go to a venue and have a drink or a meal, and they would let the gossip columnists know about it, so the venue would then get a mention in the newspapers. Normally this would be one or two passing mentions, and nothing further would happen.\n\nBut this time it did. A couple of mentions in the society columns somehow intrigued enough people that some more celebrities started dropping in. The club was quite close to Broadway, and so a few of the stars of Broadway started popping in to see what the fuss was about. And then more stars started popping in to see what the other stars had been popping in for. Noel Coward started cruising the venue looking for rough trade, Judy Garland, Marilyn Monroe, and Tallulah Bankhead were regulars, Norman Mailer danced the Twist with the granddaughter of Lord Beaverbrook, and Tennessee Williams and even Greta Garbo turned up, all to either dance to Joey Dee and the Starliters or to watch the younger people dancing to them. There were even rumours, which turned out to be false, that Jackie Kennedy had gone to the Peppermint Lounge – though she did apparently enjoy dancing the Twist herself.\n\nThe Peppermint Lounge became a sensation, and the stories all focussed on the dance these people were doing.\n\n\"The Twist\" reentered the charts, eighteen months after it had first come out, and Morris Levy sprang into action. Levy wanted a piece of this new Twist thing, and since he didn't have Chubby Checker, he was going to get the next best thing. He signed Joey Dee and the Starliters to Roulette Records, and got Henry Glover in to produce them.\n\nHenry Glover is a figure who we really didn't mention as much as we should have in the first fifty or so episodes of the podcast. He'd played trumpet with Lucky Millinder, and he'd produced most of the artists on King Records in the late forties and fifties, including Wynonie Harris, Bill Doggett, and James Brown. He'd produced Little Willie John's version of \"Fever\", and wrote \"Drown in My Own Tears\", which had become a hit for Ray Charles.\n\nGlover had also produced Hank Ballard's original version of \"The Twist\", and now he was assigned to write a Twist song for Joey Dee and the Starliters. His song, \"Peppermint Twist\", became their first single on Roulette:\n\n[Excerpt: Joey Dee and the Starliters, \"Peppermint Twist\"]\n\n\"Peppermint Twist\" went to number one, and Chubby Checker's version of \"The Twist\" went back to number one, becoming the only record ever to do so during the rock and roll era. In fact, Checker's record, on its reentry, became so popular that as recently as 2018 Billboard listed it as the *all-time* number one record on the Hot One Hundred.\n\nThe Twist was a massive sensation, but it had moved first from working-class black adults, to working-class white teenagers, to young middle-class white adults, and now to middle-aged and elderly rich white people who thought it was the latest \"in\" thing. And so, of course, it stopped being the cool in thing with the teenagers, almost straight away. If you're young and rebellious, you don't want to be doing the same thing that your grandmother's favourite film star from when she was a girl is doing.\n\nBut it took a while for that disinterest on the part of the teenagers to filter through to the media, and in the meantime there were thousands of Twist cash-in records. There was a version of \"Waltzin' Matilda\" remade as \"Twistin' Matilda\", the Chipmunks recorded \"The Alvin Twist\". The Dovells, a group on Cameo Parkway who had had a hit with \"The Bristol Stomp\", recorded \"Bristol Twistin' Annie\", which managed to be a sequel not only to \"The Twist\", but to their own \"The Bristol Stomp\" and to Hank Ballard's earlier \"Annie\" recordings:\n\n[Excerpt: The Dovells, \"Bristol Twistin' Annie\"]\n\nThere were Twist records by Bill Haley, Neil Sedaka, Duane Eddy... almost all of these were terrible records, although we will, in a future episode, look at one actually good Twist single.\n\nThe Twist craze proper started in November 1961, and by December there were already two films out in the cinemas. Hey! Let's Twist! starred Joey Dee and the Starliters in a film which portrayed the Peppermint Lounge as a family-run Italian restaurant rather than a Mafia-run bar, and featured Joe Pesci in a cameo that was his first film role. Twist Around the Clock starred Chubby Checker and took a whole week to make. As well as Checker, it featured Dion, and the Marcels, trying desperately to have another hit after \"Blue Moon\":\n\n[Excerpt: The Marcels, \"Merry Twistmas”]\n\nTwist Around The Clock was an easy film to make because Sam Kurtzman, who produced it, had produced several rock films in the fifties, including Rock Around the Clock. He got the writer of that film to retype his script over a weekend, so it talked about twisting instead of rocking, and starred Chubby Checker instead of Bill Haley. As Kurtzman had also made Bill Haley's second film, Don't Knock The Rock, so Checker's second film became Don't Knock the Twist.\n\nChecker also appeared in a British film, It's Trad, Dad!, which we talked about last week. That was a cheap trad jazz cash-in, but at the last minute they decided to rework it so it included Twist music as well as trad, so the director, Richard Lester, flew to the USA for a couple of days to film Checker and a couple of other artists miming to their records, which was then intercut with footage of British teenagers dancing, to make it look like they were dancing to Checker.\n\nOf course, the Twist craze couldn't last forever, but Chubby Checker managed a good few years of making dance-craze singles, and he married Catharina Lodders, who had been Miss World 1962, in 1964. Rather amazingly for a marriage between a rock star and a beauty queen, they remain married to this day, nearly sixty years later.\n\nChecker's last big hit came in 1965, by which point the British Invasion had taken over the American charts so comprehensively that Checker was recording \"Do the Freddie\", a song about the dance that Freddie Garrity of Freddie and the Dreamers did on stage:\n\n[Excerpt: Chubby Checker, \"Do the Freddie\"]\n\nIn recent decades, Checker has been very bitter about his status. He's continued a career of sorts, even scoring a novelty hit in the late eighties with a hip-hop remake of \"The Twist\" with The Fat Boys, but for a long time his most successful records were unavailable. Cameo-Parkway was bought in the late sixties by Allen Klein, a music industry executive we'll be hearing more of, more or less as a tax writeoff, and between 1975 and 2005 there was no legal way to get any of the recordings on that label, as they went out of print and weren't issued on CD, so Checker didn't get the royalties he could have been getting from thirty years of nostalgia compilation albums. Recent interviews show that Checker is convinced he is the victim of an attempt to erase him from rock and roll history, and believes he deserves equal prominence with Elvis and the Beatles. He believes his lack of recognition is down to racism, as he married a white woman, and has protested outside the Rock and Roll Hall of Fame at his lack of induction. Whatever one's view of the artistic merits of his work, it's sad that someone so successful now feels so overlooked.\n\nBut the Twist fad, once it died, left three real legacies. One was a song we'll be looking at in a few months, and the other two came from Joey Dee and the Starliters. The Young Rascals, a group who had a series of hits from 1965 to 1970, started out as the instrumentalists in the 1964 lineup of Joey Dee and the Starliters before breaking out to become their own band, and a trio called Ronnie and the Relatives made their first appearances at the Peppermint Lounge, singing backing vocals and dancing behind the Starliters. They later changed their name to The Ronettes, and we'll be hearing more from them later.\n\nThe Twist was the last great fad of the pre-Beatles sixties. That it left so little of a cultural mark says a lot about the changes that were to come, and which would sweep away all memory of the previous few years...",
  "enclosure": "",
  "itunes:summary": "Episode ninety-one of A History of Rock Music in Five Hundred Songs looks at \"The Twist\" by Chubby Checker, and how the biggest hit single ever had its roots in hard R&B. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Viens Danser le Twist\" by Johnny Hallyday, a cover of a Chubby Checker record that became the first number one for France's biggest rock star.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nAlso, people have asked me to start selling podcast merchandise, so you can now buy T-shirts from https://500-songs.teemill.com/. That store will be updated semi-regularly.\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nMuch of the information in this episode comes from&nbsp;The Twist: The Story of the Song and Dance That Changed the World by Jim Dawson.\n\nThis collection of Hank Ballard's fifties singles is absolutely essential for any lover of R&B.\n\nAnd this four-CD box set contains all Chubby Checker's pre-1962 recordings, plus a selection of other Twist hits from 1961 and 62, including recordings by Johnny Hallyday, Bill Haley, Vince Taylor, and others.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nToday we're going to look at a record that achieved a feat that's unique in American history. It is the only non-Christmas-themed record -- ever -- to go to number one on the Billboard pop charts, drop off, and go back to number one again later. It's a record that, a year after it went to number one for the first time, started a craze that would encompass everyone from teenagers in Philadelphia to the first lady of the United States.\n\nWe're going to look at Chubby Checker, and at \"the Twist\", and how a B-side by a washed-up R&B group became the most successful record in chart history:\n\n[Excerpt: Chubby Checker, \"The Twist\"]\n\nOne of the groups that have been a perennial background player in our story so far has been Hank Ballard and the Midnighters. We talked about them most in the episode on \"The Wallflower\", which was based on their hit \"Work With Me Annie\", and they've cropped up in passing in a number of other places, most recently in the episode on Jackie Wilson. By 1958, though they were largely a forgotten group. Their style had been rooted in the LA R&B sound that had been pioneered by Johnny Otis, and which we talked so much about in the first year or so of this podcast. That style had been repeatedly swept away by the newer sounds that had come out of Memphis, Chicago, and New York, and they were yesterday's news. They hadn't had a hit in three years, and they were worried they were going to be dropped by their record label.\n\nBut they were still a popular live act, and they were touring regularly, and in Florida (some sources say they were in Tampa, others Miami) they happened to play on the same bill as a gospel group called the Sensational Nightingales, who were one of the best gospel acts on the circuit:\n\n[Excerpt: The Sensational Nightingales, \"Morning Train\"]\n\nThe Sensational Nightingales had a song, and they were looking for a group to sing it. They couldn't sing it themselves -- it was a secular song, and they were a gospel group -- but they knew that it could be a success if someone did. The song was called \"The Twist\", and it was based around a common expression from R&B songs that was usually used to mean a generic dance, though it would sometimes be used as a euphemism for sexual activity. There was, though, a specific dance move that was known as the twist, which was a sort of thrusting, grinding move. (It's difficult to get details of exactly what that mo",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode ninety-one of A History of Rock Music in Five Hundred Songs looks at \"The Twist\" by Chubby Checker, and how the biggest hit single ever had its roots in hard R&B. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Viens Danser le Twist\" by Johnny Hallyday, a cover of a Chubby Checker record that became the first number one for France's biggest rock star.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nAlso, people have asked me to start selling podcast merchandise, so you can now buy T-shirts from https://500-songs.teemill.com/. That store will be updated semi-regularly.\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}