{
  "title": "Nighttime Charging of EVs May Overburden the Grid",
  "link": "https://spectrum.ieee.org/electric-vehicles",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-man-with-a-phone-looks-at-the-charger-of-his-electric-vehicle.jpg?id=31865556&width=1245&height=700&coordinates=0%2C0%2C0%2C469\"/><br/><br/><p>The vast majority of electric vehicle owners currently charge their cars at home at night. However, a new study finds this might gravely burden the grid as more EVs hit the road. Instead, a much better strategy in the future is a greater emphasis on daytime charging, scientists say.<br/></p><p>The number of electric passenger cars, delivery vans and other light-duty vehicles may reach more than 300 million worldwide by 2035, an order of magnitude increase when compared to 2021, <a href=\"https://about.bnef.com/electric-vehicle-outlook/\" target=\"_blank\">according to energy market analyst firm Bloomberg New Energy Finance</a>. In California alone, cumulative sales of EVs reached 1 million in <a href=\"https://www.gov.ca.gov/2022/02/25/california-leads-the-nations-zev-market-surpassing-1-million-electric-vehicles-sold/\" rel=\"noopener noreferrer\" target=\"_blank\">February</a>, accounting for about 6 percent of the state’s cars and light trucks.</p><p>The drive toward EVs and renewable energy is ultimately designed to lower fossil fuel use and reduce greenhouse gas emissions. However, the campaigns pushing both these shifts are largely uncoordinated. In the new study, researchers examined what effects of growing EV ownership might have in the long term on power grids based more and more on renewable energy.</p><p>California plans for 50 percent or 24 million of its light-duty vehicles to be electric by 2035. The scientists investigated the effects this might have on the whole U.S. portion of the Western Interconnection grid, which covers 11 states with more than 75 million people, because California depends heavily on electricity imports from the other western states. Their models included an increase in solar and wind generation 3.5 times and 3 times 2019 levels, respectively.</p><p>Currently, more than 80 percent of electric vehicle charging, and as much as 93 percent, takes place at home, mostly in the evening, <a href=\"https://www.osti.gov/biblio/1503821\" rel=\"noopener noreferrer\" target=\"_blank\">according to the National Renewable Energy Lab in Golden, Colo</a>. The researchers found this strategy could increase peak electricity demand by up to 25 percent if half of all cars are electric by 2035, and by 50 percent if all vehicles go electric.</p><p>In contrast, shifting to daytime charging would minimize the impact of EVs on the grid. “Right now, we have a lot of power available in the evening,” says study senior author Ram Rajagopal, an electrical engineer at Stanford University. “However, when we look at 2035, the grid is predominantly solar.”</p><p>By changing the emphasis of charging toward the daytime, “we don’t really have to add any resources to the grid,” Rajagopal says. “We’re not saying that everyone should move to daytime charging. We think the emphasis should be a more balanced approach, more tilted toward daytime charging.”</p><p>However, a number of barriers currently hamper such a shift. Rajagopal points out, “If you’re working at home and you have a charger at home, then it’s not a big deal, but if you drive to work, you will need to have a charger there and there will be a cost for that charging, and people usually don’t really have an awareness of the costs of charging at home.”</p><p>Policymakers will likely want more widespread deployment of shared charging infrastructure, likely with a focus on low- and middle-income populations as well as small and medium-size businesses. “We’re already seeing a lot of investment going that way in the <a href=\"https://www.electrificationcoalition.org/work/federal-ev-policy/inflation-reduction-act/\" rel=\"noopener noreferrer\" target=\"_blank\">Inflation Reduction Act</a>,” Rajagopal says.</p><p>Moreover, across the United States, states will likely want to rethink electricity pricing structures as their EV charging needs increase and their grids change, the researchers say.</p><p>“Right now electricity rates reflect the current very mild penetration of EVs,” Rajagopal says. “Once we see a deep penetration, a discount during the daytime would go a really long way toward people changing their habits.”</p><p>Future research can explore what happens when trucking fleets also go electric, Rajagopal says.</p><p>The scientists detailed <u><a href=\"https://www.nature.com/articles/s41560-022-01105-7\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a></u> online 22 September in the journal <em>Nature Energy</em>.</p>",
  "pubDate": "Thu, 06 Oct 2022 14:25:12 +0000",
  "guid": "https://spectrum.ieee.org/electric-vehicles",
  "category": [
    "Grid",
    "Renewable energy",
    "Electric vehicles",
    "Ev charging"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}