{
  "title": "S1E56 - Becoming Turbulence Tough with Ryan Campbell",
  "guid": "https://pinecast.com/guid/5c2dfd22-92ee-44bc-96bf-d674de1895dd",
  "pubDate": "Thu, 10 Mar 2022 07:30:00 -0000",
  "itunes:duration": "00:51:55",
  "description": "<p>When he was just nineteen, Ryan Campbell flew 24,000 nautical miles on thirty-five stops in fifteen countries in just seventy days and was recognized as the first teenager in history to fly around the world solo by the Guinness Book of World Records. His critically-acclaimed book Born to Fly, which detailed this amazing journey, was nationally celebrated, and Ryan was on top of the world… until tragedy struck. At twenty-one, Ryan barely survived a devastating, life-changing plane crash, suffering broken bones from head to toe that left him in hospital for five months, followed by eighteen months of rehabilitation. Yet, refusing to accept his doctors’ diagnosis of paraplegia, Ryan fought back, using his desire to fly again as fuel for his painful yet triumphant recovery. In this episode, Ryan shares his journey from record-setting victory to backbreaking defeat and how he developed the mindset and toolbox necessary to ride out life’s toughest bumps.</p>\n<p>Ryan starts the conversation by sharing how he fell in love with flying and set about making it his career before hitting upon the idea to break a world record. He lets us in on the process of fundraising a quarter of a million dollars at just nineteen while gaining flight experience and gives us insight into the remarkable, record-breaking flight itself, including the incredible sights and how he and his crew kept their heads under pressure. Ryan then provides an emotional account of the plane crash that nearly killed him and left him diagnosed as paraplegic, stuck in hospital with a long journey of recovery in front of him. He tells us how he drew inspiration and learned perspective from a fellow patient and developed the mindset toolbox, the idea that we all have a mental toolbox we can fill with tools to help us navigate change, challenge, crisis, and adversity. He also explains how his own toolbox helped him not only become tough and lean into his recovery but also to accept and adjust to long-term disability without letting it hold him back. In fact, he was even able to get back in the cockpit and fly again, keeping that intrinsic part of himself that he almost lost. Finally, Ryan tells us about his plans to get married, his move into motivational speaking, and why a pink Cadillac has become an important symbol for his attitude toward life.</p>\n<p>Ryan’s resilience, determination, and fighting spirit are sure to inspire as he shares his emotional and uplifting journey from glory to tragedy and back to happiness.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>How Ryan fell in love with flying and set about becoming a pilot at fourteen</li>\n<li>Ryan’s first solo flight at fifteen</li>\n<li>Planning a record-breaking flight</li>\n<li>Fundraising $250,000 while building flight experience</li>\n<li>Flying over water for the first time by pointing the airplane at the Pacific Ocean</li>\n<li>Pushing the limits of man and machine</li>\n<li>How Ryan and his crew keep their heads together during the flight by doing things one step at a time</li>\n<li>How it felt to land having broken the world record</li>\n<li>Working out what to do next</li>\n<li>The plane crash that nearly cost Ryan everything</li>\n<li>Tackling adversity, starting recovery, and learning perspective</li>\n<li>Developing the mindset toolbar</li>\n<li>Adjusting to disability</li>\n<li>Getting back in the cockpit</li>\n<li>What Ryan’s up to now</li>\n<li>The Pink Cadillac</li>\n</ul>\n<p>Quotes:</p>\n<p>“So we’re actually invited to go up and visit a cockpit as three young boys, and I tell you what, that’s pretty incredible. Eyes wide, amazed at the buttons and switches, super-stoked to meet the pilots, I thought they were the coolest people that ever walked the Earth. And that was it, that was the day that six-year-old Ryan discovered his passion, and that would be all things aviation.”</p>\n<p>“Fifteen years old, this kid’s flying an airplane on his own, and I was jealous. Like, I was envious, I couldn’t believe this was legal. It just blew my mind.”</p>\n<p>“The day that I turned fifteen, I went to the airport, I practiced some takeoffs and landings with my flying instructor. And then he told me to take him back to the hangar, not to shut the airplane down. He got out of that airplane, did up his seatbelts, he took his headset. He said, ‘Don’t forget to lock the door, go and have fun.’”</p>\n<p>“I saw something I wanted, I started to kind of research how to do it, I put a plan in place, I worked really, really hard, I gave up on a bunch of stuff to be able to make it happen and ultimately found success in that. And that was a pretty powerful lesson to have when you’re fifteen.”</p>\n<p>“I went to Google, and I googled ‘how to fly solo around the world,’ right? Legitimate Google search.”</p>\n<p>“At that point, it wasn’t about precision. It was just about progress, doing something.”</p>\n<p>“I often tell people, I don’t know if you’ve ever tried to rent a car at an airport under the age of twenty-five, it’s very, very hard. Under the age of twenty-one, it’s borderline impossible, right? But trying to rent a million-dollar, single-engine airplane at seventeen, eighteen, nineteen to fly it around the world was an incredibly tough sell.”</p>\n<p>“At the end of the day, we had to take 24,000 miles and split it up into not just legs but little tasks. So this wasn’t a 24,000-mile flight around the world. This was thirty-five A-to-B flights that happened to connect the dots around the globe, but then every single flight was broken down into jobs.”</p>\n<p>“What really mattered was the impact we had on some many different people.”</p>\n<p>“The reality was that my entire life had changed. The very thing that had given me my identity and made me who I was, at that point in time, was now the very thing that had taken it all away.”</p>\n<p>“I’d been to the top. And even though I couldn’t see it then, I look at this as my biggest gift: I had now been to the bottom. And the opportunity to compare those two, to ask ourselves a couple of really important questions, where do we truly learn what makes us the very best version of ourselves? They are the powerful questions that I had now the real-life experiences to pull apart and find myself.”</p>\n<p>“Adversity is a byproduct of breathing, and turbulence is a part of life. And it comes down, at the end of the day, to how tough and resilient you are and how willing you are to tackle the mountain that’s ahead and get up every single time you’re knocked down. And it comes back to understanding that resilience is a learned and refined skill.”</p>\n<p>“Every day in hospital, I could go to the gym, and I could move a muscle, and I could build strength, and I could see progress. That progress is what gave purpose to the pain. Right? That’s what made me get up the next day, get back in the wheelchair, go back to that rehabilitation gym.”</p>\n<p>“Every single one of us is born with a toolbox. It’s really big, it has drawers and wheels, we take it with us wherever we go in life. Now, the aim of the game is to fill that toolbox with tools, tools that we can use to navigate change, challenge, crisis, and adversity, right? To make us turbulence tough.”</p>\n<p>“I’m now walking independently and shuffling around, kind of, you know, getting where I want on my own two feet. The way that we arrived at that point was by kind of making a pact and understanding that no one was going to give me, you know, a great outcome. I had to work for it.”</p>\n<p>“You have to kind of come to terms with aviation from a different set of eyes. That it is safe. It is incredible. It is part of who I am. And you know, to be back up there is what ultimately was the end goal, and we made it happen.”</p>\n<p>“We like to say go and do something that, you know, may not be logical, you know, may not be financially sensible, but it makes you smile like a kid. Once you do that, you start to show up better in all areas of your life.”</p>\n<p>Links:</p>\n<p><a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold</a> Website\n<a href=\"https://www.amazon.com/Life-10-Meters-Lessons-Champion/dp/B096CQW2L7/ref=sr_1_3?crid=2AXVGI3HL987J&dchild=1&keywords=laura+wilkinson+life+at+10+meters&qid=1624113646&sprefix=Laura+Wilkinson%2Caps%2C227&sr=8-3\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>\n<a href=\"http://laurawilkinson.com/shop\" rel=\"nofollow\">Laura Wilkinson Designs- Shop</a>\n<a href=\"http://laurawilkinson.com/coffee\" rel=\"nofollow\">Buy Laura a Coffee</a></p>\n<p>Laura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura’s Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura’s Facebook</a></p>\n<p>Ryan’s Social Media:\n<a href=\"https://www.instagram.com/ryancampbellspeaking/\" rel=\"nofollow\">Ryan’s Instagram</a>\n<a href=\"http://www.linkedin.com/in/ryancampbellspeaking/\" rel=\"nofollow\">Ryan’s LinkedIn</a>\n<a href=\"https://ryancampbell.co/\" rel=\"nofollow\">Ryan’s website</a></p>",
  "itunes:title": "Becoming Turbulence Tough with Ryan Campbell",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 56
}