{
  "title": "Opium cultivation soaring since Taliban takeover – UN",
  "link": "https://www.rt.com/news/565765-opium-afghanistan-rise-drugs/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565765-opium-afghanistan-rise-drugs/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63617c022030270b424cca11.jpg\" /> Opium cultivation has increased in Afghanistan by 32% since the Taliban’s takeover <br/><a href=\"https://www.rt.com/news/565765-opium-afghanistan-rise-drugs/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Production of the drug in Afghanistan is up by a third over the previous year, a report reveals</strong></p>\n            \n                        \n            <p>Opium cultivation in Afghanistan, the largest grower in the world, has boomed since the Taliban assumed power in August 2021, the United Nations Office on Drugs and Crime (UNODC) revealed on Tuesday. Land under opium poppy cultivation in the country rose 32% over the previous year, to 233,000 hectares, according to the UN agency&rsquo;s latest <a href=\"https://www.unodc.org/documents/crop-monitoring/Afghanistan/Opium_cultivation_Afghanistan_2022.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">report</a>.&nbsp;</p>\n<p>After a ban on opium cultivation and other narcotics was put in place in April, opium prices &ldquo;<em>soared</em>,&rdquo; the UNODC stated. As a result, the 2022 opium harvest, which was largely exempt from the Taliban&rsquo;s decree due to there being a two-month grace period, became &ldquo;<em>the most profitable for farmers since 2017.</em>&rdquo;&nbsp;</p>\n<p>According to the report, &ldquo;<em>the income made by farmers from opium sales more than tripled</em>&rdquo; from $425 million last year to $1.4 billion in 2022. The latest figure represents 29% of the 2021 value of the country's agricultural sector.</p>\n<p>The agency notes, however, that the higher profit has not necessarily increased the purchasing power of farmers &ndash; surging inflation has pushed the price of food up by about 35%.&nbsp;</p>\n<p>According to the UNODC, since the beginning of the Taliban&rsquo;s rule, opiate trafficking from Afghanistan, which supplies some 80% of global opiate consumption, has been ongoing without interruption.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.06/thumbnail/62a8a387203027390e4e84e7.png\" alt=\"© Pixabay / jniittymaa0\" />\n            <figcaption><a href=\"https://www.rt.com/news/557157-synthetic-drugs-proliferating-europe-agency/\">Dozens of new drugs proliferating in Europe – report</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Because it normally takes between a year and a year and a half for opiates originating in Afghanistan to reach destination countries, any changes in cultivation or trafficking activity in Afghanistan can be seen &ldquo;<em>within the same year in the Near and Middle East and South-West Asia, and a year later in Europe,</em>&rdquo; the UN agency stated.</p>\n<p>In its 2023 forecast, the UNODC said Afghan farmers would be making decisions on opium cultivation based on a variety of factors, including economic disruption, humanitarian crises, high prices for opium, as well as &ldquo;<em>uncertainty about how the de facto authorities will enforce the cultivation ban.&rdquo;&nbsp;</em></p>\n<p>Most of the 2023 opium crop must be sown by early November 2022, the UN Office on Drugs and Crimes notes.</p>\n<p><em>&ldquo;The international community must work to address the acute needs of the Afghan people, and to step up responses to stop the criminal groups trafficking heroin and harming people in countries around the world,&rdquo;</em> UNODC Executive Director Ghada Waly said.</p>\n<p>Opium is used in many pain-killing drugs but is also the key ingredient in heroin.</p>\n<p>In 2020, in the United States alone, 13,000 people died from heroin overdoses, according to the country&rsquo;s <a href=\"https://www.cdc.gov/drugoverdose/deaths/heroin/index.html\" target=\"_blank\" rel=\"noopener noreferrer\">Centers for Disease Control and Prevention.</a></p>\n<p>Figures from the US National Center for Drug Abuse Statistics <a href=\"https://drugabusestatistics.org/heroin-statistics/\" target=\"_blank\" rel=\"noopener noreferrer\">show</a> that 80% of people who use heroin first abused prescription opioids.</p>",
  "enclosure": "",
  "pubDate": "Tue, 01 Nov 2022 21:19:11 +0000",
  "dc:creator": "RT"
}