{
  "title": "#78: The Tom Segura CD Release Party (Brendon Walsh, Tom Segura, Duncan Trussell, Ari Shaffir)",
  "itunes:title": "The Tom Segura CD Release Party with Brendon Walsh, Tom Segura, Duncan Trussell",
  "pubDate": "Sat, 22 Sep 2012 11:40:00 +0000",
  "guid": "99191868832e7376d219238c41d9ece6",
  "link": "https://shaffir1.libsyn.com/-78-the-tom-segura-cd-release-party",
  "itunes:image": "",
  "description": "<p><span style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\">Tom Segura and I went over to Brendon Walsh</span><span style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\">'s palatial hotel room in Toronto and celebrated Tom's CD release by barely talking about it. We're pretty tuned up so the whole conversation was relatively hilarious. Just like Tom's new CD, White Girls with Corn Rows. This podcast brought to you by the JFL 42 Comedy Festival.</span></p>",
  "content:encoded": "<p>Tom Segura and I went over to Brendon Walsh's palatial hotel room in Toronto and celebrated Tom's CD release by barely talking about it. We're pretty tuned up so the whole conversation was relatively hilarious. Just like Tom's new CD, White Girls with Corn Rows. This podcast brought to you by the JFL 42 Comedy Festival.</p>",
  "enclosure": "",
  "itunes:duration": "01:26:49",
  "itunes:explicit": true,
  "itunes:keywords": "podcast,death,joe,78,HOUSE,comedy,to,PARTY,girls,IN,Toronto,corn,ontario,skeptic,Bar,Tom,white,moms,hall,your,Home,sam,tank,release,zone,thom,ari,squad,Brandon,duncan,cd,walsh,brendan,bone,rogan,Massey,rows,brendon,trussell,tripoli,shaffir,sceptic,segura",
  "itunes:subtitle": "Tom Segura and I went over to Brendon Walsh's palatial hotel room in Toronto and celebrated Tom's CD release by barely talking about it. We're pretty tuned up so the whole conversation was relatively hilarious. Just like Tom's new CD, White Girls with...",
  "itunes:episode": 78,
  "itunes:episodeType": "full",
  "itunes:author": "Ari Shaffir"
}