{
  "id": "https://bibleinoneyear.org/en/youth/175",
  "title": "Day 175: Pass on the Baton",
  "description": "Psalm 78:4b,6–7, 1 Kings 12:26–30, Acts 16:1–3a,4-5. There have always been people in my life from whom I am learning and others to whom I am trying to pass it on  Like runners in a relay race, we all have a responsibility to pass on the baton",
  "pubDate": "Fri, 24 Jun 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/175/",
  "itunes:duration": "14:28",
  "guid": "enyouth24062022-175",
  "length": 868.52,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 175: Pass on the Baton",
  "itunes:subtitle": "Psalm 78:4b,6–7, 1 Kings 12:26–30, Acts 16:1–3a,4-5. There have always been people in my life from whom I am learning and others to whom I am trying to pass it on  Like runners in a relay race, we all have a responsibility to pass on the baton",
  "itunes:summary": "When I left university at the age of twenty-one, I moved to London and was looking for a church to join. I visited HTB and heard Sandy Millar speak. Afterwards, I asked if I could meet with him. Soon after, I joined the church and began to learn from this extraordinary leader, friend and role model.\nAfter several years as a member of the congregation, I went on to train for ordination in the Church of England and ten years after our first meeting I returned to HTB as Sandy Millar’s assistant minister. I continued in that role for nineteen years until 2005 when he passed on the baton to me, and I succeeded him as vicar of HTB. To this day, Sandy continues to be my role model, friend and inspiration.\nThere have always been people in my life from whom I am learning and others to whom I am trying to pass it on. Like runners in a relay race, we all have a responsibility to pass on the baton.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 540
}