{
  "title": "Wolfram&#124;Alpha Personal Analytics for Facebook: Last Chance to Analyze Your Friend Network",
  "link": "https://blog.wolframalpha.com/2015/04/15/wolframalpha-personal-analytics-for-facebook-last-chance-to-analyze-your-friend-network/",
  "pubDate": "Wed, 15 Apr 2015 17:53:05 +0000",
  "dc:creator": "C. Alan Joyce",
  "category": "Statistics & Data Analysis",
  "guid": "https://blog.wolframalpha.com/?p=29208",
  "description": "Wolfram&#124;Alpha’s Facebook analytics ranks high among our all-time most popular features. By now, millions of people have used Wolfram&#124;Alpha to analyze their own activity and generate detailed analyses of their Facebook friend networks. A few years ago, we took data generously contributed by thousands of “data donors” and used the Wolfram Language’s powerful tools for [&#8230;]",
  "content:encoded": "<p>Wolfram|Alpha’s <a href=\"http://www.wolframalpha.com/facebook/\">Facebook analytics</a> ranks high among our all-time most popular features. By now, millions of people have used Wolfram|Alpha to analyze their own activity and generate detailed analyses of their Facebook friend networks. A few years ago, we took data generously contributed by thousands of “data donors” and used the Wolfram Language’s powerful tools for <a href=\"http://reference.wolfram.com/language/guide/SocialNetworks.html\">social network analysis</a>, <a href=\"http://reference.wolfram.com/language/guide/MachineLearning.html\">machine learning</a>, and <a href=\"http://reference.wolfram.com/language/guide/DataVisualization.html\">data visualization</a> to uncover fascinating insights into the demographics and interests of Facebook users.</p>\n<p>At the end of this month, however, Facebook will be deprecating the API we relied on to extract much of this information.</p>\n<p><span id=\"more-29208\"></span><img class=\"aligncenter size-full wp-image-25660\" title=\"Personal analytics for Facebook\" src=\"http://blog.wolfram.com/data/uploads/2015/04/wolfram-facebook-report.png\" alt=\"Personal analytics for Facebook\" width=\"326\" height=\"166\" /></p>\n<p>You’ll still be able to generate an analysis of most of your own activity on Facebook, but you won’t have access to any information about your friends (except their names) unless they’ve also authorized our <a href=\"https://apps.facebook.com/wolframconnection/\" target=\"_blank\">Facebook app</a>. So in most cases, we won’t have enough data to generate a meaningful friend network graph, or to compute statistics about location, age, marital status, or other personal characteristics of your group of Facebook friends.</p>\n<p>We completely support Facebook’s decision to increase the default security of users’ data, even though it will dramatically shorten reports for many people. So if you haven’t run your report in a while, or if you haven’t yet discovered <a href=\"http://blog.stephenwolfram.com/2012/08/wolframalpha-personal-analytics-for-facebook/\">what your report can tell you about yourself</a>, we strongly suggest you ask Wolfram|Alpha to compute your <a href=\"http://www.wolframalpha.com/input/?i=facebook+report\">Facebook personal analytics</a> soon, while its full functionality is still available. And by all means, encourage friends and family who haven’t viewed their own Facebook analytics to do so&#8212;it’ll make everyone’s reports richer and more detailed.</p>\n<hr />\n<p><em>To comment, please visit the copy of this post at the <a href=\"http://blog.wolfram.com/2015/04/14/wolframalpha-personal-analytics-for-facebook-last-chance-to-analyze-your-friend-network/\">Wolfram Blog »</a></em></p>\n"
}