{
  "title": "582: Have a Broomstick, Potter (Sorcerer's Stone, Chapters 9 - 10)",
  "link": "https://audioboom.com/posts/8172228",
  "itunes:episode": 582,
  "itunes:title": "Have a Broomstick, Potter (Sorcerer's Stone, Chapters 9 - 10)",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4855,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>There are certain things you can't do without becoming best friends, and podcasting about Harry Potter together is one of them! Chapter-by-Chapter returns with analysis of Sorcerer's Stone's \"The Midnight Duel\" and \"Halloween\"! Our trio of heroes get goaded by Malfoy into a trap, and then accidentally lock a troll in a bathroom. Harry also finds the one thing that he is naturally good at. <br>\n<br>\n\n</div>\n<ul>\n<li>News: Jim Kay <a href=\"https://www.wizardingworld.com/news/a-celebration-of-jim-kay\">has announced</a> he will be stepping down from making the illustrated edition <em>Potter</em> books. We thank him for his work.</li>\n<li>Main Discussion #1: Sorcerer's Stone, Chapter 9: The Midnight Duel</li>\n<li>7-Word Summary: Draco challenges Harry to a Midnight Fakeout</li>\n<li>After Neville's injury, the students leap to his defense. Have the hosts had similar moments at school, or were we all too scared to speak up?</li>\n<li>In what is clearly another security nightmare, Madame Hooch abandons her class of 11-year-olds who 5 minutes ago were handed a very fast and dangerous broomstick for each of them. No wonder something bad happens next!</li>\n<li>Laura asks what (specifically) makes Harry a natural at flying? Maybe abuse from Dudley made his reflexes better?</li>\n<li>How blatant is what McGonagall does 'favoritism' toward Gryffindor House, and why does the First Years rule exist to begin with?</li>\n<li>After narrowly avoiding trouble during the day, Harry and Ron immediately go wandering the castle at night. Shouldn't they be more careful?</li>\n<li>Should Harry have known that Malfoy was planning a trap? How does Malfoy have an inside line to Filch?</li>\n<li>Did NOBODY walk Neville home from the hospital wing to make sure he could get in the Common Room?</li>\n<li>Fluffy's origins and comments on the movie adaptation are covered in 'Odds and Ends'</li>\n<li>Main Discussion #2: Sorcerer's Stone, Chapter 10: Halloween</li>\n<li>7-Word Summary: Dinner is interrupted by a massive disturbance </li>\n<li>Major things almost always happen to Harry on Halloween. Micah recounts some of the big ones.</li>\n<li>Are Ron's choice of words against Hermione a bit too much?</li>\n<li>It is Hermione's pronunciation advice which helps Ron successfully tackle the troll!</li>\n<li>Have any of the hosts befriended people they were not expecting to like?</li>\n<li>Examining Hermione's motivations to lie, the act which solidifies her friendship with Harry and Ron.</li>\n<li>HOW is it that Quirrell is not caught or at least hugely suspected for letting in the troll? Should Voldemort have used someone else instead?</li>\n<li>The students of Hogwarts do not seem to dress up for Halloween, but if they DID, Andrew has ideas as to what they would be.</li>\n<li>Harry and the Golden Snitch meet for the first time. Our hearts are all aflutter</li>\n<li>If McGonagall had not discovered Harry's talent during the first flying lesson, when would there be another chance?</li>\n<li>Next Week: Chapter-By-Chapter for Sorcerer's Stone, Chapters 11 and 12!</li>\n<li>Quizzitch: In Chapter 9 of Book 1, Which secret passage out of Hogwarts do the Weasley Twins suspect Lee Jordan has found?</li>\n<li>This week's episode is brought to by the Audible Original <a href=\"https://www.audible.com/pd/The-Sandman-Act-III-Audiobook/B0BFK1K36D\">The Sandman: Act III</a>, Masterclass (go to <a href=\"https://www.Masterclass.com/mugglecast\">Masterclass.com/mugglecast</a> for 15% off an annual subscription), and BetterHelp (Get 10% off your first month at <a href=\"https://www.BetterHelp.com/mugglecast\">BetterHelp.com/mugglecast</a>)</li>\n</ul>\n",
  "pubDate": "Tue, 11 Oct 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-10-10:/posts/8172228",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}