{
  "guid": "urn:uuid:3db3fdb0-10f0-419a-bca8-c145fb4f8beb",
  "link": "https://www.who.int/news/item/03-03-2022-molnupiravir",
  "a10:author": {
    "a10:name": ""
  },
  "title": "WHO updates its treatment guidelines to include molnupiravir",
  "description": "<p><em>This ninth update of WHO&rsquo;s guideline on therapeutics includes a recommendation that casirivimab-imdevimab not be used for patients infected with the Omicron variant</em></p><p>WHO has updated its living guidelines on COVID-19 therapeutics to include a conditional recommendation on molnupiravir, a new antiviral medicine. </p><p>This is the first oral antiviral drug to be included in the treatment guidelines for COVID-19. As this is a new medicine, there is little safety data. WHO recommends active monitoring for drug safety, along with other strategies to mitigate potential harms.</p><p>Because of these concerns and data gaps, molnupiravir should be provided only to non-severe COVID-19 patients with the highest risk of hospitalization. These are typically people who have not received a COVID-19 vaccination, older people, people with immunodeficiencies and people living with chronic diseases. </p><p>Children, and pregnant and breastfeeding women should not be given the drug. People who take molnupiravir should have a contraceptive plan, and health systems should ensure access to pregnancy testing and contraceptives at the point of care. <br /></p><p>Under the care of a health care provider, molnupiravir, an oral tablet, is given as four tablets (total 800 mg) twice daily for five days; within 5 days of symptom onset. Used as early as possible after infection, it can help prevent hospitalization.<br /></p><p>Today&rsquo;s recommendation is based on new data from six randomized controlled trials involving 4796 patients. This is the largest dataset on this drug so far.</p><p>Along with a recommendation on molnupiravir, this ninth update of WHO&rsquo;s living guideline on therapeutics includes an update on casirivimab-imdevimab, a monoclonal antibody cocktail. Based on evidence that this combination of drugs is ineffective against the Omicron variant of concern, WHO now recommends that it is only given when the infection is caused by another variant.</p><p>Molnupiravir is not widely available but steps have been taken towards increasing access, including the signing of a <a href=\"https://www.who.int/news/item/27-10-2021-who-unitaid-statement-on-the-mpp-licensing-agreement-for-molnupiravir\">voluntary licensing agreement</a>. The Access to COVID-19 Tools Accelerator (ACT-A) is making a limited supply available to countries with access constraints. </p><p>WHO has also invited manufacturers to submit their products for prequalification, with a number of manufacturers of molnupiravir going through assessment now. WHO evaluates the quality, safety and efficacy of medical products for United Nations and other large suppliers to low- and middle-income countries. More WHO quality-assured manufacturers mean that countries have a greater choice of products and more competitive prices. &nbsp; </p><p>&nbsp;</p>",
  "pubDate": "Wed, 02 Mar 2022 19:48:10 Z"
}