{
  "title": "517 - ROMA 54 (What Would a World without Sexual Shame Be Like?)",
  "description": "<p>Try to imagine a culture in which children aren't taught that their bodies and desires are dangerous, shameful, and disgusting. What would that be like? Also, I discuss what I got wrong (and right) about the current invasion of Ukraine, and the dangerous phrase, \"freak of nature.\" Lastly, I talk about how life presents a series of \"should I stay or should I go?\" choices that are kind of like rowing away from the island you're on, not knowing when/if you'll find another. Turns out, there may be almost magical indications that can lead us to safety.</p> <p>The situation with the <a href=\"https://www.nytimes.com/2022/02/23/nyregion/columbia-jeffrey-lieberman.html?smid=tw-share\"> Queen of Dark</a>.</p> <p><a href=\"https://www.dailygrail.com/2017/04/water-lightning-the-mysterious-polynesian-navigation-method-known-as-te-lapa-the-flashing/\"> The article</a> about \"Te lapa,\" or \"the flashing.\"</p> <p>Intro music: \"Brightside of the Sun,\" by <a href=\"https://basinandrange.bandcamp.com/\">Basin and Range</a>; </p> <p>This episode is sponsored by <a href=\"http://omgyes.com\" class=\"linkified\" target=\"_blank\">OMGYES.com</a>. <a href=\"https://www.omgyes.com/?o=tg5&utm_source=tangential&cookieConsent=false\"> Click here</a> for 10% off your lifetime membership.</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://chrisryan.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">chrisryan.substack.com/subscribe</a>",
  "link": "https://chrisryan.substack.com/p/517-roma-54-what-would-a-world-without-651",
  "guid": "ec217f3b-0b22-47e9-95b7-937842ac010e",
  "dc:creator": "Chris Ryan",
  "pubDate": "Mon, 28 Feb 2022 08:25:48 GMT",
  "enclosure": "",
  "itunes:author": "Chris Ryan",
  "itunes:subtitle": "Try to imagine a culture in which children aren't taught that their bodies and desires are dangerous, shameful, and disgusting. What would that be like? Also, I discuss what I got wrong (and right) about the current invasion of Ukraine, and the...",
  "itunes:explicit": "No",
  "itunes:duration": 2219,
  "itunes:image": ""
}