{
  "title": "#442: Harry Potter Screenwriter Returns, Cursed Child Inside Look",
  "link": "https://audioboom.com/posts/7420628",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4903,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Finally... <a href=\"https://www.hypable.com/fantastic-beasts-3-more-dumbledore-hogwarts/\">some Fantastic Beasts 3 news</a>!</li>\n<li>What bigger role will Eulalie Hicks play in the upcoming film?</li>\n<li>Steve Kloves returns to his screenwriting role. What does it mean for Potter fans?</li>\n<li>We're going to Rio! Will we see Castelobruxo?</li>\n<li>Why did Crimes of Grindelwald fall flat at the box office? Let's not forget the controversies that preceded it!</li>\n<li>Fantastic Beasts 3 is taking the series back to its Hogwarts roots! Is this a good thing?</li>\n<li>Is there such a thing as too much Hogwarts? We spent seven films there, isn't it time to explore the larger wizarding world?</li>\n<li>Was J.K. Rowling unfairly blamed for the writing in Crimes of Grindelwald?</li>\n<li>Yummy! Fantastic Beasts 3 will provide more breadcrumbs for Potter fans!</li>\n<li>Patrons share how they would like to see Hogwarts and Dumbledore be further incorporated (without it feeling like it was done just to please the fans)</li>\n<li>We give our early predictions for the title of Fantastic Beasts 3!</li>\n<li>We review Harry Potter and the Cursed Child: The Journey: Behind the Scenes of the Award-Winning Stage Production. It makes a great holiday gift!</li>\n<li>It was predestined! The story behind J.K. Rowling and John Tiffany!</li>\n<li>Why did parenting play such a big role in Harry Potter and the Cursed Child?</li>\n<li>Why was Goblet of Fire such a big focus?</li>\n<li>The story behind Dobby, Sirius Black, McGonagall, Luna and Astoria Malfoy!</li>\n<li>Box office woes: why are Cursed Child tickets slumping in Year 2?</li>\n<li>We take voicemails on Dumbledore's middle names and running Dementors</li>\n<li>Join our community at <a href=\"http://www.Patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including early access to the show via our live streams!</li>\n<li>This week's episode of MuggleCast is brought to you by AWAY Travel, a favorite company of Micah and Andrew's. Get $20 off one of their amazing suitcases by visiting <a href=\"http://AWAYTravel.com/muggle\">AWAYTravel.com/muggle</a> and using code 'muggle' at checkout.</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Mon, 11 Nov 2019 13:28:50 +0000",
  "guid": "tag:audioboom.com,2019-11-11:/posts/7420628",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}