{
  "id": "yt:video:TaWBXRaNEcc",
  "yt:videoId": "TaWBXRaNEcc",
  "yt:channelId": "UCrlZs71h3mTR45FgQNINfrg",
  "title": "What do complex functions look like? | Essence of complex analysis #4",
  "link": "",
  "author": {
    "name": "Mathemaniac",
    "uri": "https://www.youtube.com/channel/UCrlZs71h3mTR45FgQNINfrg"
  },
  "published": "2021-10-25T15:00:14+00:00",
  "updated": "2022-09-27T06:38:03+00:00",
  "media:group": {
    "media:title": "What do complex functions look like? | Essence of complex analysis #4",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "A compilation of plots of different complex functions, like adding and multiplying complex constants, exponentiation, the power function (including nth roots), and logarithm. Issues like branch cuts, branch points, and branches in general will also be discussed as the result of inability to construct the plots. Finally, we will do a 4D rotation (composed of two 4D reflections) to the typical Riemann surfaces pictures, and see that it should be the same as its inverse functions.\n\nThe video is going to be jam-packed with visuals and animations, so while it may sometimes be too quick, you can pause the video; or you can just simply appreciate the visuals, the plots, and the animations.\n\nSome interesting plots are usually the vector plots, like for the power functions, we have different regions of flow. The formula of 2(n+1) when n is positive can be left as an exercise - it is not TOO difficult to see why, but it is not the focus of the video, or not the primary feature that I want to discuss; or for negative powers, we have dipole, quadrupole, and octupole, and in general multipole, which might be familiar to physicists, because in electromagnetism, we use multipole expansions to see the dominant effects of the electric field.\n\nWatch the previous video to see what the 5 methods of visualisation I am referring to, and also watch the Problem of Apollonius video for the next video!\n\nVideo chapters:\n00:00 Introduction\n01:01 Adding constant\n02:51 Multiplying constant\n06:14 Exponentiation\n09:47 Power function - integer powers\n14:11 Power function - complex inversion\n15:39 Power function - square root branches\n20:37 Power function - Riemann surfaces\n22:53 Logarithm\n26:51 Logarithm - 4D rotation\n\nMusic used:\nRecollections - Asher Fulero\nStinson - Reed Mathis\nBeseeched - Asher Fulero\nWhite River - Aakash Gandhi\n\nOther than commenting on the video, you are very welcome to fill in a Google form linked below, which helps me make better videos by catering for your math levels:\nhttps://forms.gle/QJ29hocF9uQAyZyH6\n\nIf you want to know more interesting Mathematics, stay tuned for the next video!\n\nSUBSCRIBE and see you in the next video!\n\nIf you are wondering how I made all these videos, even though it is stylistically similar to 3Blue1Brown, I don't use his animation engine Manim, but I will probably reveal how I did it in a potential subscriber milestone, so do subscribe!\n\nSocial media:\n\nFacebook: https://www.facebook.com/mathemaniacyt\nInstagram: https://www.instagram.com/_mathemaniac_/\nTwitter: https://twitter.com/mathemaniacyt\nPatreon: https://www.patreon.com/mathemaniac (support if you want to and can afford to!)\nMerch: https://mathemaniac.myspreadshop.co.uk\n\nFor my contact email, check my About page on a PC.\n\nSee you next time!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}