{
  "title": "Quantum Variational Rewinding for Time Series Anomaly Detection. (arXiv:2210.16438v2 [quant-ph] UPDATED)",
  "link": "http://arxiv.org/abs/2210.16438",
  "description": "<p>Electron dynamics, financial markets and nuclear fission reactors, though\nseemingly unrelated, all produce observable characteristics evolving with time.\nWithin this broad scope, departures from normal temporal behavior range from\nacademically interesting to potentially catastrophic. New algorithms for time\nseries anomaly detection (TAD) are therefore certainly in demand. With the\nadvent of newly accessible quantum processing units (QPUs), exploring a quantum\napproach to TAD is now relevant and is the topic of this work. Our approach -\nQuantum Variational Rewinding, or, QVR - trains a family of parameterized\nunitary time-devolution operators to cluster normal time series instances\nencoded within quantum states. Unseen time series are assigned an anomaly score\nbased upon their distance from the cluster center, which, beyond a given\nthreshold, classifies anomalous behavior. After a first demonstration with a\nsimple and didactic case, QVR is used to study the real problem of identifying\nanomalous behavior in cryptocurrency market data. Finally, multivariate time\nseries from the cryptocurrency use case are studied using IBM's Falcon r5.11H\nfamily of superconducting transmon QPUs, where anomaly score errors resulting\nfrom hardware noise are shown to be reducible by as much as 20% using advanced\nerror mitigation techniques.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/quant-ph/1/au:+Baker_J/0/1/0/all/0/1\">Jack S. Baker</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Horowitz_H/0/1/0/all/0/1\">Haim Horowitz</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Radha_S/0/1/0/all/0/1\">Santosh Kumar Radha</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Fernandes_S/0/1/0/all/0/1\">Stenio Fernandes</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Jones_C/0/1/0/all/0/1\">Colin Jones</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Noorani_N/0/1/0/all/0/1\">Noorain Noorani</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Skavysh_V/0/1/0/all/0/1\">Vladimir Skavysh</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Lamontangne_P/0/1/0/all/0/1\">Philippe Lamontangne</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Sanders_B/0/1/0/all/0/1\">Barry C. Sanders</a>"
}