{
  "title": "Inflation-Adjusted Income for U.S. Engineers Drops",
  "link": "https://spectrum.ieee.org/electrical-engineer-salary",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/illustration-showing-a-dollar-symbol-surrounded-by-circuitboard-lines.png?id=31706643&width=1200&height=800&coordinates=0%2C431%2C0%2C431\"/><br/><br/><p><strong>How much does</strong> a tech professional in the United States earn? In 2021, the median income of U.S. engineers and other tech professionals who were <a href=\"http://www.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE</a> members hit US $160,097, up from $154,443 in 2020. That bump in pay is revealed in the IEEE-USA 2022 Salary & Benefits Survey.</p><p>This apparent increase turns into a nearly $3,500 dip, however, when converted to real dollars [see chart, below]. It’s the first significant dip in median tech salary in terms of spending power recorded by IEEE-USA since 2013.</p><p>These numbers—and 65 more pages of detailed 2021 salary and job-satisfaction statistics—give readers of <a href=\"https://ieeeusa.org/product/ieee-usa-salary-benefits-survey-report-2022-edition/\" target=\"_blank\">the salary and benefits survey</a> a good sense of the United States’ tech employment landscape. The analysis is based on 3,057 responses from professionals working full time in their areas of technical competence; they reported their income, excluding overtime pay, bonuses, profit sharing, and side hustles. (When those are considered, the 2021 median income for these tech professionals was $167,988, according to the report.)</p><h3></h3><br/><h3>Bad News for Women in Engineering</h3><br/><p>The IEEE-USA 2022 Salary & Benefits Survey chronicles bad news for women in engineering, as their incomes fell further behind men’s in 2021. The gap in salaries between genders grew $5,900 (not adjusted for inflation) to $33,900. The gap is tricky to measure, given that men responding to the survey had more years of experience, as a group, than the women, and more women entering the engineering workforce could skew the median salary downward. However, the proportion of female engineers in the workforce remained flat (on a plateau at under 10 percent, where it’s been for the past 10 years), the survey report noted.</p><h3></h3><br/><div class=\"flourish-embed flourish-chart\" data-src=\"visualisation/11071896?594662\"><script src=\"https://public.flourish.studio/resources/embed.js\"></script></div><h3>Racial Gaps in Engineering Salaries Narrow</h3><br/><p>The salary gap between Caucasian and African American engineers decreased by $11,000 to $13,000 in 2021, while the disparity between Caucasian and Hispanic engineers’ incomes fell by nearly $6,000 to $12,278.</p><h3></h3><br/><div class=\"flourish-embed flourish-chart\" data-src=\"visualisation/11071853?594662\"><script src=\"https://public.flourish.studio/resources/embed.js\"></script></div><h3>Solid-State Circuits Engineering Is Hot</h3><br/><p>2021 was a good time to be an engineer working with solid-state circuitry; salaries in that technical field continued a steep climb and claimed the No. 1 spot on the salaries-by-specialty list. Last year’s No. 1 on that chart, consumer electronics, saw a decline in average salary. Engineers working with other circuits and devices, machine learning, image and video processing, and engineering in medicine and biology recorded big gains.</p><h3></h3><br/><h3>Engineering Job Satisfaction Dips</h3><br/><p>Overall job satisfaction for engineers surveyed by IEEE-USA fell in 2021, with the biggest drop-offs related to compensation and advancement opportunities. Satisfaction with the technical challenge of engineering jobs was up significantly, however.</p><h3></h3><br/><div class=\"flourish-embed flourish-chart\" data-src=\"visualisation/11071766?594662\"><script src=\"https://public.flourish.studio/resources/embed.js\"></script></div><h3>Pacific Coast Engineering Salaries Jump Further Ahead</h3><br/><p>Median salaries for engineers in the Pacific region increased dramatically compared with the rest of the <br/>United States, climbing faster than hypothetically booming regions like the West South Central area, which includes Texas. These numbers were not adjusted for regional costs of living, however.</p><h3></h3><br><div class=\"flourish-embed flourish-chart\" data-src=\"visualisation/11071737?594662\"><script src=\"https://public.flourish.studio/resources/embed.js\"></script></div></br>",
  "pubDate": "Thu, 15 Sep 2022 15:13:17 +0000",
  "guid": "https://spectrum.ieee.org/electrical-engineer-salary",
  "category": [
    "Careers",
    "Salaries",
    "Engineering jobs",
    "Engineering salaries",
    "Salary survey"
  ],
  "dc:creator": "Tekla S. Perry",
  "media:content": ""
}