{
  "title": "EPISODE 52 The Lady and Her Gun",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Sun, 28 Jul 2019 00:40:19 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2019/7/28/episode-52-the-lady-and-her-gun",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5d3cede0a5e3b40001d6f70d",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1564274300082-0XYEZRGKKH49J1KN85NS/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5d3cee799b519f000154a702\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1564274300082-0XYEZRGKKH49J1KN85NS/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“It's just incredible that this little hand has killed Nazis, has scythed them down by the hundreds, without missing…”</em> — Charlie Chaplin&nbsp;</p><p class=\"\"><em>“Miss Pavlichenko's well known to fame,&nbsp;<br>Russia's your country,&nbsp;<br>fighting is your game,&nbsp;<br>Your smile shines as bright as any new morning sun,&nbsp;<br>But more than three hundred Nazi dogs fell by your gun.”</em> — Woody Guthrie&nbsp;</p><p class=\"\"><em>“Charging together, we would dash into battle and forget about everything else in the world.” —</em> Lyudmila Pavlichenko</p><p class=\"\"><em>“Gentlemen, I am 25 years old and I have already managed to kill 309 of the fascist invaders. Do you not think, gentlemen, that you have now been hiding behind my back for rather too long?”</em> — Lyudmila Pavlichenko</p><p class=\"\">During WW II, women in the Soviet Union had many reasons to fear German soldiers. But in some cases it was the German soldiers’ turn to be the targets of Soviet ladies. Among the many women who would fight tooth and nail and send quite a few Axis soldiers to a premature death, one stood out among the rest. Germans would know her by name, and would grow to fear her. And they had good reasons to fear her since it was by killing 309 of them that she would become the most deadly female sniper in history. Legends about her would grow both among her own comrades and among the terrified Nazi soldiers who heard rumors about this vengeful female demon who seemed to have made it her personal mission to make them pay for any outrage committed by anyone wearing their same uniform had ever. Some told stories about how a witch in some village near Odessa had cast a spell deflecting enemy bullets away from her. Others swore that she was followed by the lord of the forest himself—a wood sprite with a huge tree-like body who protected her, made her invisible and gave her the supernatural ability to move through the forest without making a sound, to know what was happening a mile away, and to see in complete darkness as well as normal people see in daylight. She was Lyudmila Pavlichenko aka Lady Death. &nbsp;</p><p class=\"\">Among other things, in this episode: Operation Barbarossa, caught between vicious dictators, Stalin (even better than Nazis at killing his own people), Nazi guns in front of you and Soviet guns pointed at your back, a song by Woody Guthrie, Charlie Chaplin kissing her hand, Lyudmila disappoints Yoda, bringing Belgian chocolates as a gift for your girlfriend (after looting them from a corpse), love found & love lost, bloody revenge, hanging out with the American First Lady.&nbsp;</p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "1:45:58",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 52,
  "itunes:title": "EPISODE 52 The Lady and Her Gun",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 52 The Lady and Her Gun"
  }
}