{
  "title": "Teaching Data Science at UM6P",
  "description": "<p>Teaching Data Science is demanding, often intense, sometimes exhausting but always an enriching and extremely rewarding experience. There are magical moments of teacher-student resonance when you can feel the knowledge flowing across the room.</p>\n\n<p>I had the chance of teaching a 2-week session of predictive analytics in Morocco in the fall 2018 with students of the <a href=\"https://www.emines-ingenieur.org/en/\">Emines school of industrial management</a> in their fourth and final year.</p>\n\n<div style=\"clear: both; display: table; width: 50%; margin-left: 0%; float: right\">\n<img src=\"/assets/um6p_campus.png\" alt=\"Mohammed VI Polytechnic University Campus\" width=\"90%\" style=\" float: right\" />\n</div>\n<p>In 2018, the renowned <a href=\"https://www.polytechnique.edu/en\">École Polytechnique</a>, <a href=\"https://www.um6p.ma/\">Mohammed VI Polytechnic University</a> and the Foundation of École Polytechnique <a href=\"https://www.polytechnique.edu/en/content/lx-launched-chair-data-science-and-industrial-processes-morocco\">launched a Chair</a> in “Data Science and Industrial Processes” in Morocco which I inaugurated on the amazing <a href=\"https://www.um6p.ma/\">UM6P</a> campus of the <a href=\"https://www.emines-ingenieur.org/en/\">Emines school of industrial management</a> located in Benguerir Morocco. This campus was designed by the famous architect Ricardo Bofill in 2011. It is quite a sight to <a href=\"http://www.ricardobofill.com/projects/universite-mohammed-vi-polytechnique/\">see</a> and <a href=\"https://www.youtube.com/watch?v=zk0TU_fIEhc\">watch</a>.</p>\n\n<p>The desired outcome of this 2-week course was to give the students a deep and practical understanding of data science and machine-learning in terms of scope and tools with a focus on building a hands-on data-driven experience.</p>\n\n<p>For the students to be able to work on relevant data science problems within just two weeks of teaching is a real challenge. Data science is a multi-faceted activity and several domains have to be taught in parallel: <strong>software engineering</strong> in order to build robust and reproducible scripts, <strong>data science</strong> techniques and workflows to generate reliable results, <strong>probabilistic theory</strong> underlying machine-learning algorithms to go beyond the simple copy-pasting usage of <a href=\"https://scikit-learn.org/\">popular libraries</a>, and most of all, an engineer <strong>can-do attitude</strong> required to tackle real world problems. Data science demands pragmatism, resilience, creativity from students and experienced data scientists alike.</p>\n\n<p>The course was organized to leave a large place to interactions and Q&amp;A between the students and the teacher and to limit the amount of time dedicated to slides-based lectures. Every time a new machine-learning concept or modelisation algorithm was introduced, it was followed by lab work using applied to datasets on increasing complexity and scope. The goal being to expose the students to real-world issues that data scientists often face in predictive analytics projects. The course slides, datasets and scripts are available on <a href=\"https://github.com/alexisperrier/XEmines-datascience\">github</a>.</p>\n\n<div style=\"clear: both; display: table; width: 50%; margin-left: 0%; float: left\">\n<img src=\"/assets/um6p_students.png\" alt=\"Mohammed VI Polytechnic University Students\" width=\"90%\" style=\" float: left\" />\n</div>\n\n<p>In parallel, the students participated in the <a href=\"https://www.kaggle.com/c/house-prices-advanced-regression-techniques\">Iowa Housing Kaggle competition</a> to practice their newly acquired skills in a challenging project. Their enthusiasm was impressive as exclamations of joy broke silent phases of deep focus whenever someone reached a new high score.</p>\n\n<p>To have had the privilege of launching this first session of the DSIP chair with such accomplished and convivial students and engineers was a fantastic experience and a great honor. Thanks to the excellence and enthusiasm of UM6P Emines students, the learning outcomes have been fully reached.</p>\n\n<p>I will have the pleasure to close this year’s data science course in March 2019 by teaching a week-long course this time focused on probabilistic programming and PyMC3.</p>",
  "pubDate": "Fri, 15 Feb 2019 14:00:00 +0000",
  "link": "https://alexisperrier.com/datascience/2019/02/15/datascience-emines.html",
  "guid": "https://alexisperrier.com/datascience/2019/02/15/datascience-emines.html",
  "category": "datascience"
}