{
  "title": "Mistakes? We've Made A Few",
  "itunes:title": "Mistakes? We've Made A Few",
  "pubDate": "Tue, 27 Sep 2022 20:00:00 +0000",
  "guid": "3351b678-b8bf-4fe8-ae71-7124cd0b82f9",
  "link": "https://fool.libsyn.com/mistakes-weve-made-a-few",
  "itunes:image": "",
  "description": "<p>When you don't get what you want, you get experience.<br /> <br /> (0:21) Asit Sharma discusses:<br /> - The S&P 500 hitting a new low for the year<br /> - Seeking out companies with \"fortress balance sheets\"<br /> - Whether Mullen Automotive is a meme stock<br /> - Learning from mistakes and staying in the game<br /> <br /> (11:00) Economists and personal finance authors have very different opinions on topics like savings and investing. Alison Southwick and Robert Brokamp break down the differences and share their own thoughts.<br /> <br /> Got questions about stocks?<br /> Call the Motley Fool Money Hotline at 703-254-1445!<br /> <br /> Stocks discussed: MULN, UA<br /> <br /> Host: Chris Hill<br /> Guests: Jason Moser, Brian Stoffel, Jamie Louko<br /> Producer: Ricky Mulvey<br /> Engineers: Rick Engdahl, Tim Sparks</p>",
  "content:encoded": "<p>When you don't get what you want, you get experience.  (0:21) Asit Sharma discusses: - The S&P 500 hitting a new low for the year - Seeking out companies with \"fortress balance sheets\" - Whether Mullen Automotive is a meme stock - Learning from mistakes and staying in the game  (11:00) Economists and personal finance authors have very different opinions on topics like savings and investing. Alison Southwick and Robert Brokamp break down the differences and share their own thoughts.  Got questions about stocks? Call the Motley Fool Money Hotline at 703-254-1445!  Stocks discussed: MULN, UA  Host: Chris Hill Guests: Jason Moser, Brian Stoffel, Jamie Louko Producer: Ricky Mulvey Engineers: Rick Engdahl, Tim Sparks</p>",
  "enclosure": "",
  "itunes:duration": "26:39",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "When you don't get what you want, you get experience.  (0:21) Asit Sharma discusses: - The S&P 500 hitting a new low for the year - Seeking out companies with \"fortress balance sheets\" - Whether Mullen Automotive is a meme stock - Learning from...",
  "itunes:episodeType": "full"
}