{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-5116837823746666453",
  "published": "2022-11-02T22:55:00.005-05:00",
  "updated": "2022-11-03T10:25:45.328-05:00",
  "category": [
    "",
    "",
    "",
    ""
  ],
  "title": "Academic Freedom Letter",
  "content": "<p>Some colleagues and I created an open letter on Academic Freedom. If you share our views, you are invited to sign.&nbsp;</p><p>The bottom line: we call for universities and professional associations to adopt <i>and implement </i>the&nbsp;&nbsp;<a href=\"https://freeexpression.uchicago.edu\" target=\"_blank\">Chicago Principles</a>&nbsp;of free speech, the<a href=\"https://provost.uchicago.edu/reports/report-universitys-role-political-and-social-action\" target=\"_blank\">&nbsp;Kalven Report&nbsp;</a>requirement for institutional neutrality on political and social matters, and the&nbsp;<a href=\"https://provost.uchicago.edu/sites/default/files/documents/reports/shilsrpt_0.pdf\" target=\"_blank\">Shils report</a>&nbsp;making academic contribution the sole basis for hiring and promotion. &nbsp;</p><p>We include professional societies. That means you, American Economic Association and American Finance Association: With all your committees on improving the profession, you need one big one to defend the most important and imperiled part of the scholarly enterprise, academic freedom.&nbsp;</p><p>The letter, below, is not as comprehensive and detailed as you might like, but we worked to keep it short.&nbsp;</p><p>The official letter and list of signatories <a href=\"https://docs.google.com/document/d/1_vTk2EPGqe_4pjj9KntQLKAKO8ZqfL0Pquj89TlazYA/edit?usp=sharing\" target=\"_blank\">lives here</a>. If you would like to sign, you can do so by <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSfh0gtHHwLk2sD4Z2EUKA2y8M-nzem_MZhbVaL3zEzCFhnj9w/viewform\" target=\"_blank\">filling out this form</a>. It's moderated so may take a day or two for your signature to show.&nbsp;</p><p>We are up to 626 signatures (11/3). When the number stabilizes we'll try to make a public fuss about the letter.&nbsp;</p><p><i>Update:</i> A special plea. I have several responses from left/liberal/democrat colleagues who say they would sign, but don't want to have their names on a letter that doesn't have enough other left/liberal/democrat names on it and does have well known deplorables. (How you know 626 people's politics is beyond me, but ok.) That reaction tells us a big part of the problem. &nbsp;All along we have tried very hard to reach out to self-described left/liberal/democrat colleagues, who privately bemoan what's going on but are too afraid to be seen in public. But why not fix it: if some of you sign perhaps that will give courage for more of you to sign. Take it over, get together with your friends, add lots of signatures, make this your cause, prove that we can stand together for freedom!&nbsp;</p><p style=\"text-align: center;\"><b>Restoring Academic Freedom</b></p><p>The mission of the university is the pursuit of truth and the advancement and dissemination of knowledge. A robust culture of free speech and academic freedom is essential to that mission: Intellectual progress often threatens the status quo and is resisted. Bad ideas are only weeded out by unfettered critical analysis.&nbsp;</p><p>Unfortunately, academic freedom and freedom of speech are rapidly declining in academic institutions, including universities, professional societies, journals, and funding agencies. Researchers whose findings challenge dominant narratives find it increasingly hard to get published, funded, hired, or promoted. They, and teachers who question current orthodoxies, are harassed in person and online, ostracized, subjected to opaque university disciplinary procedures, fired, or canceled by other means. Employment, promotion, and funding are increasingly subject to implicit or explicit political litmus tests, including approval from bureaucrats seeking to impose a social agenda such as specific views of social justice or DEI principles. Activism is replacing inquiry and debate. &nbsp;An increasing number of simple facts and ideas cannot even be mentioned without risk of retribution.<span></span></p><a name='more'></a><p></p><p>Public high-profile victims are the tip of the iceberg. An atmosphere of fear and self-censorship pervades academia. Many faculty and students believe they cannot voice their views, question dogmas, investigate certain topics, or question the loss of academic freedom without risking ostracization and damage to their careers. Knowledge is lost, and many talented scholars are leaving academia.&nbsp;</p><p>Universities and professional societies are failing to resist such illiberal forces–which have arisen many times throughout history, from all sides of the political spectrum –and to defend academic freedom and freedom of speech.&nbsp;</p><p>Many universities and professional organizations now qualify their support for freedom: free speech, they say, so long as the speech does not offend or exclude; free speech, so long as it does not challenge institutionally approved narratives and conceptions of social justice; free speech, but only within narrow credentialed boundaries. These restrictions are counterproductive, even to their goal of advancing a particular ideology. People infer from censorship a desire to protect lies from being exposed. Historically, censorship has supported monstrous regimes and their ideologies. Bad ideas are only defeated by argument and persuasion, not by suppression. True justice and freedom cannot exist without each other. &nbsp;</p><p>The loss of academic freedom results in part from a leadership crisis. While many university leaders issue statements that support open debate, they nonetheless oversee and expand politicized bureaucracies that harass, intimidate, and punish those who express views deemed to be incorrect and enforce ideological conformity in hiring and promotions. A boilerplate generic defense of free speech does little good if at the same time university administrators conduct investigations in secret, without due process, and based on anonymous complaints; if administrators publicly ostracize the victim to all potential future employers. Boards of trustees, alumni organizations, donors, government granting agencies, and other institutional stakeholders likewise fail to uphold the principles of academic freedom.&nbsp;</p><p>Universities and professional organizations are instead moving headlong into institutional political and ideological activism. Departments and other university units make public statements of political views, thus effectively branding as heretics -and even bigots- members who may question those causes. Increasingly, centers and “accelerators” are devoted to political and policy advocacy, advocacy of the supporting ideologies, and suppression of competing ideas. Professional organizations and journals announce, all too often, &nbsp;that certain kinds of research, no matter how methodologically valid, may not be published, and have turned to advocacy. University bureaucracies demand that certain authors be included and others excluded from reading lists and classroom discussion.</p><p>What can be done?&nbsp;</p><p>We call for all Universities, academic associations, journals, and national academies to adopt the “Chicago Trifecta,” consisting of the <a href=\"https://freeexpression.uchicago.edu\" target=\"_blank\">Chicago Principles</a> of free speech, the<a href=\"https://provost.uchicago.edu/reports/report-universitys-role-political-and-social-action\" target=\"_blank\"> Kalven Report </a>requirement for institutional neutrality on political and social matters, and the <a href=\"https://provost.uchicago.edu/sites/default/files/documents/reports/shilsrpt_0.pdf\" target=\"_blank\">Shils report</a> making academic contribution the sole basis for hiring and promotion. &nbsp;</p><p>The Kalven report emphasizes, &nbsp;“To perform its mission in society, a university must sustain an extraordinary environment of freedom of inquiry and maintain an independence from political fashions, passions, and pressures.’’ &nbsp;The University and its administrative subunits must abstain from taking position on the political issues of the day: &nbsp;“While the university is the home and sponsor of critics, it is not itself the critic and therefore cannot take collective action on the issues of the day without endangering the conditions for its existence and effectiveness.”&nbsp;</p><p>“The neutrality of the university as an institution arises … not from lack of courage nor out of indifference and insensitivity. &nbsp;It arises out of respect for free inquiry and the obligation to cherish a diversity of viewpoints.”</p><p>We also call for faculty to create (or join existing) non-partisan associations, aimed at defending these values on campus, and at a national level such as FIRE, the Academic Freedom Alliance, Heterodox Academy, FAIR and ACTA. Professional organizations should prioritize the defense of academic freedom and free speech of their members.&nbsp;</p><p>Many universities have officially adopted the Chicago Principles. Robust structures must be developed to uphold these principles. Faculty under fire from student groups, other faculty, deans and administrators, or university staff, must be able to effectively assert their freedom of speech and inquiry by appealing to those statements.&nbsp;</p><p>Universities must deploy safeguards to ensure that administrators work to uphold these principles rather than to undermine them. &nbsp;University disciplinary procedures must become transparent, following basic centuries-old protections of the accused such as the right to see and challenge evidence, confront witnesses against them, the right to representation, and innocence until proven guilty.&nbsp;</p><p>University leaders must also promote and institutionalize free speech and academic freedom by concrete actions. Freedom is a culture, not merely a set of rules, and a culture must be nurtured. Free speech, free inquiry, tolerance for opposing views, meeting such views with argument, logic and fact, abstaining from ad-hominem attacks, character assassination, doxing and other unethical behavior must be highlighted in the orientation materials for all new students and employees. Freedom comes with a culture of responsibility, but responsibilities are better enforced by social norms than by extensive rules enforced by non-academic bureaucrats. &nbsp;If community members or groups petition school leaders for the sanction or punishment of a faculty member or a student for expressing their point of view, university leaders should publicly and clearly respond with a statement affirming that the University is a place to discuss and debate all views, and that an attempt to punish others for having “incorrect” views is incompatible with the community standards of the school. &nbsp;The University should also commit to all students, faculty, and employees, that it will not punish or sanction free expression. &nbsp;&nbsp;</p><div><br /></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 11
}