{
  "title": "U.S. Fixed Income: When will the Treasury Market Rally?",
  "description": "<p>As the Fed continues with aggressive policy tightening, fixed income investors may be wondering if the bond market is accurately priced and when we might see it rally. Chief Cross-Asset Strategist Andrew Sheets and Director of Fixed Income Research Vishy Tirupattur discuss.</p><p><br></p><p>-----Transcript-----</p><p><br></p><p>Andrew Sheets: Welcome to Thoughts on the Market. I'm Andrew Sheets, Chief Cross-Asset Strategist for Morgan Stanley Research.&nbsp;</p><p><br></p><p>Vishy Tirupattur: And I'm Vishy Tirupattur, Director of Fixed Income Research at Morgan Stanley.&nbsp;</p><p><br></p><p>Andrew Sheets: And today on the podcast, we'll be discussing the outlook for the U.S. bond markets. It's Tuesday, June 28th, at 9 a.m. in San Francisco.&nbsp;</p><p><br></p><p>Andrew Sheets: A note to our listeners, Vishy and I are recording this while we're on the road talking to clients, so if the audio quality sounds a little bit different, we hope you'll bear with us.&nbsp;</p><p><br></p><p>Andrew Sheets: So Vishy, this has been a historically volatile start to the year for U.S. fixed income. We've seen some of the largest bond market losses in 40 years. Before we get into our views going forward, maybe just give a little bit of perspective about how you see this year so far, and what's been driving the market.&nbsp;</p><p><br></p><p>Vishy Tirupattur: Andrew, what's been driving the market is the significant and substantial change in the monetary policy expectations, not only in the U.S. but also across most developed market economies. That means we started the year with the target Fed funds rate around close to 0%, and we have now ratcheted up quite significantly. And markets are already pricing in a further substantial increase in the Fed funds rate going forward. All this has meant that the duration sensitive parts of the bond market have taken it on the chin.&nbsp;</p><p><br></p><p>Andrew Sheets: So Vishy that's interesting because we might be seeing kind of a transition in the market narrative as we head in the second half. What do you think the bond market, especially the Treasury market, is currently pricing in terms of Fed expectations? And do you think the bond market is priced for a recession?&nbsp;</p><p><br></p><p>Vishy Tirupattur: I think bond market is sending some signals here. So the bond market is pricing that the Fed will continue to combat high inflation by being aggressively frontloaded in interest rate hikes. So this frontloading of the interest rate hikes means the front end of the Treasury curve perhaps has some more to go. And we expect that the end of the year, the two year Treasury will be at 4%. But on the other hand, the ten year Treasury, we expect the year at 350. That means the market is already beginning to become concerned about how growth and growth prospects for the U.S. economy will work out in the next 6 to 12 months. So by all measures we can look at the probability of a recession have significantly increased. That is what is being priced in the market at this point.&nbsp;</p><p><br></p><p>Andrew Sheets: You know, I think it's safe to say that the dominant story, right, to start the year has been these upside surprises to inflation and then central banks, including the Fed, racing to catch up to those upside inflation surprises. And yet it's really interesting the way that Chair Powell and the Fed are now describing the way they're going to react to inflation is to say that we will effectively keep tightening policy as long as inflation surprises to the upside. But isn't the Fed using a tool that works with a lag?</p><p><br></p><p>Vishy Tirupattur: That is absolutely correct Andrew. What the withdrawal of policy accommodation that the Fed is accomplishing through these frontloaded hikes is tightening of financial conditions. We have begun to see some effect of this tightening of financial conditions on the economic growth already. But in reality, the long experience suggest that these effects will be lagged anywhere between 6 to 18 months. So this is what our economists are thinking, given this frontloaded hiking path. We think the Fed will stop hiking towards the end of this year in December, and we will watch for how these tighter financial conditions will restrain aggregate demand and slow the growth or slow the U.S. economy over the course of the next 6, 12, 18 months.&nbsp;</p><p><br></p><p>Andrew Sheets: So Vishy, I'd like to move next into what all this means for our fixed income recommendations and to run through the major sectors of that market. So let's start with Treasuries. What do you see as our key views in the Treasury market? And where do you think we might differ the most from what's currently in market pricing?&nbsp;</p><p><br></p><p>Vishy Tirupattur: I think we are still neutral in taking duration risk at this point. I expect that in the not so distant future we would become constructive on taking interest rate risk to the Treasury market. So our expectation is that a year from now, so second quarter of next year, ten year Treasury will be at three or five.&nbsp;</p><p><br></p><p>Andrew Sheets: And Vishy, you know, we're in this environment where inflation is high and usually high inflation is bad for bonds. But growth is slowing, which is good for bonds. So, you know, given that push and pull, how do we think treasuries come out of that?&nbsp;</p><p><br></p><p>Vishy Tirupattur: I think Treasuries will come out pretty well out of this. Why I say that is that the bulk of the pain from aggressive monetary policy has already been felt and taken in the market. So going forward, our expectation is not for incrementally more aggressive policy pops to be priced, but actually something that is more or less in line with already what is priced in the market.&nbsp;</p><p><br></p><p>Andrew Sheets: Vishy, the next market I want to ask you about is the mortgage market. This is another huge part of the aggregate bond index. How do we think mortgages perform? Do we think they perform better or worse than the Treasury segment?&nbsp;</p><p><br></p><p>Vishy Tirupattur: So the mortgage market is interesting. We started the year with the the generic mortgage rate around 3%. It had gone up almost to 6%, more or less doubled over the course of the last six months or so. So embedded in the mortgage market is a mortgage spread, but around 130 basis points of nominal mortgage spread is nearly at an all time high. And we think that that means a lot of this expectation coming out of higher rates, a slowing of the housing market, is already well priced into the mortgage market. So my expectation is that going forward, the mortgage market, will outperform the treasury market over the course of the next 6 to 12 months.&nbsp;</p><p><br></p><p>Andrew Sheets: And Vishy, you know we talked about treasuries and we talked about mortgages and I probably can't ask you about those markets without also asking about quantitative tightening. The fact that the Fed has been big buyers, both Treasuries and mortgage bonds, and the Fed is going to stop doing that and is going to let its holdings of those securities roll off. So how important is that to the outlook for these markets? And is that quantitative tightening already in the price?&nbsp;</p><p><br></p><p>Vishy Tirupattur: So two things on this. There is something called a stock effect and the flow effect. We think the stock effect component of the quantitative tightening, both in the context of treasuries and in the context of NBS, is mostly priced in. The flow effect will begin to manifest itself as the quantitative tightening actually begins to happen and we see this portfolio rebalancing channel to actually materialize. All that means is that the portfolio managers that had been underweight mortgages and overweight credit. We think that will change in favor of mortgages going from underweight towards neutral and credit going from overweight towards neutral.&nbsp;</p><p><br></p><p>Andrew Sheets: So the last market I want to ask you about was the credit market, which is, I think, especially relevant given we've seen more market discussion of the risk to growth, the probability of a recession, the potential that defaults usually pick up during periods of weak economic growth. How do you see the outlook for corporate bonds fitting into this picture?&nbsp;</p><p><br></p><p>Vishy Tirupattur: So if you look at the corporate bond market, the good thing here is that compared to other points at the beginning of a rate hiking cycle, the fundamentals of corporate bond market are in really good shape. You can see that in terms of leverage, interest coverage, as well as cash and balance sheet metrics. So that's a good thing. The second thing is that the financing needs of many of these companies is not as imposing as would otherwise being the case. Take the high yield market, high yield market and the leveraged loan market together about 3 trillion outstanding market. Only 10% of this is due for refinancing over the course of this year, 2022, 2023 and 2024. That means the world of maturities being an imposing challenge for the credit markets is that much, well, manageable. But that said, there's one segment of the market that is more vulnerable to hiking to higher interest rates, and that is the leveraged loan market, which is a floating rate funding market. So we expect that this market will see its cost of financing increase as interest rates start to get ratcheted up. But the one point I want to make here is that in terms of expectations of default rates, we won't see a dramatic spike in default rates the way we have seen in the past recessions. So compared to 2008-2009 recession, the post-COVID recession, early 2000's recession, in all of those instances when we had an economic slowdown and a recession, we saw a spike in corporate default rates. Because of the starting point of fundamentally is so much better this time, our expectation is that we will not see dramatic spikes in default rates in the credit market.</p><p><br></p><p>Andrew Sheets: Vishy, thanks for taking the time to talk.&nbsp;</p><p><br></p><p>Vishy Tirupattur: Always a pleasure to talk to you, Andrew.&nbsp;</p><p><br></p><p>Andrew Sheets: Thanks for listening. If you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcast app. It helps more people find the show.&nbsp;</p>",
  "itunes:title": "U.S. Fixed Income: When will the Treasury Market Rally?",
  "itunes:episodeType": "full",
  "itunes:episode": 646,
  "itunes:summary": "As the Fed continues with aggressive policy tightening, fixed income investors may be wondering if the bond market is accurately priced and when we might see it rally. Chief Cross-Asset Strategist Andrew Sheets and Director of Fixed Income Research Vishy Tirupattur discuss.",
  "content:encoded": "<p>As the Fed continues with aggressive policy tightening, fixed income investors may be wondering if the bond market is accurately priced and when we might see it rally. Chief Cross-Asset Strategist Andrew Sheets and Director of Fixed Income Research Vishy Tirupattur discuss.</p><p><br></p><p>-----Transcript-----</p><p><br></p><p>Andrew Sheets: Welcome to Thoughts on the Market. I'm Andrew Sheets, Chief Cross-Asset Strategist for Morgan Stanley Research.&nbsp;</p><p><br></p><p>Vishy Tirupattur: And I'm Vishy Tirupattur, Director of Fixed Income Research at Morgan Stanley.&nbsp;</p><p><br></p><p>Andrew Sheets: And today on the podcast, we'll be discussing the outlook for the U.S. bond markets. It's Tuesday, June 28th, at 9 a.m. in San Francisco.&nbsp;</p><p><br></p><p>Andrew Sheets: A note to our listeners, Vishy and I are recording this while we're on the road talking to clients, so if the audio quality sounds a little bit different, we hope you'll bear with us.&nbsp;</p><p><br></p><p>Andrew Sheets: So Vishy, this has been a historically volatile start to the year for U.S. fixed income. We've seen some of the largest bond market losses in 40 years. Before we get into our views going forward, maybe just give a little bit of perspective about how you see this year so far, and what's been driving the market.&nbsp;</p><p><br></p><p>Vishy Tirupattur: Andrew, what's been driving the market is the significant and substantial change in the monetary policy expectations, not only in the U.S. but also across most developed market economies. That means we started the year with the target Fed funds rate around close to 0%, and we have now ratcheted up quite significantly. And markets are already pricing in a further substantial increase in the Fed funds rate going forward. All this has meant that the duration sensitive parts of the bond market have taken it on the chin.&nbsp;</p><p><br></p><p>Andrew Sheets: So Vishy that's interesting because we might be seeing kind of a transition in the market narrative as we head in the second half. What do you think the bond market, especially the Treasury market, is currently pricing in terms of Fed expectations? And do you think the bond market is priced for a recession?&nbsp;</p><p><br></p><p>Vishy Tirupattur: I think bond market is sending some signals here. So the bond market is pricing that the Fed will continue to combat high inflation by being aggressively frontloaded in interest rate hikes. So this frontloading of the interest rate hikes means the front end of the Treasury curve perhaps has some more to go. And we expect that the end of the year, the two year Treasury will be at 4%. But on the other hand, the ten year Treasury, we expect the year at 350. That means the market is already beginning to become concerned about how growth and growth prospects for the U.S. economy will work out in the next 6 to 12 months. So by all measures we can look at the probability of a recession have significantly increased. That is what is being priced in the market at this point.&nbsp;</p><p><br></p><p>Andrew Sheets: You know, I think it's safe to say that the dominant story, right, to start the year has been these upside surprises to inflation and then central banks, including the Fed, racing to catch up to those upside inflation surprises. And yet it's really interesting the way that Chair Powell and the Fed are now describing the way they're going to react to inflation is to say that we will effectively keep tightening policy as long as inflation surprises to the upside. But isn't the Fed using a tool that works with a lag?</p><p><br></p><p>Vishy Tirupattur: That is absolutely correct Andrew. What the withdrawal of policy accommodation that the Fed is accomplishing through these frontloaded hikes is tightening of financial conditions. We have begun to see some effect of this tightening of financial conditions on the economic growth already. But in reality, the long experience suggest that these effects will be lagged anywhere between 6 to 18 months. So this is what our economists are thinking, given this frontloaded hiking path. We think the Fed will stop hiking towards the end of this year in December, and we will watch for how these tighter financial conditions will restrain aggregate demand and slow the growth or slow the U.S. economy over the course of the next 6, 12, 18 months.&nbsp;</p><p><br></p><p>Andrew Sheets: So Vishy, I'd like to move next into what all this means for our fixed income recommendations and to run through the major sectors of that market. So let's start with Treasuries. What do you see as our key views in the Treasury market? And where do you think we might differ the most from what's currently in market pricing?&nbsp;</p><p><br></p><p>Vishy Tirupattur: I think we are still neutral in taking duration risk at this point. I expect that in the not so distant future we would become constructive on taking interest rate risk to the Treasury market. So our expectation is that a year from now, so second quarter of next year, ten year Treasury will be at three or five.&nbsp;</p><p><br></p><p>Andrew Sheets: And Vishy, you know, we're in this environment where inflation is high and usually high inflation is bad for bonds. But growth is slowing, which is good for bonds. So, you know, given that push and pull, how do we think treasuries come out of that?&nbsp;</p><p><br></p><p>Vishy Tirupattur: I think Treasuries will come out pretty well out of this. Why I say that is that the bulk of the pain from aggressive monetary policy has already been felt and taken in the market. So going forward, our expectation is not for incrementally more aggressive policy pops to be priced, but actually something that is more or less in line with already what is priced in the market.&nbsp;</p><p><br></p><p>Andrew Sheets: Vishy, the next market I want to ask you about is the mortgage market. This is another huge part of the aggregate bond index. How do we think mortgages perform? Do we think they perform better or worse than the Treasury segment?&nbsp;</p><p><br></p><p>Vishy Tirupattur: So the mortgage market is interesting. We started the year with the the generic mortgage rate around 3%. It had gone up almost to 6%, more or less doubled over the course of the last six months or so. So embedded in the mortgage market is a mortgage spread, but around 130 basis points of nominal mortgage spread is nearly at an all time high. And we think that that means a lot of this expectation coming out of higher rates, a slowing of the housing market, is already well priced into the mortgage market. So my expectation is that going forward, the mortgage market, will outperform the treasury market over the course of the next 6 to 12 months.&nbsp;</p><p><br></p><p>Andrew Sheets: And Vishy, you know we talked about treasuries and we talked about mortgages and I probably can't ask you about those markets without also asking about quantitative tightening. The fact that the Fed has been big buyers, both Treasuries and mortgage bonds, and the Fed is going to stop doing that and is going to let its holdings of those securities roll off. So how important is that to the outlook for these markets? And is that quantitative tightening already in the price?&nbsp;</p><p><br></p><p>Vishy Tirupattur: So two things on this. There is something called a stock effect and the flow effect. We think the stock effect component of the quantitative tightening, both in the context of treasuries and in the context of NBS, is mostly priced in. The flow effect will begin to manifest itself as the quantitative tightening actually begins to happen and we see this portfolio rebalancing channel to actually materialize. All that means is that the portfolio managers that had been underweight mortgages and overweight credit. We think that will change in favor of mortgages going from underweight towards neutral and credit going from overweight towards neutral.&nbsp;</p><p><br></p><p>Andrew Sheets: So the last market I want to ask you about was the credit market, which is, I think, especially relevant given we've seen more market discussion of the risk to growth, the probability of a recession, the potential that defaults usually pick up during periods of weak economic growth. How do you see the outlook for corporate bonds fitting into this picture?&nbsp;</p><p><br></p><p>Vishy Tirupattur: So if you look at the corporate bond market, the good thing here is that compared to other points at the beginning of a rate hiking cycle, the fundamentals of corporate bond market are in really good shape. You can see that in terms of leverage, interest coverage, as well as cash and balance sheet metrics. So that's a good thing. The second thing is that the financing needs of many of these companies is not as imposing as would otherwise being the case. Take the high yield market, high yield market and the leveraged loan market together about 3 trillion outstanding market. Only 10% of this is due for refinancing over the course of this year, 2022, 2023 and 2024. That means the world of maturities being an imposing challenge for the credit markets is that much, well, manageable. But that said, there's one segment of the market that is more vulnerable to hiking to higher interest rates, and that is the leveraged loan market, which is a floating rate funding market. So we expect that this market will see its cost of financing increase as interest rates start to get ratcheted up. But the one point I want to make here is that in terms of expectations of default rates, we won't see a dramatic spike in default rates the way we have seen in the past recessions. So compared to 2008-2009 recession, the post-COVID recession, early 2000's recession, in all of those instances when we had an economic slowdown and a recession, we saw a spike in corporate default rates. Because of the starting point of fundamentally is so much better this time, our expectation is that we will not see dramatic spikes in default rates in the credit market.</p><p><br></p><p>Andrew Sheets: Vishy, thanks for taking the time to talk.&nbsp;</p><p><br></p><p>Vishy Tirupattur: Always a pleasure to talk to you, Andrew.&nbsp;</p><p><br></p><p>Andrew Sheets: Thanks for listening. If you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcast app. It helps more people find the show.&nbsp;</p>",
  "guid": "gid://art19-episode-locator/V0/_mHcJ2VPcgTh_7TRconwc_ZZU0wA0ivm8GHyrKT7y18",
  "pubDate": "Tue, 28 Jun 2022 22:07:19 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:keywords": "market-trends",
  "itunes:duration": "00:09:36",
  "enclosure": ""
}