{
  "title": "TU161: Managing Unconscious Defense &#038; Fear with Ann Kelley PhD and Sue Marriott LCSW, CGP",
  "link": "https://therapistuncensored.com/episodes/managing-unconscious-defensiveness-fear-with-ann-kelley-phd-and-sue-marriott-lcsw-cgp-ep161/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=managing-unconscious-defensiveness-fear-with-ann-kelley-phd-and-sue-marriott-lcsw-cgp-ep161",
  "pubDate": "Tue, 02 Nov 2021 02:00:56 +0000",
  "guid": "https://therapistuncensored.com/?p=12016",
  "description": "Overcome defense and fear -  Catch up with hosts Ann Kelley and Sue Marriott while they discuss the difference between cognitive understanding of modern attachment and regulation and the bottom-up experience of it.  We distort information coming in - either by not registering interpersonal information or by over-interpreting the importance of an exchange (up-regulating with fear). This is an unconscious process that to undo we have to have the courage and the resources to feel the feelings that cause us to defend.  They walk through it with you they don&#039;t just tell you what to do, so join us in understanding our own defensive process.  Find episode notes at therapistuncensored.com/episodes.",
  "enclosure": "",
  "itunes:subtitle": "How to summon your courage and your resources to feel feelings you are attempting to avoid",
  "itunes:summary": "Overcome defense and fear to move towards \"green\" or grounding.  Catch up with hosts Ann Kelley and Sue Marriott while they discuss the difference between cognitive understanding of modern attachment and regulation and the bottom-up, experience of it.  We distort information coming in - either by not registering interpersonal information or by over-interpreting the importance of an exchange (up-regulating with fear). This is an unconscious process that to undo we have to have the courage and the resource to feel the feelings that cause us to defend.  They walk through it with you they don&#039;t just tell you what to do, so join us in understanding our own defensive process.  Find episode notes at therapistuncensored.com/episodes.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:season": 6,
  "itunes:episode": 161,
  "itunes:title": "Managing Unconscious Defense and Fear with Ann Kelley and Sue Marriott",
  "itunes:duration": "43:39"
}