{
  "title": "Ep 436: Wine Faults -- what are they, how to spot them, and what to do about them",
  "itunes:title": "Ep 436: Wine Faults -- what are they, how to spot them, and what to do about them",
  "pubDate": "Tue, 02 Aug 2022 03:18:00 +0000",
  "guid": "b6f8f28c-4768-4bb3-83cf-f3f4ede020ec",
  "link": "https://winefornormalpeople.libsyn.com/ep-436-wine-faults-what-are-they-how-to-spot-them-and-what-to-do-about-them",
  "itunes:image": "",
  "description": "<p>Wine is a product of nature, human intervention, chemistry, and it’s subject to many outside influences – storage, transport, handling – that can do a number on what’s inside the bottle. In this episode, we cover the main things that could go wrong with wine, how they got there, and what to do about it (where possible)!</p> <p><img style= \"display: block; margin-left: auto; margin-right: auto;\" src= \"https://assets.libsyn.com/secure/show/45638/wine-g86b59c5f2_640.jpg\" alt=\"\" width=\"400\" height=\"264\" /></p> <p style=\"text-align: center;\"><em><span style= \"font-size: 8pt;\">Photo: Pixabay</span></em></p> <p>Shout out to <a href=\"https://www.wineanorak.com/wineblog/\" target=\"_blank\" rel=\"noopener\">Jamie Goode</a>, the outstanding scientist and wine writer who makes so many complex science concepts so easy to understand. Here is the link to his book, “<strong><a href= \"https://www.amazon.com/dp/0520379500/ref=as_sl_pc_as_ss_li_til?tag=winefornorm05-20&linkCode=w00&linkId=c3af9f29c64eb3d1c88941f2b802d26c&creativeASIN=0520379500\" target=\"_blank\" rel=\"noopener\">The Science of Wine from Vine to Glass</a>,”*</strong> from which some of the reference materials for the pod were taken. Also to <a href= \"https://www.amazon.com/dp/142622141X/ref=as_sl_pc_as_ss_li_til?tag=winefornorm05-20&linkCode=w00&linkId=b8f2aead6636a7ff41eb9dbb1a330e47&creativeASIN=142622141X\" target=\"_blank\" rel=\"noopener\">“<strong>Sotheby’s Wine Encyclopedia</strong>,”</a> * who (always with the humor of Tom Stevenson) brings up a number of very real faults that a lot of the mainstream wine press forget to mention (sauerkraut, anyone?). Other sources are below!</p> <p> </p> <p>Here are the show notes:</p> <p>We start with defining what a flaw is in a wine, versus a taint, as defined by <a href=\"https://www.wineanorak.com/wineblog/\" target=\"_blank\" rel=\"noopener\">Jamie Goode</a>. Then we talk about just plain old sucky wine.</p> <p><strong>Flaw v Taint:</strong></p> <ul> <li>Flaw is endemic to the wine, it happened in winemaking or vineyard</li> <li>Taint is from outside winemaking, like from packaging or from the winery</li> <li>We discuss the Japanese concept that talks about how small flaws can accentuate beauty (it is called <a href= \"https://en.wikipedia.org/wiki/Wabi-sabi\" target=\"_blank\" rel= \"noopener\"><strong><em>Wabi-Sabi,</em></strong> the art of imperfection</a>). Not all technical flaws are bad!</li> </ul> <p> </p> <p> </p> <p><strong>NOT FLAWS:</strong> Next we tackle things that need to be dealt with, but aren’t flaws or taints:</p> <ol> <li><strong>Sediment:</strong> <ul> <li><strong>What is it?</strong> Tannin chains combining and falling out of solution. Looks like your coffee filter threw up or there are brown flakes in the wine.</li> <li><strong style=\"text-align: center;\">What do you do?</strong> <span style=\"text-align: center;\">Decant, get a filter</span></li> </ul> </li> </ol> <p style=\"text-align: center;\"><br /> <img style=\"display: block; margin-left: auto; margin-right: auto;\" src= \"https://assets.libsyn.com/secure/show/45638/Untitled_design_1.png\" alt=\"\" width=\"400\" height=\"268\" /><span style= \"font-size: 8pt;\"><em>Sediment on a glass from Canva Images</em></span><br /> <br /></p> <ol> <li><strong>Cork floating in your wine</strong>: <ul> <li><strong>What is it</strong>? User error or an old cork. If you break the cork when you take it out, it may drop some flakes into the wine. If it’s an old cork, this is even more likely!</li> <li><strong>What do you do</strong>? Fish it out with you finger, a spoon, or get a filter</li> </ul> </li> </ol> <p><br /> <br /></p> <ol start=\"3\"> <li><strong>Film/oily looking stuff on the surface</strong>: <ul> <li><strong>What is it?</strong> Most likely it’s dishwashing soap residue from either glasses or decanter</li> <li><strong>What do you do?</strong> Clean your glasses of the residue, send the glass back if you’re in a restaurant. At home, warm water is often good enough to clean wine glasses as long as you have a good brush</li> </ul> </li> </ol> <p> </p> <ol start=\"4\"> <li><strong>Bubblegum, pear drop, nail-polish like aromas</strong>: <ul> <li><strong>What is it?</strong> These aromas come from carbonic maceration, a red winemaking technique where the winemaker ferments the grapes with no oxygen or yeast. Instead they use carbon dioxide to promote the conversion of sugar and malic acid to alcohol. Byproducts of this process are these aromas, and more to boot. Overly cool fermentations can also cause these types of aromas.</li> <li><strong>What do you do?</strong> If you hate this, chuck the bottle or give it away and remember you don’t like wines made with carbonic maceration. Never buy Beaujolais Nouveau!</li> </ul> </li> </ol> <p><br /> <br /></p> <ol start=\"5\"> <li><strong>Tartrate crystals:</strong> <ul> <li><strong>What is it?</strong> Crystals appear either on the side of the cork that was in contact with the wine or, often, at the bottom of the glass in white wines. Tartaric acid was not fined, filtered or stabilized out so tartaric acid crystals formed and the wine cleaned itself up naturally!</li> <li><strong>What do you do?</strong> Dare I say it again? Get a filter and get them out if they are in your wine. If they are on the cork, admire how pretty they are and enjoy the wine.</li> </ul> </li> </ol> <p><strong><br /> <br /></strong></p> <ol start=\"6\"> <li><strong>Earthiness, green pepper notes:</strong> <ul> <li><strong>What is it?</strong> Just normal wine flavors. The earthiness could be from terroir or it could be the grape. Green pepper is from a compound called methoxypyrazine that is common in Cabernet Sauvignon and its parents, Cabernet Franc and Sauvignon Blanc</li> <li><strong>What do you do?</strong> If you love it, drink wines with those profiles. If not, there are plenty of wines without these characteristics</li> </ul> </li> </ol> <p><br /> <br /></p> <p>Before getting into the major faults, I discuss one that is on the line:</p> <ul> <li><strong>Cloudy/Hazy wine:</strong> If it’s not sediment causing the problem, it could be protein. It may settle out or it may just be part of the wine. Natural wines and unfiltered wines have haze often. Just proceed with caution if you see it. It could be fine or indicate a flaw to come.</li> </ul> <p> </p> <p><strong> </strong></p> <p><strong>Then we hit the hard-core flaws</strong></p> <p><strong> </strong></p> <p><strong>1. Cork taint</strong></p> <ul> <li><strong>What is it?</strong> It comes across as musty, wet dog, wet wool, cardboard or, at lower levels, as a wine with acidity and bitterness but no fruit flavor. It is caused by a molecule called TCA, which lives in the pockets of corks but also barrels, cardboard, wood cases, and corks (so yes, screw cap wines can have taint!)</li> </ul> <p> </p> <ul> <li><strong>What do you do?</strong> About 1-3 bottles in 100 have TCA taint, since cork is better chosen and sanitized now. People also use cork alternatives – plastic corks, screw caps, etc, but event those aren’t foolproof. If you get a corked wine, return it. There’s no fixing it (although occasionally if the wine is just musty, a good swirl and some time will bring it back)</li> </ul> <p><strong> </strong></p> <p style=\"text-align: center;\"><strong><img style= \"display: block; margin-left: auto; margin-right: auto;\" src= \"https://assets.libsyn.com/secure/show/45638/background-g303e97603_640.jpg\" alt=\"\" width=\"400\" height=\"300\" /></strong><span style= \"font-size: 8pt;\"><em>Photo: Pexels </em></span></p> <p><strong> </strong></p> <p><strong>2. Oxidation</strong></p> <ul> <li><strong>What is it?</strong> When too much oxygen enters the wine in production, bottling, or storage (the cork or screw cap wasn’t affixed properly), the wine can be exposed to too much oxygen. Oxygen is important to making a wine taste great when it’s in your glass but if it has too much oxygen before you are ready to drink it, it can make white wines a little brown/tawny, reds a little orange/brown. They will have Sherry-like notes, which shouldn’t be there and they will acquire nutty, smelly caramel notes in reds or, if it occurs with Volatile Acidity – vinegar notes. Oxidized wine can also be flat in flavor and aroma</li> </ul> <p><strong> </strong></p> <ul> <li><strong>What do you do?</strong> If it tastes ok to you, drink it! It won’t get better so if you hate it and it’s oxidized, bring it back</li> </ul> <p> </p> <p><strong> </strong></p> <p><strong> </strong></p> <p><strong>3. Volatile acidity (VA)</strong></p> <ul> <li><strong>What is it?</strong> When acetic acid or lactic bacteria is present on the grapes or in the winemaking and has these substances have sufficient oxygen to grow, the wine will taste like vinegar, or nail polish remover. At low levels, VA can present savory and sweet notes that taste good, but at high levels the wine is undrinkable.<br /> <br /></li> <li><strong>What do you do?</strong> Bring it back for an exchange or refund</li> </ul> <p><strong> </strong></p> <p> </p> <p><strong>5. Reduction/sulfur issues</strong></p> <ul> <li><strong>What is it?</strong> If you make wine in a reductive fashion – with very little oxygen and utilize too much sulfur, things can go wrong. Yeast make volatile sulfur compounds and things go bad quickly. Hopefully the winemaker catches it before bottling. If not, your wine will smell like burnt rubber, skunk, onion, garlic, rotten eggs, and smelly drains. These are ethyl mercaptans and they are so gross.</li> </ul> <p><strong> </strong></p> <ul> <li><strong>What do you do?</strong> If any of the above listed smells are in your wine, return it. There is one related thing, however, that may be ok: the smell of matchstick or flint. You may find those aromas in wines that have been made in a reductive fashion. If you swirl or aerate the wine, it will blow off. If your wine has a struck match aroma, rather than a burnt one, give it a few minutes before you issue a verdict and return it.</li> </ul> <p> </p> <p style=\"text-align: center;\"><img style= \"display: block; margin-left: auto; margin-right: auto;\" src= \"https://assets.libsyn.com/secure/show/45638/skunk-g148d40b37_640.png\" alt=\"\" width=\"286\" height=\"284\" /><span style= \"font-size: 8pt;\"><br /> Reductive wines can smell like skunk!  Photo: Pixabay</span></p> <p> </p> <p><strong>5. Maderized wine</strong></p> <ul> <li><strong>What is it?</strong> The wine has been cooked from poor storage or transport. Often these wines are also oxidized (bonus!). They taste like stewed fruit, burnt caramel, and jam. If you look at cork you may see wine leaking out, and when you remove the cork, there is often wine up and down the sides</li> </ul> <p> </p> <ul> <li><strong>What do you do?</strong> The wine is toast. You can’t save it, so return it.</li> </ul> <p> </p> <p> </p> <p><strong>6. Bubbles in a still wine:</strong></p> <ul> <li><strong>What is it?</strong> Carbon dioxide has infiltrated the wine. It could be added for texture and style fizz like in Vinho Verde, some Austrian and German wines. OR, and this is the flaw, the wine was bottles with too much residual sugar after fermentation, and yeast were still alive. That fizz is an unplanned secondary fermentation happening in the bottle: re-fermentation has started</li> </ul> <p> </p> <ul> <li><strong>What do you do?</strong> If it’s intentional, it’s great. You can swirl to get the bubbles out and that sometimes works if you don’t like seeing bubbles (or you can just make peace with them)! If it’s frothy from secondary fermentation – it’s spoiled, bring it back to the shop.</li> </ul> <p> </p> <p> </p> <p> </p> <p><strong>7. Lightstrike</strong></p> <ul> <li><strong>What is it?</strong> Ultraviolet (UV) and blue rays from artificial lights and the sun break up amino acids in wine and cause it to stink like cabbage, cauliflower, farmyard/poo skunk, and cardboard. This fault happens most often with whites and wine in clear bottles. According to San Francisco retailer J.J. Buckley, clear bottles block only 10% of light, amber bottles block 90% of light, and green bottles block 50% of light. That means whites and rosés in clear bottles are especially susceptible.</li> </ul> <p> </p> <ul> <li><strong>What do you do?</strong> The bottle is ruined, return it</li> </ul> <p style=\"text-align: center;\"><img style= \"display: block; margin-left: auto; margin-right: auto;\" src= \"https://assets.libsyn.com/secure/show/45638/cabbage-g3aa0e09fa_640.jpg\" alt=\"\" width=\"400\" height=\"266\" /><span style= \"font-size: 8pt;\"><em>Cabbage smelling wine is often from Lightstrike<br /> Photo: Pixabay<br /></em></span></p> <p><strong> </strong><strong> </strong></p> <p><strong>8. Brettanomyces:</strong></p> <ul> <li><strong>What is it?</strong> Metabolites produced by yeast called <em>Brettanomyces bruxellensis</em> – (shortened to <em>brett</em> in wine parlance), wait around until AFTER fermentation, then they consume the residual sugar saccharomyces cerevisiae (normal yeast) have left. The byproducts are flavor chemicals that can lead to manure, horse saddle, band aid, medicinal, and metallic notes. This happens mostly in red wines, as white wines have acidity to protect them.</li> </ul> <p> </p> <ul> <li><strong>What do you do?</strong> How you view the wine is really based on taste. Flavors vary based on the strain of brett, and the level of it in the wine. At low levels it adds gaminess, earthiness, spice, and savory notes to the wine. It can be hard to pinpoint in a wine. If you like these types of flavors, you likely enjoy brett. If not, stick with more New World wines from larger wineries, as they really try to eliminate all traces of the metabolite!</li> </ul> <p><strong> </strong></p> <p><strong> </strong></p> <p><strong>9. Mousy</strong></p> <ul> <li><strong>What is it?</strong> In wines without sulfite protection, mainly natural wines these days, the wine has a few molecules that smell like a mouse or mouse pee. The wine can seem fine when you open it but then the aroma and flavor can appear as the wine is in the glass. Often it just stinks right from the get-go</li> </ul> <p> </p> <ul> <li><strong>What do you do?</strong> Sensitivity varies. Some people hate it, some are ok with it. Some can really detect it, others don’t notice it. Again, it’s down to personal choice whether or not you return the wine for the flaw or accept and like it.</li> </ul> <p> </p> <p><strong>10. Smoke taint</strong></p> <p style=\"text-align: center;\"><strong><img style= \"display: block; margin-left: auto; margin-right: auto;\" src= \"https://assets.libsyn.com/secure/show/45638/ross-stone-KWYTn9_QKRE-unsplash.jpg\" alt=\"\" width=\"400\" height=\"267\" /></strong><span style= \"font-size: 8pt;\"><em>Fires in California have caused smoke taint. Photo: Unsplash</em></span></p> <p> </p> <ul> <li><strong>What is it?</strong> A direct result of nearby wildfires. According to Australian research, grapes are most susceptible to smoke, ash, ashtray, singed, and cured meat notes if fires are near the grapes from the period after veraison (when grapes change color, the last stage of ripening) through harvest. Flavor compounds permeate the skins, especially and the result is red wines that are nearly impossible to save. Whites from wildfire vintages are usually ok, as there is no skin contact necessary and the pulp is protected by the skins, but red wines can’t be fixed without affecting wine quality, for now.</li> </ul> <p> </p> <ul> <li><strong>What do you do?</strong> For now, there is no solution to smoke taint. If you see a wine is from a vintage and an area that had wildfires, caveat emptor. Some wineries will release a wine even if it’s like choking on an ashtray. Better to stick with whites from the area, if you can.</li> </ul> <p> </p> <p><strong> _______________________________</strong></p> <p><strong>Other stuff not always on the taint list!</strong></p> <p><strong> </strong></p> <p><strong>Soapiness:</strong> Happens when acids produced by yeast are like salts: Caprylic acid salt (decanoic acid), and leave a soapy taste especially in white wines. They smell like soap but are fruitier. This note is common in high-alcohol wines. (Source: the \"Le Nez Du Vin\" wine faults kit and Sotheby’s Wine Encyclopedia). Like everything, a small amount is tolerable, a larger amount is a fault (and of course, make sure that soapiness isn’t from actual soap, as previously mentioned)</p> <p style=\"text-align: center;\"><img style= \"display: block; margin-left: auto; margin-right: auto;\" src= \"https://assets.libsyn.com/secure/show/45638/soap-g8ac067c7c_640.jpg\" alt=\"\" width=\"166\" height=\"250\" /><em><span style= \"font-size: 8pt;\">Soapiness is a fault in a wine! </span></em></p> <p> </p> <p><strong>Cheese:</strong> If it’s subtle or in an old Riesling, cheese notes are usually good and integrate with the wine’s flavors. If it’s more like stinky cheese, it’s from ethyl butryrate and the wine is done: Take it back</p> <p> </p> <p> </p> <p><strong>Geranium</strong> notes in sweet wines are from sorbic acid or the degradation of geraniol aromas. It is considered a flaw, as are the phenol off-flavors of <strong>Carnation</strong> notes. Whether or not you like the wine is a matter of taste, but in high concentrations, it is gross and a flaw.</p> <p><strong> </strong></p> <p><strong>Sauerkraut</strong> notes are a bridge too far beyond sour milk or sour cream and are from too much bacteria in the malolactic fermentation. Yuck! This is a definite return to the shop!</p> <p> </p> <p> </p> <p>This is by no means a total and complete list, but we did the best we can and hopefully it will help you ID what is a flawed or tainted wine and what is just a wine that is poorly made and bad.</p> <p> </p> <p> _______________________________________________________________</p> <p>Thanks to our sponsors this week:</p> <p><a href=\"http://www.winespies.com/normal\" target=\"_blank\" rel= \"noopener\"><img class=\"img-responsive\" style=\"float: right;\" src= \"https://assets.libsyn.com/secure/show/45638/Wine_Spies_Logo.jpg\" alt=\"\" width=\"216\" height=\"113\" /></a></p> <p> <a href=\"http://www.winespies.com/normal\" target=\"_blank\" rel=\"noopener\">Wine Spies</a> uncovers incredible wines at unreal prices - on Zinfandel, Barolo, Champagne...you name it - up to 75% off! It’s not a club and there’s no obligation to buy. They have a build-a-case option, so you can mix and match wines while enjoying free shipping on every purchase. Visit <a href= \"http://www.winespies.com/normal\" target=\"_blank\" rel= \"noopener\">www.winespies.com/normal</a> you’ll get $10 credit to use on your first order! Check them out today!</p> <p> </p> <p><a href=\"http://www.patreon.com/winefornormalpeople\"><img class= \"img-responsive\" style=\"float: right;\" src= \"https://assets.libsyn.com/secure/show/45638/width_100_Patreon.jpg\" alt=\"\" width=\"100\" height=\"100\" /></a></p> <p>If you think our podcast is worth the price of a bottle or two of wine a year, please become a member of Patreon... you'll get even more great content, live interactions and classes! </p> <p><a href= \"http://www.patreon.com/winefornormalpeople\">www.patreon.com/winefornormalpeople</a></p> <p align=\"center\"> </p> <p align=\"center\">To register for an AWESOME, LIVE WFNP class with Elizabeth go to: <a href= \"http://www.winefornormalpeople.com/classes\">www.winefornormalpeople.com/classes</a></p> <p align=\"center\"> </p> <p align=\"center\">*<em><sup>The books have affiliate links on which I earn a small commission at no additional cost to you.</sup></em></p>",
  "content:encoded": "<p>Wine is a product of nature, human intervention, chemistry, and it’s subject to many outside influences – storage, transport, handling – that can do a number on what’s inside the bottle. In this episode, we cover the main things that could go wrong with wine, how they got there, and what to do about it (where possible)!</p> <p></p> <p style=\"text-align: center;\"><em>Photo: Pixabay</em></p> <p>Shout out to <a href=\"https://www.wineanorak.com/wineblog/\" target=\"_blank\" rel=\"noopener\">Jamie Goode</a>, the outstanding scientist and wine writer who makes so many complex science concepts so easy to understand. Here is the link to his book, “<a href= \"https://www.amazon.com/dp/0520379500/ref=as_sl_pc_as_ss_li_til?tag=winefornorm05-20&linkCode=w00&linkId=c3af9f29c64eb3d1c88941f2b802d26c&creativeASIN=0520379500\" target=\"_blank\" rel=\"noopener\">The Science of Wine from Vine to Glass</a>,”* from which some of the reference materials for the pod were taken. Also to <a href= \"https://www.amazon.com/dp/142622141X/ref=as_sl_pc_as_ss_li_til?tag=winefornorm05-20&linkCode=w00&linkId=b8f2aead6636a7ff41eb9dbb1a330e47&creativeASIN=142622141X\" target=\"_blank\" rel=\"noopener\">“Sotheby’s Wine Encyclopedia,”</a> * who (always with the humor of Tom Stevenson) brings up a number of very real faults that a lot of the mainstream wine press forget to mention (sauerkraut, anyone?). Other sources are below!</p> <p> </p> <p>Here are the show notes:</p> <p>We start with defining what a flaw is in a wine, versus a taint, as defined by <a href=\"https://www.wineanorak.com/wineblog/\" target=\"_blank\" rel=\"noopener\">Jamie Goode</a>. Then we talk about just plain old sucky wine.</p> <p>Flaw v Taint:</p> <ul> <li>Flaw is endemic to the wine, it happened in winemaking or vineyard</li> <li>Taint is from outside winemaking, like from packaging or from the winery</li> <li>We discuss the Japanese concept that talks about how small flaws can accentuate beauty (it is called <a href= \"https://en.wikipedia.org/wiki/Wabi-sabi\" target=\"_blank\" rel= \"noopener\"><em>Wabi-Sabi,</em> the art of imperfection</a>). Not all technical flaws are bad!</li> </ul> <p> </p> <p> </p> <p>NOT FLAWS: Next we tackle things that need to be dealt with, but aren’t flaws or taints:</p> <ol> <li>Sediment: <ul> <li>What is it? Tannin chains combining and falling out of solution. Looks like your coffee filter threw up or there are brown flakes in the wine.</li> <li>What do you do? Decant, get a filter</li> </ul> </li> </ol> <p style=\"text-align: center;\"> <em>Sediment on a glass from Canva Images</em> </p> <ol> <li>Cork floating in your wine: <ul> <li>What is it? User error or an old cork. If you break the cork when you take it out, it may drop some flakes into the wine. If it’s an old cork, this is even more likely!</li> <li>What do you do? Fish it out with you finger, a spoon, or get a filter</li> </ul> </li> </ol> <p> </p> <ol start=\"3\"> <li>Film/oily looking stuff on the surface: <ul> <li>What is it? Most likely it’s dishwashing soap residue from either glasses or decanter</li> <li>What do you do? Clean your glasses of the residue, send the glass back if you’re in a restaurant. At home, warm water is often good enough to clean wine glasses as long as you have a good brush</li> </ul> </li> </ol> <p> </p> <ol start=\"4\"> <li>Bubblegum, pear drop, nail-polish like aromas: <ul> <li>What is it? These aromas come from carbonic maceration, a red winemaking technique where the winemaker ferments the grapes with no oxygen or yeast. Instead they use carbon dioxide to promote the conversion of sugar and malic acid to alcohol. Byproducts of this process are these aromas, and more to boot. Overly cool fermentations can also cause these types of aromas.</li> <li>What do you do? If you hate this, chuck the bottle or give it away and remember you don’t like wines made with carbonic maceration. Never buy Beaujolais Nouveau!</li> </ul> </li> </ol> <p> </p> <ol start=\"5\"> <li>Tartrate crystals: <ul> <li>What is it? Crystals appear either on the side of the cork that was in contact with the wine or, often, at the bottom of the glass in white wines. Tartaric acid was not fined, filtered or stabilized out so tartaric acid crystals formed and the wine cleaned itself up naturally!</li> <li>What do you do? Dare I say it again? Get a filter and get them out if they are in your wine. If they are on the cork, admire how pretty they are and enjoy the wine.</li> </ul> </li> </ol> <p> </p> <ol start=\"6\"> <li>Earthiness, green pepper notes: <ul> <li>What is it? Just normal wine flavors. The earthiness could be from terroir or it could be the grape. Green pepper is from a compound called methoxypyrazine that is common in Cabernet Sauvignon and its parents, Cabernet Franc and Sauvignon Blanc</li> <li>What do you do? If you love it, drink wines with those profiles. If not, there are plenty of wines without these characteristics</li> </ul> </li> </ol> <p> </p> <p>Before getting into the major faults, I discuss one that is on the line:</p> <ul> <li>Cloudy/Hazy wine: If it’s not sediment causing the problem, it could be protein. It may settle out or it may just be part of the wine. Natural wines and unfiltered wines have haze often. Just proceed with caution if you see it. It could be fine or indicate a flaw to come.</li> </ul> <p> </p> <p> </p> <p>Then we hit the hard-core flaws</p> <p> </p> <p>1. Cork taint</p> <ul> <li>What is it? It comes across as musty, wet dog, wet wool, cardboard or, at lower levels, as a wine with acidity and bitterness but no fruit flavor. It is caused by a molecule called TCA, which lives in the pockets of corks but also barrels, cardboard, wood cases, and corks (so yes, screw cap wines can have taint!)</li> </ul> <p> </p> <ul> <li>What do you do? About 1-3 bottles in 100 have TCA taint, since cork is better chosen and sanitized now. People also use cork alternatives – plastic corks, screw caps, etc, but event those aren’t foolproof. If you get a corked wine, return it. There’s no fixing it (although occasionally if the wine is just musty, a good swirl and some time will bring it back)</li> </ul> <p> </p> <p style=\"text-align: center;\"><em>Photo: Pexels </em></p> <p> </p> <p>2. Oxidation</p> <ul> <li>What is it? When too much oxygen enters the wine in production, bottling, or storage (the cork or screw cap wasn’t affixed properly), the wine can be exposed to too much oxygen. Oxygen is important to making a wine taste great when it’s in your glass but if it has too much oxygen before you are ready to drink it, it can make white wines a little brown/tawny, reds a little orange/brown. They will have Sherry-like notes, which shouldn’t be there and they will acquire nutty, smelly caramel notes in reds or, if it occurs with Volatile Acidity – vinegar notes. Oxidized wine can also be flat in flavor and aroma</li> </ul> <p> </p> <ul> <li>What do you do? If it tastes ok to you, drink it! It won’t get better so if you hate it and it’s oxidized, bring it back</li> </ul> <p> </p> <p> </p> <p> </p> <p>3. Volatile acidity (VA)</p> <ul> <li>What is it? When acetic acid or lactic bacteria is present on the grapes or in the winemaking and has these substances have sufficient oxygen to grow, the wine will taste like vinegar, or nail polish remover. At low levels, VA can present savory and sweet notes that taste good, but at high levels the wine is undrinkable. </li> <li>What do you do? Bring it back for an exchange or refund</li> </ul> <p> </p> <p> </p> <p>5. Reduction/sulfur issues</p> <ul> <li>What is it? If you make wine in a reductive fashion – with very little oxygen and utilize too much sulfur, things can go wrong. Yeast make volatile sulfur compounds and things go bad quickly. Hopefully the winemaker catches it before bottling. If not, your wine will smell like burnt rubber, skunk, onion, garlic, rotten eggs, and smelly drains. These are ethyl mercaptans and they are so gross.</li> </ul> <p> </p> <ul> <li>What do you do? If any of the above listed smells are in your wine, return it. There is one related thing, however, that may be ok: the smell of matchstick or flint. You may find those aromas in wines that have been made in a reductive fashion. If you swirl or aerate the wine, it will blow off. If your wine has a struck match aroma, rather than a burnt one, give it a few minutes before you issue a verdict and return it.</li> </ul> <p> </p> <p style=\"text-align: center;\"> Reductive wines can smell like skunk!  Photo: Pixabay</p> <p> </p> <p>5. Maderized wine</p> <ul> <li>What is it? The wine has been cooked from poor storage or transport. Often these wines are also oxidized (bonus!). They taste like stewed fruit, burnt caramel, and jam. If you look at cork you may see wine leaking out, and when you remove the cork, there is often wine up and down the sides</li> </ul> <p> </p> <ul> <li>What do you do? The wine is toast. You can’t save it, so return it.</li> </ul> <p> </p> <p> </p> <p>6. Bubbles in a still wine:</p> <ul> <li>What is it? Carbon dioxide has infiltrated the wine. It could be added for texture and style fizz like in Vinho Verde, some Austrian and German wines. OR, and this is the flaw, the wine was bottles with too much residual sugar after fermentation, and yeast were still alive. That fizz is an unplanned secondary fermentation happening in the bottle: re-fermentation has started</li> </ul> <p> </p> <ul> <li>What do you do? If it’s intentional, it’s great. You can swirl to get the bubbles out and that sometimes works if you don’t like seeing bubbles (or you can just make peace with them)! If it’s frothy from secondary fermentation – it’s spoiled, bring it back to the shop.</li> </ul> <p> </p> <p> </p> <p> </p> <p>7. Lightstrike</p> <ul> <li>What is it? Ultraviolet (UV) and blue rays from artificial lights and the sun break up amino acids in wine and cause it to stink like cabbage, cauliflower, farmyard/poo skunk, and cardboard. This fault happens most often with whites and wine in clear bottles. According to San Francisco retailer J.J. Buckley, clear bottles block only 10% of light, amber bottles block 90% of light, and green bottles block 50% of light. That means whites and rosés in clear bottles are especially susceptible.</li> </ul> <p> </p> <ul> <li>What do you do? The bottle is ruined, return it</li> </ul> <p style=\"text-align: center;\"><em>Cabbage smelling wine is often from Lightstrike Photo: Pixabay</em></p> <p>  </p> <p>8. Brettanomyces:</p> <ul> <li>What is it? Metabolites produced by yeast called <em>Brettanomyces bruxellensis</em> – (shortened to <em>brett</em> in wine parlance), wait around until AFTER fermentation, then they consume the residual sugar saccharomyces cerevisiae (normal yeast) have left. The byproducts are flavor chemicals that can lead to manure, horse saddle, band aid, medicinal, and metallic notes. This happens mostly in red wines, as white wines have acidity to protect them.</li> </ul> <p> </p> <ul> <li>What do you do? How you view the wine is really based on taste. Flavors vary based on the strain of brett, and the level of it in the wine. At low levels it adds gaminess, earthiness, spice, and savory notes to the wine. It can be hard to pinpoint in a wine. If you like these types of flavors, you likely enjoy brett. If not, stick with more New World wines from larger wineries, as they really try to eliminate all traces of the metabolite!</li> </ul> <p> </p> <p> </p> <p>9. Mousy</p> <ul> <li>What is it? In wines without sulfite protection, mainly natural wines these days, the wine has a few molecules that smell like a mouse or mouse pee. The wine can seem fine when you open it but then the aroma and flavor can appear as the wine is in the glass. Often it just stinks right from the get-go</li> </ul> <p> </p> <ul> <li>What do you do? Sensitivity varies. Some people hate it, some are ok with it. Some can really detect it, others don’t notice it. Again, it’s down to personal choice whether or not you return the wine for the flaw or accept and like it.</li> </ul> <p> </p> <p>10. Smoke taint</p> <p style=\"text-align: center;\"><em>Fires in California have caused smoke taint. Photo: Unsplash</em></p> <p> </p> <ul> <li>What is it? A direct result of nearby wildfires. According to Australian research, grapes are most susceptible to smoke, ash, ashtray, singed, and cured meat notes if fires are near the grapes from the period after veraison (when grapes change color, the last stage of ripening) through harvest. Flavor compounds permeate the skins, especially and the result is red wines that are nearly impossible to save. Whites from wildfire vintages are usually ok, as there is no skin contact necessary and the pulp is protected by the skins, but red wines can’t be fixed without affecting wine quality, for now.</li> </ul> <p> </p> <ul> <li>What do you do? For now, there is no solution to smoke taint. If you see a wine is from a vintage and an area that had wildfires, caveat emptor. Some wineries will release a wine even if it’s like choking on an ashtray. Better to stick with whites from the area, if you can.</li> </ul> <p> </p> <p> _______________________________</p> <p>Other stuff not always on the taint list!</p> <p> </p> <p>Soapiness: Happens when acids produced by yeast are like salts: Caprylic acid salt (decanoic acid), and leave a soapy taste especially in white wines. They smell like soap but are fruitier. This note is common in high-alcohol wines. (Source: the \"Le Nez Du Vin\" wine faults kit and Sotheby’s Wine Encyclopedia). Like everything, a small amount is tolerable, a larger amount is a fault (and of course, make sure that soapiness isn’t from actual soap, as previously mentioned)</p> <p style=\"text-align: center;\"><em>Soapiness is a fault in a wine! </em></p> <p> </p> <p>Cheese: If it’s subtle or in an old Riesling, cheese notes are usually good and integrate with the wine’s flavors. If it’s more like stinky cheese, it’s from ethyl butryrate and the wine is done: Take it back</p> <p> </p> <p> </p> <p>Geranium notes in sweet wines are from sorbic acid or the degradation of geraniol aromas. It is considered a flaw, as are the phenol off-flavors of Carnation notes. Whether or not you like the wine is a matter of taste, but in high concentrations, it is gross and a flaw.</p> <p> </p> <p>Sauerkraut notes are a bridge too far beyond sour milk or sour cream and are from too much bacteria in the malolactic fermentation. Yuck! This is a definite return to the shop!</p> <p> </p> <p> </p> <p>This is by no means a total and complete list, but we did the best we can and hopefully it will help you ID what is a flawed or tainted wine and what is just a wine that is poorly made and bad.</p> <p> </p> <p> _______________________________________________________________</p> <p>Thanks to our sponsors this week:</p> <p><a href=\"http://www.winespies.com/normal\" target=\"_blank\" rel= \"noopener\"></a></p> <p> <a href=\"http://www.winespies.com/normal\" target=\"_blank\" rel=\"noopener\">Wine Spies</a> uncovers incredible wines at unreal prices - on Zinfandel, Barolo, Champagne...you name it - up to 75% off! It’s not a club and there’s no obligation to buy. They have a build-a-case option, so you can mix and match wines while enjoying free shipping on every purchase. Visit <a href= \"http://www.winespies.com/normal\" target=\"_blank\" rel= \"noopener\">www.winespies.com/normal</a> you’ll get $10 credit to use on your first order! Check them out today!</p> <p> </p> <p><a href=\"http://www.patreon.com/winefornormalpeople\"></a></p> <p>If you think our podcast is worth the price of a bottle or two of wine a year, please become a member of Patreon... you'll get even more great content, live interactions and classes! </p> <p><a href= \"http://www.patreon.com/winefornormalpeople\">www.patreon.com/winefornormalpeople</a></p> <p align=\"center\"> </p> <p align=\"center\">To register for an AWESOME, LIVE WFNP class with Elizabeth go to: <a href= \"http://www.winefornormalpeople.com/classes\">www.winefornormalpeople.com/classes</a></p> <p align=\"center\"> </p> <p align=\"center\">*<em>The books have affiliate links on which I earn a small commission at no additional cost to you.</em></p>",
  "enclosure": "",
  "itunes:duration": "52:07",
  "itunes:explicit": false,
  "itunes:keywords": "taint,Flaws,winemaking,faults,corkedwine,winefault,wineflaws",
  "itunes:subtitle": "Wine is a product of nature, human intervention, chemistry, and it’s subject to many outside influences – storage, transport, handling – that can do a number on what’s inside the bottle. In this episode, we cover the main things that could go...",
  "itunes:episode": 436,
  "itunes:episodeType": "full",
  "itunes:author": "Elizabeth Schneider"
}