{
  "title": "19: Episode 18",
  "link": "https://audioboom.com/posts/7316388",
  "itunes:episode": 19,
  "itunes:title": "Episode 18",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3822,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On our December 04th, 2005 edition of MuggleCast…<br>\n<br>\n\n</div>\n<div>Absent during the First War, was it for Harry’s protection or their own that Arthur and Molly joined the Order of the Phoenix this time around? While the crew debates Molly’s employment status, just what would happen if Chris Columbus landed the job for directing the final two films? And what was the intent behind Draco trying to befriend Harry in <em>Sorcerer’s Stone</em> – murder or power? Plus, join the cast for the premiere of “The Las Vegas Minute.”<br>\n<br>\n\n</div>\n<ul>\n<li>Sue returns the favor as Micah’s News goes on hiatus</li>\n<li>Andrew releases our Listener Survey demographic results</li>\n<li>Kevin and Laura’s Book Review begins next week (“His Dark Materials: The Golden Compass” by Phillip Pullman)</li>\n<li>Micah announces the new transcriber…and faces jail time</li>\n<li>The return of Jamie Lawrence?</li>\n<li>All access character discussion on Molly Weasley</li>\n<li>How will she react to Snape’s betrayal?</li>\n<li>Is she employed? How do the Weasleys afford to get by?</li>\n<li>Why did she and Arthur wait to join the Order and what’s her primary role in it?</li>\n<li>Andrew thinks Mr. Weasley’s Patronus is a rubber duck</li>\n<li>“Dude, he works with toasters.”</li>\n<li>Is Molly overprotective of Harry?</li>\n<li>The crew is split on if Chris Columbus should return for the final two movies</li>\n<li>Andrew hits a high note</li>\n<li>What was Draco’s agenda in Book 1? To truly befriend Harry or was it part of a larger plot?</li>\n<li>Was Harry and Cho’s relationship paid enough attention in Movie 4?</li>\n<li>Laura gives her <em>Goblet of Fire</em> review</li>\n<li>The usual sections: Andrew’s Listener Challenge, Spy on Spartz, and Ben’s Top 10</li>\n<li>The Las Vegas Minute</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Sun, 04 Dec 2005 00:00:00 +0000",
  "guid": "tag:audioboom.com,2019-07-15:/posts/7316388",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}