{
  "title": "The New Math of Multistakeholderism",
  "link": "https://sloanreview.mit.edu/article/the-new-math-of-multistakeholderism/",
  "comments": "https://sloanreview.mit.edu/article/the-new-math-of-multistakeholderism/#respond",
  "pubDate": "Thu, 27 Oct 2022 11:00:54 +0000",
  "dc:creator": "Jonathan Knowles and B. Tom Hunsaker. <p>Jonathan Knowles is the founder of the advisory firm Type 2 Consulting. B. Tom Hunsaker is on the strategy and leadership faculty at Arizona State University’s Thunderbird School of Global Management.</p>\n",
  "category": [
    "Change Management",
    "Investor Relations",
    "Stakeholders",
    "Strategic Leadership",
    "Sustainable Business Practices",
    "Business Models",
    "Developing Strategy",
    "Financial Management & Risk",
    "Social Responsibility",
    "Strategy"
  ],
  "description": "The defining characteristic of shareholder capitalism is that one type of stakeholder — investors — is elevated above all others. But when financial performance and total shareholder returns are used as the ultimate measure of performance, it is inevitable that many companies will skimp on their other responsibilities as employers, innovators, partners, taxpayers, and local [&#8230;]",
  "content:encoded": "<p></p>\n<figure class=\"article-inline\">\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/2022_1027-Hunsaker-1290x860-1.jpg\" alt=\"\" /><br />\n</figure>\n<p>The defining characteristic of shareholder capitalism is that one type of stakeholder — investors — is elevated above all others. But when financial performance and total shareholder returns are used as the ultimate measure of performance, it is inevitable that many companies will skimp on their other responsibilities as employers, innovators, partners, taxpayers, and local citizens.</p>\n<p>A new <a href=\"https://sloanreview.mit.edu/article/did-jack-welch-blow-up-the-business-world/\">book by David Gelles</a>, <cite>The Man Who Broke Capitalism</cite> (Simon & Schuster, 2022), narrates how General Electric CEO Jack Welch myopically pursued <a href=\"https://sloanreview.mit.edu/strategy-forum/has-strategic-management-overlooked-the-role-of-purpose-what-experts-say/\">Milton Friedman’s doctrine</a> that the sole duty of business is to increase its profits. In the process, Welch systematically underinvested in people, innovation, brands, and environmental stewardship. In doing so, he created the conditions for decline at GE and, via his direct proteges and acolytes (such as the founders of 3G Capital), similar declines at companies such as Boeing and Kraft Heinz. </p>\n<p></p>\n<p>The shift away from a sole focus on financial returns to multistakeholder capitalism has involved a welcome rediscovery of the idea that businesses are social entities that are embedded in a network of economic relationships — a concept that was popularized in the 1990s by management thinkers such as Arie de Geus and Charles Handy. Recent business reporting has focused on the increased attention being given to stakeholders other than investors and customers. The Great Resignation and <a href=\"https://sloanreview.mit.edu/article/five-ways-managers-can-help-prevent-quiet-quitting/\">quiet quitting</a> are both manifestations of the importance of employees and the long-term consequences of treating them indifferently, while ESG (environmental, social, and governance) efforts involves giving a voice to those stakeholders (such as future generations and communities) whose interests were often overlooked under shareholder capitalism.</p>\n<p>However, there is a fundamental point about multistakeholder capitalism that has not yet been fully appreciated: It involves a different kind of math because it views business as a dynamic system rather than just a mechanism for allocating capital to its most productive use. </p>\n<p>The math of shareholder capitalism is <em>compensatory</em>: A deficiency in one aspect of the business, such as a <a href=\"https://sloanreview.mit.edu/article/how-to-fix-a-toxic-culture/\">toxic culture</a> or poor environmental performance, is outweighed by stellar near-term financial performance. The math of multistakeholder capitalism, on the other hand, is <em>combinatorial</em>, taking into account the health of each type of stakeholder, since all are regarded as essential to the economic and social sustainability of the system. This is not easy to achieve, even for companies that claim to care about moving in this direction, and it requires informed and sustained commitment to implement. It goes beyond the risk mitigation stance that ESG initiatives promote, where the objective is to identify the vulnerabilities of a company’s existing business model, and instead strategically reevaluates the business model itself. </p>\n<h3>The Rise of the Combinatorial System</h3>\n<p>As we noted in our earlier article “<a href=\"https://sloanreview.mit.edu/article/great-strategy-considers-more-than-customers-and-investors/\">Great Strategy Considers More Than Customers and Investors</a>,” multistakeholder capitalism replaces a linear, mechanical concept of business with a dynamic, biological one. The managerial implications of this shift have not yet been fully appreciated.</p>\n<p>In a compensatory system, the best strategy is to “back your winners” — you should funnel your resources into the aspects of the business where you are strong. Outperformance in these areas more than compensates for underperformance in others.</p>\n<p>In a combinatorial system, the wisest strategy is to “raise the tide for all boats” — to focus on how to increase value across all aspects of the business. In a combinatorial system, your total performance is constrained by your weakest performance.</p>\n<p></p>\n<p>Because the math of systems is different from that of linear functions, multistakeholder strategy is not simply about adding a few new factors (such as employees and communities) into an existing <a href=\"https://hbr.org/2015/11/a-refresher-on-regression-analysis\">regression equation of business</a>. Stakeholders are not independent variables but rather interdependent members of a complex ecosystem whose health is more than just the sum of the parts. In a linear regression, a zero on any factor means that the factor does not contribute to the outcome. In a system, a zero implies the loss of integrity of the system.</p>\n<p></p>\n<p>Just as consumers assess the integrity of a brand across multiple touch points (their experience in researching, testing, purchasing, and using the brand), the requirement for coherence and integrity extends across the entirety of a company’s operations. In a combinatorial system, companies are no longer assessed solely on the desirability of their products, but also on their performance as employers, partners, taxpayers, and environmental stewards. Calculating how a company is doing across its stakeholder landscape — and tracking and sharing the results in a transparent way — is challenging, and most companies are in the early stages of this process.</p>\n<p>A necessary starting point for organizations is to identify aspects of the business that are damaging to its corporate reputation, even if they are not yet a source of lost sales.  </p>\n<p>Some examples: Amazon is in the process of revisiting its commitment to “customer centricity” as its sole obsession, having realized that its customers are troubled by <a href=\"https://www.nytimes.com/2021/10/24/technology/amazon-employee-leave-errors.html\">reports of poor working conditions</a> in Amazon fulfillment centers. In July 2021, the company announced the addition of <a href=\"https://www.aboutamazon.com/news/company-news/two-new-leadership-principles\">two new leadership principles</a> for the organization — one focused on employees and the other on its social responsibility.</p>\n<p>British multinational grocer Tesco, which was publicly derided in 2015 for its treatment of suppliers, has in recent years been lauded for its <a href=\"https://www.cips.org/supply-management/news/2020/april/tesco-completely-reset-relationships-with-suppliers/\">collaboration with value chain partners</a>. This is evidenced by the company’s supplier satisfaction scores, which reached all-time highs just five years later, even as the COVID-19 pandemic stressed the strongest of supply chain relationships globally. </p>\n<p>Or consider how Siemens, the world’s largest industrial manufacturer and historically a major carbon emitter, has aggressively <a href=\"https://new.siemens.com/us/en/company/environmental-society-governance/environmental-action.html\">reduced its carbon footprint</a> by using distributed energy systems at its production facilities, deploying low-emission and e-mobility vehicles globally, and significantly increasing its use of renewable natural gas and wind power energy. Other global giants, including Walmart, Cargill, BMW, John Deere, and Samsung, have also invested heavily to improve their environmental performance and community responsiveness. </p>\n<h3>And Yet: The ‘Say Versus Do’ Disconnect</h3>\n<p>There is further work to be done. In the research we have conducted with over 300 companies across five continents, <a href=\"https://www.research.net/r/qqmad\">we’ve asked</a> whether their approach to strategy development explicitly considers the needs of five types of stakeholders: employees, customers, investors, partners, and communities. Our research highlights that few companies overlook investors and customers in their strategies, but just 1 in 6 companies actively considers all five major stakeholder groups. (See “The ‘Say Versus Do’ Gap in Multistakeholder Strategy.”) </p>\n<div class=\"callout-highlight\">\n<aside class=\"l-content-wrap\">\n<article>\n<h4>The ‘Say Versus Do’ Gap in Multistakeholder Strategy</h4>\n<p class=\"caption\">While a majority of companies now claim to embrace multistakeholder capitalism, research shows that only a minority actually considers more than investors and customers when developing strategy, and a smaller minority considers all five types of stakeholders.</p>\n<p><img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/Hunsacker-knowles-multistakerholder-fig1.png\" alt=\"The ‘Say Versus Do’ Gap in Multistakeholder Strategy\" /></p>\n<p class=\"attribution\">Source: Jonathan Knowles and B. Tom Hunsaker</p>\n</article>\n</aside>\n</div>\n<p>This is a relic of shareholder capitalism that prioritized customers and investors while overlooking the role that employees, partners, and communities play in an organization’s success. While many companies are no doubt sincere in their desire to support all stakeholders, this disconnect suggests that business leaders still maintain a mechanistic construct of business whereby anyone not giving money to the organization, either as an investor or as a paying customer, is regarded solely as a cost. This leaves companies vulnerable to misdiagnosing their next best moves. </p>\n<p>The first step for leaders who truly want to break out of the say/do disconnect is to invest in understanding not just the individual interests of their stakeholders but also the ways in which these interests can be integrated. This is the foundation for creating novel strategies that increase a company’s <a href=\"https://sloanreview.mit.edu/article/the-essence-of-strategy-is-now-how-to-change/\">fit to purpose</a> (relevance to stakeholders) and deepen its relative advantage (distinctiveness from alternatives).</p>\n<p>Companies whose leaders foster mutual interest and respect across stakeholder relationships tend to perform better. A three-decade analysis published in 2012 by London Business School finance professor Alex Edmans found that businesses ranked among the best to work for had <a href=\"http://faculty.london.edu/aedmans/RoweAMP.pdf\">stocks that outperformed their peers’</a> by an average of 3% annually — nearly 150% cumulatively — even after controlling for industry category and other factors. More recently, New York University’s Center for Sustainable Business performed a meta-analysis of 1,000 research papers and found a <a href=\"https://www.stern.nyu.edu/sites/default/files/assets/documents/NYU-RAM_ESG-Paper_2021%20Rev_0.pdf\">positive correlation</a> between stakeholder performance beyond customers and investors on the one hand, and key financial performance and stock returns on the other, in the majority of the studies.</p>\n<p></p>\n<p></p>\n<p></p>\n<p>In multistakeholder capitalism, you are only as strong as your weakest behavior. From a strictly mechanical perspective, there may be no operational connection between your treatment of each type of stakeholder, but there is a human systems linkage that infers how a company’s willingness to exploit or ignore one constituency might translate into poor behavior with another. A 24-hour news cycle, hyperprolific and accessible data, and ubiquitous social media reinforce the risk of reputational contagion caused by poor behavior on any aspect of the business. </p>\n<p>The new multistakeholder approach to strategy involves thinking of business as a biological system — one in which the success of the whole requires the health of each of the parts. This way, strategy is viewed in a broader context and focuses on creating a set of reinforcing actions across multiple stakeholders as the basis for value creation. </p>\n<p></p>\n",
  "wfw:commentRss": "https://sloanreview.mit.edu/article/the-new-math-of-multistakeholderism/feed/",
  "slash:comments": 0
}