{
  "title": "US wants official of Ukrainian descent to run NATO – NYT",
  "link": "https://www.rt.com/news/566003-top-nato-boss-candidate/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/566003-top-nato-boss-candidate/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63669ffc2030275edd67e21f.jpg\" /> NATO Secretary General Jens Stoltenberg’s preferred replacement is reportedly Canada’s incumbent Deputy premier Chrystia Freeland <br/><a href=\"https://www.rt.com/news/566003-top-nato-boss-candidate/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>A granddaughter of a WWII Ukrainian Nazi collaborator, Chrystia Freeland is reportedly Washington’s “prime” pick for the job</strong></p>\n            \n                        \n            <p>The <em>&ldquo;prime candidate&rdquo;</em> favored by Washington to replace outgoing NATO Secretary General Jens Stoltenberg is Chrystia Freeland, currently Canada&rsquo;s Finance Minister and Deputy Prime Minister, the New York Times <a href=\"https://www.nytimes.com/2022/11/04/world/europe/nato-next-secretary-general.html\" target=\"_blank\" rel=\"noopener noreferrer\">reported</a> on Friday.</p>\n<p>The bloc reportedly aims to install a woman at its helm for the first time, with other likely contenders being Estonian premier Kaja Kallas, Slovakian President Zuzana Caputova and Kolinda Grabar-Kitarovic, former president of Croatia, who was also Zagreb&rsquo;s ambassador to Washington. The <em>&ldquo;strong contenders&rdquo;</em> list provided by the NYT corresponds with <a href=\"https://www.rt.com/news/562449-nato-secretary-general-candidate/\" target=\"_blank\" rel=\"noopener noreferrer\">earlier</a> media reports this year.</p>\n<p>The selection of a new NATO Secretary General, however, is still months away and<em> &ldquo;the names that surface first&rdquo;</em> may not survive the bargaining among the bloc&rsquo;s members, unnamed NATO officials told the NYT. Incumbent head of the bloc Stoltenberg was set to leave his post on September 30, but his term was prolonged to late 2023 amid the conflict in Ukraine. The NATO boss might ultimately end up having his tenure extended for another year, one of the officials reportedly suggested.</p>\n<p>Still, Freeland is believed to be the <em>&ldquo;prime candidate&rdquo;</em> for the post of NATO chief, favored by the US itself.</p>\n<p><em>&ldquo;Where any of the candidates come down on support for Ukraine in the war against Russia will be a critical factor,&rdquo;</em> the paper writes.&nbsp;</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363f15e20302768a7570035.jpg\" alt=\"FILE PHOTO: A Russian-made T-72 tank takes part in a military parade in central Sofia, Bulgaria, May 6, 2004\" />\n            <figcaption><a href=\"https://www.rt.com/news/565894-bulgaria-weapons-aid-ukraine/\">NATO member votes to send arms to Ukraine despite opposition</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Freeland, whose mother was Ukrainian, is known to have a strong pro-Ukrainian stance. She is the granddaughter of Michael Chomiak, described by the NYT as a <em>&ldquo;grateful immigrant to Canada&rdquo;</em> who was during World War Two a <em>&ldquo;younger man involved with a Ukrainian nationalist movement that saw the Nazis as useful foils to counter the Soviets.&rdquo;</em></p>\n<p>The paper didn&rsquo;t mention, however, that Chomiak was a prominent Ukrainian Nazi <a href=\"https://www.theglobeandmail.com/amp/news/politics/freeland-knew-her-grandfather-was-editor-of-nazi-newspaper/article34236881/\" target=\"_blank\" rel=\"noopener noreferrer\">collaborator</a> and the editor-in-chief of a Ukrainian-language propaganda daily Krakivs'ki Visti. The outlet, published between 1940 and 1945, was funded directly by Nazi Germany and described by Canadian historian &ndash;&nbsp; and Chomiak&rsquo;s son-in-law &ndash;&nbsp; John-Paul Himka as a <em>&ldquo;vehemently anti-Semitic&rdquo;</em> publication.</p>\n<p>Freeland has been extremely ambiguous on her ancestry, not only refusing to condemn her maternal grandparents but somewhat endorsing them instead. In 2015 she wrote an essay called <em>&ldquo;My Ukraine,&rdquo;</em> stating that her Nazi collaborator grandparents <em>&ldquo;saw themselves as political exiles with a responsibility to keep alive the idea of an independent Ukraine.&rdquo;</em></p>\n<p><em>&ldquo;That dream persisted into the next generation, and in some cases the generation after that,&rdquo;</em> Freeland wrote in the essay.</p>",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 17:44:20 +0000",
  "dc:creator": "RT"
}