{
  "title": "Optimization for Deep Learning Highlights in 2017",
  "description": "Different gradient descent optimization algorithms have been proposed in recent years but Adam is still most commonly used. This post discusses the most exciting highlights and most promising recent approaches that may shape the way we will optimize our models in the future.",
  "link": "http://ruder.io/deep-learning-optimization-2017/",
  "guid": "5c76ff7c1b9b0d18555b9e9f",
  "category": "optimization",
  "dc:creator": "Sebastian Ruder",
  "pubDate": "Sun, 03 Dec 2017 15:36:00 GMT",
  "media:content": "",
  "content:encoded": "<!--kg-card-begin: markdown--><!--kg-card-begin: markdown--><img src=\"http://ruder.io/content/images/2017/12/snapshot_ensembles.png\" alt=\"Optimization for Deep Learning Highlights in 2017\"><p>This post discusses the most exciting highlights and most promising directions in optimization for Deep Learning.</p>\n<p>Table of contents:</p>\n<ul>\n<li><a href=\"#improvingadam\">Improving Adam</a></li>\n<li><a href=\"#decouplingweightdecay\">Decoupling weight decay</a></li>\n<li><a href=\"#fixingtheexponentialmovingaverage\">Fixing the exponential moving average</a></li>\n<li><a href=\"#tuningthelearningrate\">Tuning the learning rate</a></li>\n<li><a href=\"#warmrestarts\">Warm restarts</a></li>\n<li><a href=\"#sgdwithrestarts\">SGD with restarts</a></li>\n<li><a href=\"#snapshotensembles\">Snapshot ensembles</a></li>\n<li><a href=\"#adamwithrestarts\">Adam with restarts</a></li>\n<li><a href=\"#learningtooptimize\">Learning to optimize</a></li>\n<li><a href=\"#understandinggeneralization\">Understanding generalization</a></li>\n</ul>\n<p>Deep Learning ultimately is about finding a minimum that generalizes well -- with bonus points for finding one fast and reliably. Our workhorse, stochastic gradient descent (SGD), is a 60-year old algorithm (Robbins and Monro, 1951) <sup class=\"footnote-ref\"><a href=\"#fn1\" id=\"fnref1\">[1]</a></sup>, that is as essential to the current generation of Deep Learning algorithms as back-propagation.</p>\n<p>Different optimization algorithms have been proposed in recent years, which use different equations to update a model's parameters. Adam (Kingma and Ba, 2015) <sup class=\"footnote-ref\"><a href=\"#fn2\" id=\"fnref2\">[2]</a></sup> was introduced in 2015 and is arguably today still the most commonly used one of these algorithms. This indicates that from the Machine Learning practitioner's perspective, best practices for optimization for Deep Learning have largely remained the same.</p>\n<p>New ideas, however, have been developed over the course of this year, which may shape the way we will optimize our models in the future. In this blog post, I will touch on the most exciting highlights and most promising directions in optimization for Deep Learning in my opinion. Note that this blog post assumes a familiarity with SGD and with adaptive learning rate methods such as Adam. To get up to speed, refer to <a href=\"http://ruder.io/optimizing-gradient-descent/index.html\">this blog post</a> for an overview of existing gradient descent optimization algorithms.</p>\n<h2 id=\"improvingadam\">Improving Adam</h2>\n<p>Despite the apparent supremacy of adaptive learning rate methods such as Adam, state-of-the-art results for many tasks in computer vision and NLP such as object recognition (Huang et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn3\" id=\"fnref3\">[3]</a></sup> or machine translation (Wu et al., 2016) <sup class=\"footnote-ref\"><a href=\"#fn4\" id=\"fnref4\">[4]</a></sup> have still been achieved by plain old SGD with momentum. Recent theory (Wilson et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn5\" id=\"fnref5\">[5]</a></sup> provides some justification for this, suggesting that adaptive learning rate methods converge to different (and less optimal) minima than SGD with momentum. It is empirically shown that the minima found by adaptive learning rate methods perform generally worse compared to those found by SGD with momentum on object recognition, character-level language modeling, and constituency parsing. This seems counter-intuitive given that Adam comes with nice convergence guarantees and that its adaptive learning rate should give it an edge over the regular SGD. However, Adam and other adaptive learning rate methods are not without their own flaws.</p>\n<h3 id=\"decouplingweightdecay\">Decoupling weight decay</h3>\n<p>One factor that partially accounts for Adam's poor generalization ability compared with SGD with momentum on some datasets is weight decay. Weight decay is most commonly used in image classification problems and decays the weights \\(\\theta_t\\) after every parameter update by multiplying them by a decay rate \\(w_t\\) that is slightly less than \\(1\\):</p>\n<p>\\(\\theta_{t+1} = w_t : \\theta_t \\)</p>\n<p>This prevents the weights from growing too large. As such, weight decay can also be understood as an \\(\\ell_2\\) regularization term that depends on the weight decay rate \\(w_t\\) added to the loss:</p>\n<p>\\(\\mathcal{L}_\\text{reg} = \\dfrac{w_t}{2} |\\theta_t |^2_2 \\)</p>\n<p>Weight decay is commonly implemented in many neural network libraries either as the above regularization term or directly to modify the gradient. As the gradient is modified in both the momentum and Adam update equations (via multiplication with other decay terms), weight decay no longer equals \\(\\ell_2\\) regularization. Loshchilov and Hutter (2017) <sup class=\"footnote-ref\"><a href=\"#fn6\" id=\"fnref6\">[6]</a></sup> thus propose to decouple weight decay from the gradient update by adding it after the parameter update as in the original definition.<br>\nThe SGD with momentum and weight decay (SGDW) update then looks like the following:</p>\n<p>\\(<br>\n\\begin{align}<br>\n\\begin{split}<br>\nv_t &= \\gamma v_{t-1} + \\eta g_t \\\\<br>\n\\theta_{t+1} &= \\theta_t - v_t - \\eta w_t \\theta_t<br>\n\\end{split}<br>\n\\end{align}<br>\n\\)</p>\n<p>where \\(\\eta\\) is the learning rate and the third term in the second equation is the decoupled weight decay. Similarly, for Adam with weight decay (AdamW) we obtain:</p>\n<p>\\(<br>\n\\begin{align}<br>\n\\begin{split}<br>\nm_t &= \\beta_1 m_{t-1} + (1 - \\beta_1) g_t \\\\<br>\nv_t &= \\beta_2 v_{t-1} + (1 - \\beta_2) g_t^2\\\\<br>\n\\hat{m}_t &= \\dfrac{m_t}{1 - \\beta^t_1} \\\\<br>\n\\hat{v}_t &= \\dfrac{v_t}{1 - \\beta^t_2} \\\\<br>\n\\theta_{t+1} &= \\theta_{t} - \\dfrac{\\eta}{\\sqrt{\\hat{v}_t} + \\epsilon} \\hat{m}_t - \\eta w_t \\theta_t<br>\n\\end{split}<br>\n\\end{align}<br>\n\\)</p>\n<p>where \\(m_t\\) and \\(\\hat{m}_t\\) and \\(v_t\\) and \\(\\hat{v}_t\\) are the biased and bias-corrected estimates of the first and second moments respectively and \\(\\beta_1\\) and \\(\\beta_2\\) are their decay rates, with the same weight decay term added to it. The authors show that this substantially improves Adam’s generalization performance and allows it to compete with SGD with momentum on image classification datasets.</p>\n<p>In addition, it decouples the choice of the learning rate from the choice of the weight decay, which enables better hyperparameter optimization as the hyperparameters no longer depend on each other. It also separates the implementation of the optimizer from the implementation of the weight decay, which contributes to cleaner and more reusable code (see e.g. the <a href=\"https://github.com/fastai/fastai/pull/46/files\">fast.ai AdamW/SGDW implementation</a>).</p>\n<h3 id=\"fixingtheexponentialmovingaverage\">Fixing the exponential moving average</h3>\n<p>Several recent papers (Dozat and Manning, 2017; Laine and Aila, 2017) <sup class=\"footnote-ref\"><a href=\"#fn7\" id=\"fnref7\">[7]</a></sup>,<sup class=\"footnote-ref\"><a href=\"#fn8\" id=\"fnref8\">[8]</a></sup> empirically find that a lower \\(\\beta_2\\) value, which controls the contribution of the exponential moving average of past squared gradients in Adam, e.g. \\(0.99\\) or \\(0.9\\) vs. the default \\(0.999\\) worked better in their respective applications, indicating that there might be an issue with the exponential moving average.</p>\n<p>An <a href=\"https://openreview.net/forum?id=ryQu7f-RZ\">ICLR 2018 submission</a> formalizes this issue and pinpoints the exponential moving average of past squared gradients as another reason for the poor generalization behaviour of adaptive learning rate methods. Updating the parameters via an exponential moving average of past squared gradients is at the heart of adaptive learning rate methods such as Adadelta, RMSprop, and Adam. The contribution of the exponential average is well-motivated: It should prevent the learning rates to become infinitesimally small as training progresses, the key flaw of the Adagrad algorithm. However, this short-term memory of the gradients becomes an obstacle in other scenarios.</p>\n<p>In settings where Adam converges to a suboptimal solution, it has been observed that some minibatches provide large and informative gradients, but as these minibatches only occur rarely, exponential averaging diminishes their influence, which leads to poor convergence. The authors provide an example for a simple convex optimization problem where the same behaviour can be observed for Adam.</p>\n<p>To fix this behaviour, the authors propose a new algorithm, AMSGrad that uses the maximum of past squared gradients rather than the exponential average to update the parameters. The full AMSGrad update without bias-corrected estimates can be seen below:</p>\n<p>\\(<br>\n\\begin{align}<br>\n\\begin{split}<br>\nm_t &= \\beta_1 m_{t-1} + (1 - \\beta_1) g_t \\\\<br>\nv_t &= \\beta_2 v_{t-1} + (1 - \\beta_2) g_t^2\\\\<br>\n\\hat{v}_t &= \\text{max}(\\hat{v}_{t-1}, v_t) \\\\<br>\n\\theta_{t+1} &= \\theta_{t} - \\dfrac{\\eta}{\\sqrt{\\hat{v}_t} + \\epsilon} m_t<br>\n\\end{split}<br>\n\\end{align}<br>\n\\)</p>\n<p>The authors observe improved performance compared to Adam on small datasets and on CIFAR-10.</p>\n<h2 id=\"tuningthelearningrate\">Tuning the learning rate</h2>\n<p>In many cases, it is not our models that require improvement and tuning, but our hyperparameters. Recent examples for language modelling demonstrate that tuning LSTM parameters (Melis et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn9\" id=\"fnref9\">[9]</a></sup> and regularization parameters (Merity et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn10\" id=\"fnref10\">[10]</a></sup> can yield state-of-the-art results compared to more complex models.</p>\n<p>An important hyperparameter for optimization in Deep Learning is the learning rate \\(\\eta\\). In fact, SGD has been shown to require a learning rate annealing schedule to converge to a good minimum in the first place. It is often thought that adaptive learning rate methods such as Adam are more robust to different learning rates, as they update the learning rate themselves. Even for these methods, however, there can be a large difference between a good and the optimal learning rate (psst... it's <a href=\"https://twitter.com/karpathy/status/801621764144971776\">\\(3e-4\\)</a>).</p>\n<p>Zhang et al. (2017) <sup class=\"footnote-ref\"><a href=\"#fn11\" id=\"fnref11\">[11]</a></sup> show that SGD with a tuned learning rate annealing schedule and momentum parameter is not only competitive with Adam, but also converges faster. On the other hand, while we might think that the adaptivity of Adam's learning rates might mimic learning rate annealing, an explicit annealing schedule can still be beneficial: If we add SGD-style learning rate annealing to Adam, it converges faster and outperforms SGD on Machine Translation (Denkowski and Neubig, 2017) <sup class=\"footnote-ref\"><a href=\"#fn12\" id=\"fnref12\">[12]</a></sup>.</p>\n<p>In fact, learning rate annealing schedule engineering seems to be the new feature engineering as we can often find highly-tuned learning rate annealing schedules that improve the final convergence behaviour of our model. An interesting example of this is Vaswani et al. (2017) <sup class=\"footnote-ref\"><a href=\"#fn13\" id=\"fnref13\">[13]</a></sup>. While it is usual to see a model's hyperparameters being subjected to large-scale hyperparameter optimization, it is interesting to see a learning rate annealing schedule as the focus of the same attention to detail: The authors use Adam with \\(\\beta_1=0.9\\), a non-default \\(\\beta_2=0.98\\), \\(\\epsilon = 10^{-9}\\), and arguably one of the most elaborate annealing schedules for the learning rate \\(\\eta\\):</p>\n<p>\\(\\eta  = d_\\text{model}^{-0.5} \\cdot \\min(step\\text{_}num^{-0.5}, step\\text{_}num \\cdot warmup\\text{_}steps^{-1.5}) \\)</p>\n<p>where \\(d_\\text{model}\\) is the number of parameters of the model and \\(warmup\\text{_}steps = 4000\\).</p>\n<p>Another recent paper by Smith et al. (2017) <sup class=\"footnote-ref\"><a href=\"#fn14\" id=\"fnref14\">[14]</a></sup> demonstrates an interesting connection between the learning rate and the batch size, two hyperparameters that are typically thought to be independent of each other: They show that decaying the learning rate is equivalent to increasing the batch size, while the latter allows for increased parallelism. Conversely, we can reduce the number of model updates and thus speed up training by increasing the learning rate and scaling the batch size. This has ramifications for large-scale Deep Learning, which can now repurpose existing training schedules with no hyperparameter tuning.</p>\n<h2 id=\"warmrestarts\">Warm restarts</h2>\n<h3 id=\"sgdwithrestarts\">SGD with restarts</h3>\n<p>Another effective recent development is SGDR (Loshchilov and Hutter, 2017) <sup class=\"footnote-ref\"><a href=\"#fn15\" id=\"fnref15\">[15]</a></sup>, an SGD alternative that uses warm restarts instead of learning rate annealing. In each restart, the learning rate is initialized to some value and is scheduled to decrease. Importantly, the restart is warm as the optimization does not start from scratch but from the parameters to which the model converged during the last step. The key factor is that the learning rate is decreased with an aggressive cosine annealing schedule, which rapidly lowers the learning rate and looks like the following:</p>\n<p>\\(\\eta_t = \\eta_{min}^i + \\dfrac{1}{2}(\\eta_{max}^i - \\eta_{min}^i)(1 + \\text{cos}(\\dfrac{T_{cur}}{T_i}\\pi)) \\)</p>\n<p>where \\(\\eta_{min}^i\\) and \\(\\eta_{max}^i\\) are ranges for the learning rate during the \\(i\\)-th run, \\(T_{cur}\\) indicates how many epochs passed since the last restart, and \\(T_i\\) specifies the epoch of the next restart. The warm restart schedules for \\(T_i=50\\), \\(T_i=100\\), and \\(T_i=200\\) compared with regular learning rate annealing are shown in Figure 1.</p>\n<figure>\n      <img src=\"http://ruder.io/content/images/2017/11/warm_restarts.png\" style=\"width: 100%\" title=\"Learning rate schedules with warm restarts\" alt=\"Optimization for Deep Learning Highlights in 2017\">\n<figcaption>Figure 1: Learning rate schedules with warm restarts (Loshchilov and Hutter,\n 2017)</figcaption>\n</figure>\n<p>The high initial learning rate after a restart is used to essentially catapult the parameters out of the minimum to which they previously converged and to a different area of the loss surface. The aggressive annealing then enables the model to rapidly converge to a new and better solution. The authors empirically find that SGD with warm restarts requires 2 to 4 times fewer epochs than learning rate annealing and achieves comparable or better performance.</p>\n<p>Learning rate annealing with warm restarts is also known as cyclical learning rates and has been originally proposed by Smith (2017) <sup class=\"footnote-ref\"><a href=\"#fn16\" id=\"fnref16\">[16]</a></sup>. Two more articles by students of <a href=\"http://www.fast.ai/\">fast.ai</a> (which has recently started to teach this method) that discuss warm restarts and cyclical learning rates can be found <a href=\"https://medium.com/@bushaev/improving-the-way-we-work-with-learning-rate-5e99554f163b\">here</a> and <a href=\"http://teleported.in/posts/cyclic-learning-rate/\">here</a>.</p>\n<h3 id=\"snapshotensembles\">Snapshot ensembles</h3>\n<p>Snapshot ensembles (Huang et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn17\" id=\"fnref17\">[17]</a></sup> are a clever, recent technique that uses warm restarts to assemble an ensemble essentially for free when training a single model. The method trains a single model until convergence with the cosine annealing schedule that we have seen above. It then saves the model parameters, performs a warm restart, and then repeats these steps \\(M\\) times. In the end, all saved model snapshots are ensembled. The common SGD optimization behaviour on an error surface compared to the behaviour of snapshot ensembling can be seen in Figure 2.</p>\n<figure>\n      <img src=\"http://ruder.io/content/images/2017/11/snapshot_ensembles.png\" style=\"width: 100%\" title=\"Learning rate schedules with warm restarts\" alt=\"Optimization for Deep Learning Highlights in 2017\">\n<figcaption>Figure 2: SGD vs. snapshot ensemble (Huang et al., 2017)</figcaption>\n</figure>\n<p>The success of ensembling in general relies on the diversity of the individual models in the ensemble. Snapshot ensembling thus relies on the cosine annealing schedule's ability to enable the model to converge to a different local optimum after every restart. The authors demonstrate that this holds in practice, achieving state-of-the-art results on CIFAR-10, CIFAR-100, and SVHN.</p>\n<h3 id=\"adamwithrestarts\">Adam with restarts</h3>\n<p>Warm restarts did not work originally with Adam due to its dysfunctional weight decay, which we have seen before. After fixing weight decay, Loshchilov and Hutter (2017) similarly extend Adam to work with warm restarts. They set \\(\\eta_{min}^i=0\\) and \\(\\eta_{max}^i=1\\), which yields:</p>\n<p>\\(\\eta_t = 0.5 + 0.5 : \\text{cos}(\\dfrac{T_{cur}}{T_i}\\pi))\\)</p>\n<p>They recommend to start with an initially small \\(T_i\\) (between \\(1%\\) and \\(10%\\) of the total number of epochs) and multiply it by a factor of \\(T_{mult}\\) (e.g. \\(T_{mult}=2\\)) at every restart.</p>\n<h2 id=\"learningtooptimize\">Learning to optimize</h2>\n<p>One of the most interesting papers of last year (and <a href=\"https://www.reddit.com/r/MachineLearning/comments/5n53k7/d_results_from_the_best_paper_awards/\">reddit's \"Best paper name of 2016\" winner</a>) was a paper by Andrychowicz et al. (2016) <sup class=\"footnote-ref\"><a href=\"#fn18\" id=\"fnref18\">[18]</a></sup> where they train an LSTM optimizer to provide the updates to the main model during training. Unfortunately, learning a separate LSTM optimizer or even using a pre-trained LSTM optimizer for optimization greatly increases the complexity of model training.</p>\n<p>Another very influential learning-to-learn paper from this year uses an LSTM to generate model architectures in a domain-specific language (Zoph and Quoc, 2017) <sup class=\"footnote-ref\"><a href=\"#fn19\" id=\"fnref19\">[19]</a></sup>. While the search process requires vast amounts of resources, the discovered architectures can be used as-is to replace their existing counterparts. This search process has proved effective and found architectures that achieve state-of-the-art results on language modeling and results competitive with the state-of-the-art on CIFAR-10.</p>\n<p>The same search principle can be applied to any other domain where key processes have been previously defined by hand. One such domain are optimization algorithms for Deep Learning. As we have seen before, optimization algorithms are more similar than they seem: All of them use a combination of an exponential moving average of past gradients (as in momentum) and of an exponential moving average of past squared gradients (as in Adadelta, RMSprop, and Adam) (Ruder, 2016) <sup class=\"footnote-ref\"><a href=\"#fn20\" id=\"fnref20\">[20]</a></sup>.</p>\n<p>Bello et al. (2017) <sup class=\"footnote-ref\"><a href=\"#fn21\" id=\"fnref21\">[21]</a></sup> define a domain-specific language that consists of primitives useful for optimization such as these exponential moving averages. They then sample an update rule from the space of possible update rules, use this update rule to train a model, and update the RNN controller based on the performance of the trained model on the test set. The full procedure can be seen in Figure 3.</p>\n<figure>\n      <img src=\"http://ruder.io/content/images/2017/11/neural_optimizer_search.png\" style=\"width: 100%\" title=\"Neural Optimizer Search\" alt=\"Optimization for Deep Learning Highlights in 2017\">\n<figcaption>Figure 3: Neural Optimizer Search (Bello et al., 2017)</figcaption>\n</figure>\n<p>In particular, they discover two update equations, PowerSign and AddSign. The update equation for PowerSign is the following:</p>\n<p>\\( \\theta_{t+1} = \\theta_{t} - \\alpha^{f(t)*<br>\n\\text{sign}(g_t)*\\text{sign}(m_t)}*g_t \\)</p>\n<p>where \\(\\alpha\\) is a hyperparameter that is often set to \\(e\\) or \\(2\\), \\(f(t)\\) is either \\(1\\) or a decay function that performs linear, cyclical or decay with restarts based on time step \\(t\\), and \\(m_t\\) is the moving average of past gradients. The common configuration uses \\(\\alpha=e\\) and no decay.  We can observe that the update scales the gradient by \\(\\alpha^{f(t)}\\) or \\(1/\\alpha^{f(t)}\\) depending on whether the direction of the gradient and its moving average agree. This indicates that this momentum-like agreement between past gradients and the current one is a key piece of information for optimizing Deep Learning models.</p>\n<p>AddSign in turn is defined as follows:</p>\n<p>\\( \\theta_{t+1} = \\theta_{t} - \\alpha + f(t) * \\text{sign}(g_t) * \\text{sign}(m_t)) * g_t\\)</p>\n<p>with \\(\\alpha\\) often set to \\(1\\) or \\(2\\). Similar to the above, this time the update scales \\(\\alpha + f(t)\\) or \\(\\alpha - f(t)\\) again depending on the agreement of the direction of the gradients. The authors show that PowerSign and AddSign outperform Adam, RMSprop, and SGD with momentum on CIFAR-10 and transfer well to other tasks such as ImageNet classification and machine translation.</p>\n<h2 id=\"understandinggeneralization\">Understanding generalization</h2>\n<p>Optimization is closely tied to generalization as the minimum to which a model converges defines how well the model generalizes. Advances in optimization are thus closely correlated with theoretical advances in understanding the generalization behaviour of such minima and more generally of gaining a deeper understanding of generalization in Deep Learning.</p>\n<p>However, our understanding of the generalization behaviour of deep neural networks is still very shallow. Recent work showed that the number of possible local minima grows exponentially with the number of parameters (Kawaguchi, 2016) <sup class=\"footnote-ref\"><a href=\"#fn22\" id=\"fnref22\">[22]</a></sup>. Given the huge number of parameters of current Deep Learning architectures, it still seems almost magical that such models converge to solutions that generalize well, in particular given that they can completely memorize random inputs (Zhang et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn23\" id=\"fnref23\">[23]</a></sup>.</p>\n<p>Keskar et al. (2017) <sup class=\"footnote-ref\"><a href=\"#fn24\" id=\"fnref24\">[24]</a></sup> identify the sharpness of a minimum as a source for poor generalization: In particular, they show that sharp minima found by batch gradient descent have high generalization error. This makes intuitive sense, as we generally would like our functions to be smooth and a sharp minima indicates a high irregularity in the corresponding error surface. However, more recent work suggests that sharpness may not be such a good indicator after all by showing that local minima that generalize well can be made arbitrarily sharp (Dinh et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn25\" id=\"fnref25\">[25]</a></sup>. A <a href=\"https://www.quora.com/Why-is-the-paper-%E2%80%9CUnderstanding-Deep-Learning-Requires-Rethinking-Generalization%E2%80%9D-important/answer/Eric-Jang?srid=dWc3\">Quora answer by Eric Jang</a> also discusses these articles.</p>\n<p>An <a href=\"https://openreview.net/forum?id=r1iuQjxCZ\">ICLR 2018 submission</a> demonstrates through a series of ablation analyses that a model's reliance on single directions in activation space, i.e. the activation of single units or feature maps is a good predictor of its generalization performance. They show that this holds across models trained on different datasets and for different degrees of label corruption. They find that dropout does not help to resolve this, while batch normalization discourages single direction reliance.</p>\n<p>While these findings indicate that there is still much we do not know in terms of Optimization for Deep Learning, it is important to remember that convergence guarantees and a large body of work exists for convex optimization and that existing ideas and insights can also be applied to non-convex optimization to some extent. The large-scale optimization tutorial at NIPS 2016 provides an excellent overview of more theoretical work in this area (see the <a href=\"https://www.di.ens.fr/~fbach/fbach_tutorial_vr_nips_2016.pdf\">slides part 1</a>, <a href=\"http://suvrit.de/talks/vr_nips16_sra.pdf\">part 2</a>, and the <a href=\"https://channel9.msdn.com/Events/Neural-Information-Processing-Systems-Conference/Neural-Information-Processing-Systems-Conference-NIPS-2016/Large-Scale-Optimization-Beyond-Stochastic-Gradient-Descent-and-Convexity\">video</a>).</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>I hope that I was able to provide an impression of some of the compelling developments in optimization for Deep Learning over the past year. I've undoubtedly failed to mention many other approaches that are equally important and noteworthy. Please let me know in the comments below what I missed, where I made a mistake or misrepresented a method, or which aspect of optimization for Deep Learning you find particularly exciting or underexplored.</p>\n<h2 id=\"hackernews\">Hacker News</h2>\n<p>You can find the discussion of this post on HN <a href=\"https://news.ycombinator.com/item?id=15839564\">here</a>.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>Robbins, H., & Monro, S. (1951). A stochastic approximation method. The annals of mathematical statistics, 400-407. <a href=\"#fnref1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn2\" class=\"footnote-item\"><p>Kingma, D. P., & Ba, J. L. (2015). Adam: a Method for Stochastic Optimization. International Conference on Learning Representations. <a href=\"#fnref2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn3\" class=\"footnote-item\"><p>Huang, G., Liu, Z., Weinberger, K. Q., & van der Maaten, L. (2017). Densely Connected Convolutional Networks. In Proceedings of CVPR 2017. <a href=\"#fnref3\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn4\" class=\"footnote-item\"><p>Wu, Y., Schuster, M., Chen, Z., Le, Q. V, Norouzi, M., Macherey, W., … Dean, J. (2016). Google’s Neural Machine Translation System: Bridging the Gap between Human and Machine Translation. arXiv Preprint arXiv:1609.08144. <a href=\"#fnref4\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn5\" class=\"footnote-item\"><p>Wilson, A. C., Roelofs, R., Stern, M., Srebro, N., & Recht, B. (2017). The Marginal Value of Adaptive Gradient Methods in Machine Learning. arXiv Preprint arXiv:1705.08292. Retrieved from <a href=\"http://arxiv.org/abs/1705.08292\">http://arxiv.org/abs/1705.08292</a> <a href=\"#fnref5\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn6\" class=\"footnote-item\"><p>Loshchilov, I., & Hutter, F. (2017). Fixing Weight Decay Regularization in Adam. arXiv Preprint arXi1711.05101. Retrieved from <a href=\"http://arxiv.org/abs/1711.05101\">http://arxiv.org/abs/1711.05101</a> <a href=\"#fnref6\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn7\" class=\"footnote-item\"><p>Dozat, T., & Manning, C. D. (2017). Deep Biaffine Attention for Neural Dependency Parsing. In ICLR 2017. Retrieved from <a href=\"http://arxiv.org/abs/1611.01734\">http://arxiv.org/abs/1611.01734</a> <a href=\"#fnref7\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn8\" class=\"footnote-item\"><p>Laine, S., & Aila, T. (2017). Temporal Ensembling for Semi-Supervised Learning. In Proceedings of ICLR 2017. <a href=\"#fnref8\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn9\" class=\"footnote-item\"><p>Melis, G., Dyer, C., & Blunsom, P. (2017). On the State of the Art of Evaluation in Neural Language Models. In arXiv preprint arXiv:1707.05589. <a href=\"#fnref9\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn10\" class=\"footnote-item\"><p>Merity, S., Shirish Keskar, N., & Socher, R. (2017). Regularizing and Optimizing LSTM Language Models. arXiv Preprint arXiv:1708.02182. Retrieved from <a href=\"https://arxiv.org/pdf/1708.02182.pdf\">https://arxiv.org/pdf/1708.02182.pdf</a> <a href=\"#fnref10\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn11\" class=\"footnote-item\"><p>Zhang, J., Mitliagkas, I., & Ré, C. (2017). YellowFin and the Art of Momentum Tuning. In arXiv preprint arXiv:1706.03471. <a href=\"#fnref11\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn12\" class=\"footnote-item\"><p>Denkowski, M., & Neubig, G. (2017). Stronger Baselines for Trustable Results in Neural Machine Translation. In Workshop on Neural Machine Translation (WNMT). Retrieved from <a href=\"https://arxiv.org/abs/1706.09733\">https://arxiv.org/abs/1706.09733</a> <a href=\"#fnref12\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn13\" class=\"footnote-item\"><p>Vaswani, A., Shazeer, N., Parmar, N., Uszkoreit, J., Jones, L., Gomez, A. N., … Polosukhin, I. (2017). Attention Is All You Need. In Advances in Neural Information Processing Systems. <a href=\"#fnref13\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn14\" class=\"footnote-item\"><p>Smith, S. L., Kindermans, P.-J., & Le, Q. V. (2017). Don’t Decay the Learning Rate, Increase the Batch Size. In arXiv preprint arXiv:1711.00489. Retrieved from <a href=\"http://arxiv.org/abs/1711.00489\">http://arxiv.org/abs/1711.00489</a> <a href=\"#fnref14\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn15\" class=\"footnote-item\"><p>Loshchilov, I., & Hutter, F. (2017). SGDR: Stochastic Gradient Descent with Warm Restarts. In Proceedings of ICLR 2017. <a href=\"https://doi.org/10.1002/fut\">https://doi.org/10.1002/fut</a> <a href=\"#fnref15\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn16\" class=\"footnote-item\"><p>Smith, Leslie N. \"Cyclical learning rates for training neural networks.\" In Applications of Computer Vision (WACV), 2017 IEEE Winter Conference on, pp. 464-472. IEEE, 2017. <a href=\"#fnref16\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn17\" class=\"footnote-item\"><p>Huang, G., Li, Y., Pleiss, G., Liu, Z., Hopcroft, J. E., & Weinberger, K. Q. (2017). Snapshot Ensembles: Train 1, get M for free. In Proceedings of ICLR 2017. <a href=\"#fnref17\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn18\" class=\"footnote-item\"><p>Andrychowicz, M., Denil, M., Gomez, S., Hoffman, M. W., Pfau, D., Schaul, T., & de Freitas, N. (2016). Learning to learn by gradient descent by gradient descent. In Advances in Neural Information Processing Systems. Retrieved from <a href=\"http://arxiv.org/abs/1606.04474\">http://arxiv.org/abs/1606.04474</a> <a href=\"#fnref18\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn19\" class=\"footnote-item\"><p>Zoph, B., & Le, Q. V. (2017). Neural Architecture Search with Reinforcement Learning. In ICLR 2017. <a href=\"#fnref19\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn20\" class=\"footnote-item\"><p>Ruder, S. (2016). An overview of gradient descent optimization algorithms. arXiv Preprint arXiv:1609.04747. <a href=\"#fnref20\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn21\" class=\"footnote-item\"><p>Bello, I., Zoph, B., Vasudevan, V., & Le, Q. V. (2017). Neural Optimizer Search with Reinforcement Learning. In Proceedings of the 34th International Conference on Machine Learning. <a href=\"#fnref21\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn22\" class=\"footnote-item\"><p>Kawaguchi, K. (2016). Deep Learning without Poor Local Minima. In Advances in Neural Information Processing Systems 29 (NIPS 2016). Retrieved from <a href=\"http://arxiv.org/abs/1605.07110\">http://arxiv.org/abs/1605.07110</a> <a href=\"#fnref22\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn23\" class=\"footnote-item\"><p>Zhang, C., Bengio, S., Hardt, M., Recht, B., & Vinyals, O. (2017). Understanding deep learning requires rethinking generalization. In Proceedings of ICLR 2017. <a href=\"#fnref23\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn24\" class=\"footnote-item\"><p>Keskar, N. S., Mudigere, D., Nocedal, J., Smelyanskiy, M., & Tang, P. T. P. (2017). On Large-Batch Training for Deep Learning: Generalization Gap and Sharp Minima. In Proceedings of ICLR 2017. Retrieved from <a href=\"http://arxiv.org/abs/1609.04836\">http://arxiv.org/abs/1609.04836</a> <a href=\"#fnref24\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn25\" class=\"footnote-item\"><p>Dinh, L., Pascanu, R., Bengio, S., & Bengio, Y. (2017). Sharp Minima Can Generalize For Deep Nets. In Proceedings of the 34th International Conference on Machine Learning. <a href=\"#fnref25\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n<!--kg-card-end: markdown--><!--kg-card-end: markdown-->"
}