{
  "title": "A view from the start",
  "link": "https://medium.com/@drewconway/a-view-from-the-start-e2ac1aaf1a87?source=rss-de04a04c4ff3------2",
  "guid": "https://medium.com/p/e2ac1aaf1a87",
  "category": [
    "new-york",
    "startup"
  ],
  "dc:creator": "Drew Conway",
  "pubDate": "Tue, 04 Oct 2016 17:40:58 GMT",
  "atom:updated": "2016-10-05T14:48:31.325Z",
  "content:encoded": "<p>Every new company has an official “first day”. In most cases, this is only meaningful to lawyers and HR/payroll systems. Most often, founders have been thinking and building for weeks, months, even years before that official first day. Despite its potential ephemeral nature, however, the day still represents a milestone.</p><p>When Alluvium’s first day was finally set on the calendar I did not want it to pass without notice. In fact, I wanted the day to be special — both memorable and inspiring. Being fortunate enough to live and work in the greatest city in the world, there were many potential locations. Ultimately, however, the decision was easy. There was only one place that might capture the feeling of that moment, and provide a lasting impression of the grandness of our endeavor: the top of One World Trade Center.</p><p>Early on a hot and humid NYC summer morning I met the team on the observation deck. As we circled the — truly — spectacular views of our city, we talked. Mostly, about “why”. Why were we starting this company; why were we the right people to start it; and, why should Alluvium even exist? We spent the most time on this last point, as it was something I had spent a lot of time thinking about leading up to the first day. In those preceding days I had scribbled out pages of notes thinking about ways to answer that question. On one sheet I drew two intersecting circles that read “data” and “humanity”, respectively, with Alluvium written in the intersection (yes, a Venn diagram).</p><p>It is easy to fall in love with the technical details of building a complex software system. I find this to be particularly pernicious in the Big Deep Data Science Machine Intelligence industry. I too am often swept away in these circular discussions. What is much harder, however, is falling in love with the entrenched human problems at the core of what these systems are meant to address. This is what made our view from the observation deck of One World Trade Center the perfect place to start. In every direction we could see the scale of human complexity. And, perhaps in the starkest of terms, were forced to think about the challenges that we would face by focusing on building a system that seeks to support human operators, rather than replace them.</p><p>Looking down on the city, which at that height is revealed much more as a living organism than a planned landscape, I remember telling the team that if there was ever the possibility that a single technology could empower every single person down there; living and working inside one of the most complex systems in the world, than that is what we are building. That is why we exist, so remember this view.</p><p>I am sharing this story now because Alluvium recently celebrated another milestone: our first anniversary. In this year we have learned and built some amazing things. While we have not shared much of that, I look forward to sharing much more about what we are building, and for whom, over the next several weeks. Over this time we have also grown, a bit. As part of that growth I have taken to having all new employees meet me at the observation deck on their first day. We talk about why Alluvium exists, and why they are the right person to continue what we started a year ago. Our first company tradition.</p><p>I have now done it several times, and beyond the awesomeness of the spectacle, I love having the opportunity to be re-humbled by the view, and see the reaction of my new colleague. Though it is “touristy,” I recommend visiting One World Trade Center to everyone who will listen — even New Yorkers. But that goes double for entrepreneurs, and those intrepid enough to join them.</p><p>But, if you cannot make it to New York, I hope you can find your own humbling view. One that unveils a tapestry of opportunity, complexity, and hope. A view from the start.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*8kqF8OWfHV6Op6qhrWDodQ.png\" /><figcaption>My view from the start</figcaption></figure><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=e2ac1aaf1a87\" width=\"1\" height=\"1\" alt=\"\">"
}