{
  "title": "#436: ALL CAPS (OOTP Chapter 4, 12 Grimmauld Place)",
  "link": "https://audioboom.com/posts/7383575",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4164,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>One of our listeners received the Harry Potter and the Goblet of Fire Illustrated Edition two weeks early! How does it compare to the rest of the series?</li>\n<li>This week we dive into Harry Potter and the Order of the Phoenix Chapter 4, 12 Grimmauld Place</li>\n<li>Seven Word Summary: Harry shouts loudly at everyone in CAPSLOCK</li>\n<li>As soon as Harry steps into the Black Family home, J.K. Rowling offers an ominous line. It's the first of many hints about Sirius' fate.</li>\n<li>Rowling has enjoyed using the number 12 throughout the Harry Potter series. We review its many major uses and a couple of our other favorite commonalities.</li>\n<li>Molly, who's usually a calming figure, isn't much help to Harry when he enters the Order's hideout. Should Harry have just barged into the Order meeting?</li>\n<li>Harry enters ALL CAPS mode for the first time in the series. While it was justified, we don't believe he should've taken it out on Ron and Hermione.</li>\n<li>What led Harry to this moment of epic fury? And what would it sound like?</li>\n<li>Speaking of rage, Percy isn't happy with the rest of his family after his recent promotion was downplayed by Arthur. Did Dad step out of line?</li>\n<li>Were we surprised to learn that Snape was in the Order? Good thing he leaves before dinner.</li>\n<li>The Umbridge Suck Count ticks up by 1 point, while Rita Skeeter gets an honorable mention.</li>\n<li>Quizzitch: What is the name of Bill Weasley’s unwitting informant into the Goblin POV?</li>\n<li>This week's episode is brought to you by ThirdLove! Find your perfect fitting bra at <a href=\"http://ThirdLove.com/MuggleCast\">ThirdLove.com/MuggleCast</a> and save 15%!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Mon, 30 Sep 2019 21:42:56 +0000",
  "guid": "tag:audioboom.com,2019-09-30:/posts/7383575",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}