{
  "id": "yt:video:Hj9dyb9lKAU",
  "yt:videoId": "Hj9dyb9lKAU",
  "yt:channelId": "UCkLHy_jxeaHTZCfGalg6QaA",
  "title": "Evacuating the Workplace Exit Routes and Exit Doors",
  "link": "",
  "author": {
    "name": "Conn Maciel Carey LLP",
    "uri": "https://www.youtube.com/channel/UCkLHy_jxeaHTZCfGalg6QaA"
  },
  "published": "2022-06-09T17:09:38+00:00",
  "updated": "2022-09-09T22:28:53+00:00",
  "media:group": {
    "media:title": "Evacuating the Workplace Exit Routes and Exit Doors",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Evacuating the workplace during an emergency is critical. However, consistently maintaining compliant exit access, routes, and doors in a busy workplace is often challenging, especially in warehouses, manufacturing facilities, and retail settings. OSHA routinely cites egress violations as Serious because of the potential for injury or death. It is an easy violation for inspectors to identify during on-site inspections, which often leads to the issuance of costly Repeat or Willful citations.\n\nTemporary or permanent storage of materials can create several compliance issues related to OSHA’s egress requirements, but there are several ways to maintain compliant exit routes and doors and ensure that they are always accessible. Identifying and maintaining egress routes and exits is an important element of a workplace’s emergency action plan. Employers should carefully develop emergency action plans and ensure employees understand not only how to evacuate the workplace during an emergency but how to maintain proper egress routes and exits throughout their work shifts, as it provides employees with a safer workplace and may even save lives.\n\nParticipants in this webinar will learn about:\n\n• OSHA enforcement history related to egress violations\n• The requirements for egress, exits, and emergency lighting, including acceptable means of egress for occupants to safely exit a building, illumination requirements, and rules for markings and signage to guide occupants to the exits\n• How to identify and address potential egress violations\n• How to create an effective emergency action plan\n• Tips to audit your workplace for compliance with 1910.36, 1910.37, and 1910.38\n\nA webinar from Conn Maciel Carey LLP.\n\nUse of this video does not in any manner constitute or establish an attorney-client relationship between Conn Maciel Carey and the viewer. This video may be deemed \"attorney advertising\" in jurisdictions from which it is accessed. The decision to hire a lawyer is a serious one and should be undertaken after consideration of all relevant information, not only information on this video.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}