{
  "title": "Universality and its limits in non-Hermitian many-body quantum chaos using the Sachdev-Ye-Kitaev model. (arXiv:2211.01650v1 [hep-th])",
  "link": "http://arxiv.org/abs/2211.01650",
  "description": "<p>Spectral rigidity in Hermitian quantum chaotic systems signals the presence\nof dynamical universal features at time scales that can be much shorter than\nthe Heisenberg time. We study the analogue of this time scale in many-body\nnon-Hermitian quantum chaos by a detailed analysis of long-range spectral\ncorrelators. For that purpose, we investigate the number variance and the\nspectral form factor of a non-Hermitian $q$-body Sachdev-Ye-Kitaev (nHSYK)\nmodel, which describes $N$ fermions in zero spatial dimensions. After an\nanalytical and numerical analysis of these spectral observables for\nnon-Hermitian random matrices, and a careful unfolding, we find good agreement\nwith the nHSYK model for $q &gt; 2$ starting at a time scale that decreases\nsharply with $q$. The source of deviation from universality, identified\nanalytically, is ensemble fluctuations not related to the quantum dynamics. For\nfixed $q$ and large enough $N$, these fluctuations become dominant up until\nafter the Heisenberg time, so that the spectral form factor is no longer useful\nfor the study of quantum chaos. In all cases, our results point to a weakened\nor vanishing spectral rigidity that effectively delays the observation of full\nquantum ergodicity. We also show that the number variance displays\nnon-stationary spectral correlations for both the nHSYK model and random\nmatrices. This non-stationarity, also not related to the quantum dynamics,\npoints to intrinsic limitations of these observables to describe the quantum\nchaotic motion. On the other hand, we introduce the local spectral form factor,\nwhich is shown to be stationary and not affected by collective fluctuations,\nand propose it as an effective diagnostic of non-Hermitian quantum chaos. For\n$q = 2$, we find saturation to Poisson statistics at a time scale of $\\log D$,\ncompared to a scale of $\\sqrt D$ for $ q&gt;2$, with $D $ the total number of\nstates.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/hep-th/1/au:+Garcia_Garcia_A/0/1/0/all/0/1\">Antonio M. Garc&#xed;a-Garc&#xed;a</a>, <a href=\"http://arxiv.org/find/hep-th/1/au:+Sa_L/0/1/0/all/0/1\">Lucas S&#xe1;</a>, <a href=\"http://arxiv.org/find/hep-th/1/au:+Verbaarschot_J/0/1/0/all/0/1\">Jacobus J. M. Verbaarschot</a>"
}