{
  "id": "tag:blogger.com,1999:blog-19803222.post-278518721111720089",
  "published": "2017-03-14T07:41:00.000-06:00",
  "updated": "2017-03-14T07:41:17.655-06:00",
  "title": "Awesome people: Kathy McKeown (IWD++)",
  "content": "To honor women this <a href=\"https://www.internationalwomensday.com/\">International Women's Day</a>, I have a several posts, broadly around the topic of women in STEM. Previous posts in this series include: <a href=\"https://nlpers.blogspot.com/2017/03/awesome-people-bonnie-dorr-iwd.html\">Awesome People: Bonnie Dorr</a>, <a href=\"https://nlpers.blogspot.com/2017/03/awesome-people-ellen-riloff-iwd.html\">Awesome People: Ellen Riloff</a>, <a href=\"https://nlpers.blogspot.com/2017/03/awesome-people-lise-getoor-iwd.html\">Awesome People: Lise Getoor</a> and  <a href=\"https://nlpers.blogspot.com/2017/03/awesome-women-karen-sparck-jones-iwd.html\">Awesome People: Karen Spärck Jones</a>.<br /><br /><a href=\"http://engineering.columbia.edu/web/newsletter/files_engineeringnews/McKeown300.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"https://engineering.columbia.edu/web/newsletter/files_engineeringnews/McKeown300.png\" width=\"150\" /></a>Continuing on the topic of \"who has been influential in my career and helped me get where I am?\" today I'd like to talk about <a href=\"https://www.blogger.com/blogger.g?blogID=19803222\">Kathy McKeown</a>, who is currently the Director of the Institute for Data Sciences and Engineering at Columbia. I had the pleasure of writing a mini-bio for Kathy for NAACL 2013 when I got to introduce her as one of the two invited speakers, and learned during that time that she was the first woman chair of computer science at Columbia and also the first woman to get tenure in the entirety of Columbia's School of Engineering and Applied Science. Kathy's name is near synonymous with ACL: she's held basically every elected position there is in our organization, in addition to being a AAAI, ACM, and ACL Fellow, and having won the Presidential Young Investigator Award from NSF, the Faculty Award for Women from NSF and the ABI Women of Vision Award.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://i.ytimg.com/vi/d-O_bFctgeY/hqdefault.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" height=\"150\" src=\"https://i.ytimg.com/vi/d-O_bFctgeY/hqdefault.jpg\" width=\"200\" /></a></div>One aspect of Kathy's research that I find really impressive is something that was highlighted in a nomination letter for her to be an invited speaker at NAACL 2013. I no longer have the original statement, but it was something like \"Whenever a new topic becomes popular in NLP, we find out that Kathy worked on it ten years ago.\" This rings true of my own experience: recent forays into digital humanities, work on document and sentence compression, paraphrasing, technical term translation, and even her foundational work in the 80s on natural language interfaces to databases (now called \"semantic parsing\").<br /><br />Although---like Bonnie and Karen---I met Kathy through DUC as a graduate student, I didn't start working with her closely until I moved to Maryland and I had the opportunity to work on a big IARPA proposal with her as PI. That was the first of two really big proposals that she'd lead and I'd work on. These proposals involved both a huge amount of new-idea-generation and a huge amount of herding-professors, both of which are difficult in different ways.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://monod.biomath.nyu.edu/index/images/awis/awardees1.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"http://monod.biomath.nyu.edu/index/images/awis/awardees1.jpg\" /></a></div>On the research end, in the case of both proposals, Kathy's feedback on ideas has been invaluable. She's amazingly good at seeing through a convoluted idea and pushing on the parts that are either unclear or just plain don't make sense. She's really helped me hone my own ideas here.<br /><br />On the herding-professors end, I am so amazed with how Kathy manages a large team. We're currently having weekly phone calls, and one of the other co-PI's and I have observed in all seriousness that being on these phone calls is like free mentoring. I hope that one day I'd be able to manage even half of what Kathy manages.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://www8.gsb.columbia.edu/financialstudies/sites/financialstudies/files/Kathy2014.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" src=\"http://www8.gsb.columbia.edu/financialstudies/sites/financialstudies/files/Kathy2014.jpg\" height=\"112\" width=\"200\" /></a></div>One of my favorite less-research-y memories of Kathy was when our previous IARPA project was funded, she invited the entire team to a kickoff meeting in the Hamptons. It was the Fall, so the weather wasn't optimal, but a group of probably a ten faculty and twenty students converged there, ran around the beach, cooked dinner as a group, and bonded. And we discussed some research too. I still think back to this even regularly, because it's honestly not something I would have felt comfortable doing in her position. I have a tendency to keep my work life and my personal life pretty separate, and inviting thirty colleagues over for a kickoff meeting would've been way beyond my comfort zone: I think I worry about losing stature. Perhaps Kathy is more comfortable with this because of personality or because  her stature is indisputable. Either way, it's made me think regularly about what sort of relationship I want and am comfortable with with students and colleagues.<br /><br />Spending any amount of time with Kathy is a learning experience for me, and I also have to thank Bonnie Dorr for including me on the first proposal with Kathy that kind of got me in the door. I'm incredibly indebted to her amazing intellect, impressive herding abilities, and open personality.<br /><br />Thanks, Kathy!",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "hal",
    "uri": "http://www.blogger.com/profile/02162908373916390369",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}