{
  "title": "Chinese Whispers: Algorithms and lockdowns – how China's gig economy works",
  "link": "https://audioboom.com/posts/8068191",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2498,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>‘One Shanghai courier uses own 70,000 yuan to buy necessities for people’, one Weibo hashtag <a href=\"https://s.weibo.com/weibo?q=%23%E4%B8%8A%E6%B5%B7%E4%B8%80%E5%BF%AB%E9%80%92%E5%91%98%E8%87%AA%E6%8E%8F7%E4%B8%87%E5%85%83%E7%BB%99%E4%BA%BA%E4%B9%B0%E7%89%A9%E8%B5%84%23\">trended</a> last week. Instead of being seen as a damning indictment on what the state’s strict lockdown has induced people to do, the courier was lauded as a community hero and the story promoted by the censored platform. These <em>kuaidi xiaoge</em> (‘delivery bros’) are most likely gig economy workers. The industry was already an integral part to the Chinese urbanite’s life before the pandemic, but Covid has consolidated that role, as low-paid and hardworking gig economy drivers literally became critical to the survival of millions.</div>\n<br>\n<div>The Chinese gig economy is in many ways more advanced. The services are more extensive (grocery shopping and even designated drivers – a stranger to drive your car home on drinking nights – have been the norm for years) and the algorithms are more ruthless (closely monitoring and continuously shaving off delivery times. ‘The pandemic really brought the plight of these workers into the mainstream consciousness for the first time’, Viola Rothschild, my guest on this episode, tells me.</div>\n<br>\n<div>She is a PhD candidate at Duke University, and one of the few people – academics and journalists alike – who have looked into the Chinese gig economy. I’ve known Viola for years – we first met when we read for a masters in contemporary Chinese studies together.</div>\n<br>\n<div>On the episode, we discuss what working conditions are like (she recommends <a href=\"https://chuangcn.org/2020/11/delivery-renwu-translation/\">this article</a>), the interactions between the state and the private sector (the largest players in the field are Alibaba and Didi Chuxing, both companies that have been penalised by the Chinese government in recent years), and what the pandemic – and particularly the Shanghai lockdown – has done to workers. We discuss the government’s efforts to improve working environments, but Viola tells me:</div>\n<br>\n<blockquote>‘What workers get through unionisation is really about what the state wants to give them, if their goals align with the state’s at any given time in terms of pressuring these companies. This is especially thrown into clear relief when we see how the state treats workers who try to organise outside of this apparatus’</blockquote><br>\n<div>By that, Viola is referring to the <em>kuaidi xiaoge</em> who’ve been arrested for organising their own unions – it’s still deeply ironic that the most successful purportedly Marxist state in the world today is deeply suspicious of workers creating their own unions.</div>\n<br>\n<div>But fundamentally, as I push back at Viola, the problem is not only the private companies or the communist state, but also the consumers who demand faster and cheaper services. In that, ‘I think that the Chinese gig economy has a tonne in common with its American and British, and worldwide, counterparts’, Viola says. I totally agree. </div>\n",
  "pubDate": "Mon, 18 Apr 2022 11:00:00 +0000",
  "guid": "tag:audioboom.com,2022-04-17:/posts/8068191",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}