{
  "title": "S15 Ep32: Close Encounter of the Fifth Kind with Dr. Steven Greer",
  "link": "https://audioboom.com/posts/8098491",
  "itunes:episode": 32,
  "itunes:title": "Close Encounter of the Fifth Kind with Dr. Steven Greer",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6185,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio has a Close Encounter of the Fifth Kind with Dr. Steven Greer!<br>\n<br>\nCLOSE ENCOUNTERS OF THE FIFTH KIND is a feature documentary presented by Dr. Steven Greer, the global authority on extraterrestrials who created the worldwide disclosure movement and routinely briefs presidents and heads of state on the ET phenomenon.<br>\n<br>\nUFO’s suddenly grace the covers of the NY Times and Washington Post in the age of “fake news” and #conspiracy memes, how can we make sense of these revelations without losing our grip on reality? Dr. Greer answers these questions for us today.<br>\n<br>\nVisit his site for more info: <a href=\"http://siriusdisclosure.com\">siriusdisclosure.com</a><br>\n<br>\nVisit his YouTube Channel:  <a href=\"https://www.youtube.com/user/SDisclosure?fbclid=IwAR2iG2r66Rj4Ad6_u0tu2tYWPnmphomjtJo9EOKlp5ACZzCJlLY8QI0NjgU\">https://www.youtube.com/user/SDisclosure?fbclid=IwAR2iG2r66Rj4Ad6_u0tu2tYWPnmphomjtJo9EOKlp5ACZzCJlLY8QI0NjgU</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nWhite Castle Sliders have a unique, one-of-kind taste that’s totally crave worthy! They are the perfect home solution for lunches, snacks and dinners , eat them by yourself or eat them with family!  Pick up White Castle Sliders in freezer aisles nationwide!<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping.",
  "itunes:summary": "Darkness Radio has a Close Encounter of the Fifth Kind with Dr. Steven Greer!\n\nCLOSE ENCOUNTERS OF THE FIFTH KIND is a feature documentary presented by Dr. Steven Greer, the global authority on extraterrestrials who created the worldwide...",
  "pubDate": "Sun, 19 Apr 2020 08:00:00 +0000",
  "guid": "303206b3-b2cf-49c3-b3e4-e1032b1bfffd",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}