{
  "title": "A review of the online course “Introduction to Big Data with Apache Spark”",
  "link": "",
  "published": "2015-07-11T14:15:00-07:00",
  "updated": "2015-07-11T14:15:00-07:00",
  "author": {
    "name": "Cathy Yeh"
  },
  "id": "tag:efavdb.com,2015-07-11:/review-intro-to-big-data-with-spark",
  "summary": "<p>This is a review of <a href=\"https://www.edx.org/course/introduction-big-data-apache-spark-uc-berkeleyx-cs100-1x\">Introduction to Big Data with Apache Spark</a> (<span class=\"caps\">CS100</span>.1x), the first in a two-part series introducing the big data processing engine, <a href=\"https://spark.apache.org/\">Spark</a>.</p>\n<p>The one month-long <span class=\"caps\">MOOC</span> was offered on edX for the first time in June 2015, and its sequel, <a href=\"https://www.edx.org/course/scalable-machine-learning-uc-berkeleyx-cs190-1x\">Scalable Machine Learning</a> (<span class=\"caps\">CS190</span>.1x …</p>",
  "content": "<p>This is a review of <a href=\"https://www.edx.org/course/introduction-big-data-apache-spark-uc-berkeleyx-cs100-1x\">Introduction to Big Data with Apache Spark</a> (<span class=\"caps\">CS100</span>.1x), the first in a two-part series introducing the big data processing engine, <a href=\"https://spark.apache.org/\">Spark</a>.</p>\n<p>The one month-long <span class=\"caps\">MOOC</span> was offered on edX for the first time in June 2015, and its sequel, <a href=\"https://www.edx.org/course/scalable-machine-learning-uc-berkeleyx-cs190-1x\">Scalable Machine Learning</a> (<span class=\"caps\">CS190</span>.1x) is currently under&nbsp;way.</p>\n<p><a href=\"https://efavdb.com/wp-content/uploads/2015/07/IntroToSpark_screenshot.jpg\"><img alt=\"lecture screenshot\" src=\"https://efavdb.com/wp-content/uploads/2015/07/IntroToSpark_screenshot.jpg\"></a></p>\n<p>Still from a lecture in &#8220;Introduction to Big Data with Apache&nbsp;Spark&#8221;</p>\n<p>Learning a new syntax is an unavoidably dry exercise; despite that handicap, the course lectures are watchable and directly relevant to the&nbsp;labs.</p>\n<p>Of course, the fun is in applying that hard-earned knowledge&#8230;actually, the learning curve is quite shallow, since a dozen or so basic Spark commands are enough to get you started on a simple project, e.g. see an example on <a href=\"https://github.com/EFavDB/Spark-example/blob/master/explore_model_bills.ipynb\">github</a>.</p>\n<p>The weekly assignments, provided in the form of IPython notebooks, are well-designed, keeping the focus on learning Spark (rather than coding/debugging python) by providing a skeleton of pre-filled code chunks for each&nbsp;assignment.</p>\n<p>The labs&nbsp;are:</p>\n<ol>\n<li>word counting all of Shakespeare’s&nbsp;plays</li>\n<li><span class=\"caps\">NASA</span> Apache web server log&nbsp;analysis</li>\n<li>entity resolution of Google and Amazon product&nbsp;listings</li>\n<li>collaborative filtering to make movie&nbsp;recommendations</li>\n</ol>\n<p>Students only have to fill in sections of code that relate to the application of Spark. The structure of the assignments thus results in a gratifying amount of payoff for a small amount of work. You don’t need to be fluent in python&#8212;far from it&#8212;in order to complete the labs, and can likely pick up what you need along the way if you have experience in some other programming&nbsp;language.</p>\n<p>I did find the labs to be much more time-consuming than the course estimates, partly&nbsp;because:</p>\n<ul>\n<li>Error tracebacks in Spark tend to hit you like a great wall of angry text, and are hard to parse (to the uninitiated, at&nbsp;least).</li>\n<li>I was more hesitant to experiment/test freely in the IPython Notebooks out of a fear that some unsanctioned code would cause problems with the tetchy lab Autograder. However, it never did freeze on me, although it did for others who were too liberal in their use of <a href=\"https://spark.apache.org/docs/latest/api/python/pyspark.html#pyspark.RDD.collect\">collect()</a>&nbsp;statements.</li>\n</ul>\n<p>The instructors were extremely responsive to student questions and nimble to implement improvements in real-time. I&#8217;m sure the course will continue to improve over the next&nbsp;iterations.</p>\n<p>A few lucky students, including myself, were randomly selected to have access to the <a href=\"http://www.databricks.com/\">Databricks</a> cloud-computing platform for the duration of the&nbsp;course.</p>\n<p>Although the procedures for running Spark in the standard course software (a prepared virtual machine) and Databricks cluster are almost identical, having cloud minions doing your bidding may tickle megalomaniacal tendencies you didn&#8217;t know you&nbsp;had.</p>",
  "category": [
    "",
    "",
    "",
    "",
    ""
  ]
}