{
  "id": "https://bibleinoneyear.org/en/youth/143",
  "title": "Day 143: The Love of Your Life",
  "description": "Psalm 66:13-20, 1 Samuel 13:13-14, 14:6, John 13:21–38.  He tells us to love God, to love one another (John 13:34–35), to love our neighbour as ourselves and even to love our enemies  He demonstrates all this in his own life through loving everyone (even Judas who betrayed him as we see in today’s passage), and laying down his life for us all in love",
  "pubDate": "Mon, 23 May 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/143/",
  "itunes:duration": "14:02",
  "guid": "enyouth23052022-143",
  "length": 842.03,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 143: The Love of Your Life",
  "itunes:subtitle": "Psalm 66:13-20, 1 Samuel 13:13-14, 14:6, John 13:21–38.  He tells us to love God, to love one another (John 13:34–35), to love our neighbour as ourselves and even to love our enemies  He demonstrates all this in his own life through loving everyone (even Judas who betrayed him as we see in today’s passage), and laying down his life for us all in love",
  "itunes:summary": "In February 1977, Bishop Festo Kivengere was part of a group of church leaders who delivered a letter of protest to the dictator, Idi Amin, speaking out against the beatings, arbitrary killings and unexplained disappearances taking place across Uganda at that time. The next day, Festo Kivengere’s friend and leader, Archbishop Janani Luwum was murdered by Idi Amin and Bishop Festo was driven into hiding and then exile.\nSoon afterwards, Festo Kivengere published a book entitled I Love Idi Amin. In the book he explained the extraordinary title: ‘The Holy Spirit showed me that I was getting hard in my spirit… so I had to ask for forgiveness from the Lord, and for grace to love President Amin more… this was fresh air for my tired soul. I knew I had seen the Lord and been released: love filled my heart.’\nLove is more than a feeling or an emotion. It is a decision about how we treat one another. Jesus was the supreme example of love in the history of the world. He tells us to love God, to love one another (John 13:34–35), to love our neighbour as ourselves and even to love our enemies. He demonstrates all this in his own life through loving everyone (even Judas who betrayed him as we see in today’s passage), and laying down his life for us all in love.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 508
}