{
  "title": "Jo Koy Interview || Kelly Keegs is Going to Reveal a Butt Tattoo on OnlyFans",
  "description": "<p>0:00 The women at Barstool are starting OnlyFans and making an outrageous amount of money.\n5:45 Kelly Keegs joins the show to tell us her OnlyFans plan\n36:19 Kevin and John are starting OnlyFans\n57:59 Jackie breaks down her experience so far on Surviving Barstool\n1:04:16 Latest Gen Z trend is grand theft auto and faking kidnappings\n1:13:35 Kevin was recognized by an iconic director\n1:20:18 Frank Ocean is selling a C*ck ring\n1:26:45 Feits thought Kim Kardashian and Pete Davidson breaking up was a nightmare\n1:29:18 Alex Jones ordered to pay 40 million to family of Sandy Hook tragedy \n1:35:45  More Alex Jones court mess-ups\n1:39:40 Dave Matthews Band Story Anniversary / Grit Tour Puke\n1:46:29 Voicemails\n- Farmer calls in to clarify our theories on cows milk\n- Was Tommy Smokes a p*ssy in his latest reality show win\n- Would you allow an old guy to pee on your car? // Somehow this leads to a Pup Punk recap\n\n2:11:00 Jo Koy joins the show to talk about his new movie Easter Sunday (out now!), how he sold the movie to Steven Spielberg, family stories, and much more.\n\n\n\nCortina Health\t\nGet your first month free with promo code KFC at https://barstool.link/CortinaKFC\n\nOmaha Steaks\t\nGo to https://barstool.link/OmahaSteaksBSS and type KFC in the search bar.\n\nRoman\t\nGet $15 off your first order of Roman T-Support at https://barstool.link/ROMANkfc\n\nWhistlePig Whiskey\t\nGet your bottle at https://barstool.link/WPKFC\n\nFFUPS\t\nGo to https://barstool.link/ffupsKFC and use code KFC15 for 15% off</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/kfcr\">barstool.link/kfcr</a></p>",
  "guid": "2d52969d-bb68-4706-8b8c-0cbce747d348",
  "pubDate": "Tue, 9 Aug 2022 08:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/kfc-radio",
  "itunes:explicit": "yes",
  "itunes:duration": "02:57:45",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}