{
  "id": "yt:video:tghqgDo_k8k",
  "yt:videoId": "tghqgDo_k8k",
  "yt:channelId": "UCG_nvdTLdijiAAuPKxtvBjA",
  "title": "Thor: Love and Thunder — Why Marvel Villains Keep Flopping | Anatomy Of A Failure",
  "link": "",
  "author": {
    "name": "Filmento",
    "uri": "https://www.youtube.com/channel/UCG_nvdTLdijiAAuPKxtvBjA"
  },
  "published": "2022-09-16T18:00:19+00:00",
  "updated": "2022-09-19T18:45:02+00:00",
  "media:group": {
    "media:title": "Thor: Love and Thunder — Why Marvel Villains Keep Flopping | Anatomy Of A Failure",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Start speaking a new language in 3 weeks with Babbel 🎉. Get up to 60% OFF your subscription ➡️ here: https://go.babbel.com/t?bsc=1200m60-youtube-filmento-sept-2022&btp=default&utm_term=generic_v1&utm_medium=paidsocial&utm_source=YouTube&utm_content=Influencer..filmento..USA..YouTube\n\n\nThor: Love and Thunder reunites Thor with Natalie Portman's Jane Foster, who has now become a Thor as well, to take down the evil Gorr played by Christian Bale. Obviously this movie overall is yet another 10/10 as you can always expect from Marvel, but there is one negative aspect here as well: the villain. For some reason Gorr becomes another bland and forgettable MCU villain that you're gonna forget as soon as the movie ends, even despite Christian Bale. We already touched on this topic with Wanda in Doctor Strange in the Multiverse of Madness, but let's look for a couple more reasons why Marvel villains suck and how to avoid those problems ourselves.\n\nFilmento en Español: \nhttps://youtu.be/ViDZUofaZd8\n\nSupport:     https://patreon.com/filmento\nFollow:        https://twitter.com/filmento\n\n#thorloveandthunder #marvel    #anatomyofafailure \n\nMusic:\n\n\n-\nThor: Love and Thunder (2022)\nThe God of Thunder’s latest adventure—including a trek to Olympus where Zeus (Russell Crowe) reigns supreme. The film finds Thor (Chris Hemsworth) on a journey unlike anything he’s ever faced – a search for self-discovery. But his retirement is interrupted by a galactic killer known as Gorr the God Butcher (Christian Bale), who seeks the extinction of the gods. To combat the threat, Thor enlists the help of King Valkyrie (Tessa Thompson), Korg (Taika Waititi) and ex-girlfriend Jane Foster (Natalie Portman), who – to Thor’s surprise – inexplicably wields his magical hammer, Mjolnir, as the Mighty Thor. Together, everything wrong with Thor love and thunder honest trailer thor love and thunder bad movie thor vs gorr fight love and thunder zeus funny moments good movie thor love and thunder best moments only action black and white lady thor natalie portman thor explained thor love and thunder watch full movie online free 4k clips hd screenwriting thor vs zeus love and thunder post credits mistakes bad cgi terrible cgi doctor strange 2 multiverse of  madness the wanda problem of madness they embark upon a harrowing cosmic adventure to uncover the mystery of the God Butcher’s vengeance and stop him before it’s too late. Directed by Taika Waititi (“Thor: Ragnarok,” “Jojo Rabbit”) and produced by Kevin Feige and Brad Winderbaum, “Thor: Love and Thunder” opens in U.S. theaters July 8, 2022.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}