{
  "title": "Facts and Data Have No Meaning without a Theory to Explain Them",
  "link": "https://mises.org/node/60746",
  "description": "<p>Many economists, including Milton Friedman, have believed that since it is impossible to establish “how things really work,” the underlying assumptions of a model are unimportant. Anything goes provided the model can yield good predictions. Friedman <a href=\"https://books.google.com/books?id=Fv8846OSbvwC&printsec=frontcover&dq=Essays+in+Positive+Economics&hl=en&newbks=1&newbks_redir=1&sa=X&ved=2ahUKEwi1y9zUro37AhWHFVkFHX87ACkQuwV6BAgNEAc\">wrote</a>:</p>\n<blockquote><p>The ultimate goal of a positive science is the development of a theory or hypothesis that yields valid and meaningful (i.e., not truistic) predictions about phenomena not yet observed.</p></blockquote>\n<p>Furthermore, <a href=\"https://books.google.com/books?id=Fv8846OSbvwC&printsec=frontcover&dq=Essays+in+Positive+Economics&hl=en&newbks=1&newbks_redir=1&sa=X&ved=2ahUKEwi1y9zUro37AhWHFVkFHX87ACkQuwV6BAgNEAc\">according to</a> Friedman:</p>\n<blockquote><p>The relevant question to ask about the assumptions of a theory is not whether they are descriptively realistic, for they never are, but whether they are sufficiently good approximation for the purpose in hand. And this question can be answered only by seeing whether the theory works, which means whether it yields sufficiently accurate predictions.</p></blockquote>\n<p>For Friedman, since reality is likely to be elusive our knowledge of it is tentative—one cannot know true nature. Also, Friedman and most mainstream economists believe the state of the economy is derived from the data. By inspecting the data, such as the gross domestic product or the consumer price index, the analyst forms a view regarding the likely state of economic conditions.</p>\n<p>Ludwig von Mises held a different view, <a href=\"https://cdn.mises.org/Human%20Action_3.pdf\">writing</a>:</p>\n<blockquote><p>The arrangement of various price data in groups and the computation of averages are guided by theoretical deliberations, which are logically and temporally antecedent.</p></blockquote>\n<p><a href=\"https://cdn.mises.org/Human%20Action_3.pdf\">Moreover</a>:</p>\n<blockquote><p>It is vain to search for coefficients of correlation if one does not start from a theoretical insight acquired beforehand.</p></blockquote>\n<p>Mises believed that data is a historical display and by itself cannot provide the analyst with an explanation of the real world. He <a href=\"https://cdn.mises.org/Human%20Action_3.pdf\">wrote</a>:</p>\n<blockquote><p>Experience of economic history is always the experience of complex phenomena. It can never convey knowledge of the kind the experimenter abstracts from a laboratory experiment.</p></blockquote>\n<p>To make sense of the data an economist must have a theory which stands on its own feet and does not originate from the data itself. The key point is that it must originate from something real that cannot be refuted. A theory that rests on the foundation that human beings act consciously and purposefully fulfils this, since human beings act consciously and purposefully (anyone that tries to refute this point <a href=\"https://cdn.mises.org/Economic%20Science%20and%20the%20Austrian%20Method_3.pdf\">consciously and purposefully contradicts himself</a>).</p>\n<p>Ludwig von Mises labelled this framework as praxeology. By means of praxeology, Mises was able to derive the entire body of economics. The <a href=\"HYPERLINK%20%22https:/mises.org/library/theory-and-history-interpretation-social-and-economic-evolution%22\">knowledge</a> that human actions are conscious and purposeful allows an analyst to make sense of historical data.</p>\n<h4>The Importance of Defining the Subject of Investigation</h4>\n<p>The key to understanding data is to establish the subject of analysis. Once the subject is established, the next step is to define the subject. The purpose of the definition is to determine the key factors determining the subject of the investigation.</p>\n<p>To establish a definition, one should go back to the point of time when a particular thing has emerged. For example, when analyzing money supply, we would go back to when a particular commodity <a href=\"https://books.google.com/books?id=7syA3yAPsNkC&printsec=frontcover&dq=The+Ayn+Rand+Lexicon&hl=en&newbks=1&newbks_redir=1&sa=X&ved=2ahUKEwjh1M-tr437AhXvKlkFHZdEAS8QuwV6BAgFEAc\">began to assume the role of money</a>. In this case, one would ascertain that individuals originally used money to promote the trade of goods for goods.</p>\n<p>A commodity that was selected as money enabled the most efficient exchange. By ascertaining the medium of the exchange, we establish that individuals are paying for one good with another good, aided by money.</p>\n<p>We can also establish that increases in the quantity of money—i.e., inflation of money generates a decrease in the purchasing power of money, all other things being equal. This is because increases in the money supply result in a greater amount of money per unit of a good than in the previous situation, all other things being equal, since the price of a good is the amount of money per unit of a good. Hence, from an increase in the money supply, one can infer that, all other things being equal, more money will be spent per good—i.e., prices of goods are going to increase—and a decline in the money’s purchasing power will emerge.</p>\n<p>Without defining what price is, it will not be possible to say anything meaningful about the key cause of the increase in the prices of goods, which is the increase in money supply. The definition that money is the medium of exchange enables us to establish that once money is injected there are always early and late recipients of money. This. In turn, enables us to infer that a change in the money supply is likely to have a lagged effect on the prices of goods in various markets.</p>\n<p>Now, without a theoretical framework the data by itself cannot tell us the conditions of the economy so to speak. It cannot tell us whether the strong GDP data is because of wealth expansion or because of the erosion of the wealth generation process.</p>\n<p>Once it is established that loose monetary policies of the central bank are behind the so-called strong economic conditions, then by means of a theory, we can establish that this is going to weaken the wealth generation process. In the modern world of the paper money standard, we can ascertain that an increase in money supply results in an exchange of nothing for something. It leads to a diversion of wealth from wealth generators to non-wealth-generating activities.</p>\n<p>According to the founder of the Austrian school of economics, Carl Menger, to maintain their lives and well-being, individuals <a href=\"https://cdn.mises.org/Principles%20of%20Economics_5.pdf\">will prefer present consumption to future consumption</a>. We suggest that as individual’s wealth expands, the premium assigned to present consumption over future consumption is likely to decline. The premium of present consumption over future consumption is what interest is all about.</p>\n<p>A higher time preference—i.e., preferring present consumption to future consumption, implies that to stay alive individuals have to assign a higher premium to present consumer goods versus the future consumer goods. From this, we can also establish that only individuals’ time preferences determine interest rates, as opposed to central bank policies. Central bank policies can only distort interest rates thus setting in motion boom-bust cycles and economic impoverishment. Also, note that the positive time preference implies that interest rates must be positive.</p>\n<p>The fact that an individual pursues purposeful actions implies that causes in the world of economics emanate from human beings and not from outside factors. This means that mathematical methods will not be helpful.</p>\n<p>For instance, contrary to popular thinking, individual outlays on goods are not caused by real income as such. In his own unique context, every individual decides how much of a given income will be used for consumption and how much for investments.</p>\n<p>While it is true that individuals will respond to changes in their incomes, the response is not automatic. Every individual assesses the increase in income against the particular set of goals he wants to achieve. He might decide that it is more beneficial to him to raise his investment in financial assets rather than to raise consumption.</p>\n<h4>Conclusion</h4>\n<p>Reliance on statistical data as a foundation for evaluating the economy is questionable. Statistical data cannot produce much information about the facts of reality without a theory that “stands on its own feet” and is not derived from the data. Once the theory passed the logical test it becomes the tool for the establishing the facts of reality through the assessment of the data.</p>\n<p>Theory also permits us to ascertain the reasons for discrepancies between the data and what the theory supposes. For instance, according to the economic theory, individuals assign a greater importance to consumption at present versus consumption in the future, something we established earlier.</p>\n<p>According to theory, interest rates cannot be negative. If, however, we do observe negative rates, this does not contradict the theory but rather forces the analyst to ponder how this could have happened. Most likely, he will discover that central bank monetary policies have forced this on the economy.</p>\n<p>Various mathematical and statistical methods cannot assist an analyst in establishing causes in the world of economics. All that these methods can do is to describe things. To ascertain the underlying causes, one requires a logically worked out theory.</p>\n\n",
  "author": "Frank Shostak",
  "enclosure": "",
  "guid": 60746,
  "pubDate": "Fri, 04 Nov 2022 14:00:00 -0500",
  "source": "Mises Wire"
}