{
  "id": "yt:video:QsBLdiZ8nSk",
  "yt:videoId": "QsBLdiZ8nSk",
  "yt:channelId": "UCRRr_xrOm66qaigIbwFLvbQ",
  "title": "How we stop cement ruining the climate",
  "link": "",
  "author": {
    "name": "Simon Clark",
    "uri": "https://www.youtube.com/channel/UCRRr_xrOm66qaigIbwFLvbQ"
  },
  "published": "2022-10-30T11:03:10+00:00",
  "updated": "2022-10-31T09:29:54+00:00",
  "media:group": {
    "media:title": "How we stop cement ruining the climate",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Cement is the second most consumed commodity on Earth. That's a problem. Learn more about the climate crisis with CuriosityStream and Nebula: https://www.curiositystream.com/simonclark\n\nOur carbon emissions are overwhelmingly from our use and generation of energy, which means that our response to the climate crisis largely needs to be the decarbonisation of energy, specifically ending our dependence on fossil fuels. However, around one quarter of all our emissions come from other processes, one of the largest of which is construction. These emissions are mostly from cement production, due to the nature of making cement. \nIn this video I shine a light on one company - LEILAC - who are developing what I think is a realistic, scalable solution to this problem. Which, in what may be a surprise to some, involves carbon capture technology. I also ask how a company has made a business model out of preventing carbon emissions, and what this tells us about how capitalism can respond to the climate crisis.\n\nReferences\n(1) https://ourworldindata.org/emissions-by-sector\n(2) https://youtu.be/l3ed4v4tBhA\n(3) https://youtu.be/UOd-Jgly9Us\n\nDisclaimer: I have not been paid by LEILAC or its parent company Calix to make this video. LEILAC reached out and asked if I'd be interested in covering their technology, and I was given total editorial freedom to make this video. \n\nMore about LEILAC: https://www.leilac.com/\n\nYou can support the channel by becoming a patron at http://www.patreon.com/simonoxfphys\n\nCheck out my website! https://www.simonoxfphys.com/\n\n---------- II ----------\n\nMy twitter - http://www.twitter.com/simonoxfphys\nMy facebook - http://www.facebook.com/youtubesimon\nMy insta - http://www.instagram.com/simonoxfphys\nMy goodreads - http://www.goodreads.com/simonoxfphys\n\n---------- II ----------\n\nMusic by Epidemic Sound: http://epidemicsound.com\nSome stock footage courtesy of Getty.\nEdited by Luke Negus.\n\nVideo about cement production, cement CO2 emissions, cement carbon emissions, how cement is ruining the climate. In this video I talk about unavoidable carbon emissions, and a fringe case that calls for the use of carbon capture technology, and look at a company providing carbon capture technology called LEILAC. If you like video essays about climate change from Wendover, Real Engineering, Smarter Every Day, It's OK to be Smart, or Veritasium, you'll enjoy this fun science video about carbon capture.\n\nHuge thanks to my supporters on Patreon: Mark Injerd, dryfrog, Justin Warren, Jack Grimm, Angela Flierman, Alipasha Sadri, Calum Storey, Mattophobia, Riz, Jan Krüger, The Confusled, Wessel van der Heijden, Conor Safbom, William Pettersson, Paul H and Linda L, Simon Stelling, Gabriele Siino, Ieuan Williams, Candace H, Tom Malcolm, Marcus Bosshard, Leonard Neamtu, Brady Johnston, Liat Khitman, Kent & Krista Halloran, Rapssack, Kevin O'Connor, Timo Kerremans, Ashley Wilkins, Michael Parmenter, Samuel Baumgartner, Dan Sherman, ST0RMW1NG 1, Adrian Sand, Morten Engsvang, Cio Cio San, Farsight101, K.L, fourthdwarf, Daan Sneep, Felix Freiberger, Chris Field, ChemMentat, Kolbrandr, , Sebastain Graf, Dan Nelson, Shane O'Brien, Alex, Fujia Li, Cody VanZandt, Jesper Koed, Jonathan Craske, Albrecht Striffler, Igor Francetic, Jack Troup, HandsomeCaveman, Sean Richards, Kedar , Omar Miranda, Alastair Fortune, bitreign33 , Mat Allen, Rafaela Corrêa Pereira, Colin J. Brown, Mach_D, Thusto , Andy Hartley, Lachlan Woods, Dan Hanvey, Simon Donkers, Kodzo , James Bridges, Liam , Andrea De Mezzo, Wendover Productions, Kendra Johnson.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}