{
  "title": "Last post on that $100,000 Uber paper",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/23/last-post-on-that-100000-uber-paper/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/23/last-post-on-that-100000-uber-paper/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Sun, 23 Oct 2022 13:33:38 +0000",
  "category": [
    "Economics",
    "Sociology",
    "Zombies"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=47950",
  "description": "We recently had two posts (here and here) on the controversy involving Alan Krueger, the economist who was paid $100,000 in 2015 by the taxi company Uber to coauthor a paper for them. As I wrote, I&#8217;ve done lots of &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/23/last-post-on-that-100000-uber-paper/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>We recently had two posts (<a href=\"https://statmodeling.stat.columbia.edu/2022/07/28/what-can-100000-get-you-nowadays-discussion-of-the-market-for-papers-in-economics/\">here</a> and <a href=\"https://statmodeling.stat.columbia.edu/2022/08/19/krueger-uber-100000-update/\">here</a>) on the controversy involving Alan Krueger, the economist who was paid $100,000 in 2015 by the taxi company Uber to coauthor a paper for them.  As I wrote, I&#8217;ve done lots of business consulting myself, so I don&#8217;t really see any general problem here, but, at this point it seems that nobody really trusts that particular article anyway.  I guess what Uber got from the payment was a short-term benefit to its reputation:  the article came out at a time when much of the economics profession was in love with Uber, and this paper was just one more part of it.</p>\n<p>The discussion was kicked off a couple of months ago by an economist who sent me an email on the topic and who wishes to remain anonymous.  After seeing the two posts, my correspondent writes:</p>\n<blockquote><p>I think I largely agree with you that almost everyone is now discounting the paper, pretty much completely. And after I read what the Uber executives were doing (or at least thinking of doing), it&#8217;s hard not to come to the same conclusion. Even if nothing worst was done, the <em>possibility</em> that the some data might not be provided means that there&#8217;s an inherent bias that falls right there with the typical issues you&#8217;ve discussed before of forking paths, except instead of happening due to choices made by the researcher, it&#8217;s happening at the data provider and in a even more blatantly manipulative way. Barring some new revelation from Hall or the other economists engaged by Uber that they somehow managed to stop Uber from acting this way (or that Uber somehow convinces us that they didn&#8217;t), scepticism is more than justified.</p>\n<p>Note, that I&#8217;m emphasising here the core issue of the Uber executives and administrative staff much more so than the researchers&#8217; actions, to me that&#8217;s where the biggest problem lies.</p>\n<p>There&#8217;s one last issue that I feel remains and I won&#8217;t be surprised if you&#8217;re still thinking of addressing it, which is how to do we move forward from all this? The inherent tension of the costs and benefits of using proprietary data are now even more sharply delimitated now. Should researchers no longer accept payment from companies they engage with if they want to publish in academic journals and working paper series? I know that you&#8217;ve written that you&#8217;ve received payment in such situations in the past, does that make you feel you need to revaluate things? Essentially, I&#8217;m asking what actions can researchers take that would give themselves (and their peers) the assurance that companies are not trying to use them by omitting data and the like?</p>\n<p>Don&#8217;t get me wrong, the potential benefits are high from using this sort data and not just from a getting-published-in-a-great-journal perspective. I&#8217;ve come up with several research ideas that would only really be possible with such data and I would leap at such opportunities; to be honest, I have a big research project that, in my esteem is quite important, that&#8217;s currently stalled precisely because of this issue! So, I would certainly not advocate for ceasing these types of collaborations. But it does seem to me that to best benefit society and science, there needs to be a discussion about what&#8217;s the best way forward&#8230;</p>\n<p>Anyway, I&#8217;ve clearly written too much as it stands, I have teaching prep and research to do!  I&#8217;ve really enjoyed seeing the debates and I&#8217;m happy that these questions are being addressed openly. We, as in economists, could use some more careful thinking about all of this&#8230;</p></blockquote>\n<p>My response:  I think open display of funding is a good idea.  Some journals expect this sort of list and some don&#8217;t.  I include a list of past and present sponsors <a href=\"https://statmodeling.stat.columbia.edu/sponsors/\">here</a>. Also, people have lots of non-financial conflicts of interest relating to friends, political ideologies, fear of pissing off the wrong people, etc.  I bring these up not to say that conflict-of-interest declarations are a bad idea, just to say that things are complicated.</p>\n<p>I guess that right now I assume that undeclared conflicts of one sort or another are inevitable in many cases.  In the Uber example, the conflict was declared right away on the front page of the article, so that was pretty clear, and I think the only reason the news media didn&#8217;t make a bigger deal of the conflict at the time was that the article was telling them something they wanted to hear.</p>\n<p>The other issue brought up by my correspondent was proprietary data.  I&#8217;m not sure what to say here except that lots of data isn&#8217;t proprietary or confidential at all, but researchers still aren&#8217;t sharing.  An extreme case was that <a href=\"https://statmodeling.stat.columbia.edu/2014/05/30/mmm-statistical-significance-evilicious/\">disgraced primatologist</a> who wouldn&#8217;t even share his videotapes with his own research collaborators.  Another example would be those surveys you sometimes here about where they don&#8217;t tell you how they did the sampling or what were the questions being asked (<a href=\"https://statmodeling.stat.columbia.edu/2022/08/07/i-know-it-might-sound-strange-but-i-believe-youll-be-coming-back-before-too-long/\">here&#8217;s an example</a>).</p>\n<p>But, yeah, if as a reader of the article you don&#8217;t have full access to the data or the data-collection mechanism, then that limits the trust you have in the results, whether or not the funding source has been clarified.</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/23/last-post-on-that-100000-uber-paper/feed/",
  "slash:comments": 5
}