{
  "title": "Episode 17: &#8220;Money Honey&#8221; by Clyde McPhatter and the Drifters",
  "link": "https://500songs.com/podcast/money-honey-by-clyde-mcphatter-and-the-drifters/",
  "pubDate": "Mon, 28 Jan 2019 06:58:52 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/money-honey-by-clyde-mcphatter-and-the-drifters/",
  "description": "Welcome to episode seventeen of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Money Honey\" by the Drifters. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Erratum</strong>\n\nAt one point in the podcast I say \"Calhoun was the most important figure in the musical side of Atlantic Records\". Obviously I meant \"Stone was...\" -- Charles Calhoun was only a pen name, and I refer to Jesse Stone as Jesse Stone everywhere else in the episode.\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplema/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode. In this case, two tracks are slightly different from the versions I used in the podcast -- I accidentally used copies of Clyde McPhatter's 1960s solo rerecordings of \"Money Honey\" and \"Such a Night\" in the Mixcloud. The versions I excerpt in the podcast are the originals.\n\nSome of the material here comes from <a href=\"https://amzn.to/2Kjoi53\"><em>Unsung Heroes of Rock 'n' Roll</em> by Nick Tosches</a>. It's not a book that I like to recommend, as I've said before. Other material comes from&nbsp; <a href=\"https://amzn.to/2B30b6c\"><em>Honkers & Shouters: The Golden Years of Rhythm and Blues</em> by Arnold Shaw</a>, one of the most important books on early 50s rhythm and blues, and <a href=\"https://amzn.to/2RVFgxa\"><em>The Sound of the City</em></a> by Charlie Gillett. But given the absence of any books on the Drifters or McPhatter, the resource I've leaned on most for this is <a href=\"http://www.uncamarvy.com/\">Marv Goldberg's website</a>.\n\nThere are many compilations of McPhatter and the Drifters. <a href=\"https://amzn.to/2DE8EPM\">This one</a> is a decent one.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nThere's a thought experiment, popular with the kind of people for whom philosophical thought experiments are popular, called the Ship of Theseus. It asks if you have a ship, and you replace every plank of wood in it as each plank rots away, so eventually you have a ship which doesn't share a single plank with the original -- is that still the same ship that you had at the start, or is it a totally new ship?\n\nA little while ago, I saw a Tweet from a venue I follow on Twitter, advertising The Drifters, singing \"all their great hits\".\n\nThere's only one problem with this, which is that no-one currently in the Drifters has ever had a hit, and none of them have even ever been in a band with anyone who had a hit as a member of the Drifters. Indeed, I believe that none of them have even been in a band with someone who has been in a band with someone who was in a version of the Drifters that had a hit.\n\nThis kind of thing is actually quite common these days, as old band members die off -- I've seen a version of The Fourmost which had no members of the Fourmost, a version of the Searchers with none of the original members (though it did have the bass player who joined in 1964 -- and it would have had an original member had he not been sick that day), The New Amen Corner (with no members of the old Amen Corner), all on package tours with other, more \"authentic\", bands.\n\nAnd of course we talked back in the episode on the Ink Spots about the way that some old bands lose control of their name and end up being replaced on stage by random people who have no connection with the original act. It's sad, but we expect that kind of thing with bands of a certain age. A band like the Drifters, who started nearly seventy years ago now, should be expected to have had some personnel changes.\n\nBut what's odd about the Drifters is that this kind of thing has been the case right from the beginning of their career. The Drifters formed in May 1953. By July 1955, the band that was touring as the Drifters had no original members left. And by June 1958, the band touring as the Drifters had no members of the July 1955 version. An old version of the band's website, before someone realised that it might be counterproductive to show how little connection there was between the people on stage and the people on their famous records, lists fifty-two different lineups between 1953 and 2004. In the future, everyone will have been lead singer of the Drifters for fifteen minutes.\n\nWe're going to look at the Drifters quite a bit over the course of this series -- they had hits in the fifties, sixties, and seventies, and some of them were among the most important records of their time. And so the thing to remember when we do that is that whenever we're talking about the Drifters, we're not talking about the same band as we had been the time before.\n\nIndeed, the Rock and Roll Hall of Fame (for what this is worth -- I value their opinion fairly low, but in this case it's an interesting indicator – actually inducted the Drifters as *two separate groups*. They're in as \"The Drifters\" and as \"Ben E King and the Drifters\", because the Hall of Fame didn't consider them as being the same group.\n\nToday, we're mostly going to talk about the second lineup of the Drifters, the one that was together from July through October 1953, and which had only one member in common with the May 1953 lineup of the band.\n\nThat member was Clyde McPhatter, and he was already something of a star before the Drifters formed, as the lead singer of Billy Ward and his Dominoes.\n\n[excerpt \"Do Something For Me\" -- Billy Ward and his Dominoes]\n\nBilly Ward was an exceptional man in many ways -- he was one of the first black people to graduate from the Juilliard School of Music, and he was a hugely talented pianist and arranger. And while he wasn't a particularly strong singer, he *was* a great vocal coach, and so when he noticed that vocal groups were becoming the new big thing in rhythm and blues, he hit upon a surefire way to make money. He'd form a group, featuring his best students, and pay them a salary. He and his agent would own the band name, and they could hire and fire people as they wished. And the students would all work for cheap, because... well, that's what young people do.\n\nIndeed, it would go further than them working for low pay. If you were a member of Billy Ward and his Dominoes, and you messed up, you got fined -- and of course the money went straight into Ward's pocket.\n\nThe Dominoes started out as an integrated group -- their name was because they were black and white, like the spots on a domino. But soon Ward had fired all of the white members, and put together a group that was entirely made up of black people.\n\nThe music they were performing was in the style that would later become known as doo-wop, but that wasn't a term that anyone used at the time. Back then, this new vocal group sound was just one of the many things that were lumped together under the rhythm and blues label. And as this was still the early stages of the music's development, it was a little different from the music that would later characterise the genre.\n\nDoo-Wop started as a style that was strongly influenced by the Ink Spots -- and by acts before them like the Mills Brothers. It was music made by impromptu groups on street corners, sung by people who had no instruments to accompany them, and so it relied on the techniques that had been used by the coffee-pot groups of the twenties and thirties -- imitating musical instruments with one's mouth.\n\nThese days, thanks largely to its late-fifties and early-sixties iteration in which it was sung by Italian-American men in sharp suits, there's a slight aura of sophistication and class around doo-wop music. It's associated in a very general sort of way with the kind of music that the Rat Pack and their ilk made, though in reality there's little connection other than the ethnicity of some of its more famous performers.\n\nBut doo-wop in its early years was the music of the most underprivileged groups -- it was music made by people who couldn't afford any other kind of entertainment, who couldn't afford instruments, who had nothing else they could do. It was the music of the streets, in a very literal way -- people, usually black people but also Latino and Italian-Americans, would stand on street corners and sing.\n\nDoo-wop would later become a very formalised genre, and thus of less interest, but early on some of the music in the genre was genuinely innovative. Precisely because it was made by untutored teenagers, it was often astoundingly inventive in its harmonies and rhythms.\n\nAnd the particular innovation that the Dominoes introduced was bringing in far more gospel flavour than had previously been used in vocal group music. The earlier vocal groups, like the Ravens or the Orioles, had had very little in the way of gospel or blues influence -- they mostly followed the style set by the Ink Spots, of singing very clean, straight, melody lines with no ornamentation or melisma.\n\nThe Dominoes, on the other hand, were a far more gospel-tinged band, and that was mostly down to Clyde McPhatter.\n\nClyde McPhatter was the lead singer on most of the band's biggest records -- although he was billed as Clyde Ward, with the claim that he was Ward's brother, in order to stop him from becoming too much of a star in his own right, and possibly deserting the Dominoes.\n\nMcPhatter was actually a church singer first and foremost, and had expressed extreme reluctance to move into secular music, but eventually he agreed, and became the Dominoes' star performer.\n\nTheir biggest hit, though, didn't have McPhatter singing lead, and was very different from their other records. \"Sixty Minute Man\" was, for the time, absolutely filthy.\n\n[Excerpt of \"Sixty Minute Man\"]\n\nNow, that doesn't sound like anything particularly offensive to our ears, but in the early 1950s, that was absolutely incendiary stuff. And again, along with the fact that radio stations were more restrained in the early fifties than they are these days, there is cultural context that it's easy to miss. For example, the line \"they call me loving Dan\" -- Dan was often the name of the \"back door man\" in blues or R&B songs -- the man who'd be going out of the back door when the husband was coming in the front. (And \"back door man\" itself was a phrase that could be taken to have more meanings than the obvious...)\n\nThe song was popular enough in the R&B field that it inspired other artists to change their songs. Ruth Brown's big hit \"five-ten-fifteen hours\" was originally written to have her asking for \"five-ten-fifteen minutes of loving\" until someone pointed out that in the era of \"sixty minute man\" fifteen minutes of loving didn't seem very much.\n\n\"Sixty Minute Man\" was remarkable in another way -- it crossed over from the rhythm and blues charts to the pop charts, which was something that basically *never* happened in 1951. I've seen claims that it was the first rock and roll record to do so, and I suppose that depends on what you count as a rock and roll record -- Louis Jordan had had several crossover hits over the previous few years -- but if you're counting rock and roll musicians as only being people who started recording around 1948 or later, then it may well be. If it's not the first, it was certainly *one* of the first, and like all big hits at the time it inspired a wave of imitators. However, Bill Brown, the lead singer on the song, quit in 1952 to form his own band, the Checkers. He took with him Charlie White, who had sung lead on an early Dominoes track, this duet with Little Esther:\n\n[excerpt: Little Esther and the Dominoes \"The Deacon Moves In\"]\n\nWith both the other main singers having left the band more or less simultaneously, Clyde McPhatter was left as the default star of the show. There was no-one else who was even slightly challenging him for the role by this point, and the Dominoes' records became a showcase for his vocals.\n\nOnce McPhatter was the star, the band moved away from the more uptempo rock style to a more ballad-based style which suited McPhatter's voice better. But they still had a knack for controversial subject matter and novelties, as one of their biggest hits shows:\n\n[excerpt: \"The Bells\", Billy Ward and his Dominoes]\n\nThat kind of over-the-top display of emotion, taken well past the point of caricature, would soon become one of the hallmarks of the more interesting black vocalists of the period. You can hear in that song the seeds of Screamin' Jay Hawkins, for example -- and James Brown would often perform \"The Bells\" in his early shows, even pushing a pram containing a doll, representing the dead woman in the song, across the stage.\n\nBut what's also obvious from that record is that McPhatter was clearly a remarkable singer. He was the star of the show, and the reason that people came to see Billy Ward and the Dominoes -- and soon he decided that it was unfair that he was making $100 a week, minus costs, while Ward was becoming rich. He didn't want to be an interchangeable Domino any more, he was going to make his own career and become a star himself. He stayed in the band for long enough to train his replacement, a new young singer named Jackie Wilson who had been discovered by Johnny Otis, and then left.\n\n(At the same time a couple of other band members left. One of their replacements was Cliff Givens, who had previously been a temporary Ink Spot for five months between Hoppy Jones dying and Herb Kenny replacing him).\n\nThe Dominoes continued on for quite some time after McPhatter left them, but while they scored a few more hits, the way the band's career progressed can probably best be summed up by their sequel to \"Sixty Minute Man\" from 1955:\n\n[excerpt: Billy Ward and the Dominoes \"Can't Do Sixty No More\"]\n\nJackie Wilson, of course, was a fantastic singer and if you had to replace Clyde McPhatter with anyone he was as good a choice as you could make, but McPhatter was sorely missed in their shows.\n\nShortly after the lineup change -- indeed, some have claimed on the very first day after McPhatter left -- Ahmet Ertegun of Atlantic Records went to see the Dominoes live, and saw that McPhatter wasn't there. When he discovered that the lead singer of the biggest vocal group in the North-East was no longer with them, he left the venue immediately and went running from bar to bar looking for McPhatter. As soon as he found him, he signed him that night to Atlantic Records, and it was agreed that McPhatter would put together his own backing group -- which became the first lineup of the Drifters.\n\nThat first lineup was made up of people from McPhatter's church singing group -- one of whom, incidentally, was the brother of the author James Baldwin. That lineup -- Clyde McPhatter, David Baughan, William Anderson, David Baldwin, and James Johnson -- recorded four tracks together, but only one was ever released, \"Lucille\":\n\n[excerpt \"Lucille\", Clyde McPhatter and the Drifters]\n\nHearing that, it doesn't sound like there was anything wrong with the band, but clearly Atlantic disagreed -- I've heard it claimed by some of the later members of the group that Atlantic thought this first version of the Drifters had voices that were too light for backing McPhatter. Either way, there was a new lineup in place by a few weeks later, with only McPhatter of the original band, and that lineup would last a whole four months and get a hit record out.\n\nTheir first session included versions of five songs, including the other three that were recorded but never released by the initial lineup. But one of the two new songs was the one that would make the band stars.\n\nThat song, \"Money Honey\", was written by Jesse Stone, or Charles Calhoun to give him his pen-name. You'll remember we discussed him in episode two, talking about how he wrote \"Shake, Rattle, and Roll\", and in episode four, talking about how Louis Jordan ended up taking Stone's entire band and making them into the Tympany Five.\n\nStone was a fascinating man, who lived a long, long, life that spanned the twentieth century almost completely -- he was born in 1901 and died in 1999 -- and his entertainment career lasted almost as long. He'd started performing professionally in 1905, at the age of four, in a trained dog act -- he'd sing and the dogs would perform. Apparently the dogs were so well trained that they could perform the act without him, but that's the kind of thing that passed for entertainment in 1905 -- a singing four-year-old and some dogs.\n\nBy 1920 he was the best piano player in Kansas City - and that was the opinion of Count Basie, a man who knew a thing or two about piano playing -- and he was making a living as a professional arranger -- he later claimed that he'd written a large number of classical pieces but that no-one was interested in playing them, but he could make money off the music that became rock and roll. It's been claimed by some jazz historians that he was the first person ever to write out proper horn charts for a jazz band's horn section, rather than having them play head arrangements, and while I don't *think* the timeline works for that, I'm not enough of an expert in early jazz to be confident he wasn't.\n\nIf he was, then that makes him responsible for the birth of swing, and specifically for the kind of swing that later ended up becoming rhythm and blues -- the kind with an emphasis on rhythm and groove, with slickly arranged horn parts, which came out of Kansas.\n\nStone worked as an arranger in the thirties and forties with Chick Webb, Louis Jordan, and others, and also started dabbling in songwriting.\n\nIt was a discussion with Cole Porter that he later credited as the impetus for him becoming a serious songwriter. Porter had discovered that Stone was writing some songs, and he asked what tools Stone used. Stone didn't even understand the question. He later said \"I didn't know what he was talking about. I had never even heard of a rhyming dictionary..I didn't know what a homonym was. I didn't know the difference between assonance and alliteration. 'Tools?' I said. 'Hell', he said, 'if you're gonna dig a ditch you use a shovel, don't you?' I began to approach songwriting more professionally\".\n\nAnd the results paid off. His first big hit was \"Idaho\", recorded by among others Guy Lombardo and Benny Goodman:\n\n[excerpt: Benny Goodman \"Idaho\"]\n\nBut unlike most of the successful songwriters of the 1940s, he managed to continue his career into the rock and roll era. Stone wrote a huge number of early rock and roll classics, such as \"Shake Rattle and Roll\", \"Flip, Flop and Fly\", \"Smack Dab in the Middle\", \"Razzle Dazzle\" and \"Your Cash Ain't Nothin' But Trash\", many of them recorded by Atlantic Records artists such as Ray Charles and Big Joe Turner.\n\nThis was because Stone was one of the founders of Atlantic. He'd worked with Herb Abramson before the formation of Atlantic Records, and moved with Abramson to Atlantic when the label started, and he was the only black person on the label's payroll at first.\n\nStone was credited by Ahmet Ertegun as having been the arranger who had most to do with the early rock and roll sound, and it certainly seems likely that it was Jesse Stone, more than all the other staff producers and writers at Atlantic, who pushed Atlantic Records in a rock and roll direction. According to Stone himself, he took a trip down to the Southern states to see why Atlantic's records weren't selling there as well as they were in the coastal states, and he realised that the bands playing in bars were playing with far more emphasis on rhythm than the bands Atlantic had.\n\nAt first, he wasn't impressed with this music -- as he put it later \"I considered it backward, musically, and I didn't like it until I started to learn that the rhythm content was the important thing. Then I started to like it and began writing tunes.\"\n\nHe adapted the rhythms that those bands were playing, especially the bassline -- he later said \"I designed a bass pattern, and it sort of became identified with rock'n'roll - doo, da-DOO, DUM; doo, da-DOO, DUM - that thing. I'm the guilty person that started that.\" But, other than \"Shake Rattle and Roll\", the most well-known song Stone wrote -- under his Calhoun pseudonym -- was \"Money Honey\"\n\n[excerpt \"Money Honey\", the Drifters]\n\nThat song and arrangement owes a lot to the work that Leiber and Stoller had been doing with the Robins, and like those records the song is very, very funny. And this is something I've not emphasised enough when I've been talking about rhythm and blues records in this series so far -- the sense of humour that so many of them had. From Louis Jordan on, the R&B genre wasn't just about rhythm, though it was of course about that, but it was often uproariously funny. And it was funny in a very particular way -- it was funny about the experience of black people living in poverty in cities. Almost all the R&B acts we've discussed so far -- especially the ones around Johnny Otis -- had a very earthy sense of humour, which was expressed in all their recordings. Songs would be about infidelity, being out of work, being drunk, or, as in this case, being desperate for money to pay the landlord and having your girlfriend leave you for someone who had more money.\n\nThis is something that was largely lost in the transition from R&B to rock and roll, as the music became more escapist and more focused on the frustrations and longings of horny adolescents, but even where rhythm and blues records were about dancing and escapism, they were from a notably more adult and witty perspective than those that followed only a few years later.\n\nWhile Calhoun was the most important figure in the musical side of Atlantic Records, however, he quit by 1956. Atlantic's bosses wouldn't agree to make their first black employee and co-founder of the company an equal partner. In July 1953, though, he was working with the Drifters.\n\nThe lineup on \"Money Honey\" was a six-piece group -- McPhatter, backing singers Bill Pinkney, Andrew and Gerhardt Thrasher, and Willie Ferbee, and guitarist Walter Adams -- who was the third guitarist the group had had. They signed to a management contract with George Treadwell, who was at the time also the manager of another Atlantic Records star, Ruth Brown. They also signed to Moe Gale's booking agency, but by the time of their first show, on October 9 1953, at the Apollo Theatre supporting Lucky Millinder, there'd already been another lineup change -- Ferbee had been in an accident and could no longer perform, and the group decided to carry on with just four voices. And by the end of October, tragedy had struck again, as Walter Adams died of a heart attack. So by the time \"Money Honey\" started to get noticed and went to number one on the R&B charts, the band was already very different from the one that had recorded the song.\n\nThis new lineup still had McPhatter, though, and quickly followed up their first hit with another, \"Such A Night\", which wasn't as funny as \"Money Honey\", but was raunchy and controversial enough that it got banned from the radio, which made people rush to buy it -- that one went to number two on the R&B charts:\n\n[excerpt: \"Such A Night\"]\n\nThings were going well for the Drifters... but then McPhatter got drafted. He could still record with the band -- he was stationed in the US -- and the band continued to tour without him. They got David Baughan from the original lineup to rejoin -- he could sound enough like McPhatter that he could sing his parts on stage -- and when McPhatter's armed services commitments meant that he couldn't make a recording session, they'd record duets with other famous acts, like this one with Ruth Brown:\n\n[Excerpt: Ruth Brown: \"Oh What A Dream\"]\n\nBut eventually the band's management and Atlantic Records decided that they didn't need McPhatter to be the lead singer, and it might be more profitable to have the band not be reliant on any particular star -- and McPhatter, for his part, was quite keen to start a solo career on his discharge. The Drifters and Clyde McPhatter were going to part.\n\nWhile McPhatter had formed his own group because he didn't want to be an employee and wanted to have the rights over his own work, he had decided to set things up so that he owned fifty percent of the band's name, while George Treadwell owned the other fifty percent. When he left the group, he decided to sell his fifty percent stake in the band's name to Treadwell -- which of course meant that the other Drifters were now in precisely the same position as McPhatter had been with the Dominoes, except that there at least the name's owner had been a band member. Bill Pinkney did later manage to get ownership of the name \"the Original Drifters\" and many of the fifties members would tour with him under that name in the sixties, but the band name \"the Drifters\" now belonged not to any of the performers, but to their management.\n\nThe Drifters went through many, many, lineup changes, and we'll be picking up their story later, but sadly we won't be picking up McPhatter's.\n\nMcPhatter's solo career started well, with a duet with Ruth Brown:\n\n[excerpt \"Love Has Joined Us Together\": Clyde McPhatter and Ruth Brown]\n\nSomething certainly had joined them together, as Ruth Brown later revealed that McPhatter was the father of her son, Ronald, who now tours as \"Clyde McPhatter's Drifters\". And for a while, McPhatter looked like he would continue being a major star -- he had a string of hits between 1955 and 1958, but then the hits started to dry up. He changed labels a few times and would have the occasional one-off hit, but had far more flops than successes. By the early 70s, he was an alcoholic, and Marv Goldberg (whose website I have used as a major resource for this episode) describes him telling someone introduced to him as a fan \"I have no fans\", and seeing a show with a drunk McPhatter sitting on the edge of the stage and saying \"I'm not used to coming on third; I used to be a star.\"\n\nHe died in 1972, aged thirty-nine, completely unaware of how important his music had been to millions. I said near the start of this episode that I don't consider the rock and roll hall of fame important, and that's true, but McPhatter was the first person to be inducted into the hall of fame twice -- once as a Drifter and once as a solo artist. Anyone since him who's been inducted multiple times -- people like John Lennon, Eric Clapton, Neil Young, and Michael Jackson -- are referred to as members of \"the Clyde McPhatter club\".",
  "itunes:subtitle": "Welcome to episode seventeen of A History of Rock Music in Five Hundred Songs. Today were looking at Money Honey by the Drifters. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nErratum\n\nAt one poin",
  "itunes:keywords": "Ahmet Ertegun,Atlantic Records,Billy Ward and his Dominoes,Clyde McPhatter,doo wop,Ink Spots,Jackie Wilson,Jesse Stone,Ruth Brown,The Drifters,vocal groups",
  "itunes:episodeType": "full",
  "itunes:episode": 17,
  "content:encoded": "Welcome to episode seventeen of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Money Honey\" by the Drifters. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Erratum</strong>\n\nAt one point in the podcast I say \"Calhoun was the most important figure in the musical side of Atlantic Records\". Obviously I meant \"Stone was...\" -- Charles Calhoun was only a pen name, and I refer to Jesse Stone as Jesse Stone everywhere else in the episode.\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplema/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode. In this case, two tracks are slightly different from the versions I used in the podcast -- I accidentally used copies of Clyde McPhatter's 1960s solo rerecordings of \"Money Honey\" and \"Such a Night\" in the Mixcloud. The versions I excerpt in the podcast are the originals.\n\nSome of the material here comes from <a href=\"https://amzn.to/2Kjoi53\"><em>Unsung Heroes of Rock 'n' Roll</em> by Nick Tosches</a>. It's not a book that I like to recommend, as I've said before. Other material comes from&nbsp; <a href=\"https://amzn.to/2B30b6c\"><em>Honkers & Shouters: The Golden Years of Rhythm and Blues</em> by Arnold Shaw</a>, one of the most important books on early 50s rhythm and blues, and <a href=\"https://amzn.to/2RVFgxa\"><em>The Sound of the City</em></a> by Charlie Gillett. But given the absence of any books on the Drifters or McPhatter, the resource I've leaned on most for this is <a href=\"http://www.uncamarvy.com/\">Marv Goldberg's website</a>.\n\nThere are many compilations of McPhatter and the Drifters. <a href=\"https://amzn.to/2DE8EPM\">This one</a> is a decent one.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nThere's a thought experiment, popular with the kind of people for whom philosophical thought experiments are popular, called the Ship of Theseus. It asks if you have a ship, and you replace every plank of wood in it as each plank rots away, so eventually you have a ship which doesn't share a single plank with the original -- is that still the same ship that you had at the start, or is it a totally new ship?\n\nA little while ago, I saw a Tweet from a venue I follow on Twitter, advertising The Drifters, singing \"all their great hits\".\n\nThere's only one problem with this, which is that no-one currently in the Drifters has ever had a hit, and none of them have even ever been in a band with anyone who had a hit as a member of the Drifters. Indeed, I believe that none of them have even been in a band with someone who has been in a band with someone who was in a version of the Drifters that had a hit.\n\nThis kind of thing is actually quite common these days, as old band members die off -- I've seen a version of The Fourmost which had no members of the Fourmost, a version of the Searchers with none of the original members (though it did have the bass player who joined in 1964 -- and it would have had an original member had he not been sick that day), The New Amen Corner (with no members of the old Amen Corner), all on package tours with other, more \"authentic\", bands.\n\nAnd of course we talked back in the episode on the Ink Spots about the way that some old bands lose control of their name and end up being replaced on stage by random people who have no connection with the original act. It's sad, but we expect that kind of thing with bands of a certain age. A band like the Drifters, who started nearly seventy years ago now, should be expected to have had some personnel changes.\n\nBut what's odd about the Drifters is that this kind of thing has been the case right from the beginning of their career. The Drifters formed in May 1953. By July 1955, the band that was touring as the Drifters had no original members left. And by June 1958, the band touring as the Drifters had no members of the July 1955 version. An old version of the band's website, before someone realised that it might be counterproductive to show how little connection there was between the people on stage and the people on their famous records, lists fifty-two different lineups between 1953 and 2004. In the future, everyone will have been lead singer of the Drifters for fifteen minutes.\n\nWe're going to look at the Drifters quite a bit over the course of this series -- they had hits in the fifties, sixties, and seventies, and some of them were among the most important records of their time. And so the thing to remember when we do that is that whenever we're talking about the Drifters, we're not talking about the same band as we had been the time before.\n\nIndeed, the Rock and Roll Hall of Fame (for what this is worth -- I value their opinion fairly low, but in this case it's an interesting indicator – actually inducted the Drifters as *two separate groups*. They're in as \"The Drifters\" and as \"Ben E King and the Drifters\", because the Hall of Fame didn't consider them as being the same group.\n\nToday, we're mostly going to talk about the second lineup of the Drifters, the one that was together from July through October 1953, and which had only one member in common with the May 1953 lineup of the band.\n\nThat member was Clyde McPhatter, and he was already something of a star before the Drifters formed, as the lead singer of Billy Ward and his Dominoes.\n\n[excerpt \"Do Something For Me\" -- Billy Ward and his Dominoes]\n\nBilly Ward was an exceptional man in many ways -- he was one of the first black people to graduate from the Juilliard School of Music, and he was a hugely talented pianist and arranger. And while he wasn't a particularly strong singer, he *was* a great vocal coach, and so when he noticed that vocal groups were becoming the new big thing in rhythm and blues, he hit upon a surefire way to make money. He'd form a group, featuring his best students, and pay them a salary. He and his agent would own the band name, and they could hire and fire people as they wished. And the students would all work for cheap, because... well, that's what young people do.\n\nIndeed, it would go further than them working for low pay. If you were a member of Billy Ward and his Dominoes, and you messed up, you got fined -- and of course the money went straight into Ward's pocket.\n\nThe Dominoes started out as an integrated group -- their name was because they were black and white, like the spots on a domino. But soon Ward had fired all of the white members, and put together a group that was entirely made up of black people.\n\nThe music they were performing was in the style that would later become known as doo-wop, but that wasn't a term that anyone used at the time. Back then, this new vocal group sound was just one of the many things that were lumped together under the rhythm and blues label. And as this was still the early stages of the music's development, it was a little different from the music that would later characterise the genre.\n\nDoo-Wop started as a style that was strongly influenced by the Ink Spots -- and by acts before them like the Mills Brothers. It was music made by impromptu groups on street corners, sung by people who had no instruments to accompany them, and so it relied on the techniques that had been used by the coffee-pot groups of the twenties and thirties -- imitating musical instruments with one's mouth.\n\nThese days, thanks largely to its late-fifties and early-sixties iteration in which it was sung by Italian-American men in sharp suits, there's a slight aura of sophistication and class around doo-wop music. It's associated in a very general sort of way with the kind of music that the Rat Pack and their ilk made, though in reality there's little connection other than the ethnicity of some of its more famous performers.\n\nBut doo-wop in its early years was the music of the most underprivileged groups -- it was music made by people who couldn't afford any other kind of entertainment, who couldn't afford instruments, who had nothing else they could do. It was the music of the streets, in a very literal way -- people, usually black people but also Latino and Italian-Americans, would stand on street corners and sing.\n\nDoo-wop would later become a very formalised genre, and thus of less interest, but early on some of the music in the genre was genuinely innovative. Precisely because it was made by untutored teenagers, it was often astoundingly inventive in its harmonies and rhythms.\n\nAnd the particular innovation that the Dominoes introduced was bringing in far more gospel flavour than had previously been used in vocal group music. The earlier vocal groups, like the Ravens or the Orioles, had had very little in the way of gospel or blues influence -- they mostly followed the style set by the Ink Spots, of singing very clean, straight, melody lines with no ornamentation or melisma.\n\nThe Dominoes, on the other hand, were a far more gospel-tinged band, and that was mostly down to Clyde McPhatter.\n\nClyde McPhatter was the lead singer on most of the band's biggest records -- although he was billed as Clyde Ward, with the claim that he was Ward's brother, in order to stop him from becoming too much of a star in his own right, and possibly deserting the Dominoes.\n\nMcPhatter was actually a church singer first and foremost, and had expressed extreme reluctance to move into secular music, but eventually he agreed, and became the Dominoes' star performer.\n\nTheir biggest hit, though, didn't have McPhatter singing lead, and was very different from their other records. \"Sixty Minute Man\" was, for the time, absolutely filthy.\n\n[Excerpt of \"Sixty Minute Man\"]\n\nNow, that doesn't sound like anything particularly offensive to our ears, but in the early 1950s, that was absolutely incendiary stuff. And again, along with the fact that radio stations were more restrained in the early fifties than they are these days, there is cultural context that it's easy to miss. For example, the line \"they call me loving Dan\" -- Dan was often the name of the \"back door man\" in blues or R&B songs -- the man who'd be going out of the back door when the husband was coming in the front. (And \"back door man\" itself was a phrase that could be taken to have more meanings than the obvious...)\n\nThe song was popular enough in the R&B field that it inspired other artists to change their songs. Ruth Brown's big hit \"five-ten-fifteen hours\" was originally written to have her asking for \"five-ten-fifteen minutes of loving\" until someone pointed out that in the era of \"sixty minute man\" fifteen minutes of loving didn't seem very much.\n\n\"Sixty Minute Man\" was remarkable in another way -- it crossed over from the rhythm and blues charts to the pop charts, which was something that basically *never* happened in 1951. I've seen claims that it was the first rock and roll record to do so, and I suppose that depends on what you count as a rock and roll record -- Louis Jordan had had several crossover hits over the previous few years -- but if you're counting rock and roll musicians as only being people who started recording around 1948 or later, then it may well be. If it's not the first, it was certainly *one* of the first, and like all big hits at the time it inspired a wave of imitators. However, Bill Brown, the lead singer on the song, quit in 1952 to form his own band, the Checkers. He took with him Charlie White, who had sung lead on an early Dominoes track, this duet with Little Esther:\n\n[excerpt: Little Esther and the Dominoes \"The Deacon Moves In\"]\n\nWith both the other main singers having left the band more or less simultaneously, Clyde McPhatter was left as the default star of the show. There was no-one else who was even slightly challenging him for the role by this point, and the Dominoes' records became a showcase for his vocals.\n\nOnce McPhatter was the star, the band moved away from the more uptempo rock style to a more ballad-based style which suited McPhatter's voice better. But they still had a knack for controversial subject matter and novelties, as one of their biggest hits shows:\n\n[excerpt: \"The Bells\", Billy Ward and his Dominoes]\n\nThat kind of over-the-top display of emotion, taken well past the point of caricature, would soon become one of the hallmarks of the more interesting black vocalists of the period. You can hear in that song the seeds of Screamin' Jay Hawkins, for example -- and James Brown would often perform \"The Bells\" in his early shows, even pushing a pram containing a doll, representing the dead woman in the song, across the stage.\n\nBut what's also obvious from that record is that McPhatter was clearly a remarkable singer. He was the star of the show, and the reason that people came to see Billy Ward and the Dominoes -- and soon he decided that it was unfair that he was making $100 a week, minus costs, while Ward was becoming rich. He didn't want to be an interchangeable Domino any more, he was going to make his own career and become a star himself. He stayed in the band for long enough to train his replacement, a new young singer named Jackie Wilson who had been discovered by Johnny Otis, and then left.\n\n(At the same time a couple of other band members left. One of their replacements was Cliff Givens, who had previously been a temporary Ink Spot for five months between Hoppy Jones dying and Herb Kenny replacing him).\n\nThe Dominoes continued on for quite some time after McPhatter left them, but while they scored a few more hits, the way the band's career progressed can probably best be summed up by their sequel to \"Sixty Minute Man\" from 1955:\n\n[excerpt: Billy Ward and the Dominoes \"Can't Do Sixty No More\"]\n\nJackie Wilson, of course, was a fantastic singer and if you had to replace Clyde McPhatter with anyone he was as good a choice as you could make, but McPhatter was sorely missed in their shows.\n\nShortly after the lineup change -- indeed, some have claimed on the very first day after McPhatter left -- Ahmet Ertegun of Atlantic Records went to see the Dominoes live, and saw that McPhatter wasn't there. When he discovered that the lead singer of the biggest vocal group in the North-East was no longer with them, he left the venue immediately and went running from bar to bar looking for McPhatter. As soon as he found him, he signed him that night to Atlantic Records, and it was agreed that McPhatter would put together his own backing group -- which became the first lineup of the Drifters.\n\nThat first lineup was made up of people from McPhatter's church singing group -- one of whom, incidentally, was the brother of the author James Baldwin. That lineup -- Clyde McPhatter, David Baughan, William Anderson, David Baldwin, and James Johnson -- recorded four tracks together, but only one was ever released, \"Lucille\":\n\n[excerpt \"Lucille\", Clyde McPhatter and the Drifters]\n\nHearing that, it doesn't sound like there was anything wrong with the band, but clearly Atlantic disagreed -- I've heard it claimed by some of the later members of the group that Atlantic thought this first version of the Drifters had voices that were too light for backing McPhatter. Either way, there was a new lineup in place by a few weeks later, with only McPhatter of the original band, and that lineup would last a whole four months and get a hit record out.\n\nTheir first session included versions of five songs, including the other three that were recorded but never released by the initial lineup. But one of the two new songs was the one that would make the band stars.\n\nThat song, \"Money Honey\", was written by Jesse Stone, or Charles Calhoun to give him his pen-name. You'll remember we discussed him in episode two, talking about how he wrote \"Shake, Rattle, and Roll\", and in episode four, talking about how Louis Jordan ended up taking Stone's entire band and making them into the Tympany Five.\n\nStone was a fascinating man, who lived a long, long, life that spanned the twentieth century almost completely -- he was born in 1901 and died in 1999 -- and his entertainment career lasted almost as long. He'd started performing professionally in 1905, at the age of four, in a trained dog act -- he'd sing and the dogs would perform. Apparently the dogs were so well trained that they could perform the act without him, but that's the kind of thing that passed for entertainment in 1905 -- a singing four-year-old and some dogs.\n\nBy 1920 he was the best piano player in Kansas City - and that was the opinion of Count Basie, a man who knew a thing or two about piano playing -- and he was making a living as a professional arranger -- he later claimed that he'd written a large number of classical pieces but that no-one was interested in playing them, but he could make money off the music that became rock and roll. It's been claimed by some jazz historians that he was the first person ever to write out proper horn charts for a jazz band's horn section, rather than having them play head arrangements, and while I don't *think* the timeline works for that, I'm not enough of an expert in early jazz to be confident he wasn't.\n\nIf he was, then that makes him responsible for the birth of swing, and specifically for the kind of swing that later ended up becoming rhythm and blues -- the kind with an emphasis on rhythm and groove, with slickly arranged horn parts, which came out of Kansas.\n\nStone worked as an arranger in the thirties and forties with Chick Webb, Louis Jordan, and others, and also started dabbling in songwriting.\n\nIt was a discussion with Cole Porter that he later credited as the impetus for him becoming a serious songwriter. Porter had discovered that Stone was writing some songs, and he asked what tools Stone used. Stone didn't even understand the question. He later said \"I didn't know what he was talking about. I had never even heard of a rhyming dictionary..I didn't know what a homonym was. I didn't know the difference between assonance and alliteration. 'Tools?' I said. 'Hell', he said, 'if you're gonna dig a ditch you use a shovel, don't you?' I began to approach songwriting more professionally\".\n\nAnd the results paid off. His first big hit was \"Idaho\", recorded by among others Guy Lombardo and Benny Goodman:\n\n[excerpt: Benny Goodman \"Idaho\"]\n\nBut unlike most of the successful songwriters of the 1940s, he managed to continue his career into the rock and roll era. Stone wrote a huge number of early rock and roll classics, such as \"Shake Rattle and Roll\", \"Flip, Flop and Fly\", \"Smack Dab in the Middle\", \"Razzle Dazzle\" and \"Your Cash Ain't Nothin' But Trash\", many of them recorded by Atlantic Records artists such as Ray Charles and Big Joe Turner.\n\nThis was because Stone was one of the founders of Atlantic. He'd worked with Herb Abramson before the formation of Atlantic Records, and moved with Abramson to Atlantic when the label started, and he was the only black person on the label's payroll at first.\n\nStone was credited by Ahmet Ertegun as having been the arranger who had most to do with the early rock and roll sound, and it certainly seems likely that it was Jesse Stone, more than all the other staff producers and writers at Atlantic, who pushed Atlantic Records in a rock and roll direction. According to Stone himself, he took a trip down to the Southern states to see why Atlantic's records weren't selling there as well as they were in the coastal states, and he realised that the bands playing in bars were playing with far more emphasis on rhythm than the bands Atlantic had.\n\nAt first, he wasn't impressed with this music -- as he put it later \"I considered it backward, musically, and I didn't like it until I started to learn that the rhythm content was the important thing. Then I started to like it and began writing tunes.\"\n\nHe adapted the rhythms that those bands were playing, especially the bassline -- he later said \"I designed a bass pattern, and it sort of became identified with rock'n'roll - doo, da-DOO, DUM; doo, da-DOO, DUM - that thing. I'm the guilty person that started that.\" But, other than \"Shake Rattle and Roll\", the most well-known song Stone wrote -- under his Calhoun pseudonym -- was \"Money Honey\"\n\n[excerpt \"Money Honey\", the Drifters]\n\nThat song and arrangement owes a lot to the work that Leiber and Stoller had been doing with the Robins, and like those records the song is very, very funny. And this is something I've not emphasised enough when I've been talking about rhythm and blues records in this series so far -- the sense of humour that so many of them had. From Louis Jordan on, the R&B genre wasn't just about rhythm, though it was of course about that, but it was often uproariously funny. And it was funny in a very particular way -- it was funny about the experience of black people living in poverty in cities. Almost all the R&B acts we've discussed so far -- especially the ones around Johnny Otis -- had a very earthy sense of humour, which was expressed in all their recordings. Songs would be about infidelity, being out of work, being drunk, or, as in this case, being desperate for money to pay the landlord and having your girlfriend leave you for someone who had more money.\n\nThis is something that was largely lost in the transition from R&B to rock and roll, as the music became more escapist and more focused on the frustrations and longings of horny adolescents, but even where rhythm and blues records were about dancing and escapism, they were from a notably more adult and witty perspective than those that followed only a few years later.\n\nWhile Calhoun was the most important figure in the musical side of Atlantic Records, however, he quit by 1956. Atlantic's bosses wouldn't agree to make their first black employee and co-founder of the company an equal partner. In July 1953, though, he was working with the Drifters.\n\nThe lineup on \"Money Honey\" was a six-piece group -- McPhatter, backing singers Bill Pinkney, Andrew and Gerhardt Thrasher, and Willie Ferbee, and guitarist Walter Adams -- who was the third guitarist the group had had. They signed to a management contract with George Treadwell, who was at the time also the manager of another Atlantic Records star, Ruth Brown. They also signed to Moe Gale's booking agency, but by the time of their first show, on October 9 1953, at the Apollo Theatre supporting Lucky Millinder, there'd already been another lineup change -- Ferbee had been in an accident and could no longer perform, and the group decided to carry on with just four voices. And by the end of October, tragedy had struck again, as Walter Adams died of a heart attack. So by the time \"Money Honey\" started to get noticed and went to number one on the R&B charts, the band was already very different from the one that had recorded the song.\n\nThis new lineup still had McPhatter, though, and quickly followed up their first hit with another, \"Such A Night\", which wasn't as funny as \"Money Honey\", but was raunchy and controversial enough that it got banned from the radio, which made people rush to buy it -- that one went to number two on the R&B charts:\n\n[excerpt: \"Such A Night\"]\n\nThings were going well for the Drifters... but then McPhatter got drafted. He could still record with the band -- he was stationed in the US -- and the band continued to tour without him. They got David Baughan from the original lineup to rejoin -- he could sound enough like McPhatter that he could sing his parts on stage -- and when McPhatter's armed services commitments meant that he couldn't make a recording session, they'd record duets with other famous acts, like this one with Ruth Brown:\n\n[Excerpt: Ruth Brown: \"Oh What A Dream\"]\n\nBut eventually the band's management and Atlantic Records decided that they didn't need McPhatter to be the lead singer, and it might be more profitable to have the band not be reliant on any particular star -- and McPhatter, for his part, was quite keen to start a solo career on his discharge. The Drifters and Clyde McPhatter were going to part.\n\nWhile McPhatter had formed his own group because he didn't want to be an employee and wanted to have the rights over his own work, he had decided to set things up so that he owned fifty percent of the band's name, while George Treadwell owned the other fifty percent. When he left the group, he decided to sell his fifty percent stake in the band's name to Treadwell -- which of course meant that the other Drifters were now in precisely the same position as McPhatter had been with the Dominoes, except that there at least the name's owner had been a band member. Bill Pinkney did later manage to get ownership of the name \"the Original Drifters\" and many of the fifties members would tour with him under that name in the sixties, but the band name \"the Drifters\" now belonged not to any of the performers, but to their management.\n\nThe Drifters went through many, many, lineup changes, and we'll be picking up their story later, but sadly we won't be picking up McPhatter's.\n\nMcPhatter's solo career started well, with a duet with Ruth Brown:\n\n[excerpt \"Love Has Joined Us Together\": Clyde McPhatter and Ruth Brown]\n\nSomething certainly had joined them together, as Ruth Brown later revealed that McPhatter was the father of her son, Ronald, who now tours as \"Clyde McPhatter's Drifters\". And for a while, McPhatter looked like he would continue being a major star -- he had a string of hits between 1955 and 1958, but then the hits started to dry up. He changed labels a few times and would have the occasional one-off hit, but had far more flops than successes. By the early 70s, he was an alcoholic, and Marv Goldberg (whose website I have used as a major resource for this episode) describes him telling someone introduced to him as a fan \"I have no fans\", and seeing a show with a drunk McPhatter sitting on the edge of the stage and saying \"I'm not used to coming on third; I used to be a star.\"\n\nHe died in 1972, aged thirty-nine, completely unaware of how important his music had been to millions. I said near the start of this episode that I don't consider the rock and roll hall of fame important, and that's true, but McPhatter was the first person to be inducted into the hall of fame twice -- once as a Drifter and once as a solo artist. Anyone since him who's been inducted multiple times -- people like John Lennon, Eric Clapton, Neil Young, and Michael Jackson -- are referred to as members of \"the Clyde McPhatter club\".",
  "enclosure": "",
  "itunes:summary": "Welcome to episode seventeen of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Money Honey\" by the Drifters. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nErratum\n\nAt one point in the podcast I say \"Calhoun was the most important figure in the musical side of Atlantic Records\". Obviously I meant \"Stone was...\" -- Charles Calhoun was only a pen name, and I refer to Jesse Stone as Jesse Stone everywhere else in the episode.\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. In this case, two tracks are slightly different from the versions I used in the podcast -- I accidentally used copies of Clyde McPhatter's 1960s solo rerecordings of \"Money Honey\" and \"Such a Night\" in the Mixcloud. The versions I excerpt in the podcast are the originals.\n\nSome of the material here comes from Unsung Heroes of Rock 'n' Roll by Nick Tosches. It's not a book that I like to recommend, as I've said before. Other material comes from&nbsp; Honkers & Shouters: The Golden Years of Rhythm and Blues by Arnold Shaw, one of the most important books on early 50s rhythm and blues, and The Sound of the City by Charlie Gillett. But given the absence of any books on the Drifters or McPhatter, the resource I've leaned on most for this is Marv Goldberg's website.\n\nThere are many compilations of McPhatter and the Drifters. This one is a decent one.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nThere's a thought experiment, popular with the kind of people for whom philosophical thought experiments are popular, called the Ship of Theseus. It asks if you have a ship, and you replace every plank of wood in it as each plank rots away, so eventually you have a ship which doesn't share a single plank with the original -- is that still the same ship that you had at the start, or is it a totally new ship?\n\nA little while ago, I saw a Tweet from a venue I follow on Twitter, advertising The Drifters, singing \"all their great hits\".\n\nThere's only one problem with this, which is that no-one currently in the Drifters has ever had a hit, and none of them have even ever been in a band with anyone who had a hit as a member of the Drifters. Indeed, I believe that none of them have even been in a band with someone who has been in a band with someone who was in a version of the Drifters that had a hit.\n\nThis kind of thing is actually quite common these days, as old band members die off -- I've seen a version of The Fourmost which had no members of the Fourmost, a version of the Searchers with none of the original members (though it did have the bass player who joined in 1964 -- and it would have had an original member had he not been sick that day), The New Amen Corner (with no members of the old Amen Corner), all on package tours with other, more \"authentic\", bands.\n\nAnd of course we talked back in the episode on the Ink Spots about the way that some old bands lose control of their name and end up being replaced on stage by random people who have no connection with the original act. It's sad, but we expect that kind of thing with bands of a certain age. A band like the Drifters, who started nearly seventy years ago now, should be expected to have had some personnel changes.\n\nBut what's odd about the Drifters is that this kind of thing has been the case right from the beginning of their career. The Drifters formed in May 1953. By July 1955, the band that was touring as the Drifters had no original members left. And by June 1958, the band touring as the Drifters had no members of the July 1955 version. An old version of the band's website, before someone realised that it might be counterproductive to show how little connection there was between the people on stage and the people on their famous records, lists fifty-two different lineups between 1953 and 2004. In ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode seventeen of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Money Honey\" by the Drifters. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nErratum\n\nAt one point in the podcast I say \"Calhoun was the most important figure in the musical side of Atlantic Records\". Obviously I meant \"Stone was...\" -- Charles Calhoun was only a pen name, and I refer to Jesse Stone as Jesse Stone everywhere else in the episode.\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. In this case, two tracks are slightly different from the versions I used in the podcast -- I accidentally used copies of Clyde McPhatter's 1960s solo rerecordings of \"Money Honey\" and \"Such a Night\" in the Mixcloud. The versions I excerpt in the podcast are the originals.\n\nSome of the material here comes from Unsung Heroes of Rock 'n' Roll by Nick Tosches. It's not a boo",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}