{
  "title": "Nvidia’s CTO on the Future of High-Performance Computing",
  "link": "https://spectrum.ieee.org/nvidia-cto-michael-kagan-profile",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/portrait-of-nvidias-cto-michael-kagan-on-a-gray-background.jpg?id=31044752&width=1200&height=800&coordinates=0%2C0%2C0%2C172\"/><br/><br/><p>\n\tIn 2019 Michael Kagan was leading the development of accelerated networking technologies as chief technology officer at \n\t<a href=\"https://en.wikipedia.org/wiki/Mellanox_Technologies#:~:text=Mellanox%20was%20founded%20in%20May,Udi%20Katz%20and%20Alon%20Webman.\" rel=\"noopener noreferrer\" target=\"_blank\">Mellanox Technologies</a>, which he and eight colleagues had founded two decades earlier. Then in April 2020 <a href=\"https://www.nvidia.com/en-us/\" rel=\"noopener noreferrer\" target=\"_blank\">Nvidia</a> acquired the company for US $7 billion, and Kagan took over as CTO of that tech goliath—his dream job.\n</p><p>\n\tNvidia is headquartered in Santa Clara, Calif., but Kagan works out of the company’s office in Israel.\n</p><hr/><p>\n\tAt Mellanox, based in Yokneam Illit, Israel, Kagan had overseen the development of high-performance networking for computing and storage in cloud data centers. The company made networking equipment such as adapters, cables, and high-performance switches, as well as a new type of processor, the DPU. The company’s high-speed \n\t<a href=\"https://en.wikipedia.org/wiki/InfiniBand\" rel=\"noopener noreferrer\" target=\"_blank\">InfiniBand</a> products can be found in most of the world’s fastest supercomputers, and its high-speed Ethernet products are in most cloud data centers, Kagan says.\n</p><p>\n\tThe IEEE senior member’s work is now focused on integrating a wealth of Nvidia technologies to build accelerated computing platforms, whose foundation are three chips: the GPU, the CPU, and the DPU, or data-processing unit. The DPU can support the ability to offload, accelerate, and isolate data center workloads, reducing CPU and GPU workloads.\n</p><p>\n\t“At Mellanox we worked on the data center interconnect, but at Nvidia we are connecting state-of-the-art computing to become a single unit of computing: the data center,” Kagan says. Interconnects are used to link multiple servers and combine the entire data center into one, giant computing unit.\n</p><p>\n\t“I have access and an open door to Nvidia technologies,” he says. “That’s what makes my life exciting and interesting. We are building the computing of the future.”\n</p><h2>From Intel to Mellanox</h2><p>\n\tKagan was born in St. Petersburg, Russia—then known as Leningrad. After he graduated high school in 1975, his family moved to Israel. As with many budding engineers, his curiosity led him to disassemble and reassemble things to figure out how they worked. And, with many engineers in the family, he says, pursuing an engineering career was an easy decision.\n</p><p>\n\tHe attended the \n\t<a href=\"https://www.technion.ac.il/en/home-2/\" rel=\"noopener noreferrer\" target=\"_blank\">Technion</a>, Israel’s Institute of Technology, because “it was one of the best engineering universities in the world,” he says. “The reason I picked electrical engineering is because it was considered to be the best faculty in the Technion.”\n</p><p>\n\tKagan graduated in 1980 with a bachelor’s degree in electrical engineering. He joined \n\t<a href=\"https://www.intel.com/content/www/us/en/corporate-responsibility/intel-in-israel.html\" rel=\"noopener noreferrer\" target=\"_blank\">Intel</a> in Haifa, Israel, in 1983 as a design engineer and eventually relocated to the company’s offices in Hillsboro, Ore., where he worked on the 80387 floating-point coprocessor. A year later, after returning to Israel, Kagan served as an architect of the i8060XP vector processor and then led and managed design of the Pentium MMX microprocessor.\n</p><p>\n\tDuring his 16 years at Intel, he worked his way up to chief architect. In 1999 he was preparing to move his family to California, where he would lead a high-profile project for the company. Then a former coworker at Intel, Eyal Waldman, asked Kagan to join him and five other acquaintances to form Mellanox.\n</p><h3>About Michael Kagan</h3><br/><p>\n<strong></strong><strong>Employer:</strong> Nvidia, Tel Aviv\n</p><p>\n<strong>Title:</strong> CTO\n</p><p>\n<strong>Member grade:</strong> Senior member\n</p><p>\n<strong>Alma mater:</strong> Technion, Israel’s Institute of Technology, Haifa</p><p>\n\tKagan had been turning down offers to join startups nearly every week, he recalls, but Mellanox, with its team of cofounders and vision, drew him in. He says he saw it as a “compelling adventure, an opportunity to build a company with a culture based on the core values I grew up on: excellence, teamwork, and commitment.”\n</p><p>\n\tDuring his more than 21 years there, he said, he had no regrets.\n</p><p>\n\t“It was one of the greatest decisions I’ve ever made,” he says. “It ended up benefiting all aspects of my life: professionally, financially—everything.”\n</p><p>\n\tInfiniBand, the startup’s breakout product, was designed for what today is known as cloud computing, Kagan says.\n</p><p>\n\t“We took the goodies of InfiniBand and bolted them on top of the standard Ethernet,” he says. “As a result, we became the vendor of the most advanced network for high-performance computing. More than half the machines at the top 500 computer companies use the Mellanox interconnect, now the Nvidia interconnect.\n</p><p>\n\t“Most of the cloud providers, such as \n\t<a href=\"http://facebook.com\" rel=\"noopener noreferrer\" target=\"_blank\">Facebook</a>, <a href=\"https://azure.microsoft.com/en-us/\" rel=\"noopener noreferrer\" target=\"_blank\">Azure</a>, and <a href=\"https://www.alibaba.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Alibaba</a>, use Nvidia’s networking and compute technologies. No matter what you do on the Internet, you’re most likely running through the chip that we designed.”\n</p><p>\n\tKagan says the partnership between Mellanox and Nvidia was “natural,” as the two companies had been doing business together for nearly a decade.\n</p><p>\n\t“We delivered quite a few innovative solutions as independent companies,” he says.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Nvidia\\u2019s CTO Michael Kagan is an IEEE senior member.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"140e8a20d3e09d9a3ae800a07d6d33e9\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"0d91e\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/nvidia-u2019s-cto-michael-kagan-is-an-ieee-senior-member.jpg?id=31044758&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">One of Kagan's key priorities is Nvidia’s Bluefield DPU. The data center infrastructure on a chip offloads, accelerates, and isolates a variety of networking, storage, and security services.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Nvidia</small>\n</p><h2>BlueField and Omniverse supercomputers</h2><p>\n\tAs CTO of Nvidia for the past two years, Kagan has shifted his focus from pure networking to the integration of multiple Nvidia technologies including building \n\t<a href=\"https://www.nvidia.com/en-us/networking/products/data-processing-unit/\" rel=\"noopener noreferrer\" target=\"_blank\">BlueField</a> data-processing units and the <a href=\"https://www.nvidia.com/en-us/omniverse/\" rel=\"noopener noreferrer\" target=\"_blank\">Omniverse</a> real-time graphics collaboration platform.\n</p><p>\n\tHe says Nvidia’s vision for the data center of the future is based on its three chips: CPU, DPU, and GPU.\n</p><p>\n\t“These three pillars are connected with a very efficient and high-performance network that was originally developed at Mellanox and is being further developed at Nvidia,” he says.\n</p><p>\n\tDevelopment of the BlueField DPUs is now a key priority for Nvidia. It is a data center infrastructure on a chip, optimized for high-performance computing. It also offloads, accelerates, and isolates a variety of networking, storage, and security services.\n</p><p>\n\t“In the data center, you have no control over who your clients are,” Kagan says. “It may very well happen that a client is a bad guy who wants to penetrate his neighbors’ or your infrastructure. You’re better off isolating yourself and other customers from each other by having a segregated or different computing platform run the operating system, which is basically the infrastructure management, the resource management, and the provisioning.”\n</p><p>\n\tKagan is particularly excited about the Omniverse, a new Nvidia product that uses \n\t<a href=\"https://developer.nvidia.com/usd\" rel=\"noopener noreferrer\" target=\"_blank\">Pixar’s Universal Scene Description</a> software for creating virtual worlds—what has become known as the <a href=\"https://about.fb.com/news/2021/10/founders-letter/\" rel=\"noopener noreferrer\" target=\"_blank\">metaverse</a>. Kagan describes the 3D platform as “creating a world by collecting data and making a physically accurate simulation of the world.”\n</p><p>\n\tCar manufacturers are using the Omniverse to test-drive autonomous vehicles. Instead of physically driving a car on different types of roads under various conditions, data about the virtual world can be generated to train the AI models.\n</p><p>\n\t“You can create situations that the car has to handle in the real world but that you don’t want it to meet in the real world, like a car crash,” Kagan says. “You don’t want to crash the car to train the model, but you do need to have the model be able to handle hazardous conditions on the road.”\n</p><div class=\"ieee-sidebar-small\">\n<h3>Access to IEEE Information</h3>\n<p>\n\tKagan joined IEEE in 1997. He says membership gives him access to information about technical topics that would otherwise be challenging to obtain.\n\t</p>\n<p>\n\t“I enjoy this type of federated learning and being exposed to new things,” he says.\n\t</p>\n<p>\n\tHe adds that he likes connecting with members who are working on similar projects, because he always learns something new.\n\t</p>\n<p>\n\t“Being connected to these people from more diverse communities helps a lot,” he says. “It inspires you to do your job in a different way.”\n\t</p>\n</div><p>\n\tThe Omniverse platform can generate millions of kilometers of synthetic driving data in orders of magnitude faster than actually driving the car.\n</p><p>\n\tNvidia is investing heavily in technology for self-driving cars, Kagan says.\n</p><p>\n\tThe company is also building what it calls the most powerful AI supercomputer for climate science: \n\t<a href=\"https://blogs.nvidia.com/blog/2021/11/12/earth-2-supercomputer/\" rel=\"noopener noreferrer\" target=\"_blank\">Earth-2</a>, a digital twin of the planet. Earth-2 is designed to continuously run models to predict climate and weather events at both the regional and global levels.\n</p><p>\n\tKagan says the climate modeling technology will enable people to try mitigation techniques for global warming and see what their impact is likely to be in 50 years.\n</p><p>\n\tThe company is also working closely with the health care industry to develop AI-based technologies. Its supercomputers are helping to identify cancer by generating synthetic data to enable researchers to train their models to better identify tumors. Its AI and accelerated computing products also assist with drug discovery and genome research, Kagan says.\n</p><p>\n\t“We are actually moving forward at a fairly nice pace,” he says. “But the thing is that you always need to reinvent yourself and do the new thing faster and better, and basically win with what you have and not look for infinite resources. This is what commitment means.”\n</p><p><em>This article has been updated from an earlier version.</em></p>",
  "pubDate": "Thu, 18 Aug 2022 18:00:00 +0000",
  "guid": "https://spectrum.ieee.org/nvidia-cto-michael-kagan-profile",
  "category": [
    "Ieee member news",
    "Nvidia",
    "Telecommunications",
    "Mellanox",
    "Intel",
    "Gpu",
    "Cpu",
    "Dpu",
    "Bluefield",
    "Omniverse",
    "Metaverse",
    "Type:ti"
  ],
  "dc:creator": "Kathy Pretz",
  "media:content": ""
}