{
  "title": "CES 2022: Better together with Android and beyond",
  "link": "https://blog.google/products/android/ces2022-bettertogether/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p><i>Editors note: Google planned to attend CES 2022 but pulled out due to concerns over COVID-19.</i></p><p>The average U.S. household had <a href=\"https://www2.deloitte.com/us/en/pages/about-deloitte/articles/press-releases/deloitte-pandemic-stress-tested-digital-home.html\">25 connected devices</a> in 2021, up from 11 in 2019. If you’re like me, you want to pick and choose the devices that work best for you regardless of brand. You also want to easily set up and move from one device to the next throughout your day, and without having to pull up the same song or task over and over again.</p><p>Android was built for everyone, everywhere and to give people more choice in devices, whether it’s based on the design, features or overall value. Over the years, we’ve evolved Android to support more devices in your life such as watches, tablets, TVs and even cars. And beyond Android, our work at Google includes laptops, headphones and speakers, smart home devices and much more.</p><p>That’s why we’re building on our <a href=\"https://blog.google/products/android/better-together/\">efforts</a> and introducing more simple and helpful ways to make your devices, from Android’s ecosystem and beyond, work better together.</p><h3>Quickly set up and connect your new devices</h3><p>It can be fun and exciting to get a new device — but that can turn into a headache when you start setting it up. We’re making this process a little less daunting with pairing support for more devices.</p><p>Fast Pair has already helped people connect their Android phones with Bluetooth accessories over 100 million times. It enables instant set up and device pairing, bringing up the companion app for installation and transferring your Google credentials. We’re continuing our work with partners to further extend Fast Pair’s functionality beyond audio connectivity with wearables, headphones, speakers and cars and extending it to TVs and smart home devices, so you can instantly start using all the devices in your life.</p><p>Starting in a few weeks, when you turn on your Fast Pair-enabled headphones, your Chromebook will automatically detect it and pair with it in a single click, letting you stay focused when studying or working wherever you are. If you get a new Chromebook later this year, you can use your Android phone to quickly set it up and get immediate access to all of the information you’ve already saved, like your Google login and your Wi-Fi password.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"Log in credentials transferring from a side by side Android phone to a red Chromebook laptop.\" class=\"article-image--full\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/1._Quick_setup_Chrome_OS_to_Android.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>In the coming months, you’ll be able to set up your headphones for when you need to watch quietly with your Google TV or Android TV OS device at home. And with <a href=\"https://blog.google/products/google-nest/four-google-smart-home-updates-matter/\">built-in support for Matter</a> on Android, you’ll be able to use Fast Pair to quickly connect new Matter-enabled smart home devices to your network, Google Home and other accompanying apps all in just a few taps.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"A phone showing the process of connecting a smart bulb into the Google Home app with Fast Pair for Matter-enabled devices\" class=\"article-image--full\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/2._Fast_Pair_Matter-enabled_devices.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Lock and unlock your devices</h3><p>Today, you can already <a href=\"https://support.google.com/chromebook/answer/9617782?hl=en\">unlock your Chromebook</a> with your Android phone to quickly get right to work. In the coming months, we’ll bring this feature to your paired Wear OS smartwatch so you can instantly unlock and access your Chromebook and Android phone or tablet when you’re close by.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"A phone unlocks next to a watch face motioning through a passcode\" class=\"article-image--full\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/3._Wear_OS_unlock_Android_1_KkvQpdi.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>And with a digital car key, <a href=\"https://blog.google/products/android/new-features-december-2021/\">you can now use</a> your compatible Samsung or Pixel phone to lock, unlock and start your supported BMW vehicles from your phone. Starting later this year, on phones with Ultra Wideband (UWB) technology, you won’t even have to take your phone out to use it as a car key. You’ll also be able to securely and remotely share your car key with friends and family if they need to borrow your car. We’re working to bring digital car keys to more Android phones and vehicles later this year.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"A phone over an outlined graphic of a car and an unlock motion\" class=\"article-image--large\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/4._Digital_car_key.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Complete tasks and share media across devices</h3><p>To amplify your visual and audio experiences, your devices should instinctively know which of them you want to use and when. We’re building a technology for Bluetooth-enabled headphones that will enable them to automatically switch the audio to whatever device you’re listening to. So if you’re wearing headphones to watch a movie on your Android tablet and you receive a phone call, the movie will pause and the headphone audio will automatically switch to your Android phone and then switch back to the movie when you’re done. Spatial audio on your headsets will make you feel like you’re really there by adapting the sound based on your head movements, positioning the audio in the space all around you. These features will be available in the next few months on supported headphones.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"A video of a movie with dancers playing on a tablet, with a phone on next to it receiving a phone call\" class=\"article-image--full\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/5._Audio_switching_from_Chrome_OS_to_Android_3Gl8Tan.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>We’re also making it easier to move and manage your content across any device. With Chromecast built-in, your Android phone already allows you to share videos to displays and TVs as well as audio content to select speakers from Nest and others. To help you cast music and podcasts you’re listening to from your Android phone to more of your speakers, we’re bringing Chromecast built-in to more brands, starting with all Bose smart speakers and soundbars in the next few months.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"A phone above a Bose soundbar showing a cast connection\" class=\"article-image--full\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/6._Bose_with_Chromecast_built-in.max-500x500.png\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/6._Bose_with_Chromecast_built-in.max-1000x1000.png\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/6._Bose_with_Chromecast_built-in.max-100x100.png \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Whether you’re at home or on the go, we’re also adding features to <a href=\"https://support.google.com/chromebook/answer/10480029?hl=en-GB\">Phone Hub</a> on Chromebooks later this year that help you accomplish more across your devices. Today, you can use your Chromebook to view and respond to chat notifications, toggle Do Not Disturb, set off the ringtone to find your phone or continue browsing recent Chrome tabs. Later this year, if you’re working on your Chromebook and your Android phone is out of reach (such as charging in a different room), you’ll be able to stay in touch by accessing chat apps from your phone directly to your Chromebook –without needing to install them again on your Chromebook. We’re also excited to add Camera Roll to the Phone Hub, which makes access to your most recent photos and videos as easy as one click.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"A phone receiving a text message, with the message appearing on a red laptop for responding\" class=\"article-image--full\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/7._Multi-device_messaging_from_Android_to_Chrome_OS_1.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Today, you can already use your voice while driving to close the garage door, turn off the kitchen lights, turn down the thermostat and check if you locked the front door. You’ll soon be able to ask Google for help even before you leave the front door. With remote actions, you can use your voice to warm up and cool down your car, lock and unlock and get information (like how much battery you have left) on all Assistant-enabled devices. These capabilities are coming first to vehicles from Volvo Cars in the coming months, with more to follow.</p><h3>Do more with Android and Windows PCs</h3><p>For the first time with Android, we’re also focused on building for other platforms, like Windows, whether it's in <a href=\"https://twitter.com/thegameawards/status/1469162458019414020?s=20\">gaming</a>, productivity or other areas. For example, by connecting your Android phone to your Windows PC with Fast Pair, you’ll be able to quickly set up Bluetooth accessories, sync text messages and share files with Nearby Share. We’re working with Acer, HP and Intel to bring these experiences to select Windows PCs first later this year.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"An HP Windows PC laptop next to a phone showing Nearby Share as a feature for sending files\" class=\"article-image--full\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/8._HP_Windows_PC_WFBRjJe.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>These features will be rolling out throughout the year. Moving forward, you’ll continue to see us invest in more helpful ways for your devices to work better together.</p></div></div></body></html>",
  "pubDate": "Wed, 05 Jan 2022 18:00:00 +0000",
  "guid": "https://blog.google/products/android/ces2022-bettertogether/",
  "category": [
    "Chromebooks",
    "Android",
    "Google TV",
    "Wear OS"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "CES 2022: Better together with Android and beyond",
    "description": "Set up and connect your devices, share media and even unlock your car with Android.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/0._Blog_header.gif",
    "site_name": "Google",
    "url": "https://blog.google/products/android/ces2022-bettertogether/"
  },
  "author": {
    "name": "Erik Kay",
    "title": "VP of Multi-Device Experiences",
    "department": "",
    "company": ""
  }
}