{
  "title": "Appropriate Penalties for Assaulting Politicians and Their Relatives",
  "description": "<div class=\"block-quote\">\n<div class=\"pull-quote-blue\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-62148\" src=\"https://www.econlib.org/wp-content/uploads/2022/11/Becker-1.jpg\" alt=\"\" width=\"140\" height=\"198\" /></div>\n</div>\n<p>It&#8217;s hard to know what the appropriate penalties should be for any crime. But we can still take something from the economics of crime and apply it to the Paul Pelosi situation.</p>\n<p>Here&#8217;s what Lisa Mascaro, Stefanie Dazio, and Terry Chea write in &#8220;<a href=\"https://www.nbcbayarea.com/news/local/san-francisco/paul-pelosi-attack-suspect-charges/3064054/\">Paul Pelosi Attack: Suspect Faces State and Federal Charges</a>,&#8221; <em>NBC Bay Area</em>, November 1, 2022:</p>\n<blockquote><p>Additionally, DePape is charged federally with influencing, impeding, or retaliating against a federal official by threatening or injuring a family member. He also faces one count of attempted kidnapping of a United States official on account of the performance of official duties.</p></blockquote>\n<p>In other words, because David DePape allegedly [I say &#8220;allegedly&#8221; to save myself from a lawsuit] attacked the husband of a politician, he faces charges in addition to the ones that he would have faced if he had attacked me.</p>\n<p>One of the path-breaking articles in the economics of crime was <a href=\"https://www.econlib.org/library/Enc/bios/Becker.html\">Gary Becker</a>&#8216;s &#8220;Crime and Punishment: An Economic Approach,&#8221; published in the March/April 1968 edition of the <em>Journal of Political Economy</em>. I remember working my way through it in an intermediate microeconomics course that Kenneth Avio taught at the University of Western Ontario in the 1971-72 academic year. The bottom line that I took away from the article is that the higher the probability of catching a criminal, the lower should be the penalty the criminal faces.</p>\n<p>How is that relevant in the  DePape case? It pretty much has to be true that someone who assaults the husband of a woman who is second in line for the U.S. presidency (only after Vice-President Kamala Harris) has a high probability of being caught. This probability is much higher than the probability that the police would catch someone who assaulted me. So that means that the penalty for assaulting Paul Pelosi should be <em>lower</em> than the penalty for assaulting me, not higher as it is currently.</p>\n<p>Of course you could argue that it&#8217;s more important to protect relatives of politicians than to protect me because assaulting the relative could intimidate the politician and take her away from her useful work.</p>\n<p>The problem with that line of reasoning is that then we would have to make some judgment about the value of Speaker Pelosi&#8217;s work versus the value of mine. Hmmm.</p>\n<p><em>Postscript</em>: My bio of Gary Becker in David R. Henderson, ed., <em>The Concise Encyclopedia of Economics</em> is <a href=\"https://www.econlib.org/library/Enc/bios/Becker.html\">here</a>. The picture above is of him.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n(25 COMMENTS)",
  "link": "https://www.econlib.org/appropriate-penalties-for-assaulting-politicians-and-their-relatives/",
  "guid": "https://www.econlib.org/appropriate-penalties-for-assaulting-politicians-and-their-relatives/",
  "category": [
    "Economics of Crime",
    "crime and punishment",
    "David DePape",
    "Gary Becker",
    "Nancy Pelosi",
    "Paul Pelosi"
  ],
  "pubDate": "Tue, 01 Nov 2022 22:03:15 +0000"
}