{
  "id": "tag:blogger.com,1999:blog-2471378914199150966.post-6242291095764853170",
  "published": "2022-09-01T14:34:00.000-07:00",
  "updated": "2022-09-01T14:34:18.299-07:00",
  "category": "",
  "title": "Chrome 106 Beta: New CSS Features, WebCodecs and WebXR Improvements, and More",
  "content": "<p>Unless otherwise noted, changes described below apply to the newest Chrome beta channel release for Android, ChromeOS, Linux, macOS, and Windows. Learn more about the features listed here through the provided links or from the list on <a href=\"https://www.chromestatus.com/features#milestone%3D76\">ChromeStatus.com</a>. Chrome 106 is beta as of September 1, 2022. You can <a href=\"https://www.google.com/chrome/beta/\">download the latest on Google.com</a> for desktop or on Google Play Store on Android.  </p><h1 id=\"origin-trials\">Origin Trials</h1>  <p>This version of Chrome supports the origin trials described below. Origin trials allow you to try new features and give feedback on usability, practicality, and effectiveness to the web standards community. To register for any of the origin trials currently supported in Chrome, including the ones described below, visit the <a href=\"https://developers.chrome.com/origintrials/#/trials/active\">Chrome Origin Trials dashboard</a>. To learn more about origin trials in Chrome, visit the <a href=\"https://web.dev/origin-trials/\">Origin Trials Guide for Web Developers</a>. Microsoft Edge runs its own origin trials separate from Chrome. To learn more, see the <a href=\"https://developer.microsoft.com/en-us/microsoft-edge/origin-trials/\">Microsoft Edge Origin Trials Developer Console</a>.  </p><h2 id=\"anonymous-iframes\">Anonymous iframes</h2>  <p>Anonymous iframes give developers a way to load documents in third-party iframes using new and ephemeral contexts. Anonymous iframes are a generalization of COEP, i.e. Cross-Origin-Embedder-Policy: credentialless to support third-party iframes that may not deploy COEP. As with COEP: credentialless, it replaces the opt-in of cross-origin subresources with avoiding loading of non-public resources. This removes the constraint that third party iframes must support COEP in order to be embedded in a COEP page and unblocks developers looking to adopt cross-origin-isolation. </p><p>The origin trial is expected to last through Chrome 108. To sign up for the origin trial, visit <a href=\"https://developer.chrome.com/origintrials/#/view_trial/2518638091606949889\">its sign up page</a>. </p><h2 id=\"pop-up-api\">Pop-Up API</h2>  <p>The <a href=\"https://www.chromestatus.com/feature/5463833265045504\">Pop-Up API</a> lets developers build transient user interface elements to display on top of other web app interface elements. This API is useful for creating interactive elements such as action menus, form element suggestions, content pickers, and teaching user interfaces.  </p><p>This API uses a new <code>popup</code>&nbsp;content attribute to enable any element to be displayed in the <a href=\"https://developer.chrome.com/blog/what-is-the-top-layer/\">top layer</a>. This attribute's effect on the pop-up is similar to that of the <code>&lt;dialog&gt;</code> element, but has several important differences, including light-dismiss behavior, pop-up interaction management, animation, event support, and non-modal mode. </p><p>The origin trial is expected to last through Chrome 110. To sign up for the origin trial, visit <a href=\"https://developer.chrome.com/origintrials/#/view_trial/4500221927649968129\">its sign up page</a>. </p><h1 id=\"other-features-in-this-release\">Other Features in this Release</h1>  <h2 id=\"client-hints-persistency-in-android-webview\">Client Hints persistency in Android WebView</h2>  <p>Client Hints are <a href=\"https://www.chromestatus.com/feature/4936247663919104\">now persisted on Android WebView</a>, creating parity with the rest of the web platform. Previously, WebView did not persist the list of Client Hints a page requests, so the initial load of a website would never include Client Hints. Only subresources on a given page would receive them. This undermined the use of the Client Hints system, which is to empower websites to adapt content to the user agent. For more information on Client Hints, see <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Client_hints\">HTTP Client hints</a>.  </p><h2 id=\"css\">CSS</h2>  <h3 id=\"grid-template-properties-interpolation\">grid-template properties interpolation</h3>  <p>In CSS Grid, the <code>'grid-template-columns'</code> and <code>'grid-template-rows'</code> properties allow developers to define line names and track sizing of grid columns and rows respectively. <a href=\"https://www.chromestatus.com/feature/6037871692611584\">Supporting interpolation</a> for these properties allows grid layouts to smoothly transition between states, instead of snapping at the halfway point of an animation or transition. </p><h3 id=\"'ic'-length-unit\">'ic' length unit</h3>  <p>The <code><a href=\"https://www.chromestatus.com/feature/5193188445257728\">'ic' length unit</a></code> expresses CSS lengths relative to the advanced measure of the water ideograph used in some Asian fonts such as Chinese and Japanese. This allows authors to size elements to fit a given number of full width glyphs for such fonts. Gecko and WebKit already support this unit. Adding this to Chrome is part of <a href=\"https://web.dev/interop-2022/\">Interop 2022</a>.  </p><h3 id=\"‘preserve-parent-color'-value-for-the-‘forced-color-adjust'-css-property\">‘preserve-parent-color' value for the ‘forced-color-adjust' CSS property.</h3>  <p>The <code><a href=\"https://chromestatus.com/feature/4887620095049728\">'preserve-parent-color' value has been added</a></code> to the <code>'forced-color-adjust'</code> CSS property. Previously, when the forced colors mode was enabled, the <code>'color'</code> property was inherited. Now, when the <code>'preserve-parent-color'</code> value is used, the <code>'color'</code> property will use the value of its parent. Otherwise, the <code>'forced-color-adjust: preserve-parent-color'</code> value behaves the same as <code>'forced-color-adjust: none'</code>.  </p><h3 id=\"unprefix-webkit-hyphenate-character-property\">Unprefix -webkit-hyphenate-character property</h3>  <p>Chrome now supports <a href=\"https://www.chromestatus.com/feature/5169156928831488\">the unprefixed hyphenate-character property</a> in addition to the <code>-webkit-hyphenate-character</code> property. The <code>-webkit-hyphenate-character</code> property will be deprecated at a later date. </p><h2 id=\"javascript-intl-numberformat-v3-api\">JavaScript: Intl.NumberFormat v3 API</h2>  <p><code>Intl.NumberFormat</code> has the following <a href=\"https://www.chromestatus.com/feature/5707621009981440\">new features</a>: </p><ul> <li>Three new functions to format a range of numbers: <code>formatRange()</code>, <code>formatRangeToParts()</code>, and <code>selectRange()</code></li><li>A grouping enum </li><li>New rounding and precision options </li><li>Rounding priority </li><li>Interpretation of strings as decimals </li><li>Rounding modes </li><li>Sign display negative (zero shown without a negative sign)</li></ul> <p>For more information, see the <a href=\"https://github.com/tc39/proposal-intl-numberformat-v3/blob/master/README.md\">original proposal's README</a>. </p><h2 id=\"serialport-byob-reader-support\">SerialPort BYOB reader support</h2>  <p>The underlying data source for a <code><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/ReadableStream\">ReadableStream</a></code> provided by a <code><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/SerialPort\">SerialPort</a></code> <a href=\"https://www.chromestatus.com/feature/6716022686482432\">is now a readable byte stream</a>. SerialPort \"bring your own buffer\" (BYOB)  is backwards-compatible with existing code that calls <code>port.readable.getReader()</code> with no parameters. To detect support for this feature, pass <code>'byob'</code> as the mode parameter when calling <code>getReader()</code>. For example:     </p><pre class=\"prettyprint\">port.readable.getReader({ mode: 'byob' });<br /></pre>  <p>Older implementations will throw a <code>TypeError</code> when the new parameter is passed.<br /><br />BYOB readers allow developers to specify the buffer into which data is read instead of the stream allocating a new buffer for each chunk. In addition to potentially reducing memory pressure, this allows the developer to control how much data is received because the stream cannot return more than there is space for in the provided buffer. For more information, see <a href=\"https://web.dev/serial/#:~:text=Bring%20Your%20Own%20Buffer\">Read from and write to a serial port</a>.  </p><h2 id=\"webcodecs-dequeue-event\">WebCodecs dequeue event</h2>  <p>A <code>dequeue</code> event and associated callback <a href=\"https://www.chromestatus.com/feature/5195706034290688\">have been added to the audio and video interfaces</a>, specifically: <code><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/AudioDecoder\">AudioDecoder</a></code>, <code><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/AudioEncoder\">AudioEncoder</a></code>, <code><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/VideoDecoder\">VideoDecoder</a></code>, and <code><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/VideoEncoder\">VideoEncoder</a></code>.  </p><p><br />Developers may initially queue encoding or decoding work by calling <code>encode()</code> or <code>decode()</code> respectively. The new <code>dequeue</code> event is fired to indicate when the underlying codec has ingested some or all of the queued work. The decrease in the queue size is already reflected by a lower value of <code>encoder.encodeQueueSize</code> and <code>decoder.decodeQueueSize</code> attributes. The new event eliminates the need to call <code>setTimeout()</code> to determine when the queue has decreased (in other words, when they should queue more work). </p><h2 id=\"webxr-raw-camera-access\">WebXR Raw Camera Access</h2>  <p>Applications using the WebXR Device API can <a href=\"https://chromestatus.com/feature/5759984304390144\">now access pose-synchronized camera image textures</a> in the contexts that also allow interacting with other AR features provided by WebXR. </p><h1 id=\"deprecations-and-removals\">Deprecations, and Removals</h1>  <p>This version of Chrome introduces the deprecations and removals listed below. Visit ChromeStatus.com for lists of <a href=\"https://www.chromestatus.com/features#browsers.chrome.status%3A%22Deprecated%22\">current deprecations</a>  and <a href=\"https://www.chromestatus.com/features#browsers.chrome.status:%22Removed%22\">previous removals</a>. </p><h2 id=\"remove-non-ascii-characters-in-cookie-domain-attributes\">Remove non-ASCII characters in cookie domain attributes</h2>  <p>To align with the latest spec (<a href=\"https://datatracker.ietf.org/doc/html/draft-ietf-httpbis-rfc6265bis/#section-5.5\">RFC 6265bis</a>), <a href=\"https://www.chromestatus.com/feature/5534966262792192\">Chromium now rejects</a> cookies with a <code>Domain</code> attribute that contains non-ASCII characters (for example, <code>éxample.com</code>). </p><p>Support for IDN domain attributes in cookies has been long unspecified, with Chromium, Safari, and Firefox all behaving differently. This change standardizes Firefox's behavior of rejecting cookies with non-ASCII domain attributes.<br /><br />Since Chromium has previously accepted non-ASCII characters and tried to convert them to normalized punycode for storage, we will now apply stricter rules and require valid ASCII (punycode if applicable) domain attributes. </p><h2 id=\"remove-http-2-push\">Remove HTTP/2 push</h2>  <p>Chrome has <a href=\"https://www.chromestatus.com/feature/6302414934114304\">removed the ability</a> to receive, keep in memory, and use HTTP/2 push streams sent by the server. See <a href=\"https://developer.chrome.com/blog/removing-push/\">Removing HTTP/2 Server Push from Chrome</a> for details and suggested alternative APIs. </p><p></p><p></p><p></p><p></p>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Chromium Blog",
    "uri": "http://www.blogger.com/profile/06394244468194711527",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}