{
  "title": "86: Behind The Curve",
  "link": "https://audioboom.com/posts/7272779",
  "itunes:episode": 86,
  "itunes:title": "Behind The Curve",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3237,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>IS IT POSSIBLE THAT THE EARTH IS FLAT? <br>\n<br>\nTurns out, there are LOTS of people believe it is. Is their evidence compelling? Not really, but their conspiracies run deep and cross over into everything from being anti-vaccination to, you know, believing that the school systems invented dinosaurs to keep kids dumb...or something like that. For us, this was 90 minutes of rage, and that always makes for a great episode. Enjoy. ALSO THE EARTH IS FLAT. <br>\n<br>\n<strong>LOOKING FOR MORE TCO? WHO COULD BLAME YOU</strong>! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Join our Patreon fam</a> and instantly get over <strong>80 FULL BONUS episodes to BINGE RIGHT NOW!</strong>Including our episode-by-episode coverage of <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!<br>\n</a><br>\n\n</div>\n<div>\n<a href=\"https://www.truecrimeobsessed.com/see-us-live\"><strong>COME TO OUR PRIDE SHOW!</strong></a><strong> </strong>Come hang with us in NYC on Saturday, June 29th--the 50th Anniversary of The Stonewall Riots! It will be one of our most special and memorable live shows to date! <strong>All ticket holders are welcome to join Patrick on a FREE walking tour of the West Village on the morning of the show!</strong> He'll show you all the spots from the gay liberation movement, old New York movies, and even Sex and the City--all within a few blocks! <a href=\"https://www.truecrimeobsessed.com/see-us-live\">Get tickets to the Pride Show here!<br>\n</a><br>\n\n</div>\n<div>\n<strong>To learn about our sponsors AND GET THOSE PROMO CODES,</strong> <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">Click here!<br>\n</a><br>\n\n</div>\n<div>\n<br>\n<br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 28 May 2019 04:01:00 +0000",
  "guid": "tag:audioboom.com,2019-05-28:/posts/7272779",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}