{
  "title": "Daters Find Midterm Voters More Attractive",
  "link": "https://theblog.okcupid.com/daters-find-midterm-voters-more-attractive-24e3e3344706?source=rss----2cd59e7d4ed1--data",
  "guid": "https://medium.com/p/24e3e3344706",
  "category": [
    "politics",
    "midterms",
    "dating",
    "relationships",
    "data"
  ],
  "dc:creator": "OkCupid",
  "pubDate": "Fri, 09 Sep 2022 12:49:53 GMT",
  "atom:updated": "2022-09-09T13:04:37.743Z",
  "content:encoded": "<h4><strong>New data from OkCupid shows that singles who vote in local and midterm elections get more Likes and Matches</strong></h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*T7gConspFo7C_iA36sy9Ew.jpeg\" /></figure><p>Ahead of National Voter Registration Day on September 20th, OkCupid and <a href=\"https://www.vote.org/\">Vote.org</a> are teaming up to encourage young daters across the nation to register to vote and make their voices heard in this year’s midterm elections. Beginning in September and running through Election Day in November, OkCupid will be driving its users in the United States to Vote.org’s resources to help people <a href=\"https://www.vote.org/register-to-vote/?campaign=OKCupid2022\">register to vote</a>, <a href=\"https://www.vote.org/absentee-ballot/?campaign=OKCupid2022\">request an absentee ballot</a>, and <a href=\"http://vote.org/OKC-pollingplace\">find their polling place</a>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*qRx0oN20z5zev27C\" /><figcaption><em>Register to vote online </em><a href=\"https://www.vote.org/register-to-vote/?campaign=OKCupid2022\"><em>here</em></a></figcaption></figure><p>About <strong>9 in 10 (86%) of nearly 3 million daters on OkCupid in the United States are currently registered to vote</strong> — and singles are looking for people who participate in <em>all</em> elections. Last year, <strong>people who said they vote in midterm and local elections got 35% more Matches and 26% more Likes than those who only vote in the general election</strong>. They also <strong>had 52% more conversations on our dating app</strong> when compared to people who said they don’t vote.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*3z4epXesRvYOXHUZ\" /></figure><p>Only on OkCupid can you match on what matters through in-app questions. This year, we’ve found that politics is the biggest conversation starter <em>and</em> dealbreaker. <strong>Our matching questions related to politics and voting have been answered more than 150 million times over the years</strong>. So we’ve added brand-new in-app matching questions ahead of the 2022 midterm elections to help our daters navigate conversations around the upcoming election and biggest political issues:</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*0SeDBdn8vGs0i4F-\" /></figure><p>Right now, <strong>almost 8 in 10 people on OkCupid</strong> (<strong>65% of Gen Z, 76% of Millennials and 83% of Gen X respondents) plan to vote in the </strong><a href=\"https://www.vote.org/am-i-registered-to-vote/?campaign=OKCupid2022\"><strong>2022 midterm elections</strong></a>, held on Tuesday, November 8th. And singles who plan to vote in the midterms are reaping the benefits. They are getting 31% more Matches, having 21% more conversations, and receiving 14% more Likes.</p><p>“We know our young daters are politically engaged. A majority of Gen Z (79%) and Millennial (86%) singles on OkCupid are registered to vote, and Millennials are most likely to say they couldn’t date someone who doesn’t vote.” said Michael Kaye, head of global communications at OkCupid. “We’re excited to partner with Vote.org to help increase voter turnout and reach millions of young voters on OkCupid.”</p><p>“Voter registration and engagement among Generation Z and Millennials is increasing across the country,” said Andrea Hailey, CEO of Vote.org. “We’re proud to partner with OkCupid, which reaches millions of engaged young people seeking connection with others. Just as OkCupid works to remove barriers from finding love, Vote.org removes the hurdles associated with voting. Daters on OkCupid are planning for their future, and so is Vote.org. Our democracy thrives when we connect and join together. Now, we’re excited to work with OkCupid to energize more young people as they make their plan to vote on or before November 8.”</p><p>Vote.org is the nation’s largest voter registration and activation platform in the country. Are you Vote Ready? Go to Vote.org to <a href=\"https://www.vote.org/register-to-vote/?campaign=OKCupid2022\">register to vote</a>, <a href=\"https://www.vote.org/am-i-registered-to-vote/?campaign=OKCupid2022\">verify your registration</a>, <a href=\"https://www.vote.org/absentee-ballot/?campaign=OKCupid2022\">request an absentee ballot</a>, <a href=\"http://vote.org/OKC-pollingplace\">find your polling location</a>, <a href=\"https://www.vote.org/election-reminders/\">sign up for election reminders</a> and more. Vote.org is your one-stop shop to prepare to vote and make your voice heard.</p><p><strong>Media contact: MichaelK@OkCupid.com</strong></p><p><a href=\"https://okcupid.onelink.me/godV/44c7b6b0\"><em>Download OkCupid</em></a><em> to find a date (that you can vote with!) now.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=24e3e3344706\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://theblog.okcupid.com/daters-find-midterm-voters-more-attractive-24e3e3344706\">Daters Find Midterm Voters More Attractive</a> was originally published in <a href=\"https://theblog.okcupid.com\">OkCupid Dating Blog</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}