{
  "title": "S5 Ep46: Backstage: Ukraine's economic and political outlook",
  "link": "https://audioboom.com/posts/7276723",
  "itunes:episode": 46,
  "itunes:title": "Backstage: Ukraine's economic and political outlook",
  "itunes:season": 5,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1766,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>The keyword in Ukraine right now is ‘uncertainty’, as the country prepares to elect a new parliament in July only a few months after electing a new president. <br>\n<br>\n\n</div>\n<div>Not only will the new government have a role in stabilising and growing the economy following the 2014-15 economic crisis, but they will face the challenge of a large debt repayment during their term while dealing with an aggressive Russia.<br>\n </div>\n<div>In a political climate that is known for being corrupt and not respecting the rule of law, there are opportunities to change the country beyond economic policy.  <br>\n </div>\n<div>In this episode of the Backstage podcast series, Giuseppe Porcaro, head of communications and events at Bruegel, hosts non-resident fellow Marek Dabrowski and Hlib Vyshlinsky, executive director at the Centre for Economic Strategy (CES) to discuss the opportunities for the new government and the best recipe of reforms. </div>\n<div> </div>\n<div>For further reading, we recommend this blog post written by Marek Dabrowski about <a href=\"http://bruegel.org/2018/07/ukraine-the-struggle-for-reforms-continues/\">Ukraine’s struggle for reform</a>, as well as this policy contribution on <a href=\"http://bruegel.org/2017/09/ukraines-unfinished-reform-agenda/\">Ukraine’s unfinished reform agenda</a>. </div>\n",
  "itunes:summary": "In this episode of ‘The Sound of Economics’, Giuseppe Porcaro hosts Hlib Vyshlinsky, executive director of the Centre for Economic Strategy, and Bruegel fellow Marek Dabrowski to discuss what the new Ukrainian government should do to meet the challenges facing the country’s economy.",
  "pubDate": "Fri, 31 May 2019 13:50:20 +0000",
  "guid": "tag:audioboom.com,2019-05-31:/posts/7276723",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}