{
  "title": "CFP: AusDM 2018, Bathurst, Australia, 28-30 Nov 2018",
  "link": "https://rdatamining.wordpress.com/2017/11/27/cfp-ausdm-2018-bathurst-australia-28-30-nov-2018/",
  "comments": "https://rdatamining.wordpress.com/2017/11/27/cfp-ausdm-2018-bathurst-australia-28-30-nov-2018/#comments",
  "dc:creator": "Yanchang Zhao",
  "pubDate": "Sun, 26 Nov 2017 22:50:57 +0000",
  "category": "Data Mining",
  "guid": "http://rdatamining.wordpress.com/?p=578",
  "description": "16th Australasian Data Mining Conference (AusDM 2018) Bathurst, Australia, 28-30 November 2018  URL: http://ausdm18.ausdm.org/ The Australasian Data Mining Conference has established itself as the premier Australasian meeting for both practitioners and researchers in data mining. It is devoted to the &#8230; <a href=\"https://rdatamining.wordpress.com/2017/11/27/cfp-ausdm-2018-bathurst-australia-28-30-nov-2018/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<div dir=\"ltr\">\n<div><b>16th Australasian Data Mining Conference (AusDM 2018)</b></div>\n<div><b>Bathurst, Australia,</b></div>\n<div><b>28-30 November 2018 </b></div>\n<div>URL: <a href=\"http://ausdm18.ausdm.org/\" target=\"_blank\" rel=\"noopener\">http://ausdm18.ausdm.org/</a></div>\n</div>\n<div></div>\n<div dir=\"ltr\">\n<div></div>\n<div>The Australasian Data Mining Conference has established itself as the premier Australasian meeting for both practitioners and researchers in data mining. It is devoted to the art and science of intelligent analysis of (usually big) data sets for meaningful (and previously unknown) insights. This conference will enable the sharing and learning of research and progress in the local context and new breakthroughs in data mining algorithms and their applications across all industries.</div>\n</div>\n<div></div>\n<div dir=\"ltr\">\n<div></div>\n<div>Since AusDM&#8217;02 the conference has showcased research in data mining, providing a forum for presenting and discussing the latest research and developments. Built on this tradition, AusDM&#8217;18 will facilitate the cross-disciplinary exchange of ideas, experience and potential research directions. Specifically, the conference seeks to showcase: Research Prototypes; Industry Case Studies; Practical Analytics Technology; and Research Student Projects. AusDM&#8217;18 will be a meeting place for pushing forward the frontiers of data mining in academia and industry.</div>\n</div>\n<div></div>\n<div dir=\"ltr\">\n<div></div>\n<div><b>Publication and topics</b></div>\n</div>\n<div></div>\n<div dir=\"ltr\">\n<div></div>\n<div>We are calling for papers, both research and applications, and from both academia and industry, for presentation at the conference. All papers will go through double-blind, peer-review by a panel of international experts. Accepted papers will be published in the AusDM 2018 proceedings by Springer. Some selected papers will be invited for submission with extension in a special edition of a Springer journal. Please note that we require that at least one author for each accepted paper will register for the conference and present their work. One full registration will cover at most two papers.</div>\n<div></div>\n<div>AusDM invites contributions addressing current research in data mining and knowledge discovery as well as experiences, novel applications and future challenges. Topics of interest include, but are not restricted to:</div>\n<div></div>\n<div>&#8211; Applications of Data Mining and Case Studies &#8211; Big Data Analytics</div>\n<div>&#8211; Biomedical and Health Data Mining</div>\n<div>&#8211; Business Analytics</div>\n<div>&#8211; Computational Aspects of Data Mining</div>\n<div>&#8211; Data Integration, Matching and Linkage</div>\n<div>&#8211; Data Mining Education</div>\n<div>&#8211; Data Mining in Security and Surveillance</div>\n<div>&#8211; Data Preparation, Cleaning and Preprocessing</div>\n<div>&#8211; Data Stream Mining</div>\n<div>&#8211; Implementations of Data Mining in Industry</div>\n<div>&#8211; Integrating Domain Knowledge</div>\n<div>&#8211; Knowledge Discovery and Presentation</div>\n<div>&#8211; Link, Tree, Graph, Network and Process Mining</div>\n<div>&#8211; Multimedia Data Mining</div>\n<div>&#8211; Mobile Data Mining</div>\n<div>&#8211; New Data Mining Algorithms</div>\n<div>&#8211; Privacy-preserving Data Mining</div>\n<div>&#8211; Spatial and Temporal Data Mining</div>\n<div>&#8211; Text Mining</div>\n<div>&#8211; Web and Social Network Mining</div>\n<div></div>\n<div><b>Keynote speakers</b></div>\n<div></div>\n<div>As is tradition for AusDM we have lined up an excellent keynote speaker program. Each speaker is a well known researcher and/or practitioner in data mining and related disciplines. The keynote program provides an opportunity to hear from some of the world&#8217;s leaders on what the technology offers and where it is heading.</div>\n<div></div>\n<div><b>Submission of papers</b></div>\n<div></div>\n<div>We invite three types of submissions for AusDM 2018:</div>\n<div></div>\n<div>&#8211; Academic submissions: Regular academic submissions can be made in Research Track reporting on research progress, with a paper length up to 12 pages. For academic submissions we will use a double-blind review process, i.e. paper submissions must NOT include author names or affiliations (and also not acknowledgements referring to funding bodies). Self-citing references should also be removed from the submitted papers (they can be added on after the review) for the double blind reviewing purpose.</div>\n<div></div>\n<div>&#8211; Industry submissions: Submissions can be made in the Application Track to report on specific data mining implementations and experiences in governments and industry projects. Submissions in this category can be up to 12 pages. These submissions do not need to be double-blinded. A special committee made of industry representatives will assess industry submissions.</div>\n<div></div>\n<div>&#8211; Industry Showcase submissions: Submission from industry and government on an analytics solution that has raised profits, reduced costs and/or achieved other important policy and/or business outcomes can be made in this track with a one page Abstract only.</div>\n<div>Paper submissions are required to follow the general format specified for papers. LaTeX styles and Word templates will be available while LaTeX will be the recommended typesetting package.</div>\n<div></div>\n<div>The electronic submissions must be in PDF only, and made through the AusDM&#8217;18 Submission Page.</div>\n<div></div>\n<div><b>Important Dates</b></div>\n<div></div>\n<div>Paper Submission Closed: Friday 20 July 2018</div>\n<div>Authors Notified: Monday 1 October 2018</div>\n<div>Camera Ready Submission: Monday 15 October 2018</div>\n<div>Preliminary Program Available: Wednesday 31 October 2018</div>\n<div>Early Bird Cut-Off Date for Authors: Friday 2 November 2018</div>\n<div>Conference Dates: Wednesday 28 &#8211; Friday 30 November 2018</div>\n<div></div>\n<div></div>\n<div><b>Join us on LinkedIn:</b><a href=\"https://www.linkedin.com/groups/4907891\" target=\"_blank\" rel=\"noopener\">https://www.linkedin.com/groups/4907891</a></div>\n<div></div>\n</div>\n",
  "wfw:commentRss": "https://rdatamining.wordpress.com/2017/11/27/cfp-ausdm-2018-bathurst-australia-28-30-nov-2018/feed/",
  "slash:comments": 1,
  "media:content": {
    "media:title": "rdatamining"
  }
}