{
  "title": "Good Design in ML Applications With Konrad Piercey",
  "link": "https://neptune.ai/blog/good-design-machine-learning",
  "dc:creator": "Patrycja Jenkner",
  "pubDate": "Thu, 27 Oct 2022 06:57:43 +0000",
  "category": [
    "General",
    "Machine Learning",
    "mlops"
  ],
  "guid": "https://neptune.ai/?p=72133",
  "description": "<p>Some time ago, Konrad Piercey, a Lead Product Designer at Delivery Hero, was one of the speakers on the MLOps Community meetup in Berlin. He talked about good design in ML applications &#8211; why it’s a growing topic, what it actually means and how to start implementing it.&#160; And we thought that it’s a very [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://neptune.ai/blog/good-design-machine-learning\">Good Design in ML Applications With Konrad Piercey</a> appeared first on <a rel=\"nofollow\" href=\"https://neptune.ai\">neptune.ai</a>.</p>\n",
  "content:encoded": "\n<p>Some time ago, Konrad Piercey, a Lead Product Designer at Delivery Hero, was one of the speakers on the MLOps Community meetup in Berlin. He talked about good design in ML applications &#8211; why it’s a growing topic, what it actually means and how to start implementing it.&nbsp;</p>\n\n\n\n<p>And we thought that it’s a very interesting topic that we definitely want to learn more about. So we sat down with Konrad and asked him a few(ish) questions. Here’s the effect of our conversation!&nbsp;</p>\n\n\n\n<p>By the way, MLOps Meetups happen more and more often in different cities around the world. If you’re interested, you should <a href=\"https://www.meetup.com/pro/mlops-community/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">check the MLOps Community schedule here</a>. Maybe there’s a meeting happening in your city soon! You can also organize one &#8211; <a href=\"https://go.mlops.community/slack\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">join the MLOps Community slack channel</a> if you’re interested!&nbsp;&nbsp;</p>\n\n\n\n<p>Okay, now, we can really talk about design in ML.&nbsp;</p>\n\n\n\n<h2>What is (good) design/UX for ML?</h2>\n\n\n\n<p><strong>Patrycja</strong>: Let&#8217;s start from the basics. What is design/UX for ML? Is it anything specific for ML, or is it just the usual design? And why do you think it&#8217;s important to talk about it in the context of ML?&nbsp;</p>\n\n\n\n<p><strong>Konrad: </strong>The idea here is that a design for machine learning isn&#8217;t really an existing field. There are no machine learning designers, there are machine learning and data science engineers out there. Then there are product designers and UX/UI designers and then may contribute in some way to some elements of machine learning. But if they do, it is a very small part of the larger initiative of how machine learning is integrated into a product.</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><strong><em>The main goal of the machine learning design is to help create a better experience and a better relationship between the machine and the user.</em></strong></p>\n</blockquote>\n\n\n\n<p>How do we do it? By revealing what&#8217;s behind the curtain and how the system is operating.&nbsp;</p>\n\n\n\n<p>Because machine learning, from its early principles, is something that happens in the background. You don&#8217;t see what&#8217;s happening when it&#8217;s doing a number of calculations, building some models, and producing some output.&nbsp;</p>\n\n\n<div class=\"custom-point-list\">\n<ul>\n<li>You don&#8217;t see how that&#8217;s working.</li>\n\n\n\n<li>You also don&#8217;t see how you&#8217;re affecting the model generally.&nbsp;</li>\n</ul>\n</div>\n\n\n<p>And machine learning design is taking some fundamentals of UX/UI and applying that to the bigger product strategy behind how a company or product wants to integrate machine learning.&nbsp;</p>\n\n\n\n<p>So you take UX/UI and machine learning and add those two together.&nbsp;</p>\n\n\n\n<p>And I think if you were to ask a general person in tech what is machine learning design, they&#8217;re probably not going to mention many things that relate to the user interface, and that&#8217;s where I&#8217;m hoping to change the current industry outlook.</p>\n\n\n\n<h3>Why good design in ML apps is important?</h3>\n\n\n\n<p><strong>Patrycja</strong>: And why do you think it&#8217;s important? Why do you think users have to have this good experience with ML apps instead of just getting the results of the model?</p>\n\n\n\n<p><strong>Konrad</strong>: Well, first, I think we should state the obvious, that machine learning is fascinating and it&#8217;s amazing. Some of the greatest machine learning integrations people don&#8217;t even realize. Forget the future where machine learning is going to be most of our digital products.&nbsp;</p>\n\n\n<div class=\"custom-point-list\">\n<ul>\n<li>Take driverless cars, for instance. Driverless cars won&#8217;t ever exist without machine learning.&nbsp;</li>\n\n\n\n<li>But even more basic machine learning at the consumer level is your auto-correct on your phone. That uses ML to ensure that it’s suggesting the proper correction or proper next word.&nbsp;&nbsp;</li>\n\n\n\n<li>My favorite example, though, is the email spam filter. Your email spam filter would never exist without machine learning. All those lovely emails saying you&#8217;ve won the lottery would go right to the top of your email inbox without machine learning.&nbsp;</li>\n</ul>\n</div>\n\n\n<p>So there are different levels of integration of these. Why it&#8217;s exciting and why we need to look at it now is because machine learning is starting to integrate into more personalized experiences that really define cooperation with a product or service. You can take most large consumer applications, and they use machine learning in some way.&nbsp;</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><strong><em>Whether that&#8217;s Amazon, Facebook, YouTube, or Netflix, all of these use machine learning in order to either drive engagement or sales. And so, it&#8217;s important for users to understand how their interaction with the system is affecting their product experience.</em></strong></p>\n</blockquote>\n\n\n\n<h3>Is “good design for ML” a new thing?</h3>\n\n\n\n<p><strong>Patrycja</strong>: Do you see this need being noticed by the business? Is it something completely new, or do people already think, “okay, we need to design it in a way that people have this good experience”?</p>\n\n\n\n<p><strong>Konrad</strong>: I think it&#8217;s not totally new that data scientists and product designers try to be cautious with how they integrate and launch ML properties into their products or application. But it&#8217;s definitely not thought of at the depth at which it needs to be considered because the implications of machine learning now can affect things at an immense scale, like the critical infrastructure of electoral voting systems or moving the needle on nationwide obesity epidemics.</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><strong><em>This is stuff that machine learning now affects. We&#8217;re not just talking about your email inbox spam filter anymore. We&#8217;re talking about things that fundamentally change societies or human nature. And this is only growing with time</em></strong><em>.&nbsp;</em></p>\n</blockquote>\n\n\n\n<p>It’s also important to think about how quickly it moves forward. By the time it already has an impact, it can often be too late. So you can&#8217;t start to think of machine learning design after the fact because once you put a model in place, the impact it&#8217;s producing can already be widespread.&nbsp;</p>\n\n\n\n<p>That can be both good and bad. The widespread success of a model then can have both positive and negative outcomes.</p>\n\n\n\n<h2>The biggest challenges when designing ML products</h2>\n\n\n\n<p><strong>Patrycja</strong>: What do you think are the biggest challenges in designing ML applications in a way that they provide a good experience to people?</p>\n\n\n\n<p><strong>Konrad</strong>: The first step really starts with bringing in the team to understand how the model is working. What are the data points which you&#8217;re using to drive the model, and how are those being used to push the product forward?&nbsp;</p>\n\n\n\n<p>And normally, speaking from my experience, data science and machine learning isn&#8217;t something that often has designers (people who are user-centered) coming in and speaking on behalf of the user, on behalf of their values. So I’d say that’s part of the growing problem, but also the growing opportunity.&nbsp;</p>\n\n\n\n<p><strong>Patrycja</strong>: Talking about your experience, could mention some specific challenges for the projects that you&#8217;re working on in <a href=\"https://www.deliveryhero.com/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Delivery Hero</a>?</p>\n\n\n\n<p><strong>Konrad</strong>: Sure. So in Delivery Hero, we operate more than 12 different food delivery apps. And those 12 food delivery apps are present in over 70 countries. That&#8217;s a ton of people that we’re affecting.&nbsp;</p>\n\n\n\n<p>In just one day, for example, more than half a million people order on our platform. So talking about scale and the impact of a product, by the time our product does its job, we&#8217;ve already affected so many users:</p>\n\n\n<div class=\"custom-point-list\">\n<ul>\n<li>what they&#8217;ve ingested and eaten,&nbsp;</li>\n\n\n\n<li>potential habit changes,&nbsp;</li>\n\n\n\n<li>how they think about and perceive food and their diet,</li>\n\n\n\n<li>And the rest of their day (if you ate a really heavy meal, you might not want to exercise later, right?)</li>\n</ul>\n</div>\n\n\n<p>So eating is really intricate part of our human nature, metabolic functions, and mood.</p>\n\n\n\n<p>So at Delivery Hero, we&#8217;re looking to integrate machine learning more and more intensively because of the growing size of the organization and how many people we are affecting.&nbsp;</p>\n\n\n\n<p>And at Delivery Hero, we&#8217;re looking at machine learning in a way where we can guide users to find better products, better food, or other items which they want to order. It&#8217;s similar to any other eCommerce platform. Obviously, we are trying to make a sale, but hopefully, not doing it with any negative intentions or built-in biases programmed into the system. That&#8217;s the main goal.</p>\n\n\n\n<p>At Delivery Hero, we&#8217;re not trying to make people more unhealthy. We want people to be healthy, but we also want people to find things that they&#8217;re hungry for and to find something delicious&#8230; to feed the beast haha.</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><strong><em>So, it&#8217;s now a challenge for Delivery Hero to find the best ways to move forward with machine learning that:</em></strong></p>\n</blockquote>\n\n\n<div class=\"custom-point-list\">\n<ol>\n<li><strong><em>Helps the business grow,&nbsp;</em></strong></li>\n\n\n\n<li><strong><em>Helps people find what they&#8217;re looking for regarding the products and foods,</em></strong></li>\n\n\n\n<li><strong><em>And also create a system that doesn&#8217;t undermine the morals and values that those users have when using our platform.</em></strong></li>\n</ol>\n</div>\n\n\n<h2>How to align good user experience with business goals?</h2>\n\n\n\n<p><strong>Prince</strong>: This is really interesting. You&#8217;re seeing Delivery Hero aligning its goals with the user goals. But what is the business incentive there?</p>\n\n\n\n<p>For example, the users won&#8217;t be buying as much if they&#8217;re having the right foods which don&#8217;t make them binge eat. That means perhaps fewer sales.&nbsp;</p>\n\n\n\n<p>So how are you guys aligning those two things with your design?</p>\n\n\n\n<p><strong>Konrad</strong>: A lot of good questions. I think we can break that down into a few areas. I think there&#8217;s a section that you touched on &#8211; a user perception of the brand, loyalty brand perception.&nbsp;</p>\n\n\n\n<p>And within these different fields of balancing is what I call: the biggest balance. That&#8217;s balancing shareholder profitability and big tech with what is morally the right thing to do.&nbsp;</p>\n\n\n\n<p>Because in any large-scale business, you&#8217;re there to grow the business, to make the business profitable. And that is still ongoing. Even in Delivery Hero, I am a shareholder, and most of the staff is, and that&#8217;s what is hard.&nbsp;</p>\n\n\n\n<p>There&#8217;s no easy answer to balancing shareholder profitability with the best product experience for users. That&#8217;s why it&#8217;s a conversation, an ongoing conversation that we have all the time.&nbsp;</p>\n\n\n\n<p>But I think most businesses and organizations don&#8217;t fully realize the scale at which their technology is constantly moving and morphing (for us in Delivery Hero, it&#8217;s around our growing industry of logistics and food). Users are becoming more aware of their interaction with these large-scale businesses, whether it&#8217;s Facebook, Uber, ride-sharing, or food delivery. With the growing technology, users understand the product that they&#8217;re using (maybe a bit slower than the people making the product itself). But users understand:</p>\n\n\n<div class=\"custom-point-list\">\n<ul>\n<li>“Okay, these things are getting smarter”,&nbsp;</li>\n\n\n\n<li>“The experience, my feed, it has been uniquely crafted for me.”</li>\n</ul>\n</div>\n\n\n<blockquote class=\"wp-block-quote\">\n<p><strong><em>The users, including you and me, we&#8217;re not dumb, but we don&#8217;t always know how the technology is working. Once users get an idea of how the service may be potentially misusing them, that can have a huge detractor and effect on brand loyalty and brand perception.</em></strong></p>\n</blockquote>\n\n\n\n<p>So if I realize:</p>\n\n\n<div class=\"case-study-numbered-list\">\n    <h2></h2>\n    <ul>\n                    <li><span>1</span>One service is really pushing sales no matter what the outcome,<br />\n</li>\n                    <li><span>2</span>The other suggests items to buy, but it also says, “hey, you can set your budget to make sure you don&#8217;t overreach each month. We know not everybody&#8217;s just made of money, so let&#8217;s help you spend mindfully.” </li>\n            </ul>\n</div>\n\n\n\n<p>I think this type of value to product design is something that&#8217;s growing quite fast because users are seeing what&#8217;s happening to their digital services and how they&#8217;re often being misused against them.&nbsp;</p>\n\n\n\n<p>You can see right now the churn against Facebook, for instance. There are many competitors to it, so it&#8217;s not the main reason why Facebook is losing a large swath of younger audiences. But in large part, it&#8217;s because of brand perception and the product experience.</p>\n\n\n\n<p>Facebook isn&#8217;t the newest kid on the block when it comes to apps that have a large footprint. But with that footprint, there comes a heavy lingering shadow behind the product:</p>\n\n\n<div class=\"custom-point-list\">\n<ul>\n<li>What it means,</li>\n\n\n\n<li>What it does to people,</li>\n\n\n\n<li>How it&#8217;s used.&nbsp;</li>\n</ul>\n</div>\n\n\n<p>And businesses get ahead of that by being a bit more honest and open with users, saying, “look, we&#8217;re here to make a profit, but we also want to provide the best value, the best experience for you”.&nbsp;</p>\n\n\n\n<p>How are they doing that? How are they voicing this approach to product design through the app experience, through the UI, through the UX? That is being crafted now. That is a new field. How to engage the audience in an honest and open way while not undermining the core business values of:</p>\n\n\n<div class=\"case-study-numbered-list\">\n    <h2></h2>\n    <ul>\n                    <li><span>1</span>Growing the business, <br />\n</li>\n                    <li><span>2</span>Growing sales, <br />\n</li>\n                    <li><span>3</span>Growing engagement.</li>\n            </ul>\n</div>\n\n\n\n<p><strong>Prince</strong>: I would like to understand some of the metrics you guys are aiming at. Are you using any metrics, or did you see any difference between when you started and now?</p>\n\n\n\n<p><strong>Konrad</strong>: I can&#8217;t dig into those small details about the intricacies of how Delivery Hero is using machine learning today. A lot of it is still intellectual property, stuff that we&#8217;re building or testing, and we want to keep private for the time being.&nbsp;</p>\n\n\n\n<p>What I can say is the general outlook. Some of the things we&#8217;re hoping to build and we&#8217;re testing today are suggested content based on how you’re using the system and your surrounding elements (the region, the city you&#8217;re in.)</p>\n\n\n\n<p>All these factors are taken into account, some of them we can use more accurately, and some of them less. But these data points would be suggestions based on your previous purchases or your previous search history.&nbsp;</p>\n\n\n\n<p>We take these in, we look at these, and then we suggest material based on those criteria. This is very similar and not unlike the other digital products you&#8217;re using today.</p>\n\n\n\n<p>At its most basic principle, this is how Google search works. Based on how everybody else is searching for similar words, in your similar country, at a similar time of day. These are the data points that later produce your search results. And your search results are refined very heavily.</p>\n\n\n\n<p>When you look at a product experience that’s consumer-driven (Netflix or YouTube). These features are heavily personalized just for you. We&#8217;re all gonna have different feeds and content. And that&#8217;s a good thing, that&#8217;s helpful. That&#8217;s exactly what machine learning is supposed to do.&nbsp;</p>\n\n\n\n<p>Unfortunately, machine learning can also show you content that is overwhelming or content that is leading you down into an echo chamber. From the food side, we want to suggest the content you&#8217;re looking for. But if you constantly eat burgers on our platform, all we ever suggest to you is burgers. That&#8217;s not a healthy lifestyle, and we don&#8217;t want to do that.</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><strong><em>So that&#8217;s where this balance comes in. We take the data points that can be helpful to craft an experience that is personalized to you, but also we balance and know the other aspects which contribute to overall physical health and well-being.</em></strong></p>\n</blockquote>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><img data-attachment-id=\"72136\" data-permalink=\"https://neptune.ai/good-design-in-ml-applications-with-konrad-piercey-1\" data-orig-file=\"https://i0.wp.com/neptune.ai/wp-content/uploads/good-design-in-ml-applications-with-Konrad-Piercey-1.png?fit=1184%2C1999&ssl=1\" data-orig-size=\"1184,1999\" data-comments-opened=\"0\" data-image-meta=\"{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}\" data-image-title=\"good-design-in-ml-applications-with-Konrad-Piercey-1\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/neptune.ai/wp-content/uploads/good-design-in-ml-applications-with-Konrad-Piercey-1.png?fit=178%2C300&ssl=1\" data-large-file=\"https://i0.wp.com/neptune.ai/wp-content/uploads/good-design-in-ml-applications-with-Konrad-Piercey-1.png?fit=607%2C1024&ssl=1\" decoding=\"async\" src=\"https://i0.wp.com/neptune.ai/wp-content/uploads/good-design-in-ml-applications-with-Konrad-Piercey-1.png?resize=475%2C802&#038;ssl=1\" alt=\"Examples of good design in ML - Delivery Hero \" class=\"wp-image-72136\" width=\"475\" height=\"802\" data-recalc-dims=\"1\" /><figcaption class=\"wp-element-caption\"><em>Examples of good design in ML &#8211; Delivery Hero | Copyright Konrad Piercey</em></figcaption></figure></div>\n\n\n<p><strong>Patrycja</strong>: Maybe coming back to your specific project. In the context of understanding the ML or this demand to know what&#8217;s under the hood. Is there a difference in how people want this in different parts of the world?</p>\n\n\n\n<p><strong>Konrad</strong>: Well, I wouldn&#8217;t say that our integrations with ML are going to change drastically from one region to the next. I can only speak a little bit on behalf of my ML team, as I&#8217;m not directly a data scientist or machine learning engineer. I&#8217;m on the design side. I can talk about our cooperation and our goal vision setting. With the details of exactly which models we&#8217;re testing in each region, I can&#8217;t specify that.</p>\n\n\n\n<p>But, I would say it is not the larger goal to have some sort of radically different model for each country. You can think about it from a user experience side, the eating habits of somebody in the city center of Singapore are going to be different eating habits of somebody in Stockholm, Sweden.&nbsp;</p>\n\n\n<div class=\"case-study-numbered-list\">\n    <h2></h2>\n    <ul>\n                    <li><span>1</span>The things to eat</li>\n                    <li><span>2</span>The time of day</li>\n                    <li><span>3</span>The amount to eat</li>\n                    <li><span>4</span>Who do they eat with, </li>\n                    <li><span>5</span>How often are they doing meals together.</li>\n            </ul>\n</div>\n\n\n\n<p>These are the type of things that are more interesting from the design side. They probably do have some effect on the machine learning models (which we would use).&nbsp;</p>\n\n\n\n<h2>Examples of good and bad UX practices in ML apps</h2>\n\n\n\n<p><strong>Patrycja</strong>: So you talked a bit about those bad patterns in the UX for ML apps, like suggesting too much unhealthy food or trying to keep you watching something forever.</p>\n\n\n\n<p>I&#8217;m wondering what you think could be done to make it a more positive experience for people. What are the good UX practices for ML applications?</p>\n\n\n\n<p><strong>Konrad</strong>: Good examples are a little bit hard to come by because, honestly, we don&#8217;t have many great ones. But I can share some examples that your audience may have already seen and already engaged with, but they hadn&#8217;t realized this is machine learning design.<strong><em>&nbsp;</em></strong></p>\n\n\n\n<p>Some poor examples would be where you have engagement on a level that is unhealthy. If you look at content-driven services (whether that&#8217;s social media or news), you don&#8217;t often get a sense of your path of consumption.&nbsp;</p>\n\n\n\n<p>But right now, on your phone, you can see and set individual app limits (“I only want to use this app for this long”). This is a new feature for smartphones. This is not something that has existed for a very long time. You have to ask yourself &#8211; why does this exist now? This exists because of a growing need for it to exist. This is something users want because of our unhealthy technological habits.&nbsp;</p>\n\n\n\n<p>You can also see this happening on YouTube. YT has a timer you can set that alerts you, “You&#8217;ve been watching for an hour. Do you still want to engage with the service?”.&nbsp;</p>\n\n\n\n<p>TikTok actually has something that you&#8217;re not able to turn on or off. For some users, TikTok tested videos directly in the feed. As you were transitioning between content, a personality came on and said, “Hey, you&#8217;ve been watching a lot of content. Why don&#8217;t you take a break and step outside to get some fresh air”. This is great, but it also goes against the principle of the business to push users to engage more. Very interesting to see how industries are pushing these concepts forward of healthier habits.</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><strong><em>So at this point, you&#8217;re seeing what happens if the model has become so effective that it&#8217;s now detrimental to the user. The machine learning model is, in a way, almost too good.&nbsp;</em></strong></p>\n</blockquote>\n\n\n\n<p>This is not something that people often talk about, but that&#8217;s what&#8217;s happening. This is the concept of very progressive machine learning modeling. AI and ML are at the point when models almost become too efficient. Now people (not machines) have to put these sorts of break times, like “Hey, it&#8217;s time to take a break”, and “Hey, you might have been consuming too much”.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><img data-attachment-id=\"72137\" data-permalink=\"https://neptune.ai/good-design-in-ml-applications-with-konrad-piercey-2\" data-orig-file=\"https://i0.wp.com/neptune.ai/wp-content/uploads/good-design-in-ml-applications-with-Konrad-Piercey-2.png?fit=1132%2C1999&ssl=1\" data-orig-size=\"1132,1999\" data-comments-opened=\"0\" data-image-meta=\"{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}\" data-image-title=\"good-design-in-ml-applications-with-Konrad-Piercey-2\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/neptune.ai/wp-content/uploads/good-design-in-ml-applications-with-Konrad-Piercey-2.png?fit=170%2C300&ssl=1\" data-large-file=\"https://i0.wp.com/neptune.ai/wp-content/uploads/good-design-in-ml-applications-with-Konrad-Piercey-2.png?fit=580%2C1024&ssl=1\" decoding=\"async\" src=\"https://i0.wp.com/neptune.ai/wp-content/uploads/good-design-in-ml-applications-with-Konrad-Piercey-2.png?resize=456%2C805&#038;ssl=1\" alt=\"Examples of good design in ML - Facebook\" class=\"wp-image-72137\" width=\"456\" height=\"805\" data-recalc-dims=\"1\" /><figcaption class=\"wp-element-caption\"><em>Examples of good design in ML &#8211; Facebook | Copyright Konrad Piercey</em></figcaption></figure></div>\n\n\n<p>But as Prince said, it goes against the business model to purchase more, to spend more time. Yes, it does. But that is the judgment of moral values that must occur on the design, on the product side, and on the experience side.</p>\n\n\n\n<h2>The process of designing and building ML applications</h2>\n\n\n\n<p><strong>Patrycja</strong>: I see. So now, I&#8217;m wondering what the process looks like on your side when the designer is this extra person on the team. What does the workflow look like? When do you start cooperating with the ML team and the others?</p>\n\n\n\n<p><strong>Konrad</strong>: That&#8217;s an interesting topic because on my teams at Delivery Hero, we have the menu where you&#8217;re actually browsing products of a specific vendor, and you want to add stuff to your cart.&nbsp;</p>\n\n\n\n<p>We&#8217;re also making suggestions on that screen. And the idea here is that as the menu grows, we will make more and more types of suggestions. The menus presented will be more personalized. There will be more input from the model in order to reorganize what&#8217;s presented to you.&nbsp;</p>\n\n\n\n<p>This is the inevitable path of actually any food delivery app. Even outside of Delivery Hero, the apps will start suggesting and personalizing more and more content. They&#8217;re already doing this. But this will become a larger part of the product experience.</p>\n\n\n\n<p>What&#8217;s important is that on my team, we started asking questions:</p>\n\n\n<div class=\"case-study-numbered-list\">\n    <h2></h2>\n    <ul>\n                    <li><span>1</span>Where exactly is machine learning gonna come in and make an effect on users? <br />\n</li>\n                    <li><span>2</span>How would they be affected by this, in both positive and negative ways? </li>\n            </ul>\n</div>\n\n\n\n<p>You don&#8217;t just look at machine learning and say, okay, what can I do for users in order to help them find a product at the price point they are looking for. You have to ask, are there any downsides to just adding more products to the basket?&nbsp;</p>\n\n\n\n<p>We have to ask those questions simultaneously as we integrate this service.&nbsp;</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><strong><em>Integrating machine learning isn&#8217;t all positive impact. You do have to weigh the outcomes. On our side, I think what we&#8217;re trying to do, is to educate both inside the company and outside to other designers.&nbsp;</em></strong></p>\n</blockquote>\n\n\n\n<p>If you know machine learning is being used in your team, the first thing is to educate yourself on:</p>\n\n\n<div class=\"custom-point-list\">\n<ul>\n<li>How that model works,</li>\n\n\n\n<li>What data points it&#8217;s using,&nbsp;</li>\n\n\n\n<li>And then what it produces.&nbsp;</li>\n</ul>\n</div>\n\n\n<p>So, what is the input, and what is the output. That&#8217;s what machine learning is, input and output. So educate yourself and your product team on those criteria.</p>\n\n\n\n<p>From there, you can better understand how the model can be integrated and what it can or can’t do. I&#8217;m not saying make all the designers machine learning experts or take a course in machine learning, but understand the basic principles of how your model works and is being applied.&nbsp;</p>\n\n\n\n<p>From there, there are actually three steps. Three super important steps to Good Design in Machine Learning (as I like to call it) GDML:</p>\n\n\n<div class=\"case-study-numbered-list\">\n    <h2></h2>\n    <ul>\n                    <li><span>1</span>Educational<br />\n</li>\n                    <li><span>2</span>Simple <br />\n</li>\n                    <li><span>3</span>Fun</li>\n            </ul>\n</div>\n\n\n\n<p>With these three principles or pillars, that&#8217;s how we define and approach integration with machine learning. So, if we want to integrate machine learning on the menu, we look at how we can bring something educational to the user by telling them what the machine is suggesting or maybe why we&#8217;ve suggested that. Speaking a little bit more in detail on how we change their feed or that what we suggest to them is having an effect on their habits. Because, again, that&#8217;s a two-way relationship between the machine and the user.</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><strong><em>My interaction with the system changes the system. Also, what the system is displaying to me, what it&#8217;s giving me, changes me. In return, depending on what I interact with and order, this will change the system. And so that&#8217;s a symbiotic relationship that machine learning starts to build between users and the product.&nbsp;</em></strong></p>\n</blockquote>\n\n\n\n<p>But again, educational, simple, and fun:</p>\n\n\n<div class=\"custom-point-list\">\n<ol>\n<li>Educate &#8211; try to show something to users they didn&#8217;t know before. Try to teach them something new and valuable which is not naturally understood. That&#8217;s educational.&nbsp;</li>\n</ol>\n</div>\n\n<div class=\"custom-point-list\">\n<ol start=\"2\">\n<li>Keep it simple &#8211; if we want to educate the user on something relating to ML or the model in the background, we&#8217;re not gonna teach them the data attributes of how things are going in or how things are coming out. We&#8217;re not trying to write a book or have them read a book on these complex mathematics.&nbsp;</li>\n</ol>\n</div>\n\n\n<p>Show them a simple graphic. That&#8217;s generally the approach we wanna take. We know that the phrase: pictures speak 1000 words. UX copy is super important here. We don&#8217;t want to lecture the user, we want to keep the language simple.</p>\n\n\n<div class=\"custom-point-list\">\n<ol start=\"3\">\n<li>And the last one is fun &#8211; we needed to add this one because, at the end of the day, machine learning, AI, and deep learning can be really complicated topics. And I think for a lot of people, it may be naturally uninteresting if it&#8217;s not easy to digest.&nbsp;</li>\n</ol>\n</div>\n\n\n<p>So trying to find a way to create some visual language or graphic that uses fun colors or fun animations to be a bit more humanistic. We want to try to put a smile on some users&#8217; faces (I think the world could generally use a few more smiles in it). So trying to create a fun and engaging experience is also part of that.</p>\n\n\n\n<p><strong>Prince:</strong> How do you make people want to learn?&nbsp;</p>\n\n\n\n<p><strong>Konrad</strong>: Again, back to our values. Those three values or principles can be generally summarized in two words.&nbsp;</p>\n\n\n<div class=\"case-study-numbered-list\">\n    <h2></h2>\n    <ul>\n                    <li><span>1</span>Transparency</li>\n                    <li><span>2</span>Disclosure</li>\n            </ul>\n</div>\n\n\n\n<p>Transparency and disclosure are sorts of our leading lights whenever we approach ML integrations. I think the design community also is approaching ML/AI/DL in this manner. We want to be transparent and disclose when there is a machine making decisions on behalf of people.</p>\n\n\n\n<p>Transparency and disclosure are actually often legally binding rules in countries&#8217; laws. This is a huge facet of UX principles that many large organizations are not aware of, and it could potentially put them at legal risk. If we look at UNESCO (where 200+ countries are member states), they actually adopted the first-ever AI ethics guideline, which states, “people should be fully informed when a decision is informed by or is made on the basis of AI algorithms”.&nbsp;</p>\n\n\n\n<p>So we&#8217;re not talking about machine learning and design in some abstract way. As in, “we can maybe cut some corners here and do some things there,” that may not be the best for users, but it&#8217;s going to help the business. Or even not thinking about the user at all &#8211; that&#8217;s a scary thought. Let&#8217;s just only think about increasing engagement and let that be the first priority, this type of strategy isn&#8217;t going to get you very far, in fact, it might be endangering your business.</p>\n\n\n\n<p>Well, I think you&#8217;re gonna find that very soon within a lot of countries, and even businesses (sometimes they have their own internal guidelines for AI and ML) release newly updated rules for ethics and guidelines.</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><strong><em>So, as I said, people should be fully informed when a decision is made on the basis of AI algorithms.</em></strong>&nbsp;</p>\n</blockquote>\n\n\n\n<p>Most of the products we&#8217;ve already talked about today are doing this. They are suggesting content or showing you content, not because you necessarily want to see that content, but because it&#8217;s making an assumption you want to see that. And this assumption is being done on behalf of the machine.&nbsp;</p>\n\n\n\n<p>And when you don&#8217;t like the content, you do have some options. There is this little hamburger menu, or three-dot menu, where you can choose “hey, I&#8217;m not interested in this” or “don&#8217;t show me this anymore”.&nbsp;</p>\n\n\n\n<p>But generally speaking, those algorithms are hidden behind a deeper menu, a deeper layer, and it&#8217;s usually on a per-content basis. That means that I can decide whether or not I want to see this video or post, but it&#8217;s not giving me any analytical data as a whole. I don&#8217;t know how I&#8217;m consuming content there or what path I&#8217;m moving forward down.&nbsp;</p>\n\n\n\n<p>In the food delivery space, it’s actually much easier. We have a much easier guiding light for us compared to social media, news, music, or movies. Well, the human body has very easy guidelines on what is and what isn&#8217;t good for us. Of course, this changes from person to person throughout the world.&nbsp;</p>\n\n\n\n<p>But as an example, the WHO has a standard for public health. One of these numbers is for the average adult, they should consume at least 400 grams of fruit and vegetables per day (this is not an exact number for every single person. It depends on your weight, your height, your region, and other factors. . So local standards have to be taken into effect).&nbsp;</p>\n\n\n\n<p>So whether it&#8217;s these AI and ML ethics guidelines, or clear health standards from the WHO, users need to be aware of how their product is affecting them and how the machine is making decisions on their behalf. As we&#8217;ve said, even suggesting on behalf of them &#8211; this also counts because they&#8217;re consuming, they&#8217;re engaging.</p>\n\n\n\n<p>And as Prince said, that can be hard sometimes because you have to balance that with the growth of the business. You don&#8217;t want to put people off by potentially limiting their choices. That&#8217;s not what Delivery Hero wants to do. We don&#8217;t want to limit people&#8217;s choices. Nor would Netflix or Instagram want to stop people from watching a movie or from reading a post.&nbsp;</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><strong><em>That&#8217;s not the idea to limit the content, to draw a hard line. It&#8217;s just to inform the user. And machine learning design, or GDML, is all about that. Not about saying what&#8217;s right or wrong but about guiding the user to more information so that they can be better informed. We only want to inform.</em></strong></p>\n</blockquote>\n\n\n\n<h2>What’s next for a good design in ML?</h2>\n\n\n\n<p><strong>Prince:</strong> You talked about limits in services that are based on machine learning. I am wondering, in terms of good design ML, or probably the next few steps, do you see imposing or adding limits or summary statistics to applications in ML becoming a standard?&nbsp;</p>\n\n\n\n<p><strong>Konrad</strong>: If the question is whether we want to give users the ability to turn off the algorithm &#8211; I don&#8217;t think that&#8217;s gonna happen any time soon. Nor do I think it’s the best thing to do. I think giving the user options to reset their algorithm, or to totally turn it off, may not be that beneficial.</p>\n\n\n\n<p>For instance, if you take your YouTube account, I don&#8217;t know how helpful that would be for the users to just turn off their algorithms. That&#8217;s gonna be very strange. Of course, if they really want to do that, I could just make a new account and start from scratch. But there is no button on YouTube that says &#8220;reset my algorithm&#8221;. It&#8217;s always just constantly feeding into what you consume, whether that&#8217;s like your Google search history or what you&#8217;re actually watching on YouTube.&nbsp;</p>\n\n\n\n<p>I&#8217;d say probably the growing trend is more looking at the broader awareness of what we&#8217;re going to give to users, e.g., the statistics you mentioned. Bringing a broader awareness of what the machine has learned about them and giving users some insight into it. Again, coming back to the first principle of GDML. Education, showing some of those statistics, is gonna be a large fundamental part of it.&nbsp;</p>\n\n\n\n<p>One of my favorite examples is if you use Spotify, perhaps you&#8217;ve seen your end-of-year summary, they call it &#8220;Wrapped&#8221;. Have you guys seen that? That is GDML. However, it&#8217;s only a surface-level implementation of what we&#8217;ve been talking about so far for good design machine learning. Your end-of-year summary Wrapped on Spotify shows you how you have affected the system and how the system affected you. It shows you how many songs you consume and how many hours you listen to. They can even break that down into morning, afternoon, and evening. They&#8217;re showing you how your data is unique in the system. Also, based on its suggestions to you, it shows you, “hey, you&#8217;ve discovered x number of artists, and you&#8217;re in the x percentile of this genre for people who listen to similar music as you. ?”. That is the start of GDML.&nbsp;</p>\n\n\n\n<p>However, I want to make an important note that even though this is a nice example of modern GDML, Spotify summary wrap doesn&#8217;t actually show any deeper level value to the user. It&#8217;s showing very surface-level numbers, stuff that wouldn&#8217;t necessarily help the user in any way. It&#8217;s just somewhat interesting. A key factor to good design in machine learning is to educate the user on something actually useful, not just frivolous data.</p>\n\n\n\n<p>The mock visual examples I&#8217;ve shared with you (Food Delivery app, Facebook, Amazon) show how we can bring a deeper level of meaning using GDML by showing statistics and relevant data to the user. In these draft examples, users go away learning something that has some deeper level of meaning or value to their life, habits, consumption, or purchases.</p>\n\n\n<div id=\"block_0f45e5b90102b77346c7a189258c5034\" class=\"separator separator-20\"></div>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><img data-attachment-id=\"72138\" data-permalink=\"https://neptune.ai/good-design-in-ml-applications-with-konrad-piercey-3\" data-orig-file=\"https://i0.wp.com/neptune.ai/wp-content/uploads/good-design-in-ml-applications-with-Konrad-Piercey-3.png?fit=1999%2C1099&ssl=1\" data-orig-size=\"1999,1099\" data-comments-opened=\"0\" data-image-meta=\"{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}\" data-image-title=\"good-design-in-ml-applications-with-Konrad-Piercey-3\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/neptune.ai/wp-content/uploads/good-design-in-ml-applications-with-Konrad-Piercey-3.png?fit=300%2C165&ssl=1\" data-large-file=\"https://i0.wp.com/neptune.ai/wp-content/uploads/good-design-in-ml-applications-with-Konrad-Piercey-3.png?fit=1024%2C563&ssl=1\" decoding=\"async\" src=\"https://i0.wp.com/neptune.ai/wp-content/uploads/good-design-in-ml-applications-with-Konrad-Piercey-3.png?resize=832%2C458&#038;ssl=1\" alt=\"Examples of good design in ML - Amazon page\" class=\"wp-image-72138\" width=\"832\" height=\"458\" data-recalc-dims=\"1\" /></figure></div>\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full is-resized\"><img data-attachment-id=\"72139\" data-permalink=\"https://neptune.ai/good-design-in-ml-applications-with-konrad-piercey-4\" data-orig-file=\"https://i0.wp.com/neptune.ai/wp-content/uploads/good-design-in-ml-applications-with-Konrad-Piercey-4.png?fit=818%2C566&ssl=1\" data-orig-size=\"818,566\" data-comments-opened=\"0\" data-image-meta=\"{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}\" data-image-title=\"good-design-in-ml-applications-with-Konrad-Piercey-4\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/neptune.ai/wp-content/uploads/good-design-in-ml-applications-with-Konrad-Piercey-4.png?fit=300%2C208&ssl=1\" data-large-file=\"https://i0.wp.com/neptune.ai/wp-content/uploads/good-design-in-ml-applications-with-Konrad-Piercey-4.png?fit=818%2C566&ssl=1\" decoding=\"async\" src=\"https://i0.wp.com/neptune.ai/wp-content/uploads/good-design-in-ml-applications-with-Konrad-Piercey-4.png?resize=749%2C518&#038;ssl=1\" alt=\"Examples of good design in ML - Amazon metrics\" class=\"wp-image-72139\" width=\"749\" height=\"518\" data-recalc-dims=\"1\" /><figcaption class=\"wp-element-caption\"><em>Examples of good design in ML &#8211; Amazon | Copyright Konrad Piercey</em></figcaption></figure></div>\n\n\n<p>Spotify is a nice example because it shows what it means to peek behind the curtain of the algorithm. These statistics of how much you consume that song in the year versus everybody else etc., you would never know that by default. They show you these because it&#8217;s interesting, it’s about you personally. And that&#8217;s why people like it. It&#8217;s about me. It shows why I’m special. But it doesn&#8217;t go beyond that really surface-level projection of information.</p>\n\n\n\n<h2>How to measure if design improvements affect users?</h2>\n\n\n\n<p><strong>Patrycja</strong>: After implementing some good design practices in ML, do you somehow test or check if users start to use the application differently or they limit the usage? Or the opposite, maybe they use it even more now that they are informed. Do you have this data?</p>\n\n\n\n<p><strong>Konrad</strong>: Inside Delivery Hero and our family of food apps, we&#8217;re not gonna know the real results for some time, but we do know:</p>\n\n\n<div class=\"custom-point-list\">\n<ul>\n<li>what users are asking for,&nbsp;</li>\n\n\n\n<li>the solutions that we&#8217;re building,&nbsp;</li>\n\n\n\n<li>and the process that I&#8217;ve shown to you today (educate, keep it simple, try to make it fun).</li>\n</ul>\n</div>\n\n\n<p>As well as those principles of trying to be transparent and disclose how the model is working. These are our best efforts to provide what&#8217;s right for the customer.</p>\n\n\n\n<p>But on the part of impact and validation, how do we know what we&#8217;ve built is meaningful? Well, there are some ways to find out, and there are some processes and standards which are helpful.&nbsp;</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><strong><em>You need to contrast soft qualitative metrics against hard quantitative metrics.&nbsp;</em></strong></p>\n</blockquote>\n\n\n\n<p>What we&#8217;re talking about here is user interviews vs. live data analytics. So things like whether people use the product more after they&#8217;ve viewed some bar graph showing usage of the system or whether they&#8217;re eating more noodles and pizza at night versus in the afternoon.&nbsp;</p>\n\n\n\n<p>So checking, after a user has engaged/seen content related to their machine learning algorithm, how they&#8217;re going to continue engaging with the product. You can tell some of that by data analytics. But you also have to contrast that against user interviews because some of that won&#8217;t be able to be told by just the base numbers. You need to do interviews and studies. So spending some time on research and user research is never a waste of time.&nbsp;</p>\n\n\n<div class=\"case-study-numbered-list\">\n    <h2></h2>\n    <ul>\n                    <li><span>1</span>Eye tracking, <br />\n</li>\n                    <li><span>2</span>Dwell time, <br />\n</li>\n                    <li><span>3</span>Click-through rates, </li>\n            </ul>\n</div>\n\n\n\n<p>All this stuff is super helpful. So all that can help you validate the impact of your GDML.</p>\n\n\n\n<p>I will make a specific statement about using click-through rates. Let&#8217;s say you have some GDML component that helps educate the user on the algorithm and the product experience: how it&#8217;s changing, how they&#8217;re changing it, and how it&#8217;s changing them. If you do have some specific component that people can click on and learn more about their data, you should have that CTA very non-intrusive. So it really shouldn&#8217;t be visually screaming at the user, but it should be there if they want to click on it and learn more. But it shouldn&#8217;t be yelling at them like,” you need to take a look at this now! You should investigate your data, that would just sound scary.&nbsp;</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><strong><em>Again. We&#8217;re not trying to scare the user or make this a critical part of the user flow or user experience. But we&#8217;re giving them, what&#8217;s most important, the opportunity to learn more if they&#8217;d like to learn more. We&#8217;re not hiding this stuff. We don&#8217;t wanna make it to seem like we&#8217;re hiding anything that is potentially affecting their mental or physical health.</em></strong></p>\n</blockquote>\n\n\n\n<p>Also, it’s worth mentioning that, in many cases, companies don’t hide that information intentionally. They often don&#8217;t even necessarily know what the system is doing or what effect it has on the user.</p>\n\n\n\n<p>Let’s take Facebook in the U. S. &#8211; the fake news propagation. They didn&#8217;t know fake news was a problem till it already was a problem and wrecked havoc for a critical US election. So that shows that once machine learning at scale is applied, the effects are much faster than what you might imagine because that&#8217;s the nature of machine learning and product consumption on a user&#8217;s part.&nbsp;</p>\n\n\n\n<p>If it&#8217;s propagating information or propagating sales or making suggestions, we should know:&nbsp;</p>\n\n\n<div class=\"custom-point-list\">\n<ul>\n<li>What is that doing to the user?&nbsp;</li>\n\n\n\n<li>How can we inform them before we know, as a product, what is good or bad for them?&nbsp;</li>\n</ul>\n</div>\n\n\n<p>That&#8217;s why GDML is so powerful, it keeps the user informed so that they can make a decision on what they think is healthy for them.&nbsp;</p>\n\n\n\n<p><strong>Patrycja</strong>: It is also touching what you said before that before educating users about the product, people also have to educate themselves. They need to understand the tool and what the algorithm is doing before they even can share this info with others.</p>\n\n\n\n<p><strong>Konrad</strong>: Yeah, it&#8217;s something new that designers and product people will have to start implementing into their own internal processes. Just five years ago, I didn&#8217;t have to worry about ML or deep learning or any of this algorithmic learning. It wasn&#8217;t part of my process or methodology as a designer.&nbsp;</p>\n\n\n\n<p>But now, when machine learning is integrated into almost any digital consumer experience, designers really have to take a step forward and start participating in those conversations. Both learn about ML, in general (how it works), but also specifically inside their teams (how they&#8217;re planning to use it, how they want to apply it). That will be part of the growing portfolio of needs from new people in the product and design space.</p>\n\n\n\n<h2>How can Data Scientists and ML Engineers help UX designers?</h2>\n\n\n\n<p><strong>Patrycja</strong>: Following up on what you said, let’s go to the other side of this process. Is there anything machine learning people, like data scientists and ML engineers, can do to make it easier for you to design this product in a better way?</p>\n\n\n\n<p><strong>Konrad</strong>: I would say, if you&#8217;re a machine learning engineer or data scientist, strike up a random conversation with one of your fellow product or design people. Make new friends there.</p>\n\n\n\n<p>The interaction between machine and user, between data science and UX, is becoming so intricate now that it&#8217;s hard for us to understand how best to move forward. These things are just being defined now. Designing machine learning is not an industry that currently exists. It is a burgeoning field.&nbsp;</p>\n\n\n\n<p>So, anybody who&#8217;s super interested in it, if you are going to get ahead on that curve, you have to know how to speak about the information in a way that&#8217;s personal, that is humanistic, and you can only speak about it if you know what you&#8217;re talking about. This is not a call out for every designer to become a machine learning engineer or every machine learning engineer to take a boot camp on UX.&nbsp;</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><strong><em>It&#8217;s about sort of linking arms and moving forward together to create product experiences that we&#8217;re proud of. To create products for the people who come after us, for our kids, for your grandparents, and for the people who are long after once, we&#8217;re dead. </em></strong></p>\n\n\n\n<p><strong><em>We have to set an industry standard for what is right here because we&#8217;re no longer creating static product experiences, these products are, in a way, sort of growing organisms themselves. </em></strong></p>\n\n\n\n<p><strong><em>The product experiences we now craft are moving, flexing, and vicious in their nature. And the machines, our newest friends, are part of that. So we have to learn how to integrate with that properly.</em></strong></p>\n</blockquote>\n\n\n\n<h2>Most important design principles&nbsp;</h2>\n\n\n\n<p><strong>Prince</strong>: Yes, that makes sense! Before we finish, I wanted to ask you, what are your top three things, principles, or must-haves, when designing UX/UI design before releasing any machine learning application or your first iteration of the product?&nbsp;</p>\n\n\n\n<p><strong>Konrad</strong>: Wow, I would say:</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><strong><em>Get to know your audience and become your audience. As you&#8217;re only able to build a great experience if you know and can connect empathetically with your users and with your customers. So that&#8217;s the most important.&nbsp;</em></strong></p>\n</blockquote>\n\n\n\n<p>And that&#8217;s what being a product designer is.&nbsp;</p>\n\n\n<div class=\"case-study-numbered-list\">\n    <h2></h2>\n    <ul>\n                    <li><span>1</span>Try to break the product,<br />\n</li>\n                    <li><span>2</span>Talk to the people you&#8217;re affecting, <br />\n</li>\n                    <li><span>3</span>And if possible, use what you&#8217;re building. That&#8217;s a super important part.</li>\n            </ul>\n</div>\n\n\n\n<p>I think even big businesses today don&#8217;t do that enough. And it&#8217;s sometimes difficult to ensure that everybody working on the product really engages with that product, uses it, and tries to be a part of the experience instead of just designing or building something which you don&#8217;t really have the perspective on what is in the end experience.&nbsp;</p>\n\n\n\n<h2>Good Desing Machine Learning (GDML) community</h2>\n\n\n\n<p><strong>Patrycja</strong>: Okay, the final question is about the GDML community or the movement…</p>\n\n\n\n<p><strong>Konrad</strong>: The movement… hah, sounds like I&#8217;m starting an army here, “If you want to join the ranks of GDML, I&#8217;m gonna post a signup sheet”.</p>\n\n\n\n<p><strong>Patrycja</strong>: Not yet, but who knows?</p>\n\n\n\n<p><strong>Konrad</strong>: So GDML, it&#8217;s the phrase we found that best summarizes our attitude toward creating a better user experience where ML, deep learning, and AI are involved, and that stands for Good Design Machine Learning. <a href=\"https://knpdesign.co/gdml.html\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Learn more about GDML</a></p>\n\n\n\n<p>We want to be good. We want to do good. We want to design good. And with GDML, we&#8217;re just trying to find other people who are interested in this topic. That&#8217;s the main thing. People who are interested to learn more, who are interested in progressing in this field.&nbsp;</p>\n\n\n\n<p>Currently, I&#8217;m acting as a pseudomoderator in this group and in my own specific areas, but we&#8217;re eagerly looking for engineers, data scientists, designers, and anybody else who wants to help communicate GDML in their own company or maybe start a meet up in their own community.</p>\n\n\n\n<p>As a side gig, I&#8217;m also working on completing my first book, on GDML, as you might have assumed. We will hopefully see that coming out sometime soon, but I won&#8217;t remark on it too much until it&#8217;s on the shelves.</p>\n\n\n\n<p><strong>Patrycja</strong>: Okay, perfect. Thank you for sharing your experience!</p>\n\n\n\n\n<div id=\"author-box-new-format-block_39f96350d5a664aea8dcf1158b814db5\" class=\"article__footer article__author\">\n  <div class=\"article__authorImage\">\n          <img width=\"200\" height=\"200\" src=\"https://i0.wp.com/neptune.ai/wp-content/uploads/Konrad-Piercey.png?fit=200%2C200&ssl=1\" class=\"article__authorImage-img\" alt=\"\" decoding=\"async\" data-attachment-id=\"72140\" data-permalink=\"https://neptune.ai/konrad-piercey\" data-orig-file=\"https://i0.wp.com/neptune.ai/wp-content/uploads/Konrad-Piercey.png?fit=200%2C200&ssl=1\" data-orig-size=\"200,200\" data-comments-opened=\"0\" data-image-meta=\"{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}\" data-image-title=\"Konrad-Piercey\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/neptune.ai/wp-content/uploads/Konrad-Piercey.png?fit=200%2C200&ssl=1\" data-large-file=\"https://i0.wp.com/neptune.ai/wp-content/uploads/Konrad-Piercey.png?fit=200%2C200&ssl=1\" />      </div>\n\n  <div class=\"article__authorContent\">\n          <h3 class=\"article__authorContent-name\">Konrad Piercey </h3>\n    \n          <p class=\"article__authorContent-text\">Konrad leads founders and their teams to understand successful product &#038; experience design methodologies, merging business development with user experience and product design.\n\nKonrad is a product steward and IOT guru, interested in the way consumers connect with changing digital landscapes. With 10+ years in UX/UI design and launches in the US, EU, and Asia, he loves building unusual products. Mentoring teams to best understand their potential and be industry leaders. Konrad guides organizations on how to achieve their goals and create impactful products.\n</p>\n    \n          <ul class=\"article__authorSocial\">\n        <li class=\"article__authorSocial-single article__authorSocial-name\">Follow me on</li>\n        \n                  <li class=\"article__authorSocial-single\"><a href=\"https://www.linkedin.com/in/konradpiercey/\" class=\"article__authorSocial-lk\" target=\"_blank\"></a></li>\n        \n              </ul>\n    \n  </div>\n</div>\n\n\n<div class=\"is-layout-flow wp-block-group\"><div class=\"wp-block-group__inner-container\">\n<hr class=\"wp-block-separator has-css-opacity\"/>\n\n\n\n<p class=\"has-text-color\" style=\"color:#4455a6\"><strong>READ NEXT</strong></p>\n\n\n\n<h2>MLOps: What It Is, Why it Matters, and How To Implement It</h2>\n\n\n\n<p class=\"has-small-font-size\">13 mins read | Prince Canuma | Posted January 14, 2021</p>\n\n\n<div id=\"block_5ffc75def9f8e\" class=\"separator separator-10\"></div>\n\n\n\n<p>According to techjury, every person created at least 1.7 MB of data per second in 2020. For data scientists like you and me, that is like early Christmas because there are so many theories/ideas to explore, experiment with, and many discoveries to be made and models to be developed. </p>\n\n\n\n<p>But if we want to be serious and actually have those models touch real-life business problems and real people, we have to deal with the essentials like:</p>\n\n\n<div class=\"custom-point-list\">\n<ul><li>acquiring & cleaning large amounts of data;</li><li>setting up tracking and versioning for experiments and model training runs;</li><li>setting up the deployment and monitoring pipelines for the models that do get to production.&nbsp;</li></ul>\n</div>\n\n\n<p>And we need to find a way to scale our ML operations to the needs of the business and/or users of our ML models.</p>\n\n\n\n<p>There were similar issues in the past when we needed to scale conventional software systems so that more people can use them. DevOps’ solution was a set of practices for developing, testing, deploying, and operating large-scale software systems. With DevOps, development cycles became shorter, deployment velocity increased, and system releases became auditable and dependable.</p>\n\n\n\n<p>That brings us to&nbsp;<strong>MLOps</strong>. It was born at the intersection of&nbsp;<strong>DevOps</strong>,&nbsp;<strong>Data Engineering,</strong>&nbsp;and&nbsp;<strong>Machine Learning</strong>, and it’s a similar concept to DevOps<strong>,&nbsp;</strong>but the execution is different. ML systems are experimental in nature and have more components that are significantly more complex to build and operate.</p>\n\n\n\n<p>Let’s dig in!</p>\n\n\n<a class=\"button continous-post blue-filled\" href=\"/blog/mlops\" target=\"_blank\">\n    Continue reading -></a>\n\n\n\n<hr class=\"wp-block-separator has-css-opacity\"/>\n</div></div>\n<p>The post <a rel=\"nofollow\" href=\"https://neptune.ai/blog/good-design-machine-learning\">Good Design in ML Applications With Konrad Piercey</a> appeared first on <a rel=\"nofollow\" href=\"https://neptune.ai\">neptune.ai</a>.</p>\n",
  "post-id": 72133
}