{
  "id": "yt:video:jLEeETqgSFA",
  "yt:videoId": "jLEeETqgSFA",
  "yt:channelId": "UCTUtqcDkzw7bisadh6AOx5w",
  "title": "Understanding Everybody Wants To Rule The World",
  "link": "",
  "author": {
    "name": "12tone",
    "uri": "https://www.youtube.com/channel/UCTUtqcDkzw7bisadh6AOx5w"
  },
  "published": "2022-04-01T17:00:33+00:00",
  "updated": "2022-04-08T15:12:59+00:00",
  "media:group": {
    "media:title": "Understanding Everybody Wants To Rule The World",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Tears For Fears were famous for their meticulous production, spending months dialing in the exact sounds they needed to make their audacious synthpop anthems work. But what would happen if you took that attention to detail and forced them to make a whole song, start to finish, in like 2 weeks? Well, that's how you get Everybody Wants To Rule The World. It was a last-minute addition, conceived and created at the very end of the production process for the album, but that risk paid off.\n\nPatreon: https://www.patreon.com/12tonevideos\nMerch: http://standard.tv/12tone\nDiscord: https://discord.gg/pq2QBEw\nFacebook: https://www.facebook.com/12tonevideos\nTwitter: https://twitter.com/12tonevideos\nTwitch: https://www.twitch.tv/12tonevideos\nEmail: 12tonevideos@gmail.com\n\nLast: https://youtu.be/quOLtE0wfAo\nRick's video: https://youtu.be/6bU4R04fH4U\n\nScript: https://tinyurl.com/2p8bnwfk\n\nHuge thanks to our Elephant Club members:\n\nSusan Jones\nJill Jones\nDuck \nHoward Levine\nBrian Etheredge\nKhristofor Saraga\nLen Lanphar\nKen Arnold\nElaine Pratt\nWilliam (Bill) Boston\nChris Prentice\nJack Carlson\nChristopher Lucas\nAndrew Beals\nDov Zazkis\nHendrik P\nThomas Morley\nJacob Helwig\nWarren Huart\nKevin Wilamowski\nDavis Sprague\nGrant Aldonas\nAlex Knauth\nBraum Meakes\nHendrik Stüwe\nDan Bonelli\nKevin Boyce\nKelly Christoffersen\nDonal Botkin\nScott Howarth\nLuke\nStephen Cook\nDavid Bartz\nSymmetry\nDhruv Monga\nKen Jones\nObadiah Wright\nKobalent\nCarlos Rendon\nAleksandar Milojković\nKylie McInnes\nJody \nDaniel Reaman\nTom\nPhilRosas \nReiji Kobayashi\nMISLS\nNeil Moore\n\nAnd thanks as well to Henry Reich, Gabi Ghita, Gene Lushtak, Owen Campbell-Moore, Eugene Bulkin, Logan Jones, Oliver, Anna Work, Adam Neely, Rick Lees, Dave Mayer, CodenaCrow, Nikolay Semyonov, Arnas, Caroline Simpson, Michael Alan Dorman, Blake Boyd, Luke Rihn, Charles Gaskell, Ian Seymour, Trevor Sullivan, Tom Evans, Lamadesbois, JH, David Conrad, Chris Chapin, Chris Borland, Todd Davidson, Elliot Burke, Tim S., Elias Simon, Jake Lizzio, Jerry D. Brown, Ohad Lutzky, Aaron Epstein, Chris Connett, Peter Leventis, Kenneth Kousen, James, h2g2guy, W. Dennis Sorrell, James A. Thornton, Brian Dinger, Professor Elliot, Stefan Strohmaier, Shadow Kat, Adam Wurstmann, Kelsey Freese, Angela Flierman, Richard T. Anderson, Andrew Engel, Kevin Johnson, Ryan, Rodrigo \"rrc2soft\" Roman, Jeremy Zolner, Patrick Callier, Danny, Francois LaPlante, Volker Wegert, Joshua Gleitze, Britt Ratliff, Darzzr, Joshua La Macchia, Peter Brinkmann, Alexey Fedotov, Alex Keeny, Valentin Lupachev, John Bejarano, Gary Butterfield, naomio, Alex Mole, Steve Brand, Rene Miklas, Red Uncle, Kaisai Morihito, Doug Nottingham, Nicholas Wolf, Betsy, Tonya Custis, Dave Shapiro, Jacopo Cascioli, Rafael Martinez Salas, Walther, Robert Beach, Jason Nebergall, Graeme Lewis, Jake Sand, Mathew Wolak, S, Lincoln Mendell, Aditya Baradwaj, Sam Rezek, Destros, Lucas Augusto, Juan Madrigal, Evan Satinsky, James Little, RaptorCat, Jim Hayes, Scott Albertine, Jigglypuffer, leftaroundabout ., Jens Schäfer, Mikely Whiplash, Austin Amberg, Francisco Rodrigues, Elizabeth, Michael Tsuk, רועי סיני, Conor Stuart Roe, ThoraSTooth, Brandon Legawiec, Dragix PL, Evgeni Kunev, Hikaru Katayamma, Alon Kellner, Rob Hardy, Gary Evesson, Kottolett, Dylan Vidas, Patrick Chieppe, Eric Stark, David Haughn, Gordon Dell, Byron DeLaBarre, Matty Crocker, anemamata, Brian Miller, Lee-orr Orbach, Eric Plume, Kevin Pierce, Jon Hancock, Jason Peterson, Peggy Youell, EJ Hambleton, Jos Mulder, Daryl Banttari, J.T. Vandenbree, Brian Davis, Pamela O'Neill, Thomas Morgan, Ludwick Kennedy, Wayne Robinson, Gabriel Totusek, Ridley Kemp, Mark James, SecretKittehs, Mnemosyne Music, AkselA, Philip Miller, Sam Plotkin, David MacDonald, Nellie Speirs Baron, Charles R., Joshua Lewis, Adam Ziegenhals, Mark, Amelia Lewis, Sam, DialMForManning, Wayne Weil, Michael Wehling, PatSandmann, Brandon Peckham, Kristofer Hill, William Merryman, Ryan Mayle, J Denton, James, David T Peterson, Bryan C. Mills, Justin St John-Brooks, Mark Lacey, Jaren Tilford, Catherine Berry, Watch Harder, XCompWiz, Michael Blaby, Bean, A Devoted Servant, Milan Brezovsky, Edmund Horner, Daria Gibbons, NinoDoko, Fernando Felix, Joseph Satin, Piush Dahal, Matthew Moore, Walt Seefeld, M. Bock, Daniel Joseph Moynihan, Andrew Wyld, Josh Witkowski, not a coincidence, Graham Orndorff, Michael Sacksteder, JD White, Jeffrey Mann, Jason McPherson, Chris Robson, A.J. Yates, Matt Moulder, Leander Tietjen, Joe Johnston, Jordan Friendshuh, Alex Tafur, Chris Davis, findRED, Howl’s one-handed, Gary Backaus, Eugen Lounkine, Fernando Gros, Geoffrey Barnett, OVB_2nd, Hakim C, Joe Molloy, gunnito, מתן אריאל-הברון, Claymore Alexander, Dixon Roberts, Jay Wilson, RoxyPop, Pär Nord, Paul Tanenholz, Chris Cresswell, Chris Breault, Julio D, Justin Zboyovski, Adam Poata-Smith, J.R. Hyde, and A! Your support helps make 12tone even better!\n\nAlso, thanks to Jareth Arnold!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}