{
  "title": "505 - Monitoring the Monkeypox Response with Dr. Caitlin Rivers",
  "itunes:title": "505 - Monitoring the Monkeypox Response with Dr. Caitlin Rivers",
  "pubDate": "Mon, 15 Aug 2022 10:00:00 +0000",
  "guid": "8a77ea40-1b2d-4634-abfe-d5775d3bbfb6",
  "link": "https://johnshopkinssph.libsyn.com/505-monitoring-the-monkeypox-response-with-dr-caitlin-rivers",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Throughout the COVID pandemic, number crunching has been a way to understand and respond to the scope, spread, and spikes of outbreaks. The same goes for monkeypox. Epidemiologist</span> <strong>Dr. Caitlin Rivers</strong> <span style=\"font-weight: 400;\">talks with</span> <strong>Dr. Josh Sharfstein</strong> <span style= \"font-weight: 400;\">about what numbers should be considered to understand the full picture of the monkeypox outbreak and the effectiveness of the response. They also talk about the current limitations within public health to track down and report necessary data.</span></p>",
  "content:encoded": "<p>Throughout the COVID pandemic, number crunching has been a way to understand and respond to the scope, spread, and spikes of outbreaks. The same goes for monkeypox. Epidemiologist Dr. Caitlin Rivers talks with Dr. Josh Sharfstein about what numbers should be considered to understand the full picture of the monkeypox outbreak and the effectiveness of the response. They also talk about the current limitations within public health to track down and report necessary data.</p>",
  "enclosure": "",
  "itunes:duration": "11:47",
  "itunes:explicit": false,
  "itunes:keywords": "emergency,virus,outbreak,smallpox,Monkeypox,orthopox",
  "itunes:subtitle": "Throughout the COVID pandemic, number crunching has been a way to understand and respond to the scope, spread, and spikes of outbreaks. The same goes for monkeypox. Epidemiologist Dr. Caitlin Rivers talks with Dr. Josh Sharfstein about what numbers...",
  "itunes:season": 6,
  "itunes:episode": 505,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}