{
  "title": "The shot in the leg is a shot in the arm for Imran Khan",
  "link": "https://newsin.asia/the-shot-in-the-leg-is-a-shot-in-the-arm-for-imran-khan/",
  "comments": "https://newsin.asia/the-shot-in-the-leg-is-a-shot-in-the-arm-for-imran-khan/#respond",
  "dc:creator": "Editor",
  "pubDate": "Fri, 04 Nov 2022 02:33:43 +0000",
  "category": [
    "Around The World",
    "Pakistan",
    "Politics",
    "Terrorism",
    "Top Story"
  ],
  "guid": "https://newsin.asia/?p=78920",
  "description": "<p>Already riding a popularity wave, Pakistan’s opposition stalwart Imran Khan is set to gain immensely from the attempt on his life by a lone gunman on Thursday</p>\n<p>The post <a rel=\"nofollow\" href=\"https://newsin.asia/the-shot-in-the-leg-is-a-shot-in-the-arm-for-imran-khan/\">The shot in the leg is a shot in the arm for Imran Khan</a> appeared first on <a rel=\"nofollow\" href=\"https://newsin.asia\">NewsIn.Asia</a>.</p>\n",
  "content:encoded": "\n<p>By P.K.Balachandran</p>\n\n\n\n<p>Colombo, November 3 (newsin.asia): Pakistan’s stormy petrel Imran Khan, the founder-leader of the Pakistan Tehreek-e-Insaaf (PTI), was injured in the leg when a lone gunman opened fire with an automatic weapon at a party rally in Wazirabad in the Punjab province on Thursday. The alleged assailant, who was caught, told the police that he had tried “his best” to kill Imran because Imran was “misleading the people”.</p>\n\n\n\n<p>The fiery opposition leader was on a long march to Islamabad to force the Shehbaz Sharif government to call fresh elections to the National Assembly on the grounds that the present Assembly does not represent the people of Pakistan.</p>\n\n\n\n<p>Even as Imran was becoming popular in the last few months, especially among the poor, the educated middle class and the youth, the Pakistan Muslim League (Nawaz) government led by Shehbaz Sharif, was becoming unpopular. So was the army (called the “Establishment”). Both had reasons to feel insecure. Imran has been describing the Sharif dispensation as a bunch of thieves in cahoots with the army.</p>\n\n\n\n<p>Imran was removed from power in April through a no-confidence vote in the National Assembly. Sharif, the then-leader of the opposition, replaced him as the prime minister of a coalition of around a dozen political parties including the Pakistan Peoples’ Party (PPP) led by the rival Zardaris. Imran had accused the army of putting Sharif in power by manipulating his exit from the seat of power.</p>\n\n\n\n<p>It is not yet clear if the attempt on the life of Imran on Thursday was the act of a single person or if it was planned by a group, though the assailant told the police that no others were behind his decision to kill Imran. But whether it was an individual or a collective decision involving other political parties and/or the Establishment (the army), it has given Imran and the PTI a tremendous boost. The shot in the leg could well be a shot in the arm for Imran’s political career.&nbsp;</p>\n\n\n\n<p>Interestingly, the assassination attempt took place when Imran was softening his animosity to the PMN (L) and apparently seeking the help of the army to bring about a compromise. Imran had held an anti-government march on Islamabad in May, but it fizzled out because the police and paramilitary forces broke it up with heavy tear gas shelling. Several protesters were killed and scores of others were injured.</p>\n\n\n\n<p>It was rumored that the PTI had been holding behind-the-scenes talks with the PML (N) government on the question of the march and of mid-term elections to the National Assembly.  <em>Dawn</em> had reported that Prime Minister Shehbaz Sharif had formed a committee of ruling coalition members headed by the Interior Minister Rana Sanaullah, to hold talks with the PTI both on the long march and elections. The issue was whether elections could be advanced from October-November 2023 to April or so. </p>\n\n\n\n<p>Imran tweeted to say that no talks were on the cards. But he told an audience that he was planning a “soft revolution” ie: a democratic one and not a violent one. &#8220;There are two ways of changing. You can have a soft revolution through the ballot box or have it the other way, which causes destruction in a society,&#8221; the VOA quoted Imran as saying. He then warned: &#8220;But I believe that we are now on the brink. Either we are going to change peacefully or I&#8217;m afraid it will lead to chaos in our country.&#8221;</p>\n\n\n\n<p>And as Imran feared, the assassination attempt is likely to destroy the ground for continued talks between him and the government. The top echelons and the rank and file of the PTI are unlikely to let go of the opportunity to press for early mid-term National Assembly elections, fully exploiting the wave of sympathy sweeping through the length and breadth of Pakistan for Imran.</p>\n\n\n\n<p>The economic and political situation in Pakistan is now conducive for the ouster of the government, observers say. The government is deeply in debt to the international community and is seeking a hefty IMF bailout. Heavy rains had made millions homeless and the damage ran into US$ 30 billion. Inflation has shot through the roof.</p>\n\n\n\n<p>And the army, the steel frame of the nation and the most critical player in Pakistani politics, is now on a bad wicket having had to deny rumors that it was behind the killing of a leading journalist, Arshad Sharif, in Kenya recently. And according to Pakistani political commentator Najam Sethi, the younger officers and the rank and file of the Pakistan army have developed a liking for Imran as he is seen as being less selfish and corrupt than the dynastic Sharifs and Zardaris leading the PML(N) and the Pakistan People’s Party (PPP) respectively.</p>\n\n\n\n<p>The attempt to disqualify Imran from holding a seat in the National Assembly on the grounds that he had not revealed to the Election Commission that he was holding some assets given to the State, may also fail at the High Court level, it is said.&nbsp;</p>\n\n\n\n<p>Imran is already electorally strong. His PTI runs the provincial &nbsp;governments of Punjab, Khyber Pakhtunkhwa and Pakistan Occupied Kashmir.</p>\n\n\n\n<p>VOA quoted Imran as saying that his PTI regime was replaced in April by a government where “60% of the cabinet is on bail on corruption cases.” &nbsp;Imran asserted that while in power, he was trying to enforce law and order by bringing the two former ruling families to justice for laundering billions of dollars &#8220;to build places overseas.&#8221; Khan alleged that the federal anti-corruption autonomous body was being &#8220;controlled by the Establishment,&#8221; by which he meant the army.</p>\n\n\n\n<p>&#8220;For some reason the Establishment&#8217;s views on corruption were completely different to mine. They did not take that seriously. I kept telling them that no country can prosper if the ruling elite is siphoning off money outside the country.&#8221;</p>\n\n\n\n<p>The Wilson Center&#8217;s Michael Kugelman believes Pakistan&#8217;s leaders would be making a mistake if they try to further sideline Khan. &#8220;When you sideline a populist who enjoys mass popularity, you ultimately end up strengthening him. It&#8217;s as simple as that,&#8221; the VOA quoted Kugelman as saying.</p>\n\n\n\n<p>END</p>\n<p>The post <a rel=\"nofollow\" href=\"https://newsin.asia/the-shot-in-the-leg-is-a-shot-in-the-arm-for-imran-khan/\">The shot in the leg is a shot in the arm for Imran Khan</a> appeared first on <a rel=\"nofollow\" href=\"https://newsin.asia\">NewsIn.Asia</a>.</p>\n",
  "wfw:commentRss": "https://newsin.asia/the-shot-in-the-leg-is-a-shot-in-the-arm-for-imran-khan/feed/",
  "slash:comments": 0
}