{
  "title": "Taking the World’s Pulse on Climate Change",
  "description": "<p>As a meteorologist who doubles as a blogger and content creator for Plotly, I’m naturally drawn to data that deals with the atmosphere, both in the space of weather and climate.\n<br/><br/>\nA brief introduction: I’m Ben Noll (<a href=\"https://twitter.com/BenNollWeather\" target=\"_blank\">https://twitter.com/BenNollWeather</a>), a meteorologist for the National Institute of Water and Atmospheric Research in New Zealand. I routinely make short-term weather forecasts (minutes to weeks) and climate projections (seasonal to annual time scales).\n<br/><br/>\nThe weather is something that never goes out of style: it affects all of us every day, in one way or another. You may not think of it much during the long stretches of dry and sunny weather during the summer and autumn — but when you get an unexpected 10 minute shower during your picnic, curse the weatherman!\n<!-- more -->\n<br/><br/>\nI get it. It comes with the territory. But I assure you: weather (and climate) forecasting is far more accurate than it was even 10 years ago. We’ve come a long way. But as with all crafts, we have room to improve, particularly when it comes to communication (of extremes).\n<br/><br/></p><center><a href=\"https://plot.ly/~Dreamshot/8302/model-skill-northern-hemisphere-500-hpa-day-5-30-day-running-mean/\" target=\"_blank\"><img src=\"http://i.imgur.com/hecSDXg.png\" alt=\"Model_Skill\"/></a></center>\n<br/><br/>\nThe plot above shows something called anomaly correlation — just a fancy phrase that implies weather model skill — for the world’s three most accurate weather models. It may seem a bit noisy, but here’s the takeaway: since the start of the time series (2010), all three models have a positive (skill) trendline.\n<br/><br/>\nWhen Yale recently released its Climate Opinion Maps describing the “geographic variation in opinions on climate change at state and local scales in the USA,” I felt it would be an ideal creative outlet and also a chance to make some killer content for Plotly.\n<br/><br/>\nAt the same time, I thought it would be an excellent opportunity to share some projections for later in 2017 and how it might affect the Earth’s weather, climate and you.\n<br/><br/><h1>What is Climate Change and Global Warming?</h1>\n<br/><br/>\nClimate change, according to NASA, is a change in the typical or average weather of a region or city and/or Earth. Not only is this phrase associated with a warming Earth, but also changing precipitation patterns, sea levels, sea ice, and more.\n<br/><br/>\nOne of the largest components of our changing climate is global warming, or referring to surface temperature increases from both natural (El Niño) and anthropogenic (greenhouse gases) causes. There’s no denying that we live on a warming Earth. Land temperatures are modulated by sea temperatures, which are also rising. Both are being influenced by carbon pollution, which continues to break records year after year. The monthly average carbon dioxide concentration for March 2017 was 407 parts per million (ppm).\n<br/><br/><div><center><a href=\"https://plot.ly/~Dreamshot/2050/temperature-global-ocean-heat-content-atmospheric-co-2-global-surface-temperatur/\" target=\"_blank\"><img src=\"http://i.imgur.com/f8gHI34.png\" alt=\"Climate_Change\"/></a></center></div>\n<br/><br/>\nSeven in ten Americans think global warming is occurring. One in ten does not.\n<br/><br/><div><center><a href=\"https://plot.ly/~Dreamshot/8613/do-you-think-global-warming-is-happening/\" target=\"_blank\"><img src=\"http://i.imgur.com/SY6mOAH.png\" alt=\"Is_Global_Warming_Occurring\"/></a></center></div>\n<br/><br/><h1>Are human activities the main cause?</h1>\n<br/><br/>\nThere’s no denying the distinctive, positive relationship between global temperatures and atmospheric carbon dioxide concentration. Some individuals that are not in favor of anthropogenic climate change refer to warming oceans as the guiding hand for increased global temperatures. Warming oceans certainly play a large role, but it begs the question: why are ocean temperatures warming?\n<br/><br/>\nWhile the Earth’s climate has exhibited marked “natural” changes, with time scales varying from many millions of years down to a few years, the recent warming is most likely attributable to carbon pollution. Furthermore, El Niño events, which I’ll cover in more detail further down, are associated with semi-permanent upward steps in global temperatures, initially caused by a warming of sea surface temperatures in the eastern and central equatorial Pacific Ocean. Research has shown that El Niño events may be increasing in frequency due to human-induced climate change.\n<br/><br/>\nStates that are most convinced that global warming is caused by human activities:\n<br/>\nCalifornia (59%)\nMaryland (58%)\nNew York (58%)\n<br/><br/>\nStates that are least convinced that global warming is caused by human activities:\n<br/>\nWyoming (42%)\nUtah (43%)\nWest Virginia (44%)\n<br/><br/><div><center><a href=\"https://plot.ly/~Dreamshot/8595/global-warming-is-caused-mostly-by-human-activities/\" target=\"_blank\"><img src=\"http://i.imgur.com/r5ryCSK.png\" alt=\"Is_Global_Warming_Caused_By_Humans\"/></a></center></div>\n<br/><br/><h1>Is global warming harming you now or will it within the next 10 years (from 2016)?</h1>\n<br/><br/>\nA question posed in the Yale survey, residents of New York (57%), California (56%), and Maryland (55%) had the most bullish opinion in the “yes” direction. On the other hand, North Dakota (39%), Wyoming (39%), and West Virginia (40%) weren’t as convinced.\n<br/><br/><div><center><a href=\"https://plot.ly/~Dreamshot/8597/global-warming-is-already-harming-people-in-the-us-now-or-within-10-years-2016/\" target=\"_blank\"><img src=\"http://i.imgur.com/icKZeNU.png\" alt=\"Is_Global_Warming_Harming_Humans\"/></a></center></div>\n<br/><br/>\nWhile no one weather event is caused by climate change, all events are influenced by climate change since the atmosphere is now warmer and moister than it was in the past. Climate change increases the likelihood of extreme rainfall, given the appropriate weather setup. Research suggests that there will be up to 8% more intense rain for every 1°C of warming.\n<br/><br/>\nSince averages are a product of the extremes and extremes are expected to increase in the coming decades, it may involve more impactful tropical cyclones. Yale polled 996 resident’s of Connecticut’s coast who live in coastal flood zones and experienced a hurricane or tropical storm previously, asking the question, “generally speaking, when a hurricane or tropical storm is approaching your city or town, how worried do you feel (1–7)?\n<br/><br/>\nThe results were skewed toward the mid-upper part of the scale, with “5” receiving 22% of the vote. Since a warmer climate will hold more water vapor, climate change indirectly yield more concern and worry amongst coastal residents when it comes to tropical storms and hurricanes.\n<br/><br/><div><center><img src=\"http://i.imgur.com/BOe51wK.png\" alt=\"Worried_About_Hurricanes\"/></center></div>\n<br/><br/><h1>Natural Influences</h1>\n<br/><br/>\nEl Niño, a climate driver associated with a band of warm ocean water that develops in the central and east-central equatorial Pacific, has been associated with semi-permanent upward step changes in global temperature during and following the “event.” An El Niño event typically takes 3–6 months to develop, reaches a peak during November to January, and then declines for the following 3–6 months. The temperature rises associated with El Niño events have been disproportionate to the temperature falls during the opposite climate driver, La Niña.\n<br/><br/>\nThe natural effects from El Niño events are likely enhanced by greenhouse gas emissions, or the anthropogenic warming that continuously works in the background. And the impact(s) from El Niño events may not be entirely natural anymore — research indicates that there may be an increasing frequency of extreme El Niño events due to greenhouse warming.\n<br/><br/>\nGlobal climate modeling is now suggesting that another El Niño event is possible later in 2017, in very quick succession to the strong El Niño that occurred during 2015–16.\n<br/><br/><div><center><a href=\"https://plot.ly/~Dreamshot/8602/when-a-hurricane-or-tropical-storm-is-approaching-your-town-how-worried-do-you-f/\" target=\"_blank\"><img src=\"http://i.imgur.com/WdFbinY.png\" alt=\"El_Nino\"/></a></center></div>\n<br/><br/>\nSuch an outcome would result in yet another upward step in global temperatures, but starting from the new “baseline” that was established by the super El Niño observed during 2015–16.\n<br/><br/><div><center><a href=\"https://plot.ly/~Dreamshot/8627/mid-march-iricpc-model-based-probabilistic-enso-forecast/\" target=\"_blank\"><img src=\"http://i.imgur.com/EvtEH1x.png\" alt=\"El_Nino\"/></a></center></div>\n<br/><br/><h1>Trump not fussed</h1>\n<br/><br/>\nDuring his first two months in office, U.S. President Trump rolled back key Obama-era greenhouse gas regulations. Without these rules in place, the United States will likely fall far short of its 2015 Paris Agreement pledge: to lower emissions by at least 26 percent below 2005 levels by 2025.\n<br/><br/>\n“Mr. Trump instructed the Environmental Protection Agency to reverse course on the Obama administration’s biggest climate change policy, the Clean Power Plan, which aimed to cut emissions from existing coal- and gas-fired power plants,” writes Nadja Popovich of the New York Times.\n<br/><br/><blockquote>If implemented to its fullest extent, the plan would have reduced carbon emissions by nearly 650 megatons by 2025 — just under halfway to the Paris pledge, according to an analysis by Climate Interactive.</blockquote>\n<br/><br/><div><center><a href=\"https://plot.ly/~Dreamshot/8593/cleaner-power-plants-obama-era-policies-for-reducing-greenhouse-gas-emissions/\" target=\"_blank\"><img src=\"http://i.imgur.com/qnHBoMu.png\" alt=\"Paris_Agreement\"/></a></center></div>\n<br/><br/>\nIn the meantime, as global temperatures continue to rise, so will the number of “hot days” and likelihood for heat waves. For some, winters will become milder and the growing season longer. However, it goes well beyond just warmer temperatures — but how ecosystems will cope and respond, how we grow our food, and where and when we get our water. All those things will change, some more gradually than others.\n<br/><br/>\nWith respect to Earth’s lifeforms, the words cope and adapt may have never been more relevant. For those that can do this most efficiently will best set themselves up for the future on the ever-changing planet that we call home.\n<br/><br/><div><center><a href=\"https://plot.ly/~Dreamshot/8633/estimated-of-adults-who-support-funding-research-into-renewable-energy-sources-2/\" target=\"_blank\"><img src=\"http://i.imgur.com/qGThB0V.png\" alt=\"Renewable_Energy\"/></a></center></div>\n<br/><br/>\nPlotly is built by computational scientists with degrees and research expertise from McGill, Harvard, Stanford, and other world-class institutions. Making no-compromise open-source software for scientific visualization is our full-time job and passion. Want to support our work? Consider purchasing a Pro plan. For less than half the cost of a Tableau license, you’ll get support from our engineering staff and time-saving ways to save and share your work with colleagues, advisors, or managers.\n<br/><br/>\nPro Plans for University students and instructors ($59/year)\n<br/>\nPro Plans for industry users ($396/year)",
  "link": "https://blog.plotly.com/post/159786388702",
  "guid": "https://blog.plotly.com/post/159786388702",
  "pubDate": "Thu, 20 Apr 2017 07:15:10 -0400",
  "category": [
    "weather",
    "climate",
    "climate change",
    "climate science",
    "data",
    "data science",
    "data analysis",
    "data visualization",
    "data viz"
  ]
}