{
  "id": "yt:video:aamURk0x44w",
  "yt:videoId": "aamURk0x44w",
  "yt:channelId": "UCJYVW4HVrMWpUvvsjPQc8-Q",
  "title": "Using FOSS in Linux (or not)",
  "link": "",
  "author": {
    "name": "DorianDotSlash",
    "uri": "https://www.youtube.com/channel/UCJYVW4HVrMWpUvvsjPQc8-Q"
  },
  "published": "2021-03-23T15:56:00+00:00",
  "updated": "2022-07-18T03:30:23+00:00",
  "media:group": {
    "media:title": "Using FOSS in Linux (or not)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "I see too often people getting talked down to for not using FOSS, or for using blobs/proprietary software, bloat, a certain desktop environment or distro. This toxicity needs to stop. But most importantly, if you're one of the people who have been treated this way, you've done NOTHING wrong.  Other than breaking actual laws, you can do anything you want with your system. It's YOUR system, so don't let anyone else tell you how to run it.\n\nYes, you can be educated, and yes, some people will let you know about some things that perhaps you didn't know about, and that's fine. But my issue is when people get shamed. There's no place for this in our community. You don't know why someone is using something. Perhaps they have no choice, perhaps they can't afford to get something else, it really doesn't matter.  Now saying all this, there are also people who innocently joke around with things like this, and it's usually obvious, so be aware of that.\n\nThis is sort of a rant, yes, but it's something that's been bothering me for a while. And while I usually try to stay unbiased with my videos on most topics, there is a limit.\n\nAs the disclaimer says at the beginning of the video, I fully support FOSS and I do agree that it is one of the most important things in the Linux world, but I will never force someone's view, nor will I judge them publicly for their choices.\n\nThanks for watching!\n\nConsider supporting my channel! : https://www.patreon.com/doriandotslash\n\n#Linux #FOSS #FLOSS",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}