{
  "title": "Diagnosing Heart Diseases with Deep Neural Networks",
  "description": "<p>The <a href=\"https://www.kaggle.com/c/second-annual-data-science-bowl\">Second National Data Science Bowl</a>, a data science competition where the goal was to automatically determine cardiac volumes from MRI scans, has just ended. We participated with a team of 4 members from Ghent University and finished 2nd!</p>\n\n<!--more-->\n\n<p>The team <em>kunsthart</em> (<em>artificial heart</em> in English) consisted of <a href=\"https://www.kaggle.com/golondrina\">Ira Korshunova</a>, <a href=\"https://www.kaggle.com/jburms\">Jeroen Burms</a>, <a href=\"https://twitter.com/317070\">Jonas Degrave</a>, 3 PhD students, and professor <a href=\"https://twitter.com/jonidambre\">Joni Dambre</a>. It’s also a follow-up of last year’s team <a href=\"http://benanne.github.io/2015/03/17/plankton.html\">≋ Deep Sea ≋</a>, which finished in first place for the <a href=\"https://www.kaggle.com/c/datasciencebowl\">First National Data Science Bowl</a>.</p>\n\n<h2 id=\"overview\">Overview</h2>\n\n<p>This blog post is going to be long, here is a clickable overview of different sections.</p>\n\n<ul>\n  <li><a href=\"#intro\">Introduction</a></li>\n  <li><a href=\"#prep\">Pre-processing and data augmentation</a></li>\n  <li><a href=\"#nn\">Network architectures</a></li>\n  <li><a href=\"#train\">Training and ensembling</a></li>\n  <li><a href=\"#soft\">Software and hardware</a></li>\n  <li><a href=\"#conclusion\">Conclusion</a></li>\n</ul>\n\n<h2 id=\"introduction\">Introduction<a name=\"intro\"></a></h2>\n\n<h3 id=\"the-problem\">The problem</h3>\n\n<p>The goal of this year’s Data Science Bowl was to estimate minimum (end-systolic) and maximum (end-diastolic) volumes of the left ventricle from a set of MRI-images taken over one heartbeat. These volumes are used by practitioners to compute an ejection fraction: fraction of outbound blood pumped from the heart with each heartbeat. This measurement can predict a wide range of cardiac problems. For a skilled cardiologist analysis of MRI scans can take up to 20 minutes, therefore, making this process automatic is obviously useful.</p>\n\n<p>Unlike the previous Data Science Bowl, which had very clean and voluminous data set, this year’s competition required a lot more focus on dealing with inconsistencies in the way the very limited number of data points were gathered. As a result, most of our efforts went to trying out different ways to preprocess and combine the different data sources.</p>\n\n<h3 id=\"the-data\">The data</h3>\n\n<p>The dataset consisted of over a thousand patients. For each patient, we were given a number of 30-frame MRI videos in the <a href=\"https://en.wikipedia.org/wiki/DICOM\">DICOM</a> format, showing the heart during a single cardiac cycle (i.e. a single heartbeat). These videos were taken in different planes including the multiple short-axis views (SAX), a 2-chamber view (2Ch), and a 4-chamber view (4Ch). The SAX views, whose planes are perpendicular to the long axis of the left ventricle, form a series of slices that (ideally) cover the entire heart. The number of SAX slices ranged from 1 to 23. Typically, the region of interest (ROI) is only a small part of the entire image. Below you can find a few of SAX slices and Ch2, Ch4 views from one of the patients. Red circles on the SAX images indicate the ROI’s center (later we will explain how to find it), for Ch2 and Ch4 they specify the location of SAX slices projected on the corresponding view.</p>\n\n<table>\n  <tbody>\n    <tr>\n      <td>sax_5<img src=\"/img/heart/213sax_5.gif\" alt=\"\" /></td>\n      <td>sax_9<img src=\"/img/heart/213sax_9.gif\" alt=\"\" /></td>\n      <td>sax_10<img src=\"/img/heart/213sax_10.gif\" alt=\"\" /></td>\n      <td>sax_11<img src=\"/img/heart/213sax_11.gif\" alt=\"\" /></td>\n      <td>sax_12<img src=\"/img/heart/213sax_12.gif\" alt=\"\" /></td>\n      <td>sax_15<img src=\"/img/heart/213sax_15.gif\" alt=\"\" /></td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>2Ch<img src=\"/img/heart/213_ch2.gif\" alt=\"\" /></td>\n      <td>4Ch<img src=\"/img/heart/213_ch4.gif\" alt=\"\" /></td>\n    </tr>\n  </tbody>\n</table>\n\n<p>The DICOM files also contained a bunch of metadata. Some of the metadata fields, like  <em>PixelSpacing</em> and <em>ImageOrientation</em>m were absolutely invaluable to us. The metadata also specified patient’s age and sex.</p>\n\n<p>For each patient in the train set, two labels were provided: the systolic volume and the diastolic volume. From what we gathered (<a href=\"https://www.youtube.com/watch?v=wXUt_vjrF0c&amp;feature=youtu.be\">link</a>), these were obtained by cardiologists by manually performing a segmentation on the SAX slices, and feeding these segmentations to a program that computes the minimal and maximal heart chamber volumes. The cardiologists didn’t use the 2Ch or 4Ch images to estimate the volumes, but for us they proved to be very useful.</p>\n\n<p>Combining these multiple data sources can be difficult, however for us dealing with inconsistencies in the data was more challenging. Some examples: the 4Ch slice not being provided for some patients, one patient with less than 30 frames per MRI video, couple of patients with only a handful of SAX slices, patients with SAX slices taken in weird locations and orientations.</p>\n\n<h3 id=\"the-evaluation\">The evaluation</h3>\n\n<p>Given a patient’s data, we were asked to output a cumulative distribution function over the volume, ranging from 0 to 599 mL, for both systole and diastole.  The models were scored by a  Continuous Ranked Probability Score (CRPS) error metric, which computes the average squared distance between the predicted CDF and a Heaviside step function representing the real volume.</p>\n\n<p>An additional interesting novelty of this competition was the two stage process. In the first stage, we were given a training set of 500 patients with a public test set of 200 patients. In the final week we were required to submit our model and afterwards the organizers released the test data of 440 patients and labels for 200 patients from the public test set. We think the goal was to compensate for the small dataset and prevent people from optimizing against the test set through visual inspection of every part of their algorithm. Hand-labeling in the first stage was allowed on the training dataset only, for the second stage it was also allowed for 200 validation patients.</p>\n\n<h3 id=\"the-solution-traditional-image-processing-convnets-and-dealing-with-outliers\">The solution: traditional image processing, convnets, and dealing with outliers</h3>\n\n<p>In our solution, we combined traditional image processing approaches, which find the region of interest (ROI) in each slice, with convolutional neural networks, which perform the mapping from the extracted image patches to the predicted volumes. Given the very limited number of training samples, we tried combat overfitting by restricting our models to combine the different data sources in predefined ways, as opposed to having them learn how to do the aggregation.\nUnlike many other contestants, we performed <strong><font color=\"green\"> no hand-labelling </font></strong>.</p>\n\n<h2 id=\"pre-processing-and-data-augmentation\">Pre-processing and data augmentation<a name=\"prep\"></a></h2>\n\n<p>The provided images have varying sizes and resolutions, and do not only show the heart, but the entire torso of the patient. Our preprocessing pipeline made the images ready to be fed to a convolutional network by going through the following steps:</p>\n\n<ul>\n  <li>applying a zoom factor such that all images have the same resolution in millimeters</li>\n  <li>finding the region of interest and extracting a patch centered around it</li>\n  <li>data augmentation</li>\n  <li>contrast normalization</li>\n</ul>\n\n<p>To find the correct zooming factor, we made use of the <em>PixelSpacing</em> metadata field, which specifies the image resolution. Further we will explain our approach to ROI detection and data augmentation.</p>\n\n<h3 id=\"detecting-the-region-of-interest-through-image-segmentation-techniques\">Detecting the Region Of Interest through image segmentation techniques</h3>\n\n<p>We used classical computer vision techniques to find the left ventricle in the SAX slices. For each patient, the center and width of the ROI were determined by combining the information of all the SAX slices provided. The figure below shows an example of the result.</p>\n\n<div class=\"image\">\n\t<img src=\"/img/heart/roi.png\" alt=\"ROI extraction steps\" />\n\t<div class=\"text-center\">ROI extraction steps</div>\n</div>\n\n<p>First, as was suggested in the <a href=\"https://www.kaggle.com/c/second-annual-data-science-bowl/details/fourier-based-tutorial\">Fourier based tutorial</a>, we exploit the fact that each slice sequence captures one heartbeat and use Fourier analyses to extract an image that captures the maximal activity at the corresponding heartbeat frequency (same figure, second image).</p>\n\n<p>From these Fourier images, we then extracted the center of the left ventricle by combining the Hough circle transform with a custom kernel-based majority voting approach across all SAX slices. First, for each fourier image (resulting from a single sax slice), the \\(N\\) highest scoring Hough circles for a range of radii were found, and from all of those, the \\(M\\) highest scoring ones were retained. \\(N\\), \\(M\\) and the range of radii are metaparameters that severely affect the robustness of the ROI detected and were optimised manually. The third image in the figure shows an example of the \\(M\\) best circles for one slice.</p>\n\n<p>Finally, a ‘likelihood surface’ (rightmost image in figure above) was obtained by combining the centers and scores of the selected circles for all slices. Each circle center was used as the center for a Gaussian kernel, which was scaled with the circle score, and all these kernels were added. The maximum across this surface was selected as the center of the ROI. The width and height of the bounding box of all circles with centers within a maximal distance (another hyperparameter) of the ROI center were used as bounds for the ROI or to create an ellipsoidal mask as shown in the figure.</p>\n\n<p>Given these ROIs in the SAX slices, we were able to find the ROIs in the 2Ch and 4Ch slices by projecting the SAX ROI centers onto the 2Ch and 4Ch planes.</p>\n\n<h3 id=\"data-augmentation\">Data augmentation</h3>\n\n<p>As always when using convnets on a problem with few training examples, we used tons of data augmentation. Some special precautions were needed, since we had to preserve the surface area. In terms of affine transformations, this means that only skewing, rotation and translation was allowed. We also added zooming, but we had to correct our volume labels when doing so! This helped to make the distirbution of labels more diverse.</p>\n\n<p>Another augmentation here came in the form of shifting the images over the time axis. While systole was often found in the beginning of a sequence, this was not always the case. Augmenting this, by rolling the image tensor over the time axis, made the resulting model more robust against this noise in the dataset, while providing even more augmentation of our data.</p>\n\n<p>Data augmentation was applied during the training phase to increase the number of training examples. We also applied the augmentations during the testing phase, and averaged predictions across the augmented versions of the same data sample.</p>\n\n<h2 id=\"network-architectures\">Network architectures<a name=\"nn\"></a></h2>\n\n<p>We used convolutional neural networks to learn a mapping from the extracted image patches to systolic and diastolic volumes. During the competition, we played around a lot with both minor and major architectural changes. Our base architecture for most of our models was based on <a href=\"http://www.robots.ox.ac.uk/~vgg/research/very_deep/\">VGG-16</a>.</p>\n\n<p>As we already mentioned, we trained different models which can deal with different kinds of patients. There are roughly four different kinds of models we trained: single slice models, patient models, 2Ch models and 4Ch models.</p>\n\n<h3 id=\"single-slice-models\">Single slice models</h3>\n\n<p>Single slice models are models that take a single SAX slice as an input, and try to predict the systolic and diastolic volumes directly from it. The 30 frames were fed to the network as 30 different input channels. The systolic and diastolic networks shared the convolutional layers, but the dense layers were separated. The output of the network could be either a 600-way softmax (followed by a cumulative sum), or the mean and standard deviation of a Gaussian (followed by a layer computing the cdf of the Gaussian).</p>\n\n<p>Although these models obviously have too little information to make a decent volume estimation, they benefitted hugely from test-time augmentation (TTA). During TTA, the model gets slices with different augmentations, and the outputs are averaged across augmenations and slices for each patient. Although this way of aggregating over SAX slices is suboptimal, it proved to be very robust to the relative positioning of the SAX slices, and is as such applicable to all patients.</p>\n\n<p>Our single best single slice model achieved a local validation score of 0.0157 (after TTA), which was a reliable estimate for the public leaderboard score for these models. The approximate architecture of the slice models is shown on the following figure.\n<img src=\"/img/heart/model_ss.jpg\" alt=\"\" />\n<img src=\"/img/heart/model_ss_annot.jpg\" alt=\"\" /></p>\n\n<h3 id=\"2ch-and-4ch-models\">2Ch and 4Ch models</h3>\n\n<p>These models have a much more global view on the left ventricle of the heart than single SAX slice models. The 2Ch models also have the advantage of being applicable to every patient. Not every patient had a 4Ch slice. \nWe used the same VGG-inspired architecture for these models. Individually, they achieved a similar validation score (0.0156) as was achieved by averaging over multiple sax slices. By ensembling only single slice, 2Ch and 4Ch models, we were able to achieve a score of 0.0131 on the public leaderboard.</p>\n\n<h3 id=\"patient-models\">Patient models</h3>\n\n<p>As opposed to single slice models, patient models try to make predictions based on the entire stack of (up to 25) SAX slices. In our first approaches to these models, we tried to process each slice separately using a VGG-like single slice network, followed by feeding the results to an overarching RNN in an ordered fashion. However, these models tended to overfit badly. Our solution to this problem consists of a clever way to merge predictions from multiple slices. Instead of having the network learn how to compute the volume based on the results of the individual slices, we designed a layer which combines the areas of consecutive cross-sections of the heart using a <a href=\"https://en.wikipedia.org/wiki/Frustum\">truncated cone approximation</a>.</p>\n\n<p>Basically, the slice models have to estimate the area \\(A_i\\) (and standard deviation thereof) of the cross-section of the heart in a given slice \\(i\\). For each pair of consecutive slices \\(i\\) and \\(i+1\\), we estimate the volume of the heart between them as \\(V_i = ⅓*h_{i, i+1}*(A_i + \\sqrt{A_i A_{i+1}} + A_{i+1})\\), where \\(h_{i, i+1}\\) is the distance between the slices. The total volume is then given by \\(V = \\sum_i V_i\\).</p>\n\n<p>Ordering the SAX slices and finding the distance between them was achieved through looking at the <em>SliceLocation</em> metadata fields, but this field was not very reliable in finding the distance between slices, neither was the <em>SliceThickness</em>. We looked for the two slices that were furthest apart, drew a line between them, and projected every other slice onto this line. This way, we estimated the distance between two slices ourselves.</p>\n\n<p>Our best single model achieved a local validation score of 0.0105 using this approach. This was no longer a good leaderboard estimation, since our local validation set contained relatively few outliers compared to the public leaderboard in the first round. The model had the following architecture:</p>\n\n<p><img src=\"/img/heart/model.jpg\" alt=\"\" />\n<img src=\"/img/heart/model_annot.jpg\" alt=\"\" /></p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Layer Type</th>\n      <th>Size</th>\n      <th>Output shape</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Input layer</td>\n      <td> </td>\n      <td>(8, 25, 30, 64, 64)*</td>\n    </tr>\n    <tr>\n      <td>Convolution</td>\n      <td>128 filters of 3x3</td>\n      <td>(8, 25, 128, 64, 64)</td>\n    </tr>\n    <tr>\n      <td>Convolution</td>\n      <td>128 filters of 3x3</td>\n      <td>(8, 25, 128, 64, 64)</td>\n    </tr>\n    <tr>\n      <td>Max pooling</td>\n      <td> </td>\n      <td>(8, 25, 128, 32, 32)</td>\n    </tr>\n    <tr>\n      <td>Convolution</td>\n      <td>128 filters of 3x3</td>\n      <td>(8, 25, 128, 32, 32)</td>\n    </tr>\n    <tr>\n      <td>Convolution</td>\n      <td>128 filters of 3x3</td>\n      <td>(8, 25, 128, 32, 32)</td>\n    </tr>\n    <tr>\n      <td>Max pooling</td>\n      <td> </td>\n      <td>(8, 25, 128, 16, 16)</td>\n    </tr>\n    <tr>\n      <td>Convolution</td>\n      <td>256 filters of 3x3</td>\n      <td>(8, 25, 256, 16, 16)</td>\n    </tr>\n    <tr>\n      <td>Convolution</td>\n      <td>256 filters of 3x3</td>\n      <td>(8, 25, 256, 16, 16)</td>\n    </tr>\n    <tr>\n      <td>Convolution</td>\n      <td>256 filters of 3x3</td>\n      <td>(8, 25, 256, 16, 16)</td>\n    </tr>\n    <tr>\n      <td>Max pooling</td>\n      <td> </td>\n      <td>(8, 25, 256, 8, 8)</td>\n    </tr>\n    <tr>\n      <td>Convolution</td>\n      <td>512 filters of 3x3</td>\n      <td>(8, 25, 512, 8, 8)</td>\n    </tr>\n    <tr>\n      <td>Convolution</td>\n      <td>512 filters of 3x3</td>\n      <td>(8, 25, 512, 8, 8)</td>\n    </tr>\n    <tr>\n      <td>Convolution</td>\n      <td>512 filters of 3x3</td>\n      <td>(8, 25, 512, 8, 8)</td>\n    </tr>\n    <tr>\n      <td>Max pooling</td>\n      <td> </td>\n      <td>(8, 25, 512, 4, 4)</td>\n    </tr>\n    <tr>\n      <td>Convolution</td>\n      <td>512 filters of 3x3</td>\n      <td>(8, 25, 512, 4, 4)</td>\n    </tr>\n    <tr>\n      <td>Convolution</td>\n      <td>512 filters of 3x3</td>\n      <td>(8, 25, 512, 4, 4)</td>\n    </tr>\n    <tr>\n      <td>Convolution</td>\n      <td>512 filters of 3x3</td>\n      <td>(8, 25, 512, 4, 4)</td>\n    </tr>\n    <tr>\n      <td>Max pooling</td>\n      <td> </td>\n      <td>(8, 25, 512, 2, 2)</td>\n    </tr>\n    <tr>\n      <td>Fully connected (S/D)</td>\n      <td>1024 units</td>\n      <td>(8, 25, 1024)</td>\n    </tr>\n    <tr>\n      <td>Fully connected (S/D)</td>\n      <td>1024 units</td>\n      <td>(8, 25, 1024)</td>\n    </tr>\n    <tr>\n      <td>Fully connected (S/D)</td>\n      <td>2 units (mu and sigma)</td>\n      <td>(8, 25, 2)</td>\n    </tr>\n    <tr>\n      <td>Volume estimation (S/D)</td>\n      <td> </td>\n      <td>(8, 2)</td>\n    </tr>\n    <tr>\n      <td>Gaussian CDF (S/D)</td>\n      <td> </td>\n      <td>(8, 600)</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>* The first dimension is the batch size, i.e. the number of patients, the second dimension is the number of slices. If a patient had fewer slices, we padded the input and omitted the extra slices in the volume estimation.</p>\n\n<p>Oftentimes, we did not train patient models from scratch. We found that initializing patient models with single slice models helps against overfitting, and severely reduces training time of the patient model.</p>\n\n<p>The architecture we described above was one of the best for us. To diversify our models, some of the good things we tried include:</p>\n\n<ul>\n  <li>processing each frame separately, and taking the minimum and maximum at some point in the network to compute systole and diastole</li>\n  <li>sharing some of the dense layers between the systole and diastole networks as well</li>\n  <li>using discs to approximate the volume, instead of truncated cones</li>\n  <li><a href=\"http://benanne.github.io/2015/03/17/plankton.html#rolling-feature-maps\">cyclic rolling layers</a></li>\n  <li>leaky RELUs</li>\n  <li><a href=\"http://arxiv.org/pdf/1302.4389.pdf\">maxout units</a></li>\n</ul>\n\n<p>One downside of the patient model approach was that these models assume that SAX slices nicely range from one end of the heart to the other. This was trivially not true for patients with very few (&lt; 5) slices, but it was harder to detect automatically for some other outlier cases as in figure below, where something is wrong with the images or the ROI algorithm fails.</p>\n\n<table>\n  <tbody>\n    <tr>\n      <td>sax_12<img src=\"/img/heart/561sax_12.gif\" alt=\"\" /></td>\n      <td>sax_15<img src=\"/img/heart/561sax_12.gif\" alt=\"\" /></td>\n      <td>sax_17<img src=\"/img/heart/561sax_17.gif\" alt=\"\" /></td>\n      <td>sax_36<img src=\"/img/heart/561sax_36.gif\" alt=\"\" /></td>\n      <td>sax_37<img src=\"/img/heart/561sax_37.gif\" alt=\"\" /></td>\n      <td>sax_41<img src=\"/img/heart/561sax_41.gif\" alt=\"\" /></td>\n    </tr>\n  </tbody>\n</table>\n\n<table>\n  <tbody>\n    <tr>\n      <td>2Ch<img src=\"/img/heart/561_ch2.gif\" alt=\"\" /></td>\n      <td>4Ch<img src=\"/img/heart/561_ch4.gif\" alt=\"\" /></td>\n    </tr>\n  </tbody>\n</table>\n\n<h2 id=\"training-and-ensembling\">Training and ensembling<a name=\"train\"></a></h2>\n\n<p><strong>Error function</strong>. At the start of the competition, we experimented with various error functions, but we found optimising CRPS directly to work best.</p>\n\n<p><strong>Training algorithm</strong>. To train the parameters of our models, we used the Adam update rule (<a href=\"http://arxiv.org/abs/1412.6980\">Kingma and Ba</a>).</p>\n\n<p><strong>Initialization</strong>. We initialised all filters and dense layers orthogonally (<a href=\"http://arxiv.org/abs/1312.6120\">Saxe et al.</a>). Biases were initialized to small positive values to have more gradients at the lower layer in the beginning of the optimization. At the Gaussian output layers, we initialized the biases for mu and sigma such that initial predictions of the untrained network would fall in a sensible range.</p>\n\n<p><strong>Regularization</strong>. Since we had a low number of patients, we needed considerable regularization to prevent our models from overfitting. Our main approach was to augment the data and to add a considerable amount of dropout.</p>\n\n<h3 id=\"validation\">Validation</h3>\n\n<p>Since the trainset was already quite small, we kept the validation set small as well (83 patients). Despite this, our validation score remained pretty close to the leaderboard score. Also, in cases where it didn’t, it helped us identify issues in our models, namely problematic cases in the test set which were not represented in our validation set. We noticed for instance that quite some of our patient models had problems with patients with too few SAX slices (&lt; 5).</p>\n\n<h3 id=\"selectively-train-and-predict\">Selectively train and predict</h3>\n\n<p>By looking more closely at the validation scores, we observed that most of the accumulated error was obtained by wrongly predicting only a couple of such outlier cases. At some point, being able to handle only a handful of these meant the difference between a leaderboard score of 0.0148 and 0.0132!</p>\n\n<p>To mitigate such issues, we set up our framework such that each individual model could choose not to train on or predict a certain patient. For instance, models on patients’ SAX slices could choose not to predict patients with too few SAX slices, models which use the 4Ch slice would not predict for patients who don’t have this slice. We extended this idea further by developing expert models, which only trained and predicted for patients with either a small or a big heart (as determined by the ROI detection step). Further down the pipeline, our ensembling scripts would then take these non-predictions into account.</p>\n\n<h3 id=\"ensembling-and-dealing-with-outliers\">Ensembling and dealing with outliers</h3>\n<p>We ended up creating about 250 models throughout the competition. However, we knew that some of these models were not very robust to certain outliers or patients whose ROI we could not accurately detect. We came up with two different ensembling strategies that would deal with these kind of issues.</p>\n\n<p>Our first ensembling technique followed the following steps:</p>\n\n<ol>\n  <li>For each patient, we select the best way to average over the test time augmentations. Slice models often preferred a geometric averaging of distributions, whereas in general arithmetic averaging worked better for patient models.</li>\n  <li>We average over the models by calculating each prediction’s KL-divergence from the average distribution, and the cross entropy of each single sample of the distribution. This means that models which are further away from the average distribution get more weight (since they are more certain). It also means samples of the distribution closer to the median-value of 0.5 get more weight. Each model also receives a model-specific weight, which is determined by optimizing these weights over the validation set.</li>\n  <li>Since not all models predict all patients, it is possible for a model in the ensemble to not predict a certain patient. In this case, a new ensemble without these models is optimized, especially for this single patient. The method to do this is described in step 2.</li>\n  <li>This ensemble is then used on every patient on the test-set. However, when a certain model’s average prediction disagrees too much with the average prediction of all models, the model is thrown out of the ensemble, and a new ensemble is optimized for this patient, as described in step 2. This meant that about ~75% of all patients received a new, ‘personalized’ ensemble.</li>\n</ol>\n\n<p>Our second way of ensembling involves comparing an ensemble that is suboptimal, but robust to outliers, to an ensemble that is not robust to them. This approach is especially interesting, since it does not need a validation set to predict the test patients. It follows the following steps:</p>\n\n<ol>\n  <li>Again, for each patient, we select the best way to average over the test time augmentations again.</li>\n  <li>We combine the models by using a weighted average on the predictions, with the weights summing to one. These weights are determined by optimising them on the validation set. In case not all models provide a prediction for a certain patient, it is dropped for that patient and the weights of the other models are rescaled such that they again sum to one. This ensemble is not robust to outliers, since it contains patient models.</li>\n  <li>We combine all 2Ch, 4Ch and slice models in a similar fashion. This ensemble is robust to outliers, but only contains less accurate models.</li>\n  <li>We detect outliers by finding the patients where the two ensembles disagree the most. We measure disagreement using CRPS. If the CRPS exceeds a certain threshold for a patient, we assume it to be an outlier. We chose this threshold to be 0.02.</li>\n  <li>We retrain the weights for the first ensemble, but omit the outliers from the validation set. We choose this ensemble to generate predictions for most of the patients, but choose the robust ensemble for the outliers.</li>\n</ol>\n\n<p>Following this approach, we detected three outliers in the test set during phase one of the competition. Closer inspection revealed that for all of them either our ROI detection failed, or the SAX slices were not nicely distributed across the heart. Both ways of ensembling achieved similar scores on the public leaderboard. (0.0110)</p>\n\n<h3 id=\"second-round-submissions\">Second round submissions</h3>\n<p>For the second round of the competition, we were allowed to retrain our models on the new labels (+ 200 patients). We were also allowed to plan two submissions. Of course, it was impossible to retrain all of our models during this single week. For this reason, we chose to only train our 44 best models, according to our ensembling scripts.</p>\n\n<p>For our first submission, we splitted of a new validation set. The resulting models were combined using our first ensembling strategy.</p>\n\n<p>For our second submission, we trained our models on the entire training set (i.e. there was no validation split). We assembled them using the second ensembling method. Since we had no validation set to optimise the weights of the ensemble, we computed the weights by training an ensemble on the models we trained with a validation split, and transferred them over.</p>\n\n<h2 id=\"software-and-hardware\">Software and hardware<a name=\"soft\"></a></h2>\n\n<p>We used <a href=\"http://lasagne.readthedocs.org/en/latest/index.html\">Lasagne</a>, <a href=\"https://www.python.org/\">Python</a>, <a href=\"http://www.numpy.org/\">Numpy</a> and <a href=\"http://deeplearning.net/software/theano/\">Theano</a> to implement our solution, in combination with the <a href=\"https://developer.nvidia.com/cudnn\">cuDNN</a> library. We also used <a href=\"https://mathema.tician.de/software/pycuda/\">PyCUDA</a> for a few custom kernels. We made use of <a href=\"http://scikit-image.org/\">scikit-image</a> for pre-processing and augmentation.</p>\n\n<p>We trained our models on the NVIDIA GPUs that we have in the lab, which include GTX TITAN X, GTX 980, GTX 680 and Tesla K40 cards. We would like to thank <a href=\"http://www.fredericgodin.com/\">Frederick Godin</a> and <a href=\"https://twitter.com/sailenav\">Elias Vansteenkiste</a> for lending us a few extra GPUs in the last week of the competition.</p>\n\n<h2 id=\"conclusion\">Conclusion<a name=\"conclusion\"></a></h2>\n\n<p>In this competition, we tried out different ways to preprocess data and combine information from different data sources, and thus, we learned a lot in this aspect. However, we feel that there is still a room for improvement. For example, we observed that most of our error still hails from a select group of patients. These include the ones for which our ROI extraction fails. In hindsight, hand-labeling the training data and training a network to do the ROI extraction would be a better approach, but we wanted to sidestep doing a lot of this kind of manual effort as much as possible. In the end, labeling the data would probably have been less time intensive.</p>\n\n<p>UPDATE (March 23): the code is now available on GitHub: <a href=\"https://github.com/317070/kaggle-heart\">github.com/317070/kaggle-heart</a></p>",
  "pubDate": "Tue, 15 Mar 2016 00:00:00 +0000",
  "link": "http://irakorshunova.github.io/blog/heart",
  "guid": "http://irakorshunova.github.io/blog/heart"
}