{
  "title": "Episode 51: Elliot Spitzer's Wife: Hero or Victim?",
  "pubDate": "Tue, 18 Mar 2008 17:39:25 +0000",
  "guid": "episode-51-elliot-spitzers-wife-hero-or-victim",
  "link": "http://www.thepsychfiles.com/2008/03/18/episode-51-elliot-spitzers-wife-hero-or-victim/",
  "itunes:image": "",
  "description": "This past week it seems like people have been talking as much about Elliot Spitzer as they have about his wife Silda. In fact, emotions may be running higher about her behavior than about his.  Why did she stand by and support him when it appears that he clearly betrayed her trust?  Aside from gossip, what's the tie-in to theories in psychology?  Would you believe that the \"Covariation Principle\" can be applied to this and many similar situations where we are trying to figure out why people do what they do?  Have a listen and learn how we use consensus, consistency and distinctiveness information to make important decisions.",
  "content:encoded": "This past week it seems like people have been talking as much about Elliot Spitzer as they have about his wife Silda. In fact, emotions may be running higher about her behavior than about his.  Why did she stand by and support him when it appears that he clearly betrayed her trust?  Aside from gossip, what's the tie-in to theories in psychology?  Would you believe that the \"Covariation Principle\" can be applied to this and many similar situations where we are trying to figure out why people do what they do?  Have a listen and learn how we use consensus, consistency and distinctiveness information to make important decisions.",
  "enclosure": "",
  "itunes:duration": "21:36",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,notes,psychology,lecture",
  "itunes:subtitle": "People have been talking as much about Elliot Spitzer this week as much they have about his wife Silda. Why did she stand by and support him? What's the tie-in to theories in psychology? Would you believe that the \"Covariation Principle\" can be applied?",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "This past week it seems like people have been talking as much about Elliot Spitzer as they have about his wife Silda. In fact, emotions may be running higher about her behavior than about his. Why did she stand by and support him when it appears that he clearly betrayed her trust? Aside from gossip, what's the tie-in to theories in psychology? Would you believe that the \"Covariation Principle\" can be applied to this and many similar situations where we are trying to figure out why people do what they do? Have a listen and learn how we use consensus, consistency and distinctiveness information to make important decisions."
}