{
  "id": "yt:video:qeokW1-mds8",
  "yt:videoId": "qeokW1-mds8",
  "yt:channelId": "UCLXo7UDZvByw2ixzpQCufnA",
  "title": "The 3 possible outcomes of the 2022 US election",
  "link": "",
  "author": {
    "name": "Vox",
    "uri": "https://www.youtube.com/channel/UCLXo7UDZvByw2ixzpQCufnA"
  },
  "published": "2022-11-03T12:00:37+00:00",
  "updated": "2022-11-05T13:06:59+00:00",
  "media:group": {
    "media:title": "The 3 possible outcomes of the 2022 US election",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Why the Congressional midterms matter so much.\n\nSubscribe and turn on notifications 🔔  so you don't miss any videos: http://goo.gl/0bsAjO \n\nOn January 6th, 2021 (yes, during the capitol riots) the final Senate race of the 2020 election was called for a Democrat. All of a sudden Democrats had achieved something improbable: trifecta control of the presidency, Senate, and House of Representatives. It transformed the possibilities for Biden’s first two years, giving his party the ability to legislate on their own - which they did.\n\nThe trillion-dollar stimulus, the infrastructure bill, the climate investments of the Inflation Reduction Act — all of that was only possible because of unified Democratic control. But even under divided government, both houses of Congress will still wield an enormous amount of power over national affairs and policy. That’s why the 2022 election isn’t just a referendum on whether Democrats should keep Congress — it’s a question of who gets that power, and how they’ll use it. And there are three ways it could all play out.\n\nOur buds at Vox.com also did this story in text form if you like reading! https://www.vox.com/policy-and-politics/23435135/2022-midterms-congress-republican-democrat\n\nFor more reporting on the 2022 US midterm elections, read up here: https://bit.ly/3U3aGxB \n\nThere are 9 races that could decide the Senate control. Georgia, Nevada, and Wisconsin are some of the closest contests in the country. Keep up with us here: https://bit.ly/3WoXOnd \n\nChapters:\n475 elections 00:00\n1. What if Democrats keep both houses? 0:46\n2. What if Republicans win the House of Representatives? 1:59\n3. What if Republicans win the Senate? 4:26\nWhose vote matters? 7:01\n\nMake sure you never miss behind the scenes content in the Vox Video newsletter, sign up here: http://vox.com/video-newsletter\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com\n\nSupport Vox's reporting with a one-time or recurring contribution: http://vox.com/contribute-now\n\nShop the Vox merch store: http://vox.com/store\n\nWatch our full video catalog: http://goo.gl/IZONyE\n\nFollow Vox on Facebook: http://facebook.com/vox\nFollow Vox on Twitter: http://twitter.com/voxdotcom\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}