{
  "title": "Blockchain for Business and Product",
  "link": "https://blog.insightdatascience.com/blockchain-for-business-and-product-83fa0faf4c25?source=rss----d02e65779d7b---4",
  "guid": "https://medium.com/p/83fa0faf4c25",
  "category": [
    "blockchain",
    "decentralized-consensus",
    "cryptocurrency"
  ],
  "dc:creator": "Jeremy Karnowski",
  "pubDate": "Thu, 19 Nov 2020 18:39:03 GMT",
  "atom:updated": "2020-11-19T18:39:03.447Z",
  "content:encoded": "<h4>Part 2: Mining Cryptocurrency</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*Yv1MAKZDXtMuJUczdxQNMg.png\" /></figure><p>(<a href=\"https://blog.insightdatascience.com/blockchain-for-business-and-product-40128eed45b9\">Part 1: Mental Models for Blockchain</a>)</p><p>There is currently a lot of hype around cryptocurrencies, blockchain technology, and <a href=\"https://blog.insightdatascience.com/whats-the-big-deal-about-decentralized-consensus-12876bb80064\">decentralized consensus</a> systems. There is also a great deal of confusion around why the hype exists, what the unique value of these systems is, and how one might jump into this ecosystem to try their hand at building something. This, in general, makes it difficult for industry professionals to separate signal from noise.</p><p>This blog series is aimed at describing some of the core businesses and products that have arisen in the tech industry given the recent advances in decentralized consensus mechanisms, so that individuals focused on building new products and businesses can see the landscape quickly, get their hands dirty, and build something new.</p><p>This second article will walk through the system design for one business in this space - cryptocurrency mining. We will discuss what it is, how it fits into the ecosystem, and how the business works.</p><h4>Mining for cryptocurrency is renting your compute power to a bank and getting paid for this service. Understand the profit and loss of this business and how to iterate to improve return on investment.</h4><p>Align your interactions with blockchain and crypto to your values. Mining a cryptocurrency is supporting that economic system and its banking operations, by using your computer systems to be the labor for the banking administrative tasks. Mining many coins is supporting many economic systems and potentially their interactions and dynamics.</p><p>This is similar to using your car to support the transportation system and business operations of companies like Lyft or Uber. For instance, with Lyft you use your car as the hardware, spend money for gas, pay for mechanic fees from upkeep, and invest your time to drive instead of other activities. The profit at the end of the day is how much money you made during the day minus all these costs of using your vehicle for this ride-sharing service. Is it viable?</p><blockquote>Mining cryptocurrency is like installing a solar panel and selling to the grid. The main objective is to turn electricity into money.</blockquote><p>Mining cryptocurrency is also similar to installing a large solar panel array on your house and earning money by selling electricity back to the grid. In this example, you have to buy the array and batteries, pay for installation, and keep the system working. The output at the end of the day is how much money you made from the electricity sale minus the upkeep. Is it viable?</p><p>In the same way, when you are mining for crypto, you are using your computer in a “banking-operation-system”-sharing economy. Is it viable to lend your computer in this way?</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/848/1*v7MN8okGTn5zAqxC7n3gLA.png\" /><figcaption>The high-level overview of a mining business. The main objective is to turn electricity into money.</figcaption></figure><p>For the following example, I’ll focus on Monero, a specific cryptocurrency that has a mission and economic system that many people value. Monero is a cryptocurrency that has private accounts, robust security against bad actors, a mining system that is more accessible for people wanting to contribute, and many other advantageous features. For more information on Monero, check out <a href=\"https://www.goodreads.com/book/show/43307435-mastering-monero\">this book</a>.</p><p><strong>The cost to running this Monero mining business includes:</strong></p><ul><li>The original cost of your mining hardware</li><li>Electricity costs, based on your local electricity rates, which are typically measured in kWh/mo</li><li>Mining pool fees. Even though mining by yourself is possible and accessible to more people in Monero, mining as part of a collective creates more stable revenue. Being a part of this collective, however, incurs a small fee to the pool operator.</li><li>(If desired) Conversion fees between your mined currency (here, Monero) and a larger cryptocurrency (e.g. Bitcoin)</li><li>(If desired) Conversion fees between a larger cryptocurrency and USD</li></ul><p><strong>Additional pieces you need to support this business:</strong></p><ul><li>Wallets/accounts for different currencies and for currency exchanges</li><li>The software for mining</li><li>Knowledge about how to transfer funds to different accounts</li></ul><p><strong>Note:</strong> People can hold their assets in many ways. USD, Yen, Euros, real estate, jewelry, art, equity in a company, life insurance contracts, Bitcoin, Monero, etc. For most readers, I'm assuming they keep most of their assets in USD, so I'm also including parts of the business that turn Monero into USD.</p><h4>Conclusion</h4><p>Using your computer as an asset in a blockchain-oriented system is just like leveraging your car and time as a driver for Lyft, or a solar panel system for selling electricity to the grid. How is your computer being used? How is it providing value to you? How much does it cost to let your system be used for this? Is it worth it to you?</p><p>Setting up a business mining a cryptocurrency (in this example, Monero) requires you to think through how you would create, own, and operate a business. What are the system components? How much do they cost? What are the operations and how does the system run? If the business is not profitable, are there ways you can optimize parts of your business to make it run better and head toward profitability?</p><p>I encourage everyone to think through all of these avenues to understand how business in this new era will operate, which ones you should be a part of, and how you can continually make them and yourselves better in the process.</p><p><strong><em>Are you interested in transitioning to a career building new decentralized tools and applications?</em></strong> <a href=\"https://notify.insightdatascience.com/notify\">Sign up to learn more</a> about the <a href=\"http://insightfellows.com\">Insight Fellows programs</a>.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=83fa0faf4c25\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://blog.insightdatascience.com/blockchain-for-business-and-product-83fa0faf4c25\">Blockchain for Business and Product</a> was originally published in <a href=\"https://blog.insightdatascience.com\">Insight</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}