{
  "id": "yt:video:x_8dN3VjLBY",
  "yt:videoId": "x_8dN3VjLBY",
  "yt:channelId": "UC6ZFN9Tx6xh-skXCuRHCDpQ",
  "title": "WATCH: Cherokee Nation chief on why Oklahoma’s tribes see Gov. Kevin Stitt as ‘existential threat’",
  "link": "",
  "author": {
    "name": "PBS NewsHour",
    "uri": "https://www.youtube.com/channel/UC6ZFN9Tx6xh-skXCuRHCDpQ"
  },
  "published": "2022-11-04T13:19:15+00:00",
  "updated": "2022-11-04T13:19:16+00:00",
  "media:group": {
    "media:title": "WATCH: Cherokee Nation chief on why Oklahoma’s tribes see Gov. Kevin Stitt as ‘existential threat’",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Link to story: https://www.pbs.org/newshour/politics/how-a-historic-endorsement-from-oklahomas-5-largest-tribes-could-affect-the-governors-race\n\nThe Five Tribes of Oklahoma took an unprecedented step last month by endorsing a candidate in the state governor’s race: Democrat Joy Hofmeister, who is challenging Republican incumbent Gov. Kevin Stitt.\n\nLeaders from the Five Tribes — the Cherokee, Chickasaw, Muscogee (Creek), Choctaw, and Seminole Nations — praised Hofmeister’s commitment to tribal sovereignty and desire to work with the 39 federally recognized tribes in the state “for the betterment of all Oklahomans.”\n\nChuck Hoskin Jr., principal chief of the Cherokee Nation said he believes this is the most important governor’s race in Oklahoma history.\n\n“If we did not endorse in this race, if we didn't do everything we can to beat Kevin Stitt, I think that's malpractice on our part,” he told the PBS NewsHour. “I think it's a dereliction of our duty. I think we're duty-bound to see this governor as [being as] close to an existential threat as you can and to do something about it.”\n\nThe move to oppose Gov. Stitt, a citizen of the Cherokee Nation, is the latest sign of division between the state’s tribal nations and the governor. The tribes have clashed with the governor over tribal gaming compacts, jurisdiction and tribal sovereignty.\n\nStream your PBS favorites with the PBS app: https://to.pbs.org/2Jb8twG\nFind more from PBS NewsHour at https://www.pbs.org/newshour\nSubscribe to our YouTube channel: https://bit.ly/2HfsCD6\n\nFollow us:\nTikTok: https://www.tiktok.com/@pbsnews\nTwitter: http://www.twitter.com/newshour\nInstagram: http://www.instagram.com/newshour\nFacebook: http://www.pbs.org/newshour\n\nSubscribe:\nPBS NewsHour podcasts: https://www.pbs.org/newshour/podcasts\nNewsletters: https://www.pbs.org/newshour/subscribe",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}