{
  "title": "Establishment panic about Elon Musk’s changes to Twitter means he’s doing something right",
  "link": "https://www.rt.com/news/565867-elon-musk-changes-twitter/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565867-elon-musk-changes-twitter/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363adf42030273e3d6c29d9.jpg\" /> From politicians to journalists, those upset about Elon Musk owning Twitter are the ones whose authority is undermined by free speech <br/><a href=\"https://www.rt.com/news/565867-elon-musk-changes-twitter/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The only ones outraged about Twitter’s new owner are the ones afraid of free speech getting in the way of their authority</strong></p>\n            \n                        \n            <p>Elon Musk&rsquo;s Twitter takeover has heads rolling. But it is funny how the only people who seem to be upset are those who vehemently do everything in their power to shut down any peon who dares to air wrong-think on the platform.</p>\n<p>And that&rsquo;s not to mention the complete meltdown journalists and liberal commentators are having over Musk&rsquo;s idea of paid Twitter verification, which as a fellow Sir Blue Checkmark myself, I find hilarious. The thought of losing their precious blue tick, or, Heaven forbid, sharing it with the common plebeians for a mere $8 per month, has the aristocracy up in arms.</p>\n<p>So what else does the Tesla founder have in store for us? How far does your $8 take you?</p>\n<p>Well, for starters, you get prioritized posting, meaning that more people will see your replies at the top of tweet threads, in addition to being able to post longer videos, edit your existing posts, and Musk has mentioned his interest in providing content creators with actual payouts, so you&rsquo;ll be able to make money from your tweets in the same way that YouTubers, Instagrammers, and TikTokers have been for years.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363afb22030274fcd71fcc6.jpg\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/business/565857-elon-musk-twitter-layoffs/\">Elon Musk to fire half of Twitter’s staff – Bloomberg</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>On top of all of that, content creators will also gain access to extended analytics to tell them exactly what content of theirs is popular and what isn&rsquo;t. It&rsquo;s just basic stuff that&rsquo;s been available to content creators on every other platform &ndash; except for Twitter &ndash; which begs the question: what have Twitter's engineers been doing all this time?</p>\n<p>A recent report from insiders at the company suggests that Elon Musk is now working Twitter's engineers to the bone, giving hard deadlines to do their jobs working on the features he wants to implement.&nbsp;</p>\n<p>So no more in-office yoga, latte-sipping and wine breaks for Twitter's previously pampered employees, who are now facing the real prospect of having to do their jobs, at risk of getting fired. Imagine that. Twitter is an actual workplace now, not an adult daycare center, and it&rsquo;s all thanks to Elon Musk, a man who knows how to run a successful company. Do Tesla and SpaceX ring any bells? You don&rsquo;t become the world&rsquo;s richest man by being bad at your job.&nbsp;</p>\n<p>As Musk himself pointed out in a Tweet, Twitter has too many managers for the amount of people it has doing actual jobs. And he intends to get rid of them. While he may not be getting rid of 75% of Twitter&rsquo;s workforce, his efforts to streamline the company are definitely shaking the place up.</p>\n<p>Musk&rsquo;s demands have workers up in arms. Reports have emerged that he is demanding that some employees work 12 hours a day, seven days a week, to meet the deadlines for his changes. Over a thousand workers have left Twitter since Musk started the process of buying the platform, and a few high-ranking executives, including the CEO, were fired immediately after he completed the purchase.</p>\n<p>The most sympathy for them is coming from journalists who want Musk gone. After all, with him in charge, they no longer have Twitter as an echo chamber all to themselves.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63632def2030273e3d6c29b2.jpg\" alt=\"FILE PHOTO: The Twitter logo is seen outside the company&#039;s headquarters in San Francisco, California.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565842-officials-musk-twitter-investigation/\">US officials seeking probe into Musk’s Twitter deal – WaPo</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Musk&rsquo;s shakeup of Twitter has more than just a few journalists and disgruntled employees riled. The establishment political class, which has long used the platform to promote its own take on reality, is now using the tools of government to make his life miserable.</p>\n<p>According to the Washington Post, officials at the US Treasury Department are looking into whether they have the legal authority to investigate his purchase of Twitter due to his close ties to foreign governments and investors, including investors from countries supposedly hostile to the United States.</p>\n<p>But why now? Why not before, when investors from Saudi Arabia and companies such as Blackrock, which has close ties to the Chinese government, bought massive chunks of Twitter stock? Why is it only a problem when Musk wants to do it? Did the government take as much of an interest in Jeff Bezos when he bought the Washington Post? How about the fact that Amazon is pretty cozy with the Chinese government, which as we all know isn&rsquo;t exactly on the friendliest of terms with Washington?</p>\n<p>So, according to the Washington Post, officials from the Treasury are concerned because large foreign investors could potentially have access to confidential information about Twitter&rsquo;s finances, and potentially its users. The government is reportedly also concerned about Musk&rsquo;s ties to the China-based crypto exchange company Binance.</p>\n<p>According to the report, the FBI is also looking into potential counterintelligence risks posed by Musk&rsquo;s acquisition of Twitter. Never mind the fact that the agency was just exposed by the Intercept for colluding with Big Tech companies to censor political conversations. I&rsquo;m sure Musk is the real threat to democracy here when law enforcement authorities are actively trying to prevent people from talking about topics that make certain politicians and their sons look bad.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362b8d72030270c910771e3.jpg\" alt=\"Elon Musk attends a Halloween party in New York City, October 31, 2022\" />\n            <figcaption><a href=\"https://www.rt.com/news/565831-twiitter-accurate-information-musk/\">Elon Musk promises ‘most accurate source of information on Earth’</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>The <a href=\"https://www.washingtonpost.com/us-policy/2022/11/01/musk-twitter-treasury-department-review/\" target=\"_blank\" rel=\"noopener noreferrer\">report</a> in the Washington Post comes in the wake of an earlier report about how the White House was mulling whether to subject Musk&rsquo;s business dealings to national security reviews. Specifically, the government wanted to look into his purchase of Twitter and SpaceX&rsquo;s satellite network. The White House denied the claims, so we don&rsquo;t know for certain if it was ever officially planned &ndash; but the idea was most definitely floated to the press by someone working in the administration.</p>\n<p>In addition to being subject to a potential review by the Treasury Department, Democrat Senator Chris Murphy has <a href=\"https://www.nytimes.com/2022/11/01/business/dealbook/elon-musk-twitter-court-legal-battles-pay-layoffs.html\" target=\"_blank\" rel=\"noopener noreferrer\">publicly requested</a> that the CFIUS, or the Committee on Foreign Investment in the US, investigate Musk&rsquo;s purchase of Twitter. The senator says he&rsquo;s concerned about Saudi Arabia&rsquo;s so-called purchase of Twitter &ndash; never mind the fact that direct Saudi acquisition of Twitter stock years ago didn&rsquo;t trigger any such investigation. Once again, it&rsquo;s only a problem now because it&rsquo;s Elon Musk and they want to take him down for having the temerity to challenge the establishment with his advocacy of free speech.</p>\n<p>Maybe some smart lawyers will step in and decide that nothing he&rsquo;s done merits an investigation so that they can save themselves the expense of using taxpayer dollars to fund frivolous investigations and lawsuits against Musk. It&rsquo;s doubtful that they&rsquo;ll ever catch anything &ndash; assuming it goes any further.</p>\n<p>All the efforts to take down Musk only further prove the point that those in charge don&rsquo;t like having their authority questioned.</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 18:50:48 +0000",
  "dc:creator": "RT"
}