{
  "title": "Worst Day Since 1987",
  "pubDate": "Fri, 13 Mar 2020 20:35:27 +0000",
  "guid": "bfd1ae3f-f0e3-4fb9-af44-5aa70eaf9484",
  "link": "https://fool.libsyn.com/worst-day-since-1987",
  "itunes:image": "",
  "description": "<p>The stock market has its worst day since 1987 as coronavirus concerns grow and Wall Street sentiment turns decidedly bearish. How should investors be approaching this market? Which companies are still well-positioned for the long term? Motley Fool analysts Andy Cross, Ron Gross, and Jason Moser tackle those questions and weigh in on the latest from Disney, Docusign, Pepsi, and Slack. The guys discuss why American Tower, Globant, and EPAM Systems are on their radar. The Motley Fool’s co-founder David Gardner shares his thoughts on the market sell-off, black swans, and the future of higher education.<br /> <br /> Get the first $50 off your first job post at <a href= \"http://www.linkedin.com/Fool\">www.LinkedIn.com/Fool</a>. Terms and conditions apply.<br /> <br /> For a FREE copy of our Investing Starter Kit, go to <a href= \"http://www.fool.com/StarterKit\" target=\"_blank\" rel= \"noopener\">www.fool.com/StarterKit</a> and we’ll email it to you.</p> <p> </p> <p> </p> <p> </p> <p> </p> <p> </p>",
  "content:encoded": "<p>The stock market has its worst day since 1987 as coronavirus concerns grow and Wall Street sentiment turns decidedly bearish. How should investors be approaching this market? Which companies are still well-positioned for the long term? Motley Fool analysts Andy Cross, Ron Gross, and Jason Moser tackle those questions and weigh in on the latest from Disney, Docusign, Pepsi, and Slack. The guys discuss why American Tower, Globant, and EPAM Systems are on their radar. The Motley Fool’s co-founder David Gardner shares his thoughts on the market sell-off, black swans, and the future of higher education.  Get the first $50 off your first job post at <a href= \"http://www.linkedin.com/Fool\">www.LinkedIn.com/Fool</a>. Terms and conditions apply.  For a FREE copy of our Investing Starter Kit, go to <a href= \"http://www.fool.com/StarterKit\" target=\"_blank\" rel= \"noopener\">www.fool.com/StarterKit</a> and we’ll email it to you.</p> <p> </p> <p> </p> <p> </p> <p> </p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "40:07",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "The stock market has its worst day since 1987 as coronavirus concerns grow and Wall Street sentiment turns decidedly bearish. How should investors be approaching this market? Which companies are still well-positioned for the long term? Motley Fool...",
  "itunes:episodeType": "full"
}