{
  "id": "https://bibleinoneyear.org/en/youth/144",
  "title": "Day 144: How to Finish Well",
  "description": "Proverbs 12:28,13:1–6, 1 Samuel 15:12, John 14:1–27.  This is my ambition in life  I want to complete the work God has given me to do",
  "pubDate": "Tue, 24 May 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/144/",
  "itunes:duration": "15:19",
  "guid": "enyouth24052022-144",
  "length": 919.59,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 144: How to Finish Well",
  "itunes:subtitle": "Proverbs 12:28,13:1–6, 1 Samuel 15:12, John 14:1–27.  This is my ambition in life  I want to complete the work God has given me to do",
  "itunes:summary": "You can finish well. You may have had a bad start in life. You may have messed up along the way. You may have made mistakes. You may have regrets. But you can finish well and that is what matters most.\nSome start well but fall. In the recession, many of the companies, that business consultant Jim Collins had profiled in his international bestseller Good to Great, fell. Even the ‘mightiest’ of companies can fall.\nIn his most recent book, How the Mighty Fall, he examines the path towards doom. The first stage of the process begins with ‘hubris born of success’. As with Saul in the Old Testament passage for today, it is pride and arrogance (1 Samuel 15:23) that begins the process by which the mighty fall. Saul started well but did not finish well.\nIt is more important to finish well than to start well. In the New Testament, Saul (of Tarsus) started off very badly (as a persecutor of Jesus) but he finished well (as the great apostle, Paul).\nJesus, as always, shows us the way. His life was relatively short. He died in his early thirties, yet he finished well. He completed the work the Father gave him to do (John 17:4). This is my ambition in life. I want to complete the work God has given me to do.\nHow can you make sure you finish well?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 509
}