{
  "id": "yt:video:Rilsbf24d5A",
  "yt:videoId": "Rilsbf24d5A",
  "yt:channelId": "UCUk0AvSMU5CJ0wUqJf9TX8g",
  "title": "Understanding the Iranian Protests with Maryam Namazie",
  "link": "",
  "author": {
    "name": "Coleman Hughes",
    "uri": "https://www.youtube.com/channel/UCUk0AvSMU5CJ0wUqJf9TX8g"
  },
  "published": "2022-10-01T20:00:08+00:00",
  "updated": "2022-10-05T00:11:14+00:00",
  "media:group": {
    "media:title": "Understanding the Iranian Protests with Maryam Namazie",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "My guest today is Maryam Namazie. Maryam is an Iranian-born writer and activist living in the UK. She's the spokesperson of \"One Law for All\" and \"The Council of Ex-Muslims of Britain\". She has co-authored many books, including \"Sharia Law in Britain: A Threat to One Law for All and Equal Rights\", \"Enemies Not Allies: The Far-Right\"  and \"Political and Legal Status of Apostates in Islam\".\n\nThis episode is all about the current uprising in Iran. Miriam and I talk about the death of Masa Amini in police custody and the protests that her death has caused all over Iran. We talk about the Iranian morality police and the laws and customs governing how Iranian women have to dress and behave. We discuss the strange alliance of conservative Islam and Western intersectional feminism. We discuss the legacy of the Iranian Revolution of 1979 which turned around into an Islamic state. We talk about the robust black market for Western and secular content in Iran. We also talk about what we in the West can do to support Iranian women and protesters, and much more.\n\n#Ad\nIf you’re hiring, you need Indeed. Because Indeed is the hiring partner where you can Attract, Interview, and Hire all in one place. Indeed partners with you on every step of the hiring process. Find great talent through time-saving tools like Indeed Instant Match, Assessments, and Virtual Interviews.  With Instant Match, over 80% of employers get quality candidates, whose resume on Indeed matches their job description, the moment they sponsor a job, according to Indeed data, US. Candidates you invite to apply through Instant Match are 3X more likely to apply to your job than candidates who only see it in search.\nJoin more than three million worldwide that use INDEED to hire great talent fast. \nVisit https://www.indeed.com/CONVERSATIONS to start hiring now\nTerms and conditions apply.\n\n#ColemanUnfiltered\nColeman Unfiltered addresses topics that have been on mute through the ages with silent shifts into polarities, by relentless questioning and observations in coordination with some of the brightest intellectuals of our generation.\nThe Unfiltered Community is an ode to the fans; an environment promoting sound tolerance of ideas to solidify the meaning of liberalism in a changing world.\nIt’s a concrete effort to have open, honest conversations on the most difficult social and political issues we’re surrounded with.\nFor in-depth discussions, unaired/unseen episodes, and bonus content on Conversations With Coleman, participate via a membership and gain access to raw, powerful human ideology. \nWelcome to the new age’s most original intellectual revolution; let’s change the world, one conversation at a time.\nSign up Today  - https://bit.ly/3B1GAlS\n\n\nFOLLOW COLEMAN\n\nYouTube - http://bit.ly/38kzium \nConversations with Coleman - Spanish Channel: https://bit.ly/CwCSpanish\nTwitter - http://bit.ly/2rbAJue \nFacebook - http://bit.ly/2LiAXH3 \nInstagram - http://bit.ly/2SDGo6o \nPodcast -https://bit.ly/3oQvNUL \nWebsite - https://colemanhughes.org/ \nLimited Edition Merch - https://bit.ly/CWCMerch",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}