{
  "title": "LinkedIn Adds Verified Emails, Profile Creation Dates",
  "link": "https://krebsonsecurity.com/2022/11/linkedin-adds-verified-emails-profile-creation-dates/",
  "comments": "https://krebsonsecurity.com/2022/11/linkedin-adds-verified-emails-profile-creation-dates/#comments",
  "dc:creator": "BrianKrebs",
  "pubDate": "Fri, 04 Nov 2022 21:09:52 +0000",
  "category": [
    "A Little Sunshine",
    "Employment Fraud",
    "Security Tools"
  ],
  "guid": "https://krebsonsecurity.com/?p=61785",
  "description": "For whatever reason, the majority of the phony LinkedIn profiles reviewed by this author have involved young women with profile photos that appear to be generated by artificial intelligence (AI) tools.\n\nWe’re seeing rapid advances in AI-based synthetic image generation technology and we’ve created a deep learning model to better catch profiles made with this technology. AI-based image generators can create an unlimited number of unique, high-quality profile photos that do not correspond to real people. Fake accounts sometimes use these convincing, AI-generated profile photos to make their fake LinkedIn profile appear more authentic.",
  "content:encoded": "<p>Responding to a recent surge in AI-generated bot accounts, <strong>LinkedIn</strong> is rolling out new features that it hopes will help users make more informed decisions about with whom they choose to connect. Many LinkedIn profiles now display a creation date, and the company is expanding its domain validation offering, which allows users to publicly confirm that they can reply to emails at the domain of their stated current employer.</p>\n<p><img class=\"aligncenter wp-image-61789\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/11/bkli.png\" alt=\"\" width=\"751\" height=\"588\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2022/11/bkli.png 1192w, https://krebsonsecurity.com/wp-content/uploads/2022/11/bkli-768x602.png 768w, https://krebsonsecurity.com/wp-content/uploads/2022/11/bkli-782x613.png 782w\" sizes=\"(max-width: 751px) 100vw, 751px\" /></p>\n<p>LinkedIn&#8217;s new &#8220;About This Profile&#8221; section &#8212; which is visible by clicking the &#8220;More&#8221; button at the top of a profile &#8212; includes the year the account was created, the last time the profile information was updated, and an indication of how and whether an account has been verified.</p>\n<p>LinkedIn also said it is adding a warning to some LinkedIn messages that include high-risk content, or that try to entice the user into taking the conversation to another platform (like WeChat).</p>\n<p>&#8220;We may warn you about messages that ask you to take the conversation to another platform because that can be a sign of a scam,&#8221; the company said in a blog post. &#8220;These warnings will also give you the choice to report the content without letting the sender know.&#8221;</p>\n<p>In late September 2022, KrebsOnSecurity warned about <a href=\"https://krebsonsecurity.com/2022/09/fake-ciso-profiles-on-linkedin-target-fortune-500s/\" target=\"_blank\" rel=\"noopener\">the proliferation of fake LinkedIn profiles for Chief Information Security Officer (CISO) roles</a> at some of the world’s largest corporations. A <a href=\"https://krebsonsecurity.com/2022/10/glut-of-fake-linkedin-profiles-pits-hr-against-the-bots/\" target=\"_blank\" rel=\"noopener\">follow-up story on Oct. 5</a> showed how the phony profile problem has affected virtually all executive roles at corporations, and how these fake profiles are creating an identity crisis for the businesses networking site and the companies that rely on it to hire and screen prospective employees.<span id=\"more-61544\"></span></p>\n<p>Reporting here last month also tracked a <a href=\"https://krebsonsecurity.com/2022/10/battle-with-bots-prompts-mass-purge-of-amazon-apple-employee-accounts-on-linkedin/\" target=\"_blank\" rel=\"noopener\">massive drop in profiles claiming to work at several major technology companies</a>, as LinkedIn apparently took action against hundreds of thousands of inauthentic accounts that falsely claimed roles at these companies.</p>\n<p>For example, on October 10, 2022, there were 576,562 <strong>LinkedIn</strong> accounts that listed their current employer as <strong>Apple Inc.</strong> The next day, half of those profiles no longer existed. At around the same time, the number of LinkedIn profiles claiming current roles at <strong>Amazon</strong> fell from roughly 1.25 million to 838,601 in just one day, a 33 percent drop.<span id=\"more-61785\"></span></p>\n<p>For whatever reason, the majority of the phony LinkedIn profiles reviewed by this author were young women with profile photos that appear to have been generated by artificial intelligence (AI) tools.</p>\n<p>&#8220;We’re seeing rapid advances in AI-based synthetic image generation technology and we’ve created a deep learning model to better catch profiles made with this technology,&#8221; LinkedIn&#8217;s <strong>Oscar Rodriguez</strong> <a href=\"https://blog.linkedin.com/2022/october/25/new-linkedin-profile-features-help-verify-identity--detect-and-r\" target=\"_blank\" rel=\"noopener\">wrote</a>. &#8220;AI-based image generators can create an unlimited number of unique, high-quality profile photos that do not correspond to real people.&#8221;</p>\n<p>It remains unclear who or what is behind the recent proliferation of fake executive profiles on LinkedIn, but likely they are from a combination of scams. Cybersecurity firm <strong>Mandiant</strong> (recently acquired by <strong>Google</strong>) <a href=\"https://www.yahoo.com/video/north-korean-fraudsters-suspected-copying-153907880.html\" target=\"_blank\" rel=\"noopener\">told Bloomberg</a> that hackers working for the North Korean government have been copying resumes and profiles from leading job listing platforms LinkedIn and <strong>Indeed</strong>, as part of an elaborate scheme to land jobs at cryptocurrency firms.</p>\n<p>Identity thieves have been known <a href=\"https://krebsonsecurity.com/2021/05/how-to-tell-a-job-offer-from-an-id-theft-trap/\" target=\"_blank\" rel=\"noopener\">to masquerade on LinkedIn as job recruiters</a>, collecting personal and financial information from people who fall for employment scams.</p>\n<p>Also, fake profiles also may be tied to so-called <a href=\"https://krebsonsecurity.com/2022/07/massive-losses-define-epidemic-of-pig-butchering/\" target=\"_blank\" rel=\"noopener\">“pig butchering” scams</a>, wherein people are lured by flirtatious strangers online into investing in cryptocurrency trading platforms that eventually seize any funds when victims try to cash out.</p>\n",
  "wfw:commentRss": "https://krebsonsecurity.com/2022/11/linkedin-adds-verified-emails-profile-creation-dates/feed/",
  "slash:comments": 7
}