{
  "guid": "prx_126_6761728f-414c-4d8b-bf99-10a78b99137d",
  "title": "The Summer of Night Vale Presents, Part 1",
  "pubDate": "Fri, 06 Jul 2018 04:00:00 -0000",
  "link": "https://beta.prx.org/stories/248217",
  "description": "<p>Welcome to the Summer of Night Vale Presents, a celebration and sampling of some of the shows across our network. This week: a look at two of our non-fiction shows, <a href=\"http://ionlylistentothemountaingoats.com\" rel=\"nofollow\" target=\"_blank\">I Only Listen to the Mountain Goats</a> and <a href=\"http://conversationswithpeoplewhohateme.com\" rel=\"nofollow\" target=\"_blank\">Conversations with People Who Hate Me</a>.</p>\n\n<p><a href=\"http://ionlylistentothemountaingoats.com\" rel=\"nofollow\" target=\"_blank\">I Only Listen to the Mountain Goats</a> is a show about what it means to be an artist, to be a fan, and as many people are, both at once. Our first season found Welcome to Night Vale creator Joseph Fink in conversation with John Darnielle, singer and songwriter of the Mountain Goats, about their album <em>All Hail West Texas</em>. You’ll hear an excerpt from episode 9, “The Mess Inside,” which shows how these conversations wander through topics in unexpected ways.<br>\n<br>\n<a href=\"http://conversationswithpeoplewhohateme.com\" rel=\"nofollow\" target=\"_blank\">Conversations with People Who Hate Me</a> is a show where Dylan Marron, whom you may know as Carlos the Scientist on Welcome to Night Vale, takes contentious online conversations and moves them offline. This year, Dylan has been moderating conversations between people who have exchanged their own online negativity. You’ll hear the entirety of episode 12, “Burned at the Stake,” featuring a woman who wrote about why the TV show <em>The Office</em> doesn’t hold up to today’s standards and a man who told her she should be burned at the stake.</p>\n\n<p>Find out more about these shows, and all of the shows on our network, by visiting <a href=\"http://nightvalepresents.com\" rel=\"nofollow\" target=\"_blank\">nightvalepresents.com.</a></p>",
  "enclosure": "",
  "itunes:subtitle": "A celebration and sampling of some of the shows across our network.",
  "itunes:episodeType": "full",
  "itunes:duration": "01:04:42"
}