{
  "title": "The Limits to Growth?",
  "description": "<div class=\"block-quote\">\n<div class=\"pull-quote-blue\"><img loading=\"lazy\" class=\"alignnone size-medium wp-image-62212\" src=\"https://www.econlib.org/wp-content/uploads/2022/11/51Hqy1S6AFL._SX319_BO1204203200_-193x300.jpg\" alt=\"\" width=\"193\" height=\"300\" srcset=\"https://www.econlib.org/wp-content/uploads/2022/11/51Hqy1S6AFL._SX319_BO1204203200_-193x300.jpg 193w, https://www.econlib.org/wp-content/uploads/2022/11/51Hqy1S6AFL._SX319_BO1204203200_.jpg 321w\" sizes=\"(max-width: 193px) 100vw, 193px\" /></div>\n</div>\n<p>In the 50 years since <em>The Limits to Growth</em> was published in 1972, its grim Malthusian message has gripped the social consciousness. Its central thesis was that since the earth’s resources are finite, it would not be able to support the exponential rates of economic and population growth and would collapse before the end of this century. This proclamation has become the fountainhead behind <a href=\"https://www.theguardian.com/sustainable-business/sustainable-choice-changing-consumers-think\">calls</a> for growing centralization and the establishment of limits to curtail the freedom of individual choices.</p>\n<p>Global institutions such as the  <a href=\"http://www.who.int/airpollution/en/\">World Health Organization</a>, the <a href=\"https://www.weforum.org/reports/the-global-risks-report-2018/\">World Economic Forum</a>  have pointed to air pollution, climate change, overpopulation, and water scarcity as some of the biggest threats to human well-being. The consensus among policy-makers, politicians, and environmentalists seems to be that entrepreneurs and firms good will use the cheapest means of production possible, even as they degrade the environment. Therefore,  any reliance on market mechanisms to solve the problem of environmental degradation and to provide sustainability are automatically ruled out.</p>\n<p>Similarly, the consensus that consumers are driven by personal desires to overconsumption implies <a href=\"https://www.econlib.org/consumer-sovereignty-or-producer-sovereignty/\">consumer sovereignty</a> must be put on hold in pursuit of a sustainable world in which the needs of today are met without compromising on the needs of future generations.</p>\n<p>It follows from such consensus that the solution must be global, as there are potentially massive consequences for failure, and that a centrally planned approach is the only feasible solution. The centralized approach to solving the problem of environmental degradation assumes rational, well-informed people with massive resources will deal with the massive issues of environment conservation in a well-intentioned and efficient manner for the public good.</p>\n<p>This approach in practice would mean doing away with civil liberties if they interfere with the plan of environment conservation. But as sovereign individuals who desire a free world and who hold values of liberty and dignity of human beings sacred, we must pause before making such a Faustian bargain. Stop and think carefully about the true nature of environmental degradation, the effects of scarcity on the economy, and how a spontaneously ordered system such as the market might deal with it.</p>\n<p>Apart from the intellectual stimulation that history provides, it can also provide us with lessons from past experiences, and we have enough evidence from the experiments of centralized planning  to make us intellectually suspicious of it.</p>\n<p>&nbsp;</p>\n<p><strong>Markets Deal with Scarcity.</strong></p>\n<p>The economy consists of huge numbers of buyers and sellers who respectively <a href=\"https://www.econlib.org/library/Enc/Supply.html\">supply</a> and <a href=\"https://www.econlib.org/library/Enc/Demand.html\">demand</a> vast quantities of goods and services. Therefore, there is an enormous amount of information available to them in a decentralized manner- but this information about demand and supply are important for <em>everyone</em> as it impacts the decisions they make in their day to day lives. This is where monetary valuation comes in. Based on competition between buyers and sellers through a bidding process,  prices are formed which convey information about such things.</p>\n<p>Prices in the market act as coordinating signals which convey information about important economic data  scattered in a decentralized manner. The role of prices in coordinating actions in the market was one of the <a href=\"https://www.econlib.org/library/Essays/hykKnw.html\">core arguments advanced by Fredrick Hayek</a> on why centralized planning could never allocate resources as effectively as markets do.</p>\n<p>When something is scarce in the market, a large number of its users compete in the market over its possession which leads to the increase in its prices initiated by the seller to economize on its existing stock. The increased price is a signal in the market reflecting its scarcity. If the claims of <em>The Limits to Growth</em> are true, then prices of <a href=\"https://www.econlib.org/library/Enc/NaturalResources.html\">natural resources</a> which are used heavily in energy consumption should increase.</p>\n<p>This increase in the price is necessary to substantiate the claim that this resource scarcity limits to <a href=\"https://www.econlib.org/library/Enc/EconomicGrowth.html\">economic growth</a>, as energy consumption is bound to increase with increases in economic activity. If the resource prices today were exponentially higher than they were in the past,</p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-62214 size-full\" src=\"https://www.econlib.org/wp-content/uploads/2022/11/Capture.jpg\" alt=\"\" width=\"577\" height=\"374\" srcset=\"https://www.econlib.org/wp-content/uploads/2022/11/Capture.jpg 577w, https://www.econlib.org/wp-content/uploads/2022/11/Capture-300x194.jpg 300w\" sizes=\"(max-width: 577px) 100vw, 577px\" /></p>\n<p>But the reality has been much different. Despite the fall in the purchasing power of the dollar and the cartelization of oil,  an item that cost 50 dollars in 1970 would theoretically cost 335.5 US dollars in 2020 (50 x 6.71 = 335.5). But the increase in the rice of oil is quite <a href=\"https://www.statista.com/statistics/262858/change-in-opec-crude-oil-prices-since-1960/\">low</a> relative to the fall in the value of the dollar, which suggests that the real increase in the price of the oil barrel is negligible. Might this convince people to change their minds?</p>\n<p>&nbsp;</p>\n<hr />\n<p><em><strong>Vibhu Vikramaidtya is a scholar with research interests in capital theory, monetary theory, and business cycles writing about events in the economy from a legal and economic standpoint. His other works can be found at the Austrian Economics Center, the Libertarian Institute, and <a href=\"http://beinglibetarian.com/\" target=\"_blank\" rel=\"noopener noreferrer\" data-saferedirecturl=\"https://www.google.com/url?q=http://beinglibetarian.com&source=gmail&ust=1647710562482000&usg=AOvVaw34IfgUJh4AGfuiLHtWoxFJ\">beinglibetarian.com</a>. </strong></em></p>\n(1 COMMENTS)",
  "link": "https://www.econlib.org/the-limits-to-growth/",
  "guid": "https://www.econlib.org/the-limits-to-growth/",
  "category": [
    "Central Planning",
    "Energy, Environment, Resources",
    "climate change",
    "Friedrich Hayek",
    "market prices",
    "spontaneous order"
  ],
  "pubDate": "Sat, 05 Nov 2022 14:00:51 +0000"
}