{
  "title": "Episode 2: &#8220;Roll &#8216;Em Pete&#8221; by Big Joe Turner and Pete Johnson",
  "link": "https://500songs.com/podcast/roll-em-pete-by-big-joe-turner-and-pete-johnson/",
  "pubDate": "Sun, 14 Oct 2018 23:00:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/roll-em-pete-by-big-joe-turner-and-pete-johnson/",
  "description": "Here's the second episode, on \"Roll 'Em Pete\" by Big Joe Turner and Pete Johnson. One erratum before we continue -- in the episode, I say that \"Shake, Rattle, and Roll\" follows a particular formula common in hokum songs. That's not actually true for the original version -- it <em>is</em> true for Bill Haley's cover version, and Elvis' and the versions after them, but in Joe Turner's version the part we now know as the chorus didn't come in until near the end. Sorry about the mistake.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've put together a Mixcloud mix of all the songs talked about in this episode, which you can stream <a href=\"https://www.mixcloud.com/AndrewHickey/roll-em-pete/\">here</a>. That mix has \"In the Mood\" and \"the Booglie Wooglie Piggy\" by Glenn Miller, \"Roll 'Em Pete\" and \"It's All Right Baby\" by Joe Turner and Pete Johnson, \"Shake, Rattle, and Roll\" by Joe Turner, \"I Need A Little Sugar in my Bowl\" by Bessie Smith, \"Pinetop's Boogie Woogie\" by Pinetop Smith, and \"Shake, Rattle, and Roll by Bill Haley\n\nFor all the episodes on pre-1954 music, one invaluable source is the book \"<a href=\"https://amzn.to/2OS4iaN\">Before Elvis\" by Larry Birnbaum</a>, which goes into these subjects in far more detail than I can.\n\n<a href=\"https://amzn.to/2DFs8p9\">Lionel Hampton's autobiography is out of print,</a> but you can find second hand copies very cheap.\n\nThe Spirituals to Swing concerts have been released on CD, but sadly that's also out of print -- <a href=\"https://amzn.to/2DF9vlj\">this</a> is the definitive version, but hopefully at some point they'll get a rerelease at a reasonable price.\n\n<strong>Transcript</strong>\n\n\"It's got a backbeat, you can't lose it\" -- in Chuck Berry's classic song \"Rock and Roll Music\", that's the only line that actually talks about what the music is. The backbeat is, to all intents and purposes , the thing that differentiates early rock and roll from the music that preceded it. And like all of early rock and roll, it's something that had predecessors in rock's pre-history.\n\nIf you don't know what a backbeat is... well, in the days of swing, and even on a lot of very early rock and roll records, the typical beat you'd have is one called a shuffle, which sounds like you'd expect from the name, it's a sort of tit-tit-tit-tit [demonstrates] kind of sound, and you'd generally stress the first beat in the bar. [demonstrates] ONE-and-two-and-three-and-four-and-ONE-and-two-and-three-and-four-and.\n\nThe shuffle rhythm was *the* swing rhythm -- so much so that often you'll see \"shuffle rhythm\" and \"swing time\" used interchangeably. Listen, for example, to the introduction to \"In the Mood\" by the Glenn Miller Orchestra, the biggest-selling swing record of all time [plays section of song].\n\nThat's a shuffle. That's swing music, and that rhythm was the basis of almost all pre-war popular music, one way or the other. It's a good, strong, sound -- there's a reason why it was popular -- but... it's a little bit polite. A little bit tame.\n\nA backbeat, on the other hand, gives you a straight, simple, pulse. You stress the second and fourth beats in a bar -- boom BAP boom BAP boom BAP boom BAP. It's a simpler rhythm, but a more exciting one. That's the rhythm that made rock and roll.\n\nPlayers in blues and jazz music had been using that rhythm, off and on, since the 1920s. Lionel Hampton, in his autobiography, talking about his earliest work as a drummer before switching to vibraphone, says \"I had a different style on drums. I was already playing with a heavy afterbeat, getting that rock-and-roll beat that wouldn't even get popular until the 1950s. I wanted people to dance, have a good time, clap their hands, and they would do it to my drumming.\"\n\nAnd that's what a backbeat does -- it gives people somewhere to clap their hands, a very clear signal, you clap on TWO and FOUR.\n\nBut while Hampton was playing like that, he was never recorded doing that, and nor were any other drummers at the time. In fact, the first recording in the prehistory of rock generally credited as having a backbeat doesn't even have a drummer on it at all. Rather, it features just a vocalist, Big Joe Turner, and a piano player, Pete Johnson. The song, which was recorded in December 1938, is called \"Roll 'Em Pete\".\n\nNow, before we go any further, I want to say something about that \"generally credited\". There are two problems with it -- the first is that \"Roll 'Em Pete\", at least in the version recorded under that name, doesn't have a particularly pronounced backbeat at all, and the second is that there *were* other records being made, long before 1938, which do. But that's the way of these things, as we'll see over and over again. The first anything is messy.\n\nBut \"Roll 'Em Pete\" is still a hugely important record, in ways that are more important than whether it has a backbeat on it. So let's have a look at it.\n\nPete Johnson was a boogie-woogie player -- yet another of the musical streams which fed into early rock and roll. Boogie woogie was a style of piano playing that became popular in the 1930s, where the left hand would play a strong bassline -- you almost certainly know the generic boogie bassline style, which goes like this [demonstrates] -- while the right hand would play decorative melodic stuff over it. That bassline and melody combination was the most popular style of playing for a time, and it became the cornerstone of rock piano playing, as well as of country music and much else. The bassline would have eight notes in a typical bar, and \"eight to the bar\" was another term some used for boogie woogie at the time.\n\nBut boogie woogie was, for the most part, based on that shuffle rhythm. Listen to \"Pinetop's Boogie Woogie\" by Pinetop Smith, the first real boogie record, from 1928, and you'll hear a rhythm which isn't so different to that Glenn Miller record from a decade or so later. \"Roll 'Em Pete\" changed that.\n\nPete Johnson was considered one of the greatest exponents of the boogie-woogie style, and in 1938 when John Hammond was putting together his \"Spirituals to Swing\" concerts, it was natural that Hammond would choose Johnson to perform. These concerts -- one in 1938 and one in 1939 -- were probably the most important concerts in popular music history. That's not an exaggeration, by any means, it's just a fact.\n\nAt the beginning of 1938, Hammond had promoted a concert by the Benny Goodman band at Carnegie, and that concert itself had been an impressive event -- it was the first time an integrated band had played Carnegie Hall, and the first time that popular music had been treated as seriously as classical music.\n\nFor a follow-up, at Christmas 1938, Hammond wanted to present only black musicians, but to an integrated audience. He wanted, in fact, to present a history of black music, from \"primitive\" folk forms to big band swing. This was, to say the least, a controversial choice, and in the end the event was sponsored by The New Masses, a magazine published by the Communist Party USA.\n\nAnd the lineup for that show was pretty much a who's who of black American music at the time. Hammond had wanted to get Robert Johnson, but he discovered that Johnson had recently died -- Johnson's place was taken by a then-obscure folk musician called Big Bill Broonzy, who became popular largely on the basis of that appearance. Sonny Terry, Sister Rosetta Tharpe, Meade Lux Lewis, Albert Ammons, the Count Basie Orchestra, and more all appeared, and the show was successful enough that the next year there was a follow-up, with many of the same musicians, which also featured the Benny Goodman Sextet.\n\nFor this show, as well as playing on his own, Pete Johnson was backing a blues shouter called Big Joe Turner. And \"shouter\" was the word for what Turner did. If you don't know about blues shouters, that's unsurprising -- it's a style of music that went out of fashion with the big bands. But a blues shouter was a singer -- usually a man -- who could sing loudly and powerfully enough that he could be heard over a band, without amplification. In the early twentieth century, microphones were unknown at first, and singers had to be able to be heard over the musicians simply by the force of their voices. Some singers used megaphones as a crude form of amplification, but many more simply had to belt out their vocals as loud as they could.\n\nEven after microphones were introduced, they were unreliable and amplification wasn't very powerful. And at the same time bands were getting bigger and louder -- blues shouters like Big Joe Turner could compete with that power, and get a crowd excited by the sheer volume of their voice, even over bands like Count Basie's.\n\nBut for the Carnegie Hall show, Turner and Pete Johnson were playing together, just the two of them. And while they were in New York, they had a recording session, and recorded a track that some say is the first rock and roll record ever.\n\n\"Roll 'Em Pete\" has the first recorded example -- as far as anyone has been able to discover -- of a boogie song which uses a backbeat rather than a shuffle beat. All the musical elements of early rock and roll are there in Pete Johnson's piano part -- in particular, listen to the phrasing in his right-hand part. Those melody lines he's playing, if you transfer them to guitar, are basically the whole of Chuck Berry's guitar style, but you can also hear Jerry Lee Lewis in there.\n\nNow you might be listening to the track and saying to yourself \"I don't really hear that much of a difference with the earlier song -- are you sure it's got more of a backbeat?\"\n\nIf you are, I don't blame you -- but there's a version of this song with a much clearer backbeat, and that's the live recording of Turner and Johnson performing the song at Carnegie Hall the week earlier -- that performance is titled \"It's Alright Baby\" rather than \"Roll 'Em Pete\" on the official recordings, but it's the same song. There, Turner is clapping along on the backbeat, and you can hear the claps clearly.\n\nNow this isn't a clearcut differentiation -- you can play music in such a way that you can have a shuffle beat going up against a backbeat, and that's a lot of what's going on in boogie music of this period, and the two rhythms rubbing up against each other is a lot of what drives early rock and roll. Talking about a \"first backbeat record\" is almost as ridiculous as talking about a \"first rock and roll record\" or a \"first soul record\". And the more I've listened to this song and the other music of its time, the less convinced I am that this specific song has something altogether new. But still, it's a great example of boogie, of blues, and of the music that would become rock and roll, and it's one you can clearly point to and say \"that has all the elements that will later go into rock and roll music. Perhaps not in exactly the same proportions, perhaps not in a way that's massively different from its predecessors, but like \"Flying Home\", which we talked about last time, it's as good a place to start as any.\n\nAnd this is, have no doubt about it, a record of important performers.\n\nBefore we go into why, we'll talk briefly about the song, and particularly about the lyrics -- or, more precisely, the way that they aren't really coherent lyrics at all. This is something we'll be seeing a lot of in the future -- a blues tradition called \"floating lyrics\". A song like \"Roll 'Em Pete\", you see, isn't really a song in the conventional sense. There's a melodic structure there, and over that melodic structure the singer would improvise. And when blues singers improvised, they'd tend to pull out lyrics from a set of pre-existing phrases that they knew worked. \"Well, I got a gal, she lives up on the hill/Well, this woman's tryin' to quit me, Lord, but I love her still\" is the opening line, and that is one of those floating lyrics -- though sometimes, depending on the singer, the women says she loves me but I don't believe she will, or doesn't love me but her sister will.\n\nMost of Turner's songs were made up of these floating lyrics, and this is something we'll see happening more in the early years of rock and roll, as we look at those. The whole idea of floating lyrics, sadly, makes authorship claims for songs somewhat difficult, and rock and roll, like blues and country before it, was essentially a folk artform to start with. We'll see several examples of people taking credit as \"songwriters\" for things that are put together from a bunch of pre-existing elements, striking it lucky, and becoming millionaires as a result.\n\nTurner and Johnson could stretch \"Roll 'Em Pete\" out to an hour sometimes, with Turner just singing new lyrics as needed, and no recording can really capture what they were doing in live performance -- and this is the problem with much of the prehistory of rock and roll, as so much of it was created by musicians who were live performers first and recording artists a distant second, if at all.\n\nBut those live performances mattered. In 1938, when Pete Johnson and Albert Ammons made their appearances in the Spirituals to Swing shows, boogie woogie was something of a minority form -- it was something that had had a brief popularity a decade earlier and which was largely forgotten. That show changed that, and suddenly boogie woogie was the biggest thing in music -- every big band started playing boogie woogie music, adapted to the big band style. The Andrews Sisters sang about \"the boogie woogie bugle boy of company B\" and wanted you to \"beat me daddy, eight to the bar\" (and then, presumably feeling dirty after that, wanted you to \"scrub me mama to a boogie beat\"). Tommy Dorsey recorded \"Pinetop's Boogie Woogie\" (renamed as \"TD's Boogie Woogie\"), and you got... well, things like this.\n\n[play excerpt of \"The Booglie Wooglie Piggy\" by Glenn Miller]\n\nThat's the Glenn Miller Orchestra, the biggest band of the forties, with Tex Beneke singing about a booglie wooglie piggy. They don't write them like that any more.\n\nMost of this music, as you can hear, was still using that swing beat, but it was clearly boogie woogie music, and that became the biggest style of music in late-period big band music, the music that was popular in the early 1940s. Even in songs that aren't directly about being boogie-woogie -- like, say, Glenn Miller's \"Chatanooga Choo Choo\" -- you still get that boogie rhythm, and nods to the generic boogie bassline and you get lines like \"when you hear that whistle blowing eight to the bar, then you know that Tennessee is not very far\".\n\nAnd that influence had a bigger impact than it might otherwise have done, and became something bigger than just a fad, because between 1941 and 1943 a whole host of events conspired to change the music industry forever.\n\nMost importantly, of course, the Second World War reached America, and that caused a lot of problems for the big band industry -- men who would otherwise have been playing in those bands were being drafted, as were men who would otherwise have been going out dancing to those bands.\n\nBut there were two smaller events that, if anything, made even more impact. The first of these was the ASCAP boycott.\n\nThe American Society of Composers and Publishers was -- and still is -- an organisation that represented most of the most important songwriters and music publishers in the USA, the people who had been writing the most successful songs. They collected royalties for live performances and radio plays, and distributed them to the composers and publishers who made up their membership. And they only dealt with the respectable Tin Pan Alley composers, but that covered enough songs -- in the early forties they had a repertoire of one and a quarter million songs, including all the most popular songs that the big bands were playing.\n\nAnd then for ten months in 1941, they banned all the radio stations in the USA from playing any of their songs, over a royalty dispute.\n\nThis should have been catastrophic for the radio stations, and would have been if there hadn't been another organisation, BMI, set up as a rival to ASCAP a couple of years earlier. BMI dealt with only the low-class music -- the blues, and country songs, and gospel songs, and hillbilly music, and boogie. The stuff ASCAP didn't think was important.\n\nExcept that now all that music became *very* important, because that was all you could play on the radio. Well, that and public domain songs, but pretty soon everyone was bored of hearing \"I Dream of Jeannie With The Light Brown Hair\".&nbsp; And so there was suddenly a much bigger audience for all the hillbilly and blues performers, all of whom had incorporated the boogie style into their own styles.\n\nAnd then, just as the music industry was getting back on its feet after that, there was what is still the biggest entertainment strike in US history -- the musicians' union strike of 1942-44. This time, the strike didn't affect anyone playing on the radio -- so long as it was a live performance. But because of a dispute over royalties, no instrumentalist was allowed to record for the major record labels for two years.\n\nThis had several effects, all of them profound.\n\nFirstly, the big bands all recorded a *lot* of music to stockpile in the last weeks before the strike, and this meant that the styles that were current in July 1942 effectively stayed current -- at least as far as the record-buying public was concerned. For two years, the only big band music that could be released was from that stockpile, so the music recorded during the boogie fad stayed around longer than it otherwise might have, and remained a major part of the culture.\n\nSecondly, the ban only affected the major labels. Guess who was on the minor labels, the ones that could keep making music and putting it out? That's right, those blues and hillbilly musicians, and those boogie piano players. The same ones whose songs had just spent a year being the only ones the famous bands could play, and now after being given that free publicity by the famous bands, they had no competition from them.\n\nThird -- and this is a real negative effect of the strike, one which is an immense historical tragedy for music lovers -- there was a new form of jazz being invented in New York between 1942 and 1944 by musicians like Dizzy Gillespie and Charlie Parker, people who played in the big bands but were also doing something new in their side gigs. That form later became known as be-bop, or just bop, and is some of the most important music of the twentieth century, but we have no recordings of its birth\n\nAnd fourth -- the strike didn't affect singers. So Tommy Dorsey's band couldn't record anything, but Dorsey's old vocalist, Frank Sinatra, could, backed by a vocal group instead of instrumentalists. And so could lots of other singers.\n\nThe end result of all this was that, at the end of 1944, swing was effectively dead, as was the tradition of instrumentalists being the stars in American music. From that time on, the stars would stop being trombone players like Glenn Miller or clarinetists like Benny Goodman -- or piano players like Pete Johnson. Instead they were singers, like Frank Sinatra -- and like Joe Turner. The swing musicians either went into bebop, and thus more or less vanish from this story (though their own story is always worth following up), or they went into playing the new forms of music that had sprung up, in particular one form which was inspired by swing bands like Lionel Hampton's and Count Basie's, but also by the boogie music that had influenced them, and by the blues. That form was called rhythm and blues, and Joe Turner became one of its biggest stars.\n\nSeventeen years after \"Roll 'Em Pete\", Joe Turner recorded another song, which became his most well-known contribution to popular music. That song was written by the songwriter Jesse Stone -- though he was using the name \"Charles Calhoun\", because he was a member of ASCAP under his real name, and this was a BMI song if ever there was one -- but you can hear that there's a very, very clear line to \"Roll 'Em Pete\". The main difference here is that the backbeat is now stressed, almost to the point of parody, because \"Shake, Rattle, and Roll\" is a rock and roll song.\n\nWe'll be hearing more about Jesse Stone in a few songs' time, but for now we'll just talk about this song. That's Connie Kay, the drummer from the Modern Jazz Quartet, you can hear there doing that \"whap, whap\" snare drum playing. It's safe to say that's not the subtlest piece of drumming he ever did, but it may well be the most influential.\n\n\"Shake, Rattle, and Roll\" is definitely the *same kind of thing* as \"Roll 'Em Pete\", isn't it? The piano playing is similar, Turner's blues shouting is the same kind of thing, the vocal melody is similar, both are structured around twelve-bar blueses, and both songs are made up largely of floating lyrics. But \"Shake Rattle and Roll\" is rock and roll, and it was covered by both Bill Haley and Elvis Presley, the two biggest white rock and roll singers of the time, and Turner would perform it on shows promoted by Alan Freed, the man who claimed to have coined the term \"rock and roll\".\n\nSo what makes the difference? Well, firstly that backbeat from Connie Kay, that gives it a much bigger forward momentum. But there's a few other things as well -- influences from other genres that fed into rock and roll.\n\nThere's the obvious one, of the saxophone. That's from rhythm and blues, and it's something that rhythm and blues got from swing. Remember Ilinois Jacquet's solo on \"Flying Home\" from last episode? That's a very clear progenitor for this.\n\nBut there's also the influence of another type of song -- one most people who talk about the origins of rock and roll don't even think of as being a separate type of music, as it just gets rolled up into \"blues\".\n\nThe hokum song is a type of music with a long history, which can trace its origins through vaudeville back to minstrel songs. It was originally for comedy performances more than anything else, but later a whole subgenre of them started being just songs about sex. Some of the more euphemistic of them are songs like \"Fishing Pole Blues\", which has lines like \"want to go fishing in my fishing hole/If you want to fish with me you'd better have a great big pole\", or songs called things like \"Banana in my Fruit Basket\", I Want a Hot-Dog in my Roll\", \"It's Tight Like That\" and \"Warm My Weiner\".\n\nThere were less euphemistic songs, too, called things like \"Bull Dyke Blues\", but I won't look at those in any more detail here as I don't want this podcast to get put in an \"adults only\" section. Suffice to say, there was plenty of very, very obscene music as well as the comedy songs and the more euphemistic material.\n\nAnd the other thing about hokum songs is that they stuck to a fairly straightforward formula. There weren't the complicated structures of the Tin Pan Alley songs of the time, there was a simple pattern of a verse which had different lyrics every time and a chorus which was always the same, and the two would alternate. The chorus would usually be a twelve-bar blues, and more often than not so would the verse, though sometimes it would be an eight-bar blues instead.\n\nAnd this is the pattern that you would get in rock and roll songs throughout the fifties. It's the pattern of \"Tutti Frutti\", of \"Maybellene\", of \"Rock Around the Clock\", and of \"Shake Rattle and Roll\". And \"Shake Rattle and Roll\", while it's not the dirtiest song in history or anything, is certainly fairly blatant about its subject matter.\n\n(Hilariously, Bill Haley's cover version is famously \"cleaned up\" -- they took out lines like \"the way you wear those dresses, the sun comes shining through\" and \"I believe to my soul you're the devil in nylon hose\" in case they were too dirty. But they left in \"I'm like a one-eyed cat peeping in a sea-food store\"...)\n\nSo that's what rock and roll was, in its early stages -- a blues shouter, singing over a boogie-inspired piano part, with a backbeat on the snare drum, a structure and lyrics patterned after the hokum song, and horns coming out of swing music. And there is a very, very clear line to that from \"Roll 'Em Pete\", and the boogie-woogie revival of 1938, and the \"Spirituals to Swing\" concerts.\n\nBut wait... isn't the cliche that rock and roll comes from R&B mixed with country music? Where's all the country music in this?\n\nWell, that cliche is slightly wrong. Rock doesn't have much influence from the country music, but it has a lot of influence from Western music. And for that, we'll have to wait until next episode.\n\n<strong>Patreon</strong>\nAs always, this podcast only exists because of the donations of my backers on Patreon. If you enjoy it, <a href=\"http://patreon.com/andrewhickey\">why not join them?</a>",
  "itunes:subtitle": "Heres the second episode, on Roll Em Pete by Big Joe Turner and Pete Johnson. One erratum before we continue -- in the episode, I say that Shake, Rattle, and Roll follows a particular formula common in hokum songs. Thats not actually true for the origina",
  "itunes:keywords": "1940s music strikes,ASCAP,backbeat,Big Bill Broonzy,Big Joe turner,Bill Haley,BMI,boogie woogie,Carnegie Hall,hokum song,Jesse Stone,John Hammond,Lionel Hampton,Pete Johnson,Sister Rosetta Tharpe,swing",
  "itunes:episodeType": "full",
  "itunes:episode": 2,
  "content:encoded": "Here's the second episode, on \"Roll 'Em Pete\" by Big Joe Turner and Pete Johnson. One erratum before we continue -- in the episode, I say that \"Shake, Rattle, and Roll\" follows a particular formula common in hokum songs. That's not actually true for the original version -- it <em>is</em> true for Bill Haley's cover version, and Elvis' and the versions after them, but in Joe Turner's version the part we now know as the chorus didn't come in until near the end. Sorry about the mistake.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've put together a Mixcloud mix of all the songs talked about in this episode, which you can stream <a href=\"https://www.mixcloud.com/AndrewHickey/roll-em-pete/\">here</a>. That mix has \"In the Mood\" and \"the Booglie Wooglie Piggy\" by Glenn Miller, \"Roll 'Em Pete\" and \"It's All Right Baby\" by Joe Turner and Pete Johnson, \"Shake, Rattle, and Roll\" by Joe Turner, \"I Need A Little Sugar in my Bowl\" by Bessie Smith, \"Pinetop's Boogie Woogie\" by Pinetop Smith, and \"Shake, Rattle, and Roll by Bill Haley\n\nFor all the episodes on pre-1954 music, one invaluable source is the book \"<a href=\"https://amzn.to/2OS4iaN\">Before Elvis\" by Larry Birnbaum</a>, which goes into these subjects in far more detail than I can.\n\n<a href=\"https://amzn.to/2DFs8p9\">Lionel Hampton's autobiography is out of print,</a> but you can find second hand copies very cheap.\n\nThe Spirituals to Swing concerts have been released on CD, but sadly that's also out of print -- <a href=\"https://amzn.to/2DF9vlj\">this</a> is the definitive version, but hopefully at some point they'll get a rerelease at a reasonable price.\n\n<strong>Transcript</strong>\n\n\"It's got a backbeat, you can't lose it\" -- in Chuck Berry's classic song \"Rock and Roll Music\", that's the only line that actually talks about what the music is. The backbeat is, to all intents and purposes , the thing that differentiates early rock and roll from the music that preceded it. And like all of early rock and roll, it's something that had predecessors in rock's pre-history.\n\nIf you don't know what a backbeat is... well, in the days of swing, and even on a lot of very early rock and roll records, the typical beat you'd have is one called a shuffle, which sounds like you'd expect from the name, it's a sort of tit-tit-tit-tit [demonstrates] kind of sound, and you'd generally stress the first beat in the bar. [demonstrates] ONE-and-two-and-three-and-four-and-ONE-and-two-and-three-and-four-and.\n\nThe shuffle rhythm was *the* swing rhythm -- so much so that often you'll see \"shuffle rhythm\" and \"swing time\" used interchangeably. Listen, for example, to the introduction to \"In the Mood\" by the Glenn Miller Orchestra, the biggest-selling swing record of all time [plays section of song].\n\nThat's a shuffle. That's swing music, and that rhythm was the basis of almost all pre-war popular music, one way or the other. It's a good, strong, sound -- there's a reason why it was popular -- but... it's a little bit polite. A little bit tame.\n\nA backbeat, on the other hand, gives you a straight, simple, pulse. You stress the second and fourth beats in a bar -- boom BAP boom BAP boom BAP boom BAP. It's a simpler rhythm, but a more exciting one. That's the rhythm that made rock and roll.\n\nPlayers in blues and jazz music had been using that rhythm, off and on, since the 1920s. Lionel Hampton, in his autobiography, talking about his earliest work as a drummer before switching to vibraphone, says \"I had a different style on drums. I was already playing with a heavy afterbeat, getting that rock-and-roll beat that wouldn't even get popular until the 1950s. I wanted people to dance, have a good time, clap their hands, and they would do it to my drumming.\"\n\nAnd that's what a backbeat does -- it gives people somewhere to clap their hands, a very clear signal, you clap on TWO and FOUR.\n\nBut while Hampton was playing like that, he was never recorded doing that, and nor were any other drummers at the time. In fact, the first recording in the prehistory of rock generally credited as having a backbeat doesn't even have a drummer on it at all. Rather, it features just a vocalist, Big Joe Turner, and a piano player, Pete Johnson. The song, which was recorded in December 1938, is called \"Roll 'Em Pete\".\n\nNow, before we go any further, I want to say something about that \"generally credited\". There are two problems with it -- the first is that \"Roll 'Em Pete\", at least in the version recorded under that name, doesn't have a particularly pronounced backbeat at all, and the second is that there *were* other records being made, long before 1938, which do. But that's the way of these things, as we'll see over and over again. The first anything is messy.\n\nBut \"Roll 'Em Pete\" is still a hugely important record, in ways that are more important than whether it has a backbeat on it. So let's have a look at it.\n\nPete Johnson was a boogie-woogie player -- yet another of the musical streams which fed into early rock and roll. Boogie woogie was a style of piano playing that became popular in the 1930s, where the left hand would play a strong bassline -- you almost certainly know the generic boogie bassline style, which goes like this [demonstrates] -- while the right hand would play decorative melodic stuff over it. That bassline and melody combination was the most popular style of playing for a time, and it became the cornerstone of rock piano playing, as well as of country music and much else. The bassline would have eight notes in a typical bar, and \"eight to the bar\" was another term some used for boogie woogie at the time.\n\nBut boogie woogie was, for the most part, based on that shuffle rhythm. Listen to \"Pinetop's Boogie Woogie\" by Pinetop Smith, the first real boogie record, from 1928, and you'll hear a rhythm which isn't so different to that Glenn Miller record from a decade or so later. \"Roll 'Em Pete\" changed that.\n\nPete Johnson was considered one of the greatest exponents of the boogie-woogie style, and in 1938 when John Hammond was putting together his \"Spirituals to Swing\" concerts, it was natural that Hammond would choose Johnson to perform. These concerts -- one in 1938 and one in 1939 -- were probably the most important concerts in popular music history. That's not an exaggeration, by any means, it's just a fact.\n\nAt the beginning of 1938, Hammond had promoted a concert by the Benny Goodman band at Carnegie, and that concert itself had been an impressive event -- it was the first time an integrated band had played Carnegie Hall, and the first time that popular music had been treated as seriously as classical music.\n\nFor a follow-up, at Christmas 1938, Hammond wanted to present only black musicians, but to an integrated audience. He wanted, in fact, to present a history of black music, from \"primitive\" folk forms to big band swing. This was, to say the least, a controversial choice, and in the end the event was sponsored by The New Masses, a magazine published by the Communist Party USA.\n\nAnd the lineup for that show was pretty much a who's who of black American music at the time. Hammond had wanted to get Robert Johnson, but he discovered that Johnson had recently died -- Johnson's place was taken by a then-obscure folk musician called Big Bill Broonzy, who became popular largely on the basis of that appearance. Sonny Terry, Sister Rosetta Tharpe, Meade Lux Lewis, Albert Ammons, the Count Basie Orchestra, and more all appeared, and the show was successful enough that the next year there was a follow-up, with many of the same musicians, which also featured the Benny Goodman Sextet.\n\nFor this show, as well as playing on his own, Pete Johnson was backing a blues shouter called Big Joe Turner. And \"shouter\" was the word for what Turner did. If you don't know about blues shouters, that's unsurprising -- it's a style of music that went out of fashion with the big bands. But a blues shouter was a singer -- usually a man -- who could sing loudly and powerfully enough that he could be heard over a band, without amplification. In the early twentieth century, microphones were unknown at first, and singers had to be able to be heard over the musicians simply by the force of their voices. Some singers used megaphones as a crude form of amplification, but many more simply had to belt out their vocals as loud as they could.\n\nEven after microphones were introduced, they were unreliable and amplification wasn't very powerful. And at the same time bands were getting bigger and louder -- blues shouters like Big Joe Turner could compete with that power, and get a crowd excited by the sheer volume of their voice, even over bands like Count Basie's.\n\nBut for the Carnegie Hall show, Turner and Pete Johnson were playing together, just the two of them. And while they were in New York, they had a recording session, and recorded a track that some say is the first rock and roll record ever.\n\n\"Roll 'Em Pete\" has the first recorded example -- as far as anyone has been able to discover -- of a boogie song which uses a backbeat rather than a shuffle beat. All the musical elements of early rock and roll are there in Pete Johnson's piano part -- in particular, listen to the phrasing in his right-hand part. Those melody lines he's playing, if you transfer them to guitar, are basically the whole of Chuck Berry's guitar style, but you can also hear Jerry Lee Lewis in there.\n\nNow you might be listening to the track and saying to yourself \"I don't really hear that much of a difference with the earlier song -- are you sure it's got more of a backbeat?\"\n\nIf you are, I don't blame you -- but there's a version of this song with a much clearer backbeat, and that's the live recording of Turner and Johnson performing the song at Carnegie Hall the week earlier -- that performance is titled \"It's Alright Baby\" rather than \"Roll 'Em Pete\" on the official recordings, but it's the same song. There, Turner is clapping along on the backbeat, and you can hear the claps clearly.\n\nNow this isn't a clearcut differentiation -- you can play music in such a way that you can have a shuffle beat going up against a backbeat, and that's a lot of what's going on in boogie music of this period, and the two rhythms rubbing up against each other is a lot of what drives early rock and roll. Talking about a \"first backbeat record\" is almost as ridiculous as talking about a \"first rock and roll record\" or a \"first soul record\". And the more I've listened to this song and the other music of its time, the less convinced I am that this specific song has something altogether new. But still, it's a great example of boogie, of blues, and of the music that would become rock and roll, and it's one you can clearly point to and say \"that has all the elements that will later go into rock and roll music. Perhaps not in exactly the same proportions, perhaps not in a way that's massively different from its predecessors, but like \"Flying Home\", which we talked about last time, it's as good a place to start as any.\n\nAnd this is, have no doubt about it, a record of important performers.\n\nBefore we go into why, we'll talk briefly about the song, and particularly about the lyrics -- or, more precisely, the way that they aren't really coherent lyrics at all. This is something we'll be seeing a lot of in the future -- a blues tradition called \"floating lyrics\". A song like \"Roll 'Em Pete\", you see, isn't really a song in the conventional sense. There's a melodic structure there, and over that melodic structure the singer would improvise. And when blues singers improvised, they'd tend to pull out lyrics from a set of pre-existing phrases that they knew worked. \"Well, I got a gal, she lives up on the hill/Well, this woman's tryin' to quit me, Lord, but I love her still\" is the opening line, and that is one of those floating lyrics -- though sometimes, depending on the singer, the women says she loves me but I don't believe she will, or doesn't love me but her sister will.\n\nMost of Turner's songs were made up of these floating lyrics, and this is something we'll see happening more in the early years of rock and roll, as we look at those. The whole idea of floating lyrics, sadly, makes authorship claims for songs somewhat difficult, and rock and roll, like blues and country before it, was essentially a folk artform to start with. We'll see several examples of people taking credit as \"songwriters\" for things that are put together from a bunch of pre-existing elements, striking it lucky, and becoming millionaires as a result.\n\nTurner and Johnson could stretch \"Roll 'Em Pete\" out to an hour sometimes, with Turner just singing new lyrics as needed, and no recording can really capture what they were doing in live performance -- and this is the problem with much of the prehistory of rock and roll, as so much of it was created by musicians who were live performers first and recording artists a distant second, if at all.\n\nBut those live performances mattered. In 1938, when Pete Johnson and Albert Ammons made their appearances in the Spirituals to Swing shows, boogie woogie was something of a minority form -- it was something that had had a brief popularity a decade earlier and which was largely forgotten. That show changed that, and suddenly boogie woogie was the biggest thing in music -- every big band started playing boogie woogie music, adapted to the big band style. The Andrews Sisters sang about \"the boogie woogie bugle boy of company B\" and wanted you to \"beat me daddy, eight to the bar\" (and then, presumably feeling dirty after that, wanted you to \"scrub me mama to a boogie beat\"). Tommy Dorsey recorded \"Pinetop's Boogie Woogie\" (renamed as \"TD's Boogie Woogie\"), and you got... well, things like this.\n\n[play excerpt of \"The Booglie Wooglie Piggy\" by Glenn Miller]\n\nThat's the Glenn Miller Orchestra, the biggest band of the forties, with Tex Beneke singing about a booglie wooglie piggy. They don't write them like that any more.\n\nMost of this music, as you can hear, was still using that swing beat, but it was clearly boogie woogie music, and that became the biggest style of music in late-period big band music, the music that was popular in the early 1940s. Even in songs that aren't directly about being boogie-woogie -- like, say, Glenn Miller's \"Chatanooga Choo Choo\" -- you still get that boogie rhythm, and nods to the generic boogie bassline and you get lines like \"when you hear that whistle blowing eight to the bar, then you know that Tennessee is not very far\".\n\nAnd that influence had a bigger impact than it might otherwise have done, and became something bigger than just a fad, because between 1941 and 1943 a whole host of events conspired to change the music industry forever.\n\nMost importantly, of course, the Second World War reached America, and that caused a lot of problems for the big band industry -- men who would otherwise have been playing in those bands were being drafted, as were men who would otherwise have been going out dancing to those bands.\n\nBut there were two smaller events that, if anything, made even more impact. The first of these was the ASCAP boycott.\n\nThe American Society of Composers and Publishers was -- and still is -- an organisation that represented most of the most important songwriters and music publishers in the USA, the people who had been writing the most successful songs. They collected royalties for live performances and radio plays, and distributed them to the composers and publishers who made up their membership. And they only dealt with the respectable Tin Pan Alley composers, but that covered enough songs -- in the early forties they had a repertoire of one and a quarter million songs, including all the most popular songs that the big bands were playing.\n\nAnd then for ten months in 1941, they banned all the radio stations in the USA from playing any of their songs, over a royalty dispute.\n\nThis should have been catastrophic for the radio stations, and would have been if there hadn't been another organisation, BMI, set up as a rival to ASCAP a couple of years earlier. BMI dealt with only the low-class music -- the blues, and country songs, and gospel songs, and hillbilly music, and boogie. The stuff ASCAP didn't think was important.\n\nExcept that now all that music became *very* important, because that was all you could play on the radio. Well, that and public domain songs, but pretty soon everyone was bored of hearing \"I Dream of Jeannie With The Light Brown Hair\".&nbsp; And so there was suddenly a much bigger audience for all the hillbilly and blues performers, all of whom had incorporated the boogie style into their own styles.\n\nAnd then, just as the music industry was getting back on its feet after that, there was what is still the biggest entertainment strike in US history -- the musicians' union strike of 1942-44. This time, the strike didn't affect anyone playing on the radio -- so long as it was a live performance. But because of a dispute over royalties, no instrumentalist was allowed to record for the major record labels for two years.\n\nThis had several effects, all of them profound.\n\nFirstly, the big bands all recorded a *lot* of music to stockpile in the last weeks before the strike, and this meant that the styles that were current in July 1942 effectively stayed current -- at least as far as the record-buying public was concerned. For two years, the only big band music that could be released was from that stockpile, so the music recorded during the boogie fad stayed around longer than it otherwise might have, and remained a major part of the culture.\n\nSecondly, the ban only affected the major labels. Guess who was on the minor labels, the ones that could keep making music and putting it out? That's right, those blues and hillbilly musicians, and those boogie piano players. The same ones whose songs had just spent a year being the only ones the famous bands could play, and now after being given that free publicity by the famous bands, they had no competition from them.\n\nThird -- and this is a real negative effect of the strike, one which is an immense historical tragedy for music lovers -- there was a new form of jazz being invented in New York between 1942 and 1944 by musicians like Dizzy Gillespie and Charlie Parker, people who played in the big bands but were also doing something new in their side gigs. That form later became known as be-bop, or just bop, and is some of the most important music of the twentieth century, but we have no recordings of its birth\n\nAnd fourth -- the strike didn't affect singers. So Tommy Dorsey's band couldn't record anything, but Dorsey's old vocalist, Frank Sinatra, could, backed by a vocal group instead of instrumentalists. And so could lots of other singers.\n\nThe end result of all this was that, at the end of 1944, swing was effectively dead, as was the tradition of instrumentalists being the stars in American music. From that time on, the stars would stop being trombone players like Glenn Miller or clarinetists like Benny Goodman -- or piano players like Pete Johnson. Instead they were singers, like Frank Sinatra -- and like Joe Turner. The swing musicians either went into bebop, and thus more or less vanish from this story (though their own story is always worth following up), or they went into playing the new forms of music that had sprung up, in particular one form which was inspired by swing bands like Lionel Hampton's and Count Basie's, but also by the boogie music that had influenced them, and by the blues. That form was called rhythm and blues, and Joe Turner became one of its biggest stars.\n\nSeventeen years after \"Roll 'Em Pete\", Joe Turner recorded another song, which became his most well-known contribution to popular music. That song was written by the songwriter Jesse Stone -- though he was using the name \"Charles Calhoun\", because he was a member of ASCAP under his real name, and this was a BMI song if ever there was one -- but you can hear that there's a very, very clear line to \"Roll 'Em Pete\". The main difference here is that the backbeat is now stressed, almost to the point of parody, because \"Shake, Rattle, and Roll\" is a rock and roll song.\n\nWe'll be hearing more about Jesse Stone in a few songs' time, but for now we'll just talk about this song. That's Connie Kay, the drummer from the Modern Jazz Quartet, you can hear there doing that \"whap, whap\" snare drum playing. It's safe to say that's not the subtlest piece of drumming he ever did, but it may well be the most influential.\n\n\"Shake, Rattle, and Roll\" is definitely the *same kind of thing* as \"Roll 'Em Pete\", isn't it? The piano playing is similar, Turner's blues shouting is the same kind of thing, the vocal melody is similar, both are structured around twelve-bar blueses, and both songs are made up largely of floating lyrics. But \"Shake Rattle and Roll\" is rock and roll, and it was covered by both Bill Haley and Elvis Presley, the two biggest white rock and roll singers of the time, and Turner would perform it on shows promoted by Alan Freed, the man who claimed to have coined the term \"rock and roll\".\n\nSo what makes the difference? Well, firstly that backbeat from Connie Kay, that gives it a much bigger forward momentum. But there's a few other things as well -- influences from other genres that fed into rock and roll.\n\nThere's the obvious one, of the saxophone. That's from rhythm and blues, and it's something that rhythm and blues got from swing. Remember Ilinois Jacquet's solo on \"Flying Home\" from last episode? That's a very clear progenitor for this.\n\nBut there's also the influence of another type of song -- one most people who talk about the origins of rock and roll don't even think of as being a separate type of music, as it just gets rolled up into \"blues\".\n\nThe hokum song is a type of music with a long history, which can trace its origins through vaudeville back to minstrel songs. It was originally for comedy performances more than anything else, but later a whole subgenre of them started being just songs about sex. Some of the more euphemistic of them are songs like \"Fishing Pole Blues\", which has lines like \"want to go fishing in my fishing hole/If you want to fish with me you'd better have a great big pole\", or songs called things like \"Banana in my Fruit Basket\", I Want a Hot-Dog in my Roll\", \"It's Tight Like That\" and \"Warm My Weiner\".\n\nThere were less euphemistic songs, too, called things like \"Bull Dyke Blues\", but I won't look at those in any more detail here as I don't want this podcast to get put in an \"adults only\" section. Suffice to say, there was plenty of very, very obscene music as well as the comedy songs and the more euphemistic material.\n\nAnd the other thing about hokum songs is that they stuck to a fairly straightforward formula. There weren't the complicated structures of the Tin Pan Alley songs of the time, there was a simple pattern of a verse which had different lyrics every time and a chorus which was always the same, and the two would alternate. The chorus would usually be a twelve-bar blues, and more often than not so would the verse, though sometimes it would be an eight-bar blues instead.\n\nAnd this is the pattern that you would get in rock and roll songs throughout the fifties. It's the pattern of \"Tutti Frutti\", of \"Maybellene\", of \"Rock Around the Clock\", and of \"Shake Rattle and Roll\". And \"Shake Rattle and Roll\", while it's not the dirtiest song in history or anything, is certainly fairly blatant about its subject matter.\n\n(Hilariously, Bill Haley's cover version is famously \"cleaned up\" -- they took out lines like \"the way you wear those dresses, the sun comes shining through\" and \"I believe to my soul you're the devil in nylon hose\" in case they were too dirty. But they left in \"I'm like a one-eyed cat peeping in a sea-food store\"...)\n\nSo that's what rock and roll was, in its early stages -- a blues shouter, singing over a boogie-inspired piano part, with a backbeat on the snare drum, a structure and lyrics patterned after the hokum song, and horns coming out of swing music. And there is a very, very clear line to that from \"Roll 'Em Pete\", and the boogie-woogie revival of 1938, and the \"Spirituals to Swing\" concerts.\n\nBut wait... isn't the cliche that rock and roll comes from R&B mixed with country music? Where's all the country music in this?\n\nWell, that cliche is slightly wrong. Rock doesn't have much influence from the country music, but it has a lot of influence from Western music. And for that, we'll have to wait until next episode.\n\n<strong>Patreon</strong>\nAs always, this podcast only exists because of the donations of my backers on Patreon. If you enjoy it, <a href=\"http://patreon.com/andrewhickey\">why not join them?</a>",
  "enclosure": "",
  "itunes:summary": "Here's the second episode, on \"Roll 'Em Pete\" by Big Joe Turner and Pete Johnson. One erratum before we continue -- in the episode, I say that \"Shake, Rattle, and Roll\" follows a particular formula common in hokum songs. That's not actually true for the original version -- it is true for Bill Haley's cover version, and Elvis' and the versions after them, but in Joe Turner's version the part we now know as the chorus didn't come in until near the end. Sorry about the mistake.\n\n\n\nResources\n\nAs always, I've put together a Mixcloud mix of all the songs talked about in this episode, which you can stream here. That mix has \"In the Mood\" and \"the Booglie Wooglie Piggy\" by Glenn Miller, \"Roll 'Em Pete\" and \"It's All Right Baby\" by Joe Turner and Pete Johnson, \"Shake, Rattle, and Roll\" by Joe Turner, \"I Need A Little Sugar in my Bowl\" by Bessie Smith, \"Pinetop's Boogie Woogie\" by Pinetop Smith, and \"Shake, Rattle, and Roll by Bill Haley\n\nFor all the episodes on pre-1954 music, one invaluable source is the book \"Before Elvis\" by Larry Birnbaum, which goes into these subjects in far more detail than I can.\n\nLionel Hampton's autobiography is out of print, but you can find second hand copies very cheap.\n\nThe Spirituals to Swing concerts have been released on CD, but sadly that's also out of print -- this is the definitive version, but hopefully at some point they'll get a rerelease at a reasonable price.\n\nTranscript\n\n\"It's got a backbeat, you can't lose it\" -- in Chuck Berry's classic song \"Rock and Roll Music\", that's the only line that actually talks about what the music is. The backbeat is, to all intents and purposes , the thing that differentiates early rock and roll from the music that preceded it. And like all of early rock and roll, it's something that had predecessors in rock's pre-history.\n\nIf you don't know what a backbeat is... well, in the days of swing, and even on a lot of very early rock and roll records, the typical beat you'd have is one called a shuffle, which sounds like you'd expect from the name, it's a sort of tit-tit-tit-tit [demonstrates] kind of sound, and you'd generally stress the first beat in the bar. [demonstrates] ONE-and-two-and-three-and-four-and-ONE-and-two-and-three-and-four-and.\n\nThe shuffle rhythm was *the* swing rhythm -- so much so that often you'll see \"shuffle rhythm\" and \"swing time\" used interchangeably. Listen, for example, to the introduction to \"In the Mood\" by the Glenn Miller Orchestra, the biggest-selling swing record of all time [plays section of song].\n\nThat's a shuffle. That's swing music, and that rhythm was the basis of almost all pre-war popular music, one way or the other. It's a good, strong, sound -- there's a reason why it was popular -- but... it's a little bit polite. A little bit tame.\n\nA backbeat, on the other hand, gives you a straight, simple, pulse. You stress the second and fourth beats in a bar -- boom BAP boom BAP boom BAP boom BAP. It's a simpler rhythm, but a more exciting one. That's the rhythm that made rock and roll.\n\nPlayers in blues and jazz music had been using that rhythm, off and on, since the 1920s. Lionel Hampton, in his autobiography, talking about his earliest work as a drummer before switching to vibraphone, says \"I had a different style on drums. I was already playing with a heavy afterbeat, getting that rock-and-roll beat that wouldn't even get popular until the 1950s. I wanted people to dance, have a good time, clap their hands, and they would do it to my drumming.\"\n\nAnd that's what a backbeat does -- it gives people somewhere to clap their hands, a very clear signal, you clap on TWO and FOUR.\n\nBut while Hampton was playing like that, he was never recorded doing that, and nor were any other drummers at the time. In fact, the first recording in the prehistory of rock generally credited as having a backbeat doesn't even have a drummer on it at all. Rather, it features just a vocalist, Big Joe Turner, and a piano player, Pete Johnson. The song, which was ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Here's the second episode, on \"Roll 'Em Pete\" by Big Joe Turner and Pete Johnson. One erratum before we continue -- in the episode, I say that \"Shake, Rattle, and Roll\" follows a particular formula common in hokum songs. That's not actually true for the original version -- it is true for Bill Haley's cover version, and Elvis' and the versions after them, but in Joe Turner's version the part we now know as the chorus didn't come in until near the end. Sorry about the mistake.\n\n\n\nResources\n\nAs always, I've put together a Mixcloud mix of all the songs talked about in this episode, which you can stream here. That mix has \"In the Mood\" and \"the Booglie Wooglie Piggy\" by Glenn Miller, \"Roll 'Em Pete\" and \"It's All Right Baby\" by Joe Turner and Pete Johnson, \"Shake, Rattle, and Roll\" by Joe Turner, \"I Need A Little Sugar in my Bowl\" by Bessie Smith, \"Pinetop's Boogie Woogie\" by Pinetop Smith, and \"Shake, Rattle, and Roll by Bill Haley\n\nFor all the episodes on pre-1954 music, one invaluable s",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}