{
  "id": "tag:theatlantic.com,2021:50-618741",
  "content": "<p class=\"dropcap\">T<span class=\"smallcaps\">o be a working</span> mother during a global pandemic is to be constantly torn between your kids and your clients. At times in the past year, Amy Conway-Hatcher, a lawyer at a big firm in Washington, D.C., would overhear her two children having dinner with her husband and not be able to join them, because she was working 80-to-100-hour weeks on a big case.</p><p>For Allison Fastow, “having it all” meant listening to her 6-year-old sob and bang on her door in search of comfort and not being able to give it to him, because she was in the middle of an important call. “The distance that you have as a parent working outside of the home keeps you from seeing these things,” she told me, and then started to cry. Parents might tell themselves, <em>My kids love their nanny; they love their teacher</em>. But sometimes, in moments of anxiety and uncertainty and stress, Fastow said, “there really is no replacement for Mom and Dad.”</p><p>Last spring, Molly Quigley was working seven days a week as the communications director for Clyde’s, a restaurant group in D.C. Many days, she, too, was in tears, because part of her job was laying off the restaurants’ workers. Meanwhile, her three kids were posted up all around her, doing Zoom school. “I was just, like, yelling at everybody all day long,” she told me. “And my 6-year-old wasn’t staying on his Zoom class. And I finally realized, <em>I just can’t do it all</em>.”</p><p>All three women—Quigley, Fastow, and Conway-Hatcher—have since left their ultra-demanding jobs or are about to. For working parents, “what was barely doable has become impossible,” says Katie Porter, a single mother who represents Orange County, California, in Congress. At one point during a recent Zoom hearing, Porter’s teenage son wandered into the background and began rooting around in the fridge.</p><p>In part because of pressures like these, nearly 2.5 million <a href=\"https://www.nytimes.com/2021/02/18/us/politics/women-pandemic-harris.html\">women have</a> left the workforce since the pandemic began. About <a href=\"https://www.mckinsey.com/featured-insights/diversity-and-inclusion/women-in-the-workplace\">a third of mothers</a> are considering “downshifting” their careers or pulling out of the workforce, according to research from the consulting firm McKinsey. This is the first time in six years that the consultancy has found women expressing such a strong interest in working less. “They were feeling a lot more burned out; they were feeling like they have extra responsibilities outside of the workplace, and not having flexibility at work,” Jess Huang, an author of the McKinsey report, told me.</p><p>This downshifting is barely perceptible in national data: The Bureau of Labor Statistics reports <a href=\"https://www.bls.gov/news.release/empsit.t08.htm\">a slight increase</a> in part-time work since the pandemic started, but that is among workers doing so for economic reasons, because they couldn’t find full-time work. Lower-income people have fewer choices than rich people—they might be working a part-time job because that’s all that’s available, or because they can’t afford child care for longer, or because more hours would have meant more exposure to COVID-19.</p><p><a href=\"https://www.theatlantic.com/magazine/archive/2017/09/the-queen-bee-in-the-corner-office/534213/?utm_source=feed\"><em>[ Read: Why women bully each other at work ]</em></a></p><p>But some women have been so worn down by the competing stressors of the pandemic that they welcome the shift to fewer paid working hours. Over the past several weeks, I’ve talked with half a dozen professional women who have left their full-time jobs, are now working less than full time, and are happier as a result. The women I interviewed are immensely lucky. Most of them have a partner who also brings in income. Most of them made enough at their previous jobs to allow for a brief, low-speed detour. Most of them work in fields in which freelancing or part-time contract work is an option. High-paid office workers, the types of people I interviewed, are “making choices around work based on their level of sanity, or level of insanity, that they’re willing to put up with,” says Misty Heggeness, a research economist at the U.S. Census Bureau who focuses on families. The level of insanity, never particularly low, has now become more than many can withstand.</p><p class=\"dropcap\">S<span class=\"smallcaps\">ome of the women</span> I spoke with hesitated to admit they were working less; that is not the way of the boss lady. Through Sheryl Sandberg, Gloria Steinem, Barbie, Ann Taylor, the real-estate market, <em>Sex and the City</em>, and practically every other implement of capitalism, white-collar moms have absorbed the message that you should work as hard as you can and make as much money as humanly possible. Working fewer hours in order to spend more time with your kids isn’t leaning in. It is anachronistic.</p><p>But the pandemic has reset expectations for how life is supposed to be. When schools and day cares closed, and <a href=\"https://www.theatlantic.com/politics/archive/2020/09/limited-child-care-options-essential-workers/615931/?utm_source=feed\">no free child-care options</a> were available in many states, some parents said, <em>Well, if the government won’t help me take care of my family, I guess I will do it myself. </em>“The pandemic kind of forced people to reconsider the enormous sacrifices that they have made over the years for career, job earnings, and market income,” says Nancy Folbre, an economics professor at the University of Massachusetts at Amherst. (She notes that we are less likely to hear from the women who are desperate to get away from their families and back to a full workweek. <em>Not </em>wanting to do care work is even more socially unacceptable than a desire to spend more time with one’s children.)</p><p>Some left their jobs voluntarily, others were laid off, and still others were fed up with crappy work environments. At her small newspaper in Missouri, Karen Craigo was tired of working for a boss who would ask for her suggestions, only to immediately reject all of them. “It really doesn’t matter what I said; it was always ‘No,’” she told me. She quit to do freelance writing, and she now feels as if she gets more positive reinforcement from clients.</p><p>A lot of things were pushing Leslie Gray Streeter out of Florida when she left her job at <em>The</em> <em>Palm Beach Post</em> to move to Baltimore last year. Streeter, the author of the book <a href=\"https://www.amazon.com/dp/B07V31SVNX/ref=dp-kindle-redirect?_encoding=UTF8&amp;btkr=1\"><em>Black Widow</em></a>, told me she wanted to be near her extended family and raise her son in a more diverse area. She was terrified by Florida’s lackadaisical approach to COVID-19. And her beloved paper, where she had worked for 18 years, had gone through a series of layoffs and furloughs.</p><p><a href=\"https://www.theatlantic.com/technology/archive/2018/11/facebooks-sheryl-sandberg-leaned-we-just-didnt-like-outcome/576046/?utm_source=feed\"><em>[ Read: How Sheryl Sandberg lost her feminist street cred ]</em></a></p><p>Streeter got a new, corporate job in communications, but the fact that her 7-year-old was learning math in the living room made it hard to focus. “The hours that I was working were very demanding, and I didn’t really get to spend as much time with him,” said Streeter, who co-parents her son with her mother. In February, she switched to freelancing. She’s gotten the chance to do things that don’t require typing furiously on deadline, such as teaching a class for fellow widows or attending a funeral with a friend. “It sounds like a rom-com,” she said. “The woman moves from New York and goes to Apple Valley, and then she realizes it’s okay not to be in the rat race.”</p><p>Even though it might result in making less money, Streeter feels that her decision is the best one for her son. “I wanted to be able to spend time <em>with him</em>,” she told me. “I wanted to be a less stressed-out person<em> for him</em>.”</p><p>Others felt elated that they could now do mom-like activities that their jobs hadn’t allowed time for. Quigley, who is now working about 30 hours a week as a freelancer, has been watching movies with her kids and recently met a friend for coffee, which she rarely did before. She’s coaching her sons’ Little League teams. “I never would have been able to volunteer with such a commitment before, because I felt like I was always on call,” she told me.</p><p>Elsewhere in the world, working part-time is common among women. Only <a href=\"https://www.bls.gov/opub/ted/2017/percentage-of-employed-women-working-full-time-little-changed-over-past-5-decades.htm\">about a quarter</a> of American women work part-time, compared with about 12 percent of men. But the <a href=\"https://data.oecd.org/emp/part-time-employment-rate.htm\">majority</a> of Dutch women work part-time, and nearly 45 percent of Swiss women do. By American standards, these women lead lives of enviable slowness. In a 2010 article for <a href=\"https://slate.com/human-interest/2010/11/women-in-the-netherlands-work-less-have-lesser-titles-and-a-big-gender-pay-gap-and-they-love-it.html\"><em>Slate</em></a>, Jessica Olien, a writer living in the Netherlands, described neighbors who spent the workweek “playing sports, planting gardens, doing art projects, hanging out with their children, volunteering, and meeting their family friends.” As <a href=\"https://www.iza.org/publications/dp/4686/part-time-jobs-what-women-want\">one study</a> on this topic cheerily concluded, “Our results suggest that part-time jobs are what most Dutch women want.”</p><p>But Dutch women pay a price for this freedom: They are <a href=\"https://www.economist.com/the-economist-explains/2015/05/11/why-so-many-dutch-people-work-part-time\">less likely</a> than <a href=\"https://www.catalyst.org/research/women-in-management/\">American women</a> to be managers. And all <a href=\"https://www.economist.com/finance-and-economics/2019/09/05/part-time-jobs-help-women-stay-in-paid-work\">over the world</a>, part-time work tends to convey less prestige and lower pay. If more American women shift to part-time employment, it could worsen the gender pay gap, or result in fewer women leading organizations. “If highly paid professional women” want to work less, Folbre told me, “I think that’s great.” Then again, she said, “I'm not totally sure [these women] really understand just how badly their career trajectories will be affected.”</p><p>In the U.S., high-paying, part-time jobs are not very common, because American bosses tend to frown on workers asking to work less, and existing part-time jobs are less likely to come with high salaries or good benefits. For more American women to work part-time, more companies would have to be willing to hire people part-time. Child care would have to get cheaper and more accessible, because some women currently can’t afford even part-time child care. Paid parental leave would have to become a standard beyond the whitest of white-collar work, so that having a baby didn’t mean risking your job and livelihood. Higher wages would help make the math work, too. And women would need more time on their hands to push for these things. “By making women so stressed out, so time-scarce, we’ve also limited their ability to be active politically and to advocate for what they need,” Representative Porter told me.</p><p>Making part-time work possible for everyone would also require erasing some of its stigma. Instead of saying they work part-time, it’s often more acceptable for professional American women to say they’re consulting or freelancing, says Heggeness, from the U.S. Census Bureau. Entrepreneurship is a proud American tradition; taking it easy is not.</p><p>Working less is something professional women struggle with, even when they’re in hour 14 of the workday and their kids have forgotten what they look like. The women I talked with describe themselves, if not as feminists, then at least as hard workers who never saw quitting as an option, and who—briefly—wondered if going part-time set a bad example for their kids. Fastow, who is a founding partner of her public-affairs firm, Seven Letter, is moving into an internally facing, part-time position with the company. The decision to go part-time was a hard one; she describes herself as an “all in” person, someone who never does anything halfway. “My identity for myself had become wrapped up in this idea of being a big, bad boss bitch,” she said. She came to see the new job as still being all-in, but all-in for her family—and maybe even all-in for her own mental and physical health.</p><p>Feminism, these women decided, doesn’t have to be all about work. Sometimes, in fact, it can mean relaxing a bit, especially in the middle of a global emergency. Conway-Hatcher quit her law-firm job in March, and since then she’s been working on a book. She also joined a smaller law firm run by her friends, which will require fewer hours and offer her more control over her career. “I think you’re a feminist if you’re making choices for yourself,” Conway-Hatcher said. “There are other ways to be successful than billing time.”</p>",
  "author": {
    "name": "Olga Khazan",
    "uri": "http://www.theatlantic.com/author/olga-khazan/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "Jonas Bendiksen / Magnum Photos"
  },
  "title": "The Professional Women Who Are Leaning Out",
  "published": "2021-05-02T07:00:00-04:00",
  "updated": "2021-05-02T09:39:22-04:00",
  "summary": "The competing demands of work and motherhood have some white-collar women choosing part-time work—and loving it.",
  "link": ""
}