{
  "title": "47: Leah Hynes and Naz Murphie on Community, Connection, and Finding Your Purpose",
  "pubDate": "Thu, 10 Mar 2016 19:02:00 +0000",
  "guid": "0c5cadb85ce40bdb87d1f36d6ba04a78",
  "link": "https://lifeonpurpose.libsyn.com/47-leah-hynes-and-naz-murphie-on-community-connection-and-finding-your-purpose",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #47</strong>, my guests are Leah Hynes and Naz Murphie, the Founders of <strong>RYPL – Rock Your Purpose Live</strong>. They joined me for an inspired conversation about the crucial importance of community for support and guidance as well as connecting with like-minded people as we each find our life purpose and then work to turn our goals into action.</p>\n<p>We also discuss each of their life stories, as they've taken the sometime difficult lessons learned creating a life on their own terms and now apply those lessons to helping others do that same.<br /><br />About: <strong>Leah Hynes</strong> and <strong>Naz Murphie</strong> are the Founders of <strong>RYPL – Rock Your Purpose Live</strong>- a community of more than 10,000 people all around the world crazy enough to believe we can change the world! They both did all the ‘right’ things that others said would make them happy, yet each realized there was something BIG missing. <br /><br />So in 2012, they joined forces to make a real difference. And now \"Whether you are just starting out on your journey to find what positive impact you want to have on the world or you already know and are interested in having your dream put into action, these driven ladies know how to get you there.\"<br /><br />To learn more about <strong>Leah</strong> & <strong>Naz</strong> and their work, visit: h<a href=\"http://rypl.rocks/\" target=\"_blank\">ttp://rypl.rocks/</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #47, my guests are Leah Hynes and Naz Murphie, the Founders of RYPL – Rock Your Purpose Live. They joined me for an inspired conversation about the crucial importance of community for support and guidance as well as connecting with like-minded people as we each find our life purpose and then work to turn our goals into action.</p>\n<p>We also discuss each of their life stories, as they've taken the sometime difficult lessons learned creating a life on their own terms and now apply those lessons to helping others do that same.About: Leah Hynes and Naz Murphie are the Founders of RYPL – Rock Your Purpose Live- a community of more than 10,000 people all around the world crazy enough to believe we can change the world! They both did all the ‘right’ things that others said would make them happy, yet each realized there was something BIG missing. So in 2012, they joined forces to make a real difference. And now \"Whether you are just starting out on your journey to find what positive impact you want to have on the world or you already know and are interested in having your dream put into action, these driven ladies know how to get you there.\"To learn more about Leah & Naz and their work, visit: h<a href=\"http://rypl.rocks/\" target=\"_blank\">ttp://rypl.rocks/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "01:04:17",
  "itunes:explicit": true,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #47, my guests are Leah Hynes and Naz Murphie, the Founders of RYPL – Rock Your Purpose Live. They joined me for an inspired conversation about the crucial importance of community for support and guidance as well as..."
}