{
  "title": "Data Science Book Review: Statistics Done Wrong",
  "link": "http://www.dataminingblog.com/data-science-book-review-statistics-done-wrong/",
  "pubDate": "Fri, 01 Sep 2017 19:06:18 +0000",
  "dc:creator": "Sandro Saitta",
  "category": "data mining",
  "guid": "http://www.dataminingblog.com/?p=2446",
  "description": "If you read this blog, you are very likely to be involved in any kind of data collection, manipulation or analysis. When not performed wisely, your analysis will lead you to incorrect conclusions. Alex Reinhart, in his book Statistics Done Wrong, has listed several concepts that are key when analysing data, such as statistical power, [&#8230;]",
  "content:encoded": "<div dir=\"auto\"><img class=\"alignleft size-medium wp-image-2445\" src=\"http://www.dataminingblog.com/wp-content/uploads/stats_done_wrong-198x300.png\" alt=\"\" width=\"198\" height=\"300\" srcset=\"http://www.dataminingblog.com/wp-content/uploads/stats_done_wrong-198x300.png 198w, http://www.dataminingblog.com/wp-content/uploads/stats_done_wrong.png 435w\" sizes=\"(max-width: 198px) 100vw, 198px\" />If you read this blog, you are very likely to be involved in any kind of data collection, manipulation or analysis. When not performed wisely, your analysis will lead you to incorrect conclusions. Alex Reinhart, in his book <em>Statistics Done Wrong</em>, has listed several concepts that are key when analysing data, such as statistical power, correlation/causation and publication bias.</div>\n<div dir=\"auto\"></div>\n<div dir=\"auto\">The book provides interesting advices and warnings related to research papers. Alex clearly explains how people currently use statistics with example of misuse. Statistics Done Wrong provides plenty of examples of statistical misinterpretation&#8230;even done by statisticians.</div>\n<div dir=\"auto\"></div>\n<div dir=\"auto\">The book covers what I would call insidious topics such as the base rate fallacy and the issue of testing several hypotheses, generating a high rate of false positive within p-values. The concept of statistical power, or how you can miss an effect if your sample size is not adequate, is also discussed.</div>\n<div dir=\"auto\"></div>\n<div dir=\"auto\">My only regret is that, starting from Chapter 9, the book suddenly aims at an academic audience with topics related to publication. Out of these last chapters, the book is really dedicated to practitioners in data-related fields. Any Data Scientist should read this book.</div>\n<p><a class=\"a2a_dd addtoany_share_save addtoany_share\" href=\"https://www.addtoany.com/share#url=http%3A%2F%2Fwww.dataminingblog.com%2Fdata-science-book-review-statistics-done-wrong%2F&title=Data%20Science%20Book%20Review%3A%20Statistics%20Done%20Wrong\" data-a2a-url=\"http://www.dataminingblog.com/data-science-book-review-statistics-done-wrong/\" data-a2a-title=\"Data Science Book Review: Statistics Done Wrong\"><img src=\"https://static.addtoany.com/buttons/share_save_171_16.png\" alt=\"Share\"></a></p>"
}