{
  "itunes:episode": 43,
  "title": "Lights, Notes, And Brews From XOXO",
  "pubDate": "Thu, 03 Oct 2013 05:11:00 +0000",
  "link": "http://newdisrupt.org/blog/2013/10/2/lights-notes-and-brews-from-xoxo-episode-43",
  "description": "<p><a href=\"http://2013.xoxofest.com/\">XOXO</a> is a truly remarkable festival and conference that you've heard me talk about quite a lot. I <a href=\"http://newdisrupt.org/blog/2013/6/19/hugs-and-kisses-from-portland-andy-baio-and-andy-mcmillan-on-xoxo\">interviewed Andy Baio and Andy McMillan</a>\n just before they announced the line-up for the 2013 show, which took \nplace in mid-September. At XOXO, I interviewed the folks behind four \ncompanies or projects exhibiting there about what they were up to: <a href=\"http://www.kickstarter.com/projects/cargo/brewbot-the-smart-brewing-appliance\">Brewbot</a>, <a href=\"http://draplin.com/\">Draplin Design</a>, <a href=\"http://www.getprojecteo.com/\">Projecteo</a>, and <a href=\"http://neolucida.com/\">NeoLucida</a>. To read more about the 2013 event, read <a href=\"http://bbs.boingboing.net/t/in-a-time-of-hugs-and-kisses-xoxo-2013/10974\">my account at Boing Boing</a>, Leah Reich's essay \"<a href=\"https://medium.com/xoxo-festival/7efaf0900142\">The Uncanny Valley of Earnestness</a>\" about the place for criticism in the midst of positivity, and Frank Chimero's \"<a href=\"http://frankchimero.com/blog/2013/09/the-inferno-of-independence/\">The Inferno of Independence</a>.\"</p>",
  "guid": "tag:soundcloud,2010:tracks/113607829",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "00:47:57",
  "itunes:subtitle": "XOXO festival special: four live, on-site interviews with interesting makers.",
  "itunes:summary": "XOXO is a truly remarkable festival and conference that you've heard me talk about quite a lot. I interviewed Andy Baio and Andy McMillan just before they announced the line-up for the 2013 show, which took place in mid-September. At XOXO, I interviewed the folks behind four companies or projects exhibiting there about what they were up to: Brewbot, Draplin Design, Projecteo, and NeoLucida."
}