{
  "guid": "7f7c3c72-6807-4883-8423-3a8f97c07e1d",
  "title": "Solomon: The Wisest of the Fools - Wisdom E3",
  "description": "<p>Welcome to our third episode discussing the theme of Wisdom in the bible.</p>\n<p>In this episode, Tim and Jon zoom in on the character Solomon. Was Solomon really the wisest person who ever lived?</p>\n<p>In part 1 (0-8:30), Tim and Jon quickly recap the conversation so far. Tim explains how the English word “help” is inadequate when used to describe Eve’s or woman’s role in relationship to Adam. Instead of an unnecessary addition, it’s more of an essential completion, even a “saving” role that the woman fills. Tim also explains that the tree of the knowledge of good and evil isn’t the perfect translation in the Hebrew. More accurately, it’s “the knowledge of the tree of good and bad.”</p>\n<p>In part 2 (8:30-19:20), Tim begins to trace the human story after Adam and Eve, through Abraham and arriving at Solomon. Tim says that God promises to restore the blessing of Eden to all humanity through the family of Abraham.</p>\n<p>Here is God’s promise to Abraham:</p>\n<p>Genesis 12:1-3<br />\n“And I will make of you a great nation, and I will bless you, and make your name great, so that you will be a blessing. I will bless those who bless you, and him who curses you I will curse; and in you will be blessed all the families of the earth.”</p>\n<p>Genesis 12:7<br />\n“The Lord appeared to Abram and said, ‘To your seed I will give this land.’ So he built an altar there to the Lord who had appeared to him.”<br />\n In Genesis 16, God promises Abraham and Sarah seed and land to be a blessing to the nations. But when they’re unable to have a child, they turn to their own wisdom and power. This is a clear design pattern from the fall narrative of Genesis 3. See below the breakdown of this passage and it’s reflection of the the Eden story.</p>\n<p>Genesis 16:1-2 tells us, “Sarai, Abram’s wife, had borne him no children. But she had an Egyptian slave named Hagar.” So Sarai says to Abram, “Go now into my female servant, perhaps I will be built up from her.”</p>\n<p>(This language of being “built” from Hagar suspiciously reminds us of Genesis 2:22, “and Yahweh God built the side which he took from the human into a woman, and he brought her to the man.”)<br />\n Genesis 16:2b<br />\n“…and Abram listened to the voice of Sarai.”</p>\n<p>(In Genesis 3:17, God says to Adam, “Because you listened to the voice of your wife…”)<br />\n Genesis 16:3-4<br />\n“Sarai, the wife of Abram, took Hagar the Egyptian her female slave… and she gave her to Abram her husband as a wife (Gen. 3:6, “and she gave also to her husband with her”). And he went into her and she became pregnant and she saw that (ותרא כי) she was pregnant, and her mistress became less in her eyes” (Gen. 3:6, “When the woman saw that [ותרא] the tree was good…”).<br />\n Genesis 16:6<br />\n“And Abram said to Sarai, ‘Look, your female slave is in your hand. Do to her what is good in your eyes (טוב בעיניך).’</p>\n<p>(Gen. 3:6, “When the woman saw that the tree was good for food, and that it was a delight to the eyes…”).<br />\n Genesis 16:6b-7<br />\n“So Sarah oppressed her, and Hagar fled from before her. And the angel of Yahweh found her by a spring of waters in the wilderness.”</p>\n<p>(Gen. 3:24, “So [God] drove the man out….”)</p>\n<p>In Genesis 22, when God provides a son from Sarah, God demands his life. God does not take lightly to the oppression of Egyptian slaves (the entire Exodus slavery is an inverted consequence for this sin). Also because of this sin, Ishmael is cast out from Abraham’s family, which grieves God, so he demands that Abraham give Isaac back to him.</p>\n<p>God is looking for people who will trust Yahweh’s word and command over their own wisdom, that will reverse the folly and fear of Adam and Eve. The first character to demonstrate this Abraham in Genesis 22:4-6:</p>\n<p>“And Abraham lifted his eyes (עיניו) and he saw (וירא)… and he took (ויקח) in his hand the fire and the knife/eater(מאכלת), and the two of them (שניהם) walked on together (יחדו).”</p>\n<p>This releases the blessing of Eden through Abraham’s fear of Yahweh out into the nations.<br />\n Genesis 22:15-18 \"Then the angel of the Lord called to Abraham a second time from heaven, and said, “By Myself I have sworn, declares the Lord, because you have done this thing and have not withheld your son, your only son, indeed I will greatly bless you, and I will greatly multiply your seed as the stars of the heavens and as the sand which is on the seashore; and your seed shall possess the gate of their enemies. In your seed all the nations of the earth shall be blessed, because you have listened My voice.”</p>\n<p>The point is this: When humans don’t live by their own wisdom regarding good and bad, but instead trust God’s wisdom and obey his commands (the fear of the Lord), it leads to blessing and life. This is true wisdom: to live in the fear of the Lord.</p>\n<p>In part 3 (19:20-36:45), Tim begins to outline the story of Solomon.</p>\n<p>Tim says Solomon is presented as a new Adam. He has an opportunity to rule the world, and he actually asks God to give him wisdom to rule. Solomon is a complex character, depicted as both a new, ideal Adam—but also as a failed, foolish Adam. In one narrative thread, he is depicted as a new Adam/Abraham, meeting God in a new high-place, and living by God’s wisdom/Torah.</p>\n<p>1 Kings 3:3-15<br />\n“Now Solomon loved the Lord, walking in the statutes of his father David... The king went to Gibeon to sacrifice there, for that was the great high place; Solomon offered a thousand burnt offerings on that altar. In Gibeon the Lord appeared to Solomon in a dream at night; and God said, ‘Ask what you wish me to give you.’</p>\n<p>“Then Solomon said, ‘You have shown great covenant love to Your servant David my father...You have given him a son to sit on his throne, as it is this day. Now, O Lord my God, You have made Your servant king in place of my father David, yet I am but a little child; I do not know to go out or come in. <br />\n“‘Your servant is in the midst of Your people which You have chosen, a great people who are too many to be numbered or counted. So give Your servant a heart that listens in order to govern Your people, in order to discern between good (Heb. tov) and bad (Heb. ra’). For who is able to govern this great people of Yours?’”<br />\n “It was good (tov) in the eyes of the Lord that Solomon had asked this thing. God said to him, ‘Because you have asked this thing, and have not asked for yourself long life, nor have asked riches for yourself, nor have you asked for the life of your enemies, but have asked for yourself discernment to hear justice, behold, I have done according to your words. Behold, I have given you a heart of wisdom and discernment, so that there has been no one like you before you, nor shall one like you arise after you. I have also given you what you have not asked, both riches and honor, so that there will not be any among the kings like you all your days. If you walk in My ways, keeping My statutes and commandments, as your father David walked, then I will prolong your days.’ Then Solomon awoke, and behold, it was a dream.”</p>\n<p>Tim shows how Solomon was blessed after he began to walk in the fear of the lord.</p>\n<p>1 Kings 4:20-21, 25, 29-34 “Judah and Israel were as numerous as the sand that is on the seashore in abundance; they were eating and drinking and rejoicing. Now Solomon ruled over all the kingdoms from the River to the land of the Philistines and to the border of Egypt; they brought tribute and served Solomon all the days of his life….”<br />\n “So Judah and Israel lived in safety, every man under his vine and his fig tree, from Dan even to Beersheba, all the days of Solomon.”<br />\n “Now God gave Solomon wisdom and very great discernment and breadth of mind, like the sand that is on the seashore. Solomon’s wisdom surpassed the wisdom of all the sons of the east and all the wisdom of Egypt. For he was wiser than all men, than Ethan the Ezrahite, Heman, Calcol and Darda, the sons of Mahol; and his fame was known in all the surrounding nations. He also spoke 3,000 proverbs, and his songs were 1,005. He spoke of trees, from the cedar that is in Lebanon even to the hyssop that grows on the wall; he spoke also of beasts and birds and creepers and fish (do you hear Genesis 1 in there?). Men came from all peoples to hear the wisdom of Solomon, from all the kings of the earth who had heard of his wisdom.\"</p>\n<p>Solomon is portrayed as a new Adam, wisely ruling a garden with trees for everyone, fruitful and multiplying, boundaries expanded to Eden-like proportions. He knows the plants, beasts, birds, and creepers. He is more wise than “all the sons of the East” (link to the book of Job). He spoke thousands of proverbs (link to the book of Proverbs). He wrote over a thousand songs (link to Song of Songs). <br />\nTim’s point is that Solomon is beginning to to fulfill the original call of mankind to rule wisely. However, Solomon’s story has another side as well.</p>\n<p>In part 4 (36:45-52:50), Tim outlines the foolish side of Solomon’s life. Solomon enslaved people to help him build Jerusalem up. He imported and exported arms, chariots and horses to other countries. He had hundreds of wives and concubines. Solomon demonstrates wisdom but isn’t fully committed to following the laws of Yahweh.</p>\n<p>1 Kings 5:13-17 “Now King Solomon levied forced laborers from all Israel; and the forced laborers numbered 30,000 men. He sent them to Lebanon, 10,000 a month in relays; they were in Lebanon a month and two months at home. And Adoniram was over the forced laborers. Now Solomon had 70,000 transporters, and 80,000 hewers of stone in the mountains, besides Solomon’s 3,300 chief deputies who were over the project and who ruled over the people who were doing the work. Then the king commanded, and they quarried great stones, costly stones, to lay the foundation of the house with cut stones.”</p>\n<p>1 Kings 9:17, 19 “So Solomon rebuilt Gezer and the lower Beth-horon... and all the storage cities which Solomon had, even the cities for his chariots and the cities for his horsemen….”</p>\n<p>Solomon, for all his wisdom, implemented policies which directly violated the laws of the king as outlined in the Torah.</p>\n<p>Deuteronomy 17:15-20 “you shall surely set a king over you whom Yahweh your God chooses, one from among your countrymen you shall set as king over yourselves; you may not put a foreigner over yourselves who is not your countryman. Moreover, he shall not multiply horses for himself, nor shall he cause the people to return to Egypt to multiply horses, since Yahweh has said to you, ‘You shall never again return that way.’ He shall not multiply wives for himself, or else his heart will turn away; nor shall he greatly increase silver and gold for himself.<br />\n “Now it shall come about when he sits on the throne of his kingdom, he shall write for himself a copy of this Torah on a scroll in the presence of the Levitical priests. It shall be with him and he shall read it all the days of his life, that he may learn to fear Yahweh his God, by carefully observing all the words of this law and these statutes, that his heart may not be lifted up above his brothers and that he may not turn aside from the commandment, to the right or the left, so that he and his sons may continue long in his kingdom in the midst of Israel.</p>\n<p>Tim has found scholar Daniel Hays to be helpful here:</p>\n<p>“We as readers are given a tour of a fantastic, spectacular and opulent mansion, the house of Solomon. Everywhere we look we see wealth and abundance. However, without changing the inflection of his voice the tour guide also points out places where the façade has cracked, revealing a very different structure. Continuing with the standard speech which glorifies the building, the guide nonetheless makes frequent side comments (forced labor, store cities, horses from Egypt, foreign marriages) that make clear that his glowing praise for the structure is not really his honest opinion of the facility, and he wants us also to see the truth. Finally, at the end of the tour in chapters 11, he can restrain himself no more, and he tells us plainly that the building is basically a fraud, covered with a thin veneer of glitz and hoopla, and soon will collapse under its own weight. This is the manner in which the narrator of 1 Kings leads us on a tour of the House of Solomon.” (Daniel Hays, “Narrative Subtlety in 1 Kings 1-11: Does the narrative praise or bury Solomon?”)</p>\n<p>Tim points out that Solomon violates every rule that Israel’s king was supposed to follow. A Bible reader should ask why the narrator is giving us a dual portrait of Solomon?</p>\n<p>In the New Testament, Jesus says, “something greater than Solomon is here.” (Matthew 12:42; Luke 11:31). Jesus positioned himself as the true example of the ideal human who learns wisdom correctly by learning from Yahweh God.</p>\n<p>In part 5 (52:50-end), the guys discuss the seeming asymmetry of male and female portrayals in the Bible. Why is it that a woman is portrayed as a “wise and foolish woman” in Proverbs? Why are women often portrayed with seductive and illicit behavior?</p>\n<p>Tim points out that throughout history, men have been the ones translating the Bible, so they have default and built-in blind spots to understanding and accurately portraying a better view of man and woman’s portrayal in the original Hebrew context.<br />\n Tim notes that women have been making great strides in contributing to and furthering academic and scholastic work on biblical texts and that their voices need to be heard.</p>\n<p>Thank you to all our supporters!</p>\n<p>Show Resources: <br />\n•\twww.thebibleproject.com<br />\n•\tJ. Daniel Hays, “Narrative Subtlety in 1 Kings 1-11: Does the narrative praise or bury Solomon?”</p>\n<p>Show Music:<br />\n•\tRoads by LiQwyd<br />\n•\tYesterday on Repeat by Vexento<br />\n•\tMoon by LeMMino<br />\n•\tself reflection by less.people<br />\n•\tDefender Instrumental by Tents<br />\nSome music for this episode brought to you by the generosity of Chill Hop Music.</p>\n<p>Show Produced by: <br />\nDan Gummel, Jon Collins</p>\n<p>Powered and distributed by Simplecast</p>\n",
  "pubDate": "Mon, 24 Jun 2019 07:00:02 +0000",
  "author": "admin@bibleproject.com (Tim Mackie & Jon Collins)",
  "link": "http://www.bibleproject.com",
  "content:encoded": "<p>Welcome to our third episode discussing the theme of Wisdom in the bible.</p>\n<p>In this episode, Tim and Jon zoom in on the character Solomon. Was Solomon really the wisest person who ever lived?</p>\n<p>In part 1 (0-8:30), Tim and Jon quickly recap the conversation so far. Tim explains how the English word “help” is inadequate when used to describe Eve’s or woman’s role in relationship to Adam. Instead of an unnecessary addition, it’s more of an essential completion, even a “saving” role that the woman fills. Tim also explains that the tree of the knowledge of good and evil isn’t the perfect translation in the Hebrew. More accurately, it’s “the knowledge of the tree of good and bad.”</p>\n<p>In part 2 (8:30-19:20), Tim begins to trace the human story after Adam and Eve, through Abraham and arriving at Solomon. Tim says that God promises to restore the blessing of Eden to all humanity through the family of Abraham.</p>\n<p>Here is God’s promise to Abraham:</p>\n<p>Genesis 12:1-3<br />\n“And I will make of you a great nation, and I will bless you, and make your name great, so that you will be a blessing. I will bless those who bless you, and him who curses you I will curse; and in you will be blessed all the families of the earth.”</p>\n<p>Genesis 12:7<br />\n“The Lord appeared to Abram and said, ‘To your seed I will give this land.’ So he built an altar there to the Lord who had appeared to him.”<br />\n In Genesis 16, God promises Abraham and Sarah seed and land to be a blessing to the nations. But when they’re unable to have a child, they turn to their own wisdom and power. This is a clear design pattern from the fall narrative of Genesis 3. See below the breakdown of this passage and it’s reflection of the the Eden story.</p>\n<p>Genesis 16:1-2 tells us, “Sarai, Abram’s wife, had borne him no children. But she had an Egyptian slave named Hagar.” So Sarai says to Abram, “Go now into my female servant, perhaps I will be built up from her.”</p>\n<p>(This language of being “built” from Hagar suspiciously reminds us of Genesis 2:22, “and Yahweh God built the side which he took from the human into a woman, and he brought her to the man.”)<br />\n Genesis 16:2b<br />\n“…and Abram listened to the voice of Sarai.”</p>\n<p>(In Genesis 3:17, God says to Adam, “Because you listened to the voice of your wife…”)<br />\n Genesis 16:3-4<br />\n“Sarai, the wife of Abram, took Hagar the Egyptian her female slave… and she gave her to Abram her husband as a wife (Gen. 3:6, “and she gave also to her husband with her”). And he went into her and she became pregnant and she saw that (ותרא כי) she was pregnant, and her mistress became less in her eyes” (Gen. 3:6, “When the woman saw that [ותרא] the tree was good…”).<br />\n Genesis 16:6<br />\n“And Abram said to Sarai, ‘Look, your female slave is in your hand. Do to her what is good in your eyes (טוב בעיניך).’</p>\n<p>(Gen. 3:6, “When the woman saw that the tree was good for food, and that it was a delight to the eyes…”).<br />\n Genesis 16:6b-7<br />\n“So Sarah oppressed her, and Hagar fled from before her. And the angel of Yahweh found her by a spring of waters in the wilderness.”</p>\n<p>(Gen. 3:24, “So [God] drove the man out….”)</p>\n<p>In Genesis 22, when God provides a son from Sarah, God demands his life. God does not take lightly to the oppression of Egyptian slaves (the entire Exodus slavery is an inverted consequence for this sin). Also because of this sin, Ishmael is cast out from Abraham’s family, which grieves God, so he demands that Abraham give Isaac back to him.</p>\n<p>God is looking for people who will trust Yahweh’s word and command over their own wisdom, that will reverse the folly and fear of Adam and Eve. The first character to demonstrate this Abraham in Genesis 22:4-6:</p>\n<p>“And Abraham lifted his eyes (עיניו) and he saw (וירא)… and he took (ויקח) in his hand the fire and the knife/eater(מאכלת), and the two of them (שניהם) walked on together (יחדו).”</p>\n<p>This releases the blessing of Eden through Abraham’s fear of Yahweh out into the nations.<br />\n Genesis 22:15-18 \"Then the angel of the Lord called to Abraham a second time from heaven, and said, “By Myself I have sworn, declares the Lord, because you have done this thing and have not withheld your son, your only son, indeed I will greatly bless you, and I will greatly multiply your seed as the stars of the heavens and as the sand which is on the seashore; and your seed shall possess the gate of their enemies. In your seed all the nations of the earth shall be blessed, because you have listened My voice.”</p>\n<p>The point is this: When humans don’t live by their own wisdom regarding good and bad, but instead trust God’s wisdom and obey his commands (the fear of the Lord), it leads to blessing and life. This is true wisdom: to live in the fear of the Lord.</p>\n<p>In part 3 (19:20-36:45), Tim begins to outline the story of Solomon.</p>\n<p>Tim says Solomon is presented as a new Adam. He has an opportunity to rule the world, and he actually asks God to give him wisdom to rule. Solomon is a complex character, depicted as both a new, ideal Adam—but also as a failed, foolish Adam. In one narrative thread, he is depicted as a new Adam/Abraham, meeting God in a new high-place, and living by God’s wisdom/Torah.</p>\n<p>1 Kings 3:3-15<br />\n“Now Solomon loved the Lord, walking in the statutes of his father David... The king went to Gibeon to sacrifice there, for that was the great high place; Solomon offered a thousand burnt offerings on that altar. In Gibeon the Lord appeared to Solomon in a dream at night; and God said, ‘Ask what you wish me to give you.’</p>\n<p>“Then Solomon said, ‘You have shown great covenant love to Your servant David my father...You have given him a son to sit on his throne, as it is this day. Now, O Lord my God, You have made Your servant king in place of my father David, yet I am but a little child; I do not know to go out or come in. <br />\n“‘Your servant is in the midst of Your people which You have chosen, a great people who are too many to be numbered or counted. So give Your servant a heart that listens in order to govern Your people, in order to discern between good (Heb. tov) and bad (Heb. ra’). For who is able to govern this great people of Yours?’”<br />\n “It was good (tov) in the eyes of the Lord that Solomon had asked this thing. God said to him, ‘Because you have asked this thing, and have not asked for yourself long life, nor have asked riches for yourself, nor have you asked for the life of your enemies, but have asked for yourself discernment to hear justice, behold, I have done according to your words. Behold, I have given you a heart of wisdom and discernment, so that there has been no one like you before you, nor shall one like you arise after you. I have also given you what you have not asked, both riches and honor, so that there will not be any among the kings like you all your days. If you walk in My ways, keeping My statutes and commandments, as your father David walked, then I will prolong your days.’ Then Solomon awoke, and behold, it was a dream.”</p>\n<p>Tim shows how Solomon was blessed after he began to walk in the fear of the lord.</p>\n<p>1 Kings 4:20-21, 25, 29-34 “Judah and Israel were as numerous as the sand that is on the seashore in abundance; they were eating and drinking and rejoicing. Now Solomon ruled over all the kingdoms from the River to the land of the Philistines and to the border of Egypt; they brought tribute and served Solomon all the days of his life….”<br />\n “So Judah and Israel lived in safety, every man under his vine and his fig tree, from Dan even to Beersheba, all the days of Solomon.”<br />\n “Now God gave Solomon wisdom and very great discernment and breadth of mind, like the sand that is on the seashore. Solomon’s wisdom surpassed the wisdom of all the sons of the east and all the wisdom of Egypt. For he was wiser than all men, than Ethan the Ezrahite, Heman, Calcol and Darda, the sons of Mahol; and his fame was known in all the surrounding nations. He also spoke 3,000 proverbs, and his songs were 1,005. He spoke of trees, from the cedar that is in Lebanon even to the hyssop that grows on the wall; he spoke also of beasts and birds and creepers and fish (do you hear Genesis 1 in there?). Men came from all peoples to hear the wisdom of Solomon, from all the kings of the earth who had heard of his wisdom.\"</p>\n<p>Solomon is portrayed as a new Adam, wisely ruling a garden with trees for everyone, fruitful and multiplying, boundaries expanded to Eden-like proportions. He knows the plants, beasts, birds, and creepers. He is more wise than “all the sons of the East” (link to the book of Job). He spoke thousands of proverbs (link to the book of Proverbs). He wrote over a thousand songs (link to Song of Songs). <br />\nTim’s point is that Solomon is beginning to to fulfill the original call of mankind to rule wisely. However, Solomon’s story has another side as well.</p>\n<p>In part 4 (36:45-52:50), Tim outlines the foolish side of Solomon’s life. Solomon enslaved people to help him build Jerusalem up. He imported and exported arms, chariots and horses to other countries. He had hundreds of wives and concubines. Solomon demonstrates wisdom but isn’t fully committed to following the laws of Yahweh.</p>\n<p>1 Kings 5:13-17 “Now King Solomon levied forced laborers from all Israel; and the forced laborers numbered 30,000 men. He sent them to Lebanon, 10,000 a month in relays; they were in Lebanon a month and two months at home. And Adoniram was over the forced laborers. Now Solomon had 70,000 transporters, and 80,000 hewers of stone in the mountains, besides Solomon’s 3,300 chief deputies who were over the project and who ruled over the people who were doing the work. Then the king commanded, and they quarried great stones, costly stones, to lay the foundation of the house with cut stones.”</p>\n<p>1 Kings 9:17, 19 “So Solomon rebuilt Gezer and the lower Beth-horon... and all the storage cities which Solomon had, even the cities for his chariots and the cities for his horsemen….”</p>\n<p>Solomon, for all his wisdom, implemented policies which directly violated the laws of the king as outlined in the Torah.</p>\n<p>Deuteronomy 17:15-20 “you shall surely set a king over you whom Yahweh your God chooses, one from among your countrymen you shall set as king over yourselves; you may not put a foreigner over yourselves who is not your countryman. Moreover, he shall not multiply horses for himself, nor shall he cause the people to return to Egypt to multiply horses, since Yahweh has said to you, ‘You shall never again return that way.’ He shall not multiply wives for himself, or else his heart will turn away; nor shall he greatly increase silver and gold for himself.<br />\n “Now it shall come about when he sits on the throne of his kingdom, he shall write for himself a copy of this Torah on a scroll in the presence of the Levitical priests. It shall be with him and he shall read it all the days of his life, that he may learn to fear Yahweh his God, by carefully observing all the words of this law and these statutes, that his heart may not be lifted up above his brothers and that he may not turn aside from the commandment, to the right or the left, so that he and his sons may continue long in his kingdom in the midst of Israel.</p>\n<p>Tim has found scholar Daniel Hays to be helpful here:</p>\n<p>“We as readers are given a tour of a fantastic, spectacular and opulent mansion, the house of Solomon. Everywhere we look we see wealth and abundance. However, without changing the inflection of his voice the tour guide also points out places where the façade has cracked, revealing a very different structure. Continuing with the standard speech which glorifies the building, the guide nonetheless makes frequent side comments (forced labor, store cities, horses from Egypt, foreign marriages) that make clear that his glowing praise for the structure is not really his honest opinion of the facility, and he wants us also to see the truth. Finally, at the end of the tour in chapters 11, he can restrain himself no more, and he tells us plainly that the building is basically a fraud, covered with a thin veneer of glitz and hoopla, and soon will collapse under its own weight. This is the manner in which the narrator of 1 Kings leads us on a tour of the House of Solomon.” (Daniel Hays, “Narrative Subtlety in 1 Kings 1-11: Does the narrative praise or bury Solomon?”)</p>\n<p>Tim points out that Solomon violates every rule that Israel’s king was supposed to follow. A Bible reader should ask why the narrator is giving us a dual portrait of Solomon?</p>\n<p>In the New Testament, Jesus says, “something greater than Solomon is here.” (Matthew 12:42; Luke 11:31). Jesus positioned himself as the true example of the ideal human who learns wisdom correctly by learning from Yahweh God.</p>\n<p>In part 5 (52:50-end), the guys discuss the seeming asymmetry of male and female portrayals in the Bible. Why is it that a woman is portrayed as a “wise and foolish woman” in Proverbs? Why are women often portrayed with seductive and illicit behavior?</p>\n<p>Tim points out that throughout history, men have been the ones translating the Bible, so they have default and built-in blind spots to understanding and accurately portraying a better view of man and woman’s portrayal in the original Hebrew context.<br />\n Tim notes that women have been making great strides in contributing to and furthering academic and scholastic work on biblical texts and that their voices need to be heard.</p>\n<p>Thank you to all our supporters!</p>\n<p>Show Resources: <br />\n•\twww.thebibleproject.com<br />\n•\tJ. Daniel Hays, “Narrative Subtlety in 1 Kings 1-11: Does the narrative praise or bury Solomon?”</p>\n<p>Show Music:<br />\n•\tRoads by LiQwyd<br />\n•\tYesterday on Repeat by Vexento<br />\n•\tMoon by LeMMino<br />\n•\tself reflection by less.people<br />\n•\tDefender Instrumental by Tents<br />\nSome music for this episode brought to you by the generosity of Chill Hop Music.</p>\n<p>Show Produced by: <br />\nDan Gummel, Jon Collins</p>\n<p>Powered and distributed by Simplecast</p>\n",
  "enclosure": "",
  "itunes:title": "Solomon: The Wisest of the Fools - Wisdom E3",
  "itunes:author": "Tim Mackie & Jon Collins",
  "itunes:duration": "01:00:51",
  "itunes:summary": "Welcome to our third episode discussing the theme of Wisdom in the Bible.",
  "itunes:subtitle": "Welcome to our third episode discussing the theme of Wisdom in the Bible.",
  "itunes:keywords": "jon collins, solomon, bible study, proverbs, bible, theology, tim mackie, the bible project, bible project, wisdom",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 142
}