{
  "title": "EPISODE 35 The Magliana Gang (Part 2)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Wed, 30 May 2018 13:00:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2018/5/30/episode-35-the-magliana-gang-part-2",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5b0d787370a6ad218dc89da0",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1527609656631-CSBKSJJCLXQDIE6ILQ3S/HOF-EP-35-TheMaglianaGang-Pt02.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"HOF-EP-35-TheMaglianaGang-Pt02.jpg\" data-load=\"false\" data-image-id=\"5b0d7937575d1f0c161b0ba2\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1527609656631-CSBKSJJCLXQDIE6ILQ3S/HOF-EP-35-TheMaglianaGang-Pt02.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“There was money that wasn’t coming back and the choice was between leaving some cardinal dead on the street or to strike someone close to the Pope. We chose the second path.”</em> — Antonio Mancini&nbsp;</p><p class=\"\"><em>“We of the Magliana gang were street bandits. We loved robberies, without asking anyone’s permission, without compromises. I wanted a Ferrari? One hit and i’d buy it. Cops would take it from me? Another robbery and i’d buy it again. I enjoyed all my money. De Pedis instead would buy night clubs, restaurants, houses. He was the boss of Campo dei Fiori.” —</em> Antonio Mancini</p><p class=\"\">“Of course you realize, this means war!” — Bugs Bunny</p><p class=\"\">This series is about the rise of a street gang that took over Rome in the 1970s and 1980s. The Magliana gang was not just one of many criminal organisations who operated in Italy. Among their business partners, they counted Italy’s most important politicians, bankers, secret services, and possibly the Vatican itself. The gang left an indelible mark on Italian history. The story of their rise to power and of the heyday of their rule truly is stranger than fiction. It’s the kind of story that makes you think that the Godfather 3 perhaps was a documentary after all. There are lots of books and documentaries about this story but they are nearly all in Italian, so it looks like I’m your man if you wanna hear this story in English—or whatever approximation of English I speak. In this episode:</p><ul data-rte-list=\"default\"><li><p class=\"\">Some disturbing glimpses at how power operates away from the spotlight</p></li><li><p class=\"\">Corrado Carnevale “The Sentence Slayer”—the Supreme Court Justice most loved by the Mafia</p></li><li><p class=\"\">Fascist psychiatrist Aldo Semerari loses his head (in more ways than one)</p></li><li><p class=\"\">How the killing of journalist Mino Pecorelli was probably connected to one of Italy’s most powerful politicians</p></li><li><p class=\"\">The death of Franco Giuseppucci and the revenge war it ignited</p></li><li><p class=\"\">If life is a box of chocolates, Nicolino Selis got a very bad chocolate</p></li><li><p class=\"\">Abbruciati and the Banco Ambrosiano shootout just 1/3 of a mile from where I grew up</p></li><li><p class=\"\">Why banking for the Vatican is not good for your health: Michele Sindona and Roberto Calvi</p></li><li><p class=\"\">The Vatican Bank, money laundering for the Mafia, anti-communism and missing money</p></li><li><p class=\"\">The split in the gang: Testaccini vs. Magliana</p></li><li><p class=\"\">The Emanuela Orlandi kidnapping</p></li><li><p class=\"\">The Magliana internal war: Toscano, De Pedis, and informants</p></li><li><p class=\"\">Cooperative vs. competitive systems</p></li></ul><p class=\"\">This episode is brought to you by <a href=\"https://www.bluechew.com/\">https://www.bluechew.com/</a>, the first chewable with the same FDA-approved active ingredients as Viagra and Cialis.&nbsp; Visit bluechew.com and get your first shipment FREE (only $ 5 for shipping) when you use the promo code HISTORY.</p><p class=\"\">Today’s episode is supported by DECONSTRUCTED, a new political podcast by journalist Mehdi Hasan. DECONSTRUCTED is out every Friday. You can listen and subscribe at <a href=\"http://theintercept.com/deconstructed\">theintercept.com/deconstructed</a> or on any podcast platform.</p><p class=\"\">This episode is sponsored by <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a> For less than $ 10 per meal, Blue Apron delivers straight to your door seasonal recipes along with pre-portioned ingredients to make delicious, home-cooked meals. Get $ 30 off your first order—with free shipping—by going to <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a>&nbsp;</p><p class=\"\">Please, also show some love to my regular sponsors by shopping for supplements, special foods, clothing and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">And if you are in the market for backpacks, computer bags and other hemp gear, check out my favorites at <a href=\"http://www.dsgear.com\">http://www.dsgear.com</a>&nbsp;</p><p class=\"\">History on Fire is brought to you by Kannaway. All CBD products are from organic, non-GMO European HEMP grown on generational family farms. The products all have a triple authenticated process guaranteeing you’re getting exactly what you are paying for. Because all of the CBD is from hemp and NOT cannabis, it is legal to use and possess in all 50 states AND Europe! Now you can get 100% THC-free CBD oil from hemp, delivered to your door in all 50 of the Unites States and the whole of Europe. Please check them out at: <a href=\"https://kannaway.com/2496006\">https://kannaway.com/2496006</a>&nbsp;</p><p class=\"\">A huge thank you to <a href=\"https://www.dynastyforge.com/\">https://www.dynastyforge.com/</a> for sharing with me their amazing swords.&nbsp;</p><p class=\"\">If you train in Jiujitsu (or any other sport for that matter), check out the knee braces at <a href=\"https://nevertapgear.com/\">https://nevertapgear.com/</a>&nbsp;</p><p class=\"\">PATREON NEWS: I have just started a Patreon account!!!! If you feel in a generous mood, please, check it out at <a href=\"http://www.patreon.com/historyonfire\">www.patreon.com/historyonfire</a>&nbsp;<br><br>My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>. Thank you to Onnit, Datsusara, Float Clinic, Shaman’s Simple Solutions, War Fuel, Proven Nutrition, and Fight Chix for sponsoring her for her first MMA fight. If you’d like to check out Fight Chix merchandise, you can get a 20% discount by going to <a href=\"http://www.fightchix.com/\">http://www.fightchix.com/</a> and entering the code Fire20 upon checkout.</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "1:38:37",
  "itunes:image": "",
  "itunes:title": "EPISODE 35 The Magliana Gang (Part 2)",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 35 The Magliana Gang (Part 2)"
  }
}