{
  "title": "Post-COVID-19, demand for home services have smoothened from weekend spikes to weekdays: Rupam Biswas of Sendhelper",
  "link": "https://e27.co/post-covid-19-demand-for-home-services-have-smoothened-from-weekend-spikes-to-weekdays-rupam-biswas-of-sendhelper-20221028/",
  "dc:creator": "Sainul",
  "pubDate": "Mon, 31 Oct 2022 02:35:29 +0000",
  "category": [
    "Investments",
    "Property & Construction",
    "Singapore",
    "PropertyGuru",
    "Sendhelper"
  ],
  "guid": "https://e27.co/?p=475218",
  "description": "<p>Early this month, PropertyGuru announced the acquisition of Sendhelper, a Singapore home services technology company. The acquisition aligns with the proptech group&#8217;s growth strategy of expanding into adjacencies of fintech and data while investing in its core marketplaces business towards creating a digital property ecosystem for property seekers, sellers, agents, developers, banks, and valuers. Over [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/post-covid-19-demand-for-home-services-have-smoothened-from-weekend-spikes-to-weekdays-rupam-biswas-of-sendhelper-20221028/\">Post-COVID-19, demand for home services have smoothened from weekend spikes to weekdays: Rupam Biswas of Sendhelper</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<div id=\"attachment_475238\" style=\"width: 700px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-475238\" loading=\"lazy\" class=\"size-full wp-image-475238\" src=\"https://e27.co/wp-content/uploads/2022/10/Sendhelper_interview_feature.png\" alt=\"\" width=\"690\" height=\"388\" /><p id=\"caption-attachment-475238\" class=\"wp-caption-text\">Sendhelper Co-Founders Bogdan Metehoui and Rupam Biswas (R)</p></div>\n<p>Early this month, PropertyGuru <a rel=\"follow\" href=\"https://e27.co/propertyguru-forays-into-home-services-with-sendhelper-acquisition-20221017/\">announced the acquisition</a> of Sendhelper, a Singapore home services technology company.</p>\n<p>The acquisition aligns with the proptech group&#8217;s growth strategy of expanding into adjacencies of fintech and data while investing in its core marketplaces business towards creating a digital property ecosystem for property seekers, sellers, agents, developers, banks, and valuers.</p>\n<p>Over the coming months, PropertyGuru plans to develop Sendhelper solutions, according to Shyn Yee Ho-Strangas, MD (Data and Software Solutions) at PropertyGuru.</p>\n<p>Soon after the announcement, <strong>e27</strong> spoke with Ho-Strangas and Sendhelper Co-Founder and GM Rupam Biswas to know more about the deal.</p>\n<p>Below are the edited excerpts from the interview:</p>\n<h2>How long has this deal been in the works?</h2>\n<p><strong>Ho-Strangas</strong>: For about six months. We (PropertyGuru) began our due diligence after getting listed on NYSE.</p>\n<h2>Can you share the transaction details of this deal? Will it be run as a separate entity or be integrated with PropertyGuru?</h2>\n<p><strong>Ho-Strangas</strong>: Sendhelper is a strategic addition with long-term growth opportunities for PropertyGuru Group. PropertyGuru has fully acquired Sendhelper and bought out all shareholders&#8217; shares. However, we cannot share specific details of this acquisition.</p>\n<p>Given our shared vision of harnessing data and technology to improve our customers&#8217; experience, we aim to be a force for innovative and game-changing solutions that guide people to make confident property decisions.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/how-iprice-navigates-the-seven-seas-20221025/\">How iPrice Group navigates the seven SEAs</a></strong></p>\n<p>Over the coming months, the plan is to develop Sendhelper solutions and synergies for our partners. We are excited about the value that we can deliver together for our partners.</p>\n<h2>What will happen to the Sendhelper founders and staff? What will happen to its investor Captii Ventures?</h2>\n<p><strong>Ho-Strangas</strong>: All founders and staff of Sendhelper have been absorbed into the PropertyGuru Group. The founders are aligned with the group&#8217;s goal of building this into a large business over the next five years. They will stay after the integration to grow and develop the business together.</p>\n<div id=\"attachment_474247\" style=\"width: 700px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-474247\" loading=\"lazy\" class=\"size-full wp-image-474247\" src=\"https://e27.co/wp-content/uploads/2022/10/PropertyGuru_sendhelper_acquisition_news.png\" alt=\"\" width=\"690\" height=\"388\" /><p id=\"caption-attachment-474247\" class=\"wp-caption-text\">Shyn Yee Ho-Strangas, MD (Data and Software Solutions) at PropertyGuru</p></div>\n<h2>How will this deal benefit Sendhelper? Does it have plans to foray into new verticals?</h2>\n<p><strong>Biswas</strong>: Having established a solid product-market fit, Sendhelper is now well-placed to push for high growth. With this deal, we expect to significantly lower our customer acquisition costs by offering our services to existing users in Singapore. Direct access to real estate agents and developers will also be a significant advantage.</p>\n<p>There are significant strategic synergies in tech and product as well.   Sendhelper will continue to work on bringing new service categories, verticals, product packages and subscriptions to serve property seekers, agents, and developers better.</p>\n<h2>How is the overall home services industry growing in Singapore and the region?</h2>\n<p><strong>Biswas</strong>: After relaxing rules related to COVID-19, we are experiencing good tailwinds. There is also a gap in the market, with very few established and trusted services platforms remaining in the market after failing to survive the pandemic. The story is the same across the region. This is the right time to invest in this space and capture market share.</p>\n<h2>Are there any tangible changes pre- and post-pandemic? Are there any significant changes to the market characteristics and consumer behaviours?</h2>\n<p><strong>Biswas</strong>: One key change we have noticed is that consumers have moved to larger homes, and most are still able to work from home. This has led to demand smoothening away from weekend spikes to weekdays.</p>\n<p>When there is no fear around COVID-19, more orders come in because people spend more time at home and are comfortable with home services. Consumers prefer known, established providers to black market operators for health, security and safety reasons.</p>\n<h2>Which market in the region is witnessing a boom in terms of home/maintenance/local services?</h2>\n<p><strong>Biswas</strong>: Currently, Singapore is our focus for home services. An immense opportunity exists across SEA for us to solve the issues faced by customers and service providers in a meaningful way. The PropertyGuru group has a solid regional footprint, and we will leverage that at the right time.</p>\n<h2>Which among the umpteen home services categories does bring you more revenue?</h2>\n<p><strong>Biswas</strong>: Recurring services like weekly home cleaning are always the top category. Recurring service models have been our focus in the past.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/fundraising-in-time-of-crisis-why-sea-founders-can-remain-hopeful-20221028/\">Fundraising in time of crisis: Why SEA founders can remain hopeful</a></strong></p>\n<p>But now, we hope to innovate and bring more value to our customers in one-time services like deep cleaning and handyman. AC servicing is also another area of focus.</p>\n<h2>What does the future look like for the home services industry in Singapore and SEA? Where is it headed?</h2>\n<p><strong>Biswas</strong>: Most previous vintage platforms from the 2015 era have suffered through COVID-19 and face the challenge of having a meaningful presence in their markets. The demand has only increased, and the service providers have always existed, albeit unorganised. There will be consolidation in the industry, and a significant proportion of offline, unorganised home services will go online and towards the organised quadrant. Only players who have a deep understanding of this business&#8217;s levers and critical success factors will be able to capitalise on this opportunity. We may also see some innovative new business models because pureplay Web2.0 platforms have not fulfilled their full potential in the past.</p>\n<h2>Given the new developments in the technology front, do you foresee the sector changing in the next few years?</h2>\n<p><strong>Biswas</strong>: Hardware-related innovation will impact commercial property services sooner than home services. I think we are still decades away from replacing our average home cleaner, electrician, or handyman completely. There will be tangible innovation in business models, the discovery process, product, increasing trust, service delivery, and customer service, among other things, making customer experiences 10x better than what it is today. This is precisely what we are gearing towards with Sendhelper at PropertyGuru Group.</p>\n<p>&#8212;</p>\n<p>Fundraising or preparing your startup for fundraising? Build your investor network, search from 400+ SEA investors on e27, and get connected or get insights regarding fundraising. <a class=\"ProsemirrorEditor-link\" rel=\"follow\" href=\"https://e27.co/membership/?utm_source=Boilerplate&utm_medium=Articles&utm_campaign=300TRIAL&utm_id=300TRIAL\" rel=\"follow\">Try e27 Pro for free today</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/post-covid-19-demand-for-home-services-have-smoothened-from-weekend-spikes-to-weekdays-rupam-biswas-of-sendhelper-20221028/\">Post-COVID-19, demand for home services have smoothened from weekend spikes to weekdays: Rupam Biswas of Sendhelper</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}