{
  "title": "Trump’s ex-secretary of state served in Wikileaks lawsuit (VIDEO)",
  "link": "https://www.rt.com/news/565833-pompeo-lawsuit-wikileaks-assange/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565833-pompeo-lawsuit-wikileaks-assange/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362ba2820302729420b65f2.jpeg\" /> Former US secretary of state Mike Pompeo was served with papers alleging a criminal conspiracy against Wikileaks <br/><a href=\"https://www.rt.com/news/565833-pompeo-lawsuit-wikileaks-assange/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The former CIA director allegedly violated the Fourth Amendment rights of Julian Assange and his guests at the Ecuadorian embassy</strong></p>\n            \n                        \n            <p>Former US secretary of state Mike Pompeo has been served with papers for a lawsuit alleging he directed a criminal conspiracy violating the Fourth Amendment rights of Wikileaks founder Julian Assange and his guests by spying on them at the Ecuadorian embassy in London.</p>\n<p>Video of a process server handing the ex-CIA director the legal papers last week at a fundraising dinner was posted by Wikileaks to social media on Tuesday. In the clip, a bemused Pompeo can be seen handing over the papers, unread, to an aide.</p>\n<p>A group of over 100 US citizens &ndash; including lawyers, journalists, and doctors &ndash; sued the CIA and Pompeo in August for allegedly violating their Fourth Amendment privacy rights by spying on them when they met with the Wikileaks publisher in 2017 and 2018 at the embassy, where he was under de facto house arrest.</p>\n\n            <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">\"Michael Richard Pompeo: You've been served!\"<br><br>Mike Pompeo has been served with a lawsuit brought by US lawyers and journalists who visited <a href=\"https://twitter.com/hashtag/Assange?src=hash&ref_src=twsrc%5Etfw\">#Assange</a>. Spanish court documents show violations of their US constitutional rights. Plaintiffs are represented by NY attorney Richard Roth. <a href=\"https://t.co/ZH4HVOPnlo\">pic.twitter.com/ZH4HVOPnlo</a></p>&mdash; WikiLeaks (@wikileaks) <a href=\"https://twitter.com/wikileaks/status/1587782283196612610?ref_src=twsrc%5Etfw\">November 2, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n    \n\n<p>According to the lawsuit, Assange&rsquo;s visitors were required to turn over their cell phones to private security contractor Undercover Global SL, which then copied data from the devices and handed it over to the CIA &ndash; unbeknownst to the Ecuadorian government, which had hired the firm to provide security at the embassy. Undercover Global SL also recorded conversations between Assange and his visitors on behalf of the CIA, the suit claims, adding that Pompeo explicitly authorized and approved the theft of data.&nbsp;</p>\n<p>Pompeo, who served as secretary of state under former US president Donald Trump, was summoned as a witness to a Spanish court in June to testify regarding claims by multiple former US security officials that the CIA had contemplated kidnapping or killing Assange following Wikileaks&rsquo; 2017 release of the Vault 7 documents.</p>\n<p>The leak revealed top-secret hacking tools and reportedly constituted the &ldquo;<em>largest data loss in CIA history.</em>&rdquo; Pompeo specifically wanted revenge, one official told Yahoo News last year. However, no plan was ultimately approved, as White House lawyers pointed out it was highly illegal and the UK refused to allow such an operation on British soil.</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/560908-assange-lawyers-journalists-sue-cia/\">\n            <span>READ MORE: </span>Assange’s lawyers and journalists sue CIA\n        </a>\n    </p>\n\n    \n\n<p>Assange has been locked up at Belmarsh prison since 2019, when he was stripped of his Ecuadorian citizenship after seven years of living in the country&rsquo;s London embassy. He is currently fighting extradition to the US, where he faces conspiracy and espionage charges carrying up to 175 years in prison stemming from Wikileaks&rsquo; publication of top-secret Pentagon documents.</p>\n<p>While a judge ruled last year that Assange should not be sent to the US due to his declining mental health, Washington appealed the ruling and secured a more favorable decision. His attorneys filed an appeal in August.</p>",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 18:58:44 +0000",
  "dc:creator": "RT"
}