{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-4029392288303418595",
  "published": "2022-09-15T10:50:00.001-05:00",
  "updated": "2022-09-18T11:22:38.839-05:00",
  "category": [
    "",
    "",
    "",
    ""
  ],
  "title": "Fisherian Intuition",
  "content": "<script src=\"https://polyfill.io/v3/polyfill.min.js?features=es6\"></script><script async=\"\" id=\"MathJax-script\" src=\"https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-mml-chtml.js\"></script><p>Interest rate neutrality is easy to state in equations but hard to digest intuitively.&nbsp;</p><p>The equation says that interest rate = real rate plus expected inflation, \\[i_t = r + E_t\\pi_{t+1.}\\]In one direction this is easy: If people expect a lot of inflation, then they demand higher nominal \\(i_t\\) interest rates to compensate for the declining value of the dollar. That leaves the real \\(r\\) interest rate unchanged.&nbsp;</p><p>(Note: this post uses mathjax equations. If you can't see them, come to the <a href=\"https://johnhcochrane.blogspot.com\" target=\"_blank\">original</a>.)&nbsp;</p><p>But in our economy the Fed sets the nominal interest rate and the rest must adjust. In the short run with sticky prices and other frictions the real rate may change, but eventually the real rate is set by real things and expected inflation must rise. &nbsp;We can study that long run by leaving out &nbsp;the sticky prices and other frictions, and then expected inflation rises right away.<i> Rises.</i> Higher interest rates <i>raise</i> inflation. How does that really work? What's the economic force?&nbsp;</p><p>Standard intuition says overwhelmingly that higher interest rates cause people to spend less which lowers inflation. &nbsp;The equations seem like they're hiding some sort of sophistry.&nbsp;</p><p>(Fed Chair Powell explains the standard view well while&nbsp;<a href=\"https://www.youtube.com/watch?v=gW6I9BnIgEU\" target=\"_blank\">sparring with Senator Warren here</a>. The clip is great on several dimensions. No, the Fed cannot increase supply. No, none of what Senator Warren talks of will make a dent in supply either. The elephant in the room, massive fiscal stimulus, is not mentioned by either party. Just why each is silent on that is an interesting question.)</p><p>This is a lovely case that <i>individual </i>causality goes in the opposite direction of <i>equilibrium</i> causality. That happens a lot in macroeconomics and can cause a lot of confusion. It also is an interesting case of mistaking expected inflation for unexpected inflation. Along with confusing relative prices for inflation, that's common and easy to do. Hence this post.&nbsp;<span></span></p><a name='more'></a><p></p><p>Start with the consumer first order condition, or \"IS curve\" of new-Keynesian models, \\[ x_t = E_t x_{t+1} - \\sigma (i_t - E_t \\pi_{t+1}-r) \\] with \\(x=\\) consumption, output or output gap after linearization, \\(i=\\) nominal interest rate, \\(\\pi=\\) inflation and \\(r\\) equal the discount rate or long-term real interest rate. To the individual, the interest rate and expected inflation -- the price levels \\(p_t\\) and \\(p_{t+1}\\) and thus \\(\\pi_{t+1}=p_{t+1}-p_t\\) -- are given, exogenous. (Minus not divided by, these are all in logs.) The consumer chooses consumption \\(x\\) subject to a budget constraint. If the Fed raises interest rates and prices do not yet adjust, then the consumer wishes to lower consumption today \\(x_t\\) and raise consumption tomorrow \\(x_{t+1}\\). That is the standard intuition, and correct. &nbsp;&nbsp;</p><p>Now, a desire to lower consumption today pushes down the price level today, and consuming more tomorrow pushes up the price level tomorrow. More deeply, let's pair this first order condition with equilibrium in an endowment economy, with constant \\(x_t=x\\). In English, fix supply -- there is only so much output \\(x\\) to go around so prices have to adjust until people are content to buy what's on the shelves, no more and no less. &nbsp;(We can also pair it with the Phillips curve, and then specify flexible prices.) The current price level \\(p_t\\) falls relative to the expected future price level \\(p_{t+1}\\) until the consumer's demand equals supply, so \\( E_t\\pi_{t+1} = i_t+r\\). <i>Expected inflation rises to meet the interest rate. </i>As promised, and by exactly the conventional mechanism.&nbsp;</p><p>This logic tells us that the higher interest rate produces higher future inflation, from this year to next year. Now, you can get higher inflation by a lower initial price \\(p_t\\) or from a higher later price \\(p_{t+1}\\). &nbsp;The graph below shows the two possibilities, and (green) an intermediate possibility.&nbsp;</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgxnrDxSaacY8gokEVsaBj_7FQEoxXW36OugzIwxCN09DjW33owCvF4dexUJMmYnjWMByJMIFVWXiqKhZqJBGnHAasTjnveSkdhGM2fYgdLdpNtRLlWoLNgwALuLYhp5F4E-qrGcvVHNoS9WzyEB-DLagHt1DWzu8T1gYF5dFgc1iucGlSwvF_Wz9A/s934/Screen%20Shot%202022-08-25%20at%2010.06.27%20PM.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"600\" data-original-width=\"934\" height=\"206\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgxnrDxSaacY8gokEVsaBj_7FQEoxXW36OugzIwxCN09DjW33owCvF4dexUJMmYnjWMByJMIFVWXiqKhZqJBGnHAasTjnveSkdhGM2fYgdLdpNtRLlWoLNgwALuLYhp5F4E-qrGcvVHNoS9WzyEB-DLagHt1DWzu8T1gYF5dFgc1iucGlSwvF_Wz9A/s320/Screen%20Shot%202022-08-25%20at%2010.06.27%20PM.png\" width=\"320\" /></a></div><br /><p>So the original intuition can be right: Higher interest rates might well depress current demand and lower \\(p_t\\). (Blue line) That produces lower&nbsp;<i>ex post&nbsp;</i>inflation \\( \\pi_t=p_t-p_{t-1}\\) and higher&nbsp;<i>expected</i>&nbsp;inflation \\(E_t\\pi_{t+1}=E_t(p_{t+1}-p_t)\\). The intervention can well \"lower inflation,\" in this sense. This is how standard (new-Keynesian) models work.&nbsp;</p><p>If we stop here, the confusion is just semantic. As often in life, you can resolve a lot of seemingly intractable arguments just by defining terms more carefully. Higher interest rates can lower current inflation. Sticky prices and other frictions can draw out this period of decline. As for the price recovery, and higher future inflation, well, we often do see that -- inflation comes back as it did in the 1970s -- or maybe the Fed doesn't leave interest rates alone long enough to see it. The long run is a long time.&nbsp;</p><p>But there is another possibility. Maybe the higher expected inflation all comes from a higher future price level, not a lower current price level; the red line not the blue line. Which is it-- higher \\(p_{t+1}\\) or lower \\(p_t\\)? This first order condition is not enough to answer this question. You need either new-Keynesian equilibrium selection policies or fiscal theory to determine which one it is. In either case, it comes down to fiscal policy. To have an unexpected decline in inflation, Congress must raise tax revenue or cut spending to pay off bondholders in more valuable money. If Congress refuses, we get the top line, more future inflation, no inflation reduction today. If Congress goes along, we can get the bottom line. Fiscal and monetary policies always work in tandem.&nbsp;</p><p>But this post is about the narrow question: Why do higher interest rates raise <i>expected future</i> inflation? If it happens by lowering the current price level, producing an unexpected deflation, that's consistent with the question. So part of the intuitive problem was understanding the question, and in the verbal debate one side (conventional, implicitly) was talking about unexpected current inflation, while the other (Fisherian) side was talking about expected future inflation. Both can be right! &nbsp;</p><p>To the individual, the price levels and expected inflation are exogenous and the consumption \\(x\\) decision is endogenous. In equilibrium, the endowment \\(x\\) is exogenous, and the price levels and expected inflation follow. This is the same clever reversal of the famous Lucas asset pricing model. The individual chooses consumption seeing asset prices. In equilibrium, changes in the endowment cause changes in asset prices.&nbsp;</p><p>(Thanks to the colleagues who pressed me to find a good intuition for this result.)&nbsp;</p><p><br /></p><p>&nbsp;</p><p><br /></p><p><br /></p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 15
}