{
  "guid": "prx_137_6738e401-0109-4556-8fe5-216f2dd104a7",
  "title": "756 - Real Time Broth",
  "pubDate": "Wed, 20 Mar 2019 23:00:00 -0000",
  "link": "https://beta.prx.org/stories/270234",
  "description": "<p>Shaking the remains of the day away with some easy cooking by way of IKEA and TJs.<br>\n<br>\n(You can find all of our sponsors or become a patron on our new website <a href=\"http://www.sleepwithmepodcast.com/\" rel=\"nofollow\" target=\"_blank\">http://www.sleepwithmepodcast.com</a> story starts at about 18:00)<br>\n<br>\nCheck out “Conversations With People Who Hate Me” with Dylan Marron in your podcast app or at <a href=\"http://www.dylanmarron.com/podcast/\" rel=\"nofollow\" target=\"_blank\">http://www.dylanmarron.com/podcast/<br>\n</a><br>\nAustralian listeners!! We have an amazing new sponsor JUST for you!<br>\nKoala is Australia’s highest-rated mattress and comes with a ‘120-night risk-free’ trial.<br>\nIn Australia goto <a href=\"http://koala.com/\" rel=\"nofollow\" target=\"_blank\">koala.com</a> and use “sleepwithme\" for $120 off one mattress!!<br>\n<br>\nTonight’s show is sponsored by Molekule, for $75 off your first order, visit** <a href=\"http://molekule.com/\" rel=\"nofollow\" target=\"_blank\">Molekule.com</a> and enter “sleepwithme”**at checkout. Molekule is a complete reinvention of the air purifier, not just an improvement on existing, outdated technology. It was developed by a scientist whose son suffered from asthma and whowas frustrated by the fact HEPA air purifiers did not relieve his son’s symptoms. As a result, Dr.Yogi Goswami spent 20 years developing a completely new, totally effective way of removing indoor air pollutants. Unlike HEPA filters, Molekule destroys indoor air pollutants at a molecular level, completely removing them from the air you breathe.<br>\n<br>\nWelcome our newest sponsor Robinhood - an investing app that lets you buy and sell stocks, E-T-F’s (exchange-traded funds), options, and cryptos- all commission-free. They strive to make financial services work for everyone, not just the wealthy. Robinhood is giving listeners a FREE stock like Apple, Ford or Sprint to help build your portfolio. Sign up at <a href=\"http://www.sleep.robinhood.com/\" rel=\"nofollow\" target=\"_blank\">http://www.sleep.robinhood.com</a>!</p>",
  "enclosure": "",
  "itunes:title": "Real Time Broth",
  "itunes:subtitle": "Shaking the remains of the day away with some easy cooking by way of IKEA and TJs.",
  "itunes:explicit": false,
  "itunes:episodeType": "full",
  "itunes:episode": 756,
  "itunes:duration": "01:09:01"
}