{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-1459745376148229433",
  "published": "2020-05-21T06:00:00.000-07:00",
  "updated": "2020-05-21T06:00:10.492-07:00",
  "title": "We hosted a virtual Iftar this Ramadan on YouTube, bringing together a global community",
  "content": "Like millions of families around the world, <a href=\"https://www.youtube.com/user/mmoshaya\" target=\"_blank\">my family and I</a> have been breaking our fast this Ramadan in the safety of our own home in the sunny city of Jeddah, Saudi Arabia — something I am very grateful for. Although I love my family, and I am thankful to have them here with me this Ramadan, something was still missing.  <br /><br />So I reached out to a few of my friends (<a href=\"https://www.youtube.com/user/honga1st\" target=\"_blank\">Omar Hussein</a>, <a href=\"https://www.youtube.com/channel/UChOPyo-uWLVi5uO53mSBX-w\" target=\"_blank\">Noor Stars</a>, the <a href=\"https://www.youtube.com/user/thesaudireporters\" target=\"_blank\">Saudi Reporters</a>, <a href=\"https://www.youtube.com/user/DramaQueen7373\" target=\"_blank\">Asrar Aref</a>, and the <a href=\"https://www.youtube.com/channel/UCqJNTGwKmgMCwfYDbnz514Q\" target=\"_blank\">Anasala Family</a>) and asked them if they wanted to come over for Iftar, and to bring millions of their friends with them.  <br /><br /><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/Pe9Z9ZhXUvs\" width=\"560\"></iframe> </div><br /><br />On Tuesday, May 19, we decided to break our fast together at 6:32 p.m. — sunset in Saudi Arabia. We played games, showed-off our cooking skills, and finally broke our fast along with thousands of people who joined us from across the country and beyond.  <br /><br />What’s incredible is that people all around the world have been trying to find innovative ways to create that sense of togetherness during the holy month while staying safe. Earlier this month, creators in Indonesia came together and hosted a virtual Iftar, bringing together people from all over the country. Also next week, on May 26 at 8 p.m. EEST, Arab popstar <a href=\"https://www.youtube.com/channel/UChnf7fs7mlfbzsJpwWnJBYA\" target=\"_blank\">Nancy Ajram</a> is going to host a special <a href=\"https://www.youtube.com/watch?v=VP1X_uwwM44\" target=\"_blank\">Eid celebration concert </a>on her YouTube channel.  <br /><br />I am proud I got to be part of this incredible experience that showed the world the power of YouTube and the creator community. Bringing this many people together during this difficult time is truly rewarding.  <br /><br />From all of us, we wish you a Ramadan Kareem and a blessed Eid ahead.  <br /><br /><i>Mohamed Moshaya, YouTube Creator based in Saudi Arabia  </i>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}