{
  "title": "Paul J. Croce, \"Young William James Thinking\" (John Hopkins UP, 2018)",
  "description": "Paul J. Croce, professor of history at Stetson University. Young William James Thinking (John Hopkins University Press, 2018) offers a developmental biography of the famous pragmatist. James’s mature thinking as a radical empiricist was formed through his experiences and intellectual curiosity as a young man. Looking for a suitable vocation that matched his intellectual interest, he explored life through art, science, travel, wide philosophical reading and his inner world. Thematically arranged the book looks into young James’s exploration of the tension between religion and science, his speculation over the benefits and drawback of modern medicine and sectarian medicine and the wisdom of the ancient Greeks approach to life. Through this exploration of the material and immaterial nature of reality, he navigated ill health, bouts of depression, familial tensions, unsatisfying romantic life and uncertainty. His ambivalent disposition caused him to put off making early commitments as he kept seeking for the meaning of life. Going from personal crisis to crisis, he developed a pluralist approach to knowledge, a philosophy of the will and found solace in the hope that life was worth a commitment even if one did not know the outcome. Young William James Thinking is a book that speaks to today’s restlessness and provides comfort that life may be worth living after all.\nThis episode of New Books in American Studies was produced in cooperation with The Society for U.S. Intellectual History.\nLilian Calles Barger, www.lilianbarger.com, is a cultural, intellectual and gender historian. Her most recent book is entitled The World Come of Age: An Intellectual History of Liberation Theology (Oxford University Press, 2018). Her current research is on the intellectual history of feminism seen through the emblematic life and work of Simone de Beauvoir.\n\nLearn more about your ad choices. Visit megaphone.fm/adchoices\nSupport our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/biography",
  "pubDate": "Tue, 02 Jul 2019 08:00:00 -0000",
  "itunes:episodeType": "full",
  "itunes:episode": 140,
  "itunes:author": "Marshall Poe",
  "itunes:subtitle": "James’s mature thinking as a radical empiricist was formed through his experiences and intellectual curiosity as a young man...",
  "itunes:summary": "Paul J. Croce, professor of history at Stetson University. Young William James Thinking (John Hopkins University Press, 2018) offers a developmental biography of the famous pragmatist. James’s mature thinking as a radical empiricist was formed through his experiences and intellectual curiosity as a young man. Looking for a suitable vocation that matched his intellectual interest, he explored life through art, science, travel, wide philosophical reading and his inner world. Thematically arranged the book looks into young James’s exploration of the tension between religion and science, his speculation over the benefits and drawback of modern medicine and sectarian medicine and the wisdom of the ancient Greeks approach to life. Through this exploration of the material and immaterial nature of reality, he navigated ill health, bouts of depression, familial tensions, unsatisfying romantic life and uncertainty. His ambivalent disposition caused him to put off making early commitments as he kept seeking for the meaning of life. Going from personal crisis to crisis, he developed a pluralist approach to knowledge, a philosophy of the will and found solace in the hope that life was worth a commitment even if one did not know the outcome. Young William James Thinking is a book that speaks to today’s restlessness and provides comfort that life may be worth living after all.\nThis episode of New Books in American Studies was produced in cooperation with The Society for U.S. Intellectual History.\nLilian Calles Barger, www.lilianbarger.com, is a cultural, intellectual and gender historian. Her most recent book is entitled The World Come of Age: An Intellectual History of Liberation Theology (Oxford University Press, 2018). Her current research is on the intellectual history of feminism seen through the emblematic life and work of Simone de Beauvoir.\n\nLearn more about your ad choices. Visit megaphone.fm/adchoices\nSupport our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/biography",
  "content:encoded": "<p><a href=\"https://www.stetson.edu/other/faculty/paul-croce.php\">Paul J. Croce</a>, professor of history at Stetson University. <a href=\"http://www.amazon.com/dp/1421423650/?tag=newbooinhis-20\"><em>Young William James Thinking </em></a>(John Hopkins University Press, 2018) offers a developmental biography of the famous pragmatist. James’s mature thinking as a radical empiricist was formed through his experiences and intellectual curiosity as a young man. Looking for a suitable vocation that matched his intellectual interest, he explored life through art, science, travel, wide philosophical reading and his inner world. Thematically arranged the book looks into young James’s exploration of the tension between religion and science, his speculation over the benefits and drawback of modern medicine and sectarian medicine and the wisdom of the ancient Greeks approach to life. Through this exploration of the material and immaterial nature of reality, he navigated ill health, bouts of depression, familial tensions, unsatisfying romantic life and uncertainty. His ambivalent disposition caused him to put off making early commitments as he kept seeking for the meaning of life. Going from personal crisis to crisis, he developed a pluralist approach to knowledge, a philosophy of the will and found solace in the hope that life was worth a commitment even if one did not know the outcome. <em>Young William James</em> <em>Thinking</em> is a book that speaks to today’s restlessness and provides comfort that life may be worth living after all.</p><p>This episode of New Books in American Studies was produced in cooperation with <a href=\"https://s-usih.org\">The Society for U.S. Intellectual History</a>.</p><p><em>Lilian Calles Barger, </em><a href=\"http://www.lilianbarger.com\"><em>www.lilianbarger.com</em></a><em>, is a cultural, intellectual and gender historian. Her most recent book is entitled </em>The World Come of Age: An Intellectual History of Liberation Theology<em> (Oxford University Press, 2018). Her current research is on the intellectual history of feminism seen through the emblematic life and work of Simone de Beauvoir.</p><p></em></p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p><p>Support our show by becoming a premium member! <a href=\"https://newbooksnetwork.supportingcast.fm/biography\">https://newbooksnetwork.supportingcast.fm/biography</a></p>",
  "itunes:duration": 3844,
  "itunes:explicit": "no",
  "guid": "8eef2052-9412-11e9-92bf-6b0b50c5063d",
  "enclosure": ""
}