{
  "title": "TU 74: Mentalizing &#8211; A Critical Component For Secure Relating With Tina Adkins (replay)",
  "link": "https://therapistuncensored.com/episodes/tu-74-mentalizing-a-critical-component-for-secure-relating-with-tina-adkins-replay/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu-74-mentalizing-a-critical-component-for-secure-relating-with-tina-adkins-replay",
  "pubDate": "Wed, 22 Aug 2018 03:23:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=6349",
  "description": "It’s not too late to develop security in yourself, your children and your relationships. With this skill, you can increase attachment security today even without a long-term relationship or years of psychotherapy. Dr. Adkins and co-host Sue Marriott LCSW, CGP walk us through the steps.\nMentalizing seems easy – but actually it is quite complex. Thinking accurately about our own and others minds is such a core skill that many consider it a pre-condition for self-soothing, empathy and other facets of emotional intelligence and social-emotional maturity. It is also something that one can learn at any time in life, so it’s never too late to improve in this capacity for yourself or your children!\nMentalizing and Attachment\nOf course this is directly related to attachment styles, which is part of our interest. The coolest thing is that you don’t have to have even earned security to learn to do it and interrupt the unintended transmission of insecure relating! We now know that with short-term cognitive interventions we can teach this particular skill and that alone improves the attachment security outcome for children of high risk parents. This is exciting!\n\nWhen early caregivers are unable to reflect on their children’s state of mind, these kids do not receive the active and ongoing feedback they require to develop their own capacity of secure reflection. This is big, because without this skill they do not learn how to understand their own thoughts, feelings, and motivations, or the thoughts, feelings, and motivations of others. Mentalization is what enables us to develop a sense of identity and the capacity to understand both our own feelings and motivations; and those of others.\nKeeping Your Own and Others’ Minds in Mind\nDr. Dan Siegel calls it Mindsight, it’s also been called Reflective Function and Metacognition, but it all basically refers to being able to accurately see your own mind as it works – body, feelings, thoughts, and other people’s minds as they are whirling away. It is the capacity to infer and predict attitudes, motivations, affect and feeling behind the thinking. The better we are at mentalizing the more likely we can securely relate.\n\nNOTE: You can be secure naturally with a history of attuned parenting probably by secure caregivers, but you can also “earn” security by working on it. The cool news is those with “Earned Secure” relating are actually better at mentalizing, most likely because of the work they’ve had to do on themselves. GO ALL OF US EARNED SECURE FOLKS!!!\n\nDr. Adkins breaks down the concept and skills required, it’s simple but not as easy as it seems. Her work in the foster care system is truly revolutionary, but these skills can be applied to adoption, children in general, and adults wanting to improve on their feelings of insecurity in the world.\nBiography\nTina Adkins, PhD, is a Research Associate at the University of Texas at Austin, School of Social Work. She completed her PhD in Theoretical Psychoanalysis under the direction of Peter Fonagy and Patrick Luyten at University College London and the Anna Freud Center, specializing in attachment based interventions for foster/adopted children and their families. Her work in London resulted in a promising psychoeducational intervention for foster/adoptive parents designed to increase their mentalizing skills. Her research and clinical work continue to focus on the development and assessment of mentalization in parents and families. \n\n \nRESOURCES:\nAdditional resources for this episode:\n\n \tTina Adkins: : Family Minds An Attachment-based Mentalizing Psycho-Educational Intervention for Foster and Adoptive Parents\n \tTina Adkins: Why being reflective is so important for foster and adopted children\n \tPeter Fonagy (2015): Affect Regulation Mentalization and the Development of the Self\n \tJ O Hagelquist, foreward by Peter Fonagy (2016): The Mentalization Guidebook\n \tRegina Pally (2017): The Reflective Parent – How to Do Less and Relat...",
  "enclosure": "",
  "itunes:subtitle": "It’s not too late to develop security in yourself, your children and your relationships. With this skill, you can increase attachment security today even without a long-term relationship or years of psychotherapy. Dr.",
  "itunes:summary": "Mentalizing seems easy – but actually it is quite complex. Thinking accurately about our own and others minds is such a core skill that many consider it a pre-condition for self-soothing, empathy and other facets of emotional intelligence and social-emotional maturity.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "48:21"
}