{
  "title": "TU45: Music, Emotion and Therapy- Interview with Bob Schneider, Austin Music Legend",
  "link": "https://therapistuncensored.com/episodes/tu45-music-emotion-and-therapy-interview-with-bob-schneider-austin-music-legend/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu45-music-emotion-and-therapy-interview-with-bob-schneider-austin-music-legend",
  "pubDate": "Wed, 18 Oct 2017 00:33:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=5369",
  "description": "Not only does Bob Schneider (professional musician and wicked Creative) share his navigation of emotion as he writes music, in this in-depth conversation he also shares personal information about his therapy and recovery with Sue Marriott. He goes on to describe mediocre versus great therapy, how to train your critical brain like your dog, and taking in tons of information like a whale and spitting out “song turds” from his unconscious. Blending anecdotal stories, neuroscience and attachment theory, this interview both entertains and educates.\n\nThis is a soft Part 2 to our previous Episode 44:  Your Brain on Music, How Music Affects Your Mind, Memory and Happiness. If you like this you’ll like that! \n\nBonus section: Sue discusses and you get to hear an extended excerpt of Schneider’s song, “Let the Light In” from an attachment perspective at the end of this episode so stay tuned….\n\n \n\nAbout Bob Schneider:\n\nHe has won more Austin Music Awards than any other musician, including Best Songwriter, Best Funk Band, Best Bluegrass Band, Best Alternative/Punk Band, Best Musician, Best None of the Above Band J, Best Male Vocals and of course Musician of the Year too many times to count. Let’s be clear, this does not complete his awards list. He’s also an artist and poet aka Wicked Creative, as you can tell he’s an Austin legend. \n\nBut as you’ll hear in the intro song, “you can call him Bob.”\n\n \n\nBatman (Live at the Paramount) and Ready Let’s Roll (King Kong)  excerpts before and after intro.\n\n2:45 – Bob’s process of song writing and performing when he writes, identify the moment when something pings emotionally and keep heading in that direction. Hot/cold game\n\n4:35 – Left brain and right brain functions, top-bottom processing when creating music. The unexpected is what makes music compelling. Specific feelings of excitement when experiencing something you haven’t experienced before.\n\n7:30 – Music allows you to process life experiences or interpret internal thoughts\n\n11:15 – Excitement comes from the unexpected because our brains as anticipation machines. Oxytocin discussed. Sober song writing. Mindfulness – Just write!\n\n20:50 – Trying to write something profound will prevent you from doing so. Just let the creative part of you do what it wants to do, splash paint etc. Bob believes it’s an amalgamation of everything we’ve sucked in, he’s a whale spitting out song turds. J\n\n23:45 – Bob’s shares his drive to keep writing. Dissociation from feelings and engaging sensitivity in the world.\n\n28:30 – Very personal story of baby by the gutter as a “coherent narrative,” an outcome of self-acceptance and acceptance of others. Mediocre therapists versus fantastic therapists. Acceptance of our imperfections in relationships, goal for those who were raised in less-than-stellar household environments.\n\n36:00 – Bob’s songs: “The Effect”, “The World Exploded Into Love”, “Changing Your Mind”\n\n38:42 – Focus on your self-relationship above everything else. “Stay on your own postage stamp.” Bob shares his experience in therapy. Group therapy allows for side mirrors and references that make you more understanding that these are shared human experiences. In Bob’s experience, group therapy allowed him to grow up from immature emotional reactions.\n\n49:34 – Beginning of wrap up. Bob’s 17-year Monday night residency continues at the Saxon Pub 8:30pm-10:00pm.\n\n51:20 – “Big Blue Sea” and “Let the Light In” Bob’s music shows his emotions, but might not lyrically be based in reality.\n\n1:01:09 – Bonus Episode discussing his song, Let the Light In (Radio Edit), from an attachment perspective. Extended excerpt plays(but you gotta listen to the whole song it’s awesome!)\n\nPhew that was FUN!\n\n(All music played w/ permission from the artist.)\nLike this and want to hear more?  Join our email list, subscribe to Tunes here and if you are really into it, sign up for our free online course on Modern Adult Attachment here!",
  "enclosure": "",
  "itunes:subtitle": "Not only does Bob Schneider (professional musician and wicked Creative) share his navigation of emotion as he writes music, in this in-depth conversation he also shares personal information about his therapy and recovery with Sue Marriott.",
  "itunes:summary": "Not only does Bob Schneider (professional musician and wicked Creative) share his navigation of emotion as he writes music, in this in-depth conversation he also shares personal information about his therapy and recovery with Sue Marriott.  He goes on to describe mediocre versus great therapy, how to train your critical brain like your dog, and taking in tons of information like a whale and spitting out “song turds” from his unconscious. Blending anecdotal stories, neuroscience and attachment theory, this interview both entertains and educates.<br />\n<br />\nBonus section:  Sue discusses an extended excerpt of Schneider’s song, “Let the Light In” from an attachment perspective.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "1:03:28"
}