{
  "title": "35: Supercharge Your Brain & Life with Brendon Burchard (Part 1)",
  "pubDate": "Tue, 26 Sep 2017 20:15:51 +0000",
  "guid": "b243bc7f0341d65c48e05ef712748e6d",
  "link": "https://sites.libsyn.com/94610/35-supercharge-your-brain-life-with-brendon-burchard-part-1",
  "itunes:image": "",
  "description": "<p>Join this 3-part podcast with New York Times bestselling author and master high performance trainer Brendon Burchard in a rare conversation on activating the 10 human drives that shape everything you think, feel, and do in life.</p> <p>According to Brendon, our brains are hardwired to meet very specific human drives, and learning to harness and activate these drives is the secret to success and happiness.</p> <p>Make sure you subscribe so you receive the next two parts of our conversation. And pick up a copy of Brendon’s new book - High Performance Habits: How Extraordinary People Become That Way. Whether you want to get more done, lead others better, develop skill faster, or dramatically increase your sense of joy and confidence, the habits in this book will help you achieve it.<br /> <br /> Join our podcast community: <a href= \"http://www.KwikBrain.com\">www.KwikBrain.com</a></p>",
  "content:encoded": "<p>Join this 3-part podcast with New York Times bestselling author and master high performance trainer Brendon Burchard in a rare conversation on activating the 10 human drives that shape everything you think, feel, and do in life.</p> <p>According to Brendon, our brains are hardwired to meet very specific human drives, and learning to harness and activate these drives is the secret to success and happiness.</p> <p>Make sure you subscribe so you receive the next two parts of our conversation. And pick up a copy of Brendon’s new book - High Performance Habits: How Extraordinary People Become That Way. Whether you want to get more done, lead others better, develop skill faster, or dramatically increase your sense of joy and confidence, the habits in this book will help you achieve it.  Join our podcast community: <a href= \"http://www.KwikBrain.com\">www.KwikBrain.com</a></p>",
  "enclosure": "",
  "itunes:duration": "16:00",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Join this 3-part podcast with New York Times bestselling author and master high performance trainer Brendon Burchard in a rare conversation on activating the 10 human drives that shape everything you think, feel, and do in life. According to Brendon,...",
  "itunes:episodeType": "full",
  "itunes:author": "Jim Kwik"
}