{
  "title": "Episode 112: Evolutionary Psychology - David Buss Responds to Critics Part 2",
  "pubDate": "Thu, 17 Dec 2009 01:42:21 +0000",
  "guid": "episode-112-evolutionary-psychology-david-buss",
  "link": "http://www.thepsychfiles.com/2009/12/episode-112-evolutionary-psychology-david-buss-responds-to-critics-part-2/",
  "itunes:image": "",
  "description": "In part 2 of my interview with David Buss, he responds to more criticisms of evolutionary psychology.  Here's what we cover: a) does evolutionary psychology just give criminals another reason not to take responsibility for themselves?,  b) is all the research in evolutionary psychology done on American college students?, c) are evolutionary psychology theories falsifiable? We cover such topics as whether women's mate strategies change depending on where they are in their menstrual cycle? and How does evolutionary psychology might explain homosexuality? and what does evolutionary psychology say about cultural differences in the desire for women with a low waist-hip ratio?  All in this episode of The Psych Files.",
  "content:encoded": "In part 2 of my interview with David Buss, he responds to more criticisms of evolutionary psychology.  Here's what we cover: a) does evolutionary psychology just give criminals another reason not to take responsibility for themselves?,  b) is all the research in evolutionary psychology done on American college students?, c) are evolutionary psychology theories falsifiable? We cover such topics as whether women's mate strategies change depending on where they are in their menstrual cycle? and How does evolutionary psychology might explain homosexuality? and what does evolutionary psychology say about cultural differences in the desire for women with a low waist-hip ratio?  All in this episode of The Psych Files.",
  "enclosure": "",
  "itunes:duration": "25:43",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,lecture",
  "itunes:subtitle": "In part 2 of my interview David Buss responds to more criticisms of evolutionary psychology such as whether evolutionary psychology gives criminals another reason not to take responsibility for themselves? All in this episode of The Psych Files.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "In part 2 of my interview with David Buss, he responds to more criticisms of evolutionary psychology. Here's what we cover: a) does evolutionary psychology just give criminals another reason not to take responsibility for themselves?, b) is all the research in evolutionary psychology done on American college students?, c) are evolutionary psychology theories falsifiable? We cover such topics as whether women's mate strategies change depending on where they are in their menstrual cycle? and How does evolutionary psychology might explain homosexuality? and what does evolutionary psychology say about cultural differences in the desire for women with a low waist-hip ratio? All in this episode of The Psych Files."
}