{
  "title": "Weekly Review: 12/10/2017",
  "link": "https://codesachin.wordpress.com/2017/12/10/weekly-review-12-10-2017/",
  "comments": "https://codesachin.wordpress.com/2017/12/10/weekly-review-12-10-2017/#respond",
  "dc:creator": "srjoglekar246",
  "pubDate": "Sun, 10 Dec 2017 17:28:16 +0000",
  "category": [
    "Machine Learning/AI",
    "Programming",
    "alphazero",
    "blockchain",
    "deepmind",
    "deepvariant",
    "federated learning"
  ],
  "guid": "http://codesachin.wordpress.com/?p=916",
  "description": "The Mobility Robotics course is finally done, and I just started Perception. It seems to be way more concept-heavy than any of the other courses, but I like the content from Week 1 so far! I did not like Mobility as much, since it focussed exclusively on theory, and the content assumed a fair amount &#8230; <a href=\"https://codesachin.wordpress.com/2017/12/10/weekly-review-12-10-2017/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Weekly Review: 12/10/2017</span> <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>The Mobility Robotics course is finally done, and I just started <a href=\"https://www.coursera.org/learn/robotics-perception/home/welcome\">Perception</a>. It seems to be way more concept-heavy than any of the other courses, but I like the content from Week 1 so far! I did not like Mobility as much, since it focussed exclusively on theory, and the content assumed a fair amount of comfort with kinematics/dynamics (which I don&#8217;t have anymore). Anyway, off to the articles for this week:</p>\n<p><strong><a href=\"https://hackernoon.com/the-convergence-of-ai-and-blockchain-whats-the-deal-60c618e3accc\">AI & the Blockchain</a></strong></p>\n<p>This article gives a quick introduction to Blockchain technologies, and then delves into the relationship between Artificial Intelligence and cryptocurrencies.</p>\n<p>It discusses the various ways in which AI could transform blockchain tech, such as: 1. Improving the energy efficiency of mining centers (like <a href=\"https://deepmind.com/blog/deepmind-ai-reduces-google-data-centre-cooling-bill-40/\">DeepMind&#8217;s algorithms do for Google</a>), 2. Increasing scalability using <em>Federated Learning</em>, 3. Predicting which nodes could solve a particular block, so as to &#8216;free&#8217; up the others.</p>\n<p><strong><a href=\"https://research.googleblog.com/2017/04/federated-learning-collaborative.html\">Federated Learning</a></strong></p>\n<p>Coming across the mention of <em>Federated Learning</em> made me realise that I did not remember what it was, so I revisited the old(ish) post on Google&#8217;s Research blog.</p>\n<p>Federated Learning works by <em>decentralizing</em> the training process for ML models (unlike most other technologies that mainly do inference on end-devices). This is useful in cases where communicating data continuously from devices causes bandwidth and latency issues for the user/training server.</p>\n<p>It works like this: Every device downloads the latest version of a model from the central server. Then, as it sees more data in deployment, it trains the local model to compute small &#8216;focussed&#8217; updates based on the user. All these small updates (and the not the raw data that created them) are then sent to the central server, which aggregates all the updates using the <a href=\"https://arxiv.org/pdf/1602.05629.pdf\">FederatedAveraging algorithm</a>. Privacy is ensured primarily by retraining the central model only after receiving a certain number of smaller updates.</p>\n<p><strong><a href=\"https://chess24.com/en/read/news/deepmind-s-alphazero-crushes-chess\">AlphaZero Chess</a></strong></p>\n<p>Sometime back, DeepMind had unveiled the AlphaGo Zero, an algorithm that learned to play Go by playing only against itself (given the basic laws of the game). They then went on to try out the <a href=\"https://jeffbradberry.com/posts/2015/09/intro-to-monte-carlo-tree-search/\">MCTS-based algorithm</a> on chess, and it seems to be working really well! The AlphaZero algorithm apparently defeated Stockfish (current computer chess champion) 28 wins to none (and a bunch of draws).</p>\n<p>Ofcourse, the superior hardware that AlphaZero uses does make a huge difference, but the very fact that such powerful computers can be optimally used to &#8216;meta-learn&#8217; is in itself a game-changer. Do read the <a href=\"https://cdn.chess24.com/GzFl-Z4-SVWO-mC9rL6XhQ/original/mastering-chess-and-shogi-by-self-play.pdf\">original paper</a> to get an idea of their method (especially the section on input/outputs Representations to the deep network)</p>\n<p><strong><a href=\"https://research.googleblog.com/2017/12/deepvariant-highly-accurate-genomes.html\">DeepVariant</a></strong></p>\n<p><a href=\"https://en.wikipedia.org/wiki/DNA_sequencing#High-throughput_methods\">High-Throughput Sequencing (HTS)</a> is a method used in genome sequencing. HTS produces multiple <em>reads</em> of an individual&#8217;s genome, which are then compared to some &#8216;reference&#8217; to explore variations.</p>\n<p>To achieve this, it is necessary to properly align the reads with the reference genome, and also account for errors in measurement. Essentially, every nucleotide position that does not match with the reference could either be a genuine variant or an error in measurement. This is determined using data from all the reads produced by the method &#8211; this problem is called the &#8216;<a href=\"https://www.bioconductor.org/help/course-materials/2014/CSAMA2014/3_Wednesday/lectures/VariantCallingLecture.pdf\">Variant Calling Problem</a>&#8216;.</p>\n<p>DeepVariant, an algorithm co-developed by Google Brain & Verily, converts the variant-calling problem into an image classification problem to achieve state-of-the-art results. It was unveiled at NIPS-2017, and they have open-sourced the code.</p>\n<p><strong><a href=\"https://blog.codinghorror.com/new-programming-jargon/\">Funny Programming Jargon</a></strong></p>\n<p>This is not really an &#8216;article&#8217;, but more of comic relief :-). It lists out various programming terms invented by real developers, that mock the various software engineering pitfalls in a typical workplace. Do read if you appreciate programming humor!</p>\n",
  "wfw:commentRss": "https://codesachin.wordpress.com/2017/12/10/weekly-review-12-10-2017/feed/",
  "slash:comments": 0,
  "media:content": {
    "media:title": "srjoglekar246"
  }
}