{
  "title": "AAAI 2019 Highlights: Dialogue, reproducibility, and more",
  "description": "This post discusses highlights of AAAI 2019. It covers dialogue, reproducibility, question answering, the Oxford style debate, invited talks, and a diverse set of research papers.",
  "link": "http://ruder.io/aaai-2019-highlights/",
  "guid": "5c76ff7c1b9b0d18555b9ebb",
  "category": [
    "events",
    "natural language processing",
    "transfer learning",
    "word embeddings"
  ],
  "dc:creator": "Sebastian Ruder",
  "pubDate": "Thu, 07 Feb 2019 17:00:00 GMT",
  "media:content": "",
  "content:encoded": "<img src=\"http://ruder.io/content/images/2019/02/aaai_reception-1.jpg\" alt=\"AAAI 2019 Highlights: Dialogue, reproducibility, and more\"><p>This post discusses highlights of the <a href=\"https://aaai.org/Conferences/AAAI-19/\">Thirty-Third AAAI Conference on Artificial Intelligence (AAAI-19)</a>.</p><p>I attended <a href=\"https://aaai.org/Conferences/AAAI-19/\">AAAI 2019</a> in Honolulu, Hawaii last week. Overall, I was particularly surprised by the interest in natural language processing at the conference. There were 15 sessions on NLP (most standing-room only) with ≈10 papers each (oral and spotlight presentations), so around 150 NLP papers (out of 1,150 accepted papers overall). I also really enjoyed the diversity of invited speakers who discussed topics from AI for social good, to adversarial learning and imperfect-information games (videos of all invited talks are available <a href=\"https://aaai.org/Conferences/AAAI-19/invited-speakers/\">here</a>). Another cool thing was the <a href=\"#debate\">Oxford style debate</a>, which required debaters to take controversial positions. This was a nice change of pace from panel discussions, which tend to converge to a uniform opinion.</p><p>Table of contents:</p><ul><li><a href=\"#dialogue\">Dialogue</a></li><li><a href=\"#reproducibility\">Reproducibility</a></li><li><a href=\"#question-answering\">Question answering</a></li><li><a href=\"#ai-for-social-good\">AI for social good</a></li><li><a href=\"#debate\">Debate</a></li><li><a href=\"#adversarial-learning\">Adversarial learning</a></li><li><a href=\"#imperfect-information-games\">Imperfect-information games</a></li><li><a href=\"#inductive-biases\">Inductive biases</a></li><li><a href=\"#transfer-learning\">Transfer learning</a></li><li><a href=\"#word-embeddings\">Word embeddings</a></li><li><a href=\"#miscellaneous\">Miscellaneous</a></li></ul><h1 id=\"dialogue\">Dialogue</h1><p>In his talk at the <a href=\"https://sites.google.com/view/deep-dial-2019/home?authuser=0\">Reasoning and Learning for Human-Machine Dialogues workshop</a>, <a href=\"https://scholar.google.com/citations?user=V72PR9wAAAAJ&hl=en\">Phil Cohen</a> argued that <strong>chatbots are an attempt to avoid solving the hard problems of dialogue</strong>. They provide the <em>illusion</em> of having a dialogue but in fact do not have a clue what we are saying or meaning. What we should rather do is <strong>recognize intents via semantic parsing</strong>. We should then reason about the speech acts, infer a user's <em>plan</em>, and help them to succeed. You can find more information about his views in <a href=\"https://arxiv.org/abs/1812.01144\">this position paper</a>.</p><p>During the panel discussion, <a href=\"https://www.microsoft.com/en-us/research/people/izitouni/\">Imed Zitouni</a> highlighted that the limitations of current dialogue models affect user behaviour. <strong>75-80% of the time users only employ 4 skills</strong>: \"play music\", \"set a timer\", \"set a reminder\", and \"what is the weather\". Phil argued that we should not have to learn how to talk, how to make an offer, etc. all over again for each domain. We can often build simple dialogue agents for new domains <a href=\"http://www.aclweb.org/anthology/P18-2008\">\"overnight\"</a>.</p><h1 id=\"reproducibility\">Reproducibility</h1><p>At the <a href=\"https://www.idi.ntnu.no/~odderik/RAI-2019/\">Workshop on Reproducible AI</a>, <a href=\"http://joelgrus.com/\">Joel Grus</a> argued that <a href=\"https://docs.google.com/presentation/d/1ivK8AKgz8Hx-ZYzPC9gJyQK6tzuhR3UuhCEajFGJDlA/\"><strong>Jupyter notebooks are bad for reproducibility</strong></a>. As an alternative, he recommended to adopt higher-level abstractions and declarative configurations. Another good resource for reproducibility is the <a href=\"https://www.cs.mcgill.ca/~jpineau/ReproducibilityChecklist.pdf\">ML reproducibility checklist</a> by <a href=\"https://www.cs.mcgill.ca/~jpineau/\">Joelle Pineau</a>, which provides a list of items for algorithms, theory, and empirical results to enforce reproducibility.</p><!--kg-card-begin: image--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://ruder.io/content/images/2019/02/unit_tests_for_ai_experiments.png\" class=\"kg-image\" alt=\"AAAI 2019 Highlights: Dialogue, reproducibility, and more\"><figcaption>Unit tests for AI experiments recommended by Joel Grus</figcaption></figure><!--kg-card-end: image--><p>A team from Facebook <a href=\"https://arxiv.org/abs/1902.04522\">reported on their experiments reproducing AlphaZero</a> in their <a href=\"https://github.com/pytorch/ELF\">ELF framework</a>, training a model using 2,000 GPUs in 2 weeks. <strong>Reproducing an on-policy, distributed RL system such as AlphaZero is particularly challenging</strong> as it does not have a fixed dataset and optimization is dependent on the distributed environment. Training smaller versions and scaling up is key. For reproducibility, the random seed, the git commit number, and the logs should be stored.</p><p>During the panel discussion, <a href=\"https://www.ntnu.edu/employees/odderik\">Odd Eric Gunderson</a> argued that reproducibility should be defined as the <em>ability of an independent research team to produce the same results using the same AI method based on the documentation by the original authors</em>. Degrees of reproducibility can be measured based on the availability of different types of documentation, such as the method description, data, and code.</p><p><a href=\"https://www.isye.gatech.edu/users/pascal-van-hentenryck\">Pascal van Hentenryck</a> argued that reproducibility could be made part of the peer review process, such as in the <a href=\"http://mpc.zib.de/\">Mathematical Programming Computation journal</a> where each submission requires an executable file (which does not need to be public). He also pointed out that—empirically—papers with supplementary materials are more likely to be accepted.</p><h1 id=\"question-answering\">Question answering</h1><p>At the <a href=\"https://researcher.watson.ibm.com/researcher/view_group_subpage.php?id=9904\">Reasoning and Complex QA Workshop</a>, <a href=\"https://www.mccormick.northwestern.edu/research-faculty/directory/profiles/forbus-ken.html\">Ken Forbus</a> discussed an <a href=\"http://www.qrg.northwestern.edu/papers/Files/QRG_Dist_Files/QRG_2018/Crouse-McFate-Forbus-2018.pdf\">analogical training method for QA</a> that adapts a general-purpose semantic parser to a new domain with few examples. At the end of his talk, Ken argued that the <strong>train/test method in ML is holding us back</strong>. Our learning systems should use rich relational representations, gather their own data, and evaluate progress.</p><p><a href=\"https://allenai.org/team/ashishs/\">Ashish Sabharwal</a> discussed the <a href=\"https://github.com/allenai/OpenBookQA\">OpenBookQA dataset</a> presented at EMNLP 2018 during his talk. The open book setting is situated between reading comprehension and open-ended QA on the textual QA spectrum (see below).</p><!--kg-card-begin: image--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://ruder.io/content/images/2019/02/textual_qa_spectrum.png\" class=\"kg-image\" alt=\"AAAI 2019 Highlights: Dialogue, reproducibility, and more\"><figcaption>The textual QA spectrum</figcaption></figure><!--kg-card-end: image--><p>It is designed to probe a deeper understanding rather than memorization skills and requires applying core principles to new situations. He also argued that while entailment is recognized as a core NLP task with many applications, it is still lacking a convincing application to an end-task. This is mainly due to multi-sentence entailment being a lot harder, as irrelevant sentences often have significant textual overlap.</p><p>Furthermore, he discussed the design of leaderboards, which have to make tradeoffs along multiple competing axes with respect to the host, the submitters, and the community. <strong>A particular deficit of current leaderboards is that they make it difficult to share and build upon successful techniques. </strong>For an extensive discussion of the pros and cons of leaderboards, check out <a href=\"https://soundcloud.com/nlp-highlights/80-leaderboards-and-science-with-siva-reddy\">this recent NLP Highlights podcast</a>.</p><p>The first part of the final panel discussion focused on important outstanding technical challenges for question answering. <a href=\"https://researcher.watson.ibm.com/researcher/view.php?person=us-witbrock\">Michael Witbrock</a> emphasized <strong>techniques to create datasets that cannot easily be exploited by neural networks</strong>, such as the adversarial filtering in <a href=\"http://aclweb.org/anthology/D18-1009\">SWAG</a>. Ken argued that models should come up with answers and explanations rather than performing multiple choice question answering, while Ashish noted that such explanations need to be automatically validated.</p><p><a href=\"https://www.cs.cmu.edu/~hovy/\">Eduard Hovy</a> suggested that one way towards a system that can perform more complex QA could consist of the following steps:</p><ol><li>Build a symbolic numerical reasoner that leverages relations from an existing KB, such as <a href=\"http://www.cs.utexas.edu/users/ml/nldata/geoquery.html\">Geobase</a>, which contains geography facts.</li><li>Look at the subset of questions in existing natural language datasets, which require reasoning that is possible with the reasoner.</li><li>Annotate these questions with semantic parses and train a semantic parsing model to convert the questions to logical forms. These can then be provided to the reasoner to produce an answer.</li><li>Augment the reasoner with another reasoning component and repeat steps 2-3.</li></ol><p>The panel members noted that such reasoners exist, but lack a common API.</p><p>Finally, here are a few papers on question answering that I enjoyed:</p><ul><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-RuckleA.3648.pdf\"><strong>COALA: A Neural Coverage-Based Approach for Long Answer Selection with Small Data</strong></a>: An approach that ranks answers based on how many of the question aspects they cover. They incorporate syntactic information via dependency parses and find that this improves performance.</li><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-DengYang.4661.pdf\"><strong>Multi-Task Learning with Multi-View Attention for Answer Selection and Knowledge Base Question Answering</strong></a>: Answer selection and knowledge base QA are learned jointly via multi-task learning. Attention is performed on different views of the data.</li><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-TafjordO.6869.pdf\"><strong>QUAREL: A Dataset and Models for Answering Questions about Qualitative Relationships</strong></a>: A challenging new QA dataset of 2,771 story questions that require knowledge about qualitative relationships pertaining to 19 quantities such as smoothness, friction, speed, heat, and distance.</li></ul><h1 id=\"ai-for-social-good\">AI for social good</h1><p>During his invited talk, <a href=\"http://teamcore.usc.edu/tambe/\">Milind Tambe</a> looked back on 10 years of research in AI and multiagent systems for social good (video available <a href=\"https://vimeo.com/313940453\">here</a>; slides available <a href=\"http://teamcore.usc.edu/lectures/AAAI_2019.pdf\">here</a>). Milind discussed his research on using game theory to optimize security resources such as <a href=\"https://pdfs.semanticscholar.org/1a10/5181f785502be8d71e6f6f0569e6eedd60e6.pdf\">patrols at airports</a>, <a href=\"https://research.create.usc.edu/cgi/viewcontent.cgi?referer=https://scholar.google.com/&httpsredir=1&article=1134&context=nonpublished_reports\">air marshal assignments on flights</a>, <a href=\"http://teamcore.usc.edu/projects/coastguard/default.htm\">coast guard patrols</a>, and <a href=\"http://teamcore.usc.edu/people/Paws/index.html\">ranger patrols in African national parks to protect against poachers</a>. Overall, his talk was a striking reminder of the positive effects AI can have if it is employed for social good.</p><!--kg-card-begin: image--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://ruder.io/content/images/2019/02/ml_for_predicting_poacher_behaviour.png\" class=\"kg-image\" alt=\"AAAI 2019 Highlights: Dialogue, reproducibility, and more\"><figcaption>An overview of an ML approach for predicting poacher behaviour in an African national park</figcaption></figure><!--kg-card-end: image--><h1 id=\"debate\">Debate</h1><p>The <a href=\"https://en.wikipedia.org/wiki/Debate#Oxford-style_debating\">Oxford style</a> debate focused on the proposition “The AI community today should continue to focus mostly on ML methods” (video available <a href=\"https://vimeo.com/314378703\">here</a>). It pitted <a href=\"https://www.cs.purdue.edu/homes/neville/\">Jennifer Neville</a> and <a href=\"https://www.cs.utexas.edu/~pstone/\">Peter Stone</a> on the 'pro' side against <a href=\"http://cs.brown.edu/~mlittman/\">Michael Littman</a> and <a href=\"https://allenai.org/team/orene/\">Oren Etzioni</a> on the 'against' side, with <a href=\"https://www.cs.ubc.ca/~kevinlb/\">Kevin Leyton-Brown</a> as moderator. Overall, the debate was entertaining and engaging to watch.</p><!--kg-card-begin: image--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://ruder.io/content/images/2019/02/oxford_style_debate.png\" class=\"kg-image\" alt=\"AAAI 2019 Highlights: Dialogue, reproducibility, and more\"><figcaption>The debater panel (from left to right): Peter Stone, Jennifer Neville, Kevin Leyton-Brown (moderator), Michael Littman, Oren Etzioni</figcaption></figure><!--kg-card-end: image--><p>Here are some representative remarks from each of the debaters that stuck with me:</p><blockquote><em>\"The unique strength of the AI community is that we focus on the problems that need to be solved.\" – Jennifer Neville<br>\"We are in the middle of one of the most amazing paradigm shifts in all of science, certainly computer science.\" – Oren Etzioni<br>\"If you want to have an impact, don’t follow the bandwagon. Keep alive other areas.\" – Peter Stone<br>\"Scientists in the natural sciences are actually very excited about ML as much of their research relies on expensive computations, which can be approximated with neural networks.\" – Michael Littman</em></blockquote><p>There were some important observations and ultimately a general consensus that ML alone is not enough and we need to integrate other methods with ML. Yonatan Belinkov also <a href=\"https://twitter.com/boknilev/status/1090451665486925825\">live tweeted</a>, while I <a href=\"https://twitter.com/seb_ruder/status/1090454767438946304\">tweeted some remarks that elicited laughs</a>.</p><h1 id=\"adversarial-learning\">Adversarial learning</h1><p>During his invited talk (video available <a href=\"https://vimeo.com/313941176\">here</a>), <a href=\"https://ai.google/research/people/105214\">Ian Goodfellow</a> discussed a multiplicity of areas to which adversarial learning has been applied. Among many advances, Ian mentioned that he was impressed by the performance and flexibility of <a href=\"https://arxiv.org/abs/1805.08318\">attention masks for GANs</a>, particularly that they are not restricted to circular masks. </p><p>He discussed adversarial examples, which are a consequence of moving away from i.i.d. data: attackers are able to confuse the model by showing unusual data from a different distribution such as <a href=\"https://arxiv.org/abs/1707.08945\">graffiti on stop signs</a>. He also argued—contrary to the prevalent opinion—that deep models that are more robust are more interpretable than linear models. The main reason is that the latent space of a linear model is totally unintuitive, while a more robust model is more inspectable (as can be seen below).</p><!--kg-card-begin: image--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://ruder.io/content/images/2019/02/latent_space_vulnerable_model_vs_robust_model.png\" class=\"kg-image\" alt=\"AAAI 2019 Highlights: Dialogue, reproducibility, and more\"><figcaption>Traversing the latent space of a linear model (left) vs. a deep, more robust model (right) between different MNIST labels starting from \"9\"</figcaption></figure><!--kg-card-end: image--><p>Semi-supervised learning with GANs can allow models to be more sample-efficient. What is interesting about such applications is that they focus on the discriminator (which is normally discarded) rather than the generator where the <a href=\"https://arxiv.org/abs/1606.03498\">discriminator is extended</a> to <a href=\"https://arxiv.org/abs/1606.03498\">classify </a><a href=\"https://arxiv.org/abs/1606.01583\"><em>n+1</em> classes</a>. Regarding leveraging GANs for NLP, Ian conceded that we currently have not found a good way to deal with the large action space required to generate sentences with RL.</p><h1 id=\"imperfect-information-games\">Imperfect-information games</h1><p>In his invited talk (video available <a href=\"https://vimeo.com/313942390\">here</a>), <a href=\"http://www.cs.cmu.edu/~sandholm/\">Tuomas Sandholm—</a>whose <a href=\"https://www.engadget.com/2017/02/10/libratus-ai-poker-winner/\">AI Libratus was the first AI to beat top Heads-Up No-Limit Texas Hold'em professionals in January 2017—</a>discussed new results for solving imperfect-information games. He stressed that <strong>only game-theoretically sound techniques yield strategies that are robust against all opponents in imperfect-information games</strong>. Other advantages of a game-theoretic approach are a) that even if humans have access to the entire history of plays of the AI, they still can't find holes in its strategy; and b) it requires no data, just the rules of the game.</p><!--kg-card-begin: image--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://ruder.io/content/images/2019/02/real-world_applications_imperfect-information_games.png\" class=\"kg-image\" alt=\"AAAI 2019 Highlights: Dialogue, reproducibility, and more\"><figcaption>Most real-world applications are imperfect-information games</figcaption></figure><!--kg-card-end: image--><p>For solving such games, the quality of the solution depends on the quality of the abstraction. Developing better abstractions is thus important, which also applies to modelling such games. In imperfect-information games, planning is important. In real-time planning, we must consider how the opponent can adapt to changes in the policy. In contrast to perfect-information games, states do not have well-defined values.</p><h1 id=\"inductive-biases\">Inductive biases</h1><p>There were several papers that incorporated different inductive biases into existing models:</p><ul><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-GuptaPankaj1.4838.pdf\"><strong>Document Informed Neural Autoregressive Topic Models with Distributional Prior</strong></a>: An extension of the <a href=\"https://papers.nips.cc/paper/4613-a-neural-autoregressive-topic-model.pdf\">DocNADE</a> topic model using word embedding vectors as prior. The model is evaluated on 15 datasets.</li><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-XiaQ.7468.pdf\"><strong>Syntax-aware Neural Semantic Role Labeling</strong></a>: The authors incorporate various syntax features into a semantic role labelling model. In contrast to common practice, which often tries to incorporate syntax via a TreeLSTM, they find that shortest dependency path and tree position features perform best. </li><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-LuY.5171.pdf\"><strong>Relation Structure-Aware Heterogeneous Information Network Embedding</strong></a>: A network embedding model that treats different relations differently: For affiliation relations (<em>\"papers are published in conferences\")</em> Euclidean distance is used, while for interaction relations (<em>\"authors write papers\")</em> a translation-based distance is used.</li><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-GuoM.1484.pdf\"><strong>Gaussian Transformer: a Lightweight Approach for Natural Language Inference</strong></a>: A Transformer with a Gaussian prior for the self-attention that encourages focusing on neighbouring tokens.</li><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-LeeJ.6432.pdf\"><strong>Gradient-based Inference for Networks with Output Constraints</strong></a>: A method to incorporate output constraints, e.g. matching number of brackets for syntactic parsing, agreement with parse spans for SRL, etc. into the model via gradient-based inference at test-time. The method is extensively evaluated and also performs well on out-of-domain data.</li><li><strong><a href=\"https://arxiv.org/abs/1811.00146\">ATOMIC: An Atlas of Machine Commonsense for If-Then Reasoning</a>: </strong>A collection of 300k textual descriptions focusing on if-then relations with variables. Multi-task models that exploit the hierarchical structure of the data perform better.</li></ul><h1 id=\"transfer-learning\">Transfer learning</h1><p>Papers on transfer learning ranged from multi-task learning and semi-supervised learning to sequential and zero-shot transfer:</p><ul><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-ChenLingzhen.6418.pdf\"><strong>Transfer Learning for Sequence Labeling using Source Model and Target Data</strong></a>: Extension of fine-tuning techniques for NER for the case where the target task includes labels from the source domain (as well as new labels). 1) Output layer is extended with embeddings for new labels. 2) A BiLSTM takes the features of the source model as input and feeds its output to the target model. </li><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-SanhV.7138.pdf\"><strong>A Hierarchical Multi-task Approach for Learning Embeddings from Semantic Tasks</strong></a>: A hierarchical model that jointly learns coreference resolution, relation extraction, entity mention detection, and NER. It achieves state of the art on 3/4 tasks. (<em>Disclaimer: I'm a co-author of this paper.</em>)</li><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-SachanD.7236.pdf\"><strong>Revisiting LSTM Networks for Semi-Supervised Text Classification via Mixed Objective Function</strong></a>: A combination of entropy minimization, adversarial and virtual adversarial training with a simple 1-layer BiLSTM achieves state-of-the-art results on multiple text classification datasets. </li><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-RijhwaniS.6382.pdf\"><strong>Zero-shot Neural Transfer for Cross-lingual Entity Linking</strong></a>: A cross-lingual entity linking model that trains a character-based entity similarity encoder on a bilingual lexicon of entities. Conceptually similar to <a href=\"https://arxiv.org/abs/1706.04902\">cross-lingual word embedding models</a>. For languages that do not share the same script, words are transcribed to phonemes.</li><li><strong><a href=\"https://arxiv.org/abs/1808.10059\">Zero-Shot Adaptive Transfer for Conversational Language Understanding</a>: </strong>A model that performs zero-shot slot tagging by embedding the slot description and fine-tuning a pretrained model on the target domain.</li><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-SiddhantA.2024.pdf\"><strong>Unsupervised Transfer learning for Spoken Language Understanding in Intelligent Agents</strong></a>: A more light-weight ELMo model that pretrains a shared BiLSTM layer for intent classification and entity tagging and fine-tunes it with ULMFiT techniques.</li><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-RuderS.6318.pdf\"><strong>Latent Multi-task Architecture Learning</strong></a>: A multi-task learning architecture that enables more flexible parameter sharing between tasks and generalizes existing transfer and multi-task learning architectures. (<em>Disclaimer: I'm a co-author of this paper.</em>)</li><li><strong><a href=\"https://arxiv.org/abs/1811.11456\">GIRNet: Interleaved Multi-Task Recurrent State Sequence Models</a></strong>: A multi-task learning model that leverages the output from auxiliary models based on position-dependent gates. The model is applied to sentiment analysis and POS tagging of code-switched data and target-dependent sentiment analysis.</li><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-ZhangLipeng.3275.pdf\"><strong>A Generalized Language Model in Tensor Space</strong></a>: A higher-order language model that builds a representation based on the tensor product of word vectors. The model achieves strong results on PTB and WikiText.</li></ul><h1 id=\"word-embeddings\">Word embeddings</h1><p>Naturally there were also a number of papers that provided new methods for learning word embeddings:</p><ul><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-LiuTianlin.5754.pdf\"><strong>Unsupervised Post-processing of Word Vectors via Conceptor Negation</strong></a>: A post-processing method that uses conceptors (a linear transformation) to dampen directions where a word vector has high variances. Post-processed embeddings not only improve on word similarity, but also on dialogue state tracking.</li><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-AbdallaM.6635.pdf\"><strong>Enriching Word Embeddings with a Regressor Instead of Labeled Corpora</strong></a>: A method that enriches word embeddings during training with sentiment information based on a regressor trained on valence information from a sentiment lexicon. The enriched embeddings improve performance on sentiment and non-sentiment tasks.</li><li><strong><a href=\"https://arxiv.org/abs/1811.03866\">Learning Semantic Representations for Novel Words: Leveraging Both Form and Context</a>: </strong>A model that learns representations for novel words both from the surface form and the context—in contrast to previous models that only leverage one of the sources.</li></ul><h1 id=\"miscellaneous\">Miscellaneous</h1><p>Finally, here are some papers that I enjoyed that do not fit into any of the above categories:</p><ul><li><a href=\"https://www.aaai.org/Papers/AAAI/2019/AAAI-DalviF.5894.pdf\"><strong>What Is One Grain of Sand in the Desert? Analyzing Individual Neurons in Deep NLP Models</strong></a>: A supervised method to extract relevant neurons with regard to a task (by correlating neurons with the target property) and an unsupervised method to extract salient neurons with regard to the model (by correlating neurons across models). Techniques are evaluated on NMT and language modelling.</li><li><strong><a href=\"https://arxiv.org/abs/1811.12181\">What Should I Learn First: Introducing LectureBank for NLP Education and Prerequisite Chain Learning</a></strong>: A dataset containing 1,352 NLP lecture files classified according to a taxonomy with 208 prerequisite relation topics. A model is trained to learn prerequisite relations to answer \"what should one learn first\".</li></ul><p><em>Cover image: AAAI-19 Opening Reception</em></p>"
}