{
  "title": "Google Translate’s instant camera translation gets an upgrade",
  "link": "https://blog.google/products/translate/google-translates-instant-camera-translation-gets-upgrade/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Google Translate allows you to explore unfamiliar lands, communicate in different languages, and make connections that would be otherwise impossible. One of my favorite features on the <a href=\"https://translate.google.com/about\">Google Translate mobile app</a> is instant camera translation, which allows you to see the world in your language by just pointing your camera lens at the foreign text. Similar to the real-time translation feature we recently launched in <a href=\"https://www.blog.google/products/search/helpful-new-visual-features-search-lens-io/\">Google Lens</a>, this is an intuitive way to understand your surroundings, and it’s especially helpful when you’re traveling abroad as it works even when you’re not connected to Wi-Fi or using cellular data. Today, we’re launching new upgrades to this feature, so that it’s even more useful.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--4 h-c-grid__col--6 h-c-grid__col-l--offset-4 h-c-grid__col--offset-3\"><a class=\"article-image--link\"><img alt=\"Instant camera translation.gif\" class=\"article-image--medium\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/optics.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Translate from 88 languages into 100+ languages</h3><br/><p>The instant camera translation adds support for 60 more languages, such as Arabic, Hindi, Malay, Thai and Vietnamese. <a href=\"https://support.google.com/translate/answer/6142483?ref_topic=7011659\">Here’s a full list</a> of all 88 supported languages.</p><p>What’s more exciting is that, previously you could only translate between English and other languages, but now you can translate into any of the 100+ languages supported on Google Translate. This means you can now translate from Arabic to French, or from Japanese to Chinese, etc. </p><h3>Automatically detect the language</h3><p>When traveling abroad, especially in a region with multiple languages, it can be challenging for people to determine the language of the text that they need to translate. We took care of that—in the new version of the app, you can just select “Detect language” as the source language, and the Translate app will automatically detect the language and translate. Say you’re traveling through South America, where both Portuguese and Spanish are spoken, and you encounter a sign. Translate app can now determine what language the sign is in, and then translate it for you into your language of choice.</p><h3>Better translations powered by Neural Machine Translation</h3><p>For the first time, Neural Machine Translation (NMT) technology is built into instant camera translations. This produces <a href=\"https://ai.googleblog.com/2016/09/a-neural-network-for-machine.html\">more accurate</a> and natural translations, reducing errors by 55-85 percent in certain language pairs. And most of the languages can be downloaded onto your device, so that you can use the feature without an internet connection. However, when your device is connected to the internet, the feature uses that connection to produce higher quality translations.</p><h3>A new look</h3><p>Last but not least, the feature has a new look and is more intuitive to use. In the past, you might have noticed the translated text would flicker when viewed on your phone, making it difficult to read. We’ve reduced that flickering, making the text more stable and easier to understand. The new look has all three camera translation features conveniently located on the bottom of the app: “Instant” translates foreign text when you point your camera at it. \"Scan\" lets you take a photo and use your finger to highlight text you want translated. And “Import” lets you translate text from photos on your camera roll. </p><br/>To try out the the instant camera translation feature, <a href=\"https://translate.google.com/about/index.html\">download the Google Translate app</a>.</div></div></body></html>",
  "pubDate": "Wed, 10 Jul 2019 17:00:00 +0000",
  "guid": "https://blog.google/products/translate/google-translates-instant-camera-translation-gets-upgrade/",
  "category": [
    "Translate",
    "AI"
  ],
  "og": {
    "type": "article",
    "title": "Google Translate’s instant camera translation gets an upgrade",
    "description": "Google Translate adds new languages, source language auto-detect, and increased accuracy to its instant camera translations feature.",
    "site_name": "Google",
    "url": "https://blog.google/products/translate/google-translates-instant-camera-translation-gets-upgrade/"
  },
  "author": {
    "name": "Xinxing Gu",
    "title": "Product Manager",
    "department": "Google Translate",
    "company": ""
  }
}