{
  "title": "Has the Willingness to Work Fallen During the Pandemic?",
  "link": "https://fedinprint.org/item/fedhwp/93800/original",
  "description": "We examine the effect of the Covid pandemic on willingness to work along both the extensive and \nintensive margins of labor supply. Special survey questions in the Job Search Supplement of the \nSurvey of Consumer Expectations (SCE) allow us to elicit information about individuals’ desired \nwork hours for the 2013-2021 period. Using these questions, along with workers’ actual labor \nmarket participation, we construct a labor market underutilization measure, the Aggregate Hours \nGap (AHG), following Faberman et al. (2020). The AHG captures changes in labor market \nunderutilization for the full population along both the extensive and intensive margins using data \non desired work hours as a measure of their potential labor supply. We find that the sharp increase \nin the AHG during the Covid pandemic essentially disappeared by the end of 2021. We also \ndocument a sharp decline in desired work hours during the pandemic that persists through the end \nof 2021 and is roughly double the drop in the labor force participation rate. Ignoring the decline in \ndesired hours overstates the degree of underutilization by 2.5 percentage points (12.5%). Our \nfindings suggest that, as of 2021Q4, the labor market is tighter than suggested by the \nunemployment rate and the adverse labor supply effect of the pandemic is more pronounced than \nimplied by the labor force participation rate. These discrepancies underscore the importance of \ntaking into account the intensive margin for both labor market underutilization and potential labor \nsupply.",
  "guid": "https://fedinprint.org/item/fedhwp/93800/original",
  "dc:creator": "Mueller, Andreas I.; Sahin, Aysegul; Faberman, R. Jason",
  "dc:date": "2022-02-01",
  "rdau:hasExtent": 51,
  "dc:subject": "labor market slack; Covid pandemic; desired work hours; potential labor supply",
  "swpo:hasNumber": "WP 2022-08",
  "identifiers:doi": "10.21033/wp-2022-08",
  "bibo:series": "Working Paper Series"
}