{
  "title": "Steering the boat towards an unknown destination",
  "link": "https://audioboom.com/posts/7737565",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1906,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>The economy of the euro area is forecast to contract by 8.7% in 2020 but grow by 6.1% in 2021. The drop in GDP in 2009, the worst year of the financial crisis, was just over 5%. There is no doubt that the drop we face today is much more significant, although it is expected to be short-lived with a sharp bounce back. However, all EU countries are currently going through a second COVID-19 wave exponentially worse than the first in terms of number of infections, albeit with fewer deaths (so far). Who knows what the real hit to the economy will be, and indeed how long it will be before we can resume normality?<br>\n<br>\nIn this episode of the Sound of Economics, Giuseppe Porcaro is joined by Bruegel deputy director Maria Demertzis, and Nicola Viegi, Professor of Monetary Economics at the University of Pretoria, who is based in South Africa. They will explore the theme of uncertainty, highlighted by the pandemic, and how to plan policy interventions, especially monetary policy, in this climate of uncertainty.<br>\n<br>\n\n</div>\n<div>Maria Demertzis and Marta Domínguez-Jiménez, Bruegel research analyst have recently published a paper for the European Parliament on the topic, looking at the challenges faced by the European Central Bank: ‘Monetary policy in the time of COVID-19, or how uncertainty is here to stay’: <a href=\"https://www.bruegel.org/2020/11/monetary-policy-in-the-time-of-covid-19-or-how-uncertainty-is-here-to-stay/\">https://www.bruegel.org/2020/11/monetary-policy-in-the-time-of-covid-19-or-how-uncertainty-is-here-to-stay/</a>\n</div>\n",
  "itunes:summary": "Shocks pass, but change remains a constant. We need to start focusing on permanent changes in the economy and how to adapt to them.",
  "pubDate": "Wed, 25 Nov 2020 11:23:00 +0000",
  "guid": "tag:audioboom.com,2020-11-25:/posts/7737565",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}