{
  "title": "#491: Which Harry Potter Character Would We Want To Be?",
  "link": "https://audioboom.com/posts/7731208",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3926,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Thanksgiving is all about family! Join us for a Weasley Family-themed Quizzitch Live on Sunday, November 22nd!</li>\n<li>The hosts share their reactions to the news that Mads Mikkelson will replace Johnny Depp as Grindelwald in the <em>Fantastic Beasts</em> series</li>\n<li>MuggleCasTBT: In May 2016, which characters did we predict we’d see in the Fantastic Beasts series? The answers may surprise you!</li>\n<li>Main Discussion: Which character would we want to be in the <em>Harry Potter</em> series, and why? Charlie Weasley? Nearly-Headless Nick? For real?!?!</li>\n<li>Listeners weigh in with their picks including Oliver Wood, Crookshanks, Luna Lovegood, Celestina Warbeck and more!</li>\n<li>We dig deep into the Muggle Mail  bag to answer some lingering questions</li>\n<li>The \"real\" Harry Potter fan debate continues</li>\n<li>Why is Slytherin House still allowed to exist?</li>\n<li>Could Sirius going to Azkaban have been part of Dumbledore's larger plan?</li>\n<li>Why is Harry so good at resisting the Imperius Curse? Could it be the Horcrux?</li>\n<li>Will it really be that hard for fans to adjust to a new Grindelwald?</li>\n<li>Should fans stop complaining about plot holes and let J.K. Rowling finish the <em>Fantastic Beasts</em> series first? One listener thinks so!</li>\n<li>Quizzitch: Rhys Ifans, who plays Xenophilius Lovegood in <em>Harry Potter and the Deathly Hallows</em>, shares a birthday with this Canadian quiz show host. (You must answer in the form of a question)</li>\n<li>This week's episode is sponsored by Quip (visit <a href=\"http://getquip.com/Muggle\">GetQuip.com/Muggle</a> and get your first refill free), BetterHelp (visit <a href=\"http://www.BetterHelp.com/mugglecast\">BetterHelp.com/mugglecast</a> for 10% off), and BeachBody (text ‘mugglecast’ to 30-30-30 to receive a free trial!).</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like Bonus MuggleCast! And, participate in our magical Holiday gift exchange.</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 17 Nov 2020 12:00:00 +0000",
  "guid": "tag:audioboom.com,2020-11-16:/posts/7731208",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}