{
  "title": "EPISODE 34 The Magliana Gang (Part 1)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Thu, 03 May 2018 13:00:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2018/5/3/episode-34-the-magliana-gang-part-1",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5ae95b391ae6cfded2c1a58b",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1525243052870-RM63NE41IDQ55B78APYN/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5ae95caaf950b7f108ff630c\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1525243052870-RM63NE41IDQ55B78APYN/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“A lifetime serving one machine<br>Is ten times worse than prison”&nbsp;</em><br>—&nbsp;The Clash (from the song <em>Bankrobber</em>)</p><p class=\"\"><em>“We were treated like movie stars with muscle. We had it all, just for the asking… Anything I wanted was a phone call away. Free cars. The keys to a dozen hideout flats all over the city…When I was broke I would go out and rob some more. We ran everything. We paid off cops. We paid off lawyers. We paid off judges. Everybody had their hands out. Everything was for the taking.”&nbsp;</em><br>— From the movie <em>Goodfellas</em></p><p class=\"\">“Drugs are power”<br>— Antonio Mancini&nbsp;</p><p class=\"\">This series is about the rise of a street gang that took over Rome in the 1970s and 1980s. The Magliana gang was not just one of many criminal organisations who operated in Italy. Among their business partners, they counted Italy’s most important politicians, bankers, secret services, and possibly the Vatican itself. The gang left an indelible mark on Italian history. The story of their rise to power and of the heyday of their rule truly is stranger than fiction. It’s the kind of story that makes you think that the Godfather 3 perhaps was a documentary after all. There are lots of books and documentaries about this story but they are nearly all in Italian, so it looks like I’m your man if you wanna hear this story in English—or whatever approximation of English I speak. In this episode, we’ll see one of bloodiest gangsters in the late 20th century being buried among Cardinals; why law-abiding citizens are fascinated with gangsters; the genesis of the Banda della Magliana; the kidnapping of the Duke Massimiliano Grazioli Lante della Rovere; how the gang took over Rome; the gang becoming the liaison to the criminal underworld for Church and State; the story of The Years of Lead; Italian Prime Ministers being kidnapped by Communist guerrillas; the killing of Franchino Nicolini, and much more.&nbsp;</p><p class=\"\">This episode is sponsored by <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a> For less than $ 10 per meal, Blue Apron delivers straight to your door seasonal recipes along with pre-portioned ingredients to make delicious, home-cooked meals. Get $ 30 off your first order—with free shipping—by going to <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a>&nbsp;</p><p class=\"\">Please, also show some love to my regular sponsors by shopping for supplements, special foods, clothing and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">And if you are in the market for backpacks, computer bags and other hemp gear, check out my favorites at <a href=\"http://www.dsgear.com\">http://www.dsgear.com</a>&nbsp;</p><p class=\"\">History on Fire is brought to you by Kannaway. All CBD products are from organic, non-GMO European HEMP grown on generational family farms. The products all have a triple authenticated process guaranteeing you’re getting exactly what you are paying for. Because all of the CBD is from hemp and NOT cannabis, it is legal to use and possess in all 50 states AND Europe! Now you can get 100% THC-free CBD oil from hemp, delivered to your door in all 50 of the Unites States and the whole of Europe. Please check them out at: <a href=\"https://kannaway.com/2496006\">https://kannaway.com/2496006</a>&nbsp;</p><p class=\"\">A huge thank you to <a href=\"https://www.dynastyforge.com/\">https://www.dynastyforge.com/</a> for sharing with me their amazing swords.&nbsp;If you train in Jiujitsu (or any other sport for that matter), check out the knee braces at <a href=\"https://nevertapgear.com/\">https://nevertapgear.com/</a>&nbsp;</p><p class=\"\">PATREON NEWS: I have just started a Patreon account!!!! If you feel in a generous mood, please, check it out at <a href=\"http://www.patreon.com/historyonfire\">www.patreon.com/historyonfire</a>&nbsp;<br><br>My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>. Thank you to Onnit, Datsusara, Float Clinic, Shaman’s Simple Solutions, War Fuel, Proven Nutrition, and Fight Chix for sponsoring her for her first MMA fight. If you’d like to check out Fight Chix merchandise, you can get a 20% discount by going to <a href=\"http://www.fightchix.com/\">http://www.fightchix.com/</a> and entering the code Fire20 upon checkout.</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "1:23:29",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 35,
  "itunes:title": "EPISODE 34 The Magliana Gang (Part 1)",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 34 The Magliana Gang (Part 1)"
  }
}