{
  "title": "SC EP:894 I Was Being Stalked",
  "itunes:title": "SC EP:894 I Was Being Stalked",
  "pubDate": "Sun, 09 Oct 2022 22:30:04 +0000",
  "guid": "e4f21d77-372e-4ec0-8049-624601168457",
  "link": "https://sasquatchchronicles.com/sc-ep894-i-was-being-stalked/",
  "itunes:image": "",
  "description": "<p>John writes “January of 2017 I moved to Pikeville, Eastern Kentucky. The apartment complex I moved into was an old abandoned coal mine holler that had been converted which had an old coal road that went up a mountain and then swing around it with acre’s of woods.</p> <p>Well, whenever Id sit in the picnic area to have a cigarette id notice around 10+ at night this howling out in the nearby hills which now i can say sounded almost identical to the Ohio Sounds. I’d hear one howl and then maybe 30 seconds later there’d be another one from another hill that was maybe a mile or so away, and then I’d hear another, and another, and you could listen to these call and responses for hours without end. Well by April I was trying to get back into shape and I love to hike so I decided I’d get up around 6 am and hike up that coal road and back. As I’m hiking up and it got darker and darker up that road I noticed this strange bird whistling at me. It was strange because of how loud it was, and I mean the pitch was just so loud and I thought to myself, “that’s a big damn bird!” And I whistled back. Wes, my grandpa was a Green Beret in Vietnam who partly helped raise me, and I’ve been in the woods of Illinois and Wisconsin my whole life and never encountered much that was weird, although my Grandpa did and told me stories here and there, but I wasn’t afraid of much. Well, I’m hiking up and not only is that whistling getting closer, and I mean close to where it was like ten feet from me in the treeline of woods. I turned on the flash light on my phone and couldn’t see anything it was so dense. But then I noticed this “bird” was keeping pace with me.</p> <p>Then small pebbles started landing in front of me as I walked down. At first I thought it was just loose rock sliding down, but then it became apparent that something was tossing them right at my feet. At this point I’m about 300 feet up this old road in the pitch dark. So, I gently tossed one back, and then a big one, maybe 1/2 pound rock flung right at my feet. I froze man! Now, I gently yelled out, “is someone out there?” And that bird whistling started up even louder than it had before! Idk what overcame me, but I started belting out the St. Michael prayer in Latin and then the Hail Mary pretty audibly, and not wanting to turn back continued up that road. All of this whistling, keeping pace, and Pebble tossing just amped up as I was coming to a bend in the road that turned with the mountain. Idk what it was, but as I reach it with rosary in hand I got this bad bad feeling like something is really wrong here, and I spoke aloud and said, “idk what ya are, but im just walking here…” And the Pebble tossing got more intense and I could now hear “things” trudging through the wood at paces that I knew werent people. So I turned around and calmly began to go home. I thought that this could be bear or well hell a damn bigfoot. How loud the trudging was, combined with the whistling, and Pebble tossing I wanted to run the hell outta there down back into that holler, but if ya think that there’s an animal ya just don’t do that. And idk why, but something told me do not turn your back to them. So I’m trying to make it down while keeping an eye on what’s behind me, and the moments that I looked down the road towards the apartment complex something just leaped from the side of the mountain onto the road, and then down into a bunch of thicket. And I stopped and yelled, “what the fuck was that!” If it were a man he’d have fallen 400 feet down a vertical fall and broke his neck or something I mean it was steep! And covered in thicket and thorn bushes. And how loose the rocks were I mean if you did get a footing you’d just fall on your ass and slide and tumble down. Whatever this was got it’s footing and slid and trudged down with great volume like stomping through a huge snow drift. So there I am feeling like a fool the sun is begging to make the horizon pink up just a little at this point.</p> <p>I kept thinking to myself that this is not how I’m gonna die! By this point I felt with all of the noise that had to be five to eight things in the woods stalking me. Honest to God I knew that I was being followed and scrutinized and that I had pissed something off with my presence! The pebbles were being tossed at an alarming rate, there were by now eight or so “big birds” whistling at me from about ten or so feet in the woods, branches were snapping, and it was like multiple freight trains just trudging through those woods! This is a steep hill I mean it is steep I cannot imagine men being able to do this without falling down the only flat surface was the road. When I got about 100 feet down before the apartment idk what overcame me but something told me to just book it for the farm lamp and I ran like hell until I got to it spun around. I stood there watching and couldn’t see anything! They had stayed up there, but were still just making all sorts of noise.<br /> <br /> Idk what I started, but after that I felt like I was being watched whenever I was outside in that holler. If I went outside my apartment by my car to smoke pebbles would start getting tossed right at my feet in the parking lot from a mountain side, or a big bird would start whistling at me. And we had huge street lights shinning onto our parking lot. And as this is happening I’d take out a big old flashlight and shine into the woods. I did get eye shine a couple of times, but couldn’t make out faces of what they were which just creeped me out to no end. I went up the mountains couple of times in the day and found what appeared to be tree breaks, a couple of structures, sticks in the road. Now idk, these sticks were just laid ever so carefully in the road. What creeped me out was that they’d appear when I was coming back down. On one hike, idk I got dizzy on the way home. Now I do have epilepsy, but this was different. I’m hiking down the road and suddenly I got dizzy, the sound in my ears was like tv static, and I wanted to take my shirt off because I felt so hot, but I laid down in the dirt ditch for a few minutes and just felt drained of everything I just thought of my mother and picked myself up and forced myself down that road. When I got home I just collapsed in bed and slept for a good six hours. Now I think looking back that that was side effects of infrasound.</p> <p>But then one night my roommate and I went out to one of the picnic areas to smoke and talk and as we’re making it back toward my building idk Wes the ground shook to the point I felt like I’d lost my footing like a giant was stomping in front of us BOOM BOOM BOOM and let out this scream I’ve never heard before or since it was like a woman mixed with a bear, a lion, and a witch all in one terrifying scream idk, but I JUMPED like three feet up and just ran up a picnic table and I could not look at it! We were stuck in that parking lot until the sun came up! Everytime we even made an attempt towards my building it would scream and we couldn’t find it, couldn’t see it! We had the sensation that it was behind this old 100+ year old white oak tree, but we made five attempts to go home and it was not having it. But when the sun began to rise we made our sixth attempt and then heard something just trudge up that mountain side in time that no man or woman could! I’m talking a 100 foot vertical hike that this thing scaled in seconds and just kept going until we saw trees moving at about 500 feet up. We never went that far out at night again and that was a lighted parking lot/picnic area in the middle of an apartment complex. After that I’d smoked at night at the door dealt with the whistling and Pebble tossing give it the finger and go inside. I moved to Louisville in June and never went back! I’m not afraid of the woods or anything, but I definitely will never go in them again without a 30-30 or something bigger!</p> <p>The power just in the lungs of this thing it could have killed us if it had wanted to! I ldk what we did that night; we weren’t messing up in the woods or nothing and I feel like I was being stalked for having gone up there, but over residents went up there, but not at night. I have a deeper respect, appreciation of the mountains and the woods. Since all of this the guns I have and carry with me in the woods are enough to take down a bear, but yeah, like I said I will never go in the woods unarmed again.”</p> <p><a href= \"https://sasquatchchronicles.com/wp-content/uploads/2022/10/STALKED.jpg\"> <img class=\"alignnone wp-image-215826\" src= \"https://sasquatchchronicles.com/wp-content/uploads/2022/10/STALKED-300x300.jpg\" alt=\"\" width=\"462\" height=\"462\" /></a></p> <p> </p> <p>I will also be speaking to Brian. Brian said “I was stationed at Ft. Lewis in Washington state. We were running a training exercise and we saw what we thought was someone in a ghillie suit. This made no sense since we all had the same equipment and there was not any snipers present. This “guy” was huge he was about 7 foot tall, I am 6’4. I did not know anyone in my unit that big. We decided to track it and find who is was. That is when it stood up. I thought it was 7 foot tall but it was crouched. When it stood up it was closer to 9 feet. Five of us saw it that night.”</p> <p> </p>",
  "content:encoded": "<p>John writes “January of 2017 I moved to Pikeville, Eastern Kentucky. The apartment complex I moved into was an old abandoned coal mine holler that had been converted which had an old coal road that went up a mountain and then swing around it with acre’s of woods.</p> <p>Well, whenever Id sit in the picnic area to have a cigarette id notice around 10+ at night this howling out in the nearby hills which now i can say sounded almost identical to the Ohio Sounds. I’d hear one howl and then maybe 30 seconds later there’d be another one from another hill that was maybe a mile or so away, and then I’d hear another, and another, and you could listen to these call and responses for hours without end. Well by April I was trying to get back into shape and I love to hike so I decided I’d get up around 6 am and hike up that coal road and back. As I’m hiking up and it got darker and darker up that road I noticed this strange bird whistling at me. It was strange because of how loud it was, and I mean the pitch was just so loud and I thought to myself, “that’s a big damn bird!” And I whistled back. Wes, my grandpa was a Green Beret in Vietnam who partly helped raise me, and I’ve been in the woods of Illinois and Wisconsin my whole life and never encountered much that was weird, although my Grandpa did and told me stories here and there, but I wasn’t afraid of much. Well, I’m hiking up and not only is that whistling getting closer, and I mean close to where it was like ten feet from me in the treeline of woods. I turned on the flash light on my phone and couldn’t see anything it was so dense. But then I noticed this “bird” was keeping pace with me.</p> <p>Then small pebbles started landing in front of me as I walked down. At first I thought it was just loose rock sliding down, but then it became apparent that something was tossing them right at my feet. At this point I’m about 300 feet up this old road in the pitch dark. So, I gently tossed one back, and then a big one, maybe 1/2 pound rock flung right at my feet. I froze man! Now, I gently yelled out, “is someone out there?” And that bird whistling started up even louder than it had before! Idk what overcame me, but I started belting out the St. Michael prayer in Latin and then the Hail Mary pretty audibly, and not wanting to turn back continued up that road. All of this whistling, keeping pace, and Pebble tossing just amped up as I was coming to a bend in the road that turned with the mountain. Idk what it was, but as I reach it with rosary in hand I got this bad bad feeling like something is really wrong here, and I spoke aloud and said, “idk what ya are, but im just walking here…” And the Pebble tossing got more intense and I could now hear “things” trudging through the wood at paces that I knew werent people. So I turned around and calmly began to go home. I thought that this could be bear or well hell a damn bigfoot. How loud the trudging was, combined with the whistling, and Pebble tossing I wanted to run the hell outta there down back into that holler, but if ya think that there’s an animal ya just don’t do that. And idk why, but something told me do not turn your back to them. So I’m trying to make it down while keeping an eye on what’s behind me, and the moments that I looked down the road towards the apartment complex something just leaped from the side of the mountain onto the road, and then down into a bunch of thicket. And I stopped and yelled, “what the fuck was that!” If it were a man he’d have fallen 400 feet down a vertical fall and broke his neck or something I mean it was steep! And covered in thicket and thorn bushes. And how loose the rocks were I mean if you did get a footing you’d just fall on your ass and slide and tumble down. Whatever this was got it’s footing and slid and trudged down with great volume like stomping through a huge snow drift. So there I am feeling like a fool the sun is begging to make the horizon pink up just a little at this point.</p> <p>I kept thinking to myself that this is not how I’m gonna die! By this point I felt with all of the noise that had to be five to eight things in the woods stalking me. Honest to God I knew that I was being followed and scrutinized and that I had pissed something off with my presence! The pebbles were being tossed at an alarming rate, there were by now eight or so “big birds” whistling at me from about ten or so feet in the woods, branches were snapping, and it was like multiple freight trains just trudging through those woods! This is a steep hill I mean it is steep I cannot imagine men being able to do this without falling down the only flat surface was the road. When I got about 100 feet down before the apartment idk what overcame me but something told me to just book it for the farm lamp and I ran like hell until I got to it spun around. I stood there watching and couldn’t see anything! They had stayed up there, but were still just making all sorts of noise.  Idk what I started, but after that I felt like I was being watched whenever I was outside in that holler. If I went outside my apartment by my car to smoke pebbles would start getting tossed right at my feet in the parking lot from a mountain side, or a big bird would start whistling at me. And we had huge street lights shinning onto our parking lot. And as this is happening I’d take out a big old flashlight and shine into the woods. I did get eye shine a couple of times, but couldn’t make out faces of what they were which just creeped me out to no end. I went up the mountains couple of times in the day and found what appeared to be tree breaks, a couple of structures, sticks in the road. Now idk, these sticks were just laid ever so carefully in the road. What creeped me out was that they’d appear when I was coming back down. On one hike, idk I got dizzy on the way home. Now I do have epilepsy, but this was different. I’m hiking down the road and suddenly I got dizzy, the sound in my ears was like tv static, and I wanted to take my shirt off because I felt so hot, but I laid down in the dirt ditch for a few minutes and just felt drained of everything I just thought of my mother and picked myself up and forced myself down that road. When I got home I just collapsed in bed and slept for a good six hours. Now I think looking back that that was side effects of infrasound.</p> <p>But then one night my roommate and I went out to one of the picnic areas to smoke and talk and as we’re making it back toward my building idk Wes the ground shook to the point I felt like I’d lost my footing like a giant was stomping in front of us BOOM BOOM BOOM and let out this scream I’ve never heard before or since it was like a woman mixed with a bear, a lion, and a witch all in one terrifying scream idk, but I JUMPED like three feet up and just ran up a picnic table and I could not look at it! We were stuck in that parking lot until the sun came up! Everytime we even made an attempt towards my building it would scream and we couldn’t find it, couldn’t see it! We had the sensation that it was behind this old 100+ year old white oak tree, but we made five attempts to go home and it was not having it. But when the sun began to rise we made our sixth attempt and then heard something just trudge up that mountain side in time that no man or woman could! I’m talking a 100 foot vertical hike that this thing scaled in seconds and just kept going until we saw trees moving at about 500 feet up. We never went that far out at night again and that was a lighted parking lot/picnic area in the middle of an apartment complex. After that I’d smoked at night at the door dealt with the whistling and Pebble tossing give it the finger and go inside. I moved to Louisville in June and never went back! I’m not afraid of the woods or anything, but I definitely will never go in them again without a 30-30 or something bigger!</p> <p>The power just in the lungs of this thing it could have killed us if it had wanted to! I ldk what we did that night; we weren’t messing up in the woods or nothing and I feel like I was being stalked for having gone up there, but over residents went up there, but not at night. I have a deeper respect, appreciation of the mountains and the woods. Since all of this the guns I have and carry with me in the woods are enough to take down a bear, but yeah, like I said I will never go in the woods unarmed again.”</p> <p><a href= \"https://sasquatchchronicles.com/wp-content/uploads/2022/10/STALKED.jpg\"> </a></p> <p> </p> <p>I will also be speaking to Brian. Brian said “I was stationed at Ft. Lewis in Washington state. We were running a training exercise and we saw what we thought was someone in a ghillie suit. This made no sense since we all had the same equipment and there was not any snipers present. This “guy” was huge he was about 7 foot tall, I am 6’4. I did not know anyone in my unit that big. We decided to track it and find who is was. That is when it stood up. I thought it was 7 foot tall but it was crouched. When it stood up it was closer to 9 feet. Five of us saw it that night.”</p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "59:24",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Bigfoot Encounter",
  "itunes:episodeType": "full"
}