{
  "title": "Data Engineer to Data Scientist : Career Switch",
  "link": "https://dimensionless.in/career-transition-data-engineer-data-scientist/",
  "comments": "https://dimensionless.in/career-transition-data-engineer-data-scientist/#respond",
  "dc:creator": "Pooja Sahatiya",
  "pubDate": "Mon, 13 Jan 2020 10:00:15 +0000",
  "category": [
    "Career Transitions",
    "Data Science",
    "Career Switch Data Science",
    "Career Transition",
    "data science careers",
    "data science job",
    "data science professional",
    "data science skillset",
    "Data Science Success Story",
    "future ready careers",
    "Hardware Engineer",
    "Learn Data Science and Business Analytics",
    "Machine Learning",
    "Network Engineer",
    "Research Associate"
  ],
  "guid": "https://dimensionless.in/?p=218662",
  "description": "Good course structure and in-depth teaching were 2 key factors that impressed me at Dimensionless.",
  "content:encoded": "\n<h2>Success Story: Switching from Data Engineer to Data Scientist</h2>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>I believe anyone with patience, passion and guidance can learn Data Science.</p>\n<cite>&#8211; Kranthi Bandi</cite></blockquote>\n\n\n\n<h3>Background</h3>\n\n\n\n<p><strong>Education:</strong> M. Tech Mobile and Satellite Communications</p>\n\n\n\n<table class=\"wp-block-table is-style-stripes\">\n<tbody>\n<tr>\n<td><strong>Previous Profile  >>></strong></td>\n<td><strong>Current Profile</strong></td>\n</tr>\n<tr>\n<td>Designation: <br />Profile: Data Engineer<br />Domain: Enterprise Software<br />Experience: 3 years</td>\n<td>\n<p>Designation: <br />Profile: <strong>Data Scientist</strong><br />Domain: Enterprise Software<br /><br /></p>\n</td>\n</tr>\n</tbody>\n</table>\n\n\n\n<div class=\"wp-block-spacer\" style=\"height: 32px;\" aria-hidden=\"true\"> </div>\n\n\n\n<h3>My journey into Data Science<br /><br /></h3>\n\n\n\n<h4>Why Data Science?</h4>\n\n\n\n<p>Being a Data Engineer, I always felt like I belonged to the field of Data. I could see how the tech was moving. All the businesses are becoming Data-oriented and automation is the need of the hour. Once Cloud Technology is stable, Artificial Intelligence is going to dominate the trend. During my Masters, I had Statistics as a subject and used it heavily in a project. My Masters’ thesis was with MATLAB, using concepts and fundamentals of Data Science.</p>\n<p>So, I was sure of getting into Data Science. </p>\n\n\n\n<h4>Why Dimensionless?</h4>\n\n\n\n<p>While looking for a program, the only challenge was finding a class with a well-balanced curriculum. I tried understanding the curriculum of a lot of classes, some of them had a very high-level curriculum while others were not covering any relevant knowledge. Also, I did not want to go to any well-known classes because teachers aren’t able to give personalized attention.</p>\n<p>Since this is a serious subject, the only way I could be sure about any course would be if a credible source vouched for it. A friend (an ex-student of Dimensionless) strongly recommended the Data Science course from Dimensionless. Their curriculum was balanced for anyone who wanted to start in Data Science. In fact, the first demo I attended was on Statistics. It is essential to start with Statistics and Mathematics to grasp Data Science fully.</p>\n<p>If you see the progression, going from being a Data Engineer to being Data Scientist was an obvious step forward.</p>\n\n\n\n<h4>Experience with Dimensionless?</h4>\n\n\n\n<p>Good course structure and in-depth teaching were 2 key factors that impressed me at Dimensionless. Learning Data Science takes time and effort from both the teacher and the students. We got that at Dimensionless. </p>\n<p>Also, people coming from a Data background are usually weak at programming. The teachers made it easy for us to understand and learn Python. </p>\n<p>The teachers covered a lot of ground for all the subjects and they were always available for clearing our doubts. I was satisfied with the course structure and the teaching method.</p>\n\n\n\n<h3>Career Transition to Data Science</h3>\n\n\n\n<p>Luckily, in my previous company, they were building an AI team and testing various projects. At the end of the course, I got support from Dimensionless to prepare with Mock Interviews.</p>\n<p>I applied to be a part of the AI Team at my company and got selected through a written test and interview. The exposure was immense. I got to work on multiple projects from scratch. We discussed Use Cases and projects in-depth, covering even the business aspects of it. </p>\n<p>After that, I knew I could comfortably face any Data Science or AI interview. </p>\n\n\n\n<figure class=\"wp-block-pullquote\">\n<blockquote>\n<p>Now, if anyone asks me how much time it takes to become a Data Scientist, I first ask them “How dedicated are you?”.</p>\n</blockquote>\n</figure>\n<p>&nbsp;</p>\n<p>There are many more like Kranthi who have switched to Data Science from different domains. Read their <a href=\"https://dimensionless.in/category/career-transitions/\">success stories here</a>.</p>\n<p>Want to know whether such a Career Transition is possible for you?<br /><strong>Follow this </strong><a href=\"http://dimensionless.in/\"><strong>link</strong></a>, and make it possible with <a href=\"http://dimensionless.in\">Dimensionless Techademy</a>!</p>\n\n\n\n<p>Furthermore, if you want to read more about data science, you can <strong>read our blogs </strong><a href=\"http://dimensionless.in/blog\"><strong>here</strong></a><strong>.</strong></p>\n<p>&nbsp;</p>\n\n\n",
  "wfw:commentRss": "https://dimensionless.in/career-transition-data-engineer-data-scientist/feed/",
  "slash:comments": 0
}