{
  "title": "German leader broaches human rights in China, but activists wish he went further",
  "description": "The World Uyghur Congress and other groups say Olaf  Scholz didn’t go far enough during Beijing trip.",
  "link": "https://www.rfa.org/english/news/uyghur/olaf-scholz-11042022173141.html",
  "guid": "https://www.rfa.org/english/news/uyghur/olaf-scholz-11042022173141.html",
  "author": "By Roseanne Gerin",
  "media:content": {
    "media:description": "German Chancellor Olaf Scholz meets Chinese President Xi Jinping in Beijing, China, Nov. 4, 2022.",
    "media:credit": "Pool via Reuters"
  },
  "content:encoded": "\n        <p><span style=\"font-weight: 400;\">German Chancellor Olaf Scholz briefly addressed human rights while in Beijing on Friday for a meeting with Chinese leaders, but Uyghur and other rights groups said he didn’t go far enough.</span></p>\n<p><span style=\"font-weight: 400;\">Meeting with Communist Party leader after Xi Jinping, who last month began his third five-year term in office, Scholz urged China to stand up for the international order and put pressure on Russia to end its war against Ukraine, according to a </span><a href=\"https://www.politico.eu/article/olaf-scholz-china-human-rights-g7-russia-ukraine/\" rel=\"noopener\" target=\"_blank\"><span style=\"font-weight: 400;\">report</span></a><span style=\"font-weight: 400;\"> by Politico Europe.</span></p>\n<p><span style=\"font-weight: 400;\">At a joint press conference Friday with Chinese Premier Li Keqiang, Scholz told reporters that he was concerned about China closing off sectors of its international economy to foreign competition and not respecting intellectual property, the report said.</span></p>\n<p><span style=\"font-weight: 400;\">Scholz also called on China to respect human rights, saying Beijing could not escape the international ramifications of its treatment of the Uyghurs in Xinjiang by calling it an internal matter.</span></p>\n<p><span style=\"font-weight: 400;\">“Human rights are interference in international affairs,” he said, according to Germany’s Suddeutsche Zeitung.</span></p>\n<p><span style=\"font-weight: 400;\">Later Friday, the Group of Seven foreign ministers, which includes Germany and the United States, issued a </span><a href=\"https://www.auswaertiges-amt.de/en/newsroom/news/g7-foreign-ministers-statement/2561876#:~:text=We%2C%20the%20G7%20members%2C%20strongly,was%20recklessly%20launched%20over%20Japan.\" rel=\"noopener\" target=\"_blank\"><span style=\"font-weight: 400;\">statement</span></a><span style=\"font-weight: 400;\"> in Münster, Germany, that touched on China’s human rights record. </span></p>\n<p><span style=\"font-weight: 400;\">“We will continue to raise our concerns with China on its reported human rights violations and abuses, including in Xinjiang and Tibet,” the statement said. “We reiterate our concerns over the continued erosion of Hong Kong’s rights, freedoms and autonomy, and call on China to act in accordance with its international commitments and legal obligations.”</span></p>\n<p><span style=\"font-weight: 400;\">Dolkun Isa, president of the World Uyghur Congress, expressed dismay that Scholz touched only briefly on the topic of human rights, and that his accompanying delegation included only business representatives and no human rights experts.</span></p>\n<p><span style=\"font-weight: 400;\">“It is extremely disappointing to state that the genocide of the Uyghurs is due to a different understanding of human rights,” Isa said in the statement. “Germany must now act together with its international partners to hold the Chinese government accountable.”  </span></p>\n<p><span style=\"font-weight: 400;\">The World Uyghur Congress as well as Tibet Initiative Germany, Freiheit für Hongkong e.V. and the Society for Threatened Peoples criticized Scholz’s entire trip to China, saying that reporters at the news conference were not given an opportunity to ask questions.</span></p>\n<p><span style=\"font-weight: 400;\">Earlier this week, 70 human rights organizations issued an </span><a href=\"https://www.uyghurcongress.org/en/open-letter-70-civil-society-organisations-urge-german-chancellor-scholz-to-rethink-trip-to-beijing-amidst-human-rights-concerns%ef%bf%bc/\" rel=\"noopener\" target=\"_blank\"><span style=\"font-weight: 400;\">open letter</span></a><span style=\"font-weight: 400;\"> urging Scholz to reconsider his trip to China amid growing human rights concerns. They noted that an accompanying delegation of several top German executives implied that Berlin was increasing its economic dependence on an authoritarian government at the expense of democratic principles, including upholding human rights.  </span></p>\n<p><span style=\"font-weight: 400;\">“The invitation of a German trade delegation to join your visit will be viewed as an indication that Germany is ready to deepen trade and economic links, at the cost of human rights and international law,” they wrote in the memo, published by Germany-based World Uyghur Congress. </span></p>\n<p><span style=\"font-weight: 400;\">In calling for Scholz to reconsider his visit, the groups said: “This would send the clearest signal that Germany, as one of the leading members of the European Union, will not offer its tacit endorsement to the ongoing oppression of Uyghurs, Hong Kongers, Tibetans, and other groups within and outside the PRC’s borders,” using the initials for the People’s Republic of China, the country’s formal name.</span></p>\n<p><span style=\"font-weight: 400;\">The United States and several Western parliaments have said China’s mistreatment of the Uyghurs, including mass arbitrary detentions, torture and forced labor, amounts to genocide and crimes against humanity. </span></p>\n<p><span style=\"font-weight: 400;\">A damning report issued by the U.N.’s human rights chief in late August documented widespread rights abuses in Xinjiang and said the repression “may constitute international crimes, in particular crimes against humanity.”</span></p>\n<p><span style=\"font-weight: 400;\">Later on Monday, when a reporter at a regular news conference asked Chinese Foreign Ministry spokesman Zhao Lijian if the two leaders discussed issues related to human rights and the rights of ethnic minorities in Xinjiang, he said</span> <span style=\"font-weight: 400;\">China had issued a </span><a href=\"https://www.fmprc.gov.cn/eng/zxxx_662805/202211/t20221104_10800546.html\" rel=\"noopener\" target=\"_blank\"><span style=\"font-weight: 400;\">readout</span></a><span style=\"font-weight: 400;\"> about the meeting. But the document made no mention of the Uyghurs, Xinjiang or human rights.</span></p>\n        ",
  "pubDate": "Fri, 04 Nov 2022 17:36:00 -0400"
}