{
  "title": "Bogleheads &#8211; Life After FIRE",
  "link": "https://www.madfientist.com/bogleheads-interview/",
  "comments": "https://www.madfientist.com/bogleheads-interview/#comments",
  "dc:creator": "The Mad Fientist",
  "pubDate": "Mon, 15 Nov 2021 10:00:04 +0000",
  "category": [
    "FIRE (Financial Independence / Retire Early)",
    "Interviews"
  ],
  "guid": "https://www.madfientist.com/?p=7290",
  "description": "<p class=\"lead\">I joined a virtual Bogleheads meeting to talk about life after financial independence and early retirement!</p>\n<p class=\"more-link-p\"><a class=\"btn btn-danger\" href=\"https://www.madfientist.com/bogleheads-interview/\">Read more &#8594;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/bogleheads-interview/\">Bogleheads &#8211; Life After FIRE</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "content:encoded": "\n<p>Last year, I published a podcast with one of my favorite financial writers, <a href=\"https://www.madfientist.com/morgan-housel-interview/\" target=\"_blank\" rel=\"noopener\">Morgan Housel</a>.</p>\n\n\n\n<p>You may remember that the episode was a recording of a <a href=\"https://www.bogleheads.org\" target=\"_blank\" rel=\"nofollow noopener\">Bogleheads</a> meeting and the interview was actually conducted by my buddy, Gouri.</p>\n\n\n\n<p>Well, Gouri recently invited me to join the Bogleheads to talk about life after FIRE and today&#8217;s podcast episode is a recording of that discussion!</p>\n\n\n\n<p>Big thanks to Gouri and the Bogleheads for making this happen and hope you enjoy it!</p>\n<h2>Listen Now</h2><div style='padding:20px'><audio class=\"wp-audio-shortcode\" id=\"audio-7290-4\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio/mpeg\" src=\"https://traffic.libsyn.com/secure/madfientist/bogleheads-interview.mp3?_=4\" /><a href=\"https://traffic.libsyn.com/secure/madfientist/bogleheads-interview.mp3\">https://traffic.libsyn.com/secure/madfientist/bogleheads-interview.mp3</a></audio></div><ul><li>Listen on <a href='https://open.spotify.com/show/5AjnvxZb6ZScoI6KCV0hxo' target='_blank'>Spotify</a> or <a href='https://www.madfientist.com/go/itunes/' target='_blank'>Apple Podcasts</a></li><li>Download MP3 by right-clicking <a href='https://traffic.libsyn.com/secure/madfientist/bogleheads-interview.mp3' target='_blank' rel='nofollow'>here</a></li></ul>\n\n\n\n<h2>Highlights</h2>\n\n\n\n<ul>\n<li>How your views on spending change after you retire</li>\n<li>Why you should treat FI as a spectrum rather than a finish line</li>\n<li>How to plan for all aspects of post-FI life</li>\n<li>The unexpected benefits and challenges of early retirement</li>\n</ul>\n\n\n\n<h2>Show Links</h2>\n\n\n\n<ul>\n<li><a href=\"https://www.bogleheads.org\" target=\"_blank\" rel=\"nofollow noopener\">Bogleheads.org</a></li>\n<li><a href=\"https://www.madfientist.com/album/\" target=\"_blank\" rel=\"noopener\">The Album</a></li>\n<li><a href=\"https://www.amazon.com/dp/0735211299?tag=madfientist-20&linkCode=ogi&th=1&psc=1\" target=\"_blank\" rel=\"nofollow noopener\">Atomic Habits</a></li>\n<li><a href=\"https://amzn.to/31mSdjH?tag=madfientist-20\" target=\"_blank\" rel=\"nofollow noopener\">Ultralearning</a></li>\n<li><a href=\"https://amzn.to/3qEcWja\" target=\"_blank\" rel=\"nofollow noopener\">Music Habits e-Book</a></li>\n<li><a href=\"https://www.madfientist.com/fifth-year-of-freedom/\" target=\"_blank\" rel=\"noopener\">Fifth Annual Update</a></li>\n<li><a href=\"https://www.madfientist.com/ramit-sethi-interview/\" target=\"_blank\" rel=\"noopener\">Ramit Sethi on the Financial Independence Podcast</a></li>\n<li><a href=\"https://amzn.to/3wKpaYB\" target=\"_blank\" rel=\"nofollow noopener\">How I Found Freedom in an Unfree World</a></li>\n<li><a href=\"https://amzn.to/3bgB432\" target=\"_blank\" rel=\"nofollow noopener\">Early Retirement Extreme</a></li>\n<li><a href=\"https://www.madfientist.com/spouse-early-retirement/\" target=\"_blank\" rel=\"noopener\">My Wife&#8217;s Guest Post</a></li>\n<li><a href=\"https://www.madfientist.com/sane-fientist-interview/\" target=\"_blank\" rel=\"noopener\">My Wife&#8217;s Podcast Interview</a></li>\n</ul>\n\n\n\n<h2>Full Transcript</h2>\n<div class=\"transcript\">\n<strong>Mad Fientist:</strong> Hey, what&#8217;s up, everybody. Welcome to the Financial Independence Podcast, the podcast that gets inside the brains of some of the best and brightest in personal finance to find out how they achieved financial independence. You may remember last year, I had an episode with Morgan Housel, and Morgan&#8217;s one of my favorite financial writers, and it was a great episode.<br/><br/>And you may remember that I actually didn&#8217;t do the interview. It was my buddy Gouri who interviewed Morgan as part of a Bogleheads meeting. And Gouri&#8217;s big is big in the Bogleheads. And he actually invited me to join that same sort of discussion for the Bogleheads group that he was running. So that&#8217;s what today&#8217;s episode is.<br/><br/>And if you don&#8217;t know who the Bogleheads are, they&#8217;re a group that are dedicated to Jack Bogle, the founder of Vanguard. All the index fund investing and everything that talked about on the Mad Fientist, that&#8217;s a group that really goes in depth in that philosophy of investing. So they have a fantastic and very active forum.<br/><br/>They have these local meetups that, you know, Gouri is part of and it&#8217;s a really great organization all around. So if you&#8217;re interested, definitely head over to bogleheads.org to check it out. And obviously I&#8217;ll put links to that in the show notes. So I sat down with Gouri and a bunch of other Bogleheads on a zoom call and we had a great chat for a couple hours.<br/><br/>What you&#8217;re going to hear today is the interview portion of that. And the interview is fantastic because as always Gouri did a ton of research beforehand and asked great questions. So without further ado, this is my chat with Gouri for the Bogleheads. <br/><br/><strong>Gouri:</strong> We&#8217;ll begin with something that you often end with on your podcasts, which is you ask your guests who, you know, are leaders in the FI space, or often the self-improvement space.<br/><br/>You ask them what&#8217;s one piece of financial advice you would give towards financial independence. So I asked you that question. <br/><br/><strong>Mad Fientist:</strong> Yeah, that&#8217;s a question I love to ask because there&#8217;s so many different answers I&#8217;ve gotten over the years, but for me, I would say experiment, which, you know, in the Mad Fientist, I probably wouldn&#8217;t have said that when I started the Mad Fientist.<br/><br/>So it&#8217;s not me just saying that because it fits with my science theme or anything. But it&#8217;s really the truth because if I&#8217;ve learned anything over the past 10 years of doing this and like really thinking about it hard, it&#8217;s that we&#8217;re really bad at knowing what we really, really want. And the only way to find out is to try things, hopefully them at a low cost, low commitment sort of situation so that you don&#8217;t, you know, get yourself into a situation where you can&#8217;t reverse that choice. But it&#8217;s really about experimenting because especially like for me I&#8217;m naturally frugal guy. Spending has been a big focus of mine recently.<br/><br/>And you know, after post-FI to figure out like, what is the best use of money? And now that it&#8217;s not as tight anymore you know what, what&#8217;s actually going to make me happier and what&#8217;s not really going to move the needle and things like that. So, yeah, experimenting and just realizing that you don&#8217;t have to be right, right away, because you are probably pretty bad at actually figuring out what you really want to do or what you want to be here, what you want to spend your money on.<br/><br/><strong>Gouri:</strong> Excellent. Yeah, it&#8217;s so great to hear. And there&#8217;s so much there that I&#8217;d like for us to follow up on. One is when, you know, you say experiment, try it out there. There are tons of people that we hear about who, whether they&#8217;re planning for financial independence, early retirement, or just retirement in general, they dream about this next phase of life.<br/><br/>They plan, they plan the savings part of it, but then when they get there, they&#8217;re kind of absent the social structure or interaction or meaning. How do you, how do you suggest people, you know, building on what you said about experimenting? How do you suggest people fill that void in advance? <br/><br/><strong>Mad Fientist:</strong> So like, I&#8217;m sure a lot of people out there are probably similar to what I was, where I blamed my job for the reason I wasn&#8217;t living the life that I thought would make me happiest and wasn&#8217;t doing the things that I thought I really wanted to do with my life. Like it was such an easy scapegoat and only after leaving the job and then trying to do all those things that I thought I wanted to do, I realized it wasn&#8217;t my job holding me back. I was very lucky. I was a software developer and the technologies I used allowed me to be very productive, very quickly so I could get my work done in, you know, a quarter of the time that some other teams that I worked amongst were able to do it. So my time scales were never tight and I had plenty of free time. So it was only once that I removed that easy scapegoat did I realize that actually I could have been doing all of these things with the job and, you know, I would have been not had to also try to figure out all these crazy post-FI things that come up that you never even expect because I would have still been working.<br/><br/>So, yeah, I would say one just try to remove the easy scapegoat of your job and start trying to do these things that you really think you&#8217;re going to do post-FI, because one, some things aren&#8217;t big enough to really get you out of the bed in the morning. Like I remember I thought like, oh, I&#8217;ll learn a new language and then that way, when we traveled to wherever in the world, I&#8217;ll be able to know this new language&#8230;it&#8217;s going to be amazing, but you know, like when you don&#8217;t have anyone forcing you to get out of bed in the morning to conjugate verbs it&#8217;s hard, it&#8217;s hard to, to force yourself to do that. And you&#8217;re not exactly leaping out of bed to do that either.<br/><br/>So the more you can get started on these things while you&#8217;re still in the grind, the daily grind, I think. The way better off, you&#8217;re going to be, because one, you&#8217;re going to have momentum. You&#8217;re going to sorta like come across these challenges that have nothing to do with your job earlier and start to work through them and realize, hey, actually, it&#8217;s not my job that&#8217;s holding me back. It&#8217;s for me, like personally, it was my self doubts and some of the artistic things I wanted to do. And yeah, if you, if you just start early and don&#8217;t think of like, I think the other problem is like, it&#8217;s like for me back then, it was a finish line. Everything was going to be great after that finish line and everything wasn&#8217;t working prior to that finish line.<br/><br/>And I think that was definitely the wrong way to do it. I think the more you can view it as just a spectrum where every dollar you&#8217;re saving is adding to that power that you have to, you know, to take more time off or follow that passion project to another level and things like that, I think the better off you&#8217;ll be, and then the less crazy FIRE or post-FI life would be after, because it&#8217;s not going to be just like flipping a switch. It&#8217;s just going to be this gradual progression into, oh, actually now I have the power to have unlimited free time. And now I know how to deal with that and use it properly because I&#8217;ve practiced along the way as I&#8217;ve incrementally got more free time.<br/><br/>So that&#8217;s, that&#8217;s how I would view it just as a spectrum, not as a goal line. <br/><br/><strong>Gouri:</strong> Excellent. Yeah, that makes a lot of sense. It reminds me of someone interviewed Michael Phelps and in, I think one of the Olympic runs, his goggles failed and water got in his eyes and he had to do the whole thing with eyes closed.<br/><br/>And they interviewed him after and said, how was he able to perform at such a high level? And he said he did that in his head. Over and over again. So it reminds me of how you&#8217;re saying prepare. So I&#8217;m following up on a few of the things you mentioned. So you mentioned passion project. I think your followers will know that you pursued FI to record and release your own music and you were able to do that.<br/><br/>So huge, congrats again there. And you know, I know. You&#8217;re modest. So I&#8217;ll let folks know that the release went really well and had success on the charts. Why don&#8217;t you tell us a bit more about that, how it was to pursue this lifelong goal and, you know, how&#8217;s it been since? <br/><br/><strong>Mad Fientist:</strong> Yeah. So you mentioned the charts and I&#8217;d love that to be because the music was so amazing and it just got played on radio everywhere.<br/><br/>Actually, it was just the Mad Fientist audience had grown so big over 10 years and I&#8217;d never asked them to do anything. And I asked them to buy the album and, and thousands of them did. And yeah, it was ridiculous. A ridiculous one week on the charts. And then it was done. But yeah, that wasn&#8217;t the main goal.<br/><br/>That was again, like I&#8217;ve, I&#8217;ve mentioned a bit earlier. I blame my job for holding me back on that for so long. But it was only once I quit my job and had all the time in the world to pursue it, that I realized it was way more than that. It was, it was really just a ton of self doubt. I never thought I could actually do it.<br/><br/>So I was not even trying to do it because I thought if I tried and then failed, I&#8217;d lose the dream forever. And I never wanted to do that. Cause I was like, I really need to write and release an album one day. So I didn&#8217;t want to lose the dream, but trying every time I tried it just made it so much more evident that I would never actually be able to do it.<br/><br/>So that&#8217;s why I just put off doing it. So I never made progress and it took me till three and a half years after I left my job before, you know, I&#8217;ve I finally got fed up and I was like, look, this is the whole reason I was wanting to have all this free time. And in the first years after leaving my job, I filled it with, you know, Mad Fientist stuff. I filled it with fun stuff. I was saying yes to everything. Cause I could have all this time. And I was like, I need to just really get serious about this. And it was brutal. But it was actually Atomic Habits by James Clear&#8230;I read his book, got to speak to him on my podcast, which was amazing. And it was that coupled with another book called Ultralearning.<br/><br/>And then there was a music specific one that was just an ebook, but it was actually phenomenal. So if any musicians out there care, Gouri, I&#8217;ll send you a link to that. Cause it&#8217;s not a very big book, but it was it was very instrumental in me actually making progress. At the end of the day, just boiled down to like putting in the time.<br/><br/>So sitting in the chair and being uncomfortable and just forcing yourself to do that and trying to not focus on what you produce by the end of that day, just focusing on okay&#8230;put five hours into the chair and it was all mostly productive. You know, like I would lose confidence, I would lose willpower and by the end of the day, I was like watching YouTube tutorials, which, you know, it was not really productive, but I could sort of make it seem productive for my five hours at least. So anyway, it took all of that and then the pandemic hit and, and then I just locked myself inside for 15 months. Scotland was very locked down.<br/><br/>My wife&#8217;s Scottish and we lived in Edinburgh, or we did at that time, and just locked myself inside and never truly believed that I would do it. And until it came out. I still don&#8217;t really believe it, but I listened to it and I&#8217;m like I&#8217;m really proud of it. It was definitely, yeah, the most challenging thing I&#8217;ve ever tried to do.<br/><br/>And it meant so much to me. So yeah, you&#8217;ll listen to it. It&#8217;s not like Grammy award-winning stuff. It&#8217;s like my weird it&#8217;s like synthesizer like experimental synth-pop stuff that I loved growing up. So it&#8217;s a really weird genre of music, but it&#8217;s yeah. My only goal line was that I was comfortable enough with it to release it.<br/><br/>And I did. So that it&#8217;s that was the whole reason I wanted to pursue FIRE in the first place. And like I said before, I didn&#8217;t actually need to be FI to do it, but I sorta did as well, because that took away all my excuses. <br/><br/><strong>Gouri:</strong> Well, congrats again on achieving that it&#8217;s tremendous and I&#8217;m not a typically a synth pop listener, but absolutely enjoyed your music.<br/><br/>So thanks again for getting it out there. So a few things, one is a lot of folks in the FI space. You know, will talk about, of course, saving and investing and reducing your living expenses and increasing your savings rate. And I think folks, you know, interest in pursuing it, having a lot of access to that information more common underlying message that surfaces is a lot of this is about happiness, right?<br/><br/>So. Can you, can you elaborate on what happiness is, you know, like for you or what success means to you and for this audience, the Bogleheads famously are not defined by a fancy house or fancy car, even though many of them could easily afford that sometimes many times over. So yeah. What does, what does success mean to you and, and how, how has it been in early retirement?<br/><br/><strong>Mad Fientist:</strong> Yeah, well, so success is to me, those personal wins, like I can think back over the last 10 years and the things I&#8217;m most proud of or things that, you know, I haven&#8217;t shouted about or told anybody about really. And it&#8217;s just those, like knowing how hard I worked on that album and all of the hurdles that I had to overcome.<br/><br/>Like, that&#8217;s what I&#8217;m super proud of and yeah. Getting on the billboard charts for a week, is funny, and just adds to the ridiculousness of my life in a great way. Like, it&#8217;s, it&#8217;s so funny to think about every time I think about it, but that, that was, that&#8217;s nothing that it&#8217;s thinking back at all those things that I had to overcome.<br/><br/>And yeah, happiness is a tricky one because I had a great comment on my last post and. It was sort of talking about happiness and like finding new sources of motivation after FI. Because for people like me, if you think about money since I was a, you know, a kid&#8230;my parents were throwing quarters in the deep end of the pool and I would spend all day like finding money and I just loved it.<br/><br/>So for somebody is where money has been so important for so long&#8230;for now that to not matter anymore. Cause I don&#8217;t want the fancy house or the fancy cars or I don&#8217;t want to waste money in any way and things like that. So that&#8217;s been, that&#8217;s been really interesting to try to come to grips with that and find new sources of motivation because now I don&#8217;t have to do anything.<br/><br/>And as I said, in my most recent posts, it&#8217;s like a lot of the really fun things have a lot of discomfort upfront. But now that I don&#8217;t have&#8230;I don&#8217;t have money driving me through that initial discomfort, I worry that I&#8217;m missing out on some, like longer-term fun in some areas just because, you know, I&#8217;m like, well, I don&#8217;t want to do that. I don&#8217;t have to do that because I don&#8217;t need to earn another dollar or whatever. So, so yeah, happiness is a tricky one. And in that, so this goes back to the comment I was going to mention. So it was, I thought was really insightful. The guy had said, I think as humans, we always need something to be uncomfortable with or unhappy about or striving for something better. And he brought up the fact that like, you know, there&#8217;s a lot of, maybe I&#8217;m not too big in the the rest of the FI community anymore, just cause I&#8217;ve been working on the music stuff, but apparently in the FI community, there&#8217;s lots of divorces happening and things and people reach FI and then, you know, they need that unhappiness. So they find it in their partner or things like that. And I can see how that I could see how that happens. Cause you, you know, I could, I could throw everything at my job and be like, that&#8217;s why my boss is making me mad and my colleagues are making me mad and that&#8217;s why I&#8217;m unhappy.<br/><br/>But then when you, when you can control everything and do whatever you want. Then you either have to come to accept that. Oh, it&#8217;s just you, that&#8217;s finding those things to be unhappy about or angry about or. You know, sometimes the, sadly maybe put it on the person closest to you or the people around you.<br/><br/>So, yeah. So it&#8217;s still one that I haven&#8217;t figured out yet. And I&#8217;m like, that&#8217;s not to say, like, I feel so lucky and I&#8217;m definitely happier now having been able to pursue all these things that I&#8217;ve always wanted to, and, you know, not have the stresses of money or worrying about, you know, if the markets are tanking or anything like that.<br/><br/>But yeah, it&#8217;s not a golden ticket to a happiness and rainbows, which I think early me when I was pursuing it, I put that on, on FIRE. I was like, well, yeah, I&#8217;ll be happy when I&#8217;m FI. So I&#8217;ll just be miserable now and just grind it out. And again, going back to the advice that I was given earlier is like, yeah, don&#8217;t put off happiness until the finish line either.<br/><br/>Don&#8217;t put off, you know, pursuing your things that you want to do. Don&#8217;t put off, you think you&#8217;re thinking about what post-FI, life&#8217;s going to look like, because yeah when you cross the finish line, that&#8217;s just at the end of the day a slightly higher number on a screen. And it really maybe it was more anticlimactic than you may expect it to be.<br/><br/><strong>Gouri:</strong> Got it. Yeah. Very insightful stuff. So two, two particular things. So let&#8217;s say a two-part question one building on your comments. One is this concept of enough, right? You and I know people in the FI space in life in general, who had earned a lot, can still learn a lot and really. Adjusted this mindset to just say, you know, any additional money has very little marginal value.<br/><br/>Why, am I needing to work or seeking work? But there are also people who either enjoy what they do, maybe they&#8217;re entrepreneurs, or some people are paid really well dislike the rat race. But enjoy accumulating, enjoy watching their portfolios grow and you know, within the FI community, there&#8217;s this one more year syndrome, right?<br/><br/>People don&#8217;t feel comfortable. Can you elaborate on how you achieve this? I&#8217;ll call it a zen-like state of you have enough. Right. We know someone who, who says any additional money he gets, he gives to charity. And I just feel like. That&#8217;s such an enlightened state, right? Like we&#8217;re socialized, like apart from societal&#8217;s influence on the importance of money, there&#8217;s a practical importance.<br/><br/>So that&#8217;s one. And then the second you spoke about relationships and specifically in the FI community, can you elaborate on yours to the extent you&#8217;re comfortable, what it&#8217;s like being, because you mentioned publicly, Jill still works. She loves what she does. You guys converged in this journey and what has that been like to be&#8230;and I&#8217;ll talk about like gender roles or societal pressures or influences to be the spouse who&#8217;s not working and to be a guy, you know, not working and in our society. <br/><br/><strong>Mad Fientist:</strong> Oh yeah. Ireally don&#8217;t feel like I&#8217;ve reached a Zen like state sadly, but I&#8217;m working towards it.<br/><br/>Like I think the big thing for me was never feeling I needed to impress anyone with money. And I think that just gives you such a huge advantage where like I would rather people think I was poorer than I am, because I just had a, you know, a middle-class upbringing, like like times are always tight. And I, my identity is so tied to that.<br/><br/>So to then either go into the next societal bracket you know, upper class or something would just be a total identity&#8230;I don&#8217;t think my brain could handle it. So I&#8217;m always, so I&#8217;m lucky in that sense where I&#8217;ve never felt the need to impress people with, with flashy, anything. I wouldn&#8217;t say I&#8217;m Zen yet because because you mentioned charity, like I still can&#8217;t give money away.<br/><br/>I&#8217;m not wasting it and that&#8217;s why I have such trouble spending it because I don&#8217;t want to waste it. And I know one day, I&#8217;m going to be at that stage where I can make better use of it. So in this meantime where I still have this psychological hangup. Yeah. I just I&#8217;m protecting it so that I don&#8217;t waste it away and have some sort of lifestyle inflation that caused me to not to be able to give it away.<br/><br/>But there&#8217;s still a part of me that I guess just has this scarcity mindset like, oh, like I gotta keep it all just in case something really bad happens or. I don&#8217;t know where that comes from. Like I said, maybe it was because times were so tight growing up and I never felt like we were deprived of anything, but, you know, there was, you know, every penny was accounted for and I still feel that in my mindset hasn&#8217;t caught up with the actual situation yet.<br/><br/>So, yeah. So a long way to go in the zen part. To get to the spouse part. Yes. My wife was complete opposite end of the spectrum from me. She wasn&#8217;t, she never spent money to like impress other people. So I don&#8217;t think it was like that far, but she never, she just didn&#8217;t care about money. If it was in her account, she would spend it. And if it wasn&#8217;t you, she wouldn&#8217;t. Whereas I was like, you know, spreadsheets for everything and go into, you know, knowing what I bought at this store versus the store and all that stuff. So yeah, thankfully we&#8217;ve come together and she&#8217;s a lot more conscious of spending money and I&#8217;m not as crazy about it, which has worked out great.<br/><br/>And as you said, she&#8217;s, she loves her job. She&#8217;s an optometrist. She can&#8217;t think of anything else you&#8217;d want to do, but she&#8217;s also. Seeing the benefits of having savings. So to go to COVID at the beginning of the pandemic in Scotland. People weren&#8217;t taking it as seriously as we felt needed to be, you know, things needed to be taken care of.<br/><br/>So she was able to just say, look, I&#8217;m not, I&#8217;m just not coming in. And then she, she was off for the first three or four months of the pandemic because she was worried about giving us her elderly patients. And she didn&#8217;t think the PPE was all in the right state. And then once that came back, she was able to go back.<br/><br/>And then for the past, like six months, we&#8217;ve been traveling to the States since we were finally able to, and we&#8217;ve been able to see friends and family. So she&#8217;s obviously not worked that time. So she&#8217;s seen the benefits of that. And obviously I&#8217;ve seen the benefits of not being so crazy with money.<br/><br/>So, thankfully we have met in the middle and I think we both made each other better with our relationships with money. But as far as her working in me, not, like this is going to sound crazy. Cause you know, I&#8217;ve been writing about financial independence on the internet since 2012, but I really don&#8217;t like talking about to people I know in real life. So I still will just say I&#8217;m a software developer that works from home, which is technically true because I write software for the Mad Fientist website. But yeah, I feel really weird talking about that in person. So yeah, I&#8217;m at home, but I was at home before, before we provided me the hit FI and again, I don&#8217;t think, I don&#8217;t think it bothers me that even if, even if that wasn&#8217;t the case and that was, if all of our friends that I was just unemployed and she was working yeah, I don&#8217;t know how I would feel about that. I don&#8217;t think I, I would hope I wouldn&#8217;t care that much. Because again, like the things that drive me are the personal things that I accomplished that, you know, I still don&#8217;t, I don&#8217;t tell anybody anybody about anyway. So I think I had hoped that I would be okay with that. But, you know, like I said, it&#8217;s harder to, reality&#8217;s often way different than you imagined it would be. So, yeah, but so far I haven&#8217;t had any issue because again, I just mostly tell people I&#8217;m a I work from home for myself as a software developer.<br/><br/><strong>Gouri:</strong> Excellent. Great to hear within the, you know, the actual FI experience, if you could talk more about the highs and lows of it. So what surprised you were you blindsided by anything? Were there some disappointing surprises and then some like phenomenal surprises you didn&#8217;t even consider? <br/><br/><strong>Mad Fientist:</strong> Yeah. One is losing money as a source of motivation.<br/><br/>That wasn&#8217;t what I expected. I always thought. Yeah. I always, always thought, wow, just, yeah, just do fun stuff with it. But as part of that experimentation, I told you about earlier, like we experimented one year and we traveled the whole year and we ate out like four or five nights a week. And we tried all that stuff and realized like, it&#8217;s actually way more fun when it&#8217;s special and you get to look forward to it over a few months and you plan for it.<br/><br/>And same with eating out. It&#8217;s like, well, if it&#8217;s a Friday night thing, then you&#8217;re looking forward to Friday nights. So we&#8217;ve tried a lot of that stuff. So, so I thought, you know, so I guess pre-FI, would&#8217;ve thought that, you know, Ooh, if we had extra money, this is going to be great. We could go do even more fun stuff.<br/><br/>But through experimentation, I feel like we&#8217;ve got the, got the sweet spot and more&#8217;s not necessarily better in a lot of cases. It&#8217;s worse. So, so that was a big surprise. And that&#8217;s, you know, that&#8217;s still something that I&#8217;m trying to come to grips with. And I don&#8217;t only, I haven&#8217;t even talked to you about this story, but like I realized now that my cheapness was the only thing, keeping my eating and check when we&#8217;re traveling.<br/><br/>So like when we go somewhere, like sightseeing is just the stuff I do in between eating and drinking and tasting all the foods and trying all the different stuff. And on these, on these past trips ever since we&#8217;ve been able to travel since COVID. I&#8217;ve just gone crazy. And I realized that the only thing that was keeping that in check was my frugality and my cheapness.<br/><br/>And now that that&#8217;s not there, it&#8217;s like, well, I need it. I need some self control, I guess, when it comes to food. So yeah, it&#8217;s, it&#8217;s things like that you don&#8217;t really think about. So that was a surprise. I think the, just the peace of mind has been fantastic. Like I still, like I said, I, I still feel like a teenager.<br/><br/>So like the thought of like my car breaking down. Still gives me some stress and anxiety, but you know, having enough and then having more than enough as sort of eased that and been like, okay, we can handle, you know, the car breaking or an unexpected repair and things like that, that I think has really drastically improved my just like baseline, at ease-ness, I guess.<br/><br/>So that&#8217;s been fantastic. Those are the big ones. And then, yeah, just realizing that all your excuses before. All the blame I was placing on my job was just totally misplaced and it was more, it was all the internal stuff and stuff that I still had to deal with. Yeah, just the self-doubts and the motivation and the procrastination, all that stuff.<br/><br/>Yeah, it wasn&#8217;t my job. So those are the big ones. <br/><br/><strong>Gouri:</strong> Got it. So thanks for sharing, especially, you know, some of these vulnerable topics, like. You know what you&#8217;re opening up about a lot of it&#8217;s personal. So some of the things I think it&#8217;s funny, you know, to hear your comments about Ramit for a lot of folks in the space you know, there are diehard mustachians folks who read Mr. Money Mustache, and whose blog changed their lives. And then Ramit, you know, I would joke to myself, I really value his content as well. But in my head, I think of him as somewhat of an anti Mustacian. So I understand that, you know, you felt liberated to some extent I&#8217;d love to hear more about what you&#8217;ve grown to enjoy spending on.<br/><br/>You mentioned food, and then I&#8217;d also love to hear about the evolution of travel. Like it sounds like. You know, we all want to travel. It&#8217;s a very common primary goal. And then some people travel a lot. So when it sounds like your, your ambition for travel has kind of perhaps changed. So I&#8217;d love to hear more about that.<br/><br/>And then on the topic of travel and living abroad, how did, how has being financially independent living abroad? How did, how do you feel that would differ from living in the States? Like a lot of people in the FI space consider moving abroad and they try to optimize, you know, where they&#8217;re going to live either travel around or settle.<br/><br/>So your thoughts on those? <br/><br/><strong>Mad Fientist:</strong> Yeah, sure. Yeah. I&#8217;ll address the anti-Mustacian Ramit, which I, I thought too. And that&#8217;s why I was so excited to get them on my show because I was like, yeah. You are, you are opposite ends of the spectrum. I think they say a lot of the same things and just different ways, but I think having both in your ears is great and that&#8217;s I was lucky to talk to both of them and that&#8217;s, and again, I I&#8217;m going to be going back to Ramit because I feel like I&#8217;m naturally like Mr. Money Mustache. Like that&#8217;s, that&#8217;s my natural inclination, I guess. So having Ramit there challenging all that stuff&#8230;listening to MMM is like an echo chamber. But Ramit, challenges me in as far as some of the stuff that has helped me not be so crazy with the spending, it was reframing things.<br/><br/>So one of the things that&#8217;s helped is like, $10 to me is just as valuable as it was when I was a college student. In my mind, it&#8217;s the same. It&#8217;s like that&#8217;s 10 bucks. I&#8217;m not going to waste 10 bucks or I&#8217;m going to save 10 bucks if I can. So the trick that I&#8217;ve been doing recently is anytime I&#8217;m like freaking out about an expense that I think I really shouldn&#8217;t be freaking out about.<br/><br/>I calculate what that expense is like in my college years. Cause that&#8217;s what, that&#8217;s where my brain, I feels like still is with money. So, you know, taking my net worth back in 2000 and dividing it by my net worth now. And then multiplying it by the expense that I&#8217;m worried about. And then it&#8217;ll be like, oh, that&#8217;s a nickel.<br/><br/>You&#8217;re actually stressing out about a nickel in, you know, college times. So that&#8217;s been helpful.<br/><br/>And then forcing myself to spend with the portfolio is it should allow me to spend, has been really nice because it&#8217;s. It&#8217;s made me a lot more generous, which is something I&#8217;ve always wanted to be.<br/><br/>But I always was, like I said before, I&#8217;m always like, oh, every penny&#8230;I need to squeeze it tight in case anything happens. Whereas now, this year, it&#8217;s like, you know, going out to dinner with my family, it&#8217;s like, hurry up and try to pay before anybody else even has a chance and same with drinks with friends and things like that.<br/><br/>So that&#8217;s been really nice because well, I got to spend it this year. I&#8217;m forcing myself to spend that much and there&#8217;s no way I&#8217;m going to do that naturally, because like I said, I feel like we&#8217;ve dialed in our spending quite well. So anything more is just going to be, you know maybe not as, maybe not as useful or not bring as much happiness.<br/><br/>So it&#8217;s like, so then yeah, doing those things day to day has been really nice. Just. Before I would have maybe stressed about that. Like you got to dinner with friends and like somebody orders the fancy cocktail and your drink of water. And then you&#8217;re like, oh, and that&#8217;s like, that&#8217;s the mindset. I wasn&#8217;t when I was a student, I want to get out of that.<br/><br/>And now the times have changed forcing myself to spend that this year. And again, it&#8217;s not, I&#8217;m not wasting any money. Cause like I said, I don&#8217;t want to waste money. I want to protect it in case one day I definitely will be giving it away. And the third thing that&#8217;s helped with that is also.<br/><br/>Allowing myself to enjoy investments. So rather than just dump all my money into Vanguard index funds, which is what I&#8217;ve done for the last 20 years instead, it&#8217;s, I&#8217;m thinking about buying a house, for example. So to me that&#8217;s an ultimate luxury. It&#8217;s not really a great investment, but I think it&#8217;s a luxury that I&#8217;m really looking forward to right now.<br/><br/>And my wife is as well. So, in my mind, as I think about it as an investment, rather than me spending on myself, which that makes it a lot easier to, to, you know, accept. And so I think that&#8217;s something we&#8217;re going to do over the next few months is buy a house in Scotland and hopefully, you know, make it really comfortable and nice and all of that.<br/><br/>And then, and then for the music stuff, it&#8217;s like, instead of buying the cheapest synthesizer, that&#8217;ll let me make the sound. I buy the one that&#8217;s going to hold its value the best. And it&#8217;s going to maybe be a future classic that is going to maybe even go up in value. So that&#8217;s helping me spend a bit more in the near term, but then hopefully getting a lot of enjoyment out of it.<br/><br/>And then, you know, maybe even, you know, making it an investment where if, if not making money, at least not losing money and that&#8217;s been, that&#8217;s been helpful. And, and, you know, mentally being able to spend on myself a little bit more. And I&#8217;m sorry, but I forgot the second question?<br/><br/><strong>Gouri:</strong> question. Living abroad versus being FI in the States.<br/><br/><strong>Mad Fientist:</strong> Yeah. Well, luckily, so that was one thing I never skimped on when we were in our twenties and I&#8217;m thankful for that. We did travel. I was really good at travel hacking and that&#8217;s like, I love doing stuff like that. That&#8217;s like having spreadsheets and plans and that&#8217;s, that&#8217;s like how my brain loves to be all the time.<br/><br/>So travel hacking was just right in my wheelhouse. So we got to, we visited, I think, 50 countries over our lifetime so far, and we had great, great trips and it didn&#8217;t break the bank. But obviously, yeah, especially since now, COVID has made travel a bit less fun where I&#8217;m so glad I didn&#8217;t skimp on that when we were younger.<br/><br/>But now I don&#8217;t know if it&#8217;s because I&#8217;m older, I&#8217;m turning 40 this year. I don&#8217;t know&#8230;.I feel like I&#8217;ve done my fair share. Like I&#8217;ve got that out of my system. I feel like it&#8217;s out of my system and now we just flip flop back between Scotland and America. Cause my wife&#8217;s family is in Scotland and my family&#8217;s in America and luckily those are two great, beautiful rich places that have so much to offer that you can, you know, continue to explore for a lifetime and not get bored with them. So we&#8217;re always so excited to do that, but now I think our travels more based around people. So it&#8217;s not all right, which, which country could we go to to see these things or eat these foods or whatever it&#8217;s now like, where to go to see these people and have fun with them. So that&#8217;s been a huge shift. So I think travel is going to decrease for us in the future as well. It&#8217;s just going to be mainly just bouncing between those two places.<br/><br/>As far as like how that impacts FI, I know travel in my twenties was very impactful and showing me that, you know, what I thought was normal in America was actually extremely extravagant and there&#8217;s a lot of really unfortunate situations out there where people are really struggling to get by. And that allowed me to keep my spending in check, I think, and never, you know, feel like I deserved nicer things or anything like that. So that was huge in just giving me the mindset to save so much money over those years.<br/><br/>You know now I just became a British citizen on July 1st, which was really exciting after so long, so many applications trying to get it. So now we don&#8217;t have to worry about visas and stuff, but obviously the healthcare thing, that&#8217;s a huge weight off my chest now&#8230;the National Health Service is fantastic in Scotland.<br/><br/>So there are benefits in places, you know, it&#8217;s probably more difficult to pursue FI there just because of the higher taxes and things like that and there&#8217;s less loopholes, which is what my whole site was built on back in the earlier days&#8230;just finding interesting loopholes for early retirees or future early retirees.<br/><br/>So there&#8217;s a lot less of that, but then there&#8217;s a bigger social safety net. So, you know, you have a lot more stuff covered as well. So. Yeah. I don&#8217;t know if that exactly answers your question, but hopefully it&#8217;s helpful.<br/><br/><strong>Gouri:</strong> Yeah, that was very helpful. Thanks. So a few things in what you said, one is that you&#8217;re considering buying a house.<br/><br/>I&#8217;m certain that the Boglehead audience would like to hear more about, especially given how analytical you are and how, you know, you commented, it&#8217;s not necessarily a good investment or it&#8217;s often not a good investment, but also if you could talk about, on top of that, share your thoughts previously, you mentioned you were considering buying real estate as a part-time investment. So you mentioned, you know like a unit near a ski resort that you could, you could use personally when you in ski season and then you could rent it out when you&#8217;re not using it, and then COVID happened. So obviously that changed, but how are your, your thoughts going forward on that?<br/><br/>Does it still interest you? And then can you elaborate on your purchase analysis and how you decide where are you currently leaning? <br/><br/><strong>Mad Fientist:</strong> Sure. So that plan is pretty much out the window. And again, that&#8217;s always me coming back to my default, which is like, how could I optimize this for the numbers as perfectly as possible?<br/><br/>And that, that whole plan of having two places, one in Scotland, one in America, and the thought was that we buy in places that the peak tourist season was pretty much opposite. So we could live in the non-high-peak tourist place while we rent out the peak tourist place and then use that money to pay for the other one and then vice versa.<br/><br/>And it was all a numbers thing and that&#8217;s, again, it&#8217;s just old habits die hard. I&#8217;m trying to get out of making numbers-only decisions, which is where Ramit comes in, where he&#8217;s like, there&#8217;s more than a spreadsheets and you have to live outside the spreadsheet. <br/><br/>And you know, sometimes decisions should be more than just optimizing numbers. So I realized like all the stress that could come from renting things out and at least I know myself well enough to know that that would just cause a huge amount of stress. Cause yeah, I&#8217;m an introverted guy and I do enjoy interacting with people, but conflict with people that I just know that if I&#8217;m a landlord, I&#8217;m not going to be too happy. And I&#8217;ll probably be a lot more stressed, so it would just add a lot of negative things and yeah, the numbers may be great, but I don&#8217;t think would actually benefit. So now the idea is to just buy a base in Scotland finally get to enjoy some of our stuff that has been&#8230;we just literally today, Jill and I were in the closet at my dad&#8217;s house going through the closet because there&#8217;s boxes in there that we haven&#8217;t seen since we moved out of Vermont, like six years ago or something. So yeah. Being reunited with all that stuff is going to be nice.<br/><br/>And then we can just store it all in Scotland. And then when we come to the State, if we want to go skiing, we can just rent an Airbnb. Or if we want to come to Pittsburgh and see all of my family here, we can just rent a apartment in the city.  I think it&#8217;ll allow us to be a lot more flexible in the States.<br/><br/>And then in Scotland, we&#8217;ll have a home base to go back to. The idea is, Scotland will be the place where we can get stuff done and see Jill&#8217;s family and just really spend time with them and Jill can work if she wants to pick up some shifts and things like that.<br/><br/>And then the States, we can just use that time to see people here and have fun and do things like skiing and visiting friends. So yeah, it&#8217;s changed quite a lot. <br/><br/>And then as far as the the analysis for buying a place in Scotland, not really looking at it numbers based, trying not to at least.  <br/><br/>We know where we want to be.  We know that the type of property we want.  Thankfully it hasn&#8217;t popped up yet because we&#8217;re in the States and we&#8217;re not going to be back in Scotland till mid-October. So hopefully we can deal with that when we get back. But yeah, I think it&#8217;s hopefully just going to be the property that decides it and not any crazy number analysis from me.<br/><br/>I have some money set aside for that. And yeah, hopefully we just find a property that, that works and then try to be homeowners again after renting for so long <br/><br/><strong>Gouri:</strong> That sounds fantastic. It&#8217;s another example of optimizing for happiness. You&#8217;ve commented that you&#8217;re, you&#8217;re not in this FI space to be evangelical.<br/><br/>You started the blog to kind of keep yourself accountable, right, with an external motivator and. It helps people who are ready, interested in the journey. So this question is really like for a lot of Bogleheads, they&#8217;re the beacon in their community, whether it&#8217;s a social circle or family, people come to them for guidance and advice.<br/><br/>What have you seen in the space? Because there&#8217;s so much advice out there, right? And certain things resonate with some people more than others. Obviously. What have you seen be most effective for the folks that want to improve. They want to save better. They want to invest better, but they find it so incredibly challenged.<br/><br/><strong>Mad Fientist:</strong> Yeah. That&#8217;s yeah, that&#8217;s, that&#8217;s tough. It&#8217;s a tough one for me just because it has come so naturally, like I said before, it&#8217;s just been such a focus in my life for some reason, for so long, I guess it would have to just go back to tracking. And really, so this is a, this is probably a good actual example.<br/><br/>So I have a, I have another personal spreadsheet where just one column will have like all the things, all the big purchases I made that year. And then another column will have&#8230;all the spreadsheet purists are going to be like, &#8220;You don&#8217;t need a spreadsheet for that!&#8221;, but I just love working with cells.<br/><br/>So then I have another column that&#8217;s the highlights of the year. And I think like, obviously if I was struggling with that, I think that would be really beneficial to keep those lists, you know, your big purchases and then your highlights and then revisit it in future years and, you know, tracking your spending is obviously huge.<br/><br/>And I think like, yeah, tracking your spending and then tracking these big purchases, I think would be the first step, because I feel like a lot of people maybe are just buying what other people think, or they see other people doing that and they&#8217;re buying and it&#8217;s certainly not adding to their happiness in any way.<br/><br/>So I think writing those things down and then looking back on it and be like, oh, actually those things weren&#8217;t really that important or that trip wasn&#8217;t that great or eating out wasn&#8217;t that great. So, yeah, but again like I said, I&#8217;m so naturally focused on this stuff that it&#8217;s a bit harder for me to think about what would be really beneficial.<br/><br/>But I think even now, as I&#8217;m trying to come to grips with my new spending patterns, it&#8217;s been helpful for me. And it&#8217;s something that I still do. So it&#8217;s just a recording, all the, all the big purchases, all the highlights, and then trying to figure out, Hmm. What does that mean for what I actually enjoy or get value?<br/><br/><strong>Gouri:</strong> Yeah, that&#8217;s, it&#8217;s definitely helpful to hear. And for folks who, who don&#8217;t know the Mad Fientist compiled a PDF of the one piece of advice, answers that he got from his podcast guests. So that&#8217;s available at madfientist.com/advice. I believe you go to that, enter your email and you&#8217;ll get that.<br/><br/>So in closing, before we turn it over to audience questions, you mentioned James Clear&#8217;s Atomic Habits. I think that&#8217;s a universal favorite. Everyone. I know that&#8217;s read it just kind of swears by it on top of the other habit books out there that proceeded.  It very practical. And you mentioned Ultralearning, any other books you recommend or documentaries? Especially for the Boglehead crowd. Doesn&#8217;t need to be finance-related could be, you know, spanning life?<br/><br/><strong>Mad Fientist:</strong> Yeah. So JL Collins, the author of The Simple Path to Wealth, was my second podcast guests, way back in 2012, way before The Simple Path to Wealth and he had recommended How to Obtain Freedom in an Unfree World by Harry Browne.<br/><br/>And there&#8217;s a lot in that book that I definitely don&#8217;t agree with&#8230;my wife particularly had big issues with some of it. But it did make you think a little bit differently about the boxes you put yourself in and the constraints that are all self-imposed pretty much.  <br/><br/>And back then 2012, you know, FIRE wasn&#8217;t as big of a thing and definitely wasn&#8217;t anywhere near mainstream, like it got to be in 2018. So that helped just with my mindset at like, oh, actually society doesn&#8217;t know best. And these other people don&#8217;t know best. And the things that I think I&#8217;m restricted by are actually your restrictions.  They&#8217;re just my own mental restrictions and I can actually do anything that I really want. So I would say that was a pretty impactful non-financial book. <br/><br/>Early Retirement Extreme. That was what got me into this in the first place. I saw in 2011, I think it was, that JD Roth at Get Rich Slowly had interviewed or had written a book review of Early Retirement Extreme and that, that reads like a academic book, but there&#8217;s a lot of great stuff in there.  I&#8217;ve read it at least three times and finally got to speak to Jacob just last year, which was it was a big thrill for me cause he was the guy that made the light bulb go off in my head.<br/><br/>So yeah, Early Retirement Extreme is still one of my favorites. <br/><br/>So those two, I would read them with an open mind and yeah, they&#8217;re not Bibles, they hopefully get you thinking. <br/><br/><strong>Gouri:</strong> Fantastic. Well, thanks again. I meant to mention earlier when we were talking about relationships that your wife, Jill has a guest post on your blog and also a podcast a conversation that if folks haven&#8217;t listened to, I highly recommend those&#8230;very engaging, very, just warm and enjoyable. So with that Brandon, thanks again.  <br/><br/><strong>Mad Fientist:</strong> Thanks a lot, Gouri. It&#8217;s always a pleasure to chat with you and hopefully we&#8217;ll see you back in Edinburgh soon.<br/><br/><strong>Gouri:</strong> I&#8217;d love that. And likewise.<br/><br/>\n</div>\n\n\n<h2>Related Post</h2><div><a href='https://www.madfientist.com/morgan-housel-interview/' target='_blank'><div class='post_card'><div class='post_card_text'><h3 style='color:#399da8;'>Morgan Housel - The Psychology of Money</h3><p class='post_card_excerpt'>One of my favorite writers, Morgan Housel, shares the investing lessons he's learned from COVID-19, history, and other academic fields!</p></div><div class='post_card_image'><img src='https://www.madfientist.com/wp-content/uploads/2020/09/morgan-housel-interview.jpg' style='border-radius:7px;'/></div></div></a></div><p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/bogleheads-interview/\">Bogleheads &#8211; Life After FIRE</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "wfw:commentRss": "https://www.madfientist.com/bogleheads-interview/feed/",
  "slash:comments": 12,
  "enclosure": ""
}