{
  "title": "ESG Economic Validation Report Predicts DataRobot Can Deliver up to 4.6x Return on Investment&#160;",
  "link": "https://www.datarobot.com/newsroom/press/esg-economic-validation-report-predicts-datarobot-can-deliver-up-to-4-6x-return-on-investment/",
  "dc:creator": "Stephanie Rogers",
  "pubDate": "Thu, 22 Sep 2022 13:00:00 +0000",
  "category": "Press Releases",
  "guid": "https://www.datarobot.com/?p=40387",
  "description": "<p>Analysis finds DataRobot can help organizations produce AI models up to 83% faster, providing 80% cost savings&#160; September 22, 2022 — BOSTON — AI Cloud leader DataRobot today released The Economic Benefits of DataRobot AI Cloud, an independent research report conducted by Enterprise Strategy Group (ESG). The report predicted adopting DataRobot would provide a 3.5x...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.datarobot.com/newsroom/press/esg-economic-validation-report-predicts-datarobot-can-deliver-up-to-4-6x-return-on-investment/\"><strong>ESG Economic Validation Report Predicts DataRobot Can Deliver up to 4.6x Return on Investment&nbsp;</strong></a> appeared first on <a rel=\"nofollow\" href=\"https://www.datarobot.com\">DataRobot AI Cloud</a>.</p>\n",
  "content:encoded": "\n<p><em>Analysis finds DataRobot can help organizations produce AI models up to 83% faster, providing 80% cost savings&nbsp;</em></p>\n\n\n\n<p><strong>September 22, 2022 — BOSTON —</strong> AI Cloud leader <a href=\"https://www.datarobot.com\">DataRobot</a> today released <a href=\"https://www.datarobot.com/esgvaluestudy\">The Economic Benefits of DataRobot AI Cloud</a>, an independent research report conducted by Enterprise Strategy Group (ESG). The report predicted adopting DataRobot would provide a 3.5x to 4.6x expected return on investment (ROI) for organizations across industries.&nbsp;</p>\n\n\n\n<p>For organizations navigating changing market conditions, AI can drive more intelligent business decisions, improve efficiency and identify risks and opportunities. By democratizing access, DataRobot unlocks the power of AI for every function across the business, driving faster time to value, cost savings, and significant return on investment.&nbsp;</p>\n\n\n\n<p>Following a research process that included speaking to DataRobot customers and reviewing existing analytics to quantify DataRobot’s value, ESG found that DataRobot provided its customers with significant savings and benefits, including:&nbsp;</p>\n\n\n\n<ul><li><strong>Improved business outcomes</strong>. DataRobot customers reported accuracy and confidence in the insights generated by DataRobot models and an ability to quickly incorporate these insights into processes that could power more intelligent automated decision-making at scale.&nbsp;</li><li><strong>Faster time to insight</strong>. ESG validated DataRobot’s ability to significantly shorten their time to insight by helping organizations deploy their first model up to 83% faster compared to existing tools and processes, and deliver analytics capabilities to new areas across the organization up to 93% faster.&nbsp;</li><li><strong>Cost savings and operational efficiency at scale</strong>. ESG found that DataRobot can provide cost savings of 75% to 80%, saving one customer surveyed for the report at least two days a week by acting as an accelerator for their data scientists.&nbsp;</li></ul>\n\n\n\n<p>According to ESG, “By simplifying the complexity for non-technical stakeholders and improving the efficiency around analytics operations, DataRobot helped to make higher quality insight derived from efficient analytics models accessible to more stakeholders across the organization. As a result, DataRobot customers reported that they were able to make more intelligent decisions resulting in noticeable outcomes, including improved internal operations, increased revenue, and reduced risk to the business.”</p>\n\n\n\n<p>&#8220;This report validates what we at DataRobot know to be true – we are one of the most widely deployed and proven AI platforms in the market today because we help businesses accelerate impact with AI,&#8221; said Jay Schuren, Chief Customer Officer, DataRobot. &#8220;We&#8217;re proud to offer our customers a platform that makes AI accessible, actionable and cost effective, drastically reducing the time to identify and deploy AI models into production to drive maximum value.&#8221;</p>\n\n\n\n<p>To download the full report, visit: <a href=\"https://www.datarobot.com/esgvaluestudy\">https://www.datarobot.com/esgvaluestudy</a>&nbsp;</p>\n\n\n\n<p><strong>About DataRobot </strong></p>\n\n\n\n<p>DataRobot AI Cloud is the next generation of AI. DataRobot’s AI Cloud vision is to bring together all data types, all users, and all environments to deliver critical business insights for every organization. DataRobot is trusted by global customers across industries and verticals, including a third of the Fortune 50. For more information, visit https://www.datarobot.com/.&nbsp;</p>\n\n\n\n<p class=\"has-text-align-center\">###</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.datarobot.com/newsroom/press/esg-economic-validation-report-predicts-datarobot-can-deliver-up-to-4-6x-return-on-investment/\"><strong>ESG Economic Validation Report Predicts DataRobot Can Deliver up to 4.6x Return on Investment&nbsp;</strong></a> appeared first on <a rel=\"nofollow\" href=\"https://www.datarobot.com\">DataRobot AI Cloud</a>.</p>\n",
  "media:content": ""
}