{
  "title": "3 Questions: Blue hydrogen and the world’s energy systems",
  "link": "https://news.mit.edu/2022/3-questions-emre-gencer-blue-hydrogen-1017",
  "description": "Research Scientist Emre Gençer describes natural gas–based hydrogen production with carbon capture and storage, and the role hydrogen will play in decarbonizing our energy systems.",
  "pubDate": "Mon, 17 Oct 2022 15:50:00 -0400",
  "guid": "https://news.mit.edu/2022/3-questions-emre-gencer-blue-hydrogen-1017",
  "dc:creator": "Turner Jackson | MIT Energy Initiative",
  "content:encoded": "<p><em>In the past several years, hydrogen energy has increasingly become a more central aspect of the clean energy transition. Hydrogen can produce clean, on-demand energy that could complement variable renewable energy sources such as wind and solar power. That being said, pathways for deploying hydrogen at scale have yet to be fully explored. In particular, the optimal form of hydrogen production remains in question.</em></p>\n\n<p><em>MIT Energy Initiative Research Scientist Emre Gençer and researchers from a wide range of global academic and research institutions recently published “<a href=\"https://pubs.rsc.org/en/content/articlelanding/2022/SE/D1SE01508G\">On the climate impacts of blue hydrogen production</a>,” a comprehensive life-cycle assessment analysis of blue hydrogen, a term referring to natural gas-based hydrogen production with carbon capture and storage. Here, Gençer describes blue hydrogen and the role that hydrogen will play more broadly in decarbonizing the world’s energy systems. </em></p>\n\n<p><strong>Q: </strong>What are the differences between gray, green, and blue hydrogen?</p>\n\n<p><strong>A: </strong>Though hydrogen does not generate any emissions directly when it is used, hydrogen production can have a huge environmental impact. Colors of hydrogen are increasingly used to distinguish different production methods and as a proxy to represent the associated environmental impact. Today, close to 95 percent of hydrogen production comes from fossil resources. As a result, the carbon dioxide (CO<sub>2</sub>) emissions from hydrogen production are quite high. Gray, black, and brown hydrogen refer to fossil-based production. Gray is the most common form of production and comes from natural gas, or methane, using steam methane reformation but without capturing CO<sub>2</sub>.</p>\n\n<p>There are two ways to move toward cleaner hydrogen production. One is applying carbon capture and storage to the fossil fuel-based hydrogen production processes. Natural gas-based hydrogen production with carbon capture and storage is referred to as blue hydrogen. If substantial amounts of CO<sub>2</sub> from natural gas reforming are captured and permanently stored, such hydrogen could be a low-carbon energy carrier. The second way to produce cleaner hydrogen is by using electricity to produce hydrogen via electrolysis. In this case, the source of the electricity determines the environmental impact of the hydrogen, with the lowest impact being achieved when electricity is generated from renewable sources, such as wind and solar. This is known as green hydrogen.</p>\n\n<p><strong>Q: </strong>What insights have you gleaned with a life cycle assessment (LCA) of blue hydrogen and other low-carbon energy systems?</p>\n\n<p><strong>A: </strong>Mitigating climate change requires significant decarbonization of the global economy. Accurate estimation of cumulative greenhouse gas (GHG) emissions and its reduction pathways is critical irrespective of the source of emissions. An LCA approach allows the quantification of the environmental life cycle of a commercial product, process, or service impact with all the stages (cradle-to-grave). The LCA-based comparison of alternative energy pathways, fuel options, etc., provides an apples-to-apples comparison of low-carbon energy choices. In the context of low-carbon hydrogen, it is essential to understand the GHG impact of supply chain options. Depending on the production method, contribution of life-cycle stages to the total emissions might vary. For example, with natural gas–based hydrogen production, emissions associated with production and transport of natural gas might be a significant contributor based on its leakage and flaring rates. If these rates are not precisely accounted for, the environmental impact of blue hydrogen can be underestimated. However, the same rationale is also true for electricity-based hydrogen production. If the electricity is not supplied from low- carbon sources such as wind, solar, or nuclear, the carbon intensity of hydrogen can be significantly underestimated. In the case of nuclear, there are also other environmental impact considerations.</p>\n\n<p>An LCA approach — if performed with consistent system boundaries — can provide an accurate environmental impact comparison. It should also be noted that these estimations can only be as good as the assumptions and correlations used unless they are supported by measurements.&nbsp;</p>\n\n<p><strong>Q: </strong>What conditions are needed to make blue hydrogen production most effective, and how can it complement other decarbonization pathways?</p>\n\n<p><strong>A: </strong>Hydrogen is considered one of the key vectors for the decarbonization of hard-to-abate sectors such as heavy-duty transportation. Currently, more than 95 percent of global hydrogen production is fossil-fuel based. In the next decade, massive amounts of hydrogen must be produced to meet this anticipated demand. It is very hard, if not impossible, to meet this demand without leveraging existing production assets. The immediate and relatively cost-effective option is to retrofit existing plants with carbon capture and storage (blue hydrogen).</p>\n\n<p>The environmental impact of blue hydrogen may vary over large ranges but depends on only a few key parameters: the methane emission rate of the natural gas supply chain, the CO<sub>2</sub> removal rate at the hydrogen production plant, and the global warming metric applied. State-of-the-art reforming with high CO<sub>2</sub> capture rates, combined with natural gas supply featuring low methane emissions, substantially reduces GHG emissions compared to conventional natural gas reforming. Under these conditions, blue hydrogen is compatible with low-carbon economies and exhibits climate change impacts at the upper end of the range of those caused by hydrogen production from renewable-based electricity. However, neither current blue nor green hydrogen production pathways render fully “net-zero” hydrogen without additional CO<sub>2</sub> removal.</p>\n\n<p><em>This article appears in the&nbsp;<a href=\"https://energy.mit.edu/energy-futures/spring-2022/\">Spring 2022 issue</a> of&nbsp;</em>Energy Futures<em>, the magazine of the MIT Energy Initiative.</em></p>",
  "media:content": {
    "media:description": "Colors of hydrogen are increasingly used to distinguish different production methods and as a proxy to represent the associated environmental impact. Natural gas-based hydrogen production with carbon capture and storage is referred to as blue hydrogen."
  },
  "category": [
    "MIT Energy Initiative",
    "Energy",
    "Alternative energy",
    "Renewable energy",
    "Sustainability",
    "Climate change",
    "Emissions",
    "Greenhouse gases",
    "Carbon sequestration",
    "Interview",
    "Research"
  ]
}