{
  "id": "yt:video:tOkch_7GrU0",
  "yt:videoId": "tOkch_7GrU0",
  "yt:channelId": "UCZRoNJu1OszFqABP8AuJIuw",
  "title": "Why Saudi Arabia Has Destroyed 98% Of Mecca Since 1985",
  "link": "",
  "author": {
    "name": "Logically Answered",
    "uri": "https://www.youtube.com/channel/UCZRoNJu1OszFqABP8AuJIuw"
  },
  "published": "2022-10-03T19:00:17+00:00",
  "updated": "2022-10-04T17:40:41+00:00",
  "media:group": {
    "media:title": "Why Saudi Arabia Has Destroyed 98% Of Mecca Since 1985",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Saudi Arabia is not only home to the world’s second-largest oil reserves, but they’re also home to one of the most important religious locations: Mecca. Mecca plays a major role in Islam as it is where Mohammed the Prophet was born. Most Muslims try to pilgrimage to Mecca at least once in their lifetimes through something called the Hajj. Given the importance of this city and the wealth of Saudi Arabia, you would think that Saudi Arabia would try to protect the city as much as possible. Yet, they’ve actually been doing the exact opposite. For centuries, Saudi Arabians, and more specifically the Wahhabis have been constantly taking down relics and destroying various buildings in the city. Their reasoning for this is that they’re trying to prevent people from worshipping relics and monuments, but the truth may have more to do with retaining power and control. This video explains why Saudi Arabia has destroyed 98% of Mecca within just the past few decades alone. \n\nDiscord Community: \nhttps://discord.gg/SJUNWNt\n\nTimestamps:\n0:00 - Mecca’s Destruction\n2:12 - Wahhabism\n5:18 - Thirst For Power\n8:39 - Escalating Resentment\n10:47 - State Of Mecca\n\nThumbnail Credit: \nPrakash Singh\nhttps://bit.ly/3SNd8rc\nBarclay Fernandez/Victoria Advocate\nhttps://bit.ly/3Rqxzcd\n\nResources: \nhttps://pastebin.com/r2DNJH7R",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}