{
  "id": "tag:blogger.com,1999:blog-19803222.post-1653493325905841469",
  "published": "2017-03-09T07:50:00.000-07:00",
  "updated": "2017-03-09T08:13:00.409-07:00",
  "title": "Awesome people: Ellen Riloff (IWD++)",
  "content": "To honor women this <a href=\"https://www.internationalwomensday.com/\">International Women's Day</a>, I have a several posts, broadly around the topic of women in STEM. Previous posts in this series include: <a href=\"https://nlpers.blogspot.com/2017/03/awesome-people-bonnie-dorr-iwd.html\">Awesome People: Bonnie Dorr</a>.<br /><br /><a href=\"https://www.cse.unt.edu/seminars/EllenRiloff.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"https://www.cse.unt.edu/seminars/EllenRiloff.jpg\" /></a>Today is the continuation of the theme \"who has been influential in my career and helped me get where I am?\" and in that vein, I want to talk about <i>another</i> awesome person: <a href=\"http://www.cs.utah.edu/~riloff/\">Ellen Riloff</a>. Ellen is a professor of computer science at the <a href=\"http://www.cs.utah.edu/\">University of Utah</a>, and literally taught me everything I know about being a professor. I saw a joke a while ago that the transition from being a PhD student to a professor is like being trained for five years to swim and then being told to drive a boat. This was definitely true for me, and if it weren't for Ellen I'd have spent the past N years barely treading water. I truly appreciate the general inclusive and encouraging environment I belonged to during my time at Utah, and specifically appreciate everything Ellen did. When I think of Ellen as a researcher and as a person, I think: <i>honest</i> and <i>forthright</i>.<br /><br />Ellen is probably best known for her work on bootstrapping (for which she and Rosie Jones received a <a href=\"http://www.aaai.org/Awards/classic.php\">AAAI Classic Paper award</a> in 2017) and information extraction (AAAI Classic Paper honorable mention in 2012), but has also worked more broadly on coreference resolution, sentiment analysis, active learning, and, in a wonderful project that also reveals <a href=\"http://www.cs.utah.edu/~riloff/personal.html\">her profound love of animals</a>, <a href=\"http://www.aclweb.org/website/old_anthology/N/N15/N15-1168.pdf\">veterinary medicine</a>. Although I only \"officially\" worked on one project with her (on <a href=\"http://www.aclweb.org/anthology/D/D10/D10-1008.pdf\">plot units</a>), her influence on junior-faculty-Hal was deep and significant.<br /><br />I would be impossible to overstate how much impact Ellen has had on me as a researcher and a person. I still remember on my first NSF proposal, I sent her a draft and her comment main was \"remove half.\" I was like \"nooooooo!!!!\" But she was right, and ever since them I try to repeat this advice to myself every time I write a proposal now.<br /><br /><a href=\"http://www.isi.edu/projects/sciknowmine/sciknowmine_release_workshop_-_bridging_bionlp_and_biocuration\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://i1.ytimg.com/vi/gHBsiEsw4_c/mqdefault.jpg\" /></a>One of the most important scientific lessons I learned from Ellen is that how you construct your data matters. NLP is a field that's driven by the existence of data, but if we want NLP to be meaningful at all, we need to make sure that that data means what we think it means. Ellen's attention to detail in making sure that data was selected, annotated, and inspected correctly is deeper and more thoughtful than anyone else I've ever known. When we were working on the plot units stuff, we each spent about 30 minutes annotating a single fable, followed by another 30 minutes of adjudication, and then reannotation. I think we did about twenty of them. Could we have done it faster? Yes. Could we have had mechanical turkers do it? Probably. Would the data have been as meaningful? Of course not. Ellen taught me that when one releases a new dataset, this comes with a huge responsibility to make sure that it's carefully constructed and precise. Without that, the number of wasted hours of others that you run the risk of creating is huge. Whenever I work on building datasets these days, the Ellen-level-of-quality is my (often unreached) aspiration point.<br /><br />I distinctly remember a conversation Ellen and I had about advising Ph.D. students in my first or second year, in which I mentioned that I was having trouble figuring out how to motivate different students. Somewhat tongue-in-cheek, Ellen pointed out that different students are actually different people. Obvious (and amusing) in retrospect, but as I never saw my advisor interacting one on one with his other advisees, it actually had never occurred to me that he might have dealt with each of us differently. Like most new faculty, I also had to learn how to manage students, how to promote their work, how to correct them when they mis-step (because we all mis-step), and also how to do super important things like write letters. All of these things I learned from Ellen. I still try to follow her example as best I can.<br /><br />I was lucky enough to have the office just-next-door to Ellen, and we were both in our offices almost every weekday, and her openness to having me stick my head in her door to ask questions about anything from what are interesting grand research questions to how to handle issues with students, from how to write proposals to what do you want for lunch, was amazing. I feel like we had lunch together almost every day (that's probably an exaggeration, but that's how I remember it), and I owe her many thanks for helping me flesh out research ideas, and generally function as a junior faculty member. She was without a doubt the single biggest impact on my life as junior faculty, and I remain deeply indebted to her for everything she did directly and behind the scenes.<br /><br />Thanks Ellen!",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "hal",
    "uri": "http://www.blogger.com/profile/02162908373916390369",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 2
}