{
  "id": "yt:video:c08FwvZk0UM",
  "yt:videoId": "c08FwvZk0UM",
  "yt:channelId": "UCZRoNJu1OszFqABP8AuJIuw",
  "title": "Why Microsoft Has Been Hiding From You",
  "link": "",
  "author": {
    "name": "Logically Answered",
    "uri": "https://www.youtube.com/channel/UCZRoNJu1OszFqABP8AuJIuw"
  },
  "published": "2022-10-17T19:00:10+00:00",
  "updated": "2022-10-19T21:49:53+00:00",
  "media:group": {
    "media:title": "Why Microsoft Has Been Hiding From You",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Have you noticed that Microsoft is one of the most discrete tech companies in the world? Compared to Facebook, Google, and Apple, interest in Microsoft is virtually non-existent. They’re rarely in the news and even though the average person knows about them, they rarely talk about Micorosft and they don’t really have any strong opinions about Microsoft. At first, this might just seem like a random attribute, but this is actually very much on purpose. You see, Microsoft was very much a public company before the 2000s, and Bill Gates’ reputation was similar to that of Mark Zuckerberg’s today. But, all of this changed when a lawsuit nearly split up Microsoft into two different companies for being a monopoly. Ever since then, Microsoft has been avoiding the spotlight to avoid drawing excessive public criticism, and it seems like it’s working. Almost all of the criticism of big tech goes to Google and Facebook nowadays. This video explains how Microsoft slowly disappeared into the background and diverted attention away from their own monopoly. \n\nDiscord Community: \nhttps://discord.gg/SJUNWNt\n\nTimestamps:\n0:00 - Microsoft’s Profit Margins\n2:27 - The Public Monopoly\n5:27 - Saving The Monopoly\n8:28 - Transition To B2B\n11:18 - The New Microsoft\n\nThumbnail Credits:\nJohn Keatley/Redux/Eyevine\nhttps://bit.ly/3VvGQD9\nLior Patel/Alarmy\nhttps://bit.ly/2NZkzKy\n\nResources: \nhttps://pastebin.com/etp9Z1xN",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}