{
  "title": "TU129 &#8211; Transformative Psychedelic Experiences With and Without Drugs, with Special Guest, Trey Ratcliff",
  "link": "https://therapistuncensored.com/episodes/tu129-non-drug-psychedelic-therapy-trey-ratcliff/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu129-non-drug-psychedelic-therapy-trey-ratcliff",
  "pubDate": "Tue, 25 Aug 2020 06:00:41 +0000",
  "guid": "https://therapistuncensored.com/?p=10761",
  "description": "What if you could get the benefits of therapeutic psychedelics without ingesting any drugs?!  Trey Ratcliff&#039;s new art creations, Machine Elves, may just have such an answer with non-drug, mind-expanding experiences that can help us heal.  In this concluding episode of Season 4, co-host Sue Marriott is joined by photographer, artist and consciousnesses-raiser Trey Ratcliff.  They dive right into the exotic world of mind-enhancing experiences.  This includes both psychedelics but also non-drug experiences that can bring the promising results that are emerging from carefully studied psychedelic research.",
  "enclosure": "",
  "itunes:subtitle": "Mind-expanding therapies, new research and new ideas to transform and heal humans.  Trey Ratcliff & Sue Marriott discuss therapy and challenges to the mind.",
  "itunes:summary": "What if you could get the benefits of therapeutic psychedelics without ingesting any drugs?!  Trey Ratcliff&#039;s new art creations, Machine Elves, may be just the direction for non-drug, mind-expanding experiences that can help us heal.  In this concluding episode of Season 4, co-host Sue Marriott is joined by photographer, artist and consciousnesses-raiser Trey Ratcliff.  They dive right into the exotic world of mind-enhancing experiences, includes both psychedelics but also non-drug experiences that can bring the promising results that are emerging from carefully studied psychedelic research.  See more at www.therapistuncensored.com/episodes",
  "itunes:author": "Trey Ratcliff, Sue Marriott",
  "itunes:image": "",
  "itunes:season": 4,
  "itunes:episode": 129,
  "itunes:title": "Transformative Psychedelic Experiences With and Without Drugs, with special guest, Trey Ratcliff",
  "itunes:duration": "50:01"
}